{"title": "Chapter 6: Just Kill Me, Alright?!", "id": 6, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-6-just-kill-me-alright", "volume_title": "Volume 1", "body": "<h1>Chapter 6: Just Kill Me, Alright?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 6: Just Kill Me, Alright?!</p><br/><p>Even though he had never seen Li Xueyi before, he had gotten this portrait from his subordinate a few days ago. It was also due to this portrait that he came in person, hoping to personally get rid of Li Xueyi.</p><br/><p>As for Mu Ye’s appearance, the entire world had portraits of him, yet Li Xueyi was actually pretending that he didn’t recognize him and even purposefully took liberties with him. This just further supported the rumors that Li Xueyi was matchlessly cunning with extremely deep schemes.</p><br/><p>Looking at the portrait, Tang Doudou also could not say anything for a while. Mah god, this was simply a coincidence within coincidences.</p><br/><p>But… Her heart also gave a thump. If she had transmigrated over as a soul and this body is that annoying pain-in-the-something Li Xueyi’s, then that really is her!</p><br/><p>Isn’t this way too much of a fraud?!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou tugged at the lower hem of her garment, an extremely important question suddenly occurring to her. </p><br/><p>If she remembered correctly, Li Xueyi should be a man!</p><br/><p>Therefore!</p><br/><p>Tang Doudou immediately reached down to touch her crotch area.</p><br/><p>Meanwhile, the face of the man in the attic and Mu Ye’s face both turned black. A blood-red blade that was thin as a cicada’s wing appeared in that man’s slender fingers.</p><br/><p>Mu Ye crossed over with large steps and grabbed Tang Doudou’s hand as he said in a chilling tone, “What are you doing!”</p><br/><p>“I, I’m to… touching…. Hehe…” Tang Doudou almost said touching her penis. Fortunately, Mu Ye’s gaze was frightening enough to scare her into swallowing back the words in her mouth and giving a forced laugh instead.</p><br/><p>Luckily- luckily she wasn’t a hermaphrodite!</p><br/><p>Li Xueyi was way too disgusting. Mu Ye, with one swipe, shook off her hand. Even though Tang Doudou didn’t say it straight out, but in that area, besides that thing what else was there to touch? What a waste. Li Xueyi had such good martial art but was actually such a vulgar person. It couldn’t be that because he touched him earlier, he got aroused and couldn’t restrain his emotions so he wanted to…</p><br/><p>The more Mu Ye thought about it, the uglier his expression got. He felt that killing Li Xueyi like this was way too easy and wouldn’t serve to dissolve his anger. Since he liked men, then it’d be best to just grant it to him!</p><br/><p>His eyes darkened. Turning away he commanded his subordinates, “Tie him up, bring him back!”</p><br/><p>“Yes, Leader!”</p><br/><p>“Hey, hey!” Tang Doudou looked at the black-clothed men who were approaching with rope then hurriedly flipped over and jumped up. “If you want to kill or cut do it more straightforwardly, you can’t tie me up!”</p><br/><p>Heavens know where they’ll take her back to. She’s not stupid. She could tell from Mu Ye’s expression that he wouldn’t let her off easily. Rather than being brought to god-knows-where to be tormented, she would rather be allowed to just die here. Not to mention she might actually be able to transmigrate back!</p><br/><p>Mu Ye didn’t even glance at her, he just turned and left.</p><br/><p>How could Tang Doudou let him leave just like that? She jumped up and kicked the thigh of the black-clothed man in front of her, then rushed towards Mu Ye. “Just kill me, alright?!”</p><br/><p>Mu Ye watched coldly as Tang Doudou ran over. What trick did he want to play now? Could it be during the time that was stalled, the effect of the Tendons Softening Powder had worn off?</p><br/><p>The room wasn’t large from the start. Tang Doudou didn’t even have to run two steps before she managed to get to Mu Ye. Unfortunately, she truly ran too anxiously and Mu Ye just happened to be standing next to the doorstep. Therefore, even though she promptly braked, inertia allowed Tang Doudou to brush beautifully past Mu Ye’s body. One foot tripped over the doorstep and with a thump she heavily fell onto the floor, stirring up a wave of dust.</p><br/><p>Omaigah*, her little meat buns!</p><br/>\n</div>"}