{"title": "Chapter 8: Yet Another Beautiful Man Arrives", "id": 8, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-8-yet-another-beautiful-man-arrives", "volume_title": "Volume 1", "body": "<h1>Chapter 8: Yet Another Beautiful Man Arrives</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 8: Yet Another Beautiful Man Arrives</p><br/><p>“What’s going on?” Right at that moment, an elegant gongzi dressed in white walked out from within Rutaceae Pavilion. His features were exquisite and elegant; the hems of his clothes fluttered along with the wind. In a blink, he reached that servant’s side.</p><br/><p>Seeing him, the servant immediately cupped his fist in salute. “Bai gongzi.”</p><br/><p>“Just then you cried ‘oh no’, what was the reason?” Bai Feiyun asked once again.</p><br/><p>“Replying gongzi, that person’s invitation card has a problem!” Speaking of this, the servant became angry and started grinding his teeth. If not for the fact that the person standing in front of him was Bai Feiyun, he would have immediately ran to find that person to get even with him. It was seriously way too hateful, to actually use a fake invitation card to fool him! It was as he first thought, how could there possibly be people from the Imperial Court coming to this martial arts convention? Not to mention the one that came was the Sangfroid Prince!</p><br/><p>If he hadn’t been so shocked, how could that guy have managed sneak in so easily!</p><br/><p>Bai Feiyun took in the servant’s angry expression. He smiled faintly and extended his hand. “So it’s like that. Let me see the invitation.”</p><br/><p>This was the famous jade gongzi of Jianghu; his smile was warm to the point it was as beautiful as the scenery in March.</p><br/><p>“This is the invitation!” The servant was also affected by Bai Feiyun’s smile and immediately took out that Sangfroid Prince’s invitation card from the tray next to him.</p><br/><p>Bai Feiyun took the card. His slender fair fingers paused on its surface for a moment before he flipped it open.</p><br/><p>Sangfroid Prince Xi Qiuyue?</p><br/><p>Opening the invitation, five familiar words entered his eyes. Bai Feiyun’s eyes slightly flickered and he closed the card. To the servant, he said, “Pay attention next time. I’ll go inform your pavilion master of this incident.”</p><br/><p>“Then thank you for your trouble Bai gongzi!” The servant looked at Bai Feiyun with gratitude. If he had to find the pavilion master himself, a punishment was unavoidable. But if this Bai gongzi went it wouldn’t be the same!</p><br/><p>Bai Feiyun put away the invitation and turned to head back.</p><br/><p>Seeing that he really was heading towards the direction of the pavilion master, the servant’s heart finally settled down. He proceeded to continue taking the guests’ invitations and carefully examined them.</p><br/><p>Compared to the lively scene outside Rutaceae Court, this path that Tang Doudou was currently walking on could be described as dreadfully silent.</p><br/><p>She did see vague human figures that seemed to be just ahead. But no matter how much she walked, even after she walked her legs to the point that they seemed about to break and was gasping for breath, she was still very far away from that place.</p><br/><p>Seriously! She’s tired as bean cakes!</p><br/><p>Tang Doudou plopped her butt down under a large tree on the side of the road and wiped off the sweat on her face as she silently cursed at the messed up personalities of the people that build this place. It was a place that could clearly be reached very quickly with a straight line, yet you had to wind here wind there endlessly. Following this damned path was on par with walking in a labyrinth! Massaging her thighs with both her hands, she looked wearily towards the bright star-lit night sky. A crescent moon was hanging overhead; its pure, cool, white light spilled towards the ground, drawing out the image of Tang Doudou’s solitary shadow. What a great picture of desolace.</p><br/><p>Really want to sleep, wish that when her eyes open again she could see a familiar bed, a familiar room…</p><br/><p>Ai! Meow a mi, seriously! What deity did she, Doudou, provoke for her to be thrown into this kind of lousy place!?</p><br/><p>Giving a long sigh, Tang Doudou lowered her eyes. She spaced out as she stared at the shadows on the ground. Could she still return?</p><br/><p>“What are you thinking about?” Suddenly a voice came from behind her, startling Tang Doudou and making her hurriedly turn around. But unexpectedly, in front of her was a mass of black. With a ‘bonk’ she was knocked into the person so hard stars and planets were spinning!</p><br/><p>“I swear, the hell you have eyes and legs for ah!? Didn’t you see that there was someone in front!? Keep a safe driving distance, don’t you know!!?” Tang Doudou had already been tormented several times and was already angry due to that. This time she was knocked into to the point her head spun and she had blurred vision, so she couldn’t hold it back anymore and exploded. She also didn’t look clearly at who the person in front of her was and just sprouted a stream of curses.</p><br/><p>“What is driving distance?” A gentle voice came from nearby. Tang Doudou looked in that direction and only saw that not far away from here, a jade-like gongzi dressed in white had at some unknown time arrived under the tree with captivating blossoms. His slightly wrinkled brows were like the green hills in midst of misty rain, tranquil and beautiful.</p><br/>\n</div>"}