{"title": "Chapter 3: A Bunch of Black Clothed Men Came", "id": 3, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3-a-bunch-of-black-clothed-men-came", "volume_title": "Volume 1", "body": "<h1>Chapter 3: A Bunch of Black Clothed Men Came</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 3: A Bunch of Black Clothed Men Came</p><br/><p>Eh, wasn’t this still her face?</p><br/><p>Tang Doudou tilted the mirror left and right. It was her familiar brows and eyes, her familiar looks… Even though she was dressed in the manner of men in olden times, this was still her, Tang Doudou! Tang Doudou’s heart finally dropped back to its proper place when she these familiar features. She laughed foolishly with relief and with a ‘pah’, plopped down the mirror on the table next to her.</p><br/><p>Her gaze then landed on her own large palm. Lord! Could this really be a prop?</p><br/><p>It was way too realistic. She had almost been fooled.</p><br/><p>Tang Doudou couldn’t help but start feeling a strong sense of curiosity towards this show, but how was she supposed to keep acting in this unpredictable situation?</p><br/><p>She swept an eye over the confused crowd of women who were completely confounded by her series of actions. Tang Doudou didn’t care though and simply spread apart her legs in an imposing manner. She then leaned forward slightly and bent her fingers to rap the table sharply, giving off a very displeased aura.</p><br/><p>“Go call the person in charge over.”</p><br/><p>After she surveyed the scene, she noticed that she was the only one who had on a whiter-than-snow garment. Her facial features were handsome and lively. With her unconcerned expression and her mouth hooked into a crooked smile, she looked like a very charming and elegant youngster.</p><br/><p>The women looked to each another in dismay, momentarily unable to react to Tang Doudou’s words.</p><br/><p>Person in charge? The Madam?</p><br/><p>Tang Doudou saw that they were still pretending to be confused and laughed coldly. “Stop pretending, I already know everything. Hurry and get your boss. If you want me to act, we need to negotiate the price first. I don’t do free work.”</p><br/><p>Boom boom boom!</p><br/><p>Just at this moment, following the sound of an explosion, eight black-clothed men wielding blades suddenly dropped down from the roof. The shining blades and swords flashed with cold light, causing all the women to scream and scatter with fear. In just a blink, not a shadow of a woman was left.</p><br/><p>Tang Doudou calmly watched all of this as she lifted up the teacup on the table. Oh, the play’s getting bigger and bigger ah!</p><br/><p>The leading black-clothed man approached with a menacing air. He was not surprised to see that Tang Doudou was completely unconcerned. “Li Xueyi, as expected, it is you!”</p><br/><p>…</p><br/><p>Tang Doudou’s eyes slightly paused and her gaze wandered. When it came back around to meet the black-clothed man’s direct gaze, Tang Doudou finally confirmed that he was currently addressing her.</p><br/><p>She couldn’t help but sweep a disdain-filled gaze over the leading black-clothed man. They probably walked into the wrong production. They even called her name wrong!</p><br/><p>It’s unknown if it was because Tang Doudou’s disdainful expression provoked the black-clothed man or if it was due to some other reason, but the black-clothed man showed no desire to waste words and with a ‘swoosh’, the blade in his hand swung over.</p><br/><p>Tang Doudou thought that the sword was just a stage prop. She didn’t even lift an eyelid as the black-clothed man slashed it over.</p><br/><p>How can he be so calm?! Could it be that there’s a trap? These thoughts flashed through the black-clothed man’s head, but the blade in his hand did not stop at all.</p><br/><p>It was widely known in the Jianghu that Li Xueyi was a sanctimonious, treacherous, and crafty hypocrite. His whereabouts were always elusive, like a dragon god whose head could be seen but whose tail could not be found. There were very few people that had seen him before.</p><br/><p>Before, when the man had received news that Li Xueyi had arrived in Huai City, he thought it was just a false rumor. However, holding the mentality that he would rather wrongly kill a hundred in order to not miss one, he still kept watch over the largest brothel in Huai City, Rutaceae Pavilion, in order to wait for Li Xueyi to show up.</p><br/><p>Li Xueyi preferred places with prostitutes and countless ladies – this was something everyone in Jianghu knew.</p><br/><p>After waiting a full half a month in Rutaceae Pavilion, finally, when the color of the sky turned towards night on this day, a snow-white figure appeared outside Rutaceae Pavilion.</p><br/><p>Afterwards, everything advanced according to plan, all the way up to this step in which Li Xueyi drank that cup of wine he had meticulously prepared…</p><br/><p>All the steps quickly flashed through the black-clothed person’s mind, every single detail was within predictions. There had not been a single mistake. Tendons Softening Powder, which would make Li Xueyi incapable of using martial arts for a period of time, was mixed into that cup of wine. The timing had been calculated perfectly, so right now, Li Xueyi should have no strength at all to resist.</p><br/><p>Speaking is slow time is fast*, in an instant the blade approached Tang Doudou’s eyes. Cold light radiated from it, it was dazzling to the point that both Tang Doudou’s eyes were blinded so she instinctively moved her head away.</p><br/><p>“speaking is slow, time is fast” is a phrase commonly used in novels. It means that the speed at which things happen isn’t something the narrative can keep up with. So though it seemed like things happened slowly since there was a lot of blab, it actually happened way faster.</p><br/><p>Clang!</p><br/>\n</div>"}