{"title": "Chapter 4: Life Hanging By a Thread", "id": 4, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4-life-hanging-by-a-thread", "volume_title": "Volume 1", "body": "<h1>Chapter 4: Life Hanging By a Thread</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 4: Life Hanging By a Thread</p><br/><p>The blade, in passing, cut into the back of the chair behind her and the top quality redwood split in response. A huge force jolted the chair, breaking it into pieces. Wood chips fell with ‘plop plop plop’s.</p><br/><p>Tang Doudou, who was sitting on the chair, was stupefied and fell with those wood chips to the ground. Thousands of grass mud horses* wildly trampled through her little heart. What the serious f*ck!? Where did this play get produced!?</p><br/><p>“grass mud horses” is pronounced “cao3 ni2 ma3”, used as a substitute for “cao4 ni3 ma1” which means f*** your mom.</p><br/><p>She lifted her eyes to meet the cold eyes of the black-clothed man. There was no doubt that she would be split into two by that sharp knife if she continued to be a sitting duck.</p><br/><p>But she had already been scared silly, ok!? The two legs simply did not listen to orders anymore. All she could do was sit on the floor and foolishly stare back at that black-clothed man.</p><br/><p>They’ve agreed that it’s an act, how did it turn into being real swords and spears!?</p><br/><p>Wasn’t this too deceptive!?</p><br/><p>Seeing Tang Doudou fall to the ground, the black-clothed man closed in step by step. Lifting up the blade in his hands, he was able to chop down again.</p><br/><p>Tang Doudou’s back was covered with cold sweat as she stared at the falling blade.</p><br/><p>WTF! Could it be that she, Tang Doudou, with her lifetime of illustrious name, must die a violent death?</p><br/><p>The door of the room was wide open. Everything in this room could be seen clearly from the attic that was perfectly diagonally aligned with this room.</p><br/><p>A man laid languidly on a soft couch, his exquisite slender fingers were covered by long silver-white sleeves. The candle light illuminated a trace of stunning beauty and splendor. He was unhurriedly twirling a jade tablet in his hand, seeming to be casually fiddling with it.</p><br/><p>Found a fitting picture for once!</p><br/><p>Jade Tablet</p><br/><p>The man lay reclined. His appearance could not be clearly seen, but just this trace of a silhouette was enough to tell of his magnificent style.</p><br/><p>His gaze, from start to finish, never moved away from Tang Doudou’s figure. Seeing that blade swing down, his fingers bent slightly but then loosened again.</p><br/><p>It has finally come, after all this waiting.</p><br/><p>How could Tang Doudou possibly know that besides this group of black-clothed men, there was actually another person paying attention to each and every move that went on here? At this time, the blade was right before her eyes. She was scared to death, yet her legs failed to live up to expectations and refused to move even the slightest bit.</p><br/><p>Her forehead was about to ooze sweat as her eyes fixated rigidly on that sword. When the blade was only a few centimeters away she shouted, “Stop!”</p><br/><p>The black-clothed man’s hand paused in response to this sudden utterance. Confusion flashed through his eyes, but soon after, it was replaced by fierceness and the blade slashed down once again.</p><br/><p>“I’m not Li Xueyi!”</p><br/><p>Tang Doudou looked at that dazzling blade and was almost about to cry. Bastard* she’s Tang Doudou ah! What Li Xueyi? She doesn’t even have a feather of a connection with that person, alright!?</p><br/><p>This novel is like a crash course on slang and cuss words, lol.  (ya de) is a shortened version of  = raised by a servant which = bastard child/illegitimate child. It’s not really cussing at him though, it’s like remarking ‘shit’.</p><br/><p>“You’re not Li Xueyi?”</p><br/><p>Tang Doudou hastily nodded as if she was a chick pecking at rice. With matchless sincerity, she looked at the black-clothed man. “That’s right, you guys have the wrong person. I’m not some Li Xueyi, I’m called Tang Doudou. Tang of the Tang Dynasty, Dou from beans!”</p><br/><p>“Tang Doudou?” repeated the black-clothed man. Then he said, “As if I care whether you’re a sweet bean or sour bean, all who show up here must die!”</p><br/><p>Sweet(tang) is a homophone of the tang in TDD’s name.</p><br/><p>What the hell, how can you be so unreasonable! Tang Doudou glared angrily at the black-clothed man. “Treating human life as grass to ravage at will, does the law of the land still exist!?”</p><br/><p>The black-clothed man was speechless for a spell. He never thought the words ‘law of the land’ would actually emerge from Li Xueyi’s mouth, the world was truly large to the point that nothing was too bizarre!</p><br/><p>Why wasn’t he speaking anymore? Heh! He must have been intimidated! He’s probably incapable of refuting?</p><br/><p>Tang Doudou extended a finger to stroke her smooth chin. Her face was completely smug and she secretly giggled inside her heart.</p><br/><p>Seeing this, the black-clothed man’s eyes slightly lowered and he closed in once more. Tang Doudou who was rejoicing covertly completely did not have her guard up and he was able to clutch her neck. “Li Xueyi, you know too much!”</p><br/><p>Cough cough cough! Tang Doudou felt uncomfortable to death as he gradually closed his fingers.</p><br/><p>Know a damned egg! What did she know!? She didn’t know a single thing, ok!</p><br/><p>The black-clothed man’s fingers were like steel pincers. Tang Doudou pried at them like her life depended on it but couldn’t get them apart. She could feel the amount of air going into her lungs decrease and her head felt uncomfortable as if it was about to explode.</p><br/><p>She chaotically waved her hands. During the struggle, she pulled off the mask of the black-clothed man.</p><br/>\n</div>"}