{"title": "Chapter 11: The Most Vicious Men Have Paper Hearts", "id": 11, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-11-the-most-vicious-men-have-paper-hearts", "volume_title": "Volume 1", "body": "<h1>Chapter 11: The Most Vicious Men Have Paper Hearts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11: The Most Vicious Men Have Paper Hearts</p><br/><p>“How about it, buddy? Think about it! This deal is definitely worthwhile!” Tang Doudou was still trying to sell this idea with all her might. She extended her hand to seize Bai Feiyun’s shoulder, attempting to pull their relationship closer by putting her arm around his shoulder.</p><br/><p>But who would have expected that the moment her hand had just come into contact with his shoulder, she felt a pain under her armpit as if she had been pierced by a needle.</p><br/><p>Grimacing with a squeak, she reached out to touch which caused her to immediately feel another pang of pain and retract her hand. Goddamn chicken, who’s that f’ing cruel to put a needle in her armpit!E/N</p><br/><p>Her gazed brushed down then looked towards Bai Feiyun.</p><br/><p>The latter’s eyes projected a warning. Light flashed off the needle between his fingers. “Get fresh again and I’ll snap off your root.”</p><br/><p>After saying his, his gaze lightly swept over Tang Doudou’s lower body.</p><br/><p>A chill hit the area below her crotch. She sent an aggrieved look towards Bai Feiyun. ‘The most vicious men have paper hearts’; the ancients sure didn’t lie to Dou ah!</p><br/><p>Good thing was, she was the chicklet-less Tang Doudou, so she didn’t have to worry about this threat at all.</p><br/><p>Opening her mouth, she was just about to say something when a yell came from the distance.</p><br/><p>“Bai gongzi! Is that you over there?”</p><br/><p>Tang Doudou pointed to herself as her eyes asked Bai Feiyun: is that calling me?</p><br/><p>Bai Feiyun swept a glance at her and ignored her. Instead, he spoke warmly to the person that came over, “I understand, you can go back and tell Elder Yu that I’ll be bringing the Alliance Head over right away.”</p><br/><p>Looking over to the distance, the person that had arrived was a manservant dressed in a gray garment. After hearing what Bai Feiyun said, he stood there and glanced over doubtfully at Tang Doudou who was standing next to Bai Feiyun. This was the future martial arts Alliance Head?</p><br/><p>The hell! What does that look mean! You’re looking down on moi, aren’t you!?</p><br/><p>The servant’s doubtful glance made Tang Doudou extremely angry!</p><br/><p>If it weren’t for the fact that her, Doudou’s ambitions were aimed elsewhere, wasn’t it just a martial arts circles’ Alliance Head!?</p><br/><p>It’s a piece of cake! If it weren’t for the fact that she was running for her life, she’d just do it. It’s not like the position would cause her to lose any meat buns now, would it?</p><br/><p>Seeing blazes of flame ignite in Tang Doudou’s eyes, Bai Feiyun’s lips slightly hooked. After the servant left, he turned towards Tang Doudou. “Alliance Head, this way please.”</p><br/><p>Tang Doudou lifted up her chin, humphed, and walked forward.</p><br/><p>But before even walking two steps she stopped again and turned back to ask Bai Feiyun, “You’re not planning on explaining a little to me?”</p><br/><p>Bai Feiyun folded his hands behind his back and followed her. While walking he said, “Elder Yu and the others have already gathered quite a few martial arts practitioners and are preparing to expose details about your previous incident in Cloud Sun City. And just now, the Sangfroid Prince arrived and was kicking up a racket about wanting to find you… Just these two matters are enough for you to be unable to sit on the Alliance Head’s seat. If the fact that you don’t have the Alliance Head Command Tablet is added on, even if you are the Alliance Head personally appointed by the City Lord, I’m afraid you still won’t be able to sit on the seat stably.”</p><br/><p>“The Tendons Softening Powder is the secret drug possessed solely by the Demonic Sect. And Rutaceae Pavilion is heavily guarded; it can be said that not even a mosquito can fly in. For people of the Demonic Sect to be able to enter, Elder Yu definitely had some connection to it. Later, when you arrive, it’d be best if you don’t take the initiative to mention the Alliance Head Command Tablet.”</p><br/><p>When he got to this, Tang Doudou had to ask again, “Who is that Elder Yu, really? For him to hate me so much?”</p><br/><p>“The one he hates is not you, but more that he just hates whoever will become the Alliance Head.”</p><br/><p>So it was like that!</p><br/><p>Tang Doudou finally understood.</p><br/><p>In Jianghu, there are nothing but power struggles. This Elder Yu most likely wanted to become the Alliance Head himself.</p><br/><p>At long last finally finding out a bit about the situation, Tang Doudou smacked her lips and was just about to ask something else but Bai Feiyun, who was leading her, had already walked quite far away.</p><br/><p>“Hey, wait for me!”</p><br/><p>Are you kidding? This brothel right now is like a dragon pool and a lion den combined. She, this little bean, will be squashed into soy pulp no matter where she rolled.</p><br/><p>Little Bai Classmate looks pretty strong. If she doesn’t follow him, wouldn’t she be an idiot?</p><br/><p>Tang Doudou cheerfully chased after Bai Feiyun. The two white garments, one in front and one in back, were like butterflies that were gracefully flying away as they disappeared into the hazy candle flames ahead.</p><br/><p>After quite a while.</p><br/><p>In a small alley with ample tree shadows, a peerlessly magnificent figure appeared. A dark sea green jade tablet hung at the figure’s waist, appearing and disappearing under the moonlight.</p><br/>\n</div>"}