{"title": "Chapter 19: The Little Wild Chrysanthemum in the Fields", "id": 19, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-19-the-little-wild-chrysanthemum-in-the-fields", "volume_title": "Volume 1", "body": "<h1>Chapter 19: The Little Wild Chrysanthemum in the Fields</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 19: The Little Wild Chrysanthemum in the Fields</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>But no matter, so what if he’s suspicious of her?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>As long as she refuses to admit even if he beats her to death, what could he do to her?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou made up her mind and didn’t look at Bai Feiyun anymore. If not for the fact that there were no chairs on this stage, she would’ve sat down and crossed her ankle over her knee as she waited for the person Elder Yu called to come over.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Reckon half an hour had past. Tang Doudou’s legs were already tired from standing, yet no one had shown up.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Elder Yu’s expression also didn’t look too good. Pretty much all the people present knew what they were waiting for, but there were still some that didn’t know the situation, so as time passed, they couldn’t be restrained anymore.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Don’t know which school he was from, but he stood up from his seat and cupped his fist towards Tang Doudou and said: “Alliance Head Li, are you going to start this martial arts convention or not?! You should give us some answer ah!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Hey, this bro is pretty promising ah!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou was just thinking that continuing on like this wasn’t a solution. What’s more, she’s the Alliance Head. It couldn’t be that she must wait for Elder Yu to gain the initiative by striking first?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Someone brought a pillow just as you were getting sleepy, so Tang Doudou felt that guy was more and more pleasing to the eyes: “Start ah! Why wouldn’t I start?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Then what are you making us sit around here for? I’m still waiting for the convention to start and end so I can go home and sleep!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>That person looked towards Tang Doudou with a fair and clean face, he was much more pleasing to the eye than Elder Yu. In any case, he doesn’t have a part in becoming Alliance Head anyways. After being viewed as pleasing and starting the martial arts convention, his mood also improved a bit.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>He just didn’t understand, what was the point of fighting over the position of Alliance Head to the point heads are broken and blood are gushing!?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>If there was time to waste on this, why not find a couple girls and have some fun? Spring nights are bitterly short, to waste time playing you hoodwink me and I cheat you in this pile of big masters is not worth it, way too not worth!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>If Tang Doudou know this homie’s way of thinking, she would definitely give some claps of applause and cry ‘good, as a person you should have this way of thinking.’</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Life is difficult, enjoy the present. Don’t waste life walking towards trouble!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Haha, this Alliance Head just likes straightforward people like you! This brother, which sect are you from? What surname what name?” Tang Doudou laughed candidly and seized the opportunity to sweep aside the garments in front of her and plop her butt down to sit on the stage.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Hell yes, finally found an opportunity to sit down. She ran such a large distance and when she got here she didn’t even get to sit down long enough to warm her chair and immediately stood again over here for half the day. Tang Doudou felt like her legs were about to break off.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Replying Alliance Head, my formal name is Zhang Erdan*, pet name is Erdan! Is of Huai City’s Beggars’ Union!” Zhang Erdan giddily replied. When he was pushed out to say this, he had still muttered whether the Alliance Head would pay attention to him or not. He didn’t think that not only did the Alliance Head pay attention to him, he even smiled like a flower towards him.</p><br/><p>Zhang(to open up/spread/classifier for a sheet of paper) Er(two) Dan(egg).</p><br/><p>Yeah, just like the little chrysanthemum flowers in the field, really good-looking!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Erdan was a straightforward person, he said whatever he thought of: “Boss Alliance Head, you’re really good-looking, just like the little chrysanthemum flowers in the field!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou’s smile immediately froze and shattered into soy pulp*.</p><br/><p>I guess there’s going to be a lot of beans imagery/metaphors due to her name which means beans.</p><br/><p>Is this Erdan the Dou Bi Monkey sent for?”</p><br/><p>This explanation is long~~ I had to translate it from Baike.</p><br/><p>First the term “Dou Bi” from a traditional Chinese story. A long time ago, there was a person called Dou(stay/stop/tease). His martial arts skill was very great, but Dou really liked to sweat, so everyone liked to call him Han(sweat) Dou. One day, Han Dou went to compete in martial arts with someone, but that day was very cold, filled with the sound of the north wind. Dou who loved to sweat was very afraid of the cold, so he lost the competition. From then on, he never competed again. So this was the story Han Dou’s competition, from then on people called it Dou Bi(to compete).</p><br/><p>Then, in Journey to the West, the Red Child asked: “Are you the rescue troop Monkey sent for?” In Journey to the West, the Red Child didn’t know Zhu Bajie(Pigsy), and after using the three flavors True Fire to burn Sun Wukong(the Monkey King), Zhu Baijie asked Guanyin(the Goddess of Mercy) to help his master Xuanzang(Buddhist monk). The Red Child asked Guanyin this question. It has now been derived by the internet as “Are you the Dou Bi Monkey sent for?” It’s used to ridicule/mock other people selling cuteness or joking around.</p><br/><p>Finally, the meaning is apparently ‘is this real?’</p><br/><p>This took me 10 mins to find and translate. Things like this make the translations interesting, but also time consuming.</p><br/><p>Doudou was also smacked by a weight!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>But looking at the other person’s sincere eyes, Tang Doudou choked. How was she supposed to reply?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Fortunately, she didn’t stay embarrassed for long before the sincere Erdan spoke again: “Boss Alliance Head, is the wind on the stage strong?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Uh, it’s still okay……” Tang Doudou propped up her chin, seriously unable to do a thing about Erdan. The good thing was that he had already drew out the topic. Below, there were already people whispering and discussing. There were all types of opinions, the scene was a field of chaos.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>In the chaos a lot of the subjects were pointed towards Elder Yu.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Elder Yu’s old face was ashen. Xiao Yiyun who was next to him also didn’t look very well, he bent an ear to listen and lightly asked: “Elder Yu?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Let’s wait a little more.” Elder Yu’s gaze was grim. Lifting his hand to stop Xiao Yiyun, he sat down, refusing to even look at Tang Doudou who was on the stage.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Elder Yu!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Right this moment, a servant ran through the hall.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Swoosh! Everyone looked towards that servant. What news did he bring?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>__________</p><br/>\n</div>"}