{"title": "Chapter 30: Jun Xin", "id": 30, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-30-jun-xin", "volume_title": "Volume 1", "body": "<h1>Chapter 30: Jun Xin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 30: Jun Xin</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Lady Meng Yu, as the proverbs say, the dead is already dead…… Pei, no, that’s not right. Look, the things are already gone, no matter how you grieve over it it’s in vain? With this time, wouldn’t it be better to go drink some tea and chat a little…” Tang Doudou looked at Qing Yin, not knowing how to start. Jun Xin’s knife glares flew with ‘swoosh’s towards her body. Helpless, Tang Doudou could only chatter some nonsense to console Meng Yu.</p><br/><p>The moment Meng Yu heard that, she harshly glared at him, her voice raising several times louder, “Drink tea and chat? Do you know that that deer meat is Master’s main course for today? I busied from dawn until now, and now it’s gone! What am I going to bring to Master!?”</p><br/><p>“Aiyah, there’s no way he’ll starve to death!” And she was still wondering what it was, wasn’t it just a meal?</p><br/><p>Meng Yu glared at her again: “What do you know!”</p><br/><p>Alright, she indeed didn’t understand. But what she precisely wanted was for Baili Yu to have no lunch to eat, otherwise how can she gift these spicy strips?</p><br/><p>“Qing Yin, your Master is coming over today?”</p><br/><p>Originally she wasn’t planning to tell Tang Doudou, but the conversation had already gotten to this point so she couldn’t conceal it anymore either. So she replied: “Master is coming over today, but he didn’t say when he’ll arrive.”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“He’ll come before noon.” At the side, Jun Xin was incessantly resentful. He didn’t get to eat the deer meat, but on the contrary caused his entire body to smell.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Then, thinking again, those spicy strips also weren’t that bad. After eating them he can’t help but recall and yearn for them again and again. How about he just takes the blame for this guy and coerce him to make more spicy strips so he can eat to his heart’s content?</p><br/><p>Tang Doudou was just thinking about how to persuade Qing Yin to bring her to Baili Yu when from the corners of her eyes she saw Jun Xin staring at her with a deliberating look. This butt-aged little brat, he couldn’t be thinking of a way to get revenge on her, right?</p><br/><p>“He’s coming before noon?” Meng Yu originally had stopped crying, but hearing this, she started wailing with a ‘wah’ again, “Aiyoh aah! Isn’t this pretty much asking for my life!?”</p><br/><p>“Meng Yu jiejie, don’t cry anymore. What Li gongzi said is right, rather than grieving here like this, why don’t we all try to think of some way to remedy this.” Qing Yin helped Meng Yu up and spoke softly to comfort her. Her speaking voice was like a cool breeze carrying fine rain, it gently brushed past the present people’s hearts; it was extremely comfortable.</p><br/><p>She’s seriously a wonderful and clever person. Baili Yu sure has great fortune, to have a maid like this, his days must be peaceful, ne?</p><br/><p>Tang Doudou looked at Qing Yin appreciatively when a magnified face suddenly filled her line of sight. It had two giant panda eyes which fiercely glared at her.</p><br/><p>Ah! What the freak!? Scared poor baby* to death!</p><br/><p> – ”baby” the word is actually baobao which is a term that means baby, but made of the individual characters for treasure. It’s a very cute way to say baby and the phrase “scared baobao to death” is now commonly used online and in a lot of Chinese novels. I’ll use poor baby though b/c baobao doesn’t look that cute in pinyin to me</p><br/><p>“I’m warning you, Qing Yin isn’t someone you can casually have designs on!” Suddenly swiftly moving over, Jun Xin spoke in a small voice, his eyes filled with red fruit*(bare naked) warning.</p><br/><p>Rumor goes a forum censored the word “” from ““ which means completely naked, so people started using “” which ends up meaning red fruit to refer to it instead.</p><br/><p>Yo! This stinking brat thought she’s taking a fancy to Qing Yin?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>She indeed did take a fancy to her. Such a pity ah, regretfully the heavens didn’t give her a male body, and she also doesn’t intend to go towards lilies(yuri/lesbian)!</p><br/><p>Pushing aside Jun Xin with one heave, “Little BB! Don’t think you’ll be fine just by pushing the blame onto me after eating the deer meat. You should help Lady Meng Yu think of an idea right now!”</p><br/><p>“Do you still give a damn about your face!? That deer meat was clearly secretly eaten by you!” Jun Xin’s swollen face was completely red. Seeing Meng Yu aggrievedly look over, he immediately defended himself.</p><br/><p>He had always been direct and straightforward, and never covered up things, much less do something and refuse to admit it. Regarding this point, he truly looked down on Tang Doudou!</p><br/><p>All that admitting it would bring about is a beating. Not even having this amount of guts, he’s seriously not fit to be called a man!</p><br/><p>But what was even more infuriating was that he was actually fancying Qing Yin. Look at that eyeballs-almost-popping-out mesmerized lecherous look, where the hell exactly did this guy crawl out from?</p><br/><p>How was it possible for Tang Doudou not to see the disdain in his eyes? What a pity though, she, Doudou wasn’t some manly man of upright character from the start. Little ladies must be flexible, able to bow and submit and stand tall as the situation requires. Meng Yu’s body size is that huge, if she really admitted it was her that secretly ate the food, how many punches could her little body even bear?</p><br/><p>Even though Jun Xin’s body was also not that much bigger than hers, but the other is superior in the fact that he’s experienced long-term beatings, that skin has even thickened! It can hold up to a beating!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Not to mention, he’s already eaten her spicy strips for free. As the saying goes, taking things of others, hand will be short; eating things of others, mouth will be soft*. Jun Xin is still small and can’t understand this logic yet. As an adult, she, Tang Doudou will be magnanimous and not nitpick about that much!</p><br/><p>When you take something from someone, when the person asks you to help them do something you’d feel uncomfortable refusing. After eating other people’s things, you’ll feel uncomfortable criticizing them after.</p><br/><p>If Jun Xin found out that she was thinking such shameless thoughts, he would be immediately infuriated to the point he puked blood, never wanting to have dealings with this sort of person again.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Who is he ah? Why would he be here?” Meng Yu watched Jun Xin and Tang Doudou make eyes at each other and suddenly recalled a very important matter, who the hell is this ah?!</p><br/><p>Tang Doudou was just about to reply when Qing Yin at the side rushed to speak first: “Meng Yu jiejie, this is Li gongzi. The guest Master invited over.”</p><br/><p>“Li gongzi? Which Li gongzi? Why haven’t I ever heard of him before? And when has Master ever invited someone over, it’s seriously a rare and strange occasion!”</p><br/><p>Meng Yu most likely has also thought it through and absent-mindedly was muttering when her eyes spied Jun Xin who was just about to slip away. With large steps she crossed over and her stout palm slapped Jun Xin’s head. Grabbing the front of Jun Xin’s garment, she dragged him back into the courtyard, “Let’s go, Great Young Master Jun. Hurry and start thinking of ideas for me! You bunch of bastards, all you’re good at is being full of damned tricks! If you’re going to sneak food then just sneak food, why’d you have to make the kitchen that messy!? You must have been planning to make it look like a thief broke in! Unfortunately for you this lady’s eyes are discerning and immediately saw through it! Confess now, where did my five catty of wheat flour go?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>How could Jun Xin possibly be willing to go with her? He hurriedly pulled over the Tang Doudou that was next to him and hastily said, “Not me, he’s the one full of damned tricks. Meng Yu you better ask him! And, your wheat flour……”</p><br/><p>Before he could finish speaking, Tang Doudou suddenly started laughing with a loud ‘hahaha’, cutting of his words.</p><br/><p>Causing all three to be exceptionally puzzled, what’s with him? What’s he laughing about?</p><br/><p>“Hahaha…… Actually, solving this matter is very simple!” Tang Doudou seized the opportunity to grab Jun Xin’s shoulder and whisper at him: “You’re not allowed to say that I was the one that used the wheat flour. As long as you take the blame of this for me, I’ll help you get Meng Yu to leave.”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“I can’t trust you!” Jun Xin was very straightforward.</p><br/><p>Tang Doudou was ladened with grief. It couldn’t be that she looked that untrustworthy, right?</p><br/><p>“Whether you trust or not isn’t important. The important point is that right now there’s only me that can help you! Otherwise it couldn’t be that you still want to get beaten?” Tang Doudou raised an eyebrow. Not waiting for Jun Xin to agree, she moved close to Meng Yu’s ear and mumbled a few sentences.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>All that could be seen was Meng Yu instantly exposed a happy expression. Looking at Tang Doudou, she asked: “Is that for real?”</p><br/><p>“I swear there’s not half a word of falsehood!”</p><br/><p>“Then ok, I’ll just believe you this once!” After Meng Yu finished speaking, she suddenly headed towards her original path to return. Before she left she shot Jun Xin a warning glare: “Little brat Jun, if you dare try to steal food again, don’t blame me for not being polite.”</p><br/><p>Jun Xin was amazed, watching dazedly as Meng Yu disappeared ahead. Finally snapping back to his senses, he asked: “What did you say to her? For her to let it go this easily?”</p><br/><p>“Haha, secret!” Tang Doudou curved her eyes, ignoring him. She weighed the food box in her hand a couple times, “I’ve helped you deal with Meng Yu, now it’s your turn to help me!”</p><br/><p>“I never agreed to help you!” Who knew once Jun Xin heard that, he humphed, completely ungrateful.</p><br/><p>Tang Doudou didn’t mind it. Walking forward and hooking her arm around his shoulder, she said: “Would you believe, that as long as I give a squeak, Meng Yu will immediately appear?”</p><br/><p>“Then why don’t you squeak for this young master to hear?!” Once Meng Yu was gone, Jun Xin immediately reverted back to his tsunderely arrogant attitude. Only when he casted a sidelong glance at Tang Doudou did he release how much taller he was than Tang Doudou.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou also realized it and promptly pulled away, increasing the distance. Meeting him in the eye, her tone with frivolous, “Acting like this, you’re forcing me ah!”</p><br/><p>“Humph!”</p><br/><p>“Young Master Jun, Li gongzi, stop playing.” Seeing the gunpowder between the two start to ignite, Qing Yin felt a headache coming on. Back then why did she actively volunteer to take this task, it was a miscalculation, a huge blunder!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Qing Yin ah! That’s not right! Jun Xin and I aren’t playing around, aren’t we helping Meng Yu deal with your family’s Master?” Hearing Qing Yin’s words, Tang Doudou became upset and sincerely attempted to enlighten her.</p><br/><p>Qing Yin also counts as having become experienced with Tang Doudou’s way with spouting out nonsense without thinking. What’s more, these two were not ordinary people, it also wasn’t her place as a servant to control them. Meng Yu is only able to cause a fuss and shout Jun Xin’s name because her cooking skill was superb and Master would only eat food that she makes, so her status, in the end, was completely different from the rest of them.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Didn’t gongzi want to go look for master? Looking at the time, it’s almost about noon.” Meaning was, stop chirping and chattering with Jun Xin, let’s hurry up and go.</p><br/><p>If it was the earlier Tang Doudou, she definitely would have immediately left without objections. But right now ah, she had other plans!</p><br/><p>Otherwise she also wouldn’t stay here, wasting half the day’s effort.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Giving Qing Yin a reassuring smile, she started chatting idly with Jun Xin. She didn’t exhibit the slightest intention of leaving, on the contrary, it seemed like she was waiting for someone.</p><br/><p>Qing Yin could only stand at the side and wait on her.</p><br/><p>After a while, Jun Xin also realized that something was not right. Pushing aside Tang Doudou who was suspiciously groping him as if eating his tofu(mild sexual harassment), he asked: “You’re waiting for someone?”</p><br/><p>“Oh, you got smart ah! I am waiting for someone.” Tang Doudou curved her eyes. Although Jun Xin was a little tsundere, but after interacting with him for a while she knew his thoughts were simple. They came directly and left directly; he’s a person worth becoming friends with.</p><br/><p>It’s just his temper was a little unpredictable.</p><br/><p>But thinking of this little young man, he was just in the midst of adolescence. The ancient era wasn’t like the modern era where there were not that many restrictions between men and women. His hormones were raging yet he couldn’t find any release, to have a slightly strange temper was quite normal.</p><br/><p>“Waiting for Baili Yu?” Just then he had heard Qing Yin say his surname was Li. With things this obvious, if he still couldn’t guess who this person in front of him was, his brain would have been a waste of space.</p><br/><p>But, he really did not expect that the terrible Li Xueyi from the rumors was actually, aside from being a bit unusually scheming, quite pleasing to the eye. Anyways, he hadn’t seen someone this pleasing to the eye for a long time, so he decided to be patient and stay with him a bit longer.</p><br/><p>Actually, he just wanted spicy strips. It was just that the words came to his mouth several times but were swallowed down again, as he completely had no idea how he should start asking.</p><br/><p>“No, why would I wait for him? Not to mention if I was going to wait for him I wouldn’t wait here!”</p><br/><p>“Then who are you waiting for?” He’s not waiting for Baili Yu, but wasn’t he planning to find Baili Yu earlier? Looking at that food box, he recalled those extremely spicy spicy strips that she had packed in there earlier and swallowed his saliva, “You made all those for Baili Yu?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou didn’t try to hide it from him and confidently admitted to it, “He said that as long as he became happy, he’ll help me cure the poison. Helpless, I thought for half the day but still didn’t know how I could make him happy, so I made him some food. Don’t they say after eating other’s things the mouth gets soft? Perhaps after he eats it he’ll feel uncomfortable not returning the favor and help me conveniently get rid of the poison. Don’t you agree?”</p><br/><p>He actually felt Baili Yu would be that type of person whose mouth gets soft after eating other people’s things? Jun Xin just wanted to laugh. Earlier he even complimented him on his cleverness, yet right now his IQ was taking a sharp dive. If Baili Yu was really that sort of person, the entire world would be completely beautiful!</p><br/><p>Sending another glance at Tang Doudou’s healthy facial color, he couldn’t help but ask curiously: “What are you poisoned with? Isn’t there still a Godly Doctor Cang Baicao in Cloud City? Why didn’t you go to look for him?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>__________</p><br/><p>Credits: Translated by Chiyomira, Edited by LazyMiyu, Proofread by Ocelot</p><br/><p>[Chiyomira’s Corner]</p><br/><p>Chiyomira has nothing random to say this time. Enjoy~</p><br/><p>Glossary</p><br/>\n</div>"}