{"title": "Chapter 31: Isn’t It Troublesome?", "id": 31, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-31-isn%E2%80%99t-it-troublesome", "volume_title": "Volume 1", "body": "<h1>Chapter 31: Isn’t It Troublesome?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 31: Isn’t It Troublesome?</p><br/><p>“Cang Baicao? Who is that?” Who knew that the moment he said that, Tang Doudou looked at him with wide eyes, the depths of her eyes completely at a loss.</p><br/><p>“No way, you don’t even know Cang Baicao, are you even from Cloud City!?” Jun Xin was very surprised.</p><br/><p>It’s not like she’s the real Li Xueyi. She’s not even sure whether that Cloud City is in the north or the south, much less what Cang Baicao(hundred grasses) or Cang Qiancao(thousand grasses) is.</p><br/><p>“The world is immeasurably large. If I knew everything, what would I still need Baidu(Chinese version of Google) for?” Tang Doudou smacked her lips. The sound of Godly Doctor seems really impressive ah! If she could really find that Cang Baicao, then she wouldn’t need to think of ways to curry favor with Baili Yu anymore. </p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“What’s Baidu?” Jun Xin curiously asked.</p><br/><p>Eh, how should she explain?</p><br/><p>Her clear pupils curved, “Baidu, is a divine tool. It knows all, sees all, and most importantly; doesn’t cost money!”</p><br/><p>Jun Xin immediately gave her a huge eyeroll and disdainfully said: ‘Are you storytelling? Even pulling up a divine tool, how ridiculous.”</p><br/><p>Tang Doudou didn’t plan to bicker with him on this topic. Reaching out to seize Jun Xin’s shoulder, she said: “Hey, little brat. Say, which of the two has better medical expertise: Cang Baicao, or Baili Yu?”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Baili Yu was matchlessly magnificent, handsome to the point it raised goosebumps. From the bottom of her heart she felt a bit conflicted and would rather not deal with him any longer.</p><br/><p>Jun Xin rubbed his chin. After a bit of careful consideration, he was still very curious so he could only ask her again: “Why don’t you know Cang Baicao? Then, do you still remember who the Lord of Cloud City is?”</p><br/><p>“Uh……” This question, she seemed to have forgotten to ask Bai Feiyun about.</p><br/><p>“It couldn’t be that you don’t know this either, right!?”</p><br/><p>Tang Doudou concluded that if she wanted to trick Jun Xin to give her information on Cang Baicao, there was currently only one way.</p><br/><p>She spread her hands out in front of her, and rather helplessly said: “I lost my memories.”</p><br/><p>“Pfff!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“This joke isn’t funny at all.” Jun Xin curled his lips, his thoughts landed on the food box in Tang Doudou’s hand. Slightly twitching his fingers, his eyes suddenly fixated on it, “It couldn’t be that you’re poisoned with Disseminating Tassel Fragrance!?”</p><br/><p>Blurting this out, when he recalled that there was still one other person present, a flash of murderous intent flitted through his pupils. The imposing manner engulfing his entire body instantly turned dark as he turned his head slowly to look towards Qing Yin.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Qing Yin was still stunned still at the three words ‘Disseminating Tassel Fragrance’. When she felt Jun Xin’s cold gaze, she stared blankly for a moment before her face suddenly turned deathly pale. She dropped to her knees on the ground and desperately kowtowed towards Jun Xin, “Young Master Jun, please spare my life. This servant did not hear anything!”</p><br/><p>Jesus, what’s going on?</p><br/><p>Tang Doudou couldn’t really understand what was going on, but seeing Qing Yin kneel on the floor and knocking her head against the ground with ‘thunk thunk thunk’s, she felt incomparable heartache. She hurried over to stop her, “Hurry and get up. Why are you being so dumb, is this floor something you can casually use your head to smash? Once you smash damaged your brain, who will pay for it?”</p><br/><p>Qing Yin didn’t move a single bit, she didn’t even lift her head.</p><br/><p>Seeing this, Tang Doudou became upset and turned to find Jun Xin, that main culprit. Who knew that the moment she turned her head, Jun Xin had already arrived at their side at some unknown time. His originally haughty pupils were currently filled with a cold detachment, but looking closer, it was clear that there was some trace of reluctance. Quickly though, all traces of emotion were retracted, “Take your life. The rules of your Chamber of Commerce, there’s no need for me to remind you.”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Qing Yin’s body trembled, then she lowered her head to the ground, “This servant understands.”</p><br/><p>Saying such, she pulled out a small knife from somewhere and resolutely stabbed it towards her chest.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Scaring Tang Doudou’s soul flying. Fortunately, she was close by and was able to seize that knife with one grab. The sharp blade cut into her flesh and fresh blood squirted out, but she ignored it at that moment and roared at Qing Yin: “What, are you crazy?! He tells you to commit suicide and you just commit suicide!? Who the hell gave you such great privilege, that if you feel like dying you can just do so?!* You think life is bok choy? If you don’t want it you can just throw it away?”</p><br/><p>In America it’s illegal to take your own life. Idk about other countries though. Ancient China it was definitely legal.</p><br/><p>Transmigrating here, the thing that made Tang Doudou the most resentful was the contemptuous view they had towards human life. Frequently, from just the smallest things, they’ll demand a person’s life. They casually carry daggers and small knives around, using them to stab others and also stab themselves. To a modern person like her who had been taught from a young age to respect and value life, for a moment she truly could not accept it.</p><br/><p>If it was someone else perhaps she could still ignore it, but Qing Yin was the first similar natured friend she made hereE/N. No matter what she could not just watch and do nothing as she committed suicide.</p><br/><p>Furthermore, even right now her thoughts were all tangled. Why exactly did Jun Xin’s attitude towards Qing Yin suddenly shift 180 degrees?</p><br/><p>After just an instant, Qing Yin reacted and looked at Tang Doudou’s nonstop bleeding hand with alarm. Her entire body shook and her voice turned hoarse, “Li, Li, you……”</p><br/><p>“Shut up!” Tang Doudou moodily expelled. Dammit, don’t you see her hand’s even bleeding? What the feather yarn are you chirping and chattering for! Women are seriously just troublesome!</p><br/><p>A little bit forgetting the fact that she was also a woman.</p><br/><p>Qing Yin’s petite mouth deflated under her berating. No longer able to hold it back, her tears with fell with ‘plop plop plop’s. It was her fault from the very beginning for hearing something that shouldn’t have been heard. She also didn’t blame Jun Xin for becoming hostile and merciless. For Jun Xin to let her kill herself was already being considerate of their past relationship, so from the start she shouldn’t have felt any grievances from the start. For some reason though, she couldn’t help but cry after being scolded by this person in front of her, feeling incomparably wronged in her heart.</p><br/><p>Seeing Tang Doudou’s bleeding hand, her heart simply throbbed. Why would he do so much for her?</p><br/><p>Perhaps… Qing Yin’s heart shook tremulously. Her hand trembled, which made the small knife penetrate even deeper, hurting Tang Doudou to the point that she grimaced in pain and yelled at her: “Dumb woman, why haven’t you let go of the dagger yet? If you move any more, this little gramp’s hand will be done for!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Qing Yin didn’t know whether she was intimidated or frightened by the thoughts in her heart, but she hurriedly let go of the knife, “I, I……”</p><br/><p>Tang Doudou sent that knife flying with a kick. Only after she saw it sink into the pond did she take in deep breaths of cold air with ‘hiiiihoo’s before yelling: “What are you still dazing around for, hurry and help me find something to bandage this!”</p><br/><p>Qing Yin only snapped back to her senses now. Getting up from the ground, she originally wanted to walk over to check on her wound, but her steps paused. Curtsying towards Jun Xin, she hastily said: “Jun Xin, wait for Qing Yin to help Li gongzi treat his wound. Afterwards, I will find you to receive my punishment!”</p><br/><p>Everything had occurred too quickly. Jun Xin was only able to grasp the entire situation after Qing Yin stood in front of him. He looked at Tang Doudou with a trace of puzzlement flashing through his limpid eyes.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Jun Xin!” Qing Yin bit her teeth. Seeing that the white garment on Li Xueyi’s body was already being dyed red, she didn’t wait for Jun Xin’s reply any longer and ran off to find gauze.</p><br/><p>Jun Xin also didn’t stop her, but rather stared at Tang Doudou as if he was contemplating something, seemingly wanting to stare a hole through her.</p><br/><p>Feeling his gaze, Tang Doudou turned around to look back. Anger suddenly rushed up in a torrent and she charged over and sent a kick.</p><br/><p>Damned bastard!</p><br/><p>This butt-aged little brat, not very old, yet his heart was already that poisonous. She might as well kick him to death and prevent him from harming society in the futureE/N2.</p><br/><p>“The Jianghu all said that Li Xueyi was distinguished and accomplished by nature, showing mercy at every point. As expected it wasn’t a lie.” Seeing Tang Doudou rush over, Jun Xin did not block or dodge, his eyes were full of disdain.</p><br/><p>Looking again at Tang Doudou’s hand, within the red blood was clearly a trace of strange dark air. Speaking again, he said: “Qing Yin must die. You saved her once, but you can’t save her an entire lifetime.”</p><br/><p>Frick! Butt-aged little brat, why don’t you head to Heaven(go die) already!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Seeing that Tang Doudou still had an incomparably enraged expression, Jun Xin felt a bit intimidated under her furious glare, “Disseminating Tassel Fragrance is no small matter. If you wish to live, you must kill Qing Yin. In this world, only the mouths of dead people are most trustworthy.”</p><br/><p>Pei!</p><br/><p>Tang Doudou felt it was outrageous, these two things had an inevitable relationship*?</p><br/><p>Spot on explanation provided by Ocelot for Prady: The only way to keep a secret is by killing the person who knows the secret. Secret=Death is the inevitable relationship. That’s why she says JX and BY should die, too, because they also know her secret.</p><br/><p>“I spit! Such bullshit logic! You also know of Disseminating Tassel Fragrance, so why don’t you go die? Baili Yu also knows as well ah, is it that Baili Yu should die too?” Tang Doudou was extremely agitated, she never expected that the reason Jun Xin wanted Qing Yin to die was due to the fact that she overheard the three words ‘Disseminating Tassel Fragrance’. The hell? Value of human life in this ancient era sure is worthless enough!</p><br/><p>“You don’t deserve the right…” Jun Xin spoke lightly. He watched as Tang Doudou slipped due to the fact she was busy yelling, and fell completely backwards into the pond.</p><br/><p>When Tang Doudou was able to react, her body had already collided with the pool and fell through the water surface. Immediately, she was alarmed to the point where her entire body was covered with sweatE/N3. Frick she doesn’t know how to swim!</p><br/><p>Splash!</p><br/><p>In the next instant, the person thoroughly fell in, startling a splash of water.</p><br/><p>“Ah! Brat, save me!”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>A second ago Tang Doudou could still cry for help, but shortly afterwards she was choked by the water that fiercely poured into her mouth to the point her eyes rolled back for a moment. She hurriedly closed her mouth, but the water still entered her mouth and nose, suffocating her lungs and almost causing her to choke. Her chest felt like it was being repeatedly stabbed by a hundred thousand steel needles, powerless against the extreme pain.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>In all directions was the icy-cold, sky blue pond water. There was a white light that rippled through the water. She struggled with all her strength, yet she sank further and further down.</p><br/><p>Despair and fear attacked at the same time. Tang Doudou’s consciousness gradually became fuzzy. She vaguely saw a figure enter the water, a matchlessly unique figure, his features seemed a bit familiar. Her head was like paste, after thinking for a long time, she still couldn’t recall who it was.</p><br/><p>Who is it, are they here to save her?</p><br/><p>Following that, she fainted, completely losing consciousness.</p><br/><p>Jun Xin originally was still holding onto the attitude of sitting back and watching a good show. It never occurred to him that Tang Doudou didn’t know how to swim. He watched until Tang Doudou started sinking deeper and deeper into the water, in the end her figure disappeared from sight.</p><br/><p>His heart became chaotic and he frantically rushed over.</p><br/><p>Though he was one step late. A scarlet figure entered the water from the horizon like fire. In less than a blink, it was out again, and his arms held a person.</p><br/><p>Flying, he landed not far from Jun Xin. His entire body, other than the ends of his hairs being slightly moist, there was not a single drop of water that was actually able to get on him from that trip into the water.</p><br/><p>“I, I thought he knew how to swim.” Seeing the person look at him with deep eyes, Jun Xin stammeringly explained.</p><br/><p>He also looked at Tang Doudou with a little bit of worry. His miserable appearance made him very uneasy. That guy couldn’t have really drowned, right?</p><br/><p>“To believe oneself infallible, giving him a bit of a lesson is also good.”</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Baili Yu’s eyes lowered, and in passing he threw Tang Doudou onto the ground. When he lifted his eyes to look towards Jun Xin, a tiny bit of a smile appeared in his peach blossom eyes, yet the depths of his eyes were cold below freezing.</p><br/><p>Although it was like this, Jun Xin didn’t feel the least bit more relaxed. Shivering from a chill, he really wanted to turn around and flee.</p><br/><p>Heavens know that in this lifetime, the thing he was afraid of most is when Baili Yu exposes this kind of smile. It was practically more frightening than the devil!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Ahem, should you first look at his condition? Just now when he was rescuing Qing Yin, his hand was even given a large cut. He’s a person of Cloud City, if something happens to him here, I’m afraid it would be very troublesome.”</p><br/><p>Jun Xin’s gaze wandered everywhere, attempting to shift Baili Yu’s attention.</p><br/><p>Who expected that when he heard this, Baili Yu gave a light laugh, “Troublesome? When have I ever been afraid of trouble? I brought him here, wasn’t that precisely for the sake of trouble? If it could become even more troublesome, that would be quite good.”</p><br/><p>Trouble passed, trouble comes…Jun Xin suddenly felt an exceptional sympathy for Tang Doudou. Based on his understanding of Baili Yu, if Tang Doudou’s future days were pleasant and easy, he’ll write his name Jun Xin in reverse!</p><br/><p>__________</p><br/><p>Credits: Translated by Chiyomira, Edited by Prady, Proofread by Ocelot</p><br/><p>[Chiyomira’s Corner]</p><br/><p>E/N: holy shit she’s scary LOOOL, just make sure you become her friend! or she will ignore a death command against you</p><br/><p>E/N2: how hypocritical 😛 wow</p><br/><p>E/N3: but…how would anyone be able to tell…since you know, she’s already drenched in water</p><br/><p>==========</p><br/><p>All hail Baidu!</p><br/><p>All hail Larry Page and Sergey Brin (Google founders)</p><br/><p>Oh, and her personality kinda triggered my logic receptors this chapter lmfao</p><br/><p>Glossary</p><br/>\n</div>"}