{"title": "Chapter 35: I’ll Give You Two Sky Ascending Monkeys", "id": 35, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-35-i%E2%80%99ll-give-you-two-sky-ascending-monkeys", "volume_title": "Volume 1", "body": "<h1>Chapter 35: I’ll Give You Two Sky Ascending Monkeys</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 35: I’ll Give You Two Sky Ascending Monkeys</p><br/><p>Looking at the Jun Xin, who had suddenly appeared at the entrance, Tang Doudou only felt waves of black clouds sweep past over her head.</p><br/><p>Didn’t this little brat leave earlier? When did he turn back?</p><br/><p>Bai Feiyun’s also didn’t have a particularly good expression. Jun Xin had turned back to eavesdrop, yet he wasn’t able to sense it whatsoever. This was enough to indicate that Jun Xin’s martial arts were superior to his own, and it wasn’t just by a small margin….</p><br/><p>It must be known that Jun Xin was forced to admit admiration, that’s why he willingly decided to follow Baili Yu.</p><br/><p>As for how incredible Baili Yu’s martial arts actually were, no one in the Jianghu has complete knowledge of it currently.</p><br/><p>“Little brat, could it be that no one taught you eavesdropping on others is a bad habit?”</p><br/><p>Jun Xin strode in fiercely and glanced at the pill in Tang Doudou’s hand. While at it, he poured a cup of water as he passed by the table.</p><br/><p>Only when he got close did he pass the water in his hand to Tang Doudou, “Here, hurry up and take the medicine!”</p><br/><p>Which door of crazy was he heading towards this time? Wasn’t he still furious just now? How did he suddenly become so nice, so far as to even bring her water?</p><br/><p>Tang Doudou stared blankly for a while, still unsure whether or not she should accept it.</p><br/><p>“What are you dazing out for ah! Hurry up and just take the medicine, then let him go to bring the medicine back.” Seeing her dim-witted appearance, Jun Xin’s anger rushed back all at once. This guy actually described them as that abominable, and then he said what? Could he have the heart to just watch as he got harmed to death by others? If he wanted to get rid of a person, would he even need to slowly cause harm? Just a simple strike with the palm was more than enough.</p><br/><p>Jun Xin at this moment was really considering whether he should just kill Tang Doudou with a blow.</p><br/><p>If it weren’t for the fact that he turned around to eavesdrop out of sheer boredom, he still wouldn’t have realized that this guy was a two-faced scoundrel, saying bad things about them like this behind their backs.</p><br/><p>Hateful, truly hateful.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Tang Doudou was really embarrassed from his fierce attitude. She hurriedly took the water and said: “Thanks.”</p><br/><p>Only then did Jun Xin’s expression lighten up a little, after all, eavesdropping wasn’t anything glorious. If it weren’t for the fact that he seriously couldn’t stand it anymore, he wouldn’t have rushed in and be caught eavesdropping by Bai Feiyun.</p><br/><p>Seeing Tang Doudou swallow the pill, Bai Feiyun didn’t mention a word about Jun Xin eavesdropping, nor did he continue confirming the validity of Tang Doudou’s earlier statement, “Alliance Head, you should rest. I’ll head off right away to get my medicine box and return. Leave the wound uncovered like this for now. You must not cover it in order to avoid the wound getting worse. When the time comes to deal with it, it’ll be even more troublesome and painful if it gets worse.”</p><br/><p>“Alright, Xiao Bai, you can go. I’ll remember.” Hearing Bai Feiyun’s exhorting, Tang Doudou’s heart was warm and fluffy. Finally, there was someone that cared about her.</p><br/><p>At the side, Jun Xin saw her reply with a cute and agreeable appearance. He couldn’t help but give a cold humph. Luckily, he didn’t say anything.</p><br/><p>Bai Feiyun nodded towards him and proceeded to leave the room.</p><br/><p>After he left, Jun Xin finally turned his eyes towards Tang Doudou.</p><br/><p>Tang Doudou looked all around the room, harboring a guilty conscience. The atmosphere inside the room was particularly awkward.</p><br/><p>Saying bad things about others behind their backs, and then being caught just by chance. This feeling really was far, far, far from good ah.</p><br/><p>After a while, Tang Doudou was just considering whether she should attempt to provide an explanation, when Jun Xin spoke first: “You’re looking for the Alliance Head Command Tablet?”</p><br/><p>When Tang Doudou saw him open his mouth, she originally thought he was going to ask her about the trash-talking incident, but unexpectedly what he asked was actually pertaining to the Alliance Head Command Tablet. Her brain didn’t quite catch up and she involuntarily said ‘ah’.</p><br/><p>“The incident regarding the Murong family of Cloud Sun City, did you do that?”</p><br/><p>Jun Xin curiously asked. He had heard about this before, but there were too many doubtful points to the incident, you could tell it was set up to frame Li Xueyi with just a glance. It was just that there was nothing to be done about it, the Cloud City’s announcement was also a bit feeble since Li Xueyi never came out to explain. Due to this, the incident was getting worse and worse, hence getting awfully troublesome as well.</p><br/><p>Besides, half a month ago, Li Xueyi was probably still poisoned with Disseminating Tassel Fragrance?</p><br/><p>His little life was in fatal danger, yet if he could still have the mood to do that kind of thing, it seriously calls for admiration.</p><br/><p>That said, back to the main topic. The Li Xueyi in front of him had eyes that were clear without stains. He was just a little impish at most, how could he have such a deep motive?</p><br/><p>Could it be that the Disseminating Tassel Fragrance was truly that powerful, to the point where it could completely change a person’s personality?</p><br/><p>Or was it that this person in front of him was Li Xueyi’s true self, and the rumors were all purposefully smearing someone’s name?</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Without wind there cannot be waves, so it wouldn’t be this severe if it were solely defaming rumors ah! Jun Xin was really curious about how much of this was actually true.</p><br/><p>Hearing him ask about this incident, Tang Doudou also felt exceptionally helpless. Da fudge! She doesn’t even know what thing he’s talking ‘bout, so how could she know whether she did it or not?</p><br/><p>“I completely lost my memories, how could I still remember whether I did it or not.”</p><br/><p>Jun Xin nodded, “I believe you probably didn’t do them though.”</p><br/><p>Hey, this little brat, how come he believes in her so much all of a sudden? Could this be the so-called pig-feet aura*? Jesus ah, she, Tang Doudou, will definitely strike it rich soon!</p><br/><p>”pig-feet aura” pig feet is pronounced zhu1 jiao3, another way of pronouncing the character for feet() paired with other words is jue4. And the term for main character is (zhu3 jue4). Main character aura is often written as pig-feet aura on the internet because the main character’s personality is often so repulsive it makes people’s hair stand up in anger.</p><br/><p>“Based on how dim-witted you look, it’d seriously be strange if you were capable of doing that sort of thing.” Jun Xin scoffed as he added with an extremely disdainful tone.</p><br/><p>Tang Doudou’s face immediately collapsed, she knew it!</p><br/><p>“Hey, little brat, why don’t you tell me exactly what’s happening with that Murong family ah?! It couldn’t be that I did something that humankind and heaven alike would be indignant about? In fact, there’s no need for you to even say it, I too feel like I don’t have the ability to cause such a large event…”</p><br/><p>Tang Doudou didn’t know if it was because Bai Feiyun’s pill was working or because she saw Bai Feiyun but Tang Doudou’s mind felt a lot more alert, and her head didn’t hurt anymore. When people felt comfortable, their brains naturally worked better too. In any case, there was still time to wait until Bai Feiyun came back. Even though Jun Xin looked unreliable, from the meaning within his words, he should know quite a few things.</p><br/><p>She’ll take advantage of this chance to learn more about these situations, which would also be advantageous to her.</p><br/><p>Jun Xin swept her a glance, “You do at least have some self-knowledge. Didn’t that Bai Feiyun talk to you about this?”</p><br/><p>Automatically ignoring the prior sentence, Tang Doudou rubbed her chin and said: “I only encountered him yesterday night, a little while before the martial arts convention. Too many things happened afterwards, he simply didn’t have the chance to tell me about these things.”</p><br/><p>“Bai Feiyun, do you trust him a lot?” Jun Xin suddenly asked.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Even though she didn’t know what he asked this for, Tang Doudou decided not to not be completely honest. Bai Feiyun had already warned her earlier that she must distinguish clearly what to say and what not to say. At this moment, she felt the fact that she trusted Bai Feiyun was not something she should tell Jun Xin, so she naturally used some other excuse to beat around the bush. She first gave a particularly troubled sigh, before faintly saying: “I can’t quite put it into words either, I simply feel like he wouldn’t harm me.”</p><br/><p>The sentence was ambiguous, so Jun Xin also couldn’t obtain any clues from it, “Looks like, you also don’t completely trust him, but this is actually quite normal.”</p><br/><p>How was that normal? Tang Doudou silently disdained Jun Xin inside her heart.</p><br/><p>But what she wanted was to find out about the Cloud Sun City’s events, she didn’t want to chit chat with him at all.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“Hurry up and tell me what exactly happened!”</p><br/><p>Jun Xin said ‘oh’ before finally speaking: “Actually it’s not anything that big, just that you slept with some family’s daughter, then patted your butt and left. That young lady almost jumped into the river to commit suicide. Luckily, she was rescued in time, but she became dumb.”</p><br/><p>I swear a frick, this still doesn’t count as big?</p><br/><p>Tang Doudou really wanted to send a knuckle over, but there was no helping it, her hand was currently inconvenient. She could only drop the idea and say: “I definitely did not do this. Could it be that the lady remembered the wrong person?”</p><br/><p>Hearing this, Jun Xin found it funny and laughed. With a rather obvious tone of praise, he said to Tang Doudou: “You were actually smart this time around.”</p><br/><p>“She really remembered wrong? If that’s the case, then why are they still wringing me ‘stead of letting go?”</p><br/><p>“This is all still just some speculation. Not to mention, that lady has already gone dumb, how could she still know who was it that did the deed back then? Everything that occurred is pretty much up to the Murong family to make up!”</p><br/><p>When the conversation reached this point, Tang Doudou finally grabbed onto a couple straws: “What you mean is that, this fine incident was something that was cooked up by the Murong family?”</p><br/><p>“If you still had your memories, this matter would be much easier to deal with. Unfortunately, you lost them, so I’m afraid this incident will only get more chaotic. Wanting to solve it won’t be easy, not to mention you’re still poisoned with Disseminating Tassel Fragrance.” Jun Xin harbored malicious intentions as he analyzed the current situation for Tang Doudou. In reality, he just wanted to scare Tang Doudou and wanted to make her beg him for help.</p><br/><p>But Tang Doudou only had to casually move her brain to guess this brat’s devious intentions. In her heart, she ruthlessly disdained him a round and asked: “How are you so clear about this? And also this certain that it wasn’t me that did it? What if before I lost my memories I was actually a wicked beyond redemption bastard? What if I not only slept with that family’s daughter, but I even raped some family’s old hen, old sow……”</p><br/><p>Jun Xin immediately turned black. Even though he knew she was saying it on purpose, but it was still really disgusting, alright?</p><br/><p>Old hen, old sow…… the taste is seriously heavy!</p><br/><p>Seeing his face turn black, Tang Doudou’s mood became better again, she had also pretty much gotten a grasp of the situation.</p><br/><p>But are those people baka*? Is there any meaning to framing her like this? She doesn’t even have that plaything, how’s she supposed to sleep with some family’s daughter?</p><br/><p>Writer uses (these people)(si4-four)(or not four)(stupid) instead of (these people)(shi4-is)(or is not)(stupid), cuter internet way of speaking.</p><br/><p>Thinking about it closely, solving this problem was pretty simple. All she had to do was come out with her female identity.</p><br/><p>Simple and rough, there was no need to wade through mud and water at all.</p><br/><p>But unfortunately, she simply couldn’t fudging do that ah!</p><br/><p>Tang Doudou became ladened with grief.</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>“You’re too disgusting.” Jun Xin gave a heartfelt sigh. He really did feel that Li Xueyi probably wasn’t involved in this matter from the bottom of his heart. If he was asked for a reason, he didn’t know it quite himself, except that he just felt it.</p><br/><p>Tang Doudou didn’t pay attention to his sigh and asked: “But Bai Feiyun said this wasn’t directed by Elder Yu. It couldn’t be that I still have other enemies besides Elder Yu?”</p><br/><p>Jun Xin was pushed to laughter by her words. Pointing at her face while laughing he said: “Your enemies? Hahaha…”</p><br/><p>…What’s so funny about this?</p><br/><p>“Hey, kindly taking into account the fact that you lost your memories, this young master will properly tell you exactly how many enemies you have.” Jun Xin’s eyes were filled with delight at another person’s disaster. A Li Xueyi that lost his memories was pretty fun to play with, no wonder Baili Yu would bring him back.</p><br/><p>Tang Doudou silently looked at him, completely at a loss as to why he was so happy.</p><br/><p>She rubbed her chin. What enemies did she have? Could it be that she had a lot of enemies?</p><br/><p>Jesus ah, this wasn’t good news at all.</p><br/><p>“Don’t for now.” Seeing Jun Xin about to let loose a flood of words, Tang Doudou decisively declined the offer. She couldn’t even handle one Elder Yu, if she learned about more, wouldn’t it just be seeking trouble for herself?</p><br/><p>This kind of stupid thing, she, BeanbeansT/N, definitely won’t do.</p><br/><p>In regards to this matter about Cloud Sun City, she better ask Bai Feiyun. No matter what, Xiao Bai was still more reliable.</p><br/><p>In addition, Bai Feiyun was in charge of this matter, so Xiao Bai should be more clear on the whole sequence of events than Jun Xin, who had only heard about it through gossip.</p><br/><p>Since she could have precise information, Jun Xin can just choke on his rubbish!</p><br/><p>Please do not host elsewhere but Volare and Yumeabyss</p><br/><p>Jun Xin had already finished drafting out his introduction, but was choked by Tang Doudou’s three words to the point where he couldn’t utter half a word. A bunch of Jianghu gossip was restrained in his chest, but he didn’t voluntarily say it out since still wanted to put on airs. It was extremely difficult to bear.</p><br/><p>Tang Doudou looked at his suffering expression as he wanted to speak, but hesitated and felt incomparably smug. Just this little ability and you still want to fight with Big Sis? I’ll give you two Ascending Sky Monkeys*, go play in the sky ba.</p><br/><p>”Ascending sky monkey” = fireworks. It’s like those fireworks in Tom and Jerry.</p><br/><p>The phrase “go play in the sky” is often some variant of “let you ascend to Heaven,” which comes from an internet quote someone typed towards someone that was showing off a lot “so impressed, why don’t you ascend to Heaven?”</p><br/><p>Ba is just a sound particle indicating a suggestion or surmise</p><br/><p>__________</p><br/><p>Credits: Translated by Chiyomira, Edited by Prady, Proofread by Ocelot</p><br/><p>[Chiyomira’s Corner]</p><br/><p>Author’s Message: Good night, XOXOXO!</p><br/><p>Good morning~ Xp</p><br/><p>T/N:</p><br/><p>“This kind of stupid thing, she, BeanbeansT/N, definitely won’t do.”</p><br/><p>Prady questioned what ‘Beanbeans’ was and Ocelot pointed out correctly that “In earlier chapters she refers to her breasts as bean beans, specifically when she removes the skin suit to discover that she still has a female body.”</p><br/><p>But, at this point she’s referring to herself, not her nipples. As explained in earlier chapters, the words ‘dou’ which makes up her name means beans. In Chinese culture, we often refer to things that are like itty-bitty dots as doudous. For example, Tang Doudou uses it to refer to her nipples, a reader mentioned her pimples, and I’ve read stories in which the lead calls shorter side characters Little Doudou. And so, due to the fact that Tang Doudou often makes use of metaphors to express her possible tragic end like she’ll be flattened into ‘beancakes’ or crushed into ‘soymilk’, I’ve switched to using beanbeans sometimes when Tang Doudou calls herself or other things ‘doudou’.</p><br/><p>Is this too confusing? If it is I’ll just switch to keeping it in pinyin in the future. I just feel like Beanbeans conveys the cute tone more as well as sometimes help to express the metaphors better.</p><br/><p>Glossary</p><br/>\n</div>"}