{"title": "Chapter 46: Beautiful to the Point of Causing Bleeding", "id": 46, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-46-beautiful-to-the-point-of-causing-bleeding", "volume_title": "Volume 1", "body": "<h1>Chapter 46: Beautiful to the Point of Causing Bleeding</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 46: Beautiful to the Point of Causing Bleeding</p><br/><p>Meow a mii! When did she ever get so familiar with him?</p><br/><p>Xueyi, Xueyi~ Da fudge!? Good thing she wasn’t Xueyi, otherwise she would have dropped a floor full of goosebumps!</p><br/><p>Tang Doudou was very distressed and wanted to struggle free and get away. But when she tried to move she discovered that her acupuncture points had been hit at some unknown time so she couldn’t even twitch. What exactly was this Baili Yu’s intention?</p><br/><p>As she thought about this, she knitted her brows and looked up at him, only to see his eyes, which seemed to have a gravitational pull, slightly lift. Slight ripples filled his long and narrow peach blossom eyes as they fixated on her with a smile that was not quite a smile. Only after a while did his slender fingers move to untie that jade tablet from his waist. He leaned towards her and, gently lifting Tang Doudou’s hand, placed the tablet into her palm. Then, he used that low and alluring voice which could cause a person to die from the excitement of the infatuation without demanding his life in repayment* to softly say: “What Xueyi wants, I’ll naturally give. But Xueyi must not forget what you promised me earlier, alright?”</p><br/><p>The rules since ancient times were that when you kill someone, you have to pay with your own life. When you owe a debt, you must pay back the money. So this saying is that he is so enchanting, an infatuated person wouldn’t wish for revenge even if they died from being too excited while looking at him.</p><br/><p>Hah? Tang Doudou looked with astonishment at the jade tablet in her hand, then again at the Baili Yu whose eyes had been smiling the entire time. What kind of situation is this?</p><br/><p>What did she promise? Could it be that she had a memory lapse?</p><br/><p>And what she wanted was the Alliance Head Command Tablet. This toy isn’t the Alliance Head Command Tablet, what use would she have for it?</p><br/><p>Tang Doudou couldn’t understand what Baili Yu was thinking at all.</p><br/><p>Baili Yu also didn’t give her the chance to further think about it. He swept a glance at Jun Xin and asked: “You’ve busied an entire night, aren’t you tired? It’s best if you head back first to rest. If there’s anything you need to discuss, talking about it after Xueyi gets back from rescuing Bai gongzi won’t be too late.”</p><br/><p>Ever since Jun Xin entered the room, his facial color has been very ugly. Hearing this, it became even darker until it was black as charcoal. His bright eyes stared at the two that were on the couch, before finally landing on that jade tablet. Only then did his facial color slowly return to normal, but he didn’t reply to Baili Yu’s words. He angrily pushed Ye Chuan aside, kicked open the door and stomped out with large strides.</p><br/><p>Watching Jun Xin’s leaving figure, Baili Yu let out a soft chuckle and a trace of a smile streaked through his eyes.</p><br/><p>Hearing his laugh spill out next to her ear and feeling that warm tickling breath, Tang Doudou immediately returned to her senses. But when she looked towards the door, Jun Xin was already long gone.</p><br/><p>After she thought through it again, Tang Doudou suddenly came to a realization. Baili Yu was purposefully angering Jun Xin!</p><br/><p>However, Tang Doudou still couldn’t quite understand this development. Could it be that the two of them really have that sort of relationship? Aye, and it was even that mutual love mutual murder* type. It sure was exciting enough!</p><br/><p>It refers to a sort of relationship in which the two feel like enemies, yet at the same time have feelings for each other. In that relationship, they often think of ways to kill each other, but the attempts usually stop before the other person dies and it’s almost like their way of flirting. They often have the ‘XX can only die by my hand’ sort of thoughts.</p><br/><p>But if they want to flirt then just flirt. Why was he dragging her into it?</p><br/><p>She snuck a peek at Baili Yu. Could it be that he still hasn’t been able to push down Jun Xin, this tsundere uke*? That’s why he needs help attacking? Aye, if it was really like this he should have just told her. She’d definitely cooperate well with him. Did he really need to hit her pressure points?</p><br/><p>For lack of a better English term to describe who’s on the receiving and who’s on the offensive end of the homosexual relationship, I’ll be using the Japanese words, seme for the one on top and uke for the one on the bottom.</p><br/><p>“Hey! The person’s already left! Can’t you unseal my acupuncture points now?”</p><br/><p>This damned fox is too captivating! Just the fact that his appearance was like that of a seductive yao was tempting enough, yet he simply had to be hugging her, causing her whole body to be engulfed by his scent. It was warm and faint, and caused a weird feeling of comfort to arise within her. The type where she unconsciously yearned for more and was reluctant to part with it. Baili Yu didn’t reply. The two were very close together, to the point that they could almost feel each other’s breath. She was leaning by her side on Baili Yu’s broad chest. The forceful ‘thump thump’ of his heartbeat transmitted over, causing Tang Doudou’s own heartbeat to follow along and jump very very fast.</p><br/><p>Out of the corners of her eyes she glimpsed the sight of Baili Yu’s firm and smooth as jade chest that was peeking out through his slightly opened garment. Contrasted by the red garment, it was extremely alluring. It made people itched to pounce up, pry apart the clothes and take a ruthless bite, then with that hand… As she fantasized, Tang Doudou gulped back down a mouthful of saliva. Dammit! She can’t anymore!</p><br/><p>She hurriedly moved her gaze away but it was too late. Her nose heated up and two lines of blood spurted out. Tang Doudou wanted to use her hand to cover it, but she was helpless. After all, her acupuncture points had been pressed so she couldn’t move at all. All she could do was stare with her eyes open and watch as the blood from her nose drip onto the back of Baili Yu’s flawless hand.</p><br/><p>Embarrassing to death ah! Looking on helplessly at the blood that blossomed amidst that snow white surface, Tang Doudou’s heart collapsed. Her pure and honest image ah, just like this it’s gone!</p><br/><p>The second that tepid blood dripped onto the back of his hand, that hint of a smile on Baili Yu’s face immediately froze. He slowly lifted his eyes to look at Tang Doudou whose nosebleed was overflowing. Anger sprung up in his enchanting pair of eyes and the chill within the depths of his pupils turned sharp, causing the atmosphere around his entire body to become extremely frightening.</p><br/><p>Tang Doudou had never experienced a situation where someone’s imposing aura could give off a tangible crushing pressure. What was even worse was that the two were so close together; as a consequence, even her breathing turned difficult under Baili Yu’s strong pressure.</p><br/><p>She even forgot to continue to suck her nosebleed back in. There was only one thought in her mind: survive first!</p><br/><p>Based on this reaction of Baili Yu’s, he probably had the late stages of severe mysophobia. These type of people were the scariest. In the modern era, Tang Doudou had encountered them before. Her superior, that terrifying woman for one… Even though they were separated by space and time, just thinking about her caused Tang Doudou’s body to emit cold sweat.</p><br/><p>But Baili Yu was more terrifying than that woman by several thousand times.</p><br/><p>He was probably already deliberating which method of killing her would look a little better.</p><br/><p>Pei pei pei! Right now wasn’t the time to be thinking about this kind of stuff! Hastily flinging away her strange thoughts, Tang Doudou then looked speechlessly towards the sky. How should she explain? Would explaining even work?</p><br/><p>If only she could move, then there would be quite a few ways to deal with this situation. After all, being able to run is much better than sitting and awaiting death, right?</p><br/><p>Yet she just had to be immobile like this. What was even more terrible was that her nosebleed didn’t stop. It was still pouring down, landing drop by drop on Baili Yu’s hand. With each drop, the surrounding chill escalated. The situation was getting more and more desperate.</p><br/><p>Under the large formidable pressure, Tang Doudou felt like her eyes were going crossed from the fixated staring. Her brain was also turning fuzzy so she slightly moved her eyes a little. With a ‘swoosh’ she saw that Ye Chuan that was standing at the entrance.</p><br/><p>A divine light lit up. She couldn’t help but give her own quick wits a praise!</p><br/><p>She seriously was too smart ah. Even when she was being crushed by such a huge pressure she was still able to think of an idea. She was seriously a genius!</p><br/><p>As she transferred her entire gaze to Ye Chuan, her eyes curved and the corners of her lips hooked up into a crafty smile.</p><br/><p>The moment Ye Chuan felt Tang Doudou’s gaze that harbored evil designs, he only had thought. Which was: escape!</p><br/><p>When Master gets angry it’s very dangerous, just the aftermath was enough to sweep his leftover skeleton out of existence. So don’t even bring up that current devious little appearance of Tang Doudou’s that seemed to want to redirect the waters of calamity towards the east. There was already a high possibility that he would soon have to face Master’s anger directly. With this thought, Ye Chuan immediately shuddered from the chill and clenched his fists.</p><br/><p>It’s no good, he must take advantage of the time while Li Xueyi has yet to redirect the anger over to quickly slip away!</p><br/><p>But as he opened his mouth, he didn’t even get the chance to say a word before Tang Doudou immediately rushed to shout: “That person standing in the entrance! I’m calling you. Stop looking around, it’s precisely you! What’s your name?”</p><br/><p>… Ye Chuan silently cursed. There was no one to the left or the right, so even though he was unwilling, he still didn’t dare to not reply. Seeing Tang Doudou’s little smug expression, he gritted his teeth as he forced out two words: “Ye Chuan.”</p><br/><p>“Ye Chuan, what a good name ah!” Tang Doudou’s eyes lit up. She actually thought that Ye Chuan wouldn’t respond to her, unexpectedly he actually responded this politely ah! But that gaze… did he figure out her intentions?</p><br/><p>She pretended to be unperturbed. Ignoring Baili Yu’s frightening gaze, she asked Ye Chuan again: “Is Miss Bai still outside? Just a moment ago she told me that she had to find her Baili gege for an important matter. Why don’t you go call her in!”</p><br/><p>After she said that, she even winked towards Ye Chuan. What Tang Doudou was thinking was, Bai Lianhua was such a cute little lady. Baili Yu didn’t like her, but it was only due to the gender not being right. However, humans mah! They all like beautiful things. After seeing a beautiful little lotus, maybe Baili Yu’s mood would improve?</p><br/><p>But the moment Ye Chuan heard this, he almost burst out crying. I curse a great uncle ah! Isn’t this completely adding oil onto the fire?!</p><br/><p>Rather than pulling in Bai Lianhua who was outside the door to mix in this mess, it would have just been better to pull him into the water! God knows how much Master hates Bai Lianhua!</p><br/><p>From Li Xueyi’s smug appearance, he thought Li Xueyi had come up with some great idea. Also taking into consideration the spicy strips, Ye Chuan thought there was no harm in helping him a bit. He never expected that what Li Xueyi came up with was actually such a rotten idea!</p><br/><p>Ye Chuan was very depressed. Seeing Baili Yu’s gaze become more and more cold, he immediately reacted and hastily spoke, “Miss Bai has already left…”</p><br/><p>Before the sound of his words even dropped, a figure clad in pink had walked in from outside. If it wasn’t the Bai Lianhua that was waiting outside the door, who else could it be?</p><br/><p>Looking at her, the first expression on her face was one of being at a loss as she ignorantly and innocently saw the Tang Doudou on the couch. Following that, a deep bitter jealousy flashed through the depths of her eyes before quickly vanishing. In its place, confusion floated up. “Li gongzi, just now I saw Young Master Jun angrily rush out. Right afterward, I heard you mention my name so I wanted to come in and ask whether it was Lianhua’s appearance that had caused Young Master Jun to get angry?!”</p><br/><p>Ye Chuan silently supplemented from the side, Jun Xin would only be happy after seeing Bai Lianhua. There’s no way he would get mad. After all, when he was bored he would tease her. That was one of Jun Xin’s few entertainments other than stealing food.</p><br/><p>This Bai Lianhua was starting to act again. Ye Chuan felt a headache starting. Furthermore, he didn’t know whether Li Xueyi could see the truth or not. If by any chance he misunderstood again and continued to anger Master through his nonsense, the situation will truly be unsalvageable!</p><br/><p>Whilst he worried helplessly, Tang Doudou on the other hand smiled. It was because the second Bai Lianhua walked in, the frightening aura that was enveloping her immediately receded like the tide.</p><br/><p>In the blink of an eye, it disappeared without a trace. Glancing askance at Balili Yu, she saw that his facial colour had returned to normal. Feeling her gaze, the corners of his eyes lifted and an expression akin to a smile but not quite a smile appeared again. It was just that within the depths of his eyes, there was a trace of emotion. One that Tang Doudou couldn’t comprehend.</p><br/><p>Bai Lianhua suddenly exclaimed ‘ah’.</p><br/><p>Beneath everyone’s exceptionally confused gazes, she rushed towards Tang Doudou. As she ran, she even asked with concern, “Li gongzi, why is your nose bleeding? This, this, why didn’t you call a doctor ah?!”</p><br/><p>After finishing, she took out a handkerchief from her chest and reached out to help Tang Doudou wipe her nosebleed.</p><br/><p>Seeing this, Tang Doudou’s emotions were so moved ah!</p><br/><p>This was precisely the difference between men and women ah! For half the day, Ye Chuan stood over there yet still didn’t come over here to help wipe her nosebleed. He was dazed and foolish. There was seriously no comparison.</p><br/><p>Thinking up to here, Tang Doudou’s eyes slightly curved and her gaze towards Bai Lianhua became exceptionally gentle. If it weren’t for the fact that she couldn’t move, she would have wanted to directly stretch her face over.E/N</p><br/><p>Ye Chuan was speechless. Li Xueyi was as lecherous as the rumors had said! Only he would be able to take a fancy to goods(trash) like this Bai Lianhua.</p><br/><p>On the other hand, he was very curious as well. Why hasn’t Master exploded yet?</p><br/><p>But when he took another look, he immediately withdrew his head. He was filled with regret. Why didn’t he leave with Young Master Jun earlier?</p><br/><p>He’d rather see Master’s furious expression than see this dagger hidden in a smile expression ah! Too terrifying! If it was him who was that close to Master, he’d already be scared dead. But a certain person didn’t have even the slightest bit of awareness, and was even making eyes over there towards Bai Lianhua.</p><br/><p>A trace of disgust appeared within Bai Lianhua’s eyes. However, it quickly disappeared when she looked at Baili Yu and realized her close proximity with him. That captivating dream-like appearance was actually within reach! Working hard to control the emotional excitement in her heart, her elegant brows knitted and she withdrew her hand. Looking apologetically towards Tang Doudou, she said: “Men and women shouldn’t touch hands when giving or receiving things(citation from Mencius), it’s best if gongzi does it himself after all!”</p><br/><p>After speaking, she handed the handkerchief in her hand to Tang Doudou.</p><br/><p>Tang Doudou was speechless as she looked at the pink handkerchief that was lightly fluttering within the grasp of those soft white fingers. How was she supposed to grab it?</p><br/><p>__________</p><br/>\n</div>"}