{"title": "Chapter 43: Misunderstanding", "id": 43, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-43-misunderstanding", "volume_title": "Volume 1", "body": "<h1>Chapter 43: Misunderstanding</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 43: Misunderstanding</p><br/><p>Tang Doudou felt really awkward.</p><br/><p>Awkward to the point where she wished she could use a stick to just knock that continuously shrieking woman unconscious.</p><br/><p>Alright, it was her mistake.</p><br/><p>Although, who would have thought that there was actually a woman bathing in Baili Yu’s house ah! Da fudge!</p><br/><p>What kind of deceptive encounter with a beauty was this ah!? Wouldn’t you think it practically wanted to engrave her vulgar image into stone?!</p><br/><p>Tang Doudou rubbed her nose. Her thoughts switched instantly, and she immediately reacted. Blitzkrieg strategies were the Way of the King! If she was the one who lost control and shrieked just now, she would’ve been the one who’d be in trouble currently.</p><br/><p>According to the ancients’ typical way of dealing with indecent assault, if this young girl ended up demanding that she take responsibility, then that seriously would’ve been even more of an unlucky blow by a random steel weight!</p><br/><p>Speaking time was slow but events had actually happened fast. These thoughts had just raced through her head when Tang Doudou’s eyes immediately glanced around and decisively focused on an artfully designed wooden stick in the corner.</p><br/><p>She immediately picked it up, turned and swung it towards that shrieking girl.</p><br/><p>Though who would’ve expected that a strong burst of wind would ferociously attack and send her flying before the wooden stick even lowered?!</p><br/><p>That’s right, she wasn’t imagining it, she thoroughly flew up.</p><br/><p>Tang Doudou had a very calm expression on her face while in mid-air, but her balls hurt a lot on the inside. Alright, it’s true, she’d indeed encountered an expert this time!</p><br/><p>Boom!</p><br/><p>A loud sound abruptly rang out inside the room. Tang Doudou fell onto the ground sprawled on her back, it hurt to the point where she really wanted to curse mom. Ever since she got here, her bones were thrown around to the point that they were about to break, and her butt was also fallen on so much that it was about to become flattened chrysanthemums(in reference to the way petals bloom outwards)!</p><br/><p>She then saw the girl who had wrapped a pink dress around herself, which exposed her snow-white chest, and it was surging forth with great momentum. The girl angrily picked up the stick that had fallen to the ground along with Tang Doudou, “Obscene rogue! Hand over your life!”</p><br/><p>Fuck! Another one wants her little life now!</p><br/><p>“Lady, if there’s anything, let’s lay down together and discuss! Ahem! Oops, I mean properly discuss!” Tang Doudou climbed up with a burst of effort. She wiped the corners of her mouth and swallowed her drool before speaking: “As the proverbs say, a gentleman uses his mouth and not his fist. If there’s something, can’t we sit down and talk about it?”T/N</p><br/><p>What a blunder ah! She didn’t think that she would’ve ended up alarming this young girl. Judging by the furious look on her face, it seemed like Tang Doudou wouldn’t be getting away very easily this time.</p><br/><p>Tang Doudou silently tilted her head back forty-five degrees to look at the ceiling. Dear Lord ah! How great would it have been if you could’ve just sent me into some palace’s or some family’s power struggle ah! At least then, everyone would’ve just been some normal girls without any martial arts. All she’d have to do was think a little and talk big sometimes. She’d be able to muddle through by being the wind that sweeps up water crests*. To throw her into the Jianghu, where swords and blades are flashing and clashing everywhere, wasn’t this practically demanding her damned life?!</p><br/><p>When the wind blows past the water surface, there’d be waves on the water. It describes that even though an action is infuriating (to other people), this action is still vigorous and full of life. Figuratively meaning that the matter was dealt with particularly well and the development was particularly fast.</p><br/><p>“Gentleman? Humph! A vile rat-like scoundrel actually dares to also claim to be a gentleman!? From what you’re wearing, and that deer head rat-eyed* look of yours, you’re definitely someone who’s here to mount a sneak attack on Baili gege*!” A trace of murderous intent streaked through the young girl’s eyes. This person had to die, otherwise, Baili gege would definitely avoid her out of dislike if he finds out that she was seen by someone before!</p><br/><p>1. Deers have small and pointed heads and rats have small and round eyes. It implies that the person’s face is ugly and looks crafty.</p><br/><p>2.  – “gege” older brother, can be used to address someone not blood-related</p><br/><p>Their relationship, which wasn’t very close to begin with, might become even more distant due of this!</p><br/><p>“Big girlie, this was seriously a huge misunderstanding ah! It’s honestly a case of the surging waters trying to flood the Dragon King temple ah! Seriously a case of people of the same side failing to recognize their own comrades, Ah’m also here to look for Baili gege ah!” Tang Doudou tried explaining that it was just a beautiful misunderstanding ah!</p><br/><p>But that girl’s willow brows only knit. The gaze she directed towards Tang Doudou had an extremely peculiar expression as she coldly humphed, “Shut up! Have you even thought about your own status? You think you’re fit to call Baili gege like this!?”</p><br/><p>That young girl seized up the white attired Tang Doudou again. A trace of disdain flashed through her eyes. Her gaze then stopped on Tang Doudou’s delicate and pretty face.</p><br/><p>She had seen a lot of people that sought profit through family ties, but she hasn’t ever seen such a shameless follower with that kind of a mentality before.</p><br/><p>Tang Doudou didn’t dare to shut her mouth. She wouldn’t be able to clear up this situation the moment she shuts her mouth ah. So she attempted to explain once more, “If you don’t believe me, then you can go ask Qing Yin ah. I’m here to look for Baili ge-Yu. I was completely unaware of the fact that you were here bathing ah! This is a huge and unjust accusation big girlie!”</p><br/><p>She added a sentence in her own heart, it was seriously regretful. She had even thought it was Baili Yu that was bathing ne.</p><br/><p>“If gongzi wishes to pay a visit to my family’s Baili gege, you must first present a written invitation as a notification. Someone like you that enters without being invited, how are you any different from a typical thief? Luckily, I was the one who you encountered. If it were anyone else, they would’ve definitely broken both of your legs immediately!”</p><br/><p>I swear! How could it be this severe!?</p><br/><p>The corner of Tang Doudou’s mouth quirked slightly. Even though this young girl’s attitude was shifting to be slightly better, her expression still showed that she was on guard. It seemed that she had a strong distrust towards her.</p><br/><p>Please ah, little meimei! She’s actually very benevolent(usually describing older people) alright? Wait no, the right phrase is ‘very gentle’!</p><br/><p>In reality, she also felt very unjustly accused ah. All she did was stay behind the screen for a while and YY a little. Great aunt wasn’t able to even see a root of a feather ah, before this young girl threw on some clothes and ran out to scuffle with her.</p><br/><p>She also couldn’t quite figure out the situation. She wasn’t able to see the perfectly wonderful scene of a beautiful man exiting the bath and actually shook out this dust moth out of nowhere!</p><br/><p>Although, from the looks of this girl, it seemed like she was pretty easy to deal with. With just a glance, you could tell that she was a little lady not very well versed in matters of the world. Therefore, just casually confusing her a little would be good enough. After planning it out a little, Tang Doudou then said: “Lady’s words are reasonable. Actually, it was Baili Bro that invited me here to take a brotherly bath together. I never expected it was actually switched to you. I think I must’ve walked into the wrong room. Please take your time, I’ll leave right away!”</p><br/><p>“What nonsense are you speaking, you prodigal Dengtu Zi(famous lecherous guy, more below in CC)!? How could my Baili gege possible know someone like you!?” The young girl’s face was flushed and she began angrily stomping. She glared angrily at Tang Doudou while biting her pink lips.</p><br/><p>“I feel ah…Lady, this is seriously a dazzling misunderstanding. If Lady doesn’t mind, then let’s allow this misunderstanding to become an exquisite beginning!” Tang Doudou noticed that this girl brought up ‘Baili gege’ at every breath possible. Could it be that perhaps this was a little pampered girl that Baili Yu secretly raised? Wowah! Tang Doudou’s eyes lit up, she wasn’t expecting to dig out such a big and special scoop. This was seriously great!</p><br/><p>She also inwardly clicked her tongue. Tsk tsk, this guy sure lives it up ah!</p><br/><p>“Such graceful words and flowery speech(elegant but insincere), but you’d best hurry up and leave. If my Baili gege found out, he definitely won’t let you off!” What kind of relationship did this hooligan-like man exactly have with Baili gege? This Snow Gazing Courtyard wasn’t some place ordinary people could enter. She also had to borrow her relationship with Jun Xin in order to be able to freely go in and out of here, but what identity did this man have?</p><br/><p>If this girl had that sort of relationship with Baili Yu, wouldn’t it be even easier to get the Alliance Head Command Tablet if she were to build a close relationship with this girl and became her good bosom friend? Afterwards, dealing with the Disseminating Tassel Fragrance would also be a cinch ah!</p><br/><p>Don’t the proverbs say it well? No wind can blow as well as the bedside wind ah!</p><br/><p>Thinking this, Tang Doudou approached that girl as she pulled out what she believed to be a friendly smile and cheerfully remarked: “Lady’s skin sure is smooth and tender. It’s like a freshly peeled egg, it truly makes this one envious!”</p><br/><p>Words were slow, but that time passed fast. Tang Doudou’s godly dragon breast-milking(Big oily hand that specializing in groping girl’s breasts) hand speedily stroked her little cheek as she sighed with emotion, “Ah, seriously tender ah!”</p><br/><p>With this, the girl couldn’t stay calm anymore and suddenly screeched, “Ah! Shameless wanton rogue! To actually dare touch this Miss! Even Baili gege never treated me this way, you dare to actually offend me like this!? This Miss will kill you!”</p><br/><p>She lifted the wooden stick as she spoke, and rushed towards Tang Doudou with a burst of furious whams.</p><br/><p>Momentarily, the room was full of chickens flying and dogs jumping, it was seriously quite lively.</p><br/><p>“Li gongzi!”</p><br/><p>“Miss Bai!”</p><br/><p>Yet at this time, two anxious cries came from outside the door.</p><br/><p>Tang Doudou’s face lit up with joy. Lord ah, the rescue troops have finally arrived!</p><br/><p>As for that girl, she hurriedly threw the wooden stick away. Under Tang Doudou’s dumbstruck gaze, she collapsed with a ‘thump’ onto the floor. She made a very lovely and pitiful expression, she even squeezed out two drops of tears with sheer will as she quietly choked with sobs. T/N2 She genuinely looked like a little poor darling that had been bullied. Looking at her, Tang Doudou couldn’t help but feel a growing tenderness towards her.</p><br/><p>The freak! Tang Doudou’s eyeballs were practically popping out of her sockets. Which fricking drama was being dug up this time!?</p><br/><p>This development occurred barely a moment before the door was pushed open. Qing Yin ran in at the same time as Qing Xin.</p><br/><p>Glancing at the scene inside, they all silently remarked ‘oh no’.</p><br/><p>Then simultaneously hurried towards their respective masters.</p><br/><p>“Miss Bai, are you alright!?” Qing Xin ran towards the little white lotus and became extremely anxious. It must be known that she was in charge of handling this Big Miss. Today, she would have to take the biggest blame due to this incident. Right now, she only hoped that this Miss didn’t suffer any harm, otherwise her offense would be immense!</p><br/><p>“Wuuwuuwuu, Qing Xin you finally came! Wuuwuu, I, I-I-…”</p><br/><p>Qing Xin’s forehead twitched in response. Looks like the situation wasn’t good ah!</p><br/><p>While hugging the quietly sobbing Miss Bai, Qing Xin felt that calming her down was the top priority, “Miss Bai, rest assured. I believe Master will definitely seek out justice for you regarding this matter! So don’t be hurt. It wouldn’t be good if you were to ruin your body from anger!”</p><br/><p>After hearing that this matter would be dragged to Baili Yu, Miss Bai stopped crying and leaned onto Qing Xin with great grievances, “No, how could I trouble Baili gege for such a trivial matter!?”</p><br/><p>“Miss Bai, even though this was a misunderstanding, it’s not a small matter at all. Moreover, I believe Alliance Head Li also isn’t the type to not take responsibility…”</p><br/><p>After Qing Xin’s mouth opened and closed, Miss Bai started pushing off what she started, “No no, I don’t want him to take responsibility. I’m really fine, Qing Xin. I just beg you guys to never talk about this matter. I don’t want to let Baili gege know…I… wuuwuu.”</p><br/><p>Then, she seemed to have suddenly recalled something and blanked for a moment. Then, looking at Tang Doudou with an extremely disbelieving expression, she stammered: “Y-you said he’s Li Xueyi!?”</p><br/><p>Tang Doudou looked back at her with a baffled expression. She saw her astonished appearance and answered, “Yeah, I’m Li Xueyi ah.”</p><br/><p>It only occurred to Qing Yin now to help her up, so she hurried over worriedly to support her, “Li gongzi, are you injured somewhere?”</p><br/><p>She knew that Tang Doudou didn’t have any martial arts right now. In contrast, Miss Bai’s skill wasn’t simple. With the arise of a conflict, she felt like it was much more likely for Tang Doudou to be the one to have had eaten the worst of it.</p><br/><p>Not to mention, she felt that Tang Doudou was upright and kind deep down in her heart even though she spoke flamboyantly. In addition, he also liked men. Therefore he couldn’t have done anything to Miss Bai no matter what. At most he probably just saw some things he shouldn’t have seen.</p><br/><p>But the most crucial point was that she also didn’t like this Miss Bai.</p><br/><p>At first meeting, she actually felt that Miss Bai wasn’t too bad. She was very cute and pure, a delicate and pretty little lady. But afterwards, she fell for Young Master Jun. After being teased by Young Master Jun a couple times, she shifted her affection to Master. Master didn’t want to bother with her at all, yet she still nagged nonstop, causing people to extremely loathe her.</p><br/><p>Every time she came to the garden, she also thought of herself as the master.</p><br/><p>Just like this time, even though there were clearly so many guest room, she still had to come to Master’s favorite Snow Building. Even though Master wasn’t in the Snow Building this time, it also wasn’t a place where a guest like her to come ah, much less to even take a bath in here. Isn’t this evidently trying to seduce Master!?</p><br/><p>It was just that she didn’t expect the person that came would be Li gongzi. If it was Master, afraid she would’ve already forced Master to take responsibility!</p><br/><p>As Qing Yin angrily thought about all this, she noticed the way Miss Bai was surprised at Li gongzi’s identity. Could it be that she now desired Li gongzi to take responsibility?</p><br/><p>So Qing Yin couldn’t help but speak: “Since Miss Bai doesn’t want to let Li gongzi take responsibility, Qing Xin, you should stop exhorting too. A lady’s reputation is extremely important. I also believe that Li gongzi wouldn’t randomly talk about this matter.”</p><br/><p>When Tang Doudou heard what Qing Yin said, she seriously wanted to stick up a huge thumb for Qing Yin, then smack a kiss on her.</p><br/><p>Qing Yin ah Qing Yin, you’re practically a godsend ah! I’m seriously about to love you to death!</p><br/><p>__________</p><br/>\n</div>"}