{"title": "Chapter 53: Why’d I Fudgin’ Faint Again?", "id": 53, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-53-why%E2%80%99d-i-fudgin%E2%80%99-faint-again", "volume_title": "Volume 1", "body": "<h1>Chapter 53: Why’d I Fudgin’ Faint Again?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 53: Why’d I Fudgin’ Faint Again?</p><br/><p>The enormous wave of power that suddenly arose threw the other people standing on the roof to the ground.</p><br/><p>Following that, countless tile pieces flew out in all directions. Everyone standing on the ground hastily used their martial arts to dodge those tiles.</p><br/><p>After Jun Xin fell, he immediately tried to rush back up to see what exactly happened to Tang Doudou, but Qing Yin hurriedly stopped him, “Young Master Jun, let’s look at the situation first!”</p><br/><p>On the other hand, Mu Ye’s expression immediately changed as he looked with incomparable shock at the white light in the midst of that chaotic cloud of smoke. With a swish, he retrieved his iron chain which had barely retained half its original length. This was forged cold cast iron, yet it had actually broken from the force of that vibration!? How could Li Xueyi possess such indomitable inner strength? It was inconceivable!</p><br/><p>Inside his sleeve, his hand was dripping with blood. The vein near his purlicue* had actually been severed by the power of the vibration transmitted through the iron chain!</p><br/><p>The area between your thumb and forefinger. In Chinese, it’s called the ‘tiger’s den’.</p><br/><p>The shock in his heart was too great.</p><br/><p>Originally, he should have already rushed to leave at this time. Otherwise, once Jun Xin returned to his senses and reacted, leaving would become troublesome. Not to mention, he had even been injured, so dying here was now a possibility.</p><br/><p>However, at this moment he just stared rigidly towards that direction, his eyes lit with a cold light and his body not moving an inch. No matter what, if he left without getting to the bottom of this he would definitely feel regret!</p><br/><p>At this time, Jun Xin was also too busy focusing on Tang Doudou to pay attention to him. After being stopped by Qing Yin, he also stood there with his eyes fixed in that direction. If there was even the slightest sign of some unexpected development, he was prepared to immediately rush over.</p><br/><p>Meanwhile, after exploding, Tang Doudou only felt that her entire body was filled with energy. She felt incomparably comfortable and even had an impulse to continue roaring towards the sky. She stood on a roof beam, broken pieces of tiles and iron chain all below her feet. Everything surrounding her had been crushed by the vibration into fine powder. It lingered in the air, making it hard for the people outside to discern her figure for quite a while.</p><br/><p>Even though it was said that her entire body was filled with strength, she couldn’t hear a single sound from outside clearly. All she could see was the shape of their mouths moving as they pointed and gestured in her direction. She wanted to call out but discovered that she couldn’t make any noise.</p><br/><p>What exactly happened to her body?</p><br/><p>Tang Doudou who was standing motionless in place was very much at a loss. She swept her eyes around and noticed that Jun Xin was standing nearby and looking this way with concern. Joy lit up her face. That’s it! He’d definitely know what was going on!</p><br/><p>As she thought that, she made to walk towards Jun Xin. But her leg had just moved when her entire body fell straight down like a snapped kite.</p><br/><p>Jun Xin had been staring in that direction without blinking from the start. The moment he saw something falling, he hastily rushed over like a storm.</p><br/><p>But at this time, there was actually someone that was faster than him; a startlingly magnificent red figure. Even the smoke and dust that filled the skies were incapable of masking his God-like grandeur. With the grace of a swan, he arrived in a blink in front of Jun Xin. After a slight pause, he reached the falling object and extended his hand gracefully, catching the Tang Doudou that fell from the roof beam.</p><br/><p>Everything happened in a split second. By the time Jun Xin came near, Tang Doudou was panic-strickenly hugging Baili Yu’s neck with a death grip as she cried, “Big evil spirit, I was almost scared to death! Wuuwuuwuu…”</p><br/><p>Jun Xin felt a slight pain in his heart as he looked with confusion towards the Baili Yu that had suddenly appeared. He used his eyes to question him. Didn’t he say that reins over the entire matter were handed to him? Why did he suddenly appear?</p><br/><p>“Mu Ye has already left.” Baili Yu just gave this tepid sentence without looking at him.</p><br/><p>Tang Doudou who was scared dumb by this sudden event was crying, but she still heard what Baili Yu said in his low voice. She hastily stopped crying and lifted her head to look around, then asked with a sobbing tone, “That bastard, he really left?”</p><br/><p>Wuuwuuwuu, that Mu Demon really is a big bastard ah! She always ends up close to dying every time she encounters him.</p><br/><p>From what she said, it didn’t seem that she was that affected by the incident. Jun Xin loosened a breath in relief. As he thought about it again, he recalled that Baili Yu didn’t know of Li Xueyi’s female identity. The only reason he kept saving Tang Doudou over and over again was probably just for the sake of his plan.</p><br/><p>After all, in his heart, there was no other matter under the heavens that was more important than that particular plan of his.</p><br/><p>He only wishes that he was overthinking it. Jun Xin was silent for a while, then said: “I’ll go pursue Mu Ye.”</p><br/><p>“No need.” Baili Yu’s narrow peach blossom eyes concealed a radiance, “He was quite severely injured and won’t be appearing in the city for a while. Let him rest a couple days before going to find him. At that time, I think he’ll probably be finished making up his mind.”</p><br/><p>Jun Xin thought about it a little. In any case, he was just helping out. As long as it didn’t affect his benefits and didn’t touch his bottom line, whatever Baili Yu wanted was fine with him!</p><br/><p>“Then what about him?”</p><br/><p>Right after that sentence came out, the two simultaneously looked at the Tang Doudou that had her head deeply buried in Baili Yu’s chest with her body arched like an ostrich. Baili Yu reached out to push her dusty head away, his entire face strangely dark.</p><br/><p>Originally, he could have sat back and watched her fall like a play without acting.</p><br/><p>Yet the moment he saw Jun Xin rush forward, displeasure surfaced in his heart and his body subconsciously moved forward. Only after he caught Tang Doudou did he realize what he did.</p><br/><p>And this wasn’t the first time.</p><br/><p>It has only been a couple of days since they’ve met, yet it was already the third time he saved him this way.</p><br/><p>Baili Yu gave a light sigh. What exactly was going on?</p><br/><p>If it was anyone else, he would have felt uncomfortable with someone this filthy being near him. But this guy just kept getting filthier and filthier every time he hugged him, yet he still didn’t feel any revulsion. On the contrary, he actually felt that it was kind of comfortable, and the soft handfeel wasn’t bad.</p><br/><p>Thinking to here, Baili Yu’s face turned completely black. What exactly happened to him!?</p><br/><p>He looked at Tang Doudou again as if he were some strange creature and discovered that he had fainted.</p><br/><p>After staring at him for half a beat, Baili Yu slightly lifted his hands, preparing to throw this loathsome guy out. But when his gaze landed on that thoroughly red nose, he hesitated again and felt a bit angry. It’s already peeling! Why did he head out without even rubbing some medicine on it?</p><br/><p>Jun Xin, who was standing nearby, watched as Baili Yu’s facial expression went through a series of rapid changes. A bad feeling emerged in his heart.</p><br/><p>He gave Baili Yu an odd look. He, he couldn’t have also fallen for Li Xueyi, right!?T/N</p><br/><p>For a while, he became a bit befuddled. Baili Yu had never been tempted by female charms because he actually liked men?</p><br/><p>This was far far from good. If Baili Yu realized that he liked guys, but then found out that Li Xueyi was, in fact, a girl, he might kill Li Xueyi in a fit of anger.</p><br/><p>To hate homosexuality the most, yet end up falling for a guy. And yet this guy was actually a girl. Most people wouldn’t be able to accept that rapid change in circumstances, much less someone like Baili Yu.</p><br/><p>You better not trust his always smiling appearance. He may seem very reasonable and easy to talk to sometimes, but once he turns twisted, even demons would retreat three days’ march. If it was asked who it was that understood Baili Yu the most, the answer would most likely be Jun Xin.</p><br/><p>This smile-masked fox isn’t a good person at all!</p><br/><p>It’s no good! He can’t let Li Xueyi fall into such a predicament!</p><br/><p>“I’ll bring him back first! And then I’ll find a doctor to take a look at him and find out what exactly was with that sudden explosion of inner strength!” Jun Xin said as he decisively headed over.</p><br/><p>Hearing this, Baili Yu recalled that enormous inner strength from earlier. At that time, he was also greatly surprised. No one knew how profound Li Xueyi’s inner strength was in the past, but the Disseminating Tassel Fragrance was capable of completely dispersing a person’s inner strength and would even destroy the dantian. So his body shouldn’t be able to hold even the least bit of inner strength. Previously, he had already verified that there was not even a bit of inner strength in his body. So who did that tremendous amount of inner strength come from?</p><br/><p>All he could do was re-examine this matter.</p><br/><p>As he thought so, he reached out and checked Tang Doudou’s pulse. Baili Yu’s brows slightly knitted as he shook his head, “That won’t do. This was caused by the Disseminating Tassel Fragrance; ordinary doctors are useless.”</p><br/><p>It was Disseminating Tassel Fragrance again. Jun Xin wiped the Bloodthirster in his hand and returned it to its scabbard. Then, he asked with puzzlement, “Why don’t you cure his poison?”</p><br/><p>“It’s not urgent.”</p><br/><p>“What do you want to experimentally verify on his body?”</p><br/><p>“What is there in his body that needs me to experimentally verify? You’re thinking too much.”</p><br/><p>At this time, Qin Yin entered, leading everyone from the Alliance Head Residence. “Alliance Head, you’re not injured, right!!?”</p><br/><p>“That’s right ah, you almost scared us to death!”</p><br/><p>“Aiyah! The Alliance Head seems to have fainted!”</p><br/><p>The was crowd scrambling their way in when the people in front suddenly stopped. Due to that, the people following behind them couldn’t stop in time and crashed into them. Just as they were noisily apologizing, someone suddenly shouted, “Is-isn’t this Baili gongzi!? When did he arrive!?”</p><br/><p>After blurting that out, he hurriedly covered his mouth and looked nervously at Baili Yu.</p><br/><p>Baili Yu didn’t even look at the surrounding people. Carrying Tang Doudou, he directly leaped into the sky. In the blink of an eye, he disappeared over the wall of the Plum Garden.</p><br/><p>“Master has left so Young Master Jun, we should leave as well. Gongzi can deal with this matter himself once he recovers!” Qing Yin said softly after she walked up.</p><br/><p>Jun Xin nodded, “That’s true. Let’s head back first to look at what exactly happened.”</p><br/><p>And so, the two were about to leave, yet Elder Yu wouldn’t have it. The people of the Heng Xuan Chamber of Commerce always came with the wind and left with the rain. Coming whenever they felt like it and leaving whenever they felt like it, what were they treating the Alliance Head Residence as?</p><br/><p>They were treating it like an inn or a teahouse!</p><br/><p>“The two ahead, please stay your steps!” Once Elder Yu saw that Jun Xin was about to walk out the entrance, he hastily called out to them.</p><br/><p>Even though he was infuriated and really wanted to demand answers from them, he couldn’t avoid using a polite tone. Elder Yu couldn’t do anything about it. Who asked for the other party to be people from the Heng Xuan Chamber of Commerce?</p><br/><p>It wouldn’t do not to be polite ah!</p><br/><p>“Elder Yu, we still have a lot of matters to take care of. If it’s not something urgent, then we will take our leave first!” Qing Yin swept a glance at the completely annoyed Jun Xin and hastily replied to Elder Yu.</p><br/><p>Elder Yu looked at Jun Xin and, recalling the aura of that blood colored sword, felt lingering trepidation. The name of Blood Fiend sure wasn’t in vain!</p><br/><p>But recalling his purpose, he gave a light cough and asked, “Lao fu just wanted to ask Young Master Jun as to what exactly Baili gongzi’s intentions are. Why is he repeatedly taking the Alliance Head away? The martial arts circles cannot remain in the state of being a group of dragons without a head for overly long. An explanation must be given for this matter ah!”</p><br/><p>Jun Xin cast a sidelong glance and coldly replied, “This matter isn’t something I can interfere in. If you want an explanation, go look for Baili Yu!”</p><br/><p>After saying that, he flew onto the wall, light as a butterfly. Then, he shifted his gaze towards Qing Yin and asked, “Qing Yin, why are you still standing there?”</p><br/><p>Qing Yin curtsied towards Elder Yu, said a word of goodbye, then flew away with Jun Xin.</p><br/><p>The remaining people in the Alliance Head Residence looked at each other. What sort of event was happening here?</p><br/><p>The Alliance Head had returned and everyone had been happy. But in a blink, the Alliance Head was taken away again!</p><br/><p>What exactly did Baili Yu mean by this?</p><br/><p>Was he really treating the Alliance Head Residence as the Plum Garden’s back garden? Ay ay, people with power are just this awesome. Even the Old Heavens wouldn’t be able to bar his path. Wherever he wanted to go, it would be level ground.</p><br/><p>Just at this moment, Syndicate Leader Xu, who was hiding behind the entrance, jogged out and took this opportunity to move close to Elder Yu. He whispered in Elder Yu’s ear, “Elder Yu, the person’s already left. So how are we supposed to handle Bai gongzi’s matter?”</p><br/><p>__________</p><br/>\n</div>"}