{"title": "Chapter 57: Sect Leader Mu and Toilet Paper", "id": 57, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-57-sect-leader-mu-and-toilet-paper", "volume_title": "Volume 1", "body": "<h1>Chapter 57: Sect Leader Mu and Toilet Paper</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Say wha?</p><br/><p>Tang Doudou dug into her ear, suspecting that she what she had just heard had been an auditory hallucination.</p><br/><p>But the fact that Mu Ye was still speaking outside clearly told her that it hadn’t been an auditory hallucination just now.</p><br/><p>This time she got really scared!</p><br/><p>Had Mu Ye not gotten out of bed the right way this morning? His head touched the ground first?</p><br/><p>Ate the wrong medicine?</p><br/><p>Was possessed by a ghost?</p><br/><p>Or maybe the same as her, the shell had gotten a substitute host?</p><br/><p>Mommy ah, it’s seriously about to scare this poor baby to death!</p><br/><p>Tang Doudou covered her little heart, not even daring to breathe loudly. She thought, could it be that Mu Ye had found the wrong person?</p><br/><p>Could it be that he had made an appointment to meet someone else at the toilet, but due to a freaky combination of factors, she had run in here?</p><br/><p>Pei! She lightly slapped another palm onto her face. Freak as if he would meet someone, as if he would make an appointment at the restroom.</p><br/><p>Mu Ye was right outside the restroom. Seeing that the Tang Doudou who had gone inside the latrine didn’t even have the slightest bit of a reaction, he became a bit puzzled. He went in for so long, why hasn’t he come out yet?</p><br/><p>Following that, he heard a slap and a spitting sound. Could it be that he had eaten something bad and upset his stomach?</p><br/><p>Mu Ye’s face turned cold. If he wasn’t going to come out, how was this conversation supposed to continue?</p><br/><p>It couldn’t be that he was really going to have to wait outside the latrine for Tang Doudou to come out?</p><br/><p>This was too degrading for his dignity.</p><br/><p>Mu Ye swept his eyes around, before looking at the silent latrine again. The color of his eyes deepened before he said in a low voice, “I’m leaving first. I’ll come find you again at midnight.”</p><br/><p>Today was the Plum Garden Gathering, there were a lot of people who came to the plum sea. If it wasn’t for the fact that he had received an invitation, it wouldn’t have been easy to come in.</p><br/><p>He had originally been strolling around in the plum sea when he had encountered Li Xueyi walking over to this side with a hurried expression.</p><br/><p>Recalling the conversation he had with Baili Yu last time, he followed Li Xueyi over.</p><br/><p>Only after Li Xueyi had entered the restroom had he appeared and knocked that missus unconscious, before telling Li Xueyi of his goal. What he wanted wasn’t anything complicated. Even though there were some conflicts between the two, it was still him who had been on the winning side each time, so much that Li Xueyi had even ended up being unconscious for over half a month this time. This couldn’t be blamed on anyone, it could only be blamed on the fact that the two were standing in different positions.</p><br/><p>Moreover, Li Xueyi even teased him last time, so this time’s event could be counted as making the scores even.</p><br/><p>If he had let Tang Doudou know what he was thinking, perhaps Tang Doudou would’ve directly run out to give him a beating. All she did was stroke your face a little and you want her life in exchange? Hell, your way of thinking sure is wonderful!</p><br/><p>This part was precisely the part which Tang Doudou didn’t understand.</p><br/><p>After she transmigrated, other than that crowd of delicate, pretty little ladies, the first man she actually saw was Mu Ye!</p><br/><p>Yet this man had insisted on throwing her down… but she should just let that be in the past. That was because her hand had messed up, so it served her right to be thrown down… But he even repeatedly helped Elder Yu pit against her. Last time, she even almost ended up dying.</p><br/><p>Then in a flash, he ran over here to make some deal with her. If it wasn’t that there was something was wrong with his head, what else could it be?</p><br/><p>Mu Ye’s face was always so cold like a poker face; it couldn’t be that he had some form of dissociative identity disorder in addition to early menopause due to his great aunty being irregular, along with impotence, premature ejaculation, cauliflower, willow, etc. types of syndromes?</p><br/><p>Aunty = period</p><br/><p>Cauliflower = gonorrhea</p><br/><p>Willow() = Idk? But it says if you dreamt of this specific willow tree, it symbolized that you might be having falling outs with friends and/or have a longing for the red-light district</p><br/><p>After Tang Doudou finished making malicious conjectures in her heart, she started feeling troubled. Based on Mu Ye’s current cool-headed attitude, the odds that he was looking for a different person weren’t high. So then, what exactly did she have in her possession that she could use to make a deal with him?</p><br/><p>She wasn’t able to see the situation outside, so she also wasn’t sure if Mu Ye had left or not. After squatting for half the day, her legs became numb to the point she could barely feel them anymore. Tang Doudou shifted her position, then recalled what Mu Ye had said earlier. He was going to look for her again at midnight?</p><br/><p>Meow a mii! That was way too scary. Maybe she should just not go back tonight.</p><br/><p>After thinking such nonsense for a good amount of time, she noticed that there wasn’t any sound. Thinking that Mu Ye had probably left, she exhaled in relief. Phew, it had been resolved quite nicely. Tonight, she’ll just find a random place to stay and put up with it for a while.</p><br/><p>Since she had thought that Mu Ye had left and because she also couldn’t squat for much longer, Tang Doudou cleared her throat again, before shouting loudly, “Is there anyone there!? Someone, please come! Hurry ah! Save me ah! Aaah!”</p><br/><p>Her voice hadn’t even finished when she heard the chafing, ear piercing sound of an iron chain suddenly coming from outside the door.</p><br/><p>Boom! Bang!</p><br/><p>Immediately after that was two deafening sounds, the building broke. Following that, Tang Doudou only felt like it had suddenly gotten really bright. In the midst of the dancing smoke and dust, she suddenly snapped to her senses and realized what was happening, then rapidly reached out to grab the door that had fallen down next to her. With a strength that had come from some unknown source, she managed to stand the door up in front of her.</p><br/><p>Phew! So close, she had almost been exposed!T/N She patted her chest to relieve the lingering fear. Tang Doudou’s back was drenched with cold sweat. When the wind blew by, it chilled her to her very heart.</p><br/><p>Afterwards, she couldn’t help but feel flames of fury rush up. Freakin’ holy fuck, can’t even go to the restroom in peace! Seriously, what does he want!?</p><br/><p>“Fuck, Mu Ye you freaking da ye! What are you going crazy for?” Right now, Tang Doudou’s little butt was currently chilling in the wind. Anger, humiliation, embarrassment; all sorts of emotions flooded her head, as even the rim of her eyes turned red.</p><br/><p>Her life’s innocence ah!</p><br/><p>Mu Ye thought she had encountered danger inside, so he immediately destroyed that door without the slightest delay, wanting to rush in to see the situation. But he hadn’t even taken two steps when he heard Tang Doudou’s enraged cursing and immediately froze. He looked at the high erect door in midst of the entire mess.</p><br/><p>And had realized just now that the person was still in the middle of going to the restroom…</p><br/><p>He had controlled his strength because he was worried that the wooden house would hit Tang Doudou when it fell. Thus, the only things that were broken were the front and the roof, the back was completely intact. Furthermore, Tang Doudou had reacted quickly and used the wooden plank to block herself, so she hadn’t been exposed.</p><br/><p>She hadn’t been exposed, but this scene was still awkward enough to make people furious.</p><br/><p>So after Mu Ye heard Tang Doudou curse him, he didn’t get angry. However, he still spoke coldly, “You said ‘save me’.”</p><br/><p>Save your damned da ye!</p><br/><p>Tang Doudou silently cursed in her heart. She only calmed down a little after realizing that she wasn’t in any danger of being exposed. Earlier, when she had shouted like that, it was only because she had wanted to grab someone’s attention and have them come over to hand her toilet paper. Yet Mu Ye, this imbecile, actually ended up thinking that it was for real. Did he think that everyone was like him, moronic to the point they would come and trap someone in a restroom?</p><br/><p>In any case, she, Tang Doudou wouldn’t be able to do something this moronic.</p><br/><p>After thinking for a moment, Tang Doudou peeked out from the side of the door. Although the dust still hadn’t settled yet, she was immediately able to see Mu Ye’s completely black figure. His appearance seemed like that of a raven’s as he silently looked over in her direction.</p><br/><p>When she looked over, her eyes happened to meet head on with his and she immediately felt a cold shiver. Then, rubbing her chin, she thought: since he liked standing guard in front of a restroom so much, then let’s just let him guard his fill!</p><br/><p>“Mu Ye, can you help me out with something?” Tang Doudou asked, feeling a bit embarrassed.</p><br/><p>Mu Ye was silent at first. Only after a long pause did he say, “Speak.”</p><br/><p>“Ahem, the thing in the restroom was sent flying by you just now and there are no other latrine wipes either. Do you think you can help me get some?”</p><br/><p>She felt the surroundings slowly turn cold as she spoke, but didn’t feel scared. Since Mu Ye wanted to make a deal with her, before he obtained his goal, he definitely wouldn’t kill her. Worst case, he’ll just dislike her more. In any case, in regards to disliking someone, a bit more or a bit less didn’t make much of a difference anyways.</p><br/><p>What she thought wasn’t wrong. Mu Ye really wanted to kill her. It was better when she didn’t speak. Every time she opened her mouth, it would make him to be unable to control his temper.</p><br/><p>He thought: good thing he hadn’t met a guy this shameless earlier in his life. Otherwise, he would have already been angered to death.</p><br/><p>To have him, the grand and upright Demonic Sect Leader, get latrine wipes for him? That was practically like trying a pull a tooth from a tiger’s mouth. He sure had quite a lot of guts!</p><br/><p>Seeing that Mu Ye didn’t reply, Tang Doudou continued again. “If it’s inconvenient for you to do so, you can also just call someone over for me. Ahem, it’s not like you can have me squatting here the entire time while talking with you, right? It’s not really any problem for me, but can you really bear it?”</p><br/><p>Mu Ye hesitated. It was not like he couldn’t smell that faintly discernable odor in the air.</p><br/><p>This truly wasn’t a good place to talk.</p><br/><p>Afraid that he would say something like going to find her in the middle of the night again, Tang Doudou supplemented, “I believe you’re sneaking in to talk to me, right? Haa, this Plum Garden isn’t easy to get into at all. Baili foxie, that big evil spirit, has quite a few information agents in place. Even though those agents haven’t discovered you yet, the longer you stay, the more dangerous it is. Don’t even mention coming to find me in the middle of the night, that’d be even more dangerous… So if there are any matters, then we should just talk about it as soon as possible. Don’t dawdle and waste time.”</p><br/><p>“If you help me get latrine wipes, I’ll come out immediately after I finish my business and talk things over with you.”</p><br/><p>Mu Ye fell silent once again.</p><br/><p>Just as Tang Doudou thought he wouldn’t go, he suddenly turned around and quickly disappeared into the row of little wooden houses up ahead.</p><br/><p>Tang Doudou was very curious. Strutting around like that, there were also plenty of people near the wooden houses, wouldn’t he get discovered easily?</p><br/><p>Very soon, Mu Ye had returned.</p><br/><p>His spacious robe was holding toilet paper and his expression was extremely ugly. When he got close, he bent his finger and with a flick, all the toilet paper filled the sky and shot like white bits towards Tang Doudou.</p><br/><p>The toilet paper that approached as fiercely as knives instantly stabbed into the door with ‘pi li pa la’s like nails.</p><br/><p>Tang Doudou who was propping up the door shook from the vibration. Only now had she come back to her senses. What the freak? Toilet paper can even be played with like this?</p><br/><p>As she looked with a trembling gaze towards the door that was pierced all over with toilet paper, she imagined what kind of scene it would have been if these had shot towards her body…</p><br/><p>Gulping, Tang Doudou didn’t immediately reach out to grab the toilet paper but said to Mu Ye, “Um, grabbing it like this seems a little inconvenient…”</p><br/><p>The air turned cold again like an ice cave as Mu Ye said coldly, “Stop while you’re ahead!”</p><br/><p>Tang Doudou pouted and said, “I just wanted you to turn around. Since you’re not willing, then I’ll just directly put this door down now!”</p><br/><p>Hearing this, Mu Ye gave a cold hump, before turning around.</p><br/><p>Seeing his actions, Tang Doudou’s lips hooked up into a nefarious smile. Tang Doudou used the wooden stick that fell behind her to prop up the door, then ripped off a few pieces of nearby toilet paper and speedily cleaned herself up.</p><br/><p>“Ahem, that um, Sect Leader Mu, you must wait a bit more. It seems like I, I… aiyo!” Tang Doudou secretly got up. Even though her legs felt numb and uncomfortable, it didn’t affect her movements. After walking to the door and not seeing anything strange, she creeped out from the side of the latrine to the back while purposely making uncomfortable sounding repressed groans.</p><br/><p>Mu Ye was getting a little irritated from her cries and dropped a phrase of “Hurry up.”</p><br/><p>But he didn’t leave. He just stood at a place not far away from the latrine with his arms crossed as he looked ahead. Tang Doudou didn’t know what he was even looking at.</p><br/><p>She retrieved her head and called out again, “Aiyo! I can’t anymore. Sorry, wait a little longer.”</p><br/><p>After that, Tang Doudou rushed on tiptoes towards the distant sea of plum flower trees. As she ran, she cursed Mu Ye for being a pervert. Only a ghost would make a deal with you! Last time, he almost killed her. That account still hasn’t been cleared up! Not to mention, no matter what, she was still the current Martial Arts Alliance Head. Did his brain malfunction because of a stroke to think that she would willingly make a deal with a demonic head like him?</p><br/><p>After running for a while and making sure that Mu Ye wouldn’t be able to catch up to her, she slowed down her speed. She thought: the urgent matter had already been taken care of, so now was probably the time to enjoy the beauty of the plum sea, right?</p><br/><p>But things simply won’t go as one wishes. Just as she was about to stroll around leisurely, someone called out to her from far away.</p><br/><p>“Alliance Head Li, I’ve finally managed to find you!”</p><br/>\n</div>"}