{"title": "Chapter 63: Who Seduced Who?", "id": 63, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-63-who-seduced-who", "volume_title": "Volume 1", "body": "<h1>Chapter 63: Who Seduced Who?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Go home?” Baili Yu tasted the wine before asking, “You want to return to the Alliance Head Residence?”</p><br/><p>“No, no, that’s not my home. My home isn’t here!” Tang Doudou’s tongue had loosened when she started drinking.</p><br/><p>“Then where’s your home?” Baili Yu asked.</p><br/><p>Tang Doudou looked at the hazy image of Baili Yu through the light and giggled. She stumbled to her feet. “My home, my home is… is, hehe, somewhere you can’t find!”</p><br/><p>“There’s no place that exists under this heaven that I can’t find.” Baili Yu said mildly, before putting his wine cup down. “Alliance Head Li has gotten drunk.”</p><br/><p>“Drunk? I’m not drunk!” Tang Doudou swayed left and right as she walked over to him. “Baili Yu ah, even though I must admit that you’re pretty capable, that place really is impossible for you to find. Impossible to find… hahaha!”</p><br/><p>The words had just fallen when she sat down with a ‘thump’ onto the table next to Baili Yu. She snatched the wine cup that Baili Yu was just about to lift up and took another shot before saying, “Come on, let’s not mention those sad things anymore. Let’s toast and get plastered! No one’s leaving until we’re smashed! Hahaha!”</p><br/><p>Under the dim lantern lights, her entire little face was flushed red. Her gossamer eyes were impossible to unravel as she gazed at him. From her delicate red lips came the fragrance of wine that brushed his heart like feathers. Baili Yu’s eyes slightly darkened as he reached out and pulled Tang Doudou, who was noisily exhorting for him to drink, into his arms.</p><br/><p>“Ah, why did I fly up earlier?” The alcohol was affecting her more and more. By now, Tang Doudou was drunk to the point she couldn’t be any drunker. When she saw Baili Yu’s handsome face magnified in front of her, she started giggling. “Little fella, you sure are pretty!”</p><br/><p>Following that, she pursed her lips and wrapped her two soft arms around the back of Baili Yu’s head. With a lustful smile, she moved closer and said, “Pretty little fella, give Big Sis here a kiss!”</p><br/><p>Big Sis?</p><br/><p>A light flashed through Baili Yu’s eyes as if he realized something. Following that, his long and narrow fox-like eyes narrowed as he gave a low chuckle. “So it was like this.”</p><br/><p>“So it was like this? Haha, it is like this, give me a kiss like this. An awesome one!” Tang Doudou laughed with a ‘hehe’, completely unaware of what exactly was coming out of her mouth.</p><br/><p>Baili Yu lowered his gaze and looked at her silly and lovable drunk appearance. No wonder he had always felt that she had too strong of a feminine air, so it turned out that she was a woman from the start. No wonder he always felt something unusual towards her. With this, everything made sense.</p><br/><p>The Li Xueyi who was by nature unconventional, outstanding, wanton and unrestrained was actually a woman! It was truly a huge pleasant surprise!</p><br/><p>Just a couple cups of wine were enough to let him find out such a huge secret. This exchange had been quite worthwhile.</p><br/><p>Then, Baili Yu propped up his chin as he recalled the deal he made with the Lord of Cloud City last time. After considering it for so long, in the end, should he agree to it or not?</p><br/><p>Even though he had brought up that deal in front of Li Xueyi multiple times, in reality, he was just teasing her a little for fun. He hadn’t actually agreed to that deal yet. Not to mention, the Lord of Cloud City had disappeared after the martial arts convention and there hadn’t been any news of him at all.</p><br/><p>It was said that even Bai Feiyun hadn’t been able to see him the last time he went to Cloud City.</p><br/><p>“Hey, there’s a big beauty right here offering you a kiss, give some reaction ah!” Tang Doudou had pursed her lips half the day, but the other party wasn’t reacting to her at all, so she immediately started whining unhappily.</p><br/><p>Baili Yu lowered his gaze to look at Tang Doudou’s intoxicated, hazy eyes. He suddenly extended his hand to tip her chin upwards as his deep and magnetic voice sounded. “Is Alliance Head Li seducing this one?”</p><br/><p>“Seduce? Hehe, that’s wrong!” Tang Doudou peeled off his fingers one by one and giggled for a while. Then she sat up and lightly pushed Baili Yu over. Pressing him down onto the soft couch, she lightly winded a few strands of Baili Yu’s silky black hair around her fingers. “It’s you! You’re the one seducing me!”</p><br/><p>Tang Doudou’s head was incomparably muddled right now. She couldn’t make sense of what was going on at all. All she knew was that there was a very very handsome, seductive yao-like, ancient-styled man from the asceticism department* beneath her. His half narrowed eyes had flashed with an unknown light and that deep voice was filled with an alluring charm that was definitely trying to seduce her. Seduce her into committing a crime.</p><br/><p> – “asceticism department” is internet slang. Typically used to describe good-looking men with an indifferent and elegant outward appearance whose personality is taciturn and cold. The most important characteristic is that they aren’t moved by women and seem to have no desires, but in reality, they’re not truly cold, just not that strongly attached to emotion. But once they fall in love, they’ll be super passionate and completely not care about anyone else. To describe it in one sentence, it would be “of few words, facial nerves paralyzed, expression cool; beauty sharp to the point they penetrate bone like knives”</p><br/><p>“Oh? So I’m the one seducing you?” Baili Yu smiled even more happily. His eyes slightly narrowed as a dangerous light entered them. To actually push him down! The proverb that alcohol can even strengthen a mouse’s guts was probably referring precisely to this?</p><br/><p>Then he’d like to see just how daring this girl could get when drunk!</p><br/><p>The light in Baili Yu’s eyes as he smiled dazzled Tang Doudou’s eyes, so she reached out and covered them. “Hell, you’re definitely a vixen that has come to seduce innocent young girls into committing crimes!”</p><br/><p>After she had finished speaking, she felt a little weak and decided to just lie down on that broad chest. She wanted to find a comfortable position and rest for a while, but as she was moving, the sight of Baili Yu attracted her gaze. She was currently covering Baili Yu’s eyes, so all that was exposed was his high nose bridge and his sensual lips; the corners of which were slightly raised as if inviting her to taste them…</p><br/><p>Gulping, Tang Doudou widened her eyes as she stared at those sexy lips. Her head was filled with hoots telling her to ‘kiss it, kiss it!’</p><br/><p>She couldn’t hold back anymore and her head moved downwards. A sudden flaming heat emerged in her lower abdomen. Simultaneously, in a lapse of rationality as her brain shut down, she pursed her lips and brought them closer to him.</p><br/><p>Baili Yu’s eyes were covered by her hands, but he knew every single move she was making. He sensed her approaching. Following that, a fresh and faint fragrance got closer and closer. The fragrance was like a little blossoming flower bud in spring, and his body was even starting to react a little!</p><br/><p>Just as Tang Doudou’s lips neared Baili Yu’s cheek, Baili Yu lightly lifted his eyebrows, and Tang Doudou immediately felt the sky and earth flip. When the sensations had stopped, her body had been covered by his and her chin was tilted upwards once again.</p><br/><p>“Since Xueyi has taken the initiative to offer your body, then this one won’t be overly courteous anymore either!” After saying so, he lowered his head. Silk-like strands of fine black hair spilled down, brushing onto the forehead, face, neck of the person beneath him…</p><br/><p>Tang Doudou was tickled to the point she felt uncomfortable. She slapped aside the hand that was tipping her chin up and mumbled, “Behave.”</p><br/><p>She hadn’t heard what Baili Yu murmured at all.</p><br/><p>Baili Yu lowered his head as the image of Tang Doudou’s rosy cheeks filled his eyes. His breathing gradually grew heavier and his gaze deepened. He would send someone to tell the Lord of Cloud City tomorrow that he was accepting this deal.</p><br/><p>But just as he was about to lower his body again, he discovered that Tang Doudou had fallen sound asleep in the middle of her mumbling.</p><br/><p>And she was even still smacking her lips as she rubbed her face into the fox fur with an extremely satisfied expression. Her restless hand felt all around, seemingly tugging at the blanket.</p><br/><p>Ha, after igniting a fire, you’re going to sleep just like this on your own?</p><br/><p>Baili Yu’s lips hooked upwards in a trace of a self-mocking smile. As he looked at Tang Doudou’s sleeping figure, he actually felt a little regretful. He sighed almost soundlessly. Just as he was about to get up, he was once again pulled back down by Tang Doudou who had been looking all around for the blanket. As two soft arms tightly wrapped around him, he heard her mutter, “My little angel, be good oh, don’t run around, ok…”</p><br/><p>Baili Yu’s brows jumped. She couldn’t even sleep properly. And who was that ‘little angel’?</p><br/><p>The sound of even breathing filled the room again. This time she was probably completely asleep?</p><br/><p>Baili Yu lifted his hand. Several streams of wind flew over and the wooden room completely sunk into darkness. Baili Yu gently pulled apart the arms that were hugging him, before flipping around and laying down next to Tang Doudou. Taking out the blanket Tang Doudou had draped over him in the afternoon from behind the soft couch, with a single lift of his hand, he covered it over the two of them.</p><br/><p>After that, he also slowly closed his eyes as his lips hooked slightly upwards. What kind of reaction would she have tomorrow when she saw this scene?</p><br/><p> What kind of reaction Tang Doudou would have was something to be discussed later. Right now, Ye Chuan, who was guarding outside the door, was having extremely complicated emotions.</p><br/><p>After the lights in the room went out, his brain went blank. The only thing that continuously echoed in his brain was: Master, Master really was homosexual!?</p><br/><p>This, this was way too terrifying!</p><br/><p>Ye Chuan shuddered, then another thought came into his mind – now that he knew this secret, would he be ‘kacha kacha’-ed by Master?</p><br/><p>“Ye Chuan, as I thought, you really are here!” Jun Xin flitted over from not far away. He looked at Ye Chuan who was spacing out and waved at him. “What are you spacing out for? Where’s Baili Yu? In the wooden house?”</p><br/><p>Startled back to his senses by Jun Xin, Ye Chuan hurriedly saluted towards him in greeting. “Young Master Jun.”</p><br/><p>“Is your master over there?” Jun Xin said as he pointed towards the wooden house at that side before starting to walk in that direction. Since Ye Chuan was here, Baili Yu would definitely be here as well.</p><br/><p>“Young Master Jun, you can’t go over there!” Ye Chuan saw that he was about to head over and hurriedly blocked Jun Xin’s path.</p><br/><p>Jun Xin asked, confused, “Why?”</p><br/><p>“Ahem!” Ye Chuan realized he didn’t know what to say after blocking Jun Xin. There’s no way he could possibly tell Young Master Jun that Master and Li Xueyi were inside doing that, right?</p><br/><p>No way. In this entire garden, who besides Li Xueyi didn’t know that Young Master Jun had been heading over every day these past nights to guard Li Xueyi?</p><br/><p>The only thing was that they didn’t know exactly what good points that Li Xueyi had to actually cause both of them to fall for him.</p><br/><p>It must be known that even though these two usually didn’t approach female charms, they were not homosexual at all either!</p><br/><p>Ye Chuan was also very at a loss as to what exactly was going on.</p><br/><p>Seeing those confused expressions flash through Ye Chuan’s eyes, Jun Xin suddenly got a bad feeling. He continued interrogating, “Who is your master with?”</p><br/><p>He had been looking for Tang Doudou the entire day, but still hadn’t found her. In his anxiety, he went to find Baili Yu but still met with a dead end since Baili Yu had also disappeared.</p><br/><p>So he had searched all around the plum sea again. At the very end, when he returned to Plum Garden, he heard Meng Yu say that Baili Yu wanted to celebrate the Winter Solstice over at the wooden houses. At that time, he thought that the sun had risen from the west. That guy actually wanted to celebrate a holiday!?</p><br/><p>Originally, he had been planning on heading over right away. However, Bai Feiyun approached him to talk to him about some matters. Once he had finished everything and headed over, it had already gotten this late.</p><br/><p>The two had both disappeared. Baili Yu was prompted by a sudden impulse to celebrate some Winter Solstice over here, and now, Ye Chuan looked like he wanted to say something but was continuously hesitating. Due to this, Jun Xin couldn’t help but associate all these things together.</p><br/><p>Ye Chuan had known since long ago that Young Master Jun was incomparably intelligent. When he heard Jun Xin ask this, he immediately felt apprehensive. Based on Jun Xin’s temper, if he found out that Master and Li Xueyi were really together, he’d definitely rush right in.</p><br/><p>At that time, when Master’s happy occasion was interrupted, the one who’d suffer the punishment would definitely be him!</p><br/><p>Ye Chuan’s brain raced. His lips tugged and formed a lie before he could even think it through. “He’s with a lady.”</p><br/><p>Jun Xin knitted his brows disbelievingly. “A lady? From which family?”</p><br/><p>Seeing doubt flash through Jun Xin’s eyes, Ye Chuan knew that as long as he stayed firm, he’d be able to thoroughly fool Jun Xin. “She seems to be from the Imperial Violet Nation. As for the specifics, I’m not too clear. At that time, Master got drunk and just…”</p><br/><p>He didn’t finish his words, but the meaning was perfectly clear.</p><br/><p>Jun Xin muttered to himself for a while. “Are you speaking the truth?”</p><br/><p>Ye Chuan hastily nodded and said, “This subordinate doesn’t dare to conceal things from Young Master Jun! It truly is like this.”</p><br/><p>Since it wasn’t Tang Doudou inside and it was definitely an inconvenient time to see Baili Yu, Jun Xin decided to go back to Plum Garden and find Qing Yin to see if Tang Doudou had returned.</p><br/><p>__________</p><br/>\n</div>"}