{"title": "Chapter 74: Kidnapped", "id": 74, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-74-kidnapped", "volume_title": "Volume 1", "body": "<h1>Chapter 74: Kidnapped</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Boss Qing walked over, hips swaying seductively, then lifted her leg and gave Tang Doudou who had collapsed unconscious onto the floor a kick. When Tang Doudou didn’t react, she bent down to pinch Tang Doudou’s pink cheeks and laughed sweetly. “This pleasant little appearance even makes me feel pity for you. No wonder that person couldn’t stop thinking about you.”</p><br/><p>It was unknown who exactly she was talking about. All that could be seen was that after she finished speaking, she got up and commanded the guard hidden in the darkness, “Bring him back.”</p><br/><p>“Understood!”</p><br/><p>When Tang Doudou woke up, her eyes opened to a mass of pitch-black darkness. The surroundings were damp and there was a revolting smell of mold mixed with rot. She reflexively tried to cover her nose but discovered that her hands were tied behind her back and she couldn’t move at all.</p><br/><p>What the f*ck!? What kind of situation is this?</p><br/><p>She looked around again but it was so dark she couldn’t see anything. She exhaled and struggled a bit before she gave up. Her hands and legs were tied up very tightly and behind her was a cold rock wall. Below her feet there seemed to be something like rice straw or hay that was uncomfortably moist.</p><br/><p>From the darkness came the continuous sounds of chittering rats. From the sounds of it, it seemed like there were a lot of rats. Tang Doudou shivered as she thought about it. She once heard that when rats didn’t have anything to eat, they would even eat human flesh…</p><br/><p>Could it be that someone kidnapped her to feed the rats!?</p><br/><p>Wuuwuu, please don’t ah. That’s way too terrifying.</p><br/><p>Tang Doudou was scared half to death by her own thoughts. Straining her throat, she started shouting, “Hey, is there anyone here!? Is there anyone here ah!?”</p><br/><p>Her voice transmitted very far in the darkness and there was even a slight echo bouncing back. It seemed that this was a very spacious and empty area.</p><br/><p>“It’s a fire! Help, it’s murder!”</p><br/><p>“Hey!”</p><br/><p>Tang Doudou yelled for half the day, but didn’t even see a trace of a ghost. It was seriously depressing ah. And she didn’t even know which moral-less bastard it was that kidnapped her and brought her to this damned place. There’s no need to talk about how this place was creepy to the point birds couldn’t even shit since there was not even a single bird feather lying around!</p><br/><p>Which hallowed deities were Boss Qing and the Pavilion Master she had talked about? She had only fainted after talking with Boss Qing and smelling that strange fragrance, so her current situation must be linked to those two.</p><br/><p>She didn’t even know how she provoked them. However, after coming here, she always ended up getting shot at even when lying down. Tang Doudou felt that after such a long time, she should have gotten used to it.</p><br/><p>The most depressing part was the fact that the antique lamp she finally managed to obtain ended up lost somewhere again. It’s seriously fudging bad luck.</p><br/><p>Wonder if someone would come to save her? After all, she went missing in Rutaceae Pavilion. She didn’t harbor any extravagant hope for Baili Yu, but Bai Feiyun would definitely come to save her. It was just a question of time…</p><br/><p>However, the most troublesome matter at present was the fact that her great auntie was currently overflowing. She had only stuffed a few layers of cloth in there before she headed out and it had already been long soaked through. Right now, it felt sticky and especially uncomfortable.</p><br/><p>After thinking about random things for a while, Tang Doudou decided that she couldn’t sit and wait for death, nor could she hope for someone to save her. The fact that Boss Qing dared to brazenly make her move in Rutaceae Pavilion while Baili Yu was still there, meant that the person behind her wasn’t afraid of Baili Yu. This was actually her first time encountering someone that wasn’t afraid of Baili Yu, so she couldn’t help but be curious about this person’s identity. Who could he be?</p><br/><p>“Urgh, what is this place?”</p><br/><p>A pained groan suddenly came from the darkness along with a familiar voice. Tang Doudou froze for a moment, then asked in surprise, “Lou Qingyun? Why are you here too?”</p><br/><p>Lou Qingyun was obviously also shocked to hear her voice. “Alliance Head Li? Is that you?”</p><br/><p>“It’s me.”</p><br/><p>“Where is this? Wasn’t I drinking wine with Lady Yun Yan? How did I end up here?’ From the way Lou Qingyun was continuously sucking in cold air, his situation seemed even worse than hers. It seems he was injured.</p><br/><p>However, Tang Doudou could only shrug to express her lack of answers to his question. “Who knows what happened to you?”</p><br/><p>In the dark, Lou Qingyun could not see her movements but could still tell from her tone that she didn’t know what this place was.</p><br/><p>After being silent for a long time, Lou Qingyun opened his mouth again to ask, “Wasn’t Alliance Head Li with Baili gongzi? Where is Baili gongzi now?”</p><br/><p>“Who freaking knows?” replied Tang Doudou, annoyed. Did this guy’s brain get messed up from a fall or something? If she really was with Baili Yu, how could she have been dragged to this goddamned place?</p><br/><p>After Lou Qingyun asked, he also realized that this was a dumb question and gave a couple dry coughs. Then, he changed the topic. “I wonder who it was that kidnapped us? And what’s their goal…”</p><br/><p>“Surnamed Lou, who is that Boss Qing? Before I fainted, she said that the Pavilion Master invited me. I didn’t recognize any pavilion masters so I didn’t go. However, unexpectedly, before I even took a few steps, I passed out.” Lou Qingyun was very familiar with Rutaceae Pavilion so perhaps he knew who the Pavilion Master was.</p><br/><p>“Pavilion Master?” As expected, after Lou Qingyun heard this, he started mulling over it. Only after a good while did he reply with some confusion, “If it’s the Pavilion Master of Rutaceae Pavilion, Alliance Head Li shouldn’t be here!?”</p><br/><p>The meaning within these words were worthy of being analyzed!</p><br/><p>“However, Boss Qing is the person in charge of Rutaceae Pavilion. The Pavilion Master she’s talking about can only be himT/N.” Lou Qingyun muttered as if he was talking to himself.</p><br/><p>Tang Doudou then asked, “You know that person?”</p><br/><p>“I don’t.”</p><br/><p>It was outside of expectations that Lou Qingyun also didn’t know that person. However, he soon continued, “I’ve only heard of him before.”</p><br/><p>“Who exactly is he? Why did they bring us to this place for no reason? I haven’t offended anyone lately either…” Tang Doudou’s arms hurt from the tight rope. “Hey, surnamed Lou, did you get injured? I heard you groan earlier?”</p><br/><p>“It’s a knife wound. Someone slashed several cuts on my arm.” Lou Qingyun’s voice seemed pretty depressed. He was originally off to find a beauty but ended up being injured by someone and thrown into this creepy place. Anyone would be depressed from this.</p><br/><p>After being gloomy for a while, Lou Qingyun spoke again. “He’s the master of Rutaceae Pavilion and rumor says that he’s very good friends with you… But it can be seen that the rumors are mistaken!”</p><br/><p>“There’s definitely a mistake. What dog fart of a good friend could he possibly be!? From what I see, he’s more like a archenemy!” When Tang Doudou heard what Lou Qingyun said, she immediately understood that this was another present from Li Xueyi.</p><br/><p>“Alliance Head Li,” Lou Qingyun suddenly called out.</p><br/><p>“Let’s just wait patiently. Since they’ve brought us here, there’s no way they would keep hiding without appearing.” Tang Doudou thought that Lou Qingyun was going to ask about that Pavilion Master again so she just casually comforted him while thinking about how to get rid of the rope tying her hands.</p><br/><p>“That’s not what I want to ask,” said Lou Qingyun.</p><br/><p>Before Tang Doudou could reply, he went on to ask, “Alliance Head Li, are you injured anywhere?”</p><br/><p>“Injured?” Tang Doudou shifted around a little and didn’t feel anything strange anywhere on her body. “I’m not ah. What about it?”</p><br/><p>“Ahem, how unlucky ah!” Lou Qingyun’s voice sounded a bit weak as he spoke with a helpless tone. “It seems like there’s something sucking my blood. I was thinking of reminding you to be careful, but since you don’t have any injuries on your body, you’ll probably be fine.”</p><br/><p>“What you mean is that someone purposefully injured you to make you bleed? And the thing feeding on your blood is right next to you?” Tang Doudou immediately felt her hair rise up on its ends and started warily eyeing the darkness as a surge of horror attacked her. Da fudge! What kind of situation was this!?</p><br/><p>Lou Qingyun nodded, but then immediately realized that it was too dark for Tang Doudou to see anything. So then, he said, “You don’t need to worry. This thing is only sucking blood from the open wounds. It’s not interested in places that are in good condition.”</p><br/><p>My meow! This is what makes it scary, alright?</p><br/><p>Tang Doudou was speechless in reaction to what Lou Qingyun said. The way he talked about it was as if the person whose blood was being sucked wasn’t him. Thick nerves like this seriously could compete with hers.</p><br/><p>“Hey, Lou Qingyun, are you alright?” Tang Doudou was silent for a while. When she didn’t hear any reaction from Lou Qingyun’s side, she immediately became panicked. It wasn’t that she was worried about him but that in this sort of darkness one would feel much more relaxed with someone to talk to in order to distract themselves.</p><br/><p>If one out of the two that were talking suddenly became completely silent, the other would definitely feel alarmed and wonder if there was some danger in the darkness.</p><br/><p>“I-I’m fine,” Lou Qingyun replied faintly. “It’s just that this thing sucks blood really quickly. My head feels a bit dizzy and I feel weak all over.”</p><br/><p>“What exactly is it?”</p><br/><p>“I can’t see it clearly, but it vaguely feels like a sort of bug… And there doesn’t seem to be just one.”</p><br/><p>“A bug? What kind of bug?” Perhaps it was because he lost too much blood, Lou Qingyun’s voice was incomparably weak. It came in bits and pieces. Tang Doudou could only hear something about a bug and wasn’t able to hear the rest.</p><br/><p>Lou Qingyun replied weakly, “I don’t know…”</p><br/><p>“Lou Qingyun, you better not faint!” God knows if he’ll wake up again after he fainted!</p><br/><p>“I don’t want to faint either, but, but I seriously can’t hold on anymore…”</p><br/><p>“Even if you can’t hold on anymore, you still have to hold on. You’ve lost too much blood. If you faint, then it’s very likely that you’ll never be able to wake up again!” Tang Doudou shouted as she shifted her body towards the side. She wanted to go over there to see exactly what was sucking Lou Qingyun’s blood. From the sound of his voice, he only seemed about a meter or so away from her.</p><br/><p>As she laboriously inched forward, her hand suddenly come into contact with something.</p><br/><p>What is this? It seems to be a rock. Once she realized she had touched a rock, Tang Doudou became elated. She shifted her bound hand towards that rock, planning to use that rock to rub through the rope that was tying her up.</p><br/><p>“Lou Qingyun, you better not faint! I’m heading over!” Tang Doudou worked as she shouted towards Lou Qingyun. Hell, that guy better not die ah! If he died, she dared to guarantee that the next person that would be cut up to bleed would definitely be her!</p><br/><p>What exactly is that rotten Pavilion Head? To actually use human blood to feed bugs? It’s seriously terrifying!</p><br/><p>Li Xueyi ah, Li Xueyi. What is with all these evil cow ghosts and snake gods around you!?</p><br/><p>Tang Doudou silently cursed the damned ghost, Li Xueyi, for leaving so much trouble for her to bear after her death.</p><br/><p>The surroundings once again returned to the same tranquility she woke up to. Tang Doudou couldn’t help but start worrying about Lou Qingyun. He hasn’t made a sound for half the day. Could it be he really fainted and died?</p><br/><p>As she thought about it, her hand movements sped up. Just as she was grinding the rope, she happened to feel that the edge of that rock was very thin, like an unpolished blade.</p><br/><p>Her face lit up with joy. She hastily placed her center of gravity there and swept the rope back and forth as if her life depended on it. Effort does not turn its back on people with determination. Just when her hands were sore to the point she couldn’t even lift them anymore, her hands were finally released. The rope had snapped!</p><br/><p>She quickly pulled off the remaining rope, then reached out to undo the rope on her feet. However, right at this moment, something cold and soft fell from the sky and onto her forehead!</p><br/><p>__________</p><br/>\n</div>"}