{"title": "Chapter 89: Give a Call of Lord Husband", "id": 89, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-89-give-a-call-of-lord-husband", "volume_title": "Volume 1", "body": "<h1>Chapter 89: Give a Call of Lord Husband</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It was widely spread on the Jianghu that Li Xueyi’s conduct was unreasonable, audacious, and that he tended to take things too far, never caring about the consequences. People who have encountered him before say: must never offend.</p><br/><p>It was widely spread on the Jianghu that Baili Yu’s personality was strange and that he was arrogant and despotic, always disregarding the severity of his actions. People who have encountered him before say: must never offend.</p><br/><p>Yet the two people on the Jianghu that must not be offended the most were brought together here.</p><br/><p>Xi Qiuyue seriously felt a terrible headache ah! He wished he could just turn around and run far, far away so that he never has to encounter these two again.</p><br/><p>Yet the person that was being tied up, trampled and punched was his biological nephew, the current Emperor, the ruler of Wind Spirit Imperial Court…</p><br/><p>Other than him, there was no one else present that dared to get involved with this matter. Thus, he could only brace himself to face it.</p><br/><p>He first lifted his hand and ordered the still stunned subordinates of the Prime Minister and the other families to withdraw. Then, he had the guards seal the entire courtyard before he turned to look at Xi Qiulin. He saw that Xi Qiulin was tonguetied due to extreme anger but without any serious injuries, so he turned towards Baili Yu with a wry smile. “Resplendent Prince should stop before going too far, don’t cause a disturbance that can’t be contained…”</p><br/><p>“En, I know.”</p><br/><p>If you know, then why aren’t you telling Li Xueyi to stop?</p><br/><p>Xi Qiuyue rolled his eyes. How could it be possible for him to miss the fact that Baili Yu was just speaking for show right now?</p><br/><p>“No matter what, Ah Lin is still the current Emperor. At that time, you had also promised the late Emperor to look after him. Later, you said you preferred the quiet and wasn’t willing to stay in the Imperial Court so the late Emperor allowed you to hide your identity and change your family name. That was how the idle Baili Yu of present had been able to come into existence…”</p><br/><p>Baili Yu smiled lightly. “Is Sangfroid Prince speaking of past friendship with me?”</p><br/><p>As he spoke, the radiance in his eyes increased until it overflowed. His eyes seemed to revolve like ten thousand colored glass pieces and were dazzling to the point they seized one’s soul. However, it actually brought a freezing chill to Xi Qiuyue and he itched to just slap himself. Why of all things did he insist on talking about back then!?</p><br/><p>If it weren’t for that incident back then, why would they be so afraid of Baili Yu?</p><br/><p>“Resplendent Prince, you shouldn’t overthink this. Ben wang was just, just…”</p><br/><p>“You just wanted me to let him go, right?”</p><br/><p>“Although you have no misgivings, if his status really became revealed, you will have to pass your future days fending off continuous assassination attempts.”</p><br/><p>“Ha. Sangfroid Prince thinks that I can’t even protect my own wife?”</p><br/><p>“No, no, that’s not what I meant! It’s just that there’s no way you can stay by his side his entire lifetime to protect him, right!? Not to mention, even if you can protect him, would you be able to protect all the people at his side? Resplendent Prince, your heart is clear as a mirror. How could you not know what I mean!? Or is it that what Resplendent Prince desires is precisely this type of outcome?” Although Xi Qiuyue was usually in an intoxicated stage and did not pay attention to the affairs of the world, he had still walked out from mountains of corpses and seas of blood. How could it be possible for his thoughts to be as simple as how he acted?</p><br/><p>He had said this in an extremely small voice. However, by the time he got to the end, his expression had become serious and his tone also changed a lot.</p><br/><p>At the other side, Tang Doudou had been chattering on and on this entire time. Based on what she said, she was giving Xi Qiulin a lesson on how to act as an emperor since she was his Imperial Aunt.</p><br/><p>She didn’t catch most of what Baili Yu and Xi Qiuyue had been saying at all. On the contrary, after speaking half the day, her mouth felt dry and rough. Hence, she released Xi Qiulin, picked up the tea nearby and drank a large mouthful. Then she shouted towards Baili Yu, “Hey, big evil spirit, I only beat up this guy for your sake so I’m counting on you to settle the rest for me!”</p><br/><p>Baili Yu, who had just finished listening to what Xi Qiuyue said, heard these words sharp and clear. His smile immediately became even more splendid. “Wife ah, it seems this husband won’t be able to settle this matter!”</p><br/><p>“What!?” His words alarmed Tang Doudou so much that she hastily put down the tea cup. Without even removing the tealeaf next to her lips, she kicked aside Xi Qiulin who was blocking her way to run behind Baili Yu. She shrank her neck back a little, then hooked an arm around Baili Yu’s shoulder as she asked, “Big evil spirit, you’re joking, right?”</p><br/><p>“How come everyone seems to enjoy asking me if I’m joking today? Could it be the words I speak are really that amusing?” Baili Yu lifted his hand and squeezed her exquisite nose. This woman’s eyes clearly didn’t even have a bit of fear, yet she’s still acting as if she was scared. If she’s scared, then just be scared. Could she make it so that self-pleased smile hanging at her lips wasn’t so obvious?</p><br/><p>It looks like she had already realized that Xi Qiuyue and the rest feared him. Otherwise, based on how much she feared dying, how could she have possibly gone to thrash the Emperor for him?</p><br/><p>Although this was the case, Baili Yu was still pretty happy and cheerfully stroked Tang Doudou’s ponytail. “Is Wife willing to flee with this husband to the ends of the earth?”</p><br/><p>Tang Doudou glowered with wide eyes. She had only summoned up her guts to go thrash that hateful Emperor because she saw that Baili Yu had a card up his sleeve!T/N</p><br/><p>But now he’s saying he can’t handle it and will even have to flee to the ends of the earth!</p><br/><p>How come she feels like she was trolled by this evil spirit?</p><br/><p>Xi Qiuyue loosened a breath in relief when he heard that Baili Yu was about to leave. As long as this didn’t continue, everything would be easy to resolve.</p><br/><p>“Come! Archers! You are not allowed to let go of the Resplendent Prince and that female brute! Shoot them dead, zhen commands you to shoot them dead!”</p><br/><p>Right after Xi Qiuyue sighed in relief, Xi Qiulin climb up from the ground with a very ominous expression. After he angrily pulled off the rope around his body, he gave the hidden guards an unquestionable command to kill!</p><br/><p>It shocked Xi Qiuyue so much that he immediately opened his mouth to prevent it. Xi Qiulin saw his intention and gave a cold smile. “Sangfroid Prince, zhen recalls our past friendship and will not blame you. The role of mediator does not suit you. You should stick to acting like the Common Person Wang you are!”</p><br/><p>After hearing what Xi Qiuyue said and recalling Baili Yu’s attitude, there was no way Xi Qiulin wouldn’t have figured out that this Tang Doudou in front of him was the Li Xueyi everyone had been talking about lately!</p><br/><p>Jianghu renegades!</p><br/><p>He hadn’t gone to pick faults with him, yet the bastard actually jump out to insult him like this!</p><br/><p>Seriously hateful!</p><br/><p>Baili Yu was even more abominable. They had truly wronged him in that incident back then. However, after so many years, they had also indulged him in so many preposterous matters. That debt was long repaid!</p><br/><p>Kill! If he doesn’t kill him, how was he supposed to swallow this anger!?</p><br/><p>By now, Xi Qiulin had already lost his rationality. After being taken by the guards to a safer location, his panda eyes burned with flames of rage. He itched to just burn to death this two maniacs that didn’t show him any due respect!</p><br/><p>Xi Qiuyue sighed. He gave Tang Doudou a ‘pray for yourself’ expression, then turned and left.</p><br/><p>If it’s a Common Person Wang then he’ll just take being the Common Person Wang. It’s much more carefree than being the Sangfroid Prince.</p><br/><p>Xi Qiulin felt nameless fires ignite again when he saw Xi Qiuyue leave with such a carefree attitude. Originally, he wanted to let the Sangfroid Prince return to court to help him but now everything was messed up!</p><br/><p>It was all because of these two!</p><br/><p>At once, he ordered in a sinister tone, “Release the arrows!”</p><br/><p>Tang Doudou looked at the arrows that flashed with cold light in the shadows and was immediately scared out of her wits. “Big evil spirit, this, what are we supposed to do ah!?”</p><br/><p>“Wife, give a call of Lord Husband. Then this husband will tell you!” Even in this situation, Baili Yu was still calm as usual as he teased Tang Doudou.</p><br/><p>“Don’t mess around anymore, hurry up and tell me! If you wait any longer to say it, it’ll be too late and we’ll become hedgehogs!” Tang Doudou was completely panicked and itched to just chomp Baili Yu’s smiling face. How can he still smile with things like this!?</p><br/><p>“It was impossible to be born on the same year, same month, and same day as wife, but being able to die on the same year, same month, and same day as wife is enough for this husband to have no regrets.” Baili Yu tilted his head and gazed at Tang Doudou with deep passion in his eyes.</p><br/><p>Tang Doudou covered her forehead. She was just about to tell Baili Yu that she didn’t want to be cut off in her prime and that she also didn’t want to die with him when the sounds of bows being stretched taut reached her ears. She was so alarmed she hastily slapped this idea out of her head. Grabbing Baili Yu, she shouted, “Lord Husband!”</p><br/><p>“This husband is here!” Only then did Baili Yu expose a satisfied smile and reply happily. From the joy that leaped into those eyes, it could be seen that he was sincerely happy. However, the situation was so urgent that there was no way Tang Doudou had the presence of mind to look at that.</p><br/><p>She grabbed tightly him and shouted, “Damned fox, I’ve already called you. Hurry up ah!”</p><br/><p>“If I hurry I’m worried Wife won’t be able to take it…” After giving a frivolous sigh, Baili Yu reached out to press Tang Doudou against his chest. “Wife, hold on tight. This husband will be fleeing with you now.”</p><br/><p>“F*ck! Flee as if! Your great uncle ah! With this many arrows… ah!”</p><br/><p>After hearing such an unreliable idea, Tang Doudou immediately lifted her head to try and bite Baili Yu’s chest. However, she saw that the entire sky was filled with closely packed arrows. The sight startled her so much she almost fell from Baili Yu’s embrace. Luckily, Baili Yu had sharp eyes and quick enough reflexes to catch her.</p><br/><p>“Hold on tight, this husband doesn’t like dead hedgehogs, alright?” After he finished speaking, Tang Doudou felt herself fly upwards.</p><br/><p>They rushed into the sea of arrows above their heads like a graceful swallow. Tang Doudou rested her head on Baili Yu’s shoulder as she watched those sharp arrows fly past in front of her. They were so intense they caused her eyes to smart.</p><br/><p>“Be good, close your eyes.” From above her head came Baili Yu’s gentle exhort that felt as warm as his comforting embrace. Immediately, Tang Doudou felt safe and closed her eyes.</p><br/><p>“Baili Yu, this Big Sis’s life is in your hands. No matter what, don’t let me die ah!” Tang Doudou muttered this in a small voice as she closed her eyes.</p><br/><p>Baili Yu lowered his eyes and swept his gaze past the shadows cast by her eyelashes. Suddenly, his gaze turned serious and his moon-white robe lifted as if it was light as a feather. A cool breeze appeared around him that soon became a large gale. It wrapped up all the arrows, causing them to bump into each other. Following that, unbelievably beautiful petals filled the skies. As the sweet scent drifted over, the courtyard was instantly beautiful as a painting. And in the very center of that painting was that dazzling, peerless being.</p><br/><p>“Three Thousand Overlooking Blossoms, kill!”</p><br/><p>A voice that was completely void of warmth like that of Asura’s resounded in the courtyard. Those beautiful petals immediately turned into the sharpest life-taking blades in the world and rapidly slashed past those guards. The guards that had tightly surrounded the outside of the courtyard instantly fell like seedlings. Once they realized how dangerous those beautiful petals were, they started to flee in disarray.</p><br/><p>Xi Qiulin was incomparably shocked as he watched all of this. Could martial arts like this still be called martial arts?</p><br/><p>It was seriously too terrifying!</p><br/><p>However, he soon calmed down. No matter how amazing Baili Yu was, he was still just a person. If ten people cannot beat him, then do it with a hundred. If a hundred won’t do, then just do it with a thousand, ten thousand!</p><br/><p>He just doesn’t believe that Baili Yu can’t be killed!</p><br/><p>“Come, take zhen’s verbal order to bring a group of imperial guards from the Imperial City!”</p><br/><p>“Understood!”</p><br/><p>The guard accepted the order and turned around. However, he immediately froze and stopped moving.</p><br/><p>“What are you standing for, hurry and…”</p><br/><p>Before Xi Qiulin even finished speaking, he saw that guard slowly turn around with his eyes opened gaping wide, his pupils gradually slackening.</p><br/><p>Blood murmured out from his throat and instantly dyed that snow-white flower petal on the injury the color of blood. Blood fell drop by drop. Then, with a thud, the guard collapsed onto the ground, thoroughly dead.</p><br/><p>Xi Qiulin was so alarmed by the frightening expression on the guard’s face as he died that he retreated several steps. His face turned white, then even paler. If that petal had landed on his neck…</p><br/><p>He didn’t even dare to continue thinking about it.</p><br/><p>As for Baili Yu, he dealt with the guards easily as if he was just drawing a stroke. Afterwards, he glanced at Xi Qiulin in the distance, then give a big smile as he carried Tang Doudou towards the Ninth Heaven. In a blink, he disappeared into the horizon.</p><br/><p>His posture as he glided through the air was truly like that of celestials.</p><br/><p>__________</p><br/>\n</div>"}