{"title": "Chapter 88: Let This Big Sis Give You A Lesson on How To Act as an Emperor", "id": 88, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-88-let-this-big-sis-give-you-a-lesson-on-how-to-act-as-an-emperor", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Let This Big Sis Give You A Lesson on How To Act as an Emperor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Pfff!</p><br/><p>The wine in Xi Qiulin’s mouth spurted out and covered the Prime Minister.</p><br/><p>The Prime Minister couldn’t worry about the wine on him. He took out a handkerchief and reached over to help Xi Qiulin wipe his mouth.</p><br/><p>Xi Qiulin was fed up. He snatched the handkerchief and pushed the Prime Minister aside. After wiping the wine from his lips, he forced a smile as he looked towards Baili Yu. “Resplendent Imperial Uncle, you’re joking again.”</p><br/><p>“What makes Your Majesty think I’m joking?” Baili Yu got up and slowly walked down from the high stage. His ink hair lightly lifted with his every movement and his moon-white robe was bright and clear as frost. He seemed as pure and untainted as those celestials in paintings.</p><br/><p>“Not joking? Then what did Resplendent Imperial Uncle mean by what you said earlier?” Xi Qiulin’s eyes were dark as he puzzled over what exactly Baili Yu meant to do. Who in this world didn’t know that he liked men? That after he saw the new Alliance Head, Li Xueyi’s captivating looks, he no longer cared about having a respectable identity and insisted on becoming a bride of the Alliance Head Residence.</p><br/><p>Baili Yu didn’t reply to Xi Qiulin and instead walked directly to Tang Doudou.</p><br/><p>As of now, Tang Doudou couldn’t be counted as short. However, she was still a big chunk shorter in comparison to Baili Yu. With him standing in front of her like this, his large stature cast a shadow that completely covered Tang Doudou.</p><br/><p>Those gorgeous peach blossom eyes were filled with a deep radiance. This woman, when she heard she was about to be betrothed to Xi Qiuyue, actually didn’t immediately refused but stood here dazing out and thinking.</p><br/><p>It couldn’t be that she really was considering accepting this?</p><br/><p>Baili Yu recalled that the first time he saw her at Rutaceae Pavilion, she was right next to Xi Qiuyue. Looks like the relationship between the two was worth spending some time to deliberate.</p><br/><p>When he thought up to here, Baili Yu’s smile became even more glittery.</p><br/><p>“Wife, shouldn’t you give a greeting upon seeing this husband?”</p><br/><p>My god! What’s this seductive yao coming here to join in the liveliness for!? It couldn’t be that her female disguise had that much charm?</p><br/><p>Wait. This wasn’t the main problem, alright?</p><br/><p>The main problem was that the Emperor had called him Resplendent Imperial Uncle?</p><br/><p>Oh my fucking god!</p><br/><p>Tang Doudou glanced around again. As the Emperor and the Prime Minister were here, the identities of the other people around definitely weren’t low. The crucial point was that everyone in this courtyard were people of the Imperial Court. If her identity as the Alliance Head of the martial arts circles was revealed, then wouldn’t the Emperor catch her and immediately ‘kacha-kacha’ her?</p><br/><p>Why didn’t Meng Yu give her any warning earlier?</p><br/><p>What should she do now?</p><br/><p>Tang Doudou was a little worried. It would have been better if they were strangers, yet not only did Bai Lianhua know her, Xi Qiuyue did as well. Lastly, she even smacked Xi Qiuyue with a stick. Hell, the way he questioned her earlier definitely meant he noticed something.</p><br/><p>Now the main matter was what stance Baili Yu was holding.</p><br/><p>He was the Imperial Uncle of the Emperor of Wind Spirit Imperial Court. Why hasn’t anyone ever heard of this?</p><br/><p>As Tang Doudou wondered, she sneakily glanced at Baili Yu, trying to spy something in his eyes.</p><br/><p>In the end, she was very disappointed. The damned seductive yao’s eyes only contained a smiling expression, nothing else could be made out.</p><br/><p>Damn it! It’s all cause this smile is too captivating!</p><br/><p>Tang Doudou silently cursed, then also revealed a big smile as she looked towards Baili Yu. “My dear Master, did you forget to take medicine before you headed out the doors today?”</p><br/><p>“Wife didn’t even bring it to this husband, so where was this husband supposed to go to get it?” Baili Yu lifted up Tang Doudou’s chin with a practiced motion and frivolously tapped her nose. “Wife is sure naughty. You came here to play but didn’t even invite this husband to go with you.”</p><br/><p>Following that, Baili Yu blinked his eyes at her. Those palm-leaf fan lashes sent so many sparks Tang Doudou’s entire heart turned limp and numb.</p><br/><p>Then, she instantly understood that Baili Yu was doing this to help her!</p><br/><p>She immediately started climbing up Baili Yu’s pole. “Ahem, never thought you would be able to recognize me even after I dressed up like this. Impressive, impressive.”</p><br/><p>“Wife’s every word and smile is engraved deep into this husband’s heart. How could this husband not recognize you?” She didn’t count as dumb after all. She still knew to climb following the pole. Baili Yu slightly curved his eyes as he took Tang Doudou’s hand. Then, he turned towards Xi Qiulin and said rather apologetically, “Please excuse us, Your Majesty, my wife has let you see a joke.”</p><br/><p>The two’s back and forth exchange had confused everyone present. The only ones aware of the inside story were Xi Qiuyue, Bai Lianhua, and Meng Yu.</p><br/><p>Xi Qiuyue wiped his sweat and remarked in his heart: good thing Baili Yu has stepped out. Otherwise, the aftermath would have been terrible.</p><br/><p>Bai Lianhua didn’t even know how many handkerchiefs she had ruined with her rubbing as she fiercely glared at Tang Doudou, wishing she could just glare a hole into Tang Doudou.</p><br/><p>As for Meng Yu, she looked at the sky, then at the ground, then gazed towards the east and stared towards the west. The only things she refused to look at were her Master and the Alliance Head da ren.</p><br/><p>Xi Qiulin’s expression became more and more ugly as Baili Yu ignored him. Nice trick, Baili Yu. Of course his people would go along with what he said. He never expected that Baili Yu was this stingy and refused to let go of even a lowly kitchen maid.</p><br/><p>What was most hateful was the fact that he, as the grand majestic Emperor, has always been known to speak with the golden mouth and all words were unquestionable as jade. Yet now, he actually had to inquire about Baili Yu’s opinion!</p><br/><p>“Imperial Uncle, everyone knows that you have yet to take a wife so where did this wife come from? Imperial Uncle must think things through clearly. The punishment for the crime of deceiving a monarch is not light!” Things having gotten to this point, Xi Qiulin couldn’t endure letting Baili Yu have his way anymore.</p><br/><p>Baili Yu smiled. “Your Majesty’s words are too heavy.”</p><br/><p>He completely did not mind the crime of deceiving a monarch.</p><br/><p>Xi Qiulin slapped the table with a ‘thump’ and said coldly, “Resplendent Imperial Uncle, zhen is not joking!”</p><br/><p>“I also did not joke.” Baili Yu was still speaking with a mild tone, yet it was also filled with a hint of powerful aggressiveness. Though he was facing the most powerful and important person in the country, his aura didn’t weaken at all.</p><br/><p>Of course, Tang Doudou was very worried upon seeing all of this and had tugged Baili Yu’s sleeve countless times.</p><br/><p>Meow a mii ah! Stupidly awesome seductive yao, even if you’re that person’s uncle, that person is still the Emperor that stands above ten thousand people. Aren’t you worried about being accused of scheming a rebellion if you speak so disrespectfully!?</p><br/><p>He’s showing respect for you by calling you Imperial Uncle, but this isn’t for the sake of giving you face but to show his benevolence and righteousness!</p><br/><p>He’s pretty smart most of the time, but why is he being so muddleheaded now?</p><br/><p>Tang Doudou nervously glanced at Baili Yu’s chin and didn’t see any signs of him being concerned about this matter. As for Xi Qiuyue, he had started to drink tea in contentment.</p><br/><p>In any case, Baili Yu has stepped up, so it’s none of his business now.</p><br/><p>In any case, as long as Baili Yu steps up, he can anger the Emperor half to death.</p><br/><p>Of course, the latter was something he couldn’t do anything about either.</p><br/><p>If Xi Qiulin found out that his own uncle was thinking this way, there would have been no need for Baili Yu. Just finding this out would be enough to triple his blood pressure, cause his eyes to roll back and his heart to stop from anger.</p><br/><p>Of course, Xi Qiulin didn’t know what Xi Qiuyue was thinking. However, just seeing the way he acted as if this entire thing had nothing to do with him was enough to anger Xi Qiulin to the point his lips trembled.</p><br/><p>These Imperial Uncles are sure wonderful!</p><br/><p>He laughed grimly in his heart. Did they really think he didn’t dare to touch them?</p><br/><p>“Come! The Resplendent Prince, Baili Yu, has committed the crime of deceiving the monarch. Arrest him and imprison him until the High Judiciary Office deals with him!”</p><br/><p>“Pfff!” Xi Qiuyue who was in the middle of drinking tea spurted the tea out on the Prime Minister. He didn’t have the time to care about the Prime Minister whose expression was black as coal. He hastily stood up and knelt in front of Xi Qiulin. “Your Majesty, please reconsider. The Resplendent Prince, the Resplendent Prince, he…”</p><br/><p>Can’t be arrested. These three words rolled around in his mouth but was swallowed back to his stomach when Xi Qiulin directed a carnivorous glare at him.</p><br/><p>While Xi Qiuyue was trying to speak, the guards had already rushed over.</p><br/><p>After they rushed in here, their expressions were completely at a loss. Arrest the Resplendent Prince? Who’s the Resplendent Prince?</p><br/><p>Only a few of the people present knew of Baili Yu’s identity. There was no way these guards could have known.</p><br/><p>“What are you all dazing out for! Tie him up!” Xi Qiulin’s anger exploded when he saw the entire bunch of guards staring blankly without moving. He kicked the nearest guard’s butt and with an angry sweep of his sleeve, pointed towards Baili Yu.</p><br/><p>Oh, so he’s the Resplendent Prince ah!</p><br/><p>He looks way too different from His Majesty!</p><br/><p>The guards glanced at Baili Yu who was standing there like a deity and compared him with the utterly flustered with anger Emperor. They couldn’t help but give an emotional sigh.</p><br/><p>Though they couldn’t help but sigh, they were still effectively trained guards. They moved uniformly to surround Baili Yu. The leading guard held a hemp rope in his hands. This was originally something that he had done countless times, yet when he met those extraordinary eyes, his hands continuously shook. D-did he really have to tie him up?</p><br/><p>As he thought this, he turned back to glance at his family’s Emperor.</p><br/><p>When Xi Qiulin saw this, he immediately started scolding in fury. “Disgraceful bunch of servants. If I tell you to tie him up, tie him up! If you keep dawdling, zhen will chop off your heads!”</p><br/><p>The four words, ‘chop off your heads’, shocked that guard so much he jolted. He approached Baili Yu a little bit more. As he gazed at Baili Yu’s magnificent face, he gulped and said, “Resplendent Prince, Your Majesty, Resplendent Prince, this servant… this servant will be tying you…”</p><br/><p>Upon seeing his hopeless performance, Xi Qiulin was angered to the point he almost fainted.</p><br/><p>Baili Yu gave a low chuckle but didn’t speak. Instead, he looked at Tang Doudou.</p><br/><p>There was no other reason than the fact that Tang Doudou had gotten angry when Xi Qiulin started talking about punishing him. As Baili Yu gazed at Tang Doudou’s infuriated expression, he felt rather delighted. It was like he had eaten honey, his heart filled with sweetness.</p><br/><p>This little yatou finally cared about him.</p><br/><p>This was the important point ah! The question of whether he’ll get punished or not didn’t matter at all.</p><br/><p>Tang Doudou was indeed very angry. She had seen quite a lot of muddleheaded emperors on tv dramas, but she has never seen an emperor this muddleheaded!</p><br/><p>What the heck is all this!?</p><br/><p>Does he really think that he can be undisciplined and out of control just because he’s an Emperor?</p><br/><p>Taking the fruits of people’s labors lightly and casually deciding on the victor. Then he casually decides on a mandarin duck pair and doesn’t even let the person’s husband harbor any objections! Pei! Not a husband!</p><br/><p>Afterwards, he even accused his Imperial Uncle of the crime of lying to one’s monarch although his Imperial Uncle spoke the truth!</p><br/><p>The more Tang Doudou thought about it, the angrier she got. When she saw the rope in that guard’s hand, she exploded. She rushed up and sent a huge slap over as she scolded, “As if you’ll tie a damned thing, you old bastard!”</p><br/><p>Taking advantage of the time before that guard returned to his senses, she snatched the rope from his hand and instantly appeared in front of Xi Qiulin. In two seconds, she had the rope tied around Xi Qiulin.</p><br/><p>“Muddleheaded scrambled egg! Let this Big Sis give you a lesson on how an Emperor is supposed to act!”</p><br/><p>The moment those words fell, an enormous ‘thud’ rang out.</p><br/><p>She actually kicked Xi Qiulin to the ground!</p><br/><p>This development seriously occurred too quickly. Nobody knew how she was able to move so rapidly and by the time they reacted, that noble, grand Emperor had already been trampled to the ground by Tang Doudou. Xi Qiulin roared in rage, “Baili Yu, are you planning to revolt!?”</p><br/><p>“Revolt against the crime an old bastard like you decided!”</p><br/><p>“You-you-you brute of a woman!” Xi Qiulin really wanted to just faint like this. Humiliating. It was seriously too humiliating. When had he, since childhood until now, ever received a humiliation like this!?</p><br/><p>“A woman that’s going to thrash an old bastard like you!” Tang Doudou blew on her fist, then sent another punch over.</p><br/><p>“Tang Doudou, stop!”</p><br/><p>This had seriously been too shocking. Xi Qiuyue had only managed to react after Xi Qiulin got two panda eyes. He immediately shouted and rushed over to the rescue.</p><br/><p>But a flash filled his vision and Baili Yu’s seemingly smiling but not quite smiling face appeared in front of him. “Where is Sangfroid Prince planning to go?”</p><br/><p>__________</p><br/>\n</div>"}