{"title": "Chapter 95.1: Leave Things To Slowly Play With Them", "id": 95, "volume": 1, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-951-leave-things-to-slowly-play-with-them", "volume_title": "Volume 1", "body": "<h1>Chapter 95.1: Leave Things To Slowly Play With Them</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“What are you doing?” In a flash, Su Yi appeared in front of Baili Yu and stopped him from approaching Tang Doudou.</p><br/><p>Baili Yu reached out and pushed Su Yi aside and a trace of disdain appeared in his fox-like eyes. “Su gongzi treats even a chess piece that could be thrown away at any time so carefully. No wonder Su gongzi was able to keep your position as the Lord of Cloud City stable for over a hundred years!”</p><br/><p>If Tang Doudou hadn’t fainted already, she would have fainted upon hearing this. This young man that seemed only about twenty was actually the City Lord of their discussions!</p><br/><p>And Baili Yu said ‘over a hundred years’. That was too illogical with Su Yi’s looks!</p><br/><p>Su Yi lifted his brows and leaned on the side of the carriage. His attitude changed now that his identity had been revealed. “Resplendent Prince ah, Resplendent Prince. Aren’t you a little too concerned about this chess piece of mine?”</p><br/><p>“What I’m concerned about is my wife, not your chess piece.”</p><br/><p>“Haa, looks like you know she’s a woman?”</p><br/><p>“Does City Lord Su mean that I’m blind?” Baili Yu bent down to pick up the unconscious Tang Doudou and his eyes swept across her chest.</p><br/><p>Su Yi’s face immediately darkened. He gritted his teeth and said angrily, “Baili Yu! If you dare touch her I’ll have your Heng Xuan Chamber of Commerce close down for good!”</p><br/><p>“Oh, oh? Is City Lord Su threatening ben wang?” Baili Yu looked towards Su Yi with provocation in his eyes as the corners of his lips hooked even higher.</p><br/><p>Su Yi found a place to sit down and ignored Baili Yu’s provocation. Pushing aside the hair that had fallen loose over his forehead due to the fight earlier, he said, “I wouldn’t dare to threaten you, Resplendent Prince. It’s just a little reminder. I hope Resplendent Prince will think twice before acting.”</p><br/><p>“Then I thank City Lord Su’s well-meaning intentions. However ah, my family’s wife has fainted and City Lord Su’s plan has also failed. Does City Lord Su still intend to shameless insist on staying? Or is it that City Lord Su wishes to fight me once more?”</p><br/><p>“Fight? Can you beat me with the condition your body is currently in? That’s right, and I heard you were planning to take a wife. Can you even do it?T/N” Su Yi looked Baili Yu up and down. “Are you planning to go to Azure Water Valley now?”</p><br/><p>Baili Yu’s eyes darkened when his source of pain was brought up. Then, he started shooing the person away. “City Lord Su has many affairs to attend to so this one won’t keep you any longer. Please go ahead!”</p><br/><p>Su Yi kept his old insincere smile on his face. “Cang Baicao isn’t in Azure Water Valley. Even if you go, it’s no use.”</p><br/><p>“There’s no need for City Lord Su to take the trouble to worry over that.”</p><br/><p>“Haha, is that so?” Su Yi stood up and started walking towards the carriage exit. He only turned around with curved smiling eyes when he reached the door. “Then I’m leaving. Hopefully Resplendent Prince won’t regret chasing me off.”</p><br/><p>Baili Yu didn’t respond to him. However, he sent his inner strength downwards and directly shook Su Yi, who was standing at the entrance, off the carriage.</p><br/><p>Following that, there was the sound of a heavy object hitting the ground accompanied by Su Yi’s miserable shriek, “F*ck! Baili Yu, you bastard! My waist ah!”</p><br/><p>Baili Yu didn’t want to bother with him. He looked down and saw that the carriage had been made into a mess by the fight earlier. He wanted to step forward but couldn’t find any place to place his foot. Thus, he shouted towards the entrance, “Old Ding, find Ye Chuan. Switch carriages!”</p><br/><p>“Yes, Master,” replied Steward Ding, then he headed off to go find Ye Chuan.</p><br/><p>“Hey, Old Steward, come help out a little?” Su Yi grimaced as he called out.</p><br/><p>Steward Ding didn’t bother to pay attention to him. “This old man still has some matters to take care of. Su gongzi, please do as you please!”</p><br/><p>After he finished speaking, he turned away and left.</p><br/><p>Su Yi was left there on the ground to shout helplessly, unable to get up.</p><br/><p>By the time Tang Doudou woke up, the carriage head already been switched.</p><br/><p>“Where’s that Su Yi?” Tang Doudou really wanted to curse as she rubbed her aching temple. She didn’t even know how many times she had passed out by now.</p><br/><p>Baili Yu didn’t seem that well. He closed his eyes and didn’t respond.</p><br/><p>“Hey, I’m asking you something. Su…” She was startled when Baili Yu suddenly opened his eyes while she was in the middle of speaking and shot a look over. She covered her little heart as she muttered in a quiet voice, “Why did he freaking wreck me like that and then just run off…”</p><br/><p>Baili Yu only retrieved his gaze after hearing what she muttered. He asked curiously, “You don’t want to know who he is?”</p><br/><p>“Who cares who he is? In any case, the next time I see him I’m gonna thrash him all over! Not a single part will be spared! Until he can’t even take care of himself!” Tang Doudou sat up and looked around the carriage. This carriage seemed much more spacious than the previous once and there were a lot more things inside too. Her gaze slowly wandered around the carriage…</p><br/><p>That’s not right ah, something’s off. What thingamajig is that?</p><br/><p>Tang Doudou widened her eyes as she started taking small steps towards the unknown object in the carriage.</p><br/><p>Just as she was only a few steps away from that thing, it suddenly turned around. Two dark black eyes stared lifelessly at her.</p><br/><p>__________</p><br/>\n</div>"}