{"title": "Chapter 101.2: Mu Ye Smiled", "id": 101, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1012-mu-ye-smiled", "volume_title": "Volume 2", "body": "<h1>Chapter 101.2: Mu Ye Smiled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Unexpectedly, they walked and walked for a super long time, yet they still didn’t walk out of the flower sea. On the contrary, a bamboo forest identical to the one earlier appeared in front of them.</p><br/><p>Jesus ah! Who can explain to her what exactly was going on!?</p><br/><p>Tang Doudou was about to fall apart as she looked at the bamboo forest in front of her. She finally understood why Mu Ye didn’t respond to her earlier question. It was completely because he thought she wouldn’t believe him!</p><br/><p>Not only was there an array in the bamboo forest, the sea of flowers outside was also in the array. No wonder Mu Ye, even with his level of ability, would be trapped in here so many days.</p><br/><p>From the looks of it, if they don’t find a way out she would also continue to be trapped.</p><br/><p>“The first time I came, there was no array,” Mu Ye said as he looked at her dumbfounded expression.</p><br/><p>“Which means that this array was set up recently?” Tang Doudou tilted her head as she thought about it. “I also never heard Baili Yu say that Azure Water Valley had any arrays. Before he left, he didn’t warn me either. He just told me not to randomly run around…”</p><br/><p>“He probably thinks that you’re more familiar with Azure Water Valley than anyone else.” Mu Ye felt a little unexplainably uncomfortable when she brought up Baili Yu so he interrupted and broke off her incessant chatter.</p><br/><p>“How’s that possible, I’ve never even…” Tang Doudou blurted out a refute. However, before she got through her sentence, she realized that Cang Baicao of Azure Water Valley was a subordinate of Cloud City. Li Xueyi also belonged to Cloud City. The two’s territories were different but they both work for the Lord of Cloud City so Li Xueyi should be very familiar with Cang Baicao. Hence, this Azure Water Valley was probably a place Li Xueyi had often visited.</p><br/><p>After all, Li Xueyi had offended so many people on the Jianghu. This Azure Water Valley was an exceptionally good place to hide from murderous pursuers.</p><br/><p>“But I really forgot how to get around.” The words were at her lips, but Tang Doudou forcefully changed them while fending off Mu Ye’s intimidating gaze.</p><br/><p>He had already felt she was strange since before.</p><br/><p>It didn’t matter if it was qinggong or martial arts. Even if one didn’t use them for a long time, they were things that were engraved deep into one’s bones. It was impossible to simply just forget about them.</p><br/><p>Not to mention, her nature and temper were extremely different from that of the rumors. With the exception of this identical face, he couldn’t find a single similarity between this person in front of him and the Li Xueyi of the rumors.</p><br/><p>However, she really is that person. He had seen everything clearly in Rutaceae Pavilion.</p><br/><p>Even if she had changed into a female disguise, she was definitely the Li Xueyi he had seen back then.</p><br/><p>However, how can everything she forgot be explained?</p><br/><p>Mu Ye’s probing gaze caused Tang Doudou to become on guard. Could it be this bro’s suspecting her identity?</p><br/><p>No way, she can’t allow him to be suspicious!</p><br/><p>Ever since Li Xueyi had completely disappeared, Tang Doudou started disliking this type of probing gaze with a particular passion. It was uncomfortable and felt if they wanted to peel off her skin.</p><br/><p>“It’s been too long since I’ve come, haha, let me think a little!” Tang Doudou laughed, then diverged Mu Ye’s attention. “Let’s go this way, it looks pretty familiar!”</p><br/><p>Mu Ye didn’t question her at all and started walking in that direction.</p><br/><p>However, she had just randomly pointed in a direction. Who knows if that direction would get them out? Why does Mu Ye trust her so much to the point that he walked in that direction without even thinking about it?</p><br/><p>What a solitary and independent man.</p><br/><p>“Hey, wait for me!” Tang Doudou energetically chased after him. After she left, the figure of the one-eyed woman appeared where they had been standing. As she looked at the two’s back figures, she crackled with sinister laughter. Following that, she dispersed like smoke as if she had never appeared at all.</p><br/><p>They had walked for almost an hour in the direction Tang Doudou had randomly pointed in. Tang Doudou’s feet were extremely sore. She was just about to suggest a break when she heard Mu Ye say, “There’s a brook.”</p><br/><p>These three words instantly invigorated Tang Doudou. She pulled Mu Ye and looked all around. “Brook? Where’s the brook?”</p><br/><p>“Southwest.”</p><br/><p>How come the hearing ability of Mu Ye and the others are so much better than hers?</p><br/><p>As expected, it was the brook she had encountered.</p><br/><p>“It was at this brook that I encountered the old beggar and the one-eyed old woman before.” After they walked along the brook a little while, they reached the area where Tang Doudou had grilled fish. Tang Doudou looked at the place she had walked here from and said to Mu Ye, “We should be able to get out if we walk that way.”</p><br/><p>“I’ve walked that way before.”</p><br/><p>“Then just walk it one more time!”</p><br/><p>She moved up and patted Mu Ye’s shoulder. “Let’s go.”</p><br/><p>After she said so, she dashed in that direction without waiting for Mu Ye’s response.</p><br/><p>Meow ah. First things first, let’s just get out of this damned place.</p><br/><p>Mu Ye must be in a good mood these last couple days. Not only did he teach her qinggong, he even praised her. However, this didn’t mean that the two of them could continue to coexist peacefully this way. After all, she was the Alliance Head and he was the leader of the Demonic Sect. It was foreordained that they couldn’t become friends that sat together peacefully while drinking tea and chatting.</p><br/><p>The person she should find was Baili Yu. She should stay as far away from Mu Ye as possible.</p><br/><p>Tang Doudou went extremely fast. Mu Ye’s qinggong wasn’t as good as hers to he soon lost sight of her.</p><br/><p>He searched repeatedly through the sea of flowers. After finally confirming that she had left alone, he returned to the small brook once again. His deep eyes were even colder than before. She left without even saying a goodbye.</p><br/><p>She’s sure heartless enough.</p><br/><p>Then, he laughed at himself coldly. Since that time at the Alliance Head Residence, he no longer felt like killing her. He never thought…</p><br/><p>Tang Doudou didn’t know if the array had stopped working or if she was really starting to run into expected dogshit luck but she actually returned to the original road after walking a while. As Tang Doudou gazed at the carriage that was parked not far away, she felt the urge to rush up and kiss it a couple times.</p><br/><p>Tang Doudou got into the carriage and tidied up her clothing. After eating a little, she started staring at the path outside, bored. Why was Baili Yu still not coming out?</p><br/><p>Could it be that he wasn’t worried about her at all?</p><br/><p>He’s really not worried that she’ll get lost?</p><br/><p>Haa…</p><br/><p>Before she had realized it, she was starting to think of Baili Yu every time she encountered something.</p><br/><p>“Li Xueyi.”</p><br/><p>Just as she was wondering what Baili Yu was doing right now, Su Yi’s voice came from outside the carriage.</p><br/><p>__________</p><br/>\n</div>"}