{"title": "Chapter 123.2: Just Be Yourself", "id": 123, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1232-just-be-yourself", "volume_title": "Volume 2", "body": "<h1>Chapter 123.2: Just Be Yourself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After taking a nice and comfortable bath, Tang Doudou wrapped herself in a bathrobe and walked out from behind the screen. She was immediately stunned by the piles of clothing that seemed to contain every color under the sun!</p><br/><p>Jesus ah! There are probably over a thousand garments at the very least!</p><br/><p>Are there that many styles of historical clothing?</p><br/><p>“Lady Doudou.” Just as she was about to fall apart, the sound of Qing He knocking came from outside the door.</p><br/><p>“I’m here!” replied Tang Doudou hastily. She casually picked up a garment and started putting it on.</p><br/><p>Hearing her flustered voice, Qing He said with a slightly apologetic tone, “Lady Doudou, were you shocked? I’m sorry. I was just worried that you wouldn’t like the colors I picked so I brought all the colors for each style…”</p><br/><p>No wonder there were so many clothes. As it turned out, she had moved the contents of an entire ready-made clothing store over!</p><br/><p>Tang Doudou covered her forehead. However, since the person had done it out of good intentions, she couldn’t really blame her. Thus, she said, “I’m fine. I like all of these colors and the clothes a lot. Thank you very much, Qing He.”</p><br/><p>Qing He acknowledged politely, then left.</p><br/><p>Only then did Tang Doudou exhale and start to get dressed in preparation to go find Baili Yu. However, now that she was actually looking at the clothing, she realized that the size was huge. It didn’t cover the places it should and for the places it shouldn’t cover, it also didn’t cover. In short, it was no different from those racy undergarments.</p><br/><p>She hastily pulled it off and dug out something that was more normal to put on. Then she grabbed the medicine and went to find Qing He.</p><br/><p>When she found Qing He, Qing He told her that Baili Yu was meeting with someone. Who knows what they were talking about in the middle of the night?</p><br/><p>Hence Tang Doudou could only take the things and go daze out on a rooftop of the courtyard. At this moment, Ye Chuan finally arrived. He spotted Tang Doudou with a single glance and waved towards her.</p><br/><p>Ye Chuan had returned, and he also looked in pretty good shape. Thus, Tang Doudou happily jumped off the roof and started running towards him.</p><br/><p>“You’re finally back!” said Tang Doudou happily after she got close.</p><br/><p>After this incident, Ye Chuan’s attitude towards her became much better. However, when he saw that she was wearing female clothing again, he couldn’t help but chide her with his brows furrowed, “Why did Master allow you to wear female clothing again? As a man you should uphold the proper image of a man. Even if you’re going to marry Master, you’re still a man! How can you keep wearing female clothing all the time!?”</p><br/><p>Tang Doudou rolled her eyes but didn’t feel like explaining to him. She pulled him to the side and said unhappily, “Let’s not talk about this. There’s still a matter that I haven’t settled with you yet. If you don’t give me an explanation this time, I’ll have Baili Yu expel you, got it!?”</p><br/><p>Ye Chuan wasn’t afraid of her threat at all. He pushed her away and said, “We can talk about things later, I have to find Master first.”</p><br/><p>Seeing that he was about to leave, Tang Doudou hastily grabbed him. “Baili Yu’s talking with someone right now. Even if you go you wouldn’t be able to see him! You had better just wait with me here.”</p><br/><p>“It’s already so late, how could Master still be talking with someone?” Doubt flashed through Ye Chuan’s eyes when he heard what Tang Doudou said. This was completely different from Master’s usual style ah. He never had meetings at night and no meetings had ever lasted past an hour.</p><br/><p>Thus, he asked, “How long has Master been talking with the person?”</p><br/><p>Tang Doudou stretched out her fingers and thought for a moment. “It’s probably been almost an hour…”</p><br/><p>Her words had just landed when Ye Chuan’s figure disappeared from her sights.</p><br/><p>Huh? Where’d the person go?</p><br/><p>__________</p><br/>\n</div>"}