{"title": "Chapter 127.2: Spring Has Arrived", "id": 127, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1272-spring-has-arrived", "volume_title": "Volume 2", "body": "<h1>Chapter 127.2: Spring Has Arrived</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Baili Yu suddenly brought up the matter of the wedding, Tang Doudou who had long forgotten this matter was so shocked that she choked on her own saliva.</p><br/><p>“Cough cough! You, cough, what are you saying!?”</p><br/><p>In regards to getting married, Tang Doudou had already thought it through. Back then, when Baili Yu said he wanted to take responsibility. she had only agreed to marry him because she had resolved to not let Baili Yu get any advantages even after she married over. In addition, she had planned to escape immediately after Baili Yu helped cure her poison. However, as of now, she had already fallen in love with this man. Thus, there’s no way she could casually leave anymore.</p><br/><p>In actuality, there was no need to feel anxious about getting married. After all, this wedding was set because he wanted to take responsibility!</p><br/><p>“Wife forgot?” Her strong reaction caused Baili Yu’s eyes to darken a little. Could it be that this girl wanted to back out again?</p><br/><p>“Oh, of course I remember. It’s just… I feel like we don’t have to rush this matter so much…” Tang Doudou scratched her ear, then pushed Baili Yu away. She organized her thoughts a bit, then said, “While you were unconscious, Ye Chuan had brought a doctor here to help treat your wound. That doctor was Cang Baicao and he told me about something.”</p><br/><p>“Oh?” Baili Yu had felt that he recovered much faster than usual. It turned out that it was Cang Baicao who treated him. But, why was she bringing this up now?</p><br/><p>For some unknown reason, Baili Yu suddenly had a bad premonition. It couldn’t be that Cang Baicao told her about his poison, right?</p><br/><p>“At that time, you were pretty much like a dead person. You had no body heat and were not breathing. It caused Ye Chuan and I to think that you were about to die.”</p><br/><p>“That’s drivel, how could I die?”</p><br/><p>“I already said that we thought you were going to!” Tang Doudou glowered at Baili Yu, indicating for him to shut up. Then she continued, “However, Cang Baicao told me that you weren’t dead and that it was a poison causing those symptoms.”</p><br/><p>As expected, he had told her about this.</p><br/><p>Baili Yu reached out and snapped off a branch of flowers, then gave it to Tang Doudou. He seemed extremely unconcerned about being poisoned. “What does this have to do with getting married? Wife couldn’t be avoiding me out of dislike, right? It would truly be a truth that wounds this husband’s heart.”</p><br/><p>It wasn’t strongly related but Tang Doudou wanted to help cure Baili Yu’s poison before discussing other matters.</p><br/><p>Cang Baicao had said that the Hoarfrost Poison in Baili Yu’s body was as rare as the Disseminating Tassel Fragrance. The Hoarfrost Poison was nicknamed the strongest poison in the world. Lately, the poison was flaring up more frequently. If it wasn’t cured soon, there’d definitely be a big problem. At that time, not even the Golden Immortal of Great Overarching Heaven would be able to save him. (one of the Heavens in Taoist scripture)</p><br/><p>Had his self-confidence gone to his head, for him to not even feel the slightest bit worried? Tang Doudou was puzzled by his reaction. For her, the Disseminating Tassel Fragrance had often caused her to lose her appetite and have trouble sleeping due to worry that the poison would flare up one day and cause her to croak.</p><br/><p>As one in a pair of mandarin ducks (refers to an affectionate couple) that could kick the bucket at any moment, how could she have the presence of mind to discuss marriage?</p><br/><p>“I dislike, of course I dislike! There’s no way I want to be a widow the day I marry over!” Tang Doudou sniffed the flowers in her hand. A fresh scent entered her nose and cleared her head. She was so worried about Baili Yu’s Hoarfrost Poison but she had never heard Baili Yu ask about her Disseminating Tassel Fragrance, nor did he even indicate that he was going to help cure her poison.</p><br/><p>What exactly did he think about this?</p><br/><p>She didn’t know that the reason Baili Yu had suddenly headed out was for the sake of treating her Disseminating Tassel Fragrance. Just because he had never talked about it didn’t mean that he wasn’t concerned about it. It was just that the links between everything were extremely complicated, it was not something that Tang Doudou could imagine. The reason he didn’t bring it up in front of Tang Doudou was because he wanted for her to continue living like this. He wanted her life to be a little more pure, a little more simple. He wanted her to laugh a little more, cry a little less.</p><br/><p>That would be enough.</p><br/><p>However, no matter what this wedding must be carried out!</p><br/><p>Baili Yu reached out and pinched Tang Doudou’s nose, then said with a smile, “Silly girl, as long as I’m here there’s no way you can be a widow.”</p><br/><p>“Humph.”</p><br/><p>“Hey, isn’t this Alliance Head Li?” While the two were in the middle of talking, a familiar voice came from the top of the tree in front of them.</p><br/><p>Baili Yu’s expression did not change but Tang Doudou looked towards that direction with a surprised expression. Skinny jumped down from the tree and walked over with a smile. “Hehe, after a few days of not seeing each other, it can be seen that Alliance Head Li has become even more gallant of a figure!”</p><br/><p>Tang Doudou rolled her eyes, not daring to blindly agree with Skinny’s words. She was in female garments and was a complete mess from being tugged around by those woman. In addition, her neck was still full of lipstick marks. What part of her was he looking at to pull out the word gallant?</p><br/><p>Couldn’t he be more professional in his bootlicking!? Tang Doudou silently criticized Skinny with disdain. At the same time, she wondered where exactly this guy got his courage from. He helped Old Suo kidnap her, but still dared to appear right in front of her and greet her cheerfully.</p><br/><p>Did he wake up the right way this morning?</p><br/><p>Why did she feel like Skinny was here looking for a beating?</p><br/><p>“Alliance Head Li?”</p><br/><p>When she didn’t say anything after quite a while, Skinny asked, “Could it be that you don’t remember me? I’m Skinny ah. The Skinny that was with Old Suo! The Skinny who, risking life-threatening danger, sent you a letter telling you to go to Five Kilometers Emporium ah!”</p><br/><p>Tang Doudou didn’t expect that her brief moment of hesitation would lead to such shocking revelations. She reached Skinny with one stride and, lifting him by his front collar, asked him angrily, “You’re saying that the person who told me to go to Five Kilometers Emporium was you?”</p><br/><p>Skinny didn’t expect for her to have such a huge reaction and was confused as to what was going on. Shouldn’t Li Xueyi be grateful that he sent over news about the antique lamp?</p><br/><p>He was originally planning to use the news about the antique lamp to curry favor with Tang Doudou. However, he never got any news back after he sent that letter strip out. After Five Kilometers Emporium was burned to the ground and he saw Tang Doudou in Heng Xuan Chamber of Commerce, he came to the conclusion that Tang Doudou had definitely obtained the lamp and then set fire to Five Kilometers Emporium.</p><br/><p>__________</p><br/>\n</div>"}