{"title": "Chapter 136.2: Who Would Carry This Black Pot", "id": 136, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1362-who-would-carry-this-black-pot", "volume_title": "Volume 2", "body": "<h1>Chapter 136.2: Who Would Carry This Black Pot</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Noticing that things were bad, Tang Doudou turned around abruptly. Her field of vision whirled and by the time things settled again, she was already far away from that romance-filled boat and gliding through the air in a certain person’s arms.</p><br/><p>“Baili Yu! What are you doing!?” Tang Doudou immediately exploded when she smelled that familiar scent.</p><br/><p>When Su Yi who had been in his own world with Feng Wu heard Tang Doudou’s shriek, he immediately released Feng Wu and moved to chase after them. Feng Wu pulled him to a stop, saying, “This matter is between those youngsters, as the older generation you shouldn’t blindly meddle.”</p><br/><p>If it was before, Su Yi definitely would have already gotten angry.</p><br/><p>At this moment however, he simply gave Feng Wu a calm glance. “What did you find out?”</p><br/><p>Feng Wu waved her hand. “In any case, I learned a very important matter. If you want to know, then trade for it!”</p><br/><p>“What do you currently want that you don’t have? And you’re still setting your sights on me. It couldn’t be that you’re still longing for those darling treasures of mine? I’m telling you, there’s no way I’ll give them to you!”</p><br/><p>“That’s right ah!” Feng Wu stuck out her tongue and smiled mischievously. “Isn’t it precisely that I’m setting my sights on you, Su Yi?”</p><br/><p>Su Yi’s temper instantly vanished. He looked at the darkening sky outside with worry and walked out. “I still feel worried. I’m going to follow them and take a look.”</p><br/><p>His temper was still this annoying. Feng Wu knew that she wouldn’t be able to convince him and decided not to waste her breath. She laid down on the couch and played with the hair in front of her chest as she said with a hint of resentment, “Then go ah. But remember to come back soon. Otherwise, don’t regret after I get tired of waiting and end up looking for someone else.”</p><br/><p>Su Yi who had reached the entrance staggered, then turned around to shout, “You’d dare!?”</p><br/><p>Feng Wu rolled her eyes at him. “See if I dare. All the people that came today are youngsters and all of them look pretty good, not to mention they’re young and full of energy…”</p><br/><p>“Shut up, otherwise I’ll go out right now and kill all of them!”</p><br/><p>“That’s fine ah! In any case, they’re not my subordinates, it’s not a pity even if they die… But, do you dare to kill them?”</p><br/><p>“Why wouldn’t I dare!?”</p><br/><p>What a joke, was there anything in this world that he, Su Yi, didn’t dare to do?</p><br/><p>Feng Wu chuckled, then gave him a rebuking glance. “You ah! You’re still as unbridled as before, but I precisely like this fearless part of you. How about this? Let’s make a bet. If I lose, I’ll go with you, but if you lose, you’ll stay in Mist City. How about it?”</p><br/><p>“If you want to make a bet, wait till I get back!” If he didn’t start chasing after them now, he wouldn’t be able to catch up anymore.</p><br/><p>“No! We make the bet now!”</p><br/><p>“We’ll make it when I get back!”</p><br/><p>“Now!”</p><br/><p>The two of them were pretty much the peak existences within the Jianghu. During ordinary days, just a casual sentence from one of them could cause the entire martial arts community to tremble, yet they were currently acting like two peeved kids, neither willing to modestly yield.</p><br/><p>They glowered at each other for a while before Feng Wu finally smiled placidly. In the end, she was still the one that loved him a little more ah!</p><br/><p>He probably still hasn’t forgotten about that woman. As of now, even if it was now about her daughter, he was still so annoyingly anxious about her.</p><br/><p>However, she (FW) had already yielded once twenty years ago, could it be that she had to yield again?</p><br/><p>Even if that person was already dead to the point that she could not be more dead.</p><br/><p>It was also laughable. How old was she now? What point was there in bickering with a dead person after so long? Forget it, forget it.</p><br/><p>“Alright, let’s make the bet after you come back.” After Feng Wu slowly said this, she collapsed onto the soft couch as if all the energy in her body had left. However, she didn’t forget to exhort him, “Remember to come back soon, don’t make me wait another twenty years.”</p><br/><p>Pain and helplessness flashed through Su Yi’s eyes as he looked at Feng Wu apologetically. Although their martial arts could allow people to maintain their youth, they were already over a hundred years old. If one looked closely, one could see that the corners of Feng Wu’s eyes already had some wrinkles.</p><br/><p>They no longer had much time left.</p><br/><p>He walked over and gently pecked Feng Wu’s face. Su Yi smiled like sunshine. “Wait for a bit, I’ll be back right away.”</p><br/><p>He has always kept his word. Feng Wu nodded in satisfaction, before closing her eyes.</p><br/><p>Su Yi didn’t delay things any longer and headed straight in the direction Baili Yu had left in.</p><br/><p>Although he could tell that Baili Yu had changed a lot and was no longer that unscrupulous businessman who sought nothing but profit, how could he give Tang Doudou to Baili Yu, his long-time opponent, without worry? At the very least, he must see with his own eyes proof that Baili Yu was sincere and treated Tang Doudou well.</p><br/><p>As Su Yi chased after them without stopping to rest, Baili Yu carried Tang Doudou and flew speedily out of Mist City. During this entire time, Tang Doudou continuously cursed in rage. As she yelled, she even used her fist to beat Baili Yu’s chest. However, when Baili Yu threatened to drop her if she kept hitting him, she stopped the physical violence and instead switched to more intense cursing.</p><br/><p>As long as she didn’t hit him, Baili Yu simply treated her curses as wind passing by his ear and was not concerned at all.</p><br/><p>Tang Doudou finally got tired of yelling at him. Her little lips pressed together dejectedly and her eyes turned misty as she said, “Baili Yu, what exactly are you trying to do? Tell me straight out ah! The way things are is so confusing, it really makes me feel horrible!”</p><br/><p>“Silly,” said Baili Yu softly.</p><br/><p>“I really hate this feeling, you know?” Tang Doudou buried her head in Baili Yu’s broad chest. Her entire body was enveloped by that nice smelling fragrance and she felt her heart relax. It was as if as long as he hugged her like this, she would feel exceptionally safe.</p><br/><p>In the end, she has fallen in love with this man, it wasn’t just a simple love. She couldn’t help but cling to this feeling of safety that was as sweet as syrup.</p><br/><p>Hearing her grievance-filled voice, Baili Yu’s arms tightened around her as if he wanted to never let go. “I know, of course I know.”</p><br/><p>“You know yet you’re still not giving an explanation?” It was in vain. Tang Doudou’s voice suddenly became very fierce. “Did you take a fancy to some other girl? You’re bored of staying with me so now you want to dump me, is that it?”</p><br/><p>What was all this?</p><br/><p>Couldn’t her little head follow the normal line of reasoning?</p><br/><p>When has there ever been another woman except her, this crossdressing tomboy, by his side all these years? He had only trained those maids for the sake of the plan. Most of the time, they were only responsible for carrying and pouring tea and had never touched him. After he got injured, it was Ye Chuan who helped him apply medicine.</p><br/><p>Not to mention, there had been so many matters to deal with lately that they could pile into a mountain. Where would he have the time to take a fancy to some other woman?</p><br/><p>He refused to carry this huge black pot!</p><br/><p>__________</p><br/>\n</div>"}