{"title": "Chapter 144.2: Become Sworn Siblings", "id": 144, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1442-become-sworn-siblings", "volume_title": "Volume 2", "body": "<h1>Chapter 144.2: Become Sworn Siblings</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tang Doudou finally understood. It was likely that their goal in saving her had been due to money after all!</p><br/><p>However, they couldn’t be blamed, after all, this was their trade. It would have been stranger if it hadn’t been for the sake of money.</p><br/><p>“Then I’ll stay.” Tang Doudou shot Xiao Dao a look. If it had been before, she definitely wouldn’t have agreed but things were different now. Firstly, the fact that they didn’t loot them while she was unconscious meant that these two were not wicked beyond redemption. Secondly, she and Xiao Dao were a match for these two at all. If it really came to blows, they would be the ones to suffer.</p><br/><p>“Xiao Dao, you head back. Find Xiao Bai, get the money, then come back to get me!”</p><br/><p>“No, I can’t leave you here by yourself!” Xiao Dao rejected this idea without even considering it. He would have agreed if the idea was for him to stay but there was no way he would agree to leave Tang Doudou here in Green Summit Stronghold.</p><br/><p>Tang Doudou naturally knew what he was worried about. Wasn’t it precisely because the way Yu Fenger looked at her was too vulgar?</p><br/><p>In reality, from the brief exchange earlier and from what Xiao Dao told her about yesterday’s incident, she had come to understand that Yu Fenger only looked vulgar. In actuality, he was pretty decent as a person and wasn’t the type to use despicable, underhanded means.</p><br/><p>“Xiao Dao, I’ll be fine.” Tang Doudou organized her thoughts, then tried to persuade him. “Think about it, it would still take about four days to reach Huai City. Setting aside the question of whether I’ll be able to find the way, for now, we don’t even know what kind of danger lies ahead. Rather than having me face those unknown dangers, it would be much safer to just let me stay here! At the very least there’s no way they’ll do anything to me before the money gets here.”</p><br/><p>Her words swayed Xiao Dao. “But…”</p><br/><p>“No buts. What’s a man dawdling so much for?” Tang Doudou wanted to rap him again but withdrew her hand midway.T/N “Remember to explain it clearly to Xiao Bai and have him wait patiently for me a couple more days.”</p><br/><p>In reality, Xiao Dao wanted to tell her that he could release a signal to have the people from the Chamber of Commerce directly bring the money over. However, when he recalled the instructions Baili Yu gave him, he stopped himself. Inwardly, he drew up other plans.</p><br/><p>“Then you be careful, I’m going now.”</p><br/><p>“Go, go.”</p><br/><p>Xiao Dao walked a few steps away before turning back again. “Golden Wind Jade Dew, I, Xiao Dao, respect you two as heroes. However, I hope that you two will not do anything to harm your own honorable name!”</p><br/><p>After he finished speaking, he left Green Summit Stronghold.</p><br/><p>After Xiao Dao left, Yu Fenger asked with a happy laugh, “You’re called Lady Doudou, right?”</p><br/><p>“That’s right. If Stronghold Master Yu does not mind, you can just call me Doudou!”</p><br/><p>“Doudou…” Yu Fenger lifted his hand in the orchid fingers gesture and pointed towards the chair next to him. “Please sit.”</p><br/><p>Tang Doudou didn’t stand on formalities either and sat down to wait for Yu Fenger to continue talking.</p><br/><p>After Xiao Dao agreed to go and bring back the money, Jin Longbiao shut up. When he saw Yu Fenger invite Tang Doudou to sit down, he decided to just head out and find some brothers to drink with, holding onto the mindset of what one doesn’t see, one doesn’t feel vexed over.</p><br/><p>“This Jin ge of mine is just like this. It has let Doudou, you, see a joke.”</p><br/><p>Jin ge? From what I see, it should be ‘gold spear’ right? (spear(ge1) is a homophone of older brother(ge1))</p><br/><p>Tang Doudou couldn’t help but think mean thoughts when she recalled how Jin Longbiao had abruptly become violent yesterday.</p><br/><p>“Haha, Stronghold Master Jin is a very passionate person who definitely doesn’t waste time on superfluous words if he can take action. At least he is much more openhearted than those vile characters that scheme behind people’s backs!”</p><br/><p>Yu Fenger smiled so widely much upon hearing Tang Doudou praise Jin Longbiao that his smile practically reached his ears. Covering his mouth as he smiled, he said, “Doudou is so right. Jin ge ah, is precisely this type of person!”</p><br/><p>Seeing the pride on his face, Tang Doudou felt that Yu Fenger wasn’t that ugly after all. It’s just that the vulgar feeling he gave off was seriously uncomfortable.</p><br/><p>However, it seemed like her guess was accurate. Golden Wind Jade Dew were big-hearted people.</p><br/><p>She just didn’t know why they would choose to be mountain bandits, this shady and dangerous occupation. Not only did the imperial courts hate bandits, many people in the martial arts circles also detested them.</p><br/><p>In addition, the two of them had pretty good martial arts. Yesterday, when her inner strength had exploded, although her force was mainly concentrated on the morning star, the shockwave of the explosion had destroyed many of the trees and overturned much of the ground. From this, it could be seen that the shockwave had been very devastating, yet both of them were completely unharmed, and only their clothing had gotten damaged.</p><br/><p>The more Tang Doudou thought about it, the more she felt that if these two could help her…</p><br/><p>Her water-like eyes lit up. That was a good idea ah!</p><br/><p>Although she was the martial arts Alliance Head, she didn’t possess any personal power. Even though Bai Feiyun was helping her with all of his heart, most of the time he listened to Su Yi’s instructions. As for Elder Yu, there was no need to even discuss him. His elbows were completely turned outwardsG and nothing would suit him better than if she died.</p><br/><p>As for Baili Yu, he didn’t seem to interfere much with the martial arts circles.</p><br/><p>So in the end, she was a subordinate-less commanding officer. If no one helped her, there was no way she would be able to sit on the seat of Alliance Head stably.</p><br/><p>Even though she wasn’t interested in being the Alliance Head at all, this position wasn’t something she could give up just because she didn’t want it. She was deeply involved in the Jianghu, how could she possibly escape from this quagmire that easily?</p><br/><p>Retrieving her line of thought, Tang Doudou discovered that Yu Fenger was currently staring at her happily. Tang Doudou smiled. It was time for her to establish her own influence.</p><br/><p>“Stronghold Master Yu…”</p><br/><p>“If Doudou doesn’t mind, from now on just call this Yu gege?” Yu Fenger got up from his seat and walked down. In a rare manner of seriousness, he didn’t lift his hand in the orchid fingers gesture. “The moment I saw Doudou yesterday, I felt a connection as if I’ve reunited with an old friend who I hadn’t seen for a long time. I really took a liking to you from the bottom of my heart. After interacting with you today, I found that Doudou also doesn’t act coy like normal ladies and has an extremely refreshing personality. Thus I thought, why don’t we become sworn siblings?”</p><br/><p>It was truly the case of someone offering a pillow as soon as you got sleepy.</p><br/><p>If it weren’t for the fact that Yu Fenger was standing right here right now, Tang Doudou would have thought he was the roundworm in her stomach. (being the roundworm in someone’s stomach means that you know the person’s thoughts)</p><br/><p>What he said catered seriously way too well to her intentions.</p><br/><p>__________</p><br/>\n</div>"}