{"title": "Chapter 146.1: Arrived at Huai City", "id": 146, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1461-arrived-at-huai-city", "volume_title": "Volume 2", "body": "<h1>Chapter 146.1: Arrived at Huai City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Doudou, I’ve discussed with your Big Brother Jin about assigning someone to help escort you back to Huai City.”</p><br/><p>Early the next morning, Yu Fenger came looking for Tang Doudou with a guilty conscience.</p><br/><p>As for Tang Doudou, yesterday she had misgivings that they would use force and had been worried about suffering losses if she couldn’t beat them. However, she had confirmed now that there definitely wouldn’t be any danger and had decided before going to sleep that she would tell them she was leaving today. She hadn’t expected for Yu Fenger to have already arranged it all for her.</p><br/><p>“En, this was what I was planning too.” Tang Doudou packed up a little, then saw Jin Longbiao bringing over some brothers with decent martial arts skills.</p><br/><p>“These are the Wu family brothers. They often go to Huai City to handle matters so they know the road well and are also very astute. Just let them follow you from now on!” Golden Wind Jade Dew found out that Tang Doudou didn’t know martial arts yesterday while they were talking and didn’t feel at ease letting her go off on her own on a journey. That was why they carefully selected three of their own trusted subordinates for her.</p><br/><p>Tang Doudou was naturally delighted with this surprise. In all honesty, there was no way she wasn’t scared about going to Huai City on her own. She wasn’t familiar with the road and she had to be on guard against Elder Yu and the Demonic Sect’s attacks. It was possible for her to die at any moment from the slightest carelessness.</p><br/><p>“Wu Li greets Third Chief!” (Wu(martial arts) Li(strength))</p><br/><p>“Wu Qing greets Third Chief!” (Wu(martial arts) Qing(clear/quiet))</p><br/><p>“Wu Lu greets Third Chief!” (Wu(martial arts) Lu(shore/land))</p><br/><p>These three brothers were quite enthusiastic. Tang Doudou was happy to see this and nodded. “In the future don’t call me Third Chief anymore, just call me Doudou!”</p><br/><p>“Understood! Lady Doudou!”</p><br/><p>Forget it, if it’s Lady Doudou then so be it. It wouldn’t be easy to make them change their way of address after all.</p><br/><p>“Doudou, we’ll be able to rest easy knowing that they’re with you. The Jianghu is full of dangers, you must be careful!” From start to finish Yu Fenger never asked Tang Doudou what exactly she was off to do; he didn’t even ask who Tang Doudou was. “If you need our help, just let us know! We won’t hesitate even if we need to walk through water and tread on fire!”</p><br/><p>Tang Doudou was very moved hearing this. Yu Fenger really treated her exceptionally well. From now on, she had to treat them wholeheartedly too. As for her earlier idea of roping them in to help her, she decided to abandon it. There was no way she could allow them to accompany her in taking risks!</p><br/><p>“Big Brother Yu, don’t send me off any further. I’ll rush back to see you guys as soon as I finish dealing with my matters.” Tang Doudou felt rather helpless as she looked at Yu Fenger who had already been seeing her off for several hundred meters.</p><br/><p>Yu Fenger still couldn’t bear to leave her. The rims of his eyes were red and tears continuously dropped down. “Then, how about I go with you!?”</p><br/><p>If it had been before, Tang Doudou may have agreed but now she firmly rejected the idea. “Green Summit Stronghold won’t be able to go on without Big Brother Yu, not to mention Big Brother Jin needs you as well. Could it be that you can bear parting with Big Brother Jin?”</p><br/><p>Pulling out Jin Longbiao was the most effective method to combat Yu Fenger’s weeping.</p><br/><p>As expected, Yu Fenger immediately stopped talking about going with Tang Doudou when she said he would have to part with Jin Longbiao. However, he was still extremely reluctant to let her go and kept reminding her, “Then you have to come back and look for us soon. Make sure to eat on time and sleep on time. When it gets cold, remember to wear more layers…”</p><br/><p>He prattled on about a great bunch. It was still alright hearing it once but hearing it over and over again really drove people crazy. Tang Doudou finally understood the pain of being nagged at by a mother.</p><br/><p>In the past when she saw people complain, she had jeered at them for not knowing to cherish it. However, now she could relate.</p><br/><p>“Big Brother Yu, if you keep nagging the sun will set!”</p><br/><p>“Aiyah, can’t you tell that it’s because I don’t want to part with you?”</p><br/><p>“Alright, alright. Big Brother Yu, you had better head back soon. Don’t let Big Brother Jin worry too long. I’m leaving now!” Tang Doudou was worried that Yu Fenger would keep nagging her and hastily climbed onto the horse. She called the Wu family brothers, then waved goodbye to Yu Fenger.</p><br/><p>After she finished speaking, she rode off in the direction of Huai City with the three brothers following after her.</p><br/><p>Yu Fenger watched until her figure disappeared, then gave a small sigh as he turned to head back to Green Summit Stronghold. The back of his short figure was conspicuously dejected.</p><br/><p>__________</p><br/>\n</div>"}