{"title": "Chapter 142.1: Mountain Bandits Golden Wind Jade Dew", "id": 142, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1421-mountain-bandits-golden-wind-jade-dew", "volume_title": "Volume 2", "body": "<h1>Chapter 142.1: Mountain Bandits Golden Wind Jade Dew</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tang Doudou had expected Baili Yu to say that it was up to her whether she wanted to go back or not.</p><br/><p>Unexpectedly, he started pondering the question seriously. After a good while, he finally said, “Let’s see what Su Yi thinks after we return.”</p><br/><p>Tang Doudou nodded. The position of martial arts Alliance Head was something Su Yi had foisted on her. Now that a major incident had come up, it was best to see what Su Yi thought, then figure out what to do.</p><br/><p>In regards to this incident with the Demonic Sect, it’d be fortunate if they had good luck. If they didn’t have good luck, there would be fatalities.</p><br/><p>After getting off the Chrysanthemum Glass Jade Palanquin, Tang Doudou went off to look for Su Yi. In the end, she found out from the maids that carried the palanquin that the guy didn’t come back with them.</p><br/><p>Fine. Whenever she needed to find him, he was always missing, yet when she wasn’t looking for him, he would show up and hover around her all day.</p><br/><p>Tang Doudou felt pretty depressed. Carrying that gloomy air, she made a trip to the City Lord Residence and saw Feng Wu.</p><br/><p>Feng Wu was furious upon finding out that Su Yi had disappeared again. She smashed everything in the room, then put on fiery red armor. Leading several thousand soldiers, she left the City Lord Residence in a grandiose fashion.</p><br/><p>Tang Doudou who was left completely befuddled, stood by herself in the cold wind, distressed on her own.</p><br/><p>Su Yi disappeared just like this. Feng Wu had searched Mist City for four days straight, turning the entire city inside out, yet not a trace of him was found. From the looks of it, he had already left Mist City. When Tang Doudou saw that Feng Wu looked even more depressed than her, she suggested that Feng Wu head out to look for Su Yi. Unexpectedly, Feng Wu sighed and said, “If I could leave Mist City, what need would there have been for me to wait more than twenty years for him?”</p><br/><p>Tang Doudou could only drop the subject and slip out to look for Baili Yu.</p><br/><p>“You want to go back? For the time being, I cannot leave Mist City. Will you be fine on your own?” When Tang Doudou went to tell Baili Yu that she had decided to go back, Baili Yu was in the middle of looking through ancient records. Upon hearing his, he lifted his head and looked at her inquiringly.</p><br/><p>Tang Doudou thought about it a little and felt that it probably wouldn’t be much of a problem. “It’ll definitely be fine. It’s not like I’m a kid, I know how to protect myself. I just don’t know the road back.”</p><br/><p>“You should let Xiao Dao go with you.” Baili Yu was not the type that liked to lock up the things he loved. He liked to see Tang Doudou smile carefreely and also respected all of her choices.</p><br/><p>However, it had to be with the prerequisite that she was safe.</p><br/><p>Upon hearing this name, the image of that bashful face appeared in Tang Doudou’s mind. “That works.”</p><br/><p>She had yet to see Xiao Dao’s martial arts but he was pleasing to the eye as a person. He was very obedient and also had unique views. She liked this kind of subordinate.</p><br/><p>After the matter was settled, Tang Doudou didn’t dally. She packed up, then handed the things for curing the Hoarfrost Poison to Baili Yu so that he could study them in his free time. Cang Baicao had said that she was the only one that could cure this poison, but letting Baili Yu study it then teach her what to do was much safer than her blindly investigating on her own.</p><br/><p>Unexpectedly, Baili Yu took out the booklet and said, “I’ve annotated this with explanatory notes. When you have free time, have Xiao Dao teach you to read. In about a month or two you should be able to understand the things written.”</p><br/><p>“Isn’t this like taking off your pants to fart, doing more than is required?”</p><br/><p>“Do your best to learn, it’ll be good for you.”</p><br/><p>Thus, in the following days Tang Doudou had one additional task: learn to read.</p><br/><p>__________</p><br/>\n</div>"}