{"title": "Chapter 154.2: Angered Off Jun Xin", "id": 154, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1542-angered-off-jun-xin", "volume_title": "Volume 2", "body": "<h1>Chapter 154.2: Angered Off Jun Xin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When it was dinner time and Tang Doudou had finished preparing the meal with Meng Yu’s help, not only did she not call Jun Xin, who was waiting next to the kitchen the entire time, she didn’t even set out a bowl and chopsticks for him.</p><br/><p>For the sake of all the food on the table, Jun Xin suppressed his anger and went to get a bowl himself. However, when he returned to eat, he discovered that there wasn’t even a seat for him.</p><br/><p>“Li Xueyi! What exactly do you mean by this?” Even now he was still suppressing his fury. This woman was seriously taking shameless advantage of his weakness. Did she know that if he left, there was no way Bai Feiyun would be able to protect her?</p><br/><p>This was just great. He was worried about her safety so he told her not to run around outside, and he was even planning to help her deal with the Demonic Sect. Yet all he got for his hard work was that she refused to even cook for him. Enough was enough!</p><br/><p>Tang Doudou took a bit of the simmer-fried fish next to her and slowly placed it in her mouth. She chewed it slowly and swallowed before looking at Jun Xin with puzzlement. “Hey, why are you here, Young Master Jun? We’re not entertaining guests tonight, so we didn’t prepare a portion for you. Please return to your own house!”</p><br/><p>“You!”</p><br/><p>Right after Tang Doudou’s words fell, everyone else looked over as if also wondering why he was still here.</p><br/><p>Facing all those gazes, no matter how thick Jun Xin’s skin was, he still couldn’t bear it. Angrily smashing the bowl, he said, “You just wait!”</p><br/><p>Then he leaped towards the wall. It was unknown what he was thinking as he seemed to have even forgotten the way back to Plum Garden. He only turned back with a dark expression after heading in the wrong direction for quite a while. He swept a cold glance over Tang Doudou, then turned and headed towards Plum Garden. In the end, he even stumbled on the roof several times. From the looks of it, he was really furious.</p><br/><p>The group only retrieved their gazes when he was completely gone from sight. They looked at each other, completely confused as to what was going on.</p><br/><p>However, Tang Doudou knew and was smug. She didn’t tell them though and simply said, “Come on, don’t mind him. Big Brother Yu, you should eat more. You’re so skinny you could compete with a monkey!”</p><br/><p>Yu Fenger covered his mouth. “Doudou’s so bad, to take this approach in order to laugh at me and say that I’m like a monkey.”</p><br/><p>“Hehe…”</p><br/><p>The more they interacted, the more Tang Doudou felt like kindred spirits with Yu Fenger. If it weren’t for the fact that Yu Fenger tried to rob her the first time they met, she would have believed that they were old friends.</p><br/><p>Yu Fenger was really like an older brother. He tolerated everything she did and always had a smile on his face.</p><br/><p>Even his vulgar-looking face was looking more and more amiable to Tang Doudou.</p><br/><p>However, when Tang Doudou recalled the matter she had discussed with Yu Fenger and the others earlier, she started worrying again and completely lost her appetite.</p><br/><p>Yu Fenger and Jin Longbiao shared a glance upon seeing Tang Doudou sigh repeatedly, then Yu Fenger said, “Doudou ah, since you’ve already made a decision, you shouldn’t worry about it so much. Just think of how to deal with the consequences.”</p><br/><p>After being here for half a day, Yu Fenger had already found out from Wu Li that Tang Doudou was the martial arts Alliance Head. He had mixed feelings about it. Although he was happy that Tang Doudou had been able to become the Alliance Head at such a young age, he was also worried about the matter of the Demonic Sect which everyone in Jianghu had been talking about lately. Moreover, it had always been well-known that Li Xueyi had a lot of enemies, which worried Yu Fenger a lot.</p><br/><p>“How about you look for that Lord of Cloud City and have him find someone else to be Alliance Head? The martial arts circles are extensive, it’s not suitable for a girl like you to manage…”</p><br/><p>Tang Doudou knew that he was worrying for her, but she felt uncomfortable upon hearing this. Why did it matter that she was a girl?</p><br/><p>Before she had transmigrated over, Li Xueyi had instilled fear into so many people because they wanted to prevent her to from becoming the Alliance Head. She had found out quite a lot about Li Xueyi from Bai Feiyun. Who would have ever imagined that Li Xueyi was a woman from her behavior?</p><br/><p>Li Xueyi had been able to do those things. Even if she, Tang Doudou, couldn’t do all of them, at the very least she couldn’t fall too far short, right?</p><br/><p>Thinking thus, a surge of courage emerged in Tang Doudou’s heart. F*ck! She’d stop thinking about it, she’d just do it!</p><br/><p>Once she made the Demonic Sect retreat in defeat, she’d lead the comrades of the martial arts circles to jointly establish a moderately prosperous society*. Then she’d make her female identity public and openly sit on the Alliance Head seat as a female!</p><br/><p>Term originally of Confucius origin for a society composed of a functional middle class where the needs of most citizens are met</p><br/><p>Tang Doudou subconsciously emitted an imposing aura as she sat there. Yu Fenger was taken aback and was just about to ask Tang Doudou what happened when Jin Longbiao stopped him with a look.</p><br/><p>Tang Doudou only returned to her senses when she was so eager to get started, that she couldn’t sit still anymore. She put down her chopsticks and, smiling sweetly towards Yu Fenger, said, “Big Brother Yu, you guys eat first. I still have matters to arrange so I won’t keep you guys company! Please help me pay attention to that matter. Let me know right away if there are any unusual changes!”</p><br/><p>Yu Fenger wanted to ask what she was off to do, but Jin Longbiao spoke before he could. “Doudou, go do what you need to do. Your Big Brother Yu and I will help you handle this task so don’t worry!”</p><br/><p>__________</p><br/>\n</div>"}