{"title": "Chapter 150.2: Reincarnation of a Ghost that had Starved to Death", "id": 150, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1502-reincarnation-of-a-ghost-that-had-starved-to-death", "volume_title": "Volume 2", "body": "<h1>Chapter 150.2: Reincarnation of a Ghost that had Starved to Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>All that could be seen was Jun Xin, who had been taciturn and low-key this entire time, using a tornado-like speed to shove all the dishes on the table into his mouth. His appearance was no different from that of the reincarnation of a ghost that had starved to death.</p><br/><p>Tang Doudou barely managed to keep herself from slapping him to death. Did he get hexed or something? No matter how much of a glutton he was, he still couldn’t eat like this. It was so embarrassing.</p><br/><p>Jun Xin ate for a while before he noticed that no one else was moving their chopsticks. So he looked up in confusion and said, “Meat ah, aiy are yall ethan?” (Eat ah, why aren’t you all eating?)</p><br/><p>His mouth was so full of food that he couldn’t even speak clearly.</p><br/><p>“Little brat, y-you… how long has it been since you’ve eaten?” As Tang Doudou spoke, she looked towards Meng Yu. “You haven’t been giving him anything to eat lately?”</p><br/><p>Jun Xin had only returned today, how could she possibly know how long it’s been since he’s eaten? Meng Yu silently criticized.</p><br/><p>She said with a grieved expression, “Ever since Young Master Jun ate what you cooked last time, he has never eaten Meng Yu’s cooking again.”</p><br/><p>Tsk tsk, this is the sorrow of a foodie. After eating something good they’ll never want to eat something second-best again. If he couldn’t even swallow what Meng Yu made, what has he been eating these past two months? Dew? Air?</p><br/><p>At this time, Jun Xin quickly replied, “I’ve been out dealing with matters this past period and often didn’t get to eat. Occasionally I would hunt something and roast it. The flavors were so mild that my tastebuds were about to die.”</p><br/><p>After he finished speaking, he buried himself in eating again.</p><br/><p>Luckily Tang Doudou had overestimated while she was cooking. After she refilled the dishes, the others slowly started eating.</p><br/><p>Jun Xin was probably getting full as well, as he had slowed down his speed.</p><br/><p>After drinking a round of wine, they eased into conversation. Yu Fenger was the first to speak. He glanced at Jun Xin with restrained curiosity and asked, “Young Master Jun? Could you be the Blood Fiend Jun Xin who’s ranked number one in potential in Cloud City?”</p><br/><p>Jun Xin didn’t speak. From the looks of it he didn’t want to bother with Yu Fenger.</p><br/><p>Tang Doudou hastily glared at him and he finally lifted his eyes lazily to say: “En.”</p><br/><p>Upon getting an affirmation, Yu Fenger covered his chest, moved. “It really is you! I never thought I’d actually be able to see Blood Fiend Jun Xin while I was still alive. It’s really such a surprise!”</p><br/><p>“Life ah, is always full of unexpected surprises.” Jun Xin sneered as he looked at Tang Doudou, then at Bai Feiyun pointedly.</p><br/><p>Tang Doudou didn’t know what he meant by this and nothing could be made out from Bai Feiyun’s expression. Yu Fenger’s eyes were filled with stars as he looked towards Jun Xin worshipfully, “As expected of Blood Fiend Jun Xin who’s ranked first in potential, even a casual sentence contains deep meanings worthy of being pondered.”</p><br/><p>…Tang Doudou covered her forehead. Seemed like Yu Fenger’s habit of not being able to close his legs when seeing a handsome guy couldn’t be fixed.</p><br/><p>Jin Longbiao, on the contrary. didn’t mind at all and was enjoying himself drinking with the Wu brothers.</p><br/><p>Qing Yin and Meng Yu were girls so they couldn’t join in the conversation and sat there eating silently.</p><br/><p>Tang Doudou saw that this atmosphere wasn’t harmonious at all and rubbed her chin. Suddenly, her eyes lit up with an idea. “How about we play a game?”</p><br/><p>A game?</p><br/><p>Everyone present was surprised. How could they play a game while eating?</p><br/><p>The person who cheered on the idea the most was naturally Jun Xin. Of course, he only cheered it on to wreck it.</p><br/><p>“A game? What kind of fun game would a dumb person like you be able to come up with?”</p><br/><p>You’re the stupid one! Tang Doudou’s forehead was full of black lines. She really wanted to just beat up this damned brat, he was seriously… He really didn’t give any face at all.</p><br/><p>Bai Feiyun put down his chopsticks and said gracefully, “I’ve finished eating. There’s still matters to handle in the Alliance Head Residence, so I will leave first. Everyone, please take your time.”</p><br/><p>After he stood up, he glanced at Tang Doudou and said, “Once you’ve cleaned up, come over, I still have things to speak to you about. I’ve obtained news that Elder Yu has almost reached Huai City.”</p><br/><p>Tang Doudou was alarmed by this news. How could she still have the mind to play games? She stood up and said, “I’ll go with you right now!”</p><br/><p>After a moment of hesitation, Bai Feiyun nodded. “That also works.”</p><br/><p>“Big Brother Yu and the rest of you, take your time. Qing Yin, Meng Yu, I’ll have to trouble you guys to help clean up afterwards. I’ll come back after dealing with the matters!”</p><br/><p>After she finished speaking, she hastily followed after Bai Feiyun and left.</p><br/><p>Seeing that she had already left, Jun Xin put down his chopsticks as well and left without a word.</p><br/><p>“Fenger ah, what’s with this Cloud City potential ranking? Why haven’t I heard of it before? And that brat hasn’t even grown an even layer of fur, is he really the Blood Fiend Jun Xin who doesn’t even blink at killing someone?” Although Jin Longbiao was drinking the entire time, he never shifted his attention away from Yu Fenger. The moment Jun Xin left, he moved over to ask Yu Fenger his questions.</p><br/><p>Qing Yin, Meng Yu, and Xiao Dao were still at the table. When they heard this, they shared a glance and, in tacit mutual understanding, continued eating quietly without giving Jin Longbiao an explanation.</p><br/><p>Yu Fenger smiled as he picked up his chopsticks. “I never expected that Doudou would be this skilled at cooking. She’s much better than the chiefs at Fragrant Cuisine House.”</p><br/><p>Jin Longbiao instantly realized that this wasn’t a good place to talk.</p><br/><p>Hence he laughed and said cooperatively, “Fenger, I agree with this. Doudou’s culinary skills are truly great.”</p><br/><p>Next door, Tang Doudou rubbed her burning hot ears. Who the heck was talking about her?</p><br/><p>__________</p><br/>\n</div>"}