{"title": "Chapter 168.1: Appearance of a Mysterious Person", "id": 168, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1681-appearance-of-a-mysterious-person", "volume_title": "Volume 2", "body": "<h1>Chapter 168.1: Appearance of a Mysterious Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When she finally got a clear look, she felt the impulse to send a punch over. F*ck! Didn’t this guy know that you could scare someone straight to death!?</p><br/><p>What confused her more was the question, why would he be here?</p><br/><p>He was the last person one would expect to be here!</p><br/><p>“Are you here to save me?” The subject was a person, and it was even a person she recognized so her heart immediately fell back to its place.</p><br/><p>The person that had come was Mu Ye. Of course, what happened earlier wasn’t him trying to pull a prank. He had planned to walk to Tang Doudou and help undo the iron clamps around her shoulders, but unexpectedly she started screaming right as he got close. Even he had been shocked.</p><br/><p>“I’m not,” replied Mu Ye coldly.</p><br/><p>However, he didn’t stop moving his hands. With a slight movement of his fingers, he shattered the iron rings that had been binding Tang Doudou’s arms, legs, and shoulders.</p><br/><p>Having been freed, Tang Doudou immediately jumped up energetically and beamed. “And you still say that you’re not here to save me? You’ve already helped me out of these iron cuffs! Haha!”</p><br/><p>“I won’t bring you out,” continued Mu Ye coldly. The only reason he undid the cuffs for her was because he was worried it’d be uncomfortable for her if she stayed cuffed too long.</p><br/><p>Tang Doudou’s smile immediately crumbled. “Why ah?”</p><br/><p>“If you run away while bearing a criminal charge, you will have to keep running for the rest of your life. That’s not good.” The words were stiff but embedded with gentle feelings. Mu Ye’s face, in the darkness, was slightly red. For the half a month since he had been forced to retreat by Jun Xin, he had stayed in Huai City. When he had nothing to do, he liked to sit next to the river quietly for half the day. A couple days ago, he happened to be sitting there and witnessed everything that happened.</p><br/><p>Tang Doudou was currently puzzling over something and didn’t notice Mu Ye’s unusual tone. She rubbed her head in distress. “That really wouldn’t be good. But if I don’t leave, I’ll definitely be tormented to death! Also, I don’t even know if I really caused that incident.”</p><br/><p>The more she spoke, the quieter her voice got until it almost disappeared entirely.</p><br/><p>Unexpectedly, Mu Ye actually reached out and rubbed her head. It was completely different from how Baili Yu patted her. It was very gentle. It was hard to imagine that this ice-cold man could be so gentle and warm. As if comforting her, he only lightly rubbed her head a little before moving his hand away.</p><br/><p>The sound of his cold voice came from above her head. “You don’t need to worry, that vendor isn’t dead. It wasn’t you that injured him back then either, so you don’t need to worry.”</p><br/><p>“H-how do you know?” Tang Doudou looked at Mu Ye, surprised.</p><br/><p>Mu Ye replied, “I saw it.”</p><br/><p>“You saw it?”</p><br/><p>“Someone else had done it. It was a very strong person, he’s even stronger than Baili Yu. It was him that injured the vendor, and also him that sent the vendor flying. The patrol team had been waiting nearby the entire time and started heading over before that missus even went to look for them.” Mu Ye spoke in simple terms so Tang Doudou instantly understood.</p><br/><p>“What you mean is that this incident is completely unrelated to me?”</p><br/><p>“It’s greatly related to you.”</p><br/><p>Tang Doudou slapped her forehead, feeling like her brain was about to explode.</p><br/><p>Then Mu Ye said, “You’ll probably be able to get out very soon.”</p><br/><p>“Get out? Even if I didn’t injure or kill anyone, this isn’t the High Judiciary Office or the Ministry of Justice. Do you feel like anyone would come to interrogate me here? Moreover, if there was an interrogation, it couldn’t be that you’re going to help me testify?”</p><br/><p>“Why can’t I?” asked Mu Ye.</p><br/><p>She seriously couldn’t communicate well with this iceblock. She was currently in Xi Qiuyi’s grasp. Leaving aside the fact for now that there was no way Xi Qiuyi would easily hand her over, even if she was handed over, someone had to have the guts to come investigate!</p><br/><p>Xi Qiulin most likely hated her guts. Even though she knew that Baili Yu had used some way to prevent him from messing with her, that person was still the Emperor!</p><br/><p>She had kicked him and scolded him in public, and even said that she was going to teach him how to be an Emperor. Not even an ordinary person would be able to stand it, so how could the Emperor who was usually worshipped by the masses possibly tolerate it?</p><br/><p>In short ah, this situation didn’t seem good!</p><br/><p>“The only possibility is if someone on the imperial court side stepped out for me,” muttered Tang Doudou.</p><br/><p>Mu Ye glanced at her and said, “Jun Xin attacked the Imperial City today.”</p><br/><p>“What!?” Tang Doudou was stupefied. Attacking the Imperial City was a crime punishable by decapitation! Why did that little brat act so rashly!?</p><br/><p>“Then, how is he right now?” Tang Doudou asked nervously.</p><br/><p>Mu Ye replied, “The Emperor has already met with him. I think he’s probably fine.”</p><br/><p>“He had this type of capability? How unexpected ah.” Tang Doudou was a bit stunned. She hadn’t expected for a result like this. For better or for worse, Baili Yu had his title of prince and was also the richest individual in the world. It was understandable that Xi Qiulin had to give him face.</p><br/><p>But Jun Xin?</p><br/><p>She had never heard about him having some amazing background. Could it be that Xi Qiulin feared Baili Yu to the point that he even feared the people around Baili Yu?</p><br/><p>That doesn’t make sense ah!</p><br/><p>Tang Doudou scratched her head, vexed. She couldn’t understand what was going on.</p><br/><p>“You’ll be able to get out,” said Mu Ye again.</p><br/><p>Tang Doudou looked at him. “I know, you should go.”</p><br/><p>“Alright.”</p><br/><p>What a dull person.</p><br/><p>Tang Doudou was speechless. He was really leaving!? “Can you help me with something?”</p><br/><p>Actually, she was quite grateful to Mu Ye. According to their identities, they were enemies.</p><br/><p>Now that she, the martial arts Alliance Head, had fallen into misfortune, Mu Ye easily take advantage of this chance to take over the martial arts circles and rule Jianghu.</p><br/><p>Yet not only did he not do so, he even kindheartedly ran all the way here to tell her about these things so that she would stop worrying.</p><br/><p>Sometimes Tang Doudou seriously wondered if his brain was short-circuiting? Why was he so different from other Demonic Sect Leaders?</p><br/><p>It was so strange.</p><br/><p>Mu Ye didn’t hesitate at all and nodded when Tang Doudou asked for help. “Alright.”</p><br/><p>Faced with such a frank reply, Tang Doudou found it hard to ask. However, for the sake of her little life, she thickened her skin and said, “Since Jun Xin went to find Xi Qiulin, he definitely wouldn’t be able to search all the way here that quickly. However, Xi Qiuyi seemed impatient. He might try to use torture on me. You see how this interrogation room looks. He’s probably off taking care of some business right now but I’ll be doomed once he comes back. Could you help me notify Jun Xin and tell him that I’m here?”</p><br/><p>Mu Ye still didn’t hesitate and immediately replied, “Alright!”</p><br/><p>“Thanks!” Tang Doudou didn’t know what else to say to express her gratitude. Her eyes whirled, then she said, “I’ll definitely treat you to a meal once I get out!”</p><br/><p>“Alright!”</p><br/><p>It was the same word again. Tang Doudou was thoroughly defeated by him.</p><br/><p>Neither of the two knew what to say. After being silent for a long while, Mu Ye said, “I’m leaving now.”</p><br/><p>Tang Doudou really didn’t want to say ‘alright’ so she said, “En, be careful!”</p><br/><p>It was a very common reply, yet Mu Ye repeatedly glanced at her with some unknown emotion flickering in his eyes. However, it was truly too dark in the interrogation room so Tang Doudou couldn’t see that. His voice suddenly softened. “Alright.”</p><br/><p>It was still the same word but it didn’t feel as stiff as before.</p><br/><p>Tang Doudou looked at him in surprise, yet all she saw was his back. Mu Ye disappeared into the darkness without another word.</p><br/><p>Tang Doudou looked around but couldn’t figure out how he got in.</p><br/><p>Aiy, all she could do now was wait for someone to come rescue her!</p><br/><p>__________</p><br/>\n</div>"}