{"title": "Chapter 170.1: Fierce Wolves", "id": 170, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1701-fierce-wolves", "volume_title": "Volume 2", "body": "<h1>Chapter 170.1: Fierce Wolves</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The mysterious person was abnormally sensitive and immediately noticed Mu Ye’s glare. He abruptly turned around. “Jeje, so you’re awake too!”</p><br/><p>The moment he turned away, Tang Doudou returned to her senses. Confusion filled her eyes. What had happened earlier?</p><br/><p>“Are you the only one?”</p><br/><p>The sound of Mu Ye’s voice suddenly rang out. Tang Doudou hastily looked over in surprise. Only then did she discover that the person who had been dragged here with her was Mu Ye.</p><br/><p>“Mu Ye!” She cried out in pleasant surprise.</p><br/><p>But it didn’t attract Mu Ye’s attention. He glared coldly at that mysterious person as he pressed his thin lips tightly together. It was clear he was furious.</p><br/><p>The mysterious person smiled in contempt. “It’s something I can do on my own, so of course I don’t need more people.”</p><br/><p>“Aren’t you afraid of being caught and punished for acting on your own initiative?”</p><br/><p>From what Mu Ye was saying, it seemed like he knew this person. Tang Doudou became even more confused and couldn’t help but ask Mu Ye, “What exactly is going on?”</p><br/><p>Mu Ye finally looked at her. His gaze was shockingly cold. “I don’t know!”</p><br/><p>What a troll! If he didn’t know, what was all that he said just now?</p><br/><p>It was clear that he just didn’t want to tell her. Tang Doudou felt frustrated just thinking about it and decided to just ask the mysterious person instead, “Then you should know, right?”</p><br/><p>“Heehee, no rush, you’ll know soon!” The mysterious person laughed strangely. Reaching out, he lifted Tang Doudou and threw her on the wolf’s back. “Ah Meng, bring her back. I still have things to discuss with this friend!”</p><br/><p>The wolf howled, then leaped out like the wind.</p><br/><p>Tang Doudou couldn’t even move right now so the idea of holding on was simply a joke, she almost got thrown off the moment the wolf jumped. She immediately started praying frantically, and it seemed effective as Ah Meng slowed down and unhurriedly started trotting forward.</p><br/><p>She didn’t know where it was bringing her.</p><br/><p>She was still thinking about Mu Ye and that mysterious person. What were they discussing after she left?</p><br/><p>Mu Ye was probably not on the same side as him, but from the way they talked, they seem to know each other.</p><br/><p>The f*ck?! What kind of place was this damned wolf walking through?</p><br/><p>Tang Doudou had been engrossed in thought when Ah Meng suddenly started jumping again. This time, she wasn’t that fortunate and was directly flung to the ground. The rock she rammed into almost crushed her waist.</p><br/><p>“Aiyoh, my poor waist!” It was seriously painful, but Tang Doudou couldn’t move even if she wanted to, she could only lie there helplessly. Tears crashed down as she looked speechlessly towards the bright moon in the sky. Old Heavens, please don’t play me this way!</p><br/><p>Ah Meng saw that she had fallen down. However, animals were in the end still just animals. No matter how intelligent they were, their intelligence couldn’t compare to human intelligence. He whimpered softly as he looked at her with an ominous glint in his eyes like he was urging her to hurry and get up!</p><br/><p>“F*ck! If this daddy could get up, would this daddy be laying here listening to you urge!?” Tang Doudou cursed at Ah Meng, irritated.</p><br/><p>Roar!</p><br/><p>Ah Meng roared at her, seeming to have understood what she said. He abruptly leaped over and opened his mouth to bite Tang Doudou. Tang Doudou was scared stiff. “Frick! Don’t be so rash! I can’t get up, go find your damned ghost master, alright? F*ck! How do you plan to explain to your damned ghost master if you bite me to death!? Hey hey, don’t bite me aaaah!”</p><br/><p>Ah Meng gave a low growl like he was telling her to shut up. Then he chomped down on her clothes, fiercely swung her up, and she flew into the sky.</p><br/><p>Da fudge? Could it be that he wanted to smash her to death first before eating her?</p><br/><p>Once again, it was clear that she had overthought things. Ah Meng was only throwing her up so he could catch her on his back.</p><br/><p>Tang Doudou once again landed on Ah Meng’s back. Ah Meng looked towards the place that he had just passed, a trace of confusion flashing through his eyes, then he looked around warily. He had walked this road several hundred thousand times, all the uneven places had already been stomped flat by him. How could such a large rock suddenly appear? Even he had almost fallen.</p><br/><p>However, his intelligence was limited. This was as far as he could think, he couldn’t imagine anything beyond that observation.</p><br/><p>After looking around and ascertaining the direction, Ah Meng carried Tang Doudou onwards and soon arrived at a narrow opening.</p><br/><p>He nimbly slid inside. Tang Doudou’s line of sight immediately widened.</p><br/><p>Ash-white rocks surrounded them on all sides. They were rugged with strange wispy veins. Some enormous flowering trees grew out of some of the cracks. As petals descended under the glow of the moonlight, it made the place seem enchantingly beautiful.</p><br/><p>Ah Meng carried her as he walked along this small quiet road. After passing those trees, an enormous cave appeared.</p><br/><p>Ah Meng shook himself and threw Tang Doudou down in front of that cave. Following that, it leaped on top of the opposite rock and started howling towards the moon.</p><br/><p>Just as Tang Doudou was wondering what it was doing, wolf howls answered it from all around. From the sound of it, there were at least a hundred wolves.</p><br/><p>Fudge! Was it calling over its wolf pack to share the meal?</p><br/><p>“Ah Meng, d-don’t howl anymore!” Tang Doudou trembled as she looked at the figure in the moonlight.</p><br/><p>Ah Meng howled a couple more times, then turned around. “Owoo…”</p><br/><p>Wut’s that?</p><br/><p>Tang Doudou rolled her eyes. Wolf Bro, could you speak in human?</p><br/><p>“I’m freaking scared ah!” Tang Doudou didn’t care what Ah Meng meant and simply cried towards Ah Meng with a sobbing expression on her face.</p><br/><p>Ah Meng paused for a moment thoughtfully. Tang Doudou thought it understood and was just about to sigh in relief when she heard it start howling even more vigorously.</p><br/><p>Da fudge! As expected, there’s no way to communicate with an animal!</p><br/><p>__________</p><br/>\n</div>"}