{"title": "Chapter 175.2: Nan Maner", "id": 175, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1752-nan-maner", "volume_title": "Volume 2", "body": "<h1>Chapter 175.2: Nan Maner</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The next day, when Tang Doudou woke up from her dream, the moment she opened her eyes she saw two large, black eyes staring at her with concentration.</p><br/><p>“You are?” She rubbed her head. It felt very swollen as if someone had pumped it full of air, it was really uncomfortable.</p><br/><p>When Nan Maner saw that she was awake, she smiled happily. “I’m Nan Maner, Grandma’s granddaughter-yo. Big Sister, do you feel uncomfortable anywhere-yo? You can tell Maner-yo!”</p><br/><p>What an adorable little lady.</p><br/><p>Upon hearing this lively voice, Tang Doudou inwardly remarked with a heartfelt sigh. Then, she pointed at her head. “Hurts, it really hurts here.”</p><br/><p>Nan Maner grabbed her wrist and listened earnestly with her head tilted for a while. Then she said, “It’s probably caused from too much blood loss. It’ll be better after a couple days of rest, Big Sister doesn’t need to worry-yo!”</p><br/><p>Her voice was melodious and tingling, and every mouthful of words carried the word ‘yo,’ causing people to want to burst out laughing.</p><br/><p>Yo1 is an interjection indicating slight surprise or used at the end of a sentence to soften the sentence and express exhortation. However, Nan Maner uses it overly much, probably due to habit.</p><br/><p>Tang Doudou said with a smile, “Thank you.”</p><br/><p>“Don’t mention it-yo! These are all things that Maner’s supposed to do-yo.” Nan Maner looked at Tang Doudou. It was no wonder the good man would like this big sister. Although her face was pale from losing a lot of blood, it still couldn’t conceal her delicate and beautiful features. “Big Sister, want water-yo?”</p><br/><p>Only then did Tang Doudou notice that Nan Maner was calling her big sister. She instinctively glanced down and saw that at some unknown time, she had been changed out of her ragged clothes. Currently, she was wearing a western region-styled outfit. Exquisite silver ornaments were weaved into the material. She fell in love with it after a single glance.</p><br/><p>“Naner, were you the one who helped me change? What is this place? Did you see the person that came with me? He’s really tall and big, and his face is like an eternally frozen mountain? A man that’s very handsome and cold?” Tang Doudou looked around the house and saw that it seemed to be surrounded by vines. Mu Ye wasn’t around, so she had no choice but to ask Nan Maner.</p><br/><p>Nan Maner smiled. Although Tang Doudou didn’t say that she wanted to drink water, she still poured a cup for her. “This place is Tree Valley-yo. Grandma changed your clothes-yo. The cold man is waiting outside-yo.”</p><br/><p>Tang Doudou hadn’t expected Nan Maner to answer without hesitation. She immediately felt a favorable impression towards this girl, she was really open and friendly. However, who was the Grandma she was talking about?</p><br/><p>Also, other than Mu Ye, that mysterious person had also come here too. Where did he go?</p><br/><p>Just as she was about to ask, an old grandma dressed in black came in from the entrance. She was probably the Grandma that Nan Maner had been talking about.</p><br/><p>She had noticed the moment she woke up that medicine had been applied to her wounds. The cooling feeling of the medicinal paste against her wounds was very soothing.</p><br/><p>Since this grandma was the one who helped change her, then that meant that the person who treated her wounds was also this grandma.</p><br/><p>Thinking to here, she spoke to the grandma in a very grateful tone. “Grandma, thank you for saving me! I…”</p><br/><p>Before she even finished speaking, Grandma Shen waved her hand and said, “There is no need for Lady to be grateful to this old one. I only helped you clean your injuries and applied some medicine. It was someone else that saved you.”</p><br/><p>Right after she finished speaking, the mysterious person, Shen Moru appeared in the room.</p><br/><p>Upon seeing him, Nan Maner’s large eyes became filled with fear and she subconsciously ducked behind Grandma Shen.</p><br/><p>“Maner, head out for a while. I have things to discuss with Lady Doudou.” The first thing Shen Moru did after he appeared was to send Nan Maner out.</p><br/><p>This was just what Nan Maner wanted. She had feared Saint King Shen the most ever since she was a child. Whenever she was with him, her entire body would tremble involuntarily with fear.</p><br/><p>Grandma Shen left with Nan Maner. Before leaving, she even closed the door to the room, making it so that Mu Ye couldn’t see what was going on inside the room.</p><br/><p>“What is Tree Valley?” Tang Doudou sipped the water Nan Maner gave her before looking towards Shen Moru and asking this question.</p><br/><p>“Tree Valley is secluded by mountains and forests. It exists for the sake of protecting. It’s the guardian of the Seven Great Saint Tribes’ descendants.”</p><br/><p>Shen Moru’s words confused Tang Doudou. What Seven Great Saint Tribes? And guardian? This was completely unrelated to what she asked?</p><br/><p>However, the meaning in these words seemed to indicate that there was an enormous secret slowly unfolding in front of Tang Doudou.</p><br/><p>What a troll though!</p><br/><p>She had shown no intention of wanting to know, alright?</p><br/><p>Regardless of whether it was Tree Valley or the Saint Tribes, or some pain-in-the-butt guardian, all these had nothing to do what her. What use was there in telling her?</p><br/><p>Unless… Tang Doudou suddenly recalled what Shen Moru said before about fate. Heavens ah! Could it be that she’s that so-call Saint Tribes’ guardian?</p><br/><p>The reason he brought her here was to make her continue this mission?</p><br/><p>Shen Moru didn’t pay attention to the thoughts that were arising in Tang Doudou’s heart and continued talking on his own, “The role of guarding the Saint Tribes had been passed down since ancient times for the sake of preserving the Saint Tribes’ descendants. When the descendant appears, the Saint Tribe comes forth!’</p><br/><p>As expected!</p><br/><p>Tang Doudou revealed an expression as if she suddenly realized something. “I’m the guardian? Then who are you guys? And who’s the descendant that appeared?”</p><br/><p>When she asked these questions, Shen Moru looked at her as if he was looking at an idiot. “Who says that you’re the guardian?”</p><br/><p>Her dumbness was really not like her mother.</p><br/><p>That woman was so highly intelligent. How did she give birth to such a dumb daughter?</p><br/><p>“Hah? I’m not the guardian? Then could I be…” Tang Doudou sucked in a breath. The sound of ‘Saint Tribe’s descendant’ seemed really awesome. Could she be the Saint Tribe’s descendant?</p><br/><p>Shen Moru laughed coldly. “Give up on your vain delusions, you’re not the guardian or the descendant, because you’re not good enough to be!”</p><br/><p>…</p><br/><p>Tang Doudou looked speechlessly at the dear friend in front of her. “If I’m not either, then who am I?”</p><br/><p>“Hehe, I can’t tell you that.”</p><br/><p>F*cking retard!</p><br/><p>Those were the only two words Tang Doudou could give him.</p><br/><p>“You probably already know about the fact that your surname is Tang, right?” Shen Moru asked suddenly when she didn’t speak.</p><br/><p>“I don’t know!” She didn’t admit it earlier so she couldn’t admit it now either.</p><br/><p>Shen Moru didn’t waste time on this and simply continued asking, “You’ve seen Tang Yi, that old guy right? He really is your biological grandfather. But you sure are vicious. In order to curry favor with Baili Yu, you actually tried to burn that old thing to death. Tsk tsk… you didn’t manage to burn that old thing to death, but you did burn something very important.”</p><br/><p>Suddenly, his voice turned terrifyingly eerie again. “You’ve read that book, haven’t you?”</p><br/>\n</div>"}