{"title": "Chapter 183.2: Reunited", "id": 183, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1832-reunited", "volume_title": "Volume 2", "body": "<h1>Chapter 183.2: Reunited</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Meanwhile, Tang Doudou was currently in quite a predicament. Yesterday, she had fainted next to the road before even reaching an inn. It was a good thing that her location had been remote enough. Though she woke up trembling from cold, she hadn’t encountered anyone with malicious intentions.</p><br/><p>After she woke up, she discovered that the inner strength that had suddenly emerged yesterday was gone. It didn’t seem much different from before. After the inner strength exploded, she would faint.</p><br/><p>It was just that in the past she had always fallen unconscious by the time her inner strength exploded, but now she could control all her actions. She didn’t know if this was a good thing or a bad thing.</p><br/><p>When the thought occurred to her that Mu Ye’s current situation was still unknown, she stopped wasting time and went to ask people how to get to Huai City. In the end, due to her ice-blue eyes, people thought she was a monster and chased after her to beat her up several times. She found a veil to cover her eyes and prepared to go ask at an inn when she realized that she didn’t have any money.</p><br/><p>There were plenty of silver ornaments on her clothes but – she didn’t know what had been used to attach them – even after exerting all her energy, including the energy she had used to suck milk as a baby, she still couldn’t even pull a single silver bead off.</p><br/><p>She was speechless. Why weren’t her eyes reverting back to normal even after the transformation ended and the inner strength disappeared?</p><br/><p>How was she supposed to face people in the future with such unusual eyes!?</p><br/><p>As she stood in the entrance of the inn, she smelled the enticing fragrance of food and her stomach growled even louder.</p><br/><p>That’s enough, she didn’t have money, just bear it!</p><br/><p>Just as she was about to look for an old temple to rest in, she saw that the streets had become filled with people. It was rowdy and lively. The excited expressions on those people’s faces resembled that of fans gathering to see a celebrity.</p><br/><p>There were even quite a lot of girls holding up red banners and shouting excitedly, “Prince, Prince, I love you!”</p><br/><p>Crazy fans truly existed regardless of era!</p><br/><p>Tang Doudou shook her head. If it had been before, perhaps she would have also gone to take a look but right now she only wanted to find a place to rest.</p><br/><p>After just a few steps, she suddenly spotted a familiar figure out of the corners of her eyes. When she turned around with a trembling heart to look, tears immediately flooded out of her eyes.</p><br/><p>It was Baili Yu.</p><br/><p>It had been three months, no, four months since she had seen him. His seductive yao-like aura was completely gone. His complexion was quite bad and he looked extremely tired. The rims of his eyes seemed sunken and there was no spirit in those peach blossom eyes. His lips were cracked and pale, and there was a little bit of stubble below his chin. All of this was telling her without words that, he hadn’t been living well.</p><br/><p>The moment she looked over, Baili Yu who was walking forward dispiritedly suddenly stiffened and looked over.</p><br/><p>His eyes immediately lit up with radiance even as emotions of disbelief flickered before soon being replaced with joy. It really was her!</p><br/><p>Even though she had on a black veil which concealed her features, even though she was in the dense crowd and almost submerged…</p><br/><p>Baili Yu walked over. He walked very slowly, because he was afraid that what he saw was simply his fantasy, that once he got close it’d turn out to be the moon in the mirror, the flowers in the mist.</p><br/><p>He was afraid that what he saw was simply an illusion, but Tang Doudou already couldn’t hold back her longing and sadness anymore. She pushed away the people in front of her and rushed up to hug Baili Yu. “Wuuwuu, big evil spirit, you’ve finally come to find me.”</p><br/><p>No matter how strong she usually acted, how fearless she pretended to be, the moment she saw Baili Yu all the weakness and helplessness hidden in her heart would pour out like a torrent. She greedily took in his smell. What Seven Great Saint Tribes, what fear and unease – they all gradually disappeared.</p><br/><p>If it was possible, she would prefer to know nothing and just stay by his side as a good little kitchen maid.</p><br/><p>“Where did Wife go? You didn’t send this husband any news for so long, this husband thought you didn’t want me anymore.” Baili Yu tried his best to make his voice seem calm, but it still trembled uncontrollably.</p><br/><p>When Tang Doudou heard his familiar voice, she felt even more relieved. “Do you know that I almost didn’t make it back? Yet you’re still joking at this kind of time. I’m not talking to you anymore.”</p><br/><p>Baili Yu abruptly pulled her into his arms with all his strength. However, when he spoke, his voice was extremely soft. “Of course this husband knew. It was just that this husband didn’t dare to think about it and could only keep searching…”</p><br/><p>Tang Doudou couldn’t bring herself to keep talking; her tears simply fell silently. At this moment, all she wanted was to do was stay in this comforting embrace and sleep.</p><br/><p>Baili Yu sensed her exhaustion and carried her into a nearby inn. It was only a dozen steps away, but Tang Doudou had already fallen asleep in his arms by the time he reached the inn. The sound of her even breathing immediately calmed the heart that had been panicking for the last three months.</p><br/><p>When they got to the room, Baili Yu wanted to put her down so that she could sleep more comfortably. However, the moment he tried to move away, he was grabbed onto tightly. “Big evil spirit, don’t leave…”</p><br/><p>He looked down and discovered that she was only sleep talking.</p><br/><p>He didn’t dare to try putting her on the bed again and instead lay on the bed with her. Tang Doudou slept very well using his arm as a pillow.</p><br/><p>He took the veil off her head, revealing a not especially terribly looking face. He traced her features with a finger fondly until his finger trailed to the bottom of her lips. His lips tugged into a smile. She was finally back, how great.</p><br/><p>__________</p><br/>\n</div>"}