{"title": "Chapter 194.2: Appearance of An Antidote", "id": 194, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1942-appearance-of-an-antidote", "volume_title": "Volume 2", "body": "<h1>Chapter 194.2: Appearance of An Antidote</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“You’re saying that the criminal is one of Baili Yu’s subordinates?” Su Yi still couldn’t believe it, after all, this matter was too strange. How could it be possible that Baili Yu wanted to kill Tang Doudou?</p><br/><p>“This subordinate truly did see that person enter Propitious Clouds Inn without coming back out!”</p><br/><p>When Su Yi saw that he seemed to be telling the truth, he furrowed his brows, then waved his hand. “You can withdraw. Continue observing Propitious Clouds Inn! Immediately report back if there are any abnormalities!”</p><br/><p>“Understood!”</p><br/><p>After that subordinate left, Cang Baicao immediately asked, “What exactly is going on? How did this girl get injured? Where did she get injured?”</p><br/><p>He hadn’t had the time to ask these questions when Su Yi brought Tang Doudou over yesterday. Now that circumstances were revealed to be unusual, he immediately asked about it.</p><br/><p>Bai Feiyun also looked towards Su Yi with a curious expression.</p><br/><p>Su Yi took a while to think, seeming to also be a little confused. “After I finished handling the matters and returned yesterday, I saw that this girl had collapsed in a pool of blood. I didn’t have time think about anything else and immediately brought her here. By the time it occurred to me to look for who did it, it was already too late. Not only were there no hidden guards in the City Lord Residence, even if there were, the person would have already gotten far away in that time!”</p><br/><p>“And then?” Bai Feiyun saw that he still had more to say and urged him on.</p><br/><p>Su Yi continued, “Then, last night, Baili Yu came…”</p><br/><p>“How did he find this place!?” Cang Baicao became even more curious. It was Baili Yu’s first time here after all!</p><br/><p>Su Yi waved his hand and indicated for him to listen. “He said that someone had gone to Propitious Clouds Inn to cause a ruckus. Afterwards, he followed that person here to find Feng Wu.”</p><br/><p>“However, Feng Wu said that she didn’t send anyone to trouble Baili Yu, so we guessed that it was likely done by that perpetrator. Hence, I sent someone to follow the person. It was completely unexpected that the perpetrator was also Baili Yu’s subordinate…”</p><br/><p>“Could it be that all of this was a play Baili Yu put on by himself?” Bai Feiyun felt that this was very possible. Although it was said that Baili Yu had caused an upheaval in the country in order to find Tang Doudou, no one could truly see through that person’s heart or understand his motives.</p><br/><p>Su Yi also had this thought, so he said, “No matter what, you guys need to help me treat this girl first. As for Baili Yu’s side, I’ll personally go see what’s going on!”</p><br/><p>That was all that they could do right now.</p><br/><p>Su Yi got up and was about to leave, but Cang Baicao called for him to stop, then pulled him outside the room.</p><br/><p>“What is it?” Su Yi was completely confused by his actions.</p><br/><p>Cang Baicao glanced inside the room at Bai Feiyun, then drew close to Su Yi’s ear and asked in a small voice, “Do you feel like this is something that the Seven Great Saint Tribes did?”</p><br/><p>“A person of the Saint Tribes would dare enter Cloud City? Are you joking with me?” Rather than say it had been done by the Seven Great Saint Tribes, it would be more probable to say it was done by Baili Yu!</p><br/><p>Cang Baicao said, “I suddenly remembered why the technique Feiyun had used seemed familiar.”</p><br/><p>He had first talked about the Seven Great Saint Tribes, and now he had switched to talking about Bai Feiyun. Su Yi wasn’t a fool, he immediately realized the link between the two topics. However, he couldn’t think of any possible link Bai Feiyun would have to the Saint Tribes no matter how he wracked his brain.</p><br/><p>“Heh, don’t start making random guesses. I was just a little curious whether the person that injured the girlie was really Baili Yu’s subordinate. If it really was, then that would be worth deliberating.” Cang Baicao stopped the discussion of the earlier topic.</p><br/><p>Su Yi was puzzled, however, he immediately realized what was going on when he saw out of the corner of his eye that Bai Feiyun was walking over. “That’s right, I’m really curious as well. However, if it really was that stinkin’ brat who did this, this daddy won’t let him off!”</p><br/><p>“I feel that this matter is probably unrelated to Baili gongzi.” Bai Feiyun walked over to share his opinion. From his reaction, he didn’t seem to have heard what Cang Baicao said earlier.</p><br/><p>His words were also irrefutable. Everyone present knew that there was no way Baili Yu would kill Tang Doudou.</p><br/><p>Why?</p><br/><p>Because he was poisoned with the Hoarfrost Poison and Tang Doudou was the only one that could cure it.</p><br/><p>The only way he would kill Tang Doudou was if he had already decided that he didn’t want to live anymore.</p><br/><p>Su Yi gave a long sigh. “From the looks of it, we can only wait for Xueyi to wake up.”</p><br/><p>“I’m afraid that’ll be too late,” said Bai Feiyun. “Her injury will take at least half a month to heal. Does City Lord feel like the people that came to the city would be able to wait that long?”</p><br/><p>However, Su Yi didn’t care about that at all. He swung his hand out in an arc, then clasped his hands behind his back as he walked out. “Humph! If they can’t wait that long then they should hurry and scram!”</p><br/><p>It was unknown what he planned to do again.</p><br/><p>Cang Baicao entered the room. Bai Feiyun stood in place and thought for a while. Some abnormal emotions seemed to surface in his eyes but were soon repressed again. He followed Cang Baicao back in. “Senior Cang, earlier you said that there was another problem with Alliance Head Li. Feiyun had carefully examined her earlier but didn’t find anything. Wonder…”</p><br/><p>“Didn’t find anything? Then did you find the Disseminating Tassel Fragrance in her body?” Although Cang Baicao harbored suspicions about Bai Feiyun’s unique medical technique, he still thought highly of him and wanted to guide him.</p><br/><p>When Bai Feiyun was prompted like this, he immediately knitted his brows. He recalled the earlier pulse situation and said hesitantly, “I don’t seem to have felt it…”</p><br/><p>“That’s right ah! It’s gone!” said Cang Baicao with a laugh as he pointed at Tang Doudou. “The Disseminating Tassel Fragrance is gone! Doesn’t that count as a huge problem?”</p><br/><p>Bai Feiyun finally understood and he asked, “What exactly is going on?”</p><br/><p>Cang Baicao sighed and shook his head. His tone was frustrated. “That’s why I said that I couldn’t understand it! Why would the Disseminating Tassel Fragrance disappear…”</p><br/><p>However, an excited light flashed through Bai Feiyun’s eyes as if he had thought of something. His voice was excited as well. “Perhaps, the antidote to the Disseminating Tassel Fragrance has already appeared in this world!”</p><br/><p>__________</p><br/>\n</div>"}