{"title": "Chapter 190.2: Let Me Do It Instead", "id": 190, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1902-let-me-do-it-instead", "volume_title": "Volume 2", "body": "<h1>Chapter 190.2: Let Me Do It Instead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Su Yi was a little baffled but he hadn’t rushed back for this. He asked Bai Feiyun, “Feiyun, um, how is Xueyi right now?”</p><br/><p>“Senior Cang had me find City Lord to ask for Hemostatic Fruit.”</p><br/><p>“Hemostatic Fruit?” Su Yi was completely confused. “What’s Hemostatic Fruit?”</p><br/><p>Upon hearing this, Bai Feiyun was also stunned. If he didn’t even know what Hemostatic Fruit was, would he have any?</p><br/><p>Cang Baicao was the only one that knew the answer.</p><br/><p>“Aiy, don’t worry about it. Was it Old Cang that said I had Hemostatic Fruits? Then come with me to the treasury to look for the Hemostatic Fruit. If you see anything else that might be useful, just take them all.” Su Yi didn’t remember whether he had this Hemostatic Fruit in his treasury or not, but he could tell from Bai Feiyun’s expression that this was something they urgently needed so he immediately pulled Bai Feiyun towards the City Lord Residence.</p><br/><p>They made a round in his treasury. If it weren’t for the fact that the situation was urgent, Bai Feiyun definitely would have stayed in here for several days. There were seriously too many rare things in here. A lot were treasures that had vanished from the outside world years ago.</p><br/><p>There were Hemostatic Fruits in here, and there were even a lot of them. Those red fruits had been casually thrown in a pile to the side. One could tell from this treatment how little their owner valued them.</p><br/><p>“So this is Hemostatic Fruit?”</p><br/><p>“En, I’ll go bring the things back first. City Lord should go arrange for someone to boil water! Then bring the water to the room in a cask.” Bai Feiyun immediately rushed to leave once he got the Hemostatic Fruits.</p><br/><p>However, right after he turned around, he suddenly paused and looked back at Su Yi as if he wanted to say something but was hesitating. “City Lord…”</p><br/><p>“Say it straight out.”</p><br/><p>“You should go and look for a maid in the city. Senior Cang and I are both men…”</p><br/><p>Su Yi understood. “Alright, I’ll go do that right away.”</p><br/><p>The two split up to work. After Bai Feiyun brought the Hemostatic Fruits and the drug ingredients over, he started helping Cang Baicao in the highly difficult rescue operation. As for Su Yi, he walked around the treasury again and sent all the items and medicinal ingredients that looked useful to Cang Baicao’s courtyard before heading to the streets to try and recruit a servant girl.</p><br/><p>The moment he walked out, a large blue-green bird flew over from the horizon. “Chirp chirp…”</p><br/><p>“Baili Yu’s here?” The information the large bird brought gave Su Yi a huge fright. “How is he so fast? Where is he now?”</p><br/><p>“Chirp chirp…”</p><br/><p>“What? He’s entered the city?” It seemed he had underestimated how much Baili Yu valued his disciple ah!</p><br/><p>However, Baili Yu’s early arrival was messing up his plan. Moreover, if Baili Yu found out about Tang Doudou’s current condition, that stinkin’ brat would definitely try to kill him!</p><br/><p>This won’t do! He couldn’t let him find out about Tang Doudou’s current situation!</p><br/><p>Currently, only four people knew about this situation. Of course, the person that injured Tang Doudou wasn’t included.</p><br/><p>When Su Yi’s thoughts got to that person, his anger burst out all at once and he didn’t have the patience to try to find a servant girl anymore. He revealed his identity as the City Lord and used some sex appeal to drag two servant girls back before rushing off to investigate who exactly had injured Tang Doudou.</p><br/><p>By the time he finished everything and returned to Cang Baicao’s place, it was already late, yet the people inside still haven’t come out yet.</p><br/><p>“How is the situation inside? You two haven’t been able to go in?” The two young girls that had been dragged here by him were standing outside the door. When they saw him, they hastily moved up to meet him with expressions of having suffered grievances. However, Su Yi was currently more worried than he was curious right now.</p><br/><p>The girl wearing a yellow garment nodded with unspoken grievances. “That gongzi in white said that it wasn’t time for us to enter yet.”</p><br/><p>“Then just wait outside for now.” The fact that they weren’t letting people in definitely meant that they hadn’t finished treating her. However, Cang Baicao should have at least come out to tell him a bit about the situation.</p><br/><p>Su Yi was beside himself with worry, but he didn’t dare to rashly disturb the people inside. He could only wait with the two servant girls outside the door.</p><br/><p>The current situation inside the room was not optimistic at all.</p><br/><p>Bai Feiyun frequently reached out to help wipe the sweat from Cang Baicao’s forehead and didn’t dare to be distracted even for a moment as he passed everything Cang Baicao needed immediately to his hand.</p><br/><p>Speaking shouldn’t be mentioned, right now he didn’t even dare to breathe too loudly.</p><br/><p>What he was currently most concerned about was Cang Baicao’s physical state. No matter how good his medical expertise was, he was old and his endurance wasn’t as good as that of someone as young as he. He had seen Cang Baicao’s hand shake several times. If it weren’t for his countless years of expertise, he probably would have already made a mistake by now.</p><br/><p>“Acupuncture needle!”</p><br/><p>Retrieving his thoughts, Bai Feiyun picked up the sterilized needle next to him and passed it over. However, before he could pass it to Cang Baicao’s hand, Cang Baicao’s body swayed and he almost fell to the ground.</p><br/><p>“Senior Cang.” Bai Feiyun hastily moved to support Cang Baicao up, then took a piece of ginseng and placed it into his mouth. Following that, he turned to look at the wound that had temporarily stopped bleeding and said in a low voice, “Let me do it instead!”</p><br/><p>Cang Baicao looked at him with shock but started considering the idea.</p><br/><p>“You’re already at your limit. If you keep pushing on…” He didn’t finish his words but the meaning was clear. Cang Baicao naturally knew what he meant. He couldn’t help but sigh. Once a person got old, even if they refused to give in to it, they still couldn’t do anything about it!</p><br/><p>However, would Bai Feiyun be able to do it?</p><br/><p>“Senior Cang, don’t worry. There’s no way I would fool around with her life.” Bai Feiyun glanced towards the unconscious person on the bed. His hands tightened into fists within his sleeves. I definitely won’t let anything happen to you.</p><br/><p>__________</p><br/>\n</div>"}