{"title": "Chapter 197.2: Childhood Sweethearts", "id": 197, "volume": 2, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-1972-childhood-sweethearts", "volume_title": "Volume 2", "body": "<h1>Chapter 197.2: Childhood Sweethearts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Last time, Feng Wu had beat Bai Luoqing within three moves, then demanded that Bai Luoqing never set foot in Cloud City again. Only then had that matter been resolved.</p><br/><p>When Su Yi came back and heard about it, he cried out his approval of Feng Wu’s actions. From the start, he hadn’t liked Bai Luoqing but the person was a woman so he couldn’t very well say it directly. How could he not be happy that Feng Wu had helped him resolve the problem?</p><br/><p>“Xueyi, what did Old Cang say?” Feng Wu smoothly retrieved the sword and returned to a normal stand. Wiping off her sweat, she walked over with a smile and stroked Tang Doudou’s cheek. “From the looks of it, you’re doing pretty well.”</p><br/><p>Tang Doudou liked nee-samas like Feng Wu the most. Not only was she pretty and amazing, most importantly she even had a good temper.</p><br/><p>“Hehe, it’s all thanks to everyone taking care of me during this period!”</p><br/><p>“You’ve even learned to be polite!”</p><br/><p>“What? From the looks of it, you want to go somewhere to play?” asked Feng Wu as she glanced at Su Yi who had hastily come out after Tang Doudou.</p><br/><p>Su Yi said in a helpless tone, “I told her to rest, but she insisted on going out to play.”</p><br/><p>“After staying in the house that long, it’d be pretty good to take a stroll around!” Feng Wu understood Tang Doudou’s current feelings very well. “Su Yi, if you’re busy, just let me take Xueyi out to play!”</p><br/><p>“Ugh…” He was indeed busy, that was why he wanted Tang Doudou to wait one more day before going out.</p><br/><p>In the end, Tang Doudou insisted on going out right now. Feng Wu’s words were no doubt exactly what he hoped for, but he couldn’t very well act happy. Feng Wu found his conflicted expression rather funny. Li Xueyi was the only one in this world that could make things this difficult for Su Yi.</p><br/><p>“How are you, a grown man, supposed to accompany a young girl on a stroll? You had better let me go instead. It couldn’t be that you don’t trust my martial arts?” said Feng Wu with a light smile as she pushed Su Yi aside.</p><br/><p>She moved her arm towards Tang Doudou and Tang Doudou immediately understood and grabbed her wrist. “Exactly! You should just focus on your affairs! It’s fine if you just leave me with Big Sister Feng Wu!”</p><br/><p>Su Yi faked a sigh, then nodded. “Be careful. Remember to immediately send a signal if you encounter anything.</p><br/><p>Su Yi had found the perpetrator right after Tang Doudou said it was Nangong Yan. It really did turn out to be the girl at Baili Yu’s side. The only reason they hadn’t made a move yet was because they hadn’t managed to find any evidence. He also didn’t know how to tell Tang Doudou about this matter.</p><br/><p>With the fact that Baili Yu didn’t know what was happening added on, this matter became even more tricky.</p><br/><p>Who asked for that Nangong Yan to be Baili Yu’s Junior Sister, Old Man Xuan Xiao’s most beloved disciple, and the Young Island Master of Wind Cloud Island? Even he, this Lord of Cloud City, feared Wind Cloud Island somewhat. Hence, he didn’t dare to make a move without evidence.</p><br/><p>Tang Doudou didn’t know about this matter but he had talked about this with Feng Wu before. Su Yi had sent Feng Wu a look before they left, the meaning was to, no matter what, not bring Li Xueyi to the inn Baili Yu was staying at. That guy often sat next to the window looking at no apparent thing.</p><br/><p>Feng Wu naturally understood and nodded.</p><br/><p>Tang Doudou who had been stuck inside for over a month was like a little bird that had been let out of her cage. She poked over here and glanced over there and generally fluttered all over the place. However, Cloud City’s streets weren’t very bustling. There was a very happy and content feeling. Some vendors were napping, some vendor stands didn’t even have people.</p><br/><p>After looking for a while, Tang Doudou felt completely bored. Wasn’t this a little too dull?</p><br/><p>There were only three things on the stall she was currently looking at and this arrangement was way too careless.</p><br/><p>She had no idea that this was a scene that only appeared due to Su Yi’s ardent requests. In the past, who in Cloud City would set up vendor stalls? If they weren’t sleeping, they were sleeping…</p><br/><p>“Eh? Isn’t this little Xueyi? Why do you have time to come out today?” Just as she was about to gloomily put down the accessory in her hand, that sleeping vendor suddenly opened his eyes and called out to her happily.</p><br/><p>He knew her?</p><br/><p>Tang Doudou didn’t understand what was going on and looked towards Feng Wu.</p><br/><p>Feng Wu hadn’t been to Cloud City a lot either and naturally didn’t recognize this person. “You are?”</p><br/><p>That vendor didn’t seem to mind the fact that Tang Doudou didn’t remember him. He picked up an ornament and shoved it right into her hand. “Hehe, it’s fine if little Xueyi doesn’t remember this old man. It’s good that you’ve come back, it’s very good. I heard that the City Lord has been looking for a groom for you? Remember that little son of mine? You think…”</p><br/><p>Tang Doudou’s face darkened before he even finished speaking and hastily shoved the thing back at him. “Ahem, I still have an urgent matter to attend to so I’ll leave first!”</p><br/><p>After she finished speaking, she hightailed it out of there.</p><br/><p>Who expected for the vendor to actually chase after her? As he ran, he continued shouting, “Little Xueyi ah! Little Zhuzi grew up with you ah! Green plums and hobby-horses, innocent playmates. You should consider it!”</p><br/><p>Green plums and hobby-horse refers to a couple that grew up as childhood friends. Because, children, they say, at one point in time, played underneath green plum trees and with hobby horses.</p><br/><p>“Little Xueyi!”</p><br/><p>“Hey hey, you said that the person that just ran past is the disciple of our City Lord, Xueyi?” The vendor’s ghost-like wail immediately attracted everyone’s attention. Several people blocked him to question him.</p><br/><p>The vendor was busy marketing his son so he didn’t bother to waste words with them. “If it’s not her, who else could it be? The last time she came back she still looked like a tomboy! Unexpectedly she has matured into such a lively beauty! My family’s Zhuzi grew up butt-naked with her…”</p><br/><p>Tang Doudou ran very fast and didn’t hear the rest. In the blink of an eye, she had left all those people behind. She patted her chest to calm down her still-racing heart. It was seriously too scary, it was practically demanding her life!</p><br/><p>Green plums and hobby-horses? Ha…</p><br/><p>And even something about growing up butt-naked with some pillar… (The guy’s name translates to pillar)</p><br/><p>Feng Wu followed next to her. Suddenly, she said with a laugh, “Who would’ve known that you had so many green plums?”</p><br/><p>What did that mean?</p><br/><p>Tang Doudou looked towards Feng Wu, puzzled. When did she have a lot of green plums and hobby-horses? Wasn’t there just the little Zhuzi from earlier?</p><br/><p>Just as she was wondering this, she heard something faintly like the buzzing of bees. When she turned around to look, her legs went weak from shock and she almost fell to the ground.</p><br/><p>Da fudge? Who could come and explain to her when she had become so popular in Cloud City?</p><br/><p>__________</p><br/>\n</div>"}