{"title": "Chapter 205.1: Overwhelming Victory Over Murong Ming", "id": 205, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2051-overwhelming-victory-over-murong-ming", "volume_title": "Volume 3", "body": "<h1>Chapter 205.1: Overwhelming Victory Over Murong Ming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Su Yi didn’t react to the exchange she proposed and simply propped up his chin to resume watching Murong Ming.</p><br/><p>Tang Doudou pouted when she got ignored and could only look back towards the stage center as well.</p><br/><p>Murong Ming and Liu Zhiyuan had already started fighting. What was astonishing was the fact that Murong Ming, whose martial arts had been nothing special, was now able to fight with apex expert Liu Zhiyuan on equal grounds.</p><br/><p>It had only been three months since they had last saw him, how did he become so strong?</p><br/><p>As Tang Doudou watched Murong Ming, she really wanted to ask Su Yi about it.</p><br/><p>Su Yi lightly tapped his fingertips on the table. “Murong Yu…”</p><br/><p>“Murong Ming is Murong Yu’s nephew. With Murong Yu’s sword skills that are recognized as the number one in the world, it’s not impossible for him to make Murong Ming’s martial arts improve rapidly in a short period of time. However, the strange thing is…”</p><br/><p>Su Yi had started analyzing the situation as if he was talking to himself before Tang Doudou even asked anything. “However, Murong Ming isn’t using a sword. It’s actually Liu Zhiyuan’s sword skills that seem very good. It seems like Murong Ming’s change has nothing to do with Murong Yu ah! Then who could it be?”</p><br/><p>Tang Doudou knew that he was doing this to help her analyze. Su Yi was trying to slowly familiarize her with these Jianghu affairs.</p><br/><p>When Tang Doudou thought about it, she felt that it was probably quite tiring for Su Yi. He had already taught all of this once in the past, and now he had to teach them again…</p><br/><p>If it were her, she definitely would have just given up on it. Tang Doudou felt a little touched as she offered her opinion. “I think, it’s likely related to Nangong Yan!”</p><br/><p>“Just give up ah you!” Su Yi glanced at her as if he was looking at an idiot. “How could amnesia turn someone dumb? Where did your wits go?”</p><br/><p>Tang Doudou looked towards the sky. Who’s dumb you freaking yo-yo!? The person’s already been swapped out, how could the same wits still be there? Just ‘go die’ ah you!</p><br/><p>Su Yi sighed as if he didn’t know what to do with her. “Although you did see Nangong Yan calm down after Murong Ming appeared, you can’t link the two just like that! Nangong Yan has no interest in the Murong family. Even if she were to collude with someone, she would at the very least look for someone like Mu Ye!”</p><br/><p>“Someone like Mu Ye?”</p><br/><p>“At the very least, someone who’s the leader of a sect!” Su Yi rubbed his cheek and glanced at the crowd again.</p><br/><p>It was still the same direction. Tang Doudou hastily looked over as well but still didn’t see anyone of interest. She was also confused about what background Nangong Yan had. How come it felt like Su Yi feared her a lot?</p><br/><p>After all, his attitude towards Baili Yu was nowhere like that.</p><br/><p>“Murong Ming’s about to win!” shouted Su Yi suddenly; however, his tone was not surprised.</p><br/><p>Tang Doudou retrieved her trail of thought and hastily looked over, just in time to see Murong Ming flick aside Liu Zhiyuan’s sword with his fan while his other hand, which was stretched into a claw, flew fiercely towards Liu Zhiyuan’s throat.</p><br/><p>In the blink of an eye he had subdued Liu Zhiyuan.</p><br/><p>“He’s really won?” She hadn’t been mentally prepared like Su Yi had been and was shocked to see Murong Ming win. She had, after all, experienced Liu Zhiyuan’s sword skills personally before. “Could it be that Liu Zhiyuan is faking it?”</p><br/><p>However, right after she said this, she shook her head. There were martial arts experts all around. How high would Liu Zhiyuan’s acting ability have to be in order to fool so many eyes?</p><br/><p>“You’ve let me win!” (polite phrase to say) Murong Ming couldn’t stop the corners of his lips from lifting. Anyone could see how delighted he was.</p><br/><p>Liu Zhiyuan only listened to Nangong Yan’s orders. He only went on stage in order to cause trouble for Tang Doudou. Now that he lost, he simply walked off the stage without a word.</p><br/><p>What Murong Ming said earlier was only out of politeness. When he saw Liu Zhiyuan walk down, he turned towards Su Yi and Tang Doudou and said, “This junior of the younger generation, Murong Ming, greets City Lord Su.”</p><br/><p>Out of all the people that came onstage, he was the only one to announce his own name.</p><br/><p>Su Yi couldn’t not reply to him. Moreover, he had felt pretty satisfied from beating him up last time so he had no reason to give the person more attitude. After laughing politely, he said, “It’s the Murong family? Junior is promising, not bad, not bad ah!”</p><br/><p>His tone sounded as if it was his first time seeing Murong Ming; it even contained a bit of the appreciation those of the older generation had towards the younger generation.</p><br/><p>A trace of hatred flashed through Murong Ming’s eyes and he lowered his gaze in order to conceal it. “Many thanks for City Lord’s praise. This junior does not deserve such honor!”</p><br/><p>“No need to be so polite, young people should be a little more flamboyant!” Su Yi laughed heartily, then glanced at the crowd below. “If no one wants to come up to challenge this Murong gongzi of ours, then let’s just end today’s competition now!”</p><br/><p>When he said this, Tang Doudou saw happiness appear in Murong Ming’s eyes and couldn’t help but become bewildered. What exactly did he mean by this?</p><br/><p>Su Yi’s words were obviously meant to incite someone to come up. The fact that he had chosen to say this now meant he was confident that someone would respond, and someone did. Right after he finished speaking, someone came onstage.</p><br/><p>The person wore a silver mask and had hair that was ink-black with a few strands of sparkling silver hair. The moment this person landed on the stage, an incomparable chill swept outwards.</p><br/><p>Huh!?</p><br/><p>Tang Doudou abruptly stood up and cried out in shock, “Ming Mengxin!”</p><br/><p>That person turned around and his lips seemed to curve into a smile. His sharp eyes contained deep emotions that she couldn’t understand.</p><br/><p>It really was Ming Mengxin!</p><br/><p>She hadn’t seen him since that time in Mist City and didn’t hear any news about him. How did he suddenly reappear again? And he was even participating in her matchmaking event? Could it be that old man’s doing again?</p><br/><p>“Ming Mengxin?” asked Su Yi in confusion. “Who is he? And this aura is so strange, why haven’t I ever heard of him before?”</p><br/><p>“He’s said to be the Hall Master of God Firmament Hall.” Regardless of what his goal was, he definitely wouldn’t dare to mess around in Cloud City so she should just watch for now. Calmer now, Tang Doudou slowly sat back down.</p><br/><p>Su Yi was still puzzled. “God Firmament Hall? What is that? Why haven’t I ever heard of it?”</p><br/><p>“Sire is participating in the matchmaking competition, yet refuses to show his true appearance. Sire truly doesn’t care about giving City Lord Su face at all!” When Murong Ming saw that Tang Doudou was shocked by Ming Mengxin’s appearance to the point that she involuntarily stood up and called out his name, he became very unhappy and spoke with a strangely gloomy tone.</p><br/><p>Ming Mengxin simply smiled. The chilling aura he gave off became even more intense as he asked coldly, “Will you fight, or flee?”</p><br/><p>“Humph! Allow me to teach you, this arrogant bastard, a proper lesson!” Murong Ming gave a humph and opened his fan with a swish as he elegantly attacked Ming Mengxin.</p><br/><p>Tang Doudou had never seen Ming Mengxin fight before and didn’t know how good his martial arts were, so she immediately opened her eyes wide in order to get a good look at exactly how strong Ming Mengxin was. After all, the old man had spoken of him so highly.</p><br/><p>Su Yi was also very curious about how capable this Ming Mengxin was, to actually make his obedient disciple lose self-control.</p><br/><p>Murong Ming’s movements looked elegant, but each move was fierce and deadly. There was no trace of the Murong family’s martial arts left. When Murong Yu saw, his facial color changed and his eyes darkened. It was unknown what he was thinking.</p><br/><p>Although Murong Ming’s attacks were fierce, Ming Mengxin didn’t seem to mind at all. He slightly tilted his head and moved back lightly just enough to dodge the attack.</p><br/><p>Some dodged because they weren’t strong enough to fight headon. Others dodged because they felt it beneath themselves to fight with you.</p><br/><p>Ming Mengxin was clearly one of the latter. However, with the current situation, how could he not fight?</p><br/><p>Originally, he had wanted to teach that Liu Zhiyuan a lesson, but his plan was ruined by Murong Ming so he could only vent his anger out on Murong Ming.</p><br/><p>Suddenly – no one had been able to see what exactly Ming Mengxin did – Murong Ming was sent flying. His fan fell off the stage, startling everyone.</p><br/><p>“What kind of martial arts was that?” Su Yi knitted his brows. His confused tone also contained some musings; for some reason he felt that the scene seemed familiar.</p><br/><p>Although Ming Mengxin knocked down Murong Ming, he didn’t stop. His figure moved like a shadow, with just a slight movement he got to Murong Ming.</p><br/><p>Murong Ming was currently completely confused as to what was going on. Earlier, he only felt a chilling aura attack him. Before he could even get a clear look, he was already falling. His entire body even felt limp and he couldn’t stir his inner strength at all.</p><br/><p>He looked back in that direction. When he saw that Ming Mengxin was coming over, he cried out, “Despicable! To actually use poison!”</p><br/><p>Wasn’t his current situation just as if he had been poisoned?</p><br/><p>Ming Mengxin towered over him as he looked down. Then, with a cruel smile, he stomped down.</p><br/><p>Krr-ack…</p><br/><p>The teeth-aching sound of bones shattering transmitted outwards. Tang Doudou immediately covered her chin. F*ck, he sure was ruthless!</p><br/><p>__________</p><br/>\n</div>"}