{"title": "Chapter 225.1: Refuse to Take the Offered Toast and Having to Take the Punishment Drink", "id": 225, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2251-refuse-to-take-the-offered-toast-and-having-to-take-the-punishment-drink", "volume_title": "Volume 3", "body": "<h1>Chapter 225.1: Refuse to Take the Offered Toast and Having to Take the Punishment Drink</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Just as this thought arose, Tang Doudou lost consciousness and collapsed.</p><br/><p>As Yuner reached out to catch her, another strange phenomenon occured. The blood that had come out after he pressed on her shoulder entered Tang Doudou’s shoulder again. Even the blood on her clothing started obediently re-entering her.</p><br/><p>Yuner didn’t express any surprise at this.</p><br/><p>However, his face was very pale and his forehead was covered with cold sweat. He set Tang Doudou down, far away from the corpse, then went to the side of the boat to get the oar. Following that, he used the oar to lift that corpse and carry it outside.</p><br/><p>He didn’t know much about poison, but he heard Jun Xin mention before that if he encountered this type of poison that didn’t require contact, the first thing to do was get away from the source of the poison before making preparations to cure the poison.</p><br/><p>It was impossible to get away from the source of the poison on this lake, and he also didn’t know how to cure the poison. The only thing he could do was get the source of the poison far away.</p><br/><p>Luckily, the boat had not come to a standstill and was still drifting along, following the flow of the water.</p><br/><p>He watched as the corpse he had thrown into the water sink. He didn’t know if this had been the right thing to do but he simply watched until the corpse was out of sight before heading back into the hold of the ship.</p><br/><p>However, when he got back, Tang Doudou was gone!</p><br/><p>Meanwhile, Baili Yu was no longer on Blue Moon Lake. He was chasing after the person that he had been investigating for a long time. Their direction was towards the back mountain of Cloud City.</p><br/><p>He had made use of Tang Doudou this time, but it was only because this person was too important to him and Tang Doudou. Moreover, these past years, this person has hardly ever revealed himself due to apprehensions about his (BLY’s) capability.</p><br/><p>However, this time he had hovered around the entrance of the City Lord Residence several times. Baili Yu didn’t know what he was planning.</p><br/><p>The only thing he knew was that this person wanted to do something to Tang Doudou!</p><br/><p>With the fact that Nangong Yan had also been preparing for something recently added on, he had formed a plan. Originally, Tang Doudou wasn’t part of his plan, but plans could never keep up with unexpected changes. Tang Doudou’s appearance today forced him to move the plan forward and add her into it.</p><br/><p>Blue Moon Lake wasn’t simply a place to enjoy the scenery. There was a large altar beneath the water and a secret passage that led outside on the left side of the altar. Few people knew of this, but that person had probably entered through that passageway.</p><br/><p>If he wanted to set an ambush, he would definitely stay near that altar. As Baili Yu predicted, right after he finished dealing with Nangong Yan’s people, that person had silently appeared behind the small boat to try and assassinate Tang Doudou while he was still unaware.</p><br/><p>Naturally Baili Yu wouldn’t let go of such a good opportunity, so he chased after this person all the way to the back mountain of Cloud City.</p><br/><p>The back mountain of Cloud City was forbidden grounds, but this didn’t matter to that person as he had already visited this place numerous times.</p><br/><p>That person’s speed was very fast. As Baili Yu was thinking about these things, that person had already disappeared into the forest ahead.</p><br/><p>Baili Yu gradually descended from the sky like a banished celestial, his moon-white robe lifting in the wind, until he came to a stop in front of the forest. He didn’t enter, because he knew that the person would be forced to retreat out of the forest soon.</p><br/><p>As he had predicted, in a little while that person came back out. When he saw that Baili Yu was standing outside the forest, he gave a cold humph and said, “What? Even Baili Yu has places he doesn’t dare to enter?”</p><br/><p>The voice was harsh and grating to the ears, clearly not his original voice. The full-body black robe made clear his identity – this person was someone of the Seven Great Saint Tribes.</p><br/><p>“That’s right ah! I never thought that there really existed a place I didn’t dare to enter,” said Baili Yu with a faint smile.</p><br/><p>That person’s eyes darkened. “What exactly do you want?”</p><br/><p>“It’s so clear. Could it be that Saint Envoy can’t tell?” Baili Yu spread his hands helplessly.</p><br/><p>“You want to become enemies with the Seven Great Saint Tribes? Baili Yu, I admit that you’re impressive, but compared to the Seven Great Saint Tribes, you’re just a sparrow trying to fight a swan. I advise you to quit while you’re ahead and be satisfied with your position as the richest individual under the heavens. Otherwise…”</p><br/><p>“Ha…” Baili Yu laughed softly. “Is this supposed to be a warning?”</p><br/><p>“I’m advising you not to choose the punishment drink instead of the offered toast!”</p><br/><p>“So it is a warning ah…”</p><br/><p>As if he had confirmed that the person was warning him, he gave a light sigh. He lifted his hand and examined it closely, then said, “I have yet to kill a Saint Envoy before, I wonder how it would feel?”</p><br/><p>“You! You’re seeking death!” When had he, as a Saint Envoy, ever received such disdain-filled treatment? The things he said earlier were just to diverge Baili Yu’s attention in order to escape, yet Baili Yu had seen through it with one glance. As of now, his only chance to escape was through battle!</p><br/><p>When his thoughts reached this point, black mist gradually seeped out of him and wrapped around his withered palms. The envoy’s strange attack rapidly approached Baili Yu.</p><br/><p>The withered but sharp fingertips were about to stab into Baili Yu’s chest, but Baili Yu didn’t even lift an eyebrow and simply continued to watch that person with a slight smile. “Is that so?”</p><br/><p>Right after he spoke, that person flew back like a broken kite and crashed into an enormous tree trunk before falling to the ground. As he supported himself up, he looked around in alarm. The person that attacked him just now wasn’t Baili Yu!</p><br/><p>__________</p><br/>\n</div>"}