{"title": "Chapter 228.2: Deserving This Outcome", "id": 228, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2282-deserving-this-outcome", "volume_title": "Volume 3", "body": "<h1>Chapter 228.2: Deserving This Outcome</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Murong Yu heard that the discussion getting more and more abnormal and was worried that he wouldn’t be able to explain it to Wind Cloud Island later, hence he shot the law enforcement officers a look to have them disperse the crowd.</p><br/><p>However, right at this time, Tang Doudou started shouting again. “Aiyah, what is this? Why would it be here? It’s seriously too damaging to the scenery!”</p><br/><p>As she spoke, she walked up and kicked the book of erotic images. From the direction, it seemed like she had been trying to kick it into the water.</p><br/><p>However, she had kicked it with too much force so the book ended up falling apart. The breeze that blew over from the surface of the lake immediately sent those pages flying all over the place. The women blushed from seeing the drawings on the papers and ran away, crying in alarm. Meanwhile, some busybodies reached out and caught the papers to examine them with relish. After a while, they discovered a huge secret.</p><br/><p>“Wow! There’s actually a mark on this!” Someone shouted in midst of the chaos.</p><br/><p>“Mark? What mark?” After someone said that, some people that liked to act as gentlemen used the excuse of looking for the mark to catch some pages.</p><br/><p>Cries of surprise immediately started coming from the crowd.</p><br/><p>“There actually is one!”</p><br/><p>“What mark? Why didn’t I see it?”</p><br/><p>“Hehe, you’re purposefully pretending not to see since you’re looking at an interesting part, aren’t you?”</p><br/><p>“Nonsense! As if I’m that type of person!”</p><br/><p>“There, on the upper right corner. Those two words are so large – Nangong Yan – how can you miss them?”</p><br/><p>“It really is Nangong Yan ah!”</p><br/><p>The crowd immediately exploded. Tang Doudou winked at Jun Xin who was also looking at a page with interest.</p><br/><p>This development was good enough, wasn’t it?</p><br/><p>The evidence had been destroyed and Nangong Yan couldn’t explain herself since she was unconscious. By the time she woke up, public opinion would have already been set.</p><br/><p>It had to be acknowledged that this method Jun Xin had come up with was ruthless and effective. Nangong Yan was going to have to stay in Wind Cloud Island for the rest of her life to hide her face.</p><br/><p>As long as Nangong Yan couldn’t come out, she wouldn’t be a threat. Although Tang Doudou hadn’t been able to take revenge for that stab, she still felt a lot more refreshed.</p><br/><p>When her thoughts arrived here, she started feeling grateful towards Jun Xin again.</p><br/><p>Meanwhile, despite the fact that the guy was clearly looking at the paper, after she winked at him, he looked up with a devious smile and gave her a thumbs up as he mouthed something.</p><br/><p>He seemed to be saying: stinkin’ woman, beautiful work!</p><br/><p>Hell, that’s of course! She was the one that had stepped out after all!</p><br/><p>Tang Doudou retrieved her gaze and looked at Nangong Yan who was lying on the ground, overlooked. She felt that this woman was quite pitiful. After this incident, it’d probably be hard for her to even get married.</p><br/><p>However, Jun Xin told her earlier that if the things Nangong Yan prepared had been revealed, she would have been the one whose reputation was destroyed.</p><br/><p>It truly seemed that if a woman wasn’t ruthless, she wouldn’t be able to keep her position.</p><br/><p>However, was it worth it to do all of this just because of a man?</p><br/><p>Tang Doudou shook her head and glanced at Yu Fenger who was still stunned before walking to Murong Yu. “Murong gongzi, from the looks of it, we won’t be able to resolve Miss Nangong’s incident today. Why don’t you have someone send her back to her inn first!”</p><br/><p>After she said that, she lowered her voice and reminded him, “The assassins are more important right now. When I was swimming in the lake earlier, I noticed something abnormal beneath the lake. I’m afraid something terrible will happen if we don’t hurry and investigate it!”</p><br/><p>Jun Xin was the one who told her about the abnormality beneath the lake.</p><br/><p>Unexpectedly, when Murong Yu heard this, he was so stirred up he didn’t even respond to her. After instructing someone to carry Nangong Yan back, he rushed off.</p><br/><p>The spectators saw that the people involved were leaving and started leaving as well, satisfied with the show and still holding onto the erotic pictures with Nangong Yan’s signatures.</p><br/><p>Yu Fenger also came back to his senses. He glanced at Tang Doudou and scratched his head embarrassedly. “I never thought that she was actually this kind of lady. Back then when that woman rushed up, I even spoke up for her.”</p><br/><p>Aiy, this Big Brother Yu of hers was so naive. The only reason Nangong Yan had caused such a fuss here was because she was planning to drag her down.</p><br/><p>Did Big Brother Yu really think Nangong Yan was trying to get justice?</p><br/><p>It must be known that if Yu Fenger, Nangong Yan, and the others hadn’t talked about this matter, no one would have known.</p><br/><p>In the end, Nangong Yan had been too self-confident and thought she had obtained dirty information on Tang Doudou that she could use. She had only harmed herself in trying to harm another, so she deserved this outcome.</p><br/><p>Of course, this was all thanks to Jun Xin. If it weren’t for him, Nangong Yan probably would have succeeded in her plan.</p><br/><p>And she would have been in Nangong Yan’s place right now.</p><br/><p>“I never thought she was actually like this either. I thought she was a very cute little sister.” When Tang Doudou recalled how she had saved Nangong Yan back then only to be stabbed, she could only sigh.</p><br/><p>__________</p><br/>\n</div>"}