{"title": "Chapter 234.2: Seriously Ugly", "id": 234, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2342-seriously-ugly", "volume_title": "Volume 3", "body": "<h1>Chapter 234.2: Seriously Ugly</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Once she made the appropriate preparations, the next day, Tang Doudou woke up early in the morning and started getting ready while Qing Yu worriedly urged her to hurry. She hastily washed up, then shoved the book into her clothes and followed the line of people out of Propitious Clouds Inn.</p><br/><p>She hadn’t known how many people Baili Yu had brought here so now that they all came out, she felt a little torn between laughing and crying. Had Baili Yu moved his entire family here?</p><br/><p>And this was even after the group with luggage left yesterday!</p><br/><p>Tang Doudou glanced over the scene and saw there were about a hundred guards and about twenty to thirty maids and servant girls. Then she spotted Meng Yu in the group.</p><br/><p>No wonder she had felt that the food tasted familiar. So it turned out that they had been cooked by Meng Yu!</p><br/><p>She was about to go over to say hello when a faint fragrance came from behind her and a moment later, she was encircled by a warm, large embrace. A familiar, languid voice drifted into her ear. “Wife, did you sleep well last night?”</p><br/><p>“Oh, pretty well!” She looked up at him, puzzled. Why did he suddenly ask about this?</p><br/><p>Upon sensing her gaze, Baili Yu looked down and gently rubbed his chin against her forehead. “It’s good that you’ve slept well. Let’s go.”</p><br/><p>After he finished speaking, he wrapped his arm lightly around her waist and started walking towards the carriage that was stopped outside the inn.</p><br/><p>Tang Doudou only noticed when they got to the carriage that Jun Xin, who had said that they wouldn’t be going together, was currently sitting outside the carriage with his legs crossed.</p><br/><p>It was clear that he had lied again yesterday.</p><br/><p>“Go ahead and get on.” While she was spacing out, Baili Yu patted her shoulder and had her get on first.</p><br/><p>“Then what about you?” He wasn’t going to go with her? Tang Doudou was a little surprised.</p><br/><p>Baili Yu flicked the tip of her nose, then leaned over and softly kissed her cheek. “For the sake of protecting your pure reputation, this husband can only force himself to endure the pain of parting with Wife for half a day.”</p><br/><p>Tang Doudou blushed slightly. There were so many people around! Didn’t he say that he was taking into consideration her pure reputation!? It was seriously too scary! It was a good thing that there were two carriages because if there had only been one… She didn’t dare to continue thinking along those lines and hastily pushed Baili Yu aside to climb onto the carriage.</p><br/><p>However, because the carriage was too high, she couldn’t get on even after several attempts. Just as she was pouting and getting annoyed, a hand stretched out towards her from above, accompanied by an impatient voice, “You’re seriously stupid. Hurry and get on!”</p><br/><p>Tang Doudou silently cursed and was just about to put her hand in his when her body suddenly lifted into the air. By the time she came back to her senses, she had already gotten into the carriage.</p><br/><p>“Wife, be good, alright? This husband will come keep Wife company as soon as we leave the city.” Baili Yu’s eyes were smiling but also filled with silent warning as he glanced towards her hand.</p><br/><p>The meaning was very clear: Don’t get so close to other men or he’d get angry!</p><br/><p>Seriously, jealous men shouldn’t be provoked!</p><br/><p>She glanced over to look at the little brat and softly grumbled, “Petty.”</p><br/><p>Upon hearing this, Baili Yu narrowed his eyes and glanced towards Jun Xin meaningfully. “Ah Xin, why don’t you switch with Feng Long and ride in my carriage after all?”</p><br/><p>Jun Xin immediately pushed Tang Doudou into the carriage and replied coldly, “No need!”</p><br/><p>Then he swung the whip in his hand to drive the horse forward. Tang Doudou, who was inside the carriage, had just gotten up from the floor dizzily but was thrown right back down again by inertia. As she lay flat on the floor, she felt like the buns in front of her chest had been completely squashed and fiery pain transmitted from them. She really wanted to head out and kick the brat outside flying.</p><br/><p>The carriage had rushed grandly out of Cloud City. Tang Doudou lifted the carriage curtain and turned to look towards the city gates. She was a little disappointed that Su Yi didn’t come to see her off.</p><br/><p>However, it occurred to her that he might be busy investigating the assassins, so she simply sighed. She was about to let down the curtain and head back into the carriage when Jun Xin glanced at her and grabbed her by her clothing. “Look towards the city gate tower.”</p><br/><p>Although Tang Doudou didn’t know why he said that, she still looked behind them again. She could barely make out the figure on the tower, but she still recognized Su Yi with one glance.</p><br/><p>Seeming to sense her gaze, Su Yi waved towards her. Tang Doudou couldn’t see his expression, but her nose still stung and she felt about to cry.</p><br/><p>“It’s not like you guys are parting forever, don’t weep endlessly. You’ll get even uglier.” Jun Xin pulled her back with a disdainful expression on his face. “Are you trying to commit suicide, to lean that far out?”</p><br/><p>“As if it’s that easy to fall down. It’s not like I’m dumb, I know to hold on!” Jun Xin was seriously too hateful. If he was going to be this way, then he shouldn’t have told her where Su Yi was!</p><br/><p>When she looked back again, Su Yi was already gone.</p><br/><p>She sat down, disappointed. “I don’t even know when we’ll meet again.”</p><br/><p>Jun Xin laughed, then rubbed her hair. “Don’t make such a miserable face, it’s seriously ugly.”</p><br/><p>“It’s not like I’m asking you to look!” Tang Doudou was in a very bad mood and hit his hand aside hard. “I want some space, don’t bother me!”</p><br/><p>“Tang Doudou,” called Jun Xin.</p><br/><p>“What?”</p><br/><p>Jun Xin’s eyes flickered slightly and he spoke his sincere words in a joking manner, “When you get married, remember to invite me to the feast.”</p><br/><p>Why did he suddenly bring this up all of a sudden?</p><br/><p>Tang Doudou rubbed her chin. “What if I don’t invite you? What would you do?”</p><br/><p>__________</p><br/>\n</div>"}