{"title": "Chapter 233.2: Blade Demon Feng Long", "id": 233, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2332-blade-demon-feng-long", "volume_title": "Volume 3", "body": "<h1>Chapter 233.2: Blade Demon Feng Long</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Jun Xin saw her head over, he immediately slapped that hand away and prepared to walk over to put an arm over her shoulder, but that person grabbed onto his clothing and cried, “Ah Xin, don’t go ah!”</p><br/><p>That tone was plaintive as if Jun Xin was about to abandon him. Even Tang Doudou felt heartache for him upon hearing it. She shot Jun Xin a glare, then asked with a smile, “This one is?”</p><br/><p>“Feng Long, Baili Yu’s subordinate.” Jun Xin slapped away Feng Long’s hand again. He was very depressed due to Tang Doudou’s glare.</p><br/><p>It was all Feng Long’s fault!</p><br/><p>Feng Long?</p><br/><p>Tang Doudou remembered now. Xiao Bai had told her once that Baili Yu had three strong experts under his command: Blood Fiend Jun Xin, Blade Demon Feng Long, and Godspeed Yun Hai.</p><br/><p>These three people pretty much shouldered the burden of all of Baili Yu’s biggest secrets. There was no need to explain about Jun Xin much. Even if always refused to acknowledge it, he was Baili Yu’s junior brother. Moreover, his identities as a Saint Envoy of the Saint Tribes and the Hall Master of God Firmament Hall were enough to stun the world if they were revealed.</p><br/><p>Hence, the other two who share titles with him, Blade Demon Feng Long and Godspeed Yun Hai, probably weren’t simple characters either.</p><br/><p>“So it was Blade Demon Feng Long. I’ve been looking forward to meeting your distinguished self for a long time. Now that I’ve finally had to opportunity to meet you, as expected, you are out of the ordinary. I’m Li Xueyi, nice to meet you. Please take care of me in the future.” Tang Doudou was conflicted for a moment over how to act but in the end decided to emphasize friendliness!</p><br/><p>Although the person was Baili Yu’s subordinate, based on Jun Xin as a damned precedent, it was better to err on the side of safety. After all, Jun Xin didn’t seem to have the consciousness of a subordinate at all. He had even once sent people to entrap and kill Baili Yu in Azure Water Valley!</p><br/><p>Since even Jun Xin, who looked completely harmless, could be so ruthless, the fact that Feng Long had such strangely bewitching eyes probably meant he could be even more ruthless than Jun Xin. It was best for her to humble herself a little. The proverbs put it well, one couldn’t verty well reach out and slap a smiling person. She had flattered him so enthusiastically, so Feng Long should have a good impression of her!</p><br/><p>Things like first impressions are too freaking important!</p><br/><p>Unexpectedly, Feng Long greeted her respectfully in a tone that had no emotion. “Feng Long greets Madam.”</p><br/><p>The word ‘madam’ made Tang Doudou feel completely awkward. She scratched her head, not sure how to respond.</p><br/><p>“Your distinguished self? Stinkin’ woman, how come I never knew that you could be so fake?” However, right at this moment Jun Xin tried to rap her on the forehead. Luckily she had been prepared for it and blocked him in time.</p><br/><p>See? This demonstrated the importance of a first impression. If she hadn’t met Jun Xin while pilfering food back then, how could he possibly dare to treat her so casually?</p><br/><p>When her thoughts got to this point, she glowered at him and said, “Butt-aged brat! This big sis dares you to try that again!?”</p><br/><p>“Tch, if I did it just because you told me to, would I be losing face?” Jun Xin crossed his arms and slanted an unruffled glance at her. His completely unbridled attitude was practically about to drive her crazy.</p><br/><p>Moreover, it seemed that she had once said something like this before.</p><br/><p>When she realized this, she became even more annoyed.</p><br/><p>“So you’re admitting that you’re a butt-aged brat?” She looked towards Jun Xin gleefully. Lil’ brat, you’re still a little too inexperienced to try and fight with her.</p><br/><p>Jun Xin realized that he had fallen into her trap and his expression changed a little. Then he lifted his chin up arrogantly and humphed. “This young master won’t lower himself to bicker with a woman.”</p><br/><p>Tang Doudou rolled her eyes, enlightened on how thick his skin was.</p><br/><p>On the other hand, that Feng Long had been staring at the two silently as they were talking. When the fact that he called her ‘madam’ earlier was added on, she felt uncomfortable all over. She couldn’t help but feel that Feng Long was seriously weird.</p><br/><p>And this rotten brat Jun Xin as well! Why did he have to introduce a strange person like this to her?</p><br/><p>Could it be that he was trying to mess with her again?</p><br/><p>“Lady Doudou, why are you still here?” Just as the atmosphere was gradually getting a little strange, Qing Yu ran over. She seemed very flustered.</p><br/><p>Tang Doudou shot a puzzled glance towards Jun Xin and saw that he looked confused as well, so she pulled Qing Yu and asked, “What is it?”</p><br/><p>Qing Yu opened her mouth, but then she realized that Feng Long was here and hastily greeted him. “Young Master Feng.”</p><br/><p>Qing Yu only turned to speak to Tang Doudou after Feng Long responded with a slight smile. “Master was looking all over for Lady but couldn’t find you. Right now he’s in the inn and very angry.”</p><br/><p>Tang Doudou was surprised. Hadn’t she been standing outside the inn this entire time?</p><br/><p>__________</p><br/>\n</div>"}