{"title": "Chapter 248.2: Skin Cage Grub", "id": 248, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2482-skin-cage-grub", "volume_title": "Volume 3", "body": "<h1>Chapter 248.2: Skin Cage Grub</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After leaving the prison, Jun Xin stretched his waist. Then, out of the corner of his eyes, he spotted Feng Long who was staring at him without blinking.</p><br/><p>“Are you pretending to be a ghost? With how you look, you’d be able to scare a person dead just by standing outside their window, so is there any need to go through this much trouble?”</p><br/><p>Feng Long licked her lips as an unreadable expression briefly flashed through her strange eyes. She remarked softy, “I’ve stood outside your window for so many years, so how come you still haven’t died from the shock?”</p><br/><p>“Tch, who do you think this little master is? Even real ghosts die by my hand, so how could I possibly be afraid of a fake ghost like you?” Jun Xin expressed his disdain.</p><br/><p>Feng Long smiled. “You’re planning on letting her stay like this?”</p><br/><p>“Something’s a little off.” As Jun Xin spoke, he pulled out that bead and showed it to Feng Long. “Guess who this belongs to?”</p><br/><p>“Who?” As Feng Long spoke, she took that bead and examined it. She soon noticed the word inside. Her eyes were different from those of normal people and she was able to see the word with one glance. She immediately realized what it was about and almost cried out in shock.</p><br/><p>Luckily, she wasn’t a normal person and was able to quickly suppress her shock. Then she asked in a low voice, “The scope of this matter was actually that broad?”</p><br/><p>“From the looks of it, it wasn’t as simple as we thought. Go bring this to Baili Yu and let him decide for himself.” Jun Xin let go of the cord and the bead fell into Feng Long’s palm. “I only left her an hour to make her decision. If he doesn’t reply within an hour, I’ll be using the grub on Qing Moran.”</p><br/><p>After Jun Xin finished speaking, he sat down in the hidden guards’ resting area and took off his mask to rub his eyes.</p><br/><p>The hazy light was bright enough to light up his perfect features. It had only been a year since they last saw each other, but his looks were much more mature and his features had become even more solid.</p><br/><p>A trace of a smile appeared on Feng Long’s lips and her eyes sparkled. Jun Xin, you’ll belong to me sooner or later.</p><br/><p>Even if your heart currently harbors someone else.</p><br/><p>Since, what does it matter?</p><br/><p>Following that, she went off to find Baili Yu. She got to the location Jun Xin had told her but she didn’t see Baili Yu anywhere. After a brief moment of thought, she concluded that he had probably gone to climb onto a certain person’s bed again.</p><br/><p>She was just about to head to a particular window when she saw a black figure move past out of the corner of her eye.</p><br/><p>Who was it?</p><br/><p>Feng Long looked back in alarm as her body smoothly moved backwards. Suddenly, her brows furrowed and she abruptly turned around to shoot a blade from her eye. There was only a single ‘clank,’ then there was no more sound.</p><br/><p>She turned around but still didn’t see anyone.</p><br/><p>The person’s martial arts was better than hers. From the looks of it, it wouldn’t be easy to deal with him.</p><br/><p>After just a brief probe, Feng Long had been able to analyze that person’s strength. He was stronger than her, and it wasn’t just by a little either.</p><br/><p>It seemed like she had no choice but to alert Master.</p><br/><p>As she was thinking this, she shot another blade from her eyes towards that window. However, before it could cut through the window, a jade-like hand reached out from inside and flicked it away. Following that, with a flash, a figure dressed in crimson red appeared in the night.</p><br/><p>At the instant he appeared, the sky filled with countless flower petals. He didn’t move at all, but several muffled groans came from the darkness.</p><br/><p>Feng Long looked over, following the sound, but saw no survivors.</p><br/><p>When she returned to that side, she saw Baili Yu lift his hand. The countless petals immediately gathered at the tip of his finger and turned into an enormous Chinese dragon that faced ahead.</p><br/><p>__________</p><br/>\n</div>"}