{"title": "Chapter 258.2: Mu Ye’s Killing Intent", "id": 258, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2582-mu-ye%E2%80%99s-killing-intent", "volume_title": "Volume 3", "body": "<h1>Chapter 258.2: Mu Ye’s Killing Intent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>She hastily turned around and saw that Mu Ye was holding his sword with murderous intent and walking step by step towards Nangong Yan who had fallen onto the ground.</p><br/><p>Nangong Yan had such bad luck, to knock into Mu Ye out of everyone!</p><br/><p>Tang Doudou observed a moment of silence for Nangong Yan. She recalled when Mu Ye was trying to kill her in Rutaceae Pavilion. That situation had been so scary it felt like her guts had been destroyed.</p><br/><p>“You- what are you doing!?” Nangong Yan who was originally still shouting haughtily became scared when she saw the emotionless killing intent in Mu Ye’s eyes. She had been raised in an environment that completely pampered her, so no one had ever dared to look at her this way before.</p><br/><p>“Stay away! Stay away! I-, I’ll drop this matter already!” Even in the face of danger her tone didn’t get any humbler. It was just that the fear coming from her very bones made her continuously retreat.</p><br/><p>Mu Ye has always had a cold temperament and was of few words. If it wasn’t someone he knew, he wouldn’t speak to them at all.</p><br/><p>Moreover, he had already decided to kill Nangong Yan. However, he didn’t directly rush up to take her life but took his time walking towards her. His steady steps sounded like the footsteps of the King of Hell; each soft thump seemed to make Nangong Yan’s heart jump.</p><br/><p>The corridor was only so long and their rooms were the innermost ones, so Nangong Yan hadn’t been able to retreat for long before she hit the cold wall.</p><br/><p>There was nowhere to retreat.</p><br/><p>Could it be that Mu Ye was actually going to kill Nangong Yan? Or was he just scaring her a little? After all, there were no past conflicts between the two. Even though she hated Nangong Yan to death, this had nothing to do with Mu Ye.</p><br/><p>However, Mu Ye seemed to know about the injury on her stomach. Since that was the case, did he also know that it was due to Nangong Yan?</p><br/><p>So right now, he was trying to get revenge for her?</p><br/><p>“You… you can’t kill me! There’s a decree in Saint City! Private armed confrontations and taking of lives are not allowed! You… If you kill me! You won’t be able to escape either!” Nangong Yan’s fearful voice came again front that side.</p><br/><p>Tang Doudou snapped out of her thoughts and looked over.</p><br/><p>Mu Ye was currently only a few steps away from Nangong Yan and towered over her as the sword in his hand emitted a faint cold light.</p><br/><p>She then noticed that hardly anyone in the inn was paying attention to this matter. Perhaps they felt that Nangong Yan had brought it on herself. The people staying here were probably already tired of her, or perhaps they didn’t want to attract trouble to themselves and risk having their identities revealed.</p><br/><p>In any case, they were the only three in the corridor.</p><br/><p>However, she could see a black shadow behind the door of the room Murong Ming was staying in. It was doubtlessly Murong Ming. Although he probably kept it hidden from Wind Cloud Island that he brought Nangong Yan here, Liu Zhiyuan still knew!</p><br/><p>Could it be that Murong Ming wasn’t worried that Liu Zhiyuan would report to the Master of Wind Cloud Island what happened after Nangong Yan was killed? There was no way his Murong family could survive facing Wind Cloud Island’s fury.</p><br/><p>“Ah Yuan! Ah Yuan! Where the hell are you!? Hurry and save me!” When Nangong Yan saw that Mu Ye was continuing to approach despite her threats, she was so scared she started crying for Liu Zhiyuan.</p><br/><p>Tang Doudou looked around but didn’t see any black-clothed people move. From the looks of it, Nangong Yan hadn’t been able to find Liu Zhiyuan yesterday.</p><br/><p>Then, could it be that Nangong Yan was done for?</p><br/><p>Tang Doudou knitted her brows. It didn’t feel very likely.</p><br/><p>As expected, just as Nangong Yan was screaming Liu Zhiyuan’s name like crazy and Mu Ye had clutched her neck, a blade suddenly appeared behind Mu Ye and flew towards his head.</p><br/><p>Tang Doudou was so alarmed, her heart practically leapt to her throat and she hastily shouted, “Mu Ye, be careful!”</p><br/><p>Mu Ye had abruptly turned around before Tang Doudou even shouted and shoved Nangong Yan in front of him as a shield. Liu Zhiyuan’s sword froze right before it touched Nangong Yan’s chest, then he forcefully retrieved it.</p><br/><p>A line of blood appeared from empty air, then Liu Zhiyuan slowly became visible.</p><br/><p>At this point, Nangong Yan had already fainted from fear.</p><br/><p>Mu Ye threw her aside like he was tossing an old rag as he kept his cold gaze on Liu Zhiyuan.</p><br/><p>Li Zhiyuan said, “I already know who you are. It’s not a good idea to attract trouble just to kill her.”</p><br/><p>Mu Ye lifted his hand. The blade in his hand glinted coldly as he prepared to attack again.</p><br/><p>Tang Doudou shouted, “Don’t!”</p><br/><p>Then she silently rebuked herself for having stupidly shouted Mu Ye’s name. As of now, even if he didn’t kill Nangong Yan and Liu Zhiyuan, he’d probably be targeted. However, if he killed them, he’d have to face the Wind Cloud Island’s fury!</p><br/><p>Most importantly, if they really killed someone, their identities would immediately be revealed.</p><br/><p>She’d eventually settle the score with Nangong Yan, but right now wasn’t the right time. In addition, Mu Ye was the person she didn’t want to cause trouble for the most.</p><br/><p>Upon hearing what she said, Mu Ye glanced over at her. Then he looked at Liu Zhiyuan coldly before putting his sword away and walking towards her.</p><br/><p>If he had been alone just then, he would have already killed Nangong Yan.</p><br/><p>“Let’s go.” He reached Tang Doudou but his eyes were still cold.</p><br/><p>Tang Doudou didn’t look at Liu Zhiyuan and Nangong Yan anymore. Nodding, she walked out of the inn with Mu Ye.</p><br/><p>Once they left the inn, Tang Doudou asked worriedly, “What do we do now?”</p><br/><p>“It’s fine.”</p><br/><p>“But everyone now knows that you’re the famous Mu Ye…” If they continued staying at the inn, there’d probably be people showing up to look for trouble.</p><br/><p>“Armed combat isn’t allowed in Saint City. They can’t either.” Mu Ye suddenly looked towards her with probing in his cold eyes. “Why didn’t you let me kill her?”</p><br/><p>Could it be that it didn’t occur to him? Tang Doudou found it a little strange that Mu Ye would ask such a childish question. Those things had occurred even to a person as dumb as her.</p><br/><p>Although this was what she was thinking, she still told Mu Ye about everything she considered earlier.</p><br/><p>After she finished speaking, she seemed to see a hint of a smile flashed through Mu Ye’s cold eyes. His expression turned gentler as his soft voice came from the black robe. “Silly.”</p><br/><p>Then he actually reached out and rubbed her head the way Jun Xin often did. A gentle warmth came from his large broad hand, but currently Tang Doudou’s head was completely blank.</p><br/><p>By the time she came back to her senses, she found that there were black-robed people all around and that Mu Ye had disappeared!</p><br/><p>She couldn’t help but want to cry. Why did these people love to suddenly disappear so much!?</p><br/><p>__________</p><br/>\n</div>"}