{"title": "Chapter 266.1: Seeking Death", "id": 266, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2661-seeking-death", "volume_title": "Volume 3", "body": "<h1>Chapter 266.1: Seeking Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Baili Yu was currently very angry. He had only entrusted Tang Doudou to Lan Jia without worries because Lan Jia told him that Shen Moru hadn’t come back to Saint City. However, just then he had sensed the ripple of cold energy caused by Mu Ye’s ice demon martial arts. He knew right away that something had happened.</p><br/><p>He immediately rushed towards that direction without paying any more attention to Nangong Yan. From a distance away, he could already see that there were a lot of black-robed figures here. He saw that Mu Ye was currently occupied with fighting Shen Moru, but couldn’t see Tang Doudou anywhere.</p><br/><p>He was worried that it would be too late if he delayed any longer, so he immediately used Three Thousand Overlooking Blossoms to kill the group of black-clothed men. The black-clothed men fell one after another, but he still didn’t see Tang Doudou anywhere.</p><br/><p>He looked around nervously for Tang Doudou, but due to the fact that there were black-clothed men everywhere, he couldn’t find her. His worst fear was that he would accidentally injure her.</p><br/><p>Suddenly, he sensed a strange gaze on him and abruptly turned around. Shen Moru had managed to get away from Mu Ye and his black smoke-like body quickly moved towards a certain location. When his body once again condensed, he was already behind Tang Doudou who was kneeling in the middle of countless corpses.</p><br/><p>His withered claw-like fingers were pressed against Tang Doudou’s neck.</p><br/><p>“Stop now or I’ll kill her!” Shen Moru shouted at Mu Ye, but his gaze once again landed on Baili Yu. “Ha. You’ve come as well.”</p><br/><p>Mu Ye made to fly over when he saw that Shen Moru had caught Tang Doudou, so Shen Moru tightened his grasp a little. Tang Doudou’s face immediately turned pale in response. “If you want her to die here, then you can try taking another step forward.”</p><br/><p>Mu Ye abruptly came to a halt. His cold gaze swept across Baili Yu’s face and his tightly pressed together lips moved a little bit, but he didn’t say anything.</p><br/><p>Baili Yu pulled off his black robe to reveal his garments that was as red as blood. The hems of his crimson garments lifted in the wind along with his black hair. His tone was even colder Mu Ye’s eyes. “Shen Moru, you’re seeking death!”</p><br/><p>“Baili gongzi really has such an impressive aura!” Shen Moru wasn’t afraid. His empty pupils were filled with resentment. “I acknowledge the fact that you’re really strong. As of now, it’s probably hard to find anyone in this world that can be your match. However, you shouldn’t forget where you are right now! Will you be able to endure the consequences of your identity becoming revealed!?”</p><br/><p>Baili Yu’s eyes were like frost and a trace of a cold smile was on his lips. “Shen Moru, do you think that I would return to Cerulean Mountain if I wasn’t completely confident of making it out unscathed?”</p><br/><p>Fear flashed across Shen Moru’s face. “Could it be that you’ve already found that item?”</p><br/><p>“Whether I’ve found it or not, you don’t have the right to know.”</p><br/><p>“Even if you have, even if you’ve already become the Saint Emperor, so what? You still wouldn’t be able to save this woman! Baili Yu, with your cautious personality and skill in schemes, you probably never thought that there’d be a day you’d have to watch the woman you love die in front of you, right?” Shen Moru laughed coldly. He then abruptly pulled off Tang Doudou’s black robe and lifted her chin as if he wanted to give Baili Yu a better look.</p><br/><p>“See, she actually hates you, because she already saw what happened between you and that woman earlier. You probably thought you had done everything covertly enough, right? But the truth was, she was also there.”</p><br/><p>Baili Yu furrowed his brows slightly. Was ‘that woman’ referring to Nangong Yan?</p><br/><p>Suddenly, he recalled that figure. Understanding flashed through his eyes. That had been her?</p><br/><p>“Haha, you probably want to explain yourself, don’t you? But apologies ah! When I caught her earlier, I already sealed all her senses. Right now, she can’t hear or see anything. She’s trapped in a pitch-black world to wallow in her hatred and resentment… In the end, she’ll die without knowing why while hating you!”</p><br/><p>“Shen Moru!” Baili Yu shouted in rage as he lifted his hand and sent something harsh red flying towards Shen Moru.</p><br/><p>Shen Moru didn’t try to dodge and just looked at him coldly.</p><br/><p>Just as that trace of red was about to hit him, he shifted Tang Doudou in front of himself and laughed loudly. “Nice ah! It really is wonderful! I’ll undo the seal on her senses right now! I’d like to see the expression on her face when she finds out that you were the one that killed her! I’m really looking forward to it!”</p><br/><p>The rage in Baili Yu’s eyes flickered. His finger moved slightly and that red item immediately veered to the side to stab into a corpse next to Shen Moru. He spat out one word coldly, “Despicable!”</p><br/><p>“That’s right, I am despicable! But so what? It’s even worth it to die now since I got to corner the prestigious Baili Yu this badly!” As Shen Moru spoke, he reached out to stroke Tang Doudou’s face. His tone was dark and sinister as he continued, “Moreover, I have such a beauty to accompany me to my grave. It’s worth it! It truly is worth it!”</p><br/><p>Baili Yu’s gaze darkened. Shen Moru must die!</p><br/><p>However, Tang Doudou was currently in his hands. Based on how vicious his personality was, he was probably serious about taking Tang Doudou with him to the grave.</p><br/><p>This person could no longer count as human anymore.</p><br/><p>Baili Yu retrieved the Blood Satan blade and said slowly, “Shen Moru, you’re capturing her for her poison blood, aren’t you? But compared to the poison blood from Disseminating Tassel Fragrance, you’d probably find the poison blood from Hoarfrost Poison more interesting.”</p><br/><p>“Hoarfrost Poison?” Surprise appeared in Shen Moru’s eyes. “How do you know about that?”</p><br/><p>“Because I possess it.” Baili Yu looked at Shen Moru indifferently. “Satisfied with this?”</p><br/><p>“You! You’re! You…” Shen Moru was extremely stirred up. Even the hand clutching Tang Doudou’s neck was shaking.</p><br/><p>When Mu Ye heard the words ‘Hoarfrost Poison,’ he glanced at Baili Yu. There were no emotions visible in his eyes, but the iron chain in his hand was already starting to approach Shen Moru soundlessly like a snake.</p><br/><p>Baili Yu’s expression didn’t change either. His skin that has always looked as beautiful as jade complemented by his red robes was starting to glow. “What? You never thought of this, right? It never occured to you that I was still alive, much less that I’m the child from back then.”</p><br/><p>__________</p><br/>\n</div>"}