{"title": "Chapter 268.2: Human or Ghost", "id": 268, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2682-human-or-ghost", "volume_title": "Volume 3", "body": "<h1>Chapter 268.2: Human or Ghost</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This area was strange so Tang Doudou stayed on high alert. She snapped off a tree branch that was about the thickness of three fingers before slowly approaching that side. The forest of brambles was very dense and the thorns were very sharp. Tang Doudou only managed to advance a few steps before was no longer able to proceed. She could only try channeling her inner strength into her palm and then onto the branch. When she saw that the tree branch started to glow with red light, joy lit up her face. So it wasn’t anything hard!</p><br/><p>Then she swung the branch towards the brambles. The faint red light was like the sharp light of a blade. The brambles surrounding her were instantly cut apart and opened up a narrow path for her to squeeze through.</p><br/><p>Tang Doudou then put away her inner strength. She didn’t know what laid ahead so the more inner strength she could preserve, the better.</p><br/><p>She passed through that narrow path. Once she got out of the forest of brambles, she suddenly slipped and almost fell off the cliff.</p><br/><p>She hastily steadied herself. Why would there be such a steep cliff in this valley?</p><br/><p>When she saw that there were waves of ocean water beneath the cliff, she realized that she had come to the edge of Cerulean Mountain, the place where it met the sea!</p><br/><p>She carefully moved her legs back before looking down again and glancing around. There was no mistake! This was where the ‘zhizhi’ sound had come from. However, why was it a cliff!?</p><br/><p>How could Lil’ Gray be on a cliff? There wasn’t even a place to stand here!</p><br/><p>Tang Doudou rolled her eyes. It couldn’t be that she had been hallucinating?</p><br/><p>She couldn’t see Lil’ Gray and that ‘zhizhi’ sound had also disappeared, so she could only turn around and head back. Suddenly, she noticed a movement out of the corner of her eye. When she looked to the left, she saw that there was a black shadow.</p><br/><p>What was that?</p><br/><p>The sky was too dark so Tang Doudou could only see a vague outline. It seemed like… it seemed to be a person!</p><br/><p>“Hey? Are you dead or alive ah?” Tang Doudou shouted towards in that direction.</p><br/><p>The appearance of a person stuck in the brambles next to a cliff caused Tang Doudou’s hair to rise on end from the creepiness. A thought suddenly occurred to her. It couldn’t be a ghost right?</p><br/><p>Right after that thought emerged, that unidentified figure suddenly moved.</p><br/><p>The area that looked to be its back or its abdomen bulged up and started squirming. Tang Doudou was so frightened her heart almost jumped out of her throat!</p><br/><p>What the hell was that!?</p><br/><p>Tang Doudou now regretted her actions. She itched to just slap herself for doing something so brainless out of curiosity. Now it was just great! She ended up encounter this strange thing… It won’t do, she had better run while that thing was still stuck.</p><br/><p>She turned to go back through the narrow path she had made.</p><br/><p>However, just as she was about to walk through the brambles, she heard the ‘zhizhi’ sound again. This time it was very close so she was certain it was Lil’ Gray. However, when she recalled the thing that was moving around on top of that black figure, it occurred to her that this might be that thing’s doing so it was best to be careful.</p><br/><p>As she thought about this, she poured her inner strength into the tree branch again and then slowly crouched down in the forest of brambles.</p><br/><p>She started at the black figure outside without blinking as she muttered to herself, “If it really was Lil’ Gray, then would that black figure be…”</p><br/><p>When her thoughts reached this point, she became very worried and couldn’t be bothered to care whether that thing was a monster or not. She waved the branch and started walking forwards quietly.</p><br/><p>Just as she was getting close, a gray figure suddenly dug its way out from the black figure’s back. It was Lil’ Gray.</p><br/><p>The moment he got out, he jumped towards Tang Doudou, then started crying something while gesturing frantically.</p><br/><p>In reality, he didn’t need to do this for Tang Doudou to figure out who was hanging over there. It was definitely Mu Ye.</p><br/><p>She tried to sooth Lil’ Gray by saying, “Don’t worry, I know it’s him. You stay here alright? I’ll go get him down.”</p><br/><p>After she said that, she placed Lil’ Gray on the ground and carefully moved to approach Mu Ye.</p><br/><p>The area where he was hanging was extremely dangerous. It was right below the cliff. A few outgrowing branches of bramble had caught him, but it seemed like a gust of wind was enough to sweep him off. It was seriously a dangerous situation.</p><br/><p>Tang Doudou was already standing on the edge of the cliff but still couldn’t quite reach Mu Ye. The sun had already set so it was too dark to see clearly. She didn’t dare to move rashly in fear of accidentally causing Mu Ye to fall all the way to the bottom of the cliff.</p><br/><p>She started panicking since these brambles probably wouldn’t be able to support Mu Ye for much longer. This area was next to the sea so a gust of sea wind would likely blow him off as well.</p><br/><p>“What do I do? What can I do!?” Tang Doudou paced back and forth anxiously along the edge of the cliff and tried to calm down in order to think of a good idea. Then she considered how Mu Ye would save her if she had been the one hanging off the edge.</p><br/><p>The iron chain!</p><br/><p>Mu Ye’s iron chain! He’d definitely grab her with that and then pull her back up.</p><br/><p>When her thoughts reached this point, she became depressed again. Mu Ye had an iron chain, but she didn’t!</p><br/><p>Lil’ Gray seemed to sense her anxiety as he jumped out and pointed towards her head.</p><br/><p>Tang Doudou was too anxious to pay attention to Lil’ Gray, but then she recalled how smart he was and it occurred to her that he might be trying to tell her what to do.</p><br/><p>When her thoughts reached this point, she looked over in the direction Lil’ Gray was pointing. Joy immediately lit up her face. “Lil’ Gray, you’re a genius!”</p><br/><p>After she finished speaking, she started talking off her clothes and ripping them apart. Then she started linking them together to make a rope.</p><br/><p>She only stopped when all she had left was her inner garments. She tugged on the rope to see how strong it was, then leaped up to the tree branch above her.</p><br/><p>The thing Lil’ Gray had pointed at earlier was this tree branch. She tied one end of the rope on this branch and then tied the other end around her waist before slowly heading down the cliff.</p><br/><p>__________</p><br/>\n</div>"}