{"title": "Chapter 267.2: Where Did She Go?", "id": 267, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2672-where-did-she-go", "volume_title": "Volume 3", "body": "<h1>Chapter 267.2: Where Did She Go?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Although Shen Moru’s neck was being choked, he was still able to speak. “Tang Doudou ah, Tang Doudou. If I die, you’ll never be able to obtain those secrets again!”</p><br/><p>“Don’t you want to know who exactly you are?”</p><br/><p>“Don’t you want to know why you got poisoned with the Disseminating Tassel Fragrance, and why you suddenly disappeared?”</p><br/><p>“And why you would become like you currently are now?”</p><br/><p>“And there’s Baili Yu, aren’t you worried about his Hoarfrost Poison?”</p><br/><p>There was no change in Tang Doudou’s expression, but she stopped tightening her hands. Her ice blue eyes swept over him indifferently before becoming filled with strong bloodthirst. “You talk too much!”</p><br/><p>Shen Moru coughed out a mouthful of black blood. “As expected of a child of the Xuanyuan tribe, the reputation is not in vain!”</p><br/><p>Following that, he turned into black smoke before recondensing at a distant place.</p><br/><p>Tang Doudou charged over and crushed Shen Moru who still hadn’t fully condensed under her foot. “Die!”</p><br/><p>“Tang Doudou…” Just as she was increasing her strength to crush Shen Moru’s skull, a gentle voice suddenly appeared in her mind.</p><br/><p>“Who?” She looked around but couldn’t see anyone.</p><br/><p>“There’s no point in searching, you won’t be able to see me.”</p><br/><p>“What do you want?” Tang Doudou was very curious. Ever since she abruptly woke up earlier, the only voice she had been able to hear was Shen Moru’s. She hadn’t been able to hear or see anything else.</p><br/><p>So it was hard not to be curious about this voice that had suddenly appeared.</p><br/><p>“What I want? Won’t you know once you come take a look?” said that voice.</p><br/><p>“Where are you?” Tang Doudou took a step forward.</p><br/><p>“Walk towards the left, all the way forward…” That voice seemed to contain some sort of demonic compelling force. Although she didn’t want to go in the direction he gave, her legs started moving in that direction without her command.</p><br/><p>Shen Moru got up from the ground and watched Tang Doudou’s strange behavior with surprise in his eyes. A dagger appeared in his hand, but before he could act, a hand pressed against his shoulder. “Don’t move.”</p><br/><p>Shen Moru recognized this voice, so he didn’t turn around. “Aren’t you worried about getting retribution for doing this?”</p><br/><p>“You’re not afraid, so why should I fear it?”</p><br/><p>“What do you want?”</p><br/><p>“Why does everyone seem to like asking me this?” That person laughed lightly. “If you want to know, why don’t you just follow and see for yourself?”</p><br/><p>After he said this, Shen Moru started walking forward blankly just like Tang Doudou.</p><br/><p>Baili Yu was stunned to see the person that had suddenly appeared, but he didn’t pause to ask questions and made to chase after Tang Doudou.</p><br/><p>That person called out to him. “Brother Baili, please wait.”</p><br/><p>“We’ll talk when I get back!” Baili Yu glanced at him, uncertain of his intentions.</p><br/><p>“Mu gongzi can handle following Lady Doudou. Brother Baili had better come with me to a certain place!”</p><br/><p>Right after that person spoke, Mu Ye nodded towards Baili Yu and headed off.</p><br/><p>“Lan Jia, you’d best explain yourself.” Baili Yu turned around to face Lan Jia.</p><br/><p>Lan Jia chuckled, then pushed Shen Moru aside. His shallow eyes that seemed clear were currently unreadable. “Brother Baili, could it be that you don’t trust me anymore?”</p><br/><p>“Trust must be built on reality. Reality has shown that the clue about Yiling that you gave me was wrong. Nangong Yan definitely isn’t Yiling!” The moment Baili Yu recalled this matter, rage filled his eyes. That damned woman!</p><br/><p>Lan Jia seemed surprised. “She isn’t? However, the only female infant that was brought back to Cerulean Mountain was her.”</p><br/><p>Baili Yu was still worried about Tang Doudou so he didn’t want to waste time arguing about this. He turned to continue walking without replying.</p><br/><p>However, he only managed to take a few steps before he was hit with strong dizziness. His footing became unsteady and he crashed straight to the ground.</p><br/><p>“Lan Jia, you…” Before he even finished speaking, he fainted.</p><br/><p>Lan Jia walked to Baili Yu and crouched down. Reaching out, he stroked Baili Yu’s face as he remarked, “It sure isn’t easy to knock you out. It took almost eight people’s portions…”</p><br/><p>Meanwhile, Mu Ye was chasing after Tang Doudou and heading towards the edge of the Sacred Tree. The further they went, the more serious his expression became, because there was not a single person around and no visible roads. The only thing ahead of them was an extremely deep abyss with billowing black smoke.</p><br/><p>Mu Ye’s gaze swept around. Where did she go?</p><br/><p>The sky was still covered with crows so it was very dim and hard to see things. Mu Ye tried every single direction, and even questioned multiple people, but no one had seen Tang Doudou.</p><br/><p>He could only return to the edge of the Sacred Tree. As he gazed at the billowing black fog below him, his eyes flickered with hesitation. Could it be that she’s jumped into the Devil’s Depths?</p><br/><p>However, he didn’t dare to try confirming this guess, because there was no fate other than death for those who jump into the Devil’s Depths. Although she wasn’t conscious, she should still be very sensitive to danger due to her inner strength exploding. Devil’s Depths was surrounded by the black fog year round and filled with the scent of death. There was no way that she wouldn’t be able to notice this.</p><br/><p>But… If she hadn’t jumped into Devil’s Depths, where did she disappear to?</p><br/><p>Mu Ye looked at Devil’s Depths for a long time. Just as he prepared to descend a little to look for signs of her, he saw a trace of red out of the corner of his eyes.</p><br/><p>He hastily went over and picked up that red item. It was the red string Tang Doudou had used to hang Baili Yu’s thumb ring around her neck. It still contained the bound hair.</p><br/><p>Mu Ye abruptly looked towards Devil’s Depths, then jumped in without any more hesitation.</p><br/><p>__________</p><br/>\n</div>"}