{"title": "Chapter 283.2: How Was She Supposed to Consummate?", "id": 283, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2832-how-was-she-supposed-to-consummate", "volume_title": "Volume 3", "body": "<h1>Chapter 283.2: How Was She Supposed to Consummate?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Big evil spirit, you bastard! You said you wouldn’t die! What do I do now? What do I do?”</p><br/><p>As Tang Doudou cursed, she tried to wipe away those black lines with her hand, but the black lines were actually results of poison being inside his body, so how could she possibly wipe it off?</p><br/><p>As she wiped, tears spilled down. She also understood that this was a pointless attempt. She had to get the antidote to the Hoarfrost Poison now, or Baili Yu would die.</p><br/><p>But where was she supposed to find the antidote?</p><br/><p>Even though she was currently in the midst of the Seven Great Saint Tribes, she didn’t know who to look for to ask for an antidote. Lan Jia?</p><br/><p>That’s right, she’ll look for him! Tang Doudou couldn’t come up with any other ideas, so she settled Baili Yu down, then ran towards the door.</p><br/><p>She reached out to open the door, but despite tugging several times, she still couldn’t get it open. She tried a some more with no result. She had been locked in!</p><br/><p>Tang Doudou was furious. What was that bastard Lan Jia trying to do!?</p><br/><p>She fiercely kicked the door a couple times. Then there came the sound of Lan Jia’s amused voice, “Lady Doudou, could it be that you’re not happy with Brother Baili Yu? Why so angry?”</p><br/><p>He was actually outside!</p><br/><p>Tang Doudou’s anger rushed to her head and she shouted, “Lan Jia, you shameless bastard! What exactly did you do to Baili Yu!?”</p><br/><p>Lan Jia responded with surprise, “What does Lady Doudou mean? This one doesn’t understand?”</p><br/><p>“Quit acting! There’s no way that I’ll believe you if you say you don’t know why Baili Yu’s like this!”</p><br/><p>“Oh… since Lady Doudou has guessed it, then I won’t try to hide it any longer. I am indeed the one who made Brother Baili like this.” Lan Jia stopped trying to deny it.</p><br/><p>Tang Doudou said, “Say it. What do I have to do for you to turn him back to normal?”</p><br/><p>Lan Jia tsked and said with a tone of pity, “I’m afraid he won’t be able to go back to normal.”</p><br/><p>“Pei! I don’t believe you! Hurry up and tell me or I’ll burn this crappy place of yours down!”</p><br/><p>“Lady Doudou, please calm down. It’s not like it’s impossible, it’s just a bit troublesome.”</p><br/><p>“Hurry up and just say it!”</p><br/><p>Lan Jia seemed to have moved closer to the door. Then he said in a quiet voice, “Lady Doudou, actually, Brother Baili’s current condition can’t be blamed completely on me. It was the Saint King’s orders, so we as subordinates have no choice but to obey, right? However, Lady Doudou has misunderstood this one. Everything this one does is for you guys.”</p><br/><p>“Can you stop wasting time?”</p><br/><p>Lan Jia laughed. “This one just wants Lady Doudou to understand the situation more clearly.”</p><br/><p>Tang Doudou’s thoughts were currently filled with Baili Yu, so she had no patience for his ramblings. She urged him to hurry again, so Lan Jia finally continued, ”Originally, the Saint King had arranged for Brother Baili to marry the Saint Maiden, but I greatly admire the Saint Maiden, so how could I allow her to marry someone who has no feelings for her? That was why I came up with this plan to swap out the brides.”</p><br/><p>It was very difficult to distinguish between the truth and lies in his words. Even Baili Yu had been deceived by him for many years, so how could Tang Doudou possibly be able to see through his lies?</p><br/><p>She felt like his explanation was quite reasonable and started mumbling to herself in confusion. Could it be that she was wrong in blaming him?</p><br/><p>“Then what did you do with the Saint Maiden?”</p><br/><p>“Apologies, that, I can not tell you.”</p><br/><p>Tang Doudou wasn’t actually very interested in the location of the Saint Maiden and had only asked this in passing. Since he didn’t tell her, she moved on to asking about how to get Baili Yu back to normal.</p><br/><p>Lan Jia replied, “Actually, it’s quite simple. As long as Lady Doudou and Brother Baili consummates this marriage and destroys the Command Grub in his body, he’ll return to normal tomorrow morning.”</p><br/><p>“It’s that simple?” Tang Doudou wanted to slap herself the moment those words came out of her mouth. This was simple? The price was her chastity ah!</p><br/><p>Lan Jia also seemed to have been shocked by this remark. However, he soon returned to his senses and said, “Since Lady Doudou now knows the way, this one will be excusing himself in order to avoid disrupting you two…”</p><br/><p>When Tang Doudou saw that he was about to leave, she hastily called out, “Wait!”</p><br/><p>“Yes?”</p><br/><p>“Can you get me the clothes Baili Yu was wearing before?” Tang Doudou suddenly recalled that Baili Yu had always been carrying the booklet and tools to cure the Hoarfrost Poison with him.</p><br/><p>Lan Jia hesitated. “This… I’m afraid it’ll be a little difficult.”</p><br/><p>Upon hearing this, Tang Doudou’s heart sank. Just as she was about to speak again, Lan Jia said, “However, since I’m here to help, I’ll definitely help to the very end. Lady Doudou, wait a little. I’ll be back right away.”</p><br/><p>“Thanks!” Tang Doudou’s expression immediately brightened up when she heard that there was hope. As she thanked Lan Jia, inwardly she was thinking that she really had wrongly accused him.</p><br/><p>When Lan Jia heard this, he smiled slightly. Then his footsteps soon faded into the distance.</p><br/><p>Tang Doudou didn’t know when he would be back, so as she mulled over his words, she walked back to the bed. Baili Yu was no longer clutching his chest in pain anymore, but his brows were still tightly furrowed.</p><br/><p>Tang Doudou reached out and stroke his forehead as she pressed her lips together worriedly. Baili Yu, please be alright!</p><br/><p>When her gaze landed on his naked upper body, she suddenly recalled what Lan Jia said earlier and retrieved her hand like it had been scalded. She blushed slightly. Would he really go back to normal if they consummated?</p><br/><p>But he had already passed out. How was she supposed to consummate on her own?</p><br/><p>__________</p><br/>\n</div>"}