{"title": "Chapter 286.2: Paying Respects to Mother", "id": 286, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2862-paying-respects-to-mother", "volume_title": "Volume 3", "body": "<h1>Chapter 286.2: Paying Respects to Mother</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In front, Baili Yu seemed to have discovered something as he suddenly stopped walking. “Doudou, don’t walk over and stay there for now.”</p><br/><p>“What is it?”</p><br/><p>“There’s something here.” Baili Yu took another few steps forward and bent down to pick up something. Then he exclaimed with surprise, “Why would it be this?”</p><br/><p>“What is…” Before Tang Doudou could even finish speaking, a silt whirlpool appeared below her feet. She didn’t even have the chance to scream before she fell.</p><br/><p>This had happened abruptly and silently. By the time Baili Yu noticed that something was wrong and turned around to look, Tang Doudou had already disappeared.</p><br/><p>“Doudou!”</p><br/><p>Baili Yu rushed to the place where Tang Doudou had been standing and looked down. Self-blame immediately filled his eyes. “Damn it!”</p><br/><p>Following that, he crushed the item he was holding into dust. As the dust poured through his fingers and fell onto the ground, it made several shallow holes. He slammed his palm down and the attack penetrated the surface of the ground, causing the ground to start moving as if something below was stirring in response.</p><br/><p>Baili Yu’s expression turned grim. He had underestimated Lan Jia. He hadn’t expected for Lan Jia to do something here.</p><br/><p>“Doudou, don’t be scared. I’m coming to save you right now!”</p><br/><p>After he finished speaking, he sent another heavy strike down. A whirlpool once again appeared on the ground. The sight of it was like that of a monster opening its mouth to swallow its prey.</p><br/><p>However, Baili Yu didn’t hesitate in the slightest before he jumped down.</p><br/><p>The Seven Great Saint Tribes have dug everywhere that could be dug in Cerulean Mountains, so there were countless secret passages, and they were all extremely complicated. Even the people of the Saint Tribes would often get lost in them. If he didn’t hurry and find Tang Doudou before she wandered off, he might never be able to find her again.</p><br/><p>Baili Yu’s worry wasn’t wrong. After Tang Doudou fell down through that whirlpool, she found herself in another secret passage. She immediately became depressed. Were the people of the Saint Tribes reincarnation of mice?</p><br/><p>She dusted herself off, then looked up at the place where she had fallen through. The ceiling had already returned to normal as if that hole had never existed.</p><br/><p>She became depressed again. How did a whirlpool appear out of nowhere?</p><br/><p>“I’d better wait here for Baili Yu to come find me. These passages look like a mess, I probably won’t be able to find my way back if I leave.” After making this decision, she sat down to wait for Baili Yu.</p><br/><p>However, right after she sat down, she felt a familiar sensation from her butt. When she looked down, in the weak light that came from an unknown source, she saw that there were numerous black bugs below her feet that were crawling back and forth. Goosebumps immediately rose up all over her body.</p><br/><p>Jesus!</p><br/><p>She fell into the nest of the poisonous bugs!</p><br/><p>F*ck, this development was demanding her life!</p><br/><p>She wanted to run, but at the same time, she was worried about startling these bugs. However, if she didn’t run, these bugs would eventually notice her… It was seriously a difficult decision on all ends.</p><br/><p>However, the most worrisome matter was that she was currently sitting on these poisonous bugs.</p><br/><p>Should she get up, or should she continue sitting? This was a very serious question ah!</p><br/><p>However, as she thought about this, she noticed that something was off. It had been quite some time since she had fallen down here, yet why haven’t the poisonous bugs attacked her?</p><br/><p>On the contrary, they seemed to be avoiding her. The poisonous bugs that she had sat on were starting to crawl away from her.</p><br/><p>When she was on the iron chain leading to the Sacred Tree, Lan Jia had said that these bugs would have attacked her if it hadn’t been for his hair tie.</p><br/><p>However, even with the hair tie, she had fallen for the hallucination these bugs induced.</p><br/><p>So she felt it strange that these bugs weren’t attacking her since she didn’t have anything on her that would repel bugs or their poison.</p><br/><p>Suddenly, she glanced at the wedding gown she was wearing. Could it be due to this?</p><br/><p>Forget it. There was no point racking her brain over this strange development. It was great fortune that these bugs were not attacking her. That was enough.</p><br/><p>She laughed in relief and slowly stood up. Although she startled a lot of bugs, none of them attack her.</p><br/><p>She immediately felt more relieved.</p><br/><p>Following that, she took a couple steps forward. Every time her foot was about to land, those bugs would scamper off as if they were fleeing for their lives. Tang Doudou laughed. “Heh, it feels like I got a really powerful ability!”</p><br/><p>“Why is the big evil spirit still not here? It couldn’t be that he didn’t notice that I disappeared?” Tang Doudou shrugged, then continued walking forward.</p><br/><p>Although the bugs didn’t attack her, it was creepy to stay in a nest of bugs. She planned to find a place with less bugs and wait for Baili Yu there.</p><br/><p>However, the moment she started walking, another problem occured.</p><br/><p>A rumbling sound came from above her, and a few seconds later, an enormous thing dropped down in front of her.</p><br/><p>What the f*ck was this!?</p><br/><p>After that thing fell down, the bugs on the ground frantically fled from it while emitting screeching sounds. It was so loud Tang Doudou felt like her eardrums were about to burst.</p><br/><p>Something that even the poisonous bugs were afraid of definitely wasn’t anything good. Moreover, it was humongous!</p><br/><p>These thoughts rapidly flashed through Tang Doudou’s head before she reacted and ran like her life depended on it, following the poisonous bugs.</p><br/><p>__________</p><br/>\n</div>"}