{"title": "Chapter 291.2: Raiding His Base", "id": 291, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2912-raiding-his-base", "volume_title": "Volume 3", "body": "<h1>Chapter 291.2: Raiding His Base</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Since Sister-in-Law has agreed, then cooperate with Yiling, alright? If Big Brother finds out, Yiling has done all of this for Big Brother and Sister-in-Law, so… don’t let Big Brother punish me, alright?”</p><br/><p>Had she planned all of this from the start? It was clear that Yiling had wanted to do this but was afraid that Baili Yu would get angry at her and punish her, that was why she had dragged her into it.</p><br/><p>And Yiling had planned out things perfectly so that she would agree. Although she had agreed against her will earlier, Yiling probably would’ve gotten her to agree even without that trick.</p><br/><p>“Then Yiling will unseal your movements now and then we’ll secretly go help Big Brother!”</p><br/><p>As she spoke, she unsealed Tang Doudou’s pressure points.</p><br/><p>“Tell me your plan first, otherwise I’ll leave by myself and won’t ever go back to look for Baili Yu.” Tang Doudou knew that if she was going to stay with Baili Yiling, this little fox, she had to take the initiative to seize the upper hand. Otherwise, it was very possible for her to be trolled and sold out mercilessly.</p><br/><p>Baili Yiling curved her eyes in amusement. It seemed she hadn’t expected Tang Doudou to suddenly become smart and even try to threaten her.</p><br/><p>It seemed that this sister-in-law of hers knew more than to just act cute!</p><br/><p>“What? You won’t agree? Then I’m leaving!”</p><br/><p>“Aiyah, Sister-in-Law, don’t be so impatient!” Baili Yiling hastily grabbed Tang Doudou and said, “Yiling will tell you, alright?”</p><br/><p>“Then start.”</p><br/><p>“This is quite a long story, so why don’t we walk as I tell you?”</p><br/><p>When Baili Yiling pulled her inside, she was walking really fast so they couldn’t even see the light from outside anymore. However, they could still faintly hear the sounds of battle coming from outside. The disturbance was very loud, so Tang Doudou couldn’t help but worry about Baili Yu.</p><br/><p>“Then first tell me what we’re doing.”</p><br/><p>Baili Yiling smiled. “Of course we’re going to dig through Lan Jia’s place to find something that can help Big Brother.”</p><br/><p>What would Lan Jia have that could help Baili Yu?</p><br/><p>“With Big Brother’s skill in martial arts, even if Lan Jia was ten times stronger than he usually was, he still wouldn’t be a match for Big Brother, so we don’t need to worry about Big Brother’s safety right now. Rather than hang around, we should take advantage of this chance to search Lan Jia’s hidden rooms for the antidotes to the Hoarfrost Poison and Disseminating Tassel Fragrance!”</p><br/><p>Baili Yiling’s words gave Tang Doudou a pleasant surprise. “You’re saying that Lan Jia has the antidote to the Hoarfrost Poison?”</p><br/><p>“Of course! This poison was something he had brought out from that strange place. For the sake of cultivating this sort of poison blood, he killed so many people of his own blood and flesh and caused the deaths of countless innocents… Even if we can’t find the antidote in the hidden room, we should still destroy the method to produce poison blood in order to save future generations from this fate!” Baili Yiling spat these words between gritted teeth. It was clear that she hated Lan Jia from the bottom of her heart.</p><br/><p>“It’s just a shame that although I learned a lot of useful tricks over the years, I’m not good at martial arts. Otherwise, I’d personally kill Lan Jia, that bastard and avenge Mother!”</p><br/><p>“So I have no choice but to allow Big Brother to do it. However… he’s still Big Brother’s father! Will Big Brother really have to kill his own father…”</p><br/><p>If Baili Yu really did, he would probably have to endure the pain for the rest of his life…</p><br/><p>It was no wonder he insisted on her leaving.</p><br/><p>He probably didn’t want her to see his pain and weakness.</p><br/><p>He wanted to endure all the pain by himself and was only willing to show her a comforting and warm smile.</p><br/><p>“Sister-in-Law, don’t worry. Big Brother, He- He’s already used to it.”</p><br/><p>“Yiling, when did he find you? Why does it feel like you know each other really well?” If she wanted to get to know Baili Yu’s true feelings, she had to do it slowly, and start with the people by his side. She wanted to share all his emotions, not just his shield of a smile.</p><br/><p>Baili Yiling said, “He didn’t find me, I was the one that found him!”</p><br/><p>“After Big Brother came to Cerulean Mountain, I started thinking of ways to approach him. I helped him cure the grub poison that Lan Jia had planted on him, then brought him to the stone room Mother had stayed in before she died…”</p><br/><p>“You seem very familiar with Cerulean Mountain. Could it be that you’ve been here this entire time?”</p><br/><p>“That’s right. That year, after Madame Qing brought me to Cerulean Mountain, Grandpa Gui switch me with another girl. I stayed in Cerulean Mountain and Grandpa Gui sent Lan Jia’s daughter to Wind Cloud Island, thus completing the task Lan Jia had given him.”</p><br/><p>Tang Doudou never expected for there to be so many twists in this matter. She had really been too sheltered to actually have been unaware of all of this.</p><br/><p>She rubbed her thumb ring. She wasn’t Li Xueyi, so she couldn’t help but wonder how much Li Xueyi had been able to find out.</p><br/><p>It was no wonder that Li Xueyi had been collecting the Green Bone Phoenix Lamps. She had probably found out that her birth parents were involved with the Saint Tribes. In addition, who exactly was that black-clothed person? And Lan Jia had brought up the Xuanyuan bloodline…</p><br/><p>Wasn’t he talking about her? She was the descendant of the Xuanyuan Saint Tribe!? Tang Doudou was stunned by this thought. If that really was the case, it made a lot of other things fall into place.</p><br/><p>“We’re here!” Just as Tang Doudou was sinking into her thoughts, she heard Baili Yiling’s happy exclamation. “I’ve stayed in Cerulean Mountain for many years. I would go around exploring all the secret passages in Cerulean Mountain with the map that Grandpa Gui had given me to familiarize myself with the area. As of now, I can find my way through these passages even with my eyes closed. It was also after I became familiar with this place that I found the stone room that Mother stayed in when she was still alive… which is also Lan Jia’s secret room.”</p><br/><p>After she finished speaking, she turned the corner and they arrived in the stone room they were in earlier.</p><br/><p>Baili Yiling’s expression now turned tense. “Be careful, that dumb bug is still there. No matter what, we can’t startle it.”</p><br/><p>__________</p><br/>\n</div>"}