{"title": "Chapter 298.2: Big Brother was Dead", "id": 298, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2982-big-brother-was-dead", "volume_title": "Volume 3", "body": "<h1>Chapter 298.2: Big Brother was Dead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Feiyun was certain Jun Xin wouldn’t try to spy again this time, so he bent over and spoke softly into Tang Doudou’s ear. “Alliance Head, can you hear me?”</p><br/><p>There was no response visible.</p><br/><p>Bai Feiyun inserted a few more needles. Tang Doudou’s brows furrowed from pain, but her eyes remained dull.</p><br/><p>“Alliance Head?” Only then did Bai Feiyun realize that something was wrong. He had lied to Jun Xin earlier, he had already undid the seal. It was just that he needed to ask Tang Doudou something, that’s why he lied to get Jun Xin away.</p><br/><p>However, although Tang Doudou had opened her eyes, she was still unconscious. The way she looked was as if she had lost her soul.</p><br/><p>Lost her soul?</p><br/><p>Bai Feiyun’s expression turned serious. He tapped a few more of her pressure points, then collected the needles and left the room.</p><br/><p>When Jun Xin saw him come out, he hastily ran over. “Is she awake?”</p><br/><p>Bai Feiyun shook his head. Jun Xin’s heart started pounding anxiously when he saw the grave expression on Bai Feiyun’s face. “She’s not awake? Why?”</p><br/><p>“I’ve undone her seal and there doesn’t seem to be anything wrong with her body, it seems like she’s the one who’s unwilling to wake up.” As he spoke, he glanced at Jun Xin. “Young Master Jun, has the Alliance Head encountered something traumatizing?”</p><br/><p>“I don’t know.” Jun Xin had a bad premonition that was getting stronger. “But someone else does!”</p><br/><p>After he said that, he ran off.</p><br/><p>Bai Feiyun had no choice but to return to the room. He looked Tang Doudou over again. Her body was fine, it was clearly a mental problem. Although her body was alert, she was still unconscious.</p><br/><p>Jun Xin soon returned with a cursing lady in tow.</p><br/><p>It was Baili Yiling.</p><br/><p>“Damned brat! Let go of me! I’ll bite you!”</p><br/><p>“You’re hurting me!”</p><br/><p>“Let go!”</p><br/><p>“Shut up!” Jun Xin’s expression was completely dark. He was extremely worried and vexed since Tang Doudou wasn’t waking up. If it hadn’t been for the fact that Baili Yiling was the only one who knew what happened to her, he would have already killed this annoying and noisy woman.</p><br/><p>“Young Master Jun, this is?” Bai Feiyun looked at Baili Yiling who was still dressed in ragged clothing. However, when he saw her eyes, he had an inkling of who she was.</p><br/><p>“Baili Yiling, Baili Yu’s younger sister!” Jun Xin gave a simple explanation, then pulled Baili Yiling to Tang Doudou’s bed.</p><br/><p>“Shut up already and take a look for yourself!”</p><br/><p>Baili Yiling flung off Jun Xin’s hand and turned to glance at Tang Doudou. When she saw Tang Doudou’s lifeless eyes, she cried out in shock, “Sister-in-Law! What’s wrong?”</p><br/><p>Then she saw Bai Feiyun who was standing by the bed.</p><br/><p>When she saw that he was dressed in white with handsome and gentle features, she asked, “You’re Bai Feiyun?”</p><br/><p>Bai Feiyun nodded. “Yes.”</p><br/><p>“City Lord Su told me that you would be able to wake Sister-in-Law up.”</p><br/><p>“I’ve already done all I can, it’s the Alliance Head that’s not willing to wake up,” said Bai Feiyun as he looked towards Baili Yiling. “That’s why I wanted to find out what exactly Alliance Head had encountered, to cause her to be unwilling to wake up. The reason must be found before we can start coming up with ideas to convince her to wake up.”</p><br/><p>“Young Master Jun is simply too worried about Alliance Head, that’s why he was a little rough with you. I hope Lady won’t blame him too much and will tell us about what happened to you and Alliance Head during this past period.”</p><br/><p>Baili Yiling glanced at Jun Xin. She had known that something was wrong with Sister-in-Law when she saw how impatient he was, but she hadn’t expected it to be so severe.</p><br/><p>Of course she knew why Sister-in-Law wasn’t willing to wake up.</p><br/><p>It was definitely that Brother’s death caused her to lose the will to live. Since she had no will to live, she naturally wouldn’t wake up.</p><br/><p>A person as gentle and considerate as Bai Feiyun was much more pleasing to the eye than Jun Xin.</p><br/><p>“A lot of things had happened. I think Sister-in-Law isn’t willing to wake up because Big Brother’s death had dealt her too large of a blow…”</p><br/><p>“Stinkin’ girl! What nonsense are you saying!” Before she could even finish her sentence, Jun Xin started shouting.</p><br/><p>__________</p><br/>\n</div>"}