{"title": "Chapter 290.2: Baili Yiling", "id": 290, "volume": 3, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-2902-baili-yiling", "volume_title": "Volume 3", "body": "<h1>Chapter 290.2: Baili Yiling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lan Jia’s angry snarling and sounds of battle could be heard from behind them. It seemed that Shen Moru and Lan Jia had a falling out.</p><br/><p>Tang Doudou and Mu Ye followed behind Shuyin and ran around the dark and complicated secret passage until a bright light appeared ahead of them.</p><br/><p>The group exited the secret passage only to find that they were still within the Saint Palace. It was just that they didn’t know which palace hall they were in. A tumultuous fire roared nearby and sounds of people shouting as they worked to put out the fire mixed with the desperate pleas for help. Needless to say, this was the work of Baili Yu.</p><br/><p>Shuyin shot a look at Mu Ye. “Now that we’ve saved you, hurry up and leave These matters are not for an outsider like you to interfere with.”</p><br/><p>Mu Ye moved his lips but didn’t speak. Instead, he turned towards Tang Doudou.</p><br/><p>Tang Doudou recalled what he’d said, He’d go wherever she goes…</p><br/><p>However… She put Lil’ Gray on his hand. “Go! Baili Yu’s here, I’ll be fine.”</p><br/><p>Mu Ye lowered his head to look at Lil’ Gray. There was no emotion visible in his cold eyes. “I will bury Senior at Dream Mountain when I get back. Remember to visit him.”</p><br/><p>Then, he disappeared into the vast sea of clouds with Lil’ Gray.</p><br/><p>“Who is this senior he was talking about?” Shuyin asked.</p><br/><p>Tang Doudou retrieved her gaze and answered, “My father.” “Your father?” Shuyin’s eyes narrowed with interest. “Who was your father?”</p><br/><p>“Oh, Mu Ye didn’t say…”</p><br/><p>“Him?” The mention of Mu Ye seemed to piqued Shuyin’s interest. “And who is he?”</p><br/><p>Tang Doudou was speechless. “He’s Mu Ye!”</p><br/><p>“I know,” Shuyin raised her brows as she hugged her shoulders. As she yawned, she said, “Let’s go look for Baili Yu.”</p><br/><p>Tang Doudou had just been thinking about Mu Ye and failed to notice that the way Shuyin addressed Baili Yu had changed. When she saw that Shuyin was leaving, she moved to follow.</p><br/><p>When they finally found Baili Yu, he was in the process of getting out of the dusty secret passage. He was probably frustrated since he hadn’t been able to find Tang Doudou inside before he slammed his fist against it and destroyed the passage he had just emerged from.</p><br/><p>“Stop venting your anger on those things! I’ve already brought the person back for you!” When Shuyin saw Baili Yu, she lifted Tang Doudou by her clothing and threw her over.</p><br/><p>Tang Doudou, flung into the air, was speechless towards Shuyin’s barbaric handling of her. She was fully prepared to land on the hard ground given the fact that there was barely any time for Baili Yu to react.</p><br/><p>However, she had underestimated Baili Yu’s reaction time.In the next instant, she Doudou landed safely in his arms.</p><br/><p>“Doudou.” His trembling voice came from above her head and it caused her to become flustered.“I-I’m fine. It’s all thanks to Mother’s speedy arrival.” She hugged Baili Yu tightly as she greedily took in his scent.</p><br/><p>“Mother?” He asked in bewilderment. As he cupped her head, he asked, “Who’s this ‘mother’?”</p><br/><p>Tang Doudou pointed towards Shuyin who had been yawning non-stop and asked, “Is-isn’t that our mother?”</p><br/><p>Baili Yu’s face which was already gray from dust instantly turned as black as coal. He repeated again with a strange expression, “Mother?”</p><br/><p>Tang Doudou could sense that Baili Yu there was a deeper meaning in his words so she looked over curiously, only to see that Shuyin was standing there was an unnatural expression on her face as she looked towards the sky, then the ground. “Ahem, tonight’s moon is sure nice, it’s perfect for couples to whisper sweet nothings to each other… Ahem, the scenery is so nice as well, you guys enjoy, take your time, I’ll be leaving…” </p><br/><p>After she finished speaking, no trace of her crooked back could be seen at all as she moved nimbly to escape.</p><br/><p>Baili Yu instantly moved to block her with a very bright smile. “Baili Yunling, why don’t you explain clearly before leaving?”</p><br/><p>“Cough cough, my dear brother, it was just a convenient measure. If I didn’t do that, how could I have brought Sister-in-Law back to you unharmed?” Shuyin, or rather, Baili Yunling, drew back a little as she spoke with a hint of fear in her voice.</p><br/><p>Baili Yu humphed. There was clear displeasure within his tone.</p><br/><p>Tang Doudou was confused and couldn’t wrap her head around it. “Wh-what? Sh-she’s Baili Yunling?” “Yunling greets Sister-in-Law.” Baili Yunling reached towards her mask and ripped it off, revealing a delicately beautiful face that was extremely similar to Baili Yu’s before greeting Tang Doudou in a sweet voice.</p><br/><p>Tang Doudou was dumbstruck. Even though the truth was right before her eyes, she still couldn’t quite believe it. After all, Baili Yunling’s act was way too good, even a person as meticulous as Lan Jia failed to see through her pretense. That was enough to show that she had acted exactly like Shuyin.</p><br/><p>“Aiy, Sister-in-Law is lost in thought again, what cute!” Baili Yunling laughed delicately at Tang Doudou’s reaction as she remarked this teasingly.</p><br/><p>Tang Doudou snapped back to reality upon hearing her bell-like laughter. Baili Yunling had remarked this back in the stone room as well. She had found her slightly mischievous manner strange at the time, but it all made sense now. It turned out that she was a lovable young girl from the start. Baili Yu’s little sister ought to be someone this lively and lovable, someone with a personality like Nangong Yan was simply too unbearable.</p><br/><p>Tang Doudou just didn’t know when Baili Yu had found this sister of his, and how had she ended up coincidentally being in the stone room to rescue her?</p><br/><p>Baili Yunling could see the puzzlement on Tang Doudou’s face so she said with a smile, “Sister-in-Law, do you happen to remember the scent of the incense in the stone room?”</p><br/><p>Everything snapped into place. “You were the one who lit that incense?”</p><br/><p>__________</p><br/>\n</div>"}