{"title": "Chapter 325.2: It’s the Boys that are the Cutest!", "id": 325, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3252-it%E2%80%99s-the-boys-that-are-the-cutest", "volume_title": "Volume 4", "body": "<h1>Chapter 325.2: It’s the Boys that are the Cutest!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The moment they stepped out the doors, Jin Yi curtsied and said, “The owner has said that if you two are awake, to tell you not to casually head out.”</p><br/><p>“Why?” Tang Doudou poked her head out from behind Baili Yu. She glanced around the empty building, then noticed the closed front doors. “You guys closed?”</p><br/><p>“The owner said that we’ll be closed for a few days,” replied Jin Yi.</p><br/><p>“Then where’s your owner?”</p><br/><p>Jin Yi lowered his head and said quietly, “Jin Yi doesn’t know.”</p><br/><p>Tang Doudou didn’t press him for answers. Gu Xun had probably headed out to prepare for their departure. However, the fact that he sent someone to keep a watch on them and prevent them from heading out probably meant that the situation was more severe than she had expected.</p><br/><p>“I got it, then help me call Lian er over.” Tang Doudou waved her hand dismissively, then pulled Baili Yu back into the room.</p><br/><p>When she got back inside, she started rubbing her head again.</p><br/><p>Baili Yu grabbed her hand and squeezed it gently. “I’ll help you.”</p><br/><p>Then he pressed her down onto the chair before placing his fingertips on the sides of her head to slowly start massaging her. The gentle rhythmic pressure felt so good that Tang Doudou couldn’t help but groan. “When did you learn how to do this? You seem pretty professional.”</p><br/><p>Baili Yu chuckled. “Probably a very long time ago. I don’t remember when. How is it? Comfortable?”</p><br/><p>“En en, it feels really good!” Tang Doudou closed her eyes to enjoy the sensation. “Baili Yu, haven’t you thought about trying to recover your memories?”</p><br/><p>Baili Yu’s movements paused, then he answered in a slightly distressed tone, “For some reason, I like this current lifestyle, so I’m not really that curious about the past.”</p><br/><p>Tang Doudou nodded. “Maybe it’s because the way you lived before was too tiring!”</p><br/><p>As they spoke, she started feeling sleepy again, so she soon drifted off while enjoying this massage.</p><br/><p>Baili Yu carried her back onto the bed and sat quietly at the side to gaze at her. After a good while, he got up and went over to push open the window.</p><br/><p>Right after he opened the window, a figure nimbly jumped in.</p><br/><p>“You don’t look like you’ve lost your memories!” After that person came in, he strode over to the table and poured himself a cup of tea. After gulping it down, he exclaimed, “This little master’s about to die from overwork! Is she already asleep?”</p><br/><p>After saying that, he walked towards the bed.</p><br/><p>Baili Yu walked over to block his way. “Let her rest.”</p><br/><p>“Even after losing your memories, you still know how to look after your wife. Seems like she didn’t rush without sleeping for three months in vain.”</p><br/><p>This person that introduced himself as Jun Xin had come half a month ago to tell him about a bunch of strange things before rushing off again. Before he left, he had said that he would be back in half a month. Baili Yu hadn’t expected him to be so prompt. Today was precisely half a month from that time.</p><br/><p>After Jun Xin rested a while, he looked Baili Yu over, then nodded. “Baili Yu, actually, the way you are right now is pretty good.”</p><br/><p>“Maybe you shouldn’t return after all. I’ll help you guys find a quiet place and you guys can go live in seclusion.” Jun Xin rubbed his chin. The more he thought about it, the more appealing this idea seemed. “What do you think?”</p><br/><p>Baili Yu glanced at him mildly. “I don’t know.”</p><br/><p>“Geez!” Jun Xin stretched his waist as he remarked, “That excuse is so convenient.”</p><br/><p>“How is your investigation going?” Baili Yu sat down next to the bed and covered Tang Doudou again with the blanket that she had kicked away.</p><br/><p>When this matter was brought up, Jun Xin fumed again. “Say, back then, you were seriously so nice to Yun Hai. It was like he was your biological son while the rest of us were all just foster children. You insisted on getting him everything he wanted, but in the end, he turned out to be a white-eyed wolf. We were even worried that he had been captured by the Seven Great Saint Tribes and were racking our brains for ideas to get him out! Yet right after we rescued him, he turned around and attacked you! If it weren’t for the fact that there wasn’t enough time, I would’ve already headed back to kill him!”</p><br/><p>Although Baili Yu had no memories of these people, his heart felt uncomfortable when he heard that Yun Hai really had betrayed him. “Did you find out any other news?”</p><br/><p>“Nope.” Jun Xin answered straightforwardly. “Yun Hai has gotten rid of all my subordinates. I only got these pieces of news by capturing a few of Yun Hai’s people and forcing these information out of them.”</p><br/><p>“You’ve worked hard.” Baili Yu could see the exhaustion on Jun Xin’s face, so he held back his other questions. “Gu Xun said that he wanted to send Tang Doudou and me out of here by tonight. You should go rest for now as well. I’ll wake you up once we’re about to leave.’</p><br/><p>“That works!” Jun Xin was tired. Although he said that he was going to follow Tang Doudou from the shadows, half a month into their journey, his subordinates sent him astonishing news. So after that, he had to protect Tang Doudou from the shadows while rushing around to collect information.</p><br/><p>Then he rushed ahead to Hibiscus Garrison to find Baili Yu, then went back to deal with several pressing matters before rushing right back again. He had been stressed this entire time worrying about whether anything had happened to Tang Doudou.</p><br/><p>Jun Xin had traveled the road that Tang Doudou took three months to travel twice in that span of time. He was long past his limits. After Baili Yu said this, he headed directly towards the part of the room behind the screen. His eyelids were drooping even as he walked.</p><br/><p>Right after Jun Xin walked past the screen, Jin Yi knocked on the door and said, “Alliance Head Li, Lian er is here.”</p><br/><p>Jun Xin poked his head out. “Who’s Lian er?”</p><br/><p>“A courtesan that works here.” Baili Yu got up and pushed open the door to walk out.</p><br/><p>A courtesan?</p><br/><p>It wasn’t strange for there to be courtesans here since this was a male brothel after all, but what was he looking for Tang Doudou for?</p><br/><p>“It’s probably nothing. I’ll ask her once she wakes up.”</p><br/><p>“Alright, then we’ll have to trouble you, Escort Xue.”</p><br/><p>“Not at all.”</p><br/><p>Jun Xin thought things were resolved so he closed his eyes, but suddenly a shrill voice rang out. “What is going on!? After she called me here, you’re saying she’s asleep!? Who knows if you aren’t lying on purpose!? No way I’m accepting this until I take a look for myself. Move, let me in…”</p><br/><p>“Lian er, don’t make a fuss!”</p><br/><p>“I’m not making a fuss, wasn’t it Alliance Head Li that called for me? Would she call for me if it was nothing? From what I see, a certain person is just jealous and worried that I would snatch Alliance Head Li away, so he’s lying and saying that Alliance Head Li is asleep!”</p><br/><p>“Lian er, Alliance Head Li is a very important guest of the owner. If you do this, the owner will kick you out!”</p><br/><p>“Tch, Jin Yi, don’t think that you’re so special just because the owner assigned you to look after Alliance Head Li. Aren’t you nothing but a courtesan as well!?”</p><br/>\n</div>"}