{"title": "Chapter 335.1: Watch the Stars With You Every Night", "id": 335, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3351-watch-the-stars-with-you-every-night", "volume_title": "Volume 4", "body": "<h1>Chapter 335.1: Watch the Stars With You Every Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Baili Yu’s words half choked Tang Doudou to death. Give birth to a whole bunch of fat boys? Wasn’t that demanding her life?</p><br/><p>In addition, what if they all turned out to be girls?</p><br/><p>“Could it be that you don’t like daughters?” The ancient feudal way of thinking strongly valued males over females. Baili Yu might also share the same view. If that was the case, she would rather not give birth!</p><br/><p>Baili Yu was still fantasizing about the scene she had painted earlier. He felt that it was not bad. However, there was no need to open a restaurant when it was just the two of them. Managing a restaurant was very hard work, and he wouldn’t be able to help much either. There was no way he could just sit around while his wife worked.</p><br/><p>Opening a little school would be better. He could teach the little kids in the village how to read. After class, he’d head home and on the way, he’d be able to see the warm yellow light coming from their house. Once he got home, he’d be welcomed with a table of her carefully prepared food and she’d come up, delicate and cute as ever, to take the books from his hands. They’d then eat together, enjoy the view of the moon together, go to sleep together…</p><br/><p>En, not bad, not bad… He’ll work outside to feed the family and she can stay at home to assist him in educating the children.</p><br/><p>The more Baili Yu thought about it, the more pleasing he found this idea. He was so engrossed in this fantasy that he didn’t even hear what Tang Doudou said,</p><br/><p>When Tang Doudou looked up and saw that foolish grin on his face, she reached towards his waist, pinched it, and twisted hard. Baili Yu immediately snapped out of it due to the pain. As he inhaled sharply, he asked, “Wife, you…”</p><br/><p>“I’m asking you something! Do you dislike daughters!?”</p><br/><p>Baili Yu was confused. What did this have to do with disliking daughters?</p><br/><p>As long as she gave birth to them, what did he care whether it was a girl or a boy? He’d love them to the core all the same.</p><br/><p>“Wife, as long as you’re the one that gives birth to them, regardless of whether it’s a boy or a girl, this husband will treat them like treasure and definitely wouldn’t treat them even the slightest bit unfairly!”</p><br/><p>Anyone could say pretty words!</p><br/><p>Tang Doudou then said, “Excessive indulgence isn’t good. As the father, you must be strict!”</p><br/><p>“Alright, alright, if our children does something wrong, I’ll definitely beat them ferociously, alright?”</p><br/><p>“That’s just great! This child hasn’t even been born, yet you’re already ready to beat him? I’m not giving birth anymore! If you want to beat someone, go beat someone else’s child! You’re not allowed to beat my son!”</p><br/><p>…</p><br/><p>Baili Yu looked speechlessly towards the sky. Pregnant women truly had a lot of mood swings.</p><br/><p>Tang Doudou was interpreting his words too literally!</p><br/><p>Baili Yu decided not to carry on this topic anymore, otherwise he’d definitely end up wrong no matter what he said.</p><br/><p>“Wife, look, isn’t it beautiful?”</p><br/><p>“What do you mean beautiful? I’m talking to you about a serious matter!” huffed Tang Doudou angrily. However, though she said that, she couldn’t stop herself from glancing up and was instantly captivated by the beautiful sky that was studded with sparkling gem-like stars. “How beautiful.”</p><br/><p>Baili Yu glanced down at her fluttering lashes, then lowered her onto the plank outside the carriage so that they were sitting side by side. Once Tang Doudou leaned her head on his shoulder, he wrapped his arm around her back to shield her from the slightly moist night breeze. “During the afternoon, I saw that the weather was very sunny and cloudless, so there would probably be a very beautiful sky tonight. Since you’ve been rushing around so much lately for my sake, you probably haven’t taken the time to enjoy this beautiful night view, so I purposefully slowed down in order to avoid getting too close to the city.</p><br/><p>“As I had expected, tonight really gave a beautiful view. It’s been a long time since I’ve seen such a great view as well.”</p><br/><p>Tang Doudou finally understood his considerate thoughts. She stared in a daze at the bright twinkling stars that seemed to be winking at her, then sighed. “I’ve never seen such a beautiful night sky in my life.”</p><br/><p>This was completely true. In the modern era, it was hard to even see stars in the sky.</p><br/><p>The lively city was filled with bright neon lights at night, so the stars couldn’t be seen at all.</p><br/><p>When Baili Yu heard the faint melancholy in her voice, he hugged her tighter so that her head fell against his chest. “Don’t worry, Wife. From now on, this husband will watch the stars with you every night.”</p><br/><p>“I don’t believe you,” said Tang Doudou with a pout.</p><br/><p>Baili Yu laughed. “I’ll definitely keep my word. Wife should believe in this husband.”</p><br/><p>“But I don’t believe.”</p><br/><p>“Then can Wife give me a reason?”</p><br/><p>Tang Doudou glanced at him, then spouted a string of reasons. “Then you’ll bring me to see them even when it’s raining? What about when it’s snowing? When it’s cloudy?”</p><br/><p>Baili Yu’s smile froze. How was he supposed to respond to this?</p><br/><p>When Tang Doudou saw that she had made him speechless, she delighted in the fact that she won over him.</p><br/><p>However, on the surface, she gave another unhappy humph. “I just knew that you wouldn’t be able to do it. If you can’t do it, you shouldn’t promise it, otherwise I’d take it seriously.”</p><br/><p>Upon hearing this, Baili Yu furrowed his brows. This was the first thing he had promised her, how could he accept failure due to the weather?</p><br/><p>“So what if it rains, snows, or is cloudy? Isn’t it just stars? If we can’t see it in this part of the sky, this husband will just bring you to another part!”</p><br/><p>It was clearly an unreasonable declaration, but Tang Doudou was provoked to laughter. “Pei! You’re the only one that would be bored enough to do so.”</p><br/><p>“Isn’t this precisely what Wife likes about me?” When she smiled, Baili Yu smiled as well. Perhaps Tang Doudou thought he was joking to make her laugh, but in his heart, this was an actual promise. He promised to take her to see the stars every day after this!</p><br/><p>Because he had lost his memories, he could no longer remember the things he had promised Tang Doudou in the past, so he naturally treated this as his first promise. Thus, he remembered it extremely strongly. Even after he later recovered his memories, he still kept this promise perfectly. However, at that time, Tang Doudou ended up terribly troubled. Who the frick was bored enough to go stargazing every single night!?</p><br/><p>Of course, this all occurred later, so it’ll be set aside for now.</p><br/>\n</div>"}