{"title": "Chapter 330.2: Ill", "id": 330, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3302-ill", "volume_title": "Volume 4", "body": "<h1>Chapter 330.2: Ill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Although it was already late in the night, the surroundings were still faintly visible. They were halfway down a mountain. There seemed to be a village below, but there were no lights at all.</p><br/><p>The other areas were completely silent.</p><br/><p>After glancing around briefly, Baili Yu started heading down the mountain.</p><br/><p>Jin Yi hastily called out to stop him. “Baili gongzi, please don’t be in such a rush. Just wait a little longer, they’ll be here soon.”</p><br/><p>Baili Yu didn’t seem to hear him and just increased his speed. He soon walked far away.</p><br/><p>Jin Yi was troubled and anxious. Where were the people that was supposed to meet them?</p><br/><p>He was worried about being too loud so he had no choice but to leave the passage and run after Baili Yu.</p><br/><p>“Baili gongzi, Baili gongzi…”</p><br/><p>He quietly called in an attempt to stop Baili Yu.</p><br/><p>However, Baili Yu didn’t even bother to glance at him and continued walking forward while carrying Tang Doudou. His expression was faintly visible. He looked very tense as if there was great danger behind him that was forcing him to walk forward as fast as he could.</p><br/><p>Jin Yi was also aware by now that things had fallen out of Gu Xun’s control. If he turned back, he might lose track of Baili Yu’s whereabouts, but if he didn’t go back, Gu Xun wouldn’t know what had happened. What should he do?</p><br/><p>As Jin Yi hesitated, Baili Yu got even further away. Jin Yi glanced at Baili Yu, then decided to head back first.</p><br/><p>Baili Yu and Tang Doudou were not ordinary people, so Gu Xun had already predicted that they had made other arrangements. The looks of things now seemed to support that conjecture, so he had to hurry and let Master know of this news. If he took too long, it may be too late to salvage the situation.</p><br/><p>When he reached this conclusion, he turned back to rush towards the passage but abruptly stopped when he saw a large number of people dressed in black move into the passage.</p><br/><p>He hastily hid himself in the underbrush. Who were these people?</p><br/><p>Just as that thought surfaced in his mind, one of the black-robed people abruptly turned around and stared in the direction he was hiding. The person then started walking in his direction.</p><br/><p>Jin Yi was stunned. His ability to conceal himself wasn’t bad, and he was so far away as well. How had this person sensed him?</p><br/><p>Jin Yi’s heart started pounding nervously as that person got closer.</p><br/><p>Just when the black robed person was so close that he was almost within reach, Jin Yi suddenly felt a tug on his back, then he was dragged backwards.</p><br/><p>He didn’t resist because he already saw the person that was pulling him.</p><br/><p>“Alliance Head Li, didn’t you guys already leave?” Once that figure in black faded into the distance, Jin Yi finally couldn’t stop himself from quietly asking his questions.</p><br/><p>Tang Doudou didn’t reply. Once she dragged him to where Baili Yu was, she threw him onto the ground and ran to Baili Yu.</p><br/><p>“My guess was right, those black-clothed people were waiting for us outside the secret passage. They’re the only ones who can move so fast and accurately predict what route we were going to take.”</p><br/><p>“Who are they?” asked Baili Yu.</p><br/><p>Tang Doudou gave him a simple rundown of the Seven Great Saint Tribes, then had him wait while she walked to Jin Yi.</p><br/><p>“Jin Yi, are you still able to contact the people we’re supposed to meet up with?”</p><br/><p>Jin Yi also heard Tang Doudou’s explanation and was bewildered. What Seven Great Saint Tribes? Why hadn’t he ever heard of them? He was still mulling over this information, so he was startled by this sudden question. When he came back to his senses and saw that Tang Doudou seemed annoyed, he hastily said, “I’ll try right away!”</p><br/><p>“If you don’t want to die, then hurry,” urged Tang Doudou.</p><br/><p>Jin Yi hastily took out a signal flare and prepared to fire it.</p><br/><p>Tang Doudou kicked it away and quietly cursed, “Do you want to die?”</p><br/><p>A trace of anger flashed through Jin Yi’s eyes. Wasn’t she the one that told him to do this?</p><br/><p>When Tang Doudou saw that he was angry, she laughed coldly. “You want to fire a flare? Are you worried that no one will know where you are?”</p><br/><p>After she said that, her eyes turned cold. It seemed that it really wasn’t possible to rely on Gu Xun’s people. They couldn’t stay here any longer, that black-robed person from earlier might already be coming after them.</p><br/><p>When Tang Doudou’s thoughts got to here, she reached out and sealed Jin Yi’s pressure points.</p><br/><p>“Alliance Head Li, what are you doing!?” Jin Yi had been caught completely unprepared since he had been stunned by her earlier words. He had a bad premonition now that his movements had been sealed.</p><br/><p>Tang Doudou paid no attention to him as she ripped off part of his garment and stuffed it into his mouth before carrying him towards the side of the road heading downhill.</p><br/><p>“Mmmphff…” What exactly were she trying to do!? Jin Yi was becoming more and more uneasy, but muffled sounds were all he could make. His voice contained fear.</p><br/><p>Tang Doudou sighed softly and said in a low tone, “Actually, I didn’t want to do this either. However, the situation is pressing. If I don’t do this, we won’t be able to escape from those people, so I’m going to have to make you suffer a bit. I don’t think they would trouble an innocent person, and it’s even less likely that they’d kill a person that knows important secrets, so you should be safe for the time being.”</p><br/><p>After saying that, she pushed Jin Yi down the slope.</p><br/>\n</div>"}