{"title": "Chapter 342.2: Lifting a Sign and Begging to be Taken as a Mistress", "id": 342, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3422-lifting-a-sign-and-begging-to-be-taken-as-a-mistress", "volume_title": "Volume 4", "body": "<h1>Chapter 342.2: Lifting a Sign and Begging to be Taken as a Mistress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Steadfast Prince, even if you don’t like this humble girl, you shouldn’t humiliate and insult me this way!” However, the fact that she was able to confess right out on the street meant that she wasn’t a weak and tender woman. Although tears whirled in her eyes, she still gritted her teeth and refuted angrily.</p><br/><p>However, the Steadfast Prince just laughed. “You’re the one who came over to be humiliated by me, but now you’re blaming for insulting you? Say, aren’t you trash?”</p><br/><p>That woman’s eyes widened in disbelief, then her eyes filled with disappointment. She could still accept the earlier words. After all, no one was perfect and she was already much better than many of the women in the world. It was just that the Steadfast Prince, who has always sought perfection, couldn’t accept those few flaws.</p><br/><p>In addition, he had even praised her courage and gotten off his palanquin to speak to her. These two factors were enough to make her continue preservering, but unexpectedly, the Steadfast Prince actually said the word ‘trash’!</p><br/><p>And he had directed it straight towards her!</p><br/><p>No matter how strong she was, she couldn’t take it and started sobbing.</p><br/><p>That sobbing contained so much hurt that Tang Doudou’s heart ached for her. She couldn’t help but feel confused. Could it be that the Steadfast Prince had a grudge against this girl? Otherwise, why would he be so ruthless as to stab her with every single word? If it was a girl whose skin was just a little thinner, she probably would’ve already ran back home to hang herself.</p><br/><p>Uh, she wasn’t trying to snidely insult that woman.</p><br/><p>Meanwhile, that Steadfast Prince didn’t even bother to glance at the woman and just got back into the palanquin. Afterwards, he turned around and asked the person behind him, “Imperial Older Brother, don’t you agree with my words?”</p><br/><p>Imperial Older Brother?</p><br/><p>Tang Doudou’s heart jumped and she tried to look behind the Steadfast Prince, but it was too dark to see who it was.</p><br/><p>She wanted to ask Baili Yu who the Imperial Older Brother of the Steadfast Prince was, but then she recalled that he had lost all his memories, so there was no way he would know.</p><br/><p>Since this scene was probably over, she said, “I’m tired, let’s go find an inn.”</p><br/><p>Baili Yu usually went with everything she decided, so he immediately nodded and held her hand to leave.</p><br/><p>However, before they even took a step, the so-called Imperial Older Brother spoke. “Ah Yin, let’s return to the residence.”</p><br/><p>This voice!</p><br/><p>Tang Doudou pulled Baili Yu and indicated with her eyes for him not to move.</p><br/><p>“What are you worried about? Imperial Older Brother, it’s a rare for you to visit my Green Maple City. As the master of Green Maple City, of course I must act as host and properly welcome Imperial Older Brother, no? Although this woman doesn’t suit my tastes, I feel that she suits you quite well, so why don’t I just accept her for you? Once you return to your residence, I’ll send her directly over?” This Steadfast Prince turned out to be quite unrestrained. He seriously said whatever he wanted to.</p><br/><p>However, it made sense since this was his territory and no one could do anything to him.</p><br/><p>“Ah Yin, stop messing around. This lady is also someone from a good family. Even if you don’t like her, you shouldn’t purposefully hurt her with your words. If people actually took you seriously, how is that lady supposed to get married in the future?”</p><br/><p>Tang Doudou finally heard the voice clearly. Xiqiu Yue was sitting in this Steadfast Prince’s palanquin!</p><br/><p>“Could it be that Imperial Older Brother doesn’t like this lady with the very big chest? But your residence is always so empty. Why don’t you hurry and just take some so that when it gets lonely at night…” The Steadfast Prince continued to say whatever came to mind without restraint.</p><br/><p>Xiqiu Yue angrily interrupted. “If you don’t want me to help you, I’ll leave right now!”</p><br/><p>The Steadfast Prince only stopped after this threat. He waved dispiritedly. “Then forget it.”</p><br/><p>After he waved, guards immediately ran forward to drag the crying girl to the side of the street in order to clear the path.</p><br/><p>The girl was crying so hard that she seemed almost on her last breath. She was limp like a corpse as the guards dragged her to the side. The guards were also like their master and showed no tender feelings for the fairer sex as they simply threw her onto the ground and left.</p><br/><p>Coincidentally, the girl was thrown right where Tang Doudou and Baili Yu were standing. The two shared a look and saw that neither of them had any intentions of getting involved, so they prepared to leave.</p><br/><p>However, just as Tang Doudou took a step forward, her skirt was grabbed. That abrupt, strong force almost caused her to fall to the ground. Fortunately, Baili Yu was right next to her and caught her.</p><br/><p>They glanced down and saw that the woman who had been crying heartbrokenly just a moment earlier was now pulling Tang Doudou’s skirt.</p><br/><p>Baili Yu’s gaze turned cold when he saw that she was grabbing Tang Doudou’s skirt tightly. “Let go.”</p><br/><p>That woman turned towards Tang Doudou with a beseeching look. “This aunt, can you please help this humble girl?”</p><br/><p>Of course, Tang Doudou refused. “Lady, I’m really sorry, but as you can see, I’m already very old. Although I have the desire, I don’t have the strength. Please let go and allow me to leave!”</p><br/><p>“Aunt, I can tell from the looks of you that you’re a good person, so please help me!” When Tang Doudou straightforwardly rejected her, she started sobbing again.</p><br/><p>As she sobbed, she said, “I’m actually from very far away and I’ve spent all my money to get here. The road back is so long and far…”</p><br/><p>Why did these words sound so familiar? It sounded like she was lifting a sign and begging to be taken as a mistress?</p><br/><p>__________</p><br/>\n</div>"}