{"title": "Chapter 356.2: Baili Yu’s Family", "id": 356, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3562-baili-yu%E2%80%99s-family", "volume_title": "Volume 4", "body": "<h1>Chapter 356.2: Baili Yu’s Family</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Baili Yiling was also taken aback for a moment. However, when she got a clear look at this person, she greeted him sweetly, “Ninth Uncle! Why didn’t you say anything? You almost scared us to death!”</p><br/><p>Ninth Uncle?</p><br/><p>Tang Doudou had question marks in both eyes. This person was clearly Shen Moru, how had he become Baili Yiling’s Ninth Uncle?</p><br/><p>Baili Yiling seemed to sense her confusion, because she then introduced them. “Sister-in-Law, don’t be scared. Ninth Uncle isn’t Shen Moru, they only look a little alike. However, it’s not strange because they’re related, right, Ninth Uncle?”</p><br/><p>“En.” The man being addressed as Ninth Uncle replied softly before turning to look at Tang Doudou. “This is your big brother’s wife?”</p><br/><p>“That’s right! Ninth Uncle, don’t you think that Big Brother’s taste is really good? Isn’t my sister-in-law a beauty capable of toppling a city and making the moon feel ashamed?”</p><br/><p>“She’s a good match for your big brother,” replied Ninth Uncle.</p><br/><p>Baili Yiling’s smile immediately widened even more. She pulled Tang Doudou and said excitedly, “Sister-in-Law, Ninth Uncle just praised you! Hurry and call him Ninth Uncle!”</p><br/><p>Fudge, a wife had to meet her in-laws sooner or later, but she had never heard of a sister-in-law being the one to introduce the in-laws.</p><br/><p>She silently complained. Fudge, Yiling should have warned her! If she had known that they were here to see Baili Yu’s relatives, she would’ve changed before heading over.</p><br/><p>“Sister-in-Law.” When Baili Yiling saw that Tang Doudou was spacing out, she tugged on Tang Doudou’s clothes and quietly prompted her.</p><br/><p>Tang Doudou came back to her senses. Just as she was about to greet the man, that Ninth Uncle turned and walked forward. “Let’s go, the tribesmen are waiting for you two.”</p><br/><p>Once he walked a bit further away, Tang Doudou lowered her voice and asked, “Why does it feel like your ninth uncle is a little weird?”</p><br/><p>“He’s always been like this, don’t mind it.”</p><br/><p>“When did he arrive earlier? Did he hear what we said about your brother losing his memories? Yiling, I can’t help but feel uneasy.” She pressed on her chest. She didn’t know if it was the location or the fact that Ninth Uncle looked so much like Shen Moru, but she felt very uneasy.</p><br/><p>Baili Yiling was walking ahead of Tang Doudou so she didn’t notice Tang Doudou’s abnormality. She walked for quite a while before she realized that there were no footsteps coming from behind her and turned around to check. When she saw that there was no trace of Tang Doudou, she immediately became flustered. “Sister-in-Law!”</p><br/><p>“Sister-in-Law!” Baili Yiling’s face turned pale. This sinkhole wasn’t some place to play in. Just a single wrong step could claim one’s life because this place was filled with traps that the tribesmen had set.</p><br/><p>Baili Yiling didn’t dare to run around to look on her own either. She gritted her teeth. The best choice right now was to find Ninth Uncle and the rest so that they could help her look.</p><br/><p>Hopefully they’d make it in time!</p><br/><p>Not long after she left, Tang Doudou climbed out of the underbrush dizzily. She rubbed her pulsing temples. Why did she faint?</p><br/><p>When she looked around, she saw that Baili Yiling was nowhere in sight. That girl couldn’t have left her here, right?</p><br/><p>Fudge!</p><br/><p>The reason she fainted was probably because this place was too strange. It was definitely due to radiation. However, why did it seem like Baili Yiling and the other tribesmen weren’t affected at all? This wouldn’t do, she had to hurry and find Yiling, then leave.</p><br/><p>Just as she was about to start walking, she realized that someone was in front of her. She stopped and looked towards person walking to her with a confused frown. “Ninth Uncle?”</p><br/><p>“You have no right to call me that way.”</p><br/><p>Ninth Uncle’s tone was still mild like before, but it contained faint hostility. Tang Doudou found it strange. Why was he hostile towards her?</p><br/><p>“Ninth Uncle, this seems to be the first time that we’ve met? Nothing has happened between us before, right?”</p><br/><p>Ninth Uncle’s expression turned dark and he snarled, “Scram!”</p><br/><p>Tang Doudou couldn’t help but become pissed off when he was hostile for no reason. “You think I want to come here? If it wasn’t Yiling that brought me here, who would come to this damned gloomy hole? It’s not fit for humans at all!”</p><br/><p>Fudge! If a pregnant woman stayed here for long, it would probably affect their unborn child.</p><br/><p>What exactly was the Baili family thinking, to pick some place like this for seclusion?</p><br/><p>Weren’t they worried at all about their descendants dying out?</p><br/><p>In addition, although Baili Yiling seemed very friendly with them, when Baili Yu talked about being responsible for these people, his expression was filled with pain.</p><br/><p>This tribe that hid themselves from the world like turtles put the burden of their lives on the shoulders of one small child, yet they were acting like it was natural to do so!</p><br/><p>“Wretch! You dared to yell at me?” Ninth Uncle’s eyes turned red from anger when he heard Tang Doudou complaining about this place being unfit for humans. He rushed up and seized her by the throat.</p><br/><p>“If it wasn’t for you, why would Yu er meet with a mishap? It’s all because of you! I’ll kill you!” Ninth Uncle looked insane. The veins on his forehead and the back of his hands were bulging out unnaturally.</p><br/><p>Tang Doudou hadn’t expected for him to suddenly rush up. By the time she managed to react, there was already an echoing hum in her head due to lack of air. She tried to push him away, but her shoves were as useless as if she was hitting an iron wall.</p><br/><p>Could it be that she was going to die here?</p><br/><p>After surviving so many dangerous situations, she was actually going to die at the entrance of Baili Yu’s home?</p><br/><p>How ironic.</p><br/><p>She was probably the only one in the world who would think about these things at death’s door. Anyone else would be focused on fighting for their life right now.</p><br/><p>“I’ll kill you! I’ll kill you!” Ninth Uncle’s voice reverberated in the spacious sinkhole and bounced back like someone was answering. “I’ll kill you, kill you…”</p><br/><p>Following that, a flustered fearful expression appeared on his face and he hastily released her and retreated backwards while looking around in alarm. His originally oppressive aura instantly disappeared. As the echos of ‘I’ll kill you’ continued, he laced his hands together and started shaking his hands in a begging manner. “It’s not me, it’s not me! Don’t kill me, don’t kill me! It really wasn’t me…”</p><br/><p>Cough cough cough… Tang Doudou pressed on her throat as she gasped for breath. She looked towards Ninth Uncle. His current condition, did he go insane?</p><br/><p>Or was it that he had long already gone insane due to living here?</p><br/><p>Radioactivity tended to affect the brain after all. Tang Doudou got up while leaning against the tree trunk behind her. Even without a mirror, she knew that five clear bruises were definitely forming on her neck. Ninth Uncle had been serious about killing her.</p><br/><p>She couldn’t stay here! She had to get away now!</p><br/><p>As she was thinking this, she kept an eye on Ninth Uncle’s movements and slowly backed away. However, after a few steps, she recalled Baili Yiling. She didn’t know how these people thought of Baili Yiling. Although Baili Yiling had greeted Ninth Uncle very enthusiastically earlier, this Ninth Uncle hadn’t shown much reaction. What if they took things out on Baili Yiling once she left?</p><br/><p>After all, Baili Yiling also wasn’t a true member of the Saint Tribes… pei pei! What as she thinking? Baili Yiling’s brain worked much better than hers! She’d definitely be able to find her way out.</p><br/><p>Tang Doudou rubbed her head, then shook it to try to clear the dizziness. She had to hurry and get away from this Ninth Uncle. Once Baili Yiling realized that she was gone, she’d definitely come back to look for her. It wouldn’t be too late to tell Baili Yiling about these things then.</p><br/><p>“Stop right there! You can’t escape!” As soon as she started to move, Ninth Uncle’s demon-like voice appeared from behind her. Before she could even react, his hand had already landed on her shoulder.</p><br/>\n</div>"}