{"title": "Chapter 374.1: Sharp Opposition", "id": 374, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3741-sharp-opposition", "volume_title": "Volume 4", "body": "<h1>Chapter 374.1: Sharp Opposition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Those opened eyes filled with remaining grievances were vivid in her mind. If she didn’t step out now, she wouldn’t be able to live with herself.</p><br/><p>“Shen Wuming, you demon!” The people next to the dead person was probably the dead person’s peers because they glared at Shen Wuming with tears in their eyes like they wanted to rip him apart. If it weren’t for the people nearby stopping them, they would’ve already rushed at him.</p><br/><p>However, Shen Wuming just expressed contempt and disdain. He humphed lightly, then said in a righteous manner, “To uphold the justice of the martial arts community, killing when needed is the most effective method.”</p><br/><p>“Then how are you any different from the Demonic Sect? Who would believe in someone like you?” The people that originally had some hope in Shen Wuming felt their hearts turn cold when they heard this.</p><br/><p>“How could something dirty like the Demonic Sect be mentioned on equal terms with me?”</p><br/><p>“Isn’t your conduct exactly the same as them?”</p><br/><p>“Haha, whether it’s right or wrong, I naturally have my own measure. It’s not your right to judge.” Shen Wuming laughed lightly, then slowly walked towards the people who were around the stone. His eyes were filled with murderous intent. “You guys also disagree with me?”</p><br/><p>His intense murderous intent caused those people’s faces to pale and they instinctively backed away.</p><br/><p>The reason why Shen Wuming could be so unbridled was because he had very strange martial arts. That couldn’t even be called martial arts! They had no way to defend against his attacks.</p><br/><p>When it seemed that Shen Wuming was about to attack again, one of the people suddenly seemed to recall something and shouted towards Elder Yu, “Elder Yu! Could it be that you’re going to just allow this demon free rein in killing whoever he wants?”</p><br/><p>Elder Yu made to move, but a jade-like hand pressed down on his shoulder. He knew who it was without even turning around.</p><br/><p>However, he couldn’t understand why Bai Feiyun, who had always been known for his benevolent personality on the Jianghu, had suddenly became so cold and detached. In the past, he would bother him about every little thing that was wrong, but now that the martial arts community was being thrown into disarray, he was actually standing by and watching, and he wasn’t even allowing others to get involved.</p><br/><p>Elder Yu couldn’t understand it and Tang Doudou couldn’t either. However, when she saw that hand on Elder Yu’s shoulder, she couldn’t suppress her anger anymore. She shook Xiao Yi off and kicked the door open!</p><br/><p>It was currently very tense outside. The situation was already an armed bow. When those people saw that Elder Yu wasn’t moving, despair appeared in their eyes as well as deep hatred. They hated Shen Wuming, but they hated Elder Yu and Bai Feiyun more…</p><br/><p>However, Shen Wuming seemed unconcerned and smug. What if there was the Jianghu? So what if there was a martial arts community? Weren’t they still right in the palm of his hand right now?</p><br/><p>Everyone originally thought that another bloody massacre would occur, but the situation was suddenly interrupted by a loud boom! Everyone looked towards the door.</p><br/><p>The door had been kicked down. When the dust settled, Tang Doudou’s delicate figure appeared.</p><br/><p>“To kill on my territory, have you asked for my permission?” Tang Doudou glanced coldly at Shen Wuming. She seemed like a completely different person. At this time, she emitted a shockingly baleful aura from her entire body.</p><br/><p>What was with her?</p><br/><p>Xiao Ren and Xiao Yi who had just eaten a mouthful of dust shared a glance, then shook their heads. They couldn’t understand how Tang Doudou managed to suddenly emit such a baleful aura.</p><br/><p>Since she was the martial arts alliance head, she should be practicing the orthodox martial arts, so how come her aura was so dark?</p><br/><p>It wasn’t just Xiao Yi and Xiao Ren that were curious, everyone else present were also very curious.</p><br/><p>Meanwhile, Tang Doudou was oblivious to her own situation. She was just furious to the point that she wanted to kill someone.</p><br/><p>Tang Doudou’s sudden appearance shocked everyone.</p><br/><p>Bai Feiyun was the only one that exhibited no surprise. After glancing at her, he let Elder Yu go.</p><br/><p>When Tang Doudou kicked down the door, Shen Wuming who had been about to attack again froze in surprise. However, when he saw Tang Doudou, his smug expression was replaced by a very contorted and sinister expression, but it vanished after just a moment. He folded his hands behind his back and turned around. “Alliance Head Li, you’ve finally come out.”</p><br/><p>Tang Doudou walked slowly down the stairs and everyone moved to the side to open a path for her. However, when she got down far enough, she stopped walking and just stood there on the steps without even glancing at Shen Wuming. “Where did these cats and dogs come from? Their yipping and yapping is so noisy!”</p><br/><p>Wasn’t he unbridled?</p><br/><p>Then she’ll be even more unbridled!</p><br/><p>Let’s see who can be the most unbridled!</p><br/><p>Tang Doudou was already satisfied with the fact that she had managed to stop Shen Wuming from killing someone else. As for whether she would be able to successfully deal with Shen Wuming, that hadn’t been something she considered.</p><br/><p>Her unbridled manner naturally infuriated Shen Wuming. However, he wasn’t a normal person and didn’t allow the anger to get the better of him. Instead, he got straight to the point and asked, “Alliance Head Li, since you’ve decided to hide yourself in this crappy place, does that mean you no longer want to deal with the matters of the Jianghu? If that’s the case, we’ll have to trouble you to give your position to someone more suitable!”</p><br/><p>Tang Doudou continued to ignore him and looked towards the people near the corpse coldly. “How did he die?”</p><br/><p>Those people snapped out of their amazement and started running towards Tang Doudou while crying, “Junior Brother Meng’s death was unjust! Alliance Head, you must get justice for Junior Brother Meng ah!”</p><br/><p>“It was Shen Wuming! Shen Wuming is slaughtering the innocent!”</p><br/><p>“My pitiful junior brother ah!”</p><br/><p>“He wanted to kill us too! It’s fortunate that Alliance Head Li came out just in time! Otherwise, we would’ve already, already…”</p><br/><p>Tang Doudou’s expression gradually turned darker when she heard this and the baleful aura surrounding her became even stronger. The people who originally wanted to head over to support her couldn’t help but back away when they sensed this aura and looked towards her in bewilderment.</p><br/><p>Tang Doudou had taken off the human skin mask and those worn-out garments right after she went in. Right now, she was dressed in a snow-white garment. As the autumn breeze blew past, the sight of her was like the untainted pure snow of morning. Her black hair was swept back in a simple ponytail and her sharp fringe somehow added an indescribable flavor. Her bright eyes that were below stray strands of hair were currently as cold as frost.</p><br/><p>It was just one simple standing figure, yet it seemed to be the container of inexhaustible power.</p><br/><p>Bai Feiyun’s eyes dilated and his heart started pounding. Wasn’t this precisely her?</p><br/><p>Could it be that he had been wrong?</p><br/>\n</div>"}