{"title": "Chapter 375.2: Where Did This Young Man Come From?", "id": 375, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3752-where-did-this-young-man-come-from", "volume_title": "Volume 4", "body": "<h1>Chapter 375.2: Where Did This Young Man Come From?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tang Doudou felt like a bunch of crows were flying past the back of her head. The emotion of embarrassment that she hadn’t felt for a long time was tugged out by this guy.</p><br/><p>She felt like her world had widened. There actually existed an idiot that was better than her at making up nonsense.</p><br/><p>Meanwhile, although Shen Wuming still looked unperturbed, he was inwardly coughing up blood from that youngster’s accusation.</p><br/><p>He admitted that he was a bad person, but it wasn’t to that degree!</p><br/><p>Does that chain of descriptions even describe a human?</p><br/><p>When Shen Wuming’s thoughts got to this point, he became even more angry and he stopped circling the young man.</p><br/><p>“Aiy! Are you about to make a move?” The young man really had sharp eyes. He had been gazing sorrowfully towards the sky, but the moment Shen Wuming stopped moving, he turned around and started twirling the dagger.</p><br/><p>This young man had been the one that said that he would avenge his family, but he ended up spending half the day talking. Now that Shen Wuming seemed about to make a move, he seemed very excited, but he also didn’t move into a more guarded position.</p><br/><p>There was no point talking to someone like this. Attempts to talk would just make the situation worse, it would be best to just decide things with force.</p><br/><p>Shen Wuming had lived for over half a lifetime and was very clear on this, which was why he didn’t bother to argue back. He lifted the antique lamp with one hand while biting down on the thumb of his other hand, then he sprayed the blood on the antique lamp. The lamp’s light immediately increased greatly, but everywhere the light hit, the temperature actually dropped.</p><br/><p>“You’re coughing blood? It seems your internal heat is severe!” A lot of people started holding their breath nervously when Shen Wuming did this, but the young man seemed completely unconcerned. He was still playing with the completely ordinary dagger as if he didn’t feel the murderous intent directly towards him.</p><br/><p>“Old people, you know, should just go home and stay home to tend to flowers, drink tea, take walks… Wait, no, you’re the person I need to kill. I shouldn’t say this to you, I should say this to other people!” The young man looked around. When he saw Elder Yu, he pointed over with his dagger. “Aiy, that old man over there, yes, I’m talking about you! You’re already so old, so stop mingling with the kids, alright? If you end up being irritated too much, you’ll ruin your own health from the internal heat! That wouldn’t be fun, right?”</p><br/><p>After saying that, he pointed towards the master of the Xiao family. “And you, your face is so taut it looks like it belongs in a coffin! People who don’t know the situation would think that someone in your family died! Such a unlucky aura ah!”</p><br/><p>Even from such a distance, Tang Doudou seemed to see the Xiao family master’s face twitch. Another portion of murderous intent was directed in this direction, but the young man didn’t seem to notice and continued pointing out several other aged and rather reputable people to nag at. His words contained no trace of propriety and no one paid attention to him either.</p><br/><p>So finally, he remarked that it was boring and turned towards Tang Doudou again. “Aiy, Alliance Head Li, please do consider what I said earlier about repaying with my body, alright? My looks aren’t inferior to Baili Yu’s after all, right?”</p><br/><p>Tang Doudou also turned to look towards the sky and ignored the guy.</p><br/><p>The young man had already talked his mouth dry, but Shen Wuming still hadn’t made a move, so he became annoyed. “Are you going to fight or not?”</p><br/><p>Tang Doudou saw out of the corner of her eye that Shen Wuming’s fingers trembled and he almost dropped the lamp.</p><br/><p>She shook her head sympathetically. Shen Wuming had definitely gotten severe internal injuries already just from this guy’s words. His oppressive aura had decreased by a huge amount so the outcome of this situation seemed clear.</p><br/><p>In addition, she saw that a lot of the influential powers had already sent people out to investigate this young man’s background.</p><br/><p>When Tang Doudou saw this, she subconsciously felt for the jade skull tied around her wrist. She should hurry and find a time to meet up with the hidden guards of the Demonic Sect. If they could help her investigate and obtain news, that would be much more efficient than her trying to gather information on her own.</p><br/><p>After Shen Wuming offered his blood to the lamp, the blue light grew increasingly intense. It seemed to finally reach a limit now, and he also seemed unable to hold back his rage anymore as he attacked the young man with the lamp. The eerie blue light seemed to leave afterimages as it traveled towards the young man from all sides.</p><br/><p>The young man feigned seriousness and started moving into a basic defensive position but couldn’t get it right. Finally, he muttered that it was too ugly and went back to just standing normally.</p><br/><p>Everyone was made speechless.</p><br/><p>Meanwhile, Shen Wuming’s attack had already reached the young man. Everyone held their breath and watched with wide eyes to see how the young man would deal with Shen Wuming’s carefully prepared attack.</p><br/><p>However, after all that waiting, there was no sharp glint of a blade or some flashy burst of inner strength… The young man just lifted his leg and kicked up in a casual but also extremely graceful manner. His impeccably clean black boot, in this manner, reached Shen Wuming’s eye level.</p><br/><p>He purposefully dangled it a little provocatively, then kicked Shen Wuming’s chin.</p><br/><p>Shen Wuming couldn’t even make a sound and was sent crashing to the ground with all four limbs prostate. The strange light disappeared and the lamp fell to the side.</p><br/><p>Meanwhile, the young man said with an amused laugh, “How weak, I didn’t even use force and he already fainted? How boring ah! So so boring!”</p><br/><p>After he said that, he threw the dagger next to Shen Wuming and said sadly, “Ah Cai ah, Ah Cai, I’ve already helped you deal with the bad guy that bullied you and killed you. You can rest in peace now…”</p><br/><p>When he started jabbering on again, everyone finally snapped out of the shock and looked towards him again in alarm. Who exactly was he?</p><br/><p>“Aiy, as for that little female doggie from the neighboring village, I made the decision to send her to another little male doggie, so ah! Don’t worry about her and go reincarnate properly! Find a good family, don’t reincarnate as a dog again, alright? It’s seriously too sad.” The young man didn’t care about all the eyes that were on him and continued talking and fake sobbing by himself.</p><br/><p>Shen Wuming had fainted, but no one moved up to take a look at him.</p><br/><p>Tang Doudou stopped looking at Shen Wuming as well and looked at the young man instead. If she took this talented young man as a subordinate, he’ll definitely became a strong leader!</p><br/><p>She had already decided earlier that she had to establish her own influential power, so she started thinking about recruiting. There was also the fact that this young man’s style and temper were very much to her tastes, so she decided to recruit him.</p><br/><p>Everyone was still stuck on the fact that he had dealt with Shen Wuming with one kick and wasn’t paying attention to anything he was saying, so Tang Doudou decided to help him with his act in order to get on friendlier terms. “From what you’re saying, the Ah Cai that Shen Wuming humiliated and killed is a dog?”</p><br/><p>The young man seemed vexed that no one was paying attention to him, so when he heard this, his eyes immediately lit up. He jogged towards Tang Doudou as he said, “That’s right, that’s right! Alliance Head Li is truly exceptionally intelligent and wise! I didn’t even state this outright but you already understand what I meant! Say, doesn’t this mean that our hearts are linked?”</p><br/><p>After he said that, he moved closer to Tang Doudou and fluttered his eyelashes at her. “Alliance Head Li, take a good look. I’m really no worse than your Baili Yu, so please consider taking a concubine?”</p><br/><p>Tang Doudou was just about to mock his very blocky face when she saw him pull off the human skin mask with a mischievous smile.</p><br/>\n</div>"}