{"title": "Chapter 379.1: Butt-Naked Intelligence", "id": 379, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3791-butt-naked-intelligence", "volume_title": "Volume 4", "body": "<h1>Chapter 379.1: Butt-Naked Intelligence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bai Feiyun clearly hadn’t expected for Tang Doudou to move so fast. He thought that she would try to delay things until Baili Yu got back before heading out. She only dared to act so unbridled when that person was by her side after all.</p><br/><p>“Many thanks, Young Master Jun, for telling me. It seems that I should head to Barbarian Mound Garrison to look for her.” Bai Feiyun smiled faintly and was about to turn when he sensed a burst of movement. His expression turned serious and his figure quickly moved with a flash to the center of the courtyard. He looked back at Jun Xin who was casually lowering his fist and asked, “What does Young Master Jun mean by this?”</p><br/><p>Jun Xin laughed. “Nothing much. I just wanted to exchange some pointers with Bai gongzi.”</p><br/><p>Bai Feiyun’s expression didn’t change. He continued looking at Jun Xin, then said slowly, “You’re blaming me for that injury from last time.”</p><br/><p>“Bai gongzi had helped treat my injury last time. I can’t even thank you enough, how could I blame you?” Jun Xin smoothed away some of his loose hair as he silently remarked that this fake gentleman was actually pretty sharp.</p><br/><p>Bai Feiyun said, “If Young Master Jun holds a grudge against me because of that matter, there’s no need to try to talk around the matter. This one won’t deny it.”</p><br/><p>Jun Xin inwardly scoffed. All smart people didn’t bother to deny what they did. “Bai gongzi is truly refreshingly straightforward, however! I really don’t mean to blame you, I’m just curious, you see. There’s no past grudges between us, but Bai gongzi actually used the third of the ten strangest poisons on me. In my free time, I couldn’t help but be puzzled over it. Although I’m not that good of a person, it’s not to the point that everyone in the world wants to kill me, right?”</p><br/><p>The reason he put things this way was because he wanted Bai Feiyun to explain why he used the poison. However, Bai Feiyun just said, “Young Master Jun is putting things too heavily.”</p><br/><p>Jun Xin couldn’t help but be irritated. If it weren’t for the fact that he ate the heart of the Black Demonic Nightcrawler and became immune to a hundred poisons, he probably would’ve died the moment the poison was applied to his arm.</p><br/><p>That wasn’t an ordinary poison. All ten of the ten strangest poisons were highly toxic and travel through the bloodstream in seconds. Many of the antidotes have already been lost to history, so it was absolutely fatal.</p><br/><p>He had already put this fatal poison lightly, so how could it be said that he put things too heavily?</p><br/><p>However, it then occurred to him that although the poison was fatal, it wouldn’t do much to someone who was immune to a hundred poisons, so the way he put it was a little heavy.</p><br/><p>In the blink of an eye, he had already figured out the crux of the matter and was a little surprised. “Bai gongzi knows that I’m immune to a hundred poisons?”</p><br/><p>“When I was treating your injury, I saw that your blood was a little strange so I figured out that you were immune to a hundred poisons.”</p><br/><p>“Even if I’m immune, your conduct is still to strange.” Jun Xin glanced at Bai Feiyun as he rubbed his chin. If he asked straight out what it was that caused his change, would he answer?</p><br/><p>Bai Feiyun laughed softly. “This one truly was a little rash in doing that.”</p><br/><p>“You don’t plan to explain?” Jun Xin’s intuition told him that Bai Feiyun’s strange actions were definitely related to this moment.</p><br/><p>“I don’t plan to explain. If Young Master Jun is still angry, you can just poison this one.”</p><br/><p>He sure had guts!</p><br/><p>Any of the poisons in Jun Xin’s possession could cause instant death. After all, how could the ten strangest poisons compare to the strange poisons of the Seven Great Saint Tribes?</p><br/><p>It was obvious from the examples of the Disseminating Tassel Fragrance and the Hoarfrost Poison that most of these poisons truly had no antidotes.</p><br/><p>Jun Xin chuckled. It seemed that he wouldn’t be able to get answers today. Since he still needed to follow after Tang Doudou, he just gave a disdainful humph and said, “Am I that sort of person?”</p><br/><p>Bai Feiyun smiled and sorted out his clothes slightly before cupping his fist in salute. “If there’s nothing else, this one will be leaving.”</p><br/><p>Then he gracefully turned and had Xiao Ren and Xiao Yi open the doors. It was only after his figure disappeared into the bamboo forest that Jun Xin looked away.</p><br/><p>What exactly was Bai Feiyun‘s true personality like?</p><br/><p>Outside of Azure Water Valley, a large orderly procession that was scarlet, then purple, then deeper colors was moving through the endless sea of flowers. It was beautiful, except for the random mix of other colors in this otherwise harmonious procession.</p><br/><p>Tang Doudou, who was riding on a horse with the heads of the four large clans, glanced back at the undisciplined Murong family from time to time and frowned slightly.</p><br/><p>On her left was Bai Luoqing. Her beautiful hazy eyes were looking in this direction. When she saw that Tang Doudou had glanced back multiple times, she asked with a delicate laugh, “Alliance Head, are you reluctant to leave Azure Water Valley? You’ve turned back so many times that I feel bad for making you leave.”</p><br/><p>The silence that had hung over them this entire time was disrupted by Bai Luoqing’s voice. Tang Doudou looked towards her. Intuition told her that Bai Luoqing had intentions towards her.</p><br/><p>Of course, it wasn’t romantic intentions. She seemed to be trying to make a good impression in order to get something from her.</p><br/><p>However, she also seemed reluctant about it, so she had also been trying to cause a bit of trouble for her from time to time. Tang Doudou could sometimes see a conflicted expression in Bai Luoqing’s eyes.</p><br/><p>But when she thought about it, she and Bai Luoqing lived completely different lives and had never interacted with each other before. As the master of the Bai Clan, there was nothing that Bai Luoqing wanted that she couldn’t have. In comparison, she was just a commander in name that happened to get an honorable title. Other than that, she had nothing.</p><br/><p>So Tang Doudou was mulling over what exactly Bai Luoqing was trying to get from her when she heard another amused remark. “I think it’s that Alliance Head can’t bear to leave Baili gongzi, right?”</p><br/><p>She glanced back and saw that Lin Shuxuan had caught up with them. Next to him was Xiao Siyuan and Xiao Yi.</p><br/><p>Xiao Siyuan gave her a polite smile as if he had already forgotten about how she sealed his pressure points that night.</p><br/><p>Meanwhile, Xiao Yi kept glancing at her with a strange expression as if he felt guilty about something but didn’t want to face it.</p><br/><p>There was also a very quiet young man with them. He seemed younger than the other three but the feeling he gave off was that he was much more mature and reserved.</p><br/><p>She immediately came to the conclusion that this young man was from the Murong family since that gloominess seemed to be a trademark of the Murong family.</p><br/><p>However, due to the fact that this young man wasn’t very old, that trace of gloominess wasn’t very off putting and seemed more like worry. In addition, he had a tear-shaped mole at the corner of his eye, so it just made him seem doleful.</p><br/><p>Since she hadn’t seen this young man before and he was a little unique, she couldn’t help but take a couple more glances. However, those few looks actually made the young man’s face turn red. Xiao Siyuan said something and he hastily went back to the Murong family group and stayed there without daring to look this way.</p><br/><p>Tang Doudou didn’t know whether to laugh or cry as she touched her own face.</p><br/>\n</div>"}