{"title": "Chapter 384.2: Big Brother Baili", "id": 384, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3842-big-brother-baili", "volume_title": "Volume 4", "body": "<h1>Chapter 384.2: Big Brother Baili</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Why did she leave?</p><br/><p>Everyone shared a look. Could it be that the opponent was too strong so she ran?</p><br/><p>“Alliance Head went to chase that person!”</p><br/><p>At this moment, a person dressed in graceful white walked into the courtyard. It was Bai Feiyun.</p><br/><p>The crowd reacted to him like he was a relative and enthusiastically greeted him while asking him what happened.</p><br/><p>“I don’t know the details, so we had better wait for Alliance Head to come back,” said Bai Feiyun.</p><br/><p>However, a lot of people didn’t have a lot of confidence in this. That person was so strong, would Tang Doudou even be able to make it back?</p><br/><p>Bai Feiyun could tell what they were thinking by the looks on their faces, but he didn’t bother to explain further and just walked towards Elder Yu. After nodded towards him, he went to take a look at the corpses.</p><br/><p>He crouched down, then reached out and pinched one of the pink flower petals. His long eyelashes concealed his eyes from view so no one could see his expression. After staring at the petal for a long time, he placed it back.</p><br/><p>“Arrange for people to guard these corpses. Don’t touch them and don’t lose them!” said Bai Feiyun.</p><br/><p>Some people were puzzled and asked, “Why do we need to keep an eye on the corpses?”</p><br/><p>“And how long do we need to guard them? What if that murderer comes back for them?”</p><br/><p>In the past, that murderer would always take the corpses of the people he killed, so this time was actually out of the ordinary.</p><br/><p>Bai Feiyun said, “It won’t be for that long, just until Alliance Head comes back.”</p><br/><p>There were only two possible ways that Tang Doudou could come back. Either she caught that person and subdued him, or that she couldn’t catch him and was shaken off.</p><br/><p>So if they guarded the corpses until Tang Doudou came back, there would be no need to worry about that murderer coming back to snatch the corpses because he’d have his hands too full.</p><br/><p>Everyone nodded. Several people stepped up to the task. After Bai Feiyun instructed them a little, he had Elder Yu arrange for everyone else to head back to rest.</p><br/><p>There was no point staying here, so everyone put away their weapons and headed back to their own rooms.</p><br/><p>Bai Feiyun and Elder Yu shared a glance, then headed to the study together. Bai Feiyun seemed even more familiar with this courtyard than Elder Yu.</p><br/><p>It was like he was the owner while Elder Yu was the guest.</p><br/><p>The courtyard was calm again, but Tang Doudou was in unspeakable agony.</p><br/><p>Those people had probably mistakenly come to the conclusion that she had gone to chase after the murderer, but the truth was, she was running from the murderer!</p><br/><p>She had been driven to this desolated forest. It was so quiet that there wasn’t even the chirping of birds.</p><br/><p>However, she couldn’t stop since that murderous intent was still locked onto her. It felt like if she paused for even a moment, that person would kill her.</p><br/><p>Just as she was internally crying over this, that murderous intent suddenly disappeared.</p><br/><p>There was no way that he suddenly left. Something must have happened.</p><br/><p>Tang Doudou didn’t dare to relax and continued moving forward. As she walked, she suddenly heard the splash of water.</p><br/><p>Following that, there was the sound of a young girl’s cry of alarm. “Help! Someone, please help! Big Brother Baili has fallen into the lake!”</p><br/><p>Big Brother Baili?</p><br/><p>Baili Yu?</p><br/><p>Tang Doudou’s mind went blank. She couldn’t understand what was happening. He had disappeared earlier in the morning, how did he end up here?</p><br/><p>And he was with a woman?</p><br/><p>He fell into the lake? Was that even possible with his martial arts?</p><br/><p>Tang Doudou started moving faster because she was curious and the gleaming lake soon came into view.</p><br/><p>The young girl that was screaming was on the shore and in front of her, in the water, there was someone flailing in the water frantically. His head kept bobbing in and out of the water and he seemed almost out of strength.</p><br/><p>Upon seeing this, Tang Doudou couldn’t be bothered to worry about whether or not this was Baili Yu, saving a life was more important. She flew over and landed lightly on the surface of the water as she bent over to grab that man’s hand and pulled him towards the shore.</p><br/><p>The first thing she did when she got onshore was flip him over to take a look at his face. Although he also had extraordinary looks, he wasn’t Baili Yu. She sighed in relief and threw him onshore.</p><br/><p>The young girl on the shore was already crying from panic. When she saw this, she immediately ran over, pushed Tang Doudou aside, and started shaking the man frantically. “Big Brother Baili, Big Brother Baili! You can’t die!</p><br/><p>“Big Brother Baili, if you die, what is Yu er supposed to do?</p><br/><p>“Big Brother Baili!”</p><br/><p>Tang Doudou couldn’t help but feel uncomfortable with the way the girl kept sweetly calling out Big Brother Baili. She pushed aside the young girl and said, “If you keep shaking him this way, even if he was originally fine, you’d shake him to death!”</p><br/>\n</div>"}