{"title": "Chapter 391.1: It was Bai Feiyun", "id": 391, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3911-it-was-bai-feiyun", "volume_title": "Volume 4", "body": "<h1>Chapter 391.1: It was Bai Feiyun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>What Tang Doudou said stunned Elder Yu. She wanted him to go?</p><br/><p>“Alliance Head…”</p><br/><p>“This is no small matter, so I’ll have to trouble Elder Yu to personally make a trip. I can’t really be at ease leaving this matter to someone else,” said Tang Doudou solemnly as if she viewed this matter very seriously. However, the amusement in her eyes gave her away. It was time for this old guy to exercise a little.</p><br/><p>Elder Yu was still too stunned to notice that look in her eyes. When he heard Tang Doudou say that she didn’t feel at ease leaving this to someone else, shrewd light flashed in his eyes. Could it be that since he listened to Bai Feiyun this time and supported her in being alliance head, he managed to gain her trust?</p><br/><p>As expected of women, they couldn’t even tell when someone was just being polite on the surface. If she continued trusting people this easily, she’d meet her downfall sooner or later.</p><br/><p>However, this was also pretty good. Now that he had obtained her trust, it’d be easier for him to carry out his plans.</p><br/><p>Of course Tang Doudou caught that shrewd look in his eyes. She couldn’t help but laugh. This Elder Yu seriously doesn’t give up.</p><br/><p>“This old man is honored that Alliance Head has such faith in this old man. This old man is too moved to say anything, so this old man will go now to find the clan masters!” Elder Yu acted as if he was so moved, he was besides himself with joy.</p><br/><p>Tang Doudou smiled slightly. “Alright, have a safe trip.”</p><br/><p>After Elder Yu left, everyone discussed for a little more before heading to where the corpses were with Tang Doudou.</p><br/><p>The conditions of the corpses were unbearable to look at. The fatal wound was at the chest, where the flower petals were embedded.</p><br/><p>Although it was just a thin petal, it seemed like the sharpest weapon on earth. It had pierced through the person’s chest from the back and come out through the front, severing the person’s main artery and causing him to cough up a large amount of blood that not only dyed his clothes red, but also gathered into a puddle on the ground.</p><br/><p>After dying, black blood flowed out of his body, showing that the petal was also poisoned.</p><br/><p>Tang Doudou forced down the uncomfortable feeling in her gut and glanced at the corpses. In reality, there was no need to look. It was definitely the mysterious person that did this, so once they caught him, they would be able to know his identity.</p><br/><p>However, for the sake of reassuring these people and more importantly, making sure that they didn’t start suspecting Baili Yu, Tang Doudou furrowed her brows and started mumbling to herself in a volume that was loud enough for everyone to hear. “That’s not right, that’s off. The important point isn’t here. These petals are probably a distraction. When I fought with him earlier, he didn’t even use flower petals as a weapon!”</p><br/><p>Everyone’s eyes lit up. It was no wonder why they hadn’t been able to figure out the identity of the murderer! So it turned out that they were thinking along the wrong lines. These flower petals were here as a distraction!</p><br/><p>It was laughable that they had been puzzling over it for so long.</p><br/><p>Alliance Head was impressive after all. She had been able to see through that person’s trick in just a few moments. With Alliance Head here, this matter could probably be resolved very quickly!</p><br/><p>The whispers behind Tang Doudou didn’t distract her at all. She took out a handkerchief and used it to pick up the flower petal. She turned it left and right, but couldn’t figure out anything off about it.</p><br/><p>“Bai gongzi, you know medicine. Can you help me figure out what poison is on this petal?” Who present knew more about poison then Bai Feiyun?</p><br/><p>Bai Feiyun had been standing right behind her. When he heard this, he replied mildly, “I’ve already looked into it earlier. The poison on the petal is called Spider Lily.”</p><br/><p>“Spider Lily?” The scene of the white sea of spider lilies pop up in Tang Doudou’s mind. It was abnormally clear as if it was engraved into her mind.</p><br/><p>Bai Feiyun answered, “Yes, it’s called Spider Lily. It’s made with the spider lily flower as the main ingredient and then combined with many different poisons in order to make an extremely fatal poison. Just a tiny drop is enough to kill a person. It’s said that the person poisoned would hallucinate before dying and would see their past life, current life, and future. Hence, it’s also called Other Shore.”</p><br/><p>It was an extremely powerful poison that killed upon contact!</p><br/><p>Tang Doudou hastily threw that petal away and allowed it to drift to the ground. She patted her chest to calm her fears and asked, “Why didn’t you tell me earlier that it was this poisonous?”</p><br/><p>“Alliance Head seemed so focused, so I thought that Alliance Head recognized this poison,” replied Bai Feiyun mildly.</p><br/><p>Tang Doudou was speechless. It wasn’t like he didn’t know her capabilities. If she was able to tell what kind of poison it was just based on the symptoms, then she shouldn’t be called Tang Doudou anymore, she should be called Tang Caicai. (Upgrade from beans to veggies, cai = vegetable.)</p><br/><p>However, she couldn’t very well say what she was thinking in front of so many people. She coughed softly, then asked, “Is this poison rare?”</p><br/><p>Bai Feiyun nodded. He could see that everyone was looking at him curiously, so he slowly approached the corpses and said, “The spider lily is the easiest to find component of the poison. The other components are very hard to gather and some people can’t gather them even if they spend their entire life searching. Even after that, there’s only a one percent chance in successfully making the poison. This poison is ranked second in the Ten Strangest Poisons and has no cure.”</p><br/><p>“The poison works so fast, even if there was a cure, it probably couldn’t be used in time,” remarked Tang Doudou. She was stunned. She never thought the mysterious person actually possessed something this toxic.</p><br/><p>She had heard about the Ten Strangest Poisons from Jun Xin before and also knew that Bai Feiyun had poisoned him with one of them back in Cloud City. However, Jun Xin had put it very lightly so she hadn’t viewed it seriously as well.</p><br/><p>However, when she thought about it now, her back became covered with cold sweat. If Jun Xin hadn’t eaten the Demonic Nightcrawler’s heart and didn’t become immune to poisons, wouldn’t he have died?</p><br/><p>What exactly was Bai Feiyun trying to do?</p><br/><p>Her gaze darkened as she looked towards Bai Feiyun to try to figure out what he was thinking.</p><br/><p>Bai Feiyun sensed her gaze and lifted her eyes to meet her gaze. “From what I’ve heard, there’s only one person that possesses Spider Lily.”</p><br/><p>He didn’t shift his gaze away and looked straight into her eyes. His gaze seemed gentle as the spring wind, but at the same time, seemed to contain a severe wintry chill.</p><br/><p>Tang Doudou’s brows lifted and an uneasy feeling emerged in her heart.</p><br/>\n</div>"}