{"title": "Chapter 398.2: Wind Cloud Map", "id": 398, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-3982-wind-cloud-map", "volume_title": "Volume 4", "body": "<h1>Chapter 398.2: Wind Cloud Map</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>What exactly was the region on the map? Why hadn’t she ever heard of it? Wind cloud, it was wind cloud again. What relationship would it have with Wind Cloud Island?</p><br/><p>This person had gone to Flowing Clouds Manor and called Mu Qingyu by Yu er, so it was clear that they had a close relationship. It was also very likely that this person also belonged to Wind Cloud Island.</p><br/><p>Wind Cloud Island and the Seven Great Saint Tribes have always had a very incompatible relationship. If he was someone of Wind Cloud Island, why was he hanging out with Grandma Shen?</p><br/><p>The countless questions that popped up caused her tired brain to get a headache, so she decided to just not worry about it for the time being. Before, she was too hurt that Jun Xin had died and it only occurred to her now that she should hurry and find a doctor to check Jun Xin so she could find out if the revival pill was working.</p><br/><p>However, a normal doctor probably wouldn’t even know what a revival pill is, much less the signs of whether it was effective.</p><br/><p>This made Tang Doudou’s headache even worse. It seemed that she had no choice but to head back to Azure Water Valley and ask Xiao Yi and Xiao Ren to contact Cang Baicao!</p><br/><p>If she started rushing back now, she’d probably be able to make it back here before night.</p><br/><p>When Tang Doudou’s thoughts got to here, she didn’t pause any longer and hastily got up to start running in the direction of the courtyard. When she got there, she didn’t go in. Instead, she headed straight towards the stables and whistled, then Little Bell happily ran out.</p><br/><p>When he saw Tang Doudou, he intimately rubbed his head against her shoulder.</p><br/><p>Tang Doudou patted Little Bell, then moved Jun Xin onto the horse before jumping up herself. She adjusted Jun Xin again to make sure that he wouldn’t fall off before lifting the whip.</p><br/><p>“Little Bell, to Azure Water Valley!”</p><br/><p>Little Bell lifted his hooves and shot out like he was flying. Soon, he reached the entrance of the garrison.</p><br/><p>The garrison gates had already closed and the guards on night patrol immediately blocked the way when they saw that a horse was rushing over. “Who’s there!? It’s already passed curfew, do you have a warrant for leaving? Hurry and up turn back around!”</p><br/><p>However, how could Tang Doudou possibly turn around?</p><br/><p>She quickly arrived in front of the guard. Her expression was solemn and a little displeased as she looked the guard up and down. “This alliance head has matters to deal with outside the city, hurry up and open the gates! If you end up delaying my work, even if the imperial court protects you, I’ll still kill you guys!”</p><br/><p>The moment the guards heard that it was her, their expressions rapidly changed and they moved aside. The leader hastily shouted, “Hurry and open the gates for Alliance Head Li!”</p><br/><p>After saying that, he turned towards Tang Doudou and wiped at the sweat on his forehead. “This little one truly was blind to not know that you were the Alliance Head. Apologies for the offense earlier, I hope that Alliance Head will forgive this little one’s mistake…”</p><br/><p>However, before he could even finish speaking, Tang Doudou rushed out the moment the gates opened without even bothering to glance at the guard.</p><br/><p>The guard didn’t show any annoyance at being ignored. He wiped his forehead again as he looked at the fading figure. This was the rumored Li Xueyi who was capable of killing without blinking an eye. It was fortunate that he had been able to react quickly enough earlier, otherwise he’d probably already be dead.</p><br/><p>He sighed in relief and called for the guards to close the gates. As he turned, he saw a trace of white appear from an alley.</p><br/><p>“Bai gongzi?” The guard was a little surprised to see that figure in white slowly walk over. Could it be that something had happened to the martial artists in Barbarian Mound Garrison? If not, why would Bai gongzi come here in the middle of the night? Tang Doudou had also been in a huge rush earlier…</p><br/><p>“Was the person that left just now Alliance Head Li?”</p><br/><p>“Replying Bai gongzi, yes, it was Alliance Head Li!” replied the guard honestly.</p><br/><p>Bai Feiyun nodded and didn’t move to chase after her. Instead, he turned around and returned to the little garden in the courtyard. He gazed at the stone table that shone faintly from the moonlight for a while, then looked away and turned towards the empty garden. “Come out. Have you carried out the task I left to you?”</p><br/><p>It was completely quiet in the garden and there was no one visible in the areas lit up by moonlight. If someone had just randomly walked in, he’d definitely wonder if there was something wrong with Bai Feiyun’s head.</p><br/><p>Just as Bai Feiyun was getting a little annoyed at the hidden person, a grumbling voice suddenly came from the pitch black room. “Why didn’t you tell me earlier that Jun Xin also knew how to use poison?”</p><br/><p>And JJX had even been able to poison him without a trace. Even he didn’t have such skill.</p><br/><p>Bai Feiyun frowned slightly. “He poisoned you?”</p><br/><p>That person replied in a depressed tone, “It’d be good if it was just poison. I don’t know what he used, but I can’t even look at light anymore.”</p><br/><p>Bai Feiyun was shocked. “What poison is it? You actually can’t cure it?”</p><br/><p>“There’s only a few poisons that I can’t cure and this is one.” That person sighed. “However, Jun Xin should already be dead now. The poison I used on him is absolutely fatal. When he left, the poison was already attacking his heart so he couldn’t have lived for more than an hour.</p><br/><p>“As of now, his corpse is probably already cold.”</p><br/><p>When that person got to here, his tone became more happy. So what if he had to live in darkness? At least he was still alive, while Jun Xin was already dead!</p><br/><p>However, Bai Feiyun asked, “Are you sure that Jun Xin will die?”</p><br/><p>“You don’t trust me?”</p><br/><p>“Trust?” Bai Feiyun laughed coldly. “How could I trust you? You can’t even handle a small matter like this properly and almost got yourself killed! If it weren’t for the fact that I promised your master that I would look after you, you would already be dead.”</p><br/><p>“What do you mean by that?” A moment later, the person’s voice filled with shock. “You mean that Jun Xin is still alive? How’s that possible?”</p><br/><p>“When I went to look for Grandma Shen earlier, I encountered Tang Doudou on the way there.”</p><br/><p>“Her?”</p><br/><p>“She was leaving the garrison on horseback with Jun Xin. If my guess isn’t wrong, she’s heading back to Azure Water Valley. If Jun Xin was really dead, why would she waste the time and effort to head back to Azure Water Valley in the middle of the night with how dangerous the situation currently is? That mysterious person is still hidden somewhere nearby. She doesn’t have such guts!”</p><br/><p>“This means that Jun Xin hasn’t died yet? She’s taking this risk to head back alone to Azure Water Valley in hopes of saving Jun Xin?” That person quickly caught on to the situation. At the same time, fear filled his face. “Jun Xin is already that frightening? That’s the top of the ten strangest poisons! It’s already amazing that he was able to suppress the poison for so long so that he had time to find Tang Doudou, but if he even managed to survive… That’s terrifying.”</p><br/><p>Bai Feiyun didn’t seem to agree. He just glanced briefly towards the darkness, then said, “You don’t need to worry about these things for now, just head back. Once I finish dealing with these matters, I’ll help you make an antidote.”</p><br/><p>“That’s all we can do now,” said that person with a sigh.</p><br/>\n</div>"}