{"title": "Chapter 400.2: Not Concerned About Life or Death", "id": 400, "volume": 4, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4002-not-concerned-about-life-or-death", "volume_title": "Volume 4", "body": "<h1>Chapter 400.2: Not Concerned About Life or Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Inside the room, Jun Xin kept watch over Tang Doudou. At the same time, he put in a lot of effort to negotiate with the monkey to get it to keep the fact that he had revived a secret from Tang Doudou. When he saw that Tang Doudou was about to wake up, he quickly but gently moved her back to the table, then sealed his breath to lie back on the bed.</p><br/><p>A little while after he did this, Tang Doudou who wasn’t able to sleep comfortably on the table woke up with a groan.</p><br/><p>She lifted her head and found that she was sleeping on the table, so she reflexively reached to rub her neck and shoulders. However, as her eyes gradually cleared up, she realized that there was no soreness in her neck and shoulders at all.</p><br/><p>It was as if she hadn’t been sleeping on the table. It was seriously strange!</p><br/><p>However, this wasn’t important so she didn’t bother to think much about it. She glanced outside and saw that the sun had already risen. She still needed to rush back to Barbarian Mound Garrison, so she immediately stood up. The first thing she did was check on Jun Xin. When she found that he was still in the same state and that his body was unnaturally cold, her eyes filled with disappointment.</p><br/><p>“It seems like the revival pill really was useless,” she muttered softly. However, she was still unwilling to accept the fact that Jun Xin had died and covered him with the blanket.</p><br/><p>“Jun Xin, you have to wait for me to come back! Once I find Senior Cang, he’ll definitely revive you!”</p><br/><p>Her heart hurted a lot as she took in the serene expression on Jun Xin’s face. She was just about to call Little Gray and head off when a knock came from the door. A guarded expression appeared on her face but it was immediately brushed away by the voice that arose. “Sister-in-Law, are you awake?”</p><br/><p>It was Baili Yiling!</p><br/><p>Joy appeared on Tang Doudou’s face but was soon overshadowed by confusion. Why was Yiling here?</p><br/><p>However, she still quickly walked over to open the door. When she saw Baili Yiling standing outside holding a bowl of piping hot porridge, her eyes became teary. “Yiling.”</p><br/><p>“Sister-in-Law, what’s wrong?” Baili Yiling pretended to be clueless.</p><br/><p>Tang Doudou didn’t want to break down in front of Yiling, so she forced a smile. “When did you arrive?”</p><br/><p>“Could it be that Sister-in-Law doesn’t welcome me?”</p><br/><p>“Of course not!” Tang Doudou seemed to suddenly recall something and moved out of the way. “Come in first!”</p><br/><p>They entered the room and Baili Yiling placed the bowl of porridge on the table. “When I arrived yesterday night, I saw that you were sound asleep on the table so I didn’t wake you up. There was no one else in the valley and I was starving, so I had no choice but to make some porridge myself. Since it also seemed about time for you to wake up, I brought some over for you too.”</p><br/><p>“Thank you, Yiling!” She hadn’t eaten anything since yesterday afternoon and was now starving. This porridge was perfect!</p><br/><p>Baili Yiling laughed. “What are you being so polite for? I’m your little sister! It’s natural for little sisters to wait upon their sister-in-laws!”</p><br/><p>Tang Doudou reflexively responded with a smile when she heard Baili Yiling’s refreshing laughter and her forced smile became a lot more natural.</p><br/><p>Baili Yiling hastily urged her. “Sister-in-Law, eat while it’s still hot!”</p><br/><p>Tang Doudou didn’t bother to be polite and stirred the porridge with the spoon a little, then started eating it bit by bit.</p><br/><p>When Baili Yiling saw that she was enjoying it, she smiled in satisfaction and sat down opposite Tang Doudou.</p><br/><p>She was puzzling over how to guide the topic towards Jun Xin when Tang Doudou asked, “Oh, that’s right. Yiling, why are you here? How did you find this place?”</p><br/><p>“Big Brother sent me a letter that said you were in danger in Azure Water Valley, so I immediately rushed over.” Jun Xin had only said to keep from Tang Doudou the fact that he had revived. He hadn’t said to keep the rest secret.</p><br/><p>Tang Doudou was surprised. “How’s that possible?”</p><br/><p>She was worried that Baili Yiling would misunderstand and quickly explained, “I was with him the entire time until yesterday. If he knew that I would be in danger, he’d definitely take care of it himself instead of telling you to rush over from so far away.”</p><br/><p>“That’s right! But I only recalled this after I got here!” Baili Yiling feigned indignation. “That person is seriously loathsome! Why did that person trick me here?”</p><br/><p>Tang Doudou’s expression also became concerned. “No matter what the reason is, we can’t stay here any longer. In a little while, pack up and let’s head to Barbarian Mound Garrison!”</p><br/><p>Although Barbarian Mound Garrison was also unsafe, at least the people of the martial arts alliance and the four large families were there, so Bai Feiyun wouldn’t dare to make a move easily.</p><br/><p>When she recalled Bai Feiyun, she couldn’t help but glance towards the bed at Jun Xin. Baili Yiling had been trying to find a way to bring up Jun Xin, so when she saw Tang Doudou look over, she carefully asked, “What happened to him? When I got here yesterday, I saw that he…”</p><br/><p>“He died.” Tang Doudou’s tone was complicated.</p><br/><p>Baili Yiling was taken aback. “How’s that possible?”</p><br/><p>Tang Doudou sighed and told her what happened yesterday. Her tone was much heavier than Jun Xin’s and her emotions were complicated, so Baili Yiling was depressed just from hearing about it. She sighed in relief. It was fortunate that Jun Xin had woken up, otherwise she probably would’ve been sad for a long time when she heard this news.</p><br/><p>Overall, her impression of Jun Xin was still pretty good. She felt that he was a good person.</p><br/><p>After being silent for a long while, Tang Doudou put down the spoon. Her eyes were filled with conviction. “Indeed, it can’t be possible, there’s no way he can die. I’ll definitely make him wake up!”</p><br/>\n</div>"}