{"title": "Chapter 402.2: Come Up With a Way to Save Him", "id": 402, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4022-come-up-with-a-way-to-save-him", "volume_title": "Volume 5", "body": "<h1>Chapter 402.2: Come Up With a Way to Save Him</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Sister-in-Law.” Just as that pain was spreading, she heard Baili Yiling’s soft call come from behind her.</p><br/><p>Tang Doudou looked over and found that Baili Yiling had at some time come up behind her. Everyone else was also looking at her weirdly. What was going on?</p><br/><p>Baili Yiling exhaled in relief when she saw that Tang Doudou had snapped out of it. She walked up and took the torch from Tang Doudou’s hand to throw it into the large fire.</p><br/><p>She turned towards Tang Doudou helplessly and asked, “Sister-in-Law, what were you thinking about? They had called you several times but you didn’t react at all. I was worried that something had happened to you.”</p><br/><p>So it turned out that she had been too absorbed in her thoughts and missed what everyone had been saying.</p><br/><p>Tang Doudou said, “I’m fine. I was just thinking that life was seriously too fragile!”</p><br/><p>Baili Yiling said with a smile, “Why’s Sister-in-Law thinking about something like that when you’re so young? Of course life is fragile, but isn’t there that saying that scourges cause calamity for a thousand years? Don’t worry, Sister-in-Law, people like us won’t die so soon!”</p><br/><p>…</p><br/><p>Tang Doudou glanced at Baili Yiling’s bright flickering eyes. Why did this sound a little off?</p><br/><p>“Alliance Head, just leave the rest to us. This subordinate feels that you look exhausted. Why don’t you hurry back to rest? There’s still a lot of things you have to deal with. It’d be bad if you ruined your health from not having enough rest!” The friend of the deceased walked up and looked towards Tang Doudou worriedly.</p><br/><p>Tang Doudou felt a bit of warmth in her heart when she heard these sincere words of concern. “I’m fine. Let’s send these brothers off. The other matters can be pushed off a little.”</p><br/><p>Baili Yiling added, “This big brother, my sister-in-law is right. The decreased are more important. What’s more important than sending these brothers on their way? Don’t worry, there’s me to take care of Sister-in-Law. I won’t let her health be affected!”</p><br/><p>When he saw that both of them were adamant in staying here, he could only drop this suggestion.</p><br/><p>However, it’d take quite a while for these bodies to burn.</p><br/><p>After standing next to the fire for a long while, the bright flames became scorching. Tang Doudou was just about to turn around and tell Yiling to move back a little when Little Gray screeched. She hastily pulled Yiling and moved away in a flash.</p><br/><p>An instant after she pulled Baili Yiling, eye-piercing flashes of blades cut through the pile of firewood that was originally surrounded by flames. The firewood collapsed and the flames started spreading rapidly. The moment Baili Yiling got over the shock, she moved in front of Tang Doudou protectively while backing towards the crowd.</p><br/><p>Someone shouted, “There’s someone here to snatch the corpses!”</p><br/><p>The situation immediately exploded. Tang Doudou knew that the mysterious person had definitely come again and she pushed Baili Yiling aside to say to the people of the four clans and the martial arts alliance, “He definitely won’t be able to hide himself while carrying the corpses. Everyone, let’s go!”</p><br/><p>The masters of the four large families truly weren’t ordinary people. Right after she said this, Bai Luoqing took the lead and the rest of the family heads quickly followed. With a few leaps, they got to the pile of firewood and abruptly attacked. The light created by their inner strength mixed with the light from the flames and blocked the view of the battle for a moment.</p><br/><p>The master of the Murong family paused and turned towards Tang Doudou. “Alliance Head, while we keep that person occupied, please take advantage of this chance to take him down with one blow!”</p><br/><p>Tang Doudou was stunned and inwardly cursed. With how weak her martial arts were, she’d be crying Amitabha Buddha if she wasn’t taken down in one shot. She was supposed to take someone else down in one go? Wasn’t that walking up and asking for a beating?</p><br/><p>But how was she supposed to say this?</p><br/><p>All she could do was agree for the time being. After all, with the heads of the four families fighting and so many martial artists here, the mysterious person might be subdued before she even needed to do anything.</p><br/><p>This had been her original plan. However, before the first steps of the plan even started, this person had cornered her with this direct question.</p><br/><p>These thoughts flew rapidly through her head, then she answered, “Alright!”</p><br/><p>The head of the Murong family finally went over to join the fight. Tang Doudou turned to the rest of the crowd and said, “Everyone, let’s work as one! We must take this evil criminal down today!”</p><br/><p>“Alliance Head is right! Everyone, let’s go! We can’t let this evil criminal escape again!”</p><br/><p>The crowd became stirred up after hearing Tang Doudou’s words and rushed up all at once, making the scene a complete mess. The battle seemed to be going well. With so many skilled experts attacking, that mysterious person was on the verge of revealing himself. Tang Doudou was just about to rush up in order to take advantage of this chaos to try to see who that person was.</p><br/><p>However, Baili Yiling pulled her to a stop.</p><br/><p>“What is it?” She turned around, only to find that Baili Yiling seemed very nervous.</p><br/><p>Baili Yiling pointed at the mysterious person that everyone was attacking and whispered, “Sister-in-Law, hurry and think of a way to save him!”</p><br/>\n</div>"}