{"title": "Chapter 414.2: Die Together", "id": 414, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4142-die-together", "volume_title": "Volume 5", "body": "<h1>Chapter 414.2: Die Together</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Baili Yiling only remembered now that he was still bleeding. She took out some hemostatics and bandages from the small bag she always kept with her. As she applied the medicine, she said, “If I hadn’t come back, you’d be dead.”</p><br/><p>Jun Xin tugged his lips into a weak smile. “If I’m dead, then I’m dead, but you were practically choosing to head into death. Aren’t you afraid of dying?”</p><br/><p>“What’s there to be scared of?” Baili Yiling’s hand froze for a moment, then she replied in an unconcerned tone.</p><br/><p>Jun Xin was surprised that she actually thought this way as well.</p><br/><p>When Baili Yiling saw the surprise on his face, she laughed. “What? You think my way of thinking is strange? That anyone should be afraid of death?”</p><br/><p>“No.”</p><br/><p>After all, he thought the same.</p><br/><p>He wasn’t afraid of dying, so what was there to fear about death?</p><br/><p>However, he hadn’t expected for Baili Yiling to also have the same opinion. Now he felt that she wasn’t that annoying anymore.</p><br/><p>If Baili Yiling knew that Jun Xin’s opinion of her was that she was annoying, she probably would’ve kicked Jun Xin right down and left him for dead.</p><br/><p>But how could she possibly know what he was thinking? All she saw was that the look in Jun Xin’s eyes had changed a little as he looked at her. He also seemed to be a little uncomfortable, so she sped up her movements and quickly finished applying the medicine, then bandaged his wrist. “Don’t talk and preserve your strength. Even though the mysterious person hasn’t come to chase after us yet, we can’t relax our guard. We can’t stay here for long. Let’s rest for a bit, then hurry and leave.”</p><br/><p>After saying that, she took out a dagger to cut the bandage and tie the ends.</p><br/><p>Following that, she took Jun Xin’s other hand and checked his condition, then sighed. “The mysterious person’s way of sealing your pressure points is too strange. I can’t undo it.”</p><br/><p>Jun Xin glanced at her. When he saw that her face was filled with self-blame, he said softly, “It’s alright.”</p><br/><p>Baili Yiling nodded. She had already done her best. Worrying over things that she couldn’t do was pointless.</p><br/><p>After resting a while, Jun Xin felt a little better and he spaced out while staring at the phoenix on Baili Yiling’s forehead. After a long while, he asked, “How did you suddenly become so strong?”</p><br/><p>Baili Yiling was dumbfounded. She thought he hadn’t noticed at all!</p><br/><p>Jun Xin reached out while she was still stunned to stroke the phoenix mark. “What is this?”</p><br/><p>As he spoke, he looked towards Baili Yiling with no idea that his slight touch had stirred the strings of her heart and caused an emotion that not even she understood to flood up.</p><br/><p>Baili Yiling could feel her heart pound. She lifted her head and just happened to meet Jun Xin’s gaze head on. Her heart pounded so hard that she could barely breathe and had to turn her head away.</p><br/><p>“T-this is… it’s a sort of medical pill.”</p><br/><p>Jun Xin furrowed his brows. Tang Doudou was the only one he would be very sensitive towards. Towards everyone else, he was pretty crude and boorish, so he didn’t notice Baili Yiling’s abnormailty at all and started wondering what this pill was.</p><br/><p>However, Baili Yiling didn’t plan to explain things to him. She glanced behind them, then picked Jun Xin and placed him on her back this time as she started heading forward.</p><br/><p>She kept running until the horizon started brightening, then stopped, exhausted. She set Jun Xin down, then collapsed with him onto the sand.</p><br/><p>The sensation of the soft sand made her burst out laughing. She never thought that she had ended up fleeing with Jun Xin to the sea. She didn’t know which coast this was either. If they wanted to head back, would they have to go past that manor again?</p><br/><p>But would Jun Xin be able to hold up for the time it’d take for her to double back and find her way?</p><br/><p>Several hours had passed, so the effect of the pill was slowly fading away. Once the sun rose, she’d be hit with the after effects of the pill, so…</p><br/><p>Baili Yiling sat up again. The phoenix on her forehead was already starting to flicker in and out.</p><br/><p>“I’m exhausted. Let’s find a place to rest for now,” said Baili Yiling to Jun Xin.</p><br/><p>Jun Xin opened his eyes a little. They didn’t have medicine and he couldn’t use his inner strength to treat his injuries, so his condition was rapidly getting worse. It was slowly eating away at his life, but he didn’t tell Baili Yiling this and just nodded. “Alright.”</p><br/><p>Baili Yiling sighed in relief and bent over to set him on her back again. She slowly walked towards the left as the cool ocean breeze swept over them. This was the seaside, so there was definitely a fishing village around. Even if there weren’t, a cave would work!</p><br/><p>However, after walking for a short while, she didn’t encounter a fishing village. Instead, she encountered the person she hadn’t wanted to see the most.</p><br/><p>The mysterious person had caught up with them.</p><br/><p>Without any sound or warning, he appeared and blocked her path.</p><br/><p>She could sense that his aura was now even stronger and filled with an even more frightening murderous aura. Even though he was just standing there, the aura he released pressured people to the point that they couldn’t breathe.</p><br/><p>The instant Baili Yiling saw him, she despaired. They were going to die.</p><br/><p>However, Jun Xin struggled slightly on her back and said softly, “Let’s jump into the ocean!”</p><br/><p>“What?” Baili Yiling glanced back to see Jun Xin’s expression, but it was a futile effort. There was no way her neck could twist that far.</p><br/><p>Jun Xin replied, “If you die in the ocean, your corpse will enter the bodies of fishes. They say that your soul will be carried by the fishes to the person you want to see most.”</p><br/><p>Baili Yiling didn’t know whether to laugh or cry at these words. He still had the mood to say such unreliable things in this sort of situation?</p><br/><p>However, she still glanced down at the nearby body of water, at the sparkling surface of the sea that was being dyed by the rising sun. The red light in her eyes slowly dimmed and the veined patterns on her body were gradually starting to disappear as well.</p><br/><p>A slightly moist wind swept towards them. The mysterious person had moved.</p><br/><p>Baili Yiling also moved. She acted like she was dodging, but in reality, she was purposefully moving towards the ocean. There really was no other option but to take Jun Xin’s suggestion and jump into the sea.</p><br/><p>However, she felt that drowning in the sea was better than dying at the hands of this person.</p><br/><p>Especially when Jun Xin would be with her…</p><br/>\n</div>"}