{"title": "Chapter 416.2: Calamity and Fortune are Interlinked", "id": 416, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4162-calamity-and-fortune-are-interlinked", "volume_title": "Volume 5", "body": "<h1>Chapter 416.2: Calamity and Fortune are Interlinked</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The child was hungry?</p><br/><p>“Senior Cang! The disseminating tassel fragrance in my body still hasn’t been cured! The child, will the child be alright?” Tang Doudou felt no excitement when she heard this explanation, instead, she was overcome with fear.</p><br/><p>When this was brought up, Cang Baicao’s face also sank and he sighed. “With things the way they are, there’s nothing we can do but see how things go. Once Baili Yu finds the rootless grass and cures that poison for you, you should prepare to start nursing the fetus.”</p><br/><p>Tang Doudou lowered her eyes, feeling very conflicted.</p><br/><p>Bang bang bang!</p><br/><p>Right at this time, anxious knocking came from outside the door.</p><br/><p>Cang Baicao said, “Come in.”</p><br/><p>The door was pushed open and Qing Yin walked in with an anxious expression. She glanced towards the bed at Tang Doudou and opened her mouth, but then looked towards Cang Baicao.</p><br/><p>Cang Baicao got up. “If you’re going to keep this child, we have to start nourishing it now. I’m going to write a few prescriptions. Have the servants make the medicinal dish for you and eat them at the prescribed times daily.”</p><br/><p>Tang Doudou knew that he was politely excusing himself, but she didn’t stop him. “Many thanks, Senior Cang.”</p><br/><p>“It’s nothing. Just take it as compensation for giving Xiao Yi and Xiao Ren a funeral!” Cang Baicao heaved a long sigh. His face, which had been still alert and excited earlier, instantly sank down and his back was very stooped. Tang Doudou’s heart ached.</p><br/><p>It seemed that the news of Xiao Yi and Xiao Ren’s death had dealt him a heavy blow.</p><br/><p>Once Cang Baicao got far away, Tang Doudou gathered up these thoughts and turned towards Qing Yin. “What’s wrong?”</p><br/><p>Qing Yin hastily said, “Something’s happened to Young Master Jun!”</p><br/><p>Tang Doudou was stunned. She wanted to sit up and ask what had happened, but her entire body felt completely weak. The only thing that could move as her head. She couldn’t even move her fingers so she could only lie motionlessly despite her anxiety.</p><br/><p>“Qing Yin, hurry up and tell me what happened!”</p><br/><p>Qing Yin hastily summed up what happened and told her that Jun Xin and Baili Yiling had already gone missing as of now. It was the Wind Shadow guard who had been following them that came back to report this.</p><br/><p>Tang Doudou then asked, “Do you guys know who it was that took them?”</p><br/><p>“According to the Wind Shadow guard, it was that mysterious person, the person that Young Master Jun had been following this entire time. For some reason, Young Master Jun was discovered. Young Master Jun wasn’t a match for that person and Eldest Miss had gone back to save him, so she had the Wind Shadow guard deliver the report.</p><br/><p>“However, that person is very strong, even Young Master Jun wasn’t a match for him. Eldest Miss’s actions sounds like she had gone back to die.”</p><br/><p>Qing Yin sighed.</p><br/><p>She didn’t know Baili Yiling very well and had only seen her a couple times in Plum Garden. There was really no friendship she could speak of, but she also didn’t have any bad impressions.</p><br/><p>Tang Doudou was silent for a moment before she said, “With how strong the mysterious person’s martial arts is, it wouldn’t be any use for us to send people over. Take my alliance head command tablet and go find the people of the four large clans and the martial arts alliance. Tell them that we’ve already found the person behind all of this, then lead them to the manor outside North Hara City. Have some of your people infiltrate them and check out the situation there.”</p><br/><p>Qing Yin was confused. “Why don’t we directly go save Young Master Jun and Eldest Miss?”</p><br/><p>“The two sides don’t get along. If you tell them the truth, do you think that they would really go to provoke the mysterious person? They’d only put full effort into things related to themselves.”</p><br/><p>“Alright, I’ll go right now.” Qing Yin made to set off right away.</p><br/><p>“Wait!” Tang Doudou stopped her.</p><br/><p>Qing Yin asked, “Alliance Head Li, do you have anymore instructions?”</p><br/><p>“If you don’t bring the alliance head command tablet, do you think they’ll listen to you?” Not only would they not listen, after the last incident, they probably wouldn’t even let her in the door.</p><br/><p>“And, be careful of Bai Feiyun,” exhorted Tang Doudou.</p><br/><p>“If you see him, don’t tell him the truth. Just say that I sent you to find Little Gray.”</p><br/><p>Qing Yin indicated that she understood. Tang Doudou couldn’t think of anything else for her to watch out for and had her take out the alliance head command tablet from behind the bed.</p><br/><p>When Baili Yiling came this time, she gave her both jade pendants and told her about what Bai Feiyun did when she was unconscious. When Tang Doudou recalled this now, she couldn’t help but sigh. It was clear that these jade pendants weren’t simple, so she had Qing Yin bring only one. She tucked the other one back behind the bed.</p><br/><p>At this time, a maid came with the porridge. Qing Yin nodded towards her, then withdrew.</p><br/><p>The maid fed her the porridge. After eating, Tang Doudou felt a little better and asked the maid, “Where’s Senior Cang?”</p><br/><p>“Replying Madame, Senior Cang is at the kitchen instructing Big Sister Meng Ru on how to prepare the medicinal dish,” replied the maid respectfully.</p><br/><p>Tang Doudou nodded, then shook her head. “I’m full. You can withdraw.”</p><br/><p>“Understood!” The maid left with the tray.</p><br/><p>Tang Doudou looked towards the top of the bed for a while, then called, “Little Gray.”</p><br/><p>A gray shadow immediately jumped down from the roofbeam and hung upside down from the bed frame. As he looked at Tang Doudou, his eyes filled with concern.</p><br/><p>“I’m fine, don’t worry.” Tang Doudou smiled towards him, then looked towards the jade skull on her wrist. “Come down, I have something I need you to do.”</p><br/><p>Little Gray obediently landed on the blanket, then crouched down next to Tang Doudou and tilted his head while waiting for her instructions.</p><br/><p>Tang Doudou was silent for a moment, then she said, “You suddenly recovered after being injured last time. It was because of this skull, right?”</p><br/><p>Little Gray nodded and started gesturing.</p><br/><p>“You’re saying that in the past, whenever you got injured, Mu Ye had used this to treat you?” She had guessed this earlier, but she was still surprised to have her guesses confirmed.</p><br/>\n</div>"}