{"title": "Chapter 419.2: Rootless Grass’s Flower", "id": 419, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4192-rootless-grass%E2%80%99s-flower", "volume_title": "Volume 5", "body": "<h1>Chapter 419.2: Rootless Grass’s Flower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In a mountain range that seemed to float in a sea of clouds over a thousand miles away, a figure was rapidly flitting through the narrow and winding roads.</p><br/><p>Suddenly, the person froze and landed on a pine tree.</p><br/><p>His crimson robe was covered with fallen pine leaves. Baili Yu rubbed his swollen eyes. Currently, his eyes were completely red and he looked extremely haggard.</p><br/><p>He hadn't taken any breaks since leaving Azure Water Valley and had been rushing forward these entire time. However, he suddenly had a strange feeling so he came to a stop.</p><br/><p>Why would he have this feeling all of a sudden?</p><br/><p>Could it be that something had happened to Tang Doudou?</p><br/><p>Baili Yu didn't dare to continue thinking along those lines and continued rushing forward as if his life depended on it. He was over a thousand miles away, so even if something had happened, he wouldn't be able to make it back in time. The only thing he could do now was find the rootless grass, then rush back to Azure Water Valley!</p><br/><p>He had incidentally gotten information about the rootless grass a few years ago in Profound Principles Pavilion. </p><br/><p>Profound Principle Pavilion was an organization that collected all sorts of information. A few years ago, he had been curious about it and went to visit, but he hadn't seen Profound Principle Pavilion's master. Despite this, he managed to gain very valuable information. He hadn't found those information important back then, but now it was extremely important to him.</p><br/><p>Profound Principle Pavilion's business was based on selling information, so most of the time, their information would always be true.</p><br/><p>That was why he had been so certain that he could find the rootless grass within five days.</p><br/><p>Baili Yu retrieved his thoughts and rubbed the center of his forehead. He took a moment to recall the location that the map had indicated back then.</p><br/><p>It seemed to have been next to a clear spring.</p><br/><p>He searched in the mountain for another half the day. Finally, when he was almost at the peak of the mountain, he heard the trickling of water.</p><br/><p>When he walked over, he saw spring water that was so clear the bottom of the spring could be seen. The sound of the trickling came from the rocks above. Where the rocks were leaning was a dark and moist cave.</p><br/><p>When Baili Yu saw this cave, joy flashed through his eyes and he quickly walked over.</p><br/><p>He didn't lit up a rolled torch despite the darkness and just walked into the depths of the cave.</p><br/><p>Halfway through, he sensed danger. An enormous shadow abruptly pounced towards him from the darkness.</p><br/><p>Countless glowing flower petals instantly floated up in the dark cave despite there being no wind. They quickly formed a wall in front of Baili Yu and sent that shadow falling back before rapidly moving to envelope the black figure.</p><br/><p>They completely bound the black figure like a sturdy net.</p><br/><p>Baili Yu didn't even bother to look at the black figure and allowed those flower petals to create a road for him as he continued to walk.</p><br/><p>There were a lot of strange things living in this cave and he encountered quite a lot of them. However, Baili Yu paid no attention to them.</p><br/><p>After walking for a long time, white light appeared ahead. He had arrived.</p><br/><p>Inside Azure Water Valley, Cang Baicao had told Tang Doudou a lot about the rootless grass and talked until she almost fell asleep before finally stopping.</p><br/><p>\"I'll borrow the rootless grass's flower for now. In a bit, I'll make some other medicine and have someone bring it to you. Once you eat it, you'll slowly get better.\"</p><br/><p>Tang Doudou nodded to indicate that she understood.</p><br/><p>Cang Baicao then left with the rootless flower.</p><br/><p>At this time, Jun Xin and Baili Yiling had already shaken off that enormous tiger, but a new problem had come up. </p><br/><p>They had been surprised to encounter a tiger in this strangely silent place, but they ended up encountering living people as well.</p><br/><p>Jun Xin and Baili Yiling shared a glance and simultaneously hid themselves in the underbrush.</p><br/><p>Barely a moment after they had concealed themselves, they heard the voices get closer.</p><br/><p>\"Hurry, this way!\"A hushed voice appeared from the east. Then there was the rustling sound of something large being dragged. From the sound of the footsteps, there were at least four people. Baili Yiling could see that there was an incline at the east and that some people were walking over from that side.</p><br/><p>These people didn't look uncivilized and actually looked quite similar to them, so they relaxed somewhat. Just as they were considering whether or not to greet them, they heard one of those people say, \"Why did so many die this time?\"</p><br/><p>\"I heard that even Murong gongzi had…\"</p><br/><p>\"Shhh! Be quiet, we're only here to deal with the corpses. Let's hurry and finish so we can report back.\"Their short conversations caused Jun Xin and Baili Yiling's eyes to fill with shock.</p><br/><p>They had actually encountered people from the mysterious person's manor here.</p><br/><p>As they were thinking this, they realized that it wasn't a good idea to keep hiding here in this underbrush, so as those people moved, the two of them also started trying to find better places to hide.</p><br/><p>However, they looked around and found that there was no place to hide. As the sound got even closer, they gradually noticed that there was a huge hole nearby that was piled high with corpses.</p><br/><p>They gritted their teeth and came to the same decision. Both of them silently started walking towards the pile of trash. </p><br/><p>They soon reached the place without a sound.</p><br/><p>\"All of you, move fast. Don't waste time.\"</p><br/><p>The others didn't speak and just panted as they worked. After a few moments, Baili Yiling and Jun Xin sensed a very heavy object fall down and land near the two of them. They looked over at the same time and found that the lifeless eyes on a delicate face that was extremely pale was staring right at them. Baili Yiling wasn't able to stop herself from screaming.</p><br/><p>\"Aah!\" It was over! The moment that sound escaped, Baili Yiling felt the urge to slap herself.</p><br/><p>This hole wasn't very large, but wasn't small either. It was just casually dug. Due to the fact that it wasn't filled, there were some little cavities in the hole that were either made during the digging process or done by rats. The two of them were currently hiding in a cavity that just barely covered their figures. It it had been night, this wouldn't even count as hiding, but it was currently the middle of the day. The sun was scorching, so no one would expect two people to hide in such a stinky hole. However, the moment she cried out, they were immediately exposed.</p><br/><p>When Baili Yiling looked up, she saw that a middle-aged man dressed in green were looking at them sternly.</p><br/><p>\"Guests, what are you doing partially hiding in the corpse decomposition pool? However, this courage is truly admirable!\"</p><br/>\n</div>"}