{"title": "Chapter 415.2: Beauties Cause Calamities", "id": 415, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-4152-beauties-cause-calamities", "volume_title": "Volume 5", "body": "<h1>Chapter 415.2: Beauties Cause Calamities</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Jun Xin had woken up!</p><br/><p>Joy leapt onto Baili Yiling’s face, then she felt a pang in her heart. If she had said that someone was bullying her, would Jun Xin still wake up? He probably wouldn’t, right?</p><br/><p>“You’re awake?” But the delight from the fact that he had woken up was stronger than the envy in her heart. She half-kneeled on the ground and propped Jun Xin up against her leg.</p><br/><p>The moment she lifted him up, he started coughing up water.</p><br/><p>Baili Yiling finally realized her mistake and cursed at herself for being stupid. Even though she had started passing him some of her breath later, at the start he had swallowed probably already several mouthfuls of sea water. She actually forgot about this when she got ashore. Fortunately he had coughed all of it out now otherwise, all his hopes of survival probably would’ve been drowned by these mouthfuls of water.</p><br/><p>She soon also realized that he hadn’t woken up. In his semi-conscious state he had heard what she said and had reacted subconsciously.</p><br/><p>She sighed. The current most urgent task was to make his fever go away!</p><br/><p>When Baili Yiling’s thoughts reached this point, she reached out for his waist belt, but then froze and her fingers started trembling. She had never taken off the clothes of a man before and now it was going to be the clothes of the man she liked.</p><br/><p>Thoughts rapidly flashed through her head and caused her face to flush like it was on fire. She silently chanted several repetitions of a heart-clearing chant, then closed her eyes and quickly pulled off the belt. In a few moments, she had taken off Jun Xin’s clothes and placed them to the side on the sand.</p><br/><p>She only opened her eyes once this was done.</p><br/><p>Then she immediately regretted that action. She wanted to close her eyes again, but she was also curious. Jun Xin was lying there, his top half naked. However, his soaked pants were still sticking to his slender legs, outlining his well-portioned and healthy leg muscles. His skin wasn’t very white but a healthy wheat color. His chest, shoulders, and back were covered with multiple scars which caused Baili Yiling’s heart to ache.</p><br/><p>Now she faced a hard question. His pants were also soaked, so should she take then off or not?</p><br/><p>After considering things, she came to the conclusion that his health was more important, so she closed her eyes and stripped Jun Xin completely naked. Afterwards, she didn’t open her eyes as she placed his pants and boots to the side to block her view of Jun Xin. Then she walked with her back facing him towards the forest.</p><br/><p>She soon returned with a pile of firewood and picked up the rolled torch that had fallen out of Jun Xin’s clothes earlier and started a fire.</p><br/><p>The ocean breeze quietly blew past. She got up and found that the clothes were already dry, so she hastily put a layer back on Jun Xin, then shifted the fire closer. She crouched down next to Jun Xin to check his injuries, then her brows furrowed. She grabbed the green herbs next to the pile of firewood and crushed them between her palms before carefully applying them to Jun Xin’s injuries. These herbs were common injury medicine and were quite effective on small wounds, but she didn’t know if it would have any effect on a wound this large.</p><br/><p>However, the fact that she had been able to find these herbs was already an achievement.</p><br/><p>She had done everything she should do. The rest was going to depend on Jun Xin’s luck. The only thing that worried her was his abnormal fever.</p><br/><p>“Cold…” At this time, Jun Xin spoke softly, still unconscious. His hand trembled as it moved towards where it felt heat.</p><br/><p>Baili Yiling hastily grabbed his hand. The sensation was so cold that she almost flung his hand away, but Jun Xin had already grabbed onto her hand. It was instinct, just like when a person saw water in the desert. Jun Xin latched onto the only source of warmth he could sense and hugged her like he wanted to pull her into his body.</p><br/><p>Baili Yiling hadn’t put his clothes back on and had only placed them on top of him, so when he moved, those clothes fell down completely. The sensation of the cold skin caused Baili Yiling to stiffen even though there was a layer of clothing between them.</p><br/><p>She was flustered and hastily pushed at him. “Umm, Jun Xin, don’t be like this…”</p><br/><p>“I’m cold, so cold…” Jun Xin’s teeth chattered.</p><br/><p>Baili Yiling thought that he had woken up, but when she looked up, she found that he was still unconscious and showed no signs of waking up.</p><br/><p>She sighed, then her expression turned concerned. The state of his injuries was seriously too severe. If they couldn’t get medicine soon, Jun Xin would definitely die.</p><br/><p>The crackling of the fire was loud on top of the spacious expanse of sand.</p><br/><p>She couldn’t push him away and could tell that he really was cold, so she reached out and hugged him while shifting them towards the fire. She hoped that the flames would help disperse some of Jun Xin’s cold. At the same time, she picked up the clothes on the ground and covered him with them.</p><br/><p>After she finished all of this, she was just about to rest for a while when she was hit with a severe bout of dizziness. Her vision went black and endless exhaustion came from her body’s very bones.</p><br/><p>Crap.</p><br/><p>This sensation was too familiar. It was the after effect of that pill.</p><br/><p>Baili Yiling struggled to open her eyes. Between the seams in her eyes, she saw that Jun Xin’s mostly smooth chin now had a bit of stubble. However, even after he had been underwater for so long, he still gave off a sweet scent. She felt even more drowsy and she ended up falling deeply asleep with her head leaning against Jun Xin’s chest.</p><br/><p>Jun Xin and Baili Yiling went missing.</p><br/><p>Master was also not in Azure Water Valley.</p><br/><p>When the Wind Shadow guard who had traveled the entire night got back to Azure Water Valley and found Ye Chuan, he rushed up and asked, “Boss Ye, did Master tell you when he would be back?”</p><br/><p>Ye Chuan was currently patrolling the boundary of the valley to make sure that there was nothing strange. He was surprised to see the Wind Shadow guard. “Didn’t Master have you guys follow the eldest miss? Why are you back? Did something happen to Eldest Miss?”</p><br/><p>The Wind Shadow guard hastily told Ye Chuan about everything that had happened yesterday. After Ye Chuan heard about everything, his facial color also became poor. He looked at the Wind Shadow guard grimly. “Master will return within five days, but by that time, I’m afraid that Eldest Miss and Young Master Jun will already be…”</p><br/><p>“Then what do we do?” The Wind Shadow guard paced around anxiously.</p><br/><p>Ye Chuan was quite calm in contrast. He thought for a moment, then said, “Don’t panic yet. Get the leaders of the hidden guard over first and let Qing Yin know so that she can help us come up with a plan as well.”</p><br/><p>Right after he said this, Qing Yin just happened to walk over. When she saw that they seemed troubled, she immediately asked them what had happened.</p><br/><p>After they filled Qing Yin in on the situation, she frowned and said, “Alliance Head Li has already woken up. I’ll go ask her if she has any ideas.”</p><br/><p>The Wind Shadow guard’s face lit up when he heard that Tang Doudou had woken up. There was finally someone that could make decisions.</p><br/><p>He didn’t notice that Ye Chuan’s expression was a little strange. Qing Yin didn’t notice either. After quickly saying this, she rushed back into the courtyard.</p><br/><p>The Wind Shadow guard loosened a breath in relief and looked towards Ye Chuan. “Hopefully we’ll make it in time.”</p><br/><p>However, Ye Chuan remained silent and didn’t say anything. This confused the Wind Shadow guard. Ye Chuan seemed off!</p><br/><p>“Are you alright? Boss Ye?”</p><br/><p>What could possibly be wrong with him? He was just in a bad mood to hear that Tang Doudou had woken up. This woman had caused so much trouble. Not only had she caused Master to be injured, Young Master Jun had been dragged down because of her as well. Truly, beauties caused calamities!</p><br/>\n</div>"}