{"title": "Chapter 433: So Sure of Herself", "id": 433, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-433-so-sure-of-herself", "volume_title": "Volume 5", "body": "<h1>Chapter 433: So Sure of Herself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Baili Yu saw how Tang Doudou was holding the medicinal dish like she was facing a huge enemy, he had no choice but to coax her into eating it bit by bit. At the end, he wiped the corners of her lips for her.</p><br/><p>With Baili Yu looking after her so attentively, there was no way Tang Doudou could stay unhappy. She propped up her chin and allowed Baili Yu to wipe her face. Her eyes whirled, then she looked at Baili Yu and asked, \"You really don't plan to go see your master?\"</p><br/><p>Baili Yu smiled. \"I don't plan to go right now.\"</p><br/><p>\"Why?\"</p><br/><p>\"Because I understand my master too well.\" Baili Yu lowered the napkin, then reached out to tuck Tang Doudou's hair behind her ear.</p><br/><p>His movements were very gentle and his slightly cool hands softly stroked Tang Doudou's smooth cheek. The sensation of those soft hairs against his palm made a numb tickling sensation spread all the way to his heart.</p><br/><p>Tang Doudou was just about to ask what he meant when Baili Yu touched her with his cold fingers. It tickled, so she reached out to scratch. However, Baili Yu grabbed her hand and said hoarsely, \"Don't move!\"</p><br/><p>Following that, he lowered his head. His soft breath hit Tang Doudou's ear. \"Doudou, I really want you.\"</p><br/><p>His voice was filled with passion and his suggestive action made Tang Doudou's heart trembled. She glanced down and saw Baili Yu's porcelain-like skin and high nose right in front of her. Those slender peach flower eyes were half narrowed and his long eyelashes concealed his hazy pupils.</p><br/><p>Beauty seriously was seductive. Tang Doudou subconsciously gulped. She couldn't even shift her gaze away. As expected of a seductive yao, his every move was way too captivating.</p><br/><p>Baili Yu seemed to have become infatuated with that soft feeling and couldn't bear to let go. When he saw that Tang Doudou was staring at him, he bit down with slightly more force.</p><br/><p>The ear was a very sensitive part of a person's body. When he bit harder, Tang Doudou cried out in surprise. This soft cry seemed to stir the strings in Baili Yu's heart teasingly. He reached out and caged Tang Doudou inside his arms while leaning closer to continue probing deeper.</p><br/><p>Tang Doudou was no longer a naive little lady and she understood what he wanted. In addition, she had never been the type to suppress her feelings. When Baili Yu teased her this way, her body heated up as well and she wrapped her arms around his neck.</p><br/><p>Bang bang bang!</p><br/><p>Just as their gazes were heating up, urgent knocking came from the door.</p><br/><p>Baili Yu paid no attention and wanted to continue. At first, Tang Doudou didn't pay attention either, but as the knocking continued, she pushed on Baili Yu's chest while gasping. \"Big evil spirit, let's first check if it's news about Qing Yin and the others!\"</p><br/><p>Baili Yu saw that the heat in her eyes was fading and the knocking was still continuing, so he had no choice but to put her down and just kiss her cheek. \"Alright!\"</p><br/><p>After saying that, he got up and lifted the crimson robe he had taken off at some time. He casually put it back on, then walked outside.</p><br/><p>The moment he left, Tang Doudou also hastily put her clothes on. After considering things for a moment, she followed after Baili Yu.</p><br/><p>After opening the door, they found that it wasn't a subordinate knocking on the door, but Nangong Yan who they had encountered at the gates earlier.</p><br/><p>It was no wonder she kept knocking. If it was one of Baili Yu's subordinates, if Baili Yu hadn't responded to their knocks the first time, no matter how urgent the matter was, they would stand quietly outside and wait.</p><br/><p>\"Senior Brother!\" When Nangong Yan saw that the door was opened, she called out in surprise. Following that, she asked worriedly, \"Did Yan er disturb your rest?\"</p><br/><p>She hadn't just disturbed their rest, she had disturbed a good moment! If it had been Ye Chuan bringing news of Qing Yin, it would've been fine, but it was actually Nangong Yan. It infuriated Baili Yu.</p><br/><p>However, he had never been the type to exhibit his anger. The more unhappy he was, the more irritated he was, the more brilliant the smile on his face would become. This smile was completely different from how he usually faced Tang Doudou. Though he was smiling, there was no trace of warmth in his smile and it chilled to the bone.</p><br/><p>In the past, Nangong Yan would get as far away as possible whenever Baili Yu smiled this way, but today she had encountered Liu Zhiyuan, then Su Yi, and was also worried that Dao Xun would figure out the truth, so her thoughts were a complete mess. When she saw Baili Yu smile towards her, she actually thought that he didn't mind her sudden visit!</p><br/><p>Her thoughts then leaped to that maybe Baili Yu had changed his mind about her since she had admitted her wrongs today… Senior Brother wasn't completely disappointed in her!</p><br/><p>When this thought occurred to her, her eyes lit up and she reached out to tug on Baili Yu's sleeve while saying sweetly, \"Senior Brother, you should hurry and go see Master. Master said that if you didn't go find him within one hour, he'll cut off all relationship with you…\"</p><br/><p>\"Oh? Really?\" Baili Yu didn't push Nangong Yan away, but his smile became even more unreadable.</p><br/><p>Tang Doudou was standing next to him and saw that ice-cold murderous intent in his eyes so she shrank back. She silently mourned for Nangong Yan who was still tugging on Baili Yu's sleeve. At the same time, she couldn't help but be confused. Nangong Yan already knew that she and Baili Yu were biological siblings. Could it be that she really wanted to have an incestuous…</p><br/><p>When a woman got crazy, it was seriously scary.</p><br/><p>\"That's right! Master looked really stern! Senior Brother, since you don't seem to have anything urgent right now, just go with me… I'm sure Sister-in-Law wouldn't mind Senior Brother going to visit Master, right?\" As Nangong Yan spoke, she blinked towards Tang Doudou smugly.</p><br/><p>Tang Doudou rolled her eyes. She no longer cared about Nangong Yan at all. What exactly was she smug about? Couldn't she see that Baili Yu was about to tear her apart from limb to limb?</p><br/><p>And she was even trying to pressure her with 'Master'? She hadn't even seen that master before, she didn't even know if he was square or round. However, Nangong Yan seemed so sure of herself and so sure that she could get her way just by pulling her master out. Really, Nangong Yan's brain was probably made from a mixture of dough. However, no one even beat her up yet, so how did her brain turn to mush already?</p><br/><p>The more Tang Doudou thought about it, the more pointless it seemed. They still hadn't gotten news from Qing Yin and the others, so she didn't want to waste time with someone like Nangong Yan. She yawned and walked back into the room.</p><br/><p>After she walked inside, she even went ahead and closed the door for them.</p><br/><p>Nangong Yan was pleasantly surprised when she saw this. She hadn't expected for Master's name to be so effective. Tang Doudou actually compromised!</p><br/><p>This was something she had never hoped for. That woman was like dogskin plaster, she stuck to Senior Brother every day so she could never get a chance to be alone with Senior Brother.</p><br/><p>Humph! Even though Su Yi would definitely talk bad about her to Master, she understood Master's temper well. It didn't matter if she did something bad, she just had to admit her wrongdoing, then with a couple schemes, she could make sure that Master still stood by her side. At that time, it wasn't impossible to get Master to force Senior Brother to divorce Tang Doudou…</p><br/><p>That wasn't right. They hadn't even formally gotten married, so the term divorce doesn't even apply yet!</p><br/><p>The more Nangong Yan thought about it, the more delighted she became. She pulled Baili Yu to walk out, but even after tugging several times, he didn't budge. She turned around and glanced towards Baili Yu in confusion. \"Senior Brother, Sister-in-Law doesn't mind, so what are you doing? Master is serious this time. I was so scared by his expression!\"</p><br/><p>Baili Yu said, \"Did Master really say this?\"</p><br/><p>\"En!\"</p><br/><p>\"Alright…\" Baili Yu smoothly pulled his sleeve out of Nangong Yan's grasp and said calmly, \"En, I got it, so you can head back.\"</p><br/><p>\"Huh?\" When she saw that Baili Yu was moving to push open the door that Tang Doudou had closed, she was too stunned to react. Could it be that Senior Brother really wasn't afraid of Master breaking off their relationship? But with how close they were, how could he possibly not care?</p><br/><p>What exactly was going on?</p><br/><p>By the time she came back to her senses, there was no longer any trace of Baili Yu. All that could be seen was the tightly closed door.</p><br/><p>Nangong Yan bit her lips and walked up to knock again, but maids suddenly appeared and blocked her with blades.</p><br/><p>\"Master's going to rest. Miss Nangong, please head back!\" The maids spoke expressionlessly.</p><br/><p>Nangong Yan was furious. A bunch of lowly maids actually dared to point their swords at her!</p><br/><p>\"Move aside! How dare you treat me this way with your statuses? I'll have Senior Brother sell all of you to a brothel!\" Nangong Yan walked up and tried to knock on the door again.</p><br/><p>The closest maid didn't have mercy at all and slashed directly towards Nangong Yan.</p><br/><p>Although Nangong Yan had spoken arrogantly, she didn't dare to just stand there and challenge the maid. She hastily dodged, but she was furious and started shouting, \"Senior Brother! Senior Brother! Hurry and save me! They want to kill me!\"</p><br/><p>The maids continued pointing their swords at Nangong Yan expressionlessly.</p><br/><p>Nangong Yan shouted for a long time, but Baili Yu didn't reply, so she started panicking. What was with Senior Brother now? Had she said something wrong?</p><br/><p>Just as she was puzzling over this, she heard something from the room. \"En, go ahead and kill her!\"</p><br/><p>Nangong Yan's eyes widened when she heard Baili Yu's unconcerned tone. She refused to believe this. \"Senior Brother, how could you treat me this way!?\"</p><br/><p>However, Baili Yu had no intention of paying any more attention to her. The maids started approaching Nangong Yan with their swords in hand.</p><br/><p>Nangong Yan stomped angrily, but she didn't dare to risk her life and hastily ran away.</p><br/><p>When the sounds from outside gradually faded, Tang Doudou stretched and asked, \"You really aren't going to visit your master?\"</p><br/><p>\"I'm not going,\" replied Baili Yu even as he kept staring at her.</p><br/><p>Now Tang Doudou was feeling that something was off. This guy had been staring at her from the moment he walked in. His gaze was so strange that she felt creeped out.</p><br/><p>\"Is there something on my face?\" asked Tang Doudou.</p><br/><p>Baili Yu replied, \"No.\"</p><br/><p>\"Then I got fatter?\" asked Tang Doudou.</p><br/><p>Baili Yu replied, \"You're not fat.\"</p><br/><p>Tang Doudou got annoyed now. \"Then what are you looking at?\"</p><br/><p>This time, Baili Yu didn't reply and just smiled mysteriously.</p><br/><p>Tang Doudou became alarmed. Did this guy fall under a spell or something?</p><br/><p>As she thought this, she reached out to touch Baili Yu's forehead while muttering, \"It couldn't be that you've really fallen under a spell? No way, right? It's not like a witch or devil came in earlier…\"</p><br/><p>Baili Yu burst out laughing. This little lady sure held grudges, to curse at Nangong Yan in such a roundabout way.</p><br/><p>He pulled her into his arms. \"Did Wife get jealous just now?\"</p><br/><p>What? Tang Doudou blinked in confusion. She got jealous? What the heck would she be jealous about?</p><br/>\n</div>"}