{"title": "Chapter 436: His Brother", "id": 436, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-436-his-brother", "volume_title": "Volume 5", "body": "<h1>Chapter 436: His Brother</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>\"What's wrong?\"</p><br/><p>\"Huh?\" Tang Doudou snapped back to her senses. \"I'm fine. I'm just wondering why Su Yi didn't show himself and even launched a sneak attack! He's seriously getting more and more shameless!'</p><br/><p>Baili Yu knew that she wasn't telling the truth, but he didn't push her. If she was willing to talk, he was happy to listen, but he wouldn't force her if she didn't want to. Everyone had their own secrets even if she was already his wife. And it was because she was his wife that he would pay her the highest respect.</p><br/><p>They were silent for a while as they walked forward.</p><br/><p>Meanwhile, not far from them, Jun Xin and Baili Yiling were in serious trouble.</p><br/><p>Baili Yiling was in a horrible mood. She and Jun Xin had almost died on that unknown island.</p><br/><p>Those tigers weren't ordinary tigers. They were practically like savage beasts that had survived the prehistoric era. Even Jun Xin, who had at some time recovered his martial arts, had found it tough to deal with them.</p><br/><p>After they finally managed to deal with the tigers, what greeted them next was the seemingly infinite amount of soul devouring bugs.</p><br/><p>She had never imagined that there would be so many soul devouring bugs on this island.</p><br/><p>Jun Xin had gotten severely injured again while trying to save her.</p><br/><p>When Baili Yiling recalled that situation, she felt once again that they were seriously lucky to have made it out alive. As she was thinking about all of this, she sighed softly.</p><br/><p>There came the sound of light coughing, then a hand that clearly cared nothing about cherishing the jade abruptly slapped her shoulder. \"Stop sleeping, time to go.\"</p><br/><p>She was already awake, but she was seriously too tired. Even after sleeping for so long, she still didn't want to open her eyes. She didn't even want to move her fingers. However, when she heard Jun Xin's weak voice, she opened her eyes. Jun Xin's pale face appeared in front of her. He looked exhausted. Based on how bloodshot his eyes were, he probably hadn't rested at all.</p><br/><p>The only reason she had been able to sleep so soundly this time was because he had been standing guard.</p><br/><p>When this occurred to her, she started feeling guilty and hastily sat up. \"How long have I been sleeping?\"</p><br/><p>\"Twelve hours.\" When Jun Xin saw that she was awake, he stood up. \"Let's go.\"</p><br/><p>Twelve hours? Baili Yu was stunned. She felt like she had slept for a long time, but she hadn't expected it to be that long. This meant that Jun Xin hadn't even closed his eyes once in these twelve hours?</p><br/><p>As she was thinking this, she saw Jun Xin walk off while staggering slightly. She hastily caught up with him and then grabbed his arm to support him. \"Has your injury gotten a little better?\"</p><br/><p>\"It's fine.\"</p><br/><p>As Jun Xin spoke, he inadvertently put his full weight on Baili Yiling. His originally very bright eyes were now dim. He didn't tell Baili Yiling that when they had been fighting off the soul devouring bugs, a very small soul devouring bug had somehow made it inside his body and had been hibernating this entire time. He had only discovered it yesterday, so he spent the entire night trying to suppress that soul devouring bug with his inner strength. However, it was a futile effort.</p><br/><p>He was about to die. He was going to die for real this time.</p><br/><p>No matter how severe his injury was, no matter what he was poisoned with, he had always managed to figure out a way. However, when a soul devouring bug made its way into your body, not even a Daoist immortal would be able to do anything.</p><br/><p>Baili Yiling wasn't aware of Jun Xin's current situation. She was just confused since Jun Xin had always felt very light, but now he was extremely heavy. She had to revolve her inner strength in order to lift him up. \"Jun Xin, hold on, alright? Just hold on for a little longer. We're close to North Hara City. Once we get to the city, I'll immediately get in contact with Big Brother and have him find a doctor to treat you.\"</p><br/><p>Jun Xin tugged out a smile. If he could hold on until they made it back, he would do so even if she hadn't told him to.</p><br/><p>He still wanted to see Tang Doudou. He wanted to know if she had gotten better.</p><br/><p>If it weren't for the fact that he still wanted to see Tang Doudou, he would've already lost the will to continue walking. He was really too tired. The agony caused by the soul devouring bug digging into his heart was too painful. Every time he took a step, he could feel his heart bleeding. That terrible pain made him want to just pull out his dagger and commit suicide.</p><br/><p>Baili Yiling had no idea that Jun Xin, who she was carrying, already wished to die. When she saw that Jun Xin didn't even have the strength to speak, she said, \"I feel better now that I've rested, so just let me carry you!\"</p><br/><p>Jun Xin didn't reject her offer and allowed her to put him on her back. However, his weight caused Baili Yiling's legs to tremble. Her eyes filled with puzzlement again. How did Jun Xin become so heavy over the course of just one night?</p><br/><p>What she didn't know was that the reason why she had felt that Jun Xin was light before was Jun Xin's doing. He knew that it would definitely be hard for her, as a girl, to carry him, so he used his inner strength to decrease his weight as much as possible. It was also precisely because he did this that the soul devouring bug was able to take advantage of this chance. Otherwise, based on how strong his detection abilities were, he would've discovered that soul devouring bug a long time ago.</p><br/><p>Now all of his inner strength was being used to control the soul devouring bug, so his original weight became apparent. However, fortunately the after effects of that pill had already faded so Baili Yiling's inner strength had recovered somewhat. That was why she was able to steadily walk forward while carrying him.</p><br/><p>Jun Xin didn't regret the fact that he had ended up falling prey to the soul devouring bug due to having been focused on reducing his weight. He knew that Baili Yiling was a good lady and towards good ladies, he did quite cherish them like jade.</p><br/><p>As he was thinking these random things, after having endured a whole night, he couldn't help but fall asleep on Baili Yiling's back.</p><br/><p>The moment he fell asleep, his weight increased again. Baili Yiling staggered and almost dropped him. Fortunately, once she regained her balance, she saw a familiar figure appear in front of her.</p><br/><p>\"Big Brother!\" When Baili Yiling saw him, her eyes immediately filled with tears.</p><br/><p>Jun Xin was sleeping lightly, so when he heard this cry, his eyes immediately opened.</p><br/><p>He followed Baili Yiling's gaze and saw the person who he had been dreaming of this whole time in the midst of the rainbow of bubbles. She was in someone else's arm and looking over in surprise, then her facial color changed drastically and she jumped down to run over.</p><br/><p>Vaguely, he seemed to even see her slightly bulging stomach and her healthily flushed cheeks… Following that, his vision became increasingly blurry before it finally fell dark.</p><br/><p>She was fine! How great!</p><br/><p>These were Jun Xin's last thoughts.</p><br/><p>However, just as he was about to fully fall unconscious, he seemed to hear another flustered voice scream his name repeatedly, \"Jun Xin, Jun Xin… Ah Xin!\"</p><br/><p>Jun Xin and Baili Yiling's sudden appearance caught Tang Doudou completely unprepared. When she saw Jun Xin fall down from Baili Yiling's back, her expression immediately became filled with concern.</p><br/><p>She paid no attention to the blood and mud that covered the two and first helped Baili Yiling, who had fallen with Jun Xin, up. Following that, they looked towards Jun Xin. However, the moment they touched Jun Xin's body, blood spilled out from his mouth. It contained small chunks of unidentifiable flesh that seemed to resemble organ tissue!</p><br/><p>Upon seeing this, Baili Yiling's face turned completely pale and her head went blank. \"He, he…\"</p><br/><p>When Baili Yu saw this, despite the fact that he had always faced everything calmly, his expression also changed drastically and he quickly crouched down in front of Jun Xin. He pressed down on several points on Jun Xin's chest, then checked his veins. Following that, he looked up to ask Baili Yiling, \"Yiling, did you bring acupuncture needles?\"</p><br/><p>Baili Yiling didn't seem to hear. All that was in her eyes was Jun Xin.</p><br/><p>When Tang Doudou heard the urgency in Baili Yu's tone, she knew that Jun Xin was in a terrible situation. She glanced over and saw that Baili Yiling was staring blankly, so she reached out to take her hand. She knew that Baili Yiling was frightened, so she forced her tone to be calm. \"Yiling, Yiling. Don't worry, your older brother's here. Jun Xin- Jun Xin will be fine.\"</p><br/><p>Perhaps it was due to that last sentence, or perhaps it was the mention of her older brother, but Baili Yiling slowly came back to her senses. \"Big Brother…\"</p><br/><p>\"Do you have acupuncture needles?\" Baili Yu's expression wasn't just grave anymore, it was on the brink of panic. However, he hid it well so it wasn't easy for someone to tell.</p><br/><p>\"Acupuncture needles?\" Baili Yiling still hadn't snapped out of it fully and repeated this in confusion. Then she abruptly reached towards her waist and dug into the rucksack for a pouch. She took out a bunch of needles from inside and handed them to Baili Yu. \"Big Brother, what exactly happened to Jun Xin?\"</p><br/><p>Baili Yu took the needles and immediately started giving Jun Xin acupuncture.</p><br/><p>He moved extremely fast. In the time of a few breaths, Jun Xin's body was already filled with needles. He only loosened a breath in relief after he inserted the last needle.</p><br/><p>\"It's done? He'll be fine, right? Yiling, what exactly did you guys encounter? How did he end up like this?\" When Tang Doudou saw that Baili Yu exhaled and relaxed, she thought that things were fine now and turned to ask Baili Yiling questions.</p><br/><p>However, Baili Yiling had once again entered that possessed state and was staring fixedly at the needles on Jun Xin.</p><br/><p>Tang Doudou was very worried to see her like this. She called out to Yiling several times, but couldn't garner any reaction.</p><br/><p>Baili Yu pulled her and she finally turned to look at Baili Yu. He shook his head towards her and sighed lightly. \"Jun Xin, he…\"</p><br/><p>He didn't finish his words, but already, a strong sorrow filled the air.</p><br/><p>It came from Baili Yiling. Her tears fell like a broken strand of pearls, rolling silently over her cheeks and falling to the ground. \"No, he said he wouldn't die. He was clearly fine, how could he die…\"</p><br/><p>Tang Doudou was stunned as well. She looked at the three of them in turn, then her gaze finally stopped on Jun Xin, on that harsh red bloodstain.</p><br/><p>Baili Yu was worried that she'd get too stirred up and that the child would be affected, so he reached out to take her hands to stop her from twisting her clothes any further. \"Doudou, we need to bring Jun Xin back first before anything.\"</p><br/><p>They didn't even have time to go to that place. Baili Yu ordered the maids to bring Jun Xin back in the Chrysanthemum Glass Jade Palanquin to the closest city, which was North Hara City. Then he sent people to find Cang Baicao. Although Cang Baicao had told them to stop looking for him, Jun Xin's current condition was seriously too severe. He also sent people to invite Dao Xun over.</p><br/><p>Jun Xin was also Dao Xun's disciple so Dao Xun had the right to know that something had happened to Jun Xin.</p><br/><p>Moreover, Dao Xun knew a lot of secrets. A lot of the things he learned back then were from Dao Xun, so he had another motive in inviting Dao Xun.</p><br/><p>Baili Yu could tell that Jun Xin had been attacked by a soul devouring bug. He knew that the most likely outcome was death, but he still sealed Jun Xin's main meridians so that he could enter a death-like state. As long as they got rid of that soul devouring bug somehow, they'd have a chance to save Jun Xin.</p><br/><p>This was his brother. They had gone through life and death situations together for so many years. He also could not accept this fate!</p><br/><p>C: (இ﹏இ`｡)</p><br/>\n</div>"}