{"title": "Chapter 441: Don't Harbor Hope", "id": 441, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-441-dont-harbor-hope", "volume_title": "Volume 5", "body": "<h1>Chapter 441: Don't Harbor Hope</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Nangong Yan stiffened, then she looked over at Tang Doudou whose shoulders were shaking from suppressed laughter. Her eyes filled with anger and hatred. \"Fine, you’re all bullying me?</p><br/><p>\"I'll have you know that you guys were the one that forced me to this point!\"</p><br/><p>When Baili Yu saw that she was glaring at Tang Doudou like she wanted to rip Tang Doudou apart, he pulled Tang Doudou behind him and said coldly, \"If you change your ways, I'll still treat you as Master's disciple, but if you don't change, you shouldn’t blame me for being ruthless!\"</p><br/><p>After saying that, he left with Tang Doudou and Baili Yiling without paying any more attention to Nangong Yan.</p><br/><p>Nangong Yan stared at them as they left. The hatred in her heart grew like wild grass. However, there was nothing she could do, so she just left with an expression of contorted anger.</p><br/><p>\"We've finally managed to drive that woman off!\" Just as Tang Doudou sat down in the pavilion, she saw that Nangong Yan's figure had vanished at a corner and loosened a breath in relief. She had a maid bring tea, then took a big gulp before looking over at Baili Yiling whose brows were still furrowed in worry.</p><br/><p>Tsk tsk, the word emotion sure hurt!</p><br/><p>Baili Yiling, who was usually always straightforward and cheerful and dealt with matters cleanly, probably never imagined that there would come a day where she'd be so worried over someone.</p><br/><p>\"Yiling, don't worry too much. Have faith that Heaven helps the worthy. Didn't Jun Xin managed to survive last time as well? This guy is so tsundere and has such a bad temper. The king of hell will probably find him a pain in the ass and kick him right back.\"</p><br/><p>Tang Doudou purposefully made some strange expressions while saying this in a perfectly serious manner. Although Baili Yiling was really worried about Jun Xin, her personality was lively and this immediately made her burst out laughing. \"That's right, he has such a bad temper that even the underworld will probably find him troublesome!\"</p><br/><p>\"Haha!\" Tang Doudou also laughed, then she started telling Baili Yiling about more amusing things that had happened and stories that she had read online in the past until Baili Yiling was giggling uncontrollably.</p><br/><p>When Baili Yu saw them like this, he felt relieved as well. However, he still believed that there was a need to take some time to talk to Baili Yiling seriously about Jun Xin.</p><br/><p>Jun Xin wasn't just tsundere and bad tempered, he was also unbelievably obstinate. Once he decided on something, not even a hundred cows could shift his direction an inch. If it weren't for this fact, he wouldn't have destroyed Bloodthirster which had kept him company for so many years and switch to using that strange antique lamp. If he had still been using Bloodthirster, he probably wouldn't have been attacked by a soul-devouring bug either.</p><br/><p>Bloodthirster was made from the blood core stone of the ancient insect king and naturally emitted an intense baleful aura. Poisonous bugs feared the blood of the insect king and avoided approaching Bloodthirster. It was also due to Bloodthirster that they hadn't been attacked by any poisonous bugs and snakes in the desert back then.</p><br/><p>Baili Yu's heart leaped. Since Bloodthirster which was made from the blood core stone was capable of driving off bugs, then could they use it to force the soul-devouring bug out of Jun Xin's body?</p><br/><p>When Baili Yu's thoughts reached this point, he got up. \"You two should wait here for Ah Xin to wake up. I'm going to make arrangements for getting Jun Xin to a cold location. If he wants to see me, Doudou, just go listen to his message for me.\"</p><br/><p>Originally, he had been planning to go to Blood Pond to find the freak doctor, but with Dao Xun's method, they had to hurry and get Jun Xin to a cold place so that the soul-devouring bug would stop wrecking Jun Xin's body. Only then would they have the time to keep searching for a cure.</p><br/><p>However, he was also unsure of the idea Dao Xun suggested. If they sealed Jun Xin away, then what if he didn't wake up until they were all dead? When he finally woke up, what if the world had already gone through a huge transformation?</p><br/><p>What if he woke up to a world that was completely unfamiliar? What difference would there be from dying if he had to live completely alone in an unfamiliar world?</p><br/><p>\"Uh-huh, go. I'll be here!\" Tang Doudou patted her chest, then peeked at Baili Yiling. She was thinking that if Jun Xin asked for Baili Yu, she should just let Yiling go in! This girl would probably go crazy if she was left by herself outside.</p><br/><p>However, Baili Yu knew what she was thinking the moment her eyes whirled. \"When I get back, I'll be asking you about what Ah Xin said so you’d best remember everything clearly. Don't end up forgetting anything important.\"</p><br/><p>Was this guy a bug in her stomach?</p><br/><p>Tang Doudou looked towards the sky. He had instantly seen through her tiny scheme. Did this mean that he'd see through all her plots in the future?</p><br/><p>It was seriously scary ah!</p><br/><p>\"Alright, alright, I got it. You're nagging like an old grannie, just go and do whatever it is that you need to do alright?\" Tang Doudou pushed Baili Yu so that he would hurry and go. Fudge, even if he was going to say that, he should've done it a little more tactfully! It wasn't like Baili Yiling didn't have ears, there was no way she could miss his meaning!</p><br/><p>Baili Yu stopped at the eaves of the pavilion and glanced at Baili Yiling. \"Yiling.\"</p><br/><p>Baili Yiling was currently thinking about what he meant by what he said earlier. Could it be that he was worried she would harm Jun Xin?</p><br/><p>She didn't react when Baili Yu called her and only snapped out of her thoughts when Tang Doudou walked over and patted her shoulder. \"What's wrong, Big Brother?\"</p><br/><p>A strange expression flashed through Baili Yu's eyes. \"It's nothing. Take good care of your sister-in-law and make sure that she doesn't bump into anything.\"</p><br/><p>That was all?</p><br/><p>Tang Doudou glanced at Baili Yu in puzzlement. She was just about to speak when Baili Yu turned and walked away.</p><br/><p>\"Big Brother doesn't want me to see Jun Xin?\" Once Baili Yu left, Baili Yiling turned towards Tang Doudou and forced a smile.</p><br/><p>See, she caught the meaning.</p><br/><p>Tang Doudou laughed and wrapped an arm around her shoulder. \"Nonsense, your big brother is just nagging. You shouldn't take it to heart. After all, what if Jun Xin asks for you? Right?\"</p><br/><p>Baili Yiling sighed. How could Jun Xin possibly ask for her?</p><br/><p>\"Sister-in-Law, if he doesn't ask for me, can you help me bring a message?\"</p><br/><p>Tang Doudou didn't find this request surprising and after thinking about it briefly, agreed. It was just one message and wouldn't take much time. In addition, they didn't know who Jun Xin would ask for after all. Deciding on this so early was pointless.</p><br/><p>The two of them waited in the pavilion for an entire afternoon. When night was falling, there finally came sound from the wing and Dao Xun's figure appeared at the door.</p><br/><p>Tang Doudou and Baili Yiling shared a glance, then Baili Yiling half dragged Tang Doudou over.</p><br/><p>\"Master, Jun Xin, he…\"</p><br/><p>\"I've finished with the acupuncture, so he'll be waking up soon.\" Dao Xun's gaze swept over the two of them. \"Where's Ah Yu?\"</p><br/><p>\"He went to make arrangements for getting Jun Xin to a cold location,\" replied Tang Doudou.</p><br/><p>Dao Xun stroked his beard and nodded slightly. \"En, that's good.\"</p><br/><p>After saying that, he saw that the two were looking into the room anxiously and said, \"I'm going to go rest. Once Jun Xin falls asleep again, call me!\"</p><br/><p>\"Master, you're not going to stay here to observe?\"</p><br/><p>\"There's no need. It'll be fine with you two here.\" Dao Xun walked down the steps.</p><br/><p>That was good! Tang Doudou loosened a breath in relief. \"Alright, Master should head back to rest then! Just leave this place to us!\"</p><br/><p>Dao Xun nodded and continued walking. However, after a few steps, he paused and turned to look towards the two. \"Remember, only one person can enter, got it?\"</p><br/><p>Tang Doudou asked, \"Why?\"</p><br/><p>\"Doing as I say won't be the wrong choice.\" Dao Xun waved at them, then a maid walked up to lead him to his room.</p><br/><p>\"Purposefully being mysterious!\" Tang Doudou pouted unhappily.</p><br/><p>Baili Yiling said, \"Senior Dao Xun definitely has his reasons. Let's just go with what he instructed.\"</p><br/><p>\"Of course!\" Tang Doudou turned around to glance into the room at Jun Xin. \"Why's he still asleep?\"</p><br/><p>Baili Yiling look over too but she saw the person on the bed move slightly, then he abruptly sat up.</p><br/><p>\"What are you guys doing?\"</p><br/><p>Tang Doudou rushed in. \"Stinkin' brat! You're finally awake!\"</p><br/><p>Jun Xin looked towards her in puzzlement, then glanced at Baili Yiling who was walking in hesitantly. He frowned. \"What's going on?\"</p><br/><p>Tang Doudou told him everything in the briefest manner possible, then said, \"Your master said that if you have anything to say, you should just tell one of us. Time is pressing since you'll fall into a coma after this…\"</p><br/><p>Tang Doudou was used to his attitude. This stinkin' brat didn't care about his own life at all. He acted like he was a cat spirit with nine lives.</p><br/><p>However, Baili Yiling couldn't help but ask, \"Jun Xin, how could you be so unconcerned? You might never wake up after you fall asleep this time. You… Don't you have anything to say to me?\"</p><br/><p>After saying that, she looked towards Jun Xin earnestly, hoping that she would be able to hear what she longed for most from his mouth.</p><br/><p>However, Jun Xin just looked at her weirdly. \"What would I have to say to you? Didn't that old man say that only one person can stay? What are you still doing here?\"</p><br/><p>Tang Doudou: …</p><br/><p>Baili Yiling: …</p><br/><p>Following that, Baili Yiling smiled awkwardly to conceal the crestfallen feelings in her eyes. \"Haha, I was too excited and forgot for a moment. I'll head out first. You two…\"</p><br/><p>Tang Doudou felt bad. \"Yiling…\"</p><br/><p>\"I'm fine! I'll head out now. After all, Senior Dao Xun said that there wouldn't be much time, so you guys shouldn't waste it!\" After saying that, she turned around so that they couldn't see her expression. She ran to the door and quickly closed it.</p><br/><p>By the time she got outside, tears were already streaming down her cheeks.</p><br/><p>Tang Doudou looked at the closed door blankly for a moment, but she soon reacted and turned around to slap Jun Xin's arm angrily. \"You damned brat!\"</p><br/><p>Jun Xin was baffled. \"What did I do?\"</p><br/><p>\"…\" Tang Doudou looked up at the ceiling. They should just let this idiot die after all!</p><br/><p>\"Hey hey, let's not waste time anymore! I still have very important last words to say, so stop talking about outsiders,\" said Jun Xin rowdily.</p><br/><p>If it weren't for the fact that he was about to fall into an indefinitely coma, Tang Doudou really would’ve just slapped him to death. How could he hurt a young girl's heart like this? How was Yiling an outsider? For better or for worse, they had gone through life and death together!</p><br/><p>Tang Doudou expressed that her balls really hurt from this guy's idiotic manner!</p><br/><p>\"Hey! Stinkin' woman, are you going to talk or not? If you're not, then I'm going to sleep!\" Jun Xin urged her impatiently, but his unbridled eyes didn't shift away from Tang Doudou for even a moment. He wasn't dumb so of course he knew about Baili Yiling's feelings for him. However, he was even clearer on the fact that he couldn't accept Baili Yiling's feelings. He wasn't willing to accept her, nor was he worthy of her.</p><br/><p>Rather than leave her with an unclear possibility, it was better to clearly state his feelings so that she would stop harboring hope. If she didn't have hope, she wouldn't feel disappointment, and without disappointment, she wouldn't feel hurt.</p><br/>\n</div>"}