{"title": "Chapter 442: Blood Core Stone", "id": 442, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-442-blood-core-stone", "volume_title": "Volume 5", "body": "<h1>Chapter 442: Blood Core Stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>What could Tang Doudou say with how unconcerned and heartless this guy was acting?</p><br/><p>\"What last words do you have? Out with it already!\"</p><br/><p>Jun Xin rolled his eyes at her and sighed. \"So heartless!\"</p><br/><p>\"I'm heartless? Ha…\" Tang Doudou glowered at him as she sat down by the bed. \"Who's the one that’s truly heartless?\"</p><br/><p>Jun Xin immediately raised his hand and leaned over with a mischievous smile. \"Me, it's me. I'm the one that's heartless.\"</p><br/><p>Tang Doudou humphed. \"That's more like it.\"</p><br/><p>After that, the two fell silent. After a few moments of this, Tang Doudou felt like they were completely wasting time! Could it be that this guy really didn't have anything to say? Hadn't he been kicking up a fuss about leaving some last words just a moment earlier?</p><br/><p>\"You don't have anything to say to me?\" When she turned to look at him, she made direction contact with his eyes and found that he had been looking at her. She asked, puzzled, \"Why are you looking at me?\"</p><br/><p>\"I'm trying to figure out how exactly Baili Yu took a fancy to you with how ugly you are!\" Jun Xin laughed.</p><br/><p>Tang Doudou was speechless. \"How can you be in the mood to joke in this sort of situation?\"</p><br/><p>\"Tch. It's not like I'm about to die. What's there to be afraid of?\" Jun Xin rapped her forehead. \"Are you hoping for me to die?\"</p><br/><p>Tang Doudou really wanted to nod, but she just glowered at him. \"Quit wasting time and start talking already. The big evil spirit said that he'll be asking me what you said later.\"</p><br/><p>Jun Xin shrugged helplessly and fell back on the bed with his arms outstretched. \"He seriously won't let me off ah! I'm already about to die, but he's still trying to squeeze everything there is out of me. Tsk tsk…\"</p><br/><p>\"Pei! When you vomited blood, Baili Yu's face turned completely white from worry. How could you say this?\" Tang Doudou put her hand on her waist while pointing at Jun Xin unhappily.</p><br/><p>\"Woah, woah. How protective.\" Jun Xin sat up and supported himself with one hand. \"Humph, he's just worried that there'll be no one to help him handle things after I die.\"</p><br/><p>What else could Tang Doudou say?</p><br/><p>She turned to leave.</p><br/><p>Jun Xin hastily went over to block her way. \"I was just joking. Don't take it seriously.\"</p><br/><p>Tang Doudou scoffed without speaking.</p><br/><p>Jun Xin said, \"Fine, this little master admits he was wrong, alright?\"</p><br/><p>Tang Doudou humphed and crossed her arms without answering him.</p><br/><p>Jun Xin looked down and started walking back dejectedly. As he walked, he sighed, \"Aiy, then I'll just die. There's no one that cares about me anyways, death will just get rid of it all…\"</p><br/><p>He sounded like a little wife who had been angered and lost all hope in life!</p><br/><p>However, it reminded Tang Doudou that this wasn't the time for her to be willful. She had to coax this little young master into saying some useful things! It wasn't just because she needed to be able to pass it on to Baili Yu, but also so that they could start searching for some way to get rid of the soul-devouring bug!</p><br/><p>Since Dao Xun had them come ask Jun Xin, it meant that this guy definitely knew something.</p><br/><p>However, he was dragging the conversation all over the place and refusing to mention this matter. Tang Doudou couldn't help but wonder if this guy truly wanted to die?</p><br/><p>Tang Doudou had actually guessed right this time. Jun Xin currently did want to die. It was only because he still couldn't bear to leave Tang Doudou that he didn't commit suicide the moment he woke up.</p><br/><p>There were three reasons he wanted to die. The first was Tang Doudou, the second was the soul-devouring bug, and the third was Baili Yiling.</p><br/><p>\"Just talk already!\"</p><br/><p>Tang Doudou turned around helplessly and walked to him. She patted his shoulder with a heavy sigh. \"Jun Xin, don't be so willful. Living is better than anything. You're still so young, you definitely have a lot that you still haven't done. It's too sad for you to die just like this.\"</p><br/><p>Jun Xin said with a laugh, \"My guess was right. You really are looking forward to my death!\"</p><br/><p>Did this mean that she had guessed wrong?</p><br/><p>Tang Doudou stared at Jun Xin's eyes in puzzlement. She saw that his eyes were clear as water with no trace of impurity, but there was no trace of desire to live or any other emotions.</p><br/><p>Jun Xin glanced at her. \"What are you doing?\"</p><br/><p>Tang Doudou sat down again. Ever since her belly started bulging slightly, she always felt tired. It was tiring to stand and tiring to sit… Her waist hurt like crazy.</p><br/><p>The moment she sat down in front of Jun Xin, Jun Xin's attention was drawn to her slightly bulging belly. A trace of delighted surprise flashed through his eyes. \"You've fed him meat?\"</p><br/><p>Tang Doudou was clumsily trying to make herself more comfortable. When she heard this, she almost coughed out saliva. What did he mean by fed him meat?</p><br/><p>Jun Xin seemed to also realize that his words didn't come out quite right and said instead, \"What I mean is, you started eating meat right? That's why the child started growing?\"</p><br/><p>As he spoke, he reached out curiously to touch. He seemed to find this very novel.</p><br/><p>Tang Doudou slapped his hand away. \"Men and women should not touch hands!\"</p><br/><p>This was where her belly was. Even in the modern era, it wasn't good to let men casually touch that area, much less in the ancient era.</p><br/><p>So when she slapped his hand, he didn't get angry and just grumbled that she was stingy.</p><br/><p>He awkwardly retrieved his hand and rubbed it while asking, \"Then is it almost about to be born?\"</p><br/><p>\"I…\" Tang Doudou took a deep breath and told herself not to bicker with him.</p><br/><p>Jun Xin asked curiously, \"Is it a son or a daughter? Give birth to a daughter? Daughters are cuter! Sons are way too mischievous! They're not good!\"</p><br/><p>Tang Doudou was speechless.</p><br/><p>After Jun Xin said that, he fell silent for a while. Then he lifted his head and said hesitantly, \"There's a good way to deal with the soul-devouring bug.\"</p><br/><p>Huh?</p><br/><p>Tang Doudou turned around to look at him and blinked blankly. For a moment, she was too stunned to react.</p><br/><p>Jun Xin stopped looking at her and lay back down on the bed like he was just talking to himself. \"It's just that some of the items are too hard to find. Even Baili Yu might not be able to find it. If that's the case, we'd have to look for Lan Jia. He's the owner of those damned things so he'll definitely have a way.\"</p><br/><p>So he wanted to live now!</p><br/><p>Tang Doudou instantly understood what Jun Xin meant. However, why did his attitude suddenly change? Could it be that he sensed his time was almost up?</p><br/><p>When this occurred to Tang Doudou, she couldn't allow herself to worry over the insignificant things anymore and hastily asked, \"What is it? What's the method? If even your master doesn't know about it, will it be effective?\"</p><br/><p>She asked a lot of questions in a row. Had it been earlier, Jun Xin definitely wouldn't have answered honestly. However, his attitude had completely changed. After Tang Doudou asked her questions, he immediately replied, \"Blood core stone! As long as we can find a blood core stone, the soul-devouring bug can be dealt with! It's just that the only blood core stone still in existence has been made into Bloodthirster over a dozen years ago. It would be extremely difficult to find another one.\"</p><br/><p>\"I found out about this method in one of the secret storages of the Seven Great Saint Tribes. It's normal that Master doesn't know about it.\" He suddenly jumped off the bed and rummaged through the room. When he found a banknote, he hastily started writing on it. Soon, a mass of flowing characters appeared on the paper.</p><br/><p>Tang Doudou walked over to take a look and almost passed out. Could anyone even read this handwriting? It was like dog prints! It was even uglier than her writing and there were some circles and Xs substituting words!</p><br/><p>\"Yup, that's pretty much it!\" Jun Xin tossed aside the brush and picked up the paper full of scrawled words to blow on it.</p><br/><p>After carefully folding it, he handed it to Tang Doudou. \"Be careful with it. This little master's life depends on this!\"</p><br/><p>Tang Doudou didn't know whether to laugh or to cry. She unfolded it in front of him and looked at it, but still couldn't understand anything that was written. \"You, this…\"</p><br/><p>\"Give it to Baili Yu, he'll understand!\" Jun Xin interrupted her, seeming to know what she was thinking.</p><br/><p>\"Are you sure?\"</p><br/><p>\"Would I joke with my life?\"</p><br/><p>\"Alright.\"</p><br/><p>\"But make sure to tell Baili Yu that if he can't find the blood core stone, he should hurry and find Lan Jia! I still want to live for a while longer…\" As Jun Xin spoke, his gaze landed on Tang Doudou's belly. Tang Doudou hastily covered her belly and looked at him in alarm.</p><br/><p>Jun Xin smiled roguishly. \"Let's discuss a little matter?\"</p><br/><p>\"Huh?\"</p><br/><p>\"Let me be the kid's godfather!\"</p><br/><p>\"…\" Tang Doudou moved her hands away and rubbed her chin. \"What's there to discuss about that? I agree. However, I also have a question to ask you!\"</p><br/><p>Jun Xin was elated when Tang Doudou agreed to his request and started jumping around the room excitedly. When he heard that Tang Doudou had a question, he hastily came back and rubbed his hands nervously as he asked, \"What question?\"</p><br/><p>\"I'm asking for someone else.\" Tang Doudou glanced outside. She thought that Jun Xin wouldn't be awake for long, but it had already been an hour. Yiling must be anxious outside.</p><br/><p>When Jun Xin heard this, he lowered his hands and wiped his palms on his clothes. He glanced over at the door as well, but then quickly turned to face Tang Doudou. \"If you're asking something for Baili Yiling, don't ask. I'm afraid my answer will just disappoint her.\"</p><br/><p>As expected! This guy's favorite hobby was to act stupid! He had known about Yiling's feelings for him…</p><br/><p>Jun Xin took in Tang Doudou's shocked expression and continued with a smile, \"That idiot is usually pretty smart, but these past couple days, she's been unbelievably stupid. All her feelings showed on her face. It was hard to not figure it out.\"</p><br/><p>\"Yiling is a good lady, why don't you try accepting her?\" Originally, Tang Doudou didn't want to say this since she also knew about Jun Xin's feelings. If it weren't for this, she wouldn't have tried to pair him up with Baili Yiling.</p><br/><p>However, it was seriously hard to deal with this guy!</p><br/><p>As Tang Doudou silently complained about Jun Xin, Jun Xin scoffed. \"There's way more than one good lady in the world. Shouldn't I find one that I like?\"</p><br/><p>What could Tang Doudou say?</p><br/><p>She was just relieved that Baili Yiling wasn't here right now. If she had been here and heard these words, she probably would've been heartbroken all over again.</p><br/><p>Fortunately, even though Baili Yiling liked Jun Xin a lot, it hadn't been too long so there was still a chance that she could get over it. Tang Doudou felt that anyone that fell in love was Jun Xin was just asking to be traumatized. Jun Xin himself seemed to like suffering a lot. If it was someone he didn't like, even if a knife was against to his neck, he wouldn't accept the person.</p><br/><p>Forget it. She had already obtained the method to deal with the soul-devouring bug, so these other complicated feelings-related stuff, she'd just leave for Jun Xin to deal with himself once he wakes up!</p><br/><p>Furthermore, he said so himself that he wanted to find someone he liked. He had only interacted with Baili Yiling for a short time. Perhaps after more interactions, he'll end up liking her?</p><br/><p>Once she got back, she should have a talk with Baili Yiling. As for Jun Xin, there was no point wasting her breath on him.</p><br/><p>However, he seemed very spirited and showed no signs of being about to fall asleep. Could it be that Dao Xun got it wrong?</p><br/><p>\"Jun Xin ah…\" She was just about to ask if Jun Xin felt off anywhere when Jun Xin's eyes rolled back and he collapsed stiffly onto the bed.</p><br/><p>Da fudge!?</p><br/><p>…</p><br/>\n</div>"}