{"title": "Chapter 455: It Was On Purpose", "id": 455, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-455-it-was-on-purpose", "volume_title": "Volume 5", "body": "<h1>Chapter 455: It Was On Purpose</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After Xiao Siyuan pulled her back, he let go of her and asked quietly, \"Are you alright?\"</p><br/><p>How could she not be alright?</p><br/><p>Tang Doudou pushed him and walked towards the corridor. Xiao Siyuan was confused about her actions and was just about to follow her over when she turned around and pushed him into the room without an explanation.</p><br/><p>Bang! </p><br/><p>After closing the door, Tang Doudou chuckled and said, \"Since the madam isn't going to deliver us food, let's just forget about it. We're not hungry anyways, right?\"</p><br/><p>Xiao Siyuan didn't mind this. After all, he hadn't come out to eat with her.</p><br/><p>\"If there's nothing else, Alliance Head, Siyuan will be heading back.\" They had been out for a while and Xiao Yi's temperament was too rash. Xiao Yi and Lin Shuxuan were like fire and water. When they fought earlier, Xiao Yi had been on the losing end, so he'd definitely be trying to cause Lin Shuxuan trouble right now.</p><br/><p>When Xiao Siyuan's thoughts reached this point, he felt even more strongly that staying here was inappropriate and wanted to head back to make sure of the situation. Lin Shuxuan's father had been injured in the operation this time and not many people had come from the Lin family stronghold. They weren't a match for Xiao Yi at all, and although Lin Shuxuan didn't know martial arts, he was capable of pissing off Xiao Yi with just a single word.</p><br/><p>\"Hey, we're already out here so there's no rush!\" Tang Doudou's intentions weren't as deep as Xiao Siyuan was making them out to be. She just wanted to trick real information out of him.</p><br/><p>If Xiao Siyuan wasn't willing to give her real information, she didn't mind resorting to emergency measures. Although she wouldn't be able to beat Xiao Siyuan, wasn't there plenty of help outside?</p><br/><p>When she recalled the glimpse she caught of Ye Chuan downstairs, she couldn't suppress a smug smile. If Ye Chuan was here, then Baili Yu was definitely nearby too! As long as he was around, she could be as unbridled as she pleased!</p><br/><p>However, didn't that manservant from earlier say that Baili Yu had headed out to do something?</p><br/><p>When had he come back?</p><br/><p>Could it be… An unpleasant thought suddenly occurred to her. Fudge! It couldn't be that Baili Yu came to this brothel to deal with matters?</p><br/><p>What happened to his mysophobia?</p><br/><p>What happened to never frequenting prostitutes and avoiding immorality?</p><br/><p>Tang Doudou finally understood what the elders meant by it would be better to believe that a female pig could climb a tree than it would be to believe in a man's words!</p><br/><p>The more she thought about things, the angrier she got. When Xiao Siyuan saw the rage on her face, he couldn't help but be puzzled. He didn't seem to have said anything offensive? Why did she get angry all of a sudden?</p><br/><p>\"The city lord's residence isn't very safe. The seniors have all gotten injured and of the younger generation, I'm the only one that hasn't gotten injured and can make the decisions. If I stay out too long, I'm afraid that something bad would happen. Alliance Head, if you don't have any other matters, Siyuan really does have to leave.\" After being silent for a few moments, when Xiao Siyuan saw that Tang Doudou didn't have the intention to keep talking, he couldn't help but furrow his brows. Could it be that she was only trying to lure him out and didn't actually plan to discuss something with him? </p><br/><p>Could it be that his guess was wrong?</p><br/><p>The truth was actually as Xiao Yi had said, she really had been behind what happened at the manor?</p><br/><p>His words prompted Tang Doudou to snap out of her thoughts and she silently sorted out her plan. After a moment, she said slowly, \"I'm sure you're also aware of what I need to ask. Since you're short on time, I'll get straight to the point. There's only one question I have right now. What exactly happened with the four large clans?\"</p><br/><p>When Xiao Siyuan heard this, he looked towards her meaningfully and asked, \"Shouldn't we be asking this of you?\"</p><br/><p>\"Asking me? Why me?\" asked Tang Doudou in confusion.</p><br/><p>Xiao Siyuan said, \"Of course we need to ask Alliance Head why you lured us into the manor and caused us to suffer so many casualties?\"</p><br/><p>\"You also believe that this was my intention?\" asked Tang Doudou.</p><br/><p>Xiao Siyuan shook his head. \"I can't say I believe it, that's why I need Alliance Head to give me a satisfactory answer.\" </p><br/><p>\"The answer is that wasn't my intention at all. I just wanted you guys to find the mysterious person. I never expected for him to be that powerful. I never imagined that he would get the upper hand despite your numbers and injure you all so severely!\" Tang Doudou replied honestly. The only thing she left out was that she was hoping for Qing Yin and the others to save Jun Xin and Baili Yiling in the chaos.</p><br/><p>Although she didn't mention this matter, Xiao Siyuan brought it up. \"Then why was Qing Yin following behind us that entire time? Why had she been acting so suspicious?\"</p><br/><p>\"She's not my subordinate, so how would I know what she was doing?\" Tang Doudou refused to admit for the life of her that there was another intention behind it.</p><br/><p>When Xiao Siyuan saw this, he said, \"Since Alliance Head's attitude is thus, what else is there to say? Siyuan will excuse himself!\"</p><br/><p>As he spoke, he stood up to leave.</p><br/><p>However, how could Tang Doudou possibly let him leave when she hadn't finished saying what she needed to say? She hastily called, \"Wait!\" </p><br/><p>Xiao Siyuan kept walking without a pause and he had already reached the door. Tang Doudou hastily said, \"I admit it. There was another motive in having Qing Yin follow you guys.\" </p><br/><p>\"What motive?\"</p><br/><p>\"What else could it be? I was worried that you guys were working with the mysterious person! You guys suspect me of working with the mysterious person, so how could I not suspect you guys? However, after this incident, things are clear. If you guys really were colluding with the mysterious person, you couldn't have suffered such severe injuries,\" sighed Tang Doudou.</p><br/><p>Xiao Siyuan probably found her words sincere because he stopped walking and asked, \"You suspect Grandfather of colluding with that mysterious person because we told you before that Grandfather had the intention of overthrowing you?\"</p><br/><p>\"Yes, after all, what else could it be?\"</p><br/><p>Tang Doudou inwardly celebrated when she saw that Xiao Yi believed her. In reality, she hadn't thought of this at all.</p><br/><p>Although Xiao Siyuan was very meticulous, it still didn't occur to him that he had mistook Tang Doudou's meaning by just a bit. When it occurred to him that he was also partially responsible for this outcome since Grandfather actually hadn't had that intention and it was the two of them that mistook Grandfather's meaning, he felt guilty. If it hadn't been for his misunderstanding, perhaps this wouldn't have happened.</p><br/><p>As of now, Grandfather had been injured. At that time, when he told them what he actually said back then, Xiao Yi had regretted things so badly! It was also because of that, which was why he had been so angry at Tang Doudou.</p><br/><p>He was angry with Tang Doudou, but even more, with himself!</p><br/><p>\"So it was like this. Then we really have been wrong in blaming Alliance Head. It's just that this matter isn't simple. Those strange things are too incomprehensible. Does Alliance Head know who exactly that mysterious person is? Where did he come from? Why is he targeting us this way?\"</p><br/><p>When Tang Doudou saw that his tone had relaxed a lot and was not as distant as before, she said, \"I already have a few clues about this event. It's probably still closely related to the Seven Great Saint Tribes.\"</p><br/><p>\"Oh? The Seven Great Saint Tribes again?\"</p><br/><p>\"That's right.\" Tang Doudou told him about most of what she knew. As Xiao Siyuan had said, since the family heads were injured, he was the only one that could make decisions for the four large clans right now. As long as he knew this information, he'd definitely pass it onto the family heads. Then when they met again, they would be able to clear up past misunderstandings.</p><br/><p>Following that, they could discuss how to deal with the mysterious person, Lan Jia!</p><br/><p>However, she still kept a few secrets. She didn't tell Xiao Siyuan that the mysterious person was Lan Jia because she wanted to keep a trump card and she wasn't completely sure that person really was Lan Jia. This was still an unconfirmed guess.</p><br/><p>So it was the doing of the Seven Great Saint Tribes again!</p><br/><p>Then this was troublesome.</p><br/><p>Xiao Siyuan then asked, \"Does Alliance Head have a plan to deal with him?\"</p><br/><p>If she had a plan, she wouldn't have come to look for him.</p><br/><p>Tang Doudou said with a smile, \"This still requires careful discussion. For the time being, the most important thing is for the family heads to recover. Oh, that's right. I heard Elder Yu and the others say that it was you guys that had suddenly gone crazy and killed everyone in sight. Why did that happen?\"</p><br/><p>Indeed, he really couldn't make the decision about such an important matter. They had to wait until the family heads recovered before discussing what to do next. It was fortunate that Bai gongzi's medical expertise was extremely high. When he went to visit Grandfather earlier, Grandfather's pallor had improved a lot so it probably wouldn't be long until he fully recovered.</p><br/><p>Hence, he set these matters aside for now and answered Tang Doudou's question. \"We're also very confused about this matter. It was a disciple of our Xiao family that fell to it first. I don't know what he touched, but he collapsed to the ground and white froth started bubbling out of his mouth. His eyes were wide and bloodshot as he convulsed on the ground. The other disciples thought that he had been poisoned and walked up to check on him, but the disciple that was lying weakly on the ground, seeming close to death, suddenly used his sword to cut off the arm of the nearest disciple.\"</p><br/><p>\"Oh? Then did you guys see what he touched?\" Tang Doudou was alarmed by this description. This matter seriously was strange!</p><br/><p>Xiao Siyuan said, \"We didn't see it, but that disciple said that he had touched a bug.\"</p><br/><p>\"It's a bug again?\"</p><br/><p>\"That's right, it was a bug. However, the bugs we touched later were different from that bug.\"</p><br/><p>Tang Doudou became interested. Perhaps it was this different that could explain why Xiao Siyuan and the others were faring much better than Jun Xin even though they had been attacked by the soul-devouring bugs.</p><br/><p>Xiao Siyuan continued, \"The bugs we touched were black and had incisors covering their bellies. Each one was probably only as big as a fingernail. However, that disciple saw a red one that was five times as large as the one that we saw. Its red glowing underbelly had extremely long incisors and it had antennas!\"</p><br/><p>It was red? </p><br/><p>Tang Doudou was even more surprised. The ones she had seen, encountered, and the ones that Jun Xin and Baili Yu know of were all black. When did a red one emerge?</p><br/><p>Could it be that wasn't a soul-devouring bug?</p><br/><p>Or had the mysterious person created a new species?</p><br/><p>Xiao Siyuan sat down opposite Tang Doudou to continue. \"It wasn't just that. The stranger events occurred after. The people that were injured by that disciple exhibited strange symptoms.\"</p><br/><p>\"They started killing on sight?\" Tang Doudou finally understood why the people of the four large clans would suddenly behave so strangely. It was really as Elder Yu had said, it was due to the bugs.</p><br/><p>\"You were infected as well?\" asked Tang Doudou.</p><br/><p>Xiao Siyuan's expression now became a little conflicted. After a good while, he said slowly, \"I wasn't really infected.\"</p><br/><p>If he was, he wouldn't have told Mother Mo Yun's disciples to get away.</p><br/><p>However, those disciples had been so arrogant and kept insulting them, which was why he took advantage of this chance to teach them a lesson. Even though he was good-hearted, he wasn't an angel.</p><br/><p>Furthermore, those disciples of Mother Mo Yun had horrible reputations on the Jianghu anyways. He had already been merciful in not killing them.</p><br/><p>Xiao Siyuan's honestly surprised Tang Doudou and the fact that he had pretended to be infected to injure Mo Yun's people surprised her even more.</p><br/>\n</div>"}