{"title": "Chapter 454: Disturbance at the Brothel", "id": 454, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-454-disturbance-at-the-brothel", "volume_title": "Volume 5", "body": "<h1>Chapter 454: Disturbance at the Brothel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>\"Xiao Yi, you ungrateful bastard! Who's a coward? Don't forget who it was that worked so desperately to carry you back! Is this the way you treat the person who saved your life?\" Xiao Yi's words made Lin Shuxuan explode and he whipped around to shout at Xiao Yi.</p><br/><p>Xiao Yi was distracted by his shouting and got his sword knocked out of his hand by Xiao Siyuan. It fell with a clatter to the ground. He wanted to pick it up but Xiao Siyuan kicked it away from him. \"Calm down, Xiao Yi! Have you forgotten what Grandfather instructed? We cannot be rash before figuring out what exactly happened!\" </p><br/><p>However, Xiao Yi couldn't take in their words at all right now. All he knew was that both of them were against him. He became enraged and his face was red at he pointed at them two of them coldly. \"Alright, fine! In any case, whatever I do is always wrong to you guys!\"</p><br/><p>Then he directed his indignant gaze towards Tang Doudou. \"It's too early for you to be smug! Humph!\"</p><br/><p>How did this guy managed to find any trace of smugness on her face?</p><br/><p>Tang Doudou watched Xiao Yi stomp away speechlessly. When she saw that his arm was wrapped with white bandages, she recalled that Xiao Yi's martial arts skill was higher than Xiao Siyuan’s. The only reason Xiao Siyuan had been able to strike Xiao Yi's sword away was probably because Xiao Yi's arm had been injured.</p><br/><p>\"Alliance Head, Xiao Yi was just angry about our injured brothers. Please forgive his offense!\" Right after Xiao Yi left, Xiao Siyuan cupped his fist towards Tang Doudou and apologized on Xiao Yi's behalf.</p><br/><p>However, there was no way that Tang Doudou would bother being offended by a simple-minded person like Xiao Yi. \"Why would I hold it against him? I can understand how he feels after everything that's happened.\"</p><br/><p>However, she was becoming curious about Xiao Siyuan's attitude. Even if he no longer trusted her, why was he being so polite? Could it be that he just wanted to keep a distance from her?</p><br/><p>Lin Shuxuan also didn't like Xiao Siyuan's current attitude. He pulled Tang Doudou over and glanced around before asking quietly, \"Why did you come here? Aren't you worried that these psychos would…\"</p><br/><p>Before he could finish his words, Xiao Siyuan gave a dry cough to interrupt. \"Alliance Head, didn't you want to take a walk outside?\" </p><br/><p>Tang Doudou glanced towards him and saw that there was something she couldn't make out in his eyes. Her thoughts whirled, then she said to Lin Shuxuan, \"I'm going to take a walk with Siyuan. Do you want to come?\"</p><br/><p>Lin Shuxuan didn't even need to consider things. \"I'll go! Why wouldn't I go? I'm about to go crazy from staying in here!\"</p><br/><p>\"Lin gongzi should stay in!\" However, Xiao Siyuan wouldn't agree. \"Your injury is severe and requires quiet rest. It's not good for you to walk around.\"</p><br/><p>Lin Shuxuan didn't care. \"You shouldn't listen to their blind words. I’ve already recovered ages ago! If there's still something wrong with me, it's due to being stuffed up in here!\"</p><br/><p>When Tang Doudou saw that the two of them were starting to argue, she said, \"Siyuan's right. You should stay here to recover. We can just head out the next time I come by, alright?\"</p><br/><p>\"You want to come again?\" However, the moment she said that, Lin Shuxuan shouted in alarm. He then hastily covered his mouth and whispered, \"It's best if you don't come by again! I won't head out either, so you and Xiao Siyuan should hurry and go!\"</p><br/><p>Tang Doudou and Xiao Siyuan were surprised by his sudden change in attitude, but they just nodded and told him to rest up before walking out of the residence.</p><br/><p>The two of them were silent the entire way back. After walking for a long time, Tang Doudou couldn't take it anymore. She pointed towards the building to the side and said with a forced laugh, \"Siyuan, let's head up to rest for a while!\"</p><br/><p>Xiao Siyuan already had similar intentions so when he heard this, he reflexively moved to walk to the building. However, when he got a clear look at the building Tang Doudou was pointing at, his expression stiffened and he forced himself to come to a stop. \"This…\"</p><br/><p>However, before he could say anything, he was pulled in by Tang Doudou.</p><br/><p>\"Aiyoh! gongzi, hurry and come in!\" The moment they walked in, an overly coquettish voice appeared.</p><br/><p>\"Alliance Head… This…\" When Xiao Siyuan saw this, his usually gentle expression became completely different.</p><br/><p>A crafty light flashed through Tang Doudou's eyes, but she said with an unperturbed expression, \"Other places aren't safe. This place has a lot of people so there'll actually be less people that pay attention to us.\"</p><br/><p>Xiao Siyuan seemed very gentle on the surface, but in reality he was extremely cautious. If they went anywhere else, it was very likely that she wouldn't be able to get anything out of him. However, this was a brothel with all sorts of orioles and swallows that were here for that sort of service, so no matter what, inexperienced youngsters would be discomfited here.</p><br/><p>Her words made a bit of sense. Xiao Siyuan was a little vexed by the madam of the brothel and just wanted to get away, so he nodded in agreement for Tang Doudou to make the arrangements.</p><br/><p>When Tang Doudou saw that he wasn't objecting, she turned around with a smug smile and had the madam hurry and prepare food.</p><br/><p>When the madam saw that Tang Doudou was generous with her money, she smiled so widely that her entire face crinkled up and the white powder on her face kept spilling down. \"Ah Lian ah! Hurry and lead these two guests upstairs!\"</p><br/><p>Xiao Siyuan loosened a breath in relief when he saw that the madam meant to leave. However, before he could even relax fully, a soft arm wrapped around him. \"gongzi…\"</p><br/><p>The delicate voice was so sweet that Tang Doudou felt like her goosebumps were about to fall to the ground. Meanwhile, Xiao Siyuan who was being tugged at by the girl with heavy makeup had even stronger of a reaction. His face completely paled and he wanted to push her away. However, at the same time, he was worried about touching her exposed skin. His expression was very conflicted.</p><br/><p>Tang Doudou didn't dare to corner him too much because it would be troublesome if he couldn't take it anymore and ran off. Hence, she quickly pulled that woman away. \"Go, go! Move aside! Don't delay this big master's business!\"</p><br/><p>The woman curled her lips unhappily. When she saw Tang Doudou's slightly bulging belly, a trace of amusement appeared in her eyes. Could it be that this woman felt that since she couldn't very well do that right now, she was bring her husband here for someone else to service?</p><br/><p>What a strange sight! It was seriously remarkable! Truly, a person saw all sorts of things if they lived for a long time!</p><br/><p>It was just a pity that the handsome young man didn't seem very willing. He was truly a good man ah!</p><br/><p>But, no matter how good he was, it didn't mean anything…</p><br/><p>The woman watched as they walked upstairs side by side. The man's back was straight as a pen like it was made from bamboo. Meanwhile, although the woman was burdened by pregnancy, she wasn't clumsy at all and her steps were light. Her delicate and fresh looks were also very pleasant!</p><br/><p>\"Haa, it's truly an ideal pair of a talented man and beautiful woman! A match made in heaven!\" The woman bit on her handkerchief as she remarked this with a sigh.</p><br/><p>\"Really?\" At some time, a red figure had appeared next to her. The person's scarlet lips lifted slightly as he said this in slight amusement.</p><br/><p>The woman was startled and abruptly turned around to look, then her breath was taken away!</p><br/><p>Wasn't this man too good-looking!</p><br/><p>The couple from earlier in comparison to him was like the moon being compared to a pearl. They couldn't be even mentioned on the same level!</p><br/><p>As countless thoughts of praise flashed through the woman's head, Baili Yu had already walked past her to slowly walk upstairs. His alluring crimson garment and his long silky strands of hair that were casually swept back contrasted his jade-like skin beautifully. Countless stars seemed to flicker in his amused peach flower eyes so that a person couldn't help but lose themselves within them.</p><br/><p>During the day, the brothels usually didn't have many customers, but there were still some guests that intoxicated themselves without restraint.</p><br/><p>The people that were sober were so stunned by Baili Yu's breathtaking looks that they completely forgot what they were trying to do and stared at his movements without even blinking. They couldn't help but fear that this beautiful scene would be gone by the time they opened their eyes again.</p><br/><p>A lady that had been completely captivated ended up pouring wine on a customer. The customer who was already drunk immediately smacked her face hard.</p><br/><p>\"Wretch!\"</p><br/><p>\"Ah! I'm sorry! I'm sorry! I didn't do it on purpose!\" The woman snapped out of it due to the slap and was frightened to see the customer glaring at her. She hastily used a handkerchief to wipe that person's clothes, but the more she wiped, the worse it became. The customer was fed up and kicked her away.</p><br/><p>\"Such a mood-ruiner! Scram!\" </p><br/><p>\"Many thanks, sir. Many thanks!\" When the woman saw that the customer didn't intend to continue pursuing this matter, she hastily kowtowed towards him, then ran upstairs. Due to her panic and relief, she forgot about the fact that Baili Yu was currently walking up the stairs and ran into him.</p><br/><p>However, before she could even make contact, Baili Yu had pushed her away with a flick of his sleeve.</p><br/><p>\"Ye Chuan! Reserve this building! Throw out all the irrelevant people!\" He was a little annoyed with all the people here. If it weren't for the fact that the stinkin' girl ran in here, he never would've come into this kind of place.</p><br/><p>Ye Chuan, who had been hidden in the shadows, jumped down from the roof. There were about a dozen hidden guards with him.</p><br/><p>Everyone started panicking when so many mysterious people appeared. Several timid women started screaming.</p><br/><p>Baili Yu was worried that the dumb woman upstairs would be startled by the disturbance and his eyes flashed. Ye Chuan immediately caught the meaning and nodded. He waved towards the hidden guards and the guards moved rapidly to throw the drunkards out and gather the women up. They had the madam move them into their rooms and keep them confined.</p><br/><p>\"S-sir… this, t-this, what's going on!?\" The madam had weathered plenty of scenarios so she stood up to this situation better than the other women and was actually able to get a sentence out.</p><br/><p>Ye Chuan glanced towards her expressionlessly. \"Don't look at the things you shouldn't look at, don't listen to what shouldn't be listened to, and don't ask what shouldn't be asked.\"</p><br/><p>After saying that, he pushed the hilt of his blade with his thumb to reveal the sharp glint of the sword. The madam hastily covered her eyes and nodded, \"Yes, yes. I understand, I understand! I definitely won't look, listen, or ask!\"</p><br/><p>Ye Chuan paid no more attention to her. He had someone keep watch, then walked to Baili Yu. \"Master, everyone has been driven off.\"</p><br/><p>\"Good,\" replied Baili Yu mildly. He released the woman whose movements he had sealed earlier and was just about to tell Ye Chuan to send this woman away as well when there suddenly came the sound of a door opening.</p><br/><p>Baili Yu's figure flashed and instantly disappeared. Ye Chuan also concealed himself.</p><br/><p>The woman that had been suddenly released lost her balance and started falling backwards. When Tang Doudou poked her head out to check on the situation, this was the scene she saw. She reflexively ran out to catch the woman, but she slipped and started falling.</p><br/><p>From this direction, if she fell, she would fall directly off the balcony!</p><br/><p>Baili Yu was just about to rush over to catch this dumb woman when Xiao Siyuan came out from the room. When he saw that Tang Doudou was about to fall, he moved even faster than Baili Yu and grabbed Tang Doudou's hand. With a tug, she fell into his arms!</p><br/>\n</div>"}