{"title": "Chapter 452: Helping Someone", "id": 452, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-452-helping-someone", "volume_title": "Volume 5", "body": "<h1>Chapter 452: Helping Someone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tang Doudou lifted her brows. “Hm? Why aren’t you saying anything?”</p><br/><p>The youngster snapped out of it and examined Tang Doudou. He saw that she seemed about seventeen and that she had big bright eyes and an oval face. Her black hair shone in the sunlight and the yellow garment she had on made her seem mischievous and lively.</p><br/><p>However, her belly was bulging slightly. This was a pregnant woman!</p><br/><p>The youngster was stunned. Crap. Stealing something wasn’t too bad. If he got captured, he’d at most be beaten. However, if a pregnant woman refused to let him off after he knocked into her and insisted that he took responsibility or something, it’d be huge trouble!</p><br/><p>“With how flustered you look and all the people chasing after you, you’ve probably stolen something?” Tang Doudou narrowed her eyes and smiled, then took advantage of the fact that the youngster was still stunned to fish an embroidered purse out of his ragged clothing.</p><br/><p>The youngster only snapped out of it when she took the purse and reached out to snatch it back. “Give it back to me!”</p><br/><p>After saying that, he suddenly felt that something was off and peered at Tang Doudou again. “Have I seen you somewhere before?” </p><br/><p>Tang Doudou narrowed her eyes, then looked through the purse. “Guess?”</p><br/><p>“The hell would I guess? Hurry up and give the purse back to me!” The youngster saw that the people who were chasing after him were close to catching up and couldn’t be bothered to be polite anymore. He rushed over to snatch the purse.</p><br/><p>He reached out for the purse that seemed to be right in front of him, but Tang Doudou suddenly flipped her hand and the purse flew into the air so that his grab missed.</p><br/><p>“Hey, don’t be in such a rush. As long as you answer a question of mine, I’ll give this purse back to you and will even help you get rid of that crowd. “How’s that?”</p><br/><p>Tang Doudou caught the falling purse with her other hand and twirled it before looking towards the youngster in a mysterious way.</p><br/><p>The youngster looked at her skeptically. \"What question?\"</p><br/><p>Tang Doudou's lips hooked up and a strange light flashed from her black jade-like eyes. \"Why did you steal this purse?\"</p><br/><p>The youngster snorted as if he was sneering at the fact that Tang Doudou was so ignorant. \"Humph, do I even need to answer this question? I stole… No, this is borrowing!\"</p><br/><p>He had put stealing as borrowing in such a righteous manner. This kid was quite amusing.</p><br/><p>\"Oh? Alright, I can work with that. Why did you borrow it?\"</p><br/><p>When this was brought up, a red flush appeared on the youngster's cheeks and he said bashfully, \"I'm borrowing the purse because, because… because I want to take a wife! But I swear that after I get married, I'll definitely return this money! That banker has plenty of money anyways, this little bit shouldn't matter!\"</p><br/><p>\"You? You're taking a wife?\"</p><br/><p>Tang Doudou's unrelenting questions were annoying the young man. \"Humph, what? I can't take a wife?\"</p><br/><p>\"Of course you can! I just hadn't expected for a young man like you to have such resolve! For the sake of taking a wife, you didn't hesitate to take such a huge risk and steal… Oh, no, it's borrow a purse.\"</p><br/><p>Tang Doudou's expression became spirited as she lifted up the purse and looked around at the spectators to shout, \"Hey, everyone come look! Look at this pitiful young man! For the sake of taking a wife, he's truly gone through great pains and showed no fear in the face of oppressive powers! If the banker doesn't lend this money to you today, I'll take this amount out for you!\"</p><br/><p>The youngster was alarmed by Tang Doudou's amused voice and quickly looked around. His heart chilled from what he saw. As of now, he and Tang Doudou was completely surrounded. It was practically impossible to slip away now.</p><br/><p>The people that were about to walk up to watch the show heard the words banker and turned around to find that an anger banker was running over with a bunch of strong men. They couldn't be bothered to care about watching this show anymore and hastily ran away. The wide street instantly emptied, leaving a dumbstruck youngster and a satisfied Tang Doudou.</p><br/><p>Of course, there was also the banker and his group who were glaring at them like they wanted to eat them alive.</p><br/><p>A dead leaf was swept up by the wind and landed on the youngster's face. He abruptly snapped out of his shock and looked at Tang Doudou and the banker. He pointed at Tang Doudou, so angry that his finger trembled. \"You… You, you!!\" </p><br/><p>\"Me?\" Tang Doudou narrowed her eyes. \"What about me?\"</p><br/><p>The youngster suddenly gave a humph and looked towards the banker. \"I'm going to die now because of you!\"</p><br/><p>\"How can you say that? I'm completely helping you out of good intentions. I wasn't lying about what I said earlier. If this banker can't bear to part with this money, I'll supply you with the funds to take a wife. How's that?\" Tang Doudou looked towards the youngster with a bright smile like she was a good person.</p><br/><p>\"But didn't you say earlier that as long as I answered your question, you'd give the purse back to me and help me chase off those people?\" That youngster wasn't a naive boy either. When he saw that Tang Doudou wasn't even the slightest bit afraid of the banker, he immediately came to the conjecture that she had a card up her sleeve. In any case, it was too late for him to leave and the purse was still in this woman's hand, so he might as well take this gamble and see if this woman could help him.</p><br/><p>Tang Doudou's eyes lit up. \"That's right! Haven't I already helped you drive the people away?\"</p><br/><p>\"Humph! Do you think I'm a three-year-old? There's such a large group standing right there! Do you think I'm blind?\" The youngster started to second guess himself. Could it be that his analysis had been wrong? This woman wasn't anyone powerful and was just a dumb fool?</p><br/><p>\"I don't know whether you are a blind three-year-old or not, but I really have helped you drive off these people.\"</p><br/><p>\"You!\" The youngster's face turned red from anger. He hadn't expected for her to be so shameless. He glanced at the banker that was approaching, then turned to run.</p><br/><p>However, he was grabbed by the back of his collar by Tang Doudou. \"Let me go!\"</p><br/><p>Tang Doudou glanced at him with disdain. \"If you take something without asking, it's stealing. You've stolen a purse and is still acting like this is so righteous. Have you no shame?\"</p><br/><p>The youngster was angry enough to puke blood. Hadn't she said earlier that he did well in stealing it? But now her stance completely changed all of a sudden. As Grandpa had said, a woman's heart was like a needle at the bottom of the sea!</p><br/><p>\"Whether I stole it or not is none of your business! Hurry up and let go of me, otherwise you shouldn't blame me for not being polite!\"</p><br/><p>Tang Doudou rapped his forehead. \"Tch. What do you mean it's none of my business? Little brat, since our encounter is a sort of fate, I'll forgive you for your rude words this time and help you once, but I have a condition!\"</p><br/><p>The youngster hadn't expected for Tang Doudou to say this and his expression became a little strange. \"Condition? What condition?\"</p><br/><p>\"I haven't thought of it yet. For now, just state whether you'll agree or not!\"</p><br/><p>The youngster hesitated, but when he saw the dark expression on the banker out of the corner of his eye, he bit his lips and said, \"Fine, I'll agree!\"</p><br/><p>Tang Doudou brushed back her long black hair. \"That's more like it! Good boy!\"</p><br/><p>\"Stop wasting time! They're coming!\" Although the youngster had agreed to her deal, a crafty light flashed through his eyes. It was clear that he was planning to abandon Tang Doudou and run off on his own if Tang Doudou failed to keep her promise or couldn't beat these men.</p><br/><p>There was no way Tang Doudou would miss what he was planning because the craftiness in this youngster's eyes was too familiar. This was also the reason why she had stepped up and gotten involved in this trivial matter.</p><br/><p>If her guess wasn't off, this guy was probably also one of Lan Jia's children!</p><br/><p>The youngster didn't know what Tang Doudou was thinking. His only desire right now was to shake off the bankers, then buy medicine for his grandpa! As for what he had said earlier about taking a wife, it was all made up! He had no desire to have some wife. If the wife he took was like the wife in their neighbor Aunt Wang's family and wasn't filial to Grandpa, what was the use in marrying her?</p><br/><p>\"Little lady, I'd advise you not to meddle in matters that are none of your business and move aside. This master is going to teach that lowly thing an important lesson! He actually dared to steal from this banker! He's definitely tired of living!\" The banker was fat to the point he barely seemed to have human form. He strode right to Tang Doudou's face to tell her to get out of the way.</p><br/><p>Tang Doudou listened to him and took several steps backwards, but she took the youngster with her.</p><br/><p>When the banker saw this, he understood that she planned to stand up for this youngster!</p><br/><p>However, she was pregnant! Why was she still meddling in these affairs! She sure didn't know her own limits!</p><br/><p>\"All of you, go pull this woman away from him! Make sure not to injure her stomach lest she comes bother me later! Ha, what bad luck!\" The banker waved his hand and the large men behind him rushed out to pull Tang Doudou away.</p><br/><p>Tang Doudou curled her lips in disdain. If it had been in the past, she would've run as far as possible. However, the Tang Doudou of today was no longer the original Tang Doudou. Her fingers reached towards her waist and a dagger flew into her palm. Her hand then turned upwards towards the men that were charging at her.</p><br/><p>In the blink of an eye, she had reached the nearest man and slashed his arm.</p><br/><p>The blood spurted out high into the air, then splashed down on the nearby banker's head.</p><br/><p>\"AAAHH!\" The banker screamed like he was a pig being slaughtered. \"It's blood!\"</p><br/><p>Then his enormous body abruptly fell backwards.</p><br/><p>The man who had been cut by Tang Doudou stood frozen in place without even bothering to try and stop his injury from bleeding. He just stared blankly for a long while before finally slapping his head in realization. \"Crap! I forgot that the banker was scared of blood!\"</p><br/><p>\"Then what do we do now?\" asked another man.</p><br/><p>That's right! The banker had already fainted, so what do they do now?</p><br/><p>When Tang Doudou who was putting away her dagger heard what these guys said, she almost fainted as well. These people sure were examples of the saying, four limbs developed more than the brain!</p><br/><p>\"What else can you guys do? Hurry up and take your banker to a doctor! If he stays unconscious, I'd like to see how you guys can explain things to his family!\" These people were thugs that the banker had hired. From the reactions of those citizens, it was pretty likely that this banker wasn't a good person. If not for that, the citizens wouldn't fear him so much. Bankers were rarely good people, so she trusted that his family members weren't any better. However, these people labored for their daily meals. Based on how simple they seemed, it was obvious that the bad things they did were all at the banker's instructions.</p><br/><p>When Tang Doudou prompted them, these men's faces lit up with realization and they hastily carried the banker away.</p><br/><p>It was fortunate that these people were strong. Otherwise, it really wouldn't be a simple matter to carry away the banker with how large his body was.</p><br/><p>Once they left, the street gradually filled with people again. In reality, the people from earlier hadn't really left. Most of them were hiding to see what would happen. After seeing how strong Tang Doudou was, as they passed by her, they looked towards her with respect.</p><br/><p>The youngster hadn't expected for Tang Doudou to know martial arts and scrutinized her again. \"Hey, who exactly are you? Why did you help me?\"</p><br/>\n</div>"}