{"title": "Chapter 460: Mystery About His Pas", "id": 460, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-460-mystery-about-his-pas", "volume_title": "Volume 5", "body": "<h1>Chapter 460: Mystery About His Pas</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>t</p><br/><p>When this occurred to Tang Doudou, she started looking at him curiously. Upon seeing that he was eating happily, she said with a smile, \"He Xiaoqin!\"</p><br/><p>He Xiaoqin glanced up, then swallowed the chicken meat that was in his mouth. \"What?\"</p><br/><p>\"Did you come just to eat?\" When Tang Doudou saw how much he was enjoying the food, she started feeling a little hungry as well, so she picked up the durian that was placed in front of her and took a bite. The satisfying flavor immediately filled her mouth.</p><br/><p>He Xiaoqin became annoyed when he heard Tang Doudou say that he had just come for food and he dropped the oily drumstick he was holding. \"Tch. Am I that sort of person?\"</p><br/><p>When he saw how happily Tang Doudou was eating the durian, he asked curiously, \"What's that? Why haven't I ever seen it before? Does it taste good?\"</p><br/><p>Tang Doudou glanced at the durian in the plate, then over at He Xiaoqin's curious expression. She narrowed her eyes. \"You want to have some?\"</p><br/><p>He Xiaoqin curled his lips in disdain like he had no interest. \"I was just curious about what it is. Who'd want to eat it? It's so disgusting.\"</p><br/><p>But the greed flickering in his eyes betrayed his true thoughts.</p><br/><p>Tang Doudou didn't expose him and slowly picked up another piece to eat it bite by bite so that the strong fragrance of the durian could fill her mouth. She glanced at He Xiaoqin again, then said, \"This durian ah, is a fruit of the genus Durio. The pulp is filled with nutrition and it's even known as the 'king of fruits.' Eating it frequently can help strengthen the body, supplement the kidney, warm the body, and even change the coldness of the abdomen so that a person's natural body temperature can improve. It's the ideal tonic for people who suffer from chills… And most importantly, its taste is very unique. The seeping sweetness will make you want to keep eating more and the intense fragrance lingers between the teeth. Every person that tastes the deliciousness of the durian would continue to recall its taste even in their dreams…\"</p><br/><p>He Xiaoqin was curious about the durians from the start. When he heard Tang Doudou say this, he had to audibly swallow back his drool. Tang Doudou couldn't help but find it funny. Wow, it was another chowhound!</p><br/><p>\"It wasn't easy to get such a delicacy. It must be known that durians only grow in the tropics and there are very few of them. They're also quite hard to transport. If it weren't for the fact that someone just happened to be selling them in the chamber of commerce, we wouldn't have been able to get any.\"</p><br/><p>He Xiaoqin swallowed again. \"You mean that this thing is really really hard to get?\"</p><br/><p>\"Of course. This is something that normally can't even be bought with money! The only reason I can eat it is because Baili Yu has extensive influence.\" When Tang Doudou brought up Baili Yu, she paid particularly close expression to He Xiaoqin's expression, but didn't discover anything out of the ordinary.</p><br/><p>Could it be that all her guesses had been wrong?</p><br/><p>That wasn't right. She had to check more closely.</p><br/><p>\"Since you're saying that it's that good, I'll try it!\" As He Xiaoqin spoke, he quickly took the plate of durian from Tang Doudou and picked up a piece to stuff in his mouth. However, the moment he tasted the durian's distinctive flavor, his entire face changed color. Then, his eyes rolled back and he fainted.</p><br/><p>The durian Tang Doudou was holding fell off her hand as her jaw dropped. She was falling apart internally. It was the first time she had ever heard of someone passing out from eating durian.</p><br/><p>Truly, the longer you lived, the more you see!</p><br/><p>However, since he had passed out, she wouldn't be able to get anything out of him. She tossed the durian away and wiped her hands on her clothes before calling out, \"Someone, come here!\"</p><br/><p>\"Madame!\" Several maids immediately appeared in the previously quiet pavilion and they uniformly curtsied to Tang Doudou.</p><br/><p>Tang Doudou was slightly surprised to see so many people pop up, but she just said, \"Bring this young sir to a guest room to rest. Once he wakes up, have someone help him wash up and get changed, then bring him to me.\"</p><br/><p>\"Understood!\" replied the maids in unison.</p><br/><p>Tang Doudou watched as the maids moved to carry He Xiaoqin away, then something occurred to her and she said, \"If he's not willing or won't cooperate, you guys know what to do right?\"</p><br/><p>The maids looked towards Tang Doudou in confusion.</p><br/><p>Tang Doudou rubbed her nose with a laugh. \"If he doesn't obey, then tie him up, beat him, spank him… In any case, he can't be allowed to leave the manor, got it?\"</p><br/><p>\"Frick! You're seriously ruthless!\" Right after Tang Doudou said this, He Xiaoqin jumped out of the maid's hands like a hopping vampire.</p><br/><p>When Tang Doudou saw that this guy was perfectly fine, she had the maids withdraw and sat back down again.</p><br/><p>\"Just say it! What exactly is your motive?\" He Xiaoqin played with a cup as he leaned back with one hand supporting his head and a leg lifted over his knee.</p><br/><p>Tang Doudou waited until the maids walked away before saying, \"I don't have any motives. I only called you here to ask a few questions.\"</p><br/><p>\"Oh, you want to ask questions?\" He Xiaoqin had an expression like he understood and then extended his palm.</p><br/><p>Tang Doudou didn't get it. \"What do you mean?\"</p><br/><p>\"Pay the fee! There's always a fee to gather information on the Jianghu.\" He Xiaoqin looked at Tang Doudou with disdain. \"With how strong your martial arts is, it couldn't be that you weren’t even aware of this?\"</p><br/><p>What a troll!</p><br/><p>Tang Doudou had black lines all over her forehead as she looked at that black palm. However, there was nothing she could do but take out an ingot of silver and slap it on that palm. \"Happy?\"</p><br/><p>He Xiaoqin glanced with disdain at the ingot. \"So little?\"</p><br/><p>Bang!</p><br/><p>Tang Doudou slapped the table. \"This is a full fifty taels! How can you say it's little?\"</p><br/><p>He Xiaoqin curled his lips in disdain. \"Bai Xiaosheng charges a thousand taels for a single question! In comparison, is it excessive for me to charge a hundred taels?\" (Bai Xiaosheng is a fictional character that was known to be very skilled in martial arts, lustful, and very intelligent.)</p><br/><p>\"Why don't you just become a bandit!?\" Tang Doudou rolled her eyes. \"Who's Bai Xiaosheng and in comparison, who are you? Can you guys even be mentioned on equal terms/\"</p><br/><p>He Xiaoqin was unconcerned as he weighed the ingot in his hand. \"Isn't he still just a person? What difference is there? Are you going to pay or not? If you're not, then I'm leaving!\"</p><br/><p>Tang Doudou didn't know what to do with him and could only bear with the pain. She took out another ingot and tossed it at him. \"Happy now?\"</p><br/><p>He Xiaoqin happily put the ingots away. \"Go ahead and ask!\"</p><br/><p>\"Who else is in your family?\" She had clearly seen him steal a bag of silver just yesterday, but today he looked as if he was starving. What had he done with that money?</p><br/><p>He Xiaoqin hadn't expected for Tang Doudou to ask this question. \"Why are you asking about this?\"</p><br/><p>\"Just answer, what are you asking so many questions for? Bai Xiaosheng never asked these questions,\" said Tang Doudou with an irritated smile.</p><br/><p>He Xiaoqin was stumped by the excuse that he had used himself and was silent for a while. Finally, he said, \"My grandpa's the only one at home. Why? Do you know my grandpa?\"</p><br/><p>\"Second question!\" Tang Doudou ignored He Xiaoqin's question and lifted a second finger.</p><br/><p>He Xiaoqin extended his hand with a smirk. \"A hundred taels!\"</p><br/><p>Tang Doudou's entire face was turning green. This guy sure dared to make excessive demands!</p><br/><p>\"A hundred taels per question, but since you've treated me to so much good food earlier, I'll give you twenty percent off!\" He Xiaoqin also seemed to feel that his pricing was a little high and changed his tune.</p><br/><p>Something seemed to occur to Tang Doudou and she stopped hesitating. She just tossed the money to him.</p><br/><p>After catching the money, He Xiaoqin started kissing up to her again. \"Ask away!\"</p><br/><p>\"Where's your house?\"</p><br/><p>He Xiaoqin's lips twitched and his gaze completely changed as he looked at Tang Doudou. Could it be that this person was an idiot? Why was she spending so much money to ask these pointless questions?</p><br/><p>As expected, he couldn't understand the world of the wealthy!</p><br/><p>However, since it was free money, what did it matter?</p><br/><p>\"At the old temple in the south alley of North Hara City. What? Are you planning to go visit my grandpa?\" He Xiaoqin lifted a leg up again.</p><br/><p>That was precisely her intention, but she still had one more question to ask.</p><br/><p>She took out another ingot and stuffed it directly in his hand. \"The third question: who are your parents?\"</p><br/><p>The moment she asked this question, He Xiaoqin's expression completely changed. He pushed all of the money back to Tang Doudou and turned to leave.</p><br/><p>There really was an issue.</p><br/><p>Tang Doudou narrowed her eyes as she picked up the money. In the blink of an eye, she had arrived in front of He Xiaoqin. \"Where are you going? Since you've taken the money, you have to answer the question. What do you mean by this?\"</p><br/><p>He Xiaoqin was annoyed. \"It's late, I have to head back.\"</p><br/><p>\"Oh, but the sun had just risen…\"</p><br/><p>\"My grandpa has poor health. I have to go back to take care of him.\" He Xiaoqin refused to look at Tang Doudou.</p><br/><p>Tang Doudou remarked, \"Oh, so your grandpa has poor health.\"</p><br/><p>He Xiaoqin thought that she was letting him go and smiled ingratiatingly. \"That's right, so can I go?\"</p><br/><p>Tang Doudou said, \"The elderly should visit doctors if they don't feel well. It just so happens that many famous doctors have come to this manor. Every encounter is fate, so I'll bring some doctors over to take a look at your grandpa.\"</p><br/><p>When He Xiaoqin heard this, he immediately rejected the idea. \"Many thanks for your good intentions, but there's no need. I've already found a doctor to take a look at Grandpa.\"</p><br/><p>\"What did the doctor say?\"</p><br/><p>\"The doctor said, he said…\"</p><br/><p>\"What did he say?\"</p><br/><p>He Xiaoqin became irritated and shouted, \"Why do you like sticking your nose into other people's business so much? Are you going to let me go back or not? If you won't, then I'm going to report you to the governmental officials for trying to forcefully detain someone!\"</p><br/><p>\"I was helping you out of good intentions! Don't be like a blind dog that can't even tell the good from the bad!\" Tang Doudou threw the money to him. \"Go. Even if you don't take me, I know where your house is located and can go in my own time, isn't that so?\"</p><br/><p>If he knew earlier, he wouldn't have answered her crappy questions!</p><br/><p>Now it was just great. If she actually brought people over, Grandpa would definitely think that he had caused trouble again and he'd be beaten again.</p><br/><p>After considering things for a moment, his anger calmed. After all, Tang Doudou wasn't the first to ask him who his parents were. However, if he had known who his damned parents were, he would've already gone to find those heartless people for an explanation!</p><br/><p>They gave birth to him, but so cruelly abandoned him. He had lived with Grandpa and suffered through so much with him…</p><br/><p>Compared to the people that bullied and insulted him, he hated those cruel parents that he had never met more!</p><br/><p>Tang Doudou was surprised to see the hatred that appeared in He Xiaoqin's eyes. He Xiaoqin shouldn't hate her. After all, nothing much had happened between them. At most he should only be annoyed with her.</p><br/><p>He had only acted strangely when she brought his parents up. Could it be that he hated his parents?</p><br/>\n</div>"}