{"title": "Chapter 474: What is He Trying to Do?", "id": 474, "volume": 5, "url": "http://boxnovel.org/little-prodigal-alliance-head-chapter-474-what-is-he-trying-to-do", "volume_title": "Volume 5", "body": "<h1>Chapter 474: What is He Trying to Do?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>City Lord Xu still didn't know what was going on, but he could tell that something bad had happened from the way these people of the Jianghu who usually didn't fear anything were rushing away like the sky was falling. That was why he had helped Xiao Siyuan get everyone out of the residence.</p><br/><p>However, the people inside the residence were his people, so he could tell them to do whatever. It wasn't possible to do the same with the citizens of North Hara City without a good reason. The citizens probably wouldn't listen either.</p><br/><p>\"City Lord Xu, you also saw the bugs that had attacked Miss Xu earlier. The city is currently full of those bugs. If we don't get everyone to evacuate, I'm afraid the citizens will…\" When Xiao Siyuan saw the confused expression on City Lord Xu's face, he had no choice but to explain the situation.</p><br/><p>\"B-but no matter how strong those bugs are, they couldn't possibly cause the entire city to…\"</p><br/><p>\"City Lord Xu, I've already warned you. If you don't believe me, then just pretend I didn’t say anything!\" Xiao Siyuan had no intention of wasting any more time with City Lord Xu. He had done what he should and he wasn't capable of getting the entire city to evacuate. If City Lord Xu didn't believe him and wasn't willing to give the command to have the city's citizens move away, he also couldn't do anything. After all, he still needed to get the members of the four large clans out safely.</p><br/><p>When City Lord Xu heard the slight displeasure in Xiao Siyuan’s tone, he hastily said, \"Of course I believe you, Xiao gongzi. It's just that even if I'm the city lord, the citizens won't agree to leave a place they've lived in for many years without good reason.\"</p><br/><p>His words made sense, but if the citizens weren't willing to leave North Hara City, once the soul-devouring bugs started reproducing, all the citizens would die.</p><br/><p>This also occurred to City Lord Xu. After a moment of hesitation, he turned towards the soldiers behind him. \"Go, immediately post announcements to have all the citizens evacuate North Hara City as quickly as possible!\"</p><br/><p>\"City Lord, this…\"</p><br/><p>\"Remember to write on the announcements that the demonic sect is attacking. If they don't evacuate within an hour, they're on their own!\"</p><br/><p>\"Understood!\"</p><br/><p>Xiao Siyuan was relieved to see that some people had gone to handle this. Right at this time, a voice appeared behind them.</p><br/><p>\"City Lord Xu, there's no need to go through this trouble.\"</p><br/><p>Everyone reflexively looked towards where the voice came from. Bai Lianhua, who was dressed in a spotless lotus white garment, walked out slowly from a corner. \"No need to panic, and no need to evacuate North Hara City.\"</p><br/><p>A trace of confusion flashed through Xiao Siyuan's eyes when he saw the woman that had suddenly appeared. \"Lady, you are?\"</p><br/><p>\"Lianhua, why are you here?\" Bai Luoqing walked out, her face pale. She also looked shocked at Bai Lianhua's sudden appearance.</p><br/><p>Bai Lianhua slowly curtsied towards her. \"Aunt.\"</p><br/><p>\"No need to be so courteous right now, Lianhua. What did you mean by what you said earlier?\"</p><br/><p>Bai Lianhua gave her a comforting smile. Her expression, tone, and temperament was completely different from before. Bai Luoqing was getting more and more confused. Just as she was about to ask, she saw Bai Lianhua pull a jade bottle out from her sleeve. \"Aunt, as long as you spill this powder in the air, it'll eliminate the soul-devouring bugs.</p><br/><p>\"However, during this time period, there's still a need for City Lord Xu to give the command preventing the citizens from leaving their houses for the time being.\"</p><br/><p>Bai Luoqing took the jade vial and peered at it. \"This is?\"</p><br/><p>It wasn't just her, everyone present was wondering what was inside this little jade vial to make Bai Lianhua say such a thing.</p><br/><p>\"Cousin was the one that gave it to me. The words I said earlier was also a message he had me deliver. Aunt, this matter can't be delayed, you should hurry!\" urged Bai Lianhua.</p><br/><p>However, Bai Luoqing hesitated. Most of the people here were not aware of what cousin Bai Lianhua was talking about, but she knew that it was Bai Feiyun.</p><br/><p>If they hadn't been drugged by Bai Feiyun these past few days while they were recuperating and didn't hear what he had discussed with Lan Jia, perhaps she would've believed Bai Lianhua's words without hesitation, but now…</p><br/><p>She couldn't fully trust it.</p><br/><p>Bai Luoqing put away the jade vial with a smile. \"Alright, I got it. When the time comes, I'll definitely do as you say.\"</p><br/><p>Her words caused Bai Lianhua's facial color to change. \"Aunt.\"</p><br/><p>\"That's enough. It's dangerous here, so you should hurry and leave the city!\" Bai Luoqing indicated with a smile to have her disciples see Bai Lianhua out of the city. Bai Lianhua still wanted to say something, but Bai Luoqing stopped her with a look.</p><br/><p>Bai Lianhua was unwilling, but she had no choice but to leave the city with the two disciples.</p><br/><p>After this, Bai Luoqing turned around with a smile but didn't explain anything as she walked towards her clan members.</p><br/><p>When Lin Shuxuan saw this, he wanted to walk over and ask what was going on, but his dad stopped him. \"Shuxuan, we should hurry and leave as well.\"</p><br/><p>\"But…\"</p><br/><p>Stronghold Master Lin looked at him sternly. \"Don't get involved in things that are none of our business.\"</p><br/><p>Lin Shuxuan had never seen his dad this stern and shrank back. He didn't dare to suggest asking Bai Luoqing for answers, but he didn't fully give up either. He sent Xiao Siyuan meaningful winks for a while, then Xiao Siyuan nodded towards him and indicated for him not to panic.</p><br/><p>As long as the soul-devouring bugs were still here and that jade vial was still here, there would come a time for it to be used.</p><br/><p>When Lin Shuxuan saw his reaction, he curled his lips in annoyance helplessly, then started looking around.</p><br/><p>A lot of citizens had already discovered the soul-devouring bugs in their homes, but they didn't realize how severe the matter was and just used things to kill the small bugs. However, after that, larger bugs flooded in. Before the citizens could do anything, the bugs started attacking everything that was alive.</p><br/><p>After the soul-devouring bugs started attacking, waves of screams filled the air. At first it was just a couple, but as more screams filled the air, the citizens finally realized that something was off. The soldiers that had been putting up the announcements now struck the gongs to have the citizens evacuate.</p><br/><p>However, the result was as City Lord Xu feared. Although these bugs were fearsome, the citizens refused to leave the city.</p><br/><p>\"Why should we leave!?\"</p><br/><p>\"Where's the city lord?\"</p><br/><p>\"Why didn't the city lord send you guys to exterminate the bugs instead of getting us to leave?\"</p><br/><p>\"I'm not leaving! Why do we have to leave? All of my trade goods are still in the city!\"</p><br/><p>\"City Lord! City Lord! Hurry and save us!\"</p><br/><p>A lot of people had already gone to the city lord's residence to demand an explanation.</p><br/><p>The entire city was in an uproar and citizens filled the streets, but no one was willing to leave.</p><br/><p>City Lord Xu had already arrived at the city gates with the four large clans. When he saw this, he sighed heavily, then cupped his fist towards Xiao Siyuan. \"Xiao gongzi, you guys should leave first! I'm the master of North Hara City, so I can't leave just like this!\"</p><br/><p>Xiao Siyuan saw that City Lord Xu was crestfallen and knew that he was worried about the imperial court blaming this incident on him. The punishment for the crime of abandoning the city and fleeing was harsh. A light sentence would end in his family being executed unto the third generation, a harsh sentence would involve up to a ninth degree relation. Regardless of whether the sentence was light or heavy, City Lord Xu didn't desire any of those results.</p><br/><p>Hence, Xiao Siyuan didn't try to dissuade him and just said, \"City Lord Xu, take care. We'll be leaving first.\"</p><br/><p>City Lord Xu sighed softly. \"Xiao gongzi, you should take care as well.\"</p><br/><p>\"Wait!\" Just as Xiao Siyuan was about to leave the city, a shout came from behind him.</p><br/><p>Xiao Siyuan turned around helplessly, but then reacted with surprise to the person that had arrived. \"Elder Yu?\"</p><br/><p>Elder Yu nodded towards him, then walked past him to the family heads. \"Do you mean to leave just like this?\"</p><br/><p>\"Elder Yu, what do you mean by this?\" The family heads were all still severely ill. Stronghold Master Lin's condition was better than the rest, so he spoke for them.</p><br/><p>\"Please don't misunderstand. What this Yu means is that the entire city is currently in an uproar right now. There are man-eating bugs everywhere and the people bitten are starting to attack other people. If things go on like this, it'll become a huge calamity! Everyone here has ability. How can you leave by yourselves when the citizens are in trouble? This Yu rushed over to ask you families heads to work with the martial arts alliance to come up with a counterplan!\" After Elder Yu hastily said this, he bowed deeply towards them.</p><br/><p>The family heads looked towards him with shame. After hesitating for a while, Bai Luoqing finally spoke. \"It's not that we don't want to help, but…\"</p><br/><p>She looked around to make sure that there were no outsiders before saying quietly, \"While we were recovering from our injuries, Bai Feiyun drugged us. Right now, there's not even a trace of inner strength in our bodies, so though we have the desire, we don't have the strength.\"</p><br/><p>Bai Luoqing extended her hand in front of Elder Yu, worried that he wouldn't believe them.</p><br/><p>Elder Yu glanced at her. Even though he felt that this was improper, he still placed his fingers on her wrist. The moment he felt her pause, his facial color changed drastically and he looked towards them with shock. \"You guys…\"</p><br/><p>\"Haa. If it weren't for this, how could we abandon so many innocents to flee on our own? Speaking of it now, this incident is actually our fault. If it weren't for the fact that we kept investigating the mysterious person, the mysterious person wouldn't have been led to North Hara City.\" Stronghold Master Lin sighed.</p><br/><p>Bai Luoqing said, \"It can't be put that way. Even if we weren't involved, based on how ambitious that person is, he still wouldn't have let off the citizens of North Hara City.\"</p><br/><p>When Elder Yu heard them discuss the mysterious person, he couldn't help but ask curiously, \"You guys know who the mysterious person is now?\"</p><br/><p>If it was earlier, they would've only been able to say that they didn't know, but now, they all looked towards the city lord's residence. Elder Yu looked over as well and his face filled with shock. The originally majestic residence had already been reduced to rubble and the four people that had been fighting so intensely earlier were already gone.</p><br/><p>When they saw this, all of them had a bad premonition. Bai Luoqing hastily said, \"The mysterious person is Lan Jia! Earlier in the city lord's residence, Baili Yu, Mu Ye, and Su Yi had been fighting him, but even working together, they hadn't been able to take him down. There's now no one left that can stop him!\"</p><br/><p>Elder Yu was stunned by this sudden onslaught of information. His mind went completely blank.</p><br/><p>The mysterious person was actually Lan Jia? Hadn't he already died?</p><br/><p>And how did he end up colluding with Bai Feiyun? What exactly happened for Baili Yu, Mu Ye, and Su Yi to be unable to defeat him even when they were working together?</p><br/><p>It took him quite a while to snap out of it. He looked towards the city lord's residence as he exclaimed, \"Lan Jia? What exactly does Lan Jia want to do?\"</p><br/>\n</div>"}