{"title": "Chapter 7", "id": 7, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-7", "volume_title": "Volume 1", "body": "<h1>Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>1.7 Won't live for long in any case, why worry about it?</p><br/><p>In the middle of the night, Xue Ling suddenly woke up fromhis sleep, opened his eyes, and met with another pair of mildly glittering eyesin the dark.</p><br/><p>Xue Ling: “…”</p><br/><p>Cong Hui: “…”</p><br/><p>It’s already after midnight, the lights are all out in themansion. Within the pitch dark room, there is suddenly a person sitting besideyour bed, if it weren't for Xue Ling's good psychological quality, and that heused to pretend to be a ghost at midnight to scare others, people throughoutthe entire palace would have absolutely already have heard him yelling.</p><br/><p>Xue Ling was dazed for a moment. Although the other's faceheld no expression, he could still understand the embarrassment lyingunderneath that paralyzed face. A long time later, he finally touched his noseand said, “I don’t know why the Lord General came to visit in the middleof night, is there some matter?\"</p><br/><p>After dealing with the rebels until late at night, thenfinally returning without stopping, changing out of clothes that were full ofblood to run over to see the other party, this type of thing, absolutely wouldnever be said from Cong Hui’s mouth. So he ruminated for a while before saying,\"Today's affairs, thank you.\" </p><br/><p>Xue Ling knows something about the plot, so he sent Cong Huimany silk bags (), breaking down the many arrangements of the opposingparty, reducing Cong Hui's losses significantly. </p><br/><p>Only, even if thanks must be given, it's not necessary tocome to other people's rooms in the middle of the night to stare at people…</p><br/><p>Xue Ling's face held no expression as he replied: “Thisis what this subject should do, not to mention the deep blood feud of myfamily, relating to my parents who died in vain. I did this also for my ownpurposes, so the general doesn’t have to thank me.”</p><br/><p>Cong Hui hooded his eyes, made a noise of acknowledgement,rose and said:  “Thanking you isstill needed; thank you for saving me. It’s getting late, have an early rest.\"</p><br/><p>Xue Ling: “…” If you hadn't come, I was sleepingperfectly fine…</p><br/><p>However, when dealing with the general this type of 'holdingback ten sentences only to speak out one phrase' person, it's evident that onecannot be too picky. Xue Ling watched the other side turn around and leavethrough the door before reaching out his hand to dig out the sleeping system. “System,hurry and wake up!”</p><br/><p>The system was sleeping well. Suddenly having his entire foxbody being held up by Xue Ling, it struggled in mid-air for a good while beforewaking up properly, asking with a muddled face, “What happened?”</p><br/><p>Xue Ling expression was solemn, “You should have awarning system ability, right?”</p><br/><p>“Yes, there is, in order to ensure the safety of thehost. But this world is only an initial world, so there aren't many availablefunctions, I have many uses, the host can make much use of them.\" These words, spokenlike a sales promotion, were directly ignored by Xue Ling.</p><br/><p>“Then why were you completely unaware when Cong Huicame in just now? You slept like a dead pig.” Xue Ling was particularlydisgusted with the system. “I was almost scared to death in the middle ofthe night.”</p><br/><p>The system is the one scared to death: “What? Thegeneral was here!?\"</p><br/><p>Xue Ling: “…” Forget it. Having it is of whatuse?</p><br/><p>The system is running crazily around the bed, utterlyconfused: “This is not normal…”</p><br/><p>Xue Ling waved his hand, helplessly saying, “Forget it,it’s not the first time you've been unreliable.”</p><br/><p>The system felt particularly grieved: “I’m reliable,don’t be like this to me… And it's the middle of the night, well pastmidnight, what’s the general doing coming here?\"</p><br/><p>“I don’t know.” Xue Ling frowned, “I currentlysuspect one thing.”</p><br/><p>“Huh?”</p><br/><p>“After all, I’m not a low EQ person, only hisperformance is bit not obvious…” Xue Ling touched his chin, “Howlong can this body last?”</p><br/><p>“Not much, two or three months.”</p><br/><p>“Speculation is still just guesswork. If he doesn’t sayit, I’ll just treat it as not knowing.” Xue Ling narrowed his eyes,completely ignoring the system whose head is still in a fog, turned over andwrapped himself up: “Sleep, sleep!\"</p><br/><p>At this time, the rebellion was suppressed, and theemperor’s trust in Cong Hui increased. Towards Xue Ling, who had made greatachievements, rewards came down like a tide. If not for the fact that Xue Ling'sbody really couldn't take it, the emperor would probably immediately place himinto position as the Minister of the Left. </p><br/><p>Xue Ling’s routine for recuperating remains unchanged, buthe finds that the time spent by the general in his courtyard is getting longerand longer. Sometimes he even likes to stay in his yard to handle officialbusiness.</p><div><div></div></div><br/><p>Although they have a lot of common topics to talk about,there is no more behaviour that crosses the line except that night.</p><br/><p>Xue Ling himself wondered if he was too being too sensitive.After all, the gong protagonist without the shou was a straight as a pen,straight male, looking at the situation, he was obviously regarded as aconfidant. As expected, his thoughts were too dramatic, not credible at all.</p><br/><p>A month later, the plot reached a critical point. The bordersituation changed dramatically, two neighboring countries cooperated, and werepushing at the doors.</p><br/><p>In the original text, the gong and shou went to thebattlefield together. In this war, they became the heroes of the country. Then,the gong voluntarily surrendered his military power, and the two of them left thecapital to play around like immortals, and this plotline also ended here.</p><br/><p>But now the shou is awaiting a beheading, Cong Hui hasalready received orders, and is ready to march to battle.</p><br/><p>Xue Ling wrote a letter, requesting to go out with the army.</p><br/><p>After being summoned, he claimed that he didn’t have a longlife to live, and so he might as well make a great contribution to the countryand die on the battlefield, which can also be called an honor.</p><br/><p>The emperor knew the extent of his genius, considering his words,for the sake of his country, he eventually appointed Xue Ling as a military advisorthat would accompany the army all the way, overturning the general’s objection.</p><br/><p>The system tells Xue Ling that this body can live foranother two months.</p><br/><p>Leaving the palace, Cong Hui's facial expression has notimproved, Xue Ling finds it funny, saying teasingly: \"Who provoked our great general?His face is black to the point of being hard to look at.”</p><br/><p>The attendants around him were silent, thinking in theirhearts, 'Wasn't it you? Other than you who else would dare provoke him?'</p><br/><p>Cong Hui glanced at him once, before turning his head, voiceseeming to come out from the deepest part him, severely oppressive, “Why?Your body clearly can’t bear the fatigue of the journey, let alone the smoke ofthe battlefield.”</p><br/><p>Snow Ling smiled, “Me and you are both men, men whoserve the country. What's wrong with that?”</p><br/><p>Cong Hui looked at him again, the complex emotions in hiseyes churning, before eventually turning into the deepest black. “Nothing.”</p><br/><p>“I've said it before.” Xue Ling is smiling andlaughing, it seems that he is not worried at all about the fact that he willnot live long, “Even if I die on the battlefield and return as a corpse,it is better than nesting in the capital, waiting for the soldiers to fightwith their lives in return for my stability. Living like that, has no meaningat all.\" </p><br/><p>“Your words, are also cursing how many others that arein this capital.” Cong Hui sneered.</p><br/><p>Xue Ling laughed lightly, “Who knows, anyway, I'mplanning to leave, they won't be able to retaliate even if they wanted to.\"</p><br/><p>Cong Hui: “…”</p><br/><p>It's true, he has never been able to do anything about him,His majesty is also helpless, let alone the others.</p><br/><p>Xiao Qing heard the news that he was going to go out withthe army, and he cried like the world was ending: “Gongzi's body is notgood, why do you have to follow into the battlefield? The general is alsosomething, he didn't even stop you!\"</p><br/><p>Xue Ling slapped him on the head with some amusement, “I'vesaid, you’re a man, what’s the matter of crying and wailing like a little girlall day long?”</p><br/><p>“Gongzi wants to take risks with his body, but won'tallow me to cry?!\"</p><br/><p>“Don’t be like this, even without going, your gongzidoesn't have many days of life left.\" Xue Ling knocked him on the head. “Isn'tit good for me to do what I can while I can still hold on?”</p><br/><p>“Gongzi…”</p><br/><p>“I’m not going to take you with me. I’ve already askedthe general to get rid of your contract of sale. If you are willing, go to thecapital city for a job. If you don’t want to, then stay in the General’sPalace. He promised to treat you well.”</p><br/><p>Xiao Qing was shocked. He never thought that his gongzi hadeven thought about his future. It was obvious that he was planning to die! Eventhough he really doesn't have long to live… “Gongzi, Xiao Qing willfollow you to the battlefield.”</p><br/><p>“Nonsense.” Xue Ling frowned with disapproval,“You think anyone can go to the battlefield? Obediently stay here for me,you aren't permitted to go anywhere. I’ll have the general set someone to watchyou.\"</p><div><div></div></div><br/><p>Xiao Qing: “…” Seriously? Even if you arerefusing, you don't need to be so cruel… </p><br/><p>Xue Ling has always meant what he said, after rejecting XiaoQing, he really asked the general to find someone to watch him, only lettinghim come out to say goodbye on the day of their departure. Watching the othercrying until his eyes are read, Cong Hui frowned and asked Xue Ling:  “Why don’t you let him follow you? Youwill be at the back, and won’t really go onto the battlefield.”</p><br/><p>Xue Ling pressed his lips together, in his last life XiaoQing died because of the former owner, and the former owner's wish was to lethim live happy and safe all his life. With this point alone, he would neverbring the other along, let alone, he was still only a child, it was not goodfor him to have to face the fact that his gongzi died. “Naturally, I havemy reasons. He’s the only family I have left. I can’t let him have anotheraccident. Even if there is only a slight possibility, I don't want anything tohappen to him.\"</p><br/><p>Cong Hui was silent for a long time, waving and leading thelarge group of people and horses to leave.</p><br/><p>Xue Ling was riding in a carriage. Considering his body, theemperor specifically appointed an imperial doctor to take care of his bodyalong the way. Cong Hui also specially prepared a carriage that was differentfrom the others, the interior is very luxurious, hoping to reduce the jostlingon the road for Xue Ling.</p><br/><p>Although the officers and men had some misgivings, they wouldnot criticize the decision of the general, so no gossip came to Xue Ling’sears.</p><br/><p>Traveling is always dull and boring, Xue Ling knows it willtake a month and a half on the road, so when he is feeling relatively well, heconstantly writes a series of strategies, changes and then changing again the arrangementsof the troops, adding some modern day opinions, and tried to learn more aboutthe two neighboring countries from Cong Hui, in order to more or less haveunderstand the score. </p><br/><p>It is impossible to finish a battle in half a month. Becausehe was riding a carriage, he was much slower than the vanguard cavalry. Everyday, he relied on people arranged by Cong Hui to help him to transmit tacticsto the battlefield. In this way, he rushed to the battlefield while makingplans, and even helped Cong Hui win two battles when he first arrived in thebattlefield.</p><br/><p>Towards this military advisor, the soldiers were completelywon over to the point of wanting to throw themselves at his feet in admiration.When Xue Ling finally arrived, all the soldiers looked at him as if they hadseen their relatives, their gazes intense to the point of giving him goosebumps. They had totally forgotten their misgivings about bringing a sickseedling to the battlefield from not long ago.</p><br/><p>The war situation became more and more favorable, but frownof the doctor assigned to help look after Xue Ling's body became more and moresevere. </p><br/><p>In the morning, Xue Ling, who vomited a mouthful of blood,calmly wiped off the blood stains on the corners of his mouth, put the whitecloth stained with blood aside, and listened very calmly to the doctor’s fragmentedthoughts.</p><br/><p>It's nothing more than a series of how some people shouldtreat their bodies better, they can't stay up late anymore, should take theirmedicine on time, should not pour out the medicine just because it's bitter, ifyou don't cherish your body, who will?</p><br/><p>The words entered Xue Ling's left ear and exited out hisright ear, and when the imperial doctor finally stopped, he smilingly said, \"Iknow. Could the imperial doctor please call the general for me? I havesomething else to discuss with him.”</p><br/><p>The doctor was so angry that even his beard turned up. Herushed out in a rage, mouth full of opinions, do you still want to keep thislife?</p><br/><p>Xue Ling shrugged his shoulders, but he could not live long in any case. Why worry about it?</p><hr class=\"wp-block-separator\"/><br/><p><em> jǐn nánɡ – Silk bag The so-called brocade bag is actually a bag made of silk, satin, silk and so on. It was used to carry letters in ancient times, which is equivalent to the envelope now.</em></p><br/><p><em>the next chapter is the conclusion to this arc – we’re almost there! I have to say, this is one of my least favorite arcs in the novel. It drags a bit, and the MC is half-dying the whole time  but, starting at a low point means means that it only gets better!</em>~ </p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}