{"title": "Chapter 6", "id": 6, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-6", "volume_title": "Volume 1", "body": "<h1>Chapter 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>1.6 - Can't die before the general goes out to battle</strong></p><br/><p>When Xue Ling woke up again, it was to the sound of XiaoQing's intermittent crying in his ear. He coughed a few times, his chest achingsomething fierce, but still laughingly said, “As a man, what kind of skillis crying and wailing?”</p><br/><p>Xiao Qing saw that he had woken up and stopped his tears,but his voice was still choked up. He reached out to prop up Xue Ling. \"Gongzi,you're finally awake.\" </p><br/><p>Xue Ling coughed again, looked at his surroundings, andasked, “Where is this?” How long did I faint for?\"</p><br/><p>“Gongzi has been in a coma for three days and nights.If you hadn't woken up soon, Xiao Qing would have followed you.” Smalltears are still flowing, at this moment, these days of fear have all turnedinto grievance. Since gongzi's last serious illness, he has never experiencedsuch a feeling of great panic.</p><br/><p>Xue Ling was amused, “Saying it like this, as if yourfamily's gongzi will pass on at any moment.\"</p><br/><p>Xiao Qing was red-eyed and did not speak. In fact, accordingto the imperial doctor from the palace, the gongzi’s remaining life was indeednot long. He also thought that his gongzi would not wake up this time, and wasreally determined to go with him. “Here’s the general’s palace. Right, nowthat gongzi is awake, the general should be informed.”</p><br/><p>Xue Ling was somewhat surprised. Although he ultimately choseto faint in the arms of the general, he did not expect to be brought back bythe other side. He waved his hand and said, “This is the general’s palace.It's redundant for you to inform him of what happens here.\"</p><br/><p>Xiao Qing’s face was full of confusion, and then he saw blackgarbed general walk in, expression stiff.</p><br/><p>Xiao Qing quickly wiped the tears off his face. “Gongzijust woke up, I'll go to the kitchen to prepare some food for you.”</p><br/><p>Xue Ling nodded, dismissing him, then carefully looked overthe general.</p><br/><p>Although he had always known that this lord gong was intenselyhandsome and dazzling, but the feeling that the enemy was strong while he wasweak was not very good. Xue Ling wanted to exert his own momentum properly andnot be overwhelmed by the other side, but his body was too weak, and it was of nouse.</p><br/><p>Perhaps because it was tossed around on the first meeting,the system had a psychological shadow, and disappeared after seeing the general.Xue Ling and the other party looked at each other silently for a moment, beforeslowly unfolding a simple and innocent smile. “These few days, thanking LordGeneral for his care.”</p><br/><p>Cong Hui calmly asked, “Why didn’t you come to mebefore?”</p><br/><p>Xue Ling was taken aback, brain turning. Only then did heunderstand what this great god meant with his concise words. “When all issaid and done, first impressions are the strongest, it was not sure if I couldwin others' trust.\"</p><br/><p>The Lord General's expression turned bad all of a sudden.“It was I that recognized a person wrongly.”</p><br/><p>Xue Ling smiled and waved his hand, as if he had totally didnot care about the matter. “It is I who judged a person wrongly. I did notexpect to add these troubles to the general.” He moved slightly, feelingthat there should be no problems, and prepared to get up. “It’s not goodto bother your excellency so much. I’d better say take my leave.”</p><br/><p>“His Majesty permits you to first stay at my residence.”Cong Hui stopped his movements, adding, “Your own body, you should beclear.\" </p><br/><p>Xue Ling’s look changed slightly. In order to allow him towalk and move around freely for a while, the system directly extracted thisbody's future life value in order to improve his physique, which led to hisbody getting even worse after being rejected from the world's consciousness,and the time of death was immediately brought forward.</p><br/><p>Xue Ling feels a bit out of sorts. “Indeed, this one's()body has not been well from an early age. Recently being able to be so lively, itseems even the heavens were unwilling to let me die so wronged.\"</p><br/><p>Cong Hui seems to have some taboos about him bringing up theword death, wrinkling his brows and saying, “The imperial doctor said thatyou had an old disease in your body. That day when you were in the palace, yourheart and soul were exhausted, which damaged your body even more. You need toproperly take care of yourself. His Majesty has given you permission not to takeup a role as an official, you only need to recuperate well in my residence.\"</p><br/><p>Xue Ling frowned. With such an article, the emperor couldnot possibly not make him an official. There must be something hidden behind it.</p><div><div></div></div><br/><p>“His Majesty's intention is that you can write morearticles with your opinions while recuperating. He appreciates your articlesand thinks your proposal is very good. It’s just that your body's state doesnot allow for you to overwork, so you don’t need to go to court.\" Cong Hui uponseeing his frown, sighed in his heart and explained it like this.</p><br/><p>Xue Ling nodded and understood. “His Majesty wishes Icould pen down more of my ideas while I can still write.”</p><br/><p>“His Majesty is well intentioned.” Cong Hui's facewas tight.</p><br/><p>Xue Ling laughed, saying with amusement, “Then,thanking His Majesty for making decisions for me this time, writing is justwriting. What did the imperial doctor say about my body, how much longer can I dragout this last breath of life?\"</p><br/><p>Cong Hui's gaze was gloomy and dark, but could not see fromthe other's eyes even half a point of fear, the other party is obviously notvery concerned about how long he can live, perhaps for him now, it does notmatter whether he lives or not? “Two or three years is possible as long asyou properly convalesce.\"</p><br/><p>Xue Ling made an 'oh' sound, wrinkled his brows. “Forthe sake of me dragging this sick body to serve His Majesty, I wonder if His Majestycan show me grace and look into my innocent and wronged parents, restoring myfamily name?\"</p><br/><p>“I’ve already told people to look into it. It won’t belong before news arrives.” Looking at his open and clear expression as hespoke, Cong Hui saw the words that went unsaid, that it was his dying wish,hoping that it does not become his unfulfilled will, asking the general tohelp. “Before that, you should have a good rest here.”</p><br/><p>The Lord General turned around and left. Xue Ling waiteduntil there was no more sounds before pulling the system out of the shadows.“What’s the problem? Clearly the shou has already been free to go die (),why is the fate of the gong still unchanged?\"</p><br/><p>See bottom for  explanation. Hilarious.</p><br/><p>The system gracefully stepped onto the quilt covering Xue Ling,found a comfortable position and settled down before finally speakingunhurriedly:  “Changing a person’sfate is divided into two ways. Previously, host Duan Xuyang’s plagiarism infront of the emperor, which destroyed his career and made him no longer haveany possibility of redemption, and also had Cong Hui witness everything, convenientlyruining their love. The originally happy and blessed with both career and loveshou has lost it all, so his luck is very easy to extract. Although you havedestroyed the love between the gong and shou, you haven’t changed his careerand future, so you can’t leave the world for the time being.”</p><br/><p>Xue Ling tsked, a bit unhappy: “So  troublesome.”</p><br/><p>“This is the first world, it can be deemed necessary tomake the host aware of the rules.”</p><br/><p>“Will taking out his luck kill the gong, or change hisoriginally successful life?\"</p><br/><p>“How can that be possible, he is the protagonist of theworld. If he is not a multi-faceted evildoer that deserves to be punished, hewill still be the pride of heaven even if he loses his luck. Moreover, the TenDirections World is not somebody that forcibly plunders. The gong's luck can bedrawn away when he dies.\"</p><br/><p>“It can also be like this.” Xue Ling thought aboutit and found that there were many loopholes in this set of rules. Looking atit, the meaning of the Ten Directions World is very obvious. There are somepeople that cannot afford to carry the title of god's favoured one, and thereare people whose life trajectory have been affected by these \"God's Favoured One\"or \"King of Luck\". What he has to do is to bring the plot that has been draggedinto deviation by the protagonists back into place.</p><br/><p>Where did these all these world-changing phoenixes, praisedby the people heroic youths, come from? A protagonist’s success is always piledup on top of a pile of cannon fodder corpses, some guilty and deserving, some particularlyinnocent, what he has to do, approximately is to help those innocents happilydo some face slapping.</p><br/><p>“That’s right.” The system remembers one point.“This world is a trial world, so the content is relatively simple, and thehost requirements are relatively small, but you can't be like this in the next officialworld.\"</p><br/><p>“What did I do…\"</p><br/><p>“The speed is too fast, the OOC is too serious, and inthis case it’s impossible to live until this cannon fodder's original age. Look,you can't even help the cannon fodder die a natural death.\" The system countsthe faults of its own host. “But it’s understandable, this is your first timedoing such a job. Next time just remember not to be too impatient.\"</p><div><div></div></div><br/><p>Xue Ling rolled his eyes. “It's necessary to live untilthe end of their natural lives?”</p><br/><p>“Yes, rest assured, the world here is not matched up tothe events of your own world. Regardless of how long you stay in these worlds,in your own world It’s only a matter of three or two days.\"</p><br/><p>Xue Ling's lips twitched. If he really followed this route,how long would it take for him to collect his nine tails?!</p><br/><p>His heart is so depressed.</p><br/><p>“Regardless, we should first change the future of thegeneral.” Things that will come later, he can worry about when he changesto another world, right now there is a problem in front of him, waiting for himto solve it. “How can we change his future?”</p><br/><p>“Uh… According to the settings, as long as he doesnot marry a wife and have children, living a blissful and fulfilled life, itwill be fine.\"</p><br/><p>Xue Ling was silent for a moment, “Your master is trulycruel.”</p><br/><p>The system has no choice but to say, “Every world hasdifferent requirements, there's no other way. Happiness and bliss is not a big requirement,as long as you accomplish the first point, we can leave the world smoothly.\"</p><br/><p>Xue Ling 'haha' laughed out loud, meaning, I only have thislittle bit of time, how can he see the other party not marry and have children,what kind of relationship do they have?</p><br/><p>The system expresses, there’s no other way, he doesn’t careabout this.</p><br/><p>Xue Ling thought painfully for a while, and Xiao Qing camein with food. So he decisively abandoned such a troublesome matter and ateinstead.</p><br/><p>In the days that followed, everything seemed to return tonormal.</p><br/><p>Xue Ling nurtured himself in the General’s Palace, and livedevery day without leaving home. Living daily like a shut-in, only venturing outas far as the courtyard to bask in the sun. The general would come to see himevery day, and the two of them sometimes talked aimlessly, Xue Ling found thatthis protagonist gong was indeed the author’s favorite, he was reallyproficient in everything. If it was the original body's owner, he absolutely wouldhave worshiped the other with stars in his eyes every day.</p><br/><p>Shortly after, Duan family's investigation into his parents resultsarrived. Xue Ling knew that it was the quiet before the storm, but was unclearabout whether or not it was the inertia of the plot, but the Lord General didfind some clues. And the big official involved in this matter, will presumably attemptto usurp the throne in the near future.</p><br/><p>Xue Ling did not want to be involved in this matter, so hejust acted as a quiet and beautiful man, writing articles every day, giving theemperor some of the original body's owner and his own ideas, making it so thatevery time the emperor saw his article, could only loudly exclaim 'genius', andlament that unfortunately, his remaining life was not long.</p><br/><p>Rewards and valuable medicinal herbs were constantly sent tothe general’s palace. Xue Ling was lazily sunning in the yard. He had no idea whatcommotions were happening outside.</p><br/><p>If you have to describe it, it’s probably a big scandal thathas stormed the whole city.</p><br/><p>That morning when Cong Hui came to eat breakfast with him,he looked the same as usual, he didn’t mention anything. In the afternoon,there was a rumor outside that the Left-wing ministers had rebelled.</p><br/><p>The soldiers of the General’s Palace were firmly guardingthe General’s Palace, Cong Hui's secret guards surrounded Xue Ling’s house, fearingthat something might happen to this big entity.</p><br/><p>Xue Ling received the news, and supplied the other with one or two strategies before returning to his room and taking a nap. He was not completely worried about what kind of disturbance the coup would cause, calmer than even the oldtimers in Beijing who heard the news.</p><br/><p>The guards had no idea what this man was thinking. Afterlooking at each other, they could only comfort themselves, everything is fine aslong as he obediently stays at the General's Palace.</p><br/><p>If anything happens to him, the general will probably go mad.</p><hr class=\"wp-block-separator\"/><br/><p><em>the title, lol. ，. It took me a while to figure it out,  actually translated literally means \"bringing the dog\", but if you read it out loud it sounds like \"go die\". I'm learning slang! \\^_^/</em></p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}