{"title": "Chapter 9", "id": 9, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-9", "volume_title": "Volume 1", "body": "<h1>Chapter 9</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>2.1 - Tragedy, it's a great tragedy ah</strong></p><br/><p> When he returned home, he discovered that his elder sister’s spirit was somewhat abnormal, having some doubts towards their parents' accident. He wanted take over his parents’ company, but found that most of the shares were given to his brother-in-law in their will.</p><br/><p>The shares left in his hands became the ticking bomb that took away his life.</p><br/><p>After his parents died, his sister suffered from depressionand committed suicide in the bathroom at home. Suspicious, he hired a detectiveto investigate and found that while his brother-in-law married his sister andwere living life together, he also had a “true love” that he waskeeping outside. That person was his first love, both of them were the same, beingchildren from the countryside. </p><br/><p>His sister's second child was actually a little girl that was replaced at birth with the mistress' and brother-in-law's son without anyone knowing otherwise.</p><br/><p>When he discovered this, Wen Xiuyuan was very angry. He began to trace the truth of his parents’ death, and found that it was his brother-in-law who broke his apart his family. All his plots were in order to take away their family's business.</p><br/><p>His parents passed away in a car accident, his sister died tragically, and his little nephew grew up introverted and depressed. He wanted to take back his niece, but his brother-in-law beat him down, plotting against him, and he ended up being accused of molesting the girl. He was disgraced, his hands ended up run over by a car and completely destroyed. Finally, he drowned in the reservoir in order to save his niece that had been pushed into the water by the mistress.</p><br/><p>Such a life is a tragedy with capital letters. Reading sucha plot, Xue Ling already feels his teeth hurting, and he doesn’t know how muchhatred the author that wrote this ultimately has for Wen Xiuyuan, to treat himlike this.</p><br/><p>In this book, the male and female protagonists are twoinnocent childhood friends, working hard together to leave the mountains, withdeep attachments to each other, it's a first love that's both sweet and alittle over the top.</p><br/><p>But all this was destroyed by Wen Xiuting’s appearance.</p><br/><p>She is a lady from an influential family, gentle andcourteous, with good looks, and well behaved. </p><br/><p>For the sake of his future, the male protagonist separatedfrom the female protagonist and pursued her enthusiastically. This showcased thefemale protagonist's need to struggle for herself.  And the male lead never truly fell for WenXiuting, he swore to love her and take care of her, just for her familybusiness.</p><br/><p>Also because Wen Xiuting has a younger brother who is whollyabsorbed in music, blind to the outside world, this type of family, is theeasiest to plot against.</p><br/><p>Years of painstaking management, jostling for stock ownership, car accidents, as well as the emotional abuse leading to the suicide of his wife, everything went according to the plans of the male protagonist. At the same time, the female lead had always been striving hard for her own career. Their son was switched into the family by the male lead, and she would not bother to painstakingly take care of the little girl that was switched out, casually leaving her to the nanny, uncaring about the child's life or death.</p><br/><p>At the end of the plot, the man got the Wen family's company,changing it into what he wanted, and the woman became an excellent,internationally renowned fashion designer, marrying the man with the public'sblessing.</p><br/><p>Supposedly it was because she treated their two children very well, and had a great reputation in society circles.</p><br/><p>As for the Wen family that was originally living well, dueto the two people's constant splashing of dirty water and smearing, completely disappearedfrom people's eyes.</p><br/><p>It's basically a matter of incompetence - obscene writing, the plot was not very entertaining other than Wen Xiuyuan's fate being particularly tragic, in Xue Ling's eyes this story is full of bugs.</p><br/><p>“What is his wish? Revenge? ” Xue Ling asked thesystem.</p><br/><p>“He wants to be a pianist, to win this competition, tostudy in the world's most famous Conservatory of Music. He also wants to savehis sister and her two children, and finish off that scum man and woman.\" Thesystem circled around Xue Ling twice, asked, “Host, can you play the piano?”</p><br/><p>Xue Ling hooked his lips, \"What's unlikely about that?\"</p><br/><p>“That’s good then. The competition will start soon andthe phone expected phone call is about to come, you had better think throughwhat to do.\" </p><br/><p>“Of course.” Xue Ling smiled, “Have my sisterand little nephew leave behind that sea of misery.”</p><div><div></div></div><br/><p>The little fox curled up its tail, its host is so good, itdoesn't have to think about anything, and he will come up with a pile of planson his own. </p><br/><p>“Ah, yes.” The system jumped onto Xue Ling’sshoulder, “I forgot to emphasize one thing with you before. You can onlyleave this world when the host body dies, but since you are using their body, youneed to let them die a natural death!\"</p><br/><p>Xue Ling nodded and promised very quickly. After all, hehimself also felt very unhappy due to his last body's bad state and subsequentearly death. And since his own body can’t be repaired for the time being, stayingfor a while in each world does not matter much.</p><br/><p>Others may be afraid of losing themselves in this long riverof time, but Xue Ling is a fox that has lived for many years, a single person'slifespan is not a long time for him. And subsequently, won't develop any attachments.</p><br/><p>The phone rang as the system predicted. Xue Ling coughed lightly,and accepted the call. “Sister?”</p><br/><p>“Xiuyuan!” Wen Xiuting’s voice was choked withsobs: “Mom and Dad died in a car accident!” Starting off with such asentence, it's no wonder the original host lost the competition, thinking ofhow his elder sister is about to collapse.</p><br/><p>“Elder sister.” Xue Ling lowered his voice, itsounded very good, carrying some type of charm, making people slowly calm down.Even though it's through the phone, crossing over countless countries, it can stillmagically calm Wen Xiuting's panic. \"No need to worry, don't cry.\"</p><br/><p>Wen Xiuting recovered from the depths of her hysteria. Shewas sitting outside the emergency room of the hospital, beside her was herslightly dazed eldest son that had just been picked up from kindergarten, herhusband was still out of town on for business. All she could think of was heryounger brother.</p><br/><p>“Sister, where are you now? At the hospital? Mybrother-in-law is not beside you, who else is there?\" Xue Ling, while straighteningout his clothes in front of the mirror and preparing for the competition, simultaneouslysoothed Wen Xiuting’s emotional outburst.</p><br/><p>“I…” Wen Xiuting sobbed, “I brought Wen Mo withme outside the hospital emergency room, mom and dad already… already passedaway… Yongyi is still on business and I can’t get in touch with him… I’mreally confused… I don’t know what to do… Woo… “</p><br/><p>Wen Mo is Wen Xiuting’s and Xu Yongyi’s eldest son. Becausehis father neglected him and deliberately treated him coldly, his personalitywas extremely introverted and quiet. He can spend half a day not saying a singleword, and even as his mother cried until her face was full of tears, he stilljust stood to the side quietly, silent like his name's meaning.</p><p class=\"has-small-font-size\"><em>Wen Mo's name is</em><em>, </em><em> can be derived from </em><em>, which is to be silent.</em><em></em></p><br/><p>“Sister, listen to me.” Xue Ling eyes were hooded,“Go home, take out all the cash and the funds that you can move, put themall in a new account of your own, and then take all of your and Momo's theidentity documents, leave City X, go to City Z, first find a hotel to stay in,and wait for me to get back.”</p><br/><p>“Ah?” Wen Xiuting’s face is full of confusion,even if she was a little tired from crying, she had not become a fool. What herbrother was asking her to do are not things that should be done upon theirparents' death. \"But what about Mom and Dad and Yongyi?”</p><br/><p>Xue Ling's lips lifted, “Sister, my competition isabout to start. After it's over, I will immediately fly back to deal with momand dad's affairs, don't worry. Just do as I said first, I will contactbrother-in-law.\" </p><br/><p>“But… Why?”</p><br/><p>“Sister, mom and dad's car crash was not an accident.”Xue Ling very calmly spoke out the truth. “It’s not safe for you and Momoto stay in City X, be good and listen to me this once.\"</p><br/><p>It's the first time that Wen Xiuting, who has been the eldersibling for so many years, heard her brother talk to herself like this.</p><br/><p>Over the years, her younger brother, who has always beenimmersed in his own world, seems to have come out of it…</p><br/><p>Wen Xiuting is really happy, and yet also sorrowful, it's amazingWen Xiuyuan can guess that there are forces behind their parents' affairs. withinsuch a short time. Adding on her own doubts towards her youngest son, shepursed her lips and nodded, “Then, Yongyi and Qingqing's side, will behanded to you.\"</p><div><div></div></div><br/><p>“Rest assured sister, you keep yourself and Momo safe,wait for me to pick you up, and then we can discuss everything properly.\"</p><br/><p>“Ok.”</p><br/><p>Xu Yongyi is someone who married into the family. Accordingto the original agreement, he and Wen Xiuting’s first child must bear thesurname Wen. That child is Wen Mo. Xu Qing, the second son, has never gainedXiuting’s affection. Instead, Xu Yongyi's care for him was extraordinary,wanting to keep him by his side every day. </p><br/><p>Wen Xiuting had doubts towards this son. She clearlyremembered that before she passed out from the pain, she heard a nurse shoutingthat she was a girl, but when she woke up, she was told by her husband that itwas a boy. At the beginning, she only thought she had been hallucinating, butshe just couldn't bring herself to love Xu Qing.</p><br/><p>After hanging up the phone, Xue Ling turned around andopened the door. The staff who came to inform him that he was going up on stagenext stood outside the door a bit dazed, hand still raised in the air, apparentlyabout to knock on the door when he opened it himself.</p><br/><p>“Mr. Wen, it's almost your turn. Follow me backstage.\"</p><br/><p>Xue Ling answered with a smile, “Thank you. Please leadthe way.</p><br/><p>The staff only felt their eyes being dazzled, somewhatunable to open their eyes in front of this pretty and delicate youth. </p><br/><p>What’s the deal, why are the contestants in the musiccontest more dazzling than those from the talent show, to the point where onedoes not dare look on directly? </p><br/><p>Born from a rich and influential family, Wen Xiuyuan originallyalready had a special temperament. In fact, his appearance has always been verygood, but because he was always cold and aloof, his sense of presence was notstrong. Now that Xue Ling has taken over, his facial features in addition toXue Ling's own pair of fox eyes, naturally showed some brilliance. The molesunder the corners of his eyes are attract attention, able to charm with just aslight smile.</p><br/><p>The system curled up on Xue Ling’s shoulder reminded him,“Don’t change too fast, if people perceive Wen Xiuyuan’s abnormality, youwill be rejected by the world again.”</p><br/><p>Xue Ling made a sound to indicate he understood, adjustedthe expression on his face, effectively taking back that freely fascinatingair, so that the staff to the side cannot help but breathe a sigh of relief.</p><br/><p>Really must be thankful, after the youth stopped smiling, hewas finally able to breathe. Just now, he even felt that he was not qualifiedto stand beside him, polluting the air around him with just his breath. </p><br/><p>This music competition is an international affair, held in afamous concert hall in Europe, with participants from all over the world. XueLing adjusted his suit and listened to the host introduce him on the stage asMr. Wen.</p><br/><p>The original body's owner poured all his emotions into hispiano playing. Although he had some shortcomings in technique, he could often movepeople to tears. His piano music was full of emotion and sincerely eulogizesthis beautiful world.</p><br/><p>Xue Ling won’t change his style, but what he can do, is improvethe level of his technical skills. </p><br/><p>Once you have a very long lifespan, simply living can turninto a very boring thing. Xue Ling has many interests and hobbies, even justplaying the piano is something he spent a hundred years to study.</p><br/><p>He travelled all over the world, and during that period, hevisited countless masters that had left their marks in the annals of historyuntil at last, like gaining an epiphany, he shut himself in closed-doorreflection. When he came out again, he changed his hobby. </p><br/><p>Style is something he can change slowly, but he still likesthe way the original owner's way of expressing his feelings.</p><br/><p>The brilliant and talented young man slowly stepped up ontothe stage under applause. His hair was tidily combed on his head, showing apretty and delicate face. A slim suit outlined his upright figure, he is an easterner,not tall, but with long legs.</p><br/><p>He bowed in greeting, and when he looked up again, everyonenoticed his beautiful eyes.</p><br/><p>Bright and sparkling, shining with love for the world. </p><br/><p>He sat down, placed his hands on the piano keys. </p><br/><p>Music sounded, and everyone's gazes shifted towards him.</p><br/><p>His music, even just from the start, shook the hearts ofeveryone present.</p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}