{"title": "Chapter 12", "id": 12, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-12", "volume_title": "Volume 1", "body": "<h1>Chapter 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>2.4 – This is my business card</strong></p><br/><p>Xue Ling blankly stared at the system. “Is this part of the plot?”</p><br/><p>The system's face also looked unnatural. \"Er… it… shouldn't be…\"</p><br/><p>Xue Ling turned back to the phone and continued the conversation with the detective. “Abducted? Can you find her?”</p><br/><p>“The search parameters is too broad. She has already been abducted for some time. The old lady took the little girl with her to play mahjong. Nobody looked after her for most of the day, so no one knows when she disappeared. The next day, they looked for her all day, but didn't dare to tell Xu Yongyi for another two days. Xu Yongyi has already gone over to search.\"</p><br/><p>Xue Ling narrowed his eyes. What kind of situation was this, did the difficulty of the game suddenly increase?</p><br/><p>“I see. Either way, help me keep looking for clues. I'll send over the final payment now, so remember to keep them under observation. No matter if it's Xu Yongyi or Bai Luzi, keep me updated on their movements.\"</p><br/><p>“Okay, you're the one with the money - I'll do as you say.”</p><br/><p>Xue Ling wrapped things up with the detective, then rubbed his chin and asked the system, \"How did this happen?\"</p><br/><p>The system laughed awkwardly under the death glare of the other party and shrunk itself into a ball full of grievances. \"Host, you can't blame me for this…\"</p><br/><p>“If you have to blame someone, then yes,” The system answered. “When you came into the world, you changed the plot, and subsequently the world's plotline. This is the so-called butterfly effect. Although what you did had little relations with the main plot, it seems that the main plot has been pushed forward, so problems more likely to probably follow.\"</p><br/><p>“So, what did I do that could cause my niece to be kidnapped?\" Xue Ling didn’t believe the system's words. “Do you have any other excuse?”</p><br/><p>The system's eyes moved as it pondered. “Maybe other incidents occured outside the scope of my awareness.”</p><br/><p>Xue Ling stared at the fox. The system already shrank into a ball, and did not say anything else. After determining that the system really didn't know anything else, he somewhat begrudgingly sighed. Wen Xiuyuan’s life truly was hard.</p><br/><p>If Xue Ling has heard of these news, naturally Xue Yongyi was also informed.</p><br/><p>Bai Luzi’s son was switched at birth and raised at home like a treasure, but Wen Xiuting’s daughter didn't receive the same good treatment. Bai Luzi did not care much about her. If work got busy, she treated her like air. Xu Yongyi entrusted his daughter to his mother, but Mrs. Xu was a village aunt from the countryside. When she arrived in the city, she learned how to play mahjong with others and stayed at the mahjong table all day long. She wasn't aware that her grandchild was abducted, and didn't even notice she was missing until she decided to go home in the middle of the night.</p><br/><p>Afraid of reprisal, she did not dare to tell her son for two days, and only told shakingly Xu Yongyi when she still couldn't find the child.</p><br/><p>The matters in Xu Yongyi's hands also reached a critical point. These terrible news gave him a terrible headache. In the end this was still his own daughter and he should go to search for her, however raising the alarm in this situation may cause other problems. He could only choose to suppress the information. </p><br/><p>“Now is the wrong time. After my current situation stabilizes, I will find people to search for her.\" He comforted himself and threw himself into the funeral arrangements.</p><br/><p>Xue Ling finished the video the system filmed of his struggle, laughed coldly and went out.</p><br/><p>He falsely claimed that Xiuting was in his care, ill and bedridden. Xu Yongyi really believed him, only asking if she would be able attend the funeral, hung up once he received a reply and didn't pursue the matter. Whether it was because the pair of siblings had already transferred over their shares was unknown.</p><div><div></div></div><br/><p>These two days, Xue Ling also asked Wen Xiuting to not return home for the funeral in order to stay out of Xu Yongyi's reach.</p><br/><p>When Wen Xiuting heard about what evil deeds Xu Yongyi had done from her brother, her affection for him died. If Xue Ling hadn’t calmed her, she would probably have gone over to take Xu Yongyi down with her. Although she was no longer fuming, she didn't want to attend the funeral that scum arranged for her parents at all. It would be better if her brother didn't go either - she wanted to break off all contact with Xu Yongyi.</p><br/><p>Her brother said that they can't win against him now, and only could plan slowly, step by step.</p><br/><p>Looking at her silent, expressionless son playing with building blocks on the ground, Wen Xiuting's heart was filled with unhappiness. </p><br/><p>Xue Ling didn't tell her about her daughter's abduction yet, fearing that she might still come back and fight with Xu Yongyi.</p><br/><p>Although she was a lady who grew up in a wealthy family and looked soft on the outside, she was strong-willed. Otherwise, she would not be busy working instead of looking after her family. She also took care of her younger brother who didn't talk much and was always immersed in music. Now, she was relying on that same younger brother, which made Wen Xiuting feel strange.</p><br/><p>It was also this feeling that made Wen Xiuting act differently from the original story, where she held in her feelings until she collapsed and Xu Yongyi emotionally abused her to the point she commited suicide.</p><br/><p>The funeral went smoothly. Xue Ling’s expression was so sad that the board members who had been angry and unhappy with him were unwilling to say anything else.</p><br/><p>After all, he's a young boy who just lost his parents. What did he know? After this, they should look out for him more.</p><br/><p>Because the board members were watching, Xu Yongyi had to buy Xue Ling’s shares at a price higher than the market's going rate. He still was happy to spend the money, and Xue Ling also was happy to receive it.</p><br/><p>Money, no matter whether he was in modern or ancient times, was not something he would about complain having too much of.</p><br/><p>Dealing with the board members, his parents' friends and relatives, took up the whole day. When Xue Ling finally had some time to rest, a dark sports car came up to the villa through the garden and stopped at the door.</p><br/><p>In the original body owner's memory, though the company his parents ran did fairly well, they were still not rich to enough to drive a limited edition sport car everywhere, so Xue Ling was quite interested to know who it was.</p><br/><p>Ever since the system mentioned that there would be some strange 'revised areas' because he joined the world and changed the plot, Xue Ling paid special attention to appearances of unexpected people, fearing that his plan would get carelessly destroyed.</p><br/><p>The car's front door opened, and a middle-aged butler got out and respectfully opened the rear door.</p><br/><p>Xue Ling’s lips twitched.</p><br/><p>This entrance…</p><br/><p>First appearing in Xue Ling line of sight was a pair of black leather shoes, then moving upwards, a pair of long, straight legs in black suit trousers. The man's figure was very good, the standard inverted triangle with wide shoulders and narrow waist - he would get full points as a mannequin.</p><br/><p>In addition to his figure, he had a picture perfect face, dazzling golden hair neatly combed to the back, giving him a sophisticated look, and a pair of pale blue eyes. Xue Ling was only staring from afar, but the man's pair of eyes locked on him from the moment he stepped out of the car.</p><br/><p>With a high-bridged nose and slightly parted thin lips, the man was dressed like a gentleman. His expression was cold and aloof. When his gaze fell onto Xue Ling, it slightly softened.</p><br/><p>Xue Ling watched his mouth open and close. Although it was a little far away, he still understood what the other party said.</p><div><div></div></div><br/><p>“My condolences.”</p><br/><p>?</p><br/><p>Xue Ling was a little hesitant. Did he know this man?</p><br/><p>This didn't seem like a character from the plot?</p><br/><p>He got up, left the garden, hurried through the corridor and brushed past Xu Yongyi on the way. Rushing out, he left Xu Yongyi who was about to call him standing there, stunned.</p><br/><p>Xue Ling opened the door just as the man arrived at the doorway. </p><br/><p>He nodded at Xue Ling and stepped to the side. It seemed that he wanted Xue Ling to come out.</p><br/><p>Xue Ling was curious. Since he was not here to attend the funeral, why would he send his condolences?</p><br/><p>“Hello.” He politely greeted, using fluent english because he could see the other party was from abroad. His Londoner accent was a remnant of when he went to E country to study in his youth. “Excuse me, may I know who you are?\"</p><br/><p>“Director of the Zugeji Conservatory of Music, Cole Owens,” the man introduced himself. </p><br/><p>Xue Ling paused, astonished. “I have already rejected your college…”</p><br/><p>The man nodded. “I heard. Only, you are a genius. I hope that you can shine in the Zugeji Conservatory of Music.”</p><br/><p>Xue Ling shook his head. “I’m sorry… Some things… happened at home… So I… \" He gave a bitter laugh. “Won't be touching music in the near future.”</p><br/><p>The look on his face was hard to read. Xue Ling even felt a gust of cold air wrapping around himself, but in the end the other party held back and did not do anything else, only adding: “I still hope you will reconsider.”</p><br/><p>The butler conveniently handed him a business card. Xue Ling was stunned for a second before taking it with both hands. </p><br/><p>“I hope we that we can meet again. ” The other person said.</p><br/><p>Xue Ling frowned slightly.</p><br/><p>He didn’t like the feeling this man gave him. He felt really uncomfortable, like he was being stared at.</p><br/><p>Although the lack of any expression on his face when he spoke made his mood indiscernible from his pale blue eyes, Xue Ling always felt like he was prey to be hunted.</p><br/><p>After calling out the system and confirming that there was nothing wrong with the man, Xue Ling dropped his doubts. It was probably because of his performance at the competition. He did not participate in the final award and refused the invitation to the Conservatory of Music, so the man came to his door.</p><br/><p>Xue Ling turned and went back into the house. The man in the car stared at his retreating figure for a long time even though nobody was there anymore.</p><br/><p>“Sir?” The butler prompted quietly. </p><br/><p>The man turned around, acting as if he was not the one whose mind just wandered. “Let’s go.”</p><br/><p>The butler made a sound of acknowledgement and signalled the driver to quickly leave.. It was not his place to say anything to his master. </p><br/><p>He has no idea what madness went through his master's head, pursuing someone all the way to H country, but unexpectedly not even showing his intentions, only asking him to give out a business card before leaving…</p><br/><p>He really couldn't understand… </p><hr class=\"wp-block-separator\"/><br/><p><em>Bluebug: Our dear translator was so flustered that the author spent a whopping three paragraphs on describing this mysterious director. Chinese paragraphs truly are hard to translate… every paragraph consists of only one or two long sentences. That's right, folks, chinese is the asian version of italy, they never stop speaking (JK italians only speak fast, nothing more, nothing less)</em></p><br/><p><em>xiin: *cough* </em><del><em>our dear editor was equally flustered, leaving certain paragraphs till the very end.</em></del><em> anyway, the ML makes his grand entrance and the fox system is still useless~</em></p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}