{"title": "Chapter 29", "id": 29, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-29", "volume_title": "Volume 1", "body": "<h1>Chapter 29</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>3.6 – Able to walk through the back door so openly and honestly</strong></p><br/><p></p><br/><p>“You have to sign with White Light Entertainment because of the bet with your elder brother, so I've only looked for brokers from White Light.” The system did not want to bother with jibes from its host who had nothing better to do than to tease it and instead began widespread information retrieval. “There are nine senior brokers in White Light. Aside from three who have superstars and won't have time to pay attention to you, two who are more inclined to manage female artists, and one who relies on shady business for resources, there are three left that you can choose from.\"</p><br/><p>Xue Ling lazily acknowledged its words.</p><br/><p>“Except for one of them who has taken someone abroad and is not in the city, there are only two senior brokers in White Light who have the power to sign people on a silver level contract or above without having to confirm with the upper management.”</p><br/><p>“Who?”</p><br/><p>“Qi Ruishi and Jin Jiren.” The system provided the data of these two people separately, and gave Xue Ling a short analysis. “Qi Ruishi is a famous female broker, with no bad records and good ability. She used to have a group under her hands, but after they became popular, more and more of them wanted to fly solo. She seems interested in finding a new person to take under her wing, but doesn’t want to take on another group. Jin Jiren has two artists, a man and a woman. If host wants to be an actor, your acting skills are definitely above theirs, but there’s no need to suppress them since you can’t expect the broker to take care of you exclusively—you’re not an international superstar.\"</p><br/><p>Xueling followed the GPS navigation and was already inside the urban area. His eyes flashed as he heard the system's words, and he lightly said, “I will be, sooner or later.”</p><br/><p>The system didn’t want to argue with him about this. It continued to search and asked, “Have you decided who to pick? Qi Ruishi is in White Light HQ and Jin Jiren is on the set. You can go and see if you can take on that role while you're there.\"</p><br/><p>Xue Ling silently set the destination towards White Light HQ. “Let's go with Qi Ruishi. I don’t want my agent to be responsible for two other people in addition to my affairs. It would be weird and offensive.”</p><br/><p>The system had already guessed his thoughts, and silently said a prayer for Qi Ruishi. It understood Xue Ling's intention—he wanted not only to find a broker to manage his acting career, but also to find a person who knew everything about the entertainment circle. Not only would she help him deal with other trivial matters while he produced films and acted, she also had a wide range of contacts and could easily help him find actors.</p><br/><p>Brokers were very familiar with these processes, so it would be best to find someone like that.</p><br/><p>Bai Hao was the big boss and could make everything much more convenient. But if Xue Ling wanted to do well, he needed to make his own arrangements.</p><br/><p>Xue Ling already made his choice, and the system chose to keep its mouth shut. It felt that its host had been acting strangely since this morning, and it would be best if it could avoid provoking its host for now.</p><br/><p>The White Light Entertainment Building was within the inner ring of the city. As White Light Entertainment came to prominence early on and had a lot of history, this has been their territory since a long time ago. After Bai Hao became president, he rebuilt the company building and added many floors. The area around the building was also theirs, and was made into a park. This kind of wasteful action in an area where inches of land could be measured with its weight in gold made people feel helplessly jealous. After all, Bai family did well in other industries and did not rely on White Light entertainment alone.</p><br/><p>Identification was necessary in order to freely enter. Bai Yue did not have any, but Xue Ling had a system and it was not difficult to enter the park. According to the system, Qi Ruishi’s office was in the main building and an appointment was needed to enter. Xue Ling did not feel any trace of guilt as he had the system forcibly change the appointment records to add their own.</p><br/><p>He reported his name at the front desk and was sent straight to the elevator. No one doubted him at all. After all, with a face like his, there was a high possibility that he would be a new artist. Though White Light's staff never judged people by their appearance—as long as there was an appointment or a logical reason, they treated everyone the same way.</p><br/><p>Only a company like this could survive in the industry for so many years and prosper.</p><br/><p>Nowadays, the entertainment industry was mixed with dragons and snakes. There were many companies, both large and small, as well as many scammers, and it was up to everyone to judge for themselves whether they were real or fake. If one really wanted to talk about rankings, if White Light entertainment claimed to be the second, no one would dare claim to be the first. It was an old and established enterprise and the company system was mature. Numerous superstars and artists were signed under its banner, and the company’s star-making ability was very strong. Signing with them was not a guarantee of success, but at the very least, there would be opportunities as long as one put in the effort.</p><br/><p></p><div><div></div></div><br/><p>Another company that could be considered good was the Jingang Entertainment that had signed Sun Jianan. It could not be considered a new enterprise and had a good reputation in the industry; its artists also had made great achievements. According to the original story, this company would eventually surpass White Light Entertainment and overwhelm them in all respects because they took in the mega-superstar protagonist shou.</p><br/><p>Xue Ling did not have time to be concerned over the competitors of his family's company. He asked the secretary to confirm his appointment with Agent Qi, and then followed the secretary to arrive at Qi Ruishi’s office door.</p><br/><p>The group of artists Qi Ruishi originally managed had pretty much scattered, and she had found another broker to take over what was left. She was now in the process of looking for two new artists to bring up. Although she was a senior broker, it would be difficult to do her work if she had no artist signed to her name.</p><br/><p>Just as she was thinking that the company’s latest newcomers didn’t bring anything special to the table, the secretary knocked on her door.</p><br/><p>Qi Ruishi’s was very organized about her daily work. She checked today’s schedule, and there was no appointment at this time. Why would the secretary come to find her?</p><br/><p>She stood up to let the secretary in and turned to pour herself a cup of team. Looking back, she saw a young man smiling at herself.</p><br/><p>She somewhat absent-mindedly waved for the secretary to leave. It was only when the door closed that she seemed to burst back into life, asking stupidly, \"And you are?\"</p><br/><p>Xue Ling quirked his lips, his eyes appearing to swirl. As soon as her gaze met his, she felt like she had fallen into a whirlpool. Qi Ruishi became alert and forced herself not to look into his eyes. But when she swept her gaze over him again, she found that his eyes were flat and calm, devoid of anything except his amusement.</p><br/><p>Qi Ruishi frowned.</p><br/><p>“Hello, my name is Bai Yue.” Xue Ling stretched out his hand, looking very sincere as he explained how to write out his name. “I’m here today to discuss signing a contract with you.”</p><br/><p>“Sign a contract?”</p><br/><p>“Eh?” Xue Ling acted surprised, “Was it not sister Qi who gave me her business card on the streets yesterday and asked me to come and sign a contract with you today?\" He was smiling, and the things he said seemed particularly credible. “You said that I have a talent for acting, and was particularly suited to be an actor.”</p><br/><p>Qi Ruishi had some doubts. She had never seen the person infront of her before today, but when she looked up to carefully examine Xue Ling’s face, his eyes flickered slightly and she nodded. “Think about it carefully. I don’t have anybody else in my portfolio right now. If I take you on, I'll probably assign a lot of things for you to do.”</p><br/><p>Just now, Xue Ling had fabricated a scene of Qi Ruishi meeting him on the road yesterday and wanting to sign him on. Foxes were not rare in human culture, and the stories of them being fox spirits or seductresses were more or less related to their extremely high enchantment and bewitching abilities. After the first two worlds, Xue Ling’s soul had become much more stable and it was no longer a problem to use small magic tricks like these. This was also why he was willing to make a serious bet with Bai Hao—he had absolute confidence that he would be able to have White Light Entertainment sign a contract with him.</p><br/><p>The system could only hold its fuzzy tail between its paws and bite it, feeling that its host was cheating.</p><br/><p>But Xue Ling couldn’t hear its thoughts, and would most likely pretend not to have heard even if he could.</p><br/><p>“I am a director.” Xue Ling slowly explained his identity while gradually deepening his hold on Qi Ruishi through hypnosis. He made her less vigilant towards himself, and more receptive towards his words. “So, I can't spend all my energies on acting. I can follow the schedule that you arrange for me, but we need to agree on the schedule beforehand.\"</p><br/><p>Qi Ruishi frowned and seemed to think that it was too much for a newcomer to make this request, but finally just pursed her lips and nodded under Xue Ling's hypnosis. “Fine. There should be mutual respect for work related things.\"</p><br/><p>Xueling smiled in satisfaction and watched as she took out the contract. Perhaps because she had been bewitched, the contract that Qi Ruishi brought out was a silver contract that was impossible for newcomers to receive.</p><br/><p>Xue Ling was a little unsatisfied, but he knew he couldn't go too far or else he would have to spend some time explaining this to Bai Hao later.</p><br/><p>His hypnosis and suggestions were most effective when the other side was not familiar with him. It gave the other side the feeling that they were not meeting for the first time, and that their first meeting must have been very amazing. The more positively a person felt about Xue Ling, the more willing they would be to follow his words.</p><br/><p>Bai Hao was obviously not included in this. He was very good towards Xue Ling even without any external factors.</p><br/><p></p><div><div></div></div><br/><p>After signing the contract, Xue Ling brought it with him and went downstairs. Since he had already made the trip, he might as well tell Bai Hao about it now so that his funds could be put into place more quickly. So he happily carried the contract with him and went to find Bai Hao, only to realize that he didn’t know which floor his office was on.</p><br/><p>Xue Ling silently went to the front desk to inquire which floor the president's office was situated on. Just as he was about to ask the system to make an appointment for himself, he heard Bai Hao's voice. \"Yueyue?\"</p><br/><p>Xue Ling shivered. Although he did not feel that he should be called by that kind of nickname, he still turned his head and looked at Bai Hao with some surprise. He blinked innocently. “Elder brother, what a coincidence…”</p><br/><p>Bai Hao came over and took his hand. “You came to the company to find me?\"</p><br/><p>The person at the front desk was startled. He had just wanted to say that it was impossible to see the president without an appointment, but the president himself had already pulled the youth to his side.</p><br/><p>Heavens, why did the president who always took the high-and-cold route have a smile on his face?</p><br/><p>Xue Ling brought up the hand that still held the contract, looking a little like he wanted to show off, and said, “I came to sign a contract with the company.”</p><br/><p>Bai Hao paused, and remembered the bet they had made. He looked over with some amusement as he led them towards the president's elevator. “Oh? What contract did you sign?\"</p><br/><p>Xue Ling’s footsteps hesitated, and he looked a little unhappy. “Only silver…”</p><br/><p>Although Bai Hao could tell by the tone of his voice just now that he must have won the bet, he did not expect that his younger brother would be strong enough to get a silver-grade contract. “Who did you sign under?” He didn’t ask about how Bai Yue had gotten the contract signed as the bet had been a way for him to tease his brother in the first place, and taking it too seriously was not his style. After all, this was something he had already promised to do.</p><br/><p>“Qi Ruishi.”</p><br/><p>Bai Hao nodded, pressed a button on the elevator, and called the assistant. “Have Qi Ruishi come to my office with a diamond level contract. Yes, I want her to sign with someone.” After hanging up, he rubbed Xue Ling’s head. “Now that you have won the bet, according to our agreement, elder brother will prepare the best of everything for you. We'll change the contract level to diamond, and arrange for a team to help you with production.”</p><br/><p>Xue Ling had not expected him to be so efficient and was still muddled as he was pulled towards the president's office. It wasn't until they exited the elevator that he came to his senses - he clearly hadn't bewitched Bai Hao; could it be that this man had a brother complex?</p><br/><p>Seeing that he had not spoken during the whole journey and had a face full of confusion, Bai Hao waved a hand in front of his face, trying to get his attention. “Yueyue?”</p><br/><p>Xue Ling blinked. \"Are you calling me?”</p><br/><p>Bai Hao nodded and said, “I heard them call you Little Yue last night.” Unspoken were the words 'I want to call you by a more intimate nickname than what others use'.</p><br/><p>Xue Ling gave Bai Hao a somewhat complicated look. Once again, he lamented that it was no wonder the original body lived such a tragic life—he had let go of such a big golden finger.</p><br/><p>In fact, Bai Hao was being so easy going because he was in a great mood. If it hadn't been that this morning, his secretary had showed him all of Bai Yue’s interpersonal relationships and major events during his years of studying abroad, allowing him to discover that his brother had never made randomly made friends, nor had he had any romantic or physical relationships with any men or women. If he did have a friend named Cole, Bai Hao might have still been in a black temper. His mood now was totally different from last night's depressed-to-death state. In addition to his joy, he was naturally more intimate with Xue Ling.</p><br/><p>Xue Ling had no idea regarding the twists and turns occurring in the other party's brain. Since he had already been brought up, he naturally sat on the sofa of the man’s office. And then he watched as a blank and confused Qi Ruishi came up and placed a new contract in front of him.</p><br/><p>Bai Hao’s original words were: “This is my brother, the second young master of Bai family. Sign a diamond level contract with him – the one you signed before can be regarded as a cover. You will be responsible for his development in the future. Directing is his main job. Right now, he needs to shoot a film for graduation and will probably need assistance with many aspects. I will have the leader of the team contact you.\"</p><br/><p>Qi Ruishi: “???”</p><br/><p>She understood all these words separately. Why was it so confusing when they were all connected together?</p><br/><p>The second young master was also a great man, able to walk through the back door so openly and honestly.</p><hr class=\"wp-block-separator\"/><br/><p><em>editors: alamerysl &amp; BlueBug</em></p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}