{"title": "Chapter 35", "id": 35, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-35", "volume_title": "Volume 1", "body": "<h1>Chapter 35</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>3.12 - Will you go out with me?</strong></p><br/><p>Director An’s recommendation was very successful. Xue Ling won the old director's favor and got the role of Tuoba Xiu. Because they had now found an actor to fill the role of the main character, the shooting schedule for the movie could begin.</p><br/><p>Xue Ling did not concern himself with the things that came after that. As far as he knew, the main investor of the play was White Light, and the primary reason the shooting had been put on hold was because the director had not been able to find a suitable actor for Tuoba Xiu. After Xue Ling returned home with the script in hand, he began to intensively study the male consort’s life, referencing many historical books, before finally waiting for the crew to start shooting.</p><br/><p>One morning, Xue Ling woke up earlier than usual and found a bouquet of red roses still stained with dew in the living room. Curious, he asked the housekeeper, “Housekeeper, where did these come from?”</p><br/><p>“It’s been a while. Every morning, people from the florist’s shop send it over.” The housekeeper pointed to the bouquet. “The young delivery man who sends the flowers over won't let me reject them. After bringing them in, the Young Master would dispose of it. It should be addressed to the Little Young Master.”</p><br/><p>Xue Ling blinked and turned over the bouquet. Sure enough, there was a card. The flowers were sent by Lin Yi, and the card was handwritten, though the writing should have been done by the florist.</p><br/><p>He found it a bit funny. “Does elder brother throw out these flowers every morning?\"</p><br/><p>“Yes. The Young Master directed me to bring it in, and then he would bring them away.\"</p><br/><p>Xue Ling was left speechless. Was that man so scared of him seeing these flowers?</p><br/><p>He put the flowers back intact and pretended he had never seen them. After breakfast, he asked the driver to take him to the company.</p><br/><p>Bai Hao stayed up late last night because of work, and woke up a bit later today. When he got up, he found that his brother’s room door was open and no one was there. His face changed, but when he went downstairs and saw the roses still in the living room, he relaxed.</p><br/><p>From the housekeeper, he learned that Xue Ling had already finished breakfast and went to the company. Bai Hao had no mind to eat breakfast. He changed his clothes, took the roses and left. After leaving the neighborhood, he left the roses in a garbage can outside.</p><br/><p>It was better if this kind of thing never appeared in front of his younger brother, so as not to dirty his eyes.</p><br/><p>Today, Xue Ling needed to go to White Light in order to have his costumes done and have photos taken of him as the male consort. Tomorrow, he would be joining the crew.</p><br/><p>He was the last actor, and he was probably the only one in the group that had not yet had his photos taken yet, so it was a bit rushed.</p><br/><p>This film told the story of Tuoba Xiu's life, so there were more costumes to try on, progressing from his youth and continuing on as he aged. So, the first costume that Xue Ling tried on was from the period when Tuoba Xiu was still a prince.</p><br/><p>At that time, the future male consort was still a prince from Xiye Country that was enemies with Tianlan Country. He had been in poor health from childhood and had survived countless assassination attempts. Even if it was a westernized country, the aura of treachery within the royal ranks would not change.</p><br/><p>He had always been patient, and later met a nobleman who brought him out of Xiye Country. He removed his surname, no longer using the word 'Tuoba'.</p><br/><p>Tuoba Xiu’s mother was a native from the Central Plains, and his position in Xiye Country was not low. Even though the noble implied that he wanted to help him get the throne, he refused and chose to leave Xiye Country.</p><br/><p>During this period, Tuoba Xiu was weak and thin, burdened with a sickly body. If it hadn’t been for the nobleman, he would have died under his brothers' malicious tricks long ago.</p><br/><p>Xue Ling was of mixed race, and his situation was somewhat similar to Tuoba Xiu's. In order to play the role well, he had recently been controlling his eating and drinking, and lost a lot of weight. Under the makeup artist's skills and with the help of the ancient garb and hairdress, he completely looked like a weak teenager who was about to die.</p><br/><p>The director was very satisfied with his choice, and the cameraman's eyes were bright as he took many photos in succession.</p><br/><p>Tuoba Xiu’s life was mainly divided into four parts. The first was the period when he was the prince; the second was when he went to the Central Plains for recuperation alone and came to be called the First Prince of the Jianhu by martial artists from the the Central Plains; the third covered the period when the emperor of Tianlan Country heard of his talent and he was appointed by the emperor as the prince's grand advisor. It was said that the man who introduced him was the famous male concubine of the Royal Palace at the time, and they seemed to have a good relationship; the fourth period was when he became the male consort. He was over ten years older than the prince, and had developed deep feelings for the emperor. The emperor also had great trust in him. Although he was the male consort, he was also given the position of prime minister and did a lot of good deeds for Tianlan Country and its later generations. History books were full of praise for him.</p><div><div></div></div><br/><p>The makeup and costumes for these four parts were all different. Xue Ling was tossed about all day long and really wanted to lie down, but was mocked by the system - who told him to be so lazy recently? Nobody will look after him after he leaves the house.</p><br/><p>He snorted coldly, packed up his things and went upstairs to find Bai Hao.</p><br/><p>When he finished his makeup and costume photos, it was just at the same time that Bai Hao was off work. Xue Ling had already made an appointment with Bai Hao, but he did not expect to see a beautiful woman in red in Bai Hao's office when he arrived upstairs. Looking closely, wasn't this Feng Cheng, the little flower of the entertainment circle who could stand side by side with White Light Entertainment?</p><br/><p>The system snorted from beside him: “Miss Feng was born into a family that has the same status as yours, and made a good reputation for herself in the entertainment circle based on her own ability. According to the original plot, this is your future sister-in-law.”</p><br/><p>Xue Ling's steps paused as he turned his head to ask the system with a smile: “What did you say just now?”</p><br/><p>“According to the original plot, she got married to Bai Hao. Both families were great clans, and after their marriage White Light Entertainment developed outside of China and enjoyed worldwide fame.” The system did not seem to notice his dark tone and explained very conscientiously.</p><br/><p>Xue Ling became really angry at this moment. How did he not know that there was such a thing in the plot before, and that Bai Hao could be considered as someone who was already taken? Then wasn't he effectively wrecking someone's marriage?</p><br/><p>Finally understanding what he was thinking, the system explained further: “Well look, you haven’t done anything yet, so it shouldn't count. And I've always felt that this Bai Hao was not quite right. He gives me a feeling similar to that of the previous general and Cole.”</p><br/><p>Xue Ling pouted. “Yes, they are all damned repressed men. Damn it. Other people attract overbearing presidents, but all I get are dull and sulky men who don't say anything even when they're about to die. It's not like they would really die if they said 'I like you'!!\"</p><br/><p>The system now knew where his grievances were coming from, and it chose to shut up and not look too deeply into its host's feelings. After all, its host had recently disdained him, and it would be bad if it spoke too much and he took his temper out on it.</p><br/><p>This situation put Xue Ling in a bad mood, and when he was in a bad mood he naturally would not let others feel good either. He had the system check what Sun Jianan was up to recently before deciding to give Lin Yi a call, asking him to come out to meet. He felt that it was necessary for him to have a good talk with this scum gong about the issue of sending flowers every morning.</p><br/><p>The system silently lit a candle for the clueless Bai Hao who was still in the conference room.</p><br/><p>After leaving a message with the secretary to let Bai Hao know that there was no need to wait for him when he came out, Xue Ling left the building. He had no intention to talk to Ms Feng Cheng, and even the secretary was curious about what had happened to make him look so unhappy.</p><br/><p>Sun Jianan understood Lin Yi’s character well, which was why he fought with the other party and moved out once he felt that the other party wanted to break up with him. He guessed that once he left, Lin Yi would begin to miss his good points. So although he was quick to leave, he made sure to make his existence known in front of Lin Yi from time to time. Lin Yi saw his act of pining and loving him and was moved - it had only been two days since their break up and he had already begun to buy things to try and coax Sun Jianan.</p><br/><p>Of course, even while he was coaxing Sun Jianan, he did not forget to send flowers every morning to Xue Ling in order to express his love.</p><br/><p>Men always treated their admirers with a softer heart. Lin Yi placated Sun Jianan so much that the next night they rolled back into bed together.</p><br/><p>When Xue Ling asked the system to check on the two of them, Lin Yi was still at home with Sun Jianan enjoying the other person's warmth. As soon as Xue Ling called him and asked Lin Yi to meet him, he could see through the system's monitoring screen that Sun Jianan's face immediately turned ugly, and he angrily threw a pillow.</p><br/><p>Xue Ling actually admired his stinginess. The man that he had just slept with last night was now called out by his real love, but Sun Jianan just threw a pillow that had been beside him and thumped his fists on the bedsheets.</p><div><div></div></div><br/><p>If it were him, he would make sure that the other party became impotent for life, and die without his body intact.</p><br/><p>Oh, his world views were too abnormal to be applied to modern society.</p><br/><p>Xue Ling met with Lin Yi at a coffee shop. He was sitting in screened position with sunglasses on his nose. Only the waiter looked at him in surprise, but he had only recently risen to fame and the waiter only felt that he was somewhat familiar but could not recognize him.</p><br/><p>Lin Yi took some time to arrive as he made a point to take a bath before coming out. He had hesitated to come out and see Xue Ling because of last night. He had clearly decided to leave Sun Jianan and pursue Bai Yue, but Sun Jianan was so good to him that he could not bear to hurt him and he had carelessly become fascinated by him again in a moment of inattention. This made him feel guilty towards Bai Yue.</p><br/><p>“Little Yue.” Putting down his briefcase, Lin Yi was somewhat embarrassed as he said, “I had to deal with some company matters. I'm sorry I'm late.\"</p><br/><p>Xue Ling shook his head to express that it didn't matter and pointed to the cup of coffee in front of him. \"It's only a cup of coffee that turned cold. You can just order another cup.”</p><br/><p>Looking at the coffee in front of him, Lin Yi’s strange mood improved. In his opinion, Xue Ling being willing to order coffee for him meant that he was interested in him. Were the roses that he sent every day useful?</p><br/><p>“That’s all right. Since you ordered it, I'll drink it.”</p><br/><p>Xue Ling didn’t respond to his words. After all, they were weird and disgusting.</p><br/><p>“Did Little Yue want to see me for a reason?” Lin Yi tried to control his laughter so that it didn't come off as too flattering. He always unconsciously laughed too much in front of the person that he has been thinking about for so long. It made others feel that he was foolish.</p><br/><p>“Well, I saw your roses this morning.” Xue Ling took a sip of his own juice and said lazily, “I’m sorry that I only saw them now. My elder brother has probably thrown away anything sent before. He is not very willing to see me make friends with rough or messy people.\"</p><br/><p>“Er…” Lin Yi was somewhat surprised. “Big brother Bai seems to be a bit strict with you.”</p><br/><p>Xue Ling sneered and said, “He is. He didn't ask about me for ten years, but he started managing much more once I returned back to the country.” He knew that Bai Hao had people following him. He spoke these words especially for them to hear, and it would be best if they even passed it on to Bai Hao. He claimed that the people were there to protect him, but who didn't know that that damned repressed man had asked them to sneakily take photos of him every day? Could he be any more perverted?</p><br/><p>Lin Yi coughed. “Why don’t you move out then, Little Yue? I might not have anything else, but I still have many houses in Hai City. Where would you like to live? I’ll find a place for you.\"</p><br/><p>Xue Ling shook his head. “I’m going to join the production crew soon, there's no rush. Right, let's go back to the talk about roses.\"</p><br/><p>The expression on Lin Yi’s face turned momentarily stiff before it finally seemed as though he had made up his mind. He opened his mouth to say, \"Little Yue, like what I wrote on my card, I like you, and I want to pursue you. I fell in love with you from the first time I saw you. At that time, you didn’t like to talk, and didn't like to participate in group activities, and the only person who could talk to you in class was me. You didn’t know how happy I was - it was like you were mine alone. When my father asked me to return home, I fought with him, but he threatened me and I had no choice but to return home. I wanted to hide this love in my heart, but you also came back and have no plans to leave, wanting to stay at home and develop your career. Little Yue, will you give me a chance, and also give yourself a chance, and go out with me?\"</p><br/><p>Xue Ling's lips curved as he looked at him from head to tail with great interest. From head to toe, it seemed as though his gaze was stripping off his clothes and evaluating his skin inch by inch. His beautiful pale brown eyes narrowed slightly, and Lin Yi was very excited. If he had a whip in hand, perhaps he really would have asked Xue Ling to whip him right then and there.</p><br/><p>His lips opened and closed, but the word he spoke was cold and heartless, just like a basin of cold water being poured over him from top to bottom, completely extinguishing Lin Yi's boiling mood.</p><br/><p>“No.”</p><hr class=\"wp-block-separator\"/><br/><p><em>editors: alamerysl &amp; BlueBug</em></p><br/><p><em>did anyone else cackle like a crazy person when Xue Ling rejected Lin Yi? i know alamerysl definitely lost it~ </em></p><br/><p><em>also, the good stuff is happening soon! (♡´`)</em></p><br/><p></p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}