{"title": "Chapter 52", "id": 52, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-52", "volume_title": "Volume 1", "body": "<h1>Chapter 52</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>4.13 – Destroy him! Destroy the person in front of him!</strong></p><br/><p>But it was only for a moment. Luther calmed down quickly. Although he had not watched Ashley grow up from childhood, he still understood him. For him to arrange such a situation, did it mean that he had discovered something, and wanted to be on the offensive and ask first?</p><br/><p>He was about to open his mouth when he saw the youth looking sideways at Russell, who was standing behind him.</p><br/><p>Luther put out his hand to protect Russell, his face full of vigilance as he looked at Xue Ling.</p><br/><p>Xue Ling curved his lips and said, “Your Highness need not be so nervous. I won't do anything to the person behind you.\"</p><br/><p>Such a calm remark made Luther even more uneasy, because he was very clear about Ashley's dedication to the title of Queen. Normally, even if he knew something, for the sake of the royal family's face, he would not purposely air it out here.</p><br/><p>To be honest, the Xue Ling now really did not care about the royal family's face. What he cared about was that if this man continued to hog his current position, he could not give his own lover a title. Not only was Augustine persistent about this matter, in reality Xue Ling was also persistent.</p><br/><p>However, he had his own principles. He wanted His Highness the Prince to know how it felt to be criticized by millions of people.</p><br/><p>That was what Ashley had originally been made to suffer.</p><br/><p>The voices of people cheering gradually faded away. They had originally been cheering spontaneously for the young royal couple that had been separated after their wedding by an accident, but unexpectedly, there seemed to be some tension on the scene.</p><br/><p>To be exact, His Highness the Prince seemed to have his sword drawn.</p><br/><p>“Is the person that you're protecting behind you Russell Johnson?\" Xue Ling waved to Russell. This protagonist shou that had not yet grown up was a little naïve, and even showed a silly smile on his face that he couldn't seem to control when he was faced with Xue Ling's smile.</p><br/><p>Xue Ling sneered from the bottom of his heart.</p><br/><p>Even if he was more innocent and simple now, sooner or later he would be dyed black by the capital star. Back then, it had been Russell who brought up the idea of having others rape him and film it in order to obtain a divorce. The Prince originally preferred to have the Princess die a sudden death.</p><br/><p>“What are you trying to do?” Luther's gaze was a little dangerous.</p><br/><p>“I'm not trying to do anything. I just want to divorce you before you bring this person into the palace.” The smile faded from Xue Ling’s face. He opened his nano-computer and sent another piece of information to Luther. “And help you and your true love achieve your goal.\"</p><br/><p>There was an uproar at the scene.</p><br/><p>Before today, His Royal Highness the Princess’s unwavering belief in the Prince had been praised across all the stars. But now, such a person had requested a divorce in front of the public as soon as His Highness the Prince had returned.</p><br/><p>What did he say?</p><br/><p>His Highness the Prince's true love?</p><br/><p>“Luther.” Xue Ling ignored the ugly expression on Luther's face and spoke lightly. “I can pretend to be strong when you leave the capital star for the front lines without even seeing me on our wedding night, and only release the news a few days later in order stabilize the people’s hearts. I can train to pilot a mecha for half a month after you go missing on the front lines, go in your stead to fight against the Zerg waves, and struggle against thousands of Zerg without any complaint. But Luther, these things are based on the premise that I am your Princess, your nominal wife and your only partner for the rest of your life.\"</p><br/><p>“What's funny is that you disappeared for almost two months, and brought me back an omega that you have marked.” Xue Ling's face turned cold, and his smile disappeared. His gaze was poisonous as he looked at Luther and Russell, as though full of hatred for both of them.</p><br/><p>The return of His Highness the Prince was broadcast live across the stars via the Star Web. The number of people watching the live broadcast just increased sharply. All of them could see it very clearly as their Princess, that young man who was bright and dazzling to the point where they were all enthralled, who had previously sworn to believe that his husband would come back, was obviously showing an indifferent face, but within his eyes, there was a faint shimmer of tears.</p><br/><p>His remarks were full of irony, but from his eyes, one could see unstoppable sorrow.</p><br/><p>Some people felt their hearts go out to him, and their gazes carried anger and indignation when they looked at His Highness the Prince and the young man standing beside him.</p><br/><p>“I, Ashley, have the Rhine family's pride. I will not fight with him for you, so let's divorce.\"</p><br/><p>Luther narrowed his eyes. \"Do you know what you're saying?\"</p><div><div></div></div><br/><p>“I know.” Xue Ling raised his hand and said, “How his heat came about, how you marked him, I have videos of it all. Do you need me to bring them out for everyone to see?\"</p><br/><p>Luther's heart skipped a beat. He felt that there was definitely something in this situation that he had not grasped. He looked sideways at Russell and doubts rose in his mind.</p><br/><p>“I don’t know which kind-hearted person it was who sent it over without trying to conceal anything. I was by Father-King's side at the time, so Father-King has also seen it.\" Xue Ling sneered. “Luther, let’s divorce. You already have an omega, and it's not good for me to hold onto that person's position. Now, I'll give it back to you.”</p><br/><p>“…” The situation now was too uncertain, and Luther did not even know what the people who were around them now had come for. He somewhat irritably looked at his personal guard. Back then when he asked for an update on the current situation, those reports had never mentioned what Ashley was talking about now!</p><br/><p>Luther now felt as though he was being toyed with by everyone. He even began to wonder where Russell had come from. Did he really not know about his identity and only simply wanted to take care of him?</p><br/><p>Of course, this idea only existed in his mind for a moment before he decisively kicked it out. He had been with Russell for some time, and he still believed in him. In that case, everything that was happening here could only be Ashley's handiwork.\"</p><br/><p>With this in mind, Luther's murderous aura rose up. “I won’t rashly agree to a divorce here without understanding the situation here first.\"</p><br/><p>Xue Ling also knew that according to his personality, he would absolutely not allow anything that was not within his own plans to proceed, so he didn't say much. In any case, what he wanted was for the people know that His Highness the Prince had returned, and had brought back an omega that he had already marked. Everyone now recognized Russell's face, and it ensured that he would not be able to mix well in the capital star.</p><br/><p>So, he pressed his lips together, gave Luther a deep look, and then turned to leave.</p><br/><p>It was only then that Luther noticed that he was followed by several people he had never seen before. They did not seem to be from the Rhine family, and were even less likely to be people from the royal family.</p><br/><p>From around them came the sounds of people discussing the controversial news. Luther escorted Russell and quickly left the airport. These scenes were all broadcast live on the Star Net, and even before Xue Ling had returned to the imperial palace, the topic of His Highness the Prince's extramarital affair had already made it to the news headlines.</p><br/><p>The network was full of people's criticism, and Luther's reputation had fallen to a miraculous new low.</p><br/><p>After all, he was a person who had disappeared for more than two months. Compared with Xue Ling, who had been garnering goodwill during this period, the vast majority of people would be on Xue Ling's side.</p><br/><p>Listening to His Royal Highness the Princess, it seemed that the Prince left him on their wedding night. The Princess was still underage, and obviously nothing had happened between them. But His Highness had now marked another omega that came out of nowhere. That counted as cheating.</p><br/><p>It was not wrong for the Princess to want a divorce!</p><br/><p>Everyone no longer addressed the Prince as His Highness the Prince. As long as he was mentioned, they referred to him as that scum man.</p><br/><p>Xue Ling flipped through the comments and felt all kinds of amusement as he read them. Meanwhile, Augustine frowned at him, “He's not willing to divorce?\"</p><br/><p>Xue Ling waved his hand, “It no longer matters now whether he's willing or not. This divorce is already confirmed, and he can't keep his position as Prince anymore. You should get ready. Soon you'll be officially making an appearance in front of the whole universe.\"</p><br/><p>“Oh?” Augustine squinted and asked, “With what identity?”</p><br/><p>Xue Ling glanced at him and spoke disdainfully: “What kind of identity do you want?”</p><br/><p>Augustine gave a low laugh, “Well, the identity of the Princess’s current boyfriend.”</p><br/><p>Xue Ling kicked him and said, “Go away. If you are not the Emperor, don’t think that I'll agree to marry you.” Although the idea of getting married was somewhat shocking, if it was with this man, then Xue Ling unexpectedly found that he didn't mind.</p><br/><p>Augustine looked a little strange. He held Xue Ling’s hand and queried softly, “You wouldn't marry me if I wasn't the Emperor?\"</p><br/><p>Xue Ling saw his expression, raised his chin proudly, and jokingly said, “You should know, I am someone who was born to be an Empress.~\"</p><br/><p>When Augustine met his gaze, the violence that had just arisen in his heart was suddenly suppressed. Even if he was only with him because he wanted to be Empress, so what? This person was already his, let alone his heart.</p><div><div></div></div><br/><p>The person that he wanted, absolutely had to be his from their body to their heart, from inside to outside. All of it had to be his.</p><br/><p>He laughed a little recklessly. “That's perfect then. I was born an Emperor.”</p><br/><p>Xue Ling kicked him again, with the intent of denouncing his shamelessness. Afterwards, when he thought about it, it seemed that everyone's settings in this world were somewhat juvenile…</p><br/><p>It was not recommended for the man's middle school sickness to become too serious, to the point where it would soon become cancerous.</p><br/><p>After what had happened, His Highness the Prince did not go straight to the palace upon his return to the capital star. Rather, he first set up a residence for Russell, and then arranged guards for him, cuddling him intimately as he spoke some words of advice before finally making preparations to enter the palace.</p><br/><p>By this time, it was already dark. The dinner that should have been held to celebrate the return of His Highness the Prince had been cancelled due to the venting of the Princess.</p><br/><p>Xue Ling hold up in his room and answered multiple phone calls. Warren, his parents, and even his grandparents took turns giving him advice, and only after he had stressed countless times that he did not like the Prince, was he finally allowed to stay in the palace and not directly ordered back to the Rhine family.</p><br/><p>The imperial palace was already nothing like the one the Prince had left behind. All the important positions had been filled by Augustine's people. They were the people who built the palace, and functions that had not been discovered before were all activated now. Not only did the level of defense increase, many secret passages were now also in use.</p><br/><p>As soon as Xue Ling had finished bathing, someone reported that His Highness the Prince had returned.</p><br/><p>He tied up his bathrobe and narrowed his eyes. “What does he want…”</p><br/><p>“Should I have him go back?” Xue Ling’s servants had all been replaced by his and Augustine's people, so it was absolutely feasible to do as he had said and sweep His Highness the Prince out of the house. After all, the palace was now their territory.</p><br/><p>“No need.” Xue Ling was rather curious about why this man had come to the palace this late at night. With his perception ability, it was impossible for him not to discover that the palace was no longer under his control. “Let him wait. I’ll get changed and go see him.”</p><br/><p>To enter a place that was not under his control, was it that Luther was too confident in himself, or did his IQ follow his loss of memory and disappear into the wind?</p><br/><p>Or, did he not even realize who the enemy he was facing was?</p><br/><p>Xue Ling thought that his last guess was the right one. He changed slowly into casual clothes, and then went to see Luther. Fortunately, due to Luther's return today, Augustine had been driven back to his underground palace to sleep by him. Otherwise, he didn't know what kind of fuss would be stirred up.</p><br/><p>Luther sat in the outer hall with a black expression and thought that Ashley's guts had grown to cover the sky. This was clearly his palace, but Ashley was making him wait here. Ha-ha. He was still playing the role of Princess at this time, he was really too much.</p><br/><p>Xue Ling did not make him wait long, and soon came out.</p><br/><p>Seeing that His Royal Highness was wearing his regular state clothing, Ashley raised his eyebrows and laughed. \"Did Your Highness come late at night to have me move out of your palace?\"</p><br/><p>Luther looked over coldly, but found himself facing a young man who was as dazzling as a god.</p><br/><p>During the day, when he had been wearing a military uniform, Luther had been full of vigilance against him. Now, he had changed into the most common casual clothing, wearing very simple and comfortable clothes. His face was slightly reddened from his recent bath, and when he laughed, there was a type of unique charm.</p><br/><p>Perhaps because he had abhorred him for so long, Luther has forgotten that this Princess of his was the most beautiful person in the universe.</p><br/><p>And soon, his heat would come.</p><br/><p>Such a person should have been his.</p><br/><p>But, he didn't want him.</p><br/><p>The things that he didn't want, were also not allowed to be given to others.</p><br/><p>Looking at the person in front of him, a crazy voice sounded in Luther's mind.</p><br/><p>Destroy him! Destroy the person in front of him!</p><hr class=\"wp-block-separator\"/><br/><p><em>editors: alamerysl &amp; BlueBug</em></p><br/><p>we’re officially 1/4 of the way through WTMT!</p><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}