{"title": "Chapter 57", "id": 57, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-57", "volume_title": "Volume 1", "body": "<h1>Chapter 57</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>5.1 – He. already. has. someone. he. likes? </strong></p><br/><p>She was born beautiful. Her eyebrows were pulled together into a small frown, her eyes slightly uplifted as she looked at him placidly. Her red lips parted, and she said to him, “If you have finished, then go away.”</p><br/><p>Zhan Shaoxi was confused at first, but then his expression turned ugly.</p><br/><p>He had just been told to get lost on his own wedding night by his new wife. Even if it was the distinguished Royal Princess, Zhan Shaoxi would not let her off easily.</p><br/><p>“Since you also know that this Princess married you in order to provide a check and balance, you should know that this Princess does not need you to teach me how to behave.” She looked over at him coldly, and once again repeated herself, \"So, if you have finished, go away.\"</p><br/><p>Zhan Shaoxi sneered, finding Her Highness the Princess quite amusing. \"Your Highness is asking me to leave my own wedding room on the wedding night?\"</p><br/><p>Her Highness still looked at him with an indifferent expression. After staring at him for a few seconds, she rose slowly. “If you don’t go, I will.”</p><br/><p>She was dressed in a bright red wedding dress, and even an exceptional painter would not be able to capture her beauty at this moment. The headdress was thrown directly onto the ground, and those eyes which seemed to be out of tune with the world landed on the figure of Zhan Shaoxi. </p><br/><p>However, Zhan Shaoxi only felt an unprecedented coldness in his heart. He had blocked the Princess' way out of the room, but with one glance, he felt frozen and subconsciously stepped sideways to give way as the other party passed by.</p><br/><p>Xue Ling opened the door. The guards and maidservants saw him come out in his wedding dress and had just began to show their surprise when they heard his pleasant voice, cool and clear as he spoke. “Have people tidy up the courtyard farthest away from here. I am going over there to live.\"</p><br/><p>The guards and maidservants all stared at each other. They did not dare to move at all without the General's command.</p><br/><p>Then, they saw the General appear behind the Princess with a dark expression. He spoke in a tone that made the guards and maidservants shiver unconsciously, and only the Princess in front of him was completely unaffected. “You go back, I’ll leave.” He said.</p><br/><p>Xue Ling was not polite with him either. In any case, only one person could stay in this room tonight, and he was in a bad mood now. So, he turned around and tugged on the man’s clothes with one hand. Under the general’s perplexed gaze, Xue Ling pushed him to the door, lifted his foot, and kicked the General out.</p><br/><p>With a 'pa' sound, the door was snapped shut and locked.</p><br/><p>The maidservants who witnessed the whole scene were so frightened that they dared not make a sound. When they saw the General slowly pulling himself up off the floor, they quickly bowed their heads and knelt down. They dared not look at the General's ugly expression.</p><br/><p>“I hope that nobody will find out about tonight's events.” The great General was emitting a cold aura from all over his body, and everyone could only nod quickly to show that they would never speak a word.</p><br/><p>Zhan Shaoxi stood at the door and stared at the room for a long time. It was only when the lights went out that he sneered coldly and turned away.</p><br/><p>Xue Ling had no intention of concerning himself with his mood. The first thing he did after he closed the door was to reach down and confirm his gender. After confirming that he was still male, he let out a long breath and pulled off the jewelry on his head.</p><br/><p>He did not care how painful it was; he was irritated, and he was in a terrible mood.</p><br/><p>The system finally made its appearance and huddled at the foot of the table. It looked at its angry host and did not dare to say a single word.</p><br/><p>Xue Ling tossed the jewelry to one side, pulled off the cumbersome wedding dress and instantly felt lighter. He then jumped onto bed and ordered the system to get the hell over and tell him everything clearly.</p><br/><p>The system flinched its way over, blinked and tried to act cute and garner sympathy from Xue Ling. Only after its host reached out and grabbed its fur did the system cry out bitterly to Xue Ling. \"Host, you need to get used to waking up to all kinds of bad situations! It's not like you can transmigrate into a completely safe point in time every time…\"</p><br/><p>Xue Ling glanced at it coldly, and completely did not mention that what he actually cared about were the bloody bodies the system picked out for him.</p><br/><p>He whispered to himself, what was this, a man dressed as a woman, and a Royal Princess at that? And married? Who were they trying to toy with?</p><br/><p>“Give me the plot.” He didn't know when the General that he'd just kicked out would kill his way back, and he had better learn the plot first. He also wasn't sure if his actions based on what the opposite party had said had been correct or not. Hopefully he hadn't made a fool out of himself because of the system's damned set ups.</p><br/><p>The system did not dare to say anything else. It was horribly afraid that the fur on its tail would be harmed again, and did not even have the guts to say anything about a certain man in case its host became even more angry and took it out on him. Hearing that Xue Ling wanted the plot, it quickly passed it on.</p><br/><p>Xue Ling was already accustomed to being stuffed with a lot of information all at once, but the plot this time really made Xue Ling want to kill someone for an instant.</p><br/><p>Hadn't the system said that he could rest in this world and cultivate? With this wretched world's settings, it would already be great if he didn't have to run all around the world chasing after the female protagonist. Cultivate? Ha-ha.</p><br/><p>This was an impractical world, categorized as romance. There were a total of seven men, and one woman.</p><br/><p>Well, it wasn’t Snow White and the Seven Dwarfs. This world's female protagonist really got together with seven men. These people’s identities were each stronger than the next, but each and every one of them was completely and irrevocably in love with the female main character and were willing to share her equally with the others.</p><br/><p>The female protagonist transmigrated into this world, and she had been an assassin in her past life…</p><br/><p>Xue Ling rubbed his chin and expressed his admiration for such a love story.</p><br/><p>After transmigrating, she became Princess Mingyue of the Gongqin Prince's Palace, and her name was Wenren Yingyue. This should have been a very good identity, but in fact, regardless of which Imperial Palace it was, the situation in Capital was very bad. The head of the Palace was no longer there, and the Prince's Palace was filled with his female relatives. Even if her title was higher or bigger, it was still useless. This Wenren Yingyue had been drowned in the water by a young lady’s maid, and this Princess' status could hardly be lower.</p><br/><p>The Emperor was middle-aged, and he had begun to think of kinship and familial affection. However, there was no one who had not been young once. When he had won his throne back then, the royal family suffered terrible deaths and injuries. None of the Princes who fought against the Emperor remained. Prince Gongqin of the Gongqin Prince’s Palace had been one of them, and he already died more than a decade ago. Wenren Yingyue was his first and only daughter.</p><br/><p>The Gongqin Prince's situation could still be considered fairly good. There were some Imperial Palaces that didn't even have a daughter, and only the Princess Consort remained. Those had already declined to the point of nearly disappearing.</p><br/><p>It was not uncommon for the Imperial family to fight each other for the supreme position of Emperor. It has been a long time since the last battle to seize the throne was over, and now it was time for the Emperor’s sons to fight again.</p><br/><p>When the heroine arrived, the storm in the capital was just about to arrive. Her arrival made the muddy waters even more chaotic, and when the wind and clouds changed, she lived up to the fate that had been foretold to her upon birth: She was doomed to bring disaster to the three countries.</p><br/><p>The body that Xue Ling had taken over did not have much connection with the Princess. He was only a small cannon fodder on the path to the heroine's rise, and didn't even qualify to be tripped over. Even if he was thrown into the water, he wouldn't even make a ripple.</p><br/><p>Wenren Hong was related by blood to the former Emperor, and was the Emperor's most favored Royal Princess. He was a few years younger than the eldest Princess, but was born as the Emperor's little sister, and became an existence even nobler than the former Empress.</p><br/><p>The year that he was born was the year that the Emperor had been fighting for the throne. He was born to the former Emperor in his latter years, and he had been loved by the Emperor even when he was still in his royal mother’s stomach. If his gender had been exposed, he would inevitably have been knifed by those imperial Princes. So, his mother killed all the people who knew the truth and hid his gender.</p><br/><p>Even though the person who came to power later was his full-blooded brother, the Empress Dowager still did not speak of this to anyone. For the sake of her youngest son, she kept the secret and took it with her to the grave.</p><br/><p>Wenren Hong was raised as a Princess from birth. Although he was always spoiled because he was the Emperor's only sister, his temperament was extremely indifferent. In order to keep his secret, he had little contact with others and seldom opened his mouth to speak. The Emperor loved his quiet nature most, and always praised him for being a great lady. When he reached the age of fifteen, the Emperor promised the Royal Princess to the General of the Zhenguo General's Manor, Zhan Shaoxi.</p><br/><p>Zhan Shaoxi was the person that Xue Ling had met just now.</p><br/><p>In this world, if a man was tall and good-looking, he would definitely be a protagonist. That meant that this Zhao Shanxi was also one of the protagonists. Thinking of what he had just said about already having a person that he liked, that person should be the female protagonist that had transmigrated over not long ago and was currently still struggling to make a livelihood over at the Gongqin Prince's Palace.</p><br/><p>According to the plot, Zhan Shaoxi was the third male in this story, and took on the role of expanding territory for the female protagonist and leading soldiers to fight for them.</p><br/><p>Xue Ling went over the plot again and found that Zhan Shaoxi had something to do with Wenren Hong’s death.</p><br/><p>Wenren Hong was a man, and had no way to engage in bedroom activities with Zhan Shaoxi at all. The words that Zhan Shaoxi spoke to him on the wedding night matched his own thoughts, and so he quietly lowered his sense of existence and pretended that he didn't exist. He hoped that one day he could cast off the General's Manor and the Imperial family, then leave the country and live like wild stock or floating clouds, go where he wished, and live the life that he wanted.</p><br/><p>It was such a simple desire, but it could never be realized.</p><br/><p>He thought that nothing would happen to him as long as he obediently stayed in the General's Manor and did nothing at all, but the phrase 'disaster will still strike from heaven even if nothing was done at home' never deceived anyone. Wenren Yingyue herself could even embrace men left and right, but she did not allow any of her men to have another woman. It was unacceptable even if it was someone who they had never touched and was placed at home as a decorative wife.</p><br/><p>Therefore, the great Princess purposely made trouble for Wenren Hong several times, but the other party calmly and indifferently ignored it all.</p><br/><p>Having suffered a setback, Wenren Yingyue would naturally take her grievances and blame it on Zhan Shaoxi. Zhan Shaoxi was already suffering from the handicap of having a wife of his own when compared to the other suitors, and when he was told off by his beloved, of course he would want to take his temper out on someone. He angrily burst into Wenren Hong's room and unexpectedly discovered that the Royal Princess was a man.</p><br/><p>Everything that came after that was incredible.</p><br/><p>Wenren Hong wanted to have a proper discussion with him to try and see if he could cooperate with him to let him leave under the guise of a fake death. But he had never thought that Zhan Shaoxi would tell the heroine about it when he drank too much. The timing was perfect as His Highness the Crown Prince no longer wanted to wait to ascend the throne. He gave the Emperor a drug that required him to be stimulated in order to be effective. This was a good opportunity, and the heroine exposed this matter.</p><br/><p>Wenren Hong did not have time to do anything before he was sent to prison. The Emperor was so angry that he vomited blood, became seriously injured and fell into a coma. The Crown Prince took the opportunity to take power and directly sentenced him to death under the crime of fraud. The Emperor heard the news when he woke up, vomited blood again, and then passed away.</p><br/><p>Xue Ling no longer knew how he should criticize this plot by this point.</p><br/><p>He rolled his eyes, put aside this disgusting plot, touched his chin and stared at the system. “So, I’m still under age now? And already married?\" Why did he always appear on the wedding night? Last time ,His Highness the Prince left before he even reached the bed. This time, his 'husband' was kicked out.</p><br/><p>Women in ancient times could be married at fifteen. Compared to his previous body that had nearly reached adulthood, right now he was really a little lolita… He casually found a bronze mirror in the room and was quiet for a moment when he looked at the beautiful person reflected within. \"So young and tender… if Zhan Shaoxi really dares to make a move, I'll really have to kill him.\"</p><br/><p>The system quivered and silently hugged its tail.</p><br/><p>“The heroine is set up to go straight to heaven. How do you want me to stop her?” Even if this body's stats were adjusted to the best possible conditions, he was still only one person, with nobody he could make use of. He even had to hide his identity and pretend to be a 'General's wife'.</p><br/><p>If it hadn't been that based on the plot, Zhan Shaoxi was unlikely to touch him, he probably would've picked up a sword and run over to cut his so-called husband in half by now.</p><br/><p>“At this time, the heroine has just transmigrated.” The system huddled pitifully in the corner and tried to point out that they had arrived at a good time. “She has just met the Crown Prince and the General, and although she left them with a wonderful impression of her, their relationships have not yet developed into that of lovers. She hasn't found male puppy number four yet, and the second one doesn't know her either… Host can take this opportunity to snatch all her men.”</p><br/><p>Xue Ling sneered and asked the system, “What did you say?”</p><br/><p>The system shook its head and said, “I didn’t say anything, absolutely did not suggest that host should try and use a honey trap!\"</p><br/><p>Xue Ling snorted coldly. Although he spoke as though he had no way to take down the heroine, it was as the system said. The female protagonist had not yet taken down any of her men yet, and compared to later on when she would be surrounded by people, it was still a simple matter to deal with her now.</p><br/><p>He felt a bit of pressure in this world because there were quite a lot of protagonists and he needed to make sure the heroine did not end up in a relationship with any of them in order to change their fates. But with his current identity where he couldn't even leave the General's Manor, how could he follow the heroine closely?</p><br/><p>Or should he first change his identity by pretending to die?</p><br/><p>“By the way, host…” The system felt that some things should be clarified as soon as possible so that its host's plans would not become totally ruined when he finds out later. At that point, all his fur would be pulled out QAQ.</p><br/><p>“Yes?”</p><br/><p>“There's also news about your man…”</p><br/><p>Xue Ling raised his eyebrows. There were many male protagonists in this world, and he felt that his man should be amongst them, but he didn't know which one. Now that the system was acting like this, did it mean that he now had the ability to detect him?</p><br/><p>No, it was just that it wanted to hide every time it encountered him.</p><br/><p>“In this world, he is that husband of yours…” The little fox shrank its neck and watched as its great host's face gradually darkened. It trembled and added, \"The Zhenguo General, Zhan Shaoxi.\"</p><br/><p>The barren room was quiet for a long time, and it wasn't until the system had almost turned itself into a small round ball that it heard its great host's laughter.</p><br/><p>“Oh, good~ He. already. has. someone. he. likes?\" The youth that had his head lowered had a beautiful smile on his face, and his voice was very pleasant, but it made the system absolutely terrified.</p><br/><p>Wuwuwu, was its host blackening?!</p><hr class=\"wp-block-separator\"/><br/><p>editors: alamerysl &amp; BlueBug</p><br/><p>alamerysl: YAY ONE (1) DICK STILL PRESENT!</p><br/><p>xiin: i feel a bit bad for the ML. this plotline is on crack o.o</p><hr class=\"wp-block-separator\"/><span class=\"wpa-about\"></span><br/>\n</div>"}