{"title": "Chapter 60", "id": 60, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-60", "volume_title": "Volume 1", "body": "<h1>Chapter 60</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>5.4 – Inexplicably turned on the ability to show affection</strong></p><br/><p>On the third day after the wedding, Zhan Shaoxi had already arrived outside Xue Ling’s courtyard before the sky started to brighten. He frowned in surprise upon learning that she had already begun to get ready.</p><br/><p>Today was the day the Royal Princess returned home to give thanks. According to Zhan Shaoxi's understanding of Xue Ling, asking her to wake up early was akin to asking for her life, so Zhan Shaoxi plotted to try and to enter her room today. Even if the other party was angry, he could push it off as being for her own good, because she could not return to the Imperial Palace at the wrong time.</p><br/><p>But although he planned well, Xue Ling woke up early. Since today was the day he had to return to visit his family, he could not dress up as simply as the past few days. So, he had been pestered by the system to wake up early in the morning in order to get ready, and by now, he was almost done.</p><br/><p>He had to wait until the Emperor finished with his morning court in order to see him, so Xue Ling could have chosen to wait until the court was adjourned before entering the palace, but the General disagreed and insisted that they go together. His reasoning was that regardless of how they were at home, they could not be perceived as having any internal discord when outside.</p><br/><p>Xue Ling stared at him for a long time, until he was almost unable to hold onto his facial expression before nodding his head to agree.</p><br/><p>Didn't he just want to be together with him? He could fulfill that wish for him.</p><br/><p>Xue Ling narrowed his eyes. As for the disagreements between them, even if nobody within the residence spoke about it, there would still be others spreading it for them. According to the things that the people Xue Ling sent out to explore discovered over these past two days, the heroine was not as bright and impartial, and unwilling to make a move in the dark as the original script had portrayed her to be.</p><br/><p>Once a woman had the intention of winning over someone, there were always things she could do in order to create some momentum for herself.</p><br/><p>Early morning, the Zhenguo General's carriage steadily crossed over the moat bridge. The General had forsaken his usual tall and strong horse today, and was seated in the carriage beside the Royal Princess. It was only when they had to part that he reluctantly got off the carriage.</p><br/><p>This scene was seen by many prominent figures in the court. Some of them covered their mouths and laughed, thinking that the General’s previous reluctance had vanished in face of his wife's gentle embrace. This display of affection was so obvious that it made others' eyes darken, and it was unclear what they were thinking. Regardless, it would not be good things.</p><br/><p>Nobody had any clue that the General's expression of reluctance was actually an act. In fact, he had been chased down by the person in the carriage, but he was indeed reluctant, wanting spend more time looking at her. Unfortunately, that person disagreed, and had never given him any positive expressions.</p><br/><p>He had already been stunned by her looks once on their wedding day, but the situation at that time had been really strange, and his emotions had been all over the place, so he could not appreciate her beauty back then. On normal days, Zhan Shaoxi also felt that her elegant and simple appearance was excessively good looking, and now that he saw Xue Ling with exquisite makeup on once again, he only felt more and more that his heart no longer belonged to him. His thoughts from previous years about not wanting to trust and refusing to have anything to do with royalty, were all tossed somewhere and fed to the dogs. His entire heart was filled with the desire to please her.</p><br/><p>But whenever he opened his mouth or made any movement, that person would always toss an indifferent glance in his direction. He would immediately recall what he had said on their wedding night, and his entire body would seem to be out of his control and refuse to move.</p><br/><p>The more he thought about his words, the more anxious and guilty he felt. When he looked at the Royal Princess, he found it harder and harder to put his dignity aside and tell her to pretend those words had never been said.</p><br/><p>Even if he said that, the other party probably wouldn't even care.</p><br/><p>After all, she had no interest in him.</p><br/><p>Zhan Shaoxi looked on helplessly as his own carriage slowly made its way into the back palace before lowering his gaze and putting his emotions away. When he turned, he was once again the Zhenguo General who was born into a military family and had amazing momentum.</p><br/><p>Xue Ling sat in the carriage and rested his cheek against his hand. As the carriage swayed, making the tassels on his head dance, he was thinking about how to deal with the Emperor and Empress. The original owner of this body did not like to speak much, and was normally well behaved and sensible, able to sit complacently and quietly in place for long stretches of time. This was not difficult to do, but after sitting down all morning, Xue Ling felt that he would be impatient.</p><div><div></div></div><br/><p>They absolutely could not allow the Empress to invite them for lunch. Xue Ling would most likely end up suffering from indigestion.</p><br/><p>He was a very selfish and prideful person, and the most unpleasant thing was having to yield to others. If it hadn't been too troublesome to usurp the throne, he would definitely seize the Emperor's position, marry the heroine into the palace, and then imprison her in the palace to suffer a lifetime of loneliness.</p><br/><p>See, how simple, rough and effective.</p><br/><p>Unfortunately, the system always picked these bloody weak bodies, and he would definitely be considered OOC if he did things that way. It was possible he'd be discovered by the world's consciousness in the next second and directly get kicked out of the world.</p><br/><p>As the Royal Princess, he went to see the Empress after he entered the palace. The Empress had been awake even before dawn, and when he arrived, Fenglong Palace had already opened. Xue Ling sent people in to announce his arrival, stood in front of the palace gate and looked down at the patterning of the floor tiles under his feet. He then heard a very pleasant voice of inquiry.</p><br/><p>“Mingyue greets the Royal Princess.\" The person dropped into a curtsy in front of him, without any of the pretentiousness the women of Xi Country normally displayed. Instead, there was a sense of heroic spirit that was balanced out by softness. Her palace dress was not outstanding, but her face was very good looking, so even though it was only a simple dress matched with one or two ornaments, she could still be labelled as unusually beautiful.</p><br/><p>This was a woman who could make people like her when they saw her, and lift people's spirits with a glance. Xue Ling raised his eyebrows, somewhat dissatisfied that she was taller than himself. His expression was indifferent as he merely lifted his head and said lightly, \"So it was Princess Mingyue.\"</p><br/><p>Not having expected that his voice would be indifferent to this extent, Wenren Yingyue frowned slightly and raised her head, wanting to open her mouth to say something. But when his face came into view, her expression changed.</p><br/><p>This was her first time meeting Wenren Hong after she transmigrated into this world. Before that, she had only heard that Her Highness the Royal Princess was gentle and virtuous with a quiet temperament, not talkative, and always kept her head lowered. She was soft, and was not a formidable character at all. But now that she had seen the real person, Wenren Yingyue felt that her breath come a little quicker.</p><br/><p>She was indeed quiet, but it was unlike the gentleness that those people had claimed. This was clearly a sword that had concealed its edge. Just by standing there, without speaking, that momentum already stunned Wenren Yingyue who had been an assassin in her past life. That face was very gorgeous, and the slightly uptilted fox eyes could make one's breathing chaotic with just a glance. That pair of eyes were really too beautiful; when she really placed a person into his eyes, that person would definitely be the most fortunate person in the world.</p><br/><p>Wenren Yingyue originally wanted to meet General Zhan's new wife, but for some reason, she currently felt a little jealous of General Zhan.</p><br/><p>She retrieved her gaze and moved a step back. “Today I came with my mother to visit the Empress. I didn't expect to see the Royal Princess here.\"</p><br/><p>Princess Linhong has always been the Emperor’s most beloved Princess, and her title meant 'sunshine after rain'.</p><br/><p>Because this younger sister of his was born after he successfully ascended the throne, he always thought that his younger sister was his lucky star, so the Emperor favored his younger sister over his daughter.</p><br/><p>Only, Wenren Hong was weak and timid in nature, and even if the Emperor loved him, his attitude had always been lukewarm. Although Wenren Hong was in awe of the Emperor deep in his heart, he was afraid to get closer because of his identity as a man. The Emperor had handed him over to another as soon as he reached fifteen in the hopes that this younger sister of his could find a sense of belonging earlier on. It was true that there was the intention of letting her act as a check and balance for the Zhenguo General's Mansion, but what the Emperor wished for more, was for his sister to develop feelings with more people, and not always be so cold and indifferent.</p><br/><p>Xue Ling nodded, and had no intention of replying.</p><br/><p>Wenren Yingyue only felt a somewhat confusing sense of embarrassment. She wanted to say, could it be that this beautiful person did not enjoy talking? So she found another topic. \"Today is the day that the Royal Princess returns to visit the family. Where is the General?\"</p><br/><p>Xue Ling glanced at her, and it was unknown what she was thinking. Her red lips parted as she replied, \"Morning court.\"</p><br/><p></p><div><div></div></div><br/><p>Wenren Yingyue's facial expression was almost rigid, and she has been berating herself in her heart for being unable to converse; weren't the words she chose purely just making just purposely making trouble? She was frustratedly bowed her head, and no longer spoke.</p><br/><p>Xue Ling asked the system within his mind, “What’s wrong with the heroine?\"</p><br/><p>The system shook out its little tail, looking pleased with itself as it said, “She has a halo of mass attraction on her head. As long as it is a character from the plot, they will all fall in love with her.\"</p><br/><p>“So she's looking at me with that kind of gaze because I didn't show that I liked her?\"</p><br/><p>“Uh… Probably not.” The system spoke somewhat helplessly. “According to my psychological analysis of her, what she is thinking now is… Well, she wants to woo you, but can’t find a topic of conversation…”</p><br/><p>Xue Ling: “… is this world's heroine poisonous?\"</p><br/><p>The system coughed twice, after all, it was someone who had transmigrated from a modern society, and their way of thinking was always slightly more flexible. Besides, this was a female assassin. There was nothing bad about wanting to impress all the women and liking beautiful girls.</p><br/><p>Xue Ling laughed sarcastically and said, “Beautiful what?”</p><br/><p>The system chose to shut up and pretend that it was no longer online.</p><br/><p>The two of them waited until the Empress summoned them inside. Because her status was not high, Wenren Yingyue had to wait outside for a while longer while Xue Ling was welcomed inside directly. Before he left, he could also feel the woman's gaze at is it followed him, her expression full of reluctance.</p><br/><p>The corner of Xue Ling's mouth twitched as he asked the system, \"Can you take away the halo of mass attraction that's on her head?\"</p><br/><p>The system nodded and said, “Based on host's current ability, there is no problem at all. But what do you want to do with it? Do you want to use it yourself?\"</p><br/><p>Xue Ling sneered. “You must be joking. I am a fox spirit. Do you understand the meaning of being bewitched by a fox?</p><br/><p>System: \"Ah.”</p><br/><p>“Since ancient times, no one has ever disliked a fox spirit.” Charm was something that was ingrained in their bones and went deep into their marrow. Even if they didn't use it, that charm would be on display between their every movement. In the previous worlds, Xue Ling's spirit had been unstable, and it had been difficult to even take shape, so his charm had not come into play. Now that he had recovered two tails, and taking into account the fact that his control over these two tails was not strong, it was inevitable that a bit of charm would leak out in his every move and action.</p><br/><p>It was much more effective and useful than that halo of mass attraction thing.</p><br/><p>The Empress was very fond of Xue Ling. When she saw her, she first solicitously asked many questions about how she was doing before asking people to prepare all kinds of snacks for Xue Ling to pick from. Then, she asked about her and Zhan Shaoxi's relationship, implicitly suggesting that Xue Ling should to learn to refuse in bed if she felt uncomfortable, to the point where two red clouds fluttered on to Xue Ling's face, before finally letting her off.</p><br/><p>When the Emperor finished morning court and summoned him, Xue Ling was half full from eating, and the sky was already bright. Xue Ling followed the Empress and entered the imperial study, performing an obeisance according to the original body owner's habits.</p><br/><p>The Empress laughingly said to the Emperor that his younger sister's temperament had improved after her marriage, no longer liking to bow her head, and had even become more and more beautiful.</p><br/><p>The Emperor did not put on airs in front of them, laughing scolding Zhan Shaoxi that he had really gotten the better end of the deal. Zhan Shaoxi replied with a stupid grin, and Xue Ling truly could not bear to look straight at him.</p><br/><p>The man in this world still loved to be repressed as usual, but had inexplicably turned on the ability to show affection. Even if Xue Ling was not cooperating with him, he somehow always managed to still display it in front of others.</p><br/><p>They stayed in the palace all morning and left before lunch. Xue Ling let out a relieved breath and felt that the system had been correct. He was really not suitable for an environment like the palace, having to show all kinds of restraint when replying to the Emperor.</p><br/><p>He wanted to be in his own territory.</p><br/><p>As king.</p><hr class=\"wp-block-separator\"/><br/><p><em>BlueBug: So he basically does the job of the heroine… </em></p><br/><p>alamerysl: LMAO MC accidentally seduced the woman protag as well???</p><hr class=\"wp-block-separator\"/><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}