{"title": "Chapter 75", "id": 75, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-75", "volume_title": "Volume 1", "body": "<h1>Chapter 75</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> 6.4 – My name is Han Wuzheng. From today onwards, I will be your master</strong></p><br/><p>After entering the main city, Xue Ling followed the map to the Registration Office, which was where players could choose a profession. It would definitely be bustling in the future, but now there were very few people here.</p><br/><p>It was not possible to distinguish between NPCs and players by their appearance. Players would only be able to see other player's names over their heads if they were already friends, and there was little difference between players and NPCs in other aspects. When players entered the game, they were reminded several times by the game system not to let the NPCs detect any anomalies in their behaviour. Otherwise, they might suffer from adverse effects, such as being killed by the NPC, or other similar things. Regardless of what NPC it was, they had more rights than the players, and killing off a player was a quick and simple matter.</p><br/><p>These NPCs could be regarded as the original inhabitants of this world. To them, the players were foreigners. Human race players would experience the NPCs’ hospitality when they entered the novice village, but if  they learned that they came from outside of the world, the NPC would begin to turn hostile. If a player was unable to act as though they belonged to the world, the NPCs would lose goodwill towards them, and eventually, the player would be unable to complete quests.</p><br/><p>Xue ling took the simplest route. He followed a young NPC into the Registration Office, copied his actions, and smoothly completed the registration process.</p><br/><p>He chose the warlock profession which could perform both ranged and melee attacks. It was relatively similar to the role of a magician in Western online games, but because the game had many variations, the way that everyone attacked was not fixed. Rather, it changed based on the influence of various aspects. For Xue Ling, many of his skills could be cast using his weapon, and when he used the bone fan, the skill would become a spell that could be cast after he drew out an array with his fan movements.</p><br/><p>All in all, as long as it looked good and seemed pretentious, it was fine.</p><br/><p>After choosing a profession, the players could pick a sect.</p><br/><p>In Seal the Devil, sects and professions were completely independent. Simply put, if one chose to become a warlock, and then joined a sect that specialized in swordsmanship, one would become a sword wielding warlock. They were two completely different systems, but one would have to find a way to integrate the two during one's cultivation path in order to continuously become more powerful. This meant that players had to be careful when they chose their profession and sect. If the two did not complement each other, they would be probably be able say goodbye to their levels.</p><br/><p>Of course, players could choose to refine or buy a pill to reset their profession in the later stages and pick a new profession from the Registration Office, but when their profession and sect levels were not the same, their level would not rise regardless of how much experience they gained.</p><br/><p>In the game, levelling up was not just a straightforward path of killing monsters and gaining experience. It had similarities to traditional cultivation, but was much simpler and had less bottlenecks. Still, it required players to have a good understanding of quite a lot of details.</p><br/><p>In the later stages of the game, there had been a great debate over the matter of dying on the forums, because some people had blown up and died because of inner demons during closed door cultivation. After experiencing this kind of death, players would need to be reincarnated and begin their cultivation again from scratch. Back then, this issue had brought up a wide range of discussions on the forum; some people appreciated it, but others felt that it was a bug in the game, and in the end, the developers later came out to give a detailed explanation.</p><br/><p>There were several types of death in Seal the Devil.</p><br/><p>If a player died while fighting against a boss or monster, it was a simple drop in level and experience, and after their death, they would need to spend a day toiling in the netherworld before they could be reborn. If a player died because they offended an NPC or acted in a way that allowed the NPC to realize that they were not from the game world, they were punished by having to stay in a small black room before being sent to the netherworld for revival. This was the game's way of warning the players not to expose their identity to the NPCs, and encouraging players to enjoy their role-playing.</p><br/><p>In addition to the two options listed above, there were also some strange ways to die. For example, the player who had written the original complaint on the forums had died because he had developed an inner devil during cultivation. Righteous path cultivators could choose to switch to the devil's path; devil's path cultivators could also change to the ghost path. Those on the ghost path would generally not run into these kinds of troubles because they no longer had a concrete body, and once their health hit zero, they only needed to visit the netherworld to revive. On the other hand, if a player wanted to regain their reputation and identity on the righteous path, then sorry, they could only start again and rebuild their cultivation from scratch.</p><div><div></div></div><br/><p>Players who died because they could not control their own minds and hearts had no right to ask for their original level to be restored because even if it was restored, they would once again still be killed by their inner demons.</p><br/><p>The developers gave a solemn warning to all players. In this game, if possible, it was better not to die and properly cherish their lives.</p><br/><p>Of course, those who were killed because other players placed a price on their heads could find a GM and have their original cultivation restored, but in order to provide a positive and harmonious game environment, the developers hoped that players would not fight and give each other a little more love.  Thanks! ╭(╯3╰)╮</p><br/><p>See, even those in an official capacity could be so shameless sometimes.</p><br/><p>Xue Ling set foot on the road to the Ten Thousand Swords Sect after the system had determined that it was the most suitable one for his icy snow lotus image.</p><br/><p>In Seal the Devil, there was a third choice that impacted a person's direction in the future. Profession and sect impacted your strength, but deciding on whether to join the righteous path or the devil's path would influence the direction of your future. Having chosen to be an awe-inspiring and righteous sword cultivator, Xue Ling embarked on the righteous path.</p><br/><p>In any case, it was an easy thing to rebel. He only chose the righteous path so that he could kill the protagonists in the future when they were defending the Devil King, preventing them from becoming true devils.</p><br/><p>After having made all the required choices, Xue Ling stepped into the teleportation portal and prepared to find a master in the Ten Thousands Sword Sect, beginning his journey in sword cultivation.</p><br/><p>At the same time, another person finally came out from the human race's novice village. He looked around at the NPCs around him, then showed his identity jade to the guard at the entrance with a calm expression before walking towards the Registration Office in the city.</p><br/><p>This person was the first human race player to enter the land of Jiuzhou, and also the story's protagonist: Thousand Miles Without Pause.</p><br/><p>He selected the warrior profession, and then chose to join the largest sect in Jiuzhou, Tianxuan Gate. He became a fighter in their main force, unaware of the differences in the world as it changed bit by bit.</p><br/><p>Not everyone was in the dark like him. At this moment, two others were watching Xue Ling as he chose his profession and sect with the same level of concentration and aggression in their eyes. However, their emotions were totally different.</p><br/><p>The man in white was satisfied when he saw that he had chosen the righteous path and was heading to the Ten Thousand Swords Sect. He turned around, arranged an identity for himself, and then went to the sect await his arrival.</p><br/><p>Within the man in black's purple eyes, there was a rage that filled the sky and made the entire space tremble. Everything was shaking, and even the white tiger that had always followed the man curled up in the corner like a small kitten, terrified of its owner who had suddenly lost his temper.</p><br/><p>After a long time, the anger that had no outlet was abruptly brought back under control, transforming into the sound of savage laughter.</p><br/><p>The white tiger trembled even harder, the fur on its entire body standing on end. It was as though something terrible was about to happen.</p><br/><p>But, nothing happened. After laughing, the man restrained his aura and created a portal with a stroke of his hand. His appearance began to change, and gradually went from unbridled evil to become cold and angular.</p><br/><p>It was a face that bore no resemblance to the original, but it was his favourite appearance. When he raised his lips and smiled, it was so warm and gentle that everyone in the world would feel happy. When he wiped all expression from his face, it was like facing a wall of ice that would not melt in a thousand years.</p><br/><p>As he faced the portal, the man practiced several times before settling on an expression that was gentle like a spring breeze, his smile able to make one feel warm all the way to their toes.</p><br/><p>The tiger behind him felt that this scene was even more terrible than his original rage and laughter, and was trying to roll it entire body into a ball as far away as possible. Unfortunately, it was still called over by the man. “Become a cat.” The man opened his mouth and demanded.</p><br/><p>Being a divine beast, although this was very hurtful to the white tiger's dignity, it was already the man's mount and had no right to refuse. In order not to get killed, the poor tiger shrank itself bit by bit, until it turned into little black and white cat. After its transformation, it shamefully rushed over to its master and meowed, as though wanting to be spoiled.</p><div><div></div></div><br/><p>The man frowned at it, but was reluctantly satisfied with its new appearance, calling for it to jump up to its shoulder as he stepped across the portal and entered a city.</p><br/><p>The land of Jiuzhou had nine territories, nine major sects, and some smaller sects that were scattered throughout, which provided players who simply wanted to quietly spend their days in the game with options. Not everyone liked to fight and kill, right?</p><br/><p>Tianxuan Gate was the first amongst the mine main sects and yes, it belonged to the righteous path. Their cultivation path leaned towards the traditional ways, and were powerful in both attacking and magic. If one wanted to follow the righteous path, then Tianxuan Sect was the best choice. So, this was where the protagonist gong and shou had first met and developed their relationship in the early stages. In a sense, the two of them were disciple brothers, and later, they were of one mind when they betrayed the Tianxuan Gate and joined the devil's path great sect that stood on the opposing side, the Tianmo Gate.</p><br/><p>Other than these two leading sects, there were also various sects that allowed players who have not yet chosen a faction to enjoy the game. The Ten Thousand Swords Sect that Xue Ling had picked was one such sect. This was a place that did not care about one's faction as long as they were dedicated to their sword. The entire sect was full of sword fanatics who treated their swords as though it was their lives. In their eyes, the sword was their way, and it had nothing to do with good and evil. Those who stood in the way of their sword were only things that needed to be killed.</p><br/><p>Who cared if you were righteous or not?</p><br/><p>The Ten Thousand Devil Grotto was suitable for ghost cultivators, the Joy Pavilion only accepted women, the demon cultivators' Imperial Monster Sect, the Ink Sect that was for those who liked to craft and were interested in mechanics, other sects that were for farming or ranching, and the Sky Qin Pavilion that accepted any who dared to come…</p><br/><p>These large sects would soon accept large numbers of fresh recruits during the recruiting fair that would be held soon in the future. Because Xue Ling arrived on the continent early, he had obtained a special recommendation and could enter the Ten Thousand Swords Sect in advance.</p><br/><p>This way, he would be the eldest disciple brother in the Ten Thousand Swords Sect in the future, and no matter how many people joined after him, their position in the sect would be under his.</p><br/><p>Although he knew that he was lucky, Xue Ling had not expected his golden finger to be this effective. He had just entered the mountain gate and had not even said a word before someone came over to invite him to the Ten Thousand Swords Sect's main peak, and several peak owners began to smile at him, hoping that he would chose them as his teacher and master.</p><br/><p>Xue Ling wondered why he would be given the protagonist's level of treatment, and glanced quietly at the system only to see it shaking its head. Its meaning was clear; these people's attentiveness towards him was not caused by the system's cheating.</p><br/><p>Xue Ling pondered over it, and in the end he could only attribute this phenomenon to his lineage.</p><br/><p>Was his nine-tailed demon fox lineage really some major thing that everyone liked?</p><br/><p>Xue Ling was just thinking about the meaning of life when suddenly, he discovered that it had become silent around him. Looking up, he realized that at some point, a young man who was dressed similarly to him in white robes was standing before him. The man was looking downwards at him, his pair of eyes seeming to hold immutable ice, as though wanting to freeze Xue Ling in place.</p><br/><p>Xue Ling was not afraid of such a gaze; he raised his gaze and met the other's eyes with eyes that showed no less coldness than the man's.</p><br/><p>To Xue Ling’s surprise, a sliver of a smile flashed across the man's gaze at his reaction. Then, he turned to the old man who sported a white beard that had been standing in the middle and said, \"Martial-nephew Sect Leader, I'll take this child.\"</p><br/><p>Even before Xue Ling could gather himself together, he heard the man's surprised voice: \"Of course, Martial-uncle Han!\"</p><br/><p>Xue Ling looked at the man again, his eyes full of doubts.</p><br/><p>The man said, “My name is Han Wuzheng. From today onwards, I will be your master.”</p><br/><p>Xue Ling’s eyebrows wrinkled.</p><hr class=\"wp-block-separator\"/><br/><p><em> - Han Wuzheng his name interestingly translates to mean 'indisputably cold'. Han is 'cold' and Wuzheng is 'cannot be disputed'. Kinda fun and meaningful tidbit for later chapters~</em></p><br/><p><em>editor: alamerysl</em></p><hr class=\"wp-block-separator\"/><span class=\"wpa-about\"></span><div><div></div></div><br/>\n</div>"}