{"title": "Chapter 93", "id": 93, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-93", "volume_title": "Volume 1", "body": "<h1>Chapter 93</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> 7.6 – I should have the right to pursue the merperson that I like</strong></p><br/><p><em>translator: xiin</em><em>editor: BlueBug</em></p><br/><p><span>“Even if you're unable to get married, I would still marry you.\" He mulled over his words for a long time before saying this.</span></p><br/><p><span>Xue Ling sneered at his words and twisted his head to look at him, finding it funny as he said, \"Lou Cen, is your self-awareness that bad? You have already rejected me once. What do you mean by coming to find me now? Our engagement has already been cancelled, and we have nothing to do with each other. You also don't need to say these words to me.\" The meaning behind his words were very clear. He meant, since there was nothing between them, Lou Cen should just go ahead and get lost.</span></p><br/><p><span>Lou Cen’s eyes narrowed, as he stared at Xue Ling's side profile almost greedily. The words that had been spoken just now were clearly words to terminate their relationship, but there was a sense in his heart that the other party was joking with him. This feeling was very unreasonable, since according to the little merman's words, the courtship he was just about to begin had already failed, but his agitated heart told him that the other party not actually intend to chase him away, but was rather playing with him. It must be that he had made him angry somehow, and as long as he coaxed him a bit everything would be fine.</span></p><br/><p><span>Following this enigmatic intuition, Lou Cen placed his hand on Xue Ling’s head. \"Why did you come out of your house so late at night?\"</span></p><br/><p><span>Xue Ling moped, and did not speak.</span></p><br/><p><span>Lou Cen’s movements were very gentle, his hands caressing the ends of his hair, bringing with them a magical ability to soothe. \"In a bad mood?”</span></p><br/><p><span>Xue Ling blinked, and when he realized that his temper could not make the man panic at all, he realized he should change his plan. His eyes reddened again as he lowered his head and clutched at his fishtail skirt. \"Am I particularly hard to like…\"</span></p><br/><p><span>Lou Cen was surprised as he replied, “Why do you ask that?”</span></p><br/><p><span>“You don’t like me, and your mother doesn’t like me…” He uttered such remarks aggrievedly. \"While you were in a coma, she thought of using it as an excuse for me to break off my engagement with you… Am I just so unlikeable that she couldn't even tolerate me wanting to have the title of being your fiancé for a moment longer?\" Tears flooded his eyes as his shoulders shook, making him look particularly wronged and pitiful. \"Perhaps even mother won't like me anymore in the future, and my two elder brothers and father won't want me anymore… Junjun… Junjun also won't like me… after all, I robbed him of his mother and father for so many years…\"</span></p><br/><p><span>Lou Cen was a little flustered, the little merman had clearly been very energetic and full of spirit when he spoke to him just now, but now he seemed to be carrying a sense that the entire world had abandoned him, making his heart ache unbearably as he also became distressed. \"Be good.\" He reached out his hand to rub his head, speaking as calmly as he could, \"You still have me. I won't leave you.\"</span></p><br/><p><span>The little merman looked at him through the haze of tears in his eyes, curled his lips, and said, \"You were obviously the first to leave.\"</span></p><br/><p><span>Lou Cen’s heart was going to melt. He squatted down and looked directly at the little mermaid, reaching out to lightly, gently, gather him into his arms. The feeling of finally being close to him was extremely wonderful, and Lou Cen let out a sigh of satisfaction. His hand slid down Xue Ling's back, and he petted his back in comfort, as though comforting him, but also giving him strength and support. \"That was my mother's decision, and not what I wanted. I like you very much, like you to the point of madness. As soon as I think of you being with others, I become unable to control my own desire to kill.\" After Lou Cen spoke, he realized that the person in his arms was a little merman, and his violent words might have frightened him.</span></p><br/><p><span>But when he looked down at him, that pair of eyes were staring at him, dark as ink, with golden rims, and watching him intently. This kind of gaze made it difficult for Lou Cen to hold back, and he was especially afraid that he would not be able to help himself and end up doing the little merman on the spot.</span></p><br/><p><span>He had no confidence in his own self-control. Just looking at this little merman made his heart beat like a drum, and he was ecstatic every time he came a little closer. Now that he had the person in his arms, he no longer wanted to let go, and being gazed at him like that made him want to be looked at like this for a lifetime.</span></p><br/><p><span>Lou Cen never knew that he could fall so fast, without any time or intention to struggle. If it had to be described poetically, it only took a glance for him to begin a lifelong mistake.</span></p><br/><p><span>Things that had already arrived in General Lou's hands would never be released easily. He did not feel that he has fallen into a lifelong mistake. Since he felt so strongly that he wanted to be with this person, then he should just go ahead and make it happen. And although the little merman said on the surface that he wanted him to leave, and did not want to acknowledge him, some small actions of his still let Lou Cen see that the little merman liked him, making his confidence stronger than than ever before.</span></p><div><div></div></div><br/><p><span>“The things that are spoken always sound better than real action.” As though noticing something, Xue Ling struggled somewhat discontentedly and tried to break away from Lou Cen's embrace.</span></p><br/><p><span>Then, unexpectedly, he heard Yan Zhaiyan’s violent voice. “That bastard! Let go of him for me!!!\" Following the sound of his voice, the sounds of several footsteps could be heard.</span></p><br/><p><span>Xue Ling had guessed that it should be the people from inside the house who had come out to find him after discovering that he was gone. His struggle just now had been done deliberately for them to see.</span></p><br/><p><span>He had already said that he would not let Lou Cen smoothly get what he wanted. With his short temper, how could it be so easy to coax him back with just a few good words?</span></p><br/><p><span>Lou Cen was reluctant to let Xue Ling go. Before he did so, he even bowed his head to drop a kiss on Xue Ling's forehead.</span></p><br/><p><span>Now, Yan Zhaiyan was no longer simply roaring. He immediately rushed forward to fight Lou Cen.</span></p><br/><p><span>Lou Cen blocked his movements with one hand, used some strength, and pushed himself two steps away. Despite performing such a series of movements, his eyes were still glued to Xue Ling's body without wavering the slightest bit.</span></p><br/><p><span>Yan Qingjun followed behind him, and immediately came to Xue Ling's side. He pulled on his hand and looked him over. When he saw that Xue Ling's eyes were slightly red, he spoke out anxiously, \"Wenwen, were you crying? Did he make you cry?!\"</span></p><br/><p><span>Xue Ling shook his head. \"It has nothing to do with him.”</span></p><br/><p><span>“How does it have nothing to do with him.” Yan Zhaiyan’s indignation was clear on his face, and it became even worse when he heard that his younger brother had been crying. \"It was their family that wanted to dissolve the engagement before, and everything has already been cleared up. What is he doing here now?!\"</span></p><br/><p><span>At this point, even Yan Chuhuan’s facial expression was not good. He coldly said, \"General Lou, we need you to give us an explanation.\"</span></p><br/><p><span>“Explanation?” Lou Cen patted his clothes and said, “I came because of the previous engagement.”</span></p><br/><p><span>The Duke’s expression was also ugly. Although he was normally quite reserved, he still cared for Yan Qiwen very much. Otherwise, he would not have taken pains to arrange the engagement for him when he kicked up a fuss. \"The engagement has already been terminated, which should be exactly what you want. If there is nothing else, I hope that you will no longer appear in front of Wenwen. He was originally unhappy because of this affair, and since you can't give him what he wants, don't come and show up in front of him to hurt his heart even more.\"</span></p><br/><p><span>Xue Ling hid behind the Duchess in silence. Yan Qingjun took his hand to comfort him, and the Duchess who had just found her real son also calmed down her feelings and looked coldly at General Lou. \"I know that General Lou has just been promoted after waking up, and there is no limit to how far you can go in the future. Our family's Wenwen is unable to climb up so high, so it would be better if the General showed some self respect.\"</span></p><br/><p><span>Amongst everyone there, none of them showed good expressions to Lou Cen.</span></p><br/><p><span>Lou Cen realized that because of the previous cancelled engagement, the Yan family's feelings towards him were very negative. The possibility of reversing the situation now was very low, but there were still some things that he needed to say. \"I did come because of the broken engagement. Since it has already come to this point, there is nothing I can do about it. But what I can do is to pursue Wenwen all over again and hope that he will accept me again and be willing to be with me.\"</span></p><br/><p><span>“Are you kidding?” Yan Zhaiyan was a fierce-tempered man. Even before his words were finished, he had already exploded. \"What are you treating our family's Wenwen as? Needing your approval for the engagement, and then cancelling it whenever you want to pull out!\"</span></p><br/><p><span>The Duchess looked at Lou Cen as if she were looking at scum. “The General must be joking. Our family's Wenwen is very pure, and can’t play these roundabout games with you. It would be better for the General to go back, and I'd rather we not meet again in the future.\"</span></p><br/><p><span>“My pursuit of Wenwen is my own business. I think, I should have the right to pursue the merperson that I like.\"</span></p><br/><p><span>“Ha-ha.” Yan Chuhuan sneered and laughed coldly. The sound of that laughter made the rest of the people present shudder. \"The lord General naturally has the right to pursue, and we also have the right to protect young adolescent merfolk. I hope that the lord General has enough willpower to persevere.\"</span></p><div><div></div></div><br/><p><span>These words were like a declaration of war that directly pulled both sides into battle. For a time, both groups became at odds with each other.</span></p><br/><p><span>But, it was impossible to just start fighting here. After throwing down a 'just wait and see', Lou Cen looked deeply at Xue Ling.</span></p><br/><p><span>As an innocent melon seed eating bystander, Xue Ling lowered his head quietly and pretended that he did not exist.</span></p><br/><p><span>Yan Qingjun worriedly clutched his hand and asked, \"Did he do anything to you?”</span></p><br/><p><span>Xue Ling shook his head. The man was too pathetic. It would be better if he didn't mess things up for him further.</span></p><br/><p><span>Although he bowed his head and did not speak, people automatically understood what he meant. As a matter of fact, Lou Cen was just a scum! Their engagement had obviously been terminated, but he still came to provoke Wenwen, did he think that Wenwen wasn't sad enough yet?!</span></p><br/><p><span>The entire group of people looked on as Xue Ling kept his head down and did not speak, but eventually the Duke sighed helplessly and said, “Let's go back. It has been messy ever since you all came back, and nobody has eaten yet. We'll go back and have dinner first.\"</span></p><br/><p><span>“Yes. Qingjun, you…” The Duchess opened her mouth and looked at Xue Ling, her thoughts tangled.</span></p><br/><p><span>Xue Ling grabbed Yan Qingjun’s hand and opened his mouth to say, “Let's just have Junjun stay over tonight. How about you move back and live with us starting from tomorrow? We can sleep together tonight, and you can keep me company.\"</span></p><br/><p><span>Yan Qingjun looked at his somewhat pitiful gaze, smiled gently, and nodded. \"Okay.\"</span></p><br/><p><span>The Duchess heaved a sigh of relief. “That's good. Let’s go back to dinner.” Yan Qingjun was her own son, the child that she had waited so many years for, but Yan Qiwen was occasionally her spiritual sustenance, and the little merchild that she had loved and cared for all along. If possible, she still hoped that the two of them could get along well, and now it seemed that Yan Qiwen did not hate Yan Qingjun for his identity, and the situation could not be any better.</span></p><br/><p><span>This child was simple, and had just lost his love. The person he liked was also a scum, and the Duchess' heart was biased. At least at this moment, she cared a little more about Xue Ling.</span></p><br/><p><span>This meal was not as happy as expected, and after eating, the family quickly dispersed. Yan Chuhuan pulled Yan Zhai Yan directly into his study while Yan Qingjun asked to stay behind by the Duke and Duchess for a chat. Xue Ling went back to the room by himself first.</span></p><br/><p><span>Because he was a merperson, his room was on the other side of the villa, and there was an open-air swimming pool in the balcony outside of his room. It connected his room with the room next door, which was the room that the Duchess had prepared for Yan Qingjun. When it was tidied up tomorrow, Yan Qingjun would be able to live there.</span></p><br/><p><span>Xue Ling had no objection to this. As long as he closed the glass door that reached the ground, no one would be able to see him walking around on two legs inside the room. Sharing a swimming pool with Yan Qingjun and things like that did not affect his plan at all.</span></p><br/><p><span>With this in mind, Xue Ling pulled off his fishtail skirt, found a bigger shirt in the wardrobe and put it on before changing his fishtail into two legs to begin practicing walking by going around the room.</span></p><br/><p><span>Because the original body's host was afraid of his own legs, he seldom brought them out. After Xue Ling came, he regularly trained his legs to ensure that he would be able to walk normally on land.</span></p><br/><p><span>Thanks to these two legs, Xue Ling has a new understanding of the deep-sea merfolk population. As long as they were a deep-sea merperson, they would be able to transform their tail into legs and walk on land at will. Their fighting power was fierce, and it was very easy for them to come out and make a living on land. And human beings did not have any understanding towards them. Although the appearance of merfolk back then was somewhat related to the deep-sea merfolk, due to the ferocity of the deep-sea merfolk, humans knew very little about them.</span></p><br/><p><span>They didn’t even know they could walk on land.</span></p><br/><p><span>Xue Ling did not plan to spend his entire life in the floating chair. After all, he had legs, and there were many things that he still needed to do.</span></p><br/><p><span>For example, he still needed to ruin the research laboratory that wanted to study him, and so on.</span></p><br/><p><span>Xue Ling planned to make his move after he became more familiar with walking on his legs, and could run, jump, and kick as he wanted.</span></p><br/><p><span>He was walking around in a circle while looking at all kinds of news on the web when the there was a knock at the door. Xue Ling knew that Yan Qingjun had arrived, so he plunged into the water at once and called out towards the door, \"Open.\"</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}