{"title": "Chapter 97", "id": 97, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-97", "volume_title": "Volume 1", "body": "<h1>Chapter 97</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> 7.10 – The possibility of allowing the Prince to ascend the throne earlier</strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; BlueBug</em></p><br/><p><span>His Royal Highness the Prince had not been joking. He began to seriously pursue Yan Qingjun.</span></p><br/><p><span>He brought him to school, picked him up from school, took him out for dinner… other than during class, Xue Ling rarely saw Yan Qingjun. In the middle of the night, he was bemoaning this while at home, sighing in resignation over the fact that Yan Qingjun no longer wanted him now that he had a man.</span></p><br/><p><span>Yan Qingjun splashed water on his face and pointed out, “Has Lou Cen been too busy to come see you recently? Is that why you remember I exist?\"</span></p><br/><p><span>Xue Ling pouted, “What are you talking about? I haven’t forgiven him yet, why should I go out with him?\"</span></p><br/><p><span>As soon as his voice fell, his nano-computer began to ring. Xue Ling's expression was still full of unhappiness as he moved back to the edge of the pool and opened his nano-computer.</span></p><br/><p><span>The message had come from Lou Cen. It said that he had found a suitable identity with which to enter the underground city without causing suspicions. He had also made preparations for Xue Ling, and would go and pick him up after school tomorrow.</span></p><br/><p><span>Xue Ling raised his eyebrows, curved his lips, and happily flicked his tail.</span></p><br/><p><span>“What, did Lou Cen ask you out?\" Yan Qingjun swam over slowly, his face teasing. “Look, your tail is waving towards the sky. Are you still saying that you haven't forgiven him and won't go out with him?\"</span></p><br/><p><span>Xue Ling leaped into the water and swam for a long time before emerging. He patted his own face, and snorted coldly, \"Stop bothering me. Go and find your Highness the Prince instead.\"</span></p><br/><p><span>Yan Qingjun was left speechless. \"Fine. I won't bother you. But remember, don't run off with him. In case something happens, everyone will worry about you.\"</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>“One more thing.” Yan Qingjun stirred up the water, pondered, and then opened his mouth to say, \"Second brother applied to be transferred out. In the future, he'll only come back for the holidays.\"</span></p><br/><p><span>“Transfer? To an outpost? ” The empire was very vast, but it also had borders. Although it had been very peaceful in recent years, there was still friction, and battles and riots were still common. Army forces were stationed there all year round. Xue Ling splashed apart the reflection of the moon in the water, narrowed his eyes, and asked, \"Second brother hasn't been able to think things through clearly?\"</span></p><br/><p><span>“Perhaps he has.” Merfolk were very sensitive to emotions. Yan Zhaiyan had not hidden his emotions well, and although he had tried to avoid meeting with Xue Ling during this period, they were still living in the same house and would still run into each other two or three times a day. Yan Qingjun knew what kind of feelings Yan Zhaiyan had for Xue Ling, and his attitude was the same as Yan Chuhuan's. If the other party had felt something in return, perhaps they could have given it a try, but the other party had obviously placed someone else in their heart, so they could only let this feeling wither away.</span></p><br/><p><span>For Yan Zhaiyan to apply for a transfer signified that he had thought it through, and no longer had any intentions to fight a bitter battle.</span></p><br/><p><span>“It's best if he's figured it out.” Xue Ling could also see his intentions, but he was good at pretending ignorance and hiding his own emotions, so most of the family did not know what he was thinking.</span></p><br/><p><span>Yan Qingjun looked at him in some surprise, and then pursed his lips. \"Wenwen, I think he still wants you to call him second brother.”</span></p><br/><p><span>Xue Ling smiled widely and nodded, “I’ve always called him second brother.”</span></p><br/><p><span>“That's for the best.”</span></p><br/><p><span>After Lou Cen sent a message to Xue Ling, he also made it a special point to communicate with Xue Ling later that night. Only when he personally saw the little merman nod his head could he feel at ease and have a good sleep.</span></p><br/><p><span>No matter how one looked at it, it was the epitome of silliness to be excited to the point of insomnia because of a date.</span></p><br/><p><span>There weren't many classes in the afternoon. Yan Qingjun and His Highness the Prince had made an appointment to inspect some pastures in the suburbs, and Xue Ling had asked him to bring back extra fresh milk for him. After asking the kitchen to make refreshments with the milk, he went off with Lou Cen without looking back. Yan Qingjun was very helpless, but the smile on his face was indulgent.</span></p><br/><p><span>“You all like him and care for him very much.” His Royal Highness looked on from one side and commented.</span></p><br/><p><span>“Yes, everyone likes him a lot. Perhaps it's cause there's a sort of magic on Wenwen.\" Yan Qingjun shrugged his shoulders and went into His Royal Highness the Prince's car. This visit was actually part of the Prince's work, but recently, he especially liked to bring the little merman with a golden tail with him to work. The two of them got along very well together, and shared many of the same topics of conversation. Their viewpoints on some things were also very consistent. Yan Qingjun allowing the other party to consistently ask him out was also based on such considerations.</span></p><div><div></div></div><br/><p><span>In any case, he needed to get married. He could not go wrong choosing someone whose three views matched his own, loved him, and who he also liked back. He felt that His Highness the Prince always had some small tricks and schemes up his sleeve, but most of the time he liked him very much.</span></p><br/><p><span>It could not be any more wonderful than this. After all, he did not like Lou Cen's ice cold face at all. Only Wenwen would be able to spiritedly chat together with him.</span></p><br/><p><span>Perhaps it was because everyone had found a suitable choice for themselves, but Yan Qingjun found that His Highness the Prince's performance so far had been not bad at all.</span></p><br/><p><span>“I think I might like you a little more.” After His Royal Highness settled him in, he seated himself next to him. \"If I have feel any goodwill towards Qiwen, it would be because he's a person that you like.\"</span></p><br/><p><span>“That's not right.” He frowned, feeling that there was a bit of a problem with this statement. \"If we really consider it this way, then I should not like him more. Who would be happy that someone else is attracting the eyes of the person they like?\"</span></p><br/><p><span>“Actually, you don’t have to say so much about it…”</span></p><br/><p><span>“Fine then. I think I should be jealous of Qiwen.” His Highness the Prince smiled widely and held Yan Qingjun’s hand. “Let’s move the topic away from Qiwen and turn it back to us.\"</span></p><br/><p><span>Yan Qingjun: “…”</span></p><br/><p><span>Xue Ling found a relatively hidden place to change his clothes and transform his tail into legs. \"Well, there should be no merfolk going into the underground city, right?\"</span></p><br/><p><span>“I have not read much information about it. We'll know when we go if there are merfolk there or not.\"</span></p><br/><p><span>“I know that they auction mermaids.” Xue Ling touched his chin and said, “Do you want to buy a fish?”</span></p><br/><p><span>“Illegal body modification and trafficking of merfolk is against Imperial Law.\"</span></p><br/><p><span>“Yes, yes, yes, my General. I look forward to the day when you will be able to bring them to justice.” He curved his lips and tossed Lou Cen a seductive look, \"Perhaps on that day I can pack up my things and wait for you to come marry me and bring me away.\"</span></p><br/><p><span>Lou Cen had always been ineloquent. Although he had spoken a lot during his confession previously, normally, he was still a man of few words with a damned expressionless face. He only nodded once in response to Xue Ling's words, his face stern as he said, \"I will work hard to reach that day.\" It was as though he had not heard the teasing intent contained in Xue Ling's words at all.</span></p><br/><p><span>Xue Ling slowed his steps, and fixed his gaze to his side profile for a while, hesitating before opening his mouth to ask, \"You really aren't going to ask me about why I can transform to have two legs? And aren't curious about what I said about my origins?\"</span></p><br/><p><span>“Not going to ask. Curious.” Lou Cen answered his questions quickly and concisely, even though answering was not useful at all.</span></p><br/><p><span>Xue Ling stared at him again for a while, but when he saw his quiet and serious attitude, he found it rather dull, and pouted.</span></p><br/><p><span>Once he gave this man even a small sense of security, he was no longer fun to tease. But Xue Ling was very glad to give him a sense of security, and let him know that the two of them could be considered lovers. Although he had never opened his mouth to say these kinds of words, he knew that Lou Cen understood what he meant.</span></p><br/><p><span>“The underground city a very complicated organization, and the stakeholders involved are very complex. It is a very difficult thing for the Empire to thoroughly clear out. The current Emperor does not have this kind of notion, so we can't really make a move against them. At most, we can only beat the grass to scare the snake and frighten them a little, so that they do not go too far.\" </span></p><br/><p><span>Lou Cen handed Xue Ling another change of clothes, and told him to change into them before placing a headgear on his head so that he was thoroughly disguised and there was no way to see his original appearance. \"This is the identity that I've arranged for you.\" He placed another nano-computer on his wrist. \"Your new identity is that of a new nobleman of the Empire. You have not been in the capital for very long, and are curious about everything. You just learned about this underground city, so you purposely arranged for an identity card to come and have a look.\"</span></p><br/><p><span>Xue Ling read through the information for his new identity, and once he was sure that he had it memorized, he asked, \"What about you?\"</span></p><br/><p><span>“I’m your bodyguard.” Lou Cen stretched out his hand and rubbed his head. “A breeder that was brought in from the countryside who has always followed you faithfully.\"</span></p><br/><p><span>Xue Ling: “…”</span></p><br/><p><span>After camouflaging themselves, they entered Central Mall. Xue Ling was brought around in twists and turns by Lou Cen, going through innumerable corridors that had been hidden in stores before finally arriving at the entrance to the underground city.</span></p><div><div></div></div><br/><p><span>Xue Ling tugged on his hand and asked, “Is it so complicated to enter every time?”</span></p><br/><p><span>“This entrance is exclusively for newcomers, and only new entrants need to come this way. After we've been to the underground city, you'll get your own identity card. With that, you can order directly from a VIP shop outside of the Central Mall. There is also a very convenient entrance there.\"</span></p><br/><p><span>“Wow… You know a lot.”</span></p><br/><p><span>“I can’t take you to do things that I'm not sure about.\"</span></p><br/><p><span>“Oh.” Xue Ling held back his smile and decided to accompany him properly to have a good look around. He would by himself next time and investigate exactly what was going on with the merfolk research laboratory then.</span></p><br/><p><span>There were not as many people moving about as Xue Ling had expected in the underground city, and most of them had also concealed their true face. The two of them did not stand out amongst the crowd, so nobody stared at them either.</span></p><br/><p><span>“The underground city will only attract and invite a lot of visitors when they hold activities. Normally, it is like a normal shopping centre. If your privilege rank is high enough, you can even make your transactions over the internet, and there is no need to come in person.\"</span></p><br/><p><span>“Oh. Then what do I need to do to get that privilege?”</span></p><br/><p><span>“Spend money. Spend enough money.\"</span></p><br/><p><span>“Forget it. I just have a little bit of pocket money.” Xue Ling looked depressed. Seeing it, Lou Cen could not help but stretch out his hand again to rub his head.</span></p><br/><p><span>“Although I have a lot of information, in fact, it is not complete. Many illegal transactions have not been clarified, and there is even information that there a private illegal merfolk research laboratory exists here, but we have not found enough evidence to destroy this place.\"</span></p><br/><p><span>Xue Ling raised his eyebrows. So they had known about the existence of the research laboratory at this time? So the reason why the original owner of this body had not been able to wait for Lou Cen to save him was probably because he had not had the ability to truly destroy this place in one go, so he had not been reckless.</span></p><br/><p><span>Based on the premise that he had not known that the original was in the research laboratory, it was really the best option to hold on and wait until he had the assurance that he could bring down the laboratory completely.</span></p><br/><p><span>Xue Ling’s thoughtful eyes made Lou Cen feel uncomfortable. He reached out his hand to block that pair of attractive eyes, lowering his head to kiss Xue Ling on the forehead. He said, \"Don't keep staring at me like that. I'm afraid I won't be able to control myself.\"</span></p><br/><p><span>Xue Ling pushed his hand away and was too lazy to answer him.</span></p><br/><p><span>The underground city was vast. The two of them enjoyed dinner together there; it was really like a date. Unfortunately, they were still unable to walk through every corner of the city that way. Lou Cen bought some things for Xue Ling, saying that it was strange not to spend money after coming here, and it could cause them to be flagged.</span></p><br/><p><span>Out of the principle of fairness, Xue Ling also bought something for Lou Cen. He also picked some things as gifts to bring back to his family.</span></p><br/><p><span>Well, Lou Cen paid for all of these things in the end.</span></p><br/><p><span>Xue Ling did not prevent him from trying to flatter the Duke Palace's people this time. After all, it would not be beneficial for them to quibble about things like this now.</span></p><br/><p><span>Their harvest this time was not big, but Xue Ling had basically memorized a large part of the underground city map, so that it would be easier for him to enter next time. In fact, it could not be considered as fruitless, because at least Xue Ling had discovered the location of the clinic. If he had guessed correctly according to the plot description, it should also be where the Merfolk Research Laboratory was situated. Other than the structures built on the surface, a large portion of the development was underground.</span></p><br/><p><span>Although it’s troublesome to do it that way, digging a basement under the underground city… it was particularly safe. Due to the special circumstances surrounding the underground city, as long as the Emperor did not suddenly have a whimsy to clean up the entire aristocracy, nothing would happen to them.</span></p><br/><p><span>And unless the Emperor wanted to throw the Empire into turmoil, he would absolutely not make such a decision.</span></p><br/><p><span>Xue Ling silently began to consider the possibility of killing off the current Emperor and allowing the Prince to ascend the throne earlier.</span></p><br/><p><span>System: “…” Hadn't he said that he would take the mild route this time? Where was the warmth in such a cruel idea?!</span></p><hr/><br/><p><em>the overarching relationship between XL and ML is really sweet and cute~</em></p><br/><p><em>if any of you are interested, the was released earlier today!</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}