{"title": "Chapter 94", "id": 94, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-94", "volume_title": "Volume 1", "body": "<h1>Chapter 94</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> 7.7 – Could it be that even a scum like Lou Cen is acceptable, but not me?</strong></p><br/><p><span><em>translator: xiin</em><em>editor: alamerysl</em></span></p><br/><p><span>The door was an automatic one, and would open upon command. Yan Qingjun didn't see anyone when he entered the room, so he went to the balcony.</span></p><br/><p><span>The balcony was very spacious. After entering the water, a little under half of the open air pool could be swum in, and it was built specifically for the merfolk in the family. After all, they were young merfolk, and would want to have their own private space. Their swimming pool was also separate from the Duchess'.</span></p><br/><p><span>A black-haired mermaid was bobbing in the water. His hands were holding on to the edge of the pool, and his eyes were wide open, reflecting Yan Qingjun's figure and making him feel gentle all over. \"Did Wenwen go out tonight because of me?\" Yan Qingjun loosened his fishtail skirt and slipped into the water with him, swimming to Xue Ling's side. \"You weren't sad and unhappy because of Lou Cen, but because of me, right? Worried that I would take away your father and mother, and your two brothers?\"</span></p><br/><p><span>Xue Ling asked in his heart if this meant that it was now time to start their 'emotional session'. But the expression that he showed on his face was still very ignorant. \"No.\" He shook his head and decided not to go too far pretending to be foolish. The situation must be clarified so that there was no wedge between him and Yan Qingjun.</span></p><br/><p><span>Although whether there was a wedge or not was not that important, Xue Ling was a perfectionist once he decided to do something. \"I knew from a very young age that I wasn’t blood related to mother. And I know that I was picked up.\"</span></p><br/><p><span>“Actually, it just never felt real. I always had the feeling that everything that I had was stolen from you. I never asked for much, and even though mother loved me very much, the only thing I ever tried to ask for in my life was the marriage with Lou Cen.\" At this point, he moved his tail and splashed in the water. “But it ended up being a failed request.”</span></p><br/><p><span>“Sometimes I wonder, was it because I took over someone else's family that people don't like me?\"</span></p><br/><p><span>Yan Qingjun reached out and held his hand. “Don’t be like that, Wenwen. It's not your fault that I was lost back then, and it's not your fault either that mother brought you back. You didn't steal anything from me, so there's nothing to atone for. Anyway, Lou Cen didn’t say that he didn’t like you. You heard what he said tonight, right? He wants to pursue you.\"</span></p><br/><p><span>“Why? There's nothing particularly good about me.\" Xue Ling seemed to be giving up on himself as he hugged his own tail and lost himself in his grief. His wronged appearance worried Yan Qingjun, who feared that he would accidentally become depressed. \"I grew up so small, and am not as attractive as you, and not as good as you, everything is worse than you, and couldn't even be liked by Madame Lou like you. I know that she particularly likes the fishtail skirts that you design. But what can I do? I'm just a little child that was adopted by the Duchess, and all I can do is act cute and fool around. Time goes by day by day. Maybe someday I will find a breeder who really likes merfolk. Maybe they won't care what kind of person I am, and just want me for being a fish.\"</span></p><br/><p><span>Yan Qingjun felt that he had already come to a dead end. If he didn't pull him out tonight, he was afraid that bad things might happen.</span></p><br/><p><span>“Wenwen, listen.” Tugging his hand and forcing him to look up at himself, Yan Qingjun opened his mouth to say, \"Even if Wenwen is small, you still haven't reached maturity yet, and you will still grow. You're very cute, and many people like you. Mother, father, and your two brothers, they all love you and like you very much, and wish for you to spend every day happy. So, you shouldn't say things like that. It will make us all very sad.\"</span></p><br/><p><span>“The person you like will like you back, and you can be together with them. As long as you can live life happily, we won’t stop you from being with Lou Cen.” Yan Qingjun continued while petting Xue Ling's head, “It’s just that Lou Cen’s attitude changed too fast, and we don't feel at ease about him coming into contact with you now. We just want to protect you.”</span></p><br/><p><span>Xue Ling made a quiet affirmative sound, reached out and embraced Yan Qingjun’s around the waist, and asked in a soft voice, “Junjun, you are a little older than me. May I call you elder brother?”</span></p><br/><p><span>“Yes. Junjun or elder brother are both good. As long as Wenwen is happy, anything is fine.”</span></p><br/><p><span>Xue Ling buried his head on Yan Qingjun's shoulder and showed a stunning smile where he would not be able to see. That smile was totally different from the simple, naïve smile that he usually gave. It was full of cunning and trickery, and probably because it was too genuine, the face that was normally not stunning suddenly turned much more glamorous and brilliant.</span></p><br/><p><span>The system kept its criticism quietly to itself to the side. Its host was actually the enchanting, contemptible wretch of legend, right? Having such a gorgeous face, and such an unrestrained and shameless personality! Did he really feel no guilt deceiving the lovely 'Holy Mother' protagonist?</span></p><div><div></div></div><br/><p><span>If Xue Ling could hear the system's sarcastic remarks, he would probably smile widely as he informed him that he really didn't feel any guilt at all.</span></p><br/><p><span>Guilt? Was that something you could eat?</span></p><br/><p><span>His body had been filled with trickery and schemes since birth. If he had really been kind and lovely, he might have already gone off to die like this original body's host long ago.</span></p><br/><p><span>This marked the end of the 'emotional session' between the two. Xue Ling pretended to cry in Yan Qingjun's arms, and then claimed that tomorrow would be another day. Yan Qingjun, who was watching, did not know whether to laugh or cry, and ended up being even more distressed over him.</span></p><br/><p><span>On the other side of the villa, in Yan Chuhuan’s room, Yan Chuhuan poured a glass of water for his brother and motioned for the other party to sit down. “Zhaiyan, don’t be so impulsive next time. You can’t beat Lou Cen. You were so reckless today. What would we do if something happened to you?”</span></p><br/><p><span>“I was just incredibly angry.” Yan Zhaiyan’s eyebrows were wrinkled into a frown as he remembered what had happened just now. “He obviously forced Wenwen to break off his engagement with him, but now he's coming back with these hypocritical gestures. It's clear that he just wants to make sure Wenwen can't separate himself from him in order to restrict our family.\"</span></p><br/><p><span>“Are you worried that our family will be restricted by him, or that Wenwen won't be able to live without him?” Yan Chuhuan asked a question that did not seem to have much relationship with the previous remark, but still made Yan Zhanhai tremble.</span></p><br/><p><span>His entire body became frozen on the spot. Faced with Yan Chuhuan’s meaningful eyes, he slowly, slowly lowered his head. “Elder brother.” He called out.</span></p><br/><p><span>“You should know that Wenwen just treats you as his brother. If you don’t want to lose him, you shouldn’t do any unnecessary things.” Yan Chuhuan’s face was very serious. Yan Zhaiyan knew what he was referring to, but he was still unresigned.</span></p><br/><p><span>“Brother, why can't it be me?! Wenwen is not related to us by blood! ” His eyes were red, and he looked a little fierce. \"I watched him as he grew up. I really like him! He was red-eyed and looked a little fierce. “He grew up as I watched him grow up. I really like him! Could it be that even a scum like Lou Cen is acceptable, but not me? Just because I've taken on the name of 'older brother'?!\"</span></p><br/><p><span>“Yan Zhaiyan!” Yan Chuhuan slammed the table and said angrily, “Do you know what you’re saying? Yiwen is a child from our Yan family! It doesn’t matter whether he was adopted or not! If you still want to see him every day, then clean up your thoughts for me! Otherwise, I’ll have you sent away, and you can come back again in another three or five years when he's already married so that you can be completely clear-headed!”</span></p><br/><p><span>Yan Zhaiyan was stunned by his roar. After hearing his eldest brother’s words, his expression was sad: “Big brother… I…”</span></p><br/><p><span>“Whatever the reason, he won’t like you, and you can’t like him. If you want to destroy Yiwen’s only home and make it so that he has absolutely no one to rely on, then go ahead and tell him how you feel. See if he will happily agree to be with you, or whether he will leave the house forever.\" Having spoken to this point, Yan Chuhuan waved for his silly brother to get the hell out of his study and return to his room. He just felt that his head was throbbing in pain.</span></p><br/><p><span>These things all happened because of Yan Qiwen, but none of them were Yan Qiwen’s fault. Yan Chuhuan couldn't even say anything about it to Yan Qiwen, and apart from sighing that his little brother made it too easy for others to care for him, the only thing he could do was to stop Yan Zhaiyan.</span></p><br/><p><span>Yan Zhaiyan could bear it when Yan Qiwen was crying and begging to marry Lou Cen, but once was probably the limit. If Lou Cen really planned to do as he said and pursue Qiwen, it would be hard to say how long Zhaiyan's intentions could be concealed.</span></p><br/><p><span>This matter could be said to be very complicated, involving issues from all aspects, but it could also be said to be very simple, involving love and hate between a group of youngsters. The eldest brother of the Yan family wanted to express that his heart was really breaking for both his younger brothers. To be able to resist the urge to beat up his confused younger brother just now must mean that there had been recent improvements to his patience.</span></p><br/><p><span>Lou Cen did not know what happened in the Yan family after he left. He had been in a coma for some time, and after waking up, he had a lot of things to deal with. In order to free up his time so that he could catch his fish as soon as possible, he even worked through the night to deal with all the important things that needed to be done. Before dawn, he changed his clothes and went out to the military department to apply for leave from his supervisor.</span></p><div><div></div></div><br/><p><span>He still had a long life ahead of him, and a bright future. As long as he strived for it, he would be able to move up. But his wife might become someone else's at any minute if he didn't chase after him; Lou Cen had always been very clear about his priorities.</span></p><br/><p><span>His superior was silent for a while about his sudden enlightenment regarding love. Although he was newly promoted, the handover had not yet been completed on the army's side. There was nothing important coming up in the near future, so he was granted leave on the condition that the handover must be completed during his time off. Although it was a holiday, he could not stop coming to work completely.</span></p><br/><p><span>While he was settling things at work, on Xue Ling's side, he was helping Yan Qingjun move in. On the way, he also learned that Madame Lou had recently distanced herself from Yan Qingjun.</span></p><br/><p><span>Yan Qingjun explained it to Xue Ling like this: “Madame Lou said that she would have liked for me to be her daughter-in-law, but her son's heart already belonged to someone else. In order to ensure that I don't misunderstand, it would be better for us to maintain a client-customer relationship in the future.\"</span></p><br/><p><span>Xue Ling: “…”</span></p><br/><p><span>“I think the person that her son’s heart belongs to should be you. So I helped you inquire about Lou Cen's intentions.\"</span></p><br/><p><span>Xue Ling: “…”</span></p><br/><p><span>“Madame Lou said that Lou Cen woke up determined to follow through with the engagement. Lou Cen has not spoken more than two words with her ever since she told him the marriage was cancelled.\" Yan Qingjun looked like he was trying to keep from laughing. \"Madame Lou had not expected that she would accidentally do bad things with kind intentions and end up letting loose the daughter-in-law that had almost entered the nest. She's now full of self-reproach.\"</span></p><br/><p><span>Xue Ling's face was full of embarrassment.</span></p><br/><p><span>Yan Qingjun patted his hand and said, “It’s all right. I comforted her for you, and told her that you are a very good person. Since Lou Cen likes you, she should also learn to see your good side.”</span></p><br/><p><span>Xue Ling: “…” A proper protagonist shou had now been broken in by him to become a godly matchmaker.</span></p><br/><p><span>Xue Ling grabbed onto this romantic drama and said, \"Why do you keep bringing up Lou Cen, I never said that I wanted to agree to his proposal. You make it sound like he's very sincere, but I haven't seen him since. Let’s not talk about it. Mother said this morning that she would hold a banquet for you next month to let the other nobles know that our family has already found you. I want to prepare a gift for you, how about you go back first later?\"</span></p><br/><p><span>Yan Qingjun didn't know whether to laugh or cry, “You want to prepare a gift for me, so you have to drive me away? Aren't you worried that I won't be surprised by it?\"</span></p><br/><p><span>“It's not like you can see what I buy for you. Why can’t you be surprised?”</span></p><br/><p><span>“All right.” Yan Qingjun did not try to refuse. “Then don’t be too late. We’ll wait for you to come back for dinner.”</span></p><br/><p><span>“Yes, yes, relax. I already told eldest brother this morning, and we got out of school early today. I can go by myself.\" Taking advantage of the lack of escort when they came out of school made it perfect for him to transform his tail into legs and walk around to have a look. He wondered if those people would still make a move against him if he turned into a human being?</span></p><br/><p><span>It seemed that the men in the laboratory only learned that he could turn his tail into human legs after he had caught the original owner of this body.</span></p><br/><p><span>Although he had only changed the paths their love would take, he had already changed the fate of the two male protagonists. The system said that this world was relatively mild, and the rest of their career paths could be left untouched. After all, it wasn't too convincing to have the host's current body turn scheming in order to change two protagonists' career paths in the future. Since their fates had already been changed, the world would be able to directly draw away their luck after the two protagonists died.</span></p><br/><p><span>Now that the basic task had been completed, Xue Ling naturally began to look towards the research laboratory.</span></p><br/><p><span>If he could destroy the research laboratory before Qingjun's identity was announced, it would cause a big shock throughout the upper class society that would also keep Qingjun from meeting some unnecessary people.</span></p><br/><p><span>This way, it made it more convenient for Xue Ling to choose a good lover for him, so that Yan Qingjun could still live a happy and satisfied life despite losing his original gong.</span></p><hr/><br/><p><em>alamerysl: brocon!</em><em>xiin: ha-ha</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}