{"title": "Chapter 100", "id": 100, "volume": 1, "url": "http://boxnovel.org/who-touched-my-tail-chapter-100", "volume_title": "Volume 1", "body": "<h1>Chapter 100</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong> 7.13 – Did this man do nothing but think about how to take advantage of him all day long… </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; BlueBug</em></p><br/><p><span>Half a month’s time could change a lot. For example, the person who had always been cold as ice. For example, the merchild who had always looked very cute. </span></p><br/><p><span>Lou Cen was beaten out of the room by a tail, but he was still satisfied. After all, he had been able deeply kiss for a very long time, and a certain merman had kissed him back for a very long time after he recovered his wits before sweeping him out the door.</span></p><br/><p><span>This meant that Xue Ling had only hit him because he had been tossed about to the point of annoyance, rather than because he was unwilling to be kissed.</span></p><br/><p><span>After the maturity phase, the merman's body had grown a lot, giving him a feeling that he had been completely remoulded and was born again. When he sat up, his original clothes were a bit short, showing a white and slender waist. His scales had changed, his fishtail becoming more intricate and attractive, and Lou Cen's eyes heated up as he looked at him. But soon, the scenery was covered up by the merman who felt that his waist had become a little cold.</span></p><br/><p><span>His hair had grown out a lot, and now hung over his shoulders, bangs covering his attractive forehead. The slight baby fat on his face has disappeared as he shot up, and his eyes had lengthened and narrowed, causing that kind of demonic aura to rise again.</span></p><br/><p><span>Before, he could be praised as cute, but if one were to praise him now, they could only praise him as attractive, or, especially attractive. </span></p><br/><p><span>Lou Cen had watched him change day by day into his present appearance, and not only did the affection in his heart not decrease, rather it grew to be more and more.</span></p><br/><p><span>The days spent waiting were too long. Lou Cen would carry the person into the water every day, and then fish him out at night. The little merman did not eat or drink for half a month, but he did not slim down, and even transformed multiple times. The people of the Duke's Palace were all rather surprised, but when they thought of his clan, they silently buried all their doubts in their stomachs. </span></p><br/><p><span>Deep-sea merfolk were the forefathers of natural merfolk. They had been treated as ancestors by the upper echelons of the Empire, which was why nobody had gone to harass them in so long. Xue Ling had only been brought out due to that group of researcher's psychotic desire to give back to society by creating more merfolk.</span></p><br/><p><span>The reason the merfolk were special and precious was because there were only a small number of them. The question of what would happen if they used some methods to increase their number was something that the Empire's high level members have never dared to think about.</span></p><br/><p><span>Xue Ling rubbed his temples, slowed down, and remembered that he had been unconscious for half a month due to that damned maturity phase. He looked down at himself, and was obviously not surprised at the changes. After stretching lazily, he waved towards Lou Cen and asked, \"Half a month has already passed. How were the matters that occurred that night handled?\" </span></p><br/><p><span>“The underground city has already lifted their seal and re-opened, but the murderer has not been found, so it is still under a state of martial law. My informant went to see the clinic, and found that it had been completely dismantled.\"</span></p><br/><p><span>“Destroy one, and they will go to another place and build another to continue doing what they want to do.” Xue Ling pouted. He also knew that he would not be able to cure this kind of disease with his actions. Although it had felt great to kill those human scum personally, if it had not been for the sake of the original body's desire, he would not have made his move this way. \"If the roots are not pulled out and destroyed, there will still be people who are caught and roped in to become artificial merfolk. Maybe next time they won't simply steal the eggs of deep-sea merfolk, but rather encourage the upper echelons of society to wage war in order to obtain the corpses of a few deep-sea merfolk for research.\" </span></p><br/><p><span>Lou Cen pressed his lips together and said, \"You know your own origins?\"</span></p><br/><p><span>Xue Ling raised his eyebrows and recalled that there were still some things that he had not explained properly to Lou Cen yet. Although he felt that the deep-sea merman that had found him on his own would explain everything clearly, there were still some things that were easier for him to explain himself. \"You know about it?\" </span></p><br/><p><span>“Yes.” </span></p><br/><p><span>“It's probably better if I explain. After all, I was the one who experienced it personally.\" Xue Ling slowly lay down again and pulled the quilt up to cover himself, staring at Lou Cen with a pair of watery eyes. \"The start of the matter began when your mother spoke to me about dissolving our engagement.\" </span></p><br/><p><span>Lou Cen: “…” Starting off with a stab to the heart, it hurt. </span></p><br/><p><span>\"I had originally planned to disagree even if it meant my life. After all, I liked you so much back then, and would even throw away my life in order to be with you.\" His expression was very calm as he spoke these words, and it was almost as though he was talking about another person's life. Although Lou Cen felt somewhat wronged by this, he found this remark quite useful. \"But there was a voice telling me, 'Agree, there is no such thing as being unable to separate from another person'. </span></p><div><div></div></div><br/><p><span>Lou Cen: “…” If he knew who it was that said those words, he would immediately go and beat them to death.</span></p><br/><p><span> “So, I agreed to her request and broke off the engagement with you. From that night on, I began to dream intermittently…\" At this point, Xue Ling lowered his gaze. \"In my dream, I had not agreed with Aunt's request, and was unwilling to dissolve the engagement. Aunt asked me to meet with her again and again. One time, something unexpected happened… and I fell into the hands of a gang of kidnappers.\" </span></p><br/><p><span>“The dream was too realistic. They were exactly those people in the laboratory… And then I died in that lab… Because I am a deep-sea merman, so they wanted to study me. They were really excessive, and did a lot of very cruel things. I had originally been able to hold on, but those people told me that you had already gotten together with Qingjun, and he was the real Young Master of the Duke's Palace. I was just an adopted child, and I had disappeared for so long, but nobody noticed…\"</span></p><br/><p><span>“And then I committed suicide.\" </span></p><br/><p><span>His tone was very calm, but Lou Cen's heart was throbbing when he heard it.</span></p><br/><p><span>It was for no other reason than because he had also seen these scenes before. Since that night, he had also started to have those dreams intermittently. Sometimes, he also felt that the him in those dreams was not himself, because he absolutely would not fall for anyone other than the little merman for any reason. And the Yan Qiwen in his dream, was also not the little merman that he liked… </span></p><br/><p><span>Nevertheless, he would still be distressed by the encounters with Yan Qiwen in his dreams. Sometimes, in the middle of the night after the dream, he would grit his teeth and regret that those people had already died by Xue Ling's hand. Otherwise, if it had been him, he would absolutely never have let them die so easily.</span></p><br/><p><span>“These dreams were too real, and I did not want such a future, and I did not want to give you up to Qingjun.\" Xue Ling toyed with the little accessories hung around the bed, his gaze lowered as he spoke, and his face was expressionless, but he looked particularly pitiable. \"So I played a little trick… I became friends with Qingjun, and brought Qingjun back to the family early. I even purposely went to see you on the day you woke up in the hospital so that you would notice me. With your personality, once you knew that Aunt had cancelled our engagement, you would come to find me…\"</span></p><br/><p><span>“It’s just that you went beyond my expectations. You even told me you liked me…\" Xue Ling pressed his lips together and forced himself to look at him. \"If I am this kind of scheming person, not naïve at all, and not cute, and selfish, wanting to change the predetermined destiny for myself, if this is the real me, would you still continue to like me?\"</span></p><br/><p><span>He was asking Lou Cen, but it was also like he was asking beyond Lou Cen and directing the question at the soul that was inhabiting his body.</span></p><br/><p><span>They had been together for so many worlds, but he still felt insecure occasionally. In the eyes of the many in every world, he was always the most beautiful and wonderful person; if one day they truly see each other for real, then would he still continue to love him without any camouflage? The real him who was not cute at all, and who, other than being attractive, was absolutely without merit?</span></p><br/><p><span>The system: “…” Even covert praising of oneself should not be done so exaggeratedly. Host was really too shameless. </span></p><br/><p><span>“It is fine even if you are a scheming person, or a person who only does things for themselves, or change into any kind of disgusting appearance.\" Lou Cen's expression was seldom gentle, but when he was tenderly affectionate, it made Xue Ling a little entranced, and he always felt that he could see traces of Su Xuanyan's figure on his body. \"As long as it is still you, as long as you are you, I will like you, and I will fall in love with you, and love you to the point of losing myself, love you to the point of abandoning everything, just in order to love you.\" As though wanting to comfort the seemingly uneasy Xue Ling, Lou Cen spoke these words very seriously. </span></p><br/><p><span>“I'm sorry for not falling in love with you earlier, so that you still had to experience all this and change into who you are now.\" He reached out his hands and gently pulled Xue Ling into his embrace. \"Don't worry, I will take responsibility. No matter how you change and what you look like, I will still want you, and will always stay with you.\" </span></p><br/><p><span>Xue Ling leaned on his shoulder, and his lips slowly curved up into a somewhat crafty, very attractive smile.</span></p><br/><p><span>In fact, whether or not to make today's speech had been completely up to him. Even if he had not explained things this way, he could still find explanations to let Lou Cen believe that he was very innocent and helpless. But it would be particularly difficult to wrap it up. What he could do was to ascribe everything to an inexplicable dream. Taking advantage of this opportunity, he also spoke the words that he had always wanted to say. Although the man would forget these things every time they changed worlds, he was still very satisfied with the sense of security that the man provided him with in every world.</span></p><div><div></div></div><br/><p><span>The two of them had gone through so many worlds, and Xue Ling had already slowly let go of his original belief that the man would leave him during one of the worlds. And gradually, he had dissolved those fears and uneasiness and gotten used to embracing a seemingly new lover in every world, and then through their daily interactions, discover little details about him that stayed the same regardless. </span></p><br/><p><span>Like how the curve of his mouth was particularly suitable for kissing when he smiled gently, and other similar things, as well as some of the special characteristics of his personality and details from their everyday life. As long as he had the heart to look for it, he could always find these things in his lover. The man's character in every world would change somewhat, but ten thousand chances would still be similar to the original; Xue Ling thought that he should be a very gentle person, but he was only affectionate towards a specific person. When he first met him, he was particularly cold and distant, but once the two of them were together, the man became unbelievably loving in many details of their life. </span></p><br/><p><span>Oh, and he had become particularly capable of spouting words of love over these recent worlds. Although it was becoming more and more nauseating, he really liked listening to it. </span></p><br/><p><span>They hugged quietly together for a long time before Xue Ling coughed, and began again, \"Did the man who came to find me say anything else other than my origins?\" </span></p><br/><p><span>“No.” He had simply revealed that Xue Ling was the person he had been looking for, and that he was a member of the deep-sea merfolk clan. Other than that, he had kept silent about everything else. \"He has been living in the Duke's Palace with Yan Qingjun. If you want to see him, I can call him over.\"</span></p><br/><p><span>In fact, he couldn't really say that he had been with Yan Qingjun the whole time, because a certain deep-sea merman was really too much in the way. Yan Qingjun was very welcoming towards Lan, and Lan was very content to follow Yan Qingjun to all parts of the Empire's capital, but His Highness the Prince was not happy. How could he let him constantly take over his date? After the Prince had eaten a few days of sullen vinegar, Lan went off to spend time with Yan Chuhuan instead.</span></p><br/><p><span>When Yan Qiwen was a child, the Duchess was not in good health because she was too immersed in the loss of her little son. Yan Qiwen was brought up by Yan Chuhuan for a long time. The eldest Yan brother had their second brother in one hand, while bringing up their youngest merchild brother, and was very clever even during childhood. Because he had had such an experience, Lan liked stay close and ask him about Xue Ling so that he could record their ruler's growth manually and learn about his various hobbies in order to make preparations for his return.</span></p><br/><p><span>“Of course, whether he is staying or you are returning in the end still needs to be carefully discussed.\" Lou Cen finally reached this kind of conclusion.</span></p><br/><p><span>\"The information contained in this is a bit much…\" He organized it slightly in his head. \"He did not clear up the matters regarding his relationship with me, and the situation in the underground city has not progressed at all. The Empire seems very calm right now?\"</span></p><br/><p><span>“In fact, the Duke has been getting busier and busier these days, and this calmness is only for show. Since something happened to the research laboratory, the backers would absolutely not be kind enough to let it go. Once they make their move, His Highness the Prince will also begin.\"</span></p><br/><p><span>“His Highness the Prince?\"</span></p><br/><p><span>“Didn’t I tell you?” Lou Cen laughed very gently, but his smile held killing intent. This was not aimed at Xue Ling, but it made him raise his brows in interest. \"His Highness has made up his mind to resolve those nobles who have nothing better to do all day than to sit around idly and stir up big news. The incident in the underground city and the protests by the Imperial Academy have given him a great opportunity. The Lord Duke has already decided to cooperate with him. Now that you've woken up, perhaps you'll also go to meet His Highness.\" </span></p><br/><p><span>\"Oh. Does he want to talk to me about cooperating? Who do I represent? The deep-sea merfolk, or you?\" Of course he represented the deep-sea merfolk. Saying that he would represent Lou Cen was purely said as a joke. </span></p><br/><p><span>Lou Cen understood his meaning, reached out and rubbed his head. “Although I have already made my decision, if you don't want me to join in, I can also listen to your wishes.\" </span></p><br/><p><span>“Oh? I represent you?”</span></p><br/><p><span>“Yes, Lou family rules, the wife's words must always be considered first.\"</span></p><br/><p><span>Xue Ling: “…” Did this man do nothing but think about how to take advantage of him all day long…</span></p><br/><p><span>But, it's fine. He'd already been called Madame before, so if this man liked to call him wife, then wife was also fine~</span></p><hr/><br/><p><em><span>bb: GG 100 chapters xiin: 100 chapters! huge milestone &amp; <em>feeeels</em> in this chapter~ three more chapters to go and we’ll officially be at the halfway point. it feels like we just started (and it also feels like it’s been forever, lol). i hope you guys are enjoying the ride!</span></em></p><br/><p></p><div><div></div></div><br/>\n</div>"}