{"title": "Chapter 108", "id": 108, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-108", "volume_title": "Volume 2", "body": "<h1>Chapter 108</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>8.7 – He experienced what it was like to not know how to begin</strong></p><br/><p><em>translator: xiin</em><em>editors: BlueBug &amp; alamerysl</em><span>7l4 y8</span></p><br/><p><span>Xingyue Mountains was south of Yanshan Base. It was only a fork in the road away from the city Chu Han and the rest had visited last time. The group drove for a day, and finally stopped at the foot of the mountains.</span></p><br/><p><span>After choosing a place to temporarily set up camp, the group of ability users thoroughly explored the area around their camp in order to make sure that there were no problems before setting up and preparing to rest there for the night. </span></p><br/><p>Please visit .</p><br/><p><span>Xue Ling had already made clear what they needed to do during this month's training on the way here. </span></p><br/><p><span>During this month, he would accept any mercenary tasks related to the Xingyue Mountains, and assign them to the teams scattered across the mountains. They would be responsible for completing their own tasks, while Xue Ling would be responsible for checking completion, as well as providing training and guidance for their abilities.</span><span>bd4t06</span></p><br/><p><span>The mercenary corps would take a percentage of the profits they made upon completion of every task, and the profits would be allocated according to each team's accomplishment. This was the same as being able to eat meals as long as one worked hard.</span></p><br/><p><span>During this month, the camp at the foot of the mountain would provide enough materials and supplies for each team. They could come down the mountain to get more equipment at any time, and injuries would also be treated there. </span></p><br/><p><span>After two days of hard work, all the newly recruited members of the Snow Fox Mercenary Corps went up the mountain. Xue Ling lay idly in front of a new trailer car they had set up and stretched lazily.</span></p><br/><p><span>It had been a year since the apocalypse, and after the initial period of panic, the ability users picked up a lot of things from prior to the apocalypse. Some low-level ability users resumed their previous work in exchange for survival and supplies, and many people in the automobile industry returned to their jobs.</span><span> juEcY</span></p><br/><p><span>Of course, it was impossible to build cars on the same level as those from before the apocalypse. Many mercenary teams went to various urban areas to find materials that could be used, and then brought them out for sale after picking through what they wanted. The price was cheaper that way, and there were many people who wanted to buy them as many forces needed such basic things while developing. If Chu Han and his team hadn't stayed in Yanshan base for so long, perhaps they might have been unable to find a way to buy these things. </span></p><br/><p>Read more BL at .</p><br/><p><span>“What are you planning to do?” Xue Ling had been busy these two days, and the man had not come out to make trouble. Most of the time, he just quietly watched Xue Ling. If only Xue Ling would look back at him, his mood would be much better. </span></p><br/><p><span>Xue Ling had a chocolate bar in his mouth and was just about to eat it. When he heard Xun Yu's words, he turned his head and glanced over at him before saying, \"Don't plan to do anything. I'll just teach them some skills. I mainly plan to recover some funds during this month since the cash flow for a mercenary group can't be broken.\" The simpler explanation for what he said was that training or whatever was just a cover, and he was mainly using them to make some money.</span></p><br/><p><span>Xun Yu felt somewhat helpless. Although he had a lot of money that he could give the other, he would probably be kicked out for his unwarranted courtesy.</span><span>Cd1v5j</span></p><br/><p><span>“Oh, right.” Xue Ling remembered one thing he had always wanted to ask. “How many kinds of abilities do you have? When we sparred previously, you used three or four types.\"</span></p><br/><p><span>“All types.” Normally, no one would tell the truth about this kind of thing, but Xun Yu told Xue Ling about it without reservation. “As long as it is an ability that has appeared in my domain before, I can use it.\"</span></p><br/><p><span>Xue Ling: “…” Sure enough, he was a plug-in once again.</span></p><br/><p><span>The man's words were not difficult to understand; the translation was, 'I can do it as long as I've seen it' and 'invincible within my own domain'. </span><span>iL925d</span></p><br/><p><span>“You used three kinds of abilities that day.” When it came to things related to abilities, the man recalled that he needed to mention a few points to Xue Ling. \"Fire, ice, and lightning. Lightning and fire mutually support each other, but the ice ability seems unexpected.\" </span></p><br/><p><span>Xue Ling spoke lazily, “Yes, I don’t know what’s going on either.” He had only recovered three tails right now, and there was nothing wrong with being able to use three abilities. His family's system had restricted him that way. Otherwise, he would also give himself all types of abilities to play around. Who would want to be a male protagonist who had things hard when they could be a plug-in? \"But I've adapted well so far.\"</span></p><br/><p><span>While they were having a good conversation back at the camp, one of the teams had joined up with another person.</span></p><br/><p><span>He Yan curved his lips to greet the captain of the team and hugged all the team members. “I’m sorry to trouble you, and even had you guys bring me up the mountain.\" </span><span>iaZjEs</span></p><div><div></div></div><br/><p><span>“It's fine. We were originally planning to be here in the forests and mountains to do our tasks anyway.\" The team captain’s face was red as he spoke politely with He Yan. “The mercenary corps' head and the external aid are both at the foot of the mountain. You can go there if you're looking for them.\" </span></p><br/><p><span>“No need. Didn't I say that I was going to travel with you guys?\" He Yan looked a little lonely. “I will try my best to do a good job this time so that elder brother Han will sit up and notice me. He must be thinking that I'm useless and doesn't want me anymore, but I can definitely help you.”</span></p><br/><p><span>The group seemed to trust him; they nodded and really allowed him to follow them. </span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>Many people knew that He Yan was once Chu Han’s fiancé. Although Chu Han had said that they no longer got along, most people thought that there was just some problems between them, and that Chu Han would still protect He Yan after a while. It was also because of this that He Yan was able to sneakily join with the team this time. </span><span>CdH4gn</span></p><br/><p><span>The system provided Xue Ling with 360 degrees with no dead angle monitoring of He Yan, so Xue Ling naturally knew how this fellow was trying to seek death. The direction that He Yan was headed in was deep in the mountains, where there was a female zombie beast that had just given birth to a child. If he stole or killed her child, it would definitely make the mother zombie beast riot. There was a large nest of zombie beasts there, and as soon as they started to act up, it would probably lead to the entire group of zombie beasts going into a frenzy. </span></p><br/><p><span>At that time, it may even lead to a zombie animal tide. The people that Xue Ling had brought up the mountain would have to be very good in order to survive.</span></p><br/><p><span>He Yan had decided to thoroughly break off all relations with Chu Han. Now that things had already come to this point, in order to avoid facing a stronger Chu Han in the future, he could only choose to kill Chu Han off before he developed.</span></p><br/><p><span>As far as he knew, Chu Han was at most only an S-ranked ability user, and it would be impossible for him to cope with so many high-level zombie beasts in this time period. As for him, he had a system in his body, and so long as he remained invisible, nobody would notice him. </span><span>j7Q9re</span></p><br/><p><span>As for that zombie emperor… </span></p><br/><p><span>“System, is it really possible to have him fall in love with me?” No matter how he thought about it, He Yan still felt that this kind of result was inconceivable. “I don’t want something so disgusting to fall in love with me at all.” </span></p><br/><p>Read more BL at .</p><br/><p><span>“Lord host, there’s nothing to be hung up over. If he falls in love with you, then he won't hesitate at all when you tell him to die. By then, the path to restore the world will go a lot smoother than in the original plan. After all, he is the most powerful person in the world. If he wants, he can order all the zombies to die.\" </span></p><br/><p><span>He Yan’s eyes lit up as he said with surprise, “That works too?!”</span><span>A951n4</span></p><br/><p><span>“Yes! Lord host has boundless charm - Chu Han must have a problem with his brain for him to ignore you. Since he wants to die so much, we'll send him on his way.\" </span></p><br/><p><span>“Good!” </span></p><br/><p><span>Xue Ling looked at the previous half month's worth of dialogue between the protagonist and his system that his own family's system was showing him, and asked the little fox who was circling around him, “This system of He Yan's, is it really an apocalypse counterattack system?\" </span></p><br/><p><span>“That’s right. Isn't it saying things that give off the feel of an apocalypse counter attack?\" The little fox shook its ears and looked at its host in confusion. \"Even the protagonist's IQ has been led astray by it.\" </span><span>xT4EC0</span></p><br/><p><span>“I think his IQ is what it is. It doesn't matter whether it's been led astray or not.\" </span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>“…” </span></p><br/><p><span>“They are going to abandon me and go for Xun Yu instead?” </span></p><br/><p><span>“And here I was thinking that you didn't know that your man was the zombie emperor in this life…\"</span><span>Cyc oI</span></p><br/><p><span>“Of course I know. Didn't I guess it right from the start? I'm waiting for him to tell me himself. Won't it be fun to play a round of 'do you want me or do you want your clan' with him later?\" </span></p><br/><p><span>“…” Did its host feel unhappy whenever he didn't seek death for a day? \"Host, your focus seems to be wrong… Isn't the main point that the protagonist shou appears to want to hook up with your man?\" </span></p><br/><p><span>“I know.” Xue Ling curved up his lips in a cold smile, “Don’t you think there’s something wrong with his system's words?” </span></p><div><div></div></div><br/><p><span>“Um… It appears so.\" </span><span>keryaz</span></p><br/><p><span>“It seems that the plot defender this time did not simply transmigrate into a person. Rather, it became the protagonist shou's system.\" Xue Ling rubbed his chin and analysed, “Although they are plot defenders, the only thing they really need to do is ensure that the final ending is correct. As long as the zombie emperor and I are both dead, and He Yan lives to the end, then that counts as the plot having been successfully maintained. That's why it would make such a plan.\"</span></p><br/><p><span>“It is estimated that it is also a novice plot defender. Otherwise, it would not consider having the protagonist shou fall in love with the zombie emperor. Its thinking is a little too unrealistic; did it really think that it would be so easy to maintain the storyline?\" </span></p><br/><p><span>“If lord host wasn't here, perhaps it would really be successful?” </span></p><br/><p><span>“Ha-ha.” Xue Ling stared at the frozen blade at the tip of his fingers and laughed coldly. \"Only someone who has lost their memory and gotten brainwashed would like an idiot like He Yan.\" </span><span>z3FBOV</span></p><br/><p><span>“…” Its host's words had become more and more cruel recently. It had no idea where the protagonist shou had irritated him. </span></p><br/><p><span>Um… It seemed that everything about him was annoying. Xue Ling had no idea why anyone would create such a world. </span></p><br/><p><span>“Let him do what he wants. I'm more interested in seeing how he plans to get away when he really manages to stir up a zombie beast tide.\"</span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>“The question is how does lord host plan to get away…\"</span><span>6R8CmF</span></p><br/><p><span>“Why will I have to get away? Did you think that I brought these people here just to watch them play around? If they can't even deal with a beast this time, there's no use for them to stay in the mercenary corps.” </span></p><br/><p><span>System: “… That's too cruel…”</span></p><br/><p><span>“Only after suffering bitterness within bitterness will one become a man of honor. What's more, with Xun Yu and I here, what is there to be afraid of?\" </span></p><br/><p><span>System: “…”</span><span>IUGmaP</span></p><br/><p><span>That was true. In fact, as long as the aura of the zombie emperor was present, the probability of those zombie beasts approaching them was very low; even if they were frenzied, none of the zombie beasts would dare provoke their emperor's authority.</span></p><br/><p><span>After watching the protagonist look for trouble, Xue Ling tilted his head to ask Xun Yu, who had been staring at him the entire time, \"If there is a zombie beast tide, how many zombie beasts would you be able to hold back?\" </span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>Xun Yu did not understand why he would come up with such a sentence after not speaking for a good while. He was distracted for a moment before opening his mouth to ask, \"How many do you want me to resist?” </span></p><br/><p><span>Xue Ling shrugged his shoulders and said, “All of them would be best, of course~\" </span><span>ivLyrX</span></p><br/><p><span>“There’s a beast tide?”</span></p><br/><p><span>\"What should come will always come.” Xue Ling's answer spoke volumes. He then got up to return back to his trailer car. According to He Yan's speed and strength, he would probably still need a period of time before he could steal away that baby beast. Xue Ling could use this time to properly train up the newcomers.</span></p><br/><p><span>Xun Yu was a little curious about odd conversation that seemed to have no purpose, but Xue Ling did not explain, and he also had no way to foresee what would happen after a period of time. In fact, he was a little unhappy about his current progress. Xue Ling always kept himself at a certain distance from him, and the relationship between them could only be said to be a relationship between ordinary friends. Or, perhaps Xue Ling only considered him as a partner and basically had no intention to develop their relationship any further. </span></p><br/><p><span>Xun Yu didn’t know if Xue Ling was always cold and indifferent towards him now because he had been frightened away by his roguishness the first time. He always tossed him to one side as soon as they finished discussing official business and did not talk about anything else with him at all.</span><span>ygj70d</span></p><br/><p><span>This was not the state that he wanted to be in. </span></p><br/><p>Read more BL at .</p><br/><p><span>Xun Yu recalled the tactics for chasing someone that his subordinates had talked about before, and began to think about how to apply them to Xue Ling. </span></p><br/><p><span>But no matter what he recalled, he felt that those means were all useless towards Xue Ling… </span></p><br/><p><span>This was really too awful… Xun Yu, for the first time in his life, experienced what it was like to not know how to begin…</span><span>BdrtNj</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}