{"title": "Chapter 106", "id": 106, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-106", "volume_title": "Volume 2", "body": "<h1>Chapter 106</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>8.5 – Remember it. That's my name.</strong></p><br/><p><span>This arena fight was unexpected, but people were looking forward to it regardless. </span></p><br/><p><span>Xue Ling could be considered as a new emerging powerhouse in Yanshan base, but his title as a powerhouse was only rumored, and most people had not confirmed it yet. And because of the rumors, people had different guesses about his level of strength. Most of the applicants that came here today knew that they were taking a chance.</span></p><br/><p><span>No new forces had emerged in Yanshan base for a long time, and the contenders could no longer see any path for future development in those old forces. If they wanted to get ahead, they would have to gamble. And it was at this time that Xue Ling appeared. </span></p><br/><p><span>At first, almost everyone had been frightened by Xue Ling’s ability to freeze others at a glance, and nobody doubted his skill. It was not that nobody wanted to go up to test it, but everyone was holding back and hoping that someone else would go up on stage before they did. </span></p><br/><p><span>In such a situation, if it had not been for the man that was now standing on stage, this stalemate would probably last until the end of the recruitment drive. After all, Xue Ling’s aura was so strong that a glance at him would make people shiver, let alone saying anything provoking towards him.</span></p><br/><p><span>Xue Ling stamped a foot, and his entire person lost his previous laziness all at once. When he stood up, he was just like a sharpened sword waiting to come out of its sheath. That kind of fierce killing intent made everyone go still, and become nervous against their will. </span></p><br/><p><span>At the same time, they also felt a little lucky in their hearts.</span></p><br/><p><span>Fortunately, the person on the stage was not them. </span></p><br/><p><span>Xue Ling had actually thought about this interlude long ago. He never expected that his plans would go smoothly according to his will, so he had been ready to go and fight on stage as early as when he decided to host a tournament to recruit members. Only, his current opponent made him a little surprised.</span></p><br/><p><span>In this story, the hierarchy of this world's strength was split this way: the strongest ability users were SSS-ranked powerhouses, and at present, there was nobody on this level. The one and only SS-ranked ability user was in the Northern Research Base, and he was a government researcher who devoted himself to researching ways of turning zombies back into humans. His combat ability was not very strong, but he was a psychic ability user, and if he wanted to, he could make anyone whose mental power was not as strong as his go crazy, die, or completely destroy their consciousness.</span></p><br/><p><span>There was no precise data on the remaining S-ranked powerhouses, but each large-scale base generally had two or three, while medium-sized ones had one. A small third-rate place like Yanshan base where there were all kinds of forces would not have many powerhouses, only attracting A-ranked ability users from elsewhere. There was no need to talk about the BCDE-ranked ability uses, as those were small fry that did not count for anything in Xue Ling's eyes. </span></p><br/><p><span>In fact, the level differentiation for zombies was very similar. The SSS-ranked powerhouses were on the same level as their zombie emperor, and this was probably the point that made zombies act arrogantly towards ability users. They already had the support of their SSS-ranked emperor, and no matter what they did, at the end of the day, the side that would be destroyed was not them. This was also why He Yan needed to train up a SSS-ranked ability user in order to deal with the zombie emperor. When their strengths were unequal, there was no way to kill the zombie emperor unless the other party was willing to die.</span></p><br/><p><span>The SS-ranked powerhouses were on par with the royal zombies. They were each rulers of a territory, but these the zombies were not as dispersed as the ability users, who only ruled their own territory. Rather, they were all gathered together under the command of the zombie emperor, and listened to his orders. In this regard, if the two sides really went against each other, the probability that the ability users would all die off was much higher. The ranking of the lower level zombies was relatively simple and arbitrary. There were also intermediate and low-level zombies under the high-level zombies. The low-level zombies had the largest territories - although they had no consciousness, they could still create lots of big problems for weak ability users when they gathered together in large groups.</span></p><br/><p><span>What was worse, because they didn’t have awareness, their desire for flesh and blood was even more powerful. As long as they could scent flesh and blood, they would be like a dog who had scented a fleshy bone and rush up. Killing one wave would only bring on the next wave, endlessly, until people collapsed.</span></p><br/><p><span>The person currently on the stage gave Xue Ling a particularly strange feeling. Xue Ling had already recovered three of his tails, and although he would be weakened when he came into the world, even coming up against a SSS-ranked powerhouse would not be a problem. But he had no way to sense this man's power level at all, which made him a little eager to give it try. </span></p><br/><p><span>The system fanned the fires from beside him, \"Lord host! Kill him for me!\"</span></p><div><div></div></div><br/><p><span>Xue Ling raised his eyebrows and ignored the system. Although it did not have the ability to sense that man for him, only a plot defender or his man would be able to make the system gnash its teeth like this. He looked the man up and down, curved his lips, and confirmed his identity.</span></p><br/><p><span>Choosing a body that fit his preferences so well, this should be his family's golden thigh~ It seems that he always wanted to be a little stronger than him in every world. </span></p><br/><p><span>Although he thought this way, Xue Ling did not intend to pass up the chance to play tricks on the other party. He still didn't know anything about the man right now, and using this opportunity for a fight in order to feel out the other party was a good choice. </span></p><br/><p><span>The confrontation between the two had already begun as soon as Xue Ling stood up. Both of them spread out their auras, and the crowd of onlookers involuntarily retreated back several steps, leaving a large area beyond the platform empty. They did not want to become accidental sacrifices during a fight between skilled powerhouses. </span></p><br/><p><span>There was no way to tell what the man's powers were, but as soon as Xue Ling stepped onto the stage, his entire body sank as an indescribably powerful force tried to push him downwards.</span></p><br/><p><span>The whole platform was completely covered by the other party's field of gravity. If Xue Ling had not been vigilant the whole time, he would probably be splayed against the ground by now. </span></p><br/><p><span>Xue Ling became a little excited. </span></p><br/><p><span>The man had never treated him like this before over the many worlds that they had gone through together. In retrospect, the last time he had spoken harshly to him was during a certain wedding night. It was rare for him to provoke him as soon as they met. With a wave of Xue Ling's hand, a large area of ice spread out from the ground, seemingly wanting to freeze the entire gravity field. </span></p><br/><p><span>The gravity was weakened after being covered by ice. Xue Ling had just let out a breath when he heard the man murmur, \"It's no use.\"</span></p><br/><p><span>His voice fell, and deep cracks began to appear in the ice. Xue Ling's expression turned stern, and taking advantage of the time while the ice could still hold up, his figure leaped towards the man! </span></p><br/><p><span>Countless daggers of ice appeared in mid-air as he spread out his hands. This scene sent the crowd that was watching into an uproar. As they were not inside the venue, they did not understand why Xue Ling had performed that series of actions just now. Nevertheless, when the daggers of ice appeared on the scene, they still felt shocked. </span></p><br/><p><span>That kind of strength that they had no way to match up to was right in front of them, and right at this moment, the two forces were colliding.</span></p><br/><p><span>In response to the ice daggers, the sky became full of flames, and the burning flames turned into a huge phoenix that called out and rushed towards the daggers of ice. The daggers also responded very quickly, and as soon as the phoenix appeared, the ice transformed into an ice phoenix that filled the arena platform with its cry. As for Xue Ling, at this moment, he was rushing towards the man, and the cold ice blade in front of him flashed with a strange light, and from a distance, it seemed to glow. </span></p><br/><p><span>His attack was very aggressive, his killing movements were particularly fierce, and the man's eyes darkened. He waved, and a rifle made of ice appeared in his hands. Even before Xue Ling had reached him, he had already pointed the muzzle towards him. </span></p><br/><p><span>Although he was somewhat surprised at how flexible the man's abilities were, Xue Ling did not hesitate at all as he made his move, directly cutting apart the man's rifle. Lightning also flashed as it followed his movements, directly aiming at the man's face. </span></p><br/><p><span>There was another uproar at the scene.</span></p><br/><p><span>It was impossible for them not to be surprised. After all, so far, both of them had already shown quite a few abilities! And the way they used those abilities was very different from their knowledge of how to use them! Many people who were watching felt that they had been inspired - this was the first time that they discovered that abilities could be used this way. </span></p><br/><p><span>The lightning transformed into a giant beast as it roared towards the man, but halfway there, it encountered a crazily growing cluster of trees, and the entire platform was instantly covered with greenery. It was unknown who had actually used that ability, but the two people suddenly disappeared from the crowd's eyes. </span></p><br/><p><span>The only ones who could still see were the two who remained on the platform. </span></p><br/><p><span>At this moment, Xue Ling had already arrived in front of the man. The flames around him were burning constantly, setting fire to the branches that were trying to wrap him up. His pair of fox eyes were burning with more and more killing intent; this feeling of playing chess against his opponent and matching move for move felt amazing, and adding on the fact that Xue Ling subconsciously treated these movements as **, he also had a smile on his face. </span></p><br/><p><span>A smile like that paired with that pair of eyes instantly opened up endless amounts of charm, and the man was momentarily dazzled.</span></p><div><div></div></div><br/><p><span>It was too tempting…</span></p><br/><p><span>This person in front of him, regardless of whether it was his appearance, figure, aura, or momentum, or even a single strand of his hair, everything was constantly seducing and tempting him!</span></p><br/><p><span>He had not felt this kind of feeling for too long. When he had been hiding in the crowd previously, he only thought that this feeling was based on a desire to break this person apart and eat him up, but now that he was facing him, a different kind of feeling made the man's heart and soul begin to quiver. </span></p><br/><p><span>It was still a desire to 'break him apart and eat him up', but he also wanted to lock him up, and put him in a place where only he could look at him, and make it so that this person would only be seen by his gaze. He wanted to make it so that in that pair of eyes, the only 'person' he could see, was him! </span></p><br/><p><span>Wanted to lick every inch of his skin, wanted to personally touch his entire body, make his eyes redden, make him look at himself with tears in his eyes… </span></p><br/><p><span>That scene would definitely be very beautiful. </span></p><br/><p><span>Although his mind was full of unfiltered perversions, the man managed to hide these thoughts perfectly beneath his proper, serious expression. </span></p><br/><p><span>The dagger slid past his neck, but the man did not dodge it. He reached out, and gave the person who had charged his way over a full body hug. Xue Ling was stunned for a moment, and in the next second, he felt a numbness spread through his body. The feeling of being run through by lightning was not very good; Xue Ling's legs turned soft, and his entire body was almost paralyzed. </span></p><br/><p><span>The only reason he did not fall to the ground was because the man had reached out to embrace him. </span></p><br/><p><span>“You, are very good.” Xue Ling was stunned again as he heard the man's cold and distant voice.</span></p><br/><p><span>He lifted his head to glare angrily at the man. For no other reason, but because the bastard had stretched out a hand to pinch him on the ass! </span></p><br/><p><span>Could he stop being so shameless? Saying such words with a serious face, and then making such moves with his hands. </span></p><br/><p><span>The man saw that he looked like he was about to explode and bite him, and a smile flashed across his eyes. He held him up so that he could stand properly, and then opened his mouth to say, “Calm down a bit. I'm going to take away the trees.\" </span></p><br/><p><span>Xue Ling no longer wanted to deal with this damned rogue. He turned around to leave the platform, and as he turned, the trees on the platform began to shrink crazily until they all turned back into a single seed that fell into the man's palm.</span></p><br/><p><span>The crowd saw that the two of them had stopped, and were somewhat curious about what had happened. Finally, they heard Xue Ling say, \"You are such a great Buddha, and I'm afraid that you won't fit under my temple.\" </span></p><br/><p><span>Everyone was somewhat surprised. Since Chu Han had opened his mouth to say such words, they became even more curious about who had won between the two. </span></p><br/><p><span>“I'll stay. You can treat me as external aid.” The man's voice sounded a little indifferent, and coupled with that kind of aura that seemed to keep people at a distance of a thousand miles away, people did not dare to approach him. His face looked particularly serious when he was expressionless, and those who did not know better would absolutely think that he was a decent and successful man. </span></p><br/><p><span>Before having his ass pinched by him, Xue Ling had also thought he was an iceberg. Now, he was deeply aware of his mistake. The man had always been repressed and bottled up, but the ways in which he was repressed was different in every world… </span></p><br/><p><span>In this world, he turned into a damned rogue! </span></p><br/><p><span>Xue Ling met his gaze, and the man's eyes did not contain any hint of discomfort. He looked towards Xue Ling and opened his mouth to say, “Xun Yu.” </span></p><br/><p><span>Xue Ling looked at him expressionlessly.</span></p><br/><p><span>The man added one more sentence. “My name.” </span></p><br/><p><span>Xue Ling’s face was indifferent. “Oh.”</span></p><br/><p><span>Deng Sini came up and asked, “Boss, should I add him? While you guys stand here, the people after you have no way to come up…\" </span></p><br/><p><span>Xue Ling gave the man a look that was sharp enough to stab, and turned to leave. “Chu Han.” </span></p><br/><p><span>His next sentence floated over from a distance. \"Remember it. That's my name.\" </span></p><br/><p><span>The man carefully tasted this name between his lips and teeth, and rubbed his fingertips. The tenderness and warmth in his eyes was a little terrifying. </span></p><br/><p><span>Deng Sini's expression was muddled. What was the boss up to? A kind of tsundere feeling suddenly rose up…</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}