{"title": "Chapter 117", "id": 117, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-117", "volume_title": "Volume 2", "body": "<h1>Chapter 117</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>9.2 – If you dare to chop me down, I will definitely make sure we perish together! </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; BlueBug</em><span>FdGUiS</span></p><br/><p><span>The cultivation was too vast - countless things happened every day, every month, every year, and it was difficult to have an overview of everything. But, if one were to talk about the recent major events in the cultivation world, apart from the reopening of the Nankai Secret Realm, it would be that the Venerable Crimson Flame had slaughtered someone's entire family again. </span></p><br/><p><span>The word 'again' signified that this was not the first time.</span></p><br/><p>Read more BL at .</p><br/><p><span>Anyone who heard about this matter would not do anything more than sigh, and say that the madman was acting up again. They would not make any moves either. </span></p><br/><p><span>This world's cultivation system followed the traditional path, with nine stages of cultivation: <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-b7535a\">Zhuji, Xindong, Jindan, Yuanying, Chuqiao, Fenshen, Dongxu, Dacheng, and Dujie</span>. There was also a period of Qi Refining that occurred before one reached the Zhuji stage. This world was unlike the traditional ones that normally took place after the golden ages, and the continent was still full of spiritual energy. It was not difficult for everyone to step onto the path of immortality, so cultivators appeared one after another.</span><span>dwzk7M</span></p><br/><p><span>The five great sects and seven major clans were the foundation of <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-cf47f7\">Shikong</span> Continent. They controlled all the resources on this continent, and the occasional bits that leaked out from between their fingers were enough to make those little sects not have to worry about survival for thousands of years. </span></p><br/><p><span>The five great sects were headed by the sword cultivator's Sky Sword Sect, who were obsessed with cultivation and did not care too much about other matters. Every one hundred years, they would recruit new practitioners from the continent, and those who joined began their journey towards immortality. The sect that the protagonist had entered was precisely the Sky Sword Sect. He was a young cultivator, but was able to create his own sword intent early on. Unfortunately, he was overly rigid and easy to break, and was unlucky enough to encounter a bastard master and a group of heartless trash. Later, when he turned his back on the sect, and moved forward again on his own, it was difficult to know what he encountered, but he had a very difficult time.</span></p><br/><p><span>As their name implied, the seven major clans were several great families whose cultivators were all linked together by blood. Each clan had their own secret cultivation methods and their own strengths. Of course, they did not only cultivate their own talents. As long as there were seedlings with good potential, they were also willing to extend their hands to give them resources, which was their way of maintaining good relationships and generating positive karma. </span></p><br/><p><span>In addition to these, Shikong Continent had countless sects and clans, large and small, and the number of practitioners were too many to count. </span><span>90SzEl</span></p><br/><p><span>Nevertheless, whenever the name 'Venerable Crimson Flame' was brought up, not only did everyone recognize it, they were also afraid. </span></p><br/><p>Please visit .</p><br/><p><span>Anyone who saw the third son of Shangdu’s Chi Clan had to greet him as Venerable Crimson Flame. This elder brother was a rarely seen Dacheng stage practitioner. His cultivation was high, his temper fierce, and would explode upon the slightest provocation. And every now and then, he would go into a frenzy.</span></p><br/><p><span>He was famous for having a fire and lightning spiritual root. The two attributes were intertwined, and was not beneficial towards his cultivation, but this person somehow still managed to reach the Dacheng stage while most of the cultivators of the same generation were at Yuanying, or at most, Chuqiao. He was now able to stand on equal footing with the ancestors of Chi Clan.</span></p><br/><p><span>Unfortunately, this third son did not concern himself with his family. Although he was a person of the Chi Clan, he did not live there, and rather served as one of the peak masters of Sky Sword Sect. He ruled over an entire mountain by himself, but he did not have any disciples, and only burnt down the mountain now and then. Every elder who heard his name being mentioned would have a headache for a long time after.</span><span>RFPg6r</span></p><br/><p><span>Such a problematic figure even had a strange hobby - he liked to demonstrate chivalry and justice across the continent. If anyone did anything that threatened society and the news reached his ears, then they might as well go home and wait for death, because even the Emperor would be unable to save them and their family.</span></p><br/><p><span>Due to reasons relating to his spiritual root, Venerable Crimson Flame's temper was uncertain, and he was very difficult to get along with. As soon as he met a stumbling block in his cultivation, his frenzies would begin. Venerable Crimson Flame's illness was not something that could be cured by taking things like pills or medicine; the only thing that could allow him to restore his sanity was blood…</span></p><br/><p><span>Large volumes of blood, and large quantities of people.</span></p><br/><p><span>At that point, he would start going through the little book in his mind; as long as he remembered their name, they would suddenly find themselves faced with a mad Dacheng practitioner with no sense of reason. He frequently did things like exterminating entire clans or sects, so whenever news spread that this great master had slaughtered a family, everyone became very anxious. </span><span>h2uCYV</span></p><br/><p><span>That great master had gone mad again. </span></p><br/><p><span>This was never good news. Anyone who had recently done things to be guilty over would pack up their bags and run away as far as possible. It was best if they could hide in some secret realm, and then come out again thousands of years later. </span></p><br/><p><span>It was not that no one had ever protested against it, but there was no use. Dujie stage cultivators basically no longer involved themselves in worldly matters, and were calmly awaiting their lightning tribulation in order to become immortals. And amongst the Dacheng stage cultivators, there was really nobody who could fight against Venerable Crimson Flame. The Chi Clan had constantly been looking for something that could help the Venerable stabilize his spiritual roots, but it had been fruitless, and many people have already lost hope. </span></p><br/><p><span>Based on the third son's current strength, if he cannot solve the problem of his intermittent illness, he would be unable to reach the Dujie stage, let alone become immortal. But even if he didn't fly up, they couldn't just let him go on recklessly like this. Not everything could be solved by slaughtering by the hundreds.</span><span>AqyoS </span></p><div><div></div></div><br/><p><span>Nankai Secret Realm was not a large-scale secret realm, but it was very famous. It opened every 500 years, and closed every 500 years. This secret realm was famous because it felt different every time one entered. After one entered and cleared as much as they could, the next time they came, they would discover that there were still all kinds of different things waiting for them, as though there was an inexhaustible supply. Many people from the cultivation world liked to go because of this. </span></p><br/><p><span>Of course, the Nankai Secret Realm also had limitations on cultivation. Anyone who was above the Yuanying stage would be unable to enter, so it had always been the main battlefield for young practitioners from all walks of life.</span></p><br/><p><span>Those were the rules, but if a certain someone really wanted to go there, even the limitations set down by ancient powers would be unable to stop him. </span></p><br/><p>Read more BL at .</p><br/><p><span>When Chi Li received the news from her third brother, she was truly stunned for the time it took to brew half a cup of tea before recovering her wits, and getting up to look for their eldest brother.</span><span>XGd2kV</span></p><br/><p><span>The situation for their generation was actually quite embarrassing to speak about. Their father was the leader of their clan, and the two of them could be considered as the younger generation in the family, but because of their abnormally powerful younger brother, the way they were addressed became very awkward. Fortunately, the two of them were good-natured, and had a good enough understanding of their third younger brother, which prevented a rift from forming between the three siblings. The three of them were all considered as very talented within the clan. Only, their third brother stormed forth too quickly, making it seem like the two older siblings had a slower training speed. Even if they were more talented than they were now, their glory would still be covered up.</span></p><br/><p><span>They had the same mother as the Venerable Crimson Flame Chi Lan. Chi Lan was their youngest brother, but for some reason he understood more than they did even from an early age. If it hadn't been for those damned spiritual roots of his, their younger brother would not have been labelled as a madman. The reason he didn't spend his time at home now was because he had no way to control his own temper and behaviour at all. </span></p><br/><p><span>Chi Lan had always been elusive and unpredictable, wandering outside all year round and choosing to live in Sky Sword Sect. For him to suddenly send word back saying that he was planning to enter the Nankai Secret Realm or something, Chi Li found it strange no matter how she looked at it. She brought the letter with her and found their eldest brother, but the reply she received was: \"If he can get in, then let him go.\"</span></p><br/><p><span>“But, eldest brother…\" </span><span>yJCbYn</span></p><br/><p><span>“Second sister, little brother has his own reasons. Regardless of what it was that made him enter the Nankai Secret Realm, you have no way of pulling him out now.\"</span></p><br/><p><span>Chi Li was stunned for a moment, and suddenly realized that she really had no way to get in, because her cultivation level was already too high… </span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>“But…” </span></p><br/><p><span>“Second sister, he has his own sense of propriety.”</span><span>Qz5Ael</span></p><br/><p><span>Chi Li was directly sent back by this sentence from their eldest brother.</span></p><br/><p><span>That's right. Chi Lan had always known his own limits. </span></p><br/><p><span>Although it was rumored outside that his temper was unstable, that he would explode upon the slightest provocation, and that he never considered things before taking action and lived by the words 'kill it and move on', the people in his family knew that nobody in their generation was smarter than Chi Lan. He understood everything easily, and his base nature was not violent. It was only because of his spiritual roots that his personality and temper was easily affected. </span></p><br/><p><span>Following the rise in his cultivation, the potency of his fire and lightning spiritual roots became more and more evident. Because the amount of time that he could stay clear headed was so little that it was pitiful, Chi Lan left home and went to Sky Sword Sect.</span><span>QSLEAR</span></p><br/><p><span>“Perhaps younger brother has found something that can help keep him sane.\" Chi Clan's eldest brother smiled widely as he said this.</span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>Chi Li's expression was odd. She felt that the probability of this happening was extremely low.</span></p><br/><p><span>They had been looking for such a thing for so many years, but there had never been any news. How could it be inside a secret realm that had a fixed opening and closing time? </span></p><br/><p><span>Although the Nankai Secret Realm was not bad, in fact, the cultivators who were attracted by it were limited. The disciples of large clans who had excellent resources wouldn't bother to enter, as the resources they were already being given was much more abundant than what a trip to Nankai Secret Realm could provide.</span><span>6QUEp5</span></p><br/><p><span>And it was precisely because of this situation that the Tree of Enlightenment could safely grow inside the Nankai Secret Realm. </span></p><br/><p><span>In fact, the entire Nankai Secret Realm was the creation of the Tree of Enlightenment. Some treasures were born knowing how to protect themselves, and Nankai Secret Realm was the most suitable place that the Tree of Enlightenment had created in order to grow. The reason it opened every 500 years was so that nobody would notice any peculiarities. Medicinal plants were abundant inside, and when the secret realm was closed, these plants would be nourished by the Tree of Enlightenment's Qi and would naturally grow at a very rapid pace. After the secret realm was opened again after 500 years, there would be all kinds of things available inside once again. This kind of secret realm did not really attract too many eyeballs, so very few people could find the Tree of Enlightenment. </span></p><br/><p><span>Xue Ling: “… Very few?”</span></p><br/><p><span>System: “… At least, there hasn't been anyone in the past tens of thousands of years.\"</span><span>OzDP2t</span></p><br/><p><span>Xue Ling: \"Then explain to me what's going on with that man.\"</span></p><div><div></div></div><br/><p><span>System: “You can't blame me for this. This is definitely host's fault.\"</span></p><br/><p><span>Xue Ling: “…” Sure enough, it still blamed him in the end…</span></p><br/><p><span>As a well-camouflaged Tree of Enlightenment that hadn't even manifested his little shota spirit or even rustled after the secret realm opened, Xue Ling did not feel that he had shown any flaws. He looked exactly like the other trees in the grove, and other than the fact that he had traces of Dao everywhere, there shouldn’t be any issues. </span><span>XqJRVD</span></p><br/><p><span>But that man had been absent-mindedly staring at him for a few days and nights now. </span></p><br/><p><span>Xue Ling did not know what this person meant to do because when he had first arrived, his eyes had been red, and he was basically unconscious. After staring at him stupefied without closing his eyes for three days and three nights, it seemed like he had come around a little.</span></p><br/><p><span>The system perched on top of the tree. Its entire fox body was trembling. Although it did not want to be afraid of this man at all, it could not help being the one who was suppressed. It cried out to its host piteously, \"Lord host, control your man! Can you stop scaring me like that!\" </span></p><br/><p>Story translated by .</p><br/><p><span>In fact, Xue Ling could also guess that this was his own lover, but the problem was that he currently wasn't even a person. He was just a tree - what could he do? He couldn't do anything at all! In these three days, he only had to think about how his man had fallen in love at first sight with a tree, and he would inexplicably want to laugh! </span><span>AfXJNZ</span></p><br/><p><span>Well, his bad taste seemed to be getting worse from world to world… </span></p><br/><p><span>Xue Ling had spent the past three days ignoring the man who was fiercely staring at a tree. On the fourth day, the man seemed to have finally made up his mind, and was planning to do something. </span></p><br/><p><span>Xue Ling lazily waited to see what kind of move he would make. </span></p><br/><p><span>As a result, a sword appeared in the man's hand as soon as he stood up. </span><span>8BeqGi</span></p><br/><p><span>A long sword that was burning with fire and interlaced with lightning. </span></p><br/><p><span>When the sword came out of its sheath, the blue sky in Nankai Secret Realm turned dark for a moment because of the sword's power. Thunder rumbled everywhere, and Xue Ling could clearly feel the power that the man was gathering in the sword. </span></p><br/><p>Thank you for reading our translation!</p><br/><p><span>Between the sparks from the lightning and the glow from the fire, he was suddenly struck by inspiration, and understood what the man had been struggling with these past few days! </span></p><br/><p><span>This bastard was planning to cut him down!!! </span><span>vcml74</span></p><br/><p><span>System: “Looks like it’s really going to be mutual love and slaughter this time.\" </span></p><br/><p><span>Xue Ling had no time to shout at the system to shut up. If he did not make a move now, he would be nothing but a piece of broken wood later on. There were tens of thousands of Daos on his body. Based on Xue Ling's means, he was definitely unlike his predecessor, who did not have any means with which to fight back.</span></p><br/><p><span>The skies in the secret realm had been overcast for a while, and these clouds seemed to be crushing the sky. Many young practitioners did not understand what the situation was, but their intuition warned them that it was dangerous. </span></p><br/><p><span>The entire secret realm was covered and enclosed by a mysterious force, but at this moment, endless greenery bloomed in front of the man's face. </span><span>8chkjN</span></p><br/><p><span>Primitive branches sprang out as green leaves sprouted rapidly. They swallowed up the fire and sparks that were jumping off the sword, and swayed slowly in the breeze.</span></p><br/><p>Please visit .</p><br/><p><span>Following the path along which the greenery was growing, the man's line of sight entered the grove of trees and met with the tree that he was about to cut down. </span></p><br/><p><span>The tree at this moment was completely different from its previous mediocrity. It gave off an emerald green glow, and a jade white light was gathering in front of the tree. </span></p><br/><p><span>He didn't know why, but in that moment, a feeling that could only be called anticipation suddenly rose up in Chi Lan. </span><span>TpckfB</span></p><br/><p><span>Then, he watched as the bright, jade-white light coalesced into a cute little boy wearing a green robe. </span></p><br/><p><span>The Venerable Crimson Flame that inexplicably felt like he had been tricked: \"…\"</span></p><br/><p><span>He didn't know why, but his heart was suddenly hurting…</span></p><br/><p><span>The child was very beautiful. He had a little bit of baby fat on his face, and because he had not yet grown up, that pair of fox eyes that were currently looking left and right appeared rather innocent and naïve. The tear moles under the corners of his eyes made his entire person seem cold, but especially when he pursed his lips together to glare at Chi Lan, it made his heart thump wildly. </span><span>X5ZeJd</span></p><br/><p><span>He had a head of long black hair, the ends of which were tied together with a pale green ribbon. A shirt that was the same color as his ribbon covered his body, and although he was just standing there, Chi Lan felt his own tense nerves relax completely. </span></p><br/><p><span>This was exactly why he had stayed here for three days. This tree could make his reason and consciousness return so that he was no longer dominated by his spiritual roots…</span></p><br/><p><span>The sapling glared at him as though disgusted with his behaviour of cutting down trees on a whim. When he was angry, his little cheeks were puffed up with rage, and it was utterly adorable. The little sapling threatened him like this: \"If you dare to chop me down, I will definitely make sure we perish together!\"</span></p><hr/><br/><p><em>in case you guys missed this in the comments for the previous chapter, <strong>Poppy</strong> drew a rock!ML and tree!XL~</em><span>D9BzGa</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}