{"title": "Chapter 124", "id": 124, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-124", "volume_title": "Volume 2", "body": "<h1>Chapter 124</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>9.9 – That's my name</span></p><br/><p><em>translator: xiin</em><em>editor: alamerysl</em></p><br/><p><span>It was a very dangerous thing to fall into Qi deviation on the path of cultivation. One wrong step and they would fall into the devil's path, and lose their life. Every step was very dangerous. </span></p><br/><p><span>Fortunately, his Master was very obedient and well-behaved after he entered Qi deviation. He was very quiet as long as he could see Xue Ling, and his pair of slightly red eyes were wide open as they locked onto him. He didn't make noise, didn't make a mess, and didn't try to cut down trees.</span></p><br/><p><span>Xue Ling remained within his line of sight, and the two of them looked at each other for a long time. Finally, he couldn't bear the weird atmosphere anymore, and asked the system that was squatting beside him looking completely at ease and comfortable: \"What should we do now?” </span></p><br/><p><span>The system looked at its host in some surprise. Its host had always had his own opinions. For him to reach the point where he was asking it what to do, this was… </span></p><br/><p><span>“You've gone overboard.” The system learned from Xue Ling's usual lazy tone, and there was a bit of mocking intent contained in its voice. \"I told you long ago that you should give him some immunization. Otherwise, sooner or later you would choke him up to the point where something goes wrong. He went into Qi deviation just by learning that there was another person on Still Peak. If he finds out that you treat Yu Shaofeng as a son, won't he directly turn into a devil?\" </span></p><br/><p><span>Xue Ling rolled his eyes. Faced with his system's tone, he also had no intention of being polite. \"You're the one encouraging me behind the scenes. When I did this, you were clearly waving a flag and shouting in support.\"</span></p><br/><p><span>System: “…” Well yeah, as long as the man was unhappy, it would be happy, so it had indeed been waving a flag and cheering. </span></p><br/><p><span>“Based on his current appearance, it looks like he's trapped in his mind. But his power level has not changed, and I can't leave his sight. It’s really quite difficult to deal with.”</span></p><br/><p><span>“No one wants to go into Qi deviation and fall into the devil's path, so let’s calm down and think about what to do to fix this.”</span></p><br/><p><span>“Don’t I look calm enough?” Xue Ling had never been more calm from beginning to end. He has experienced so many worlds that fewer and fewer things can surprise him. Hadn't the man just gone mad out of jealousy? It was really something that this repressed man would do, and wasn't surprising at all. \"In the cultivation world, there are usually two ways to deal with Qi deviation. One is to wait for it to ease up on its own, and the other is to feed him medicine.\" </span></p><br/><p><span>“It's not like you don't know what to do. If you’re sick, you should take medicine. Just give him some pills.\"</span></p><br/><p><span>It was obvious that the system didn't care about this man's life or death. Xue Ling couldn't just do that - things like Qi deviation were usually caused by an unsettled heart, coupled with paranoia, which led to a confused consciousness.</span></p><br/><p><span>The man had never been paranoid before, so even when his consciousness was being eroded by his spiritual root, he had not entered Qi deviation. It was only now that Xue Ling was here that he began to be restless all the time. </span></p><br/><p><span>After this point had been made clear, the system helplessly asked its host: \"The source of his paranoia can only be you, and it'll be fine if he can obtain you or something. What are you going to do now? Go up and let him do you?\"</span></p><br/><p><span>Xue Ling tilted his head and thought about it, then asked the system: \"Isn't this the traditional route for dogblood novels? Master goes into Qi deviation and tops the disciple, and forgets about this matter after they wake up while the disciple endured the humiliation and had to carry the burden alone. After that, he distanced himself from his Master so that he would not have to go back to that cold and cruel time in his memories. He wanted to have a normal life, but on the day he was about to start a new life, his Master remembered what had happened that day and all that they had done together.\" </span></p><br/><p><span>System: “Then there’s little black room play. I know! If you want to try that, I can find you a prisoner's body in the next world.\" </span></p><br/><p><span>Xue Ling rolled his eyes at the system: “If I'm really imprisoned, I'll probably pull out all your fur and then destroy the world to start over.\" </span></p><br/><p><span>System: “…” Did it have nothing to threaten its host with at all? … Why did it feel like being a system was an increasingly sorrowful thing… </span></p><br/><p><span>“Why do you have such trivial things in your head?” Xue Ling knocked on the system's head and laughed as he said, \"How can you really believe that I really have to do those kinds of things with him to wake him up?\"</span></p><br/><p><span>“Probably because I've been influenced by you pair of dogs after so many worlds.\" </span></p><br/><p><span class=\"jum\">“Tsk.” Xue Ling did not bother with the system who had clearly seen through the fetters of the world and was a lonely single dog that got no love. He turned and sat down beside the man. \"I wonder how far I have to go to wake him up?\"</span></p><br/><p><span class=\"jum\">“The full set.”</span></p><br/><p><span>Xue Ling: “…” The system has already broken down. It was pitiful hearing it speak in this kind of loveless tone. </span></p><div><div></div></div><br/><p><span>As long as Xue Ling did not leave his sight, Chi Lan would not make any unnecessary moves. In order to measure out the distance that he could leave between the two of them, Xue Ling even did some tests. </span></p><br/><p><span>He spent the morning testing it out, but Chi Lan seemed to be getting worse from all the excitement, so Xue Ling finally had to stop… He realized that he probably wouldn't be able to leave the courtyard for a while.</span></p><br/><p><span>He had originally been naïve enough to think that he could make something like a stand-in, sticking his leaves on the body and infusing it with his Qi to fool Chi Lan, but Chi Lan had only gone into Qi deviation and lost his rationality, and had not become a fool, so he held on tightly to Xue Ling and refused to let go. Xue Ling tried many different methods, but had no way to get away from him. This gave Xue Ling a headache, and he finally had no energy left to mess around with him and could only let the other party tug at his sleeve with a look of grievance on his face. </span></p><br/><p><span>The system watched the whole process and finally told its host, “Give up. Stop struggling and use your body to wake up his mind!”</span></p><br/><p><span>Xue Ling answered it very simply: “Get lost!” </span></p><br/><p><span>Although his answer had been explosive and domineering, Xue Ling had actually thought about this solution, but he was held back by moral integrity.</span></p><br/><p><span>The relationship between him and Chi Lan in this world was not at the point where he could take the initiative to devotedly go ahead and do it. If things went on like this, he would be going OOC.</span></p><br/><p><span>The system had already been left outside. After it turned dark, Xue Ling brought his Master, who still wasn't in a good state, into the room and tried to save him once again. </span></p><br/><p><span>Compared with this morning, Chi Lan seemed to be a little better. At least, the gaze he used to look at Xue Ling was no longer like a child who was eyeing their own possession. There were some additional, unusual emotions that were suppressed with great effort. He seemed to be hesitating, bewildered, and his confusion was like that of a child. </span></p><br/><p><span>Xue Ling’s heart softened when he saw this kind of gaze. </span></p><br/><p><span>Exactly. Even if he talked outrageously with the system and had even more fantastical thoughts, when he was faced with this man, he would still be completely influenced by him. Just like how he would break out of the character he had designed for himself in the last world because of the man's words of love, in this world, his heart once again melted when he was faced with this kind of gaze. </span></p><br/><p><span>But he couldn't repeat the same mistake again. Xue Ling suppressed his desire to push the other party down and bite him from head to toe. Instead, he first held Chi Lan's hand and smiled as he told him, \"Promise me you'll calm down.\"</span></p><br/><p><span>Chi Lan stared at him for a long time, and finally nodded reluctantly. </span></p><br/><p><span>He clutched Xue Ling’s hand tightly and looked at him with unhappily: “You brought strangers into Still Peak…\"</span></p><br/><p><span>Xue Ling thought to himself that since he still remembered this matter, it meant that he hadn't become completely foolish. Although his heart was full of curses, Xue Ling still had a soft look on his face, and his tone was gentle as he said: “That’s not a stranger, that’s your disciple.\"</span></p><br/><p><span>\"You are my only disciple.\"</span></p><br/><p><span>“Fine then, he can be my disciple.\"</span></p><br/><p><span>“You are mine. You're not allowed to take in a disciple.” </span></p><br/><p><span>Xue Ling closed his eyes and felt that it was a good thing the system hadn't come in. Otherwise, it would probably be laughing for the next two or three worlds over the man's childishness. Although Xue Ling felt a little bad, once he recalled that this was a disaster that he had brought about himself, and it was the first time he had ever seen the man show such an appearance, he inexplicably found it cute. </span></p><br/><p><span>After all, regardless of which world it was, the man never acted spoiled with him when his mind was in a normal state.</span></p><br/><p><span>Now that it was happening, why did he feel a little turned on… </span></p><br/><p><span>“Me having a disciple and me being yours are to separate things. In fact, there is no conflict~\" </span></p><br/><p><span>“…” There seemed to be a little truth in this sentence. The man was silent for a while and then said, “I still don’t really believe it.” </span></p><br/><p><span>Xue Ling: “…”</span></p><br/><p><span>“But if you kiss me… I might believe it.”</span></p><br/><p><span>Xue Ling: “…” </span></p><br/><p><span>Looking at those eyes that were full of expectation, Xue Ling felt that he had no way to refuse. Although hearing such a proposal come out of Chi Lan's mouth was really unbelievable and silly, the fact that he was really willing to give him a kiss made him even sillier!</span></p><br/><p><span>But looking at those shining eyes… </span></p><br/><p><span>Who could refuse… </span></p><br/><p><span>Xue Ling tried to convince himself that it was like rewarding a child with a kiss on the forehead, but as soon as his lips touched his forehead, he was dragged into Chi Lan's arms. In his panic, his gaze met with eyes that were full of the color of blood. He was shocked for a moment, and then his entire body was tightly imprisoned within Chi Lan's embrace.</span></p><div><div></div></div><br/><p><span>His personality was clearly like that of an ice cube, but his body was terribly hot. Xue Ling was tightly stuck to him, and felt like his entire body was about to be baked through. </span></p><br/><p><span>Well, this situation couldn't be better. Who told him to tell the system with so much assurance that he could absolutely solve Chi Lan's problem without sacrificing his looks and body… Now, it seemed that he was still too young and naïve. This man didn't turn into a good, obedient baby when he went into Qi deviation at all. How was he well-behaved? It had all been an act!</span></p><br/><p><span>Xue Ling was firmly held in Chi Lan's arms, and locked into place so he couldn't turn his head back to look.</span></p><br/><p><span>He could feel some warmth on his earlobes. As a person who has already experienced many battles, he guessed that the man behind him had probably taken his earlobe into his mouth…</span></p><br/><p><span>And as a person who has already experienced many battles, Xue Ling was also very clear on what would be happening next…</span></p><br/><p><span>So, could he pretend to be a lovely white lotus flower in this world? One who had been forced before they even fell in love with the other party? … Hm. The plot was a little strange, but for some reason he felt like he would be able to play it perfectly… pretending to be reluctant or something like that.</span></p><br/><p><span>“Baby, I only have this little bit of time. Are you sure you want to be distracted for this?\" The man’s deep voice came from behind him. It was a simple sentence, but it made all the messy thoughts in Xue Ling's brain disperse and fly away. </span></p><br/><p><span>He was surprised, and wanted to turn his head to see the person behind him, but found his head thoroughly held in place.</span></p><br/><p><span>“You!” </span></p><br/><p><span>The pleasant sound of the man's low laughter rang out near his ear. He kissed the nape of Xue Ling's neck and said, \"Taking advantage of the 'Qi deviation', I can restore my memory for a little while.\" </span></p><br/><p><span>Xue Ling’s eyes widened. His heart was almost scared into flight by this sudden surprise. </span></p><br/><p><span>At this moment, the man behind him, holding him, was the man who shared the same feelings as him and whom he had passed through countless worlds together with. It was not Chi Lan, and was not any one of those people, but the soul who had been behind all of them.</span></p><br/><p><span>“How did you…”</span></p><br/><p><span>“Shh.” The man kissed his ear again, then reached out and removed his belt. “This world is more advanced, so I can release a tiny bit of my spiritual power. It's a rare opportunity for us to have a proper chat.\" </span></p><br/><p><span>Xue Ling nodded and said, “Okay, then let me go first.”</span></p><br/><p><span>The man chuckled, “Doing it doesn’t prevent us from chatting…”</span></p><br/><p><span>Xue Ling: “…” That made sense, and was impossible to refute.</span></p><br/><p><span>While he was thinking this, his outer robes had already been taken off, and the man's kiss once again fell on his nape. \"Listen carefully and remember what I said. In this world, your two tails are closely related to the protagonist. Don’t restrain him, and let him more or less follow the plot's original development path. As long as he goes out more and travels around, the plot will show up and stick to his body.\" </span></p><br/><p><span>Xue Ling blinked and said in surprise, “How do you know about my tails?” </span></p><br/><p><span>The man’s hand had already unfastened his underwear. His hand was a little hot, and his touch inexplicably made Xue Ling's body relax.</span></p><br/><p><span>“I know a lot. When the shackles on your memory have been completely opened, baby, you will remember the exact nature of our relationship.\" </span></p><br/><p><span>Xue Ling's head was full of fog. At this moment, he felt that his worldview might have just been subverted.</span></p><br/><p><span>“You weren't really naive enough to think that a powerless soul would be able to reincarnate through so many worlds with you?\"</span></p><br/><p><span>“…” He had really believed it…</span></p><br/><p><span>The man’s voice held a hint of pleasure, and his kisses landed on Xue Ling's throat. \"Work hard, baby. I believe that you'll remember everything very soon.\"</span></p><br/><p><span>“Why don’t you tell me now…” </span></p><br/><p><span>“Because right now, we're a little busy.\" </span></p><br/><p><span>Xue Ling's head was turned by the other party even as he spoke. The man's next kiss landed on his mouth, but his eyes were still covered. \"Do you remember the man called Su Xuanyan?”</span></p><br/><p><span>Xue Ling felt very good from the kiss, and a reluctant, confused response sounded from deep in his throat. </span></p><br/><p><span>“Remember that face.” </span></p><br/><p><span>“That's the person you love.” The man thought about it, then added another sentence, his voice incredibly soft. “That’s my name.”</span></p><br/><p><span>“Wu…” Xue Ling seemed to almost be able to see that man who smiled so very gently…</span></p><hr/><br/><p><em>*surprise!* (okay maybe not so much…) but we have plot! and hand holding!</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}