{"title": "Chapter 125", "id": 125, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-125", "volume_title": "Volume 2", "body": "<h1>Chapter 125</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>9.10 – Shut up. I only accepted your martial brother as a disciple</strong></p><br/><p><em>translator: xiin</em><em>editor: alamerysl</em></p><br/><p><span>When the system saw its host again, the other party’s expression was not good at all.</span></p><br/><p><span>Uh… Although his cheeks were red, his eyes were full of spring, and anyone could tell from a glance that certain things had happened, his expression was really dark. His eyebrows were wrinkled, and based on the system's understanding of its host, it was obvious that its host was trying to pick a fight!</span></p><br/><p><span>“System, I think you need to give me an explanation.\" Xue Ling tapped his fingers against the table. Judging from the frequency and movement of his tapping, the system thought that it had likely done or exposed something extraordinary.</span></p><br/><p><span>“Er… Explain what?\" It didn't seem to have hidden anything from his host…</span></p><br/><p><span>“Explain why the special soul you mentioned that could follow me through so many worlds, is so different from what the man himself is telling me?\" Xue Ling was smiling widely, but one could tell from glance that he was trying to extort a confession.</span></p><br/><p><span>The system felt that it might not be able to keep all the fur on its body today. \"Er… I don't know what host is trying to say…\"</span></p><br/><p><span>“He said he has been following me from the very beginning, and his memories had to be sealed in every world because his soul was too strong. Otherwise, the worlds would consider him as an intruder and expel him.\" Xue Ling gently stroked the system's white fur. \"He obviously knew me right from the start, and his purpose for crossing through these worlds is me. Why did you deceive me?”</span></p><br/><p><span>The system blinked its big, innocent eyes, hoping that its host would see some similarities between them and be a little gentler when he finally handed down his punishment. “Did his words differ from what I said before?”</span></p><br/><p><span>“You never mentioned that he had a clear understanding of the matter.” Xue Ling recalled that the words the system had said before were exactly the same as the man's, but the meaning they expressed were totally different. The system had also obviously exaggerated the role it had played - it had never brought the man's soul with them at all. That person would follow him through every world simply because he cared about him. </span></p><br/><p><span>What made it worse was that Xue Ling still didn't know why the man had come along back then when there were no feelings between them. And it was this elusive reason that Xue Ling couldn't grasp that made him so upset now.</span></p><br/><p><span>The system trembled, and it looked extremely wronged: \"I wasn't willing to say those words either… I was also threatened… Your man is so strong… I tremble in fear just from the aura his soul emanates.\"</span></p><br/><p><span>“As a young, fledgling and lovely little system, I had no choice but to sell out my host and then pacify you later in the face of such cruel threats…\" </span></p><br/><p><span>Xue Ling sneered and said: “After I've dealt with him, I'll settle things with you one by one.\"</span></p><br/><p><span>The system looked at the motley of marks on its host's neck, and spoke aggrievedly, \"Haven't you guys settled the accounts between you? … Haven't you already done it…\" </span></p><br/><p><span>Xue Ling stared coldly at his system.</span></p><br/><p><span>“Okay, okay. For the next world, I'll pick one where you are powerful enough to use strength and destroy his world… Will you feel better then…?\" </span></p><br/><p><span class=\"jum\">Xue Ling snorted coldly.</span></p><br/><p><span class=\"jum\">“In the next world, I can intervene so that the body he chooses is a scum-type character. It'll give you a reason to bully him to death. Is that enough…\"</span></p><br/><p><span class=\"jum\">Xue Ling reached out and touched the system's head. His actions were very gentle, but the system still couldn’t help shivering. It always felt like it could sense a lot of malice coming from those hands…</span></p><br/><p><span>“Fine then, I can guarantee that he'll be a scum that is not related to your task at all. If you like, you can happily go and bully him to death, or you can have a happy ending with him if you want. I don't want to offend that one!” </span></p><br/><p><span>Xue Ling was finally satisfied. He asked, “Do you know who he is?”</span></p><br/><p><span>The system really didn't have anything to offer on this point. It was really innocent, and didn't know anything! “I don’t know… He and the Ten Directions World should know each other… Otherwise, he wouldn't be able to cross through these worlds with us. But as far as his strength is concerned, he and the Ten Directions World are at the same level, and he might even be stronger than the boss…” </span></p><br/><p><span>“… It looks like I need to get my tails back as soon as possible.” Xue Ling didn’t like having things concealed from him at all. He loved the man, so he wouldn't say too much about him, but the man's performance and his words all showed that they had been acquainted before, and had some sort of relationship. And that relationship had to be quite close. Otherwise, with that man's personality, he would not be concerned about his life or death in these worlds. Nor would he worry to the point where he follows him through every world…</span></p><br/><p><span>Oh. Towards the latter part of their journey, his purpose in following him may have changed.</span></p><div><div></div></div><br/><p><span>Why didn’t he slap him to death last night when he kissed him? … He even ended up being taken advantage of. Just thinking about it made him unhappy. </span></p><br/><p><span>“Lord host…” The system saw that Xue Ling's expression had finally returned to normal and hurriedly changed the topic. \"How is Chi Lan's situation now?\"</span></p><br/><p><span>Xue Ling sneered and said, “Of course he's sleeping after having gotten his fill. He should be fine after he wakes up. If he goes into Qi deviation again, I definitely won't pay any attention to him and just stick a bunch of leaves on his head.\" </span></p><br/><p><span>The system's lips twitched. It felt that its host was speaking empty words after the deed - if he really meant it, why didn't he do it this time?</span></p><br/><p><span>\"He probably won't remember this matter when he wakes up.\" Xue Ling began to think about what to do next.</span></p><br/><p><span>Su Xuanyan had told him that he would only be able to obtain information about his tail if he allowed the protagonist to go along with the main plotline. In that case, his original idea of shutting Yu Shaofeng in Still Peak until he flew up and became a true immortal had to be rejected.</span></p><br/><p><span>Now, it turned into a situation where he had to bring along a kid and run around everywhere.</span></p><br/><p><span>“Well, it should be a great feeling to bring along our own team and clear out all the secret realms.\" Xue Ling suddenly clapped his hands.</span></p><br/><p><span>The system felt like he was coming up with one plot after another. \"I had thought you would send Yu Shaofeng to Ancestor Thunderbolt's side…\"</span></p><br/><p><span>“How could that be? I said this long ago. Since he's entered my Still Peak, I will absolutely never let him be bullied. He'll definitely never go through the routine of getting bullied miserably. I already said that I would make him become the luckiest child in the world.\"</span></p><br/><p><span>“Well then. As long as you're having fun.\"</span></p><br/><p><span>“I’m going to ask elder martial brother tomorrow if any activities that the inner disciples can participate in are coming up.\" </span></p><br/><p><span>“According to the plot progression of the original novel, the grand competition between the major factions is about to start. In the inter-sect competition, other than obtaining the normal first prize reward, the winner would also obtain a piece of the map that led to Sishui Secret Realm.\" The system still had the original plot in its hands. Although the story had been abandoned, plenty of descriptions and world-building had already occurred in the early stages. The plot of this novel was completed up until the point where Yu Shaofeng had been kicked out of the sect and driven away. </span></p><br/><p><span>“Speaking of which, have you noticed that in the outline given by the author, Chi Lan is the last boss? And he even fell into the devil's path… He became the number one demonic path cultivator, and finally flew up and entered the devil world…\" </span></p><br/><p><span>“That is what would have happened to Chi Lan if it weren't for me.\" Xue Ling rubbed his chin and laughed. \"This time, I won't give him the chance to fall into the devil's path. Anyone who stands the protagonist's way must give way.” </span></p><br/><p><span>The system felt that Chi Lan's life was a little tough. Or perhaps its host wouldn't be too cruel to him before he stepped onto the devil's path… It was totally different now. As long as its host had not finished being angry, Chi Lan would probably be given the cold treatment for a while.</span></p><br/><p><span>The next day, Chi Lan returned to normal. He was still a little confused when he woke up, but after a period of meditation, he realized that he had gone mad for some strange reasons yesterday. Although he didn’t know why he suddenly got better, he knew that the demon in his mind had gotten deeper…</span></p><br/><p><span>Chi Lan was embarrassed when Xue Ling knocked at the door and came in – he did not dare to look at his disciple at all now. As soon as he saw him, his mind would be full of his own dark, dirty thoughts towards him. As his master, this was really too much of a challenge towards the bottom line of his own morality.</span></p><br/><p><span>So, he could only suppress his own **, and act calm on the surface as he spoke to Xue Ling. \"Yesterday, your Master…\"</span></p><br/><p><span>Xue Ling smiled widely as he glanced over, and immediately opened his mouth to say, \"I secretly accepted a disciple for Master without permission. It's normal for Master to be angry. Only, younger martial brother is innocent, and I hope that Master will not drive him out of Still Peak.\" </span></p><br/><p><span>Having reached this point, Chi Lan shuttered up his expression as he heard these words. \"Since you know you've done wrong, there is no way to avoid punishment. Your master sentences you to face the wall for three months. I hope this will remind you to be more careful.\"</span></p><br/><p><span>“But… Master told me to get lost yesterday, and to no longer stay at Still Peak… So I have already spoken with elder martial brother and planned to participate in this time's inter-sect competition. We were going to set out tomorrow… I won't show up in front of Master for three months. Can I skip the wall punishment?\"</span></p><br/><p><span>Bringing up yesterday's events gave Chi Lan a headache. He could not remember what he had done yesterday, but he subconsciously felt guilty towards Xue Ling. It had already required great willpower to sentence him to face the wall. Now, when he heard Xue Ling's request, he thoughtlessly agreed. But, as a Master, one still had to have their own dignity. Xue Ling's behaviour of standing in for him and accepting another disciple was really too much, and Chi Lan's unhappiness with this behaviour and his extra disciple stemmed from the heart. \"You can go, but you can't skip the punishment.\"</span></p><div><div></div></div><br/><p><span>Xue Ling nodded obediently. \"Your disciple understands.\" </span></p><br/><p><span>After Xue Ling went out, Chi Lan sat in bed, thinking hard. But no matter what, he just couldn't recall what exactly had happened yesterday. Situations where cultivators stepped out of Qi deviation within a day were rare, and before he woke up, he had even suspected that he would fall directly into the devil's path.</span></p><br/><p><span>To be honest, he thought that falling onto the devil's path wouldn't be bad at all. At least that way he would be able to do whatever he wanted to his little disciple. </span></p><br/><p><span>As soon as the thought surfaced, and he realized these ideas still existed in his heart, Chi Lan felt ashamed of his own thoughts.</span></p><br/><p><span>But in reality, he didn't have much time to reflect on these dirty thoughts. Since Xue Ling had accepted Yu Shaofeng in his name in front of so many people, then Yu Shaofeng was also his, Chi Lan's, disciple in name.</span></p><br/><p><span>Chi Lan could be kind to Xue Ling and indulge him in all things, but when he faced Yu Shaofeng, his expression was not nearly as good. </span></p><br/><p><span>It was the first time Yu Shaofeng had been summoned by his master. In fact, he was a little baffled. After hiding in his room all day holding the leaf given to him by his martial brother, his Master then came out of closed cultivation, and summoned him right away. </span></p><br/><p><span>Although his elder martial brother was smiling as he comforted him, Yu Shaofeng was inexplicably very anxious, and when he finally saw his Master, his intuition told him that he had been correct to be panicked and worried.</span></p><br/><p><span>For no other reason than because Chi Lan's aura was too powerful. It was the first time Yu Shaofeng had encountered a powerhouse on this level, and it was a powerhouse who hadn't suppressed his aura at all. The very first time they met, he was directly pressured into kneeling by the force of that aura.</span></p><br/><p><span>“Unlike your martial brother, you come from the mortal world, so there are some things that I need to teach you.” Chi Lan’s voice was as cold as ice. Yu Shaofeng had been forced to kneel and he basically had no way to lift up his head and see his face. \"There is a saying in the mortal world that in one's life, they need to bow to the heavens, to the earth, and to their parents. But in the world of cultivation, there is no such rule. You must remember that you are a person of Still Peak. Under this sky, there is nobody that can make you kneel. This is the last time you will kneel, and I will be the last person you kneel to. From today onwards, even if you are crushed to pieces, you are not allowed to kneel.\" </span></p><br/><p><span>“Yes. Your disciple will obey.” </span></p><br/><p><span>“Also.\" Chi Lan gestured with his hand, and took back his aura. Yu Shaofeng immediately splayed out onto the ground, gasping for breath, his eyes red. \"You were brought back by your martial brother. He recognizes you, but I do not. You can carry my name when you're outside, but in front of me, you don't deserve to call me Master.\" </span></p><br/><p><span>Yu Shaofeng's hands were clenched tightly.</span></p><br/><p><span>“If you want me to recognize you, then prove that your martial brother's expectations were not wrong, and become strong for me to see.\" </span></p><br/><p><span>“Your disciple will obey.” Yu Shaofeng lifted his head and looked up at the man standing in front of him. After looking up, his thoughts drifted for a moment and he began to doubt his life… He clearly wasn't bad looking… Why did he feel like he had lowered the appearance value of Still Peak?</span></p><br/><p><span>“You are a mutated lightning spiritual root. The abilities that I cultivate are not suitable for you.\" A fingertip pressed against Yu Shaofeng's forehead, and a volume of abilities was carved directly into his soul. “I passed on to you a formula for lightning spiritual root cultivation. When you have cultivated it to its peak, you will be able to destroy the heaven and earth, and forge your own path, doing whatever you want and ignoring all rules. From now on, it's all up to you.\"</span></p><br/><p><span>“Disciple thanks Master.\" </span></p><br/><p><span>“Shut up. I only accepted your martial brother as a disciple.\"</span></p><br/><p><span>“… Yes… ” He had already admitted that Xue Ling was his martial brother, why wouldn't he admit that he was his disciple?</span></p><br/><p><span>He didn't know if it was an illusion, but Yu Shaofeng always had the feeling that their Master's face would soften a lot whenever he mentioned his martial brother.</span></p><br/><p><span>Although his Master's eyes were full of dislike when they were turned towards him, Yu Shaofeng also had not expected his Master to like himself. It was already the best possible situation if he was willing to teach him. He actually hadn't been driven out of Still Peak! </span></p><br/><p><span>He found that his luck had really turned good ever since he embarked on the journey of cultivation.~</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}