{"title": "Chapter 130", "id": 130, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-130", "volume_title": "Volume 2", "body": "<h1>Chapter 130</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>9.15 – How much longer did he have to be haunted by those illusions for? </strong></p><br/><p><em>translator: xiin</em><em>editor: bear, alamerysl</em></p><br/><p><span>They obtained a great harvest from the Sishui Secret Realm. Xue Ling was only responsible for following behind the two. He didn't need to make a move during their fights because Yu Shaofeng believed that this was a good opportunity for him and Chi Jian to temper themselves, and had asked his martial brother not to make a move unless necessary. </span></p><br/><p><span>The group of three wandered through all the areas marked on the map. Xue Ling found the item that could change Yu Shaofeng's spiritual roots, then acted as dao protector alongside Chi Jian and had Yu Shaofeng absorb it on the spot. If Yu Shaofeng planned to go and temper himself outside with Chi Jian, it was necessary for him to improve his strength. </span></p><br/><p><span>Because Yu Shaofeng absorbed this treasure, his spiritual roots mutated further and his ability to cause damage became even stronger. It also helped him gain better control over his spiritual root.</span></p><br/><p><span>Yu Shaofeng always kept his martial brother's help in mind. It seemed as though his martial brother was always giving him all the benefits. He even entered closed door cultivation to make his sword for him after he finished absorbing the treasure.</span></p><br/><p><span>“Don't you think that my elder martial brother is treating me like a child?\" Because his strength had improved, Yu Shaofeng had grown taller again. He took advantage of Xue Ling going into closed door cultivation and leaned over towards Chi Jian, his voice very, very low, as though whispering to him. \"I feel like he treats me like a child that he's raising.\"</span></p><br/><p><span>Chi Jian stretched out his hand and rubbed his head, not wanting to remind him that his current personality was not so different from that of a child, and that only a child would concern themselves with whether or not someone else was treating them like a child. \"Think about it. You have such a good relationship with your martial brother. Of course he would want you to be recognized by your Master. Isn't that why he's been trying to help you grow stronger?\"</span></p><br/><p><span>When it was explained to Yu Shaofeng in this way, it seemed like everything suddenly became clear to him. His eyes brightened as though they were filled with stars. “You’re right, in order to get the Master’s recognition as soon as possible, I should work even harder.”</span></p><br/><p><span>Chi Jian watched with relief as he sat down and began to consolidate his newly ascended cultivation. No wonder his martial brother liked the feeling of pampering him so much. When this child was happy, he also inexplicably felt his heart turn warm… </span></p><br/><p><span>It was a strange sensation, but he enjoyed it.</span></p><br/><p><span>Half a month later, Xue Ling emerged and handed Yu Shaofeng a long sword that looked simple from the surface but was able to withstand Yu Shaofeng's growing thunder and lightning powers. This was a weapon that would be able to grow up with Yu Shaofeng. If he cultivated and took care of it for a long time, it might even develop a sword spirit someday in the future.</span></p><br/><p><span>Yu Shaofeng was crazily happy about his new sword. He paired up with Chi Jian and they used the wild animals in the secret realm to baptise his new sword and practice their two-sword combination. His eyes were as bright as crystals every day, and he always looked extremely excited. </span></p><br/><p><span>But the excitement disappeared as they left the secret realm and he was about to separate from Xue Ling.</span></p><br/><p><span>Like a child being sent to kindergarten who knew that his parents were leaving soon, when Yu Shaofeng looked at Xue Ling, his eyes were wet, and he looked like an ignorant little baby deer that knew nothing and was unwilling to give up his keeper…</span></p><br/><p><span>The system helplessly covered up its face. It had really been living the leisurely life for too long. Wasn't there some sort of contradiction if it labelled the protagonist as an ignorant baby deer? </span></p><br/><p><span>Wait a minute, it seemed that there was nothing wrong with that. The child had been raised so well by Xue Ling, and yet was suddenly told that he needed to leave his martial brother. It was not surprising that he was full of reluctance. The grievance in his eyes was about to spill over, but it was unmanly to cry, and he had not yet reached the stage where he would tear up because he couldn't bear to leave.</span></p><br/><p><span>“Be good. There will always be first times in life. Your martial brother can't accompany you for the rest of your path, and it's not like I'm about to fly up and become an immortal and you'll never be able to see me again. I'm only going back to face the wall.\" </span></p><br/><p><span class=\"jum\">“Martial brother, are you sure you’re just going to do wall punishment? Master won't do anything bad to you, right…\"</span></p><br/><p><span class=\"jum\">System: “Ah, if 'anything bad' means to shut you up in a little black room, there really is that possibility.\"</span></p><br/><p><span class=\"jum\">Xue Ling stabbed the system a thousand times in his heart, then smiled and told his younger martial brother, \"No, nothing will happen. Compared to you, Master still likes me a little more, so he won't bear to do anything to this only disciple of his.\"</span></p><br/><p><span>“Martial brother… You’re not comforting me at all.”</span></p><div><div></div></div><br/><p><span>“Well, yes. I think you’ve grown up to an age where you don’t need your martial brother’s comfort.” </span></p><br/><p><span>Yu Shaofeng: “…”</span></p><br/><p><span>“Good-bye, martial brother.\" </span></p><br/><p><span>Xue Ling rubbed the little brat’s head in satisfaction and said, “That's more like it. If you're still so wishy washy next time we meet, don't blame your martial brother for being impolite.\" </span></p><br/><p><span>Yu Shaofeng: “…” He swallowed back the words 'martial brother is still the most beautiful in the world'. In his ranking of the world's most disgusting people, he decided to rank his elder martial brother behind his Master. </span></p><br/><p><span>After separating from Yu Shaofeng and Chi Jian, Xue Ling felt like he could finally relax. He decided to first go around the mortal world and buy some things before going back and shutting himself in. </span></p><br/><p><span>So Chi Lan, who had not seen his disciple for three months, and even specifically calculated which day he would return to ensure he wasn't in closed door cultivation at the time, emerged to discover that he had been set up.</span></p><br/><p><span>As soon as Xue Ling returned to Still Peak, he was confronted with an angry Chi Lan who had a dark expression on his face. </span></p><br/><p><span>He asked curiously, “Master, were you not in closed door cultivation?\"</span></p><br/><p><span>Chi Lan's expression was cold. \"If I remained in closed door cultivation, were you going to come back and have a look, then go back out to run wild and escape your wall punishment?\" </span></p><br/><p><span>Xue Ling pursed his lips. He was unhappy that he was being sent into closed door cultivation as soon as he returned. He no longer planned to bring out the things that he had brought back for the man. He blinked, and curved his lips into a smile. \"Naturally not. Only, something happened and I was delayed on the way back. Your disciple will go face the wall now.\"</span></p><br/><p><span>He was smiling, but Chi Lan could clearly sense his discontent. He frowned and was about to speak, but his little disciple dryly tossed out a 'goodbye, Master', and then turned around to head into the valley. </span></p><br/><p><span>Still Peak did indeed have a valley that was very suitable for wall punishment, but at this point in time, Chi Lan wanted to stop him and ask him why he was smiling so unhappily… </span></p><br/><p><span>Only, was this something a Master should do? After subconsciously following Xue Ling’s footsteps, Chi Lan asked himself this in the depths of his heart, and then finally came to a conclusion. </span></p><br/><p><span>Why not? As a Master, shouldn't he be concerned about his disciple's joys and sorrows? As a master, it should be taken for granted that he would be concerned about his disciple, and there was nothing wrong with wanting to understand him more! This didn't overstep his bounds at all! </span></p><br/><p><span>After forcefully convincing himself of this many times, Chi Lan expressionlessly followed Xue Ling all the way to the valley where he was supposed to pass his punishment.</span></p><br/><p><span>Although Xue Ling tried to ignore him, his sense of existence was so strong that Xue Ling had no way to pretend the loyal human dog behind him didn't exist. When he looked back at him, this fellow seemed to be watching him with a gaze that was full of wronged accusation, as though blaming him for ignoring him.</span></p><br/><p><span>Xue Ling had no way to hold on to his temper under this onslaught. He always planned out happy scenarios in his head, but whenever he finally faced the man, he was all kinds of soft hearted. Even though he knew that this fellow had the wrong kind of idea in his head, and everything he was doing made him angry, not happy, he still had no way to really harden his heart and make him suffer.</span></p><br/><p><span>“Master…” He looked back helplessly: “I won’t sneak away. You don’t have to come and spy on me…”</span></p><br/><p><span>Chi Lan coughed and said, “I did not come to keep watch over you…”</span></p><br/><p><span>“Then is it that Master is about to fall into Qi deviation again, and needs to stay close to me?\" Xue Ling shook his head. “In fact, Master only needs to stay close to my original body. There's not much benefit in following me around.\"</span></p><br/><p><span>Chi Lan frowned at him, thought for a long time and finally said, “You are unhappy…”</span></p><br/><p><span>Xue Ling was stunned.</span></p><br/><p><span>“Did what I say just now send you into a bad mood?\" </span></p><br/><p><span>Xue Ling raised his eyebrows. His face was still smiling, but now his eyes carried a trace of a true smile. \"Master saw incorrectly. I'm not in a bad mood.\" </span></p><br/><p><span>Chi Lan thought for a moment. He placed his hand on Xue Ling's shoulder, and then raised it and patted him on the cheek just as he had done countless times when he was a little shota. “Don’t you think our relationship has drifted apart since you took human form?”</span></p><br/><p><span>Xue Ling’s face stiffened. He thought in his heart that if it hadn't been for that damned Qi deviation, they would really have been a lot further apart. After all, he had been concentrating on raising a child.</span></p><div><div></div></div><br/><p><span>“Actually, you don’t have to be like this and say nothing to me at all. I'm your Master, if you're willing, you can tell me anything you like.\" Chi Lan had already done his best to express his feelings, and at least make it so that he was no longer so vigilant about their master disciple relationship that was pushing the boundaries of what was acceptable.</span></p><br/><p><span>To tell the truth, he did not want his disciple to leave for so long in one go. He had been together with him for more than three hundred years, from when he was a little sapling until he was the sky-covering tree he was now. He had thought that the relationship between them had already been very close, at least, it was the first time he had been so close with any 'person'. Despite the taboo feelings that had begun to appear in his relationship with his disciple, Chi Lan still hoped that his little sapling would live on happily. </span></p><br/><p><span>Xue Ling thought for a moment and drew out several bags from his storage bag, which he then stuffed into Chi Lan's hands.</span></p><br/><p><span>“I spent a little more time to go around the mortal world. Although these things don't have spiritual Qi, I've already tried them all, and they are delicious, so I brought you a portion… I meant to give it to you just now, but you told me to go and begin my wall punishment…\" </span></p><br/><p><span>Chi Lan received these parcels; because time did not flow within the storage bag, whatever was put in came out exactly like how it had been when it was placed inside. The pastries and food in his hand was still hot, and it appeared that it had been purchased and placed immediately into the storage bag. There were so many, which meant that Xue Ling thought about sharing these things with him and purposely brought a portion for him every time he found something delicious.</span></p><br/><p><span>Seeing the smile on his face, Xue Ling decided to steal the two portions that he had gotten for Yu Shaofeng and Chi Jian and eat them himself…</span></p><br/><p><span>It was better if Chi Lan never discovered that these things were not only meant for him…</span></p><br/><p><span>Chi Lan really wanted to hug the person in front of him, kiss him properly on the lips, and let him clearly understand how delighted he was in his heart. Even if he didn't like him back, he more or less still had him in his heart. Besides, Chi Lan believed that he occupied the largest position, because he was the first person that the little sapling had ever met in this world… </span></p><br/><p><span>Probably because he could read the desire in Chi Lan's gaze, Xue Ling thought about it for a second, and then came forward to give Chi Lan a hug.</span></p><br/><p><span>“I don't mean to hide from you, Master.”</span></p><br/><p><span>System: “… It’s just that there are some things I don't want you to find out about…\"</span></p><br/><p><span>Xue Ling once again cursed at the system in his heart as he turned around and said, \"Well, Master, I'm going to go into secluded cultivation now. I plan to use this opportunity to break through to Yuanying. If I'm really successful, perhaps I'll need Master to help be my dao protector.\"</span></p><br/><p><span>Chi Lan still had not recovered from the hug. He nodded in a daze, and then clenched his fists. </span></p><br/><p><span>Just now, when Xue Ling came over to give him a hug, he had unconsciously wrapped his arms around him. This hand was the one that had just been on his waist… </span></p><br/><p><span>His waist was as thin as the phantom waist that appeared in his heart during his fantasies. It felt really good under his hands…</span></p><br/><p><span>Only, he didn't know if it would feel the same as the one in his fantasies if he stripped it bare… </span></p><br/><p><span>Chi Lan suddenly pulled himself together. Xue Ling's figure had already disappeared, and he was annoyed that his fantasies had recently become more and more excessive. Sometimes, he would fall into the fantasy almost as soon as he sat still, and the imagery contained within was never anything that could see the light… </span></p><br/><p><span>But for some reason, he always inexplicably looked forward to seeing more of those things… After all, they may only exist in his fantasies…</span></p><br/><p><span>Ah… Although he managed to hug his disciple today, he still couldn't speak out his feelings…</span></p><br/><p><span>How much longer did he have to be haunted by those illusions for?</span></p><br/><p><span>If Xue Ling knew what he was worrying about, he would probably cover his face with leaves and tell him those weren't any damned fantasy! Those were clearly the images of what they had done last time! What was he doing, placing them in his mind and playing them over and over again?! The man was really getting worse!</span></p><hr/><br/><p><em>xiin: *takes a deep breath* i think that one of the ways to give back to the BL community and help it grow is to make recommendations on other novels you all might also enjoy. so, that’s what i’ll try to do if i come across something i like. you guys can make suggestions too~ (though my reading time is pretty limited from all these translations, lol).</em></p><br/><p><em>so, here’s my first recommendation~ i’ve been meaning to share this one for a while now: if you like smut and fluff, you should give a shot~ </em></p><br/><p></p><div><div></div></div><br/>\n</div>"}