{"title": "Chapter 138", "id": 138, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-138", "volume_title": "Volume 2", "body": "<h1>Chapter 138</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>10.5 – It's true that I didn't like you either… </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp;BlueBug</em></p><br/><p><span>The scene became a little awkward at once. The students were unable to see clearly what was going on, but many of them were curious and came to the entrance to take a look. </span></p><br/><p><span>Mu Sichao let go of Xue Ling's hand as though he had just been scalded. He looked both flustered and happy. He then reached out to hold Xue Ling's hand with both of his and shook it hard, saying, \"I need to deal with that group of students first. Wait for me to come back out!\" </span></p><br/><p><span>Xue Ling nodded obediently. </span></p><br/><p><span>Mu Sichao turned around and herded the students at the door back inside. He slammed the door shut on his way in - it seemed as though he wanted to sort out his class as quickly as possible. </span></p><br/><p><span>So the poor students were quickly dealt with by their professor. Homework that should have been assigned a few weeks later dropped down on their heads, and their professor went through the homework requirements as quickly as he could. He told them that their current class time should be used to begin their homework, and that they could leave if they wanted to. </span></p><br/><p><span>After that, he packed up his things, turned around, and went straight back out the door. </span></p><br/><p><span>It seemed that Wen Ruoyi had finally gathered his wits by the time he came out. He anxiously wanted to say something to the teenager, but the youth looked very indifferent, acting as though there was no one by his side. </span></p><br/><p><span>Mu Sichao had no time to think about how he could help his friend out in such a situation. He approached them, uncertain and hesitant, then called out, \"Simu?\" </span></p><br/><p><span>Xue Ling turned his head to look at him and nodded: “… It’s me.” </span></p><br/><p><span>Mu Sichao experienced a moment of relief, and he let out a sigh. Something seemed to change within him right then and there. </span></p><br/><p><span>He curved his lips, his smile even more wicked than Xue Ling's. \"Come on, let’s find a place to talk.” </span></p><br/><p><span>“Okay.” Xue Ling stared at him for a long time. He finally knew how malicious the system had been to the man. </span></p><br/><p><span>Although his current body looked like his original one, at most it was thirty to forty percent similar. But Mu Sichao and his appearance were truly similar. Only, his temperament was unlike Xue Ling's, so the feeling that he gave off was different. </span></p><br/><p><span>It was no wonder that the system kept emphasizing that even if the man had really fallen for someone else, it would only be because he had gotten the wrong person. </span></p><br/><p><span>But Xue Ling could not accept this kind of thing happening. He basically now had a malicious attitude towards this entire world. </span></p><br/><p><span>It was weird to see a face that looked like his own appear in front of him. Xue Ling really did not like having a copy of himself. If the protagonist shou's performance in the next little while was not good enough to improve his bad impression of this world a bit, Xue Ling would not mind allowing this world's plot to follow its original path. </span></p><br/><p><span>The two of them walked ahead, and Wen Ruoyi followed them with an odd expression on his face. </span></p><br/><p><span>Although he had been friends with Mu Sichao ever since they were young, he seldom heard him mention that he had a younger brother. He knew Mu Sichao had been looking for someone all these years, but suddenly, a younger brother popped out of nowhere, and it was Ning Simu…</span></p><br/><p><span>This feeling was really weird. </span></p><br/><p><span class=\"jum\">He now understood Ning Simu's mood, and exactly why Ning Simu had insisted on breaking up, though he was not sure what the two of them had gone through, or even why they were separated.</span></p><br/><p><span class=\"jum\">“… Simu, you've always known about me?\" In fact, Mu Sichao had been looking for his mother all these years because when they separated, Ning Simu had only been a baby in his mother's arms. He had only been born a few months ago, and it was impossible for that baby to have an impression of him. When he lost contact with his mother, Simu was still very small, and Mu Sichao always felt that his younger brother probably didn't remember that he had an elder brother. He had not expected that Ning Simu would be the one to recognize him first…</span></p><br/><p><span>“I knew.” Xue Ling looked down and spoke casually, “Before mother died, she told me that I must find you…”</span></p><br/><p><span>Mu Sichao's steps paused. He turned his head incredulously and asked, \"Mother is dead?!\" </span></p><br/><p><span>“Yes. She got cancer, spent a year in a hospital bed, then finally left us.” Xue Ling pressed his lips together and said, “When she died, she said that the thing she was most sorry for in her life was you. You were still a child, but she left you behind, and then left me behind. She said she had not been a good mother…\" </span></p><br/><p><span>The moment he heard this news, Mu Sichao's mood became extremely agitated; but the more agitated he was, the calmer he appeared to be. \"Mother… when did she die?\" </span></p><br/><p><span>“In my third year of junior middle school…” Xue Ling raised his hand and blocked out the sunshine with his palm as he looked up into the sky. “I remember that I went to the hospital to see her after the high school entrance exam and saw her for the last time.” </span></p><br/><p><span>“…” Mu Sichao let out a sigh after a long moment of silence.</span></p><br/><p><span>“Er…” Wen Ruoyi quietly interjected a sentence from behind the two. \"We're at the coffee shop. Should we go inside and sit down?\"</span></p><div><div></div></div><br/><p><span>Mu Sichao pulled himself together and looked at the coffee shop beside them. “This is our college's coffee shop. Come in and we'll find a spot to talk properly.\" </span></p><br/><p><span>Xue Ling didn’t say anything. During the whole process, he didn't even look at Wen Ruoyi who was standing beside them. This made the system who had been watching the show from the side a little surprised. </span></p><br/><p><span>Was host really determined to leave the man hanging for the duration of this world?</span></p><br/><p><span>It was currently class time, and there weren't many people in the cafe. Mu Sichao chose a spot next to a window and sat down with Xue Ling. As soon as he sat down, he took Xue Ling’s hand in his own and said, “Simu, tell me about how you and your mother have spent these years.” </span></p><br/><p><span>Xue Ling nodded and said, “…Well, there's not much to say. My first memories are of mother bringing me along to work. She needed to work, and needed to bring me up, and it was finally too tiring, so she found me a stepfather.” </span></p><br/><p><span>“Mother probably broke off contact with you after she got remarried and we moved.\" Xue Ling did not break away from Mu Sichao's hold on his hand, and only put on an especially sad expression as he recalled the past. \"She wrote to you, but she couldn’t wait for your reply. At first she thought you were angry about her remarriage, but later on, stepfather helped her look into it, and we learned that you had gone abroad after something happened.\"</span></p><br/><p><span>“…” Mu Sichao pressed his lips together, then said, \"Back then, I left in a hurry. I should have gone to see you and mother.\"</span></p><br/><p><span>“Hmm…”</span></p><br/><p><span>At the end of the day, they had missed each other. The two of them held hands tightly and looked down, and it was unknown if they were thinking about the same thing or not.</span></p><br/><p><span>This picture was very beautiful. Both of their side profiles were similar, but Mu Sichao's choppy hair was very straight while Xue Ling's head of small curls was messy. The light coming in from the window blurred the two faces somewhat, and they seemed to be isolated from the world.</span></p><br/><p><span>“Pa!\"</span></p><br/><p><span>The sound of a tray slamming onto the table pulled the two men's attention back. Mu Sichao looked up and met with a person who was gritting his teeth, his expression looking as though he was suppressing his emotions to the point of suffering from internal damage. </span></p><br/><p><span>It was someone very familiar to him. He wore the apron worn by waiters at the café. He placed his hands on the table as he stared at Mu Sichao, his attitude aggressive, as though Mu Sichao owed him money. </span></p><br/><p><span>The part-time workers at the café were all students. This person was obviously also a student, and he was familiar with Mu Sichao. Xue Ling thought about it and realized - this was probably the protagonist gong? </span></p><br/><p><span>Uh… This was fun. </span></p><br/><p><span>“Doesn't professor have classes to teach? Why are you in the café now?\" Perhaps people who were in love found it particularly easy to ignore others in the vicinity; Mu Sichao was still holding onto Xue Ling's hand, and the protagonist gong had no intention of letting them separate as he smiled widely and greeted Mu Sichao… </span></p><br/><p><span>Though, everyone could smell the vinegar in those two sentences. </span></p><br/><p><span>“Something unexpected happened.” Mu Sichao was about to let go of Xue Ling's hand, but the youth's hand dropped down. He was stronger than Mu Sichao, and made it so that he was unable to let go. </span></p><br/><p><span>“Why is professor in such a hurry to let go? There's nothing wrong with holding hands~ You don't even hold hands like this with me.\" </span></p><br/><p><span>“It's not…” Mu Sichao felt rather helpless. \"Wenjun, this is a misunderstanding.”</span></p><br/><p><span>Xue Ling’s hand was pressed down at the bottom, and he could not pull it out. He also didn't want to be involved as the two people were pulling and tugging, and his brows wrinkled slightly. </span></p><br/><p><span>Wen Ruoyi, who had kept to himself beside them, finally had an opportunity to make himself useful. He pushed aside Su Wenjun's hand with his own. \"If you're bringing drinks over, then just bring them over. Why are you pressing other people's hand down? Are you looking for a beating?\" He had never had a good attitude towards the person who had stolen away the person he had raised up so carefully. He pulled Xue Ling's hand out and took advantage of the opportunity to hold it himself. \"Twilight, does it hurt?\" </span></p><br/><p><span>Xue Ling pushed his hand away and retrieved his hand.</span></p><br/><p><span>“If you're acting as part of the background, then stay in the back. When did it become your turn to speak?\" </span></p><br/><p><span>Wen Ruoyi felt really wronged. What did he mean, part of the background? \"Twilight, clearly I was the one who planned to meet with you…\" </span></p><br/><p><span>“Well, even if you hadn't asked me to come, I would've still come to see my elder brother.\" Xue Ling no longer paid attention him and continued, \"That day, after I saw you and elder brother together, I asked someone to look into it. I originally just thought that there was a possibility, but I didn't think it would be real… After mother died, I also spent some time looking for you…\" </span></p><br/><p><span>“That’s really miraculous. We’ve always been looking for each other, but ended up meeting by chance.\" Mu Sichao tugged on Su Wenjun's clothes, exerted some force, and made him stagger. \"This is Su Wenjun, my student. Did he hurt you just now? I'll apologize for him.\"</span></p><div><div></div></div><br/><p><span>“Tsk.” Following the tug, Su Wenjun sat down too. Although he was a student, he was taller than Mu Sichao, and quite broad. It could be said that when he was sitting next to Mu Sichao, it became obvious who was the shou and who was the gong. \"It looks like Professor Wen is here too…” </span></p><br/><p><span>“Does Simu live alone now?” </span></p><br/><p><span>“Yes… My stepfather remarried, and I live by myself now.” Xue Ling took out his mobile phone and input an address. “This is my address. If elder brother wants to see me, he can come here. Mother left something for you, and if you have time, you can come over to take a look.\"</span></p><br/><p><span>“Good.” </span></p><br/><p><span>“Then, I’ll go back first. I still have things to do.” Xue Ling stood up and continued, “Elder brother and fellow student Su still have things to say to each other, and I also need to speak with Professor Wen, so we won't tarry any longer.\" </span></p><br/><p><span>“Hmm…” After Mu Sichao agreed, he discovered that Xue Ling had taken the lead in settling everything. Embarrassed, he also stood up. \"Everything happened so suddenly today… I also know that it's very unexpected… When I've calmed down a little, I'll look for you to speak again.\" </span></p><br/><p><span>“Well, elder brother should have my phone number already. It's the one that Professor Wen called just now. He should have used elder brother's cell phone, right?\" </span></p><br/><p><span>“Yes.” </span></p><br/><p><span>“See you later then, elder brother.\" </span></p><br/><p><span>Wen Ruoyi quickly followed after him as he left. \"Twilight, wait for me! You said you would give me a chance to explain!” </span></p><br/><p><span>Xue Ling did not look back at him. He only said, “I know, did you drive over? Send me back.” </span></p><br/><p><span>Wen Ruoyi's steps hesitated, then he rather happily nodded and agreed, \"Okay, okay, okay!\" </span></p><br/><p><span>Su Wenjun still did not know what had happened. The other two people had left, and he was sitting there watching as Mu Sichao followed the two retreating figures absentmindedly for a long time. He was a little dissatisfied as he wrapped an arm around his waist and leaned in to bite at his ear. \"Professor, they've already left. Did they take your wits with them?\"</span></p><br/><p><span>Mu Sichao pulled himself together. He stretched out a hand and pinched Su Wenjun’s waist, his ears red. \"Take your hand off me. What kind of words are those!\"</span></p><br/><p><span>“Just now, professor was holding other people's hands and refusing to let go.\"</span></p><br/><p><span>“That’s my younger brother.”</span></p><br/><p><span>“I didn’t even know that professor had a younger brother.\" </span></p><br/><p><span>“Now you know, right?” Mu Sichao's thoughts were still somewhat muddled. The amount of information he had received today was quite large. He swatted at Su Wenjun's hand and complained, \"Go do your work. You're not even working, and you even sat down like this. Watch out or I'll report you to your superiors.\" </span></p><br/><p><span>Su Wenjun stood up, feeling wronged. \"I haven't seen professor in days…\" As if. He was turning into a cat every night and getting into bed with him… </span></p><br/><p><span>“I’ve been a little busy lately…” Mu Sichao massaged his temples. Since he had already given up on his class, and had no intention of going back to rest… Finally, he pursed his lips, then asked very simply, \"How much longer is your shift?\" </span></p><br/><p><span>“I’m the supervisor. I can leave now if I want to.\" Su Wenjun’s eyes were sparkling. It was a bit strange for a big boy like him to make such an expression, but he was already used to acting like a child in front of Mu Sichao, and didn't feel ashamed of himself at all. \"I'll just let them know. Since professor came to look for me, they won't dare to say anything else.\"</span></p><br/><p><span>Mu Sichao squeezed his hand and said, \"Then I'll go and get the car. Change your clothes and come meet me at the parking lot. We can go back to my house.\"</span></p><br/><p><span>Su Wenjun nodded excitedly.</span></p><br/><p><span>In the parking lot, Xue Ling and Wen Ruoyi were currently in a deadlock. </span></p><br/><p><span>Wen Ruoyi was in the driver's seat, and Xue Ling was in the passenger's seat. Professor Wen insisted on putting on Xue Ling's seatbelt for him, and leaned his whole body over, his expression clearly stating that if Xue Ling refused to listen, he was perfectly willing to just stay here all day.</span></p><br/><p><span>Finally, Xue Ling shifted his gaze and turned his head to look out the window. \"What do you want to explain? Just say it now. You can send me home after you finish talking.\" </span></p><br/><p><span>Wen Ruoyi was finally satisfied. He even used the excuse of putting on his seatbelt for him in order to kiss Xue Ling on the cheek before leaning back into the driver's seat. Nevertheless, he did not forget to tug on Xue Ling's hand, as though afraid that he would suddenly run away or jump out of the car. </span></p><br/><p><span>“Twilight, I don’t know how to tell you. I don't like Mu Sichao. Of course, at the start, it's true that I didn't like you either…\"</span></p><br/><p>  </p><br/><p></p><div><div></div></div><br/>\n</div>"}