{"title": "Chapter 139", "id": 139, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-139", "volume_title": "Volume 2", "body": "<h1>Chapter 139</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>10.6 – Twilight Darling: Dream on</strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; BlueBug</em></p><br/><p><span>“Perhaps there's no way to explain this feeling properly…\" Seeing that the other party's face turned cold after he spoke his first sentence, Wen Ruoyi quickly followed up and explained, \"I just meant that I didn't like you at the beginning, but that's not how I feel now.\" </span></p><br/><p><span>Xue Ling raised his eyebrows and wrapped both arms around his chest. He looked like a queen as he lazily lifted up his chin. \"Liar. Keep lying.\"</span></p><br/><p><span>Wen Ruoyi sighed helplessly and said, “I was nice towards Mu Sichao because of his face. At the beginning, I did have a feeling that he was the person I was waiting for, but later on, after we started to interact more, it became more and more clear that he was not the person I wanted to stay with for a lifetime…”</span></p><br/><p><span>“I’m not making this up. It’s true. Otherwise, I wouldn't have let my loved one stay around me for more than ten years with no progression.\" </span></p><br/><p><span>Xue Ling's lips twitched. He thought to himself that indeed, this man really wasn't such a tolerant person.</span></p><br/><p><span>“Later on, when I asked you to date me, I admit that I still wasn't thinking clearly at the time, but it's also true that I was thinking about finding a boyfriend.” Wen Ruoyi looked down and said, \"I was around Sichao for so long. On one hand it was because his uncle had asked me to take care of him, but also, it was because my intuition told me that the person I was looking for was somehow related to Sichao… It was also because of this that I followed him back to the country and entered the same college…\" </span></p><br/><p><span>“But Sichao is already in a relationship, and the person I wanted to find still hadn't appeared. During that period, I was a little anxious, and you looked so similar to Sichao… I thought that perhaps you were the one I was looking for. After all, you were the first person I've ever met who looked like Sichao yet had a completely different temperament…\" </span></p><br/><p><span>“I admit that I was very casual about suggesting that we get to know each other better. It was a bastard move on my part, and I didn't pay enough attention to you after we started dating. I also neglected you because I was busy, and caused you to get flamed online…\" Wen Ruoyi's voice turned softer as he spoke. \"Because after interacting with you, after a long time, I could sense that you also weren't the person I wanted to find…\" </span></p><br/><p><span>“Isn't that perfect then?\" Xue Ling had his eyes wide open as he lied through his teeth. He clearly understood what Wen Ruoyi meant by these words, but he did not intend to forgive him so easily. After all, in the original plot, wasn't Wen Ruoyi the real bastard loser? As for the man…</span></p><br/><p><span>Although he had been framed by the system, at the end of the day Xue Ling still couldn't go OOC. \"If we split up, you can continue to go on looking for your true love.\" </span></p><br/><p><span>“No…” Wen Ruoyi also felt that the things he was saying were contradictory, but, fact was, he could not deny that the person in front of him was the person he had been waiting for. But this person wasn't the original Ning Simu either! \"I really want to be with you now. You're the one I've been looking for!\" </span></p><br/><p><span>Xue Ling sneered and said, \"You're really just saying whatever you want. When you don't want to be with someone, they're not the person you want to be with. Now that you want to be together, I've suddenly turned into the person you've been looking for? What do you take me for? Did you even consider my wishes?\"</span></p><br/><p><span>There was nothing Wen Ruoyi could say. He grasped the steering wheel and did not dare to look at Xue Ling at all. He was afraid to see the dislike and disdain in his eyes. “I…” </span></p><br/><p><span>“Enough. Let's not talk about this anymore. I gave you a chance to explain, but you might as well have not tried to explain at all.\" Xue Ling unfastened his seat belt. “Are you driving or not? If you aren't driving, I'm going to get out and go home by myself.\"</span></p><br/><p><span>Wen Ruoyi’s entire body bounced up at once. He pressed down on Xue Ling's shoulder, lips pressed together as he looked at him. His expression was aggrieved as he said, \"I'm driving. Don't get off the car. I'll take you back.\"</span></p><br/><p><span class=\"jum\">Xue Ling rolled his eyes at him and then buckled his seat belt back on. He made sure to give Wen Ruoyi no chance to take advantage of him. His expression was cold, and it looked as if he didn't want to talk to Wen Ruoyi at all. “Drive, then.”</span></p><br/><p><span>Wen Ruoyi felt wronged as he drove, and was very inattentive behind the wheel. From time to time, he would sneakily peek at Xue Ling until finally, he got scolded, \"It's fine if you want to die, but I don't want to die with you. If you look at me again, I'll get out of the car.\"</span></p><br/><p><span>Wen Rongyi silently turned his head back and continued to look ahead, feeling that he really did not have the dignity of a gentleman at all today… </span></p><br/><p><span>Forget it, in front of his future wife, things like dignity might as well be used to feed the dogs… </span></p><br/><p><span>“Twilight…” </span></p><br/><p><span>“Yes.\" </span></p><div><div></div></div><br/><p><span>“If we break up, can I still chase you?\" </span></p><br/><p><span>“…” Xue Ling thought for a moment and said, “Whether or not you chase me is up to you. But it's my choice whether or not to agree.\" In other words, if Wen Ruoyi had the ability, he could chase him, but whether or not Xue Ling would accept it was based on him. If Xue Ling was unhappy, he would probably have no hope at all in this lifetime. </span></p><br/><p><span>“Okay.” But Wen Ruoyi didn't seem worried about this point at all. As long as he could continue chasing him, he would have a chance. He didn't care that much about the rest.</span></p><br/><p><span>“Then… Can you remove my phone number from the blacklist?\" He really didn't want to be unable to even get in touch with him. </span></p><br/><p><span>“That's based on your performance.” Xue Ling watched as people and cars went by outside the window, and slowly added, \"I didn't just blacklist your phone.\"</span></p><br/><p><span>“…” Wen Ruoyi had almost forgotten that he had been blocked on Weibo, QQ, and all other forms of communication.</span></p><br/><p><span>In Twilight's eyes, there was really no room for an irritating grain of sand. If even the smallest thing happened that he was unhappy about, he would immediately throw it into the abyss. It seemed that there was still a really long way to go if he wanted to climb back out… </span></p><br/><p><span>After that, they were both quiet the whole way back. The system found it rather strange, and felt that the atmosphere was wrong somewhere. He sneaked out to take a look at the two, then quietly asked its host, \"Host, you really don't intend to forgive him?\"</span></p><br/><p><span>“I’m just giving him another chance to chase me~” Xue Ling lazily propped his chin against his hand and answered the system's words in his head. \"Whether or not I forgive him will be up to him.\" </span></p><br/><p><span>“According to what I know about you, your heart should now be so soft that it's a complete mess… Clearly, I had set up so many pitfalls, but he really managed to avoid stepping into any of them. If you hadn't come into the world, he would probably have made things clear with Ning Simu very soon…\" </span></p><br/><p><span>“You also know that you've been messing around?” </span></p><br/><p><span>System: “…” Was it his fault now? Who was the person who forced it to abuse its authority in the last world?</span></p><br/><p><span>It was really not easy being a system! It wasn't treated like a human being at all! </span></p><br/><p><span>“I'm helping you clean up your mess now.\" Xue Ling glanced at the man who no longer dared to look at him because of his previous words. He felt that this world was really quite interesting now.</span></p><br/><p><span>Usually, the man was always tall and broad in every world. He rarely seemed as approachable as he did this time. Moreover, he appeared very gentle in this world, and based on the description in the original text, he should be a very pleasingly affectionate type of person.</span></p><br/><p><span>He remembered that there had been a few worlds where the man also appeared particularly gentle. After going through so many worlds, the man always switched between being an iceberg and gentle, but the only thing that never changed was probably that regardless of whether he was obviously repressed, or his repressed streak was hidden, no matter what, he was always so damned bottled-up.</span></p><br/><p><span>The system was so heartbroken. It couldn't breathe after being blamed in such a way! It no longer wanted to deal with whatever kind of love game this couple was playing. If it had the time to concern itself over their current awkward relationship status, it might as well look for a few books to read and kill time.</span></p><br/><p><span>After having solved the matter of his and Mu Sichao's sibling relationship, Xue Ling went off to queue and sing in his channel that evening. But what awaited him was a series of things…</span></p><br/><p><span>It was all started by a certain man. </span></p><br/><p><span>Well, fine. From beginning to the end, it was also because of this man that he had made all this noise on the internet.</span></p><br/><p><span>Xue Ling had just queued up for his turn at the mic when the girls in public chat began to send messages one after the other, asking Xue Ling about what he had been hiding from them. After a whole string of messages, they were finally muted by the moderator on the scene and told to pay attention to the current singer on the mic. </span></p><br/><p><span>Xue Ling frowned. He first signed into his own QQ. As expected, as soon as he logged in, the amount of notifications almost froze his computer. Xue Ling felt that the man might have done something big, so he waited until his QQ had settled down before reading each message one by one. </span></p><br/><p><span>Most of the messages were inquiries about his relationship with Gentleman's Twilight. A few were worried if he was alright, and his fangirls had guessed a lot and even asked Xue Ling if his loser boyfriend had been Gentleman's Twilight. </span></p><br/><p><span>Xue Ling raised his eyebrows. Wen Ruoyi never liked to mix up his private affairs with online, so he had stated several times in public that he did not want to participate in any online CPs. He had even said online that he and Thoughtful Dawn were only friends, and he hoped that online fans would not link them together. </span></p><div><div></div></div><br/><p><span>What was going on now? People came to him to ask him about it one after another. </span></p><br/><p><span>As soon as Xue Ling opened his Weibo account, the channel moderator's voice came from his computer, reminding him that it was now his turn on the mic. </span></p><br/><p><span>Xue Ling turned on his mic. “Good evening, everyone.” His tone was lighter than it had been over the past two days, and the girls went wild, sending messages that scrolled madly through the public screen, giving greetings and repeating their questions from earlier. </span></p><br/><p><span>“To tell you the truth, I felt like I had a bucket of cold water dumped on me when I saw everyone's questions just now. I still don't know what's going on. Can someone explain it for me in simple terms?\"</span></p><br/><p><span>So, everyone on the public screen began to tell Xue Ling to check Weibo. Xue Ling made and 'oh' sound, then said, \"Okay, I'll look at it later. I'll sing to everyone first.\" He hadn't had much else to do in the past few days, so he had looked into the songs in this world, and his current song list had expanded considerably. It was no longer confined to a certain genre like the original owner of this body. Xue Ling clicked on an ancient folk song, and immediately began to sing. </span></p><br/><p><span>He had a good memory, and could remember all the lyrics and songs he had listened to only once, so he was able to multitask while he sang and opened his Weibo…</span></p><br/><p><span>And then, while the fangirls were still mesmerized in the middle of the song, they suddenly heard a 'f***!'</span></p><br/><p><span>Followed by sounds of chaos from Twilight Darling's side and a shout, \"Gentleman's Twilight!\"</span></p><br/><p><span>At last, he seemed to recall what he was doing and quickly recovered, \"Ahhhh, the wind was blowing and I slipped up just now. Pretend you guys didn't hear anything! Hahaha~\" </span></p><br/><p><span>The fangirls replied that it was always windy, and it was fine as long as he was enjoying himself~ </span></p><br/><p><span>Because he had blocked Gentleman's Twilight, under normal circumstances, Xue Ling wouldn't be able to see any Weibo posts related to his account. But he had no choice but to see when everyone was responding to the post with comments mentioning him, and even forwarding the post and tagging him as they did so.</span></p><br/><p><span>[ Waiting To Think: Twilight Darlinggggg, the big god is kneeling and begging for forgiveness, hurry and take a look! // Gentleman's Twilight: Twilight Darling, Baby, I sincerely apologize. I really did not do it on purpose. Do me a favour, and pull me out of the blacklist, okay? [Pitiful] [Pitiful] [Pitiful] Ladies, please stop quarrelling and help me out QAQ ] </span></p><br/><p><span>It was really the end of the world. Gentleman's Twilight had been labelled a god online for so long, but this was the first time he had tried to act cute in text. It was also the first time he had asked the fangirls to do something for him so directly. </span></p><br/><p><span>If he added a picture of himself kneeling on a washboard, this Weibo message would be perfect, just like a letter of apology from a man who had been thrown out of the bedroom and forced to sleep on the couch.</span></p><br/><p><span>Xue Ling jabbed with a finger and entered Gentleman's Twilight's Weibo account. He discovered that he had not only just sent that one message. He had also reposted the message several times. </span></p><br/><p><span>[ Gentleman's Twilight: Baby, I really messed up this time, but it makes me unsettled that I have no way to contact you if you do this. At least unblock me on one platform, okay? // Gentleman's Twilight: Baby… you're really extreme… you even blocked me on YY… // Gentleman's Twilight: Baby, can't you unblock me on Weibo, QQ, and over the phone? // Gentleman's Twilight: Twilight Darling, Baby, I sincerely apologize. I really did not do it on purpose. Do me a favour, and pull me out of the blacklist, okay? [Pitiful] [Pitiful] [Pitiful] Ladies, please stop quarrelling and help me out QAQ ]</span></p><br/><p><span>Xue Ling finished singing his song, switched back to the mic, and said, \"I'm sorry about that… I got scared by Weibo…\"</span></p><br/><p><span>The girls on the public screen laughed and said, “Was Darling frightened by Gentleman's Twilight's sudden confession?\" </span></p><br/><p><span>“Ah… This is a bomb, not a confession.” Xue Ling checked, and it was time for his turn at the mic to end. \"Okay then, I'm going to go deal with it now. See you later, girls!\" </span></p><br/><p><span>After his turn ended, Xue Ling had no intentions of continuing to queue up. He opened the Weibo dialogue box, and forwarded Gentleman's Twilight's post. </span></p><br/><p><span>[ Twilight Darling: Dream on. // Gentleman's Twilight: Baby, I really messed up this time, but it makes me unsettled that I have no way to contact you if you do this. At least unblock me on one platform, okay? // Gentleman's Twilight: Baby… you're really extreme… you even blocked me on YY… // Gentleman's Twilight: Baby, can't you unblock me on Weibo, QQ, and over the phone? // Gentleman's Twilight: Twilight Darling, Baby, I sincerely apologize. I really did not do it on purpose. Do me a favour, and pull me out of the blacklist, okay? [Pitiful] [Pitiful] [Pitiful] Ladies, please stop quarrelling and help me out QAQ ]</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}