{"title": "Chapter 142", "id": 142, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-142", "volume_title": "Volume 2", "body": "<h1>Chapter 142</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>10.9 – Hadn't even graduated from kindergarten yet</strong></p><br/><p><em>translator: xiin</em><em>editors: alamyersl &amp; BlueBug</em></p><br/><p><span>Wen Ruoyi was choked by Xue Ling's 'there's no relationship between us', and stared blankly for a good while without saying a word. It was Mu Sichao who rubbed his chin and asked thoughtfully, \"The festival in the city this month? Is it in the Yunjie Stadium in Nanshan District?\"</span></p><br/><p><span>“Yes. Elder brother knows of it?” Xue Ling turned his head and left Wen Ruoyi to one side as he joyfully grabbed Mu Sichao's hand, \"Wen Ruoyi mentioned Weibo just now. Could it be that elder brother is also involved in audio dramas?\" </span></p><br/><p><span>“Ah, you two met online. I had forgotten about that.\" Mu Sichao finally recalled what little information Wen Ruoyi had disclosed to him about his lover. \"Yes. Simu should recognize me, I am Thoughtful Dawn.\" </span></p><br/><p><span>Xue Ling patted his own head and said, “Oh! I know! The one who is in a CP with Gentleman's Twilight. You know, your fangirls came over to my Weibo to flame me a while back. The fighting was really fierce, and now they're still saying that I stole away your man.\" </span></p><br/><p><span>Mu Sichao frowned and said, \"They do tend to do this. I haven't gone online to check in on them for a while. In a bit, your elder brother will go support you.\" </span></p><br/><p><span>\"That's good.” It was always better to have more big thighs to hug. Xue Ling didn't care if he was popular because he was being hated, or because he was hot. As long as they became his fans, he believed that they would eventually become his genuine fan~ \"Elder brother is definitely more useful that certain other people.\" </span></p><br/><p><span>Wen Ruoyi opened up his cell phone and silently began to type out a new Weibo message. </span></p><br/><p><span>Therefore, in the morning, Gentleman's Twilight's fans were once again greeted by their god's message in the morning as he scorned his fellow online god who he had supposedly been in a CP with in the past.</span></p><br/><p><span>[ Gentleman's Twilight: I've never liked to participate in CPs and I still don't. Other than my baby Twilight Darling, I hope that my fans will no longer talk about any other pairings. Particularly about Thoughtful Dawn - my family's baby is at odds with me again because of this. If he really runs off with Thoughtful Dawn, you ladies will have to take responsibility for it. ] </span></p><br/><p><span>The younger sisters were confused, and they all expressed that this was a mess of his own making! </span></p><br/><p><span>Why do we have to take responsibility for this? Why didn't anyone understand their inner suffering?! </span></p><br/><p><span>Xue Ling saw that both of them were posting on Weibo, and silently took out his phone as well. When he opened up his account, he discovered that he had already received an update. He saw Wen Ruoyi's post as soon as he clicked in, and gritted his teeth as he began to consider what Mu Sichao would do if he went over and bit Wen Ruoyi in front of him. </span></p><br/><p><span>He was preparing to actually go up and fight it out with Wen Ruoyi when his Weibo pinged with a new notification. He clicked on it, and discovered that Mu Sichao had also made a post. </span></p><br/><p><span>[ Thoughtful Dawn: I don't mind taking care of my baby Twilight Darling. Keep it up, ladies~ // Gentleman's Twilight: I've never liked to participate in CPs and I still don't. Other than my baby Twilight Darling, I hope that my fans won't talk about any other pairings any more. Particularly about Thoughtful Dawn - my family's baby is at odds with me again because of this. If he really runs off with Thoughtful Dawn, you ladies will have to take responsibility for it. ] </span></p><br/><p><span>It had really become the drama of the year at this point. Xue Ling looked at Mu Sichao in surprise. \"Brother…\" </span></p><br/><p><span>Mu Sichao rubbed his head. \"Your elder brother is telling the truth. If you really dislike him, tell your elder brother. I'll definitely stand on your side and give him the cold shoulder.\"</span></p><br/><p><span class=\"jum\">Xue Ling laughed awkwardly and then finally reacted to his original words. \"But, elder brother… isn't that too ambiguous of a thing for you to say…\"</span></p><br/><p><span class=\"jum\">“Don’t worry about him. He's always been like this online, and nobody will find anything wrong with it.\" Wen Ruoyi couldn't bear to see the two brothers acting so close, and had to stick a foot in, forcefully blocking anything Mu Sichao had to say. \"If there's anyone who might find fault with it, it'll probably be his little boyfriend.\"</span></p><br/><p><span>“I’ll explain my relationship with Simu to him clearly.\" Mu Sichao wasn't concerned about this. He only wanted his fans to treat his little brother better. He had been in this circle for a long time now, and knew how harmful people could be over the internet. Even if his younger brother had a good state of mind, he was extremely unwilling to let him be harmed by those kinds of words. \"I'll be attending as a guest of the evening show at the animation festival that Simu is talking about. Perhaps we can have lunch together before I perform in the evening.\"</span></p><br/><p><span>“Is elder brother going to sing?”</span></p><br/><p><span>“Yes. Although my singing ability isn't that great, this kind of event usually involves voiceovers and singing together. You can come watch the show - I have tickets for friends and family.\"</span></p><div><div></div></div><br/><p><span>“Okay!” </span></p><br/><p><span>“If you want to go see, I can also accept an invitation to perform… I also know how to sing. We can sing together…\" Wen Ruoyi muttered from one side, but nobody answered him.</span></p><br/><p><span>He silently bowed his head and opened Weibo again. </span></p><br/><p><span>[ Gentleman's Twilight: Alas, my baby has been keeping me at a distance. How do I get through this… ] </span></p><br/><p><span>[ Recalling Childhood Memories: Gentleman's tone seems so pitiful… ] </span></p><br/><p><span>[ Crazy Roommate: Is Gentleman trying to act spoiled and get attention? No way, right? Could it be that Darling got stolen away by His Majesty right after he forwarded the message? ]</span></p><br/><p><span>Thoughtful Dawn's most famous work was a long radio drama that showcased the life of a young emperor from a novel perfectly. Based on his experience portraying emperors in audio dramas, he managed to interpreted the role in the most perfect way. Since then, his fans called him 'His Majesty'. </span></p><br/><p><span>[ Talking About Youth: Gentleman hasn't managed to get Darling back yet? Someone from Darling's side said that you've already broken up. Gentleman, did you kneel down and hug his leg, begging for him not to kick you away? ] </span></p><br/><p><span>[ Not Enough Time For Updates: Rubbing Gentleman's head~ Perhaps you should try turning raw rice into cooked rice~ ]</span></p><br/><p><span>Mu Sichao stayed all the way until evening before leaving. Lunch at noon was prepared by Wen Ruoyi as well. After Mu Sichao went on his way, Wen Ruoyi also intended to leave. Xu Ling looked at him in surprise. “You've finally rediscovered your self-respect? Ready to leave?” </span></p><br/><p><span>Wen Ruoyi shook his head and said, “No, it’s just that there’s no food left in the fridge. I'm going out to buy groceries.\" </span></p><br/><p><span>Xue Ling thought for a moment and felt that having him prepare food wasn't so bad. He put on his shoes and planned to go out with him. \"I'll give you one more chance. Remember to leave the key behind when you go out later~\" </span></p><br/><p><span>Although he said so, he had no idea when Wen Ruoyi actually left.</span></p><br/><p><span>After dinner, Xue Ling was sent off by Wen Ruoyi to go take a bath. After he came out, he turned on the computer to queue up in his channel and sing while Wen Ruoyi helped him tidy up and clean his house. Finally, when it was time to sleep, he urged him into bed with a glass of milk.</span></p><br/><p><span>Everything felt so natural. It was as though they had lived together for a long time. Sometimes, Xue Ling would react before he thought about it, and do as he was told. He obediently drank the milk and went to bed. </span></p><br/><p><span>All the way until Wen Ruoyi turned off the lights after he fell asleep, Xue Ling had a strange kind of feeling… </span></p><br/><p><span>Had Wen Ruoyi been able to restore his memories of the previous worlds they spent together? … Or was it that it would be like this every time a part of his soul left temporarily? All of his actions felt particularly familiar, and most of the time, Xue Ling had no way to say anything to drive him out, because as long as he opened his mouth to speak, Wen Ruoyi would block his words and pull out something else for him to do. </span></p><br/><p><span>The lights in the apartment was turned off, and the door to the apartment closed. Xue Ling confirmed that the man had left before sneakily pulling out his cell phone and opening Weibo. </span></p><br/><p><span>After stewing for the whole day, the discussions under the post that Gentleman's Twilight had sent exploded. Many of them were supporting Twilight Darling, and Xue Ling smiled widely as he went in to read the comments.</span></p><br/><p><span>Most of the comments were joking about all three of them, or curious about why Thoughtful Dawn would suddenly appear when the two of them were doing their own thing. A small portion of comments were about the fact that His Majesty really never changed, suggesting that Gentleman should rush up and find His Majesty for a fight. </span></p><br/><p><span>Xue Ling read through the activity in the comments and grinned as he clicked 'like' on a comment that suggested Wen Ruoyi and Mu Sichao fight one another. Then, he went back to his own Weibo page and checked on his fans. His fan count had gone up by several tens of thousands thanks to today's little drama. Xue Ling curved his lips, took a look at the song he had sent out earlier, and once again poked in to see the comments.</span></p><br/><p><span>The time interval between the songs he had sent out was relatively short. The two songs were linked, but their style was completely different. The ancient style song was elegant and graceful, while the opera style song was very moving; a modern bawdy ballad that was full of teasing intent. It really made listeners want to kneel down and call him 'daddy'. </span></p><br/><p><span>His post for the modern song was filled with comments that contained the word 'daddy'. Everyone asked for more songs, saying that there were too many interested people now, and there wasn't enough room. Hurry up and share more for everyone to enjoy~ </span></p><br/><p><span>Xue Ling finished skimming through most of the comments, and could finally go to sleep peacefully, but a private message notification popped up. It was Wen Ruoyi's direct message.</span></p><div><div></div></div><br/><p><span>[ Gentleman's Twilight: Shouldn't you be sleeping? ] </span></p><br/><p><span>Xue Ling pouted, a little unhappy about the fact that he had taken the man out of his Weibo blacklist that night.</span></p><br/><p><span>[ Gentleman's Twilight: I saw you hit 'like' on someone's comments. There's no use pretending that you're not there. ]</span></p><br/><p><span>Wen Ruoyi continued to send him messages.</span></p><br/><p><span>Xue Ling answered him with an emoticon that had its tongue sticking out, and then obediently went to sleep.</span></p><br/><p><span>He didn't know if it was because the first world where the two of them had gotten together was the one where he was his elder brother, but as long as the man used a strict tone to speak to him, he often found that he had no choice but to do as the other party wished. This kind of method was as effective as speaking words of love to him, and it was unknown how Wen Ruoyi discovered this fact.</span></p><br/><p><span>From then on, Xue Ling saw Wen Ruoyi every morning when he woke up, and the last thing he saw before he closed his eyes at night was also him. Wen Ruoyi had almost begun to treat his house as a secret base - other than not being there when he slept at night, he spent most of the rest of his time there. </span></p><br/><p><span>Xue Ling was fed three good meals a day, and his attitude gradually softened. Although he still spoke coldly to Wen Ruoyi from time to time, the man would generally just rub his head until he changed his attitude. Wen Ruoyi also did not take his icy and piercing remarks seriously. </span></p><br/><p><span>All the virtual knives that Xue Ling sent over were blocked by softness. Over time, Xue Ling's attitude began to change and he began to soften up in real life, although he was still a complete queen online.</span></p><br/><p><span>Wen Ruoyi didn't seem to have any intention of pulling down his façade either. He seemed to have understood that Xue Ling was toying with him on purpose, so his attitude was often very gentle. He was so gentle to the point where Xue Ling felt bad for treating him this way, and—after stabbing him with an icy knife—might even apologize to him. </span></p><br/><p><span>Soon, the time for the animation festival arrived. Xue Ling set a time to meet with Mu Sichao at the entrance to his apartment complex that morning, but Wen Ruoyi also showed up to follow him around that morning, so he already had a tail behind him as he left the house.</span></p><br/><p><span>When he reached the entrance to his apartment building, he discovered that he was not the only one with a tail. Standing behind Mu Sichao was another small tail. </span></p><br/><p><span>A cold front had arrived this morning, and in order to stay warm against the sudden drop in temperature, Mu Sichao was wearing a black hoodie. The hoodie was rather big and covered half his face. He was also wearing a face mask, and if he hadn't been followed by that small tail, Xue Ling might not have recognized him.</span></p><br/><p><span>Xue Ling came up and called out, “Elder brother!” </span></p><br/><p><span>Mu Sichao took off his face mask and waved to him. \"Good morning. It's cold this morning, did you wear extra clothing?\" </span></p><br/><p><span>“Yes. Wen Ruoyi forced me to.\" </span></p><br/><p><span>“Oh.” Mu Sichao pinched his cheeks and put his face mask back on. \"Ruoyi came over so early in the morning in order to urge you to wear more clothes? It looks like it must be true love.\"</span></p><br/><p><span>“I was also choosing clothes for professor in the middle of the night last night. Professor and I are also in true love.\" Su Wenjun spoke in an icy voice from behind Mu Sichao.</span></p><br/><p><span>Xue Ling rolled his eyes at the protagonist gong and ignored him. He just asked Mu Sichao, \"Did elder brother catch a cold or something?\"</span></p><br/><p><span>“Oh, you mean the face mask?” Mu Sichao shook his head and said, \"Although I'm attending as an invited guest and giving out autographs, I don't intend to show my face. Generally, I always wear face masks when I go out to festivals or events.\"</span></p><br/><p><span>“Well, it's better to be safe~” Wen Ruoyi had already driven his car over while the two of them were speaking. </span></p><br/><p><span>Xue Ling went to sit in the back. Mu Sichao wanted to follow him, but Su Wenjun was one step faster and took his position, so it ended up being the three of them in the back row with Su Wenjun in the middle between the two brothers.</span></p><br/><p><span>Xue Ling tsked, then opened the door and got into the front passenger seat before turning to speak to Mu Sichao, \"Elder brother, this little boyfriend you've found is really jealous.” </span></p><br/><p><span>Su Wenjun was currently holding Mu Sichao’s hand tightly. Mu Sichao looked forwards and could sense that Wen Ruoyi was also looking at him with unfriendly eyes. He could only laugh at Xue Ling's words as he thought in his heart that the one currently driving was also a great vinegar eating demon - he was an even bigger one than Su Wenjun! </span></p><br/><p><span>But the key point was their positions! Compared to Wen Ruoyi, it was obvious that his own boyfriend hadn't even graduated from kindergarten yet.</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}