{"title": "Chapter 149", "id": 149, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-149", "volume_title": "Volume 2", "body": "<h1>Chapter 149</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>11.5 – There is another story set in this world</span></p><br/><p><em>translator: xiin</em><em>editors: alamerysl, BlueBug &amp; Macabre</em></p><br/><p><span>“Brother guard, as you can see, I am not a dangerous person. It's just that I got sick due to the long road we've travelled, and elder brother Mu was worried about me getting a chill from the wind, so he wouldn't let me come out.\" When his expression was gentle, it made others' hearts turn soft. Even passersby who were not involved in their discussion could not bear to say anything harsh to him when they saw him, so the guard at the door nodded and waved them on their way.</span></p><br/><p><span>It wasn't until the carriage curtain had lowered, the carriage wheels turning as the sound of hoofs hitting the ground gradually faded away, that Ying Sheng finally pulled himself together, a vibrant red flush spreading across his cheeks. It seemed as though his heart wanted to fly out of his chest.</span></p><br/><p><span>His agitated horse gave a loud snort as its front hooves struck against the ground, hoping its master would snap out of his daze. Instead, its master stroked its mane with his big hands. </span></p><br/><p><span>Ying Sheng urged the horse forward with his legs, and it charged forward as though it had never been allowed to run before, rushing headlong out of the city gates. The guards looked at each other, and finally chose to remain at their posts as though they had seen nothing.</span></p><br/><p><span>The guards had noticed Ying Sheng's figure when he stopped at the gates for a while, but they hadn't dared to disturb him. </span></p><br/><p><span>Shu Heng had arrived at the city much earlier than Xue Ling and Mu Ge, and already made all the necessary arrangements. Mu Ge drove the carriage into the city and brought them to an inn before settling Xue Ling in a guest room. The courtyard Shu Heng had found still needed to be cleaned. Because they had been in a hurry, he had not been too picky and selected the first one that was decent and purchased it in Xue Ling's name. </span></p><br/><p><span>Before they left the Capital, Shu Heng had acquired identity tokens for the three of them at Xue Ling's request. They made it easier for them to travel through Xue Kingdom without arousing suspicion.</span></p><br/><p><span>“Master, I’ve already found several people to clean up the cottage. Although it’s a bit worn down, after it's been cleaned out, it should be all right for us to wait out the year there. I will go out with Mu Ge to purchase some necessities so that Master can settle in comfortably.\" Shu Heng was so busy, he was turning around in circles, but he still remained very respectful towards Xue Ling. </span></p><br/><p><span>Xue Ling took off his hat, opened the window in the guest room, and leaned out. He noticed that the window was facing the backyard of the inn, and a plum blossom tree had been planted. The tree was in bloom, and the petals leisurely drifted to the ground. \"Shu Heng, you don't need to be so respectful when addressing me. I am now a child from a poor family. It's enough to address me as gongzi - you don't need to call me Master.\"</span></p><br/><p><span>“Yes, gongzi.” Shu Heng closed the window and frowned, “Gongzi has not yet recovered properly from his illness, it's best not to get a chill from the wind.\" </span></p><br/><p><span>“I’m not some easily-broken porcelain doll.” Xue Ling took off his cloak and lightly patted his own face. \"We don’t have much time for rest and recuperation. Mu Ge, go out and inquire about how the Zhennan Prince has set up the hierarchy here. It would be best if you can provide specific details, like who his people are and who he is close to so I know whom to approach.\"</span></p><br/><p><span>Mu Ge nodded. “Yes.”</span></p><br/><p><span class=\"jum\">“Speaking of the people under the Zhennan Prince…” Shu Heng hesitated for a moment, then said, “When I inquired about the courtyard, I heard some information.”</span></p><br/><p><span class=\"jum\">“Oh?”</span></p><br/><p><span class=\"jum\">“About a year ago, a new military advisor arrived at Zhennan Palace and was given an honorary position by the Zhennan Prince. They say that his wisdom is unparalleled and he is a monstrous existence that the Zhennan Prince has acknowledged. Moreover, he is still a ger, and it's rumored that they are a match made in heaven. Perhaps gongzi can start by approaching him?\"</span></p><br/><p><span>“Military advisor?” Xue Ling raised his eyebrows, his expression meaningful. \"That's really interesting. Mu Ge, focus on investigating this military advisor when you go out to gather information.\"</span></p><br/><p><span>“Yes.” </span></p><div><div></div></div><br/><p><span>After sending the two of them out, Xue Ling sat down and rubbed his forehead. He called the system out and asked, \"What's going on? Where did this military advisor come from?\" </span></p><br/><p><span>“Oh? Didn't I tell the host about this before?” The system swished its snow-white tail and sent Xue Ling the details for another story. “In fact, the author did not only write the story of Prince Xian and Li Yuan in this world. There is another story set in this world.\" </span></p><br/><p><span>It was the first time Xue Ling had encountered such a situation. He was a little curious, and wanted the system to explain it properly.</span></p><br/><p><span>“Some writers create a world, and then continue to write another story in the same world that the first story was set in. The next story may or may not be related to the original story.” </span></p><br/><p><span>“Is it because of the second story that you told me to choose the Zhennan Prince?”</span></p><br/><p><span>“Yes, there are two stories in this series. One is about Li Yuan and Prince Xian, which ended after they got married. That is to say, that story is over now. The author then added another story that was based on their successful rebellion. The main character of this story is a time traveler who came to this time period from the modern era. That means that the happenings of this current dynasty were recorded as history for him, and the reason he came to these ancient times was to change the history of the world.\" </span></p><br/><p><span>“Huh?” </span></p><br/><p><span>After the Xian Prince ascended the throne, he tried hard to govern, but because Xue Kingdom's structure had been fixed in place for a long time and the cracks had existed for so long, it was impossible for it to recover in his lifetime. In addition, as he got older, he began to miss Li Yuan's love for him more and more, but Li Yuan had died in the cold palace long ago. The more he missed him, the less heart he had to govern. After his death, the next Emperor returned to their previous old habits and indulged in decadence until the Xue Princedom was thoroughly set on the path to destruction. </span></p><br/><p><span>The time traveler had a special fondness towards this era. He was a student from the Chinese Department, and was rather solitary. He felt that his life should be devoted to his love of words, and his favorite person was actually the Zhennan Prince 'Ying Sheng' from the histories. But Ying Sheng's ending in history was not good - he was assassinated. The chaos that resulted in the south due to his demise accelerated Xue Kingdom's demise. The time traveler was deeply concerned about his death. Perhaps he felt too strongly about it, because one day, when he woke up, he found that he had crossed over to this period in history. </span></p><br/><p><span>Ying Sheng was still alive, and the Xian Prince had just ascended the throne. Everything could still be changed, so he started planning to change Ying Sheng's fate step by step. The fact that he was different from others made Ying Sheng notice him, and they slowly got to know each other and fell in love, but it wasn't until this military advisor took the brunt of a blow meant for Ying Sheng that they finally abandoned the worries they had in their hearts and got together. Then, they fought their way to the capital, unified Xue Kingdom, and changed history. </span></p><br/><p><span>Xue Ling took in such a touching love story, and his eyebrows wrinkled in an increasingly fierce frown. \"It looks like the author deliberately set Li Yuan up…\"</span></p><br/><p><span>“That's right. In fact, host’s task is quite special. In order to affect all four of these people, the ultimate key is not Xian Prince, nor is it Li Yuan. The most important person is the Zhennan Prince.\" </span></p><br/><p><span>“Why didn’t you say that before?” </span></p><br/><p><span>“… Well, host didn't ask… You just wanted to know the plot that was related to Li Yuan, and didn't ask about the Zennan Prince.\" </span></p><br/><p><span>Xue Ling didn't need to think about it to understand that the system was intentionally increasing his workload. He was too lazy to mess up the system's fur; he frowned and tried to find a way to deal with this time travelling military advisor.</span></p><br/><p><span>“Prince Zhennan… I originally thought it would be okay to simply give him the position of Emperor, but now it looks like… I still need to sit in this seat…\" In that case, this problem became more complicated. \"But this way, there's nothing I can make use of…\" </span></p><br/><p><span>“Host, why do I suddenly feel so nervous now that you're contemplating how to handle this task so seriously…?\" </span></p><div><div></div></div><br/><p><span>“If you didn't drop me into a trap, would I need to do so much now?\" Xue Ling picked up the system and finally buried his entire face in the system's white fur out of frustration. \"Forget it. Even if nothing else works, I still have my charm ability. I don't believe that I'm unable to deal with a mere Zhennan Prince!\" </span></p><br/><p><span>“Host doesn't have to be so upset…” The system whispered conspiratorially, “Maybe he's that person?\"</span></p><br/><p><span>Xue Ling knew what it meant. He tsked and said, \"Don't you think doing it this way is cheating?\" </span></p><br/><p><span>“Are you still my host? Didn’t you cheat the whole way?!” The system felt a little weirded out with its host behaving so seriously. It was too scary when its host acted like he didn't even have time to play around with his lover! </span></p><br/><p><span>“So what if it's him? There’s already a military advisor who has been around him for a year. Even if I want to get close, the other party still needs to want me. I'm telling you now, if I end up being the mistress, I'm going to get revenge.\" </span></p><br/><p><span>System: “…” How come it could feel a chill running up its spine? He was angry, wasn't he! Its host was definitely angry! </span></p><br/><p><span>“Host, maybe they don't have chemistry and nothing came out of it. After all, if it really is that person, you also know his character…\" It had dug so many pits for him, but he never jumped in. How could he suddenly turn around and like someone else in this world?~ </span></p><br/><p><span>Xue Ling sneered. Everything he was doing now was only based on suppositions. Before he genuinely came into contact with the Zhennan Prince, none of this mattered. As a matter of fact, he still needed someone to introduce him… and this person… could only be protagonist shou from the second story.</span></p><br/><p><span>Now that he had decided to meet that person, Xue Ling tidied up the things in the room, tugged on the cloak that was wrapped around him, and prepared to rest for a while.</span></p><br/><p><span>This body of his could not afford to go out for a walk after running around all day. </span></p><br/><p><span>He was resting peacefully at home, but the Zhennan Prince had no way to rest. He also didn't know that his past and future had possibly been picked clean. Right now, the Zhennan Prince was urging his horse to speed through the countryside in order to calm down his restless heart. </span></p><br/><p><span>He had been free of desire for so many years that even his subordinates stopped urging him to find a ger he could care of, believing that he might simply not have such needs. But in fact, he just felt that he needed to wait for a certain someone. While waiting for him, he could not be interested in other people, because that person would be very angry. He did not want to bear his anger, so he had kept his heart pure and limited his desires for so many years. </span></p><br/><p><span>But just now, he clearly felt the aura of the person he had been waiting for… Ying Sheng had not gone forward because he did not want the other person to misunderstand and think he had bad intentions. After all, anyone who went up and started to chatter after a single glance would never leave a good first impression, and he wanted to create a perfect first meeting. </span></p><br/><p><span>The man that had been standing next to that person said that they were going to Zhanjing to stay with their relatives, right… </span></p><br/><p><span>In that case, the Lantern Festival held after the New Year would be a good opportunity to meet him. Even people who were new to the city would participate in the Lantern Festival. He could strive to make a good impression on the little ger then. </span></p><br/><p><span>The Zhennan Prince, who had no idea that the other party had actually come here to find him, was contemplating how to create a perfect first encounter. The best possible outcome would be to have the little ger fall in love with him at first sight… </span></p><br/><p><span>He knew that many ger had crushes on him, and that his popularity had always been very high, but for some inexplicable reason, he was very worried that the other party would look down on him…</span></p><hr/><br/><p><em>zryuu (dmlations) looking for a rec the other day on discord reminded me of , which is a rebirth entertainment world korean BL novel~ it was finished a really long time ago, so maybe some of you have never read it? </em><em>(warning: the gong is a little intense…)</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}