{"title": "Chapter 155", "id": 155, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-155", "volume_title": "Volume 2", "body": "<h1>Chapter 155</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span> 11.11 – </span><span>Why did this scene seem a little wrong?</span></p><br/><p><em>translator: xiin</em><em>editors: alamerysl, BlueBug &amp; Macabre</em></p><br/><p><span>“There's still half a month to go. You're already so weak, are you sure you can hold on?\" Ying Sheng watched as the small amount of meat he'd put back on Xue Ling's body slowly disappeared, and his mood turned terrible. He held Xue Ling's hand and touched his forehead. It was very fortunate that it was just that his body was unaccustomed to the stress - there was no fever or anything else.</span></p><br/><p><span>“It was like this when I came to the South. It's fine,\" Xue Ling frowned. The motion of the vessel was not as harsh as it had been before, but for some reason there was simply no way to avoid seasickness in this body. He had not been able to remain upright for a full day ever since they boarded the boat, and had to lie down and play dead all the time. His bones were about to rattle apart, and he couldn't eat much because he wasn't able to get up and move around. It eventually became a downward spiral, and the flesh he had regained on his frame with much difficulty faded away day by day. </span></p><br/><p><span>Ying Sheng squeezed his hand and said, \"I'm sorry, if I had known that the Capital had you back then, I would not have let you end up in the situation you're in today.\" </span></p><br/><p><span>Xue Ling shook his head, \"It was fate. Some things will not happen without a catalyst. Perhaps you would not have fallen for me if you were in the Capital?\" He curved his lips. His hand was held in Ying Sheng's, so he used his fingertip to draw circles on Ying Sheng's palm. \"After all, the person I was in the Capital had to rely on ointment to hide my cinnabar mole every day. I sat on the dragon throne, but couldn't touch or influence anything~\"</span></p><br/><p><span>Ying Sheng lifted his hand and kissed the tip of his fingers. \"I've never seen how dazzling and inspiring you are on the dragon throne. Now that we are going to the Capital, I have to see that wonderful scene with my own eyes.\" </span></p><br/><p><span>Xue Ling laughed and said, “Even if I go back, there won't be much to see. You must know,\" He reached out his hand to brush over the cinnabar mole in the corner of his eye. \"I'm a ger. I have no plans to hide the fact.\"</span></p><br/><p><span>“If anyone disagrees,” Ying Sheng tugged on the hand that he was using to cover his cinnabar mole, \"I will kill them. If they still refuse to accept it, I'll kill their entire family. I'll kill until there is nobody who dares to question or disobey you.\" </span></p><br/><p><span>Xue Ling didn't know whether to laugh or cry. He now understood why people kept emphasizing that Ying Sheng was 'ruthless'. Only, it seemed that he wasn't utilizing it in the right direction. \"They are all my future ministers. How can you just kill them as you like…\" </span></p><br/><p><span>“I'm the one making a move, it's not related to you at all.\" Ying Sheng did not seem to be joking as he said these words. He looked absolutely serious, and seemed to already be considering how to kill them off so that it would not cause any negative impact on Xue Ling.</span></p><br/><p><span>Xue Ling was too lazy to correct him. He recalled that he hadn't heard any news from the Capital today, and opened his mouth again, \"What's the current situation in the Capital?\" </span></p><br/><p><span>“Nothing unusual. Li Yuan has control over Ji Rongha's intelligence organization, so if he doesn't want Ji Ronghan to know something, he won't know about it.\" Due to their suggestions, Li Yuan gradually distanced himself from Ji Ronghan, making him less guarded against him. Although it was not a good way to treat one's lover, it was the best choice Li Yuan could make right now. </span></p><br/><p><span>They did not have their own army. If they really clashed head on with the Zhennan King's army, they would suffer severe casualties, which would run counter to what he had originally wanted to achieve. If possible, he did not want the soldiers in the Capital to be injured, nor did he want those injuries to be caused by their actions, having sent them to their deaths while knowing that they had no chance of winning. </span></p><br/><p><span>Li Yuan cherished the whole world, and was not suitable for leading an army. He was even less suited for being a decision maker, because he was never willing to sacrifice anyone. Of course, the reason he made the decision this time was very compelling; he simply did not have enough power or strength in his hands. </span></p><br/><p><span class=\"jum\">“The Mo Bei General's Qi Family has never participated in court struggles. If you can really win back the Capital and make the Shu Prince obey, he will naturally accept your oversight.\" Now that they were discussing the kingdom, Ying Sheng had his own opinions to share. \"If you like, I can help you take back the territories that originally belonged to you.\"</span></p><br/><p><span>Xue Ling looked at him for a long time and said, “Yes. If you can really take back my Ji family's land, the position of Emperor's consort will be formally yours.\" </span></p><br/><p><span>Ying Sheng leaned in close to him and said, \"I have to lay the kingdom at your feet in order to claim that position?\" </span></p><br/><p><span>“That's true, always giving you empty promises isn't very nice.\" Xue Ling's hand brushed across the hair at his temples. He blinked, and the tip of his tongue stretched out to lick his lips. \"In that case, you can have that position before you head out.\" He leaned closer, and whispered to Ying Sheng, \"After you return, I'll let you do it on the throne once.\" </span></p><div><div></div></div><br/><p><span>Ying Sheng's eyes brightened. He could already imagine how dazzling this person would be when he sat on the throne. And to press that version of him under his body…</span></p><br/><p><span>He had some difficulty controlling his reaction as he imagined that scene.</span></p><br/><p><span>Ying Sheng bowed his head and bit mercilessly at Xue Ling's lips. \"You win. I really have no way of gaining the upper hand in this life!\" </span></p><br/><p><span>Xue Ling grinned cheerfully as he pulled back. The expression on his face was very natural, and it was completely different from what he had just said. </span></p><br/><p><span>Half a month’s journey was nothing to the Zhennan King’s army, which was well accustomed to naval battles. By the time the fleet arrived at the Capital, all the soldiers were in great spirits, and not depressed from their journey on the water at all. </span></p><br/><p><span>Xue Ling put on a cloak and went to the prow of the ship to watch the soldiers disembark. </span></p><br/><p><span>They were at the Jinji Ferry Port, which was where he had left the Capital from back then. Over the passage of time, the Capital had given up guarding the port altogether. Instead, it pushed its defensive line outwards as it expanded. But the funny thing was, when the Capital was built, nobody expected an approaching army to come by water, so this water route was left completely unprotected. The checkpoints were located further away, and when the soldiers set out from Jinji Ferry Port, they could reach the gates of the Capital without having to pass by any of the checkpoints. </span></p><br/><p><span>The Capital was not in a position that made it difficult to attack and easy to defend; it was unknown where Ji Ronghan had gotten his confidence that allowed him to think that he would be able to resist Ying Sheng's attack with just the imperial forces from the city and the soldiers stationed outside. </span></p><br/><p><span>Xue Ling did not go to the front lines when the sounds of warfare began. He stayed behind on the vessel - his body had finally recovered, and Ying Sheng did not want him to go to the battlefield. Xue Ling also had no interest in watching the show. </span></p><br/><p><span>They never intended to fully commit to this battle. Li Yuan had communicated with them long ago; as long as the army neared the city gates, his people would open the city gates to let them in.</span></p><br/><p><span>It was not really a conspiracy or treason. It was more of a mutual acknowledgement. </span></p><br/><p><span>In any case, Xue Ling had the system on hand. Even if he remained at the back, he was still aware of what was happening on the front lines and could keep a firm grasp on the situation.</span></p><br/><p><span>Chen Jingzhen stayed behind with him. Despite being a military advisor, he had not had many opportunities to assist this time. He had been studying all kinds of relationships and distribution of power in the Capital during the entire journey, preparing to deal with all the forces that could threaten Xue Ling in the future once the army entered the Capital and took over. </span></p><br/><p><span>As Xue Ling had predicted, this battle never truly began. Within three days, the army took over the entire Capital. Ji Ronghan was trapped in the palace, and almost killed Li Yuan in his rage.</span></p><br/><p><span>Li Yuan didn’t know what to say to calm him down and could only have others restrain him so that he could be dealt with after Xue Ling entered the palace. </span></p><br/><p><span>Everything he had done during the two years after his rebirth seemed meaningless during these past three days. Even though Li Yuan knew that he had chosen to do the right thing, he was still very lost and confused. </span></p><br/><p><span>His large wedding to Ji Ronghan seemed like just yesterday, but everything had become blurred and none of it was clear at all. Li Yuan laughed. He no longer knew what he was persevering for, or what he was upholding, or even what he was pursuing. </span></p><br/><p><span>When the army marched into the Capital, many great families were destroyed overnight. The most prosperous and powerful families were unable to rise up under the army's attack, and for a while, everyone in the Capital was under threat as everyone realized that the title of Zhennan King was not an empty one. If he was provoked, the man could really do anything. </span></p><br/><p><span>As for the Emperor who could save them all and change their fate, he was currently sitting around idly, cracking melon seeds with Chen Jingzhen and discussing which family Ying Sheng would be allowed to visit tomorrow. </span></p><br/><p><span>This was the scene Li Yuan saw when he was brought aboard the vessel. He had thought that he would be sent away like Ji Ronghan, but he had been escorted on board instead. </span></p><br/><p><span>When Xue Ling saw that they had a guest, he raised his brows slightly and spoke in some surprise, \"You've been sent over so soon? It looks like Ji Ronghan really is the worst kind of waste.\"</span></p><br/><p><span>Li Yuan still had not realized who the person in front of him was, and it was only because the person behind him spoke that he clued in. \"Your Majesty, please pay attention to your image.\" After that, Li Yuan looked at Xue Ling in astonishment. He completely could not believe that the ger in front of him was Ji Yunhua.</span></p><br/><p><span>Xue Ling shrugged his shoulders lazily, but still straightened up in his seat. \"What, do you no longer recognize Us now that we are not exchanging letters?\" </span></p><br/><p><span>Li Yuan shook his head and said, “I just didn’t think that you…” He looked at Chen Jingzhen, who was standing beside Xue Ling, and was rather confused about what was going on. \"Why did you bring me here?\" Apart from having been an Empress for a while, he was nothing special in other people's eyes. Ji Ronghan had already fallen, and in fact, his life was probably already over.</span></p><div><div></div></div><br/><p><span>At the thought of how Ji Ronghan had looked at him before he left, Li Yuan felt that life was bleak. </span></p><br/><p><span>“What are you thinking about?” Xue Ling stood, then lifted a hand to knock on Li Yuan's head. “I want to make a bet with you.”</span></p><br/><p><span>“What bet?” </span></p><br/><p><span>“Gamble on your position in Ji Ronghan’s heart.” Xue Ling smiled and patted Li Yuan on the shoulder, then asked, “Do you think he loves you more than the throne, or vice versa?”</span></p><br/><p><span>Li Yuan frowned and did not reply. He was not a person that placed love above all else. Ji Ronghan already knew that he had been colluding with Ji Yunhua. Before they separated, he even asked himself why he had not seemed pained at all… His heart ached, but he felt that these feelings of his were not worth gambling over. He sneered, \"Your Majesty doesn't find it ridiculous to say such things?\"</span></p><br/><p><span>Ever since Ji Yunhua had begun to contact him, he had gradually begun to understand what kind of relationship existed between himself and Ji Ronghan. The other party clearly had both of them in his grasp, but still wanted to make this kind of bet. \"What kind of treasure does Your Majesty want to use in this bet that I will definitely lose?\" </span></p><br/><p><span>“It's not any great treasure. Instead, it's your freedom.\" Xue Ling did not care about how ugly Li Yuan's expression was as he spoke. Since it was the so-called path of his own choosing, he had to reach the end even if it was on his knees. \"I want you to become a Prime Minister for me. I don't know if you are willing to trade your freedom for this power.\" </span></p><br/><p><span>Li Yuan looked at him in surprise. Xue Ling raised his hand to stop him from speaking as he continued, \"I promised you before that if you helped me take over the Capital, I would let Ji Ronghan live. He will be sent to the South. That is Ying Sheng's territory. He will not have to worry about food and clothing, nor will he have any burdens for the rest of his life. As for you, you will stay in the Capital. Perhaps there will be a day when all the unrealistic thoughts in Ji Ronghan's head will disappear, and he will remember your good points.\" </span></p><br/><p><span>Li Yuan pressed his lips together. He did not understand. \"Why me?\"</span></p><br/><p><span>“Probably because you're one of the few people who understand.\" Xue Ling cocked his head, and pointed at Chen Jingzhen who was standing beside him. \"If you are willing, the two of you will be my Left and Right Prime Ministers. With you two as my beloved subjects, the court will be much more interesting in the future.\"</span></p><br/><p><span>Li Yuan looked at Chen Jingzhen and felt unsettled. Before he married Ji Ronghan, his temperament had been similar to Chen Jingzhen. At the moment, the other party seemed to be just like how he had been; full of ambition and thoughts about changing the fate of this kingdom. But, he had fallen into the abyss called 'Ji Ronghan' and had now seen the first rays of light that led towards leaving that place while Chen Jingzhen was already standing in the light. It was only one step away, but could he also reach the summit? </span></p><br/><p><span>“… I…” He hesitantly opened his mouth, but was stopped by Xue Ling. \"You don't have to force yourself. Perhaps you can discuss it with Jingzhen first. I believe you will like him.\" </span></p><br/><p><span>Chen Jingzhen stood up as well and said, \"Li gongzi, please follow me. We will stay on the boat for the time being and wait until His Royal Highness has prepared the throne ascension ceremony. Based on His Royal Highness' personality, you will have a very long period of time with which to adapt to His Majesty's schemes.\" </span></p><br/><p><span>Li Yuan wanted to know exactly what was going on. He was still a bit confused, but Chen Jingzhen had already pulled him away. On the way out of the cabin, they met Ying Sheng, who had just rushed back. </span></p><br/><p><span>Li Yuan even brushed against Ying Sheng, but the other party did not even look at him. Even Chen Jingzhen did not seem to have any intention to stop and say hello to him. </span></p><br/><p><span>“In the future, you will understand. His Royal Highness does not have many opportunities to return. If you salute and greet him, you will be wasting his time, and he will ignore you.\"</span></p><br/><p><span>Li Yuan: “???” They all said that the Zhennan Prince was the son of a businessman, polite and courteous. Although his means were vicious, he never made the other party feel uncomfortable when they met. </span><span>Why did this scene seem a little wrong? </span></p><hr/><br/><p><em>XL’s turning into an even bigger tease~  poor ML</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}