{"title": "Chapter 157", "id": 157, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-157", "volume_title": "Volume 2", "body": "<h1>Chapter 157</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>11.13 – Finally… had he managed to find the Boundary Master? </strong></p><br/><p><em>translator: xiin</em><em>editor: Macabre</em></p><br/><p><span>Summer was nearing its end. Catching up with the last days of summer, the army was ready to set out again. </span></p><br/><p><span>Their destination was the Wang Family in the North, a large family that had been prominent for generations, their line of inheritance continuing uninterrupted. Their people had been spread across the North since long ago, and even if they surrendered, it would be very difficult for Xue Ling to make a move against them. What's more, the Wang Family had no intention of establishing positive relationships with Xue Ling at all. </span></p><br/><p><span>The terrain they occupied was in the North, and advantageous to them. The Wang Family seemed fearless, but Ying Sheng set out with a laugh and told Xue Ling that he was inviting him to watch a good show. </span></p><br/><p><span>Xue Ling was not worried that there would be things he couldn't achieve. He simply helped him adjust his armor and told him, \"I hope you can come back before the New Year.\" </span></p><br/><p><span>Ying Sheng met his eyes, laughed, and bowed his head to kiss his forehead. \"I will. When I come back, I will accompany you to see the Lantern Festival in the Capital.\" </span></p><br/><p><span>Xue Ling was stunned for a moment, then recalled what he had said to the man on the fifteenth day of the New Year. He couldn't help laughing, and any lingering worries were thoroughly let go. \"Good. I'll wait for you to return in triumph.\" </span></p><br/><p><span>Ying Sheng's army set out towards the autumn wind, and Xue Ling also turned back to begin dealing with matters regarding the Shu King. </span></p><br/><p><span>The Shu King had written to him to tell him that his royal mother was being well taken care of. He would bring the Empress Dowager with him to visit the Capital and see Xue Ling. Xue Ling had replied with a letter saying that they were warmly welcomed, then turned around and laid down orders through Mu Ge. As soon as the Shu King entered the Capital, he would bring his people to seize him as quickly as possible. </span></p><br/><p><span>Xue Ling had already prepared charges for him as well as Deng Shi, and would not let them go so easily. Under normal circumstances, if they did not intentionally jump up in front of him, Xue Ling would have been too lazy to deal with them. Only this time, the Deng Family had left their brains behind when they fled in such a hurry, and believed that Xue Ling was still the same Emperor from the past that they could manipulate. They thought that he had only returned to power thanks to Ying Sheng's support, and were now in a hurry to come back and take control once more.</span></p><br/><p><span>Xue Ling was ready to charge Deng Shi and the Shu King with the crime of poisoning the former Emperor. Once this charge was carried out, the entire Deng Family and all nine generations would be implicated and executed, their properties confiscated. The Shu King would also have to die; unfortunately, he was an Imperial Uncle, and Xue Ling had no way to condemn his entire family to death together. </span></p><br/><p><span>After making the preparations to deal with these two people, the trajectory of this world had already been thoroughly adjusted. </span></p><br/><p><span>Li Yuan’s life was very busy now, but everything he did was practical and useful. After successfully putting his ideas into practice one by one, he finally understood why he had felt empty and disconnected from reality when he had been with Ji Ronghan. It was probably because Ji Ronghan had only considered himself, and not the people of the kingdom. </span></p><br/><p><span>The people who lived in the Capital were more intimately aware of what changes the Emperor had brought to their lives. Based on this year's policies, the common people had surplus food by the end of the year, and on several occasions, they felt proud when they discussed the Emperor - even if he was a ger. </span></p><br/><p><span>The common people did not care about the identity and status of the person at the top. As long as they brought positive changes to their lives and made the kingdom more prosperous, they would consider them to be wise rulers, and such rulers were worthy of their respect and support. </span></p><br/><p><span>Xue Ling prevented the collapse of Xue Kingdom by eliminating its root cause. He even found a small child from the royal lineage and began to train him as the next Emperor. The imperial clan had never lacked for children, and Xue Ling had decided on this boy at a glance. He brought him into the palace and immediately gave him the position of Crown Prince. Despite the courtiers' objections, he directly added him into the Royal Family's genealogy, changed his name, and had him marked down as his child. </span></p><br/><p><span class=\"jum\">This process was discussed with Chen Jingzhen. As a Prime Minister, Chen Jingzhen also had to work on several things at once. Other than working for Xue Ling, he was also entrusted to take care of that child. Xue Ling wrapped the matter in nice-sounding phrases, saying that the child would have a broader vision if he followed Chen Jingzhen, and would be able to better understand the future and lead Xue Kingdom down the road they wanted it to take.</span></p><br/><p><span>It was unknown if Chen Jingzhen truly understood what Xue Ling meant, but he began to instill some advanced modern ideas into the child. Xue Ling had no intention of preventing it, and sometimes, when Li Yuan passed by to listen to him teaching the child, he could feel sweat forming all over his head. He really wanted to sit down with Chen Jingzhen and have a proper chat about life.</span></p><br/><p><span>Ying Sheng returned in triumph before the New Year. Xue Ling held a grand banquet for him, and then told him that their child was already six years old and could already go off on his own and <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-085a2e\">buy soy sauce</span>. </span></p><br/><p><span>Ying Sheng had a confused expression on his face at first, but after he saw the child, he stopped talking. </span></p><br/><p><span>That night, the Emperor brought his Imperial Consort to the Shenglong Palace. <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-2ced7d\">Things that could not be described took place for a long time</span>, and the Shu Heng that had to tidy things up after them felt that like his life was rather pitiful; His Majesty's fooling around had become quite excessive recently.</span></p><div><div></div></div><br/><p><span>The courtiers did not know how His Majesty persuaded his Imperial Consort to accept the Crown Prince, but since the ferocious Imperial Consort had already accepted it, as ministers, there was no longer any reason they could use to object to it in front of His Majesty. Other than the courtiers who always threatened to slam their heads against the floor in protest, the remaining courtiers had long become accustomed to His Majesty's way of doing things. </span></p><br/><p><span>Wasn't it just that he was doing things at random? It was fine as long as they became accustomed to it. Things were good as long as His Majesty was happy. </span></p><br/><p><span>His Majesty was still so young. Perhaps His Majesty would be able to think things through clearly after he gave birth to his own child? </span></p><br/><p><span>Of course, they did not know that their injustices would not be addressed in this life. Although Xue Ling was a ger, had a red cinnabar mole to prove it, and none of the necessary organs were missing, it was impossible for him to have children. </span></p><br/><p><span>The reason was probably because… It was too embarrassing? </span></p><br/><p><span>After the New Year, the Shu King brought the Empress Dowager back to the Capital, and was surrounded by the imperial guards as soon as he entered the city gates. The leader of the Imperial Guards was the former primary enforcer of Six Leaf Gate, Mu Ge, who brought along an imperial decree, captured everyone the Shu King had brought with him, and threw them into the imperial prison. The Shu King and Deng Shi's plot to poison the former emperor was publicized, and the Emperor seemed to have no intention to preserve the imperial family's dignity. The matter kicked up a big fuss, and after everyone in the kingdom knew about it, all nine generations of the Deng Family and the Shu King were executed. Shu territory once again fell into the hands of the kingdom. </span></p><br/><p><span>With this, all the forces that were part of Xue Kingdom had at least submitted to Xue Ling in name, which could be considered unification to some extent.</span></p><br/><p><span>Over the next five years, the central government took complete control over the branches of territories, and people in various places were replaced by those loyal to the throne. All power was centralized in the Capital, and Xue Ling thoroughly completed the centralization of the government that he had originally intended to achieve. </span></p><br/><p><span>Although this kind of system will gradually relax along with the development of the times, it was at least very suited to the present situation.</span></p><br/><p><span>Five years could change a lot, but some things would never change.</span></p><br/><p><span>Ji Ronghan had begun to reflect on himself and had always wanted to go back to the Capital to see Li Yuan, but Li Yuan had no intention of seeing him. His heart was filled with his concern for the people, and he had already thrown himself into the cause of serving the people. At the age of eleven, the little Crown Prince was already a man who could be entrusted with heavy responsibility. After studying with the Imperial Consort these years, he had become much steadier, and could put forth many good suggestions. Xue Ling had already allowed him to participate in politics.</span></p><br/><p><span>Xue Ling and Ying Sheng did not have any children of their own despite having been together for so many years, and had always raised the Crown Prince as their own child. Given the Crown Prince's talent and intelligence, he had the makings of a good future Emperor, so the courtiers gradually adapted to the situation. </span></p><br/><p><span>Currently, the imperial court was injected with quite a lot of new blood. The entire imperial court was now very vigorous, and the atmosphere during morning court was much different from how it had been previously. </span></p><br/><p><span>They had already reached a point where Xue Ling could let them run the government by themselves while he spent his days lying in the Imperial Consort's embrace and whiling the time away. After the Crown Prince grew older, he would be able to delegate his power to the Crown Prince, and then take Ying Sheng with him to travel around the world. </span></p><br/><p><span>The more they looked forward to it, the more quickly time went by. Very soon, the Crown Prince had reached his coming of age ceremony. He asked Xue Ling to bestow him a marriage, and successfully brought the Left Prime Minister, Chen Jingzhen into his palace. The Crown Prince had been ecstatic before the wedding, but he had not expected that he would be given such bad news after the wedding celebrations…</span></p><br/><p><span>His Royal Father had directly abdicated, and given him his position. He had taken the Imperial Consort with him and run away.</span></p><br/><p><span>The Crown Prince was angry to the point of speechlessness. Was this how it felt to be given candy only to be punched in the head? He was caught off guard! He had only just emerged from the <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-467ea4\">gentle countryside</span>, and hadn't even had a chance to bring his Princess to travel around the kingdom. Why was he the Emperor? His father was so despicable! </span></p><br/><p><span>Although he had a heart full of criticism, the Crown Prince ultimately had no other choice, and ascended the throne. During the grand ceremony to confirm his ascension to Emperor, Chen Jingzhen was promoted from Left Prime Minister to Empress. </span></p><br/><p><span>Of course, being an Empress did not prevent him from attending court. After all, with the Zhennan King as an example, the courtiers would be able to accept it even if the pair of them were even more unconventional. Everyone wanted to express that the matter of the imperial family being capricious was not a recent matter; it was a small thing for the Empress to attend morning court. Hadn't the current Right Prime Minister been an Empress back then? </span></p><br/><p><span>Li Yuan: “???” How come he had been shot while lying down??? How was this related to him in any way!!! </span></p><br/><p><span>Ten years passed. Xue Ling and Ying Sheng first went to Zhanjing, where Ying Sheng insisted on bringing him to enjoy another Lantern Festival where they first met. </span></p><br/><p><span>“I thought back then that since the crowd had pushed you into my arms, it meant that you should be mine from that day on.\" </span></p><br/><p><span>“Come on, you really think I didn’t know that the people who pushed me that night were yours?” </span></p><div><div></div></div><br/><p><span>“Baby, you agreed not to ruin the atmosphere today.\"</span></p><br/><p><span>“Fine.”</span></p><br/><p><span>After that, they travelled all over Xue Kingdom. Other than sending a letter back every year, they never disclosed any other hints of their whereabouts. </span></p><br/><p><span>Slowly, the Crown Prince had already been an Emperor for over ten years. He was accustomed to his position, and could be regarded as a wise ruler. Only then did his two fathers finish their travels and return to the Capital. </span></p><br/><p><span>Xue Ling and Ying Sheng rested for a few years, then left again. They went to sea, and left Xue Kingdom in order to go further afield.</span></p><br/><p><span>In this world, Xue Ling and Ying Sheng traveled far and wide. The two of them saw countless Lantern Festivals, but ultimately chose to settle down in Zhanjing, the place where they first met, and quietly waited for the separation that they had already experienced so many times before. </span></p><br/><p><span>When death arrived, Xue Ling was in a trance as he once again attempted to enter the sea of his memories. </span></p><br/><p><span>This attempt was different from the previous one. This time, he could already feel that the version of himself contained within his memories had begun to move. </span></p><br/><p><span>In his memory, it was a dark, moonless, and windy night. He had appeared alone in the middle of a dark forest, and it was an Elder of the clan that picked him up, brought him back, and gave him a name. </span></p><br/><p><span>“His fur is so white, and he showed up in the snow. If my eyes weren't so sharp, I'm afraid he would have frozen to death in the snow.\" The Elder placed him in his palm, and lifted him up to look at him again. \"Oh, you're still breathing. I don't know which family you belong to, so I'll keep you for now.\" </span></p><br/><p><span>“This fur is so beautiful. Don't mess around. It'll be terrible when his family comes looking for him. Everyone will be disturbed by this matter by then.\" </span></p><br/><p><span>“Who cares. I picked it up, so it’s mine.” He was still a small little thing, and he was carried by the Elder as he wandered back to his shabby hut. The Elder placed him inside his warm furs, then stared at him for a while and said, \"You're so white. I'll call you Xue Ling, then.\" </span></p><br/><p><span>Xue Ling was already no longer the little fox that had been frozen to the point of unconsciousness now. He let out a sigh of relief when he heard the Elder's words, and could only be grateful that the Elder had not displayed one of his sudden fits of foolishness. At least, he had not said, \"You're so white. I'll call you Little White.\" </span></p><br/><p><span>He really did not want to spend his entire life with a name like that.</span></p><br/><p><span>Xue Ling knew what happened afterwards, because those were the memories of his childhood. But when he recalled them, he had no concept of time. Time had passed by so quickly it was as if it had flown away; he grew up all at once, and then foolishly fought with that Taoist Master. </span></p><br/><p><span>Later, he incarnated into a child's body, and that child transmigrated. He followed that child's soul, and was brought into another world. </span></p><br/><p><span>Xue Ling suddenly came to a realization. Indeed, he remembered the child was the reason why his spiritual body had been completed. He was then able to separate himself from the child and move independently, so he bid farewell to the child and set out on the path to find the Boundary Master.</span></p><br/><p><span>Xue Ling’s thoughts stalled when he considered the Boundary Master.</span></p><br/><p><span>Now, when he looked back, he discovered something very interesting. According to what he had learned during his time around the child, the world that the child had transmigrated into was also a fictional world. But, the rules of that world were perfect, and he had really managed to find the Boundary Master in that world.</span></p><br/><p><span>Boundary Masters were a very special group of people. They had the ability to control the rules of the world and connect with people inside and outside of each world. In other words, they could allow others to transmigrate. In ordinary Boundary Master families, they would only have one Boundary Master inheritor every several hundred or thousands of years. If this person was able to live until their Year of Destiny, they would obtain the powerful abilities of Boundary Masters, and be able to travel through time and space - as well as send people away from the time and space they were currently in. </span></p><br/><p><span>Like this, Xue Ling suddenly understood why he had appeared in the snow back then. He remembered that he had been looking for the Boundary Master in order to understand why he should have been left in that world, but was sent to another world instead. According to the memory he had obtained last time, the reason he had been able to transfer worlds was due to a Boundary Master's power. The purpose was very simple - it had been done to keep him alive.</span></p><br/><p><span>Then, there was the next question. Why would he have been unable to live on? Or, to ask another question, what exactly was he? As a Nine-Tailed Fox, Xue Ling began to doubt his own origins for the first time. He did not doubt his own identity, but he wanted to understand his birth, and how he had come to be in this world. He also wanted to know why that world did not allow him to exist, and why he was forced to change worlds in order to survive.</span></p><br/><p><span>Finally… had he managed to find the Boundary Master?</span></p><hr/><br/><p><em>again, smut scenes will be added on as extras after WTMT’s main story is complete~ as a sidenote, we’re actually over 3/4 of the way through!  almost there, guys!</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}