{"title": "Chapter 168", "id": 168, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-168", "volume_title": "Volume 2", "body": "<h1>Chapter 168</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>12.11 – I seem to enjoy touching and getting close to you </strong></p><br/><p><em>translator: xiin</em><em>editors: alameryl, BlueBug &amp; Macabre</em></p><br/><p><span>\"Oliver! I already left you a way out back then! I never expected that you would still be obsessed to the point of committing the terrible crime of breaking into the palace! If you acknowledge your wrongdoings now, I can still spare your life. Otherwise, things will not end as simply as the termination of a contract!\" Kent's words contained some serious implications. He roared fiercely into Xue Ling's face, but it was as though he was speaking loudly to compensate for his lack of courage. </span></p><br/><p><span>Xue Ling thought the whole situation was rather amusing. He sneered and said, \"In that case, thank you, Your Highness, for allowing me to live until today. If it hadn't been for Your Highness, perhaps I would still be in the Demonic Beast Forest, not even aware of what the palace is.\" </span></p><br/><p><span>Murphy frowned. The words exchanged by these two were already enough for her to see some clues. If there was really the possibility for reconciliation, or rather, if there was a solution for this hatred, Kent would definitely never open his mouth like that and thoroughly offend the other party. Now that he had spoken like this, it seemed that he was trying to tell her not to try and draw in these two people; the hatred between them was bigger than the sky, and it was doomed to fail. </span></p><br/><p><span>This was not a good thing. Kent had been taught by Murphy since childhood, and she had always emphasized that he should not offend others to the point where only death could solve the problem. They should always leave an option for themselves. When had he managed to provoke such a person? </span></p><br/><p><span>“Kent.” Murphy took a step forward. Although Kent had given her a signal, Murphy still wanted to try to ease the relationship between the two parties. \"Are there some prior misunderstandings between you and this gentleman? If so, it's better to discuss it. As long as we can talk through it, everyone can still be friends.\" She acted like a mediator and it seemed especially hypocritical.</span></p><br/><p><span>Xue Ling shrugged his shoulders and said, “No need. I'm not good enough to be friends with His Highness Kent, nor do I want to be.\"</span></p><br/><p><span>“Your Excellency.” Murphy was someone who was very capable of setting aside her airs. Otherwise, she would not have managed to survive until now. For the sake of the royal family, there were many things that she believed could be compromised on, so she continued to try and build a relationship with Xue Ling. What was needed most was to make the utmost effort to understand the contradictions between the two sides so that they could be resolved. \"I am Kent’s elder, and his business is my business. If Kent has caused offense, you can explain the situation, and I will try to resolve it.\" </span></p><br/><p><span>She looked especially sincere. Xue Ling tilted his head and gazed at her for a long time, then suddenly laughed and said, \"Okay, then resolve this for me. In that case, what does Her Highness Murphy feel needs to be done to resolve the problem of killing off one's father and mother, exterminating their entire race, causing a demonic beast to forcibly terminate their contract with their owner and thereby severely harming themselves, then giving the demonic beast's previous owner an ** poison with no cure?\" </span></p><br/><p><span>“This…” Murphy’s face turned a little pale. Every word that Xue Ling had spoken just now seemed to be slapping her in her face. She had just said that she would take responsibility for the other party, but for the things that Kent had done, each and every one of them were enough to make the other party justified in demanding a life for a life. But where could she find so many Kents for him to kill…? </span></p><br/><p><span>Kent turned pale and said in horror, “When did I poison Ivan? I love him so much!! What happened to him? Didn’t he go to participate in the final examination? How did something happen?\"</span></p><br/><p><span>Xue Ling curved his lips and laughed ironically. From the moment he saw Kent, the mocking smile lurking in the corners of his lips only grew bigger and bigger, which made Kent's heart feel increasingly panicked. \"Regarding his being poisoned, you'll have to ask your honorable mother~ I've only left Ivan for less than half a month, but you've already torn off your mask of kindness and made a killing move against him. Your Highness the Crown Prince, could it be that you are truly ignorant regarding this matter? Was it particularly easy to deceive Ivan about your feelings? There is no way that Your Highness does not know about the drug Fallen Heaven, right? You viciously make use of this kind of thing, but now you want to ask me how something happened to him?\" </span></p><br/><p><span class=\"jum\">“If it weren’t for Ivan’s level of power, allowing him to forcefully suppress the darkness within, he would probably have become someone covered in darkness like those from the Devil World.\" Xue Ling's expression was chilly, \"I only came to test out the waters for him first. Your Highness the Crown Prince might be better off thinking about how to cure him. If Ivan also dies under your hands, I will let you experience what a living hell feels like.\"</span></p><br/><p><span>“If something happens to him, I will bury the entire royal family in revenge.\" </span></p><div><div></div></div><br/><p><span>Murphy did not know what kind of person Ivan, who was being mentioned by both sides, was. Although the Queen and Kent had a massive quarrel over Ivan, she had not intervened and was not even sure if Kent had a sweetheart. Or that this encompassed such a major matter. </span></p><br/><p><span>Kent's eyes were red with anger. “Was it Ivan who asked you to come?”</span></p><br/><p><span>“Who else? Your mother wanted to destroy him and gave him poison. The power of light in his body will dissipate bit by bit, and someday, he will thoroughly fall into darkness. On that day, he will definitely bring you down with him.” Xue Ling’s smile took on a malicious edge in Kent's eyes. \"Therefore, Your Highness, there's no need to worry. Things that should be returned to you will come back sooner or later.\" </span></p><br/><p><span>Kent trembled and spoke in disbelief, \"The most indestructible thing between us is trust. I don’t believe it. You must be deceiving me!” </span></p><br/><p><span>Xue Ling shrugged his shoulders. In any case, the seeds of suspicion had been planted. Even if Ivan exposed his lies, Xue Ling knew that Kent would never again be able to trust Ivan with his entire heart and soul. After all, he had to guard against Ivan taking him to hell with him.</span></p><br/><p><span>Becoming a devil was the most reviled thing on this continent, and Kent would not sacrifice himself to this extent for Ivan. This was what Xue Ling believed and was the basis for his efforts. </span></p><br/><p><span>Murphy watched on in silence. Kent had completely lost his cool and turned into a madman; she gave a deep sigh. Compared to Kent, who had only paid attention to the second half of Xue Ling's words, Murphy was well aware that what had been spoken in the first half was more frightening. Killing one's entire family and even exterminating an entire race. How could such a thing be taken lightly? Even giving this demonic beast ten Kents to kill would not necessarily be enough in terms of compensation.</span></p><br/><p><span>That's right. Murphy was now clear about the identity of the person in front of her. She might not be able to speak with any accuracy about what Kent had been doing over the years, but she was very clear about the things she needed to know. Kent did not have the guts for genocide, but if she had to pinpoint any instance where 'exterminating a clan' or 'exterminating a race' had happened, then there would only be the Ink Flame Wolves from that year. </span></p><br/><p><span>She had previously been very curious about what kind of flame the youth had been using, but now it seemed that it was the Ink Flame Wolves' unique flames. But because the youth's strength was much higher than regular Ink Flame Wolves, the flame became much fiercer and could be used directly in attacks against her. </span></p><br/><p><span>“It seems impossible to make peace today…” Murphy finally realized this point. \"The real purpose for your journey here was the Ink Flame Wolf furs, right? You also came to the palace for the sake of the fur dress that Kent gifted to the Queen.\" </span></p><br/><p><span>Xue Ling nodded. “We've obtained it, and it's time to go. Your Highness Murphy does not need to see us off. I think we will meet again in the future.\" </span></p><br/><p><span>Murphy stretched out a hand as she watched him leave, \"Wait. Is there really no way to solve this?\"</span></p><br/><p><span>“Yes.” Xue Ling smiled widely as he turned his head back to look at her. In fact, he quite appreciated this supreme mage. She didn't put on airs, didn't push, and her personality was not that obnoxious. No matter how one looked at it, she didn't seem like cannon fodder at all. \"If His Highness the Crown Prince as well as Her Royal Highness the Queen and all of those who sinned against me are handed over for me to deal with as I please, I can let the royal family go.\" </span></p><br/><p><span>Murphy remained silent for a long time. Finally, she shook her head. \"You will break the royal family's foundation by doing so, and the royal family will never recover.”</span></p><br/><p><span>“Since Her Highness Murphy can’t make this decision, then just wait quietly for my revenge.” Xue Ling turned around and raised his hand. “Rest assured, I'll make sure to get back everything that the royal family owes me.\" </span></p><br/><p><span>After his voice fell, Xi appeared in front of him. Xue Ling met his deep gaze and felt that something was off about him, but he didn't think too much about it as he grabbed his hand and said, “Let’s go.” </span></p><br/><p><span>In the past, Xi only needed to hold his hand to bring them away, but today, Xi pulled him into his embrace and wrapped his arms around his waist before taking them away. If Xue Ling hadn't seen wrong, Xi even gave Murphy a meaningful look before they left. </span></p><br/><p><span>Xue Ling: “???” He only showed a little appreciation for Murphy… Did he have to go this far… </span></p><br/><p><span>Facts proved to him that Xi really did have to do so. It was unknown what kind of sudden realization Xi had come to during his fight with Murphy, but after bringing Xue Ling back to their nest, he continuously stared at Xue Ling without saying a single word. </span></p><div><div></div></div><br/><p><span>Xue Ling took a bath under his hot gaze, changed his clothes, brewed tea, and brought a plump pillow with him to nestle down next to the fireplace. The light from the fire illuminated the book in his hand as well as the soft expression of his side profile. </span></p><br/><p><span>After being stared at by the man for a long time, Xue Ling had become accustomed to it. He could see that Xi had something he wanted to say, but after waiting for a good while, he still hadn't opened his mouth, so Xue Ling went ahead and began to read his book. Once he started, he became engrossed, and by the time he returned his attention to his surroundings, Xi had already moved from the sofa that was set not far away and arrived by his side. He was still staring silently at him despite clearly having something to say.</span></p><br/><p><span>Xue Ling tilted his head and met his gaze. After a while, Xi suddenly came up and placed his hand on the back of his head, leaned forward, and kissed him directly on his lips. </span></p><br/><p><span>Xue Ling looked at him in some surprise. Xi had kissed him in the past, but he had always kissed him as though he was pacifying or showing care, the kisses light and fleeting. But this time, although their lips met, he did not simply touch and go. It was as though he had discovered some skill in this area; Xue Ling was fixed in place as Xi pressed him down into the rug. He raised his eyes to look at him, and then lowered his head and licked Xue Ling's lips with the tip of his tongue.</span></p><br/><p><span>Xue Ling blinked and cooperatively parted his lips slightly so that Xi's tongue could slip in without obstruction. After that, it got out of hand as Xue Ling was kissed until he was almost a puddle on the ground. The fire from the fireplace beside him heated up his entire body until he was incredibly hot, and after two deep kisses, his breathing was unsteady, but Xi seemed to have found something delightful. Xue Ling tried to flee, but Xi simply entangled them more fully and refused to let go. </span></p><br/><p><span>The tip of Xi's tongue licked gently along his lips. Xue Ling's lips had already turned red from the earlier kisses, but Xi stayed close and occasionally leaned up to steal a kiss and take advantage where he could. </span></p><br/><p><span>Xue Ling recovered a little strength, struggled and pushed Xi off his body. He frowned and asked, \"Why are you acting up all of a sudden!\" </span></p><br/><p><span>Xi stared at his wet lips, and licked his own. \"Nothing. I just wanted to kiss you all of a sudden.” </span></p><br/><p><span>Xue Ling: “…”</span></p><br/><p><span>“Although I know that you just want them to develop misunderstandings between them and stir up trouble, I really dislike hearing you say words that make it seem like you're protective of others.\" He narrowed his eyes, those sapphire blue orbs flashing with a hint of flame. It was somewhat surprising to Xue Ling, as the person in front of him felt different in that instant. </span></p><br/><p><span>The current Xi was somewhat similar to how he had felt when Xue Ling first saw him in this world. It was not that he felt cold and distant, but there was that kind of cruel and brutal feeling. Xue Ling had once thought it was an illusion, but now… </span></p><br/><p><span>“When you said that, I was thinking that it would be good if there was some way to block your mouth.\" </span></p><br/><p><span>Xue Ling: “…” Sure enough, something was not quite right… </span></p><br/><p><span>“Hey.” Xi gently stroked Xue Ling's cheek with his hand. His movements were very gentle, but his fingertips were cold. It made Xue Ling want to shiver under his touch. “If you don’t want to be my pet, how about being my lover?”</span></p><br/><p><span>Xue Ling was dazed. </span></p><br/><p><span>“Although I don’t like either of them, and you don't like them either, I think their relationship suits us quite well.” Xi caught Xue Ling’s hand and pulled him up, then lowered his head to leave a light kiss on the back of his hand. He raised his head to look at him, a slight chill in his eyes, as though if Xue Ling did not promise and agree, he would knock him out and take him into a little black room. \"I just looked into what kind of relationship 'lovers' have.\" Xue Ling was once again caught in his embrace as his free hand slowly moved downwards from his waist, stroked across his waistline, and occasionally gave it a pinch. \"Compared to treating you like a pet, I seem to enjoy touching and getting close to you more. I tried it just now, and I really like kissing you.\" </span></p><br/><p><span>Xue Ling reached out and grasped Xi’s wandering hand. He narrowed his eyes as he met his gaze, then leaned forward and pressed against Xi's face. His lips curved, and the warm exhale of his breath heated up Xi's cheek. Their position was very intimate, Xue Ling's ear rubbing across Xi's shoulder, his actions both arousing and ambiguous. His voice was low as he asked, \"Only kissing?\"</span></p><hr/><br/><p><em>will be travelling in a different timezone for the next 10 days~ don’t worry – i’ll still be releasing daily, but apologies in advance if updates end up coming out at weird hours. </em></p><br/><p></p><div><div></div></div><br/>\n</div>"}