{"title": "Chapter 162", "id": 162, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-162", "volume_title": "Volume 2", "body": "<h1>Chapter 162</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>12.5 – It's begun! They're mutually harming each other! </strong></p><br/><p><em>translator: xiin</em><em>editors: Macabre &amp; alamerysl</em></p><br/><p><span>The man had long, golden hair that shimmered as it pooled on the ground. He wore a white robe, and his appearance was fair and handsome. His eyes were at half-mast as he looked at Xue Ling, his expression and movements extremely gentle, but Xue Ling inexplicably felt that the person in front of him was a little cruel. </span></p><br/><p><span>The system trembled in his mind and informed him, “Host, let me tell you an unfortunate piece of news. I just detected the power of one of your tails on this person…”</span></p><br/><p><span>Xue Ling: “…” Couldn't the system just stop talking? He now wanted to hit something every time it opened its mouth!</span></p><br/><p><span>“Why didn't you come in with your human form? You are very welcome here.\" The man ignored Xue Ling's struggling, restrained his four legs, and forcibly carried him into the castle. </span></p><br/><p><span>“Let me go!” Once his demonic core had been restored, Xue Ling was once again able to speak. His four paws had been locked in place, and there was nothing he could do, so he glared at the man to express his anger.</span></p><br/><p><span>“Don’t struggle, and don't look at me like that.\" The man freed up a hand and pinched Xue Ling's nape, making his entire wolf body tremble. \"I don't like disobedient little things very much. You probably don't want to experience the pain of having your demonic core destroyed again, so behave. Understood?\" </span></p><br/><p><span>Xue Ling: “…” This man… Why did he seem so wrong in this world… The original text said that the Beast God was a very gentle person, and because he stayed in the inner layer of the Demonic Beast Forest all year round, he was very lonely. Ivan's arrival had given him a brand-new outlook on the future, which was why he came to love Ivan. But the man in front of him seemed to have turned rather dark…</span></p><br/><p><span>“It should be because he was affected by your tail's power. Your power does not belong to the world, and now that he has this power in his body, he has become an existence that can stand side by side with the heavens. The will of the world has no way to control him, and as time goes on, he will have realized that this world is not right. I had wondered before about why this world's settings involved the fall of gods. If it had been set up this way so that Ivan could become a god, it would make sense. But even by the end of the story, Ivan had still not recovered, so there was no way that would happen… The author did not explain too much about the settings, but based on the present situation, this world's settings might have been caused by the world itself, and is very likely to be related to the person in front of you.\" </span></p><br/><p><span>Xue Ling raised his eyebrows. \"What kind of influence did my power have when it entered his body?\"</span></p><br/><p><span>“It seems to have caused a slight change in his personality, and affected the sentiment between the two of you…\"</span></p><br/><p><span class=\"jum\">“Sentiment?”</span></p><br/><p><span class=\"jum\">“Well. Normally, he should fall in love with you at first sight and then dance in the palm of your hand the way he did in the previous worlds~\"</span></p><br/><p><span class=\"jum\">“What's abnormal then? Didn't he fall in love with me and then toss me straight into the Sacred Pool to stew?\"</span></p><br/><p><span>“No… He might have fallen in love at first sight and then planned to lock you up and fuck you for a lifetime?\" The system was uncertain. It hesitated for a moment, then carefully continued, \"After all, doesn't he look scary right now?\" </span></p><br/><p><span>“Do I look scary right now?\" Xue Ling's voice carried a trace of amusement. The system discreetly retreated and did not dare to speak again.</span></p><br/><p><span>Xue Ling looked up at the man thoughtfully, and met his gaze when he looked his way. He considered it, then blinked and tried to make the expression on his face a little cuter. \"Where are you taking me? And… Who are you…?\" </span></p><br/><p><span>It was probably a good idea to confirm the man's identity in this world again. The current situation was indeed beyond Xue Ling's control. The system had not discovered that this world had been affected by the power in Xue Ling's tail before they entered, and his tail had now suddenly shown up. Perhaps it had been suppressed by the man's own power, which was why the system had no way to sense it until they came close.</span></p><div><div></div></div><br/><p><span>“You can call me 'Xi'. I am the only God that still remains in this world.” Xi did not have any intention of concealing his own identity. When he saw that Xue Ling had calmed down, he also loosened the hand that was restraining Xue Ling's body and cuddled him gently against his chest. \"For the time being, don’t change into your human form as your body is too weak. If you want to make further progress, you'll need to soak in the pool every day for the next half-month. Only in this way will you be able to obtain a demigod’s body.”</span></p><br/><p><span>Xue Ling was at a loss for a moment, “I didn’t want to become a demigod…” </span></p><br/><p><span>When the man stopped his steps, Xue Ling thought he was going to stop and teach him a lesson. Instead, he turned around and opened the door in front of him.</span></p><br/><p><span>Every door in the castle looked exactly the same, and Xue Ling couldn't figure out what Xi relied on to distinguish what lay behind each door. Everything that Xue Ling saw on the way over looked mostly the same, and if he were to walk this way by himself, he would probably have gotten lost. </span></p><br/><p><span>The man entered the room, and the scene before Xue Ling's eyes suddenly changed. Compared with the cold exterior, the decoration in this room was obviously more personalized and at least looked more welcoming. The man placed Xue Ling on top of the big bed in the room, then watched as Xue Ling shifted his legs to stand up and silently reached out a hand, pressed down on his back, and pushed the little wolf cub back down. </span></p><br/><p><span>Xue Ling: “…” They were over as soon as he changed back to human form! </span></p><br/><p><span>“As a pet, you seem to be a little too disobedient.” Xi lowered his gaze and looked indifferently at Xue Ling. His eyes were the dark blue-green of spring water, and when they were gentle, they could make a person's heart turn into putty. At the moment, however, his gaze was emotionless, and eerily calm. \"Maybe I need to teach you some rules so that you will understand that pets cannot be spoiled and arrogant.\" </span></p><br/><p><span>Xue Ling’s fur stood on end once again. He looked like a small furball, and his four legs flailed as he struggled violently while pressed against the bed. Xue Ling could not see the man's face from this angle, but after twisting for a good while, the man seemed to understand what he was trying to do, and let him turn over.</span></p><br/><p><span>Xue Ling glared at him and complained, “What do you mean, pet!? When did I become your pet!!!\"</span></p><br/><p><span>The man's gaze had initially become more gentle due to his actions as he tried to flip over, and there had even been traces of a smile in his eyes as he looked at him. But when Xue Ling's rather angry voice came out, he frowned in dissatisfaction and reached his hand out once again to press it against the little wolf cub's small belly. He exerted some strength and his hand was somewhat heavy as he raised his chin slightly and spoke arrogantly, \"As long as it’s in this forest, it belongs to me. Since I said you're my pet, you're mine.\"</span></p><br/><p><span>Xue Ling began to feel that there was something wrong with the man's brain in this world. He struggled even more fiercely, and probably because his resistance was too overboard, the man clearly looked very unhappy. He flipped him over again with his hand, and pressed down on Xue Ling's back. Xue Ling could only turn his head back to demand, “What are you doing?!” </span></p><br/><p><span>“Disobedient pets need discipline.” The man spoke impassively as his other hand came up. There was the sound of a smack, and then Xue Ling was directly frozen in place.</span></p><br/><p><span>He could accept any sort of shame 'play', but he had to at least be in human form, and it should be for pleasure… This was the first time that Xue Ling had been spanked by the man. It made his mood so complicated that he immediately became silent. </span></p><br/><p><span>Xi hit him five times in a row. Xue Ling buried his head in the quilt and played dead. His two small front paws came up to cover his eyes, and his entire wolf cub body seemed to convey his defiance. </span></p><br/><p><span>After spanking him, Xi did not intend to console him at all. It seemed that he had made up his mind to establish his position as Xue Ling's master. \"This is my room, and it will also be yours from now on. You will go to the Sacred Pool to soak in the water at night, and the remainder of your time will be spent here. This is the reason I brought you into the Demonic Beast Forest, and also why I allowed you to enter the inner layer.\"</span></p><div><div></div></div><br/><p><span>“…” Xue Ling silently turned his head away and ignored him.</span></p><br/><p><span>The man continued, “This will be where you sleep.” After he spoke, a small ice house appeared in front of Xue Ling. It was similar to a dog house and was very small and cute, and filled with everything a dog house should have. \"You are not allowed to come up onto my bed without my permission. Also don't let me find out that you have any intention of leaving. I can heal you, but I can also break your legs and make it so that you have to stay here forever.\" </span></p><br/><p><span>“…” Xue Ling kept silent. He had already pushed the man to the ground and beaten him hundreds of times in his heart and was yelling internally, \"Even if he hugs my thigh and begs me while crying to get into his bed, I still won't go!\"</span></p><br/><p><span>Xue Ling maintained his silence and did not speak, but Xi did not seem very concerned. He stuffed Xue Ling into the little house and told him, “You absorbed energy from the Sacred Pool for the entire night last night. You should now start turn the Sacred Pool's energy into your own strength. You're merely a three-star demonic beast. If you don't work hard, I won't be able to take you out to meet others.\"</span></p><br/><p><span>Xue Ling: “…” You've been a damned hermit for ten thousand years and might not even leave this stupid inner layer during your entire life! And you dare say that you can't take me out to meet others? I'm the one who should be saying that!</span></p><br/><p><span>Fortunately, Xue Ling’s spiritual strength was strong enough that the man had no way to read the thoughts in his head. Otherwise, he wouldn't need to convert the energy now; he would be pushed down again and spanked for the whole day.</span></p><br/><p><span>Xi turned and left after placing Xue Ling inside the little house. Xue Ling hurriedly rushed out after he was gone, pulled a sheet off the bed, and transformed into his human form. He planned to go and open the door, but even before he reached it, he was warned by the system, \"Lord Host, don't move around randomly. There's a ward on that door. Your current strength is not enough. If it rebounds back on you, you'll have to soak in the Sacred Pool to restore your demonic core again tonight.\"</span></p><br/><p><span>Xue Ling’s hand froze. He then turned and wanted to go through the window, but the system spoke up again, \"The window is also no good. This entire room has been warded. I would advise you not to rebel against him now.”</span></p><br/><p><span>Xue Ling's tone was gloomy, “Do you want to be spanked too?” </span></p><br/><p><span>System: “…” Its host's grievances were deep. \"Host can try to run away again when you go and soak in the pool tonight. But his words are not wrong - soaking in the pool for half a month will really help host improve the quality of this body. No matter how strong your body gets, it will at most be on par with a four-star demonic beast. If host can obtain a demigod physique, you can try to use your own powers. By then, your body should be able to bear it.\" </span></p><br/><p><span>Xue Ling pursed his lips. \"Is there no other way to improve this body's physique?”</span></p><br/><p><span>“No… And host still needs to stay around him for the sake of your tail…\" </span></p><br/><p><span>Xue Ling rubbed his chin and thought for a while. There was simply no way to solve this problem; the man currently had his tail on him, and it was the first time this kind of situation had ever occurred. Although he felt like he was about to be angered to death by the way the man was treating him, Xue Ling would still have misgivings about casually taking that power away from his body.</span></p><br/><p><span>“For today’s sake, I can only stay here and deal with him…” Xue Ling felt irritated just having to say these words. He frowned and continued, \"Fine then. Since he made me unhappy, I will make sure he stays unhappy all the time. It's really not my style not to take revenge.\" </span></p><br/><p><span>System: “…” Wasn't this just mutually harming each other…</span></p><br/><p>  </p><br/><p></p><div><div></div></div><br/>\n</div>"}