{"title": "Chapter 175", "id": 175, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-175", "volume_title": "Volume 2", "body": "<h1>Chapter 175</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>13.4 – I'll take the little cutie out to play if he doesn't want him</strong></p><br/><p><em>translator: xiin</em><em>editor: alamerysl</em></p><br/><p><span>The Empire was the ruler of the entire Milky Way Galaxy, and there were several centers of power within the Empire.</span></p><br/><p><span>The Royal Family was the core of the Empire. The animal form of the beastmen from the Royal Family was that of the unique milky way dragon unmatched in the galaxy. Legend had it that at the critical point in the galaxy’s survival and death, the milky way dragon clan came into being. They led the beastmen to counter-attack, wiping out the enemies outside of the galaxy. After many years of expansion, they established the Milky Way Galaxy's position in the universe and led the beastmen to glory, allowing people to lead their lives happily now. </span></p><br/><p><span>Therefore, the milky way dragon was the core of the Milky Way Galaxy. The regime had changed many times, but the Royal Family had never stepped down from the stage. Their animal form was the most powerful out of all the animals that existed in the records of history, and it was because of their existence that the Milky Way Galaxy could stand firm in the universe and not be gobbled up by other races. </span></p><br/><p><span>There were three major forces under the Royal Family. One was the Military Headquarters, which controlled the army and held one third of the power in the Empire. They had forces spread all throughout the Empire, and the policemen that supplied oversight also fell under their jurisdiction. The second force was the Parliament, which was led by the Speaker of Parliament. Most of government affairs were handled here, but their real power was not great. Affairs concerning the core bills of the Empire were still ultimately left to the Royal Family. The third force was actually an offshoot of the Royal Family; an organization called the First Fleet. The supreme commander of this organization was the First Marshal of the Empire, and those under him could only be given the rank of general as there could be no second marshal. This position had always been held by the person amongst the Royal Family who had the strongest fighting power, and could only be occupied by Princes from the Royal Family.</span></p><br/><p><span>The First Fleet was a force that operated outside of the Empire. Like the Military Headquarters, it held one-third of the Empire's military power, but the one-third that it had held more weight as First Fleet was composed of all the elite battle forces that had been personally trained and led by the Marshal. They represented the first-line warriors in all aspects of warfare, willing to fight for the Empire with their lives, and that was precisely the reason why this force had not fallen over the years. They were the Empire's trump card; if they toppled, the Empire would also be done for. </span></p><br/><p><span>Regardless of how much the forces of the Empire fought internally, within the Empire, the First Fleet had immunity by default.</span></p><br/><p><span>With a background like this, people in the First Fleet came from all walks of life. The protagonist gong was one such person. Having the First Fleet in his resume was an important factor towards him becoming one of the three great Generals of the Empire in the future.</span></p><br/><p><span>The present Marshal of the Empire was the uncle of the current Emperor of the Empire. Prince Yin Jia had lived twice as long as Xue Ling's current body. </span></p><br/><p><span>He was the former Emperor's youngest brother, having taken over the position of First Marshal when he was 20 years old. It had been sixteen years since then, and nobody else from the Royal Family had managed to defeat him yet. But regardless of whether it was the former Emperor or the current one, they both felt extreme trust towards this younger brother or uncle of theirs. If there was anyone in the Empire who could be labelled as being below one person but above all others, then it would definitely be this Marshal and nobody else.</span></p><br/><p><span>Xue Ling now understood what the nurturer woman had meant when she said 'we have powerful backers'. For them to be able to make the First Marshal of the Empire willing to adopt him, the person behind them was most likely the Empress. </span></p><br/><p><span>In fact, if one were truly to trace everything back, Xue Ling and this Marshal really had a tenuous relationship. Back then, his mother had been promoted by the Marshal, and before resigning and returning home, she had been one of the Marshal's exclusive Sculptors and had been in contact with the Marshal. According to the system, it seemed that his mother and the Marshal shared some secrets between them that could not be told to others. The pendant that his mother had left behind had also been given to her by the Marshal during that time… </span></p><br/><p><span>Xue Ling: “Tsk, tsk. The Marshal has been single for so many years. Could it be that he really had a crush on my mother?\"</span></p><br/><p><span>System: “… How would I know? I was just trying my best to help you find some information. I hope these things can help you maintain your position in the Marshal's Palace. You have to realize that you're not only entering the Marshal's Palace, you're entering a Royal Prince's Palace. You're just like a sparrow that turned into a phoenix~\"</span></p><br/><p><span class=\"jum\">Xue Ling ignored the words that could be understood as either praise or ridicule. He thought for a moment, then said, \"No matter what kind of Palace it is, I will be free in two years, right?”</span></p><br/><p><span class=\"jum\">“Yes, but you only have three years to consider things. If you can't find him during that time, you'll be forced to marry someone~\" The system tilted its head and thought out loud, \"If you were really forced into marriage, would that person rush out to steal you away and elope?\"</span></p><br/><p><span>“I don’t even know who he is in this world, and he won’t fall in love with me at first sight. More importantly, you're a trashy system that can’t recognize him at all.” </span></p><br/><p><span>“I can’t help it…” The system felt very wronged. It was just a pitiful little thing, why did it have to be treated like this? \"After fusing with a little bit of your strength, his aura changed and I now have no way to sense him since I'm no longer afraid of his aura. It would be fantastic if I could help…\" </span></p><div><div></div></div><br/><p><span>Xue Ling: “…” It really was a garbage system. How was he supposed to use it?</span></p><br/><p><span>System: “…” QAQ</span></p><br/><p><span>On a beautiful, sunny morning, the Marshal’s people came to the hospital to pick up Xue Ling. The wound on Xue Ling’s head was completely healed, but his body was still weak, and the remnants of the forbidden drugs that destroyed his spiritual power had been detected in his body, so he had remained in the hospital for this period of time. Even after he went to the Marshal's Palace, he would have to cooperate with the treatment they proscribed in the future.</span></p><br/><p><span>When the doctor examined Xue Ling, they found that in addition to the wounds from the recent fight, there were also some other miscellaneous small wounds that the system had added at Xue Ling's request. With wounds like those, the two adults in Hao family would be unable to escape the blame. Xue Ling was a minor but had encountered such a terrible thing; many nurses sympathized deeply with him, and adding on the fact that he was attractive, he had been fed quite a lot. The original owner of this body had been afraid that others would put bad things in his food and as a result, he ate very little. His entire body looked bony, but during this period he gained a little bit of flesh, and both the nurses and doctors all expressed relief. </span></p><br/><p><span>Hearing that Xue Ling was leaving the hospital, many of the people who had cared for him during this period crowded over to say goodbye, but were all blocked at the door.</span></p><br/><p><span>Those people were all dressed in neat uniforms, their expressions solemn and displaying excellent discipline as they blocked the way one by one, preventing them from going through. </span></p><br/><p><span>Xue Ling had already packed up his things. When he heard the knock on the door, he called out permission and was greeted by a man in a military uniform as he stepped in. </span></p><br/><p><span>Judging from the medals and badges on his chest, Xue Ling could tell that this man was currently a Major, which was in line with the plot's description of the protagonist gong's situation. Xue Ling looked over the beastman in front of him, blinked, and then showed a shy smile.</span></p><br/><p><span>His man had been the protagonist before, and he now had to cast his net wide in order to catch the fish he wanted. In short, as long as it was a man, he would first start building up some goodwill. As a protagonist gong, the likelihood of this person being that man was pretty high.</span></p><br/><p><span>“Hello, Young Master Helan, Major Mo Xi of the First Fleet to escort you to the Marshal’s Palace at the Marshal’s command!” He gave Xue Ling a very standard military salute. He stood upright, his pair powerful, long legs set off by the military uniform, and it could be seen from a glance at his face that he was definitely an extraordinarily beautiful beastman.</span></p><br/><p><span>Xue Ling nodded and said, “I’m Helan Jiuyun. You can call me Helan or Jiuyun. Adding Young Master or something… It sounds strange.” He looked rather shy, but the feeling he gave others was very comfortable. </span></p><br/><p><span>Mo Xi seemed to let out a breath in relief. He could tell that Xue Ling was not a difficult person to communicate with. The former tense feeling eased slightly, and his feelings became much milder. </span></p><br/><p><span>That's right. Mo Xi was the protagonist gong of this story. His animal form was a tiger, and his attack power was very high. In addition to his family background, he was top-notch in all aspects, and his stint in the First Fleet was nothing more than a way of honing himself in adulthood. He would eventually leave First Fleet and return to the Military Headquarters, which was the stage he used to rise up to prominence. But in the latter half of the story, no matter how high Mo Xi climbed, he still maintained his deep respect for the First Fleet. For him to reach the rank of Major at such a young age in the First Fleet where skilled people were so plentiful was testament to how his strength was top-notch.</span></p><br/><p><span>This was why Xue Ling suspected that Mo Xi was his man. The man seemed to prefer this kind of external plug-in type character setting.</span></p><br/><p><span>After a brief exchange, Xue Ling handed over the small amount of luggage he had packed for himself and prepared to leave.</span></p><br/><p><span>During his stay at the hospital these few days, regardless of whether it was the doctors and nurses in the hospital or the staff from the Nurturer Protection Association who came to visit him, they had all brought him a lot of things. Xue Ling had no way to take it all away with him, so he distributed most of it to some of the elders in the neighbouring ward this morning. He planned to take away the rest, treating these things as mementos of everyone's thoughts and care. Amidst these things were clothing and a lot of things that were useful for nurturers. </span></p><br/><p><span>Exiting the ward, Xue Ling discovered that there was a crowd of people outside. He knew that they had come to send him off, and after a couple words to Mo Xi, Mo Xi agreed to let him say goodbye. </span></p><br/><p><span>So there was another round of reluctant goodbyes. There was no sense of falseness at all when Xue Ling acted like a cute little white lotus, and people could tell at a glance that he was serious and genuinely liked and appreciated everyone. A person like this would remember many small favors and details, and he gave others the feeling that after departing from this place, even if his life turned upside down, he would not forget his gratitude towards the ordinary people here. </span></p><br/><p><span>Mo Xi felt that it was too easy to feel good around a nurturer like this.</span></p><br/><p><span>But when he thought that this cutie would become the adopted son of the Marshal from today onwards, Mo Xi inexplicably shivered. With the Lord Marshal as a father… that was definitely the kind of father that a potential son-in-law would fear the most. Based on how much importance he attached to this little nurturer, anyone that pursued him would probably be beaten to death, right…</span></p><div><div></div></div><br/><p><span>They hadn't even met yet, but the Marshal had already put on the hat of being this nurturer's father… The Marshal really… left people not knowing what to say…</span></p><br/><p><span>Xue Ling said goodbye to the people in the hospital and the Nurturer Protection Association who came to see him off one by one, and then followed Mo Xi onto the army's aircraft. </span></p><br/><p><span>Even sending this kind of high altitude vehicle to pick him up; did the First Marshal of the First Fleet need to be so arrogant… </span></p><br/><p><span>The matter of Xue Ling being adopted by the Marshal was not known to many people outside of the Marshal's Palace and the Nurturer Protection Association. Even the doctors and nurses at the hospital were not clear about the origins of the adoption, so when they saw such a grand gesture, most of them simply marvelled that the people from the military department seemed to want to make a grand spectacle as usual. </span></p><br/><p><span>After all, it was usually those people from the Military Headquarters who liked to act big that liked to take this kind of major aircraft out for a ride. One had to understand that these aircrafts, as flying vehicles, were strictly controlled in airspace because of their size, speed and attack power. They must have pulled this kind of thing out in order to handle a particularly important task. </span></p><br/><p><span>Xue Ling: “…” No, it was simply being used to bring the Marshal's newly adopted son home.</span></p><br/><p><span>The Marshal’s Palace was near the north of the Capital Star, and was very close to the Imperial Palace. In fact, it was the Royal Prince's Palace, but because nobody from the Royal Family had managed to beat Yin Jia and take over his position, after a while, Yin Jia became too lazy to run back and forth between the Marshal's Palace and the Royal Prince's Palace and simply changed it into the Marshal's Palace.</span></p><br/><p><span>The Marshal's Palace covered a very large stretch of land. In addition to one main house, there were four other buildings which seemed to be arranged around the main house. The entire palace looked extremely grand, but in fact, the only master who lived here was the Marshal himself. Troops would also be stationed here during times of war, and it also occasionally served as the conference area for the First Fleet. The buildings had a wide range of uses, but probability of using them for living in was very small.</span></p><br/><p><span>Xue Ling watched from inside the aircraft as they drove through a magnificent gate. The aircraft stopped at a special berth in the front yard. Based on the amount of space left over in the berth, it wouldn't be a problem to park a few more vehicles beside the aircraft. Xue Ling privately thought that even the mother ship of the fleet could dock here.</span></p><br/><p><span>With Mo Xi leading the way, Xue Ling stepped off the aircraft. It was the first time he had ever ridden anything like this, but he didn't seem to be panicked at all, which made Mo Xi's goodwill towards him rise a lot.</span></p><br/><p><span>The old housekeeper was waiting for them beneath the aircraft. She was the person who had been responsible for communicating with Xue Ling, and had come to like their future Young Master very much over the course of their previous video conversations. As a result, Xue Ling had his hair ruffled as soon as he stepped off the aircraft by the housekeeper who rushed over in delight.</span></p><br/><p><span>The old housekeeper of the Marshal’s Palace was a close friend of Yin Jia's mother. She had been a rare female General beastman for the Empire when she was younger, but after an accident that left her unable to change into animal form, she retired. At that time, Yin Jia had just accepted the position of First Marshal, and she chose to take on the position of housekeeper for his Palace. Although she remained unmarried all her life, her life was quite enjoyable. Yin Jia’s mother had passed away for many years, but she was still alive and well.</span></p><br/><p><span>Although she was old, she still had a very good figure, and her age was not apparent at all. Xue Ling almost suffocated against her bosom, his small face turning red, before he was finally let off the hook.</span></p><br/><p><span>“Little cutie, I am Housekeeper Mu Xi of the Marshal’s Palace. We've met over the video communications before. I'll be taking care of you from today onwards, so call me Sister Mu in the future, understand?\" </span></p><br/><p><span>Xue Ling took a deep breath, nodded his head with a confused look on his face, and called out, “Sister Mu.” </span></p><br/><p><span>Mo Xi, who was standing to the side, \"…\" Poor child, you really don't know anything. You've already been fooled by Sister Mu… Based on her age, Mu Xi could be your grandmother… </span></p><br/><p><span>Perhaps because Xue Ling's expression was too confused, he completely managed to hit Mu Xi's cuteness sweet spot. She suddenly caught Xue Ling up, and pulled him onto her hoverboard. The Marshal's Palace was too large, and hoverboards were necessary to get around. \"Let's go. The Marshal won't come back before dinner. Your Sister Mu will take you on a tour around the Palace~\"</span></p><br/><p><span>Xue Ling stretched out his hand and looked pained, “But my luggage…”</span></p><br/><p><span>“Don’t worry, I’ll tell someone to deal with it. You just need to follow me.” She was about to leave with Xue Ling when she turned her head and saw Mo Xi. \"Little Mo Xi! Go back and report to your Marshal. I'll take the little cutie out to play if he doesn't want him. Give the little cutie's things to the servants~ and then get out of here~\"</span></p><br/><p><span>\"…\" Xue Ling was caught in her grip and could not break away at all. He was clearly male, but was somehow a whole head shorter than the other party.</span></p><br/><p><span>This was too shameful! QAQ</span></p><hr/><br/><p><em>belated, but i’m really loving the way you’ve/we’ve all been trained to replace ** with ‘dick’. ala would be proud~</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}