{"title": "Chapter 178", "id": 178, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-178", "volume_title": "Volume 2", "body": "<h1>Chapter 178</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>13.7 – This scene was getting out of control! </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; Macabre</em></p><br/><p><span>There were many schools in the Capital Star, and there were strict rules about which schools were attended at what age, but in fact, there was no differentiation between the good or bad schools here. After all, any school that was able to stay open in the Capital Star definitely had to have some some level of ability. </span></p><br/><p><span>The original owner of this body attended the Longyue College, which was famous for having trained the first Sculptor. </span></p><br/><p><span>Longyue College was actually a branch college under the Capital Star's First Star Academy. The students that attended Longyue College were basically all nurturers, and their primary area of study was the sculpting of energy crystals. Of course, there were other colleges, but they were more loosely affiliated. After all, the sculpting of energy crystals was at the core of the entire galaxy, and the more sculpted energy stones they had, the better. Although more and more alternative energy sources had emerged in recent years, energy crystals were still required to supply power for mecha and beastmen, so this was still the main subject and focus of the College. </span></p><br/><p><span>The Sculpture Department of Longyue College was the best one in the entire Capital Star. The original owner of this body's mother was also a student from this school.</span></p><br/><p><span>Hao Yuanliang had spent a lot of effort in order to send Hao Songle to this school. After successfully getting him in, the original owner was also stuffed into the school at the same time. Hao Yuanliang did not care about his eldest son, but it gave him a lot of face to say that his sons were studying here, and since he'd already spent money, there was no difference in sending one more person to attend.</span></p><br/><p><span>Hao Songle’s performance during his spiritual awakening was much better than general sub-beastmen, so he was assigned to Class B. Amongst the many sub-beastmen in school, Hao Songle was already at the top. Even though he was a nurturer, because his spiritual power had been blocked, the original owner of this body had only managed to enter Class C, which held a few straggler students or those who had joined the College through the back door, so very few of them were sincere about learning. The original owner genuinely wanted to learn how to sculpt, so he had been unable to find any friends at school.</span></p><br/><p><span>He was used to doing his own thing, so nobody noticed that he had taken a few days off. Xue Ling didn’t plan to publicize it, either, so he hadn't prepared any grand scene for his return.</span></p><br/><p><span>But apparently, some people had other plans. </span></p><br/><p><span>Xue Ling got up early this morning and had breakfast with Yin Jia. He had originally planned to send Yin Jia out, and then tidy up his things to go to school, but unexpectedly, Yin Jia stood at the entrance and simply watched him. Xue Ling was a little stunned by his gaze, causing Yin Jia to reach out and rub Xue Ling’s head rather helplessly. “Go get your things, I’ll send you to school first.” </span></p><br/><p><span>Xue Ling blinked in surprise. He knew the formation Yin Jia used when going out. It might not be as extravagant as Mo Xi's pick-up that day, but his private aircraft was not a low-key vehicle and would always have two teams of escorts around it. Although there was nothing that could be said about Yin Jia's fighting ability, and no one would be foolish enough to attack him, he still maintained the protection and guard that he should have. </span></p><br/><p><span>When Xue Ling thought of this formation stopping at the school gates, he felt that it would be impossible for him not to become famous. </span></p><br/><p><span>It was impossible to bargain with Yin Jia about going by himself. Xue Ling had already understood certain things about him over these two short days. For example, the unless he had sufficient reason to refute him, it was impossible for the man to go back on his words. So, Xue Ling could only accept that he would appear at school in such a cool, impactful way. </span></p><br/><p><span class=\"jum\">Yin Jia seemed to know what he was thinking, and after they boarded the aircraft, he opened his mouth to say, \"Although I don't have the habit of hosting a banquet or a ball in order to tell society about your identity, I will still do the things that need to be done. Your identity is not something that needs to be hidden, so it's necessary to give people a shock so that they will understand that some people can’t be offended.”</span></p><br/><p><span>Xue Ling understood that this was his way of showing his support, and couldn't say much about it. He could only obediently resign himself to hug tightly onto this big thigh and call him 'father' a few more times. </span></p><br/><p><span>Air traffic control had been implemented in many places in the Capital Star, but certain people's aircraft could go where they liked. Xue Ling felt a little embarrassed when he arrived at school in Yin Jia’s aircraft. After all, it was little different from taking a helicopter to school. Fortunately, there was no shortage of powerful people attending this school, and there was no shortage of flying aircraft, but when their aircraft landed with its escort, its exterior flashing its Royal Family, Marshal's Palace, and First Fleet's emblems, it was much more eye-catching than the other flying aircraft. </span></p><br/><p><span>Yin Jia tidied up Xue Ling’s school uniform which he had ordered people to customize according to Xue Ling’s figure. It looked very good when worn on his family's little nurturer. He tousled his hair again, hearing Xue Ling mutter quietly about having his hairstyle mussed up, before finally allowing Xue Ling to disembark.</span></p><br/><p><span>Xue Ling left the aircraft. Yin Jia did not have any intention of showing his face. He simply told Xue Ling that he would pick him up after school, and thoroughly dispelled any idea Xue Ling might have had about staying at the dormitories.</span></p><div><div></div></div><br/><p><span>“Doesn't he find it troublesome…” Xue Ling watched as the aircraft took off and left, muttering under his breath before turning to enter the College. </span></p><br/><p><span>The system rolled its eyes when it heard his words. \"You're showing off, right? Even though he doesn't like you yet, he's already spoiling and indulging you to this extent. If he really falls for you, you'll have to let him spoil you up to the heavens.\" </span></p><br/><p><span>“Does me going up to heaven have anything to do with you?\" Xue Ling retorted and stepped inside, ignoring the curious eyes around him. </span></p><br/><p><span>The class he was in was very easy to find. Class C-3 was full of slackers and delinquents. When Xue Ling walked in, they were all gathered in twos and threes. This class was mainly divided into two groups, nurturers and sub-beastmen. There were some other subdivisions within the class, but Xue Ling didn't concern himself over it. He simply found his own spot, took out the textbooks he was learning from, and started to read.</span></p><br/><p><span>The class was confused for a moment when he entered. A while later, a nurturer came up to his desk and knocked on it, \"Fellow classmate, are you in the wrong class? We don't have anyone like you here, right?\"</span></p><br/><p><span>Xue Ling had already changed his image, and it was no big deal if they no longer recognized him. He simply raised his head calmly and looked at the other party for a second before shaking his head. \"I'm in this class. You just don't recognize me.\" </span></p><br/><p><span>The other side stared at him for a long time, dazed but unable to tell who he was. Finally, they could only rely on the thinness of his body to guess, \"Helan Jiuyun?\" </span></p><br/><p><span>Xue Ling nodded and said, “That's me.” </span></p><br/><p><span>The other side gave him another strange glance before turning back to their little group. They continued to discuss him all the way until the next class, and Xue Ling could vaguely hear some of their words. They were wondering if he had encountered some big spender or something, because otherwise, how could his entrance this morning be so cool? </span></p><br/><p><span>After that, they denied their own speculation, saying that there was no big money bag that would come in a ship that had the sign of the Royal Family, Marshal's Palace, and First Fleet's emblems! That was clearly the Marshal’s Palace's airship, okay?</span></p><br/><p><span>Although the class was filled with those who had bought their way in or stragglers, there was no lack of prominent family backgrounds, so they spent the entire class gossiping about Xue Ling's past. Although the Marshal’s Palace did not host a banquet to introduce Xue Ling’s new identity, most of the people who should know had already been informed. Xue Ling’s appearance had already spread through the entire upper echelons of society, and everyone knew that they now had a new person they could approach or cling to if they wanted to establish good relationships with the Marshal.</span></p><br/><p><span>Xue Ling was stuffed with gossip over the course of one class, and found it slightly difficult to breathe. He spent the next class with his shields up, turning it into a self-study session. </span></p><br/><p><span>He couldn't hear anything the teacher said, but if he wanted to learn from the teacher, he probably wouldn't be able to carve even by the time the next life came around. </span></p><br/><p><span>Unfortunately, despite shielding himself from the outside world, some people still found ways to make their presence known. Hao Songle called his name from the doorway for a good while without getting any response, then finally stepped inside to slap a hand against his desk. </span></p><br/><p><span>Xue Ling raised his head up from his book and looked at the protagonist in front of him. His gaze was indifferent, but carried a sense of danger. His one glance was like a knife that scared the protagonist into taking back the hand he had slapped onto the desk, \"Yes?\" He turned off the nano-computer's music and stretched lazily before standing up in front of Hao Songle.</span></p><br/><p><span>Hao Songle was somewhat confused by his height when he stood up. His height was similar to his mother’s, and as far as sub-beastmen were concerned, he looked very small and lovely. Standing beside Xue Ling, it was no longer the case. The feeling of being looked down on made Hao Songle a little unhappy, but when he recalled what had happened at home, he had to hold on to his temper. </span></p><br/><p><span>“Elder Brother Helan, I know you’re still angry about what happened that day, but you know, father's words were just spoken in anger. He doesn't really mean to break off all relations with you, and he doesn’t mean to drive you out. After all, at the end of the day you were the one who made a move first. How could you report them? Father is suspended and now has to stay at home…\" Hao Songle didn’t want to judge who was right or wrong regarding this matter any further, but he knew that he couldn't afford to lose the pillar of support that Hao Yuanliang and his family represented. His elder brother was still interning in the army, and had no way to support the family. If anything happened with his father due to this investigation, he and his mother would definitely have a very bad life.</span></p><br/><p><span>Hao Songle had to clean up the messes left behind by his body's original owner even if he didn't want to. \"At the end of the day, you are father and son. What kind of conflicts are there that must be resolved externally?\"</span></p><br/><p><span>Xue Ling looked him over carefully and discovered that this person was incredibly stupid. Without the pendant that was his golden finger in the original story, to him, this protagonist shou did not seem competitive at all. It would only take two slaps to hit him far away; he wasn't worth exerting any effort at all. \"Father and son?\" Xue Ling laughed shortly and said, \"Do fathers and sons throw vases at each other as they like? Slap them around whenever they want to? If that is what father and son means, then I can also show you what it's like~\" As he spoke, Xue Ling slapped Hao Songle right in the face. 'Pa!' </span></p><div><div></div></div><br/><p><span>He did not appear to have any conflicts with the current, transmigrated Hao Songle, but on what basis did this new Hao Songle feel like he could treat him like garbage just as Hao Songle had treated him in his memories? If that was the case, he could also push his previous grievances onto the current protagonist shou.</span></p><br/><p><span>Xue Ling slapped Hao Songle across the face, and simultaneously shocked not only the friends who had accompanied him, but also the nurturers and sub-beastmen who were still in the classroom.</span></p><br/><p><span>He even stretched out his own hand and then shook it in disgust after slapping the other party. \"Back then, he also agreed when I said I wanted to break off all ties. Now, you are coming here to say that there is no conflict between father and son that can't be reconciled? Ha-ha. Is it because you're scared after falling from your position? You now know to come hug my thighs. How come he doesn't come over himself and call me 'Daddy'?\"</span></p><br/><p><span>Hao Songle had just gathered his wits again, but was shocked silly by his honesty. He was muddled for a long time before anxiously saying, \"Why are you like this? I was talking to you! Why did you hit me?!\"</span></p><br/><p><span>His friend quickly came forward to protect him behind him: “I heard from Little Le about how you bullied him at home. I didn't believe him, but now I can see that there are really nurturers like you in the world! Didn't you know that you can't fight in school? I’m going to tell the teacher!”</span></p><br/><p><span>Xue Ling: “Enough. Are you a three-year-old child? Go ahead then, find a teacher. Do you want to call my guardian over too?~\"</span></p><br/><p><span>The other party was so angry that they pointed a finger at Xue Ling's nose. \"Don't think I won't dare! Aren't you just someone who relied on the Nurturer Protection Act to find a new backer and leave home?! How are you so certain that your new backer will be on your side! A nurturer like you with a dirty mouth, calling for 'daddy' all the time, hitting people right off the bat! I really want to see what kind of person would be willing to adopt a nurturer like this!\" </span></p><br/><p><span>Because of this reason, Xue Ling's 'parents' were called in on the first day of his return to school.</span></p><br/><p><span>Afraid of disturbing Yin Jia, and also feeling that it was a little overboard to call him over, Xue Ling called Mu Xi when he was told to call over his guardian. Mu Xi hurried over as soon as she learned that something had happened at school, and even asked Xue Ling several times whether or not he had been bullied. After learning that it was Xue Ling bullying others, she finally relaxed and expressed that it would all be fine, she would cover for him.</span></p><br/><p><span>Xue Ling: “…” They were really, truly biased towards him.</span></p><br/><p><span>In fact, Xue Ling hadn't expected that this matter would involve his guardian and 'parents'. This feeling was quite foreign to him; as an old monster who had lived for who knows how long, the teachers had actually demanded that he call over his parents because he hit his classmate.</span></p><br/><p><span>It was really something he would do… After all, he was rather wilful, and was generally unwilling to tolerate or bear with anything.</span></p><br/><p><span>Hao Songle’s mother, Xue Ling’s stepmother, came relatively quickly, and brought a nurturer with her. She was the mother of the nurturer who had been beside Hao Songle, and it was unknown which high-ranking official’s wife she was. The stepmother glanced around as soon as she stepped in, and her gaze turned rather surprised when it landed on Xue Ling. Rather, it was the nurturer who came in behind her who locked her sights on Xue Ling and wanted to slap him as soon as she spotted her target. </span></p><br/><p><span>Xue Ling was nimble, and backed away slightly, looking coldly at the woman who was being blocked by the teacher. That expression made the system feel like its host would rush up to slap the other party in the next second…</span></p><br/><p><span>The teacher was also helpless. These were all people they couldn't afford to provoke, and he didn't know whose family backing was more powerful. It was the most difficult thing to be a teacher in a school like this. \"Madam, please calm down. We're not here to make a move against each other.\"</span></p><br/><p><span>The woman sneered coldly and said, \"Oh. I was saying, based on this seductive appearance of yours, it's no wonder people were willing to take him back and adopt him. I just wonder if they know that this this fellow is not much different from a white-eyed wolf and can't be brought up properly. If they're caught, they'll come up and bite you, not letting go until they see blood~\" </span></p><br/><p><span>Xue Ling looked down at his own white, clean hands, and spoke impassively, \"That's right. You must be careful. It's a white-eyed wolf, if you're not careful, perhaps you'll end up with blood all over your face.\"</span></p><br/><p><span>Teacher: “…” Couldn't this student keep a low profile? This situation was going out of control!!! He was still trying to provoke them!!! Was he unsatisfied if nobody came up to fight him!!!</span></p><hr/><br/><p><em>our wonderful fanartist ari is <strong>NOT RESOLVED</strong> to ML being the Marshal, so she ~ </em></p><br/><p></p><div><div></div></div><br/>\n</div>"}