{"title": "Chapter 183", "id": 183, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-183", "volume_title": "Volume 2", "body": "<h1>Chapter 183</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>13.12 – Father will beat my suitors back out the door </strong></p><br/><p><em><span>translators: xiineditors: alamerysl &amp; Macabre</span></em></p><br/><p><span>They were two very exquisite ornaments. Yin Jia simply looked at these two items for a long time. As a Marshal for the Empire, what he wanted and needed were SSS Grade energy crystals, and that was what he was often provided with. As the King of the battlefield, the importance of energy crystals to him was obvious.</span></p><br/><p><span>In other words, he wanted for nothing and thus never wanted anything. </span></p><br/><p><span>Yin Jia had a special team of Senior Sculptors, whose daily purpose was to sculpt energy crystals for him. Helan Jiuyun’s mother used to be a member of this team.</span></p><br/><p><span>Yin Jia did not like jewelry. In fact, he did not even have any requirements regarding the appearance of his energy crystals. As long as it was an energy crystal with a high utilization rate and purity, and he could make use of them; it did not matter what shape they came in because when he had to make a move, it turned into nothing but a piece of high grade energy crystal that he would consume. </span></p><br/><p><span>Yin Jia had experienced hundreds of battles in his life, and supported the entire Empire's sky. There was even a special place within the Marshal's Palace for him to store empty energy crystal shells, which was filled with the energy crystals that had been emptied out by Yin Jia’s use. Those things were master-level sculptures that would be worth a lot of money if sold, even if they were completely empty and devoid of even the slightest bit of energy.</span></p><br/><p><span>This was the first time that Yin Jia found himself caring about what an energy crystal looked like, and the first time he had felt any desire to wear such a thing as an accessory. He even felt that using the energy inside these energy crystals would be a blasphemy to these sculptures, and he should put them on display to be appreciated by the world. </span></p><br/><p><span>From a design and aesthetics point of view, these sculptures that Xue Ling made still had room for improvement, but in Yin Jia’s eyes, they were unique works of art. </span></p><br/><p><span>There was probably only one reason for this - the man who had sculpted these ornaments.</span></p><br/><p><span>Thinking of Xue Ling, who had just been nestled in his embrace, rubbing against his chest sweetly as he slept, and then looking at the youth who was smiling innocently as he offered up the two accessories to him, Yin Jia felt himself soften in a way he rarely did. “For me?”</span></p><br/><p><span>“Yes.” Xue Ling sat down beside him, opened the ring box, and carefully brought out the ring contained inside. It was entirely carved from a single piece of energy crystal; Xue Ling had carved the ring as an ink-colored black dragon based on the unique color of the energy crystal. It looked very delicate. Although it looked like a small piece of sculpture, this contained the core energy of the entire energy crystal after it had been purified and concentrated. As long as he wore it, he would be able to use and absorb the energy contained within at will. \"I designed this for half a month, wanting to surprise father with it.\" Having said that, he very naturally lifted Yin Jia's hand, thoughtfully selected a finger, and then pushed the ring on.</span></p><br/><p><span>This action was very casual, and natural to the point that even after he had released Yin Jia's hand, Yin Jia hadn't recovered his wits and waved his hand absently. </span></p><br/><p><span>Xue Ling then pressed the brooch into his hand. The brooch and the ring were part of a matching set; the brooch was also a black dragon that looked very dignified. Xue Ling had used many things as embellishments, and it looked very good when placed inside the box. It would be even better when worn on his body.</span></p><br/><p><span>Yin Jia nodded and decided to put the brooch aside properly. After all, this was an expression of this child's thoughtfulness towards him. </span></p><br/><p><span>He hadn't been happy for long when Mu Xi came back and leaned over to speak to Xue Ling, \"Yunyun, come and help Sister Mu put on this phoenix crown~\" She had specifically changed her clothes, dressing in a cheongsam with a pair of matching earrings, and pulled on a new pair of shoes with 7-inch heels. </span></p><br/><p><span class=\"jum\">Xue Ling agreed and stepped forward, asking oddly, \"Why is Sister Mu calling me Yunyun now?\"</span></p><br/><p><span class=\"jum\">Mu Xi said, “They all call you Little Yun, and if I also address you that way, it won't be as intimae. The Marshal calls you Yun'er, and I can't call you the same way as he does, so I picked Yunyun. Isn't it cute?\"</span></p><br/><p><span>Xue Ling's lips twitched. If it weren't for the fact that nurturers indeed had this kind of role in this world's society, he would definitely strangle those who were calling him these kinds of messy names to death. They made him sound so soft and weak; they clearly had no clue about his ferocious side at all. </span></p><br/><p><span>Xue Ling also made use of the hair clips as he helped Mu Xi put on the phoenix crown, then eyed Mu Xi for a short while before saying, \"Sister Mu, this dress doesn't match very well. I'll design a better one for you tonight, and you can have others make it for you.\" </span></p><br/><p><span>Mu Xi nodded in delight, and then noticed that their Marshal's facial expression had turned ugly at some unknown point in time. She stood up rather resentfully, and returned back to her room to amuse herself there.</span></p><br/><p><span>Xue Ling sat down beside Yin Jia again and brought out the ear stud, which was also part of the set; a smaller version of the ink dragon. Xue Ling pulled the hair next to his ear to one side. </span></p><div><div></div></div><br/><p><span>Yin Jia stared at the stretch of tender, white neck that was exposed after Xue Ling lifted his hair. For some reason, he felt his mouth go a little dry, and the scene that followed made him feel that there was a fire burning inside his body. </span></p><br/><p><span>A needle that came from who knew where appeared in Xue Ling's hand. It seemed that he had crafted it out of the remnants of the energy crystal. He pinched his own earlobe, then used a single push to pierce a hole in his ear. </span></p><br/><p><span>Even before Yin Jia could respond, the youth's fingertips had brushed across his earlobe, and swept up a tiny bead of blood. He looked as though nothing untoward had happened as he raised his head to look at the bead of blood on his fingertip, then stretched out the tip of his tongue to lick the blood away. </span></p><br/><p><span>The tip of the youth's tongue was just like his beautiful lips, a relatively pale pink, moving slowly as it swept across his fingertip. That little tongue curled slightly, then Xue Ling licked the corner of his lips. As though noticing that Yin Jia's gaze had fallen on him, he turned his head and gave Yin Jia a beautiful smile. </span></p><br/><p><span>In that instant, Yin Jia's heart began to beat out of control. He could hear the sound of his own heartbeat in his ears, fast and loud, and Yin Jia felt as though he had fallen into a trance. </span></p><br/><p><span>Xue Ling ignored his rare hesitation. He used his spiritual powers to disinfect his ear, then pushed the ear stud through. </span></p><br/><p><span>Using his nano-computer, he looked at his own ear in satisfaction, took a picture of himself, and posted it on the Star Net.</span></p><br/><p><span>His personal homepage had been dug out by the netizens from the previous wave of news. The original body had not made use of the site before, so it was mostly empty with only some reposted learning materials. Ever since Xue Ling had taken over, he would occasionally send some updates, such as books he was studying, or pictures of food he had enjoyed with Mu Xi when they snuck out to eat. </span></p><br/><p><span>At the time, some people had become his fans based on the things he posted, but after the grand scene today, his website had already been visited over and over again by countless people. After Xue Ling sent out this photo, it was immediately picked up and watched by countless netizens.</span></p><br/><p><span>People kept desperately upvoting his page, and Xue Ling's website was pushed to the top all at once.</span></p><br/><p><span>[ The little prince's side profile is so gorgeous~ <span class=\"tooltip-toggle\" tooltip-target=\"tooltip-38b508\">prpr</span> ] [ The Young Master has put on his ear stud. This counts as a close-up, right? That ear stud is beautiful up close!!! ] [ Ohhhh, the Young Master's earlobe!! Make way! I came first, and I'm licking first! ] [ Wuwuwu, this little side profile, these long eyelashes, this earlobe makes me really want to take this Young Master home!!! Too beautiful!!! ] [ Previous poster, it's time for an inspection, the Marshal's already rushing over with his knife. ] [ Previous poster, have a good meal, take care! (shoulder patting) ]</span></p><br/><p><span>Xue Ling finally had free time to go through and see what kind of fans he had. He was curled up on the sofa, but found it uncomfortable leaning against it, so he thought about it for a while and then leaned against Yin Jia instead. </span></p><br/><p><span>He could clearly feel that Yin Jia's body had gone stiff. There was no need for him to wonder how helpless Yin Jia’s expression was right now. Xue Ling suppressed his amusement, and acted as if all of this was taken for granted as he looked through the comments on his homepage with relish. </span></p><br/><p><span>Yin Jia was being leaned on, and half of his body was about to burn into a crisp. </span></p><br/><p><span>The child had just taken a bath, and his body carried a milky fragrance left by the bath lotion. His upper body was covered by a simple white shirt, but the top two buttons were unbuttoned and when he leaned over, from Yin Jia's angle, he could see a slender neck, beautiful clavicle and a small portion of his chest. His body carried a subtle warmth, and his entire body was as soft as cotton. When Yin Jia had carried him back this morning, he discovered that this little nurturer had finally put on some flesh. He looked a little rounder, and was even more beautiful than before. </span></p><br/><p><span>Yin Jia's adam's apple moved slightly. He was still absent minded as his hand snaked out and wrapped around Xue Ling's waist. Xue Ling seemed to raise his gaze to look at him, some doubts showing in his eyes. Yin Jia stared back, not knowing what to say. He was at a loss under that gaze for a few seconds before finally opening his mouth to say, \"What are you looking at? Let's look together.\" </span></p><br/><p><span>Xue Ling nodded his head obediently, thinking to himself that this person would indeed never become enlightened if he didn't seduce him. But he was really very pure; Xue Ling's entire body was pasted up against him, and he had only stretched out his arm to wrap it around his waist. If it hadn't been that they had gone through so many worlds together and Xue Ling had absolute faith in his man, he would really begin to suspect that the other party was unable to get it up. </span></p><br/><p><span>“Looking at the comments on my homepage.\" Xue Ling spoke a little oddly, \"There seems to be a lot of new fans all of a sudden…\"</span></p><br/><p><span>Yin Jia violently jerked his thoughts back and discovered that he seemed to have never paid any attention to Xue Ling’s homepage. But he couldn't exactly open up his own nano-computer and follow him in front of him right now, so he could only follow Xue Ling's words and say, \"Today's test was broadcasted live. You probably picked up so many new fans because they all saw you there today.\"</span></p><div><div></div></div><br/><p><span>Xue Ling nodded and opened his followers list, discovering that there were a bunch of gold-certified people. Their fan count couldn't be seen at a glance, but when he checked their certification, he discovered that they were all Senior Sculptors, each of whom were well known in the galaxy as great-god level personages. </span></p><br/><p><span>The original body had also followed these people, but their status had now turned into mutual followers, and Xue Ling found this feeling to be quite indescribable. Other than Sculptors, a whole bunch of beastmen had also become his fans. Based on their profile images, it seemed that many of the people who had been howling in the comments area were these beastmen. </span></p><br/><p><span>Xue Ling found it all very amusing, and then turned around to read the comments. During this short period of time, there had already been a new pile of new messages.</span></p><br/><p><span>[ Begging for assistance! How can I chase the Young Master? I don't want the Marshal any more. I just want to get the beauty! ] [ Stop dreaming. You can think about it, but the Young Master is such a beauty, and is both good locking and powerful. Tsk, tsk, tsk. The Marshal is probably watching him very closely. ] [ I can already see the time when a group of people go up to propose and are all beaten away by the Marshal~ ] [ e=e=(ノ≧≦)ノYou guys are so useless, changing the target of your affections so quickly. I'm still determined to become this Young Master's mother so that I can give my darling son a warm hug~ ]</span></p><br/><p><span>Xue Ling pointed to this comment and showed it to Yin Jia, his tone somewhat ironic as he spoke, \"It seems that father is still very popular. This is not the first person who has wanted to become my mother or father.\" He held back a smile and said, \"If Sister Mu hadn't told me, I wouldn't even know that I was about to become a child of the people.\" </span></p><br/><p><span>He leaned up against Yin Jia's side as he spoke, and when he turned his head to look at him, his head ended up pressed against the side of Yin Jia's neck. His breath was warm, making Yin Jia's scalp tingle. Yin Jia controlled his ** that wanted to rise all of a sudden, and said lightly, \"They're all dreaming.\" Simply put, there was no way. </span></p><br/><p><span>Xue Ling laughed out loud, and shifted in Yin Jia’s arms. He got even closer and pointed to another comment to show Yin Jia. “They also said that my father would beat all my suitors back out the door~\" </span></p><br/><p><span>Yin Jia thought to himself that they didn't need to show up in front of him; he could go and beat them all to death right now. But his tone was still cold and light as he opened his mouth, \"Naturally. You're still young, and they'll be a bad influence.\" </span></p><br/><p><span>Xue Ling could already clearly feel that the other party had had a reaction, but he continued to act innocent and naïve as though he wasn't aware of anything. \"That's true. I don't want to pay attention to these people for the time being.\" </span></p><br/><p><span>Yin Jia stiffened and said, \"What does Yun'er want to do next?\" </span></p><br/><p><span>“What do I want to do?” Xue Ling stretched out his hand and counted on his fingers, \"First, I need to meet the teacher that the headmaster mentioned. Then, I plan to sign up for the Sculptor Competition taking place at the end of the year. As long as I win the championship, I'll qualify for a Senior Sculptor's certification and won't need to take the exams one by one. After that, I should be preparing to take part in the assessment to join the First Fleet.\" </span></p><br/><p><span>Yin Jia frowned and asked, “You want to join the First Fleet?” There were many Sculptors in the First Fleet, and Yin Jia's team did not work for him alone. First Fleet had first choice on all the energy crystals that they made.</span></p><br/><p><span>Yin Jia’s eyes darkened when he thought about the fact that beastmen he didn't know might have the opportunity to obtain the energy crystals that the person in his arm had sculpted.</span></p><br/><p><span>Xue Ling seemed completely unaware as he nodded his head. \"I want to reach the position that my mother was in before she died and see what it's like.\"</span></p><br/><p><span>Yin Jia did not speak. He took a deep breath, bowed his head and held Xue Ling’s face, dropping a soft kiss onto his forehead. “Do what you like. I've said this before. I am your strongest backer.\"</span></p><br/><p><span>Xue Ling could feel his somewhat agitated breathing, and knew that he was still able to suppress his body's reaction. He blinked, and decided to end tonight's seduction here. So, he stood up, turned his head to lift Yin Jia's face, and gave him a big kiss on the cheek in return before jumping off the sofa and heading straight to the dining room. \"I've always been very reassured about father.\" </span></p><br/><p><span>Xue Ling’s return kiss made Yin Jia a little intoxicated, but his words suddenly woke Yin Jia up. As soon as he thought about what he had been thinking and doing just now, Yin Jia broke out in a cold sweat… </span></p><br/><p><span>The reaction in his lower body was still there, acting as proof of the thoughts that he could not tell others. The thoughts stabbed him straight through the heart, and made him shudder in fear in an instant.</span></p><br/><p><span>Xue Ling walked halfway and then turned to call out, \"Father, it's time for dinner.\" He did not appear to be acting abnormally at all.</span></p><br/><p><span>Yin Jia took a deep breath, narrowed his eyes, suppressed the ripples in his heart, and stood up.</span></p><hr/><br/><p><em>alamerysl: *eggplant!!*</em><em>Macabre: 🍆🍆🍆</em></p><br/><p></p><div><div></div></div><br/>\n</div>"}