{"title": "Chapter 194", "id": 194, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-194", "volume_title": "Volume 2", "body": "<h1>Chapter 194</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>14.6 – My home is wherever you are</strong></p><br/><p><em>translator: xiin</em><em>editors: BlueBug &amp; Macabre</em></p><br/><p><span>The bartender brought over Xue Ling’s drink. He stirred it, took a sip, and narrowed his eyes. \"What is the big president looking at me like that for? Since I've already signed with Tianxuan, I can basically be considered an employee of the Su Family. But no matter how you look at me, I still won't be willing to follow the hidden rules with you~\" </span></p><br/><p><span>Su Xuanyan frowned, “I don’t use the hidden rules.” </span></p><br/><p><span>Xue Ling made an 'oh' sound, and muttered, \"How boring.\" Having said so, he took another sip of his drink and stretched, twirling the cocktail glass in his hand as he said, \"I'm in a bad mood today because we're wearing the same clothes. Does the big president have any compensation or consolation prize for me?~\" </span></p><br/><p><span>He was half leaning on the bar in a lazy posture, his slender, pale fingers slowly tracing the rim of his glass. Su Xuanyan looked at him, then opened his mouth to order him an extra cocktail. \"I'll buy you a drink if you want compensation.\"</span></p><br/><p><span>Xue Ling twisted his head to glance at him, then turned back to toss down the cocktail in front of him. He raised his brows and said, \"How come it's only one drink! No matter how you look at it, you should…\" His hand waved in a circle, and his finger pointed to a row of drinks at the bar, \"…treat everyone here.\"</span></p><br/><p><span>As soon as he finished speaking, he laid down on the bar and stopped moving. </span></p><br/><p><span>There was no change on Su Xuanyan's face as he watched Xue Ling collapse onto the bar. One second ago, he was still full of momentum as he promised everyone in the bar drinks, but in the next second, he had fallen over and no longer spoke. Those who didn't know better would think that he had been poisoned and was dying. </span></p><br/><p><span>He waited for a long time, but Xue Ling didn't move. Su Xuanyan reached out and poked at the portion of Xue Ling's cheek that was still exposed, causing the other party to twist his head and swipe away his hand, frowning slightly as he expressed his obvious dissatisfaction at being disturbed. </span></p><br/><p><span>Su Xuanyan: “…” He had been so arrogant just now when demanding compensation, but in the next second, he'd gotten drunk?! </span></p><br/><p><span>To tell the truth, Su Xuanyan felt that the other party was performing some opportunistic extortion. He might really have fallen into the trap the other party had set for him; his intentions couldn't be more obvious. Su Xuanyan was about to leave him here and be done with it since this was a proper bar, and he wouldn't die here, but when he turned away, a pair of beautiful eyes flashed through his mind.</span></p><br/><p><span>Su Xuanyan's actions stalled, and he sank back onto his seat. </span></p><br/><p><span>He carefully looked over Xue Ling, who had an arm pillowed under his head and only revealed half of his face, and began to recall what his eyes looked like. </span></p><br/><p><span>A pair of beautiful fox eyes, his gaze clear, and regardless of whether it was filled with embarrassment, cunning, dissatisfaction, or depression, it all seemed to be written there clearly. His eyes were narrow but not small, and the slightly raised corners seemed to emphasize his momentum. The eyelashes that framed his eyes were long, but not curled up. When his eyelids were lowered, each individual lash was clearly distinguishable, and if he leaned up close, he could see the shadow of his eyelashes on his pale cheek.</span></p><br/><p><span>Su Xuanyan had unconsciously come closer and closer, but he paused at the last moment, and the slightly tender, sentimental expression on his face disappeared as he reverted back to his original iceberg state. He frowned, ignored the two cocktails on the bar, and after settling the bill, reached out to support Xue Ling. </span></p><br/><p><span>No matter what, he was a Tianxuan artist, and it wouldn't be good if he left him here alone. </span></p><br/><p><span>In fact, it was a simple matter for him to lift up Xue Ling. Su Xuanyan did not have to spend much effort, as it seemed as though Xue Ling knew that someone was moving him. He opened his eyes to take a look at Su Xuanyan before leaning his entire body against him as though reassured. </span></p><br/><p><span class=\"jum\">Su Xuanyan’s body stiffened. This person was a little shorter than him, and when he voluntarily leaned against him, his head landed on his shoulder, his headful of hair ending up right in front of Su Xuanyan's eyes. Xue Ling leaned there, his breath brushing over Su Xuanyan's neck, making it so that he didn't dare move.</span></p><br/><p><span>Xue Ling blinked and seemed to sober up a little. He narrowed his eyes and looked up carefully at Su Xuanyan for a while before laughing and asking, \"Are we going back now?\" </span></p><br/><p><span>Su Xuanyan frowned. Who did he think he was, saying 'we' so straightforwardly? </span></p><br/><p><span>Xue Ling did not seem to be fully conscious, so Su Xuanyan didn't quibble with him and just supported his shoulders and kept his arm around him. \"Where do you live? I’ll take you back.”</span></p><br/><p><span>“I will live wherever you live.” Xue Ling muttered. He shook his head against Su Xuanyan's chest and even rubbed against him. \"You said it. My home is where you are.\"</span></p><br/><p><span>Su Xuanyan pressed his lips together as his gaze darkened. </span></p><br/><p><span>He didn't say anything and brought Xue Ling out of the bar, found the sunglasses he had left in his pocket, and put them on his nose. His movements were rather careless, causing Xue Ling to feel uncomfortable. Xue Ling lifted his hand to take them off, then stood up slightly on his tiptoes and leaned up in front of Su Xuanyan, \"Su Xuanyan, put them on properly! Otherwise, I won't get into bed with you tonight!\" His voice was a little confused when he threatened him, and the strength he displayed when he stood up just now seemed to disappear halfway through as he crookedly fell back into Su Xuanyan's bosom.</span></p><div><div></div></div><br/><p><span>Su Xuanyan was so surprised by how Xue Ling had called out his name that he froze, and found that the sunglasses had been stuffed back into his hands. He dazedly lowered his gaze to look at him, \"Are you talking to me?\" </span></p><br/><p><span>Xue Ling felt that he was being rather annoying, and complained, \"If I'm not talking to you, then who? If you don't put them on properly, then I just won't wear them. If someone takes a photo, you can give up any idea of getting into my bed.\" He spoke casually, as though he had known Su Xuanyan for a long time.</span></p><br/><p><span>Su Xuanyan looked down at him to make sure that he wasn't trying to play tricks on him, but Xue was drunk, his face was bright red, his eyes unfocused. When he spoke to him, his head twisted here and there as though he was unable to determine where Su Xuanyan was, and looking at it made him feel rather helpless. If this was an act, then he was the unlucky one for falling into such a trap.</span></p><br/><p><span>He put the sunglasses onto Xue Ling's face properly, and casually helped him straighten up his chaotic, wind-blown hair. Su Xuanyan finished his set of actions, then fell into a daze, frowning as he stared at his own hands and wondered why these actions had come so naturally…</span></p><br/><p><span>Xue Ling looked as though everything was normal. He proudly grabbed Su Xuanyan's hand, and the weight of his entire body was leaned against Su Xuanyan's body, as though waiting for him to drag him home.</span></p><br/><p><span>But Su Xuanyan didn't know where Xue Ling's place was! </span></p><br/><p><span>He took two steps and asked again, “Where is your place?” </span></p><br/><p><span>Xue Ling frowned and stretched out his hand to pinch Su Xuanyan's face. His hands were rather cold, his actions were casual and natural. He didn't use much strength, but it put Su Xuanyan into a confused daze all at once. \"We live together. I already said that wherever you live is where I live!\" He sounded a little unhappy. </span></p><br/><p><span>Su Xuanyan hesitated, but ultimately couldn't hold back and asked, “We live together?”</span></p><br/><p><span>“Yes.” Xue Ling harrumphed. </span></p><br/><p><span>“Who am I?”</span></p><br/><p><span>“Su Xuanyan, who else could you be…” </span></p><br/><p><span>“You know me?” </span></p><br/><p><span>“Why wouldn't I know…” At this point, Xue Ling seemed to be stuck. He blinked, and thought about it for a long time, but didn't ultimately couldn't figure out whether he knew Su Xuanyan or not. In any case, he knew that he belonged wherever Su Xuanyan was, and no matter what, they were tied together. \"I should know you.\" When he thought about it, he became a little uncertain, “I don’t remember.”</span></p><br/><p><span>Su Xuanyan was speechless for a long time. There must be a defect in his brain for him to talk to a drunk man…</span></p><br/><p><span>He simply took out his nano-computer and asked Shen Yue for Xue Ling’s personal data. He looked up his home address and was ready to send him back, then discovered that he lived in the community right across the street… </span></p><br/><p><span>No wonder Xue Ling had been here. He probably hadn't purposely come here in order to meet him.</span></p><br/><p><span>In fact, it was very easy to walk with Xue Ling. Although he had leaned all his weight on Su Xuanyan, he strode forward when he was supposed to, and walked quickly when it was time to. He managed to keep pace with Su Xuanyan without him having to say anything, and their tacit understanding was extremely good. This made Su Xuanyan somewhat unable to recover his wits.</span></p><br/><p><span>He was clearly completely unfamiliar with the other party, and they were total strangers before today, but while they were walking together this time, it was particularly harmonious. He could not pinpoint exactly what kind of feeling this was, but he could vaguely feel that the person his heart had been urging him to find was most likely the person in front of him right now…</span></p><br/><p><span>How else could he explain why his heart, which had been uneasy because it felt like he had lost something, suddenly calm down? Why else would the anxious pressure he felt to come back and look for someone also ease up? </span></p><br/><p><span>Xue Ling place was quite high-end. He had saved up some money over the past two years, and had spent it all on this apartment. His savings were empty, and this was another reason why Xue Ling had let out a relieved breath when he signed this contract… He hadn't finished paying off the loan, and couldn't afford to cut his source of income.</span></p><br/><p><span>If not for the fact that he had inexplicably been full of confidence, Xue Ling would also not have dared to cancel his contract with his original company. After all, although the company had not given him any good opportunities, they had given him everything he was entitled to, unlike some other companies that tricked others to death and never gave the artists an opportunity to complain. </span></p><br/><p><span>This was a very well concealed private community. It was impossible to get in without the homeowner's nano-computer, and the likelihood of slipping in was not very high. The management also did a good job, and aside from its absurd price, Xue Ling was very satisfied with everything..</span></p><br/><p><span>Su Xuanyan supported him towards the door. Although the guards at the entrance wore strange expressions when they saw them, seeing that Xue Ling swiped open the door on his own and even gave the other party instructions, they indifferently closed their eyes and let the person beside him bring him away. Xue Ling was allowing the other party to move him about as they pleased; the only difference was that he wasn't being carried on the other party's back.</span></p><div><div></div></div><br/><p><span>These two people should know each other; they were wearing the same clothing, and no matter how the guards looked, it appeared like they were wearing couples' clothing. Adding on how closely they were stuck together, the guards quietly moved their gazes away. It was not their place to concern themselves over the owners' affairs, nor could they speak about these things randomly. The only thing they could do was to act as though everything was normal and let it go. </span></p><br/><p><span>Su Xuanyan brought Xue Ling to the building that he directed them to. Xue Ling refused to separate from him after they arrived downstairs, so Su Xuanyan could only send him all the way home, and take him upstairs. </span></p><br/><p><span>The elevators for the apartments in this district were all shared, but the elevator could bring them directly into the apartment. Xue Ling had no intention of hiding anything from Su Xuanyan as he swiped his nano-computer, and input his preset password. Afterwards, he leaned on Su Xuanyan’s shoulder and watched as the elevator brought them up. </span></p><br/><p><span>Xue Ling's apartment was not very large. It had two rooms and one living room. The elevator deposited them into a special elevator foyer that led to the entryway. Su Xuanyan placed Xue Ling on the sofa, where he then lay bonelessly. Su Xuanyan saw that he was lying there a little dazedly, determined that there probably wouldn't be any more problems, and turned to go. </span></p><br/><p><span>In fact, based on his personality, it was already a big deal that he had sent someone home, so there was no way that Su Xuanyan would be willing to look after Xue Ling now.</span></p><br/><p><span>But even though he wanted to leave, Xue Ling refused to let him go. Xue Ling grabbed him by the waist as soon as Su Xuanyan turned around, his head rubbing against his waist as he spoke aggrievedly, \"Dizzy. Uncomfortable.” </span></p><br/><p><span>Su Xuanyan tensed up. He hesitated for a beat, then turned around and looked at Xue Ling expressionlessly.</span></p><br/><p><span>Xue Ling kicked his feet, expressing that he wanted to have his shoes taken off. </span></p><br/><p><span>Su Xuanyan: “…” He was sticking his nose into the air, right? This was too presumptuous.</span></p><br/><p><span>Although his heart was full of thoughts about whether or not this person was seeking death, Su Xuanyan was quite natural and skilled at taking off his shoes and driving Xue Ling into his bedroom. </span></p><br/><p><span>Since he refused to sleep on the sofa, sleeping on the bed shouldn't be a problem, right?</span></p><br/><p><span>But Xue Ling refused to sleep without changing his clothes.</span></p><br/><p><span>Su Xuanyan thought for a moment, stretched out his hand and rubbed the other party's head. When the other party felt comfortable and blinked, he chopped down on Xue Ling's nape.</span></p><br/><p><span>And directly knocked him unconscious.</span></p><br/><p><span>Now that nobody was sticking to him and preventing him from leaving, Su Xuanyan nodded in satisfaction and glanced at the decorations inside the apartment. From what he could see, there seemed to be only one set of everything. The words this person had spoken before about them living together should have been nonsense; there didn't appear to be a second person living here.</span></p><br/><p><span>Su Xuanyan didn't linger and left immediately, but he discreetly wrote down this address and prepared to investigate this person properly when he returned home.</span></p><br/><p><span>No matter whether he had been pretending or acting tonight, or if he had been speaking the truth, or even if the two of them knew each other and it was related to his lost memories, as long as he had locked down on a specific person, he would be able to get ahold of everything about them. </span></p><br/><p><span>After Su Xuanyan had really left the residential community, the system finally emerged from Xue Ling's spiritual awareness. Previously, it hadn't dared to come out while Xue Ling and Su Xuanyan were interacting, because as long as Su Xuanyan was able to sense it, he would definitely be able to shake off the seal that the Ten Directions World had placed on his memories. </span></p><br/><p><span>Su Xuanyan’s abilities were no weaker than the Ten Directions World's. It was difficult to judge how long the seal would last for. Just like the seal that had been placed on its host which would loosen when he was drunk, as long as Su Xuanyan was near Xue Ling, it would allow some scenes of their interactions together to leak through, allowing him to attract Su Xuanyan's attention. </span></p><br/><p><span>As long as he had taken notice, based on that person's level of ability, he would sooner or later be able to restore his memories. When that happened, the matter of pursuing Xue Ling would be something for that man to be concerned over, and it only needed to help its host take over the entertainment industry and slowly unlock the seal on Xue Ling's memories. </span></p><br/><p><span>Looking at its host who was passed out on the bed, the system quietly complained that Su Xuanyan's methods were too ruthless…</span></p><br/><p><span>He really didn't feel any sort of compassion towards the weak. Since Su Xuanyan had been so willing to knock him out, when Xue Ling woke up tomorrow, unable to recall what had happened, he would probably place all the blame on that man's head.</span></p><hr/><br/><p><em>drunk XL is so cute~ </em></p><br/><p></p><div><div></div></div><br/>\n</div>"}