{"title": "Chapter 192", "id": 192, "volume": 2, "url": "http://boxnovel.org/who-touched-my-tail-chapter-192", "volume_title": "Volume 2", "body": "<h1>Chapter 192</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>14.4 – Wearing the same clothes wasn't terrible; whoever looked ugly was the awkward one</strong></p><br/><p><em>translator: xiin</em><em>editors: BlueBug &amp; Macabre</em></p><br/><p><span> Xue Ling left as soon as the audition was over. The crew would let him know if there was any news, so he was very relaxed as he departed, but his eyes lingered on the row of directors seated behind the table. He glanced over a certain name, then headed out thoughtfully.</span></p><br/><p><span>Not only were the directors seated there; producers and investors were also present. And in the spot where that young looking person was sitting, the name tag said that he was from the World Literature Network… Xue Ling always felt that that person looked very familiar, but he couldn't recall who he was for the moment, and could only wait until they returned before asking the system to look into it. </span></p><br/><p><span>The man had a baby face, and still had a tiny dimple on his face when he wasn't smiling. He looked very small, and if he hadn't been seated there looking like part of the crew, Xue Ling most likely would have suspected that he was a minor. </span></p><br/><p><span>Xue Ling had departed, but the director’s team did not plan to call in the next person for the auditions just yet.</span></p><br/><p><span>The scriptwriter tapped the table and said, “He's the one. I didn't have the inspiration to continue editing the script, but there's no problem now! I'm certain that I can match the script to the style we want now! But the premise is that he has to be Wei Chisu!\"</span></p><br/><p><span>The director did not speak, but the assistant director thought for a while, then said, \"I hadn't expected that he would have made such significant progress. Or could he have had been hiding his talent previously?\" </span></p><br/><p><span>“Regardless of whether he made significant progress or was hiding his ability, as long as his acting is good, he can join. Tianxuan already gave us the go ahead. If the author has no objections, then the role of the protagonist is his.\" That said, the panel of directors all shifted their gaze to the editor who had come on behalf of the author.</span></p><br/><p><span>If they hadn’t already interacted before, perhaps everyone would feel that the World Literature Network had sent this minor over as a joke, but in fact, this baby faced person's work efficiency was extremely high. Ji Zichen tidied up the forms in his hands and said, \"According to my understanding of the story and the feeling that Soaring Skies told me he wanted when we previously discussed this topic, there is no problem with choosing this person. Since the team of directors also agrees, then we will wait for the final product. I'll take the materials back first. If possible, we would also like to have a copy of the video from the audition just now.\" </span></p><br/><p><span>“No problem. But first, we need to have you sign an agreement to guarantee that the crew will not leak any information.\"</span></p><br/><p><span>“Well, it's just for Soaring Skies to see.\" Ji Zichen stood up and continued, \"The main actor has been decided on, and I also understand your requirements and style now; that's enough from my side for today. I'll probably follow up again when shooting starts. Thank you everyone for your hard work.\" </span></p><br/><p><span>“Assistant Ji is going back first?\"</span></p><br/><p><span>“Yes. There's something I want to confirm, and there are other things I need to deal with. I'll first represent the World Literature Network to thank everyone. I hope that the filming for this project will go smoothly.\"</span></p><br/><p><span>“We gladly accept Assistant Ji's auspicious words.\" </span></p><br/><p><span>Xue Ling left the doors of Huaxia Entertainment and entered the hovercraft when he received news from the crew that he had won the role as the protagonist Wei Chisu. Very soon after, Tianxuan's people contacted him directly by phone.</span></p><br/><p><span class=\"jum\">Xue Ling looked at the person who was dressed very seriously in a formal suit, but whose overall effect was ruined by his baby face, blinked, then asked, “You want to sign a contract with me? Why?\" The baby faced person in front of him was somewhat different from the previous one; that one made Xue Ling feel like he was very familiar, and inexplicably felt that he was a small child, but the person in front of him now had a relatively round face, but did not seem small, and inexplicably carried a wife-ish temperament. Fortunately, the suit offset that aspect of his temperament a bit, and made him seem a little more domineering.</span></p><br/><p><span>“Just now, we received news from the team of directors. I also saw the footage from your audition. I very much appreciate you, and Liunian also thinks highly of you. We naturally want have you signed to our company because you are good enough.\" </span></p><br/><p><span>“Su Liunian?” Xue Ling was rather surprised as he tilted his head. “If it’s a formal contract, I can head directly to Tianxuan. I just came out of the Huaxia Entertainment building.\" This was going a little too smoothly; he couldn't help but find it weird. </span></p><br/><p><span>“Come over, then. I'll inform the front desk so that you only have to give your name to come in. We can have a proper discussion regarding the contract.\" </span></p><br/><p><span>The person who had contacted Xue Ling was Su Liunian's agent, Shen Yue. He was supposed to be quite a famous agent in Tianxuan, and it was said that he was responsible for bringing Su Liunian into the spotlight. Later, Tianxuan seemed to have gone through some internal restructuring, and he became one of the main leaders of Tianxuan as well as one of the shareholders. Previously, he had only been responsible for Su Liunian, and it was unclear why he had contacted him so quickly this time. Although he didn't quite understand, Xue Ling still drove to Tianxuan. </span></p><br/><p><span>He didn’t know that Ji Zichen had rushed out after him after he left, but had only been able to watch him leave from behind. He stood there in the parking lot, depressed and annoyed, and stomped his feet before opening his nano-computer to contact another person. </span></p><br/><p><span>“Xue Ling?” Su Liunian asked rather strangely, \"If you're talking about the person in the song you sent to me this morning, I saw his film audition just now, and should be seeing him in person soon.\" </span></p><div><div></div></div><br/><p><span>“In that case, help me probe and see if he recognizes me.\" Ji Zichen was a little depressed. If he had read it correctly, Xue Ling should have something to do with that person who had disappeared for almost a year after saying he needed to go to Su Family to look for someone.</span></p><br/><p><span>“Recognize you?” Su Liunian made a meaningful 'oh' sound, then continued, \"You said he looked familiar this morning, and now you want to ask him if he recognizes you? What are you trying to do behind your Shen Chongwen's back?\" </span></p><br/><p><span>Ji Zichen was left speechless for a while, \"What do you mean, doing something behind his back? It's just that he looks especially like a friend I haven't seen in a long time. I just want to confirm whether or not it's him.\" </span></p><br/><p><span>“Alright.” Su Liunian said, “He was waving around in front of you and didn't greet you. He probably doesn't recognize you, has forgotten about you, or there's something he can't talk to you about. I can help you test him out, but if I can't find anything then there's nothing else I can do.\"</span></p><br/><p><span>“Yeah. I'll just go back and look up his information.” </span></p><br/><p><span>Su Liunian agreed, and hung up before turning to look at his older brother. \"It's rare for a person to catch my eye, but now it seems that the situation is rather complicated.” </span></p><br/><p><span>Su Xuanqing came to work with his younger brother today. He didn’t come to Tianxuan to deal with matters often; Su Liunian needed to help Shen Yue select people today, so he had come along. Hearing Su Liunian's words, he looked up and asked, \"Won't you know if it's complicated or not just by investigating?\" </span></p><br/><p><span>Su Liunian complained about his brother’s bad habit of investigating other people's entire family at the drop of a hat while simultaneously starting his own investigation. Su Xuanqing rather helplessly rubbed his head, then let him research this person named Xue Ling as he liked.</span></p><br/><p><span>From the looks of it, that person didn't have his charm, and it also didn't seem as though he was capable of doing much, so he was reassured as he went back to going through his work documents.</span></p><br/><p><span>Shen Yue spoke oddly, \"He used to have bad acting skills… But he had such a sudden breakthrough this time…\" </span></p><br/><p><span>Su Liunian raised his eyebrows. He also had an approximate sense that there was something fishy about this person, but there wasn't much he could say until he met him in person. He could only say, \"Yueyue, your dreams of becoming a good agent have probably just been shattered~\"</span></p><br/><p><span>Shen Yue was left speechless, “What do you mean? Am I not qualified enough to be your agent?” </span></p><br/><p><span>Su Liunian quickly comforted him, “Not at all, Yueyue is a good broker.” How could anyone that he trained himself not be great? But based on what this person named Xue Ling has done recently, he seemed really independent. Shen Yue probably wouldn't be able to exert much influence, and at most he would be acting like a guide. It was very unlikely that he would have to bring up a newcomer and lead them along step by step. </span></p><br/><p><span>While Su Liunian was speaking, his nano-computer flashed with news again. He lowered his head to take a look, and his eyes brightened as he said in surprise, \"Elder brother, eldest brother says he's coming back.\" </span></p><br/><p><span>Su Xuanqing’s hand paused, \"There's been news from him?\" It has been almost a year since they last heard from Su Xuanyan and learned that he was going to take a vacation. Since then, they had received no news at all, and if it wasn't that they were very reassured about their eldest brother's methods, Su Xuanqing would have wondered if he'd been abducted by aliens.</span></p><br/><p><span>“He said his vacation is over, and he'll probably be back by tonight~\" Su Liunian stood up and excitedly turned around in a circle before saying happily, “This is a good opportunity. I'll go tell Baibai and have him cook a welcome dinner so that we can free-load off him.\" </span></p><br/><p><span>Su Xuanqing: “…” He had originally been unhappy that their eldest brother's return meant that he would have to vie with him for their younger brother's attention, but now he found that his younger brother's focus did not seem to be quite right. Su Xuanqing chose to put the overturned jar of vinegar back in its place. \"What kind of reasoning involves asking the former president to cook dinner for your elder brother's return? The Yuan Group has been busy recently. You shouldn't go and make trouble for others.\"</span></p><br/><p><span>“Oh, I would have forgotten if you hadn't mentioned it. Baibai tossed away a good number of dramas for the sake of that project.\" Su Liunian quickly gathered his thoughts together. Shen Yue had already received notification from the front desk that someone was on the way up, so he hurriedly tidied up his own clothing, and jumped off his brother's legs in order to make a good impression on his new junior.</span></p><br/><p><span>When Xue Ling pushed open the door and entered, he saw that there were there were three people in the room. One was Su Xuanqing, who had his head bowed as he continued looking through his documents, and the other two were Shen Yue and Su Liunian, who were both waiting for him at the door.</span></p><br/><p><span>Xue Ling hadn't expected to receive this level of treatment. He was surprised as he said, \"Hello everyone, I'm Xue Ling.\"</span></p><br/><p><span>Su Liunian should be two or three years older than Xue Ling, but he had a relatively youthful appearance. Coupled with his style of dress, no matter how young he looked, he still carried a gentle and elegant feel. When he smiled, it was like the feeling of a spring breeze blowing against one's face; it was especially likable. \"Hello, I'm Su Liunian. If the contract signing goes smoothly, I'll be your senior apprentice brother.\" </span></p><br/><p><span>Shen Yue wore a standard western suit, and looked very serious and proper. These few years that he had spent with Su Liunian had been a kind of training for him, and the wifely temperament he'd had previously had weakened a lot. When his expression was solemn, he also managed to appear like a successful salaryman. \"Hello, I'm Shen Yue, the one who wanted to sign a contract with you. Come in, and we'll talk.\" </span></p><div><div></div></div><br/><p><span>Xue Ling nodded. Although he didn't know why these two people seemed very different from what the information about them indicated, he could guess that the information that had been released must have been written for the public to see. Only, he couldn't figure out why they were acting in such a natural manner in front of him. \"Well, can I clarify something before we sign the contract? Tianxuan Entertainment's recruitment rules has always been that after passing the film auditions, there is still a testing period. I've only just passed the film audition and you've already gotten in touch. In fact, I feel a little uneasy…\"</span></p><br/><p><span>“You don’t have to worry about that so much. We accept people based on their face, mood, acting skills, and fate.\" Su Liunian immediately began to speak nonsense. The reason Tianxuan hadn't recruited actors in recent years was in part because of him. Back then, he had concealed his identity when he entered the entertainment circle. When some of the employees within Tianxuan became envious of him, they leaked out some blackmail material, saying that he and his second elder brother were in a relationship where he was selling himself for benefits. Su Xuanqing had become really angry when he dealt with this matter, and immediately fired a lot of people. After that, the requirements for actors became much more strict. Adding on the fact that there weren't many people who were able to catch the two film emperors' attention, the situation became how it was today.</span></p><br/><p><span>To be fair, the things they had said about them weren't entirely wrong, but he and Su Xuanqing were in a real relationship, rather than a deal based on money. </span></p><br/><p><span>Xue Ling had doubts about this statement, but the other party was the boss' younger brother, and Su Family's youngest Young Master. No matter what he said, even if it was false, his two elder brothers would help him make it reality. Since the other party was so enthusiastic, Xue Ling also raised his own spirits while dealing with Su Liunian. </span></p><br/><p><span>After interacting with the other party, Xue Ling found that the other party didn't seem to be setting up any traps for him. The topics they discussed were all related to work, and the only personal questions he asked were regarding things that any artist should tell their company. Xue Ling was very clear about his own development, and would prefer to go in the direction of the big screen. High quality TV series could also be considered, but he needed to be able to pick and choose.</span></p><br/><p><span>The first artist that Shen Yue managed was Su Liunian. Back then, Su Liunian's requirement when signing the contract was that he wanted to have full control over his own work. In comparison, Xue Ling had handed over some of the power to him, and he inexplicably felt a little happy. He didn't have many objections to the requests that Xue Ling put forward, but he wasn't sure how Xue Ling planned to continue with the things he had going on the internet. </span></p><br/><p><span>“Voice acting is my hobby, and I started from there, so I can't just put it down.\" Xue Ling felt that there was no need to back down on this point. \"But I will take my work into account, and try my best to not let it affect my performance.\"</span></p><br/><p><span>“That’s fine. Since you're clear about your intentions, I won't prevent you from doing it. Only, at the end of the day, you are a public figure, and should pay attention to the scripts before accepting them. I read through most of your weibo posts and didn't see anything that crossed the line. I'm quite reassured about that point.\" Su Liunian himself had two jobs that he switched back and forth between, and sometimes, when he was shooting a film, he would still need to write a few chapters and save them up. Shen Yue liked that kind of routine, so he naturally would have no opinions when Xue Ling mentioned that the amount of time he needed for voice acting would be about the same as Su Liunian's requirements. </span></p><br/><p><span>After the contract was basically settled on, Xue Ling signed it on the spot. Shen Yue had originally wanted to invite Xue Ling to have a meal together, but was interrupted by an incoming communication. Xue Ling no longer had a reason to stay, and made his goodbyes to the two of them as well as Su Xuanqing, who was still dealing with his paperwork, and left.</span></p><br/><p><span>Tianxuan Entertainment’s company was not large, but the office took up the entire building, and it was located in a good urban area. It could be seen that their backers, the Su Family, had a huge amount of wealth.</span></p><br/><p><span>The automatic door leading outside opened immediately as Xue Ling approached. He hadn't yet reached the range of the sensors, so he looked up, and was a little stunned by what he saw. </span></p><br/><p><span>Outside the door stood a man wearing sunglasses. His slanted, sword shaped eyebrows could be seen over the pair of glasses that obscured half his face. Although he hadn't entered the door, Xue Ling could already sense the indifference that rejected people and pushed them thousands of miles away. The two of them faced each other, and he could clearly feel the cold air coming from this iceberg. </span></p><br/><p><span>But Xue Ling couldn’t help paying attention to this person, and had no way to avoid feeling awkward, because the long coat the man was wearing was the same one as Xue Ling's. But while Xue Ling's was white, the other party's was black… </span></p><br/><p><span>Wearing the same clothes wasn't terrible; whoever looked ugly was the awkward one. </span></p><br/><p><span>Xue Ling did not feel embarrassed because of his face or figure, but rather, the difference in height made him unhappy…</span></p><br/><p><span>It was the same coat, but when the other person wore it, it reached his knees. On him, it reached his calves… Although they both looked handsome, he just couldn't let it go…</span></p><br/><p><span>That person very obviously did not notice Xue Ling's embarrassed expression. He pulled his suitcase behind him and brushed past Xue Ling without even sparing him a glance.</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}