{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/who-touched-my-tail-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>14.16 – This kind of feeling… was probably contentment </strong></p><br/><p><em><span>translator: xiineditors: alamerysl &amp; BlueBug</span></em></p><br/><p><span>Zhu Ruoqiu graduated one year ago, and had been working as an assistant director in the entertainment industry for the last six months. This was how he met Fan Yueze. Fan Yueze liked him a lot, and knowing that Xue Ling was planning to go see him, he told Xue Ling about the origin of the script in Ruoqiu's hands.</span></p><br/><p><span>It was a literary film with some biographical elements that told the story of an ancient talented scholar who lived a legendary life. His life experiences were very dramatic; in the first half of his life, he was a scholar of repute who then chose to take the path that scholars despised the most and went into business. In the second half of his life, after the country broke down, he tossed aside his pen and fought on the battlefield, supporting a new Emperor to the throne and helping to build a new country. However, after the new Emperor ascended the throne, he left behind some poems that were handed down through the generations and disappeared without a trace. There was no more news of him in the history books, and there were even rumors that he had ascended to heaven as an immortal.</span></p><br/><p><span>He was a very well-known person in Hua Country, and was somebody that nobody would dare to touch. Many people researched him and wrote about him, but nobody had dared to create a film about his life. This was also the reason why Zhu Ruoqiu had a good script, yet had difficulties finding investment.</span></p><br/><p><span>Films regarding this person were too likely to attract criticism. If one was even a little bit careless, they would be cursed and scolded, and it was possible that the starting point for their entire career would be completely destroyed. </span></p><br/><p><span>Fan Yueze had vaguely mentioned that the movie involved the personal life of this personage that seemed to have an external plug-in, and it was particularly because of this that the investors did not dare to make a move. </span></p><br/><p><span>Although Su Xuanyan wondered why Xue Ling had asked him to come with him to read a script, Xue Ling seldom called on him, so he naturally had no reason to disagree. The two of them arrived at Zhu Ruoqiu's home using the address that he'd provided.</span></p><br/><p><span>Zhu Ruoqiu’s home was in a strictly managed private community. Without his permission, the guards at the gate would not allow them to enter at all. Each villa in the community belonged to a single family, and Zhu Ruoqiu's house was by the lake. The environment there was great, and after receiving news of their arrival, he made it a point to stand outside and wait for Xue Ling to arrive. He was dressed casually, and his demeanour gave off the impression that he was a successful person. It was completely different from the unsuccessful assistant director that Fan Yueze had previously described.</span></p><br/><p><span>The three of them greeted each other and entered the house. Zhu Ruoqin completed the basic etiquette for pouring tea, then retrieved the smile from his face and said, \"Director Fan knew that I've always been looking around for someone for this role, which is why he recommended you for this film. Before you came, I looked up your previous works as well as watched listened to some advice from Director Fan. I respect your acting skills, but it's not only acting ability that's required in order to qualify for a role like this.\"</span></p><br/><p><span>Xue Ling nodded his head to show that he understood. His current resume, no matter how one looked at it, seemed very shallow, and if it hadn't been for Zhu Ruoqiu's own resource constraints, he would not need to look for someone to fill his roles on his own. As long as someone invested, he would have a producer, and would only need to be responsible for waiting for actors to come to him and audition with the script.</span></p><br/><p><span>“I’m not only here for an audition today. I also brought someone, and if the script is as good as Director Fan said it was, with the potential to win prizes, you won't need to concern yourself over investment, either.\" </span></p><br/><p><span>Su Xuanyan, the ATM, did not speak from his position beside him. It looked as though he was simply there to support Xue Ling despite being clueless over why Xue Ling had pulled him here prior to hearing their conversation. </span></p><br/><p><span>Zhu Ruoqiu looked at Xue Ling and saw that he appeared very serious. Considering that Fan Yueze was the one who had recommended him, he finally handed a copy of the script over to Xue Ling.</span></p><br/><p><span>“This is my father’s book. Before he died, what he wanted to see most was for me to make this into a film, but he couldn't wait any longer, and I was unable to do it in time. For whatever reason, I want to make this film into my first work. I can accept the harsh environment and long hours, but I cannot accept the book being changed, nor can I accept another person taking the director's position. This is why the book has always been in my hands and it has been difficult to find investment.\" </span></p><br/><p><span>A good book paired with a new director was a combination that investors could not see any benefits in, which was why Zhu Ruoqiu had been unable to pull in any good investment. </span></p><br/><p><span>Xue Ling did not speak. Rather, he opened up the script and began to look through it. </span></p><br/><p><span>Che Gongzi was the most beautiful flower in that era. He became famous at a young age, and was famous for his beauty even in the history books. When official records described him, they even spoke of his beauty as a type of burning brilliance. He was attractive, but he was not famous merely for his good looks. He was the youngest scholar champion in history, and he obtained the title of the number one scholar. Although his name was not often mentioned after he achieved this fame, he left a lot of historical materials and books for future generations during his era.</span></p><div><div></div></div><br/><p><span>He wrote and created like a maniac during this period of time. He was clearly still young, but every book of his became a classic that was handed down from generation to generation.</span></p><br/><p><span>His life experiences made him an extremely Jack Su character, but the way he lived his life left people with a different feeling.</span></p><br/><p><span>He became famous as a young man, and hadn't yet turned thirty when he suffered from the turbulence of his country. In the face of such chaos, he gave up his civilian pursuits to join the army and supported the new emperor in creating a new dynasty. The emperor became the founding emperor of Hua Country, Founding Ancestor Zhu Ji. After ten years of war, they took down the rivers and mountains, but by the time Zhu Ji ascended the throne, the personage who had a unique wisdom and demonic level of knowledge was no longer by his side.</span></p><br/><p><span>After that, he disappeared. Poems that he wrote from time to time would surface in the world, but when anyone went to look for him, he would already have vanished without a trace.</span></p><br/><p><span>The founding of a dynasty was a tense period of time, but the emperor still issued an edict to search for Che Gongzi. However, they ultimately failed. </span></p><br/><p><span>The script began with the fall of the Capital in the eighth year of the Jianan Period. Che Gongzi was like a prophet, leading the people from the palace away from the Capital before it was sealed.</span></p><br/><p><span>He resolutely resettled his family, then left on his own to join the army. After several twists and turns, in the second year of the revolution, he chose to join Zhu Ji, who was not big at the time and only occupied a single city. In the following eight years, he used his wisdom and martial ability to support Zhu Ji, and fought with him to take down city after city, ultimately dominating the rivers and mountains of the country. </span></p><br/><p><span>The film chose two battles to depict his unique wisdom. One was his first battle as a military advisor, where he established his position in Zhu Ji’s army; the other was the battle that determined Hua Country's new dynasty. After that war, Zhu Ji's army sept across the Central Plains and the rest of the country. It was the most perfect battle of his life, but it was also his last battle. </span></p><br/><p><span>After the war, he left many, many precious things for the new emperor, Zhu Ji, and then, on a sunny day, he left and never returned.</span></p><br/><p><span>The film did not stop abruptly after his departure. After leaving the emperor, Che Gongzi made his way through the Central Plains. Many people saw his shadow in various places, but they did not reveal his whereabouts to the government. At the end of the story, Che Gongzi went to sea and left the river and mountain that he had almost single-handedly subdued.</span></p><br/><p><span>Fan Yueze had mentioned that the movie would touch on the emotional drama between him and Emperor Zhu Ji. The depiction of this emotion in the script was rather vague, but not ambiguous, and in some ways rather straightforward. It was precisely these emotions that made Che Gongzi ultimately choose to leave the court behind and distance himself from the country. And although the emperor became the most powerful person in the world, he was unable to discover the whereabouts of that person ever again.</span></p><br/><p><span>How natural and unrestrained Che Gongzi had been during his departure was directly proportional to how lonely the figure of the emperor who stepped onto the throne of heaven was. </span></p><br/><p><span>Although the film had an emotional component, the script did not highlight this aspect of the drama. Despite how important Zhu Ji was in the film, he was not a main character in the script. Instead, he was a supporting actor, and Che Gongzi was the true protagonist of this story, because the entire film was told from Che Gongzi's perspective. What he saw looked upon brightly would be displayed vividly in the film, while the things he viewed dimly would be diluted.</span></p><br/><p><span>The story was simple, but the script was excellent. His description, his narrative style, all aspects of the film were outstanding. As Fan Yueze said, this book could definitely be brought out to win awards. </span></p><br/><p><span>After reading the script, Xue Ling turned to Su Xuanyan and asked, “If I tell you to invest, would you invest even if you don't want to?\" </span></p><br/><p><span>Su Xuanyan looked at him helplessly and had no choice but to say, \"Yes.\" </span></p><br/><p><span>Xue Ling put down the script in satisfaction and said to Zhu Ruoqiu, “Director Zhu, Su Family will invest in this script, and Tianxuan will help you with the production. You'll shoot it, and I'll star in it.\"</span></p><br/><p><span>Zhu Ruoqiu hadn't expected that he would come to a conclusion so quickly. He was surprised as he asked, \"Are you really able to play the leading role?\" His concern was not about the investment or how to produce the film, but whether or not Xue Ling could act out the role he had in his heart.</span></p><br/><p><span>Xue Ling nodded, turned over the script and said, “Since Director Zhu doesn't have confidence in me, give me ten minutes. I hope Director Zhu will give me a chance to audition.\"</span></p><div><div></div></div><br/><p><span>Zhu Ruoqiu saw that he had been prepared for such a situation and nodded. \"Since you think you can do it, give it a shot.\"</span></p><br/><p><span>Twenty minutes later, Xue Ling and Su Xuanyan left Zhu Ruoqiu’s house, and Su Xuanyan notified Su Xuanqing to send someone from the company to contact Zhu Ruoqiu about their upcoming partnership. </span></p><br/><p><span>Xue Ling was in a good mood and asked him, “Was my performance good?”</span></p><br/><p><span>Su Xuanyan looked at him, his gaze filled with a rare gentleness, \"You were that kind of romantic and distinguished figure once. How would you be unable to portray his character and give a bad performance?\" </span></p><br/><p><span>Xue Ling's footsteps paused. He stopped for a long time before asking, \"Then, when I was that kind of romantic and distinguished character, was I like him in the end? Going far away and never returning.\" </span></p><br/><p><span>“Yes, you went to a very faraway place, and never came back.\" The two of them seemed to be speaking in riddles, and temporarily moved away from the topic. </span></p><br/><p><span>“If, and I mean, 'if', this movie really wins prizes, then I'll be able to remember what happened between us.\" Xue Ling spoke very earnestly, \"You invest, and I'll work hard. If I remember everything, we'll go get the marriage license.\"</span></p><br/><p><span>Su Xuanyan was shocked, and fell a step behind before disbelievingly chasing after Xue Ling. He grabbed Xue Ling's hand and asked, \"Were you serious just now?\"</span></p><br/><p><span>“You said it. We've been together many, many times.\" Xue Ling was still serious, \"Since we can love and support each other in so many lifetimes, then there is nothing that the me who has remembered everything would refuse to do for you.\" </span></p><br/><p><span>“Su Xuanyan.”</span></p><br/><p><span>“I’m here.”</span></p><br/><p><span>“You can’t betray me.”</span></p><br/><p><span>“I won't.” Su Xuanyan smiled as he pulled him into his arms. “I know. If I betray you, you'll kill me.\" He lowered his head to meet Xue Ling's gaze, his eyes filled with tenderness and laughter, and incredible sweetness. \"As you said, we've gone through so many lives together. I fall in love with you every time even without my memories, so how could the me who has remembered everything ever betray you?\"</span></p><br/><p><span>Xue Ling looked into his eyes and saw his own face reflected in Su Xuanyan's pupils. He thought about it, then leaned up and gave Su Xuanyan a kiss before turning and breaking out of his embrace. He grasped Su Xuanyan’s hand, held it tightly, and intertwined their fingers together. \"I've stamped it. You're mine from now on.\"</span></p><br/><p><span>“Yes, I'm all yours.”</span></p><br/><p><span>That night, Xue Ling had a dream. In his dream, a fierce war was waged on the battlefield, and the sound of soldiers fighting rang through the sky. Su Xuanyan rushed towards him on horseback, jumping off his horse just as he arrived and rushing forward to hug him. </span></p><br/><p><span>He cried while holding him.</span></p><br/><p><span>Tears fell onto his shoulder. He wanted to reach out, pat him on the shoulder and tell him not to cry, but he found that he could not move at all, and his body was stiff. </span></p><br/><p><span>It seemed that he was dead.</span></p><br/><p><span>Xue Ling found it very peculiar. Su Xuanyan had said that they were very happy in every life, and had never mentioned that he had died like this in one of their lives. This was probably what Su Xuanyan had meant when he said that he had gone to a very faraway place and never returned.</span></p><br/><p><span>In addition to his dream about the battlefield, he dreamed about a lot of other scenes, most of which were surrounding his death. Every time he left, Su Xuanyan would be by his side accompanying him, and after he left, Su Xuanyan would follow. </span></p><br/><p><span>Xue Ling woke up in the middle of the night after dreaming of death again and again. His spirit was somewhat depressed, and he tossed and turned in bed before finally running to Su Xuanyan's bed, bringing his pillow with him. </span></p><br/><p><span>Although Su Xuanyan’s bed was a single, it was still relatively wide. Xue Ling hesitated, then lifted up his quilt and stuffed himself inside. </span></p><br/><p><span>It was rather difficult to fit two people onto a single bed, and his actions naturally woke Su Xuanyan from his light sleep. Su Xuanyan didn't say anything, and seeing Xue Ling try to stuff himself into bed, opened his arms and pulled him into his embrace.</span></p><br/><p><span>Their bodies were pressed closely together, and Xue Ling could feel Su Xuanyan's heartbeat and breathing. </span></p><br/><p><span>He had originally thought that he wouldn't be able to sleep cramped up like this, but he somehow managed a good night of sleep.</span></p><br/><p><span>This kind of feeling… was probably contentment.</span></p><hr/><br/><p><em>Ari did fanart for a scene from this chapter &lt;3</em></p><blockquote class=\"twitter-tweet\" data-dnt=\"true\" data-width=\"550\"><p lang=\"en\">I'm posting this before the chapter comes out so click with cautionThe end is near. . . :sobs: I'm not crying, you are. . . ！ (Who Touched My Tail!) </p><br/><p>— ARI ✂(⭕・ㅅ・)🔪 (@xAI_ICE) </p></blockquote><br/><p></p><div><div></div></div><br/>\n</div>"}