{"title": "Chapter 209", "id": 209, "volume": 3, "url": "http://boxnovel.org/who-touched-my-tail-chapter-209", "volume_title": "Volume 3", "body": "<h1>Chapter 209</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>NSFW Scene from </strong></p><br/><p><em>translator: xiin</em><em>editors: alamersyl &amp; Kaizer </em></p><br/><p><span>Xue Ling hummed twice and let Augustine place him onto the bed as he liked, pushing both of his hands over his head. </span></p><br/><p><span>The tip of Augustine's tongue slowly slid down along his hands, licking down his arm, and finally reaching his face. The man's kisses fell one after the other, making Xue Ling squint his eyes. </span></p><br/><p><span>He had fallen into confused lust long ago, and found it rather difficult to adapt to this slow, extended foreplay. That desperate feeling of wanting to be filled made him want to urgently </span><i><span>do it</span></i><span> with the man, but he was pressed down by the other party and couldn't move at all. </span></p><br/><p><span>Augustine seemed to know what he was thinking. He gave a low laugh and said, “I don’t want to hurt you. Don’t be anxious, okay?”</span></p><br/><p><span>Xue Ling felt a bit of admiration for his ability to hold back to this extent. He even began to wonder if the other party was unaffected by his pheromones. </span></p><br/><p><span>But in fact, the man’s lower body was painfully swollen. He also wanted to ignore everything and plunge directly into the youth's body, but his remaining reason told him that this would hurt the youth and it helped him suppress the urge. </span></p><br/><p><span>After removing all the clothing from the youth's body, Augustine's palms slid down the body that drove him crazy, and his adam's apple bobbed as he swallowed unconsciously. </span></p><br/><p><span>It seemed that the youth knew what he was looking at and generously opened up his legs. His white and slender feet landed directly on the lower half of his body and rubbed against him over and over. Although he was being tormented by the heat pheromones, he still had the strength left to go all out and tease the man. </span></p><br/><p><span>Simply put, he was ceaselessly trying to cause trouble.</span></p><br/><p><span>Augustine's gaze was dark and very terrifying, but Xue Ling was fearless. </span></p><br/><p><span>The man took off his trousers. Due to the youth's teasing, the lower part of his body was already unable to wait, springing up from his underwear as soon as he pulled it down. </span></p><br/><p><span>This made Xue Ling recover a little bit of his sanity. It was probably because this scene was a little too exciting; that lower body part was a little too big.</span></p><br/><p><span>That pair of small feet that had dared to wander everywhere now retracted silently, but Augustine didn't think too much of it; how could he let him off so easily and let him get away after teasing him? He reached out and placed the youth in his lap. He was sitting on the side of the bed, and due to their position, the youth was straddling his thighs, his legs were separated, and the excited little thing between his legs pointed upwards vigorously.</span></p><br/><p><span>Augustine pinched his chin and made Xue Ling look up at himself, moving his waist slightly so that their two hardened rods could meet. He could feel the person in his embrace tremble. Just now, his actions were very provocative and unrestrained, but now he was starting to become afraid?</span></p><br/><p><span>Augustine found it a little amusing and bowed his head to kiss the youth's mouth. </span></p><div><div></div></div><br/><p><span>His hand caressed slowly along the curve of the youth's waist, rubbing against the two pink points on his chest and causing the youth to writhe and unconsciously push forward.</span></p><br/><p><span>Xue Ling's body moved ahead of his brain, and after moving, he started to feel embarrassed. He could feel that the other party's stiff object had hardened even more because of his movements just now, and it felt strange as it rubbed against him. He hadn't yet recovered his wits when the man lifted up his body, bowing his head to slide the tip of his tongue up and down against his right nipple. Augustine noticed that he had lowered his head to watch and laughed quietly, \"Is it because I'm not working hard enough that you still have the ability to go into a daze?\"</span></p><br/><p><span>Xue Ling wanted to retort, but the man sucked that little nub between his lips, and his teeth scraped slowly across the tip of his nipple.</span></p><br/><p><span>His body seemed to become overcharged. Xue Ling was dissatisfied with his own passiveness, opening his mouth over the man's shoulder and biting down. Although the difference in physique prevented him from biting down too hard, he could still create some marks on the man's skin. </span></p><br/><p><span>After biting him once, he seemed to have become a little addicted to the feeling, stretching out the tip of his tongue to lick the area where he had just bitten and sliding over the teeth marks. Augustine took advantage of this moment, kissed him on the ear, and inserted the finger he had just dipped into salve deeply into the youth's lower passage. </span></p><br/><p><span>Xue Ling gave a choked cry and frowned at the new sensation. Fortunately, this world's settings had been created with smut in mind, and his body adapted quickly to such things. The pink hole quickly acclimatized itself to the inserted finger, and the passageway contracted as though wanting more. </span></p><br/><p><span>Xue Ling impatiently twisted his waist. </span></p><br/><p><span>Augustine placed him back on the bed and pushed his long legs up to his chest. Rather than patiently letting him adjust to a second finger, he immediately inserted three fingers all at once.</span></p><br/><p><span>Xue Ling let out a cry of surprise, and his hole began to tighten in resistance. </span></p><br/><p><span>Augustine kissed his toes lightly and said softly, “Relax a bit, you can do it.”</span></p><br/><p><span>Xue Ling muttered quietly and looked a little aggrieved as he glanced at him, but the glance that he sent over only made the man's breathing catch and was followed by an even more violent offense.</span></p><br/><p><span>The moans and increasingly intense pheromones in the air stirred up Augustine's nerves. The person under him had softened into a puddle long ago, and the little hole in his lower body seemed a little discontented as he pulled out his fingers, fluttering and contracting as the youth's moans turned even more pleasing to the ears. </span></p><br/><p><span>Augustine once again picked up the youth, kissing his eyelids as he whispered, \"Are you alright now?\"</span></p><br/><p><span>Xue Ling’s arms curved around his neck weakly as he said rather impatiently, \"You're still able to hold back, how fierce.\" </span></p><br/><p><span>Augustine intuitively felt that it was better to have him moan rather than speak. The man held him, accurately positioning the entrance to his hole over his own hard body part.</span></p><div><div></div></div><br/><p><span>He meant to let the youth slide down slowly, but the youth just had to struggle a bit and ended up sitting down all at once. </span></p><br/><p><span>Xue Ling gasped loudly as he felt something tearing through him. That feeling of being empty faded, and the man's huge object filled him up completely from behind. It made his entire body tighten up, his hole tightening convulsively and forcing a low groan from the man. </span></p><br/><p><span>“Relax.” Augustine reached out a hand and patted his butt. </span></p><br/><p><span>Xue Ling was rigid, but he also knew that he shouldn't be so stiff. He stared at the man with some grievance in his eyes as he relaxed his body, making it easier to accept the man's hugeness. </span></p><br/><p><span>He knelt on the man's body, wrapping his arms around his neck and said somewhat lazily, \"This position… do you want me to move myself?\"</span></p><br/><p><span>It wasn't enough just to say it, he even rocked his hips.</span></p><br/><p><span>This kind of stimulation made the man who had fallen into pleasure completely lose control. Augustine held the youth against him as he stood up, pulling the hard object out of his body completely and fiercely thrusting it back in. </span></p><br/><p><span>“Ah!” Xue Ling clung tightly to his neck, afraid of falling down, but soon, he had no energy left over to worry about whether he would fall or not. The man's movements were fierce and rough, and it seemed as though he was a different person from the one who had been so patient and gentle with foreplay at the start. He pulled out all the way every time, and then went back in as quickly as possible.</span></p><br/><p><span>These large movements made him hover at the edge of life and death, he could see nothing but flashes of light in front of his eyes, and he lost track of time.</span></p><br/><p><span>The man clearly understood what an omega in heat needed. The grinding movements from before had been done just for fun. Now that they were in full swing, his movements made it so that Xue Ling could do nothing but gasp and moan, unable to say anything else at all. </span></p><br/><p><span>The scent of the pheromones inside the room gradually changed. As Augustine's actions continued, he no longer had any way to control the release of his own pheromones. Once the domineering and powerful fragrance was released, it couldn't help but cover up the entire room in the pervasive scent. Any reason that remained in Xue Ling's mind completely disappeared along with their combined scents.</span></p><br/><p><span>All that remained was the most original, basic desire.</span></p><br/><p><span>They were born into this world for each other, and their bodies were naturally a perfect, incomparable fit. They would never be bored of each other when entangled together, and other than wanting to keep the other party locked firmly to their side, their brains were fundamentally focused on nothing else. </span></p><br/><p><span>After the release of the first wave of climax, the second wave of desire quickly followed.</span></p><br/><p><span>Very soon, they were both deeply immersed in this indulgent joy and pleasure, forgetting everything around them.</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}