{"title": "Chapter 207", "id": 207, "volume": 3, "url": "http://boxnovel.org/who-touched-my-tail-chapter-207", "volume_title": "Volume 3", "body": "<h1>Chapter 207</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Extra 1 – This family was unbelievable! </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; BlueBug</em></p><br/><p><strong>1. Regarding the two film emperors:</strong></p><br/><p>In the interview period after the Oscar Film Festival, the reporters surrounded Su Liunian. \"Excuse me, Film Emperor Su, Xue Ling stepped off the stage right after giving his acceptance speech. Is it because there's some discord between the two of you?\" \"What is Film Emperor Su's attitude towards the organizing committee's decision to have two film emperors this year? Can Xue Ling's acting really compare to yours?\" \"Xue Ling signed with Tianxuan. Will he have a say in Tianxuan's matters in the future?\" \"Xue Ling left in such a hurry. What's going on?\"</p><br/><p>“What opinions does Film Emperor Su have regarding today's award?\"</p><br/><p>Su Xuanqing stood silently in front of his brother and released his chilly aura. The reporters slowly withdrew the microphones that they had pointed at Su Liunian's face, and instantly became much more orderly.</p><br/><p>The shadow that Su Xuanqing left in the journalists' hearts was still there. Reporters never dared to act rashly when faced with this man who had already retreated to the shadows, but who still had great influence on the industry.</p><br/><p>Aiya, there were too many topics to report on tonight. They had been reckless; Su Liunian's guardian saint was always near his side.</p><br/><p>“I know that everyone is anxious to obtain first-hand information.” After his elder brother showed up with an ugly expression, Su Liunian naturally came out and revealed a bit of embarrassment. \"Xue Ling left in a rush because there are urgent matters to deal with, something very important. Also, regarding the relationship between the two of us, I want to explain it properly.\"</p><br/><p>He had always exuded a flexible and gentle image when dealing with the media, but journalists were never able to obtain the initiative when he made statements. \"Xue Ling is one of our company's artists, and is naturally my junior brother. I'm very willing to bring him up and take care of him. I treat him like a family member, and sincerely hope that he can become family in the future. So, you don't have to try and guess at what discord might exist between us. I don't think it will ever exist.\" </p><br/><p>The reporters were confused for a while, not understanding what Su Liunian was trying to imply, but in the twinkling of an eye, Su Liunian had already left with Su Xuanqing. They had been unable to get any information from Film Emperor Su's mouth.</p><br/><p>Speaking of which… What did he mean by 'hope that he can become family in the future'?</p><br/><p><strong>2. Regarding the wedding license:</strong></p><br/><p>The next morning after passing the lightning tribulation, Xue Ling and Su Xuanyan didn't have time to go home or update anyone. Xue Ling took advantage of the fact that the body he had rebuilt after the tribulation had long hair and successfully prevented anyone from recognizing him as the new film emperor from the previous night. He pulled Su Xuanyan along with him into the Civil Affairs Bureau in X City to register for a wedding license. </p><br/><p>Fortunately, robots were responsible for completing the process. They managed to avoid shocking the cameraman, and although the young woman responsible for stamping their license had many doubts about the two of them, she failed to recognize Xue Ling until she returned home. She only realized she seemed to have done something extraordinary today after she returned home.</p><br/><p>Having obtained two little red books, Xue Ling was in a particularly good mood. Although this was not the first time they had been married, it was the first time they had printed their real names onto a little red book.</p><br/><p>He brought Su Xuanyan and hung out the entire day, going to many places and doing a lot of things that appeared to be things that ordinary couples would do before finally re-establishing that he really existed and that this wasn't a dream.</p><br/><p>After the sky turned dark, the two of them sat in the revolving restaurant on the tallest building in the city and looked down at the city spread out before them. All of a sudden, their hearts finally landed back in place. </p><br/><p>Xue Ling's eyes were bright as he looked at Su Xuanyan and said, \"Let's go book a room!\"</p><br/><p>Su Xuanyan spoke helplessly, “Why get a room when we have a home to return to?\"</p><br/><p>Xue Ling said, “There's nobody at home to do the cleaning. Let's book a room and get it on!\"</p><br/><p>Su Xuanyan: “…” He had only just restored his memories, but immediately turned brazen. </p><br/><p>But he liked it.</p><br/><p><strong>3. Regarding getting a room:</strong></p><br/><p>The hotel belonged to the Yuan Family, and the front desk was stunned silly.</p><br/><p>“Hello, we'd like a lover’s room.” The two men in front of her placed the nano-computers on their wrists on top of the counter. </p><br/><p>The young woman at the counter answered in a flurry, “Ah! Dear gentlemen.” She blinked and looked clearly at the two men in front of her. Although one of them had long hair, they were indeed two gentlemen. \"Our couple rooms are divided into couple suites and newlywed suites, and we also offer honeymoon packages. According to the system, you gentlemen are newly married. We'd like to recommend…\"</p><br/><p>Even before the young woman finished speaking, she heard the long-haired man say, \"That one, then. Let's do whatever is most romantic.\"</p><br/><p>As a single dog, the front desk young woman could only grit her teeth.</p><br/><p>Wuwuwu, how come she was stuffed with dog food every day even while working at the front desk of a hotel? What did this newly married couple want? Requesting a room on the night of their wedding, what kind of tastes were these? </p><div><div></div></div><br/><p>After she gritted her teeth and finished completing the registration process, the young woman at the front desk looked at the backs of the two men as they departed together and suddenly remembered that the long-haired man's face looked a little familiar…</p><br/><p>“Ahhhhhhhhh it's a male god!!!”</p><br/><p><strong>4. Regarding getting exposed</strong></p><br/><p>The headlines on the second day after the Oscar Film Festival were all full of news regarding the two male film emperors that had been appointed at the festival. </p><br/><p>The headline on the third day was about the newly crowned Film Emperor having dinner with a mysterious man in a revolving restaurant, after which they went to the Yuan Su Grand Hotel to rent a room.</p><br/><p>The public was in an uproar. The mysterious man was covered in mosaic, and nobody could see who he was. There was a lot of discussion both online and offline, and Xue Ling's Weibo exploded instantly. Tianxuan and Su Liunian's weibo accounts were also in a similar situation.</p><br/><p>Su Liunian had probably been implicated because he had said 'hope that he can become family in the future', causing many people to believe that the mysterious man was him.</p><br/><p>Su Liunian's fans all stood up for him. </p><br/><p>[ You must all be fake fans. You can tell just by looking at their height that it's not our little film emperor, oay?! ]</p><br/><p>Su Liunian: “…” It's fine to refute the rumors, but why attack my height?</p><br/><p>At this moment, the outside world was turning upside down, the entrance to the hotel was surrounded by reporters, and Xue Ling…</p><br/><p>Was in a deep sleep. </p><br/><p>He had fooled around with Su Xuanyan all night, and only laid down for less than two hours before waking up to the ringing of his phone. He was in a very bad mood when he got up, so Shen Yue was able to see a rare, murderous side of the artist he managed.</p><br/><p><strong>5. Regarding getting exposed 2</strong></p><br/><p>Xue Ling reluctantly pulled up some energy and finally understood why Shen Yue had contacted him so early. It was because they had been too bold and reckless yesterday, so his first headline after obtaining the title of film emperor was the breaking news of him getting a room with another person.</p><br/><p>To tell the truth, Xue Ling wasn’t shocked at all. It wasn't a big deal; Su Xuanyan wasn't someone that needed to be hidden. So he told Shen Yue to stay calm and let him sleep some more. </p><br/><p>Su Xuanyan had also been woken up. The first thing he did was to bow his head and give Xue Ling a kiss. Then, he leaned against Xue Ling's shoulder to look at Shen Yue on the other side of the screen and said, \"You guys can deal with this matter first. When we have time in the afternoon, we'll set up a press conference. No need to suppress the news. Since it's been exposed, we'll make it public.\"</p><br/><p>Shen Yue: “…” He had just been stuffed with a big handful of dog food. They were sleeping together in the same bed and weren't wearing clothes; he had absolutely no idea what had happened last night!</p><br/><p>Shen Yue hung up and turned his head to speak to his other artist, who was lying down lazily to one side, \"Your eldest brother says to announce it.\"</p><br/><p>Su Liunian made an 'oh' sound, then continued, \"If he wants to make it public, then make it public~ Unexpectedly, I just said it two days ago, and today it has already become reality~ Eldest brother has done a great job.\" </p><br/><p>Shen Yue: “…” He really didn't want to concern himself over this family!</p><br/><p><strong>6. Regarding getting exposed 3</strong></p><br/><p>The conference was scheduled for the afternoon of the fourth day, which provided ample rest time for the two of them.</p><br/><p>The press conference was broadcast live on the internet. Xue Ling's fans, who had been unable to obtain any news of their star and instead received news of a sex scandal, had begun to suspect that they were supporting a fake star. Even so, they would not let go of any occasion where Xue Ling would make an appearance, so they came in early with a small bench and waited for the conference to begin. </p><br/><p>They were currently at Yuan Su Grand Hotel. As the door had been blocked by a group of reporters these two days, they had chosen to hold the conference here as a way to express their apologies to the hotel. Su Xuanyan also made it a point to contact Yuan Chuanbai beforehand to pass on the news, and received a blessing for one hundred years of happiness.</p><br/><p>Reporters arrived early and set up their equipment, but when they looked at the layout of the venue, they started to wonder if they had come to the wrong place and were attending a wedding instead…</p><br/><p>Everyone was given wedding candy, too. What was going on!?</p><br/><p>Facts proved that this was a real wedding. The parties involved really deserved their reputation. Xue Ling shocked everyone whenever he appeared; he always made big news every time. </p><br/><p>They actually showed up hand in hand.</p><br/><p>Comments came in a crazy barrage: [ AHHHHHH Male god! ] [ I don't care if the screen is dirty, I'm going to lick it and strike first! ] [ He can actually hold male god's hand! I've only seen male god from far, far away QAQ If I was able to touch his hand, I wouldn't wash my for life!!! ] [ Aiya, I discovered that the man that male god is holding hands with is a big handsome man~ ] [ Their looks match (*/ω＼*) ] [ I keep feeling like something big happened. ] [ This man is a bit familiar. ]</p><div><div></div></div><br/><p><strong>7. Regarding the press conference</strong></p><br/><p>“Journalists and friends who are present today, as well as everyone watching the broadcast, I would like to first announce a piece of good news before the question-asking session begins.\" Xue Ling bowed, then began to speak without releasing Su Xuanyan's hand. </p><br/><p>It was unknown if it was due to his aura, but when he spoke, the reporters below did not dare to say a single word.</p><br/><p>“I’ve already obtained a wedding certificate.\" He held up their joined hands, then said, \"This man and I officially became husbands the day before yesterday. Although it was a little hasty, since everyone has found out, we've reluctantly decided to announce it to the public.\" He waved the little red book he held in his hand. \"I think that everyone should wish me well.\"</p><br/><p>The comments were filled with: [ Oh my god! ] [ I was caught off-guard by the dog food! ] [ I suspect that I'm watching a fake broadcast and looking at a fake male god… ] [∑(っ°Д°;)っ Oh my goddddd!!! Male god got married??? And even got a little red book!!?? ] [ Wuwuwu I originally wanted to say that I could take a screenshot and photoshop myself in next to him. How come he suddenly has a partner… ] [ Hello everyone, the man next to him is fake. In fact, male god married me. ] [ I'm sorry for hiding it from everyone, but I've actually been together with male god for ten years. We were childhood sweethearts and are of one mind… Wuwuwu I can't fool myself and need to cry. ]</p><br/><p>The journalists' expressions seemed to say: [ Oh my god. I'm certain I'm attending a fake press conference. ] [ Can a wedding be announced like this?! ] [ It must be a hoax!! How is this possible!!! ] [ Oh… It really is a big story… ] </p><br/><p><strong>8. Regarding the press conference 2</strong></p><br/><p>“Today's announcement is a temporary one. We will notify the journalists and friends when the real wedding ceremony is being held. Only, who will be invited is up for discussion.\" Su Xuanyan spoke up after Xue Ling. His expression was cold like an iceberg that would never melt in a thousand years. \"We and Tianxuan have the right to pursue and take action against those who spread rumors and speculation over the internet. The newspapers and companies that tried to smear my lover's reputation have already been sent lawyer's letters. I've said more than once that everyone should avoid making a move on anyone from Su Family.\"</p><br/><p>The journalists' faces were momentarily blank, and then some of the more experienced people finally recalled the fear they had felt when they were suppressed by the Su Family.</p><br/><p>They had also heard this sentence at the press conference that announced Su Liunian's identity! The people who had smeared Su Liunian back then had all disappeared from the industry! Quite a few companies also collapsed! </p><br/><p>How terrible! They remembered who this cold-faced man was!!!</p><br/><p>People in the broadcast room also began to recognise Su Xuanyan.</p><br/><p>Although it had been a long time, the majority of people still had pretty good memories.</p><br/><p>[ Now I know what the little film emperor meant when he said they would be a family!! This is his brother-in-law!! ] [ It's already the second time that I've been shocked by Su Family's eldest brother! Ahhhhh I've changed male gods! I want to have monkeys for Big Brother Su! ] [ Above, please wake up. The two of them are a pair. ] [ Ah, Su Family is really powerful… ] [ Has nobody noticed that the Oscar Film Festival trophy went to the Su Family again? How scary. It all belongs to this strange circle. ] </p><br/><p>[ Ah, they looked at each other, and Big Brother Su's entire body turned gentle. ] [ Wuwuwu, I was stuffed with another mouthful of dog food. It's like punishment for being single (〒_〒) ] [ So sweet, Big Brother Su's gaze is so indulgent when he looks at Xuexue! ] [ I've decided to support this pairing! I'm going to draw a book! ] [ … Hey hey hey, you're switching sides a bit too quickly. ]</p><br/><p>Thus, a proper press conference really turned into a wedding announcement event.</p><br/><p>Shen Yue wanted to express that this family was really unbelievable!</p><hr/><br/><p><em>showing off the awesome artwork our wonderful readers drew for the end of WTMT :3 so sad that it’s over, but so, so glad that you guys all enjoyed the read!!!</em></p><blockquote class=\"twitter-tweet\" data-dnt=\"true\" data-width=\"550\"><p lang=\"en\">On behalf of all readers, I thank XIIN and editors alamerysl and Bluebug on their hardwork translating WTMT for us who can't barely chinese.</p><br/><p>The Final Chapter has cometh… (excluding ( ͡° ͜ʖ ͡°)'s)！ (Who Touched My Tail!) </p><br/><p>— ARI ✂(⭕・ㅅ・)🔪 (@xAI_ICE) </p></blockquote><br/><p></p><br/><p><em>the first one is from<strong> ari</strong>, and the second from <strong>it’s lia~</strong></em></p><br/><p></p><div><div></div></div><br/>\n</div>"}