{"title": "Chapter 201", "id": 201, "volume": 3, "url": "http://boxnovel.org/who-touched-my-tail-chapter-201", "volume_title": "Volume 3", "body": "<h1>Chapter 201</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>14.13 – We'll be together forever</strong></p><br/><p><em><span>translator: xiineditors: alamerysl &amp; BlueBug</span></em></p><br/><p><span>Feng Qianyun was a contradictory, yet easy to understand person. Sometimes he was so clean and simple it made others feel distressed, but at other times, he was cruel enough to make others frightened.</span></p><br/><p><span>According to Su Liunian, he was a very willful man. As the Young Master of the demon clan, he grew up with nothing to lose, and had nothing to fear, which was why Feng Qianyun developed such a wanton and bold character. Even after he lost everything, he did not change his character, but rather hid it deeper. </span></p><br/><p><span>Xue Ling was now shooting the parts of the film where Feng Qianyun was still part of the demon clan. It started from when he first appeared, then progressed to a series of main events that occurred in the demon clan which lead to him being misunderstood by the clan. Subsequently one of the demon clans was destroyed, followed by an accident whose aftermath led to the extermination of the entire demon clan faction.</span></p><br/><p><span>All of these were being shot in their current set. </span></p><br/><p><span>Fan Yueze did not follow the film timeline when filming. He had cooperated with Su Liunian and Su Xuanqing for many years, and after testing Xue Ling several times to confirm that Xue Ling had the ability to keep up the pace, he threw himself into his crazy filming mode completely. Everyone in the crew felt as though Fan Yueze was like a little devil who chased them around with a whip, intent on making them finish everything as quickly as possible.</span></p><br/><p><span>It was also because of this that Xue Ling found it shocking when he finished the current scene and prepared to move on to the next, only for Fan Yueze to suddenly tell him to take a break. </span></p><br/><p><span>Had Director Fan's brain broken down?</span></p><br/><p><span>Although the mid-air suspension machines were no longer like the ones of the past that could easily hurt someone if they were suspended in the air for too long, it could still cause muscle ache after extended use. Since the director told him to rest, Xue Ling rubbed his shoulders and prepared to go back to his private rest area and lie down. Unexpectedly, he noticed Su Xuanyan as soon as he turned around. </span></p><br/><p><span>Su Xuanyan was holding something in his hand, and his face carried the same iceberg expression that didn't seem like it would melt for a thousand years. But as soon as Xue Ling looked over, it was like snow melting in the spring, dissolving into water under the gentle warmth. The heated expression in his gaze made Xue Ling choke for a while, and he didn't dare to respond. </span></p><br/><p><span>Su Xuanyan didn't care if he responded or not. Since Fan Yueze had given Xue Ling some time to rest, he naturally followed Xue Ling into his lounge.</span></p><br/><p><span>They were situated amongst some wild, untamed hills. The crew had set up some small sheds in order to facilitate the filming. Since he was the main actor, Fan Yueze had waved his hand and given him a special rest room. Others in the crew did not dare make trouble for him at all, and besides, Xue Ling's acting ability was obvious to everyone, what could anyone even say?</span></p><br/><p><span>After entering the shed, Su Xuanyan’s eyebrows wrinkled. Although it was a privilege, the environment inside was still not very good. There were two interconnected tables in the middle piled high with things, most of which were film props that Xue Ling used. His costumes were put on here, so the props team also placed his things here in order to distinguish them. Other than that, there was only a reclining chair that Xue Ling's assistant had purchased online. It rocked when he sat on it, and Xue Ling often rested on it when he was exhausted. When he wrapped himself up and placed sunglasses on his face, he could still block himself from the rest of the world.</span></p><br/><p><span>“I’ll have some field tents sent to the crew.” High level tents contained a complete set of living facilities, but they were too expensive, and the crew could not afford to use that kind of thing, so they normally wouldn't include them in the budget.</span></p><br/><p><span>When Xue Ling heard that this was the first sentence he said after he came in, he couldn't help laughing and said, \"Your tone makes you sound like you're my sugar daddy, ready to throw thousands of dollars at me.\" His voice carried a slightly jesting tone, which made his odd remark seem less like a flirtatious statement.</span></p><br/><p><span>Although, he was basically flirting.</span></p><br/><p><span>He was also blatantly teasing Su Xuanyan.</span></p><br/><p><span>Su Xuanyan, who was subjected to his teasing, said, “I can spend money on you even if I'm not your sugar daddy. This is a play that the company is investing in, and adding more resources so that the crew can have a higher standard of living is never wrong.\"</span></p><br/><p><span>Xue Ling settled into his recliner, his body shaking slightly as the chair rocked. He was still dressed in his red costume from the play, his face covered with exotic makeup, and his lips were curved up in a wicked smile. It was particularly pleasing to Su Xuanyan's eyes; the kind of 'pleasing' that made people want to strip him down and press him under them on the recliner. \"Does Liunian know that President Su can speak in such a respectable manner? He's also on the same crew, but how come the big President Su isn't concerned about his younger brother?\" </span></p><br/><p><span>Su Xuanyan said, “He no longer requires me to worry about him.\" Ever since Su Liunian and Su Xuanqing got together, Su Xuanqing did not let Su Xuanyan get involved in many things anymore. Although he still cared a lot for his younger brothers, he would be rejected if he tried to interfere, and ultimately given attitude. Even if he didn't interfere, he might still be given attitude. Su Xuanyan had slowly let it go. In any case, Su Xuanqing would make sure that Su Liunian was well taken care of, so he might as well concern himself over his own man instead. \"What? Are you jealous of Liunian?\"</span></p><div><div></div></div><br/><p><span>Xue Ling choked, then sneered. Su Xuanyan's brain pit was really big; why would he be jealous of his younger brother? He was thinking too much! \"What exactly are you doing here!?\"</span></p><br/><p><span>“I came to visit the set.” Knowing that he was a damned tsundere, Su Xuanyan no longer insisted on irritating him. He placed the temperature controlled box on the desk and beckoned for Xue Ling to come over, saying, \"You've lost a lot of weight recently, so I wanted to make you something and help you recover a bit.\" </span></p><br/><p><span>Xue Ling’s emphasis shifted slightly. “We haven’t been in touch lately, right?”</span></p><br/><p><span>After joining the crew, Xue Ling was too tired after coming back from work to do anything but wash up and go straight to sleep. Sometimes, his hair was still wet when he fell asleep, so it was impossible for him to have gotten in touch with Su Xuanyan. He also didn't have this kind of consciousness, because at the end of the day, the two of them were currently only living together, and it was a rather strange and inexplicable type of living together. \"How did you know that I've gotten thinner?\"</span></p><br/><p><span>Su Xuanyan rubbed his head and calmly said, “I've always been watching you, even when you don't realize it. Naturally, I would know that you've lost weight.\"</span></p><br/><p><span>Xue Ling spoke in a bit of a panic, \"Did you send someone to follow me?!\" </span></p><br/><p><span>Su Xuanyan: “…” He didn't know why, but he felt that Xue Ling's focus was a little strange. Why did he have to be caught up on this matter? \"No. I can naturally see you whenever I want to.\" As the world's Boundary Master, Su Xuanyan occasionally had some special privileges. In fact, the photos that Su Liunian had seen in his room were not photos that had been taken by a camera, but rather photos that had been created when Su Xuanyan was peeping. </span></p><br/><p><span>“…” Xue Ling was still sceptical about this matter, but he was given no opportunity to continue asking. He smelled something good, and his nose twitched. He pursed his lips and asked curiously, \"What did you make?\"</span></p><br/><p><span>“Things that you like to eat.” After opening the temperature controlled box, Su Xuanyan pulled out the dishes that had been inside. \"Hurry up and eat. You can rest for a while after eating before going back to continue filming.\"</span></p><br/><p><span>Xue Ling looked at the dishes and then at him, muttering, “It really was simply a visit to see the set…\"</span></p><br/><p><span>There was no logic that said he had to eat alone. Xue Ling asked his assistant to bring a chair for Su Xuanyan, and the two of them ate around the small amount of space they had managed to clear up on the tables. It was quite a novel experience.</span></p><br/><p><span>Su Xuanyan also brought some things for the crew, which Xue Ling arranged for his assistant to bring over for everyone. He wasn't trying to please everyone, but everyone worked together as a team, and it was always good to share with others when there were good things. Su Xuanyan had said it was for him, but his meaning was that it was up to him to see how he wanted to handle it. Xue Ling simply asked his assistant to distribute things evenly and considered the matter done.</span></p><br/><p><span>Their current set was rather remote. After lunch, the two of them walked alongside a mountain road as though taking a walk after dinner. Xue Ling rarely had time to come out and walk around except when he was shooting, so he had a smile on his face, and even his habit of occasionally stabbing Su Xuanyan with his words lessened a bit.</span></p><br/><p><span>They walked side by side along the sparsely populated mountain road. Su Xuanyan asked him, “Do you like filming?”</span></p><br/><p><span>Xue Ling thought about it and shook his head. “I don’t like it.”</span></p><br/><p><span>“Okay.”</span></p><br/><p><span>This conversation was somewhat baffling. Xue Ling waited for a long time for the other party's next sentence before asking curiously, \"Why aren't you asking me why I'm filming even though I don't like it?\" </span></p><br/><p><span>“No need. If you don't like it, then I won't spend too much time thinking in that direction. If you like it, then we can carefully formulate some strategic objectives. We can even grab a slice of the pie from the Yuan Family if you want.\" </span></p><br/><p><span>Xue Ling said, \"What's the point in doing that? Do you want to show off the mountains and rivers that you've obtained for me?\" </span></p><br/><p><span>Su Xuanyan didn't know whether to laugh or cry. He stopped trying to figure out his strange brain circuits and only said, \"Would you agree to be with me just because I took down some mountains and rivers for you?\"</span></p><br/><p><span>“No. We won't be together if we don't like each other. It has nothing to do with the mountains and rivers.\" Xue Ling was very open-minded about the relationship between emotions and other things. There was no way to tell that he had been a little star who barely had enough money to pay off the mortgage just a little while ago. \"What about you? Would you like me just because of those memories?\" </span></p><br/><p><span>It was a lightly spoken sentence, but Su Xuanyan could tell from his words that the other party placed some importance on his words. He spoke rather emotionally, \"I like you, love you, because you're you. Just like you said, what you love is my soul, the person fell in love with you at first sight no matter how many worlds we've travelled through. I'm the same.\" As long as it was him, regardless of whether he had his memories or not, he was still the person that he loved, and would still be his lover. </span></p><div><div></div></div><br/><p><span>Xue Ling was momentarily stunned by his words. He then lowered his head, the tips of his ears red as he fell into a daze for a good while before telling Su Xuanyan, \"I need to become the film emperor so that I can restore my memories. That's why I'm acting even though I'm not that interested in it.\" </span></p><br/><p><span>Su Xuanyan understood what he meant and stepped a little closer. He reached out and rubbed Xue Ling's head, soothing him by saying, \"You don't need to be so anxious. It's okay even if you don't recall the memories. You just need to know that I love you, and that you also love me. We'll be together forever, and that's enough.\"</span></p><br/><p><span>Xue Ling blushed and knocked his hand away, saying unhappily, \"No way. I must get my memories back. What if you're deceiving me?!\"</span></p><br/><p><span>He had never been candid, and Su Xuanyan didn't expect him to change his attitude now. Even if he remembered that they were together, he had no way to do anything to Xue Ling's memories. Their deal would only be effective if Xue Ling recalled everything on his own. By then, Xue Ling would experience a relatively big breakthrough. </span></p><br/><p><span>&lt;Lost Track&gt; stopped broadcasting after a month. Xue Ling had obtained a big wave of new fans while he had been busy filming, and the marketing team for &lt;Asking Heaven&gt; took advantage of his new popularity to start off the wave of publicity for the new film. </span></p><br/><p><span>Su Liunian has always been a surefire success in the box office, so in fact, &lt;Asking Heaven&gt; did not actually need to make use of Xue Ling's current popularity. But Su Liunian liked the bustle and excitement; he was the main actor, scriptwriter, and investor, and he had an incredible amount of sway. He smacked the table and decided to do a photoshoot, so the costume and character settings for &lt;Asking Heaven&gt; that everyone had wanted to see for so long were finally revealed to the public. </span></p><br/><p><span>The original novel was the masterpiece that Su Liunian used to consolidate his position as a god on the World Literature Network. It had exploded and kicked up a ton of attention when it was first serialized, and after news emerged that it would be adapted, with Su Liunian taking on a role as the main actor, the number of fans that followed &lt;Asking Heaven&gt; the film's official Weibo account reached a terrifying number. After the release of the character and makeup photos for the film on the platform, the number of fans and activity directly reached the heavens. </span></p><br/><p><span>Xue Ling finally finished filing the scenes set in the demon clan, and was preparing to film the battlefield sections. He hadn't had a chance to rest before he was told to take a look at Weibo. He opened up his nano-computer and found that his own Weibo account was about to explode. There was no need to mention the fact that his fan count had increased crazily, but even his entire personal space was full of gifts. Just using these gifts to exchange for real money would net him a huge income. </span></p><br/><p><span>Xue Ling opened the official Weibo for the film and saw a series of stills. </span></p><br/><p><span>Throughout the entire week while they were filming, for seven days, the crew had put up the still photos of the character designs at noon every day. Two characters were released every day, and they were all of pivotal characters in the novel. Su Xuanqing had taken on the role of Qing Xi. He had already withdrawn from the filming for two years, but his guest appearance made his fans cry and faint in the comments under the official post. As the protagonists, Xue Ling and Su Liunian's costume shots were released on the last day, which triggered the explosion on Xue Ling's Weibo. </span></p><br/><p><span>Both men’s make-up and costume photos had been taken together. It was also because they had been taken together that people were able to clearly see the relationship between the two characters. Zhu Yifan wore black, while Feng Qianyun wore red. There were a total of nine photos, which showed the fans the different styles that Zhu Yifan and Feng Qianyun had over the different periods in the film.</span></p><br/><p><span>During their youth, one of them had never experienced what it meant to be sad, while the other had been bullied pitifully. At the turning point, one of them had suffered from being hunted to extinction and was shrouded by despair, while the other had just seen the first ray of sunshine in life and began to light up.</span></p><br/><p><span>The contrast between the two figures was obvious right from the start, to the reversal of their statuses in the middle, and then to their close connection to each other towards the end. A mere nine photos showed the ups and downs of the two people throughout their majestic lives.</span></p><br/><p><span>Xue Ling, as an actor who had only ever had a starring role in a single TV drama, had not been suppressed at all by Su Liunian, a young film emperor who had already won several film emperor trophies. Instead, he was able to balance and stand evenly in each photo with Su Liunian, and had his own unique style. Even when he had fallen into dire straits, he was still able to attract much attention.</span></p><br/><p><span>Strength was the best protection in the entertainment circle. Xue Ling looked at the comments where people were praising and begging to marry him, and then silently forwarded Su Liunian's Weibo post.</span></p><br/><p><span>[ Snow Fox: Let’s rewrite history together. // @Su Liunian: Come and join me to witness a miracle~ // Asking Heaven: This is the last day of our character photo releases! Our Young Master and Yifan~~~ I'm not telling you that I've already licked them countless times (*/ω＼*) ]</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}