{"title": "Chapter 211", "id": 211, "volume": 3, "url": "http://boxnovel.org/who-touched-my-tail-chapter-211", "volume_title": "Volume 3", "body": "<h1>Chapter 211</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>NSFW Scene from </strong></p><br/><p><em>translator: xiin</em><em>editors: alamerysl &amp; Kaizer</em></p><br/><p><span>———————— scene from the chapter ————————</span></p><br/><p><span>Xue Ling licked his lips: “I just want to clear up the accounts between us so that we can treat our relationship more simply from today on.\" As he spoke, he reached out to pull off Xi's clothes. </span></p><br/><p><span>Xi’s robe looked very complicated, which always highlighted the abstinence on his face, as though he was completely separate from certain base desires.</span></p><br/><p><span>That was true. After all, when could one ever see a god turn bewildered by **? He had always been a cold, calm god standing high up above. Xue Ling quite liked seeing his face stretched taut. Being able to tease someone like this to the point where they were flushed all over brought Xue Ling great pleasure.</span></p><br/><p><span>In fact, he really enjoyed that there were little differences in the man's temperament in every world. It meant that he could always experience something fresh and new every time he seduced him, and other than the fact that the other party always forgot about him, Xue Ling was exceptionally satisfied about everything else.</span></p><br/><p><span>Of course, this did not make him give up his intention of recalling who this person was. After all, if they had been involved with each other from the beginning, remembering everything was the only way to balance out their relationship. Perhaps this was also why the man had always refused to tell him, and insisted that he learn everything himself. His strength was slowly recovering, and it wouldn't be long before the memories of what existed between them were no longer secret.</span></p><br/><p><span>Xue Ling tugged, thinking that he would be able to remove a layer of Xi's clothing, but unexpectedly, his hand came up empty after his action as Xi's clothing disappeared. He narrowed his eyes, and gave the man beneath his body a profound look. “You know what I want to do?”</span></p><br/><p><span>“You wanted to take off my clothes, right?” The man's response was calm. Despite the fact that the roots of his ears had already turned red, his tone and expression still appeared to be completely under his control. \"The clothing of a god is not something that just anyone can remove.\"</span></p><br/><p><span>Xue Ling made an 'oh' sound, then raised his eyebrows. \"Since it's like that…\" He smirked, \"Then I'll take off my own clothes. Does that count as returning the favor for you?\" </span></p><br/><p><span>He held Xi's hand in his own and brought it with him to pull off the tie holding his sleep robe together. Xue Ling smiled as he slowly, little by little, allowed the robe he was wearing to fall from his shoulders. This action was particularly provocative; he was nude under the robe, and his slender but strong body was slowly exposed to Xi's gaze bit by bit, revealing smooth lines of muscle and attractive white skin bathed in the glow from the flickering fireplace flames. As his robe slowly slid downwards, Xi's breathing turned ragged.</span></p><br/><p><span>Xue Ling slowly withdrew his arms from the sleeves of the robe, and the opened robe draped loosely on his body, half concealing, half revealing his nakedness. He was still seated on Xi's body, and he could feel the reaction from his lower body pressing against him from behind, but Xi was not the least bit shy or embarrassed as he simply watched Xue Ling. Although he was breathing rapidly, he seemed to have no intention to make a move on his own.</span></p><br/><p><span>Xue Ling leaned down, and the two of them were pressed skin to skin. He lowered his voice, and whispered into Xi's ear, \"Then let me teach this god about exactly what it is that you want.\" </span></p><br/><p><span>———————— omitted NSFW scene ————————</span></p><br/><p><span>His voice low, and the warm air from his breathing brushed across Xi's cheek. Xi looked at him and raised his body slightly, trying to kiss his lips, but Xue Ling pushed him back.</span></p><br/><p><span>Xue Ling placed one hand on his shoulder, reminding him to remain lying on the carpet, while his other hand slid slowly down his clavicle. </span></p><br/><p><span>He sat on the man’s body, bowed his head, and kissed the man’s lips. It wasn't a deep kiss, but rather a shallow one that disappeared almost as soon as it arrived. The man tried to keep him there, but Xue Ling shifted away. </span></p><br/><p><span>The tip of Xue Ling's tongue licked his jaw, a moist, warm touch, and he kissed his way down bit by bit, occasionally using his teeth to leave little red marks on Xi's neck. Xue Ling looked at his masterpiece, and the smile on his lips turned even more wicked.</span></p><br/><p><span>His fingers moved faster than his lips, and had already been drawing circles around Xi's navel for a while. He seemed to find their current posture inconvenient and finally stood up.</span></p><br/><p><span>When he stood up, the robe which had half covered and half revealed the key parts, fell off completely, and Xue Ling stood naked in front of Xi, whose gaze slid down his beautiful mermaid line until he was greeted by the sight of his slightly raised sex organ. Xi narrowed his eyes, very good, it seemed that he was not the only one who had been affected by their tossing about. </span></p><div><div></div></div><br/><p><span>Only , there was still some difference between the two. Xi felt like he was about to explode, while Xue Ling's actions were still unhurried as he changed positions, reaching out to wrap a hand around Xi's member that was already standing upright and excited. His hand slid up and down, and his mouth twisted to the side as he said, \"You really can't hold back~\"</span></p><br/><p><span>Xi rose up and flipped Xue Ling over. He didn't know what to do and could only rub against him instinctively. His lower body moved, but his upper body wasn't idle either as he licked his way down Xue Ling's neck and gave it the same treatment Xue Ling had given him before.</span></p><br/><p><span>He bit lightly at the slightly protruding adam's apple, and Xue Ling murmured impatiently, stretching out a foot to kick at him, \"Don't lick randomly~\" His words ended in a slight upward tone and carried a sense of seduction. Although he spoke words of refusal, it seemed more like an invitation to continue.</span></p><br/><p><span>Xi ignored him and continued down. He nibbled at one of the red beans, the tip of his tongue sliding across it as he licked provocatively.</span></p><br/><p><span>Xue Ling's body had already warmed up from his ministrations. Xi's nibbling made the two points at the front of his chest extremely sensitive; his waist arched up slightly as his legs subconsciously wrapped around the man's waist, tilting his chest forward like an offering.</span></p><br/><p><span>His subconscious reaction allowed Xi to understand that he was becoming affected, and he redoubled his efforts on those two points, one left, one right; he used his hands in combination with his mouth, causing the two points to turn swollen before letting him go in satisfaction.</span></p><br/><p><span>Xue Ling gasped slightly. His member had curved a little higher due to Xi's licking and playing just now, and based on their position, the two's lower body part were touching, rubbing against each other as they each tried to seek more pleasure.</span></p><br/><p><span>Xi already had some self-taught skills; he pulled Xue Ling's body forward slightly and lowered his head to take Xue Ling's member that had already begun to leak into his mouth.</span></p><br/><p><span>Xue Ling almost sat up in surprise. Xi's mouth was warm and pleasurable, and although there was a period of adjustment, Xi picked it up quickly. His tongue licked around the pillar, turning Xue Ling's waist soft, and he fell back completely. </span></p><br/><p><span>Xue Ling shielded his eyes slightly with his hands. It felt really pleasurable; he let out a low moan. </span></p><br/><p><span>Xi did not intend to let him feel good by himself. He pulled Xue Ling's hand towards his own body, obviously wanting him to reciprocate. Xue Ling glanced at him, then loosened the legs that were wrapped around Xi's waist and signalled that they should change positions. </span></p><br/><p><span>So, Xi was once again pushed back onto the carpet.</span></p><br/><p><span>Xue Ling wasn't clear on what kind of things were piled up in the system's space, so he casually brought out a jar of lubricant. He couldn't remember which world it had come from, but that didn't matter as long as it was usable.</span></p><br/><p><span>Xi didn't understand what he was doing; he was suffering from having to hold back and the other party wouldn't let him touch. His eyes were a little red from suppressed excitement, but he could only watch as Xue Ling moved in front of him. </span></p><br/><p><span>This was Xue Ling's first time attempting to prepare himself and it was impossible for him to say that he didn't feel ashamed, so he kept his head down and refused to look at Xi. His ears were red, and even his body was covered in pink. </span></p><br/><p><span>He sat on the warm carpet and spread his legs, his manhood stood erect from their messing around, but hadn't been given an opportunity to vent. Xue Ling ignored it, his head bowed as he leaned down and found his own hole with his greased up fingers. </span></p><br/><p><span>The liquid from the front had already flowed to his hole due to his current position, and the small hole opened and closed slightly from the stimulation. Xue Ling learned from what the man had done to him before and gently pressed his finger against the outside, applying some lubricant to the outer rim before inserting his finger into the tiny hole.</span></p><br/><p><span>It still seemed particularly shameful to sit there and prepare himself in front of the man, but Xue Ling was very open-minded tonight. </span></p><br/><p><span>He bit his lips, swayed his waist and limbs, and slowly twisted his fingers in his back entrance to push apart his intestinal wall. Because of the lubricant, his body slowly began to respond to his movements, gradually adjusting to his fingers, contracting and rippling, sending waves of numbing pleasure to Xue Ling's brain.</span></p><br/><p><span>Xi seemed to have already understood what Xue Ling was doing. He didn't remain on one side and watch. Instead, he came forward with slightly brilliant eyes and gave Xue Ling a gentle, comforting kiss. </span></p><div><div></div></div><br/><p><span>He also covered his fingers in lubricant and slipped a finger into Xue Ling's back entrance while he wasn't paying attention. </span></p><br/><p><span>It was the first time for this body and that place was not used to this kind of thing, so he needed to prepare himself properly. The feeling of having a second hand join in was very strange, especially when the fingers belonged to two different people. Xue Ling moaned a bit impatiently before Xi blocked his lips with his own.</span></p><br/><p><span>He somewhat regretfully pulled out his finger and let Xi continue the stretching. By the time he had worked in three fingers, the little hole had already adapted to the feeling of being filled, and wanted to be filled with more, so Xue Ling had Xi lie down once again.</span></p><br/><p><span>Although there was still a difference between Xi's hard manhood and three fingers, the arrow had already been placed on the string and he couldn't stop here; regardless of whether it was Xi or Xue Ling, neither of them had any intention of continuing to hold back.</span></p><br/><p><span>Xue Ling insisted on doing it by himself, so Xi could only lie down and let him move as he liked. He watched as the youth spread open his own legs, grasping his stiff member as he slowly sat down bit by bit. Xi's breathing sped up, and the wild thumping of his heart made his eyes redden again as he forcibly pushed down the urge to toss Xue Ling on his back and do it himself, choosing instead to watch as Xue Ling gradually, bit by bit, used his small back entrance to take in his huge manhood.</span></p><br/><p><span>That scene was too beautiful.</span></p><br/><p><span>Xi’s size was a little too terrible; Xue Ling had judged his size when he first saw it, but seeing it and feeling it was obviously different. Even though he had prepared himself enough, when Xi's hugeness slowly slid inside, it still sapped away his physical strength little by little.</span></p><br/><p><span>That giant manhood rubbed against his intestinal walls, and the feeling of his small hole taking Xi's manhood inside his body was fed straight to his mind. For the first time, Xue Ling perceived that he was being bent into a circle, and would be unable to recover his reason in several lifetimes. He continued sinking down; the thrilling pleasure made him unable to think at all, and when he finally took in all of Xi's member, he felt like he was going to go to heaven. </span></p><br/><p><span>After a while, the two of them adjusted to the feeling, and Xue Ling took a deep breath and began to move. </span></p><br/><p><span>Riding in this position required the person on top to move in order to feel good; Xue Ling tried lifting himself up and pulling away little by little before sinking back down. After the initial attempts, he seemed to have grasped some tricks, and his movements became smoother and smoother.</span></p><br/><p><span>But smooth did not mean that he wasn't wicked; his movements seemed designed to provoke Xi. He rubbed slowly and his face was flushed, but he refused to let Xi reach the peak. </span></p><br/><p><span>Finally, it was Xi who could hold back no longer. He flipped his body and pressed Xue Ling beneath him, raising his waist as he began a frenzied thrusting. It was as though he wanted to retaliate against him; his actions were like a wild storm, stimulating Xue Ling until he was gasping for breath, tears in his eyes as he begged him to go slower.</span></p><br/><p><span>So, Xi taught himself how to linger and tease. Just like how Xue Ling had previously used his movements to tease him, he moved slowly, almost pulling out completely and demanding that Xue Ling say what he wanted to hear before thrusting back in. </span></p><br/><p><span>As soon as he thrust, he would go in to the hilt as though fearing that he couldn't fuck him to death, going all the way inside and forcing a scream out of Xue Ling, whose hands clutched at the carpet under him, his body raised up in a beautiful curve. </span></p><br/><p><span>Once he understood what kind of movements to use, Xi seemed to suddenly have learned exactly what to do. Xue Ling was pushed to the brink once and hadn't come down from the peak before he was turned around. He moved, and the little back entrance naturally followed and twisted; Xi's manhood was still terrifyingly hard and had no intention of cumming at all. Xue Ling's brain was full of self-blame, wondering why he had chosen to provoke Xi like this tonight.</span></p><br/><p><span>He didn't have a chance to recall the original reason before Xi sent him to heaven again; his eyes rolled to the back of his head, and he could only unconsciously follow his own body's up and down movements. He was like a small boat out at sea, following the waves as the sea surged and stormed. He peaked again and again before falling to the bottom of the sea…</span></p><br/><p><span>His gasps, moans, and pleas were all blocked from the outside by the boundary that Xi had set up. Light from the fire flickered, landing on the two naked bodies entwined in front of the fireplace and illuminating the beautiful scene inside the room.~</span></p><br/><p></p><div><div></div></div><br/>\n</div>"}