{"title": "Chapter 1", "id": 1, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-1", "volume_title": "Volume 1", "body": "<h1>Chapter 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 1</p><br/><p>TL: LightNovelCafe</p><br/><p>The birth of a first child usually brings parents boundless joy. This is especially the case in Korean society where the birth of a son gives the mother reassurance and the father a little more happiness than a daughter does. A son means being able to pass on their lineage, and words are insufficient to express how the grandfather and grandmother feel from a grandchild.</p><br/><p>Now if a particularly handsome baby is born – why the parents will jump up and down with joy.</p><br/><p>However, there are the few parents who think that their first child’s birth signifies nothing short of a disaster.</p><br/><p>This was the case with the immature teen who forgot the gravity of pregnancy and the importance of contraceptives. When she finally found out about her pregnancy, unable to tell anyone, she trembled in fear and lost the chance for an abortion; ultimately becoming a single mother.</p><br/><p>Of course not all single mothers are fools like this young woman. I am just telling you what happened in this one isolated incident.</p><br/><p>The only things Jang Jun Hyuk received from his mother being a paper with his date of birth and his name, he was abandoned at an orphanage in Daegu before even having once tasting his mother’s milk.</p><br/><p>A nun of the Catholic foundation behind the orphanage looked after baby Jang Jun Hyuk, who rarely cried and was as cute as a kitten, with more love and care than his biological mother ever did or could.</p><br/><p>Though it was unfortunate that he was abandoned by his mother, he was blessed with the orphanage’s excellent facilities and the loving care of its nuns.</p><br/><p>While it was impossible to know when he was a newborn baby, as he reached an age when he started to toddle and could manage some sort of expression, it was evident that this endearing child was different from the other children.</p><br/><p>At an age when he should have been playing with dolls or toys, he spent his days touching the mobile dangling from the ceiling. When he reached the age when he should have been playing with his friends, he spent all day listening to hymns on his CD player or to the sound of wind coming from the big tree standing in the yard of the orphanage.</p><br/><p>“Jun Hyuk. Let’s play with your brothers. Why are you always alone?” said the head sister almost as if in reprimand.</p><br/><p>“I need to be alone to hear the sounds, mom.”</p><br/><p>“Sounds?”</p><br/><p>“Yes. The sounds.”</p><br/><p>“What sounds? The hymns?”</p><br/><p>“The hymns are no longer any fun.”</p><br/><p>“So what are fun sounds?”</p><br/><p>“The sound of trees, the wind, and of my friends playing. Um… I also like the sound of eating. Ha ha.”</p><br/><p>It meant that he knew how to train his ears to sounds. The sister suspected that Jun Hyuk may have received a gift from God and wanted to ask him more questions to test this, but was unable to continue due to his following words.</p><br/><p>“The best sound is… the sound of crying while sleeping. When one person cries, the older or younger siblings all start to cry as well. The sound of everyone crying together is better than the songs of the cathedral choir. It’s different every single day.”</p><br/><p>The head sister realized what Jun Hyuk’s real problem was. Jun Hyuk had never once cried for the parents whose faces he didn’t know as the other children had. And she left it at that.</p><br/>\n</div>"}