{"title": "Chapter 11", "id": 11, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-11", "volume_title": "Volume 1", "body": "<h1>Chapter 11</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 11</p><br/><p>TL: LightNovelCafe</p><br/><p>“Boss, the places where kids like that go are obvious. Internet cafes, comic book cafes, or saunas. But if he’s as dirty as you say he was, he probably wouldn’t go to the sauna. Those kinds of kids also hang around the area with the prep schools. That way, they can mug middle school or elementary school students.”</p><br/><p>All he had to go on was information from his young employee. Yoon Kwang Hun took his employee’s word and walked around the prep school area.</p><br/><p>After wandering the area for a few days, he heard girls cry out in the direction of the main street. Teenagers were running from where the screaming had sounded.</p><br/><p>He spied the long hair of a boy running away. Yoon Kwang Hun was sure that it was Jun Hyuk and ran after him.</p><br/><p>***</p><br/><p>“Get up kid. You didn’t even get hurt that badly. Are you making a big deal out of a few scratches on your back?”</p><br/><p>“Oh, mister.”</p><br/><p>When Jun Hyuk opened his eyes, he found himself lying in an unfamiliar room. He was disorientated at first, but quickly recalled yesterday’s events.</p><br/><p>He remembered Yoon Kwang Hun yelling at the kids beating him to stop, but they both ended up getting hit. If it can be considered fortunate, it was fortunate that the beating did not last long because an adult had interfered.</p><br/><p>“Even if you break a bone at your age, if you eat well…..”</p><br/><p>Yoon Kwang Hun quickly stopped. Wasn’t he like a stray cat, unable to eat properly? He couldn’t talk about food to a child like that.</p><br/><p>“Anyway, sleep a bit more. We’ll talk later.”</p><br/><p>As he was closing the door to the tiny room, he stopped and left it wide open instead. Music accented with a compelling yet rough voice spilled through the door like sunshine coming through a window.</p><br/><p>“Listen to the music carefully. Listen to how long it is.”</p><br/><p>“What is this?”</p><br/><p>“Lynyrd Skynyrd. This is probably the first time you’re hearing it.”</p><br/>\n</div>"}