{"title": "Chapter 16", "id": 16, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-16", "volume_title": "Volume 1", "body": "<h1>Chapter 16</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 16</p><br/><p>TL: LightNovelCafe</p><br/><p>The only thing Yoon Kwang Hun taught now was english. His goal was for there to be no difficulty in Jun Hyuk’s ability to communicate in english. In exchange, Jun Hyuk paid Yoon Kwang Hun with something much greater everyday.</p><br/><p>He had the privilege to be the first to appreciate the new music that he made and the first to listen to his piano and guitar performances. Jun Hyuk played rock music for him when he was drinking beer and jazz when he was drinking wine.</p><br/><p>Jun Hyuk started listening to other maestros’ music less and less. Instead, he spent more time making his own music.</p><br/><p>Also, it had already been a year since Yoon Kwang Hun changed his business from a place for washed out pop singers performing live to a music cafe. This was the cafe he had originally envisioned. One with music, coffee, and wine. And finally the profits slowly started rolling in. But that was also on due to Jun Hyuk.</p><br/><p>Jun Hyuk played the piano for one hour every day at the cafe and the customers’ reactions were better than expected. He was not performing played out classical music, but remade pop songs that the customers liked. Not only that, but he improvised the music to the customers’ requests of ballads as jazz, trot, and blues.</p><br/><p>When rumors spread that there was a young and handsome pianist performing at the cafe, the customer base that used to be women in their 40s became women in their 30s, after which even young customers in their 20s started to come.</p><br/><p>Jun Hyuk looked like an adult over 20 with his tall height and long curly hair. The customers sighed in regret when they were told that he was only 17 years old, but they remained as regular patrons.</p><br/><p>Jun Hyuk’s name started to float around the internet as the Kang Dong Won of Misari.</p><br/><p>[TN]: Kang Dong Won – Famous korean actor</p><br/><p>Once customers started uploading videos of Jun Hyuk playing the piano on blogs and YouTube, even high school girls started to come to the cafe and Yoon Kwang Hun was forced to put up a sign forbidding entry to minors.</p><br/><p>As the views on the videos went up, more customers came to visit the cafe, and entertainment agencies eventually started to approach them. They didn’t care for Jun Hyuk’s piano playing. They had come to see his long arms and legs, and his small and handsome face – something that would sell to the general public.</p><br/><p>“Sir, I would like to introduce myself.”</p><br/><p>The same words always followed after the business cards.</p><br/><p>“Can I meet the pianist?”</p><br/><p>When the people from the entertainment agencies saw Jun Hyuk in his t-shirt and jeans, they burst out in admiration.</p><br/><p>“Wow… Even his look is enough.”</p><br/><p>“Goodness. He would look so cool next to Kang Dong Won.”</p><br/><p>Jun Hyuk’s height was not noticeable in the videos. He had gone through a growth spurt over the past two years – aided by the fact that Yoon Kwang Hun always made sure that he was fed. It was obvious that they were interested in Jun Hyuk.</p><br/><p>“There’s an idol band that our company is trying to debut. We were thinking of a 5-member group and if Jun Hyuk were to join, it would be a huge success. He does look a little older though.”</p><br/><p>“Excuse me. He’s still a minor.”</p><br/><p>“A minor? How old is he?”</p><br/><p>“17.”</p><br/><p>“Really? He looks like he could be 20. Even better. For idol singers these days, 20 is a bit old.”</p><br/><p>Entertainment agencies only liked the children to be younger because the 20 year olds were not unconditionally obedient.</p><br/><p>“Okay, so what genre is that new group you’re making? Hip hop? Electronic?”</p><br/><p>“Mostly hip hop, but they do a little bit of everything. If he joins, I can see them singing a ballad with him on the piano.”</p><br/><p>These guys did not have an ear for music. They might as well be deaf. They were spewing garbage after hearing the instrumental that Jun Hyuk had just improvised of Kim Kwang Suk’s song.</p><br/><p>The nerve of them to suggest being a pretty idol singer to a young genius who is to be lauded as the Beethoven or Mozart of the 21st century.</p><br/><p>“But there is one problem.”</p><br/><p>“Yes. What is it?”</p><br/><p>“As you can see, our Jun Hyuk’s piano ability is at a high level, but he cannot sing.”</p><br/><p>“Gosh, it would be a scam if he could sing with that face. Don’t worry about it. There is already a main vocal, so there won’t be any problem.”</p><br/><p>“I understand. I’ll think about it and let you know.”</p><br/><p>Yoon Kwang Hun mollified the agency employees as though they were children. He did not reject them on the spot for fear they would come back and bother him. Since then, a few more entertainment agencies came with the same praises and promises of stardom and left.</p><br/><p>There were entertainment agencies at different levels of course. For the past few days, it seemed as though there had been a new regular but a man most likely in his thirties came looking for Yoon Kwang Hun.</p><br/><p>“Hello. I am Choi Jang Hyuk of SN Entertainment.”</p><br/><p>The title on his business card was that of Producer.</p><br/><p>“I have been listening to this boy’s piano performances for the past few days. Is he by chance receiving a formal education?”</p><br/><p>“No, he is self-taught. He is receiving lessons these days to learn the basics of piano, though.”</p><br/><p>“That’s impressive. I mean, that he can improvise any song regardless of its genre.”</p><br/><p>Choi Jang Hyuk could not hide his surprise, but Yoon Kwang Hun was more surprised by the SN written on the business card.</p><br/><p>“If you say SN, do you mean the SN that we know?”</p><br/><p>“Ha ha. Yes. There’s only one SN.”</p><br/><p>[TN]: SN Entertainment is one of the biggest entertainment companies in korea.</p><br/><p>“Are you trying to make Jun Hyuk an idol singer?”</p><br/><p>“No. I haven’t seen him sing… In our company, singing ability is the minimum requirement. If he hasn’t received formal training, that means he’s 100% talent… With this talent, he’s a genius.”</p><br/><p>It wasn’t an exaggeration to say that it was the best in the country. It was a company with someone who could recognize talent at first glance. Only, they did not know the depth of that talent.</p><br/><p>“So the thing is, we would like to train Jun Hyuk. What do you think?”</p><br/><p>“Train him?”</p><br/><p>“Yes. Actually, idol singers and girl bands are not the real mainstay of our company. It’s because we have a lot of distinguished composers, arrangers, and producers. We would like to train Jun Hyuk as a producer. Of course we’ll teach him composition as well.”</p><br/><p>Who are they saying is teaching who? What expression would they have if they saw the songs Jun Hyuk had written so far? He wanted to show Jun Hyuk’s symphonies to these composers who wrote 3 minute hook songs filled with sound effects created by machines.</p><br/><p>“Thank you for the thought, but I would like to let him live freely for now. He has plenty of time to learn as he’s only 17 years old.”</p><br/><p>“17? Is that true? I thought he was at least 20.”</p><br/><p>“I know. He’s grown so much over the last two years.”</p><br/><p>SN Producer Choi Jang Hyuk seemed lost in his thoughts for a moment and did not speak. Once he opened his mouth, his words were entirely unforeseen.</p><br/><p>“What if we do this? We’ll write a recommendation so Jun Hyuk can enroll in university for music. Of course we’ll pay his full tuition. He can come work for our company after.”</p><br/><p>A long-term investment? The prejudices Yoon Kwang Hun had held against entertainment agencies all came crashing down. He had perceived them as people who took young children who were attractive and forced them to make money.</p><br/><p>“Thank you for the offer. I don’t want to decide Jun Hyuk’s future just yet. I plan on letting him live freely. If our fates cross again, I’m sure something will work out.”</p><br/><p>Most parents in Korea would be so grateful they would be speechless if SN offered to train their child, but this man was very different. Choi Jang Hyuk had thought of Yoon Kwang Hun as a simple cafe owner, but he was surprised by the unexpected reaction he was receiving.</p><br/><p>“I see. That’s a good idea. Anyway, I’ll leave my business card with you. Please contact me if you need me. I’ll come at any time.”</p><br/><p>What will Jun Hyun’s fate be??</p><br/>\n</div>"}