{"title": "Chapter 33", "id": 33, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-33", "volume_title": "Volume 1", "body": "<h1>Chapter 33</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 33</p><br/><p>TL: LightNovelCafe</p><br/><p>“There there. Let’s hurry up and hear it.”</p><br/><p>The song that the staff had thrown at them was ‘Start,’ released by Park Ki Young in 1998. The singer and title were unfamiliar, but most of it was a famous song. It was Park Ki Young’s hit song so well-known that anyone who heard the climax would say, ‘Oh, this song’.</p><br/><p>Jun Hyuk heard the song after he read over the music score. It was not bad for a ballad. The arrangement was not bad either. The only problem was that even though five people each with their own talents had come together, the guide was done as if one person was singing the ballad. It was not appropriate for five people.</p><br/><p>“Let’s talk about how we’re going to separate the parts.”</p><br/><p>Excluding Jun Hyuk, the four must have thought that they could not have the spotlight taken from them, so they argued and laid out their opinions.</p><br/><p>“The amount of time each person gets needs to be similar since it needs to be fair and… we need to pick the parts that we all sing together.”</p><br/><p>“I looked at last season and when people got greedy and messed up the song, no matter how well any one person sang, everyone was eliminated.”</p><br/><p>“But we’re rap… I’m going to go crazy! This.”</p><br/><p>Excluding Jun Hyuk, everyone’s faces were dark with a mix of greed and fear, tension and heaviness. Jun Hyuk was suspicious as to whether they had listened to the song properly or not.</p><br/><p>Though it is said that the delicate voice is expressing a woman’s one-sided love for a man, but starting from the second half, with the intense guitar sound and short guitar solo, it was a rock ballad.</p><br/><p>If an arrangement is not better than the original, it is bound to receive severe criticism. With a bad arrangement, unless it is covered with singing skills superior to that of the original song, it is inevitable that they would receive appraisal that they ruined the song… but everyone was only worried about their own parts and not the music.</p><br/><p>The oldest member of Jun Hyuk’s group who looked to be in his late twenties seemed to be trying to take lead of the group and spoke,</p><br/><p>“There there. Let’s memorize the lyrics for each of our parts first. It’s over the moment we start tripping up on stage because we can’t remember the lyrics.”</p><br/><p>While everyone plugged the MP3 earphones in their ears, Jun Hyuk slowly left the area. He sat in a corner of the auditorium and looked around the room. It was full of more than 100 young people memorizing their songs or practicing with tension and anxiety.</p><br/><p>Jun Hyuk held his guitar and started to flick the strings. He was not playing with a chord or picking a scale. He was making random sounds like a child touching a guitar for the first time.</p><br/><p>The VJ chasing Jun Hyuk spoke while he was holding his camera,</p><br/><p>“What are you doing right now?”</p><br/><p>“Oh, this bustle is fun. I’m thinking about to expressing it.”</p><br/><p>“Can you be spending your time like this? You’re not going to practice your mission song? You said earlier that you would be playing the accompaniment…..”</p><br/><p>“It’s okay. I memorized all of the arranged score.”</p><br/><p>“What? Already? You already knew the mission song?”</p><br/><p>“No. We saw the score earlier.”</p><br/><p>“You can memorize it after looking once?”</p><br/><p>“Yes.”</p><br/><p>The VJ put down the camera and turned the switch off.</p><br/><p>“Really? You can memorize it after seeing it once?”</p><br/><p>“Yes. 3 minutes and 24 seconds. It’s short.”</p><br/><p>The song was released in the year Jun Hyuk was born. It did not seem like he was lying that he did not know the song because it was as old as he was.</p><br/><p>“How about the song that was arranged? Did you memorize all of that as well?”</p><br/><p>“Yes. That was even easier.”</p><br/><p>“You don’t like the arrangement?”</p><br/><p>“No. It was garbage ruining the original song.”</p><br/><p>How could he say it was garbage? The music director and arrangers participating in this show were veterans with at least 10 years of experience in this field. Professionals like that did not make garbage.</p><br/><p>“Why is it garbage?”</p><br/><p>“Music needs to be arranged relative to the instrument… no, to the standard of the singer’s tone. They made the song before they knew who would be singing it. The song that’s been arranged now needs to be ripped apart and fixed at the least.”</p><br/><p>The VJ thought what Jun Hyuk was saying made sense.</p><br/><p>“Then is there something different that you’re thinking of?”</p><br/><p>“No. How can I when I don’t know the teammates who will be singing? I haven’t heard them either. I need to know each of their tones and strong points to arrange it.”</p><br/><p>“Then why don’t you tell your teammates you should edit the song again?”</p><br/><p>“Oh, I don’t know. It’s a bother. And why do you keep following me?”</p><br/><p>He had stopped making a song based on the bustling of the room because of the VJ. The feeling of inconvenience turned into annoyance, so Jun Hyuk went back to his teammates.</p><br/><p>They must not have been able to memorize the lyrics yet because they were still concentrating on listening to the music. The rapper who had found Jun Hyuk went over to him and spoke discreetly,</p><br/><p>“Do you by chance have any good ideas?”</p><br/><p>“No, I don’t have any.”</p><br/><p>“Hey… why are you being like this? Last time, you made a great song after just overhearing us rap.”</p><br/><p>“I heard you both rap that time. That was possible because I knew the singers’ tonal quality. I don’t know it now.”</p><br/><p>“Does that mean you’ll be able to arrange the song after you hear us sing?”</p><br/><p>“Yes.”</p><br/><p>“Hold on.”</p><br/><p>The two rappers went to the other three people who were memorizing their lyrics,</p><br/><p>“Let’s ask that person to make the guide for our song.”</p><br/><p>“He’s the person who only played the guitar for the area preliminaries, right?”</p><br/><p>The girl in her early twenties who had raised her hand along with Jun Hyuk to indicate that she could read music scores had a slightly hopeful expression.</p><br/><p>“Yes, his skill is no joke. Even at the area preliminaries, he heard our rap once and fixed the entire thing. We were able to pass that round because of that as well.”</p><br/><p>“Why are we trying to do another edit when the arrangement is already here?”</p><br/><p>The man in his late twenties who called himself the team leader wrinkled his forehead. It seemed that he thought that his position as leader would be in danger if this young kid did the arrangement and song guide.</p><br/><p>“So you’re saying… that kid should give out the parts and complement the song.”</p><br/><p>“Yes. Let’s just hear him out first.”</p><br/><p>When everyone decided to try listening to Jun Hyuk’s guide, the man in his late twenties could no longer oppose.</p><br/><p>“Excuse me, Mr. Jun Hyuk. We’ll sing the mission song, so will you try arranging it?”</p><br/><p>“Sure. Should we hear each person’s singing first? Go around and sing the song. From the part ‘I want to tell you’.”</p><br/><p>Jun Hyuk was telling them to sing the climax of the song.</p><br/><p>“Oh, the two rappers don’t need to sing. If you listen to the song well, the guitar solo comes in three phrases and that’s 12 seconds. You two rap then. 3 phrases. The content is up to you. Since the song is about a woman’s one-sided love, I was thinking that maybe it could be about the man’s thoughts as the object of this one-sided love.”</p><br/><p>Jun Hyuk listened to the singing of the remaining three people: the arrogant man in his late twenties, the girl in her early twenties who could read music scores, and a boy who looked to be in his teens but sat without speaking as if he were an old man. Jun Hyuk was silent in thought before he began to speak,</p><br/><p>“I’ll play just the instrumental according to the score. You don’t need to sing. But mister.”</p><br/><p>The person Jun Hyuk was calling mister was the man in his late twenties.</p><br/><p>“Me? What?”</p><br/><p>“Mister, you’ll mess everything up if you keep trying to show off how high you can go.”</p><br/><p>“What?”</p><br/><p>“I’m saying that we’re just instruments. Do instruments show off how high they can go? We’re just five instruments playing one song together. What’s important is the overall harmony. It doesn’t sound good if you force your high notes and try to show off.”</p><br/><p>“Are you trying to teach me right now?”</p><br/><p>His face had already turned red. How could a kid like this be criticizing him?</p><br/><p>“Your tone kind of sucks. No matter how high you try to go with a bad voice, it just becomes noise.”</p><br/><p>“This bratty asshole!”</p><br/><p>As soon as a fist came at the red face, the two rappers acted quickly and held it back.</p><br/><p>“Stop it. What are you doing? The cameras are filming everything.”</p><br/><p>The VJ was laughing with a bright face as though he were having fun. Discord between members was a spectacle for the viewers. A fist came towards the camera and hit the man shaking with anger.</p><br/><p>“This asshole must have a rag in his mouth. He’s cursing when he doesn’t even know me!”</p><br/><p>The owner of the fist was none other than Jun Hyuk.</p><br/><p>Not just Jun Hyuk’s team members, but others nearby had to hold Jun Hyuk back as he kicked at the man on the floor. Only the VJ looked as though he had been given a prize as he held the camera. The recording might not be suitable for the broadcast, but it was a VJ’s job to catch such a dramatic moment.</p><br/>\n</div>"}