{"title": "Chapter 38", "id": 38, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-38", "volume_title": "Volume 1", "body": "<h1>Chapter 38</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 38</p><br/><p>TL: LightNovelCafe</p><br/><p>“Okay, now two teams are going to get together to form one group. Everyone listen well to see who your partner will be.”</p><br/><p>The partners were revealed one by one and the luckiest in the 3rd round team selection was not one person, but four.</p><br/><p>“The next is the only band that passed the 2nd round, ‘Steel Blade’ and their partner will be… Jang Jun Hyuk.”</p><br/><p>The Steel Blade members did not show it, but they were overjoyed that they had gotten one step closer to the top 10. What luck!</p><br/><p>“We’ll reveal the mission song. It’s Jewelry’s Super Star.”</p><br/><p>The song released in 2005 was the first that got Jewelry 1st place. It made the other participants jealous. It was established that it was advantageous to have a fun song.</p><br/><p>Once all of the partners and mission songs were revealed, everyone hid their claws and started to greet their partners.</p><br/><p>“It’s nice to meet you. I’m the vocal, Han Ki Su. Oh, don’t punch me because I’m not using formal speech with you. You can use informal speech too. Ha ha.”</p><br/><p>Jun Hyuk was uncomfortable with the band member who was acting more friendly than was necessary.</p><br/><p>“But do you know this song?”</p><br/><p>“The mission song? Yeah. You don’t know it?”</p><br/><p>“No. I don’t have CDs of idol songs.”</p><br/><p>“Then let’s hear the song first. We’ve heard it, but we don’t really remember it either.”</p><br/><p>Everyone listened to the MP3 player. After they listened to the whole song, the members of Steel Blade sighed in relief. It did not seem like there would be any problem changing the song into band music because the song itself was very light.</p><br/><p>“What do you think?”</p><br/><p>“It’s fun.”</p><br/><p>“Right? We got lucky. It won’t be hard to change it to metal.”</p><br/><p>“I heard you’re a producing genius. Do you have any ideas?”</p><br/><p>The judges’ evaluation from the 5-person mission had become a hot topic between the contestants. A producing genius worthy of the highest praise. Jun Hyuk who made great music without exposing himself could make this into a heavy metal song.</p><br/><p>The band leader who was also the vocal had high expectations, but Jun Hyuk made all of those expectations come crashing down.</p><br/><p>“Do as you please since we’ll be dropped anyway. I’ll go along with whatever you want to do.”</p><br/><p>“What?”</p><br/><p>“We can’t go to the top 10 anyway.”</p><br/><p>Jun Hyuk’s words that came from out of the blue hit his head hard, “It can’t be. Do you know something? Is it already decided? Already?</p><br/><p>“No. I don’t know that but you guys aren’t that good. You just fit in a band to broaden the assortment. There’s no way you don’t know you guys aren’t good, is there?”</p><br/><p>They had not anticipated that this young kid would be saying that they would be eliminated because of a shortage of talent. Even the judges had given them compliments on the original song they presented in the area preliminaries. In round 1 and 2, they had received the evaluation that they were a band with feeling.</p><br/><p>But he is saying that their skill is poor?</p><br/><p>Jun Hyuk kept speaking in a sarcastic tone without paying attention to the members shaking in anger.</p><br/><p>“You sir on the drums, say something. Don’t you know?”</p><br/><p>The vocal, Han Ki Su spoke to Jun Hyuk when he suddenly sought agreement from the dummer,</p><br/><p>“Is that right? We’re not that good? Let’s hear it then. You speak as the genius producer. What’s so bad?”</p><br/><p>“If you force the high notes and barely hit them, the listeners are the ones who are uncomfortable. A vocalist is someone who can hit the high notes easily. ‘Soot’ catches on to it. Soot! A person who uses the voice instrument freely and well. That’s what we call a vocalist but you have a hard time with the high notes and your voice itself is lacking strength… It’s like you’re just imitating a rock band.”</p><br/><p>“Hey! It just sounds like that because my voice is thin.”</p><br/><p>“What are you talking about? Being thick and thin is an issue of tone. That has nothing to do with strength. Not all metal band vocals are Ronnie James Dio. There’s Klaus Meine too.”</p><br/><p>Han Ki Su’s face felt heated as the weaknesses he was aware of were being bothered.</p><br/><p>“Fine. Say that’s true for me. Then the guitar?”</p><br/><p>“Guitars aren’t there just to play do-re-mi-fa-so-la-ti-do. It’s about expressiveness. Ah, you asshole.”</p><br/><p>While everyone was confused by the swearing that had come out of nowhere, Jun Hyuk was looking at the guitarist.</p><br/><p>“Express this with the guitar. ‘Ah, you asshole.’ Or um… ‘Please excuse me this one time.’ Something like that is okay too. Scale, technique… these things aren’t important, but you don’t know that.”</p><br/><p>Jun Hyuk went over each member one by one as though he were a judge.</p><br/><p>“Can you play the bass all day with one beat? Without a metronome? If you can’t do that, you haven’t practiced enough. Or you can’t keep a beat.”</p><br/><p>They had not heard such severe criticism since they started performing in Hongdae. This assessment was the same as saying that they were beginners.</p><br/><p>They thought that he was going to tear the drummer apart next, but he did not.</p><br/><p>“You asked me for an idea on the arrangement, right? I already finished the edit. It’s just that you guys probably won’t like it.”</p><br/><p>He had only heard it once. After that, he had been evaluating the band members’ skills. When is he saying he finished arranging the song?</p><br/><p>“How did you do it?”</p><br/><p>At the words that he finished the arrangement, their curiosity overcame their indignation.</p><br/><p>“Drum instrumental. The drum is the main. Everyone else is slight and the vocal can be taken out completely. The best thing this band can do is to support the drum.”</p><br/><p>The VJ marking Jun Hyuk had a vague idea of the music he was trying to pursue. This arrogant young genius only thought about music. He only focused on finding the best of any song. It was certain that he never had the intentions of becoming a star.</p><br/><p>Jun Hyuk does not care about things like hitting high notes as the public likes or familiarity that is easy to listen to. He only thinks about the music.</p><br/><p>Though it is an old song, it is still by a girl group. He wants to change that into a drum instrumental?</p><br/><p>When the drummer heard the words drum instrumental, he raised his hand in surprise,</p><br/><p>“No. What do you mean a drum instrumental? It’ll never work out. Let’s just go with the usual rock. It’s easy to change this song to a rock version.”</p><br/><p>Jun Hyuk ruined the cold atmosphere that the drummer was trying to ease again.</p><br/><p>“Oy. Now I know. Sir, you guys are in this state now because you keep giving in. The person with the most talent should have dragged everyone along. The vocal and guitarist don’t know that they’re not that good because you cover for their singing and guitar.”</p><br/><p>Eventually, the band leader and vocal left the practice room and the guitarist and bassist followed him to calm him down.</p><br/><p>Producer Kim Ki Sik checked what the VJ had filmed since they were in a state where all practice was suspended, and he could not stop laughing. Jang Jun Hyuk said and acted in ways that always made news.</p><br/><p>The discord between Jang Jun Hyuk and the other participants would undoubtedly become the best in increasing tension on the program.</p><br/>\n</div>"}