{"title": "Chapter 34", "id": 34, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-34", "volume_title": "Volume 1", "body": "<h1>Chapter 34</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 34</p><br/><p>TL: LightNovelCafe</p><br/><p>When the VJ showed Producer Kim Ki Sik the video of Jun Hyuk fighting, he laughed and questioned him on the situation.</p><br/><p>“What are the kids doing now?”</p><br/><p>“We barely got Jun Hyuk to stay after he said that he was going to quit everything and leave. And the kid who was hit is huffing about calling the police.”</p><br/><p>“How did you get Jun Hyuk to stay? That kid doesn’t listen to anyone.”</p><br/><p>“The young writer who marked Jun Hyuk did it. They’ve gotten pretty friendly.”</p><br/><p>“Bring the kid who got hit here.”</p><br/><p>The participant who had gotten hit by Jun Hyuk started his interview with Producer Kim Ki Sik while massaging his face with ice.</p><br/><p>“Do what you want,”</p><br/><p>He understood what Producer Kim’s frosty tone meant. He was giving him pressure. It meant that he needed to pack his bags and leave the condo if he did not keep his mouth shut.</p><br/><p>“No, that’s not it. It’s okay. I’m not a kid or anything…..”</p><br/><p>“Really? Then the company’s legal team is going to go to you with a piece of paper. Sign it.”</p><br/><p>“What? What paper…?”</p><br/><p>“What do you mean what paper? It’s a document saying you won’t make a problem out of today’s events. Got it?”</p><br/><p>“Yes.”</p><br/><p>“You can go. Also, I’ll change your team instead. Just know that we’ll be doing that.”</p><br/><p>The participants of ‘Tomorrow’s Star’ were all expendable to the absolute target of raising viewer ratings. Once expendable, they needed to listen to the producer in order to stay in the program at all costs.</p><br/><p>***</p><br/><p>The expendable person who had been switched into Jun Hyuk’s team was someone whose skill was to the degree that he had heard he sang well at his neighborhood karaoke.</p><br/><p>Producer Kim Ki Sik who was in charge of the show started his plan to get Jun Hyuk in the top 10.</p><br/><p>Two VJs tight with tension stood in front of Producer Kim Ki Sik and were listening to his orders.</p><br/><p>“Listen well. You just keep concentrating on Jun Hyuk and film him. And you… you’ve been here longer than he has, right?”</p><br/><p>“Yes.”</p><br/><p>“Okay then. Jun Hyuk doesn’t sing, right? Instead, you have to make him the conductor for the 5-person team mission. He has to be the maestro who does everything from arranging to directing parts for the members. You understand what I’m saying, right?”</p><br/><p>“Ah, I get what you’re saying.”</p><br/><p>“Okay. That’s Jun Hyuk’s theme for this week’s 5-person team mission. I’m putting it in your hands.”</p><br/><p>“Don’t worry about it. The two of us will bring back lots of good shots.”</p><br/><p>They finished preparing the materials to make Jun Hyuk a maestro. Now they needed to convince the viewers that Jun Hyuk was qualified to be in the top 10 even without singing.</p><br/><p>The people to persuade the viewers were the judges themselves.</p><br/><p>Before Jun Hyuk’s team performed as the fourth to be on stage, Producer Kim and the main judges started their conference on the issue.</p><br/><p>The main judges of Season 5 were slightly experimental with the addition of two new members.</p><br/><p>Along with Lee Sung Chul and the legendary singer and songwriter Yoon Jung Su, singer of 25 years Lee Eun Jin who had been given the nickname ‘Diva of the Night Sky’ because she did not make appearances in public or on broadcast joined the panel.</p><br/><p>Last was Son Jin Young from JYS, one of Korea’s top 3 agencies which produced countless girl groups.</p><br/><p>“Producer Kim, why are you like this for this season? You’re openly pushing for this kid.”</p><br/><p>“Ha ha. Excuse me just once. Aren’t I a person who goes back and forth between heaven and hell based on the viewer ratings?”</p><br/><p>“So? You’re saying that kid will guarantee viewer ratings?”</p><br/><p>“Sung Chul. Who are you talking about?”</p><br/><p>Yoon Jung Su who had not seen Jun Hyuk during the area preliminaries was asking.</p><br/><p>“There’s a kid. A kid who gives me headaches. Oh right, he’s the type you would like.”</p><br/><p>Yoon Jung Su’s eyes widened as he was flipping through the files containing each person’s history and special characteristics.</p><br/><p>“What is this? He got all the way here just by playing the guitar and not singing? And… what? He’s an orphan?”</p><br/><p>“Yeah. Other than not singing, he’s the best. His story’s good, he’s better looking than Kang Dong Won, the guitar performance is great, he’s probably a genius in arranging, and his song analysis is outstanding.”</p><br/><p>“Seems like he’ll get all of the women’s texting votes. He could even get to the top 5 on votes alone.”</p><br/><p>As they discussed Jun Hyuk, Producer Kim Ki Sik said the final defining words,</p><br/><p>“This kid is just a star. He has the talent and looks to cover a song. On top of that, he has an unstoppable nature. You know well since you’re all stars. One of those people who is bound to become news whatever he does.”</p><br/><p>Lee Eun Jin who had been listening silently had an opposing expression.</p><br/><p>“So you want us to push for him openly?”</p><br/><p>“No. I’m asking you to find something in him that will cover his inability to sing. If you can’t find anything, I won’t hang on to him.”</p><br/><p>They could protect Lee Eun Jin’s pride as this was her first time on the judges’ panel. What went out on air was the producer’s magic, or editing. She was not such an amateur that she would make a fuss if an edit was made entirely different from her intentions.</p><br/><p>Kim Ki Sik was confident. He was certain that the viewer ratings would go up if he made Jun Hyuk a star.</p><br/>\n</div>"}