{"title": "Chapter 51", "id": 51, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-51", "volume_title": "Volume 1", "body": "<h1>Chapter 51</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 1 / Chapter 51</p><br/><p>TL: LightNovelCafe</p><br/><p>Jo Hyung Joong needed to choose a song for Jun Hyuk to perform without singing. Jun Hyuk was not a simple aspiring singer, but a performer. He had accepted Jun Hyuk as a musician whose tastes needed to be respected and that he could not just be thrown a repertoire.</p><br/><p>When Nam Seung Hee and Kwak Hye Sung went into a small room in the recording studio, Jun Hyuk showed interest in the studio equipment he had been squinting at,</p><br/><p>“Teacher, can you make sounds even without an instrument just by using this machine?”</p><br/><p>“Yeah, you can make almost every sound. If you prepare MIDI operations with the master keyboard, you can make the sounds with programs. You can’t bring out a great performer’s emotion or technique though. If you can’t do as well as the machine you’re a lower class performer, middle class if you’re similar, and A class if you’re much better.”</p><br/><p>“I see.”</p><br/><p>Jun Hyuk seemed to be disappointed that perfect music was impossible with a machine.</p><br/><p>“Why? Are you interested? I guess you want to try producing now?”</p><br/><p>“Ah, that’s not it. A few days ago, I was at a different studio to record a mission song from the qualifiers… and I saw them fixing the music and making new sounds.”</p><br/><p>“That’s right. Studio equipment can do just about that much.”</p><br/><p>“I was just wondering. I was thinking I could make the symphony I wrote, but I guess that’s impossible.”</p><br/><p>“What? Symphony?”</p><br/><p>“Yes. I’ve made a few, but I always wanted to be able to hear one of them. There’s no orchestra willing to perform a symphony that I made.”</p><br/><p>Jo Hyung Joong remembered a call he had with judge of Tomorrow’s Star, Yoon Jung Su.</p><br/><p>[A kid named Jun Hyuk is in your group, right?”]</p><br/><p>[Yeah, why? You know him?]</p><br/><p>[Watch him with care. He might be an amazing genius.]</p><br/><p>This was not the 18th century. It was not an era when teenagers tried to compose symphonies and write sonatas.</p><br/><p>It was an era when a few teenagers these days trained diligently to play the music that was created in the 18th century.</p><br/><p>But here was a teenager who made a symphony without ever receiving proper education or training in classical music.</p><br/><p>“Did you bring your score? For the symphony?”</p><br/><p>It did not matter if Jun Hyuk’s symphony was not a masterpiece. Jo Hyung Joong did not care if Jun Hyuk had just written something basic. The fact that he had written music for dozens of instruments that would have to play for 30-40 minutes was talent itself.</p><br/><p>“The scores are at home. Why? Do you want to see them?”</p><br/><p>“Of course. A symphony at your age? I can’t believe it. What’s the title?”</p><br/><p>“I didn’t give it a cool title like with old classics. It’s just Symphony No.1 in A Major.”</p><br/><p>This side of him was just a teenager. It showed that he wanted to show off his music.</p><br/><p>“Ha ha. I guess if someone were to go through your works later, there would be several Op.”</p><br/><p>“Is that what would happen? Ha ha.”</p><br/><p>“Then I guess you have to make your second piece?”</p><br/><p>“No. The new one has to be No. 5 since I already made four. Three aren’t that good though. Even I can tell that I was trying too hard with those.”</p><br/><p>Jo Hyung Joong had to wrestle with his work for at least a month to make a pop song that went just over three minutes. The work itself for a symphony was different. Moreover, for four symphonies. Even if they were rubbish, it was important that he had written four.</p><br/><p>On top of that, one of them was good enough that he wanted to hear it performed. How did he have to understand this?</p><br/><p>This was not the end. Jun Hyuk’s continued boasting brought him from being surprised to shocked,</p><br/><p>“I only really like one of the symphonies, but I like most of the ariettas I made for the piano and violin.”</p><br/><p>“What? Are you saying that you’ve written other songs?”</p><br/><p>“Yes. For piano songs… um… I think I have 20? I have around the same for the violin too…..”</p><br/><p>While Jun Hyuk was trying to count the number of pieces he had on his fingers, Jo Hyung Joong’s jaw dropped.</p><br/><p>He had heard that it had only been two years since Jun Hyuk started music. The reality was that there had to be less than 10 people in Korea who composed 20 songs even after majoring in classical music.</p><br/><p>“How many songs have you made until now? Is that it?”</p><br/><p>“No. I’m just telling you about the classical… 70 or 80 for pop music? Of course the ones I actually like don’t make up half of them.”</p><br/><p>“I’m sure you have scores for all of those as well?”</p><br/><p>Pop music composer Jo Hyung Joong wanted to see those scores immediately.</p><br/><p>“Yes, they’re all at home. I wanted to toss the ones I didn’t like, but my boss told me I can’t do that.”</p><br/><p>“Your boss? Oh, at the cafe you work at?”</p><br/><p>“Yes. Though I hardly do any work.”</p><br/><p>“Aren’t you working while you eat and sleep there?”</p><br/><p>“I do eat and sleep there but I don’t work. All I do is clean and open the doors in the morning, and close the doors and clean at night. I spent the rest of my time in the practice room my boss made for me in the basement writing songs and playing music.”</p><br/><p>“You even had a practice room? What instruments did you have?”</p><br/><p>Jun Hyuk became excited as soon as Jo Hyung Joong asked about the instruments. He had only the best, so that was of course something to brag about,</p><br/><p>“For drums, he set TAMA and SABIAN. Fodera for bass, and for the electric guitar, I have a PRS (Paul Reed Smith), Custom, and two James Tayler BuringWaters. Yamaha for the piano.”</p><br/><p>Jun Hyuk was listing instruments that would be in a professional band.</p><br/><p>“What? You’re saying you have all of those?”</p><br/><p>“Yes. And the AV receiver in Yamaha while the amp is MESA/BOOGIE). Oh right, the speaker was normally for the cafe but my boss gave it to me. He said it was something really expensive.”</p><br/><p>“Wow! That’s amazing.”</p><br/><p>“Yes. My boss prepared everything for me saying that my instruments and equipment needed to be expensive and good.”</p><br/><p>This kind of investment for one teenager to have was excessive. Jo Hyung Joong began to wonder what kind of person the cafe owner was. How could a man who was being torn apart on the internet as some villainous slave driver be willing to spend hundreds of thousands of dollars on one teenager no matter how talented he seemed to be? It did not make sense.</p><br/><p>‘Typical. You can’t believe what you read on the internet.’</p><br/><p>Jo Hyung Joong began to feel bad for the cafe owner whose face he did not even know.</p><br/><p>As Jun Hyuk carefully raised a question to Jo Hyung Joong who had been lost in thought, he forgot all about the cafe owner,</p><br/><p>“Teacher, will you take a look at my score?”</p><br/><p>“Your Symphony No. 1?”</p><br/><p>“Yes. I’ll get it from my dorm tonight.”</p><br/><p>“Hm… yeah. Let’s see it. I’m actually not an expert in classical, but don’t you think it’s a good song if I say it is? If it’s so good that even someone who isn’t an expert says it’s good? And if I can, I’ll show that score to someone I know in the classical field.”</p><br/><p>Jun Hyuk’s eyes widened when he said that he would show the score to someone in the classical field. It could be the first chance to have his music assessed by an expert.</p><br/><p>Jun Hyuk knew Yoon Kwang Hun had limitations. Yoon Kwang Hun’s understanding of music was incomparable to the average person, but it stopped at that of a music lover and mania.</p><br/><p>Yoon Kwang Hun himself knew his own limitations and evaluated Jun Hyuk’s music less and less. If he could get the opinion of an expert, he could verify if he really had the talent that Yoon Kwang Hun kept assuring him of.</p><br/>\n</div>"}