{"title": "Chapter 69", "id": 69, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-69", "volume_title": "Volume 1", "body": "<h1>Chapter 69</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 2 / Chapter 69</p><br/><p>TL: LightNovelCafe</p><br/><p>Jun Hyuk who had returned to the dormitory could not sleep with the excitement that he would be performing with an orchestra. He had not thought that something like this would happen in the next 10 years, but the opportunity was right before him.</p><br/><p>As he was sitting on the front yard, breathing in the cold fall wind and imagining the concert, Nam Seung Hee came next to him.</p><br/><p>The staff had let them know what happened when Jun Hyuk left the dormitory for two days to take part in the press conference. Nam Seung Hee had wanted to say words of comfort or encouragement, but looking at his expression of happiness, she could not say it. She worked up the courage when she saw Jun Hyuk alone.</p><br/><p>“It’s a relief that everything was resolved well.”</p><br/><p>“Oh, yes.”</p><br/><p>“Did you finish recording the 1st mission song?”</p><br/><p>“No. They said I’ll be recording live during the broadcast. I’m going to Teacher Yoon Jung Su for the 2nd mission song tomorrow.”</p><br/><p>Live recording? What kind of arrangement was it that they were doing a live recording? When she thought that it was Jun Hyuk who had broken all of the boundaries up until now, it was not anything to be surprised by.</p><br/><p>“Oh, I see. I have senior Lee Eun Jin.”</p><br/><p>“Did you hear my song in Teacher Jo Hyung Joong’s studio?”</p><br/><p>“Yes. It seemed like most of the work on it was done.”</p><br/><p>Nam Seung Hee swallowed and spoke carefully,</p><br/><p>“What do you think?”</p><br/><p>“Excuse me?”</p><br/><p>“You heard me sing. What do you think?”</p><br/><p>“Hm… Honestly?”</p><br/><p>“Yes. Completely honestly.”</p><br/><p>“Your voice is like chalk dust.”</p><br/><p>“Chalk dust?”</p><br/><p>“Yes. It has a soft touch, but it’s a little stiff? Like that. That’s why I don’t think you fit well with songs that are light and youthful.”</p><br/><p>“Wait. Can we just speak casually? It’s a little uncomfortable. We’ve even completed a mission together.”</p><br/><p>“Then what do I call you?”</p><br/><p>“Since I’m 21, I’m an older sister.”</p><br/><p>“Alright. Then I’m not going to use formal speech anymore.”</p><br/><p>“Huh? Oh, sure.”</p><br/><p>She was more taken aback that he had used casual speech so suddenly, but felt good that they had become friendlier.</p><br/><p>“Then you’re saying the song now isn’t that great?”</p><br/><p>“That’s right. Hm… The violin and flute, what’s lighter?”</p><br/><p>“Obviously the flute.”</p><br/><p>“But what if you play a sad song with the flute? And play a light song with the violin? It doesn’t fit?”</p><br/><p>“No. That fits too.”</p><br/><p>“That’s why the violin and flute are good instruments. They can express any emotion. You’re honestly not a very good instrument. Your tone doesn’t work well with light songs.”</p><br/><p>If a childlike voice with a thin and high pitch were to sing Kim Kwang Suk’s ‘Around Thirty,’ would that emotion be delivered to this kid? That is what a tone from birth is.</p><br/><p>Nam Seung Hee’s face turned dark. She was not stupid. She could tell from Teacher Jo Hyung Joong’s attitude toward Jun Hyuk. She could tell that Jun Hyuk’s talent in hearing music was better than that of Teacher Jo Hyung Joong’s.</p><br/><p>Everyone in the dormitory had been upended because Jun Hyuk had said Jang Na Rae would be the winner. It was possible that everyone wanted to ask Jun Hyuk what place they were in.</p><br/><p>“I thought you were going to be honest with me? I can’t sing?”</p><br/><p>“Hm… To say it simply, you’re not good enough to digest any genre of music. You need to choose one genre to focus on. Then, your singing skill will improve… and you can expand your area. But give up the hip hop you like.”</p><br/><p>“Hip hop… isn’t it?”</p><br/><p>She had been expecting it, but she wanted to cry when she heard that she should give it up. Jun Hyuk kept rubbing salt in the wound as if he had not noticed this,</p><br/><p>“You can’t do hip hop just by mumbling quickly. A specialty genre… rock, rhythm and blues, hip hop – if you don’t understand the essence of these perfectly, you’re just imitating it.”</p><br/><p>If rock spirit was the resistance and rebellion of the older generation, hip hop was started in late 1970s in New York’s Harlem to bring out the core of the harsh realities.</p><br/><p>The word essence related to music came as a surprise to Nam Seung Hee. Someone who was only 17 years old was talking about the essence of music.</p><br/><p>She had tried to understand the emotion in one song. And she had worried about the high notes and techniques to digest that song. But a teenager telling her to think seriously about a genre as a whole?</p><br/><p>She thought she could tell why Teacher Jo Hyung Joong had judged Jun Hyuk so highly.</p><br/><p>“If you really need to do it, tell your story. Don’t you think the power of hip hop is telling your own story like a confession?”</p><br/><p>Jun Hyuk’s lips turned up slightly at the sight of a discouraged Nam Seung Hee. In times like this, it seemed like age was not important. She even seemed cute with her dropped shoulders.</p><br/><p>“There’s a song I made that matches your tone… I asked Teacher Yoon Jung Su to write the lyrics. It’d be perfect if you sang that.”</p><br/><p>Nam Seung Hee felt like her eyes had sparked open at Jun Hyuk’s words. A song that was made for her?</p><br/><p>“What? You made it for me?”</p><br/><p>“Yeah. I haven’t written the lyrics for it, but it’ll be perfect for your tone. Since the 1st mission is a free choice song, take a look at it and do it if you want to.”</p><br/><p>“What kind of song is it?”</p><br/><p>“It’s a slow ballad with a bright tone.”</p><br/><p>“A slow ballad?”</p><br/><p>“Yeah. Oh, I’m going to Teacher Yoon Jung Su tomorrow, so I’ll ask him. If he finished the lyrics, take a look. You don’t need to use it if you don’t like it.”</p><br/><p>Nam Seung Hee thought about why Jun Hyuk would have made a song for her. She had never heard that Jun Hyuk had made a song for anyone.</p><br/><p>At times embarrassing affection that Jun Hyuk had shown towards her had been burdensome. She had thought that it had been purposefully created by the production team.</p><br/><p>She had ignored it until now, but not anymore. Nam Seung Hee was sure that Jun Hyuk liked her.</p><br/><p>However, Nam Seung Hee had no way of knowing that the way in which Jun Hyuk liked girls was not like the way other average teenagers, no average boys did.</p><br/><p>***</p><br/><p>When Jun Hyuk entered the studio, Yoon Jung Su hugged him in welcome.</p><br/><p>“I finally meet Jun Hyuk again. All of your problems outside are handled, right?”</p><br/><p>“Yes. The lawyer told me not to worry about it because he’ll take care of it from now on.”</p><br/><p>“Sure… You must have had a hard time. Now you have to focus on music?”</p><br/><p>“Yes. That’s what I intend to do.”</p><br/><p>Yoon Jung Su had fought with Lee Sung Chul to bring Jun Hyuk in. Lee Sung Chul had wanted to work with Jun Hyuk on his new album.</p><br/><p>“Right. Can you turn off the camera for a moment? We have to talk about something very private.”</p><br/><p>When Yoon Jung Su spoke to the VJ pushing a camera to his face, the VJ could guess what Yoon Jung Su was going to say. He was going to say something very realistic that could not be left documented. The VJ turned off the camera and went outside.</p><br/><p>“Okay, you guys must know well by now, a broadcast moves the way a writer planned it out. It was part of the script that you guys came under my wing too. Jang Jun Hyuk, Jang Na Rae, Kwak Hye Sung. Why do you think this group was created?”</p><br/><p>Everyone knew the reason, but Jang Na Rae and Kwak Hye Sung just looked at each other and could not answer.</p><br/><p>“There’s the similarity that you don’t have agencies, right? My intention is to make it so you two can find agencies during the 1st and 2nd rounds. If you guys can’t show off your charm by the 2nd round, you might get eliminated.”</p><br/><p>Jang Na Rae and Kwak Hye Sung’s faces became dark.</p><br/><p>“Hey… Don’t look so discouraged. The fact that you made it to the finals means you’re already professionals. Regardless, you guys will be able to live off of singing. Of course, I’m sure Jun Hyuk doesn’t care?”</p><br/><p>Yoon Jung Su took a glance at Jun Hyuk who had been standing with his head down, staring at the floor. Now, the whole nation knew that Jun Hyuk would be leaving to study abroad when this broadcast ended. Though he himself had not made a decision yet.</p><br/><p>“Anyway, we’ll prepare well so agencies will look for you two. You need to convince me first, since I am also the president of an agency. If I can feel your charm, you’ll be contacted by other places. You guys can choose then.”</p><br/><p>Yoon Jung Su handed over CDs he had prepared.</p><br/><p>“There are about three songs in each of those CDs. Na Rae and Hye Sung, listen to them in the next room. Since the arrangements are nearly done and the guides are recorded, decide if there’s one that you like.”</p><br/><p>When the two left, only Yoon Jung Su and Jun Hyuk were left.</p><br/><p>“I saw the press conference too, but you’re going to study abroad?”</p><br/><p>“It hasn’t been decided yet.”</p><br/><p>While Yoon Jung Su had spoken with Jo Hyung Joong many times over the phone, he wanted to see how far Jun Hyuk’s potential went. There was already something that he and Jo Hyung Joong had agreed on. Producing would be by Jo Hyung Joong, composition would be Jun Hyuk, lyrics would be by himself, with various artists to make Jun Hyuk’s debut album.</p><br/><p>Their intention was not to use Jun Hyuk to make money. They had both made enough money until now.</p><br/><p>They wanted to make an album equivalent to that of Wild Chrysanthemum who had been number one in Korea for 30 years now.</p><br/><p>“Can I say something?”</p><br/><p>“Yes.”</p><br/><p>Jun Hyuk nodded.</p><br/><p>“This is an issue of career. If you want to succeed in classical, you need to study abroad.”</p><br/><p>“To learn theory?”</p><br/><p>“Theory? Well, you can learn theory in Korea too. There aren’t just one or two professors who know theory well. And there are people who studied in our country who are recognized all over the world. The real important thing is people.”</p><br/><p>“People?”</p><br/><p>“Yeah. Music leaves my hand the second the melody in my head is moved to a score. After that, you have to work with a lot of people. If you study abroad, you’ll naturally meet those people.”</p><br/><p>Jun Hyuk thought of Jo Hyung Joong. Even though it had only been for a month and it had not turned out well, he had also met the orchestra.</p><br/><p>“One more thing. If you study abroad, I’m sure you’ll meet people who prepare the world as their stage? The more talented people are, the more they gather together. The people who are teaching you are already considered to be grand. As you meet with those people, you’ll share inspiration. That synergy is something tremendous.”</p><br/><p>After Yoon Jung Su looked at Jun Hyuk’s face, he continued carefully,</p><br/><p>“I highly recommend that you study abroad. If you go and hang out with people who are like you, the frustration you feel might disappear.”</p><br/><p>Frustration. Jun Hyuk knew what this frustration Yoon Jung Su said was. It was when people looked at things in fascination when he thought of them as definite.</p><br/><p>“I heard you told Hyung Joong that you would work on your debut album together before you go abroad?”</p><br/><p>“Oh, that’s not it. We don’t know yet, so…..”</p><br/><p>“Even if you go abroad, release an album once this broadcast is over. You have to leave something behind for it to become a memory. You try making a team. We’ll actively help you.”</p><br/><p>We? Jun Hyuk was curious as to who the we Yoon Jung Su was referencing.</p><br/><p>“Ah… We haven’t decided on a way to do it. We’re thinking of making your debut album really cool.”</p><br/><p>Yoon Kwang Su turned the topic to the mission song as though he had finished what he needed to say.</p><br/><p>“You don’t know any songs by me, right?”</p><br/><p>“I think I’ve heard some but…..”</p><br/><p>Yoon Jung Su heard Jun Hyuk’s tone without confidence and laughed as he handed over an MP3.</p><br/><p>“I chose a few in advance. There are four, so choose the one that you like. Let’s start from there.”</p><br/><p>Jun Hyuk listened to the four songs on repeat. There was only one reason why he listened to the songs a few times. He could not think of a version that was arranged.</p><br/><p>No matter how much he changed the genre of the four songs, there was nothing he liked. Yoon Jung Su was the judge who had been friendliest to him. For Jun Hyuk, his songs were not that great.</p><br/><p>‘Is it due to the lyrics…..’</p><br/><p>The three elements to configuring a song: melody, rhythm, and chord. Among these three essential elements, there was no lyrics. In classical, these three were the ultimate.</p><br/><p>Opera had lyrics, but it was usually the Italian that is unfamiliar to most. Mozart’s ‘Figaro’s Wedding’ broke the language barrier easily. Even lyrics in a different language that could not be understood were sweet.</p><br/><p>The power of the melody and chime made it so even the singer’s voice sounded like an instrument with a beautiful sound.</p><br/><p>In modern popular music however, the lyrics were what pulled the song along. It was as though the lyrics of a song were even securing the song itself.</p><br/><p>The rap genre completely eliminated the melody and excited the listeners with just the lyrics and rhythm.</p><br/><p>Yoon Jung Su’s music had the merit of putting everyday emotions into lyrics. These lyrics might be able to share these emotions with the average person, but to Jun Hyuk who had not experienced ‘everyday emotions,’ only words were being shared.</p><br/><p>Jun Hyuk could not sympathize with Yoon Jung Su’s music at all.</p><br/><p>Finally, he turned the MP3 player off and thought about how he would bring it up to Yoon Jung Su while he listened to Jang Na Rae practice in the other room.</p><br/><p>It was the first time he was hearing Jang Na Rae sing since the preliminaries. He had heard that she recorded Lee So Ra’s song for the first song in the finals. This also meant that she had been accepted as a vocalist.</p><br/><p>Jang Na Rae who was singing a song from Yoon Jung Su’s youth was enough to surprise even Yoon Jung Su.</p><br/>\n</div>"}