{"title": "Chapter 61", "id": 61, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-61", "volume_title": "Volume 1", "body": "<h1>Chapter 61</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 2 / Chapter 61</p><br/><p>TL: LightNovelCafe</p><br/><p>Yoon Kwang Hun and Baek Seung Ho talked about the days when they were close as they drank in a hotel room.</p><br/><p>“Is that true? Our boss was that successful?”</p><br/><p>Jun Hyuk was repeating the same question in disbelief as he ate the food they had ordered as room service.</p><br/><p>“Yeah. Kwang Hun was the king of Yeouido. Everyone knew who he was.”</p><br/><p>“Hey kid. You didn’t believe me all this time? Wow… I feel betrayed…..”</p><br/><p>“Well… who would believe it? It doesn’t make sense that someone who used to move hundreds of thousands of dollars and made over a million is running a cafe that doesn’t even do very well.”</p><br/><p>‘Back in the day…..’ Of the adults who said that they had been really great back in the day, he had never seen someone who really had been. Jun Hyuk had not believed anything Yoon Kwang Hun had said.</p><br/><p>“But sir, were you really going to send me abroad?”</p><br/><p>Jun Hyuk had heard that Yoon Kwang Hun and Professor Go Sae Won were looking into famous schools abroad where he could study for the first time at the press conference. He was grateful, but a little sad.</p><br/><p>“Oh, I didn’t tell you. Nothing is decided yet. We were just looking into it. Why? You don’t want to study abroad?”</p><br/><p>“I don’t know. I do want to go, but it’s scary… and I also get the feeling that I just want to lock myself in a recording studio and make music.”</p><br/><p>Baek Seung Ho who was drunk at this point, emptied his glass and spoke,</p><br/><p>“Oh right. I was curious about that too. What is he going to study when you say he’s like Mozart? Shouldn’t he just go straight to releasing his music with a debut? I thought you said music was just spilling out of his head. What more can he learn?”</p><br/><p>“You’re so ignorant. You don’t think Mozart learned the theories of music? Mozart’s father, Leopold Mozart, was a famous piano teacher in Salzburg. Do you know how many books he wrote on music? Mozart was home schooled on music from an impressive teacher from birth.”</p><br/><p>Yoon Kwang Hun was also drunk,</p><br/><p>“Jun Hyuk’s lacking theory the most. He needs to know the theories to get the notes of the music spilling out of his head more elaborately so he can make music. No genius can make music without knowing the theories. I’m sure understanding it will be quick.”</p><br/><p>“That’s not it. Isn’t a genius someone whose music is naturally made to the theories? What are you going to do if learning the theories messes up Jun Hyuk’s talent?”</p><br/><p>The two men kept speaking their opinions. To Jun Hyuk, this just looked like a drunk banter.</p><br/><p>Adults fought over useless things when they drank too much. He did feel good that there were now two adults who worried about his future.</p><br/><p>While their voices grew louder, Jun Hyuk was lost in thought.</p><br/><p>Did he need to learn theory? Would the music in his head become more stylish if he learned the theories?</p><br/><p>No. Good music, stylish music, what could this be? What was Teacher Jo Hyung Joong’s method to making stylish music?</p><br/><p>These thoughts kept coming up in Jun Hyuk’s mind without rest.</p><br/><p>Baek Seung Ho yelled loudly as if trying to interfere with Jun Hyuk’s thoughts,</p><br/><p>“Stop! Turn on the TV. The broadcast is going to start.”</p><br/><p>Jun Hyuk bolted up and when he turned on the TV, ‘Tomorrow’s Star’ was about to start. Since it was still about the area preliminaries, Jun Hyuk should not be making an appearance.</p><br/><p>However, to raise viewer ratings, the broadcast started with highlights from Jun Hyuk and Yoon Kwang Hun’s press conference. After that, they showed scenes of Jun Hyuk’s area preliminary auditions that had not come out on broadcast before.</p><br/><p>They showed the guitar version of Jung Tae Chun’s ‘Poet’s Town’ that Jun Hyuk had arranged on the spot along with the surprised faces of the judges. For a broadcast that only aired for 1 hour, it could have been seen as a special on Jun Hyuk because all of the clips regarding him added up to 15 minutes.</p><br/><p>“I have to admit the people at the broadcasting station are fast. When do you think they prepared all of this?”</p><br/><p>The 10% viewer rating that Baek Seung Ho promised may have been incorrect, but it was definitely twice the rating of last episode.</p><br/><p>Baek Seung Ho who had been drunkenly cursing the broadcasting station stood up shakily. When he went home, Yoon Kwang Hun and Jun Hyuk became quiet.</p><br/><p>“Jun Hyuk.”</p><br/><p>“Yes.”</p><br/><p>“What are you thinking about?”</p><br/><p>“What? No, it’s nothing. Just.”</p><br/><p>“Don’t worry too much. You don’t have to study abroad if you don’t want to.”</p><br/><p>Yoon Kwang Hun knew that Jun Hyuk had become much more quiet when talk of studying abroad came up.</p><br/><p>“It’s not that I don’t want to. I don’t know.”</p><br/><p>Yoon Kwang Hun pat Jun Hyuk’s shoulder gently like a father and teacher,</p><br/><p>“Then just do what you want. If you decide later that you want to study, you can do it then. You’re only 17. It’s not too late even if you decide to study 10 years later.”</p><br/><p>“The thing is… I don’t know what I want to do right now.”</p><br/><p>Yoon Kwang Hun knew better what Jun Hyuk wanted to do now. Make music. He wanted to make the melodies in his head into concrete sound. That was all.</p><br/><p>When Jun Hyuk said he did not know, it probably meant that he did not know what he needed to do to prepare for his future.</p><br/><p>He had said that making music on the audition program was fun. Is it not definite that he is enjoying himself because he can hear the melodies in his head with his own ears?</p><br/><p>“Everyone is like that at your age. The kids who are in high school, studying for college entrance exams are just studying to go to college. They choose their schools and majors according to their exam scores. You’re much better off compared to them. It’s already decided what you’re going to do.”</p><br/><p>Jun Hyuk could not believe that he was better off than other kids his age because he had never even attended school.</p><br/><p>“Most kids just choose to be a lawyer or doctor to make a lot of money because they’re smart. I was like that too. When I was going to school, economics major was really popular because it was easy to get hired at a large company. That’s why I just decided to do it.”</p><br/><p>“What did you really want to do?”</p><br/><p>“Honestly, I still don’t know.”</p><br/><p>“What? You still don’t know? Geez.”</p><br/><p>17 year old Jun Hyuk was having trouble believing that a man over 40 had gone through life without knowing what he wanted to do.</p><br/><p>“It’s like that since I didn’t know until college that I would become a stockbroker. When I graduated, I just found employment at a financial firm that would pay me a lot. When I was working, I saw that people with MBAs were paid much more than I was, so I quit and went to study abroad. That’s how it progressed. I just fell into the excitement of making money later. After I lost everything… I started this cafe thinking I’ll just live while listening to music.”</p><br/><p>This was something difficult for young Jun Hyuk to understand. There weren’t very many people in the world who did what they wanted to do. No, it was rare for people to even know what exactly they wanted to do.</p><br/><p>“But I have a dream now.”</p><br/><p>“A dream?”</p><br/><p>“Yeah, you know what it is?”</p><br/><p>“What is it? Is it… me?”</p><br/><p>“Yeah. I want to make it so that your music doesn’t stop as the world makes a full turn. So for the 365 days in a year, your music is playing from somewhere at any time. It doesn’t matter if it’s classic or pop since there will be someone to listen to it.”</p><br/><p>Jun Hyuk spent the entire night talking to Yoon Kwang Hun about the future and dreams as such, and went back to the dormitory.</p><br/>\n</div>"}