{"title": "Chapter 74", "id": 74, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-74", "volume_title": "Volume 1", "body": "<h1>Chapter 74</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 2 / Chapter 74</p><br/><p>TL: LightNovelCafe</p><br/><p>The four songs that Yoon Jung Su initially chose had similar flow and effect because they are all good to arrange as electronic dance music. Everyone listened carefully because they were curious to see how these four songs were completely combined and not sampled, even though they are similar.</p><br/><p>The music flowed out once he pressed the play button. Everyone looked enchanted at the end of a song that did not even last 4 minutes. Except Yoon Jung Su.</p><br/><p>Jun Hyuk’s mixed song did not sound anything like a dance song, but more like a grand choir. Because of the measures from well-known classicals that were scattered well here and there, it could almost be mistaken for a song that one already knew.</p><br/><p>“Jun Hyuk. I think it’ll be hard even for a ballerina to dance to this song.”</p><br/><p>Yoon Jung Su offered his opinion. He meant that no one could dance along to a choir chorus that had an almost solemn sentiment to it.</p><br/><p>“Exactly. This is just the drawing paper. I’m going to draw a dance on this.”</p><br/><p>“If you use this as a drawing paper, I think the traces of my song that you remake will disappear.”</p><br/><p>“It’s a drawing paper. Drawing paper and paint. Paintings are completed with just these two, so it’ll take up half of it.”</p><br/><p>Could he have smarts that he was born with? Or could it be that he becomes smart when music is involved? His descriptions were the best.</p><br/><p>“Alright. I think it’ll be easier to just listen to the completed song. Ha ha.”</p><br/><p>Yoon Jung Su came out of the studio and stopped by the cafe. He drank coffee alone as he thought about Jun Hyuk’s music he had just listened to. He had held back his admiration in the studio because there had been so many people.</p><br/><p>‘Goodness. Fuga in a dance song.’</p><br/><p>The main music fuga of the Baroque era is a complex machine with three parts (individual lines forming the melody and chords) as track, transition, and the length of notes stretched by two, reduced in half and before one part finishes, the next part plays in turn as stretta, changing in position, backing, et cetera.</p><br/><p>Jun Hyuk had thought of the four original songs as parts and used the fuga technique to arrange them exquisitely.</p><br/><p>It was surprising that he had thought to do this with four ordinary pop songs, but it’s proper implementation deserved to be admired even more. The feeling that it was vaguely elaborate and exquisite was because the technique was so complex.</p><br/><p>His thoughts on Jun Hyuk were completely overturned. Did a Jun Hyuk who had already reached this state need to go study abroad? When he had the skills to apply complex techniques just by listening to classical music?</p><br/><p>Could it not be that learning theory for Jun Hyuk means that he will just be learning the designated names?</p><br/><p>Yoon Jung Su drank the rest of his coffee in one gulp and stood up. Getting too involved was not good. It could be unnecessary for him to be so concerned with Jun Hyuk’s future. No matter what path he chose, he was bound to be surrounded by people who are much more talented than Yoon Jung Su is.</p><br/><p>When he returned to the studio after emptying his mind, he could not see Jang Na Rae. But Kwak Hye Sung was in the recording booth wearing headphones. It was obvious that he was nervous standing in front of the mic.</p><br/><p>Kwak Hye Sung was nervous because he kept comparing himself to Jun Hyuk’s music and Jang Na Rae’s singing.</p><br/><p>“What about Jang Na Rae? She’s done practicing?”</p><br/><p>“Yes. It’s plenty. I think we can record the track tomorrow.”</p><br/><p>“How about Jun Hyuk?”</p><br/><p>“He went into that room to paint on his drawing paper.”</p><br/><p>The sound engineer shook his head. Jun Hyuk’s concentration surpassed that of most professionals.</p><br/><p>“How is Jang Na Rae’s song? Did it come out well?”</p><br/><p>“Try listening to it later. It’s amazing.”</p><br/><p>The sound engineer put this thumb up. This meant that Jang Na Rae had digested Jun Hyuk’s directing perfectly.</p><br/><p>Yoon Jung Su spoke to Kwak Hye Sung who was nervous in the recording booth,</p><br/><p>“Hye Sung, let’s do it lightly. It’s not a formal recording. As if you’re practicing. And don’t be too nervous, okay?”</p><br/><p>Kwak Hye Sung’s song started, but the sound engineer was not really paying attention.</p><br/><p>“Hey, aren’t you going to concentrate?”</p><br/><p>“Oh, yes. Sorry.”</p><br/><p>The sound engineer came to his senses once Yoon Jung Su hit the back of his head. There was no way for him to concentrate on Kwak Hye Sung’s boring song when he had just heard Jang Na Rae’s free and colorful music.</p><br/><p>“This… This is a problem if Hye Sung comes on live broadcast after Jang Na Rae…..”</p><br/><p>Yoon Jung Su responded to the sound engineer’s mumbling,</p><br/><p>“What is it? Jang Na Rae was that good?”</p><br/><p>“It’s no joke. Jang Na Rae is really something once she shows her potential. It’s like throwing a grenade where a bomb is going to fall if Hye Sung – no, anyone goes after Jang Na Rae.”</p><br/><p>The sound engineer continued quickly,</p><br/><p>“Scout her. I’m 100% sure someone else will take her once the 2nd stage goes on air.”</p><br/><p>Kwak Hye Sung’s song ended as the two men were talking about something else.</p><br/><p>“Uh, teacher. What did you think?”</p><br/><p>“Huh? Oh… it’s okay. Should we take a break?”</p><br/><p>Yoon Jung Su wanted to hurry up and hear Jang Na Rae’s song to see what the praise was all about.</p><br/><p>He put on the headphones and listened to Jang Na Rae’s song. Yoon Jung Su forgot that Jun Hyuk had directed this song. Were Jang Na Rae’s vocals to this point? He could figure out why the sound engineer had put his thumb up.</p><br/><p>It was a voice where one could feel that if there is only one moment’s opportunity, something hidden explodes.</p><br/><p>Was Jang Na Rae 24 years old?</p><br/><p>He had forgotten her age because a deep sound rang from her. Jun Hyuk had brought out this sound, just by telling her to sing calmly.</p><br/><p>A few days passed with Kwak Hye Sung and Jang Na Rae practicing, and Jun Hyuk immersed in mixing.</p><br/><p>Past 10pm, Jang Na Rae and Kwak Hye Sung went back to their dorm exhausted while Jun Hyuk had to be convinced to leave.</p><br/><p>Once everyone left, the producer who had been working with Jun Hyuk brought Yoon Jung Su in front of the control box as though he had been waiting.</p><br/><p>“Jung Su, this is what Jun Hyuk made… Listen to it.”</p><br/><p>“He’s already finished?”</p><br/><p>“No. According to Jun Hyuk, there’s still a lot left. He took a lot of sound effects in his MP3 sound library saying that he needs to listen to more.”</p><br/><p>Yoon Jung Su felt bad for them in Jun Hyuk’s dedication,</p><br/><p>“You guys must be struggling.”</p><br/><p>“I’m telling you, we’re going crazy. No, first listen to this before you talk.”</p><br/><p>After listening to a song short of 4 minutes, Yoon Jung Su could understand why the producers’ faces were full of discontent.</p><br/><p>“This… What is this? Goodness.”</p><br/><p>The two producers voiced their grievances as if they had been waiting for Yoon Jung Su’s surprise.</p><br/><p>“Exactly! We’re going to go crazy. He says it’ll take a while to complete it. What more can he put in from here?”</p><br/><p>“This is what people these days call useless high quality. I’m pretty sure that if you turn this on at a club, people will stop and enjoy the music instead of dancing to it.”</p><br/><p>“Jung Su, you say something. And take the master keyboard away! This is like leaving a game console with a young child. I’m telling you, he’s completely blown away by it.”</p><br/><p>Yoon Jung Su realized he had made a mistake. He felt like a teacher who had given the wrong homework. He needed to have told him to make music with just a simple beat and appropriate electronic sound. It was a mistake to throw unlimited ingredients at him.</p><br/><p>He had created a drawing paper by mixing classical and his music with fuga. He had put L.A. metal that was popular in the 80s on that drawing paper. L.A metal is lighter than heavy metal and close to pop, so youths were enthusiastic. It is simple, but the strong guitar riff was everywhere.</p><br/><p>It was enough until here. The part that astonished Yoon Jung Su came after he saw the part where fuga was left out.</p><br/><p>The song that he was going to gift to Nam Seung Hee flowed as the main. It was not as the original song, but edited with a fast beat.</p><br/><p>Yoon Jung Su yelled at the complaining producers once he came back to his senses,</p><br/><p>“Hey! Isn’t it like that when you’re doing work? Why are you being like this? The basic is normally three or four days.”</p><br/><p>“Jung Su, what could be different with a topcoat here? It isn’t a dance song anyway. Is he making a piece of work right now? They go to different producers the day after tomorrow. What are we supposed to do when we need to finish everything by tomorrow? Tell him to do it appropriately.”</p><br/><p>“Jung Su, you think about it too. This song is for a broadcast, not to listen to. The music is too complex. We know that it’s good because we’re listening to it with the best equipment in a recording studio. I can guarantee that the people watching via TV will not understand this music’s real taste.”</p><br/><p>“Alright, I get it. I’ll talk to Jun Hyuk tomorrow. And once Na Rae and Hye Sung’s recordings are finished, hand it over to the broadcast station. They’ll have to prepare for the stage. Don’t forget.”</p><br/>\n</div>"}