{"title": "Chapter 76", "id": 76, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-76", "volume_title": "Volume 1", "body": "<h1>Chapter 76</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 2 / Chapter 76</p><br/><p>TL: LightNovelCafe</p><br/><p>The producer in charge of Jun Hyuk’s third mission song was Kim Jong Suk in his early 40s. He is a great producer who had created multiple musicians with individuality, who showed their own colors. He is also a famous bassist who played in two of Korea’s representative rock bands.</p><br/><p>He had initially turned down the opportunity to produce for the show, but suddenly changed his mind when he saw Jun Hyuk on broadcast. Kim Jong Suk wanted to participate no matter what and went to the broadcast station himself.</p><br/><p>“I’m sorry, but it’s all already decided. We can’t change the producer now. We’ve even written up all of the contracts… Ugh! How good would it have been if you had agreed to do this in the first place? Why are you being like this now?”</p><br/><p>Producer Kim Ki Sik was upset with Kim Jong Suk who was now coming in and demanding Jun Hyuk when he had turned down their offer in the beginning. However, Kim Jong Suk insisted stubbornly,</p><br/><p>“I’m sorry, but there’s this motivation now that I see Jun Hyuk. I have to see him.”</p><br/><p>“Did you by chance get approached by an agency? To connect them with Jun Hyuk?”</p><br/><p>“Hey! Have you ever seen me meet with those guys? You know I don’t even produce music for idol groups.”</p><br/><p>Kim Jong Suk, who was from a rock band, only worked with musicians who did not even make TV appearances often. Most of his producing was for debut albums of underground musicians.</p><br/><p>If Kim Jong Suk agreed to produce for someone in the underground world, it meant that they were already halfway to success. It at least meant that they would not completely fail, and that their musicality had been recognized.</p><br/><p>On the other hand, if Kim Jong Suk refused to produce, it was a sober assessment that they should give up music to go another path.</p><br/><p>“Producer Kim. I’m not trying to take the job from a junior who has already finalized their contract. Just give me Jun Hyuk. You have the third mission, right? I’ll take responsibility for that one. I’m telling you I don’t even need money. I’ll do it for free. A donation of talent? Something like that?”</p><br/><p>“What are your intentions?”</p><br/><p>He was not a person to be so rashly persistent. There had to be a reason why he was so insistent.</p><br/><p>“Producer Kim. I’ll make Jun Hyuk sing on stage. It’s still a no?”</p><br/><p>Producer Kim Ki Sik was not sure if he had heard correctly for a moment. He would make Jun Hyuk sing?</p><br/><p>“Did you just say that you would make him sing?”</p><br/><p>“That’s right. I’m doing this because I want to hear him sing. The tone of his voice isn’t bad. And I think I can guess why he isn’t singing… Leave it to me.”</p><br/><p>“You’ll really make him sing?”</p><br/><p>Kim Jong Suk’s voice grew louder at Producer Kim’s sudden interest,</p><br/><p>“Instead, I heard that the 3rd mission theme is idol group songs, but change that. Do that in the 4th round. I heard the 3rd round is his last anyway.”</p><br/><p>“If you can make Jun Hyuk sing… And if he sings well, he could push to the win.”</p><br/><p>“That’s a little… I can’t promise that he’ll sing well. But I’ll make sure he sings. So what do you want to do? Will you leave him to me?”</p><br/><p>“Before that… how are you going to make him sing? If I think what you’re thinking is possible, we’ll do as you say.”</p><br/><p>“I’m going to trust his sensibility.”</p><br/><p>“Sensibility?”</p><br/><p>Since he was born with a talent in music, it is definite that he is rich in sensibility. Kim Jong Suk ensured Producer Kim Ki Sik that Jun Hyuk would sing if his emotions were stimulated.</p><br/><p>“I got some information from Hyung Joong and Jung Su. Right now, that kid is just an architect who’s remodeling other people’s songs. He’s readily pulling everything apart and putting it back together according to a blueprint.”</p><br/><p>Until now, Jun Hyuk had been focused on using the ingredients he was given to create the best music. There was no choice but to use other people’s songs because it is a broadcast, but he never showed his own story.</p><br/><p>“This kid has never expressed himself. According to Hyung Joong, he has mountains of compositions at home, but I can guarantee that he doesn’t express himself in any of those.”</p><br/><p>“How do you know that?”</p><br/><p>“When normal guys like us make music, we use our emotions, feelings, and thoughts because we have nowhere else to get the music from. With someone like Jun Hyuk, he can make music with even the slightest external stimulation. I’m pretty sure he’ll make music even by listening to the sound of a subway.”</p><br/><p>“You talk like you know Jun Hyuk really well when you’ve never met him.”</p><br/><p>Producer Kim Ki Sik looked at Kim Jong Suk who was speaking more and more nonsense as if he could not believe him.</p><br/><p>“Because I’ve met a lot of similar geniuses.”</p><br/><p>Kim Jong Suk worked with underground young and witty musicians who made music with their own color. There was even a person who saw two cockroaches in a basement practice room and said that they looked like a couple playing ‘catch me if you can’ on the beach. Though they are not as outstanding as Jun Hyuk, the underground is full of people who have their own talents.</p><br/><p>“So what’s the conclusion? What method will it take to make Jun Hyuk sing?”</p><br/><p>“I want to make Jun Hyuk face himself. Then he’ll want to ‘speak’ since there are things that are hard to express with just a melody.”</p><br/><p>“What in the world is Jun Hyuk’s hidden appearance that you’re being like this?”</p><br/><p>“You’re asking because you don’t know?”</p><br/><p>Producer Kim Ki Sik thought for a moment and opened his eyes widely,</p><br/><p>“Surely?”</p><br/><p>“Yeah. What else could there be?”</p><br/><p>Kim Ki Sik put his life on the line for viewer ratings and did all sorts of things, but he just realized that artists do even more than that to create one piece of work.</p><br/><p>“It’s too dangerous. If you rub his wounds, we don’t know what that brat will do. We’re dead if he gives everything up and runs away.”</p><br/><p>Kim Jong Suk looked at Producer Kim Ki Sik pathetically,</p><br/><p>“That’s why you’re just a producer for a music program. He won’t run away. What musician would run away when he’s found the best subject matter for music?”</p><br/>\n</div>"}