{"title": "Chapter 83", "id": 83, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-83", "volume_title": "Volume 1", "body": "<h1>Chapter 83</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 2 / Chapter 83</p><br/><p>TL: LightNovelCafe</p><br/><p>“Teacher. This is Hwang Suk Min.”</p><br/><p>– Oh wow, Teacher Hwang. It’s been a while. How have you been?</p><br/><p>“I’ve been pretty much the same.”</p><br/><p>– I guess there’s something going on? What is it? Did you want to get a drink? You’re calling this old woman out of the blue.</p><br/><p>“No. I might have to cram for an exam. Let’s do drinks next time. I called you because I think I found a gem and I wanted to see what you thought of him.”</p><br/><p>– Gem? A pianist?</p><br/><p>“Yes. He’s 17 years old, but he’s only been playing the piano for 2 years.”</p><br/><p>– 17? Then he started at 15… That’s very late.</p><br/><p>“Due to that, he isn’t bound to standards and is very free. No, rather than free, should I say he’s wild? Anyway, he’s really something.”</p><br/><p>He did not think that Jun Hyuk was free, but it was difficult to pinpoint a way to describe him.</p><br/><p>– Is that so? But do I really have to see him? If you say he’s a gem, he’s a gem.</p><br/><p>“There’s… something that bothers me but I don’t know what it is. I can’t tell if it’s a flaw or his color.”</p><br/><p>– I see. Bring him over sometime. Let’s see him together.</p><br/><p>“Thank you, teacher. Then.”</p><br/><p>When Hwang Suk Min hung up, Jo Hyung Joong who had been next to him opened his mouth slightly,</p><br/><p>“Uh… Who were you just talking to?”</p><br/><p>“Oh, it was Professor Jeon Hye Jin. You know her, right?”</p><br/><p>“Jeon Hye Jin? The pianist Professor Jeon Hye Jin?”</p><br/><p>“Yes.”</p><br/><p>At 24, she came in 3rd place in the Long Thibaud Competition (biennial piano and violin competition in Paris) and started to tour the world. She did not have the skill to be called on by world-famous symphonies like Vienna, New York, and Berlin, but she was successful enough to hold piano recitals with orchestras of high standards in each city.</p><br/><p>When she returned to Korea after living abroad for about 10 years, she was scouted by many universities as the first person to go up in the Long Thibaud Competition. She is now serving as a professor at the Music Conservatory, a Korean educational institution.</p><br/><p>“Were you talking about Jun Hyuk?”</p><br/><p>“Yes.”</p><br/><p>“Is there a problem with Jun Hyuk’s piano?”</p><br/><p>“Honestly, it’s an amazing skill. It’s almost impossible for someone to reach this level with self-education… but if he had received formal education, he would have been an outstanding pianist.”</p><br/><p>“But why…..?”</p><br/><p>“There’s something that bothers me, but I can’t pinpoint what it is. And if Professor Jeon Hye Jin is interested, it could be a great opportunity for Jun Hyuk.”</p><br/><p>“Oh, I see.”</p><br/><p>Hwang Suk Min’s real objective was to see if Jun Hyuk had the talent to stand on major, international stages with other geniuses instead of being wasted on a TV show like this.</p><br/><p>Two days after Jun Hyuk and the orchestra finished rehearsing, a bus was taking the final 12 participants to the Sangam-dong broadcast station in Seoul.</p><br/><p>There were still more than 12 hours left before the live broadcast, but backstage was noisier than a marketplace, and there were staff members moving busily everywhere. The 12 participants who were standing amidst all of this awkwardly were not the protagonists of the stage, but just props.</p><br/><p>“Everyone listen up. You have to be alert today. Don’t run around. If you need something, tell your manager. These 3 people here are managers for the day. They’ll take care of everything you need.”</p><br/><p>The participants memorized the faces of the three strongly built men.</p><br/><p>“There’s no point in asking other people for what you need. Even if they say okay, it’s not their job… so they’re just answering out of courtesy. You have to make your requests to these 3 people. Keep that in mind.”</p><br/><p>The production team was so busy inspecting the 11 participants excluding Jun Hyuk for the sound, light, stage equipment, et cetera that they did not know how time was flying.</p><br/><p>After finishing his rehearsal, Kwak Hye Sung came backstage and sat down blankly, looking wearier than everyone else. After watching his opponents’ rehearsals, he could not shake the feeling that he would be one of the two eliminations today.</p><br/><p>He could see it in the expressions of the staff after he was done singing. He had seen that they looked bored without any emotion, surprise, or admiration.</p><br/><p>His stage looked like it was included to fill the time. No one showed anticipation for his performance.</p><br/><p>“Try shouting boldly.”</p><br/><p>“Oh, it’s you Jun Hyuk. I heard you’re not rehearsing?”</p><br/><p>“No. We did our rehearsal the day before yesterday.”</p><br/><p>Kwak Hye Sung took the water bottle that Jun Hyuk handed to him and thought of what he just said.</p><br/><p>“But… shout what?”</p><br/><p>“Didn’t I tell you before? I told you to use the technique you used in vocal training to bring change to the song.”</p><br/><p>“Honestly, I don’t have the confidence.”</p><br/><p>“Then what are you going to do? Are you going to sing in this dejected state without confidence?”</p><br/><p>Kwak Hye Sung seemed to be so removed that he did not even want to respond.</p><br/><p>“There’s still a lot of time left. Don’t we start at 10 at night? That’s enough time to practice.”</p><br/><p>“Then can you help me a little? You don’t have rehearsals anyway.”</p><br/><p>“What can I help with? You’re just doing what you know how to do. You can just do it. You’re a lot more apprehensive than you seem.”</p><br/><p>Jun Hyuk left Kwak Hye Sung’s side after he spoke.</p><br/><p>***</p><br/><p>“You handed over the judge and MC scripts?”</p><br/><p>“Yes.”</p><br/><p>“How about the list of eliminations?”</p><br/><p>“I handed them over. Nam Seung Hee and Kwak Hye Sung, right?”</p><br/><p>“Yeah. Also, how is Son Jin Young’s expression?”</p><br/><p>“He seems a little upset. I think he was expecting her to go on air at least twice.”</p><br/><p>“We’re going to be strict from now on. We have to eliminate them in order, since we don’t know if a dark horse might appear.”</p><br/><p>Producer Kim Ki Sik was reviewing the cue sheet one more time before the live broadcast that was approaching in an hour. The players in today’s 1 and a half hour live broadcast would be the 12 participants, the MC, judges, and audience. Producer Kim Ki Sik is the maestro conducting all of these people.</p><br/><p>Before MC Moon Kyung Min who was in charge of proceedings went on stage, he paced backstage while peeking at the audience to relieve his anxiety.</p><br/><p>“What happened? It’s too unilateral.”</p><br/><p>MC Moon Kyung Min was scolding the staff taking care of him. That was how worried he was regarding the audience’s excessive bias.</p><br/><p>“We’re going crazy too. We chose the audience by area and age but…..”</p><br/><p>“Don’t we have to reduce the placards and signs? They’re all Jang Jun Hyuk. You’re going to put this out on air?”</p><br/><p>“Senior, the staff is going around the entire audience switching them appropriately.”</p><br/><p>“I don’t know about anything else, but it’s a huge problem if the other kids’ performances finish and there isn’t a reaction. Practice that with them. It’s a contest with 12 people, not Jang Jun Hyuk’s fan meeting.”</p><br/><p>It was clear that unless it was a family member or friend of the 11 participants, everyone in the audience was there for Jun Hyuk.</p><br/><p>After 2 hours of waiting, the audience complaints began to trickle down. Then, an announcement came out and the stage lights began to dance. The 1st live stage had started.</p><br/>\n</div>"}