{"title": "Chapter 92", "id": 92, "volume": 1, "url": "http://boxnovel.org/gods-song-chapter-92", "volume_title": "Volume 1", "body": "<h1>Chapter 92</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 3 / Chapter 92</p><br/><p>TL: LightNovelCafe</p><br/><p>The writers who came from MV channel the next day were not able to get much out of the interview. No matter how relentlessly they asked for a comment on his performance, he just gave the simple response that he does not know and is sorry.</p><br/><p>If there was anything that they got out of him, it was what was to come in the future.</p><br/><p>“Then if an agency calls, do you intend to sign a contract and continue your activities in music?”</p><br/><p>“Um… I don’t know about an agency. There is a promise I made with Teacher Jo Hyung Joong… We said we’d release a record.”</p><br/><p>“A record? Then it’ll be your debut album?”</p><br/><p>“It’s a bit much to say it’s a debut album. It’s just to commemorate I guess.”</p><br/><p>“Commemorate? Are you saying you’re going to produce an album before going to study abroad?”</p><br/><p>“I haven’t decided on studying abroad yet. We’re going to make our decision slowly.”</p><br/><p>All they got from the interview was that he would be making an album. Jun Hyuk’s producer, Kim Jong Suk, gave a better analysis of last night’s events.</p><br/><p>“Producer Kim. You had a hard time yesterday? He he.”</p><br/><p>“I really… You took 10 years off my life.”</p><br/><p>When Kim Jong Suk suddenly appeared at the station, Producer Kim Ki Sik made a fuss.</p><br/><p>“What 10 years… I’m sure you hit the highest viewer ratings. Don’t you need to buy me a drink?”</p><br/><p>He had gone back and forth between heaven and hell, but they had recorded the best ratings at 17%.</p><br/><p>Kim Jong Suk made a request to the music director to see Jun Hyuk’s videos from the day before, and carefully watched all of the videos of Jun Hyuk’s rehearsal and performance from different angles.</p><br/><p>The music director rewatched the rehearsal video and spoke,</p><br/><p>“You’re really impressive. How did you get this out of Jun Hyuk?”</p><br/><p>“Right? The rehearsal is his real image. What a waste.”</p><br/><p>“Yeah. There’s an overlap with folk singers from the 60s and 70s. Though I’m sure kids these days won’t buy into it…..”</p><br/><p>“It’s okay. That’s enough. I think a good song will come out after time passes and Jun Hyuk is a little older. Whether he sings or not.”</p><br/><p>Producer Kim who was watching from the side was more curious about something other than the music.</p><br/><p>“But what happened? Can you guess?”</p><br/><p>“Well… roughly. I don’t know if it’s right or wrong though.”</p><br/><p>The two men just looked at Kim Jong Suk’s mouth.</p><br/><p>“He’s normal during the rehearsal. And it’s the image that I had wanted.”</p><br/><p>“But then what happened on the stage?”</p><br/><p>“I’m not sure about that either. But this is what I’m thinking. Don’t you think he saw his own image instead of his mother while he was singing on stage?”</p><br/><p>“His own image?”</p><br/><p>“Yeah. His abandoned self. He saw himself as an infant being abandoned through the eyes of his mother singing the song. Don’t you think it could be that his singing became rough and he saw himself pathetically because he saw himself thrown away?”</p><br/><p>Kim Ki Sik had been expecting a grand secret and could not understand. The music director on the other hand, nodded lightly and showed sympathy. Only the singer can know the emotions he felt while he was singing, but they could make various interpretations as the listeners.</p><br/><p>“Then I guess this is Jun Hyuk’s first and last image.”</p><br/><p>“What? What do you mean his last?”</p><br/><p>“Oh, I mean as young Jun Hyuk singing. You think he’ll sing going forward after showing that side of himself? Though it might change when he gets older… Producer Kim. Keep this saved. It’ll become incredible footage. If Jun Hyuk becomes a world-famous musician, these videos will become really valuable.”</p><br/><p>It was then that Producer Kim Ki Sik realized that this video is the most expensive treasure they obtained from this season. Top stations, even international stations, would need to pay MV channel to use this footage. The fee for the footage of Elvis Presley’s first appearance on CBS is $30,000.</p><br/><p>Though his would not be to the point of Elvis Presley, it would become a generous source of income if he even won an award in a competition.</p><br/><p>After Jun Hyuk was eliminated from the audition program, his fans swarmed to the cafe starting early in the morning. They looked around the cafe waiting for him to appear. Yoon Kwang Hun took Jun Hyuk and came out of the cafe. If they stayed any longer, he would be imprisoned in the basement practice room.</p><br/><p>Yoon Kwang Hun stopped by the bank before taking Jun Hyuk to his house.</p><br/><p>“Sir, why are we going to the bank all of a sudden?”</p><br/><p>“We need to make an account under your name.”</p><br/><p>“What? My account?”</p><br/><p>“Yeah. I’m going to move the deposit from your modeling contract to your account. We need to have one made for you.”</p><br/><p>Since Jun Hyuk had never earned money himself before, $20,000 is not an easily quantifiable sum to him. When he first saw the modeling contract, he had been counting the number of zeros on his fingers.</p><br/><p>“And you’ll start getting incentives from the songs you arranged and performed on the broadcast. They said they’ll settle the amount every 3 months, so you really need an account.”</p><br/><p>The average child would be putting the money he received over the holidays into his first bank account. That time is very late for Jun Hyuk, but he had earned an amount that children at his age could not even touch.</p><br/><p>Jun Hyuk opened his first account while receiving courteous treatment from the bank employees and was only able to escape after taking a commemorative photo.</p><br/><p>While they were coming home after, Yoon Kwang Hun wondered,</p><br/><p>“The modeling fee is $20,000… What do you want to do? Is there anything you want to do?”</p><br/><p>“Sir, I think you should just keep the money…..”</p><br/><p>“Why? Why should I keep it when I didn’t earn it?”</p><br/><p>“I told you. I’ll make money and repay your kindness.”</p><br/><p>“This kid. You think $20,000 will cut it?”</p><br/><p>Jun Hyuk started to stutter in surprised at Yoon Kwang Hun’s retort,</p><br/><p>“Oh, no. I’m saying you should keep everything I earn.”</p><br/><p>Yoon Kwang Hun smirked at Jun Hyuk’s surprised face.</p><br/><p>“Later.”</p><br/><p>“Excuse me?”</p><br/><p>“When you make $2million or $20million, I’m going to keep it all. This kid! Lawyer Baek said it too. I used to work with hundreds of millions. $20,000? That’s not even money to me. You use that as pocket change.”</p><br/><p>“But…..”</p><br/><p>Yoon Kwang Hun who had been joking until now spoke seriously,</p><br/><p>“Jun Hyuk, it’s the first time you’ve earned money. Don’t save it and just use it. You’ve never been able to have anything you wanted for 17 years. Have it.”</p><br/><p>Jun Hyuk was walking with an apologetic face when he smiled a little. Yoon Kwang Hun did not miss it and asked,</p><br/><p>“There is something. What is it?”</p><br/><p>“Oh, the truth is… there is something I really want to get, but I don’t think you’ll let me.”</p><br/><p>“Tell me. I’m telling you to do whatever you want as long as it isn’t anything bad.”</p><br/><p>“A motorcycle.”</p><br/><p>“What? A motorcycle? Ha ha.”</p><br/><p>Music, star, model… Because of these words, he had been forgetting for a while that Jun Hyuk is a teenager who likes to look cool.</p><br/><p>“What kind? Is there a model that you have in mind?”</p><br/><p>Jun Hyuk spoke excitedly because he thought that Yoon Kwang Hun would oppose it saying that it is dangerous.</p><br/><p>“You know, Suzuki? The rear shock absorber went up so…..”</p><br/><p>It is an age where bikes that race through traffic look cool. That is, before they see luxury goods.</p><br/><p>“Do you want to see what a real motorcycle is?”</p><br/><p>“A real motorcycle?”</p><br/><p>“Let’s go. See the real thing.”</p><br/><p>Yoon Kwang Hun brought Jun Hyuk back to the cafe and got in the car to go to Seoul. Where they went was not a neighborhood motorcycle shop, but a blaring specialized dealership with impressive motorcycles.</p><br/><p>“These are real motorcycles. What do you think?”</p><br/><p>Jun Hyuk was already standing in front of a red motorcycle, speechless as if in a trance. It was so polished that he was scared to even touch it.</p><br/><p>Jun Hyuk stood staring at it and slowly reached a hand out to stroke the red motorcycle.</p><br/><p>“Ducati Monster 696. You picked a good one. Masterpiece of masterpieces. The shock absorber Suzuki 125cc is just a tractor. This is what you call a motorcycle.”</p><br/><p>With Jun Hyuk’s modeling fee, he would only be able to afford the Monster model which is the lowest of the middle level Ducatis. The bigger problem was that they are really monsters that are too powerful for a beginner to handle.</p><br/><p>“Wow, your father is awesome. Gifting a Ducati to his son.”</p><br/><p>An employee approached the two as he started his small talk.</p><br/><p>“Wow – your son is really a model. He’s tall and handsome. It looks like this one found its rightful owner.”</p><br/><p>The employee stroked the Ducati and looked back and forth between the bike and Jun Hyuk when he started stammering,</p><br/><p>“Are… Are you Jang Jun Hyuk? Tomorrow’s Star? Right?”</p><br/><p>However, Jun Hyuk was so enwrapped by the motorcycle that he did not hear him.</p><br/><p>“Yes, that’s right. But we’re not buying right now. We just came to look today. He doesn’t have a license yet. We’ll come back once he gets his license.”</p><br/><p>“Oy, look all you want.”</p><br/><p>The employee called the dealership manager who had left while the two were looking at the bike. There was no windfall like the appearance of such a rising star.</p><br/><p>“Boss, hurry up and call headquarters to tell them that Jun Hyuk is here. Don’t we need to give him a lot of discounts? We’re getting free advertisement.”</p><br/>\n</div>"}