{"title": "Chapter 114", "id": 114, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-114", "volume_title": "Volume 2", "body": "<h1>Chapter 114</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 3 / Chapter 114</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: JH is too OP for his own good huh? lol]</p><br/><p>“Push my morning flight tomorrow back a day. Yeah… I’m going to leave the day after tomorrow. I need to stay an extra day… There’s nothing I can do. Adjust my schedule in Philadelphia… Yeah…”</p><br/><p>Bruno Kazel came out of Jun Hyuk’s room and changed his itinerary to return to Philadelphia. It was not that he did not realize this is a nuisance to his manager, but he felt that there would be lingering regret if he just went back like this.</p><br/><p>Bruno Kazel left the room, but Danny could not get out of his shock. It has already been 3 months since they shared a room. He had thought that they had gotten a lot closer and that he knew Jun Hyuk well. But he realized today that he had been mistaken in thinking that he knew his roommate well.</p><br/><p>Since the first time he got in trouble for reading a score first, he had not even looked at Jun Hyuk through the side of his eye when he was composing. Danny meant to respect Jun Hyuk’s solemn consciousness. He did not know why, but Jun Hyuk always sent his songs to Korea when he completed them. It was not even in an e-mail, but postal with the paper score.</p><br/><p>Scores he sent at least once a week. Danny hated himself for not even taking a peek at them. If he had seen even a little, he would have been able to notice Jun Hyuk’s true self.</p><br/><p>He needed to push all other thoughts in his head and ask the most important question. Danny cautiously opened his mouth,</p><br/><p>“Jun. A slow development with advancement one step at a time… Does that mean there’s a lack of talent?”</p><br/><p>“What?”</p><br/><p>“You said it just now. Amelia has the potential to jump over a wall but I don’t.”</p><br/><p>“Yeah. I think so.”</p><br/><p>Danny dropped his head when Jun Hyuk responded without a second of hesitation.</p><br/><p>‘Oy. This kid grew up in a lenient environment. He has a fragile mentality.’</p><br/><p>Jun Hyuk started laughing.</p><br/><p>“Hey, Danny. Are you misunderstanding me?”</p><br/><p>“What?”</p><br/><p>Danny still had his head down.</p><br/><p>“Do you think I’m saying that Amelia is a genius and that you’re just average?”</p><br/><p>“Isn’t that what you meant?”</p><br/><p>“It’s very different.”</p><br/><p>Jun Hyuk was trying to come up with a way to explain the difference between Amelia and Danny when he thought of two musicians.</p><br/><p>“Hm… Do you like jazz?”</p><br/><p>“Of course.”</p><br/><p>“Who’s better? Miles Davis or John Coltrane?”</p><br/><p>“Hey! How do you pick? They’re both amazing.”</p><br/><p>“Right? Aren’t they both geniuses?”</p><br/><p>“Of course.”</p><br/><p>A great alien who unluckily crash-landed on this planet from space, the king of jazz, Miles Davis.</p><br/><p>When major record label Columbia gave a scouting offer in 1955, he was already under a contract with Prestige Records.</p><br/><p>To cancel the contract, he would need to release as many albums as the agency had demanded. The saxophonist who joined then was John Coltrane.</p><br/><p>In order to figure out the problem of the dual contracts with Columbia and Prestige, Miles Davis needed to record with Prestige more. In 1956, he ended up recording 4 albums for the so-called ‘in’ series ‘Steamin’’, ‘Relaxin’’, ‘Workin’’, and ‘Cookin’’. This record became one of the best in Hard Bop (spirit of jazz that is melodic and funky).</p><br/><p>“Miles Davis made two albums a day, four albums in two days. That kind of music comes out even if he is improvising and playing without much thought. But what about John Coltrane? He’s someone who really made an effort, practicing until he went to sleep. Going up one step at a time.”</p><br/><p>Danny finally lifted his head when Jun Hyuk compared him to John Coltrane.</p><br/><p>“They both called geniuses now. This is the difference between you and Amelia. And… you think anyone can become John Coltrane with just the effort? It’s impossible. Whatever you say, John Coltrane is a genius with a tremendous talent.”</p><br/><p>Danny’s face brightened when Jun Hyuk admitted that he is a genius. He could not help it because he had dedicated himself to an area where talent is most important. With a large palate (roof of the mouth), it is possible to make a good sound with stringed instruments. It is a world where even the shape of one’s mouth is a determining factor in the ability to enter the first class.</p><br/><p>“You’re just different kinds of geniuses. Didn’t you win in the Montreal junior competition that all violinists under 16 went out for? At age 11? You think that’s possible through effort alone?”</p><br/><p>Jun Hyuk tapped Danny’s shoulder and smiled.</p><br/><p>“I told you to have confidence. If you don’t stop trying, you can become the greatest violinist. And someone like you lasts for a long time, people like Amelia are uncertain. You don’t know when they might collapse.”</p><br/><p>Danny spoke carefully again,</p><br/><p>“Then what about you?”</p><br/><p>“Me? I was born with an unimaginable genius plus effort. You didn’t know?”</p><br/><p>***</p><br/><p>Bruno Kazel came out of Jun Hyuk’s room and ran back to the party. He found the professors still drinking beers and went next to them.</p><br/><p>“Professor, let’s perform again one more time tomorrow.”</p><br/><p>“Excuse me? Tomorrow?”</p><br/><p>“Yes. I would like to perform just the piano concerto on stage one more time.”</p><br/><p>To the professors, reopening a performance that the maestro had not been satisfied with was a grateful thing for the students. The students would welcome being able to see such a great’s command for two days in a row. However, the maestro’s continued words made everyone silent.</p><br/><p>“Only, I would like to leave the command to composer Jun.”</p><br/><p>“Jun as the conductor?”</p><br/><p>Not just the professors but the students began to murmur. It was not strange or new for a composer to command his own song. It was not even important that Jun Hyuk is a freshman or even that he is young. It is not uncommon for a classical musician to command as a teenager.</p><br/><p>It was just shocking that Bruno Kazel himself was making this request. They did not know what he had discovered in Jun Hyuk’s song, but the maestro wants to hear the performance from the composer himself.</p><br/><p>“That… that would be an honor for us. Is it that you would like to teach Jun Hyuk command?”</p><br/><p>“No. I would just like to watch Jun Hyuk as a conductor. Will that be alright?”</p><br/><p>This meant that Bruno Kazel had accepted Jun Hyuk as a fellow conductor.</p><br/><p>“Of course.”</p><br/><p>With the end of this conversation, the students who had been drinking bottles of beer, scattered. The CH orchestra members were thinking that they would finally know the identity of the rumored kid. The other students disappeared to text those who had not been present at the party.</p><br/><p>Early the next morning, Jun Hyuk and Amelia were called to Professor Randall who told them about Bruno Kazel’s proposition from the night before. They could guess why Bruno Kazel had made this suggestion. Only four people knew of last night’s events.</p><br/><p>“What do you think? I’m sure it’s a yes?”</p><br/><p>Professor Poster saw Jun Hyuk hesitate and continued his cautionary words.</p><br/><p>“Maestro Kazel asked this of us because he said that he would like to see you command… It would be ill-mannered to to reject.”</p><br/><p>“I’m okay with it but…..”</p><br/><p>Jun Hyuk looked sideways at Amelia and watched her expression. Amelia turned to Jun Hyuk instead of the professor to speak,</p><br/><p>“Then Jun, give me time to practice separately. I’ve played this song with the orchestra plenty of times, so is there a need for me to go into rehearsal again?”</p><br/><p>“Of course. Do what you want. Then I’ll see you at the concert.”</p><br/><p>They stood up before listening to Professor Randall’s response.</p><br/><p>‘Don’t those two have a friendly relationship?’</p><br/><p>Professor Poster who did not know anything of last night’s events had a bad feeling about tonight’s performance.</p><br/>\n</div>"}