{"title": "Chapter 116", "id": 116, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-116", "volume_title": "Volume 2", "body": "<h1>Chapter 116</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 3 / Chapter 116</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: Flag! BTW I’ve set up so that donations can be applied towards sponsored chapters. Check out homepage for deets!]</p><br/><p>When Jun Hyuk came back to his dorm, he found Amelia waiting for him in front of his door. The difference from last time was that she did not have a harmonica or a bright expression. But the reason why she was there was the same.</p><br/><p>“Jun, can we try playing it one more time?”</p><br/><p>“Again?”</p><br/><p>“I want to feel what I felt during the performance again. Let’s do it one more time.”’</p><br/><p>Even if they play it again, it would be difficult to reproduce it. She would need to meet a song destined for her in a more dramatic space without a place for her to escape to, in order to bring up that emotion again.</p><br/><p>Jun Hyuk could not reject Amelia’s earnest eyes.</p><br/><p>“Alright. But it’s just one time.”</p><br/><p>The two went looking for a practice room, but all of the rooms with two pianos were full. All of the students who had watched today’s performance had already taken the rooms. Amelia’s passionate 4th part had excited them.</p><br/><p>“It’ll be hard to perform like this.”</p><br/><p>They need two pianos if Jun Hyuk is going to perform the orchestra part. Amelia sighed in disappointment. Jun Hyuk sighed as well.</p><br/><p>“Well there’s nothing we can do. Let’s go to my room. I’ll just play it on the guitar instead of the piano. It might be a little weak though.”</p><br/><p>“The guitar is good too. All I need is to think of the orchestra accompaniment as I play. I’ll just ask you for the melody.”</p><br/><p>Amelia was just thankful that Jun Hyuk was accepting her request. When they got back to the room, Jun Hyuk connected his electric guitar to the amp to handle the loud sound of the grand piano and adjusted the volume.</p><br/><p>“Alright, let’s try it. Don’t rush it even if it doesn’t work.”</p><br/><p>Even if the electric guitar is called a 6 string orchestra, it is difficult for it to replicate an orchestra’s power and various sounds. Amelia played the piano without much change from the concert. The result would have been the same even if she played with a piano instead of the guitar.</p><br/><p>Even though they repeated the performance three time instead of playing it once, there was no change. However, Amelia did not get angry or gloomy because she was surprised to find that there were times when the piano strings rang tenderly. If she does not forget the feeling at that moment, she could just realize the rest when she needed to.</p><br/><p>Amelia closed the cover of the piano with a bright face.</p><br/><p>“Jun, your guitar is no joke.”</p><br/><p>Jun Hyuk had expressed the delicate and abundant orchestra part by fingering with his two hands.</p><br/><p>“Of course. I love the guitar as much as I love the piano. The guitar is much sexier than the piano as well. Ha ha.”</p><br/><p>Jun Hyuk hugged his guitar to him and put his lips to it.</p><br/><p>“Really? Then what song do you think is the sexiest?”</p><br/><p>Amelia looked at Jun Hyuk with wide eyes.</p><br/><p>“Of course John Coltrane’s Lush Life. It’s the best. How about you?”</p><br/><p>“Me? Mine is Ravel’s Bolero. This isn’t just sexy. It’s music that makes you feel what sex is.”</p><br/><p>Jun Hyuk was surprised when Amelia said the word sex without hesitation. He understood and felt the open culture of the west, but it was the first time he had heard a female say the word sex in a conversation.</p><br/><p>Amelia turned on the laptop sitting on Jun Hyuk’s desk and looked for Ravel’s Bolero on YouTube.</p><br/><p>It is a Latin dance song from Spain with a slow tempo. The strong accent of the Spanish song brought a slow and dreamy feeling.</p><br/><p>The unique point was that the same theme was repeated on different instruments. It is a great song that shows that the melody, rhythm, and harmony of music are not the only important factors but also the timbre.</p><br/><p>A repetition of the same melody and rhythm in order of the flute, clarinet, bassoon, oboe, and trumpet. This great music that shows a different emotion with each instrument makes it feel like the listener had been watching one person dance while it ends up with everyone dancing.</p><br/><p>“Oh, there’s a performance by Maestro Jean Martinon.”</p><br/><p>While Ravel’s Bolero flowed from the laptop, Amelia slowly danced to the song. While moving her body in a way most appropriate for the song, she began taking her clothes off one by one, starting with her jeans.</p><br/><p>“But did you know that Ravel’s Bolero is only 15 minutes?”</p><br/><p>Jun Hyuk spoke as he admired Amelia’s beautiful body.</p><br/><p>“We can listen to it three or four times on repeat. Why? Is it too little?”</p><br/><p>“Three or four times won’t cut it. I really like Bolero too.”</p><br/><p>***</p><br/><p>Danny came back to the dorm with a few bottles of beer. He was sure that his roommate who liked to be alone would be sitting at his desk, transferring his thoughts on today’s thoughts on sheet music.</p><br/><p>Danny wanted to drink with Jun Hyuk quietly and hear his thoughts on today’s performance.</p><br/><p>When he opened the door, Jun Hyuk was not sitting at his desk but on his bed with his bottom half wrapped in his sheets. There were items of clothing all over the floor and his bed was already a mess.</p><br/><p>When he was about to say something in surprise at Jun Hyuk’s unexpected state, Jun Hyuk quickly pointed a finger to the bathroom. They could hear the sound of a shower.</p><br/><p>Danny quietly put the bottles down and mouthed ‘Amelia?’ When Jun Hyuk laughed and nodded, Danny covered his own mouth and put his thumb up. He quietly backed out of the room and made sure to lock the door.</p><br/><p>Amelia finished her shower and came out of the bathroom with a towel around her to find the bottles of beer.</p><br/><p>“You thirsty? I brought these.”</p><br/><p>When Jun Hyuk spoke slyly, Amelia laughed as she picked up a bottle. She had heard the door open and close while she had been in the shower. She had guessed that Danny had come and gone. She also knew that Danny would not return tonight.</p><br/><p>Jun Hyuk searched on his laptop and a low and slow saxophone sound came flowing out.</p><br/><p>“Now, don’t we need to hear my song? John Coltrane’s Rush Life.”</p><br/><p>“How many minutes was that song?”</p><br/><p>“14.”</p><br/><p>“It’s too short.”</p><br/><p>“It’s okay. We can put it on a loop.”</p><br/><p>Jun Hyuk took the towel off of Amelia and threw it.</p><br/><p>***</p><br/><p>“Again? Hey, look at a score or play the piano or the guitar. Is Amelia a score? Is she an instrument?”</p><br/><p>“I’m Amelia’s piano. Ha ha.”</p><br/><p>Amelia was always in the room before Danny and she had no thoughts of leaving. He was fine with it for the first one or days, but Danny was starting to get angry after a week.</p><br/><p>However, he could not turn down Jun Hyuk’s wish for him to excuse them until the winter break at least.</p><br/><p>After the night of the performance, Danny needed to sleep in Amelia’s room. Her roommate did not care that Danny was sleeping in Amelia’s bed. She was always walking around the room in her underwear and did not hesitate to shower with the door open. In her eyes, Danny did not exist.</p><br/><p>Danny was actually more uncomfortable. He did not know where to look in the mornings, and pretended to sleep until she left the room.</p><br/><p>He hoped that Jun Hyuk would not fall too hard for Amelia. The life of musicians. Especially two people like Jun Hyuk and Amelia with promising futures date on the premise of breaking up.</p><br/><p>It is a life of traveling the world to perform. No matter how in love they are, they would be lucky to meet a few times every year. Out of sight, out of mind. On top of that, there was no guarantee that the affection of Amelia, the passionate Latino, would last forever.</p><br/><p>“Jun, Latin women are so scary they shoot their cheating boyfriends to death. Be careful.”</p><br/><p>Danny could only warn Jun Hyuk to maintain an appropriate line.</p><br/><p>He thought that the gossip that Jun Hyuk had taken the school’s greatest beauty would be everywhere, but it had not become a hot topic because of the news that Bruno Kazel had assessed Jun Hyuk as the future conductor of the New York Philharmonic.</p><br/><p>***</p><br/><p>Once one semester passed, It was much easier to listen and speak. It was English he had already learned 2 years ago from Yoon Kwang Hun. It was just that the English in his head had started coming out of his mouth and coming in through his ears.</p><br/><p>The lectures in the strange accent were still hard, but he was getting used to the other classes and even finding them interesting.</p><br/><p>He was not memorizing a textbook. There is no curriculum either. The teachers and Jun Hyuk take a topic and exchange their thoughts. It is not the way calculus equations are solved. He learned the definition of calculus, the kinds of challenges it solved, and its usage. The lessons were conducted by connecting Newton and Einstein with the laws of gravitation, an endless loop of calculus, gravity and gravitational concept.</p><br/><p>Classical and European history as its background were especially interesting. It was great information about musicians’ careers and how they changed society.</p><br/><p>The classes were not hard or boring in any way. Jun Hyuk could ask whatever he wanted and the professor delved deeper into the topic by asking more questions instead of giving an answer.</p><br/><p>The students started to pack their bags in the last week of December. They are getting ready to go back to their hometowns for Christmas and a two-month break.</p><br/><p>Students from wealthy families received separate lessons and people like Amelia who are stars in their countries were busy touring.</p><br/><p>Jun Hyuk had been extremely interested in studying during the first semester and wanted to remain at school to make up for where he fell short.</p><br/><p>Jun Hyuk sent Amelia away at the airport after turning down the offer to tour Argentina with her, and returned to an empty dormitory.</p><br/><p>“Don’t cheat on me or else. I have 7 brothers.”</p><br/><p>Amelia did not forget to give a warning before getting on the plane.</p><br/><p>Danny also went back to Canada after saying that he would completely master the violin song that Jun Hyuk gave him.</p><br/>\n</div>"}