{"title": "Chapter 110", "id": 110, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-110", "volume_title": "Volume 2", "body": "<h1>Chapter 110</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 3 / Chapter 110</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: Here is your bonus chapter today! Please take the time to thank our donors for making this possible.]</p><br/><p>The pianist audition began one week later.</p><br/><p>There were only 4 candidates for the piano soloist. To be honest, it is not configuration that brings joy to the pianist and it is not a song in which the pianist stands out. Furthermore, there were few applicants because most pianists had gone to Paris to participate in the Long Thibaud Competition.</p><br/><p>However, the greatest reason is that there are a lot of students who gave up on trying to play the piece. At first, they approached it with ease because of the calm melody. After 20 something minutes of carefully playing the piano as if handling a glass, their shoulders became stiff.</p><br/><p>It did not go beyond the professors’ expectations. It is a song difficult to handle for a young and hot-blooded pianist because it requires extreme patience without any emotion.</p><br/><p>On the stage with two grand pianos, Jun Hyuk was sitting at one. He will be playing the orchestra part.</p><br/><p>The soloist applicants were all puzzled because they did not know why he was sitting there, but became shocked at the professors’ explanations.</p><br/><p>By the progression of the piano, they had expected the composer to be a mature graduate student. But a freshman? On top of that, the rumored Asian kid.</p><br/><p>The heaviness they felt from the audition was about to disappear because of their shock. However, the piano was still hard.</p><br/><p>Jun Hyuk did not pay attention to the pianists’ performances and kept playing the orchestra part quietly. There is no need to match it to the pianist. No matter how the 4 pianists play, he needs to quietly play it in the same way. Is it not a fair audition?</p><br/><p>Amelia went third. She was also the only pianist who had not been surprised when she saw Jun Hyuk.</p><br/><p>It was just that one week was too short of a time for her to learn pianissimo perfectly. It was hard for Jun Hyuk to follow Amelia as she began to come crashing down at the start of the 3rd part. The short 3rd part ended and when the 4th part began, she exploded in a proper performance. Her strength left such an impression that the judges forgot about the mistakes she made in the 3rd part. When the song ended, Amelia left the theater as though running away. She knew that Jun Hyuk wrote that song for her, but she was feeling guilt for ruining it.</p><br/><p>When the four pianists’ performances ended, the professors were frowning and looking at the scorecards. As their expressions indicated, none of the performers had caught their eye.</p><br/><p>“What we had been dreading has happened.”</p><br/><p>“Right? It seems this piano is not fitting for the young students.”</p><br/><p>“There wouldn’t be a reason for a 20 year old who can handle this song to be at our school. He or she would have already been successful as a pianist.”</p><br/><p>“It seems a freshman has given us a proper assignment. It’s like a bomb.”</p><br/><p>“Wasn’t Amelia the best among them?”</p><br/><p>“The 4th part was really impressive. But since she can’t last until the 3rd part…..”</p><br/><p>While the professors were lamenting, Professor Randall Poster jumped up from his chair and went on the stage.</p><br/><p>“Jun, can you try playing the piano?”</p><br/><p>“Excuse me? Me?”</p><br/><p>“Yeah. Just in case. If there isn’t a fitting pianist, you’ll have to perform. We need to be respectful to the maestro. We can’t send him a lacking pianist from our school.”</p><br/><p>Unlike the words he was saying, Professor Poster had a faint smile. It seemed he was anticipating Jun Hyuk’s piano more than he was worried.</p><br/><p>The professors in the seats also looked full of anticipation. Would the composer have created the song after figuring out all of these challenges?</p><br/><p>“I’ll play the orchestra part for you, so let us hear it one time.”</p><br/><p>Jun Hyuk started pressing the keys carefully. He played the piano until the 3rd part, barely pressing his fingers down as though washing a crystal champagne glass with a cloth, and then freed his suppressed fingers for the 4th part. It was as though he was expressing Amelia’s passion.</p><br/><p>When he finished performing even the 4th part successfully, the professors brightened. If Jun Hyuk were to play, they could have the performance without issues.</p><br/><p>Professor Randall Poster was the only person who kept sighing. Why isn’t this outstanding boy majoring in the piano? It was the moment he decided he would make Jun Hyuk take lessons no matter what.</p><br/><p>After he finished playing the piano, Jun Hyuk said something the professors had not been expecting at all,</p><br/><p>“Professor, I have no intention to play the piano at the performance. If I end up playing the piano, the 4 people who auditioned today will have practiced for nothing. If it’s too hard to choose a pianist, I think it’s ‘fair’ to take my song out. Then.”</p><br/><p>Jun Hyuk bowed his head slightly and left the stage. The soprano candidates would be coming in soon. He ran into Alexander Dubchek who had been waiting to see the sopranos audition for his song. Alexander was already dazed from hearing Jun Hyuk’s piano. Not just composition, but he can play the piano perfectly?</p><br/><p>Jun Hyuk greeted him lightly and ran out while holding back his laughter. It was too funny no matter how he thought about it.</p><br/><p>‘An old lady’s emotion with that face… It’s a mystery.’</p><br/><p>Once all of the auditions were over, the professors were scrutinizing over the pianist. Jun Hyuk had made it clear that he would not play the piano. What an embarrassment it would be if they did not have a proper pianist after inviting a maestro.</p><br/><p>“Let’s choose Amelia who the best for now. There’s nothing we can do but give her special lessons until the performance.”</p><br/><p>“But isn’t her teacher, Professor Greenfield, in Paris right now because of Long Thibaud?”</p><br/><p>The professors all looked at Professor Randall Poster.</p><br/><p>“I’m okay with it as long as Amelia is willing to do it.”</p><br/><p>There is no reason for him to turn down the chance to teach a junior with outstanding talent. Professor Poster accepted it happily.</p><br/><p>Bruno Kazel, conductor of the Philadelphia Philharmonic, read through the score he received in his e-mail and let out a low sigh. This sigh was of condolence rather than admiration from seeing extraordinary music.</p><br/><p>The song is exceptional. It just does not have a youthful wit. It felt like he was seeing an old relic wearing a curly haired wig, shorts, stockings, and leather shoes. It was to the point where he thought he was seeing Haydn.</p><br/><p>‘Are there still youngsters these days writing music like this?’</p><br/><p>Bruno Kazel had been defined as an innovatory maestro and had happily accepted the invitation to command at Clayton University.</p><br/><p>He wanted to enjoy the pleasure of the youth’s songs that destroy form.</p><br/><p>But this year’s selection is a strict classical. The title is a piano concerto, but it is a song where the piano is the most important.</p><br/><p>It is a song that drags the pianist into the 18th century. He opened the file for the score that came in joint 1st place with a bitter feeling about this song that did not meet his expectations.</p><br/><p>The title is The Concerto for 3 Sopranos. It is a fun song where the sopranos battle for 8 minutes. It did seem a little rushed, but he thought that there really was a youthful feeling to it.</p><br/><p>Bruno Kazel slowly looked through both of the scores again and sat in front of the piano. He had realized that the song like Haydn’s music did not have an ordinary piano.</p><br/><p>When he was done with the 1st part, his fingertips ached. As he thought of how the orchestra would sound in his head and played the piano, he had to show extreme simplicity.</p><br/><p>‘What is this song?’</p><br/><p>It seemed as though he had kept Chopin or Liszt in mind when he was making a Haydn song. He wondered if there was a pianist among the students at Clayton who could play this type of song.</p><br/><p>It would have to be an already famous pianist to play this song. Does this mean that there is a hidden gem at Clayton? Does Clayton School of Music mean to introduce this gem to him?</p><br/><p>‘I’ll have to go to New York a little early.’</p><br/>\n</div>"}