{"title": "Chapter 130", "id": 130, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-130", "volume_title": "Volume 2", "body": "<h1>Chapter 130</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 130</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: Saturday dose coming to ya early!]</p><br/><p>“I emphasized pianissimo to reduce Amelia’s strength… but once I explode, I don’t know what moderation is.”</p><br/><p>“But you’re able to direct pianissimo and fortissimo however you’d like.”</p><br/><p>“Well that’s not mine. You know that’s just the reproduction of other pianists.”</p><br/><p>“So? Do you now want to properly express your bloody rage?”</p><br/><p>Jun Hyuk looked at Yoon Kwang Hun with surprise. How could it be that there is nothing he does not know? Jun Hyuk’s face suddenly told red.</p><br/><p>“You knew?”</p><br/><p>“Yeah. I’ve heard it just once before.”</p><br/><p>Yoon Kwang Hun recalled Jun Hyuk’s moonlight sonata. His face became calm again.</p><br/><p>“I see. Well… I’m sure you know what I’m going to say since you’ve heard it.”</p><br/><p>He has matured quite a lot. He is able to speak calmly about the anger inside him that he had so concealed. Yoon Kwang Hun had the thought that sending Jun Hyuk to study abroad was one of the best things he had done.</p><br/><p>“I’ll have to refine my own color during the new semester. I’m thinking of creating a unique color for myself.”</p><br/><p>Famous pianists need to have their unique color. Yoon Kwang Hun could figure out Jun Hyuk’s real reason for ripping up the contract with LA Sound.</p><br/><p>What Jun Hyuk is seeking is music, not success. He thought he was going to cry again when he thought of how well Jun Hyuk is growing up. Yoon Kwang Hun quickly spoke to avoid an awkward situation,</p><br/><p>“Have you met a good professor for lessons?”</p><br/><p>“Everyone at the conservatory is a teacher. When I see their intense efforts, it makes me want to keep doing something.”</p><br/><p>Yoon Kwang Hun recalled something he had been forgetting because of the mention of professors.</p><br/><p>“Oh right. Do you remember Professor Jeon Hye Jin?”</p><br/><p>“Yes. The chatty old woman.”</p><br/><p>“What? He he. Yeah she is a bit talkative. Anyway, give that professor a gift.”</p><br/><p>“Why? Did something happen?”</p><br/><p>“Every time Professor Jeon Hye Jin has a concert, you know your piano song? The last track in your album, Close.”</p><br/><p>“Yes.”</p><br/><p>“She always performs that song. It’s fixed in her encore repertoire. And she’s been on TV before where she played that song and praised you a ton. A lot of your albums were sold thanks to her.”</p><br/><p>He could imagine how that talkative and nosy, kind woman acted.</p><br/><p>“Ah… I see. What do I send her? Should I get her an expensive bag that old women like?”</p><br/><p>“Hey. You think she doesn’t have expensive bags? Not stuff like that, but something she would really appreciate.”</p><br/><p>“What is that? Just tell me. Don’t you know what old women like since you’re an old man?”</p><br/><p>“This brat! It’s not an issue of old women and old men. Make a piano song for her. You’ve gotten a lot from her until now.”</p><br/><p>As soon as Jun Hyuk thought of a song that would be perfect for that talkative woman, he started laughing already. He thought of a comic accent that would not be appropriate for her powerful and incredible piano skills.</p><br/><p>Just then, a music video flowed from the TV they had left on without much thought. Both men who were half lying on the bed bolted into a seated position. Two types of music that did not go well together at all mixed to stimulate their eyes and ears.</p><br/><p>There is an odd feeling to the unbalance between the music and video. Yoon Kwang Hun was lost in the screen while Jun Hyuk in the music.</p><br/><p>When the 5-minute video ended, they looked at each other.</p><br/><p>“What… What on earth is that?”</p><br/><p>“I’ll say. It’s really irksome.”</p><br/><p>“Isn’t that on the verge of child abuse? Goodness.”</p><br/><p>Their jaws were dropped at the shocking Japanese music.</p><br/><p>“We saw on TV yesterday. There’s something that a metal band and girl group were mixed to make…..”</p><br/><p>“Oh, that band is pretty popular these days. They’re so popular that they have their own concert. It’ll probably be Baby-Girl Metal.”</p><br/><p>The Japanese supervisor coordinating their work now had an interesting expression regarding Yoon Kwang Hun’s question.</p><br/><p>“The girls are so young.”</p><br/><p>“Two are elementary school students or something and the main vocal is a high school student? Well… it’s pretty common to see idols in elementary school here.”</p><br/><p>It has been said that the age of Korean and Japanese idols has been getting younger because of the increasing number of kidults.</p><br/><p>“But why is the band in charge of the accompaniment wearing masks?”</p><br/><p>“Because they’re embarrassed.”</p><br/><p>The Japanese supervisor’s expression changed from that of regret to the affirmative.</p><br/><p>“They’ve covered their faces because they’re embarrassed that they’re just performing behind a girl group. They perform without their masks as well, but who they really are is shrouded in mystery.”</p><br/><p>The reality is that it is becoming more difficult to be a rock band in Asia.</p><br/><p>“The main vocal of the girl group is pretty good.”</p><br/><p>“Yes. But if you just configure a group with a main vocal, it’s only a female vocalist metal band. And the music needs to change a lot.”</p><br/><p>Jun Hyuk wondered who it was who was able to make this music by a band of a bizarre combination as it was not bad.</p><br/><p>“It’s just a hit created through the planning of a record label. Since it’s a combination of a metal band and cute girls, it isn’t awkward no matter what kind of music they touch and it’s a given that they’ll have a fan base.”</p><br/><p>Jun Hyuk remembered that Alex Zakin said ‘music that sells’. A record label has the very important role of ‘planning’ in order to create music that sells.</p><br/><p>“It means that the Japanese market for music is that hard. Since they can’t break into the international market through like Korea with its Hallyu movement, they need to come up with all sorts of ideas.”</p><br/><p>Japanese record labels are most envious of Hallyu. Japanese popular music has not been able to the international realm since the 80s. There was no need to look overseas when domestic demand is large and robust.</p><br/><p>“If Mr. Jang were to have activities in Japan, he will really become a superstar. He is able to work with a variety of genres and has outstanding looks. He would have fans of each genre and even old women who love Hallyu… Honestly, it’s just a pity for us. Ha ha.”</p><br/><p>At the end of the supervisor’s expression of regret regarding Jun Hyuk, they began discussing Jun Hyuk’s promotion schedule.</p><br/><p>There is no way to express how tiring the interviews with the three magazines were. They focused on Jun Hyuk’s unfortunate past rather than on his music. However, the following joint interview with five power bloggers was so fun that his mood lightened.</p><br/><p>They had the temperament of nerds no matter who looked at them and they relentlessly asked Jun Hyuk about each song in the album. When they even had a sharp question analyzing the variations with the classical chord hidden in the music, it was suspicious whether these people were just bloggers or music critics.</p><br/><p>When all of the interviews were complete, he had to go to a photo shoot for an album package that would be sold as limited edition for promotional reasons.</p><br/><p>This shoot with meticulous Japanese people was harder than the time he worked with XOR. It was dawn when they finished the shoot.</p><br/><p>His promotions ended sign meetings in Tokyo and Osaka. The fun aspect was that most of the people who waited on the long line to get Jun Hyuk’s signature were men.</p><br/><p>Yoon Kwang Hun rejected the Japanese company’s request to extend Jun Hyuk’s promotion period and basically chased Jun Hyuk back to America. He did not want to waste Jun Hyuk’s precious time in Japan when he had such a clear goal ahead of him.</p><br/>\n</div>"}