{"title": "Chapter 136", "id": 136, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-136", "volume_title": "Volume 2", "body": "<h1>Chapter 136</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 136</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: Hey Guys! Here is your new installment. We’re getting closer to seeing conductor Jun huh? How do you think he will be?]</p><br/><p>As soon as the notice came up on the campus intranet, the school was flipped inside out. The students who were already sure to be soloists did not pay attention, but most of those who were not had a hunch that another opportunity had come.</p><br/><p>They could stand on stage for a whole 4 days at this music festival where the greats of each area participate. The vocalist students were most enthusiastic because it is an opera, a rare experience.</p><br/><p>It is also a golden opportunity to show how they conduct an orchestra in front of the best maestros.</p><br/><p>However, they need to choose between all of the students that gathered from the 3 schools. They could pick a few students for the instrumental parts, but there is only one conductor. There were also a lot of students who gave up early when they heard that they would be conducting an opera in Salzburg.</p><br/><p>The judges were composed of professors from all three schools to ensure fairness. The stage was covered with a white cloth, so they could not know who is performing. The judges just wrote their scores on an evaluation sheet with the participants’ numbers printed on them.</p><br/><p>The people with the highest scores take the 1st and 2nd instrumental parts.</p><br/><p>The students’ hopes that each school would have 20 people chosen, came crashing down. Juilliard took most of the spots for an orchestra configured on skill alone, and there were only 10 performers selected from Eastman. Fortunately, the bandmaster who is the concertmaster is from Eastman, so it felt like they had saved face.</p><br/><p>However, Juilliard was not comfortable either. There were not many applicants from Clayton and their chances to succeed in the audition exceeded 50%.</p><br/><p>When the orchestra configuration ended, the audition for opera vocalists began. This is the audition that surprised the judges most. Most of the applicants showed abilities beyond their expectation.This is especially the case with a soprano who had such surprising skill that the common opinion was that she was suitable to be a primadonna.</p><br/><p>When participant number 4 started singing Bellini’s opera Norma, Casta Diva, the professors could not hide their shock. A perfect bel canto vocal rang throughout the theater.</p><br/><p>Bel canto means beautiful song and it is often called ‘the most beautiful sound that a human can express’.</p><br/><p>The soprano is as light as a butterfly flying away and expresses the splendor of the treble, but there needs to be a voice like a treble while being able to handle a heavy weight with the treble. Contrary to this, the falsetto is sung with only high notes.</p><br/><p>Bel canto is considered the ideal technique for Italian operas and Mozart’s opera.</p><br/><p>It was to the point where the judges thought that they were at a concert instead of judging.</p><br/><p>“Participant number 4 is of an entirely different level.”</p><br/><p>“It’s not just that she was born with a good tone, but the stability shown in the treble is key.”</p><br/><p>“The expressiveness is incomparable with other participants.”</p><br/><p>As the judges’ praises continued, a Juilliard professor smiled arrogantly. The other judges saw the smile and realized that the participant is from Juilliard.</p><br/><p>“Good, right? She’s only 19 years old.”</p><br/><p>If the soprano from a 19 year old is to this extent, it is normal to already be famous as a born soprano with rave reviews. However, the professors were sure that this is the first time they are hearing this rookie.</p><br/><p>“With a student like this, there’s no way we wouldn’t know…..”</p><br/><p>When the professors spoke with suspicion, the professor showed a confident smile.</p><br/><p>“She was admitted this year. She is not widely known because she was discovered this year.”</p><br/><p>“By chance?”</p><br/><p>“Yes. She had sent an audition video. It was a video where she sang all of the songs in Maria Callas’ best aria album. Without resting.”</p><br/><p>Singing the entire album meant that she had sung aria for almost an hour without resting. It also meant that she had gone through intense practice from a young age.</p><br/><p>“As soon as our professors saw the video, we all got lost in it and watched it for 50 minutes without even breathing.”</p><br/><p>“She’s very refined for a rookie. Did she go to an art high school?”</p><br/><p>“No. She’s from a normal school… We heard that her family is also average but she grew up listening to opera music because her parents are manias.”</p><br/><p>Not everyone can become like participant number 9 just by growing up listening to the opera instead of popular music. She was born with the voice and has the natural gift of handling bel canto just by listening to it.</p><br/><p>“Do you know what the interesting thing is?”</p><br/><p>The Juilliard professor did not stop speaking with more to brag about.</p><br/><p>“She listened to it so much that she memorized all of the Italian and German lyrics without learning it. Ha ha.”</p><br/><p>“Then that means she copied the techniques and embedded them in herself… Well, I’m speechless.”</p><br/><p>“And there is another asset.”</p><br/><p>“Another?”</p><br/><p>“Yes. She’s skinny. Ha ha.”</p><br/><p>A larger woman is more advantageous in creating a rich sound. The body itself becomes an instrument because the vessel for the sound to ring is large. When a female soprano goes on stage to sing a song or opera aria, a large body does not pose a problem.</p><br/><p>However, it is different in an opera. There is the role to deliver a story in an opera. The person who takes that role must have looks to fit it in order to capture the audience.</p><br/><p>The heroine of Mozart’s opera Figaro Wedding is a woman awaiting her wedding. If this bride is built large and fat, it becomes an element that disturbs the audience’s empathy.</p><br/><p>Regardless of the East and the West, female singers were not highly recognized in the past. No matter how good they were, looks could not matter because there were not very many females dreaming of becoming singers. They could become primadonnas on singing alone.</p><br/><p>However, singers are now the subject of envy and primadonnas are especially top tier in the profession.</p><br/><p>This is where people come gathering first when they have even a little talent, so being thin is also a measure.</p><br/><p>“Salzburg Festival may become that child’s grand debut stage. We’re anticipating her to become this generation’s Laura Goldberg. Ha ha.”</p><br/><p>***</p><br/><p>With the last thing of pride, the conductor selection left, the conductor professors encouraged the students with intense gazes.</p><br/><p>A person who can conduct in their 20s is only a person called a prodigy in their youth and becomes a genius as an adult. Is the person not a maestro? It is just a 3-day performance, but it is a precious experience that does not come often to students dreaming of becoming conductors.</p><br/><p>Professor Hirani needed to make Jun Hyuk take the baton even if he needed to force him. He had expected Jun Hyuk to be interested because it is a magnum opera, but he did not show much interest in anything beyond classes and appearing at the occasional concert.</p><br/><p>It is important to be certain with these kinds of affairs. Professor Hirani did not forget to go to Amelia without anyone knowing to warn her.</p><br/><p>“Amelia. I’m doing this because the school’s pride is riding on this. Jun is too divided. We need to let the world know with this opportunity. Don’t you think so?”</p><br/><p>“So you’re saying we should debut Jun at the Salzburg Summer Festival?”</p><br/><p>“Yes. The world is going to be shocked.”</p><br/><p>“I understand. Leave it to me.”</p><br/><p>Amelia had an expression full of confidence.</p><br/>\n</div>"}