{"title": "Chapter 142", "id": 142, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-142", "volume_title": "Volume 2", "body": "<h1>Chapter 142</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 142</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: I know some of you have been hating Amelia…but I think you guys just might change your minds ;)]</p><br/><p>Everyone was exhausted from the never ending practices. As time went by, Professor Roger Neill’s words became more harsh, and the music that Jun Hyuk conducted accordingly increased pressure on the singers.</p><br/><p>The unusual aspect was not reproach on whether or not the aria is sung well. Rather than pointing out an uncertain tone or a short breath, most of the criticisms were about expression of emotions.</p><br/><p>“This is the theater! It isn’t a music concert. The theater where you have to fall into each role to succeed! If you do that, the singing will come out naturally. Singing comes out naturally when you fall into your character and can’t come out. Then, you’ll forget about the tempo, strength, and even the score to have the song flow out naturally.”</p><br/><p>Director Neill was worked up as he gestured to Jun Hyuk below the stage,</p><br/><p>“You have an orchestra that supports you so your emotions are not lacking. This is music that will flow out without problem even if you sing a little differently than the score. Don’t worry about the accompaniment being able to follow you.”</p><br/><p>Even in such a tense environment, there are times when the inside of the theater becomes ecstatic within moments. It is upon the appearance of Queen of the Night. Even Professor Neill closed his eyes and got lost in the music when she came out.</p><br/><p>She is a born singer and actress. Her disadvantage is that she is late to come out of an emotion once she falls into it.</p><br/><p>When Jun Hyuk heard Magic Flute’s winning aria ‘Hell’s vengeance boils in my heart’ for the first time, he even felt like he wanted to write a song to give her.</p><br/><p>Queen of the Night who puts a dagger in her daughter’s hand, telling her to kill her kidnapper no matter what. Singing of a splendid art and acting with an overwhelming charisma that is ready to go on stage immediately.</p><br/><p>When discussing soprano, the famous aria first popera singer ‘Kimera’ cannot be forgotten.</p><br/><p>Her real name is Kim Hong Hee. She created her stage name Kimera in a combination of her last name Kim and opera, the title song of her 1st album in 1985 ‘The Lost Opera’ is the aria Magic Flute.</p><br/><p>For her graduation gift, her wealthy Arabian husband had the London Symphony Orchestra perform her first album. However, this album had the phenomenal sales of 1.5 million albums.</p><br/><p>The great Le Monde paper in France released the article with headline ‘Queen of Popera from Korea,’ introducing the term popera for the first time. After this album, ‘Hell’s vengeance boils in my heart’ became the representative song of the opera aria.</p><br/><p>Whenever Jun Hyuk listened to Laura’s aria, he knew that Amelia’s prediction was not wrong. Laura Goldberg would have her brilliant debut at the Salzburg Summer Festival.</p><br/><p>While Jun Hyuk was wrestling with the students in practice, Amelia was fighting with people looking to become the best in the world.</p><br/><p>Piano finals started in the Great Hall of the Moscow Music Conservatory. The 6 pianists who reached the finals performed 2 people at a time for 3 days and the last race started.</p><br/><p>While Amelia was on stage for the 2nd day of finals, the first day of finals for the violin started in the Tchaikovsky Concert Hall at the same time. It is Danny’s first performance.</p><br/><p>Amelia started performing Rachmaninoff’s and Tchaikovsky’s with the Russian National Orchestra.</p><br/><p>Of the 2 greats’ music, the concerto of Tchaikovsky who the Russians love most, is a song widely used for nationals and is considered to only be handled well by Russians.</p><br/><p>Amelia played the piano with so much confidence that there was no anxiety to be found. She played with a feeling of loneliness and expressed the complicated theme with an brilliant art.</p><br/><p>With the piano’s magnificent octave, she finished the 1st movement with liveliness and a grace accompanied with a brief touch and went toward the 2nd movement airily.</p><br/><p>She expressed the Russian roughness with animation. From the 3rd movement, the key was her depiction like a winter wind sweeping a Russian field, raising the accent with the scale and powerful and fast octave with both hands to create a perfect climax.</p><br/><p>The audience’s storming cheers and judges’ blank expressions. And the 5th curtain call indicated that she is the winner. Amelia could not even remember how many times she greeted the audience and their never ending clapping and cheering, while standing in front of a large picture of Tchaikovsky hanging in front of the venue.</p><br/><p>Han Ye Jin was waiting backstage when she heard the overwhelming cheers and realized that Amelia had given an incredible performance. She also felt that her luck was getting farther away from her since her performance is to be right after.</p><br/><p>As the first runner-up of the final, Danny who chose Shostakovich and Tchaikovsky’s concerto, went on stage with a feeling of adversity. Unlike Amelia, it is his first time on a large stage and he even made a few small mistakes because he could not overcome his nervousness.</p><br/><p>However, he was able to express Shostakovich’s poignant despair as though screaming and Tchaikovsky’s aching bittersweet feeling with an exact and calculated, detailed performance.</p><br/><p>Amelia and Danny, who had completed the final safely, went around Moscow with a relaxed mindset.</p><br/><p>Jun Hyuk finished rehearsal, and went back home to wait for the competition results to come out out the internet TV.</p><br/><p>When the final ranking was confirmed after over 3 hours, Jun Hyuk cheered.</p><br/><p>Amelia won in the piano section and Danny came in 3rd.</p><br/><p>He considered calling to congratulate, but thought that they would be overwhelmed with interviews and just waited for them to contact him. They need to go on tour, starting with a gala concert.</p><br/><p>Winning in the competition did not promise stardom, but it meant that their lives as professional musicians had commenced. The point had come for them to decide whether they will be continuing with school or not.</p><br/><p>Amelia in particular, had entered the ranks of becoming a worldwide star with winning this year’s competition. There is no reason for her to continue attending school.</p><br/><p>When they arrived at the Juilliard theater the next day, orchestra members and singers started clapping to Jun Hyuk’s entrance. Jun Hyuk was only surprised because he did not understand the cause.</p><br/><p>“1st place for your girlfriend. 3rd place ranking for your roommate. Congratulations.”</p><br/><p>A Clayton cellist approached while smiling.</p><br/><p>“Leave it. Is that something I should receive applause for?”</p><br/><p>He thought of this kind of fuss as silly, but the clapping was not just for that reason.</p><br/><p>“Did you by chance… see the interview?”</p><br/><p>“No. I only checked the results.”</p><br/><p>“So I guess you haven’t heard the bomb that Amelia set off.”</p><br/><p>“Bomb?”</p><br/><p>The cellist let out a low whistle.</p><br/><p>“You really have an impressive girlfriend. She needed to end by thanking you, but…..”</p><br/><p>He was positive that Amelia had caused an accident by the way the cellist’s words trailed off.</p><br/><p>“Why? What did she say?”</p><br/><p>“Did you know that Amelia and Danny played the practice songs that you wrote for their preliminary assessments?”</p><br/><p>“What? They played my songs during the preliminary assessments?”</p><br/><p>“Yeah. We didn’t know because the preliminary assessments aren’t broadcasted but some reporter discovered that the composers are the same and asked the relationship. That’s when it started.”</p><br/><p>The cellist kept talking as if he is having fun with the gossip.</p><br/><p>“Amelia said that you’re her true teacher. The problem is that Professor Lenny Greenfield was there as well. I’m pretty sure the school flipped out.”</p><br/><p>She had said that to the face of the professor who discovered her and brought her to America. Beyond the betrayal that Professor Lenny Greenfield felt, she had created a headache of a situation that made Jun Hyuk the topic of conversation.</p><br/><p>“Danny ended up saying something similar too. He said that he couldn’t have dreamed of getting in the ranks if it hadn’t been for you. Don’t go to school for the time being. A ton of reporters will be waiting for you. Ha ha.”</p><br/><p>Jun Hyuk could not join in the laughter. He just hoped that the reporters would not come barging in all the way here.</p><br/>\n</div>"}