{"title": "Chapter 159", "id": 159, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-159", "volume_title": "Volume 2", "body": "<h1>Chapter 159</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 159</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: JH out on his own]</p><br/><p>“Mr. Yoon. This is late, but congratulations. Jun Hyuk is finally being recognized all over the world. Ha ha.”</p><br/><p>“Thank you. It’s because of everything you’ve done for us. Oh right, I was going to give you a call anyway.”</p><br/><p>“It’s because of Inferno, right?”</p><br/><p>“How did you know?”</p><br/><p>“Because it said that the source was unknown. Is there anyone else you showed it to?”</p><br/><p>“No. I’m still taking care of the original. Jun Hyuk said that he showed it to you.”</p><br/><p>“Yes. Jun Hyuk re-wrote it and brought it to me. I scanned it and sent it to a music professor I know. Honestly, it’s just noise when I look at it… Ha ha.”</p><br/><p>It is just noise even to Jo Hyung Joong whose job is music. 99% of the people who buy the score will just think of it as noise as well.</p><br/><p>“Right? It was uncomfortable and hard for me to look at as well, but to think that it is recognized by maestros… I guess there’s something special to it that average people like us can’t see. Then the score that Jun Hyuk re-wrote for you…..?”</p><br/><p>“I still have it. Since it’s handwritten by Jun Hyuk, I’m going to keep it as a family heirloom.”</p><br/><p>“Then I guess there’s a high possibility that the leak came from that professor.”</p><br/><p>“Yes. I’m sure it’s the music professor I sent it to.”</p><br/><p>“What did that professor say when he saw Inferno?”</p><br/><p>“That professor must not have been a maestro. He was someone whose standards are not very different from our own. Ha ha.”</p><br/><p>Jo Hyung Joong thought of when Professor Ju Yong Tae had criticized it as garbage. As older professors have trouble with their e-mails, assistants and graduate students often help them check their accounts. He thought that it may have been a student who saw the score.</p><br/><p>“Then I’ll have to look into it.”</p><br/><p>“Oh no, it’s okay. What use is there is finding that out now?”</p><br/><p>“No. I need to say something to that professor as well. I’m dying to hear what he has to say. I also want to take this opportunity to see what he’s really like.”</p><br/><p>Jo Hyung Joong was having fun imagining the reaction of an elder in classical music who brags impressive prestige.</p><br/><p>***</p><br/><p>“Professor. How are you? This is Jo Hyung Joong.”</p><br/><p>“Oh, Teacher Jo. Are you doing well?”</p><br/><p>He could hear Professor Ju Yong Tae’s calm voice over the phone. He smiled slightly when he thought of how surprised the professor would soon be.</p><br/><p>“Yes. I just have something to ask you, professor.”</p><br/><p>“Sure. What is it?”</p><br/><p>“Did you see the articles that are making news these days? A song called ‘Inferno’. The one that a Korean genius wrote?”</p><br/><p>“Of course I know. Isn’t it a song that European maestros are praising highly? I’m also just in waiting for the score to be revealed.”</p><br/><p>“As much as it is being praised, there is also negative feedback.”</p><br/><p>Professor Ju who is supposed to be opposed to innovative contemporary music is anticipating it because European maestros have praised it? He had given his negative opinion in the strongest terms even when he occasionally heard contemporary music on broadcast. Had he always been someone with such little conviction?</p><br/><p>“Since the opinion is divided, I’ll have to see the score to know. But it’s definitely a work of art if one side is praising it highly and one side is saying that it’s not. If it’s half and half, it’s only a matter of differences in taste or opinion.”</p><br/><p>“I see. Oh, Professor. I have one more thing to ask… Do you remember a score I sent you for a symphony written by a rookie about 2 years ago?”</p><br/><p>“Of course I remember. That was the first time I’d seen such an unpleasant song.”</p><br/><p>“Then do you still have the email that I sent you?”</p><br/><p>“No. I deleted it.”</p><br/><p>“Did you look at the score on your monitor?”</p><br/><p>“No. I printed it, but what is it? Is there a problem?”</p><br/><p>Professor Ju Yong Tae started to become annoyed. It sounds as if Jo Hyung Joong is accusing him of something.</p><br/><p>“Oh, it’s nothing really. Then that printed score…..?”</p><br/><p>“I threw it out of course. I even deleted the email. Why would I hang on to the printout? But why do you keep asking?”</p><br/><p>Professor Ju Yong Tae finally asked the question. But Jo Hyung Joong’s voice on the phone had become cold.</p><br/><p>“I didn’t think that you would need to wait to see the score for Inferno.”</p><br/><p>“What is that? What does that mean?”</p><br/><p>“Professor, you were the first person to see the masterpiece called Inferno. The score that you said is garbage and threw out is Inferno.”</p><br/><p>There was no sound over the phone. Jo Hyung Joong imagined Professor Ju dropping the phone out of surprise, and hung up the phone.</p><br/><p>***</p><br/><p>Jun Hyuk bought a used camping car for $10,000 and planned his first journey to go in the Bayern area from Wurzburg to Fuissen, and on Romantische Str.</p><br/><p>This road created from nature, culture, and history originates from ‘The road to Rome’ connecting Germany and Rome, Italy. The 360km journey was laden with architecture worth thousands of years of history and the rustic atmosphere of rural farmhouses.</p><br/><p>He met Korean tourists in every city who recognized him, forcing him to change his direction into the countryside. They would take pictures of him and post them on social media immediately, bringing more people to the area.</p><br/><p>It turned out to be a better choice to change direction into rural areas that are not well-known. There were barely any tourists and he could only see the people of that area living simply within their own fences.</p><br/><p>There were even places that looked at him as if seeing an Asian person for the first time. When Jun Hyuk stumbled with his German however, they let down their guards and treated him with a friendly manner.</p><br/><p>Jun Hyuk visited each village that the European maestros told him about in order to learn the folk songs of each area. A camping car is good because he can stay somewhere even if the area does not have accommodation for outsiders.</p><br/><p>Of the people that Jun Hyuk met, he spent the most time with gypsies. These nomadic Aryan Indian people are called the Romany people.</p><br/><p>Most of them have settled, but there are the rare people who still live in place to place. Their freedom and optimism held Jun Hyuk back.</p><br/><p>Bizet’s Carmen is a thing of the past. Gypsies do not make their living off of music, dance, and prostitution, but live off of the subsidies net by the government for minority protection.</p><br/><p>They played a quaint melody for Jun Hyuk that they did not know the origins of, and Jun Hyuk committed that melody to his memory. He then created a new song with that melody as a background and played it for them.</p><br/><p>He felt like living with music in this optimism is another good way of living.</p><br/><p>When he left Germany and found the Route 4 Lucerne line in Swiss Zurich, it was his treasure. The green fields and lake that kept disappearing and reappearing were a superb view that exceeded any tourist attraction.</p><br/><p>He did not even have a place to hurry up and get to. Jun Hyuk stopped the car whenever he wanted to. He spent the nights enjoying the dark, calm nights lit up by the stars reflected on the lake.</p><br/><p>It was people who interfered with this calm from nature. They must have thought that no one was around because Jun Hyuk turned off all the lights in the camping car, so an SUV turned up near him with speakers turned up to the maximum volume.</p><br/><p>As even the sounds of nature grew quiet because of the loud noise, the only sound in the area was that of the music from the car.</p><br/><p>He was angry and annoyed, but he could not get himself to approach them. He was scared that they could be a danger to him.</p><br/><p>Jun Hyuk was lying down in the camping car for about 5 minutes after the SUV arrived when he got up all of a sudden. He put his clothes on and walked toward the car with the music.</p><br/><p>It seemed that there were 4 men in the SUV, preparing to camp out. They already had sleeping bags laid out on the ground and they had brought dry wood to create a fire.</p><br/><p>When Jun Hyuk appeared suddenly, the 4 men picked up the wood that they were going to use for the fire. They were equally scared, but they put the sticks down when they saw that Jun Hyuk was alone.</p><br/><p>“Excuse me, but that music…..”</p><br/><p>“Oh, sorry. We didn’t realize that we had neighbors. It was too noisy, wasn’t it?”</p><br/><p>When they heard Jun Hyuk speaking German with difficulty, one of the men rushed to turn the volume down.</p><br/><p>“No, it’s not that… That music, is it the radio? A CD?”</p><br/><p>“CD.”</p><br/><p>“Can I see the CD jacket?”</p><br/><p>The men were taken aback because Jun Hyuk had appeared like a ghost to ask to see the CD.</p><br/><p>“Look here. Is your German not good? Can you speak English?”</p><br/><p>Someone spoke in English, though it was British English which sounded like German to him anyway.</p><br/><p>“What a relief. English is okay. Can we speak in English?”</p><br/><p>“Of course.”</p><br/><p>The man who spoke with an English accent retrieved the CD case from the car and handed it to Jun Hyuk.</p><br/>\n</div>"}