{"title": "Chapter 153", "id": 153, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-153", "volume_title": "Volume 2", "body": "<h1>Chapter 153</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 153</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: …]</p><br/><p>The ability to cross between contemporary music, classical, and romantic. A classical pianist who oversteps the abilities of a jazz pianist. They had also heard that he led students in a successful performance of Magic Flute.</p><br/><p>They will have to hold back on premature judgments but since he even has the abilities of a conductor, he is a complete and perfect maestro.</p><br/><p>“Isn’t this too much showing off? We meant to listen to a few more songs but starting now, I think we’ll need to buy tickets. It’s too much to ask to listen to this for free.”</p><br/><p>“Amelia’s interview wasn’t an effort to push for her boyfriend. I see she’s a lucky girl. To think that she receives lessons from a pianist like this everyday!”</p><br/><p>“I can see why you aren’t revealing the rest of Inferno. You have so much more to release. Ha ha.”</p><br/><p>They started to ask about Jun Hyuk’s short life until now. When he started with music, who taught him, and what his plans for the future are.</p><br/><p>“You all are my teachers.”</p><br/><p>With this sentence as a start, Jun Hyuk thought them briefly about his rough childhood, his encounter with Yoon Kwang Hun, how Yoon Kwang Hun recognized his talent and allowed Jun Hyuk to fall into the world of music. He also told them how he listened to CDs and soaked in the essence of that music.</p><br/><p>Everyone became lost in this story that could be out of a movie and when he was giving his evaluation of an album with a song as one unit, a few maestros were so shocked they could have fainted.</p><br/><p>Jun Huk’s evaluation takes into account every single note and melody from each instrument, which is difficult even for them to remember. There is no way to describe Jun Hyuk’s talent but to say that it is a gift from God.</p><br/><p>All of the maestros were just thankful that Jun Hyuk who had such a talent was standing in front of them today. There are a lot of youths who disappear without being able to show their talent. After today however, everyone would be expecting the music that Jun Hyuk has created until now and will be creating in the future.</p><br/><p>“It says that Inferno is Symphony No. 1. So how many have you written after that?”</p><br/><p>Since they had witnessed Jun Hyuk’s abilities, they could not help but be curious about his past works.</p><br/><p>“The most recent symphony I wrote is No. 14.”</p><br/><p>“14 songs? What about others? Pieces other than symphonies?”</p><br/><p>“I do have sonatas, concertos, and etudes for a few solo instruments.”</p><br/><p>“Can you tell us how many songs there are total?”</p><br/><p>“There should be a little over 60 songs for classical music. I used to just scratch them out, but I have been controlling myself since I started attending school.”</p><br/><p>The person who caught on to Jun Hyuk pointing out classical, spoke out,</p><br/><p>“Wait, you said classical? Then you work with other genres as well?”</p><br/><p>“Yes. It’s pop music. Like rock, the blues, and jazz.”</p><br/><p>“Do you have 60 of those too?”</p><br/><p>“No, there are more. It has been easy to create those because the instrumentation is easy and they are shorter. I think there are about 100.”</p><br/><p>“Crazy… Didn’t you say that it hasn’t been 4 years since you started music? Are you writing a new song every week?”</p><br/><p>“I guess so. If it’s possible, I try to write music every day.”</p><br/><p>Three or four songs in a year. They had expected him to write at most 10 songs in a year. 10 is a tremendous number, but to think that he has 14 songs that are just symphonies.</p><br/><p>“Why haven’t you released any of your songs? Looking at your 1st sonata, it doesn’t seem like the rest will be rubbish.”</p><br/><p>“I have performed a few of them at school concerts. But there isn’t anything that I like enough to reveal to the public yet.”</p><br/><p>Everyone started laughing.</p><br/><p>“Ha ha ha. Look here, Jun. If you’re thinking of releasing songs that you’re completely content with, you’ll never release a single song.”</p><br/><p>This is a mistake that young geniuses make before they go out to the world. They focus on creation until a song that they are satisfied with comes out.</p><br/><p>“If you complete a song, you have developed that much. Then how could that song be satisfying? Unless you stop growing… you’ll never create music that you’re completely satisfied with. We’re the same way. I’ve never had a performance that I was completely satisfied with. Something always falls short.”</p><br/><p>Jun Hyuk felt like the shortcomings that the maestros were discussing as if they are nothing, was exactly what he experienced. It had felt perfect when he wrote the note on the sheet, but something seemed to be lacking when he looked at the song as a whole. There had been many instances when he felt frustrated because he could not find a breakthrough in this shortcoming.</p><br/><p>“Release the songs that you feel are beyond okay. And make sure you show all of the music you make to the world from now on. You can’t always receive praises. You need to hear poignant criticism as well.”</p><br/><p>It is a life of creation that is full of the feeling of lacking. Finding out like this, he felt much lighter.</p><br/><p>Jun Hyuk forgot how tired he was because they were talking deeply about funny episodes and music. He did not forget to take pictures with everyone either. That night, the party went until dawn.</p><br/><p>Two days after the unforgettable party, Jun Hyuk followed Sir Simon Lettle and Sarill Petrenko to Berlin. He watched the Berlin Philharmonic practice and talked to each of the members, spending his time admiring the world’s top class.</p><br/><p>Each of the members of the Berlin Philharmonic are good enough to be active as soloists. They are such recognized performers that in the off-season, they configure trios or string quartets to take on full tour schedules.</p><br/><p>Since each person is outstanding, the conducting is also different. It is possible to conduct in a way that shows that an orchestra can one perfect instrument.</p><br/><p>As long as he does not alter the tempo, they do not need to rehearse repeatedly when given the conductor’s interpretation of the song and a few points to pay attention to. The Berlin Philharmonic is always in its best condition.</p><br/><p>Conductors also visited other cities in order to see Jun Hyuk. Jun Hyuk was having a great time talking to these people and thinking about how their respectable greats like Bach, Handel, Beethoven, Wagner, and Mendelssohn had an effect on traditional songs.</p><br/>\n</div>"}