{"title": "Chapter 154", "id": 154, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-154", "volume_title": "Volume 2", "body": "<h1>Chapter 154</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 154</p><br/><p>TL: LightNovelCafe</p><br/><p>[TN: I’ve been having some personal issues so I haven’t been able to translate much recently…sorry about the zero ETH updates guys]</p><br/><p>The cultural and editorial departments of influential Austrian daily newspaper ‘Die Presse’ listened to the recorder that a college student had brought them, and they knew that this is a scoop. Even outsiders to classical music become excited about secrets like this.</p><br/><p>The recording contains the story of a masterpiece called ‘Inferno’, a mysterious composer, and world renowned maestros. The only question was whether to put it on the 1st page or to put it in the cultural section.</p><br/><p>There are no legal issues either. They had not been tapped and this had happened during a reporter’s coverage of an event.</p><br/><p>They had not given the informant the amount that he had asked for, but they had given him a fair amount for the value of the file. Culture reporters wrote their articles by looking for word on that day’s performance and interviewing a few maestros over the phone.</p><br/><p>One week after the concert, ‘Die Presse’ had a headline that was enough to catch readers’ attentions.</p><br/><p>[August 1st. Events of that Night; Why did 16 maestros gather in one place?]</p><br/><p>[A Korean student at Clayton-Hoffman School of Music, just 19 years old, is the person who made countless maestros rack their brains for about 2 years.</p><br/><p>A leading philharmonic in the world made an attempt at his Symphony No. 1 and though they failed, he had the honor to premiere with the Berlin Philharmonic. Of course the person who created this symphony was not revealed until it was performed.</p><br/><p>Original composer Jun Hyuk Jang, better known as JUN, released an album with jazz great Stanley Clarke and is winner Amelia LaMarque’s boyfriend, who made news in the Moscow Tchaikovsky Competition.]</p><br/><p>The daily paper started with an introduction of Jun Hyuk and went on to describe that night’s conversation in detail. Marco Giavelli’s opinion on Inferno and the fact that the audience had to leave the concert hall because of the strange topic of pain in particular, caught the readers’ attention.</p><br/><p>With this article, other media outlets wrote supplementing articles and the world of classical music was flipped upside down. Of the subsequent articles, the phone interview that Patrick Quinn of the Vienna Philharmonic conducted put fire to the wind.</p><br/><p>Patrick Quinn said that Jun Hyuk is ‘the only person who is able to stand at the top of world music. And that is within 10 years.’ This short statement made Jun Hyuk the musician receiving the most attention in the world.</p><br/><p>The articles about Jun Hyuk that had started in Austria, soon spread to Germany. The Austrian and German press went to Jun Hyuk’s hotel and the Berlin Philharmonic’s concert hall to ask to interview and film.</p><br/><p>Like poet Byron, he had woken up a star and Jun Hyuk was having trouble adjusting to this environment that had changed overnight.</p><br/><p>“Jun, I’m sorry this happened but you’ll be eaten alive by the press if you stay here. I wanted to spend some time with you leisurely, but it’s a pity.”</p><br/><p>“I’ll say. If I stay here any longer, I’ll be a bother to the Berlin Philharmonic.”</p><br/><p>Everyone was suffering because the reporters camped outside the Berlin Philharmonic concert hall were grabbing all of the members to ask for interviews or about Jun Hyuk’s hotel.</p><br/><p>“It’ll be better for you to hide out until things get quiet. What do you think? Will you spend some time somewhere quiet?”</p><br/><p>“Somewhere quiet?”</p><br/><p>Sir Simon Lettle thought that it would be best to have Jun Hyuk flee for the time being.</p><br/><p>“Yeah. What do you think about staying at my villa? My housekeeper is there and if I give them a call, I can arrange to have someone to do the housework for you. It’ll be perfect to rest in because it’s in a small village called Hohenschwangau, not far from Bayern Fussen. Neuschwanstein castle is nearby and since the Schwangu forest is right there, you can take walks to avoid the summer heat.”</p><br/><p>Neuschwanstein castle is a sight that Jun Hyuk wanted to see as well. It is so beautiful that Walt Disney used it as a model for the Disneyland castle.</p><br/><p>When the articles first went up and the reporters came looking for him, Jun Hyuk had thought of going to Amelia in Budapest.</p><br/><p>However, the reporters know his relationship with Amelia and already went to her in Budapest for interviews. Fortunately, Amelia is used to the flashing cameras and ignored the reporters, repeatedly saying ‘no comment’. She gave Jun Hyuk an urgent call telling him not to go to Budapest.</p><br/><p>“Fortunately, people don’t know what you look like yet, so no one in such a small village will bother you. What do you think?”</p><br/><p>“Would that be okay? I feel like I’m being too much of a bother…..”</p><br/><p>For over a week, they had provided him with hospitality. Fleeing to the countryside means that he will be staying for at least one month. Staying in a quiet place is what Jun Hyuk likes most, but he thought it would be obnoxious to accept so quickly.</p><br/><p>“It’s okay. This is how much I want to keep you here. Ha ha. I’ll arrange for my plane, so hurry up and run away.”</p><br/><p>While Jun Hyuk was borrowing Sir Simon Lettle’s limousine and private plane to go to Hohenschwangau, located 700km from Berlin, Yoon Kwang Hun in Korea still did not know what was going on.</p><br/><p>***</p><br/><p>As always, Yoon Kwang Hun finished preparing the cafe to open, sat in the middle of the cafe, and was enjoying coffee and music while waiting for his first customer.</p><br/><p>The first customer today was a bit special. The door opened with the sound of a bell, and a white-haired foreigner walked in. Even though it is summer, he is in a suit with a necktie.</p><br/><p>After ordering a cup of coffee, he started looking through the CDs on the wall. Yoon Kwang Hun left him alone because it is a weekday afternoon when there are few customers. If he made a song request, Yoon Kwang Hun even intended to turn it on for him.</p><br/><p>The old man looked through the CDs for a while, took one out, went to a cafe employee, and exchanged a few words with him. Yoon Kwang Hun saw the employee point in his direction, and knew that the old man was looking for the owner of the cafe.</p><br/><p>Yoon Kwang Hun went to the old man and asked if he wanted to listen to the CD in his hand in fluent English. The old man smiled brightly and gave the CD to Yoon Kwang Hun.</p><br/><p>‘I guess this old man knows something about jazz.’</p><br/><p>The CD that he chose was the album by Jun Hyuk and Stanley Clarke.</p><br/><p>He listened to the full melody of the bass guitar and piano with his eyes closed, tapping his fingers, and then went to Yoon Kwang hun.</p><br/><p>“Mr. Kwan Hun Yoon. Do you have time to speak?”</p><br/><p>“Excuse me? How do you know me? Sorry, but who are you?”</p><br/><p>Yoon Kwang Hun was surprised when the old man called him by his name, and bolted up from his seat. The old man laughed a little and handed over his business card.</p><br/><p>Yoon Kwang Hun could tell that the old man was not an ordinary person when he saw the card. He had met tremendously rich people while working on Wall Street. And those rich even have different business cards.</p><br/><p>Paper that is sprinkled with a powder of eggshells and ivory, embossed in English font. A material that is nice to the touch, not too slippery but not rough either. This old man has spent thousands of dollars on one box of business cards.</p><br/><p>On the business card, it says Stern Corporation. It says Isaac Stern clearly. It does not reveal his position, but his name is the name of the company. There is no need for further explanation.</p><br/><p>Yoon Kwang Hun sat across from Isaac Stern. Stern Corporation is a company that he had not heard of on Wall Street.</p><br/><p>“Did you come here from New York to meet me? Or?”</p><br/><p>“Of course I came here to meet with you. Actually, this is my first visit to Korea as well.”</p><br/><p>Yoon Kwang Hun asked cautiously,</p><br/><p>“Have you come to meet me? Or have you come to meet me as Jun Hyuk’s guardian?”</p><br/><p>“You catch on quickly. Is it because you used to work on Wall Street? Yes. I came to talk to you about Jun.”</p><br/><p>If this meeting had been for a deal, Yoon Kwang Hun would have left already. Isaac Stern carefully looked up information on him, but all he had on this old man was his business card.</p><br/><p>‘Well this old man is impressive.’</p><br/><p>He felt slightly excited because he was meeting someone who made him tense for the first time in a while.</p><br/><p>“What would you like to discuss regarding Jun?”</p><br/><p>“Stern is a management company. We would of course like to contract Jun as his management.”</p><br/>\n</div>"}