{"title": "Chapter 157", "id": 157, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-157", "volume_title": "Volume 2", "body": "<h1>Chapter 157</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 4 / Chapter 157</p><br/><p>TL: LightNovelCafe</p><br/><p>xt]</p><br/><p>[TN: How much money do you have Jun?]</p><br/><p>Sir Simon Lettle’s villa is to Jun Hyuk’s liking. He had felt like it would have been too burdensome to stay in a place like a large European castle. The villa however, is a small 2-story house on a small hill that looks down on the Schwangau forest.</p><br/><p>Other than the grand piano in the spacious living room, there was no clutter. There was just the expensive wine in the wine cellar.</p><br/><p>The friendly woman who greeted Jun Hyuk is from Eastern Europe, and they could not understand each other. They can just use body language to communicate since she will only be taking care of his meals.</p><br/><p>Jun Hyuk organized his luggage and went out into the Schwangau forest. There is just the sound of nature everywhere with nothing to interfere. Since there is such a forest right next to him, he felt like 1 month would go by easily.</p><br/><p>Until now, it had been a busy 10 days. With time to relax, he remembered someone he had been forgetting.</p><br/><p>“Sir, it’s me.”</p><br/><p>“Yeah. I heard you’re a great star now? Ha ha.”</p><br/><p>Yoon Kwang Hun’s pleasant laughter rang over the phone.</p><br/><p>“Huh? How did you know? Did the news already come out in Korea?”</p><br/><p>“No. It’s still quiet here. Didn’t I tell you? You’re in the palm of my hand.”</p><br/><p>Sometimes, Jun Hyuk has the feeling that Yoon Kwang Hun might have someone following him around to report back to him. Yoon Kwang Hun will not tell him how he came to know anyway.</p><br/><p>“That’s that, but where are you now?”</p><br/><p>“I’m at Sir Simon Lettle’s villa. It’s a small countryside village called Hohenschwangau.”</p><br/><p>“What? Simon Lettle? Simon Lettle of the Berlin Philharmonic?”</p><br/><p>This is how Jun Hyuk gets revenge. He imagined Yoon Kwang Hun’s surprised face.</p><br/><p>“Yes. Ha ha. Aren’t you jealous?”</p><br/><p>Jun Hyuk told him about everything that happened over the last 10 days. The shock he felt when he heard his 1st symphony in the concert hall, the party with 16 maestros, and how he showed off in front of them.</p><br/><p>“But how did your score get leaked? There’s no way it came from me.”</p><br/><p>“Yeah. I was most curious about that as well… I gave Teacher Jo Hyung Joong my score before. He said that he would find out what it is worth from a professor of music. I never did receive an assessment. There’s nothing other than that though.”</p><br/><p>“You did? Hm… I’ll look into it. How is it over there? Is it okay?”</p><br/><p>“Yes. It isn’t a luxurious villa, but it’s small and perfect. Oh, you could come here. I’m alone.”</p><br/><p>“Hey. Why go over there? I have to run the cafe.”</p><br/><p>He does not even care that much about the cafe. There must be another reason why he will not come when Jun Hyuk knows that all Yoon Kwang Hun does is drink coffee and listen to music until it is time to close as if he is a regular customer. It seems he is trying to step by from Jun Hyuk’s life little by little so he can learn to live on his own.</p><br/><p>“That’s that, but what are you going to do now? Are you going back to school?”</p><br/><p>“Do you think it’ll be okay?”</p><br/><p>“How could it be okay when it’s like this? Reporters trying to write about you isn’t even the biggest problem. I’m sure your professors are also going to make a fuss to hand over ‘Inferno’.”</p><br/><p>“Damn it. I want to keep going to school…..”</p><br/><p>“Why? Is there a lot to learn?”</p><br/><p>“It’s pretty good. The special classes are good too.”</p><br/><p>“Hm… Then how about this?”</p><br/><p>“What?”</p><br/><p>“Disappear for about a year. Take a leave of absence from school. Don’t you think everyone will forget after about a year? Just reveal the whole score for ‘Inferno’.”</p><br/><p>Yoon Kwang Hun spoke to Jun Hyuk while thinking of what he had just discussed with Isaac Stern. He is still young. It would be okay for him to travel the world for a year.</p><br/><p>“There aren’t very many people who know your face. It’s hard for people to differentiate between Asian faces, so I’m pretty sure you won’t face anything too bothersome. I’m positive reporters won’t recognize you even if you were hanging out in the lobby of the New York Times building.”</p><br/><p>“Then what do I do for a year?”</p><br/><p>“You have to figure that out. You want me to tell you how to rest?”</p><br/><p>“I’ll think about it.”</p><br/><p>“Sure. Anyway, get a lot of rest since you’re in a good place. Oh right! Send me all of the pictures you took with the maestros. Okay?”</p><br/><p>After getting off the phone, Jun Hyuk thought about the idea that no one would recognize him even if he were hanging out in the lobby of the New York Times building. It figures since the only people who know his face precisely are in Korea, school, and the people he met in Salzburg. His name has risen to stardom, but he himself is just an Asian boy.</p><br/><p>Everyday, Jun Hyuk walked through the Schwangau forest or went to the morning marketplace with the housekeeper to buy food. Other than the occasional video chats with Amelia and the calls from Sir Simon Lettle to check up on him, he was completely cut off from the outside world.</p><br/><p>This peaceful state did not last over 10 days. A phone call came, which made him realize that he cannot push matters off any further.</p><br/><p>“Where are you right now?”</p><br/><p>“Ah, hello lawyer.”</p><br/><p>“Save the greetings for later and tell me where you are.”</p><br/><p>“Near Fussen in Germany.”</p><br/><p>“Geez… That’s not good since we need to meet immediately.”</p><br/><p>“What is it? Did something happen?”</p><br/><p>Lawyer Lim So Mi was not speaking in her usual dry voice, but had an excited tone. It is a voice that was not fitting for someone who had always been so calm.</p><br/><p>“You need to save me. I can’t live like this. Even now, reporters are camping outside and making a fuss for me to tell them where you live. I can’t leave my house.”</p><br/><p>For someone asking to be rescued, her voice was bright. She might be enjoying this attention.</p><br/><p>“Oh no… But how did the reporters find out about you?”</p><br/><p>“How do you think they know! The only places that are connected to you are CH and LA Sound. The school doesn’t know about me, but LA Sound does. They probably pushed the reporters off to me when they went swarming to their offices.”</p><br/><p>“I’m sorry. It happened so suddenly for me as well so…”</p><br/><p>“It’s okay. I didn’t call to fight you about it. Anyway, you can’t just ignore it like this. It’s definitely the timing to reveal something or another. And you need to stop by LA Sound.”</p><br/><p>“Excuse me?”</p><br/><p>“Your tribute album. They finished recording and are going to release the album soon. But I guess the metal musicians with the long hair are saying they need to meet with you. I’m told they’re pretty famous, but I have no idea who they are.”</p><br/><p>“Is that so?”</p><br/><p>Jun Hyuk had clearly told Alex Zakin that he would not see his heroes in their aged state. By calling him in now with the musicians as an excuse means that they are using this press as an opportunity to garner more attention for the album.</p><br/><p>Jun Hyuk hesitated to answer and Lim So Mi realized what he is thinking.</p><br/><p>“You can ignore them. The contract clearly says that you won’t participate in promotions for the album. But you’re not some kind of mysterious character… I’m telling you though because I thought it was weird that you created tribute songs but won’t even show your face. If you don’t want to do it, I’ll reject.”</p><br/><p>“Yes. Then can you reject it?”</p><br/><p>“Okay. Then this talk amongst the reporters… Hm… Jun Hyuk, let’s do this. Think about it for 2 days and then call me. What you need to make a decision on is what you’ll do with the score for the symphony. And what your future plans are. It’s just these 2 things.”</p><br/><p>“Alright. I’ll give you a call as soon as I can.”</p><br/><p>“And this is good news, but LA Sound is celebrating because you’ve been labeled a young genius in the press. Your album is selling a lot for a jazz record. They also said that there are a lot of pre-orders for the tribute album already. You’re going to make a lot of money very soon. Ho ho.”</p><br/><p>When Lim So Mi brought up the matter of money, Jun Hyuk suddenly remembered something. He had come up with plans according to Yoon Kwang Hun’s suggestion to take a year off, but he would need money for those.</p><br/><p>“Uh Mrs. Lim. How much have I made until now?”</p><br/><p>“What? You don’t know? Lawyer Baek doesn’t tell you?”</p><br/><p>“Ah, I don’t ask him. I just use my card and take out cash from an ATM whenever I need it, and he fills it back up to 10 or 20,000 dollars.”</p><br/><p>“What? He puts in 10 to 20,000? How much have you made? Hang on. I’ll check for you. I don’t check your account…”</p><br/><p>From the sound of typing coming over the phone, he could tell that she is checking his balances.</p><br/>\n</div>"}