{"title": "Chapter 191", "id": 191, "volume": 2, "url": "http://boxnovel.org/gods-song-chapter-191", "volume_title": "Volume 2", "body": "<h1>Chapter 191</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 5 / Chapter 191</p><br/><p>TL: LightNovelCafe</p><br/><p>***</p><br/><p>“I don’t think that Jun composed this choral concerto.”</p><br/><p>Pierre Boulez spoke in affirmation. The orchestra members’ eyes grew wide when they heard the maestro say something negative about the composer.</p><br/><p>“I’m sure that the modern day Beethoven wrote this choral concerto.”</p><br/><p>“Modern day Beethoven?”</p><br/><p>The bandmaster repeated it, asking for an exact meaning.</p><br/><p>“Yes. If Beethoven had been born now with the same musicality, how would Beethoven of the past be different from Beethoven now? Body? Health? Personality? Fortune? I’m sure there’s nothing that could be guaranteed.”</p><br/><p>Pierre Boulez looked at the orchestra and portrayed Beethoven as if he were in front of him.</p><br/><p>“I think that the one thing that we can be sure of is the difference in thinking. He would have had a much more diverse amount of thoughts and the depth of his knowledge would have been different. He would have had many different cultural experiences, not just those limited to Europe. But the kind of music that he sought out wouldn’t have changed.”</p><br/><p>He listed the differences as though he were comparing and analyzing two Beethovens standing in front of him.</p><br/><p>“Which means, a Beethoven with a bit more complex thought. Due to this, don’t you think that he would have changed the Choral Symphony of the past to the Choral Concerto now with a free expression?”</p><br/><p>His conclusion is that of a free Beethoven instead of a strict one.</p><br/><p>“The focus of the performance is that it is more grand and free-spirited, but still retaining the elegance of Beethoven.”</p><br/><p>The two maestros’ demands were not complete opposites, but they were not adjacent to each other either. The orchestra thought that they would have a good time preparing for the finals with these two maestros.</p><br/><p>***</p><br/><p>“Maestro, won’t the orchestra members be confused? Their expressions these days during rehearsals is weird. It kind of looks like they’re laughing but it also looks like they’re frowning.”</p><br/><p>“Ha ha. It’s okay. Our Belgium National Orchestra is a pretty good instrument. They can bring out a conductor’s request well. It’s just because they’re not in the habit yet. Give them 2 weeks and they’ll be performing both versions as if it’s nothing.”</p><br/><p>Jun Hyuk enjoyed conducting. It is not like with Inferno when it was as though he was forcing a building while looking at impossible plans. Now, he has a perfect building plan and is piling the bricks to steadily create a magnificent cathedral. There is fun in seeing the cathedral take shape step by step.</p><br/><p>While Jun Hyuk was enjoying conducting, the orchestra members were full of regret. They had heard the rumors. They heard that he showed the Boston Philharmonic a mysterious side of him full of brilliant ideas and music.</p><br/><p>The Jun Hyuk they see however is like every other conductor, and they cannot find anything new in him. The orchestra members even joked around saying that he might be a magician who already used all of his powers.</p><br/><p>When they started to get used to the two versions of Choral Concerto, the jokes starting to change. Jun Hyuk went from a magician who used all of his power to the Grim Reaper. Instead of a scythe, he is holding a baton.</p><br/><p>He does not miss a single mistake with his scary listening skills, and does not hesitate to make them play repeatedly until the feeling and sound that he wants comes out. When he was realizing that the Belgium National Orchestra is not at the level to reach his aim, Pierre Boulez was changing.</p><br/><p>The relaxed state he had shown until now had disappeared. They started tightening their grips on the orchestra as though two conductors in competition even though their methods were carried out in completely different languages.</p><br/><p>***</p><br/><p>“Tempo! Faster. Marcato! Break up each sound by the bow’s movement and string them together. This part isn’t a long pass. You’re making short passes up to the front of the goal. Don’t forget this feeling. Again!”</p><br/><p>***</p><br/><p>“Calando! (making the tempo and strength slower and weaker) Smoother. Make the feelings continue as though they might be disconnected. The intellectual pleasure Beethoven feels as he keeps learning new culture. That pleasure is continued endlessly. Again!”</p><br/><p>***</p><br/><p>“Fortissimo! Bring out a more vehement sound. The audience already shows a crazy reaction with the first drum sounds of a rock band. The timpani needs to be to a point where it is hitting the audience’s hearts. As soon as the timpani sound rings out, the brass instruments need to follow and hit the audience’s ears.”</p><br/><p>***</p><br/><p>“Voce Piena! (full of sound) You cannot lose dignity. It is not the sound of the timpani ringing through the audience, but as though it is a wave from the back of the audience. You cannot lose the elegance for even a moment. We cannot say that Beethoven’s tenacity is very good, but his music is elegance itself.”</p><br/><p>***</p><br/><p>“Don’t think about the piano or violin ensembles. I’ll control them. You should all just follow the baton. The soloists need to be pulled in by our storm-like vehemence. I have absolutely no intention on bringing them along. Our performance needs to keep going with the thought that we’ll toss anyone who falls behind.”</p><br/><p>***</p><br/><p>“You need to think about the piano and violin ensembles as well. Their music becomes a part of us starting in the 2nd movement. We need to wrap them, but it is a bit rough right now. Play more smoothly like a mother’s touch, carefully embracing her child.”</p><br/><p>***</p><br/><p>The members of the Belgium National Orchestra were about to go out of their minds because they were switching off every day to play completely opposite performances. It almost felt like they were going back and forth switching 2 buttons on and off. One is ‘vehemence’ and the other is ‘elegance’.</p><br/><p>No one expressed their discontent though. An instrument only brings out the sound that the performer desires, no matter how the performer changes. They have pride that they are an already completed large luxurious instrument.</p><br/><p>Their pride will come crashing down the moment they voice their complaints. The only time they can complain is when they meet a performer who cannot handle the orchestra as an instrument. The two people who are handling them now are two excellent conductors, maestros.</p><br/><p>It was a bit later than Pierre Boulez had been expecting, but the orchestra became used to the switch in the new year, at the end of January. It was as though the two maestros were conducting separate orchestras.</p><br/><p>“What do you think, Jun? Has the orchestra gotten used to your conducting?”</p><br/><p>“Yes. I’m sure they’ve gotten used to you as well, Maestro.”</p><br/><p>Pierre Boulez smiled in satisfaction. He had overheard the orchestra members saying that they could feel a clear distinction between a hot-blooded youth and a relaxed elderly.</p><br/><p>Since it is his orchestra that has overcome this difference, he even felt proud of them.</p><br/><p>“But Maestro, there is something I’m concerned about… Isn’t this a competition and not a concert? Do you think it’ll be okay when the judges need to evaluate the violin and piano finalists?”</p><br/><p>“Isn’t that something those people need to do? There’s no reason for us to worry about it. And effort, skill, and talent are bound to show themselves in any environment. A person is qualified to be a judge if he can catch those moments.”</p><br/><p>Pierre Boulez did not seem to be worrying too much about the competition. It even seemed like he was enjoying the situation.</p><br/><p>“It’ll actually be a bit difficult to judge. I’m sure it’ll be part of the fun to watch the judges’ uncomfortable expressions. Ha ha.”</p><br/><p>Belgium’s maestro seemed to be considering the competition as a concert.</p><br/><p>“The problem is the finalists. Being paired with a conductor who fits their style will become a key component to winning.”</p><br/>\n</div>"}