{"title": "Chapter 206", "id": 206, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-206", "volume_title": "Volume 3", "body": "<h1>Chapter 206</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 6 / Chapter 206</p><br/><p>TL: LightNovelCafe</p><br/><p>“I heard you got over something that could have been a big problem? You’re good at handling yourself now.”</p><br/><p>“You already know about it?”</p><br/><p>“The committee called to say you knocked 10 years off their life. You gave them a great show?”</p><br/><p>President Stern is happy that Jun Hyuk is able to get himself out of trouble on the spot.</p><br/><p>“I barely got past it.”</p><br/><p>“It wasn’t barely. You did really well. Anyone can make a mistake, but resolving it isn’t easy.”</p><br/><p>While President Stern was praising Jun Hyuk, employees of Stern Corporation were moving busily inside the house. They were already preparing to go back to New York.</p><br/><p>“Isaac. Are you going back tomorrow?”</p><br/><p>“Yeah. Maestro Carras is making a fuss for me to hurry back. I think he wants to do the performance as soon as possible.”</p><br/><p>“Oh right, what about Danny? Can you match his performance schedule?”</p><br/><p>“Of course we need to match it. There’s no soloist who will reject the New York Philharmonic. We’re going to make adjustments with the committee. The committee won’t force a tour when a finalist has a great opportunity either.”</p><br/><p>Tara already has Jun Hyuk’s luggage packed up as well. They will be leaving early in the morning.</p><br/><p>Jun Hyuk looked at Yoon Kwang Hun.</p><br/><p>“What about you?”</p><br/><p>“I have to go to Korea. I’ll go see you when you perform with New York. Beethoven is glaring at you. Do well.”</p><br/><p>“Don’t worry. I’ll make him so surprised he’ll go back into his grave.”</p><br/><p>“This kid is getting worse by the day. You don’t know modesty.”</p><br/><p>A phone rang when Yoon Kwang Hun was about to hit Jun Hyuk’s head.</p><br/><p>– Kwang Hun?</p><br/><p>“Huh? Lawyer Baek. What is it?”</p><br/><p>Lawyer Baek Seung Ho’s voice over the phone became urgent.</p><br/><p>– You’re in Belgium now, right? You haven’t left yet?</p><br/><p>“Yeah. Why? Is something going on?”</p><br/><p>– Phew. That’s a relief.</p><br/><p>Baek Seung Ho let out a long sigh and went back to his normal voice.</p><br/><p>– Don’t come here for a while because it’s crazy.</p><br/><p>“What is? What are you talking about?”</p><br/><p>– What do you mean what is it? Of course it’s because of Jun Hyuk. His winning, his conducting, the critics calling him the 21st century Beethoven – all of it. I’ve been suffering since the morning instead of you and I just ran away. It’s so bad I can’t even do my work.</p><br/><p>The public shows more interest in the winners of the performance portions than they do in the composition portion. But as the competition was ending, the international media reported more on Jun Hyuk’s statement, conducting, and song than they did on the performing winners.</p><br/><p>The Korean media finally realized this Queen Elisabeth Competition’s core and headlines were covered in the ‘Korean Born’ that the nation is celebrating.</p><br/><p>“But what? Why can’t I go?”</p><br/><p>– If you come back, they won’t leave you alone. They’ll already be waiting for you at the airport and cafe.</p><br/><p>Cable networks are already requesting to film documentaries on Jun Hyuk. Considering not just the win but also the next schedule, or performing with the New York Philharmonic, it is an awesome ordeal. The honor of having the first Korean to conduct his own song was enough to bring out the nation’s enthusiasm.</p><br/><p>“Hey! Jun Hyuk is going to perform Beethoven’s choral symphony. The standing conductor of the New York Philharmonic will be performing Jun Hyuk’s song. They can’t even tell the difference between a symphony and concerto?”</p><br/><p>– Is that important? Anyway, there’s only news on Jun Hyuk on TV today.</p><br/><p>“So? What do you want me to do?”</p><br/><p>– Go to New York with Jun Hyuk for now. You’ll have to hold a combined interview with the Korean reporters there. Or it’ll just stay noisy.”</p><br/><p>“What do I do about the cafe? I can’t leave it empty for so long.”</p><br/><p>– Nothing happens with the cafe regardless of whether or not you’re there.</p><br/><p>When Yoon Kwang Hun had nothing to say, Baek Seung Ho’s yelled,</p><br/><p>– Ugh! Kwang Hun! I’m telling you to give a refreshing interview in New York and then come back! Let me live. I’m an employee who needs to go to work. If you don’t want to, you can come in right away. Then you’ll be swept over by the reporters instead of me, so that’s fine with me. You don’t understand even when I’m saying this thinking of you.</p><br/><p>“Alright. I’ll talk to President Stern about it.”</p><br/><p>– Do well this time. People can’t buy Jun Hyuk’s 1st album because there aren’t enough of them because of the articles. He appeared on music charts again within a day. Rake it all in for once. Hang up.</p><br/><p>Yoon Kwang Hun got off the phone and told Jun Hyuk and President Stern about the current situation in Korea. Jun Hyuk was so happy he could leap around.</p><br/><p>“Good! You can stay in New York with me for the time being.”</p><br/><p>Yoon Kwang Hun is hesitating because Jun Hyuk is staying in the apartment that President Stern lent him. On the other hand, it would be strange to leave a house that has more than enough space for 2 people and stay in a hotel.</p><br/><p>“You should do that, Mr. Yoon. I’ll take care of the interview with the Korean press you mentioned.”</p><br/><p>President Stern made an offer that Yoon Kwang Hun could not refuse when he kept hesitating.</p><br/><p>“If you go to New York, you should get dinner with Maestro Carras and talk about music…”</p><br/><p>“Thank you, Mr. Stern. I’ll make sure there are no inconveniences because of me. Then I’ll stay with Jun Hyuk for a bit.”</p><br/><p>Yoon Kwang Hun quickly took President Stern’s hand.</p><br/><p>***</p><br/><p>Jun Hyuk took out a bundle of scores on the private plane back to New York.</p><br/><p>“Take a look at this.”</p><br/><p>“When did you write this?”</p><br/><p>“Whenever I had time in Brussels. I made it into a short song.”</p><br/><p>Yoon Kwang Hun, President Stern, and Tara quickly began reading through the score.</p><br/><p>The 3 people sat with the score on the table between them but were no longer surprised. They are already aware that he can easily write songs like this. President Stern was the only one who had any type of reaction because it is not an abstruse contemporary piece.</p><br/><p>“These are 5 songs of 5 minutes?”</p><br/><p>“Yes.”</p><br/><p>“What is it? Feels like stringed instruments from the way there is a lot of portamento (sliding from one note to the next).”</p><br/><p>President Stern thought that Jun Hyuk had prepared a solo violin piece for Danny who would be in New York.</p><br/><p>“No. It’s not the strings, but soprano vocals.”</p><br/><p>“What? Soprano? Are you thinking of Laura?”</p><br/><p>“Yes. I was hoping you would bring Laura Goldberg in.”</p><br/><p>Jun Hyuk automatically smiled while thinking of Laura Goldberg’s beautiful tone.</p><br/><p>President Stern spoke as he looked at the score,</p><br/><p>“Then you need to work on the lyrics. Hm… I’ll have to look into a lyricist. Is there anything you’re thinking of? Like a poem.”</p><br/><p>“No. It doesn’t need lyrics.”</p><br/><p>“What? You don’t need lyrics?”</p><br/><p>“Yes. I wrote each song to respond to one sound. The songs are titled I, A, E, O, U. I’m going to have her sing with just 5 collections.”</p><br/><p>The 3 people had been calm until now, when their expressions changed. They knew it had been too banal. With lyrics, it is just another song. Yoon Kwang Hun in particular thought that considering the melody alone, Jun Hyuk has a lot of other songs that are more beautiful. Jun Hyuk is not one to make a song that is lesser to hand over to them.</p><br/><p>“So you want to take on another new challenge?”</p><br/><p>Yoon Kwang Hun looked at Jun Hyuk, urging him to confess his secret.</p><br/><p>President Stern put the score down and spoke to Yoon Kwang Hun,</p><br/><p>“No, Mr. Yoon. We can’t say that it’s completely new. There are already works that have been created with the human voice without any meaning to them. The difference is that the melody of Jun Hyuk’s song is beautiful.”</p><br/><p>Yoon Kwang Hun’s expression did not change even after President Stern’s explanation. He fully knows that Jun Hyuk is not one to transform or rehash something that someone else has already done.</p><br/><p>“Isaac. It is a new challenge. She needs to sing these songs without an accompaniment.”</p><br/><p>“What? You’re saying it’s an unaccompanied solo?”</p><br/><p>The ability to deliver a message will fall because there are no lyrics, and the aria cannot stop because there is no accompaniment. She needs to express the emotions with the melody, tempo, and tone alone.</p><br/><p>“Aren’t there a lot of recitals for instruments without accompaniments?”</p><br/><p>Ultimately, Jun Hyuk is trying to implement an instrument that makes one sound. With just the voice of a soprano.</p><br/><p>“Well…..”</p><br/><p>President Stern bit his lip as he realized the meaning behind Jun Hyuk’s song. He is not concerned about the song. He thought of countless primadonnas. Does it have to be Laura Goldberg?</p><br/><p>“Instruments don’t say words. Can’t they convey various emotions with just their sound?”</p><br/><p>“Hm. You’re thinking of the human voice as just an instrument?”</p><br/><p>“Yes.”</p><br/><p>“But why Laura? There are a lot of great soprano singers out there. I can get anyone for you. No. I’m pretty sure they’ll get in line once they hear that it’s your song.”</p><br/><p>Jun Hyuk smiled and scratched his head.</p><br/><p>“Famous prima donnas wouldn’t be able to withstand it.”</p><br/><p>“Withstand what?”</p><br/><p>Tara had been holding back her words but could not hold her curiosity.</p><br/><p>“There are 5 perfect sounds in my head. They’ll have to sing countless times until that sound comes out. People who are already stars wouldn’t be able to take it and I’m pretty sure they would get angry. Oh and that doesn’t mean I’m underestimating Laura’s abilities. She’ll be able to handle it.”</p><br/><p>Laura has not sung very much yet. Her unique sound will become more firm as she spends more time as a singer. It will be hard to bring out the sounds that Jun Hyuk wants if her sound becomes set in completely.</p><br/><p>“The sound can’t change even slightly. E with the same pronunciation has a fortis, an ordinary sound, and heavy sound. There are also sounds pronounced in between E and O, and E and I.”</p><br/><p>“She can’t stray even a bit… Hm.”</p><br/><p>“It’s extremely experimental.”</p><br/><p>Yoon Kwang Hun smiled at Jun Hyuk’s idea. It is the kind of music he correlates with Jun Hyuk. He has the ability to go beyond a simple song with a beautiful melody, to be pioneering and create innovatory music.</p><br/><p>“That is why I made the melody beautiful. I was actually going to make the melody irregular too… but then people won’t listen to it.”</p><br/><p>Isaac was more surprised by what Jun Hyuk just said than he was by the music. A lot of contemporary music is not created with the public’s tastes taken into consideration. It was always more important to show the composer’s intent, philosophy, and thinking. As a result, a lot of music that is not much more than noise was produced.</p><br/><p>It could be that they intentionally rejected beautiful melodies. Beautiful melodies pose the danger of bringing out emotions that the composer had not intended to evoke.</p><br/><p>But what Jun Hyuk was saying meant that he would create music that would sell to the public no matter how experimental it is. It is unbelievable that this is the Jun Hyuk who wrote the extreme Inferno.</p><br/><p>“So Isaac, try contacting Laura. You have to put in the contract that she’ll have to pay a tremendous amount of penalties if she quits in the middle… Stuff like that so she can’t get out of it. He he.”</p><br/><p>“Are you thinking of releasing an album too?”</p><br/><p>“Yes. Laura won’t be motivated either if we’re just experimenting. We’ll release an album and perform… It won’t be a bad deal for Laura either because the performance will just be one soprano since there isn’t an accompaniment.”</p><br/><p>As soon as Jun Hyuk was done speaking, President Stern looked for his satellite phone. He needs to take Laura Goldberg out before the tour for the Queen Elisabeth Competition finalists begins. While he was calling various people, the private plane flew through the Atlantic clouds of success to New York.</p><br/>\n</div>"}