{"title": "Chapter 221", "id": 221, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-221", "volume_title": "Volume 3", "body": "<h1>Chapter 221</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 7 / Chapter 221</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: adkji</p><br/><p>Sponsored: Chimemerie &amp; Sudarsan L.</p><br/><p>“This kid! What is this? When did you get here?”</p><br/><p>Danny ran over right away and hugged Colin. This is also Jun Hyuk’s first time seeing him after they separated in LA, and took the hand Colin held out to him.</p><br/><p>“Jun, the show was good. Your talent really isn’t rusty at all. No, I think it shines even more.”</p><br/><p>“Don’t talk nonsense. Why are you here all of a sudden?”</p><br/><p>“What do you mean why? I came to see the show. Neither of you pick up your phones, so I was wandering for a while.”</p><br/><p>“Oh, sorry. I left mine with my manager…”</p><br/><p>Danny finally remembered that he doesn’t have his phone on him. He was completely forgetting about where his agent was because he was surrounded by maestros. “Let’s not hang around here. We should go back home first.” Jun Hyuk took Colin’s arm and got in the waiting limousine.</p><br/><p>***</p><br/><p>“Colin! Goodness. What is a rock star doing here?”</p><br/><p>“I can’t miss Jun’s U.S. debut stage. I needed to come yesterday, but I can’t stop time.” Amelia saw Colin come through the door and also expressed her delight.</p><br/><p>“Clayton’s top beauty is still the same.”</p><br/><p>Jun Hyuk saw Yoon Kwang Hun go to Colin, who he was meeting for the first time, and introduced him.</p><br/><p>“I told you before that there’s a cellist who’s incredible on the bass, right? This is him.”</p><br/><p>“Ohh. So this is the friend who rejected becoming Yo-Yo Ma and chose Curt Kobain’s path. It’s a pleasure.”</p><br/><p>“It’s nice to meet you. I’m Colin Sabotos. Yo-Yo Ma and Curt Kobain are both remote.”</p><br/><p>Colin laughed bitterly and his old friends were busy asking how he has been doing recently.</p><br/><p>Colin released his first album and started from the bottom, sweeping through California’s clubs with an arrangement by LA Sound. It was the start of a rigorous schedule.</p><br/><p>“We released the album thanks to Jun and started performing in clubs. I would perform at 3 or 4 clubs a night, be reduced to rags, and go back to the apartment to pass out.” Colin shook his head. He was recalling memories of suffering.</p><br/><p>“The drunk jerks disturb the shows… Ugh, don’t even mention it. I don’t even want to think about it twice.”</p><br/><p>“I guess you’ve gotten out of the clubs since you’re saying you don’t want to think about it again?”</p><br/><p>When Yoon Kwang Hun spoke, Colin’s face brightened with a smile.</p><br/><p>“Yes. We’re fairly well known in the west now. Since we’ve made our band known to a certain point, we hold joint and solo concerts at times now. Of course we can’t do tours across the country yet…..”</p><br/><p>“But, it doesn’t look good from your expression.”</p><br/><p>Amelia looked over Colin’s face and spoke cautiously. It could be that he is exhausted because of a long flight or a concert, but this is not the face of a musician who was working to gain popularity.</p><br/><p>His dark shaded face shows that he is without a doubt worried about something.</p><br/><p>“We went east through LA, San Diego, and San Francisco while preparing our 2nd album. We presented new songs occasionally and reactions weren’t bad. But…” Colin faltered suddenly and his face quickly turned red.</p><br/><p>“Damn it. The drummer left.”</p><br/><p>“What? He left? How could that happen?”</p><br/><p>“Why after suffering through everything? I thought you guys were doing well.”</p><br/><p>Danny and Amelia shouted at the same time. A drummer who suddenly quits a band that is growing well. It is something that they cannot understand.</p><br/><p>“He said my music sucks. It’s just really flashy and there’s too much that’s unnecessary.”</p><br/><p>“I feel like that’s true. Isn’t it?”</p><br/><p>Jun Hyuk had been listening quietly when he spoke up for the first time. Colin’s face grew even redder.</p><br/><p>“Yeah. I tried to be cool and it was really flashy. That’s my music. But I can’t agree that the flashiness and splendor are useless. Anyway, the drummer left saying that he wants to do alternative music.”</p><br/><p>70s rock music pioneered various genres like hard rock heavy metal, blues rock, southern rock, and progressive rock, and emphasized performances with depth. 80s rock was the golden age for the guitar as a phallic symbol and a macho image of wearing leather jackets.</p><br/><p>But since the 90s, rock music has been focusing on delivering messages. Concise guitar riffs, drums that are not flashy, and meaningful lyrics are the characteristics. Like the shabby jeans and t-shirts that band members wore on stage, alternative music expressed their rejection of existing musicians’ ideas of money, love, and pleasure.</p><br/><p>Colin wants music with harmonious melodies of the guitar, bass, and drums with each part giving an admirable performance, rather than the delivery of messages in alternative rock. They just have not been able to show that admirable performance yet because they have not found a keyboardist to join them.</p><br/><p>He had tried to get Jun Hyuk to go into pop music with them in the first place because he needed Jun Hyuk’s piano skills.</p><br/><p>“I want to show the kind of music I want to pursue to the public. I’ll turn down the role of playing messenger regarding the circumstances that today’s youth have been placed in and their worries.”</p><br/><p>Colin calmed down again and quietly explained his thoughts.</p><br/><p>“If you wanted to do music that people like and not music that I want to do, you didn’t need to give up the cello. You can play the Mozart, Beethoven, and Brahms that people like.”</p><br/><p>“But don’t you think you should listen to your members’ opinions and work together?”</p><br/><p>Band members are equal relations regarding music. If there are colliding opinions, they need to reach a compromise. Though the leader’s views are most important, the leader needs to persuade the others at the least. However, Colin’s response was like that of a dictator’s. “No. I’m doing my music. All I need is a guitarist and drummer who play the music I make. If the guitarist and drummer want to do their own music, I’ll have to find other people.”</p><br/><p>In some way, Colin is like an orchestra conductor and not a band leader. He seems to be thinking of band members as instruments that implement his music.</p><br/><p>“So did you find a drummer who’s to your liking?”</p><br/><p>Danny pushed a beer towards Colin with a nervous look. Colin took a big gulp.</p><br/><p>“It’s not easy. And I can tell that the guitarist is conflicted because the drummer position is vacant. It’s a real headache.”</p><br/><p>When the atmosphere became heavy in the living room, Colin hastily waved his hand.</p><br/><p>“Sorry. I really didn’t come here to talk about stuff like this. I came because I didn’t want to miss out on that shining moment when Jun conducts the New York Philharmonic.”</p><br/><p>Jun Hyuk completed a great performance tonight. It is fitting to drink and celebrate.</p><br/><p>“Colin. Can we listen to your flashy and cool music?”</p><br/><p>“Excuse me? Oh, no. It’s too much to do now. How could I when there are so many people with sharp ears here? I’m scared when it’s obvious that all kinds of criticism will come raining down on me. Ha ha.”</p><br/><p>Colin jumped in surprise at Yoon Kwang Hun’s sudden suggestion, but everyone else clapped and welcomed it.</p><br/><p>“What of it? Honestly, I’ve never heard your music.”</p><br/><p>Amelia stared at Colin, and Jun Hyuk added in,</p><br/><p>“We won’t tell you to fix it, so let’s hear it. Don’t we need to see if you’ve been playing around until now or if you’ve gotten better?”</p><br/><p>When Colin sighed and took out his phone, Jun Hyuk turned on the audio system and connected it through bluetooth.</p><br/><p>Yoon Kwang Hun’s eyes were brightest as Colin’s new song filled the living room. This alone shows what kind of music Colin is pursuing.</p><br/><p>“This is really my style. It’s progressive rock. And the length of the song is no joke. Jun, how long is it?”</p><br/><p>“7 minutes 46 seconds.”</p><br/><p>Jun Hyuk said the time as soon as Yoon Kwang Hun looked at him.</p><br/><p>“Yeah. There’s barely any lyrics… It could even be seen as an instrumental.”</p><br/><p>“Yes. This is my favorite song. I was going to make it a complete instrumental, but I put in a little for vocals. Like seasoning.”</p><br/><p>“You mixed in Brahms. Can’t hide that you come from classical music. The configuration is charming too.”</p><br/><p>Danny gave him a thumbs up. Colin only looked at Jun Hyuk, who was not saying anything. He was waiting for the most precise evaluation of whether he has grown, stayed the same, or worst case scenario, gone backwards.</p><br/><p>“It’s good that the drummer left. Isn’t he just a hindrance to your music? I don’t think he left because of a difference in music styles, but because he’s lacking the skill.”</p><br/><p>Everyone was surprised by Jun Hyuk’s comments and their eyes grew wide, but Colin was the only person to laugh bitterly.</p><br/><p>“Well… that’s a part of it. I did push a bit. We did over 100 takes for just the drums while recording this song. We picked the best of those for this recording.”</p><br/><p>“A drummer who can handle a song like this will hear that he’s talented everywhere he goes… I’m sure it isn’t easy to find such a talent. But to tell a drummer like that to shut up and only play the kind of music that you want? It’s one issue after the other.” Yoon Kwang Hun nodded at Jun Hyuk’s words.</p><br/><p>“I’ll bet. People in their twenties these days prefer consistency to outstanding performances. It’s hard to find a talented drummer who can perform a colorful drum solo for more than 10 minutes.”</p><br/><p>Jun Hyuk looked at Colin and tilted his head. Colin’s music is similar to 70s progressive rock. The difference is that he shows more refinement in terms of technicality, but that derives more from the system than from music.</p><br/><p>“But can you release an album with a progressive song like this? I don’t think a record label would delve into such an adventure, unless it’s an independent label.”</p><br/><p>“That’s why I clash a lot with LA Sound. Eli and Alexander okayed the 1st album right away because you got rid of the progressive color with your arrangement. But now… whew.”</p><br/><p>Colin said that it is a clash, but he is telling them that it is not so with his long sigh. They will be completely rejecting the idea of releasing his album.</p><br/><p>“I was foolish when we were releasing the 1st album. I asked you for help because I wanted to succeed quickly and had a lot of expectations… And thanks to that, we got all the way here. I’ve never forgotten how grateful I am to you. But I really want to fill the album this time around with my own music.”</p><br/><p>Yoon Kwang Hun thought it admirable when he saw Colin’s determination and thought about the fact that he is still in his early twenties.</p><br/><p>“So Colin, you want to win and succeed with your music more than you want to continue your success now?”</p><br/><p>“Yes, Mr. Yoon.”</p><br/><p>“That’s a good attitude to have. You need to do your own music if you’re a musician.”</p><br/><p>Yoon Kwang Hun spoke and quickly shut his mouth. Right now, the living room is full of professional musicians. He is overreaching if he keeps talking as an amateur, and it will become an unnecessary sermon.</p><br/><p>Yoon Kwang Hun’s sheepishness did not show because of Danny. Danny spoke sadly,</p><br/><p>“Why don’t you try a public audition? Didn’t you say that your band is pretty popular in the west? You’ll get a lot of applicants.”</p><br/><p>“We did. LA Sound did a public recruitment, but I didn’t want a single person.”</p><br/><p>“Then are you going to search through New York clubs?”</p><br/><p>“No, I need to go back tomorrow to keep going with my shows. I need to go to San</p><br/><p>Diego.”</p><br/><p>Everyone’s eyes widened at mention of a show.</p><br/><p>“How do you perform without a drummer?”</p><br/><p>“We’re scraping by with a session man. It’s okay because we mainly perform songs from the 1st album.”</p><br/><p>Colin barely smiled and bolted up from the sofa.</p><br/><p>“Alright. Let’s stop talking about me and do what we really need to do tonight. Jun, you remember back when we were in a quintet and drank at a strip bar until we passed out, right? We need to get drunk like that tonight, no?”</p><br/><p>Jun Hyuk had not been drinking, but almost passed out. Yoon Kwang Hun and Amelia’s scary glares came at him like arrows.</p><br/>\n</div>"}