{"title": "Chapter 231", "id": 231, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-231", "volume_title": "Volume 3", "body": "<h1>Chapter 231</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 7 / Chapter 231</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: adkji</p><br/><p>The press conference at the hotel was a feast for the reporters. Alvin, who became a star after just 2 albums before meeting his downfall with drugs and becoming a hermit blues musician. A classical cello major holding a bass guitar. A nameless session drummer who is like Cinderella, getting the chance to perform with a world renowned star.</p><br/><p>There seemed to be no end to the interview because Korean and foreign reporters gathered to flood Alvin Lee with questions.</p><br/><p>Tara did not end the interview. The content was still good and she needed to buy more time for Jun Hyuk to overcome the shock.</p><br/><p>“Is Jun still the same?”</p><br/><p>“Yes. I checked in on him for a second, but he is sitting in the same place without moving.”</p><br/><p>It was hard for Tara to forgive herself for not knowing about this situation.</p><br/><p>“Tara. It’s something that would have happened at some point or another. It’s just that we didn’t have time to prepare… Actually, it’s a question as to whether or not we would be able to prepare for something like this.”</p><br/><p>Yoon Kwang Hun saw that Tara was being hard on herself and comforted her.</p><br/><p>“Is the interview wrapping up?”</p><br/><p>“Yes. Now, we need to end it. The reporters will think something is strange if we keep it going.”</p><br/><p>“Then, let’s cancel the solo interview. We can’t push him into a press conference in this state.”</p><br/><p>Yoon Kwang Hun made the final decision.</p><br/><p>“Alright. I’ll take care of it.”</p><br/><p>Tara tried to go to the press conference hall, but she could not take a step.</p><br/><p>“What are you taking care of? Tara, I’m a little late, right? Let’s hurry. I’m sure everyone else is having a rough time because of me.”</p><br/><p>Jun Hyuk burst through the door, took a surprised Tara by the arm, and was smiling.</p><br/><p>“Jun Hyuk. There’s no reason for you to overdo it, and we can push the interview back.”</p><br/><p>Yoon Kwang Hun felt bad that Jun Hyuk was forcing himself to smile, and his own expression continued to be hard.</p><br/><p>“Why? I’m not overdoing it. And I heard what you both said. It’s something that I’ll experience sooner or later, and it just happens to be today. Of course that ‘something’ won’t disappear on its own.”</p><br/><p>Jun Hyuk spoke in English so Tara could understand. His waved his left hand and pointed to his watch.</p><br/><p>“Don’t I need to show this watch a lot during the press conference? I know that much too, Tara.”</p><br/><p>Yoon Kwang Hun saw the smile on Jun Hyuk’s face and knew that his worries were unfounded.</p><br/><p>“Tara. Go ahead.”</p><br/><p>Yoon Kwang Hun nodded to Tara. It means there is no reason to worry. It is Jun Hyuk’s personal problem. Eventually, Jun Hyuk will make the decision.</p><br/><p>***</p><br/><p>When Alvin Lee and the others left the conference hall, the reporters just murmured in waiting for Jun Hyuk to enter. If Jun Hyuk does not show up, they will need to write articles guessing about why that is.</p><br/><p>The entrance was a little noisy, and Jun Hyuk entered the conference hall without losing his smile.</p><br/><p>“I’m sorry for making you wait. I was resting because I was not in a great condition, but I made this run late.”</p><br/><p>After Jun Hyuk’s greetings, the reporters began asking questions. They even showed the courtesy to start with easier ones.</p><br/><p>“You chose Edvard Grieg as your repertoire with Seoul Symphony. Is there a particular reason for that?”</p><br/><p>“Seoul Symphony chose that song, and I also wanted to perform it because it is a wonderful song. There won’t be a different reason for it.”</p><br/><p>“Two of the people in your band are not famous. Is there a special reason as to why you chose them?”</p><br/><p>“Once the concert is over, they will be recognized for their abilities and they will become famous. Colin, the bassist, is already performing actively in America in the west coast, and Kyung</p><br/><p>Min Ho, the drummer, is famous in the music industry.”</p><br/><p>“Since Alvin Lee got back into music, this is his first concert of such a large scale. How did you convince him to join?”</p><br/><p>“Someone else was the one to convince him, but… I’m sure that means that’s how great my song is? That it would even make a hermit come out? Ha ha.”</p><br/><p>The reporters’ response to Jun Hyuk’s joke was not good. They were all thinking of the last question they would ask.</p><br/><p>“The new solo song that you released is creating a lot of news. There are a lot of versions coming out with arrangements in different instruments. If they want to create an aria with lyrics or arrange it into pop music, would you allow it?”</p><br/><p>“I already revealed the score. If someone wants to make a song, whether it is pop or even a song for children, it does not matter to me.”</p><br/><p>The interview questions continued to be about music. It seemed to be a normal atmosphere with intermittent joking and occasional questions with depth from music magazines, but an unknown tension was staining the air.</p><br/><p>After a fairly long amount of time and it felt that they had reached the end of interview questions, reporters began to clear their throats awkwardly. As though it was a signal, one reporter bravely asked the question.</p><br/><p>“I don’t know if you know, but people have begun to appear, claiming to be your biological parents.”</p><br/><p>“I see.”</p><br/><p>They had been waiting for a longer response, but Jun Hyuk just nodded.</p><br/><p>“What does ‘I see’ mean?”</p><br/><p>“You didn’t ask a question just now, so there’s nothing for me to say.”</p><br/><p>The reporter thought that Jun Hyuk had been avoiding the question, and took the microphone. The arrow is already flying, so it needs to hit the target and that target is what Jun Hyuk is really thinking.</p><br/><p>“Alright, then I’ll modify the question. Of course, there have been people who are just trying to gain attention outrageously, but there are those who could quite possibly be your biological parents. Do you have thoughts of confirming if they are your biological parents with blood tests? And if you do find your biological parents, please tell us what you will do.”</p><br/><p>The cameras began flashing again because Jun Hyuk had been smiling until now, but his face had hardened.</p><br/><p>He sat for a while and took in the flashing cameras before slowly opening his mouth.</p><br/><p>“I will check one thing first. You said that there are ‘people’ claiming to be my biological parents, but I can’t have multiple parents so there’s a high possibility that they are all fake.”</p><br/><p>“I’m sure we can’t rule out that possibility.”</p><br/><p>“My biological parents left me my name and birth date, so that alone would be able to eliminate a lot of people impersonating my biological parents.”</p><br/><p>“Does that mean you will look for your biological parents?”</p><br/><p>“Sir, will you let me speak to the end?”</p><br/><p>When Jun Hyuk spoke with a hard face, the other reporters shut their mouths.</p><br/><p>“With ill intentions… well, I’m sure it’s money? Anyway, if anyone tries to falsely claim rights from now on, I don’t know if this is possible, but I will take legal action. They approached me with intentional fraud? Well… something like that.” Jun Hyuk took a sip of his water.</p><br/><p>“My legal representative, Mr. Baek Seung Ho, is at one of the top law firms in the country and I believe that they are capable of finding grounds for punishment. I won’t be concerned with</p><br/><p>how much it costs. I think that they will understand from what I said.”</p><br/><p>Jun Hyuk’s anger was relayed to the reporters through his determined voice.</p><br/><p>“But there is still the possibility that someone is your biological parent.”</p><br/><p>“I only attended music school, but I learned a lot beyond music. There are important things among them, and it is that greed is bad.”</p><br/><p>“Do you mean to say that those claiming to be your biological parents are showing greed?”</p><br/><p>“No. I mean that I will not be greedy.”</p><br/><p>Jun Hyuk still had the microphone in his hand, so the reporters just waited for him to go on.</p><br/><p>“I already have a parent. And a parent who loves me excessively at that.”</p><br/><p>“Are you referring to Mr. Yoon Kwang Hun?”</p><br/><p>“Yes. I still call him ‘Sir,’ but since the moment I first met him, I have never forgotten that he is my father.”</p><br/><p>Up to here was what the reporters had been expecting. It also means that he is drawing a line with the people claiming to be his biological parents.</p><br/><p>“And I have a lot of mothers.”</p><br/><p>The reporters had thought that he was done but when he kept speaking, they all put their hands down.</p><br/><p>“Teacher Go Sae Won, who led me so that I would not gain bad habits while playing the piano. Professor Jeon Hye Jin, who desperately wants me to truly express myself and grow as a proper pianist. Lawyer Baek Seung Ho, who went out of his way to interfere with the press’ malicious articles. Teachers Yoon Jung Su, Jo Hyung Joong, and Kim Jong Suk, who showed me the various possibilities of music.”</p><br/><p>Jun Hyuk started to talk about each person who worries for him.</p><br/><p>“Lawyer Lim So Mi, who never forgets to make me tonkatsu in America. President Isaac Stern, who treats me like a prince and creates an environment in which I can create music that’s better than money. And Tara Butters, who never leaves my side and takes care of me like a real older sister.”</p><br/><p>Jun Hyuk felt better after recalling the good people around him, and started to smile.</p><br/><p>“Lastly, there’s even my girlfriend, Amelia, who understands and loves me regardless of the problems I have due to my personality. All of these people are my mothers. But to look for more parents? That would be greedy.”</p><br/><p>All of the names flowed out in order. The reporters know Jun Hyuk’s precise thoughts, however,they did not want a metaphor, just his exact wording.</p><br/><p>“Can we interpret that as you’re saying that you will not be looking for your biological parents or going through DNA testing?”</p><br/><p>“Yes. And if you meet anyone claiming to be my biological parents, please be sure to tell them not to make a fit and continue living as they have been.”</p><br/><p>There was no reporter who did not feel Jun Hyuk’s deeply hidden resentment and anger when he said ‘make a fit’.</p><br/><p>“Mr. Jang Jun Hyuk. Of the people claiming to be your biological parents, they might actually just want to apologize and ask for forgiveness.”</p><br/><p>“Forgiveness? If they really want to be forgiven for abandoning me as a newborn baby, it’s not too late. They can go to the orphanage immediately and adopt a child, helping him or her grow into a great adult. Isn’t that the most suitable way to be forgiven for their past wrongs?”</p><br/><p>Yoon Kwang Hun watched the press conference and translated everything for Tara. But he could not keep translating when the word ‘father’ came out.</p><br/><p>Jun Hyuk was not able to hide how worked up he is, but looking at the way he relays this thoughts calmly and exactly, Yoon Kwang Hun just had one thought. He is all grown up. And he grew up well.</p><br/><p>When Jun Hyuk was done speaking, Yoon Kwang Hun said to Tara,</p><br/><p>“Tara, it’s all over. End the interview.”</p><br/><p>Tara had been completely silent and did not know what had been said during the press conference. Yoon Kwang Hun saw that she was nervous and smiled as he spoke,</p><br/><p>“Tara, you don’t need to worry. I’ve never seen a better interview. Jun handled it really well.”</p><br/><p>Tara saw him smiling brightly and calmed down as she went out into the conference hall.</p><br/><p>Jun Hyuk saw her come in and stood up to say his goodbyes to the reporters before leaving.</p><br/><p>“You heard the whole interview, right?”</p><br/><p>When Jun Hyuk found Yoon Kwang Hun waiting outside the conference hall, his face flushed red.</p><br/><p>“Yeah.”</p><br/><p>“What did you think?”</p><br/><p>“You were a little cool today. Kid, you’re all grown up. Makes me proud.” He hit Jun Hyuk’s back and stopped walking for a second.</p><br/><p>“Oh. The ‘make a fit’ at the end was a little much, but… ugh, damn whatever. Anyway, you did well.”</p><br/><p>Tara saw that both of their expressions were bright and felt as if a burden had been</p><br/><p>lifted.</p><br/><p>“I’m hungry. Let’s go eat something.”</p><br/><p>Tara locked arms with both of them and headed to the restaurant.</p><br/>\n</div>"}