{"title": "Chapter 247", "id": 247, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-247", "volume_title": "Volume 3", "body": "<h1>Chapter 247</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 7 / Chapter 247</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>President Stern took his glasses off and explained the numbers.</p><br/><p>“There are already over 700 places that say they want to arrange and use the songs. They’re places like record labels, agencies, and management agencies.”</p><br/><p>“700?”</p><br/><p>Jun Hyuk bolted up and stared at the laptop.</p><br/><p>“Players who want to hold concerts with instruments. Composers who want to arrange it with lyrics as pop music. Vocals who want to sing it the way it is as an aria. This is a first for me too.”</p><br/><p>Jun Hyuk moved the mouse cursor around to figure out the total of the numbers, but the list of numbers was never ending.</p><br/><p>“There are already several amateurs who arranged or added lyrics without our permission. There’s a lot on YouTube too.”</p><br/><p>Stern Corporation’s legal team already proposed sharing ad revenue from the YouTube users who uploaded the song without permission. They included discussions on copyright infringement issues as well.</p><br/><p>“Of these, there are those who released formal albums and there are those who are preparing. We contracted the use of this song at $10,000 to $50,000. It’s case by case.”</p><br/><p>“And there are still this many people who say they want to use it?”</p><br/><p>Even Jun Hyuk thought that $50,000 is too expensive.</p><br/><p>“Because it’s hard for them to find such great material. ‘A, I, U, E, O’ isn’t just a melody. That’s why there’s less burden for how the arrangement comes out. It’s actually just a remake if the arrangement is done and there’s a song complete with an accompaniment and lyrics. There’s no room for the arranger’s abilities to intervene.”</p><br/><p>A remake needs to be better than the original to be the main song. If it falls even a little short, criticism is a given and the album does not sell.</p><br/><p>“But the important thing is that this isn’t the end. Royalties and composition fees come in every time albums and singles that have lyrics or are arranged sell. Honestly, I can’t even guess how much that will be or how high it’ll go. Our staff had to stop after trying to estimate the sales.”</p><br/><p>There is already a return of $30 million in revenue. This amount is just the start though. President Stern’s expression was so subtle that it was indiscernible what it meant, whether he was happy about it, surprised by the tremendous amount, or worried that he cannot handle it.</p><br/><p>“So that means it’s much better than releasing a completed song as a record?”</p><br/><p>“Incomparably. The biggest advantage is that people of different countries put in the lyrics and emotions that fit each respectively so it’s suitable to the people of that country and there is a variety of completed songs. There’s no end to this.”</p><br/><p>All of this started with the beauty of the original song’s melody.</p><br/><p>“We already got a call from the Guinness Book of World Records. They want us to add it up and let them know. It’ll go up as the song with the most variations.”</p><br/><p>“Really? That’s really unexpected.”</p><br/><p>To Jun Hyuk, it is just a song that he made to bring out Laura’s voice. He never thought of results like this.</p><br/><p>“I’m cautiously expecting that this will bring in way more than any of the other songs you’ve released until now.”</p><br/><p>Fees and royalties, shows, TV broadcasting, insertion in dramas and movies. These are all areas to expand into as different versions.</p><br/><p>“This is basically like a goose laying a golden egg.”</p><br/><p>Jun Hyuk thought hard for a while and snapped his finger.</p><br/><p>“Isaac. Should we just make a farm?”</p><br/><p>“What? A farm?”</p><br/><p>Isaac Stern saw Jun Hyuk’s face full of jest and laughter, and could guess what he meant by a farm.</p><br/><p>“Yes. As long as there’s a beautiful melody, people use it to make pop music and instrumentals. And there will be all genres depending on how the arrangement for pop music is done. Since the lyrics are written according to that nation’s emotions, the sales rates will be beyond the basic.”</p><br/><p>It is as he expected.</p><br/><p>“So you’ll only create and release melodies? It is a good idea but wouldn’t it be too hard for you? Why don’t we slowly revisit that issue after completing the opera? You’re not bored with composing the opera, are you?”</p><br/><p>He felt his stomach drop because he thought that Jun Hyuk might say that he will focus everything on composition because there is nothing better for making money, it is what he finds the most fun, and it is easiest for him.</p><br/><p>Jun Hyuk waved his hands and got up from the sofa. He slowly paced the room and spoke,</p><br/><p>“Working on the opera is fun too. As you said, there’s no time to create a different melody. I’m just saying that there’s no reason to wait until then. Didn’t I tell you before? All of the songs I haven’t released yet are in storage. Let’s just release all of those at the same time.”</p><br/><p>Storage? Is he talking about the songs he has not released yet? President Stern recalled the tremendous amount of scores that Yoon Kwang Hun showed him when they met for the first time at the cafe.</p><br/><p>“Hang on. The melodies that are between 3 and 5 minutes… Oh right, the ones that are preferred most are the 2 songs, A and O, right?”</p><br/><p>“Yeah, since the range for those 2 songs isn’t high…”</p><br/><p>“The ones I made are easier on the ears. Like Mozart.”</p><br/><p>The word ‘Mozart’ echoed in President Stern’s ears.</p><br/><p>“How… how many songs are there? The ones that are easier and comfortable to listen to.”</p><br/><p>“A little over 100? Probably?”</p><br/><p>President Stern’s jaw dropped. Songs with major copyrights like that of the Beatles or Abba receive $30,000 in fees each time they are used in movies or on TV. However, it is rare for these to have been remade into songs that fit each country.</p><br/><p>Over 700 versions will be created from just 5 songs. How many songs will result from over 100? Jun Hyuk surprised President Stern again.</p><br/><p>“If we’re making melodies that are just moderately good to listen to, I could make dozens on the spot. If I put them on a score, it means that they are pretty complete.”</p><br/><p>President Stern’s hands trembled as he watched Jun Hyuk talk about it as though it is no big deal. He does not think that Jun Hyuk really understands the weight of revealing those scores.</p><br/><p>A little over 100 songs could become thousands and tens of thousands of songs, hit the world hard, and keep coming on 50 years after he dies like those of the Beatles and Abba.</p><br/><p>If they are songs that are of high standard as Jun Hyuk said, the pop music industry could become filled with the music of one composer the moment they release all of the scores.</p><br/><p>He remembered what he had said as a joke to Jun Hyuk before. That he wants to see him as the person with the most Grammy Awards. President Stern realized that this dream was too simple for Jun Hyuk.</p><br/><p>“Anyway, I’ll make a call to Korea and ask for copies of the scores.”</p><br/><p>“Al – alright. If there’s anything you don’t want to reveal, you don’t have to…”</p><br/><p>“What is it? Why are you being like that all of a sudden? You asked me a bunch of times when I would release the scores I had stacking up. He he.”</p><br/><p>Jun Hyuk thought it was unexpected that Isaac Stern seemed strangely nervous, but he acted without hesitation.</p><br/><p>“Sir, this is Jun Hyuk.”</p><br/><p>– Yeah. How’s the work on the opera going?</p><br/><p>“It’s going well thanks to you.”</p><br/><p>– Of course, of course. Of course it’s thanks to me. You saw the Godfather series with me multiple times. If it weren’t for me, you wouldn’t have come up with the idea to make that movie into an opera.</p><br/><p>“Oh sure. Of course.”</p><br/><p>They went back and forth bragging in such seriousness that it did not feel like they were joking. Jun Hyuk chuckled.</p><br/><p>“Sir. You have a separate collection of my scores with just melodies, right?”</p><br/><p>– Yeah. Why?</p><br/><p>“Can you send me a copy of those?”</p><br/><p>– Copies? You can rewrite them if you need to. Don’t you remember all of them?</p><br/><p>“I do, but we’re thinking of releasing all of them. How am I supposed to write all of them again?”</p><br/><p>Yoon Kwang Hun’s voice started shaking over the phone.</p><br/><p>– You’re going to release all of them? Finally?</p><br/><p>“Yes. Interesting things are happening with these.”</p><br/><p>Jun Hyuk told him about how his original song is changing and developing.</p><br/><p>– Goodness. There was that much of a reaction?</p><br/><p>“That’s what I’m told. I was thinking of just making it into a piano or string instrumental, but I don’t think it’s a bad idea to use them as sources of various genres either.”</p><br/><p>– I see. It’s really a surprising method. So it’ll be impossible to get all of your songs in an album. There will be hundreds – no – thousands. Ha ha.</p><br/><p>His voice could not hide his excitement that Jun Hyuk’s music would spread out all over the world.</p><br/><p>– Let me know where I need to send the copies. I’ll send them by tomorrow.</p><br/><p>President Stern was still shaking until the end of Jun Hyuk’s phone conversation.</p><br/>\n</div>"}