{"title": "Chapter 244", "id": 244, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-244", "volume_title": "Volume 3", "body": "<h1>Chapter 244</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 7 / Chapter 244</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>He had not heard that Jun Hyuk wrote an opera yet, so he thought Jun Hyuk would be happy if he heard a proposal for an opera with a huge production budget. Jun Hyuk will need to concentrate completely on creating a masterpiece if he accepts the proposal, and Stern even calculated that he would drop out of the tour.</p><br/><p>President Stern used the name Maestro Jun and contacted rich people with free lives, especially rich Italians, to propose the opera and people immediately filled in the other $55 million funding.</p><br/><p>The plan up to here had come along without issues, but he wants to continue with the tour?</p><br/><p>President Stern spoke quickly and plainly,</p><br/><p>“Jun. Can I say what I’m thinking?”</p><br/><p>“Excuse me? Why are you like that all of a sudden? You can just say whatever you want to.”</p><br/><p>Jun Hyuk found the way that President Stern’s tone changed, unfamiliar.</p><br/><p>“The tour with Alvin. What do you think about dropping out?”</p><br/><p>“Yes. Why all of a sudden?”</p><br/><p>“3-month cross country tour. A world tour would be at least 6 months. I think it’d be better for you to spend that time creating.”</p><br/><p>“Hm. I don’t know why you’re saying this all of a sudden… Then, can you tell me what makes it better than the tour?”</p><br/><p>“Acting however you want. You’re not being in the mood to perform because of Inferno. Is that right?”</p><br/><p>President Stern watched Jun Hyuk’s expression carefully. A bitter smile passed his face.</p><br/><p>“That is right. But don’t worry because it’s not enough to give up the tour.”</p><br/><p>There’s a promise I made to your father. I told him I wouldn’t make you do anything that you don’t want to do just because of money. The reason why you’re doing the concert isn’t 100% because of the money, but don’t do it if there’s any part of you that doesn’t want to do it.”</p><br/><p>He is speaking in a decisive tone. Jun Hyuk is used to President Stern always speaking as though joking, and is hearing him speaking as though giving a command for the first time.</p><br/><p>“It’s better to use that time to write a song. And if you really are going to take on the opera, you’ll have to work on the scenario too. You’d be the chief of this work, so let’s make sure the scenario comes out perfectly from the beginning. You have to create it with the writer.”</p><br/><p>Jun Hyuk hesitated for a moment before speaking,</p><br/><p>“Is it really okay for me to back out?”</p><br/><p>“Of course. I’ll make sure there are no problems with the tour, so don’t worry about that.”</p><br/><p>He automatically sighed in relief. It worked. There are times with auspiciousness is necessary. President Stern said what he had been feeling.</p><br/><p>“And forget Inferno now. I know you didn’t like the New York Philharmonic’s performance, but what are you going to do? It is that difficult of a song. No one will think about performing it completely for the time being. It isn’t a bad idea to leave it as homework for a while.”</p><br/><p>When the New York Philharmonic was mentioned, Jun Hyuk realized that there had been a misunderstanding.</p><br/><p>“What? What are you talking about? The New York Philharmonic’s performance wasn’t bad. I was able to discover a new side, too. Did you think I was like this because of the concert?”</p><br/><p>“What? It isn’t? Then?”</p><br/><p>“You misunderstood. I’m creating a new version of Inferno right now… but it’s a lot harder than I thought it would be. It was giving me quite a headache.”</p><br/><p>“A new Inferno? Well I’ll be!”</p><br/><p>President Stern’s first thought was that the opera proposal was a great idea. Inferno again?</p><br/><p>“Jun. Sometimes, the solution is to leave a problem unsolved. I don’t know why you’re trying to fix it, but I heard the Inferno album and looked over the score carefully. No matter what anyone says, Inferno is a masterpiece.”</p><br/><p>Jun Hyuk did not say anything and only nodded. It is hard for him to explain to someone else what he is working on now. Isaac Stern could be right as well. It could be an assignment that he needs to solve alone for the rest of his life.</p><br/><p>***</p><br/><p>When Alvin Lee’s cross country tour was about to start, the press shouted for joy again. It was because of Jun Hyuk not participating as well as the reason for that.</p><br/><p>“Currently, we have obtained the copyrights for the original novel and movies. We are also searching for production staff including a writer to take on the opera scenario and an art director to handle the set. We will create a crew that is the best fit for Maestro Jun. Please look for exciting things to come.”</p><br/><p>Stern Corporation’s public announcement was included in all press outlets.</p><br/><p>A young genius who always creates newsworthy music is making a traditional Italian opera worthy of exhibition in a museum. Furthermore, that opera is of a masterpiece of a movie that has continued to gain new followers over the last 40 years.</p><br/><p>Though all they did was to reveal their plans, they were pelted with phone calls from all respectable management agencies and organizers. They asked about audition schedules to get their agencies’ vocals included, and discussed their intentions to promote additional performances following the premiere in Milan’s Teatro Alla Scala.</p><br/><p>It seemed that no one thought the opera would be a failure. Half of this was because of the power that the movie ‘Godfather’ has, and half is that they trust Maestro Jun’s abilities.</p><br/><p>***</p><br/><p>Tara flew to California with Jun Hyuk and was in awe by the endless vineyards spread out below them. Proprietor of luxury wine brand Inglenook produced in Napa Valley, the main source of America’s wine, is Grandfather’s director Francis Ford Coppola.</p><br/><p>“Tara. Is Director Coppola the owner of this place?”</p><br/><p>“Yeah. I heard he now feels more pride in being the owner of Inglenook Winery than he does as a movie director. I’m pretty sure he invested most of the money he made through film in this.”</p><br/><p>When they arrived at the winery building, Director Coppola was waiting for Jun Hyuk.</p><br/><p>“There shouldn’t be anything in particular that I can be of help with… You’ve come to me since Mario Puzo, the original author, has passed away.”</p><br/><p>“No, that’s not it. The opera’s original will be the movie. That’s why we purchased the rights for the films as well.”</p><br/><p>“And how did you come to such a nonsensical thought? Ha ha.”</p><br/><p>Director Coppola laughed as he offered Jun Hyuk wine. He did not taste anything special, but he drank each sip as though he were melting it on his tongue because the 1941 Inglenook wine is currently worth $30,000.</p><br/><p>“Godfather was the only original that met the demands of the investors. I don’t know much because I haven’t read much.”</p><br/><p>“Alright. Then let’s see what you were so curious about that you flew all the way here. I honestly looking forward to it too.”</p><br/><p>“Is the Italian mafia really elegant upper class gentlemen as they’re shown in the movies? The things they do and their natures are that of gangsters, but they’re drawn out as complete businessmen.”</p><br/><p>Director Coppola did not put his wine glass down, and only smiled silently. It seems he is looking back into a distant past.</p><br/><p>“Of course not. Do you want to know something funny? The real boss of the mafia at the time of the movie’s release and the boss of New York’s 5 families, George Bonanno, himself came to see it. I heard that he changed the way he dressed and spoke to be like that of Marlon Brando or Don’s Vito Corleone after that. I didn’t draw the mafia, but they copied the movie. He he.”</p><br/><p>A movie really is just a movie. It was what he expected, but the illusion was shattered. The young and old artists discussed movies and music for a long time.</p><br/><p>“The scene where Vito Corleone dies of a heart attack while playing in a tomato field with his grandson. What kind of scene did you want then? And were you able to capture it the way you wanted to on camera?”</p><br/><p>“Since you said you watched it too, why don’t you tell me first?”</p><br/><p>“It’s cool until the very end. That’s what I thought.”</p><br/><p>Jun Hyuk watched Director Coppola as he responded, but the old great was not fooled.</p><br/><p>“Nothing flat like that, but the truth. A musician, and someone called a genius at that, can’t express his thoughts about that scene as something cool.”</p><br/><p>Jun Hyuk’s already wine-flushed cheeks grew even more red. Why are these old people so perceptive? This director and Isaac Stern.</p><br/><p>Jun Hyuk scratched his head and spoke slowly,</p><br/><p>“I felt like it was laughing at something. Wouldn’t it have been more like the godfather of a mafia if he died with bullets all over his body from the opposing family? An old man whose everything is playing with his grandson after retirement. It ended with a humbel death as an average old man, with the only difference being his wealth.”</p><br/><p>Director Coppola emptied his wine glass and recalled the passion of filming at the time.</p><br/><p>“You’re right when you say average. But it wasn’t humble or laughing at anything.”</p><br/><p>“Then….?”</p><br/><p>“I just wanted to draw the death of an average old man. Vito Corleone’s life was really tumultuous. I didn’t want to condemn or praise his life. He was just the head of a household supporting his family, and he’s just an average old man after retiring. You can’t say an old man is average if he’s shot to death.”</p><br/><p>Jun Hyuk was thinking of ending the opera with Vito Corleone’s death. The expression of his death will decide the opera’s success. He needs to avoid having it called a second decoction of the movie no matter what.</p><br/>\n</div>"}