{"title": "Chapter 264", "id": 264, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-264", "volume_title": "Volume 3", "body": "<h1>Chapter 264</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 8 / Chapter 264</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>It had been long since Jun Hyuk had seen Dario Argento, but he was still lively. He never made a public appearance after the premiere of opera ‘Godfather’ so it was hot news that he was in New York.</p><br/><p>He only had one response for the reporters pouring questions on him at the airport.</p><br/><p>“Opera ‘Godfather’ is my last performance and the album I’m working on with Maestro Jun will be my last album. I will not be coming out with anything from now on.”</p><br/><p>He is the only person who could know if the reason why he declared that his last voice is the opera ‘Godfather’ is a marketing tactic to raise album sales.</p><br/><p>When Argento arrived at the studio, his jaw dropped at its size.</p><br/><p>“A full orchestra? No, it’s bigger.”</p><br/><p>“It’s big enough to accommodate a chorus as well.”</p><br/><p>“Well well. Are you intending to become secluded in here? Like a dragon locked up in a dungeon. Ha ha.”</p><br/><p>“I intend to be that dragon for the 2 years until JS Center opens.”</p><br/><p>“What about that incredible orchestra? Is it good enough as your instrument?”</p><br/><p>Argento knew about his recruitment of orchestra members, since it made noise all over the world.</p><br/><p>“We’re tuning it first. There’s a lot to fix up.”</p><br/><p>“Really? I’m sure we’ll be able to tell when we’re recording.”</p><br/><p>These are songs that he is singing for the first time in over a year, but Argento did so well that he got the OK sign from Jun Hyuk in one go. It was clear that he had practiced a lot with the recording ahead of him.</p><br/><p>The short time period of a year brought a lot of change to the old man. His voice got rougher and it made a metallic sound. This kind of voice is more like that of an old mafia’s.</p><br/><p>Opera viewers, who had been unable to hear Argento’s singing, will listen to the album and think it a pity that there will never be a casting so perfect for the role.</p><br/><p>Unexpectedly, the entire recording process took over 6 months. All of the singers had different schedules, so it was difficult to gather people for their duets and trios.</p><br/><p>Even 6 months was only possible by recording singers and working on the mixing separately. If they had done it properly, it would have easily taken over 1 year.</p><br/><p>For 6 months, Jun Hyuk not only worked on the opera album, but he produced a total of 4 albums. The 3 musicians who made his ears perk up while he was vacationing in Switzerland, the musicians who arranged Jun Hyuk’s album to release albums.</p><br/><p>The female singers from England and America, and the rock band from Northern Europe’s Finland put lyrics to the music that Jun Hyuk made for them and flew to New York.</p><br/><p>“The lyrics are in English.”</p><br/><p>“Yes, Maestro. It’d be stupid to put Finnish lyrics to such an amazing song.”</p><br/><p>The Finnish rock band did not want to miss this perfect opportunity to get out of their country and become known worldwide, so they put English lyrics in for all of the songs.</p><br/><p>“Hm… I liked the special characteristics of Finnish. And I did compose the music with that in mind.”</p><br/><p>They all became uncomfortable. If they receive this maestro’s touch, they are bound to become stars.</p><br/><p>Didn’t the media compare them to Cinderella as well? They were given media attention for the first time with just the fact that they received Maestro Jun’s music.</p><br/><p>But they cannot keep playing around in Finland’s small market.</p><br/><p>“Sing in your mother tongue so you can deliver your message exactly. Even if people in other countries can’t understand the lyrics, they’ll get your sincerity.”</p><br/><p>“Maestro, our English is perfect too. There isn’t a language barrier.”</p><br/><p>They cried out quickly. They want to become like the global band from Finland, Nightwish.</p><br/><p>They were dreaming of becoming the 2nd Nightwish, placing on Finnish charts for half a year whenever they release albums and selling out world tours.</p><br/><p>And it felt like they had their hands on the door to achieving this dream now. But they can’t use English?</p><br/><p>“You’re still foreigners. I’m sure you can write, speak, and hear in a different country’s language perfectly. But in order to express your personal deep area, the mother tongue is better. You didn’t write the lyrics without thinking, did you? And I’ll say it again, but I fell for the Finnish language.”</p><br/><p>“But Maestro, in order to get your great music out to the whole world, isn’t it better to use English?”</p><br/><p>The band members made great effort to persuade Jun Hyuk, but Jun Hyuk grew even colder.</p><br/><p>“I think you’ve misunderstood… but I don’t care whether your band reaches worldwide stardom or the best band in Finland. I gave you the music and proposed creating an album because I wanted to bring out your musicality, potential power, and the zest of your language.”</p><br/><p>All of the band members could not respond to Jun Hyuk’s determinedness. They realized what they had mistaken. The young maestro is not a star making producer like Quincy Jones. He is someone who does not care about anything beyond creating perfect work like popularity or money.</p><br/><p>“Either come back with Finnish lyrics or let’s just say this didn’t happen. Since I’ve prepared the airline ticket and hotel, take a tour of New York and go back.”</p><br/><p>“Oh, no. We’ll rewrite the lyrics in Finnish.”</p><br/><p>They quickly shouted out while waving their hands.</p><br/><p>“I’ll extend the time that you stay in the hotel. Take your time and create great lyrics. Then.”</p><br/><p>When the band members left with their shoulders slumped down, Jun clucked his tongue.</p><br/><p>“Kids don’t know what late bloomers are.”</p><br/><p>***</p><br/><p>The last record was Colin band’s 2nd album. Once the world tour was over, Alvin Lee went back to his hometown. He is a musician who plays the blues with just an acoustic guitar and his voice in a small theater for 2 hours every night.</p><br/><p>Countless agencies gave him calls to sign on with them during the tour, but he refused all of them.</p><br/><p>“I’m still a drug addict. I’m just restraining myself. The life of a big star will inevitably test my resolve, and I don’t have the confidence. I don’t want to start snorting cocaine again.”</p><br/><p>He chose the path of seclusion.</p><br/><p>Jun Hyuk looked over the score and demo CD that Colin gave him, and did not hide his admiration.</p><br/><p>“Great. You’ve even become tasteful and restrained now. There really is a difference after swimming in big waters.”</p><br/><p>“Todd’s influence was big. It’s not the Colin band anymore. It’s just Violon.”</p><br/><p>“What can I do for you?”</p><br/><p>“Will you be the producer? Just like this without arranging it.”</p><br/><p>Colin showed his confidence. It could become better with Jun Hyuk’s arrangement, but it is also his will to show their own music.</p><br/><p>“You know I’m really expensive, right?”</p><br/><p>“I hope you have a good alumni discount.”</p><br/><p>Jun Hyuk laughed and Colin put his hands together to ask politely.</p><br/><p>All of the albums including Colin’s will be released through JS Music, an affiliate record label that will be established under JS Foundation.</p><br/><p>Until JS Foundation’s official launch next February, Jun Hyuk was busy with producing music and training his orchestra, while Isaac Stern was busy focusing on establishing the foundation.</p><br/><p>***</p><br/><p>The sound engineers were unable to spend their time idly at the studio even on days when there were no official album recordings. Jun Hyuk recorded the orchestra’s practice sessions everyday, compared the sound heard through speakers and the sound heard in real life, and tuned the equipment.</p><br/><p>When orchestra practice ended in the giant recording booth, Jun Hyuk was always recording something while playing the drums, guitar, and synthesizer by himself.</p><br/><p>They even had to spend all night working whenever the hard disk was completely full with music files and they needed to mix the tracks according to the order Jun Hyuk gave them.</p><br/><p>Songs ranging from guitar riffs that are easy on the ears, drums with concise tempo, to symphony rock songs that are over 10 minutes long, kept stacking up without indication of where they would be used.</p><br/><p>Today without fail, Jun Hyuk played alone in the recording booth. When he came out, 2 people were waiting for him.</p><br/><p>“Alex! Eli! Goodness.”</p><br/><p>LA Sound’s top producers Alex Jenkin and Eli Gotez bowed to Jun Hyuk in exaggerated noble gestures.</p><br/><p>“My Maestro. It’s an honor to get to meet you like this again.”</p><br/><p>“What is this? Stop playing around and get up.”</p><br/><p>The 2 men straightened their backs and hugged Jun Hyuk.</p><br/><p>“We thought you’d become the leader of a top band like U2 or Metallica, but you went beyond our imaginations. Who knew you’d become Beethoven?”</p><br/><p>He realized that a lot of time had passed by looking at them. Alex Jenkin’s sharp eyes had become gentle and Eli’s hair was starting to grey.</p><br/><p>“No way. I was a Clayton-Hoffman student at the time. I was more in classical music than a band.”</p><br/>\n</div>"}