{"title": "Chapter 265", "id": 265, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-265", "volume_title": "Volume 3", "body": "<h1>Chapter 265</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 8 / Chapter 265</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>Yoon Kwang Hun and President Stern focused on their work with the foundation. President Stern in particular, was intent on creating a last big blast and mobilized his entire network.</p><br/><p>That blast however, did not go for long. He fainted at a fundraising event and was taken to the hospital. Jun Hyuk was contacted that President Stern had fainted and was about to go to the hospital right away, but Tara held him back.</p><br/><p>“You can’t meet him anyway. He’s in a coma, so he’s not allowed visitors. The hospital said they would call us after a thorough examination, so let’s just wait.”</p><br/><p>The call they waited for, came after 10 days. For those 10 days, Jun Hyuk had not been able to do anything and was just checking his cellphone. All he could think about was what if President Stern was leaving the world without even saying goodbye.</p><br/><p>When Jun Hyuk and Yoon Kwang Hun rushed to the hospital, they went through the doors to a VIP ward and heard the spirited voice of President Stern that they were so used to.</p><br/><p>“Oh, Jun. Good, you’re here. Save me. I’ll die within 10 minutes if I stay here with these women.”</p><br/><p>There were 4 women next to President Stern, from one woman who looked to be past her 70s to a woman who looked to be in her 30s.</p><br/><p>When the women saw Jun Hyuk, they gave President Stern light kisses and left the ward.</p><br/><p>“Isaac. Are you okay? How do you feel?”</p><br/><p>“Ack! Jun! Look behind you!”</p><br/><p>When President Stern suddenly yelled, Jun Hyuk and Yoon Kwang Hun looked behind them in surprise. But all they saw was the closed door to the ward.</p><br/><p>“Why? What is it?”</p><br/><p>“He he. Neither of you will be able to see it, but I can see the Grim Reaper holding a big sickle.”</p><br/><p>They let out sighs of relief. He’s joking even at a time like this? However, his words also had meaning beyond a joke.</p><br/><p>President Stern is facing his death confidently.</p><br/><p>“What is this? You’re totally fine. The Grim Reaper must run away because he’s surprised.”</p><br/><p>Yoon Kwang Hun laughed in disbelief as well.</p><br/><p>“But who were those woman just now?”</p><br/><p>“Oh, my ex-wives. They all came running here because they heard that I’m dying.”</p><br/><p>When they had come through the door, the room had been full of the sound of laughter. It was difficult for Jun Hyuk to understand because he thought that ex-wives would have the attitudes of enemies.</p><br/><p>“What? There was one woman who looked to be in her 30s. She wasn’t your daughter?”</p><br/><p>On top of that, there had been a woman to young to have been married to a man over 80. It would have been more appropriate to say that she was his granddaughter.</p><br/><p>“No. Is she 32 now? She was my last wife. Was she 23 when she married me? Or 24?”</p><br/><p>Yoon Kwang Hun grabbed his head. It is hard to believe that this hearty old man is in critical condition.</p><br/><p>“You’re on good terms with your ex-wives. What’s the secret?”</p><br/><p>“There’s really nothing to it. You become good friends if you give them much more in alimony than they were expecting. Jun, keep that in mind. Don’t hold back on money when you get a divorce from Amelia.</p><br/><p>“I haven’t even gotten married yet.”</p><br/><p>They are supposed to laugh, but the laughter does not come out. He spoke up slowly instead.</p><br/><p>“Did the test results come out?”</p><br/><p>“They did. They kept me tied up here for 10 days – there better be results.”</p><br/><p>Jun Hyuk could not ask about the results. President Stern did not say anything either, and just smiled bitterly. Yoon Kwang Hun however, glared at President Stern as he spoke.</p><br/><p>“I can’t believe whatever the results say. The report on the diagnosis you sent me while I was in Korea said that you had 6 months at most. But weren’t you fine for over a year? The results now are the same. You’ll live for another 10 years at least.”</p><br/><p>“What? You saw it a year ago?”</p><br/><p>Jun Hyuk looked at Yoon Kwang Hun in surprise.</p><br/><p>“That’s why I took the position as Chairman of the foundation. I thought it’d be a big deal if Mr. Stern passed away all of a sudden.”</p><br/><p>He finally understood why Yoon Kwang Hun had come flying to New York so suddenly. He was someone who never interfered and got involved.</p><br/><p>“But you’ve been fine for over a year. Isaac, hurry up and get discharged. This hospital’s just full of quacks. We can’t believe them.”</p><br/><p>President Stern shook his head.</p><br/><p>“It’s real this time. The doctors said something about my illness, but the name of it was so hard I can’t remember it. Damn, there are so many diseases.”</p><br/><p>“It isn’t any incurable, is it?”</p><br/><p>“Of course it is.”</p><br/><p>Their smiles disappeared. An incurable illness for someone of that age means he is a terminally ill patient. He basically has a death sentence.</p><br/><p>“There’s one thing I know clearly of the endless amount of illnesses out there. And it’s the most fatal. It’s age. Aging.”</p><br/><p>Time is the incurable disease that no one can avoid. Isaac Stern knows that he is standing on the end of that time.</p><br/><p>“I’ve lived a long life. I’ve lived more than 80 years, so that’s enough.”</p><br/><p>President Stern smiled brightly. It looked like he is entirely satisfied with his life.</p><br/><p>“But it’s a relief, right? If I had died before meeting you – no – if I hadn’t had the chance to be your agent, I would have died without experiencing that miraculous moment, wouldn’t I have? I watched everything with my two eyes without missing anything, so no one is as fortunate as I am.”</p><br/><p>President Stern held Jun Hyuk’s hand tightly and spoke to Yoon Kwang Hun.</p><br/><p>“Mr. Yoon, it’s the same with you. It could have been that I lived longer because I had the chance to work on the foundation with you.”</p><br/><p>“We’re the fortunate ones. Isaac, we’re living while doing everything we want to because of you.”</p><br/><p>Everyone thought of the first times they met each other, and got lost in the memories of the past. It was like pulling out the memories of someone who is about to die.</p><br/><p>“But why are we talking as though I’m going to die at any moment? Look here. Stop!”</p><br/><p>Yoon Kwang Hun looked at President Stern shouting, and clucked his tongue.</p><br/><p>“From the way you’re speaking, it looks like you’ll live at least 10 more years. You’ll get married another time, too.”</p><br/><p>Jun Hyuk and Yoon Kwang Hun left the ward, worrying about President Stern who was having difficulty breathing. The path to meet his doctor felt long and their footsteps were heavy.</p><br/><p>“I can’t make any promises. He’ll lose consciousness several more times going forward and if he can’t wake up… there’s nothing our medical staff can do.”</p><br/><p>“You don’t know the minimum term for survival?”</p><br/><p>“He could lose consciousness and pass away even now. The only thing I can tell you for sure is that he won’t be able to make it past 1 month.”</p><br/><p>They left the doctor’s remarks of cautious confidence behind and left the hospital.</p><br/><p>“Jun Hyuk. There’s 4 months left until the opening ceremony for JS Center, right?”</p><br/><p>“Yes. But before that…..”</p><br/><p>“Yeah, we’ll need to. He needs to see his incredible heritage before he closes his eyes.”</p><br/><p>They had tears in their eyes as they sat in the limousine.</p><br/><p>“The large theater is complete, right?”</p><br/><p>“Yes. There’s no issue putting on a show in that theater. The small theaters aren’t ready yet.”</p><br/><p>“Then there won’t be a problem for the opening ceremony show. The problem is preparing for the song.”</p><br/><p>“It’s impossible to be ready within a month. The song is complete, but I heard that the ballet troupe has just finished casting.”</p><br/><p>It had been President Stern’s idea to put on a ballet for the opening ceremony show. It was to show that JS Center is not just for music, but a comprehensive space for art.</p><br/><p>XBC (Xavier Ballet Company), which is currently recognized as the best in America, showed a lot of interest in Jun Hyuk’s first ballet song. They brought on choreographer Matthew Powell, who is the top choreographer of modern dance.</p><br/><p>Matthew Powell is an Englishman, praised for being the choreographer to lead the 21st century with his unconventional choreography of Romeo in jeans and Juliet in a miniskirt.</p><br/><p>“Then we have no choice but to put a different piece on stage.”</p><br/><p>“I’ll prepare the show, so don’t worry about it.”</p><br/><p>“Alright. I’ll take care of the other problems.”</p><br/><p>The other problems Yoon Kwang Hun is talking about include getting XBC’s understanding, explaining the situation to the VIPs invited to the opening ceremony to let them know about the sudden change in date and asking them to attend. This includes Belgium’s Queen Matilda.</p><br/><p>Yoon Kwang Hun made various calls to give out orders, while Jun Hyuk’s phone rang.</p><br/><p>“Jun, it’s me.”</p><br/><p>“Maestro Carras.”</p><br/><p>“I heard you just left the hospital. Are you on your way back to the studio?”</p><br/><p>“Yes, Maestro.”</p><br/><p>“Then can you make some time for me? There’s something I want to talk to you about.”</p><br/><p>“Of course. Shall I go to Lincoln Center?”</p><br/><p>“No. I’m sure you’re much busier, so I’ll go to JS studio. I’ll leave now.”</p><br/><p>Dimitri Carras’ voice could not hide his anxiousness.</p><br/>\n</div>"}