{"title": "Chapter 272", "id": 272, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-272", "volume_title": "Volume 3", "body": "<h1>Chapter 272</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 272</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>“Sir, come to the house. You’re turning 60 tomorrow. You should get your birthday dinner.”</p><br/><p>“Hey kid. Who gets a birthday dinner for turning 60 these days? They get the feast when they turn 70 or 80.”</p><br/><p>Yoon Kwang Hun started complaining as soon as he heard ‘60’. He is now in his heydays again, so he does not want to admit that he is in his 60s.</p><br/><p>“Ugh. An adult needs to admit he’s gotten older. He he.”</p><br/><p>“Did I say something about it? It’s sad enough that I’m getting older, but I need to check that fact with my own eyes? Let’s just eat at a restaurant. 49 days haven’t even passed since President Stern’s death.”</p><br/><p>“This isn’t Korea, it’s America. And Isaac is Christian.”</p><br/><p>“I’m just saying. It’s not time to get a birthday dinner yet.”</p><br/><p>Jun Hyuk waved the hidden card that would get Yoon Kwang Hun to stop being so stubborn.</p><br/><p>“Amelia and I are doing the cooking ourselves. Forget me, but if you don’t eat the food Amelia prepared, you won’t be able to handle the blow back after.”</p><br/><p>When Yoon Kwang Hun heard that Amelia will be making the food herself, he jumped. If he says that he won’t go, she is someone who will go to him at that moment and drag him away.</p><br/><p>“Ugh, you’re such a bother. Alright. I’ll go.”</p><br/><p>“Come tonight. Since tomorrow’s your birthday, sleepover and have some seaweed soup in the morning.”</p><br/><p>“I said alright! Hang up.”</p><br/><p>Yoon Kwang Hun yelled and hung up the phone. Jun Hyuk put down the receiver and giggled.</p><br/><p>“Why? He’s not coming?”</p><br/><p>“Of course not. He’s just being like that for no reason. He just wants it to feel like he’s coming over reluctantly because he has no choice. Korean men are kind of like that.”</p><br/><p>The 3 people were gathered under one roof for the first time in a while as they got drunk off of wine and chatted away to their heart’s desire. Yoon Kwang Hun could not believe that it has been 15 years since he met Jun Hyuk.</p><br/><p>The boy who had gobbled down tonkatsu, is now a maestro standing at the top of the world. And he put him at the head of a giant foundation.</p><br/><p>A lot of thoughts passed through Yoon Kwang Hun’s head and they fell into a deep sleep under the influence of alcohol and relaxation.</p><br/><p>***</p><br/><p>Yoon Kwang Hun opened his eyes to the smell of Korean food he was smelling for the first time in a while. When he drank a cup of water to ease his hangover and went downstairs, Amelia had her nose blocked with all of the windows open and Jun Hyuk was nowhere to be seen.</p><br/><p>“What’s Jun doing? All of the soup is gone.”</p><br/><p>Yoon Kwang Hun turned off the boiling pot first.</p><br/><p>“He’s talking to the President.”</p><br/><p>“The President?”</p><br/><p>“Yes. Since he gave him the piano songs, he calls everyday. He always asks about the parts that are hard to play.”</p><br/><p>Amelia is sick of the President who calls everyday and shook her head. When Jun Hyuk shuffled into the kitchen, Yoon Kwang Hun started by yelling.</p><br/><p>“What smells so fishy? What is this?”</p><br/><p>“You like fish seaweed soup. That’s why I put it in, but…..”</p><br/><p>“Ugh. Is this seaweed soup? You made fish stew! Why did you put so much fish in?”</p><br/><p>He could barely see any seaweed, and there were just 2 fish heads the size of a person’s arm boiling inside the pot.</p><br/><p>Yoon Kwang Hun only had 2 spoonfuls of the seaweed soup, and then ate the soup and salad that Amelia made instead.</p><br/><p>After a light breakfast, Yoon Kwang Hun was sitting in the living room and lighting a cigarette when Jun Hyuk and Amelia came out with a pretty cake.</p><br/><p>“What is that? A cake first thing in the morning? You’re supposed to eat something like this in the evening. I’m so hungover. I feel sick just looking at it.”</p><br/><p>“If it’s 10:00 in New York, it’s midnight in Korea. It’s your birthday in 5 minutes on Korean time.”</p><br/><p>“You’re doing all kinds of weird stuff. This early in the morning.”</p><br/><p>The smile spreading across his face however showed that he was not only displeased.</p><br/><p>“Alright. Now let’s open your birthday present. Wait for it.”</p><br/><p>Jun Hyuk turned on a screen taking up a wall of the living room. The screen showed an orchestra under the stage and curtains that had yet to go up as though relaying an opera show.</p><br/><p>“What is this? My birthday present is just watching a performance? And through a screen at that? Isn’t this the Internet?”</p><br/><p>“Yes. It’s broadcasting live over the Internet. Don’t rush me and just wait. There’s still 1 minute left.”</p><br/><p>Jun Hyuk started the countdown on his fingers.</p><br/><p>At exactly 10:00 when it became midnight on Korean time, the stage curtains went up. All of the opera cast members were standing up in the middle of the stage.</p><br/><p>“What opera is it that all of the singers are coming out at the same time? Huh? Isn’t that opera ‘Godfather’?”</p><br/><p>As it is an opera he watched many times, Yoon Kwang Hun was able to tell right away what the show would be just by looking at the stage set and singers’ costumes.</p><br/><p>When the orchestra conductor’s baton began to move slowly, all of the opera singers started singing in chorus.</p><br/><p>Happy Birthday to you.</p><br/><p>Happy Birthday to you.</p><br/><p>Happy Birthday Dear Father.</p><br/><p>Happy Birthday to you.</p><br/><p>The singers finished singing and left the stage as they waved to the camera. Soon after, two gun shots rang and the real opera began.</p><br/><p>Yoon Kwang Hun pointed to the screen and stuttered,</p><br/><p>“That… That… That song… wasn’t for me, was it?”</p><br/><p>“It was. It’s the Italian Napoli Opera. They sang the birthday song right before their show just now. What are you doing? You need to blow out the candles.”</p><br/><p>While the opera singers sang in chorus, Jun Hyuk lit the candles on the cake and brought it out in front of Yoon Kwang Hun.</p><br/><p>Yoon Kwang Hun was not able to blow out the 6 candles in one go. He was unable to let out a long blow because he cried out in the middle.</p><br/><p>“You can’t be like this already when this is just the start of the present.”</p><br/><p>When he barely blew the candles out, Jun Hyuk put the cake down and hugged Yoon Kwang Hun.</p><br/><p>“Happy birthday, father.”</p><br/><p>Jun Hyuk stopped calling him ‘sir’ as he had done for the past 15 years. And he said ‘father’ for the first time.</p><br/><p>He thought of Yoon Kwang Hun as his father from the beginning until now but Yoon Kwang Hun himself always said that he has no right to be called his father as he set their relationship.</p><br/><p>Jun Hyuk’s calling him ‘father’ means freedom for Yoon Kwang Hun. The two of them defined their relationship and it meant that after today, he had decided what he would call Yoon Kwang Hun regardless of his thoughts.</p><br/><p>Emotional Amelia cried more than Yoon Kwang Hun did, so he pat her back as he spoke,</p><br/><p>“There there. Stop that now. We need to enjoy the opera. It’s my birthday present. It’s nonsense that we shouldn’t be able to watch it because of something like tears.”</p><br/><p>After 1 hour passed, the opera’s 1st act came to the end. Suddenly, the screen turned off.</p><br/><p>“What is it? Did the Internet get cut off? Why isn’t it coming out?”</p><br/><p>“Hang on. It’s the next present.”</p><br/><p>When the screen became bright again, the orchestra came on.</p><br/><p>“What is this all of a sudden? What about the opera?”</p><br/><p>“This is London, England. The BBC Orchestra. Watch it.”</p><br/><p>When both of the conductor’s arms moved powerfully, the Happy Birthday song came out. When the song ended, they started playing the 1st act of Jun Hyuk’s choral concerto.</p><br/><p>After another hour passed, a pianist sat alone on stage to play the birthday song, and waved. Then, he began to play Jun Hyuk’s piano sonata.</p><br/><p>“That’s Portugal. He was the only person performing at this time over there.”</p><br/><p>When the piano sonata ended, Danny who is on his European tour appeared and congratulated Yoon Kwang Hun on his birthday.</p><br/><p>“Happy Birthday Mr. Yoon!”</p><br/><p>Colin’s band was much funnier because of Kyung Min Ho. They must have learned from Kyung Min Ho, because they bowed deeply to the camera and then yelled in Korean,</p><br/><p>“Happy Birthday on turning 60, father.”</p><br/><p>Yoon Kwang Hun was unable to hold back his laughter because of Colin and Todd’s sloppy Korean. And he realized what his true birthday present is.</p><br/><p>“This was matched by parallax. We’re going to how you 24 performances by going around the world in 1 hour intervals. Everyone is playing my music. And before each performance, everyone is congratulating you on your birthday.”</p><br/><p>“You still remembered?”</p><br/><p>While the audition program was running in Korea, they had to hold a press conference because of the agency’s tricks. On the night they held the press conference, Yoon Kwang Hun got drunk and talked about his dream. Back then, it had seemed like an impossible dream.</p><br/><p>‘Your music playing constantly as the world makes a turn. Your music coming out anywhere at anytime for 1 year, 365 days.’</p><br/><p>“Yes. How could I forget that?”</p><br/><p>Jun Hyuk laughed as he spoke.</p><br/><p>“It’s not to 365 days, but my music won’t end for at least the 24 hours of your birthday today. This much doesn’t make your dream complete, but isn’t it achieving just about the tail end of it, father?”</p><br/><p>Yoon Kwang Hun did not sleep and after 23 hours, he watched all of the performances including Rome’s.</p><br/><p>He cannot miss his dream coming to life by sleeping.</p><br/>\n</div>"}