{"title": "Chapter 278", "id": 278, "volume": 3, "url": "http://boxnovel.org/gods-song-chapter-278", "volume_title": "Volume 3", "body": "<h1>Chapter 278</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 8 / Chapter 278</p><br/><p>TL: LightNovelCafe</p><br/><p>Editor: Isleidir</p><br/><p>Jina slowly accepted and adjusted to her daily life which had become completely different. She no longer had to starve, could eat until she was full, and had a cozy place to sleep.</p><br/><p>Not only was there no longer the smell of dirt bad enough to make her throw up, a pleasant smell came from her clothes and bedding. Jina evaluated everything by sound since she cannot see, and felt warmth in the voices of the people surrounding her.</p><br/><p>She still thought of Jun Hyuk as her owner. She just thought of him as a kind and warm owner unlike the one she had before.</p><br/><p>She thought of him as an owner who enjoys her singing instead of her begging, so she was happy about the fact that she just needed to sing for her owner.</p><br/><p>And she was happy that everyone including her owner listened to her singing and enjoyed it.</p><br/><p>The middle-aged woman who taught her English was ecstatic that she had come across the greatest blessing of her life.</p><br/><p>It provided her with an incredible salary and the chance to meet a legendary maestro every day. And she is the only person who can listen to a child with the voice of an angel and Jun Hyuk’s music a performances.</p><br/><p>– Alright, again. The part where you did ah-ah! was a little high. Lower it a little.</p><br/><p>– You need to make it a little longer than that. About 0.5 seconds? Yeah. That’s it.</p><br/><p>Jina was living in the same way Jun Hyuk did when he first met Yoon Kwang Hun. She spent all day buried in music, listening to all genres from classical to pop and falling in love with new music.</p><br/><p>And the first song she is learning from Jun Hyuk is “A, E, I, O, U”. As the song does not have a language like English or Italian, it seemed like a song created just for Jina.</p><br/><p>“Jun Hyuk. What do you think about teaching Jina vocalization first? Isn’t that song a little hard?”</p><br/><p>“No. She doesn’t need basics like that. Jina’s a child who absorbs while singing. You can’t compare her to ordinary singers who were born with great voices.”</p><br/><p>A world that normal, ordinary people cannot understand. Absorbing at once and learning on their own, it is a completely different world that they cannot explain.</p><br/><p>Yoon Kwang Hun was able to gauge the size of Jina’s ability by comparing it to Jun Hyuk’s past.</p><br/><p>Yoon Kwang Hun could not understand and just shook his head as he spoke to Amelia,</p><br/><p>“Just watch. And enjoy the wonderful world that people like Jun can show you.”</p><br/><p>***</p><br/><p>Jun Hyuk and Amelia held their wedding at President Stern’s villa in Switzerland. It was a secret wedding that only family members attended.</p><br/><p>Jun Hyuk’s best men were Colin and Danny, and the people Jun Hyuk met most nervously weren’t Amelia’s parents but her 7 older brothers.</p><br/><p>“Oh! Maestro. No, it is brother now? Ha ha.”</p><br/><p>The 7 men were neither scary nor threatening. They are just cavalier cowboys who raise nearly 1,000 cows.</p><br/><p>There were other truly intimidating people. Amelia’s nieces and nephews. There were nearly 30 of them ranging from those in their teens to infants, and the sound of them chatting away made Jun Hyuk crazy.</p><br/><p>No matter how hard he tried to change it into music, it was just impossible noise.</p><br/><p>Jun Hyuk and Amelia exchanged rings, were wed by a priest, and had a deep kiss.</p><br/><p>And the child everyone looked at with great curiosity held their hands and appeared on the aisle.</p><br/><p>As Jun Hyuk and Amelia wed, they became parents.</p><br/><p>“Alright, Jina. Today’s your first performance. There are a lot of people in front of you right now who will listen to your song and cry of happiness. Sing to your heart’s desire.”</p><br/><p>Jina sang “A, E, I, O, U” for about 30 minutes and Jun Hyuk clenched both fists with his entire body trembling.</p><br/><p>The music he had expected from Laura Goldberg. 13 year old Jina had completed that music to 100%.</p><br/><p>***</p><br/><p>“Jina, listen well.”</p><br/><p>Jun Hyuk started to play the piano and not long after, Jina’s hands started to move. Her hands hesitated at times as it moved to the piano melody, but her hand did not stop moving naturally like water flowing.</p><br/><p>Jun Hyuk finished playing after more than an hour and turned around, asking Jina,</p><br/><p>“What do you think? Do you like it?”</p><br/><p>“Yes. But a few parts are a little weird.”</p><br/><p>Jun Hyuk’s smile grew wider.</p><br/><p>“Really? How many parts are weird?”</p><br/><p>“4 places.”</p><br/><p>Jina vocalized the parts that she had found strange with her beautiful voice.</p><br/><p>“Yeah. It’s a little weird, right? Then how should I change it?”</p><br/><p>“Dad! You did it on purpose again? Just play it. I can’t compose and arrange.”</p><br/><p>Jina was wearing dark purple glasses and pouted, while Jun Hyuk sighed.</p><br/><p>Jina became a completely different person over the past 2 years. Her familiarity with English and bright expression. She has become a girl in her teens, grumbling to her parents.</p><br/><p>She completely understood that Jun Hyuk and Amelia are her adoptive parents and not her owners, and she also realized that her adoptive parents are world-renowned musicians. She was also growing used to the attention she received because of this.</p><br/><p>The school she began attending not too long ago was a different world. She felt the joy of learning and learned what having friends means.</p><br/><p>Music was the only time she had to learn alone. She could not participate in music classes according to Jun Hyuk’s request. The school’s principal thought of this as a reasonable request. What could the school say when he is saying that he would like to teach her music himself?</p><br/><p>What Jina considers the greatest blessing is her father who lets her listen to new music everyday. To her, Jun Hyuk is a magician.</p><br/><p>He makes everything she hears, feels, thinks, and learns into music.</p><br/><p>But if Jina could see, she would have been surprised by how the magician changed over 2 years.</p><br/><p>Jun Hyuk did not come out of his studio at home. He came out a bit when Amelia was home, but there were more and more days when he spent nights in his studio.</p><br/><p>There were no scores either. Unintelligible notes just kept stacking up and he became thinner and thinner.</p><br/><p>***</p><br/><p>If Amelia had just stayed at home without touring, it would have been hard for her to watch Jun Hyuk. But since she was away from home for more than 6 months, she just pitied Jun Hyuk as he wasted away. She was also more sorry that she could not be by his side.</p><br/><p>Amelia kept the promise she made in the beginning that she would not step foot in Jun Hyuk’s studio at home. This meant that while he was in the studio, he was neither a husband or lover, but a great musician.</p><br/><p>And there were many times when she fell asleep with Jina when Jun Hyuk spent the night in his studio.</p><br/><p>“Jina.”</p><br/><p>“Yes, mom.”</p><br/><p>“Will you sing for me before we go to sleep? I sleep well if I hear you sing. Hm… Sing Bellini’s Casta Diva.”</p><br/><p>“Mom, you’re supposed to sing the lullaby.”</p><br/><p>“You’ll have nightmares if I sing a lullaby.”</p><br/><p>Jina buried her head in the pillow and couldn’t stop laughing. Once she finally stopped, she spoke with an embarrassed expression,</p><br/><p>“Sorry, mom. I can’t sing. Dad told me not to sing outside of my lessons. I don’t even sing at school. I keep my promises.”</p><br/><p>“Can you tell me why?”</p><br/><p>“He said my voice is still too weak, that it’ll be ruined if I use it too much. He said I need to build it up slowly…”</p><br/><p>“Then how many hours a day do you have lessons?”</p><br/><p>“5 hours? 6 hours?”</p><br/><p>“What? You sing that much every day?”</p><br/><p>“Yes.”</p><br/><p>Unbelievable. He is telling her not to abuse her voice but making her practice as much adult vocalists do.</p><br/><p>“Isn’t it hard?”</p><br/><p>Jina looked regretful and spoke in a strange voice,</p><br/><p>“Mom. I want to sing all day. I’m just really sad that I’m only allowed to sing that little in a day.”</p><br/><p>“Then what songs do you sing?”</p><br/><p>“They’re not songs but sounds. Dad said he hasn’t finished making the music yet. So I’m just making sounds.”</p><br/><p>It was hard to believe that he had not been able to finish creating the music. 2 years for him is enough time for him to write 10 symphonies. He would have written hundreds of arias.</p><br/><p>“No way. You guys have been practicing for over 2 years. What on earth is he making?”</p><br/><p>“He just said that it’s the best music. He said that all of the songs he’s ever written combined won’t be able to follow this one song.”</p><br/><p>Jina chatted away excitedly.</p><br/><p>“Dad’s first symphony expressed pain, but he said that this one is going to express bliss. This must mean it’s standing opposite to Inferno.”</p><br/><p>Amelia bolted up in bed. What is Jun Hyuk trying to do to this young child? To make her feel that pain!</p><br/><p>“Did you hear Inferno?”</p><br/><p>Amelia asked cautiously and Jina sat up in bed as well.</p><br/><p>“Of course.”</p><br/><p>“You didn’t feel anything while listening to Inferno?”</p><br/><p>“How could I feel nothing? It felt like electricity was running through my body. I never get tired of Inferno no matter how much I listen to it.”</p><br/><p>There’s another person. Another person who can enjoy Inferno. Amelia suddenly felt dizzy.</p><br/><p>“But what do you mean by 1 song?”</p><br/><p>“The song Dad is making now. He said that it’ll be a really long song.”</p><br/><p>Amelia couldn’t sleep that night. There were so many questions she wanted to ask Jun Hyuk.</p><br/>\n</div>"}