{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/overlord-ln-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Overlord Volume 1 Chapter 2 &amp; Intermission</p><br/><p>Floor Guardians</p><br/><p>Part 1</p><br/><p>“To me, Demons of the Lemegeton!”</p><br/><p>The golems which heeded Momonga’s command were made of rare metals. They moved before him with an agility that belied their heavy bodies, then took the ready stance they had assumed earlier.</p><br/><p>Now that Momonga had decided to go with his theory that virtual reality had become reality, his first concern was to guarantee his own safety. Although the NPCs he had met so far had readily obeyed him, there was no guarantee that the others he met would react in the same way. Also, even if they were all friendly, he did not know when danger would next appear.</p><br/><p>Momonga’s life and death hinged on whether or not he could use such things as Nazarick’s facilities, the golems, his items, his magic, and so on.</p><br/><p>“Well, that’s one problem solved,” Momonga muttered to himself in relief as he looked at the golems. He then ordered them only to listen to him. That way, even in the worst-case scenario — if one or more NPCs revolted — he would have an ace in the hole.</p><br/><p>Momonga, satisfied with the mighty-looking golems, looked down at his bony hands.</p><br/><p>He wore nine rings on his ten fingers, and only his left ring finger was bare.</p><br/><p>Usually in YGGDRASIL, one could only wear two rings, one on each hand. However, Momonga had used permanent cash items (which were very expensive) to let him wear a full ten rings, one on each finger, and use all their powers at once.</p><br/><p>This was not unique to Momonga; most players who valued power would spend that money too.</p><br/><p>One of the nine rings Momonga wore had an emblem on it which resembled the symbol embroidered upon the large red banner behind the throne.</p><br/><p>That ring was called the Ring of Ainz Ooal Gown.</p><br/><p>Every member of Ainz Ooal Gown possessed the magic ring that Momonga wore on his right ring finger.</p><br/><p>Although he could use the power of ten rings at once with the aid of cash items, when he applied the cash item, he had to decide which ring he wanted to assign to which finger, and that decision was irrevocable. Even so, Momonga had removed the ring on his left ring finger and sent it to the Treasury. The reason why Momonga had assigned that somewhat weaker ring to that finger was because it would be very useful under certain circumstances, but he rarely wore it because it had a constant effect.</p><br/><p>The power of the Ring of Ainz Ooal Gown was unlimited teleportation between named rooms of the Great Underground Tomb of Nazarick, and it would even allow one to teleport into the Tomb from the outside. Since Nazarick was warded to block teleportation into or within itself (except for a few specific areas), this ring was very handy.</p><br/><p>The only places where this ring could not teleport its wearer was to the Throne Room and the various guild members’ personal rooms. This ring was also required to enter the Treasury, which was why he could not do without it.</p><br/><p>Momonga sighed deeply.</p><br/><p>After this, he would be using the ring’s power. He was not sure if the ring could still do everything he expected of it, but he had no choice except to test it out.</p><br/><p>As he unleashed the ring’s power — the world before him instantly turned black.</p><br/><p>Right after that, the scenery in front of him changed, and his surroundings were now a dark tunnel. At the end of the tunnel he could see what looked like a giant lowered portcullis. Within the tunnel were artificial lights.</p><br/><p>“It worked…”</p><br/><p>Momonga muttered to himself, relieved at the successful teleport.</p><br/><p>He walked down the wide and high passage, toward the portcullis ahead of him.</p><br/><p>The stone floor amplified the sound of Momonga’s footsteps, and at times he could hear echoes.</p><br/><p>The torches that lined the tunnel flickered constantly, and as a result, the shadows they made seemed to dance. Bathed in the light of several torches, he cast several shadows at once, and it seemed as though there were multiple Momongas.</p><br/><p>What passed for his nose should have been little more than an empty hole in his skull, yet still he smelled something as he drew near the portcullis. Momonga stopped and took a deep breath. It was a strong scent of earth and grass — the smell of the jungle.</p><br/><p>Much like his encounter with Albedo just now, the intensely realistic scent, in a world that should not have possessed such things, only convinced Momonga of the reality of the world he was in.</p><br/><p>But how did his body breathe, without lungs or a windpipe?</p><br/><p>Momonga felt that thinking too much about such things was foolish, and put it aside.</p><br/><p>As though it sensed Momonga approaching, the portcullis swiftly raised itself into the ceiling at just the right moment to let him through. Past the barrier, what Momonga saw was a circular arena, surrounded on all sides by many tiers of audience seats.</p><br/><p>The colosseum was an oval in shape, one hundred eighty meters on its long axis and one hundred fifty meters on the short axis. It was forty meters tall and modelled after the arenas of the Roman Empire.</p><br/><p>There were「Continual Light」 spells cast everywhere, illuminating the grounds in white light, so one could observe the entire Colosseum like it was day.</p><br/><p>The audience was composed of many clay dolls — golems, in other words — which showed no sign of activity.</p><br/><p>In this Colosseum, the intruders would be the stars of the show, while the ones watching from the VIP box would be members of Ainz Ooal Gown. The main event, of course, would be a brutal melee. Apart from the fifteen-hundred-man invasion, every single invader had met their end here.</p><br/><p>Momonga walked into the center of the arena, and looked into the heavens. Before him stretched a black expanse of night sky. Perhaps he might have been able to see the stars if there were no light around him.</p><br/><p>However, this place was the Sixth Floor of the Great Underground Tomb of Nazarick, so the sky here was merely a virtual imitation.</p><br/><p>Even that imitation required a massive amount of data, but as a result the sky here could change with the time of day, even showing an actual sun with appropriate daylight effects.</p><br/><p>Momonga could relax himself in this virtual landscape because Momonga’s heart was still human, as opposed to his skeletal appearance. It was also because he felt a sense of appreciation for his comrades’ hard work in building this place.</p><br/><p>Part of him wanted to just wait and space out here, but the present situation denied him that luxury.</p><br/><p>Momonga looked around — nobody was there. The twins should have been taking care of this place…</p><br/><p>He noticed something.</p><br/><p>“Toooooooh!”</p><br/><p>After the shout, a figure leapt from the VIP box.</p><br/><p>The figure jumped down from a height of about six storeys, somersaulted in mid-air, and landed as though it were a butterfly descending on a flower. There was no magic involved, only pure physical prowess.</p><br/><p>It negated the force of the impact with a simple flexing of the knees, and it smiled broadly.</p><br/><p>“V!”</p><br/><p>It made a V-sign of victory.</p><br/><p>A child of about eleven had descended from above. Her face bore a smile that was as bright as the sun. She was adorable, with the androgynous appeal of both a boy and a girl.</p><br/><p>Her hair resembled threads of spun gold, and it grazed her shoulders. The light reflected off the strands of hair resembled an angel’s halo. Her mismatched eyes, one blue, one red, seemed as eager and sparkly as a puppy’s.</p><br/><p>Her ears were long, and his skin was dark. She was a Dark Elf, a species related to Forest Elves.</p><br/><p>She wore a shirt of light leather armor, reinforced with red dragon’s scales. The emblem of Ainz Ooal Gown was proudly displayed on her vest, stitched in gold onto a white background. Below that, she wore a pair of white pants, matching her vest. A necklace with a glittering golden acorn pendant hung from her neck, and she wore a pair of gloves reinforced with plates of enchanted metal.</p><br/><p>A whip coiled across her waist and right shoulder, and there was a longbow on her back. The bowstave and grip seemed to be covered in strange decorations.</p><br/><p>“Aura, is it?”</p><br/><p>Momonga spoke the name of the Dark Elf child.</p><br/><p>He was addressing the Guardian of the Sixth Floor of the Great Underground Tomb of Nazarick, Aura Bella Fiora. She was a skirmisher who was also able to summon and tame beasts.</p><br/><p>Aura jogged over to Momonga. Well, to her, it was a jogging pace, but she was travelling as fast as one of her beasts at full speed, rapidly closing the distance between them.</p><br/><p>Aura screeched to a halt.</p><br/><p>Her running shoes had hihiirokane metal plates on the soles, and they threw up clouds of dust as they ground against the floor of the arena. The clouds did not touch Momonga’s body; if she had planned that, then his skills must have been impressive indeed.</p><br/><p>“Huu~”</p><br/><p>Aura was not sweating, but yet she wiped her forehead theatrically. Then, with a puppy-like smile, she greeted Momonga.</p><br/><p>“Welcome, Momonga-sama. Welcome to the level I guard!”</p><br/><p>The greeting was filled with the same respect that Albedo, Sebas, and the maids had for him, but for some reason it felt more intimate. To Momonga, this intimacy allowed him to loosen up. Being too uptight and scary was quite troublesome for Momonga, who was not experienced with this sort of thing.</p><br/><p>He could not detect any hostility on Aura’s face, and his 「Enemy Scan」 revealed nothing.</p><br/><p>Momonga’s line of sight left the band on his right wrist and he loosened his grip on the Staff of Ainz Ooal Gown.</p><br/><p>He had planned to strike hard and fade away if an emergency occurred, but it seemed as though there would be no need for that.</p><br/><p>“…Mm. I’ll be intruding for a while.”</p><br/><p>“What’re you saying, You are the master of Nazarick, the Supreme Overlord, right, Momonga-sama? There’s no place you’d be intruding if you visited!”</p><br/><p>“I see… speaking of which, if you’re here, Mare…”</p><br/><p>Upon hearing Momonga’s question, Aura blinked in surprise, as though she had realised some great truth and turned around, shouting loudly upward:</p><br/><p>“Momonga-sama has graced us with his presence! How rude are you going to be by not showing your face to him?”</p><br/><p>There was movement in the shadows of the VIP box.</p><br/><p>“Was Mare there too?”</p><br/><p>“Yes, that’s right, Momonga-sama. He’s really timid… Oi, jump down here now!”</p><br/><p>An almost inaudible reply came from the VIP box. Judging by the distance between there and here, it was a miracle the other party could even hear Aura. However, that miracle was the result of the magic on Aura’s necklace.</p><br/><p>“I, I can’t, Onee-chan…”</p><br/><p>Aura took a deep breath and grabbed her head.</p><br/><p>“He… he… Momonga-sama, he’s just scared, he’s definitely not trying to insult you.”</p><br/><p>As a member of society, one had to know when to speak one’s heart and when to say things that were appropriate for the occasion. Momonga nodded and answered in a gentle way to put Aura at ease.</p><br/><p>“Of course, Aura. I have never doubted your loyalty.”</p><br/><p>Aura sighed in relief, and then she became serious again before shouting angrily at the VIP box.</p><br/><p>“The Supreme Being Ainz-sama has come to visit us, but you as a Floor Guardian aren’t even here to meet him! You should know how disrespectful that is! If you’re too scared to jump down, maybe a quick kick will substitute for courage!”</p><br/><p>“Uuu… I’ll take the stairs down…”</p><br/><p>“How long do you want Ainz-sama to wait!? Get over here now!”</p><br/><p>“I, I got it… e-eiii!”</p><br/><p>Mare had gathered up his courage, but his voice still seemed unsteady. After that, a figure jumped out of the VIP box.</p><br/><p>As expected, it was a Dark Elf. This Dark Elf was particularly wobbly on his feet, completely different from how Aura had handled her landing. However, he did not seem to be hurt. He must have skillfully dissipated the force of landing with some athletic trick.</p><br/><p>After that, he immediately began running over as quickly as he could. However, his top speed was still much slower than Aura. She must have thought so too, because she frowned and shouted:</p><br/><p>“Hurry up!”</p><br/><p>“Y-Yes!”</p><br/><p>The child who finally arrived in front of Ainz looked almost identical to Aura. They had to be twins, given the way they shared the same hair, the same eyes, and the same features. However, if Aura was the sun, then Mare was the moon.</p><br/><p>He looked nervous, as though he was afraid of being scolded. Momonga was surprised by the stark difference between the two. However, from what Momonga knew, Mare should not have been like this. Even if one wrote a long character description for their NPCs, it would not be reflected in their personalities.</p><br/><p>Yet, these two Dark Elf children were displaying animated emotions in front of Momonga.</p><br/><p>“—They must be the Aura and Mare that Bukubukuchagama-san wanted to see.”</p><br/><p>Bukubukuchagama was the guild member who had designed these two Dark Elf characters.</p><br/><p>If only she could have been here for this…</p><br/><p>“I, I’m sorry I kept you waiting, Momonga-sama…”</p><br/><p>He nervously raised his eyes to peek at Momonga. He wore a vest of blue dragon scales, and a small cape that was as green as jungle leaves.</p><br/><p>His clothes had the same basic white color as Aura, but a short section of flesh peeked out below his short skirt. It was short because the rest of his legs were covered in white silk stockings. He had an acorn-shaped pendant on a necklace like Aura, but his was made of silver.</p><br/><p>Mare was much more lightly armed than Aura, with a pair of lustrous white gloves on his dainty little hands, and a gnarled black staff in his hands.</p><br/><p>Mare Bello Fiore.</p><br/><p>Like Aura, he was a Guardian of the Sixth Floor of the Great Underground Tomb of Nazarick.</p><br/><p>Momonga squinted — though his eyes were merely empty sockets — and looked at them. Aura thrust her chest forward proudly, while Mare simply cowered under Momonga’s gaze.</p><br/><p>He nodded several times, musing that the two of them were indeed the incarnation of his comrade’s hard work.</p><br/><p>“I’m glad to see that the two of you are in good spirits.”</p><br/><p>“I’m positively overflowing with energy… although it’s been a bit boring recently. It would be nice if we had an intruder or two.”</p><br/><p>“I, I would rather not have to meet intruders… they, they’re scary…”</p><br/><p>After hearing Mare’s words, Aura’s expression changed:</p><br/><p>“…Haa. Momonga-sama, please excuse me for a while. Mare, come with me.”</p><br/><p>“O-Oww… Nee-chan, that hurts…”</p><br/><p>After seeing Momonga nod slightly, Aura pinched Mare by the tip of one of his ears and dragged him away from Momonga. Then, she began whispering into Mare’s ear. Even from a distance, one could tell that she was scolding him.</p><br/><p>“…Intruders, huh. Well, much like you, I don’t want to meet them either, Mare…”</p><br/><p>At least, I’d rather meet them after having the chance to make all the preparations I need, Momonga thought as he watched the twin Guardians from afar.</p><br/><p>After he snapped back to reality, Momonga realised that Mare was on his knees in front of Aura, who was hurling a torrent of abuse at him.</p><br/><p>Momonga smiled, as the scene reminded him of the brother and sister who were his friends:</p><br/><p>“Good grief, Mare was clearly not made by Peroroncino-san. Or is this because Bukubukuchagama-san believed that “Little brothers should listen to their big sisters”… Though come to think about it, Aura and Mare should have died once. How should I address that?”</p><br/><p>The invasion of fifteen-hundred people had made it down to the Eighth Floor. Which was to say, Aura and Mare should have died then. Did they remember anything about it?</p><br/><p>What meaning did the concept of “death” have for those two, anyway?</p><br/><p>According to YGGDRASIL’s rules, death would cost a character five levels and force him to drop one of his equipped items. In other words, characters below level five would immediately disappear. Players were specially exempt from this and would not vanish, but they would be reduced to the minimum level of one. Therefore, it must be an issue with the game rules.</p><br/><p>Using spells like 「Resurrection」 or 「Raise Dead」 would mitigate this level loss. In addition, with the use of cash items, one would only lose a bit of experience.</p><br/><p>It was simpler for NPCs. As long as the guild paid the requisite fees to resurrect them, they would be recalled to life without any ill effects.</p><br/><p>Therefore, players who wanted to respec their characters often favored using death to lower one’s levels.</p><br/><p>While the loss of even a single level was a harsh punishment in a game where each level required a lot of experience points, losing levels was not such a frightening prospect in YGGDRASIL. This was because the game company wanted its players to explore previously undiscovered regions and find new things, instead of hunkering down in familiar territory because they were afraid of losing levels.</p><br/><p>With all this in mind, were the two people who perished in the wake of the fifteen-hundred-man invasion the same after their resurrection?</p><br/><p>Momonga wanted to verify this, but at the same time, he did not want to disturb them unduly. For all he knew, that large invasion might have been a traumatic experience for Aura. Momonga felt it would be unwise to question her in that manner when she had showed no overt signs of hostility. The important thing was that they were lovingly crafted NPCs of his friends in Ainz Ooal Gown.</p><br/><p>Perhaps after settling all the accumulated problems, he would ask her about it.</p><br/><p>In addition, the concept of death in-game might be different from outside it. Of course, if one died in reality, that was the end of everything, However, that might not be the case right now. He wanted to perform an experiments on this, but first he needed to collect information and establish his priorities. Thus, putting this matter aside would be a wise decision.</p><br/><p>After all, Momonga still had many doubts about how the YGGDRASIL he knew had changed.</p><br/><p>Aura was still scolding Mare as Momonga stood in contemplation. Momonga pitied Mare a little. After all, he had not said anything that warranted such wrathful castigation.</p><br/><p>In the past, when brother and sister argued, all Momonga could do was watch. But now, things were different.</p><br/><p>“That should be enough, don’t you think?”</p><br/><p>“Momonga-sama! But, but as a Guardian, Mare—”</p><br/><p>“It’s fine. Aura, I understand how you feel. It is only natural that you would feel unhappy if Mare, as a Floor Guardian, said such a cowardly thing, especially if it were in my presence. However, I believe that if anyone invaded the Great Underground Tomb of Nazarick, you and Mare would fearlessly step forward to engage them. There is no need for scoldings as long as one does what is required of them when the time comes.”</p><br/><p>Momonga walked up to between the two of them and helped Mare up.</p><br/><p>“And Mare, you should be grateful to your kind sister. Even if I were angry, I could not remain so after seeing how your sister scolded you.”</p><br/><p>Mare looked in surprise at his sister. At this moment, Aura hurriedly said:</p><br/><p>“Eh? No, no, it’s not like that. I wasn’t scolding him to show off in front of you, Momonga-sama!”</p><br/><p>“Aura, it’s fine. It doesn’t matter what you had in mind. I understand your kind intentions. However, I must tell you that I am not dissatisfied with Mare’s performance as a Guardian.”</p><br/><p>“Um, ah, yes, yes! Thank you, Momonga-sama!”</p><br/><p>“Th-Thank you very much…”</p><br/><p>Momonga felt uncomfortable as he watched the two of them bow to him. He felt particularly ill at ease as he saw them look at him with their shining eyes. In order to camouflage the embarrassment he felt at being looked at that way, Momonga coughed.</p><br/><p>“Hm, that’s right. Aura, I think you said something about being bored because there were no intruders?”</p><br/><p>“—Ah, no, that, about that…”</p><br/><p>After seeing Aura’s fearful reaction, Momonga felt bad about asking his question.</p><br/><p>“I do not intend to reproach you for your answer, so feel free to speak your mind.”</p><br/><p>“…Yes, a little. There’s nobody around here who can spar with me for more than five minutes.”</p><br/><p>Aura touched her index fingers together before looking up hopefully to Momonga.</p><br/><p>As a Guardian, Aura was level one hundred. There were precious few opponents in this dungeon which could rival her. There were nine such NPCs, including Aura and Mare, as well as one other.</p><br/><p>“What if Mare was your opponent?”</p><br/><p>Mare’s body trembled as he shrank away. He shook his head with moist eyes, and he looked very afraid. Aura sighed as she saw the way he looked.</p><br/><p>As Aura sighed, a sweet scent filled the surrounding air. Unlike the fragrance Albedo radiated, this scent seemed somewhat persistent. As he remembered Aura’s ability, Momonga took a step away from the scent.</p><br/><p>“Ah, sorry, Momonga-sama!”</p><br/><p>As Aura noticed Momonga’s strange reaction, she hurriedly dispersed the scent with her hand.</p><br/><p>Among Aura’s skills as a Beast Tamer, there were certain passive skills that had buffing and debuffing effects. These abilities acted through her breath and had a radius of several meters, some even up to ten meters. With the effect of certain skills, that radius could be enlarged to unbelievable proportions.</p><br/><p>In YGGDRASIL, icons representing buffs and debuffs appeared in one’s field of vision, so one could see if they were under the effect of an ability. However, no indication of these changes appeared before him, which made things quite troublesome.</p><br/><p>“Ah, it should be fine now, I cancelled it!”</p><br/><p>“Is that so…”</p><br/><p>“…Although you’re undead, so mind-affecting effects shouldn’t work on you, right, Momonga-sama?”</p><br/><p>That was true in YGGDRASIL. The undead were immune to mind-affecting effects, whether positive or negative.</p><br/><p>“…Was I within the effective radius?”</p><br/><p>“Mm.”</p><br/><p>Aura lowered her head in fear, and so did Mare beside her.</p><br/><p>“…I”m not angry, Aura,” Momonga said in as gentle a voice as he could manage. “Aura… You don’t have to be so afraid. Do you think such a simple skill would inconvenience me? I was simply asking if I was within the effective range of your skill.”</p><br/><p>“Yes! Just now, you were within range of my skill.”</p><br/><p>After hearing Aura’s energetic answer as relief flooded back into her, Momonga realized that his very presence filled Aura with fear.</p><br/><p>Once he noticed this, he felt a clenching pain in his nonexistent stomach. What if he became weaker from this? Every time he thought about that, he tried desperately to put it out of mind.</p><br/><p>“And what was its effect?”</p><br/><p>“Ah, the effect just now… should have been fear.”</p><br/><p>“Umu…”</p><br/><p>He did not feel afraid. In YGGDRASIL, one would not be affected by attacks from the guild or party to which one belonged. Although, there was a very real chance this rule no longer applies, so it would be best to verify that now.</p><br/><p>“Aura, I was just thinking that your skill should not have an effect on people from the same guild… the same group.”</p><br/><p>“Eh?”</p><br/><p>Aura’s eyes went wide, much like Mare’s did from the side. Judging from their reactions, Momonga realised that they did not agree with him.</p><br/><p>“Am I mistaken?”</p><br/><p>“Yes… Could it be you mixed it up with the ability to freely change the range of one’s skills?”</p><br/><p>So it seemed the rule disabling friendly fire was no longer in effect. Mare was not affected while being near Aura, but that might be because he had equipped an item which negated mind-affecting effects on himself.</p><br/><p>In contrast, the undead Momonga’s divine class items did not have any data which protected against mind-affecting effects. But in that case, why did Momonga not feel fear?</p><br/><p>There were two possibilities.</p><br/><p>He might have resisted it with his base stats, or resisted it with his immunities from being an undead creature.</p><br/><p>Because he was not sure which hypothesis was correct, Momonga decided to conduct an experiment:</p><br/><p>“Can you try using other effects?”</p><br/><p>Aura tilted her head and made a strange noise of bafflement. Momonga was reminded of a puppy, and he reached out to stroke Aura’s head.</p><br/><p>Her hair and scalp felt smooth as silk, and caressing her was very comfortable. Because Aura did not seem to mind, Momonga wanted to keep going on. However, Mare looked a little frightened as he stared at them from the side, so he paused.</p><br/><p>What was Mare thinking, anyway?</p><br/><p>After thinking for a short while, Momonga released his staff and ruffled Mare’s hair with his other hand.</p><br/><p>The quality of Mare’s hair felt better, but Momonga hardly paid it any heed as he rubbed their heads until he was satisfied. Then, he remembered what he was here to do:</p><br/><p>“Then I have something to ask of you. I plan to conduct certain experiments… I’ll need your help for them.”</p><br/><p>At first, the two of them did not know how to respond to that. However, when Momonga’s hand left their heads, the two of them had embarrassed yet happy looks on their faces.</p><br/><p>Aura cheerfully replied, “Yes, I understand! Momonga-sama, leave it to me!”</p><br/><p>Momonga reached out a hand to quell Aura.</p><br/><p>“Before that—”</p><br/><p>Momonga gripped the floating staff in his hand.</p><br/><p>Just like before, when he used the power of the ring, he focused on the staff. Among the many powers it possessed, Momonga concentrated on one of the gems which decorated the staff.</p><br/><p>It was a divine class item called the Gem of the Moon, and the ability Momonga chose—</p><br/><p>—called forth Moonlight Wolves.</p><br/><p>As the summoning magic took effect, three beasts appeared out of thin air.</p><br/><p>The special effects of the summoning were the same as in YGGDRASIL, so Momonga was not surprised by them.</p><br/><p>Moonlight Wolves looked very similar to Siberian Wolves, but they radiated a silver glow. Momonga could feel a mysterious connection between himself and the Moonlight Wolves. It clearly showed who was the master and the servant between them.</p><br/><p>“Are those Moonlight Wolves?”</p><br/><p>Aura’s tone showed she did not understand. After all, she had no idea why Momonga would summon such weak monsters.</p><br/><p>Moonlight Wolves were highly agile and they were useful for ambushes, but they were only level twenty or so. They were very weak monsters compared to Aura and Momonga. However, monsters of this level were enough for their purposes this time round.</p><br/><p>In fact, the weaker they were, the better.</p><br/><p>“Yes, they are. Now, include me in the radius of your skill.”</p><br/><p>“Eh? Really?”</p><br/><p>“It’s fine.”</p><br/><p>Momonga’s insistence was so great that even the dubious Aura went ahead with it.</p><br/><p>Given that they were no longer in the game, there was a possibility he could not ignore, which was that Aura’s skill might not have activated properly. In order to rule that out, he had to expose himself to the skill with a third party, which was why he had summoned the Moonlight Wolves.</p><br/><p>After that, Aura exhaled several times, but Momonga did not feel affected in any way. He tried relaxing or turning around in the middle of the skill, but he felt nothing strange. However, the Moonlight Wolf behind him was affected. Thus, he concluded that Aura’s skill had taken effect.</p><br/><p>From this experiment, Momonga learned that mind-affecting effects did not work on him. This meant—</p><br/><p>In the game, demihuman and heteromorphic races unlocked racial skills when they reached certain levels. An Overlord like Momonga had the following skills:</p><br/><p>Create High Tier Undead four times per day, Create Mid Tier Undead twelve times per day, Create Low Tier Undead twenty times per day, Negative Energy Touch, Despair Aura V (instant death), Negative Protection, Dark Soul, Black Halo, Undead Blessing, Unholy Protection, Wisdom of Darkness, Speak Evil Tongues, Ability Damage IV, Piercing Damage Resistance V, Slashing Damage Resistance V, Turn Resistance III, High Tier Physical Immunity III, High Tier Magic Immunity III, Cold, Acid, and Electrical Immunity, as well as Arcane Vision/See Invisibility.</p><br/><p>And then there were the abilities from his class levels — Instant Death Magic Enhancement, Rite of Darkness, Undead Aura, Undead Creation, Undead Control, Undead Strengthening, and so on.</p><br/><p>Then there were the basic special qualities which all undead possessed:</p><br/><p>Immunity to critical hits, mind-affecting, poison, disease, sleep, paralysis, death, and energy drain effects. Resistance to necromancy and biological penalties. Undead did not need to breathe, eat, or drink. They were healed by negative energy and had darkvision.</p><br/><p>Of course, they had weaknesses too, like Good, Light, and Holy Vulnerability IV, Bludgeoning Vulnerability V, Vulnerability to Holy and Good Consecrated Areas II, double damage from fire, and so on.</p><br/><p>—This meant that Momonga could be sure that he still possessed the basic abilities of an undead being and his special skills gained through levelling up.</p><br/><p>“I see. Well, this was an informative experiment… thank you, Aura. Are you all right?”</p><br/><p>“Yes, I’m fine.”</p><br/><p>“Is that so… return.”</p><br/><p>The three Moonlight Wolves vanished as though time itself had turned backward for them.</p><br/><p>“…Momonga-sama, did you come to our floor in order to perform those experiments just now?”</p><br/><p>Mare was nodding beside her.</p><br/><p>“Eh? Ah, no. In truth, I came here for training.”</p><br/><p>“Training? Eh? For you, Momonga-sama?”</p><br/><p>Aura and Mare’s eyes were so wide it seemed like they might fall out of their sockets. Their surprise was only natural; after all, who would expect to hear such a thing from Momonga, a powerful magic caster, the Supreme Ruler of the Great Underground Tomb of Nazarick, as well as the one who stood above all?</p><br/><p>Momonga, who had anticipated this reaction, swiftly replied:</p><br/><p>“Indeed.”</p><br/><p>After seeing Momonga’s swift reply and hearing the light impact of his staff on the ground, realization dawned on Aura’s face. Momonga was quite pleased with himself, as this reaction had fallen within his scope of prediction.</p><br/><p>“Is, is that the legendary weapon of the highest order which only you may wield, Momonga-sama?”</p><br/><p>Legendary weapon? What did he mean by that?</p><br/><p>Momonga had his doubts, but after seeing Mare’s shining eyes, he knew the question had not been asked with ill intentions.</p><br/><p>“Indeed, this is the Staff of Ainz Ooal Gown, which I made with my guild members.”</p><br/><p>Momonga raised the Staff, and it immediately radiated a beautiful glow which lit up its surroundings. The glow was as blinding as the Staff itself. However, the surroundings were filled with inauspicious flickering shadows, which emitted an aura of menace.</p><br/><p>Momonga’s voice was more animated and proud when he spoke:</p><br/><p>“The seven gems in the Staff’s snake mouths are all divine class artifacts. Since they all belong to a set, having them together unlocks even greater power beyond their base abilities. Gathering them all required an incalculable amount of time and effort, and many of our members stated that they wanted to quit during the process. I can’t remember how many monsters we farmed for their drops… anyway, in addition, the Staff’s power is beyond that of a divine class item. In fact, it almost approaches that of a World Class Item. Its most potent feature is its automatic engagement system… cough, cough.”</p><br/><p>…It would seem he had gotten carried away.</p><br/><p>He had built it with his comrades in the past, but because he had never taken it out before, there had been no chance for it to shine. Now that he had the chance to show it off, his praise surged forth like a rising tide. Momonga forcibly quelled his desire to flaunt the Staff.</p><br/><p>How embarrassing…</p><br/><p>“Mm, something like that.”</p><br/><p>“That, that’s amazing…”</p><br/><p>“That’s totally awesome, Momonga-sama!”</p><br/><p>Momonga almost laughed as he saw their eyes. He tried his best to suppress the delighted expression on his face — although skeletons had no expressions — and continued:</p><br/><p>“Which was why I wanted to run some experiments with this Staff. I hope you can help me.”</p><br/><p>“Yes! Understood! We’ll go prepare right away! Then… could we see the power of the Staff?”</p><br/><p>“Mm, that’s fine. Then, I shall show you a fraction of the power of this mighty Staff, which only I can wield.”</p><br/><p>“Awesome~” Aura exclaimed as she jumped up and down adorably.</p><br/><p>Mare was hard-pressed to hide his delight, as could be seen from the twitching tips of his ears.</p><br/><p>Ah, this is bad, I can’t let my stern facade slip because of this. Momonga tried to regain his dignity as he reminded himself thusly.</p><br/><p>“…And there is one more thing, Aura. I have already ordered the other Guardians here. They will arrive within the hour.”</p><br/><p>“Eh? Then, then we need to get ready for—”</p><br/><p>“No, there is no need. All you need to do is stay here and wait for them.”</p><br/><p>“Is that so? Hm… all the Guardians — that means Shalltear’s coming too?”</p><br/><p>“All the Guardians.”</p><br/><p>“…Haa.”</p><br/><p>Aura’s long ears suddenly drooped.</p><br/><p>However, Mare’s reaction was not as exaggerated as Aura’s. According to her backstory, Aura was designed to have a poor relationship with Shalltear, but that was probably not the case for Mare.</p><br/><p>What would happen next? Momonga sighed quietly.</p><br/><p>Part 2</p><br/><p>The company of fifty men galloped across the grassy plains on their horses.</p><br/><p>Every man in the company was athletically built. One of them was particularly eye-catching.</p><br/><p>There was no better word to describe him than “fit.” His muscles were prominent even though he was wearing a breastplate.</p><br/><p>He was around thirty years old, and his face was tanned from long days of sun and covered in wrinkles. His black hair was neat and trimmed, and his dark eyes had a sharp look about them.</p><br/><p>The man riding by his side said:</p><br/><p>“Warrior-Captain, we’re almost at the first village on our patrol route.”</p><br/><p>“Ah, yes, Vice-Captain.”</p><br/><p>Gazef Stronoff, the renowned Warrior-Captain of the Re-Estize Kingdom, did not see any villages.</p><br/><p>He calmed his racing heart and maintained his mount’s speed. Although he had kept the horse’s pace at one which should not be overly fatiguing, they had hustled all the way here from the Royal Capital, and fatigue was beginning to accumulate within Gazef’s body. It must have been at least as bad for his horse, which was why he tried not to overburden it.</p><br/><p>“I hope they’re all right,” the Vice-Captain said. There was a current of unease running beneath those words, and Gazef felt the same way.</p><br/><p>The King had ordered Gazef and his men, “Imperial knights have been spotted at the border. If these reports are true, eliminate them immediately.”</p><br/><p>The city of E-Rantel was closer, and under normal circumstances, it would be faster to send troops from there. However, the Imperial knights were powerful and well-equipped, and there was an insurmountable gap between them and average conscripts. The only people in the Kingdom which could match up to the Imperial knights were Gazef and his troops. However, handing the entire task to Gazef and his men alone was the height of foolishness.</p><br/><p>Before Gazef reached their objective, other troops could have been mobilized, in order to protect the villages. Though they could not win, they could at least hold them off. There were many other methods they could have employed. However, they had not used any of them — no, they could not.</p><br/><p>Gazef, who knew the reason why, was filled with agitation. He tightly gripped the reins and tried not to tug on them. Even so, it was difficult to suppress the thoughts burning in his heart.</p><br/><p>“Warrior-Captain, just having us do the searching is pointless. Couldn’t we bring everyone from the warrior band and have them help us? We could also hire adventurers from E-Rantel to help us out. Why are you doing this?”</p><br/><p>“…Enough, Vice-Captain. Things might go poorly if someone heard that Imperial knights were running loose in the Kingdom’s territory.”</p><br/><p>“Warrior-Captain, there’s nobody here. You don’t have to stand on ceremony, but I hope you can tell me the truth,” the Vice-Captain said with a smile. Then, he continued, “Was it those nobles?”</p><br/><p>Gazef did not reply to those disdainful words, because that was exactly the case.</p><br/><p>“Those damned nobles, treating human lives like pieces in their power struggles! And on top of that, since this is the King’s domain, they can use any problems here to take shots at the King.”</p><br/><p>“…Not all nobles think that way.”</p><br/><p>“And maybe you’re right, Warrior-Captain, and there are some nobles who think of the people. For example, the Golden Princess. But apart from her, there’s practically no one else… if only the Kingdom was ruled by a dictator, couldn’t we ignore those damn nobles and work for the good of the people?”</p><br/><p>“If you interfere too strongly, it might lead to a civil war that would tear the Kingdom apart. Given that we’re facing the threat of the Empire’s expanding ambitions, a war like that would be a disaster for the common folk.”</p><br/><p>“I know that, but…”</p><br/><p>“Just leave this matter aside for…”</p><br/><p>Gazef’s voice cut off halfway, as his eyes looked intently forward.</p><br/><p>Thick, black smoke rose up from behind the small hill ahead of them, and it was not just one or two plumes.</p><br/><p>Everyone present knew what that meant.</p><br/><p>Gazef could not help but click his tongue, and he squeezed his legs around his horse’s flanks.</p><br/><p>The scene which the rapidly galloping Gazef and company saw did not deviate from their expectations. Before them spread an expanse of blackened ground, the scorched remains of a village. The corpses of several of the burned houses remained standing, like tombstones.</p><br/><p>Gazef gave an order in with a voice of steel, “Everyone, we’re moving. Quickly now!”</p><br/><p>♦ ♦ ♦</p><br/><p>The village had been put to the torch, and only the burned skeletons of the destroyed homes gave any clue as to what it had been like before.</p><br/><p>The smell of blood blended with the stench of burning as one walked between them.</p><br/><p>Gazef’s face was calm, with no hint of any emotions on it. However, no expression could convey his feelings more clearly than this. The same applied to Vice-Captain who walked by Gazef’s side.</p><br/><p>Over a hundred villagers had lived here. Six had survived. Everyone else had been mercilessly slain, whether they were women, children, or infants.</p><br/><p>“Vice-Captain, have some of our people return the survivors to E-Rantel.”</p><br/><p>“But wait, this is…”</p><br/><p>“You’re right, it’s a big risk. Even so, we can’t just abandon them like this.”</p><br/><p>E-Rantel was directly administered by the King, and protecting its surrounding villages was the King’s duty. Abandoning the survivors here would cause a lot of problems for him. One could imagine how the Noble Faction, which opposed the King, would seize on that opportunity to make trouble for him. More importantly—</p><br/><p>“Please reconsider. A lot of the survivors witnessed Imperial knights. We can consider that as having fulfilled the first part of the King’s orders. I feel we should fall back for now and make sufficient preparations in E-Rantel before carrying out the next part.”</p><br/><p>“No.”</p><br/><p>“Warrior-Captain! You should know by now that this is a trap. The timing of the attack came too close to our arrival at E-Rantel to be anything but a coincidence. Their ruthless actions were only committed after we arrived, and the reason why they did not kill everyone was in order to use them as bait for a trap.”</p><br/><p>The survivors had not evaded the knights. Rather, the enemy had not finished them off. It might be a plot to divide Gazef’s strength by having him split off his men to protect the survivors.</p><br/><p>“Warrior-Captain, do you intend to keep at it, knowing well that there’s a trap?”</p><br/><p>“…Indeed.”</p><br/><p>“Warrior Captain, are you serious about that!? Indeed, you are strong, and you could easily defeat a hundred knights. However, the Empire has that old man. Even you would be in great danger against him. There’s also a chance that you might lose against the Empire’s renowned Four Knights, under-equipped as you are. Therefore, I beg you to fall back. To the King, losing a few villages is nothing compared to losing you!”</p><br/><p>Gazef could only listen quietly as his Vice-Captain got more and more nervous.</p><br/><p>“If we won’t fall back… then we should leave the survivors behind and launch a pursuit with all of us.”</p><br/><p>“That would be the wisest option…. But at the same time, it would mean that we would be leaving them to their deaths. Do you think they can survive by themselves?”</p><br/><p>The Vice-Captain could not reply, because he knew the survivors’ chances by themselves were practically nonexistent.</p><br/><p>Without someone to protect and escort them to a safe area, they would be dead in days.</p><br/><p>Even so, the Vice-Captain spoke — no, he had to speak.</p><br/><p>“…Warrior-Captain. Yours is the most valuable life here.The villagers’ lives are nothing in comparison.”</p><br/><p>Gazef was well aware of the painful decision the Vice-Captain had made, and he was angry at himself for having forced him to say such a thing.</p><br/><p>Even so, he could not comply with the Vice-Captain’s request.</p><br/><p>“I was born a commoner, and so were you.”</p><br/><p>“Indeed, and I enlisted in admiration of you, Warrior-Captain.”</p><br/><p>“I recall you were born in a village as well?”</p><br/><p>“Yes, which is why…”</p><br/><p>“Life in a village is difficult, and death is a constant companion. It’s not uncommon for a village to be attacked by a monster and many lives lost as a result, am I wrong?”</p><br/><p>“…No, you are not.”</p><br/><p>“When a monster shows up, the rank and file soldiers are hard pressed to deal with it. If a village does not have the money to hire adventurers to deal with monsters, all they can do is hunker down and wait for the monster to leave.”</p><br/><p>“…That’s right.”</p><br/><p>“Then, can you say you did not look forward to something like this? Can you say you did not hope for the nobles or someone strong to come and save you?”</p><br/><p>“…It would be a lie to say that I didn’t. But the fact is that nobody ever came forward to help. At least, the lord of the land where my village was did not pay for adventurers to help us.”</p><br/><p>“Since that is the case… why don’t we prove that we’re not like him? Come, let us save these people.”</p><br/><p>The Vice-Captain thought of his own experiences, and could not say anything in response.</p><br/><p>“Vice-Captain, let’s show the villagers what heroes who willingly plunge into danger to save others look like. Let’s show them how the strong will save the weak.”</p><br/><p>Gazef’s eyes met the Vice-Captain’s, and countless emotions passed in between them.</p><br/><p>His voice somewhat tired but grateful, the Vice-Captain replied:</p><br/><p>“…Then allow me to lead the men. There are many who can replace me, but none who can take the place of you, Warrior-Captain.”</p><br/><p>“Don’t be foolish. My chances of survival are higher. Remember, we’re not going to die, but to save the people of the Kingdom.”</p><br/><p>The Vice-Captain opened his mouth several times, as though to speak, but in the end, he chose to remain silent.</p><br/><p>“Then, pick the soldiers who will follow you in escorting the villagers to E-Rantel.”</p><br/><p>♦ ♦ ♦</p><br/><p>The crimson light of the setting sun shone on a group of men upon the plains.</p><br/><p>There were forty five of them.</p><br/><p>They must have had excellent camouflage techniques given the way they had suddenly appeared out of nowhere. Magic was most likely involved.</p><br/><p>It was obvious at a glance that they were not simple mercenaries, travellers, or adventurers.</p><br/><p>They were all dressed the same way, in armor made of special metals, which emphasised defensive power and mobility. After enchantment, they were more protective than full plate armor.</p><br/><p>The bags on their backs were small, hardly the kind one would expect a traveller to carry. Those bags were enchanted as well. Their belts were special, designed to carry potions, and the capes on their backs also radiated an aura of magic.</p><br/><p>Gathering this many sets of magic items would be a daunting task, be it in terms of time, money, or effort required. The fact that these people were outfitted in this sort of equipment was a clear sign that they had the backing of a nation, or the equivalent.</p><br/><p>However, there were no markings or badges on them which might reveal their allegiance. In other words, they were hiding the fact that they were a black ops unit.</p><br/><p>They looked at the ruins of the village with emotionless eyes. Although the stink of blood and fire hung heavy in the air, their merciless gazes seemed to say that this was only to be expected.</p><br/><p>“…They fled.”</p><br/><p>The words were spoken with a hint of disappointment.</p><br/><p>“…Well, that’s only to be expected. We will continue attacking villages to draw him out. The beast must be lured into the trap.”</p><br/><p>The man who spoke cast a razor-sharp look in the direction where Gazef’s company was riding.</p><br/><p>“Show me the village which we will next be using as bait.”</p><br/><p>Part 3</p><br/><p>Momonga pointed his finger, preparing to cast a spell on the strawman in the corner of the arena.</p><br/><p>Momonga did not know many pure damage spells. Instead, he focused on instant death spells with additional effects. As a result, he was less effective against non-living entities. He should have selected a simple damaging spell against a target like the one before him, but Momonga’s levels were largely in necromancy-type classes, which strengthened his necromantic spells. However, the effectiveness of these spells was several notches below a character whose class levels enhanced combat spells.</p><br/><p>He glanced curiously at the children to the side, whose eyes were glittering in anticipation. He felt uneasy as he wondered whether he could live up to their expectations.</p><br/><p>Then, Momonga peeked at the two huge monsters.</p><br/><p>Their massive bodies were three meters tall, and resembled inverted triangles.</p><br/><p>Their skeletal structure was a mix of humans and dragons and covered in corded, sinewy muscles, which were in turn sheathed by a layer of scales that were harder than steel.</p><br/><p>Their faces resembled those of dragons, while their tails were as thick as tree trunks. They were wingless and bipedal, like a dragon standing on its hind legs. Their arms were wider around than a man’s torso, and each was about half the length of its body. They bore weapons that resembled both a shield and a sword.</p><br/><p>These monsters were called Dragonkin, and under the control of Aura’s beast tamer skills, they rearranged the Colosseum to her liking.</p><br/><p>Although they were level fifty five monsters with no special abilities of note, their powerful arms and prodigious stamina were a match for higher-levelled monsters.</p><br/><p>Momonga sighed softly, and then looked back at the strawmen.</p><br/><p>It was quite troubling to have people look at him with expectation in their eyes. His objective this time was to verify that he could use magic.</p><br/><p>The reason for allowing Aura and Mare to witness this experiment was to impress his power upon them before the other Guardians arrived. In this way, they would learn that opposing Momonga was a foolish course of action.</p><br/><p>The two kids did not seem like they would betray him, nor did he feel that they would betray him. However, if he lost the ability to use his magic, Momonga was not confident that they would stay loyal to him.</p><br/><p>Aura treated Momonga like an old friend, but to Momonga, it was the first time they had met. He could tell that the twins were the lovingly crafted embodiment of his guild members’ hard work.</p><br/><p>However, there was no guarantee that their design and programming was perfect. In the face of countless situations and stimuli, a discrepancy or weakness might appear somewhere.</p><br/><p>They were intelligent beings who could think on their own, so flaws in their reasoning must exist somewhere. If they were not programmed to be loyal to weaklings, what would that mean for him? In all likelihood, they were not written to be slavishly loyal. That would mean that whether or not they obeyed the order would depend on who the giver was. And it would be bad enough if they did not listen to him, but what if they betrayed their guild leader after finding out that he was powerless…?</p><br/><p>It was not good to have too many doubts, but blind trust was not a wise move either.</p><br/><p>He would cross that bridge when he came to it. Momonga turned his mind to the present.</p><br/><p>Another reason for coming here was that if he found that he could not use magic, he could discuss the situation with Aura and Mare.</p><br/><p>The twins thought he had come to test the power of the Staff, so now that its power had been proven, he could cover up any ineffectiveness of his own magic.</p><br/><p>It was a pretty good plan.</p><br/><p>Momonga could not help but congratulate himself. Had he ever been so cool and calculating in the past? However, there was nobody here who could answer Momonga’s question.</p><br/><p>He cast aside the doubts in his mind, and focused on using the magic of YGGDRASIL.</p><br/><p>There were over six thousand spells in the game, from Tier One to Tier Ten, as well as Super Tier magic. These spells were divided among various types and schools, and Momonga could use seven hundred eighteen of them. A normal level one hundred player would only be able to use three hundred of them, so Momonga was an exceptional case.</p><br/><p>Momonga had memorized almost all of these spells, and he considered which one to use now.</p><br/><p>To begin with, because the restriction on friendly fire had been lifted, he needed to know how the effective radius of a spell would show itself.</p><br/><p>Therefore, he decided against a single target spell, but picked an area effect spell. Next, considering his target was a strawman, he should—</p><br/><p>In YGGDRASIL, he could cast a spell by tapping its respective icon. However, there were no icons for him to touch. Therefore, there had to be some other way.</p><br/><p>He was not sure, but he had a faint idea of how to use his magic.</p><br/><p>It was a power hidden within him. Just like how he had deactivated his negative touch, Momonga focused within himself. An icon appeared, as though floating in mid-air—</p><br/><p>And Ainz smiled in delight.</p><br/><p>He was fully aware of information like the spell’s effective radius, its recast delay, and so on. Knowing this information, being sure of his power filled him with a surging excitement and warm satisfaction. Unlike in YGGDRASIL, he felt that the magic was part of him. This was a satisfaction he could never have experienced in YGGDRASIL.</p><br/><p>He channelled the jubilation in his heart — although his mood calmed quickly, he could still feel joy and excitement — into his fingertip, and spoke the words:</p><br/><p>“「Fireball」.”</p><br/><p>An expanding globe of flame shot out from the finger pointing at the strawman.</p><br/><p>The fireball struck the strawman unerringly, as he had predicted. It burst, releasing a wave of scorching flame that blew the strawman away. The inner part of the fireball exploded, turning the strawman and the surrounding area into a sea of fire.</p><br/><p>All this happened in an instant. Then, besides the blackened strawman, there was nothing left.</p><br/><p>“Fufufufu…”</p><br/><p>Aura and Mare watched Momonga snicker, clueless as to what was going on.</p><br/><p>“—Aura, set up another strawman.”</p><br/><p>“Ah, yes, at once! Hurry up and do it!”</p><br/><p>One of the Dragonkin picked up another strawman, and placed it beside the burned one.</p><br/><p>Momonga paced around the strawman, before casting a spell on it:</p><br/><p>“「Napalm」.”</p><br/><p>A column of flame appeared beside the strawman, engulfing it in fire. Momonga paused a beat, then cast another spell on the remnants of the strawman:</p><br/><p>“「Fireball」.”</p><br/><p>The fireball struck the remains of the strawman, scattering its ashes in a puff of smoke.</p><br/><p>The recast time between spells was the same as in YGGDRASIL. The actual process of casting was faster than in YGGDRASIL. Previously, in order to cast an area effect spell, he would need to choose the spell, then move the area effect cursor over the desired area. The process now was quicker than that.</p><br/><p>“Perfect,” Momonga said, his voice filled with the same satisfaction he felt in his heart.</p><br/><p>“Momonga-sama, should I prepare more strawmen?”</p><br/><p>Aura still did not understand. She was already aware that Momonga was a mighty magic caster, so she did not feel the show before her was anything special.</p><br/><p>However, that was the impression Momonga wanted to give them, and from the look on the twin’s faces, it would seem he had succeeded.</p><br/><p>“…No, there is no need. I wish to try something else.”</p><br/><p>After rejecting Aura’s suggestion, Momonga began his next experiment.</p><br/><p>“「Message」.”</p><br/><p>The first party he tried to contact was a GM. In YGGDRASIL, when one used the 「Message」 spell, as long as the other party was within the game, one would hear a call tone. Otherwise, there would be no sound, and the spell would immediately terminate.</p><br/><p>What happened now was somewhere between both of those. It felt like something was constantly reaching out, as though looking for something to connect to. This was the first time Momonga had experienced something like this and it was difficult to describe.</p><br/><p>This feeling continued for a while, and in the end, after failing to connect, the 「Message」 spell ended.</p><br/><p>A profound sense of disappointment flooded through him.</p><br/><p>Momonga tried casting the same spell again. This time, he did not choose a GM.</p><br/><p>This time, he picked one of his comrades from the past — a member of Ainz Ooal Gown.</p><br/><p>He cast the spell, though his heart was filled with one part of hope and ninety nine parts of resignation. As expected, there was no response. He tried to contact the forty, no, forty one members of the Guild with a 「Message」, but after receiving no reply, Momonga gently shook his head.</p><br/><p>In truth, he had expected this outcome and had resigned himself to it, but actually being confronted by that fact filled him with an incomparable feeling of despair.</p><br/><p>In the end, Momonga decided to contact Sebas.</p><br/><p>—It got through.</p><br/><p>This proved that the 「Message」 spell was working, and that most likely, it could only contact people within this new world.</p><br/><p>“Momonga-sama.”</p><br/><p>A voice of deepest respect echoed through his mind. Momonga considered that Sebas might have been bowing to him on the other side of the 「Message」, like in real-life companies.</p><br/><p>Just then, Sebas spoke again, as Momonga fell silent from thinking about these ridiculous things.</p><br/><p>“…May I ask if something is wrong?”</p><br/><p>“Ah, ahhh, forgive me. I spaced out there. That’s right, how are the surroundings like?”</p><br/><p>“Yes. We are surrounded by plains, with no intelligent creatures in sight.”</p><br/><p>“A plain… not a swamp?”</p><br/><p>The Great Underground Tomb of Nazarick should have been bordered by a swamp that was inhabited by frog-like demihumans called Tuvegs. The swamp was shrouded in mist, and it was poisonous.</p><br/><p>“Yes. There are only plains around us.”</p><br/><p>Momonga could not help but smile.</p><br/><p>All this was too much…</p><br/><p>“In other words, the Great Underground Tomb of Nazarick has been wholly transported to a different place? …Sebas, is there anything floating in the sky, or did anything like a message appear?”</p><br/><p>“No, there is nothing like that. The heavens are as boundless as the Sixth Floor’s night sky.”</p><br/><p>“What!? Did you say night sky?… Is there anything suspicious around you?”</p><br/><p>“No… I have not seen anything unusual. Besides the Great Underground Tomb of Nazarick, there are no other man-made structures in sight.”</p><br/><p>“Is that so… is that so…”</p><br/><p>What should he say? All Momonga could do was grab his head and try to think. But in his heart, he knew that this was most likely the case.</p><br/><p>Sebas’s silence was a subtle hint that he was awaiting orders. Momonga glanced at the strap on his left wrist. In another twenty minutes, the other Guardians would arrive. If that was the case, there was only one order he could give.</p><br/><p>“Return in twenty minutes. When you come back to Nazarick, head to the Colosseum. All the Guardians will be coming, so when you arrive, I hope you will tell them about what you saw.</p><br/><p>“Understood.”</p><br/><p>“Then, gather as much information as you can before you return.”</p><br/><p>After hearing Sebas’s acknowledgement, Momonga terminated the 「Message」 spell.</p><br/><p>Just as Momonga was about to sigh in relief that everything was over, he remembered the expectant looks on the twin’s faces.</p><br/><p>He had already told them he was going to verify the Staff’s power, so he had to let them see it. Momonga grasped the Staff, and pondered which fraction of its might he should reveal.</p><br/><p>The numberless powers within the Staff of Ainz Ooal Gown seemed to be begging Momonga to unleash them.</p><br/><p>Right now, he needed a flashy spell.</p><br/><p>“「Summon Primal Fire Elemental」.”</p><br/><p>In accordance with Momonga’s will, the Orb of Fire grasped within one of the Staff’s snake mouths pulsed with puissance. Momonga could feel the movement of a mighty, invisible power and thrust the Staff of Ainz Ooal Gown forth. A vast ball of light bloomed from the tip of the Staff, and a vortex of roaring flame spilled forth from that globe of radiance.</p><br/><p>The fires spun faster and faster, until the tornado of flame reached a width of four meters and a height of six meters.</p><br/><p>The crimson inferno threw off gusts of scorching air in all directions.</p><br/><p>From the corner of his eye, he could see the Dragonkin protecting Aura and Mare with their vast bodies. The searing winds made his cape flap violently. So intense was the heat that it would not have been unusual for a normal person to be burned by them, but Momonga had acquired a complete immunity to fire damage in order to negate one of the weaknesses of the undead, so it had no effect on him at all.</p><br/><p>Soon, the vast cyclone of fire, swallowing the surrounding air as it burned hot enough to melt metal, began to flicker and shudder as it took a humanoid form.</p><br/><p>Primal Fire Elementals could be said to be among the highest ranking among all elemental monsters. They were over level eighty five. Just like he had with the Moonlight Wolves, Momonga felt a mysterious connection to the Primal Fire Elemental.</p><br/><p>“Uwah…”</p><br/><p>Aura was watching it intently as she made noises of surprise.</p><br/><p>As she looked upon the top tier elemental, something that even her summoning powers would not be able to bring forth, Aura’s face bore a look of excited admiration, like a child who had just received a dearly beloved present.</p><br/><p>“…Do you want to fight it?”</p><br/><p>“Eh?”</p><br/><p>“Ehhhhh?”</p><br/><p>After a moment of hesitation, Aura grinned innocently. Compared to a normal child’s smile, hers was a little — no — the truth was that it was quite scary. In contrast, Mare’s smile from the side seemed more like that of a child.</p><br/><p>“Can I?”</p><br/><p>“Don’t worry. It’ll be fine even if you defeat it.”</p><br/><p>Momonga shrugged to indicate that it was all right. The Staff could summon one Primal Fire Elemental a day. In other words, the Staff could summon another such being after one day had passed. As such, defeating it would not be a great loss.</p><br/><p>“Ah, I suddenly remembered that I had something urgent to do…”</p><br/><p>“Mare.”</p><br/><p>A hand reached out and firmly grasped Mare’s arm, not allowing him to escape. His sister had no intention of fleeing. Aura’s smile stopped Mare in his tracks. Perhaps to Momonga it might have been a cute girl’s smile, but to the other person present, who looked almost the same as Aura, it was anything but cute, and Mare’s face froze solid as he looked on it.</p><br/><p>She dragged Mare in front of the Primal Fire Elemental. Mare’s eyes looked around, and he looked desperately to Momonga for help.</p><br/><p>In response to his hopeful smile that blossomed delicately on his face, Momonga simply clapped.</p><br/><p>The flower of hope promptly wilted.</p><br/><p>“All right, try your best, you two. Don’t blame me if you get hurt.”</p><br/><p>“Kay~”</p><br/><p>Aura responded energetically, in contrast with Mare’s nearly inaudible and despondent reply. Momonga felt that as long as Mare was around, neither of them would get hurt. Thus, by the power of the connection between himself and his summoned creature, he ordered the Primal Fire Elemental to attack the twins.</p><br/><p>As the conflagration that was the Primal Fire Elemental approached them, the twins met its attack with Aura as the frontliner while Mare was the rear guard.</p><br/><p>Aura slashed at the Primal Fire Elemental, holding her whip in both her hands, while Mare used magic to deal damage.</p><br/><p>“Well, it seems it’ll be an easy fight.”</p><br/><p>Momonga’s eyes left the one-sided battle taking place before him and began to ponder the other things he needed to investigate.</p><br/><p>He had already finished verifying that he could use and activate his spells and equipped magic items. Thus, the next things he had to check on were his other items. Scrolls, wands, and rods were particularly important. All of them were magic items that could produce a spell-like effect. Scrolls were one-use expendables, while rods and wands had charges, which they consumed to produce their effects.</p><br/><p>Momonga possessed many magic items. He was a hoarder by nature and did not like using expendable items because he felt it was a waste, to the point where he did not even feel like using high-end recovery items when he encountered a boss. This went beyond mere prudence to miserliness, which was why his stock of items was so great.</p><br/><p>In YGGDRASIL, all of these were stored in his personal inventory. Then, in this world, where had his inventory and all its contents gone?</p><br/><p>Momonga recalled how he had opened his inventory in the past, and reached his hand into the air as though searching for something. It felt as though he was reaching his hand past the surface of a lake, and an observer would think that Momonga’s hand and part of his arm had vanished into nothingness.</p><br/><p>Then, like he was opening a window, Momonga swept his hand to one side. A hole appeared out of nowhere, and within it were many beautifully-crafted magic staves. It was exactly like the inventory in YGGDRASIL.</p><br/><p>He moved his hand in a scrolling motion. In the space revealed, one could see all manner of scrolls, wands, weapons, armor, cosmetic items, gems, potions, other consumables… the sheer number of magic items in there was awe-inspiring.</p><br/><p>Thus relieved, Momonga could not help but laugh.</p><br/><p>If this were the case, Momonga felt that he could guarantee his own safety even if everyone in the Tomb set themselves against him.</p><br/><p>As he absently watched Aura and Mare’s intense battle, Momonga considered the things he had learned so far.</p><br/><p>Were the NPCs he met programs?</p><br/><p>No, their sapience was such that they were indistinguishable from human beings. Programs could not show such complex emotions. He could assume that for some mysterious reason, they had ended up like human beings.</p><br/><p>And what was this world?</p><br/><p>He had no idea. Since he could use YGGDRASIL’s magic here, it made sense to think of this place as being in YGGDRASIL, but after observing various discrepancies, it did not seem like he was in a game. Was he in a game, or a new world? The answer was probably one of those.</p><br/><p>How should I deal with future events?</p><br/><p>Momonga had already verified that he could use his abilities from YGGDRASIL. That being the case, if the data for the monsters and NPCs of the Great Underground Tomb of Nazarick had carried over as well, he could be reasonably sure that they were not his enemies.</p><br/><p>The thing was, if they were not data programs, but some other kind of being, then he would have to treat them differently. For the time being, it would be best to display the attitude of a superior being and put on an act of stern majesty — provided he could pull it off.</p><br/><p>In what direction should I proceed in the future?</p><br/><p>He should search hard for clues. Although he was not sure what was going on with this world, for the time being, Momonga was simply a clueless wayfarer. He had to take small steps and carefully gather information.</p><br/><p>If this is another world, should I try to return to the real world?</p><br/><p>There were doubts in his heart. If he had friends in the real world, then he should go back to it. If his parents were still alive, he would desperately find a way back to them. If he had family members to care for, or a girlfriend…</p><br/><p>But he did not have anyone like that.</p><br/><p>His life was an endless cycle of going to the office to work and returning home to log onto YGGDRASIL, where he would prepare for his comrades to come back. But now, none of that waited for him. Then, was there any point at all in going back?</p><br/><p>But if he could go back, then he should think of a way to get back. It was better to have more options, because the world outside might be a hellish one.</p><br/><p>“What should I do…”</p><br/><p>Momonga’s quiet mumbling carried softly through the air.</p><br/><p>Part 4</p><br/><p>The gigantic Primal Fire Elemental vanished slowly, as though melting away into nothing. The blazing heat that it left in its wake began to cool off. As the Fire Elemental disappeared, Momonga could feel the link he had to it fading away, like smoke on the wind.</p><br/><p>The Primal Fire Elemental possessed extraordinary attack power and stamina, but to Aura, who could ignore the damage of its area effect flames and could nimbly evade its blows, it was little more than a giant target.</p><br/><p>Although Aura would still lose HP if she were attacked, Mare the druid would not permit that to occur. In fact, he had cast all sorts of buffs and debuffs to great effect during the battle.</p><br/><p>The two of them played their roles as frontliner and rear guard perfectly, with flawless teamwork. At the same time, Momonga could feel the reality of this battle, completely unlike those he had fought in the game.</p><br/><p>“Spectacular… the two of you put on a good show.”</p><br/><p>The twins smiled happily as they heard Momonga’s sincere praise.</p><br/><p>“Thank you, Momonga-sama! It’s been some time since we had to work so hard!”</p><br/><p>The two of them tried to wipe off their sweat, but right after they did, more of it beaded on their skin, rolling down their dark skin.</p><br/><p>Momonga silently opened his inventory, and withdrew a magic item — a Pitcher of Endless Water.</p><br/><p>In YGGDRASIL, there were statuses like hunger and thirst, but neither of those applied to the undead Momonga, so he had no use for items like those. At most, he used them on his mounts.</p><br/><p>The glass pitcher was filled with water. Droplets of condensation immediately formed on the surface of the glass; probably because the water inside was very cold.</p><br/><p>Momonga then took out a pair of beautiful glasses, filled them with water from the Pitcher, and gave them to the twins.</p><br/><p>“Aura, Mare, have a drink.”</p><br/><p>“Eh? But that’s not good, right, Momonga-sama…”</p><br/><p>“Y-Yes, I can make water with my magic too…”</p><br/><p>Momonga smiled bitterly as he saw Aura waving her hand and Mare shaking his head.</p><br/><p>“Think nothing of it. The two of you have always done well. Think of this as my thanks to you.”</p><br/><p>“Fuwa~”</p><br/><p>“Fuee~”</p><br/><p>Aura and Mare’s ears turned red, and they shyly, nervously reached out to take the glasses.</p><br/><p>“Th-Thank you, Momonga-sama!”</p><br/><p>“To, to think you would pour water for us, Momonga-sama!”</p><br/><p>Was this so delightful?</p><br/><p>Aura, who had ceased her protests, took the glass in both hands and downed it in one gulp. Droplets of water escaped the corner of her mouth, down the smooth curves of her pulsing throat and into the jerkin covering her chest. Mare held his cup with both hands and slowly sipped from it. The differences between them were obvious even in the way they drank water.</p><br/><p>Momonga touched his throat as he saw the two of them. It felt like there was a thin layer of skin around his neck bones.</p><br/><p>To date, this body of his had not felt thirst, so it did not bother him. Although he was well aware that the dead would not feel this way, he could not help but think this was all a joke once he realized that he was no longer human.</p><br/><p>Momonga continued touching himself. He had no skin, muscles, blood vessels, nerves, or internal organs. His body was nothing but bones. He vaguely understood it in his heart, but it felt so unreal that he could not help exploring his body with his fingers.</p><br/><p>His sense of touch seemed duller from when he was a human being, as though there was a thin layer of cloth between his fingers and whatever he was touching. In contrast, his vision, hearing and other senses were sharper than before.</p><br/><p>One might expect a body composed solely of bones to be easily broken, but each bone felt stronger than steel when he touched them.</p><br/><p>At the same time, he felt a strange sense of completion and satisfaction, that this was his real body, despite it being completely different from his old one. Perhaps it was because of this feeling that he was not afraid, despite his transfiguration into a set of white bones.</p><br/><p>“Do you want more?”</p><br/><p>Momonga raised the Pitcher as he asked the twins, who had finished their water.</p><br/><p>“Er, thanks! I’ve drunk enough!”</p><br/><p>“Is that so? Then, Mare, do you want some more?”</p><br/><p>“Eep! Er, er, I, I’ve also had enough. I, I don’t feel thirsty any more.”</p><br/><p>Momonga nodded as he took back the glasses, before returning them all into his pocket space.</p><br/><p>Aura suddenly whispered, “I thought Momonga-sama would be scarier than this.”</p><br/><p>“Oh? Really? Well, if you feel that way…”</p><br/><p>“Now is good! It’s the best!”</p><br/><p>“Then we’ll leave it at that.”</p><br/><p>Momonga was taken somewhat aback by Aura’s passionate answer.</p><br/><p>“Mo-Momonga-sama, are we the only ones that you’re nice to…?”</p><br/><p>Momonga was unsure how to answer Aura’s muttered question. Instead, he patted her lightly on the head.</p><br/><p>“Ehehehe.”</p><br/><p>Aura looked like a puppy that had just seen something she liked, while Mare had a jealous look on his face. Just then, a voice rang out:</p><br/><p>“Oya, am I the first to arrive?”</p><br/><p>The tone was archaic and formal, but the voice itself sounded like it belonged to a young person. A shadow formed over the ground, and then the shadow turned into what looked like a door, from which a person emerged.</p><br/><p>She wore a black ball gown which looked soft to the touch. Her skirt was puffed up into a voluminous bell shape. On top of that was a bolero edged with frills, lace, and ribbons, as well as a pair of long silk gloves. Together, they covered up most of her skin.</p><br/><p>Her skin was as pale as wax, and her looks could only be described as stunningly beautiful. Her long silver hair was tied up into a ponytail that descended from one side of her head, exposing her face. Her deep red pupils were filled with a seductive look of delight.</p><br/><p>She looked to be fourteen years old, or younger, and her innocent, youthful appearance combined the qualities of cuteness and beauty into a single whole. However, her breasts bulged proudly forward in a decidedly unchildlike manner.</p><br/><p>“…Weren’t you told not to frivolously use 「Gate」 in Nazarick? We are warded against teleportation, after all. You should be able to walk here, so shouldn’t you have come on foot, Shalltear?”</p><br/><p>The annoyed voice came from beside Momonga. There was no trace of its previous puppy-like obedience in those cold words, only a burning hostility.</p><br/><p>Mare was trembling by the side, and he slowly edged himself away from his sister. In truth, the speed at which the leopard called Aura had changed its spots startled Momonga as well.</p><br/><p>The girl who had come here via the highest tier of teleportation magic was called Shalltear. She did not even bother looking at Aura, who was scowling at her. Instead, she swiftly advanced before Momonga.</p><br/><p>The bewitching scent of some kind of perfume hung around her.</p><br/><p>“…Something stinks,” Aura spat. Then, she followed up with, “Don’t tell me you started rotting because you’re undead?”</p><br/><p>Perhaps she saw Momonga reflexively raising his hand to sniff himself, but Shalltear furrowed her brows unhappily and replied:</p><br/><p>“…Is that not quite distasteful? Momonga-sama is undead as well.”</p><br/><p>“Hah? What nonsense are you talking, Shalltear? Momonga-sama is no mere undead being. He’s more like a super undead, or a godly undead.”</p><br/><p>Momonga was somewhat baffled as he heard Shalltear and Mare going “Ah,” and “Mm,” respectively. The fact was that in YGGDRASIL, he considered himself to be an ordinary undead creature… which was what Momonga thought as he rounded his shoulders.</p><br/><p>In any case, there were no such things as super or godly undead.</p><br/><p>“But, but Nee-chan, maybe you shouldn’t have said that…”</p><br/><p>“Is, is that so? All right, then, ah, take two, then. Ahem… Don’t tell me you started rotting because you’re a walking corpse.”</p><br/><p>“That… er, well, that seems okay, sort of.”</p><br/><p>After agreeing with Aura’s take two, Shalltear placed her slender hands on the sides of Momonga’s head, as though to embrace it.</p><br/><p>“Ah, my master, my beloved master, the only one whom I cannot rule over…”</p><br/><p>Her carmine lips parted, revealing a moist, slick tongue. The tongue moved like a living creature as Shalltear lovingly licked her lips. Her fragrant breath wafted out from her open mouth.</p><br/><p>Although she was perfectly suited for the role of an alluring seductress in all other ways, she was far too young for it. The discrepancy between her expectations and reality was laughable. In addition, she was far too short. When she reached her hands out to hug Momonga, it looked like she wanted to hang from his neck instead.</p><br/><p>However, this was too much affection for Momonga, who was not used to girls. He wanted to take a step back, but in the end he decided to stand his ground.</p><br/><p>Is that how she really is? That thought echoed endlessly in his head. However, when Momonga thought about the fact that she had been designed by his comrade Peroroncino, he mused that she might have been designed with such a personality. After all, Peroroncino loved H-games and proudly declared that they were his life.</p><br/><p>Shalltear Bloodfallen was made by such a rotten individual.</p><br/><p>She was a “True Vampire”, the Guardian of the First to Third Floors of the Great Tomb of Nazarick.</p><br/><p>At the same time, she was a girl created by an H-game aficionado and her character design was filled with nods to various H-games.</p><br/><p>“…That’s enough out of you…”</p><br/><p>Shalltear reacted to the low growl for the first time. In a mocking tone, she told Aura, “Ara, are you still here, shorty? I couldn’t see you, so I thought you were gone.”</p><br/><p>Momonga did not wish to add to what Shalltear had just said.</p><br/><p>Aura’s face was twitching uncontrollably, and then Shalltear ignored her and said to Mare, “It must be pretty tough for you, having to deal with a weirdo sister like that. You’d best leave her soon, lest you become a weirdo like her.”</p><br/><p>Mare’s face blanched instantly, because he knew Shalltear wanted to use him to start a fight.</p><br/><p>However, Aura simply smiled. And then—</p><br/><p>“Shut up, fake tits.”</p><br/><p>— She dropped a bombshell.</p><br/><p>“…What the hell are you talking about—!?”</p><br/><p>Ah, her character’s broken down, Momonga muttered under his breath.</p><br/><p>Now that Shalltear’s true nature had been revealed, she dropped the cultured act.</p><br/><p>“Hmph, it’s so obvious — damn, that is one weird chest, how many pads did you stuff in there?”</p><br/><p>“Uwah—uwah—”</p><br/><p>Shalltear was waving her hands in panic, as though she could disperse Aura’s words with them, while she had a suitably childish expression on her face. On the other hand, Aura grinned evilly.</p><br/><p>“You packed so much in there… I bet it shifts when you run, right?”</p><br/><p>“Kuhii!”</p><br/><p>Shalltear made a strange noise as an extended finger poked her.</p><br/><p>“I was right, wasn’t I? Kukuku! Where have they gone—!? So that’s why you didn’t run, even though you were worried, and instead you used a 「Gate」—”</p><br/><p>“Shut up, shorty! It’s not like you have anything of your own! At least I… no, I’ve got a lot more to show off!”</p><br/><p>Aura simply grinned in the face of Shalltear’s desperate counterattack. A shocked Shalltear stumbled back, and reflexively covered up her chest. It was a sorry sight.</p><br/><p>“…I’m only seventy six, and I’ve got lots more time to grow, unlike an undead with no future like you. Ah, how sad — you will never grow again~”</p><br/><p>Shalltear moaned in frustration and took another step back. There was a desperate, harried look on her face, which only made Aura smile in a frightening manner.</p><br/><p>“To think you’re actually happy with that bust of yours — hmph!”</p><br/><p>Momonga imagined he could hear Shalltear snapping.</p><br/><p>“You shitty brat—! It’s too late to regret your words now—!”</p><br/><p>Roiling black mist boiled off Shalltear’s hands. Aura readied her whip in anticipation. Momonga and Mare, watching from the side, were at a loss for words.</p><br/><p>The scene before Momonga’s eyes was vaguely familiar, and he wondered if he should stop them.</p><br/><p>Peroroncino-san, who designed Shalltear, and Bukubukuchagama-san, who designed Aura and Mare, were younger brother and elder sister, and at times they would argue in a friendly manner, like what was happening now.</p><br/><p>Momonga recalled the forms of his former comrades as he stood behind the quarrelling pair.</p><br/><p>“What. A. Ruckus.”</p><br/><p>The inhuman voice came just as Momonga was reminiscing about the past. The strange, monotonous voice finally silenced the two of them.</p><br/><p>As he turned to look at the voice’s origin, he saw a heteromorphic being shrouded in chilled air.</p><br/><p>It stood two and a half meters tall, and resembled a bipedal insect. It looked like some fiend had melded a praying mantis and an ant together. It had a tail that was twice as long as its body, and it was covered in sharp spikes which resembled icicles. Its powerful-looking mandibles looked like they could sever a man’s arm in a single bite.</p><br/><p>It grasped a platinum halberd in two of its hands, and in its other two hands were a masterfully-made mace wreathed in a black aura, and a gnarled-looking broadsword which did not look like it could be sheathed.</p><br/><p>It was surrounded by a frightening aura of cold. Its exoskeleton was a dull blue color and sparkled like diamond dust. Protrusions which looked like icebergs bulged up from its back and shoulders.</p><br/><p>He was the Guardian of the Fifth Floor, the “Ruler of Glaciers”, Cocytus.</p><br/><p>The hilt of his halberd slammed into the arena floor, and the ground around it began to freeze.</p><br/><p>“You. Stand. Before. A. Supreme. Being. Contain. Yourself.”</p><br/><p>“This brat started it!”</p><br/><p>“Actually—”</p><br/><p>“Awawawa…”</p><br/><p>Shalltear and Aura locked gazes, while Mare panicked from the side. Momonga could not hold it in any longer, and curtly addressed the two of them.</p><br/><p>“…Shalltear, Aura. Playtime is over.”</p><br/><p>The two of them shuddered in shock, then lowered their heads simultaneously.</p><br/><p>“My sincerest apologies!” they said in unison.</p><br/><p>Momonga magnanimously accepted their apologies with a nod. Then, he turned and said, “Cocytus, you’ve come.”</p><br/><p>“I. Came. Immediately. Upon. Receiving. Your. Summons. Momonga-sama.”</p><br/><p>The water in the air froze with a crackling sound as it made contact with the white vapor puffing out of Cocytus’s mouth as he spoke. This cold was every bit as frigid as the Primal Fire Elemental was hot. Anyone standing near him would suffer the effects of the lowered temperature, and they might even sustain frostbite. However, Momonga did not feel anything. The fact was that everyone here was resistant to fire, cold, and acid attacks, or had some way to deal with them.</p><br/><p>“You must have been very free with no intruders around, no?”</p><br/><p>“Indeed.”</p><br/><p>The clacking from his lower mandibles sounded like the threatening noises of a wasp. However, Momonga had the feeling that he was laughing.</p><br/><p>“Even. So. There. Are. Still. Things. Which. Must. Be. Done. So. I. Was. Not. Free. At. All.”</p><br/><p>“Oh? Things that had to be done? What things were these, may I ask?”</p><br/><p>“Training. In. Order. To. Be. Ready. To. Deploy. At. Any. Time.”</p><br/><p>Although it was not too obvious from his appearance, Cocytus was designed to be the quintessential warrior, be it in personality or body. Therefore, from the perspective of a weapon user, his attacks were the strongest in the Great Underground Tomb of Nazarick.</p><br/><p>“You’ve done all this for me. You’ve worked hard. My thanks.”</p><br/><p>“After. Hearing. Your. Praise. The. Task. Is. Not. As. Tiring. I. See. Demiurge. And. Albedo. Have. Arrived.”</p><br/><p>Momonga turned in the direction Cocytus was looking, at the entrance of the Colosseum, where he saw two figures enter. The one in front was Albedo, while a man followed behind her like a lackey. Once she got close enough, Albedo smiled to Momonga and bowed deeply.</p><br/><p>The man bowed and said, “Forgive me for keeping everyone waiting.”</p><br/><p>He was about one hundred eighty centimeters tall, and his skin was darkened from the sun. His facial features looked to be Oriental, while his jet-black hair was neatly combed back. The eyes under his pince-nez glasses could not even be said to be narrowed. It was doubtful whether they were actually open at all.</p><br/><p>He was dressed in a Western suit, with a matching tie. He gave the impression of being a professional businessman, or a skilled lawyer.</p><br/><p>However, his gentlemanly appearance was hard-pressed to hide the evil air about him. A tail sheathed in silvery metal extended behind him, tipped by six sharp spikes. He was limned by flickering black flames.</p><br/><p>This man was the “Creator of Blazing Inferno”, Demiurge.</p><br/><p>He was the Guardian of the Seventh Floor of the Great Underground Tomb of Nazarick. This demon was designed to be the defense commander of the NPCs.</p><br/><p>“It seems everyone is here.”</p><br/><p>“—Momonga-sama, there are two more people who have not yet arrived,” said a resonant voice that seemed to pour into one’s heart.</p><br/><p>Demiurge’s words were empowered by a passive skill. This skill was called 「Command Mantra」, and it could instantly turn the weak-minded into puppets dancing on Demiurge’s strings.</p><br/><p>However, this skill had no effect on the people present. It was only useful on people below level forty, so to everyone here, it simply sounded good.</p><br/><p>“No. Those two Guardians are only to be moved under special circumstances. Therefore, there is no need to call them over at the moment.”</p><br/><p>“I see.”</p><br/><p>“…My. Allies. Have. Not. Arrived. Yet.”</p><br/><p>Aura and Shalltear froze as they heard those words, and the smile froze on Albedo’s face.</p><br/><p>“…That, that fellow is just an Area Guardian in one of the floors which I… which we are in charge of.”</p><br/><p>“Y-Yes…”</p><br/><p>Shalltear and Aura smiled stiffly, while Albedo nodded vigorously in agreement.</p><br/><p>“…Kyouhukou, is it. Indeed, it would be good to inform the various Area Guardians. Then, let the Area Guardians like Guren and Grant know about it as well. I will leave that task to the various Floor Guardians.”</p><br/><p>There were two kinds of Guardians in the Great Underground Tomb of Nazarick.</p><br/><p>Floor Guardians, like the ones before Momonga at the moment, were responsible for one or more floors. Area Guardians were responsible for an individual area within a floor. Simply put, the Floor Guardians were in charge of the Area Guardians, who were in turn in charge of a specific domain. Since there were many of them, they were individually not very important. In Nazarick, the term Guardian usually referred to a Floor Guardian.</p><br/><p>After the various Floor Guardians showed that they understood Momonga’s orders, Albedo commanded:</p><br/><p>“Then, everyone, let us pledge our loyalty to the Supreme One.”</p><br/><p>All the Guardians nodded as one, and before Momonga could interrupt, they had lined up before him. Albedo stood at their head, while the other Guardians formed a line behind her. All the Guardians had solemn, respectful expressions. They showed no sign of playing around.</p><br/><p>Shalltear, who stood on one end of the line, stepped forward:</p><br/><p>“Shalltear Bloodfallen, Guardian of the First, Second and Third Floors, presents herself to the Master.”</p><br/><p>She went to one knee, one hand pressed against her chest, and bowed deeply. After that, Cocytus stepped forward and said:</p><br/><p>“Cocytus. Guardian. Of. The. Fifth. Floor. Presents. Himself. To. The. Master.”</p><br/><p>Much like Shalltear had, he knelt before Momonga like a vassal before a lord. Then, it was the twin dark elves’ turn:</p><br/><p>“The Guardian of the Sixth Floor, Aura Bella Fiora, presents herself to the Master.”</p><br/><p>“Al-Also a Guardian of the Sixth Floor, Mare Bello Fiore, presents himself to the Master.”</p><br/><p>They knelt respectfully and lowered their heads to Momonga. Shalltear, Cocytus, Aura, and Mare all had different bodies and thus they should have each taken their steps forward differently. Yet, the way with which they knelt was identical, and they lined up neatly.</p><br/><p>After that, Demiurge advanced in a dignified manner.</p><br/><p>“The Guardian of the Seventh Floor, Demiurge, presents himself to the Master.”</p><br/><p>Following his crisp words, Demiurge went to one knee in a graceful descent, as though expressing his heart through his actions. Finally, Albedo stepped forward as well.</p><br/><p>“The Guardian Overseer Albedo presents herself to the Master.”</p><br/><p>She smiled to Momonga, and knelt like the other Guardians. However, Albedo continued speaking in a high and clear voice as she delivered her report to Momonga.</p><br/><p>“With the exception of the Fourth Floor Guardian Gargantua and the Eighth Floor Guardian Victim, all the Floor Guardians are gathered before you. Thus do we offer up our utmost loyalty to the Master.”</p><br/><p>Momonga could not speak as he looked at the six lowered heads before him. A strange pressure veiled the entire area, and perhaps only Momonga could bear the painful, crushing air.</p><br/><p>—He did not know how to proceed.</p><br/><p>He had never seen anything like this before in his life. In his confusion, Momonga accidentally activated a skill. A dreadful aura roiled out over the surroundings, and a halo of black radiance formed behind him.</p><br/><p>Momonga had no time to cancel the skill as he frantically racked his brains to recall a scene from movies or television which would tell him how to respond appropriately here.</p><br/><p>“Raise your heads.”</p><br/><p>With a sha, everyone raised their heads. Their coordination was so immaculate that Momonga wondered if they had practiced that movement together.</p><br/><p>“Then… first, I thank all of you for coming here.”</p><br/><p>“There is no need for thanks. We are all Momonga-sama’s loyal subordinates. To us, Momonga-sama is our Supreme Overlord.”</p><br/><p>None of the Guardians opposed her statement. As expected of the Guardian Overseer.</p><br/><p>Momonga looked on the Guardians with a stern face, and he felt a choking sensation in his nonexistent throat. It was the weight of being a leader bearing down on him.</p><br/><p>In addition, any orders he gave now would affect his relationship with them in the future. He could not help but hesitate as he contemplated the possibilities.</p><br/><p>Would he lead the Great Tomb of Nazarick to destruction because of his decisions — the unease generated by that thought flooded his heart and mind.</p><br/><p>“…Momonga-sama, it is only natural that you should have doubts about us. After all, our abilities must be miniscule in your reckoning.”</p><br/><p>Albedo removed the smile from her face, and continue in a respectful tone that was laced with a stern strength.</p><br/><p>“However, if Momonga-sama gives the order, we — all the Guardians will accomplish any task set to us, no matter how difficult or arduous, with every fiber of our beings. We hereby swear that we will never allow the Forty One Supreme Beings of Ainz Ooal Gown, our creators, to be disgraced by our actions.”</p><br/><p>“This we swear!”</p><br/><p>The Floor Guardians chimed in right after Albedo. Their voices were filled with power, and that adamant loyalty and determination would not be diminished by any number of foes. It was as though they were mocking Momonga’s previous worries that the NPCs might betray him.</p><br/><p>The darkness in his heart vanished like shadows in the morning sun. Momonga was moved to the bottom of his heart that the NPCs designed by the members of Ainz Ooal Gown were possessed by such excellence.</p><br/><p>The golden radiance of the past still remained.</p><br/><p>The embodiment of everyone’s hard work, their cunningly crafted creations, were still here. It filled him with joy.</p><br/><p>Momonga smiled, although his skeletal face could not display any emotions. The points of crimson light in his eye sockets seemed to shine exceptionally bright. His prior unease had was no longer existent, and he simply spoke the words expected of a guildmaster.</p><br/><p>“Excellent. Guardians, I know that you will understand my aims and successfully carry out my commands. There may be some things which are difficult to understand, but I hope you will pay attention and listen. I believe the Great Underground Tomb of Nazarick has been caught up in some kind of unknown situation.”</p><br/><p>The Guardians’ faces were still stern, and there was no trace of surprise on them.</p><br/><p>“Although I do not know what has caused this incident, the Great Tomb of Nazarick has been transported from its place in the swamps to a vast plain. Did anyone foresee the occurrence of this strange event?”</p><br/><p>Albedo looked back at the Guardians, and after seeing the reply written on their face, she said:</p><br/><p>“Regretfully, none of us have any idea of what is going on.”</p><br/><p>“Then, I have a question for the Floor Guardians. Have any of you discovered anything strange in your floors?”</p><br/><p>After hearing this, each Floor Guardian responded:</p><br/><p>“There are no abnormalities in the Seventh Floor.”</p><br/><p>“Same with the Sixth Floor.”</p><br/><p>“I-It’s as Nee-chan says.”</p><br/><p>“The. Fifth. Floor. Is. The. Same.”</p><br/><p>“Nothing strange has been sighted in the First to Third Floors.”</p><br/><p>“—Momonga-sama, I shall investigate the Fourth and Eighth Floors right away.”</p><br/><p>“Then I will leave that matter to Albedo. However, you must be careful on the Eighth Floor. If an emergency situation occurs there, a situation may emerge that you cannot deal with.”</p><br/><p>Albedo bowed her head deeply to indicate she understood, and then Shalltear said:</p><br/><p>“Then, I shall handle matters on the surface.”</p><br/><p>“There is no need. Sebas is currently reconnoitering the surface.”</p><br/><p>Surprise flashed across the faces of Albedo and the other Guardians.</p><br/><p>In the Great Underground Tomb of Nazarick, there were four NPCs who were exponents of melee combat. Cocytus had the strongest attack power when using a weapon, Albedo had an impregnable defense when in her heavy armor, while Sebas in his true form was stronger than either of them in melee combat. And then was one more, who was superior to all of them.</p><br/><p>There could be no other reason for the Guardians’ surprise. Sebas, who could sweep away anyone before him in hand-to-hand combat, had been assigned to the simple task of reconnaissance. They could tell how seriously Momonga was taking this strange occurrence, and everyone was on their guard as a result.</p><br/><p>“It’s about time for him to return.”</p><br/><p>Just then, Momonga saw Sebas jogging over to them, until he reached the Guardians genuflecting before Momonga and went to one knee as well.</p><br/><p>“Momonga-sama, forgive my lateness.”</p><br/><p>“It’s fine. Then, your report on the surrounding conditions.”</p><br/><p>Sebas raised his head and looked around at the Guardians kneeling beside him.</p><br/><p>“…The situation is critical, so obviously the Floor Guardians need to know as well.”</p><br/><p>“Yes. To begin with, the terrain surrounding us for a kilometer in each direction is a plain. There are no signs of man-made structures. I spotted some small animals, but there were no humanoid or large creatures.”</p><br/><p>“Were those small animals monsters?”</p><br/><p>“No, they were life forms which had no combat power.”</p><br/><p>“…I see. Then, were the plains you spoke of covered in frozen grass which would cut you as you passed them?”</p><br/><p>“No, it was simple grass. There was nothing special about it.”</p><br/><p>“And you did not see any sky castles or similar buildings?”</p><br/><p>“No, I did not. There was no sign of man-made illumination in the sky or on the land.”</p><br/><p>“I see, so there was only a starry sky… Thank you for your hard work, Sebas.”</p><br/><p>As he praised Sebas for his efforts, Momonga was somewhat disappointed because he had not obtained any useful information.</p><br/><p>However, he was slowly realizing that he was no longer in the game world of YGGDRASIL, although he did not understand why he could use YGGDRASIL’s equipment and use its spells.</p><br/><p>He did not know why they had come here, but it would be wise to heighten Nazarick’s combat readiness just in case. For all he knew, this might be someone else’s territory, and he might be censured for having come here without permission. No, he would be lucky if that was all that happened.</p><br/><p>“Guardians, increase the readiness of each floor by one level. We are unsure of what has happened, so do not act incautiously. If you encounter an intruder, do not slay them, but capture them alive at all costs. When you capture them, do as little harm to them as possible. I apologise for imposing such demands on all of you at a time like this.”</p><br/><p>The Guardians voiced their acknowledgement and nodded in unison.</p><br/><p>“Next, I would like to understand the administrative operations of the Tomb. Albedo, how is the exchange of security information between the Guardians of the various floors?”</p><br/><p>In YGGDRASIL, the Guardians were simple NPCs, and they could only act according to their programs. There was no way the floors would exchange security information and monsters.</p><br/><p>“Each Floor is administered by its respective Floor Guardian, but Demiurge is the overall defense commander, and everyone can share information with him.”</p><br/><p>Momonga was a bit surprised, but then he nodded in satisfaction.</p><br/><p>“Excellent. Nazarick’s defense commander, Demiurge. Guardian Overseer, Albedo. The two of you will be in charge of drawing up a more comprehensive administrative system for Nazarick.”</p><br/><p>“Understood. Will the plans for the management system include the Eighth, Ninth and Tenth floors?”</p><br/><p>“The Eighth Floor is managed by Victim, so it’ll be fine. No, entry to the Eighth Floor is forbidden. I rescind the order I just gave to Albedo as well. In short, entry to the Eighth Floor will only be effected with my permission. I will undo the seal and permit direct access from the Seventh Floor to the Ninth Floor. After that, plan for the Ninth and Tenth Floor as one whole.”</p><br/><p>“Is, is that your will?”</p><br/><p>Albedo seemed quite surprised. Behind her, Demiurge’s eyes went wide, revealing his thoughts on the matter.</p><br/><p>“Will the underlings be allowed to tramp through the domain of the Supreme Beings? Must they be given that much freedom?”</p><br/><p>The underlings in question were not the NPCs and monsters designed by the members of Ainz Ooal Gown, but the automatically spawned (pop) monsters from the dungeon. The fact was that the Ninth and Tenth Floor lacked such monsters, barring very rare exceptions.</p><br/><p>Momonga muttered to himself.</p><br/><p>Albedo seemed to regard that place as a holy sanctuary, but that was not the case.</p><br/><p>The reason why there were no pop monsters on the Ninth Floor was simply because if any intruders could overcome the NPC defenders of the Eighth Floor, the most powerful beings in the Tomb, then Ainz Ooal Gown’s chances of victory would be slim. Thus, it would be better to play the role of a villain to the hilt, and meet the invaders in the throne room for a final showdown.</p><br/><p>“…It will be fine. Because it’s an emergency, we need extra hands for security.”</p><br/><p>“Understood. I shall select only the finest and most potent troops for this duty.”</p><br/><p>Momonga nodded, and looked toward the twins.</p><br/><p>“Aura and Mare… can you conceal the Great Underground Tomb of Nazarick? Simple illusions don’t seem very reliable, and thinking about the cost of illusions gives me a headache.”</p><br/><p>Aura and Mare looked at each other and began thinking. After a while, Mare spoke up:</p><br/><p>“U-Using magic might be tricky. If we had to hide everything along with the surface… although, we could cover the walls in mud, and then add plants as camouflage.”</p><br/><p>“Do you intend to soil the glorious walls of Nazarick with base dirt?”</p><br/><p>Albedo said that with her back turned to Mare. Although her voice was sweet and velvet, the tone it carried was anything but.</p><br/><p>Mare’s shoulders trembled, and although the surrounding Guardians remained silent, their attitudes suggested that they shared Albedo’s opinion.</p><br/><p>In contrast, Momonga felt Albedo was being too much of a busybody. The situation was hardly serious enough to warrant such a reaction.</p><br/><p>“Albedo… don’t speak out of turn. I am addressing Mare.”</p><br/><p>His voice was so deep that it surprised Momonga himself.</p><br/><p>“Ah, my deepest apologies, Momonga-sama!”</p><br/><p>Albedo’s head was as low as it could go, and her face was frozen in fear. The Guardians and Sebas stiffened up as well. Perhaps they thought that scolding was directed at them as well.</p><br/><p>A twinge of remorse struck Momonga as he observed the quick change in the Guardians’ attitude, but he continued speaking to Mare:</p><br/><p>“Can you conceal the walls by heaping dirt onto them?”</p><br/><p>“Yes, yes I can, if you allow it, Momonga-sama … However…”</p><br/><p>“Yes, an observer from a distance would think the ground was bulging up unnaturally. Sebas, are there any nearby hills or the like?”</p><br/><p>“There are none. Regretfully, we are surrounded by flatlands. However, since there are nights here, we should be able to perform some sort of eye-deceiving camouflage while the sun is down.”</p><br/><p>“Is that so… if all we intend to do is hide the walls, Mare’s idea will be enough. Then, what if we piled up the dirt from the nearby land to make dummy hills as camouflage?”</p><br/><p>“Then we would blend in.”</p><br/><p>“Very well. I shall assign Aura and Mare to carry out this task together. While doing so, you may draw the necessary supplies from each Floor. Since we cannot camouflage the view from the air, we shall use illusions after finishing the earthworks, so nobody will be able to detect Nazarick from the outside.”</p><br/><p>“Y-Yes. U-Understood.”</p><br/><p>That was all he could think of at the moment. There were probably a lot of holes left in the plan, but that could be dealt with slowly, later on. After all, it had only been a few hours since all this had happened.</p><br/><p>“Then, you are dismissed for today. Everyone, take a break before beginning your duties. There are many things we do not know, so do not push yourselves too hard.”</p><br/><p>The Guardians nodded as one to show that they understood.</p><br/><p>“Finally, I have a question for the Guardians. To begin with, Shalltear — what kind of person am I to you?”</p><br/><p>“An incarnation of beauty. You are the most beautiful person in the world. Even jewels pale in comparison to your snow-white body.”</p><br/><p>Shalltear did not pause to think about her answer before she gave it. From the lack of delay in her reply, she must have been speaking from the heart.</p><br/><p>“—Cocytus.”</p><br/><p>“One. Who. Is. Mightier. Than. All. The. Guardians. And. Deserving. Of. The. Title. Of. The. Supreme. Overlord. Of. The. Great. Underground. Tomb. Of. Nazarick.”</p><br/><p>“—Aura.”</p><br/><p>“A merciful leader with great foresight.”</p><br/><p>“—Mare.”</p><br/><p>“A, a very gentle person.”</p><br/><p>“—Demiurge.”</p><br/><p>“A wise leader who makes decisions and acts on them quickly. Truly, a man worthy of the title ‘inscrutable.’”</p><br/><p>“—Sebas.”</p><br/><p>“The one responsible for assembling all the Supreme Beings. In addition, the merciful leader who did not abandon us, but stayed by our side until the very end.”</p><br/><p>“And finally, Albedo.”</p><br/><p>“The man who rules over the Supreme Beings, and our highest, most exalted master. In addition, the man I love most deeply.”</p><br/><p>“…I see. I have heard and understand your opinions. Then, I shall hand the tasks that were once performed by my former comrades to you. Carry them out faithfully.”</p><br/><p>After seeing the Guardians genuflect once more, Momonga teleported away.</p><br/><p>The scenery before his eyes changed in an instant, from the Colosseum to the chamber of the Golems of Lemegeton. After looking around to make sure nobody was looking, Momonga sighed deeply.</p><br/><p>“I’m so tired…”</p><br/><p>Although his body did not feel tired, the mental fatigue was weighing down on his shoulders.</p><br/><p>“…Those guys… why do they think so highly of me?”</p><br/><p>They were describing someone else entirely. After hearing the Guardians take turns to share their opinions of him, he wanted to laugh and mock them, but from the looks on their faces, it did not sound like they were joking at all.</p><br/><p>In other words, their words were sincere.</p><br/><p>If he did not act in a manner which fit their views of him, it might disappoint them. As he thought about that, the pressure on him grew and grew. And in addition to that, there was another problem, which made Momonga frown.</p><br/><p>Of course, his skeletal face could not show expressions, yet it seemed as though it did.</p><br/><p>“…What should I do about Albedo… if this keeps up, how will I face Tabula-san…”</p><br/><p>Intermission</p><br/><p>The pressure crushing their heads to the ground suddenly vanished.</p><br/><p>Even after the departure of the master of their revered creators, nobody raised their heads. After a while, someone sighed in relief. The tense atmosphere was gone now.</p><br/><p>The first to get up was Albedo. Her white dress was stained where her knee had touched the ground, but she did not mind at all. She flapped her wings to swipe off the dirt on her feathers.</p><br/><p>After seeing Albedo rise, the others followed suit, though nobody dared to speak.</p><br/><p>“That, that was scary, Nee-chan.”</p><br/><p>“Yeah, I thought I’d be squashed flat.”</p><br/><p>“As expected of Momonga-sama, to think his presence would have such a great effect on us Floor Guardians…”</p><br/><p>“As. A. Supreme. Being. His. Might. Overmatches. Ours. But. I. Did. Not. Expect. Him. To. Be. This. Powerful.”</p><br/><p>Thus the Guardians shared their impressions of Momonga.</p><br/><p>The aura that Momonga emitted was the source of the power that had crushed the Guardians to the ground .</p><br/><p>「Despair Aura」.</p><br/><p>Besides inflicting a fear effect, it could reduce the stats of its victims. Normally, it would not have an effect on the level one hundred NPCs, but on this occasion, its effects had been strengthened by the Staff of Ainz Ooal Gown.</p><br/><p>“Momonga-sama must have unleashed the air of authority that represents his right to rule.”</p><br/><p>“Indeed. Before we stated our positions, Momonga-sama did not exert his might. However, once we showed ourselves in the role of Floor Guardians, he must have revealed a fraction of his awesome power to us.”</p><br/><p>“In. Other. Words. Momonga-sama. Revealed. His. True. Ability. As. A. Ruler. In. Response. To. Our. Pledges. Of. Loyalty.”</p><br/><p>“That does seem like the case.”</p><br/><p>“He didn’t radiate that aura when he was with us. Momonga-sama was kind, and gave us something to drink when we were thirsty.”</p><br/><p>Aura’s words caused the other Guardians to emit an air of tension. It was condensed jealousy that was almost visible to the naked eye. The worst-off was Albedo. Her clenched fists shuddered and her nails threatened to rip through the fabric of her gloves.</p><br/><p>Mare’s shoulders trembled, and then his eyes went wide.</p><br/><p>“That, that must have been the true power of Momonga-sama, the ruler of the Great Tomb of Nazarick. It was amazing!”</p><br/><p>That changed the mood instantly.</p><br/><p>“Exactly! He showed us his ability as an absolute ruler in response to our feelings… as expected of our creator. The zenith of the Forty One Supreme Beings, and the kind master who remained here with us until the very end.”</p><br/><p>Albedo’s words put a blissful look on all the Guardians’ faces, although the expression on Mare’s face was better described as “relaxed.”</p><br/><p>There was nothing which could delight them more than the master who created them, the master to whom they owed their utmost loyalty, revealing his true face to them.</p><br/><p>The Guardians, no, every entity created by the Supreme Beings wanted nothing more than to aid their creators in some way. The next best thing would be to receive their trust and to be treated as useful servants.</p><br/><p>This was a simple, natural truth.</p><br/><p>This was the greatest joy in life for these characters who were created to aid the Supreme Beings. Then, as though to wipe away this jubilant atmosphere, Sebas said from the side:</p><br/><p>“Then, I shall take my leave first. I do not know where Momonga-sama has gone, but I should stay by his side.”</p><br/><p>Jealousy was written all over Albedo’s face, but she quashed her feelings and replied:</p><br/><p>“I understand. Then, Sebas, serve Momonga-sama well and do not disgrace him. Report to me if anything happens. In particular, if Momonga-sama summons me, you must let me know immediately. Everything else is of secondary importance to that!”</p><br/><p>A pained expression crossed Demiurge’s face as he listened quietly from the side.</p><br/><p>“But if he desires me in his bedchamber, you must inform Momonga-sama that I might be a while, in order to bathe and cleanse myself for him. Of course, if he wants me to proceed to him immediately, that is fine as well. After all, I do my best to keep clean for him, and my clothes have already been selected so I can heed his call whenever it comes. In any case, Momonga-sama’s wishes will always come first—”</p><br/><p>“—I understand, Albedo. If I waste too much time here, I will not have enough to properly serve Momonga-sama, which would be disrespectful. Therefore, forgive my abrupt departure, but I must take my leave. Floor Guardians, I bid you all a good day.”</p><br/><p>After saying his farewells to the wide-eyed and open-mouthed Guardians, Sebas immediately jogged away, as though to leave Albedo (who was preparing for a long monologue) behind.</p><br/><p>“Speaking of which… it is fairly quiet around here. Shalltear, is something the matter?”</p><br/><p>After Demiurge’s question, everyone’s eyes went to Shalltear. She was still on her knees.</p><br/><p>“What. Is. Wrong. Shalltear?”</p><br/><p>She lifted her head after she was called on again. The dazed look on her face would make people think that she had just been woken up.</p><br/><p>“…What. Happened?”</p><br/><p>“Ah, after being exposed to Momonga-sama’s awesome presence, I could not help but get excited… I fear my underwear has gone through a bit of a crisis…”</p><br/><p>Silence.</p><br/><p>Everyone looked at each other, unsure of what to say. The Guardians mused that Shalltear had, by far, the most fetishes among them, and that one of said fetishes was necrophilia. They facepalmed as they thought about this, although Mare didn’t quite get it and was thoroughly confused. No, one of the Guardians was not content to simply shake her head and sigh.</p><br/><p>That was Albedo.</p><br/><p>The jealousy surging in her made Albedo come out and say:</p><br/><p>“You slut.”</p><br/><p>Shalltear sensed Albedo’s hostility as she heard those scornful words. Her lips curled in hostility, and she responded with a bewitching smile.</p><br/><p>“What? Having Momonga-sama, the most beautiful of the Supreme Beings, bless us with his energy is a reward! Anyone who doesn’t get wet from that must have something wrong in their head! Or could it be that you don’t just look pure, but you don’t have any fleshly desires at all, you big-mouthed gorilla!?”</p><br/><p>“…You lamprey!”</p><br/><p>The two of them glared at each other. The Guardians did not know if they would fight as a result of this, but the way they were looking at each other was very unsettling.</p><br/><p>“My appearance was created by the Supreme Beings; are you unhappy with it?”</p><br/><p>“Shouldn’t that be my line?”</p><br/><p>Shalltear slowly stood back up, and the two of them approached each other. Even so, their eyes remained locked. Eventually, the two of them came so close that they collided into each other.</p><br/><p>“Don’t think you’ve won just because you’re the Guardian Overseer and can stay next to Momonga-sama. If you really think that way, I’ll laugh my ass off.”</p><br/><p>“Hmph. That’s correct. While you’re stationed in a faraway place, I’ll swoop in and achieve a complete victory.”</p><br/><p>“…What do you mean by ‘a complete victory?’ Teach me, Guardian Overseer-sama.”</p><br/><p>“As a slut, you should be fully aware of what that means.”</p><br/><p>Throughout their trade of verbal barbs, neither of them had turned their gaze from each other. They simply looked into each other’s eyes with a blank expression on their faces.</p><br/><p>With a pacha, Albedo unfurled her wings in a threat display. Black mist wreathed Shalltear as she responded in kind, unwilling to admit weakness.</p><br/><p>“Ah — Aura, matters between women should be settled by a fellow woman. If anything happens I’ll come to help, let me know when the time comes, all right?”</p><br/><p>“Hey, wait, Demiurge! Are you planning to dump all of this on me?”</p><br/><p>Demiurge simply waved lazily as he walked away from the feuding pair. Cocytus and Mare took a step back as well. Nobody wanted to get caught between them.</p><br/><p>“Really, do they have to argue over this sort of thing?”</p><br/><p>“Personally, I would be quite interested in the result.”</p><br/><p>“What do you mean by ‘the result,’ Demiurge?”</p><br/><p>“I refer to the increase in our fighting power, the future of Nazarick, and so on.”</p><br/><p>“D-Demiurge, what do you mean?”</p><br/><p>“Hmm…”</p><br/><p>Demiurge pondered how he should answer Mare’s question. For a moment, an evil impulse swept through Demiurge’s head and he thought of infusing the simple Mare with adult knowledge, but he promptly discarded that line of thinking.</p><br/><p>Demiurge was a devil, and he was cruel and ruthless, but that only applied to people outside Nazarick. To Demiurge, the characters made by the Forty One Supreme Beings were his comrades.</p><br/><p>“Any great leader requires a successor, no? Momonga-sama may have stayed with us until the end, but if he loses interest in us one day, he may leave for another place like the rest of the Supreme Beings. Thus, there is a need for a successor to whom we can pledge our loyalty.”</p><br/><p>“I see. Then, which of us will be Momonga-sama’s successor?”</p><br/><p>“How. Disrespectful. As. Guardians. We. Are. To. Serve. Momonga-sama. Faithfully. So. He. May. Stay. That. Is. What. We. Were. Made. For.”</p><br/><p>Demiurge turned to the interrupting Cocytus.</p><br/><p>“Of course I understand that, Cocytus. But do you not wish to pledge your loyalty to Momonga-sama’s heir?”</p><br/><p>“Hmm… Of. Course. I. Would. Like. To. Swear. My. Allegiance. To. Momonga-sama’s. Heir…”</p><br/><p>Cocytus began imagining himself running around with said heir on his shoulders.</p><br/><p>Then he began to imagine himself teaching him swordsmanship, drawing his blade to defend the Young Master, and even hearing the full-grown Young Master giving him orders.</p><br/><p>“…Oh. How. Wonderful. What. A Glorious. Sight… Uncle… Uncle…”</p><br/><p>Somewhat unable to bear it, Demiurge averted his eyes from Cocytus, who was fully into imagining himself as a cool old uncle, faithfully serving Momonga’s heir.</p><br/><p>“Well, that aside, I’m quite interested in knowing what our children can do for the strengthening of the Great Underground Tomb of Nazarick. How about it, Mare, do you want to make a child?”</p><br/><p>“Er, eh?”</p><br/><p>“Still, you don’t have a partner… if you discover any Humans, Dark Elves, Wood Elves, or similar species, would you kindly capture them for me?”</p><br/><p>“Eh? Ehhhhh?”</p><br/><p>After thinking for a bit, Mare nodded and said, “If, if it helps Momonga-sama… I’m willing to contribute. But how will I have children?”</p><br/><p>“Well, I’ll teach you about that when the time comes. But if you decide to try some breeding experiments on your own, Momonga-sama might scold you. After all, the operations of Nazarick are perfectly balanced.”</p><br/><p>“That, that’s true. I’ve heard that all the underlings were created after careful calculation by one of the Supreme Beings… if we carelessly increase our numbers, we’ll be scolded. I, I don’t want to be scolded by Momonga-sama…”</p><br/><p>“Of course, I don’t want to be rebuked by the Supreme Beings either… if only I could set up a farm outside Nazarick…”</p><br/><p>As Demiurge thought of this, he decided to mention the one thing nobody had teased him about:</p><br/><p>“Ah yes, Mare, why are you dressed as a girl?”</p><br/><p>Mare grabbed at his miniskirt to hide his legs after Demiurge asked his question.</p><br/><p>“This was Bukubukuchagama-sama’s decision. She said this was called a ‘trap,’ so it should have nothing to do with my gender.”</p><br/><p>“Oh, so this was Bukubukuchagama-sama’s decision. Well then, those clothes should be fine on you… although, should all boys dress in that way?”</p><br/><p>“I, I don’t know about that.”</p><br/><p>The Forty One Supreme Beings were no longer around, but even so, the mention of their names still compelled obedience. Or rather, in the Great Underground Tomb of Nazarick, Mare was dressed as he should be, and nobody apart from another Supreme Being could change his wardrobe.</p><br/><p>“…I wonder if I should talk to Momonga-sama about this. Perhaps all boys should be dressed like that. I say… Cocytus, it’s time to wake up.”</p><br/><p>After hearing his colleague’s words, Cocytus shook his head several times, a deeply satisfied smile on his face.</p><br/><p>“Ah. What. A. Beautiful. Sight… Truly. it. Was. Everything. I. Have. Ever. Dreamed. Of.”</p><br/><p>“Is that so… well then, that’s good…. Are Albedo and Shalltear still fighting?”</p><br/><p>The feuding pair’s eyes were slightly averted. However, the one that answered Demiurge was the tired-looking Aura, standing by the side.</p><br/><p>“They’re… done. Right now, they’re arguing about…”</p><br/><p>“The problem of who should be the first wife.”</p><br/><p>“It would be strange for the ruler of the Great Tomb of Nazarick to only have one wife. The question now is who is worthy of being Momonga-sama’s first wife…”</p><br/><p>“…While that is quite an interesting question, we should probably discuss that later. All right, Albedo, won’t you give us our orders? There will be many things to do later on.”</p><br/><p>“Indeed, you’re right. I need to issue orders soon. Shalltear, I’ll discuss this matter with you at length soon enough. We’ll need to spend some time on it.”</p><br/><p>“I have no objections, Albedo. No other matter is more worthy of our time.”</p><br/><p>“Very well. Then, let us move on to our plans for the future.”</p><br/><p>After seeing Albedo recover her dignity as the Guardian Overseer, all the Floor Guardians lowered their heads in respect. However, they did not genuflect.</p><br/><p>Of course, they had to show their respect to the Guardian Overseer Albedo, but she was not their master. While the Forty One Supreme Beings had set her over all the other characters that they had created, but even the position of Guardian Overseer was merely one set down by the Forty One Supreme Beings, and as such the other Guardians needed only to pay her the respect due to her station. Thus, they lowered their heads to her. On her part, Albedo was not angry at this, because she knew that was the most correct course of action.</p><br/><p>“Firstly—”</p><br/>\n</div>"}