{"title": "Chapter 23 - Volume 4", "id": 23, "volume": 4, "url": "http://boxnovel.org/overlord-ln-chapter-23-volume-4", "volume_title": "Volume 4", "body": "<h1>Chapter 23 - Volume 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Overlord Volume 4 Prologue</h3><br/><p><b>Prologue</b></p><br/><p><span>“Welcome back, Ainz-sama.”</span></p><br/><p><span>It had been two weeks since he had last returned to his room, but the words which followed next sent a shiver through his bones.</span></p><br/><p><span>“Would you like dinner? A bath? Or — would — you — like — me❤?”</span></p><br/><p><span>For a moment, Ainz imagined that he saw several pink hearts wafting out from behind Albedo.</span></p><br/><p><span>“…What’s the meaning of this?”</span></p><br/><p><span>“I’m playing newlyweds, Ainz-sama. I’ve heard people say that this is the best way for a newly-wedded wife to greet her husband after he returns from a business trip with his pet. Do you like it?”</span></p><br/><p><span>So this was why she had not met him directly at the surface when he returned. He was a man without a girlfriend, much less a wife, but just as he was about to coldly retort, “Who cares?” he swallowed those words. He had his pride as a male to consider, and he wanted to protect his image. </span></p><br/><p><span>Besides, what sort of answer was she expecting when she asked, “Do you like it?”</span></p><br/><p><span>Despite his lack of confidence, he put on an attitude which seemed to say, </span><i><span>All is within the palm of my hand</span></i><span>, and replied in a way which should probably not cause too many problems.</span></p><br/><p><span>“That was quite a charming welcome, Albedo.”</span></p><br/><p><span>Albedo smiled and replied, “That is good to hear, kufufufu~”</span></p><br/><p><span>As Ainz saw her smile seductively, he lowered his stance and prepared himself for battle.</span></p><br/><p><span>He sensed something like a venomous snake slithering up his spine.</span></p><br/><p><span>There was a bestial lust hidden in Albedo’s eyes — most likely the source of that slithering sensation. Those eyes were deadly serious. If he had replied, “I’ll have you, of course,” even in jest, there was no doubt that the superpredator before him would latch onto that and savagely pounce him. The words “reverse rape” even came to mind.</span></p><br/><p><span>While he had little in the way of a sex drive, the remnants of his human personality seemed to be responding to Albedo’s mood, telling him to see what would happen next. His still-undiminished curiosity only added to that feeling.</span></p><br/><p><i><span>Stop that, you moron.</span></i></p><br/><p><span>It was not exactly self-control, but Ainz used something similar — something which would have been impossible had he not been undead — to force himself to ignore the subtext of Albedo’s words.</span></p><br/><p><span>Still, something like disgust welled up from somewhere within Ainz’s heart. Before he had been transported to this New World, he had altered Albedo’s backstory, writing that “she loved him” in jest. He had been using her and that twisted personality of hers, without going the next step with her.</span></p><br/><p><i><span>But it’s gone… What can I do about that? It’s not as though a relationship between a man and a woman can progress through a meeting of minds… Is that why I’m afraid of taking the next step?</span></i></p><br/><p><span>Ainz — a virgin who had never dated a girl before — pondered that problem.</span></p><br/><p><span>At the same time, another thought came to mind. The NPCs made by his former friends could be considered to be their children. How could he stain those precious offspring and let them carry on with warped minds?</span></p><br/><p><i><span>Idiot, now’s not the time to be thinking about that sort of thing.</span></i></p><br/><p><span>“Ah!”</span></p><br/><p><span>Albedo’s sudden yelp caused the fiery points in Ainz’s eyes to flare.</span></p><br/><p><span>“What, what is it, Albedo? Did something happen?”</span></p><br/><p><span>“How embarrassing. I, I heard that a newlywed wife ought to welcome her husband home while dressed in her final decisive battle attire (a naked apron)…”</span></p><br/><p><span>With that, Albedo looked down at her dress and her face turned pink. Then she replied:</span></p><br/><p><span>“If you wish, I shall immediately…”</span></p><br/><p><span>Her voice was quiet, but he could hear it very clearly. She sneaked peeks at Ainz as she continued, “…Change in front of you, Ainz-sama…”</span></p><br/><p><span>“Ah… yes… ahem! Really… haaa. Listen, Albedo, that’s enough clowning around for now. It’s time for the intelligence briefing.”</span></p><br/><p><span>“Yes, I understand.”</span></p><br/><p><span>With some reluctance — though he was not sure where exactly said reluctance stemmed from — Ainz forced himself to ignore Albedo’s temptation and sat himself down on his chair. Then, he tossed three pouches onto the table. He then dictated instructions to Albedo, who had changed modes from an eager newlywed to an efficient secretary.</span></p><br/><p><span>“This is the money I earned in E-Rantel. Use it for experiments.”</span></p><br/><p><span>The three pouches looked different from each other. The largest of them appeared to be on the verge of bursting, and it was filled with the silver and copper pieces Ainz had earned during his time as an adventurer.</span></p><br/><p><span>“Understood. I shall see if these funds can be used to summon monsters or activate Nazarick’s defense systems.”</span></p><br/><p><span>“Please take care of that. Also, see if we can use them to make items, such as scrolls and so on.”</span></p><br/><p><span>Ainz’s eyes turned away from Albedo, whose head was deeply lowered. Then he looked back towards the pouches with a prayerful expression in his eyes.</span></p><br/><p><span>The gold pieces which one obtained in YGGDRASIL could be used to buy magic items, but they could also be used for guild base maintenance fees. For instance, they could be used to summon monsters of above level thirty — which did not naturally respawn, or “pop” — as catalysts for the use of certain spells, in the creation of magic items, resurrecting dead NPCs, and so on.</span></p><br/><p><span>He had already verified that YGGDRASIL coins could be used in this world. However, he had not made sure that the currency of this world could also be used within Nazarick. He was particularly curious about whether silver and copper coins could be utilized, since YGGDRASIL only had gold coins. </span></p><br/><p><span>It would not be an exaggeration to say that the results of that experiment might determine the future of Nazarick. If the money in this world could be used in the same way as YGGDRASIL gold coins, it might greatly affect their future plans. After all, it would dramatically change the importance of earning money.</span></p><br/><p><span>In fact, under certain circumstances, a situation might arise where the earning of large quantities of currency became essential. In contrast, if currency from this world could not be used, then the wealth within the Treasury would become an irreplaceable resource, and unnecessary expenses would have to be minimized.</span></p><br/><p><span>“Also, about Clementine—”</span></p><br/><p><span>As Ainz spoke the name of the missing corpse, his nonexistent brows wrinkled.</span></p><br/><p><span>His error in judgement had resulted in the disappearance of that girl, who knew quite a few things about him. There was no telling if she had been resurrected or if she had told what she knew to others. Unease welled up in Ainz’s heart.</span></p><br/><p><span>There were many potential enemies to be wary of, but he had learned nothing about them, and he had even revealed information about himself by accident.</span></p><br/><p><i><span>If this news reached the ears of any of my friends who ended up in this world… but I shouldn’t count on that sort of luck. I need to be more careful from now on. In any case, the most important thing now is to decide what I should do about the Momon identity.</span></i></p><br/><p><span>If anyone came after him, they would be coming after Momon. However, Momon was a stepping stone for him at the moment, and it would be a shame to discard him. The time had not yet come to reveal that Ainz was Momon.</span></p><br/><p><i><span>I’ll have to see how things go…</span></i></p><br/><p><span>No matter how hard he thought, his contemplations only led him to a dead end with no answers. Therefore, he decided to put his problems aside for now and think no more on it.</span></p><br/><p><span>“I might as well order Pandora’s Actor to put one of that woman’s blades into the Treasury’s shredder and see what happens.”</span></p><br/><p><span>“The shredder?”</span></p><br/><p><span>It was only when he heard Albedo’s surprised voice that Ainz recalled the proper name of that item.</span></p><br/><p><span>“That would be the Exchange Box. Someone with merchant-type skills can get better prices when using it. Order Pandora’s Actor to take Nearata-san’s form and use his skill.”</span></p><br/><p><span>After seeing that Albedo had nodded in acknowledgement, Ainz unfurled the scroll he was holding onto his desk.</span></p><br/><p><span>“Also, it took some effort to obtain it, but this is a map of the world which I acquired in E-Rantel.” </span></p><br/><p><span>“This is… I see.”</span></p><br/><p><span>Ainz understood why Albedo’s brows had furrowed ever so slightly, because the details of the map before them were terribly vague.</span></p><br/><p><span>“I understand why you’re unhappy. After all, this map only covers a small portion of the surrounding world. The scale was haphazardly written and many landmarks are not recorded either. In addition, this map focuses on the human countries, and there is only one demihuman nation recorded. It is a crude map, no doubt… but it is unlikely that we’ll find anything better.”</span></p><br/><p><span>For instance, he had heard about the Centaur tribes on the plains, the Scorpion-Men (Pabilsag) settlements in the desert, the country of the Dwarves in the mountains, and so on. But he had learned of all these by speaking to the guildmaster of E-Rantel’s Magician’s Guild, and they were not recorded on the map. In other words, this was a map for human convenience.</span></p><br/><p><span>A vague map like this was hardly reliable, but he would have to expend a lot of money and time to obtain a better one.</span></p><br/><p><span>That was what the Magician’s Guildmaster, Theo Rakesheer, had told him. The man was very favorably disposed towards Ainz, so that information was most likely accurate.</span></p><br/><p><span>Besides, he sensed from the other man’s reply that even a map like this was quite a harsh demand.</span></p><br/><p><span>“I see. Then, I shall have the map duplicated and distributed to each Guardian.”</span></p><br/><p><span>“Please do so. Then, before that, I shall briefly explain the contents of the map.”</span></p><br/><p><span>Ainz pointed to the center of the map. It was the region which had been most accurately detailed. </span></p><br/><p><span>“This is E-Rantel, and this region contains the Great Underground Tomb of Nazarick.”</span></p><br/><p><span>His finger moved northeast, to the vicinity of a huge forest. He was quite confident in his knowledge of the area surrounding Nazarick.</span></p><br/><p><span>“This is the Azellisian Mountain Range, which marks the border between the Re-Estize Kingdom and the Baharuth Empire. The large forest around the southern tip of the mountain range is the Great Forest of Tob, and there is a large lake here.“</span></p><br/><p><span>The lake in question was shaped like an inverted gourd, and it was located between the southern foothills of the mountains and the Great Forest. Ainz’s finger stopped at the southern tip of the lake.</span></p><br/><p><span>“There is a Lizardman village here, in these large wetlands.”</span></p><br/><p><span>After seeing Albedo nod in understanding, Ainz continued:</span></p><br/><p><span>“Now I will tell you what the Magician’s Guildmaster told me about the surrounding countries. To the northwest of the Kingdom is a region bounded by mountains. This region is the Agrand Council Alliance, which is inhabited by many demihumans. What we need to be most wary of are their councillors, which are said to be Dragons. Apparently there are five of them, but some say that there are seven. To the southwest of the Kingdom lies the nation known as the Holy Kingdom. Apparently, it is surrounded on all sides by a high wall, indicated roughly on the map, and it is known as the Great Wall. This country is on guard against the many demihuman tribes which battle frequently in the wilderness surrounding them, though it is not indicated on the map.”</span></p><br/><p><span>“Is that not where Demiurge has gone?”</span></p><br/><p><span>“That’s right. On the other end of the wilderness is the Slaine Theocracy, entities which we must be mindful of.”</span></p><br/><p><span>“Is this a national border?”</span></p><br/><p><span>Albedo traced a line around the surrounding region with a lily-white finger.</span></p><br/><p><span>“Probably. Frankly speaking, there’s no use trying to study borders from this map on account of how vague it is. Then, let’s take a look on the Empire’s side. There are many city-states located to the northeast of the Empire, who have formed up into a City-State Alliance. There seems to be a city of demihumans there as well. To the southeast of the Empire is a region with many gigantic standing quartz pillars, as well as many caves. Apparently, there are humanoid tribes there who raise Wyverns.”</span></p><br/><p><span>When Ainz had heard the description of the place, it reminded him of Wulingyuan in Zhangjiajie City, but the details were not clear.</span></p><br/><p><span>“Are they Wyvern Riders, then?”</span></p><br/><p><span>In YGGDRASIL, players with over thirty five levels in equestrian-type classes could summon the magical beasts known as Wyverns to serve as mounts, However, there was no proof that the same held true in this world as well.</span></p><br/><p><span>“…Possibly. Going by that logic, the opposition should be quite strong, but even so, they aren’t exactly fearsome opponents for the Great Underground Tomb of Nazarick… However, the portion of the map below them — the eastern shore of this great lake — hasn’t been filled in yet.”</span></p><br/><p><span>Ainz indicated one of the outer edges of the map below them.</span></p><br/><p><span>“And they say there’s a Draconic Kingdom here.”</span></p><br/><p><span>“Dragons?”</span></p><br/><p><span>“Yes. A powerful Dragon founded that nation in the past, and apparently its royalty has inherited that Dragon’s bloodline… but whether those rumors are reliable remains to be seen. In any event, that’s enough about the map for now.”</span></p><br/><p><span>In the world where Ainz had lived as Suzuki Satoru, it would have been a far-fetched rumor, but in this world, that rumor might well be true.</span></p><br/><p><span>“Then, Ainz-sama, we should be wary of the Slaine Theocracy and the Council Alliance, am I correct?”</span></p><br/><p><span>Ainz folded his arms across his chest and went, “Hmm…” While she did have a point when it came to nations, she might have come to that conclusion because they did not know enough in that field. As she saw Ainz’s reaction, Albedo slowly bowed in apology.</span></p><br/><p><span>“Forgive me. Given our present circumstances, we should be on guard against all other countries, am I correct?”</span></p><br/><p><span>“…Indeed, that is so. Even if they aren’t much as nations, they might harbor surprising individuals among them.”</span></p><br/><p><span>For instance, the person who used that World Class Item on Shalltear.</span></p><br/><p><span>Albedo could sense that underlying meaning in Ainz’s words without him having to explicitly state it.</span></p><br/><p><span>Ainz’s finger continued tracing the eastern and southern edges of the map.</span></p><br/><p><span>“However, there’s a city that floats on the waves in the east, while there’s the city founded by the Eight Greed Kings to the south. Those two are probably the ones we need to be the most mindful of. The city of the Eight Greed Kings in particular… they say it’s a flying city in the middle of the desert.”</span></p><br/><p><span>“A flying city?’</span></p><br/><p><span>“According to the news I’ve heard, it would be more accurate to describe it as a city built underneath a flying fortress. They say water flows endlessly from the fortress to the city, and that the city itself is completely surrounded by a magical barrier and doesn’t look like it belongs in the desert at all.”</span></p><br/><p><span>Albedo’s eyes turned cold, and she quietly replied:</span></p><br/><p><span>“Shall we have the vassals conduct a reconnaissance in force?”</span></p><br/><p><span>“There’s no need to go around stepping on the tiger’s tail. Even if the World-Class Item’s user came from there, we should try to get along cordially with them until we’re sure of their fighting power… Speaking of which, how is Shalltear doing?”</span></p><br/><p><span>“Her body seems fine after her resurrection, but…”</span></p><br/><p><span>“Come on, spit it out. Even I feel uneasy about her too.”</span></p><br/><p><span>“Ah! My deepest apologies. In truth, Shalltear’s mental state is somewhat unsettling.”</span></p><br/><p><span>“…Aftereffects from her mind control? Could it be that even death cannot fully erase the effects of a World Class item?”</span></p><br/><p><span>“No, it’s not like that… It’s more like she still feels intense guilt for raising her hand against you and she cannot forgive herself for doing so, Ainz-sama.”</span></p><br/><p><span>For a moment, Ainz did not quite understand, but it became clear almost instantly.</span></p><br/><p><span>It had been Ainz’s fault, not Shalltear’s. He had told her that many times already.</span></p><br/><p><span>“Please forgive my rudeness for interfering with your deliberations by interrupting, Ainz-sama.”</span></p><br/><p><span>Ainz nodded to Albedo, who had a severe expression on her face.</span></p><br/><p><span>“I feel that it would be best if she were punished.”</span></p><br/><p><span>The crimson glow in Ainz’s eyes socket dimmed slightly. He made to speak, but closed his mouth without making a sound. That was because the woman before him seemed to have something else to say.</span></p><br/><p><span>“…Rewards and punishment must be handed out as they are due. If you assign punishment to Shalltear, it will eliminate the guilt in her heart. In contrast, she is currently stewing in guilt because she has not been punished for her actions.”</span></p><br/><p><span>Ainz felt that she made a lot of sense. Indeed, it was because of punishments that rewards could exist. However, the matter of how severe a reprimand he should give her and how much he could forgive was beyond a mere salaryman like Ainz. Under normal circumstances, he would wave the matter aside and forgive Shalltear easily.</span></p><br/><p><span>On the other hand, while he might feel bad about punishing Shalltear, it might end up being good practice for next time.</span></p><br/><p><span>“…I understand. I shall give Shalltear some punishment, then.”</span></p><br/><p><span>“I feel it would be better that way. Please forgive any offense I have given.”</span></p><br/><p><span>“What are you saying? I look forward to such suggestions. I have always hoped that someone would be able to step in with an opinion when I was unsure about what to do. Albedo, what you have done is very fitting of your position as the Overseer of the Great Underground Tomb of Nazarick.”</span></p><br/><p><span>“Thank you very much!”</span></p><br/><p><span>The stunning beauty bowed before him, her cheeks flushed and her eyes moist. Feeling a little uneasy about Albedo’s very open reaction, Ainz coolly waved it aside and replied:</span></p><br/><p><span>“Now then, there are some things I need to handle. I will leave this place to you.”</span></p><br/><p><span>“Understood! Please leave it to me! I will take care of matters while you are not around, Ainz-sama!”</span></p><br/><p><span>He seemed to have heard something along the lines of, ”in the capacity of your wife,” somewhere in the middle of those words, but he decided to pretend he had heard nothing, because she still had more to say.</span></p><br/><p>“Still, please be careful, Ainz-sama. The person who controlled Shalltear with that World-Class Item might not just be targeting us.”</p><br/><p><span>“Hmph!”</span></p><br/><p><span>That was the first time Ainz had snorted in displeasure ever since he had returned to this room.</span></p><br/><p><span>“If the enemy attacks… they might not be easy to deal with. But relax, Albedo. Since I have no idea what sort of enemy we’re up against, I intend to prioritize retreat when we encounter him, and I also have several meatshields prepared for such a circumstance.”</span></p><br/><p><span>Ainz slowly raised his head to look at the ceiling, and began visualizing the foes against which he would need to prepare.</span></p><br/><p><span>There was the mysterious holder of that World-Class Item who was probably their enemy, and other players, whose very existence was still unclear. In addition, there were the traces of players who should have existed in the past. Of course, it might be too rash to take them all as enemies, but doing so would ensure that he did not overlook them by accident. He had to assume the worst-case scenario when doing his planning.</span></p><br/><p><span>“Before we learn more details about the enemy, it would be wise to act as low-key as possible. However, we might need to scatter some bait to tempt the foe… how is the progress of plans on that front?”</span></p><br/><p><span>Albedo lowered her eyes, and from that reaction alone Ainz could guess what the results were.</span></p><br/><p><span>“Cocytus has not made any reports yet, but Entoma indicates that the plan has not yet exceeded our scope of predictions. They should have set up camp near the objective and they are preparing to make contact.”</span></p><br/><p><span>“Is that so… Well, it wasn’t what I hoped for, but the important thing is what we can gain from this.”</span></p><br/><p><span>“Your saying so fills me with relief.”</span></p><br/><p><span>“All right. Originally, I had planned to observe the developments from here, but unfortunately, I have several tasks to complete in my role as an adventurer, and thus I must move out in person. Still, I would like to see how the battle goes. Help me record the battle between the Lizardmen and the forces of the Great Underground Tomb of Nazarick.”</span></p><br/>\n</div>"}