{"title": "Chapter 26 - Volume 4", "id": 26, "volume": 4, "url": "http://boxnovel.org/overlord-ln-chapter-26-volume-4", "volume_title": "Volume 4", "body": "<h1>Chapter 26 - Volume 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Overlord Volume 4 Intermission</h3><br/><p><strong>Intermission</strong></p><br/><p><span>They were probably discussing something else in the meeting room behind him.</span></p><br/><p><span>However, his duties in that room were over. That was why he had left.</span></p><br/><p><span>That said, he still had work to do. Back then, he was merely giving a report, but now he had to fulfill his responsibilities as the First Seat of the Black Scripture — in other words, as its leader. This included resurrecting his dead comrades, picking temporary replacements for their positions, as well as training, conducting experiments, and so on. </span></p><br/><p><span>After all, the Six Scriptures were a secret organization, so they led double lives, going undercover within the Theocracy.</span></p><br/><p><span>Speaking of his personal life, he had to get married — and to multiple partners. Currently, there were only three awakened God-kin within the Slaine Theocracy, and so the higher-ups had hinted that he had to do his patriotic duty and reproduce. </span></p><br/><p><span>All these demands on him piled up, and left him with hardly any free time.</span></p><br/><p><span>“Still, I was hoping I could relax for today.”</span></p><br/><p><span>After being liberated from the meeting of the Cardinals — a gathering of the highest appointment holders in the Slaine Theocracy — he worked his shoulders, and then his attention was drawn by a </span><i><span>clack-clack-clack</span></i><span> sound.</span></p><br/><p><span>He knew who had made that sound before he saw it. There were very few in the Slaine Theocracy who were permitted to enter this place, and when he thought about the people who were not present within the meeting room, the answer leapt out at him.</span></p><br/><p><span>As he had expected, there was a girl leaning against a wall.</span></p><br/><p><span>She had a unique hairstyle, with the left side being a different color from the right. One was a scintillating silver, while the other was an all-consuming black. The color of her eyes was similarly mismatched. </span></p><br/><p><span>Beside her was a war scythe that resembled a cross-shaped spear, leaning against the wall.</span></p><br/><p><span>Although she looked youthful, barely fifteen, her age did not correspond to her appearance at all. Ever since he had become the captain of the Black Scripture — its First Seat — the girl’s looks had not changed at all.</span></p><br/><p><span>He turned his eyes to the ears under her hair — and then checked himself.</span></p><br/><p><span>This was because he knew that the girl hated people looking at her ears.</span></p><br/><p><span>The girl’s seductive lips formed into a curve, as though she were reading his mind.</span></p><br/><p><span>She was a cross-blooded child born of nigh-impossible odds, the Black Scripture’s Extra Seat, known as “Certain Death.” She was a guardian, responsible for defending the </span><i><span>sanctum sanctorum</span></i><span> of the Slaine Theocracy, the place where the relics of five gods were kept.</span></p><br/><p><span>The sound he had heard came from the toy in her hands. In the Slaine Theocracy, it was called a “Rubik’s Cube,” and it had apparently been handed down from the Six Great Gods. The girl’s voice blended with the </span><i><span>clack-clack-clack</span></i><span> of its motions.</span></p><br/><p><span>“One face is simple enough, but getting two faces right is hard.”</span></p><br/><p><span>It was not difficult for him, but he had no idea if he should tell her that. In the end, he chose to smile bitterly by way of response. The girl did not seem to care about his answer and nonchalantly continued:</span></p><br/><p><span>“What happened? Even the Cardinals showed up.”</span></p><br/><p><span>“You were given a copy of the report, right?”</span></p><br/><p><span>“Didn’t read it,” the girl replied without any hesitation. “Besides, asking someone who knows is faster. Did Thousand Mile Astrologer make a mistake? You were sent out to deal with the Catastrophe Dragon Lord… did something happen?”</span></p><br/><p><span>Throughout all of this, the two of them had never met the other’s gaze. The girl’s attention was focused on the toy in her hand.</span></p><br/><p><span>“…We engaged a mysterious undead creature that resembled a Vampire. There were two dead and one severely wounded, so we fell back.”</span></p><br/><p><span>“Who died?”</span></p><br/><p><span>There was no trace of sorrow for her fallen comrades in her voice. She seemed to be asking about something completely unrelated to her. Still, he did not mind. It was simply her way.</span></p><br/><p><span>“Cedran, who was protecting Kaire-sama, and Beaumarchais, who tried to capture the unmoving Vampire.”</span></p><br/><p><span>“Great Wall and Divine Chains, huh. The Miko Princess of Earth died in a strange explosion recently, and now the Black Scripture has lost two of its finest… when it rains, it pours, I guess. Who was wounded?”</span></p><br/><p><span>“Kaire-sama. There seemed to be some sort of curse in effect preventing curative spells from healing her, so we fell back.”</span></p><br/><p><span>“And what of the Vampire?”</span></p><br/><p><span>“We left it there. The Vampire entered an attack posture every time we tried to capture it or come close. We decided that it would be wiser to leave it alone.”</span></p><br/><p><span>“But that doesn’t solve anything, does it?”</span></p><br/><p><span>“…They decided to leave things as they were during the meeting just now,.”</span></p><br/><p><span>That was the decision they had reached in the meeting room earlier.</span></p><br/><p><span>It was judged better to leave it alone and gather their forces than to charge in rashly and take severe casualties. Besides, no other country ought to be able to defeat that undead creature. In fact, if someone like that did show up, that would make them a powerful being that bore watching, which meant that they ought to shore up their national defenses first. In the end, everyone had agreed on that course of action. They had decided to leave behind only those essential intelligence personnel and have everyone else retreat.</span></p><br/><p><span>He agreed with their judgement.</span></p><br/><p><span>After all, the only people who could defeat that Vampire were probably God-kin or Dragon Lords. Therefore, they would leave sentries in place and if they found anyone who could defeat that Vampire, they would be on their guard against them.</span></p><br/><p><span>“Really now. So that monster wasn’t a Vampire, then?”</span></p><br/><p><span>He concurred. That was why he had called it a mysterious undead being</span></p><br/><p><span>“Could it be a Dragon Lord? The Vampire Dragon Lord or the Elder Coffin Dragon Lord?”</span></p><br/><p><span>The curve of her lips widened, a clear smile. That is, if the look on her face, like a splash of blood, counted as a smile.</span></p><br/><p><span>“…Aren’t those two Dragons already dead?”</span></p><br/><p><span>He felt a little awkward as he asked that, but she immediately replied:</span></p><br/><p><span>“They’re both undead Dragon Lords, so we don’t know if they were really destroyed.”</span></p><br/><p><span>The girl finally raised her head to look straight at him. Her mismatched eyes seemed to sparkle with what seemed like curiosity, delight, and battle-lust.</span></p><br/><p><span>“Who do you think is stronger, between myself and that Vampire?”</span></p><br/><p><span>He had expected that question, and met it with a prepared answer.</span></p><br/><p><span>“You, of course.”</span></p><br/><p><span>“Really…”</span></p><br/><p><span>The girl looked back at her toy, as though she had lost interest in the topic.</span></p><br/><p><span>Within his heart, he breathed a sigh of relief.</span></p><br/><p><span>“What a shame. I was thinking I might be able to taste defeat.”</span></p><br/><p><span>As he heard her mutter to herself, he wondered, </span><i><span>Who would win, if they fought</span></i><span>?</span></p><br/><p><span>He had exchanged blows with both the girl and the Vampire, and he felt that the Vampire was superior. However, that Vampire would not be able to defeat “Certain Death.”</span></p><br/><p><span>That was because of the difference in their panoplies.</span></p><br/><p><span>The Vampire looked to be completely unequipped, which was a weakness in powerful monsters. They placed great pride in their strength, which meant that they did not make use of potent magic items.</span></p><br/><p><span>In contrast, she was kitted out in the relics of the Six Gods, so he could conclude that she was more powerful.</span></p><br/><p><span>However, what if both sides were outfitted in items of similar power?</span></p><br/><p><i><span>Impossible.</span></i></p><br/><p><span>He immediately rejected the question which arose in his mind. After all, it was impossible to find gear which rivalled her panoply, which had been handed down from the gods.</span></p><br/><p><span>But what if it was possible?</span></p><br/><p><span>If that happened… the mightiest, never-defeated Extra Seat of the Slaine Theocracy might be vanquished. In other words, that moment would be the end of all hope, when the defenders of mankind were finally laid low.</span></p><br/><p><span>No, why was he assuming that she would be fighting by herself?</span></p><br/><p><span>While he could not compare to her, he was still an awakened God-kin who also possessed many magic items. That Vampire might be powerful, but it was alone, and if he could make use of his panoply, they should be able to deal with it. </span></p><br/><p><span>There was no way there could be more than one such powerful undead being.</span></p><br/><p><span>As he sank into thought, he heard the sound of giggling. Then, he frowned and looked towards its source.</span></p><br/><p><span>“Let’s talk about something else. When are you getting married?”</span></p><br/><p><span>That was one of the topics that had come up during the meeting just now. In short, it was asking when he would find a suitable girlfriend. To put it nicely, they were talking about a marriage partner, but more crudely, she would be a baby-making machine.</span></p><br/><p><span>“I haven’t found anyone yet.”</span></p><br/><p><span>“Hmm, because you’re still young, huh?”</span></p><br/><p><span>When the Black Scripture moved out, their members wore magic masks to hide their identities.</span></p><br/><p><span>According to the laws laid down by the gods, the age of majority in the Slaine Theocracy was twenty, but after removing his mask, his true age was much lower than that figure.</span></p><br/><p><span>“Granted, after you’re married, your partner will be sequestered in a secret location within the Theocracy… but she’ll still be able to raise your child.”</span></p><br/><p><span>“I know that. I </span><i><span>am</span></i><span> a member of the Scriptures, you know.”</span></p><br/><p><span>“Oh yeah. Ah, still, you should probably tell your wife-to-be that you’re going to take other wives. The law says it’s fine, but they’ve all been brought up to dislike having multiple spouses.”</span></p><br/><p><span>The Slaine Theocracy permitted the practice of polygamy as long as the nation sanctioned it. This was a practice which had been grandfathered from a time when bloodlines had to be kept pure due to a lack of powerful entities. However, under normal circumstances, the standard practice was one man to one woman, and there were only a few cases where national sanction had been granted. Even when it was granted, one man could only have two wives.</span></p><br/><p><span>“Thank you for your kind reminder, but as for you… don’t you want to get married?”</span></p><br/><p><span>He asked that question because she might have looked young, but her appearance did not match her actual age.</span></p><br/><p><span>“Hmm, well, I could marry a man who could defeat me. I don’t mind if he looks ugly or has a bad personality… or even if he wasn’t human at all. After all, he’s the man who beat me. How strong would our children be?”</span></p><br/><p><span>The girl was all smiles as she placed her hand on her lower belly. He was quite confident that answer meant that she would never marry.</span></p><br/><p><span>However, would things change if someone appeared who could defeat that Vampire?</span></p><br/><p><span>A wave of unease swept through his heart.</span></p><br/>\n</div>"}