{"title": "Chapter 39 - Volume 6", "id": 39, "volume": 6, "url": "http://boxnovel.org/overlord-ln-chapter-39-volume-6", "volume_title": "Volume 6", "body": "<h1>Chapter 39 - Volume 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Overlord Volume 6 Chapter 6</h3><br/><p><b>Chapter 6: Prelude to the Royal Capital’s Disturbance</b></p><br/><p><b></b></p><br/><p></p><br/><p><b>Part 1</b></p><br/><p><b>Lower Fire Month (9th Month) 3rd Day 17:44</b></p><br/><p>The door to the guest room slowly opened.</p><br/><p><span>Its hinges were regularly oiled and it should have swung open smoothly, but for some reason, the motion of the doors seemed unusually sluggish and ponderous, as though the door was fighting a pressure differential between the air on the inside and the outside of the room. It was as though their speed was matching the way Sebas felt..</span></p><br/><p><span>If the door had truly read his heart, then Sebas would have much rather it had not opened at all. However, it did open, revealing the interior of the guest room to Sebas’ eyes.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The room was the same as always, but unlike how it usually was, there were now four heteromorphic beings waiting inside.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>One was a light blue warrior. He emitted a freezing aura and held a platinum halberd, but was otherwise motionless.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>One was a demon. There was no telling what schemes hid within his mocking features.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Then, there was an angel in the shape of a fetus, held in the arms of the demon.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>And finally—</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Please forgive my lateness. I am deeply sorry to keep you waiting.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>By sheer force of will, Sebas quashed the trembling in his voice. Then he bowed respectfully to the sole seated being in the room, as though in worship. </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was the butler and the head of the manservants, and he occupied a position close to the top of Nazarick’s hierarchy. Only one person could make Sebas bow before him in fear and awe. There could be no other.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>That entity was one of the 41 Supreme Beings, who commanded fealty that could not be contested.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>—Ainz Ooal Gown.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>This almighty fighting force was also the ruler of the Great Underground Tomb of Nazarick. The Staff of Ainz Ooal Gown emanated a black aura from its place within his hand.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Dim red pinpoints of light played lazily within the hollow orbits of his eye sockets. Even from his bowed position, Sebas could sense those lights sizing him up from head to toe.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The movements of the air told him that Ainz had waved expansively, in a leisurely manner.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…It is fine. Think nothing of it, Sebas. The fault lies with me, being that I did not communicate my arrival in a timely manner. But let us dispense with these pleasantries. How can you speak from over there with your head bowed? I bid you enter.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’s head was still lowered as he responded to the solemn voice. He looked up, and then slowly stepped forward — while a trail of frost ran down his spine.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>That was because his keen senses told him of carefully concealed hostility and killing intent.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>He slowly shifted his gaze. The two Guardians before him did not seem to be paying much attention to Sebas. However, that was from a normal person’s point of view.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was abundantly aware of it.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>There was no trace of friendliness in the tense atmosphere. The opposite was true, in fact. Their vigilance was not the reaction one would have to an ally.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas could understand why they felt that way. He felt a weighty pressure upon him and he was afraid that everyone would hear the thunderous beating of his heart. </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“I think you should stop there.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Demiurge’s relaxed voice rang through the air and halted Sebas in his tracks.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was some distance away from his master. It did not make speaking difficult, and when one considered the dimensions of the room and the fact that he was meeting with a superior, it was quite an appropriate distance. However, under normal circumstances, Ainz would consider Sebas to be too far away and ask him to approach. This time, Ainz had not said so. This sense of separation crushed Sebas until he could no longer breathe.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>At the same time, this distance was the ideal range for Cocytus the warrior to launch an attack. That too was another source of strain for him.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Incidentally, Solution had entered the room with Sebas, but she was standing by the door, awaiting orders.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Then—” Ainz snapped his bony fingers, though how he had done so was not apparent. “A question for you, Sebas. Need I explain why I am here?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>There could only be one reason for that. The current situation made that very clear.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…No, there is no need for that.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Then, I have a question which I would like you to answer in your own words, Sebas. While I did not receive a report from you concerning this matter, is it true that you picked up an adorable little pet recently?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>—It was as he thought.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ back felt like it had been impaled by several icicles. Then, he realized that he had not answered his master’s question. He hurriedly replied:</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—Yes!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…A little slow on the reply, Sebas. Let me ask you again — is it true that you picked up an adorable pet recently and decided to take care of it?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes! I did take in a pet!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Very good. Then, could you explain why you did not report the matter to me?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes…”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ shoulders shuddered and he stared at the ground. What could he say to avoid the situation developing in the worst possible way?</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz leaned back into his throne as he watched the silent Sebas. The creaking of the chair as he did so sounded exceptionally loud in the confines of the room.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“What’s the matter, Sebas? You seem to be sweating heavily. Shall I lend you a handkerchief?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>With a grand flourish, Ainz produced a pure white handkerchief from nowhere. He grasped it between his index and middle fingers and tossed it towards Sebas. The handkerchief unfolded and spread in mid-air, landing gently upon the ground.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“You are permitted to use it.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes! Thank you, my Master!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas took a step towards Ainz and picked up the handkerchief. Then, he froze.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…That handkerchief is not stained with your pet’s blood. I simply felt that it was unsightly to have you covered in sweat.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes… Please forgive my shameful display, Ainz-sama.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas spread the handkerchief and wiped at the cold sweat which beaded his brow. The handkerchief absorbed such an incredible quantity of moisture that its color changed.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Then, let us return to the topic, Sebas. When I sent you to the Royal Capital, I believe I ordered you to record </span><i><span>any</span></i><span> occurrence, great or small, in exacting detail and send it to Nazarick. After all, it is difficult for one person to determine the value of information collected. Frankly speaking, I doubt you omitted a single detail when submitting your reports. Am I correct?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes. It is as you say.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Then, Demiurge, allow me to address a question to you as confirmation. After all, you have read Sebas’ reports as well. Did those reports mention this adorable little pet?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“No, Ainz-sama. I read them several times, but I saw nothing related to that subject.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Very good. Then, let us use that point as a premise for my next question, Sebas. Why did you not submit a report on that matter? …I wish to ask why you disregarded an order from me. Is the word of Ainz Ooal Gown not enough to bind your actions?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Those words shook the air in the room.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas hurriedly answered:</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Certainly not! I simply believed that there was no need to trouble you with a report concerning such a small matter, Ainz-sama.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Silence filled the air.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was bathed in murderous intent from four sources. They came from Cocytus, Demiurge, the angel which Demiurge held, and Solution. All four of them would immediately fall on Sebas if their master so ordered.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas did not fear death. It would be his utmost joy to die for Nazarick. Yet, the thought of being executed as a traitor terrified even the stoic Sebas.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>That was because there was no greater shame for those created by the 41 Supreme Beings than to be counted as a turncoat and subsequently eliminated.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>After some time, and after much sweat had beaded on Sebas’ forehead, Ainz spoke.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…In other words, all this was an exercise of your foolish judgement… Is that correct?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes. It is as you say, Ainz-sama. Please forgive my foolish mistake!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…Hm. I see… I believe I understand now.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>As Sebas lowered his head in apology, Ainz’s emotionless voice filtered into his ears. The fact that Ainz had not ordered a summary execution slightly eased the tension in the room.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>However, Sebas could not relax. Before he could do so, Ainz said something that made Sebas’ heart lurch within his chest.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Solution. Fetch Sebas’ pet.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Understood.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The door quietly closed behind Solution as she moved to carry out her orders. Sebas’ keen senses informed him that Solution was heading away from the door.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>There was an audible gurgle as Sebas gulped.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz, Cocytus, Demiurge and that strange angel were here, for a total of four heteromorphic beings. While Demiurge looked vaguely human, the same could not be said of the other three.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Since none of them seemed to be taking care to hide their forms, did that mean they did not care if someone else saw them?</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The denizens of Nazarick had only one method to keep secrets from spreading — by killing everyone who knew them.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>If he had known this would happen, he would have let her go earlier.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas mentally shook his head. It was too late to think of that now.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Soon, Sebas sensed two people approaching. They were approaching this room from the distance.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><i><span>—What should I do?</span></i></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ eyes shifted and he focused on the air.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Once she arrived here, Sebas would have to make a choice. And there could only be one answer he could give.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ gaze moved to Demiurge, who was observing him. Then to Ainz. And then, he looked powerlessly at the ground.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>There was knocking, and then the door opened. As expected., there were two women there.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>They were Solution and Tsuare.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“I have brought her.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas had his back to Tsuare, but he could hear her gasp from the entrance. Was she shocked to see Demiurge, a demon in the flesh? Was she shaken by seeing Cocytus, the gigantic blue insectoid? Was she frightened by the sight of that fearsome fetus-like angel? Was she terrified by Ainz, the avatar of Death itself? Or was it all of the above?</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The Guardians’ displeasure intensified as Tsuare made her appearance. That was because to some extent, Tsuare was the physical incarnation of Sebas’ sins. It would seem she was trembling from the hostility directed at her.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The hostility of the Guardians, who were easily the most powerful beings in this world, could instil a primal terror in the hearts of the weak. It was surprising that Tsuare had not broken down in tears by now.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas did not look back, but he could clearly feel Tsuare’s gaze boring into him from behind. Her reservoirs of courage were derived from Sebas himself.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Demiurge, Cocytus, restrain yourselves. Learn from Victim’s good example.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>As Ainz’s quiet voice echoed through the room, there was a change in the room’s mood. No, it would be better to say that the hostility direct at Tsuare had vanished. After reprimanding the two Guardians, Ainz slowly extended his left hand to Tsuare. Then he turned his palm to the ceiling, and beckoned her over.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Enter, oh pet human that Sebas has picked up — Tsuare.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>As though controlled by those words, Tsuare took step after step forward on trembling legs.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“That you did not choose to flee shows courage. Or did Solution tell you something? Did she say that Sebas’ fate lay within your hands?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Tsuare was shuddering all over and did not answer. Sebas felt the gaze directed at his back grow stronger. Said gaze made Tsuare’s will abundantly clear, more than any number of words could explain.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>After entering the room, Tsuare walked up to Sebas’ side with no hesitation whatsoever. Cocytus shifted position to stand behind Tsuare, awaiting orders.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Tsuare grabbed the corner of Sebas’ coat. Sebas suddenly recalled how she had clung to his clothing in that alley. At the same time, he was filled with regret. If he had handled things better, the situation would not have come to this.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Demiurge glared coldly at Tsuare—</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“『Kne-”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>—And the sound of snapping fingers rang forth.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Demiurge understood the meaning behind his master’s gesture, and said no more.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—It is fine. Pay it no heed, Demiurge. As praise for the courage to face me without fleeing, I will forgive the rudeness she has shown to myself, the ruler of Nazarick.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“My sincerest apologies.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz nodded magnanimously at Demiurge’s apology.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Ah, yes.” </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz leaned back into the chair, making it creak.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Allow me to introduce myself. I am Ainz Ooal Gown, the master of Sebas over there.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Indeed.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz Ooal Gown — one of the 41 Supreme Beings — was the great entity who controlled every aspect of Sebas’ existence, including his life and death.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Being addressed by the master to whom he owed absolute loyalty was his greatest delight. Yet, for some reason, Sebas’ joy was less than he had imagined. It merely made his spine tingle. It was not because of Tsuare, because upon being addressed by his master, Sebas had almost forgotten she had existed. There was another reason for that—</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>As Sebas was pondering this matter, both sides were still conversing.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Ah… I, I am…”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“It is fine, Tsuare. I know a little about you, and I have no interest in learning more. Stand there and remain silent. Soon you will know why you have been summoned.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Ah… yes.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Now then…” </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The points of red light in Ainz’s eye sockets shifted.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…Sebas, I have a question for you. I told you not to attract attention with your actions, did I not?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“And despite my clear instructions to you, you got yourself into trouble because of this meaningless little woman — am I wrong?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“No, you are not.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The word “meaningless” made Tsuare shudder, but Sebas only answered the question and made no other response.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“At that time… did you not think you were ignoring the orders I had given?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Yes. My thoughtlessness has displeased you, Ainz-sama. I shall reflect upon my sins, be more careful in the future, and I shall not make the same mistake ag—”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—It is fine.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Huh?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“I said, it is fine.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz shifted, and the chair creaked once more.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“People are not perfect, and mistakes are to be expected. Sebas. I shall forgive this trifling mistake of yours.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—Thank you, Ainz-sama.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“However, mistakes must be rectified — by death.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The air in the room suddenly grew tense, and the temperature felt as though it had fallen by several degrees. No, that was not it. Only Sebas felt that way. The others — the denizens of Nazarick — remained serene and still.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas gulped.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>What did his master mean by “death”? No, that went without saying. The thoughts “</span><i><span>As I expected”</span></i><span> and “</span><i><span>I hope not”</span></i><span> weighed heavily on Sebas, but still, he asked:</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…What… do you mean…”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Hm… what I mean is that I expect you to eliminate the source of your mistake in order to wipe the slate clean. How can you be the representative of everyone else when you leave the origin of your error untouched? You are the butler of Nazarick, and one who stands at the head of the manservants. If you do not handle the matter appropriately…”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas exhaled. Then he took in another breath. </span></p><br/><p><span> 。。</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Even when faced with a mighty foe, Sebas’ breathing remained calm and regular. Yet, it was now frantic, like a small animal that had run into a predator.</span></p><br/><p><span> ，。</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Sebas. Are you a loyal hound who obeys the orders of my exalted self — of the 41 Supreme Beings? Or are you a man who believes that your will alone is righteous?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“This—”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—I do not need your answer. Show me your conclusion.” </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas closed his eyes, and then opened them again.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>He hesitated for only a moment. No, it would be better to say that he had spent an entire moment hesitating. This time he had spent in indecision was enough to earn the palpable ire of Cocytus, Demiurge and Solution, people whose loyalty to the Supreme One was beyond reproach.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>After that long, interminable moment, Sebas finally made his decision.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>♦ ♦ ♦ </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was the butler of Nazarick.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>He was nothing else beyond that.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>His foolish hesitation had brought about these consequences. If he had pleaded with his master earlier, the outcome might have been different.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>All this was his fault.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>♦ ♦ ♦ </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>A hard lustre filled Sebas’ eyes. They gleamed like polished steel. Then, he turned to Tsuare.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>The hand clinging to him let go. Its fingers clutched briefly at empty air, wavering for a moment before falling powerlessly.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Tsuare looked at Sebas’ face. She had probably guessed his decision by now.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>She smiled, and closed her eyes.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>That was not a look of despair, or fear. She had accepted what would happen next, had accepted her impending fate with all the grace of a martyr.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ movements did not waver. His heart had long since descended into the abyss. In his place stood a steely servant who had pledged his utmost fealty to Nazarick. That being the case, there was no reason not to obey the absolute order handed down by his master.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>He had cut through his confusion. Only loyalty remained.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas’ hand formed into a fist, and then he struck at Tsuare’s head, seeking to grant her the mercy of an instant death.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>And then—</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>♦ ♦ ♦ </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>—Something hard intercepted his fist.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—What are you doing? Why are you interfering with me?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“—!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“…”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Something had blocked the fist which should have obliterated Tsuare’s skull.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Cocytus had reached out a hand from behind Tsuare — whose eyes were still tightly shut — and stopped Sebas’ fist.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Was Cocytus a traitor, given that he had blocked a strike which the Supreme One had ordered?</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>And then, the doubts in Sebas’ heart were immediately answered.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Stand down, Sebas.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas was anxious and doubtful, but he was still halfway through another punch when he heard Ainz’s order. The strength he had channelled into his hand dissipated in an instant. </span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>His master had not censured Cocytus, but had instead told Sebas to stop. That indicated that he had also arranged for Cocytus’ interdiction of Sebas’ strike.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Indeed, all this had had been planned ahead of time. The fact was that his master wished to verify Sebas’ intentions.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Tsuare timidly opened her eyes, and saw that the headman’s axe which awaited her was long gone. Now that her life was no longer in danger, her wound-up emotions snapped inside her. Tsuare’s body convulsed with shudders as the tears streamed from her eyes. She very nearly collapsed from the shaking of her legs, but Sebas did not reach out to support her. No, he could not.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>What else could he do, now that things had come to this? What right did he have, given that he had left her to her fate?</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Ainz paid no heed to Tsuare’s fear and began addressing Cocytus.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Cocytus. Was that blow intended to take that woman’s life?”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“There. Is. No. Doubt. That. It. Would. Have. Been. Instantly. Fatal.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“Then I declare that Sebas’ loyalty is no longer in question. Thank you, Sebas.”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>“I would not dare!”</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Sebas bowed, his face stiff.</span><span></span></p><br/><p>\n</p></div>"}