{"title": "Chapter 65 - Volume 9", "id": 65, "volume": 9, "url": "http://boxnovel.org/overlord-ln-chapter-65-volume-9", "volume_title": "Volume 9", "body": "<h1>Chapter 65 - Volume 9</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Overlord Volume 9 Chapter 3</h3><br/><p><b>Another Battle</b></p><br/><p><span>(Re)Translated by Nigel</span></p><br/><p><span>Edited/Proofread by Deus Ex Machina</span></p><br/><p><b>Part 1</b></p><br/><p><span>The First Prince Barbro Andrean Ield Ryle Vaiself was furious as he led his men north, leaving behind the clamor of E-Rantel and the troops preparing to march out to the Katze Plains.</span></p><br/><p><span>“Dammit. That damn Marquis Raeven…”</span></p><br/><p><span>Barbro could not hold back his cursing.</span></p><br/><p><span>During the demonic disturbance, his younger brother had borrowed Raeven’s men to patrol the city and maintain order, giving the nobles the impression that he was willing and able to step into the fray. As a result, the nobles who had originally supported the First Prince Barbro were beginning to have second thoughts. Now that Marquis Raeven had thrown his support behind the Second Prince, some of those nobles had jumped ship to his side as well. </span></p><br/><p><span>Not moving out during the demonic disturbance had been a fatal mistake.</span></p><br/><p><span>Barbro had not stepped onto the frontline and stayed in the Royal Palace because he had no men of his own.</span></p><br/><p><span>It had been the right thing to do; what good could just one man do by himself on the frontline? He would simply get in others’ way. Besides, the demons might have attacked the Royal Palace too.</span></p><br/><p><span>Without Marquis Raeven’s men, his younger brother would not have been able to maintain order either.</span></p><br/><p><span>Barbro believed that he had made the right choice. However, those fools did not understand it and had been deceived by appearances. In the end, they had all played into Marquis Raeven’s hands. </span></p><br/><p><span>“Could it be that none of them had any idea what he was plotting? Besides, they were just patrolling, they didn’t even fight any demons, no?”</span></p><br/><p><span>If his younger brother had fought, he would surely have made a fool of himself. When one thought about that, one could tell how smart Marquis Raeven was.</span></p><br/><p><span>There was also one more thing that displeased Barbro.</span></p><br/><p><span>That was the fact that he was on his way to the insignificant little settlement of Carne Village.</span></p><br/><p><span>He had fallen behind in the struggle for the succession.</span></p><br/><p><span>That was why Barbro had to distinguish himself as the First Prince during this battle with the Empire. He had to regain the fame his younger brother had stolen in order to let everyone know that he was the best choice to inherit the Kingdom.</span></p><br/><p><span>Thus, this battle was very important to him; yet he had been given orders which had him running around on a useless errand like some lackey. What prestige was there in investigating the link between a frontier village and Ainz Ooal Gown?</span></p><br/><p><span>In that moment, a chill ran down Barbro’s spine.</span></p><br/><p><span>Could it be that this had been done to keep Barbro from achieving anything?</span></p><br/><p><span>His father had long since made up his mind to give the throne to his younger brother, and he did not want to let Barbro make any accomplishments to turn the tables, so he sent him on to this tiny little hamlet─</span></p><br/><p><span>Barbro’s breathing grew chaotic. His heart burned with hatred for his father, who was looking down on him, the First Prince and wanted to give the throne to his younger brother for showing just a tiny bit of courage. </span></p><br/><p><span>The fact that he noticed a horse drawing up to him as frustration blinkered his eyes was purely coincidence.</span></p><br/><p><span>“My Prince, are you unwell? Shall I call over a priest?”</span></p><br/><p><span>The shrill voice at close range echoed loudly and seemed to claw directly at his brain, and it even making him want to throw up. However, he overcame it. It was fortunate that the cool air of winter helped soothe him, and that growing up in the royal household had trained him to keep up appearances.</span></p><br/><p><span>Only a fool would reveal his inner feelings.</span></p><br/><p><span>“No, no, pay it no heed. I was simply thinking about how to handle the task Father gave me. Enough of that; Baron Cheneko, didn’t you visit the adamantite-ranked adventurer Momon? What happened?”</span></p><br/><p><span>“Oh, you must hear me, My Prince! A deeply upsetting thing happened! Right, Momon was not in, and I did not meet him.”</span></p><br/><p><span>“Well, that was just bad luck. After all, he </span><i><span>is</span></i><span> an adamantite-ranked adventurer. So why are you so angry? You didn’t make an appointment, so it couldn’t be helped that he wasn’t in.”</span></p><br/><p><span>“No! It’s not because of that! It was Momon’s companion who displeased me, that Nabe woman.”</span></p><br/><p><span>“Nabe? Ah, the Beautiful Princess.”</span></p><br/><p><span>Barbro recalled the ravishing beauty he had seen in the Royal Capital, so fair that she could compare with his little sister. Barbro desired her, but she was the companion of an adventurer whom his father had favored, so he could not just do whatever he wanted to her like she was a commoner.</span></p><br/><p><span>“And what did that beauty do to you?”</span></p><br/><p><span>“She raised her hand against me! Please look, my Prince!”</span></p><br/><p><span>Baron Cheneko removed his gauntlet, revealing a large bruise.</span></p><br/><p><span>“What? Even an adamantite-ranked adventurer can’t commit violence upon a noble.”</span></p><br/><p><span>“But that Nabe woman suddenly grabbed my hand and chased me out!”</span></p><br/><p><span>There was far too little information to act on, and Barbro did not wish to ask any further. That was because he kept thinking that there was some reason behind it which had been hidden.</span></p><br/><p><span>“My Prince! I beseech you to severely punish that foolish woman for harming me!”</span></p><br/><p><span>If he used that as leverage, could he not do as he wished to that woman?</span></p><br/><p><span>Babro considered it.</span></p><br/><p><span>He thought about whether there was a way for him to help the Baron and take Nabe for himself, but he could not think of anything. This Baron was an utter idiot, and he might think that he was doing the prince a favor.</span></p><br/><p><i><span>What a useless man. Well, I’ll guess I can buddy up to him for now, but once I take the throne, he’ll be the first one that I’ll discard. Before that, I’ll make good use of him.</span></i></p><br/><p><span>Barbro was already plotting how things would go, but at the same time he was somewhat depressed by the fact that someone like him had his own fief and vassals ─ the ability to wage war without having to rely on anyone else ─ while he had no sworn soldiers.</span></p><br/><p><span>As the Baron looked at him with anticipation-filled eyes, Barbro waved him away.</span></p><br/><p><span>“When I become King, I will consider it.”</span></p><br/><p><span>“Thank you, my Prince!”</span></p><br/><p><span>Barbro no longer wished to speak to this bowing buffoon any longer, so he asked a question of one of the knights under Marquis Bowlorobe. He was a commander of the Marquis’ elite troops.</span></p><br/><p><span>“Oi, I have a question?”</span></p><br/><p><span>“What is it, your Highness?”</span></p><br/><p><span>In truth, he did not actually have anything to ask, but he could not say he no longer wanted to speak to the Baron, so he was simply looking for an excuse. He paused to think for a moment, and come up with a suitable question, whereupon that hateful notion from just now appeared in his mind again.</span></p><br/><p><span>It was Marquis Bowlorobe’s idea to send Barbro to this pioneer village, which meant─</span></p><br/><p><i><span>Could it be that the Count’s turned on me? Has he switched sides to my brother?</span></i></p><br/><p><span>He wanted to deny that possibility.</span></p><br/><p><span>Barbro was wed to the Marquis’ daughter, and he had been a good son-in-law all this time. Once Barbro took the throne, he would become the leader of the Six Great Nobles. Choosing to support his younger brother now would only lead to conflict with Marquis Raeven. But what other reason could there be?</span></p><br/><p><i><span>If that’s true, then… is the fact that I’ve been sent to this pissant village to tell all the other nobles that I can’t contribute much to the war?</span></i></p><br/><p><span>“What’s wrong? Do you need a rest?”</span></p><br/><p><span>“─Shut up.”</span></p><br/><p><span>No matter how hard he tried, he could not keep the malice from escaping him.</span></p><br/><p><span>He saw that the knight was startled, but he still could not bear it.</span></p><br/><p><span>As the murderous intent leaked from between his teeth, Barbro ordered:</span></p><br/><p><span>“I command you to swiftly conclude the matter of Carne Village while making ready to proceed to the Katze Plains at the same time. Once we reach Carne Village, we will promptly complete our objective and leave, and I think we will be able to reach E-Rantel by nightfall. After that, we’ll rest for the night and then make haste for the Katze Plains at sunrise.”</span></p><br/><p><span>The knight frowned.</span></p><br/><p><span>“With all due respect, I feel that is very difficult. Please have a look, your Highness. Our formation comprises 3500 men from the Marquis and 1500 men from the various nobles who have lent their support. In order to swiftly complete our mission, we have reduced our composition of supply troops, replacing them with 50 cargo wagons.”</span></p><br/><p><span>“I know that. What’s the problem?”</span></p><br/><p><span>“Our formation has 4500 infantry and 500 cavalry. Even if we complete our business in Carne Village within an hour, returning to E-Rantel by nightfall will be quite a rush.”</span></p><br/><p><span>“Which is why I was asking. I’ll say it again; is there a problem? If there is none, why can’t you do it?”</span></p><br/><p><span>“My Prince… the infantry may end up being exhausted to the point of collapse.”</span></p><br/><p><span>“It seems you’ve gotten the wrong idea, haven’t you? Ultimately, there’s no value in going to a pitiful little village like that. What we need to do is proceed to the Katze Plains and defeat the Empire. Aren’t you the Marquis’ man? In that case, let me ask you this; is this battle easy enough that they can afford to have 5’000 men gallivanting around the countryside? Do </span><i><span>you</span></i><span> think so?”</span></p><br/><p><span>The knight’s mouth tightened into a straight line.</span></p><br/><p><span>“Get your priorities straight. The men will be tired, you say? Then lash them to make them run. After all, you were all gathered here to do battle on the Katze Plains.”</span></p><br/><p><i><span>─And to build my reputation.</span></i></p><br/><p><span>“…It is as your Highness says. I understand.”</span></p><br/><p><span>The knight bowed his head in acknowledgement.</span></p><br/><p><span>“You should have answered like that from the beginning. Go plan when we can arrive at E-Rantel and when we can set forth; I’ll leave the details to you.”</span></p><br/><p><span>“Yes! I shall quickly discuss the matter and return with the answer you seek, your Highness!”</span></p><br/><p><span>By the time the knight spurred his horse toward his comrades, Barbro had long since put him out of his mind.</span></p><br/><p><i><span>Does my father hate me? Or has he gone senile and can’t think straight any more? So that’s why he wanted to give the throne to my younger brother. It’s only proper that the eldest sibling should inherit; otherwise won’t that offend the nobles?</span></i></p><br/><p><span>He swore to recover from the dire straits he was in, and make them regret giving him 5’000 men to command.</span></p><br/><p><span>It was this determination that drove Barbro.</span></p><br/><p><span>“Baron!”</span></p><br/><p><span>“Yes, milord!”</span></p><br/><p><span>“Don’t disappoint me!”</span></p><br/><p><span>The Baron seemed to have replied in a shrill voice, but it went in one ear and out the other for Barbro.</span></p><br/><p><i><span>Damn you, Zanack. Go gaze at your navel in the Royal Capital.</span></i></p><br/><p><span>While they were related by blood, he was also an adversary in the race for the succession and thus had to be bumped off. He would not insist on killing him, but if he got in the way, he would not mind giving the order to do so.</span></p><br/><p><i><span>Once I ascend to the throne… what can I do with him? Should I kill him, so those stupid nobles can’t rally around him in revolt? Or would that be a waste? If he were a woman, he’d have many uses… My sister (Renner) might be stupid but she has a pretty face. I’ll sell her off to the highest bidder… It’ll be troublesome to have a branch family bearing royal blood, so ideally I’d marry her off to the royalty of some distant kingdom… although, if she could be useful and serve as the foundation for my power, well, I could consider that.</span></i></p><br/><p><span>As he imagined the ideal future of the Re-Estize Kingdom he would found, Barbro absentmindedly narrowed his eyes. </span></p><br/><p><span>He saw himself seated on the throne, with the massed nobles bowing respectfully to him.</span></p><br/><p><span>He saw his vassals scurrying to carry out the orders which he gve.</span></p><br/><p><span>“Wouldn’t it be wonderful?”</span></p><br/><p><span>He smiled thinly, then quickly covered it up.</span></p><br/><p><span>After promptly finishing their mission in Carne Village, could they rush over to the Katze Plains quickly? Barbro felt that was what would determine if his dream would become reality or remain a fantasy.</span></p><br/><p><i><span>…Assuming the soldiers can be forced to march, the most important thing would be whether or not we made it in time for the battle, right? Or rather, should we quietly observe the battle and act as ambushers?</span></i></p><br/><p><span>He felt that it was a clever plan, but he was not confident that he could skilfully use his troops to attack the enemy in the flank or rear while they were unaware of him.</span></p><br/><p><span>He very much wanted to let the knights handle this, but this battle was a chance to demonstrate his worthiness of the throne, so letting others arrange things was not a good idea.</span></p><br/><p><span>What should he do to get the most impressive results and secure the throne for himself? As Barbro thought, an idea suddenly came to him.</span></p><br/><p><i><span>Would it be possible to use the people of Carne Village to negotiate with Ainz Ooal Gown?</span></i></p><br/><p><span>It was as though a shaft of blinding light had fallen from the heavens to illuminate him.</span></p><br/><p><span>Truly, that was a masterful move.</span></p><br/><p><span>Whatever reason Ainz Ooal Gown had for saving Carne Village, their existence ought to be collateral for negotiation.</span></p><br/><p><span>If this magic caster Ainz Ooal Gown that nobody had heard of before backed out of the war, the Baharuth Empire would lose their justification and would probably withdraw their troops to avoid being labelled as invaders.</span></p><br/><p><span>And if it turned out that it was Barbro’s actions which made the Empire withdraw─</span></p><br/><p><i><span>Would that not be an amazing thing? Father will no longer be able to take me lightly, and my accession would be guaranteed.</span></i></p><br/><p><span>“Good. Very good.”</span></p><br/><p><span>If it turned out that Ainz Ooal Gown had simply helped them in passing, then he might not withdraw his forces. In that case, all he would have to do was force the people of Carne Village to take up arms. People from all over the country were being mobilized for this. The peasants of Carne Village had no right to refuse.</span></p><br/><p><span>Father seemed to have exempted the people of Carne Village from conscriptions, but now the situation was different. It was up to the commander ─ Barbro, under these circumstances ─ to deal things as they came up.</span></p><br/><p><span>If Ainz Ooal Gown killed the farmers of Carne Village, then it could be used as a form of propaganda too. They could lambast him as a petty villain. Propaganda like that ought to be effective against his backers, the Empire, as well.</span></p><br/><p><span>Barbro shivered at the sheer perfection of his plan.</span></p><br/><p><span>In all honesty, he had thought that he was dumber than his younger siblings, but now that was hard to say. The fact that such wisdom slept within his mind thrilled Barbro.</span></p><br/><p><b>Part 2</b></p><br/><p><span>Winter was hell for small villages. All they could do was pray for the coming of the warmer seasons while weathering the cold days in their homes. If spring was late, or if the harvest in autumn was meager, they might be forced to eat their seed stock, and people would still starve to death even if they did so.</span></p><br/><p><span>While there was nearly no field work to be done in winter, village life was still closely associated with the words “activity”. There were many tasks to be done indoors, like tending the livestock, maintaining the farming tools, repairing their homes, livestock coops, and so on. There was simply no time to rest.</span></p><br/><p><span>This was especially true in Carne Village, where they raised pigs to feed the carnivorous monsters known as Ogres. They had bought those pigs after selling their herb harvest, and said pigs supplemented what the rangers brought in.</span></p><br/><p><span>The Goblins led those pigs into the Great Forest of Tob to graze on roots and stems. Since the plan was still at an experimental stage, there were only a small number of pigs right now, but if they managed to raise them successfully and if they could make it through the winter, they would steadily increase their number in the future.</span></p><br/><p><span>Normally, they would need to pay taxes to the landlord of the land they were grazing on, but fortunately, Carne Village did not need to do that. The reason was because the Great Forest of Tob was the dwelling place of monsters, and was not ruled by humans.</span></p><br/><p><span>Carne Village’s future seemed very bright indeed.</span></p><br/><p><span>All of this was thanks to Ainz Ooal Gown, who had saved the village and helped it in many ways. In addition, the Dark Warrior Momon had subdued the Wise King of the Forest. Many people in the village gave thanks to the two of them, and some even prayed to them over breakfast, revering them in the same breath as they did the gods.</span></p><br/><p><span>It was precisely this overflowing of hope that gave the new chief, Enri Emmot, so much work.</span></p><br/><p><span>Today, Enri, headed to a small hut to do her work, followed by Nfirea.</span></p><br/><p><span>In a frontier village like Carne, everyone in the village worked together like they were family. If they did not do this, there would be no way for them to survive. They shared their farming implements and their food and even took turns to use their cows to till the fields.</span></p><br/><p><span>Because of this, the care and feeding of the livestock was everyone’s responsibility. The hay for the cows in winter was stored in small huts just like this one.</span></p><br/><p><span>Enri opened the wooden door and entered, followed closely by Nfirea. Enri went straight in after opening the door and sat herself down onto a pile of hay, sinking her rear into the dried grass with a soft </span><i><span>pomf</span></i><span>.</span></p><br/><p><span>After closing the door, Nfirea sat by her side, his magic light illuminating the surroundings.</span></p><br/><p><span>“Chief, you should save the playing around for after you finish this; we still need to see if we have enough hay and then make several decisions afterwards.”</span></p><br/><p><span>“You’re calling me Chief again…”</span></p><br/><p><span>Nfirea could not help giggling at Enri’s depressed reply.</span></p><br/><p><span>“Well, that’s fine, isn’t it? I </span><i><span>am</span></i><span> the Chief, after all! That’s right, Agu thinks I can squish all the Goblins into paste if I felt like it! Compared to that, all these problems are nothing!”</span></p><br/><p><span>Ever since she had won every single arm-wrestling match with Agu and company, there seemed to be an air of “it might be true” hovering around the village people, which pricked at her heart. Incidentally, she had not challenged the Ogres. If she lost, it would not prove anything, and if she won, or at least lost narrowly, it would get even worse.</span></p><br/><p><i><span>―Does this mean I’ll never be able to get married if I let Enfi get away?</span></i></p><br/><p><span>Sweat slowly beaded on Enri’s hands.</span></p><br/><p><span>“Ah― right. Aren’t you going to open the window? It’s dry now, so opening it should be fine.”</span></p><br/><p><span>“Eh? No, no need, we don’t need to, right? And look, we’ve got a magic light here.”</span></p><br/><p><span>“Really? Well, if you don’t mind, then neither do I, Enfi.”</span></p><br/><p><span>Magic illumination was brighter than sunlight. She knew this, but Enri’s suggestion was based purely on the logic that “since the sun’s out, isn’t it kind of wasteful to use mana for a magical light”? In addition, she wanted to change the current mood in the room. There was no particular reason for it, and it was no problem if he refused. However, Nfirea seemed to be having some kind of strange reaction to sitting next to her, what with his ears being bright red and all.</span></p><br/><p><i><span>Is he really using so much of his mana? But I heard that making magic lights wasn’t that tiring… did he use some other spell before coming here? Come to think of it, he doesn’t smell of herbs. In fact, he smells kind of… nice.</span></i></p><br/><p><span>“W-what’s wrong, Enri?”</span></p><br/><p><span>Nfirea’s words came out in a panicked squeak as Enri pressed her nose close to him.</span></p><br/><p><span>“Hm? Hmmm? Ah, it’s nothing, I just thought I smelled something nice…”</span></p><br/><p><span>“Y-you did? Well, that’s good to hear. That must be the cologne I made.”</span></p><br/><p><span>“Really? Why don’t you try selling it in town next time? I’m sure it’ll fetch a good price.”</span></p><br/><p><span>“No, that… this… isn’t meant for sale…”</span></p><br/><p><span>“Hmm… well, forget it. Anyway, there should be enough hay in this hut. Shall we move on?”</span></p><br/><p><span>“Mm, yeah. Then, before we move on, let me check on something first. It’s cold outside, after all.”</span></p><br/><p><span>“…Well, this place isn’t that warm either… ah, forget it.”</span></p><br/><p><span>“That… about that. I wanted to discuss several things with you.”</span></p><br/><p><span>Nfirea, who was sitting beside her, seemed a little tense.</span></p><br/><p><span>What was going on with him?</span></p><br/><p><span>As Enri bathed the side of his face in a suspicious stare, Nfirea took out a handful of papers.</span></p><br/><p><span>They were covered in tiny letters. Enri had learned quite a few words by now, but her quick glimpse revealed more words she did not understand compared to those that she did.</span></p><br/><p><span>“The first thing is how to feed the surviving Goblins from Agu’s tribe and the Ogres.”</span></p><br/><p><span>“Eh? Aren’t we fine as we are? They helped with the harvest in the autumn, and we managed to buy the Ogres’ food from the city.”</span></p><br/><p><span>“Mmm, and the herbs sold for a good price, so we can say we’ve got ample food reserves. It should be enough to deal with this winter. Even if we add a few extras, our food stocks should still hold out. But if our numbers keep increasing, life’s going to be quite harsh. Maybe we should acquire our food by other means.”</span></p><br/><p><span>There were 14 people in Agu’s tribe now. They were not born, but instead, they managed to escape from the territory of the Giant of the West and the Serpent of the East.</span></p><br/><p><span>“Mmmm. Although I don’t see a problem, we should probably buy more food from E-Rantel. However, I was planning to save some money to commission some metal farming tools for the Ogres.”</span></p><br/><p><span>“If we could make some farming tools for the Ogres, the spring seeding should go a lot faster. …But the problem is that if we order tools for the Ogres, they’ll be big enough that no human could use them, and that’ll make them suspicious.”</span></p><br/><p><span>“And if word about the Ogres working in the village gets out, it’ll cause a lot of problems, right?”</span></p><br/><p><span>When the tax collectors came in autumn, Jugemu and the other demihumans had to hide in order to evade detection. Incidentally, it was due to their efforts that the grain harvest was so bountiful.</span></p><br/><p><span>Since Carne Village had been attacked by Imperial knights, they only needed to pay a nominal tribute, which was a stroke of luck for them. In addition, they were excused from the draft for several years.</span></p><br/><p><span>Most of that was a form of apology for not protecting Carne Village properly, but it looked like they felt genuine guilt about that as well. They thought that the high walls would arouse suspicious, but the tax collectors had simply commented “so that’s the kindness of that magic caster at work, hm?” and left matters at that. That being the case, Enri believed that they ought to be able to accept the presence of the Ogres as well, but Nfirea shook his head.</span></p><br/><p><span>“There’s no doubt about that ─ yup. If it goes bad, the Kingdom might even send a punitive force out.”</span></p><br/><p><span>“That’s terrible!”</span></p><br/><p><span>“You might be angry, but the truth is that Ogres usually eat people. The only reason why they can live with us in this village is because of Jugemu-san, who are stronger than the Ogres. Don’t forget that.”</span></p><br/><p><span>“I haven’t…”</span></p><br/><p><span>“Another thing is that we have far too few people in this village. We need to think about how to get more residents. It would be great if the newcomers arrived with the spring planting season.”</span></p><br/><p><span>“That might be hard. Also, it’ll be troublesome if the newcomers get scared off by the Goblins and Ogres ─ what is it?”</span></p><br/><p><span>That question came from Enri. Nfirea had been acting strange since just now. It was as though… his mind was not fully there or something like that.</span></p><br/><p><span>“Eh? Ah, no, nothing’s wrong!”</span></p><br/><p><span>It certainly did not look that way. Was he running low on sleep? After all, her lover had a bad habit of dropping everything to obsess about his potions.</span></p><br/><p><span>As he saw Enri’s eyebrows furrowing, Nfirea took a deep breath and shifted his body over.</span></p><br/><p><i><span>Hm? So he really is tired, after all? He does do a lot of experiments everyday… but it’ll be cold if he sleeps here. Although it’s kind of warm in the hay…</span></i></p><br/><p><span>While Enri was thinking about this. Nfirea slowly leaned more and more of his weight on her.</span></p><br/><p><i><span>What’s wrong? Though come to think about it, it would be better if Nfirea were a bit stronger… I guess he needs more meat. He hasn’t been eating and sleeping enough.</span></i></p><br/><p><span>A playful impulse came over Enri, and she pushed back on Nfirea. She had originally intended to use just a bit of force, but because she used too much strength, she ended up pinning him below herself instead.</span></p><br/><p><span>“―Ueeeeh?”</span></p><br/><p><span>Below Enri, Nfirea’s surprised and confused face slowly turned bright red.</span></p><br/><p><i><span>Aaaah~ It must be embarrassing for a man to lose to a woman in strength. That’s why I said you need to eat more…</span></i></p><br/><p><span>Just as Enri rolled herself off him, Nfirea lay down in the hay and closed his eyes.</span></p><br/><p><span>They stayed like this for several seconds, letting the air flow around them.</span></p><br/><p><span>“…What’s wrong, Enfi? Do you want to sleep?”</span></p><br/><p><span>Nfirea sat back up, his face uncharacteristically red.</span></p><br/><p><span>“Uh… oh… um. N-nothing…”</span></p><br/><p><span>“―Ane-san!”</span></p><br/><p><span>The door flew open without a knock as the shout reached her ears. So forceful was the entry that the door crashed loudly against the nearby wall.</span></p><br/><p><span>“Hueeee?”</span></p><br/><p><span>The curious squeak came from Nfirea.</span></p><br/><p><span>“W-w-w-w-what happened?”</span></p><br/><p><span>“Sorry for disturbing you two, but this is an emergency!”</span></p><br/><p><span>“What happened?”</span></p><br/><p><span>This was the first time she had seen Jugemu this worried ever since that Troll attacked. A strange, terrible premonition seemed to run through her body.</span></p><br/><p><span>“It’s an army! There’s an army headed this way!”</span></p><br/><p><span>“Eh?! What, what did you say? Whose troops are they?”</span></p><br/><p><span>“We don’t know about heraldry so we couldn’t tell. But there’s a lot of different coats of arms, so you should come and look… In any case, we should shut the gate first. What should we do?”</span></p><br/><p><span>“Ah! Ah… well, can you tell us which coats of arms make up the most among them? If you can describe or sketch them for me, I can help.”</span></p><br/><p><span>After listening to Jugemu’s explanation, a puzzled expression spread over Nfirea’s face.</span></p><br/><p><span>“How strange. Those are flags from the Kingdom. If we knew which nobles’ crests they were, we could identify who was coming here.”</span></p><br/><p><span>Carne Village was a frontier village, and before it had been founded there had only been forest here. It was obvious that their objective was Carne Village, but why they were coming here was still a mystery.</span></p><br/><p><span>“What on earth’s going on? Do you know why, Nfirea?”</span></p><br/><p><span>“Why would the Royal Army come to the village? If they wanted to go to the Great Forest of Tob, it’s strange that they’re sending so many troops. They could have just sent adventurers instead. If that’s the case… maybe there’s a revolt or something…”</span></p><br/><p><span>“Did such a thing really happen?”</span></p><br/><p><span>“It’s just hearsay, but I’ve heard that the King’s power in the Kingdom isn’t actually very strong. Currently, it seems like the nobles are in conflict with the King. If that’s the case, are they coming to Carne Village to attack the King’s territory?”</span></p><br/><p><span>The blood drained from Enri’s face.</span></p><br/><p><span>Could it be that the village would be subject to a dreadful assault like last time?</span></p><br/><p><span>―However, the circumstances now were different from then.</span></p><br/><p><span>Enri decided to face it head on.</span></p><br/><p><span>“We should flee into the forest before the troops reach this place!”</span></p><br/><p><span>“…Ane-san, I’m sorry. We spotted them too late, so if we ran now, we’d have to leave all our things here. In addition, since it’s winter, the chances of monsters appearing in the forest are also very high. If we run from one problem, we end up running right into another instead.”</span></p><br/><p><span>Jugemu’s pained expression made Enri feel dizzy.</span></p><br/><p><span>They would not be able to survive if the troops burned the village down in winter.</span></p><br/><p><span>“If that’s the case… ah! That’s right! If we can’t flee with our possessions, then we should prepare for battle and hide food and the other necessities at the same time!”</span></p><br/><p><span>“Yes! That’s a good plan, Enri! The cellars where Jugemu and the Ogres hid from the tax collectors shouldn’t have been buried yet. We’ll move everything in there!”</span></p><br/><p><span>Just as Enri was about to move into action, she remembered a question she hadn’t asked yet.</span></p><br/><p><span>What were their numbers? The villagers could estimate how much people to mobilize if they knew how many there were.</span></p><br/><p><span>“How many are there? It should be about a hundred, right?”</span></p><br/><p><span>“No…”</span></p><br/><p><span>Jugemu’s hesitant answer made Enri want to stuff her fingers in her ears.</span></p><br/><p><span>“That’s not all… they number in the thousands.”</span></p><br/><p><span>Enri’s eyes went wide. So did Nfirea beside her.</span></p><br/><p><span>“They have about 4000 people at the very least, I think.”</span></p><br/><p><span>“But that’s… why would they send so many…”</span></p><br/><p><span>“I have no idea. Why would they send so many troops to a village like this? …Enri, could it be that word got out about the Goblins in the village?”</span></p><br/><p><span>“No way. It’s impossible.”</span></p><br/><p><span>Enri answered immediately.</span></p><br/><p><span>No matter how she thought, she could not think of a reason for a leak. There had been immigrants to the village, but they all felt that the Goblins were more trustworthy than humans. Ever since the Troll attack, the barriers between the original and new residents of the village had all but disappeared.</span></p><br/><p><span>It might have been because of adventurers who had come to the village ― they were all dead, with the exception of Momon and Nabe ― but Nfirea insisted that could not be the case.</span></p><br/><p><span>“Then… while we prepare to flee, we should ask them why they came. Fighting… is a last resort.”</span></p><br/><p><span>Challenging an army of 4000 men was nothing short of suicide.</span></p><br/><p><span>“Like Ani-san said, that’s all we can do… I guess against these numbers, there’s no other way.”</span></p><br/><p><span>“Umu. That’s why, we should get ready to flee at any moment, while trying to buy time for our escape. Then, let’s go!”</span></p><br/><p><span>***</span></p><br/><p><span>They sen trhe villagers and the Ogres by the village gates to go hide the food. The only ones left were Enri, Jugemu, and some of the Goblins, along with Britta and several members of the defence force.</span></p><br/><p><span>The first thing Enri did was to question Britta about the situation, asking about the identity of the interlopers and whose crests they bore. But sadly, Britta could not give her any answers.</span></p><br/><p><span>According to her, someone else had always handled that sort of thing. In that moment, Enri realised how important it was to be well-informed. Because of that, all they could do was to wait for Nfirea to make his report after coming back from the watch tower.</span></p><br/><p><span>The sound of hooves came from the other side of the wall, and then a loud voice.</span></p><br/><p><span>“This one is the envoy of the First Prince of the Re-Estize Kingdom, Barbro Andrean Ield DDale Vaiself! Open the gate and let us in!”</span></p><br/><p><span>Enri doubted her ears again.</span></p><br/><p><span>Although she had heard many surprising things in a short period of time, this one took the cake.</span></p><br/><p><span>“The, the First Prince?!”</span></p><br/><p><i><span>What on earth was someone like that doing here?!</span></i></p><br/><p><span>Enri had no idea what was going on. All this was starting to feel like a dream.</span></p><br/><p><span>However, judging by the way Nfirea was scurrying back from the watchtower, she was certain that the envoy’s words were true.</span></p><br/><p><span>“The King’s flag is among them. Only the royal family or those related to them would be allowed to bear that flag.”</span></p><br/><p><span>“Eh? What does that mean?”</span></p><br/><p><span>“It means that the royal family has brought troops to our village!”</span></p><br/><p><span>Enri raised her voice, unable to understand what was going on.</span></p><br/><p><span>“Why, why do you need to send so many troops to a frontier village like this?”</span></p><br/><p><span>“Villagers like you don’t need to know about that! This land belongs to the King, and obeying the Prince is the proper thing to do! Or could it be that you’re defying the King ― rising up in revolt?”</span></p><br/><p><span>Enri’s body shuddered.</span></p><br/><p><span>As subjects of the King, they should open their doors. However―</span></p><br/><p><span>―Jugemu exchanged a glance with Enri from the side.</span></p><br/><p><span>Even if they went to open the gate right away, they could not do it instantly. Before that, they had to hide the Goblins and the Ogres.</span></p><br/><p><span>“Ah, Ane-san. We’ll hide ourselves as quickly as we can. Until then, please buy us some time.”</span></p><br/><p><span>Enri nodded. </span><i><span>Why did I order them to hide the food there</span></i><span>, she thought, but it was too late for regrets now.</span></p><br/><p><span>“I repeat. Open the gate!”</span></p><br/><p><span>“My, my apologies! Right now, right now we’re preparing to welcome his Majesty the Prince! Please, hold on a bit!”</span></p><br/><p><span>“Repeat yourself, woman! Are you in charge of this village? This delay is unacceptable! Do not waste even a single second in opening the gate!”</span></p><br/><p><span>“…Why are you so desperate to get in?!”</span></p><br/><p><span>Enri was already uneasy, and she responded with an angry shout. While she knew it was very rude, she could not rule out the possibility that they were soldiers from another country masquerading as Kingdom troops.</span></p><br/><p><span>Carne Village’s defenses were extremely solid. They had shocked the tax collectors who had seen them.</span></p><br/><p><span>It would not be a surprise if another country wanted to use it as a fortress. After all, the Trolls had attacked for precisely that reason.</span></p><br/><p><span>The other side fell silent for once, and both sides hesitated uneasily.</span></p><br/><p><span>“Why aren’t you answering! You’re impostors pretending to be Kingdom troops, aren’t you!”</span></p><br/><p><span>After that panicked shout, she finally got an answer.</span></p><br/><p><span>“…the magic caster called Ainz Ooal Gown came to this village once, did he not?”</span></p><br/><p><span>The image of the village’s savior appeared in Enri’s head.</span></p><br/><p><span>“That magic caster is now an enemy of the Kingdom. As such, we wish to ask you, who are related to Ainz Ooal Gown, about him.”</span></p><br/><p><span>Overcome by surprise, Enri was unable to speak.</span></p><br/><p><span>However ─ the whispers of one of the defense force members worked its way into her ear.</span></p><br/><p><span>“If Gown-sama is opposed to the Kingdom… then isn’t it the Kingdom that’s wrong?”</span></p><br/><p><span>The eyes of the villagers reflected their agreement.</span></p><br/><p><span>Of particular note were those villagers who moved to Carne Village after their original homes had been burned down. Their hatred of the Kingdom for not being able to defend them swiftly turned into respect for the magic caster who saved this village.</span></p><br/><p><span>Be it the gift of the horn that had summoned the Goblins, or the provision of the golems that built the sturdy walls that now protected them, or the maid (Lupusregina) who had saved the village when they were attacked by the Troll, all these had only deepened their trust in Ainz.</span></p><br/><p><span>“Should we really open the gate?”</span></p><br/><p><span>“…But, there’s a lot of them. If we don’t open the gate…”</span></p><br/><p><span>“If we betray him like this after receiving his kindness…”</span></p><br/><p><span>“Wait! They said they just want to ask us something. It doesn’t mean we’re betraying him…”</span></p><br/><p><span>“You think so? It just sounds ungrateful to me.”</span></p><br/><p><span>Everyone’s eyes were on Enri.</span></p><br/><p><span>She understood well the hearts of both sides. Because of that, Enri was unable to choose, and hesitated. Just at this moment, an angry shout came from outside the gate.</span></p><br/><p><span>“Do you understand? If you do, then open the gates right now! If not, you will be treated as traitors to the Kingdom!”</span></p><br/><p><span>Pushed to the limit, Enri shouted back something to try and buy time.</span></p><br/><p><span>“There-there is cow dung everywhere! W-we can’t let the Prince walk into a place like this!”</span></p><br/><p><span>After a brief silence, a calmer voice pierced the air.</span></p><br/><p><span>“Oh, um. Understood. Then how about this. We will enter instead of his Majesty the Prince. We’ll think about what happens later.”</span></p><br/><p><span>There were no more excuses she could give.</span></p><br/><p><span>Enri’s mind had gone completely blank. Not caring what it was, she shouted the first thing she could think of in response.</span></p><br/><p><span>“S-sorry! The dung’s on my hands! I can’t rub it off! Let me wash my hands and I’ll be back!”</span></p><br/><p><span>“―O-oi!”</span></p><br/><p><span>Enri watched the retreating backs of Jugemu and the others. She was worried about how much more time she could buy for them.</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>Barbro’s frustration had reached its limit . He glared at the reporting knight with a look usually reserved for an enemy and not an ally.</span></p><br/><p><span>“Say it one more time, what foolery is this?!”</span></p><br/><p><span>Barbro’s anger overflowed with every word he spoke from between the gaps of his grinding teeth, and the knight repeated himself.</span></p><br/><p><span>“Sir! Carne Village still has not opened their gates.”</span></p><br/><p><span>As he listened to the knight’s calm reply, Barbro was filled with the sudden desire to punch him.</span></p><br/><p><span>However, that would have been foolish. Barbro struggled to control the anger welling up in his fist.</span></p><br/><p><span>This knight included, nobody here was actually sworn to Barbro. In the first place, Barbro commanded no troops. Every man here was under orders from their liege lord, or in the company of their lord. Because of that, he could not strike this knight while his comrades were watching.</span></p><br/><p><span>“―Why is that? Why are those peasants in Carne Village not opening the gate? The land is directly ruled by the royal family! They have a duty to obey me! I order them to open the gate right now!”</span></p><br/><p><span>As his frustration built, so did his agitation, and Barbro no longer picked his words carefully.</span></p><br/><p><span>“I don’t get it! Do they take me for a fool? What the hell are they thinking?!”</span></p><br/><p><span>The villagers were beings far inferior to the First Prince. </span></p><br/><p><span>These beings were now insulting him.</span></p><br/><p><span>As that thought came to mind, his aggravation over the past few months ─ all the niggling little things that had frustrated Barbro ever since the demonic disturbance ─ seemed to have found an outlet, and it exploded forth.</span></p><br/><p><span>The dam burst in an instant.</span></p><br/><p><span>“Traitors! Traitors, all of them! I declare that everyone in Carne Village is a traitor!”</span></p><br/><p><span>The shout sparked a surprised commotion from the men who had heard it.</span></p><br/><p><span>“A moment please! If you do that─”</span></p><br/><p><span>The furious Barbro glared at the panicked knight who had replied.</span></p><br/><p><span>If they designated the village as traitors, they would need to exterminate each and every last one of them, then burn the village down until no trace of its existence remained.</span></p><br/><p><span>But so what?</span></p><br/><p><span>Prince Barbro had given his orders, and he could not understand why his subordinates were not following them. Could it be that these men of the Marquis were looked down on him and thus refused to obey his orders?</span></p><br/><p><span>“So what if I do?! Allowing them to live after disobeying a royal command is a sin!”</span></p><br/><p><span>The royals would be looked down upon if they spared commoners who rebelled against them. Not killing them would eventually result in a loss of their authority.</span></p><br/><p><span>Even on the nobles’ own territory, once any of their serfs rose up in revolt, they would undoubtedly be destroyed. These knights of the Marquis should have known that much.</span></p><br/><p><span>“Please wait, my Prince! The war with the Empire is coming soon. If we kill citizens of the King’s demesne, it will negatively affect the morale of the entire army! I also pray you will look at the fortifications ranged against us. There is no way this is an ordinary village. Although the villagers are not numerous, trying to break down the gate with brute force will be difficult in the extreme. If that is the case, we should handle the situation peacefully and ask them their reasons for not opening the gate after things settle down here.”</span></p><br/><p><span>“…Ask them nicely, then. But I want a few of them to swing for this.”</span></p><br/><p><span>“…It can’t be helped. After all, they did keep the gate shut in defiance of your orders, Barbro-sama.”</span></p><br/><p><span>“I’ll see them hang from the gates! They shall be made into examples for the others!”</span></p><br/><p><span>“It is as you say.”</span></p><br/><p><span>Prince Barbro gazed at Carne Village.</span></p><br/><p><span>As the knight said, the sturdy gate was set into thick curtain walls. Given that the village was right next to the Great Forest of Tob, this might even have been intentional. However, from the way the watchtowers were placed, it resembled a fortress more than a frontier village.</span></p><br/><p><span>Bringing it down would take a long time.</span></p><br/><p><span>Over a thousand soldiers were lined up in front of the gate, shouting at them to open up.</span></p><br/><p><span>If one listened carefully, one could hear the same sounds in the distance, from the rear gate.</span></p><br/><p><span>These shouts were like sparks from a flint, which relit the dark, sticky flames in Barbro’s heart. He was no longer acting rationally.</span></p><br/><p><span>“Oi! Fire the flame arrows!”</span></p><br/><p><span>“F-flame arrows?!”</span></p><br/><p><span>“That’s right. Who knows how long this is going to take if this keeps up. You listen and you listen well, we don’t have time to waste on this village any further! It would be one thing if you could open that gate in a few minutes that would be fine, but you can’t, can you?!”</span></p><br/><p><span>The knight bit his lip and nodded.</span></p><br/><p><span>“Threaten them with flame arrows. The time for playing childish games like standing outside the wall and shouting is over. Now we show them how adults do things!!”</span></p><br/><p><span>As the knight stared, open-mouthed and dumbfounded, a man stormed up from his side.</span></p><br/><p><span>“To think you would disobey his Highness… I can’t believe you’re one of the Marquis’ men. Your Highness, will you permit my men to carry out that attack?”</span></p><br/><p><span>It was Baron Cheneko. Behind him were several of his fellow brown-nosers.</span></p><br/><p><span>Prince Barbro was glad that such foolish men could be useful at times like these. No, he was a noble as well, and if a village in his fief had dared rise up in revolt, he would probably have done the same thing as well. He might even understand Prince Barbro’s position.</span></p><br/><p><span>“…Really now. Then I order you to make it so, Baron. Fire flame arrows at the village… no, this way is better. Target the watchtower. That ought to avoid casualties, right?”</span></p><br/><p><span>“Ohh! Such a merciful decision! As expected of your Highness! Then, you have but to watch us!”</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>“Ane-san! We’re ready! Everyone’s taken cover. We’re the only ones le― what’s that?”</span></p><br/><p><span>Jugemu seemed to sense an oddity in the air around them, and swallowed his words.</span></p><br/><p><span>The defense force members who had remained here were completely opposed to each other. Half of them were reluctantly in favor of opening the gates for the army outside while the other half were fiercely opposed to it. The root of the dispute was whether or not they would be betraying the village’s hero, Ainz Ooal Gown. As a result, it was hard to make a decision.</span></p><br/><p><span>“Actually…”</span></p><br/><p><span>Enri was about to say something to Jugemu when a loud voice came from outside the walls.</span></p><br/><p><span>“―Citizens of Carne Village. Because you did not immediately open the gate when ordered, the fact of whether you are loyal subjects of the Kingdom has been called into question. As such, we will take representatives from among you onto the battlefield, where you will convince Ainz Ooal Gown to surrender. You must prove that your loyalty remains with the Kingdom, and that you are loyal subjects!”</span></p><br/><p><span>The atmosphere started to change. The hatred in their hearts burned so fiercely that it seemed to shake the very air..</span></p><br/><p><span>Enri was no exception.</span></p><br/><p><span>It was true that the villagers were citizens of the Kingdom, and loyal. However, that loyalty paled in comparison to the gratitude they felt to the man who had saved their village for no charge or obligation. After all, when their families, friends and lovers had been murdered, the only one who had reached out a hand to help them was that great magic caster.</span></p><br/><p><span>“There’s no way I’ll let myself be dragged onto the battlefield to get in Ainz-sama’s way!”</span></p><br/><p><span>“Can’t we just hide in the forest and see how things go before making a decision?”</span></p><br/><p><span>Loud arguments like these echoed from all around.</span></p><br/><p><span>However, the one thing they had in common was that nobody wanted to do anything which might inconvenience their hero.</span></p><br/><p><span>It was at this moment that cracking sounds reached their ears from the outside, followed by the sound of several objects whistling through the air. As the sound came closer, streaks of brilliant red light appeared before their eyes, and arrows fell like rain onto the watchtower. The crisp sound of arrows piercing into wood filled everyone’s ears.</span></p><br/><p><span>“…No way…”</span></p><br/><p><span>Enri drew a sudden breath as she realized that the Kingdom was using lethal force on them.</span></p><br/><p><span>Fortunately, nobody was in the watchtower at the time. They must have known that before they attacked. Or maybe―</span></p><br/><p><span>―Maybe they would have fired anyway, even if there was someone inside.</span></p><br/><p><span>“A-Ane-san! They don’t seem to be targeting us yet, but you shouldn’t be standing in their bow range! Over here, quickly!”</span></p><br/><p><span>Jugemu grabbed Enri’s hand as she looked at the watchtower in a daze. He led the unresisting Enri away. She ran with him, but her eyes remained glued to the watchtower.</span></p><br/><p><span>Just as the defense force fell back, the watchtower began to burn..</span></p><br/><p><span>The thatched roof caught alight in an instant and turned into a fire which got fiercer by the second, and the roof collapsed..</span></p><br/><p><span>Everyone in the village could see the destruction of the tower, no matter where they were. Wails of sorrow rose from all around her. One in particular was especially loud. As Enri’s breathing turned chaotic from this revisited trauma, she saw the man who had screamed the loudest, whose voice carried the most anguish.</span></p><br/><p><span>He was a man who had moved into the village.</span></p><br/><p><span>His face was a mix of equal parts hatred and despair. She looked around herself, and many of the immigrants had similar expressions on their faces.</span></p><br/><p><span>Enri remembered.</span></p><br/><p><span>She remembered that their villages had been burned down in a similar way.</span></p><br/><p><span>“They’re the enemy!” the man screamed. “They’re the enemy! If they weren’t the enemy, they wouldn’t be doing this! I want to fight them!”</span></p><br/><p><span>“To hell with the Kingdom! They’re scum who didn’t even help us! And now they want to burn this place down too?!”</span></p><br/><p><span>That shout came from a plump woman.</span></p><br/><p><span>“I won’t forgive them for this! If they want to kill me, go right ahead! I’ll take as many of the bastards down with me as I can! I’ll take revenge for him!”</span></p><br/><p><span>A young man followed up with a cry of his own.</span></p><br/><p><span>Madness and hatred were saturating the air, thanks in no small part to the flame arrows.</span></p><br/><p><span>“…Ane-san. It’s time to make a decision.”</span></p><br/><p><span>Jugemu’s was as hard as steel as he quietly delivered his ultimatum</span></p><br/><p><span>“Eh? …But they’re all so mad they can’t think straight. Shouldn’t we wait before making a decision?”</span></p><br/><p><span>“There’s no time. And nobody can guarantee they won’t go berserk. It’s best if you decide what the village is going to do right now.”</span></p><br/><p><span>That was a reasonable suggestion. The army had already destroyed the watchtower with flame arrows. The next time round, they would probably do something worse. They could not hesitate for a moment.</span></p><br/><p><span>As Enri screwed up her determination, she took a deep breath. She glanced briefly to Nfirea, who was holding Nemu’s hand, and they nodded to her, as though in encouragement.</span></p><br/><p><span>Her chest felt a little warmer.</span></p><br/><p><span>That was the final dose of courage Enri needed.</span></p><br/><p><span>“Everyone! I want to have everyone here decide what we, as a village are going to do! Whatever the decision, I hope you will abide by it!”</span></p><br/><p><span>A great chorus of approval was her answer.</span></p><br/><p><span>“Hands up everyone who wishes the village to do as the Kingdom says!”</span></p><br/><p><span>Not a single hand was raised.</span></p><br/><p><span>As her heart pounded mightily in her chest, Enri shouted once more.</span></p><br/><p><span>“Then! Everyone who wants to fight the Kingdom to their last breath, hands up!”</span></p><br/><p><span>With a thunderous roar, countless hands rose in unison. They did not just raise their hands; their fists were tightly clenched. The looks on their faces showed their determination to resist to the end.</span></p><br/><p><span>Of course, they were afraid. But that was only to be expected. Everyone here had chosen a path that would end in their deaths. Even so, there was something which motivated everyone here that outweighed the fear of death.</span></p><br/><p><span>It was the desire to not repay the kindness and succour they had received with treachery.</span></p><br/><p><span>“Then ― we’ll fight! We’ll all fight! We’ll repay the debt we owe! Jugemu-san! I’ll leave the battle plan to you!”</span></p><br/><p><span>Jugemu swiftly strode forth to stand by Enri’s side.</span></p><br/><p><span>“…I’ve seen your resolve. You’re all going to die here. Are you all alright with that?”</span></p><br/><p><span>The veteran’s words were met with unanimous approval.</span></p><br/><p><span>“You’re able to shout so loudly despite your pale faces. Magnificent. …However, I’m sorry to rain on your parade, after you all loudly proclaimed your willingness to fight to the end. Shouldn’t you let the young ones run away first? After all, if anyone’s going to die, it should be us and the old-timers.”</span></p><br/><p><span>An older man spoke up.</span></p><br/><p><span>“He’s got a point ― but isn’t that impossible? They’ve got men outside both gates. Even if we climbed over the walls, they’d spot us right away.”</span></p><br/><p><span>“Well, that’s true… if we were just running away normally, like you said.”</span></p><br/><p><span>Jugemu grinned evilly as he continued.</span></p><br/><p><span>“We can’t hide and then run. So what we’ll do is, we’ll open the main gate and bait the enemy inside. When they get cocky and come in, we’ll hit them hard. If we can do enough damage, the enemy will gather their dispersed troops and focus on us.”</span></p><br/><p><span>Jugemu looked around.</span></p><br/><p><span>“That said, the enemy may know it’s a feint. Even so, as long as we have enough attack power, the enemy will have no choice but to gather their troops up. Any questions?”</span></p><br/><p><span>“Doesn’t look like it, but Jugemu-san, where should they flee?”</span></p><br/><p><span>“Isn’t that obvious, Ane-san? Into the Great Forest of Tob. I’ll assign Agu and Britta, who both know the forest, to the escape party. I’m sure we can manage for a while without them around.”</span></p><br/><p><span>The villagers had already prepared themselves for death, but it was only natural that they would not want their children to perish with them. Knowing that their children had a chance to survive tempered their fighting spirit.</span></p><br/><p><span>As Jugemu saw addressed them with a grim expression on his face.</span></p><br/><p><span>“Listen up. The first strike is a battle to make the enemy consolidate their troops. The second strike will be a battle to deplete their fighting strength, so they don’t have any left over. The fiercer that battle is, the better the chances for the escapees.”</span></p><br/><p><span>“Hahahaha! Is that all! Ahhhh, well, that’s a relief.”</span></p><br/><p><span>Those words were joined by several laughs. That laughter was not born of desperation or madness ― it was just a simple, relaxed laugh.</span></p><br/><p><span>“As long as my wife and children can be saved, I have no regrets. Now’s the time to repay the kindness Ainz Ooal Gown-sama showed us!”</span></p><br/><p><span>“Ah, that’s right! I’m not going to grow old as a useless excuse for a father!”</span></p><br/><p><span>“Then … who’s going to be in the escape team?”</span></p><br/><p><span>Jugemu looked carefully at everyone as he answered Nfirea’s question.</span></p><br/><p><span>“You and Ani-san will be responsible for protecting the women and children. Then, like I said earlier, we’ll need Britta, Agu, and the other Goblins to help guide them through the woods.”</span></p><br/><p><span>“―Eh?”</span></p><br/><p><span>Enri exclaimed in surprise.</span></p><br/><p><span>As the village chief, she had an obligation to stand with the others. Since she had ordered the villagers to die, then she could do nothing less than stand by their side as they fought. Even so, the villagers spoke before Enri could.</span></p><br/><p><span>Everyone agreed with Jugemu. Just as Enri was thinking of how to refuse, they had already reached a decision without consulting her.</span></p><br/><p><span>“Enri-chan, I’ll leave it to you.”</span></p><br/><p><span>“Please take care of my children. My wife died back then… but at least, the kids…”</span></p><br/><p><span>The villagers’ hands were filled with their thoughts and feelings as they squeezed Enri’s hands. Enri’s eyes grew hot and moist, and then Nfirea stepped up to her side.</span></p><br/><p><span>“Enri, let’s go. Our battle begins after we survive, and that’s a battle we’re not allowed to lose. Besides, Ainz Ooal Gown-sama might come to save us again. When the time comes, it’ll be better if we’re around, as the ones who set foot inside his domain.”</span></p><br/><p><span>“He’s right, you know.”</span></p><br/><p><span>“Jugemu-san…”</span></p><br/><p><span>“That horn you used to summon us… I think you should use it afterwards, don’t you think? If you used it now, it would be like trying to put out a burning house with a glass of water. It would be better if you blew it after all this was over and summoned more of our comrades to help you.”</span></p><br/><p><span>Enri wiped her eyes, which were full of tears.</span></p><br/><p><span>“I got it! I’ll protect everyone’s wives and children! Let’s go! Enfi!”</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>One side of the gate opened slowly.</span></p><br/><p><span>“As I thought, we should have used the flame arrows from the beginning. Well, the follow-up flame arrows were wasted…”</span></p><br/><p><span>Prince Barbro’s face twisted in displeasure. They had wasted too much time. In order to make up for the delay, the men would need to be force-marched. But that was unavoidable.</span></p><br/><p><span>This was all the fault of the Marquis’ men. If he had not given the order to use flame arrows himself, who knew how much more time would have been wasted?</span></p><br/><p><span>Barbro looked to the sky, cursing his misfortune for being saddled with incompetent underlings.</span></p><br/><p><span>He considered the time that would be needed later ― the first thing being how long it would take to hang the villagers.</span></p><br/><p><span>He would hang them on the village’s walls, to show everyone the final fate of anyone foolish enough to defy the royal family.</span></p><br/><p><span>Next, he had to find anyone who had close ties with Ainz Ooal Gown. That might take longer than stringing the villagers up.</span></p><br/><p><span>“Damn. I should have brought an interrogator along. We’ll offer to spare the lives of anyone who cooperates… the problem is the children…”</span></p><br/><p><span>There was no point in letting them live. To begin with, children could not live without their parents, so hanging children with their parents was a form of mercy.</span></p><br/><p><span>“Is there enough rope for all of them? If we could get some from the village, that would be good…”</span></p><br/><p><span>The soldiers slowly advanced to the gate. Pride filled Prince Barbro’s chest as he saw the royal flag advancing at the head of the column. When he ascended to the throne, he would make sure he had ceremonial guards like that.</span></p><br/><p><span>The soldier holding the flag entered the gate ― and was then flung back out.</span></p><br/><p><span>The royal flag which he was holding fluttered to the ground.</span></p><br/><p><span>Shortly after, the gigantic creatures that had sent them flying loomed in the opening of the gate.</span></p><br/><p><span>“―O-o-Ogres?! What are Ogres doing here?!”</span></p><br/><p><span>The completely unexpected development took Prince Barbro by surprise, and he had forgotten the dignity of the royal family as he cried out.</span></p><br/><p><span>Yes. Those were the demi-humans known as Ogres. The soldiers were just as shocked by their sudden appearance as Barbro was. Their mighty clubs sent several people flying with every swing.</span></p><br/><p><span>Amidst a spray of blood and gore, the stricken soldiers flew into the distance and impacted on the ground, which woke their fellow troops from their stupor. They panicked, turned tail and desperately began fleeing. Several more Ogres appeared from behind the gate, as if to pursue them.</span></p><br/><p><span>As the soldiers fell back in a disgraceful rout, they were struck by the Ogres’ clubs and sent flying. It looked like children kicking their dolls into the distance.</span></p><br/><p><span>The reason for their flight ―because there was no way this was any kind of withdrawal― was because these soldiers were all the Baron’s levied troops. They had loosed the flame arrows in order to make them open up faster, and Barbro had granted them the honor of being the first into the village.. Who could have thought that it would have backfired so badly?</span></p><br/><p><span>Just as Prince Barbro was about to frown at the Baron, who had abandoned the very men he led and come scampering back to him, the sound of a horn rang through the air.</span></p><br/><p><span>The Marquis’ knights had raised their lances in unison. It was a textbook motion that showed that they were professional soldiers. However, the men were fleeing and the Ogres were in hot pursuit, and it seemed difficult for them to plunge into the chaotic battlefield.</span></p><br/><p><span>Lances were weapons which showed their power during a charge. They could not shine in a pitched melee.</span></p><br/><p><span>“Why aren’t you shooting yet?!” Barbro shouted</span></p><br/><p><span>Allowing the Ogres to get closer would only increase the losses they would take. It would be better to abandon these soldiers and kill their fellow comrades along with the villagers.</span></p><br/><p><span>Just as Barbro’s aggravation began to mount, the Ogres suddenly began to retreat. They used the fleeing soldiers as meat shields, preventing the cavalry from pursuing, and in the end they fell back into the gate.</span></p><br/><p><span>Barbro’s men received the survivors and then began reorganizing into a proper battle formation. He gripped his reins rightly.</span></p><br/><p><span>He had originally planned to finish this boring mission swiftly, and then rush back to the battlefield to gain glory in battle against the Empire.</span></p><br/><p><span>Now, this unsightly mess was all that was left of his dream.</span></p><br/><p><span>While they had not expected the Ogres to show up, if they simply retreated to E-Rantel with nothing to show for it, his reputation would plunge even further. There would be no catching up with Zanack, the Second Prince and the backup successor, in the race for the throne.</span></p><br/><p><span>Or could it be― had all this been planned out beforehand?</span></p><br/><p><span>He could not help clicking his tongue in annoyance, knowing the surrounding nobles’ eyes were on him.</span></p><br/><p><span>However, he had no time to pretend to be calm. Barbro turned a keen eye on the knight running toward him. He was the commander of the Marquis’ elite troops.</span></p><br/><p><span>“…What the hell was that? Has that village been taken over by Ogres? What’s going on?!”</span><span></span></p><br/><p>\n</p></div>"}