{"title": "Chapter 73 - Volume 10", "id": 73, "volume": 10, "url": "http://boxnovel.org/overlord-ln-chapter-73-volume-10", "volume_title": "Volume 10", "body": "<h1>Chapter 73 - Volume 10</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Overlord Volume 10 Chapter 01</p><br/><p>The Sorcerous Kingdom of Ainz Ooal Gown</p><br/><p>Translator: Nigel</p><br/><p>Editors/Proofreaders: Namorax, JcqC, TaintedDream, rockgollem, Ferro, M, Anon</p><br/><p>Part 1</p><br/><p>The Sorcerer King. The absolute ruler of the Great Underground Tomb of Nazarick and the Sorcerous Kingdom of Ainz Ooal Gown. A being who ruled the 41 Supreme Beings, and the last of them who had remained in Nazarick. At this moment, that entity who should have been enjoying the attentions of his subordinates was curled up on a soft bed, reading a book.</p><br/><p>Said bed had been moved from the Great Underground Tomb of Nazarick to this place ― to the private chambers of the former ruler of E-Rantel, Mayor Panasolei, which had been partially remodelled and converted into Ainz’s own chambers. Ever since it had been moved here, he could no longer detect the fragrance which it used to emanate when it had still been located in Nazarick.</p><br/><p>Perhaps it’s because the bed here doesn’t have perfume sprayed on it, Ainz thought as he leaned his weight onto the bed in question.</p><br/><p>Of course, sleep was completely unnecessary for an undead being like Ainz.</p><br/><p>Indeed, it was only the remnants of his humanity telling his mind that he should be tired. That was why Ainz occasionally did this sort of thing, lying down on a bed to cool down his overheated head and heart. However, that was only a temporary solution. Thus, lying down like this for a long time, like a human being would do, was actually quite meaningless.</p><br/><p>Of course, there were always a few exceptions to the rule.</p><br/><p>For instance ― yes. While he was reading for instance. In particular, when he was mindful of the way others were looking at him.</p><br/><p>It should be daytime soon… oh!</p><br/><p>A weak ray of sunlight filtered in through the gap in the curtains, giving Ainz a rough idea of the time. With that, he stuffed the book he had been reading until now back under his pillow.</p><br/><p>Then, he inclined his skull to look over to a corner of the room.</p><br/><p>He saw a maid there.</p><br/><p>She was one of Nazarick’s regular maids, and she was attending to Ainz today ― to be precise, she had attended to him since yesterday. Currently, she was elegantly seated on a chair with her back ramrod straight. However, that posture had not changed since last night. From what Ainz knew, none of the maids had failed to hold that position.</p><br/><p>Her line of sight was constantly fixed on Ainz, barring several momentary distractions.</p><br/><p>It was a truly indescribable burden.</p><br/><p>Of course, she had certainly not intended to exert this pressure. It was simply because paying close attention to him would allow her to respond immediately to any situation that might arise. However, it made an everyman like Suzuki Satoru want to cry and beg “spare me, please”.</p><br/><p>Nobody would feel comfortable if they were constantly stared at like this, especially if it was a member of the opposite sex doing it. Even if nothing happened, it made him feel like he had left something undone somewhere.</p><br/><p>The most important thing was the way she silently responded to Ainz if he made any movement at all.</p><br/><p>Simply put ― it was a miserable experience.</p><br/><p>Of course, Ainz was an absolute ruler. If he forbade her to do so, she would stop. However, when he thought of the look on the maid’s face if he said so, he could not bring himself to speak the words waiting in his mouth.</p><br/><p>After coming to this world, Ainz had quickly sprung into action in the guise of Momon. That was the first time the maids had surrounded him like this. Even now, they continued to render their service to him with awe-inspiring loyalty. It was because he knew this that Ainz could not bring himself to make them obey him by force.</p><br/><p>Besides, they will get tired of it after a while.</p><br/><p>It had been a month since he had thought that.</p><br/><p>The idea that this state of affairs might continue forever filled Ainz with some degree of unease. Because the maids took 41 days to complete a single shift rotation, he had decided to leave that matter for the future, but that line of thinking had merely kicked the can down the road until now.</p><br/><p>Is this what they call the burden of leadership… administering Nazarick, planning for the group’s future, responding to my subordinates’ wishes… people who stand at the top really are great. No wonder they have such high salaries…</p><br/><p>The people on top do so little and yet collect so much pay. Now that he understood what they were going through, Ainz laughed at his past foolishness. Then, he slowly rose from the bed.</p><br/><p>At this moment, the maid silently rose from her seat as well. It made him feel as though there was a string connecting them.</p><br/><p>How could her movements be so graceful after staying awake through the night?</p><br/><p>“―I’m up.”</p><br/><p>“Yes. Then, your servant shall take her leave. After this, today’s maid will come to take over for me.”</p><br/><p>Ainz did not say anything along the lines of “I’ll leave it to you”, but simply grunted “Umu” and waved his hand to indicate that she should carry on.</p><br/><p>Perhaps I’m being too arrogant, Ainz thought.</p><br/><p>Still, it might be better like this.</p><br/><p>He had sent Hamsuke to ask around, and the maids’ first response seemed to be, “It feels like he’s dominating us, Ainz-sama is the best” or something like that. It would seem they were all masochists, and while it troubled Ainz when he first heard it, after calmly considering the matter, he realized that a ruler needed to act and dress the part. It was what his subjects would wish for.</p><br/><p>Using a company as an example, a boss had to look and act like a boss.</p><br/><p>When he thought about it in that way, Ainz felt that what he had done was what the Sorcerer King should have done. The fact was, when he had been spying on the ruler of the Empire, Jircniv Rune Farlord El Nix, in his spare time, he noticed that the man conducted himself in pretty much the same manner.</p><br/><p>Still, Suzuki Satoru had been a working man, and he felt a little uneasy about not saying something along the lines of, “Thanks for your hard work”.</p><br/><p>“…Then, you should go have a good rest yourself.”</p><br/><p>“Ah! ― Please allow your servant to offer her deepest thanks for your generosity, Ainz-sama!”</p><br/><p>The maid bowed deeply as she expressed her gratitude.</p><br/><p>“However, it is thanks to this item that you so graciously lent me that your servant could stay by your side to attend you without having to rest, Ainz-sama.”</p><br/><p>No, that’s not what I meant, Ainz muttered in his heart.</p><br/><p>It was true that once one put on a Ring of Sustenance, one could go all day and night without any sleep. Still, sitting on a chair and watching Ainz all night should have been nothing short of hellish. Although he was very pleased by their dedication, there was no need for them to go that far.</p><br/><p>At least they should cancel the night shift… the part where they watch me sleep, right?</p><br/><p>As maids, it was only natural for them to faithfully serve their master with their hearts and souls.</p><br/><p>He did not know exactly which of the maids had said it, but he remembered hearing it from one of them.</p><br/><p>Faithfully serve their master, huh. What would you say if I wanted to live as an equal to you?</p><br/><p>Unlike how he felt when he first came to this new world, Ainz was now confident that all his subordinates were absolutely loyal to him. As long as Ainz paid attention to his actions and did not do anything which would disappoint them, there was no chance of their betrayal ― barring outside interference. In that case, perhaps he should change the relationship between them, and put himself on equal footing with the NPCs. That might be a good choice to make, at some point.</p><br/><p>If that happened, Ainz would be free from this life of being a ruler, of having having to rack his brains all day long. In addition ―</p><br/><p>―it would be like before, indeed, just like during the guild days. I wonder if I could go back to that sort of life again.</p><br/><p>Whenever he spoke to the NPCs, he kept imagining his former friends superimposed over them. Because of that, Ainz hoped that he would not have to relate to them in the capacity of a master to a servant, but rather, the way they had in the past ―</p><br/><p>―No, Ainz thought as he mentally shook his head.</p><br/><p>While he did not know what might plant the seeds of disappointment in his subjects, such a dramatic change in circumstances could not possibly be a wise decision. In addition, since he knew that they desired a master-servant relationship with him, it was his responsibility as their master to continue in that capacity. At the same time, as the last person who remained here, he had to do everything he could for the NPCs (the children).</p><br/><p>The maid excused herself to Ainz, and left the room.</p><br/><p>In that moment, Ainz sprang into action. First, he replaced the book under the pillow with another book. The book he substituted in had a very complex title ― just looking at it would make anyone lose the will to continue reading. Then, the book he was reading last night went into his personal pocket dimension ― his inventory.</p><br/><p>After placing the book where it would not be easily stolen, Ainz breathed a sigh of relief.</p><br/><p>That too, was part of his responsibilities as their master.</p><br/><p>He certainly did not want to read those difficult books which made his head hurt all night. If possible, he wanted to read some popular books instead. However, being spotted reading such books would damage Ainz’s dignity as a ruler. Therefore, Ainz was forced to take such troublesome measures.</p><br/><p>Incidentally, he had already taken into consideration the fact that the maids would move the book under the pillow to another location.</p><br/><p>Now that he had finished everything he could do on the bed, Ainz pushed aside the thin gauze canopy which shrouded the bed and rose to his feet.</p><br/><p>Just then, several knocks came from the door. Shortly after that, the maid who was due to take over the next shift opened the door and entered the room.</p><br/><p>As she saw Ainz getting off the bed, she smiled and approached him. It looked like she was the maid assigned to accompany Ainz today.</p><br/><p>“Good morning, Fifth.”</p><br/><p>A blindingly radiant smile dawned on the maid’s face.</p><br/><p>“Good morning, Ainz-sama! I’ll be in your care today!”</p><br/><p>If Fifth had a tail, she would probably be wagging it with all her might. Suddenly, he thought of Pestonya wagging her tail in the past.</p><br/><p>Her maid uniform was the same as the one worn by the previous maid, Fourth. Unlike the battle maids, the regular maids all wore the same uniform. However, their exact appearance varied between each maid ― probably because each maid wearing them was different.</p><br/><p>Ainz recalled something that one of his friends had said so often that it seemed to have taken up residence in his ear: “Simple maid outfits are good, but decorated maid outfits are the best”. There was also a follow-up to that: “In other words, maid uniforms are the best, no matter how they look. Maid uniforms are the greatest invention in human history. Viva maid uniforms~”</p><br/><p>Although Ainz did not know what he meant by “viva”, it was probably some sort of exclamation. It might have also been some personally-invented term of his. In this way, Ainz recalled the memories of his past companions, bit by bit.</p><br/><p>Ainz smiled bitterly ― though his facial expression did not change, of course ― and silently looked at the maid.</p><br/><p>“Ai-Ainz-sama, is, is there some way I can serve you?”</p><br/><p>Fifth blushed as her hands tightly gripped the apron of her uniform. It was then that Ainz realized his carelessness.</p><br/><p>“Forgive me. It seems I was… yes , it seems I was somewhat entranced by you.”</p><br/><p>“―!”</p><br/><p>“Then, let’s go.”</p><br/><p>“―Hieh? Ah, yes. Understood!”</p><br/><p>The maid froze for a moment, but still managed an energetic reply as she fell into step behind him and they left the room.</p><br/><p>Ainz passed through several other rooms. What he saw there could not possibly compare to the scenery in the 9th Floor of the Tomb. Thus, when Ainz had decided to stay here, the Guardians voiced their objections one after the other.</p><br/><p>Point. This place is lacking in taste as a residence for a Supreme Being.</p><br/><p>Point. The defensive capability of this place is lacking and it has inadequate protection against spies.</p><br/><p>Point. Point. Point―</p><br/><p>However, Ainz shrugged all these objections aside and selected this place as his home.</p><br/><p>This was his responsibility as a King ― after all, Jircniv too lived in the Imperial Palace of the Imperial Capital. Or at least, that was what he wanted people to think. The fact was, this place was luxurious enough for Ainz, no, for Suzuki Satoru. His old home was even less worthy of comparison. In addition, his room on the 9th Floor had always been too flashy and too large.</p><br/><p>He did not mind it when it was still a game. However, now that he actually had to live there, he was acutely aware that there was no place for him within its walls. All Ainz wanted to do was to burrow into a corner of the room.</p><br/><p>Ainz led Fifth and the Eight Edge Assassin that dropped down from the ceiling to the dressing room.</p><br/><p>Several regular maids were already there waiting for Ainz. They executed respectful bows to him in unison. Fifth swiftly joined their ranks as well.</p><br/><p>“Ainz-sama, what would you like to wear today?” Fifth asked in a voice that was bursting with energy.</p><br/><p>…Oh, there’s a sparkle in Fifth’s eyes. Come to think of it, didn’t everyone who had this job have the same sparkle in their eyes as well? They do say that ladies like clothing… is that how they express it? Or do they just like coordinating clothes and accessories?</p><br/><p>A steady sensation of fatigue crept over him, but he could not show it. Instead, he went “Umu” in a conceited way ― or at least, that was how it felt when he practiced beforehand.</p><br/><p>Frankly speaking, Ainz did not need to change his clothes.</p><br/><p>His magic robes would not get wrinkled even if he spent all night rolling around on the bed. His body did not excrete any waste products. The dust floating in the air could settle on him, but all he had to do was brush it off. In addition, any place where Ainz went would have already been thoroughly cleaned by the maids. Furthermore, he did not need to eat or drink, and thus he would not get dirty from those activities.</p><br/><p>Wearing the same set of clothes would not pose a problem to him.</p><br/><p>However, none of his subordinates could permit that. Yet it was only to be expected; having their absolute ruler wear the same thing everyday would ruin his image.</p><br/><p>That said, Ainz was not confident in his ability to coordinate his outfit.</p><br/><p>Now, if he was preparing his equipment for battle, after considering his opponents’ abilities and skills and planning out his tactics, he would be quite confident in his ability to select the appropriate loadout to best combat the foe he was facing. However ―</p><br/><p>Well, to some extent, the experience gained by Suzuki Satoru allowed him to comment on whether this necktie would work with that suit. It did not let him say anything about whether this purple robe with silver filigree matched a silver necklace socketed with four diamonds and so on. In addition, he had to select clothes to match a skeletal body.</p><br/><p>However, if he wore a mismatched outfit, people might doubt his sense of style as a leader. That would be like betraying his loyal subordinates. Therefore, Ainz had to give his utmost even in the matter of dressing himself.</p><br/><p>Therein lay a fatal problem.</p><br/><p>Would any of his subordinates comment even if Ainz wore something unsuitable? It was a similar situation to a toupee slipping off the head of the CEO of some large company; nobody would dare say anything.</p><br/><p>That being the case, there was only one alternative left to him.</p><br/><p>“―Fifth, I’ll leave it to you. Prepare a set of clothing that best suits me.”</p><br/><p>“Understood! Leave it to me, Ainz-sama! Your servant will take the greatest care in her choices!”</p><br/><p>You don’t have to get so worked up over this ― well, Ainz thought that, but he had never actually said so to the maids before.</p><br/><p>“I ― I think red suits you well, Ainz-sama! Therefore, I was thinking of using red as a base color for coordinating your attire. What do you think?”</p><br/><p>“…I just said that I would leave that matter to you. That being the case, there’s no need to confirm your choices with me.”</p><br/><p>“Yes! Understood!”</p><br/><p>If he had no confidence in himself, then all he needed to do was hand the task to someone else ― like how he had allowed the maid to pick for him.</p><br/><p>Ainz was very troubled by the crimson robe she had selected, however. The red color was so bright that it almost hurt his eyes, and it was further adorned by many huge button-like gemstones. It might have been acceptable if they were all the same color, but the many gemstones reflected half a dozen different colors of light. In addition, the garment was edged with strange characters embroidered with gold thread.</p><br/><p>―Is this really normal clothing? Can it be considered clothing in the normal sense of the word?</p><br/><p>He felt like a sandwich-board man illuminated by neon lights. He would never have picked this clothing of his own accord. Or rather, Ainz began to wonder why he had ever bought this in the first place. Since he had no recollection of his guild members forcing it upon him, by process of elimination, he himself must have obtained it somewhere.</p><br/><p>Was it a gift? Did I win it in a lottery or some kind of an event? … Still, well, it can’t be helped, huh.</p><br/><p>Even recalling how he had obtained it would not make the crimson robe before him vanish.</p><br/><p>While it would be easy to simply refuse, it would turn the “I’ll leave it to you” that he had told Fifth into a lie. More to the point, Ainz might be the only one who found it embarrassing while everyone else liked it. Or rather, that was quite likely to be the case.</p><br/><p>And, to put it more bluntly, since Fifth had selected this robe, he could blame her if anyone commented on it.</p><br/><p>I really am a terrible boss.</p><br/><p>Ainz knew that this was not something of which he could be proud, and he felt guilty about it.</p><br/><p>Pushing the blame to someone else was not laudable conduct for a boss ― for a superior. Ainz knew this, but even so, he needed some way to preserve his dignity.</p><br/><p>He had to protect himself by sacrificing his subordinates. It could not be helped.</p><br/><p>“―Sorry about that.”</p><br/><p>“Ah, my sincerest apologies!”</p><br/><p>“It’s fine… I was just talking to myself. Pay it no heed. Come to think of it…”</p><br/><p>Ainz decided to choose his words carefully as he asked his question.</p><br/><p>“There’s something I’d like to ask. Do you think this robe is a bit too gaudy for me?”</p><br/><p>“Certainly not! After all, just about anything looks good on you, Ainz-sama! Although I feel that black as a base with dark brown as a secondary color would look good too, wearing such colors all the time would not show off your other virtues, Ainz-sama! All this is to imprint your powerful image into the eyes of everyone who―”</p><br/><p>Ainz interrupted the gushing flow of her words.</p><br/><p>“―It’s fine. As long as it’s suitable, it’s fine. Then, could you dress me?”</p><br/><p>“Understood!”</p><br/><p>Fifth and the other maids got to work.</p><br/><p>As Ainz remained standing, the maids silently removed Ainz’s clothing. The act of having his clothes changed by women, even if his body was nothing more than a skeleton, filled him with a burning shame.</p><br/><p>But of course, such a gesture was a natural act for an absolute ruler.</p><br/><p>At least, it was that way for Jircniv. Ainz had also read the same thing in one of his books.</p><br/><p>Ainz remained still and allowed the maids to work, while he silently looked into the dressing mirror.</p><br/><p>Soon, a red-robed Ainz appeared in the mirror. As expected, it was gaudy. It was nothing but gaudy.</p><br/><p>…No. This world has a pretty divergent sense of aesthetics. For all I know… these clothes might be quite suitable for a ruler to wear.</p><br/><p>He recalled Hamsuke as an example, and quashed his unease.</p><br/><p>“Then, let’s go.”</p><br/><p>Those thoughts went through his head as he strode forth, accompanied by Fifth. How he wished he had the time to sigh.</p><br/><p>♦ ♦ ♦</p><br/><p>The swaying, gaudy red robe advanced toward his office. As Ainz neared the door, Fifth swiftly darted forward and courteously opened it for him.</p><br/><p>Sometimes, he thought of saying, It’s just a door, let me open it. However, as he watched the look on the maids’ faces which said, “Whoa, look at me, I’m working!”, Ainz could do nothing but accept this as a form of automatically-opening door.</p><br/><p>Ainz led Fifth and the Eight Edge Assassin into the office.</p><br/><p>The desk in the center of the room was like the one Ainz had in his own room, and it radiated an air of gravitas.</p><br/><p>It had been brought here from Nazarick, along with his bed. A flag hung in the depths of the room ― the flag of Ainz Ooal Gown ― of the Sorcerous Kingdom.</p><br/><p>Ainz passed through the room, and approached the balcony.</p><br/><p>There was a glass box on the balcony. It was not very large and contained a jungle environment. Ainz inserted his bony finger into the box, which seemed devoid of life, and lifted up a leaf. Hidden beneath was a creature that hid in the darkness to avoid the sunlight.</p><br/><p>Its brightly-colored body was coated with sticky yet slippery secretions, and the front part of its body resembled a pair of human lips.</p><br/><p>Ainz carefully studied the Lip Bug before his eyes.</p><br/><p>“―That’s a good color. You look quite lively.”</p><br/><p>He remembered what he had been once told, which was that color was very important. He also recalled having several Lip Bugs placed in front of him, and being taught to tell when they were most energetic by their color. And indeed; the Lip Bug before him seemed much livelier than the others at that time.</p><br/><p>Ainz picked out a fresh cabbage leaf from a nearby plate.</p><br/><p>“Come, Nurunuru-kun. It’s time to eat~”</p><br/><p>He brought the leaf close to the Lip Bug, which latched onto it with a nom. After he let go of the leaf, the Lip Bug frantically took large mouthfuls out of it.</p><br/><p>Ainz brought out two more leaves, which the Lip Bug readily devoured as well.</p><br/><p>He decided to stop there, because Entoma had told him that overfeeding it was not good,.</p><br/><p>Ainz gently returned the fed and happy Lip Bug to its shaded home in the glass box ― to the place it loved the most .</p><br/><p>“It seemed a little gross at first, but after taking care of it for a while, it’s grown to be quite cute.”</p><br/><p>He was not speaking to anyone in particular, just talking to himself. Ainz had a cheerful smile on his face as he closed the thin box lid. The box was not very sturdy, and the Lip Bug could escape if it really wanted to. The reason Ainz used it was to prove his confidence in being able to take good care of its occupant. That said, it was a mercenary monster spawned with gold, so the question of whether or not it would escape still had no answer.</p><br/><p>Ainz gently cleaned his hand with a nearby cloth, and after finishing all his tasks for the morning, he took a seat in his chair. He leaned his weight onto its back and let his body sink in deeply.</p><br/><p>…Ah, work. There’s no official working hours, but my heart still sinks around this time. I guess old habits die hard.</p><br/><p>The desk did not have so much as a speck of dust on it, to say nothing of documents.</p><br/><p>It was completely unlike Suzuki Satoru’s desk.</p><br/><p>All this was because he did not need to work through the night. Ainz’s job was to make the big decisions, not worrying about the fine details. After he decided the overall direction, his subordinates went into action.</p><br/><p>…Still, this is why it’s so difficult. For the first time, I realise that the difficulty of a job is determined by how much responsibility it places on oneself. It’s more mentally than physically tiring… and it’s certainly more stressful. Ah, is it time to start work?</p><br/><p>There was no need to look at a watch.</p><br/><p>At that precise moment, a knock came from the door. Fifth ― who was standing at attention by the door ― verified the identity of the caller.</p><br/><p>“Ainz-sama, it is Albedo-sama and the Elder Liches.”</p><br/><p>There was respect in Fifth’s voice, because these Elder Liches were Ainz’s personal creations.</p><br/><p>“I see. They may enter.”</p><br/><p>Fifth stepped away from the door to make way for the visitors. Albedo entered the room at the head of six Elder Liches.</p><br/><p>“Good morning, Ainz-sama.”</p><br/><p>After Albedo’s greeting, the Elder Liches bowed their heads deeply.</p><br/><p>“Umu, good morning, Albedo. It seems today’s weather is quite fine.”</p><br/><p>“Indeed it is. I have reports that it will be sunny all day ― of course, if it is your wish as the ultimate ruler of this world, we can produce any kind of weather you desire. Shall we proceed, Ainz-sama?”</p><br/><p>This was just using an irrelevant topic to begin a conversation, but he did not expect her to start off with a suggestion like that.</p><br/><p>“That will not be necessary. I like changes in the weather. Sunny days are fine, the roaring of thunder on rainy days is to be savored, and the gentle falling of snow is quite intriguing. One could say that one could draw a day’s entertainment just from watching the natural changes of the weather.”</p><br/><p>Ainz did not dislike this world’s changing climate. In this unspoiled world, he found that he understood his former comrade Blue Planet’s words: “The rain was originally Nature’s blessing.”</p><br/><p>It was best to let nature remain natural.</p><br/><p>“Yes, understood… Of course, I sensed that you had no desire to alter the weather, but I had to ask to be sure, Ainz-sama. After all, you are not the sort of leader who would directly order us around to satisfy your desires.”</p><br/><p>“…Is that so? It doesn’t feel like that to me…”</p><br/><p>Ainz thought about it, but he could not come up with anything he particularly wanted. When he was still Suzuki Satoru, his mind was filled with thoughts of YGGDRASIL. After his body had become like this, it had only gotten worse. Although he was not sure if that was a side effect of becoming an undead creature, the chance of always having been this way was quite high. If he had to speak of a desire for anything, it would be a desire for collecting rare items. And also―</p><br/><p>Ainz smiled in loneliness, and gently shook his head.</p><br/><p>“No, it might be just as you say. However, that is simply because there is nothing I truly want. If I develop any desires, I will naturally give the appropriate orders at that time.”</p><br/><p>“When the time comes, I hope you will allow me, as the Guardian Overseer, to select the people who will immediately respond to your desires,” Albedo replied as she lowered her head. When it came back up, her face appeared somewhat flushed. “However, your clothes today are quite spectacular. They are extraordinarily radiant. No, they shine this brightly because you are wearing them, Ainz-sama.”</p><br/><p>Albedo continued lavishing her praise on him.</p><br/><p>The radiance of which she spoke of was probably the gemstones which seemed to substitute for buttons, since his skull did not reflect the light. Ainz nodded as he thought about this.</p><br/><p>“Is that so, then I must thank you for that, Albedo.”</p><br/><p>“You are too kind. I was simply stating the obvious. Ainz-sama, you are truly―”</p><br/><p>Ainz raised his hand to interrupt Albedo as she excitedly prepared to continue. He had the feeling that letting her go on would drag the conversation out for a long time.</p><br/><p>“Let’s leave that matter aside for now. Then, what of the documents you and the others were handling yesterday, Albedo?”</p><br/><p>“Yes.”</p><br/><p>Albedo puffed up her cheeks in an adorable manner, and the Elder Liches followed her directions and placed their documents on the table.</p><br/><p>The pile of documents stacked one on top of the other came to a sizable thickness. The files themselves did not contain much in the way of proposals, but they had a lot of supporting documents attached to them. Much like how he needed data from many fields in his old job, it would seem that this was all in preparation to deal with a complicated problem.</p><br/><p>He had prepared his heart for this. Ainz had spent all morning psyching himself up and stiffening his resolve for this moment.</p><br/><p>Suzuki Satoru was a mere employee, and he was not the sort who interacted with the company’s operations. If asked whether someone like that could manage an entire country, Ainz would have confidently answered “no”. Or rather, even an operations manager would find it very difficult to run a country.</p><br/><p>What made it worse was that Ainz was an absolute ruler. Even if there were any mistakes in the words he spoke, his subordinates would rally together to turn them into reality.</p><br/><p>Was there anything scarier than that? A single word from Ainz might lead to a mass suicide.</p><br/><p>That being the case, what should he do?</p><br/><p>The answer was very simple. Much like his clothes, he had to hand that responsibility to capable people.</p><br/><p>Being able to skilfully allocate one’s subordinates according to their strengths was also an essential quality in a boss.</p><br/><p>That said, there were also problems with completely delegating everything to others. Indeed, he could rest assured if everything was left to Albedo’s care. However, he was a king, not a mere figurehead. As someone in a high position, being a superior accordingly entailed bearing a superior’s responsibilities.</p><br/><p>There were some tasks which could not be escaped by saying “I know nothing.”</p><br/><p>As such, Ainz began carefully reading the stack of documents from top to bottom, placing the royal seal on each one.</p><br/><p>After rhythmically stamping several documents, Ainz paused, having selected one of them as the day’s target. He opened it to peruse its contents. And then―</p><br/><p>…I don’t get it, after all. Does this have something to do with material resources? Is this very important? Do the Elder Liches really understand? …Well, they were all made by me… how can this difference in ability be explained ― although, reading all this is really tiresome, it’s just like reading legal documents…</p><br/><p>Because there were cross-references to other pages, there were many repetitions of these few words which required repeatedly flipping back and forth between pages. The final point was based on the previous conclusion in order to arrive at a negative judgment. Moreover, because many negative statements appeared in the text, interpreting the content was very difficult.</p><br/><p>“―Albedo.”</p><br/><p>“Yes, Ainz-sama! Has something caught your attention?”</p><br/><p>“No, it’s unrelated to this, but I thought of something. How goes the enactment of laws?”</p><br/><p>This country was called the Sorcerous Kingdom, but it had not passed any unique legislation, instead continuing the use of the Kingdom’s old laws.</p><br/><p>“Yes. This is simply a draft for now. If we pushed the new laws too aggressively it could lead to widespread discontent. Thus, we are unsure whether or not to do so.”</p><br/><p>These words sounded strange when they came from Albedo, who cared nothing for humanity. Still, Ainz could not help but pat his chest in relief.</p><br/><p>“Although I’ve discussed it with Demiurge before… the laws of the Kingdom simply do not grant enough power to an absolute ruler such as yourself, Ainz-sama. We are currently considering simply retaining the first edict of the Kingdom’s law and then pushing it through by force.”</p><br/><p>“While I am more confident in other areas…”</p><br/><p>That was a bald-faced lie ― Ainz had no confidence in just about everything.</p><br/><p>“I regret to say that I am not versed in the ways of the law. Do as you see fit. You have my complete trust.”</p><br/><p>“Yes! I understand.”</p><br/><p>Albedo had a look of delight on her face. If Ainz looked closely, he could see her wings quivering behind her. She ― and Demiurge, for some unknown reason ― seemed to consider Ainz to be a genius who was always one step ahead of them.</p><br/><p>Thus, when Ainz said he did not know or something along those lines, he could keenly understand the joy which they ― who were made as highly intelligent beings ― felt at being able to validate their existence.</p><br/><p>“Still, there’s no need to lie about not understanding the law…”</p><br/><p>“No, it’s true. I’m not adept at dealing with matters of the law.”</p><br/><p>“I see… that must be how you see it, from the perspective of a supreme leader who has never been bound by any laws. I understand your meaning.”</p><br/><p>Ainz felt that he was being misunderstood, but he decided to ignore the matter. After all, he had no idea how to explain it to her. Instead, he simply smiled. This feeling was only vaguely familiar to him, but that might be how children felt when proudly showing off their talents to their parents.</p><br/><p>“Is something wrong?”</p><br/><p>Albedo’s look of surprise only made Ainz that much more delighted. Still, it would be rude for the joy to be all his.</p><br/><p>“Forgive me, but when I saw how happy you were, I was struck by how cute you looked… how shall I say this, umu, it’s somewhat difficult to explain.”</p><br/><p>As he said that, there was a brief burst of movement from the Eight Edge Assassins on the roof, but then they stayed still.</p><br/><p>“Ah~, how embarrassing.”</p><br/><p>Albedo pressed her hands to her cheeks. As Ainz saw how she blushed, he realised how uncomfortable he must have made her feel, and with a slight cough, he decided to study the documents before him instead.</p><br/><p>It would seem that his way of treating the NPCs as the children of his friends made him say things which embarrassed them.</p><br/><p>He felt a little guilty about his rudeness, but in the end, he stamped the final document instead. With that, one task was complete.</p><br/><p>He handed the files to Albedo, who was covering her mouth with her hand. She in turn handed them to the Elder Liches.</p><br/><p>“Then, let’s begin the usual. These are the proposals we will screen through today.”</p><br/><p>Ainz opened his cabinet and took out a stack of papers. These were suggestions and opinions collected from everyone in Nazarick in order to aid in the development of the Sorcerous Kingdom.</p><br/><p>After reading them, Ainz would copy these suggestions out and read them out for Albedo to hear around this time every morning.</p><br/><p>“There’s no need for you to waste your valuable time with petty tasks like writing them all down, Ainz-sama.”</p><br/><p>“No, because there might be some suggestions in there which are directed at me. In addition, my body does not require sleep. It would be a waste of time if I did nothing.”</p><br/><p>That too was a lie. Or rather, it was true that he would be left idle if he did nothing. However, he could spend that time on things like reading, bathing, practicing his acting skills and simulated combat. Even so, he still had to do this by hand because Ainz was sneaking in his own suggestions among the others.</p><br/><p>Ainz had to do this because if he made those suggestions directly, his subordinates would force themselves to make them happen, even if they were impractical. That could lead to tragic consequences.</p><br/><p>Therefore, by anonymously submitting his suggestions, he hoped that Albedo, as an impartial third party, would judge them by their merits alone. In addition, by not disclosing the names of the suggesters, Ainz’s own abilities would not be called into question, which was like killing two birds with one stone.</p><br/><p>Ainz began reading the uppermost suggestion out loud.</p><br/><p>“Muu… ‘I believe that we need child education services which can scout out talented individuals and cultivate them. This way, we might be able to strengthen Nazarick. Even if it does not work out, we can still use it to develop technologies for ourself, which can also be used as a foundation to strengthen Nazarick as well.’ Something like that.”</p><br/><p>Ainz looked at Albedo, who was standing with her eyes facing forward.</p><br/><p>“The benefits are clearly outlined, and it is an excellent suggestion. One can sense the suggester’s excellence through it. It might be good to circulate this as a model for others to study.”</p><br/><p>After that round of praise, Ainz resumed his usual stern countenance ― though of course his face did not move. “Come to think of it, who do you think wrote that?”</p><br/><p>“I believe that would be Yuri Alpha.”</p><br/><p>It was an instant answer. Ainz felt the same way as well.</p><br/><p>“I agree. It should be Yuri’s suggestion. Then, Albedo, what do you think of that suggestion?”</p><br/><p>“It is utterly foolish. Swine should live like swine and die after giving everything they have for their breeders. There is no need for them to live in any other way. Since there is no meaning in allowing them to live differently, there is no point in allowing them to choose differently.”</p><br/><p>“Well, that was quite a harsh way of looking at it, but I do agree, to an extent. One needs basic education in order to serve as a cog to turn in society’s wheels. This is how people should live, age and die. Allowing technology to spread would only threaten our power ― umu?”</p><br/><p>“Ainz-sama, are you alright?”</p><br/><p>“I recall having heard these words before. Someone said them to someone else, but who? Narberal and… ah, Lupusregina. When she was asking about the healing potions… I guess there is no need to tell you since you already know, Albedo. Oh, what a gaffe, please pay it no heed.”</p><br/><p>“Of, of course not, I believe that I need to understand your profound insights, Ainz-sama. Please, share them with me.”</p><br/><p>“Is, is that so.. Well, although it embarrasses me somewhat, I can’t be the only one sharing my thoughts. If you are unhappy with anything you hear, please feel free to correct me.”</p><br/><p>There was nothing more embarrassing than acting like a know-it-all in front of someone he knew well. With the worry of being treated like an idiot in his heart, Ainz decided to share his thoughts on the matter.</p><br/><p>Knowledge, education and information were the basic weapons of humanity ― which also included non-human beings in this world. As a nation’s knowledge increased, so would its power, but on the flip side, so would resentment at knowing they could not have everything.</p><br/><p>Thus, a ruler had to consider whether or not to arm the masses with the weapon called knowledge, because that weapon might someday be pointed at the ruler himself.</p><br/><p>In the game called YGGDRASIL, Ainz had learned the importance of possessing information. This was why he had brought the two Bareare herbalists to Carne Village, where he could keep an eye on them, and had them make potions there. This was so that he could monopolize the fruits of their research and hoard any knowledge gained from it.</p><br/><p>From Ainz’s point of view, those who were ruled over ought to act the part, living and dying in their ignorance. However one needed to develop new technologies as a nation’s power increased. In the end, the question was at whom would the spears of knowledge be pointed.</p><br/><p>“In short, we should only share our new technologies with those who are absolutely loyal to the Great Underground Tomb of Nazarick. We will give the common folk outdated technology which poses no threat to us. The “Fruit of Knowledge” only has value when we alone possess it.”</p><br/><p>After he got to that part, he sneaked a peek at Albedo, to make sure she did not doubt or distrust him.</p><br/><p>“And now, this is what I’m really getting at. Albedo, in contrast to what I just said, I think we should accept this suggestion.”</p><br/><p>Albedo’s eyes went wide for a moment.</p><br/><p>“May I know what led you to that conclusion?”</p><br/><p>“Sentimentality. In addition, I feel Yuri has a point.”</p><br/><p>“Still, I feel there are too many demerits to that suggestion… or are you saying that you intend to test it out in the outskirts? Once you seal off all information leaks and then commence education through brainwashing, the merits do start to appear.”</p><br/><p>“We will not do that. Though this might deviate somewhat from Yuri’s suggestion, we shall found an orphanage in this city.”</p><br/><p>While Ainz had been living here as Momon, he had heard of the orphanages run by the temples. He had immediately hit on the idea of founding an orphanage in the name of Ainz Ooal Gown.</p><br/><p>“In any event, we should consider the possibility of Nazarick’s technology leaking into the outside world. It should be fine if we run a regular orphanage and limit the knowledge we teach there to those close to us. If we find talented individuals there, we can then consider what to do with them.”</p><br/><p>“…I see. That arrangement should not pose any problems.”</p><br/><p>“Then, I intend to use widows for the orphanage staff.”</p><br/><p>“The women who lost their husbands in the battle where you demonstrated a fraction of your almighty power. It serves as financial aid of sorts for those women who are struggling below the poverty line. And indeed, such aid will only improve the popular opinion of yourself… as expected of you, Ainz-sama.”</p><br/><p>“Umu, though if we only act after Momon tells us of the widows’ plight, then only his reputation will improve, and not mine. Thus, we must take action swiftly, before anyone can come to him for help. In order to accomplish this… I order Pestonya and Nigredo to be released from their confinement.”</p><br/><p>Ainz sensed a faint glint in Albedo’s eyes.</p><br/><p>“Forgive my directness… but if you grant amnesty to those who have been judged guilty of disobeying your command and forgive them, I fear it might disrupt the order in Nazarick.”</p><br/><p>“Did we not place them in confinement for that?”</p><br/><p>“That is far too mild a punishment. Your will is everything to us, Ainz-sama. The crime of disobeying your command is utterly unforgivable. Your servant submits that they should be relieved of their heads as a warning to others.”</p><br/><p>“If it’s for those―”</p><br/><p>Ainz wanted to say that it was a petty matter, but the women were all motivated by their reverence for Ainz ― one of the 41 Supreme Beings. If would be quite tragic to deny their loyalty.</p><br/><p>Still, that was why he had to forgive the two of them. Their personalities were created by Ainz’s past friends. Thus, Pestonya and Nigredo’s actions could be said to speak for his friends.</p><br/><p>Ainz knew that if he gave Albedo an order, she would obey it without question. However, that was a last resort for him. First, he had to try to persuade her with words.</p><br/><p>“―The fact is that allowing those orders to leak out to the outside world would be problematic. Anyone would be able to connect the dots and trace the incident in the Royal Capital back to Nazarick, hiding in the shadows. That was why even the young children had to be eliminated.</p><br/><p>However, the two of them were only trying to defend those infants who had no memories of the incident, which meant that there was no need to eliminate them. One could also say that they accurately understood my intentions.”</p><br/><p>“They were simply twisting the facts for their own convenience. Their actions are unforgivable.”</p><br/><p>“Albedo―”</p><br/><p>He understood Albedo’s feelings as the Guardian Overseer. That was why he had to think as hard as he could to convince her.</p><br/><p>Ainz smiled; a troubled, bitter smile. Of course, his expression did not change.</p><br/><p>“Ainz-sama, that look of yours is too unfair…” Albedo muttered, with somewhat pink cheeks. Ainz patted his face, as if to check.</p><br/><p>“Oh, really now?”</p><br/><p>“Mm, that is…”</p><br/><p>Albedo sighed powerlessly, and let her head droop down. Haa~, she went as she exhaled deeply.</p><br/><p>When she lifted her head up again, she had returned to normal.</p><br/><p>“I understand. Nothing is more important than your wishes, Ainz-sama. They are everything to me. Please direct me as you see fit.”</p><br/><p>“I do not want you to obey me because of your feelings. I want you to obey me because it is the sensible thing to do.”</p><br/><p>“That will not be a problem. In all likelihood, nobody in Nazarick will object to freeing those two other than my previous self.”</p><br/><p>“Is that so… then that’s good. Put the two of them in charge of running the orphanage.”</p><br/><p>“I understand. I shall convey your instructions to them.”</p><br/><p>“I’ll leave that to you. Then ― the next suggestion.”</p><br/><p>Ainz murmured to himself. The next suggestion was one he had written.</p><br/><p>“…Ahem. Well, this isn’t a terribly good suggestion… eh, it can’t be helped.”</p><br/><p>Ainz snuck a peek at Albedo’s expression and continued to speak.</p><br/><p>“Let us make a uniform for athletic activities (gym clothes) to strengthen the unity of Nazarick. What do you think?”</p><br/><p>Just as he finished speaking, Albedo furrowed her brows in anger.</p><br/><p>“…If there was a lower limit to the definition of the word ‘inferior’, that idea has certainly managed to break through it. Who made that suggestion, anyway?”</p><br/><p>Ainz made a supreme effort to check his impulse to go, “I’m sorry” and instead took on a troubled expression.</p><br/><p>“Er, that ― I’m not quite sure. I disposed of the original sheet of paper.”</p><br/><p>“I cannot imagine how put upon you must have been. How could anyone waste your precious time with such an utterly idiotic suggestion, Ainz-sama? Let us immediately launch an investigation to root out this person and determine the appropriate punishment.”</p><br/><p>“…No! There’s no need for that! Listen, Albedo! You must not do that, no matter what!”</p><br/><p>Though he was going “awawawa” in his heart, Ainz managed to thrust out his chest:</p><br/><p>“I have told everyone in Nazarick that in order to encourage feedback from many angles, I will not censure them for any kind of suggestion made to me. If you rebuke them for it, that would turn my words into lies. That would also mean that everything I say in future would also be a lie.</p><br/><p>In addition, it is difficult for frightened people to give their opinions… therefore, I hope that once you leave this room, you will forget that suggestion.”</p><br/><p>“Yes, I shall. It is as you say, Ainz-sama.”</p><br/><p>“Good, good. You must do that.”</p><br/><p>Ainz was deeply grateful for the fact that his body could not sweat. If that was not the case, the floor would have probably been drenched by now. However, despite the marvelous constitution of his body and mind, the word “inferior” stuck deep in his heart, leaving a wound that would not heal for a long time.</p><br/><p>“…Ainz-sama, I have a proposition. In the future, please allow me to select the suggestions. That way, you will not be troubled by such foolish suggestions a second time.”</p><br/><p>“Guh… no, there’s no need to trouble you with that. Besides, if you selected all of them, then my role would merely be to sign off on your choices. Our discussions here would then become meaningless.”</p><br/><p>“Ah, yes, that’s right, Ainz-sama. We must work closely together and do it.”</p><br/><p>Albedo’s wings flapped, and the Eight Edge Assassins overhead squirmed once more.</p><br/><p>“All, all right. Since you understand, let’s move on to the next one, Albedo.”</p><br/><p>Personally, he did not think that suggestion was unworkable, but the mood in the air was not one which would allow him to bring that up, nor did he feel confident enough to mention another similar topic.</p><br/><p>“Then, next―”</p><br/><p>Just as Ainz was about to continue reading, a knocking sound came from the door.</p><br/><p>Both of them looked at Fifth. She bowed slightly, and then went to see who the visitors were.</p><br/><p>A lively child’s voice came through the gap in the door, along with an almost inaudible voice that lacked any confidence.</p><br/><p>…Isn’t this the first time those two have come here at this hour of the day? Did something happen? If that’s the case, then it’s probably good that Albedo is here too.</p><br/><p>Since Ainz already knew who the visitors were, he could have immediately allowed them entry. However, Fifth seemed quite happy to be performing her duties, and granting them permission to enter before she could report their names would mean having to interrupt her.</p><br/><p>Going over her head might make her lose the motivation to work. It was important for people on top to understand and take these matters into account.</p><br/><p>I guess Jircniv does this too. After all, he leaves a lot of things to his maids, Ainz thought, as he commented on the role model as a king whom he had been constantly studying.</p><br/><p>At some point, I should have a relaxed chat with him about the burdens of rulership.</p><br/><p>“Ainz-sama, they are Aura-sama and Mare-sama.”</p><br/><p>Now that she had completed her orders, Ainz indicated that the two of them were permitted to enter his office.</p><br/><p>The door opened, and a pair of petite dark elves stepped in. Their beaming smiles did not seem to imply that anything troublesome had happened, and Ainz was relieved.</p><br/><p>“Morning! Ainz-sama!”</p><br/><p>“G-g-good morning, Ainz-sama.”</p><br/><p>“Ah, good morning. The two of you look quite lively today.”</p><br/><p>The two of them greeted Albedo as well. Aura went around the table and stationed herself next to Ainz.</p><br/><p>Once she was very close to him, she stuck out both hands, making two V-for-Victory signs.</p><br/><p>“Hm.”</p><br/><p>She did not say anything to the baffled Ainz, merely raised her hands and made the signs.</p><br/><p>Her sparkly eyes, so full of anticipation, trained themselves on him, and then she began hopping from foot to foot.</p><br/><p>After realising what she wanted, Ainz pulled his chair back, grabbed Aura under the armpits, and picked her up.</p><br/><p>“What, what are you doing, Ainz-sama―”</p><br/><p>Ainz paid no head to Albedo’s strangled cry of surprise. Instead, he turned Aura a full 180 degrees, facing her back to him, and then he sat her down onto his right thighbone.</p><br/><p>Unlike a normal thigh, bones were hard, so Ainz had to place her parallel to it, allowing Aura’s soft rump to cushion her.</p><br/><p>“Ehehe~”</p><br/><p>It was a somewhat bashful, yet thoroughly delighted laugh from Aura, and Ainz returned it with a smile. Then, he turned and beckoned to the nervous-looking Mare.</p><br/><p>He picked up Mare as he approached, and placed him on his left thighbone.</p><br/><p>“Ah, um, Ai-Ainz-sama, what, what about me?”</p><br/><p>As Ainz wondered whether he should get them a cushion of some sort, it was Albedo’s turn to speak nervously. However, it was too embarrassing to let a grown woman sit on his thigh ― his thighbone.</p><br/><p>“No, that… I can’t.”</p><br/><p>“But, but, the two of them…”</p><br/><p>“…Albedo, these two are just children. You’re an adult, are you not?”</p><br/><p>For a moment, he thought he saw something behind Albedo ― a flash of light that was the physical manifestation of the blow she had just suffered. Although he felt a little sorry for her, embarrassment was still embarrassment. Besides, if he actually followed through with the act, it would be sexual harassment.</p><br/><p>“Then, you two. What’s going on?”</p><br/><p>The fortress in the Great Forest of Tob ― the fake Nazarick, or perhaps a resource depot ― had been completed for now.</p><br/><p>Aura’s next task was to conceal the fortress and strengthen its defenses.</p><br/><p>The original plan was to flee there if enemies showed up and conceal the real Nazarick, but Jircniv now knew the location of the Great Underground Tomb of Nazarick.</p><br/><p>That being the case, it would now serve as a bunker and a resource depot.</p><br/><p>Mare, on the other hand, had been tasked to dig an underground tomb on the outskirts of E-Rantel.</p><br/><p>There were no plans to utilize that facility right away. It was simply because he had the manpower to spare but nowhere to use it.</p><br/><p>The use of humans for such work would incur labor costs, but golems and the undead did not have that problem. In addition, they could use Mare’s magic to produce simple stonework.</p><br/><p>Incidentally, among the other Guardians, Shalltear was assigned to [Gate]-related teleportation duties and the security of Nazarick. Cocytus was in charge of the Lizardman village and its nearby lake. Demiurge, on the other hand, was on an assignment to the Holy Kingdom.</p><br/><p>In other words, all the Guardians in E-Rantel were now in this room.</p><br/><p>Since their tasks had already been allocated, what were the two of them doing here?</p><br/><p>Aura cheerfully answered Ainz’s question:</p><br/><p>“We came here to see you, Ainz-sama!”</p><br/><p>Her innocent words brought a beaming smile to Ainz’s face.</p><br/><p>“I see. Well, I am very delighted to see the two of you as well.”</p><br/><p>Ainz patted Aura’s head. Aura seemed to find it very comfortable, and nuzzled back into Ainz’s hand. It was kind of like playing with an adorable puppy.</p><br/><p>“Then, then. Ainz-sama, w-what are you doing? I, I hope we aren’t causing you trouble…”</p><br/><p>“Yes―”</p><br/><p>“Certainly not. How could meeting you be any trouble to me?” Ainz gently replied to Mare.</p><br/><p>Ainz then turned to Albedo.</p><br/><p>“Forgive me, Albedo. I got sidetracked just as we were about to start on a new topic. Ah, that’s right, I feel the same way about meeting you as well.”</p><br/><p>“Y-yes,” Albedo said, her face turned as red as an apple as she pouted and tried to look serious.</p><br/><p>“Ainz-sama!”</p><br/><p>What is it? Ainz thought as his eyes went wide.</p><br/><p>“Ogyaa!”</p><br/><p>Ainz wondered if he had misheard something. What did she just say?</p><br/><p>As though to inform Ainz that his hearing was fine, Albedo went “Ogyaa!!” again, in a terribly shy voice.</p><br/><p>…She’s probably trying to act like a baby. No, the scary thing would be if she tried to act like anything else. Still, why is she doing this? Is she tired from working too hard? Ah! This might have something to do with Nigredo and releasing her from confinement.</p><br/><p>Confusion overwhelmed Ainz, despite his undead body, and at the same time, Mare began shifting uneasily in his seat.</p><br/><p>“That, um, it, it’s fine for me, so, um, I should let Albedo-sama…”</p><br/><p>Those words were like a revelation to him.</p><br/><p>Just now, I said that it was fine because they were kids, so as an adult, you ought to be able to bear with it. Is that why she’s pretending to be a kid now?</p><br/><p>Still, why a baby? And besides, letting Albedo sit on my thigh is too…</p><br/><p>That said, she’s gone to such embarrassing lengths to put herself forward. I can’t just overlook that, both as a superior being and as a man. In addition, Albedo is one of the children, like Aura and Mare. I must be fair to her.</p><br/><p>“Forgive me, Mare,” Ainz said. Having resolved himself, he let Mare alight from his leg and beckoned Albedo.</p><br/><p>“Come here, Albedo.”</p><br/><p>“Yes!”</p><br/><p>Albedo’s shyness from earlier vanished like mist in the morning sun, replaced by a look of anticipation which a puppy might have just before going for a walk. In an instant, Albedo moved to Ainz’s side.</p><br/><p>Albedo made the V-signs as well.</p><br/><p>It was somewhat difficult for Ainz to do while seated, but he nevertheless placed his hands under her armpits and lifted her up.</p><br/><p>“…Um, sorry about this. Would you mind just sitting down as you are?”</p><br/><p>“Of course! Understood!”</p><br/><p>Albedo took Mare’s place on Ainz’s left thigh, and shifted herself in a coquettish manner.</p><br/><p>The first thing Ainz felt was her softness. Unlike the children, it was the softness of a mature body. Then, her warmth flowed into him, which made him itch a little.</p><br/><p>Even so, she’s still really soft!</p><br/><p>She was a level 100 warrior, but he had no idea where her muscles had gone. One could phrase it in a less polite way and wonder if she was a mollusc.</p><br/><p>“Kufufufu~”</p><br/><p>He heard Albedo’s quiet laughter.</p><br/><p>A fragrance wafted over from Albedo’s long hair. It tickled Ainz’s nose.</p><br/><p>“―Mm?”</p><br/><p>In this moment, something sparked inside Ainz’s nonexistent brain.</p><br/><p>This scent is familiar; where have I smelled it before? Albedo’s clothes? No, her perfume?</p><br/><p>Ainz was quite sure he had encountered the scent Albedo was currently emitting in the past. However, he had no idea where he had first picked it up, and he could not remember the details.</p><br/><p>“Mmm… Albedo. Are you using some kind of perfume?”</p><br/><p>“Yes, I do use perfume. Does it displease you?”</p><br/><p>“No, of course not, it smells nice.”</p><br/><p>Albedo hurriedly turned her face towards Ainz. Her bulging eyes frightened Ainz a little.</p><br/><p>“Really, Ainz-sama! If you’d like, how about sniffing me? An hour would be fine, a whole day would be fine too!”</p><br/><p>“No, besides, an hour would be too…”</p><br/><p>Still, no matter what he said, it was a fact that he was quite interested. Besides, if he sniffed her, he might be able to recall more details about that scent.</p><br/><p>“Then, may I sniff a little?”</p><br/><p>Ainz carefully brought his skull close to Albedo and inhaled her aroma. Since he was closer to her than just now, he could smell that pleasing scent more clearly. As he thought, it was familiar, but he still could not place where he had encountered it before. Just as Ainz was racking his brains to solve the mystery in his head, a cold voice reached his ears.</p><br/><p>“…Ainz-sama.”</p><br/><p>Although he had no idea who it was for a moment, that voice clearly belonged to Aura. Ainz nervously turned to look at her, and saw that Aura was pouting with her cheeks puffed with.</p><br/><p>“That looks kind of perverted.”</p><br/><p>“Ah, sorry…”</p><br/><p>She did have a point…</p><br/><p>Ainz cursed himself for doing something like this in front of the children. This would have a bad effect on their sexual education.This was why she had addressed him in the same tone that his old friend did when she was angry at her little brother.</p><br/><p>“Th-then, Albedo, Aura. Please get up. Oh, Albedo, let’s continue discussing that matter from just now.”</p><br/><p>However, there was no movement.</p><br/><p>Both of them remained still. They were waiting for the other side to get off first.</p><br/><p>“Good grief…”</p><br/><p>Ainz picked up Aura and placed her on the ground next to him. A quiet laugh of “Kufufufu~” came from Albedo’s side.</p><br/><p>“…Aura was the one who sat down first. Albedo, you’d best get down as well.”</p><br/><p>“But, but… Aura’s been sitting for 3 minutes and 41 seconds. I’ve only been sitting for 57 seconds. Though it may sound foolish, I believe I should be allowed to sit for another three minutes.”</p><br/><p>“Haven’t you spent more time meeting with Ainz-sama already?”</p><br/><p>“It can’t be helped, that was work.”</p><br/><p>“Oh, work, is it? You just came to meet him for work? I came all the way here just to see Ainz-sama, you know.”</p><br/><p>“!!”</p><br/><p>Albedo wiggled her rump on Ainz’s thigh, adjusting her position to stare Aura in the eye.</p><br/><p>Ainz thought, I can guess why Albedo wanted to sit on my thigh, but why did Aura want to do that? It’s not like she loves me like Albedo does.</p><br/><p>He could not remember what he had done to make a girl like Aura love him. The feeling called love should have been a mystery to Aura. And then ― Ainz finally found the answer.</p><br/><p>“I see. So she was being possessive.”</p><br/><p>In addition, she might long for a father’s love. Aura and Mare were designed as children, and they were still at an age where their parents would care for them. Perhaps they were unconsciously looking at Ainz to fill that gap in their hearts.</p><br/><p>If there was a country of Dark Elves, he had considered the possibility of sending them over to make friends. However, Suzuki Satoru had not experienced a father’s love himself, so he felt it might be a bit late for that.</p><br/><p>I wonder if there are books for children’s sex education in the library?</p><br/><p>It had been fine when they were just data. However, he had been thinking up till now, and noticed that there were still some things missing in order for Aura and Mare’s healthy mental growth.</p><br/><p>As I thought, they really need to make Dark Elf friends! Let’s make that a priority. That being the case―</p><br/><p>“Aura. There is something I’d like to ask; what happened to the three Elves I left with you and Mare?”</p><br/><p>“You mean the Elves who set foot in Nazarick but who were pardoned by your mercy, Ainz-sama?”</p><br/><p>Ainz nodded.</p><br/><p>When he had drawn those workers in, he handed the Elven slaves following them to Aura and Mare. Normally, anyone who entered Nazarick without invitation would not be allowed to leave with their lives. However, they probably had not been there of their own will, and they had no intention of taking the treasures of Nazarick for their own. That being the case, it was not unreasonable to show them some measure of kindness.</p><br/><p>In addition, if they were Wood Elves, they would probably have a beneficial effect on Aura and Mare’s development.</p><br/><p>“Yes. For the moment, we’ve put them all on our Floor.”</p><br/><p>“Where are they?</p><br/><p>“Yes. How shall I say this… they have nothing to do, but keep trying to take care of us. It’s kind of annoying how they keep hanging around us.”</p><br/><p>“That, that’s right. Like, our, our clothes and so on. I, I can dress myself, but they keep coming over to help me…”</p><br/><p>“You need to pull yourself together. They keep trying to dress you because you keep acting like that. Look at me, I don’t have that problem, no?”</p><br/><p>I see, so they wish to do something. Just like the maids around me. I feel your pain, Mare. Still, that means the three people I rescued aren’t completely useless, after all. Would it be bad for former slaves to teach sex education? Hm~”</p><br/><p>“Well, we did save their lives. Don’t kill them on impulse, even if you’re mad. If you feel they’re truly troublesome, tell me and I’ll send them somewhere else.”</p><br/><p>“Got it! I’ll let you know when the time comes.”</p><br/><p>Ainz glanced at Mare, who had his head lowered, and muttered “What,” to himself. Then, he shifted a somewhat icy look to Albedo.</p><br/><p>“Albedo, it’s about time to get off. It’s been over three minutes now.”</p><br/><p>Albedo looked disappointed for a moment, but she still obediently dismounted from Ainz’s thigh without saying anything.</p><br/><p>“Come to think of it, what were you two doing, Ainz-sama?”</p><br/><p>“Hm? Ahhh. I gathered suggestions from people in Nazarick on how to make this country great. Ah, that’s right. You two as well. If you’ve got any good ideas, why not give it a try. I’ll listen to anything, you know?”</p><br/><p>Aura’s face lit up.</p><br/><p>“If you say so, Ainz-sama! I have a great idea!”</p><br/><p>“Hohoh ― And what would that be, Aura? Come, tell me.”</p><br/><p>“Yes! I think boys should dress like girls, and girls should dress like boys!”</p><br/><p>…Bukubukuchagama―!</p><br/><p>Ainz screamed the name of one of his old friends internally.</p><br/><p>For a moment, Ainz even saw the phantom image of a Pink Slime going “Sor~ry!” in an adorable voice that was completely at odds with its appearance.</p><br/><p>“I see. So that was Bukubukuchagama-sama’s idea. It is certainly an excellent proposal. Moreover, in this country, any decision of the Supreme Beings will surely be the correct one.”</p><br/><p>Correct? Ainz wanted to make fun of Albedo, but he could not do it.</p><br/><p>In any case, this idea could not be allowed to happen. However, there was a problem with that.</p><br/><p>The two of them only dressed like that because Bukubukuchagama designed them that way. If Ainz denied Aura’s idea, he would then have to explain the exact reason why to the others.</p><br/><p>Ainz could not immediately think of such an explanation.</p><br/><p>“Ainz-sama. Shall we implement Aura’s suggestion immediately?”</p><br/><p>Why are you making the decision so quickly?!</p><br/><p>He was out of time.</p><br/><p>If he agreed to this suggestion, it would be declaring to all parties inside and outside the country that the Sorcerous Kingdom of Nazarick was a nation that valued cross-dressing. That would be incredibly bad. Perhaps only Bukubukuchagama would be interested in that. No, if Bukubukuchagama was in this world, Ainz felt she would definitely not want to make a country like that.</p><br/><p>If they knew the NPCs had developed their own egos, some people would be intrigued and want to meet them, while others would want to avoid them. Bukubukuchagama would probably fall into the latter group. Yamaiko and Ankoro Mochimochi would probably want to meet them. Why is it they’re so different despite them all being girls…</p><br/><p>As he reminisced about them, Ainz slowly rose and looked out the window. Of course, that action had no special significance. He was simply trying to buy himself time. Once he had a rough idea of what he was going to say, Ainz turned to look at the three of them.</p><br/><p>“I cannot possibly allow that idea.”</p><br/><p>“Why, why is that?”</p><br/><p>Of course they’d ask that, right? …I mean, giving single men masks on Christmas would still be a better law than that…</p><br/><p>Ainz sighed. Of course, that action had no special significance. He was simply trying to buy himself time.</p><br/><p>“There are many complex reasons for that, Albedo. Do you need me to explain each and every one of them?”</p><br/><p>“Y-yes. P-please, if you don’t mind.”</p><br/><p>Ainz was planning to say that to Albedo, but Mare was the one who intercepted it instead. He’s normally such an honest boy; why’s he being so wicked now, Ainz thought sadly. If it was Albedo, she would have definitely said, “There’s no need for that. Allow me to explain to the two of you on Ainz-sama’s behalf”. But under these circumstances, Ainz had to do it himself.</p><br/><p>“…Is that so. Then, I shall enlighten you. But where shall I start from to make it easy to understand…?”</p><br/><p>Umu, Ainz went as he supported his chin with his hand. Needless to say, that too was to buy himself time. Ainz desperately forced himself to think, so hard that he thought his brain would start sweating, and then an idea struck him.</p><br/><p>“―Firstly, ah yes, that should be it. The two of you must feel that because you’re dressed that way, the entire country must dress like you as well, am I right? After all, you must feel that such was Bukubukuchagama-san’s will. However, that would be incorrect. ―Yes, the two of you are special.”</p><br/><p>“We’re special?!”</p><br/><p>“Indeed you are. The two of you are special to Bukubukuchagama-san. That is why you have been permitted to dress in that way… so do you intend to grant that specialness to many people that you do not know?”</p><br/><p>“How could we?!”</p><br/><p>The person who had retorted so loudly was ― surprisingly enough ― Mare.</p><br/><p>“Never! I’ll never let anyone but Nee-chan have Bukubukuchagama-sama’s specialness!”</p><br/><p>“That, that’s right. That’s how it is. Do you understand, Aura?”</p><br/><p>“Yes! I was so stupid that I didn’t think about how Bukubukuchagama-sama felt!”</p><br/><p>“Also…”</p><br/><p>Aura and Mare had already accepted that reasoning. It should be fine to slowly exit the topic now. However, there was one more thing that worried Ainz.</p><br/><p>Ainz muttered something about there being several other reasons, and he peeked at Albedo as he murmured.</p><br/><p>Someone as extraordinary as her would probably have thought further ahead than Ainz. Would she find it strange if he terminated the topic now? That was what made Ainz uneasy.</p><br/><p>As their eyes met, Albedo smiled, and then inclined her neck.</p><br/><p>Not knowing what that response meant, Ainz averted his eyes. And then, there just happened to be an Elder Lich in front of him. Ainz nonchalantly eyed the files he was holding.</p><br/><p>“―Ahhh. So you were thinking about that too, Ainz-sama. After all, you were looking at that document the most. It should be alright to tell the two of them as well, right?”</p><br/><p>Ainz turned to Albedo again as she suddenly spoke.</p><br/><p>“―Umu. So you thought of it too, Albedo.”</p><br/><p>“Yes, I did. I was wondering if you were going to mention that idea as well, Ainz-sama. I believe what you are thinking about is whether or not to explain to the two of them, am I right?”</p><br/><p>“As expected of you, Albedo. You know my thoughts without the need for me to speak them.”</p><br/><p>“You are too kind,”</p><br/><p>Albedo smiled and lowered her head. On the other hand, Aura puffed up her cheeks in annoyance.</p><br/><p>“Still, I cannot believe I did not think of Bukubukuchagama’s will, though it should have been the most important thing to consider. As expected of our creator, our Overlord. I will never be able to equal your wise decisions, made by considering countless points of view.”</p><br/><p>“No, don’t say that, Albedo. I’m certain you will display talents that will exceed mine someday.”</p><br/><p>The fact was, she had already exceeded him by far. Ainz felt ashamed of himself as he thought about that, but Albedo simply nodded, her face full of conviction.</p><br/><p>“Yes! I shall!”</p><br/><p>“―Then, what other reasons are there?”</p><br/><p>“Really now, Aura. Albedo, explain to the two of them. Make it easy enough to understand that even a child could get it. Yes, it must be easy to understand,”</p><br/><p>After Ainz said this, he fell silent and and then looked out the window once more. However, all the nerves of his body were concentrated on listening, because he did not want to miss a single word Albedo said.</p><br/><p>“Indeed. Actually, I wanted to bring this up with Ainz-sama afterwards. The fact is, a small problem has cropped up.”</p><br/><p>“Ehhh? Did someone cause you trouble? Want us to go over there and wipe him out for you?”</p><br/><p>“No, it’s not like that. The truth is, we’ve discovered that our resource stockpiles might not be sufficient for the future. So if we ordered everyone to change their clothes right now, we would only be able to take troublesome measures like exchanging old clothes and so on.”</p><br/><p>Eh, really? Of course, Ainz could not say that. All he could do was desperately try to recall the contents of the file he had just seen.</p><br/><p>Indeed, it contained something about resources, but the amount seemed quite adequate. However, if Albedo said so, then it must be true.</p><br/><p>In other word, this is a pretty bad situation, no? Still, if that’s the case, can’t we just purchase more from the Kingdom or the Empire? A city like this should carry enough capital for that, right?</p><br/><p>Albedo had an answer to Ainz’s justified doubts:</p><br/><p>“This city was an excellent storehouse for resources, and it functioned as a trade city. However, since Ainz-sama has taken control, the traders from the other three countries rarely visit this place. Thus, we are in a situation where our remaining resources are ebbing away.”</p><br/><p>“If we don’t have them, then let’s grab them from elsewhere. How about from the Empire or the Kingdom?”</p><br/><p>“Onee-chan, we, we can’t do that. Ah, A-Ainz-sama said we were forbidden to use force on those three countries, right?”</p><br/><p>Indeed. Though he did not know about the future, he had placed a blanket ban on the use of military force until he had fully assumed control of this city. Of course, if the other side attacked first, that was a different matter entirely.</p><br/><p>“Then, what should we do?”</p><br/><p>“Er, erm, we shouldn’t need to worry. A-after all, A-Ainz-sama will settle it.”</p><br/><p>Are you going to dump all this on me now? Ainz wanted to refute Mare with that, but he forced himself not to. After Aura replied to Mare with, “I see!” he could not bring himself to betray the trust those two kids placed in him.</p><br/><p>However, an ordinary employee like Ainz could not possibly think of a proper financial policy. Because of that, Ainz decided to play one of his two trump cards.</p><br/><p>Ainz slowly turned, and confidently said:</p><br/><p>“―Albedo. You’re taking care of this, aren’t you?”</p><br/><p>In other words, he would dump it all on another talented person (Albedo) and be done with it.</p><br/><p>“Yes. Recently, the seeds Demiurge has been sowing should be ready to be harvested.”</p><br/><p>“Just so. The two of you have nothing to worry about.”</p><br/><p>Their sparkly-eyed looks of respect and adoration made Ainz feel a twinge of guilt. At the same time, the fear of seeing the looks of disappointment in their eyes when they found out all this was fake took root in his heart.</p><br/><p>Still, that Demiurge. I don’t know what seeds he planted, but he’s really amazing.</p><br/><p>Ainz wanted to ask about the harvest, but he could not.</p><br/><p>This was because Ainz Ooal Gown should have been a luminary who knew everything.</p><br/><p>I know I should have studied economics, but I could only skim through those complicated books… like, they should have made the ones on Keynesian economics and so on easier to understand. Or could it be that I’ve become set in my ways because of my age?</p><br/><p>Ainz was thoroughly versed in the game mechanics of YGGDRASIL. This was not an idle boast; he had learned over 700 spells and had memorized the details of each one, a feat which shocked his friends. Even those spells he had not learned could still become a weapon to read his opponents’ strengths, once he knew of them. This was why Ainz had done his best to memorize all those spells. He was easily in the top five amongst his guildmates when it came to magical knowledge.</p><br/><p>Still, while he could do that, he was completely clueless about academics.</p><br/><p>Eh? Could it be that I can’t remember more things because I don’t have a brain?</p><br/><p>Ainz knew that he had learned many things since coming to this world, so he also knew that was impossible. Still, he trembled a little at that frightening theory.</p><br/><p>“And then, I have a matter which requires Ainz-sama’s approval…”</p><br/><p>“―What? Did you say approval?”</p><br/><p>Ainz did not feel any suggestion Albedo made would require his approval. After all, she was a clever girl, and would surely make choices that were better than his own. However, if that was the case, the organization would not be able to function properly. After all, the people on top had to bear responsibility for their subordinates’ actions. Because of that, it would seem that superiors had to grant seals of approval in this fashion.</p><br/><p>“Someone must visit the Royal Capital to stir up those humans. Would you permit your servant to go?”</p><br/><p>“What?!”</p><br/><p>Ainz was taken completely by surprise, and exclaimed louder than normal.</p><br/><p>Sending Albedo out while Demiurge was not around made Ainz feel very uneasy. Besides, his control over this city was not perfect.</p><br/><p>More than anything else, the reason why this was so shocking was because this was the first time Albedo spoke of something like this.</p><br/><p>“…If I send you out… I would be quite troubled…”</p><br/><p>“My,” Albedo smiled in delight. “It will be fine, Ainz-sama. I shall immediately settle matters and return to your side.”</p><br/><p>“Is that so… well, if it’s just for a while it should be fine. Who will be given control of Nazarick and this city?”</p><br/><p>Aura and Mare looked quite surprised, so it was obviously not them. Not me, I hope, Ainz hoped.</p><br/><p>“I plan to entrust them to Pandora’s Actor.”</p><br/><p>Aura and Mare said something along the lines of “It’ll be fine if it’s him.”</p><br/><p>“…Him, you say.”</p><br/><p>“He is an excellent individual created by you, Ainz-sama. As they say, like father, like son ― ah, I apologize. To think we who were merely created would dare claim to be the children of the Supreme Beings. I pray you will forgive my rudeness.”</p><br/><p>Albedo’s sudden apology stunned Ainz ― even the red points of light in his eyes faded.</p><br/><p>“There’s no need to apologize. That is, well, my child… sorry. I do not dislike him, that, hm. foolish child… no, that’s not his fault either… Well, how shall I put it. He’s like a child. Umu.”</p><br/><p>Before he knew it, everyone had gone quiet. Ainz knew that the conversation would dry up if this went on, so he steeled himself and asked:</p><br/><p>“If we let Pandora’s Actor manage this, what about Momon, who he is portraying? Should I do it?”</p><br/><p>“No, how could we have you do that sort of thing, Ainz-sama? I was planning to have Momon accept a request and be sent abroad for reconnaissance.”</p><br/><p>Mm, Ainz nodded. Although he thought about relaxing by taking the guise of Momon, things were now vastly different from when he was playing the role of an adventurer.</p><br/><p>There would be many troublesome things, or things which had to be carefully handled. That being the case, sending Momon out on a scouting mission might be the best choice.</p><br/><p>“Ah, a-about that… if you send Mo-Momon-sama out, will the people in this city behave?”</p><br/><p>“It will be fine. This single move by Ainz-sama has had a great impact here. Because we have not trivialized humans ― although there was hardly any intention to do so ― Momon has become deeply trusted. Thus, all we need to do is have Momon tell the local leaders to obey us before he leaves and all should be fine. Still, come to think of it, they have no idea that they are puppets dancing on strings, ruled by Ainz-sama… As I thought, only he could have anticipated this turn of events right after being transported here and made the appropriate preparations.”</p><br/><p>“Mm ― it’s kind of strange, how they trust Momon-sama, but not Ainz-sama.”</p><br/><p>“Indeed. Still, this is an important part in completely controlling this city in the name of peace. All we need to do is gradually remove Momon and instil loyalty to Ainz-sama in his place. This might take several years, but it can’t be helped.”</p><br/><p>“Good. Then, Albedo, hand it to Pandora’s Actor. After you have prepared yourself and handed over your tasks, go and reap the harvest. Is there anything else you need?”</p><br/><p>“Understood. Then, I plan to conduct some negotiations when I go to see the humans’ king. Could you spare some of your valuable time to go over a draft with me?”</p><br/><p>“Umu. Bring it to me later.”</p><br/><p>Besides, all he would be doing was something simple like putting his seal on Albedo’s draft.</p><br/><p>“In addition, though it shames me to ask, I would be delighted if you could give me several sets of clothing. I was simply thinking that it would be necessary to change clothes there.”</p><br/><p>“Is that so. Then I shall give you several sets of my clothes. Come look for me later. Speaking of which, Demiurge ― no, there’s no need. It’s fine. Then, let’s continue… hm, since you’ve come all the way here, I’d like to hear from the two of you as well.”</p><br/><p>Part 2</p><br/><p>After their business was concluded, the three of them left the room with the Elder Liches, leaving Ainz and Fifth. And, of course, the Eight Edge Assassins on the ceiling.</p><br/><p>Frankly speaking, this was the end of Ainz’s work for the day. The rest was all free time. While there were some matters which were best settled earlier on, once they were finished, he found himself quite free. As he mused on what to do with his time, Ainz suddenly thought of something and rose to his feet.</p><br/><p>“I will be seeing Pandora’s Actor next.”</p><br/><p>With that order, Ainz strode forth. Fifth followed in silence. Naturally, so did the Eight Edge Assassins.</p><br/><p>Once he left his home, he found that the outdoors was still quite cool, as befitting the season. The wind had a hint of chill in it, but Ainz was completely immune to the cold. After glancing at Fifth to make sure she was all right, he continued walking.</p><br/><p>This district contained three kinds of buildings: Ainz’s own residence, all manner of government structures, as well as guest houses. Pandora’s Actor ― no, Momon lived in one of those guest houses.</p><br/><p>Normally, he would have summoned Momon before him as befitting his status as a ruler, but what he did now was because he had changed his mind.</p><br/><p>“―Hm? What’s this?” Ainz muttered as he neared the guest house. He was looking at the stables which adjoined the guest house in question. The word “stables” implied that it would be used to quarter horses, but now the only one in there was Hamsuke. Or rather, that was how it should have been.</p><br/><p>Somewhat confused, Ainz drew near to the stables, and heard a quiet hyu~hyu~ of snoring. Sleep was a privilege of living creatures, so Hamsuke should be inside.</p><br/><p>The sun was already quite high in the sky, but Hamsuke was still asleep.</p><br/><p>Hamsuke could see in the dark like a cat, but according to Hamsuke, she was neither diurnal nor nocturnal. She ate her fill and then slept until she was hungry. That was her way of life.</p><br/><p>When Ainz first heard of this, he wondered, “What part of this sounds like a Wise King of the Forest”. He felt like a fool for expecting her to behave like an intelligent being.</p><br/><p>“She hasn’t noticed us even though we’re so close. Did she lose her feral instincts? Really… what a degenerate fellow. No, perhaps it worked all night last night.”</p><br/><p>“That is not the case. Hamsuke-sama was here the whole of yesterday as well.”</p><br/><p>“…I see.”</p><br/><p>Ainz wanted to speak to Hamsuke despite Fifth’s merciless words, but he could not think of anything to say.</p><br/><p>Well, she was just a pet anyway. I shouldn’t have expected anything from her. Doesn’t matter if she allowed herself to fall to that level… still, I’m busy with all sorts of things, but she’s here taking it easy. It really pisses me off… although I know I’m just taking my anger out on her.</p><br/><p>He peeked his head into the stables, and the giant hamster was sleeping on the ground in an unguarded manner. All she needed now was a giant bubble from her nose and it would be the very picture of a sleepyhead.</p><br/><p>However, there was something else which drew Ainz’s attention, apart from the way Hamsuke was sleeping like a middle-aged uncle (although her body should not have allowed for it).</p><br/><p>There was a Death Knight that had Hamsuke’s tail wrapped around its waist. That undead creature must have been what drew Ainz’s attention to this stable in the first place.</p><br/><p>Since it was an undead creature which he had made, there was a bond between them and so he could judge its approximate location. However, there were too many undead in E-Rantel, so that particular sense had grown confused.</p><br/><p>In all honesty, it was very difficult for him to finely discern the location of the undead he had made. Even so, Ainz did not recall stationing one in the stables, hence his confusion at picking up an undead reaction here.</p><br/><p>“Wake up, Hamsuke.”</p><br/><p>“Muuu, yes….”</p><br/><p>Her eyes blinked like those of a human being as her big face moved, and then she caught sight of Ainz.</p><br/><p>“Ohhhh! I was wondering who it was, but as it turns out, it is milord!”</p><br/><p>“It doesn’t matter who I am. Normally you should be calling me Ainz-sama, right? After all, you are Momon’s steed, not mine.”</p><br/><p>“Of course I am, milord!”</p><br/><p>“Is that so… well, as long as you understand…”</p><br/><p>That said, Hamsuke’s reaction made Ainz think, Do you really understand?</p><br/><p>In addition, magical beasts were not particularly resistant to mind control. Hence, Ainz lent an item to Hamsuke which made her impervious to mind control, but he was still uneasy that someone might try to manipulate her through means other than magic.</p><br/><p>“Well, since you haven’t made any mistakes to date, I shall trust you. Then, onto the main topic. What’s with that Death Knight?”</p><br/><p>“Ohhh! He is a friend who trains with this one, milord!”</p><br/><p>It was then that Ainz remembered.</p><br/><p>He had conducted an experiment in learning martial arts while Hamsuke was training to be a warrior. In other words, he used this Death Knight to see if it could continue gaining levels as a warrior.</p><br/><p>He had equipped the Death Knight with artifacts that increased XP gain but that would greatly weaken it. However, in the end the Death Knight did not gain any levels. Ainz had anticipated that outcome, so he was not angry. Still, for some reason, Hamsuke had been going on and on about the Death Knight, so in the end, he took back the artifacts and left the Death Knight with her.</p><br/><p>So that’s the one… Come to think of it, the spikes on its armor look rounded down… I didn’t loan it out to be a hug pillow, but because I wanted it to become a warrior, or perhaps master something… Well, it doesn’t matter. There’s enough Death Knights to go around. Giving it one won’t matter.</p><br/><p>In fact, there were more than enough Death Knights, so much so that Ainz no longer made Death Knights when he created undead every day.</p><br/><p>“Is that so. I understand. Still, no matter what, you used to be a wild magical beast. It’s quite problematic that you let someone get so close without noticing. We’re not as stealthy as Aura, are we? Shouldn’t you be taking this a bit more seriously?”</p><br/><p>Hamsuke looked depressed, and her whiskers drooped down.</p><br/><p>“This one sincerely apologizes. This one used to be the strongest creature in that forest. This one never needed to be on alert because this one was never ambushed before.”</p><br/><p>“You should have had a childhood… period… or something, right? But before that, wasn’t there the Giant of the East and the Serpent of the West?”</p><br/><p>“Who are they? These gentlemen… East? West? Of whom do you speak?”</p><br/><p>A question mark appeared over Ainz’s head.</p><br/><p>“…They were beings who laid claim to the forest, just like you.”</p><br/><p>“Hoho~ I did not even know such people existed in that forest! As expected of you, milord! Your insight is indeed keen. This one knew little outside of this one’s territory.”</p><br/><p>“You… you call yourself the Wise King of the Forest and you still…”</p><br/><p>“In the past, a human warrior who trespassed in the territory of this one addressed this one in such a way. Speaking of which, this one spared that warrior and that warrior alone because this one thought the name sounded quite impressive. Ah, how nostalgic―”</p><br/><p>Ainz felt that he had finally solved the mystery.</p><br/><p>After that warrior returned alive, he must have greatly exaggerated the tales of his enemy, Hamsuke. It was probably some way of justifying his own survival when all his comrades had perished.</p><br/><p>That too was not hard to understand. The fact was that Hamsuke was very strong. Of all the human warriors Ainz had met, perhaps only Clementine and Gazef could have beaten Hamsuke.</p><br/><p>Ainz suddenly recalled Gazef.</p><br/><p>“Ohh? Is something the matter, milord?”</p><br/><p>“No… it’s nothing. Just… yes… it’s just that you don’t qualify as a Wise King of the Forest, just a Hamster of the Forest.”</p><br/><p>“Hamsters, you say ― indeed, you have spoken of those creatures before, milord! So is this one truly a hamster?”</p><br/><p>“Umu. You are a Giant Hamster.”</p><br/><p>“Ohhh! So this one was actually a Giant Hamster! Then, do you know where to find other members of this one’s species, milord?”</p><br/><p>“That, I do not know.”</p><br/><p>After that curt reply, Hamsuke fell into despair once more. Was I too harsh? Ainz thought and tried to comfort her by saying:</p><br/><p>“I have guaranteed all who serve Nazarick that they will be rewarded appropriately for their service. As long as you continue working for Nazarick, I shall someday find fellow members of your species for you.”</p><br/><p>“Ohhhh!”</p><br/><p>Hamsuke’s whiskers bounced as they stood up.</p><br/><p>“Although this one was already loyal to milord, this one shall serve milord even more loyally from this day forth!”</p><br/><p>“Umu umu. Then, Hamsuke, is Momon ― no, is Pandora’s Actor within the guest house?”</p><br/><p>“Milord’s double? This one is not too confident in that regard. After all, he often rides the coaches and wagons which the humans of this city prepare for him, and he does not always take this one with him.”</p><br/><p>“Ah, I seem to recall that he takes such transport to share information.”</p><br/><p>Kuku, Ainz chuckled evilly.</p><br/><p>Everything had developed as he had anticipated. Under the guise of sharing information with him, people would say things to Momon which they wanted to keep secret from Ainz, or perhaps they might plot to drive a wedge between Momon and Ainz. However, the truth was, they were the ones who would be unknowingly poisoned by the thoughts of Pandora’s Actor.</p><br/><p>Ainz was a trustworthy king, a merciful being who thought of the people, and so on.</p><br/><p>“I understand. However… you seem to be able to wear armor now. If you have nothing to do, how about putting it on and training in it?”</p><br/><p>The prototype armor should be complete.</p><br/><p>“This one understands, milord! Then, this one would also like to see those lizardmen-donos, if possible.”</p><br/><p>“Very well. I shall grant your wish. I will speak to Cocytus afterwards and have him send someone here.”</p><br/><p>“You have this one’s undying thanks, milord. Come, Death Knight-dono! Let us work hard together!”</p><br/><p>Ainz paid no heed to the burning friendship between a beast and a corpse and moved on.</p><br/><p>Behind Ainz was a voice which said something along the lines of “Really ― how annoying!” but he could not think of what the Death Knight might have to say. Although Ainz was vaguely interested in what Hamsuke was up to, he soon cast the thought away.</p><br/><p>Speaking of which, some time ago, I think I gave Hamsuke… it feels like I’ve forgotten something. Oh well, if I can’t think of it, it couldn’t have been that important, I guess.</p><br/><p>Ainz’s head was filled with these thoughts, which he could not quite articulate. It felt a bit like waiting for a sneeze which would not come. He arrived before the door to the guest house, but he would not do anything like knock. Fifth, who had been following behind Ainz, immediately advanced before him.</p><br/><p>“Open it.”</p><br/><p>“Understood, Ainz-sama.”</p><br/><p>Fifth looked terribly serious as she opened the door, but the corner of her mouth seemed somewhat relaxed. This must have come from the satisfaction she felt at being able to help Ainz in some way.</p><br/><p>It seems I was right to observe Jircniv. I have truly become a proper ruler. Granted, that’s not exactly the right way to treat him, but I’ll continue studying him from now on. After all, it’s to help me learn how it is to be a king.</p><br/><p>Ainz did not thank Fifth, but looked to the open door.</p><br/><p>“―Eight Edge Assassins.”</p><br/><p>“Yes! Ready for orders!”</p><br/><p>The Eight Edge Assassins that were following behind Ainz swiftly formed up into a line.</p><br/><p>“―Go.”</p><br/><p>“Yes!”</p><br/><p>Their jaws opened and closed, and then the lined-up Eight Edge Assassins responded with a voice that seemed more forceful than usual before entering the building. Only Pandora’s Actor was supposed to be in this guest house. On occasion, Narberal was here, but for the most part, she was in the Great Underground Tomb of Nazarick, carrying out Ainz’s orders.</p><br/><p>He could have stationed a regular maid here, but it could be troublesome if people who came to visit Momon thought they were being observed. Thus, it had come to this. However, if Pandora’s Actor stayed here alone, there was the possibility that the people who had brainwashed Shalltear might infiltrate this place. Thus, Ainz felt it was better to set up some countermeasures.</p><br/><p>…Still, in order for that to happen, someone would need to infiltrate all the way in here. Well, only fools don’t prepare enough. …Mm ― still, how long should I wait here? Or should I move forward? By common sense, I should wait here. After all, the Eight Edge Assassins will return to me. However, is a king really supposed to wait at the door?</p><br/><p>After hesitating for a bit, Ainz thought, ah well, forget it, and entered the guest house.</p><br/><p>He advanced, using the regal, proper bearing he had practiced dozens of times, in a way which he felt best fitted a ruler.</p><br/><p>However, within less than 20 paces, one of the Eight Ege Assassins returned and genuflected before Ainz.</p><br/><p>“Ainz-sama, we have summoned Pandora’s Actor-sama. He will present himself to you soon.”</p><br/><p>“Is that so. Then I shall wait in the guest room.”</p><br/><p>Ainz had been to this guest house before, so Ainz had a rough idea of its layout. After Fifth opened the door for him, Ainz moved without hesitation to the main seat in the guest room.</p><br/><p>This violated much of the manners he had picked up as a salaryman and felt wrong to him. However, this was an easy task for Ainz, who had spent much time practicing to be a ruler.</p><br/><p>Shortly after, a knocking came from the door. Ainz nodded to Fifth.</p><br/><p>Having received permission, Fifth opened the door, and Pandora’s Actor entered the room. He was not using magic to appear as Momon, but was in his usual military uniform.</p><br/><p>“Oh Supreme One, my creator Ainz-sama―”</p><br/><p>“No need to greet me. Sit.”</p><br/><p>“Yes!”</p><br/><p>He clicked his heels together before marching in.</p><br/><p>His movements were as smooth and crisp as that of a soldier’s, but to Ainz, they were entirely unnecessary. The best word to describe this was “overacting”.</p><br/><p>And so, Pandora’s Actor advanced to the place beside Ainz and sat.</p><br/><p>Don’t people usually sit opposite each other?</p><br/><p>Everyone possessed an area around them called their personal space, but Ainz could not help but stare at Pandora’s Actor’s remorseless blitzkrieg upon him.</p><br/><p>…Well, I guess it’s all right. Still, he’s really close…</p><br/><p>Ainz closely inspected Pandora’s Actor as he sat down. He no longer felt the same shock he had when he had first seen him in the Treasury. Perhaps the passage of time and meeting him several times to give orders had softened the impact on him.</p><br/><p>“May I ask―”</p><br/><p>“No, it’s nothing, don’t worry about it. All right, I have some things to ask you. First, I’d like to know about Momon’s condition. I know what you’ve reported to Albedo… so, are there any problems?”</p><br/><p>“It would seem that there is nothing spec―”</p><br/><p>“Is that so. Good. Then, I’d like to ask you, as Pandora’s Actor ― are there any problems on your end?”</p><br/><p>The mood in the air changed.</p><br/><p>“In truth, Ainz-sama!”</p><br/><p>Ainz leaned back, as though the tremendous presence of Pandora’s Actor was crushing him.</p><br/><p>“I, I have suffered greatly!”</p><br/><p>Who’s the one suffering here?!</p><br/><p>However, Ainz did not have the time to shoot back with that before Pandora’s Actor continued speaking.</p><br/><p>“During this time, I have not once been able to touch magic items. I have been unable to maintain the various magic items created by the Supreme Beings. The sorting of data crystals has ground to a halt as well. Please! No matter what, Ainz-sama! I beseech you to grant me some time with those items!”</p><br/><p>“…I, did I design you that way?”</p><br/><p>“Of that there is no doubt! These feelings were bestowed upon me by yourself, Momonga-sama!”</p><br/><p>“…Ahhhhh.”</p><br/><p>Ainz desperately tried to recall the way he had designed Pandora’s Actor. He could recall giving him a backstory that stated he liked managing magic items and the like. Ainz’s original intent was to design him in such a way that he would not find it strange to be alone in the Treasury ― indeed, one could consider being surrounded by the things he loved to be a heavenly job. So it would seem that Ainz’s personality settings were the source of the problem. However, for some reason, it seemed to have reached the level of a fetish.</p><br/><p>“Did I not permit you to return to Nazarick every day?”</p><br/><p>While half of Nazarick’s undead were made by Ainz, the other half were made by Pandora’s Actor. Granted, the undead made by Pandora’s Actor were weaker than those made by Ainz, to some extent. Still, that was within acceptable parameters, and there were adequate frozen corpses on the 5th Floor for that purpose.</p><br/><p>In fact, there were so many of them that the two of them working together could not use them up.</p><br/><p>“However, I have not received permission to return to the Treasury!”</p><br/><p>What could he be feeling that made him omit his usual theatrics?</p><br/><p>“I understand. Then, I shall inform Shalltear and have her give the Ring to you. In addition, I grant you permission to work on my comrades’ weaponry and equipment. Don’t damage them.”</p><br/><p>“It shall―”</p><br/><p>“Stop that. Speaking normally will be fine. Didn’t I tell you this before, hm, Pandora’s Actor?”</p><br/><p>“Yes!”</p><br/><p>“The relationship between us is one of creator and created. The fact is, I am very happy with the way you have worked hard to show me the being I intended to make. However, sometimes I wonder; should children not work to exceed their parents?”</p><br/><p>“Ohhhh… Ainz-sama. To think you would refer to me as your child!”</p><br/><p>“Umu, umu. You are, er, my son, or something like that. That, er, how shall I put this, should most likely, er, that should be the case. Therefore, there’s no need to use German or salute or be so dramatic in front of me. Since I made you, I want to see the parts of you that I did not make, as proof that you have grown.”</p><br/><p>Ainz glanced behind at the sound of sniffling, and saw that Fifth was dabbing at the corners of her eyes with a handkerchief.</p><br/><p>What?</p><br/><p>Isn’t she crying too easily?</p><br/><p>Just as Ainz was feeling confused, Pandora’s Actor bowed his head.</p><br/><p>“I understand ― Father!”</p><br/><p>“…Oh.”</p><br/><p>“I shall show you what you wish to see, Father!”</p><br/><p>He was wrong. He had been too reckless. Although it was impossible, Ainz felt a headache assailing him.</p><br/><p>“Pandora’s Actor. You must not tell anyone else of what has happened here. Understood? If people know that you’re receiving special treatment, it might result in friction with the others. Also ― in fact, because of that, I will be placing you lower on my priorities. If the time comes when I have to choose between helping you or the Guardians, I will abandon you.”</p><br/><p>“But of course! Please, sacrifice me as you see fit!”</p><br/><p>As Ainz watched him thrust out his chest while speaking, a sense of guilt grew in Ainz’s heart.</p><br/><p>“I am sorry. And… Fifth. Do not speak of what has happened here.”</p><br/><p>After seeing Fifth nod in acknowledgement, Ainz nodded as well.</p><br/><p>“Then, I will be on my way.”</p><br/><p>“Ah, about that, could you hold on a little? Since we meet rarely, there is a matter I would like to ask you, Father. May I know how you intend to rule this Sorcerous Kingdom?”</p><br/><p>“What?”</p><br/><p>“Many humans have their doubts about the path upon which you intend to take this country, Father. For instance, if you wish to adopt a policy of expansion, they fear that they will be sent onto the battlefield, and so on.”</p><br/><p>Ainz froze in place.</p><br/><p>Where was he going to take Ainz Ooal Gown?</p><br/><p>To begin with, Ainz was just a regular person, yet he had stated a nigh-unreachable goal like conquering the world. Ainz had stopped thinking about it. He felt that it would be better to hand this matter to intelligent people like Albedo or Demiurge.</p><br/><p>That said, the matter of how to run this country was a question which he could not evade.</p><br/><p>“Is, is something wrong, Father?”</p><br/><p>“…I intend to let you know, but I’m still drafting it up in my mind. I shall discuss the matter with the various Guardians of Nazarick and then inform you.”</p><br/><p>“Yes!”</p><br/><p>Ainz rose silently.</p><br/><p>“Then that will be all, Pandora’s Actor.”</p><br/><p>After hearing Pandora’s Actor bid him farewell, Ainz left the room.</p><br/><p>Before he left through the main door, he sent a [Message] to Shalltear before he forgot, informing him of Pandora’s Actor’s request. If he put it off, he would probably forget it later on.</p><br/><p>Once he reached the door, Ainz moved faster than Fifth and opened the door before she could do so for him.</p><br/><p>Then, he looked to the sky.</p><br/><p>It was a clear, blue sky.</p><br/><p>“I’ll be flying,” Ainz curtly said. Although the people behind him began to panic, Ainz chose to pay them no heed.</p><br/><p>Ainz floated into the sky thanks to the [Fly] spell, and then landed on the roof of the guest house.</p><br/><p>Because E-Rantel was a city protected by three layers of walls, from this vantage, half of his field of vision was blocked by the city walls.</p><br/><p>“I can’t see from here, huh? Looks like I’ll have to go for a walk.”</p><br/><p>He might be able to think of something if he walked the streets. Staying here meant that there was no way he would be able to think of anything.</p><br/><p>Just then, the forms of the Eight Edge Assassins ― who had climbed the walls ― appeared before Ainz as well.</p><br/><p>“Ainz-sama, please wait! It’s dangerous to go alone!”</p><br/><p>He could not simply laugh off the Eight Edge Assassins’ words.</p><br/><p>Someone standing in the middle of a wide-open area with good visibility in all directions was practically asking to be sniped.</p><br/><p>“That’s true. I’d make a good target if my opponent was Peroroncino-san.”</p><br/><p>Peroroncino the archer ― who was the most specialized in ranged combat within the guild Ainz Ooal Gown ― would probably be able to hurt Ainz very badly. That man could easily attack from even two kilometers out. His favorite tactic was concealing himself and then sniping his opponent ― albeit with a bow. That said, even if his opponent was Peroroncino, Ainz had no intention of allowing himself to be toyed with until he died.</p><br/><p>Ainz was confident that he could use various means to defend, escape, or counterattack. He had honed his skills through PVPing, and he would definitely not die with no means of responding. However, if he had to be wary of attack methods which only existed in this world, the Eight Edge Assassins had a point.</p><br/><p>Ainz could not die now. At the very least, before experimenting with resurrecting players, he had to assume he only had one life, and prepare a meatshield for himself.</p><br/><p>His best and safest option for that job was Albedo, whose defensive strength was the highest among the Guardians. However, he would need people to protect her as well, which would necessitate a large deployment of forces. He did not want to do that unless it was for the purpose of baiting an enemy attack.</p><br/><p>If that was the case, the best choice would be disposable and high-level vassals, but―</p><br/><p>I don’t have any high-level vassal monsters. Even if I wanted to use mercenary monsters, I spent a lot of money summoning Albedo’s subordinates, so I don’t have the cash out of pocket to casually summon monsters.</p><br/><p>He had decided to make a big show of spending to prove his generosity, and now he vaguely regretted doing so. All he could do was comfort himself by saying that he had to maintain his image as her boss.</p><br/><p>Hang on, let’s think this through step by step.</p><br/><p>Ainz listed various possibilities in his mind.</p><br/><p>Mercenary monsters. He had no money, so they were out.</p><br/><p>The skill, [Undead Lieutenant]. It required XP, so he decided against it.</p><br/><p>Using the summons from the Staff of Ainz Ooal Gown. The very fact that he had to carry the Guild Weapon with him meant that it was out of the question.</p><br/><p>The skill, [Create Undead]. Even if he created upper-tier undead, they would only be level 70, which he would not even trust to escort the Guardians.</p><br/><p>No, I still have a trump card in store.</p><br/><p>He had enhanced his undead creation skills through the use of a dark ritual.</p><br/><p>He could only create upper-tier undead four times a day. However, if he divided those up into two uses, he could make undead of roughly level 90.</p><br/><p>Ainz stroked his chin, and wondered what sort of undead to make. The thief-type Eternal Deaths, or sensory-focused Eyeball types…</p><br/><p>Granted, the Eternal Deaths were excellent undead to use, but they had a passive skill called [Aura of Death and Decay] which was constantly in effect. It was a potent skill which combined the effects of Ainz’s [Despair Aura V (instant death)] and [Despair Aura I (fear)], making it a creature that could inflict instant death and stat penalties upon the enemy. In particular, the stat penalty was not a mind-affecting ability. This allowed the skill to bypass immunity to mind-affecting effects, which made it very hard to deal with.</p><br/><p>That said, if this ability was used when friendly fire was enabled, it would swiftly paint a hellish picture of suffering and misery. Of course, he might be able to order them to suppress the ability, but bringing undead like that onto the city streets was complete insanity.</p><br/><p>Several other scary monsters appeared in his mind, but he shot all those ideas down.</p><br/><p>…How should I say this… they’re very capable, but they all look ugly.</p><br/><p>None of them were at all suitable as guards which a king would have with him when walking the streets.</p><br/><p>Just as Ainz was puzzling over the matter, he noticed Fifth beneath him, trying desperately to climb the wall.</p><br/><p>Without another word, Ainz jumped off, using [Fly] in mid-air to slow his descent, and he landed gracefully on the ground below.</p><br/><p>Fifth ― who was gripping a window frame and whose face was flushed red ― hurriedly assumed her position behind Ainz.</p><br/><p>“Fifth.”</p><br/><p>“Yes!”</p><br/><p>“I will be going out to the city after this.”</p><br/><p>“Understood, I shall ready the carriage immediately!”</p><br/><p>“No, there is no need for that. I intend to observe the conditions in the city. I rule these streets, so I plan to go on foot.”</p><br/><p>“Eh?! But that would only stain your precious feet! Please order us to clean the streets for you! And we must prepare the followers!”</p><br/><p>Few roads on E-Rantel were cobbled, so after the rain, the rest became stretches of mud.</p><br/><p>“There is no need for that. I have lived in this city before.”</p><br/><p>That said, after checking into the inn, he immediately returned to Nazarick to make undead.</p><br/><p>“In addition, I intend to summon followers with magic, so there is no need to send over people from Nazarick.”</p><br/><p>“…If that is the will of the Supreme One.”</p><br/><p>Still, the question of what to summon remains. If I call up demons or undead, it will lead to bad rumors and vicious gossip. So I’ll need to summon something pretty, to raise opinions of me. What fits the bill…</p><br/><p>As he thought of that, Ainz found the answer.</p><br/><p>“I will be summoning angels after this. Let’s go.”</p><br/><p>“Yes.”</p><br/><p>Although Ainz’s karma value was extremely negative, he would not have a problem summoning angels, whose karma values were highly positive. There were some classes which had the penalty of not being able to summon monsters whose karma values were too different from their own, but Ainz did not have such classes.</p><br/><p>Incidentally, the monsters summoned by those classes got stronger the closer the monsters’ karma values were to their masters.</p><br/><p>In YGGDRASIL, any disadvantages would have matching advantages as well.</p><br/><p>Ainz headed toward the courtyard.</p><br/><p>As expected of a place used for putting horses through their paces, training hunting hounds and other such activities, the expanse of trimmed grass which made up the courtyard was vast indeed.</p><br/><p>“Then, let’s begin. This may take a while, so talk with me in the meantime.”</p><br/><p>“W-who, me?”</p><br/><p>“Exactly. In other words, I want to know everything about Nazarick’s 9th Floor ― right. Tell me about your work. Is there anything about the rooms you are cleaning?”</p><br/><p>Ainz did not wait for Fifth to reply. After changing out parts of his equipment, he cast his spell.</p><br/><p>This spell was the super-tier spell [Pantheon], which was similar to the 10th tier spell [Armageddon – Good] and the super-tier spell [Nibelung I], and which was diametrically opposed to the super-tier spell [Pandemonium].</p><br/><p>He listened to Fifth’s words as he waited for the super-tier spell to take effect. If there was a sudden need to take urgent action, he would naturally use a cash item, but doing so at this time would have been terribly wasteful.</p><br/><p>Chatting with the maids isn’t bad, Ainz thought.</p><br/><p>In addition, this was the first time he heard that Albedo’s room was forbidden to the maids.</p><br/><p>“―I see. Well, this was quite a meaningful conversation. Although I just thought about it, go back to my room and bring Nurunuru-kun over. It would be troublesome without him.”</p><br/><p>“Understood!”</p><br/><p>Ainz watched Fifth’s maid outfit sway wildly as she jogged off, while he remained in the courtyard.</p><br/><p>While he waited, he recalled Fifth’s words.</p><br/><p>Apparently, Albedo had told the maids that she would handle the cleaning of her own room as part of her bridal training, so she did not wish for anyone to enter her room.</p><br/><p>Ainz muttered “Good grief” to himself.</p><br/><p>“Albedo, it’s not that I don’t understand your feelings, but the fact is that you’re a busy person, so you should leave the cleaning to the maids. I can’t really say this, but it seems I’m a better ruler than you are, in that sense.”</p><br/><p>Before long, Fifth returned, panting and presenting Nurunuru-kun. Ainz smiled, satisfied by his ability to command.</p><br/><p>“Thanks.”</p><br/><p>Ainz accepted the Lip Bug from Fifth with a brief word of appreciation. Then, he applied the Lip Bug to the base of his bony throat.</p><br/><p>“Ah, er, um.”</p><br/><p>For some reason, there was a change in Ainz’s voice. Granted, that was the creature’s special ability, but he still did not understand it. All he could do was accept it.</p><br/><p>Ainz put his doubts aside and cast the super-tier spell. Six pillars of light appeared around him, and from them came six angels.</p><br/><p>These angels had lions’ heads, with one pair of wings stretched out and another pair folded around them, for a total of four wings. They each wore suits of shining armor and held shields with eye patterns in one hand and lances of fire in the other.</p><br/><p>These angels were around level 80, and they were called Cherubim Gatekeepers.</p><br/><p>Ainz did not know much about mythology, so he did not know why they were called gatekeepers, but he did know about their strengths as monsters.</p><br/><p>The Cherubim Gatekeepers were quite well-suited to the task of being a tank, and their considerable sensory abilities also made them very good sentries.</p><br/><p>“Protect me. Do not kill my enemies, but render the foe powerless while doing as little damage as possible.”</p><br/><p>“Understood, o summoner.”</p><br/><p>This order had not been given out of compassion. Although Ainz had no hesitation about killing his opponents, he had to consider that people might be scheming behind the scenes. In addition, he had to let Momon perform the executions, hence his instructions to capture the enemy alive.</p><br/><p>“Then, let’s go.”</p><br/><p>Once the Angels had taken a defensive formation around Ainz, he immediately strode forth.</p><br/><p>Summon spells ― including this super-tier spell ― would terminate after a while. Thus, he had to avoid wasting time.</p><br/><p>“Angels, Fifth will be walking with us. Defend her as you would me.”</p><br/><p>“Understood, o summoner.”</p><br/><p>“Ai-Ainz-sama, how could my body be compared to the precious form of the Supreme One?”</p><br/><p>“…Fifth. You might be a maid, but you are still a creation of one of my friends. Thus, you are very valuable to me. Remember that well, because I find it troublesome to repeat myself. Then go tell all of your fellows.”</p><br/><p>“Thank, thank you very much!”</p><br/><p>Incidentally, he did not say the same thing to the Eight Edge Assassins, as they were beings summoned from YGGDRASIL gold. He might have felt vaguely regretful about having to sacrifice them, but they had no value to him beyond that.</p><br/><p>“Let’s go.”</p><br/><p>With the six Angels, Fifth, and several Eight Edge Assassins ― the rest were left as sentries ― in tow, Ainz headed for the gate.</p><br/><p>There loomed the form of a Crypt Lord, who commanded over twenty Death Knights.</p><br/><p>It was dressed in tattered purple robes which were once magnificent, and it wore a crown that shone uncharacteristically bright. It was a level 70 undead creature from Nazarick.</p><br/><p>Its commander-type skills could strengthen any Death Knights it controlled, but it could not do so since the Death Knights which were its subordinates were under Ainz’s control. That said, Ainz had put it here because he acknowledged its excellent command abilities.</p><br/><p>“I will be heading out after this, let Albedo know.”</p><br/><p>After walking past the Crypt Lord ― who was bowing deeply ― Ainz arrived at the streets.</p><br/><p>He had no objective in mind.</p><br/><p>Rather than taking a walk, it was more like he wanted to find the answer to Pandora’s Actor’s question. He would not be able to sort out what he could normally figure out if he was being bothered from all sides.</p><br/><p>Ainz opened up his stride as he imagined the future which the Sorcerous Kingdom of Ainz Ooal Gown would have under him.</p><br/><p>Part 3</p><br/><p>Ainz and the company advanced in a straight line along the main road.</p><br/><p>It was hard to say the streets were filled with life. That much was obvious when he compared his memories from his time as Momon to the scenes before him now. The expressions of the pedestrians were grim, and they seemed to be moving a little quicker.</p><br/><p>In contrast, the Death Knights walked proudly through the streets. They were probably patrolling in place of the usual city guard. Ainz had only given them simple orders: apprehend anyone engaging in violence, protect anyone who asked for help.</p><br/><p>Ainz turned his gaze toward the city wall.</p><br/><p>A portion of the mass-produced Death Knights were assigned to sentry duty on top of the walls. There were others like them who were watching the city gates or patrolling. However, the most bizarre way in which they were employed was in being ordered to build new villages with the denizens of the slum district.</p><br/><p>The people who ended up being residents of the slums were typically the second or third sons of a family in villages: those who did not have their own farm to work. They dreamt of a better life in the city, but in the end, they could only scrape out a pauper’s miserable existence amidst the ashes of their dreams. Thus, Ainz promised to grant them a plot of land, and sent them out there.</p><br/><p>They were sent to the ruins of villages that had been burned down due to the Slaine Theocracy’s plot. Since they had fallen due to external reasons, all one needed to do was to clear the rubble away, seek new villagers, and the village would naturally recover.</p><br/><p>Because they had been attacked in the past, Ainz permitted the Death Knights and Soul Eaters to go with them as guards, and he also ordered them to help the villagers with their farm work.</p><br/><p>Granted, neither of them were particularly adept at working the fields. However, they were far superior to ordinary human beings when it came to raw, physical strength. Essentially, they were heavy duty farm equipment which did not require fuel and which could function 24 hours a day. They were ideal for the task of breaking ground and heavy labor, and they would surely make great contributions in the coming harvests.</p><br/><p>Ainz’s aim was to build the villages back up within a year, and allow them to achieve basic self-sufficiency. They would then begin a regular harvest in the second year.</p><br/><p>However, the aim of rebuilding the villages was merely to collect their produce as taxes and dump them into the Exchange Box, where they would become YGGDRASIL gold coins. Albedo and Demiurge had praised this idea to the heavens, so it should be quite workable.</p><br/><p>He had lent the undead to them in order to avoid foolishly wasting time on colonizing the wilderness.</p><br/><p>At the same time, since the undead were on loan, he would collect additional rental fees on them in addition to the agreed taxes. While he did not need to charge them rent, he came up with the idea after considering that he might end up loaning the undead to various other people in the future.</p><br/><p>While that plan prioritized sending large numbers of the slums’ residents ― with their families in tow ― out of the city, that alone was not the reason for the lack of people on the streets.</p><br/><p>That would probably be because of Ainz. When pedestrians encountered him on the streets, they would stare with eyes wide before going back the way they came, or circling around him.</p><br/><p>It was like walking in an abandoned wasteland.</p><br/><p>Still, being feared was not bad. It was a dozen times better than being disrespected.</p><br/><p>That said, it’s hard to believe my city would be such a lifeless place…</p><br/><p>He did not care what happened to anyone else as long as the Great Underground Tomb of Nazarick and its NPCs were happy. However, what would his past friends think if they were around?</p><br/><p>Would they be like Ainz, who had been affected by being undead, and end up being influenced by their nature as monsters? Would they end up treating humans as little more than fodder? Or would they continue holding on to their strong emotions from their time as humans?</p><br/><p>What on earth do I want to build this country into…</p><br/><p>Just as Pandora’s Actor had said, Ainz needed to decide on how to run this country and the aim of ruling this city.</p><br/><p>For example, by farming wheat and the like, and tossing them into the Treasury’s Exchange Box he could obtain coins that could be used to to strengthen the Great Underground Tomb of Nazarick. The country would then become one whose sole aim was to produce currency.</p><br/><p>For example, he could breed and slaughter humans, thus making the country produce XP which would be stored within Greed and Generosity.</p><br/><p>For instance, he could hand over all production tasks and work to the undead, making it a country where the living did not need to work.</p><br/><p>And for example―</p><br/><p>From a land filled with love to one ringing with resentment, how would this country which bore the name of the guild turn out?</p><br/><p>He could not hand this decision to his subordinates. This was his duty, his responsibility, as the ruler of Nazarick and the Sorcerous Kingdom of Ainz Ooal Gown.</p><br/><p>“―Fifth, what do you think of this city? Of this country?”</p><br/><p>“My deepest apologies. May I know how you would like me to answer?”</p><br/><p>He had been too abstract. Ainz decided to ask again:</p><br/><p>“Do you feel this is a country where you can live in happiness? Tell me the whole truth and hold nothing back.”</p><br/><p>“Yes. I am very happy in this country because you rule it, Ainz-sama.”</p><br/><p>Ainz looked to the sky and sighed. Well, he should have expected an NPC to give him an answer like that.</p><br/><p>“Just―”</p><br/><p>“Oh, what’s the matter? Tell me anything that comes to your mind.”</p><br/><p>“Understood. Why is it that despite you being here, Ainz-sama, that nobody comes out to pay homage to the ruler of this country, to your mighty form? And the way they hide in the buildings and peek out at you… it’s very upsetting!”</p><br/><p>Fifth snorted. Indeed, many people were spying on Ainz and his entourage while hiding in the shops along the roads. In fact, some of them had gone weak at the knees when they saw the angels.</p><br/><p>“Fifth, do you think humans are boring creatures?”</p><br/><p>“Yes. It is as you say. They were not created by the Supreme Beings, thus they are pitiable lifeforms.”</p><br/><p>More than half the beings in Nazarick thought that way. Even the level 1 maids were no exception.</p><br/><p>“Fifth. All of you are still the most important to me.”</p><br/><p>“Thank you very much!”</p><br/><p>“However, I should show some measure of mercy to the people I rule. After all, they are citizens of the Sorcerer King.”</p><br/><p>“It is as you say.”</p><br/><p>“Then, why not turn this place into a utopia? A wonderful, dream-like world that is as sweet as soaking in honey. A world where they will wish to be ruled eternally.”</p><br/><p>“I feel this is an excellent plan.”</p><br/><p>“Since I intend to conquer the world, these subjects of mine will not just be humans. All the races of the world must kneel before me.”</p><br/><p>“Naturally.”</p><br/><p>Project Utopia.</p><br/><p>This plan was being carried out on the 6th Floor, and was started with the intention of appealing to any players they encountered with the idea that Nazarick was a good guild which welcomed all races.</p><br/><p>Using this place for the experiment sounds like a good idea, Ainz thought.</p><br/><p>“I shall proclaim to the world: only those who serve the Sorcerer King shall have eternal prosperity.”</p><br/><p>“There is no doubt that it is the truth.”</p><br/><p>If he could do that, then if he ever found his former friends ― his former guildmates ― he could proudly show this city off to them.</p><br/><p>It would seem the country Ainz wanted was one where he ruled various races who lived in harmony.</p><br/><p>He would take the vision of Ainz Ooal Gown within the Great Underground Tomb of Nazarick and reproduce it throughout the entire world.</p><br/><p>Just like how his friends might be hiding in some corner of the world, he would make a world where different heteromorphs and races could smile and live.</p><br/><p>The light in Ainz’s eyes grew brighter.</p><br/><p>The Sorcerous Kingdom of Ainz Ooal Gown should be a country where all races could coexist. This was something only the Sorcerous Kingdom could do.</p><br/><p>Even if the founder of a nation was a genius, there was no guarantee that his children would be similarly gifted. And the generation after that, his grandchildren, and his great-grandchildren after them ― there was no guarantee they would be talented either. If the second generation was incompetent, they would be wiped out by society in the third generation. Ainz had heard this story quite often.</p><br/><p>However, if they were ruled by an unaging, undying genius, this sort of thing would not happen. The ideal form of this was to have a dictatorship run by a handful of geniuses.</p><br/><p>With people like Demiurge and Albedo in the Sorcerous Kingdom ― no, it was because they were there that they could make it an eternal paradise. Like Ulbert had once said, a dictatorship run by an iron hand would be great, or something like that.</p><br/><p>Ainz pondered the matter further.</p><br/><p>Led by Demiurge and Albedo, the Guardians were proceeding with their objective of world domination. Ainz could not completely deny their point. After all, this could spread their name to his comrades.</p><br/><p>However, would it not be better to spread that name through means other than ruling through force? By letting the Sorcerous Kingdom of Ainz Ooal Gown be known as a utopia, they could make many people choose to bend the knee and submit to his rule for that sweet, honey-like promise.</p><br/><p>It was like using sugar and a whip.</p><br/><p>If Demiurge and Albedo were the whip, then Ainz would be the sugar.</p><br/><p>What a great idea…</p><br/><p>Ainz had decided.</p><br/><p>Ainz was different from the NPCs that could only disdain those outside of Nazarick. This form of world conquest was something which only he, with his vestiges of humanity, could come up with. He would dominate through overwhelming charm.</p><br/><p>Then, what should he do in order to carry out this plan?</p><br/><p>As Ainz walked again, he thought desperately on the subject.</p><br/><p>He would need methods unlike those of Demiurge and Albedo ― methods which did not rely on strength.</p><br/><p>He could not imagine running a country by himself. Because of that, Ainz would imagine himself as an employee of a small company.</p><br/><p>It would be a small company, the kind which only had a single floor in a building, and the sole employee of that company was Ainz.</p><br/><p>The product of this company would be “The Sorcerous Kingdom’s Outstanding Rulership”. He would be promoting the sales of this product.</p><br/><p>First, he had to consider his target market. Only then could he deliver this product to the hands of those who needed it. However, he lacked information on his consumers. Why was that? It was simple ― because he did not have enough publicity.</p><br/><p>That said, it was not a matter of running to various cities and giving out pamphlets at the entrance. That would just be a waste of time. Ainz was the sole employee, so he had to consider other methods.</p><br/><p>There was nothing like the mass media in this world. Although traders and other such professionals had their own intelligence networks, any publicity from them was hardly guaranteed to be accurate. Before Ainz had noticed, he was already at the entrance of the Adventurer’s Guild.</p><br/><p>Perhaps it was because he had come here often as Momon, but it seemed to have become a habit. That was probably a symptom of workaholism, right?</p><br/><p>Ainz smiled bitterly, and opened the door.</p><br/><p>The counter within the building loomed into view. There was a female receptionist seated there. On her left was a large set of double doors, and on the right was a noticeboard, which had requests on parchment attached to it. And the adventurers who should have been standing before it ― were not there.</p><br/><p>The Guild was empty. There was no comparing it to what he had seen during his time as Momon.</p><br/><p>Ainz ignored the goggle-eyed receptionist who was staring at him, and walked to the noticeboard.</p><br/><p>While he still could not understand their letters, he had memorized a few phrases, which included the month and the year.</p><br/><p>At a glance, there were only old requests from a month ago. In other words, they were unimportant, repeating jobs.</p><br/><p>“…Receptionist. There seem to be much fewer jobs now. Has nobody put in any new requests?”</p><br/><p>“Hiii… yes, yes, that’s right. These are all we have, Your Majesty.”</p><br/><p>So the number of adventurers had gone down because the number of requests had gone down as well.</p><br/><p>The cause of that was Ainz.</p><br/><p>Ainz had used his own military forces ― the Death Knights ― to patrol the streets and maintain the internal security of the Sorcerous Kingdom. In the end, it caused people to flee the threat of those monsters.</p><br/><p>He considered that if they kept up their patrols, people like adventurers might completely cease to exist.</p><br/><p>He would need to prepare requests for them in order to keep them around ― no, there was no need to keep the adventurers around.</p><br/><p>Anything adventurers could do, Death Knights could do better ― though they might have difficulty with certain tasks, like picking herbs. But in that case, all he had to do was to rent the Death Knights out to herbalists as bodyguards.</p><br/><p>Ainz still could not think of any uses for adventurers. And when one got down to it, the fact of the matter was that adventurers cost money to hire. E-Rantel and its lowered income did not have the luxury of such things.</p><br/><p>In addition, they were hardly indispensable.</p><br/><p>With that in mind, Ainz turned to the outside.</p><br/><p>What a banal job…</p><br/><p>He recalled the first time he and Narberal had come to the Adventurer’s Guild in this city.</p><br/><p>He had thought that adventurers were like what he had seen in YGGDRASIL, those who ventured into the unknown and trekked to various places around the world.</p><br/><p>If they’re just anti-monster mercenaries, then once the need for them is gone, they’ll be out of a job. It’s the same all over the world. To think that the image of adventurers as they were represented in YGGDRASIL was ultimately nothing more than a dream… A dream? Of exploring the unknown and travelling the world? Could it be…</p><br/><p>Inspiration flashed through Ainz’s mind.</p><br/><p>If he changed adventurers from monster-hunting mercenaries to explorers of the unknown like in YGGDRASIL, that would mean they would carry the name of the Sorcerous Kingdom into unexplored lands.</p><br/><p>Ainz did not just want to reach the human world, but all the other races as well. He could easily promote himself in the human world through traders’ connections. However, since that was not enough, adventurers were the best choice for the job.</p><br/><p>“Hmhm,” Ainz nodded.</p><br/><p>Although the receptionist looked at him in a puzzled way, he paid her no heed. Or rather, if he had minded her, that rare flash of inspiration would have vanished.</p><br/><p>Thinking like the head of a small business, Ainz decided to contemplate the outcome of this plan.</p><br/><p>However, the number of adventurers in the Sorcerous Kingdom is slowly dwindling. If this keeps up, the situation will continue to deteriorate. They might even vanish completely in the near future. What can I do to reverse this trend?</p><br/><p>It was simple enough to increase their numbers. All he needed to do was reverse the current circumstances ― in other words, the Sorcerous Kingdom would pay for monster elimination. However, that went against Ainz’s goal of having adventurers be explorers of the unknown. While he could also place requests to have them advertise him, Ainz did not have the money for that.</p><br/><p>There were literal mountains of gold in the Great Underground Tomb of Nazarick, but those were not Ainz’s personal funds. While the NPCs would all agree that all the wealth in Nazarick belonged to Ainz, he did not want to use that money on a personal project.</p><br/><p>Just as Ainz was deep in thought, the sound of a door opening came from the entrance.</p><br/><p>As he turned around, he saw adventurers ― who he seemed to have met before ― standing in the doorway, frozen in place as they watched him.</p><br/><p>Hm? That guy’s name is… let me see… Yokmok? No, that’s not right, but it’s close.</p><br/><p>It felt like he could reach it with his fingertips, but he could not quite get his hands on it. This frustration made Ainz dredge up the depths of his memories with all his will.</p><br/><p>“Moknak…?!”</p><br/><p>Just as he had found the answer, he blurted it out without thinking. Having been addressed by name, the adventurer froze in place.</p><br/><p>Crap!</p><br/><p>It was too late by the time he realized it. He could feel the eyes of the guild receptionist looking in this direction.</p><br/><p>It was impossible that the new ruler of E-Rantel, the Sorcerer King Ainz Ooal Gown, would possibly know of a mere mithril-ranked adventurer. And if he did know the man, what did that imply? Ainz’s brain spun into high gear as he cogitated, but before he came up with an answer, Moknak spoke:</p><br/><p>“Did, did you hear that from Momon-dono? My name, that is…”</p><br/><p>“Umu, yes. That is correct.”</p><br/><p>Ainz decided to catch that pass. A pair of dramatically opposite emotions appeared on Moknak’s face, expectation and fear.</p><br/><p>Having recovered from his prior perturbation, Ainz began a deeper analysis of the situation.</p><br/><p>He remembered that this man was the leader of the mithril-ranked adventurer party “Rainbow”. The first time he had seen him was during the Vampire Disturbance incident. They had spoken several times after that, but since they had not met recently, the man had slipped from his mind.</p><br/><p>Much like other adventurers and soldiers, he seemed to worship Momon as a hero. So how would he feel about Momon becoming a minion of the Sorcerer King?</p><br/><p>Why would Momon mention him to the Sorcerer King? Idle chatter? Or did Momon sell him out? His heart was probably awhirl with doubts and suspicions like that.</p><br/><p>Ainz began looking for a way to turn this danger into an opportunity.</p><br/><p>“When I asked him about capable adventurers around here, he told me about Moknak, the leader of ‘Rainbow’.”</p><br/><p>Moknak, who had originally lowered his head, suddenly looked back up.</p><br/><p>“Is ― is that true?”</p><br/><p>“Do you doubt my words?”</p><br/><p>“No! Of course not…”</p><br/><p>When discussing business with a client, the first thing one should do was praise one’s counterparts. Few people would react poorly to praise. Once they were in a better frame of mind, they could then talk business. This was both a basic skill for a salesman, and also an ultimate secret.</p><br/><p>Now that he had shaken up the other side and fully seized the initiative, Ainz did not waste the chance to fire off another question.</p><br/><p>“Tell me, why are you in E-Rantel?”</p><br/><p>If he wanted to learn more about adventurers, the fastest way to achieve that was to directly question an adventurer.</p><br/><p>Moknak was baffled by Ainz’s question, but before long, he seemed to have gathered up enough courage to answer him.</p><br/><p>“Because of the undead, Your Majesty. This place is close to the Katze Plains, and we can kill monsters for money without ever running out of them.”</p><br/><p>Although Ainz did not quite understand, it would seem that even as the sweat gushed off him, Moknak had a rebellious smile on his face that seemed to say, “There, I said it”.</p><br/><p>Ainz had plans to bring the Katze Plains under his dominion in the near future. Of particular note were the rumors of a ship that cruised along the land, which piqued Ainz’s interest.</p><br/><p>“Is that so.”</p><br/><p>“Eh?’</p><br/><p>“Hm?”</p><br/><p>“Ah, no…”</p><br/><p>What a frustrating man. Ainz refused the urge to sigh and impulsively asked:</p><br/><p>“Is that all?”</p><br/><p>“…No, there’s more. Before Momon-dono came here, we were the only mithril-ranked adventurers among the senior adventurers, so it was easier for us to get well-paying jobs.”</p><br/><p>So it was money after all. Perhaps earmarking part of the budget for adventurer remunerations might be the best course of action.</p><br/><p>“Also, I was born in this city, so I know many people here. And also, all sorts of magic items flow through here.”</p><br/><p>“Hoh, magic items, you say.”</p><br/><p>“Yes. After all, magic items have saved my life in the past, so as an adventurer, I would naturally want to base myself in a place with good access to them.”</p><br/><p>In YGGDRASIL, there were also stories of how a simple magic item averted a total party kill. That said, he had also seen many people who looked like adventurers in the Imperial Capital’s markets. In other words, if he could set up a larger-scale magic item business than the Imperial Capital, it would be sure to draw adventurers over.</p><br/><p>He would probably be able to achieve excellent results by making magic items with appropriate data crystals and then auctioning them off. However, that would fundamentally be raiding Nazarick’s reserves, and there was no guarantee that Ainz and the others would not find the technologies developed with those items as a base pointed at their throats instead.</p><br/><p>It should be fine if I use it as bait, right? No, I’d rather avoid using Nazarick’s resources if I can avoid it. So how about items made using the magical technology of this world? That way, we could hand them off to other countries without causing any problems… ah, this is hard. I’ll leave that idea for another time.</p><br/><p>“Ah…”</p><br/><p>Moknak’s worried voice jolted Ainz’s mind back from the depths of contemplation.</p><br/><p>“Your Majesty, may I know why you are asking me these questions? If you will permit me to be frank…”</p><br/><p>Moknak grit his teeth, and continued in a deeply pained voice.</p><br/><p>“We are like dust when compared to even one of the undead that Your Majesty commands. With such powerful undead defending the area around this city, there is little point to the existence of adventurers within the Sorcerous Kingdom.”</p><br/><p>What should he say now? What turn of phrase could he use to leave him ― and the receptionist looking over here, and the guild staff who had managed to cluster around them unseen ― with a good impression of himself?</p><br/><p>Or perhaps, he could take a dangerous risk and directly shut him up by saying “There is no need to explain that to you.” That might be safer. However, if he did that, it might make them even more suspicious. There ought to be a better―</p><br/><p>No, I have to believe in myself. I’m a man who has overcome many dangers in the past. I ought to be able to think of some way past this problem!</p><br/><p>Ainz allowed his presence to radiate forth from him.</p><br/><p>Come to think of it, you’ve already got such a clear picture of things in your mind. So why are you still in this city? Because you were born here? Do you have a girlfriend?</p><br/><p>The answer to those questions would determine the direction in which the Sorcerer King would take this conversation.</p><br/><p>“Before I answer you, I would like you to answer my first question. Why are you still in this city?”</p><br/><p>“That, that’s because…”</p><br/><p>Moknak began stumbling over his words. Then, despite hesitating a little, he continued:</p><br/><p>“It’s because of Momon-dono. Momon-dono stayed in this city to be our shield. That being the case, how could I, a native of this city, do something as disgraceful as running away?”</p><br/><p>In that instant, Ainz smiled.</p><br/><p>Granted, while he had been Momon, he had understood this man to a certain extent. However, he had not expected him to bare his heart so readily.</p><br/><p>“Is that so. Then, I shall answer your question.”</p><br/><p>Ainz pretended to fall silent for a while, and then in a stern voice he announced:</p><br/><p>“It is because of Momon. Since all of you might someday become people like Momon, I wanted to know what adventurers wanted, and what they sought.”</p><br/><p>Moknak’s eyes went wide. The sounds of gulping could be heard from the nearby guild employees.</p><br/><p>“Momon is strong, but more importantly, he has a noble spirit.”</p><br/><p>It felt a little embarrassing to say that sort of thing about himself, but that was how Momon’s character had been planned, so it could not be helped.</p><br/><p>“And then, I saw something like Momon’s radiance among you adventurers.”</p><br/><p>Did my acting practice pay off, Ainz wondered as he uttered those words. A thunderbolt seemed to flash behind Moknak and the others.</p><br/><p>“But, but Momon-dono is a supreme being, that only a chosen one could aspire to be. We couldn’t possibly reach his―”</p><br/><p>“So you’re saying that Momon is blind to his own greatness, then?”</p><br/><p>“What! Did, did Momon-dono say that too?!”</p><br/><p>“Not directly.”</p><br/><p>While he did not think it was funny at all, he nevertheless strove to imply that he found it amusing. Ainz took on a king’s smile ― the result of much practice ― and showed it to everyone.</p><br/><p>“Even if you cannot do it, how about your children? Your grandchildren? Are you saying nobody around you could possibly give rise to someone like Momon? I am an immortal being, and the ruler of the Sorcerous Kingdom. It is only natural that I would want to take action to inspire genuine loyalty toward me from the next Momon. This is the meaning that I, as a ruler, have found for the existence of adventurers within the Sorcerous Kingdom. Well, there is another reason, but since it has not fully taken shape in my mind yet, I shall leave it at that for the moment.”</p><br/><p>The air around him was silent.</p><br/><p>Hm? Didn’t it work? Is this man not a zealous fan of Momon?</p><br/><p>Just as unease was beginning to descend upon Ainz, Moknak bowed deeply to Ainz.</p><br/><p>“Your Majesty, I am grateful for this meeting with you, and the opportunity to learn of your thoughts.”</p><br/><p>As Moknak raised his face, there was no trace of the unease, fear or doubt that had originally been there. In contrast, he had a cheerful, carefree smile in its place.</p><br/><p>“…What an awesome man. To think you possessed such incredible charisma, surpassing even your own potent magic.”</p><br/><p>“I too am glad to have encountered such excellent adventurers. Someday, I would like to take you under my wing.”</p><br/><p>Moknak’s face relaxed, feeling a little happier now.</p><br/><p>“Still, Your Majesty. The Adventurer’s Guild remains unaffiliated with the government. Neither am I. Can you really take us on as subordinates?”</p><br/><p>“Umu. I came for precisely that objective. Granted, this is just a rough draft and has not yet fully taken shape… Receptionist, tell the guildmaster that the Sorcerer King would like to speak with him.”</p><br/><p>“Y-yes!”</p><br/><p>The receptionist ― who had been dumbly listening to their conversation ― ran out of the room in a hurry.</p><br/><p>“Then, Your Majesty, we bid you farewell.”</p><br/><p>This was completely unlike how they had acted when they had first showed up. Moknak delivered a bow full of respect before he turned and left.</p><br/><p>Now then… what should I do next.</p><br/><p>The main thrust of Ainz’s incomplete plan was to use adventurers to extol the virtues of the Sorcerous Kingdom. There were three main points to that plan:</p><br/><p>The first was the expansion of the Adventurer’s Guild. There was no point in an organization that only had 10 members or so.</p><br/><p>The second was to nurture them. Weaklings could not go far, and if the gospel of being ruled by the Sorcerous Kingdom spread too slowly, it would not reap him many benefits.</p><br/><p>The third was to make them want to genuinely help him. It was not that he could not use Momon, but if Ainzach wanted to help him out of his own free will, it would make things much easier in the future.</p><br/><p>I need to solve these three problems before negotiating with Ainzach. Still… it’s really hard to negotiate without any information at all. Ah~ my stomach aches.</p><br/><p>All he could do now was to pray that the Guildmaster was not in. Unfortunately, the first thing which the receptionist said when she returned was, “This way, please.”</p><br/><p>Ainz looked up to the ceiling, and then followed behind the receptionist.</p><br/><p>Part 4</p><br/><p>He had walked through this corridor quite a few times as Momon, and he passed by the guildmaster’s room ― though he did not enter, but was instead taken to the room beside it. That room was used for entertaining guests.</p><br/><p>A powerfully built man came out to meet him ― the guildmaster Pluton Ainzach.</p><br/><p>Ainz had met him as Momon several times before ― he had dragged Momon with him to adult establishments in the past. However, this was the first time he had encountered the man as the Sorcerer King Ainz Ooal Gown, so he had to be deeply aware of his words and actions.</p><br/><p>“Oh, it is Your Majesty, the Sorcerer King. As a citizen of this country, nothing could delight me more than to receive you within my humble abode. Please, come in, and though this is a dirty place, I bid you take a seat if it pleases you.”</p><br/><p>Ainz sat down at the place where Ainzach had indicated.</p><br/><p>Fifth stood behind Ainz, while three of the angels followed Ainz inside. The rest remained outside the room, awaiting orders.</p><br/><p>“By right, I should have been the one to visit you, but I am deeply grateful that you came all this way to see me.”</p><br/><p>Ainzach genuflected, and bowed his head deeply.</p><br/><p>Ainz smiled bitterly as he saw Ainzach putting on that act.</p><br/><p>It was completely different from how he had been when speaking to Momon. His kind voice was tinged with respect, but that was just a front. Ainz could not help but smile after realising that all this was just professional technique at work. Of course, his own expression had not changed at all.</p><br/><p>Ainz turned his eyes toward the other door in the room, the one which was not the entrance.</p><br/><p>That door led to the guildmaster’s room. He would probably be talking in there if he was Momon. The fact that the guildmaster had received him here made Ainz aware of the distance between the two.</p><br/><p>“Is something the matter, Your Majesty?”</p><br/><p>Ainzach had raised his head to peek at Ainz, who seemed to have ignored him in favor of looking at the room to the side. Ainz could not help but snort at his foolishness.</p><br/><p>Ainzach’s face froze. Perhaps he thought that laughter was directed at him.</p><br/><p>Ainz felt disgusted by his rudeness, but the Sorcerer King could not apologise. Instead, he decided to push ahead with the conversation in an attempt to gloss it over.</p><br/><p>Still, what sort of attitude should he take toward the guildmaster?</p><br/><p>Ainz was still feeling out the proper way to be a king, and did not have any knowledge in that field. The only thing guiding him was a vague feeling of “this should be right”. With that, he decided to try something.</p><br/><p>“I think you should have heard about it by now, Ainzach, but I have a proposal for you.”</p><br/><p>“―Forgive me, Your Majesty, but I am unsure of what you speak. If it is possible, could you start from the beginning?”</p><br/><p>From his previous interactions with the man, Ainz knew that Ainzach was a capable man who was also capable of lying through his teeth. There was a high chance that he already had a firm grasp on the situation. That was probably why he had not been alarmed by the angels.</p><br/><p>That being the case, there was no need to beat around the bush. Ainz decided to speak directly.</p><br/><p>“I intend to incorporate this Adventurer’s Guild into the Sorcerous Kingdom.”</p><br/><p>“…Is that so. I do not think anybody will object to that.”</p><br/><p>“Hoh. I have heard that the Adventurer’s Guild has always held itself to neutrality. Are you truly fine with this?”</p><br/><p>“All shall proceed as you desire, Your Majesty. This nation is governed by the laws which you have set down. If Your Majesty wishes to subordinate the Adventurer’s Guild to his will, nobody can gainsay that decision.”</p><br/><p>Ainz snorted again. That reaction seemed to get a rise out of Ainzach. Ainz sensed that he had gotten to the guildmaster, from the deep look in his eyes.</p><br/><p>“Indeed, it shall proceed as I desire. However, do you truly intend to go along with it? Or perhaps you intend to warn off the adventurers and send them to the Empire and the Kingdom before turning over an empty shell of a guild to me.”</p><br/><p>Ainzach looked intently at Ainz, and then he rounded his shoulders, as though to say, “So that’s as far as I go, huh.”</p><br/><p>“As expected of Your Majesty. To think you would not only claim and rule this city, but even see through my innermost thoughts… did you read my mind with magic?”</p><br/><p>“No, I did not use magic. It was nothing more than experience.”</p><br/><p>“Because you have lived a long time, I take it. My my, what a fearsome lord you are. Then, what is to become of me?”</p><br/><p>“Nothing will happen to you.”</p><br/><p>“…I will not thank you for that, you know?”</p><br/><p>“I do not need your thanks. More than that, I want your opinions. I have heard that adventurers exist to defend the people. Thus, they do not wish to be used in wars between humans and have maintained a degree of independence from any nation. Is this true?”</p><br/><p>“It is as you say, Your Majesty. In truth, when Your Majesty laid claim to this town, we had no intention of offering any resistance.”</p><br/><p>“And yet the man called Momon stood before me…?”</p><br/><p>Ainzach grunted, “Oh.” Well, there was no point giving himself a hard time. Ainz decided to continue speaking, and of course, he had to help cover for Momon.</p><br/><p>“Ah, I won’t pursue that matter. After all, we are working together, in a sense. Indeed, that cooperation is one of the reasons I can peacefully rule this place.”</p><br/><p>Ainzach seemed to be on the verge of saying something, but Ainz ignored him and pressed on.</p><br/><p>This was the real meat of the issue.</p><br/><p>He had to bring Ainzach over to his side, and make him want to aid the Sorcerous Kingdom out of his own volition.</p><br/><p>After recalling the various gripes and complaints he had heard during his time as Momon, Ainz said:</p><br/><p>“…Then, I have a question after hearing your words. You were quite certain that ‘Adventurers exist to defend the people’. However, who exactly are these ‘people’?”</p><br/><p>“May I know what you mean by that?”</p><br/><p>There was a baffled look on Ainzach’s face.</p><br/><p>“In other words, does the word ‘people’ encompass all humanoids, or just human beings? Are Elves, Half-Elves and other species that live in harmony with humanity covered by that word?”</p><br/><p>“Well, about that, yes, they are included.”</p><br/><p>“How strange, then. I seem to recall that Elves are slaves in the Empire, are they not? That being the case, can you really say that you are protecting them? Are they not slaves because they ran afoul of the Empire’s laws?”</p><br/><p>Ainzach lowered his head. Then, he looked up to face Ainz again.</p><br/><p>“…I am but the master of the Kingdom’s Adventurer’s Guild. Thus, I do not know what the Empire’s Guild has in mind.”</p><br/><p>“So you’re just trying to weasel out of it with wordplay, then…”</p><br/><p>AInzach’s eyes went wide, and there was clear anger there.</p><br/><p>“Your Majesty, such mockery―”</p><br/><p>“Mockery? Is this not the truth? …I shall ask you again. Are you not trying to get yourself off the hook by being ambiguous?”</p><br/><p>Ainzach lowered his eyes.</p><br/><p>“…It is as you say.”</p><br/><p>“You say that you will defend Elves and Half-Elves, but you have not done that at all. Why is that?”</p><br/><p>Ainzach gave his explanation, beginning from the position that he was unclear about the intentions of the Adventurer’s Guild in the Empire.</p><br/><p>“Though we are an Adventurer’s Guild, we cannot fully escape the bonds of countries. While the Adventurer’s Guild proudly declares itself to be above their rule, we remain obedient to the laws of the nations. We are an armed organization. It would be very dangerous if a group with our strength was to turn that power against the nation. I believe the Empire’s Guild thinks along the same lines.”</p><br/><p>“That is what I meant. Since you are bound by a country’s laws, then there should be no problem with being incorporated into that country. That being the case, why do you dislike that?”</p><br/><p>“Both the Empire and the Kingdom covet our strength. After all, only adventurers like ourselves can fight on an even footing with powerful monsters. Because of that, nobody has made any difficult requests of us until now. However, that point is moot where Your Majesty is concerned. If we are made subordinate to you, there is a chance that our strength may be directed against the people.”</p><br/><p>“And so, you seek to resist assimilation into the country because you fear being made to use force against the common man, am I correct?”</p><br/><p>“It is as Your Majesty says. We do not wish to be made to suppress people or to fight in wars. It would make us accessories to many deaths.”</p><br/><p>Ainz could not help but laugh at this. Well, I knew that already. But of course, he could not actually say that.</p><br/><p>“Then sit. I shall now explain what I intend for you in the future.”</p><br/><p>Ainz had to tell him to sit again before Ainzach finally complied, taking a seat out of fear. Then, Ainz began his explanation.</p><br/><p>“I am considering the possibility of having adventurers take on other, more meaningful types of work. I want adventurers to discover the unknown and explore this world.”</p><br/><p>Ainz felt Ainzach looking directly at him for the first time.</p><br/><p>“For instance, there is a patch of wilderness to the south, between the Theocracy and the Holy Kingdom. But do you know the details of the terrain and what manner of monsters live there?”</p><br/><p>“No, because there are many demihuman settlements there. The Adventurer’s Guild of the Kingdom has sent people there, but none have returned in one piece. Therefore, we know next to nothing about it.”</p><br/><p>“Then, there is a mountain range to the southwest which serves as a natural barrier between yourselves and the Theocracy. What do you know of that place?”</p><br/><p>“No, we do not have any detailed information about that region.”</p><br/><p>“Are you not ashamed of that ignorance? No, perhaps it may seem unavoidable from the point of view of an adventurer. After all, you are an organization that protects the people, so there is no need to know about places which do not contain any people. Although, there is a chance that lifesaving herbs might grow in such regions.”</p><br/><p>Ainzach’s mouth tightened into a straight line at that provocation.</p><br/><p>“Once I take the Adventurer’s Guild under my banner, I plan to fill in all the blank spaces on the map.”</p><br/><p>“…Would it not be better to hand that task to the people close to Your Majesty?”</p><br/><p>“Don’t be foolish. I heard that you used to be an adventurer, Ainzach, so let me ask you again: When you think about the word ‘adventurer’, really ponder it, do you think you exist merely to fight monsters? Before I learned more about adventurers, I thought that they were beings who turned the unknown into the known.”</p><br/><p>Ainzach bit his lip so hard that it seemed as though he was trying to draw blood.</p><br/><p>“―We must protect the people.”</p><br/><p>“There is no need for that. In this Sorcerous Kingdom, I will protect the people as their ruler. Given the sharp drop in requests, you should be able to understand the truth of my words, am I wrong?”</p><br/><p>Ainzach answered in the affirmative, in a pained voice that sounded more like a groan.</p><br/><p>“Then what will you do next? Will you move to the Kingdom or the Empire to protect the people? That sounds a lot like what a specialized monster-hunting mercenary would do.”</p><br/><p>Ainz paused here. The next step would be persuasion. He had to devote the full capacity of his mind to what he said next.</p><br/><p>“Earlier, you said ‘my subordinates should do it’. From a certain point of view, that would be a good solution. It is true that my subordinates excel at slaying the enemy. However, many of them raise serious doubts in my mind about whether or not they can build good relationships with the beings they meet in this unknown world. It is a great mark of shame for me. Therefore, I wish to leave this task to you adventurers.”</p><br/><p>While he was quite interested in the silent Ainzach’s reaction, his presentation was not yet finished.</p><br/><p>“Well, since I plan to have them do such a dangerous job, I will naturally give them my full support. Do you not think it is necessary for me to assimilate the Adventurer’s Guild for that?”</p><br/><p>“…All you have to do is hire us.”</p><br/><p>“I see. So you are quite confident in your strength. I do not dislike that courage.”</p><br/><p>“What, what do you mean, Your Majesty?”</p><br/><p>“Discovering the unknown includes the possibility of making unfortunate encounters with other civilizations. If that happened, do you not think the Sorcerous Kingdom would disavow you? In addition, the Adventurer’s Guild would then be solely responsible for dealing with any problems which arose, am I wrong? Since you claim to be an independent organization, do you not think that is to be expected? After all, any contracts I make with you will not incur any loss to the Sorcerous Kingdom.”</p><br/><p>Ainzach fell silent.</p><br/><p>“That is what it means to act independently, free from any nation’s control, is that not the case? And if a situation escalates to an international level, you would thus have to deal with it yourself… is what I am saying so laughable?”</p><br/><p>“Certainly not, Your Majesty,” Ainzach nodded deeply, to show that he understood. “Every word you have spoken is correct.”</p><br/><p>“Just so. But if that happens, valuable adventurers ― professionals who possess special skills ― will end up being depleted. As it takes human beings a long time to mature, the death of any talented individual will be a great loss. Because of that, I wanted to acquire the Adventurer’s Group. And then, they would receive my full support as the price for having to carry out my orders.”</p><br/><p>“That is a very attractive proposal… However, I have a doubt I wish to clarify. Once we have understood the unknown, does that mean we will then become invasion forces for the Sorcerous Kingdom?”</p><br/><p>“That is a very complicated question. I cannot rule out that possibility entirely. After all, if we learn that an enemy which exists in unknown lands plans to launch an invasion, it is quite reasonable to use that information to take the initiative and strike the first blow instead. Said enemies might include demihumans like Ogres or Orcs who live in the wilderness. Or perhaps, it might be necessary to launch an invasion to show them the difference between their strength and ours. If there was a ferocious monster beside you which was sharpening its fangs, would you not want to strike first instead?”</p><br/><p>“I see, it is as you say, But―”</p><br/><p>“…Hm.”</p><br/><p>“Is something the matter, Your Majesty?”</p><br/><p>“It’s nothing, forgive me for interrupting you. What were you about to say just now?”</p><br/><p>“…Understood. However, what troubles me is whether or not it is right to subdue by force those races who are living in peace.”</p><br/><p>“What races are you thinking of? Elves, perhaps?”</p><br/><p>“Well, perhaps.”</p><br/><p>“…The details of this sort of thing are top secret as they are linked to national policy, so I cannot discuss this openly. If invasion and conquest would be advantageous to the Sorcerous Kingdom, we might end up doing so, or if they would only beget disadvantages, we would avoid such acts. This is quite common among countries, am I correct? However, if it comes to the simple matter of invasions, I can plainly state that I have adequate military forces at my disposal. I do not expect adventurers to collect information on enemy nations, nor do I need them to scout routes for me. As I said earlier, I simply desire them to explore the unknown and discover all sorts of things. I give you my word on this.”</p><br/><p>However, right after saying that, Ainz asked Ainzach:</p><br/><p>“Still, it does seem you treat races differently depending on how attractive they are. Why did you not say that line about ‘whether or not it is right to subdue by force those races who are living in peace’ when the topic of invading Orcs and Ogres came up?”</p><br/><p>“That, that’s because they’re demihumans―!”</p><br/><p>“Hahahaha. I see, I see. So that is what you think. I understand, I understand. So, what is your answer?”</p><br/><p>Ainzach seemed to want to say something, but he immediately shook his head. That was probably to change his mind.</p><br/><p>“Must I answer that question immediately, Your Majesty?”</p><br/><p>“Certainly, I would like you to answer right away. However, this matter is of weighty importance, and you must prepare for it by discussing it with others. The fact it takes time cannot be helped. However, I would like to know what you think, Ainzach.”</p><br/><p>Ainz leaned forward, so he could look right into Ainzach’s eyes from close up.</p><br/><p>“I am very angry. But more than that, I am saddened by the fact that you are nothing more than simple monster exterminators. How dare people like you call yourselves adventurers? Ainzach, what do you think? Are you willing to adventure under my rule? It is my hope for you all that―”</p><br/><p>Here, Ainz paused for a beat. Then, he let the strength flow into his eyes and his voice.</p><br/><p>“―That you will all be able to become ‘Adventurers’.”</p><br/><p>Tension filled the room. As though observing an opponent who had been slain by his finishing move, Ainz held his breath ― although he could not breathe to begin with ― and awaited Ainzach’s response.</p><br/><p>“…I feel this is a very attractive proposition.”</p><br/><p>The lights within Ainz’s empty orbits dimmed. It seemed like he would find some reason to refuse.</p><br/><p>“―Therefore, I intend to ask the others if they can accept this proposal. It is true that using adventurers like us for such a purpose is like a dream come true. Becoming agents of the Sorcerous Kingdom is something we can come to terms with at some point. If I might be allowed to speak as a former adventurer… I would be happy to help.”</p><br/><p>―Eh, does that mean it worked?</p><br/><p>“Really now…”</p><br/><p>Ainz leaned back against the sofa.</p><br/><p>The joy of his speech’s success spread steadily through him. It was like the feeling of leaving a client after clinching a deal, then rushing to a coffeeshop to call up one’s own firm and shouting “I did it!” over the phone.</p><br/><p>He had not expected his experience as an adventurer to end up being used here. No, it was because of that experience that Ainz could come up with that proposal.</p><br/><p>And just then, Ainz thought of something that was so important it had to be addressed right away. It concerned the future of the Sorcerous Kingdom which he envisioned.</p><br/><p>“Ah, that’s right. One more thing.”</p><br/><p>Ainz raised a bony finger.</p><br/><p>“When you said you wanted to protect the people, you defined it as encompassing all humanoids. Thus, the purpose of adventurers is to protect all people within that definition.”</p><br/><p>“Yes. That is true, Your Majesty.”</p><br/><p>“And then, when the topic turned to invasion, you indicated that it would be alright as long as they were demihumans. Is that correct?”</p><br/><p>Ainzach nodded, his expression saying, “so what?”</p><br/><p>“The Sorcerous Kingdom will accept all races as its subjects. That is to say, not just humanoids, but demihumans and heteromorphs. Therefore, if the philosophy of adventurers is to protect the people, then you must defend demihumans and heteromorphs as well.”</p><br/><p>Ainzach’s eyes went wide.</p><br/><p>“What are you saying?!”</p><br/><p>“…What’s wrong? I do not understand why you are so agitated. In my country, there is no difference between humans, demihumans or heteromorphic beings. If they acknowledge me as their king, then they shall be my subjects.”</p><br/><p>“This, this is too ridiculous. This is impossible, Your Majesty!”</p><br/><p>“Is that so? I have heard of a country to the north of the Kingdom called the Republic. Are there not many races which coexist there?”</p><br/><p>“Indeed, I have heard of such a country… no! Do you intend to have us coexist with those races which see humans as little more than food?”</p><br/><p>“I see, it is as you say. The Sorcerous Kingdom will not permit its subjects to eat fellow subjects. I will make that a matter of the law. That should be enough, right? However, I will not stop them if they seek to prey upon those who are not my subjects. After all, I am not the sort who will interfere with my people’s dining habits… no, seeing the members of one’s race being butchered and sold for meat is damaging to the mind… perhaps that matter will require further debate.”</p><br/><p>According to Lupusregina, the villagers of Carne lived in harmony with Goblins and Ogres. Thus, there was no reason for that to be impossible for this city. That said, the sheer number of people involved would complicate the matter.</p><br/><p>“What, what exactly do you intend, intend to do?”</p><br/><p>“You certainly do ask a lot of surprising questions. Why not ask why all of you, as fellow living creatures, cannot be united? As one of the undead, I find that point quite difficult to understand. To me, there is no difference between humans and Goblins. All races will be equal under my rule. Of course, I shall be above you as your absolute ruler, as will the subordinates under me.”</p><br/><p>Ainzach’s breathing seemed to shift through a variety of speeds, before calming down in the end.</p><br/><p>“So you will take Goblins under your banner ― make them into your citizens?”</p><br/><p>“Did you not hear what I said before? I said I would take Orcs and Ogres as my subjects as well, no?”</p><br/><p>“Forgive, forgive me. I did hear that, but I believed that they would be your slaves.”</p><br/><p>“That answer certainly suits a race which would take Elves as slaves. Let me repeat myself ― all citizens under my rule will be equal.”</p><br/><p>As he glanced at the way Ainzach was panting, Ainz considered if the man had picked up on his intentions.</p><br/><p>An extreme interpretation of those words would be that every subject of the Sorcerous Kingdom was a slave of the Great Underground Tomb of Nazarick and its members. Of course, he would not say that. Nor was there any need to say that. It would be best if Ainzach did not pick up on that at all.</p><br/><p>“There are many Goblins under my protection. In a few days, a group of Goblins will visit E-Rantel. Do try mixing with them. The preconceptions you have of Goblins will surely be shattered. In addition, Lizardmen do not eat much meat, their primary diet being fish. Dryads and Treants love clean water and sunlight, and they only attack humans in self-defense.”</p><br/><p>“Have you already taken that many vassals under your banner?”</p><br/><p>“There is no doubt about that. There are quite a number of demihumans and heteromorphs which have become my subjects. Oh, it seems we’ve drifted quite far off-topic. Then, Ainzach, I take it you personally approve of the Adventurer’s Guild becoming a part of the Sorcerous Kingdom?”</p><br/><p>“―As long as Your Majesty is true to his word.”</p><br/><p>“You do worry a lot, do you not? I am not lying. Adventurers should seek to explore the unknown.”</p><br/><p>If possible, he hoped to put all sorts of races together into parties and send them out.</p><br/><p>“Then, I will leave the task of explaining the matter to the other adventurers in your hands. If any adventurers do not approve of becoming public servants, then I will have no qualms about letting them leave.”</p><br/><p>“Will that really be alright?”</p><br/><p>“Forced cooperation will not be effective. That said, one can imagine that large changes to the organization’s structure and sudden deviations from current practices will cause a lot of problems. Therefore, the status quo will be maintained, to some extent. The most obvious change will only be the establishment of an investigative office for the guild and the guildmaster.”</p><br/><p>All that was left was the most important part; the inducements which would make more adventurers want to join the Adventurer’s Guild of the Sorcerous Kingdom.</p><br/><p>“The support which the Sorcerous Kingdom offers will primarily include the establishment of a training facility. It would be a terrible loss to blaze a trail into distant lands, only to be slain by unknown monsters. Therefore, a more practical training method than the current model ― that of live combat against monsters ― will be required. Considering that adventurers need to get used to team combat, it might be a good idea to build a labyrinth for them to delve into.”</p><br/><p>And the part of the monsters would be filled by Nazarick’s POP undead.</p><br/><p>“I feel that this is a very good idea. Only, it would surely be a sizeable undertaking.”</p><br/><p>Since the staff would be composed of the undead, who did not require salaries, the operating costs would not be too high. However, there was no need to be completely open with the information. One ought to sell favors without hesitation when the need arose.</p><br/><p>“Indeed, this would require a sizable initial investment. However, that is within the allowable limit for necessary expenses. After all, adventurers are a valuable human resource for the Sorcerous Kingdom.”</p><br/><p>“I am deeply grateful, Your Majesty.”</p><br/><p>“No need to stand on ceremony. Then, how about it? Do you not think the adventurers would be attracted by this?”</p><br/><p>“Indeed, the labyrinth would be quite attractive to low-level adventurers… but what if the adventurers decide to transfer to the Kingdom or the Empire’s guilds after completing their training?”</p><br/><p>“Of course that will not be allowed. This is a state organ; misuse of it could well be considered treason.”</p><br/><p>“I see… it seems I will need to carefully explain that part.”</p><br/><p>“Then, how shall we attract higher-ranked adventurers?”</p><br/><p>“It would seem remuneration is the best answer.”</p><br/><p>“Well, it is not as though one can eat dreams.”</p><br/><p>“It is as you say. In addition, without better weapons, armor and other magical items, it will be impossible to defeat powerful monsters. These items are typically very expensive.”</p><br/><p>“…Hm. There is that.”</p><br/><p>Mass-production could lower the price of such equipment. However, powerful adventurers were very rare. Thus their gear was custom-made, which naturally drove their prices up. In addition, people who could make such items were very rare, which only contributed to the price. He had to think of a way to deal with the problems which followed that as well.</p><br/><p>“In addition, I would like to let more adventurers ― those of the Kingdom and the Empire ― know of this place. Do you have any ideas?”</p><br/><p>“The Adventurer’s Guild which Your Majesty intends to establish is an unimaginably desirable thing, compared to the Adventurer’s Guilds of the Kingdom and the Empire. Once the news gets out, the Guilds of the various nations might try some means to interfere with it in order to keep their adventurers from being drawn away. After all, each country counts adventurers as their trump cards, and they would not be pleased to see their adventurers go to another country.”</p><br/><p>“Indeed, that is correct. What do you think would be a good solution to this?”</p><br/><p>“It is difficult for me to answer promptly. Might I be allowed a bit of time?”</p><br/><p>“Come to think of it, that is true. I too must plot a course for the future..”</p><br/><p>The fact was, this lofty goal was a bit too much for Ainz to handle by himself. He had to calm down, think about things, and discuss it with someone else.</p><br/><p>Ainz rose to his feet.</p><br/><p>“Then, we’ll leave―” Ainz quickly shut his mouth before he could say something rude. That was not how a king should speak. “We will leave matters at this for today. I shall see you again.”</p><br/><p>Ainzach hurriedly rose to his feet and lowered his head.</p><br/><p>“Understood, Your Majesty.”</p><br/><p>Without looking back, Ainz left the room through the door Fifth had opened.</p><br/><p>Although he wanted to sigh, he was still in the guild. Doing so right now would be premature.</p><br/><p>Ainz led the Cherubim out of the Adventurer’s Guild. After walking a little further on, he allowed himself to sigh quietly.</p><br/><p>Ahhhh~ I’m beat…</p><br/><p>While Ainz Ooal Gown could not possibly say that he was tired, Suzuki Satoru was practically crying for a rest for his overheated brain.</p><br/><p>Before I talk to Albedo about absorbing the Adventurer’s Guild, I should take a brief rest. I also need to find some way to convince Albedo about the merits of this plan… there’s so many things to do now…</p><br/><p>Ainz strode forth in silence. He did not use teleportation magic, instead he prayed that he would stumble on a good idea before he reached home.</p><br/><p>♦ ♦ ♦</p><br/><p>The door to the adjacent room ― Ainzach’s office ― opened, and a new guest entered.</p><br/><p>The man with an excessively skinny body ― to the point where some might even consider him anorexic ― was Ainzach’s old friend, the head of E-Rantel’s Magician’s Guild, Theo Rakesheer.</p><br/><p>“Pluton, that was quite a surprise. I didn’t expect the Sorcerer King to come calling in the middle of our discussions. Did he notice something?”</p><br/><p>“I’m not so sure about that.”</p><br/><p>This morning, Ainzach had gone through the daily routine of meeting Rakesheer early on to exchange information.</p><br/><p>Ever since the city had fallen under the sway of the Sorcerer King, they only met in the morning. The reason for that was because they believed that most undead did not like the sun. Still, after seeing the undead army patrol the streets, they knew that it was little more than a way to put their minds at ease.</p><br/><p>Their meetings were essentially undertaken for the purpose of swapping news, with no consideration to the future movements of the Adventurer’s Guild and the Magician’s Guild. Or rather, ever since the founding of the Sorcerous Kingdom, everyone who could flee had already left for the Empire and the Kingdom. The Magician’s Guild had also transferred all their magic items out of the city, with only a few members staying behind. In other words, the Magician’s Guild of this city was effectively disbanded.</p><br/><p>However, there was still much that needed to be discussed in the field of information analysis.</p><br/><p>Although adventurers were not particularly bound to countries, could they still carry on as they had before, from within the Sorcerous Kingdom? Would the Sorcerous Kingdom send harriers after the former citizens of this land who were busy fleeing it? If they managed to successfully cross the border, would the Sorcerous Kingdom demand the extradition of the refugees at a national level? What about magic casters?</p><br/><p>How could they handle this situation without sacrificing Momon, who was now a resident here? In addition, how should the Adventurer’s Guild treat Momon?</p><br/><p>The temples remained silent, sensing that the Sorcerer King was keeping a distance from them too. However, would this carry on in the future? Would they lead a resistance movement against him?</p><br/><p>Each of these questions was a challenging one, which taxed both their brains to the limit with nothing to show for their effort. However, it would be troublesome if they did nothing and simply let things unfold. The temples were particularly problematic in that respect.</p><br/><p>Could the temples really accept their mortal enemy, one of the undead, as their king? They held their peace for now, but that in turn frightened the people even more.</p><br/><p>In addition, there were the religious factions from the surrounding countries. If things went poorly, they might decide to unilaterally declare a holy war, with the temples within the Sorcerous Kingdom serving as a fifth column. That situation had a chance of coming to pass.</p><br/><p>The reason why there was nobody here to represent the temples was because their stance on the matter was unclear. While it was easy enough to call them over, it would be bad if they ended up being drawn into something else instead.</p><br/><p>That said, neither of them thought the temples would actually be able to defeat the Sorcerer King. What made them uneasy was the massacre that would surely unfold after they tried. Even worse, they feared that this would result in Momon, the Sword of the Sorcerer King, slaughtering them all. In addition, how would they heal the wounds in the hearts of the country’s people after something like that happened?</p><br/><p>Just as their heads were aching from this chaotic mess of events, the Sorcerer King had arrived.</p><br/><p>“However, His Majesty seems to have sensed your presence here.”</p><br/><p>The best proof of that was the Sorcerer King’s snort of laughter as he looked at the room next door.</p><br/><p>“If it goes poorly, everything we’ve talked about might well have been leaked.”</p><br/><p>“What? That means…?”</p><br/><p>“Exactly what you think. He also meant for you to hear his words.”</p><br/><p>The acoustics of this room were tuned such that everything said here could be heard in the other. Because of that, Rakesheer ― who was hiding in the room next door ― should have heard everything the two of them had said.</p><br/><p>“Do you think he could have been mistaken?”</p><br/><p>“No, that’s impossible. To some extent, he should have sensed someone was there. However, His Majesty might have thought it was someone from the temples.”</p><br/><p>At that time he had been more confused than shocked due to the suddenness of the situation. When he thought back to it, all he felt was regret for his actions. How he wanted to laugh at himself, who stowed his friend out of the way.</p><br/><p>He should have invited Rakesheer out, so the three of them could speak their minds.</p><br/><p>Granted, the Sorcerer King probably had not put all his cards on the table yet. However, he had stated his opinions to a mere citizen, with the regal bearing of a ruler. How had he performed, in contrast?</p><br/><p>As he watched Ainzach knit his brows, Rakesheer icily asked:</p><br/><p>“Then, what will you do next? No, I already know. After all, you used to call him the Sorcerer King, but now you refer to him respectfully.”</p><br/><p>“Don’t you think someone might be listening in on our conversation?”</p><br/><p>“Don’t you think that’s the reason I’m telling you this now?”</p><br/><p>“Could it be that I was magically charmed?”</p><br/><p>“I’m not confident in completely ruling it out, but I don’t think so. Charm magic is time-limited, and even if the Sorcerer King wanted to sustain it, he probably would not be able to.”</p><br/><p>“Then again, it might be possible for His Majesty.”</p><br/><p>“Come on, give me a break. That would be a real headache if it was true. After all, that’s magic of the 8th tier and above, the realm of the divine.”</p><br/><p>The two of them laughed briefly, and then Ainzach resumed his serious expression.</p><br/><p>“I believe helping His Majesty in this matter is a good idea.”</p><br/><p>“Even if that makes you all accomplices in invading other countries?”</p><br/><p>“…Is it not natural for strong nations to subjugate weaker ones?”</p><br/><p>“So you know it will result in tragedy and have chosen to permit it?”</p><br/><p>“Things may not necessarily develop in that way. After all, ever since His Majesty took control of this country, who among us is worse off?”</p><br/><p>Rakesheer fell silent.</p><br/><p>The surprising thing was that nobody in this country could say they were in a worse situation than before.</p><br/><p>“Aren’t there adventurers who lost their jobs because of this?”</p><br/><p>“Well, you’re right, but isn’t it a little… come on, lay off me already.”</p><br/><p>“That’s true. I spoke without thinking. Still, given that this was such a rare opportunity, why didn’t you ask the Sorcerer King what he thought about the temples?”</p><br/><p>“Give me a break. If His Majesty decided that they were a nuisance and decided to destroy them because of something I said, I’d have to live the rest of my life knowing I caused a great slaughter. How do you think I could live with myself if that happened?”</p><br/><p>“Do you think the Sorcerer King is someone who would do such a thing?”</p><br/><p>“No. In fact, I’d say it’s the opposite. His Majesty is very rational, to the point where it’s quite shocking. To the point where sometimes, I wonder if that undead face of his was actually made by magic. Yes ― it feels just like when I talk to Momon-dono.”</p><br/><p>“Well, that would be a slight on Momon-dono.”</p><br/><p>Ainzach smiled thinly as he saw his old friend with a displeased look on his face.</p><br/><p>“Well, that’s true. It’s disrespectful to compare a hero of humanity to the undead Sorcerer King. However, when you consider that they’re both beings of superhuman might, they do seem quite similar. If I had to describe it… yes, I can feel the same presence around them, one which only those extraordinary entities could radiate.”</p><br/><p>“I see. That does make sense when you put it that way.”</p><br/><p>The two of them recalled the form of that great hero (Momon).</p><br/><p>Then, after that brief pause, Ainzach looked directly at Rakesheer.</p><br/><p>“―Rakesheer. If you do not wish to aid His Majesty, could I trouble you to not come here any more?”</p><br/><p>The reason for that hardly needed to be said. After all, Ainzach’s room might well be used to store data pertaining to the national administration of the Sorcerous Kingdom. Allowing outsiders to traipse in and out of such a room was definitely not appropriate.</p><br/><p>In addition, the Sorcerer King’s words ― which had made such a great impact on Ainzach’s heart ― had also been spoken to his old friend.</p><br/><p>The new vision of adventurers of which he had spoken was a shining and glorious one. In the past, there had been adventurers who had set foot upon unknown lands. However, most of them died far from their homes, or had broken down in the face of reality. Only a handful of people could actually do such a dangerous thing. But now, the Sorcerer King ― a magic caster who wielded absolute power ― was offering his full support to them. That opened up a whole new vista of possibilities to them.</p><br/><p>Contained within that was the possibility of becoming true Adventurers.</p><br/><p>After a brief pause, Rakesheer finally spoke.</p><br/><p>“I say, Ainzach. You do know that the Magician’s Guild in this city is practically disbanded, right?”</p><br/><p>“Ahh, so it is.”</p><br/><p>“Then, please allow me to support you with all my strength, as your former comrade. After all this is over, why not let us go explore the unknown as well?”</p><br/><p>“―Haha,” Ainzach chuckled. “Think of our age, though. Huhu ― are we really going for it?”</p><br/><p>“Why not? Although, you’ll have to speak to His Majesty then, and convince him not to put an age restriction on the Adventurer’s Guild.”</p><br/><p>And so the two of them filled the room with their cheerful laughter.</p><br/>\n</div>"}