{"title": "Chapter 71", "id": 71, "volume": 1, "url": "http://boxnovel.org/overlord-ln-chapter-71", "volume_title": "Volume 1", "body": "<h1>Chapter 71</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Overlord Blu-ray 6 Special – Overlord Prologue (2nd Half)</p><br/><p>Translated by: Nigel the Overlord of the Great Tomb of Translation</p><br/><p>Edited by: PervySageChuck AKA “Nigel’s Court Jester”</p><br/><p>Edited by: Sky the Hardest Morning Wood in the World</p><br/><p>Edited by: TaintedDreams and his Wet Dream Stained Pajamas</p><br/><p>Edited by: Someone who just happened to stumble here</p><br/><p>Part 3</p><br/><p>The members of the guild Ainz Ooal Gown — once known as the clan Nine’s Own Goal — gathered on the outskirts of Helheim, roughly one hundred meters away from the toxic fog-covered Poison Swamp, in a place called the Piercing Crystal Plains.</p><br/><p>Much like the Poison Swamp, the Piercing Crystal Plains were a hazardous environment, covered in frozen vegetation that resembled crystal razors. These razors dealt damage with every step taken within the Plains, and they could damage players wearing Relic-class armor. In addition, mineralized monsters wandered through the plains, and anyone who did not use bludgeoning-type weapons would have a hard time dealing with them.</p><br/><p>In any world — especially on the heteromorphic species’ home turf of Niflheim, Helheim and Muspelheim — things became more dangerous the further one went from the center of the world. In addition to the wandering monsters, the very terrain itself became a hazard.</p><br/><p>Still, this was nothing for the members of Ainz Ooal Gown. Although certain countermeasures had to be taken, and though these countermeasures were not permanent, with them it was still possible to move at full speed through the Piercing Crystal Plains. In fact, they were making preparations on the plains.</p><br/><p>Of course, this was not to say that they were not tense, or that they were careless.</p><br/><p>After casting several layers of defensive magic, they used magically-created eyes to scout their surroundings. In addition, they used illusion magic of the highest tier, the [Mirror World] spell, to create a hemispherical screen which enclosed the members of the guild.</p><br/><p>One could observe the outside world from inside the bubble without any problems, but from the outside, the inhabitants of the barrier were invisible, and people outside would only see the background. Aside from making the user harder to detect, the spell could also deflect a certain proportion of attacks directed at the occupants within.</p><br/><p>Such extensive preparations were made not because they feared monsters, but because they were on guard against players of similar power to themselves. Not only was there no penalty for PKing heteromorphic species, there were even benefits for doing so. In fact, some powerful classes were unlocked by PKing heteromorphs, and although heteromorph hunting was not as common now as it was in the past, it was still a very real thing. Only a fool would lower their guard, even in a heteromorphic home world.</p><br/><p>Momonga fiddled with the console by his hand. There he saw a list of guild members, along with their HP and MP gauges. At the top was Touch Me, followed by Nishiki Enrai, Wish III, Warrior Takemikazuchi, Momonga, Ancient One, Flatfoot, and Amanomahitotsu, the eight remaining founding members. After that were the nineteen who joined later: Peroroncino, Bukubukuchagama, Herohero, Blue Planet, Ulbert Alain Odle, Garnet, Bellriver, Variable Talisman, Nearata, Nuubou, Genjiro, Yamaiko, Whitebrim, Punitto Moe, Tabula Smaragdina, Beast King Mekongawa, Tigris Euphrates, Temperance and Slathan.</p><br/><p>In total, there were 27 people — the full strength of Ainz Ooal Gown.</p><br/><p>As he looked at the names, an indescribable feeling welled up within him and heat surged through his chest.</p><br/><p>Amanomahitotsu the blacksmith was the leader of the guild’s crafters, who typically preferred to adventure by themselves. They were here now to take part in the guild’s first group event.</p><br/><p>He had to thank them. It would be wrong not to do so.</p><br/><p>However, on the other side of his elation was a hefty burden.</p><br/><p>His stomach ached as he thought of what would happen if their maiden venture ended in failure. There would be no guarantee that they would ever adventure together again if that came to pass. As he thought of how Touch Me had struggled under this stress for so long, Momonga could not help but bow his head in respect.</p><br/><p>Failure was not an option.</p><br/><p>Momonga quietly took several deep breaths, cleared the screen away, forced himself to get it together and then approached one of the guild members.</p><br/><p>“Nuubou-san, how are things going?”</p><br/><p>“Hm? Ah, it’s fine. For now, I can say nobody’s spying on us through magical means.”</p><br/><p>This conclusion came from Nuubou, who built his character as a divination specialist. He was also known as the “Eyes of Nine’s Own Goal”. His words guaranteed that there was no magical surveillance observing them. It would have taken an infiltrator of unprecedented ability to hide from his eyes.</p><br/><p>“Also, there’s nobody spying on us via physical means, Momonga-san.”</p><br/><p>That report came from Flatfoot and Nishiki Enrai, who had gone to reconnoiter the surroundings.</p><br/><p>Though the assassin and ninja duo were not as good as pure scouting-type characters, no stealth- specialized character had evaded their eyes so far.</p><br/><p>After taking their feedback into consideration, he could be certain that nobody was paying attention to this place.</p><br/><p>Momonga looked around.</p><br/><p>A lot of the people here had frightening appearances. The way they sat around the place looked like some sort of dark cabal conducting an evil ritual. However, all Momonga saw were the figures of veteran players.</p><br/><p>“Then, everyone! Are you ready?”</p><br/><p>As one, thumbs-up icons blossomed around them.</p><br/><p>This was the signal that their preparations were complete. After all, there were nearly thirty of them, so individually asking if they were ready would waste a lot of time. In order to avoid that, this was how they had responded, ever since they had started out as a clan.</p><br/><p>“Then let’s go. Advance party, we’ll leave the details to you.”</p><br/><p>“OK~” replied Nishiki Enrai, leader of the scouting team.</p><br/><p>After that everyone changed their equipment, stepping into the Poison Swamp once they were immune to poison.</p><br/><p>The toxic areas in normal wetlands were scattered throughout the terrain, so one could simply go around the poisoned areas to reach the dungeon which was their objective. However, the detours involved would take a long time, so instead they chose to take the shortest path and cut straight through the toxic regions. The reason for that was because they were all working people, and thus wanted to avoid wasting time. There was also a father who laughed and said that despite the day off tomorrow, his family would kill him if he did not take care of them.</p><br/><p>A system message appeared.</p><br/><p>[Grenbera Swamp]</p><br/><p>That was the only thing Momonga saw, but some of his comrades knew more about the region, and they raised their voices to inform the others.</p><br/><p>“This is a huge patch of wetlands littered with poisonous marshes, controlled by the Tuvegs, who are immune to poison.”</p><br/><p>Players received different pieces of additional information upon entering a new area, depending on the skills and abilities they possessed. For example, alchemists and herbalists, with their herbological skills, would learn about the various herbs they could harvest in the area.</p><br/><p>“And then… huh, it’s nothing special. Monsters in residence — they’re about the same as what Nishiki-san discovered. There’s no information on rarities either… could it be hidden? Or maybe there’s no rare info? Which could it be?”</p><br/><p>“There’s no way there’s no rare info, it must be hidden. You probably need to wade in until you’re covered in mud to find it. I feel it’s most likely in one of the Tuveg hamlets. Let’s try to swing by there and take it down as soon as possible. If there’re some undiscovered herbs there, we might be able to make a rare potion. Man, the game devs are insane. They make you scrounge for the ingredients for your potions… I’ve already made over 200 types of potions, but there’re still a lot which haven’t been discovered yet.”</p><br/><p>“Aside from potions, there’re still a lot of undiscovered ores as well, right? The description on apoitakara says that it’s a type of rainbow ore, which means that only two of them have been found so far…”</p><br/><p>“Well, the devs are one thing, but I think the game company’s mad as well. I mean, with all the content, you can play for a long time… but they seem to have forgotten the word restraint. They must have left the term ‘user friendly’ back at their main office.”</p><br/><p>“Indeed. Speaking of the main office… the guy they sent over from our company’s head office a while back was terrible…”</p><br/><p>“Uwah, sorry, let’s not talk about this. I seem to be having an allergic reaction to the word ‘company’… Should we make it a guild rule not to talk about the workplace? Maybe only allow it in the half an hour or so before you log off. You know, when you have to return to reality.”</p><br/><p>Momonga chased away the words in his ears.</p><br/><p>He did not know who had spoken last, but he agreed fully with him. He did not want to think about work. Whether you wanted it or not, tomorrow would come anyway.</p><br/><p>As these dark thoughts slowly began to swallow Momonga, he decided to use the conversations around him to try and motivate himself. Therefore, he kept his ears open for anything game-related which the others might be talking about.</p><br/><p>“—Knowledge-type skills, huh? I’ve been thinking about respeccing towards those. I’ve almost unlocked a class which uses special attacks derived from monster lore. Do you think my DPS would go up if I branched out from there?</p><br/><p>DPS was an acronym for Damage Per Second.</p><br/><p>It measured how much damage one could do in a second, and to attackers, it was the most important thing in the game. Theoretically speaking, one could create the ultimate weapon by embedding damage-increasing data crystals into a big weapon with high data capacity. However, weapons like that were unwieldy, and would result in fewer attacks due to the difficulty of using them. As a result, the wielder’s overall DPS would go down. No right-thinking attacker would even think of using a weapon like that.</p><br/><p>In addition, as monsters went up in level, they gained all sorts of special abilities. At this level, they could greatly decrease any damage done to them. Therefore, it was quite common to require weapons made of special materials or with the appropriate elements to bypass these abilities.</p><br/><p>“But that would mean you wouldn’t be as focused on attack power as you are now, right?”</p><br/><p>“I’m thinking I could make up for it with an elemental weapon.”</p><br/><p>“Ah, that’s not a bad idea, but then you’d really need those divine-class items, right? Wouldn’t that be difficult?”</p><br/><p>“Is that so~? Well, it can’t be helped~ I wanted to experiment a little but it’s too troublesome…”</p><br/><p>If one could make a second character in Yggdrasil, this sort of complaint would not exist. However, that was impossible in games like these. Experimenting with different classes was only possible by dying and losing levels.</p><br/><p>Even if it was easier to gain levels in this game as compared to other DMMOs, it was still a time-consuming process. One would not go to that kind of trouble just to fool around.</p><br/><p>Momonga often longed for a second character himself. He had heard people complaining about how unfair it was that one could not make another character in this game, and he personally agreed with them.</p><br/><p>If he could, he would like to be a warrior, like Touch Me.</p><br/><p>Although it was said that the warrior classes were limited by one’s real-world reflexes, that restriction only came into play during duels between top-class warriors. It was not a deciding factor during normal play.</p><br/><p>Touch-san gave himself a scarf, but I think I’d like a big, flowy red cape… My sword would have to be huge, just like Warrior Takemikazuchi-san’s. I could swing it around stylishly.</p><br/><p>Incidentally, Momonga had learned the warrior transformation spell, but it was not very useful, and so he had almost no chance to use it. In a party, each person divided the workload among themselves and did their part in order to achieve victory for the team. In order to do that, they had to excel at their assigned function.</p><br/><p>Momonga was a back-liner, and when he went adventuring in a party, he was obliged to use magic that made a meaningful contribution to the group.</p><br/><p>If he could not do that, then there was no point in playing in a group.</p><br/><p>That being the case, if he were travelling alone — if he were playing solo, there was a good chance he could bring it into play.</p><br/><p>However—</p><br/><p>Momonga looked to his guildmates, quietly advancing through the poison swamp. He watched his friends chat as they walked, flitting from topic to topic.</p><br/><p>He was suddenly lost in a memory of loneliness.</p><br/><p>When the guild had still been a clan — although it had been a clan until recently— the only members had been working folk, oddly enough, and they had gathered to meet at night. While some of them had unusual jobs and thus kept odd hours — Bukubukuchagama the seiyuu being a prime example — for the most part, nobody would be online during the day.</p><br/><p>Momonga would return straight home after work, log on ahead of everyone else, and then he would summon undead to protect himself and hire NPC mercenaries to hunt monsters. So technically speaking, he was used to playing alone.</p><br/><p>However, he never felt lonely, because he was certain that someone else would log on. But if they were not around — if nobody logged on any more, what would he do?</p><br/><p>Should he quit this guild, and join a new one?</p><br/><p>Or should he recruit new members?</p><br/><p>He disliked both options. It was not as though he was afraid of strangers. After all, he could get along normally with the people in his company — although they probably thought he was antisocial because he did not go drinking with them.</p><br/><p>Still, he disliked having to make that choice.</p><br/><p>This opinion was not born of logic, but his emotions. Therefore, he could not bring himself to accept those options.</p><br/><p>“What’s wrong, Momonga-san? Are you low on nanomachines?”</p><br/><p>Herohero was beside him.</p><br/><p>“My nanomachines are fine. I topped them off before going online.”</p><br/><p>“Really? That’s good, then. This may take a long time — although I’m not sure if that’ll be the case — but it would be a good idea to make sure you’re topped off before entering the dungeon. It would be bad if you were forcibly ejected at a critical moment. I’ve a friend in real life who was playing a different game, he was kicked out of the game during a guild ranking battle, and by the time he came back, his guild had lost and they reamed him out for it. And it wasn’t even his fault that they lost.”</p><br/><p>“…That’s pretty scary.”</p><br/><p>“I know our guild won’t be like that, but there are guilds like that out there. You know, the try hard types. I hate those picky guilds. Games are meant to be played, after all. …Oh, what’s this? You look pretty suspicious, comrade. The type that Touch-san would arrest.”</p><br/><p>“That’s mean, saying I’m suspicious,” Momonga smiled bitterly. “I’m just a guildmaster wondering about how we’re going to breach the dungeon soon, and it made me feel a little melancholy.”</p><br/><p>“…Hahaha. Seems you’re worrying right from the start… However, if we manage to find data crystals loaded with rare data or artifacts, it’ll be worth it. Well, if you ask me, being able to actually clear an unknown dungeon in one shot would be a greater treasure than any of those.”</p><br/><p>“Exactly. It’ll be an unforgettable memory.”</p><br/><p>Halfway through their conversation, a squishy sound, as though one were walking in a pair of flooded long boots, came from the side.</p><br/><p>“Oh, visibility is poor now.”</p><br/><p>“Eh?”</p><br/><p>“Looks like some mist just rolled in. Momonga-san, if you change your vision mode, you’ll see it.”</p><br/><p>Momonga had cast the spell [Widen Magic – Complete Vision], which could pierce fog up to a distance of 200 meters ahead of him. This was why everything looked clear to him.</p><br/><p>Although there was no reason for him to put himself at a disadvantage, he had a friend at his side, so there was no harm in doing as Herohero said and briefly disabling his magical vision.</p><br/><p>He entered the command to change vision modes into the console.</p><br/><p>In that moment, the world became a sea of cloudy white.</p><br/><p>“Uoh!”</p><br/><p>The difference between his expectations and reality forced a quiet gasp of surprise from him.</p><br/><p>“Haha, scared? Actually, it’s been like this for a while now.”</p><br/><p>An aura of wicked amusement seemed to be coming from Herohero. It might even have qualified as satisfaction.</p><br/><p>“Come on, give me a break.”</p><br/><p>Although the bitter smile he was showing seemed to imply nothing was the matter, the fact was that it had touched a nerve. The terror of not being able to see anything aside, the shock blended with the lingering dark thoughts from earlier, and he felt as though he was alone again.</p><br/><p>Momonga operated his console, and restored his vision.</p><br/><p>It seemed everyone in his party could see through the mist. Or rather, that was to be expected. They had been through all sorts of adventures to get to their current levels, so everyone had already made the necessary preparations for this endeavour.</p><br/><p>Just then, Momonga felt something was amiss, and asked:</p><br/><p>“Still, Herohero-san, how did you come to have human eyesight?”</p><br/><p>Herohero was a slime. Slimes used a sort of motion detection sense to learn about their surroundings in place of ordinary vision, so he should not have perceived the world like a human did.</p><br/><p>“Ah, I equipped a magic item that gave me that ability. The innate motion detection ability which all slimes possess is very useful, but it’s only effective within a limited radius. I can’t see beyond 100 meters, which is pretty spooky if you ask me. I’d be in trouble if someone attacked me from outside that range, so I decided to give myself something to let me see normally.”</p><br/><p>“Any advantage comes with a weakness. It’s how this game works.”</p><br/><p>“The good balances out the bad. Oh, I’m picking up something on my vibration sense.”</p><br/><p>He turned to where the black tentacle was pointing, and saw the outline of a massive worm.</p><br/><p>It was a vast purple worm, over ten times the width of a human torso, its surface gleaming wetly.</p><br/><p>These worms moved in packs, so it would be troublesome if it detected them.</p><br/><p>The group suddenly halted. The magic casters pointed their fingers at the worm, while the warriors readied their ranged weapons.</p><br/><p>If it spotted them, they were ready to destroy it in an instant, before it could summon its friends.</p><br/><p>Momonga had a spell ready on his console, and took the stance he always did for attack spells. While Momonga’s usual role was to buff and debuff people, it would be more effective to attack directly given their numbers now.</p><br/><p>After several seconds had passed, it seemed that their enemy had not spotted them, and slowly slithered back into the swamp.</p><br/><p>“I’m not one for sneaking about. I want to cut a swathe through them,” Ulbert complained from somewhere in the distance.</p><br/><p>“Ulbert-san, please don’t waste your MP. You should spend it all on the boss.”</p><br/><p>Ulbert’s character build revolved around World Disaster, a class with incredible firepower. On top of that, he took levels in classes which further specialized in offensive ability. By attack power alone, he was easily among the top five in the guild, but he had a weakness. Though he had an ample supply of MP his consumption rate outstripped even that, in other words, he burned through MP quickly.</p><br/><p>One could say that the difficulty of a dungeon expedition was directly related to how much MP he could bring to face the boss.</p><br/><p>“Aw, I was just kidding. I know that. I’ve been saving up all this time, haven’t I? This is the maiden adventure of Ainz Ooal Gown, no? I’ll make sure it all works out!”</p><br/><p>He clenched his right fist to show his sincerity. Momonga could feel his motivation, which was quite uncharacteristic of him.</p><br/><p>“Ah, but I wouldn’t mind if you gave me some MP. That way, we could blow right through them and still have enough for a grand display at the boss.”</p><br/><p>“Hm? Were you talking to me?”</p><br/><p>Yamaiko was a magic caster who was adept at spirit-type magic, and she had further specialized within that field as a healer, which granted her curative spells. If it was her, she could transfer MP to another person via the appropriate spell.</p><br/><p>“It’s not a bad idea, actually. Do you mind if I do it when the time comes? I can use staves and wands for healing anyway.”</p><br/><p>“I don’t trust wands and staves for healing during a boss battle, and besides, you run out of juice fast, Yamaiko. If you want to transfer MP, I’d rather you get it from someone else.”</p><br/><p>Yamaiko’s role in one sentence was that of a defensive healer. With her innate defenses and regeneration, combined with a build which emphasised those two qualities, she could even serve as a tank of sorts. Even when surrounded by the enemy, she could still heal her allies.</p><br/><p>That said, being able to off-tank was a far cry from being able to main-tank.</p><br/><p>Her weapon of choice, a huge gauntlet, could not do much damage. In exchange, it had an increased ability to inflict knockback on her foes. The fact that she used a weapon which put distance between herself and her enemies was ample proof that she was a healer at the core.</p><br/><p>In this sense, she had two weaknesses.</p><br/><p>The first was that she did not have much MP. Of course, she had more than enough for general healing, but it was insufficient when one factored in the need to cast buff spells and other things. The other weakness was that her attack power was very low, in exchange for improved regeneration.</p><br/><p>With these in mind, she could be said to be the final defensive line of the group. Her role was to off-tank if the battle line started to crumble, heal everyone’s wounds and revive dying comrades.</p><br/><p>“Still, why are we speaking so quietly?”</p><br/><p>Ulbert and Yamaiko looked at each other’s’ faces, and confusedly replied, “I have no idea.”</p><br/><p>It would seem that they had unconsciously lowered their volume since they were trying to be stealthy. After all the monsters could detect them with their programmed senses — vision, hearing, smell, and magic. Because of that, it was not wrong to crouch and speak softly.</p><br/><p>However — those considerations were only applicable at low levels. Once players reached high levels, they could use a variety of spells and skills to conceal the entire party and infiltrate together. Given the abilities they had been using up till now, there was no need to sneak around.</p><br/><p>When the worm from just now had appeared, the others only raised their weapons because they saw someone do it first and thought, “me too”.</p><br/><p>“Maybe it’s just because visibility is better here.”</p><br/><p>“Ah. Yes, that’s right. Like how you’d feel, leaving the house in just your underwear.”</p><br/><p>Although Ulbert’s meaning was quite subtle, Momonga managed to get it, more or less.</p><br/><p>“Mm, it sounds kind of wrong, but I guess that’s how it is.”</p><br/><p>“I don’t get it.”</p><br/><p>Keeping quiet for reasons they did not quite understand, the group followed the pioneers into the swamp.</p><br/><p>They encountered many Tuvegs along the way, but they carefully went around the detection radius of the bipedal frog-monsters. Their attitude was different from just now, because some monsters had the ability to see through concealment, and the Tuvegs were such monsters.</p><br/><p>Of course, they used magic to improve their mobility, but the journey still took a long time, given that they had to detour around the Tuvegs. However, they could finally see something different on the other side of the swamp.</p><br/><p>This was their destination, the dungeon. Part of it looked like a small island</p><br/><p>“So that’s it…”</p><br/><p>After overlaying the map drawn by Nishiki Enrai on top of the current area minimap, it was easy to ascertain that they had arrived at their objective.</p><br/><p>If they relaxed at this point, there was a possibility that guardian monsters might ambush them. It was not uncommon for the monsters to employ the old trick of hiding underground.</p><br/><p>Given the malicious nature of the Yggdrasil devs, this might be the cue for a Tuveg boss to jump out and draw everyone into a full-scale battle. Or rather, Momonga had seen such things before in game videos, where the result was a total party kill.</p><br/><p>This was why the scouts had such an important job.</p><br/><p>First, Momonga made sure that there was nothing that would be triggered by the presence of the undead nearby.</p><br/><p>Then, he accessed the hotkeys on his console, selecting the number 8 out of the numbers 1 to 10. This 8 represented 8th tier spells.</p><br/><p>A complex menu composed of layers of ring-shaped pages appeared before him. There were 12 spells in each of the four rings, for a total of 48 spells.</p><br/><p>In this way, he could hotkey up to 480 spells.</p><br/><p>Normally, a level 100 magic caster would learn around 300 spells over the course of the game. Even cash items could only increase that number by another 100. However, there were more than a few players who looked at the extra empty spaces on the shortcut menu and took it as a challenge from the developers.</p><br/><p>The ability to skilfully navigate these menus — fully understanding and memorizing the effects and proper application of each spell — was one of the biggest factors in one’s ability as a magic caster.</p><br/><p>Just as warriors were affected by their real-life reflexes, magic-using classes relied heavily on their memory.</p><br/><p>Momonga fluidly navigated the menus.</p><br/><p>Although he would not browse his spells so leisurely in combat, he had the luxury of taking his time for now. As he went through the pages of spells by rote, he recalled the order in which the spells were arranged, an order which he had forced himself to memorize.</p><br/><p>He tapped the fourth ring, the outermost one.</p><br/><p>Out of the ring of 12 spells that became larger than the others, he tapped on one of them.</p><br/><p>“[Remote Viewing].”</p><br/><p>There was no need to tap any other hotkeys, given that he was not planning to apply any metamagic enhancements to the spell.</p><br/><p>As the spell was cast, an arcane eye — a magic sensor — appeared. There were other members of the guild who had already released similar sensory organs, so there was no need for Momonga to do that. Still, Momonga was the best undead detector in the guild, so just in case, he deftly manipulated the arcane sensor and sent it toward the small island.</p><br/><p>His right hand held the control stick for the sensor’s movements, while he used his left hand to direct the sensor’s field of view. Missing a huge chunk of one’s visual field was frightening, to say the least, but it was fine now, because he had trustworthy allies nearby.</p><br/><p>The wall which separated the island from the swamp was overgrown with moss and broken in many places, and could no longer serve its purpose as a barrier. One could see the inside through the gaps.</p><br/><p>There were remains there — the remains of a tomb.</p><br/><p>The destruction was thorough, even the tombstones had been smashed. There seemed to be something like a mausoleum in the middle, but it was beginning to collapse. There was a shrine of some sort as well, but it was little more than a ruin. Not even monsters could hide within it. At a glance, there was nothing else which was suspicious.</p><br/><p>Still, after viewing this scene, Momonga seemed even more tense than before.</p><br/><p>In games, tombs would almost certainly be inhabited by undead creatures. Yggdrasil was no exception, which was why Momonga had cast this spell.</p><br/><p>If there were any undead in there, he would definitely find them.</p><br/><p>With that resolve steeling his movements, he turned the control stick, sending the arcane eye in a full orbit of the small island. However, there were no undead reactions.</p><br/><p>“No sign of monsters. No sign of incorporeal beings either.”</p><br/><p>“Same here. No signs of moving objects above or below ground.”</p><br/><p>“No undead reactions either.”</p><br/><p>“Do you think a boss is going to pop out?”</p><br/><p>“Or a trap? Multiple summoning-type traps at once are hard to deal with.”</p><br/><p>“In any case, I’ve used my trump card once already, out of four times a day. At the very least, there are no magical traps here.”</p><br/><p>The other guild members had already examined the island in their own ways, and the reports slowly filtered in. They paused for a moment to look at each other, and then began heading out for the small island. The rear guard team remained on alert, keeping an appropriate distance from the delving team in case something should happen.</p><br/><p>“…So this is the sort of dungeon where the real fight starts after we step into that broken-down old building?”</p><br/><p>“No, it should be once we pass through the mausoleum and enter the underground, right? After all, we’re still quite close to the swamp.”</p><br/><p>“Well, that’s pretty meta…. In any case, keep your sensors away from the building so you don’t trip any flags. After we set foot on the island, it’ll be a different matter. Then, Momonga-san, please do the honors.”</p><br/><p>“Well then…”</p><br/><p>The moment he set foot on the ground from the swamp, text appeared in his field of view, just like when he had entered the swamp. However, this time, beside the words Great Tomb of Nazarick was an icon which indicated an unexplored dungeon.</p><br/><p>“Nazarick, huh… I wonder which mythology it came from?”</p><br/><p>“No, I’ve never heard of this before.”</p><br/><p>The prompt answer came from Tabula Smaragdina, part of the rear guard. They were steadily catching up with the advance party, and establishing a formation against possible enemy attack.</p><br/><p>“It’s not Latin or Greek either. Ah well, not all names in Yggdrasil are from mythology anyway. This is probably one of those exceptions. Also, there’s no special info about this place either.”</p><br/><p>Just then, Nuubou stepped forward and cast a spell. He should probably be able to scan the area with no problems.</p><br/><p>Several second later, he informed the group of his findings.</p><br/><p>“—There’s nothing, Momonga-san. I sent my arcane eye into the central mausoleum, but there were no contacts on the enemy sonar.”</p><br/><p>“In other words, this is a safe area, then?”</p><br/><p>“Still, those shitty devs built this place, there might be some sort of timed effect waiting for us…”</p><br/><p>Many people indicated their approval of the scathing criticism. Most players thought poorly of the Yggdrasil devs.</p><br/><p>“Scouting party, is everything alright? If it is, then I believe the dungeon is in the basement of that building. Then, shouldn’t we change our team lineups for dungeon exploration?”</p><br/><p>“I’ll make a shelter for us, then.”</p><br/><p>Blue Planet the druid raised his shovel in response to the suggestion from Punitto Moe, the strategist.</p><br/><p>Then, he cast the 10th-tier divine spell, [Nature’s Shelter], and everyone entered the bunker which had sprung forth from the earth.</p><br/><p>The massive doors swung open easily.</p><br/><p>The roof of the vast chamber they entered was just like the outside, the sky spreading endlessly above them.</p><br/><p>“I’ve been thinking about this for a while. It looks like anyone could see everything inside from above, and it kind of unsettles me.”</p><br/><p>“True, I mean, even though they say it’s so you’ll know if the enemy is above you or something, I’m still uneasy about it. Still, I heard this thing can remain standing after taking a hit from super-tier magic—”</p><br/><p>“Ah, that’s not true. I’ve seen a video, it’s been breached by a [Sword of Damocles] before.”</p><br/><p>“That’s an orbital weapon, right? But isn’t that an exception to the rule? After all, it’s super-tier magic designed to target structures. Bit unfair to use it as a comparison, right? Shouldn’t you compare it to other super-tier spells?”</p><br/><p>“All right. Everyone, your attention please~”</p><br/><p>The idle chatter died down in the wake of Punitto Moe’s voice.</p><br/><p>“We will now begin assigning parties for the dungeon expedition…”</p><br/><p>In response to this, Tabula Smaragdina put up his hand in opposition.</p><br/><p>“Hang on! Don’t you think it’s a little early for that? I think we should stay in our current movement parties and go as deep as possible before changing up. If we break up now, we’ll need to dispel our whole-party spells.. In addition, we should be able to go through the dungeon in this state, with only a little more trouble with the mid bosses, right?”</p><br/><p>“That’s certainly possible, but shouldn’t we be more careful? Besides, there’s a pretty good chance those shitty devs will spring a raid boss on us.”</p><br/><p>The other guild members began discussing the matter with each other, as though Punitto Moe and Tabula Smaragdina had given them the cue to start talking. However, Momonga, who had stopped to think early on, felt that he could combine their ideas, despite the differences in the details.</p><br/><p>And then Punitto Moe, who knew that this would end up going nowhere, turned to look straight at Momonga.</p><br/><p>“What do you think, Momonga-san? Should we change party composition before we enter the dungeon, or go in and take things one step at a time?”</p><br/><p>This was one hell of a curveball. Neither side was absolutely correct, and there were pros and cons to both courses of action. In all likelihood, everyone would agree with whichever option he went with.</p><br/><p>However, he was uncomfortable enough even when he thought of picking the right course of action. The very idea of choosing wrongly made his stomach start to ache and the burden on his shoulders felt even heavier.</p><br/><p>This was the burden a guildmaster had to bear, and personally, Momonga would prefer to decline on deciding for them. However, that would not be possible.</p><br/><p>Momonga turned the matter over and over in his mind.</p><br/><p>At this point, Touch Me the clan leader would have eagerly led everyone forward. So, should Momonga the guild leader imitate him?</p><br/><p>However, Momonga’s chest ached.</p><br/><p>The last time that happened, there was an argument, which resulted in a person leaving.</p><br/><p>Although Momonga deeply respected Touch Me’s leadership, that memory stuck in his craw. Or no, for all he knew, that incident weighed heavily on Touch Me as well. That might have been why he abdicated his position as leader, and put forward a successor with a different personality from his own.</p><br/><p>If that was the case, then Momonga should not do as Touch Me would have done.</p><br/><p>“—Then, we’ll go by majority vote. Everyone, those in favor of changing parties please come to my right, and those in favor of carrying on without any changes please proceed to my left.”</p><br/><p>After some quiet discussion, everyone moved toward their respective sides.</p><br/><p>Momonga counted their numbers, and came to a conclusion.</p><br/><p>“It seems there’s more people who want to move on. Then let’s go. Also, everyone, I wish to use majority vote as the standard procedure for resolving guild-wide problems like these. If a tie results, we’ll have the suggesters play rock-scissors-paper… though that might be difficult for some of us here, so maybe some other form of tiebreaker might be better. In any event, I would like to settle disputes in this way. Does anyone have any objections, or a better idea?”</p><br/><p>Nobody spoke up.</p><br/><p>Was it because they had no objections, or was it because they felt uncomfortable about voicing their thoughts?</p><br/><p>Things like this happened at work as well. When asked “what do you think?”, few people would speak up. Sometimes, the reason for their silence was not because they had nothing to say, but because they were afraid that voicing their opinions would lead to them being put in charge of any courses of action born from those words, or because they were afraid of having their ideas rejected, and so on.</p><br/><p>Momonga would need to speak with people in private after these meetings, and made a mental note in his mind.</p><br/><p>“Then, everyone, let’s make a move.”</p><br/><p>After indicating their acknowledgement, everyone headed outside.</p><br/><p>Although the losing side might be dissatisfied, nobody would throw a childish tantrum in the face of a majority decision. One could say that it was expected of adults… no, that was not quite right.</p><br/><p>There were many kinds of adults as well. Momonga knew of adults who had never really grown up, like children. The fact that none of them could be found here was due to Touch Me’s good judgement in picking friends.</p><br/><p>At this moment, Momonga was once more keenly aware of the gravity of a guildmaster’s position.</p><br/><p>And then, Momonga heard a conversation which dispelled his unease.</p><br/><p>“Aw man! I thought you were one of us, Flatfoot-san!”</p><br/><p>“Nah, I like them flat, but not necessarily lolis.”</p><br/><p>“You’re one to talk, naming your weapon Tsururinpettan… Or are you referring to something else? Could it be you like men’s chests, Flatfoot-san?”</p><br/><p>(TL Note: Smooth and Shiny Flatchest)</p><br/><p>“M-men’s chests?”</p><br/><p>“Am I wrong? Don’t you like them flat? If that’s the case, then men’s chests would be… are you a homo?”</p><br/><p>Peroroncino!</p><br/><p>Momonga suppressed the urge to yell at him. His introspection from earlier was nowhere to be found. Still, Momonga understood his friend’s personality… or rather, his fetishes. With him around, it would not be a surprise if this sort of thing was brought up.</p><br/><p>Should he get himself together, and lend a helping hand to the dumbfounded Flatfoot?</p><br/><p>Just as Momonga was waffling over this decision, he heard another voice.</p><br/><p>“…People might laugh it off at a drinking party, but do you really think you can shout this sort of thing out just because you’re among friends?”</p><br/><p>It was Bukubukuchagama. A premonition of dread filled Momonga as he noticed that the pitch of her voice was a bit low. However, for some reason, her little brother Peroroncino had not realized this yet.</p><br/><p>The truth was, Flatfoot had already backed away from Peroroncino.</p><br/><p>“Well, it’s because you’re flat yourself, Aneki, that men don’t—”</p><br/><p>“—Oi.”</p><br/><p>That cold voice carried a hint of impending doom, like a guillotine blade slicing down.</p><br/><p>“Oi, brat. Do you want me to tell everyone about what you did when you were twelve?”</p><br/><p>“…I, I’m very sorry for what I said.”</p><br/><p>“…Hey, did I give you permission to shut up? Did that sound like a joke to you? Hah? You’d better—”</p><br/><p>Sensing that something terrible was about to happen, Momonga hurriedly interposed himself between the two of them, forcing them apart with his body.</p><br/><p>“Chagama-san, Chagama-san. Calm down a little, please.”</p><br/><p>“Ah— Momonga-san.”</p><br/><p>Bukubukuchagama’s voice seemed to have reverted back to normal, but the flames of her wrath were not completely extinguished yet. This was probably a small respite at best, so Momonga quickly continued:</p><br/><p>“Well, ah. We’ll be heading into the dungeon soon. I think it would be best if you let go of your anger, right?”</p><br/><p>After seeing Momonga pleading with his palms pressed together, Bukubukuchagama — presumably — relaxed her shoulders.</p><br/><p>“That’s right, that’s right. It’s not that I don’t understand how you feel, Bukubukuchagama-san, but this is probably for the best. Thank you.”</p><br/><p>With that, Flatfoot came to Momonga’s side and put his hands together as well. Now that the two of them had spoken up, Bukubukuchagama had a hard time getting mad. Therefore, she sighed in an exaggerated way.</p><br/><p>“There’s no need for you two to apologize since you did nothing wrong. Ahhh, I’m the one who should be apologizing. I can’t believe I let that dummy get under my skin. Sorry about that.”</p><br/><p>With that, she turned her face — presumably — toward Peroroncino.</p><br/><p>“Oi, dumbass brother of mine. Remember this well — mind your manners, even if you get along with people. Especially when you crack your dirty jokes. Don’t embarrass me just because you get excited around friends. Got it?”</p><br/><p>“…Yes.”</p><br/><p>“Shouldn’t you be thanking Momonga-san and Flatfoot-san?”</p><br/><p>“Mm. Thank you, guys. Sorry about that, I think I got a bit carried away.”</p><br/><p>Peroroncino’s words were devoid of energy. His subdued, obedient way of speaking made him sound like a dog which had been hit by a shock baton.</p><br/><p>After hearing her brother’s apology, Bukubukuchagama left the bunker.</p><br/><p>Of the three people watching her leave, Flatfoot was the first to break the silence.</p><br/><p>“…Haaahh, your big sis is scary. Super scary. Scarier than my department chief. She really knows how to change her voice.”</p><br/><p>“She’s not a bad person. And I don’t know if it’s because she’s a seiyuu, but she has a really powerful voice. Its impact is even greater in Yggdrasil, since our faces don’t move in the game…”</p><br/><p>“You sure are tough, Momonga-san.”</p><br/><p>Flatfoot placed his hand over his heart. There was no heartbeat for him to feel, but it had affected him there.</p><br/><p>Momonga fully understood what he meant by that.</p><br/><p>Games like Yggdrasil — DMMORPGs — were all very realistic. As a result, it was not at all unusual to feel that this was reality.</p><br/><p>Of course, the fact that expressions did not change, or because there was no sense of taste and so on were handy indicators that this was still a game world.</p><br/><p>“I’m not that tough. Still, I felt like I was standing in front of a scary boss.”</p><br/><p>The two of them chuckled quietly.</p><br/><p>Momonga smiled — though his face did not move — and then urged the other two onward.</p><br/><p>“Alright, let’s move out! We’re the only ones left.”</p><br/><p>Part 4</p><br/><p>With one eye on their surroundings, the players climbed a run-down flight of stairs into the building. The interior was unexpectedly impressive, with five statues standing tall. Stone slabs were set near the feet of the statues. However, the group was some distance away and could not read what was on them. Of course, there were spells to read the writing, but nobody was in the mood for that.</p><br/><p>Momonga had a bad feeling about this.</p><br/><p>He had seen this sort of dungeon design several times in the past.</p><br/><p>The enthusiasm he had up till here was nowhere to be found.</p><br/><p>“Ah, Momonga-san, this looks like a simultaneous attack dungeon. And it looks to be the hardest kind, the sort that needs five parties to progress. Then again, we should probably be glad it’s not one of those dungeons that needs 36-man parties (a legion) and allows two guilds to cooperate on invading them. Those are just crazy.”</p><br/><p>Momonga groaned quietly as Tabula Smaragdina’s words vindicated his sense of foreboding. There was muttering from around him as well.</p><br/><p>Many people hated simultaneous-attack dungeons, also known as “die-by-yourself dungeons”. Dungeons like these required several parties working in unison along different routes to complete.</p><br/><p>Of course, it was only right that everyone should work together toward a common objective. However, it was annoying to be split up.</p><br/><p>This was an unknown dungeon which nobody had explored before.</p><br/><p>The fact that they knew nothing about it fueled their anger at the shitty devs and honed their excitement at the idea of finding rare data crystals. If they could not stay together and share their joys and sorrow, the fun factor would be halved — no, it would be worse than that.</p><br/><p>Although he was not the superstitious sort, he could not help but feel uncomfortable that the guild’s first activity was something like this.</p><br/><p>Still, he could not whine about it. After all, it was his idea to delve into this dungeon, and everyone was gathered here because they supported him. Being even more wilful than this was not what a guildmaster should do.</p><br/><p>Just then, Punitto Moe began suggesting team assignments, as though ignoring Momonga’s internal shock.</p><br/><p>“How shall we proceed then, Tabula-san? This is a deviation from the original plan, and now we’ll need five parties.”</p><br/><p>“Indeed. The question now is how to allocate everyone. We should probably discuss this together. Things being as they are, we should have the crafters come in as well, since it would be hard to be pressed from behind anyway.”</p><br/><p>The basic 6-man party configuration in Yggdrasil was one tank, two attackers, one healer, one seeker and a wildcard, who was capable of adapting to changing situations.</p><br/><p>They had to evenly allocate their manpower into five parties, which was a fairly brainpower-intensive task.</p><br/><p>Anyone taking on this task needed to be intimately familiar with everyone’s abilities and preferences. A team that was put together sloppily would not be able to succeed. Therefore, assigning party rosters was one of the greatest challenges of such an endeavour.</p><br/><p>The question now was how to clear this dungeon.</p><br/><p>Dungeons like these were typically designed so that everyone would meet up at the boss room, whereupon they would face the raid boss together.</p><br/><p>If this pattern held true, then the parties had to be balanced.</p><br/><p>For instance, even two parties filled with the strongest members would have a hard time successfully clearing the entire dungeon. That being the case, it would probably be better to have four teams reach the boss and defeat him. There was strength in numbers after all. If there was no vast difference in individual abilities, 24 people would always be better than 12 people.</p><br/><p>Even if Warrior Takemikazuchi — one of the strongest members of Ainz Ooal Gown — was attacked by two players of equal level, there was a high chance of him being defeated. The fact was that for every one attack he launched, he would be taking two in exchange. Of course, there were some monstrous types who could win when outnumbered two to one, but those were few and far between.</p><br/><p>Therefore, the most important thing was to not lose anyone and reach the dungeon’s core.</p><br/><p>Punitto Moe stood before everyone and discussed the matter of personnel assignment.</p><br/><p>Momonga remained silent. Punitto Moe was the best planner in the group, so it would be fine to let him handle things. Most likely, everyone here would think that too. It would probably be fine even if he began giving orders.</p><br/><p>In many games, one could not reorganize a party outside of a safe zone, or certain designated locations. However, in YGGDRASIL, one could freely change one’s party anywhere and anytime. This allowed for very flexible parties, and with a good team, one could overcome any difficulty.</p><br/><p>However, the effects of party-wide magic and skills terminated once the party was disbanded. One had to take that drawback into consideration when regrouping. That trick would not work if used in a dire situation.</p><br/><p>He looked around at his guildmates. Some of them were changing their gear. Some of them were briefly offline for a bathroom break, and some of them were talking excitedly with Punitto Moe.</p><br/><p>Although they all seemed to be doing their own thing, Momonga could feel a strange sense of coordination permeating the scene.</p><br/><p>Slowly, the Magical Attackers, Physical Attackers, Tanks, Healers, Seekers and Others were assigned to their parties.</p><br/><p>Momonga fell into the “Other” category.</p><br/><p>“Others” were not unnecessary. While they were uncommon for the most part, this guild — Ainz Ooal Gown — was different. To them, “Others” were challenging classes who could adapt to many different circumstances.</p><br/><p>Momonga used the drops from PKing — the corpses of other players — to learn many different spells. Because of that, he was typically placed in this position during dungeon raids.</p><br/><p>Of course, he was not given this position because he could use many different spells, but because he could use suitable spells for the appropriate situation.</p><br/><p>Because he had to handle this difficult task, Momonga had priority on the corpses from PKing, as a sign of his comrade’s faith in his abilities.</p><br/><p>In return, Momonga gave his all for his comrades, and they all felt that he could do no wrong.</p><br/><p>Finally, Punitto Moe announced the party assignments.</p><br/><p>Momonga’s group was comprised of:</p><br/><p>Magic Attacker: Ulbert Alain Odle</p><br/><p>Physical Attacker: Warrior Takemikazuchi</p><br/><p>Tank: Bukubukuchagama</p><br/><p>Healer: Yamaiko</p><br/><p>Seeker: Nishiki Enrai</p><br/><p>And Momonga was the wildcard.</p><br/><p>Momonga gasped in surprise as he heard the lineup.</p><br/><p>There were people in the guild who could clear a dungeon easily, and more than half of them were in his party.</p><br/><p>First was Ulbert Alain Odle, who had levels in several classes boasting high firepower. His burst damage was unrivalled.</p><br/><p>Next was Warrior Takemikazuchi, who had levels in offense-oriented classes like Kensei and so on. Much like Nishiki Enrai, his defense was low, but at the same time he had the highest physical damage ability in the entire guild.</p><br/><p>Bukubukuchagama the tank was a specialized character who had maximized her defense. She had the title of “the Unsinkable”.</p><br/><p>The healer Yamaiko was a Nephilim, who banked on her race’s ability to take two very high ability scores and three very low ability scores to maximize her spirit and endurance. In addition she was fully equipped with gear that abandoned offense to focus on defense. Combined with her regenerative abilities, she was far more survivable than even a half-baked tank class.</p><br/><p>Nishiki Enrai was their seeker, but due to his absolute focus on attack power, he also made a good attacker in his own right. In addition, when he used his stealth abilities, he could deliver a single blow whose power could outstrip even Warrior Takemikazuchi’s.</p><br/><p>This was a team made of members who were fully optimized for their role.</p><br/><p>The fact was, if these members were redistributed throughout the other parties, it would not be a surprise if their survival rate went up.</p><br/><p>“Eh? Is this really okay?”</p><br/><p>Upon hearing Momonga’s voice, Punitto Moe turned around.</p><br/><p>“Oh, Momonga-san, is something wrong?”</p><br/><p>“Mm. Frankly, I think this party is a little unbalanced. They’re all good players and it seems they would be better off distributed out to groups supported by NPCs in order to shore up their abilities.”</p><br/><p>Momonga looked around.</p><br/><p>The people who weren’t here must have briefly returned to town to hire several NPC mercenaries. By teleporting to their allies, they could avoid having to go through the swamp and return here directly.</p><br/><p>“I think putting Bukubukuchagama-san and Warrior Takemikazuchi-san in parties with NPCs would be more even. However, we know nothing about this dungeon. Therefore, I think it would be better to have two strong teams rather than an even distribution.”</p><br/><p>And the members of the other team are…?</p><br/><p>Momonga looked over to the guild’s strongest man, Touch Me, and he had his answer. He must be leading that team.</p><br/><p>He looked at the people with him, and it was true. All the strongest members of Ainz Ooal Gown were now gathered together.</p><br/><p>Punitto Moe understood what Momonga was looking at, and nodded.</p><br/><p>“Thats right, it’s them. Momonga-san, if the worst comes to pass, please take down the boss with them. Although I understand that defeating a 30-man boss with only 12 people is incredibly difficult, I feel that it would be better to make preparations for that situation.”</p><br/><p>“If that’s the case, wouldn’t I be better replaced by someone else?”</p><br/><p>Momonga had faith in his skills as a wildcard, but he had his doubts about whether he could be considered a superior player.</p><br/><p>Punitto Moe laughed and replied, “Of course not,” before explaining.</p><br/><p>“Momonga-san, invading the Great Tomb of Nazarick, this virgin dungeon, was the result of your wilfulness, no? Therefore, it’s only fair that you clear it beautifully, oh guildmaster. Show us how it’s done.”</p><br/><p>Waves of heat surged out from Momonga’s belly.</p><br/><p>Punitto Moe was right. He was the one who had selfishly brought all these people here, so he could not be the one to demoralize them. How could he not do his part in clearing this dungeon with everyone else?</p><br/><p>“Got it!”</p><br/><p>“That’s the spirit! Plus, you’re a very good wildcard, aren’t you, Momonga-san? Frankly speaking, I think you’re the most adaptable person here, which is why I put you with them. A party of specialists can fall apart quickly if things go bad, so I had to include you and your flexibility, Momonga-san. Let me be honest with you here — your party is the best party because you are in it.”</p><br/><p>“No, no, the others are like that, but not me.”</p><br/><p>“There you go being weak again. Believe in yourself a little. The fact is, Nishiki Enrai the seeker is more of an attacker, so having you there is also to help with reconnaissance. So… please bring them safely to the boss, Momonga-san.”</p><br/><p>Now that Punitto Moe had praised him to the heavens, Momonga could not show his weak side.</p><br/><p>“I understand. Please accept my humble contribution.”</p><br/><p>“I’m looking forward to it.”</p><br/><p>♦ ♦ ♦</p><br/><p>After assembling the parties, they each arrived before the stone statues. As though on cue — or rather, they had triggered an automated sequence — something activated.</p><br/><p>“How dare you profane the Great Tomb of Nazarick, oh foolish and greedy ones.”</p><br/><p>That was a male voice. It was followed by a female voice.</p><br/><p>“Or should I say, brave ones.”</p><br/><p>“Be you foolish or brave, we shall take your measure. We stand before you, the Five Rulers.”</p><br/><p>It was a hoarse man’s voice, different from the first two. Somewhere near Momonga, Bukubukuchagama muttered, “Yes, boss.”</p><br/><p>“You who desire this land. Defeat us, and show us your true power.”</p><br/><p>Light appeared on the stone slabs. Taking the right actions would probably engage teleportation of some sort.</p><br/><p>“…The last voice belonged to the Lord of Helheim. To think he came all the way out here. What a long way to go! If it’s that bearded old man, don’t you think it’s pretty suspicious? Should we kill him off with Longinus?”</p><br/><p>“Let’s leave it at that. I was hoping they would reuse that seiyuu elsewhere. I heard they lowered the quality of rare gacha drops in order to hire a large cast of seiyuus.”</p><br/><p>“Personally, I’m all for them hiring more people. I can use another alias to perform. There’re still some I haven’t even used yet.”</p><br/><p>The kneeling Peroroncino looked over to Momonga. He must have heard his sister’s conversation.</p><br/><p>“Well, let’s leave it at that. ‘You who desire this place’. Is that what it said? In any case, it’s clear that this is a guild base dungeon.”</p><br/><p>“An unexpected bonus.”</p><br/><p>Clearing a dungeon often yielded a variety of items, from rare data crystals to artifacts. However, clearing a guild base dungeon merely gave you owner’s rights. In addition, guilds could only own one dungeon at a time. If they wanted to claim another dungeon, they would need to relinquish their claim on their present one.</p><br/><p>Dungeons like these were hardly an unexpected bonus if the guild did not seriously intend to claim it.</p><br/><p>“…Would anybody want to found a guild base in a far off place like this?”</p><br/><p>“Probably not. Besides, we don’t know what kind of base this is.”</p><br/><p>It was unknown how many total levels of NPCs they could create. And then, there was another problem beyond that.</p><br/><p>It was called POP bankruptcy.</p><br/><p>The monsters which automatically spawned under level 30 had maintenance costs, depending on their type. It was zero for undead, but living creatures, in particular large creatures, had maintenance costs which increased proportionally to the size of their bodies. In other words, a guild base which only popped large living creatures would rack up a ruinous maintenance bill. If a guild base’s innate income was not sufficient to cover those costs, the guild members would have to earn that money themselves. In addition, trap activation and monster summoning were expensive as well. Being attacked by an enemy guild could incur incalculable expenses for the defenders, and might even force them into bankruptcy.</p><br/><p>‘“We won’t know until we claim this place.”</p><br/><p>“…Well, we could always sell the information.”</p><br/><p>Their enthusiasm had cooled off by now. After all, even if they did take this place, they would have to either give it up or sell off the very thing the entire guild had worked so hard to conquer.</p><br/><p>Sensing the mood in the air, Touch Me spoke up.</p><br/><p>“Still, everyone. Don’t you think we ought to have a proper guild base? Not a rented one like we have now, but something we can change and rearrange as we see fit.”</p><br/><p>“Well, if we’re talking about making anything we want, I’ve been thinking of settling down somewhere and then making something in earnest. However, will it be here?”</p><br/><p>“Even if we don’t find a place to settle down, I agree with Touch-san that we need a proper guild base. I mean, we can’t leave too many things behind because we’re afraid of being attacked at any time, right? And we won’t need to be on alert after going to an empty rental place.”</p><br/><p>He was answered by a chorus of people saying, “That’s right”.</p><br/><p>“I think using this place for experiments in building a guild base would be a good reason for conquering it. Besides, I read up on the guild base system on the developers’ site, but it seems different from how it actually is in the game.”</p><br/><p>“The Experimental Tomb of Nazarick, huh. So if we use this as a stepping stone, what sort of place will we use as our guild base?”</p><br/><p>“We’ll have to think big, of course. A level 3000 guild base should do.”</p><br/><p>“That’s too much~”</p><br/><p>“That’s impossible.”</p><br/><p>Everyone laughed.</p><br/><p>Momonga laughed with them.</p><br/><p>There were nine of these huge bases — one for each world — but holding on to all of them was practically impossible. To begin with, even if they really managed to seize control of all of them, a weak guild would immediately be embroiled in complex guild wars, and holding on to the base would be very difficult.</p><br/><p>“Even if we did hold such a place, we’d go bankrupt from repeated attacks. That being the case, why not find a smaller place? We wouldn’t have to spend so much on maintenance either.”</p><br/><p>“We could collect tax in a city base, which would help with the upkeep.”</p><br/><p>“City bases don’t have a lot of NPC levels, right? The maximum is 700, I think. The shitty devs like doing it that way. Harder areas give higher levels.”</p><br/><p>“Hmm, so could that mean this place might have an unexpectedly high number of levels? After all, nobody’s discovered it until now.”</p><br/><p>“Well, we won’t get anywhere just talking here… let’s just do as Momonga-san says and clear this place once. We can discuss everything later. Let’s not count our chickens before they’re hatched.”</p><br/><p>Everyone agreed with that.</p><br/><p>Soon, they would be treading into uncharted territory, an unknown dungeon.</p><br/><p>Clearing an unknown dungeon which was not far below the recommended level was unheard of in Yggdrasil.</p><br/><p>This was the difficulty they faced here.</p><br/><p>Momonga could no longer detect any lightheartedness from his companions.</p><br/><p>In their place were serious players who could overcome any difficulty.</p><br/><p>Momonga was filled with a baseless but strange confidence that his people could conquer a dungeon they had never seen before.</p><br/><p>There were people who said that those who were too invested in the game were weird and gross. It was just a game, why so serious?</p><br/><p>However, there was nothing wrong with getting into a game.</p><br/><p>Who decreed that things like piano and ballet were high-class hobbies, while games were for commoners? The people who said this did not know that they were merely forcing their inflexible attitudes on others.</p><br/><p>Momonga felt a deep sense of gratitude to his companions, who were earnestly discussing how to clear this dungeon.</p><br/><p>“Say, you think we can sustain our buffs? If we could, then we could use extended buffs on ourselves, right?”</p><br/><p>“I don’t think the devs would be that nice. Be ready to have them all stripped off you the moment you step through that door.</p><br/><p>“Those devs are real shits.”</p><br/><p>Someone laughed uncontrollably.</p><br/><p>This was how much the Yggdrasil devs were trusted. Fully 100% of players agreed that they were sadists.</p><br/><p>In fact, they would be more worried if the devs did not put in any evil traps.</p><br/><p>Therefore, when something unreasonable happened, there would be a great cry of “shitty devs”. In fact, calling them “shitty devs” was in its own way a form of affection.</p><br/><p>—Although there had been numerous occasions where they cursed the devs in earnest.</p><br/><p>“Then, why don’t we have our lovely guildmaster Momonga-shi, who suggested we attempt this unknown dungeon, come out and address us? Come, Momonga-san, say something.”</p><br/><p>He nervously squeaked out an “Eh?” as Punitto Moe spoke, but the gazes of everyone — though their faces did not change — filled the air, and he eventually spoke.</p><br/><p>“Everyone! I’m the newly elected sadistic guildmaster, Momonga!”</p><br/><p>Amidst the chuckling, Momonga continued.</p><br/><p>“This is Ainz Ooal Gown’s maiden venture! We shall conquer this difficult dungeon that we have seen for the first time! We shall make the shitty devs grind their teeth in frustration! We shall do what no normal guild can do! Everyone! Let’s go!”</p><br/><p>Ohhhh! An overflowing cheer echoed through the building.</p><br/><p>Part 5</p><br/><p>After passing through the rightmost of the five doors before the statues, they saw a classic graveyard sprawling before them.</p><br/><p>The place was veiled in fathomless darkness, aside from the parts lit by magical illumination.</p><br/><p>These guild members had delved into countless dungeons. There was nothing to be afraid of. However—</p><br/><p>—Momonga could see in the dark, but he could not see his companions. It would seem they had been teleported elsewhere, after all. If there were only one teleport destination, there would be no need for so many doors. It was a logical conclusion.</p><br/><p>Momonga abandoned his vain hope. All he could do was pray they all met up again inside. However, a cold part of himself was saying, that’s impossible.</p><br/><p>“Good grief, what a relief. Those devs might be shit, but even they aren’t shitty enough to split up the team. You know, split them up and make them meet up again.”</p><br/><p>“Take-yan, so you’re saying that if they ended up sending multiple people of the same roles together, we might as well forget about trying to conquer this dungeon, then.”</p><br/><p>“…I really think those shitty devs would actually do that.”</p><br/><p>“Mm, I agree with you, Buku-chan. Honestly, sometimes I feel the developers are too evil. ‘Ah, sucks to be you’, is what I imagine they’d say.”</p><br/><p>“Uwah~ Yama-chan’s bullying me~”</p><br/><p>“Tehe~”</p><br/><p>Perhaps she might be cute when she laughed in the real world, but she looked like a monster in here. Since it was only her voice which was adorable, that just made her appear even scarier.</p><br/><p>“Kazecchi! Repeat After Me~ Kazecchi!”</p><br/><p>“Kazecchi!”</p><br/><p>“Oh~ Good, Gooder, Goodest!”</p><br/><p>“Then, Buku— Kazecchi, since you’ve gotten your energy back, let’s go.”</p><br/><p>“Yama-chan’s bullying me~”</p><br/><p>They talked and laughed as they prepared themselves. There were many things to do. For instance, the frontliners had to activate long-lasting skills, or buff themselves up with magic items.</p><br/><p>“Undead reactions… ah, forget it, they’re everywhere. In any case, I’ll let you guys see for yourselves.”</p><br/><p>Momonga, the eternal backliner, cast a spell which let everyone detect undead reactions.</p><br/><p>“Well, I expected as much, but to think it really was undead… Mm, well, it kind of bothers me to go in so directly, but I guess this works too. Controlling hate is a pain, after all,” Bukubukuchagama grumbled as she saw the red dots in her field of vision.</p><br/><p>When monsters attacked, they would target “the one they wanted to hit the most”. This could be expressed as a numeric value, called hate. Causing more damage, healing HP, buffing, debuffing or using taunting-type skills would increase hate. When a player was hit by a monster, it would “resolve” the matter and that monster’s hate of the player would decrease. Because hate values fluctuated often during a battle, tanks had to pay close attention to monster hate values, lest the backliners take a hit.</p><br/><p>In order to manage golems or the undead, who were immune to mental manipulation, tanks had to use certain specialized hate control skills. Of course, that was no problem for Bukubukuchagama.</p><br/><p>“Then, how should we proceed?”</p><br/><p>They had been teleported into a burial chamber of some sort, with only one door.</p><br/><p>“Doesn’t look like there’re any secret doors.”</p><br/><p>“Then I guess we have to go forward… or do we? Still, we need to know what the undead outside are like.”</p><br/><p>There were four red dots  representing undead reactions  on the other side of the door. If these undead were of the same level as themselves, then there would be no need to trouble the backliners to cast offensive spells, but their level was unknown, and there might be other enemies besides the undead.</p><br/><p>Nishiki Enrai and Warrior Takemikazuchi raised their weapons, while Bukubukuchagama the tank moved to the front, holding up two shields. The reason why Bukubukuchagama did not equip herself with weapons was because slimes like herself had poor strength, and they were not suited to dealing physical damage. In return, however, they had extremely high resistance to that same physical damage.</p><br/><p>In order to DPS as a slime, one needed to specialize in assassin-type classes which killed in one hit.</p><br/><p>It would seem she was going to test the waters, and see what the enemy was like. The proof of that was how they had not seen her preparing to use a powerful skill before moving to contact.</p><br/><p>“Then, as discussed earlier, you’ll be our commander, Bukubukuchagama.”</p><br/><p>“O-kay~ I gotcha~”</p><br/><p>“It seems you’re always trying to sound like a cute kid when there’s no need to. Your voice as Kazecchi is pleasant enough, so there’s no need for that, right?”</p><br/><p>“Yama-chan… I think I’m in love.”</p><br/><p>“Ah, sorry. I’m not into that sort of thing.”</p><br/><p>“I, I was dumped~! And instantly too! Uuu…”</p><br/><p>Bukubukuchagama emitted a mournful cry of despair.</p><br/><p>Of course, anyone could tell that it was merely acting.</p><br/><p>Still, she was a seiyuu, for games where sound was important because expressions could not change. Therefore, it sounded quite realistic.</p><br/><p>“In the past, I’m not sure if it was because I said the wrong thing , but one of my female kouhais actually confessed to me for real. So I hope you’ll give me a break here.”</p><br/><p>“Ah, really?”</p><br/><p>The was no trace of her prior dejection in the way Bukubukuchagama was asking Yamaiko.</p><br/><p>“Mm. Come to think of it… nothing good came of it at all. That kouhai of mine loved to make trouble… and she kept arguing with my little sister. What a headache.”</p><br/><p>“And so your kouhai’s words depress you when you recall them now?”</p><br/><p>“Do you think so, Takemikazuchi-san?”</p><br/><p>“Ahh, even if it was nothing much at that point in time, after several years, you’d want to get rid of them. ‘Ahhh, why did I do something like that.’ It’s like your own black history.”</p><br/><p>Momonga merely thought “Hm”, since he had not had any memories like those at that time. These should have been mistakes of one’s youth. However, he was a proper adult now, and he was certain that he would never make such a mistake.</p><br/><p>“Well, it would be good if it was like that. For all you know, that troublesome kouhai might have gotten married, and became a wife and mother.”</p><br/><p>The men looked toward the pink slime.</p><br/><p>“Let’s not talk about marriage, Yama-chan. You see, I am everyone’s idol Chagama-san, so all talk of lovers and weddings are forbidden.”</p><br/><p>What was she worried about? What Bukubukuchagama said made him want to tease her.</p><br/><p>Good thing Peroroncino-san isn’t here, Momonga thought.</p><br/><p>If he was, he would definitely make a big deal out of it.</p><br/><p>“Well, that’s enough girl-talk for now, no? We ought to move on. It would be bad if we were the last to arrive at our destination.”</p><br/><p>“Oh-kay~ Then, we’ll go with the standard lineup. Nishiki-san, are there any traps?”</p><br/><p>“Definitely not.”</p><br/><p>“Then, shall we? Buff us all up, please. Extended buffs for me.”</p><br/><p>“Take it away, Momonga-san.”</p><br/><p>Momonga began buffing up the group, and Yamaiko followed suit from beside him. If the enemy had been here, who knew how much hate they would have gained?</p><br/><p>“Ah, honestly, it’s quite surprising how many spells you know. Even with cash items you can only get up to 400. It would be nice to get levels in something which gives an ability similar to Dark Wisdom. A magic caster’s strength is measured by the number of spells he knows, after all.”</p><br/><p>“Really? I feel firepower should be the main consideration, right? Personally, I’m quite envious of your attack power, Ulbert-san.”</p><br/><p>“I’ve been thinking about it recently, but if damage is all you want, wouldn’t that be more easily done by the frontliners? Magic casters ought to know utility spells.”</p><br/><p>“However, magic casters are limited by MP, so they’ve got higher DPS than frontliners as long as their MP holds out, no? Seems firepower really is more important — oh, I’m done buffing over here.”</p><br/><p>“O-kay~ Then it’s my turn. First, open the door and let the undead in. We’ll be in combat once they come in through the door, okay?”</p><br/><p>After receiving acknowledgement from the others, Bukubukuchagama waddled stickily over to the front and opened the door. She immediately fell back. Although it would be good to bottleneck the enemy at the door, the chance of things cocking up would be lessened if they have more space to fight.</p><br/><p>Four undead surged in. There was no sign of other monsters.</p><br/><p>Their skin was the color of rotted wood, covered in livor mortis, over which they were nominally wearing some rags. Their hands were twisted into strange shapes, like a ball covered in dagger-like spikes. Their jaws hung open, revealing long, tusk-like teeth that grew up and out.</p><br/><p>Momonga saw the names of the enemy in his field of vision, and judging by the color of those names they were lower-level than him. Still, this was an unexplored dungeon, so it paid to be cautious. He could not rule out the fact that they might be variant monsters. Even if they looked the same on the outside, if their names included the name of the region, they would probably be somewhat higher in level than other monsters of their type. There were players who were either careless or arrogant, and fought unknown monsters without collecting information about them. In the end, not a single one of them got away without learning a painful lesson.</p><br/><p>The others should have seen the names as well, so it was likely that all they could infer from the color of the names was the monsters’ relative level.</p><br/><p>“[Discern Enemy]!”</p><br/><p>This spell was not as useful as the lore skills of the sage-type classes, but Momonga had a certain degree of insight when it came to the undead.</p><br/><p>Another window popped up, and among the information there was the monster’s level.</p><br/><p>“Level 83!”</p><br/><p>“Hmph! If that’s all, we won’t need to trouble the two of you!”</p><br/><p>“Oraaaaaa!”</p><br/><p>Nishiki Enrai and Warrior Takemikazuchi launched their attacks at the four undead. Given that they were merely level 83 monsters, there was no need to use their more powerful skills, which had limited uses per day. They could finish this battle easily with skills that refreshed after a short rest.</p><br/><p>“It seems you didn’t take much damage, so what should we do, Kazecchi?”</p><br/><p>“Hm — well, if that’s all, it’ll regen by itself, so let’s push on,” answered Bukubukuchagama, who had skilfully controlled the group’s hate and taken all the attacks aimed at the others upon herself. The reply was directed at Yamaiko.</p><br/><p>Meanwhile, Nishiki Enrai was picking up the gold and data crystals that had dropped after wiping out the undead.</p><br/><p>“So, it’s over.”</p><br/><p>“Then, let’s advance, Momonga-san.”</p><br/><p>Naturally, Momonga knew what Bukubukuchagama was getting at.</p><br/><p>“Understood,” he replied, and as he said that he cast his spells.</p><br/><p>“[Extend Magic – Bless of Titania].”</p><br/><p>“[Extend Magic – Lead of Yatagarasu].”</p><br/><p>A tiny fairy appeared in front of them. She wore a crown, yet was only the height of a little finger. She flapped her butterfly wings, enveloping her in a sphere of light, and floated at the head of the group.</p><br/><p>The next spell created a three-legged crow. Unlike normal crows, it exuded a stern majesty. It flapped its wings, and flew to the head of the formation as well, beside the little glowing ball.</p><br/><p>The Yatagarasu guided players along the shortest path to the heart of the dungeon, while the fairy queen beside him would take them along the least dangerous path.</p><br/><p>They would decide which to follow depending on the resource expenditures, traps and monsters encountered along the way. However, neither of these spells indicated hidden routes. In addition, there were magical traps which were designed to confuse spells like these, so they had to stay on guard.</p><br/><p>“Huh, to think you actually knew two 9th-tier divinations. I’m pretty envious of your Dark Wisdom.”</p><br/><p>“Well, I’m a specialized necromancer. I’d be nothing more than a burden if I couldn’t even do that much.”</p><br/><p>“I think your dream build is actually quite practical.”</p><br/><p>“Is that so,” Momonga chuckled.</p><br/><p>It could not be helped, after all one of his friends had praised him.</p><br/><p>“Then, lead on, Nishiki-san~”</p><br/><p>“Roger that, Commander-dono.”</p><br/><p>Behind their guides, the party proceeded in the order of Nishiki Enrai, Warrior Takemikazuchi, Bukubukuchagama, Momonga, Ulbert and finally Yamaiko. If this was not the first time they had seen this dungeon, they could probably go straight to the heart of the dungeon without further ado. However, they knew nothing of this place, so they had to keep an eye out for traps as they moved.</p><br/><p>Momonga most cherished the times when they chatted with each other as they moved along, one eye on their surroundings. Although people derived enjoyment from the games in different ways, Momonga was happiest when talking with the others.</p><br/><p>For all he knew, it was because he only talked about business at work, and thus he thirsted after genuine conversation.</p><br/><p>Momonga aimlessly contemplated that possibility.</p><br/><p>“Still, this does seem like your average tomb-type dungeon. Nothing really stands out. Could there be some gimmick here?”</p><br/><p>“…Or some kind of evil trap. Wouldn’t some unfair battlefield that tests our preparation be par for the course? Maybe there’s nothing devious besides the splitting up at the beginning of the dungeon.”</p><br/><p>The others shook their heads as they heard Nishiki Enrai speak.</p><br/><p>“No, there’ll definitely be something. The developers would definitely pull something like that. I wouldn’t be surprised if these elemental dungeons pushed people towards making optimized parties.”</p><br/><p>“Indeed, I think the developers would be capable of that.”</p><br/><p>“They’re the shitty devs, after all. Why would they let you clear a dungeon you’d never seen before?”</p><br/><p>“Nishiki-san, you’re underestimating the Yggdrasil devs… hm? Or could it be… I say, Momonga-san…”</p><br/><p>Bukubukuchagama turned what was probably her face toward Momonga.</p><br/><p>“Sorry about this, but could you contact my little brother with a [Message]? I need to double-check the situation with him.”</p><br/><p>“Got it.”</p><br/><p>With no reason to refuse, Momonga cast the [Message] spell, and sent it to Peroroncino. After a brief ring tone, about ten seconds’ worth, the other side picked up.</p><br/><p>“Yo~ free to talk?”</p><br/><p>“Yup. Well, we’ve finished fighting, so it should be all right.”</p><br/><p>“How are you over there? We’re moving through a tomb now.”</p><br/><p>“—As I thought, those shitty devs!”</p><br/><p>“Wha-what happened?”</p><br/><p>“We were teleported to some kind of lava land. Fire-type monsters have been attacking us. And something ambushed us from the magma, it really did a number on us.”</p><br/><p>“Really?”</p><br/><p>He passed on what Peroroncino was saying through the [Message] to his comrades, about being teleported to a magma-rich area. Their responses were along the lines of “Ah, as expected.”</p><br/><p>“…Do you think we could swap party members with teleportation magic?”</p><br/><p>“Well, I think it’s worth a try, but do you think the devs would be that nice? Since we’re on different floors, we might not be able to teleport at all. Otherwise why would they put those doors at the entrance?”</p><br/><p>“…In the worst-case scenario, we might have been warped into another dimension through those teleport traps.”</p><br/><p>Momonga switched the [Message] spell back.</p><br/><p>“Then how are you guys over there? Can you break through?”</p><br/><p>“Right now, we should be able to handle it. Man, if you thought undead would be around because it was a tomb and selected fire-type gear to deal with them, you’d be screwed. All you’d be able to do is run and hide. They really are pieces of shit, those devs.”</p><br/><p>“Got it. Good luck, guys.”</p><br/><p>“You too.”</p><br/><p>Momonga then tried contacting the other parties.</p><br/><p>After that, he learned that the dungeon they had invaded was one with multiple floors, with five different zones — or floors — a glacier, a volcanic region, an underground lake, a forest and the tomb which Momonga and the others were presently in. In addition, the monsters in each floor were different, and it seemed the undead were only present in the tomb.</p><br/><p>“Wow, as expected of our new guildmaster! Not bringing specialized gear was the right choice.”</p><br/><p>If they had simply loaded themselves with fire and holy-elemental equipment in order to take on the undead expected from this place, quite a few teams would have had a hard time.</p><br/><p>However, because this was the first time they were raiding an unexplored dungeon, they had brought along all sorts of gear, in accordance to the differing information they had collected. In other words, they had the ability to adapt their loadouts in response to changing situations, and thus they had a fighting chance to make it deeper into the dungeon.</p><br/><p>“Totally different from the previous leader! Well done!”</p><br/><p>Momonga furrowed his brows in response to Ulbert’s exclamation. For once, not having facial expressions in Yggdrasil was a great help.</p><br/><p>“However, the shitty devs are really shitty. I won’t forget to add ‘shitty’ in front of the developers whenever I speak of them.”</p><br/><p>“…Did you only just realize that now? Like the Longinus, what the hell is up with that? And then there were those events that were impossible to clear…”</p><br/><p>Just as everyone was passionately venting their spleens at the Yggdrasil developers, Momonga sent a [Message] to Ulbert, who had wandered off to the side.</p><br/><p>“What’s the matter, Momonga-san. Something wrong?”</p><br/><p>“No, it’s not like that. I don’t think I’ve noticed any mistakes so far… well, I just wanted to talk to you in private, and to be frank I’ve been thinking about this for a while. Ulbert-san, do you really hate Touch-san that much?”</p><br/><p>He could have just kept putting it off. Momonga did not want to tread on a landmine, after all. However, this hidden bomb might explode in the future. If that were the case, he had to know if there was anything which might cause the guild to disband. Besides, if it did go off now, at least the damage would be limited.</p><br/><p>As though mocking Momonga’s resolve, Ulbert remained silent.</p><br/><p>And then, just as Momonga was about to give up, there was a quiet answer.</p><br/><p>“I dislike him. Though I know it’s just pointless jealousy.”</p><br/><p>“Is that so…”</p><br/><p>“Momonga-san, I’m really sorry for saying this, but aren’t you a born loser like me, Momonga-san? No matter how hard you try, you’ll never be able to lead a comfortable life.”</p><br/><p>“Well, I didn’t try that hard to begin with anyway, so I think I’m getting what I deserve. Besides, it beats being bored. I get paid, after all, and I don’t mind sinking my money into Yggdrasil.”</p><br/><p>“…Well, I guess that’s true. Maybe you’re a half-loser then. Personally, I only made it through elementary school. I think it was the same for you, am I right, Momonga-san?”</p><br/><p>Ulbert seemed to have brought it up in the past, according to Momonga’s recollections. Indeed, his attitude towards Ulbert had changed since then. At first he thought it was pity, but now it would seem he was feeling a sort of kinship to him instead.</p><br/><p>“That’s true. However, being able to find a job with elementary school education isn’t bad, right?”</p><br/><p>“If they didn’t teach you the bare minimum in elementary school, you couldn’t even become a subordinate to the born winners, so they made elementary school easy… Honestly, it’s ridiculous how you end up at one of two extremes in this world from birth. It’s insane how unfair this world is. You can climb the ranks if you work hard? Don’t make me laugh.”</p><br/><p>Compared to Ulbert’s cloying, sludgy resentment for society, his dislike for Touch Me was laughable at best. Momonga marvelled at Ulbert’s ability to hate.</p><br/><p>“Ulbert-san—”</p><br/><p>“My parents died pretty horribly. Working in such a dangerous place… they couldn’t even find their bones, you know. And the compensation they paid to their employees was miserable. That’s why they didn’t stop the production lines. After all, stopping them would incur huge losses. Losers like us… they use us up and throw us away.”</p><br/><p>Momonga suddenly recalled his own mother.</p><br/><p>“…That’s how it was, huh. That’s what happened to your parents, Ulbert-san? My mother worked herself to death. When I woke up in the morning I saw her collapsed in the kitchen. Even lashed with fatigue, she pushed herself to make my favorite dish. If only she hadn’t worried about it and just taken a rest instead… she might still be around now… When I found her, her body was already ice cold… at least, that’s how I remember it. My memory’s a bit hazy on that count.”</p><br/><p>After a brief silence, he was answered by a voice which sounded like it had been forced out.</p><br/><p>“…I’m sorry for bringing up such an unpleasant topic.”</p><br/><p>“Don’t worry about it, I barely remember it myself…”</p><br/><p>“…Still, I apologize for it… all in all, I personally can’t stand the winners. Although it’s not like Touch-san did anything wrong…”</p><br/><p>“I understand. However, how should I say this…? What happens out there has nothing to do with what happens here. Look, I’m enjoying myself too, right? So… how shall I say this… it would be good if you could enjoy yourself too, Ulbert-san. If I’m not wrong, it’s not like you don’t want to mix with the others, right? So, uh, how shall I put it—?”</p><br/><p>“Ah — it’s just like you said. Ahhhh, I’m sorry for causing you all this trouble, Momonga-san. I’ll do my best not to throw tantrums from now on.”</p><br/><p>“Then I’ll leave that to you. We should probably wrap this up around now.”</p><br/><p>“Got it. Although, the thing about this game is—”</p><br/><p>“Speaking of which, Chagama-san, shouldn’t I make those undead adjutants around now?”</p><br/><p>“Hm? You should save the skills which cost experience until the end, so either a Death Grandpa or a Death Grandma should be fine, right?”</p><br/><p>Obviously, the monsters were not actually called Death Grandpa or Grandma. They were merely nicknames for the monsters known as the Death Emperor and the Death Empress.</p><br/><p>“That’s true. So, Grandpa or Grandma? Since our vanguards are happily cleaving through the enemy, Grandpa would be better, right?”</p><br/><p>“Well, they do look pretty motivated…”</p><br/><p>As they loudly taunted their opponents as mooks, small fry and the like, Nishiki Enrai and Warrior Takemikazuchi laid into the undead with powerful blows. The reason that they could attack so unreservedly was most likely due to Bukubukuchagama’s masterful hate management.</p><br/><p>“After all, we still have resources. Heeeeeeey, Yama-chan, Yama-chan~”</p><br/><p>As she waited for the right moment to use a skill while the undead mauled her, Bukubukuchagama called out to Yamaiko, who stood behind them with a healing wand.</p><br/><p>“Yes, Chagama-san?’</p><br/><p>“It’s Kazecchi~”</p><br/><p>“…That again? Then, what’s the matter, Kazecchi?”</p><br/><p>“How’s your MP? How well can you heal everyone?”</p><br/><p>“It’s fine. Actually, I’ve been healing with a wand since just now.”</p><br/><p>Even wands imbued with high-tier spells would only heal about half as much as Yamaiko could if she personally cast a healing spell. Still, that was adequate for the task at hand, which was a sign of how well the three frontliners had played their roles.</p><br/><p>“I see~ then, could you not summon your switch attacker right now, Momonga-san?”</p><br/><p>“Got it. Then, I’ll await your instructions.”</p><br/><p>“Ahhh~ that’s not necessary. I’ll leave that to your own discretion, Momonga-san. I trust you.”</p><br/><p>“I’ll do my best, but let me know if I mess up.”</p><br/><p>“Mm, of course. Though I feel your skills are pretty good, so it should be fine, Momonga-san. If you train yourself, you can get even better — oops, hate control, hate control…”</p><br/><p>She must have used a skill that built hate. The undead, who had been wavering a little, turned to assault Bukubukuchagama again.</p><br/><p>She was immune to the negative status effects that undead could inflict, like poison or paralysis.</p><br/><p>In other words, she was the perfect tank.</p><br/><p>Of course, Momonga could not keep staring at her.</p><br/><p>He cast a tenth-tier spell which was naturally targeted on Bukubukuchagama.</p><br/><p>“[Ultimate Disturb].”</p><br/><p>Technically, there was no need to speak when casting spells, but one’s colleagues would not know what was going on if nothing was said. Therefore, magic casters announced their spell names as a sort of courtesy.</p><br/><p>“Thank you~ and now—”</p><br/><p>And because he observed that courtesy, Bukubukuchagama could spring into action right away.</p><br/><p>Thanks to this spell, Bukubukuchagama’s magic resistance rapidly increased, and the hate which should have been allotted to Momonga instead went to her.</p><br/><p>She was a very skilled player. Her swift and accurate judgements, born of long experience with the game, placed her firmly in the top class of Yggdrasil’s players.</p><br/><p>In particular, she was skilled at hate management, which was a difficult task since hate was a hidden value. There was virtually no way to know how much hate any given action produced without personal experience. Being able to do such a thing in the data-heavy Yggdrasil was a feat that required long hours of battles and practice.</p><br/><p>In a sense, Momonga admired Bukubukuchagama.</p><br/><p>“Well, if there was a way to cast this on the enemy, their caster-types would be useless,” Ulbert muttered as he used a wand to cast spells.</p><br/><p>[Ultimate Disturb] was a spell which greatly increases an ally’s magic resistance, at the price of wrecking their ability to cast spells. It was plainly obvious that one could neuter an enemy mage if the spell could be cast on them.</p><br/><p>“Well, I doubt you could ever pull that trick off,” Yamaiko replied as she cast a healing spell from her wand.</p><br/><p>In contrast, Bukubukuchagama chimed in with approval.</p><br/><p>“You shouldn’t say that, Yama-chan~ people discover new things because of folks like Ulbert-san who want to find them. Sometimes they might even find a loophole, but that’s expected of those shitty devs.”</p><br/><p>And so, the battle with the undead ended, with the sense that it was an easy fight.</p><br/><p>“If the shitty devs knew the meaning of balance, they’d probably make the boss here very strong.”</p><br/><p>“No, if you’re going by that, the boss here would be very weak. Why would the developers know about balance? It’s been amply demonstrated in the past, right?”</p><br/><p>As they laughed and agreed, the group followed their magically-created guides once more.</p><br/><p>After several easy battles, as they moved through the tomb—</p><br/><p>“Oops, hang on!”</p><br/><p>—The group ground to a halt from Nishiki Enrai’s sudden warning.</p><br/><p>“It’s a teleport trap. Disarm difficulty looks to be… red.”</p><br/><p>A red disarm rating meant that the chances of successfully disarming the trap were very low. The most common methods of disarming traps were through the use of a skill to temporarily raise one’s success rate, using a magic item, or by casting a trap-disarming spell.</p><br/><p>“Then, I guess it’s my turn.”</p><br/><p>However, this team had a method apart from those. It was a brute-force method that was also known as the warrior’s disarm, or a summon disarm.</p><br/><p>Momonga created a low-tier undead being — a skeleton.</p><br/><p>“[Undeath Slave Sight].”</p><br/><p>He cast his spell on the skeleton. A small window appeared in the corner of Momonga’s field of vision, allowing him to see through the skeleton’s eye sockets. Momonga then ordered it in the direction Nishiki Enrai was pointing at. They advanced, and then the skeleton suddenly vanished.</p><br/><p>He enlarged the small window.</p><br/><p>They had been teleported to a large burial chamber, and he could see the imposing figure of a huge monster. The monster’s name and level did not appear because he was looking through the eyes of the skeleton, but Momonga was already familiar with the stats of that big monster.</p><br/><p>“…Well, that skeleton travelled quite a distance. That’s a level 95 undead creature, a Greater Graveyard, I think. Ah, it died.”</p><br/><p>With a swipe of a massive arm, the window turned black and the spell terminated.</p><br/><p>“…20 seconds have passed. The teleport trap’s stopped operating… which means it’s inactive for now. Wait a little longer.”</p><br/><p>A minute later, Nishiki Enrai received a notification of the trap reactivating.</p><br/><p>“Then, let’s try it again.”</p><br/><p>Momonga created another skeleton, and sent it into the trap with the same spell as before.</p><br/><p>The teleport destination was the same burial chamber from earlier, guarded by the same monster.</p><br/><p>“Same place. Can we conclude that the trap only goes to one location?” Momonga asked Bukubukuchagama as the screen blacked out again.</p><br/><p>“Of course~” she replied.</p><br/><p>Momonga and the others, who strongly doubted that there was a proper route through the teleport trap, hurriedly ran through the trap while it was inactive.</p><br/><p>“If we get a new member in the guild, I hope they’re good at trap-disarming. After all, our rogue-type members are more focused on combat.”</p><br/><p>“That’s true. However, I don’t think we should be too picky. I think it’ll be fine as long as they’re heteromorphs. I don’t want us to be like other guilds with trial periods that are several weeks long, all sorts of entry requirements and so on. After all, Punitto-san said so himself, games are meant to be enjoyed.”</p><br/><p>“You’ve got a point, Momonga-san, and I agree with it. I guess it’s just us being selfish in wanting a proper thief.”</p><br/><p>“No, no, Yamaiko-san. I was just thinking that it would be good if we had someone like that. It’s not like we won’t let someone in who isn’t a thief.”</p><br/><p>“Ah, is that so? My apologies, Takemikazuchi-san.”</p><br/><p>“It’s fine, it’s fine, don’t worry about it. I said something weird myself. Well, we beat the trap, though we had to spend some resources on it. If anything happens, we can hire NPC mercenaries.”</p><br/><p>“Enough chitchat, the enemy’s coming. Stay alert until we make contact.”</p><br/><p>In accordance with Bukubukuchagama’s directions, Momonga steeled himself for combat. Carelessness was dangerous as long as one did not know about the enemy.</p><br/><p>Just as a murky, monstrous silhouette appeared in the corner of their eyes, Momonga and Ulbert simultaneously cast area-of-effect attack spells from their wands.</p><br/><p>Part 6</p><br/><p>There was a statue in what seemed like the heart of the dungeon. There were glowing magic circles before the statue, and it seemed likely that stepping into them would transport one to the boss.</p><br/><p>Since they had made it all the way here, even those shitty devs would not have put in endlessly-respawning monsters, so they had the luxury of changing out their gear for an anti-boss loadout. That said, nobody in this group trusted the developers. Nishiki Enrai carefully surveyed their surroundings while the magic casters used spells to check for secret doors nearby.</p><br/><p>Momonga did not have much gear to switch out, so he was the first to finish. Then, he contacted the other parties with a [Message].</p><br/><p>Since [Message] was a spell that created a one-to-one conversation, it was difficult to share information with the rest of the group. While there were certain commander-type classes who had skills that allowed for simultaneous communication with many people, Ainz Ooal Gown did not possess individuals with such skills.</p><br/><p>After speaking to everyone and discussing what he had learned with Punitto Moe, Momonga returned to his companions, who were almost done with their preparations. He also carried the sense of guilt which came with knowing something troublesome and knowing that he would have to rope others into helping him.</p><br/><p>“How goes it, Momonga-san? Did the other teams all make it?”</p><br/><p>Momonga answered Bukubukuchagama, the party leader:</p><br/><p>“Yes, the other four teams have reached the dungeon’s heart. They’ve all expended some resources, but they’re all in tip-top condition and ready to fight.”</p><br/><p>A small cheer came from the group. However, beating trash mobs and the environment made up 40% of the difficulty of raiding a dungeon, while beating its boss was the other 60%. In a way, they were not even halfway through.</p><br/><p>Still, one could turn it around and say that that they had completed almost half of the raid perfectly.</p><br/><p>“Still, there’s two… three problems. Two teams have already started fighting their respective bosses. Judging by shared information, the bosses they’ve encountered have different abilities, appearances, and boss rooms. The volcanic region’s boss seems to be some sort of dragon with lightning breath, while the party in the underwater lake seems to have encountered some kind of pure white bat.”</p><br/><p>“I see… so we can’t use information gained from people who went in first. What’s the second problem?”</p><br/><p>“There were announcements once they entered the boss rooms, and judging by the content of those announcements, the bosses get stronger in order of encounter. Which means, the team that fights their boss last…”</p><br/><p>The veteran players instantly knew what Momonga was trying to say.</p><br/><p>“I see… it would be simple enough if the bosses were even in power, but after several encounters, a strong boss might get even stronger. Is that it?”</p><br/><p>“Well, if it’s the shitty devs, they’d probably level up the boss until it’s unbeatable. ‘How many times should we make them fight before letting them win,’ they’d ask with smug grins on their faces.”</p><br/><p>“…And without any concrete information, we can’t formulate a battle plan. Hm, I think I know what you’re trying to say, Momonga-san. Come, speak your mind.”</p><br/><p>Pushed forward by everyone else, Momonga decided to come clean:</p><br/><p>“My apologies. I want to have our team pick the short straw. Can I trouble everyone to bear this hardship?”</p><br/><p>There was no hesitation in their answers.</p><br/><p>The others agreed unanimously. There was no reluctance or a sense that it could not be helped — only excitement.</p><br/><p>“Momonga-san, don’t be mistaken. This isn’t taking on a hardship, but rather, it’s because we’re like this that we can take it on at all. Look, in terms of physical damage dealing, defense, magical damage dealing, healing and support, we’re probably the most specialized members of Nine’s — no, of Ainz Ooal Gown. If I could put a team together to fight that boss, I’d probably pick all of us again.”</p><br/><p>After Bukubukuchagama, Warrior Takemikazuchi spoke up:</p><br/><p>“I came here because this was what I wanted to do. I couldn’t ask for anything more. I’ve always wanted to predict the foe’s tactics in a battle with no clear means of victory. Plus, if I’m backed up by you guys, that move of mine might…”</p><br/><p>“Ohhh! The Bright King Combo? It’s certainly possible, no it’s definitely possible,Take-yan!” Nishiki Enrai exclaimed in excitement.</p><br/><p>(TL Note: The Bright/Wisdom Kings, or Myo-O/ are warrior deities in Buddhism.)</p><br/><p>“Bukubukuchagama can manipulate karma values, and Yamaiko’s super-tier spell works on people with positive karma too! Come on, Momonga-san, help us out!”</p><br/><p>The attacker and attacker cum seeker were practically shouting in joy.</p><br/><p>Momonga had heard of the Bright King Combo. If pulled off successfully, it would push their DPS through the roof. It was a move that was worthy of being called an ultimate attack, but at the same time, it could only be used once a day, and the boss would enrage due to the depletion of its health. Therefore, if they got the timing wrong when paring down its health, the move would not succeed.</p><br/><p>“We’ll also need to see how much of its health we can burn off in a short time. You can handle that, right, Ulbert-san?”</p><br/><p>“Indeed. Since you let me conserve all my MP, I plan to spend it all on damage… but of course, I’ll follow Bukubukuchagama-san’s directions for hate management.”</p><br/><p>“Looking forward to it~”</p><br/><p>“All right, then next up…”</p><br/><p>Momonga continued explaining after seeing that everyone had calmed down.</p><br/><p>“…This is probably the most important thing, but we won’t be able to retreat from this fight.”</p><br/><p>A prickly sensation of nervousness flooded through him. They had one shot at this. They had to bet everything on that one shot.</p><br/><p>Boss battles typically took place in a separate map, and there were some boss battles which allowed players to retreat from the fight. Therefore, most players would do so if they felt things were getting dangerous. Of course, the enemy would recover all their lost HP, so it would be best not to use trump cards and the like before retreating.</p><br/><p>“Really, they don’t want newcomers to beat this dungeon in one go.”</p><br/><p>“Ah, there’s almost nobody who could beat this dungeon blind anyway.”</p><br/><p>“Then, Momonga-san, I have two questions. Did anyone lose their buffs when they went in?”</p><br/><p>“That didn’t seem to have happened.”</p><br/><p>“I see… then, will we have time to buff up inside?”</p><br/><p>“No chance. The boss appears immediately and attacks.”</p><br/><p>“So we’re fighting without knowledge or preparation? This is tough.”</p><br/><p>“—The battle is over before it begins.”</p><br/><p>“Ohhh! You sound just like him, Momonga-san!”</p><br/><p>It was accompanied by a giggle.</p><br/><p>“Just so. The deck is stacked pretty high against us. However, I feel our team can do it. Right, guys?”</p><br/><p>Bukubukuchagama’s statement was met with approval all around.</p><br/><p>In a grateful tone, Momonga announced:</p><br/><p>“Then, I’ll let everyone else know that our party will be the last ones in.”</p><br/><p>“Thank you. Then, another problem is that we know nothing about the enemy’s attacks… Though since we’ve encountered nothing but undead all the way here, the boss might end up being some other type of creature, right? No, those shitty devs would definitely do something like that.”</p><br/><p>“Since we don’t know enough about this fight, we can’t assemble the proper elemental enchants… so how about something that’s wide-spectrum but low-potency? No matter what, we can’t learn without taking a hit. Plus, we have to worry about hate resets…”</p><br/><p>“We could use food to buff our basic stats. Would you mind sparing me some for resistances?”</p><br/><p>“I’m not making undead to add to the damage rotations, but I’ll be using them as meatshields when the time comes. I won’t use them to attack.”</p><br/><p>Everyone loudly discussed their preparations for this battle, and when it was over, Momonga had received confirmation that the other two teams had started their respective battles.</p><br/><p>“Then — shall we?”</p><br/><p>Bukubukuchagama oozed forward, a shield in each hand.</p><br/><p>Various magic items floated into view within her pink body. When slimes were equipped with magic items — with the exception of hand-held items — they were not shown on their exterior, but within their bodies.</p><br/><p>Incidentally, in Yggdrasil one could equip magic items in the following slots: head, face, body, three pieces of jewellery apart from one’s rings, underclothing, arms, hands, left and right rings, waist, legs and feet. Even a suit of full plate armor only counted as taking up the body slot.</p><br/><p>“Then, we’re going for it. One-sixth of a raid boss.”</p><br/><p>“Don’t go into your rotations right away, watch the enemy’s attacks first. I’ll manage our hate, so please listen to my instructions. You guys don’t need me to tell you this, right?”</p><br/><p>Five ‘evil grin’ emoticons were their response to Bukubukuchagama’s provocation.</p><br/><p>They had played together for a long time now. All of them knew what they could and could not do.</p><br/><p>With Bukubukuchagama leading the way, the party entered the magic circle.</p><br/><p>They ended up in a room that resembled a colosseum. The walls were high and curved into a dome. Since there was a roof, there probably would not be any flying monsters dropping in on them.</p><br/><p>Next, they inspected the ground beneath their feet. It seemed to be regular dirt, with no sign of traps.</p><br/><p>Still, they could not be careless. Altering the terrain was a common tactic of raid bosses.</p><br/><p>They needed to have a response for anything the enemy tried to do. If they knew what the enemy was capable of from the start, they could take steps to foil the enemy action, or even turn it to their advantage.</p><br/><p>One could also use the super-tier spell ‘The Creation’ to directly alter the circumstances to their advantage, but all super-tier spells had an unavoidable cooldown time whenever they were cast. Therefore, the trump card of super-tier magic could only be used when it was absolutely vital.</p><br/><p>Momonga and friends turned their eyes in unison, to the massive being that stood in the center of the room like a wrathful Nio statue.</p><br/><p>(TL Note: the Nio are Japanese war gods who defend the Buddha. Like the Myo-O, they are fierce in appearance.)</p><br/><p>It was a boss which stood nearly five meters tall, with six arms, and it resembled an Asura. From the exquisite craftsmanship of its armor, they could guess that it boasted a strong defense.</p><br/><p>(TL Note: Asura are demigods in Buddhism)</p><br/><p>Four of its six arms held melee weapons — a sword, an axe, a spear and a club, each wreathed in an aura of fire, cold, electricity and acid respectively. Its remaining two hands held a bow. All this suggested that it was a physical attacker with multiple elemental attacks. Though it did not seem to be undead, it was still a boss monster, and those boasted a plethora of resistances. It certainly did not seem like the sort of creature which could be felled by an instant-death attack.</p><br/><p>There were very few monsters in Yggdrasil with attacks that were vastly different from what their appearances suggested. However, there were many enemies whose moves could not be predicted. Still, this boss seemed like a special case.</p><br/><p>Most monsters were generated by the same rules used for generating player characters. Even the magic they used was the same. The values derived from their basic stats — such as HP — were also of a similar nature.</p><br/><p>In Yggdrasil there were two major patterns of raid bosses.</p><br/><p>The main problem with designing boss encounters in Yggdrasil was that the players had the same skills and spells that monsters did, but during raid boss encounters, there would be 30 players facing a single monster. Even if with enhanced stats, one monster would still be obliterated by sheer weight of numbers, which meant that there was no challenge at all.</p><br/><p>As such, two main patterns of boss encounters appeared to address this issue.</p><br/><p>The first was to meet numbers with numbers. Sometimes the boss would come with minions, or the boss arena would constantly spawn monsters. In this approach, the boss was usually not very strong. In some cases it would only have several times the HP of a player character.</p><br/><p>The other method was to send out a single boss, generated with different data from the player characters. This sort of boss typically had abilities which would give a lot of trouble to parties which encountered them for the first time, and it could use those abilities continuously</p><br/><p>Judging by the look of the boss, it was highly likely that it fell into the latter category.</p><br/><p>“Oh foolish ones who challenged us last, know the might of those who become stronger with every layer of binding removed from us.”</p><br/><p>“…There wasn’t any foreshadowing about bindings before this. Here we come!”</p><br/><p>Bukubukuchagama leapt forth. She circled around the boss, moving in order not to let the boss’ first strike hit anyone but herself.</p><br/><p>The boss thrust its flaming sword, and a dark red circle formed around Bukubukuchagama’s feet, indicating that she was the target of its attack. From the way the circle moved with her, it would seem this was an undodgeable move.</p><br/><p>“[Solar Flare].”</p><br/><p>Those words floated in the air as it activated a unique boss skill, which did not exist as a spell which players could access. A burst of fire erupted, centered on Bukubukuchagama.</p><br/><p>Bosses with multiple unique skills were very hard to deal with. This was because there was no way of knowing what type of attack or magic would be effective. There was no time to feel the boss out by trial and error either, all they could do now was use all the tricks they had learned during their time as gamers.</p><br/><p>Judging by Bukubukuchagama’s HP bar, she had not been badly hurt. However, that was because being attacked was her objective. Having eschewed offensive power, Bukubukuchagama instead boasted immense resistance to all sorts of elemental attacks.</p><br/><p>Even so, if the boss focused its fire on her, she might end up being pounded to death. Of course, normal monsters could not do that, but it was certainly possible for bosses, who were designed as solo combat units. After all, they were special beings which were unlike a normal enemy. As such, even light wounds could not be overlooked.</p><br/><p>Thus, Yamaiko promptly cast her healing spell.</p><br/><p>The boss began pursuing Bukubukuchagama, while Momonga approached from the opposite side of the boss. It swung at Bukubukuchagama with its gigantic sword, but she deftly blocked it with her shields.</p><br/><p>A top-class player could not only deflect a boss’ attacks without harm, but even respond with a counterattack of their own. However, Bukubukuchagama could not do that. Within Ainz Ooal Gown, the only person who could was Touch Me. He was a super-tier player who could serve as a tank even though he was an attacker.</p><br/><p>The two frontliners advanced. Like a rubber band stretched to its limit, they snapped forth, reaching the boss in an instant.</p><br/><p>“[Shadowbind], [Hobble].”</p><br/><p>(TL note: い, し)</p><br/><p>“[Razor Edge], [Rasetsu].”</p><br/><p>(TL note: レイザエッジ, )</p><br/><p>As the textboxes popped up above their heads, several black blades flew through the air. Those were attacks which lowered evasion and movement speed, and now that the boss was presumably weakened, the physical attacker Warrior Takemikazuchi slashed wildly at the boss.</p><br/><p>Multiple slashes appeared on the boss’ body, and Momonga saw the boss’ HP bar waver, thanks to his ‘Life Essence’ spell. It had taken less damage than expected, and it was this, more than anything it said, which made them think that this was really a raid boss.</p><br/><p>“[Arm Slice], [Headshot].”</p><br/><p>(TL note: し, し)</p><br/><p>“[Rasetsu], [Slash-All].”</p><br/><p>(TL note: , )</p><br/><p>More words popped up above their heads, and their chained attacks mauled the boss’ body.</p><br/><p>They could still chat while fighting mooks, but against a boss they had no time to banter. However, their teamwork would break down if they did not indicate what they were doing, so they used macros to create those text boxes.</p><br/><p>(TL Note: macros are miniature programs that execute a series of actions linked to a single button press, they’re used in games to communicate information quickly)</p><br/><p>The acid-wreathed club swung at Nishiki Enrai. Thanks to the debuffs he had inflicted, the boss’ hate for him had gone up beyond Bukubukuchagama’s ability to manage.</p><br/><p>Although the blow should have struck home, no damage numbers appeared. He must have used some sort of ninja skill.</p><br/><p>“Watch your hate! Stop attacking!”</p><br/><p>“R!”</p><br/><p>“R!”</p><br/><p>(TL Note: R here is used as a shorthand for “roger”, or /ryokai in JP)</p><br/><p>Bukubukuchagama used the shield on her left hand to protect herself, while she attacked continuously with the one on the right.</p><br/><p>The text boxes above her read [Shield Attack], [Shield Stun] and [Mega Impact]. This was also known as the Hate Combo, which built hate towards her quickly.</p><br/><p>After that was [Knight’s Challenge]. Normally, hate increased along with damage done, but Bukubukuchagama did very little damage. As a result, she could not generate hate quickly, which was why she compensated with a skill that built hate twice as fast as normal.</p><br/><p>The boss once more targeted Bukubukuchagama, and began attacking.</p><br/><p>The two frontliners matched their movements and attacked, while Ulbert and Momonga cast their spells.</p><br/><p>“[Boosted Magic – Magic Arrow]!”</p><br/><p>“[Penetrate Magic – Slow]!”</p><br/><p>Ulbert’s first-tier spell, which had been temporarily boosted in tier, streaked toward the boss, leaving a white trail in its wake.</p><br/><p>Doing too much damage made hate management difficult, and it would be hard to control the flow of the battle. In order not to build too much hate, he decided to use a weak spell.</p><br/><p>As usual, Momonga was casting debuffs. Breaking through the enemy’s resistances was difficult, but if the debuffs managed to connect, it would greatly help his team.</p><br/><p>The battle was progressing smoothly. The vanguards suppressed the boss while the rear guards whittled it down. It felt like they were off to a good start, though they did not let it go to their heads. Just as Momonga was thinking that, a [Message] notification appeared in his line of sight.</p><br/><p>Don’t you know I’m fighting a boss, Momonga grumbled as he tapped the notification and took the [Message].</p><br/><p>“Sorry to bother you in the middle of combat, Momonga-san.”</p><br/><p>It was Punitto Moe’s voice.</p><br/><p>“Ah well, it happens. I’ll talk to you in a while—”</p><br/><p>“How much longer?!”</p><br/><p>How should I know? Although Momonga wanted to tell him not to disrupt his concentration, he could sense a growing anxiety in Punitto Moe’s voice.</p><br/><p>Momonga had already cast a 7th-tier spell, [Focus Magic], on Ulbert. While this buff would end after the next spell Ulbert cast, that spell would do over twice the normal amount of DPS. Plus, only Ulbert’s hate would go up, so Bukubuchagama would have an easier time managing hate.</p><br/><p>Because of this, Momonga had a little bit of breathing room. While he kept an eye on the boss’ movements, he replied to Punitto Moe.</p><br/><p>“It should be a fair bit, we haven’t even brought him down to 75% health.”</p><br/><p>Normal parties would take roughly 10 to 15 minutes to defeat a boss. Not even a quarter of that had passed so far.</p><br/><p>“Could you hurry it up a little? Three teams have already beaten their bosses and moved on to the sixth floor—”</p><br/><p>Momonga did not congratulate Punitto Moe because he had a bad feeling about what came next.</p><br/><p>“They ran into a constantly-respawning horde of monsters and are currently fighting. They might have to fight until everyone wins and reaches the 6th floor.”</p><br/><p>What the hell is this?!</p><br/><p>Momonga resisted the urge to exclaim out loud. This was a dire situation for the teleported parties. Being forced to fight even more monsters after expending their MP and limited-use skills against the bosses was an arduous task.</p><br/><p>The proper way to clear a dungeons like this was probably to learn which bosses would get stronger, and in which order. Then, the parties would simultaneously enter their boss fights and beat them at the same time.</p><br/><p>He cursed the shitty developers in his heart. Did they really hate first-time clears so much? No, it was because of traps like these that first-time clears were so difficult.</p><br/><p>“So, please hurry!”</p><br/><p>After terminating the [Message] to Punitto Moe, Momonga shouted, “Finish it quick!”</p><br/><p>“R!”</p><br/><p>They replied in unison, and nobody asked for the reason why.</p><br/><p>“Uwah, time to spend! Damn cash shop!”</p><br/><p>“3000 yen! No more than 3000 yen! Those shitty devs must have done this to force people to use the cash shop!”</p><br/><p>As Momonga heard Nishiki Enrai and Warrior Takemikazuchi shouting, he also heard Ulbert lament quietly, “I’ll have to use cash items too…”</p><br/><p>Momonga could empathize with him. Right now, it would probably be best to make a minimal investment in cash items. They were in a team, after all, and it would not do to hold everyone else back.</p><br/><p>Although he did not know what kind of cash item the frontliners had used, the boss’ health was dropping faster than before. Because of that, the boss used a new attack — it brought the freezing axe above its head.</p><br/><p>“[Neptune Lightstorm].”</p><br/><p>The freezing vapors flowing from the axe formed a sphere of bluish-white energy over the boss’ head.</p><br/><p>This must be some sort of super move. With that in mind, Momonga immediately ran over to Yamaiko’s side. Lasers sprayed in all directions from the blue-white orb. Although most of the beams seemed to fly at random, some of them seemed to follow a specific pattern. Of course, it was impossible to tell what that pattern was on the first encounter.</p><br/><p>Momonga was hit by a bolt of light, but he was unscathed. As expected, that attack was a cold-elemental one. Since he was immune to it, he was not affected by its negative status effects or debuffs either. However—</p><br/><p>“[Haste].”</p><br/><p>Momonga cast the spell on the frontliners.</p><br/><p>The three vanguards were under a Slow debuff, which should have been because they were struck by the lasers. That being the case, he could counter it with the appropriate, opposed magic. At this level, one could negate a lot of elemental attacks and debuffs with innate elements or resistances, but it was impossible to eliminate all flaws in a character. The problem then became where a player allowed themselves to be weak.</p><br/><p>In all likelihood, the frontliners left themselves vulnerable to Slow effects because they trusted in Momonga to help dispel them. Momonga in turn, promptly tended to them. This was the true meaning of teamwork.</p><br/><p>Just as they thought they were through it, the boss began another round of attacks.</p><br/><p>The shrinking interval between the usage of skills was a sign that the boss was picking up the pace.</p><br/><p>“[Venus Monsoon].”</p><br/><p>Heavy clouds appeared above the boss’ head, blanketing the battlefield. The boss raised its corrosive club. It would seem it was going to call down acid rain.</p><br/><p>“[Shark Cyclone].”</p><br/><p>A gigantic hurricane whirled into existence as Momonga cast his spell, but it did not disperse the gathering clouds overhead.</p><br/><p>“Shit!”</p><br/><p>Momonga muttered “Shitty developers” over and over again, until it became a sort of mantra.</p><br/><p>If the boss used a spell which players had access to, he would probably be able to counter it in some way. However, if it was a skill, all he could do was guess.</p><br/><p>This time, his guess was off.</p><br/><p>He should have used a defensive spell instead, but it was too late. This was not the sort of opponent that would give him the luxury of a second move.</p><br/><p>A torrential rainstorm filled everyone’s vision. It made them think of the acid rain in the real world. However, since this was a game, the rain vanished immediately. The puddles left behind on the ground did not inflict any DOTs (damage over time effects).</p><br/><p>This was a surprisingly mild attack. Since he had acid resistance, he had not taken much damage. Of course, his equipment durability had decreased, but that was not a big problem. This might have been the sort of attack which would have extra effects if the Slow debuff remained on them.</p><br/><p>Yamaiko ran over to him, and the moment he touched her, a text box with the words [Greater Lethal] appeared. This was a spell which caused damage with negative energy, but it had the opposite effect on Momonga.</p><br/><p>Momonga also had the ability to infuse negative energy by touch, but it could not heal the undead. Apparently it could heal undead by touch during the first week of the game, but it was immediately patched out. The ray of hope which shone down on undead magic casters was snuffed out, as though it had been nothing but a dream.</p><br/><p>“Thanks!”</p><br/><p>“You’re welcome.”</p><br/><p>Yamaiko cast healing spells on the front liners, whose health had been reduced almost by half. Bukubukuchagama was still very energetic, so her spells were focused on the other two.</p><br/><p>The boss raised its lightning lance.</p><br/><p>Because its health was going down very fast, the delay between each attack was now very short. There were good and bad things about this, but since Bukubukuchagama kept quiet, it implied that it was fine.</p><br/><p>Judging by the weapon the boss raised, it was most likely some sort of lightning-elemental attack. If that was the case—</p><br/><p>“Yamaiko-san! Ulbert-san! Heading up!”</p><br/><p>There was no time to wait for their responses. Momonga cast a [Greater Teleportation] spell. His destination was the sky. Just as the view in his eyes shifted from the teleport—</p><br/><p>“[Jupiter Tempest].”</p><br/><p>—Streaks of blinding white lightning raced across the ground. A simple [Fly] spell would not have allowed them to make it up here in time.</p><br/><p>Normally speaking, flying up was a bad move. However, Momonga had ascended because the boss’ previous attack descended from above. He guessed that there would not be two consecutive attacks which came down from the sky.</p><br/><p>He was lucky.</p><br/><p>“Going down.”</p><br/><p>“Okay!”</p><br/><p>They were of one mind. After all, there was a chance that the next attack would heavily damage anyone in the air. Of course, he was quite nervous about his descent, but his body was supported by the [Fly] spell as he returned to the ground. Once there, he did not forget to cancel the spell. The truth was, using [Fly] in combat was quite difficult, only a few people were capable of it.</p><br/><p>Still, if one planned out a simple course and let the spell’s autopilot handle things, one could fight in the air. Landing, in particular, was an easy task.</p><br/><p>When the boss swung its weapon, the shockwave it produced ripped through the area surrounding it. However, only Bukubukuchagama was hurt. Judging by their text boxes, the two attackers had used some sort of technique to withstand the damage and continue their attack.</p><br/><p>As Momonga, Ulbert and Yamaiko descended, the boss raised all four of its weapons, and used some sort of skill.</p><br/><p>“[Great Ore of Mercury].”</p><br/><p>It would seem the boss had buffed itself.</p><br/><p>“So hard!”</p><br/><p>That voice belonged to Warrior Takemikazuchi. His damage output had dropped to 1/10th of normal.</p><br/><p>“Meteoric Turtle!” Bukubukuchagama shouted, naming a boss they had defeated in the past. Momonga immediately understood the meaning behind those words. The Meteoric Turtle had a move where it enhanced its defense, then took to the sky before crashing down again like the meteor it was named after, dealing a party-wiping amount of damage to everyone in the area.</p><br/><p>The countermeasures to this move were: unbalance the boss and forcibly break its defensive stance, take to the skies and halve the damage taken, or to continuously use defensive spells or skills to endure the onslaught.</p><br/><p>Warrior Takemikazuchi and Nishiki Enrai began using their unbalancing skills, Momonga and the others coordinated with them and cast debilitating spells on the boss as well.</p><br/><p>A prickly sensation hung in the air — about 15 seconds later, the boss swung its weapons, as though remembering that it had forgotten to attack while its defense rose. The sense of relief that came from disrupting the boss was replaced by the pressure of knowing that the boss was going to make its move.</p><br/><p>“[Lunar Sword].”</p><br/><p>The air pressure from the strikes turned into slashing shockwaves which tore through the air. It made no difference whether one was in the sky or on the ground, there was no hiding from it.</p><br/><p>“[Wall of Jericho].”</p><br/><p>Bukubukuchagama used her area-defense skill to become a wall behind which everyone could hide. Even so, she had still been heavily hit. It was unclear whether unbalancing the enemy meant that they had taken less damage, or if the damage taken was evenly distributed throughout the group, or if they had taken damage at all because they failed to evade the attack.</p><br/><p>As he was being healed, Momonga went to his console and looked over his spells, at the same time considering how to proceed given the attack they had just taken. Now that the boss had lost quite a bit of HP, its attack patterns were becoming more aggressive. There was a chance it might use that attack repeatedly.</p><br/><p>In the meantime, the boss’ HP was decreasing steadily. Although the boss had abnormally high HP, the attackers’ firepower was more than up to the task.</p><br/><p>Suddenly, the boss pointed its bow to the sky and drew it back. There was no way of telling how it would attack since it had not used its bow and arrow before now. They hindered it as much as possible, and let the backliners take care of the boss’ target.</p><br/><p>Should I have checked the bow’s element? Momonga thought as he clicked his tongue.</p><br/><p>“[Saturn Meteor].”</p><br/><p>The boss fired toward the sky. The arrow flew to the ceiling, and an inky black void appeared — the void of space — which swallowed it without a trace.</p><br/><p>The sudden void expanded to cover the entire battlefield. It would seem that the range of this attack was as large as the previous one.</p><br/><p>Momonga immediately selected [Wall of Skeleton] from the control console, deploying it above himself like an umbrella.</p><br/><p>“Momonga-san, let me in!”</p><br/><p>Ulbert, the offensive specialist, had to conserve every scrap of MP he had. Thus, he ran over. Yamaiko was in a similar situation as well.</p><br/><p>“[Field of Force].”</p><br/><p>“[Sanctuary Protection].”</p><br/><p>As Yamaiko put up another layer of protection, Momonga cast yet another defensive spell. This was because they had no idea what kind of attack was coming next.</p><br/><p>Just then, a shrill screech rang through the air, and countless meteors flew through the air at them.</p><br/><p>The initial impact shattered the [Wall of Skeleton] which had been further reinforced by the [Sanctuary Protection]. After that, the shockwave broke the [Field of Force] and damaged Momonga, far more than the previous [Lunar Sword] had. Half of his previously full HP bar vanished in an instant.</p><br/><p>However, that was the end of the attack, and Momonga was still alive. Nobody had died, and Bukubukuchagama still had more than half her HP left.</p><br/><p>If the tank was fine, they could still fight.</p><br/><p>Yamaiko used a powerful skill to heal everyone quickly. However, this did not include Momonga, since normal curative methods did not work on him.</p><br/><p>In addition, Yamaiko’s big skill spread its healing among its targets, so there was no benefit for including Momonga.</p><br/><p>If Momonga took another attack from the boss, he would die. Therefore, Momonga watched the boss’ movements as he made a Death Knight and had it await orders. If the boss attacked the weakened Momonga, he would use the Death Knight as a shield.</p><br/><p>“I’ll heal you, Momonga-san!”</p><br/><p>After healing everyone else, Yamaiko announced her next move to the vanguards and then cast [Greater Lethal] on Momonga. While Momonga was healing up, the frontliners stopped attacking and took defensive stances, healing their wounds with potions. This was so that they did not complicate the hate management.</p><br/><p>All the weapons the boss was holding rose into the air, orbiting around it.</p><br/><p>Given these special effects, there was no doubt that it was preparing for something big.</p><br/><p>“To think you have made it this far! It appears I have underestimated you! In that case! Come forth, my minions!”</p><br/><p>The floating weapons arranged themselves into the points of a five-pointed star, and then thrust themselves into the ground. Five monsters appeared from those places.</p><br/><p>Level 87: Primal Fire Elemental</p><br/><p>Level 87: Primal Water Elemental</p><br/><p>Level 87: Primal Air Elemental</p><br/><p>Level 87: Primal Earth Elemental</p><br/><p>Level 90: Primal Star Elemental</p><br/><p>Each of them was the same size of the boss, and they were monsters of equivalent level to Momonga and the others.</p><br/><p>The six of them, including the boss, would surely crush the party into a paste.</p><br/><p>Momonga laughed.</p><br/><p>He had not expected the boss to be this powerful.</p><br/><p>We might have gotten the sequence wrong. The boss in this arena is the kind which won’t relent right until the end.</p><br/><p>“Or are you saying the other bosses are this strong? If that’s the case… then we made the right decision.”</p><br/><p>As though answering Momonga’s muttering, a man’s voice gave a great cry:</p><br/><p>“Roar, my secret arcana! Descend, o ultimate disaster! Flow, ye tears of despair and regret! — [Grand Catastrophe]!”</p><br/><p>This speech, which was completely unlike his usual style — incidentally, the preamble before the spell name was different each time — was the naked expression of his soul.</p><br/><p>When Ulbert Alain Odle mastered the class of World Disaster, he gained this power, which outstripped the might of even super-tier spells. It was an ultimate move which required 60% of his MP.</p><br/><p>The fallen leaves of the world tree had a malice of their own, and now that curse was given a physical form. Pure destructive energy surged through the battlefield.</p><br/><p>The five elementals, which should have been at full health, were instantly annihilated. The boss itself lost an alarming amount of HP.</p><br/><p>At the same time, Ulbert ran toward the boss.</p><br/><p>Thanks to the hate generated by [Grand Catastrophe], the boss would not stop attacking until it hit Ulbert at least once.</p><br/><p>As though to switch with him, Bukubukuchagama ran to the back.</p><br/><p>In the moment where Ulbert was hit by the boss, Bukubukuchagama — who had run to the back — immediately exchanged places with him.</p><br/><p>A text box reading [Transposition] popped up from Bukubukuchagama, and then vanished.</p><br/><p>The boss’ weapons returned to its hands.</p><br/><p>It might be that the boss would lose access to a weapon as long as its corresponding elemental was on the field. In that case, it might have been better to leave the appropriate elementals alive — possibly two of them, one left-hand and one right-hand weapon — but of course they could not know that on a first encounter.</p><br/><p>“‘[Solar Flare].”</p><br/><p>The boss opened up on Bukubukuchagama with the move it had first used.</p><br/><p>“Everyone! Kill it quickly! It’s starting its rotation again!” Bukubukuchagama shouted.</p><br/><p>Now that Ulbert had used his trump card, they had no way to beat the elementals quickly if the enemy summoned them again. In other words, they would be defeated. Therefore, they had to bring it down before that.</p><br/><p>There was no reason to hold back now.</p><br/><p>“[Triplet Maximize Magic — Reality Slash]!”</p><br/><p>Momonga could feel the boss turning on him now that his hate had gone up. Or rather, it was only to be expected after hitting it with three maximized 10th-tier attack spells at the same time.</p><br/><p>The boss closed in swiftly, but it was exactly as Bukubukuchagama had predicted. It was natural to expect the enemy to attack someone who attacked it.</p><br/><p>The proof of this was that Bukubukuchagama did not rush over to him, but reapplied an expired buff instead. This was because she firmly believed that Momonga could deal with it, and could respond as a player should.</p><br/><p>“Death Knight!”</p><br/><p>He sent a command to the Death Knight with a macro. The Death Knight roared, and took on the hate that should have been borne by Momonga.</p><br/><p>At the same time, in accordance with the orders given, the Death Knight ran to Bukubukuchagama.</p><br/><p>The boss paused, and turned on the incoming Death Knight.</p><br/><p>Its attack swung down on the Death Knight.</p><br/><p>It went without saying that given the gigantic level difference, the Death Knight should have been destroyed.</p><br/><p>That was what should have happened if a level 90 being attacked a level 35 opponent, unless the attacker held back a lot. However, the Death Knight’s skill activated. It took the hit and survived with 1 HP remaining, and continued running toward the frontliners. Or rather, it tried to run — the boss’ next blow obliterated the Death Knight.</p><br/><p>However, it had fulfilled its purpose.</p><br/><p>“You’re the best, Death Knight-kun! Now look at me, you son of a bitch!”</p><br/><p>Bukubukuchagama raised her gelid arms, probably trying to get the boss to target her. The boss, which had been planning to charge the others, changed its target to her.</p><br/><p>All these were the movements of the switch attack, which Momonga was skilled at executing.</p><br/><p>“Push it!”</p><br/><p>“R!”</p><br/><p>“R!”</p><br/><p>The boss raised its freezing axe, and used the [Neptune Lightstorm], which Momonga had already experienced before. As he shielded the other backliners with his body, he dispelled the debuffs on the frontliners.</p><br/><p>This was when the boss began attacking in earnest.</p><br/><p>Until now the boss had followed up all its skills up with simple auto-attacks. However, at this stage, it was using its skills back to back.</p><br/><p>Was it because it was low on HP?</p><br/><p>The implication here was that it would summon the Primal Elementals after using each skill once. In other words, they were running out of time.</p><br/><p>Can we deplete its HP fast enough?</p><br/><p>Despite his growing anxiety, Momonga operated his console with speed and precision. This was what they meant when they said “the frontline was a sports meet, while the backline was a theatre performance.”</p><br/><p>A single mistake would disrupt his rhythm.</p><br/><p>Momonga groaned as he thought of the boss’ attacks and watched its movements. They might not be able to beat it in time.</p><br/><p>However—</p><br/><p>“—How about it? Can we kill it in one shot?”</p><br/><p>“I’m in range! We can do it! Everyone, we’re going for the Bright King Combo!”</p><br/><p>“Ohhh! I’ll leave it to you.”</p><br/><p>“Roger! Then let me begin! [Sacrifice]!”</p><br/><p>The boss hit Bukubukuchagama, who had both her arms spread wide. Bukubukuchagama took a huge amount of damage, even through her extremely high defense. At the same time, a black mist enveloped the boss.</p><br/><p>After that, Bukubukuchagama activated the [Aegis] skill. HP restoration should have been Yamaiko’s job, but they no longer had the time for that. All she could do was minimize her damage taken and try to push through this with her current HP.</p><br/><p>Momonga cast a spell, targeting it on Nishiki Enrai.</p><br/><p>“[Conflict Karma]!”</p><br/><p>Yamaiko watched as Momonga cast his buff, then crushed the hourglass-like cash item in her hand, instantly activating her super-tier spell.</p><br/><p>“[Judgement of Osiris]!”</p><br/><p>(TL Note: the kanji reads オシリスの き/Judgement of Osiris, the furigana is ペルト エム ヘルウ/Prt M Hrw, part of the name of the Egyptian Book of the Dead.)</p><br/><p>Scales appeared over the heads of everyone on the battlefield.</p><br/><p>On one side was a heart, and on the other was a feather.</p><br/><p>Yamaiko, Nishiki Enrai and Warrior Takemikazuchi’s scales pended down on the feather’s side. In contrast, Momonga, Ulbert, Bukubukuchagama, and the boss’ scales weighed down on the heart’s side. In that moment, the heart was promptly devoured by a beast that appeared out of nowhere.</p><br/><p>Momonga was not hurt.</p><br/><p>However, his karma value plummeted, reaching -1000 in an instant.</p><br/><p>This super-tier spell could manipulate karma values — it reduced negative values, and increased positive ones.</p><br/><p>Karma values affected the damage inflicted by certain spells and skills. The reason Yamaiko cast this spell went without saying — it was to intensify the effects of the combo which relied on karmic imbalance.</p><br/><p>Warrior Takemikazuchi was all smiles as he began the Combo.</p><br/><p>“Here I go! [Acalanatha]! [Fudo Kensaku]!”</p><br/><p>The form of The Immovable One, Fudo Myo-o, appeared behind Warrior Takemikazuchi, casting forth a lariat from his hand.</p><br/><p>The first blow of the Bright King Combo, [Acalanatha], had two attack components. The first, the [Kurikara Sword], did more damage the lower its opponent’s karma score was. Without the appropriate countermeasures, it would be fatal. The second was the [Fudo Kensaku], which reduced the evasive abilities of opponents with low karma values. This decrease was directly proportional to the amount of negative karma its target had.</p><br/><p>Perhaps the boss’ karma was never that high to begin with, but Bukubukuchagama’s skill made sure of that.</p><br/><p>Bukubukuchagama’s [Sacrifice] greatly decreased defensive power, but in exchange the damaged party’s karma dropped to the absolute minimum. And then, Yamaiko’s super-tier spell lowered it even further.</p><br/><p>“[Trailokyavijayarāja]!”</p><br/><p>The Conqueror of Three Planes, Gozanze Myo-o appeared behind him as well and ran the boss through with his lance.</p><br/><p>“[Yamāntaka]!”</p><br/><p>After that, The Defeater of Death, Daiitoku Myo-o materialized, smiting the boss with his massive club.</p><br/><p>“[Kundali]!”</p><br/><p>The Dispenser of Heavenly Nectar, Gundari Myo-O released a serpent from his hand, which suddenly expanded and coiled around the boss, further locking it in place. If this was not done, the boss might be able to escape its bindings in the delay between strikes.</p><br/><p>“[Vajrayaksa]!”</p><br/><p>The Devourer of Demons, Kongo-Yasha Myo-O, mauled the boss with his electrically-charged vajra-sword.</p><br/><p>And then, while the boss could not evade, the five Wisdom Kings charged it. They surrounded him and as one, they took stances which pointed their palms at him.</p><br/><p>Their foe would not be able to move if it had so much as one point of negative karma.</p><br/><p>“Ossha!”</p><br/><p>Nishiki Enrai switched out his weapon in that moment.</p><br/><p>This was his trump card, Susanoo. It was a weapon that was over three meters long, and due to various penalties, it swung very slowly. However, that hardly mattered when his opponent could not move. Perhaps it was a loophole in the system, or a deliberate decision by the developers, but the attack power of this gigantic ninjato far surpassed that of even a special being like this boss.</p><br/><p>The instant that slow-moving blade touched the boss, a frightening series of damage numbers that looked like they came from a multi-part attack spewed forth.</p><br/><p>Momonga could not help but laugh as the boss’ HP went down in his eyes.</p><br/><p>And then—</p><br/><p>—Cracks appeared all over the boss’ body.</p><br/><p>Light flowed out from between the gaps, followed by a great explosion.</p><br/><p>Momonga was stunned for a moment, and then the overflowing joy in his heart made him cry out.</p><br/><p>This might be a game, but jubilation from overcoming a great difficulty was universal. Nor was he the only one rejoicing. The other members of the party, who had beaten this dungeon alongside him, were cheering as well.</p><br/><p>An orb floated in the place where the boss used to be. It did not look like a data crystal, nor did it resemble an artifact. They had to take it and get the group to the 6th floor. Momonga wanted to grab it, but was it really all right for him to do so, given that he had not contributed that much?</p><br/><p>“Momonga-san, the boss dropped an item.”</p><br/><p>“In that case, the two attackers should—”</p><br/><p>“Momonga-san, it’s not like that,” Bukubukuchagama said.</p><br/><p>“Things ended up like this because everyone did what they had to do. The attackers are supposed to damage the boss. The tank should control hate and bears the boss’ attacks. The healer has to heal the group’s wounds. And of course, the wildcard uses buffs and debuffs, guiding the flow of the battle.”</p><br/><p>She panted, and took a breath.</p><br/><p>“Therefore, everyone played their part!”</p><br/><p>Something along the lines of “What she said” came from Yamaiko’s direction.</p><br/><p>“Momonga-san, you protected us in many ways, didn’t you? It’s not just the front liners who shone in this fight, don’t you two agree?”</p><br/><p>“You’re right, Yamaiko-san. However, I feel a little embarrassed to have someone say I was shining. We’re just the ones who entrust our backs to the rear guard and focus on attacking.”</p><br/><p>“Yup, yup. Come on, go take it, Momonga-san. Didn’t you say we had to hurry?”</p><br/><p>Nishiki Enrai urged Momonga on after Warrior Takemikazuchi spoke.</p><br/><p>There were no facial expressions in Yggdrasil. However, Suzuki Satoru knew that his friends were smiling happily.</p><br/><p>“—Thank you, everyone! Then, don’t mind if I do!”</p><br/><p>With that, Momonga reached out for the floating sphere — and touched it.</p><br/><p>In that instant, the world blacked out.</p><br/><p>By the time he could see again, he was in a wide-open space, completely different from before. These were ruins, perhaps. They seemed to be in a slightly-elevated place, at the top of a flight of stone steps. The ruins were located within a sprawling expanse of wilderness, but there seemed to be something glowing in the sky which cast enough light that they could not see beyond 200 to 300 meters away.</p><br/><p>The sound of cheering came from below them.</p><br/><p>Looking down, he saw his guildmates. They were holding weapons, and it would seem they had been fighting until just now.</p><br/><p>“The auto-spawning enemies vanished, so I was pretty sure that you and the others defeated your boss, Momonga-san.”</p><br/><p>“Yoshaaaa! Damn we’re good, beating an unknown dungeon in one try! How about that, you shitty devs?!”</p><br/><p>“Oi oi oi, if you want to take a toilet break, you’d better go now! Don’t miss out on what happens next!”</p><br/><p>When he heard their shouts, Momonga suddenly understood what they had done, and he laughed. In truth, he had been laughing since just now, but he could not help himself now.</p><br/><p>Momonga and the others descended the stairs, bathed in everyone’s praise. These were their accolades for beating the strongest boss.</p><br/><p>“Then, Momonga-san. Put that in there.”</p><br/><p>Momonga looked in the direction Touch Me was pointing, and saw a stone plaque. There were four orbs like the one Momonga was holding, and one empty slot. There were no clear directions, but he knew exactly what he had to do.</p><br/><p>He headed straight for the plaque, and slotted his orb into the final depression. The orb fit into the indentation as though it had been sucked in, and then all the orbs glowed gently.</p><br/><p>Momonga gulped.</p><br/><p>A scroll descended from the sky, landing beside Momonga. In its place, the plaque vanished, replaced by a throne made from a single gigantic crystal.</p><br/><p>There was no doubt that the scroll was the ownership deed, which meant that the throne was some sort of artifact. Usually, the dungeon reward was one or the other, but this seemed like an exceptional case. An artifact of this class ought to be pretty useful. If not, they could probably still sell it for a pretty penny.</p><br/><p>However, certain artifacts were weird, and he prayed that this was not the case.</p><br/><p>“Huh.”</p><br/><p>Momonga, who was very worried about the throne, looked up to the sky. The glowing scroll was falling at an almost insufferably slow speed.</p><br/><p>Although this sort of forced dramatics usually annoyed him, he had to be grateful for them this time.</p><br/><p>Momonga extended his hand, and grasped the scroll from mid-air.</p><br/><p>He had been thinking that he would look terribly lame if he fumbled it at a moment like this, so he had to keep the relief he felt when he took it into his hand a secret from everyone.</p><br/><p>“Congratulations! For conquering the Great Tomb of Nazarick, you have earned the ownership rights to the Guild Homebase: Great Tomb of Nazarick.”</p><br/><p>As though urged on by that calm male voice, Momonga opened the scroll, allowing everyone to see the contents of the title deed.</p><br/><p>There was a cry of surprise as they looked through the data on the guild territories and income.</p><br/><p>“This…! We can make up to 2750 levels of NPCs!”</p><br/><p>“Ehhhhh? Really? It’s true!”</p><br/><p>“Why is it so high?”</p><br/><p>Everyone anxiously went over the contents again, Momonga included. He accessed his console and went over the number of NPC levels. When he realised what was going on, his eyes went wide.</p><br/><p>There were only nine places in the game which offered more NPC levels, at 3000. Was this homebase location a place on par with those? It had not been discovered until now, so was this the result of something like points accumulating?</p><br/><p>Was there any reason for this? If so, it would be very helpful. They read through the guild homebase details again, and the person who had first discovered it exclaimed again.</p><br/><p>“The base amount is 2250, with a bonus of 500… has anyone heard of anything like this before?”</p><br/><p>Everyone shook their heads. Then, someone had an idea.</p><br/><p>“Could it be that if you successfully beat a guild homebase location in one shot, your maximum NPC levels increase?”</p><br/><p>Silence fell across the group in an instant, and then someone shouted angrily:</p><br/><p>“Uooooohhh! You shitty developers! As though anyone could do that!”</p><br/><p>“Damn shitty devs!”</p><br/><p>“Is that what you mean by seeking knowledge with no fear of death, you bastards?!”</p><br/><p>Momonga joined in as well. This was to cover up the joy overflowing in his heart. The truth was, the people who had vented their emotions were now laughing.</p><br/><p>In fact, everyone was laughing.</p><br/><p>They slapped each other on the back, patted their shoulders and their heads, all to celebrate the achievement which they and their friends had won. From the corner of his eye, Momonga even noticed Ulbert and Touch Me patting each other on the back as well.</p><br/><p>“—Then, is this an artifact?”</p><br/><p>Punitto Moe stared at the throne.</p><br/><p>“How nice of them to provide a throne for us. Then, please take your rightful place, Guildmaster Momonga-sama. After that, let’s take a commemorative picture with him in the middle!”</p><br/><p>“Sounds good! Sounds great! Come, come! Guildmaster, come have a seat!”</p><br/><p>Nishiki Enrai and Warrior Takemikazuchi’s words were met with general approval.</p><br/><p>He could no longer put this off. Momonga did as he was told and sat on the throne. In that moment, a voice which only Momonga could hear spoke to him:</p><br/><p>“Congratulations! For completing a dungeon of recommended level 80+ in one attempt, you have received the World-Class Item, The Throne of Kings!”</p><br/><p>As the notification slowly sank into his mind, Momonga felt his heart clench tightly and shrink.</p><br/><p>It was a shock that took his breath away.</p><br/><p>One of the greatest treasures in Yggdrasil now rested beneath him.</p><br/><p>Suspecting that he might have misheard things, he touched his console with trembling hands. As he looked at his status display, Momonga realised that the voice he heard was not some blissful hallucination that was the product of his own mind.</p><br/><p>He saw a buff on his status screen. It was the same as that time when they had once obtained a World-Class Item, but then lost it.</p><br/><p>That was — WORLD. It implied an entire world, and the ultimate protection it bestowed.</p><br/><p>“What’s wrong, Momonga-san?”</p><br/><p>Even in a world without facial expressions, anyone would find it strange if someone suddenly froze and did not move.</p><br/><p>“Is it a nanomachine depletion message?”</p><br/><p>“No… This… this is a World-Class Item.”</p><br/><p>Silence fell across the guild members, who were lined up for the photo shoot. They could not understand what Momonga was saying.</p><br/><p>“Hey, it’s true. Seems to be a reward for clearing the dungeon on the first try.”</p><br/><p>It was a calm voice that startled the listener himself. Nor could Momonga properly express himself due to the magnitude of the shock he had just received.</p><br/><p>A great commotion erupted from his friends. At first, it was only the phrase “World-Class Item” that fell from their lips — and then it was thunderous cheering.</p><br/><p>Just like before, great shouts of “shitty devs!” rang out.</p><br/><p>“I knew it from the start. Clearing this dungeon in one shot would give us a World-Class Item.”</p><br/><p>“As if you really knew that.”</p><br/><p>“Awesome! How about that?! You Seraph bastards!”</p><br/><p>“Yahoo~”</p><br/><p>As everyone began dancing strangely, Momonga decided to rise from the throne and vacate it, so anyone could sit down. He moved to a quieter, more distant place.</p><br/><p>Soon, Touch Me and Ulbert came to stand before Momonga.</p><br/><p>“Well, that was amazing, Momonga-san!”</p><br/><p>“That’s right! A guildmaster who gets us a World-Class Item in our first guild event — that’s crazy, right? Seriously!”</p><br/><p>As he mused about whether “crazy” should be used as a form of praise, Momonga nodded to Ulbert and Touch Me.</p><br/><p>“What are you saying, all this was because everyone gave freely of their resources to help us clear this dungeon.”</p><br/><p>“There’s no need to be so humble. Takemikazuchi-san was right. I couldn’t have done something so wild. I would’ve been afraid of our first guild activity failing and suggested a safer and more sensible monster hunt instead. This is something only you could do, Momonga-san.”</p><br/><p>“No—”</p><br/><p>Momonga wanted to say that it was a miracle that happened because everyone tried their hardest. Saying that it was all thanks to himself made him feel guilty.</p><br/><p>His friends touched the throne all over, arguing over who should be next in line to sit on it.</p><br/><p>It was because of them.</p><br/><p>“Nonono, Momonga-san. There’s no need for that. If the venture failed, you were willing to bear everyone’s disappointment and unhappiness, weren’t you, Momonga-san? If that’s the case, then you should accept the praise that comes from succeeding. Otherwise it would be strange, no?”</p><br/><p>It was hard for him to accept those words, even if Ulbert said them.</p><br/><p>“Aw, don’t be like that. I regretted this thing so many times. I’ve been psyching myself up to be a guildmaster who handled communication, coordination, and other odd jobs.”</p><br/><p>He spilled his guts in a thoroughly exhausted voice.</p><br/><p>The two of them seemed to find it amusing, but their laughs were not those of scorn.</p><br/><p>“Got it. For all we know, this reluctance of yours might make you a good guildmaster. Though I think it would be good if you were more of a take-charge kind of person—”</p><br/><p>“What are you saying? Isn’t that one of Momonga-san’s virtues? I mean, aren’t we all following him because he’s like that?”</p><br/><p>“That’s right… yes, indeed, it’s just as you say,” Touch Me said in a self-reflective voice.</p><br/><p>Was he thinking about him, the one who left the game?</p><br/><p>“Oi, oi, what are you babbling about over there? Come quick! We’re taking the photo now!”</p><br/><p>“Come, come! Guildmaster! Have a seat on the throne!”</p><br/><p>Nishiki Enrai and Warrior Takemikazuchi practically pushed him onto the throne. His other friends were already lined up and waiting for him.</p><br/><p>“All right! We’re taking the photo!”</p><br/><p>Everyone struck a pose of some sort. They used their bodily motions to compensate for the lack of facial expressions in the game. Momonga touched his console, and selected a smiling face from one of the emoticons.</p><br/><p>“Here we go! Three, two one!”</p><br/><p>The floating orb-like camera before them was a cash item, which made the sound of a shutter clicking. At the same time, a ding-dong rang in Momonga’s ear.</p><br/><p>He knew without looking that this was the chime of a received message — a picture of Ainz Ooal Gown and the prize they had won in their maiden venture.</p><br/><p>Momonga smiled.</p><br/><p>He let his thoughts wander to what he and Ainz Ooal Gown would do now, and in the future—</p><br/><p>END</p><br/>\n</div>"}