{"title": "Chapter 87 - Volume 11", "id": 87, "volume": 11, "url": "http://boxnovel.org/overlord-ln-chapter-87-volume-11", "volume_title": "Volume 11", "body": "<h1>Chapter 87 - Volume 11</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>v11 Afterword and Character Sheets</p><br/><p>Afterword</p><br/><p>This is Volume 11, the longest one of all. Did it excite you? Books get tiring to carry when they’re heavy and I’d like to avoid that, so why did it end up so long… And if I were to cut pages, where should I cut from? By the way, this has already been heavily cut down from the original proofreading. It feels like there were at least six more pages before… Hm. I guess there wasn’t much of a change, after all.</p><br/><p>Well, please forgive me and just think of this as a form of savings, then. I think in the future, the volumes will only be 300 pages long. When that happens, please don’t think “so thin!”, but instead consider that the use of what’s been saved until now. After all, it’ll still be quite thick if you average all the books out.</p><br/><p>Then, let’s think about other things — I’m writing this on a hot summer day. The AC in my room is working at full blast and saving Maruyama from the scorching fires of hell.</p><br/><p>I hate summer. When I walk to the office, there’s nothing I hate more than touching other people with my sweaty body. “I won’t touch you, so don’t touch me,” I scream internally. The only salvation is that the decrease in students means the trains aren’t so packed. On that note, winters are great! I want to sleep under the blanket and never get out! …Well, the people in Hokkaido and Tohoku might not think that way, but Maruyama still wants to say; Winters Are The Best!</p><br/><p>It seems the Overlord Compilation Movie will be made in the Best Season! For some reason, it seems Maruyama has to work hard… I’ll work hard. And that’s that. There should be more news coming out in future, and I’d be happy if you could look forward to it.</p><br/><p>I’ve given a lot of people this time round too. So-bin-sama, I made you redraw the insert images several times, thank you very much. To my editor Ohaku-sama, I’ll reduce the pagecount for sure next time! And thank you for doing the design for the deluxe edition package this time round, Chord Design Studio-sama.</p><br/><p>Then there’s Ashina-san and the staff; just hand the gags to them and it’ll be alright.</p><br/><p>(Please watch the deluxe edition if you bought it, everyone)</p><br/><p>F-ta-sama, let’s meet up to discuss how to cut down the page count.</p><br/><p>And a big thank you to my readers who have finished this (very thick) light novel!</p><br/><p>2016 SeptemberMaruyama Kugane</p><br/><p> くがね</p><br/>\n</div>"}