{"title": "Chapter 88 - Volume 12", "id": 88, "volume": 12, "url": "http://boxnovel.org/overlord-ln-chapter-88-volume-12", "volume_title": "Volume 12", "body": "<h1>Chapter 88 - Volume 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Volume 12 Chapter 1</h3><br/><p><b>The Demon Emperor Jaldabaoth</b></p><br/><p><strong></strong></p><br/><p><strong></strong></p><br/><p></p><br/><p><b>Part 1</b></p><br/><p><span>The Roble Holy Kingdom was a nation whose territory was the peninsula to the southwest of the Re-Estize Kingdom.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>It was led by a Holy Queen who could use divine magic, and the leadership was closely tied to the temple factions. It was a very religious country, though not to the extent of the Slaine Theocracy. </span></p><br/><p><span>In addition, there were two special features about the Roble Holy Kingdom’s geography.</span></p><br/><p><span>The first was that its land was divided into northern and southern halves by the sea. Of course, the halves were not completely separated. Rather, there was a gigantic bay between them — forty kilometers long and two hundred kilometers wide — which made its geography look like a horizontal U.</span></p><br/><p><span>Thus, some people called them the Northern and Southern Holy Kingdoms. </span></p><br/><p><span>Then, there was another feature.</span></p><br/><p><span>The entrance to the peninsula sported a great wall, over one hundred kilometers long from north to south.</span></p><br/><p><span>It was built to withstand invasions from the many demihuman tribes which occupied the hills to the east of the Holy Kingdom, between them and the Theocracy.</span></p><br/><p><span>This grand wall, built through the expenditure of a great deal of time and resources, was a silent testimony to how troubling the existence of the demihumans were to the Holy Kingdom.</span></p><br/><p><span>There was a vast power gap between demihumans and humans.</span></p><br/><p><span>Granted, it was true that there were certain demihumans who were weaker than humans, such as Goblins.</span></p><br/><p><span>Be it in height, physical strength, knowledge, or the rate at which they produced magic casters, they were a race inferior to humans in every way.</span></p><br/><p><span>Still, even Goblins like that possessed eyes which could see in the dark, and if they took advantage of the fact that their small bodies could be easily concealed — for instance, when launching a nighttime ambush in a forest — they would surely be troublesome foes for humans.</span></p><br/><p><span>Needless to say, most demihumans had more powerful bodies than humans, and there were also many races who were naturally endowed with magical ability. If they let the demihumans invade as they pleased, they would have to pay an incalculable price in blood to fight them off.</span></p><br/><p><span>Therefore, the Holy Kingdom chose to solidify its defense.</span></p><br/><p><span>They did this to keep the demihumans from taking a single step onto their land.</span></p><br/><p><span>They did this to let the world know that their land did not belong to the demihumans.</span></p><br/><p><span>They did this so the demihumans would understand that any attempt to set foot on their land would be met by frenzied resistance.</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>Yet, the wall built for that purpose possessed a few problems.</span></p><br/><p><span>In order to keep it operating at full capacity, they had to keep a great deal of manpower permanently on site. The Holy Kingdom’s leadership had once calculated how much fighting strength would be required to defeat an invading tribe of demihumans. The answer was that the country would collapse before the demihumans even attacked them.</span></p><br/><p><span>While they did not have the luxury of raising troops which would go unused, there was a need to station an appropriate amount of manpower there.</span></p><br/><p><span>In the Holy Kingdom’s history — after the construction of the wall — the gravest intrusion into their lands had come during an invasion which took place amidst the Long Rain.</span></p><br/><p><span>It was a night attack, launched by a race called the Srush, who possessed sucker-cup hands, tongues envenomed with a paralytic toxin which could extend a long way, and advanced members of their species could even change their skin color as though using the 「Camouflage」 spell.</span></p><br/><p><span>The Srush crossed the wall, and headed west.</span></p><br/><p><span>Quite a number of villages had been lost to them, and such was the tragedy which had unfolded back then that to this day, there were still rumors about whether or not the Srush were still hiding within the borders of the Holy Kingdom.</span></p><br/><p><span>They wanted to fully man the wall in order to prevent such a tragedy from occurring again, but stationing troops at every single point along its length would strain the nation. The compromise which the nation came up with was to build small forts at fixed intervals along the walls. These strongpoints would then be overseen by several gigantic fortresses.</span></p><br/><p><span>They stationed a small number of troops in each of these strongpoints, their purpose being to fight extended battles down to the last man. If they encountered an enemy attack, they would immediately launch skyrockets to request reinforcements from the fortresses. In addition, there were companies of soldiers who would staff and patrol the fortresses, serving as reserve troops during emergencies, to be deployed flexibly as the situation required.</span></p><br/><p><span>After putting these measures into practice, the demihumans had not managed to penetrate the wall again.</span></p><br/><p><span>However, the diligent planning of the Holy Kingdom’s leadership back then had turned into a form of obsession. Even countermeasures like a defensive line of fortresses could not reassure them.</span></p><br/><p><span>Indeed, it was an incredibly massive wall — to human beings. Yet, it was no threat whatsoever to races who were several times taller than humans or who possessed the ability of flight. For those reasons, even such a sturdy wall was by no means a guarantee of absolute safety when one considered the many special abilities of demihumans.</span></p><br/><p><span>The Holy King at the time was a prudent man, and he had even prepared a stratagem for when the wall was breached. His solution was to mobilize the entire nation.</span></p><br/><p><span>For that reason, the citizens of the Holy Kingdom were conscripted as a form of national service. All adult citizens, male and female, would spend a certain necessary amount of time undergoing military training, after which they would be assigned to sentry duty on the wall. The hope was that they would become the manpower with which to protect their land in case the demihumans crossed over the wall.</span></p><br/><p><span>All residences above a certain size were also fortified. This gave the local villagers enough fighting power to hold out until the regular army could arrive, and allowed said villages to serve as military outposts. In the end, the villages of the Roble Kingdom were far better protected than those of other countries, and they could also function as military bases.</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>The Holy Kingdom’s fortress line was composed of three fortresses linked by the wall. Each of them protected one of only three fortified gates along the full length of the wall, which was in excess of one hundred kilometers long, and they also functioned as garrisons to dispatch troops to the surrounding strongholds. If the demihumans invaded and an overall mobilization order was given, they would become staging areas where the troops would gather in order to attack the enemy.</span></p><br/><p><span>This was one of them, the central fortress.</span></p><br/><p><span>As the sun slowly sank beneath the horizon, the red-tinted land was slowly soaked with the color of night.</span></p><br/><p><span>A powerful-looking man stood with one foot on the battlements, looking out over the land — at the western foothills. After that, he put his foot down.</span></p><br/><p><span>He was a man who bulged with muscle.</span></p><br/><p><span>His neck was stout, and his chest muscles were impressive enough that one could sense them even through his thick armor. His powerful arms protruded from his rolled-up sleeves. There was no better way to describe him than “athletic,” regardless of which part of him one looked at.</span></p><br/><p><span>His face was like a boulder, weathered by harsh conditions, and his thick brows and unkempt moustache spoke of a savage, wild nature. His mighty body and his stern appearance ought to have matched each other, yet his eyes broke that trend.</span></p><br/><p><span>They were tiny and round, beady like those of a small animal, and they felt almost comically out of place.</span></p><br/><p><span>Such a man now looked to the sky.</span></p><br/><p><span>The wind carried the thin clouds at incredible speeds, but even the starry night beyond their gossamer veil could not produce enough starlight to illuminate the land.</span></p><br/><p><span>The man’s nostrils flared, and he took a deep breath, smelling the breath of night through the early autumn air, which was flavored with a hint of winter chill. The violet night sky was swallowing the faint light of dusk upon the horizon with a speed visible to the naked eye. </span></p><br/><p><span>The man turned his back to the hills, and looked at the men around him.</span></p><br/><p><span>They were fierce warriors, who trusted him and who followed him. It was because he was surrounded by such warriors that he permitted himself a moment’s laxity. </span></p><br/><p><span>After all, the day’s work was done and nobody could dispute that.</span></p><br/><p><span>“—Oi, has anyone asked the forecaster about tonight’s weather?”</span></p><br/><p><span>The question was asked in a mighty voice which befitted his powerful body. The soldiers looked at each other, and one of them spoke up on the group’s behalf.</span></p><br/><p><span>“My deepest apologies! Corporal Camparno sir, it seems none of us have heard the report in question!” </span></p><br/><p><span>This man — Olrand Camparno — was a fairly low ranked man in the Roble Holy Kingdom’s military hierarchy.</span></p><br/><p><span>From bottom to top, the Roble Holy Kingdom’s military ranks went from Recruit, Private, Private First Class, Corporal, Sergeant, Platoon Sergeant, and so on. Of course, different ranks existed in different units, and these were simply the ranks for the regular infantry. </span></p><br/><p><span>Usually speaking, a simple corporal would not need to be addressed as “Sir.”</span></p><br/><p><span>However, the man calling Olrand “Sir” did not do so to mock him. His respect for him was evident in his attitude and tone. Neither was it just that man; every soldier present, each of whom walked and talked like a skilled veteran of many battles, felt the same way about Olrand.</span></p><br/><p><span>“Really now?”</span></p><br/><p><span>Olrand slowly stroked his stubbly face.</span></p><br/><p><span>“Sir, if time permits, will you allow this one to go and ask immediately?”</span></p><br/><p><span>“Hm? No, no need for that. Our job is over now. What happens next is the business of the people after us.”</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>Olrand Camparno.</span></p><br/><p><span>He was a man of many accomplishments who, through his fighting skill alone, had earned the honor of being named one of the Holy Kingdom’s Nine Colors by the previous Holy King. </span></p><br/><p><span>The reason why such a man remained at such a lowly post stemmed from two problems which Olrand had.</span></p><br/><p><span>The first was because he was very free-spirited — he hated taking orders.</span></p><br/><p><span>The second was because he was obsessed with fighting skills.</span></p><br/><p><span>When these two points came together, they led to a way of life that said, “If you want to tell me what to do, beat the crap out of me first.” If he met a worthy foe he would say, “You look pretty strong. How about sparring with me?” and then they would fight until one of them passed out. </span></p><br/><p><span>This personality of his had led to many violent incidents involving nobles and his superiors, so he had been demoted over ten times already.</span></p><br/><p><span>There was no need for people who could not obey orders in the military and they were universally loathed as well. Under normal circumstances, it would hardly have been strange if he were disciplined or dishonorably discharged. However, he had not met with such a fate, purely due to his strength. In addition, there were those who admired men like him.</span></p><br/><p><span>The rough sorts who were unhappy about being ordered about by destitute nobles found Olrand’s way of living by the strength of his arm most thrilling</span></p><br/><p><span>His unit was a squad of delinquents composed of such violent people — no, they were more of a gang.</span></p><br/><p><span>They were quite numerous, so calling them a company would not have been out of place. In addition, its members may not have been Olrand’s equals, but they were all skilled fighters, which led to him assuming an unofficial post which his superiors could not tolerate, but which they could do nothing about.</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><span>Olrand glanced around, and after verifying the identity of the man approaching them, a smile appeared on his face, like that of a carnivore about to pounce its prey.</span></p><br/><p><span>That man seemed quite slender in comparison to Olrand’s brawny form. However, his was not the scrawniness of a twig. Rather, he had a wiry, steely look about him. If one forged and reforged a man, burning away everything unrelated to his intended function, it would produce a textbook slimness of the kind he embodied.</span></p><br/><p><span>In addition, his narrow eyes were keen, as though he was about to attack at any moment. Then there were his narrow pupils which did not look like they belonged to anyone engaged in a legitimate enterprise. In polite terms, he was an assassin. In less than polite terms, he was a mass murderer. </span></p><br/><p><span>“Speak of the devil and here he comes. Fancy meeting you here, Night Shift-san. Nice to see you~”</span></p><br/><p><span>The other man made no sound as he approached them with silent footsteps. He was dressed very differently from Olrand.</span></p><br/><p><span>Olrand and the men around him wore suits of heavy leather armor made from the hides of magical beasts called Lanca Cattle. In addition, they carried small round shields and single-edged swords, the standard outfit of the Holy Kingdom’s superior troops. Incidentally, Olrand was the only one who had eight of those swords at his waist.</span></p><br/><p><span>In contrast to that, the other man wore a suit of enchanted light leather armor. There was an owl crest stitched on his right chest, while the emblem of the Holy Kingdom adorned his left.</span></p><br/><p><span>“…Olrand. I haven’t received your shift report yet. Also, is that the attitude you ought to be taking with a superior? That’s practically insubordination. How many times do I have to remind you of that?”</span></p><br/><p><span>“Well, do forgive me, Platoon Sergeant-dono.”</span></p><br/><p><span>As Olrand saluted him sloppily, the men under him saluted as well. It was a proper salute, the kind which they would never give a nobleman or any mere superior officer. It was a salute which showed genuine respect.</span></p><br/><p><span>The man sighed with a </span><i><span>haaah</span></i><span>. It was a sigh made by one who knew that his conduct was unacceptable, but who also knew that lecturing him about it would be pointless.</span></p><br/><p><i><span>Sorry, boss. Old habits die hard, as they say.</span></i></p><br/><p><span>The reason why Olrand saluted this man, however reluctantly, was because he had defeated Olrand.</span></p><br/><p><i><span>I’d like to beat you once before I leave this place. On your terms. Don’t you think, Platoon Sergeant Pavel Baraja?</span></i></p><br/><p><span>The man — Pavel Baraja — was nicknamed “The Night Watchman.” Like Olrand, he was one of the Nine Colors. The massive, exquisitely-made bow on his back gleamed with the faint light of magic, and the quiver hanging at his waist glowed in the same way. He was an archer, just as his appearance suggested. He was a superb marksman, with a reputation of perfect accuracy.</span></p><br/><p><span>“I think this all the time, but working at night sure is hard. The demihumans do just fine in the darkness but it’s hard enough just to find their traces, let alone fight them.”</span></p><br/><p><span>“That’s why we’re here. The only way to gain magic and talents comparable to demihumans — their vision aside — is through training. And we’ve received that training.”</span></p><br/><p><span>“Yes, yes. Same goes for that daughter you’re so proud of, right?”</span></p><br/><p><span>Pavel’s face twitched and Olrand instantly regretted his poor choice of words.</span></p><br/><p><span>This was a man whose expression remained unchanged even in the midst of a drinking party. The only exception was when the topic of his daughter and wife came up. That was where the problem lay.</span></p><br/><p><span>“Oh yes. She’s an outstanding girl.”</span></p><br/><p><span>—It was happening. It had already begun.</span></p><br/><p><span>Pavel paid no heed to Olrand’s regret and continued speaking.</span></p><br/><p><span>“That said, I honestly have no idea why she wants to become a paladin. She’s weak little girl, certainly not the type who thinks of fighting power as everything — honestly, she’s even been scared to tears by caterpillars in the past — and while I did say that might was everything just now, that doesn’t extend to my wife… although my wife </span><i><span>does</span></i><span> seem like that in some ways — and she’s adorable because she grew up like me, no, I should say that it’s a pity she ended up growing up to look like me — but the true shame is that she doesn’t have any talent for using swords. However, she’s adept with the bow. If only she could hone her skills in that respect, but then here she is wanting to be a paladin and whatnot—”</span></p><br/><p><span>He let the meandering monologue flow in one ear and out the other, making the appropriate noises in response when they were needed, but it would seem he had still been found out.</span></p><br/><p><span>“Oi, are you listening to me?”</span></p><br/><p><span>That question was only to be expected.</span></p><br/><p><i><span>No, I wasn’t listening. I think I stopped after the third time.</span></i></p><br/><p><span>After hearing the same thing about five or six times, under normal circumstances Olrand would have unhappily retorted “Hell no.” However, taking that tone with Pavel would be a terrible mistake. That was because he knew that he would surely reply, “Then I’ll tell you again.”</span></p><br/><p><span>This was the right answer:</span></p><br/><p><span>“Of course I did. What a lovely girl she is!”</span></p><br/><p><span>Pavel’s face changed dramatically. While it was an ugly, fiendish expression that put Olrand on his guard, the fact was that the other man was simply embarrassed.</span></p><br/><p><span>If he did not capitalize on the way Pavel’s mind was savoring the joy of hearing his daughter being praised by others and overcome Pavel’s desire to praise his daughter, he would be plunged into that hell once more.</span></p><br/><p><span>“Also—”</span></p><br/><p><span>Only one thing could trump the topic of his daughter. That was work.</span></p><br/><p><span>“Doesn’t night work mess with your biological clock? Won’t your body get weird?”</span></p><br/><p><span>The butcher’s expression on Pavel’s face returned to his usual killer’s expression.</span></p><br/><p><span>“…How many times have you asked that question already? The answer’s the same as always; it’s nothing to be concerned about. Still, why do you keep asking that question? What are you really getting at?”</span></p><br/><p><span>He knew the cause for it, but he still stared at his rapid shift in attitude.</span></p><br/><p><i><span>Where did the you from just now go</span></i><span>, he wanted to say, but Olrand did not want that hell to return once more.</span></p><br/><p><span>“…Hah. What I really want to say? Well, that’s a surprising question… I was just thinking that it’d cause a lot of trouble for me if the man who beat me ruined his body and ended up having to retire over a trivial thing. Of course, once I win, such minor things won’t matter any more.”</span></p><br/><p><span>In the past, Olrand had been full of himself when he was first assigned to this strongpoint, and thinking back to those days embarrassed him. Skilled soldiers gathered around him in admiration, fuelling his ego ever further, and somehow, he had ended up fighting a mock battle with Pavel. </span></p><br/><p><span>Olrand favored the sword — close combat. In contrast, Pavel favored the bow — ranged combat.</span></p><br/><p><span>If the two of them clashed, the question of engagement range would be extremely important. However, Pavel declared that he was fine with close combat.</span></p><br/><p><span>And then, Olrand lost.</span></p><br/><p><span>Olrand respected Pavel for that reason. At the same time, he harbored the desire to beat him next time. This time, he would fight Pavel in his field of expertise, ranged combat, and emerge the victor there.</span></p><br/><p><span>“Is that so? You want to fight me, then? While I’m at peak physical condition, with no handicaps on my part.”</span></p><br/><p><span>A bestial smile crossed Pavel’s face as he said so, and it made Olrand’s chest heat up.</span></p><br/><p><i><span>Oh yes, definitely. Isn’t that obvious? I want to fight you. I want to put my life on the line against you. However, that won’t be allowed, will it? Even so, if possible, I’d like us to have a battle where both of us could die at any moment. That’s how I want to fight you.</span></i></p><br/><p><span>However, Olrand remained silent. That was because his instincts said there was no telling where the beast before his eyes would go. And in fact, what Pavel said after that confirmed those instincts.</span></p><br/><p><span>“Still, I have to apologize. You should know why too.There’s very few people who can beat you as you are now in melee combat, and I’m not one of them.”</span></p><br/><p><i><span>Then let’s settle it with ranged combat.</span></i><span> Those words did not issue from Olrand’s mouth. That was because he knew it would only be an insult to a worthy opponent.</span></p><br/><p><span>He recalled Pavel’s bow skills. He was still not confident that he could evade his attacks and close the distance at the same time.</span></p><br/><p><span>—No, not yet.</span></p><br/><p><span>“Well, if that’s all, time to make your report.”</span></p><br/><p><span>“No need to rush, boss. It’s not time for the shift change yet, right? Look, the bell hasn’t rung yet.”</span></p><br/><p><span>Indeed, the chime that signalled a shift change had not yet sounded.</span></p><br/><p><span>“You still need to prepare to change shifts, right? There’s things to do before the bell goes. You ought to be getting yourself ready so you can change over the moment the bell rings.”</span></p><br/><p><span>“It’s still too early even for that, right boss? Come talk with us for a bit.”</span></p><br/><p><span>“Then, may I make a report to the Platoon Sergeant’s second-in-command?”</span></p><br/><p><span>The person who spoke was one of his men. </span></p><br/><p><span>“Oh, that’s a great idea. Excellent job, you. How about that, boss?”</span></p><br/><p><span>“…Hah. You’re being really persistent today. You want to say something, right? Good grief… if you want to say something, come out and say it.”</span></p><br/><p><span>But of course, he could not.</span></p><br/><p><span>While he had acknowledged the other man as someone he could talk with because he respected him, Olrand was the type who did not speak to people precisely because he respected them. That was because he wanted to be seen as a man who could stand on his own. </span></p><br/><p><span>“Well, that’s why you’re the boss. You get it, don’t you?”</span></p><br/><p><span>“…Hahhh. So, what is it? I won’t let you off lightly if it’s some trivial nonsense.”</span></p><br/><p><span>“Well, about that…” Olrand took off his helmet and scratched his head. The cool air felt strangely comfortable on his heated scalp.</span></p><br/><p><span>“The truth is I want to go on a warrior’s pilgrimage. So can I leave this place?”</span></p><br/><p><span>He could hear the gasps of surprise from all around him. However, the expression on the slender man in front of him remained unmoved.</span></p><br/><p><span>“Why tell me?”</span></p><br/><p><span>“That’s because you’re the man I respect the most in this nation, boss. If you won’t stop me either, then I won’t have any more doubts.”</span></p><br/><p><span>“…Aren’t you an NCO? If you’ve finished your conscription period, I can’t possibly stop you.”</span></p><br/><p><span>The Holy Kingdom practiced conscription. Therefore, they sometimes called those people who chose to be career soldiers noncommissioned officers, in order to differentiate them from those people who had been conscripted. Pavel and all his men were NCOs, while Olrand had some NCOs and conscripts under his command.</span></p><br/><p><span>“In that case, you don’t mind if I quit, right?”</span></p><br/><p><span>Being asked that question marked the first time Pavel’s face had changed apart from when the topic of his wife and daughter had come up. Olrand had barely managed to discover it by dint of his extraordinary powers of perception gained from being a warrior. Nobody else around them had noticed it.</span></p><br/><p><span>He was someone that Olrand acknowledged as a man of steel, but he was actually perturbed by the question of his staying or departure. His heart swirled with a mix of delight and sorrow.</span></p><br/><p><span>“…Well, legally speaking, I have to accept that. I can’t stop you… That said, we’ll sorely feel the absence of a strong man like you. You should have gone on your warrior’s journey earlier, right? Why now? Is it because there aren’t any more demihuman attacks?”</span></p><br/><p><span>Since that time half a year ago, the demihumans had stopped attacking this fortress. In the past, they had attacked about once or twice a month, in groups of about a few dozen each time.</span></p><br/><p><span>While they only numbered a few dozen, they were still demihumans, who had superior physical abilities compared to mankind, and many of them possessed special abilities on top of that. Those were numbers which could easily slaughter an entire outpost wholesale.</span></p><br/><p><strong></strong></p><br/><p></p><br/><p><span>Both Olrand and Pavel had experienced many situations where they had to send out elite troops for relief operations.</span></p><br/><p><span>“You know I don’t enjoy slaughtering the demihumans, right? I like fighting strong people and becoming strong.”</span></p><br/><p><span>“So how about the Grand King, then?”</span></p><br/><p><span>“Ahhh, that guy…”</span></p><br/><p><span>“Oh, and then there’s the Demon Claw, the Beast Emperor, the Ashen King, the Iceflame Lightning, and the Spiral Lance.”</span></p><br/><p><span>Pavel had mentioned the nicknames of several notable demihumans, but none of them moved Olrand’s heart apart from the one he had first mentioned.</span></p><br/><p><span>The Grand King Buser.</span></p><br/><p><span>He was the king of a certain demihuman tribe, a being known as the Lord of Destruction. </span></p><br/><p><span>That nickname came from the fact that he was skilled in martial arts that destroyed weaponry and his fighting style that revolved around such sundering techniques. He was a mortal enemy of the Holy Kingdom who had defeated many famed warriors, and he had fought Olrand in the past. Back then, he had destroyed Olrand’s longsword, his backup weapons of a shortsword and handaxe, and even a billhook used to cut trees for firewood.</span></p><br/><p><span>Although he had broken all of Olrand’s weapons, the Grand King withdrew after seeing the reinforcements sent from the fortress. In a sense, being able to hold out until help arrived was a win for Olrand, and many people praised him for his valor. To Olrand, however, it simply meant that the Grand King did not think that slaying Olrand was worth the risk, and so all Olrand felt was a hollow sense of defeat.</span></p><br/><p><span>“I do want to fight him again, but… I guess I still can’t beat him now. You’d probably need one of those people they call heroes to defeat him, otherwise it would be very difficult. Therefore… ah, you’ve also heard of it, right boss? How that great warrior, Gazef Stronoff, died in battle.”</span></p><br/><p><span>“Ah, yes, I did. The higher-ups are debating hotly about how that’s going to affect the surrounding countries, after all.”</span></p><br/><p><span>The death of Gazef Stronoff, known as the mightiest warrior of the Re-Estize Kingdom, was a matter of great interest to the soldiers of the Holy Kingdom — particularly the skilled ones.</span></p><br/><p><span>“Do you know any specifics?”</span></p><br/><p><span>“I’ve heard some rough details. Apparently, he duelled a magic caster known as the Sorcerer King and was struck down. Frankly speaking, the fact that he would actually challenge a magic caster to a duel is quite hard to take in.”</span></p><br/><p><span>Olrand agreed as well.</span></p><br/><p><span>However, the term “magic caster” was quite broad. Divine magic casters could, after using spells which enhanced their physical abilities, end up stronger than a half-baked warrior. In addition, the paladins who were the pride of this nation could use magic too, so to some extent, one could not say they were not magic casters. In that case, he could understand the reasons for the duel.</span></p><br/><p><span>“…In addition, others say that the Sorcerer King massacred an entire army. Apparently he summoned gigantic goats, or sheep, rather.”</span></p><br/><p><span>“Well, that’s the first time I’ve heard that. Still, gigantic goats? What a weird magic caster.”</span></p><br/><p><span>The mention of goats reawakened unhappy memories of Olrand’s defeat. That said, while the rumors said he had summoned goats, they were clearly not ordinary goats.</span></p><br/><p><span>“Well, it’s also because of that weird magic caster. That’s why I need to do this.”</span></p><br/><p><span>“…That’s why? I don’t quite get your meaning.”</span></p><br/><p><span>“This hasn’t changed from when I lost to you, but I’m the sort of person who disregards items that grant flight, spells, and the like. I’ve always thought that all you need to do is beat them with your sword. However, after the Kingdom’s Warrior-Captain-dono — who was stronger than me — lost to those, I began to think that maybe I shouldn’t look down on them.”</span></p><br/><p><span>“Which means?”</span></p><br/><p><span>“Which means I need to go on a warrior’s pilgrimage.”</span></p><br/><p><span>“…Don’t tell me you’re going to challenge those people in our country that you can’t beat?”</span></p><br/><p><span>“I won’t.”</span></p><br/><p><span>Some of the opponents which Olrand could not win against were fellow members of the Nine Colors.</span></p><br/><p><span>The Vice-Captain of the marines, Enrique Belsway, known as “the Blue.”</span></p><br/><p><span>The Captain of the Paladin Order, Remedios Custodio, known as “the White.” </span></p><br/><p><span>Pavel Baraja, known as “the Black.”</span></p><br/><p><span>Ran Tsu An Rin, one of the Mermen who lived in the sea, known as “the Green.”</span></p><br/><p><span>And then, outside of the Nine Colors, there was the most powerful priest in the nation, Queralt Custodio. </span></p><br/><p><span>In other words, they were some of the most highly placed people in the land, and challenging them would surely cause great ructions in the country. If it was just a mock battle, then it ought to be all right, so long as it was against a fellow member of the Nine Colors, but an all-out duel would never be allowed.</span></p><br/><p><span>However, that would not do.</span></p><br/><p><span>A true clash of blades was completely different from a mock battle. Sometimes, the winner and loser could be completely reversed between them. Many people became much stronger — or weaker — when going from training to a live combat. Naturally, the strong were recognized as such because they showed their power in actual combat. Therefore, one could not consider a warrior pilgrimage complete without fighting a real battle.</span></p><br/><p><span>“That’s good, then… still, where do you plan to train yourself?”</span></p><br/><p><span>“I was thinking of visiting the Sorcerous Kingdom you mentioned earlier. It seems there’s powerful undead there.”</span></p><br/><p><span>The Sorcerous Kingdom of Ainz Ooal Gown.</span></p><br/><p><span>It would have taken an incredible attention-seeker to actually name a country after themselves, but it was not entirely unthinkable. More to the point, it was a fact that the person who had done so had the power to back it up.</span></p><br/><p><span>“I’ve heard of it from the merchants who travel between the Kingdom and the Holy Kingdom.”</span></p><br/><p><span>Thanks to the teachings of the Holy Kingdom’s temples, the common man both hated and despised the undead. Even Pavel was no exception. </span><i><span>No</span></i><span>, Olrand thought. Pavel did not hate them because they were the enemies of the Holy Kingdom, but because they were his wife’s enemies.</span></p><br/><p><span>However, he could not bring that up. While he did not lose himself in chatting about his wife as he did with his daughter, he still spoke far too much.</span></p><br/><p><span>“The Holy Kingdom’s stance is to tacitly acknowledge the existence of the Sorcerous Kingdom, right? They say it’s okay for people of the Holy Kingdom to go over there… right?”</span></p><br/><p><span>There was no way to hide the fact that the Sorcerous Kingdom, with its armies of the undead, was an intolerable foe of the Holy Kingdom. Many people had urged them to send out troops when they thought of how the people in the Sorcerous Kingdom’s Capital of E-Rantel must be suffering. However, the Holy Kingdom presently faced the threat of the demihumans, and they would not be able to conduct military operations in other countries without first pacifying the hill region. </span></p><br/><p><span>The feelings of the people aside, the leadership’s response to the Sorcerous Kingdom did not escalate beyond half-hearted criticism.</span></p><br/><p><span>“…The Sorcerous Kingdom, hm. Well, if you apply to the brass, you ought to be able to go over there as a member of the army. They view the Sorcerous Kingdom as a threat second only to the demihumans. It seems they want to ally with the Theocracy against them.” </span></p><br/><p><span>“Really now. It seems there’ll be a lot of problems due to religious differences, then.”</span></p><br/><p><span>“Yes, precisely. Well, that aside, if your affiliation doesn’t change, you can receive the country’s aid and you can skip those annoying immigration checks… I think. If you go over, you’ll be a godsend to the people who want to know more about the inner workings of the Sorcerous Kingdom.”</span></p><br/><p><span>“Well, wouldn’t that be nice. Still, if I did that, I couldn’t just go around picking fights.”</span></p><br/><p><span>“You… the way you say that so seriously is really headache-inducing.”</span></p><br/><p><span>“I guess it’d be hard on you if it became an international incident, huh.”</span></p><br/><p><span>The cold wind blew past them. For a while, Pavel went silent, his expression unchanged, but after that, he began muttering unhappily (as usual). </span></p><br/><p><span>“I’m going to miss that ugly face of yours.”</span></p><br/><p><span>Olrand smiled wickedly. It was a ferocious, bestial grin, but he was being uncharacteristically shy. Pavel had not said, “don’t go,” but neither had he said, “go.” He decided to make sure that he would have somewhere to return to.</span></p><br/><p><span>“Sorry about that… Well, I’ll come back after I become stronger. Want me to train you up at that time?”</span></p><br/><p><span>“Fancy you saying that.”</span></p><br/><p><span>As Olrand chuckled, Pavel laughed back at him in turn. Their laughter was every bit as ferocious as two wild beasts growling at each other.</span></p><br/><p><span>Just then, the bell rang. </span></p><br/><p><span>It would seem that it was time to change over to the night shift. They had spoken at great length, so they would wrap it up with one more thing. As Olrand thought that, that notion evaporated from his mind as the bell continued to ring.</span></p><br/><p><span>Pavel, followed closely by Olrand, looked to the hills.</span></p><br/><p><span>Those bells meant “Demihumans sighted.”</span></p><br/><p><span>Their visibility was clear up to to over four hundred meters away. In the past, there had once been forests and trees there, but the country had conducted a massive landscaping project as part of the wall’s construction to flatten it out. </span></p><br/><p><span>However, at the furthest reaches of the expansive plains — where there were hills and other obstructions — they saw sparkles in the darkness and moving black shadows.</span></p><br/><p><span>“Boss…”</span></p><br/><p><span>It was impossible for Olrand to discern the true identities of those demihumans at this distance while in the dark. Therefore, he called on the man with the keenest eyesight.</span></p><br/><p><span>“Yes, they’re demihumans… Snakemen,” Pavel immediately answered.</span></p><br/><p><span>Snakemen had heads like a cobra and scaly, humanoid bodies, as well as tails. They were demihumans that were considered close relatives to Lizardmen. Their serpentine heads had venomous bites and their spears were coated in powerful toxins. Close combat with them was to be avoided as much as possible.</span></p><br/><p><span>That said, Olrand and his men were seasoned veterans, and they possessed very high resistance to poisons. While their scales provided some protection, they were not hard enough to deflect metal weapons. They might be skilled with their tails, but one could simply consider them another weapon. In addition, they had the advantage at night due to their ophidian sensory organs, but that was not a problem.</span></p><br/><p><i><span>Is leading the charge on them going to be our job? No, by the time they reach here, Boss’s unit would have shot them all to death.</span></i></p><br/><p><span>Snakemen despised cold objects, so they did not use metal armor and other such items. As a result, it was a simple task for first-rate archers like Pavel and his men to fill them full of arrows.</span></p><br/><p><span>“So how many of them are there, Boss?”</span></p><br/><p><span>Usually, there would be less than twenty of them.</span></p><br/><p><span>“…Boss?”</span></p><br/><p><span>Olrand was briefly puzzled by the lack of a response. He looked at Pavel, and saw a look of clear vexation on that typically blank face of his.</span></p><br/><p><span>“What’s wrong, Boss?”</span></p><br/><p><span>“…There’s more of them? Could this be — this is bad! I’ve spotted members of other species! Armatts, Ogres, and are those Cavens?”</span></p><br/><p><span>“What did you say?”</span></p><br/><p><span>There were all kinds of demihumans in the hill region, but they did not have good relationships with each other. On the contrary, they often fought over territory, and apart from cases where Ogres took Goblins as slaves and cruelly used them, these races very rarely worked with each other.</span></p><br/><p><span>There had even been cases where some of them had attacked the Holy Kingdom after being driven from their lands.</span></p><br/><p><span>Then this ought to be the same thing. Because if it was not—</span></p><br/><p><span>“A big invasion?”</span></p><br/><p><span>He did not know who had said that. Perhaps the person saying so might have thought he was speaking to himself, but it sounded clear enough to his ears.</span></p><br/><p><span>“Olrand, I’ve got something to ask you.”</span></p><br/><p><span>There was tension in Pavel’s voice. No, that was only to be expected.</span></p><br/><p><span>Race, culture, and religion. Just as how there could be many nations composed of members of the same species, creating a cohesive nation was a very difficult task. It was even more difficult when the species of the members were different. Therefore, uniting the demihuman tribes in the hills was a nigh-impossible task.</span></p><br/><p><span>If that was what had happened, that would mean the beginning of a battle for the Holy Kingdom’s survival.</span></p><br/><p><span>After that — Olrand’s body trembled uncontrollably.</span></p><br/><p><span>Uniting all these races would require obvious power. Among mankind, wisdom and wealth would qualify as a form of strength, but the demihuman races prized power. In other words—</span></p><br/><p><i><span>That means there might be a frighteningly powerful enemy out there, is that it?</span></i></p><br/><p><span>“Tell me with your warrior’s instincts. Why do you think these guys chose to reveal themselves at a fortress like this — at such a well defended place? One — they’re serving as bait to draw out our forces to thin out our defences. Two—”</span></p><br/><p><span>“They’re confident of breaking through in a head-on attack. Twenty percent of the Holy Kingdom’s fighting strength is stationed here, and they’re going to crush us like cockroaches.”</span></p><br/><p><span>Despite feeling Pavel’s keen gaze from beside him, Olrand did not stop talking.</span></p><br/><p><span>“At the same time, they’re going to use this fortress as a bridgehead. Then, they’re going to crush the morale of the Holy Kingdom and boost their own morale. Is that it?”</span></p><br/><p><span>“…They might issue a mass mobilization order.”</span></p><br/><p><span>“Haha! A war like this has only occurred once before in the history of the Holy Kingdom, and now there’s going to be another one like it in our time! What can we say to that!?”</span></p><br/><p><span>“I’m going to report to the higher-ups. You come with me too.”</span></p><br/><p><span>“Got it, boss! Oi, you lot! This is going to be one hell of a party! Keep the backup weapons coming!”</span></p><br/><p><span>If the enemy was an army, they would have to spend a lot of time forming their troops up. This was especially true if they counted numerous races among their number. However, the same applied to the defenders as well. Since they were an army, they would need time to prepare themselves. This held true even on the frontline. </span></p><br/><p><span>There was a shocking amount of things which needed to be done. There was no more time to idle around.</span></p><br/><p><span>Olrand ran after Pavel.</span></p><br/><p><span>♦ ♦ ♦</span></p><br/><p><b>Part 2</b><span></span></p><br/><p>\n</p></div>"}