{"title": "Chapter 85 - Volume 11", "id": 85, "volume": 11, "url": "http://boxnovel.org/overlord-ln-chapter-85-volume-11", "volume_title": "Volume 11", "body": "<h1>Chapter 85 - Volume 11</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>v11 Chapter 5</p><br/><p>Chapter 5: Frost Dragon Lord</p><br/><p>Image</p><br/><p>1</p><br/><p>It was the next morning. Ainz had decided to set out early to take back the former Dwarven Capital, Feoh Berkanan, but just as he was about to leave, a familiar face appeared at the door.</p><br/><p>It was Gondo.</p><br/><p>Ainz tilted his head. He had no idea why he might be here.</p><br/><p>“—Are you here to send me off?”</p><br/><p>“No, I have come to lead the way.”</p><br/><p>Ainz blinked. Granted, he had mentioned that he would need a Dwarf to show him the way. Judging by how the Council had immediately complied with the request, Ainz surmised that this Dwarf’s mission would be to keep an eye on him, so he thought that they might select an unrelated Dwarf.</p><br/><p>“After parting ways with you yesterday, I heard many things from the other runesmiths. I feel that I know the route to the Royal Capital better than any other Dwarf.”</p><br/><p>“Then, can you find an alternate route if the tunnel to the Capital collapses? You may need to adapt to changes in the situation as they come up. Is that alright?”</p><br/><p>“I’ve studied up as much about them as I could. Please allow me to guide you.”</p><br/><p>“Umu.”</p><br/><p>Ainz began to think.</p><br/><p>In truth, bringing Gondo along carried more demerits than merits. However, if the Council had approved, then if Ainz was the only one who disapproved and requested a change, the chances of him getting someone else as a guide would be very low.</p><br/><p>“…Are you a warrior, or do you have some way to fight?”</p><br/><p>“No, I don’t. I have no confidence in my skills pertaining to that field. However, I am prepared to face any danger, and nobody will blame you if I perish. In addition, I have my father’s cloak. That was also a reason why they chose me.”</p><br/><p>The cloak of invisibility lent a lot of weight to his argument.</p><br/><p>While Ainz had planned to protect his guide anyway, he felt uneasy about bringing along a Dwarf with no combat ability. And while he could still resurrect him with magic even if he died (provided he had sufficient levels), Gondo might have the mindset of “it’s all over” if he died.</p><br/><p>“Do you need to verify if I’ve chased all the Quagoa out of the Royal Capital? If you die along the way, it’ll make things very difficult for me… and then there’s the matter of the runesmiths. I’d much rather you stayed here.”</p><br/><p>Gondo slowly approached Ainz and quietly said:</p><br/><p>“The Royal Capital has a vast treasury. If it hasn’t been plundered yet, then it will contain many Dwarven treasures. There should also be some of my father’s weapons and technical manuscripts from the royal family in there. Who knows, there might even be secret manuals left behind by runesmiths of the past.”</p><br/><p>“Hoh…”</p><br/><p>With that response, Ainz indicated that Gondo should continue.</p><br/><p>“I wish to secretly obtain them. …While it seems rude to ask this of Your Majesty, may I please ask you to turn a blind eye to this when you retake the Capital?”</p><br/><p>“…Before that, do you have any way to open the Treasury?”</p><br/><p>“No. However… I believe Your Majesty should be able to do something about that, right?”</p><br/><p>Does he really think I can do anything?</p><br/><p>“So you want me to become an accomplice to a petty thief?”</p><br/><p>“I believe the correct explanation of what would happen is that Your Majesty wished to see if the Treasury had been burgled, and thus opened it to check. Then, you were briefly distracted, for just long enough. I would be that petty thief, bearing no relation to Your Majesty.”</p><br/><p>“…The line of Dwarven royalty has been severed. Is that correct? Is there a ledger recording the treasures that should be within the vaults?”</p><br/><p>“I am afraid there is none.”</p><br/><p>“It is very important to make sure of that. It would be very dangerous if there was a record, you know? I cannot approve of this. …More importantly, does that treasure not belong to your country? Does it not shame you to steal it?”</p><br/><p>Gondo laughed scornfully.</p><br/><p>“Well, those manuals don’t mean anything to a country that gave us and runecraft up, don’t you think?”</p><br/><p>It’s treason, then? Though that thought passed through Ainz’s head, the truth was that it did him no harm. On the contrary, letting these books languish in the Dwarven nation would be a waste.</p><br/><p>More to the point, Gondo’s theft would completely break his ties to the Dwarven Kingdom. The Dwarven Kingdom would not tolerate a criminal who had looted their treasury. This matter could be used as a form of blackmail, and it would become a shackle that would render Gondo completely incapable of betraying the Sorcerous Kingdom.</p><br/><p>However, it could also be used against Ainz in a similar manner.</p><br/><p>“…Indeed. There’s no point in letting people who don’t need it have it either. Indeed, it might be that my eyes might fail me at that time. Still, like I mentioned earlier, you need to search out any catalogues of the treasures. I’d like to avoid any future disputes.”</p><br/><p>“Understood. I shall do as Your Majesty commands.”</p><br/><p>“Then, we’ll leave matters at that.”</p><br/><p>While they had walked some distance away to discuss this, someone with keen hearing might be eavesdropping on them.</p><br/><p>“Then, let’s change the topic. Tell me about the hazards we might face before reaching the Dwarven Capital. A basic outline is fine.”</p><br/><p>“A good question. All who wish to reach the Dwarven Capital must pass three trials.”</p><br/><p>“Trials? Interesting. Summarize them.”</p><br/><p>“Mm, the first trial is the Great Rift. There is a slope ahead of the gate that leads to the fortress. After the fortress is the Great Rift that splits the earth. Now that the suspension bridge has been strung, it hardly qualifies as a trial. However, when crossing it, one must prepare oneself to receive concentrated attacks from the enemy.”</p><br/><p>“Do the Quagoa use ranged weapons?”</p><br/><p>“Umu, I haven’t heard of that before. However, it might be dangerous to assume they don’t, right?”</p><br/><p>It made a lot of sense. The possibility also existed that they could use the magic weapons from the fortress.</p><br/><p>“Then, the next trial is an area of flowing lava. Even the heated air alone can be fatal. One must cross it via a narrow path of trimmed rock. There have also been sightings of a huge monster there from time to time.”</p><br/><p>“A monster, you say?”</p><br/><p>The form of Guren, Area Guardian of the 7th Floor, came to mind.</p><br/><p>If the monster was similar to it, things would be very troublesome indeed.</p><br/><p>…Come to think of it, Slimes and human society are quite closely linked. Is it the case in this country as well? If they have rare slimes here, I’d like to bring them home.</p><br/><p>Just as Ainz thought of the slimes that lived near the sewer filters, Gondo moved on to the last trial.</p><br/><p>“The final trial is the Maze of Death. It is a cave with countless branches, filled with poisonous vapors. If one inhales those vapors, their limbs will be paralyzed and their hearts will stop beating.”</p><br/><p>Gondo looked towards Aura and Shalltear.</p><br/><p>That gesture seemed to be saying that Ainz might be fine, but those two would be in trouble.</p><br/><p>They’ll be fine… Well, I guess I can tell him when we get there.</p><br/><p>“And what is the right path through the caves?”</p><br/><p>“Regretfully, I do not know. I looked through all my connections, but even the elders did not know. Neither did the members of the Council. Perhaps it might be recorded in an archive…:”</p><br/><p>“But you didn’t find it either, did you? Well, I doubt you’d be able to easily locate a document that was so critical to national security. We’ll gather information when the time comes and adapt to the situation.”</p><br/><p>Ainz committed the information about these trials to memory, and gestured to the others.</p><br/><p>“Let’s go, then.”</p><br/><p>Ainz, Shalltear and Aura took the lead. Gondo lined up with ten or so soldiers and their commander on their way to retake the fortress, and then the gates slowly opened. The stench of death filtered through the gap, so they had an idea what to expect, but then a gruesome scene revealed itself to all present.</p><br/><p>The gentle tunnel which sloped down was broad and it had been levelled for easier passage. However, the walls and floor were covered in blood, guts and chunks of meat. Quagoa corpses littered the ground.</p><br/><p>“Urk!”</p><br/><p>The stench of gore, offal death filled the room. It was too much for Gondo, who had no experience as a warrior, and he began retching. The Dwarven soldiers’ faces had turned green, and not because of any trick of the light.</p><br/><p>Ainz’s body had no concept of nausea, so it did not cause him any problems. However, he did not enjoy this smell.</p><br/><p>A squelching noise came from underfoot. It would seem he had stepped on the innards which had fallen out of a bisected Quagoa.</p><br/><p>Ainz sighed and then cast [Mass Fly], allowing everyone to take flight.</p><br/><p>It would seem the Death Knights had revelled in their carnage here. Anyone who slipped and fell in this tunnel of blood would surely lose their strength to the filth and the stench. More importantly, the sight of someone lurching around beside them while covered in blood was a gruesome one.</p><br/><p>The group descended the sloping passage, unblemished due to the flight spell.</p><br/><p>Thanks to the dimly glowing rocks embedded along the way, there was still some light to see by. However, the space between each rock was filled with darkness. Of course, Ainz possessed darkvision, and it posed no problems to him.</p><br/><p>After going down the slope — a distance of about 100 meters — they could see the entrance to the fortress before them. No, it would be more accurate to say that it was the fortress’ back door.</p><br/><p>Once they passed through the opened doors into the fortress, they could go beyond the fortress and cross the suspension bridge ahead. After travelling west from there for several days, they should be able to see the former Dwarven Capital.</p><br/><p>The Fortress’ entrance was littered with Quagoa corpses. Some of them looked like they had not been killed by the Death Knights, but gnawed. Those must have been the victims of the Death Knights’ zombies.</p><br/><p>Ainz’s undead detection did not pick up any contacts. It was probably because the zombies had reverted to regular corpses after the Death Knights were destroyed.</p><br/><p>Ainz looked around. There were no undead reactions now, but if he left them like this, things might become dangerous, given the characteristics of this world’s undead.</p><br/><p>“It is commonly accepted that leaving corpses untended will result in undead spawning. What do you plan to do?” Ainz asked the soldiers who had been following them.</p><br/><p>“Yes, sir. We will clean them up,” the commander answered. “Well, we say clean, but it’s more like dumping them into the Great Rift in a place where it won’t matter even if we attract a monster.”</p><br/><p>“And after that, you’ll need to repair the fortress, and then find out how the Quagoa attacked? It seems you have a lot of work ahead of you.”</p><br/><p>They would part ways here. The only people who would be taking part in the reclamation of the Dwarven Capital were Ainz, Aura, Shalltear and Gondo. Well, the Hanzos were around as well, but they did not need to know that.</p><br/><p>The Dwarves smiled bitterly. While it was true that the investigations were risky — they ran the risk of encountering Quagoa, after all — it was nothing compared to Ainz’s task of attacking the Quagoa main camp. That was probably what they meant.</p><br/><p>“Then, we’ll enter the fortress. We will go in first to ensure it is safe, so wait outside until then. To be on the safe side, could you protect Gondo?”</p><br/><p>After the commander replied in the affirmative, Ainz stepped through the open door.</p><br/><p>As he stood at the center of the tragedy, Ainz asked Aura (who was standing behind him) a question.</p><br/><p>“Aura, can you sense anyone using a stealth ability to hide here?”</p><br/><p>“Nope. There’s nothing alive in this fortress.”</p><br/><p>Aura put her hand on a long ear, and made a listening gesture as she answered. If Aura the ranger said so, then there would be nothing living within this fortress.</p><br/><p>Still, they could not lower their guard.</p><br/><p>The person who had defeated Ainz’s Death Knights should have passed through here. If that person had taken a lot of stealth-specialized classes, they might be able to deceive Aura’s perceptive abilities.</p><br/><p>Still, anyone like that would generally have poor attack power, and they would be easy to deal with even if they launched an ambush.</p><br/><p>There were many corpses within the fortress, but unlike the sloping passage from earlier, there were Dwarven corpses everywhere.</p><br/><p>Ainz passed through the fortress and towards the gate which was opposite the one through which they had entered. After opening the gate, he saw the Great Rift yawning before him, and not even Ainz’s vision could see its bottom.</p><br/><p>Since there were no Quagoa beyond, it would seem they had retreated without setting up a base of operations here..</p><br/><p>“This should be the Great Rift…”</p><br/><p>Ainz turned to look from left to right.</p><br/><p>“But there doesn’t seem to be anything like a suspension bridge here… no, is that a bridge stump? If that’s there, then that means…”</p><br/><p>“It might be that the the enemy destroyed the bridge during their retreat,” Shalltear said from the side.</p><br/><p>“Hm…”</p><br/><p>If their enemy was a powerful being who could easily defeat a Death Knight, was there a need to destroy the bridge? If this was meant to block their attack, that meant that they were not confident in their strength — No.</p><br/><p>Ainz shook his head.</p><br/><p>Death Knights were rare in this world. Thus, the enemy must have surmised there was a powerful entity controlling the two Death Knights. That being the case, losing the bridge would not be a big loss.</p><br/><p>“Not bad… Tell the Dwarves that the path is safe.”</p><br/><p>“Understood!”</p><br/><p>As he watched Shalltear head towards the Dwarves, he saw Aura squatting down. He wanted to ask what she was doing, but given her diligent expression, it would be best not to interrupt her focus.</p><br/><p>Ainz turned to look at the Great Rift, then picked up a stone and threw it in. There was no particular meaning to it; he had done so on a whim. Still, he could not hear the stone striking the bottom.</p><br/><p>“Its depth is unknown, Your Majesty,” said the commander whom Shalltear had brought back with her. He must have seen what Ainz was doing. “We’ve sent two expeditions to investigate, but neither of them came back.”</p><br/><p>“I see. There were probably monsters there. …Have those things ever come out?”</p><br/><p>“Sir, there hasn’t been anything like that to date. Therefore, we decided not to send in expeditions. Probing too deep would be unwise.”</p><br/><p>“Well, that’s right.”</p><br/><p>Ainz could make incorporeal undead like ghosts, and by using magic to share their senses, he would be able to mount a full investigation. However, now was not the time for that sort of thing.</p><br/><p>Given the present circumstances, investigating the Great Rift was a low priority. Still, it had to be done. In YGGDRASIL, places like this often concealed valuable items or dungeons.</p><br/><p>If the shitty devs had their way, they’d hide a tunnel at the bottom of the Great Rift, and there’d be rare ores inside that tunnel. No, they’d definitely do that. In fact, it’s happened before.</p><br/><p>“—Then, we shall cross to the other side, pursue the fleeing Quagoa, and press them back into the Royal Capital, then.”</p><br/><p>The flight spell was still in effect, so that was not a problem in itself. However, what worried Ainz was whether or not something would crawl out of the darkness.</p><br/><p>It was an incident from YGGDRASIL, but Ainz could not help but recall the time when he had been crossing a lake and spotted a giant serpent-like monster swimming below. It was not a pleasant memory, but that experience had been put to use in the creation of the 5th Floor—</p><br/><p>After bidding the commander farewell, the four of them took flight, with Shalltear and Aura looking out below them. His worries from just now were ill-founded, and they reached the other side without seeing anything else below.</p><br/><p>That said, he breathed a quiet sigh of relief when his feet were once again firmly planted on terra firma. Granted, he had to keep it secret from the others.</p><br/><p>Ainz surveyed his surroundings.</p><br/><p>There were only four enemy corpses here, which meant that the Death Knights had been defeated in this place.</p><br/><p>“Shalltear, there are a few things I need to tell you now.”</p><br/><p>After calling Shalltear to him, Ainz glanced at Aura, and saw her inspecting the ground.</p><br/><p>Perhaps it would be better to call Aura over as well. He thought that, but then he mused that he wanted to have Shalltear take the lead this time round. He could explain a simplified version to Aura afterwards.</p><br/><p>“Hang on a bit, Ainz-sama!”</p><br/><p>Shalltear took out a notebook and flipped it open.</p><br/><p>“Please, go on.”</p><br/><p>“Oh. Umu. A notebook, huh… Very attentive of you. Ahem! Er— we are now about to enter a very dangerous area. As for why it is dangerous, that’s because there is a being who can defeat two of my Death Knights. While comparing Death Knights to you is something of an insult—”</p><br/><p>“—It’s nothing of the sort, Ainz-sama. I will use my full strength to do battle with any powerful being who could defeat the Death Knights you created.”</p><br/><p>“No, you must not use your full strength.”</p><br/><p>“Why, why is that? If the enemy is strong, shouldn’t I attack in earnest — forgive me for asking such a question of you, Ainz-sama!”</p><br/><p>“Not at all. Your question is very sensible.”</p><br/><p>Ainz put his hands behind his back, and then told her how to deal with an unknown enemy.</p><br/><p>“That said, you must be aware of how the opposition expects us to act. What the enemy wants most is information — our fighting ability, in other words. They might use expendable ambush troops and the like to gauge our combat strength. In other words, they will verify our abilities and when they feel they can achieve victory, they will attack us in such a way that they cannot lose and we cannot flee.”</p><br/><p>“To think they would actually do that…”</p><br/><p>“Granted, we don’t know if the enemy will go that far—”</p><br/><p>“Ah… Ainz-sama…”</p><br/><p>Aura called to him in a nervous tone, something which was very unusual for her. Under normal circumstances, he would stop his explanation to Shalltear and listen to Aura.</p><br/><p>However, he was in a very good mood since this was a chance to speak at length about one of his specialties.</p><br/><p>Therefore, Ainz turned to Aura and put his index finger to his mouth.</p><br/><p>“Ah, yes!”</p><br/><p>Understanding dawned on Aura. Ainz was giving an earnest lecture, so he wanted her to be quiet. She understood what Ainz was trying to say.</p><br/><p>“Like I was saying, Shalltear. I would do the same thing if I were fighting a strong foe. No, my friends would do the same as well.”</p><br/><p>“The Supreme Beings would do that too? But, comparing this enemy to the Supreme Beings is a little…”</p><br/><p>“Really? You should assume that the enemy can do everything I can do. Only a fool thinks that they are special and gets full of themselves. Remain ever-cautious. In any case, I do not wish to let the enemy see our full fighting strength.”</p><br/><p>Keeping the Hanzos in hiding was also to disrupt the schemes of the enemy.</p><br/><p>“Therefore, Shalltear, I will lay several restrictions on you when you are travelling with me to the Dwarven Capital — before we reach the enemy’s headquarters.”</p><br/><p>“Yes! What sort of restrictions are these?”</p><br/><p>“Umu. Concerning magic… while I permit you to use spells of up to the 10th tier, you are not to use too many different spells. At the very most, limit yourself to one or two of them.”</p><br/><p>“…I see, this is to deceive the enemy and make them overconfident, and then defeat him with a counterattack. That being the case… why not limit me to 5th-tier magic or lower?”</p><br/><p>“No, the enemy will not be lulled into a false sense of confidence that way. In the moment that the enemy thinks they have the measure of our true strength and seeks to utterly destroy us, we have a chance to strike a fatal blow to the enemy. In my case, if I saw the enemy attack me with just a few techniques and no spells beyond the 5th tier, I would immediately conclude that the enemy was trying to keep their abilities a secret.”</p><br/><p>“In that kind of situation, what would you do against that sort of enemy?”</p><br/><p>“I’d think of how to learn more about them. For instance, I’d briefly abandon an expendable base. Then, I’d slowly gather intelligence. Once the enemy gains a base, they’ll feel the desire to hang on to it. That sort of attitude will limit the enemy’s actions, and they’ll invariably reveal their true colors.”</p><br/><p>“Is there a need to be that cautious?”</p><br/><p>In a game, one could still recover from a loss. However, in this world, there was the chance that they would not be able to bounce back. This was especially true when it came to Ainz, who had not yet finished his experiments on player deaths.</p><br/><p>“All these are things you do in response to the circumstances. Shalltear, you need to think, no?”</p><br/><p>In any event, he should leave things at that. Ainz turned towards Aura.</p><br/><p>“Then, Aura, what is it?”</p><br/><p>“No, it’s nothing.”</p><br/><p>Aura’s eyes were sparkling.</p><br/><p>He had no idea what had brought that on, but perhaps she had felt impressed by the tactics he had explained to Shalltear.</p><br/><p>Hm~ it might be the absolute basics, but I guess I should give Aura some guidance too, no? Should I lend out that book of PK tactics? But that’s the only thing I have which gives me a leg up on the NPCs… What should I do. Also, letting information spread too widely isn’t good, someone told me that before…</p><br/><p>Just as Ainz fell into thought, Gondo spoke up.</p><br/><p>“Ah, I’m sorry to interrupt you while you’re discussing strategy, but shouldn’t we move forward? If the path collapses, we’ll have to find another route.”</p><br/><p>“That’s true… Shall we travel by magical beast?”</p><br/><p>“It might be better not to. We might encounter small passages along the way, and if we’re mounted, we’ll have to leave the beasts there.”</p><br/><p>He had thought of using a ridable undead creature like a Soul Eater. He could simply re-create one if there were any problems. However, it would be wiser to listen to the words of his guide.</p><br/><p>“I understand. Let’s go, then.”</p><br/><p>***</p><br/><p>“His Majesty has set out!”</p><br/><p>As they heard this, six of the Dwarven Councillors — the High Priest of Earth, the Director of Food Production, the Cabinet Secretary, the Brewmaster, the Master of Caves and Mines, and the Merchant’s Guildmaster — shivered in delight.</p><br/><p>It was true that the Sorcerer King had not done anything so far. Still, they could not rest at ease when an undead being — one who hated the living — of such power walked the streets.</p><br/><p>The people here were gathered to ensure the safety of the city and its people. Thus, they had to consider the worst possible scenarios that might result before committing to a course of action. For instance, the Sorcerer King might have suddenly turned violent and begun massacring children. These worries plagued them all day, and they considered various countermeasures and useful proposals.</p><br/><p>Now that the object of their whispered discussion was no longer here, what was wrong in savoring the sweet release from their burdens?</p><br/><p>“Bring the wine! Bring the wine!”</p><br/><p>Just as the parched earth craved the rain, alcohol was essential for exhausted hearts to heal.</p><br/><p>Nobody could possibly object to that.</p><br/><p>“Still, he’ll be back, right?”</p><br/><p>The air turned stagnant all of a sudden, and a gloom settled across all of them.</p><br/><p>Their pumped fists sank powerlessly down.</p><br/><p>“Should we run?”</p><br/><p>“Where can we go? If we flee after signing that pact with him… Also, we asked him to reclaim the Royal Capital for us, right? If we were in his place, wouldn’t we be angry at this?”</p><br/><p>“Well, he might get angry… but I wouldn’t have the confidence to take a hardline stance against a being like that.”</p><br/><p>“Ah. Yes, I understand how you feel.”</p><br/><p>“…Is that really alright? What happened to your pride, Merchant’s Guildmaster?”</p><br/><p>“Ah, it’s not as though we could make a fair deal with such a thing, right? Generally speaking, deals can only be made between two equal parties in equal circumstances, right? Therefore, it’s de facto impossible to make a proper deal with someone who’s far more powerful than you.”</p><br/><p>The Dwarves sighed as one.</p><br/><p>Nobody here felt that the Sorcerer King would fail to reclaim the Royal Capital. That much was obvious just by glancing at the magical beasts he left behind. And then, he was a person who had the luxury of leaving behind monsters like that when he knew there was a Dragon waiting for him.</p><br/><p>“Then, let’s change the subject. Can anyone estimate when he’ll return?”</p><br/><p>“How would we know? It’s not as though we can ask the man himself. If he chuckled and said ‘Right now’, I’m pretty sure I’d piss myself.”</p><br/><p>Those were shameful words, but none of the Dwarves laughed at them.</p><br/><p>“…It can’t be helped. If he did that to me, I’d piss myself too.”</p><br/><p>“Same here. I might even shit my pants.”</p><br/><p>They looked at each other as they uttered those crudities.</p><br/><p>“Have we learned anything new? Do we know anything about that Gondo?”</p><br/><p>“Nothing at all, only that he gathered the runesmiths.”</p><br/><p>“The runesmiths? Was it about going to the Sorcerous Kingdom?”</p><br/><p>“Who knows? Why don’t we summon one of them and ask him about it?”</p><br/><p>“That’s a good idea, but it’ll tip our hand to His Majesty, no? It’s too dangerous to act rashly. Only an idiot would touch a heated crucible, after all.”</p><br/><p>“If that’s the case, then we’ll have to tell the runesmiths that we want them to go to the Sorcerous Kingdom. Then we can casually ask them about it. How about that?”</p><br/><p>“…I’m not confident in my ability to do so.”</p><br/><p>The Dwarves murmured, “Me too” in response.</p><br/><p>“Alright, then let’s forget about asking them. It would be foolish to dig needless holes and end up falling to our deaths.”</p><br/><p>Everyone here agreed with that. If they angered Ainz by prying too deeply, many lives might be lost.</p><br/><p>“Then, let’s inform the two of us who aren’t here about tomorrow’s business and not to interfere with the smiths. I heard the commander-in-chief will be coming here afterwards, but what about the forgemaster?”</p><br/><p>“I’ll go, then,” said the Cabinet Secretary. “I’m interested in the sort of masterpiece he’ll produce. Also, I’m wondering what sort of metal the Sorcerer King gave him.”</p><br/><p>“He only said it was a rare metal, but you can’t get any rarer than adamantite, can you?”</p><br/><p>“So it would be more like orichalcum, then?”</p><br/><p>The Dwarves were an underground race. Even if their jobs had nothing to do with metallurgy, they would be very interested in a metal they had never seen before.</p><br/><p>“If only we could grab him and make him show us. He’s been very busy of late, right?”</p><br/><p>After receiving the metal from the Sorcerer King, the Forgemaster hurriedly returned to his workshop. Everyone knew the reason for his haste, and so they did not stop him.</p><br/><p>“Well, the smithing should be well under way, considering it’s him. Making a chain shirt ought to result in a few extra loops, so maybe we could borrow a few of those.”</p><br/><p>After a chorus of approvals, the Council session dissolved.</p><br/><p>After that, their tired bodies craved rest, but the Dwarves were a race which hosted drinking parties even as they spoke of taking a break.</p><br/><p>“Wine tastes especially good at the workplace,” they said as they downed special, Dwarf-only beverages with high alcohol content. Amidst all this, the Cabinet Secretary suddenly thought of something snuck out of the meeting room that was now a beerhall.</p><br/><p>Needless to say, he was going to meet the Forgemaster.</p><br/><p>The Forgemaster’s workshop was huge, as befitted a man who was responsible for the Dwarven nation’s blacksmithing. In all likelihood, it was one of the biggest buildings in Feoh Gēr. It employed many Dwarven artisans and its heat — which could melt adamantite — and the pounding of its hammers on anvils had never stopped before.</p><br/><p>However, it was silent today — an occurrence which made the Cabinet Secretary’s hairs stand on end.</p><br/><p>He was sure that the crucibles were lit.</p><br/><p>That was because the temperature went up as he neared them.</p><br/><p>In that case, what was the reason for this silence?</p><br/><p>The Cabinet Secretary quickened his pace, as though impelled by the unease flowing out of him.</p><br/><p>He had come here before, so there was no hesitation as he plunged in towards the crucible where the smiths should have been working.</p><br/><p>He saw the blacksmiths, all of whom were familiar faces.</p><br/><p>Unable to help himself, he sighed in relief. However, when he noticed the worried looks on the blacksmith’s faces and the direction where they were all looking, the unease which seized his heart seemed to come back to life.</p><br/><p>“What’s wrong?”</p><br/><p>As he called out, the eyes of the blacksmiths lit up, as though their savior had arrived.</p><br/><p>“He’s locked himself in there and refuses to come out.”</p><br/><p>Apart from its gigantic crucibles, this foundry also contained a workshop for the personal use of the Forgemaster, although it was closer to a miniature foundry in its own right. The Forgemaster was a dedicated worker, and when handling important projects, he would often lock himself inside and not emerge for several days.</p><br/><p>That was a fairly common occurrence. The Forgemaster’s disciples and the other blacksmiths should not have had that distressed look on their faces.</p><br/><p>“…It’s not strange, is it?”</p><br/><p>“It’s true that he locks himself up fairly often… but there’s no sound of hammering. And it’s been half a day — no, almost an entire day.”</p><br/><p>“…So maybe he’s just drawing up the plans for the design?”</p><br/><p>“That’s never happened before.”</p><br/><p>The Cabinet Secretary stroked his beard.</p><br/><p>He did not feel this was particularly surprising. However, if the forgemen all felt the same way, then it should probably be an emergency.</p><br/><p>“Then why don’t you open the door? Is it locked?”</p><br/><p>“No, it’s not locked. However, whenever the Forgemaster retreats to that room, he hates people opening that door.”</p><br/><p>“I see. …So you want me to open it, am I right?”</p><br/><p>It would be difficult for the Forgemaster’s disciples. But someone of an equivalent rank might have a better chance of not incurring the Forgemaster’s wrath.</p><br/><p>I drew the short straw. Well, it can’t be helped.</p><br/><p>“I understand. Then, let me do it. You lot should go first. Just take it as though I insisted on going in myself and you won’t get involved.”</p><br/><p>After the smiths thanked him, the Cabinet Secretary stepped up and knocked on the door.</p><br/><p>However, there was no response, no matter how many times he knocked.</p><br/><p>Fearing the worst, he flung the door open with all his might.</p><br/><p>It was the same familiar room. Surprisingly, there was no heat, even though he was only a door removed from the huge crucible. That was due to magical air conditioning. When he shifted his gaze, he saw a crimson flame blazing within the depths of the crucible.</p><br/><p>And then, he saw someone facing the fire.</p><br/><p>What, he’s there, isn’t he? Just as the Cabinet Secretary was about to sigh in relief, he once again held his breath.</p><br/><p>That was because he could sense something strange and inexplicable in the air. Why was the Forgemaster silent? According to the smiths outside, he ought to have reacted immediately to the intrusion.</p><br/><p>“Oi.”</p><br/><p>Those words were little more than an exhaled breath, but the man should have heard it. Yet there was no response from the Forgemaster.</p><br/><p>“Oi!”</p><br/><p>The Cabinet was nervous now and he shouted, but as expected, the Forgemaster did not react.</p><br/><p>Panting heavily, he advanced to the Forgemaster’s side.</p><br/><p>“—Hey!”</p><br/><p>“What?”</p><br/><p>An answer at last. The Cabinet Secretary almost collapsed on account of the strength fleeing his limbs.</p><br/><p>“What? What? Don’t make me—”</p><br/><p>The Cabinet Secretary’s words trailed off.</p><br/><p>Why had the Forgemaster not turned around to look at him?</p><br/><p>Worried for his friend, the Cabinet Minister circled around to look at his face.</p><br/><p>He looked different from usual — as though he were a hunted animal. More important than that, he had a ghastly expression on his face, as though he was ready to massacre his own people.</p><br/><p>“…What happened?”</p><br/><p>The Forgemaster’s face finally moved in response to the words which had slipped out by themselves. No, only his eyeballs moved, turning to look at the Cabinet Secretary’s face.</p><br/><p>“What happened? What… happened? Hmph!”</p><br/><p>The Forgemaster’s hand moved. He picked up his tongs, plucked out the searing-hot metal ingot from the fires of the crucible, and then chucked it at the Cabinet Master.</p><br/><p>“Uwaaaaah!”</p><br/><p>The Cabinet Minister scrambled away desperately, and the ingot landed on the ground with a thud.</p><br/><p>“You bastard! Are you trying to kill me?!”</p><br/><p>He could not tolerate this, not even from a friend.</p><br/><p>However, the Forgemaster smiled coldly.</p><br/><p>“Kill you? Well, you’d think that.”</p><br/><p>Then, he reached out and grabbed the ingot. Blacksmiths typically wore heat-resistant gloves, but the shocking thing was that the Forgemaster did not. Neither was he wearing any magic items that bestowed such an effect.</p><br/><p>He had grabbed the heated metal ingot with his bare hand.</p><br/><p>So reckless and ridiculous was that move that the Secretary imagined he could smell and hear the Forgemaster’s flesh sizzling. The Forgemaster practically spat his words out at the wide-eyed Cabinet Secretary.</p><br/><p>“It didn’t heat up!”</p><br/><p>“What, what did you say?”</p><br/><p>“This damn thing won’t heat up at all!”</p><br/><p>Before he knew it, the Cabinet Secretary had caught the ingot tossed his way. For a moment, he imagined that it was emitting a searing heat, but t was not hot at all. In fact, it was surprisingly cold.</p><br/><p>“What, what is this?”</p><br/><p>That was a pointless question. In all the Cabinet Secretary’s knowledge, there was only one thing which corresponded to the description of a metal that did not get hot even when heated. Thus, the question was merely a formality.</p><br/><p>Indeed, the Forgemaster’s next words confirmed his suspicions.</p><br/><p>“It’s the ingot that damned undead gave me! I’ve heated it for an entire day and it won’t get hot! I’ve hammered it and it won’t change shape! I can’t even leave a mark on it! How the hell am I supposed to make armor with this?!”</p><br/><p>“You, you don’t think he gave you a metal even he couldn’t work with?”</p><br/><p>“I’d like to think so too. But look, there’s a shortsword made of the same metal! I can mark the ingot with it! The hell does ‘most experienced craftsman’ mean?! I’m nothing more than an idiot who can only stare dumbly at a hunk of unknown metal!”</p><br/><p>The Cabinet Secretary struggled to think of how to comfort the high-strung Forgemaster.</p><br/><p>“Then, then what if you asked that undead being how to work it—”</p><br/><p>“Those who ask when they don’t know are wiser than those who don’t ask when they don’t know? Something like that, right? That’s true. The dwarves of days past do have a point. But — what does my experience count for? Look at these hands.”</p><br/><p>He forcefully thrust them out. They were a pair of craftsman’s hands; thick, heavy and scarred from old burns. Any artisan could take pride in such hands.</p><br/><p>“I’ve touched metal ever since I was a stupid disciple. I’ve done it longer than anyone else, until now. Because of that, it was only natural to be praised as the most outstanding artisan of my peers. And the reason for that is because I worked harder than anyone else!”</p><br/><p>The Forgemaster’s face was twisted into knots.</p><br/><p>“I’ve given my life to blacksmithing. I don’t think anything is impossible, and I’ve always believed that any metal can be shaped to any desired shape. —What a joke I am! Haha! What was I using to deceive myself? I was nothing more than a tiny frog in a well! And to think I dared call myself a genius. I was such a fool.”</p><br/><p>“No, all you need to do now is start learning again, right?”</p><br/><p>“That’s right. Yes, you’re right. Though it pains me to hear it…”</p><br/><p>The Forgemaster tightly clutched the ingot in his hand.</p><br/><p>The fact that the Forgemaster’s face had gone completely blank worried the Cabinet Secretary.</p><br/><p>“It’s fine. You’re right. All I need to do is start learning again. Then, what are you doing here?”</p><br/><p>“What am I… you… Ah, forget it. That undead king has left this city. We’ll be holding a Council meeting tomorrow, and I came to get you. Also, don’t interfere with the runesmiths.”</p><br/><p>“Is that so… I understand. Then, I’ll see you tomorrow.”</p><br/><p>The Cabinet Secretary still felt uneasy, but he could not bring himself to show it.</p><br/><p>Fatigue of the body translated to fatigue of the spirit. The Forgemaster would probably recover after a good night’s rest. After forcing himself to accept that explanation, the Cabinet Secretary returned home.</p><br/><p>However, the next day, he learned that the Forgemaster had disappeared with the ingot.</p><br/><p>2</p><br/><p>It was said that there were three trials along the way to the former Royal Capital of the Dwarves.</p><br/><p>The first was the Great Rift.</p><br/><p>Needless to say, one could not cross it on foot. Of course, one could also look for a way around it, but that increased the chances of encountering monsters. The monsters who lay in wait within such terrain were a fearsome threat to the Dwarves.</p><br/><p>It was very difficult to evade an ambush launched by monsters who could sense the footsteps of their targets and attack from underground. One false move might lead to being swallowed and digested. In addition, there were monsters who could launch psychic attacks and deliver lethal blows while the minds of their victims were still confused.</p><br/><p>In places like these, humanoids like humans, Dwarves and Elves were little more than prey animals.</p><br/><p>While the safest way across would be to take the overland route which cut across the mountain range, that path was still dangerous even for surface-dwellers. One had to worry about being attacked from above by creatures like Perytons, Harpies, Itsumades, Gigant Eagles and other monsters, as well as large flying animals. Since humans had small cones of vision above and below them, a moment’s carelessness might lead to missing an ambush from above, which in turn contained the risk of being slain in one blow.</p><br/><p>Thus, merely crossing the Great Rift was a trial in itself.</p><br/><p>Because of that, the Dwarves had built a city nearby and raised a suspension bridge. Once the bridge had fallen, nobody would be able to cross, and the Great Rift would serve as an impassable barrier to protect the city.</p><br/><p>Now that the suspension bridge had been cut by the Quagoa, the Great Rift was an imposing challenge.</p><br/><p>However—</p><br/><p>It did not bother Ainz and his company at all. After all, the use of the [Fly] spell rendered it a trivial obstacle.</p><br/><p>Then, there was the second trial — the land of molten magma.</p><br/><p>This sea of scorching heat shone with blinding radiance. It was an extremely dangerous region where inhaling a single lungful of searing air could char one’s lungs within the chest.</p><br/><p>The reason why lava could flow uncounted kilometers beneath the earth was most likely because this world was a magical one. There were naturally-formed portals which were close to [Gates] in power, and they joined the magma flows of this region to those of a distant region.</p><br/><p>Amidst this searing ocean lurked the reason why this place was considered a trial.</p><br/><p>That would be the monster who swam lazily through the scorching sea.</p><br/><p>It was a gigantic monster over 50 meters long, which resembled a fish. To be precise, it resembled an anglerfish. However, it did not have a lure on its head, but a tentacle which substituted for hands. It could seize a distant foe and deposit it into the monster’s oversized jaws.</p><br/><p>Its skin was sturdy and tough, and it grew scales like a normal fish, but their toughness far surpassed that of even orichalcum.</p><br/><p>Many monsters grew very powerful because they lived a long time. These individuals were famed as superior specimens, and in many cases they would be classified as a different kind of being from their parent race. This monster had completed a specialized form of evolution, and it had become a unique being, found nowhere else in the world.</p><br/><p>And so, these were the three rulers of Mt. Rappaslea, as linked by the [Gate]—</p><br/><p>The Phoinix Lord, who ruled the sky;</p><br/><p>The Ancient Flame Dragon, who ruled the earth;</p><br/><p>And the La-Angler Lava Lord, who ruled the underground sea of magma.</p><br/><p>If ranked by the adventurers’ difficulty estimates, the master of the molten ocean would score around 140. In all likelihood, one would not survive combat with it.</p><br/><p>Fortunately, it was poor at engaging terrestrial targets. One would not be attacked if one stayed out of the magma. However, the road to the Dwarven Royal Capital ran along a narrow, unsteady path that was only a little higher than the sea of molten rock below it.</p><br/><p>Quite a number of Quagoa had fallen into the magma during their invasion. Unable to withstand the superheated air which blew up from below, their bodies trembled, which sent them plunging into the sea of molten rock.</p><br/><p>However—</p><br/><p>The crossing posed no problems for travellers prepared with fire immunity and flight magic. They flew through the air, far above the reach of the La-Angler Lava Lord, and neither party realised the presence of each other.</p><br/><p>Thus did Ainz and his company cross the sea of magma.</p><br/><p>The trials until now had been easily overcome with flight magic, so it was hard to consider them trials. However, the final trial was a challenge in the truest sense of the word, being a long, twisting and branching series of caves.</p><br/><p>It certainly qualified for the title of ”labyrinth”.</p><br/><p>Still, that alone would be too easy to count as a trial. There were no monsters in this area, so as long as one spent time on making a map, one could eventually overcome it. And if that were all that were to it, then it would only qualify as a trial to those who lacked food and water — or, in other words, those with limited time.</p><br/><p>Yes — there was another reason why this place was considered a trial.</p><br/><p>This area was filled with vents which spewed plumes of volcanic gases at regular intervals, and there were places where the gases collected. In other words, it was a hellish area of invisible, fatal poison, lashed by fierce winds.</p><br/><p>There were several routes which led to the exit, but there was only one which did so and also avoided the gas. Even that route might end up being filled with gas if one did not traverse it quickly enough.</p><br/><p>Even the use of the [Fly] spell — which had trumped every challenge thus far — would only allow them to scrape along the ceiling. The sprayed gas would fill even the air up there with poison as well. At most, all the spell would do was allow one to avoid the areas where the gas had settled and collected.</p><br/><p>However—</p><br/><p>Ainz and the Guardians had adequate countermeasures against gas-vector attacks, so it posed no problems to them. Rather, the only one who might be affected by gaseous attacks was Gondo. The undead had their immunities, and gases which did not inflict acid or fire damage would not harm them at all. Aura had a magic item which surrounded her in a bubble of fresh air, so mere gas counted for nothing against her.</p><br/><p>In other words, as long as Gondo was protected by magic, he could walk safely through the billowing vapors of death.</p><br/><p>And so, the three trials — terrain hazards which were deemed impassable to those without preparation or prior knowledge — were easily conquered by Ainz and his party.</p><br/><p>Ainz’s spell — the [Bless of Titania], which told its userthe best way through a dungeon — slowly faded away. That was either a sign that its duration had expired, or that its purpose had ended.</p><br/><p>“…Hm. It looks like there’s a fresh Quagoa corpse inside that cave. But we haven’t caught up with their unit yet. I guess a day makes a huge difference.”</p><br/><p>“Still, we’ve closed the gap greatly. We’ve almost caught up with them now,” Aura said after inspecting the footprints on the ground.</p><br/><p>“…Really now. Then, let’s discuss what we’ll do afterwards. …Gondo, we’ll be reaching the Royal Capital soon, right?”</p><br/><p>“Yes. I’ve only heard of it in legends, but if those caves were the legendary Maze of Death, then we ought to be there soon.”</p><br/><p>A bitter expression came over Gondo’s face.</p><br/><p>“Was that really a Maze of Death, though… The legends said that those who didn’t know the way would only find death at the end of their journey…”</p><br/><p>Ainz could not answer that question. After all, it had been too simple a challenge. Perhaps it was only a ruse, designed to trick the opposition into thinking they had cleared it before the true trap was sprung. That was not entirely out of the question.</p><br/><p>“…When that happens, all we need to do is break through any traps that await. That said, stepping into a preset snare is the height of foolishness. Let’s slow down and advance while staying alert.”</p><br/><p>They had been moving at great speeds to catch up with the enemy. However, they had not caught up with them yet, even after coming all the way here. They should rethink their strategy while operating under the assumption that the enemy had already returned to their base.</p><br/><p>“Then, we shall consider what we will do after reaching the enemy headquarters.”</p><br/><p>After verifying that everyone had nodded, Ainz turned towards Gondo.</p><br/><p>“To begin with, Gondo and I will take on the Royal Palace. I will handle the Dragon there.”</p><br/><p>Neither the Guardians nor Gondo objected to this.</p><br/><p>The highest-ranked Dragons were some of the strongest opponents in YGGDRASIL. It was very dangerous to move separately from the Guardians while they did not know the enemy’s strength. However, Ainz possessed a World-Class Item. It possessed many powers, and one of them was very effective against Dragons. Therefore, even in the worst-case scenario, he ought to be able to escape it.</p><br/><p>In contrast, if he brought the Guardians with him and the enemy was more powerful than expected, then he would have to work harder in order to make his escape.</p><br/><p>With Gondo around, the worst that could happen was that Ainz would have to abandon him. He could not abandon the lives of his friends’ children. Therefore, the best solution was to not have them with him in the first place.</p><br/><p>Dragons, huh… I’m looking forward to this.</p><br/><p>In YGGDRASIL, Dragons were mighty foes and also a bounty of riches.</p><br/><p>They dropped good data crystals, and they had a higher chance of dropping artifacts than normal monsters. One could harvest their skin, meat, blood, fangs, claws, eyeballs, scales and other body parts for various uses.</p><br/><p>One could say they were delicious enemies.</p><br/><p>Knowing that he would soon encounter his first Dragon in this world filled his heart with a blend of unease, anticipation and desire. Ainz was so delighted that he was barely able to contain himself.</p><br/><p>According to the Dwarves, the mighty Frost Dragon which had laid waste to the Western city might be there. If things went poorly, he might face another battle with questionable odds of victory, much like the one with Shalltear.</p><br/><p>Could the Dragon have defeated the Death Knights? I can still manage if it was the same entity, but it’ll be troublesome if there was another one. Should I remain hidden and bring up everyone except the Hanzos — no, this ought to be the right choice.</p><br/><p>“—Ainz-sama?”</p><br/><p>“Hm? Ahh, Shalltear. Forgive me, I was lost in thought. Then, I shall give you two your orders as well. Aura and Shalltear, you are to face the Quagoa and have them submit to my rule. If they dare to refuse, then show them the power of Nazarick!”</p><br/><p>The two Guardians replied with forceful affirmatives.</p><br/><p>Ainz’s gaze shifted to Gondo. He did not look like he had anything to say. That attitude seemed to imply that he would go along with any decision Ainz made.</p><br/><p>While Ainz had agreed to clear out the Quagoa, Ainz did not intend to completely exterminate them. He simply felt that the genocide of a race which did not exist in YGGDRASIL was a bit of a waste. Indeed, killing them all might eliminate this race from the world. No, even if that were not the case, they might end up being beneficial to Nazarick in the future.</p><br/><p>Of course, they might also be harmful to Nazarick. However, extirpating them before verifying that was something of a waste.</p><br/><p>Extermination is easy, but revival is difficult. Thus, there’s only one path I can take. And besides—</p><br/><p>“If they are fools who will not swear their loyalty to me, then reduce their numbers to around 10’000 or so. Try and keep the strong ones alive. However, after considering future issues, do not select them purely based on strength. You must make sure an equal number of them are female. In addition, you must not let any of them escape, do you understand? Especially the one that is the equivalent to their king.”</p><br/><p>“But… Ainz-sama…”</p><br/><p>Ainz urged Aura — who looked depressed — to continue speaking.</p><br/><p>“We don’t know exactly how large the Dwarven capital is, but it seems like quite a large area. It’ll be difficult for just the two of us to ensure that none of the Quagoa escape from such a broad space. What should we do?”.</p><br/><p>“Hm. A reasonable question. Because of that — Aura, it’s time for you to shine. Use the World-Class item I gave you earlier.”</p><br/><p>“Is, is that really alright?”</p><br/><p>“Umu. This is when it should be put to use.”</p><br/><p>“I, I understand!”</p><br/><p>Tension was written all over their faces.</p><br/><p>“While that there are no use limits on that World-Class item, if the enemy fulfils certain conditions and escapes, ownership of the Item will automatically shift to them. That is the worst-case scenario and must be avoided at all costs.”</p><br/><p>Ainz recalled the incident where Ainz Ooal Gown had seized possession of it.</p><br/><p>How many mails had the enemy sent, begging them to “give it back”?</p><br/><p>Ainz snorted.</p><br/><p>“If you didn’t want to lose it, shouldn’t have used it,” was the matter-of-fact reply. Nothing was more stupid than a guild which could not accept such a rational conclusion. If they did not want it to be taken, they should have stashed it in their treasury and never taken it out. Therefore, Ainz kept harping on it, even though he felt that there would be no problems with its use.</p><br/><p>“Also, you must be cautious of foes you cannot suck into it, because such enemies possess World-Class Items as well.”</p><br/><p>“That means you won’t be able to enter either, right, Ainz-sama?”</p><br/><p>“Not when it opens up. However, there are ways to go in if you choose to do so. You need to pay attention to the time lag when that happens… Alright, let’s go, then.”</p><br/><p>Led by Aura, the group set forth.</p><br/><p>Perhaps they were near the former Dwarven Royal Capital, but even the naturally-formed caverns were easy to traverse. All the stalactites and stalagmites had been cut down, probably for convenience of passage. They walked on for a time, surrounded by the labor of the Dwarves.</p><br/><p>Aura — who walked at their head — suddenly stopped. Then she cupped her hand to a long ear, listening intently.</p><br/><p>Ainz and the others kept quiet, waiting for Aura to give the word.</p><br/><p>“Ainz-sama, I can hear many living beings ahead, numbering in the hundreds. I can’t gauge the exact distance, but I think we’ll make contact with them within minutes.”</p><br/><p>“Hoh… have we caught up to them?”</p><br/><p>“No, they don’t sound like they’re moving. It feels like they’re waiting…”</p><br/><p>“I see. Did they sense our pursuit? Are they ambush troops?”</p><br/><p>If that were the case, they had probably used some sort of divination magic to spy on Ainz and the others.</p><br/><p>Ainz smiled thinly.</p><br/><p>Until now, he had not let the enemy observe their power. Because of that, they wanted to throw their unit against Ainz and observe their abilities.</p><br/><p>From the enemy’s resolve and actions, he could sense their anxiety and willingness to sacrifice lives to learn about them. It made Ainz feel that he had won his battle of wits against his opponent.</p><br/><p>“Ainz-sama, shall we capture them?”</p><br/><p>“Hm, come to think of it, we haven’t shown too much of our abilities to the enemy yet. Therefore, let’s gather some information before we roll over their headquarters in one fell swoop.”</p><br/><p>“Understood!”</p><br/><p>In addition, even if they did learn about them, they could not devise a counter-strategy that easily.</p><br/><p>There were two main types of characters in YGGDRASIL.</p><br/><p>There were those who specialized in a certain field, and those whose abilities were evenly distributed.</p><br/><p>In the former case, even if one learned about an enemy, they would have a hard time dealing with them if the information did not pertain to their specialty. In the latter case, they might be able to deal with them, but given the even spread of their foe’s abilities, said countermeasures against them would not be foolproof.</p><br/><p>Of course, there might be people like Ainz who knew many spells and who possessed many items left behind by their comrades, and were thus able to adapt to many circumstances, or someone like Touch Me with very high overall stats, but those were the exception to the rule. Therefore, there was only one thing they had to worry about.</p><br/><p>…The number of powerful entities. The fact that I don’t know that figure scares me a little. Given that I can’t fully verify that particular point, I should probably keep the idea of retreat in mind — hm. Well, in any case, we can’t proceed without punching them to see what the enemy has up their sleeve. —Ohh, the spirit of Yamaiko-san is possessing me…</p><br/><p>“Shalltear. You are not to go berserk this time, alright?”</p><br/><p>“Of course!”</p><br/><p>Shalltear readied her Spuit Lance.</p><br/><p>“Very good. Normally, we should avoid revealing the fact that we possess divine-class items to the enemy. However, they won’t be able to see through it without very good detection skills. Alright, go.”</p><br/><p>“Understood!”</p><br/><p>***</p><br/><p>In Feoh Berkanan — the stately, magnificent former Royal Capital of the Dwarves, built during the flower of their civilization — the largest building besides the Royal Palace was the Merchant’s Guild, because it contained many rooms used during meetings and temporary vaults used to briefly store resources.</p><br/><p>This building was used by many Dwarves, and it was larger than any other structure in the city. However, it was now the residence of the Lord of the Quagoa Clans, Pe Riyuro.</p><br/><p>By the time Yozu returned, Riyuro was seated — almost sinking — into a large and soft cushion. His attitude was one which carried on as normal, without entertaining the possibility of anger or anxiety, even after hearing about Yozu’s failure.</p><br/><p>Yozu bowed, and described what had happened.</p><br/><p>While the important details had already been sent via messenger, he was here to explain the details. In particular, he needed to thoroughly elaborate on the Dwarven Kingdom’s trump card, the black suits of armor which he had seen with his own two eyes.</p><br/><p>Riyuro listened in silence, and then he slowly moved his hand, reaching into a cage beside him. He withdrew a squeaking lizard; a fat, round and juicy lizard, a snack fit for a king.</p><br/><p>Riyuro extended the hand holding the lizard toward Yozu.</p><br/><p>“—Want a bite?”</p><br/><p>“No, no thank you.”</p><br/><p>“Really now,” Riyuro muttered. Then he crushed the lizard’s head with his jaws, and Yozu smelled the faint scent of blood and innards.</p><br/><p>All 20 centimeters of the lizard disappeared into Riyuro’s mouth within three bites.</p><br/><p>Riyuro wiped his bloodstained hands and mouth clean with a nearby towel.</p><br/><p>“—And so you retreated. What of your pursuers?”</p><br/><p>“We’re unsure of that. However—”</p><br/><p>Since the suspension bridge had fallen, he did not think the enemy would continue their pursuit. And frankly speaking, they had the Dwarves by the throat. All the Dwarves could do was reinforce their defenses, find and seal off the flanking route, and then perhaps they might mount a counterattack on this place.</p><br/><p>The reason why they had only committed those two suits of black armor was either because they were foolish enough to split their forces or because that was the sum of their military power.</p><br/><p>That was Yozu’s opinion, which he shared with Riyuro.</p><br/><p>“It wouldn’t be strange if there were one or two more of them.”</p><br/><p>Riyuro seemed to have sensed Yozu’s unconscious display of surprise. He poked repeatedly at the lizards in the cage while lazily explaining his meaning.</p><br/><p>The Dwarves were confident in their fortress’ defense. If it was brought down, they would feel that the chances of their city being conquered were very high. Therefore, it was not wrong to assume that the black suits of armor they had sent out were a significant portion of their total number.</p><br/><p>However, since they did not know how exactly the fortress had been conquered, committing all their forces to the frontlines was a dangerous gamble. If there were multiple avenues of infiltration, then they might be lost.</p><br/><p>While it was not a situation where they could dole their fighting strength out bit by bit, they did not have the information to commit their entire force to a counterattack either.</p><br/><p>Therefore, even if there were more, there would only be one, maybe two more. This was what he had come up with.</p><br/><p>Yozu felt that it was exactly as the Lord had said, and he was filled with awe at the wisdom of his Lord.</p><br/><p>“Then, who do you think can defeat those Golems?”</p><br/><p>“I am certain that you could defeat it, my Lord!”</p><br/><p>Riyuro was the mightiest being among the eight clans of the Quagoa. Indeed, his fighting ability was exemplary.</p><br/><p>He might well be able to fight the entire Quagoa race by himself and emerge victorious. There had never been anyone as powerful as him in the history of the Quagoa.</p><br/><p>Yozu recalled the sight of Riyuro battling a monster in the past. He was absolutely confident that Riyuro’s might was superior to that of the Golems.</p><br/><p>“Dispense with the pleasantries. Do you truly think so?”</p><br/><p>“Yes! I do think so!”</p><br/><p>Riyuro chuckled bitterly, but Yozu’s reply was earnest. He had no answer besides that.</p><br/><p>“…Which Clan were you born in?”</p><br/><p>A surprising question. After Yozu stated his birth clan, Riyuro fell into thought once more.</p><br/><p>“I see… In that case, you must really think I can win, then?”</p><br/><p>“What, what does that mean?”</p><br/><p>“I simply suspected that you might consider this a chance to eliminate me. It is true that I am stronger than anyone else in the entire species. Because of that, you might seek to have me battle the Golems after underestimating their strength. Then, the Golems would kill me. Well, if you did that, then nobody would be able to defeat the Golems… but they would be damaged during their battle with me, and then you might be able to crush them with numbers.”</p><br/><p>Although the Lord to which he had pledged his loyalty cast his suspicions upon him, Yozu’s heart was filled with nothing but respect.</p><br/><p>If he were in Riyuro’s place, he might not have thought so deeply into the issue.</p><br/><p>Yozu firmly believed that Riyuro was the true Lord of the Quagoa, and his loyalty deepened ever further.</p><br/><p>Riyuro did not quite understand the man before him, and asked Yozu a question.</p><br/><p>“…Why did you not immediately answer that you had no such intentions?”</p><br/><p>“Yes! My, my deepest apologies! I was merely entranced your deep insights, my Lord! As you have said, I harbored no such intentions!”</p><br/><p>Riyuro laughed loudly.</p><br/><p>“What an interesting fellow you are! …The men I granted you were lost for nothing, so there must be a punishment for that. But I will not inflict wounds upon you, which might affect your future development. In truth, you learned about the Golems and returned here after realizing that it was important information. In addition, your anticipation of enemy pursuit and the allocation of part of your troops to the defense of the city shows your keenness of thought.”</p><br/><p>“Thank you very much!”</p><br/><p>Yozu bowed deeply.</p><br/><p>“Now, I have a question for an excellent leader like you. How shall we gather more information about those Golems?”</p><br/><p>“By attacking the shorties’ nation.”</p><br/><p>“That is one way to go about it. If you do so, we might be able to learn if there are truly Golems in reserve.”</p><br/><p>“Yes! If there aren’t any more, then we must conquer the city as soon as possible no matter the losses we suffer.”</p><br/><p>“Umu”, Riyuro nodded.</p><br/><p>If it was a matter of lives, then much time would be needed to bear and raise them. However, Golems only needed to be built. Time was not on their side, but on the enemy’s.</p><br/><p>“What other methods are there?”</p><br/><p>“Forgive me, but I cannot think of any at the moment.”</p><br/><p>Riyuro thrust his hand into the lizard-filled cage and withdrew another lizard.</p><br/><p>“…Would you like one?”</p><br/><p>Do I look that hungry?</p><br/><p>It was true that he had fled back here with all his strength, and he had not even eaten or rested properly so far. However, he was not thirsty or hungry enough to beg from the king’s table.</p><br/><p>“No, thank you.”</p><br/><p>“Really now,” Riyuro replied. Then, he chewed off the lizard’s head like he had the previous one. After devouring it like before, Yozu asked Riyuro a question.</p><br/><p>“Then, my Lord. Have you thought of any other methods?”</p><br/><p>“Ah, yes. We can ask that fellow. His wisdom is far beyond mine… Although, the troubling thing is that the payment he demands will be equally high.”</p><br/><p>“By payment you mean… could it be!”</p><br/><p>Yozu immediately guessed it from those words.</p><br/><p>“Correct. We must give the Dragons—”</p><br/><p>Just as Riyuro was about to speak, there was a disturbance from outside, and then the doors swung open with a great crash.</p><br/><p>“Clan Lord!”</p><br/><p>It was one of the guards.</p><br/><p>“Looks urgent, what happened?”</p><br/><p>“Yes! There seems to be someone headed toward this city!”</p><br/><p>“Where are they coming from?”</p><br/><p>According to the guard, they had come from the flank where Yozu had positioned his troops. In other words, they had come from the Dwarven nation.</p><br/><p>“So they’ve sent out pursuit troops… I underestimated the stunties.”</p><br/><p>With that, Riyuro rose to his feet.</p><br/><p>Yozu’s eyes seemed to ask him where he was going. Riyuro sensed this, and replied:</p><br/><p>“It seems we’ve been saved a lot of decision-making. I will go meet the Dragons now.”</p><br/><p>“Are you going to ask about the Golems?”</p><br/><p>“No. I’m going to convince them to deal with the approaching stunties. Since they’re stunties, they’ll have their Golems in tow. Then, we should have them fight the Dragons and weaken both sides. …Hmph. Might as well let them earn their keep.”</p><br/><p>The Clan Lord was deeply furious about how the Dragons had taken the best spot in the city — the Royal Palace — for their own. This was something which only his most trusted confidants knew, in addition to how the Clan Lord had cleverly hidden those feelings and bowed to the Dragons.</p><br/><p>There was an overwhelming difference between the power of Dragons and the Quagoa.</p><br/><p>Therefore, they had to feign an air of servitude until they could pare down the Dragons’ strength. However, there were very few beings who could fight on even terms with the Dragons in the mountain range. With one notable exception aside, those would probably be the Frost Giants.</p><br/><p>And now the chance had come, Riyuro said.</p><br/><p>“Yozu, it’s not too likely, but just in case, begin moving toward the ruins district. I don’t want you to get involved in the battles of Dragons.”</p><br/><p>One district of the Dwarven Royal Capital had been completely destroyed before the Quagoa had taken it over. The Quagoa had not rebuilt this area, in order to use it as a staging ground to gather a vast army. It would seem that it would finally be put to use.</p><br/><p>“Understood.”</p><br/><p>“Then… can you help me prepare some offerings for the meeting with the Dragons? They like jewels, so prepare some of them. I trust you also know that they’re very greedy and won’t agree to the initial payment right away. They’ll surely raise their price. With that in mind, prepare some lower-valued items as well.”</p><br/><p>After nodding to Riyuro to show he understood, Yozu immediately began the preparations.</p><br/><p>***</p><br/><p>The mightiest species in this world were the Dragons. There were races which could adapt to the harsh lands where humanity could not reach. The Azellisia Mountain Range was no exception, and the Dragons ruled the roost here.</p><br/><p>These Dragons were known as Frost Dragons.</p><br/><p>Usually, Dragons had slender bodies. Those did not resemble the crawling forms of lizards so much as they did those of cats. Among them, Frost Dragons were even slimmer, like snakes.</p><br/><p>Their scales were bluish-white, but as they grew older, they turned the white of snowfall. Having adapted to their environment, they possessed cold immunity, but in contrast, they were vulnerable to fire.</p><br/><p>In addition, there was the trump card of the Draconic races. They possessed the fearsome power of freezing Dragon’s breath.</p><br/><p>The Lord of these Frost Dragons, Olasird’arc=Haylilyal, coiled around his throne, looking down on the Quagoa who craved an audience with him.</p><br/><p>“So, you have come. What is the matter?”</p><br/><p>“Yes, I am deeply honored to be granted an audience with the mighty White Dragon Lord, Olasird’arc=Haylilyal—”</p><br/><p>“—Dispense with the formalities. Get to the point.”</p><br/><p>That said, Olasird’arc’s eyes narrowed slightly.</p><br/><p>Being a Dragon Lord had a special significance among Dragons. It was a title only given to those who had reached the highest age category (Ancient) among the Dragons, or powerful Dragons who possessed special powers, or those Dragons who could use exotic magic. These outstanding Dragons were awarded the title of Lord.</p><br/><p>Being addressed by such a glorious title was quite pleasing.</p><br/><p>“Yes! Firstly, I wish to thank you for granting an audience.”</p><br/><p>The Quagoa waiting behind the Quagoa Lord produced a beat-up old sack.</p><br/><p>They opened it, and as expected, the glitter of gold spilled forth.</p><br/><p>It was not enough to satisfy him, but that amount should have been all the Quagoa could manage, so he had to bear with it.</p><br/><p>“Alright then, what do you want.”</p><br/><p>“Yes! In truth, there are some uninvited guests with designs upon our homes, so I was wondering if we could call upon your matchless might, White Dragon Lord-sama.”</p><br/><p>“Hm…”</p><br/><p>To Olasird’arc, Quagoa were an inferior species. They were beings who should revere the mighty Dragons, and they were comparable to his possessions. It was somewhat aggravating to allow them to be killed at will. However, it was equally infuriating for him to have to take action on the behalf of such inferior lifeforms.</p><br/><p>Olasird’arc’s gaze fell upon his glittering throne — a small mountain of gold and precious stones.</p><br/><p>One habit which united all Dragons was the love of precious metals, jewels, magic items and related wealth. Olasird’arc was no exception in this regard.</p><br/><p>However, while he might be able to dig tunnels and excavate precious metals or raw gemstones, he could not process them. In addition, the mighty should not be doing such things. That was what slaves were for.</p><br/><p>Thus, it did not matter if he roused himself to labor on the behalf of his slaves. His heart surged with such generous feelings.</p><br/><p>“And who are these people?”</p><br/><p>“We are not sure. We have not grasped their true identity yet. However, they should be Dwarves.”</p><br/><p>“Dwarves. …Umu.”</p><br/><p>Olasird’arc glanced at the great door behind him.</p><br/><p>Behind that door was the Dwarven City’s former treasury.</p><br/><p>No matter how many times Olasird’arc had attacked it, it had not opened or been destroyed. The protective magic worked on it by the Dwarven runesmiths had defended their treasures from all the attacks he had brought to bear on it.</p><br/><p>His obsession with the contents of the vault had long faded, and that door was little more than a scratching post for his claws. However, when he heard about the Dwarves, the smoldering embers in his heart ignited once more.</p><br/><p>If these Dwarves could make it here, perhaps they might have a way to open this vault.</p><br/><p>Is it time to abandon the Quagoa? The Dwarves are more useful, in various ways.</p><br/><p>As Olasird’arc contemplated these matters, he glared coldly at the Quagoa beneath him, and the Quagoa Lord’s pleas finally came to an end.</p><br/><p>“I am sure that you will be able to defeat the Dwarves or whatnot with contemptuous ease, White Dragon Lord-sama. Please, lend your strength to us! Needless to say, when they are defeated we will offer up double the sum from just now, no more than that!”</p><br/><p>His greed tickled by that last line, Olasird’arc’s face twitched.</p><br/><p>“…I see. I shall consider it.”</p><br/><p>“Please wait! White Dragon Lord-sama, the enemy is close! And the Dwarves seek to retake this city!”</p><br/><p>Olasird’arc turned his keen gaze upon the Quagoa.</p><br/><p>“What do you mean by that? Are you implying that these measly Dwarves can evict me from my nest?”</p><br/><p>“I did not say that! But, there’s no telling what the Dwarves intend to do! For all we know, they might have a way to destroy this city!”</p><br/><p>“Do you not think they would have done so already if that was the case?”</p><br/><p>“It is very likely they intend to destroy the city from the inside!”</p><br/><p>“Hm,” Olasird’arc thought. It seemed a little far-fetched, but it could not be entirely ruled out.</p><br/><p>This place was absolutely necessary for the creation of a Draconic Empire.</p><br/><p>After claiming the Dwarves’ Royal Palace, he had ordered his wives to lay their eggs here, and then raise his children as they grew.</p><br/><p>In the past, they had randomly found a place to lay eggs and left them there, or kicked them out of the nest a year or two after they were born. That would not strengthen the Draconic race.</p><br/><p>I must increase the number of my offspring, and then subjugate the Frost Giants. Then, I can completely dominate this mountain range, Olasird’arc had thought.</p><br/><p>The Frost Giants and the Frost Dragons were the apex predators of this mountain range. Therefore, they had struggled for a long time to determine who was the top dog.</p><br/><p>The Frost Giants were immune to cold, which meant that the Frost Dragons’ trump card of icy Dragon breath could not harm them. The power of the massive weapons which the Frost Giants wielded could not be overlooked, even by Dragons. If they came in numbers, the Dragons might well be defeated. Indeed, there were Frost Dragons who had lost to Frost Giants, and who were used as hounds by them.</p><br/><p>Naturally, the Frost Dragons knew that too. If Olasird’arc were one of them, he would not miss the chance to destroy a powerful foe before their numbers could increase. If he had to abandon this territory, then the Frost Giant tribes would surely unite to attack them before he could seize a new seat of power.</p><br/><p>Olasird’arc regarded his concubines, sprawled lazily around the room.</p><br/><p>They were three female Dragons.</p><br/><p>There was the youngest of them, with a single alabaster horn, Mianatalon=Fuviness.</p><br/><p>The one who had fought with Olasird’arc for territory many times, Munuinia=Ilyslym.</p><br/><p>And then there was the only Dragon in residence here who could use divine magic (albeit only of the 1st tier), Kilystran=Denshushua.</p><br/><p>“What do you think?</p><br/><p>“…Why not help them? After all, the miserable little Dwarves are hardly fearsome foes.”</p><br/><p>“I agree too. Frankly speaking, I don’t care what they say. But if the Dwarves attack, knowing that we’re here, that would be equivalent to looking down on us. We ought to carve fear into the hearts of those cocky little creatures.”</p><br/><p>He turned his gaze from Muninia — who was scratching at the floor with a sharp claw — and towards Kilystran.</p><br/><p>“And what say you?”</p><br/><p>After addressing Kilystran, she tilted her head.</p><br/><p>“I oppose and approve of it. I oppose it because we cannot be sure that these attackers really are Dwarves. In addition, if they’re attacking while aware of our presence, they must have surely taken our power into consideration. However, while the very idea of destroying the city is absurd, a mechanism capable of doing so is not out of the reach of Dwarven technology. It would be foolish not to respond to that.”</p><br/><p>Olasird’arc smiled bitterly. She had such a twisted personality. That was why he liked her.</p><br/><p>“So, the ayes have it. —Well then. I shall accept your request, inferior Quagoa.”</p><br/><p>“Yes! You have our deepest thanks!”</p><br/><p>As Olasird’arc glared coldly at the Quagoa kowtowing before him, he made a pronouncement.</p><br/><p>“However, you must offer ten times the previous amount of tribute.”</p><br/><p>“Ten! Ten times?!”</p><br/><p>Olasird’arc snorted at the Quagoa Lord, who had raised his head.</p><br/><p>“You do not even know who is attacking. That much should be expected. …Then, what will you do? If you cannot produce the requisite amount, then you can deal with it yourselves.”</p><br/><p>“Please, please wait! We will offer the tribute! Please let us offer the tribute!”</p><br/><p>Suddenly, Olasird’arc thought of something.</p><br/><p>Could the Quagoa actually pay that much gold? Or was it because the Dwarves were unimaginably powerful foes, which was why they were trying their best to get him to commit no matter how much they had to pay?</p><br/><p>Well, it doesn’t matter. If they can’t pay, then just as Munuinia said, I will carve an indelible terror into the hearts of those weaklings (Quagoa).</p><br/><p>“Then, begone.”</p><br/><p>“Yes! But… when can we expect your arrival?”</p><br/><p>“Soon. Until then, wait.”</p><br/><p>“Yes!”</p><br/><p>As Olasird’arc watched the Quagoa leave, Mianatalon asked: “Will you be going in person?”</p><br/><p>“As if. Of course not.”</p><br/><p>Olasird’arc was the most powerful Dragon here. That being the case, it would be foolish for him to actually fight on the behalf of his slaves even if he was paid. Therefore—</p><br/><p>“Who should I send over… Whose child would be best?”</p><br/><p>They were all his children. Every Dragon here with the exception of his concubines was bound to Olasird’arc by blood.</p><br/><p>“In that case, send my child.”</p><br/><p>“Yours? Who?”</p><br/><p>Kilystran had birthed four children for Olasird’arc, and each of them was a Dragon of over a century of age. They were far more powerful than the Quagoa.</p><br/><p>“The eldest, of course.”</p><br/><p>“Hejinmal, then?”</p><br/><p>Olasird’arc frowned.</p><br/><p>“That boy might look like that, but he has a good head on his shoulders and he will see the opposition for what they really are. If they turn out to be Dwarves, don’t you think he’ll bring about a most agreeable negotiation? You must be starting to tire of Quagoa slaves, no?”</p><br/><p>“Can he do all that? Can the other children not do it?”</p><br/><p>Olasird’arc agreed with what Munuinia said.</p><br/><p>“Better than Toranjelit, at least.”</p><br/><p>“…Kilystran. The most important thing for Dragons is the power of their bodies. One cannot defeat power and speed with one’s head. Olasird’arc beat me because his body was stronger than mine. Remember that. Toranjelit’s superior body is far better than that of Hejinmal’s!”</p><br/><p>Toranjelit was one of Olasird’arc’s children by Munuinia. In terms of raw strength, he was the best among his offspring.</p><br/><p>“But things will turn out poorly if you don’t think. If you send out your child — who might kill the Quagoa for no reason — who knows what they’ll end up doing?”</p><br/><p>“That’s enough.”</p><br/><p>Olasird’arc halted Munuinia, who was about to say something, and then looked at Mianatalon’s face. She seemed to find all this squabbling terribly boring.</p><br/><p>“Let’s go with Kilystran’s idea and call Hejinmal over.”</p><br/><p>“It’s no use. He won’t come.”</p><br/><p>Olasird’arc sensed his plan falling apart right from the start.</p><br/><p>Munuinia chuckled, a thin, unhappy sound. It would be troublesome if they argued again, and Olasird’arc raised his voice.</p><br/><p>“Just break down the door or whatnot and drag him out.”</p><br/><p>“Ara, I didn’t destroy your fortress because you asked me not to. Does that mean you’re giving me permission? Although, it may not just be the door that gets destroyed.”</p><br/><p>Indeed, he remembered saying those words. While Dragons were skilful, they could not rebuild a door once destroyed, and they did not know magic which could do that. Therefore, if they destroyed something, they would leave it where it was.</p><br/><p>As the White Dragon Lord, it would be a shame to live in a castle filled with holes. Therefore he had demanded his concubines and his offspring adhere to that rule.</p><br/><p>Although his concubines would probably go if he ordered—</p><br/><p>“It can’t be helped. I’ll go, then.”</p><br/><p>“Please.”</p><br/><p>Olasird’arc looked at Kilystran with an indescribable expression on his face.</p><br/><p>The fact that he had to go in person despite being a Lord did not sit well with him. In response to that, should he allow a few Quagoa to live here and let them work for him?</p><br/><p>However, Olasird’arc abandoned the many possibilities which appeared in his mind.</p><br/><p>He could not bear the thought of having inferior lifeforms like the Quagoa running around his fortress. Someday, when he defeated the Giants, he would have them work for him as slaves.</p><br/><p>Until then, he would have to bear with it.</p><br/><p>***</p><br/><p>When one considered the height of the Dwarves, their Royal Palace was of a staggering size. It was because it was so large that the Dragons could live here, and it was a long distance from one end to the other.</p><br/><p>Olasird’arc climbed and climbed, until he reached the door on the highest level.</p><br/><p>Then, he shouted:</p><br/><p>“It’s me, open up.”</p><br/><p>He waited for a while, but there was no movement from the other side of the door.</p><br/><p>It was impossible that he was not in. The son who lived in this room was a hikkikomori. He had not recalled him ever leaving his room. Even his meals were sent to him by his siblings.</p><br/><p>It was deeply aggravating that he would dare pretend he was not in, in front of his own father, a Dragon Lord.</p><br/><p>“I’ll say it again. It’s me. Open up.”</p><br/><p>Dragons had very keen senses. The way he was shouting, anyone inside should have heard it, and they would have woken up even if they were sleeping.</p><br/><p>However — the door did not open.</p><br/><p>The anger which blazed up turned into motion.</p><br/><p>He lashed out at the door with his tail.</p><br/><p>Struck by a tail that was the size of a log and sheathed with scales that were harder than steel, the door creaked as it twisted. The Dwarves who had built this door had probably not expected it to take a Dragon’s tail slap.</p><br/><p>There were signs of movement inside, but this was not enough to quell Olasird’arc’s anger.</p><br/><p>He slammed the door again, breaking it half down. Shattered and scattered stones flew inside like buckshot.</p><br/><p>A distasteful “Hieeeeee” came from within.</p><br/><p>“Get out of there, right now!”</p><br/><p>In response to the angry shout, a Dragon sprang up.</p><br/><p>Frost Dragons had slender bodies, but not this one. Simply put, it looked obese.</p><br/><p>It had a pair of tiny glasses on its nose, and it regarded Olasird’arc from head to toe with a nervous look in its eyes.</p><br/><p>This was his son, but this shameful display made Olasird’arc sigh.</p><br/><p>Well, given that he was standing in front of a ruler like himself, cringing and twitching like this was unavoidable. Still, he had hoped to see some strength in his own son’s eyes.</p><br/><p>And then there was that disgusting fat body of his. He was more like a swine than a Dragon.</p><br/><p>In truth, having to send a child like this out to fight on his behalf might dmage his reputation.</p><br/><p>As Olasird’arc contemplated this, his son — who seemed afraid of the way his father was staring right at him — ventured a question.</p><br/><p>“F-father, what, what do you wish of me?”</p><br/><p>That said, he might not be much of a Dragon, but he was still a Dragon. Dragons grew more powerful with age. With that in mind, perhaps even that flabby frame of his could still be of use.</p><br/><p>“I have a job for you, Hejinmal.”</p><br/><p>“A, a job?”</p><br/><p>“Ahh. The Quagoa seem to have been invaded by the Dwarves or something. Repel them.”</p><br/><p>“Hieee.”</p><br/><p>“Hieee?”</p><br/><p>“N-nothing. It’s nothing, Father. J-just, I, I’m, er, how shall I put this, I’m er, not very confident in my strength…”</p><br/><p>“Then what are you confident in? Do you feel you can defeat the enemy with magic?”</p><br/><p>Dragons slowly gained the ability to use arcane magic during their maturation, but those were little more than innate abilities. They could not be compared to magic casters at all. However, there were some Dragons who had learned to use actual magic.</p><br/><p>For example, there was one of Olasird’arc’s own concubines, Kilystran=Denshushua. There was also one of the Republic’s Councillors, the “Blue Sky Dragon Lord” Suveria=Myronsilk, who had the powers of a druid and could use divine magic. It was also said that in the far east, there were Dragons who had attained the Paladin class and who could use magic from other systems.</p><br/><p>“…Well, that’s one thing. I had to learn by myself because I had no mentor to teach me…”</p><br/><p>“Then what the hell have you been doing in there all this while?”</p><br/><p>There was a forceful gleam in Hejinmal’s eyes.</p><br/><p>“Learning. I’ve been gathering knowledge.”</p><br/><p>“…What? Knowledge? Weren’t you learning how to use arcane magic?”</p><br/><p>“No, it’s not like that, Father. The knowledge I sought was not to use magic, but to further my studies, learn how this city was built, what sort of races live in this world and so on. I was learning about that sort of thing.”</p><br/><p>“…I don’t understand at all. Does learning these things make you strong? None of that matters if you don’t become powerful.”</p><br/><p>There was nothing more important in this world than becoming stronger. Since this was a world where only the strong survived, one needed to grow stronger to live. In contrast, one could say that not wanting to become strong was essentially rejecting life.</p><br/><p>Just then, he spotted it. Hejinmal had tried to cover it up, but he saw that his son had done something, like a wordless gesture.</p><br/><p>“What is it? Spit it out.”</p><br/><p>His son remained silent. That disgraceful attitude of his made Olasird’arc flare up again.</p><br/><p>Just as he was about to begin bellowing at him, he thought of why he had come here.</p><br/><p>While he did not care what happened to the Quagoa, debts had to be paid.</p><br/><p>“It doesn’t matter if you lock yourself up in your room until you lose your agility, but there’s no point losing yourself in books. If you want to acquire knowledge, leave this place and travel the world.”</p><br/><p>Olasird’arc had already begun losing interest in Hejinmal. He had abandoned his body in exchanged for something utterly useless. There was nothing else he could say about this, and he had lost any semblance of concern for his own son.</p><br/><p>“I, I was preparing for that. If I don’t know what sort of people there are in the world, I might die before I manage to see it.”</p><br/><p>“Then why don’t you die? ─ You’re being too foolish. Why not seek strength from the beginning? Once you’re strong, you’ll be feared even when you leave this place, no? Like me.”</p><br/><p>“But, Father. Knowing what sort of powerful beings there are in the world is very important too. It’s the same with you, isn’t it, Father? Aren’t the Frost Giants strong? If you went against them without knowing anything─”</p><br/><p>“─I’m not afraid of those Frost Giants.”</p><br/><p>“F-forgive me, Father.”</p><br/><p>As he glared at Hejinmal, who had his head plastered to the ground, Olasird’arc rounded his shoulders powerlessly.</p><br/><p>“That’s enough. I command you to complete your task. Then, I will kick you out after a month. You can live as you please from then on.”</p><br/><p>3</p><br/><p>“Haa~”</p><br/><p>Hejinmal was currently in a tunnel which led to the Royal Capital. He sighed, the way his father had.</p><br/><p>“I’m not good at fighting…”</p><br/><p>“Not being good” did not cover the whole of it. In all honesty, he was so weak that if he went up against his younger brothers, he might end up losing to them. Thus, he was uneasy, which resulted in him muttering to himself.</p><br/><p>“The enemy… hopefully they’ll be scared of the way I look and run away.”</p><br/><p>Hejinmal inhaled forcefully, sucking up his protruding gut. Then he splayed his claws and opened his maw. That way, he would look more like a proper Dragon.</p><br/><p>“Oh, I almost forgot.”</p><br/><p>Hejinmal gingerly removed the glasses on his nose. They were not a magic item, but if they broke, there would be no replacements for them. Thus, he had to treat them with care.</p><br/><p>“Haaa… Dragonscale makes for strong armor… but all I can do is pray the Dwarves aren’t savages…”</p><br/><p>But what if they were?</p><br/><p>No, that was almost certain to be the case. That was because Dwarven libraries were the source of much information about Draconic materials.</p><br/><p>Hejinmal forced himself to stop trembling.</p><br/><p>He knew all the Quagoa in the Royal Capital were watching him. If possible, he would have preferred to fight in a deeper tunnel, where he would not have an audience. However, if that was the case, the Quagoa would not be able to see him do battle, so his father had forbidden it.</p><br/><p>Father had told him to investigate the enemy to the best of his ability, and take them as servants if possible. But this was not a sign of friendship. Instead, it was an order to display his strength and dominate the weak as one of the strong.</p><br/><p>Therefore, defeat equalled death. He would die if he was defeated in battle. Even if he survived a defeat, the Quagoa would lose their respect for Father. That would displease him, and then Hejinmal would be killed by his father anyway.</p><br/><p>Then, how about fleeing right away? After all, he would be exiled in a month, no matter what he did.</p><br/><p>It was a good idea, but he needed a month to prepare for it.</p><br/><p>Hejinmal expelled his breath.</p><br/><p>The supercooled suspire froze an entire wall into an expanse of solid white.</p><br/><p>“Good! My breath is normal, and its power is consistent with my age.”</p><br/><p>This was one of a Dragon’s trump cards ─ Dragon breath. Frost Dragons possessed freezing breath, and its power grew with age. Hejinmal’s breath was quite well developed, and it was more reliable than his own physical strength.</p><br/><p>“…Still.”</p><br/><p>Dragon breath was a frightening thing. Anyone who knew even a little about Dragons was aware of that. After all, this was a fundamental ability of all Dragons.</p><br/><p>In fact, the Dwarven libraries had said just that. There was no way the Dwarves coming this way would not be prepared for it.</p><br/><p>Hejinmal sank further into despair.</p><br/><p>Although Father had already said so, if he could really use magic or whatnot, things would surely be different─</p><br/><p>“I’m just a sacrificial pawn.”</p><br/><p>His brothers faithfully obeyed his father in a very Draconic way. The fact that he had not given this task to them but to Hejinmal was a sign that he did not care if the hikkikomori of his family died off.</p><br/><p>He did not resent his fate.</p><br/><p>If he had not encountered books, if he had not known the satisfaction of seeking knowledge, he would not be what he was today. There was no point regretting that now.</p><br/><p>Suddenly, Hejinmal’s nose twitched.</p><br/><p>He turned his ear to listen, and picked up multiple footsteps approaching from within the tunnel.</p><br/><p>Those were not the sounds of Quagoa feet, because they were clearly wearing shoes.</p><br/><p>Are those Dwarves?! There’s only a few of them, which means… They’re very confident of victory with just those numbers? Or are they an advanced scouting party? So if I defeat them the job’s done and there’ll be no problem if I go back?</p><br/><p>Strictly speaking, he would have fulfilled his orders even if he only defeated that scouting party. The question now was whether an excuse like that would be accepted.</p><br/><p>Illuminated by glowing stones, four silhouettes ─ though he could not be sure as they were still far away ─ emerged from the cavern.</p><br/><p>Are the smaller three Dwarves? Then what’s that larger one? Even the Dwarven subraces shouldn’t be that big. Then, did the Dwarves beg that bigger shape for help, much like the Quagoa did with Father?</p><br/><p>Whether or not the Dwarves had requested its help, he had to be wary of the bigger shape.</p><br/><p>Still, while it was a large silhouette, it was still much smaller than a Dragon.</p><br/><p>Should I strike first with my breath? Hejinmal immediately discarded that notion.</p><br/><p>No. I should ask them what they want and try to complete this task through negotiation.</p><br/><p>Regular Dragons would immediately launch into a fight. However, Hejinmal had no confidence in himself and did not want this encounter to end in tragedy. Therefore, he sought a way to safely resolve the situation.</p><br/><p>Finally, his keen Draconic vision ─ although Hejinmal’s was somewhat subpar for his kind ─ finally verified that the one walking at the head of the group was not a Dwarf.</p><br/><p>Haven’t I read about them in a book before? Isn’t that one of the Dark Elves, who live in the depths of the forests?</p><br/><p>It was impossible for one to be here.</p><br/><p>However, that one’s far too short, compared to the Dark Elves in the books. Could it be a child between a Dark Elf and a Dwarf? Or is it just a Dark Elf child?</p><br/><p>As Hejinmal pondered these things and many others, he shifted his gaze to the huge shadow behind the Dark Elf, and then his eyes went wide.</p><br/><p>Haaah?! Isn’t that an Elder Lich?! What is it doing here? This is bad. They’re immune to freezing breath, and they can cast [Fireballs].</p><br/><p>Fire was the weakness of Frost Dragons. In other words, his most powerful attack was useless against this Elder Lich, and his opponent could grievously wound him.</p><br/><p>And… What’s that? It looks like a really expensive robe…</p><br/><p>Dragons had a keen nose for treasure. They could roughly sniff out the value of any item, no matter how valuable. Right now, his nose was telling him that the Elder Lich before him was wearing an unimaginably expensive set of spellcaster’s robes.</p><br/><p>…No, at a closer look, it’s the same way with the clothes of the Dark Elf walking ahead of them. I’ve never seen something as valuable as that before…</p><br/><p>Hejinmal was a hikkikomori, so the only thing he could value was the Dwarven libraries. Thus, his nose for valuable treasure might have lost its keenness. It might have been a natural ability, but it would still atrophy if it was not used. However, he did not think that was the case.</p><br/><p>And then, the shadow after that looks female… Isn’t that a Dwarf as well? It’s not a Dark Elf, and neither is it an Elder Lich. Then… an Elf? Or a human? I don’t get it. Still, she looks like she’s wearing very expensive clothing too. …Hm, is my nose not sensitive any more? But if that’s not the case…</p><br/><p>Finally, he saw the Dwarf at the rear of the group, and Hejinmal was relieved.</p><br/><p>Just a regular Dwarf, and he’s not wearing anything valuable.</p><br/><p>Then, Hejinmal shook his head.</p><br/><p>That’s being too naive, right? The three people in front of him are anything but normal. Maybe this Dwarf is something special too. Carelessness is dangerous.</p><br/><p>After that, the Dark Elf pointed towards him, as though to tell everyone that he was there.</p><br/><p>Although he thought he might be suddenly attacked ─ by a [Fireball], in particular ─ the opposition merely paused to confer, and soon they were headed towards Hejinmal again.</p><br/><p>…Should I prepare myself for the worst?</p><br/><p>If they had attacked immediately, he would have gone on his guard. But that was not the case. What should he do now?</p><br/><p>Nggg ─ my stomach aches. I hope that’s just a kind-hearted undead being who’s come to negotiate!</p><br/><p>He could be killed. To Hejinmal ─ who had lived in safety all his life ─ the time until the group stopped was interminable torment.</p><br/><p>The group finally reached Hejinmal’s vicinity.</p><br/><p>Hejinmal took a deep breath, and then ─ careful not to seem too imposing ─ he spoke.</p><br/><p>They were a group who had approached Hejinmal, a Dragon, without any hesitation. Therefore, Hejinmal sensed that trying to appear threatening would be very dangerous.</p><br/><p>“The area from this place on belongs to the Quagoa and we Dragons. Why ─ ahem ─ may I ask you fine folks your reasons for coming here?”</p><br/><p>The Dark Elf standing at the head of the group changed places with the Elder Lich. In that moment, he realised who was the leader of the group.</p><br/><p>“Hm? We’re about to launch an attack and there’s only one Dragon here? The Dragons I know of grow stronger with age ─ in other words, their bodies get larger and more powerful. Given your size, you don’t seem particularly strong… What’s the meaning of this?”</p><br/><p>What did he mean by “what’s the meaning of this”? Hejinmal had no idea. However, it would seem this Elder Lich was not at all wary of a Dragon like himself.</p><br/><p>Ah, this… this is really bad. It’s so bad I can’t even describe it.</p><br/><p>“In any case, I doubt they’d send just one Dragon to collect information on us… Is this a strategy on the enemy’s part, or am I being paranoid? Given the information we got from the Quagoa we captured, probably the latter.”</p><br/><p>He had no idea what the Elder Lich was talking about from the beginning. It did not look like the Elder Lich wanted to enlighten Hejinmal either. In other words, he was probably talking to himself, but why did he feel so afraid, then?</p><br/><p>“…Thinking too much about this is annoying. Let’s see what kind of Dragon you are.”</p><br/><p>A thrill of terror shot through Hejinmal’s body.</p><br/><p>He was far too relaxed. He was talking as though he had picked up a stone from the ground. It was a tone which demonstrated his confidence in being able to do what he spoke of.</p><br/><p>And then, in the moment when he saw the Elder Lich raise his hand─</p><br/><p>“[Grasp─”</p><br/><p>“WAIT!!”</p><br/><p>After his thunderous roar, Hejinmal pressed his head to the ground.</p><br/><p>This was the greatest degree of respect a Dragon could show ─ the posture of servitude.</p><br/><p>“─Heart], hang on, what?”</p><br/><p>Hejinmal desperately pleaded with the Elder Lich, whose hand had stopped moving.</p><br/><p>“Please wait! My name is Hejinmal! May I please inquire about your mighty name?”</p><br/><p>Looking around, he saw the Dwarf’s jaw drop in shock. However, the Dark Elf and the Elf-like person did not seem surprised. In other words, this was a natural occurrence for them.</p><br/><p>Hejinmal was certain his judgement was correct.</p><br/><p>“…My name is Ainz Ooal Gown… what is the meaning of that pose of yours?”</p><br/><p>“Yes!! I believe this is the proper form of address for when humans know each other’s names, Gown-sama! This posture is is the greatest sign of respect we Dragons can show!”</p><br/><p>“Er… Then, why are you doing this?”</p><br/><p>“Naturally, it is because I immediately realized that you are an extraordinary person, Gown-sama. Could I possibly take any other position before a mighty being like yourself? No, I could not!”</p><br/><p>This was a huge gamble. He had bet everything on it.</p><br/><p>The Dwarves used “heated steel” to describe the burning sensation when gambling, but what Hejinmal felt now was a chill that froze him to the core.</p><br/><p>Time seemed to freeze over for several seconds, but finally, the Elder Lich said, “Umu. …So, you intend to submit to me, then?”</p><br/><p>“Yes! If you allow it, Gown-sama!”</p><br/><p>He peeked again, and as expected, the Dark Elf and the Elf appeared to think all this was normal.</p><br/><p>“…There are many uses for Dragon flesh, hide, teeth, scales and the like. Hm? You… raise your head.”</p><br/><p>The Elder Lich’s attitude was one that was used to giving orders, so he must have found it natural that even someone like Hejinmal had submitted so readily to him. Clearly, the Elder Lich did not consider Hejinmal worthy of mention.</p><br/><p>Dragons were the strongest species, but they were not an invincible species. Many beings could kill a Dragon. Frost Giants were a good example of that.</p><br/><p>However, if one compared the two species, in the end, Dragons were probably still stronger.</p><br/><p>The reason for that was their growth. Dragons continued growing as time passed, and they would someday grow into the strongest entities of all. They were a very long-lived species, and the fact that they could keep growing throughout it all was a form of strength in itself.</p><br/><p>From that point of view, the undead might be even stronger than Dragons. High-level undead did not grow in bodily might, but they could accumulate knowledge and experience.</p><br/><p>In addition, Hejinmal had read about legendary undead from his books.</p><br/><p>Soul Eaters, which devoured the souls of the living. Wriggle Pestilences, which spread disease. Mage cabals which gathered many undead around a core of Elder Liches. Guphandera=Argoros, the undead dragon that lurked in a mountain of the dead and used psychic-type magic. Astral Rippers, masses of shadows which stalked the Valley of Shadows, and so on.</p><br/><p>This Elder Lich must surely be a legendary undead creature whose name had gone down in the history books. However, it would seem the Dwarven libraries had not recorded it.</p><br/><p>Hejinmal slowly rosey.</p><br/><p>He felt like the Elder Lich was appraising his body. He was ashamed by his decidedly un-Draconic frame.</p><br/><p>“I see. So Dragons that live in these frigid environments store fat under their skin. Although, I thought Frost Dragons were immune to the cold… Or could it be that you were storing up nourishment in case you couldn’t obtain food?”</p><br/><p>“No, it’s not like that. I’m the only one who’s like this…”</p><br/><p>“Hooh… That is to say, you’re a rare specimen, then? Is that what you mean?”</p><br/><p>Hejinmal was not sure if he had any value for being rare, but there was nobody else in his family like him. Therefore, it was a correct statement.</p><br/><p>“That might be so, Gown-sama.”</p><br/><p>“Really now,” the Elder Lich said. Then he continued in a quieter tone.</p><br/><p>“Killing you would be a waste, then.”</p><br/><p>Hejinmal’s keen Draconic hearing picked up those words.</p><br/><p>He struggled desperately to keep his breathing under control. It would seem he had made another correct choice, which would permit him to live.</p><br/><p>“Are they any other Dragons?”</p><br/><p>“Yes, there are. There are four Dragons older than me, six around the same age as me, and nine who are younger than me.”</p><br/><p>“Hoh!”</p><br/><p>The Elder Lich seemed very happy, but Hejinmal was sure he had some sort of evil scheme in mind.</p><br/><p>“How many of them are stronger than you?”</p><br/><p>“The four who are older than me are all stronger than me. The Dragons of the same age as me are also stronger than me.”</p><br/><p>I might even lose to my younger siblings. Hejinmal could not say that. After all, if his value dropped in the Elder Lich’s eyes, he might be killed on the spot.</p><br/><p>“I see. Then, what tier of magic can these elder Dragons use? Are they only capable of arcane spells?”</p><br/><p>“The strongest of them can use magic of up to the 3rd tier. As you have said, it is arcane magic.”</p><br/><p>As Dragons grew, they naturally acquired the ability to use arcane spells even without going out of their way to learn them. However, they could only cast a few spells. Even Hejinmal’s father could only use three spells of the 3rd tier.</p><br/><p>“What? They only have 3rd-tier spells?”</p><br/><p>The Elder Lich seemed disinterested, but then he perked up as though he had noticed something.</p><br/><p>“No, I should probably ask. What if this is just a ruse? They say that a mighty eagle hides its claws. Is it possible that the strongest Dragon there can use 8th-tier spells?”</p><br/><p>“No, it’s impossible. Or rather─”</p><br/><p>Besides, 8th-tier spells could not possibly exist. Would it be better to tell him that?</p><br/><p>No, he could not. The truth sometimes hurt more than lies. If he gave offense to this undead magician, there was no way he would prosper from it.</p><br/><p>“─No. He can’t possibly use spells of such a high tier. I once heard that he had learned a 3rd-tier spell of flame resistance.”</p><br/><p>He should probably say that, right? His father was not a foe who should be underestimated.</p><br/><p>“Umu ─ I see. Well, it’s only natural that one would want to cover up one’s weaknesses.”</p><br/><p>This nonchalant tone made Hejinmal feel uneasy.</p><br/><p>“Aura.”</p><br/><p>“Yes, Ainz-sama.”</p><br/><p>It would seem the Dark Elf was called Aura. Judging by her smell, she was probably a female.</p><br/><p>The other one who looked like an Elf did not have a female scent about her. In fact, she had no scent at all, much like the Elder Lich.</p><br/><p>“I’ll give you this Dragon. I recall you said you wanted one?”</p><br/><p>“Thank you very much. But can this chap fly?”</p><br/><p>Two pairs of eyes looked at him, one filled with doubt, one apparently saying, “That’s a good question.”</p><br/><p>“I, I can probably fly.”</p><br/><p>He might have been a hikkikomori, but he ought to be capable of flight. Flying was the same as walking for Dragons. There was no way he could forget how to do so. Hejinmal gave that answer as he regretted the fact that he had not flown here.</p><br/><p>“Then, I’ll take him, Ainz-sama. Hm, then, I need to show him who’s the boss around here, and make him obey me completely.”</p><br/><p>Before Hejinmal could wonder what exactly she was going to do, he felt thousands of frigid razors impale him.</p><br/><p>He was dead. There was no doubt that he was dead. The fear which informed his instincts of that fact became invisible blades that pierced his entire body.</p><br/><p>In an instant, his mind went blank. In his diminished state of awareness, he clearly felt his heart stop beating.</p><br/><p>“Uwaaaaah─!”</p><br/><p>As he cried out, it banished the black chill crushing his entire body.</p><br/><p>His heart slowly began beating again. His limbs trembled, and his lungs struggled to pull in oxygen.</p><br/><p>He recalled something like this from a book somewhere. It was called “murderous intent”. In other words, the Dark Elf who would be his Mistress was a being who could radiate murderous intent that was powerful enough to instantly put a Frost Dragon into a near-fatal state of shock.</p><br/><p>In that case, what sort of being was the Elder Lich which she called “Master”?</p><br/><p>There was no doubt about it. He was beyond Hejinmal’s imagination.</p><br/><p>He was a being of absolute power ─ an Overlord.</p><br/><p>He had made the right choice.</p><br/><p>By the time Hejinmal had come to his senses, he found that the group had backed off, looks of surprise on their faces.</p><br/><p>Just as he was wondering what was going on, he realized the disgusting sensation below his waist. As he looked down at his feet, Hejinmal was shocked.</p><br/><p>It would seem his bladder had gone slack and he had wet himself. A puddle spread below him like a lake.</p><br/><p>“Uuu…”</p><br/><p>What should he say now? It was possible that he had displeased them and he would be killed.</p><br/><p>“I, I was so overjoyed that I peed a little!”</p><br/><p>He had abandoned all delusions of control. Though he had the feeling that they would not believe him, it was better than saying that he had pissed himself out of fear.</p><br/><p>“From today onwards, this one shall serve and attend his Mistress, Aura-sama, and offer his utmost devotion and loyalty to her!”</p><br/><p>“Ehhhh…”</p><br/><p>Hers was an expression of absolute disgust.</p><br/><p>This was bad. If she felt he was worthless, he might be discarded like a piece of trash. The mighty could do that. In fact, had his father not done the same thing? However, help came from an unlikely corner.</p><br/><p>“I see… Well, that can’t be helped.”</p><br/><p>“Eh? Really, Ainz-sama?”</p><br/><p>“Mm. I once heard about something like this from one of my friends ─ Ankoromochimochi-san. She once told me about how upset she was when her dog peed out of joy. It seems this sort of thing happens when they get too excited.”</p><br/><p>“You mean, Ankoromochimochi-sama? Really? So it’s like how Fen and some other magical beasts mark their terrain, then?”</p><br/><p>“That might well be. Granted, I’m not too clear on Draconic biology. However, that was probably the reason why that chap did it.”</p><br/><p>The being who might or might not have been an Elf had been listening quietly all this while. She tilted her head and asked the Elder Lich:</p><br/><p>“Ainz-sama, would it be better if we did it as well?”</p><br/><p>“Shalltear. Is it really appropriate to say that?’</p><br/><p>“Mm. As Aura said, if you did that, I would collapse in shock. This sort of thing is only cute on small pets. …Well, Ankoromochimochi-san was worried because that dog was getting on in years. She said something about not getting him too excited… ah, those were the days.”</p><br/><p>The air around them changed, to something that was the polar opposite of the murderous intent from just now.</p><br/><p>In any event, Hejinmal moved to wipe the soaked portion of his body on a nearby wall and scraped off the stain.</p><br/><p>“Say. What will we do next?”</p><br/><p>The Dwarf ─ who had been watching the proceedings in silence ─ finally spoke up. Hejinmal sensed that this Dwarf was unlike his three companions, in that he was not powerful.</p><br/><p>Had the Dwarves hired them as mercenaries and sent this Dwarf to keep an eye on them? If that was the case, Hejinmal would have to show this Dwarf respect as well. Still, where did he rank as their subordinate? What sort of orders would he be given from now on? These uneasy questions flew through his mind.</p><br/><p>“You have a point. We’ll leave the Quagoa to Aura and Shalltear. I shall go with this Dragon and eliminate all the Dragons opposing us.”</p><br/><p>Hejinmal’s body shuddered again.</p><br/><p>He spoke in a casual tone. Dragons were beings which he could take lightly. This was the attitude of the mighty.</p><br/><p>Hejinmal hesitated about what to do. It would probably be wise to beg for the lives of the other Dragons. After steadying himself, he spoke:</p><br/><p>“…Gown-sama, Aura-sama, may this one be permitted to speak?!”</p><br/><p>“Very well. Speak.”</p><br/><p>“Understood! A thought occurred to this one. The people here do not know the greatness of Gown-sama. Would you be willing to extend your mercy to those fools? In other words, the other Dragons should know of the glory of Gown-sama!”</p><br/><p>“Umu… what do you two think?”</p><br/><p>“Everything depends on your will, Ainz-sama.”</p><br/><p>“That’s right. We won’t object to any decision you make, Ainz-sama.”</p><br/><p>“In any case, all we need to do is chase them out of the Royal Palace, right? Ahem. Dragon, may I ask you a question?”</p><br/><p>The speaker was the Dwarf.</p><br/><p>Hejinmal glanced at his masters’ faces. In all honesty, he had no idea what sort of attitude he needed to take towards this Dwarf. That said, acting arrogant would be very dangerous. However, a servant who bowed and scraped before others would devalue their master.</p><br/><p>“Please do.”</p><br/><p>After hesitating, Hejinmal chose a short reply to avoid offending either side.</p><br/><p>“Umu… Still, I didn’t expect you could completely dominate a Dragon… No, after seeing that power of yours, it might be natural. Um, sorry. Are there any other Dragons around besides the ones in this place?”</p><br/><p>“There might be.”</p><br/><p>“There might be, huh. Then, if there were, could you order around those Dragons as well?”</p><br/><p>“I could not. They belong to a different tribe.”</p><br/><p>“Umu ─ Then we should fulfil the request to chase the Dragons out first. After that, we’ll tell them that there are other Dragon tribes around. That way, they’ll have to count on Your Majesty’s strength to protect their reclaimed Royal Capital. Surely they would not easily surrender this land which they took so long to reclaim. Is that not the most profitable course?”</p><br/><p>There was a word there which he could not ignore.</p><br/><p>It would seem this Elder Lich was a king of sorts, and his subjects were the Dark Elf and the Elf, perhaps.</p><br/><p>“Are you alright with your race being squeezed dry and used up?”</p><br/><p>What are you saying, the Dwarf’s shrugging seemed to convey.</p><br/><p>“Your Majesty has chosen me ─ us. Is it not natural that I would pick your side in any dispute?”</p><br/><p>“Thank you for your considerations, Gondo.”</p><br/><p>“Please don’t say that. I am the one who should be thanking you. The pain that has plagued me all this time has been wiped away by the few days I have spent with Your Majesty. Truly, you are my savior.”</p><br/><p>“I am pleased we have forged a mutually beneficial relationship.”</p><br/><p>“While I do not feel Your Majesty may benefit from this, I shall surely repay the kindness you have shown me.”</p><br/><p>Even Hejinmal the outsider could understand their relationship.</p><br/><p>The Dwarf was deeply indebted to the Elder Lich. It was a debt that he would pay even if he had to betray his race.</p><br/><p>“…If you feel that way, then I don’t mind…”</p><br/><p>The Elder Lich shrugged and turned to Hejinmal.</p><br/><p>“Alright. Then, take me to the Dragons you say are stronger than you. Also, where is the treasury of the former Dwarven Royal Capital?”</p><br/><p>Hejinmal knew where the treasury was, and nodded confidently.</p><br/><p>“This one feels that your question is quite fortunate, because both of them are at the same place.”</p><br/><p>***</p><br/><p>With his Master and the Dwarf on his back, Hejinmal headed to his father’s location. His body might not have been used to exercise, but it was still a Dragon’s body, and carrying two people posed no problems to him at all.</p><br/><p>He listened to His Majesty speak as he walked, and as he did, he was certain that his knowledge and instincts were the most valuable thing in this world.</p><br/><p>If he had shown the arrogance typical of a Dragon when they had first met, he would have been slaughtered. No, if he had not loudly proclaimed his allegiance and gained their interest, he would have died without ever knowing what had happened to him.</p><br/><p>It had truly been a narrow escape.</p><br/><p>Hejinmal clenched his slackened bladder.</p><br/><p>If he peed himself again, their opinion of him would not just drop to rock bottom, it would grab a shovel and continue digging underground.</p><br/><p>Fortunately, they had not encountered any other Dragons along the way. Thus, they proceeded directly to his father’s room ─ or rather, the throne room cum treasury.</p><br/><p>Hejinmal took a deep breath.</p><br/><p>“Your servant wishes to inform Your Exalted Majesty that apart from my father, there are three Dragons there who serve as his concubines. Will you be bringing that Dwarf in there with you?”</p><br/><p>If they were assailed by the freezing breaths of four Frost Dragons at once, he feared the Dwarf would be slain.</p><br/><p>“Is there a problem?”</p><br/><p>“No, not at all. If Your Exalted Majesty feels it is fine, then naturally your servant has no objections.”</p><br/><p>“I have granted him immunity to freezing cold, so it should be fine. However, it might be a little troublesome if we are subjected to numerous area-effect spells of other elements.”</p><br/><p>“Your servant feels that will not be a problem, Your Exalted Majesty. Breath weapons are the favored attacks of Dragons, and it is natural for them to open combat with their breath. They would not consider using their arcane spells, which are far weaker.”</p><br/><p>“Then it’s not a problem.”</p><br/><p>“Ah, Your Majesty. May I say something? Certainly, there is no way a mere four Dragons could begin to oppose Your Majesty. However, it would seem this one’s mother is in there. Could I ask you to spare her?”</p><br/><p>“Hm…”</p><br/><p>Hejinmal tilted his neck and awaited his Master’s judgement.</p><br/><p>Hejinmal had not intended to go so far as to ask for his mother to be spared. It would be good if she could be saved as he had been, but he did not want to bet his life on it. It was not that he hated her, but simply that the bonds of familial kinship were not very strong among Dragons.</p><br/><p>After leaving the nest, even their own siblings would become rivals for living space. In addition, it was common for the treasure-loving Dragons to fight when they saw each others’ troves.</p><br/><p>It was very rare for many Dragons ─ particularly those who had left the nest ─ to live together in one place. It would never happen at all without an overwhelmingly powerful Dragon to gather them.</p><br/><p>In that sense, his father Olasird’arc ─ who had united everyone as a family against external enemies ─ was an anomaly. One might even call him wise.</p><br/><p>“It can’t be helped. I shall try to let your mother survive.”</p><br/><p>“Thank you very much, Your Exalted Majesty.”</p><br/><p>The words of praise immediately fell from his mouth, because he did not wish to displease the person showing him such largesse. In addition, he mused that if his mother survived, the burden on him might decrease in the future. On the contrary, if there were more Dragons, his own rarity would decrease. If he did not want them to think his death would not be missed, he would have to do everything he could to please them.</p><br/><p>“Still, Your Exalted Majesty seems a bit too… eh. From now on, you may use Sorcerer King or Ainz as well.”</p><br/><p>Was it a trap, or was it a test? Without hesitation, Hejinmal spoke the words he felt were correct:</p><br/><p>“Understood, Your Majesty, the Sorcerer King!”</p><br/><p>How could he omit the respectful terms of address which Ainz was due?</p><br/><p>“Mm, let’s go.”</p><br/><p>“Understood!”</p><br/><p>He carefully hid his quiet sigh of relief .</p><br/><p>It was a test, after all. If he had been careless and failed to pay him the proper respect, he would surely have been punished appropriately. For all he knew, he might have been killed and then dissected.</p><br/><p>If there was one thing Hejinmal had engraved into his heart, it was that he must never be arrogant.</p><br/><p>Soon, they reached the doors leading to their destination.</p><br/><p>They were a set of double doors that looked like they needed a Dragon’s strength to open. Apparently, the Dwarves used a set of smaller doors beside it to enter or leave. The huge doors were only used for ceremonies and the like.</p><br/><p>Hejinmal pressed his shoulder against the doors and applied force ─ mindful not to dislodge his Master from his back ─ and pushed the doors open.</p><br/><p>He saw his father ─ Olasird’arc ─ coiled on his Golden Throne. His mother Kilystran and the other two concubines ─ Munuinia and Mianatalon ─ were also present.</p><br/><p>Three pairs of puzzled eyes trained themselves on Hejinmal. One more pair looked in a different direction ─ at the people mounted on his back. That last pair belonged to his mother, Kilystran.</p><br/><p>Before anyone else could speak, Hejinmal shouted:</p><br/><p>“He who sits upon my back is the Sorcerer King Ainz Ooal Gown! He is the king who shall rule this land and us Dragons!”</p><br/><p>Strictly speaking, he was the servant of Aura the Dark Elf. However, it would be easier for them to understand this way, and in any event, he had made this declaration after seeking and receiving permission to do so.</p><br/><p>Silence filled the room as the words faded. It took some time for the other Dragons to parse the words Hejinmal had just said.</p><br/><p>“Have you gone mad, you little whelp?!”</p><br/><p>In an instant, his father’s anger boiled over.</p><br/><p>That was only natural. His father was the lord of this land. ─No. The former lord. Thus, it was a natural reaction for him.</p><br/><p>He rose from his coiled position and took a fighting stance that would allow him to pounce right away.</p><br/><p>Hiiiieee!</p><br/><p>In truth, it was very scary.</p><br/><p>Between himself and Olasird’arc, there was no doubt that his father was stronger. It was not simply a matter of might and toughness, but there was also a vast difference in terms of battle experience. In addition, Olasird’arc’s body was also leaner and more conventional, in comparison to Hejinmal’s.</p><br/><p>Saying that Hejinmal had no chance of victory was stating the obvious.</p><br/><p>However, he had no choice but to make that declaration. According to Hejinmal’s books, no follower would ever make their master state their identity.</p><br/><p>Therefore, he secretly looked at his father with an expression which said, “it wasn’t my idea”. However, it was completely ignored. The angry glare was targeted at Hejinmal alone. In the eyes of his father, who believed that Dragons were the strongest race of all, people like his Master and the Dwarves were not worth considering.</p><br/><p>“─King of Dragons. Will you submit to me in exchange for your life?”</p><br/><p>“The hell you say, you damn Skeleton?!”</p><br/><p>How could he be a Skeleton! Hejinmal wailed internally.</p><br/><p>At the same time, there was a certain indignation, at the fact that he had not picked up on the treasures his Master wore. Perhaps he was so angry that he had not even noticed.</p><br/><p>If I hadn’t aggravated him, maybe he wouldn’t have ended up this way…?</p><br/><p>No, that was impossible. For all he knew, it might have been even worse. As Hejinmal’s mind whirled with delusions, a look of surprise appeared on his father’s face.</p><br/><p>“…No, wait. What are those clothes you’re wearing?”</p><br/><p>Perhaps after calming down somewhat, his Draconic nose for treasure had kicked in.</p><br/><p>Hejinmal felt that this was very bad, and he looked around for help. However, all the concubines had the same excited look on their faces, a bestial hunger for treasure in their eyes. Only his mother was trying to surreptitiously leave this place, but she had no intention of helping her son.</p><br/><p>“This is the first time I have seen such treasure. If you want me to forgive your foolishness, then offer me your raiment, Skeleton.”</p><br/><p>“Umu… dealing with fools is truly tiresome.”</p><br/><p>A cold voice rang forth.</p><br/><p>Why did his father’s instincts as one of the living not tell him that Death awaited him? It must have been his Draconic avarice at work here.</p><br/><p>“You idiot! You’ve just thrown away the only chance you had to survive! No, I should kill you─”</p><br/><p>“[Grasp Heart].”</p><br/><p>And with that, his father’s body slumped powerlessly to the ground.</p><br/><p>All eyes went to the body of the strongest Dragon here.</p><br/><p>The way he did not move at all looked like he was sleeping. Of course, that was definitely not the case.</p><br/><p>The air in the room turned cold, and the Supreme Being spoke.</p><br/><p>“I have no interest in last words. Then, Hejinmal, which of them is your mother? I shall show her mercy and spare her life. As for the others, well, I’m sure there will be various uses for them after we’re done picking them apart.”</p><br/><p>“That’s me!”</p><br/><p>“That’s me!”</p><br/><p>“That’s me!”</p><br/><p>Three voices rang out at once. For a moment, Hejinmal almost said “That’s me!” as well.</p><br/><p>“…What’s this? Don’t tell me there’s the mother who bore you, the mother who raised you, and the mother who cared for you?”</p><br/><p>Hejinmal looked at the two Dragons who were not connected to him by blood.</p><br/><p>The two of them were gripped by fear.</p><br/><p>Their eyes were clouded over with terror. That too was natural; after all the mightiest Dragon present had just been slain in an instant.</p><br/><p>They did not contemplate fight or flight or whatnot. They sprang on the sole chance of survival which presented itself. Much like himself, they had made the most correct choice to live on.</p><br/><p>Their fearful eyes looked towards Hejinmal, trying to ingratiate themselves with him. How would they react if he said, “No, I only have one mother”? His absolute master would surely slay the other two without any hesitation.</p><br/><p>Currently, the power of life and death over the other two Dragons rested in Hejinmal’s hands. However, he could not take delight in this. All he felt was a tremendous sympathy for others in the same situation as himself. At the same time, he planned to have his “mothers” owe him favors for a long time to come.</p><br/><p>“It is as you say, Your Majesty. I have three mothers!’</p><br/><p>“Is that so? What a shame. However, a promise is a promise. Alright, I shall spare them… Still, is there only one Dragon corpse? Dragons are far too useful. One does not seem quite enough… What a shame.”</p><br/><p>After peeking around, the three concubines bowed before Ainz in the pose of submission.</p><br/><p>“Leave this place and gather all the Dragons here. Then, inform them that you are now under my rule. …If anyone refuses to accept this, then I will deal with them personally. Now go.”</p><br/><p>The concubines burst into motion and ran at top speed. It was a speed that either inspired awe in onlookers or frightened them speechless.</p><br/><p>Hejinmal did not think for a moment that they might try to escape. In the face of this mighty magic caster, their chances of escape were slim to none. They ought to have realised that as well. No, to Hejinmal, it made no difference even if they escaped. After all, if they did so, he would know how the Sorcerer King would find and deal with them.</p><br/><p>Tok. Someone tapped lightly on Hejinmal’s head, Turning around, he saw his Master’s eyes looking at him.</p><br/><p>“I have another order for you. It is a very important order. Gather all the Dwarven books you have, including those you have not yet finished, as well as all the other books outside your room, and bring them to me.”</p><br/><p>“Yes! I understand! I shall do so at once!”</p><br/><p>After nervously setting the two of them down, Hejinmal ran with all his might.</p><br/><p>***</p><br/><p>“So, they’ve gone.”</p><br/><p>Ainz watched as Hejinmal vanished into the distance. He had inquired about how many Dragons lived here from him. Therefore, if the numbers did not add up, it would still be of benefit to him.</p><br/><p>There was only one Dragon corpse. After thinking about all the uses he had for it, he wanted more. However, punishing freshly subjugated people who had done nothing wrong for the purpose of generating corpses would violate his ideals of fair reward and punishment.</p><br/><p>Kuku, Ainz chuckled.</p><br/><p>If they ran, he would hunt them down, kill them, and take back the corpses. As he pondered how to make use of said corpses, Ainz turned his gaze to the glittering pile of gold which the Dragon before him had been lying on.</p><br/><p>“That’s a Dragon for you. It’s a veritable mountain of treasure.”</p><br/><p>It was nothing compared to Nazarick’s Treasury, but it was still the largest pile of wealth he had seen ever since coming to this world.</p><br/><p>There were gold coins, but those were outnumbered by gold-bearing ores, and what looked like raw gemstones.</p><br/><p>There was a golden chain over five meters long, a pelt from some beast, golden gloves studded with jewels, a plain staff that looked magical… where had he gotten all these things from?</p><br/><p>Perhaps only the Dragon that had become a corpse knew.</p><br/><p>“Umu, hardly any brass or fool’s gold. So most of that is natural gold? Is that a Dragon’s sense of smell at work…”</p><br/><p>Gondo muttered all that to himself as he studied the glittering ores. Are those any different from gold, Ainz thought, and he resolved himself to properly appraise them once he got home.</p><br/><p>“I trust there are no problems with exercising my victor’s rights over the Dragon’s hoard?”</p><br/><p>“Those rights are yours, of course. However, how about trying to open that while nobody’s around?”</p><br/><p>“Huhu. You’re quite the villain.”</p><br/><p>“It’s purely for research, of course. Then, please tell me if there is anything you desire, Your Majesty. According to that Dragon, there’s no ledger of treasure or anything, but it might not be good to take a Dwarven treasure that’s too famous.”</p><br/><p>“Why not say the Dragon took it?”</p><br/><p>“If that happens, they might request that Your Majesty return the Dragon’s hoard, no? While I don’t think the Council will say anything to Your Majesty, it would be best not to sow the seeds of future conflict, don’t you think?”</p><br/><p>“It is as you say. Then, I shall open the door to the entrance. It’s better if less people know about what will happen.”</p><br/><p>“Please, Your Majesty.”</p><br/><p>Ainz and Gondo went about their respective business.</p><br/><p>First, Ainz used [Gate] to bring over his Eight Edge Assassins.</p><br/><p>“─I have an order for you. Search this palace, hidden rooms included, and bring all the books you find to this place. If you meet any Dragons, say you are my subordinates. If you are attacked, you may kill them. However, avoid making the first move. Also… while I doubt there are any around, there might be powerful beings present, so move in groups. If you encounter any such entities, prioritize bringing that information back to me.”</p><br/><p>Since the books were written in Dwarven, only Gondo could understand them, so Ainz had no choice but to let him read them.</p><br/><p>As he watched his subordinates disperse through the Royal Palace, Ainz chucked the Dragon corpse through the [Gate].</p><br/><p>Mm, first I’ll harvest all the materials, and then process them. And then, if the Dragon is willing to accept resurrection, I’ll have another batch on hand. Though I doubt that’s likely…</p><br/><p>As Yuri Alpha of the Pleiades looked at him, he ordered her to store the corpse on the 5th Floor. In order not to let the corpse rot, he ordered her to put it on ice.</p><br/><p>“Your Majesty! There are no signs that it was opened. It would seem the treasures should still be in place.”</p><br/><p>“Really now. Then I shall open it.”</p><br/><p>He bade Yuri farewell, and after the great doors closed, Ainz stood before the entrance to the Treasury.</p><br/><p>As he recalled his YGGDRASIL days, elation soared in Ainz’s chest. It had always been an exciting experience to encounter a treasure chest-shaped drop. Even if there was only a single data crystal inside, one would not know before opening it. He felt that same excitement now.</p><br/><p>However ─ it was forcibly negated.</p><br/><p>Every time his joyous emotions were cancelled, it gave rise to some measure of displeasure. Even so, it still enlivened him somewhat.</p><br/><p>Ainz took out a magic item which looked like a board.</p><br/><p>It was an artifact: Epigonoi.</p><br/><p>(TL Note: , Shatterer of the Seven Gates)</p><br/><p>It was a magic item which could only be used seven times, but it possessed the lock-opening abilities of a level 90 thief.</p><br/><p>It was very valuable, and he did not want to use it if possible, but he had not summoned any vassals with high-level lock-opening abilities. The Eight Edge Assassins were specialized in stealthy combat, and they had very poor lock-opening abilities.</p><br/><p>“It can’t be helped.”</p><br/><p>Ainz ─ who very rarely used any rare items he obtained ─ decided to use it after some waffling. It would seem that he was looking forward to the treasures within.</p><br/><p>He touched the artifact to the Treasury door, and activated its power.</p><br/><p>As they peeked through the slit of the opening door, Ainz and Gondo clenched their fists.</p><br/><p>Neither of them said anything, but their expressions said everything.</p><br/><p>The glitter of gold was little more than a trick of the light. Without any light, it would not shine. However, what they saw was a massive pile of treasure that seemed to shine from within. Unfortunately, the word “tidy” could not be applied to it.</p><br/><p>“…Amazing.”</p><br/><p>Much like the Dragon’s hoard, the Dwarven trove could not compare to that of Nazarick, but to Ainz, it was also a commendable sum.</p><br/><p>Ainz picked up a gold coin. He had never seen coins like this before, and it did not look like the gold pieces used for trade nowadays. However, it did not feel like it was Dwarven-made, simply because of the profile of a human carved onto its surface.</p><br/><p>“They say that in the past, the Dwarves traded with the huge human nation which ruled the area around this mountain range. This must be a portrait of the ruler of that nation. Runesmiths flourished then; it was their golden age.”</p><br/><p>“Umu.”</p><br/><p>Ainz flicked the coin from his fingers, dumping it into the pile of treasure. Gold clinked against gold, producing a crisp sound that pleased the ears.</p><br/><p>“Then, please excuse me for a moment while I look for technical manuals and any items made by runesmith researchers, and so on.”</p><br/><p>“Do so. I will look around myself.”</p><br/><p>Pandora’s Actor would probably be very happy to see this.</p><br/><p>As he recalled his bizarre attitude, the mental image of Ainz making sure the Treasury’s door was properly locked came to mind.</p><br/><p>He saw armor and weapons seemingly buried by gold pieces. Would that not damage them? Why did they not mind that damage?</p><br/><p>I see, if it was neat and tidy, then any thieves who got in could quickly find the treasure they were looking for. So instead they messed things up? If that’s the case, then they might use that old dodge as well…</p><br/><p>“Gondo, I have something to ask you. Is it possible that there is a secret door under this mountain of treasure?”</p><br/><p>Gondo looked back in surprise.</p><br/><p>“I see! …It’s not impossible, but even if there were, it would be very difficult to find. After all, we would have to move out all the treasure in here.”</p><br/><p>At the very least, they would need to move the gold coins.</p><br/><p>“Then, we could estimate the distance from this level to the one below, and if there’s a discrepancy in height we’d be right, then?”</p><br/><p>“I feel that even if one wanted to put in a secret chamber in this place, it wouldn’t be anything more than a sliding secret door to hide several pieces of treasure. Measuring thickness would also be quite difficult. Also, since this is the Treasury, the walls and floor would naturally be thicker.”</p><br/><p>Gondo’s gaze seemed to be asking what they should do next, but Ainz shook his head. Frankly speaking, taking the items from here felt like a complimentary gift. It seemed a waste to go to too much effort for it.</p><br/><p>“That is not our reason for coming here, and we do not know if it really exists. Wasting too much time and effort on it would be foolish. In any event, once the Dwarves come to reclaim their city, we will have them serve as witnesses and buy those items at their proper price.”</p><br/><p>“I understand. Then I shall go and see if our objective is in this place.”</p><br/><p>Gondo began searching again, and Ainz picked out several items which seemed more magical than others.</p><br/><p>“Hm? This is…?”</p><br/><p>Among those items, Ainz discovered a sword.</p><br/><p>It might well be the most magical item out of everything here.</p><br/><p>“Umu… going by levels, it would be around level 50, then?”</p><br/><p>It was long enough to be considered a longsword, and it was intricately decorated.</p><br/><p>He was not sure if this was made in YGGDRASIL. But if it was an item of this world, then its magical power would beggar belief. Ainz felt the body of the sword. It was smooth and even.</p><br/><p>“What a beautiful and exquisite sword. But there are no runes carved on it. How could that be?”</p><br/><p>Ainz gripped its hilt. In that instant, the sword vibrated. It felt as though mana was flowing through it.</p><br/><p>“This is… something even I can use?”</p><br/><p>Ainz could not use longswords due to his class restrictions. However, it would seem this sword had been imbued with some sort of magic which waived that restriction.</p><br/><p>“Interesting.”</p><br/><p>After swinging it several times, Ainz casually poked his hand with it.</p><br/><p>There was no pain. It would seem Ainz’s immunity to attacks below level 60 was still in effect. It did not have the special magic that was imbued into Gazef’s sword.</p><br/><p>Having lost some of his interest, Ainz cast a spell.</p><br/><p>“[Greater Magic Item─”</p><br/><p>“Your Majesty! How goes the search? Did you find anything interesting?”</p><br/><p>“─Several articles, but I’ll decide which one I want to take afterwards.”</p><br/><p>“Is that so? I”ll leave you to it, then!”</p><br/><p>Now that Gondo’s call had interrupted the spell, Ainz tossed the sword back into the pile.</p><br/><p>While a sword which he could wield was quite interesting, given his present circumstances, it was nothing more than that. Any item Ainz took from here would have to be more special and beneficial.</p><br/><p>Is that the calibre of the magic items here? What a shame. Well, I guess I shouldn’t have been hoping for a World-Class Item or whatnot.</p><br/><p>Ainz continued searching, and an item caught his eye.</p><br/><p>“Gondo, I’ve made my selection. I’m not sure if this is a national treasure, but could you come over and help me take a look?”</p><br/><p>4</p><br/><p>“Then, let’s begin.”</p><br/><p>After saying that to Shalltear , who was standing beside her, Aura unfurled the scroll ─ the World-Class Item she had brought with her ─ and activated its power.</p><br/><p>[Depiction of Mountains and Rivers].</p><br/><p>Simply put, it was an item that sealed a target into a closed-off space. To be more precise, it swapped a painted landscape with the real world, and then it would convert the real world into a painted landscape.</p><br/><p>The definition of “target” in this case was the same as that of the super-tier spell [The Creation], and referred to a specific area. Nothing within that area ─ animate or inanimate ─ could resist its effects.</p><br/><p>This time, she was going to trap everything within this gigantic cave into the otherworld created by [Depiction of Mountains and Rivers].</p><br/><p>Shalltear and Ainz were protected by World-Class Items, so they would not be imprisoned within the otherworld. Instead they would appear in the painted landscape which substituted for the region of devoured reality. However, as the item’s user, Aura would automatically be sucked in.</p><br/><p>This painted world was almost the same as the real world, with nothing strange or outstanding within it. However, it was fundamentally an illusion. Without the power of [Depiction of Mountains and Rivers], once one exited the target area, everything would vanish into mist. In other words, any treasures gained from within the painted world would also dissolve into mist.</p><br/><p>Of course, the two of them had entered this oublietted segment of reality of their own volition. Normally speaking, World-Class Items could not affect holders of other World-Class Items, but it would be a different matter if those holders accepted that influence. All that was thanks to a patch from the devs.</p><br/><p>One could choose from 100 otherworlds to overlay onto the targeted portion of reality.</p><br/><p>For instance, there were lethal lava lands which dealt ongoing fire damage, boreal landscapes which dealt ice damage, thunder plains that rained down lightning strikes at periodic intervals, monsoon regions where visibility was practically zero, or mist-shrouded worlds, as basic options.</p><br/><p>The strange thing was that there were also battlefields which could be overlaid. After a certain period of time, a sizable number of reinforcements would show up to attack the enemy. However, these troops would only be about 60% as strong as their opponents, so they were generally limited to depleting the enemy’s resources.</p><br/><p>If one-on-one confrontations were desired, one could instead face the enemy with an equal number of stronger entities, each of which had 80% of the user’s power. Due to this ability, it was quite useful if one’s opponent was to defeat the foe.</p><br/><p>The most fearsome aspect of this item was not drawing people into an otherworld, but that it allowed the user to choose which targets would suffer its effects. The user could also choose these effects. In other words, even if the user created a region of molten lava, they could exempt chosen people from the fire damage it inflicted.</p><br/><p>However, it had its weaknesses.</p><br/><p>Unless specific otherworlds were used, one of 40 escape routes would be randomly chosen during each activation, and if the enemy managed to escape via that route, ownership of the item would transfer to the enemy. Of course, none of these escape routes were simple, but the fact that one could seize the item without defeating its holder meant that obtaining it was easier than most other World-Class Items.</p><br/><p>This time, Aura chose one of those specific otherworlds, a simple region of sealed-off space.</p><br/><p>Besides being trapped, the enemy would not suffer any deleterious consequences. However, there was only one specific way to escape from this place.</p><br/><p>“Alright, Hanzo, I want you to block off the escape route from this world. It’ll be troublesome if any of them got away. Lean over a bit.”</p><br/><p>The Hanzo leaned over from his hiding place in the shadows, and paid close attention to Aura’s explanation of the escape route.</p><br/><p>Although Aura had not detected any ambushers nearby, it paid to be careful.</p><br/><p>“Then, Aura. How many more people have entered this world after the others?”</p><br/><p>“Hm? Only two people.”</p><br/><p>That answer meant the enemy did not possess World-Class Items. They breathed a sigh of relief.</p><br/><p>Shalltear looked around the residences of the old Royal Capital. It was a large city, but it was quiet, as though its citizens had all fled.</p><br/><p>They had to quickly capture the Clan Lord, the ruler of the Quagoa, and convey the Supreme Being’s words to him. However, their visibility was impeded by the houses and they could not find the place where he was staying.</p><br/><p>“Can you burn those houses away?”</p><br/><p>“Hm? I can’t. However, I could create a hazardous environment to deal damage over time. For instance, if there were a line of log houses, we could create a lava region and burn them to ash.”</p><br/><p>“That might kill them all, so you can’t do that.”</p><br/><p>“Yeah. Still, I could activate it briefly and deal with everyone who survived… but it would be a shame if their ores melted.”</p><br/><p>The Quagoa fed their children metal and the like, so there ought to be large quantities of metal or raw ore and minerals lying around. Destroying them would be a waste, and Shalltear agreed.</p><br/><p>“Besides, Ainz-sama’s order was to see if they were willing to flock to our banner.”</p><br/><p>“And then he said that if they refused, we would cull their ranks to a specific amount.”</p><br/><p>“…Shalltear.”</p><br/><p>After seeing Aura narrow her eyes, Shalltear realised what she was getting at.</p><br/><p>“It’ll be fine! I won’t mess up this time! I ab-so-lute-ly won’t mess up!”</p><br/><p>“If only that were the case.”</p><br/><p>“I think I get it now. You have to use your head. Shall we?”</p><br/><p>“Mm, let’s go. Then, can I leave the thinning of their numbers to you?”</p><br/><p>“I think I’m more suitable for that task. Are you okay with that?”</p><br/><p>Aura’s strength was tied up in her magical beasts, so she was not as good at this sort of thing.</p><br/><p>“Yeah… If Mare were here, he’d trigger an earthquake and wipe a whole bunch of them out.”</p><br/><p>“That boy has the strongest area attacks in Nazarick. I’m pretty confident in that field, but my power is limited in a place like this.”</p><br/><p>Speaking of which, using an earthquake to obliterate them would not fulfil their master’s command of “selection”. If she could do that, then she could simply summon her familiars to perform an indiscriminate massacre.</p><br/><p>“So you’ve already received orders like that? All these tasks were for you to learn, Shalltear.”</p><br/><p>Aura repeated the orders their master had handed down many times.</p><br/><p>“That’s true,” Shalltear replied, and then she mentioned something she had been thinking about for a while.</p><br/><p>“Judging by the strength of the enemies we’ve encountered so far, it doesn’t look like there’s anyone here who could defeat a Death Knight. Then, could it be that they were beaten by chance? It’s more likely that they used an item or defeated them with a summon that was later recalled… It’s quite rare that Ainz-sama’s predictions are wrong.”</p><br/><p>Shalltear realised Aura was staring at her. She did not want to ask why she was doing so.</p><br/><p>“What? Did I miss something?”</p><br/><p>“It’s not like that… hm… ahhhh. What a dummy~”</p><br/><p>A look of displeasure crossed Shalltear’s face.</p><br/><p>If she had missed something out, then why not just tell her directly? It was a while before Aura gave her answer.</p><br/><p>“Say ─ how could Ainz-sama make that sort of mistake?”</p><br/><p>“Was getting the Death Knights defeated part of Ainz-sama’s plan? It’s true that Death Knights made by Ainz-sama have very high stats. Nobody we’ve encountered so far should have been able to defeat them…”</p><br/><p>Aura thumped her fist into her hand. “Is that possible too?” she wondered.</p><br/><p>“I see. So it’s possible that he intentionally let the opposition kill the Death Knights. I didn’t think that far ahead, but I wanted to say that ‘his predictions weren’t wrong’. The Death Knights went down with the bridge, but I think they died from the fall. Their footprints were there when we passed through that fortress, but they weren’t there on the other side. In other words, they were defeated halfway through. That means, there’s only one reason they could have died.”</p><br/><p>“If that was the case, does that mean this has exceeded Ainz-sama’s predictions?”</p><br/><p>“I told you, it’s not like that. If Ainz-sama was talking to you seriously, it might be like what you said, Shalltear.”</p><br/><p>“What do you mean by that?”</p><br/><p>Shalltear knitted her brows, unable to understand. Aura went “Ahhhhh!” and stomped her feet.</p><br/><p>“What do you mean, ‘what do you mean by that? I told you, right? Ainz-sama already knew that the Death Knights died from falling into the Great Rift.”</p><br/><p>“Ehhh?!”</p><br/><p>“Haaa… why don’t you think about what happened back then? You see, when Ainz-sama was explaining things to you, I wanted to ask if the Death Knights had been pushed to their deaths, but Ainz-sama looked right at me and ordered me to be quiet. Didn’t you notice? It was in the moment when he gave his instructions.”</p><br/><p>Shalltear blinked in surprise. She had seen her master make that gesture. At first, she had thought it was because he wanted Aura to keep quiet because he was saying something. However, that Supreme Being was a genius strategist, so Aura’s explanation was more likely as opposed to her potentially flawed reading of the situation,.</p><br/><p>Still, if that was the case, why had he explained all that to her?</p><br/><p>“What kind of face are you making? Think about it a little and you’ll know.”</p><br/><p>Aura’s absentminded words made Shalltear’s heart shrink like it was being tossed around in a whirlpool.</p><br/><p>“Could it be… for me? Did he do that on purpose to train me? Is that what you mean?”</p><br/><p>“…What other answer could there be? Along the way, you said there could be a strong enemy and asked Ainz-sama many things. If you knew they had fallen into the Great Rift, would you have asked so much? Ah, can you keep this a secret from Ainz-sama? It’s all because you doubted Ainz-sama…”</p><br/><p>“You say I doubted Ainz-sama’s ability? How could that be?”</p><br/><p>Shalltear hoped that she could keep quiet about how she had come out and said that she did not trust the prowess of a Supreme Being.</p><br/><p>“Well, just keep it a secret. Just as Ainz-sama wanted me to keep it a secret from you, you have to watch your lips too.”</p><br/><p>“Of course.”</p><br/><p>When one reflected calmly on this, Aura had committed a mortal sin, that of ignoring a Supreme Being’s orders. However, that was because she felt Shalltear had shown disrespect to the Supreme One…</p><br/><p>So was it me or Aura who was rude to the Supreme Beings? Or was it neither of us? Hm─</p><br/><p>Shalltear’s head ached, and she decided to stop quibbling and not brood about the matter of keeping secrets.</p><br/><p>“…Still, isn’t that a sign of disrespect in itself? Hm…”</p><br/><p>“…Hm ─ speaking of which, if they don’t submit to Ainz-sama, he said something about cutting them down to about 10’000 people. While he did say to spare some of the females, what about the children?”</p><br/><p>“Did he specify to leave a certain amount alive?”</p><br/><p>“Although, don’t they get stronger by eating metals as children? And if we’re going to rule them, wouldn’t children be easier to brainwash? Shalltear─”</p><br/><p>An evil grin appeared on Aura’s face.</p><br/><p>“If Ainz-sama didn’t leave any specific instructions, that means… it’s a test, right? While we could always send the Hanzos to ask for directions, Ainz-sama said he left it to you, right? So I think Ainz-sama wanted to see how you would deal with it… Can our Number One Floor Guardian take good care of this task?”</p><br/><p>Shalltear smiled thinly by way of reply. She had been thinking about this ever since she had been given her orders.</p><br/><p>“”4’000 males and females and 2’000 children ought to be enough.”</p><br/><p>“Hm? Hm ─ I guess. You seem to be handling this pretty easily ─ hm?”</p><br/><p>Aura fell silent and cupped her hand to her ear. Shalltear knew what she was doing and kept as quiet as possible. In the end, she was all smiles.</p><br/><p>“Ah, I heard what sounded like a large group of Quagoa making their move.”</p><br/><p>“Are they fleeing, or are they deploying their forces?”</p><br/><p>“I can’t be perfectly sure because I’m going by sound, but they don’t sound like they’re running away. It’s more like they’re dispersing outside the city.”</p><br/><p>Apparently, there were 80’000 Quagoa here. Demihumans were the kind who grew stronger with age. In other words, everyone was a soldier. If they mobilized over 10’000 people but deployed them within the city, their advantage in numbers would be cut down by half.</p><br/><p>While the intruders were so few they did not qualify as an army, they possessed incredible fighting power. The matter of the Dragon should have spread throughout the Quagoa. If that were the case, the smarter people would lead the others outside the city to evacuate, while setting up in formation to lure the enemy into the city for a fight. If a small number of enemies moved into the city, the Quagoa could surround the city and mount waves of attacks to tire them out before dealing the finishing blow with a team of elite warriors. That seemed like the most appropriate battle strategy.</p><br/><p>In any case, one needed a wide, open space to deploy a large force.</p><br/><p>Shalltear was hoping for just that.</p><br/><p>“They’re over there. Then, we should begin negotiations now.”</p><br/><p>“Of course. We need to work hard so we don’t keep Ainz-sama waiting.”</p><br/><p>***</p><br/><p>Over 60000 battle-capable Quagoa were formed up and waiting for the enemy.</p><br/><p>Female Quagoa who were not pregnant or bearing children were just as good at fighting as the males, which was how they had managed to mobilize these numbers. Still, despite mustering a force bigger than any in recorded history, Clan Lord Pe Riyuro was not happy at all.</p><br/><p>This was far too strange. The cave which contained the Royal Capital had suddenly been wreathed in mist.</p><br/><p>What on earth was going on?</p><br/><p>The battle-ready troops began lining up, facing the Royal Capital. If the enemy feared their numbers and did not come out, then that would be the best case. Therefore, they took the minimum provisions with them, and left their Dwarven treasures behind. As long as their enemy was not stupid, they would see that there was no point in fighting.</p><br/><p>However, someone emerged from the Royal Capital.</p><br/><p>One of them was dressed in red armor, and another was a dark-skinned shorty that was not a Dwarf.</p><br/><p>According to the ones who had watched the encounter with the Dragon outside the Royal Capital, there should have been two more, but they did not see them. They must have been grabbing treasure, while these two were buying time for them.</p><br/><p>“In any case, just to confirm, that is not a Golem right?”</p><br/><p>“Yes, it’s not a Golem.”</p><br/><p>According to Yozu, the Golems were tall of stature and wore black armor. So that suit of red armor was something else. However─</p><br/><p>Perhaps that’s a type of Golem. It might be better to think of it that way. Still, why did they come out to face an army in the tens of thousands head-on? Is it because they’re confident of killing us all ─ No way, it can’t be. That’s impossible.</p><br/><p>Riyuro shook his head to disperse the horrific image that had appeared within it.</p><br/><p>He could guess that the opposition possessed unimaginable power, given that they had created this bizarre dimension. The fact that they could make a Dragon prostrate before them without a fight also suggested they were very strong.</p><br/><p>Still, his side numbered over 60’000. It was completely incomparable to having only hundreds or thousands of people. There was no way to fight this many opponents.</p><br/><p>However, if they were Golems, then it was understandable.</p><br/><p>Golems did not tire like living beings. They could fight forever, and if they were strong enough to defeat Riyuro, then they could theoretically kill everyone here.</p><br/><p>Still, that was merely theoretical.</p><br/><p>Even if only one out of several Quagoa dealt damage through a lucky hit, over the course of thousands of rounds of fighting, the accumulated scratch damage would result in injuries that could take the enemy out of commission.</p><br/><p>Numbers were strength. With his army of 60000, as long as they fought on the ground, they should even be able to slay a Dragon Lord.</p><br/><p>“─I’ll go talk to these people. You wait here. If I’m killed… Well, do as you please.”</p><br/><p>“It’s too risky,” one of his advisors said, stating the obvious.</p><br/><p>“…We can’t talk to Golems, so I’ll talk to the one beside it. It would be bad if we didn’t find out their objective, at least.”</p><br/><p>In any case, Riyuro was determined to attempt a dialogue.</p><br/><p>The enemy must be strong. That being the case, he would ask them their objective. If they could be reasoned with, then he would not mind paying a certain price. If they could chase off the Dragon Lord, then acknowledging them as their new masters would also be fine. Even if that was impossible, he could pay them more than the Dwarves did in exchange for switching sides.</p><br/><p>“Nobody must follow me. If a lot of us come at once, it might trigger hostilities.”</p><br/><p>Without saying anything more to his aides, Riyuro stepped forth.</p><br/><p>His troops parted on both sides of him, and the opposition seemed to have noticed that someone was coming. He could see the enemy had stopped to observe his movements.</p><br/><p>“Sorry for the wait.”</p><br/><p>Riyuro was the first to speak, and his voice made the enemies look at each other.</p><br/><p>He looked around. As expected, there was nobody else around. There were two other people from that face-off with the Dragon ─ the Dwarf and the skull-helmeted chap ─ neither of which was here.</p><br/><p>“Hm? Who’re you?” the dark-skinned shorty replied.</p><br/><p>It would seem the red-armored one was a Golem. It seemed paler and taller than the humanoid next to it. Still, at a glance, there was no telling that it was an artificial being ─ it looked very realistic.</p><br/><p>“I am Pe Riyuro, Lord of the Quagoa Clans who live in this place. And you ─ who might you be?”</p><br/><p>“We are under orders from the Supreme Overlord who has come to this land in order to rule you.”</p><br/><p>It spoke!</p><br/><p>The red-armored one spoke. Since he heard that Golems could not speak, it was obviously not a Golem.</p><br/><p>Trying to hide his consternation, Riyuro replied:</p><br/><p>“Rule?”</p><br/><p>“Correct. Our Lord has come to subjugate you. Bend the knee and bow before him.”</p><br/><p>Then, what should I do? Riyuro thought fast.</p><br/><p>He did not mind bowing and welcoming a new ruler. All they needed to do was grow strong beneath that ruler and then overthrow them.</p><br/><p>The problem was that they could not submit to the opposition without knowing their power. They might have made that Dragon kneel before them, but that Dragon was not the Dragon Lord. For all he knew, after bending the knee, they might be made to fight the Dragon Lord.</p><br/><p>“…There should be two more of you. What happened to them?”</p><br/><p>“You do not need to know. You are only allowed to say if you accept our rule or not.”</p><br/><p>They were not revealing anything to him. That would mean that investigating the enemy’s intentions ─ whether or not they truly intended to fight in earnest ─ was very important.</p><br/><p>“…You say you want to rule us. However, it is very difficult for us to accept your proposal without knowing your strength. Does that make sense to you?”</p><br/><p>In other words, he was implying that “if you tell me how strong you are, I don’t mind being ruled by you.” However, the two of them merely looked at each other and shrugged.</p><br/><p>“Is that so. Our orders state that if you will not accept our rule, we are to reduce your numbers until you are forced to bend the knee. After that, you are to kill yourselves until there are only 4000 males, 4000 females and 2000 children left. You should be able to differentiate who is more valuable, am I correct?”</p><br/><p>“Then, once there are only 10000 of you left, we will take you back to our country, the Sorcerous Kingdom, where you will be put to work.”</p><br/><p>Fear coursed through the Clan Lord for an instant.</p><br/><p>It was not because of the cruel content of the message. It was because they had delivered it in a matter-of-fact tone that was completely devoid of arrogance.</p><br/><p>He felt that these two people could actually do it.</p><br/><p>Yes.</p><br/><p>These two people could kill an army of over 60’000.</p><br/><p>Were they mad? Were they overconfident? Or─</p><br/><p>That unbelievable attitude left Riyuro at a loss for what to do next.</p><br/><p>They could not listen to such insane orders without so much as a fight.</p><br/><p>Perhaps they had sensed the hostile intent from his side, but the two of them looked at each other, and their faces twisted into grins.</p><br/><p>The Dwarves were hairy, so he could understand them. These two people had no hair except on the tops of their heads, so he could not read their expressions. Such was the gulf between two different species.</p><br/><p>“W-wait─”</p><br/><p>He could not finish his request for them to wait.</p><br/><p>“─Then, I shall now begin reducing your numbers to an acceptable level. That being the case, do not give your clothes to anyone else.”</p><br/><p>Normally speaking, the Quagoa did not wear clothes. After all, they were covered in fur from head to toe.</p><br/><p>However, a king needed to show his authority, and thus he needed something to easily differentiate himself from others. That was why he wore clothing and a crown made by Dwarves, with the sigil of the Clan Lord. At the same time, he could let others wear them to serve as doubles for him, in order to deceive enemies from other races.</p><br/><p>Had they seen through that plan and thus tried to cut him off halfway?</p><br/><p>Taking out the enemy leadership to cripple the enemy army was the most obvious victory condition. However, why had they not done that?</p><br/><p>No, that’s not it. There’s another reason for that… Could it be… That must be it. They’re not trying to kill me, they’re trying not to kill me by accident!</p><br/><p>The differences between species ran very deep. However, as long as he wore his clothes, they could tell who the Clan Lord was and thus they would spare him. That was the meaning of their haughty declaration.</p><br/><p>“Then, isn’t it about time you went back? We will start once your side moves towards us. I would be glad if you picked out the ones you wanted to survive before that.”</p><br/><p>“Hurry up and go back.”</p><br/><p>They waved him off, indicating that he should return. In other words, there was no need to negotiate any further.</p><br/><p>This was far too different from his expectations.</p><br/><p>I told them I was willing to bend the knee, but why couldn’t they make even a little concession? If they aren’t even willing to do that… does that really mean they view our lives as worthless…?</p><br/><p>In the face of this arrogance, the Clan Lord struggled to suppress the terror overflowing from this heart.</p><br/><p>In any case… they can’t possibly cut the 60000 people here down to 100000… Yes. That must be it. They must have lost their minds after seeing our forces!</p><br/><p>Under normal circumstances, that sort of thinking would be correct. Even Dragons could not reduce their numbers by such large amounts.</p><br/><p>In that moment, realization struck the Clan Lord.</p><br/><p>Could it be that they intend to mount flying hit-and-run attacks?</p><br/><p>If they fought like Dragons, then things would be very tricky.</p><br/><p>Deploying in a wide open area like this would be detrimental instead.</p><br/><p>Then, should he pull his forces back to the residential district?</p><br/><p>However, that would be very dangerous. If the enemy could destroy buildings, then it would cause great damage to their homes. In the end, this was the only place they could fight.</p><br/><p>After returning to his troops, the Clan Lord gathered his aides.</p><br/><p>“Was that a Golem? …What happened? You look very uncomfortable.”</p><br/><p>His expression must have frightened the other two. The Clan Lord patted his face and gave his orders.</p><br/><p>“Ahh… In any case, gather the Blue and the Red Quagoa.”</p><br/><p>“Will they be a personal guard?”</p><br/><p>“Not just that. Gather all the exceptional individuals of each Clan together.”</p><br/><p>***</p><br/><p>Riyuro gave voice to a mighty cry. It was a cry infused with the skill he had obtained when he had ascended to the position of Clan Lord. As he saw his army of over 10’000 charge the enemy in response to the cry, he even felt a little pleased. However, the results of that charge were too horrible to watch. Like a flow of water striking a wall, the charging soldiers struck an invisible barrier and were sent flying.</p><br/><p>What splashed everywhere was not frothy water, but Quagoa ─ or what used to be Quagoa. Perhaps a sight like this would be fitting of Dragons or Giants, but their opponents were creatures that were even smaller than Quagoa.</p><br/><p>“They’re flying…” one of his aides muttered dumbly to himself.</p><br/><p>This was not a metaphor. The charging Quagoa were literally flying through the air. Neither did they do so one by one. Several dozens of them were sent flying all at once.</p><br/><p>Their pulverized corpses became a shower of meaty chunks which rained down on their comrades. The gore-caked troops continued their charge, whereupon they become lumps of flesh themselves which fell on yet more of their companions. It was a scene straight out of a nightmare.</p><br/><p>For some reason, the fact that they could not see any blood spurting made the sight even more surreal.</p><br/><p>“What, what the, what the hell is that?!”</p><br/><p>Riyuro did not even have the strength to answer his advisor’s mournful cry. His thoughts merely leaked out through his mouth in the form of words.</p><br/><p>“This many…”</p><br/><p>“Clan Lord! What is that!? It’s nothing like the Golems we saw before!”</p><br/><p>They smashed away every single Quagoa charging them in a single blow. This was no longer a battle. It was not even a massacre. It was simply disposal. The comrades he had gathered to increase their influence were now being mangled up in vast quantities like so much rubbish.</p><br/><p>“We, we have to run!”</p><br/><p>“Where will you run to?!”</p><br/><p>He shouted at his panicked aides.</p><br/><p>“Where can you run to in this strange dimension?! These people said they’re going to kill us until there’s only 10000 of us left!”</p><br/><p>His aides had nothing to say.</p><br/><p>After seeing this overwhelming ─ this monstrous strength, they understood that their threats were not a joke. While it was hard to believe, they had no choice but to believe it. Out of their 80000 citizens, only 10000 would be permitted to survive.</p><br/><p>Although he wanted to beg their forgiveness right now, there was no warmth in the eyes of those two. Even that Dragon Lord’s eyes held more compassion.</p><br/><p>They have no intention of changing their statement to cut us down to 10000 people.</p><br/><p>“That’s impossible! Clan Lord! What the hell are they? What have the Dwarves brought here?!”</p><br/><p>“Why are such tiny people so powerful…”</p><br/><p>As he heard his advisors, another flash of inspiration struck Riyuro.</p><br/><p>“Could it be that red-armored chap is also a Dwarven weapon? They sent something stronger because they knew the Golems were destroyed?”</p><br/><p>“…So if we defeat it, they’ll send something even stronger than that?”</p><br/><p>The cries of his men echoed all around. Only the region around Riyuro was silent.</p><br/><p>“Let’s pull the men back─”</p><br/><p>“Stop! They have to fight! There’s no other way out for us! However strong it is, it’ll get tired eventually! When that happens, we’ll wait until it can’t swing its weapon any more, then force them to negotiate and demand concessions from them!”</p><br/><p>“I, I see… But… Will it really get tired?”</p><br/><p>He had mentioned something Riyuro had thought of in the corner of his mind. However─</p><br/><p>“In any case, as long as it lives, it ought to get tired. It might have more stamina than us, but it’ll definitely get tired. Until then, make it keep swinging its weapon! …Even if it doesn’t get tired, once it gets bored of killing we might be able to discuss something.”</p><br/><p>The Clan Lord was reluctant to speak the words which came next, but they had to be said.</p><br/><p>“Besides, we can’t win even if we fight it! Not against a monster like that.”</p><br/><p>His troops would not be demoralized to the point of flight. The cry Riyuro had used to sound the charge turned his men into warriors that did not know fear. Much like the Berserk state of Berserkers, it increased their attack strength but reduced their defense. More importantly, they were immune to all fear-related effects. However, the fact that they would not refuse the Clan Lord’s orders no matter how dangerous they were could be said to be a double-edged sword.</p><br/><p>The great mass of soldiers continued charging without ever looking back, and they were cut down to half their previous number with such swiftness that hardly anyone could believe it.</p><br/><p>At this point, nobody had the strength to speak.</p><br/><p>The fact that this tragedy was unfolding before them and it was the doing of one person traumatized their hearts.</p><br/><p>All except for one person.</p><br/><p>That person ─ Riyuro ─ scraped up the last of his courage.</p><br/><p>“You chosen heroes!”</p><br/><p>He could not raise his voice.</p><br/><p>Riyuro saw the Red and Blue Quagoa before him, as well as the other Quagoa with special abilities, all of whom had been formed up into the strongest combat units of the clans.</p><br/><p>The reason why none of them responded to Riyuro’s cry was because they were all watching that suit of red armor with despair in their eyes.</p><br/><p>They too must have felt that they had no hope of victory. When they had first been gathered, their eyes had shone, but now there was no light in their eyes, as though they were dead.</p><br/><p>He had chosen not to drive them berserk to preserve their defensive strength, but it had been the wrong decision.</p><br/><p>The Clan Lord raised his voice to try and psyche them up.</p><br/><p>“You are our ace in the hole! The enemy has killed many of our comrades, so it should be tired! You will be able to make it suffer!”</p><br/><p>It ought to be tired ─ he said that, but there was no sign of it. That red suit of armor showed no signs of stopping as it cut every single Quagoa which charged it to pieces and sent the chunks flying into the air, swinging and thrusting its strange lance-like weapon without end.</p><br/><p>“That’s right! No matter what, it’s living, so it’ll get tired! You can do it! Go! Our heroes!”</p><br/><p>WIth a prayer in his heart, Riyuro sent out those heroes.</p><br/><p>He gave his men orders to clear the path to the red suit of armor. Then, the heroes would assault the red armor─</p><br/><p>─Riyuro closed his eyes.</p><br/><p>“My, my Lord… Mighty Clan Lord of us all…”</p><br/><p>After hearing his aides’ trembling voices, he slowly opened his eyes.</p><br/><p>“You… you don’t need to say anything. I know. I, I saw it too…”</p><br/><p>Nothing had changed. That was right. It had made no difference.</p><br/><p>Just like the regular soldiers, the chosen heroes had been chopped into mincemeat and sent flying as lumps of flesh. And it had all happened in an instant. They had met the same end as the regular soldiers.</p><br/><p>“…So… so…”</p><br/><p>Riyuro could not say anything else. Although he did not know what that red suit of armor was, it was something which was undoubtedly stronger than a Dragon.</p><br/><p>Riyuro could no longer feel anything. If he simply waited quietly for time to pass, the outcome would be as the enemy willed it.</p><br/><p>“…said they wanted 2000 children. Pick out that amount.”</p><br/><p>“My Lord…:</p><br/><p>“…There’s nothing else we can do. Even if there’s only 10000 of us, as long as we survive, someday… someday, we can make the Quagoa great again…”</p><br/><p>Nobody could say anything in the face of Riyuro’s words. That was because everyone clearly understood in their hearts.</p><br/><p>They understood that there was nothing else they could do.</p><br/><p>Riyuro’s head drooped powerlessly. It was as though he had been walking in a safe place, and then suddenly ambushed by a monster..</p><br/><p>“Speaking of which, what is the Sorcerous Kingdom, anyway? Does it have anything to do with the Dwarves? Someone please tell me…”</p><br/><p>His muttering came straight from the heart.</p><br/><p>However much he tried to deny it, the carnage before his eyes gave him the feeling that an even greater tragedy would soon come.</p><br/><p>Suddenly, he saw his Quagoa servants holding cages, Those were the cages used for storing food lizards. Riyuro knew that now was not the time for this, but the stress on him made him reach out to the cage. He grabbed a live lizard, but just as he was about to bite its head off, an intense pain coursed through his belly, bending his body into a ㄑshape.</p><br/><p>There was no way he could beat the absolute ruler who would soon subjugate his race. The idea of flourishing again was so outlandish that even he had nothing to say in its defense. No matter how many generations passed, they would never be able to rise up in revolt. The Quagoa of the Azellisia Mountain Range would forever wear collars in service to their dreaded master.</p><br/><p>The wildly-thrashing lizard slipped from Riyuro’s hands and vanished between his men’s legs. Riyuro went “ahh” in what was more a sigh than a shout, and then he collapsed into silent sobbing from sheer misery.</p><br/><p>“If you were that strong, you should have said so in the first place! Why, why didn’t you tell me!”</p><br/><p>The whimpering of the Quagoa Lord, hailed by his people as the greatest ruler in their history, blended with the screams of the children as his own soldiers butchered them.</p><br/><p>5</p><br/><p>Ainz and Gondo left the treasury together. A flight of Dragons bowed their heads before them. There were 19 of them in total, including Hejinmal.</p><br/><p>In other words, all the Dragons Hejinmal had mentioned were here. Now there would be no need to hunt them down.</p><br/><p>…It’s good that they’re all being obedient, but it’s a shame that I don’t have more Dragon corpses… Should I find some excuse to kill a few more? No, that would be evil. Then why not let them breed and then harvest them later… hm? Isn’t that the same thing?</p><br/><p>“─Most Exalted Sorcerer King. Your faithful servants have gathered before you.”</p><br/><p>Hejinmal spoke as Ainz was thinking. Putting aside his contemplations for the moment, Ainz replied:</p><br/><p>“Raise your heads.”</p><br/><p>The kneeling Dragons raised their heads as one.</p><br/><p>Due to the massive size of their bodies, they were far taller than Ainz once they rose, but there was no sense of them looking down on him.</p><br/><p>However, there were a few surprised looks among them.</p><br/><p>They had heard about it, but it was still hard to believe that Ainz had slain the Dragon Lord, their father. Or rather, even Ainz would think the same thing if he were in their shoes. There were many things which had to be seen to be believed.</p><br/><p>Just as Ainz was thinking that, one of the Dragons roared.</p><br/><p>“I won’t accept this! To think the person who killed Father is actually ─ what?”</p><br/><p>Ainz walked in front of the roaring Dragon. Then he smiled, and beckoned with his hand, as though to say “Give it your best shot.”</p><br/><p>The Dragon swiped its claws at Ainz.</p><br/><p>They were fast, but not as fast as the Troll he had fought recently.</p><br/><p>Ainz did not dodge them. He took the Dragon’s attack head-on. The Dragon — who thought Ainz could not evade in time — grinned broadly, but when he realized that Ainz had no need to dodge, that grin froze on his face. After making sure that the Dragon knew that, Ainz cast a spell.</p><br/><p>“[Grasp Heart].”</p><br/><p>Ainz’s gaze moved from the Dragon who had collapsed like his father, and turned to the others.</p><br/><p>“Is there no one else?”</p><br/><p>After that quiet query, the Dragons were bowed even lower than they had been earlier, as though they were trying to lie flat on the ground. Nobody here doubted Ainz’s power any more.</p><br/><p>Ainz opened a [Gate] and chucked the Dragon’s corpse through it. Then he took Gondo and got onto Hejinmal’s back.</p><br/><p>His mother’s back was larger, so mounting would be more suitable for a ruler than taking Hejinmal.</p><br/><p>However, Ainz had already ridden Hejinmal all the way here, so he might as well ride him the rest of the way.</p><br/><p>“Leave this city. My subordinates should be waiting there.”</p><br/><p>The Dragon flight took wing in unison, and the Hanzos led them to a place where many Quagoa were kneeling down.</p><br/><p>The sight of countless Quagoa in silent prostration was quite bizarre, and as Gondo saw this, he croaked hoarsely.</p><br/><p>Ainz was about to make the same noise himself, but he could not do such a thing in front of his Guardians, whose brightly smiling faces seemed to say, “We worked really hard!”</p><br/><p>“Ainz-sama! As you ordered, we’ve finished the selection from the Quagoa. There are 4’000 males, 4’000 females and 2’000 children. The rest are all corpses. Also, we allowed them to recover the intact bodies and place them elsewhere.”</p><br/><p>“I see. So they rejected my compassion, but now they cling desperately to their final chance for survival. What a bunch of fools.”</p><br/><p>The clothed Quagoa kneeling in front of all the others shuddered visibly.</p><br/><p>“Then, where is their king?”</p><br/><p>“Over there,” Shalltear pointed. As expected, it was the trembling Quagoa. Before Ainz summoned him, he activated his halo of obsidian radiance. According to his research, that effect best suited a ruler.</p><br/><p>As he listened to the mutterings and whisperings from the Dragon flight, he called out to the Quagoa Lord.</p><br/><p>“King of the Quagoa, raise your head.”</p><br/><p>“Yes!”</p><br/><p>The Quagoa Lord’s body shook violently as he raised his head. Then, his eyes went wide, and he went still, as though he had been frozen.</p><br/><p>Ainz could clearly hear him going “Hiiiiiiiieee…”</p><br/><p>“…I am known as a merciful king. The sin of not immediately accepting my proposal shall be absolved by the blood of your people. Yet, if you will give your lives and your loyalty to me, I shall guarantee your prosperity.”</p><br/><p>“Understood!! We are your servants, and all our children and our children’s children shall grind ourselves to dust in Your Majesty’s service!!!”</p><br/><p>“A good answer. It pleases me.”</p><br/><p>“Yes!!!! Thank you very much!!!!!”</p><br/><p>As though to terminate the conversation, Ainz waved his hand, as though to indicate that the Quagoa Lord could resume his submissive posture.</p><br/><p>Excellent! It seems all my practice paid off.</p><br/><p>The endless repetition of lines and poses before the mirror had finally borne fruit. After striking a victory pose in his heart, Ainz turned back to his two Guardians, who had flawlessly discharged their duties.</p><br/><p>“You have done very well. I am very proud of the two of you.”</p><br/><p>“Thank you very much!”</p><br/><p>“Your words have cleansed my heart of the shame of my previous mistake, and I thank you from the bottom of my heart.”</p><br/><p>“Hm, hm…”</p><br/><p>After seeing Shalltear’s delight, Ainz was sure that he had used the right words.</p><br/><p>“Then, is this amount alright? If it’s too much, we can cull them again until their numbers please you, Ainz-sama.”</p><br/><p>“No, there’s no need for that… this ought to be a good number. Come to think of it, could any of them become powerful adversaries? Not by our standards, of course, but by those of the people of this world.”</p><br/><p>“My deepest apologies. Those people were─”</p><br/><p>“No, that’s not it. The Clan Lord whom you spoke to was considered quite strong, although we never saw his strength.”</p><br/><p>“Is that so…”</p><br/><p>While he was not sure how the Death Knights had been defeated, it was most likely a coincidence. For all he knew─</p><br/><p>They might have fallen into the Great Rift…</p><br/><p>As he thought of that, Ainz felt deeply ashamed. Realizing that he had been mistaken after lecturing Shalltear so passionately made his face feel like it was about to erupt in flames ─ and then, the shame was gone. In its place was a smoldering depression. And then, as he thought about how Shalltear had been taking notes, it deepened ─ and then he was back to normal.</p><br/><p>Should he try to bluff his way through this?</p><br/><p>However, if he messed it up, they might tell the others, “Ainz-sama said this, but actually~” and so on.</p><br/><p>This is bad! This is really bad! I shouldn’t have gotten carried away by my joy and lectured them like that! I feel like crying now.</p><br/><p>Ainz sighed deeply.</p><br/><p>Well, come to think of it, isn’t this a good chance to tell the Guardians that I can mess up too? From there, I can move from the position of an incredibly wise ruler to an ordinary ruler, and that might free me from my emotional torment. And if I do that, the Guardians might notice my mistakes and warn me about them.</p><br/><p>He ordered the Dragons to leave, because he knew they had very keen senses. Then, he had the Quagoa move some distance away. Gondo looked very lonely all by himself, but he would just have to bear with it.</p><br/><p>Once the three of them were alone, Ainz gulped.</p><br/><p>What he would do next might well send all his hard work down the drain. Ainz felt uneasy over how the way the situation would change and what might happen in the future. His body ─ which knew no fear ─ started to feel afraid. Despite that, he gathered up his courage to speak.</p><br/><p>“Ah, you two, listen up. …Do you remember what I said about the possibility of a being in this place that could easily defeat the Death Knights?”</p><br/><p>The two of them looked at each other, and their faces suggested that they had realised something.</p><br/><p>“Yes, that. It seems I was mistaken. Maybe the Dragon I killed could have destroyed the Death Knights, but it doesn’t seem like anybody else could.”</p><br/><p>“I understand, Ainz-sama. Your words were intended to make me learn. To think that you had to disgrace yourself on account of my inexperience… I, Shalltear Bloodfallen, tender my utmost gratitude to your exalted self for your merciful considerations!”</p><br/><p>“…Eh?”</p><br/><p>Much to Ainz’s surprise, they were looking at him with respect in their eyes. In particular, Shalltear’s face was flushed red, her eyes were moist, her lips were pressed flat and her mouth was quivering as though she was on the verge of tears.</p><br/><p>What part of that deserved respect? It baffled Ainz. Had he touched their hearts in some way?</p><br/><p>Also, I should deny what Shalltear said, right? No, Shalltear learned a lot from this journey. Then I’ll put my faith in you, Shalltear!</p><br/><p>“It seems you realized it, Shalltear.”</p><br/><p>“Yes!!”</p><br/><p>Their eyes seemed to shine even brighter.</p><br/><p>Say what─? Ainz thought that, but he still had to clarify himself.</p><br/><p>“Still, even I can fail, and I can make mistakes. I hope you will keep that fact in your hearts.”</p><br/><p>“Yes! While I don’t think it’s possible for our great ruler to ever make a mistake, I understand, Ainz-sama!”</p><br/><p>Shalltear seemed to have reached the limits of her endurance. She sank to her knees and began sobbing. As she clenched her teeth and wept copiously, Aura put her hand on Shalltear’s shoulders, her own eyes brimming with tears. While it was a touching scene which illustrated their friendship, Ainz had no idea what was going on, and all he could think about was where Shalltear ─ as an undead creature ─ was secreting her tears, saliva and other bodily fluids from. Thus, he took refuge from reality by thinking about biology.</p><br/><p>While Ainz had no idea how things had gotten this way, he decided to leave things as they were for now. Yes, there were far too many things in this world which defied understanding, or rather, they were situations where he had to feign said understanding. That was how he felt when he listened to his CEO explain important cases.</p><br/><p>Ainz felt that this was merely kicking the can down the road, but at the same time, he felt that his future self who would encounter the problem again would be a better person. Thus, Ainz did the only thing his present self could do now.</p><br/><p>After kneeling down in front of Shalltear, he wiped her tears away, like a parent would for their child.</p><br/><p>And then, in that moment, even more tears coursed down her cheeks.</p><br/><p>“Ainzsh-shama…”</p><br/><p>“Alright, alright. Don’t cry, Shalltear. I told you the same thing back then, didn’t I? You can’t waste your beautiful face on tears.”</p><br/><p>“Wash I usheful to you?”</p><br/><p>“Yes. You did very well. You were everything I expected of one of my Guardians.”</p><br/><p>“Ainzsh-shama─~”</p><br/><p>Shalltear clutched the material of Ainz’s robes.</p><br/><p>“Er, erm. Alright, it’s about time you stopped crying.”</p><br/><p>“O-okie…”</p><br/><p>Shalltear looked up at Ainz as she breathed in through her nose and tried to wipe her tears away.</p><br/><p>“Thank you so much for all the kindness you have shown me!”</p><br/><p>“Mm, hm. Alright, then we ought to move on now. There’s still a lot to be done, no?”</p><br/><p>***</p><br/><p>The Council Chamber had been noisy all morning, but after receiving the latest piece of news ─ it fell silent.</p><br/><p>If they were not hugging their heads, they were scratching them. Not a single Dwarf in the room could stay calm.</p><br/><p>And then, someone spoke.</p><br/><p>“…He’s back.”</p><br/><p>“…Well, that… that was fast. Did he really… really take back the Royal Capital?”</p><br/><p>“…Are you trying to find fault with him?”</p><br/><p>“What a brave fellow you are, putting yourself at odds with the monster ─ no, the mighty being ─ who returned after seizing control of that Dragon’s nest of a Royal Palace. I’d say you’re as brave as that hero-king from the legends. …By the way, please tell him that all of us believed in His Majesty from the beginning.”</p><br/><p>According to the messenger, he seemed to have returned on Dragonback.</p><br/><p>Dragons were very strong, and thus they were very proud. They were thus very interested in how anyone could have performed the shocking feat of subjugating such a being.</p><br/><p>The obvious explanation was that he had used magic to force its compliance. However, when they took into consideration the matchless might of the Sorcerer King, it was equally plausible that he could have cowed the Dragon into submission by sheer force alone.</p><br/><p>No, the latter was more likely. It did not seem like that Sorcerer King needed any magic to rule over Dragons. The absurd mental image of a Dragon kneeling before him in submission even flitted through his mind.</p><br/><p>The Director of Food Production sighed deeply, and then he turned a stiff, stern gaze on everyone else.</p><br/><p>“Then, what should we do? We’re out of time, aren’t we? His Majesty has returned. If we don’t meet him right away, we’ll be in trouble. That means we have to make a decision right away, about that ─ about the Forgemaster!”</p><br/><p>The Forgemaster had fled the country with the metal ingot which the Sorcerer King had entrusted to him.</p><br/><p>Needless to say, the act of running away with an item that another country had given to them for the purpose of making something was unforgivable.</p><br/><p>This black mark would be visible for all to see when the Dwarven nations made deals with other nations.</p><br/><p>It was a fatal blow to a country which traded on its smithing abilities.</p><br/><p>Who would commission any work from a country with such a bad reputation? Worse still, it was not an average blacksmith who had run off with the item, but a member of the nation’s leadership. It might well be interpreted as the nation pulling strings behind the scenes.</p><br/><p>As they imagined the future which might result from this, they began searching, all the while discussing what they should do if they could not find it.</p><br/><p>However, none of them could find an answer which would result in the Sorcerer King granting them his forgiveness.</p><br/><p>“…I still can’t believe he actually ran off with that ingot…” the Cabinet Secretary muttered, but those words had no meaning here. They were long past the point of feeling anything for them</p><br/><p>The commander-in-chief looked coldly at the Cabinet Secretary.</p><br/><p>“Then what should we do? There’s no doubt that he ran away with the ingot. We’ve also received eyewitness reports of the Forgemaster leaving.”</p><br/><p>“…Could he have been controlled by the Sorcerer King’s magic?”</p><br/><p>The room returned to silence in an instant.</p><br/><p>Nobody here actually expressed their agreement with the statement, but rather, the commander-in-chief grew more and more displeased.</p><br/><p>“Even if you don’t want to acknowledge this crime committed by a fellow Dwarf, by one of us, anyone who says that about the person who reclaimed the Royal Capital that we could not… simply put, that person is the scum of the Dwarves.”</p><br/><p>“─Don’t be like that, commander-in-chief. You should know as well; he searched the hardest among all of us, and he’s the most tired.”</p><br/><p>“I don’t think the problem can be explained by simply saying that he was fatigued…”</p><br/><p>“Well, let’s leave non-constructive talk like that for later, Commander-in-chief. We need to make a decision about more important matters now. Should we inform His Majesty right away? I feel it might be better to try and delay things and use the time to continue searching. What do you think?”</p><br/><p>The Merchant’s Guildmaster shook his head.</p><br/><p>“It’s a bad move. That leads to the problem of us covering things up. We might as well come clean and beg forgiveness. Besides, have we found him yet? For all we know, he might be in the belly of a magical beast now. If only we could recover the ingot… that idiot.”</p><br/><p>This was not something they should be saying about a friend, but nobody would speak out against the people rebuking the Forgemaster for causing such a big problem. On the contrary, the commander-in-chief even nodded in approval.</p><br/><p>“Fortunately, he didn’t take the shortsword as well. But, ah, well, if we apologize… will we be forgiven? …Well, it’s not like we can do anything but apologize.”</p><br/><p>“It’s important to apologize, but it’s even more important to state the truth. And after that, all we can do is accept whatever terms he dictates.”</p><br/><p>Everyone agreed on this.</p><br/><p>“Then, what will he demand from us?”</p><br/><p>The Dwarves did not know what metal made up the ingot which had been taken, so they could not estimate its value. This, they could not suggest payment in cash terms. If they underestimated the value of the item, they might end up angering the Sorcerer King beyond all hope of their relationship ever recovering.</p><br/><p>Therefore, they had to let the Sorcerer King name his price. Still, would he actually ask for money? They imagined that he would ask for something else, but even they could not imagine what exactly he would ask for.</p><br/><p>“I can’t think of anything. Let’s turn it around ─ what can we agree to? No… what requests should we deny him?”</p><br/><p>“Can we even do that? It would be hard, right? This city might have historical value, but we don’t have any national treasures of a physical or magical nature.”</p><br/><p>When the Demon Gods had rampaged through the Royal Capital, only one member of the Dwarven royal family had survived. He was the last king of the Dwarves, known as the “Runesmith King”, and after taking powerful magic items with him on his journey, there had been nothing left behind which could be considered national treasures.</p><br/><p>“…Oh! I’ve got it! What about the Treasury within the Royal Capital?”</p><br/><p>“We talked about this earlier, didn’t we? Saying that sort of thing to the person who reclaimed the Royal Capital for us is just too… Still, it’s also true that there’s nothing else.”</p><br/><p>Looking around, everyone nodded in a show of agreement.</p><br/><p>“…Hopefully, the Dragons didn’t destroy it.”</p><br/><p>“Don’t say that. …Then, let’s invite the Sorcerer King to enter by himself this time.”</p><br/><p>***</p><br/><p>Hm? There’s one less person. What happened?</p><br/><p>There was a strange expression on the faces of all the Dwarves as Ainz entered the room.</p><br/><p>The one who spoke for them was ─ well, they all looked the same to Ainz, so he had no idea who it was. All he knew was that it was certainly not the commander-in-chief. He began with “Thank you for reclaiming the Royal Capital” and launched into a long string of thanks, which made Ainz feel tired. Then, once he had forgotten what they were talking about in the first place, the commander-in-chief’s mood changed.</p><br/><p>“There is also another matter which we must tender our sincere apologies, Your Majesty. The ingot which Your Majesty entrusted to us has been stolen by the Forgemaster, who fled the nation with it. We are currently searching for him, but we have had no luck in finding him. …Your Majesty gave us that ingot and your trust, but yet an incident like this occurred on our part. We do not know where to begin apologizing.”</p><br/><p>The Dwarves bowed as one.</p><br/><p>Frankly speaking, Ainz had no idea what was going on. Therefore he asked:</p><br/><p>“Why would he do something like that?”</p><br/><p>Did running away with the ingot mean that he was going to sell it to someone? Was it financial greed that made one of the Dwarven nation’s councillors abandon his post?</p><br/><p>For a moment, Ainz wanted to say that there was a player involved, moving their hidden pawns in the Dwarven nation. However, a player would not need an ingot like that. It was not valuable enough to make people forsake their position, even for very low-levelled players That being the case, it would have been more advantageous to keep their subordinate hidden and in a position of power.</p><br/><p>“We don’t know. We honestly do not know. None of us have any idea why he would perform such a rash act.”</p><br/><p>“…Then, my next question: what about the armor I requested?”</p><br/><p>The Dwarves exchanged glances.</p><br/><p>“…We cannot possibly apologize enough for that. While he left the shortsword, he took the ingot, and we are unable to return it to you. We have already sent out search parties and we will return it once we find it. Then, if you will permit it, please allow us to offer a substitute for the armor. While it pales in comparison to the ingot you entrusted to us, it is the greatest effort we can muster.”</p><br/><p>“We plan to prepare three sets of adamantite chainmail, and then enchant them to the best of our ability.”</p><br/><p>“If ─ if you desire a shield, we can fashion one for you out of orichalcum.”</p><br/><p>“Umu…”</p><br/><p>Now if he were a malicious customer with a complaint, now would be the best time to make a scene. However, Ainz did not want to be such a customer.</p><br/><p>Still, the loss of the ingot─</p><br/><p>─Does it pain me? It’s not rare; I have many more like it. …And for all I know the metal isn’t found here, but it might be obtainable in other regions. That being the case, it’ll be better to have more suits of armor, right? They did say they were going to enchant them too… Plus, even if they do find that ingot, it’s not like they’re going to ask for all the other items back, right? That would make this a pretty good deal…</p><br/><p>“…If you don’t have it, it can’t be helped. Then, let’s leave matters at that. Discuss this with Zenberu later and prepare what he wants.”</p><br/><p>The Dwarves sighed in relief.</p><br/><p>Should he have given them a harder time? Still, it would be bad if people doubted his kingliness due to his pettiness. In that case, perhaps accepting their offer would allow others to view him as a generous person.</p><br/><p>Still, they ought to be alright with a request or two.</p><br/><p>“…Then, may I add another request to that?”</p><br/><p>“…What is it, Your Majesty?”</p><br/><p>Their stiff voices implied indicated that they were all on guard against him.</p><br/><p>“There is no need to be so tense. It isn’t a big matter, after all. I simply wish your country’s support for the matter of recruiting runesmiths.”</p><br/><p>“What, what do you mean by that?”</p><br/><p>“Could you hold a ceremony in this country and make a public announcement about them working in my nation? That would surely make them happy.”</p><br/><p>The Dwarves looked at each other and nodded instantly.</p><br/><p>“Really now. Then please allow my nation to handle the matter of catering. Preparing for these will take some time, so I hope you won’t mind my staying here for a while.”</p><br/><p>There were no objections from the Dwarves.</p><br/><p>Ainz smiled in his heart. Now he would not need to return to E-Rantel.</p><br/><p>At first, he thought he would have to spend more time on all this, but in the end he had taken back the Royal Capital in a flash. That was bad.</p><br/><p>The first reason was because he wanted to inform Albedo about the Empire’s request for vassalage with [Message], so she could plan it with Demiurge. Things would be very bad if he were present. Therefore, Ainz needed a reason to not go back.</p><br/><p>Also, he wanted to improve his friendly relationship with the Dwarves, which was also a very understandable reason.</p><br/><p>Ainz also wanted to learn three pieces of information from the Dwarven city:</p><br/><p>1: The presence or absence of players. If there were none now, there might still have been some around in the past.</p><br/><p>2: Further investigation of runes and related information. He did not know enough about this topic. He had already learned quite a bit from the runesmiths; runes had been around for a long time, but it was unclear when exactly they had appeared and who had introduced them. Part of the reason was the chaos of the Demon Gods’ attack, but Hejinmal’s books did not contain any information on this, and neither did the Treasury.</p><br/><p>3: Knowledge on smithing and ores. Now that he had enlisted the runesmiths to his cause, all he had to do was slowly tease that information out of them. However, there did not seem to be any of the prismatic ores here, as expected.</p><br/><p>Regarding the second point, Ainz intended to have the Dwarves find out more when after they returned to the Royal Capital in the future, which was why he needed a firm friendship with them.</p><br/><p>***</p><br/><p>The long lines of tables were set with many plates, each of which was laden with a sumptuous variety of dishes.</p><br/><p>The piping hot food exuded a bewitching aroma, which drifted over to Ainz.</p><br/><p>As one of the undead, Ainz had no desire for food, but the remnants of Suzuki Satoru did. His wish to try some and his curiosity over how it would taste pricked at him.</p><br/><p>This body does have its good and bad points…</p><br/><p>He could curb his hunger, but not his curiosity. After all, his curiosity was part of his mind, which was not affected by his undead body.</p><br/><p>Perhaps if the dishes before him were made by the chefs of E-Rantel or Nazarick, it might not piqued his curiosity so, but these were made by Dwarves.</p><br/><p>Since the runesmiths wanted to bring their entire families to the Sorcerous Kingdom, they had their wives, mothers, daughters and other female relatives cook for the event. Of course, most of the 2’000 shares of food here today were supplied by Ainz ─ by Nazarick.</p><br/><p>Of course, Ainz was not a person who would use items wastefully, so most of these were essentially E-Rantel’s cuisine. The meat had been collected by the Dragons from this mountain range, while the wine had been sourced from the Kingdom and the Empire by those traders who remained in E-Rantel.</p><br/><p>The tables were groaning with plates of food, but even now the ladies were still serving up the food they had made.</p><br/><p>There was little difference in the external appearance of Dwarven males and females. The biggest difference lay in their beards. Male beards were very long, and they were typically woven into three braids, while female beards were sparser. That said, sparse still meant that their beards resembled those of human males. However, the ladies seemed to have a habit of trimming the whiskers under their noses.</p><br/><p>I don’t really see how it’s a habit… Well, that’s culture for you. The Sorcerous Kingdom has gathered all sorts of humanoids. Probing too deeply about this sort of thing might cause problems in the future.</p><br/><p>Ainz turned his gaze away from the ladies who were still serving food. His eyes crossed the countless Dwarven heads before him and rested on the raised platform in front of him.</p><br/><p>Some of the smiths bound for the Sorcerous Kingdom were standing with the members of the Council.</p><br/><p>And then, the Council informed them about the migration to the Sorcerous Kingdom.</p><br/><p>“It has begun.”</p><br/><p>“So it has.”</p><br/><p>The answer came from Gondo, who stood by Ainz’s side.</p><br/><p>“…You’re their representative. Is it alright if you don’t stand out there in front of them?”</p><br/><p>“Give me a break, Your Majesty. I’m almost useless as a runesmith. It would be a shame to let someone like me represent them. …Wouldn’t you be a better choice, Your Majesty?”</p><br/><p>Ainz and Gondo locked eyes for a moment, and then they chuckled.</p><br/><p>Naturally, Ainz simply did not want to stand on the stage to meet and greet people. His earlier words were simply something he had forced out.</p><br/><p>“Still…” Gondo’s face turned serious. “I can’t thank you enough, Your Majesty.”</p><br/><p>“Why is that?”</p><br/><p>“This farewell party. Please look at the people on stage.”</p><br/><p>Ainz looked at the stage once more. They were not finished speaking, and that was all that came to mind. However, it would be a bit insensitive to say that he had not noticed anything after Gondo had brought it up.</p><br/><p>“Umu… I see…”</p><br/><p>In the end, he simply used the appropriate answer as a smokescreen.</p><br/><p>“It is as Your Majesty surmises. Everyone’s eyes have changed.”</p><br/><p>“Indeed, they have,” Ainz replied without thinking, though he still had no idea what was going on. “Still, why is that?”</p><br/><p>Gondo chuckled, like he found it amusing.</p><br/><p>“It is the joy of feeling admiring gazes on them once more. Today’s ceremony ─ with dishes made with ingredients never seen before, as well as all kinds of alcohol ─ was to let the runesmiths realize that they weren’t being sold, but being hired by the Sorcerous Kingdom.”</p><br/><p>“I’ll be expecting great things of them, you know?”</p><br/><p>“Mm. I remember I once said that I would repay Your Majesty’s kindness. That applies to the others as well. Thank you very much. Oops, looks like it’s about time, Your Majesty.”</p><br/><p>After taking a large stein of beer from Gondo, he thumped it against the table like the others were doing. Ainz then raised a tiny cup of liquor in a toast, and then gave it back to Gondo because he could not drink it.</p><br/><p>The Dwarves ─ who had been holding themselves back all this while ─ burst into activity. Many Dwarves flocked towards the food, gorging themselves nonstop with the dishes on display.</p><br/><p>“What’s this? It’s amazing! Did your wife really make this?”</p><br/><p>“Mm. His Majesty provided the ingredients. We had a lot of failures while trying it.”</p><br/><p>“Mhm. It’s good, that’s a fact. But to an old fogey like me, it could stand to be a bit blander.”</p><br/><p>“You’re meant to wash it down with wine.”</p><br/><p>“What? Let me try… Ohoh! Incredible! The taste is just right!”</p><br/><p>“The wine’s good too. I wonder if my wife could make this too?”</p><br/><p>“It seems that the Sorcerous Kingdom will be sending us food for some time. Looks like we’ll be eating well, then.”</p><br/><p>“I’d rather have their wine. This is from the Sorcerous Kingdom, right? Better be prepared to pay!”</p><br/><p>They talked at the top of their voices as they ate. And then─</p><br/><p>“I envy those runesmiths. They get to eat this sort of thing whenever they like?”</p><br/><p>“No, these should be pretty expensive, right?”</p><br/><p>“Doesn’t seem that way, does it? Look, in human countries, vegetables are cheap. Seems to be the same way with the Sorcerous Kingdom too.”</p><br/><p>“Mm, they really are a fortunate lot. And, I only had a bit, but is it me or is the Sorcerous Kingdom’s wine top-notch stuff?”</p><br/><p>“Umu. I only had a sip of that myself. Ahhhh, that was delicious. Still, grape wine is good; though maybe not that strong.”</p><br/><p>“Don’t we have a reason to visit the Sorcerous Kingdom?”</p><br/><p>“I’ve heard tell that they’re planning to let the citizens of both countries move freely between them.”</p><br/><p>“Oi oi, Everyone here’s pretty highly-placed, but shouldn’t you be more careful about letting that sort of thing get out?”</p><br/><p>“Nah, seems they’re going to make a public announcement. In the future, this country will be active in a lot of places… and although this is just a rumor, they say that we took back the Royal Capital.”</p><br/><p>“…Rumor has it that the Royal Palace was a nest of Dragons. The Sorcerous Kingdom is really amazing.”</p><br/><p>Naturally, Ainz picked up on those words as well.</p><br/><p>Rather than praise Ainz directly, their opinion of the Sorcerous Kingdom seemed to have gone up instead. That probably meant they could continue being friends in the future.</p><br/><p>Ainz smiled in satisfaction, and turned to Gondo again.</p><br/><p>“Go speak to them, Gondo. I may not be back for a while.”</p><br/><p>“Is that so. …Then I shall go talk with those chaps from the mines.”</p><br/><p>Gondo was looking at a Dwarf with an evil look in his eyes.</p><br/><p>“And what will you be doing, Your Majesty?”</p><br/><p>“…A messenger from my country has come. I need to meet them. Then, see you again.”</p><br/><p>Ainz raised his hand in farewell, and walked away.</p><br/><p>He had originally been standing in a corner of a vast, spacious room. He opened the door to leave and headed for a guest reception room cum lounge room cum parlour.</p><br/><p>It was quite a luxuriously furnished room, with tables, chairs, cabinets and the like. Demiurge was standing there.</p><br/><p>“Forgive me for making you come all this way.”</p><br/><p>“Certainly not. Your location is where I should be headed, Ainz-sama.”</p><br/><p>Ainz walked across the room and sat in a chair. Then he bade Demiurge to take a seat as well.</p><br/><p>“…I’ve seen the reports. I’m working here, so I must apologize for having you put them in writing instead of just delivering them by mouth.”</p><br/><p>The reports in question detailed Demiurge’s preparations and activities in the Holy Kingdom. Of course, if he heard them from Demiurge himself, it might damage Ainz’s disguise. This had also been taken into consideration.</p><br/><p>“…Even so, you’ve done well as I expected, Demiurge. Your accomplishments can only be described as outstanding.”</p><br/><p>“Thank you very much, Ainz-sama.”</p><br/><p>Demiurge bowed.</p><br/><p>“Still, I could not hope to equal your feats, Ainz-sama… You have firmly secured a place in the Dwarves’ hearts.”</p><br/><p>Ainz thought that he must surely be referring to how he reclaimed the Royal Capital, or recruiting the runesmiths. However, was that really the case?</p><br/><p>“…Hm, so it seems you’ve seen through it already, Demiurge. Do you think the Dwarves have noticed?”</p><br/><p>“Rather than notice it, I think they have no other alternative.”</p><br/><p>Why wasn’t there anyone else here? If only there were, he could use his usual tactic. As Ainz studied Demiurge in detail, he noticed a smile on his face.</p><br/><p>…What’s so funny?!</p><br/><p>Demiurge’s smile made Ainz’s nonexistent stomach ache. Albedo’s smile was similarly terrifying. The idea that they might have seen through his act made his nonexistent heart pound faster.</p><br/><p>“If… if the Dwarves see through it, what do you think I should do?”</p><br/><p>“I doubt that will be a big problem. After all, you did provide the catering for the runesmiths’ farewell party. With that, you can shrug off anything the Dwarves say.”</p><br/><p>…What’s he talking about?</p><br/><p>“I trust it’s not important, then.”</p><br/><p>Now that his attempts to lead Demiurge on had failed, Ainz decided to leave it at that. Asking too much about an intelligent person like him was very dangerous.</p><br/><p>“Then, how goes the vassalization of the Empire?”</p><br/><p>“Yes. Albedo and I have discussed the matter and we have drawn up a draft. After that, we hope you will look over it and share your opinions with us.”</p><br/><p>If Demiurge and Albedo finished it together, then I won’t need to step in. Ainz thought that, but did not say it.</p><br/><p>“…Have you given the Empire enough benefits? Enough that the neighboring countries will look at the Empire and think, ‘life will be good for us once we become vassals of the Sorcerous Kingdom’, or something along those lines?”</p><br/><p>“It will be fine.”</p><br/><p>Ainz muttered “Yes” in his heart. In that case, he could give it his OK without even looking at the draft.</p><br/><p>“Even so, your achievements in the Dwarven Kingdom and the Empire were truly breathtaking. I imagine the term ‘fathomless wisdom’ exists to describe you, Ainz-sama.”</p><br/><p>“Certainly not. I’m confident you could have done this easily as well, Demiurge.”</p><br/><p>Demiurge revealed a rare expression ─ a bitter smile. Then he shook his head.</p><br/><p>“Indeed, if that was all. Even so, how far into the future have you predicted the course of the Sorcerous Kingdom?”</p><br/><p>Not even tomorrow. But of course, he could not say that.</p><br/><p>Ainz wondered what sort of answer would fit the style of a ruler. Just then, he remembered a guild name from YGGDRASIL.</p><br/><p>It was called Millenium Kingdom.</p><br/><p>If only the Sorcerous Kingdom could really last a thousand years. Perhaps it was because of that thought, but a relevant memory came to mind.</p><br/><p>He had no idea why the guild’s emblem was that of a crane, and so Ainz had asked Yamaiko about it. After that, she told him that it was because Cranes were said to live for a thousand years in mythology. Similarly, tortoises would live for─</p><br/><p>“─Ten thousand years.”</p><br/><p>Ainz frowned as the words slipped out. He had accidentally overstated the scale. Just as Ainz hurriedly looked toward Demiurge, intending to correct himself, he realized that it was already too late.</p><br/><p>“To, to think your plans were of such a grand scope…”</p><br/><p>Demiurge’s eyes went wide, and those jewel-like pupils of his shone even brighter.</p><br/><p>Ah, this is bad.</p><br/><p>“I was kid─”</p><br/><p>“─That being the case, things like spreading the undead around must surely be to encourage the other nations to rely on you rather than viewing our troops as dangerous elements, Ainz-sama. That must be the right answer for someone who views the world from such a wide angle. Still… how fearsome you are…”</p><br/><p>Ainz did not know what he was saying, but he knew there was only one thing he could do at this point. “Well done, Demiurge, you have completely anticipated my plans, as I expected.” However, he could not use that tactic all the time. Therefore, this time, he would say ─</p><br/><p>“Fufufu, I haven’t thought that far ahead, Demiurge.”</p><br/><p>“…Is that so. Understood. I shall carve this matter into my heart.”</p><br/><p>As he saw Demiurge’s gentle smile, Ainz’s heart flooded with cold sweat.</p><br/><p>Eh? What? What’s going on? …I’m not too sure, but doesn’t this mean I’m in an even more precarious situation now?</p><br/><p>However, Ainz had not thought of any solutions. Then, he would have to deal with it with a fake smile.</p><br/><p>“Fufufu… I’ll leave it to you then, Demiurge.”</p><br/><p>“Fufufu… Understood, Ainz-sama.”</p><br/><p>In contrast, Demiurge’s smile shone even brighter than before.</p><br/><p>Even though he wanted to cry, Ainz managed to pull himself together enough to ask a question in a trembling voice.</p><br/><p>“…Then, Demiurge. About the report you sent… when do you think it will take place?”</p><br/><p>“It will begin in the fall, but I shall have to trouble you in the winter, Ainz-sama. The beginning should be fine, but once the opposition makes their move as well, there might be some discrepancies even if we manage to manipulate them.”</p><br/><p>“Well, you did plan this after all, Demiurge. I can leave it to you in peace.”</p><br/><p>“Thank you very much, Ainz-sama. As for the matter of the Empire’s vassalization─”</p><br/><p>“─I’ll listen in detail once I return. Can you give me a copy of the plan first?”</p><br/><p>“Understood.”</p><br/><p>“…Then, I look forward to how this project of yours will unfold, Demiurge.”</p><br/>\n</div>"}