{"title": "Chapter 90 - Volume 12", "id": 90, "volume": 12, "url": "http://boxnovel.org/overlord-ln-chapter-90-volume-12", "volume_title": "Volume 12", "body": "<h1>Chapter 90 - Volume 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Volume 12 Chapter 3</p><br/><p>Beginning the Counterattack</p><br/><p>Part 1</p><br/><p>The carriage was shaking.</p><br/><p>This carriage was the property of the Sorcerer King, and in contrast to its plain appearance on the outside, its interior was classy, refined, and functional to boot. Neia was particularly grateful for the soft cushions that did not hurt her butt no matter how long she sat on them.</p><br/><p>Neia peeked at the Sorcerer King, who was seated opposite her and gazing outside.</p><br/><p>He may be a fearsome undead king, but she did not feel the oppressive grandeur he had shown when he had met them in the audience chamber.</p><br/><p>This was probably because she had spent more time conversing with the Sorcerer King during their journey.</p><br/><p>During all this, one thing which Neia had learned was that the Sorcerer King was extremely magnanimous.</p><br/><p>It was true that the Sorcerer King acted with the dignity of a sovereign, his every action reflecting his quality as a monarch.</p><br/><p>However, when Neia sat in the carriage with him, he would act like an ordinary person from time to time. In addition, these occurrences had been getting more and more frequent recently.</p><br/><p>In all likelihood, the Sorcerer King had considered that Neia would be nervous while sharing the same carriage as him, and in his generosity, he had chosen to act more like a commoner. The reason why such incidents were recurring more and more were surely because his skills were improving.</p><br/><p>The reason why he did not act that way around the others was probably because they were still playing the role of paladins.</p><br/><p>To think he would treat another country’s citizens this way… what a compassionate man he is…</p><br/><p>What was he looking at? Was he looking at the paladins riding alongside the carriage? Or perhaps something else, something that Neia did not see—</p><br/><p>“Hm? Is there something interesting on my face?”</p><br/><p>“Eh! —No, my apologies, Your Majesty! There’s nothing on your face…”</p><br/><p>It would seem she had been staring too intensely at the Sorcerer King. Puzzled, the Sorcerer King touched his face with those bony hands of his.</p><br/><p>“I suppose it must be quite awkward to sit in a carriage and not say anything. Yes, in that case, let us speak.”</p><br/><p>Although she had gotten slightly used to it, conversing with the Sorcerer King always made her stomach ache.</p><br/><p>“We are not entirely familiar with each other, so previously I did not ask questions which might have intruded on your privacy, but we have shared the same carriage for several days now. I suppose we can be honest with each other now. Neia Baraja. Can you tell me about yourself?”</p><br/><p>“About me?”</p><br/><p>Even talking about herself was too vague a topic. She had no idea what she could say to please the Sorcerer King.</p><br/><p>“Yes, indeed. For instance, why you wanted to become a squire. What sort of work a squire does. Could you tell me about that?”</p><br/><p>“If it pleases you, Your Majesty.”</p><br/><p>After bowing her head, Neia began talking about what had been asked of her, but it was hardly an exciting topic. Talking about family and the work of a squire was not particularly interesting.</p><br/><p>Besides, I was told not to reveal anything to the Sorcerer King about matters within the country but this much ought to do.</p><br/><p>Rather, if she had to cover up even those details, then there would really be nothing to talk about.</p><br/><p>Soon, the drab exposition with no structure ended, and the Sorcerer King nodded deeply.</p><br/><p>“I see, I see. So you’re an archer, a rarity among squires, Miss Baraja.”</p><br/><p>“My skills aren’t good enough for me to proudly call myself an archer, Your Majesty. I am simply better at archery than swordsmanship, and the truth is that people have scolded me and told me I ought to focus more on training up my sword skills.”</p><br/><p>To Neia, an archer was someone like her great father, and she was only a little more talented than a commoner.</p><br/><p>“…No, I should say that a paladin candidate who has an affinity for ranged weapons is quite a rare thing. If it were me, I would advise you to hone your bow skills. Since there are others better suited to swordplay, then you should let those people handle swordsmanship.”</p><br/><p>“—Thank you very much.”</p><br/><p>The Sorcerer King’s words were sincere, and it made Neia feel that he was earnestly thinking, What an odd combination; she must be travelling a path towards a rare vocation. However, she had no idea what to make of what the Sorcerer King said next, and his mutterings bothered Neia.</p><br/><p>“I feel embarrassed about dumping the work of minding me onto you. Nor is it just you; the same goes for the rest of you paladins. The best way to make use of your skills would be to station you outside.”</p><br/><p>His gentle words made Neia stare at him.</p><br/><p>This was why talking to this king was so bad for her heart.</p><br/><p>Not only did he stand at the peak of his country, he was also an individual of overwhelming might. Yet he had not chosen to talk down to her from above, but he had lowered himself until he could see eye to eye with her before engaging her in a conversation.</p><br/><p>No! I can’t let His Majesty spoil me like this! If I don’t lower myself a little more—</p><br/><p>Neia pulled herself together.</p><br/><p>“Everyone knows I have been designated as Your Majesty’s follower, so please do not take it to heart. In addition, there is no job more important than accompanying Your Majesty.”</p><br/><p>“Really now… Still, I would like to offer you some form of recompense.”</p><br/><p>In the past, the Sorcerer King had mentioned the topic of payment. She had declined, of course, but it would seem he was bringing up that topic again. Neia immediately began to think about how to reject his offer without causing offense, but the Sorcerer King was not finished yet.</p><br/><p>“That said, it might not be good to receive a gift from the king of another country. So at the very least, allow me to verbally express my thanks. I believe I have inconvenienced you in many ways, and I hope I will continue to be in your care.”</p><br/><p>And then, the Sorcerer King bowed to her.</p><br/><p>A king was actually bowing to someone like herself, who was nothing more than a squire.</p><br/><p>It was only natural for a king to carry the weight of his nation upon his shoulders. Slighting a king would be the same as slighting the entire country. The idea that a country lived through its king was a very common notion.</p><br/><p>In other words, the fact that a king was bowing was the same as a nation bowing. Of course, it was hardly unthinkable when a king did so to someone of high station.</p><br/><p>However, Neia was little more than a citizen of another country, and frankly speaking, there was no need for him to apologize to someone of Neia’s stature.</p><br/><p>I can’t believe it. His Majesty is wise and sagacious, and surely he must know the meaning of bowing. Even so, he still bowed to me like an ordinary person— No. Don’t get full of yourself. I can’t possibly be that valuable. This simply shows how magnanimous the Sorcerer King is; he even treats a commoner politely. —Ah! He mustn’t!</p><br/><p>“Please do not do that! Your Majesty! Please raise your head!”</p><br/><p>Yes. That was what she should have said before anything else.</p><br/><p>The Sorcerer King looked up, and Neia sighed quietly. Frankly speaking, if anyone else had seen what had happened just now, something terrible would have happened.</p><br/><p>“Your Majesty—”</p><br/><p>Neia took a knee within the cramped confines of the carriage’s floor.</p><br/><p>“Your servant is of humble origins, but I swear that until Your Majesty’s work is complete, I will loyally and faithfully serve you.”</p><br/><p>Since a king had given her his respect, it was only natural that she return it.</p><br/><p>Neia ignored the voice in her head which said that he was not the king of the Holy Kingdom, and bowed.</p><br/><p>“No, no. Raise your head… Come now, could you take a seat and continue your previous topic? We haven’t reached our destination yet, have we?”</p><br/><p>“No, not yet.”</p><br/><p>She sat back onto the cushion, and looked outside.</p><br/><p>“Yesterday, we passed safely through the ruins of the wall by the grace of Your Majesty’s power. We have chosen a route that will make us harder to discover, so it may take a little more time, but I believe we will arrive at our base tomorrow, or the day after.”</p><br/><p>Although, said base was just a cave.</p><br/><p>“Is that so? Even then, we still have some time, do we not? Tell me about the topic from just now. Also, I have not yet heard why you have your sights set on becoming a paladin. Given your talent for the bow, surely there must have been some other path you could have taken. Why aim to be a paladin? For the sake of justice? Or perhaps to be the pride of your nation?”</p><br/><p>“No—” When she narrowed her eyes, what came to mind was her personal experiences. “—My mother was a paladin.”</p><br/><p>She was a paladin who was skilled with the sword, completely unlike Neia.</p><br/><p>“I see, so you heard something from your mother, or you admired her, hm.”</p><br/><p>“Ah, no. My mother often said I shouldn’t aim to be a paladin. And my mother couldn’t do the work of being a mother, and while she could do the laundry and sew, she was completely inept at cooking and that sort of thing. She did everything sloppily, the roast meat was always undercooked, that sort of thing was common.”</p><br/><p>Therefore, it was only natural that her father had been the one who cooked in their household. When she was young, she even thought that it was true for all families.</p><br/><p>“…Is that so? Well, she still didn’t stop her daughter from becoming a paladin, so I guess she was still a good mother.”</p><br/><p>“Ah, no. When I told my mother I wanted to be a squire, she went and took out her sword and said, ‘I’ll let you if you can defeat me!’ and so on. The only reason why I was allowed to become one was because my dad desperately blocked for me. If I had fought her normally I could never have beaten her.”</p><br/><p>That was the first time she had understood the meaning of killing intent.</p><br/><p>“…Ahhhh, mm, good, how shall I say this… it was a good family… mm.”</p><br/><p>“Yes. While the neighbors often looked strangely at us, I thought it was a good family.”</p><br/><p>“…Really, how nice… th-then, why, why become a paladin? Did you not think to follow your father’s path— Hm. Was your father a househusband?”</p><br/><p>“No, my father was also a soldier who served his country. However, I never really thought of following in my father’s footsteps… why was that. Maybe it’s because dad gave me these eyes, so I sort of ended up resenting him for it…”</p><br/><p>Neia pressed her index fingers to the corners of her eyes and tugged them around in circles.</p><br/><p>When she was young, her friends often said, Why are you staring at me? Are you angry with me? and the like, and she had often complained to her father for it. After that, Neia had been beaten by her mother, who had overheard her saying so.</p><br/><p>Thinking of them was quite nostalgic, Neia thought.</p><br/><p>“But perhaps after becoming a squire, I became more open-minded. At some point, I started to think that this was a gift from my father. Well, I could do without the fierce glare, though.”</p><br/><p>“How are your parents now?”</p><br/><p>“My father fought Jaldabaoth’s army at the wall and died. I lost contact with my mom, and I don’t know what happened with her, but I think she must have died during the defense of the city. After all, she was the sort who would have struggled to the bitter end.”</p><br/><p>“It seems I have inquired about a painful topic.”</p><br/><p>The Sorcerer King bowed to her once more. Since this was the second time, the impact was not so great. However, it was enough to make Neia feel anxious.</p><br/><p>“Please, please raise your head! How could you bow to someone like me!?”</p><br/><p>“I thoughtlessly inquired about your dead kin. Although I did was not aware of that beforehand, now that I know the facts, an apology is still in order.”</p><br/><p>The Sorcerer King tilted his head after he raised it.</p><br/><p>No, that’s not right, that’s how it should be between equals. A king is not the equal of a citizen from another country. Moreover, we’re the ones requesting his help…</p><br/><p>“Erm— well, such exceptions are everywhere. Er, if someone sees Your Majesty bowing to me — ah — they might look down on Your Majesty, because I’m just a squire, after all.”</p><br/><p>“…Umu, I see, you do have a point. That’s how kings are.”</p><br/><p>These things are complicated, the Sorcerer King muttered.</p><br/><p>He must have meant that it was difficult to mix with people from other nations even if he wanted to show his sincerity, probably.</p><br/><p>“Yes. While this cannot begin to count as an apology, I shall lend this to you, Miss Baraja.”</p><br/><p>The Sorcerer King swiftly reached into his robe and produced a bow.</p><br/><p>—Hah?</p><br/><p>It was bigger than what could have been hidden inside his robes. Neia blinked several times, but reality refused to change.</p><br/><p>“This is a magic weapon. Use it to protect me.”</p><br/><p>Portions of the bow were made with animal parts, but it did not feel raw or gory; instead, she felt an air of holiness around it.</p><br/><p>She could tell at a glance. In other words, this bow was a masterwork which needed to be described with the word “super.”</p><br/><p>“This is the Ultimate Shootingstar Super, made with the ancient art of runecrafting. For various reasons, I was carrying it on me to lend it out to someone else. Ahh, normally there would be runes carved here, but you can’t see them now because of wear and tear. What do you think?”</p><br/><p>Neia used all her strength to suppress the urge to cry out.</p><br/><p>Typically speaking, she ought to refuse it. This was very likely to be a national treasure of the Sorcerous Kingdom. However, would anyone lend such a treasure to a follower from another country?</p><br/><p>Maybe it just looks amazing — as if! This, it’s definitely a very powerful weapon!</p><br/><p>“What do you think? Will you not accept it? Your job is to keep me company and protect me, is it not? In that case, it would be good to equip you with a better weapon, am I wrong?”</p><br/><p>“Ngh!”</p><br/><p>He was right.</p><br/><p>Neia felt her head spinning around.</p><br/><p>“Ahh, my apologies. Is it because it looks too showy? In that case, I have something more sedate, the Great Bow Special, which is also a product of runecraft.”</p><br/><p>Saying so, he reached into his robe again—</p><br/><p>“P-Please do not trouble yourself! I am more than satisfied with this one! Please allow me to politely decline!”</p><br/><p>Neia’s words came out as a mournful cry as she begged the Sorcerer King to stop producing any more weapons. If he took out another weapon in front of her, Neia did not think she would be able to retain her senses, and lending it to her would probably entail that she had to spend the whole day on maintaining it.</p><br/><p>“Your Majesty! I humbly accept this Ultimate Shootingstar Super which you have bestowed upon me!”</p><br/><p>She took the bow with trembling hands.</p><br/><p>Given its accessories and decorations, it looked to be very heavy, yet it felt surprisingly light in the hand. In the moment she took hold of it, she felt her body strengthening, as though power were coursing into it, or was that just due to the shocking lightness of the bow?</p><br/><p>Ah, this is bad. I wanted to reassure myself with the thought that this was nothing more than a fancy-looking magic item. This… this is definitely a bad thing. For all I know… This might be better than the holy sword… eh? Wait, wait a minute… no, surely it can’t…</p><br/><p>“Do you? To me, that’s hardly worth being proud of, you know? If you’d like some other — if you’d like a better weapon, please let me know.”</p><br/><p>This was bad. If this sort of thing continued, if she kept hearing about it, things would become extremely bad. She could not begin to imagine what would happen if a squire ended up with better gear than the top ranking person in the Holy Kingdom.</p><br/><p>“Thank you very much, Your Majesty. I am very grateful that you have spent so much time considering someone like myself…”</p><br/><p>Letting someone else hold this would be very dangerous, so Neia clutched it tightly to herself.</p><br/><p>She smiled to the Sorcerer King while she nodded. While the smile was a little stiff, she had managed to skillfully conceal her thoughts.</p><br/><p>“If others see this, tell them I lent it to you.”</p><br/><p>Can’t I not let them see it? If possible, I’d rather wrap it up or something — but I can’t do that with a weapon His Majesty lent me to protect him… Ahh… wait, my head’s starting to hurt. So something like this is nothing to be proud of… His Majesty’s standards are just too high… Will I have to pay him back if I damage this bow? Me? Ahhh, my tummy hurts… I wish I didn’t have to think about this bow… Ah!</p><br/><p>Neia thought of a wonderful topic she had not yet mentioned.</p><br/><p>“Your Majesty! I saw those huge and grand statues of yourself in Your Majesty’s country!”</p><br/><p>“—Hoh.”</p><br/><p>He responded in a quiet voice that was tremendously different from the one he had used in the past. It made Neia uneasy about whether she had made some sort of mistake.</p><br/><p>He had named his country after himself. Thus, Neia guessed that the Sorcerer King was eager to show himself off, which was probably why he had built those huge statues of himself to proclaim his might to those around him.</p><br/><p>Did I not praise him enough?</p><br/><p>“Those statues not only showed off Your Majesty’s greatness, but they also demonstrated your power as well! We don’t have any statues like that in the Holy Kingdom!”</p><br/><p>That was most definitely not a lie. Size notwithstanding, one would need engineering techniques that had been refined down to an art in order to produce such a life-like product. There was a similarly-sized statue of a Sea Dragon at a place called Lighthouse Cape, but it was cruder, and it looked quite pathetic after being worn away by the elements.</p><br/><p>“My subordinates often say that.”</p><br/><p>Ahhhh, is that it? He’s heard praise like that from his subordinates, so this much is only to be expected, is that what he means?”</p><br/><p>“My subordinates are now planning to raise statues like these in various places of my nation.”</p><br/><p>“I see. Indeed, it would be a good way to declare the glory of Your Majesty!”</p><br/><p>The Sorcerer King looked at Neia in what seemed like surprise.</p><br/><p>“…Uh, mm. Still, I feel that placing statues of myself within my country is a little… how shall I put this? Even so, my subordinates built statues of myself that are over a hundred meters tall in the middle of the city in order to show me off to the world… I think they’ve gotten carried away with the concept of bigger is better.”</p><br/><p>“But why is that?”</p><br/><p>The Sorcerer King coughed to clear his throat, and that was when a question arose in Neia’s mind, Did the undead still have throats to clear? However, the Sorcerer King was speaking as that question echoed in her head, and she could not interrupt him.</p><br/><p>“A king’s greatness cannot be shown with physical objects.”</p><br/><p>“Ahhh!”</p><br/><p>Neia was shocked, but that was only to be expected.</p><br/><p>Neia had not only forgotten that the Sorcerer King was undead, but had come to harbor feelings of genuine respect for him.</p><br/><p>This man was truly a King.</p><br/><p>Suddenly, she saw the Sorcerer King clenching his fist out of the corner of her eye.</p><br/><p>“Of course, declaring my greatness to the world by allowing my people to live without impediment is a different matter. But showing it off with statues of myself is… well. I wish to be known by the peace of my rule.”</p><br/><p>“It is as you say!”</p><br/><p>Neia gulped, and then asked a question.</p><br/><p>“Your Majesty is one of the undead, but why do you spend so much time thinking of the people?”</p><br/><p>Neia did not think the Sorcerer King’s compassion for the masses was an act. She even began to wonder if he was even undead.</p><br/><p>“…I have not spent much time pondering that. But doing that much should be par for the course, no?”</p><br/><p>Neia was shocked.</p><br/><p>Were all kings such amazing people?</p><br/><p>Could the Holy Queen and the nobles rule the people with these thoughts in their heart?</p><br/><p>Or — was it because he was undead? Did he have this perspective because he was undead?</p><br/><p>Neia could not answer that question.</p><br/><p>“Also, if it really was one hundred meters high, there’d be complaints about things like not getting enough sunlight and so on.”</p><br/><p>The Sorcerer King followed up with what sounded like a joke, which only served to drill the humility of this incredible monarch into Neia’s heart once more. This man was truly a King of Kings.</p><br/><p>♦ ♦ ♦</p><br/><p>As the Sorcerer King had pointed out earlier, the Holy Kingdom Liberation Army’s base was a natural cave in a mountain.</p><br/><p>There was an underground spring in one corner of the cave, and while the ceiling was not very high, it was very spacious, enough for a horse and carriage to enter. In addition, mushrooms, which emitted bluish-white light sprouted all around — around half the height of a man — so they did not need other sources of light.</p><br/><p>The reason why they knew of this place was because the paladins had once been sent here to exterminate a monster which had made this location its lair.</p><br/><p>After they fled here, they refurbished the place and divided it into several sectors, each serving a different purpose. They had even managed to make their sleeping quarters look like proper rooms. They cut down the trees around the mountain — each of them around one hundred meters tall, and made simple furnishings and furniture from them.</p><br/><p>But ultimately, it was just a cave.</p><br/><p>There were a total of 347 people here: 189 paladins, 71 priests — including trainees and other such personnel — as well as 87 commoners with nowhere else to go. Naturally, hoping for a private room was out of the question.</p><br/><p>Even so, they could not let the king of another country stay with everyone else.</p><br/><p>Of course, there was the wish to minimize contact between the undead Sorcerer King and the citizenry of the Holy Kingdom, as well as the desire to keep him from coming into contact with the secret information within their base, and other considerations on the part of the Holy Kingdom.</p><br/><p>However, they could not say that they would like him to use teleportation magic so he could take his rest in the Sorcerous Kingdom instead.</p><br/><p>In the end, they had to forcibly move others’ things away and create a private room for the Sorcerer King.</p><br/><p>Under normal circumstances, they would have sent messengers to report the arrival of the Sorcerer King’s arrival and have the others make preparations to receive him, but the Holy Kingdom was now in the thrall of demihumans. They could not send out paladins, who had poor enemy detection abilities, as outriders. In addition, Neia was now in the Sorcerer King’s carriage and waiting outside the cave. The people in the cave were frantically moving personal effects and transferring beds and cabinets and the like. In addition, they had already hung up a borrowed flag of the Sorcerous Kingdom.</p><br/><p>“…Hm.”</p><br/><p>“What is the matter, Your Majesty?”</p><br/><p>“…While I do not intend to insult you, I have a few questions about all of this which I hope you can answer to the best of your ability. It would seem you are not hiding your tracks; is that not a problem? Or will someone else take care of that?”</p><br/><p>The Sorcerer King delivered his question in a flat — as though he was reading off something — tone of voice, and then Neia’s eyes went wide.</p><br/><p>He was correct.</p><br/><p>They would leave tracks in the process of climbing this mountain, which was untouched by human hands.</p><br/><p>When one added the hoofprints of the paladins’ mounts to them, it would be immediately obvious. In that case, the fact that they had not yet been discovered was pure coincidence. Or was it?</p><br/><p>“Your, Your Majesty. We have not performed any concealment work until today; could it be they’ve deliberately let us off? …But why?”</p><br/><p>Neia’s voice trembled as she asked the Sorcerer King her question.</p><br/><p>Along this journey, Neia had become fully aware that the Sorcerer King before her was an extremely wise individual. Therefore, she thought that he might immediately supply her the answer, and her thoughts were not mistaken.</p><br/><p>“…There are many possibilities for that, but under normal circumstances, that would be the most likely one…”</p><br/><p>For a moment, Neia thought that she should not be listening to the Sorcerer King’s answer alone, but in the presence of the Captain. However, she could not control the curiosity welling up inside her.</p><br/><p>“Could it be because they do not wish to lose track of you — or rather, the Liberation Army?”</p><br/><p>“Lose track of the Liberation Army?”</p><br/><p>“Hm— well, I apologize for this comparison, but say you’ve found a nest of rats causing trouble, letting them run hither and yon would be very troublesome, no? The best thing to do would be to wait for all the rats to gather and then eliminate them all in one fell swoop.”</p><br/><p>He’s right! It’s just as His Majesty says. I find it hard to imagine any other possibility. He’s already thought this much in just a few minutes after coming to this place… it’s as though he knows exactly what the enemy is thinking, he’s amazing…</p><br/><p>“Well, as long as the situation stays the same, there will be nothing to worry about. However, I’m not just talking about the situation here. Changes on the enemy’s side might lead to a very high chance of being attacked, which would be troublesome.”</p><br/><p>Neia felt nothing but awed respect for the Sorcerer King’s intelligence as he highlighted the finer points of their circumstances.</p><br/><p>“Thank you very much, Your Majesty! I shall report this to the Captain right away!”</p><br/><p>“Then I shall go too.”</p><br/><p>“Eh? But surely you must be tired from the long journey. We have prepared a room for you, would it not be better to rest there for a while?”</p><br/><p>“Have you forgotten? I am undead, you know? I do not need to rest.”</p><br/><p>He was right. Neia had completely forgotten that.</p><br/><p>The undead were beings who did not feel fatigue. That was why trying to flee an undead being of comparable speed was very difficult, according to her lessons. While that was common knowledge, Neia’s experiences with the Sorcerer King had completely shattered her perception of the undead. At times, she even found herself thinking that he was just a human magic caster in a skeletal mask.</p><br/><p>“Thank you very much. Then, may I trouble you to come with me?”</p><br/><p>“But of course. And there is no need to thank me. Since we are here to defeat Jaldabaoth, we ought to be helping each other out.”</p><br/><p>While she knew that “we” in this case referred to the Holy Kingdom and the Sorcerer King, it could also be interpreted as talking about Neia and the Sorcerer King. That made Neia feel a little excited.</p><br/><p>Eventually, someone knocked on the carriage door from the outside.</p><br/><p>“Your Majesty, we have prepared a room for you.”</p><br/><p>Neia opened the door.</p><br/><p>When the paladin outside saw the bow Neia was holding, his eyes went wide in surprise.</p><br/><p>This was the first time she had brought the bow she had received from the Sorcerer King outside the carriage. That was because the Sorcerer King had not left his carriage ever since he had lent her the bow. In the end, nobody else had seen it until now.</p><br/><p>…You must be surprised, huh? Mm. I understand how you feel. This isn’t a weapon you’d let a squire carry…</p><br/><p>While the paladin bathed her in his gaze, Neia turned to face the carriage and bowed.</p><br/><p>Though she was simply looking at the ground, after sensing that the Sorcerer King had dismounted, Neia raised her head and asked the paladin:</p><br/><p>“Sorry, but we need to speak with Captain Custodio, so can you lead us to her? His Majesty says he will be going as well.”</p><br/><p>“Ah, ah, yes. Understood. Then, please follow me.”</p><br/><p>The paladin — followed by the Sorcerer King, and then Neia — entered the cave.</p><br/><p>The bluish-white illumination from the mushrooms that was creepy. In places where the mushrooms were particularly prolific, monstrous shadows danced on the walls in the spaces between the mushrooms. In addition, their bluish-white light made her look like a corpse, but mysteriously enough, she did not mind it now.</p><br/><p>As they walked through the cave, they occasionally saw commoners and priests, as well paladins standing watch.</p><br/><p>They should have heard all about him from the Captain and the others who had gone ahead of them but they still could not help gawking at the Sorcerer King.</p><br/><p>It’s kind of rude, though…</p><br/><p>The Sorcerer King would not get angry, right? He was a very kind ruler. However, the kinder people were, the more frightening they tended to be when they did get angry.</p><br/><p>Should she tell them they were being very rude, in order to avoid such an event? However, she could not go and tell each and every one of them in person, and it was not a problem that could be resolved by words alone anyway. After all, to the citizens of the Holy Kingdom — to all of the living — the undead were fundamentally the enemy.</p><br/><p>I’ll tell the Captain about this later… well, it’s good that they haven’t drawn their weapons.</p><br/><p>Suddenly, Neia sensed that the Sorcerer King had produced a piece of paper, and that he was looking at the letters written on it. Although Neia was interested in what was written there, she could not see the letters owing to the way it was concealed within his hand.</p><br/><p>Finally, they were brought to a room that was partitioned off by a hanging curtain, and the sounds of a noisy exchange of opinions came from inside.</p><br/><p>“Captain Custodio. The Sorcerer King and Squire Baraja have arrived.”</p><br/><p>The interior fell silent.</p><br/><p>The paper in the Sorcerer King’s hand had vanished to places unknown.</p><br/><p>“Let them in.”</p><br/><p>After hearing the Captain’s voice, the paladin pulled away the curtain.</p><br/><p>The paladins and the priests who rose to welcome the Sorcerer King — the ones who had not been part of the delegation — had a complex blend of emotions in their eyes. Even Neia could sense this. Naturally, the Sorcerer King must have felt it too. However, there was no way to tell how he had reacted to it just by looking at his back.</p><br/><p>There’s no way His Majesty can’t feel the mood in the air… perhaps he simply doesn’t care about the petty fumblings of tiny men. Is this the bearing of a king?</p><br/><p>“Everyone, listen up. Before us stands His Majesty, the Sorcerer King Ainz Ooal Gown. Unable to ignore the plight of our nation, he has specially come here on his own to aid us. You will accord him all due respect!”</p><br/><p>After Remedios said so, everyone in the room bowed to the Sorcerer King.</p><br/><p>Once everyone had raised their heads, the Sorcerer King spoke in a grand tone.</p><br/><p>“Greetings. I am the Sorcerer King, Ainz Ooal Gown. I have come to this land in order to help you, not on the behalf of my nation, but in a personal capacity. Therefore, while this might be a little sudden, I have noticed a few things on my way here, so I wish to seek your opinions on the matter. Please allow my follower to explain.”</p><br/><p>The Sorcerer King stepped aside, allowing Neia to walk past and in front of him.</p><br/><p>“Excuse me, everyone. Allow me to explain what His Majesty said earlier.”</p><br/><p>Neia relayed the Sorcerer King’s questions to everyone present. After the short speech, a heavy silence filled the room.</p><br/><p>“…Then what does His Majesty propose we do?”</p><br/><p>Remedios addressed her question to Neia, who stood by his side.</p><br/><p>“No, before that, what do you think? I have only come to do battle with Jaldabaoth, not to lead you all. If I end up participating too heavily in your strategic planning sessions, do you not think things will become very troublesome after defeating Jaldabaoth?”</p><br/><p>Murmurs spread through the room.</p><br/><p>“…Or do you mean to say you will subordinate yourself to my command? In that case, I will also use the most appropriate means to save this nation.”</p><br/><p>That ought to be the best way to do it, right? His Majesty might be undead, but everything he says makes perfect sense. He will surely abide by any agreements he makes too. Right now, at this very moment, if you want to save the suffering people, bending the knee to another country’s king for a time ought to be the right choice to make, no?</p><br/><p>“The only one who may stand above us is Her Majesty, the Holy Queen. Regretfully, we cannot accept commands from the king of another nation.”</p><br/><p>However, Remedios promptly rejected the offer.</p><br/><p>“—!”</p><br/><p>You should be willing to do anything to save the people! Wasn’t that the reason why we’re using the king of another nation, and such an incredible king at that!?</p><br/><p>Neia hung her head. That was to hide the dark, muddy emotions which stuck to the interior of her chest.</p><br/><p>“May we inquire as to what course of action Your Majesty would take in our position?”</p><br/><p>“If it were me, hm? Well, the logical thing would be to immediately move your base to a new location, no?”</p><br/><p>“A new location…”</p><br/><p>Everyone in the room, Remedios included, had a distressed look upon their face. That was because they did not know of any other place which was suitable as a hideout.</p><br/><p>“Judging by your response, I guess you do not know. In that case, you need to plan your future operations under the assumption that the quicker you move, the sooner Jaldabaoth’s army will attack you. …Then, since that is all, I will retire to my room.”</p><br/><p>Just as Neia was about to follow him, the Sorcerer King held out his hand to stop her.</p><br/><p>“Forgive me, but I would like you to stay here and listen to the others’ opinion on my behalf, Miss Baraja.”</p><br/><p>“Understood, Your Majesty.”</p><br/><p>While he had not acknowledged her as one of his people, it would seem the Sorcerer King was treating her as a substitute for himself. In that case, if she did not properly complete this task, he would be disappointed. Just imagining the Sorcerer King being disappointed made her heart flutter for some reason.</p><br/><p>“I can count on you, then? You don’t mind, do you, Captain Custodio?”</p><br/><p>“If Your Majesty permits it, we will not object.”</p><br/><p>After hearing that, the Sorcerer King turned to leave with the paladin assigned to be his guide.</p><br/><p>Once he vanished around a corner, a priest spoke up.</p><br/><p>“So that’s the Sorcerer King… Captain Custodio. Will it really be all right? I hope the cure is not worse than the disease. That would be very troublesome.”</p><br/><p>“Indeed. Taking future poison to escape present agony… is that not what paupers do?”</p><br/><p>“We’ve talked about this before, haven’t we? Don’t make me repeat myself. The poison’s already in us now.”</p><br/><p>Not His Majesty, huh. They aren’t going to address him with respect?</p><br/><p>Neia was irritated by the dramatic change in attitude they had shown the moment the Sorcerer King was gone.</p><br/><p>If one understood the attitude of the citizens of the Holy Kingdom towards the undead, then their attitude was only to be expected. Rather, it was Neia’s displeasure which was abnormal. Why did she feel unhappy about this?</p><br/><p>“Well, he’s still useful now, so it can’t be helped… and we’ve concretely seen how he can help us… but as priests, we might have trouble neutralizing that poison, no?”</p><br/><p>What do you mean, useful? Someone notices a mistake we made and even goes on to supply a solution, but not only are they ungrateful, they’re still thinking about how to use him— Ah, so that’s it. That’s what I sensed from His Majesty, something which the Holy Kingdom now lacks… a sense of integrity. That’s why I feel like this…</p><br/><p>How much of his grace had she received?</p><br/><p>After sharing a carriage with him, she had been given the chance to realize the fact that despite being one of the undead, the Sorcerer King was a king that was worthy of respect.</p><br/><p>Therefore, what she felt for these people would be more accurately termed “pity.”</p><br/><p>“Speaking of which, Squire Baraja. What’s that bow you’re carrying?”</p><br/><p>“Ah, yes. His Majesty said that he would lend me this weapon for the duration of my assignment.”</p><br/><p>“…May I take a look at it, Squire Baraja? I wish to see if the bow is enchanted with any sinister magic.”</p><br/><p>The priest extended his hand to her.</p><br/><p>Normally, she would have handed it to him. However—</p><br/><p>“Please permit me to refuse.”</p><br/><p>The priest was stunned. It was a face that said he had not expected to be denied.</p><br/><p>“This is a weapon I have received from His Majesty in order to protect his person. I will not allow it to leave my hands.”</p><br/><p>She would not allow someone who was only thinking of using an ally to touch it for even a single moment. Neia lowered her head as she replied to keep the anger in her heart from showing in her eyes.</p><br/><p>“—Captain Custodio, what’s the meaning of this?”</p><br/><p>“Ahhh, Squire Baraja, hand that bow—”</p><br/><p>“In other words, you don’t mind if I report this to His Majesty, then?”</p><br/><p>The air in the room froze over.</p><br/><p>“Enough. I understand. Let’s continue talking.”</p><br/><p>Hmm~ so at least they still know that things will go poorly for them if His Majesty finds out.</p><br/><p>“Before that, Captain Custodio, would it not be better to let Squire Baraja return to the Sorcerer King—dono’s side?”</p><br/><p>Neia noticed one of the priests glancing at the bow for just a moment.</p><br/><p>Neia understood the meaning he was trying to convey, but despite the anger boiling in her heart, she did not let it spill over to her words or actions.</p><br/><p>“I apologize, but I am here to listen to everyone’s words by order of His Majesty. I would be very grateful if you would let me continue to remain here and listen to your words from the side.”</p><br/><p>“True enough… Gustavo. What do you think we should do?”</p><br/><p>“His Majesty said so in front of all of us. If we have her leave now, it will probably cause more problems in the future.”</p><br/><p>“That’s true. So we’ll let her remain, then?”</p><br/><p>Is this something you should be saying in front of the person in question? As Neia thought this, she bowed in silent gratitude.</p><br/><p>“Now then, following on what the Sorcerer King has said, what should we do? Does anyone have any ideas about leaving this place and looking for a new refuge?”</p><br/><p>Perhaps someone with her father Pavel’s ranger skills might be able to find a place for this many people to stay for extended periods. However, there was nobody like that here.</p><br/><p>“The Sorcerer King — His Majesty said earlier that if we do not do anything, Jaldabaoth will not make a move either. In that case, why not search for a new place before they take action?”</p><br/><p>That suggestion, made by one of the paladins, met with scattered approval. However, Neia knew very well that putting the matter off would not solve anything. In the end, all it would do was cause a pileup of problems in the future.</p><br/><p>“The problem isn’t just finding a new place, but also the matter of provisions. While this is winter so food is easy to preserve, finding enough to tide us through the entire season is not easy. Even if we have not secured the Kingdom’s cooperation, shouldn’t we at least buy some food from them? Wouldn’t that help things?”</p><br/><p>“Unfortunately, prices are unbelievably high on the Kingdom’s side. Also, even if we did manage to buy the food, we’d need a massive amount to sustain this many people for several months, so transporting it would be very difficult.”</p><br/><p>“Vice-Captain-dono, I understand what you’re trying to say. However, there won’t even be anything to discuss without that food. In the end, we need some way to get rations from the south, no? Or perhaps shift our base closer to the coastline, so we can ship it in from the Kingdom.”</p><br/><p>“Unfortunately, we lack the funds for that, and we didn’t get a good response from the Kingdom’s traders. As for getting it from the south…”</p><br/><p>Gustavo smiled bitterly as he replied:</p><br/><p>“They probably haven’t realised that danger is drawing near for them. Our navy is being slowly worn down. It’s like they’re taking a step closer to the chopping block with each day that passes.”</p><br/><p>“So we need something to make the south want to help us, is that it?”</p><br/><p>“The base, the food, our problems are piling up.”</p><br/><p>“…As for resurrecting the Holy Queen-sama… can it be done? After all, once we can get that settled, everything else will be moot.”</p><br/><p>“Unfortunately, according to what we learned from Blue Rose, even that fifth tier spell will have a hard time working without a corpse, or if it’s badly-damaged.”</p><br/><p>“…Can we count on His Majesty’s power?”</p><br/><p>“You want to borrow the power of the undead?”</p><br/><p>“Things being what they are, what else can we do? If the Holy Queen-sama were to be resurrected, then only the main problem (Jaldabaoth) would remain.”</p><br/><p>Everyone’s eyes turned to the sour-faced Remedios.</p><br/><p>“—Let’s set that aside for the moment. We discussed this while travelling through the other countries, but our main objective will be to attack the camps and liberate the people.”</p><br/><p>Many people nodded in agreement.</p><br/><p>“I see. All of the Holy Kingdom’s people are combat-trained. In that case, just freeing a single village will grant us a certain amount of fighting strength… assuming they’re willing to help, of course. However, in that case, wouldn’t that make the food problem worse?”</p><br/><p>“That’s why I’m saying we should attack the camps. There ought to be food there.”</p><br/><p>“I see! That’s Captain Custodio for you!”</p><br/><p>Remedios smiled as she heard one of the paladins say so.</p><br/><p>However, Neia’s eyes were cold as she looked at the smug Remedios. After all, she knew who that suggestion had come from.</p><br/><p>“Also, with the help of the people, we’ll continue attacking and liberating the camps in various locations. That way, we’ll be able to find nobles with ties to the south. We’ll gather their troops before Jaldabaoth can destroy us and strike him a crushing blow. That ought to keep them from doing anything too.”</p><br/><p>“I see!”</p><br/><p>This time, there were more voices of agreement.</p><br/><p>“We’ll go with that. In that case, Squire Baraja, go relay this to the Sorcerer King—”</p><br/><p>“—Please wait, Captain. I feel it would be better if I told him myself. It would be the basic courtesy to show a nation’s king when informing a king about our operations.”</p><br/><p>Gustavo was correct, but for some reason, something seemed off.</p><br/><p>However, Neia could not object to this without knowing what that was.</p><br/><p>“Very well. Do so, then. I’ll leave it to you.”</p><br/><p>“Understood!”</p><br/><p>♦ ♦ ♦</p><br/><p>Neia and Gustavo returned to the Sorcerer King’s room together. Its door was little more than a piece of cloth, but a paladin still stood in front of it. Was he there to look out for people who might harm the guest within, or watch over the guest himself?</p><br/><p>After being ordered to stand down by Gustavo, the paladin left.</p><br/><p>Neia mentally furrowed her brow.</p><br/><p>Since he had sent away the guard, coming here definitely meant he had something else in mind besides telling him about the plan. It was hard to imagine that they would want to assassinate him. However, should that really come to pass, then she would need to wield her weapon as the Sorcerer King’s shield.</p><br/><p>“Your Majesty, this one is Gustavo Montanjes; I and Squire Neia Baraja seek your permission to enter.”</p><br/><p>After it was granted, Gustavo took a step into the room.</p><br/><p>When one recalled the inns they had seen in the Kingdom and the Sorcerous Kingdom, this place seemed terribly austere. This was no place for a nation’s king to rest.</p><br/><p>There was nothing to be done about the fact that the cave walls were bare rock, but even the furniture was in in a sad state.</p><br/><p>While paladins learned to sew during their squire days, it was not enough for them to make furniture.</p><br/><p>However, the bed where the Sorcerer King sat was extremely beautiful. It gleamed with black radiance, like it was made of onyx. In addition, there were pure white sheets upon it.</p><br/><p>Anyone else would have been scared senseless by the sight of this beautiful bed which had been produced from places unknown. However, to Neia, she had long since come to think that such matters were nothing to to be hung up about when it came to the Sorcerer King. Besides, it was possible that he had simply teleported home and came back with a bed.</p><br/><p>Still, it was a different matter for Gustavo, who did not know the Sorcerer King like Neia did.</p><br/><p>“Your, Your Majesty. What, what is that?”</p><br/><p>“Oh, this?” The Sorcerer King indicated his bed. “I made it with magic. As for this blanket, well, I also made it with magic. That said, I have no idea where this one hundred percent wool came from, but it feels good to lie down on. I’m sure you could have a comfortable rest on it.”</p><br/><p>Even after receiving that answer, all Gustavo could do was stiffly reply, Ah, ahh. However, Neia did not have an intention to criticize him for it. After all, she too was looking into the distance and thinking, Magic really can do anything~</p><br/><p>“Now then, I understand why Miss Baraja has returned. But why have you come as well, Vice-Captain-dono?”</p><br/><p>“Ah, ah, yes! While I have no intention of slighting Squire Baraja, I felt that it would be more appropriate, as the Vice-Captain, to conduct the upcoming briefing myself; hence my presence here.”</p><br/><p>“Hm… if that is what you all think, then I as an outsider have no room to disapprove. However, I would like to say something.”</p><br/><p>Just then, something black seemed to blend with the crimson points of light which served as the Sorcerer King’s eyes.</p><br/><p>“I gave her those orders because I felt she could carry them out. Interfering in the matter by weight of your position as a superior is comparable to slighting my judgement. I trust you understand how that would displease me, no?”</p><br/><p>Until now, no matter how he had looked at her, no matter how he had treated her, the Sorcerer King had never once shown Neia his unhappiness. However, for the first time, he was showing his anger before Neia. This anger was born from his trust in Neia, and it caused a current of heat to course through her chest. He was the only one who held that opinion of her.</p><br/><p>“I sincerely apologize!”</p><br/><p>“That apology should be directed at her. Still, well, nevermind. Go ahead and brief me.”</p><br/><p>Gustavo briefly summarized the details of what had been said, but his only answer was a vague Hmm.</p><br/><p>“I see. Then — what do you expect me to do? Or are you saying you have truly come just to inform me of this?”</p><br/><p>“Of course not; I wished to ask if Your Majesty had any opinions about this operation.”</p><br/><p>So that was it.</p><br/><p>He wanted to borrow the intellect of the Sorcerer King. That was what had worried Neia about his insistence on coming along. Ordering that paladin away was also for that reason. If he overheard what Gustavo said, if he learned that the Vice-Captain had bowed his head to the king of another country, who was also one of the undead, things would go very badly indeed.</p><br/><p>At this point, what’s the use of covering things up…</p><br/><p>It was plain to see that they were helpless without the might of the Sorcerer King. That being the case, news of this would certainly circulate throughout the people. It was only a matter of whether it took place sooner or later.</p><br/><p>What the people of the Holy Kingdom should have done was to spread the word of the Sorcerer King’s mercy and compassion throughout the land, and then treated him with gratitude.</p><br/><p>While I understand they’re wary of him because he’s one of the undead, I don’t think the Sorcerer King’s that kind of man…</p><br/><p>Still, even if Neia told everyone, it was likely that no-one would believe her. They might even think she was the subject of a 「Charm」 spell or similar magic.</p><br/><p>What can I do to make everyone trust the Sorcerer King? In the end, it seems I’ll need to do something to change the first impression of him. However, I can’t possibly say something rude like, “Please let more people accompany you…”</p><br/><p>While Neia pondered the matter, the Sorcerer King was still speaking to Gustavo.</p><br/><p>“…No, I’ve already said this. I will not comment on your battle plans.”</p><br/><p>“I pray you will furnish us with a solution on this point, because we have nowhere left to go. We would like to avoid the possibility of failure, however slight.”</p><br/><p>“And that is the reason why I will not. If you heed my suggestions and the operation ends in a failure, what shall be done? I do not intend to shoulder that responsibility, you know?”</p><br/><p>“Yes. Therefore, I feel that what we discuss here should remain with my heart, that of Your Majesty’s, and Squire Baraja’s.”</p><br/><p>“Miss Baraja too? Would it not be better not to let her hear this?”</p><br/><p>“No, for various reasons, it would be better if there was a third party other than ourselves present. Also, with someone of her skills around, we might be able to come up with more ideas.”</p><br/><p>“…Hm, then we may briefly discuss the matter. Miss Baraja, I trust you are fine with this?”</p><br/><p>“Ah! Yes, I don’t mind.”</p><br/><p>“In that case… there were several points in the operation you suggested just now which bothered me. The first is the question of rations. I agree that there might be food stocks in the prison camps, but I do not feel there will be much there. When you think about it, do you think they would feed their captives properly? If it were up to me, I would decrease their daily food intake and weaken them so they would have no chance to revolt. Also, there is the matter of pressing them into service as soldiers after rescuing them. What about their weapons? Have you transported them to this cave?”</p><br/><p>“No, we have not. I would like to think we could obtain those from the camps.”</p><br/><p>“Your plan of wagering everything on these camps is very dangerous. You do understand this, right?”</p><br/><p>“Yes. However, saving the people suffering in there is very important.”</p><br/><p>“On that point I concur. The more time passes, the less they will love this country. However, it would be best to do something about the food situation. In truth, I feel that seeking the aid of the south is the best choice in many ways. What can be done to accomplish that more easily?”</p><br/><p>“The royal family will help. While the Holy Queen-sama has already passed away, I do not think all the royals have been wiped out. We could aid the members of the royal family supported by the southern nobles, and then have them ask the southern nobles to cooperate with us. If we did that, we would also have a safe refuge… speaking of which, Your Majesty. The Holy Queen is dead, but perhaps Your Majesty could do something about it?”</p><br/><p>“What do you want me to do about it?”</p><br/><p>“Resurrection.”</p><br/><p>“I see. That is not impossible.”</p><br/><p>He said so in such a casual tone that Neia doubted her ears for a moment. Resurrection magic could be considered the ultimate secret of divine magic. Very few humans could use it. How many people in this world could speak those words so easily?</p><br/><p>“Naturally, I will expect some form of compensation for this. Then where is the body? In what state is it?”</p><br/><p>“The body’s location is currently unknown, as is its status. On the subject of compensation, we will gladly pay as much money as Your Majesty desires.”</p><br/><p>The Sorcerer King waved his hand before his face.</p><br/><p>“The lack of a body will make things very difficult. Even with one, damage to the body might complicate matters. Without an intact corpse, there is a chance that if I used resurrection magic, it might become one of the undead.”</p><br/><p>“That, that would be very problematic for us.”</p><br/><p>The Holy Queen becoming an undead being would not just be problematic, it might plunge the entire Holy Kingdom into war.</p><br/><p>“Are there no magic casters in the Holy Kingdom which can use resurrection magic of the fifth tier?”</p><br/><p>“I apologize, but I have not heard of any.”</p><br/><p>“Hoh… and what about the remaining members of the royal family?”</p><br/><p>“They are probably in one of the internment camps. After so long, I doubt any of them are still hidden within the cities.”</p><br/><p>“Ho, prisoners, then? …Do you have any information on where they might be?”</p><br/><p>“None at all,” Gustavo replied with a shake of his head. The Sorcerer King looked at the ceiling.</p><br/><p>“Umu. You really are making this up as you go along, aren’t you?”</p><br/><p>“Indeed, it is so. Nobody among the paladins is skilled at collecting information…”</p><br/><p>“Is that so…” The Sorcerer King hmmed to himself. “As I thought, a solid organization to allow every subordinate to deal with all kinds of situations is essential. In addition, one needs multiple intelligence-gathering apparatuses.”</p><br/><p>“There-therefore, we were hoping to draw on Your Majesty’s might. May I know if you could help us with your magic?”</p><br/><p>“Well, magic is not that omnipotent… for starters, we need detailed information on the prison camps. I trust you have a detailed map for me to peruse?”</p><br/><p>“My sincerest apologies—”</p><br/><p>“I do not think there is one here; shall I fetch one?” Neia interrupted halfway.</p><br/><p>Maps were the treasure of a kingdom. The more accurate they were, the more useful they were in battle. Allowing a possible enemy nation to know so much about one’s geography did far more harm than good. Therefore, Gustavo must have been planning to refuse him.</p><br/><p>However.</p><br/><p>Neia could not concede on this point.</p><br/><p>She could not tolerate their one-sided usage of the Sorcerer King.</p><br/><p>If they wanted to draw on his wisdom, they would have to pay that price.</p><br/><p>Although Gustavo stared daggers at her, Neia pretended that she had not noticed.</p><br/><p>“Ah, in that case, let me take a look at it afterwards. Also, I apologize, but do tell me everything you know about the terrain, Miss Baraja.”</p><br/><p>“Understood!”</p><br/><p>After the two of them spoke to each other, Gustavo pulled aside the curtain and left. Once the sounds of his footsteps faded away, the Sorcerer King muttered:</p><br/><p>“You don’t have to worry about it. I came here for my own gain, That’s how valuable Jaldabaoth’s demon maids are.”</p><br/><p>“Yes.”</p><br/><p>He must have been talking about the maps.</p><br/><p>Neia’s chest burned. Truly, it was a joyful thing to have everything you did validated by others.</p><br/><p>“Still, this really is pushing it. I’m surprised an organization that splinters so easily has held out for so long.”</p><br/><p>“—My deepest apologies.”</p><br/><p>“No, there’s no need to apologize to me… however, it’s quite troublesome when an organization isn’t united. Do you not use majority vote when a difference of opinion occurs? And of course, a rule to not hold grudges whatever the outcome.”</p><br/><p>“How wonderful it would be if we could unite the group in that way. It sounds like a dream organization.”</p><br/><p>“Mm… wonderful, you say?”</p><br/><p>The Sorcerer King suddenly looked at the ceiling, but his eyes seemed to be gazing at something further away.</p><br/><p>“Yes, that truly was the organization of my dreams.”</p><br/><p>“Could it be that Your Majesty’s nation is organized along those lines?”</p><br/><p>“Ah, ahhh. No, not like that. Unfortunately, my country is not such a group. Still… kuku.”</p><br/><p>The Sorcerer King went quiet, and then he laughed warmly,</p><br/><p>“It would be interesting if it was.”</p><br/><p>“Interesting, you say?”</p><br/><p>“—Now then, can you tell me about the surrounding area?”</p><br/><p>Part 2</p><br/><p>A group of people forged through the night towards a prison camp.</p><br/><p>They had decided to adopt the Sorcerer King’s suggestion of attacking the prison camp by the shore which was as far from their base as possible. It would be easier to hide their tracks by the sea, and given the distance, they would be able to buy some time before the enemy verified the location of the Liberation Army after the attack.</p><br/><p>However, there was a problem.</p><br/><p>If it was too far, the chances of being spotted by enemy scouts was very high.</p><br/><p>Therefore, they decided to attack the furthest prison camp within their travel range.</p><br/><p>Neia asked a question of the Sorcerer King, who was riding a horse beside her.</p><br/><p>“Your Majesty, we will be making our approach on horseback until we reach the village. Are your preparations complete?</p><br/><p>“Ah, but of course. However… I did not hear much about the operation details. What sort of tactics will they use? I do look forward to it.”</p><br/><p>“You look forward to it?”</p><br/><p>“Kuku, I’ll be able to see some of the Holy Kingdom’s tactics at work. What abilities will they use to break down the camp gates? Or will they fly over the walls and infiltrate through the air? I doubt they will be so unwilling to let me see that… The thought that they might have an ability I have not encountered excites me.”</p><br/><p>The Sorcerer King will surely be disappointed, Neia thought uneasily.</p><br/><p>The Holy Kingdom’s basic siege tactic was to launch a two-pronged attack with angels from the air and infantry from the ground. They would probably do the same thing this time round. Or rather, they did not have the manpower to do anything else.</p><br/><p>Neia looked at Remedios.</p><br/><p>Practically all of the Liberation Army’s fighting power was now advancing.</p><br/><p>The Captain raised her lance, from which the Holy Kingdom’s flag fluttered in the wind.</p><br/><p>“Let’s go!”</p><br/><p>“Ohhh!”</p><br/><p>The Captain spurred her horse, which began to move, and the paladins followed behind her. They were still some distance from the village, so they could not go at a full gallop, but a trot.</p><br/><p>“The paladins are carrying freshly-cut logs; are they battering rams?”</p><br/><p>“Yes. Our Liberation Army only has paladins and priests. Nobody is skilled at opening doors or other infiltration skills. Therefore, all we can do is mount a frontal assault. Our Captain is a skilled swordswoman, but for breaking down gates, tools like that would be faster.”</p><br/><p>“So they’re not using magic, but seek to physically break it down with a battering ram? Aren’t they going to use ladders or the like? Can the magic of paladins carry them over walls?”</p><br/><p>There were several broad types of spells, like arcane, divine, and spiritual. The magic that the paladins used fell into the “other” category, and they typically cast spells in the form of blessings. Dark knights, who were fallen paladins, also used blessing spells.</p><br/><p>From what Neia had seen and heard, there were no spells which let them make ladders.</p><br/><p>“I apologize, but I have never heard of such magic before.”</p><br/><p>“Neither have I. That said, I have heard that there are some paladin spells which allow them to fly, although those are of quite a high tier.”</p><br/><p>“Is that so? You even know about paladin spells…”</p><br/><p>Truly, he was the Sorcerer King. He possessed great knowledge even about spells he could not cast.</p><br/><p>“That’s because the enemy might use them. It took a lot of effort to memorize every spell there was. Since I was not talented, I had to make up for it with hard work. The more you know, the closer you are to victory, although that was what a friend told me, hm.”</p><br/><p>She could not believe what he said about having no talent. However, there was something more important that she had to say.</p><br/><p>“Your Majesty, if you have any strategies to recommend, I will relay them to our Captain.”</p><br/><p>It was quite likely that someone as capable as the Sorcerer King had already come up with a more effective plan than what the Liberation Army had. That was why he was acting this way.</p><br/><p>“Eh? No, no, I shouldn’t. Ah, well— about that. Liberating this prison camp is not my job, but yours. Attacking these prison camps is the first step in finding a better way to do things. They need to realize that themselves, which is why it must be done this way.”</p><br/><p>The Sorcerer King was right. Or rather, everything he said was right.</p><br/><p>However, just for today, Neia wanted to borrow the Sorcerer King’s strength. That was because their war was fought to save the suffering masses, and she wanted to choose a path which was faster and which could save more people.</p><br/><p>“I fully agree that what Your Majesty said is correct. However, I pray you will still lend us a hand.”</p><br/><p>She immediately knew she was being very rude. However, Neia still bowed her head and pleaded with the Sorcerer King anyway,</p><br/><p>The Sorcerer King looked forward for a while before speaking again.</p><br/><p>“Umu… Neia Baraja. Don’t make me repeat myself so many times. Failure is the mother of success. The consequences of not relying on me and instead thinking for yourself, even if they should end up being failure, should not be feared, but embraced. This is because they are the failures necessary for success.”</p><br/><p>The Sorcerer King’s words stabbed at Neia’s heart. She could not keep asking the Sorcerer King to help. The Sorcerer King was saying that the consequences of planning on their own were a necessary sacrifice for the recovery of their nation.</p><br/><p>Indeed, it was as His Majesty said.</p><br/><p>But with the power of the Sorcerer King, they might be able to save more lives.</p><br/><p>Would sacrificing them for the sake of self-reliance be justice?</p><br/><p>What was justice, anyway?</p><br/><p>Was saving more lives justice? Or—</p><br/><p>Her thoughts went around in circles, and she could not find an answer.</p><br/><p>“Now then, let us look forward to their skills.”</p><br/><p>Right now, Neia was simply praying that the many sacrifices they would make would not be wasted.</p><br/><p>The group advanced towards the prison camp in a straight line.</p><br/><p>The terrain around the village was uneven, but there were watchtowers. If they made a direct approach, they would definitely be spotted. However, it was also a fact that this was the only way they could attack.</p><br/><p>Soon, they spotted the village.</p><br/><p>There seemed to be sentries on the watchtower above the gate. They banged on the alarm bells, and a commotion arose from within the village.</p><br/><p>Neia narrowed her eyes, and stared at the watchtower.</p><br/><p>The demihumans there looked like bipedal goats, wearing chain shirts and carrying large spears.</p><br/><p>If Neia recalled them correctly, those demihumans were known as Bafolk.</p><br/><p>They were a demihuman species who lived in mountainous regions, and their legs were every bit as capable as a mountain goat, making them fearsome warriors who could scale even city walls if they had so much as the slightest bump or depression on their surface. In addition, their fur tangled on slashing swords and steadily blunted their edges, so after killing one, it was important to clear the fur off the blade, or so her father had taught her.</p><br/><p>The Bafolk’s spears were long enough that they could stab people passing underneath from above.</p><br/><p>She mused that things would be troublesome if they immediately strengthened their defense. However, they did not seem that well drilled, given how they were running around wildly and giving their side a lot of time to prepare.</p><br/><p>The priests dismounted, and immediately summoned angels.</p><br/><p>The paladins also dismounted, and raised their shields. This was probably to protect the people carrying the battering rams from attacks.</p><br/><p>However, not all the paladins were like that. About ten or so people remained mounted and began circling around the village.</p><br/><p>“Miss Baraja, I trust dispersing some troops around the area is meant to intercept any demihumans from the camp who are trying to flee with intelligence about this battle? If anyone gets away, then even if you win the battle, you will lose in the long run.”</p><br/><p>“That, that’s it! It’s just as you say!”</p><br/><p>He had seen through the paladins’ tactics with such ease. The only thing Neia could say about him was that he was amazing.</p><br/><p>Still, that raised a question. Where had the Sorcerer King learned such tactics from?</p><br/><p>A being with a demihuman’s tough skin would not wear armor on top of it. With sharp claws, one would not need swords. Humans wore armor and carried swords because of their fragile bodies.</p><br/><p>If there was no need to rely on one’s wits, then tactics would naturally be unnecessary too. Why did the overwhelmingly powerful Sorcerer King know of siege tactics?</p><br/><p>“Your Majesty, may I know where you acquired such knowledge?”</p><br/><p>“Hm? By knowledge you mean— ah! My predictions just now? Umu.Those tactics were taught to me by one of the friends I mentioned before. After that, I tested them out in live combat. Well, I learned a lot of things, but I didn’t expect them to be put to practical use here.”</p><br/><p>“…Since he was Your Majesty’s friend, surely he must have been very strong too?”</p><br/><p>“Oh yes. Well, his strength was not in melee or magic, but in another field. In that sense, I have not yet attained his level of strength yet.”</p><br/><p>Huhu, the Sorcerer King laughed happily. It was the kind of laugh one had when reminiscing about the past.</p><br/><p>Right now, he seemed just like a human being.</p><br/><p>Could it be that the Sorcerer King was once human…?</p><br/><p>Perhaps he had transformed himself into one of the undead with the power of magic, but that would be a perplexing matter. That should not have been possible. To Neia’s knowledge, the undead were naturally occurring things. However—</p><br/><p>The world is large, after all.</p><br/><p>Neia’s journey with the ambassadorial delegation had let her realise how tiny the world she once knew had been.</p><br/><p>Across the ocean, beyond the mountain, and in the depths of the forests — there ought to be something out there. The sages who could scoff at Neia’s problems and tell her the answers ought to be out there too.</p><br/><p>“What are you thinking about?”</p><br/><p>“Ah, my, my apologies.”</p><br/><p>“No, I am not blaming you. I was a little worried when I saw you spacing out on horseback… the battle is about to begin, and I understand if you’re uneasy.”</p><br/><p>“Th-Thank you very much, Your Majesty.”</p><br/><p>Just then, Remedios planted her banner in the ground and drew her holy sword.</p><br/><p>“Everyone! The first battle to save this land from Jaldabaoth is about to begin! Justice shall triumph!”</p><br/><p>There was a heated response of “Justice shall triumph!” to Remedios’s shout. Once they gathered, they began their charge.</p><br/><p>“So it’s begun. Miss Baraja, would it not be better to move up if you wish to fight?”</p><br/><p>“No, my duty is to accompany you, Your Majesty. Abandoning Your Majesty to fight—”</p><br/><p>Is something I cannot do, Neia shook her head.</p><br/><p>“Hm, mm, is that so? Then, then let’s talk about something else… You haven’t lent that weapon to anyone else, have you?”</p><br/><p>“Not even once! This is a weapon I borrowed from Your Majesty! I would not dare allow anyone other than myself to touch it!”</p><br/><p>“Ah… really now. Umu, I suppose. I thank you.”</p><br/><p>His tone sounded a little depressed, but there was no way to divine his intentions from it.</p><br/><p>Have I done something to offend His Majesty? …I’m not too sure what’s going on, but perhaps I should apologize?</p><br/><p>While Neia was waffling, the Sorcerer King changed the topic.</p><br/><p>“Ah — this is a rare opportunity. I looked around our surroundings, but I did not discover any demihumans hiding with invisibility magic. Perhaps we should move forward a little to observe the battlefield conditions. I doubt there’ll be any problems with leaving the priests here… What do you think?”</p><br/><p>“Understood.”</p><br/><p>It would be very disrespectful to tell the Sorcerer King — who possessed might which far exceeded her own — that moving to the front would be dangerous.</p><br/><p>As the sound of bells rang through the prison camp, she stayed close to the Sorcerer King as he moved up. That was when the fighting began.</p><br/><p>The angels attacked the watchtowers on top of the gate, and the Bafolk there met them with their spears.</p><br/><p>The archer towers launched arrows. They were not aiming at the angels, but at Remedios as she led the charge. It was only natural to aim for her, given that she was not carrying a shield and there was no chance of hitting friendlies.</p><br/><p>However, her strength was far removed from the others.</p><br/><p>She easily cut down all the arrows coming at her with her sword, maintaining her speed as she ran.</p><br/><p>As if to counterattack, several angels rushed the archer tower. Shortly after that, three Bafolk corpses fell from the tower.</p><br/><p>This was when the paladins reached the gate and began pounding on it with the battering ram.</p><br/><p>The log doors began to shake, and there was a faint sound of cracking from inside, along with the cries of the paladins going, “One more time!”</p><br/><p>The gate shook again, more violently than before.</p><br/><p>And then the battering ram struck again.</p><br/><p>One of the logs making up the gate bent heavily, and they could hear the paladins’ cries of triumph even from here. While the gap was not yet big enough to let people in, they ought to be able to break the gate down completely after several more tries.</p><br/><p>Several angels flew past the gate. Neia could not see what they were doing from here, but they were probably trying to hold off the Bafolk defenders.</p><br/><p>“—Get back, all of you!”</p><br/><p>All eyes went to the source of that shout.</p><br/><p>It came from a watchtower above the gate. The angels should have taken that place. Yet, a single Bafolk appeared there. However, the problem lay in what the Bafolk was carrying.</p><br/><p>“Get back!” the Bafolk shouted again.</p><br/><p>The Bafolk was holding a girl, aged around six or seven, and he had a sharp blade to her throat.</p><br/><p>“If you don’t back off, I’ll kill this human!”</p><br/><p>The girl was dressed in filthy clothing — her face looked dirty too — and her body shook from side to side. Was she still alive? They could not detect any signs of life from her. It seemed to speak for how everyone inside the camp had been treated.</p><br/><p>“You’re despicable!” one of the paladins shouted.</p><br/><p>“Hurry up and back off! Look!”</p><br/><p>There was a commotion among the paladins. What had happened? Even Neia could not see what was happening at this range and at night. However, it was different for the Sorcerer King.</p><br/><p>“…The child’s throat seems to be bleeding.”</p><br/><p>“Could it be!?”</p><br/><p>“It was just a nick; she is not dead yet. Otherwise her value as a hostage would—”</p><br/><p>“—Everyone, fall back!”</p><br/><p>The paladins obeyed Remedios’s command and moved back.</p><br/><p>Although the priests in the rear had a hard time grasping the situation, they still understood what was going on, and they pulled the angels back. At the same time, the priests ran up to Neia and the Sorcerer King. They had probably come closer to see what was going on.</p><br/><p>“Further! Go further back!”</p><br/><p>After the Bafolk said so, the paladins began retreating slowly.</p><br/><p>They could see the Bafolk hurriedly swapping positions atop the watchtower. They swapped the people who had been wounded in the earlier battle with the angels for fresh fighters.</p><br/><p>“This is bad.”</p><br/><p>“Yes, very bad.”</p><br/><p>Neia slowly raised the bow she had been lent. The Bafolk seemed to be using the girl as a shield. Therefore she had a very small space in which to aim for. Killing it in one hit would be very difficult.</p><br/><p>Even so, if she did not do it, who would?</p><br/><p>I wish I’d practiced my bow skills more, Neia thought as she drew an arrow from her quiver.</p><br/><p>Just then, the Sorcerer King swiftly held out a hand, as if to block her shot.</p><br/><p>“I don’t intend to insult you, but you should stop. There’s no longer any point to it.”</p><br/><p>Just as she was about to ask what he meant, the Sorcerer King walked over to where the paladins were gathered.</p><br/><p>There was an argument raging there about how to save the girl.</p><br/><p>Priestly magic could freeze the enemy in their tracks. Many people approved of that, but spells had an effective range. Could they get into that range? Would the hostage be killed? All these questions and more flew back and forth, but there was no sign that an answer had been reached.</p><br/><p>Just then, the Sorcerer King and Neia arrived.</p><br/><p>“How long are you going to twiddle your thumbs about this? The situation looks bad.”</p><br/><p>After he spoke, the others turned to look at the Sorcerer King as one.</p><br/><p>“Of course we know that—”</p><br/><p>“—Captain… please calm down. The enemy is over there.”</p><br/><p>Remedios was at the end of her tether, and Gustavo spoke to her.</p><br/><p>“No, Captain Custodio. You know nothing. Since the enemy knows that hostages are effective, they’ll show that this is not a threat, and they’ll use her as an ex—”</p><br/><p>As though waiting for those words, the girl hostage’s head was hacked off. They could see her bright red blood spurting even from here. The Bafolk let go of the girl’s body, and it crumpled weakly to the ground.</p><br/><p>Everyone was silent.</p><br/><p>Their minds refused to accept what had just happened.</p><br/><p>Remedios was the first to recover, and as she shouted, Neia came to her senses as well</p><br/><p>“You bastard! How dare you kill the hostage!? Even after we obeyed your demands!”</p><br/><p>“Hmph!” The Bafolk dragged a boy in front of him this time. “That’s why I’ve got another one, see? Now back off!”</p><br/><p>“You shameless scumbag!”</p><br/><p>“Hmph. You really are an idiot, aren’t you? Perhaps you’ll understand after I bring another over?”</p><br/><p>Remedios’s clenched fist trembled mightily. Then, as though to vent her feelings, she ordered:</p><br/><p>“Everyone, fall back!”</p><br/><p>“Also, gather up the people on horses around the sides! Move it!”</p><br/><p>She could hear the sound of grinding teeth from Remedios. It was loud enough that one might think she was crushing her teeth.</p><br/><p>“Vice-Captain. Order them to gather here.”</p><br/><p>“B-But—”</p><br/><p>“If you don’t do it, the child will die. Move!”</p><br/><p>“Everyone fall back!”</p><br/><p>“A very bad move. You’ve shown the enemy that hostages are effective and given them so much time to prepare. If the enemy does something to break your will to fight again, won’t that cause even more damage?”</p><br/><p>A red-faced Remedios glared at the Sorcerer King like she was looking at the enemy.</p><br/><p>“If this goes on, your surprise attack will be pointless. Also, I can hear the sounds of something moving over there. If they set up barricades, breaking them down will take more time, and things will be more troublesome—”</p><br/><p>“—Shut up!” Remedios interrupted the Sorcerer King.</p><br/><p>“Who’s got an idea? A way to solve this without anyone dying!?”</p><br/><p>Nobody said anything.</p><br/><p>Of course nobody had such a convenient solution. For instance, if they had someone adept at infiltration skills, this situation might not have arisen. However, there was nobody like that around.</p><br/><p>Even Remedios should have understood this. If her animal-like instincts analyzed the battle situation and told her there was no way, then such a method did not exist.</p><br/><p>Even so, why did she refuse to admit it?</p><br/><p>Why was she hung up on not letting a single person die?</p><br/><p>The Sorcerer King’s words flashed through her mind — was this not one of those necessary sacrifices which he mentioned? There was no way to come out of this without losing a single person unless one had an overwhelming advantage in strength or a great deal of luck.</p><br/><p>“Captain Custodio,”</p><br/><p>Neia’s voice sounded abnormally loud.</p><br/><p>“Right now, can we not finish the fight with only a few casualties?”</p><br/><p>Remedios’s furious gaze shifted to Neia.</p><br/><p>The powerful emotions boiling off that mighty warrior’s body made her own body tremble, but Neia was sure that she was right.</p><br/><p>“There’s no justice in that!” Remedios shouted.</p><br/><p>Justice? That justice—</p><br/><p>The surrounding paladins remained silent. It would seem nobody was prepared to say anything. Neia felt like she was surrounded by enemies and she unconsciously backed off, and then she felt someone’s hand supporting her from behind.</p><br/><p>Looking back, she saw the Sorcerer King, as she had expected.</p><br/><p>“—I support Miss Baraja’s opinion.”</p><br/><p>He had affirmed her in a quiet voice. But to Neia, it was like a hundred-million strong ovation.</p><br/><p>“Shut up!”</p><br/><p>Remedios barked again. However, this was not something she should be saying to a king from another country who had come all this way to save her. There were actions which were acceptable, and actions which were unacceptable.</p><br/><p>Anger welled up in Neia’s heart.</p><br/><p>“What you need right now is to change the situation, not sit around and butt heads in frustration… Ah, it can’t be helped. I shall turn things around, then.”</p><br/><p>After muttering to himself, the Sorcerer King turned away from them — towards the gate — and began walking. Due to his sudden movement, nobody managed to call out to him before the Bafolk shouted a warning.</p><br/><p>“You there, in the mask! I told you to back off, didn’t I?”</p><br/><p>“I will not back down! What do you think a single human life means to me!?”</p><br/><p>“W-What!?”</p><br/><p>“Our aim is to kill every single one of the Bafolk here! It doesn’t matter what happens to the humans! 「Widen Magic — Fireball」!”</p><br/><p>The Sorcerer King extended his hand with a shout, and the fireball that flew forth blew away the Bafolk and the boy he was holding.</p><br/><p>The enormous burst of flame also consumed the watchtower.</p><br/><p>Everyone on top had been slain by that attack. The Bafolk and his hostage fell onto the Sorcerer King’s side of the wall.</p><br/><p>“「Maximize Magic — Shockwave」”</p><br/><p>The spell which followed blasted away the half-ruined gates. In addition, it scattered the Bafolk who were erecting barricades behind it, blowing a huge hole into their defenses.</p><br/><p>“Come, you paladins! Attack! Kill the Bafolk inside to the very last man!”</p><br/><p>As though awakened by his voice, Remedios came to and replied:</p><br/><p>“You son of a bitch—!”</p><br/><p>“—Captain!”</p><br/><p>“Grrrrgh! —Charge!”</p><br/><p>The paladins moved forward in response to Remedios’s words. Or rather, it might be more accurate to say that they had abandoned all attempts at thinking and fully subordinated themselves to her orders.</p><br/><p>“Thank you, Your Majesty!”</p><br/><p>Gustavo left those words behind and moved on. After that, there the paladins and priests — the more sensible ones, at least — directed grateful looks at him. Remedios was the only one who was staring at the Sorcerer King with open displeasure.</p><br/><p>The Sorcerer King addressed Neia in a quiet voice.</p><br/><p>“—Miss Baraja. Did you think I would save the boy with a spell beyond your imagination?”</p><br/><p>Indeed, the thought had crossed her mind. However, the Sorcerer King must have had some reason for his actions.</p><br/><p>“Ah, yes, I did. It is as you say.”</p><br/><p>“Hm, perhaps that might be so.”</p><br/><p>The Sorcerer King nodded, and Neia listened in silence.</p><br/><p>“Indeed, I could have done so. By using the various spells I have learned, saving a single boy would be a trivial task. However, I could not do that. That was because I could not allow the Bafolk to see me rescue a boy.”</p><br/><p>Doubt crossed Neia’s face for the first time, and the Sorcerer King gently explained to her.</p><br/><p>“If I allowed them to know that hostages were effective against us, the prisoners inside would be used as meat-shields to block our attacks in battle.The paladins would be at a loss, and they might end up being wounded or killed. Due to our dire lack of manpower, even one fewer paladin would constitute a great disadvantage… at least, according to Lanchester’s laws.</p><br/><p>(TL Note: Lanchester’s laws are mathematical formulae designed to calculate the relative strength over time of a predator and prey pair. They’re usually used for military modelling. In this case, even one loss can lead to more losses over time.)</p><br/><p>The Sorcerer King walked to the gate, and Neia hurried after him.</p><br/><p>“On the other hand, once they know the hostages are useless, they will simply become hindrances to the Bafolk. Now, when they are being attacked and the enemy is about to come through the walls, do you think they have the time to leisurely kill off their prisoners? Murdering people who can’t resist ought to be a very low priority then.”</p><br/><p>“It is as you say.”</p><br/><p>“Indeed. Rather than waste time killing people, they would prepare to stop the enemy incursion instead. Therefore, it was necessary to use a method that would clearly illustrate the pointlessness of taking hostages.”</p><br/><p>He was right,</p><br/><p>If Remedios had her way, they might end up being unable to save anyone in the end.</p><br/><p>The Sorcerer King slowly lifted up the body of the boy by his feet.</p><br/><p>“Your Majesty, let me—”</p><br/><p>“—This is a job for me.”</p><br/><p>Neia accompanied the Sorcerer King as he carried the boy to the place where Remedios had planted her banner.</p><br/><p>The Sorcerer King laid the boy on the ground. Neia wetted a cloth with water from a waterskin, and wiped away the grime on the boy’s face.</p><br/><p>His cheeks, his wrists and his thighs were all shockingly thin.</p><br/><p>It clearly illustrated the harsh conditions under which they lived.</p><br/><p>“Those Bafolk bastards…”</p><br/><p>“Perhaps this should not be said, but do allow me to say it anyway. I am the king of the Sorcerous Kingdom, and not the king of the people who reside in this country. Thus, I can calmly make this decision. I would choose to save a thousand people’s lives over a single life. But if this boy alone were a citizen of my nation, I would prioritize saving him instead. If you cannot accept that—”</p><br/><p>“—No, thank you very much. I can understand how you feel… Your Majesty is just.”</p><br/><p>“…Hm? What do you mean?”</p><br/><p>“My apologies. Ah, maybe it should be, Your Majesty is righteous?”</p><br/><p>What on earth am I saying? she could not help but wonder.</p><br/><p>While she felt that this left him with nothing to reply with, the merciful and compassionate Sorcerer King still answered her.</p><br/><p>“…Eh? Ah, no, I do not feel that I am just. And frankly speaking, justice ought to be determined by others. The motives for everything I do are very simple. Well, I have thought of spreading my reputation too…”</p><br/><p>Neia recalled the matter of the statues.</p><br/><p>Does wanting to spread his reputation mean the Sorcerer King is a show-off after all?</p><br/><p>“That said, I now feel there’s no need to try so hard with that… I ended up talking about pointless things. All I desire is to live in happiness with my children. That is all there is to it, but at the same time, it is also everything to me.”</p><br/><p>She did not think the undead Sorcerer King could have children. Therefore, he probably did not mean children in the sense of carrying on his bloodline, but children in a broader sense. It felt like he regarded the citizens of his nation as his children.</p><br/><p>He is a kind man in every sense of the word… indeed, what a wonderful world it would be if even the frailest child could live in happiness. What was he thinking when he took this boy’s life…</p><br/><p>As she looked at the profile of his face, she saw something like grief for killing a child.</p><br/><p>“Well, that was pointless. In that case, let’s drop the topic here. Miss Baraja, while I am not qualified to speak pretty words, I hope you find the justice that belongs to you.”</p><br/><p>“…May I ask one more question? If your own subordinates had been taken hostage like that, would you have done the same thing?”</p><br/><p>“…Well, this might be grumbling on my part, but it would be troublesome in another sense.”</p><br/><p>“What exactly do you mean?”</p><br/><p>“In the past, I asked them out of curiosity, ‘What would you do if you were taken hostage to force me to negotiate?’ At that time, every single one of them promptly said they would rather kill themselves than inconvenience me in any way. ‘No,’ I told them. ‘Can’t you say you’d wait for me to rescue you?’ and things like that… While it pleases me to see their loyalty, this is still, how shall I put it? My subordinates are all a little too fanatical.”</p><br/><p>As he rotated his wrist, the Sorcerer King continued in a tired voice.</p><br/><p>Just as Neia began to think, Weren’t these unnecessary worries for someone in his position? Remedios appeared at the gate, carrying a bloodstained longsword, her armor similarly splattered in blood. Though she had removed her helmet, her bangs were stuck to her forehead by sweat. She looked utterly exhausted.</p><br/><p>After saying something to Gustavo, Neia sensed that for a moment, Remedios’s eyes had met hers. No, it was less that she had locked gazes with Neia, but rather, she had been looking at the Sorcerer King and Neia was in the way.</p><br/><p>Remedios said nothing, simply going back inside with a blank look on her face.</p><br/><p>In her place, Gustavo approached the two of them.</p><br/><p>“Your Majesty, I wish to express my thanks. While there were some slight losses, we were able to minimize them thanks to Your Majesty’s power. Normally, the Captain would be thanking you in person, but she is somewhat distraught at the moment due to the tragic condition in which we found the people, so I pray you will forgive me for taking her place.”</p><br/><p>Gustavo sneaked a peek at the boy, and then he looked back at the ground.</p><br/><p>“It is fine. Go tend to the Captain.”</p><br/><p>“Thank you very much.”</p><br/><p>“Come to think of it, what were those tragic conditions?”</p><br/><p>“Yes. We questioned several of the people we rescued, and they said that ‘They were skinning the prisoners.’ It would seem ‘they’ were not demihumans but demons sent by Jaldabaoth…”</p><br/><p>While she felt that the Captain was using her emotions as an excuse for her rudeness, that did not seem to be the case.</p><br/><p>Just as Neia was starting to feel surprised, the Sorcerer King beside her tilted his head in bafflement.</p><br/><p>“Why the skin? Why that? Are they going to eat it? Like chicken skin?”</p><br/><p>“No, we have no idea either… although, the demihumans did not seem to have taken part in those activities… Does Your Majesty know anything about this? Could this be for some kind of demonic ritual?”</p><br/><p>“No, I apologize. I have no clue either. Why would Jaldabaoth do such a thing?”</p><br/><p>The Sorcerer King’s puzzlement seemed to stem from the bottom of his heart, and after that everyone looked at each other, but they still could not unravel the mystery. Even so, since it was the work of demons, they might have done so just to make the humans suffer.</p><br/><p>“…I’ll ask the priests later. Then, Your Majesty, we are now trying to figure out the demihumans’ hiding places in order to clear them out, so I would like to monopolize a bit of your precious time afterwards.”</p><br/><p>After saying so, Gustavo went back inside the gate.</p><br/><p>About ten minutes after that, they could start seeing scattered human forms through the gate.</p><br/><p>They were the captives. Just like the boy who had been taken hostage, they were dressed in tattered, threadbare clothing that did not look like it could resist the winter chill. The paladins who should have escorted them to the door simply went back past them and vanished behind the gate. Had they done this because they had too few people to handle the prisoners, or was it because the suppression work was still ongoing, or both of them?</p><br/><p>The prisoners had looks of delight on their faces as they rushed toward Neia.</p><br/><p>However, they suddenly stopped in their tracks.</p><br/><p>That was probably because they had seen the form of the Sorcerer King. And then, some people continued to approach them. Perhaps they felt that the Sorcerer King was just wearing a mask or something.</p><br/><p>A man ran over from amidst the walking people.</p><br/><p>The man panted heavily, and then knelt down beside the boy which Ainz had laid at Neia’s feet. No, it would be more accurate to say he had collapsed there.</p><br/><p>The man caressed the boy’s cheek, and after seeing for himself that the boy was dead, he burst into mournful tears.</p><br/><p>Clearly, he was the boy’s father.</p><br/><p>Neia bit her lip.</p><br/><p>As the father cried his son’s name while he wept, the Sorcerer King calmly said:</p><br/><p>“I was the one who killed that boy.”</p><br/><p>Neia looked at the Sorcerer King in surprise. Was now the time to say this sort of thing?</p><br/><p>However, surely the wise Sorcerer King would not have suddenly said so for no reason.</p><br/><p>“Why, why did you kill him!?”</p><br/><p>The fires of hatred burned in the father’s eyes. Faced with that—</p><br/><p>The Sorcerer King replied with a mocking laugh.</p><br/><p>“To save you, of course.”</p><br/><p>“What, what did you say!?”</p><br/><p>For just a moment, the father’s eyes filled with fear. That was because he realized that the Sorcerer King’s face was not artificial. Then, his eyes roved to the sides in search of help, and they settled on Neia.</p><br/><p>However, before Neia could say something, the Sorcerer King spoke first.</p><br/><p>“Then may I ask you something? Why did you not protect your son? Your son was brought before me as a hostage.”</p><br/><p>“I protected him! But he was snatched away! Those bastards were stronger than me, so I couldn’t do anything!”</p><br/><p>The Sorcerer King laughed again.</p><br/><p>“Then let me ask you — why are you still alive?”</p><br/><p>The father did not know how to answer, and froze up.</p><br/><p>“I am asking you why you did not die to protect your child. It is said that not all lives are equally important. You should have been the one who valued that child’s life the most of all. So why did you not struggle wildly to protect him to your last breath?”</p><br/><p>The other people were peeking at the situation here from a distance.</p><br/><p>They must have felt unease, fear, and anger at the Sorcerer King who had taken the boy’s life.</p><br/><p>“What, what are you saying…”</p><br/><p>“You are the one who failed to protect him. Do not push the blame onto others. You, who were weak, are at fault. Also, you seem to be mistaken about something… you do realize that I am much more powerful than the Bafolk you claim to be stronger than you, no? …Although I can forgive some insults because I pity you for the loss of your child, I will slay you if they get out of hand.”</p><br/><p>The Sorcerer King reached out a bony index finger and rested it on the father’s face.</p><br/><p>“That, that’s because you’re strong — that’s why you can say that! Not everyone can be as powerful as you!”</p><br/><p>“Well said. I can say this precisely because I am powerful. Then, it is precisely because you are weak that being taken from is your lot in life, no? The strong preying on the weak is a very natural sequence of events.”</p><br/><p>The Sorcerer King turned his eyes to the people around him.</p><br/><p>“Have you not also experienced suffering because the Bafolk are strong?”</p><br/><p>“Are you saying the strong can do what they want!?”</p><br/><p>“Exactly. The strong do what they will, and the weak suffer what they must. This is the way of the world. The same rule applies to me. In the face of a more powerful opponent, I would have no recourse but to suffer. That is why I seek strength.”</p><br/><p>Neia understood why the Sorcerer King sought Jaldabaoth’s maids.</p><br/><p>His Majesty must be seeking strength because he wants to protect his nation, to protect the children of his country. So strength is the most important thing after all…</p><br/><p>“Well, originally, the weak like yourselves should have been defended by the Holy Kingdom, those who should have been strong… I really do pity you. If you were under my protection — under the protection of my country, the Sorcerous Kingdom, something like this could not possibly happen. That is because I would have used all my strength to protect the people and strike down the Bafolk.”</p><br/><p>Everyone around them was silent.</p><br/><p>The Sorcerer King’s arguments were cold and heartless, but at the same time they expressed the truth of the world.</p><br/><p>If they could not oppose his words with reason, would they choose to protest with their emotions? However, their fear of the Sorcerer King stopped them from doing so.</p><br/><p>“You, isn’t he one of the undead? What are the undead doing in a place like this?”</p><br/><p>The father could not say anything to the Sorcerer King because he feared the latter, and so he directed his wrath at Neia instead.</p><br/><p>However, before Neia could answer, the Sorcerer King stole a march on her, as expected.</p><br/><p>“To help your country, of course. And the fact is, you were all rescued by the undead of which you speak. If you are unhappy with that, why not save this nation by yourselves?”</p><br/><p>As he heard that, the father questioned Neia with his eyes. However, she could say nothing.</p><br/><p>That was because it was the truth.</p><br/><p>If the people of this country were enough to defeat Jaldabaoth, the Sorcerer King would not be here.</p><br/><p>The man hugged the boy’s corpse in fear, and then he turned and ran. The people to which the man ran had frightened looks on their faces as well.</p><br/><p>Neia heard the Sorcerer King say something, but she did not know if he was addressing the fleeing man or himself.</p><br/><p>“Even I would be oppressed if I were weak. Therefore one cannot forget to seek strength. I need to engrave into my heart the fact that beings of comparable power to myself most definitely do exist.”</p><br/><p>Part 3</p><br/><p>After attacking the first prison camp and freeing the Liberation Army troops imprisoned within, they went after their next prison camp the on the next day.</p><br/><p>They were not riding on the momentum of victory. Rather, there were several reasons why they could not do anything else. The most pressing one was because the food stocks in the prison camps were less than they had estimated.</p><br/><p>This, in turn, was the result of the twin policies of the demihumans not feeding their captives enough, and regularly shipping food in from a small city nearby.</p><br/><p>In addition, the demihumans who accompanied the food shipments were also responsible for inspecting the prison camps for any abnormalities.</p><br/><p>Even if they killed all these demihumans and took all their food, the opposition would definitely conclude that something had gone wrong at the prison camps.</p><br/><p>Of course, Jaldabaoth would learn of that as well. That being the case, it was very likely that he would dispatch a huge force which Neia and the others would not be able to defeat.</p><br/><p>After standing behind the Sorcerer King and participating — but obviously not speaking — in meetings, after a long argument that made Neia’s legs hurt to stand on, they had finally arrived at two possible courses of action.</p><br/><p>The first was to flee to the south after liberating one prison camp and throwing in their lot with the armies that ought to be stationed there.</p><br/><p>The second was to strike first and conquer the aforementioned small city.</p><br/><p>While both of these opposed courses of action had their own merits and flaws, they eventually went with the latter, after the Captain of the Paladin Order, Remedios, shouted for it.</p><br/><p>Remedios had a top secret reason for choosing to assault the city.</p><br/><p>After questioning the demihumans — and of course, killing them afterwards — the town which was their target apparently contained a someone with royal blood in their veins.</p><br/><p>If they were truly of the royal bloodline, it was very likely that the situation would improve. Even if they were not royalty, it would be a godsend if they were a great noble with a certain degree of status and connections. They could bank on the fact that they had saved his life to ask the southern armies to apply pressure, and possibly ask for reinforcements.</p><br/><p>However, Neia had her doubts.</p><br/><p>“Your Majesty, do you really think there will be a member of the royal family or a powerful noble there?”</p><br/><p>Neia had been allowed to ride a horse out of deference to the Sorcerer King’s status. Otherwise, the sort of horse which a low-ranking squire like Neia would have been allowed to ride would have been taken for use as a pack animal long ago.</p><br/><p>“I think it’s a trap. Even if it isn’t, the city will be garrisoned with many troops, and depending on the situation there might be demons present. Captain Custodio ought to be very aware of that. Even so, she has decided to fight an uphill battle like this. Sometimes, you need to wager everything on one bet.”</p><br/><p>If they did not seek the aid of the south, people would begin to starve soon. If that happened, Neia knew that the Liberation Army would not be able to carry on.</p><br/><p>Soon, they saw their objective, the small city, in the distance.</p><br/><p>From her horse at the tail end of the column, Neia looked at the militiamen marching ahead of herself.</p><br/><p>They were citizens of the Holy Kingdom who had been rescued from the prison camps. The reason why the paladins had pressed them into military service when they should have been resting was because they discovered that there were far more demihumans in the town than in the earlier prison camps.</p><br/><p>There were many more weakened people than expected, so they were not expected to make good foot soldiers. Even so, it was better than nothing, and so they were mobilized.</p><br/><p>Neia’s level of skill would be hard-pressed to hide such a large force from the eyes of the demihuman scouts, so they needed to move as quickly as possible.</p><br/><p>And the result of doing so was that the people only became more and more exhausted, and the number of adults sitting on cargo wagons only grew. The fact that they could actually sleep on the shaking and rattling wagons only served to show how tired they were. In contrast, the children were cheerfully running along.</p><br/><p>The priests were probably not used to long journeys on foot either, given how they would look enviously at the cargo wagons from time to time.</p><br/><p>Even in this state, they’re going to be thrown straight into a battle once they arrive. Are they really going to be all right?</p><br/><p>During their strategy meetings en route, they had decided to immediately attack the city upon reaching it. That was because they lacked both provisions and time.</p><br/><p>Attacking a city with enemies lying in wait during daytime was extremely dangerous.</p><br/><p>It would be easier to approach at night, but it would be very disadvantageous to humans, who did not have night vision abilities. In particular, night battles were very dangerous for the citizens, who only had what combat training they had received as conscripts.</p><br/><p>With that in mind, they had decided to attack during the day.</p><br/><p>The battle lines had already been formed up ahead of them. At their head were the paladins. Behind them were militiamen holding wooden walls they had made after wrecking the prison camps, and at the back were the priests.</p><br/><p>The plan was the same as last time, using the angels to suppress the enemies on the walls while the paladins broke down the gates; a tactic which relied on brute strength for everything. The citizen-soldiers’ job was largely limited to frightening the enemy through weight of numbers. Therefore, they had ordered the civilians to avoid fighting, and if they had to fight, to gang up on their opponents, among other things.</p><br/><p>“…Now then, show me how you will do this.”</p><br/><p>The Sorcerer King muttered to himself.</p><br/><p>As an observer, the Sorcerer King would not be involved with the battle.</p><br/><p>While they wanted to draw on his strength for a siege like this, nobody opened their mouth to ask him during their meetings. The Sorcerer King paid no heed to the pleading gazes directed at him, and he was now positioned in the rear echelon.</p><br/><p>The battle began like it had the last time.</p><br/><p>It may have been a small city, but it was very large for the region. Its portcullises were reinforced with iron, and there were murder holes above it. The walls were not built of wood, but stone. The walls and gates were also much better made than those of the prison camps, which had largely been scavenged from materials taken from the villagers. However, because this city had less than ten thousand residents, one could not say it was impregnable.</p><br/><p>The attackers found it troublesome, while it left the defenders uneasy. That was probably a more appropriate evaluation of the situation.</p><br/><p>Remedios led the paladins in a charge, while the angels attacked the demihumans on the walls.</p><br/><p>However — the angels occasionally vanished into motes of light after being hit by enemy attacks.</p><br/><p>It would seem the demihumans were the same Bafolk they had encountered previously in the camps, but as expected, the ones defending this city were very skilled troops.</p><br/><p>The most obvious of them was a Bafolk on the walls — hiding among the battlements — and holding a well-made longspear. He had already impaled many angels.</p><br/><p>That Bafolk gave a mighty cry.</p><br/><p>Perhaps it was some kind of skill, but it did not affect the angels or the paladins breaking down the gates beneath him. Was it because of a narrow area of effect, or was it only effective on allies? The details were unclear. However, it would be good to remember that he possessed some sort of special ability.</p><br/><p>Looking down, both sides were fighting fiercely outside the gates</p><br/><p>The Bafolk thrust their long spears from the other side of the portcullis — from inside the city — at the paladins, who blocked them with spiked shields. Thus, they prevented the enemy from attacking the paladins with the battering rams. Remedios, on the other hand, directly cut apart the longspears they stabbed at her.</p><br/><p>The demihumans dumped boiling water on them through the murder holes. However, the paladins already had 「Protection Energy Fire」 cast on them in anticipation of this, and so no matter how much water got on them, the paladins were unscathed.</p><br/><p>Of course, since this was winter, things would be troublesome if they were drenched and then the temperature fell, but it was fine for the moment.</p><br/><p>If they had used boiling oil instead of water, their swords would have slipped easily from their hands. Perhaps oil was precious to the demihumans but they did not make such preparations.</p><br/><p>The slowly-advancing civilians carried the wooden walls which they had brought along to use as shields. While it would have been better if they had been made out of metal, it could not be helped given their lack of proper arms. It might not have been terribly sturdy, but it was better than nothing, and the citizen-soldiers hidden behind them began spinning up their slings. They were aiming at the demihumans fighting with the angels. Of course since they were not used to combat, the stones they threw struck the angels more often that not.</p><br/><p>Even though they were taking friendly fire, the angels were resistant to unenchanted attacks, so it was not a problem for them. Of course, it was merely damage reduction and not immunity, but still, the citizen-soldiers did not do that much damage to the angels. It was simply because the sling stones would hurt the demihumans more if they hit them.</p><br/><p>Every time an angel fell, the priests would summon a new angel and throw it into the fray. While there were very few of them, this inexhaustible and untiring supply of fresh troops kept pouring on, and the demihuman resistance began to falter.</p><br/><p>“…Mm. After considering the opposition might use defensive magic, they ought to have splashed cold water on them. Combined with the cold of winter, it would make their opponent’s body temperature plunge… after all, most people would cast spells to protect against fire.”</p><br/><p>As the Sorcerer King looked at the battlefield, he muttered to himself, as though he were conducting a calm analysis of the fighting.</p><br/><p>It was hard to respond to those words. While nobody had died yet, there were those who were already wounded, so she could not bring herself to speak.</p><br/><p>“Speaking of which, is it really all right if you don’t participate in the battle, Miss Baraja? You ought to be able to make a good accounting of yourself with the bow I gave you.”</p><br/><p>Neia was assigned to stand watch by the Sorcerer King’s side. Using her own body as a shield for him was her duty. Therefore, she had not been ordered to fight.</p><br/><p>However, just like before, the Sorcerer King seemed very eager for her to use that bow of hers.</p><br/><p>Does he want me to use the weapon he lent me? I could try taking a shot from here, but missing the first shot with a borrowed weapon would be a little too—</p><br/><p>Just as Neia was hesitating over how to answer, a mighty noise came from the vicinity of the city gate. Looking over, it would seem the portcullis had been broken down. The noise was a combination of the paladins’ rejoicings and the demihumans’ anxious cries.</p><br/><p>Once the city gate went down, the paladins would flood into the city like an avalanche.</p><br/><p>After seeing Remedios’s superb skills, the shaken beastmen grew more and more frantic.</p><br/><p>After that — the paladins retreated amidst a great clamour.</p><br/><p>Neia’s keen vision saw within what was inside the narrow aperture of the gates before the paladins had made it there.</p><br/><p>It was the same as before.</p><br/><p>A Bafolk was clutching a child, even younger than before, and issuing orders to the paladins on the other side of the city gate. While his voice did not carry over to them, one could imagine the orders which had been given.</p><br/><p>The paladins began falling back and leading the retreat were Remedios and Gustavo. After that, they told the priests to “Have the angels fall back, otherwise they’ll kill the child.”</p><br/><p>“Here we go again. I can’t listen in from over here, I want to go over there and take part in their conversation. How about it?”</p><br/><p>“You have no need to seek my opinion, Your Majesty.”</p><br/><p>Neia and the Sorcerer King walked towards Remedios, who was stationed some distance — between the Sorcerer King and the city gates — and discussing something under the eyes of the uneasy citizen-soldiers.</p><br/><p>“We should negotiate with them, after all,” Remedios said, but the one who was frowning after taking off their helmet was someone else. Perhaps it was because they knew what had happened at the first prison camp, but all of them had How can we approve of this? written on their faces.</p><br/><p>Even after the Sorcerer King came, they still had not found an answer.</p><br/><p>No, everyone was trying to think of how to talk Remedios down from her position of “In any case, we need to save that child,” but that seemed unlikely.</p><br/><p>After proposing a few vague compromise plans that were ultimately a waste of time, several people exchanged looks, and soon Gustavo raised his voice to shout, “Captain!” as he poured strength into his eyes.</p><br/><p>“We’ve gone over this countless times already! Even if we had the time, even if we discussed this more, there wouldn’t be a way to do it! We can’t save that child!”</p><br/><p>After hearing what Gustavo said, Neia knew that the Captain had continued the strategy meeting even after the Sorcerer King had left the command tent. At the same time, she knew that the paladins would not be able to solve this problem without spilling blood.</p><br/><p>Remedios bit her lip and remained silent. However—</p><br/><p>“Captain! We can’t win this battle without sacrifice! Right now, we ought to sacrifice the few to save the many!”</p><br/><p>Neia saw Remedios’s eyes flare crimson at those words.</p><br/><p>“—That is not the kind of war Her Majesty would wage! We are Her Majesty’s swords! We serve the Holy Queen, she who wants the people of this nation to live in peace!”</p><br/><p>“But the Holy Queen-sama is…”</p><br/><p>Is dead, but before Gustavo could say that, Remedios shouted to interrupt him.</p><br/><p>“The next Holy King hasn’t been appointed yet! Shouldn’t we protect the ideals of the Holy Queen-sama to whom we pledged our swords until then? What does a vow of loyalty we made mean when we break it ourselves!?”</p><br/><p>Ah, I see. Neia understood.</p><br/><p>Remedios was bound, bound by the wishes of the person to whom she had pledged her loyalty.</p><br/><p>Since they were knights of the Holy Queen who loved the people, they could not do anything which would harm the people.</p><br/><p>The only one who could break her bonds was the next person to whom she offered her loyalty.</p><br/><p>“Is that wrong? Who did you pledge your swords to? You all went through the ceremony to be ordained as paladins! Who do you think the paladin order serves!?”</p><br/><p>When a squire became a paladin, they would meet with the Holy King and ritually offer the sword they held to him. Similarly, when there was a change of Holy King, the paladins would meet with him and offer their swords to the reigning Holy King while swearing their loyalty. Therefore, everyone in this band of paladins had pledged their swords to the Holy Queen.</p><br/><p>“Or did you not?” Her tone changed in an instant. After heating up, she cooled down right away, and her voice was filled with a freezing chill. “Was the Holy Queen-sama wrong to wish for the smallfolk’s happiness and a nation where nobody would need to cry?”</p><br/><p>“She wasn’t wrong! But.. depending on the situation… we might need to change.”</p><br/><p>“Who? Who needs to change? Tell me, then. Is there a higher form of justice than ‘Not having to sacrifice anyone!?’”</p><br/><p>Gustavo shut his mouth.</p><br/><p>Neia realised that she had made a mistake just now.</p><br/><p>She was not ruled by her loyalty to the will of the Holy Queen whom she had pledged to serve.</p><br/><p>Remedios said that one ought to carry out justice. However thorny the path, however difficult it was to walk, one ought to trudge through all the difficulties in one’s way and continue forward without heed for what was around oneself.</p><br/><p>Sacrificing the few to save the many, and saving everyone no matter how great or small; which of these was truly just?</p><br/><p>That much was obvious.</p><br/><p>Clearly, it was the latter. However, it was far too idealistic, and a normal person would immediately give up on it. However, even after knowing this, Remedios still insisted on saving everyone.</p><br/><p>She held firmly to an ideal that a normal person would abandon immediately.</p><br/><p>That was why she was the Captain of the paladins, the highest ranked paladin of them all.</p><br/><p>Remedios was the only one seeking her lofty definition of justice, and those who could not understand this were the pitiful ones.</p><br/><p>Several paladins lowered their heads in shame. Perhaps they felt the same way.</p><br/><p>If one considered the Sorcerer King’s justice of “killing one to save a thousand” to be a king’s justice, then Remedios’s justice of “one or a thousand, they are all the same” was an ideal — a shining form of justice.</p><br/><p>Both sides were just. Neither was wrong. Even so—</p><br/><p>Is there no justice without strength?</p><br/><p>For instance, if Remedios were stronger — if she possessed a godlike power which Neia could not imagine, she could save the child, and save the inhabitants of the city. In that case, there would not have been any problems.</p><br/><p>However, that was not the case.</p><br/><p>She was stalled here because there was no way to carry on without sacrifice.</p><br/><p>Carrying out justice requires strength. Ahhh, I want to become strong… that way, I can wipe away Jaldabaoth’s taint from this country…</p><br/><p>“…Forgive me for interjecting while you are at a deadlock, but you will not reach a conclusion this way.”</p><br/><p>That exceptionally cold voice blew away the building heat in the air.</p><br/><p>“Your Majesty…”</p><br/><p>“Captain Custodio. If this goes on, you will only serve to make the enemies know about the effectiveness of hostages. In my view, you will not be able to conquer this city without sacrificing anyone.”</p><br/><p>“Certainly not. There ought to be a better way to do this. A way where nobody needs to be sacrificed and where nobody needs to be sad!”</p><br/><p>In response to that voice, which sounded like it was being bled out of her, the Sorcerer King gave a flat reply.</p><br/><p>“I don’t think such a way exists… we’ve wasted too much time. If this goes on, the past is only going to repeat itself.”</p><br/><p>Remedios bit her lip tightly. A tiny rill of blood flowed down it.</p><br/><p>“…Then… Captain. Just sacrifice that child.”</p><br/><p>“That—!!”</p><br/><p>“Hm. Leave the rest to me. Since so much time has passed, I doubt you will be able to resolve this with a tiny sacrifice, even if you charge in with the will to die”</p><br/><p>“Is that really all right!?” It was Neia who could not help crying out. “Your Majesty has been conserving his mana to fight Jaldabaoth; won’t using that mana make the fight against Jaldabaoth unfavorable?”</p><br/><p>“It is as you say, Ms. Baraja. However, there is no other way in order to save more people… while I cannot possibly guarantee that there will be no losses, at the very least, there will be far fewer than if you try. How about it? Will you leave it to me?”</p><br/><p>“So there will still… be sacrifices…”</p><br/><p>“Unfortunately so, Captain Custodio.”</p><br/><p>Remedios bowed her head and left without a word. She walked toward the city — where the citizen-soldiers were looking with uneasy eyes.</p><br/><p>“My apologies, Your Majesty. In the Captain’s place, please allow me, Gustavo, to beseech you to aid us.”</p><br/><p>“Umu… Well, it’s a pointless question, but you will thank me for it, right?”</p><br/><p>Everyone present was puzzled by the Sorcerer King’s question, but they immediately responded in agreement. Neia did not miss the uneasiness in their hearts over why he had asked such a reasonable question.</p><br/><p>“Really now? Then I will pacify the city by myself. You gentlemen should keep an eye out for any fish that slip the net and kill them or take them prisoner. Personally, I would rather take them captive in order to question them for information. Also, I will be using the undead, so don’t get too excited.”</p><br/><p>Saying so, the Sorcerer King set out for the city gates without waiting for an answer.</p><br/><p>“「Greater Magic Seal」, 「Mass Hold Species」.”</p><br/><p>The Sorcerer King did not stop walking as he cast his spells.</p><br/><p>After incanting those two spells, he waved a hand and conjured several flickering shadows.</p><br/><p>There were ten of them in total.</p><br/><p>They radiated an aura unique to the undead, one which the living could not abide. Their translucent forms displayed expressions of misery.</p><br/><p>They were Wraiths. Neia had once heard that they would take the shape of the species who saw them from her monster lore lectures. However, their bizarre appearances looked like three people’s shadows blended together, unlike what the lectures had said.</p><br/><p>“You, High Wraiths.”</p><br/><p>The monstrous-looking shadows followed the Sorcerer King as he walked. The grass by their feet crackled as it withered. Already brown from winter, they shrivelled up rapidly as they lost their water content.</p><br/><p>“Go over there and wait for my instructions.”</p><br/><p>The undead moved in perfect unison, unconstrained by gravity, and they floated swiftly into the air. In seconds, the undead melted into the azure sky overhead, and the fact that she could not see them with those eyes of which she was so proud only intensified her shock.</p><br/><p>While she wondered if it was really all right not to explain in detail to those summoned undead, the Sorcerer King who could make such perfect battle plans would surely not have overlooked that point.</p><br/><p>“Those, those were…”</p><br/><p>“High Wraiths. Since they are incorporeal beings, they can pass through walls and other obstacles… of course, they can’t pass through things without limit… you probably don’t want to know the specifics, do you? Well, they’re part of my preparations for taking the city. Now then, please wait here, Ms. Baraja…”</p><br/><p>“—Please allow me to accompany you.”</p><br/><p>“Mm… in that case, please wear this item around your neck.”</p><br/><p>“This, this is?”</p><br/><p>The Sorcerer King produced a necklace with a five-pointed star pendant, set with a large carnelian in the center.</p><br/><p>“This item grants immunity to fear. High Wraiths have the ability to emanate terror. …Let me get this out of the way first. Afterwards, you will be walking into complete chaos. People driven by fear can sometimes show fearsome strength. Even I might not be able to protect you, so if you still wish to follow…”</p><br/><p>“—Please allow me to accompany you.”</p><br/><p>“U-Umu. Is, is that so? I understand.”</p><br/><p>Neia fastened the necklace around her neck.</p><br/><p>“Even so… good grief, they are at war, you know. How could there be a war without casualties?”</p><br/><p>Neia smiled bitterly in response to the Sorcerer King’s slight jest.</p><br/><p>Of course, that was not what Remedios had meant. The Sorcerer King could not possibly have missed the meaning of her words. This was probably the Sorcerer King’s way of cracking a joke, but even so…</p><br/><p>His Majesty does not seem particularly talented at cracking jokes.</p><br/><p>Perhaps this might be the Sorcerer King’s sole weakness. Just as that thought came to Neia’s mind, they had reached the vicinity of the city gates.</p><br/><p>“Fall back, paladins. I am going to conquer this city now. Move to the rear… I believe you ought to get at least that far back, no?”</p><br/><p>The Sorcerer King indicated the rearmost paladins and then, he walked into the city gates, like he was strolling into an empty field.</p><br/><p>“Get back! If you don’t move quickly, this brat will—”</p><br/><p>Soon enough, the Sorcerer King ran into the Bafolk who was holding the child hostage.</p><br/><p>It was hard to tell what kind of expression the demihuman was making. It was probably shock. The other demihumans around the Bafolk probably had the same looks on their faces. No, even Neia would be shocked if she suddenly saw the Sorcerer King.</p><br/><p>“…The, the undead!?”</p><br/><p>With that, the word “undead” rippled through the demihuman ranks.</p><br/><p>“Indeed. Ah, I believe they are called ‘The Living?’ I heard that once, but I do not quite trust my recollection.”</p><br/><p>“Wha-what? Why are you? What on earth… are you really… no, a human?” The Bafolk’s eyes turned to Neia. “You! You control that undead creature, right? What a creepy guy he is!”</p><br/><p>Thoughts like, I’m not a necromancer, or You’re being rude to the Sorcerer King, ran through Neia’s mind, but she remained silent.</p><br/><p>“Sorry to intrude while you’re in chaos, but—”</p><br/><p>“—Get back, undead! Or else this kid gets it!”</p><br/><p>The Bafolk tightened his grip around the boy’s throat.</p><br/><p>All signs of life fled the boy’s face. His glazed-over eyes reflected the Sorcerer King’s visage, but he did not react. Even so, he still gasped softly when his captor grabbed his throat.</p><br/><p>“Fuhaha! You’re actually trying to use the living as a hostage against me, one of the undead? My, my.”</p><br/><p>The Bafolk’s eyes went wide. His expression’s kind of disgusting, and Neia mused that the reason she had the room to calmly think like this because she was backed by the mountain that was the Sorcerer King.</p><br/><p>“Human! Call this undead off!”</p><br/><p>It’s not like I’m controlling him…</p><br/><p>“Hm. Now then, shall we begin?”</p><br/><p>“What? Stay back! Get back right now!”</p><br/><p>Perhaps it had sensed something, but the Bafolk took a step to the rear while still holding its hostage.</p><br/><p>When she looked around closely, she could see the forms of other children. Had they been brought here as hostages as well? Even so, they did not seem to want to kill their hostages to teach them a lesson. They probably thought, Would living hostages really work on the undead, who were the enemy of the living?</p><br/><p>Neia sensed something like a black wind curling past her. In that moment, all the Bafolk froze in place. Ever since the Sorcerer King had shown up, everyone present had remained still, studying him so as not to miss a single move he made, but this change was far too extreme. Their eyes and mouths gaped open, and their faces twisted in an ugly manner. Also — it was not just the Bafolk. Even the near-lifeless children showed a dramatic response to this.</p><br/><p>While she could not read the demihumans’ faces, Neia understood human expressions. Fear was written on the children’s faces. It was an absolute, unimaginable, and overpowering fear.</p><br/><p>“Aiiiieeeee!”</p><br/><p>The Bafolk screamed in a strange way—</p><br/><p>“—Hmph. Release, 「Mass Hold Species」.”</p><br/><p>A magic circle appeared, and some kind of spell flew forth from the Sorcerer King. In the next moment, the numerous demihumans and their child hostages froze in place like hideous statues, their faces still twisted. However, they did not look like they were dead. She could hear the faint sounds of breathing — quite ragged, it would seem.</p><br/><p>And then, above them — countless cries rang out from near the city wall. After that, the thump, thump sounds of meat being bludgeoned came from behind Neia.</p><br/><p>“All right, let’s go.”</p><br/><p>She was briefly distracted by that sound, so when she looked forward again, at the portcullis—</p><br/><p>“「Greater Break Item」.”</p><br/><p>—A shrill noise rang out. It was the sound of the pieces of pulverized gate falling like rain.</p><br/><p>“As I thought, destroying buildings with this drains a lot of mana… although I didn’t use it like that over there… I guess all I can do is accept the fact that I need to pick my targets for best effect. You can’t look down on small things, after all.”</p><br/><p>The Sorcerer King muttered to himself as he walked over the hill of the gate’s debris and passed through the city gate, with nobody to block his path.</p><br/><p>The rapidly changing situation left Neia confused and unable to move. Once she regained her calm, she smiled to herself.</p><br/><p>The Sorcerer King had destroyed in seconds the portcullis which the paladins had worked so hard to just dent.</p><br/><p>The strong really are unfair…</p><br/><p>Neia jogged after the Sorcerer King, and he turned around in front of the immobile Bafolk.</p><br/><p>“So, how about them?” he said, while indicating the motionless demihumans and the children they were holding. “It’s only temporary, you know. Go tie up everyone here.”</p><br/><p>“Then I’ll call the paladins over.”</p><br/><p>“That would be a great help. Unfortunately, I am still radiating a fear aura. Everyone who steps into it will be terrified. Therefore, please ask them to take the appropriate measures. I believe priests ought to have 「Lion’s Heart 」 while paladins have… hm, ask them to use 「Under Divine Flag」, how about that?”</p><br/><p>“You actually knew about that…”</p><br/><p>The Sorcerer King chuckled, and then walked through the Bafolk, as if to fill the gaps between them.</p><br/><p>“Gooooohhh!!”</p><br/><p>A strong-looking Bafolk fell from above with a growl, holding a spear. It had probably jumped down from the city wall.</p><br/><p>Its eyes were red and he was foaming at the mouth. It was clearly not in a normal state of mind. It looked like he had gone mad.</p><br/><p>“I see. Savagery… no, berserking? Certainly, that would negate fear and other mental effects — oops.”</p><br/><p>The Sorcerer King skillfully evaded the stabbing spear. It was a crisp, efficient movement, one unique to trained individuals. However, the Sorcerer King’s evasion meant that a Bafolk who had become a statue ended up being stabbed by its compatriot’s spear instead. The spear pierced straight through its body, and it collapsed to the ground, spraying blood everywhere.</p><br/><p>The berserk Bafolk no longer seemed able to tell friend from foe.</p><br/><p>“Give me a break.”</p><br/><p>The Bafolk raised its spear. Was he going to sweep with it? However, Neia could not launch an arrow.</p><br/><p>The Sorcerer King approached the Bafolk, like he wanted to block her shot.</p><br/><p>Certainly, it was wise to close the distance given the spear’s length. However, the Sorcerer King’s next move deviated from common sense.</p><br/><p>With a swift movements, he pressed down on the Bafolk’s head from left and right.</p><br/><p>Perhaps it was because the Sorcerer King was surprisingly strong, but the Bafolk could not escape the Sorcerer King’s grasp no matter how it thrashed. Having given up on that, the Bafolk thought of something else; it gripped the front portion of the spear and drove it through the Sorcerer King. No, to be precise, it looked to Neia like it had driven the spear through him.</p><br/><p>However, the Sorcerer King did not flinch. Perhaps a defensive spell had stopped it.</p><br/><p>“You’re not like that Troll, after all.”</p><br/><p>With a sickening squitch, the Bafolk’s eyes popped out of its skull.</p><br/><p>This was clearly a lethal injury. No, one could say that this was even worse than a fatal wound.</p><br/><p>The Sorcerer King let go, and the Bafolk collapsed on the ground. Its limbs twitched around on the ground, but it was hard to say that those movements were consciously driven.</p><br/><p>“May, may I know what you did?” Neia nervously asked from behind, and the Sorcerer King dusted his hands off as he nonchalantly replied:</p><br/><p>“I crushed its skull. Sometimes, berserk individuals don’t go down even when they’re fatally injured. Still, if you destroy the brain, it should be fine… Still, it really was weak. Barely harder than an eggshell… are you kidding me?”</p><br/><p>Neia’s face twitched.</p><br/><p>His Majesty really doesn’t have any gift for making jokes…</p><br/><p>“All right, Ms. Baraja, call the paladins. Tell them to secure this area so I — we can continue forward together.”</p><br/><p>“Yes!”</p><br/><p>Neia ran back outside at top speed, to where the paladins were. When she looked there she saw several Bafolk lying at the paladins’ feet.</p><br/><p>Since they could not have run out from the gate, they had probably been Bafolk who, in their attempt to flee the Sorcerer King who was the source of their fear, had chosen to jump off the walls, and this was the result.</p><br/><p>After reaching the paladins, Neia hurriedly relayed the Sorcerer King’s instructions. After that, she rushed back at top speed to the Sorcerer King’s side.</p><br/><p>After Neia returned, the Sorcerer King said, “Then let’s go,” and entered the city streets.</p><br/><p>The question of why no new Bafolk had come after the city gates had been breached immediately faded away.</p><br/><p>Neia heard groan after groan. It made her think that this unliving city was moaning.</p><br/><p>“This, this is…”</p><br/><p>“I ordered the undead I released to spread fear. This is the result. Some hostages might have been trampled in the confusion… well, all you can do is treat it as a sad accident. Give up on them.”</p><br/><p>She cast her eyes outward, and a horde of Bafolk was running towards them, with desperate — probably — looks on their faces. They looked just like harried prey animals, and Neia even found them a little pitiful.</p><br/><p>They must have been exposed to extraordinary fear. Otherwise, why would they run towards a being who was even more powerful than the undead creature from which they were fleeing?</p><br/><p>“Hm… no signs of humans then? In that case — 「Maximize Widen Magic — Fireball」”</p><br/><p>The Sorcerer King discharged a fireball into the center of the Bafolk horde, and it erupted into a massive blaze. After that vanished, demihuman bodies rained down everywhere.</p><br/><p>“While waiting here might be the best thing to do… the enemy seems to have a leader. He’s waiting in a plaza near the center of the city, and he’s resisted the fear of the High Wraiths, so let’s move on… what do you think?”</p><br/><p>“I believe all will go well if we do as Your Majesty wishes.”</p><br/><p>“Really now? Then let’s go.”</p><br/><p>Every time they took a step forward, soul-chilling cries seemed to echo from everywhere, as though a great massacre was taking place. Also, due to the demihumans’ lack of hygiene, their raw waste, feces, and urine were everywhere, which made Neia wrinkle her nose.</p><br/><p>“…Speaking of which, Ms. Baraja, what should be done about those?”</p><br/><p>She looked in the direction where the Sorcerer King was pointing at. There were a group of naked human beings there.</p><br/><p>Regardless of gender, their hands had been nailed to wooden stakes that had been driven into the ground. In their efforts to flee their fear, they had struggled violently, and their arms were coated with fresh blood.</p><br/><p>In all likelihood, those were probably fences made out of human beings</p><br/><p>They were exhausted, bone thin, but their lives did not seem to be in danger.</p><br/><p>She had attacked this city in order to free the people. Even if she continued following the Sorcerer King, Neia would not be of any use. In that case, helping them now and taking them to a safe place was the right thing to do. However, there was one thing which made her uneasy.</p><br/><p>What should she do if the people were attacked by demihumans while they were evacuating?</p><br/><p>What a joke. What am I hesitating for? The Captain would have chosen to help them without any hesitation. And the reason why I can’t is… is it because of strength… after all?</p><br/><p>“You’re confused, hm. Then, just leave them be for now. There shouldn’t be any demihumans nearby. Leaving them here should be safer. Let’s go.”</p><br/><p>“Yes!”</p><br/><p>While she still had her doubts, Neia continued following the Sorcerer King to the city’s plaza. Why was it that the Sorcerer King could advance without the slightest delay? Though she had her doubts, she convinced herself by saying, “He must have cast a spell.”</p><br/><p>Soon, the two of them came to a plaza which looked like a market with streets everywhere.</p><br/><p>“Hm… as I thought, there was no way this could have been resolved without sacrificing people.”</p><br/><p>She followed the Sorcerer King’s eyes, and there were human corpses mixed with demihuman corpses. They were probably people who had been trampled to death in the fear-induced chaos.</p><br/><p>“…It can’t be helped.”</p><br/><p>While the Sorcerer King was joking, attacking this city by brute force would probably have caused a matching number of casualties. Going by that, letting the Sorcerer King use his overwhelming might to conquer the city minimized the number of lives that were lost.</p><br/><p>The Sorcerer King shrugged silently, and then he indicated the center of the plaza with his chin.</p><br/><p>There was a demihuman there who was larger than all his peers.</p><br/><p>His curled horns resembled those of a mountain goat, and he was covered in silver fur. His excellent physique clearly showed that he was not an average demihuman.</p><br/><p>The tips of his horns were encased in a shell of gold which was socketed with jewels, and he wore a green breastplate that had turtle-shell patterns on it. He wore a reddish-brown cape made from worked animal hide. His left hand held a large shield with a topaz socketed into it, while his right hand held a bastard sword whose blade was light yellow. His panoply vividly illustrated the courage and ferocity of a gallant warrior.</p><br/><p>He was the most fearsome and well-trained of the demihumans. He was probably a Lord or some kind of similarly ranked special being.</p><br/><p>If Neia were alone, she would have fled this opponent with all her might.</p><br/><p>“Wonderful. I wonder which one of your items stopped the fear.”</p><br/><p>The Sorcerer King’s delighted words referred to the magic items adorning the demihuman. He had rings on both hands and jewelry hanging from his neck that covered his entire chest. There were things dangling from both sides of its waist, things which might have been a set of three human baby skulls strung together.</p><br/><p>The green-eyed demihuman studied the Sorcerer King as he approached, and then his gaze shifted to Neia.</p><br/><p>“A newly-appeared undead… and is that a necromancer in the back?”</p><br/><p>The demihuman obscured itself behind its large shield, as though wary of a gaze attack like the kind a Medusa would launch.</p><br/><p>“Not bad. You managed to push this city, my tribe to this point… You, who controls the enemy of all life, the user of fearsome magic. State your name.”</p><br/><p>The Bafolk pointed his sword at Neia.</p><br/><p>“—No, wait, hang on. You’ve gotten it wrong. It’s not me!”</p><br/><p>“…What?”</p><br/><p>She looked to the Sorcerer King for help, and he folded his arms and looked to Neia.</p><br/><p>“So you do understand. That’s right, it’s her. She’s my master.”</p><br/><p>“No, no! Wait, wait!! Your Majesty!!!”</p><br/><p>What on earth was he saying? Truly, he had no talent for making jokes at all.</p><br/><p>As he saw how Neia flapped her hands around in panic, the Sorcerer King chuckled.</p><br/><p>“Mm. Feeling better now?”</p><br/><p>“Eh?”</p><br/><p>“Ah — it was just a dumb joke.”</p><br/><p>Flaring his cape with the regal motions of a king, the Sorcerer King turned to regard the demihuman before him.</p><br/><p>“I am the entity who set the undead upon you. I am the the undying king who rules a country to the northeast, the rule of the Sorcerous Kingdom, the Sorcerer King Ainz Ooal Gown. And what is your name?”</p><br/><p>“My name is Buser — the Grand King Buser… O Sorcerer King, how about the woman by your side?”</p><br/><p>“She is my follower. Well then, what do you want to do? Would you rather be killed by me? Or kneel in servitude? Choose as you wish.”</p><br/><p>“With my name as Lord at stake, kneeling once in subservience will be enough!”</p><br/><p>Buser raised his shield and advanced, raising his sword into a horizontal position. He looked like a goat about to charge.</p><br/><p>“Mm… Then I shall play with you for a while. —Ms. Baraja, you just sit back and watch. Speaking of which, goat. You’re equipped with all kinds of magic items, but I detect no magic from that thing at your waist. Is that some kind of special item?”</p><br/><p>“Fuhahaha. It’s the latest fashion. They’re just bones.”</p><br/><p>“Mm… that does remind me of my subordinates.”</p><br/><p>Neia shuddered from behind as she heard that. So he has such subordinates…</p><br/><p>“They’re well-shaped, no? They’re the best this city has to offer.”</p><br/><p>“…I see. I understand. I sympathize with your feelings. It seems this fashion thing is quite important. The maids have taught me that very well… all right, let’s begin. 「Create Greater Item」.”</p><br/><p>After casting his spell, a jet-black sword appeared in the Sorcerer King’s hand.</p><br/><p>Why is His Majesty using a weapon?</p><br/><p>The Sorcerer King should have been an arcane magic caster. And a top rate one to boot.</p><br/><p>In that case, weapons were to be used only after he ran out of mana and options. Arcane magic casters knew that well, which was why they did not touch any weapons.</p><br/><p>The Sorcerer King must have chosen to fight with a sword for some reason.</p><br/><p>—Could it be that he’s expended a great deal of mana? That would be bad… His Majesty came here to do battle with Jaldabaoth…</p><br/><p>After the repeated casts of 「Fireball」, the spell which had immobilized a large group of the enemy, and then — his mass summonings of the undead — she could understand if his mana had been heavily depleted.</p><br/><p>The spell to summon those undead must have been of quite a high tier…</p><br/><p>While she did not know how powerful High Wraiths were, they were most definitely stronger than Wraiths. Therefore, summoning so many High Wraiths would have required a great deal of power.</p><br/><p>Under normal circumstances, every time a priest cast a spell to summon angels, he would only be able to summon one at once. If they were willing to summon weaker angels, they could call forth multiple entities. By that logic, he must have used a very high tier spell — possibly a unimaginably potent spell of the sixth tier.</p><br/><p>…The sixth tier…</p><br/><p>Neia gulped.</p><br/><p>The sixth tier was a realm where none had explored before. According to legend, the Holy Queen could use spells of the fourth tier. This was two tiers above her.</p><br/><p>It might have been a realm beyond common knowledge, but the Sorcerer King might have been able to make it a reality.</p><br/><p>Maybe, if he used a sixth tier spell for his summons, I could understand how he used a vast quantity of mana. But in that case, wouldn’t it be better for me to help the Sorcerer King?</p><br/><p>Neia looked at the Sorcerer King’s back as he squared off against the demihuman. The demihuman she could see over the Sorcerer King’s shoulder was very strong, and no amount of Neias would help against him. However, the Sorcerer King carried himself with a sovereign’s forthright bearing, with no sign that he was picking a fight he could not win.</p><br/><p>Could it be that His Majesty is a magic swordsman-type arcane magic caster?</p><br/><p>There were benefits and drawbacks to improving one’s swordsmanship and spellcasting at the same time. The benefits included being able to use many fighting methods, but the drawbacks were that one would be mediocre in both fields.</p><br/><p>In that case, what was the Sorcerer King like?</p><br/><p>The two of them studied each other, and then they slowly began to move.</p><br/><p>They closed the gap between them, until they were in melee range. Buser launched the first strike.</p><br/><p>“「Shield Bash」.”</p><br/><p>It was a sudden charge, made with a shield held in front of himself. And the Sorcerer King took it head on with his sword.</p><br/><p>As expected, there was no way to take the force of that massive body as it suddenly charged forward. The Sorcerer King was sent flying. No, his feet were still firmly planted on the ground when he landed, so that did not quite fit. Rather, he had been knocked back.</p><br/><p>While the fact that the Sorcerer King — who could crush a Bafolk’s skull with his bare hands — had been knocked back was quite surprising, surely a body of bones would not be able to completely defend against that attack. From what Neia knew, there was an advanced martial art called 「Fortress」 that could completely nullify the force of an impact, but that was a technique only a veteran warrior could use.</p><br/><p>The two of them stepped forward, and their swords collided with each other.</p><br/><p>Their back and forth was too fast for Neia’s eyes to follow. The only things she could clearly see were the brief moments when their blades hit each other and froze in place.</p><br/><p>If Neia joined this battle, she would surely be hacked to death.</p><br/><p>Steel clashed with steel at high speeds, and the ear-piercing sound of metal echoed all around.</p><br/><p>Both of them had equivalent arm-strength, so when they crossed blades, their attacks and defenses took place simultaneously.</p><br/><p>Should she be impressed by how Buser could swing such a heavy blade with one hand, or show respect to the Sorcerer King for wielding a two-handed sword while being a magic caster?</p><br/><p>This was a super high level battle of the sort she had never seen before, and Neia was certain that she could not possibly interfere.</p><br/><p>In order not to get in the way of their fight, Neia slowly shifted behind a piece of cover and hid herself.</p><br/><p>They’re swinging at each other like that, but neither of them is hurt… speaking of which, the Sorcerer King seems a little too strong…</p><br/><p>Neia’s brain could no longer keep up with a magic caster who could fight with a sword to this extent.</p><br/><p>Did he use some kind of amazing spell?</p><br/><p>All Neia could do was attribute it to some form of incredibly magic she had never heard of before.</p><br/><p>Even so—</p><br/><p>If this keeps up, there’s no doubt that the Sorcerer King will win. No, was he planning to draw out the battle because of that?</p><br/><p>The undead did not feel fatigue and they would not be shaken in combat. All of these were unfavorable to Buser.</p><br/><p>Buser seemed to realise this, because his face started to contort.</p><br/><p>If he has some sort of trump card—</p><br/><p>Neia was shocked. The Sorcerer King had suddenly thrown his huge sword at Buser.</p><br/><p>After that, a hemisphere of light appeared around Buser and blocked the thrown sword.</p><br/><p>The bubble of light vanished, and the thrown sword had only slightly scratched Buser.</p><br/><p>This is bad!</p><br/><p>Neia prepared to rush out from behind her cover. The Sorcerer King was unarmed now—</p><br/><p>“—Huh?”</p><br/><p>At some point, a jet-black halberd had ended up in the Sorcerer King’s hands.</p><br/><p>Buser must have felt the same way as Neia. His eyes were as wide as saucers.</p><br/><p>“You didn’t incant a spell, how did you do it… And where did that sword you threw go to…”</p><br/><p>“I simply cast a silent spell. Don’t worry about it… All right, my subordinate taught me this, but I’m not very confident in my skills. I apologize in advance if I end up fumbling around.”</p><br/><p>The Sorcerer King readied his halberd. He radiated a strange sense of oppression.</p><br/><p>Warriors often favored weapons within the same broad classes. Swords, axes, maces, that sort of thing.</p><br/><p>The Sorcerer King used momentum to swing his halberd. He attacked Buser’s feet — which were hard to defend — with a sweeping motion. This was a technique one could only perform with a long-shafted weapon.</p><br/><p>Just as Buser brought his sword low to try and block the attack, the halberd suddenly jumped up.</p><br/><p>It was a feint.</p><br/><p>This was a move that would require considerable arm-strength to perform, but Buser raised his sword to block it in an instant.</p><br/><p>As expected, the Sorcerer King favored the sword, and he did not seem very skilled with the halberd. While he could elegantly execute textbook attacks, there seemed to be something strangely off about his attacks, and even Neia could spot it with her eyes.</p><br/><p>After blocking the halberd’s momentum, Buser leapt back.</p><br/><p>“「Sandstorm」!”</p><br/><p>The sand particles from within the sword spread out like a wall, rushing towards the Sorcerer King. It had probably obscured the Sorcerer King’s vision completely.</p><br/><p>While she doubted if the Sorcerer King had eyeballs, having one’s vision completely obscured blocked was a tremendous disadvantage.</p><br/><p>“「Essence Seal」!「Grand Power Strike」!”</p><br/><p>One was a martial art Neia had not heard of before, while the other was an advanced technique, a powerful strike that would inflict additional damage. After using both of them, Buser charged out, faster than before.</p><br/><p>Buser’s horn decorations glowed with a bizarre light, and he looked like a shooting star.</p><br/><p>“Yeeeeeeaaart!”</p><br/><p>“Hmph!”</p><br/><p>The Sorcerer King caught the blow on his halberd—</p><br/><p>“Haha!”</p><br/><p>—And Buser laughed.</p><br/><p>The sound of metal being ground away rang forth.</p><br/><p>Neia’s eyes went wide.</p><br/><p>“Could it be! A sunder attack!”</p><br/><p>Sunder attacks directly damaged a foe’s weapons, but the amount of damage done was greatly affected by the composition of both weapons and their damage potential. Buser’s martial arts were probably intended to strengthen these two attributes.</p><br/><p>Neia began to panic, but in the next moment, she froze as she saw Buser staring with wide eyes.</p><br/><p>“It’s unharmed!”</p><br/><p>Buser cried out in shock.</p><br/><p>“What the hell is that weapon!?”</p><br/><p>As Buser scrambled back, his expression completely changed and with no intention of pressing the attack, the Sorcerer King spun his halberd, tracing a beautiful arc in the air.</p><br/><p>“… Well. I did make this weapon with my magic, you know? How could it be so easily broken?”</p><br/><p>“But weapons made by magic are fragile, right?”</p><br/><p>“Oh, it seems you’ve had experience fighting opponents with magically-created weapons, but it’s dangerous to be bound by such a fixed worldview, no? In other words, there might be opponents who can make weapons which you can’t break.”</p><br/><p>The Sorcerer King let go of his halberd. The halberd then vanished, as though it had melted into the air. The same thing must have happened with the greatsword from just now.</p><br/><p>After that, the Sorcerer King made a grasping motion, and now he had a black longsword in each of his hands.</p><br/><p>“…Now then, what will you do? Don’t tell me that attack was your winning strategy? Can you help me gain more experience?”</p><br/><p>The Sorcerer King took a step forward, shortening the distance between them,</p><br/><p>“…If you’ve got any more trump cards, it’d be better if you hurried up and used them, no? I’m not kind enough to let a useless enemy live.”</p><br/><p>“Fu, fufu! What are you saying, undead one!? Indeed, I’m very impressed by how you managed to fully defend against my attack. Very well done. However, wasn’t that because you were focused on defense? …I know you won’t get tired, so you feel that you can beat me if you grind me down.”</p><br/><p>He saw through it!</p><br/><p>Neia felt nervous again. Even she had noticed it. Buser, a far better warrior than herself, could not have failed to notice that.</p><br/><p>“I see. So that was what you thought. Indeed, you would be correct to think so. But unfortunately, that was not the case.”</p><br/><p>The Sorcerer King spread his arms and approached. The swords in his hands vanished like smoke.</p><br/><p>“Watch—”</p><br/><p>Buser had already stabbed that unprotected body faster than Neia could shout.</p><br/><p>And then—</p><br/><p>“…What?”</p><br/><p>Buser frantically, repeatedly swung his sword.</p><br/><p>“Why! Why!! What is this!?”</p><br/><p>He shouted with every swing he took. That was because the Sorcerer King was unharmed despite taking every blow.</p><br/><p>“In that case—”</p><br/><p>Buser braced his shield and used a martial art. Yet, the Sorcerer King remained unmoved despite taking a shield bash.</p><br/><p>Instead, it was Buser who stumbled back.</p><br/><p>“Why… wh-why…”</p><br/><p>Humans had a hard time reading demihuman expressions, but right now it was very easy.</p><br/><p>His face now showed terror and despair.</p><br/><p>“…Martial arts are an unknown technique to me. Did martial arts derive from skills, or are they a warrior’s magic? Even until now, I still don’t know. Still, don’t you feel that when fighting an opponent of equal ability, victory might be decided by experience and knowledge of martial arts? That’s why I will take your attacks head-on. However… You’ve shown them all to me, haven’t you?”</p><br/><p>The Sorcerer King shrugged in an exaggerated fashion, and at the same time he plucked one of the nine rings he wore from its finger.</p><br/><p>He did nothing else. That was the only move the Sorcerer King had made. However — a wave of unnaturally frightening and cold air filled the surroundings.</p><br/><p>Neia hurriedly looked to the sky. She had almost thought that the sun in the sky had frozen and shattered. However, the sun was still there, shedding its radiance.</p><br/><p>—Then could this frigid and jet-black emanation be something released by the Sorcerer King? Could a single individual do something like this?</p><br/><p>This, this is the Sorcerer King. This is the true form of the magic caster who slew an army of tens of thousands…</p><br/><p>“And now it seems — there is no longer any need to fight you.”</p><br/><p>He stepped leisurely towards Buser.</p><br/><p>Buser, on the other hand, took a trembling step back. It was like he was being pushed away by an invisible pressure radiating from the Sorcerer King.</p><br/><p>Buser could feel that abnormal presence more keenly than Neia. He clearly understood the fact that the Sorcerer King was not an opponent he could fight. The way his fur stood on end proved that.</p><br/><p>“Wait, hang on. No, wait a second. I’m begging you, just wait a bit!”</p><br/><p>Buser raised his right hand and let the sword he was holding fall to the ground.</p><br/><p>“Sur-Surrender. I surrender.”</p><br/><p>“Hm.”</p><br/><p>“I have news about Jaldabaoth. How about it? That should be very useful, right? It’ll definitely be useful.”</p><br/><p>“I see.”</p><br/><p>“…Also, there’s more. You want to fight Jaldabaoth, right? I’m much stronger than human beings. I can arrange to bring my tribe along to help you fight Jaldabaoth — that piece of shit Jaldabaoth. We’ll go in first. How about that?”</p><br/><p>“Oh.”</p><br/><p>“…Wait, please wait! That’s not all! If you want, I can give you part — no, all of my collected treasure! That ought to be enough for my life, right?”</p><br/><p>“Is that all? Are you done making your pitch?”</p><br/><p>“Oh, wah, eh,” Buser frantically looked around, and then looked at the Sorcerer King once more. “Yes, yes. No, that’s not it. I, I have more, much more besides that. I can help you get whatever you want — no. I’ll definitely get it for you! Really! Please believe me!”</p><br/><p>“Mm. What I really want is something you will never be able to obtain.”</p><br/><p>Neia sensed the irritation in the Sorcerer King’s tone. Naturally, Buser, as the one confronting him, must have felt it even more strongly.</p><br/><p>“Wait, wait-wait, wait a minute. Seriously, wait a bit. Aw, heh, heheheh.”</p><br/><p>He was laughing like a servile minion. The kingly attitude he had demonstrated when he had faced them at the plaza was nowhere to be seen.</p><br/><p>“I’m sorry if I said the wrong thing. No, I apologize. Really. It was my fault. Really.”</p><br/><p>“Hm…”</p><br/><p>“Then, then, how, about it? I, I, this one feels, this one can be useful to you. Hehe. Ah, how stupid I was to make an enemy of the great undead king. Therefore, if you would give me a chance to make up for that mistake, I would.. hehe, you won’t regret it!”</p><br/><p>Buser got on both knees and clasped his hands as he begging for mercy.</p><br/><p>What a pathetic pose that was. Yet Neia did not think that way at all. No, she had already accepted that this was the proper action an enemy ought to be taking when faced with the true form of the Sorcerer King. At the same time, she vividly recalled the words of that Naga they had met in the Sorcerous Kingdom: “A wise man would immediately throw himself at his feet and beg for mercy.”</p><br/><p>In that case, the fate of those who did not kneel right away was—</p><br/><p>“I see… well, I like those who understand they were wrong and work hard to correct their mistakes.”</p><br/><p>“That, that means!”</p><br/><p>Buser’s face lit up with joy. However, that joy was snatched away in an instant.</p><br/><p>“—However, if I let you become one of my subordinates — Pestonya and Nigredo would not be happy. Also, be at ease. I will not do anything wasteful like only using the skull. I’ll make full use of every part of you.”</p><br/><p>Now die, the Sorcerer King said as he erected a slender fingerbone.</p><br/><p>“Aiiiieee! No, no, nooooo! I don’t want to die!! Wait!! I’m begging you!!! Please, I’m begging you!!! I, I still, I still have some value!!!! — I’m useful enough to make you happy!!!! Really!!!!! Believe me!!!!!”</p><br/><p>“All things which live must die. The difference is in how soon or late they meet their fate.”</p><br/><p>“No!!!!! Don’t look at me that way!!!!! Don’t, don’t kill me!!!!!”</p><br/><p>Buser rose to his feet, then turned around and ran.</p><br/><p>Neia stared, dumbfounded at how fast a living creature could run when its demise was at hand.</p><br/><p>However, the Sorcerer King’s spell was faster still.</p><br/><p>“How boring. — 「Death」.”</p><br/><p>Nothing happened. There was no big explosion, no cataract of roaring lightning.</p><br/><p>Buser simply fell to his knees and keeled over.</p><br/><p>That was all.</p><br/><p>“Well, it’s a shame about the information… well, that’s how it is. Do you object, Ms. Baraja?”</p><br/><p>“Eh, no, not at all, Your Majesty’s decisions are flawless.”</p><br/><p>“Really? Well then… go find the paladins. Tell them I’ve taken care of the demihumans’ leader. Although… this is kind of bad…”</p><br/><p>Part 4</p><br/><p>Both retaking the city and freeing its citizens were trivial before the power of the Sorcerer King.</p><br/><p>The attacking paladins and militiamen were virtually unhurt, and while some of the imprisoned residents had lost their lives in the chaos, it was a shockingly small amount.</p><br/><p>This outcome was only possible due to the Sorcerer King’s presence, to the point where some people thought, If only we had handed everything to him from the start, we might not have needed to lose anyone.</p><br/><p>Everyone was smiling as Neia and the Sorcerer King walked down the street, whether they were rejoicing over being freed or shedding tears over a bowl of hot soup.</p><br/><p>Although they had been told that their freedom was thanks to the Sorcerer King’s aid, once they saw the Sorcerer King moving around in person, the residents’ eyes were filled with shock, confusion and aversion, but that could not be helped either.</p><br/><p>Of course, whether Neia could accept this state of affairs was a different matter entirely. While she wanted to do something in case the Sorcerer King was displeased, it would seem the man himself did not seem to mind. That being the case, it would be very rude of Neia to do something on her own.</p><br/><p>Neia addressed the back of the Sorcerer King, who was walking in front of her.</p><br/><p>“Your Majesty, where are you going now?”</p><br/><p>The Sorcerer King was looking at his palm, and he did not look back at Neia.</p><br/><p>“Umu. I’m heading for this big building in the center of town. If that’s an enemy base, I’ll need to investigate it as soon as possible. The paladins are all tied up with tasks like freeing the captured residents, distributing food, treating the wounded, imprisoning the captured demihumans, and other things.”</p><br/><p>Neia nodded slightly.</p><br/><p>“That building is quite large. If the paladins judged it to be a base, shouldn’t they have already investigated it?”</p><br/><p>While the Sorcerer King was the one who had conquered the city, the minor assorted tasks after that had been given to the citizen-soldiers and the paladins to complete. In that case, surely they would have inspected the building that was the Sorcerer King’s objective.</p><br/><p>The Sorcerer King stopped walking for a moment and then looked intently at Neia. Then he shrugged and continued walking.</p><br/><p>“Ah, umu. Actually, I posted my subordinates outside to make sure the paladins did not draw near. So I doubt they’ve checked it yet.”</p><br/><p>“Eh? Then what you said earlier—”</p><br/><p>“—Ms. Baraja. I have told you many things until now, but it would be best if you considered matters on your own from time to time. For instance, the reason why we are the ones who are going to investigate the building.”</p><br/><p>“Ah! Yes, Your Majesty!”</p><br/><p>The Sorcerer King looked at his palm again. Within it was an item once worn by that demihuman — the late Buser. The Sorcerer King was appraising the item as he walked, using the power of magic to carefully examine it.</p><br/><p>From what the Sorcerer King said, the sword was called Sand Shooter, the armor was known as Turtle Shell, the shield was named Lancer’s Merit, the horn coverings were called Charge Without Hesitation, the rings were Ring of Second Eye and Ring of Running, while the cape was called the Mantle of Protection.</p><br/><p>There also seemed to be other magic items like the necklace and such. Although he said none of them possessed any impressive enchantments, the Sorcerer King still seemed quite happy about them.</p><br/><p>Neia shifted her eyes from the Sorcerer King’s back to the ground, and then she did as the Sorcerer King said, which was to ponder the reason why the Sorcerer King had to personally investigate that building. However, she did not reach any answer which made her think, That’s it!</p><br/><p>However, if she asked the Sorcerer King for the answer because of that, surely he would be speechless. The thought of the Sorcerer King she so respected thinking of her as useless and casting her aside was terrifying.</p><br/><p>While she desperately tried to find the answer, the aforementioned building had already appeared before her eyes.</p><br/><p>Two undead beings — High Wraiths — stood at the entrance to the building.</p><br/><p>As the Sorcerer King approached, they stepped aside to allow the Sorcerer King and Neia to pass.</p><br/><p>“This… seems to be the residence of the city’s former lord.”</p><br/><p>Neia was not too sure which noble had ruled this city. However, given the size of the city, he must have been more than a baron, but less than a count.</p><br/><p>“Yes. Not even the undead have entered this place. We are the first to do so. Be careful. There might be more demihumans who have not yet been subdued.”</p><br/><p>“Eh!? Your Majesty! Then—”</p><br/><p>She hesitated over whether she should say “You should stop,” but the other Neia in her quietly said that it ought to be fine if it were the Sorcerer King.</p><br/><p>“I have to go here. This is the enemy headquarters, and it might be the lair of the demihumans’ leader. While the only reason for that conclusion is because this building is very large — there might be a powerful being on par with Buser ahead of us. I want to neatly tie off all the loose ends in this city.”</p><br/><p>“Ah!”</p><br/><p>After learning the answer to the question from just now, Neia suddenly pressed her head in realization. At the same time, gratitude flowed forth in her heart for the Sorcerer King’s compassion.</p><br/><p>He didn’t let the paladins get close because there might be powerful foes within! Unlike what he said just now, could it be that he wasn’t willing to tell me about this because he felt embarrassed about fighting as someone else’s shield?”</p><br/><p>While Neia knew that thinking this way about the Sorcerer King was very rude, for some reason she felt the Sorcerer King was a little cute.</p><br/><p>“…Well? Do you understand?”</p><br/><p>The Sorcerer King looked at Neia’s face as he asked that question. Neia nodded, and the Sorcerer King seemed happy as he replied, “Ah, that’s good.”</p><br/><p>He’s actually happy that I can understand him… what a gentle and kind person he is.</p><br/><p>“Your servant understands why Your Majesty does not wish to draw attention from others!”</p><br/><p>“…Hm? Ah… exactly. Then… you understand, right? I don’t wish to stand out too much.”</p><br/><p>“Understood!”</p><br/><p>The Sorcerer King looked like he was pondering something. For some reason that also looked very adorable.</p><br/><p>“…Ah— let’s go then.”</p><br/><p>“Yes!”</p><br/><p>As a squire, she felt it was wrong to let the Sorcerer King walk out in front, but the Sorcerer King would not allow Neia to walk ahead of him. Neia looked with admiration at the back of the generous and magnanimous person before her. As his subordinate, watching a king lead from the front was truly a heart-warming sight.</p><br/><p>After passing through the wide entrance, Neia asked a question.</p><br/><p>“Where shall we begin our search? There doesn’t seem to be any sign of others around…”</p><br/><p>“Mm… your eyesight and hearing are both quite keen, Ms. Baraja, but how about your sense of smell?”</p><br/><p>“Frankly speaking, I’m not too confident in my sense of smell. However, I think I’m better than most in that field. As for taste, I think mine is just average. However, I’ve never tasted poison before, so I can’t be a poison-taster or anything…”</p><br/><p>“Really now? Then, can you detect the smell of death and hatred?”</p><br/><p>As he said “death and hatred,” his kingly aura of dominion coiled up around him.</p><br/><p>“Death and hatred?”</p><br/><p>“—This way.”</p><br/><p>The Sorcerer King set off. There was no trace of hesitation in his footsteps. He walked as though he was familiar with this place and what lay ahead of him.</p><br/><p>Death and hatred… these things shouldn’t have a smell… or could it be that His Majesty, who is undead, can make out such smells? That means whoever’s making that smell is waiting here!</p><br/><p>Neia clutched the bow she had borrowed from the Sorcerer King. Depending on the circumstances, she would have to serve as the Sorcerer King’s shield and step forward to fire her bow. Yet she had not been able to do anything during the battle with Buser. If she did not make herself more useful, there would be no reason for her to be here.</p><br/><p>They did not encounter any demihumans along the way, and before long, they came to a door that was about the same size as the one they had passed through earlier. It was made of steel, and iron, and thus looked very sturdy.</p><br/><p>This was what looked like a prison door, in the middle of a regular noble’s residence. The juxtaposition filled Neia with a powerful sense of foreboding. It felt like she had been thrown into an unfamiliar and spine-chilling place.</p><br/><p>“This is…”</p><br/><p>“It’s inside here… you can stay outside if you want, you know?”</p><br/><p>It was impossible for Neia to make that choice. After seeing Neia shake her head, the Sorcerer King shrugged and opened the door.</p><br/><p>The Sorcerer King’s strength opened the iron door with ease. However, it was surprisingly thick, so it must have been specially made.</p><br/><p>The Sorcerer King entered the room.</p><br/><p>Oh no! I can’t believe I actually let His Majesty walk into this unknown place first! I’m an idiot!</p><br/><p>Neia hurriedly entered the room as well.</p><br/><p>While the heavy door had given her some inkling of what to expect, the interior of the room felt strange. It gave her the impression of being a torture chamber — although she had only heard descriptions of those.</p><br/><p>For starters, there were no windows.</p><br/><p>There were sticks set into the wall which glowed with a faint red light. This was not a natural light, but created by magic</p><br/><p>There was a table made of wood and two wooden chairs. Further inside was another door, also made of iron.</p><br/><p>The Sorcerer King stood in the center of the room, carefully surveying every corner of it. This was when Neia noticed something on the table.</p><br/><p>“…Your Majesty. This looks like a piece of paper, but what’s that written on it?”</p><br/><p>The piece of paper Neia picked up was covered in illegible characters. They were certainly not written in Holy Kingdom script.</p><br/><p>“Hm… they seem to be written in words from the demonic language.”</p><br/><p>The Sorcerer King took out a monocle from a pocket. Perhaps he had noticed the surprised look on Neia’s face, because he then proceeded to explain it.</p><br/><p>“This is a magic item that can decipher written languages. That said, it drains a vast amount of mana. —Ms. Baraja, do you know of any humans who can decipher these characters?”</p><br/><p>“WIth the ability to comprehend languages?”</p><br/><p>“Indeed. Or at least, someone who knows what these letters are. Also… any humans who have a talent which lets them decipher languages.”</p><br/><p>“My deepest apologies, I don’t know about…”</p><br/><p>Neia was simply a squire for the Paladin Order. She had not had the chance to come into contact with news about people like those.</p><br/><p>Granted, she had heard some rumors from her squire friends. For instance, “My friend has a talent that lets him know many degrees hot water is. Of course, nobody knows the exact temperature,” or “My relative’s a boat pilot who can walk five steps on water, but more than that and he’ll sink,” and so on. Most of them were abilities which would make people sigh and fall silent. There was no information about people who possessed abilities which the Sorcerer King wanted to know about.</p><br/><p>“Really now? What a shame. Do you think Captain Custodio would know?”</p><br/><p>Surely the Captain of the Paladin Order would have come into contact with all sorts of intelligence. However, Neia did not know what to think of Remedios. Would the Captain really allocate her headspace to information?</p><br/><p>“…I am not sure about that either. However, I feel it would be better to ask the Vice-Captain.”</p><br/><p>‘Well, that’s true. If I ask him…”</p><br/><p>The Sorcerer King was probably stumbling over his words for the same reason Neia had.</p><br/><p>“However, what do you intend to do if such a person does not exist?’</p><br/><p>“Hm? Ah, I did not intend anything. But if there was someone who could decipher the intelligence Jaldabaoth left behind, our future plans would change, no?”</p><br/><p>This was an obvious question which she could have answered on her own if she had just thought a little, yet she needed the Sorcerer King to explain it to her. Neia was ashamed about asking such a foolish question without giving it any thought.</p><br/><p>“If there’s nobody who can translate this, then I’ll just have to expend mana to decipher it. However, doing so would lead to a disadvantageous state where I would have to be more wary of Jaldabaoth. If I encountered Jaldabaoth after expending a great deal of mana, my only option would be to flee… although, this makes me quite curious. If it’s just one piece of paper, then I shall read it.”</p><br/><p>“Will it be all right?”</p><br/><p>“Yes. I just need to pay more attention to my mana reserves.”</p><br/><p>The Sorcerer King put on his monocle and looked at the paper. Although there were no visible signs of activation, it ought to have taken effect. The Sorcerer King looked like he was deciphering it now. That said, the Sorcerer King had no eyes, so it simply looked like he was reading it.</p><br/><p>After a short while, he took of the monocle.</p><br/><p>“It was a lot of mana after all.”</p><br/><p>Neia had seen priests wobble around shakily after using a great deal of mana, but she saw no signs of that in the Sorcerer King. However, comparing the Sorcerer King to an average magic caster was the height of rudeness. It was probably because he had enormous stores of mana.</p><br/><p>As Neia contemplated this, the Sorcerer King approached the door further within and gently slid open the vision slit.</p><br/><p>Neia heard many weak breathing sounds from inside, and her nose picked up the scent of blood.</p><br/><p>She gripped her bow tightly, thinking to squeeze between the Sorcerer King and the door, but the Sorcerer King stopped her with his hand.</p><br/><p>It meant Don’t come here.</p><br/><p>“Mm… Ms. Baraja. The people using this room were not demihumans, but demons. The reason why I say that is because this paper contains details on the experiments the demons were performing.”</p><br/><p>“…The demons’ experiments?”</p><br/><p>Even without further explanation, she was sure that these experiments were not decent or proper by any means.</p><br/><p>“Yes. They seemed to have done things like chopping arms off and then reattaching them to other creatures, or cutting open the subjects’ abdomens and exchanging the internal organs within. They started with blood relatives as a control group, and they branched out to combinations of humans and other lifeforms — not just demihumans, but animals too — and then they healed them with magic to see what changes occurred.”</p><br/><p>“What dreadful experiments! Especially that blood relatives and body swapping stuff, how could any sane person think of such things?”</p><br/><p>“…All right. After conducting these experiments, it’s natural that they’d want their test subjects to live. In particular, they want to keep them alive as long as possible until they find out why they die.”</p><br/><p>Saying so, the Sorcerer King turned around, his back to the door. Then, he indicated the door behind him over his shoulder with his thumb. For some reason, Neia knew what was coming next.</p><br/><p>“Some of those test subjects are in there. They’re still alive despite having their bellies cut open.”</p><br/><p>She had anticipated this, but the cruel reality still dyed Neia’s mind stark white for an instant. After that, she burned with hatred for the demons who had conducted such inhumane experiments.</p><br/><p>“Ms. Baraja! Get the priests right away! Fetch Captain Custodio too! Hurry!”</p><br/><p>“Understood!”</p><br/><p>There was no need to question the reason why they had to be called over. Neia ran with all her might.</p><br/><p>In the corner of her mind, she heard a voice ask, Is it really all right to leave His Majesty here by himself? but this was an order from a powerful man who was both trustworthy and wise. There was no need to worry. He would not be wrong. The voice vanished in an instant.</p><br/><p>♦ ♦ ♦</p><br/><p>The priests opened the door and entered the room. The way their shoulders trembled for an instant illustrated the hideous conditions inside the cells better than words ever could.</p><br/><p>In front of her, the Sorcerer King showed the paper to Remedios and Gustavo.</p><br/><p>“Have a look at this. This paper contains the names of the people in there and what happened to them. In addition, there are other papers with similar things written on them, or perhaps other things — Jaldabaoth’s plans, for instance. I’m not too sure about that. Can you understand what’s written on this paper?”</p><br/><p>Remedios looked at the paper and wrinkled her brows, then immediately handed it to Gustavo.</p><br/><p>Gustavo shook his head too.</p><br/><p>“I have no idea. But you understand it, don’t you, Your Majesty?”</p><br/><p>“Ah, yes, by using the power of this magic item. However, that item drains a tremendous amount of mana. That mana must be conserved for the sake of doing battle with Jaldabaoth. And what I want to know is, do any of you know anyone who can read these characters? Anyone who might have the chance of understanding it will do.”</p><br/><p>“No, I have no leads at all. While I feel there might be someone like them among the southern nobles… I think the possibility of that is very low.”</p><br/><p>“I see… then how will you deal with this? On my part, I would hope you would put more effort into trying to decipher their script.”</p><br/><p>“Can we not borrow Your Majesty’s magic item?”</p><br/><p>“I refuse. This is a treasure of my nation. It is just as how you would not easily loan out the holy sword at your waist. And to magic casters like myself, magic items like these are more valuable than swords.”</p><br/><p>Remedios and Gustavo looked at each other once more.</p><br/><p>“I understand. Then let us work hard together. Also — we have a new problem. It would seem there are Orc captives. How shall they be dealt with?”</p><br/><p>It would seem the Orcs had not attacked the Holy Kingdom out of their own will, but they were brought over by Jaldabaoth. They had not yielded any useful information when questioned, and the Paladin Order was at a loss as to how to deal with them.</p><br/><p>“Mm… I understand. Can you tell me where they are? Can you leave them to me?”</p><br/><p>“Yes. Thank you for your trouble.”</p><br/><p>Gustavo supplied a rough location. Since the city was not very big, they would probably not get lost.</p><br/><p>After sketching a rough map in her mind, the cell door opened and an utterly exhausted-looking priest showed up.</p><br/><p>“Ohhh! What happened!? What about the condition of the people inside?”</p><br/><p>“We started by using healing magic on the survivors. This is the first time we’ve tried to heal the subjects of such inhumane experiments, so we’ll stay here and observe them. If they’re fine, we’ll move them outside. At least, that’s what I think.”</p><br/><p>“I see. Then, we’ll send some paladins and militiamen over to help you move these people out.”</p><br/><p>“Understood, Captain Custodio. Then, I’ll take my leave, Your Majesty.”</p><br/><p>The priest opened the door again and went back into the cell.</p><br/><p>After watching the priest leave and concluding that there was nothing left to do, the four of them each went to their respective destinations.</p><br/><p>Naturally, the Sorcerer King and Neia parted ways with the other two and headed for the location of the Orcs.</p><br/><p>“That said, since there are demons around, it would be good if we had someone who could see the original forms of shapeshifters,” the Sorcerer King said as he walked.</p><br/><p>While they could not verify the presence of demons in this city, the piece of paper with demonic characters on it suggested the possibility that there might be demons about, or that there might have been demons here recently.</p><br/><p>“Can demons transform themselves?”</p><br/><p>“Ahh, demons like that do exist. They can shapeshift into men, women, or even animals.”</p><br/><p>“I see… Someone with the ability to see through shapeshifting — or a similar talent. My deepest apologies. I have not heard of anyone with these abilities. Ah, no, I’ve heard legends about such things. I remember reading about them in a book. However, if you asked me if there were any of them around now…”</p><br/><p>“…It seems I would be best served discussing this matter again with Captain Custodio, then.”</p><br/><p>“Is shapeshifting a form of illusion? I’m more familiar with petty tricks like illusions.”</p><br/><p>“For starters, shapeshifting is vastly different from illusions, but explaining that will take a long time so I’ll skip it for now. However, looking down on illusions is very dangerous, you know? Illusions are a fearsome type of spell that become scarier the more skilled the caster is. Also, there are those illusionists who aren’t satisfied with a surface understanding and choose to specialize along that path.”</p><br/><p>“So it’s when they specialize?”</p><br/><p>“Ahh, yes. For example, there are spells like 「Perfect Illusion」 which can defy all five senses. And beyond that, there are those who have refined their illusions to the utmost limit, who can use a certain skill once every few days to deceive the world itself.”</p><br/><p>An illusion that could deceive a world was beyond her capacity to imagine.</p><br/><p>“Ah, how exactly does that worldly illusion work?”</p><br/><p>“From what I know, it’s a spell that lets you rewrite any aspect of the world, I think. Well, simply put, using an illusion like that could even bring the dead back to life?”</p><br/><p>“Eh!? You’re talking about an illusion, right?”</p><br/><p>“Oh yes. An illusion which tricks the world — the ultimate secret of illusions. By deceiving the world itself, an illusion can be made real.”</p><br/><p>All she could think was Wahhh~ Even if one said that the pinnacle of illusion could do such a thing, it was so incredible that she did not quite understand what he was saying.</p><br/><p>“So, does nobody manage the inborn talents of this country?”</p><br/><p>“No, I’ve never heard of it before. Does the Sorcerous Kingdom do such things?”</p><br/><p>“My country does not have that practice either. I plan to do so in the future, but that will require considerable effort… it might end up being a matter of ten or more years in the future.”</p><br/><p>The Sorcerer King had already envisioned the events of the next ten years in his mind. This was the difference between a king and a commoner.</p><br/><p>In other words, a tremendous difference.</p><br/><p>♦ ♦ ♦</p><br/><p>The Orcs were held in a building whose windows were boarded up from the outside. This was quite a big structure, probably the second or third largest in this city.</p><br/><p>There were many paladins gathered at the entrance. It would seem they were on guard against what was inside.</p><br/><p>After seeing the Sorcerer King approach, the paladins genuflected before him to express their respect.</p><br/><p>“I’ve heard from Captain Custodio that the Orcs are in this building. May I enter?”</p><br/><p>“Yes! Of course you may, Your Majesty!”</p><br/><p>“Then you should go from this place and return to what you should be doing.”</p><br/><p>The paladins looked up.</p><br/><p>“But the Captain ordered us to be stationed here. We may not leave our posts.”</p><br/><p>“…Did she now? Then I take back my previous words.”</p><br/><p>Saying so, the Sorcerer King passed between the paladins and pushed open the door. Naturally, Neia was following him.</p><br/><p>There was a sour odor in the air which seared Neia’s nose. This was not poison gas, but the smell reminded Neia of when she had once followed a paladin to a jail. In addition, there were other smells mixed into it — smells that made her want to throw up.</p><br/><p>“This is…”</p><br/><p>When she heard the Captain mention it earlier, she had thought about why the Orcs had been specially brought along.</p><br/><p>Neia knew that she was about to learn the truth, but at the same time she deployed the wings of her imagination. If this was not just a problem that the Orcs faced, if there was a grand alliance against Jaldabaoth, would the demihumans who wanted to fight back against him rally to their banner?</p><br/><p>As Neia thought all this, the Sorcerer King kept pushing doors open as he advanced. One could say that letting the Sorcerer King go first was a matter of fact now.</p><br/><p>They crossed rooms and passed through corridors.</p><br/><p>Just by walking, she realized that this place was filthier than a jail.</p><br/><p>The place was filthy with blood, vomit, and other detritus. The conditions here were so terrible that there was no way to imagine what had happened here.</p><br/><p>Orcs were demihumans around the height of a man, with porcine facial features. They were said to be a species that loved cleanliness. They would not be happy to live in such a place.</p><br/><p>(TL Note: The pigman depiction of orcs apparently derives from Ludovico Ariosto’s Orlando Furioso, where they had piggish features. Other depictions include the original corrupted-elf Uruks by Tolkien and the Warhammer greenskins. It seems Maruyama has decided to make them full-on pig beastmen. No, this is not a translation of the CN TL note below.)</p><br/><p>Neia watched the hem of the Sorcerer King’s cloak. While she was worried about how his magnificent garments might be stained, she could not tell him to wait outside either. After all, nobody could possibly speak for the wise Sorcerer King.</p><br/><p>Soon, Neia’s keen senses picked up traces of many creatures breathing and moving ahead of them. There was also what sounded like crying children and mothers trying to comfort them.</p><br/><p>Orcs…? Not humans?</p><br/><p>Neia was confused. She had never considered the possibility that Orcs might have families and raised children. The Orcs who came to the Holy Kingdom were invaders. They were hated enemies. Therefore, she had stopped thinking about them in any other sense.</p><br/><p>As Neia sank into confusion, the Sorcerer King opened the door.</p><br/><p>The vile odor intensified, and there were several screams.</p><br/><p>“The undead!”</p><br/><p>“It’s a Skeleton! Why!?”</p><br/><p>“Those bastard humans! They sold us to the undead!”</p><br/><p>“They’re actually using the undead! Those filthy humans!”</p><br/><p>“Mama—! Save me—!”</p><br/><p>“My boy—!!!”</p><br/><p>The Sorcerer King stopped at the entrance. As expected, even the Sorcerer King was puzzled by this.</p><br/><p>“Ah — ahem! Silence!”</p><br/><p>After the Sorcerer King bellowed his order, the noisy room fell silent. Of course, that was only for a moment. It immediately filled back up with a racket that was several times louder than before. They were wailing about roughly the same things. No, there seemed to be more voices bemoaning their fate and begging for mercy for their children, regardless of what happened to themselves.</p><br/><p>“…Haaah.”</p><br/><p>The Sorcerer King sighed, as though he were tired. After that — he slammed on the door. His bony white hands possessed incredible power, and the door bounced away, swinging out until it struck the wall with an incredible sound. The demihumans fell silent immediately.</p><br/><p>“Shut up. The next one of you who speaks without permission had better be ready to die.”</p><br/><p>The Sorcerer King took a step into a room that seemed to have been frozen in silence — with some parents trying desperately to cover their children’s mouths — and the demihumans all retreated from him.</p><br/><p>“I did not come here to kill you. On the contrary, I am here to save you.”</p><br/><p>Usually, Neia the human would have a lot of difficulty trying to read the face of a demihuman such as an Orc. However, just this once, Neia was absolutely confident in herself.</p><br/><p>Every single one of them was going No way.</p><br/><p>“Explaining to everyone at once is troublesome. Send out a representative.”</p><br/><p>A moment later, an Orc looked like he was about to rise, but the Orc beside him stopped him. However, he still took a step forward.</p><br/><p>He may have been a skinny Orc, but he had clearly possessed a strong body once.</p><br/><p>“…May I assume that you are the representative?”</p><br/><p>The Orc said nothing and simply nodded.</p><br/><p>“…What’s wrong? Why do you not speak?”</p><br/><p>“Ah, perhaps it is because Your Majesty ordered them to shut up just now?”</p><br/><p>“While I felt that I had given my permission, it would seem nobody understood it that way. You, the Orc who has stepped forward, I permit you to speak. Begin by stating your name.”</p><br/><p>“I am Dyel of the Gan Zu tribe — Dyel Gan Zu.”</p><br/><p>“Dyel, then. Here is my first question. Are there people here you do not know, or whose personalities have changed drastically?”</p><br/><p>“No, no, there’s nobody like that.”</p><br/><p>“Next, tell me why you were imprisoned here.”</p><br/><p>“…You know that demon called Jaldabaoth, right?”</p><br/><p>“Of course I do. He is my enemy. Rather, you could say I came here — to the Holy Kingdom — in order to kill him.”</p><br/><p>Their faces still said No way, as expected. Indeed, Neia might have thought the same way before she had come to understand the Sorcerer King. However, Neia was different now.</p><br/><p>Neia looked at the Sorcerer King’s profile, and then she spoke.</p><br/><p>“It is as His Majesty says. I am a person of this country. In that case, you should be able to understand, right? Jaldabaoth led an allied army of demihumans to invade the Holy Kingdom.”</p><br/><p>Dyel’s face changed slightly.</p><br/><p>“Wait, a human — probably, a female.”</p><br/><p>What did they mean by “probably?” she thought, but to Neia, judging the sex of an Orc would be very difficult. It would probably be the same way for them as well.</p><br/><p>“We did not attack this country. Nobody from the Orc tribes should have helped Jaldabaoth. Because of that, he brought us — who defied him — along to this place as punishment.”</p><br/><p>“Hm… and what did Jaldabaoth do after he brought you here?”</p><br/><p>The Sorcerer King’s question seemed to given Dyel and the other Orcs a powerful shock. The Orcs who looked like mothers clutched their children tightly. After that, there were sounds of moaning and vomiting.</p><br/><p>“…What happened here, seriously?” the Sorcerer King could not help but say.</p><br/><p>“Ah, it seems I’ve asked a question I shouldn’t have asked. Shall I bring some water? Or do you want something else?”</p><br/><p>The Sorcerer King’s attitude seemed to have changed. For some reason, he seemed very nervous. Perhaps he felt guilty about asking the Orcs about a question that had dredged up bad memories. While it might be somewhat rude to think of him that way, the Sorcerer King looked like a parent trying to comfort another child which their own offspring had driven to tears.</p><br/><p>This is something only a king who counts both humans and demihumans as his subjects would do…</p><br/><p>To the people of the Holy Kingdom, demihumans were the enemy. Therefore, under identical circumstances, they would not say anything kind or comforting.</p><br/><p>“We do not want anything else. But we beg you not to ask us what happened. You would not enjoy hearing it, and it was a hellish experience for us. If you order us to speak of it we will do so, but I pray you will do it away from others. Please.”</p><br/><p>After hearing the sobs and weeping of the female Orcs, Neia began to feel a little afraid of what had happened to them.</p><br/><p>“…How vexing,” the Sorcerer King muttered to himself, but so much had happened that Neia did not know what he was referring to.</p><br/><p>“Ah, erm, well. Since you seem to be enemies of Jaldabaoth, why not discuss the matter of joining forces with us, since we have a common foe?”</p><br/><p>Dyel shifted his gaze downwards.</p><br/><p>“We had thought of fighting once, but now we no longer think of such things. We`ve been broken by the fiendish things which happened here. We no longer have the courage to fight.”</p><br/><p>“Then if I free you, what will you do?”</p><br/><p>“If possible, we would like to return to our villages. If there are still people who are safe there, we would like to take them and run far, far away, until we find a place where Jaldabaoth cannot reach us.”</p><br/><p>The Sorcerer King nodded.</p><br/><p>“Then, come to the domain which I rule—”</p><br/><p>“—Please allow us to refuse! I am keenly aware of the dangers of upsetting you, but even if we agree here, we will surely flee once we reach a place where we can escape. However, betrayal is the vilest act imaginable. Then, we should refuse here, since what awaits us is a death that will not be so agonizing.”</p><br/><p>“What…”</p><br/><p>The Sorcerer King was probably a little baffled by this staunch refusal. However, Neia keenly understood what Dyel was thinking. That was because until she had met the Sorcerer King, Neia had felt that the undead were the enemy of all that lived.</p><br/><p>“…No, but my domain is not a fearsome place, you see? There’s many demihumans who live there, you know?”</p><br/><p>“You’re lying! It sounds like a lie! We, we won’t be tricked! You’re talking about demihuman undead, aren’t you?”</p><br/><p>Dyel seemed to have gone half-mad, but he was just like how she had been in the past. Then, as one who had some experience in these matters, she ought to tell him about the true face of the Sorcerous Kingdom.</p><br/><p>“His Majesty is telling the truth. He is a great man who, while being undead, also possesses a heart filled with compassion for all living things. He loves children, he rules demihumans fairly, and he receives the respect of his subordinates. As proof of that, they have even built enormous statues of him which astound all who see them—”</p><br/><p>“—Ms. Baraja! Really, that, that’s enough…”</p><br/><p>“But, Your Majesty!”</p><br/><p>“Please… say no more…”</p><br/><p>Since he had said “please,” she had no choice but to keep quiet.</p><br/><p>“Human, have you been brainwashed!?”</p><br/><p>“I have not. I have seen His Majesty’s kingdom with my own eyes. The first demihuman I saw was a Naga.”</p><br/><p>There was a commotion as the demihumans looked at each other. There were voices asking, “What’s a Naga?” but they were ignored.</p><br/><p>“Also, I saw a rabbit-like demihuman. I am not a citizen of the Sorcerous Kingdom. Therefore, my time there was short. Even so, it was enough for me to understand what was going on. The people living there did not have pained and frightened looks on their faces like you do. And of course, none of them were covered in cuts and bruises like you.”</p><br/><p>The demihumans looked down at their stick-thin bodies. Their muscles had shrivelled up, and they were little more than skin and bone.</p><br/><p>“It is as she — as Ms. Baraja says. That said, you will probably not believe me. However, once you become my vassals, I will never allow you to suffer such cruelty again. I can swear that to you upon my name, Ainz Ooal Gown. The reason for that is because all that I rule belongs to me. Should it be damaged, it is the same as damaging my property. Therefore, you may be at ease. If you do not wish to accept my rule, I will not force you to do so. Live as you please. In any case, I shall prepare to send you back to your homes.”</p><br/><p>“…Why are you being so kind to us?”</p><br/><p>This was the first time Dyel had cast aside his preconceived notions. Neia could feel him looking at the Sorcerer King himself.</p><br/><p>“Fufu… I wish to defeat Jaldabaoth. Therefore, the demihumans under him are quite troublesome. Having you go back to your villages is also a way of eroding his power.”</p><br/><p>“What do you mean?”</p><br/><p>“Unlike Jaldabaoth, I am a merciful king. If you spread the word for me, that will surely cause unrest throughout his forces, and there might even be those who decide to turn coat and support us, don’t you think?”</p><br/><p>“I see, so that’s how it is.”</p><br/><p>It was difficult for people to put their faith in benefits offered to them with no strings attached, but a mutually beneficial transaction was more trustworthy. It would seem the same logic applied to demihumans.</p><br/><p>“However, don’t you think that’ll be difficult? Many of Jaldabaoth’s vassals are bloodthirsty maniacs. Even if we spread the word in our villages, it would not have much effect.”</p><br/><p>“That’s fine too. I intend to use everything I can use. And if Jaldabaoth carries out a reign of terror, there might be demihumans who will betray him too. Mm, speaking of which, will you not help me fight Jaldabaoth?”</p><br/><p>“…We can’t. We’ve told you before, right? We don’t have the will for that now.”</p><br/><p>“Huh. What a shame. And you still do not wish to come to the Sorcerous Kingdom?”</p><br/><p>“Indeed, it would be a good thing to live under the protection of a mighty being like yourself. However, this is not a decision we can make by ourselves. Depending on the result of our discussion with the others, we might end up relying on you.”</p><br/><p>“Dyel!”</p><br/><p>“Donbass. I know what you want to say. However, with the appearance of Jaldabaoth, a fiend against whom we are helpless, we cannot protect our villages by ourselves. Sooner or later, this will be our fate.”</p><br/><p>The Orc called Donbass bit his lip and looked down. He understood that point as well.</p><br/><p>“Is that so? Then, if you come to my country, then I, the Sorcerer King will offer you my full support. Many species live upon my land. At that time, I hope you will work together with them — live with them as people of my country.”</p><br/><p>The Sorcerer King’s tone softened.</p><br/><p>Demihumans were viewed as the enemy in the Holy Kingdom, yet in the Sorcerous Kingdom they were seen as beings with whom one could coexist. From where did this enormous difference spring? As Neia thought about it, she immediately found the answer.</p><br/><p>It’s because of His Majesty, huh… Because His Majesty possesses such incredible power. As I thought… power is what’s important….</p><br/><p>“Now then, after this, I will provide the rations you will need until you return to your villages. In addition, I will supply soldiers to defend you. Returning home safely with those bodies of yours will require much time and effort.”</p><br/><p>“You would go this far for us?”</p><br/><p>“Of course I would. Do weep and wail at great length about the generosity and magnanimity of the Sorcerous Kingdom and spread my name. After this, Ms. Baraja, could I trouble you to leave the room? I am about to use a national secret of the Sorcerous Kingdom which I do not wish to allow anyone from another country to see.”</p><br/><p>“Understood.”</p><br/><p>Neia stepped out of the room after answering, and she felt a little lonely. The Sorcerer King’s words made perfect sense, and while she could understand them, she could not accept them.</p><br/><p>As she stood outside the broken door, the breathing sounds of Orcs from within the room began to dwindle. It was as though they were vanishing from the room, and in truth, that was probably the case.</p><br/><p>The Sorcerer King had once said that as long as he remembered a location, he could teleport to it. He must have used such a spell on them.</p><br/><p>Soon, the room was silent. A moment later, the sound of footsteps approached Neia. As her mind registered that fact, she saw that the only person on the other side of the door was the Sorcerer King.</p><br/><p>“Forgive the long wait.”</p><br/><p>“No, it was not long at all.”</p><br/><p>The room was empty. He must have used magic potent beyond the ability of Neia to imagine to teleport all the Orcs away. Or perhaps he had used some other means — he had teleported them with an item.</p><br/><p>“Then, let’s meet with Captain Custodio and hear about our future plans from her.”</p><br/><p>“Yes! Your servant understands!”</p><br/><p>♦ ♦ ♦</p><br/><p>After exiting the Orc internment camp, the two of them asked a paladin they met along the way about Remedios’s location. There was no sign of her at the building they were directed to, but Gustavo was there.</p><br/><p>“Ohhhh! Your Majesty! We were just about to invite you over!”</p><br/><p>Gustavo seemed completely different from when they had met him earlier. He was lively, as though the light of hope was spilling out from him, and his voice had perked up too. Had something appeared which had changed the currently-dire situation? Perhaps the Sorcerer King had the same question in his heart, and so he asked:</p><br/><p>“What happened? Did you receive some good news?”</p><br/><p>“Yes! There’s a very important person you must see. Come, this way.”</p><br/><p>If they wanted to show him somebody, he must be a powerful noble, or someone related to the royal family.</p><br/><p>The Sorcerer King — trailed by Neia for some reason — was guided to a certain room by Gustavo.</p><br/><p>It contained several simple wooden chairs. Remedios was seated there, as was a skinny man.</p><br/><p>The two of them turned to look at the Sorcerer King as he entered, and they both rose in welcome.</p><br/><p>“This is the royal brother in whose veins flows the blood of our Holy King, Caspond-sama.”</p><br/><p>Indeed, his face resembled the profile of the second Holy King which adorned the Holy Kingdom’s gold coins. Neia blinked at the fact that someone like this had actually been imprisoned here.</p><br/><p>“Caspond-sama. This is the king of the Sorcerous Kingdom of Ainz Ooal Gown, His Majesty Ainz Ooal Gown, who has come to aid our nation.”</p><br/><p>“Ohhh! Words cannot express my gratitude, Your Majesty. I am honored to meet you. As others have said, I am the brother who was eclipsed by my outstanding little sister.”</p><br/><p>As the royal brother said something that was very difficult to respond to, Remedios had an annoyed look on her face which seemed to say, Are you making fun of her? Still, he was the next successor for the late Holy Queen’s position, so she could not put on the same attitude she had held all this time. Thus, Remedios simply cast her eyes downward without saying anything.</p><br/><p>“Ahhh, is that so? An honor to meet you, Royal Brother-dono.”</p><br/><p>Then, their eyes met again.</p><br/><p>Neia watched and wondered what they were doing, and a moment later the Sorcerer King extended his hand, which Caspond took.</p><br/><p>Shaking hands was a practice that arose among those of higher status.</p><br/><p>When one compared a man who was simply in the line of succession to the throne to someone who ruled a country of his own, however small it was, the latter would be of higher status. The fact that the latter was also aiding the country of the former only served to heighten his importance. The fact that the Sorcerer King had not immediately extended his hand was probably a sign of respect to the other side.</p><br/><p>Truly, he is a thoughtful and generous man.</p><br/><p>That convinced Neia. Out of the corner of her eye, she saw that Caspond was also nodding and making noises of approval.</p><br/><p>“Your Majesty, I apologize for greeting you in this shabby attire. It would have been well if I could have changed before your arrival, but…”</p><br/><p>“There is nothing to be ashamed about. Mere clothes cannot degrade a man of class. You must be exhausted from your long imprisonment. Will you not take a seat before speaking?”</p><br/><p>“I am grateful for your kindness. Then please allow me to avail myself of your goodwill.”</p><br/><p>The Sorcerer King was the first to release their handshake, and Caspond sat down after he did.</p><br/><p>“In any event, I am glad to see Your Highness is safe and sound. Still, how did you come to be imprisoned here?”</p><br/><p>“That was because I happened to flee here. Baron Bagnen took very good care of me. —How is he? Captain Custodio. I believe you took him away after he spoke to me.”</p><br/><p>“Baron Bagnen’s wounds are not severe, and his life is not in danger. However, due to his poor physical condition and great exhaustion, he is still sound asleep.”</p><br/><p>“Can the priests not use their magic to aid him? Now would be the time to draw on his intellect, no?”</p><br/><p>“The priests have exhausted their remaining mana on healing the wounded, and they are currently resting. I sincerely apologize, but if the situation is not critical, I feel it is better to let them conserve their mana.”</p><br/><p>“If that’s the case, then it can’t be helped, Captain. However, he was the one who brought me here and fought desperately to protect me. If possible, please— you understand what I’m saying, right?”</p><br/><p>It was not Remedios, but Gustavo who nodded deeply.</p><br/><p>“All right, then there is one thing I must verify first. Is there anyone in this country who can see through shapeshifting or illusions?”</p><br/><p>“Why do you ask, Your Majesty?”</p><br/><p>“That is because I am wary of demons using magic to hide themselves among the imprisoned people.”</p><br/><p>Caspond looked at Remedios.</p><br/><p>“Captain, can you answer His Majesty’s question?”</p><br/><p>“Ah, my apologies. Please answer on my behalf, Vice-Captain. I do not recall anyone like that.”</p><br/><p>The Sorcerer King went “Mm—” and sank into contemplation. Caspond then asked Remedios another question.</p><br/><p>“If it troubles the Sorcerer King so, that clearly indicates that this must be a vital question. I shall ask you again. Can you swear to the gods that you do not know?”</p><br/><p>The two paladins nodded, and then Caspond’s gaze turned to Neia. Surely he would not know a squire like herself, right? As Neia thought that, she hurriedly nodded as well.</p><br/><p>“So even Squire Baraja does not know… what’s wrong? You look puzzled. I’ve heard your name from the Captain. I’m very grateful that you can serve by His Majesty’s side.”</p><br/><p>“My deepest thanks!”</p><br/><p>Neia hurriedly bowed to Caspond.</p><br/><p>“Just so. She is exceptional. I would like a follower like that.”</p><br/><p>“What, surely, you must jest…”</p><br/><p>Neia’s voice was trembling. As he saw her in that state, the Sorcerer King and Caspond laughed happily. Then, they resumed their — although the Sorcerer King had no facial expressions, of course — serious looks.</p><br/><p>“While it shames me to admit my ignorance, do demons possess the power to transform into other people?”</p><br/><p>“Demons can take human form to make people fall, but that does not mean they can transform into others. It is simply that they can take human form, not that they can imitate anyone’s looks. Therefore… if there is anyone unfamiliar among the people imprisoned here… there will be a need to be careful.”</p><br/><p>“In that case, we will need to have the people who were captured vouch for each other…”</p><br/><p>“Now, illusions are more troublesome. With illusions, one can take the faces of others. For instance…”</p><br/><p>The Sorcerer King cast a spell, and his skeletal face transformed into that of Caspond.</p><br/><p>“This is an illusion. However, low level illusions like this one might be able to change one’s attire, but not one’s voice. Also, they cannot imitate memories and thoughts. Therefore, they will be immediately exposed if someone close to the subject speaks to them.”</p><br/><p>The Sorcerer King’s face resumed its skeletal form.</p><br/><p>“There are many ways to disguise one’s clothes and voice. Therefore, the best way is to speak to them and check for a sense of wrongness.”</p><br/><p>His questions to the Orcs must have been intended to guard against that, Neia mused.</p><br/><p>As expected of His Majesty. His considerations are surprisingly thorough.</p><br/><p>“I see… well, you heard that, no? Go check it out immediately.”</p><br/><p>“A moment please. You should also consider the possibility of a demon running amok once it is exposed. Do you not think that letting a powerful person like Captain Custodio stay by your side to protect you would be better?”</p><br/><p>“I see. I understand. I will perform investigations with the Captain as a witness.”</p><br/><p>Gustavo bowed his head.</p><br/><p>“Royal Brother-dono. That is all I wished to verify. If you have more to say, then by all means.”</p><br/><p>“Then — Your Majesty. As for our future plans, I feel it is necessary for us to head south, link up with the local forces and then launch a full-scale attack. That is because there were several nobles imprisoned with me, and I wish to ask them to see who can lend their strength to us. That is the plan I intend to adopt.”</p><br/><p>“Mm. I do not understand this country’s nobles, so if you feel that is best, then by all means… Will you not attack the other prison camps and rescue the prisoners there?”</p><br/><p>“It is not yet time for that. Leading many people to areas controlled by Jaldabaoth is very obvious, and our rate of advance will become very slow. I wish to avoid an outcome where we lose more than we gain by helping others.”</p><br/><p>“…Then why not let the civilians flee south while we alone attack the prison camps?”</p><br/><p>“Captain Custodio. You were allowed to be present, but I did not seek your opinion.”</p><br/><p>Caspond spoke in a tone that was completely different from how he addressed the Sorcerer King.</p><br/><p>Remedios clenched her teeth as she bit back her anger.</p><br/><p>“I also approve of Royal Brother — no, Gaspond-dono’s opinion. However, you have already taken two prison camps, including this place. I imagine you can continue to skillfully apply the experience gained here, do you not?”</p><br/><p>“We shall do nothing,” Caspond shrugged. “I do not feel we can take this land back without deaths or wounded. The number of casualties will grow from the tens, to the hundreds, to the thousands. There is something else which is more important than this.”</p><br/><p>As they heard his words, which cast the people aside, Neia saw looks of shock cross Remedios’s and Gustavo’s faces. As for Neia herself, she calmly thought, This is all ordinary royals amount to.</p><br/><p>“Caspond-sama, you’ve changed. In the past, you were a great man who was as kind to the masses as Her Majesty.”</p><br/><p>“What’s this, Captain Custodio? Are you disappointed? Hmph!”</p><br/><p>Caspond’s face twisted. His lips curled, baring his teeth. His razor-sharp gaze was full of mockery.</p><br/><p>“Your heart would be as twisted as mine if you had tasted the same hell I did. I can’t spout pretty words any more, huh. They make me sick… As for what did they do to us… I guess you haven’t heard yet. In that case, go find someone and ask them. That way, you’ll know exactly how evil and blasphemous demons are.”</p><br/><p>He was like a completely different person, Or perhaps it would be more accurate to say that the inky black substance under his forcibly-repaired personality had emerged again.</p><br/><p>“If possible, I’d like to kill all those demihumans…”</p><br/><p>He glanced at the Sorcerer King, who shrugged and answered:</p><br/><p>“You may do as you please after you’ve questioned them. I’ve already liberated the Orcs.”</p><br/><p>“That can’t be helped, then. What a shame. Well, the Orcs tasted misery alongside me… although, could you hand them over to me in exchange for the holy sword?”</p><br/><p>“I am a magic caster. What would I do with a sword even if you gave it to me?”</p><br/><p>Caspond chuckled at the Sorcerer King’s playful reply.</p><br/><p>On the other hand, Remedios’s blank face stood as a contrast to Gustavo’s pale features.</p><br/><p>It sounded like a joke, but Caspond was probably serious.</p><br/><p>Neia’s body trembled. To think he hated those imprisoned demihumans enough that he was willing to hand over a national treasure just to get them back in his hands… What on earth had happened to him?</p><br/><p>“So you will abandon this city?”</p><br/><p>“I would like to if I could. But before that, I want to interview some of the prisoners and send messengers to the south. I think that will take a week at the earliest. When we take this land back, I shall offer you a gratuity corresponding to your kindness in addition to what Captain Custodio has already arranged.”</p><br/><p>“I do look forward to that.”</p><br/><p>♦ ♦ ♦</p><br/><p>The Sorcerer King left with Neia a minute later. Caspond went, “All right. Since the Sorcerer King is already gone, let’s get to the main event.”</p><br/><p>“Yes. Protecting this many people at once will be very difficult. If possible, I believe we will need to borrow reinforcements from the south, or perhaps obtain some sort of transport like horses and carriages.”</p><br/><p>Caspond smiled thinly as he heard Gustavo’s suggestion.</p><br/><p>“What nonsense are you spouting? Who said we’re talking about that?”</p><br/><p>“Were we not supposed to consider how to move ourselves south?”</p><br/><p>“Let me speak plainly. We will not flee south right away. We will do battle with Jaldabaoth’s army here.”</p><br/><p>“That’s far too rash!”</p><br/><p>As she heard Gustavo’s words, Remedios continued speaking.</p><br/><p>“While we have city walls, we’ll be finished once we’re surrounded and the food runs out. A siege would be foolish without reinforcements to count on.”</p><br/><p>While Remedios may not have been good at thinking, she was very reliable when it came to battle. Gustavo nodded as he heard his Captain’s confident words.</p><br/><p>“Even so, we must fight here.”</p><br/><p>As the two of them turned questioning gazes on him, Caspond smiled cruelly and explained himself.</p><br/><p>“You heard it too, right? The Sorcerer King is conserving his mana for the battle with Jaldabaoth…”</p><br/><p>After seeing Gustavo nod, Caspond continued.</p><br/><p>“That would be troublesome. After he defeats Jaldabaoth and takes the maid demons, the Sorcerer King will return to the Sorcerous Kingdom. Before that, we need to have him decrease the amount of demihumans who have invaded this nation. Therefore, we must place ourselves in dire straits.”</p><br/><p>“But our agreement with the Sorcerer King…”</p><br/><p>“Every time the Sorcerer King slays several demihumans with his magic, fewer people of the Holy Kingdom will be lost, no? Which will you choose? Your pact with the undead, or the lives of the Holy Kingdom’s innocent civilians?”</p><br/><p>Gustavo had a bitter look on his face, while the blank-faced Remedios promptly answered:</p><br/><p>“The innocents of the Holy Kingdom, of course.”</p><br/><p>“That’s how it is, Captain. Therefore, you must make the Sorcerer King fight. Since we have made an agreement, there must be a good reason to break it.”</p><br/><p>“And so we must fight Jaldabaoth’s army for that?”</p><br/><p>“Correct. Or rather — we began our work to flee to the south, but since we took more time than we expected, we were surrounded by Jaldabaoth’s army. With no options left, we had no choice but to seek the Sorcerer King’s strength. What do you think?”</p><br/><p>He’s right, Remedios and Gustavo’s eyes seemed to say to each other. However—</p><br/><p>“I have a question. What if the mana that the Sorcerer King expends becomes a disadvantage during the battle with Jaldabaoth?”</p><br/><p>“I hear mana can be recovered quickly, no?”</p><br/><p>“My sister said so too.”</p><br/><p>Remedios’s little sister was a priestess. If she said, “I heard it from her,” nobody could refute it.</p><br/><p>“We’ll release a few demihumans on purpose and lure Jaldabaoth’s army here. We need to do it before we run out of rations, remember.”</p><br/><p>“…But how many of Jaldabaoth’s men will come?”</p><br/><p>The three of them had already shared what they knew. After a series of battles, Jaldabaoth’s army was less than one hundred thousand strong.</p><br/><p>The army was formed of twelve species, as well as six other species who were not numerous enough to qualify as armies in their own right, for a total of eighteen species.</p><br/><p>The twelve races were:</p><br/><p>Snakemen — serpent-headed demihumans, considered close relatives of Lizardmen.</p><br/><p>Armatts — a bipedal rat-like species with iron-like fur. They were considered close relatives of the Quagoa.</p><br/><p>Cabens — they resembled apes that were slightly larger than human beings, whose eyes had atrophied.</p><br/><p>Zerns — a slimy species with whose upper bodies were like eels with arms and whose slimy lower bodies were like blue-colored maggots. Some people wondered Are you sure they aren’t heteromorphs? but they were affected by spells that worked on demihumans, so they were classed as demihumans.</p><br/><p>Bladers — an insectile species whose fingernails sprouted knife-like blades and whose bodies were protected by an armor-like exoskeleton. Much like the Zerns, they were also affected by spells that worked on demihumans, so they were classed as demihumans</p><br/><p>Horuners — demihumans with horse-like legs who were adept at sprinting. They could run for long periods without rest and possessed shocking mobility.</p><br/><p>Spidans — Spider-like demihumans with four long and slender arms and legs who resembled spiders. They could spit all sorts of silk from their mouths and make all manner of clothes and items with that silk. The silk clothing they made in this way was as hard as steel.</p><br/><p>Stone Eaters — armed with crude weapons, their most frightening feature was their ability to spit the rocks they ate. They could spit stone fragments that could easily dent metal armor, and do so at ranges in excess of one hundred meters. However, they could only do that a limited number of times, so if one could weather their onslaught, they were nothing to fear.</p><br/><p>Orthrous — they were a version of Centaurs whose lower bodies were replaced by those of carnivorous beasts. They had better fighting power than Centaurs, but conversely they were less mobile.</p><br/><p>Magilos — born with the ability to use spells of up to the fourth tier. The spells they could use apparently appeared on their bodies like tattoos. Their more powerful members were covered in tattoos. Sometimes there were individuals who could develop skills as magic casters, and those were rumored to be able to cast spells of up to the fifth tier. They might be Lord level entities.</p><br/><p>Pteropos — a species which lived on cliffsides, they were very adept at long distance gliding. While they could fly, it seemed to require a lot of strength, so they could only fly for a while every day, and after that they could not even glide. If they did not fly, they could rend armor with the wind, so defending against it was very difficult. They were a species which was stronger when they could not fly.</p><br/><p>And then, there were the Bafolk.</p><br/><p>The remaining six races were not particularly numerous, but each of them was quite powerful.</p><br/><p>Ogres.</p><br/><p>Buri Uns — an Ogre-like race with the power to control the earth, who could be considered a superior species. They possessed special abilities associated with the earth.</p><br/><p>Vah Uns — Similar to Buri Uns, they were water-controlling beings. They had water-linked special abilities.</p><br/><p>Nagarajas — they looked like snakes with scaly bodies and arms. They were a completely different species from the similarly-named Nagas, and they did not get along well with the latter. They were born with the ability to cast many spells, and sometimes they would even equip themselves with swords and armor.</p><br/><p>Spriggans — a species that could freely change their size from small to large. They were fundamentally a good species and evil Spriggans were very rare. That said, both good and bad Spriggans were unmanageable when they went berserk.</p><br/><p>Zoastia — carnivores with the upper bodies of beastmen. They were relatives of Centaurs and Orthrous. They wore plate armor and carried round shields. They had no special abilities, but they were heavy cavalry with the savagery and strength of wild beasts. Just one of them was very powerful, and the Orthrous often relied on them. It was apparently a relationship like the one between Goblins and Hobgoblins. However, due to their lack of special abilities, they were not very strong foes against adventurers who could cast the 「Fly」 spell. Still, in a head to head clash, even orichalcum ranked adventurers would have a hard time.</p><br/><p>♦ ♦ ♦</p><br/><p>“According to the Sorcerer King, your base might be under surveillance, right? Then if they know how many troops we have, they might not send too many troops over. That works to our advantage. However, there’s a problem.”</p><br/><p>“Food.”</p><br/><p>“Yes. While the priests can make food, they can only make very little even after exhausting their mana. They also can’t feed like demihumans.”</p><br/><p>Remedios and Gustavo had looks of distaste on their faces. All three of them knew that demihumans preyed on humans.</p><br/><p>Therefore, even if they tried to starve the invading demihumans, they all knew they would lose in the end. That was because the demihumans’ prison camps could be considered larders for them.</p><br/><p>“Go check how long our food can hold—”</p><br/><p>“We’re checking already. We’re also looking for any blacksmiths who might be able to modify the demihuman gear for use by humans.”</p><br/><p>“I expected nothing less of you, Captain.”</p><br/><p>The three of them continued discussing their preparations for the siege. After another hour, they reached a conclusion which all of them could accept, and the three of them smiled.</p><br/><p>“All right, then let’s prepare for the siege.”</p><br/><p>♦ ♦ ♦</p><br/><p>One week later, as their food supplies dwindled and it was about time for them to move, the demihuman army appeared from over the horizon.</p><br/><p>However, it was a massive army whose scale far exceeded their expectations.</p><br/><p>Part 5</p><br/><p>Ainz looked out over the city, which was in a panic over the appearance of the demihuman army, and he slowly collapsed.</p><br/><p>This was not a figure of speech.</p><br/><p>Ainz’s heart and soul were stretched to their limits by fatigue, and despite his undead nature, he fell to his knees from mental exhaustion and grabbed his face.</p><br/><p>What should I do… what should I do after this…</p><br/><p>Fundamentally, Ainz had been following Demiurge’s script.</p><br/><p>Of course, not every word and action was planned, so he had improvised a fair bit, but even so, Ainz was counting on following the developments of Demiurge’s plan.</p><br/><p>Or rather, the problem was that he had improvised too much.</p><br/><p>Frankly speaking, the operational directives he had gotten from Demiurge basically said: “Please adapt to the situation,” and other things like that.</p><br/><p>This was too much. That was what Ainz had thought when he first looked at the instructions.</p><br/><p>If Ainz was an excellent person, perhaps he could follow those directions and play the role of a perfect Sorcerer King. However, much to his regret, Ainz’s abilities were perfectly normal, or perhaps even worse than that.</p><br/><p>Therefore, Ainz had gotten into a spirited debate with Demiurge over the matter.</p><br/><p>He recalled things going like this: Ainz had pleaded, “I don’t understand, write in more detail,” whereupon Demiurge had humbly replied with “How could I possibly do something that rude to the sagacious Ainz-sama?” and this had led to an intense back and forth. He had roped Albedo into this battle halfway, and Ainz — who had begun at a great disadvantage — had finished at a complete loss.</p><br/><p>And so, the operational directives granting him complete discretion ended up in Ainz’s hands.</p><br/><p>If this was a prank on Demiurge’s part, he might be able to deal with it in some other way, but this was the fruit of his subordinate’s trust and respect.</p><br/><p>In particular, that was made very clear by such pronouncements as “You will surely be able to reach a better conclusion, Ainz-sama — how could one as insignificant as myself bind you with my words and deeds?”</p><br/><p>If you went by common sense, why would the king of another country come over alone… what an unreasonable argument… still, I’ve come all this way. Although I stirred up some problems along the way and got careless a few times, I still came all this way…</p><br/><p>He did not believe in the gods, but he wanted to pray to them with all his heart.</p><br/><p>Couldn’t Demiurge and Albedo consider my abilities before dumping missions onto me…</p><br/><p>Being asked to do the impossible made his motivation shrivel up.</p><br/><p>…All right, pull it together, me. It’ll be easier after I get through this.</p><br/><p>Ainz poured his strength into his legs, and then he stood up.</p><br/><p>The plan had come to the vital middle stages, and that was the worst part.</p><br/><p>According to Demiurge, if they formed a defensive line at this city, they would attack until there were eighty five percent casualties.</p><br/><p>Ainz had no idea what he was talking about.</p><br/><p>Since Demiurge felt it ought to be this way, then it should be a better answer than anything Ainz came up with. If all those deaths brought benefits to Nazarick, then let them die. Rather, Ainz would think about whether killing more would bring even more benefits to Nazarick and such things.</p><br/><p>However, the problem lay in the fact that Demiurge had asked Ainz for humans here which could not be killed.</p><br/><p>Frankly speaking, if that was all, then he would randomly select a few and be done with it, but there was one more thing to note.</p><br/><p>That was humans who were devoted to Ainz, or who might be persuaded to join Ainz’s side.</p><br/><p>『I feel that there must be several humans who are as devoted to you as those Dwarves, so please tell me their names, and when I make my move, I will take care not to kill them off.』</p><br/><p>When he received that message from Demiurge, he had even thought, Are you kidding me? as he doubted Demiurge’s thinking.</p><br/><p>“…There’s nobody like that.”</p><br/><p>Those despondent words escaped Ainz.</p><br/><p>There were no humans here who were devoted to Ainz.</p><br/><p>Rather, he had keenly experienced how much the undead were hated in the Holy Kingdom.</p><br/><p>Under these dire circumstances, how many people would be devoted to his undead self?</p><br/><p>However, he could not tell Demiurge that there were none.</p><br/><p>Demiurge sincerely believed that Ainz could fascinate several humans. So what would happen if he told Demiurge that he had not managed to do so with anyone?</p><br/><p>My stomach hurts…</p><br/><p>The Dwarf Demiurge was speaking of must have been Gondo Firebeard, but that had simply been lucky. He had scored a critical hit on a weakness in his heart by pure chance, and such luck would not repeat itself.</p><br/><p>And it was precisely because he had the font of information which was Gondo that he had managed to strike a chord in the hearts of the runesmiths. However, there was nobody like that in the Holy Kingdom.</p><br/><p>There was one person with whom he had formed a friendly relationship, Neia Baraja, but that was all.</p><br/><p>Besides, he had given her a magic item to improve their relationship, as well as for another reason, but how effective it had been was still unclear. She kept glaring at him with murderous eyes, so he probably should not expect anything good to come of it.</p><br/><p>What would Demiurge think if I told him there was only one person? Ainz asked himself.</p><br/><p>Would the image of Ainz which Demiurge held in his heart not crumble completely?</p><br/><p>And then, what would happen in the future?</p><br/><p>In the Dwarven Kingdom, I told Demiurge that I wasn’t that smart, but at that time it didn’t seem like he believed me completely… this is bad. How great a person am I in his eyes? Or rather, it seems I’m getting greater and greater; am I imagining things? Normally, wouldn’t it be the other way around?</p><br/><p>The expectations placed on him hurt. They were not weighty; they just hurt.</p><br/><p>In the past, he had pondered how heavy and painful the word “loyalty” could be. In particular, the part where his subordinates viewed Ainz as a great being was the most painful of all.</p><br/><p>I guess I should take this opportunity to tell Demiurge that I’m not really that amazing, but what would happen if I did? What should I do if it caused the plan that Demiurge labored for so long over to end in failure? If I spent several years courting a big client, only to have it fall through because of a stupid comment from my boss…</p><br/><p>Ahhh, Ainz said as he scratched his hairless head.</p><br/><p>What should he do?</p><br/><p>What was the best answer he could give?</p><br/><p>No matter what simulations he ran, they all ended in Demiurge looking at him in disappointment. He could not reach a conclusion that he could accept.</p><br/><p>He’s expecting too much of me — the higher the climb, the longer the fall. That’s why I said I’m nobody amazing…</p><br/><p>And then, Ainz’s own plan had been quite the failure.</p><br/><p>Ainz reached into his pocket space and drew a sword.</p><br/><p>It was an ordinary sword inscribed with runes.</p><br/><p>However, it contained power comparable to the bow he had lent to Neia.</p><br/><p>Of course, these were not Dwarven runes. The runes carved on it had no power at all. This was a piece of equipment made with YGGDRASIL techniques.</p><br/><p>“Haaaa…”</p><br/><p>Ainz sighed. He had several weapons like this. The original plan was to lend these weapons to the Holy Kingdom.</p><br/><p>The people of the Holy Kingdom would be awed by the overwhelming power of the sword and think, So this is the power of runic weaponry, which would in turn improve the reputation of the Sorcerous Kingdom’s rune weapons.</p><br/><p>This was the other reason why he had lent Neia the weapon.</p><br/><p>He felt that the people of the Holy Kingdom would see that weapon and secretly borrow them from Ainz.</p><br/><p>However—</p><br/><p>Ainz grabbed his head.</p><br/><p>Why didn’t anyone borrow them? I even thought people would talk about it because it was so flashy… I guess I should have forced her onto the frontlines and made her fight, huh…</p><br/><p>Just then, there was a tok tok tok as someone knocked on the door.</p><br/><p>He quickly checked his robe and other messy places before putting the sword back into his pocket dimension. Then he put his hands behind his back, looked at the door like a sovereign, and spoke loudly:</p><br/><p>“Who is it?”</p><br/><p>“Your Majesty, may I enter?”</p><br/><p>There was no way to tell if it was a male or female voice through the door. Normally, he should have asked the visitor’s name, but Demiurge had already told him that someone was coming, and so Ainz granted his permission without any hesitation.</p><br/><p>“Ahh, it’s fine. Come in.”</p><br/><p>The person who entered Ainz’s room closed the door behind himself, and its body changed as well.</p><br/><p>It had an egg-shaped head with a mouth and two eyes that looked like sunken holes. Its three-fingered hands were as slender as stick insects.</p><br/><p>It was a Doppelganger.</p><br/><p>It was a Doppelganger he had lent Demiurge at his request.</p><br/><p>Since it was a monster Doppelganger, it was not very strong.</p><br/><p>Even when transformed, it could only copy level forty abilities, and it was even weaker without transformation. Its more potent abilities was how it could freely make use of karma-restricted gear. That said, it could not use magic items above legacy class.</p><br/><p>Its vacuous hole-like eyes turned to Ainz, and then it bowed deeply.</p><br/><p>“I sincerely apologize for the many offenses I have caused you during the course of my duties. I pray you will forgive me.”</p><br/><p>“Don’t worry about it. You were just doing your job. I have nothing to say about that.”</p><br/><p>“Your servant is grateful for your generous words.”</p><br/><p>Ainz looked at the room’s door.</p><br/><p>“Aren’t you very busy now? There ought to be many things you need to direct, no? And is there anyone outside? If there’s anyone, we’ll be in trouble if we don’t keep our voices down.”</p><br/><p>“It is fine. Nobody will object to your servant going alone to see you, Ainz-sama.”</p><br/><p>“Is that so…”</p><br/><p>Oh yes, the Doppelganger replied. However, it was still important to be careful.</p><br/><p>“Then, Ainz-sama, please inform your servant of your decision.”</p><br/><p>“Inform you of what?”</p><br/><p>That said, Ainz knew very well why the Doppelganger had come here.</p><br/><p>Or rather, it was time to tell this Doppelganger.</p><br/><p>Yes, the question of who he had enthralled.</p><br/><p>“Forgive me. This one speaks of the matter from earlier — the matter of those humans who are devoted to you and whose lives must be spared, Ainz-sama.”</p><br/><p>“Hm…”</p><br/><p>Ainz nodded forcefully, and began to walk.</p><br/><p>Of course, he could not leave the room. Ultimately, he could only pace around inside this room. There was no telling where the Doppelganger’s eyes were looking, but Ainz was certain that they were following his movements, Ainz was certain. In truth, it would be quite scary if they did not look his way.</p><br/><p>Time was running out. As Ainz thought with all his might, he suddenly stopped in place.</p><br/><p>—He could not find the right answer. However, he did not have any ideas about how to continue covering things up any more.</p><br/><p>If he were human, his heart would be pounding now, but his body lacked any organs which could move in that way.</p><br/><p>A powerful emotion welled up, causing his emotion override to take effect, and as the small ripples bounced around inside his heart, Ainz told the Doppelganger the answer.</p><br/><p>“Umu. I’ll be frank. There are no human beings who need to be saved. Leave a few alive as needed.”</p><br/>\n</div>"}