{"title": "Chapter 98 (END) - Volume 13", "id": 98, "volume": 13, "url": "http://boxnovel.org/overlord-ln-chapter-98-end-volume-13", "volume_title": "Volume 13", "body": "<h1>Chapter 98 (END) - Volume 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Overlord Volume 13 Afterword, Credits and Character Sheets</p><br/><p>Afterword</p><br/><p>Thank you for your hard work, dear readers who have made it all the way here. The hand you held the book with must be feeling heavy, no?</p><br/><p>I’m sure you must all have felt the fear of dropping a book on your face when reading while lying down.</p><br/><p>Volume 13 is the first Overlord book in history with a pagecount well in excess of 500. What did you think of the contents? I would be happy if even a small portion of the readers felt it was interesting.</p><br/><p>However, in truth, it might have been better to split it up into a second and third part instead. Reading the whole thing from start to finish really taxes the brains. Reading chapters 4, 5 and then the intermission before going to sleep might be a better pace. How did you read it, everyone? Ah, a major advantage of dividing it into two books would be the opportunity to enjoy more of so bin-san’s lovely illustrations!</p><br/><p>Still, this won’t happen again, so there’s no point thinking about it.</p><br/><p>While I kept saying I want to cut the page count, the length of this book ended up being really rough. As page count increases, all the associated work takes more time too, and the schedule keeps slipping. The probability of wrong words also increases, so it seems like there are pretty much no upsides to it.</p><br/><p>Next time, I’d like to write a book that’s easier on both the author and the audience.</p><br/><p>Now then, while I did say the next volume is in 2019, I’m planning to write something very long before that, so I don’t know how things will actually turn out. Relaxing and waiting helps a lot. The third season of the anime will also come out during that time, so I hope you’ll all enjoy it.</p><br/><p>But in truth, I’ve pretty much run out of things to put into the afterword. In the past, when I was a reader and saw the author say he didn’t know what to write, I would think “just write whatever you want”. Now that I’m in the same situation, I can understand what they had to deal with. What would you all write if you were in my position? Honestly… the idea that I don’t need to write these afterwords any more is starting to grow on me!</p><br/><p>Now then, I’d like to thank everyone who helped me with this volume. I look forward to working with you in future.</p><br/><p>2018 April Maruyama Kugane</p><br/><p>Character Sheets</p><br/><p>Neia Baraja</p><br/><p>Vicious-eyed Fanatic</p><br/><p>Vocation: Squire of the Holy Kingdom Liberation Army</p><br/><p>Residence: Prime estate in Hoburns (her family home)</p><br/><p>Class levels:</p><br/><p>Paladin – 2 lv</p><br/><p>Sacred Archer 3 lv</p><br/><p>Evangelist 2 lv</p><br/><p>Founder 4 lv</p><br/><p>Birthday: 1st day of the Upper Wind Month</p><br/><p>Interests: Telling everyone about how wonderful the Sorcerer King is</p><br/><p>Since her character has changed radically, she will be re-introduced. She lost levels from dying, but at the same time she gained levels from surviving the war. Her current character build is the result of losing levels in Servant. She has many incompatible class levels, but given her experiences, this was the only way she could have turned out, no? Neia has not yet realised that she is using a special ability to guide the thoughts of others (AKA brainwashing). Currently, her ability only works on people with emotional trauma, but Neia’s words can save them.</p><br/><p>Kelart Custodio</p><br/><p>Face of an angel, heart of a demon</p><br/><p>Vocation: Highest-ranked priestess in the Holy Kingdom and the head of the priest corps.</p><br/><p>Residence: Prime estate in Hoburns (her family home)</p><br/><p>Class levels:</p><br/><p>Priest – ?lv</p><br/><p>High Priest – ? lv</p><br/><p>Hierophant – ? lv</p><br/><p>etc.</p><br/><p>Birthday: 11th day of the Upper Water Month</p><br/><p>Interests: Observing people (both the good and bad implications)</p><br/><p>In terms of pure divine spellcasting ability, she is the most powerful in the region, surpassing even Blue Rose in that respect. However, this is a national secret, so almost nobody knows about it. She cherishes her family and her best friend (Calca), and she is more aggressive towards people hostile to them than her sister, and she even enacts ruthless, cruel revenge on them at times. She is almost always seen with a smile on her face, but that is little more than a facade. She is always looking for a chance to bring down the nobles who are Calca’s enemies, and one can call her the most frightening woman in the Holy Kingdom.</p><br/><p>Caspond Bessarez</p><br/><p>The kind prince</p><br/><p>Vocation: Royalty of the Holy Kingdom</p><br/><p>Residence: Hoburns Royal Palace</p><br/><p>Class levels:</p><br/><p>Cleric – ?lv</p><br/><p>Sage – ? lv</p><br/><p>High Noble (normal) – ? lv</p><br/><p>etc.</p><br/><p>Birthday: 27th day of the Lower Fire Month</p><br/><p>Interests: Reading (he seems to like history in particular)</p><br/><p>Caspon is an excellent individual, and after realising he could not surpass his even more outstanding sister, he equipped himself with the knowledge to survive in noble society. He had no interest in conflicts over the bloodline, so he ended up yielding his birthright to his little sister. While he does not regret that decision, whether or not he truly accepts his sister’s actions remains in question. In truth, if he had become the Holy King, he would have been better suited to the throne thanks to his willingness to perform underhanded actions. He is is one of the rare few members of the royal family that Kelart does not hate.</p><br/><p>Gustav Montagnes</p><br/><p>Stomach pains are just something you get used to</p><br/><p>Vocation: Deputy commander of the Holy Kingdom Liberation Army</p><br/><p>Residence: Prime estate in Hoburns</p><br/><p>Class levels:</p><br/><p>Paladin – ?lv</p><br/><p>Holy Knight – ? lv</p><br/><p>Charisma (normal) – ? lv</p><br/><p>etc.</p><br/><p>Birthday: 27th day of the Lower Wind Month</p><br/><p>Interests: He likes small animals</p><br/><p>Of the two vice-captains of the paladin corps, his sword skills are inferior, and as a result he is closer to the common man than the other one (though he’s still strong enough that an ordinary person could never defeat him). He gets stomach pains often, but he is very grateful for the fact that magic can cure that easily, so he is thinking of learning divine magic. He bought a house so that he could let his pet Bunnias — which are rabbits that look like squirrels — run free. His pets’ names are Milshe-chan and Amonna-chan, and they are important beings that soothe his weary soul.</p><br/><p>Beebeezee (Type: heteromorph)</p><br/><p>Sparkling Amethyst Body</p><br/><p>Vocation: Prince of the Zern</p><br/><p>Residence: One of the thousand sinkholes in the northern Abelion Hills</p><br/><p>Class levels:</p><br/><p>Zern Lord (racial) – ? Lv</p><br/><p>Gogyoutsukai (Five Elements User) – ? Lv</p><br/><p>Yin Master – ? lv</p><br/><p>etc.</p><br/><p>Birthday: 98th of Winter</p><br/><p>Interests: Listening to stories.</p><br/><p>His race has very few males. Therefore, any males who are born are immediately elevated to royalty. Due to their great importance, they are not allowed outside their nests, and it is quite normal for them to spend their lives in a state of house arrest. Thanks to being praised constantly by the masses, he has developed great confidence in his body, to the point of narcissism. Incidentally, his species type is not an error. The Zern have a racial weakness wherein they are affected by spells that are only effective against specific races, hence their mis-classification as demihumans. They are actually heteromorphs.</p><br/><p>Bellriver</p><br/><p>Big Eater</p><br/><p>As a magic swordsman, he was the type who switched between swords and spells. However, he was a jack of all trades but a master of none, so during the guild’s glory days, he was often a second-choice pick as a party member. That said, he was good in a fight, and his ability as a gamer was quite high. In the real world, he learned some ominous information about the megacorporations which ruled the world and was killed in an accident to seal his lips. The information he possessed made its way into the hands of a certain someone.</p><br/><p>Credits</p><br/><p>Volume 13 could not have been translated into English without the help of the tremendously industrious workers on Baidu, who sacrificed their time, sleep and health to turn 552 pages of Maruyama’s prose into Chinese, which I could process much faster. Without further ado, these are the people who made it possible.</p><br/><p>And of course, turning it from CN to EN would not have been possible without the following people, who spotted all the mistakes I glossed over because I was TLing shit at 2 AM in the morning or in between battery replacements at work:</p><br/><p>Aardvark</p><br/><p>Illya</p><br/><p>Ainz</p><br/><p>Perdi</p><br/><p>MPT</p><br/><p>MNH</p><br/><p>Dasray_1911 (sorry I missed you out)</p><br/><p>And the many, many people who emailed in corrections so I could take action on them. Thank you all, and enjoy Season 3!</p><br/>\n</div>"}