{"title": "Chapter 95 - Volume 13", "id": 95, "volume": 13, "url": "http://boxnovel.org/overlord-ln-chapter-95-volume-13", "volume_title": "Volume 13", "body": "<h1>Chapter 95 - Volume 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 class=\"post-title entry-title\">Overlord Volume 13 Chapter 6 <b>Gunner and Archer</b></h3><div class=\"post-body entry-content\" id=\"post-body-1642182597407094846\"><div class=\"western\"><b>Part 1</b></div><div class=\"western\"></div><div class=\"western\">After leaving Caspond’s room, the first place Neia went was the archery range. Neia’s subordinates had been waiting there and they immediately flocked to her.</div><div class=\"western\">As her friends went, “How did the meeting turn out, Miss Baraja?” “We’re always ready to go,” and other such things, Neia told them about the meeting.</div><div class=\"western\">She told them everything ― what had happened, what had been said, and the conclusions they had reached.</div><div class=\"western\">Most of them hunted for a living, and they were all excellent outdoorsmen. Even they could not help but nod grimly at Caspond’s conclusion. There was no doubt that searching the Hills would be extremely difficult.</div><div class=\"western\">That being the case, an early dispatch of a search party seemed impossible. However, they could conduct a simple search within the Holy Kingdom ― heading east from this place to the fortress line. Since it was unclear where the Sorcerer King had landed, he might be within the Holy Kingdom’s borders.</div><div class=\"western\">Several people skilled in ranger techniques stepped forward.</div><div class=\"western\">Neia wanted to take part as well, but she had practically no ranger skills, so she would only get in the way if she accompanied them.</div><div class=\"western\">This was an operation to rescue a righteous king who had reached a helping hand out to save the people of another country. As his squire, not being able to go felt like disloyalty, and it gnawed at Neia’s heart.</div><div class=\"western\">She felt like screaming the way she had done at Remedios, but nothing would come of it even if she did so.</div><div class=\"western\">Neia told everyone that they had received Caspond’s permission to search within the Holy Kingdom’s borders, but she could not take part herself.</div><div class=\"western\">“Leave it to us, Miss Baraja.”</div><div class=\"western\">“Ahhh. We’ll keep our eyes open while searching for His Majesty. We won’t miss a single clue about our great benefactor!”</div><div class=\"western\">“Alright, everyone. Once the Prince gives his permission, I, I’ll be counting on all of you!”</div><div class=\"western\">Neia bowed deeply to them.</div><div class=\"western\">“Miss Baraja, what will the rest of us do? How can we be useful to the Sorcerer King?”</div><div class=\"western\">As everyone looked at her with zeal in their eyes, Neia was filled with delight.</div><div class=\"western\">They did not think that the Sorcerer King was dead, even after witnessing that scene.</div><div class=\"western\"><i>That’s right! How could His Majesty be dead! I’m sure, I’m sure he must be waiting for us to rescue him… I think.</i></div><div class=\"western\">Neia could not imagine a scenario where that supreme being would wait for these people to rescue him. For all she knew, they would probably find him elegantly sipping a glass of fine wine in front of a pile of demihuman and demon corpses.</div><div class=\"western\">“Alright! Then everyone who’s left will start training, because weakness is a sin!”</div><div class=\"western\">Indeed, that was all Neia could do now. She had to become strong enough to be of some small use next time. If she and her people had been strong enough, the righteous Sorcerer King would not have ended up like this.</div><div class=\"western\">“Ohhhh!”</div><div class=\"western\">She received a spirited answer. That was because everyone understood what Neia meant when she said, “The Sorcerer King is justice and weakness is a sin.” Not many people had agreed with those words when this unit had first been formed, but after mingling with them, more people had come around to her point of view.</div><div class=\"western\">“Then I’ll go see the Prince!”</div><div class=\"western\"></div><div class=\"western\">After speaking directly with Caspond, the search party was quickly granted permission to move out. They had left on the day itself, and three days had passed since then.</div><div class=\"western\">While things might have gotten troublesome if the members of the search party had not been of one mind, the fact was that all of them had been chosen because they agreed with Neia’s proposal, and so they had left without delay.</div><div class=\"western\">While rumors of taking back Kalinsha had circulated through the city during these three days, the Liberation Army had not actually made any moves and merely let time pass aimlessly. The exception was Neia and the increasing number of people who had come to accept the Sorcerer King as justice ― they diligently applied themselves to their training</div><div class=\"western\">Neia let loose an arrow at the target, an irritated look on her face.</div><div class=\"western\">Her anxiety and anger had probably made her hands slip, because the arrow embedded itself just slightly off the center of the target.</div><div class=\"western\">Normally, someone would have come over to lightly chide Neia, but nobody dared address Neia now.</div><div class=\"western\">The reason for that was Neia’s face.</div><div class=\"western\">Her anxiety over not being able to do anything for the Sorcerer King and a lack of sleep due to a lack of news meant that the area around her eyes was swollen and discolored, which made her look horrible, especially when one factored in the wrinkles between her brows as well. Since she typically concealed her face with her visor, it had a great impact on others when she removed it.</div><div class=\"western\">While Neia’s subordinates keenly understood how she felt, nobody dared come near her.</div><div class=\"western\">―<i>Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your Majesty, Your―</i></div><div class=\"western\">These words tumbled round and round in Neia’s head.</div><div class=\"western\">“―Ahh, honestly.”</div><div class=\"western\">The shoulders of all the archers around Neia trembled as they heard those quiet words.</div><div class=\"western\">―<i>Majesty. No. I need to calm down. Calm down. It’s only been three days! Just the eastern region of the Holy Kingdom is large enough as it is! You don’t want to scare the others, do you?</i></div><div class=\"western\">Neia took off her visor ― and heard something like a strangled scream from someone who had happened to look her way ― then massaged her temples lightly as she tried to relax her stiff face.</div><div class=\"western\">Just then, Neia heard two sets of footsteps running towards the archery range. Given that she could hear a metallic clinking which was unique to chain shirts, they were not militiamen who had come here to train. Paladins wore armor of metal plates, so it could not have been them either. They were probably somewhat higher ranked soldiers or colleagues (squires).</div><div class=\"western\">“Squire Neia Baraja!”</div><div class=\"western\">When Neia turned to face the people who had barged in, the two men who had shown up simultaneously stepped back and cried out.</div><div class=\"western\">“What, what’s going on? Did something happen?!”</div><div class=\"western\"><i>Weren’t you the ones with something to say?</i> Neia thought as she replied:</div><div class=\"western\">“Ahh, it’s been a while. That’s the usual reaction… no, maybe it’s a little more than the usual reaction?”</div><div class=\"western\">These two people were also squires, and they had been trained alongside Neia. That said, she knew next to nothing about their characters since she had barely spoken to them, but at the very least she still remembered their names and faces.</div><div class=\"western\">If Neia knew them, then they must also have known Neia. That would mean they ought to have been used to Neia’s murderous eyes. Even so, the fact that they had reacted this way showed how terrifying Neia’s face was now.</div><div class=\"western\">Speaking of which, Neia recalled that they too had been freed from prison camps.</div><div class=\"western\">“Ah, yes. I usually don’t look like this ― like I hate the entire world… I think. No, am I usually like that?”</div><div class=\"western\">Neia rubbed her face and mused that maybe she should not take off the visor.</div><div class=\"western\">“…Ah, sorry. It seems you need me for something. What is it?”</div><div class=\"western\">“Ah, no, Prince Caspond is looking for you. Please report to him right away.”</div><div class=\"western\">“Prince Caspond?”</div><div class=\"western\">Why was he looking for her? She had a few ideas, but she did not know which one was correct, so all she could do was pray that he was seeking her out for a good reason.</div><div class=\"western\">“I understand. Please tell him I’ll be coming right away.”</div><div class=\"western\">However, they did not look like they were leaving, even after she had given her answer. It puzzled Neia.</div><div class=\"western\">“What is it? Is there anything else?”</div><div class=\"western\">“No, it feels a little ― well, it’s not your face, but maybe it’s the air around you? It feels like the air around you has changed. I know I can’t express it too well in words…”</div><div class=\"western\">“Well, I’d be glad if it was a good change… but we’re all going to change. We’ve all been through so much.”</div><div class=\"western\">“Ahh, yes. You’re right. It’s just like what you said, Baraja.”</div><div class=\"western\">The two of them smiled tiredly. She did not know whether they had bought it. They said, “We’ll talk again some other time,” and then they left.</div><div class=\"western\">Neia told her subordinates looking at her about how she was going to see Caspond, and then she headed out.</div><div class=\"western\">Caspond still stayed in the same building as before, but he was in a different room now.</div><div class=\"western\">That was because Jaldabaoth had smashed a huge hole in the previous room’s wall when he had shown up.</div><div class=\"western\">Nobody stopped her on her way to the room, even with her visor on, and she reached it with no problems.</div><div class=\"western\">During this time, nobody had asked her to leave behind the bow on her back either. There was no telling if it was because they trusted her, or because they were mindful of the fact that the bow had been borrowed from the Sorcerer King.</div><div class=\"western\">“Prince Caspond, this is Squire Neia Baraja reporting.”</div><div class=\"western\">Caspond was sitting inside the room, and two paladins stood beside him ― Remedios and Gustav. Neia immediately fell to one knee.</div><div class=\"western\">“I’m glad you came. We’ve been waiting for you. Ahh, that’s fine. Don’t worry about it, just stand up.”</div><div class=\"western\">Neia stood as requested, and then asked:</div><div class=\"western\">“I apologize for keeping you waiting. May I know your bidding?”</div><div class=\"western\">“Before that, remove the item covering your face, Squire Neia Baraja.”</div><div class=\"western\">Those matter-of-fact words came from Gustav. Common sense indicated that she ought to have done so.</div><div class=\"western\">“Yes! Please forgive me.”</div><div class=\"western\">After Neia removed her visor, Gustav’s eyes widened slightly.</div><div class=\"western\">“…Ah, are you not feeling well? Would you like the priests to examine you?”</div><div class=\"western\">“No, I don’t feel that bad yet.” Since explaining was troublesome, Neia decided to press on. “…Now then, may I ask what’s the matter?”</div><div class=\"western\">“Well, about that… well, there’s one more person who will be joining us besides the four of us here. I’m going to get them now, so don’t be too shocked, alright?”</div><div class=\"western\">She could see a look of distaste on Remedios’s face from the corner of her eye. If it could put a look of disgust on the Captain’s face, it was probably related to Jaldabaoth. And then the word “maid demon” suddenly came to Neia’s mind.</div><div class=\"western\">After hearing Caspond’s order, Gustav opened a side door and spoke to the person within.</div><div class=\"western\">And then, a monster emerged before them. Neia knew what species it was.</div><div class=\"western\">It was a Zern.</div><div class=\"western\">While it was a species with a shiny carapace, its appearance was not offensive. However, there was a faint, almost imperceptible smell of bloodshed surrounding it.</div><div class=\"western\"><i>What’s a demihuman like that doing here?</i> Neia wondered. Caspond seemed to sense this, and he spoke.</div><div class=\"western\">“She is an envoy.”</div><div class=\"western\"><i>So Jaldabaoth’s envoy is here, is that it?</i> Neia unconsciously let her hostility show, and the Zern twitched like it was going on the defensive.</div><div class=\"western\">“Hold it, Squire Baraja. It seems you are slightly mistaken. She is not Jaldabaoth’s envoy. It is the opposite. She is an envoy of those people who plan to rebel against Jaldabaoth.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">Neia could not help exclaiming in surprise. Caspond seemed to have expected that response, and laughed.</div><div class=\"western\">“You look surprised. Well, that’s only to be expected. Surely you didn’t expect anyone to rebel against Jaldabaoth’s subjugation of the demihumans, did you? However, there are people like that. According to the envoy-dono, not all demihumans serve Jaldabaoth wholeheartedly. For instance, these Zerns. There are other species like the Zern who have no choice but to help Jaldabaoth because their ruling class ― their royal family ― was taken hostage. What they want is to rescue those hostages.”</div><div class=\"western\">“Precisely.”</div><div class=\"western\">Neia had never heard that female voice before and it startled her. She looked around the interior of the room. Finally, just as she was about to go “no way,” her eyes landed on the Zern. That voice would have sounded perfectly fine coming from a human being.</div><div class=\"western\">From where on its repulsive body did its human-like voice come from?</div><div class=\"western\">Was this a special ability of the Zerns, or was it a kind of magical power?</div><div class=\"western\">“The city you humans call Kalinsha, which is five days’ travel to the southwest, holds someone important to us. We ask that you save him.”</div><div class=\"western\">Neia conjured up a map of the Holy Kingdom in her head.</div><div class=\"western\">From her previous words, the city of which the Zern spoke was indeed Kalinsha. Of course, it was closer to west-south-west than the southwest and she wondered if travelling there would really take five days, but everything else was within the margins of error.</div><div class=\"western\">However, there was one thing she did not understand. Why were they telling Neia about this?</div><div class=\"western\">However, before Neia could contemplate the reasons for that, Caspond said something shocking.</div><div class=\"western\">“That is why we have decided to ally with them to fight against Jaldabaoth, Miss Baraja.”</div><div class=\"western\"><i>Ehhh?</i> Neia could not help but doubt her ears. Could they trust a species like the Zern, monsters who did not even have facial features to read?</div><div class=\"western\">“While we were forced to bow to Jaldabaoth’s power and invaded this place as part of his army, we received news that our king, who was being held hostage in the Abelion Hills, was killed by demons. As for the other one, the prince who’s being held prisoner as a symbol of our submission… now that the previous king has been killed, he is our new king. If you rescue him, we will help you.”</div><div class=\"western\">Did they kill him because they did not need two hostages? Or was there a more fiendish reason for the killing? While she could not read that deeply into matters, it would seem the important thing was that their king had been killed.</div><div class=\"western\">“That said, we are preparing to take our new king somewhere that Jaldabaoth cannot reach, so our most elite royal guard will not be able to help you. However, the remaining three thousand or so of our warriors that Jaldabaoth brought along will fight by your side. Our species will not die out as long as there is a king and a single female, so you may use those warriors as you wish. There will be no problems even if they are all killed.”</div><div class=\"western\">“That’s how it is. You also know the conditions I’ve laid out in order to triumph against Jaldabaoth. Rather than decreasing the demihumans numbers with combat, we will take fewer losses if we persuade them to leave his side. Also, they have provided us with important information, and we have finished verifying it.”</div><div class=\"western\">Caspond smiled, and then continued.</div><div class=\"western\">“From what we know, this news is not a trap set by Jaldabaoth. On the contrary, this is something we can use to deal with the Zern. If Jaldabaoth finds out, they will be purged, and their prince ― the new king ― will also be killed.”</div><div class=\"western\"><i>That’s what’ll happen to you if you betray us,</i> Caspond was threatening the Zern.</div><div class=\"western\">Although it was only natural for anyone in a high position to think like that, the fact that Caspond could ruthlessly describe such a development frightened Neia a little.</div><div class=\"western\">However, once the calm returned to Neia’s heart, a question boiled up inside her. Namely: why had he brought her here to listen to their planning? If he wanted Neia to take part in the rescue, all he would have to do was give her an order. It was true that Neia was now a unit commander, but ultimately she was just a squire who was somewhat skilled with the bow. There was no need to explain the operation to her in such detail. And not just that―</div><div class=\"western\"><i>…Ah, don’t tell me that they still regard me as His Majesty’s squire? I mean, I’m halfway to being a citizen of the Sorcerous Kingdom already, right? They probably mean that the Sorcerer King would also be listening to this under normal circumstances. Or maybe they want me to explain this to the Sorcerer King when we see him again, is that it?</i></div><div class=\"western\">Indeed. Neia was still the Sorcerer King’s squire.</div><div class=\"western\">Neia puffed up her chest, and Caspond was slightly surprised at the sudden change in her attitude.</div><div class=\"western\">“Now then. With regards to rescuing the Zern prince, we have reached the decision that rescuing him during the chaos of attacking Kalinsha will be very difficult.”</div><div class=\"western\">“Indeed,” the Zern followed up on Caspond’s words. “Let me tell you where the prince is being held. Vice-Captain, I hope you will help clarify details for me.”</div><div class=\"western\">The Zern launched into an explanation with Gustav as backup.</div><div class=\"western\">First of all, the great city of Kalinsha occupied the top of a hill. It was under the direct administration of the royal family and was protected by thick walls. On its west, near its highest point, was Castle Kalinsha.</div><div class=\"western\">It was intended to hold the demihumans at bay should the fortress line be breached, and at the same time it was near a major trade route leading to the south. Therefore, it was more sturdily built than any other city in the Holy Kingdom.</div><div class=\"western\">In addition, Kalinsha’s seldom-used castle was very solidly-built in order to withstand sieges.</div><div class=\"western\">The imprisoned Zern prince was held within one of the towers of the castle. Since he was in the innermost of the towers that were intended for last-ditch defenses, one could say it was the hardest place in Kalinsha to infiltrate.</div><div class=\"western\">It did not even have windows, in order to protect against aerial attack, and one could not reach it without travelling down an aerial walkway.</div><div class=\"western\">This tower was now inhabited by a powerful guardian ― a member of the water-using Ogrekin known as Vah Uns. The Zerns were not allowed to go near it, lest something happen to their prince if they did.</div><div class=\"western\">However ― provided their treachery was not exposed ― if the guards saw humans ― who were not related to the Zerns ― they would not harm the prince. In fact, they would protect the prince instead. That was what they meant by borrowing the strength of humans.</div><div class=\"western\">“But once the actual fighting begins, if the prince is still imprisoned, we will have no choice but to kill you humans. Since all our fellows who were brought to this land are present…”</div><div class=\"western\">The Zern’s words started to lose coherence, but everyone understood their meaning.</div><div class=\"western\">It would be too late by then.</div><div class=\"western\">There was value in rescuing the prince because the Zerns were enemies of mankind. If the Zern were all wiped out, then there would be no need to rescue the prince.</div><div class=\"western\">“It’ll be too late to send reinforcements once the fighting begins. Therefore, the safest and most effective way to rescue the prince is to send a group of elite warriors who will move as stealthily as possible. Squire Neia Baraja, I would like you to command this operation.”</div><div class=\"western\">“I cannot. It is impossible for me.”</div><div class=\"western\">Neia responded to Caspond immediately.</div><div class=\"western\">Normally, gainsaying the prince ― who was her supreme commander ― would not be tolerated, both in terms of military discipline and social conventions, but at the same time, that order was truly ridiculous. It was simply too much, no matter how you looked at it.</div><div class=\"western\">“I knew you would say that. However, Miss Baraja, this matter is of great benefit to you as well,” Caspond narrowed his eyes. “They will furnish us with knowledge about the hills and introduce reliable guides there.”</div><div class=\"western\">Neia gulped.</div><div class=\"western\">She bit her lip, desperately trying to keep a lid on her emotions.</div><div class=\"western\">“…How much trust can we place in those words?”</div><div class=\"western\">“Once you rescue the prince, the Zerns will respond by rising up in revolt from the inside, at which point retaking Kalinsha will be much simpler. It’s certainly better than a conventional siege, and we will be able to take more demihumans prisoner. The Zerns also say that they will ask around to see which prisoners have the knowledge you desire.”</div><div class=\"western\">“I’m not too sure about the details,” the Zern added on to Caspond’s words. “It seems you wish to travel to the Abelion Hills. If you rescue our prince unharmed, our entire species will be indebted to you. Who would refuse to share what they know with a benefactor? In addition, that knowledge is nothing special.”</div><div class=\"western\">The Zern’s argument was utterly irrefutable.</div><div class=\"western\"><i>Refusing them would mean being disloyal to His Majesty. If I let a chance to be useful to His Majesty slip out of my hands because I’m afraid…</i></div><div class=\"western\">After calmly considering the matter, she felt that this was her best chance. However ― she did not intend to kill herself.</div><div class=\"western\">“Who else will be going on the mission to rescue the prince?”</div><div class=\"western\">Neia looked at Remedios, who had been silent all this time.</div><div class=\"western\">“I’m not going. I can’t infiltrate or anything.”</div><div class=\"western\"><i>If you say that, then what about me?</i> Neia thought, and then she looked silently to Caspond.</div><div class=\"western\">“…I asked her to go with you several times, but she kept refusing. Therefore, you will be accompanied by that captive… no, that collaborator.”</div><div class=\"western\">“Hmph. Captive will do.”</div><div class=\"western\">“…Captain.”</div><div class=\"western\">“It doesn’t matter. Vice-Captain Montagnes, can you bring her over?”<br/><p>Montagnes left the room with a “Yes.” The Zern envoy left the room as well. It would seem they did not want to let others know that they were working with the humans.</p></div><div class=\"western\">Gustav returned before long, but he was not alone. He had with him a girl wrapped in layer upon layer of chains, a girl that Neia had never seen before. She seemed more petite, delicate and younger than Neia.</div><div class=\"western\">She wore a scarf that blended the colors of dark green and sand yellow in a complex pattern, as well as a strange maid’s outfit.</div><div class=\"western\">Her facial features were exquisite, and even the patch that covered one of her eyes did not diminish her beauty.</div><div class=\"western\">Neia suddenly remembered what Evileye had said, and while she was quite sure who this person was, she decided to ask just in case.</div><div class=\"western\">“My Prince, who is this?”</div><div class=\"western\">“…Haven’t you already guessed? She’s one of the maid demons who showed up in this city.”</div><div class=\"western\">Neia went stiff. She had thought as much, but it still startled her. She was difficulty rating 150. In other words, she was a monster among monsters. A being which humanity could not overcome now stood before her eyes.</div><div class=\"western\">However, Neia also sensed something else that startled her.</div><div class=\"western\">That was the fact that she could still feel such intense hatred with an unbeatable monster in front of her.</div><div class=\"western\">How could she hold on to such emotions when facing a creature that outclassed her so tremendously? Was it because this maid demon was not radiating an aura of fear, or was it because of her loyalty to the Sorcerer King?</div><div class=\"western\">Regardless of which it was ― Neia sank her hatred for the maid demon into the depths of her heart and did not let it show.</div><div class=\"western\">If she was careless, she would start berating her as one of the reasons why such an outstanding monarch like the Sorcerer King lost to Jaldabaoth.</div><div class=\"western\">However, while Remedios had her hand on the hilt of her holy sword, Caspond and Gustav did not seem to be doing anything special on their part.</div><div class=\"western\">Therefore, Neia could conclude that she did not pose any immediate danger. Otherwise, they would never allow her to stay in the same room as the prince.</div><div class=\"western\">“…Murderer girl. Do not be afraid. Right now I am not sworn to Jaldabaoth, but to Ainz-sama. I will not attack.”</div><div class=\"western\">“I don’t believe you.”</div><div class=\"western\"><i>Ainz-sama.</i> That term of address filled Neia’s heart with displeasure, as if she was trying to reject the fact that it had been said. However, the maid demon replied to her in a monotone.</div><div class=\"western\">“…You do not have to believe me. It is simply the truth.”</div><div class=\"western\">“Miss Baraja. It seems that His Majesty somehow managed to usurp control over her from Jaldabaoth during the battle.”</div><div class=\"western\">Neia’s eyes went as wide as saucers.</div><div class=\"western\">Had he actually managed to carry out a nonlethal tactic like taking control of her while fighting multiple opponents ― Jaldabaoth and the maid demons?</div><div class=\"western\">Neia did not know much about magic, and she did not know how difficult such a feat was. If one needed an example, it would be like trying to snatch equipment off a very powerful opponent during the middle of combat. If that was the case, then it must have been an incredibly difficult maneuver which only the Sorcerer King could pull off.</div><div class=\"western\">Neia came to respect the Sorcerer King more and more.</div><div class=\"western\">However, she had two questions now.</div><div class=\"western\">She wanted to believe that if the Sorcerer King had done it, then everything would be fine and she could accept that fact. But was the maid really under the Sorcerer King’s control? That was the first question. Could it be that she was not actually working for the Sorcerer King, but acting under Jaldabaoth’s orders to pretend that she was under his control?</div><div class=\"western\">And then, the other question was―</div><div class=\"western\">“I understand that you’re loyal to the Sorcerer King. But why are you here? Is it because of your chains?”</div><div class=\"western\">“…It’s not like that.”</div><div class=\"western\">The maid demon began to exert her strength, and the thick chains emitted a distasteful creaking sound.</div><div class=\"western\">“Stop that!”</div><div class=\"western\">As Remedios shouted in time with a wave of killing intent, the sound stopped.</div><div class=\"western\">“…Even I could break ordinary unenchanted chains.”</div><div class=\"western\">“Then why? Why haven’t you left this place and gone to His Majesty’s side?”</div><div class=\"western\">She had asked because she was hoping that demonic instincts or the abilities of a bound demon would lead her to the Sorcerer King. The maid demon flatly replied:</div><div class=\"western\">“…Because it’s an order. The last order I received from him was to help you. So I will do my best as long as it does not mean my death.”</div><div class=\"western\">“Eh!?”</div><div class=\"western\">Neia was stunned.</div><div class=\"western\"><i>…The Sorcerer King came to this country to seize control of the maid demons. He came to obtain the maid demons, a tremendous fighting force that could make the Sorcerous Kingdom even stronger. In that case, his first order to the maid demon should have been for them to return to the Sorcerous Kingdom. But instead, His Majesty… What a kind person he is… Is there a king out there who is so compassionate to the people of another country? No, it can’t be, only the Sorcerer King is an exception. His Majesty really is justice! How amazing! I was right all along!</i></div><div class=\"western\">Neia struggled to keep the heat from spilling out of her eyes.</div><div class=\"western\">“In that case, what does “as long as it does not mean my death” refer to?”</div><div class=\"western\">“…If you ask me to fight Jaldabaoth I will refuse. It will be very difficult to escape if I face him.”</div><div class=\"western\"><i>I see,</i> Neia understood. Caspond had already verified the truth of everything she had said. That was why she had been brought here.</div><div class=\"western\">“So this demon will come with me.”</div><div class=\"western\">“Just so. While I thought of sending her to the Sorcerous Kingdom as an envoy, compared to that ― ah ― well, once that’s over and we learn information that we can trade, ah ― I was planning to have her join the search party we’re sending out. That’s because it’s dangerous… Those people you picked out haven’t found anything yet, so we can be sure that he landed in the hills.”</div><div class=\"western\">She did not know why Caspond’s instructions were so vague.</div><div class=\"western\">She peeked at the maid demon’s face and saw that it had not changed. She did not look worried.</div><div class=\"western\">Of course, this maid demon might not know what had happened to the Sorcerer King, and she probably could not imagine that the Sorcerer King was in dangerous territory. However, her blank face still made Neia very unhappy.</div><div class=\"western\">Most importantly, could she let a demon like that use a familiar term of address like “Ainz-sama?”</div><div class=\"western\"><i>No, of course not!</i> Neia fumed. Not even she had addressed him in such an intimate manner.</div><div class=\"western\">“―iss Baraja?”</div><div class=\"western\">“Ah, yes!”</div><div class=\"western\"><i>Oh no!</i> Neia’s face was slightly red. She had apparently forgotten herself due to her distaste for the maid demon.</div><div class=\"western\">“What’s the matter? Is something bothering you?”</div><div class=\"western\">“Ah, no! It’s been only three days since the search started, so I think it might be a bit hasty to conclude that he fell there…”</div><div class=\"western\">“I see. That does make sense. However, would it not be better to be prepared for anything?”</div><div class=\"western\">“That is true.”</div><div class=\"western\">“Alright. In that case, maid demon-kun. This is the third time I have spoken to you. The day we found you, yesterday, and now.”</div><div class=\"western\">The maid demon said nothing and looked at Caspond.</div><div class=\"western\">“If I asked you to go to a certain large city to rescue someone imprisoned there, would you help us?”</div><div class=\"western\">“…It is like I said yesterday. I will.”</div><div class=\"western\">“Ahh, good, I understand. Then, I apologize for this, but would you mind returning to your room? Vice-Captain Montagnes, if you would.”</div><div class=\"western\">He led the maid demon away, and they began speaking again once Gustav returned.</div><div class=\"western\">“Miss Baraja. While I do not know if I need to tell you all this, possessing this information might mean the difference between success and failure when you infiltrate Kalinsha. Therefore, I will speak to you about a few things. The first concerns Jaldabaoth.”</div><div class=\"western\">Caspond told her what they had learned from the maid demon.</div><div class=\"western\">It would seem she knew little about Jaldabaoth. Practically nothing, in fact. She did not even know what abilities or attacks or weaknesses he possessed. In addition, she did not know what Jaldabaoth was doing now or what his objective was.</div><div class=\"western\">However, she had said that he would need a very long time to recover if he was severely injured. It was like how it would take longer to refill a larger vessel when the water level inside it decreased.</div><div class=\"western\">And so, after learning about Jaldabaoth, the demihumans, and the other demons, Neia asked Caspond the question whose answer she wanted to know most of all.</div><div class=\"western\">“Can we trust her?”</div><div class=\"western\">“We can’t. We should kill her to be safe.”</div><div class=\"western\">That answer had been supplied by Remedios.</div><div class=\"western\">Neia resisted the urge to ask if she could beat a difficulty 150 maid demon, and listened to Caspond’s judgement.</div><div class=\"western\">“I find it hard to trust her. This might be one of Jaldabaoth’s schemes. She might be a spy sent out in case someone like Momon appears, someone who can fight back against Jaldabaoth.”</div><div class=\"western\">That was why they had asked the Zern envoy to leave before bringing the maid demon in, and had spoken obliquely in front of her.</div><div class=\"western\">“I told you, right? It would be better to kill her. That way there’ll be one less thing to worry about.”</div><div class=\"western\">“I see, Captain Custodio. That is an option. However, it is very likely that the maid demon is indeed under the Sorcerer King’s control. That is because she has not been spouting false information about Jaldabaoth nonstop, but replying that she does not know. However, why is she not asking about the Sorcerer King at all… Umu. Still, you agreed to hand the rights to the maid demons over to him, did you not? Since you did that, once they find out we killed her, they will regard our country as incapable of keeping its promises, you know? Once that happens, no other countries will want to help if anything happens to us.”</div><div class=\"western\">“He’s already been killed by Jaldabaoth, hasn’t he?”</div><div class=\"western\">Remedios’s words made Neia look down as she struggled to bite back her anger. Thanks to Remedios, she felt like she had gained the ability to better manage her emotions.</div><div class=\"western\">“We cannot be sure about that. That is why I feel we need to test and use her during the rescue of the prince. If she betrays us and leaks the information, then only the Zern will be eliminated, which will reduce the number of demihumans. We will also be able to root out the rat among us. These are the two merits of this option. And of course, if we succeed, we can simply rejoice.”</div><div class=\"western\"><i>Please don’t forget about the life of the person who will be carrying out the infiltration,</i> Neia grumbled in her heart.</div><div class=\"western\">“Did you ask the maid demon about her own weaknesses? If she betrays us en route, would it not be better to have some way to deal with her?”</div><div class=\"western\">“We didn’t ask about anything like that.”</div><div class=\"western\">Caspond smiled bitterly. Neia followed suit.</div><div class=\"western\">Even if she told them, there would be no way to determine if she were telling the truth. They could not tell by looking, and obviously they could not test it out.</div><div class=\"western\">“Well, we’re not the ones who control her. Ultimately, she’s only helping us because the Sorcerer King ordered her to do so.”</div><div class=\"western\">Gustav was still going on about that, but in truth both Caspond and Neia had realized it already. There was probably only one person present who did not understand the situation.</div><div class=\"western\">“So the infiltrators will be myself and the maid demon. Has anyone else been selected?”</div><div class=\"western\">“On that point, if you have nobody else to recommend, then the two of you will go by yourselves.”</div><div class=\"western\">For a moment, Neia looked at Caspond because she thought he was kidding, but his face was serious.</div><div class=\"western\">“Allow me to add to the Prince’s words, but surely an infiltration is best handled by a very small number of people, am I wrong? People getting in the way would be bad news, which is why we have nobody to put forward.”</div><div class=\"western\">While Gustav’s explanation was convincing enough, Neia knew that was not the only reason.</div><div class=\"western\">It was because of Neia Baraja’s situation.</div><div class=\"western\">It would be all well and good if this rescue operation went well. If it failed, all they would lose was an interfering squire who had grown close to the Sorcerer King and one of the Sorcerer King’s minions. In addition, they would lose little even if the maid demon betrayed them. It was perfect.</div><div class=\"western\">In that case ― was it a lie when they said they had asked Remedios to go before? It was also possible that it was not, and they were just trying to minimize their losses.</div><div class=\"western\">Neia exhaled. There could be no other answer. This was a good chance to show her loyalty to the Sorcerer King.</div><div class=\"western\">“I understand. I and her―” she mused that she was probably a female “―The maid demon will go together.”</div><div class=\"western\">“Oh, I see. Then we’ll be counting on you.”</div><div class=\"western\">“Yes!”“Then Vice-Captain Montagnes will draw you a rough sketch of the city. Prepare yourself before you leave. Also, avoid combat if any demons close to Jaldabaoth are present.”</div><div class=\"western\">According to the maid demon and the Zern’s information, Jaldabaoth was served by three great demons. These three demons were―</div><div class=\"western\">The ruler of the Abelion Hills, where the demihumans lived.</div><div class=\"western\">The overall commander of the invasion of the Southern Holy Kingdom.</div><div class=\"western\">The one in charge of three major cities, who teleported between Kalinsha, Rimun, and Prart.</div><div class=\"western\">That seemed to be it.</div><div class=\"western\">Therefore, if she was unlucky, the great demon in charge of the cities would be present.</div><div class=\"western\">The great demon in charge of the cities apparently had no head, and its body was like a withered tree. It was two meters tall and had no wings or a tail. It had clawed hands, and its slender body possessed an unimaginable strength. Also, it lacked a head, but it was still able to sense its surroundings, and similarly it could even read.</div><div class=\"western\">As a demon, it had a truly fiendish physiology.</div><div class=\"western\">Incidentally, the capital of Hoburns was apparently under Jaldabaoth’s direct command, and not that of his aides.</div><div class=\"western\">“May I know who is stronger between it and the maid demon?”</div><div class=\"western\">“In the maid demon’s own words, she does not know.”</div><div class=\"western\">She wanted to see the maid demon’s fighting ability just once. In particular, she wanted to know what weapons she favored and what special abilities she had. If she did not know that, they might suffer an unexpected defeat.</div><div class=\"western\">“The three great demons are both generals and lords. He probably feels that demihumans are not suited for brainwork, so he seems to have set up a dictatorial power structure. Therefore, the great demons handle much of the administration and they have not appointed any successors or substitutes. If you can defeat them, you’ll be able to deal the Demihuman Alliance a devastating blow. “</div><div class=\"western\">“That would satisfy the victory conditions you have laid out, my Prince.”</div><div class=\"western\">“Ahh. Although Jaldabaoth might lead in person once his wounds have recovered… Right now, I don’t think he’ll force himself to take the field. However, if you can take the limbs, then victory will be close at hand even if you do not crush the head. That said, your main priority now is the rescue, so avoid combat if you can.”</div><div class=\"western\">“I understand.”</div><div class=\"western\">“In that case… when will you begin the rescue mission?”</div><div class=\"western\">“I was planning to set out as soon as possible. However, I would like to speak to the maid demon before that.”</div><div class=\"western\">“I see. Then how about in two day’s time?”</div><div class=\"western\">Neia replied in the affirmative and received permission to meet the maid demon. After that, she left the room.</div><div class=\"western\">While she had a heavy burden to bear, her stride was energetic and her face was filled with determination. The flames of madness that came from losing her purpose recently received new direction, and they became a blinding light that illuminated her path.</div><div class=\"western\">There was still something she could do, and her path led to His Majesty. When she thought of it that way, even travelling with a dangerous demon was nothing.</div><div class=\"western\"></div><div class=\"western\">***</div><div class=\"western\"></div><div class=\"western\">The maid demon lived in an average-sized house with a garden. It had probably belonged to a wealthy resident of the city in the past. During the savage takeover of this city, part of the beautiful decorations had been destroyed, and statues which should have been there had been smashed. Still, the house itself was intact, and it did not seem like the cold air outside would leak in.</div><div class=\"western\">Still, even a cheap and crude house could boast that. Every opening that could be considered a window had been boarded up tight, as though whoever did it were determined not to let air flow in ― or out. It smacked of paranoia.</div><div class=\"western\">On the whole, this was a cage, or some kind of isolation unit. It was a place for someone who was nominally a minion of an undead being or a demon, but who was also the subordinate of a hero who had come to save the Holy Kingdom. It was a place which had been built for many purposes, with a sense of impending danger and aversion blended in as well.</div><div class=\"western\">While she wanted to ask what good several loops of chain around the maid demon would do, the Sorcerer King had not yet officially introduced her, so they could not be courteous to her.</div><div class=\"western\">The wall around the house had been hastily repaired, but it lacked the crucial element of a barred gate. Had they taken it away because there was not enough steel to go around? In its place was a hastily-built guard post beside the door that looked like a temporary hut.</div><div class=\"western\">The man standing there was a powerful looking man in full armor, the paladin who had been appointed commander of this place. Neia handed him the scroll which Caspond had prepared.</div><div class=\"western\">The paladin quickly scanned it, then returned the scroll to her while handing over a lit candlestick.</div><div class=\"western\">It was daytime, but the boarded-up windows meant that light could not penetrate inside. According to the paladin, the maid demon did not need light, so the interior was pitch dark.</div><div class=\"western\">Neia went through the door and looked around the desolate garden before heading toward the house. She walked over a shattered brick road, and when she reached the main door, Neia took a deep breath.</div><div class=\"western\">She used the knocker on the door, but there was no response. Neia hesitated, and then tried the doorknob. It was unlocked. She cracked the door open, and peered into the darkened interior. There was no sound from the inside, and it was as silent as a mausoleum.</div><div class=\"western\">After gathering her resolve, Neia entered. There was no light inside, and no servants. Right now, there was nothing in this house but Neia and a difficulty rating 150 demon.</div><div class=\"western\">Sweat beaded on her back. The candle she held shook unsteadily. Everything outside the candle’s small circle of illumination seemed to have been sucked into the darkness.</div><div class=\"western\">“I’m Neia Baraja! I’m here to see you! Where are you!”</div><div class=\"western\">Neia shouted into the darkness, but the darkness did not respond.</div><div class=\"western\">Was she sleeping?</div><div class=\"western\">She shouted again, louder than just now, but there was no response.</div><div class=\"western\">Neia screwed up her determination, and stepped forward.</div><div class=\"western\">This was a two-storey building. It had many rooms, and checking them all would take quite a lot of time. Still, even without doing that, Neia might be able to pick up something with her acute hearing.</div><div class=\"western\">She began with the first floor.</div><div class=\"western\">Neia prepared herself for the worst and took a step forward―</div><div class=\"western\">“―Uwah.”</div><div class=\"western\">Someone called out to her from the side and a face appeared in the light.</div><div class=\"western\">“Aiieeeee!”</div><div class=\"western\">Her shoulders twitched, and she unconsciously backed away from the face that appeared.</div><div class=\"western\">Her back hit a wall with a <i>thud</i>.</div><div class=\"western\">She could not have missed that face. It had appeared beside her as though it had passed through the walls.</div><div class=\"western\">“…Felt surprisingly good.”</div><div class=\"western\">She saw the maid demon through her tear-lined eyes. Her face was blank as she watched Neia panic.</div><div class=\"western\">“Damn demon…” Neia grumbled.</div><div class=\"western\">Was even the Circlet of Iron Will helpless to prevent the feeling of surprise? Her heart was pounding like a drum, and it felt fit to burst. If that was the demon’s aim―</div><div class=\"western\"><i>Nah, it couldn’t be…</i></div><div class=\"western\">“…Why did you come here?”</div><div class=\"western\">“I came here to ask you something. In two day’s time, I want the two of us…”</div><div class=\"western\">It would probably be too dangerous to explain the operation in detail since she did not know how far she could trust her.</div><div class=\"western\">“…To go on a certain mission.”</div><div class=\"western\">“…Got it.”</div><div class=\"western\">“So I think it would be good if we could share what we know and discuss what we can do…”</div><div class=\"western\">“…Sharing information is important. Understood.”</div><div class=\"western\">Whether or not she would really share information would depend on the upcoming discussion.</div><div class=\"western\">“…Alright, this way.”</div><div class=\"western\">The maid demon moved with rapid steps, as though she did not care about the lack of light. It would seem the paladin she had met earlier was telling the truth.</div><div class=\"western\">As Neia trailed behind her, she studied the back of the maid demon.</div><div class=\"western\">She was a beautiful girl whose slender limbs and pretty face all evoked a protective desire in others.</div><div class=\"western\">Still, it all seemed like a charade to Neia, who knew the truth about her.</div><div class=\"western\">The chains she had been festooned with in Caspond’s chambers were nowhere to be seen. However, the chains were meaningless to begin with. This demon was simply made in the shape of a human girl, and in truth she was a monster that could surpass Dragons.</div><div class=\"western\">As she considered that even a slight pat might be the death of her, her stomach began to ache.</div><div class=\"western\">“I’m very fragile, so please be gentle with me.”</div><div class=\"western\">As she heard Neia mutter those words reflexively, the maid demon stopped in place, then turned around and said, “Got it.” Even Neia’s eyes could not make out any changes in her expression. Not knowing what she thought made her a little uneasy.</div><div class=\"western\">They continued on until they arrived at the reception room.</div><div class=\"western\">There was only a single candle for illumination.</div><div class=\"western\">“…Sit,” she pointed to the facing chair. Neia sat down. “…Drinks.”</div><div class=\"western\">She suddenly produced a bottle of brown liquid. It was just like how the Sorcerer King took out objects.</div><div class=\"western\">As Neia watched in surprise, she opened the cap and inserted a straw. It was made of a bizarre material that looked both soft and hard at the same time.</div><div class=\"western\">She hoped that muddy liquid was not poison. It would be very distressing if she accidentally forgot that it was harmful to humans.</div><div class=\"western\">However, if she was really a subordinate of the Sorcerer King, then she would not be able to refuse. Neia emboldened herself and moved her tongue.</div><div class=\"western\">She took a mouthful of it, and swirled her tongue.</div><div class=\"western\">It was not as bitter as she expected, and it did not prickle like needles either―</div><div class=\"western\"><i>It’s sweet!? What is this!</i></div><div class=\"western\">Neia took one mouthful after another. While it was sticky and needed some effort to suck up, it was cool, refreshing, and delicious.</div><div class=\"western\">“…Chocolate-flavored. Calories are a little high… around 2000. But don’t worry. Eating good food and getting fat is a long-cherished ambition for women, according to a certain great person.”</div><div class=\"western\">The change in tone made Neia peek at her face again, but she was still expressionless.</div><div class=\"western\">The words “great person” made her think of the Sorcerer King, but Neia had the feeling she was referring to someone else.</div><div class=\"western\">“…Want another?”</div><div class=\"western\">“May I?”</div><div class=\"western\">The maid demon probably knew that it would be a shame to finish it up in one go, and she took out another bottle.</div><div class=\"western\">Neia was also a girl ― although the Orcs had wondered if she was a female ― and it was hard for her to reach out for something that would make her fat. However, this drink was in a small container, which meant there was not much of it. Eating too much of anything would make one fat, so all she had to do was eat less at dinner to cancel it out.</div><div class=\"western\"><i>I have no idea what these calories are or how much two thousand of them make, but she said it was a little, so it should be fine.</i></div><div class=\"western\">It was a sweetness that was completely different from that of fruits or honey. This time, she would savor the taste as she drank it.</div><div class=\"western\">She took a mouthful―</div><div class=\"western\">“Ah! No, that’s not why I came. I came to talk.”</div><div class=\"western\">“…Mm.”</div><div class=\"western\">The maid demon sucked on the straw and drank in the same way as Neia had, while her eyes signalled Neia to continue.</div><div class=\"western\">“Er, well, first, if you have a name, could you tell it to me? I’m Neia Baraja, but you can call me whatever you want.”</div><div class=\"western\">According to Evileye of Blue Rose, each individual maid demon was completely different from the others in terms of appearance and equipment. In fact, the maid demons she had seen behind Jaldabaoth at Caspond’s room were completely different from this one. Maybe there were different names for different types of maid demons, much like Goblins and Hobgoblins.</div><div class=\"western\">While there might not be a need to know its individual and race name, if the maid demon really was a subordinate of the Sorcerer King, then as a squire, it would only be polite to treat her with all due courtesy.</div><div class=\"western\">“…Puhaa. Shizu is fine. I’ll call you Neia.”</div><div class=\"western\">“Shizu, is it?”</div><div class=\"western\">Neia had expected to be addressed as “human,” so she was mildly surprised.</div><div class=\"western\"><i>Is the maid demon’s personal name Shizu? Or is Shizu her race name? Well, both of them work for me…</i></div><div class=\"western\">“Is that your personal name?”</div><div class=\"western\">“…Personal name? An excellent question. Yes. Personal name.”</div><div class=\"western\">“Ah, forgive me. I don’t understand demons that well…”</div><div class=\"western\">“…Mm. Demons… huh. This… mm.”</div><div class=\"western\">Shizu seemed to be mumbling. Neia could hear all of it, but since she was talking to herself she decided not to take a jab at her.</div><div class=\"western\">“Alright then, Shizu. What can you do? Also, there were several maid demons, so why did the Sorcerer King choose you?”</div><div class=\"western\">“…I’m good at ranged attacks. Also because I was MVP (the best).”</div><div class=\"western\">“Best? Ahh, is that it? So at that time you were the most troublesome opponent, is that it?”</div><div class=\"western\">Shizu chuckled. That said, her face did not seem to change. However, Neia had sharp eyes, and she understood after observing her carefully.</div><div class=\"western\">There was a very slight change in her expression ― she seemed proud.</div><div class=\"western\">At the same time, Neia relaxed. It would seem she had not been easily controlled because she was the weakest.</div><div class=\"western\">“I can use ranged weapons too, but in turn I’m not good at close combat… We don’t have a frontliner.”</div><div class=\"western\">Shizu sipped her drink in silence.</div><div class=\"western\">“Got any ideas?”</div><div class=\"western\">“…What are we doing?”</div><div class=\"western\">“Infiltrating a city and rescuing a VIP.”</div><div class=\"western\">She could not mention the word Zern yet.</div><div class=\"western\">“…Then we need the ability to move stealthily. Better not to have a clanky frontliner making lots of noise.”</div><div class=\"western\">“Yes, that’s right.</div><div class=\"western\">“…Can you move quietly, Neia?”</div><div class=\"western\">“I had some training, so I’m probably better than before. However, I’m not fully confident in myself.”</div><div class=\"western\">“…Can you cast spells like 「Invisibility」 or do you have magic items that can do so?”</div><div class=\"western\">Neia shook her head.</div><div class=\"western\">“…I see. Work hard then.”</div><div class=\"western\">“Yes, I will. Then…”</div><div class=\"western\">Could she really trust Shizu? Could she believe that she was under the Sorcerer King’s control?</div><div class=\"western\">If Shizu was still a minion of Jaldabaoth and was pretending to be a subordinate of the Sorcerer King in order to spy on them, then telling her about him would be very bad. However, it was very likely that the Sorcerer King had wrested control of her from Jaldabaoth. In that case, not trusting her enough would be throwing away her best trump card.</div><div class=\"western\">And so, nervously and haltingly, she spoke.</div><div class=\"western\">“In this place, er, I have the duty of being the Sorcerer King’s squire.”</div><div class=\"western\">Shizu’s artificial, beautiful face did not move.</div><div class=\"western\">“…I heard. He said she had vicious eyes. And then he lent her a bow, which was runecrafted. Show me.”</div><div class=\"western\">Alarms blared in the corner of her mind ― Jaldabaoth had seemed quite interested in it as well. Still, if Shizu really was in the Sorcerer King’s employ, she would not be able to refuse.</div><div class=\"western\">Neia handed over her bow, and Shizu took it. However, she only glanced briefly at it before returning it to Neia.</div><div class=\"western\">“This is very good. You should let many people see it.”</div><div class=\"western\">She delivered the line calmly, so it felt like she was reading off something. However, she was probably imagining things because Shizu was not looking at the bow with interest. After all, she had spoken this way ever since she had first seen her.</div><div class=\"western\">“Thank you. Ah, yes. About what happens after the mission―”</div><div class=\"western\">Shizu held out a hand to interrupt Neia.</div><div class=\"western\">“You should let many people see it.”</div><div class=\"western\"><i>Why is she so hung up on this?</i> Shizu probably noted the bafflement on Neia’s face, and continued:</div><div class=\"western\">“He lent you an excellent runecraft weapon. You should spread the word of Ainz-sama’s greatness.”</div><div class=\"western\">The word Ainz made Neia twitch. Making this clear to her was her top priority.</div><div class=\"western\">“His Majesty.”</div><div class=\"western\">Neia sensed from Shizu’s blank face that she had not been clear enough, and added:</div><div class=\"western\">“That’s ‘His Majesty.’ Calling him Ainz-sama is too familiar, don’t you think?”</div><div class=\"western\">This time, it was Shizu whose face twitched a little. No, at a glance her face was still blank, but Neia was sure that her expression had changed.</div><div class=\"western\">“It’s not too familiar.”</div><div class=\"western\">“No, it is. Normally, you wouldn’t address him by his name, but by his title. You just came into his service and haven’t been of use to him yet… What’s with that face of yours?”</div><div class=\"western\">“Nothing. However, I want to call him Ainz-sama and not His Majesty.”</div><div class=\"western\">Was the expression that could be vaguely glimpsed past that blank mask a look of pity, or was she crowing her victory? Even Neia did not understand, but it made her mad. This thick-skinned newcomer had come out of nowhere, and the fact that she was trying to cozy up to the person she so revered made her very unhappy.</div><div class=\"western\">Neia decided not to pretend any more. While she wanted to act as a squire and deal with her politely as a person of the Holy Kingdom, she decided to give up on it. It did not matter if she was dealing with a monster which knew no equal throughout history o in the present day, she had to make one thing clear.</div><div class=\"western\">“Someone like you―”</div><div class=\"western\">“I was told to do so by Ainz Ooal Gown-sama ― ‘Call me Ainz-sama,’ he said.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">“So I can call him Ainz-sama. I can. Call. Him. That.”</div><div class=\"western\">Left unspoken was “<i>but you can’t</i>,” Neia’s body trembled.</div><div class=\"western\">No, she was a demon that the Sorcerer King had bound into his service with magic. Maybe it was natural that she would go that far.</div><div class=\"western\">“No, that can’t be. You, you must be lying. You’re lying like a demon would. How could he have explained in such detail in a situation like that?”</div><div class=\"western\">Shizu shook her head, as though to say, <i>Good grief</i>.</div><div class=\"western\">“It is a shame, but also true. Well, I know you must be shocked. I understand very well. Still, that is where you stand now. However, if you work for him, someday you will be able to call him Ainz-sama too. Work towards it.”</div><div class=\"western\">“―Shizu.”</div><div class=\"western\">“…Neia. It is a predecessor’s duty to teach those who come after them.”</div><div class=\"western\">While that was a pretty good line, had Shizu not come after herself? Still, the fact that she could call him Ainz-sama made her feel that maybe she was the senior after all. It was a little hard to accept, but first―</div><div class=\"western\">“I want to thank you.”</div><div class=\"western\">“…Don’t mention it. One must show kindness to those who know of Ainz-sama’s greatness.”</div><div class=\"western\">Neia’s eyes widened in surprise. She had only been bound to him for such a short time, so how had she gained such respect? No, that simply proved how great the Sorcerer King was.</div><div class=\"western\">“Yes, that’s right. I know very well how great His Majesty is.”</div><div class=\"western\">After Neia answered, the two of them looked at each other for a while.</div><div class=\"western\">Shizu was the first to move.</div><div class=\"western\">She swiftly extended her right hand. Neia responded instantly and without hesitation.</div><div class=\"western\">While Neia was mildly bothered by the fact that Shizu had not taken off her glove, the two of them shook hands on the table.</div><div class=\"western\"><i>Given how much she reveres the Sorcerer King, it would seem she really is under His Majesty’s rule. Otherwise, she would not have called him Ainz-sama, but instead she would have called him His Majesty like me, so she would not sound strange.</i></div><div class=\"western\">Was she being naive? However, at this point, Neia was very confident in her beliefs. She understood that Shizu’s loyalty was genuine. Just like how the teeth of two cogwheels fitted together, they could understand each other because they were fellow worshippers of the same god.</div><div class=\"western\">“…Speaking of which, it’s easy to get along with you. As a human being, you have a bright future, Neia.”</div><div class=\"western\">“I have very mixed feelings about getting along with a demon. We’re talking like this because you’re speaking the truth about how great His Majesty is.”</div><div class=\"western\"><i>Hm hm,</i> Shizu nodded.</div><div class=\"western\">“…Although I feel it doesn’t matter what happens to Neia, I will bring you back safely to this country. I promise.”</div><div class=\"western\">“Thank you.”</div><div class=\"western\">Neia’s gratitude was honest and straightforward. Shizu’s difficulty rating was 150. She was on a level where even Blue Rose would be hard-pressed to win against her. It was only right to be grateful for the protection of such a demon. This was doubly true if she was a subject of the Sorcerer King. Although, there was one thing she had to clarify with her.</div><div class=\"western\">“…Can you swear that in the name of the Sorcerer King?”</div><div class=\"western\">Shizu raised a hand, like she had been called on by a teacher.</div><div class=\"western\">“This I swear in the name of the Supreme One, Ainz Ooal Gown-sama… However, if you die and are resurrected, that still counts as keeping my word, right?”</div><div class=\"western\">“Safe…? No, I think that’s slightly different…”</div><div class=\"western\">The two of them looked at each other.</div><div class=\"western\">To Neia, there was a big difference between “safe” and “coming back to life after dying.” However, that was just barely within the bounds of what she could compromise with.</div><div class=\"western\">“If you don’t become a demon or one of the undead, but come back to life as a human, that ought to count, right…”</div><div class=\"western\">“…That should be fine.… Alright.”</div><div class=\"western\">There was a slight change in Shizu’s voice, which had been in a monotone all this while. She sounded like she was motivated now.</div><div class=\"western\">“…While you’re not cute, this is specially for you.”</div><div class=\"western\">Shizu took something out and went to Neia’s side. Then she pressed something tightly onto Neia’s forehead.</div><div class=\"western\">“Eh!? What!? What is this!?”</div><div class=\"western\">Startled by that inexplicable action, she tried desperately to peel it off, but she could not. It was stuck on so tight that it would not budge. It was very frightening.</div><div class=\"western\">“What’s this! Eh! Wait! I’m scared!”</div><div class=\"western\">“…It’s okay. It won’t hurt and it’s not scary. Look.”</div><div class=\"western\">Shizu showed her something with the number 1 and a strange design ― it might have been a letter ― on it. It was made of some kind of paper that gleamed with a frightening lustre and the one on her head was similarly slippery. She had heard of talismancy, so was that a kind of talisman used as a magical medium for that art? No matter what, she could not have given out a trivial item like this, so it must be some kind of magic item. That was what sent a chill down Neia’s spine. What if she could not remove it for the rest of her life?</div><div class=\"western\">“Why did you have to stick it on my forehead! Aren’t there better places to put it!?”</div><div class=\"western\">“…Mm, like a little sister.”</div><div class=\"western\">“Eh!?” Although she had heard something quite shocking, there was a more important matter at hand. “Anyway, take this off. At least stick it on my clothes or somewhere else!”</div><div class=\"western\">“…It can’t be helped, then.”</div><div class=\"western\">Shizu took out a small bottle and placed a drop of something on Neia’s forehead. After that, the tightly stuck-on object peeled off easily, like it had never been attached at all. She picked it up, looked at it, and saw that it was the same as the one Shizu had showed her earlier.</div><div class=\"western\">“…Sticker. It needs to be pasted somewhere obvious.”</div><div class=\"western\">It would seem she would have to paste it on. Making Shizu angry would do no good, so Neia did as she was told.</div><div class=\"western\">“Yes…”</div><div class=\"western\">“…Are we done?”</div><div class=\"western\">“Eh? Ah, no, after this, er, I wanted to talk about finding His Majesty, ah, no, to welcome him back…”</div><div class=\"western\">“…I’ll go too. …We need a lot of preparation. After all that is over.”</div><div class=\"western\">“Really?”</div><div class=\"western\">“…I promise. But I hope we can make time to finish the map of the demihumans’ hills.”</div><div class=\"western\">“That’s true. Eh, demihumans?”</div><div class=\"western\">A moment after she agreed, a question suddenly popped up in her heart. Right now, she had not told her anything. Even so, why had she suddenly used the word “demihuman?”</div><div class=\"western\"><i>Could it be… she heard about him landing in the Hills from Prince Caspond?</i></div><div class=\"western\">“…What’s wrong?”</div><div class=\"western\">“Er, um… I got it. I’ll talk to the people on top.”</div><div class=\"western\">“…Pleased to meet you, Neia.”</div><div class=\"western\">“The pleasure was all mine, Shizu.”</div><div class=\"western\">Although she was still mildly bothered by the sticker from just now, Neia stuck out her hand, and Shizu responded. They both shook hands again.</div><div class=\"western\">“You don’t think His Majesty is dead after all, do you, Shizu?”</div><div class=\"western\">Shizu’s eyes went wide.</div><div class=\"western\">“…What did you just say?”</div><div class=\"western\">“Actually, His Majesty fell to the east, and then he didn’t contact us again… Since His Majesty can cast teleportation spells, the fact that he still hasn’t come back makes me think something happened to him… So… what if… His Majesty…”</div><div class=\"western\">It hurt too much to speak any further. She hesitated, because if she said it, it might come true.</div><div class=\"western\">To this Shizu responded with what was probably surprise.</div><div class=\"western\">“…He’s fine. He’s not dead. My binding is the proof. Hm? …Why are you crying?”</div><div class=\"western\">Her tears were flowing on their own.</div><div class=\"western\">The Sorcerer King was really alive.</div><div class=\"western\">She truly believed that he was not dead. But sometimes, the uneasiness that suddenly reared up in her mind left her unable to sleep. Many people had told Neia that the Sorcerer King was fine, but all of them sounded like they were just trying to comfort her, to try and keep their own worries at bay, and not because they truly believed it.</div><div class=\"western\">But at this moment, someone had told her that with absolute confidence and certainty. That, and Shizu was the proof that the Sorcerer King was alive. That allowed Neia to relax at last.</div><div class=\"western\">It was relief, like that of a lost child finding her parents, that made Neia weep.</div><div class=\"western\">Shizu produced a piece of cloth that was printed with the same design as her scarf ― it was probably a handkerchief ― and covered Neia’s face with it. And then, she rubbed forcefully. She was not so much violent as inexperienced, but the place where she rubbed hurt a lot.</div><div class=\"western\">Shizu pulled the handkerchief away, and Neia’s snot stretched out into a bridge.</div><div class=\"western\">“…There’s snot on it. …Super shocking.”</div><div class=\"western\">After hearing Shizu’s distinctly shocked voice, there was an indescribable look on Neia’s face.</div><div class=\"western\">Therefore, she took a handkerchief out of her own pocket and broke the bridge of snot.</div><div class=\"western\">“…I’ll wash it.”</div><div class=\"western\">“…Mm.”</div><div class=\"western\"></div><div class=\"western\"><b>Part 2</b></div><div class=\"western\"></div><div class=\"western\">Entering Kalinsha’s castle was not difficult.</div><div class=\"western\">All they had to do was hide in barrels and wait to be smuggled in as cargo. There would be checks, of course, but there were other barrels ― eight in total ― besides the ones they had chosen to hide in, so all they had to do was let the inspectors check those instead. The fact that they could get past security with such simple precautions was due to the diverse nature of the Demihuman Alliance.</div><div class=\"western\">The demihumans all came from different cultures and had varying social norms. If they had anything in common, it was that fighting strength meant everything. Therefore, when a powerful individual threw his weight around, he usually got it, and minor transgressions were all forgiven. To demihumans, their personal power determined their capacity for violence and in turn, their social rank. Those lower on the totem pole had no choice but to obey.</div><div class=\"western\">Therefore, a strong Zern could put an end to the cargo inspection by glaring at the inspectors.</div><div class=\"western\">Eventually, there was a loud <i>thunk</i> as the barrels were laid on the ground.</div><div class=\"western\">After that, someone knocked on the top of the barrel.</div><div class=\"western\">That was the signal that they had arrived at their destination. As planned, Neia counted out three minutes in silence as she listened to the Zern responsible for transporting them open a door and leave.</div><div class=\"western\">After the three minutes were up, Neia pushed up the divider above her. While the bigger pieces of raw meat did not fall when the divider tilted, the smaller chunks rained down on Neia. This barrel was constructed with a false bottom. Neia was below the divider and the fresh meat lay on top of it.</div><div class=\"western\">The reason why the barrels were filled with fresh meat and not vegetables or grain was so that they could use the scent of blood to mask Neia and Shizu’s scent.</div><div class=\"western\">While Neia found it a little uncomfortable to be soaked in blood and juices from the meat, she still felt happy that none of the countermeasures they had prepared had been put to use.</div><div class=\"western\">Neia slowly lifted up the lid of the barrel and peered outside.</div><div class=\"western\">She looked around the darkened interior of the room ― there was a faint light that might have been the glow from a magic item ― and after verifying that there was nobody around, Neia slowly climbed out of the barrel.</div><div class=\"western\">There were all kinds of foodstuffs and urns on the shelves of this larder. There were also many barrels like the ones which had recently been brought here.</div><div class=\"western\">It took a lot of work, but she managed to climb out safely. In order to make getting back in easier, she left the divider standing inside the barrel.</div><div class=\"western\">They would need to use these barrels to escape after rescuing the Zern prince.</div><div class=\"western\">Shizu, the other infiltrator, had just made it out of her barrel. She was shorter than Neia, so climbing out of the large barrel had been more tiresome. However, her physical abilities were far beyond those of Neia’s and even Remedios’s, so she had managed to get out by herself before Neia could go over to help her.</div><div class=\"western\">“Shizu-san.”</div><div class=\"western\">“…Hm?”</div><div class=\"western\">“There’s meat stuck to your hair.”</div><div class=\"western\">Shizu looked unhappy. While her facial expression did not change, that did not mean she had no emotions. Perhaps it was because she had been with Shizu all this time or because Neia’s eyesight was excellent, or perhaps looking at the Sorcerer King’s bony features all this time had honed her ability to scrutinize others, but Neia had a rough grasp of how Shizu felt.</div><div class=\"western\">Shizu fumbled around to try and get the small bits of meat out of her hair, but they were stuck to the strands on the back of her head and she could not get them out.</div><div class=\"western\"><i>While I was told to cut my hair short because long hair could be easily grabbed in combat, it seems there are many other drawbacks to it.</i><br/><p>Neia went to Shizu’s side and picked all the chunks out before tossing them into the barrel.</p></div><div class=\"western\">“…Thanks… Don’t want to infiltrate this way again.”</div><div class=\"western\">“We’ll have to do it again when we escape.”</div><div class=\"western\">“…”</div><div class=\"western\">Shizu looked despondently at the barrel, then pulled a towel out of nowhere to wipe herself off before handing it to Neia.</div><div class=\"western\">The moist towel had a softness and fineness which Neia had never felt before. Neia imagined that it must have been very expensive. How had she gotten her hands on something like that? Were they common in the demon world?</div><div class=\"western\">As all these questions and more ran through her head, Neia wiped her hands that had been made sticky by the meat, and then wiped down Shizu’s hair with the clean bits. While it only made her feel better, it was better than not wiping at all.</div><div class=\"western\">“…Thanks.”</div><div class=\"western\">“Don’t mention it.”</div><div class=\"western\">While Neia was doing this, Shizu took out her weapon.</div><div class=\"western\">That strangely-shaped device was apparently a ranged weapon called a spell gun. It used mana to fire bullet-like bolts, and it felt like a crossbow. Shizu had said something about the gunpowder not showing any signs of combustion or something, but Neia had not understood any of it, so the explanation was wasted on her.</div><div class=\"western\">She had wanted to test it out, but Shizu refused to part with it, so Shizu’s fighting ability was still an unknown. Still, she was a difficulty rating 150 demon, so Neia felt that there was nothing to worry about there.</div><div class=\"western\">“…Hm.”</div><div class=\"western\">Shizu produced the Ultimate Shootingstar Super and a quiver of arrows out of nowhere like a stage magician before handing them to Neia, and in turn Neia returned her the dirty towel.</div><div class=\"western\">Initially, there had been a discussion on how Neia would bring her bow along. The bow’s stave was very long, and when one added camouflage on top of that, she would not be able to close the lid on the barrel, and if the barrel were opened she would be exposed.</div><div class=\"western\">While they could have let the Zern carry it in, the bow was a magnificent piece of work and it would have left an impression on people who saw it. In addition, the Zern had also refused, for fear of being drawn into all this if the rescue mission failed.</div><div class=\"western\">In the end, when everyone had told her to leave the bow behind, Shizu said that she could store her weapons in a mysterious space in the air, so she could put the bow in there as well.</div><div class=\"western\">The uneasiness of bringing a valuable item lent to her by the Sorcerer King on a mission in a dangerous place blended with the reassurance of not having to part ways with her weapon. Neia thanked Shizu for her kindness as both emotions filled her. It would seem Shizu had accepted Neia as her junior back then, and after that Shizu had occasionally acted like her senior.</div><div class=\"western\">Part of that was how Neia had to address Shizu as “Shizu-san,” because Shizu would make a fuss if Neia did not. However, Shizu was a pretty girl, and when she made a pouty face ― she could tell even though Shizu did not show expressions ― Neia actually found it kind of cute.</div><div class=\"western\">After they had each readied their weapons, Shizu was the first to move.</div><div class=\"western\">Neia pricked up her ears to listen for any movement outside the door, but there was nobody there.</div><div class=\"western\">“…Let’s head out.”</div><div class=\"western\">Time was short, so Neia nodded.</div><div class=\"western\">The Liberation Army was approaching Kalinsha while the operation to rescue the Zern Prince was in progress, so the battle for Kalinsha would begin soon.</div><div class=\"western\"></div><div class=\"western\">1: Neia and Shizu would infiltrate Kalinsha and rescue the Zern prince.</div><div class=\"western\">2: The Liberation Army would approach Kalinsha and begin their attack.</div><div class=\"western\">3: If the Zern prince was rescued, the Zern would act as a fifth column within the city walls.</div><div class=\"western\">4: If item 3 failed, then instead of the Zern opening the city gates and guiding the Liberation Army in, Neia and Shizu would have to handle that task. However, that was far too much for them to take on, so they would only do what was within their capabilities.</div><div class=\"western\"></div><div class=\"western\">Those were the key points of the battle plan.</div><div class=\"western\">The important thing was that if they could rescue the Zern prince, then they could count on the Liberation Army and the Zern to relieve them even if they were forced to hunker down and defend themselves. This was good for the Zern as well; if the rescue succeeded, they could release the prince after Kalinsha was taken back.</div><div class=\"western\">In other words, whether or not they could take Kalinsha back simply and with minimal casualties all hinged on successfully rescuing the prince.</div><div class=\"western\">As she felt the weight crushing down on her shoulders, Neia groaned as her tummy hurt again.</div><div class=\"western\">Therefore ― there was not much time. Once the Liberation Army began their attack on Kalinsha or if they were detected before that, security in Kalinsha would be tightened.</div><div class=\"western\">In accordance with what they had planned, Shizu produced a bottle of what looked like perfume out of nowhere and sprinkled it on Neia and herself. It seemed to be some kind of consumable magic item that contained the first tier spell 「Odorless」. There was not much of it, so they had to conserve it as much as possible.</div><div class=\"western\">Shizu cracked open the door, peered around outside, and then slipped out.</div><div class=\"western\">They had selected their route and decided on how to deal with various situations after consulting the map of Kalinsha, and they had already discussed what duties each of them would be handling.</div><div class=\"western\">Neia exited the room as well, then carefully closed the door so as not to make noise before running after Shizu.</div><div class=\"western\"><i>Though I’m not really helping much…</i></div><div class=\"western\">Frankly speaking, under the present circumstances Neia was nothing more than a burden. That much was instantly clear when one looked at Shizu’s running stride. She ran like her father moved through the woods ― no, she was far better, being both swift and silent. She was definitely using some kind of technique there..</div><div class=\"western\"><i>She’s a demon, but she uses techniques like a human… It’s always the ones you can’t judge by their appearances which are the scariest, huh?</i></div><div class=\"western\">While they could have left everything to Shizu, Neia’s presence was both to keep an eye on Shizu and also to ensure that it was a joint effort between the Sorcerous Kingdom’s Shizu ― assuming she was truly bound to the Sorcerer King ― and the Holy Kingdom’s Neia that rescued the prince. That way, the Holy Kingdom could act like they had contributed to it.</div><div class=\"western\">The passages were dark. It was nighttime. Moonlight streamed in through the windows ― or rather, the only thing which entered was the moonlight. There were no other sources of light here, no magical illumination or torches.</div><div class=\"western\">This was because many demihumans were indifferent to the darkness. However, there were different degrees of being able to see in the darkness. While some species had complete darkvision, most of them simply had superior night vision. Therefore, Neia and Shizu avoided the moonlight and slunk from shadow to shadow.</div><div class=\"western\">As a human being, Neia had to focus herself and sharpen her senses. Not only could she not see clearly due to the darkness, the patrolling guards did not carry light sources either, so she could not spot them from afar.</div><div class=\"western\">While she did not quite understand why the larder had lights, that was probably for the sake of those species who lacked darkvision.</div><div class=\"western\">The two of them kept their footfalls as quiet as possible while they ran through the castle towards their destination.</div><div class=\"western\">Considering Shizu’s physical attributes were far superior than Remedios’s, even a pace which left Neia panting and barely able to keep up was probably slower than a jog to Shizu.</div><div class=\"western\">They occasionally spotted demihuman guards, which was their cue to hold their breath and quietly wait for the opposition to move on. They could not kill them, because that would mean having to take care of the corpses and hide their traces. Since they were in the midst of the enemy, it would be best not to be spotted at all until the rescue was a success.</div><div class=\"western\">Fortunately, Neia and Shizu were not spotted, and they continued forward.</div><div class=\"western\">There were few guards within the castle thanks to most of the personnel being assigned to the walls and the watchtowers, as well as the city’s prisons. The Sorcerer King had killed a great deal of demihumans, which meant that they could not set up a tight security net. Thus, vigilance within the castle had grown lax, according to the Zern.</div><div class=\"western\">The reason why they could proceed safely was because the Zern had reconnoitered the area ahead of time and made near-perfect preparations, but Neia still felt a twinge of uneasiness.</div><div class=\"western\">There were two challenges in their way.</div><div class=\"western\">The first was the long passageway they had to traverse in order to reach the tower.</div><div class=\"western\">The second was the bridge to the tower ― the aerial walkway.</div><div class=\"western\">There were no hiding places in either location, and obviously there would be sentries standing watch as well. They would not be alone either. In addition, at least one of them would be stationed out of the line of fire for ranged weapons because they were on guard against ranged attacks.</div><div class=\"western\">While they had discussed the matter in a big group in front of Gustav’s map, they would still have to pass through both these places in order to reach the tower.</div><div class=\"western\"><i>If we could use </i><i>「</i><i>Invisibility</i><i>」 </i><i>to deceive their eyesight and </i><i>「</i><i>Silence</i><i>」 </i><i>from the priests to deceive their hearing, we would be able to infiltrate perfectly… that’s why adventurers ― who form groups that can take on all kinds of situations ― are so highly valued</i>.</div><div class=\"western\">Eventually, the two of them reached their objective.</div><div class=\"western\">This was the first challenge, the long passageway. If they tried to run straight down it, they would be spotted before they could cover the distance. In order to avoid that, they needed to reach a location where they could execute ranged attacks while not being spotted by the opposition.</div><div class=\"western\">That was why they had come here, the level above the long passage, the room directly above where the guards were stationed.</div><div class=\"western\">If they lowered a rope from here and rappelled down the outer walls, they could take a shortcut without being detected.</div><div class=\"western\">“…Here?”</div><div class=\"western\">In response to Shizu’s question, Neia consulted the map in her head and the route they had taken, and nodded a yes.</div><div class=\"western\">“…Hm. Not bad.”</div><div class=\"western\">Shizu’s reply sounded like she was praising a junior, and then she pressed her ear to the door. Then, she quickly and silently opened it.</div><div class=\"western\">While the room was filled with various sundry items, it looked like it had not been used in a long time, and there was a white layer of dust on the ground. However, there were traces that the Zern scouts had been here. They had moved between the window and a very large shelf.</div><div class=\"western\">Shizu produced a rope out of nowhere. It was the same color as the castle wall.</div><div class=\"western\">After that, she secured it to the large shelf. She used all her strength to tug on it to see if it could take the weight of Neia and herself, but it did not budge, and it showed no signs of fraying.</div><div class=\"western\">The size ― and weight ― of the shelf was a factor, but the web-like strands stuck to the shelves was probably more important. The Zern who had come to this room beforehand had fixed it in place with sticky threads taken from the Spidans.</div><div class=\"western\">The window opened easily, and Shizu looked at the city walls outside. After verifying that there were no patrolling guards in sight, Shizu slung her weapon onto her back and said, “I’ll go first.”</div><div class=\"western\">She threw herself out of the window and slid down the rope to the window below.</div><div class=\"western\">She took her weight on one hand and used the other to push open the next window, which opened easily. That too had been the work of the Zern.</div><div class=\"western\">Shizu then slid inside. Her skillful movements had only taken a few seconds.</div><div class=\"western\">After confirming that the room below was safe, Shizu poked her face out and beckoned to Neia.</div><div class=\"western\">Neia grabbed the rope and leaned out of the window.</div><div class=\"western\">While the window on the floor below was only four meters away, they were now over a hundred meters off the ground. If Neia fell, she would meet with a horrible death. No, it would be worse if she did not die. She would surely be tortured until she gave up what she knew and then she would be killed. Falling to her death would be a merciful alternative.</div><div class=\"western\">The rope had evenly spaced knots along its length ― handholds, in other words ― and there had been no problems during the several practice sessions they had conducted. However, training felt completely different from the real thing.</div><div class=\"western\"><i>Ahh, I really don’t want to go…</i></div><div class=\"western\">But she had no choice. If only there was something like a balcony that she could just jump down on―</div><div class=\"western\">Neia gripped the rope tightly as she pushed her entire body out of the window. She crossed her legs to firmly clasp the rope between her thighs.</div><div class=\"western\">After this, all she had to do was descend slowly.</div><div class=\"western\"><i>The ground’s just a little lower. The ground’s just a little lower.</i></div><div class=\"western\">She slowly went down the rope, reminding herself not to look down over and over again.</div><div class=\"western\">She shifted her weight from her right hand, and then to the left, just what like she had practiced. The wind blew and made her body shake at an intensity that could not be compared to training at all.</div><div class=\"western\"><i>Come on, come on, come on, me! Shizu should have been more scared than this!</i></div><div class=\"western\">The window was open because of the Zerns’ help.</div><div class=\"western\">However, if someone had locked the window after the Zerns opened it, then Shizu would have had to climb back up. With that in mind, Neia ― who only needed to make a single trip ― had it easy in comparison.</div><div class=\"western\">She finally approached the window, and Shizu reached out to grab Neia’s body. Thus, she pulled Neia in with incredible strength.</div><div class=\"western\">“Thank, thank you.”</div><div class=\"western\">“…Mm. But, too long… I’m taking it in, hold this.”</div><div class=\"western\">“Yes.”</div><div class=\"western\">Shizu leaned out of the window and raised her spell gun. Neia held the rope as indicated. There was a pop-hiss of expelled air and Neia felt a force tugging on the rope. Shizu had cut it with her weapon.</div><div class=\"western\">She pulled the severed rope back into the room and dumped it in the corner. They would not be using this route on the way back, so she had pulled it back in rather than let it dangle freely, but there were merits and drawbacks to that.</div><div class=\"western\">The merit was that it minimized the risk of being spotted by the sentries on the walls.</div><div class=\"western\">The drawback was that if anything happened and they could not exfiltrate by their planned route, they would not be able to climb to the upper floor with this rope.</div><div class=\"western\">In the end, the two of them had decided that the drawbacks of being spotted outweighed the merits.</div><div class=\"western\">“It’s done, Shizu-san. Next we need to get past the first obstacle…”</div><div class=\"western\">“…Mm. Let’s go… Got to kill them. Can you do it?”</div><div class=\"western\">“Mm. I think I can.”</div><div class=\"western\">Once they stepped out of this room, they would be in a position to shoot the sentries stationed along the passage.</div><div class=\"western\">If they could not kill them before they raised the alarm, all their effort would be wasted.</div><div class=\"western\">Neia took out her bow and nocked an arrow. Shizu raised her magic gun as well.</div><div class=\"western\">“I’ll take the right, you take the left, Shizu-san.”</div><div class=\"western\">Shizu formed a circle with her thumb and her index finger.</div><div class=\"western\">The two of them exchanged looks, and then Shizu pushed open the door.</div><div class=\"western\">Neia made eye contact with a nearby demihuman, about one and a half meters away. He did not know what was going on or who they were. The demihuman was so surprised that he could not parse the situation, but Neia did not hesitate and put an arrow into him.</div><div class=\"western\">With a <i>katsun</i>, the arrow pierced his skull through the forehead.</div><div class=\"western\"><i>I did it!</i></div><div class=\"western\">While Neia’s skills had played a part, most of the work had been done by the Ultimate Shootingstar Super.</div><div class=\"western\"><i>Thank you, Your Majesty!</i></div><div class=\"western\">Just as Neia’s arrow pierced the demihuman through the head, Shizu’s spell gun blew off half of the other demihuman’s head.</div><div class=\"western\">The demihumans made more noise when they collapsed than Neia had expected. Neia hurriedly pricked up her ears. Fortunately, she could not hear anyone running towards this place. It would seem nobody had spotted them yet.</div><div class=\"western\">“…Hurry.”</div><div class=\"western\">They had already assigned their tasks beforehand. As Shizu dragged the corpses into the room they had just entered with the rope, Neia used the smell-clearing item Shizu had lent her. After that, she reached for the waterskin on her belt and poured the powerful wine within all over the place, washing away the chunks of meat, brains, skull and bloodstains on the ground. As the stench of alcohol filled the air, Shizu emerged from the room, then produced an empty wine jug and poured a little bit of the jug’s wine inside before quietly ripping it up and leaving it in place.</div><div class=\"western\">“…Let’s go.”</div><div class=\"western\">“Yes.”</div><div class=\"western\">While they had tried to cover it up, it was very likely that the next shift would sense something was up when they came to take over. She would be able to relax if they could put the bodies into Shizu’s mysterious pocket dimension, but Shizu said that she would not do so, thus they left the corpses in the room. Of course, they had made preparations there too, but there was no way to make sure that they would not be found.</div><div class=\"western\">They had to assume that they did not have the luxury of ample time.</div><div class=\"western\">Eventually, they reached the second obstacle, the aerial walkway. Of the several scenarios they had come up with, this was the closest to being ideal. They still had time and nobody had spotted them yet.</div><div class=\"western\">“…It’s a race against time now.”</div><div class=\"western\">“I know. If I slip, don’t worry about me.”</div><div class=\"western\">The path from the castle to the tower was roughly two people wide.</div><div class=\"western\">There were no walls on either side ― it was open to the air. Apparently several people had fallen off the side before, and after seeing this, all she could think of was that it was only to be expected.</div><div class=\"western\">This aerial walkway was the reason why this place was the final redoubt when engaging invaders during a siege.</div><div class=\"western\">A large force could not pass through here, so an advantage in numbers would be nullified. At the same time, there was also the risk of falling. If there was a spear line at the end of the path, breaking through would be very difficult. This design was the kind that attackers hated. One would need magic casters with attack spells like 「Fireball」 to take it down.</div><div class=\"western\">Using ranged weapons for a sustained attack was disadvantageous for Neia’s side, which was operating stealthily and under time constraints. Therefore, all they could do was charge into close range and finish off the enemy, while the enemy could hit them with ranged weapons and they did not have the benefit of cover.</div><div class=\"western\">In that case, they would need to close the gap before the sentries spotted them. But at a closer look, the path was uneven. It was designed to slow down anyone trying to run across and force them to slip and fall off the sides.</div><div class=\"western\"><i>This is dangerous… if an enemy runs into me and grabs me… I’ll fall off and die. If I’m not careful…!</i></div><div class=\"western\">After screwing up her determination, Neia realised Shizu was staring at her. Although they were of the same sex, being stared at by Shizu, the doll-like beauty, made Neia a little embarrassed.</div><div class=\"western\">“W-What?”</div><div class=\"western\">“…Using it… Neia, wait here.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">“…I’ll take care of the door guards. No matter what happens, don’t come out.”</div><div class=\"western\">“―Eh?”</div><div class=\"western\">Before she could get an answer, Shizu vanished.</div><div class=\"western\">She had disappeared. This was not some kind of high speed movement. Shizu had been standing here until just now and then she had vanished into the air like she had been an illusion.</div><div class=\"western\">A wave of confusion assaulted Neia. However, Shizu had already told her to wait, so she ought to stay here and wait.</div><div class=\"western\">Neia concealed herself at the entrance to the aerial walkway and listened carefully to the tower and the path behind her for anything out of the ordinary.</div><div class=\"western\">Several seconds later ― something happened at the guard post.</div><div class=\"western\">She heard a scream and then the sound of a guard collapsing.</div><div class=\"western\">Neia poked her face out to see what was going on and saw Shizu emerge from the guard post. Shizu waved to beckon Neia over.</div><div class=\"western\">As Neia began to panic and wonder what was happening, Shizu’s waving gesture grew larger, until her entire body was moving.</div><div class=\"western\">Could she not go, now that Shizu had done that much?</div><div class=\"western\">Neia bent low, then ran across the windswept, frightening aerial walkway as she paid attention to her footing.</div><div class=\"western\">After she was across, she could smell blood from the guard post. Several dead demihumans lay on the ground, and Shizu stood inside, with her usual blank expression. She held what looked like a very sharp and large knife in her right hand. The blade was smeared bright red, and she had her spell gun in her left hand.</div><div class=\"western\">“…Clear. Move in.”</div><div class=\"western\">“Ah, yes…”</div><div class=\"western\">“…Can’t disappear again today. Be careful.”</div><div class=\"western\">“Got it.”</div><div class=\"western\">It would seem there was no need to explain, so Neia did not ask, but merely followed behind her.</div><div class=\"western\"><i>That’s a maid demon for you,</i> Neia thought.<br/><p>She could not have come all this way without Shizu.</p></div><div class=\"western\"><i>And this is also thanks to the order His Majesty gave to Shizu.</i></div><div class=\"western\">Only the Sorcerer King could inspire greater respect in people even when he was not present.</div><div class=\"western\">Honestly, the fact that he was undead or whatever was a trifling problem.</div><div class=\"western\"><i>I need to let everyone know, after all. I need to tell them how great a person His Majesty is!</i></div><div class=\"western\">The tower was almost completely made of stone and it only had a small window for light. It was darker than the castle that they had pass through earlier.</div><div class=\"western\">The passage inside the tower was quite spacious, big enough for Neia and Shizu to walk side by side. It spiralled up along the inside of the tower’s wall.</div><div class=\"western\">Their objective, the Zern prince, ought to be near the top, so the only thing they did when passing doors along the way was check for movement inside while the two of them continued ever upwards.</div><div class=\"western\">About two circuits later, Shizu raised her hand to signal that they should stop. This happened almost at the same time as Neia’s keen hearing picked up some creature’s footsteps.</div><div class=\"western\">It would seem it was wearing metal armor, because she could hear the sound of metal striking stone.</div><div class=\"western\">“It’s alone, Shizu-san.”</div><div class=\"western\">“…Yes. But… heavy footsteps.”</div><div class=\"western\">Neia could not tell, but if Shizu said it, then it was probably so. In other words, whatever it was, it was not human-sized.</div><div class=\"western\">“What… should we do? Should we hide behind one of the doors we passed along the way?”</div><div class=\"western\">“…It’s already here. Kill it.”</div><div class=\"western\">“Got it.”</div><div class=\"western\">Neia readied her bow after Shizu. Her plan was to shoot first and not bother with questions. She had heard that the Zern prince was about the size of a human child. In addition, he would not be wearing metal armor.</div><div class=\"western\">A massive object came into view, and Neia and Shizu attacked without hesitation.</div><div class=\"western\">The arrow and bullets entered its body, as though they had been sucked in.</div><div class=\"western\">“Gaaahhhh!”</div><div class=\"western\">The massive object stumbled, and backed up along the path.</div><div class=\"western\">Since it had retreated along a curved path, it was no longer in the line of fire.</div><div class=\"western\">The fact that it had survived their attacks ― particularly Shizu’s ― suggested that it was a very tough demihuman.</div><div class=\"western\">“What! Who are you!?”</div><div class=\"western\">An angry cry echoed from the depths of the passage.</div><div class=\"western\">“What should we do, Shizu-san?”</div><div class=\"western\">“…Can’t sit here and wait… Close in and attack before the enemy gathers the tower guards.”</div><div class=\"western\">“Understood.”</div><div class=\"western\">Neia and Shizu broke into a run.</div><div class=\"western\">Since it could survive Shizu and Neia’s surprise attack, they could assume that it was the guardian ― a Vah Un. Vah Uns were beings which possessed very good overall fighting power and a shocking amount of stamina.</div><div class=\"western\">As they ran, the humidity in the air seemed to increase as well ― Neia’s nose picked up the scent of rain.</div><div class=\"western\">“Goooaahhh! To think there’d be humans here!”</div><div class=\"western\">After closing in, they saw a massive demihuman.</div><div class=\"western\">While it possessed the savage air of an Ogre, it looked much more intelligent than an Ogre.</div><div class=\"western\">Its skin was bluish-white, though it looked more demonic than unhealthy.</div><div class=\"western\">It had a single thick horn on its forehead. It carried a mace that was bigger than Neia.</div><div class=\"western\">Judging by its physical appearance, it was quite similar to the descriptions of the species known as Vah Uns.</div><div class=\"western\">While it was not as bad as Buser, it was still quite a dangerous opponent. The arrow and bullets had clearly hit it, but it did seem to be wounded. There was no smell of blood either, so it would seem it had not covered it up with illusions.</div><div class=\"western\">Somehow, it had negated their attacks ― particularly Shizu’s.</div><div class=\"western\">“So you’re here for my life, are you!? You’ve got good eyes on you, humans!!!”</div><div class=\"western\">It seemed very happy.</div><div class=\"western\">In that case, she would let it remain mistaken―</div><div class=\"western\">“…No.”</div><div class=\"western\">Shizu fired as she spoke.</div><div class=\"western\">There was a <i>pop-hiss</i> of expelled gas as something flew through the air. After that, part of the Vah Un’s body dissolved into mist and the bullet passed through.</div><div class=\"western\">“…Hm.”</div><div class=\"western\">“Wahahahaha! Ranged weapons are useless against me!”</div><div class=\"western\">Neia loosed an arrow at the Vah Un’s forehead, but its head also sublimated into mist and the arrow sank into the wall behind it.</div><div class=\"western\">“―Useless! It’s useless! Now quiver in fear of me, for I am the bane of all archers, and then die!”</div><div class=\"western\">“…Immune to all ranged weapons? On something that’s only that strong?” Shizu muttered. “There must be a trick.”</div><div class=\"western\">Neia glanced at Shizu and shook her head. Unfortunately, the Zerns did not know any details about its abilities.</div><div class=\"western\">“What are you blathering about!”</div><div class=\"western\">“Back up!”</div><div class=\"western\">The Vah Un closed the gap. The sight of its massive body approaching them felt off, like her sense of distance was messed up.</div><div class=\"western\">Neia would not be able to survive a single hit from it, so she obediently listened to Shizu and fell back.</div><div class=\"western\">Shizu stood on the frontline, and the mace slammed down on her. The strike was like a howling storm, but she elegantly evaded it.</div><div class=\"western\">The Vah Un’s strength was extraordinary, given that it could swing a weapon that was as tall as Shizu with one hand. The stone was shattered where it had struck the ground, and cracks radiated in all directions. It felt like the massive tower was shaking.</div><div class=\"western\">“Tch!”</div><div class=\"western\">Neia loosed an arrow.</div><div class=\"western\">While the Vah Un was locked in melee with Shizu, there was a huge difference between their body sizes. If she aimed up, she could strike the Vah Un without hitting Shizu.</div><div class=\"western\">As expected, the Vah Un transformed into mist in order to avoid the arrow whistling through the air.</div><div class=\"western\">“Useless! Useless! I told you arrows are useless against me! Foolish ― uwoooooh!”</div><div class=\"western\">The Vah Un roared even louder than before. Shizu seemed to find it annoying and hacked at him.</div><div class=\"western\">While Shizu’s shooting skills were far superior to Neia’s, she was not as skilled in close combat, so unfortunately, her strike was blocked by the mace.</div><div class=\"western\">Neia nocked and drew back another arrow.</div><div class=\"western\">This time, Neia aimed for the hand holding the mace. While it was very likely that the weapon would not drop even if it turned to mist, she decided that she had to try, however small the possibility.</div><div class=\"western\">In the end―</div><div class=\"western\">The mist-formed arm did not release the mace.</div><div class=\"western\">“Aren’t you going to stop, human!?” The Vah Un presented a palm to Neia. “「Water Splash」!”</div><div class=\"western\">A ball of water flew out at Neia.</div><div class=\"western\">Something hit her right shoulder. Neia was sent flying and fell to the ground.</div><div class=\"western\">It hurt like she had been savagely beaten. She might even have broken bones.</div><div class=\"western\">After nervously trying to move her right arm, she found that it could move without issue. However, a torrent of pain spread from her shoulder inside her body. She touched her shoulder and found that it was wet. While she was afraid that it was blood at first, she immediately realized that it was water.</div><div class=\"western\">“Hmph! You made me use a petty spell!”</div><div class=\"western\">The Vah Un swung its mace as it spat its reply at them.</div><div class=\"western\">Shizu muttered quietly to herself as she nimbly avoided a deadly stroke that could have smashed Neia to bits.</div><div class=\"western\">“…Why that girl? Why attack someone who can’t hit you? I don’t get it.”</div><div class=\"western\">“Hah, you idiot! That’s because she’s a pain―”</div><div class=\"western\">“―Because it was effective? Limited uses?”</div><div class=\"western\">The Vah Un’s face changed. In other words, Shizu was right.</div><div class=\"western\">“Neia!”</div><div class=\"western\">“Got it!”</div><div class=\"western\">Neia loosed an arrow, which the Vah Un avoided by turning into mist. After that, she fired again ― and the arrow pierced into the Vah Un.</div><div class=\"western\">As the Vah Un grunted in pain, Shizu spoke.</div><div class=\"western\">“…I understand. You can only defend against seven ranged attacks. Is that… per day? Per hour? …Doesn’t matter. You’ll die here.”</div><div class=\"western\">The Vah Un could not catch up to Shizu, who dodged with amazing skill. In other words, if this kept up, it would take a one-sided beating and die. Perhaps the Vah Un had sensed this would happen, because its face knotted up.</div><div class=\"western\">“Damn you! 「Fog Cloud」!”</div><div class=\"western\">A bank of fog sprang up.</div><div class=\"western\">It was thicker than the fog she had seen in the Sorcerous Kingdom, and Neia did not even know her own location. While she could not see Shizu fighting against the Vah Un, she could hear Shizu’s spell gun going <i>pew pew pew</i>.</div><div class=\"western\">When she thought about it, that was obvious.</div><div class=\"western\">Even if the Vah Un conjured fog in the middle of the passageway, she still knew where it was. All she had to do was keep shooting. Neia followed Shizu’s lead and launched arrows. She was a little worried. so she aimed up high; that way even if she missed, she would not hit Shizu.</div><div class=\"western\">The arrow she loosed melted into the fog, and it was followed by the sound of something striking the wall. It would seem she had missed.</div><div class=\"western\">“It’s moving behind you now.”</div><div class=\"western\">As Shizu said that, Neia thought <i>Eh?</i></div><div class=\"western\">When one considered the size of the passageway, it was impossible for the massive Vah Un to get behind Shizu and Neia without bumping into them. However, along the way here, Neia had come to realize that Shizu was a trustworthy demon. Or rather, she did not trust Shizu so much as she trusted the Sorcerer King which she served.</div><div class=\"western\">Neia turned, and while the fog was still so thick she could not see anything, she loosed another arrow.</div><div class=\"western\">Just like before, she heard the sound of an arrow striking a distant wall.</div><div class=\"western\">“Where, Where is it!?”</div><div class=\"western\">“..Mm. You’re looking in the right direction. It’s trying to run… get down!”</div><div class=\"western\">Neia instantly dropped prone as Shizu spoke in a tone that was very forceful for her.</div><div class=\"western\">“…Reloading… full burst.”</div><div class=\"western\">There was a piercing <i>kyuuuuun </i>and then a cacophonous <i>dakka dakka dakka dakka</i> thundered down the passageway. Unlike the <i>pew pew</i> sound from before, this was a sound that was filled with an oppressive brutality.</div><div class=\"western\">“Gobooh~” There was the sound of someone coughing up something, followed by a crash as a massive body hit the ground. After that, the mist cleared, and she could see the body of the Vah Un lying along the curved passage.</div><div class=\"western\">Its body was covered in holes, and it looked like it had been blown apart. There were similar marks all around the nearby walls. What had happened to cause this?</div><div class=\"western\">As a demihuman assigned to guard this place, it should have been quite strong. In truth, Neia alone would not have stood a chance at all. Yet Shizu could instantly kill a demihuman like this as long as her weapon was effective against it. That was a difficulty 150 maid demon for you.</div><div class=\"western\">“What… was… no. With magic, you can do anything, huh.”</div><div class=\"western\">Neia worked her stricken shoulder. She had forgotten the pain during the excitement of battle, but now it was starting to hurt more and more.</div><div class=\"western\">“…Okay?”</div><div class=\"western\">“Mm. But it hurts to draw a bow. I don’t think I can aim well.”</div><div class=\"western\">“…Got a healing potion?”</div><div class=\"western\">“No, but I have a healing item His Majesty lent me.”</div><div class=\"western\">Neia could only use it once during that battle, but now she felt like she could use it more often. Still, that did not mean she could waste mana, because she might need to heal Shizu if the situation called for it.</div><div class=\"western\">“Don’t worry. We just need to rescue the hostage and retreat.”</div><div class=\"western\">“…Mm. Then let’s hurry.”</div><div class=\"western\">Neia nodded and ran with Shizu. The Vah Un, which was most definitely a worthy opponent, had been defeated.</div><div class=\"western\"></div><div class=\"western\">All that remained was to rescue the prince and return to the larder.</div><div class=\"western\"></div><div class=\"western\"><b>Part 3</b></div><div class=\"western\"></div><div class=\"western\">“…Here.”<br/><p>“Yes.”</p><br/><p>Having reached the topmost level, Shizu and Neia exchanged looks. There was only one door here. That would mean it was undoubtedly their objective.</p><br/><p>They nodded to each other, and then kicked the door in.</p></div><div class=\"western\">They had long since abandoned any thoughts of a covert entry. After all, they had just fought a big battle with the Vah Un. That said, the two of them leaned against the threshold of the door, in case someone attacked them in the instant it opened.<br/><p>However, their caution had been in vain. Therefore, they both leapt into the room at the same time. Neia grit her teeth against the pain from her shoulder and went left, while Shizu went right, and they both covered each other.</p></div><div class=\"western\">The first thing they saw was a large, canopied bed. Perhaps its lace trimmings had once been white, but age had blackened them. The room also contained a simple dresser and human-sized furniture such as a cabinet and others. These pieces of noble-styled furniture were old and damaged, and they did not look like antiques so much as used goods.</div><div class=\"western\">A quick glance across the room revealed no demihumans.<br/><p>Shizu raised her chin to signal to Neia, and Neia silently approached the cabinet before opening its doors. Of course, Neia opened it from the outside and stayed out of its way in case anything happened, while Shizu pointed the muzzle of her spell gun at the interior of the cabinet. “…Not here.”</p></div><div class=\"western\">After that, the two of them looked to the bed.</div><div class=\"western\">They checked that there was nothing underneath it, and then they approached the bed.<br/><p>Part of it was bulging up.</p><br/><p>Neia looked to Shizu before nodding to show she understood, and then she flipped up the blanket.</p><br/><p>There was a pretty-looking lump of lustrous purple meat there. No, it would be better to say it was a huge maggot. It was about 90 centimeters long, and it did not have hands, but stubby feet.</p><br/><p>Shizu pointed her gun’s muzzle at it without any hesitation, and Neia hurriedly called out to her.</p></div><div class=\"western\">“Wait! That’s the target we were sent to rescue, the prince of the Zern!”<br/><p>“…This?”</p><br/><p>That was what the Zern envoy had told Neia. However, she could understand Shizu’s doubts, because Neia had been quite confused herself when the Zern had given her the description of the Zern prince.</p><br/><p>The Zern were a species of demihumans whose royalty looked very different from other individuals of their species. In addition to that, they ought to be sexually dimorphic too.</p><br/><p>“Er, can you hear us, Zern prince-sama?”</p><br/><p>“―Mm. Speak. It seems you are not my food.”</p><br/><p>He sounded like a teenager. Neia was curious as to where his voice was coming from and examined him, whereupon she saw that his maggot mouth was opening and closing.</p></div><div class=\"western\">“That’s right. We’ve been asked to rescue you. Let’s start by getting you out of here.”<br/><p>He was still a prince, even if he looked like this, so she had to abide by the rules of etiquette. In addition, she would need his race’s help when finding the Sorcerer King. Therefore, she ought to do him a favor now, instead of offending him. “Was it a request from my eggmates (comrades)? Who asked you to do this?”</p><br/><p>“It was a Zern called Beebeebee. Do you know her?”</p><br/><p>“Beebeebee, you say? Ah, her, then? Hm… But if I leave this place, Jaldabaoth…-sama will be angry. This will place the Zern people and particularly the King in danger.”</p><br/><p>“While I’m not too sure about the details, it seems the King has passed away, so we must rescue you at the very least. That is why the Zern made this request of us.”</p><br/><p>“What!?”</p><br/><p>It was impossible for a human like Neia to read the expressions of the Zern prince, who could not be anything but a gigantic maggot. However, she could clearly sense the profound sorrow in his voice.</p><br/><p>“Oh, Father was actually… I see. That bastard Jaldabaoth… In that case, can you get us safely out of here?”</p><br/><p>“Your Highness’ underlings will be guiding us out, so I think it should be fine.”</p><br/><p>“I see… oh human heroes, who have come this far to aid me, I have a shameless request for you. Can you pretend that you carried me off by force while I was resisting you?”</p><br/><p>That request was probably just in case.</p><br/><p>“I understand. We shall pretend it is so.”</p><br/><p>“Thank you very much.”</p><br/><p>The prince raised his head. While it looked just like a maggot raising its head, this was probably how his species expressed their gratitude.</p><br/><p>Neia wrapped the prince up in the sheets like a baby ― if he had been a baby, he would have been scared to tears; she had experienced that twice now ― and carried him on her back.</p></div><div class=\"western\">She firmly tied the blanket around her chest, so it would not loosen even when she was moving vigorously.</div><div class=\"western\">The weight on her shoulder made Neia hurt. She wiped away the sweat beading on her forehead and used the necklace’s magic.</div><div class=\"western\">Her wounds healed instantly. Now she would be fine even if she had to run with the prince on her back.</div><div class=\"western\">“Are you feeling alright? If it hurts, please tell me right away.”</div><div class=\"western\">“No, I am not uncomfortable… but you smell delicious. It makes me hungry.”<br/><p>Hearing those words spoken from the vicinity of her neck made Neia shudder.”</p></div><div class=\"western\">“…What do the Zerns eat?”</div><div class=\"western\">Shizu asked a question which Neia did not want to ask.</div><div class=\"western\">“The bodily fluids of living creatures, be they alive or dead.”</div><div class=\"western\">A chill ran down Neia’s spine.</div><div class=\"western\">“…I’ll get angry if you do anything weird to my junior.”</div><div class=\"western\">“There is no need to worry. I am not hungry enough to do such a thing to the heroes who came to rescue me. While I have not been allowed to leave even once since the day they brought me here, they took care to feed me, at least.”</div><div class=\"western\">If she knew exactly what they fed him with, she would probably have dropped him like a ton of bricks, so Neia hurriedly stopped listening. Fortunately, Shizu did not ask further.</div><div class=\"western\">“…Alright, let’s go.”</div><div class=\"western\">“Okay.”</div><div class=\"western\">“Please do.”</div><div class=\"western\">After that brief exchange, the two ― three of them began to move. There was no time to waste on idle chatter during a clandestine infiltration.</div><div class=\"western\">Fortunately, they managed to return to the larder without incident. This was when Shizu raised her hand to stop them.</div><div class=\"western\">“…There are people inside.”</div><div class=\"western\">“I’ll leave them to you.”</div><div class=\"western\">Shizu readied her spell gun and forcefully opened the door.</div><div class=\"western\">Then, she stopped. Shizu looked back.</div><div class=\"western\">“…Not sure who they are. Zerns. Many of them.”</div><div class=\"western\">They ought to be the recovery team. Specifically, they were the Zerns who had brought Neia and Shizu here.</div><div class=\"western\">They had probably arrived first because Neia and Shizu had been later than they had said.</div><div class=\"western\">After entering the room, the five Zerns inside turned as one to them. The sight of these monsters with unreadable faces doing the same thing together generated a feeling inside Neia that was either fear or revulsion.</div><div class=\"western\">Neia undid the sheets on her back, and revealed the Zern prince within.</div><div class=\"western\">“Ohhh! It’s the Prince!”</div><div class=\"western\">It was Beebeebee. Neia would not have been able to tell them apart if they did not speak. However, if they were as different from each other as the prince was from them, she might not even have been able to tell if they were fellow Zern.</div><div class=\"western\">“Oh eggmates of mine. I hear my father has passed on. I know that he ― Jaldabaoth ― does not intend to keep his word. But where will we flee after betraying Jaldabaoth? He has already conquered our lands, and installed his trusted demons as their rulers… are we not destroying ourselves by choosing to rebel?”</div><div class=\"western\">“Your Highness is correct to be worried. But to him, the Zern are no different from livestock. Our hero Boobeebee was a little late to arrive before him, yet it was judged enough reason to have the flesh torn from her shoulder.”</div><div class=\"western\">“What! Boobeebee, you say!?”</div><div class=\"western\">The Prince’s shuddering told Neia that said Zern must have been of quite some status.</div><div class=\"western\">“Once everything is over, will the Zern find a place under Jaldabaoth’s rule? We have determined that the answer is no. My Prince, there is no time, let us save these words for―”</div><div class=\"western\">“―You fools. Can we leave that question until after we run? This is the turning point. Once we cross it, we must follow our course to its very end. Now is the only time we can turn back. Tell me, once we go back to our hive, once we go back to our hills, how do you intend to live on?”</div><div class=\"western\">“That… that land is vast. Surely there will be a place where we can hide.”</div><div class=\"western\">“You think so? Do you intend to have the species walk the road to destruction for this fleeting, wavering chance? Give me a more concrete, more practical solution.”</div><div class=\"western\">“In, in that case, not everyone is in service to Jaldabaoth, we could form a resistance…”</div><div class=\"western\">“You fool. That will only invite destruction from Jaldabaoth. An ant swarm draws more attention than a single ant.”</div><div class=\"western\">Beebeebee fell silent as the prince shot down each and every proposal. It would be bad if this went on. Neia and the others had carried out this dangerous operation to this stage. If the prince now went, “We can’t do it after all”, their efforts would have been wasted.</div><div class=\"western\">It was then that Neia came up with something to soothe the prince’s worries.</div><div class=\"western\">“Ah, in that case, why not have the Zern go to the Sorcerous Kingdom?”</div><div class=\"western\">“The Sorcerous Kingdom? What is that?”</div><div class=\"western\">It was not just the Zerns, but also Shizu who looked to her.</div><div class=\"western\">“Yes. It is the country where Momon resides. He is the hero who once drove off Jaldabaoth in the Kingdom.”</div><div class=\"western\">Neia sensed the Zerns were staring at her, but she did not know the implications of their looks. How could humans understand a Zern’s expressions?</div><div class=\"western\">“Is what you say true?”</div><div class=\"western\">That single sentence was enough for Neia to understand why the Zerns had kept quiet. They doubted the truth of Neia’s words. But that was only to be expected. The better one knew Jaldabaoth’s power, the harder it was to believe that anyone could defeat him.</div><div class=\"western\">“I mean every word. I learned this through reliable channels. In fact ― Shizu-san?”</div><div class=\"western\">“…She’s right. Neia speaks the truth.”</div><div class=\"western\">“Also―” this was the crucial part. Neia psyched herself up internally. “If you go to the Sorcerous Kingdom like this, I am sure they will accept you as refugees.”</div><div class=\"western\">“Refugees, you say…”</div><div class=\"western\">There was bitterness in the prince’s voice.</div><div class=\"western\">“But if you can provide information about the Sorcerer King of the Sorcerous Kingdom, I am sure that you will not be slighted even when you go there.”</div><div class=\"western\">“Hold on, hold on. Why would they be happy to hear about their own King?”</div><div class=\"western\">“Ah, yes. Right now… ah… The Sorcerer King’s location is unclear…”</div><div class=\"western\">“Is that not very bad? In the worst case scenario, he might even be dead, is that not true?”</div><div class=\"western\">“A moment please. His Majesty cannot possibly be dead. There is concrete evidence, and we are verifying it now.”</div><div class=\"western\">Neia told them about how the Sorcerer King might have fallen to the hills where the demihumans lived, so she wanted to count on their help to search for him. The prince fell silent. <i>Is it not going to work</i>? Neia thought, but since she had already made her pitch, she could say nothing more. The ball was now in their court.</div><div class=\"western\">Also, even if they could not provide any direct assistance, they ought to be able to at least provide knowledge, as they had promised.</div><div class=\"western\">“…I see. If we do them a favor… but will we be accepted, as demihumans? The Sorcerous Kingdom is a nation of humans, is it not?”</div><div class=\"western\">“No, it is not. The Sorcerous Kingdom is a nation ruled by one of the undead.”</div><div class=\"western\">“The undead!?”</div><div class=\"western\">Both the prince and the Zern surrounding him exclaimed as one.</div><div class=\"western\">“Are you telling us to go to such a dangerous place!?”</div><div class=\"western\">Every race harbored a strong hatred of the undead. Even Neia had been that way before she had come to understand the Sorcerer King. She was moved by the realization that the people before her were similar to how she had been not too long ago.</div><div class=\"western\">“A moment please. The Sorcerous Kingdom might be ruled by one of the undead, but its great ruler is an open-minded and noble king, and I have personally witnessed humans coexisting peacefully with demihumans within the country.”</div><div class=\"western\">“You’re actually calling the undead great, I can’t believe humans are so―”</div><div class=\"western\">“―That’s enough. Neia-dono, I apologize if my subjects have given offense. However, is the Sorcerer King truly as great as you say he is?”</div><div class=\"western\">“Yes.”</div><div class=\"western\">Neia held her chest high as she replied to the prince’s question.</div><div class=\"western\">“… We cannot read the expressions of human beings. But I understand that someone as brave as you ― who has delved deep behind enemy lines in order to effect a daring rescue ― must be making such a statement with the utmost confidence. Therefore, I shall believe in him as well ― not the Sorcerer King who is one of the undead, but the Sorcerer King in whom you have placed your faith. Let us entrust ourselves to the Sorcerer King, then.”</div><div class=\"western\">“Ohhhh!” the Zerns cried out in joy.</div><div class=\"western\">“It seems we have reached a decision. In that case, I pray you will flee to the Sorcerous Kingdom with all due haste, my prince. Unfortunately, there is some very bad news, namely that one of Jaldabaoth’s trusted demons will be coming soon. I thought it would be a few more days before he arrived… but it will be bad if we are found. Alright, let’s go.”</div><div class=\"western\">As a species, the Zern were largely composed of females, with very few males. Pretty much only the king and the prince fell into the latter category. If a tribe’s males were wiped out ― although there were cases where females could change sex ― the tribe would be set on the path to extinction.</div><div class=\"western\">Therefore, the prince needed to flee to an absolutely safe place ― the Sorcerous Kingdom, which was why they had had the preceding discussion.</div><div class=\"western\">“Jaldabaoth’s trusted demon? He’s coming?”</div><div class=\"western\">There was a word the Zerns had said which she could not ignore.</div><div class=\"western\">“Mmm. Have you not seen him? He has three trusted demons by his side, and one of them is coming here.”</div><div class=\"western\">“…We need to defeat him here.”</div><div class=\"western\">As he heard Shizu’s words, the prince ― who had been left on the ground ― suddenly thrashed around.</div><div class=\"western\">“Are you insane!? You two must be quite strong to have been able to rescue me, but even then, you’ll never be able to defeat him!”</div><div class=\"western\">The label of “strong” only applied to Shizu, but Neia could not find a chance to cut in and thus she could not clear things up.</div><div class=\"western\">“…They say he teleports between many cities… Him coming here is a rare opportunity. If you miss it, you won’t get another chance.”</div><div class=\"western\">“That is true…”</div><div class=\"western\">“My prince!”</div><div class=\"western\">“Calm down and think about it. If we can kill one of Jaldabaoth’s aides, his chain of command will fall into chaos, and it will be harder for them to find us, who are not heading for the hills but for the Sorcerous Kingdom… then, is it possible to defeat him?”</div><div class=\"western\">“…Don’t know. But this is the only chance.”</div><div class=\"western\">“Then let’s take it. I’ll bet on the strength that let the two of you kill the Vah Un!” the Prince said. He had been quite shocked when he saw the demihuman’s corpse on the way back. “Listen well, all of you. From now on, we will help the two of them defeat the wicked Jaldabaoth’s minion!”</div><div class=\"western\">“Yes!”</div><div class=\"western\">“There are two humans, and six of us. Until recently, the eight of us were mutual enemies, but now we are comrades in arms. Such is the stuff of which heroic sagas sing.”</div><div class=\"western\"><i>Eh? </i>Surprised, Neia rechecked the number of Zern present, and after seeing that she had not been mistaken, she hurriedly spoke up.</div><div class=\"western\">“Wait, please wait. You don’t need to get involved in this, my prince. After all, we came here to protect you!”</div><div class=\"western\">In addition, what could this prince do in combat? However kindly one wanted to interpret his intentions, he was still a gigantic maggot that crawled on the ground. Honestly, it would be less troublesome if he simply followed them like a battle standard.</div><div class=\"western\">“I see, so to you, your mission is over since you have helped me escape. I see, I see. However, with my help, it should be easier to defeat Jaldabaoth’s henchman. No, I should say that without me, it will be very hard for you to defeat him, even if you are the heroes who defeated the Vah Un.”</div><div class=\"western\">Shizu had defeated the Vah Un by herself. Neia had nothing to do with it. Even so, the prince still counted her as a hero, which made her very embarrassed.</div><div class=\"western\">“So, do you mean that we can do it if we get the help of all the Zerns?”</div><div class=\"western\">The prince made a strange noise.</div><div class=\"western\">“No, no, great heroes. It’s not like that. I can cast spiritual spells of the fourth tier.”</div><div class=\"western\">“The fourth tier?”</div><div class=\"western\">Neia was surprised. The fourth tier of magic was a realm that only geniuses could barely reach after much hard work. In the Holy Kingdom, the only people who could cast such spells were the high priestess Kelart Custodio and the Holy Queen Calca Bessarez.</div><div class=\"western\">Neia glanced to the side, thinking Shizu would be as surprised as herself, but Shizu’s face was as blank as ever. That was a difficulty rating 150 maid demon for you ― such things did not even faze her..</div><div class=\"western\">“A…ah…are all the Zern as powerful as you?”</div><div class=\"western\">The prince made another strange sound, and thrashed like a caught fish.</div><div class=\"western\">“I am special.”</div><div class=\"western\">“Precisely. That’s why he is the prince.”</div><div class=\"western\">After hearing the Zern’s proud voice, Neia mused, <i>I see</i>, and recalled the contents of the classes she had once taken.</div><div class=\"western\"><i>That’s right. The royalty of some species are so much more powerful than the commoners that they seem like a different species entirely…</i></div><div class=\"western\">“That said, I do have a weakness… namely, I am very slow.”</div><div class=\"western\"><i>Well that’s true,</i> Neia thought. That much was obvious at a glance.</div><div class=\"western\">“If someone gets close to me, I’ll be killed without the chance to fight back. Therefore, may I trouble you to carry me? I can cast spells when signalled.”</div><div class=\"western\">“I see. I understand what you wish to do. However, could the Zern ― that is to say, your royal guards ― not carry you instead of ourselves?”</div><div class=\"western\">“Unlike our prince, we specialize in melee combat. The two of you fight from a distance, I believe?”</div><div class=\"western\">“That is true… hm. It would be better if Shizu-san or I carried him… no, let’s leave that aside for now. It would be bad if we dragged the prince into this and he ended up dying.”</div><div class=\"western\">“…Neia. There is a special meaning to carrying the prince… That’s why he suggested going with us.”</div><div class=\"western\">“Fufufu. Indeed, there is. I say, do you know anything about him? That withered-tree demon who decorates himself with heads?”</div><div class=\"western\">“…There are several demons like that. Silk Hats, Crowns, Circlets, and Corollas.”</div><div class=\"western\">Shizu counted the four types off on her fingers.</div><div class=\"western\">“…I believe that henchman demon must be one of them. But… if we encounter a Silk Hat, we ought to flee. Even I could not win against one.”</div><div class=\"western\">“So you knew!?”</div><div class=\"western\">Neia was surprised, and then that feeling was replaced by anger. When they had prepared for the mission, Shizu had said that she did not know much about the henchman demons.</div><div class=\"western\">Had she lied to them?</div><div class=\"western\">This was because if she was trying to keep information on Jaldabaoth’s army from the Holy Kingdom, it would mean that Shizu had never been under the Sorcerer King’s control from the start. It also meant that Shizu’s existence did not prove anything about the Sorcerer King’s safety,</div><div class=\"western\">“…I trusted you! And in the end you were lying to me from the start!”</div><div class=\"western\">Caught up in her emotions, Neia seized Shizu by the shoulders. She used a lot of force, but the maid demon did not seem hurt. It was not because Shizu had no emotions, but because that amount of strength was nothing to her.</div><div class=\"western\">The unbearable regret and resentment made Neia want to cry. She had thought that she had forged a bond with Shizu, but in the end she had turned out to be nothing more than a laughingstock. Neia could not help mocking herself.</div><div class=\"western\">Shizu’s face was as blank as ever. However, there was a subtle change there which only Neia could read.</div><div class=\"western\">It was distress, contemplation, or perhaps ― remorse.</div><div class=\"western\">“…I’m sorry.”</div><div class=\"western\">Shizu squeezed those words out after a long silence. It hardly qualified as an apology ― in fact, it only served to stoke the flames of her anger. But right now, Shizu seemed strangely helpless, and seeing her like this helped Neia regain a bit of her composure.</div><div class=\"western\">Carefully, like she was doing something she had never tried before, Shizu quietly continued.</div><div class=\"western\">“…If you knew how strong the henchman demon was, you and the others might have been afraid and not carried out the operation. But for the sake of Ainz-sama’s victory… we must win this battle. That was why I lied.”</div><div class=\"western\">Every word she said had been carefully considered before being put together into a heartfelt, agonized statement. But those words also contained a genuine and immovable faith.</div><div class=\"western\">Neia did not know how to see through her lies. Not to mention she was a demon ― no, even if she were not a demon, Neia would not be able to tell if a blank-faced girl like her was speaking the truth.</div><div class=\"western\">However, even if she were feeding information to Jaldabaoth as a spy, or trying to bring down the Holy Kingdom from the inside, Shizu’s actions until now did not match up to those motivations. She ought to have acted more sensibly.</div><div class=\"western\">And more than anything else, Neia wanted to believe Shizu. Part of that was because her existence was a testament to the Sorcerer King’s survival, but also because the mysterious connection she had to Shizu was irreplaceable to Neia.</div><div class=\"western\">“…All right. I believe you. But please, don’t look down on me any more. I would gladly face any danger or fear for His Majesty’s sake.”</div><div class=\"western\">Shizu looked visibly relieved. As expected, she could not have been a spy. As for why, that was because she was clearly not suited for it. As she thought that, a natural, unforced smile came back to Neia’s face.</div><div class=\"western\">“Alright, alright, can we get back to the previous topic? If you know so much about them, can you tell us about that demon’s abilities?”</div><div class=\"western\">“These demons all possess the same abilities, but they are not very strong in their base forms. However, the problem arises when these demons are able to obtain the heads of intelligent creatures… particularly those of magic casters.”</div><div class=\"western\">According to Shizu, demons of that type could equip themselves with the heads of magic casters and use the powers of the heads’ owners. Silk Hats could use four heads at once, Crowns could use three, Circlets could use two, and Corollas could use one. Their threat level rose exponentially if they managed to obtain the heads of exceptional magic casters.</div><div class=\"western\">“No matter how good a head a Corolla equips, it can only cast spells of up to the third tier. Silk Hats, on the other hand, can cast spells of up to the tenth―”</div><div class=\"western\">“Wait!”</div><div class=\"western\">“Hold on!”</div><div class=\"western\">Both the prince and Neia interrupted Shizu.</div><div class=\"western\">Neia and the prince exchanged looks. While Neia could not read the prince’s face, Neia was certain that he was thinking the same thing as her.</div><div class=\"western\">“…After you.”</div><div class=\"western\">“Umu… er, did you say tenth tier? Are fifth tier spells not the highest tier of magic?”</div><div class=\"western\">It was as the prince said. Neia had heard that this was the limit of magic. The reason why she felt that the Sorcerer King could use sixth tier spells also stemmed from that.</div><div class=\"western\">In response to the prince’s question, Shizu shook her head as if to say, <i>Haa, what will I do with you?</i></div><div class=\"western\">“…The tenth tier is the highest tier of magic. The spell that Jaldabaoth used to call down meteors from the sky also belongs to that tier.”</div><div class=\"western\">“How, how can we beat ― eh? Eh? No way! Don’t tell me, His Majesty, who stood with Jaldabaoth…”</div><div class=\"western\">As the shocking truth hit Neia, the prince was also shuddering in shock.</div><div class=\"western\">“The tenth tier? No. It can’t be, right? The tenth tier… Could it be true… And to think, I was so proud of myself and my fourth tier…”</div><div class=\"western\">No, the fourth tier was already very powerful. He would have been justified in being arrogant. There were precious few magic casters who could reach that level.</div><div class=\"western\">“Shizu… I’d like to check something, but… can His Majesty use spells of the tenth tier… too?”</div><div class=\"western\">“…But of course.”</div><div class=\"western\"><i>Why are you still saying this?</i> Shizu’s tone seemed to imply. She sounded like she was rolling her eyes. It might have been the first time that Neia had so clearly discerned Shizu’s feelings.</div><div class=\"western\">The prince, who was a fellow magic caster, was twitching from the tremendous shock.</div><div class=\"western\">“Hah? Hah? So the king of the land to which we are fleeing ― the Sorcerer King ― is such a powerful undead being? Does mastery of the tenth tier mean he is over twice as powerful as me?”</div><div class=\"western\">“…Haaa.” Shizu sighed deeply. “His Majesty.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">“…Call him His Majesty.”</div><div class=\"western\">“Ah, yes, yes. His Majesty is truly powerful…”</div><div class=\"western\">When one thought calmly about it, Shizu had actually been quite brusque with the prince of an entire tribe, but since Shizu was speaking about matters of fact, Neia tacitly acknowledged her actions as she expressed her agreement.</div><div class=\"western\">“Indeed, Prince-sama. His Majesty is incredibly powerful!”</div><div class=\"western\">“Ah, yes.”</div><div class=\"western\">“…Prince. If you could find someone that powerful, he would be in your debt!”</div><div class=\"western\">“You, you’re absolutely right! Then we shall give your earlier proposal ― to search for His Majesty in the hills ― our fullest support!”</div><div class=\"western\">Neia clenched her fists in excitement.</div><div class=\"western\">“Thank you very much, Prince-sama. ―Now then, Shizu, could you continue what you were saying just now?”</div><div class=\"western\">“…About how powerful Ainz-sama is?”</div><div class=\"western\">“We were talking about that henchman of Jaldabaoth. Ah, I’d like to hear about the Sorcerer King as well ― could you tell me more after we return safely?”</div><div class=\"western\">“…Hm. Multi-head demons with multiple equipped heads can use them all at once and cast multiple spells at a time, but there are several conditions. First, each head can only use two spells at once. In addition, there is a limit on how many tiers of spells which can be cast at once. For instance, Silk Hats can cast a maximum of 15 tiers of spells at once―”</div><div class=\"western\">“―15 tiers! Do spells go up to a maximum of 15 tiers!?”</div><div class=\"western\">“…They don’t go that high. The tiers of the spells added together can be up to 15.”</div><div class=\"western\">The prince writhed in relief at Shizu’s answer.</div><div class=\"western\">The fact that Neia could surmise a bit of how the prince felt through his actions began to frighten her.</div><div class=\"western\">“…Moving on. The important thing is how many heads that demon can equip at once.”</div><div class=\"western\">“Two. One is a demihuman head, and the other is the head of a human like yourselves.”</div><div class=\"western\">Neia had a bad feeling about this. Jaldabaoth had been holding a human body back then. Had its upper half not been missing?</div><div class=\"western\">“What was that human head like, Prince-sama?”</div><div class=\"western\">“Unfortunately, I cannot tell apart individuals of species other than my own. Ah, I do know about the other head. It belonged to the queen of the demihuman species called the Pandecks. Her name was the Grand Mother.”</div><div class=\"western\">Neia wanted to ask more about the Pandecks and the Grand Mother, but Neia had more pressing things she needed to learn.</div><div class=\"western\">“I’d like to ask about the human. What color was her hair?”</div><div class=\"western\">“By hair do you mean the fur on the head? It was light black.”</div><div class=\"western\">“Black? So it doesn’t belong to someone from the Holy Kingdom?”</div><div class=\"western\">Neia’s heart was somewhat at ease. For a moment, she had wondered if the head belonged to the Holy Queen. Now that her guess had been proven wrong, she felt a sense of profound relief. At the same time, Neia noted that this might be a hint to another riddle.</div><div class=\"western\">She had heard that humans from the southern regions generally had black hair. <i>So that’s it,</i> Neia thought. <i>Had Jaldabaoth come from there,</i> she wondered.</div><div class=\"western\">To the Holy Kingdom, the southern regions were not a land that was ruled by humans. Less than half the population was human, and many of those had the blood of other species, and that number was steadily increasing. According to what Neia knew, only the Holy Kingdom, the Empire, and the Kingdom were ruled by human royalty. The City-State Alliance and the Theocracy did not have royal families.</div><div class=\"western\">So that was why no news about Jaldabaoth had reached these human-dominated countries.</div><div class=\"western\">“…Incidentally, multi-head demons cannot use the abilities of heads which do not belong to magic casters. They do not gain the abilities of warriors by equipping a warrior’s head. That is because there are other demons with those abilities.”</div><div class=\"western\">“In that case, the demihuman’s head… Prince-sama. Can you tell us a bit about that Grand Mother?”</div><div class=\"western\">“All right. That is why I want to fight with you. The Pandecks are a species that feed on moss, and they look like us.”</div><div class=\"western\">In other words, they looked like maggots.</div><div class=\"western\">Neia felt a twinge of revulsion at the thought of a demon that adorned itself with the head of maggots.</div><div class=\"western\">“…Was the Grand Mother also a spiritual magic caster?”</div><div class=\"western\">“Indeed. I use the Yin principle of the Five Elements, but the Grand Mother was the opposite; she used the Yang principle of the Five Elements. Yin and Yang are two extremes, and spells of one can resist or hamper spells of the other.”</div><div class=\"western\">“…I see,” Shizu nodded. “Letting him come with us would improve our chances.”</div><div class=\"western\">“Mm. I am glad that you understand. Personally, I am very unhappy that a demon is using the head of the Grand Mother. Indeed. She was my first love, after all.”</div><div class=\"western\">“My prince!”</div><div class=\"western\">“What are you saying! How could you fall for a female of another species!”</div><div class=\"western\">“Ahhh! That was a childish crush! It’s different now!”</div><div class=\"western\">While it sounded like a saccharine-sweet topic, all she felt about a maggot’s first love was utter disgust.</div><div class=\"western\">“In, in that case, assuming our enemy is a Circlet who can equip two heads at once, how many total spell tiers can it cast at one time?”</div><div class=\"western\">“…A maximum of six tiers. Incidentally, Crowns can cast a maximum of ten tiers.”</div><div class=\"western\">“Then if I use fourth tier spells, it will only be able to cast spells of the second tier. Of course, that is simply nullifying that bastard, so you still have to be careful…”</div><div class=\"western\">“…Next is that human head. We know too little about it. Neia?”</div><div class=\"western\">“I’m sorry. I regret to say I do not know the black-haired person. Still, I’m quite surprised. I thought that you would just jump right into the fight, since you’re Shizu.”</div><div class=\"western\">“…Ainz-sama said collecting information is very important.”</div><div class=\"western\">“Ahh, as expected of His Majesty. What an excellent notion!”</div><div class=\"western\">As Neia said this, Shizu reached a hand out to her, and Neia immediately grabbed it and shook.</div><div class=\"western\">“…Good girl. If you were cuter, I’d put a sticker on you. Maybe a furry sticker.”</div><div class=\"western\">“…A sticker? Ah, you put one on me already, so I don’t need another. Please paste it on someone else you like.”</div><div class=\"western\">“…Mm. You’re the first person to dislike my stickers.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">Neia exclaimed in surprise as Shizu said that she was her first. After that, she immediately realized that perhaps she ― as a demon ― had not had many dealings with humans. No, it was possible that others might have despised her in their hearts but had not dared to voice it, due to their fear of her as a demon. While she wanted to poke fun at her for it, Neia could not do anything like spoil the fun of someone who was loyal to the same supreme being as her. Thus, Neia simply let it pass with a bitter smile.</div><div class=\"western\">“…Indeed, humans do not have fur, much like we Zerns. That is why they live in houses like these. Why not dig holes like we do?”</div><div class=\"western\">“Prince, we’re straying off-topic. We don’t have much time ― we need to deal with this before the humans attack this city.”</div><div class=\"western\">“…Mm. In conclusion, the prince will be going too.”</div><div class=\"western\">Nobody spoke up against it. Or rather, Neia had been the only one to voice her opposition to it.</div><div class=\"western\">“Regarding our tactics, we will handle the frontline, but what should we do if there are guards who block us? Allowing a spellcasting opponent to move freely is very dangerous.”</div><div class=\"western\">“…I’ll engage it in close quarters combat.”</div><div class=\"western\">Nobody asked if she could do it. She was half of the team which could defeat the guardian Vah Un ― although that was all Shizu’s work ― or so everyone said. Nobody doubted Shizu’s abilities.</div><div class=\"western\">“All right. Then let’s move. Before approaching the henchman, place us in the barrels and move us in. If you tell them you’re bringing food to the henchman demon on his orders, you’ll be able to get close to him.”</div><div class=\"western\">By “us,” the prince was referring to himself, Neia, and Shizu. As long as the three of them remained undetected, they could continue maintaining their deception ― the Zern betrayal had not been detected. This was a tactic that could only be put into effect now.</div><div class=\"western\">Once again, Shizu and Neia hid inside the barrels they had used to enter the city.</div><div class=\"western\">“Shizu-san. We’re really lucky.”</div><div class=\"western\">Shizu poked her head out of the barrel.</div><div class=\"western\">“…Why is that?”</div><div class=\"western\">“Look. Everything’s going well for us. Thanks to the Zern’s betrayal, we managed to save the prince, and even Jaldabaoth’s henchman is here. If we defeat him, we’ll have achieved a great accomplishment. That way, nobody will be able to speak ill of us any more. We’ll also be able to easily assemble a rescue party to find His Majesty.”</div><div class=\"western\">“It was all coincidence.”</div><div class=\"western\">Neia was defeated by Shizu’s somewhat harsh tone.</div><div class=\"western\">“Eh? Ah, i-is that wrong? We’re lucky because it was a coincidence… well, we were this successful because His Majesty made you his property, so I guess in that sense, it’s not really a coincidence.”</div><div class=\"western\">“Ainz-sama’s… property…”</div><div class=\"western\">“Ah, maybe property wasn’t the right word, huh?”</div><div class=\"western\">“…I don’t mind. Neia.”</div><div class=\"western\">“Eh?”</div><div class=\"western\">“…I like you very much. You’re not cute, but I don’t mind giving you another sticker.”</div><div class=\"western\">It hurt a little to be called “not cute” over and over again, and as she thought this, Neia said, “Never mind,” and ducked back into her barrel.</div><div class=\"western\"></div><div class=\"western\"><b>Part 4</b></div><div class=\"western\"></div><div class=\"western\">The Zerns were stopped by other demihumans several times as they moved Neia, Shizu, and the prince in their barrels, but none of the barrels were opened and searched. In this way, the three of them reached the vicinity of the henchman demon’s office.</div><div class=\"western\">Neia and the others emerged from the barrels.</div><div class=\"western\">They had peeked outside from within the barrels, but security had not grown tight. It would seem the prince’s rescue had not yet been exposed.</div><div class=\"western\">Neia slung the prince onto her back, and as she secured him with a rope, one of the Zern went ahead to seek an audience with the henchman demon. This was a form of reconnaissance.</div><div class=\"western\">Once everyone had finished their preparations to barge in, the Zern returned.</div><div class=\"western\">“He’s alone, no guards.”</div><div class=\"western\">Neia frowned.</div><div class=\"western\">Now that Jaldabaoth had been hurt so badly, was he ― as one of only three henchman demons ― not going to strengthen his defences? Or had he relaxed now that the Sorcerer King was dead?</div><div class=\"western\">As all kinds of questions swirled around in her head, the only thing that mattered was the prince’s summation.</div><div class=\"western\">“That means it’s the perfect opportunity to kill him. Let’s go.”</div><div class=\"western\">In accordance with the prince’s words, they all moved into action.</div><div class=\"western\">One of the Zerns opened the door, and Neia ― who stood at the head of the group ― could clearly see what was inside the room.</div><div class=\"western\">The expansive office had a ceiling that was a full five meters tall, and it was very spacious. Due to its many superior furnishings, it gave off the impression of a stereotypical luxury suite.</div><div class=\"western\">There was a black, solid-looking table, and behind it, a hideous monster, which spoke.</div><div class=\"western\">“Humans? Zer…”</div><div class=\"western\">It seemed to be saying something. However, they were not here to talk.</div><div class=\"western\">The prince immediately cast a spell from Neia’s back.</div><div class=\"western\">“「Yin – Five Elements – Grand Fireball」.”</div><div class=\"western\">A feeble, flickering flame flew past Neia like it had been thrown into the room. She had heard along the way here that it was a fourth tier attack spell that was named for its attack power. It was typically the first thing into a room because it would explode upon making contact with anything. However―</div><div class=\"western\">“「Yang – Five Elements – Grand Fireball」.”</div><div class=\"western\">The flame vanished halfway, like it had been snuffed out by the wind.</div><div class=\"western\">“I knew it…” the prince muttered hatefully.</div><div class=\"western\">He did not cast again. That spell had been an experiment. While he had planned to press the attack if it had not been negated, unfortunately that had not been the case. Since he did not intend to waste mana, he would wait to cast spells in accordance with their attacks.</div><div class=\"western\">“…Is that the Zern prince on the human’s back? It doesn’t look like the humans captured him and brought him here… Kuhahaha. It’s treason, then? Interesting.”</div><div class=\"western\">The great demon looked like it had come from a nightmare as it slowly got to its feet, like a mockery of a human being.</div><div class=\"western\">It was completely naked, so its arms ― that reached down to its knees ― and its legs and skin-and-bones body were completely exposed.</div><div class=\"western\">Its body resembled withered wood, so slender and fragile that even Neia felt that she could break it.</div><div class=\"western\">That withered wood body did not have a head. There was nothing but a straight line extending from shoulder to shoulder. No, there was a slender ― thinner than a woman’s wrist ― branch protruding from its neck region. There were two fruits on it. Those must have been the so-called heads of this great demon.</div><div class=\"western\">“Eh? ―Ah.”</div><div class=\"western\">Neia could not help squeaking like that. Such was her shock that it was the only sound she could make at first.</div><div class=\"western\">Like Shizu had said, this was the special characteristic of Circlets ― two heads.</div><div class=\"western\">One of them belonged to a monstrous-looking maggot. It looked very much like the prince, and given the impression of what she had heard, it was probably the Grand Mother. The problem was the other head.</div><div class=\"western\">It belonged to a woman, her eyes rolled up into her head and her mouth gaping open like a fish. Her skin looked ghastly pale, but the head did not seem rotted or otherwise damaged, and her blonde hair was even gleaming. She could see bright red flesh at the plane where the head had been severed from the body, and it looked moist enough to bleed. While the fact that the head looked like it had been freshly removed was quite mysterious, that was how she could immediately tell who it belonged to.</div><div class=\"western\">(TL note: In a tweet, Maru mentions that he forgot to mention that Kelart’s brown hair was so shiny it looked blonde)</div><div class=\"western\">“Kelart Custodio-sama…”</div><div class=\"western\">While she had only seen her from afar, there was no way she could have mistaken her for anyone else. She was the highest ranking priest of the Holy Kingdom.</div><div class=\"western\">Confusion and doubt swirled within Neia.</div><div class=\"western\">What was going on? Had the Zern lied? Did they think Neia and Shizu would consider fleeing if they knew it was Kelart?</div><div class=\"western\">“I see. I see. I see. Oh Zern, does this mean you no longer care what happens to your king and the people in that land. I’ll give you one last chance. If you seize these people, I can let you off with a mild punishment. How about that?”</div><div class=\"western\">The two heads― which looked like bizarre fruits ― did not move. Neither did those white eyeballs. They seemed like nothing more than decorations. In that case, where had that voice come from?</div><div class=\"western\">The prince paid no heed to Neia’s question and castigated the great demon.</div><div class=\"western\">His Zern underlings immediately moved into position to attack at any time.</div><div class=\"western\">“Hmph! What else is there to say at this point? Who’d believe you after you killed the king!?”</div><div class=\"western\">“The king? Is that so…”</div><div class=\"western\">Neia heard what seemed to be surprise in that voice. Reading that was difficult because this demon did not have a head of its own and its expression did not change. That made it difficult to see if one’s attack had been effective from the enemy’s reaction. In that respect, Zerns were also troublesome opponents for humans.</div><div class=\"western\">“My duty is to rule this place. That matter was outside of my jurisdiction… I see, so it was killed? That was because your king was a fool.”</div><div class=\"western\">“What!”</div><div class=\"western\">“My. My. My. Dear traitors, don’t tell me you came merely to speak? You came here because you thought you could defeat me, no? In that case ― what is your trump card? That human?”</div><div class=\"western\">A finger raised itself, tipped with a claw that should have been over 60 centimeters long. It pointed at Neia.</div><div class=\"western\">“As if I’d tell you!”</div><div class=\"western\">The great demon calmly responded to the prince’s outburst:</div><div class=\"western\">“You don’t have to. Shadow Demons.”</div><div class=\"western\">The great demon’s shadow stretched out in a sliding motion.</div><div class=\"western\">It swelled up, going from a flat plane to three-dimensional. It looked like the commonly spoken image of a demon, but dyed completely black. And there were two of them.</div><div class=\"western\">That was probably why it did not have demihuman guards by its side.</div><div class=\"western\">“Kill all the Zern other than the prince. I will seize the prince… Human, if you betray them, I can spare the people in the camps who are valuable to you, up to the number of fingers on two hands.”</div><div class=\"western\">The great demon had made the same proposal Shizu had expected it to.</div><div class=\"western\">As Neia filled with respect for Shizu’s keen insight, she decided to reply in order to make it careless.</div><div class=\"western\">“Really?”</div><div class=\"western\">After she carefully asked her question, she could hear joy in the demon’s voice.</div><div class=\"western\">“What are you saying!? Are you betraying us!?” the prince shouted from Neia’s back, and so the great demon’s attention was completely focused on Neia.</div><div class=\"western\">“Shut up. Shut up. Shut up. I’m talking to her… I am a being of my word. Tell me how many people you want to protect and help. If the fingers on two hands are not enough, we can continue discussions―”</div><div class=\"western\">The defenseless demon seemed to have forgotten the meaning of caution, and it was full of openings.</div><div class=\"western\">Their hidden trump card (Shizu) did not miss that. She leapt out of the shadow of the door and raised her spell gun.</div><div class=\"western\">The muzzle spat fire, and the great demon grabbed its shoulder and stumbled back.</div><div class=\"western\">Shizu had been waiting alone outside the room for the right timing to launch this surprise attack, and it signalled the start of the hostilities.</div><div class=\"western\">The negotiations which had been intended to manipulate their opponent into carelessness were now over. The Zern honor guards sprang at the Shadow Demons. Shizu rushed into the room with fearsome speed, slipped past the the frontliners of both sides with lightning-fast footwork, and closed in on the great demon.</div><div><div class=\"western\">“What! The Sorcerer―”</div><div class=\"western\">“…No need to explain.”</div><div class=\"western\">Shizu hacked with her dagger, and the great demon parried with its claws.</div><div class=\"western\">While she knew that there was little time for such things once the battle started, Neia vented her unhappiness on the prince behind her.</div><div class=\"western\">“What do you mean, black hair! Isn’t her hair blonde!?”</div><div class=\"western\">“Blonde? How is that blonde! It’s light black, isn’t it?”</div><div class=\"western\">“Eh?”</div><div class=\"western\">He did not sound like he was lying. Could it be ― Zerns perceived colors differently from human beings?</div><div class=\"western\">Neia had once heard that certain species with complete darkvision could not tell colors apart, only black and white. There were also some who could not discern colors in dark places.</div><div class=\"western\">The light in the larder was probably so those species could see what color their food was.</div><div class=\"western\">“I”ll tell you later! 「Yin – Five Elements – Lightning Claw」!”</div><div class=\"western\">“Tch! 「Yang – Five Elements – Lightning Claw」!”</div><div class=\"western\">A stroke of electricity hurtled through the air like the swipe of a beast’s talons, but it fizzled out halfway through.</div><div class=\"western\">While there were spells like 「Five Elements – Soften Steel」 which decreased defensive strength and spells like「Five Elements – Harden Steel」 which increased attack power, as well as summoning spells like 「Five Elements – Call The Lightning Lord」, the opposition might not have negated those and instead cast a high tier spell upon Neia and the others.</div><div class=\"western\">In order to avoid that, the prince simply cast attack spells, which the enemy could not ignore. In addition, he focused on using electricity-element spells, which the enemy should not have been able to resist, and then he used a special ability called Wood Element Strengthening upon them. While the demon’s elementalism should have been able to protect against it, the prince’s augmented spell could not be fully negated, and so it began to take minor damage.</div><div class=\"western\">While the original Grand Mother could have used strengthening techniques just like the prince had, she was now nothing more than an accessory for the great demon. The demon did not possess strengthening techniques of its own and the prince’s spellcasting overpowered it.</div><div class=\"western\">Since Shizu was taking the role of frontliner, Neia had to do her job as the rear guard. She could not simply serve as transportation for the prince in the face of such a mighty foe. She loosed an arrow from the Ultimate Shootingstar Super which she held.</div><div class=\"western\">While her shot against the main body was highly accurate, the great demon easily batted it away with his hand.</div><div class=\"western\">“Out of my way. 「Shock Wave」.”</div><div class=\"western\">Kelart’s face ― her lips moved, and she cast a second tier attack spell at Shizu. While Shizu’s body lifted off the ground from an impact that was invisible to the human eye, she did not seem to have taken any damage which could have hampered her movements. Neia had expected nothing less of a difficulty rating 150 maid demon.</div><div class=\"western\">“「Yin – Five Elements – Lightning Claw」”</div><div class=\"western\">“「Yang – Five Elements – Lightning Claw」”</div><div class=\"western\">They cast the same spells at each other again, and a feeble current of electricity surged past the demon’s body.</div><div class=\"western\">“「Open Wounds」!”</div><div class=\"western\">That counterattack was a spell that would worsen any wounds. Naturally, it was targeted at Shizu, who was being attacked by the demon’s claws.</div><div class=\"western\">All she could see was Shizu’s back. However, her dexterity did not seem to have decreased.</div><div class=\"western\">Sweat ran down Neia’s back.</div><div class=\"western\">Neia was the only one among her allies who could heal. Therefore, she was naturally the healer. However, while she could tell how badly she was hurt, she lacked the combat experience to tell how severe others’ wounds were. In particular, unexpressive people like Shizu might exceed their limits and collapse before she realized something was wrong with them. Therefore, Neia had to pay close attention to what Shizu and the prince were up to. It was just like doing one thing with her right hand while doing another with her left, and she was so busy that she began to get confused.</div><div class=\"western\">Still, she had to do this.</div><div class=\"western\">The prince kept casting attack spells, while Shizu took minor damage as she swung at the demon with her knife. Both of them were carrying out their tasks to perfection, and she could not simply give up and say that she was the only one who could not do her part.</div><div class=\"western\">“「Heavy Recover」.”</div><div class=\"western\">Neia judged that Shizu had been badly hurt, so she activated the item the Sorcerer King had lent her and cast a third tier healing spell on Shizu.</div><div class=\"western\">“I see!”</div><div class=\"western\">Neia’s instincts told her that the attention of the faceless demon was on her.</div><div class=\"western\">The great demon’s words implied that it knew the identity of the healer ― who ought to be destroyed first. In fact, the great demon still had enough strength to cast an attack spell on Neia after negating the prince’s spell.</div><div class=\"western\">“「Shockwave」.”</div><div class=\"western\">An invisible pulse of force hit her like a warhammer.</div><div class=\"western\">She could hear sickening cracks from inside her body, and she writhed in agony from the pain which coursed through her.</div><div class=\"western\">It hurt more than the spell the Vah Un had used on her. She could not believe Shizu had taken an attack like this with such a straight face. She now knew why Kelart Custodio had been hailed as a genius. It was because of that powerful hit.</div><div class=\"western\">“Aieeee!”</div><div class=\"western\">Neia grit her teeth, but she could not prevent a choked cry of pain from escaping her.</div><div class=\"western\">“Are you alright!?”</div><div class=\"western\">“I, I’m fine!”</div><div class=\"western\">Neia answered the prince, who was worried for her.</div><div class=\"western\">“I’ll call all the Zern―”</div><div class=\"western\">“―No. I’ll protect Neia.”</div><div class=\"western\">Shizu spread her arms, standing like she was shielding Neia.</div><div class=\"western\">The great demon was huge, and he made Shizu look tiny. Therefore, he must be able to see Neia without any impediment. However, Neia was very happy inside.</div><div class=\"western\">“What!? Ahhhh!”</div><div class=\"western\">The demon cried out in a hoarse voice. It would seem Shizu had done something to him, which had had an effect.</div><div class=\"western\"><i>Did she use a special ability? Or was it a spell?</i></div><div class=\"western\">She was not sure what exactly had happened, but Neia sensed the great demon’s hostility weakening. Of course, she was probably imagining things. After all, there was no reason why this great demon should want to kill her any less right now.</div><div class=\"western\">If there was another attack like the last one, another spell as powerful as the last one, she ought to be able to bear it. No, she wanted to bear it.</div><div class=\"western\">She had recovered the mana she had lost during the battle with the Vah Un, but the number of times she could use 「Heavy Recover」 was still unknown, so it was best to save as many uses as possible. However, waiting until the last moment to heal also meant that the slightest mistake would send her over the brink. Accurately judging the right time to heal was very difficult.</div><div class=\"western\">“And she’s wielding the bow that Ainz-sama lent her!”</div><div class=\"western\">Shizu’s voice sounded very loud for her. She was probably raising her volume to better praise the Sorcerer King. This was a life and death battle, but she could not bring herself to mention it. After all, the person doing this was Shizu, the strongest person on their side, and there was an aura of veterancy. She might have a plan in mind.</div><div class=\"western\">“What!? You mean, that Sorcerer King!?”</div><div class=\"western\">There was surprise in the henchman demon’s voice. That was the Sorcerer King for you. He must have heard from Jaldabaoth that he was an opponent to be wary of.</div><div class=\"western\">“Yes! It’s a runecrafted bow!”</div><div class=\"western\">Having heard something she could not overlook, Neia cautioned Shizu.</div><div class=\"western\">“Shizu! Don’t tell him about us!”</div><div class=\"western\">“What! So it was a weapon made with the ancient, lost art of runecraft! A weapon like that might even be able to kill me!”</div><div class=\"western\"><i>Why was he explaining that in such detail?</i> As Neia thought that, she immediately felt ashamed. Right now, she was fighting with an incredibly powerful adversary with her life on the line. A weakling like herself did not have the luxury of contemplating such matters.</div><div class=\"western\">“So it <i>was</i> runecraft! Amazing!”</div><div class=\"western\">The henchman demon kept on speaking in a very cautious tone. Perhaps it was doing so to distract Neia. In fact.</div><div class=\"western\">“Runecraft?”</div><div class=\"western\">The prince’s surprised voice came from behind her. That was why Neia had to speak.</div><div class=\"western\">“No! This weapon isn’t like that!”</div><div class=\"western\">As Neia shouted, she sensed Shizu and the henchman demon freeze for an instant. That must have been it. When two opponents were evenly matched, all they could do was stare at each other without being able to make a move. There was no doubt about it.</div><div class=\"western\">“Rune…”</div><div class=\"western\">“No!”</div><div class=\"western\">Neia shouted without regard for anything else, and the henchman demon grunted under his breath.</div><div class=\"western\">“Is that so… then next, I’ll… 「Blindness」.”</div><div class=\"western\">The spell that came out of nowhere blackened Neia’s vision. He must have done so to render the healer powerless.</div><div class=\"western\">The item Neia had borrowed only allowed her to use 「Heavy Recover」, and not spells that could heal her blindness.</div><div class=\"western\">A priest or a divine magic caster could have cured the blinded status easily. Unfortunately, there was nobody like that here.</div><div class=\"western\">She did not know how long the darkness would last, but if she wanted to heal Shizu, she would have to get within touching range of her.</div><div class=\"western\">“I can’t see!” It was very important to tell her comrades what had happened to her. “Shizu! If you’re hurt, you need to tell me!”</div><div class=\"western\">“…Mm.”</div><div class=\"western\">“Sorry, I don’t know spells that can heal this condition of yours!”</div><div class=\"western\">“Don’t worry about it!”</div><div class=\"western\">After responding to the apology from behind her, Neia pulled her bowstring taut. She ought to be able to hit her target from memory alone. This was the fruit of the experience she had gained from fighting the Vah Un and many large-sized adversaries. The bowstring <i>twanged</i>.</div><div class=\"western\">“―Guwaaaargh!”</div><div class=\"western\">She heard the henchman demon wail in pain.</div><div class=\"western\">“You did it! It tried to dodge, but it had the opposite effect! Nicely done!”</div><div class=\"western\">After hearing the prince’s clarification, Neia realized how lucky she had been and prayed to the Sorcerer King.</div><div class=\"western\">“…Keep shooting like this.”</div><div class=\"western\">“Eiii!”</div><div class=\"western\">“Mm!”</div><div class=\"western\">Although the sound of the Zerns fighting the Shadow Demons around her made it very hard to tell what was going on, Neia focused on how much Shizu had been wounded and the henchman demon’s location and kept shooting at the latter.</div><div class=\"western\">Perhaps it was because he had been hurt and realized that he would lose if he did not defeat Shizu first, but the henchman demon focused all its attacks on Shizu. In addition, it kept casting 「Blindness」 spells on her, trying to disable her like it had Neia, but she resisted all of them, so they had no effect.</div><div class=\"western\">In that case, all she had to do was keep pressing it.</div><div class=\"western\">Just as the prince’s mana was about to run out, victory came to them like a matter of course. The prince’s cries of joy were even a little annoying.</div><div class=\"western\">The Zerns fighting around them had taken losses, but they had emerged victorious.</div><div class=\"western\">However ― the spell on Neia had not yet expired. She still could not see anything. Still, it was not a permanent spell. In all likelihood, it would wear off after some time had passed, and the only reason why it had lasted this long was because Kelart Custodio was very powerful.</div><div class=\"western\">While she could not see anything, she could sense the presence of the Zerns approaching her.</div><div class=\"western\">“My prince! I’m glad you’re alright.”</div><div class=\"western\">“Ahh… please consume Grand Mother-dono’s remains with all due respect.”</div><div class=\"western\"><i>So you’re eating it?</i> Neia thought.</div><div class=\"western\">And with all due respect. Since they had said as much, all she could do was accept it as a unique tradition of their species.</div><div class=\"western\">“Neia. What should we do with the human’s head? Shall we eat it too?”</div><div class=\"western\">“No, please don’t. We humans don’t have such burial practices. We will return it to the city with all due respect.”</div><div class=\"western\">“I see… human burial practices are truly a mystery. No, surely you must think the same of ours as well. This is probably what they call a culture clash. Also, I am deeply grateful to you. We alone could never have―”</div><div class=\"western\">“―Wait. There’s no time to keep talking. Let’s move.”</div><div class=\"western\">She could hear a disturbance in the distance. It would seem the Liberation Army had finally made contact with the Demihuman Alliance. Either that, or soldiers had heard the sound of the battle just now and come here to see what was going on. Whichever one it was, they could not stay here for long.</div><div class=\"western\">“That’s right, Shizu-san. Then, please help the Liberation Army attack Kalinsha as we arranged.”</div><div class=\"western\">“Umu, I understand. You lot!”</div><div class=\"western\">“Yes! We shall move right away. Will you and the humans be entering the barrels, my prince? We will carry you outside the city.”</div><div class=\"western\">While Neia could not tell because she could not see, she could sense Shizu hesitating. The reason for that was obvious ― she hated the barrels. Neia felt the same way.</div><div class=\"western\">“…I’ll help too.”</div><div class=\"western\">“Mm. I’ll lend a hand once I recover from my blindness.”</div><div class=\"western\">The prince was thrashing on her back like a caught fish. He was jumping for joy. Neia was a little dejected by how well she had adapted to the situation.</div><div class=\"western\">“If our allies are setting out, then let us go as well. Of course, my mana has been depleted so I cannot cast any powerful spells, so I shall cast strengthening spells on you instead.”</div><div class=\"western\">“My prince!”</div><div class=\"western\">“Be silent. Do you intend me to be a male who sends his comrades to their deaths?”</div><div class=\"western\">“…That ought to be enough. Let’s go.”</div><div class=\"western\">Shizu urged them on. She seemed eager to get away from the barrels as soon as possible.</div><div class=\"western\"></div><div class=\"western\">“Then I shall send you to where our eggmates are gathered. Please get in.”</div></div></div><br/>\n</div>"}