{"title": "Chapter 24: Barbeque on Principal Filter", "id": 24, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-24-barbeque-on-principal-filter", "volume_title": "Volume 1", "body": "<h1>Chapter 24: Barbeque on Principal Filter</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 24: Barbeque on Principal Filter</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The second series would be more difficult. Qin Guan’s whole body had to be in the shots. On one side, the photos had to show the perfect matching effect of the shirts, while on the other, the customers had to be able to see how comfortable the shirts were.</p><br/><p>After listening to the marketing manager’s requests, Qin Guan and the photographer had a short discussion. They decided that Qin Guan would take some jumping shots.</p><br/><p>Most shirt advertisements for direct sales were quite stiff. Just a standing posture, and that was it.</p><br/><p>The photographer asked Qin Guan to jump. Since these were shirts for young men, the advertisement didn’t have to be conservative.</p><br/><p>Qin Guan unbuttoned his shirt down to the second button on his chest and rolled up his sleeves.</p><br/><p>Both the spotlight and photographer were ready. Qin Guan followed the photographer’s directions. “Good. Look this way. Well done. Ready? One, two, three, jump!”</p><br/><p>At his signal, Qin Guan leapt up on the spot. He opened his arms and jumped high in the air in an effortless manner.</p><br/><p>While he was up, he didn’t think about the shooting at all.</p><br/><p>Maybe he was distracted by his hunger. It had been a long day. It had to be around lunchtime. On that thought, Qin Guan’s eyes went blank. He was eager to eat.</p><br/><p>The photographer was over the moon. He had snapped some excellent photos. The model on stage jumped high with slim, straight legs. His eyes looked blank and confused as he looked into the distance. He seemed to be longing for freedom, holding his arms out like he was trying to embrace the sky.</p><br/><p>Click, click. By the time Qin Guan landed back on the floor, the photographer had taken lots of photos. Checking the effect of them, he was beside himself with excitement.</p><br/><p>As an unknown photographer who made a living by taking part-time jobs, he had always dreamed of being an artist.</p><br/><p>He had finished his job for the day. I don’t care what people say. Dignity is nothing compared to art.</p><br/><p>The photographer went up to Qin Guan, “Hey man, can I have a word with you?”</p><br/><p>Qing Guan was thinking of food as he took his shirt off. Since the photographer had started the conversation, he could do nothing but reply politely, “What is it? Tell me.”</p><br/><p>The photographer put his hands together in a begging gesture. “Could I take another series of photos? Not too many. Just a couple of shots would be enough.”</p><br/><p>Qin Guan looked at the marketing manager nearby. The manager shrugged to show his confusion before he turned to stare at the photographer doubtfully.</p><br/><p>The photographer made a deep bow as he went on, “I want to take several photos for myself. I don’t have much money. I could pay you 50 Yuan per picture. I swear I won’t use the photos for business.”</p><br/><p>Qin Guan stopped taking off his clothes as he answered, “But I don’t have any formal clothes with me. How would you shoot me?”</p><br/><p>His words seemed to give hope to the photographer, who answered happily, “You don’t need to change clothes. This shirt is okay.” Stealing a glance at the marketing manager, he continued, “You could just wear it this way. Go to the wooden pillar and pose randomly. Just a couple of shots will be fine.”</p><br/><p>Qin Guan took pity on him. It wasn’t hard work for him anyway. He left the buttons of his shirt unfastened as he walked up to the pillar, He leaned his elbow on the pillar and supported his left hip against it.</p><br/><p>That pose saved him a lot of energy. He was too hungry to stand straight. In the camera, he was leaning slightly on the traditional wooden pillar in a lazy, wanton manner. The expression in his eyes was gloomy and helpless. The open shirt covered his naked chest lazily, looking sexy and wild.</p><br/><p>Click, click.</p><br/><p>The photographer was too excited to stop. After snapping pictures for a long time, he finally shouted, “Okay! Cut!”</p><br/><p>At his words, Qin Guan let go of the pillar. The photographer and the marketing manager joined him.</p><br/><p>They gathered to talk money.</p><br/><p>According to common policy, such a small gig could cost somewhere between RMB 800 yuan and 1500 yuan. Thanks to his excellent performance, Qin Guan naturally ranked at the highest price. The marketing manager gave RMB 1500 yuan to Xue Wanyi.</p><br/><p>As his agent, Xue Wanyi shared half of Qin Guan’s salary.</p><br/><p>Qin Guan watched helplessly the pile of bills going around, getting only half of it himself.</p><br/><p>The photographer paid him next. He had selected six photos, each costing 50 yuan. He gave Qin Guan 300 yuan and a simple photo use agreement.</p><br/><p>The agreement stated that the photos could only be used in the Capital Figure Photography Competition and were not allowed to be used for any other business.</p><br/><p>When everything was settled, Qin Guan could hardly wait to get out of there with his 1050 yuan. He was starving.</p><br/><p>Relying solely on his body, he walked out of the studio and headed directly for the Chaoyang Park west entrance. He was craving some barbeque. He’d kill anybody who got between him and the barbecue restaurant.</p><br/><p>Before reaching it, he bumped into the marketing manager, who was just driving off. He shouted to Qin Guan, who stared at him with hungry eyes.</p><br/><p>His sunken heart shouted loudly. What’s the matter, bro? The marketing manager dragged a huge black plastic bag out of his trunk and handed it to Qin Guan.</p><br/><p>“Take it. It’s extra benefit,” he said before he waved at him and drove away.</p><br/><p>Qin Guan entered the barbeque restaurant holding the black bag. He called for the waiter and ordered a long list of dishes.</p><br/><p>Salty lamb with cumin. Beef fat. Marbled pork. Sweet potato slices. Onion slices.</p><br/><p>Under the surprised gaze of the waiter, Qin Guan recited his order in one breath.</p><br/><p>The young waiter couldn’t help it. He reminded Qin Guan in a low voice, “Don’t you think that’s a little too much?”</p><br/><p>Qin Guan waved him off, “Not nearly. Serve me quickly. Quick, quick, quick. Run!”</p><br/><p>Shocked by his energy, the waiter ran to the kitchen to place the order. Qin Guan drank the free barley tea that was on the table in hopes that several sips of tea would help soothe his stomach.</p><br/><p>He opened the black bag the manager had given him only to find that it was full of brand new shirts.</p><br/><p>Thinking back, Qin Guan realized they were the try-on shirts for interviewees that day.</p><br/><p>He had been selected for the job too soon to give the others a chance to try on the shirts.</p><br/><p>Naturally the shirts had been left there, and it was not worth driving back to factory just to return them, so the manager had given them to Qin Guan as a gift.</p><br/><p>Looking around, Qin Guan tied the bag again. This was typical eating in and taking home the leftovers behavior. He felt shy to both make money and receive a gift.</p><br/><p>While Qin Guan looked unhappy with his wretched appearance, his food was served plate by plate.</p><br/><p>Scared by Qin Guan’s eagerness, the waiter ran up to him with the plates. He also served the coal stove dishes first.</p><br/><p>Rubbing his hands, Qin Guan held the barbecue agrafe and took all the meat and placed it on the plate with a ripping sound.</p><br/><p>Everyone would understand that Qin Guan was enjoying barbeque on principal filter.</p><br/><p>The old capital barbeque on principal filter was dating back to 1686, the 25th year of the Kangxi reign. Its history was longer than 320 years.</p><br/><p>People in the capital made a plate with iron bars called a principal filter. Using fruit wood charcoal or pine wood charcoal to heat up the filter, people placed pickled beef or lamb slices on it and turned them over using long chopsticks. The meat on the filter released its grease when it was done.</p><br/><p>Soon the room was filled with the smell of barbeque, which only increased Qin Guan’s appetite even more.</p><br/><p>He placed the cooked meat on a plate using the iron agrafe while he placed the marble pork on the filter piece by piece. As he waited for the pork to be cooked, he stuffed the meat on the plate into his mouth.</p><br/><p>The secret recipe sauce poured into the Mongolian Lamb as the taste of caraway seasoning filled Qin Guan’s mouth.</p><br/><p>Qin Guan was too busy cooking and eating. The waiter was sympathetic and helped him cook the meat so he could have enough time to eat in peace.</p><br/><p>Qin Guan buried his head in food for nearly half an hour until his stomach was half-full. Then he breathed out and looked up, thinking to himself, “I nearly died of hunger, but I survived once again.”</p><br/><p>Smiling at the waiter, who was helping with the cooking, Qin Guan asked him to assist the other customers. Now that he wasn’t starving anymore, he could enjoy cooking.</p><br/><p>Staring at Qin Guan’s face, the young waiter pursed his lips in embarrassment. He passed the agrafe over to Qin Guan and ran away in a rush.</p><br/><p>When the stomach was full, the heart was satisfied. Qin Guan finished the meat leisurely. He had to try to squeeze the big plastic bag onto the bus on his way back to campus.</p><br/>\n</div>"}