{"title": "Chapter 58: Model Business Photos", "id": 58, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-58-model-business-photos", "volume_title": "Volume 1", "body": "<h1>Chapter 58: Model Business Photos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 58: Model Business Photos</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The introduction was the longest part of the exhibition. Qin Guan and Sister Xue exchanged a look in silent despair. Can we tell everyone that the photos were just an inspiration during a simple poster shooting?</p><br/><p>It was really hard to understand artists.</p><br/><p>After visiting the exhibition, Sister Xue drove the excited photographer and Qin Guan back to the studio so they could work on Qin Guan’s business photos.</p><br/><p>Sister Xue took two outfits out of the trunk excitedly.</p><br/><p>Both the suit and the casual clothes looked really expensive. They seemed extremely delicate as they hung in plastic covers in a formal way.</p><br/><p>In the studio, Sister Xue unzipped the covers and took out a summer style GIVENCHY suit.</p><br/><p>She had taken advantage of her connections to borrow them from a designer brand renting store for free.</p><br/><p>The costume consisted of a black woollen coat with a single button, a loose T-shirt, woollen pants, and shoes made of smooth black leather. It was an exact replica of a suit from the standard GIVENCHY runway show in the summer. Even the size was the same.</p><br/><p>It fit Qin Guan quite well. The black suit hung down slightly, and the black round-collar T-shirt made Qin Guan look natural and unrestrained.</p><br/><p>The photographer felt inspired. \"Can you walk on the T stage?\" he asked.</p><br/><p>Qin Guan nodded, and the photographer grew even more excited. He asked his assistant to arrange the lights on the T stage, where Qin Guan would perform.</p><br/><p>Once Qin Guan strode from the darkness into the light, the photographer began to press the camera button. Only when Qin Guan left the spotlight again did Sister Xue come to her senses.</p><br/><p>Excellent! The coat fit his waist perfectly, and the straight pants complimented his long legs.</p><br/><p>In the photos, Qin Guan was lifting one of his feet to step forward against the yogon background.</p><br/><p>The photographer asked Qin Guan to take off the T-shirt for one more series of photos.</p><br/><p>Qin Guan took off all the clothes on his upper body and put on the coat again. The photographer held his jaw and stared at him. \"Hold the collar with both hands as if you’re tearing it apart.\"</p><br/><p>Qin Guan did as he was told. The dim yellow light from above and the caesious curtain made the whole background seem mysterious.</p><br/><p>The light fell softly on the black coat and on Qin Guan's naked chest, which seemed even smoother under the light.</p><br/><p>The contrast between Qin Guan's wild pose and his soft skin looked very attractive. The audience would focus on his figure right away.</p><br/><p>Sister Xue was quite satisfied with the photographer. In her opinion, Sun Pengtao and Qin Guan had great potential. They will turn into Chinese dragons and fly high into the sky. These photos will give Qin Guan an advantage.</p><br/><p>While Qin Guan was changing clothes, Sister Xue shouted loudly from outside the fitting room, \"Are you naked?\"</p><br/><p>\"Let me put on some pants!\" Qin Guan answered in confusion. A new pair of underpants in a packaged box flied in from outside.</p><br/><p>\"That's your gift! Put them on and let’s take some underwear photos.\"</p><br/><p>Qin Guan took out the underpants. Whoops! They’re Calvin Klein. He put them on right away after picking off the label.</p><br/><p>It was a pair of simple seamless underpants. The seams were all weaved together. The underwear covered Qin Guan's hips completely, making him feel as comfortable as if he was naked.</p><br/><p>With only the underpants on, Qin Guan walked under the lights. His delicate pace would have made any audience feel a sense of desire, sexiness, allure, luxury and enthusiasm, just like an unexpected romance.</p><br/><p>The photographer asked Qin Guan to lean against a pillar. The smooth lines of his body exhibited the power of the Creator and the utmost beauty a human being could possess.</p><br/><p>Only one series of underwear photos were needed. It would only take up a small space on the right side of his model business card. All the staff in the studio were disappointed that the underwear shoot was over. Qin Guan’s beauty was a feast for the eyes, and that feast had ended almost as soon as it had begun.</p><br/><p>After finishing this series, Qin Guan changed into the GIVENCHY casual summer outfit.</p><br/><p>The outfit included a V-neck, jacket-like shirt with a picture of Jesus, a loose T-shirt with pockets, a pair of Bermuda shorts made of a fabric that did not wrinkle, smooth ocean blue buttermilk-skin skateboard shoes, and a thick bracelet with keys.</p><br/><p>The combination of white, blue and grey gave off a sense of casualness and leisure.</p><br/><p>The photographer realized that Qin Guan would take photos in casual clothes as soon as he saw the outfit.</p><br/><p>Sun Pengtao was the best at taking candid photos. He asked Qin Guan to just act natural.</p><br/><p>Qin Guan planned to show him what he had learned from Professor Li. He took a casual pose by putting his hands in his pockets and supporting them against his hips. Sister Xue was delighted. The boy has finally learned how to show off his advantages.</p><br/><p>The photos were finished fast. There was only one photo left.</p><br/><p>On a model’s professional business card, the main photo would take up half the page, while the other nine smaller photos would take up the other half.</p><br/><p>Out of the 10 photos, it was the main photo on the left that would attract the clients’ attention right away.</p><br/><p>That’s why the main photo was at the centre of the page. All the models would show their best image in that photo. Sister Xue and the photographer hesitated. Qin Guan had both an outstanding face and figure. How could they choose one?</p><br/><p>They had a long discussion and finally decided on a full-body picture. As a good model, Qin Guan would be able to withstand the exposure. Just a handsome face would have limited him to a still model level after all.</p><br/>\n</div>"}