{"title": "Chapter 52: Watching A Movie Together", "id": 52, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-52-watching-a-movie-together", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Watching A Movie Together</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52: Watching A Movie Together</p><br/><p>Translator: Lan Editor: - -</p><br/><p>As the boss saw him with so many memory banks, his eyes narrowed. It's suspicious. He does not look like a businessman at first glance. Why did he buy such a big pile of memory banks? Considering his style, the boy cannot be an internet café runner. Is he perhaps the son of some businessman who’s gotten some information from his parents? Does he want to earn a little money by investing his pocket money? No, I’m wrong. If his father was a businessman, he wouldn’t need to shop here. All he would need to do was make a call. That’s not it. What if the boy overheard the information and doesn’t want anyone know?</p><br/><p>In the blink of an eye, the man imagined several scenarios of turmoil in the market and many exciting stories involving rich, powerful families.</p><br/><p>He was inspired. There must be some kind of incident related to the 128M memory bank! The boy was stocking up! What should I do? Memory banks, that's it! The man hit his own head. F*ck! I’ve cleared my stock! I have to stock up right now.</p><br/><p>Without delay, he stood up and headed for the other shops.</p><br/><p>The wings of a small butterfly had flapped, yet Qin Guan knew nothing about it.</p><br/><p>He was currently on the bus. This time the situation is different from the factory stocks. I will lose my money if the price of the memory banks drops. My uncle and mother might benefit from their leaders’ guilt, but if the memory bank price remains the same, my deposit will be lost.</p><br/><p>As he thought of this, Qin Guan buried his face in his hands in sadness.</p><br/><p>I’m not a hero destined for great things. Others can dominate Wall Street, win the lottery or conquer the entertainment world, but I’m swayed by considering the gain and loss of a deal less worth than 8,000 yuan.</p><br/><p>Luo Yuan felt depressed as the bus arrived at the stop. As he got off the bus though, his bad mood improved. Things will eventually sort themselves out. I can always make the money again if I lose it. Anyhow, June is approaching, so I will find out soon enough. Pleased with himself, Luo Yuan threw the bag in his closet and took out the pirated disks.</p><br/><p>His roommates gathered around. Liu Xiaoyang was the most excited. “I have long wanted to buy these games!” he shouted. “How much for one disk? If I remember right, they must cost 275 yuan each.”</p><br/><p>Qin Guan answered calmly, “You’re wrong. It’s five yuan each.”</p><br/><p>Liu Xiaoyang jumped up with a cry, “What? Motherf*cker! That seller cheated me!”</p><br/><p>Speechlessly, Qin Guan pointed at the coarse, misty cover of the disk. “It's pirated. Just making it clear before you get excited.”</p><br/><p>Wang Lei looked at them one by one. They’re all popular movies and TV series. “Witness of A Prosecution” seems good. There’s some financial software as well. Qin Guan is really intense. What are these two disks in the white cases?</p><br/><p>Wang Lei took the disks out of the cases. There was nothing written on them.</p><br/><p>He waved the disks in front of Qin Guan and asked, “Qin Guan, why did you buy these blank disks?”</p><br/><p>Qin Guan was suddenly reminded of the smuggled goods. He put his arms on his hips proudly as he laughed, “Do you know what they are? It’s a bonus for you guys.”</p><br/><p>It was June, and the temperature was getting higher.</p><br/><p>The doors to all the dormitories were open so the wind could flow, so even the tiniest news spread fast among all the students along the corridor.</p><br/><p>Qin Guan laughed loudly and the students of the dormitory across from theirs ran over to take a look.</p><br/><p>They saw the disks.</p><br/><p>“So many new movies! Let’s watch them together!”</p><br/><p>The news spread and all the idlers on the whole floor gathered there.</p><br/><p>That was a common occurrence in dormitories. If there were any new movies, they would all gather and bring snacks.</p><br/><p>Qin Guan was paralyzed by fear. “F*ck! What should I do? This is significant. My clever brain has run out of ideas!”</p><br/><p>Before he could figure out what to do, their room had already become packed with people. Qin Guan looked gloomy as he told Ye Dong in a low voice, “Don’t play the disk!”</p><br/><p>Ye Dong was confused. Unconsciously, he lowered his voice as well, “Why?”</p><br/><p>Wang Lei and Liu Xiaoyang moved their heads closer in curiosity. Grinding his teeth, Qin Guan explained, “That's an AV of Ryoko Nagase.” “</p><br/><p>Ye Dong screamed like his penis had been stamped, “Ryoko Nagase?”</p><br/><p>All the boys suddenly fell silent, except Liu Xiaoyang, who kept asking around, “Who is Ryoko Nagase? Is it a rom-com or an action movie?”</p><br/><p>Brother Liu, you’re so innocent. I wonder if you just got your ID card yesterday.</p><br/><p>Ye Dong's shout made Qin Guan sick. Am I guilty of circulating porn films? No more than two seconds later, people started bustling about.</p><br/><p>“Stop talking rubbish! Play it right now!”</p><br/><p>“I agree, play it! I love rom-coms!”</p><br/><p>Ye Dong’s shout had attracted countless students from other dormitories. There was a big commotion.</p><br/><p>Not caring about anything, Qin Guan cried, “There are too many people! We don’t have enough chairs! Let’s leave it for today, we’ll meet in our spare time!”</p><br/><p>Everyone was so angry, they started shouting.</p><br/><p>“What did you say, dude? You don’t want to share? You just want to watch with your door shut? You’re not loyal to your friends!”</p><br/><p>“I agree! Good movies should be shared!”</p><br/><p>“Is there no spirit of solidarity or friendship among fellow students?”</p><br/><p>“I have the keys to the college playroom! Hundreds of people can fit there! There’s even a closed circuit television!” A member of the Youth League took a bunch of keys out of his pocket. Qin Guan stared at him in surprise. What the f*ck!</p><br/><p>Everyone applauded happily. Clustering around Qin Guan and his roommates, they took all the disks from the table for fear of missing something, and headed for the playroom in a formidable array.</p><br/><p>As soon as they opened the door, they turned on the television and the DVD player.</p><br/><p>Some of them waved to Qin Guan urgently, “Bring the disks, quick!”</p><br/><p>Others reminded the people sitting by the windows, “It's too bright inside! It will affect the quality of the film. Shut the curtains!”</p><br/><p>Dear fellow students, this not a rom-com or an action movie.</p><br/><p>The curtains were closed and the chairs were placed in a circle. Everything was ready except for the disk. Ye Dong pulled the disk from Qin Guan's hand and placed it in the DVD player.</p><br/>\n</div>"}