{"title": "Chapter 64: Recalling Fang Pingping (Bingbing)", "id": 64, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-64-recalling-fang-pingping-bingbing", "volume_title": "Volume 1", "body": "<h1>Chapter 64: Recalling Fang Pingping (Bingbing)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: Recalling Fang Pingping (Bingbing)</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>At the time, Fang Pingping had been too tall for Qin Guan, who had been short in his past life. At 167 centimeters, she had been the beauty queen of his senior high school.</p><br/><p>Unsurprisingly, she had been selected as the drum and bugle corps leader, the standard bearer, and so on. At the time, Cong Nianwei had been a little girl with child-like hair, who didn't stand a chance against Fang Pingping's female elegance.</p><br/><p>Qin Guan remembered that in his past life, all the dancing performances at the Spring Festival school party had been performed by group dancers, except for Fang Pingping, who had performed a solo routine.</p><br/><p>In a shining, colorful minority dress, she had stood up and danced happily. She had been so beautiful! Stop it. Or shall I think about the jokes she made? Qin Guan would have felt sorry for Cong Nianwei, except he didn't know much about her jokes. They had belonged to different worlds.</p><br/><p>One of them had been a working class straight-A student, while the other had been the leader of the art class. They had moved in two parallel lines that never crossed.</p><br/><p>Qin Guan sighed and sucked on the ice cube again. As far as he could remember, there had only been two times when he had met goddess Fang.</p><br/><p>The first one had been during their first exams for class-dividing when the school had opened. They hadn't known each other then. Their numbers for the unified test of the whole grade had been mixed up. On that day, Qin Guan had arrived in the classroom just before the bell had rung.</p><br/><p>He had entered the unfamiliar room and seen Fang Pingping sitting in the back row. She had looked conspicuous among that group of freshmen who had no idea who that beauty was.</p><br/><p>With a high ponytail and bangs, and a pair of amorous eyes, she had looked particularly charming, attracting the attention of every boy in the room.</p><br/><p>Qin Guan had hastened to take his seat as the teacher had walked in with the papers. While the papers had been given out, he had heard the conversation between Fang Pingping and the boy sitting in front of her.</p><br/><p>The boy had said bravely, \"I’m quite confident about the test. Do you know how much I got in the entrance exams for the No.1 Junior High School? 600 points! No more or less.\"</p><br/><p>Fang Pingping's eyes had shined immediately before she had said in a soft voice, \"I admire straight-A students the most. I’m no good at studying myself.\"</p><br/><p>The boy had suddenly felt like a guardian angel. He had handed over the papers to Fang Pingping and made a promise to her, \"Don't worry. I’ll push my paper to the side when I'm done.\"</p><br/><p>Fang Pingping had given him an encouraging smile. \"Cheers!\" The boy had started writing swiftly with renewed energy.</p><br/><p>Qin Guan had been envious of their conversation. Why didn't they give me that seat? I could also have shown my bravery to the goddess. I'm short, fat, and hairy, so I have nothing to show off about except my scores.</p><br/><p>In the end, Qin Guan had made the top class without any trouble, while Fang Pingping had cheated smoothly. When the school had announced the score list, Qin Guan had laughed for quite a while.</p><br/><p>Fang Pingping had gotten into the art class, which was a far cry from ordinary classes. The boy who had showed her his papers had also gotten in the same class.</p><br/><p>According to Qin Guan’s later observation, the boy had originally been in the art class. He had just exaggerated his score to show off to the beautiful girl. For half the semester, he had been held in disdain by goddess Fang. Finally, he had been recommended for admission to a music college because of his excellent skill in playing the violin. You want to know his school scores? Ha, ha, ha... Please allow the boy to maintain some dignity.</p><br/><p>Qin Guan took another bite of the ice cube. On the screen, Fang Pingping's cheeks were still round. She looked no different than she had in his past life.</p><br/><p>Fortunately, her face was fine. I wonder if she has had the same experiences as in my past life.</p><br/><p>Qin Guan was gloomy. The memory of his past life was blank. He had only gained great looks.</p><br/><p>That was why he had ignorantly confessed his love for Cong Nianwei in this life. He didn’t know whether he would have done something as silly with Fang Pingping if he had entered the same classroom again.</p><br/><p>Qin Guan had avoided such affairs before. He owed his complete change to Cong Nianwei's rejection. Actually, that was wrong. Qin Guan was innocent. What the guy in his past life had done had had nothing to do with him. It seemed like an incomplete spirit had been mended through his rebirth.</p><br/><p>So, what was the reality? Qin Guan was confused. He knew nothing about space physics. Forget it. I’m living well. It was important to have a new life this time around, wasn't it?</p><br/><p>But why was he concerned about Fang Pingping's face then? Their second contact in Qin Guan's past life had been during an ordinary day at school. Qin Guan had been on his shabby bike, riding down along the slope outside the school as usual. Zhou Jing and Li Jian had been making jokes at him. Suddenly, they had seen Fang Pingping on the back of her father's motorbike, leaving the entrance of the school.</p><br/><p>As the motorbike had been running down the slope, it had been stopped by a passing minibus, which had been slowly driving away. The motorbike had gotten out of control.</p><br/><p>Inertia in combination with its accelerating speed had caused it to fall down the 30-degree slope. Her father, who had been in the front, had slid to the ground, while Fang Pingping had been thrown away, finally stopping after several clumsy rolls on the slope.</p><br/><p>All the students had been astonished. They had never seen such a thing before. They had all gotten off their bikes to check on them. There had been no cell phones back in 1995, so several students had run to the school for help. They had been in panic, when suddenly Fang Pingping's father had climbed off the motorbike.</p><br/><p>It had been miracle. He had only seemed to have several bruises on his skin. He had moved the motorbike jerkily and walked unevenly towards his daughter.</p><br/><p>Fang Pingping had been better off than her father. She'd had dirt all over her body, and her arms had been slightly hurt, blood trailing from them in lines. Before her father could ask any questions, Fang Pingping had suddenly covered her face with both hands and felt it up and down. Then she had cried, \"Daddy, daddy! Is there anything wrong with my face? Is there anything wrong with my face?\" Her father had remained speechless before his vain daughter.</p><br/>\n</div>"}