{"title": "Chapter 72: The Preliminary Competition", "id": 72, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-72-the-preliminary-competition", "volume_title": "Volume 1", "body": "<h1>Chapter 72: The Preliminary Competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72: The Preliminary Competition</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Professor He was the senior editor of \"Models\" periodical, and he was currently waiting for retirement, lacking any motivation.</p><br/><p>The youngest judge was a member of the China Figure Photography Association, who had been sent as vanguard. The other two were an assistant advertising director and a costume institute assistant. Both of them had been paid to be there.</p><br/><p>After the preliminary competition, the judges would all be VIPs, much more important than them. All four of them were coolies, so the less work there was, the better it was for them.</p><br/><p>The last two judges picked up the paperwork of the female models gloomily. They had to get familiar with it. Professor He and the young photographer were in charge of the male models. They hastened to number the paperwork, thus ending their work for the day.</p><br/><p>On August 14th, 1999, a sunny Saturday, Qin Guan would participate in the preliminary competition. Sister Xue picked him up from university early and drove him to the competition site.</p><br/><p>The competition would be held at a modelling school. Two training halls with T stages would temporarily serve as the site of the competition. Following the signs, they found the male model reception soon enough. An assistant sitting behind a desk asked routinely, \"What's the name of the contestant?\"</p><br/><p>\"Qin Guan.\"</p><br/><p>Pointing at the name list, the assistant checked them one by one. \"Here it is. Qin Guan is No. 21. Take your label and clip it on your clothes before you get on the stage.\"</p><br/><p>\"Models have to bring their outfits and change backstage. All unauthorized personnel has to wait outside. When the judges call your number, you can get on the stage. Any questions?\"</p><br/><p>Qin Guan shook his head. It was all clear. The assistant called the next contestant forward. Sister Xue pulled Qin Guan aside and handed him the package with his clothes. Before leaving, she advised him, \"Don't be nervous. Just show them what you've learned in your lessons. Cheer up!\"</p><br/><p>Qin Guan smiled brightly. \"I may be a lot of things, but I'm not nervous. Relax!\" Then he waved at Sister Xue and headed backstage.</p><br/><p>The furniture backstage was pretty simple. Several folding chairs were scattered around randomly. The contestants put their bags down on the floor and began to change. There were bare chests, backs and legs everywhere. The standards for the preliminary competition were simple. Figure condition (including weight, height, chest, waist and hips measurements, shoulder breadth, and breadth ratio of shoulder and hips) and beauty evaluation (including talent, wit, appearance, skin, posture and health).</p><br/><p>To make it simple, on the first pass, they would compete on face and figure. As soon as Qin Guan took off his T-shirt, everyone in the room fell silent. Another strong opponent. By the time he had changed into his swimming trunks behind the curtain, there was nobody left around him.</p><br/><p>Nobody wanted to be near him for fear of comparison. Fortunately, they would be competing one by one. At the local finals, when there would be a group show at the beginning, the contestants standing next to him would most likely want to die.</p><br/><p>The models backstage were getting more and more, when the two judges under the stage were finally ready. Professor He picked up the material casually and had a short discussion with the young photographer on his right. Then he nodded at the assistant on the site, indicating that the competition could begin.</p><br/><p>Bright music started playing as the host announced, \"Contestant No.1, Li Xiaoguang is up, and contestant No.2 Wang Shuang should be getting ready.\"</p><br/><p>Professor He and the young photographer pulled the material of contestant No.1 over. His height and weight were stated clearly on the form. They didn't pay attention to his professional background. They looked at the swimwear show on the stage instead. It was a model competition, so the models' figures had to be attractive to the audience.</p><br/><p>Contestant No.1 had walked up to the most important part of the T stage. His gait was steady and his basic skills were perfect, but he might have chosen the wrong audience. Both judges engaged in print media and photography and focused on appearance.</p><br/><p>\"A little too wide around the hips.\"</p><br/><p>\"That’s right. According to the theory of human body proportions, he's a little too tall. If he was as tall as an ordinary person, he would have been gourd-shaped.\"</p><br/><p>\"So, fail?\"</p><br/><p>\"Fail.\"</p><br/><p>They drew a cross over No.1's application and threw it in the rejected pile. The contestant had just returned backstage without the slightest idea that he had been disqualified so soon.</p><br/><p>\"Contestant No.2 is up, and No.3 should be getting ready...\" Contestants got on the stage one by one as the host announced them. The two judges kept commenting non-stop.</p><br/><p>\"He seems to have a good figure.\"</p><br/><p>\"No, Professor He. Look at his muffin-like face. He has no angles. He won’t look hot in the future.\"</p><br/><p>\"But it’s only a preliminary competition. We have to select 30 contestants for the final. Let's not be too strict right from the beginning.\"</p><br/><p>\"Fine, let's decide about him later. If there aren’t enough good contestants, he can pass.\"</p><br/><p>\"Okay.\" The application was thrown in the undecided pile.</p><br/><p>When contestant No. 20 returned backstage, the host finally announced Qin Guan's number. \"The following contestant is No.21, and his name is Qin Guan. No.22 should be getting ready.\"</p><br/><p>Qin Guan looked back, smiled at contestant No.22, who was one meter away from him, and turned around to get on the stage. His smile made No.22 feel quite depressed. He's bullying me! Why do I have to compete after him?</p><br/><p>No. 22 was a promising young man working with the New Silk Road Agency. Although he had just signed a contract, he had taken the lead among plenty of new male models because of his angled face and outstanding performance. His agent, who was also his oldest cousin, was confident about his future. He was participating in the competition to get an award.</p><br/><p>Everyone knew that a small domestic prize could raise a model's level. A B- level could definitely be achieved, and any model could benefit from a professional status and have clients pursuing them.</p><br/><p>No.22 had been proud of himself. Who would have known that Qin Guan would destroy his dream. He should have been a white horse. A black horse burst in unexpectedly, while a white horse barely displayed its strength.</p><br/><p>While No.22 was feeling gloomy backstage, Qin Guan had gotten to the most important part of the T stage. The two judges were looking at him in shock.</p><br/><p>\"Is he a green hand, Chen?\"</p><br/><p>\"Maybe, but he looks familiar.\"</p><br/><p>\"His figure is no worse than that of renowned models in our magazine.\"</p><br/><p>\"I know who he is, Professor He. He was a model who worked with one of the top ten photographers in our figure photography competition. That's why he looked familiar. His photos were perfect, they won the photographer the prize.\"</p><br/>\n</div>"}