{"title": "Chapter 86: The Troublesome Girl", "id": 86, "volume": 1, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-86-the-troublesome-girl", "volume_title": "Volume 1", "body": "<h1>Chapter 86: The Troublesome Girl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 86: The Troublesome Girl</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> Qin Guan and Wang Lei were ready to explode. They washed their faces in the bathroom and pushed the door open with a bang.</p><br/><p> When Ye Dong saw that the two of them were on the verge of starting a fight, he pushed his chest out and took a mighty pose. With wide-open eyes, he shouted, \"Come on! Forgive me!\" He surrendered immediately. The onlookers and his two rivals were left speechless.</p><br/><p>Contented, Qin Guan picked up a toothpick and held it in his mouth. Shaking his legs out proudly, he asked in a serious voice, \"You know the rules, don't you?\"</p><br/><p>Looking at Qin Guan gratefully, Ye Dong answered like a little girl, \"At your service.\"</p><br/><p>Li Jie spit out a mouthful of water as he watched them. You two are such drama queens. This is disgusting! We'll lose our appetite for supper because of your performance.</p><br/><p> Ye Dong was forced to sign a contract with humiliating terms. The contract read as follows:</p><br/><p> Ye Dong is a criminal who disregarded the friendship between brothers, thus committing one of the most heinous offences in the world. For 10 days, he has to treat his charitable friends, Qin Guan and Wang Lei, to dinner at Gui Street.</p><br/><p> The dinner has to include a portion of spicy hot crays, a plate of boiled green soy beans and peanuts, and a portion of salty yellow croakers. Beer is also mandatory. Qin Guan and Wang Lei have the right to add any extra dishes that they wish at the restaurant.</p><br/><p> Signature: Ye Dong. Date: August 30th, 1999</p><br/><p> Qin Guan and Wang Lei put the contract away and went to sleep. Tomorrow will be the last day.</p><br/><p> …..</p><br/><p>September 1st was Commencement Day. The freshmen enjoyed the golden autumn. Qin Guan was a sophomore though, so he was busy with courses and paid no attention to younger girls.</p><br/><p>Besides, there was already a young girl waiting for him. It was the weekend, so he had to go to Huang Jiajia’s home. This would be their first lesson for the new semester.</p><br/><p> Whenever he thought of the journey to Bashang for the photoshoot, Qin Guan got a headache. I have to ask Huang Jiajia for a day off. What will she do? Roll around on the floor in tears? Cry and shout? Stop. Just stop it. Qin Guan decided to play it by ear.</p><br/><p> When he got there, he asked her mother for a day off, and she agreed without hesitation. Then Qin Guan walked to Huang Jiajia's room and pushed the door open. As expected, she had been eavesdropping. When the door opened suddenly, it hit her nose, leaving a red mark on her face.</p><br/><p> Qin Guan burst into laughter at the sight of her covering her nose tearfully.</p><br/><p>He knocked the books against her head playfully. \"Stop joking around. Let's start our lesson!\"</p><br/><p> Huang pointed at Qin Guan angrily. \"You liar! You took advantage of my feelings!\" Qin Guan hastened to close the door. \"What are you talking about? That's nonsense!\"</p><br/><p>Huang Jianjia sat down at her desk. \"Liar, liar! I heard what you said to my mum. You had promised to buy me snacks!\" She stooped over the desk, crying sadly.</p><br/><p>Qin Guan sat down next to her helplessly and tried to explain. \"Could you please respect me and call me sir? You are really brave. Now stop crying, or your mum might think I'm bullying you.\"</p><br/><p> Huang Jiajia cried even louder.</p><br/><p> \"Okay, princess, I surrender. Stop, listen to me!\"</p><br/><p>She continued to cry.</p><br/><p>\"I promised to treat you to snacks if your scores were all above B.\"</p><br/><p>Huang Jiajia's crying subsided and turned into groans and moans.</p><br/><p>She is guilty of unreasonable behavior. Qin Guan smiled to himself as he went on, \"I asked for a day off for business, not for fun. I have to go to a magazine photoshoot.\"</p><br/><p>Huang Jiajia suddenly looked up and asked excitedly, \"What kind of photoshoot? What magazine? I want to buy it!\" </p><br/><p>That was a quick change! Qin Guan fixed his eyes on her face, but he couldn't find any signs of crying. Except for her red nose, the rest of her face looked quite clean.</p><br/><p> I was cheated! She was only pretending to cry! Qin Guan was really angry. That little girl is a talented liar! Her white little bra flashed in his mind at the thought.</p><br/><p>Stop, stop, stop! Qin Guan shook his head unconsciously in an effort to push the wicked thought away. Pretending to be calm, he told her, \"You have to study first. I’ll take you out when your scores are announced.\"</p><br/><p> Realizing he had seen through her, Huang stuck her tongue out and picked up her textbook obediently. Before opening it, she asked again, \"Hey, what kind of part-time job is it?\"</p><br/><p> I love that question! Qin Guan had the chance to show off again. Her mother forgot to ask me earlier, which deprived me of the chance to brag.</p><br/><p>Qin Guan coughed and adjusted his sitting position before answering in his typical indifferent way, \"It's not a part-time job, which is very annoying! The chief editor of the magazine begged me to help him. I was too kind to say no when he was crying, so I accepted the job. In fact, it's an unrewarding task. There will be no extra bonus besides the daily wage.\"</p><br/><p> Qin Guan straightened up.</p><br/>\n</div>"}