{"title": "Chapter 107: An Unexpected Friendship", "id": 107, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-107-an-unexpected-friendship", "volume_title": "Volume 2", "body": "<h1>Chapter 107: An Unexpected Friendship</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 107: An Unexpected Friendship</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>It seems that I have no time to accompany Huang Jiajia. Qin Guan looked at her with regret before turning his eyes to the four large plastic bags with a sigh. I should call a taxi for her.</p><br/><p>Huang Jiajia had just found out that her snack date had been ruined by that call. Pouting helplessly, she followed Qin Guan out without a word. Afraid that she would be angry, Qin Guan tried to comfort her, \"I really do have some business to attend to. See, I bought you snacks, so I kept my promise.\"</p><br/><p>Huang Jiajia remained silent.</p><br/><p>\"It's an emergency. It’s not my fault...\"</p><br/><p>Her eyes became slightly red.</p><br/><p>The passers-by saw the girl following Qin Guan in disappointment and looked at him with righteous indignation and contempt. Qin Guan felt defeated by the expression in their eyes and Huang Jiajia’s pitiful look. He compromised by saying, \"Okay, it's my fault. Next week, I’ll come get you ahead of time and take you out. Is that okay?\"</p><br/><p>Huang Jiajia’s expression changed at once. She jumped up and squeezed Qin Guan's arms. \"Really? I won’t forget! Don’t try to cheat me out of it again!\"</p><br/><p>Qin Guan cried, \"Let me go! You’ll break my arms! I’m carrying heavy bags in my hands!\"</p><br/><p>Having achieved her goal, Huang Jiajia loosened her hands, humming and bouncing out of Carrefour. When they reached the side of the road, she even expressed her worry for Qin Guan, \"Teacher Qin, you are in a hurry. I can take a taxi home. You don't need to take me back.\"</p><br/><p>Looking at the big bags, Qin Guan felt worried about her. \"Can you manage them by yourself?\"</p><br/><p>Patting her chest, Huang Jiajia reassured Qin Guan, \"Don't worry, I can take care of it. I’m a very understanding girl. Go attend to your business!\"</p><br/><p>Qin Guan was amused. He stopped a passing taxi and got in. Before leaving, he opened the window and warned her, \"Go home quickly! I’ll call your mother later. Take care!\" Then the taxi drove off.</p><br/><p>Huang Jiajia watched the taxi until it disappeared from view. Then she sighed gloomily. Suddenly, a fat paw patted her on the shoulder from behind. Huang Jiajia screamed and turned around in fear, only to find Qin Guan's younger college sister. Huang disliked her because she had taken her position.</p><br/><p>\"What are you doing?\" she asked angrily. \"You scared me!\"</p><br/><p>Mou Xiaoliu massaged her own head regretfully. That had not been her original intention. She tried to apologize, \"I’m sorry. I just saw Senior Qin leave, so I came to help you with the bags.\"</p><br/><p>Huang Jiajia understood. Staring at Mou Xiaoliu, she shouted, \"Aha! You’re an enchantress! (Try looking in a mirror.) What are your intentions about Qin Guan? Why do you pay so close attention to him? You were watching the exit and waiting for him! Stop dreaming! He has a girlfriend!\"</p><br/><p>Huang Jiajia lifted her jaw like a proud cock. Mou blinked as she answered, \"I saw him by accident. I’m handing out leaflets here. I see everyone who passes by. I have made a good impression on him, but I never dreamed of anything. And you’re not his girlfriend...\" Mou’s voice lowered gradually as she saw the tears in Huang Jiajia's eyes.</p><br/><p>Mou Xiaoliu lost her cool. She tried to comfort Huang Jiajia with her stupid paws, but she nearly pushed her down instead. She hastened to support her, only to end up pushing her again.</p><br/><p>Huang Jiajia's eyes shone coldly. Lifting her paws up, Mou murmured to herself, \"It's scary. Why are city girls so weak?\"</p><br/><p>Huang Jiajia was angry at Mou’s silly behavior, but she could not do nothing. She rolled her eyes and said, \"Why don’t you take off that silly costume and come with me?\"</p><br/><p>Mou Xiaoliu nodded. \"You stay here, I’ll be back soon.\" Then she ran away. Not long after, she ran back breathlessly. She lifted the bags easily, two in one hand, and asked, \"How were you planning to go home? By taxi? I’ll carry them to the car for you.\"</p><br/><p>Cocking her head a little to the side, Huang Jiajia watched the girl carry the bags effortlessly and made an unreasonable demand, \"I’m hungry.\"</p><br/><p>\"I don’t have any money with me.\" Mou Xiaoliu smiled with regret.</p><br/><p>\"What the hell! How were you going to have lunch without money?\"</p><br/><p>\"It’s a part-time job. I only work in the morning. Plus, I have my college dining card...\"</p><br/><p>Huang Jiajia rolled her eyes again. \"It’s my treat!\"</p><br/>\n</div>"}