{"title": "Chapter 106: Short Work Notice", "id": 106, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-106-short-work-notice", "volume_title": "Volume 2", "body": "<h1>Chapter 106: Short Work Notice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 106: Short Work Notice</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Tactfully, Qin Guan and Mou Xiaoliu rejected the invitation to the police station. Both of them had business to do. Huang Jiajia saw that the two of them were on the verge of swearing, so she pulled at Qin Guan's sleeve, murmuring, \"Stop talking rubbish. Where is my snack?\"</p><br/><p>Qin Guan nodded at Mou Xiaoliu helplessly. He had to go to the supermarket with Huang Jiajia, although he’d rather chat with her happily. Mou understood and waved at them, \"See you, Senior Qin and little sister!\"</p><br/><p>Who is your little sister? I’m only one year younger than you. I’ll be going to college next year! (You are still younger than her though.) Huang Jiajia was trying to pull Qin Guan into the supermarket. Qin Guan suddenly patted her on the hand. \"Wait a moment. I want to buy a bottle of water from the newsstand.\"</p><br/><p>Huang Jiajia was confused. There were all kinds of drinks in Carrefour. Why did he want to buy mineral water from a small newsstand? Qin Guan handed one yuan to the cashier and got a bottle of Nestle water.</p><br/><p>He ran back to Mou Xiaoliu and gave her the bottle. \"As a senior, I can’t do much to help you. This costume is too thick for this weather. You may get dehydrated if you don’t drink water.\" Before she could say anything, Qin Guan stuck the bottle into the collar of her costume. Patting her short paw, he said, \"I know what you’re about to say. You are really strong, but even strong cows have to be fed before work, right?\"</p><br/><p>Then he waved his fist at her, encouraging her, \"Cheers!\"</p><br/><p>Mou Xiaoliu nearly cried as she watched Qin Guan run away. The water was at normal temperature, but it felt cold on her skin in the intense summer heat. She sniffed, took the bottle from her collar and placed it carefully on a small chair nearby. She opened it stupidly and took a sip with shaking paws.</p><br/><p>It was sweet and cool, washing away all the sweat on her body. She carefully sealed the bottle and put the bear head back on. I’ll drink it after I finish work.</p><br/><p>Huang Jiajia curled her lips at Qin Guan, murmuring, \"You pretend to be nice and kind-hearted!\"</p><br/><p>Qin Guan looked at her helplessly, making fun of her, \"I’m buying you a snack and accompanying you to the supermarket. Is it getting more serious?\"</p><br/><p>Huang Jiajia answered sullenly, \"That’s different. You owe me!\"</p><br/><p>\"I could just buy you snacks and send them to your house.\"</p><br/><p>\"No! You don’t know my favourites. I don't care, I really don’t care. I can't hear what you are saying, you’re a really boring person.\"</p><br/><p>Huang Jiajia was acting like a scoundrel.</p><br/><p>Qin Guan could do nothing but serve the princess by getting a trolley. When they reached the snack alley, Huang Jiajia suddenly transformed into Nezha [1], growing six arms and starting to throw snacks into the trolley. Looking at the pile of snacks, Qin Guan felt like he had a toothache. His left eyelid started trembling. There was an old saying that said that a trembling left eyelid meant fortune, while a right one meant disaster. Actually, a trembling left eyelid meant losing a fortune. Hey, Huang Jiajia. Chips are not healthy. Dried fruit has high oil content. Drumsticks, dried beef and duck livers have high cholesterol! In my opinion, spicy strips are good, cheap and tasty. And bubble gum is fine for chewing…</p><br/><p>(Nobody is stingier than you, Qin Guan.)</p><br/><p>With a trembling heart, Qin Guan waited for the cashier to scan the QR codes, which took more than 10 minutes. Then he pulled out his shopping card with quivering hands. Huang Jiajia grabbed it and handed it to the cashier without hesitation. \"Here you are. Swipe away.\"</p><br/><p>It's not your card! Of course you’re not reluctant. With tears in his eyes, Qin Guan lifted the four large plastic bags and followed Huang out of the cashier area. Before he could go out, his phone started ringing in his pocket. He heard Sister Xue's urgent voice at the other end of the line. \"Hurry up, Qin Guan! What you are doing? Are you free now?\"</p><br/><p>Qin Guan held the phone tightly as he answered, \"Yes, I’m free. What's going on?\" He glanced carefully at Huang Jiajia beside him.</p><br/><p>Sister Xue exhaled in relief as she said, \"Take a taxi to XXX studio on XXX road at once. You have an interview for a T show.\"</p><br/><p>Qin Guan was confused. \"As far as I remember, that interview is next week. Is it a New Silk Road job?\"</p><br/><p>Sister Xue explained fast, \"The brand company has asked the designer to release the fashion show ahead of schedule, so they haven’t found a suitable model for the main show. Cheer up and try impress the designer. You don’t just have to pass the interview, but also make a good impression on him. You better get the main show job, understand?\"</p><br/><p>Qin Guan nodded unconsciously. The interview was at 1:30 pm. It was already 11:00 am, and it would take him half an hour to get there by car.</p><br/><p>Sister Xue would take some time off to make a brief introduction of the concept of the brand as well as the designer’s background. The preparation had originally been supposed to happen the following week. Qin Guan had no idea how much Sister Xue would be able to tell him in such a short time.</p><br/><p>[1] A god in Chinese legends, who grew six arms when fighting with others.</p><br/>\n</div>"}