{"title": "Chapter 108: Opportunity", "id": 108, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-108-opportunity", "volume_title": "Volume 2", "body": "<h1>Chapter 108: Opportunity</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: Opportunity</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Mou Xiaoliu shook her head repeatedly. \"No, thanks. I don’t know you. My bad! How could you treat me? Shall I take you home first? If your house is near my college, I could treat you at our cafeteria to apologize.\"</p><br/><p>Huang Jiajia made a disdainful grimace. \"There’s nothing delicious there. No!\"</p><br/><p>\"Senior Qin has dinner there,\" Mou Xiaoliu said regretfully. \"It’s near his dormitory.\"</p><br/><p>Huang Jiajia cheered up, changing her mind at once. \"What are we waiting for then? Take me home first, and then you can treat me at the cafeteria!\"</p><br/><p>Mou Xiaoliu was smiling like silly as Huang Jiajia pulled her toward a taxi. They became good friends instantly and headed for the cafeteria. The little fox and the little bear. Who would win?</p><br/><p>Meanwhile, Qin Guan was deeply troubled. He was listening to Sister Xue's introduction about the concept and the designer’s background. At the same time, he had to cope with Ouyang Fen, who was sneering at him.</p><br/><p>Both of them had gotten the notice about the interview, as they were the rising stars of New Silk Road. Ouyang Fen's advantage over Qin Guan lay in the fact that he was a formal model of the company, while Qin Guan was only an affiliated model.</p><br/><p>It was only a T show for a second-level brand, but it was still quite rare for two rising stars. SS Group had engaged in men's formal wear since the beginning of time. The brand was not the best there was, but neither was it the worst. The boss was always thinking of ways to change the brand’s status. That year, he had found new investors and planned on using their money to advertise and promote the brand. This was his chance to squeeze in the circle of first-level domestic brands, so he had made a tight schedule for the show.</p><br/><p>All the preparations had been completed. Everyone was just waiting for the show to take place. The boss was sure of himself, but the designer was crying for help. The show had been pushed up by more than half a month. He had not even found a suitable model yet.</p><br/><p>That was why the interview had also been pushed up. As Sister Xue made her introduction, Ouyang Fen could not hold back his sarcastic comments.</p><br/><p>\"Oh, you had no idea about the interview. What an unprofessional model!\"</p><br/><p>\"You want to be a main show model? You are only a green hand! This is practically your first show!\"</p><br/><p>\"Ha ha! My brother told me this is your first formal show...\" Ouyang Fen betrayed his brother without any hesitation.</p><br/><p>Sister Xue stared at Ou Qiang with a fierce expression. Ou Qiang covered the mouth of his younger brother. He didn’t loosen his hand until Sister Xue had finished the introduction.</p><br/><p>Ouyang Fen asked Ou Qiang angrily, \"Whose side are you on? He is your brother’s enemy! He is competing with me for the main show!\"</p><br/><p>Looking at his younger brother in sympathy, Ou Qiang murmured to himself, \"Dear brother, you may be defeated by your enemy. Besides, you need to control your temper. Do it for me.\"</p><br/><p>Ignoring Ouyang Fen, Qin Guan reviewed the material carefully.</p><br/><p>As an old enterprise, SS Group's factory and brand had a long history compared to its competitors. The problem with SS Group was the outdated ideas of its designers, most of whom had graduated from fashion school lots of years ago. The customers’ taste had changed over time. Some other fashion groups, such as B Group and Y Group, had begun to hire foreign designers or domestic ones who had studied overseas. SS Group had invited a new designer for the fall collection, aiming to bring about an upswing with its newest concept.</p><br/><p>In Qin Guan’s opinion, the designer might be looking to introduce some fresh blood in his first show, so he and Ouyang Fen might actually stand a chance. As he looked around the hall, he saw many young faces. His gut feeling had been right.</p><br/><p>At 1:30 pm, the door of the studio suddenly opened. An assistant with a pile of paperwork announced, \"First, we would like to express our appreciation to everyone for attending the interviews of the fall show of SS Group. I’m Wang Jun, assistant of the chief designer of SS Group, and I will be working together with you in the future. Now I’d like to explain the rules of the interviews. Every model I call has to enter the chamber I just came out of with their paperwork. You’ll have a private interview with the designer. After all the applicants have finished their interviews, the results will be announced from a paper given to me by the designer. Our assistants for the show will take accurate measurements of all the remaining models. The first interview will begin now. Good luck to you all.\"</p><br/><p>\"Is Liu Jia here?\"</p><br/><p>The model stood up after a short pause. He took his file from the assistant and entered the studio. Everyone else remained silent. In less than two minutes, the model had walked out and the next name had been called.</p><br/><p>\"XXX.\"</p><br/><p>\"XX.\"</p><br/><p>They went into the chamber one by one. Qin Guan, who had arrived last, was the last one to have an interview.</p><br/>\n</div>"}