{"title": "Chapter 111: Beer Sales Girls", "id": 111, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-111-beer-sales-girls", "volume_title": "Volume 2", "body": "<h1>Chapter 111: Beer Sales Girls</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 111: Beer Sales Girls</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Huang Jiajia felt Mou Xiaoliu's full breasts with her hands. They were so elastic! Huang Jiajia's face turned red. Mou Xiaoliu cared about nothing but the mini skirt. Will it cover my butt? Although their thoughts were on a different frequency, their movements were extraordinarily synchronized. The superior's eyes lit up when Mou Xiaoliu returned.</p><br/><p>Waving his hand, he said, \"You, the green hand! Yes, you. You’ll be the Budweiser promotion girl at the Dream Bar.\"</p><br/><p>One of the other girls objected to his decision. She was obviously a veteran. \"I disagree. She is only a newcomer. How can she be sent to the largest bar? I refuse to accept it!\"</p><br/><p>Glancing at her from the corner of his eyes, the superior answered, \"I have already given you a chance. Did you forget that you were defeated by the Corona sales girl and came back looking all gloomy?\" The girl went back to the group silently.</p><br/><p>There was fierce competition everywhere. A part-time beer selling job was a favorite job among college girls. One reason was because the working hours were from 20:00 to 2:00 at night on weekends, so they could have a good rest after making money. The second reason was the high salary. Their basic salary for one night could go up to 80 yuan, plus a 0.5 yuan deduction wage. The job could be a goldmine.</p><br/><p>Of course, there was fierce competition among different brands. Sales girls of more than two brands could show up at the same bar at the same time. It was a battlefield without the gunpowder.</p><br/><p>Mou Xiaoliu had no idea about the reality of the job. Following the superior, she arrived at the reception of the Dream Bar. After saying hello to the waiters, the superior left to attend to his own affairs.</p><br/><p>Huang Jiajia had the talent to naturally engage with people. She found a comfortable position on the bar counter and guided Mou Xiaoliu there.</p><br/><p>\"Don’t be nervous. You are a beer sales girl, not a goods carrier. You can hold the tray with one hand.\"</p><br/><p>\"Smile to the customers! They don't owe you money. Imagine that their heads are bills. That's right!\"</p><br/><p>Her mouth felt parched and her tongue scorched as more and more customers arrived at the Dream Bar. The warm-up singer had already sat at the stage, preparing for the first song of the night. That was when the first round of beer sales began.</p><br/><p>The Carlsberg and Corona sale girls had already walked out with their trays. Pushing Mou Xiaoliu, Huang JIajia encouraged her, \"Hurry up! Remember my advice!\"</p><br/><p>Bracing herself, Mou Xiaoliu took the first step. The unique skills Huang Jiajia had taught her were haunting her brain as she murmured to herself. At the sight of the strangers in the dim hall, she felt frightened.</p><br/><p>I would rather do physical work at a construction site! Once the arrow was put on the bow though, it had to fly. Mou Xiaoliu was ready to risk everything.</p><br/><p>She chose a table at random and walked over. The Corona girl got there before her.</p><br/><p>There were three men sitting at the table. According to the Corona girl’s experience, they were colleagues who had just gotten off work. They would have several bottles of beer to relax, and then they would head home. The first round of promotion was the key to success.</p><br/><p>The Corona girl presented her tray to them with a sweet smile. Before she could say anything, Mou Xiaoliu walked over, looking at her in anger. She repeated to herself in a low voice, \"Lower your head, bend down and smile!\" She put the tray on the table with a bang. The table trembled slightly. Before the three company employees knew what had happened, Mou Xiaoliu was smiling at them like silly.</p><br/><p>One of the three men, who was obviously the leader of the group, opened his mouth. \"Which brand do you have?\"</p><br/><p>Mou Xiaoliu answered blankly, \"Budweiser.\"</p><br/><p>\"Fine, one dozen.\"</p><br/><p>Mou Xiaoliu was over the moon. She had made her first deal! She decided to express her appreciation by following Huang Jiajia's advice. She bowed forward, dazzling the three young men.</p><br/><p>What a beautiful picture. The leader was too excited to say anything, but he managed to utter one sentence.</p><br/><p>\"One more dozen! Two dozen in total!\"</p><br/><p>These men are good for nothing! Sitting at the bar counter, Huang Jiajia made the victory sign. In the restless night of the bar, Mou Xiaoliu became the queen of sales. More and more customers waved at Mou, who was standing like silly in front of the bar counter. Some customers treated the singer, and some tipped Mou. Many women also took a liking to her, as her round cheeks and eyes reminded them of a hairy bear.</p><br/><p>It was a noisy night. What was Qin Guan doing at the time? He had gone to bed early like a good student. His legs were positioned randomly, and the quilt was lying across his stomach. Maybe he was dreaming of something. Smiling and rubbing his face, he turned on his side and continued to sleep.</p><br/><p>Suddenly, his cell phone rang. Liu Xiaoyang, who was sleeping on the upper bunk, kicked at the bed frame. \"Answer the phone!\"</p><br/><p>Qin Guan got up in a daze and went over to the phone by the door. He was the one closest to the phone, so that job naturally fell to him.</p><br/><p>He couldn’t see until he reached the door. It was his cell phone ringing. He returned to his bed and answered it. \"Hello, who is it?\" Who was calling him that late at night?</p><br/><p>An urgent voice was heard from the other end of the line, \"It’s Huang Jiajia! It’s an emergency! I’m at the Dream Bar on Sanlitun Street.\"</p><br/><p>Qin Guan woke up with a start. \"You went out at night again! You troublemaker!\"</p><br/><p>\"It’s not me! It’s Mou Xiaoliu, the bear we met today. She works as a beer sales girl here.\"</p><br/><p>\"Ah!\" The noise of crashing bottles, broken tables and crying people came from the receiver. Qin Guan could hear the chaos.</p><br/><p>Huang Jiajia shouted excitedly, \"Are you sleeping? Just go back to sleep. It’s all been settled!\"</p><br/>\n</div>"}