{"title": "Chapter 117: Hypocrite", "id": 117, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-117-hypocrite", "volume_title": "Volume 2", "body": "<h1>Chapter 117: Hypocrite</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 117: Hypocrite</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Shao’s agent hung up in embarrassment before reminding Shao Xiaobing, \"You accepted both jobs. Why are you so worried over a green hand? Those are ordinary jobs with a low salary.\"</p><br/><p>Shao poured a cup of tea for himself, watching the tea leaves spinning along with the water. He lifted the cup and took a sip. \"Foolhardy and silly men beat their enemies to the ground. The best way is to leave no opportunity to your opponent. Without any exposure to the public, he will be no enemy. He’ll just be standing on an empty battlefield.\"</p><br/><p>His agent was not comforted. \"Can you make time in your schedule for the two extra jobs?\"</p><br/><p>Shao held the tea leaves in his mouth before spitting them into the dustbin. \"Rubbish will always be rubbish. I can get an idea about his level by those two jobs. Actually, he is not a real enemy, just an annoying fly. Such low-level jobs can be finished in one hour. Don't worry about it. Just keep your eyes on New Silk Road’s commercial promotion. We can’t miss anything!\"</p><br/><p>The agent wiped the sweat off his forehead. I have to find a new assistant for him. I can't stand being alone with him.</p><br/><p>Sister Xue looked as sas as if her parents had died. Ni had called her again to notify her that Qin Guan had lost another interview.</p><br/><p>Is it true then that misfortunes never come alone? This meant that Qin Guan would be idling until Xie Feng’s show, and she, the aggressive Sister Xue, would have to live on a leftover jar of fermented bean curd.</p><br/><p>I shouldn't just sit and wait. I’m the famous leader of agents for untrained models. What should I do now? Of course! Beg mercy from celebrities!</p><br/><p>Not long after, a sobbing Sister Xue got instructions from Professor Li. In order to be in a better condition for Xie Feng's show, Qin Guan would have to switch his focus to T stage-related jobs.</p><br/><p>This was easier said than done. The domestic demand for models was limited, and there were not that many high-quality T shows for Qin Guan to choose from.</p><br/><p>Fine, we’ll just develop along the way!</p><br/><p>Qin Guan had no time to pay attention to the cancelled interviews and Sister Xue's plans. He was too busy comforting his friend and his girlfriend.</p><br/><p>Liu Xiaoyang was sad about the death of Chamberlain, the basketball star, while Cong Nianwei was grieving over the death of Nathalie Sarraute, her favorite French author.</p><br/><p>Many celebrities had passed away that year. Qin Guan knew Chamberlain, but without Cong Nianwei, he wouldn’t have known who the hell Nathalie Sarraute was.</p><br/><p>He had to start reading more books. Lovers without common interests did not last long.</p><br/><p>It was simpler to comfort Liu Xiaoyang. A college-wide basketball game was enough. The honorable, arduous task had naturally fallen to Ye Dong.</p><br/><p>Ye Dong had appreciated the constructive suggestion. The united club activities of the year would be starting soon. A basketball league game for sophomores in memory of Chamberlain would have a significant meaning.</p><br/><p>Ye Dong knew that the other members of the Student Union would respect him for the idea and the Secretariat of Public Affairs would salute him. He agreed without hesitation, thus winning Liu’s deep trust and friendship.</p><br/><p>The only problem was Cong Nianwei.</p><br/><p>Qin Guan had asked Sister Xue for help, but she had been annoyed because this had nothing to do with work. What? Are you showing off your monogamous relationship now?</p><br/><p>Sister Xue felt betrayed by Professor Li, who was also interested in Nathalie Sarraute. She had studied in France, and there was a collection of Nathalie Sarraute's original editions on her bookcase.</p><br/><p>Qin Guan expressed his and his girlfriend’s emotions about the author. Unexpectedly, Professor Li gave all her Nathalie Sarraute books to Qin Guan as a gift. Qin Guan had been promoted from a student to a close friend in her mind.</p><br/><p>Sister Xue was about to collapse with envy. I’m her student too. It's unfair!</p><br/><p>A few days later, Cong Nianwei received a package with the card \"Best wishes to my dearest girlfriend. May you be happy forever.\"</p><br/><p>Surrounded by her excited roommates, Cong Nianwei opened the package to find two elegant original-edition books in French.</p><br/><p>With tears in her eyes, Cong Nianwei caressed the author’s name on the cover. All the girls were moved by Qin Guan's gesture, but Cong Nianwei was cursing him silently.</p><br/><p>I don't speak French. The English edition would have been better. Considering Cong Nianwei’s admiration of the author, this was like forcing her to learn French.</p><br/><p>Many years later, when Cong Nianwei would deliver a speech on stage, she would mention Qin Guan’s help and how he had made her study more and more. He was a good Chinese man and a considerate boyfriend.</p><br/><p>Qin Guan couldn't make out her words on the phone. He would be attending the united club activities and represent the sophomores as a mascot.</p><br/><p>On the day before the opening, the Student Union finished decorating the paths in the garden.</p><br/><p>Between the square fences, all the clubs had arranged their own elegant posters and exhibitions.</p><br/>\n</div>"}