{"title": "Chapter 124: A Mysterious First Glance", "id": 124, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-124-a-mysterious-first-glance", "volume_title": "Volume 2", "body": "<h1>Chapter 124: A Mysterious First Glance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 124: A Mysterious First Glance</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan's outfit represented deep autumn, forming a connecting link between the previous and the following season.</p><br/><p>When Sister Xue observed the audience before the models got on the stage, she nearly got a heart attack.</p><br/><p>Professor Li was sitting under the stage. The chief editor of ELLE was beside her, and An Jing, a famous designer of the previous generation, was on her other side.</p><br/><p>My god! The audience included every renowned domestic designer and media and fashion critic. None of them were in the same world as Qin Guan.</p><br/><p>Only then did Sister Xue realize that all the models in the show were famous except Qin Guan. That explained why everyone had been interested in Qin Guan backstage. People had tried to talk to him out of curiosity. Was he a relative of Xie Feng or a friend of someone else?</p><br/><p>The exclusive fashion show was a trial for the Milan Fashion Show, where Xie Feng had been the only Chinese designer to be invited.</p><br/><p>A small bird always stood out among a group of colorful tropical birds.</p><br/><p>Before anyone could think, the background music started playing. Sister Xue reminded Qin Guan seriously, \"Watch and learn from the others. It would be beneficial for you.\"</p><br/><p>Qin Guan looked down at his bare feet. It was cool to stand on the floor without shoes. The dressing assistant put two round golden bracelets on his arms and ankles. They all tinkled when he walked.</p><br/><p>Cheered up, Qin Guan felt ready for his first formal fashion show.</p><br/><p>The side door opened, and Qin Guan’s bare feet trampled on the stage. His toes moved unconsciously on the cool floor. He pulled himself together and got on the T stage. Sister Xue was the most nervous. Her blood vessels were close to exploding.</p><br/><p>Qin Guan was worried for the first time in his life. Every hair on his body was standing on end. Every pore was open. Every cell was jumping around happily.</p><br/><p>It seemed like he had been born for the shining stage. He started walking on it, his golden bracelets tinkling to express the sorrow of the wind and the sand.</p><br/><p>Half-way through the show, the VIPs saw a strange new face. Many of them were attracted to the model, and they tried to find the advantages the designer attached importance to.</p><br/><p>That was the so-called first glance that would determine Qin Guan’s fate. It was his day.</p><br/><p>The audience applauded the designer. Backstage, Sister Xue wiped imaginary tears from the corners of her eyes. My little bird is going to fly away. (You are thinking too much. He still has a long way to go.)</p><br/><p>After Qin Guan changed out of his clothes, he heard Xie Feng talking to him.</p><br/><p>\"I have already been preparing for the show for several months, and the models have been selected in France. Otherwise, I might have considered taking you to Milan.\"</p><br/><p>Fully aware that he was just being polite, Qin Guan bowed in gratitude. It was amazing to be complimented by a designer.</p><br/><p>The surrounding models, who were about to be dismissed, felt a little jealous. Xie Feng hadn’t been as kind to them during their debuts.</p><br/><p>Holding the money happily by the stage, Sister Xue had a stroke of luck. Xie Feng waved at her and Qin Guan from the backstage exit. They all returned to the T stage again.</p><br/><p>Qin Guan saw clearly the people under the stage, among whom was Professor Li.</p><br/><p>Generally speaking, Professor Li was strict with Qin Guan's performance and sneered even at his smallest mistakes. However, that day she was different.</p><br/><p>Smiling, she asked Xie Feng and everyone else, \"What did you think of my student?\"</p><br/><p>They all echoed, \"He’s a young man with great potential.\"</p><br/><p>\"Professor Li has a discerning eye. You may be old, but you still have a vigorous mind.\"</p><br/><p>Professor Li said nothing. She just whispered something to Xie Feng and let him attend to his own affairs.</p><br/><p>What happened next was very important. Professor Li introduced Qin Guan to Yin Yan, the chief editor of ELLE magazine. As someone from both France and China, Yin was an expert on the fashion industry.</p><br/><p>She had graduated from Peking University, and was an endowed scholar. She had majored in directing in France, and she had a mysterious romantic aura. Her original fashion concept had helped ELLE clothing enter China.</p><br/><p>With a stepping-stone of top-level luxury, the magazine had established its own position in China and looked down upon other printed media that lacked good taste.</p><br/><p>ELLE was a frequent visitor at new prominent shows, but this show was so important that the chief editor had attended it personally.</p><br/><p>Yin Yan rejoiced, thinking she had discovered an unpolished pearl in the fashion industry.</p><br/><p>Professor Li introduced her to Qin Guan, \"This is Yin Yan, chief editor of ELLE. And this is Qin Guan, my student.\"</p><br/><p>Qin Guan nodded and shook her hand gently, while Yin stated her intentions without hesitation.</p><br/><p>\"You will be our inside spread model next week.\"</p><br/><p>Before her voice had died away, another voice cut in, \"No, you will be our inside spread model.\"</p><br/><p>Yin Yan turned around. An acquaintance! It was Zhang Hui, chief editor of Rayli. Zhang Hui was Yin’s arch enemy.</p><br/><p>ELLE Clothing and Rayli were completely different. One engaged in magnificent boutique clothes, and the other focused on student clothes. Their readers were different people.</p><br/><p>The point was that ELLE was divided into ELLE Fashion and ELLE Clothing in China, based on the different focus. Zhang Hui had copied the method and divided Rayli into Rayli Clothing and Rayli Fashion.</p><br/><p>The clothing part of the youth fashion magazine was separated. Naturally, some casual style brands paid more attention to Rayli.</p><br/><p>The most hateful part was that young readers were favored by several casual clothing American and Japanese brands. Yin Yan gritted her teeth at the thought.</p><br/>\n</div>"}