{"title": "Chapter 125: Arch Enemies Always Get Together", "id": 125, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-125-arch-enemies-always-get-together", "volume_title": "Volume 2", "body": "<h1>Chapter 125: Arch Enemies Always Get Together</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 125: Arch Enemies Always Get Together</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Sister Xue had no idea about the killing intention between the two women. What she knew was that she and Qin Guan would become rich.</p><br/><p>The two magazines were not regional printed media like the Capital Entertainment Newspaper. They were international magazine supplements released nationwide in Asia, and they were the cradles of countless top models!</p><br/><p>The two chief editors were about to have a fight. If Qin Guan failed to comfort them, they would throw their gloves at each other’s faces.</p><br/><p>Qin Guan, who was usually careless, was unusually quick-witted in that situation. He rubbed his jaw and replied, \"In my opinion, I could match well any magazine's style. The sales volume is your problem.\"</p><br/><p>Was he smart? He basically meant that he would do his own job well during the photoshoot, but the volume sales would depend on the editors’ abilities. The two women’s eyes shone in interest at the suggestion. They both said in one voice, \"Deal.\" They set a shooting time while Sister Xue’s mouth was still open in surprise.</p><br/><p>That night, Qin Guan had an exceptionally good sleep. His savings had reached 50,000 yuan, while Shao Xiaobing, who would be working early the next morning, was going to have a sleepless night.</p><br/><p>Shao opened the newspaper bought by his new assistant and turned to the entertainment page. Half the page reported news about Xie Feng, who had held a domestic show before the Milan Fashion Show. There was a remarkable group photo of the designer and his famous models.</p><br/><p>Frowning slightly, Shao Xiaobing picked up his teacup from the table and scanned the models behind Xie Feng. They were all imaginary future enemies on his way to success.</p><br/><p>Suddenly, his eyes zeroed in on the model on the far left. It's Qin Guan! He buried his face in the newspaper, looking for more details. Suddenly, he threw his cup against the wall.</p><br/><p>\"Bang!\"</p><br/><p>The little porcelain cup broke into pieces.</p><br/><p>The assistant was scared, and so was Shao’s agent, who asked in surprise, \"What's wrong?\"</p><br/><p>Laughing grimly, Shao Xiaobing threw the newspaper on the table and shouted angrily, \"See for yourself!\"</p><br/><p>His agent was confused by the news. \"I had contacted the show, but they’d decided on the opening model eight months ago. The models for the Milan show will be famous overseas models. I think you interviewed for the show, but you were rejected because of your different style.\"</p><br/><p>At the time, Shao hadn’t been angry about the result. Models always had their own personal style. It was common to be rejected for that reason.</p><br/><p>\"Look at the models carefully!\" Shao Xiaobing waved at his assistant, who left the office quivering.</p><br/><p>The agent looked at the photo again carefully. It was Qin Guan! He was among the group. He looked up at Shao. During the past month, they had taken four or five jobs from Qin Guan.</p><br/><p>Such a practice was strictly forbidden in model circles. Luckily, his friend at New Silk Road trusted him. Besides, Qin Guan could only get some tiny jobs. If this had happened to another model, even Ouyang Fen, New Silk Road would have paid more attention. Qin Guan was an affiliated model though, so he was neglected by the company.</p><br/><p>The agent tried to comfort Shao, \"It must have been an accident. He will not go to Milan. Most of Xie Feng’s work is overseas. Qin Guan won't get such a chance. Calm down. You have a photoshoot for Rayli tomorrow. You have to look good.\"</p><br/><p>Shao Xiaobing let out a long breath, calming down. \"Ask my assistant to clean the room,\" he ordered.</p><br/><p>Qin Guan had no idea that his enemy would have to collaborate with him again. He was just sitting leisurely in the dressing room, getting his makeup on.</p><br/><p>He would have to take photos for two magazines in one day. The first was the color photos for Rayli Clothing.</p><br/><p>Rayli Clothing was a fashion magazine that mainly engaged in leisure and youth style and taught girls how to apply makeup. Some handsome boys occasionally appeared in the magazine to make suggestions for men's wear.</p><br/><p>As the dresser praised his tender skin and fine pores, Qin Guan walked out of the dressing room and came face to face with Shao Xiaobing.</p><br/><p>Both Shao and his agent were speechless. Qin Guan left the door open for them, and Sister Xue said hello politely to the agent.</p><br/><p>Shao Xiaobing smirked in answer before entering the room and glancing at the female models who were looking at him.</p><br/><p>Sister Xue let out a long breath. Is it just me, or was Shao’s expression as he looked at Qin Guan not that friendly?</p><br/><p>Shao Xiaobing didn’t say anything as the makeup artist worked on him. His assistant was already unexplainably afraid. It’s said that suppressing Qin Guan is his new goal. The assistant sneaked a glance at Qin Guan. He is so handsome.</p><br/><p>Suddenly, she felt a cold wind behind her. Shao Xiaobing told her in a soft voice, \"What are you doing? Are you idling around? Make a cup of tea for me!\"</p><br/><p>Looking at the scared assistant, the agent sighed. He was about to say something, but Shao Xiaobing stopped him with a gesture before walking directly into the shooting studio.</p><br/><p>The style of the clothes was fresh. Clean sweaters and jeans went well with the young models.</p><br/><p>Qin Guan was supposed to be shopping for accessories with a female model. They both had splendid smiles and looked very energetic.</p><br/><p>The photographer was quite satisfied with Qin Guan. The main problem for printed media models was the slight flaws in their figures, not their face or body language.</p><br/><p>Like a fairy sent from the heaven, Qin Guan combined the advantages of both sides perfectly. Even the photographer anticipated a rise in the sales volume after this issue was released.</p><br/>\n</div>"}