{"title": "Chapter 121: Using Temporary Knowledge", "id": 121, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-121-using-temporary-knowledge", "volume_title": "Volume 2", "body": "<h1>Chapter 121: Using Temporary Knowledge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 121: Using Temporary Knowledge</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Liu Xiaoyang failed to catch the ball. Instead, he fell forward and his face hit the ground.</p><br/><p>Bang!</p><br/><p>The audience stood up at the sound. It was painful to watch. Liu's team members ran over to him and supported him with their hands.</p><br/><p>The referee blew his whistle, \"No. 6, personal foul!\" \"</p><br/><p>Despite the dirt on his face, Liu Xiaoyang looked good.</p><br/><p>Before anyone could relax though, two streams of blood flowed down from his nostrils.</p><br/><p>\"Did I catch a cold? I have a runny nose,\" Liu told Qin Guan dizzily.</p><br/><p>Qin Guan was both angry and amused. \"Have a rest. Wang Lei will take your place,\" he told Liu. \"You have a nosebleed. You should go to the dispensary.\"</p><br/><p>Liu Xiaoyang frowned as he was supported off the court. A cold flash lightened Wang Lei's eyes. He took off his glasses, swung his arms around several times, and got on the basketball court.</p><br/><p>The whistle was blown again. Liu Xiaoyang tried to stop the blood temporarily and stayed there. He decided to watch the game until the end.</p><br/><p>Great! Wang Lei from the Accounting Department has the basketball. What will he do? He shoots directly. Good! Standard posture. The ball is flying. The defense of the other team fails to stop him.</p><br/><p>Then? Then nothing. The ball missed the basket. Wang Lei passed the ball to the other team; he couldn't get it to his teammates.</p><br/><p>Wang Lei gestured to the referee. He wanted to put his glasses on again, but his friends tried to stop him from playing. The opponents are playing dirty, it would be too dangerous for him.</p><br/><p>There was only one choice left. Everyone turned their eyes to Qin Guan. \"Can you play basketball, Qin Guan?\"</p><br/><p>\"It doesn't matter. At least you can try. We can't lose face in front of our opponents.\"</p><br/><p>\"That's right!\"</p><br/><p>\"We believe in you!\"</p><br/><p>Several team members were talking to him. \"Have you played basketball before?\"</p><br/><p>\"Only in PE class.\" Qin Guan tried to recall the actions of the players.</p><br/><p>\"Okay, you can just pass the ball to the others.\"</p><br/><p>They asked the referee for a substitution.</p><br/><p>Qin Guan began to take off his clothes, when the audience, including the students around the other courts, started gathering around and shouting, \"You are so handsome, Qin Guan!\"</p><br/><p>\"Cheers!\"</p><br/><p>Nobody could keep their composure before such a beauty in a fitting waistcoat and sport shorts.</p><br/><p>Qin Guan didn’t care. He just picked up the ball, supporting it with a single hand as he struck a sexy pose.</p><br/><p>All his opponents were speechless. He was like a mass destruction weapon. The dream guy of all the girls and some of the boys was coming.</p><br/><p>\"F*ck! Who said that he wouldn’t play?\"</p><br/><p>\"Who knows? We have to brace ourselves.\"</p><br/><p>\"Shall we play dirty?\"</p><br/><p>\"Are you mad? Do you want to be beaten to death? Or do you want the girls to hate you? You can try, but you’ll never get a girlfriend in your life.\"</p><br/><p>They had lost even before the game had begun.</p><br/><p>Qin Guan recalled Wang Hao’s moves and mimicked what he had seen. He sprinted to the opponents’ side and jumped high with the ball in one hand.</p><br/><p>The audience was silent as he flew high in the sky.</p><br/><p>Bang!</p><br/><p>The ball hit the edge of the basket and flew away.</p><br/><p>His opponents burst into laughter. Wang Hao wiped his cold sweat away. Just when he thought he would lose his title as the basketball prince... Qin Guan was just a show off after all.</p><br/><p>Falling down on the floor, Qin Guan looked at his palms in confusion. It's strange. Memory and muscle reaction are the same. Why did I fail?</p><br/><p>Qin Guan was still confused, when suddenly Wang Hao came over and pushed him provokingly with his chest. He had forgotten to take the 10-centimeter height difference into account though.</p><br/><p>The girls felt disappointed and sorry for Qin Guan. He is still numb from the failure, and that hateful Wang Hao is trying to provoke him. What a despicable guy!</p><br/><p>Several of Wang’s fans had to hide, as it was too dangerous to arouse the anger of the masses.</p><br/><p>Qin Guan gestured at Liu Xiaoyang and Wang Lei to reassure them. His action made the girls scream again.</p><br/><p>It was a foul to promote oneself! Wang Lei planned to teach Qin Guan a lesson. The so-called star of the 1998 class would learn.</p><br/><p>After several rounds, Qin Guan was familiar with the rules and the basic movements and shooting techniques that matched his height.</p><br/><p>By then, the point guard had passed him the ball, and he tried to shoot again. Alarmed, Wang Hao shouted, \"Stop dreaming! I’m here!\"</p><br/><p>He leapt up and stretched his hands around Qin Guan while his body tried to collide with his.</p><br/><p>Qin Guan smirked. You’re the one who’s dreaming. Professor Li’s tough training had played an important role. Using the strength in his waist muscles, Qin Guan turned his body 270 degrees before they collided. He avoided Wang Hao and stretched his arm out to throw the ball into the basket.</p><br/>\n</div>"}