{"title": "Chapter 139: The Great Director", "id": 139, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-139-the-great-director", "volume_title": "Volume 2", "body": "<h1>Chapter 139: The Great Director</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 139: The Great Director</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The seductive poster, together with a cup of afternoon tea, made the cafe opposite the store inexplicably popular.</p><br/><p>An even more inexplicable series of events followed. The boss of the J shirts aired the advertisement on dozens of local TV stations, one of them a capital TV station. He dared not bother with CCTV, as he didn’t have enough money.</p><br/><p>The total ad rates were less than CCTV’s rates alone. The boss was industrious and thrifty.</p><br/><p>As a result, after the CCTV news finished at 7:30 pm, no matter which station one switched to, they most likely saw Qin Guan.</p><br/><p>His parents were about to watch a famous TV series while eating fresh fruit, when they suddenly saw their son running around on TV, chased by other people. They silently picked up the phone.</p><br/><p>Cong Nianwei had been forced by her roommates to watch \"Wen Cheng Princess\", when she suddenly saw Qin Guan. Is this because I haven’t called him in a long time? She sprayed the water she had been drinking on the screen. I’d better call him later.</p><br/><p>Her friends all had good eyesight. As expected, they recognized Qin Guan right away.</p><br/><p>\"That’s your boyfriend! Is he a celebrity?\" It depends on your definition of a celebrity.</p><br/><p>\"Where? It’s really him! Congratulations! You have to treat us!\" This one would do anything for a free meal.</p><br/><p>I have to call my boyfriend. Cong ignored her shameless roommates without hesitation.</p><br/><p>Countless people saw Qin Guan on TV and recognized him.</p><br/><p>That night, Li Shaohong went home. As she was sitting on the couch, she was thinking about her play, \"Dame Palace\", which was half-way through production. The actors for Zhang Yizhi and Zhang Changzong were still being selected.</p><br/><p>Zhang Yizhi would be played by Zhao Wenxuan. No one had objected to that. However, she had interviewed more than ten actors for the part of Zhang Changzong, and nobody had impressed her.</p><br/><p>The real Zhang Yizhi had been a gentle, elegant, calculating man. He had been an expert on ladies and courting.</p><br/><p>On the other hand, Zhang Changzong had been a handsome, simple boy, renowned for his beauty. People said that he had been as pure as a fresh lotus.</p><br/><p>Li Shaohong had a general idea about the actor she wanted to play the part. As a tall man among shorter ones, Gao Jiangping from the Beijing People’s Art Theatre was her ideal choice.</p><br/><p>Gao Jiangming was a serious man. She had been unable to find an actor with outstanding beauty, so she’d had to choose one with good acting skills. Maybe we’ll have to apply more powder to his face.</p><br/><p>Li sighed and pressed the remote control. The historical TV play \"Wen Cheng Princess\" was on.</p><br/><p>When there was a commercial break during the play, Li frowned slightly. Annoying ads again! Local TV stations air ads four or five times in a few minutes.</p><br/><p>Li Shaohong stopped flipping through channels when she suddenly saw Qin Guan being carried by the other models to the rooftop. The ad was over soon.</p><br/><p>She flipped to other stations until she came across the advertisement again.</p><br/><p>She watched the advertisement three or four times in the same night before she made a decision.</p><br/><p>She called her assistant. \"Xiao Liu, it's me. Can you help me trace the model in the J clothing ad? You know how? Great! Call his agent and give him a chance to audition.\"</p><br/><p>Her assistant hung up. What a wonderful world! A green hand has been selected by a famous director relying solely on an advertisement. He hurried to find out which agency the lucky guy belonged to.</p><br/><p>Qin Guan had no idea about his luck. He was too busy answering calls from his parents and friends.</p><br/><p>Ever since the advertisement had been aired on TV, everyone, acquaintance or not, had started asking him various questions. The phone in his dormitory kept ringing all the time, which annoyed him to no end.</p><br/><p>The phone rang again. Qin Guan answered in an impatient tone, \"Hello! Who’s that?\"</p><br/><p>It was Cong Nianwei. \"Huh? What's the matter with you? I haven't called you in a long time. It’s okay though, I’ll hang up.\"</p><br/><p>\"No, no! I was just annoyed because strangers kept calling. I’ve missed you so much, darling!\"</p><br/><p>Cong Nianwei would rather hang up as soon as possible. It seemed that Qin Guan was fine. There was nothing to be worried about.</p><br/><p>Qin Guan told her proudly, \"Weiwei, I bought a new car! And my new house is ready. I’ll take you to see it someday. We can decide on the adjustments together!\"</p><br/><p>Cong Nianwei had found out about the house the previous year. She had felt strange when Qin Guan had showed off about it on his bicycle.</p><br/><p>Qin Guan couldn't fight the impulse to brag. \"Are you free tomorrow? I’ll come pick you up. We can choose the paint together. The floor is already ready, but I dared not decide on the color of the bedroom.\"</p><br/><p>Cong Nianwei was confused. \"Why? Isn’t it your house?\"</p><br/><p>\"I’m waiting for my wife. If she’s not satisfied with the color, then I’ll have to paint it again. It’d be too much trouble!\"</p><br/><p>\"Be serious! Come here early tomorrow. The decoration market is far away.\"</p><br/><p>As he hung up, Qin Guan felt glad. Cong Nianwei didn’t deny that she would be my wife!</p><br/><p>The next morning, Qin Guan's Cherokee roared under Cong Nianwei’s dormitory. She was surprised to see the SUV behind him from her window.</p><br/><p>Where is his bicycle? [1] I can’t believe this! Her roommates were practically salivating with jealousy.</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] In Chinese, both a car and a bicycle can be called \"Che\" for short.</p><br/>\n</div>"}