{"title": "Chapter 135: The Brand Endorsement Contract", "id": 135, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-135-the-brand-endorsement-contract", "volume_title": "Volume 2", "body": "<h1>Chapter 135: The Brand Endorsement Contract</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 135: The Brand Endorsement Contract</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>They exchanged a look with each other. That young man is so shrewd. The eldest one among them answered, \"It depends on your career choice. If you prefer a stable job, choose the former. After working hard for several years, you can become a senior accountant.\"</p><br/><p>\"If you want to start your own business though, you should choose the latter. It’s the most valuable certificate in China, but it's very difficult to get it. It may take you several years.\"</p><br/><p>Qin Guan didn't know what to say. Tutors at college didn't care about such things. In their opinion, after graduation their students would automatically know the regulations of the industry and would all choose the first road.</p><br/><p>Time would not wait for anyone though. Qin Guan was nearly in despair as he thought about the requirements for becoming an accountant. Whichever road he chose, there would be the same obstacles waiting for him. A two-year working experience in the industry with the premise of his diploma.</p><br/><p>The older woman across from him tried to comfort him, \"It all depends on your effort. Where there is will, there is a way. I have an idea, but it depends on your connections.\"</p><br/><p>Qin Guan cheered up and listened to her carefully.</p><br/><p>\"Get experience. You have to find a unit that will hire you as a part-time employee. That way you can gain experience while studying at college. Are you a sophomore?\"</p><br/><p>Qin Guan nodded. There’s still hope!</p><br/><p>\"Then you’re just in time! When you are familiar with the common skills of an accountant, you already have working experience. After you get your diploma, you can ask your unit to give you a certificate.\"</p><br/><p>\"There is more good news. You can apply for the certificate of a junior accountant, which will be helpful during your job hunt. The exam will be in May. There are still two months to go. Shall we apply to take that together?\"</p><br/><p>Was that your aim all along?</p><br/><p>Whatever, Qin Guan was convinced. \"Do your units want part-time accountants?\" he asked. Just asking, in case I could solve that problem right away.</p><br/><p>They all laughed and introduced themselves.</p><br/><p>\"Do you know why our units assigned us to take this exam? I’m from the XX grid. He is from the XX plant, she’s from the XX bank, and he works for the XX group. Companies like ours are filled with staff, so stop dreaming! You chose the wrong direction. You should focus on small private enterprises that are just starting to develop. It’s wasteful for them to employ full-time accountants. You can keep their books for them once a week and try to cut on their taxes. They will be glad to make a certificate for you.\"</p><br/><p>Qin Guan kept their suggestion in mind. It was the voice of experience speaking. As a college student, he was nearly blind to the reality of society.</p><br/><p>Actually, Qin Guan planned on reaching the top of the industrial pyramid, but his companions suggested that he open a business and expand overseas. That was a remote goal though.</p><br/><p>At their suggestion, Qin Guan decided to apply for the junior technical exams in May. They exchanged telephone numbers and returned to the examination room happily.</p><br/><p>In the afternoon, Qin Guan was more careful with his papers. As soon as the bell rang, he handed in his papers and went out.</p><br/><p>When he left the campus, he relaxed. The next day he would be taking the last and easiest exam. Then he would just wait for his score and certificate.</p><br/><p>He had no idea that he was being sold at the time. Sister Xue was negotiating with the boss of the J shirts.</p><br/><p>Actually, we should call him the boss of J Clothing Co. Ltd. With Qin Guan’s help that past year, he had extended his power.</p><br/><p>In half a year, he had expanded the scale of his business to 16 stores. On the stable foundation of the capital market, he distributed his products to the surrounding provinces and cities. He had three production lines, and his profits had increased several times. With rising confidence, he had began the production of a casual collection.</p><br/><p>His company was no longer engaging only in shirts. His aim was to become a comprehensive brand like BNL, which focused on clothing for young adults. According to industrial evaluation, his brand had reached B- level.</p><br/><p>Qin Guan, who had appeared in four of his posters, was considered his exclusive model. (Although Sister Xue might deny that.)</p><br/><p>On that day, the boss had come over to get Qin Guan's brand endorsement with his Advertising Department army. (He had already convinced the Advertisement Department!) Not long after the Spring Festival, he had opened stores on Xinjiekou, Xidan and Gongzhufen Street, in an effort to compete with brands like BL and MS.</p><br/><p>There was a thick pile of contracts in front of Sister Xue. Unlike the previous year, J clothing had prepared a TV advertisement, a brand T show, and posters and catalogues for Qin Guan.</p><br/><p>Sister Xue skipped to the payment terms, which were detailed and reasonable. According to the standards of a B-level model, there would be two to three shows in one year, and Qin Guan would get paid 6,000 yuan for each. The photoshoots would remain four a year, at the price of 5,000 yuan each, and the payment for brand endorsement would be 80,000 yuan for one year.</p><br/><p>After careful calculations, Sister Xue concluded that Qin Guan would earn 110,000 to 120,000 yuan as a brand ambassador for J clothing. It was a perfect contract without loopholes, leaving room for other opportunities for both of them.</p><br/><p>Sister Xue accepted the contract. She would ask Qin Guan to sign it. The boss smiled to himself for a long time on the leather seat of his car.</p><br/><p>He hadn’t told Sister Xue that his store in Xidan was in the same neighbourhood as LEE. When he’d visited that store, he had seen LEE’s poster right away. A giant poster of Qin Guan and an American model had been hanging in front of the store in the most crowded part of Xidan Plaza. It was easy for drivers and pedestrians coming from both directions of the busy street to see it.</p><br/>\n</div>"}