{"title": "Chapter 144: Taking Off The Costume", "id": 144, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-144-taking-off-the-costume", "volume_title": "Volume 2", "body": "<h1>Chapter 144: Taking Off The Costume</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 144: Taking Off The Costume</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan asked the two older actors, \"What did you think of my acting? Were there any shortcomings? Is there anything I should pay attention to?\"</p><br/><p>Gui Yalei and Chen Hong exchanged a glance. Respectfully, Chen Hong let Gui speak for both of them. Gui said, \"You should trust the director, young man. At the beginning, people will doubt you because you’re a green hand. After the first scene though, when you appear in full costume and makeup, they will accept the director's judgement and your own comprehension.\"</p><br/><p>\"An actor is someone who acts. Amateur actors can also be successful. Unlike professional drama school graduates, they possess a different kind of intelligence and other advantages. You should believe in yourself and act according to your own understanding. If there is something wrong, the director will remind you and explain.\"</p><br/><p>\"I wish all actors had your spirit. It’s better to follow the director's instructions. Keep up the good work. Cheers, young man!\"</p><br/><p>Qin Guan watched the two ladies walk away in shock. They gave so much advice to a nobody like me!</p><br/><p>Silly boy, there are not that many kind-hearted people in real life. It’s your potential and merit that narrowed the gap between you three.</p><br/><p>The effort one puts in their work is the only thing that can impress an actor and make them accept someone else.</p><br/><p>When they were far from Qin Guan, Chen couldn't help but tease Gui, \"Professor Gui Yalei, you are not usually this conversable with green hands.\"</p><br/><p>Smiling, Gui answered, \"Everyone likes a beauty. He’s surrounded by so many good-looking faces, yet he still stands out. He deserved every single one of my words.\"</p><br/><p>They smiled at each other knowingly. By then, Qin Guan had won the staff’s praise with his extraordinary embroidery skills and ancient formalities.</p><br/><p>The shooting went on as planned. In the second scene, Qin Guan would play alongside Zhao Wenxun.</p><br/><p>In the script, the queen had brought Zhang Changzong to Luoyang from a town in South China. Simple, young and naive, Zhang Changzong had admired his older brother, Zhang Yizhi, who had come to the capital for the imperial examinations.</p><br/><p>Thanks to the queen, he had earned a fortune for his brother, and the two poor men would be able to become noblemen in Chang’an city.</p><br/><p>Unfortunately, his brother had favored romance over knowledge. He had missed the examinations in order to meet a woman, making all his efforts go to waste. However, Zhang Changzong was still willing to support his brother. He gave him all him awards without hesitation, and Zhang Yizhi accepted them eagerly.</p><br/><p>Qin Guan's performance was quite natural, as if Zhao Wenxun was really his brother and the hope of the whole family. The director did not stop them at all, rendering all the crew members speechless.</p><br/><p>In fact, Qin Guan considered Zhao his father, a man he had to listen to.</p><br/><p>The two scenes were all Qin Guan had to do for the day, and he finished them both in advance. Li looked at her watch and waved at Qin Guan.</p><br/><p>\"How many lines did you recite?\"</p><br/><p>\"All of them!\"</p><br/><p>What? Although he’s a co-star, Zhang Changzong has lots of lines.</p><br/><p>\"The whole scene?\"</p><br/><p>\"Yes, all the script.\"</p><br/><p>\"Great! Let’s do one more scene!\"</p><br/><p>What? Qin Guan was confused. He tried to find Sister Xue in the crowd, but it was in vain.</p><br/><p>He had no choice but to nod. \"Okay!\"</p><br/><p>\"Then take off your costume!\" Li told him happily.</p><br/><p>Horrified, Qin Guan realized that in the following scene, he would be carried to the royal court as a tribute in only a white Confucian style garment.</p><br/><p>The picture formed in both his mind and the surrounding ladies’ minds.</p><br/><p>Qin Guan felt defeated. What a pure boy!</p><br/><p>He changed into a loose, thin white robe, and let his hair hang down. Only then did he realize that he had been cheated.</p><br/><p>He had forgotten that the shooting process had to be carefully arranged so there was no time wasted. If he was naked, or at least without underwear, they would wait till very late to shoot the same scene at night. It wasn’t necessary to change costumes.</p><br/><p>Also, to depict realistically the legend that the toy boy prayed for the queen without eating any food for three days, he hadn't even gotten a lunch box!</p><br/><p>Swallowing his saliva, Qin Guan watched the other actors, assistants and staff take their eight-yuan lunch one by one. Tears filled his eyes.</p><br/><p>The old man selling the lunch boxes felt sorry for the handsome boy, but all the boxes had been sold out. He dag in his pocket in the hopes of finding some kind of candy for the boy, who was staring at him with shining eyes, when Sister Xue pulled Qin Guan away.</p><br/><p>What a shame!</p><br/><p>As night fell, the giant palace was alight with candles. Qin Guan lay down feebly before three joss sticks as tribute.</p><br/><p>He was not even acting. He was really hungry and thirsty. He was put into the royal carriage by the queen, ennobled and swoon-worthy.</p><br/><p>Qin Guan didn't need to think about it. He finished the scene without stopping. Li Shaohong struck while the iron was still hot. She asked the costume master to pull off Qin Guan's front pieces. Qin Guan suddenly began to scream, \"What are you doing? This is hooliganism! Help! Director! Sister Xue!\"</p><br/><p>Sister Xue smacked him over the head with the script, reminding him that the next scene would be a medicinal bath. Qin Guan was too hungry to think, but his silly behavior helped him finish the next scene smoothly.</p><br/>\n</div>"}