{"title": "Chapter 141: Are You Serious?", "id": 141, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-141-are-you-serious", "volume_title": "Volume 2", "body": "<h1>Chapter 141: Are You Serious?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 141: Are You Serious?</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Li Shaohong needs a male supporting actor for her TV play. New Silk Road received an unexpected call from the crew, and then her assistant contacted me.\"</p><br/><p>Qin Guan answered calmly, \"So what? I’m a part-time model.\"</p><br/><p>\"The director likes your charm and appearance. She wants you to play Zhang Changzong.\"</p><br/><p>\"Who? Zhang Changzong? The most famous toy boy in history? No way! I wouldn't do that even if the national leaders asked me to! Are you serious? How could a handsome, strong young man like me play that woman-like Adonis?\"</p><br/><p>Before Qin Guan could finish his proud announcement, he felt a pain at his waist. Cong Nianwei pinched his flesh as she told him happily, \"Li Shaohong is my favorite female director. Do you know her work ‘This is Forty’?\"</p><br/><p>Qin Guan shook his head.</p><br/><p>\"What about ‘Pink’? Or ‘Red Western Clothes’?\"</p><br/><p>Qin Guan kept shaking his head. Cong Nianwei sighed and said, \"It seems like we have no common interests. You have to audition for the play to make up for it.\"</p><br/><p>This was ridiculous. How could Cong Nianwei's boyfriend reject her favorite director? He had to get the part, even if it was the villain!</p><br/><p>Sacrificing himself for their happy common future, Qin Guan agreed to go to the audition.</p><br/><p>As his agent, Sister Xue had gotten used to Qin Guan changing his mind often.</p><br/><p>She didn't return to reality until she set up an audition time with Li's assistant. Is that the way to entering the entertainment circle? It’d be wasteful for Qin Guan to become an actor though.</p><br/><p>She didn't spent too much time thinking about it. Qin Guan would be just a guest performer after all. No ordinary director would want a beginner like him.</p><br/><p>Qin Guan took Cong Nianwei back to college and returned to his own dormitory. As he lay in bed, he began to review his schedule for the semester. He wanted to make sure that the TV play wouldn't influence his courses.</p><br/><p>Then his thoughts returned to Cong Nianwei’s sweet, soft lips. Stop! I’d better go to sleep, or I’ll just keep suffering.</p><br/><p>Qin Guan fell asleep with a tent in his pants, praying to the goddess of mercy.</p><br/><p>The next day, when he got out of his car proudly, Sister Xue, who had been waiting for him outside the Capital Film Factory, twitched her lips. You are only an ordinary model, yet you seem prouder than a superstar.</p><br/><p>Several people around the entrance were trying to guess who Qin Guan was.</p><br/><p>When they went inside and found the giant studio for \"Daming Palace\", the two of them were shocked.</p><br/><p>It was the largest studio in Asia, and the crew had built a splendid set for the play.</p><br/><p>To truly recreate the grand palace of the Tang Dynasty, the crew had spent quite a large amount of money on the set and props.</p><br/><p>It was beyond their wildest imagination, and it made them re-evaluate the importance of the audition.</p><br/><p>Li Shaohong was drinking water in the waiting room when her assistant led Qin Guan in.</p><br/><p>She watched the beautiful young man walk towards her. He looked like an enchanter who had broken the laws of the imperial court and had been reborn.</p><br/><p>Cutting to the chase, she told the assistant, \"Bring the costume for Zhang Changzong's first scene.\"</p><br/><p>Before Qin Guan could sit down, the director turned to Sister Xue, \"Are you the boy's agent? We’ll discuss things further after he changes into the costume.\"</p><br/><p>A bossy woman carrying out tasks resolutely! Sister Xue sat down on the edge of a stool nervously. This is the first time I’m being ordered around by another woman! (Be honest, it’s not the first time.)</p><br/><p>When Qin Guan changed into his clothes and walked slowly up to them, they realized what \"Lotus-Like Childe\" really meant. His movements were like a wonderful unfolding painting.</p><br/><p>The loose, pure white gown hiked up in the wind, and the deep blue cloak set off Qin Guan's perfect figure.</p><br/><p>He was at the best time of his life. He was the resurrected \"sixth boy\". Li Shaohong was quite satisfied with him.</p><br/><p>She handed him the script. \"Is this your first time to act in a TV play? Just read the lines for me.\"</p><br/><p>Qin Guan opened the script and found his first scene, in which he had to cooperate with two older actresses, Chen Hong and Gui Yalei.</p><br/><p>Gui Yalei's first line was, \"I brought him from Luoyang. Don't you think he is as delicate and pretty as a lotus?\"</p><br/><p>Zhang Changzong had to depict a lotus on the screen by showing his back view to Chen Hong and Gui Yalei. Then he had to turn his head around shyly.</p><br/><p>Depict a lotus? Turn my head around shyly? What the hell is this even about? Qin Guan's hands were shaking. He glanced at his lines.</p><br/><p>In the script, Zhang had to turn and sit on the couch while Gui said, \"Would you like to have a good time with me today?\"</p><br/><p>A good time? What does that even mean? Is Zhang supposed to provide the good time?</p><br/><p>Speechlessly, Qin Guan showed the lines to Sister Xue, who covered her face. This is definitely not Qin Guan’s style.</p><br/><p>Qin Guan kept reading. It seemed like Zhang was an expert on embroidery. He didn't stop stitching from the moment he first appeared in the play, which reminded Qin Guan of a famous role in Jin Yong's novels [1].</p><br/><p>Then they reached the climax, when Empress Wu Zetian told her daughter, Peace Princess, \"Master Zhang made a lotus especially for you, to express my appreciation for your wisdom.\"</p><br/><p>It's so literal! A lotus painting for appreciation of her daughter's wisdom! With tears on his face, Qin Guan read his first line, \"Can you do stitch work, my princess?\"</p><br/><p>What the hell is this? Zhang sure behaves like a girl!</p><br/><p>Qin Guan finished his first scene quickly. What a shame! Do I even qualify? I have to hug Chen Hong! She’s a famous beauty!</p><br/><p>Sister Xue saw that he was about to do something silly, so she warned him in a low voice, \"Cheer up! Think about who sent you here!\"</p><br/><p>Qin Guan cheered up immediately when he recalled Cong Nianwei’s red lips. I can’t disappoint her. I have to do this!</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] It refers to Dongfang Bubai, a top martial artist who became a eunuch in his pursuit of higher martial arts. We will read about him in following chapters.</p><br/>\n</div>"}