{"title": "Chapter 140: Just Shut Up and Kiss Me!", "id": 140, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-140-just-shut-up-and-kiss-me", "volume_title": "Volume 2", "body": "<h1>Chapter 140: Just Shut Up and Kiss Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 140: Just Shut Up and Kiss Me!</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Cong Nianwei’s roommates’ boyfriends owned shabby bikes, while Qin Guan was driving a brand new car. Was Cong Nianwei also good at selecting a boyfriend?</p><br/><p>Feeling her roommates’ envy, Cong Nianwei sat down calmly beside Qin Guan. He drove them slowly to the west entrance of QH University.</p><br/><p>At the sight of them in the car, Chi Hailing started crying by the roadside. Is it even possible to be this rich before graduation? Who said that one could survive on their strength? He’s making a living on his looks! It’s so unfair!</p><br/><p>On the way, Qin Guan asked Cong Nianwei the question that was troubling him the most, \"What color shall we paint the wall of our bedroom? The floor is milk yellow. What do you think about green? It's said that it helps one sleep. Or what about white? It’s simple and easy to apply.\"</p><br/><p>Qin Guan read about the prices and the brushing process before asking calmly, \"Shall we go with white?\"</p><br/><p>Cong Nianwei burst into laughter. \"Okay, white!\" she agreed.</p><br/><p>The wife humored the husband, who was a penny pincher.</p><br/><p>Qin Guan carried the paint upstairs breathlessly. He felt upset that he hadn’t bought a house with an elevator.</p><br/><p>Cong Nianwei pinned her hair into a bun and put newspaper hats on both their heads. The interior of the house had been polished. Qin Guan touched the wall and found it smooth. They could paint directly on it.</p><br/><p>All the tools, including a roller brush, a hairy brush, a basin, newspapers and a wooden ladder, were ready. They began painting. Qin Guan was in charge of the large scope, while Cong Nianwei supervised all the details.</p><br/><p>They were perfect match, but Qin Guan got distracted by Cong Nianwei after a while.</p><br/><p>Standing on the high ladder, he looked down at his girlfriend. Her tiny nose and curled eyelash looked very elegant.</p><br/><p>He stopped moving unconsciously, and the paint on his brush landed on Cong's eyelashes. Fortunately, Cong Nianwei had her eyes closed at the time, or the paint would have landed in her eyes.</p><br/><p>Qin Guan got off the ladder immediately and asked Cong Nianwei to stand where she was and keep her eyes closed. Meanwhile, he ran to get a towel.</p><br/><p>When he came back with a clean towel, he found his girlfriend standing in the sunlight with closed eyes. On her cheeks there were drops of white paint.</p><br/><p>Qin Guan wiped them from her face gently. Before he could let out a sigh of relief, Cong Nianwei asked him, \"What about the paint? Don’t worry about me, it's not in my eyes.\"</p><br/><p>No one answered her. She thought Qin Guan was still feeling guilty about it, when suddenly his lips were on hers, blocking her words.</p><br/><p>There had been no warning, no advance decision. It just like the coming of love. Love didn’t ask why or when.</p><br/><p>After their first intimate contact, the young lovers felt like they had been hit by one of Cupid’s arrows. There were no flowers, no romantic atmosphere or promises.</p><br/><p>Qin Guan was unsatisfied with just kissing Cong Nianwei’s lips. If he kept calm then, he would be an idiot.</p><br/><p>He tried to insert his tongue into her mouth, but he was attacked fiercely. Don’t even dream of a French kiss! 19-year-old girls in 2000 weren’t so open-minded. His second try kind of succeeded.</p><br/><p>The revolution was not completely successful though. His comrades still needed to fight diligently.</p><br/><p>Qin Guan stuck his tongue out of his mouth like a dog. Cong Nianwei had bit him. Ouch! It hurts!</p><br/><p>Cong Nianwei burst into laughter.</p><br/><p>Qin Guan approached her with the towel, but she looked suspicious. You want to try again? I’m no fool!</p><br/><p>Qin Guan pointed at her nose and said sincerely, \"I’m not messing with you. There is paint on your nose. I want to clean it for you.\"</p><br/><p>Cong Nianwei touched her nose and nodded uncertainly.</p><br/><p>Qin Guan bent down and kissed her lips again. \"Ha, ha! I said I’d clean your nose, but I didn't say I wouldn’t kiss you again!\"</p><br/><p>Cong Nianwei’s face turned red. She started chasing after Qin Guan with the roller brush.</p><br/><p>\"You liar! Come here! I won't hit you!\"</p><br/><p>The warm spring was almost over. Did that mean that their love would be getting scorching hot?</p><br/><p>They ran around and fought until they were both out of breath and smiling. When they paused and intertwined their fingers, the phone rang, ruining the atmosphere.</p><br/><p>Qin Guan groaned helplessly. Cong Nianwei stared at him. He couldn’t help but answer the phone tamely.</p><br/><p>It was Sister Xue. She sounded slightly doubtful, yet also a little happy and hesitant, as she told Qin Guan about a call she had just gotten.</p><br/>\n</div>"}