{"title": "Chapter 150: Sunflowers", "id": 150, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-150-sunflowers", "volume_title": "Volume 2", "body": "<h1>Chapter 150: Sunflowers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 150: Sunflowers</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan thought it was a trap. With Zhang Yang as a director and Li Bingbing as the heroine, it had to be quite a good DV. But what the hell was it about?</p><br/><p>Zhang Yang saw Qin Guan's doubts and told him, \"Two Sung had originally asked me to make a short film for their DV contest. The script had been inspired by our chat. The investment was limited though, and I spent all of it on the DV camera. Du Haibing and Li Bingbing are my good friends, so they’re here just to have fun and get compensated for an uncompleted collaboration.\"</p><br/><p>\"Don’t look down on this opportunity. I had originally planned on inviting Xia Yu to be the lead, but Two Sung said you’d do it for free, so...\"</p><br/><p>Qin Guan had the impulse to shout \"Thanks\" at the great director. Forget it, I have already signed the contract.</p><br/><p>Before the shooting, Zhang Yang scanned Qin Guan from head to toe. Things did not look so good. The boy was too handsome. It would be unrealistic for him to chase after a flower-selling girl for that long.</p><br/><p>\"Do you have any casual clothes that are torn or out of fashion?\" he asked Qin Guan. Qin Guan nodded. He had plenty of them back at his dormitory.</p><br/><p>Satisfied, Zhang suggested taking some testing shots.</p><br/><p>Qin Guan agreed, and the first scene began. DV shooting was random, without background, lights, costumes or assistants. All they needed was a DV camera, a photographer, a director, and an actor.</p><br/><p>Carrying a cross-body bag, Qin Guan walked along Wangfujing Street. He opened the door of a store and turned over the \"Closed\" sign. Then he turned on his camera, faced the middle of the street, and put in a new film.</p><br/><p>He began to clean the store as a part of his routine. Another employee entered the store, and the boring day began.</p><br/><p>The first scene was finished in one take. They replayed the film, and there were no accidental departures from the frame or items blocking the shot. The scene was okay.</p><br/><p>Qin Guan was speechless. This was really a record of everyday life. All he had to do was ignore the camera.</p><br/><p>There were also some scenes that had to be recorded in the store. Just Qin Guan looking after the store, hear the chattering of the employee and replacing the film.</p><br/><p>It took them less than a morning to finish the first scene. They all looked at each other. This was his first try, but Zhang Yang was able to adapt to the situation.</p><br/><p>A film movie set had high light and background standards. That could be fixed, unless they had to shoot high-speed running or other kinds of movement that were as quick to shoot as walking. The first scene between the leading actors was about to begin. Li Bingbing felt dazzled by Qin Guan’s splendid smile.</p><br/><p>She’d had a conversation with him while they’d been working on \"Daming Palace\", but they hadn’t had the chance to be partners. Their tight schedule had prevented them from having too much contact.</p><br/><p>When she’d gone there to help her friend with the DV trial, she had not expected her partner to be Qin Guan.</p><br/><p>She had played in many dramas, yet this was the first time she’d met an actor who could surprise her with his looks.</p><br/><p>She was a veteran though, so she focused on the role.</p><br/><p>In 2000, she was in her prime time. Two twisted plaits were hanging down her shoulders, and she was wearing a skirt and holding a large bouquet of sunflowers in her arms.</p><br/><p>Qin Guan jumped down and walked up to her. With a curious and slightly amazed expression, he fixed his eyes on her, full of passion and love. She got distracted for a while, but she delivered her lines mechanically. \"Would you like some flowers?\"</p><br/><p>\"How much are they?\" asked the shy boy.</p><br/><p>\"Five yuan each.\"</p><br/><p>\"F*ck!\" Qin Guan answered instinctively. \"That’s too expensive! Can I get a discount?\"</p><br/><p>Everyone burst into laughter. Qin Guan tried to explain, \"It's true, it’s too expensive! You can buy flowers at the Dazhongsi Wholesale Market for 1.2 yuan each.\"</p><br/><p>Zhang Yang pointed at the street. \"But she’s selling flowers here! Everything here will cost more than at other places, even a piece of bean curd. Don’t use other peddlers as a point of reference.\"</p><br/><p>Qin Guan scratched his head and apologized sincerely, \"I’m sorry, I couldn’t control my mind. Let’s go again!\"</p><br/><p>He hadn’t wasted any film anyway. Zhang Yang waved his hands generously, and they repeated the scene.</p><br/><p>The next step would be the post-production. Qin Guan had to take some clothes for his exterior shooting with Li Bingbing. To save on the expenses, they shot the rest of the interior scenes at the house of one of the crew members.</p><br/><p>They had to be self-sufficient. It was a small room of only a few square metres, and there was nothing inside except for a computer, a shelf, and a bed.</p><br/><p>The property assistant made a bowl of instant off-brand noodles for Qin Guan. \"It’s been processed so there’s no product placement,\" the assistant explained when he saw Qin Guan’s doubtful expression.</p><br/><p>All Qin Guan heard was, \"Awful Noodles\". The man had to really hate instant noodles.</p><br/><p>The photographer and director wouldn't have done such a thing.</p><br/><p>They had lived on instant noodles during their poor days.</p><br/><p>Qin Guan's scene was simple. He had to watch the short DV introduction on a computer while eating noodles with a smile.</p><br/><p>He picked up some noodles with his chopsticks and began to act. Staring at the screen, he sucked the noodles into his mouth loudly. The noodles ended up hanging from the corner of his mouth.</p><br/><p>The director nodded in approval. Those eating manners fit the role perfectly. He had not expected Qin Guan to act like that, but he was an intelligent actor after all.</p><br/><p>Qin Guan’s expression changed frequently as he watched the video he’d taken during the day. He looked crazy, insulted, shocked. The girl he liked and had been buying flowers from every day had actually been the main culprit of the Wangfujing robbery!</p><br/><p>Startled, he stood up and kicked down his chair. Zhang Yang was really satisfied with Qin Guan and his wonderful sense of the camera. \"Cut!\" he sounded, thus signalling the end of their work that day.</p><br/><p>Before Qin Guan could even review the shooting process, the second day of work had begun.</p><br/><p>Qin Guan and Li Bingbing repeated the same series of scenes in different costumes. The story board indicated Qin Guan’s resolution to buy flowers regardless of the weather.</p><br/><p>The bouquet changed to roses. This was the only scene between Qin Guan and Li, and the only time they actually interacted with each other.</p><br/>\n</div>"}