{"title": "Chapter 157: Hierarch’s Secret Garden", "id": 157, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-157-hierarch%E2%80%99s-secret-garden", "volume_title": "Volume 2", "body": "<h1>Chapter 157: Hierarch’s Secret Garden</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 157: Hierarch’s Secret Garden</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan's appearance in full costume and makeup was more shocking in the small monitor than in real life. Wearing his high crown and loose gown, Qin Guan smiled before speaking. He was quite the domineering toy boy.</p><br/><p>His lines were perfect. No mistakes whatsoever!</p><br/><p>\"Cut! Stop!\" The first break was because of Ren Woxing. The older actor was really surprised by Qin Guan's ability to recite lines. He had failed to control his expression and frowned.</p><br/><p>Lv Xiaohe, the man who portrayed Ren Woxing, was a very capable actor. As a bold and straightforward man from Northeastern China, he looked down upon pretty boys. Qin Guan, who had joined them half-way through the shooting, had attracted the attention of all the girls on the crew as soon as he’d arrived.</p><br/><p>Teacher Lv thought Qin Guan was protected by some sponsor or director. He looks like a peacock, not an actor. Just read his record! Qin Guan felt misunderstood. It's not my fault I’m handsome.</p><br/><p>In his first scene, Qin Guan's lines were clear and his rhythm was perfect, not at all inferior compared to the other actors’. Lv Xiaohe was too surprised to control the muscles on his face.</p><br/><p>The first break was not Qin Guan's fault. Fortunately, the previous film had been reserved, and they could start over from the moment Elder Shangguan had tried to bribe Qin Guan. It was not such a big mistake.</p><br/><p>The figurants heaved a long breath and wiped the sweat off their heads. It was so hot! Taking the chance, Qin Guan lifted his arm up and wiped his face quickly. (The prop master shouted, \"Hey! Stop!\")</p><br/><p>Teacher Lv was left speechless by Qin Guan's action. His nature seems different than his appearance! He felt better for some reason.</p><br/><p>They went on. Yang Lianting was bribed into leading Linghu Chong and the others into the hall, where the most important scene would take place.</p><br/><p>Hundreds of figurants filled the hall. The air was stuffed with the heat and the moist smell of the cave.</p><br/><p>Director Zhang was irritated again. He shouted at everyone, \"Take responsibility for yourselves and finish it in one take! I’ll curse anyone who makes a mistake!\"</p><br/><p>To be honest, most directors were bad-tempered. They had to establish their prestige and take responsibility. A bad film was a derelict of duty, not only for them, but also for their whole crew. A director cursing was nothing out of the ordinary.</p><br/><p>Qin Guan had even more lines in the next scene. Because of the echo inside the cave, he had to deliver every word and sentence clearly in a loud voice. His speed had to be neither too fast, nor too slow. Everyone was worried about the green hand, but they witnessed a miracle.</p><br/><p>Qin Guan finished his monologue without stammering and answered his partner’s questions successfully. While he was speaking, he walked around the throne, gesturing in an imposing manner. He seemed like a behind-the-scenes master.</p><br/><p>According to the story, Yang had been attacked and broken one of his legs before he’d been caught by the rebels.</p><br/><p>Qin Guan didn't give up. He finished the five-minute vigorous scene with a painful expression.</p><br/><p>In the scene, the hero and heroine had only a few lines, while Qin Guan had to make a long speech. They both looked at their young co-star with new eyes.</p><br/><p>Qin Guan couldn't tell them that he was gifted, but he enjoyed the special treatment of the senior actors. The mountains in Zhejiang were harsh but graceful, just like a painting.</p><br/><p>In midsummer, the flowers were blooming. The palace of Dongfang had cost a lot. The camera followed them, mounting the peak. Dongfang Bubai was hiding in the luxurious garden, so they could only hear his voice.</p><br/><p>Feeling the crowd approaching, Dongfang became slightly angry. He grumbled to his lover in a flirtish manner, \"I won't see anybody except you!\"</p><br/><p>Qin Guan’s leg hurt. With the green leaves as background, handsome Yang delivered the most sincere and shocking words between two lovers, \"If I refuse to bring them here, they’ll kill me. I won’t die without seeing you for the last time.\" The camera zoomed in on his devoted expression.</p><br/><p>The love between two evil characters could also be pure and true. Everyone suddenly felt guilty for forcing Dongfang.</p><br/><p>At his words, Dongfang drew himself up to his full height, surprising everyone.</p><br/><p>Teacher Mao's appearance in full makeup was unparalleled. Her gestures and expression were domineering, charming, and fierce.</p><br/><p>She covered Qin Guan gently with a blanket (50 degrees, three-layers of costume, and a woollen blanket). Qin Guan felt dizzy from the heat. The camera turned to the others, who were taking pleasure in his misfortune. No one was showing any signs of solidarity or friendship.</p><br/><p>The camera turned around as Dongfang spoke.</p><br/><p>\"Are you hurting?\" He took Yang's hand, expressing tenderness and love through his eyes. Meanwhile, he took a handkerchief from his sleeve and scrubbed the sweat off Qin Guan’s forehead.</p><br/><p>Qin Guan pushed him away aggressively, just like a violent man would his wife. He exploded without any reason, \"What are you thinking about? All your enemies are here! Why are you fussing like a woman? Kill them, and then we’ll have time to care for each other!\"</p><br/><p>Director Zhang took a big close-up of Qin Guan's face. With his handsome face and vigour, Qin Guan seemed quite aggressive even against the No. 1 leader among the martial arts circles.</p><br/><p>It was his honor to have such a handsome man as his lover.</p><br/><p>Dongfang was not angry. He actually liked his attitude. He nodded at Yang shyly, but became really fierce when he turned around to face his enemies.</p><br/><p>His long dress was dancing in the air along with the falling petals. Dongfang took an elegant leap and fell down together with flowers. The silk threads landed after him.</p><br/><p>Dongfang picked up his beloved Lian and flew into the flowers. The beauties and the flowers complimented each other.</p><br/><p>The scene was finished. When Director Zhang sat before the running camera, everyone fell silent. It was a really good effect.</p><br/><p>Their fair skin and slender hands were interlocked. Qin Guan leant against the throne, just like the real king of the kingdom.</p><br/><p>Director Zhang waved at the actors, indicating that they could go on. Dongfang waved his long red sleeves and took an attractive pose. Several lines of speech broke the silence. The fight was about to start.</p><br/><p>Lying on the throne, Qin Guan watched them with envy. Yang’s leg was broken. He could do nothing but show his concern for his lover during the battle.</p><br/><p>Why was Director Zhang still zooming in on Yang's face then? That was a foul! It was a bias towards his fellow townsman!</p><br/><p>Actually, Dongfang's close-ups were far more than Qin Guan’s, but they were tragic in a lot of ways.</p><br/>\n</div>"}