{"title": "Chapter 168: In the Bandits’ Nest", "id": 168, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-168-in-the-bandits%E2%80%99-nest", "volume_title": "Volume 2", "body": "<h1>Chapter 168: In the Bandits’ Nest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 168: In the Bandits’ Nest</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>There were four large characters written in fresh paint on the sign. They read \"Amazing Foot Massage Room\".</p><br/><p>Qin Guan watched the bustle awkwardly. \"New business?\"</p><br/><p>\"No, it’s been here for half a year. My bros said the place was too difficult for customers to find though, so I made a showy sign.\"</p><br/><p>Looking at the dazzling characters, Qin Guan said carefully, \"Could we change the name? How about ‘Amazing Pedicure’?\"</p><br/><p>Wang Hailing turned the name over in his mind. It sure sounds better! Educated guys are really intelligent! \"Change the sign! Make it ‘Amazing Pedicure’!\" he shouted at the labor workers.</p><br/><p>Then he waved dramatically to a group of people nearby. Three of them walked over.</p><br/><p>\"This guy is the manager of the foot massage room, that one manages the hair-washing room, and the third one is in charge of the mahjong room.\" He pushed Qin Guan towards them as he introduced them. \"This is the accountant of our company. Greet each other!\"</p><br/><p>\"When did we found a company, Brother Wang?\"</p><br/><p>\"Just now. Stop that rubbish! Listen to me. You will hand over the accounts to Accountant Qin. Every week he will come over to check the records. Understand?\"</p><br/><p>\"No problem! We'd appreciate your help, Accountant Qin!\" They all greeted Qin Guan before walking away.</p><br/><p>Qin Guan was speechless. \"It’s only three businesses?\" he asked.</p><br/><p>Are you kidding? You rely on those three guys to keep the books? They’d stick the money in the drawer in no time. Keeping books would be no more than handing in the profits on the weekend. And if there’s any extra expenses, they’d just get the bosses to approve of them. Qin Guan couldn't do much, even if he laid groundwork as a cashier.</p><br/><p>\"Of course not! That'd be just a piece of cake for us. Come here! Open your eyes!\"</p><br/><p>Bu and Wang led Qin Guan towards a six-storey building across the street. There was a giant neon sign on top of it. Qin Guan went nearly blind as he saw the \"Fruit &amp; Candy\" sign.</p><br/><p>What a crazy world! The huge KTV club, which had been famous for decades in the capital, was their business?</p><br/><p>Qin Guan was shocked by the news.</p><br/><p>Confused and disoriented, he followed Bu and Wang. They pushed the glass revolving door and entered the clean reception hall.</p><br/><p>There were luxurious leather couches, Spanish style glass tea tables, and French spiral staircases. There were also three elevators on both sides of the hall for the laziest customers.</p><br/><p>On the fifth floor, there were completely enclosed stores. Half of the space on the third floor was occupied by supermarkets and restaurants, and there were private smaller stores on the second floor. The whole club promoted humanity and comfort.</p><br/><p>Of course, you could also get entertainment services there. The girls behind the bar counter on the third floor were happy to sing a song for generous guests or have a drink with them.</p><br/><p>Bu Qinlu looked satisfied with Qin Guan's expression. He seemed like a peasant in a metropolis. Every visitor was shocked by the huge club and its unreliable owners.</p><br/><p>On the cashier desk on the second floor, Qin Guan checked their cashier system and the scale of the supermarket. The software was quite advanced and could be logged in to the internet easily.</p><br/><p>Qin Guan was stunned by the pile of account books in their office though. Is the computer on the desk just for decoration? Are the report forms in the software just for amusement? Has that notebook with lines of twisted characters been your account book for the past several months?</p><br/><p>The two men’s daily book-keeping was as follows.</p><br/><p>Date: XXXXX</p><br/><p>Earnings: XXXX yuan</p><br/><p>Expenses: XXXXX yuan</p><br/><p>That was all.</p><br/><p>Qin Guan massaged his head before asking, \"How much have you invested in the club?\"</p><br/><p>\"No idea. Our bros gathered the money and we borrowed some more from others.\"</p><br/><p>Qin Guan continued to massage his hurting temples. \"I need all the documents and details of the investment, or I’ll have no idea when you’ll get your capital back! If you can cope with the Industrial and Commercial Bureau and the Tax Administration Office with such a notebook, your duty will be to copy it in the same way. As for me, I’ll make a detailed account in the simplest and clearest manner. You aso need to grant me a large sum of money so I can create the account.\"</p><br/><p>\"Of course, I’ll give you an allowance every month. Better keep the invoices for me when you make purchases outside though.\"</p><br/><p>\"That’s it for today. I have to read the notebook. We’ll discuss the details in the future.\"</p><br/><p>\"You must know that the club still can’t make ends meet. You have to be careful with what you spend.\"</p><br/><p>\"What? We’re losing money?\" Wang shouted. \"Ever since we opened the business, profits have been pouring in from all sides. Every night the stores are full of customers. How can we be losing money? \"</p><br/><p>Qin Guan was speechless. Your business was founded with borrowed money. You are in debt!</p><br/><p>Bu was cleverer than Wang though. He poked at Wang’s back before telling Qin Guan, \"We’re not familiar with such affairs. You just make the accounts gradually. You’ll come here once a week. We’ll be in charge of public relations, and you’ll focus on the book-keeping. 450 yuan a week. We’ll be counting on you.\"</p><br/><p>Qin Guan returned to his dormitory with a large bag of paperwork. Those two cheaters! They were flattering me. I caused trouble to myself!</p><br/><p>That’s when Qin Guan’s miserable days began.</p><br/><p>\"No, no, no! The accounts of those three small shops can’t be in the general ledger!\"</p><br/><p>\"Brother Bu, why is the girls’ income recorded separately? Fine, tell me how you divided the accounts then! According to your interests? Are you kidding? Are large boobs your only interest? Large butts are no reason to make an exception either!\"</p><br/><p>\"Okay, Lily has a big butt. Her salary will be on your account!\"</p><br/><p>\"Why would you put that in my account? Okay, okay!\"</p><br/><p>\"Shall we deposit the profits in the bank? In a safe? What the hell is that?\"</p><br/>\n</div>"}