{"title": "Chapter 179: Feelings Need a Foundation", "id": 179, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-179-feelings-need-a-foundation", "volume_title": "Volume 2", "body": "<h1>Chapter 179: Feelings Need a Foundation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 179: Feelings Need a Foundation</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>What? The messy Dongnei area? Is he kidding? Actually, we don't have any houses there.</p><br/><p>Qin Guan knew what he was thinking about.</p><br/><p>To suppress his doubts, he added in his most elegant and imposing manner, \"I know your rules. Your company will deduct from the customers, and your bonus will be influenced. My business is bigger than you can imagine though.\"</p><br/><p>Qin Guan crossed his legs gracefully and supported his hands on his knees. He lay back against the couch and threw a bomb at the young man.</p><br/><p>\"According to the current prices of the area, it would cost 3,500 to 4,000 yuan per square meter. Most of the houses there are low buildings, 30 to 50 square meters each. That would be about 100,000 to 200,000 yuan per house. You can get only five per thousand as a bonus. Of course you’d look down upon such a small amount. I have a lot of money though. If you can find me houses in that area…\"</p><br/><p>Qin Guan drew a circle on the map.</p><br/><p>\"I’ll buy them all!\"</p><br/><p>\"What?\" The young man pulled his chair towards the table and picked up the map. He glanced at it, his hands trembling as if he was having a stroke.</p><br/><p>\"Really? Don’t mess with me, bro!\" He was excited enough to speak in his hometown accent.</p><br/><p>\"I’m not lying. Call me when you have two or three. If you can find enough for me, I’ll give you a bonus myself.\"</p><br/><p>The young man was so excited that he was already planning on pasting advertisements around the area. If there was no information on the database, he would look for houses himself. He was familiar with the neighborhood committee.</p><br/><p>After leaving the warm young man, Qin Guan let out a long sigh.</p><br/><p>The advantage of entrusting the agent was his professional integrity. He wouldn’t ask any questions about why he was purchasing those houses.</p><br/><p>It would be a good choice for the residents to sell their houses to him. They’d have to wait a long time before moving otherwise. If they could buy another house in a taller building with that sum, they wouldn't suffer any losses.</p><br/><p>Qin Guan considered himself a kind man. Of course, he hoped the residents would not regret this after a couple of years.</p><br/><p>Qin Guan didn’t stop. He headed to Legation Street to purchase more houses. The properties on sale there would not increase in value though.</p><br/><p>The history of Legation Street could be dated back to the establishment of the capital of the Ming Dynasty. It was actually the largest business street of that dynasty. Businessmen came together in crowds in that flourishing area.</p><br/><p>During the Qin Dynasty, the Ministry of Employment, the National Academy, and the Supervisorate of Imperial Instruction had all been located there. Some princes, dukes and ministers had also built their mansions there, such as the Su Mansion, the Zhenguo Duke Mansion, the Grand Secretary Mansion, and so on.</p><br/><p>In the 1990s, the street had been recognized as a historical area by the government. Residents could sell or rent their houses out, but it was impossible for them to get a fortune by moving. Qin Guan bought those houses for sentimental reasons. He had always loved that street very much, both in that life and his past one.</p><br/><p>Before the foundation of PRC, the street had been called the Legation Quarter. After 1900, 11 states had built embassies there, and the street had become a leased territory.</p><br/><p>The page was turned over after 1949, when the foreign military camps and banks were gone. There were many tall buildings built then. The changes on that street represented the changes of several eras. Legation Street had witnessed all history.</p><br/><p>The value of the street was not just historical, but also artistic. The area was beautiful, with towering ancient trees. Compared to the sheds at Dongnei, the houses there were like royalty. Most of them were quadrangle dwellings compete in all aspects.</p><br/><p>The first real estate agent Qin Guan visited had the property he wanted.</p><br/><p>He was aware of the shortcomings of quadrangle dwellings.</p><br/><p>Unlike purchasing a house in a tall building, the structure of a quadrangle dwelling deserved particular care.</p><br/><p>Quadrangle dwellings had a yard surrounded by houses. A rich or big family could build two quadrangle dwellings, connected from front to back. High-ranking officials or rich businessmen could build three or four quadrangle dwellings linked together, with flowers planted between them for decoration.</p><br/><p>A small quadrangle dwelling could be composed by 13 rooms, while larger ones had 30 chambers. If there was another quadrangle dwelling joined together, there had to be around 25 to 40 rooms.</p><br/><p>None of this was important though. Frankly, no one bought a quadrangle dwelling for its living area, but for the floor space. It was a big trick.</p><br/><p>Qin Guan had lived in a small quadrangle dwelling of 13 rooms, with a living area of more than 200 square metres. The floor space was about 400 square meters though.</p><br/><p>The price was 20,000 per square metre, which was far more than Qin Guan could afford.</p><br/><p>The agent did not see Qin Guan as a potential customer at first, and Qin Guan's expression confirmed his impression.</p><br/><p>Qin Guan went out, feeling like weeping. It was a starry night. The revolution was not yet successful. The comrades still had to work hard.</p><br/><p>Qin Guan watched the busy Chang’an street, falling into deep thought. After a few years, the sum in my account will not be enough for me to afford even a small apartment here. How will I talk about feelings then?</p><br/><p>Determined, Qin Guan rushed to the set of \"Graceful Princess\".</p><br/><p>Sister Xue met him there and found the assistant director, who was in charge of the casting. They were let in.</p><br/><p>The show was a period drama narrating a story during the North Song Dynasty (960-1127). Qin Guan auditioned for a supporting role.</p><br/>\n</div>"}