{"title": "Chapter 184: The Human Rights of a Tortoise", "id": 184, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-184-the-human-rights-of-a-tortoise", "volume_title": "Volume 2", "body": "<h1>Chapter 184: The Human Rights of a Tortoise</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: The Human Rights of a Tortoise</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan retreated to his dormitory. He picked up a pen and wrote six graceful characters on the bucket, \"Niulanshan Erguotou\" [1].</p><br/><p>Then he threw the pen to Liu Xiaoyang, ready to fool the inspectors with his acting skills.</p><br/><p>The pen hit Liu on the forehead, leaving a large dot there. Dear Qin Guan, you are only pretending to be calm. You are actually frightened. You forgot to put the cap on the pen.</p><br/><p>As Qin Guan was approaching the inspectors, he whispered to himself, \"Keep calm! You’re a brave boy!\"</p><br/><p>His legs were not trembling.</p><br/><p>As he was about to brush past them, a girl in the inspection group asked, \"Senior Qin, is that you?\"</p><br/><p>The question attracted the tutors’ attention. She was staring at the bucket. This looks like alcohol!</p><br/><p>\"What's this?\"</p><br/><p>Qin Guan looked at her with his most innocent expression. \"It’s for the crew. I’m a green hand, so I have to get close to them.\"</p><br/><p>Liar! You ran away like a rabbit after the shooting. It's your agent who kept flattering the crew shamelessly.</p><br/><p>Unexpectedly, the strict tutor was convinced. Qin Guan is having a hard time. He even has to pay for the alcohol!</p><br/><p>Wang Lei, who was hiding behind the door and observing the situation, was laughing at their IQ. If we knew they were such idiots, we wouldn’t have sent Qin Guan to deal with them.</p><br/><p>Qin Guan left, and the group entered their dormitory. Wang Lei realized that their IQ had returned to normal.</p><br/><p>It was unfair. Wang Lei let out a long sigh in front of the tutor and the students. This was Qin Guan's home court after all.</p><br/><p>Qin Guan got to the studio and put on his costume. Everyone patted him on the shoulder, expressing their sympathy.</p><br/><p>Qin Guan fastened the turtle shell around his body and lay down before the gate of Prince Yan’s mansion.</p><br/><p>He tried to copy Xu Zheng's acting method. Putting his poker face on, he recited his lines in a flattering tone, \"Your humble servant was a blind bastard. My senses were fooled. I was a crazy dog that bit its own master by accident...\"</p><br/><p>He started kowtowing. \"Your Highness shouldn't fuss about a humble servant like me. Forgive me, Your Highness!\"</p><br/><p>What a slug! The actor who portrayed Zhu Di couldn't help but start laughing before Qin Guan could finish his lines.</p><br/><p>All the onlookers burst into laughter, as if a water drop had fallen into a hot frying pan.</p><br/><p>Hey, show some sympathy, guys! That was a heavy costume!</p><br/><p>The director suppressed his smile before warning them, \"Stop! Stop! You are wasting our money!\"</p><br/><p>Everyone kept laughing secretly.</p><br/><p>In the next scene, Qin Guan had to fix his eyes on Zhu Di, who was sneering at the kneeling Gao Fuming.</p><br/><p>\"Your tears are flowing fast!\"</p><br/><p>Of course, I’m a poor tortoise! Qin Guan recited his funny lines, \"Your Highness, it's not tears, it’s the blood of your humble servant.\"</p><br/><p>F*ck! You’re smirking, Zhu Di!</p><br/><p>\"My heart is bleeding whenever I think of my evil deeds. I see Your Highness’ kind face and my heart breaks...\"</p><br/><p>Stop smiling, or you’ll start laughing! Out of sight, out of mind. Qin Guan lay down on the ground again.</p><br/><p>You did it, Qin Guan. If he’d looked at your face, he would have started laughing again!</p><br/><p>After that scene, Qin Guan could rest for a few days. As a social elite though, he was still really busy. He had to work on his courses, study for the TOEFL, and shuttle between the two filming studios.</p><br/><p>In half a month, his cheeks had become concave.</p><br/><p>Nah, It's just you. You just missed a few meals.</p><br/><p>Qin Guan finished working on the shows. He died twice and he would die two more times. He had been playing villains in all four plays after all! He lay on the steering wheel feebly, trying to weep, but failing to shed a tear.</p><br/><p>Only delicious food could comfort him.</p><br/><p>He was not far from Xiaochang Chen, so he decided to have a bowl of boiled pork giblets with baked wheaten paste.</p><br/><p>No giblet-lover could say no to that. Originating from the Guanxu period of the Qing Dynasty (1644-1912) in the southern part of the capital, that dish had quickly conquered the country.</p><br/><p>During that era, people living in the southern part of the city and engaging in physical work had replaced the pork in their broths with pork heads and giblets. After being processed by cooks, the dish had evolved into boiled pork giblets.</p><br/><p>At Xiaochang Chen's restaurant, the chef boiled chitterlings, lungs, bean curd, blood curd and marinade together. After adding garlic juice, fermented bean curd and caraway, the thick soup got soft and tender. If the customer also bought some white-water sheepshead from Li's restaurant right next door, they’d enjoy the most perfect feast on the Earth.</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] A kind of famous but cheap spirit in Beijing.</p><br/>\n</div>"}