{"title": "Chapter 182: Several Slaps on the Face", "id": 182, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-182-several-slaps-on-the-face", "volume_title": "Volume 2", "body": "<h1>Chapter 182: Several Slaps on the Face</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 182: Several Slaps on the Face</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan stopped laughing abruptly and took a deep breath. Ah! I feel pain in my chest!</p><br/><p>\"Camera!\" Qin Guan's face was still twisted in pain. Taking advantage of it, he began acting.</p><br/><p>He looked up with a cold expression. The slightly twisted muscles on his face showed the sinister nature of the commander of the imperial guard.</p><br/><p>It was the only thing that was effortless. His demeanor changed the atmosphere from funny to tense though.</p><br/><p>His expression along with his black uniform made the crew feel afraid. They were all shocked by Qin Guan's acting skills. That young man has a great future ahead of him.</p><br/><p>When that scene was over, the crew ran around to prepare for the next one. Meanwhile, Qin Guan was shouting inwardly. Someone help me! My chest hurts!</p><br/><p>As soon as he recovered, the next scene began. Gao Fuming was having a discussion with his subordinates in the prison. He was planning on hiring an assassin for Zhu Di, the Prince of Yan.</p><br/><p>Qin Guan was in his black gown with the golden embroidery. His tassels were hanging down from his hat, reaching his temples. His handsome, cold face was visible under the candlelight, setting off his aggressiveness and charm.</p><br/><p>He looked like a hero, an aggressive villain high on the hierarchy of an evil sect, someone called Xuanyuan Aotian or Qiankun Wudi [1].</p><br/><p>Qin Guan was surrounded by the imperial guards in their red uniforms. He waved his sword around, shouting, \"Break the gate!\" His imposing manner had reached its peak.</p><br/><p>He stepped into the mansion valiantly as his soldiers caught Consort Shu and her female servant.</p><br/><p>Consort Shu was really a good actress. She was the funniest one in the show. Qin Guan was very happy to work with her.</p><br/><p>In that scene, Gao Fuming was supposed to smack the servant. Even though she was a brainless woman with big boobs, Consort Shu slapped Qin Guan right back. Suddenly, Gao Fuming noticed seven port-wine marks on her palm, which meant that she was his real master. He was so stunned that he forgot to get out of the way and he was hit on the face again.</p><br/><p>According to the director's instructions, Qin Guan had to get slapped for real, not use some kind of dodging trick. The actress who played Consort Shu couldn't bear to hit his handsome face though. Qin Guan encouraged her, \"It’s nothing. I know how to ease the pain. Just hit me, I can handle it!\"</p><br/><p>Gritting her teeth, the actress slapped Qin Guan on the face. \"Ah! The director didn't say ‘camera’!\"</p><br/><p>\"Sorry! Sorry!\" The actress got even more nervous.</p><br/><p>\"Three, two, camera!\"</p><br/><p>Clap!</p><br/><p>\"Cut! Show your palm to the camera, or the audience won't see the marks clearly!\"</p><br/><p>Clap!</p><br/><p>\"Qin Guan, turn your head this way. You must look handsome!\"</p><br/><p>Bro, I’m only a supporting actor!</p><br/><p>Clap! Clap! Clap!</p><br/><p>After seven or eight slaps, the director called, \"Good!\"</p><br/><p>In the next scene, Gao Fuming asked for another slap to see the marks more clearly.</p><br/><p>Qin Guan nearly burst into tears. Miraculously, the scene was finished in one take, as the director was more worried about the scene between Gao Fuming and the Prince of Yan the next day.</p><br/><p>Qin Guan went out of the studio exhausted. He put an ice pack on his red face and complained to Sister Xue, \"What a stingy crew! They want to finish three days worth of work in one day!\"</p><br/><p>Sister Xue was speechless. Still, you make more money in a short time!</p><br/><p>Covering his bloated cheek, Qin Guan was shocked by the scene he faced in his dormitory. There were lanterns, colorful ribbons, and paper flowers everywhere, as if there was some kind of important festival.</p><br/><p>Confused, Qin Guan walked in his own room. His roommates were boiling instant noodles calmly on a small stove.</p><br/><p>Li Jie was the cook, and Mu Lejiang was his assistant. There were also sausages and spiced corned eggs on the table.</p><br/><p>Qin Guan sat down on his bed and said, \"Good idea! Where did you get the stove?\"</p><br/><p>\"From the tool store.\"</p><br/><p>\"Why are you making instant noodles again? Are you out of money? I could lend you some.\" Qin Guan patted his own fat chest proudly.</p><br/><p>\"No, thanks. We’d have to pay you back.\"</p><br/><p>Qin Guan didn’t try to persuade them. He squatted down shamelessly and watched the noodles in the boiling water. \"Can I have some?\"</p><br/><p>You have so many bills in your pocket and you want to share those poor men’s noodles?</p><br/><p>Who cares? I’m hungry!</p><br/><p>After the satisfying feast, they lay down on their beds and fought for fun. There were still celebratory activities going on in the corridors. It was late at night, yet Ye Dong hadn't come back yet.</p><br/><p>\"What happened? It's like a Spring Festival outside.\"</p><br/><p>Mu Lejiang murmured, \"Ye Dong mentioned something about it. Our bid for the 2008 Olympics won. It must be a formal celebration. Ye Dong organized it.\"</p><br/><p>\"It has nothing to do with us. Let’s just sleep.\"</p><br/><p>The tough guys fell asleep amid the noise of gongs and drums. Something’s wrong! Qin Guan sniffled unconsciously in his sleep. I can smell smoke.</p><br/><p>He jumped out of bed and knocked on the iron pipes fiercely, shouting to the others, \"Get up! Get up! Fire!\"</p><br/><p>His voice had barely faded away, when screams were heard in the corridor.</p><br/><p>\"A f*cking fire!\"</p><br/><p>\"Run!\"</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] Common names for powerful heroes in web novels.</p><br/>\n</div>"}