{"title": "Chapter 194: Drinking the Strongest Liquor and Marrying the Most Beautiful Woman", "id": 194, "volume": 2, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-194-drinking-the-strongest-liquor-and-marrying-the-most-beautiful-woman", "volume_title": "Volume 2", "body": "<h1>Chapter 194: Drinking the Strongest Liquor and Marrying the Most Beautiful Woman</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 194: Drinking the Strongest Liquor and Marrying the Most Beautiful Woman</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Stunned, Qin Guan walked towards the door. He nearly stumbled on the threshold. Quivering, he replied, \"No, thank you.\"</p><br/><p>Then he disappeared like the wind.</p><br/><p>Li Qian was amused by his escape. Such a pure guy is rare in the entertainment circle. I should protect him from the hungry wolves.</p><br/><p>During their last scene, Li Qian was completely calm. She even cast a reassuring glance at Qin Guan.</p><br/><p>Qin Guan secretly wiped cold sweat from his forehead. What the hell is this? There are thistles and thorns everywhere in the circle. Fortunately, I’m strong enough to protect myself. Others might have lost control and been seduced by her.</p><br/><p>His roommates lost their interest in the next scene. Qin Guan was having a secret affair with another actress. It’s so boring! Men, women, romance, adultery... It’s nothing new. Is there anything even remotely original? Definitely! Surprising plot twists were everywhere. Pingr found her son, who had been lost for a long time, and escaped with a fortune before Jia Lian could find out.</p><br/><p>Qin Guan was desperate when he heard the news. He looked up at the sky and laughed. \"Wang Xifeng, why am I doomed? Why did the gods destroy my family?\"</p><br/><p>As a fan of the original work, Mu remained silent. He was wearing earplugs and covering his eyes so he wouldn’t do anything reckless.</p><br/><p>After several scenes, the boys lost all interest in the shooting. It was getting hotter and hotter in the room, and they felt hungry and bored.</p><br/><p>When the director announced the end of the shooting for that day, they turned their heads towards Qin Guan.</p><br/><p>Qin Guan paid no attention to them. Instead, he said farewell to the director. All his scenes had been finished. Fortunately, his character didn't die in the play, which was definitely an advantage.</p><br/><p>The group of actresses gathered around him.</p><br/><p>\"Are you leaving, Qin Guan? Why didn't you say goodbye to us?\"</p><br/><p>\"I’ll miss you, Brother Qin. Will you have a cup of tea with me sometime?\"</p><br/><p>\"Hey! You are old enough to be his mother! How dare you call him brother?\"</p><br/><p>\"What are you saying? I’m only 18! You’re just jealous of me, bitch!\"</p><br/><p>\"That’s ridiculous! You look like 50!\"</p><br/><p>\"What are you saying, bitch?\"</p><br/><p>\"I’ll kill you!\"</p><br/><p>They began to fight. The director looked around and made sure the set and props would be safe. Then he went to drink his tea, pretending to see nothing.</p><br/><p>The prop crew was the most anxious. Several strong men separated the women. Taking advantage of the chaos, Qin Guan sneaked away with his roommates.</p><br/><p>Sister Xue felt ashamed on his behalf, but she had to stay with Huang Bo till the afternoon.</p><br/><p>Qin Guan and his roommates escaped from the film studio. As soon as they squeezed into the car, they burst into wild laughter.</p><br/><p>Liu Xiaoyang showed his photos to everyone proudly. Qin Guan was being pulled and pushed by girls in the pictures. After several failed attempts, he had to sign an agreement. He would cook for his roommates during the entire summer and treat the six hungry wolves on the way back.</p><br/><p>What was the best food for a hot summer day? A foodie would go for vegetarian food.</p><br/><p>Naturally, they thought of Zhenglongzhai, a cake shop with an 100-year history. There was a restaurant not far from Guangji Temple, for the convenience of monks and believers.</p><br/><p>It was a small restaurant crowded by pilgrims.</p><br/><p>It also had a small window for take-away. Products such as baked wheaten cakes, sweet fritters, walnut cakes and polished glutinous rice had a special Beijing flavor.</p><br/><p>After a feast without meat and oil, they left in satisfaction. They had also bought some take-away cakes. It seemed that they would order dessert from that place for the whole holidays.</p><br/><p>They returned to Qin Guan's house and drank beer while sitting on the couch. Soon, they started making plans for the summer.</p><br/><p>Ye Dong and Mu Lejiang would do some volunteering work organized by the municipal government. They would work under the sun for eight to ten hours a day, helping tourists in the busiest sightseeing areas.</p><br/><p>Qin Guan expressed his sincere admiration of them and their pursuit of power. Li Jie would follow Li Xiaoyang and attend his potential tutor’s lessons. To be frank, he would use all available resources to carve a path for passing the exams for postgraduate admission.</p><br/><p>Wang Lei had a clear aim. The company he had been working for for three years had become a comprehensive company engaging in public relations and consulting. At the beginning, he had just been a claims man. Gradually though, he had been promoted to director and become in charge of all affairs related to part-time jobs, including recruitment, arrangement, cooperation and negotiation with affiliated companies.</p><br/><p>Qin Guan was wondering if a gifted student from the Accounting Department could maintain his original goals after graduation. Wang Lei had succeeded in some aspects though.</p><br/><p>Of course, Qin Guan considered himself the most successful and happy guy among them. As the saying went, a man had to drink the strongest liquor and marry the most beautiful woman.</p><br/>\n</div>"}