{"title": "Chapter 203: A Handsome Boy and a Fortunate Girl", "id": 203, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-203-a-handsome-boy-and-a-fortunate-girl", "volume_title": "Volume 3", "body": "<h1>Chapter 203: A Handsome Boy and a Fortunate Girl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 203: A Handsome Boy and a Fortunate Girl</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan smiled awkwardly, disguising his guilt. \"Gifts are always welcome. I thought you’d like it, so I kept it.\"</p><br/><p>Cong Nianwei smiled and put the cosmetics away before lying down on Qin Guan's chest again.</p><br/><p>Then she asked in a low voice, \"Is it my birthday present? It’s much more expensive than the belt I got you.\"</p><br/><p>Qin Guan hugged her and replied guiltily, \"Of course not. I wouldn't trick my wife.\"</p><br/><p>\"Hey, who is your wife? Is it really not my birthday present?\"</p><br/><p>\"Don't mention it. Just kiss me! There’s nobody here.\"</p><br/><p>A keen girlfriend was hard to deal with.</p><br/><p>\"Okay, but then you’ll take me back to college. I’m too busy to stay with you today. You can make your own arrangements.\"</p><br/><p>\"Okay, I’ll pick you up on your birthday.\"</p><br/><p>\"Deal!\"</p><br/><p>They exchanged sweet words as his wicked friends tried to eavesdrop on them.</p><br/><p>\"You guys are supposed to be clever! Who said that we could hear them through a glass on the door?\"</p><br/><p>\"Ye Dong, what are you doing? You shouldn’t stand on someone else’s shoulders, even if you’re the oldest one! I’m too thin to carry you!\"</p><br/><p>\"Hush! Silence! They’re quiet. They must be up to something!\"</p><br/><p>While they were competing for the vantage point, a voice suddenly rang out above their heads, \"I wonder what I’m up to!\"</p><br/><p>They all looked up in embarrassment and scattered quickly, trying to look calm. \"Nothing, nothing. It's really hot today.\"</p><br/><p>Cong Nianwei cast a supercilious look at Qin Guan, who was carrying her large bag on his back. While she wasn’t paying attention, he picked her up too, shouting, \"The Queen is leaving!\"</p><br/><p>Cong Nianwei screamed. Before she knew what was happening, she was carried away by her unreliable boyfriend.</p><br/><p>As her screams faded away, Liu Xiaoyang's heart was still fluttering in fear. He poked his head out of the door, shrinking back.</p><br/><p>He wiped imaginary sweat off his head and told the others, \"As a single man, I don't envy Qin Guan at all.\"</p><br/><p>Mu and Ye exchanged a glance before answering together, \"Don’t be afraid of girls. Our girlfriends are very gentle.\"</p><br/><p>Liu tried to defend himself, \"I’m a heterosexual.\" The problem was that Cong Nianwei reminded him of a carnivore animal. People felt inferior to her in terms of power, IQ and survival skills. It was not a pleasant experience.</p><br/><p>\"You couldn’t date a woman more powerful than you?\"</p><br/><p>\"Right, that’s it. Qin Guan is her perfect match though!\"</p><br/><p>\"A handsome boy and a fortunate girl?\"</p><br/><p>\"You have a point! Ha ha ha!\"</p><br/><p>The guys had suffered defeat at Cong Nianwei’s hands, yet they were making fun of Qin Guan.</p><br/><p>Qin Guan had no idea about it. He was on the way to Cong Nianwei's college at the time. Amid that intense summer heat, even the air conditioner couldn’t comfort him. That day, the first issue of VOGUE Asia would be released.</p><br/><p>As a famous fashion magazine, its first issue would attract plenty of readers.</p><br/><p>...</p><br/><p>It was early in the morning, and the sun hadn't risen yet. Thick mist was still around. Several old men had gone for a walk in the park with their birds, hanging their beloved mynas on the most suitable twisted trees. An ordinary, quiet morning was of great significance to VOGUE.</p><br/><p>Several directors of the urban district had conducted workers to carry the magazines in their own trucks. The magazines were newly published and wrapped in elegant packages. Qin Guan's black-and-white photo was on the cover.</p><br/><p>They had received the first orders from VOGUE’s Distributing Department, which covered ten provincial capitals of the developed area.</p><br/><p>According to the information on the chief editor’s hands, the total sum of the orders was only half as much as that of ELLE clothing.</p><br/><p>As one of the most popular fashion magazines, its domestic average sales volume was 17,700 copies, including some second-tier cities.</p><br/><p>The chief editor glanced at the elegant watch on her wrist. It was 5:30 a.m. The carriers were busy working under the tall buildings like ants.</p><br/><p>The trucks had been unleashed in the capital, heading for the newspaper stands. The new magazine, which beared countless people’s dreams, would finally debut with the readers.</p><br/><p>Qu Xuemei didn't turn her head around until all the distributing trucks had left. Then she asked her assistant, \"We have 80,000 copies of the first issue. How many does the capital get?\"</p><br/><p>\"20,000.\"</p><br/><p>\"How about the entire printing volume?\"</p><br/><p>\"200,000 in total. We’ve sent 80,000 all over the country. 120,000 copies are still in stock. According to our tentative analysis, we will run out of stock in a week. The sales volume should be 58% of ELLE clothing’s volume.\"</p><br/><p>Qu Xuemei frowned. The assistant hurried to explain, \"Chief editor, the estimated results are pretty good. ELLE clothing is more than one year ahead of us. They have spread to more than 30 cities. We should be patient. The stock is enough for us.\"</p><br/><p>Qu Xuemei picked up the magazine from the table. The transparent, elegant plastic package made a sound when her nails scratched it.</p><br/><p>He light pink finger stopped on Qin Guan's lips. She gently pointed at his sexy lips and smiled. \"Maybe we should be greedier.\"</p><br/><p>\"Everything will be clear tomorrow.\"</p><br/><p>Qu Xuemei put her finger on her own lips and clucked.</p><br/>\n</div>"}