{"title": "Chapter 218: My New Awesome Friend", "id": 218, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-218-my-new-awesome-friend", "volume_title": "Volume 3", "body": "<h1>Chapter 218: My New Awesome Friend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 218: My New Awesome Friend</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Sister Xue coughed awkwardly and suddenly pointed to the front with a quivering finger.</p><br/><p>Qin Guan craned his neck from the back seat and saw Shao help Fang open her Mini Cooper. Shao sat in the driver’s seat.</p><br/><p>\"How did they get together? Qin Guan, are you having an affair with her?\"</p><br/><p>\"What are you talking about? Do you think I’m that kind of guy?\" Qin Guan pretended to be angry.</p><br/><p>Embarrassed, Sister Xue exhaled a cloud of smoke. \"I thought she wanted to take advantage of you, like those actresses. I had no idea. That sister is really open-minded. She’s from a foreign country. This is so romantic!\"</p><br/><p>Qin Guan smiled helplessly. Open-minded is an understatement. The truth would shock the audience. Fortunately, my heart is taken, or the outcome might have been different.</p><br/><p>Neon lights were shining in the dark night. It was so late that even the moon had fallen asleep. Qin Guan crept up to his dormitory, hung his suit on a hanger and lay down on his bed.</p><br/><p>There was a distinct difference between the noisy party and his roommates’ snores. Qin Guan tried to recall some important information. Did I have the snow beef tonight? That’s terrible! The mad cow disease will break out in Japan in a few days! Then what? I’m so sleepy. I should just sleep.</p><br/><p>Another note was added to the dormitory snoring concert. This was the nature of ordinary life. The simpler, the better. His girlfriend would never laugh at him for his moderate aspirations.</p><br/><p>Qin Guan didn’t tell Cong Nianwei about the incident at the party. Most men had their secrets, and they kept them for self-protection or because they were ashamed.</p><br/><p>Hand in hand, they arrived at the training centre in the Handian District, which had been recommended by Cong Nianwei’s tutor.</p><br/><p>In the following days, they’d have to take the TOEFL, GRE or GMAT exam and apply to American universities with their scores.</p><br/><p>Time was pressing. Cong Nianwei had no time to waste.</p><br/><p>Both of them were good at English. What they needed was just some training before the exams.</p><br/><p>As the last ones to get there, they stood out among the group of students dreaming to go abroad.</p><br/><p>As soon as Qin Guan entered the classroom, he noticed that the students were divided into two groups.</p><br/><p>The tutor was not there, so all the students looked at the two freshmen. The leaders of each group waved at them. \"Sit here!\"</p><br/><p>Silence prevailed.</p><br/><p>\"Hey, those are hillbillies over there. Steer clear of them, or they’ll break your fragile hearts!\" said the student on the left side, who was wearing a fashionable outfit with golden chains.</p><br/><p>The student on the right side seemed more serious. He sneered at them, saying, \"Look at their binder covers and shirts before you decide. Even money couldn't compensate for their low IQ!\"</p><br/><p>Qin Guan and Cong Nianwei looked down and saw the logos of their universities on their shirts and binder covers.</p><br/><p>The student on the left raised his middle finger towards the student on the right. \"You are a just peasant! Students of famous universities are different from each other. Look at the boy's Polo shirt and pants. Would a f*cking poor student be able to afford that?\"</p><br/><p>Smiling, Qin Guan and Cong Nianwei exchanged a glance with each other before walking to the middle of the two groups, where two calm guys were seating.</p><br/><p>They were writing swiftly without looking up. \"Rich kids are on the left side and poor students relying on scholarships are on the right.\"</p><br/><p>Qin Guan pulled up the chairs in front of them and sat down. \"We are neither.\"</p><br/><p>The two students raised their heads to size them up.</p><br/><p>\"No wonder you didn't choose a side then. Are you going to study performance or art overseas?\" the handsome guy asked Qin Guan.</p><br/><p>The other guy stared at Cong Nianwei and said, \"Maybe he’s a rich second generation heir going abroad for his girlfriend. Let’s not invade their privacy.\"</p><br/><p>Cong Nianwei smiled and offered her hand. \"Hello, I’m Cong Nianwei. This is my boyfriend Qin Guan. We’ll be applying to different departments in the same university in the US. New York, as expected.\"</p><br/><p>The gentle student insisted on his viewpoint, \"You are from QH. Judging by your age, you have only two options: Columbia or New York University. As for your boyfriend...\"</p><br/><p>Qin Guan didn’t feel offended. \"My goal is MBA at Columbia.\"</p><br/><p>The student was shocked. He sized them up again and shook hands with them. \"He Ming. And this is Guan Jian.\"</p><br/><p>The four of them shook hands with each other. The two group leaders coughed unnaturally, but remained silent.</p><br/><p>The tutor entered the classroom and the lesson began. Cong Nianwei listened to him carefully, but Qin Guan felt that the lesson was too simple. His gifted memory was the best tool for learning vocabulary.</p><br/><p>Cong Nianwei was jealous of Qin Guan's confidence. She was good at professional studies, but Qin Guan was talented in characters and language.</p><br/><p>He Ming was doubtful of Qin Guan. As an international student, who had travelled all over the world with his parents, he dared not look down upon the GRE. How could that handsome guy be so confident?</p><br/><p>The GRE full mark was 1,600, but Qin Guan was sure that he would get at least 1,100 points. TOEFL focused on speaking, listening, reading and writing. Ivy League universities set high standards for that exam.</p><br/><p>Qin Guan began to yawn impatiently. He had originally thought there would be some kind of secret to success. Could I skip some classes?</p><br/><p>The annoyed tutor counted the 99th yawn of the striking freshman. Pretending nothing had happened, he announced they would be taking a 15-minute break.</p><br/><p>As soon as the tutor went out with his teaching material, Qin Guan became the center of the room. In 2001, most students would choose the US as their destination, as the country was famous for its money, freedom and dreams.</p><br/><p>Some fashionable girls gathered around Qin Guan, attracted by his looks. Cong Nianwei’s sour look didn’t stop them.</p><br/><p>\"Hey, I know you! You are VOGUE’s cover boy!\"</p><br/><p>\"He’s a model? But he’s Zhang Changzhong, the toy boy from ‘Daming Palace’!\"</p><br/><p>The brave girls wanted to push Cong Nianwei away and take the seat beside Qin Guan. Qin Guan stood up to protect Cong Nianwei.</p><br/><p>\"He is so tall! And he has such a nice figure!\"</p><br/><p>\"Yes, he deserves to be a model! Take a photo with me!\"</p><br/><p>The girl tried to lean on Qin Guan's chest.</p><br/><p>The leaders of the two groups were watching them happily. Qin Guan patted his desk, making everyone fall silent.</p><br/><p>Then he pointed at Cong Nianwei and said, \"This is my girlfriend. We are preparing to go abroad, just like you are. I hope we can all enjoy a good studying environment.\"</p><br/><p>Guan Jian, who was sitting behind Qin Guan, kicked the spare desk beside him and said, \"Lan Jin and Cui Jun, control your groups. They are too noisy.\"</p><br/><p>The atmosphere was getting charged. Lan Jin, a red-haired boy, waved at the girls, indicating that they should keep a distance from the two demons.</p><br/><p>The girls from Cui Jun's group, who had originally been watching silently, took this chance to walk away.</p><br/><p>Qin Guan looked at Guan in appreciation. Guan grinned and said honestly, \"Don't thank me. I was also annoyed.\" Then he buried his face in a book and fell asleep.</p><br/><p>He Ming smiled and glanced at both sides. The two leaders bent their heads unconsciously.</p><br/><p>Nothing else happened. It seemed that Qin Guan and Cong Nianwei had been accepted by He and Guan. No one dared speak to them on their own initiative.</p><br/><p>Guan didn't show his face until the class was over. When he stood up, Qin Guan realized he was even taller than him.</p><br/><p>Compared to him, He Ming looked much more preppy. They parted ways in the parking lot. One of them got in a military car with a plate number \"A\" [1], and the other got in an embassy car [2]. They drove away, leaving smoke behind them.</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] It means his parents were top military officers.</p><br/><p>[2] It means he had a family of diplomats.</p><br/>\n</div>"}