{"title": "Chapter 212: Girls", "id": 212, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-212-girls", "volume_title": "Volume 3", "body": "<h1>Chapter 212: Girls</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 212: Girls</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Shocked by Qin Guan's words, Wenwen cast a miraculous glance at him that enchanted Li Jie. He felt dizzy and numb.</p><br/><p>Sister Wenwen sneered, scrunching up her nose, \"Interesting! Don’t be afraid. We just want a taste of a luxurious dish.\"</p><br/><p>Qin Guan’s face tensed up in response to Wenwen. Suddenly, Wang Lei started laughing loudly, losing his self-control.</p><br/><p>Wenwen was not in the mood to talk nonsense with Qin Guan. She raised her eyebrow at Li Jie, who was drooling with envy by the door. \"You have to satisfy the girls if you want to leave safely. If you escape and influence their mood for work, I will come after you!\" she said.</p><br/><p>\"Okay, okay, as you wish. Our room is 3066. We’ll be there!\" Before Qin Guan could speak, Li Jie had betrayed him. He was crazy about that sophisticated lady.</p><br/><p>Wang Lei was laughing like a madman, while Li Jie had fixed his eyes on Wenwen's breasts. Qin Guan pulled them back to their room gloomily after paying for the beer.</p><br/><p>\"Where were you?\" Ye Dong opened a bottle of beer, staring at the screen.</p><br/><p>Qin Guan spread his hands open speechlessly. Wang Lei rolled around on the leather couch. \"Ha ha! The girls at the club love Qin Guan! They are lining up to see him!\"</p><br/><p>Suddenly, the door was pushed open and several girls entered, pulling and pushing each other.</p><br/><p>\"Who are you? This is our private room. We didn’t ask for room service!\" Liu Xiaoyang stared at them. Laughing, the girls cast several charming glances at the boy and went around him. They sat on the couch next to Qin Guan.</p><br/><p>\"I got here first, go away!\"</p><br/><p>\"You go away, or I’ll sit on your legs!\"</p><br/><p>The girls, who used to be close to each other, began to fight. Wang Lei laughed even louder. He was almost out of breath.</p><br/><p>Qin Guan felt awkward. \"Why aren’t you on duty?\" he asked. \"It’s peak time for guest flow.\"</p><br/><p>\"What's the hurry? We have to get ready before work. Some people get a refreshment, and some choose alcohol. We prefer to see you. We’ll have an energetic day afterwards.\"</p><br/><p>\"Don't look down on us. We bought ELLE and VOGUE especially for you!\" The two chief editors would have been glad to hear that.</p><br/><p>Qin Guan resigned himself to his destiny. He sat up straight and sighed. \"Come on!\"</p><br/><p>\"Ha ha!\" The girls stretched their hands towards Qin Guan.</p><br/><p>Several girls held Qin Guan's face between their fingers. They pulled at his flesh before loosening their grip. \"So elastic! Wonderful!\"</p><br/><p>One of them pinched his shoulder with a smile. \"So strong. Just as I imagined…\"</p><br/><p>Finishing their words, the girls threw their long hair back, shook their firm butts and swayed their fair legs, walking out of the room leisurely. They didn’t forget to blow the boys a kiss.</p><br/><p>\"We are the Kitty Group. Call us, boys!\"</p><br/><p>Witnessing the whole thing, Wang Lei climbed up from the couch. He found it rather hard to swallow. \"What's going on? Was that all?\"</p><br/><p>Qin Guan massaged his stiff cheeks before replying, \"What did you want to see? I kept hiding from them because they kept asking me about my skincare routine. They all like to touch my face. I only use ordinary facial cleanser and soap, but they didn't believe me and insisted on pinching my cheeks!\"</p><br/><p>Words couldn’t express Wang's feelings. \"A handsome guy like you in such an environment... They don't have any other desires? Impossible! I thought they would caress you from head to toe and do something after we left.\"</p><br/><p>The beer in Qin Guan's mouth was sprayed on Wang's head.</p><br/><p>\"Wonderful story, bro! You think my looks make me that lucky?\"</p><br/><p>Wang calmly wiped the beer off with a towel. \"Why are you always spraying things out? It’s like Wenwen said. You nourish their minds.\"</p><br/><p>\"That’s just for fun. Those girls are practical. They prefer other customers, because they get tips. Romance? Are you kidding?\"</p><br/><p>Li Jie immediately argued, \"You’re wrong. Every girl is thirsty for love. They are all the same. They deserve sincere emotions.\"</p><br/><p>Qin Guan nodded repeatedly. \"Right! I like your idea. I’ll help you with girls, so long as you don’t fall in love with Wenwen.\"</p><br/><p>Before Li Jie could contradict him, the door was pushed open again. \"Brother Qin, Sister Wenwen has something to tell you.\" Some unfamiliar girls had appeared at the door.</p><br/><p>Qin Guan answered, \"The match will begin soon. Ask her to wait until it’s over.\"</p><br/><p>The girls were disappointed. They looked at Qin Guan's cheeks, reluctant to part from him. Then they left, closing the door behind them.</p><br/><p>\"The first half of the match is about to begin. We are now in Muscat, where the temperature is just right for the game...\"</p><br/><p>Liu Xiaoyang, who was always anxious to see the world in disorder, turned off the microphone and sat back on the couch, watching the TV. \"Why don’t you go?\" he asked Qin Guan. \"What if it’s an emergency?\"</p><br/>\n</div>"}