{"title": "Chapter 219: Weirdos Are Everywhere", "id": 219, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-219-weirdos-are-everywhere", "volume_title": "Volume 3", "body": "<h1>Chapter 219: Weirdos Are Everywhere</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 219: Weirdos Are Everywhere</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan and Cong Nianwei exchanged a glance and shrugged. It seemed that they’d made two extraordinary friends.</p><br/><p>Qin Guan was about to open the car door when he saw red hair poking out behind the rearview mirror.</p><br/><p>He shouted, \"Lan Jin, come out! What are you doing?\"</p><br/><p>Lan Jin came out, looking embarrassed. \"I wanted to check your plate. I was just curious.\"</p><br/><p>Qin Guan looked at his plate. It was CXXXX [1], nothing special. Lan Jin looked around him. \"I thought I could discover your identity from your plate. Those two guys are showing off with their plates.\"</p><br/><p>\"You are swimming in deep waters, Qin Guan. With your simple plate and common car, you seem like a typical Taoist. Don't worry, I won’t say a thing! Where do you live? At No. 10 Yard or at Western Hill? Yuquang Hill? Diaoyutai? Zhongnanhai?\" [2]</p><br/><p>Cong Nianwei burst into laughter. Qin Guan sniffled before replying, \"I live on the Loess Plateau, where the strong winds blow [3]. Forget it, I’m no one important. Don’t think too much.\"</p><br/><p>Lan Jin scratched his head uncertainly, scanning Qin Guan from head to toe, \"You could belong to a noble family from ancient times! Your surname is not Kong though. [4]\"</p><br/><p>Qin Guan was amused. That boy was really funny. He patted him on the shoulder and said, \"You’re thinking too much. We’re just ordinary students. We’re studying here to go abroad.\"</p><br/><p>Lan Jin smiled. Dazed, he replied, \"I believe you. I believe you. But who can I believe in anyway?\"</p><br/><p>Cong Nianwei covered her face. Qin Guan decided to use his mass destruction weapon, his beauty. That poor boy was brought under control at last.</p><br/><p>Lan Jin looked around and reminded Qin Guan in a low voice, \"You don’t need to worry about anything if those two accept you. I admire them for everything except their financial status. By the way, which country are you going to?\"</p><br/><p>\"The USA.\" Qin Guan and Cong Nianwei found him funny. It was interesting to talk with him.</p><br/><p>\"Aha! Destiny has tied us together. I also chose the USA. The consultant told me that I would definitely get accepted. I’m studying here only for the score.\"</p><br/><p>\"Which university did the consultant recommend for you?\" Cong Nianwei asked.</p><br/><p>\"One in New York.\"</p><br/><p>\"New York University?\" Qin Guan and Cong Nianwei asked in one voice.</p><br/><p>\"More or less. There’s two more characters though. It’s New York City College. Isn’t it awful? It belongs to the city government!\"</p><br/><p>Cong Nianwei failed to answer him. Qin Guan was shameless and quick-witted though. \"Yes, how awful! We may be in the same city. We should help each other. It’s our destiny!\"</p><br/><p>Lan Jin clapped Qin Guan on the back and promised, \"Abroad or not, we’ll become good friends. Tell me if you have any difficulties.\" Then he pressed his key to unlock his car.</p><br/><p>Not far away, the headlights of a Ferrari sports car flashed.</p><br/><p>Lan Jin left, looking back at them repeatedly and murmuring to himself, \"F*ck! How can his Polo shirt look so good? The spring collection my father bought me looked really ugly on me. I have to talk with him later.\"</p><br/><p>The sports car roared to life and drove away. Qin Guan gestured for Cong Nianwei to get in the car. By then, another guy had run out towards him.</p><br/><p>\"What the f*ck...\" Qin Guan had gotten scared. He fixed his eyes on the guy. \"Cun Jun? Why are you here?\"</p><br/><p>Cui Jun smoothed his hair meticulously and told Qin Guan seriously, \"I have to warn you, Qin Guan. You are dangerous now.\"</p><br/><p>Looking around nervously, Cun Jun went on, \"You two have yielded to power and money. You could had been accepted by our group of talented students with your high IQ and educational background. Why are you hanging around with Lan Jin and He Ming?\"</p><br/><p>Qin Guan laughed. \"You’re too suspicious, Cun Jun. We make friends for pleasure. Why do you insist on the different groups?\"</p><br/><p>\"To be honest, those guys will embarrass Chinese people in foreign countries. They will pay rubbish universities for a diploma. We are different. We apply to the best universities and aim for scholarships. We symbolize the honor of our country.\"</p><br/><p>Qin Guan shook his head. Cong Nianwei seemed impatient with the crazy boy. They both got in the car. \"Tens of years ago, you would have been considered a traitor. Keep your word on the US campus.\"</p><br/><p>\"And which famous university did you choose?\"</p><br/><p>\"Columbia, New York, Princeton... All of them. I’ll pick the best one depending on their offers.\"</p><br/><p>You are that much of a genius that you’ll get to select one of the top 10 Ivy League universities? Qin Guan sneered and closed the door with a bang.</p><br/><p>Smoke was blown into Cun's face while he was still complaining in the void, dark parking lot. \"Hey! That’s so impolite! We are classmates! You could have at least offered to give me a ride!\"</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] The most common plate number for cars registered in Beijing.</p><br/><p>[2] The places where the most important political leaders in China live.</p><br/><p>[3] A famous folk song in the 1980’s. Qin Guan is making a joke here.</p><br/><p>[4] He’s referring to the family of Confucius, the noblest family in China thousands of years ago.</p><br/>\n</div>"}