{"title": "Chapter 216: The Mystery Woman", "id": 216, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-216-the-mystery-woman", "volume_title": "Volume 3", "body": "<h1>Chapter 216: The Mystery Woman</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 216: The Mystery Woman</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan was holding a round glass, a light yellow liquid bubbling inside it.</p><br/><p>He was standing by the window, the dazzling light in the hall casting shadows around him.</p><br/><p>\"I didn’t think you’d attend a business party,\" Shao said from behind him.</p><br/><p>Qin Guan didn’t look back, but he left some space by the window for Shao. A pair of shining black leather shoes came into his line of sight. A bottle of champagne was placed on the sill.</p><br/><p>\"Do you know who they are?\" Shao took a sip of champagne.</p><br/><p>Qin Guan shook his head. He turned around, following Shao's finger. They watched everyone make toasts, greet each other, kiss and dance in the hall, leaving the twinkling neon lights behind them.</p><br/><p>\"20 percent of them are directors and senior executives of the top 10 4A companies, and 60 percent are ad and PR representatives of big brands. The rest are related media.\"</p><br/><p>\"The party attracted nearly everyone in the advertising market in North China. Small-scale models were dying for an invitation.\"</p><br/><p>Shao turned his head to Qin Guan's right. Qin Guan looked there and saw a model smiling and talking with a senior executive of an advertising company.</p><br/><p>If his memory served right, it had to be one of the top 10 contestants of the New Face Competition.</p><br/><p>At another table, a female model with an excellent figure and face was proposing a toast to the bosses.</p><br/><p>Qin Guan saw the PR representatives of Liuyanghe and Lanqin among the crowd. There were also senior executives of brands famous for their taste and style, such as Citizen and Hermes, who were looking around indifferently.</p><br/><p>Shao opened the champagne and filled his glass again.</p><br/><p>\"Are you content with yourself, Qin Guan? You and me are qualified enough to stand next to them without flattering them. Do you know why?\"</p><br/><p>\"It’s because of our value. We could bring a fortune to them, unlike those models who are begging for their mercy. We could make them money!\"</p><br/><p>\"How do you feel? You are flattered by others. Your boss shows off with you to people. We enjoy the same treatment as superstars. It’s an honor, you should be proud! Ha ha!\"</p><br/><p>Shao choked on his champagne. Qin Guan took the bottle and poured the liquid in his own glass. He had nothing to say to his insane rival.</p><br/><p>Shao grinned. He looked up with unparalleled elegance shining in his neutral expression. \"I’m not drunk. I’ve never been this sober before. One day, I’ll be at the top, where no one has ever been, you or anyone else. Everyone here will worship me, without exception.\"</p><br/><p>Qin Guan raised his head to finish the rest of his wine. He pointed to Shao's agent not far away before setting the glass down on the window sill.</p><br/><p>A drop of champagne was flowing down along its bottom, sad at being abandoned by him.</p><br/><p>Qin Guan didn’t leave the party in advance, as that would have been impolite. He found a quiet place to rest instead.</p><br/><p>With a professional smile, the staff of the club led Qin Guan to a side corridor behind the hall.</p><br/><p>After taking a turn, they reached a secret garden.</p><br/><p>The simple, unsophisticated gate was opened leisurely, revealing a private room with a wooden floor.</p><br/><p>The staff member retreated and bowed. \"At your service. I hope you like it. 10 minutes before the party ends, I’ll come to get you.\"</p><br/><p>Qin Guan nodded in satisfaction and put his hands in his pockets, only to realize that he had no cash in his new suit.</p><br/><p>Bending forward, the staff member said sincerely, \"Unlike other clubs, you don’t need to pay a tip here.\"</p><br/><p>Qin Guan smiled awkwardly and walked into the elegant room. He took off his shoes and put them in the shoe cabinet in the corner, stepping on the slightly cool wooden floor.</p><br/><p>The staff member closed the gate behind him carefully.</p><br/><p>There was a sanders table, a simple, unsophisticated tea table and a dateless ancient Chinese zither in the room, which was filled with a coiling incense smoke.</p><br/><p>Qin Guan walked to the tea table and picked up a jar of scented tea from a well-arranged line of jars. Sitting before the tea table, he decided to make a cup of tea.</p><br/><p>On the noisy, depressing night of the party, he enjoyed some peace in that room.</p><br/><p>The jasmine was blooming in the hot water, dancing along with the tea leaves. What a wonderful time he was having there!</p><br/><p>Qin Guan hang his suit jacket up on the clothing rack and loosened his cuffs and bowtie, ready to enjoy his tea.</p><br/><p>The gate was suddenly pushed open with a bang, and a slightly drunk lady walked in, swaying while holding a cup of red wine.</p><br/><p>Before Qin Guan could speak, the beautiful woman shook her index finger at him in a naughty way and made a silencing gesture against her lips.</p><br/><p>She threw her high heels away and stepped on the wooden floor with bare feet. \"Ouch! My silk stockings are torn!\"</p><br/><p>She looked at a small hole on the sole of her foot nonchalantly.</p><br/><p>Qin Guan looked at the smooth, mirror-like floor and muttered to himself, \"Could you find a more believable excuse?\"</p><br/><p>As he came back to reality, the woman pulled at a corner of her red skirt, intending to take off the silk stockings on the spot.</p><br/><p>Qin Guan coughed awkwardly, reminding her that there was a man present.</p><br/><p>The woman did not give a damn. She pulled at her skirt with one hand and waved Qin Guan over with the other. \"Come help me, Qin Guan!\"</p><br/><p>Qin Guan was stunned to hear his own name. \"You know me?\"</p><br/>\n</div>"}