{"title": "Chapter 211: A Gaffer Named Wenwen", "id": 211, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-211-a-gaffer-named-wenwen", "volume_title": "Volume 3", "body": "<h1>Chapter 211: A Gaffer Named Wenwen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 211: A Gaffer Named Wenwen</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The bean curd jelly was steaming in the marmite. The marinade made of mutton chops, dried mushrooms, soybean sauce and starch, as well as the slightly parched sesame baked roll, made it extremely delicious.</p><br/><p>Qin Guan scooped up a block of bean curd jelly, and poured a spoonful of sauce and some capsicol on it. Then he stuck it in his mouth. It was so good!</p><br/><p>While he was eating, he recited an ancient poem about bean curd jelly. Sister Xue and Huang Bo watched him with a horrified expression, sesame seeds dropping from their mouths.</p><br/><p>Was he sad about those directors? Did he think he would never appear on the large screen?</p><br/><p>Don’t get discouraged. Indie films might not be for you, but there’s always commercial films.</p><br/><p>If Qin Guan hadn’t been planning on going abroad, Sister Xue would have taken him to Hong Kong to act in commercial films.</p><br/><p>\"What are you doing, Qin Guan? Why are you reciting poems? Are you okay?\" Huang Bo asked him kindly.</p><br/><p>Qin Guan shook his head disappointedly. Then he told the busy woman at the stand, \"Your dishes are really authentic!\"</p><br/><p>Qin Guan was her most handsome customer in years, so she was pleased by his approval. She wiped her hands on her apron proudly.</p><br/><p>\"It’s an ancestral skill. My grandmother taught me so I could support my family.\"</p><br/><p>She picked up the iron scoop and added a full scoop in Qin Guan's marmite. \"Have some more if you like it. My treat.\"</p><br/><p>Huang Bo was surprised. I want more too! \"Fill my marmite!\" he told the woman.</p><br/><p>\"No problem!\"</p><br/><p>A scoop of bean curd jelly and tasty sauce was poured into his bowl.</p><br/><p>Huang couldn't believe it until they left.</p><br/><p>\"It's so unfair! A handsome guy can have a free lunch, but she charged me for two bowls!\"</p><br/><p>Sister Xue patted his hair to comfort him. The Cherokee roared to life, and they left the plant district.</p><br/><p>No one knew whether this would be the cradle of the two young actors, but a small fire had been lit. Time would help it burn through the wilderness.</p><br/><p>Now let’s go back to the World Cup, the sole focus in Qin Guan's dormitory.</p><br/><p>On August 31st, 2001, the second phase of the preliminary competition began in Muscat. It was not only a celebration for Chinese soccer players, but also the final party of the six roommates before they became seniors.</p><br/><p>Taking advantage of his job, Qin Guan took them to the rooms on the third floor of the Fruit &amp; Candy club. The director welcomed them warmly, opening the door for them.</p><br/><p>Qin Guan was too embarrassed to ask Bu Qinglu to use the VIP lounges on the fourth, fifth and sixth floor.</p><br/><p>It was excessive enough for them to enjoy the free service on the third floor.</p><br/><p>His roommates didn't see themselves as outsiders though. Before the competition began, they started singing songs to amuse each other.</p><br/><p>As a loyal friend, Wang Lei accompanied Qin Guan to the drinks market to get some beer. There was an open buffet in the hall and a drinks market nearly 100 square metres big. Guests could take whatever they wanted.</p><br/><p>Expensive red wine was on the drink menu, but ordinary drinks were in the supermarket. This was both for the convenience of the clients and for saving money. It was like killing two birds with one stone.</p><br/><p>Qin Guan took a small handcart and walked to the beer shelf. Suddenly, Wang Lei pulled at his clothes.</p><br/><p>\"What's the matter?\" Wang Lei didn’t say anything. He just pointed at the French glass windows across from them.</p><br/><p>Tens of girls were leaning against the glass, staring at Qin Guan with wide eyes. They were the girls who worked at the club, whose job was to drink with customers.</p><br/><p>Wang Lei asked Qin Guan in a low voice, \"Your enemies?\"</p><br/><p>Qin Guan shivered before answering, \"I have to sneak away. Take the beer and pretend you saw nothing. I’ll pay you later.\"</p><br/><p>Wang Lei blocked Qin Guan with his body. The girls were pulling their hair in disappointment. Qin Guan squatted down, intending to sneak back from behind the shelves.</p><br/><p>\"Alas! It’s Grand Accountant Qin! He’s such a rare guest here!\"</p><br/><p>Qin Guan was walking fast, his body bending down when a pair of high-heels appeared in his way.</p><br/><p>Qin Guan looked up along the slender ankles, the legs in black silk, and the red lips that opened and closed above his head.</p><br/><p>\"Brother Qin, you are really a rare guest. Most of the time, you just talk about business with our boss. The girls have been missing you desperately. Today I caught you though. We are free now. Have a talk with your sisters, okay?\"</p><br/><p>Qin Guan straightened his body awkwardly and patted imaginary dust off his clothes. Then he greeted her, \"Sister Wenwen! What a coincidence!\"</p><br/><p>Sister Wenwen was pleased with his words. She fanned her heated cheeks before saying, \"Alas! You flatter me. Each time you run when you see me, I feel like a cat chasing a mouse. Why do you look down upon your sisters? We don’t bite!\"</p><br/><p>\"We can't be compared to the boss’ favorite girl on the sixth floor though. Lily is like a white lotus, living in the silt without getting dirty. Grand Accountant Qin also cherishes her, don’t you?\"</p><br/><p>\"No, no! Listen to me!\" Before Qin Guan could speak, Li Jie shouted loudly from the door of the supermarket.</p><br/><p>\"Aha! You are not loyal to your brothers! You know such a beautiful girl, yet you haven't introduced her to us! Are you afraid we’d tell your girlfriend?\"</p><br/><p>Confident now thanks to Li Jie's words, Qin Guan said, \"You see, I have girlfriend. That's why I have to maintain my integrity. I’m afraid I could make a mistake if stayed too long around such a hot girl like you.\"</p><br/>\n</div>"}