{"title": "Chapter 227: The Meritorious People Backstage", "id": 227, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-227-the-meritorious-people-backstage", "volume_title": "Volume 3", "body": "<h1>Chapter 227: The Meritorious People Backstage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 227: The Meritorious People Backstage</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"That means that Chinese people have a broader vision and more choices, so we have to bring in our new products this year. The parent company has set high expectations for you. We’ll establish offices in every big city in China.\"</p><br/><p>\"China will restore her status in Asia... Just like my mother, who’s still retaining her graceful upbringing...\"</p><br/><p>Shanchuan was clever enough to give up the debate on this. Ignorance was bliss after all.</p><br/><p>In the fairy-like yard, Qin Guan was celebrating his success with Teacher Rong.</p><br/><p>It was like an ocean of joy. The gatekeeper, steward, maids, player and the fake hosts were congratulating each other. Sister Xue gave Teacher Rong a thumbs-up. She was curious about how Teacher Rong had made such a perfect arrangement.</p><br/><p>Teacher Rong pointed at Qin Guan’s costume. \"It could be used as a formal outfit. I helped Liang Shuping, the inheritor of Jing Embroidery, apply it to non-material cultural heritage. It’s her work. She’s unparalleled in China.\"</p><br/><p>Then she pointed at a beautiful girl sitting between the flowers. \"This is Wang Yanran, a student at the Central Conservatory of Music. She majors in classical musical instruments. You should call her Senior Sister.\"</p><br/><p>Wang Yanran craned her neck from behind Teacher Rong. Her black phoenix eyes twinkled at Qin Guan.</p><br/><p>Wow! She looks like a portrait of a lady in ancient times.</p><br/><p>It was rare to see such a pure girl in that annoying city. Qin Guan was a little shy. \"Hello, Senior Sister.\"</p><br/><p>Wang Yanran smiled at Qin Guan. That handsome boy seems like he’s from ancient times himself. \"Hello, Junior Brother.\" She raised her arched eyebrows slightly and gently opened her small red lips. She spoke without exposing her teeth.</p><br/><p>Her soft words made the audience shiver. Qin Guan supported his body against the wall to prevent himself from collapsing.</p><br/><p>Teacher Rong pointed at the steward. \"The original host of the yard employed a professional group to arrange it.\"</p><br/><p>They all expressed their appreciation to Qin Guan, holding drinks and food in their hands. Qin Guan had covered all the expenses.</p><br/><p>With tears in his eyes, he turned around, waiting to hear the story of the yard.</p><br/><p>\"This yard belongs to an old friend of mine. They are abroad, so I borrowed it for the day. You don't need to know their identity.\"</p><br/><p>Qin Guan understood. \"Not long ago, I visited some small quadrangle dwellings that cost unbelievable prices. This must be much more expensive.\"</p><br/><p>Teacher Rong nodded. \"Especially considering the area it’s in.\"</p><br/><p>\"Well done for today! I hope you can achieve everything you want with your own effort, instead of asking help from other people.\" She patted Qin Guan on the back kindly.</p><br/><p>Wang Yanran said in a soft voice, \"This is bias. He can do anything with his face!\"</p><br/><p>They all laughed together. The shaking leaves seemed to be talking in the autumn breeze, their happy voices flying high in the sky.</p><br/><p>With a basin and a towel in hand, Qin Guan went out of the public bathroom in his slippers. After a busy day, a hot shower was the best way to relax.</p><br/><p>On the way to his dormitory, the students passing by couldn't control their eyes. Senior Qin is here. He will graduate in one year. We have to take this chance and enjoy meeting him while we can.</p><br/><p>More and more students clustered around him.</p><br/><p>\"Senior Qin, what are your future plans? Will you do your postgraduate degree at our university?\"</p><br/><p>\"Senior Qin, you are not in a TV show this year. Why? Is it because your perfect looks limit your development, as some commentators have said?\"</p><br/><p>\"Senior Qin, I like you...\"</p><br/><p>The crowd was like a snowball, getting larger and larger.</p><br/><p>Qin Guan covered his chest with the basin and the towel. What do you all want?</p><br/><p>\"Hey, that’s my body wash!\"</p><br/><p>\"It's only an old towel! I’m not lying to you. Stop, it's torn!\"</p><br/><p>\"Hey! Those slippers cost only eight yuan. They’re not worth...\"</p><br/><p>\"Give them back to me! How will I walk back without slippers?\"</p><br/><p>Qin Guan was doing all he could to resist, when suddenly his reinforcements arrived. Led by Ye Dong, his roommates dropped from heaven in a formidable array.</p><br/><p>\"What are you doing? Stop! You are students at our college! Do you have no shame? You’re the same as crazy idolaters! You! I know what you boys do! You just aim at the girls!\"</p><br/><p>The boys ran away immediately.</p><br/><p>\"And you! I’ve told you many times that Qin Guan is not gay! He’s not! Yet you dared bribe Liu Xiaoyang with money to change dormitories with him! Are you kidding? If you succeeded, it'd be just like being in the ladies’ bathroom!\"</p><br/><p>Several gay boys turned around and left.</p><br/><p>Ye Dong turned to the girls, who were the biggest part of the crowd. \"Sisters, you have to choose an idol with high taste, or you’ll be laughed at. Look at his low popularity. Most stars could beat him. He only enjoys fame at our college. Most people barely remember his face. You are all sophisticated young women!\"</p><br/><p>The freshmen, who were the most crazy, got angry at his words. It was unbearable to see their prince criticised.</p><br/><p>\"You dare defame our idol! Who are you? You’re just a peasant!\"</p><br/><p>\"Yes, he must be jealous of Qin Guan!\"</p><br/><p>Ye Dong was confused. I’m telling the truth! What are you attacking me for?</p><br/><p>\"You unreasonable women!\"</p><br/><p>\"Are you kidding, bro? You want to reason with women?\"</p><br/><p>\"Just go!\"</p><br/><p>Suddenly, the situation got out of control again. Qin Guan retreated to the side smartly. Liu Xiaoyang held his bathing stuff for him.</p><br/>\n</div>"}