{"title": "Chapter 238: The Estee Lauder Pen", "id": 238, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-238-the-estee-lauder-pen", "volume_title": "Volume 3", "body": "<h1>Chapter 238: The Estee Lauder Pen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 238: The Estee Lauder PenTranslator: Lan Editor: EfydatiaThey left silently. As the elevator descended, Qin Guan started complaining to Sister Xue, \"My jacket is gone. Could you please ask the staff to look for it? Maybe someone put it away while cleaning up. I’m in my spare suit now.\" Sister Xue nodded as they reached the ground floor of the plaza. The door opened slowly. \"Wait for me by the entrance,\" she told Qin Guan. \"I’ll go to the parking lot. You drank wine just now.\" Qin Guan gave his key to Sister Xue and waited by the entrance. Chenxi Plaza was a high-end shopping mall in Wangfujing. Customers there were rare, but very generous. The manager of the ground floor saw the customer flow increase without any obvious reason. Actually, the number of the customers was the same, but a part of them rushed forward in a certain direction. Their aim seemed to be a man standing by the entrance next to the Estee Lauder shop. The tall man was in a dark grey suit. His back and waist were straight, and his legs were slender. His arms were folded across his chest, and he was staring at the parking lot. He seemed to be waiting for someone. Alarmed by the increasing number of people around him, he turned his head around. It was Qin Guan! The manager, who was a fashion fan, recognized him right away. He looked around and walked up to Qin Guan as fast as he could. Judging by the current customer flow, I have to intervene in advance to prevent a traffic jam. In fact, he just wanted to get close to his idol. The manager walked up to the Estee Lauder counter with a professional smile. Qin Guan was confused. The ground floor had originally been empty, but now he was surrounded by customers. Are they all fans of mine? Impossible! I don’t even get surrounded by fans on the street. The customers there were actually all readers of VOGUE and ELLE. They really admired Qin Guan, but they were also comparatively sophisticated people. No one rushed over or cried out. They just kept a distance and took a look at him. The strange deadlock was broken after ten seconds by a brave girl. She had just walked over there from the checkout, where she had paid for her Estee Lauder cosmetics, and seen the crowd gathered by the counter. She squeezed into the crowd and handed the receipt to the smiling beauty consultant. Then she picked up her goods and saw Qin Guan. \"Qin Guan?\" The young girl cheered up. She walked up to him bravely and began asking him questions nervously. \"Are you VOGUE’s cover model? I know all about your work! Are you aware of the online action your fans took?\" She stood not far from Qin Guan as she sniffled. \"Are you drunk? Are you waiting for your driver? Ha! Good champagne! French Snow-White, right?\" Qin Guan nodded unconsciously. \"You’re really cute! You shouldn't trust strangers so easily. It was our destiny to meet here. Could you please give me an autograph? Would that be too much trouble for you?\" \"Why are you here? Is it for work?\" Girl, you are really a talent. The Bureau of National Security should employ you. Qin Guan was dizzy from how fast she talked. He raised his arms helplessly and massaged his temples. \"Sorry, I forgot my pen.\" He spread his hands apologetically. \"Wait, let me see! Everyone, just find me a pen if you want an autograph!\" Several onlookers began to rummage through their bags. The chattering girl failed to find a pen in her handbag. She looked around and was suddenly enlightened. She took a lipstick from her Estee Lauder shopping bag, opened it and handed it to Qin Guan. \"You can use this. Just don’t press it too hard. It's autumn now, so the lipstick should be too fine to break.\" The Estee Lauder beauty counselor was speechless. Is it our fault? How could she mistake our 200-yuan product for an ordinary pen? Qin Guan took the lipstick and asked her, \"Where do I sign?\" Sister Xue parked the car at the entrance and entered the plaza again. That’s when she saw the small-scale autograph session. The chattering girl saw Sister Xue and hastened to take off her pink silk scarf. \"I don’t have any paper with me. No one does when they go shopping. Sign here! It can be a piece of artwork.\" Surprised, Qin Guan took the soft scarf. \"You really want me to sign on your Burberry scarf? This must have cost 2,800 yuan!\" The girl looked even happier. \"You are really the best in the domestic fashion industry! You even recognized the scarf’s brand and price! Don't worry, just sign on it. Your signature is way more precious than the scarf!\"</p><br/>\n</div>"}