{"title": "Chapter 248: Preliminary Discussion", "id": 248, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-248-preliminary-discussion", "volume_title": "Volume 3", "body": "<h1>Chapter 248: Preliminary Discussion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 248: Preliminary Discussion</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>She smiled warmly at Sister Xue. \"I know you. Qin Guan was your model at the very beginning. You might be a green hand in the film and TV circle, but that doesn’t matter. Would you like to cooperate with me?\"</p><br/><p>Her attitude changed so fast that Sister Xue didn’t know what to say.</p><br/><p>Wang moved closer to them, breaking the deadlock. \"Going abroad doesn't mean giving up your career in China. With proper management, you could manage that unfavorable situation. This may be another chance for you. If you trust me, I’ll help you. Will you return to China after your graduation?\"</p><br/><p>\"Of course!\" Qin Guan answered resolutely.</p><br/><p>\"That's it!\" Wang Jingcao looked slightly excited. She couldn't help but rub her hands together. \"Study abroad and maintain your domestic popularity. When you return to China, you’ll get other roles. If possible, you should appear at a top fashion week or a launching event to expose yourself to the public. Just send the photos back and I’ll do the processing. Nowadays, most top brands are from foreign countries anyway.\"</p><br/><p>Qin Guan was speechless. \"That's cheating! If I can get an offer from a big brand, I’ll inform you and Sister Xue as soon as possible. I don't want to squeeze in to shows like that though.\"</p><br/><p>Wang was still happy. \"So you agree with me?\"</p><br/><p>Sister Xue nodded at Qin Guan.</p><br/><p>He tried to make the two excited women calm down, \"I’ll work hard, provided that the work doesn't influence my courses. You can just contact Sister Xue about our future cooperation. I trust her.\"</p><br/><p>Sister Xue felt warm. That’s my boy.</p><br/><p>\"I believe in you, Qin Guan. The LEE designer was full of praise for you at the Capital Fashion Week. He also invited you to the US. This is the perfect combination of a favorable climate and the best human resources. It will be easy for you to appear at a middle-scale fashion show. Your courses will be a piece of cake. Asian students are famous for their good marks.\"</p><br/><p>Wang knew that they had decided to cooperate with her and she suddenly turned into a babysitter. She clapped on the table happily. \"We have a deal! You can attend the Silver Eagle Festival with me. I’ll invite you as an honorable guest on the red carpet. I’ll discuss this further with your agent.\"</p><br/><p>The atmosphere was quite harmonious. Qin Guan decided to leave. He had to prepare for his college applications.</p><br/><p>Before leaving though, he turned around and asked, \"Sister Wang, when will the Silver Eagle Festival be held?\"</p><br/><p>\"On November 5th.\"</p><br/><p>Smiling, Qin Guan reminded her, \"My photo album...\"</p><br/><p>Then he left, leaving the two women to discuss about his first photo album, which would be released in all major Asian countries at the same time.</p><br/><p>Qin Guan’s TV shows would be aired at the end of the year on local TV stations. With proper management, his status in the entertainment circle would be promoted to a certain level.</p><br/><p>By the time he went abroad, he might have a place not just on the internet, but among traditional media as well.</p><br/><p>He might even be as popular as Huang Xiaoming, who had starred in \"Emperor of the Han Dynasty\".</p><br/><p>\"When the album is released, we should...\"</p><br/><p>Qin Guan was calm about the current situation. They had already established the five-shareholder company.</p><br/><p>His deposit and most of the income had been transferred to the account of the company as an investment.</p><br/><p>Early November would be the luckiest period of his life, what with the bidding, the photo album, and the red carpet of the Silver Eagle Festival happening at the same time.</p><br/><p>Qu Xuemei opened Ada’s reply in the VOGUE headquarters. She read the email, taking in ten lines at a glance and letting out a long breath. She slowly leaned back against her chair.</p><br/><p>As expected, Qin Guan had failed to qualify for World Fashion Man. Half a loaf was better than no bread though. He had at least qualified for Asia.</p><br/><p>People among the top fashion circle didn't attach importance to the title anyway. It was just the domestic circle.</p><br/><p>Her assistant knocked on the door as she was massaging the bridge of her nose.</p><br/><p>\"Yes?\"</p><br/><p>The assistant walked in with a hanger. \"Here’s the suit, Chief Editor.\"</p><br/><p>Qu paused for a while before she answered, \"Put it on the couch.\"</p><br/><p>Her assistant did as she was told. Then she asked, \"The printer is waiting for our orders. Is this version okay for printing?\"</p><br/>\n</div>"}