{"title": "Chapter 241: Questioning", "id": 241, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-241-questioning", "volume_title": "Volume 3", "body": "<h1>Chapter 241: Questioning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 241: Questioning</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Confused, everyone fixed their eyes on Guan Jian, who was standing behind Qin Guan. The tall boy strolled up to Liu Xiaoyang with a strange smile.</p><br/><p>Before speaking, he looked around him. Then he looked down at Liu with a faint smile on his face. \"Look at you, Liu Xiaoyang! Does your mom know what you’re doing these days? You learned how to play with girls, huh?\"</p><br/><p>He clapped Liu on the head with his huge palm.</p><br/><p>Liu tried to explain nervously, \"No, Brother Guan. I was just singing here.\"</p><br/><p>They must know each other!</p><br/><p>Qin Guan kindly explained on Liu’s behalf, \"The owner of the club is my friend, so I invited them here. The girls only drink and sing songs with the clients. Don't worry.\"</p><br/><p>Guan Jian turned to look at Qin Guan and grinned, making Qin Guan shiver.</p><br/><p>He took his hand off Liu's head and patted him on the shoulder fatherly. \"You have grown up so much. You know how to relax now.\"</p><br/><p>Liu looked like a wild animal who felt safe again. He rolled his eyes and asked curiously, \"Are you here with Qin Guan?\"</p><br/><p>Qin Guan made a gesture, letting Guan Jian speak.</p><br/><p>Guan Jian’s horrifying smile disappeared, and he hugged Liu around the shoulders.</p><br/><p>\"Liu Xiaoyang lives in the same neighborhood as me. I’ve known him since we were kids. I’ve watched him grow up. You are only 18 years old! This place...\"</p><br/><p>Then he took his hand and rubbed it on his pants.</p><br/><p>\"What a crazy boy! What's that on your body? It’s so sticky!\"</p><br/><p>Liu put on his hoodie, trying to explain, \"I’m sweaty all over...\"</p><br/><p>Guan Jian pointed at Qin Guan. \"I know him from training school. He is the roommate you always showed off about, right? I would have never guessed. This is He Ming. He lives in the courtyard of the diplomats. It's not far from our neighborhood. And this is Lan Jin. He reminds me of you a lot. You could become good friends in the future.\"</p><br/><p>By that time, Cong Nianwei had taken a seat opposite the two girls.</p><br/><p>Liu cheered up at Guan's introduction. He bowed before He Ming and said, \"Brother He, you are like my own brother.\"</p><br/><p>Who said that Liu had not mastered everyday life courtesies? He was amazing at being the younger brother.</p><br/><p>He sized Lan Jin up from head to toe and introduced himself, \"Hello, I’m Liu Xiaoyang. Brother Guan says we are a lot alike.\"</p><br/><p>The straight-A student and the underachiever talked happily.</p><br/><p>Cong Nianwei was talking to the three girls with a calm smile.</p><br/><p>Li Jie was sitting still with his hands between his legs. He no longer looked like a playboy. The two girls sitting with him were answering Cong Nianwei's questions honestly.</p><br/><p>Cong Nianwei blinked and leaned forward slightly. \"Good! Now I know your age, work experience and job description. I’ll get straight to the point. Is anybody here a frequent guest? Who? How often?\"</p><br/><p>The two girls looked at Qin Guan subconsciously. They had finally met his mysterious girlfriend.</p><br/><p>She was sitting in front of them, reminding them of a strict primary school teacher.</p><br/><p>They couldn't help but shiver at her smile.</p><br/><p>The girl in Li Jie's arms sat up straight. She was sure that Brother Qin was being bullied by his girlfriend.</p><br/><p>\"Brother Qin comes here the most often,\" she answered.</p><br/><p>It felt like a thunder had landed on Qin Guan’s head. Cong Nianwei was smiling sweetly, making Li Jie shiver and sober up.</p><br/><p>The girl hastened to add, \"He comes here for work. He goes directly to the sixth floor. Brother Li comes here for singing and playing. He’s become a frequent guest after the soccer match. He comes here every weekend for me, because I have the biggest boobs.\"</p><br/><p>She pushed her breasts up with both hands proudly. The girl beside her nodded.</p><br/><p>Cong Nianwei relaxed a little, and everyone in the room felt warmer.</p><br/><p>Relieved, Qin Guan invited everyone to the fourth floor.</p><br/><p>Li Jie’s feet felt flaccid, so the two girls had to support him with their hands. He smoothed his hair and asked Qin Guan, \"Have you been promoted? Can you go to the fourth floor now?\"</p><br/>\n</div>"}