{"title": "Chapter 247: Poaching", "id": 247, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-247-poaching", "volume_title": "Volume 3", "body": "<h1>Chapter 247: Poaching</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 247: Poaching</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan felt embarrassed by her words. He felt a strange sense of familiarity towards the woman. She seemed like an old friend or a family member, even though this was their first meeting.</p><br/><p>Sister Xue stared at them nervously. The woman had great connections and background. She was afraid that Wang would steal Qin Guan from her in the future.</p><br/><p>Her presentiment was correct. Wang stopped beating around the bush and got to the point, \"I heard that you have been very productive this year. You acted in three TV shows, right?\"</p><br/><p>Sister Xue straightened her back proudly, but Wang's next words hit her across the face.</p><br/><p>\"I have watched your shows, and there were two serious problems. The first is that you always play the same roles. You are always a co-star in period shows. The second problem is your haste in selecting roles. It's dangerous to be limited to a certain type of character. Just count how many villains you have played! Five! In five different shows.\"</p><br/><p>\"Although your roles are popular among the audience, the directors will easily limit your choices. In the future, they will assign only villain parts to you, and it will be too late for you to change.\"</p><br/><p>Sister Xue felt embarrassed by her words. I have no excuse to defend myself.</p><br/><p>Wang Jingcao looked at Qin Guan regretfully. This diamond has been misused! His agent must be an amateur.</p><br/><p>Then she asked Qin Guan, \"What's your opinion? Would you like to be my client?\"</p><br/><p>\"In fact, I’ve been paying attention to you ever since W. Brother contacted you. You rejected them and they threw your card in the trash bin, but I picked it up. Then I visited the actors and crews you cooperated with and learned that you had a good reputation. Otherwise, I wouldn’t be here.\"</p><br/><p>Sister Xue and Qin Guan were convinced. Her clients included actors like Chen Daoming after all.</p><br/><p>What she’d said had showed her scorn for Sister Xue though. The woman was really confident about herself.</p><br/><p>Before Sister Xue exploded, Wang threw another bomb at them. \"I’d like to invite you to Silver Eagle in early November.\"</p><br/><p>Qin Guan was surprised. \"But I wasn’t nominated for an award. I’m not qualified to attend the festival.\"</p><br/><p>Wang Jingcao tried to explain, \"Besides the competitors, many honored guests and actors are invited to the ceremony. Will you consider it?\"</p><br/><p>In Qin Guan's past life, Wang had seized opportunities for her actors by using a bicycle. She would shuttle among crews, companies and VIP's homes by bike. In one year, she’d become the most famous agent. What she relied on was caring for her actors.</p><br/><p>It was a pity that this was not Qin Guan's aim. Otherwise, he might have been convinced.</p><br/><p>Sister Xue suddenly remembered something and began to gloat.</p><br/><p>Qin Guan replied sincerely, \"Sister Wang, it's my honor to get invited by you, but I’d like to be honest.\"</p><br/><p>Sister Xue eyed Qin Guan, trying her best to stop him. Her eyes and nose were completely twisted.</p><br/><p>Qin Guan held his laughter back as he said, \"I have my own reasons for accepting roles like that. I’m planning on studying abroad next year.\"</p><br/><p>Wang was shocked. It was hard for her to accept that a rising star would give up his career without hesitation to go abroad.</p><br/><p>\"If you were only an actor, the losses of going abroad would outweigh the gains. You are also well-known in the fashion industry though. In my opinion, your achievements as a model played a big part in your success. I’m also trying to create a do-all star in China. I want to foster a new star that sets fashion trends in Asia, like those in Japan and South Korea.\"</p><br/><p>\"Why do you want to go abroad?\"</p><br/><p>Sister Xue broke in, \"Qin Guan took this job in his spare time. He wants to be an accountant. He will apply for a financial major in foreign colleges. He’s not going to a drama school.\"</p><br/><p>Wang Jingcao was speechless. She’d known that he was a college student, but this was beyond her imagination.</p><br/><p>Qin Guan wanted to deliver some good news to relieve the tension in the room.</p><br/><p>\"Don’t worry, Sister Wang. I might continue working part-time overseas. I have some acquaintances in the modelling circle there. If I get an offer from a college, I’ll have to earn my tuition fees, so I won't quit the industry anytime soon.\"</p><br/><p>Wang looked cheered up. \"Which country do you plan to move to? Which college are you applying to?\"</p><br/><p>\"New York in the US. I think I could at least get an offer from LEE.\"</p><br/><p>Wang clapped in excitement. \"That's great! We should keep in touch. Don't rush to say no!\"</p><br/>\n</div>"}