{"title": "Chapter 246: A Professional Agent", "id": 246, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-246-a-professional-agent", "volume_title": "Volume 3", "body": "<h1>Chapter 246: A Professional Agent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 246: A Professional Agent</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan shook his head. \"No, I want the equipment of the deal. The bidding project is my final goal. Are you interested?\"</p><br/><p>Suddenly, her eyes opened wide and she turned into a cunning merchant.</p><br/><p>\"Got it. I could provide you with the small tools and parts. I know the biding price, but you are here for a basic agent price.\"</p><br/><p>Qin Guan shook his head again. \"No, the investment required is beyond my means.\"</p><br/><p>\"What? You want to get something for nothing then?\"</p><br/><p>\"No, I want to transfer the equipment. If I could get 60% of the project with that price, would you be interested?\"</p><br/><p>He Qian's heart was beating faster and faster.</p><br/><p>As a general agent of Stanley China, she had been distributing products only for a short time. Her performance was just average, but she relied on the sales volume to compete with others.</p><br/><p>She had only achieved 60% of her annual goal by then, and it was already late October.</p><br/><p>She calculated fast in her brain. I’ll be able to reach my goal and then some!</p><br/><p>She sighed. \"The profit would be too low for me though.\"</p><br/><p>Qin Guan smiled again. Gifted with the ability of foreseeing, he could read the cards in her hand. \"As far as I know, there is a reward mechanism for general agents of foreign brands. For giant machinery, it's 10%. What’s the rate for small tools?\"</p><br/><p>He Qing was surprised. My idol knows the industry.</p><br/><p>She sighed and put down the paperwork, trying to make another proposal, \"The second bid requires a guarantee between companies. To tell you the truth, I don’t know anything about this company. It would be a huge risk on such a big project. There are too many holes on the other side.\"</p><br/><p>Qin Guan kept smiling as he proposed a second plan: a temporary contract with five signatures between legal persons and shareholders.</p><br/><p>\"It's a new company with five shareholders. You could be considered one of them.\"</p><br/><p>He Qian realized an experienced professional was sitting across from her.</p><br/><p>She read through the contract and called her assistant.</p><br/><p>\"Take this to Ada from the Legal Department. It's urgent. I need it today!\"</p><br/><p>Her assistant took the contract and left.</p><br/><p>Then He Qian asked, \"Will you control the capital flow? Shall I monitor the bidding process then?\"</p><br/><p>\"Don't worry. After we found the new company, the shareholders can send inspectors to the Finance and Sales Department. We’ll need your direct participation in the future.\"</p><br/><p>They began discussing it further. After a long time, the meeting was finished.</p><br/><p>When Qin Guan left, He Qian saw that her eyeshadow brush was on the floor. She picked it up. The silver powder on it was shining with a mysterious light, just like Qin Guan’s mysterious beauty.</p><br/><p>Maybe he is my lucky star after all.</p><br/><p>Qin Guan had finished his task. The rest of the work would be up to Bu Qinglu.</p><br/><p>His exams were much more important. Lan Jin was nervous about the exams, but Cong Nianwei and Qin Guan were not.</p><br/><p>When they exited the examination room, Qin Guan suddenly sneezed in the autumn wind.</p><br/><p>Cong Nianwei hastened to take a red hand-weaved scarf from her bag. Qin Guan took it and put it around his neck. \"It's good.\"</p><br/><p>Cong Nianwei was looking at him as if he was an idiot. She was thinking about weaving a blue scarf with the same materials. The long scarf made Qin Guan look like a cute hamster.</p><br/><p>Their heads were really close, when suddenly Qin Guan's phone started ringing. Sister Xue sounded nervous. \"Did you finish your exams? Come to my office later!\"</p><br/><p>Qin Guan hung up and shrugged. He had to take his girlfriend back to college and ran to work.</p><br/><p>When he entered Sister Xue’s private office, he saw a short-haired woman looking at him with an appraising expression. She seemed quite quick-witted and capable.</p><br/><p>Qin Guan greeted her and cast a glance at Sister Xue, realizing her face was slightly twisted. This was their secret signal, indicating that the woman was difficult to deal with.</p><br/><p>Acting calm, Qin Guan asked Sister Xue, \"What's the matter?\"</p><br/><p>Sister Xue answered in a stranger manner, \"Let me introduce Wang Jingcao, Sister Wang. She is a famous star agent.\"</p><br/><p>Qin Guan got worried. What does she want from me? I’m a nobody!</p><br/><p>Wang greeted Qin Guan as if she knew him, \"Hello, I’m Wang Jingcao. Both Li Bingbing and Fang Pingping have talked about you. I’m really interested in you. I just wanted to have a look at the actor who attracted the attention of those two beauties. Now I understand why. Reality matches your reputation.\"</p><br/>\n</div>"}