{"title": "Chapter 251: Adding Fuel to the Fire", "id": 251, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-251-adding-fuel-to-the-fire", "volume_title": "Volume 3", "body": "<h1>Chapter 251: Adding Fuel to the Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 251: Adding Fuel to the Fire</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>She looked at the pile of bowls and chopsticks in the sink and turned around. I’ll watch TV to relax first.</p><br/><p>She pushed the remote control and the big screen turned on. She shifted to the capital entertainment channel.</p><br/><p>\"Top Chinese male model débuts in Asia today. 10,000 Citizen photo albums are selling like crazy...\"</p><br/><p>Qu burst into laughter when she saw the cute girl delivering the news in a dramatic way.</p><br/><p>Interesting. In the news circle, people traded information with each other. Little had she thought that Qin Guan would have a connection with Wang Jingcao. That kind of propaganda was typical W. Brother style.</p><br/><p>There were not that many idlers fussing over stars online. They were all paid internet users, but the method was very effective.</p><br/><p>Qu leaned her head back against the leather couch and moved a sock to the side with her toes. Shall I add fuel to the fire?</p><br/><p>She closed her eyes, trying to picture Qin Guan cleaning the room for her in an apron.</p><br/><p>She opened her eyes again with a silly smile. Then she dialed the private number of Wang Jingcao.</p><br/><p>When she got through, she heard some background noise. Wang was at a dinner party.</p><br/><p>Qu was straightforward. \"Sister Wang, this is Qu Xuemei. I saw the news. Did you sign on with another actor?\"</p><br/><p>Wang found a quiet corner to speak on the phone.</p><br/><p>She smiled at the receiver. \"I haven’t heard from you in a long time. How come you remembered me? Do you want to express your appreciation for the hot sales? You are just in time. I need your help. Can I promote an actor on your cover? Any issue would be okay for me.\"</p><br/><p>Qu was silent for several seconds. What a cunning woman!</p><br/><p>Qu was a cunning woman herself though, except where Qin Guan was concerned. With a consistent superior tone, she answered, \"You are embarrassing me, Sister Wang. Your actors are not qualified to be in our magazine. The hot ones are not fashionable, and vice versa. I have the latest news on Qin Guan. Do you want it?\"</p><br/><p>Wang sensed it would be striking news. \"What news?\"</p><br/><p>\"In early 2002, he was selected for the next round of the Asian Fashion Men competition. The winners will be voted online. Isn’t that big news?\"</p><br/><p>Wang was speechless.</p><br/><p>In fact, people in the circle knew that Asia was inferior to Europe and the US in the fashion industry. That competition was only a way to comfort Asian models.</p><br/><p>In the domestic entertainment circle, the title could be overused. People were losing interest in the routines of the circle.</p><br/><p>The fashion circle was strange and very tasteful though.</p><br/><p>There were no vulgar models those days, because they lowered the taste of the whole circle.</p><br/><p>Real luxury brands kept ties with countless fashion experts and top companies. A three-minute advertisement with an exclusive model cost about 6,000,000 dollars.</p><br/><p>The title meant nothing for top luxury brands, but it was an important symbol for the domestic public and media.</p><br/><p>Wang was excited about the news. At the time, Qin Guan was only a familiar face for TV show audiences. This would be the best way to call upon his fans.</p><br/><p>She had to confirm the news for the sake of professional prudence though. \"Are the news reliable? Can I ask who’s your source?\"</p><br/><p>Qu put down the remote control and said proudly, \"I helped Qin Guan apply to the competition. I originally planned on publishing the news in our magazine, but I’d like to share it with you to get the best results.\"</p><br/><p>Wang was content with her answer. \"Got it! You are just in time! I appreciate it.\"</p><br/><p>It will provide more fuel for the fire. Shall I share the honor with other actors?</p><br/><p>Considering Qin Guan's simple, clean background, she felt pity for the boy. Besides, this was the perfect chance to shape him into a national idol.</p><br/><p>Countless potential plans filled Wang's mind. She wasn’t in the mood to enjoy the feast anymore.</p><br/><p>Qu wasn't able to calm down for a long time. She pressed on her phone and a photo of Qin Guan was displayed on the screen.</p><br/><p>She blinked at the photo and then switched her phone off.</p><br/><p>\"I hate you...\" she said and started crying weakly.</p><br/><p>...</p><br/><p>Qin Guan thought it was a wonderful world. He had been working hard for several years, but his popularity had been average at best.</p><br/><p>With Wang Jingcao's help though, he had become famous overnight. That was the power of a big company.</p><br/><p>It was also a sign that Qin Guan had been accepted by the entertainment circle. He had been labelled an \"instant online celebrity\".</p><br/><p>In directors and producers’ minds though, those celebrities did not have a solid foundation.</p><br/>\n</div>"}