{"title": "Chapter 253: Chaos", "id": 253, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-253-chaos", "volume_title": "Volume 3", "body": "<h1>Chapter 253: Chaos</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 253: Chaos</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Words couldn't express the grievance of the head of the committee. The organizers had countless ties with different parties. As a general director in charge of the balance among them, he was actually a marionette of the masters behind the scenes.</p><br/><p>He could foresee the storm in the entertainment circle after the festival, as well as the stain on his resume.</p><br/><p>It’d be better to quit from the circle and look for a chance somewhere else.</p><br/><p>While they were arguing, the fourth assistant in charge of the photo studio knocked on the door.</p><br/><p>It was too noisy inside the meeting room for anyone to pay attention to the sound though. Only an assistant in charge of serving tea heard him.</p><br/><p>He walked around the messy room and opened the door. The fourth assistant dashed in and was shocked by the chaos.</p><br/><p>His colleague warned him, \"They are about to kill us. If it’s not an emergency, you'd better deal with it yourself.\"</p><br/><p>The fourth assistant exploded, shouting in a Hunan accent, \"F*ck! At least they are behaving like Christians. The people in my room are having a fistfight!\"</p><br/><p>His loud voice made the excited crowd calm down. The assistant wanted to escape from the room.</p><br/><p>The director covered his face helplessly. Li Tian always causes me trouble.</p><br/><p>Li Tian could read his mind. \"It's not my fault, boss. It's because of the f*cking rules. The reporters in my room are fighting with us! Some people are hurt!\"</p><br/><p>The director realized the seriousness of the situation and tried to follow Li Tian out. The crowd rushed forward in outrage.</p><br/><p>\"Hey, stop! Deal with our problems first!\"</p><br/><p>\"You are not loyal, Lao Yang!\"</p><br/><p>Lao Yang smiled bitterly and rushed out, his staff covering his back.</p><br/><p>The door was closed. The producers all the stars looked up to looked at each other in speechless despair.</p><br/><p>Actually, they all knew Lao Yang was just a scapegoat who couldn't do anything to help them.</p><br/><p>The director walked down the long corridor nervously, asking Li Tian about the situation.</p><br/><p>He stood outside the studio hesitantly. This problem was actually below him, but the small fish in the studio were easier to deal with compared to the whales in the meeting room.</p><br/><p>Paying no attention to the chaos, he mounted the stage and picked up the microphone. \"Hello! One, two, three!\"</p><br/><p>His voice echoed resonantly around the studio. \"Welcome, everyone! I’m Yang Guang, one of the directors. We have issued notices to all the media about the entrance qualifications. Is there a problem? Why are you so restless? Stop fighting with each other!\"</p><br/><p>The reporters under the stage exchanged looks with each other. The reporter from the Xin Hua News Agency [1] spoke up, \"Hello! We would like to know what ‘media entrance fee’ means? You charge us 700 yuan each every day. As media, we only get paid as assistants. No organizers have ever charged us before! Are you down and out? You’re basically selling admission tickets to us! Let’s be clear about the situation. We are media, not some stupid fans!\"</p><br/><p>The director poured a basin of iced water over his head.</p><br/><p>\"No fee, no entrance. That’s our rule. Before leaving though, I suggest you call your directors and let them make the discussion.\"</p><br/><p>The director hastened to leave. There was little time left for him before the selection began.</p><br/><p>Silence prevailed in the studio as he disappeared.</p><br/><p>\"What shall we do? Should we leave or not?\"</p><br/><p>\"Leave? If all the media leave, we’ll leave. Look at them though. They won’t leave!\"</p><br/><p>\"You must know this about our circle. Everyone is always eager to get an exclusive report.\"</p><br/><p>\"Yes, but without unity...\"</p><br/><p>Some reporters backed off in indignation.</p><br/><p>They started calling their offices one after the other. \"They want to charge us, Chief Editor. Okay, okay!\"</p><br/><p>They all relaxed after the budget was approved. They wouldn’t have paid for it themselves. That would have been a loss for them.</p><br/><p>The beautiful stars were not bothered by the chaos. The stylist invited by Wang Jingcao was touching up Qin Guan’s makeup.</p><br/><p>He gasped in admiration. In that cold, bleak autumn, only that handsome boy could warm one’s heart up.</p><br/>\n</div>"}