{"title": "Chapter 263: An Abundance of Scripts", "id": 263, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-263-an-abundance-of-scripts", "volume_title": "Volume 3", "body": "<h1>Chapter 263: An Abundance of Scripts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 263: An Abundance of Scripts</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>After thinking deeply about it, the girls got scared. They exchanged glances with each other and smiled awkwardly at Sister Zhao. \"See you, Sister Zhao.\"</p><br/><p>When he left the nurse station, Qin Guan exhaled in relief. The sight of Cong Nianwei's face made him forget about everything.</p><br/><p>They returned home together. After eating some porridge, Qin Guan lay in bed and slept under the effect of the medicine.</p><br/><p>Cong Nianwei put the quilt carefully over his body. As she stared at his face, her fingers slid over his beautiful eyebrows, nose and lips.</p><br/><p>She blinked and lowered her head. Their lips touched softly.</p><br/><p>The next morning, Qin Guan woke up feeling refreshed. He saw his girlfriend sleeping in his arms.</p><br/><p>He cherished the quiet, sweet morning, but his body was uncomfortable.</p><br/><p>He leaned forward to kiss her, but she woke up with a start.</p><br/><p>Smiling faintly, Cong Nianwei pecked him on the lips. \"What do you want to eat? I’ll prepare something for you.\"</p><br/><p>Then she turned to get up.</p><br/><p>\"I want to eat you!\" Qin Guan pressed Cong Nianwei back against the bed.</p><br/><p>It was like spring had entered the room. A little sparrow on the sill watched them with curiosity. Its mother covered its eyes with her wings nervously.</p><br/><p>Qin Guan welcomed another beautiful morning with full energy and bumps all over his head (where Cong Nianwei had hit him). He took Cong Nianwei back to her college and then received a call from Sister Xue.</p><br/><p>His TV shows were all on air by then. Qin Guan had no idea why Sister Xue had asked him to go to her office to discuss things further.</p><br/><p>He found her ambiguous statement on the phone strange.</p><br/><p>He was right. Wang Jingcao was also there. There was an impressive number of scripts before them.</p><br/><p>Qin Guan greeted them and cast a glance at Sister Xue. We decided to keep a distance from Wang. Why did you keep in touch with her?</p><br/><p>Sister Xue looked just as gloomy. It was difficult to say no to people with a smile. Wang had come to her office early in the morning.</p><br/><p>Qin Guan took a seat, and Wang threw a bomb at them. \"Would you be interested in a movie?\"</p><br/><p>Qin Guan looked down at the scripts on the desk.</p><br/><p>Wang went on, \"The film ‘Crouching Tiger, Hidden Dragon’ was really hot this year. Some domestic directors would like to have a try overseas. The road to the US has been paved. Are you interested in Zhang Yimou's work?\"</p><br/><p>Qin Guan smiled at her and picked up a script. As expected, the main roles had already been cast.</p><br/><p>He turned a few pages and asked, \"There are plenty of actors at W. Brother. Why don't you recommend them?\"</p><br/><p>\"They only focus on leading roles. After the final editing, there may be no scenes left for the supporting actors. So...\"</p><br/><p>So you think I’ll be the spare wheel?</p><br/><p>Qin Guan didn't reply. He continued to check the rest of the scripts. \"Zhou Yu's Train\"? It was an indie film directed by Zhang Zhou, a good director. It was a pity that the two leads had already been cast.</p><br/><p>There were only two more worthwhile films in 2002. It was a tragic year for the domestic film industry. The total box office had been below 1,000,000,000.</p><br/><p>Qin Guan had originally wanted to appear on the large screen, but considering the reality of the situation...</p><br/><p>He looked up and saw another thick pile under the two scripts. Wang Jingcao praised him, \"I underestimated you. You’re familiar with Zhang Jizhong?\"</p><br/><p>\"He focused on martial arts dramas this year, taking advantage of Jin Yong's popularity. He wrote roles for you in all his TV shows. He attached great importance to you.\"</p><br/><p>Qin Guan was surprised to see the titles. \"The Legend of The Condor Heroes\", \"Dragon Buster\" and \"Demi-Gods and Demi-Demons\".</p><br/><p>He calculated in his mind. If he could fit them in his schedule, he would take them all. Uncle Zhang was kind to him. He always thought of Qin Guan whenever he wrote a new script. Qin Guan smiled at Wang. \"Thank you, Sister Wang. I’ll keep them for further study. Could you also tell me about the parts in these shows?\"</p><br/><p>Wang agreed and told them goodbye.</p><br/><p>When she left, Sister Xue grabbed Qin Guan. \"Are you silly? You accepted her offer?\"</p><br/><p>Qin Guan put the film scripts in his bag and began to read through the TV show scripts.</p><br/><p>\"We made the situation clear right from the beginning. This is just mutual back scratching. The roles must have been rejected by W. Brother. This way, she can gain popularity and make good use of resources. It's a win-win situation for us.\"</p><br/><p>Sister Xue didn't say anything. Qin Guan will go abroad in half a year. Who cares?</p><br/><p>She forgot that she also had to take care of Huang Bo.</p><br/>\n</div>"}