{"title": "Chapter 271: The Most Beautiful Student", "id": 271, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-271-the-most-beautiful-student", "volume_title": "Volume 3", "body": "<h1>Chapter 271: The Most Beautiful Student</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271: The Most Beautiful Student</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"You are in charge now.\"</p><br/><p> Lying on the backseat exhaustedly, Qin Guan told her with concern, \"I want to try the two films recommended by Wang Jingcao.\"</p><br/><p> Stunned, Sister Xue smiled. \"No problem, do as you wish. You will exceed her expectations. In that case though, you are going to be busy for the next six months. I’ll find you an assistant to help both with your life and work. I’ll introduce her to you next time.\"</p><br/><p> She waited for his reply in vain. Turning her head, she saw that Qin Guan had fallen asleep. His head was lowered slightly, and his long eyelashes were trembling along with the movement of the car.</p><br/><p> Time flew by. The hot season for applications for studying abroad arrived on the other side of the Pacific Ocean. American universities were accepting applications from both foreign and domestic applicants. Their email inboxes were jammed with emails.</p><br/><p> The tutor in charge was tired every day. It was boring to read so many similar emails.</p><br/><p> However, the next email he read made him sober up, as if he had fallen into a snow hole in Alaska. The tutor, who was famous for his strict image, uncommonly shared the email with his colleagues. \"Hey, Jason. I want you to see this.\"</p><br/><p> Jason was curious about the email, as his gloomy partner seldom talked with others on his own initiative. He stood up and walked over. \"What's the matter, Tom?\"</p><br/><p> Tom opened the attachments of Qin Guan’s application and resume one by one. As he typed on the keyboard and moved the mouse, Jason’s mouth opened wider and wider.</p><br/><p>Average Score: 98</p><br/><p>TOEFL: Nearly full mark</p><br/><p>Basic Thesis: Two</p><br/><p>Professional Thesis: Three</p><br/><p>Recommendation letter from a professional tutor and the department dean.</p><br/><p> That was the standard for a straight-A student.</p><br/><p> Tom was looking at his showy partner, whom he didn't like to talk with, as stupefied as a goose. Slightly excited, he opened Qin Guan’s resume.</p><br/><p> A splendid photo suddenly occupied the whole screen, making Jason spray out saliva. Awesome!</p><br/><p> It was hard for people of different races to recognize each other. It was what they called face blindness. Without features, it was hard for a person to recognize a member of another race. Beauty knew no borders, races or genders though. It could withstand all trials.</p><br/><p> In the small cabinet of that ordinary office, a group of people admired Qin Guan.</p><br/><p> Jason seized the mouse and clicked on the other files. The boy had done voluntary work and engaged in social activities.</p><br/><p> The outstanding student intrigued them, even though they had just experienced 9/11. The applications they had received that year were much fewer than before. It was exciting for them to discover such a gem.</p><br/><p> Jason returned the mouse to Tom. Looking at the name, he fell into deep thought. Professor Martin had asked me about an Asian student. Was his surname Qin? Or was it something else?</p><br/><p> He reminded Tom kindly, \"Professor Martin had inquired about that student. He must be really talented if he attracted the attention of the top economist of our country!\"</p><br/><p> Tom looked at Jason in surprise. Wow! He is a good man, despite his fickleness and coquettish.</p><br/><p> He forced a smile and then forwarded the email to the professor, since the boy had attracted the attention of a certain tutor.</p><br/><p> The boy might even get a doctorate in the future. In America, a postgraduate degree was not as valuable as in China. In the talent market, major companies considered it almost the same as a bachelor degree. Graduates with doctorate degrees attracted more attention and were considered experts on their field.</p><br/><p> In 2002, Chinese students had just begun their journey abroad. US professors had no idea about the advantages a foreign postgraduate degree brought in a Chinese workplace. They simply accepted the applications with the most ambitious cover letters. They thought the applicants really admired their universities.</p><br/><p> Chinese students passed the check easily. They just had to say that they loved the profession.</p><br/><p> Qin Guan’s application was forwarded to Professor Martin. The old bearded man sent an email to his old friend, informing him that his beloved student had been accepted. In a few minutes, Martin received a reply.</p><br/><p> Aren’t you asleep so late at night?</p><br/><p> Confused, he opened the email. He had originally thought that his old friend was boasting about the student’s perfect academic score, but he was surprised to see that there was a RAR attachment.</p><br/><p> He clicked on it as he drank his coffee.</p><br/><p> It was a beautiful full-body photo of Qin Guan acting as a standard-bearer.</p><br/><p> For a while, Martin thought that his friend’s email had been hacked. As scholars, it was not their style to show off to each other.</p><br/><p> There was a childish message under the picture. \"This is my most beautiful student. Do you have one?\"</p><br/>\n</div>"}