{"title": "Chapter 277: No Problem, Director Zhang", "id": 277, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-277-no-problem-director-zhang", "volume_title": "Volume 3", "body": "<h1>Chapter 277: No Problem, Director Zhang</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 277: No Problem, Director Zhang</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Is he a candidate for the seven swordsmen of Qin? What's his name?\"</p><br/><p>Director Zhang was leading his team to the studio, when he paused and watched the scene for a while.</p><br/><p>The assistant director welcomed him with a smile. \"This is Qin Guan. He’s a newcomer.\"</p><br/><p>\"Oh? Is he experienced in film shooting?\"</p><br/><p>\"No, but he was in some good TV series.\"</p><br/><p>He wants to explore the possibility of a movie and wants mine to be his first? Clever guy!</p><br/><p>The assistant director hastened to say something favorable about Qin Guan. For an unknown actor, other people’s objective opinion was the most important factor.</p><br/><p>\"Wang Jingcao recommended him. You know her company supports us a lot. They even made Chen Daoming’s schedule for us. The other actors they recommended were rejected by me for lack of experience, but he is the best one. His features are perfect for ancient dramas. I think he’ll look splendid on the large screen.\"</p><br/><p>Zhang Yimou, who could make a film as beautiful as a nationwide advertisement, was keen on beauty. Qin Guan had paused. Zhang Yimou addressed the action director, \"What's your opinion?\"</p><br/><p>The latter gave Qin Guan a thumbs up. \"No problem!\"</p><br/><p>Zhang Yimou patted him on the shoulder. \"I believe in you.\"</p><br/><p>Then he made a joke with a young actor behind him. \"Take care of your successors. In the Yangtze River, the waves behind drive on the ones in front of them.\"</p><br/><p>Zhen Zidan and his agent laughed. They didn’t attach importance to Qin Guan, who didn’t engage in martial arts. They were cooperating with the best director of the mainland, so it was better for them to keep silent.</p><br/><p>Qin Guan had no idea what they were thinking about. All he needed to know was that he had succeeded.</p><br/><p>He and Sister Xue left the studio after the assistant director murmured to Sister Xue about the shooting plan. Qin Guan stared around the studio, which would be his beginning in the film industry.</p><br/><p>It will be a perfect full stop before I go abroad.</p><br/><p>If the older actors knew about his aspirations, he would have gotten beaten. That was a chance many people were earnestly longing for. During the tough time the film industry was going through, \"Heroes\" was the only hope.</p><br/><p>The insiders of the entertainment circle were smart and sensitive. Qin Guan's previous TV series had been sold out. It was a pity that most of them had been sold at low prices. Only a few local TV stations had paid for them.</p><br/><p>They were silently playing on local TV stations before the New Year.</p><br/><p>Qin Guan and his girlfriend were lying on the couch watching them. Qin Guan doubted her taste a lot.</p><br/><p>As a young sophisticated person, Cong Nianwei preferred works targeted at underage people. However, she had chosen \"Maids of the Red Mansion\" out of the three TV shows, which had confused Qin Guan.</p><br/><p>In fact, Cong Nianwei was nervous as she watched the TV show, as Qin Guan's character had many affairs with the girls. As they were making jokes together, the phone rang again.</p><br/><p>\"It’s Sister Xue again! She must be Cupid’s arch enemy!\" Cong Nianwei complained with a smile. Qin Guan made a grimace and answered the phone.</p><br/><p>\"Qin Guan, it’s starting!\"</p><br/><p>What? What was starting? Qin Guan was really confused.</p><br/><p>\"The online voting for the Asian Fashion Man.\"</p><br/><p>Qin Guan was enlightened. The event had finally begun. The voting would last for three days.</p><br/><p>\"So what?\" he answered indifferently. \"I can’t vote for myself. It all depends on the internet voters.\"</p><br/><p>Sister Xue hung up angrily. She didn't want to talk to Qin Guan anymore.</p><br/><p>Qin Guan threw the phone away happily and returned to Cong Nianwei.</p><br/><p>On the screen, Jia Lian was smiling to a beautiful girl. They fell on the bed together. As they watched the scene, countless female fans forgot to drink water and eat the snacks in their hands. They were fully satisfied by watching Qin Guan.</p><br/><p>Cong Nianwei's eyes had been fixed on Qin Guan from the very beginning. Qin Guan couldn't take it anymore.</p><br/><p>He turned and pressed her against the couch.</p><br/>\n</div>"}