{"title": "Chapter 272: The Screen Test", "id": 272, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-272-the-screen-test", "volume_title": "Volume 3", "body": "<h1>Chapter 272: The Screen Test</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 272: The Screen Test</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Martin was so angry that he felt his beard tremble. The two old guys began competing with each other.</p><br/><p> He tried his best to recall his students. Is there a handsome guy among them? Hal? No, he was not mine. Meyer? The boy is a Jew, he’s too shy. Kuhn?</p><br/><p> Martin sighed when he thought about the proud boy with the blonde hair and the blue eyes. Kuhn is really proud. He will not like being compared to a foreigner. </p><br/><p> Reluctantly, Professor Martin looked at the foreign boy with a warm smile. Even the ugly uniform couldn't diminish his grace. Everyone who saw him would smile at him.</p><br/><p> Martin sat down and replied to his old friend’s email. His answer was humorous and full of emotion.</p><br/><p> \"Immediately!\" He drew a small arrow pointing to Qin Guan's photo.</p><br/><p> The email made Professor Xu laugh loudly, scaring the stars and sleeping clouds away.</p><br/><p> ...…</p><br/><p>I love you,</p><br/><p>Not for what you are,</p><br/><p>But for what I am</p><br/><p>When I am with you.</p><br/><p>I love you,</p><br/><p>Not only for what you have made of yourself,</p><br/><p>But for what you are making of me.</p><br/><p> Adapted from Becun's novel, the script of \"Zhou Yu's Train\" was full of love and romance.</p><br/><p> Qin Guan read both the novel and the script and became obsessed with it. He and Sister Xue went to the address of the director, who belonged to the fifth generation of directors.</p><br/><p> Zhang Zhou was also a fellow townsman of Qin Guan’s. He had simple, honest shooting skills.</p><br/><p> In fact, the poetic novel was also a challenge for him, so he was serious about the selection of the actors.</p><br/><p> As expected, Zhang's favorite actress, Gong Li, was the heroine. Thanks to her perfect acting skills and line delivery, she was one of the top actresses in the country.</p><br/><p> There were only three protagonists and one co-star with lines in the film. The news had not spread, because Zhang had decided to have a private casting call. Because of his love for the novel, Qin Guan was planning on auditioning for the role of the veterinarian, the man who fell in love with the heroine.</p><br/><p> It was love at first sight.</p><br/><p> Zhang Qiang was an ordinary veterinarian who led a peaceful life in a small town. He didn’t know much about romance, but he was very realistic. Zhou Yu, the romantic heroine, fell love with the man.</p><br/><p> Qin Guan pushed into the director's office nervously.</p><br/><p> Zhang Zhou grew absent-minded when he saw him. Unlike the conservative directors of the fifth generation, and the bold and unrestrained style of the sixth, he was very educated and refined.</p><br/><p> He had originally been an excellent actor and had relied on his appearance. He had played the role of Prince Dan of Yan in Zhang Yimou's film, which meant that he was a handsome guy.</p><br/><p> Female beauties always became enemies, but male beauties often identified with each other.</p><br/><p> Sister Xue made a concise, but comprehensive introduction of Qin Guan and retreated, leaving them alone. Zhang Zhou, who was a capable and experienced man, got straight to the point.</p><br/><p> \"You are not suitable for Chen Qin. I have met with Liang Jiahui from Hong Kong several times. If he can dispel my doubts, the role will be his. As for Zhang Qiang, it's hard to say. I have some pretty good choices in my mind. I’m still hesitant though.\"</p><br/><p> Qin Guan remained calm, waiting for him to continue.</p><br/><p> \"Zhang Qiang will be a limitation for you. The performance does not just require acting skills, but also life experience. What does ‘a veterinarian in a small town’ even mean? He’d be an ordinary person in our lives. You must seldom look at yourself in a mirror, Qin Guan. I think you would meet the demands of other directors.\"</p><br/><p> Qin Guan felt sad. I hate my handsome face.</p><br/><p> He still tried to convince him though. \"May I try out, Director Zhang? Even if I don't get the part, at least I’ll be able to improve thanks to your feedback.\"</p><br/><p> Or you might change your mind?</p><br/><p> Zhang Zhou nodded at Qin Guan seriously. I have nothing to do anyway.</p><br/><p> Qin Guan put the script on the table and began with the first scene. It was an ordinary encounter with only a few lines.</p><br/><p> In fact, that was the most difficult scene. True acting skills did not lay in portraying excitement or extreme sorrow, but in indifferent events.</p><br/><p> Qin Guan sat in the chair, swaying slightly, as if he was sitting on a travelling train. In his imagination, a smoking woman was sitting opposite him.</p><br/><p> He relaxed and leaned his head against the back of the chair.</p><br/><p> With a purposeful, shameless expression, he tried to attract her attention.</p><br/><p> \"Hey, did you draw the art on the bottle?\"</p><br/><p> He carefully supported a non-existent bottle with both hands.</p><br/><p> \"It’s so beautiful! Guanware or folk kiln [1]?\"</p><br/><p>Qin Guan paused while the scene began taking form before Zhang Zhou's eyes. By that time, the heroine would smile. Zhang Qiang was amazed by Qin Guan.</p><br/>\n</div>"}