{"title": "Chapter 274: The Possibility of Becoming a Meat Pie", "id": 274, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-274-the-possibility-of-becoming-a-meat-pie", "volume_title": "Volume 3", "body": "<h1>Chapter 274: The Possibility of Becoming a Meat Pie</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 274: The Possibility of Becoming a Meat Pie</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> Qin Guan wiped the cold sweat off his forehead. If he could read her mind, he would have protested loudly.</p><br/><p> My life is exciting enough. I’ve had many strange experiences. As a man who cherished his life, that exciting activity was horrific for him.</p><br/><p> Cong Nianwei looked at Qin Guan’s frightened eyes and smiled at her cute boyfriend.</p><br/><p> The elevator reached its destination. The clash made the strong iron cage shake. Qin Guan held his breath. Can I go back now?</p><br/><p> The arrow was already on the string though. There was a staff member beside them who took pictures. That boy looks familiar. He is handsome even in the DV. Wow! What fair skin!</p><br/><p> Qin Guan’s face had turned dreadfully pale from fear. </p><br/><p> Cong Nianwei helped him out of the elevator. Qin Guan looked in the distance, then turned around immediately. He looked back at the elevator. Can I go back?</p><br/><p> Smiling, Cong Nianwei pressed harder on his hand. She looked smart in her yellow professional helmet.</p><br/><p> \"I’ll go first. You’ll love it!\"</p><br/><p> Qin Guan gave her a forced smile. \"Okay, I’ll support you mentally.\"</p><br/><p> The staff member fastened the special mooring rope to her waist. Another staff member recorded the brilliant scene with a camera for the brave girl.</p><br/><p> Cong Nianwei walked to the edge of the platform and waved at Qin Guan. As Qin Guan's pupils expanded, she turned her back to him and jumped down.</p><br/><p> \"Wow!\" His concern for her conquered his horror. Qin Guan looked down by the fence.</p><br/><p> That’s terrible! I feel dizzy. Come back, Weizi!</p><br/><p> Cong Nianwei shouted to vent her excitement during the rapid descend. A few metres above the water surface, the rope pulled her back.</p><br/><p> Cong Nianwei laughed loudly in satisfaction.</p><br/><p> The staff on the platform gave Qin Guan a thumbs up in appreciation. \"Your girlfriend is very brave, young man. She must have done this before.\"</p><br/><p> Quivering, Qin Guan smiled in horror. What does she do every day while I’m too busy working? What happens unbeknownst to me?</p><br/><p>Cong Nianwei stood below, waving her hands up to Qin Guan. That didn't help though. When one stood somewhere high, they had to avoid looking down so they wouldn’t get scared.</p><br/><p> Qin Guan tried his best not to look down. Otherwise, he would sit down on the platform and stay there for at least two hours.</p><br/><p> His legs felt really weak.</p><br/><p> Qin Guan got his helmet ready while the staff beside him said, \"Sir, sir...\"</p><br/><p> \"What?\" Qin Guan turned his head around like a robot when he felt a soft touch on his waist.</p><br/><p> He was kicked down.</p><br/><p> As he descended at high speed, Qin Guan could not make a sound. The onlookers behind were watching him happily. A young girl told Cong Nianwei in admiration, \"Your boyfriend is really brave. I have never seen a single person jump down without screaming.\"</p><br/><p> Knowing Qin Guan, Cong Nianwei was hesitant to answer. As expected, after several seconds, the rope reached its end.</p><br/><p> As he approached the water surface, Qin Guan started screaming like crazy. The glass of the indoor Bungee Jumping Hall shook slightly as some thin cracks formed on it.</p><br/><p> Everyone behind it covered their ears with their hands. It was unbelievable to hear such a scream from a man.</p><br/><p> When the rope reached its end, Qin Guan bounced back up. Only then did he experience the excitement of the climax.</p><br/><p> Qin Guan shouted again when he dropped for a second time. This time, his scream was a happy one. When he finally stopped at the end of rope, he was released.</p><br/><p> He fell limply on the hard floor. As he saw Cong Nianwei approach, he felt strangely excited.</p><br/><p> He hugged her and kissed her with all his strength. The near-death experience had made him unprecedentedly shameless.</p><br/><p> It had given him the same courage that alcohol gave cowards. With a knowing expression in their eyes, everyone around looked at the two lovers.</p><br/><p> Qin Guan stopped kissing her and took Cong Nianwei to the parking lot.</p><br/><p> Cong Nianwei looked at him with sparkling eyes. \"What are you doing? I bought all-inclusive tickets. There are many other activities...\"</p><br/><p> Qin Guan stopped her with another kiss. \"Let's go home.\"</p><br/>\n</div>"}