{"title": "Chapter 281: Heroes", "id": 281, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-281-heroes", "volume_title": "Volume 3", "body": "<h1>Chapter 281: Heroes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 281: Heroes</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"The circle of his part-time job is too complicated. You spend all your IQ on studying. He’ll cheat on you!\"</p><br/><p>Thinking of the funny look on Qin Guan’s face, Cong Nianwei smiled. \"He won't.\"</p><br/><p>Of course he won’t. I’m not an idiot.</p><br/><p>Noticing the unprecedented smile on her face, Cong Nianwei’s father fell into deep thought. Her smile combined warmth, love and shyness.</p><br/><p>His daughter had grown up. He could ignore his grey hair, but he couldn't ignore his daughter.</p><br/><p>If Qin Guan cheated on her, he would kill him, no matter where he was.</p><br/><p>...</p><br/><p>The Spring Festival arrived and passed. Schools would open soon. Qin Guan prepared his luggage earlier than he used to. His best friends, Zhou Jing and Li Jian, came over to see him off.</p><br/><p>Because of their love for their profession and the pressure of employment, they had both decided to take a postgraduate exam. They were aiming for universities in Beijing. They sent their best wishes to their good friend.</p><br/><p>Qin Guan and Cong Nianwei bid their parents farewell and took the train back to the capital. As soon as they arrived in Beijing, Sister Xue took Qin Guan to the \"Heroes\" studio.</p><br/><p>Director Zhang Yimou was famous for his high efficiency. He asked Qin Guan, who would play a supporting role, to watch the shooting process from the very beginning. There were certain differences between the film and the TV series, and the film was essential for the 2002 domestic box office.</p><br/><p>In the winter, when the whole market was depressed, \"Heroes\" was like a guide walking in the dark with an oil lamp. Their movie might end up finding a new path to the other shore, or fall down a cliff.</p><br/><p>When Qin Guan arrived, they were shooting a scene in the magnificent Qin Palace. The other actors were watching with curiosity. They all had folded chairs and assistants. Qin Guan found a small box and used it as a stool, sitting down in a corner.</p><br/><p>Content, he watched the older actors, Chen Daoming and Li Lianjie, as well as Liang Chaowei, who was also on set. The film was aiming for an Oscar, but it was also meaningful to the leading actors.</p><br/><p>In the black, dark palace, there was no fierce fighting or emotional conflict. The two men were talking peacefully.</p><br/><p>The scene was boring. Chen and Li maintained the same expression, gestures and position before the camera. They would start over even for the tiniest mistake.</p><br/><p>At the beginning, Qin Guan was at ease. However, soon he was getting more and more solemn.</p><br/><p>Just as he was about to think about the subtle differences he had noticed, Wang Jingcao spoke from behind him, \"Do you see the difference between you and really good actors?\"</p><br/><p>Qin Guan turned around, waiting for her to speak.</p><br/><p>\"Chen is my favorite actor. We have been good friends for many years. I have watched his every scene, so I can tell the difference every time.\"</p><br/><p>\"Actors exert different skills on different roles. He doesn’t need to interpret the role tentatively. He can handle the situation.\"</p><br/><p>Qin Guan was still confused. Before leaving, Wang told him, \"You show too much. Sometimes you should try to hide yourself. When you get enough experience, everything will come to you naturally.\"</p><br/><p>Looking at her back, Qin Guan got lost in thought. She was just like a babysitter. For her, actors were not partners, but family members.</p><br/><p>She treated both Qin Guan, an independent actor, and her own actors the same way.</p><br/><p>Qin Guan turned back to Chen’s performance. He looked like a real emperor. Maybe the real emperor had been just like him.</p><br/><p>The next day, the martial arts choreography began.</p><br/><p>The scenes began with Zhen Zidan, who had the smallest part. In his first scene, he played the Go game with a Qin swordsman in a hut.</p><br/><p>The black and white pieces were fighting fiercely. Raindrops were falling down to the criss-cross water channels to form a checkerboard.</p><br/><p>The rain and the melodious music resembled the complicated relationship between different kingdoms. In his indigo gown and grey waistcoat, Qin Guan looked like a chivalrous swordsman full of vicissitudes.</p><br/><p>They sat by the two sides of the checkerboard. When Zhen Zidan put a white piece on the board, the camera turned to Qin Guan.</p><br/><p>He picked up the fillet with the Qin pattern and tightened it around his forehead.</p><br/>\n</div>"}