{"title": "Chapter 292: A Cold Porcelain Doll", "id": 292, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-292-a-cold-porcelain-doll", "volume_title": "Volume 3", "body": "<h1>Chapter 292: A Cold Porcelain Doll</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 292: A Cold Porcelain Doll</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The black girls looked frightened. They gathered together around their Big Sister. Jingzi tried to encourage them, \"She’s lying. Besides, even if Ms. Yamaguchi Tsutomu personally comes here, I’ll...\"</p><br/><p>\"What will you do then?\" a cold voice said softly from behind them.</p><br/><p>A clean, pure Japanese girl with bangs was standing there. She was wearing a traditional black kimono with a sakura pattern, and a hairy white-fur cloak was around her neck.</p><br/><p>Judging by her appearance, she had to be a good girl. Of course, no one could ignore the four strong bodyguards behind her.</p><br/><p>She didn’t smile as she stated the situation. Under the mask of her makeup, Jingzi's face had gotten pale.</p><br/><p>\"Ms.Tsutomu...\" Jingzi had to muster all her courage to speak as she trembled.</p><br/><p>I’m doomed. She came here for the man.</p><br/><p>The girl named Tsutomu didn’t even look at her. She was staring at Qin Guan, who was lost in thought.</p><br/><p>This was some dramatic life. The white girls had found their backbone again. They stood up in high spirits, while the black girls hid behind Jingzi silently.</p><br/><p>The girl in the kimono walked up to Qin Guan, her clogs clanking against the ground. She scanned him from head to toe, memorizing every detail of his face.</p><br/><p>\"Mr. Qin Guan, I’m the president of your fan club in Japan, Yamaguchi Tsutomu.\"</p><br/><p>\"Er… Hi...\" Qin Guan was wondering why those girls were so scared of her. He gently stretched his hand out as if comforting a child. \"I didn't see you at the copy sale. That was our first meeting. Take care of my fans, please.\"</p><br/><p>Yamaguchi Tsutomu blinked and took his hand in her small hand. Nodding, she said, \"Sure!\"</p><br/><p>Her hand was as cold as winter.</p><br/><p>\"It's cold today. Thanks for taking care of this for me. We’d better not idle outside. It’s a school day, right? Go back to class,\" Qin Guan told them. Although the girls were dressed strangely, they were actually quite young.</p><br/><p>Yamaguchi Tsutomu looked down at her right hand blankly. Qin Guan’s warmth was still lingering there.</p><br/><p>It was so warm!</p><br/><p>Yamaguchi slowly put down her hand. \"There is no class today at college.\"</p><br/><p>What? Are you kidding? That short girl is a college student?</p><br/><p>Qiuye explained, \"Ms. Tsutomu is the top student of the University of Tokyo. She manages our fan club! She is wonderful!\"</p><br/><p>Qin Guan smiled at her. She was a forthright girl.</p><br/><p>His warm smile made the crowd stand still in time and space. Even the bodyguards seemed to become gentler.</p><br/><p>Qiuye dared to ask the most important question, \"Mr. Qin Guan, how long will you be staying in Japan? Do you have any spare time today? Could we meet you? We could be your tour guides!\"</p><br/><p>Even Tsutomu looked at Qin Guan eagerly.</p><br/><p>Thinking of his tight schedule, Qin Guan realized time was pressing. He had to have a business meeting with Citizen.</p><br/><p> \"I’ll be returning to China tomorrow and I have some work to do in the afternoon,\" he said regretfully. \"I’m shopping with my agent right now. She will be coming soon. I’m waiting for her here.\"</p><br/><p>The girls sighed. Then they used the black girls as an outlet for their anger.</p><br/><p>\"You are wasting his time! Bastards! You destroyed our meeting!\"</p><br/><p>\"I hope Mr. Qin doesn’t think all Japanese girls are like you! Idiots!\"</p><br/><p>Qiuye kicked Jingzi on the knee, knocking her down to the ground.</p><br/><p>Qin Guan couldn't bear to watch. The Japanese girls seemed to take it for granted though. \"How could an ugly girl like you dare lay a finger on Qin Guan? You should kowtow for your sin!\"</p><br/><p>\"Right!\" the other girls echoed.</p><br/><p>You are taking this too far!</p><br/>\n</div>"}