{"title": "Chapter 297: Who Sent You Here?", "id": 297, "volume": 3, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-297-who-sent-you-here", "volume_title": "Volume 3", "body": "<h1>Chapter 297: Who Sent You Here?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 297: Who Sent You Here?</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The procurers left under the pressure of competition.</p><br/><p>Sister Xue and Qin Guan were still strolling around slowly. Housemaid Cafe, Feeling Bar, Inflatable Doll Store...</p><br/><p>\"Do you want something to drink, Sister Xue?\"</p><br/><p>They were both feeling awkward. Some Japanese girls were standing by the entrance greeting guests.</p><br/><p>\"Such a cutie!\"</p><br/><p>\"He’s so handsome!\"</p><br/><p>It was a pity that the girls were a little afraid of them. They were wary of foreigners. The clubs didn't accept foreigners, with the exception of some high-ranking night clubs. </p><br/><p>Sister Xue, who protected Qin Guan like a hen, let out a long breath of relief.</p><br/><p>She tried to distract Qin Guan. Pointing to a vending machine in the corner, she said, \"Buy a bottle of water for me. I’m thirsty.\"</p><br/><p>Thanks to his good eyesight, Qin Guan spotted the machine right away. He didn't go close to it though. It looked strange.</p><br/><p>\"What's the matter?\" Sister Xue stepped forward.</p><br/><p>Suddenly, a private door by the machine opened. A wretched man wearing a baseball cap walked out. He looked carefully at the buttons on the machine.</p><br/><p>Sister Xue cast a glance at the machine again and saw that it was not selling drinks. There were colorful belts inside it.</p><br/><p>The man took out his wallet and pushed some coins into the machine.</p><br/><p>Bang! A small box with a red ribbon fell at the sound. The man caught the box immediately. He tore the package apart to reveal a small red item made of silk.</p><br/><p>\"Wow!\" He took a deep sniff at it.</p><br/><p>Sister Xue was scared. She stepped closer to Qin Guan, who was tall enough to give her a sense of safety.</p><br/><p>\"What is he doing?\"</p><br/><p>\"If I didn't know any better, I’d say that’s the underwear of the girl who just serviced him.\"</p><br/><p>\"What? Are you kidding? Don't mess with me. I don’t understand the Japanese.\"</p><br/><p>\"It’s the truth. Look!\"</p><br/><p>The man walked to a game center across the street, brushing past Qin Guan and Sister Xue. The thin edge of lace underwear was visible through the pocket on his chest.</p><br/><p>\"Japan is not that far from China. How come there are so many crazy people here?\"</p><br/><p>\"Xu Fu brought only 500 virgins here [1]. You know the results of inbreeding...\"</p><br/><p>They left the street, making boring jokes. After walking another 50 metres into the area, they got a completely different feeling.</p><br/><p>The stores were larger there, and there were more mansions and apartments. There were gorgeous boards with the words \"Welcome, Foreigners\" on them. The boards were shining with countless neon lights.</p><br/><p>\"Hey, Qin Guan! Look at those photos! They are not professional ones.\"</p><br/><p>You should pay attention to our current situation. Are you analysing them professionally? The women on the streets are getting more and more. The clubs on this street must be strip clubs! We better leave!</p><br/><p>Qin Guan pulled Sister Xue away. She wanted to get a closer look at the men in the photos, but some strange men with smart style [2] blocked them.</p><br/><p>\"Hey bro, which club are you from? A stranger here, huh? Are you a newcomer? Did you come to steal guests from our domain?\"</p><br/><p>They shook their long, golden hair, which looked as dirty as a beggar’s.</p><br/><p>They sized Qin Guan up from head to toe jealously. The guy was handsome both in style and looks. Look at his slender legs! They looked farther and farther up until... You are too tall!</p><br/><p>The short men looked up at Qin Guan's face. He was in a grey coat without buttons. He looked capable and well-experienced.</p><br/><p>Putting his hands in his pockets, he shielded his female companion from them.</p><br/><p>His face though! Older men had told them that colorful hair and thick make-up would be helpful in attracting guests, but the man had clean hair without bangs. Even the most handsome man in Roppongi couldn't beat him. They were as different as diamonds and dirt.</p><br/><p>\"It must be a misunderstanding. A man like him can’t be a pimp. He must be a visitor...\"</p><br/><p>\"Are they both visitors?\"</p><br/><p>\"It's possible. We have to treat them.\"</p><br/><p>\"Piss off! I saw them first.\"</p><br/><p>What are you talking about? Do clubs accept male guests?</p><br/><p>Before they could get rid of them, Qin Guan saw a group of people walking towards them. They had a completely different style. At least, they had good taste in suits.</p><br/><p>\"Roppongi! Don't let them go! He’s one of them!\"</p><br/><p>It was the meeting place of the two biggest clubs. Qin Guan had accidentally gotten into trouble.</p><br/><p>\"Excuse me, but...\"</p><br/><p>[1] Xu Fu was a necromancer sent by the First Emperor of Qin (BC259-BC210) to seek an elixir overseas. He took 500 virgin boys and girls to an island far away from China, Japan Island nowadays. They lived and reproduced there. That was the origin of Japan.</p><br/><p>[2] A typical dressing style of Chinese young guys combining Japanese visual shock and western rock style.</p><br/>\n</div>"}