{"title": "Chapter 312: Notice From Overseas", "id": 312, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-312-notice-from-overseas", "volume_title": "Volume 4", "body": "<h1>Chapter 312: Notice From Overseas</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312: Notice From Overseas</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Sister Xue didn't pay any attention to the escaping sheep. Huang was still busy working with the crew, so Qin Guan returned to Beijing alone.</p><br/><p>Cong Nianwei picked him up at the airport. Qin Guan fastened his seatbelt and fixed his eyes on her.</p><br/><p>After being gone for a month, they had missed each other a lot. Distance couldn't beat a lover’s heart though.</p><br/><p>The telephone bill surprised Cong Nianwei, who was not used to taking money seriously. They had talked on and on about all the interesting things that had been happening while Qin Guan was away.</p><br/><p>Everything had remained the same at home. A day away from a dear one always seemed like three years. Cong Nianwei suddenly recalled something and asked Qin Guan about any news while he had been filming on the mountain.</p><br/><p>\"The confidentiality among your crew is not that good. I know a lot about your work.\"</p><br/><p>\"For example?\" Qin Guan murmured as he lay in bed.</p><br/><p>\"Lin Zhiying likes racing cars. There’s an affair between Hu Jun and Liu Tao. The bar street...\"</p><br/><p>\"Impossible! Director Zhang wouldn’t attract attention by using such a method.\"</p><br/><p>Qin Guan gradually lowered his voice until he fell asleep.</p><br/><p>Cong Nianwei covered him gently with a blanket. Sweet dreams.</p><br/><p>A good sleep always refreshed people. What a comfortable life!</p><br/><p>When he woke up, Qin Guan stayed in bed like a worm. Cong Nianwei patted his bottom angrily.</p><br/><p>Crack! What happened to my reserved girlfriend?</p><br/><p>\"Get up! Check your email! It's time for colleges to send acceptance notifications!\"</p><br/><p> Qin Guan picked up his laptop, murmuring, \"I have a hard-working girlfriend. I wouldn’t miss the notice.\"</p><br/><p>\"Don't get nervous over it. If we were accepted, we’ll get a notification later than the rejected students. Probably in two or three weeks.\"</p><br/><p>\"Are there any students who get rejected by colleges? You definitely don’t have to worry, you were recommended by your college.\"</p><br/><p>I’m worried about you!</p><br/><p>\"You are such a careless man. You might not even have read the recommendation letter your tutor wrote for you!\"</p><br/><p>Qin Guan wanted to cry. He had checked the application three times before sending it. Men had to look stronger in front of women though, so he tried to look confident. To be honest, he was actually very nervous. If he was rejected by every college, he would lose face.</p><br/><p>Although he had applied to several universities, he was not sure about any of them. If he didn’t get accepted by Columbia University and was kicked away to Massachusetts or California, he would be a peasant in the countryside, while Cong Nianwei would be a fashionable girl in a metropolis.</p><br/><p>Never! Wish me luck! Suddenly, he saw an email in his mailbox.</p><br/><p>With trembling hands, Qin Guan clicked on the email that would influence his sex life in the future.</p><br/><p>\"Ha ha! I passed!\"</p><br/><p>He pulled Cong Nianwei over in excitement, sharing his happiness with her.</p><br/><p>Cong Nianwei jumped up and opened her own mailbox. She found a similar email.</p><br/><p>Their hearts were finally at rest. What a good feeling!</p><br/><p>\"Now we can only wait for their official notice. I’ve heard that we have to prepare a lot of paperwork, like XX, XXX...\"</p><br/><p>Hey, Weizi! We have several months to prepare for that!</p><br/><p>Qin Guan bit the inside of his cheek by accident. \"Ouch! It hurts!\"</p><br/><p>We should celebrate today!</p><br/><p>Qin Guan put on his clothes and got ready to go out. Cong Nianwei was standing beside him, watching him.</p><br/><p>\"Qin Guan?\"</p><br/><p>\"Yes?\"</p><br/><p>\"Don't cause me any trouble until we leave China. Be careful with your affairs. Otherwise, I’ll ...\"</p><br/><p>\"Why do you say that?\"</p><br/><p>Liu Jia’s eyes suddenly emerged in Qin Guan's mind. He smiled with a guilty conscience.</p><br/><p>Would that girl cause me trouble? I should confide in my girlfriend later.</p><br/><p>Cong Nianwei shared her experience with Qin Guan. \"Some seniors said that the notice doesn’t mean there will be a final offer. It’s said that some famous colleges with too many applicants cancel some admissions every year.\"</p><br/><p>\"Any harmful news about the applicants would influence the final results.\"</p><br/><p>Qin Guan was scared. Would an affair be considered harmful news in such a free country?</p><br/><p>Of course! Tutor Martin, who had accepted Qin Guan as his student, was actually watching the video sent to him by his old friend.</p><br/>\n</div>"}