{"title": "Chapter 315: We Wish You A Happy Future!", "id": 315, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-315-we-wish-you-a-happy-future", "volume_title": "Volume 4", "body": "<h1>Chapter 315: We Wish You A Happy Future!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 315: We Wish You A Happy Future!</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Stop crying! Be strong!\" A tomboy turned her head around with red eyes.</p><br/><p>It was wonderful to express their feelings together to Senior Qin before he left. She did not mind if they got sneered at.</p><br/><p>They just wanted to comfort their maiden hearts.</p><br/><p>They didn’t wish to be accepted. This was just a result of their love. They started crying loudly, astonishing the rest of the graduates.</p><br/><p>Huang Jiajia was also astonished. She watched the girls, who had runny noses and tears on their faces.</p><br/><p>.</p><br/><p> The fan club is out of my control. They are all confessing their love for my prince! Impossible! Qin Guan is mine! He might have a girlfriend, but I’m the first runner-up! I just used them to bother him on campus!</p><br/><p>Suddenly, Mou turned around. \"Senior Qin, may I hug you?\"</p><br/><p>What? Mou Xiaoliu! You’re betraying me! You cunning bear!</p><br/><p>\"Okay,\" Qin Guan answered in confusion. Mou hugged him right away.</p><br/><p>Ouch! I forgot about her strength! \"Be… careful… My… back… hurts!\"</p><br/><p>Qin Guan tried his best to speak.</p><br/><p>\"Senior Qin, I’m sure about my feelings. I love you, but I will move on and live a happy life. Cheer up! I wish you a happy future!\"</p><br/><p>Mou looked up with a splendid smile. She looked like a newborn baby. She let Qin Guan go and took a few steps back, waving at him.</p><br/><p>Cheers! We will always be with you!</p><br/><p>\"Mou Xiaoliu...\"</p><br/><p>Huang Jiajia looked at Qin Guan with watery eyes. Suddenly, she paused.</p><br/><p>Qin Guan spread his arms out towards her. \"I’m leaving. Do you want a hug?\"</p><br/><p>He was still the tutor saving her from trouble.</p><br/><p>He was still the fighter protecting her.</p><br/><p>He was still the good-tempered man spoiling her.</p><br/><p>He was still the older brother smiling at her mistakes.</p><br/><p>\"Thank you!\" Huang Jiajia smiled, looking as gorgeous as a rose. \"Goodbye!\"</p><br/><p>She left, leaving Qin Guan's embrace empty. She was a proud girl. The knot in her stomach was finally untied.</p><br/><p>\"I wish you a happy future,\" Qin Guan murmured with gratitude. Suddenly, he felt several shameless hands on his body.</p><br/><p>\"Senior Qin, may I have the second button on your shirt?\" [1]</p><br/><p>Hey, you read too many Japanese comic books! Let me go!</p><br/><p>Laughter was heard all over campus. Qin Guan wished safe sailing to all the students rubbing their hands in anticipation of his departure!</p><br/><p>The train took Mu Lejiang and Ayimina away. They returned to their hometown of Mu, where the Northwestern branch of the Bank of China was located. Mu would do his bit to help his hometown, in accordance with the national plan designed to develop the Great Northwest.</p><br/><p>It was rare to see a student engage in finance there. Mu would have a bright future.</p><br/><p>All his roommates saw him off at the station. He was the first to leave college.</p><br/><p>The day before, they had had a celebratory feast at the small restaurant next to the campus. The dishes there seemed especially delicious, as it was their first time visiting the restaurant.</p><br/><p>The prices were also reasonable. The prices of meat dishes had increased from eight yuan to ten yuan during the past four years. If they had three traditional cold dishes, they could drink overnight.</p><br/><p>The restaurant was crowded during graduation season. There were familiar faces everywhere.</p><br/><p>\"Hi, Lao Xu! It's you! Sit with us! Waiter, one more pair of chopsticks!\"</p><br/><p>Graduates talked on and on. They talked about the first time they had met at their dormitories, about the girls they had pursued together, about the farce caused by a bowl of instant noodles...</p><br/><p> Brother sleeping on the upper bunk, take care of yourself in the future. I will see you off before I leave. Please keep my face in your memory.</p><br/><p>...</p><br/><p>Men do not shed tears easily. When the train left the platform though, Qin Guan was surprised by Liu Xiaoyang’s calmness.</p><br/><p>He remained terribly calm during Mu’s departure, even though Mu had always treated him like a younger brother.</p><br/><p>\"Ah! Brother Mu!\"</p><br/><p>The staff of the railway station were scared by Liu’s sudden cry. The train had left for a long time by then. What was the young man chasing after?</p><br/><p>Liu kept running with tears and snot on his face, as if he had just understood what Mu’s departure really meant.</p><br/><p>This time, they wouldn’t meet after vacation. There would be distance between them forever. The crazy boy ran back fast. \"He is gone! Really gone! We are not six roommates anymore!\"</p><br/><p>[1] It’s the button closest to one’s heart.</p><br/>\n</div>"}