{"title": "Chapter 314: Melancholy", "id": 314, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-314-melancholy", "volume_title": "Volume 4", "body": "<h1>Chapter 314: Melancholy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 314: Melancholy</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>In fact, the J Clothing boss had blind faith in Qin Guan. He had been planning on opening stores overseas since the previous year.</p><br/><p>The small company had started its business by selling shirts. It had taken the man two years to purchase three plants and open hundreds of stores all over China.</p><br/><p>Half a year earlier, he had purchased a new production line engaging in clothing exports. All those things were trials before the bigger expansion. Low labor cost was his best weapon in competing with foreign companies.</p><br/><p>The ambitions of J Clothing went far beyond a small store in Manhattan. He had also started negotiating with Walmart and other large shopping malls.</p><br/><p>He would test the brand in New York City. Cheap shirts and T-shirts with stamps were his biggest hope.</p><br/><p>Surrounding a city with villages was a traditional Chinese wisdom. There would come a day when \"Made in China\" would occupy American people’s lives. It would be a battle without smoke or gunpowder.</p><br/><p>J Clothing had made changes to their contract for the next year. According to their evaluation of Qin Guan, as well as his progress in Asia, the boss had thought that Qin Guan would be aiming for Japan and South Korea. Little had he known that Qin Guan would go to the US. Things had turned out really well for him. He had invested all his capital in the US, putting all his eggs in one basket.</p><br/><p>Sister Xue was shocked by the two-year contract, which would earn Qin Guan 500,000 yuan a year.</p><br/><p>It made Qin Guan feel confident, considering that he was facing an unknown future. It was much better than those short-sighted Japanese brands.</p><br/><p>Sister Xue answered sincerely, \"Don't worry. I’ll give the contract to our legal department. We’ll send it back with our signature.\"</p><br/><p>\"It was nice doing business with you!\"</p><br/><p>\"Same here!\"</p><br/><p>They shook hands without saying anything else.</p><br/><p>It would be a mutual effort in a strange country and a complicated city.</p><br/><p>Quiet days flew by faster. The sense of watching sand gradually fly away between one’s fingers always made people melancholy.</p><br/><p>Thanks to his hard-working girlfriend, Qin Guan had a lot more spare time than other people. As he idled around on campus, he felt melancholy about every familiar thing.</p><br/><p>All his roommates were busy with their own courses or jobs. There were more and more talent fairs held at their college.</p><br/><p>There were small tables everywhere with boards with the title of the company or unit on them. They reminded the senior students that they would be leaving college to pursue their own futures.</p><br/><p>Registration day was just like the day before. There were subtle expressions on everyone’s young faces.</p><br/><p>Lovers smiled, cried and hugged each other. The reality of joy and sorrow broke into their ivory towers.</p><br/><p>Acquaintances rushed to greet each other and leave. Students looked nervously at the recruiting tables.</p><br/><p>Farewell, youth. Farewell, college years.</p><br/><p>All the annoying and happy events that had happened during that time were gone with the wind. Everyone looked back and saw nothing.</p><br/><p>Hats and scarves were thrown into the air. Diplomas were waved high. Those precious moments and faces were recorded in pictures.</p><br/><p>Graduation day was not just the conclusion of the previous four years, but also the start of their future professional lives. They had shared that short time with each other, as well as their joy, blessings and wishes.</p><br/><p>As the most handsome guy there, Qin Guan was easily recognizable among the crowd.</p><br/><p>He finished his conversation with the monitor in the woods. When he turned around, he saw a group of strangers standing behind him.</p><br/><p>The leaders of the group were Huang Jiajia and Mou Xiaoliu.</p><br/><p>Finally, the day had come. Qin Guan smiled with ease and melancholy. The young girls had grown up.</p><br/><p>\"Congratulations on your graduation,\" Mou said, speaking up first. Then she fell silent.</p><br/><p>What shall I say? We are only mere acquaintances. As a person on a completely different life track, I have nothing to say. </p><br/><p>\"Rubbish. Graduation is as easy for him as eating.\"</p><br/><p>Huang Jiajia was much more beautiful now. She was no longer the childish girl that she used to be. Pride granted her a special attitude.</p><br/><p>She had her own unique charm.</p><br/><p>\"Tell me, how are you getting along with your girlfriend?\"</p><br/><p>Her baby face suddenly emerged in Qin Guan’s mind. As he thought of Cong Nianwei, his smile became softer.</p><br/><p>\"We are doing well. Thank you for your concern.\"</p><br/><p>Huang Jiajia choked up.</p><br/><p>\"What are you doing here? Did you come for me?\"</p><br/><p>The group of girls looked excited. Qin Guan was familiar with some of them, but a few of them were younger.</p><br/><p>A brave girl looked around and waved her hands. Her companions shouted in one voice, \"Senior Qin Guan! We all like you! We wish you a happy future!\"</p><br/><p>All the different voices were in harmony. Some sentimental girls couldn't help but cry.</p><br/>\n</div>"}