{"title": "Chapter 320: The Eight-Nation Alliance", "id": 320, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-320-the-eight-nation-alliance", "volume_title": "Volume 4", "body": "<h1>Chapter 320: The Eight-Nation Alliance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 320: The Eight-Nation Alliance [1]</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Joseph hadn’t expected his new neighbours to be so handsome. He felt ashamed of his behavior now.</p><br/><p>Cong Nianwei was surprised by his impudence, but she smiled at their guest. \"Welcome! Take a seat. I’ll get a plate for you. Where are you from?\"</p><br/><p>\"Wow!\" Joseph was impressed by the dishes. He suddenly forgot about his shame. \"I’m German. I’m from Hamburg.\"</p><br/><p>Aha! A German who is not punctual!</p><br/><p>Before Qin Guan could close the door, another visitor came.</p><br/><p>\"Aha! Your door is open! I knew Joseph would want to visit the new neighbours first. He is so shameless. How do you do? We are the handsome brothers from France, Batiste and Batisler. These are welcoming presents. We hope you’ll like them.\"</p><br/><p>Hey! I didn't invite you in!</p><br/><p>Qin Guan looked at the small, dirty flowers in his hands. They looked like wildflowers picked by the side of the road.</p><br/><p>Qin Guan didn't know what to do with them. I’ll throw them away after they leave.</p><br/><p>Suddenly, there was another knock.</p><br/><p>Qin Guan couldn't help but shout towards the hallway, \"Is there any other customer out there?\" </p><br/><p>Suddenly, the small apartment was full of visitors.</p><br/><p>\"Oh, my! Such good friends!\"</p><br/><p>The new visitors had brought folded chairs with them. They had even known how many chairs Qin Guan had. All their neighbours were there. Cong Nianwei began to boil rice again.</p><br/><p>The real problem was that Coulibaly’s present was a small golden leopard. He was a real local tyrant!</p><br/><p>The group suddenly pointed a finger at the young African man.</p><br/><p>\"What do you mean by that?\"</p><br/><p>\"You are trying to be special! We just wanted to express our appreciation!\"</p><br/><p>\"Cella and her sisters only brought Mexican pancakes. Why did you take this so seriously?\"</p><br/><p>\"Did you know that the ancient Chinese thought gold was bullsh*t?\"</p><br/><p>Stop! The ancient Chinese wouldn't agree with you!</p><br/><p>The three girls were smiling. Even the rings on their tongues couldn’t suppress their appetite. They all shouted at Cong Nianwei, \"Hey, hot chick! The guests are waiting for you. Stop your work for a while.\"</p><br/><p>Cong Nianwei smiled at the self-invited guests. So many strange things going on around here! It seems like we won't be lacking any joking material in the future.</p><br/><p>Qin Guan and Cong Nianwei sat by the table. Their foreign guests were looking at them like poor puppies waiting for food. The lure of the delicious dishes distracted them from the perfect appearance of the young man.</p><br/><p>Qin Guan wisely did not give a welcoming speech. \"Everyone here looks hungry. Let’s eat first and chat later!\"</p><br/><p>\"Wow! Great!\"</p><br/><p>\"Okay!\" they all echoed before digging in.</p><br/><p>Cong Nianwei and Qin Guan suddenly realized that the Mexican pancakes were the girls’ own staple food, not a present for them. They had originally planned on standing outside their apartment and eating the pancakes there. Little did they think that the new neighbours would be so generous.</p><br/><p>The three girls were eating the beef and soup in combination with their pancakes. The Batiste brothers watched Coulibaly eat using the traditional eating method of his tribe: hand picking. They sped up themselves and stopped trying to look elegant.</p><br/><p>\"Ouch!\" Coulibaly realized this was boiled beef.</p><br/><p>Joseph, who was calmly looking at his plate, pointed to the shredded potatoes with his fork. \"What's this?\"</p><br/><p>\"Shredded potatoes. Try them.\"</p><br/><p>\"Can potatoes be shredded into such thin threads? Are you kidding?\"</p><br/><p>\"We used a shredder.\"</p><br/><p>Joseph picked up several threads and put them into his mouth carefully. What a magical country! They spend so much time on potatoes! They taste f*cking wonderful! I have never had such delicious food before!</p><br/><p>The strict German put down his fork and put his hands to use. The fat boy called Batiste, who was lazy and greedy, found the situation unfavorable to him.</p><br/><p>Who said the French were elegant? Bullsh*t! He threw his knife and fork away.</p><br/><p>The scene reminded Qin Guan of his own roommates. He soon got lost down memory lane.</p><br/><p>Cong Nianwei estimated the quantity of the leftover food silently. The beef was 1.5 kilos. Sure enough, the foreigners were greedy with meat. In the warm evening, Cong Nianwei forgot that she was a foreigner in a strange country herself.</p><br/><p>Dinner was the best bridge between people from different races. Several minutes later, there were people with full stomachs sitting around the table.</p><br/><p>Now the guests had the time to observe their new neighbours and vice versa, Cong Nianwei and Qin Guan were also observing them.</p><br/><p>It is said that one’s face is the mirror of their heart. The appearance of the strangers was quite different from their ancestors’ pictures. The Latin girls had tattoos on their faces, and so did the black guy.</p><br/><p>[1] A metaphor, referring to the forces that invaded China in 1900, including the US, the UK, France, Germany, Russia, Japan, the Austrian-Hungarian Empire and Italy.</p><br/>\n</div>"}