{"title": "Chapter 322: The German Sun", "id": 322, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-322-the-german-sun", "volume_title": "Volume 4", "body": "<h1>Chapter 322: The German Sun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 322: The German Sun</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> Everyone there was much more fierce and irritable, not just because of the alcohol, but also because of their own characteristics.</p><br/><p> A guy with long hair standing like a snake had been provoking Qin Guan and Cong Nianwei for a long time.</p><br/><p> As a frequent patron, he knew that people would hit on him if he stood in the spotlight.</p><br/><p> He was clever enough to find a place near the counter.</p><br/><p> He was right. After a couple of songs, there was quarrel in the hall. The crowd parted, leaving space for a person rolling out ahead and another one chasing them.</p><br/><p> They knew the rules well. They had their fight by the edge of the room, automatically avoiding the counter.</p><br/><p> The crowd gathered again, paying no attention to the follow-up. Even the security staff standing by just cast an indifferent glance at them and turned their heads around.</p><br/><p> Interesting. If this had happened in China, they would have been stopped right away. People there seemed uninterested in other people’s affairs though.</p><br/><p> Qin Guan wanted to take his girlfriend away, but she was sitting happily with their neighbours. She should have had some sunflower seeds in her hand.</p><br/><p> There were idlers everywhere. By that time, Joseph had ordered his third cup of beer and was discussing the concrete uses of martial arts in real life.</p><br/><p> The man beaten by his opponent was sad to hear the commentary. Nobody would want to hear such comments when they were suffering a beating.</p><br/><p> The winner was also annoyed by the narrator, who was querying his IQ and analysing his actions in a disdainful manner.</p><br/><p> \"Shut up!\"</p><br/><p> \"Shut up!\"</p><br/><p> The two men shouted at Joseph in one voice.</p><br/><p> Huh? What’s happening? I was whispering under the cover of loud music.</p><br/><p> Qin Guan pulled the confused boy away, reminding him not to irritate other people.</p><br/><p> \"F*ck!\"</p><br/><p> Joseph was calm though. \"See?\" he told Qin Guan. \"English speakers are short on words and expressions. They don't even know how to curse without using the word f*ck.\"</p><br/><p> Qin Guan wanted to agree with him, but he couldn't say anything. He realized that Joseph had just insulted the two men.</p><br/><p> It was strange, but the other guys did not seem anxious. They were looking at Joseph as if they were watching an actor.</p><br/><p> Aren’t you too cruel with him? He’s tall, but he doesn't look like a good fighter. If something happened to him, I’d give him a hand.</p><br/><p> The two men rushed up to Joseph and attacked his face with their large fists.</p><br/><p> \"Be careful!\" Suddenly, Joseph squatted down and set his glass on the counter. He was not a strict commentator anymore.</p><br/><p> The two guys couldn't draw their fists back in time. Missing their target, their fists collided with Qin Guan, who was standing behind Joseph.</p><br/><p> \"Ah!\" Cong Nianwei couldn't help but scream. Despite her high IQ, she could do nothing but scream as she faced the wide gap between two different forces.</p><br/><p> The others failed to run for help. They were all too stunned to move. Even the straw in Bastie’s mouth fell to the ground.</p><br/><p> The handsome boy would get disfigured after those two blows!</p><br/><p> ...</p><br/><p> Potential was always maximized during a crisis. Qin Guan’s brain automatically issued an order, manipulating his nervous reflexes.</p><br/><p> There were only several centimetres between the fists and his body, when Qin Guan suddenly moved.</p><br/><p> The onlookers only saw a pair of black-framed glasses flying in the air as the owner disappeared in a flash.</p><br/><p> Actually, Qin Guan hadn’t even moved his feet. He had bent 90 degrees, as if he was limbo dancing. His movement was clean-cut and clear.</p><br/><p> The two guys realized their mistake and retreated. The threat had been minimized temporarily.</p><br/><p> Qin Guan stood up again.</p><br/><p> The crowd applauded him.</p><br/><p> \"I told you he was a dancer. He will become famous on Broadway!\"</p><br/><p> Joseph was no longer the focus of the conversation. His enemies had been shocked by Qin Guan.</p><br/><p> And God said, \"Let there be light; and there was light.\"</p><br/><p> The onlookers saw someone shiner in front of them. The boy who had lost his glasses during the fight revealed his real beauty before them.</p><br/><p> They thought it was miracle.</p><br/><p> \"Wow!\"</p><br/><p> As sophisticated New Yorkers, they came back to their senses fast. Cheers and whistles were heard everywhere. This was what rebelling, frivolous American boys were like. Joseph though, who had no idea what was going on, thought that they were challenging him and Qin Guan.</p><br/><p> You think your master is scared? Just wait till you experience the German Sun!</p><br/>\n</div>"}