{"title": "Chapter 331: The Quintessence of Chinese Culture", "id": 331, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-331-the-quintessence-of-chinese-culture", "volume_title": "Volume 4", "body": "<h1>Chapter 331: The Quintessence of Chinese Culture</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 331: The Quintessence of Chinese Culture</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Qin Guan, help him...\"</p><br/><p>\"What? I can’t...\"</p><br/><p>\"Yes, you can! I know Teacher Rong trained you. You are a clever guy. You can even tell a story in a Beijing dialect using a drum. The Peking Opera is nothing compared to that. Surely, you must be good at it!\"</p><br/><p> Qin Guan couldn't explain to his girlfriend. He had been trained in Mei School [1], which had been selected by Teacher Rong for his job. He had played a young lady in a Peking Opera.</p><br/><p> What would he teach to the monkey? How to cast soft glances?</p><br/><p> Xu Xiaoxia was also a smart boy though. He could see that Qin Guan was an opera actor. Besides, according to his girlfriend, Qin Guan had learned from a great master.</p><br/><p> \"Master! Help me!\"</p><br/><p> I’m not Tang Monk [2].</p><br/><p> Xu pulled Qin Guan's sleeve.</p><br/><p> \"Help me! I want to make a great impression at the birthday banquet!\"</p><br/><p> Xu was anxious about the banquet. He had been born into a big family, whose main talent was the lively power of reproduction. His grandfather had three brothers, and they had their own sons and grandsons.</p><br/><p> It was hard to stand out. Xu had to compete for attention. It was a pity that, although he was a favorite in his own family, he was a nobody for others.</p><br/><p> He was the eldest son of his father, so as a child he had been taught to hide his weak points.</p><br/><p> \"But I acted out young men's and women’s roles. I know nothing about martial arts roles.\"</p><br/><p> Qin Guan and Xu looked at each other silently. Elderly people liked lively, joyous plays for birthday celebrations. What could they do?</p><br/><p> Cong Nianwei was more observant than the two boys. \"You two are silly! ‘Ma Gu Congratulating Birthday’ is the most authentic Peking Opera. Xu is not a strong man, so he could play Ma Gu.\"</p><br/><p> Xu really liked her proposal. It was much better than performing \"Monkey King Defeats Pan Jinlian\". Both he and Qin Guan approved of the idea.</p><br/><p> \"Let's get down to business.\" Xu thought that Qin Guan would arrange a schedule for him, but he pointed to an empty table instead. \"Dumplings, please. We are hungry.\"</p><br/><p> Xu had an idea. He pointed to the stage and said, \"Qin Guan, if you perform on the stage right now, well or not, I’ll give you a 70% discount in the future.\"</p><br/><p>\"Really? Are you serious?\"</p><br/><p>\"Of course. I’ll get you a golden card.\"</p><br/><p> \"Deal. A hungry bear doesn’t dance though. Boil those dumplings for me. They have to be ready by the time I’m finished.\"</p><br/><p> Cong Nianwei was happy with the deal. Prices in New York were very high. They had made some calculations overnight and realized they would be needing about 100,000 dollars a year, tuition fees not included. Even the amount they paid for a meal was important to them.</p><br/><p> \"Put some makeup on backstage.\"</p><br/><p> Qin Guan saw Su San taking off her dress at the backstage area. Even though she was a professional Peking Opera actor, she was satisfied with the pay there.</p><br/><p> The classmate of the boss’ son will improvise on the stage. The middle-aged lady sighed.</p><br/><p> Those foreign Chinese kids are ruining the quintessence of Chinese culture. Before she could get a grip, Qin Guan finished his makeup.</p><br/><p> He drew on delicate eyebrows, pinned some flowers on his hair and brushed a bit of rouge across his cheeks. Soon, the handsome young man had become a beautiful lady.</p><br/><p> Waving his long sleeves, Qin Guan opened his mouth and said, \"Xu Xiaoxiao, show me the way to the stage...\"</p><br/><p> Perfect!</p><br/><p> Su San stood up excitedly, nearly kicking off her chair. Impossible! Surely, this doesn't mean... I have to keep watching!</p><br/><p> \"Ah! It’s an order from the goddess from the abode of immortals. I’m turning around and picking up a jar of wine...\"</p><br/><p> Making the orchid gesture, Qin Guan started singing a beautiful melody. His expression, gestures and posture were all attractive. He looked like a really beautiful girl on stage.</p><br/><p> It was like a dream!</p><br/><p> The foreign customers were shocked. What a charming girl! Their saliva was dripping like the Niagara Falls!</p><br/><p> Qin Guan finished his performance and returned to the backstage area. Su San grabbed his arm. \"Who was your mentor?\"</p><br/><p> \"Teacher Rong...\" Qin Guan stared at the lady in confusion. Xu Xiaoxiao came back to his senses and rushed up to them. \"What are you doing? Let him go!\"</p><br/><p> \"Teacher Rong?\" Is that a master of the Peking Opera in China?</p><br/><p> \"Teacher Rong recommended that I study with Mr. Hu Wenge. He was the one who taught me.\"</p><br/><p> \"That explains your style. How about Ms. Li Susheng? Is she any good?\"</p><br/><p> Li Susheng was another follower of the Mei School from the same generation as Hu. Qin Guan nodded. \"She is fine. She performs often on stage and has many followers.\"</p><br/><p> Su San loosened her grip on Qin Guan’s sleeve and sighed in relief. My teacher is living a happy life. She wasn't that angry with me, even though I quit.</p><br/><p> The boy had given a good performance, even though he had just had a few lessons on the Peking Opera. It seemed that her struggle to carve a path for the Peking Opera in foreign countries had been wrong.</p><br/><p>There was no room for the Peking Opera there. She had become rusty after all those years. Besides, the foreign audience under the stage was not really interested in the Peking Opera.</p><br/><p>[1] A famous genre of Peking Opera</p><br/><p>[2] In \"Journey to the West\", Tong Monk was the master of the Monkey King</p><br/>\n</div>"}