{"title": "Chapter 349: Hands Up", "id": 349, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-349-hands-up", "volume_title": "Volume 4", "body": "<h1>Chapter 349: Hands Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 349: Hands Up</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Actually, his unspoken words were \"Chase me\"!</p><br/><p>The three men were shocked by his shout. Taking advantage of this, Qin Guan ran away at full speed.</p><br/><p>Don’t laugh at those guys for wearing tracksuit pants and running shoes. Maybe they were from the US. That was a Rule of Living there.</p><br/><p>Qin Guan ran down the empty street without scruple. If he could get away from that isolated alley, he would be able to get to his apartment building, where someone might come to his aid. Encouraged by that thought, Qin Guan ran like a vigorous tiger.</p><br/><p>Unfortunately, there were certain shortcomings between different races.</p><br/><p>Which race was the best at running? The black race... Which race was the strongest in the world? The black race...</p><br/><p>The wind roaring in their ears cheered them up, reminding them of the traditional honor of their race. Black men like us can’t catch up with a f*cking Asian? That’s ridiculous!</p><br/><p>Qin Guan was getting closer to the building. He was hurriedly looking for his key in his pocket. Key! Key!</p><br/><p>Suddenly, a swift, violent wind blew by him. The shortest black man was blocking his way.</p><br/><p>\"Bro, calm down!\" Qin Guan was disappointed by the lack of witnesses. By the time the police arrived, he might only be left in his underwear.</p><br/><p>Just before he surrendered to his enemies though, his savior showed up out of the blue.</p><br/><p>\"Who dares cause trouble on my turf?\" It was the German guy.</p><br/><p>Joseph was standing by the entrance with his bag. He seemed to have just returned from college.</p><br/><p>\"What are you doing here?\" one of the black men said in German. Qin Guan was confused. Those black guys could speak German? Joseph could speak English!</p><br/><p>When he turned around, Qin Guan saw the three guys step back together with a serious expression.</p><br/><p>They had only taken one step away. The three men living at the bottom of society were not kind-hearted.</p><br/><p>\"We’re robbing him... Mind your own business...\"</p><br/><p>Then they saw Joseph clearly under the lamp light. Letting out a breath, they became arrogant again.</p><br/><p>It’s only a student. So what if he’s German? They were planning on robbing them both.</p><br/><p>Before they could show their knives again though, the tall German guy took out a black pistol from his bag calmly. The cold shining barrel was pointed at them.</p><br/><p>\"Knives down! Hands up!\" he said in fluent English.</p><br/><p>Qin Guan thought that things were not going well. He rushed up to Joseph, but his effort was unnecessary.</p><br/><p>The three guys threw their knives to the ground and kneeled down without hesitation. \"Bro, spare our lives. We just wanted money. We’re no pimps or drug dealers.\"</p><br/><p>Surprised, Qin Guan stood next to Joseph by the entrance.</p><br/><p>\"Shall we call the police?\"</p><br/><p>\"Are you kidding? There’s no point. What if they cause trouble for you every day after they are bailed out? Better save yourself that trouble. Let’s go inside.\"</p><br/><p>They entered the building and closed the door behind them. The three guys left with their knives.</p><br/><p>\"Thank you so much...\"</p><br/><p>Qin Guan expressed his sincere appreciation to Joseph. He was in no mood to ask about the gun. Joseph didn't take it seriously. Before entering the room, he said, \"There are some rugby league matches in a few days. Could you please ask John to lend us Susanna's cheerleading squad?\"</p><br/><p>\"Why? You have your own cheerleading squad, don’t you?\"</p><br/><p>\"The Columbia basketball team always comes first. The rugby team comes second,\" Joseph answered awkwardly. \"All the beautiful girls are on their team... We are ashamed of having the ugliest ones, so we borrow theirs every time.\"</p><br/><p>\"Okay, I’ll ask him. Wait for word from me.\"</p><br/><p>\"Thanks!\"</p><br/><p>Alas! Beauties were always energetic. What miserable lives were the members of the rugby team leading!</p><br/><p>Qin Guan arrived home safely. Meanwhile, Xu Xiaoxiao was in trouble. Yamaguchi Tsutomu had gone to his grandfather’s party with evil intentions.</p><br/><p>Japan was the only country where her gang was active. Yamaguchi-gumi [1] was both good and evil. They were involved in both politics and business. They openly controlled the business of black and white people.</p><br/><p>There was an old saying about brave people and how they always succeeded. That year, Yamaguchi-gumi saw that they had a chance in the US and took it.</p><br/><p>[1] The largest gang in Japan.</p><br/>\n</div>"}