{"title": "Chapter 343: Saving A Beauty", "id": 343, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-343-saving-a-beauty", "volume_title": "Volume 4", "body": "<h1>Chapter 343: Saving A Beauty</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 343: Saving A Beauty</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan’s fierce performance had overwhelmed them. The outfit did not look like it had been made for slender models, but for valiant soldiers.</p><br/><p>Tough, but not rough. Idealistic, yet practical. The concept of the outfit had been interpreted perfectly by him.</p><br/><p>\"Pass?\"</p><br/><p>\"Pass!\"</p><br/><p>Qin Guan's name was circled on the list.</p><br/><p>Qin Guan had no idea about the final result, but he was confident. He had done his best, so he didn't care about the outcome. Actually, he owed this attitude to the money in his pocket. Several years ago, he would have even washed dishes at a restaurant in Chinatown for 500 dollars.</p><br/><p>As he walked along the dark corridor looking for the elevator, Qin Guan suddenly heard cries and moans from the end of the hallway.</p><br/><p>To go or not to go, that was the question. He was in an unfamiliar place, so he didn't want to poke his nose in other people’s business.</p><br/><p>This seemed to be the only way to the elevator though. Maybe those people hadn’t expected that someone would use that corridor to get to the elevator.</p><br/><p>Having no other way to go, Qin Guan kept walking down the hallway. He was a tall man, so he could see into the room through the window. Suddenly, his eyeballs nearly dropped out of his sockets.</p><br/><p>This had to be the interview room for the underwear models. However, all the equipment inside had been shut off and the staff had left. Several dim lights and a shining laptop revealed that there was still someone inside.</p><br/><p>There were several blankets spread on the floor. A naked girl was trembling, facing in Qin Guan’s direction.</p><br/><p>The man, who was standing with his back to Qin Guan, seemed to be a photographer, but Qin Guan had no clue what he looked like or how old he was.</p><br/><p>\"Lisa… Yes, baby... Like this... Hold me...\"</p><br/><p>Qin Guan glanced at his private parts. It was disgusting! They were wearing no underwear. Of course, this was some kind of deal. New models would do anything for their career.</p><br/><p>Speeding up, Qin Guan tried to walk past the room. Out of sight, out of mind. Little did he know that the trembling girl would look up and spot him right away.</p><br/><p>The photographer closed his eyes, waiting for her silently. Taking advantage of this, the girl mouthed something silently at Qin Guan.</p><br/><p>\"Help...\"</p><br/><p>There were several freckles on her fair skin. She looked like a little girl. No wonder that she had been held back alone. A girl with no idea of how the circle worked was the best prey.</p><br/><p>Qin Guan couldn’t stand to watch the young girl, who seemed to be the same age as Huang Jiajia. He stopped in his tracks. He couldn't just break in like that. Nothing had happened yet. Besides, the scared girl might take the photographer's side.</p><br/><p>Thinking of that, Qin Guan put his backpack down in the corner and picked up a torn maintenance uniform from a storage compartment.</p><br/><p>It must have been left there by the staff of the building. Qin Guan put it on, not caring about the dust or the smell.</p><br/><p>Then he shouted loudly in the darkness, \"Hello! Is anybody inside? Night maintenance! We‘ll cut off the power in a while. We’re doing routine checks on the rooms.\"</p><br/><p>He walked on with slow, heavy steps, as if knocking on pipes.</p><br/><p>Frightened, the photographer opened his eyes and put on his pants in a hurry.</p><br/><p>\"Lisa, put on your clothes. So much for today...\"</p><br/><p>He would be embarrassed if he was caught like that. If it had been a staff member, the photographer would have bore a grudge against them, but a maintenance worker was hard to deal with.</p><br/><p>If the worker saw them, he might take photos of them. He was famous in the fashion circle after all. The photos would attract an audience.</p><br/><p>He cast a disappointed glance at the young girl and put on his pullover. Leaving the equipment on the table, he dashed out.</p><br/><p>\"Hey, bro! Watch it!\"</p><br/><p>The photographer crashed into Qin Guan’s shoulder. He looked back at him without a word. That worker is really handsome. It’s a pity he’s not a model!</p><br/><p>Qin Guan didn't speak much for fear of betraying his identity. He carried on his duty in a bold, generous manner. \"Is anybody inside?\"</p><br/><p>Qin Guan was getting closer to the room. The photographer sped up and nearly stumbled over something in the dark corridor.</p><br/>\n</div>"}