{"title": "Chapter 341: A Difficult Interview", "id": 341, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-341-a-difficult-interview", "volume_title": "Volume 4", "body": "<h1>Chapter 341: A Difficult Interview</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 341: A Difficult Interview</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> \"I’m a professional talent agent. My company is the most famous entertainment firm in the country. I see star potential in you. If you are interested, call me anytime.\"</p><br/><p> \"Okay, thanks.\" Qin Guan stuffed the card randomly in his pocket without a pause. Then he kept walking, holding Cong Nianwei's hand. The man behind him shouted at him, \"You can reach me on my phone 24/7. If you are interested, just call me!\"</p><br/><p> \"Call me! I’m the best talent agent there is! Believe me!\"</p><br/><p> After several blocks, they finally got away from the man.</p><br/><p> Cong Nianwei looked at the card with curiosity. \"You have no agent in the US. Why didn't you consider his proposal?\" she asked.</p><br/><p> Qin Guan was hiding something, but he didn't want to tell Cong Nianwei about it. He threw the card in the nearest trash can without hesitation.</p><br/><p> \"Things here are not the same as in China. I’m a newcomer here. It would be a nightmare if I fell into the wrong hands.\"</p><br/><p> \"One can be austere if they have no selfish desires. That's me. I’m really firm, aren’t I? I wouldn't be forced to do something harmful to you though.\"</p><br/><p> \"You mean...\" This reminded Cong Nianwei of something. She sized Qin Guan up in an exaggerated manner. \"Well, you are capable of attracting criminals...\"</p><br/><p> Qin Guan hugged her around the shoulders, and the two of them headed home. \"I might have grown in the gutter, but I try to keep myself as pure as I can for you...\"</p><br/><p> A simple life was the best fate for an ordinary man. Qin Guan's part-time job hunt was going very well.</p><br/><p> Both THE NORTH FACE and Hollister had sent him emails. Only CK didn't respond for a long time.</p><br/><p> It was unbelievable. As a famous brand that had started its business by selling underwear, it was in big need of models for casual clothes and businesswear.</p><br/><p> Rest assured, Qin Guan hadn’t applied for the underwear position. He had applied for the apparel job.</p><br/><p> Just as he was thinking about it, his phone vibrated. He had received a short notice for a follow-up interview. He hadn’t gotten the job yet.</p><br/><p> Wow! This was really one of the top 10 brands in the world. The process was much more complicated than it was with other brands.</p><br/><p> Once they decided on a model though, they wouldn’t let them go easily.</p><br/><p> After class, Qin Guan gave his textbooks to Cong Nianwei. Looking at the setting sun, he told her, \"Go home first. Save some food for me.\"</p><br/><p> Cong Nianwei knew about his plans for that evening. He was wearing his business clothes after all.</p><br/><p> The bus left the stop. Soon, Qin Guan arrived at the CK headquarters.</p><br/><p> He got a numbered card from the staff. The interviewing room was on the second floor of the building. He pushed the door open and walked into a busy hall.</p><br/><p> It was time for people to go home, yet the staff there looked much busier than usual.</p><br/><p> Some assistants were pushing lines of hangers, and several designers were making changes to final designs on plastic models.</p><br/><p> Qin Guan was not nervous at all. He carefully observed the models who were there for the follow-up interview. The naked ones were on the left, and the ones wearing clothes were on the right.</p><br/><p> Different corridors led to different doors, behind which was a big hall.</p><br/><p> Holding his card, Qin Guan found a quiet corner on the right and sat by the window.</p><br/><p> After a while, an assistant with messy hair walked along one of the corridors and shouted at the waiting crowd, \"Time for the apparel models! We’re starting from No. 1. Ten minutes for each candidate. No waiting after the set time.\"</p><br/><p> Suddenly, the models looked nervous.</p><br/><p> No.1 strode toward the room.</p><br/><p> Qin Guan was at the end of the line. When the guy before him left, he glanced at his watch.</p><br/><p> Night had fallen, and the fashion capital had lifted its veil.</p><br/><p> When Qin Guan entered the interviewing room, he realized that the interviews in China paled in comparison to these.</p><br/><p> The room looked like it was still daylight outside thanks to the bright lights. The ceiling was about four to five meters tall, and all professional equipment and props were in place.</p><br/><p> Considering the moving fake shelves and the full photographic equipment, this was no simple interview. It was an imaging test.</p><br/><p> That kind of test was only used by top brands. Models had to interpret the featured apparel on the lens.</p><br/><p> It was a difficult test. First, the models had to handle the lens well and show their best angle in the high-definition digital camera.</p><br/><p> Second, they had to understand the concept.</p><br/><p> Professional skills were not enough though. The models also had to catch the eye of the designer and stand out among the rest of the candidates.</p><br/><p> The staff were optimistic about Qin Guan’s ability to stand out. To be frank though, they did not believe that he would meet the first two requirements.</p><br/><p> They wished that the chief designer of the final interview would give him a chance based on his appearance.</p><br/><p> Qin Guan was surprised by the outfit he had to wear. It was businesswear. He had worn CK in China before, but most of it had been underwear.</p><br/>\n</div>"}