{"title": "Chapter 359: Together Again", "id": 359, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-359-together-again", "volume_title": "Volume 4", "body": "<h1>Chapter 359: Together Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 359: Together Again</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>His loud voice attracted attention from all the guests in the hall.</p><br/><p>Wow, we have a rich Asian at our college! Qin Guan covered his face in shame. Lan Jin didn't care about anyone else. He made his way over to Qin Guan. \"Hey, dude! Why didn’t you call me when you got to the US?\"</p><br/><p>You never gave me your new number or wrote to me.</p><br/><p>He Ming and Guan Jian also joined them.</p><br/><p>\"What are you doing here?\"</p><br/><p>\"This is a party of the best university in Manhattan. We love parties. I called Lan Jin to ask him to bring us here. Guan Jian’s university has an ongoing collaboration with the New York University. He lives in my house now.\"</p><br/><p>\"You disappeared after arriving in New York though. We came here for you tonight. Won’t you welcome us?\"</p><br/><p>\"Of course not. I might end up in the university newspaper tomorrow.\"</p><br/><p>\"You? In what way? You shine everywhere you go, but you seem modest here at Columbia.\"</p><br/><p>He Ming lifted his golden-framed glasses, obviously surprised by Qin Guan’s appearance. Then he glanced over at the distinguished guests to get a general idea.</p><br/><p>\"Why did you come here in such a formidable array?\" Qin Guan pointed to the parking lot outside. Guan Jian sneered at him. \"Ask Lan Jin.\"</p><br/><p>Lan Jin coughed awkwardly.</p><br/><p>\"I’m not familiar with the city, so my dad bought me an apartment in Long Island. I discovered that it would take me 20 minutes to drive downtown though, so I had to buy a car. Car exhibitions here are filled with Benzes and Rolls-Royces, so I had to refit it.\"</p><br/><p>\"Many Chinese students like my car at my university. They copied what I did and we have a luxury car club now. He Ming helped us set some formal regulations.\"</p><br/><p>Qin Guan grimaced. \"So why did you come here for me? I can't afford any of your toys...\"</p><br/><p>He Ming smiled again. \"Rich second-generation students have to apply to join our club by using their money. Our club has outstanding power. Maybe we could do something together one day.\"</p><br/><p>\"We are here to ask your opinion. Would you like to join us?\"</p><br/><p>It's a Chinese fraternity. Of course I want to join. I’m not an idiot.</p><br/><p>\"Okay, no problem.\" They were all happy, but John, who was listening in to their conversation, looked itchy.</p><br/><p>The host announced the start of the party. People walked to the dancing floor and started moving along to the soft music. Those who preferred their quiet stayed behind and talked with their friends.</p><br/><p>Qin Guan and his friends were naturally in the public eye. They slowly walked up to the distinguished guests.</p><br/><p>\"Uncle He! Long time, no see...\"</p><br/><p>\"Xiao Ming, I saw you when you arrived!\"</p><br/><p>After an introduction by He Ming, they began chatting about random subjects.</p><br/><p>\"How are you, Mr. Fred? Do you remember me from the party at the Chelsea Hotel? I’m Kuhn...\"</p><br/><p>Nobody had noticed when Kuhn had approached. The people he greeted forced a smile on their faces.</p><br/><p>Qin Guan felt strange about the scene. Reality was really cruel. Would the former prince adjust to the changes?</p><br/><p>\"Qin Guan, you’re here! I’ve been looking for you for a long time. Why didn’t you come to the party with me?\" Xu Xiaoxiao was standing behind him.</p><br/><p>Before he could turn around, he saw the crazy light in Kuhn’s eyes.</p><br/><p>\"Are they your friends? Are they Chinese?\" Xu tried to put his arm around Qin Guan's shoulders. The difference between their heights though made Xu look like a funny monkey stretching up to reach a peach.</p><br/><p>\"Ha! What an interesting boy! Could you introduce him to us, Qin Guan?\" Lan Jin laughed loudly. All the attendants fixed their eyes on Xu Xiaoxiao.</p><br/><p>Taking advantage of this, the guests got over the embarrassment caused by Kuhn, who was blatantly ignored by everyone.</p><br/><p>The party was wonderful. People drank, talked and enjoyed the company of beautiful girls. Only when Kuhn lost that luxury did he realize how precious it was.</p><br/><p>He retreated to the entrance without a word. The proud young man set his glass down heavily on a tray. Wine splashed out, betraying his anger.</p><br/><p>Nobody paid any attention to him though. The music changed, sparking their interest. John and Susanna were competing, trying to challenge Zeta and Wendy.</p><br/><p> They were the prince and princess’ rivals that night. All the students were familiar with their history. They danced and smiled as they watched the drama unfold. Uncle He was complaining to He Ming and other Chinese rich men.</p><br/><p>\"Chinese people are better than foreigners in nearly all aspects. When it comes to public activities and sports though, Chinese students are mediocre.\"</p><br/><p>Although the members of the luxury car club did not like his observation, they knew it was true.</p><br/>\n</div>"}