{"title": "Chapter 369: New York Times", "id": 369, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-369-new-york-times", "volume_title": "Volume 4", "body": "<h1>Chapter 369: New York Times</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 369: New York Times</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qu Xuemei calmly listened to the roar coming from the other end of the receiver. When he stopped, she continued threatening him.</p><br/><p>\"I know what you are thinking about. I’m always right about people though. When did I ever cheat you before?\"</p><br/><p>Plenty of times! Ever since we were interns up until you got promoted, you have always been ahead of me. You bully me for fun!</p><br/><p>Richard had tears in his eyes, but he still decided to say no to her. Before he could hang up, she played her last card.</p><br/><p>\"I’ll apply for another position tomorrow. I have already developed the market in Asia anyway. I think Asia needs a new chief editor.\"</p><br/><p>\"No! Elder sister! You are like my own sister. No problem! Full inner pages! That’s my maximum authority.\" Richard yielded to the evil woman in horror.</p><br/><p>\"Be sensible. Take advantage of the fashion week. If you are brave enough to put him on the cover, I’m sure that you will become chief editor soon.\" She sighed. It’s been so many years, but Richard has remained the same. He’s so timid!</p><br/><p>When their negotiation was over, Richard hung up trembling. He had to obey that woman to maintain world peace.</p><br/><p>Tomorrow, after the fashion week, I have to meet the Asian model Xu resorted to such extreme measures for.</p><br/><p>In the early morning, the hurried people on the New York streets saw the newspapers. There were photos of the fashion week everywhere. Not only on the New York Post, but also on the Wall Street Journal, which had written an article on the event.</p><br/><p>Fashion critics were sharing comments on the outfits and the designers. Those sharp comments were always intolerable for famous designers.</p><br/><p>\"Top brand lacks worthy successors, a new prominent force suddenly rises...\"</p><br/><p>\"New faces: CK's vision on model selection...\"</p><br/><p>\"Are you ready for this rising Asian male model?\"</p><br/><p>There were reports in top-selling newspapers that featured Qin Guan's photos.</p><br/><p>They also put Armani's leading model beside him to attract readers.</p><br/><p>Chad's black business suit was on the left, while Qin Guan's cold CK outfit was on the right. It was a clash of ice and fire, a conflict between two different design concepts.</p><br/><p>The critics and designers on the forefront of the fashion circle expressed unanimously the view that Armani's fall collection was too straight and narrow, and lacked any striking points. On the other side, CK was worth being re-evaluated.</p><br/><p>Those articles were on a desk at the Armani headquarters. The prediction of the receptionist had been confirmed.</p><br/><p> Jimmy was waiting for his final judgement with a pale face.</p><br/><p>\"What I want to know is why you threw his resume into the trash!\"</p><br/><p>The director of the HR Department had the resume in his hand. Jimmy had forgotten to destroy it completely.</p><br/><p>The dust covering the resume indicated that it had been there for a long time.</p><br/><p>\"Armani is the best brand in the world. Our concept is elegance, fashion and royalty. Those mediocre Asians and negroes can't exhibit that. They were beyond our consideration.\"</p><br/><p>\"Plus, he is only an independent model!\"</p><br/><p>Jimmy looked savage. He didn't realize his mistake. He thought he was being considerate, because he had been thinking of the company.</p><br/><p>The director drew a serious conclusion. \"I’m sorry, but your subjective opinions have influenced our work. Considering the importance of your position, I think you are not qualified to fill it anymore. I’m sorry to inform you that I have to let you go.\"</p><br/><p>\"What?\" The middle-aged man stood up hysterically. \"You have no right to fire me! I’ll complain to your superiors. You are abusing your authority!\"</p><br/><p>He tried to grab the tie of the director in protest.</p><br/><p>\"Let me go! Let me go! Security!\"</p><br/><p>There was a general turmoil in the meeting room. Several security guards rushed in and pulled the crazy man out of the building.</p><br/><p>In a different office, an assistant was watching respectfully an old man, who was refreshing his spirit by closing his eyes.</p><br/><p>\"Make an appointment for me to meet the young man.\"</p><br/><p>\"So you want him to try on our apparel? He has the perfect figure.\"</p><br/><p>\"No!\" The elegant old man smiled like a naughty boy. \"You forgot about our new product line.\"</p><br/><p>\"You want him to try that?\"</p><br/><p>\"Yes. We have been suppressed by Chanel for a long time. Maybe that Asian model can surprise us...\"</p><br/><p>\"Yes, sir!\"</p><br/><p>Qin Guan had no idea about the games played between top level brands. He had just finished the NORTH FACE show and he was tiredly planning on going home, when he was suddenly stopped by a serious reporter.</p><br/><p>\"W.\" The short man handed his card to Qin Guan with shining eyes.</p><br/><p>\"Okay...\" Qin Guan put it in his pocket.</p><br/><p>William was surprised by the boy’s calmness. All the models knew W’s great reputation. It was one of the top fashion magazines in the US.</p><br/><p>Generally speaking, only top models could attract the attention of the magazine, yet the young man had accepted his card like it was a free napkin at the supermarket.</p><br/>\n</div>"}