{"title": "Chapter 363: Freelance Photographer", "id": 363, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-363-freelance-photographer", "volume_title": "Volume 4", "body": "<h1>Chapter 363: Freelance Photographer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 363: Freelance Photographer</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Different friends offered to help. The products were designed by Teacher Rong, Sister Xue helped as well, and administrative processes such as the register and the tax calculation were assigned to He Ming.</p><br/><p>As the first one among them to start up a business, Qin Guan cheered those idling, proud guys up.</p><br/><p>They thought of Qin Guan’s business as their own and they ended up founding two companies. One was a commercial company qualified to import and export products, and the other was a high-ranking custom-made store of original brand manufacturers.</p><br/><p>Qin Guan turned down Lan Jin’s proposal to expand and find a new location. The small company was like his and his girlfriend’s baby. It was Cong Nianwei’s favorite thing aside from her studies. As a naturally born designer, Cong Nianwei had fallen in love with the store at first sight.</p><br/><p>This was the beginning of their new life.</p><br/><p>A busy hamster knew its capabilities well. The beginning of their career had to be carried out according to their abilities.</p><br/><p>It was not just a career for them after all. It was also an interest. They liked to work without pressure and do everything themselves.</p><br/><p> Cong Nianwei and Guo Nuoyan drove Qin Guan away from the store, as he had more important tasks to carry out. He had to shoot his first poster in the J Clothing store after the decorations were finished.</p><br/><p>The photographer was an acquaintance of theirs, who had left them a card several days ago.</p><br/><p>Thanks to his acute intuition, Guo Nuoyan got a general idea of the situation. The middle-aged woman was a freelance photographer working for many magazines and newspapers in New York. She preferred to live free and leisurely.</p><br/><p>Guo looked at her with new eyes after assessing her perfect skills. The adventurous female photographer was good at focusing on detail and exploring beautiful elements amid extreme ugliness.</p><br/><p>She didn’t ask for money as payment. She just wanted Qin Guan to model for her for free.</p><br/><p>Qin Guan was okay with the agreement. It felt like destiny had brought him and the photographer together. He got a wonderful vibe from her, unlike from other ordinary fashion photographers.</p><br/><p>It was Helen who designed the poster. First, she had abandoned the traditional studio. Sunshine was the best lamplight and the shade of real trees was the best background. They were enough for a good picture.</p><br/><p>The ancient, gloomy style of the Chelsea Fair was the best site.</p><br/><p>Wearing his dark green Harley sunglasses, Qin Guan put on the featured fall collection outfits. There were coarse dark red tiles, mottled fences and green trees behind him.</p><br/><p>He looked like a fashionable boy walking down the New York streets in a grey cotton hoodie and a black waistcoat.</p><br/><p>Helen pointed her camera at Qin Guan. \"Relax. Posture doesn’t matter. Just relax.\"</p><br/><p>She didn't want to see a serious business model through her lens. She preferred original emotion.</p><br/><p>Qin Guan stood there calmly. The audience couldn't see his eyes behind his sunglasses, which increased their desire to get a clear look at them.</p><br/><p>Qin Guan leaned his body against the wall. His fair skin contrasted against the coarse bricks.</p><br/><p>He looked like the boy next door, like every girl’s first crush. That boy was the warmest memory in every girl’s childhood.</p><br/><p>Helen pressed the shutter like a dying butterfly struggling in the deep autumn. She believed that she had discovered a rare gem. The Asian boy was quite different from how he acted in his ordinary life.</p><br/><p>They began the second series of photos.</p><br/><p>Breaking the standards of business advertisements, the photos only showed Qin Guan's backview to the audience.</p><br/><p>It was a test not just for photographer, but also for the expressive force of the model.</p><br/><p>Qin Guan didn't choose clothes of a fitting or complicated style. He just put on a pair of simple straight pants and a hoodie.</p><br/><p>Standing on the hillside, he watched the sunset, turning his back to the photographer. Warm sunshine seeped into him, leaving a dim shadow behind him.</p><br/>\n</div>"}