{"title": "Chapter 373: Unblessed Love", "id": 373, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-373-unblessed-love", "volume_title": "Volume 4", "body": "<h1>Chapter 373: Unblessed Love</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 373: Unblessed Love</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> They were the most talented students of professional drama schools. Suddenly, two boys with curly hair stopped working when they saw Qin Guan.</p><br/><p> \"It's him!\"</p><br/><p> \"Hi, Qin Guan!\"</p><br/><p> They were the Batiste brothers, who were working part-time there because of their love for films.</p><br/><p> As they had expected, their neighbour was an artist. He was a born actor. Nothing could conceal his shine in all its splendour.</p><br/><p> They both jumped up in excitement. Lochans cast a nervous glance at the camera in front of them before he looked around.</p><br/><p> Obviously, the beautiful girl in the transparent green silk and the crystal crown was more attractive, but Batiste's voice had diverted his attention to Qin Guan.</p><br/><p> It was love at first sight. That model met the most basic requirement of a good actor: a good sense of the camera.</p><br/><p> Lochan was itching to see him in action. He’s a potential actor! This may be what he has always been searching for. Let's begin. Show me your abilities!</p><br/><p> \"Attention! Three, two, camera!\"</p><br/><p> Qin Guan was flying over a green lake with boat-like water lilies floating on its surface. The Queen of Fairyland was on the center of the lake, watching the foreign intruder.</p><br/><p> Chased by his enemy, the King of Darkness had entered the heart of the forest by accident and encountered the elf. He lost his head before it.</p><br/><p> Her blue eyes were as clear as the sky, and her blonde hair looked like sunshine.</p><br/><p> Everyone felt the sudden change in the atmosphere. As spectators, they were witnessing a legend unfold.</p><br/><p> The fragrance of the Armani perfume was the best lure of the Queen. The King of Darkness got distracted in the land of warmth and tenderness.</p><br/><p> Hiding his vigor and covering the smell of blood on his body, he stepped forward, his heart guiding him. He forgot about the enemy behind him, as well as his identity as a dangerous vampire.</p><br/><p> All the staff had gotten absorbed in the expression on Qin Guan's face. He looked confused and happy. Impressed, yet hesitant.</p><br/><p> Lochan tightened his fists. Right! That’s it! This is not the skill of a greenhand. This mysterious Asian man has been gifted with strong acting skills.</p><br/><p> As a top model but poor actress, Raquel didn't need to do anything but show her perfect face to the camera. If fact, Armani had not been hopeful about the skills of either of them.</p><br/><p> As a result, they had adjusted the script specifically for them, so they could show their most beautiful side to the audience. Qin Guan was a surprise for them though.</p><br/><p> As he approached, he slowed down gradually and tried to hide his heavy breathing.</p><br/><p> Every dark cell in his body was shouting, \"I love her. I want to own her, seize her!\"</p><br/><p> Her mysterious eyes were like shining stars in the night sky. Everyone stared at Qin Guan, who looked like he was drunk.</p><br/><p> The two of them were getting closer and closer to each other. Silence prevailed in the room. Some girls put their hands before their chests in prayer. They were imagining that they were the heroine instead.</p><br/><p> Lochans was in the same pose, imagining his own script and work.</p><br/><p> Qin Guan bent over toward the queen, his lips getting close to her small ear, covered by her golden hair.</p><br/><p> A green, transparent ear drop was hanging there, full of Armani life essence.</p><br/><p> Suddenly, Raquel moved. Keeping her poker face on, she attacked the vampire with a sword.</p><br/><p> She just intended to act like a queen. As a green hand at acting though, she only acted according to the script to avoid influencing the final result.</p><br/><p> The elf race was always in pursuit of extreme beauty. As a weapon for criminal purposes, her sword was also magnificent.</p><br/><p> The sharp blade penetrated Qin Guan's heart and exited through his back. There was no blood on his black cloak. By that time, Qin Guan's sexy lips were almost on the Queen’s earlobe.</p><br/><p> The vampire looked ferocious. He would kill the evil murderer before vanishing.</p><br/><p> A soft wind was blowing. Her blonde hair smelled like orchids.</p><br/><p> The light in Qin Guan's eyes was gradually dimming. His hands fell down. He was unwilling to kill the elf who had made him feel so alive.</p><br/><p> His fair slender fingers caressed her face gently. Finally, he closed his eyes.</p><br/><p> The King of Darkness turned into smoke and dissipated in the sky.</p><br/><p> Qin Guan maintained that pose with his eyes closed. The fragrance was in the air, smelling cool and refreshing.</p><br/>\n</div>"}