{"title": "Chapter 372: The Armani Advertisement", "id": 372, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-372-the-armani-advertisement", "volume_title": "Volume 4", "body": "<h1>Chapter 372: The Armani Advertisement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 372: The Armani Advertisement</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> The assistant was slow getting to the point, so Qin Guan just asked the boss directly.</p><br/><p> Armani felt happy to hear his mother tongue. \"A perfume,\" he answered.</p><br/><p> A perfume! That sounds elegant! Qin Guan covered his surprise. Don't lose face before them! </p><br/><p> Trying his best to control the muscles on his face, he said in Italian, \"Okay.\"</p><br/><p> \"It will be just like your CK show artistically... No, wait. Thane, get some black clothes for him...\"</p><br/><p> The assistant hesitated. He had to go to another floor to do that. Generally speaking, the proper apparel was hard to find.</p><br/><p> At the time, flexibility was important.</p><br/><p> He took out a black velvet cloak from a drawer and asked Qin Guan to put it on.</p><br/><p> The black cloak was floating on the floor like a blooming black rose.</p><br/><p> Both models looked royal and elegant.</p><br/><p> \"Looks pretty good.\"</p><br/><p> Those words sealed their destiny.</p><br/><p> Raquel lowered her long, brush-like eyelashes, casting shadows on her cheeks.</p><br/><p> The Asian model gave off a contrasting vibe next to her, a girl from scorching Brazil.</p><br/><p> This might have been why Armani had chosen her as the representative of the perfume.</p><br/><p> Satisfied with the result, Armani left, leaving his assistant to talk with Qin Guan about the contract.</p><br/><p> \"According to your agent, your focus in the future would be magazines. Both VOGUE and W have invited you to work with them.\"</p><br/><p> \"Yes.\" Sister Xue must have used them as my selling point when negotiating with Armani.</p><br/><p> \"Well, we also run regular advertisements in them. Did you agree on a cover advertisement for a magazine?\"</p><br/><p> \"Yes.\"</p><br/><p> \"Young foreigners usually lack experience. It would have been a good opportunity for you to be on their covers before the fashion week, but since you are an Armani model now, this is an opportunity for them. They engage mainly in cosmetics anyway. They are not too greedy.\"</p><br/><p> \"Your cover and our advertisement will appear in the same edition. You don't need to worry about the details. You are their lucky star.\"</p><br/><p> So I will promote the sales of the magazine?</p><br/><p> Thanks to the Armani advertisement, that ordinary magazine would reach a sale peak. Sister Xue was a cunning woman, so she had informed the J Clothing boss in advance. It was a good chance for an advertisement.</p><br/><p> When Qin Guan visited the Armani headquarters again, he didn't see the old man. The person in charge of the project was a man called Bean.</p><br/><p> He looked like the famous British Mr. Bean. He was also British, so he was very focused on detail.</p><br/><p> The new Armani perfume was an echo of the upcoming Halloween. If promotion went well, it could become the new girl favorite at parties.</p><br/><p> To meet the taste of young people, the perfume was in a square, flat bottle, like wine bottles sailors used to drink from.</p><br/><p> The light green perfume looked like tourmaline in the bottle. The logo was floating on pure lake water, looking romantic and misty.</p><br/><p> Qin Guan went out of the dressing room in a royal European costume. His neckline and sleeves were white with shiny golden edges.</p><br/><p> His white silk bow tie was flying before his chest like a butterfly. The traditional European costume suit the Asian model well.</p><br/><p> He looked like someone from a different time, an evil man existing only in legends, who never grew old or died. He had no heartbeat, so only the hot blood of beautiful young girls could grant him the feeling of a living person.</p><br/><p> Yes, Qin Guan would be playing a vampire lord in the advertisement.</p><br/><p> Armani had invested a lot in the background and equipment. When the actors finished their make up, the assistant invited the director over from the lounge. The exclusive director of Armani, Lochans, had to be \"invited\".</p><br/><p> He was a senior film editor who occasionally acted as an advertising director for top brands. That way, he could make money for his films, as well as find diamonds among top models.</p><br/><p> Of course, if he could also teach new film stars, it would be perfect.</p><br/><p> Sitting on a folded chair, he watched his assistants get busy with the test before the shooting began. After a while, he nodded in satisfaction.</p><br/>\n</div>"}