{"title": "Chapter 390: Battles Among the Ivy League", "id": 390, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-390-battles-among-the-ivy-league", "volume_title": "Volume 4", "body": "<h1>Chapter 390: Battles Among the Ivy League</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 390: Battles Among the Ivy League</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan felt relieved. It was his first time being a real hero and the first time the was acting in an indie film. He had learned a lot from that.</p><br/><p> In that liberal situation, he had learned to express himself freely. During the shooting, Gus hadn’t intervened with Qin Guan's performance. He had just chosen a reliable script, cast and crew, and he had depended on them.</p><br/><p>Red maple leaves were flying in the wind as Qin Guan waved farewell at the crew and got into his new car.</p><br/><p>Alex’s parents had come to pick up their son. They were arranging his luggage carefully in their car. The boy with the blonde hair watched the small blue car drive away in obsessive admiration.</p><br/><p>\"Jimmy! Honey, let’s go!\"</p><br/><p>\"I’m coming!\" Nobody knew what influence Qin Guan would have on his future career.</p><br/><p>After the film, Qin Guan had spare time to enjoy his life on campus. The Ivy League football league was about to start. Joseph had been talking about it non stop, annoying Qin Guan.</p><br/><p>Columbia University could be considered the founder of the football league. In 1876, Harvard, Yale, Princeton and Columbia had organized the first college football league in the US.</p><br/><p>Then four more universities from the Northeast had joined the league to form the top eight football teams in the US. After that, other universities had imitated them, forming 60 different leagues at different places.</p><br/><p>In the early 1900s, Ivy League universities started granting sports scholarships, and sports became fashionable and popular around campus. At the time, those eight teams were considered the best in America.</p><br/><p>The champion of the national football league would always be in the Ivy League though.</p><br/><p>However, as society progressed, the eight universities realized they had gotten distracted from their goal, which was elite education. The sports scholarships didn't bring any real advantages to their development. Instead, they lowered the academic level.</p><br/><p>As a result, they began to rethink the point of education and make wise reforms. They cancelled athletic scholarships and poured all their resources into academic studies. Now, Ivy League universities were not famous for their sports league anymore, but their elite studying programs.</p><br/><p>On the other side, after a whole century, the game had become a tradition of these universities. It was like a holiday for them. That day, older students would return to campus to meet their old friends. They would spend a day on campus, drink coffee or tea, and remember the old times by wearing their old school uniforms.</p><br/><p>As a result, this was the best chance for the university to find sponsors. Graduates tended to make generous donations after all.</p><br/><p>Qin Guan and Cong Nianwei felt regretful as they sat amid the audience. Joseph had told them it would be an easy match and they would only have to cheer for him by the court. They were feeling like they’d been sandwiched on the spectator stands though, while Joseph was enjoying the applause of the court.</p><br/><p>The ability of the athletes aside, they all looked really cool in their sports equipment. Their white protective suits and silver helmets made them look formidable.</p><br/><p>Qin Guan had invited Susanna and her girls, who were dancing and cheering in their traditional Columbia uniforms.</p><br/><p>Their opponent was Harvard, whose team had the tallest players. Of course, Guan Jian was in it. He was the only international student in their team of five.</p><br/><p>He was a strong man who loved sports, so he had become a member of the Harvard football team. He was also the only Chinese player in the game, which made the Chinese students feel proud.</p><br/><p>The two teams were getting ready for the match. They were playing at Columbia’s home court, so most of the audience was made up of Qin Guan's fellow students. Harvard was very powerful though. Every Harvard graduate in New York had asked for a day off that day. Wearing their traditional Harvard school uniforms and T-shirts, they had gone there to cheer for their Alma Mater.</p><br/><p>John led Qin Guan to a corner and handed him a T-shirt in secret. Qin Guan unfolded the T-shirt and saw the Harvard badge on it.</p><br/><p>\"Qin Guan, do me a favor and put it on.\"</p><br/><p>\"Hey, this is our opponent. I’ll get beaten.\"</p><br/><p>John grinned, baring his white teeth. \"Don't worry, trust me.\"</p><br/>\n</div>"}