{"title": "Chapter 398: Sister Xue’s Success", "id": 398, "volume": 4, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-398-sister-xue%E2%80%99s-success", "volume_title": "Volume 4", "body": "<h1>Chapter 398: Sister Xue’s Success</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 398: Sister Xue’s Success</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Insiders had to attach importance to the commercial value of the Asian model. Sister Xue had her own reasons for heading directly to the local media instead of brand businessmen for a future cooperation.</p><br/><p>\"To get back to our subject, I hope VOGUE can see his special charm like NYLON did. I don't need to say much more about his commercial value.\"</p><br/><p>She was calm in front of the editor, unlike other agents, who were flattering around fashion magazines. She moved her legs to a more comfortable position before she continued.</p><br/><p>\"I hope VOGUE can hire Qin Guan as its exclusive model, like its Asian edition has already done. He is way better than Chad...\"</p><br/><p>She was speaking with fervor and confidence. Richard’s eyes opened wide. Who the hell granted her the courage to make such a demand?</p><br/><p>\"Impossible. I can't deny his high commercial value though, and I wish we will have a happy cooperation in the future. When VOGUE is in need of models, we’ll consider him. I’m planning on hiring him for at least two advertisements next year. Is that alright?\"</p><br/><p>\"Once every six months. Such a chance would be undeniable for most top models. If you agree, I’ll ask the legal department to send you an agreement. You can also choose the date. Since you are a friend of Qu Xuemei’s, I can arrange it for you.\"</p><br/><p>Once every six months? I’m no beggar!</p><br/><p>Actually, Sister Xue had misunderstood him. Richard was also looking to increase his collaborations with Qin Guan, but there were lots of top models in the world. New York was different from the small fashion circle in China. This chance would help Qin Guan earn a place in the top fashion circle.</p><br/><p>Although that seat was not very comfortable, he could still sit there during a meeting.</p><br/><p> Sister Xue wasn’t feeling grateful though. In fact, she stood up leisurely and gave Richard a silent smile. \"Fine. I’ll consider your proposal...\" It seemed like she was taking pleasure in his misfortune.</p><br/><p>Wow! Who do you think is party A here? Are you clear about the situation?</p><br/><p>\"I’m in no hurry. I can wait to talk with Qu Xuemei...\"</p><br/><p>\"What? Qu is coming? When? What do you mean?\"</p><br/><p>Richard got nervous at her words. The demon is returning to the headquarters?</p><br/><p>Sister Xue stood up without hesitation. \"Thank you for having me. It was an inspiring talk. Qu and I are actually old friends. She told me a few days ago that she was preparing for a trip at the end of the year. You must be glad. She said that you are her best friend in America. Wow! You are too happy to speak...\"</p><br/><p>Sister Xue left, leaving Richard with a pale face. She met with Raynana from NYLON right away.</p><br/><p>The meeting was so harmonious that Sister Xue thought world peace was close at hand. She went out of the magazine’s offices with an annual contract. As long as Qin Guan could fit it in his schedule, he would be NYLON’s first choice for their inner colorful pages.</p><br/><p>Talking with the media took up most of Sister Xue’s time in the US. She had put Armani aside, but she had a meeting with the stubborn executives of the CK operational department.</p><br/><p>While Qin Guan was on the bus, Sister Xue was on her way back in his car, the CK underwear contract in her hands.</p><br/><p>It was not as important as a worldwide representative contract, but Qin Guan could appear in all CK clothing stores all over the world.</p><br/><p>For the following year, CK would always save a seat for Qin Guan in its shows and posters. That day, Sister Xue got two contracts worth 600,000 dollars. It had been a very fruitful journey and a great pleasure for them all.</p><br/><p>When Sister Xue flew back to China, Qin Guan devoted himself to his films.</p><br/><p>The process was fast. Because of the high standards of the scenes though, the crew spent most of its time on the road, seeking the right locations for outdoor scenes. By then, they had finally reached the most interesting part of the story.</p><br/><p>Qin Guan’s character had been recruited by the US secret service. After one week of observation, the secret service man in the grey woollen coat had walked up to him slowly. \"Our country needs you...\"</p><br/><p>At the time, Qin Guan had just been beaten in a small bar. He was gloomy and depressed. The man’s words sounded serious, but his strict expression made people laugh.</p><br/><p>\"I’ll train you to be the best killer and spy. You will be fighting for the honor and safety of the US...\"</p><br/><p>Qin Guan hesitantly agreed to the training. After the first killing, he realized what he had gotten himself into. This was no dream, but the wonderful life of a secret service man.</p><br/><p>When he got back home, he saw that he had mail from the ABC broadcasting and TV station. To his surprise, his show would finally be airing.</p><br/><p>It was an interesting show about a beautiful girl who would be choosing a boyfriend out of three boys. The boys would be standing on the other side of a door, and the girl would ask them questions.</p><br/><p> It was like an ancient Chinese tradition, when a virgin would hide behind a screen to peep at her fiancé.</p><br/><p>To be frank, it was the American version of \"Are you the one?\" [1].</p><br/><p>Translator's Thoughts</p><br/><p>Lan Lan</p><br/><p>[1] It’s a very famous TV program on blind dating in China.</p><br/>\n</div>"}