{"title": "Chapter 403: The Affair", "id": 403, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-403-the-affair", "volume_title": "Volume 5", "body": "<h1>Chapter 403: The Affair</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 403: The Affair</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> She walked out proudly, her gown flying in the air. Suddenly, the situation was reversed.</p><br/><p> She felt dizzy. The sky and earth were spinning around her. She fell onto the floor, unable to breathe. The poison Qin Guan should have drunk had taken effect on her.</p><br/><p> Qin Guan stood by the door of the washroom at the end of corridor. The light behind his back outlined his perfect figure.</p><br/><p> As she stared at him, Julia slowly fell down on the floor.</p><br/><p> \"When you looked out of the window, I switched the cups. If there had been no poison, everybody would have been happy. What's happening now though?\"</p><br/><p> She was the same person. yet there was no emotion left in Julia’s eyes. Qin Guan walked to the kitchen quietly and took a clean towel that had been prepared for him. Then he got to work.</p><br/><p> He cleaned the door, the sill, the floor and the bed. He had to wipe away all the traces he had left in the room. That was what he had learned during training.</p><br/><p> Sad piano music filled the silence. Julia’s body was lying on the cold floor, exactly where Qin Guan had been lying previously.</p><br/><p> The hand that used to caress her body now stuffed a pen into her hand. Qin Guan helped her finish the letter on the paper.</p><br/><p> George gestured to the camera, zooming out suddenly to a high angle shot.</p><br/><p> Qin Guan left. The dying beautiful woman looked like a withered peach blossom fallen on the earth. Mournful, yet gorgeous.</p><br/><p> In her hand were her last words.</p><br/><p> The camera zoomed in on the paper, the crooked handwriting getting more and more distinct.</p><br/><p> \"No love.\"</p><br/><p> Chuck returned home without any sense of guilt. He had put all of this into his book, \"Confessions of a Dangerous Mind\".</p><br/><p> Julia's part in the film was finished. There was only one scene left, Qin Guan and Drew Barrymore's wedding.</p><br/><p> Julia hugged Qin Guan before leaving. It was a farewell between two friends who appreciated each other.</p><br/><p> Her body was soft in his embrace. The fragrance of roses lingered in his nose.</p><br/><p> She kissed him on the cheek. It was a normal farewell kiss, yet Qin Guan saw some reluctance in her eyes.</p><br/><p> It should have been a happy parting, not a sad one!</p><br/><p> Acting scared, he tried to keep a distance from Julia. \"Spare my life! Help me!\" he shouted.</p><br/><p> Everyone burst into laughter at the funny actor.</p><br/><p> Julia laughed out loud. You don't like my kiss? How dare you!</p><br/><p> She left amid the chaos. There was no lipstick left on her mouth. Qin Guan's face was covered in lip stains and saliva.</p><br/><p> The photo ended up in the Sun, the most famous newspaper in the US.</p><br/><p> \"Oscar movie queen facing a marriage crisis!\"</p><br/><p> \"She kissed a rising Asian actor for 10 minutes straight!\"</p><br/><p> The picture was not very clear, but it was clear enough for anyone to recognize the woman.</p><br/><p> The sales volume of the newspaper spiked up. It even surpassed that of the New York Times.</p><br/><p> The next day, Qin Guan had become a celebrity among the crew.</p><br/><p> \"Hey, Qin Guan! Did you see the newspaper today?\"</p><br/><p> \"No, I haven't bought the New York Times. What happened?\"</p><br/><p> Qin Guan craned his head towards the newspaper with interest, only to see a picture of him and Julia hugging.</p><br/><p> Fortunately, the photo was not very clear and his name was not on the paper, thanks to the regulations of the film industry.</p><br/><p> Without permission from the producers and the film company, the media could not release relative information without running the risk of being prosecuted. They could only attract public attention with ambiguous titles.</p><br/><p> Of course, there were also rumors published on the paper, which impressed Qin Guan a lot.</p><br/><p> \"Interesting... My face is not visible! I’m a nobody for the Sun.\"</p><br/><p> He had a point. Thanks to his makeup, the reporter had had no idea about the background of the Asian boy. If he had known that Qin Guan was an Armani model, the title would have been much more interesting.</p><br/>\n</div>"}