{"title": "Chapter 406: Chinese Treasure", "id": 406, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-406-chinese-treasure", "volume_title": "Volume 5", "body": "<h1>Chapter 406: Chinese Treasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 406: Chinese Treasure</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>It was a pity that his schedule was tight. He had to send them the contract by post after returning to California. He was eager to become an official collaborator of \"Beauty of the World\".</p><br/><p>The lifeline of goods supply was totally in Qin Guan's hands though. The price of Chinese commercial artwork was pretty low. In China, those pictures could be sold for 30 yuan each.</p><br/><p>American people really loved them though.</p><br/><p>More and more goods were displayed in the store as the number of onlookers increased. If it wasn’t for the board stating \"Opening Tomorrow\", which blocked the entrance, they might have rushed in and fought over the products.</p><br/><p>Small displaying furniture with Suzhou embroidery was on the antique shelves. In the golden sunshine, the hairy kittens playing with balls looked almost alive.</p><br/><p>Xiefuchun Makeup Powder was in customized Tang tri-color glazed ceramic cases. Inside the transparent glazed bottles was hair oil used for hair-darkening, scaling, itchiness-relief and detoxification. The oil was made of borneol and musk and came from ancient, mysterious China.</p><br/><p>American people were surprised by the products. The customers of the store would be rich, powerful people!</p><br/><p>They would judge Qin Guan's shrewd nature by the price of the artwork. He sold ordinary products by the batch, but saved the top products for last.</p><br/><p>Qin Guan opened the second to last box. He took out a handkerchief and wiped the dust off thoroughly. Then he put the snow-like silk handkerchief on the box and held it up in admiration. He slowly recited a poem.</p><br/><p>\"There is no jewellery on Earth that can surpass a pile of clay from Yangxian town...\"</p><br/><p>Most of the onlookers didn’t understand what he was saying. He seemed very comfortable though. He looked like a Chinese scholar in a blue gown amid a bamboo forest, making a cup of tea with the dark-red enamelled pottery in his hand.</p><br/><p>Everyone applauded.</p><br/><p>People in America knew nothing about pottery, poetry and the special feelings of the ancient Chinese. What they admired was the person before their eyes, who was as beautiful as a painting.</p><br/><p>Qin Guan smiled at them and gently put the pottery in the middle of a cabinet. It was a handmade piece made by Master Gu Jingzhou. Everybody followed his fingers with their eyes.</p><br/><p>The lotus-like mini teapot revealed its real nature inside the dark cabinet.</p><br/><p>It had a round belly with a clear decorative design. The slender handle was like the stem of a lotus leaf, giving off a summer vibe.</p><br/><p>Its most mysterious part were the golden dots reflected on the pot, which symbolized dignity and loyalty.</p><br/><p>White English-style teapots were like mud under a cloud. This teapot was the king of teapots.</p><br/><p>The shocks came one after the other. Before they could come back to their senses, Cong Nianwei opened the last box and everyone went crazy.</p><br/><p>It was a piece of brocade fabric from Nanjing.</p><br/><p>Even during modern times, when textile technology was really advanced, Nanjing brocade still maintained its traditional features and qualities.</p><br/><p>It owed its name to its bright splendid colors. The fabric was as beautiful as the rosy clouds in the sky. It was one of the four most famous brocade fabrics in China.</p><br/><p>The brocade in Cong Nianwei’s arms was custom-made, so it was the only one of its kind.</p><br/><p>Using a base of red shusu, the masters had weaved golden, silver and copper threads, as well as natural silk and feathers of several kinds of birds and beasts together to form that piece of brocade.</p><br/><p>Thanks to their complicated skill, the two-meter wide, five-meter long piece of fabric was the most expensive exhibit in the shop.</p><br/><p>\"Excuse me! Let me in!\"</p><br/><p>\"Miss, could you please show us that fabric? We work for the Dior design studio.\"</p><br/><p>Guo Nuoyan was nearly stomped on by the crazy women at the entrance. He was almost torn apart before Qin Guan could even speak.</p><br/><p>\"It’s not for sale. We’ll sell it at a public auction.\"</p><br/><p>What? Poor designers can't compete with rich VIPs! Are you kidding?</p><br/><p>Qin Guan glanced at Cong Nianwei, who opened a storage box and put the fabric inside.</p><br/><p>\"These small ones could be up for sale though.\"</p><br/><p>Qin Guan took out the last products from the box. There were five beautiful concealed fibre containers that looked like kaleidoscopes.</p><br/><p> He gently pulled the contents out. A silk scarf was presented to the crazy designers. It was as thin as a cicada's wings. The sunshine went through the texture, and its color was as bright and beautiful as a gift from the gods.</p><br/><p>Unlike the brocade, it reminded him of the soft sound of the Yangtze river delta.</p><br/><p>Silence prevailed in the room. Everybody’s eyes were sparkling with determination. Everyone in here is an enemy.</p><br/><p>The fibre containers were opened one by one to reveal the silk scarves, like maidens reaching marriage age.</p><br/><p>Western people were born with an admiration of silk. The products from the Vermont embroidering studios were inferior to the real deal though.</p><br/><p>The voices of the onlookers trembled.</p><br/><p>\"My dear boss, no! What is the price?\" The scarves were swaying before their eyes in a dazzling way.</p><br/>\n</div>"}