{"title": "Chapter 410: Top Brands", "id": 410, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-410-top-brands", "volume_title": "Volume 5", "body": "<h1>Chapter 410: Top Brands</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 410: Top Brands</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p> \"Do you trust me?\"</p><br/><p> Yamaguchi Tsutomu nodded without hesitation. The fat man on the floor looked up suddenly and stared at Qin Guan fiercely in question.</p><br/><p> \"Okay, I’ll make a call.\"</p><br/><p> The girl remained silent. As Qin Guan talked with somebody on the phone, Cong Nianwei made the girl a cup of tea.</p><br/><p> The fragrance of the tea comforted her worried mind. She sat on the couch and gestured for Dashi to stand up.</p><br/><p> \"Okay, I know...\"</p><br/><p> Han Zhujiu had been waiting for Qin Guan’s call. Without help, Yamaguchi Tsutomu could do nothing in New York. If she was able to return to Japan quietly though, Han wouldn’t bully the woman or start a bloody feud with a foreign gang. Besides, Qin Guan had saved his life.</p><br/><p> The next day, a small private plane took her away. Qin Guan didn’t expect her to pay him back.</p><br/><p> After New Year’s, Director Zhang Yimou would be taking the cast to Los Angeles for the Oscars. Actually, Qin Guan didn't want to go. He planned on returning home during the holidays.</p><br/><p> Sister Xue tried her best to convince his parents though, who didn't know that Qin Guan had only five minutes of screentime in the film.</p><br/><p> The homeless boy was forced to fly to Los Angeles, and Sister Xue flew to New York like a haunting ghost.</p><br/><p> She pulled Qin Guan directly to her office, which Guo Nuoyan had rented for her. Two guys from the CK and Armani operational departments were sitting in the room, looking at each other with hospitality. </p><br/><p> As soon as Qin Guan entered, he knew that Sister Xue was plotting something. She preferred to have others asking help from her.</p><br/><p> In six months, Xue Wanyi had been promoted. To avoid making a fool of herself in certain occasions, Professor Li and Teacher Rong had told her to grow up.</p><br/><p> She smoothed her hair down gently and told the confused men, \"Both of you work for top brands. You identify as truly talented people. Although Qin Guan is not your exclusive model, I have to inform you about some changes in his work schedule.\"</p><br/><p> \"His film will be nominated for an Oscar this year.\"</p><br/><p> What? We had no idea about that.</p><br/><p> The two men were confused. They were only in charge of the communications between the models and their companies. They had no idea about the general company policies.</p><br/><p> Even Giorgio Armani had no idea about that, let alone those two.</p><br/><p> \"He will definitely walk on the red carpet, as well as appear before the large background of the award ceremony. His film is on the list of nominees for best foreign language film, so he will get some opportunities during the ceremony...\"</p><br/><p> The two men nodded repeatedly, waiting to hear her requirements.</p><br/><p> \"So, considering our past cooperation, can you, as experienced insiders of the fashion circle, give us some suggestions on formal wear?\"</p><br/><p> \"He should definitely wear Armani.\"</p><br/><p> \"He should wear CK, of course.\"</p><br/><p> They both shouted in one voice. Then the guy from Armani burst into laughter.</p><br/><p> \"What are you laughing at?\" The CK guy looked both ashamed and angry. \"Our apparel is really expensive. Our sales volume this year was twice as high as yours!\"</p><br/><p> The Armani guy stopped laughing and turned to Sister Xue.</p><br/><p> \"I can make the decision. We’ll lend Qin Guan the latest Armani customized suit.\"</p><br/><p> \"Great! Thank you for your support.\"</p><br/><p> Sister Xue made a decision without hesitation. The CK guy choked before falling silent.</p><br/><p> What could he say? He wanted to offer the same thing, but he could not!</p><br/><p> Although he was a calm person, Qin Guan was shocked by the suggestion.</p><br/><p> Advanced suit customization was no small deal.</p><br/><p> First of all, one had to spend a certain amount of money in store to get an invitation to an advanced customization launching event. Only then would one qualify to purchase something during the event.</p><br/><p> Besides, customized clothing cost over hundreds of thousands of yuan, which was already too expensive for the average person. Hand-made suits could cost up to several million yuan.</p><br/><p>An advanced customization suit could be considered a certificate inside a certain circle. People in your circle wouldn't laugh at your style or bad taste.</p><br/><p> There were strict criteria for lending advanced customized apparel. A third or fourth level star would be an insult to them.</p><br/><p> As for superstars, if they looked ugly in a rented customized outfit, they would be erased from the list and have to buy it the next time.</p><br/><p> That was how advanced customization worked.</p><br/><p> Qin Guan wouldn't turn down such a chance. He was no idiot after all.</p><br/><p> The process was simple. Qin Guan would give Armani his schedule, and Armani would deliver the suit in time. After the award ceremony, they would take it back and check it carefully.</p><br/><p> Before Sister Xue and Qin Guan went to Los Angeles, Sister Xue still had Qin Guan's career to consider.</p><br/><p> \"This year, the Armani perfume will be released. This is a good start. You have to become one of their three exclusive models.\"</p><br/>\n</div>"}