{"title": "Chapter 423: Different Kinds of Figurants", "id": 423, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-423-different-kinds-of-figurants", "volume_title": "Volume 5", "body": "<h1>Chapter 423: Different Kinds of Figurants</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 423: Different Kinds of Figurants</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>There were only 3,000 seats in the ceremony hall, while the participants were about 6,000. Only guests with invitations would enter the hall.</p><br/><p>\"People have submitted applications for an invitation from early on. According to the rules, we can only get two to three invitations. We had a discussion and made a decision. You should thank Zhang Weining. He admires you so much.\"</p><br/><p>Qin Guan felt gratitude for Zhang. On second thought, he realized he was useless. He could do nothing to help the crew before the opening ceremony.</p><br/><p>Taking advantage of this, he decided to walk around the largest film studio in the US and experience the atmosphere there.</p><br/><p>Influenced by the Oscars, everyone in Los Angeles was cheered up. Plenty of companies and investors were pouring into the city. Simple sheds had been set up as temporary interview rooms for figurants.</p><br/><p>Qin Guan was excited. He felt like a shark smelling blood.</p><br/><p>Sister Xue was his driver. Looking alertly at the annoying boy, she asked him, \"What are you going to do?\"</p><br/><p>\"I just wanna take a look.\" Before his voice could fade away, Qin Guan had disappeared like the wind.</p><br/><p>He merged into the crowd at once. He had been bored at the parties he had been attending all day long and planned on making some pocket money for himself.</p><br/><p>Money eyes! Murmuring, Sister Xue parked the car. Suddenly, she saw Qin Guan standing in a line of figurants. He stood out because of his rare Asian face.</p><br/><p>He had chosen the shed with the smallest numbers of interviewees. In two minutes, he went out with a piece of paper.</p><br/><p>It had to be a notice. Excluding the time he had spent on the forms, the interviewer must have talked to him for less than a minute. It must be a terrible role.</p><br/><p>Sister Xue went into the shed and realized what Qin Guan had done.</p><br/><p>The audition was about a film with a limited budget. The title was a good summary of the film. It was called \"Bloody Journey\". Sister Xue could already foresee its fate. It would be rated NR-17.</p><br/><p>As expected, the figurants would be playing corpses. Qin Guan walked over happily as Sister Xue was reading the script angrily.</p><br/><p>\"I think it's really easy to act in a film in Los Angeles. I passed another audition in 10 minutes!\"</p><br/><p>Sister Xue sighed. \"Tell me, what's this? A zombie? A monster? The living dead?\"</p><br/><p>Qin Guan grinned, shaking a sheet of paper before her proudly. \"I want to try all kinds of different films to see the distinctions. You know, investments vary.\"</p><br/><p>\"This is a B-movie. The investment must be billions. I have one line in the film...\"</p><br/><p>\"Wow!\"</p><br/><p>Sister Xue was shocked. Asian people were in a weak position in Hollywood, except when it came to independent and animated films. Qin Guan had come across a B-movie at random. He was really lucky.</p><br/><p>\"The leading actor is Dwayne Johnson.\"</p><br/><p>Sister Xue took the notice, where the shooting time, location and payment were stated. The title of the film was \"Walking Tall\".</p><br/><p>My boy is so lucky!</p><br/><p>Before she could come back to her senses, Qin Guan followed the crew of \"Bloody Journey\" up the hill.</p><br/><p>Their studio was on the hillside. There were many small shooting basements there that resembled large warehouses. Figurants could start work right away.</p><br/><p>The US fully deserved the title of the country that produced the most films. When Qin Guan and Sister Xue arrived at the studio though, they realized that the crew was even worse than a Chinese troupe.</p><br/><p>Inside the giant studio was only a lonely camera and several pale-looking staff members. Before Sister Xue could regret this, a man who seemed to be the director shouted, \"All figurants head to the makeup room!\"</p><br/><p>Qin Guan was pulled into a room surrounded by plastic sheets. He thought it was quite different from a traditional make-up room. That makeup room was like the studio of a machinist. There were all kinds of paints and tools everywhere.</p><br/><p>A hairy strong man was sitting in the center of it all. He was carefully painting blood on the bodies and faces of the figurants with a serious expression on his face.</p><br/><p>\"Next!\" He patted the man in front of him. Qin Guan walked over. The strong man took a notebook from the table and read out loud, \"Next scene, a man and his fingers. Got it!\" He sized Qin Guan up.</p><br/><p>\"Do you see the iron operating table over there?\"</p><br/><p>Qin Guan nodded.</p><br/><p>\"Change into the white shorts on it. If you don't want to stain your expensive polo shirt, I suggest you take it off and give it to someone else for safekeeping.\"</p><br/><p>It seems like my role is a special one. Qin Guan took off all his clothes. The strong man fell into thought as he looked at him in interest.</p><br/>\n</div>"}