{"title": "Chapter 437: Terrible Business", "id": 437, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-437-terrible-business", "volume_title": "Volume 5", "body": "<h1>Chapter 437: Terrible Business</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 437: Terrible Business</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"I’d really like to cooperate with you,\" Qin Guan broke in, stretching his hand out to Miroc warmly. \"I appreciate your offer very much. I’ll be waiting to hear from you...\"</p><br/><p>He shook Miroc's hand firmly, making the man feel flattered. Qu led Miroc away immediately, her face buried in her hands.</p><br/><p>\"I’m Qin Guan’s agent in the US. We can discuss this further. Here is my card...\"</p><br/><p>Qin Guan was surprised. When did you become my formal agent?</p><br/><p>After Miroc left satisfied, Qu explained everything to Qin Guan.</p><br/><p>\"Sister Xue, Professor Li and I established an agency in China. I didn’t come to the US just for a position transfer, but also to take care of your working arrangements here.\"</p><br/><p>\"We should be more professional in the future. I’ll keep track of all the offers you get at this party and select the most suitable ones for you. Don't worry, I’m a professional.\"</p><br/><p>Liar! You are much stricter than Sister Xue.</p><br/><p>Qin Guan couldn’t say no though. Qu was glaring at him through her beautiful golden-framed glasses. Qin Guan felt like there was a sword in front of his face.</p><br/><p>I better be a good boy...</p><br/><p>\"It's really late. Why don't you go home and sleep with your girlfriend? Or would you rather stay with me and ‘work’ all night long?\"</p><br/><p>Qu raised one of her eyebrows, placing her left hand gently on Qin Guan's chest.</p><br/><p>\"Huh?\"</p><br/><p>Qin Guan shook his head so violently that he nearly threw his hair back.</p><br/><p>\"Then why are you still here? Do you want me to take you home? Your place or mine? Cong Nianwei will never know.\"</p><br/><p>Before her voice could fade away, Qin Guan disappeared up the stairway. He must have broken Carl Lewis’ world record.</p><br/><p>Qin Guan should change his name to Coward Qin. </p><br/><p>I’m so fortunate to have a female monster take care of my working arrangements. Qin Guan had no idea that another female was waiting for her, one almost as bad as Qu.</p><br/><p>In the morning, he entered the classroom with Xu Xiaoxiao, who was looking at him in admiration.</p><br/><p>\"Well done, Qin Guan. Your QC Accounting Firm is really popular now!\"</p><br/><p>\"For what? I have no commission business these days.\"</p><br/><p>Xu poked him with his elbow, giving him a knowing look. \"Everyone in Chinatown knows that. Today is the small taxes reporting day. The staff of your firm will have to make a summary list of my restaurant for small traders. They said that a small commercial alliance would be established soon. In the future, more than 300 Chinatown traders will be your clients.\"</p><br/><p>Qin Guan was shocked. What the hell is going on? More than 300? I have no staff. I’ve only hired seven students part-time. Who released these news? I’ll beat them if I find out...</p><br/><p>Meanwhile, Liu Tianxia waved at him from the door.</p><br/><p>\"What's the matter?\" Qin Guan was thinking about his troubles with a frown. Suddenly, Liu smiled at him.</p><br/><p>\"I sent the leaflets to Chinatown. Of course, Xu helped me a lot.\"</p><br/><p>\"For what?\"</p><br/><p>\"Your firm is developing too slowly for your status as the president of our union.\"</p><br/><p>What? I don't understand.</p><br/><p>\"I took care of the publicity both for the firm and for you.\"</p><br/><p>Qin Guan sighed. \"But this is beyond our means. We don’t have enough staff. There are so many basic calculations and statistics to take care of.\"</p><br/><p>\"Don't worry about that.\" Liu cleared her throat loudly and Qin Guan suddenly saw dozens of students gathering around him.</p><br/><p>\"Look at me, President Qin!\"</p><br/><p>\"Senior Qin, I’m a sophomore at the Accounting Department! My name is Miaomiao.\"</p><br/><p>\"Senior Qin, I’m Debbie! I’m a junior!\"</p><br/><p>\"They are all your staff.\"</p><br/><p>I’m the boss, I should know who my staff are. And these are all girls. How is that okay? This seems like a union of beautiful girls from different races. Other clubs would have found this strange.</p><br/><p>\"They will be your main forces. They will become official employees in the future.\"</p><br/><p>Qin Guan was stupefied. Xu Xiaoxiao was salivating.</p><br/><p>From then on, Qin Guan's firm was upgraded from an independent agency to a small-scale firm. This took him only one month!</p><br/><p>Qin Guan had no idea about the situation until he sat down in Xu’s restaurant. The accounting reports of the small businesses aside, some Chinese staff had also brought their duty declaration forms. They were hoping that the talented young man could make some suggestions.</p><br/><p>By the middle of April, they had to submit the forms to the tax bureau. Chinese people in the US were not that familiar with it. </p><br/><p>In America, advance payment was generally more than the actual tax payment. The government would return the excess money every year. The returned money would differ according to different forms.</p><br/><p>For example, one could get a tax reduction by moving, getting robbed, sending their kid to kindergarten, paying for college tuition, or making a failed investment. For ordinary people, this was quite difficult to work out.</p><br/><p>Qin Guan divided his girls into different groups. One group was in charge of collecting paperwork from small traders, while the other group introduced the tax reporting process to the consultants.</p><br/>\n</div>"}