{"title": "Chapter 436: The TV Show", "id": 436, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-436-the-tv-show", "volume_title": "Volume 5", "body": "<h1>Chapter 436: The TV Show</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 436: The TV Show</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Suddenly, Qin Guan felt as if he was being held at blade point. He was starting to miss Sister Xue. Qu stood behind him silently. It was obvious that she would be serving as his temporary agent.</p><br/><p>\"I think your image fits our representative requirements in Asia. Besides, we have a general idea about your popularity and audience. If you say yes, I can confirm that you will be our representative in Asia for 2003.\"</p><br/><p>Shao would have killed for such a chance.</p><br/><p>Meanwhile, the Tiffany agent seemed hesitant. \"As a local brand, Tiffany will be able to fit your schedule. However, we need a worldwide representative. Your performance today is not enough for us to make a final decision.\"</p><br/><p>The Cartier agent smiled confidently upon hearing that. The Tiffany agent’s next words made him regret that though.</p><br/><p>\"Tiffany needs a model for Baselworld in April. I wonder if you would be interested in that job. There will be representatives from the most famous jewellery and watch brands there. They will compete against each other according to their sales volume. As far as I know, Mr. Qin Guan has been honored as the best commercial representative in Asia. He must be confident about his abilities.\"</p><br/><p>Qin Guan was scared by the offer. Baselworld was considered the Oscars of the international watch and jewellery industry. In 2003, they had changed the name of the fair and turned it into a real international fair. Before 2002, only occidental brands had been able to participate.</p><br/><p>Professional merchants attended the fair every year with a large capital in order to purchase top limited edition collections. During the fair, 150,000 people would surge into the small town of only 180,000 residents. The importance of the fair was pretty obvious.</p><br/><p>Qu kicked Qin Guan secretly, implying that he’d better accept the invitation fast. Then she handed her business card to the agent.</p><br/><p>\"Hello, I’m Qin Guan's temporary agent. We could have a private conversation over there.\"</p><br/><p>I will do the dirty work. You just go and flirt with other people.</p><br/><p>Cartier and Tiffany left and some other brand businessmen came over to chat and probe Qin Guan. Those picky guys took everything into consideration, including one’s educational level, style of conversation, behavior and subtle feelings.</p><br/><p>Exhausted, Qin Guan sent the last group of people away. Then he cast a glance at Chad and burst into laughter.</p><br/><p>The people interested in Qin Guan worked in the jewellery, watch or handbag industry, while Chad had attracted brands like DKNY, LaSenza, and AB Underwear. All underwear brands! Some of them had started their business by selling ladies’ lingerie and planned on expanding to men’s underwear.</p><br/><p>As he looked at Chad’s grimace, Qin Guan felt refreshed. At the end of the festivities, Qu showed up again and gave Qin Guan a pointed look.</p><br/><p>He followed Qu to a quiet corner of the garden and saw a dapper man standing there. He was about 30 years old and looked very bold and casual.</p><br/><p> \"This is Miroc, manager of the CW TV station. They are planning a new reality show relative to the model industry. He is here to consult fashion experts on the potential of the program.\"</p><br/><p>\"He liked your performance and wants to know if you would be the temporary director of the program. If the audience ratings are good, they will invite you to be a long-term guest.\"</p><br/><p>Qin Guan fell into thought. Reality shows in the US were just a starting point.</p><br/><p>Not all chances for a TV program were good though, and a failed show could destroy one’s career. Qin Guan had gained access to top brands now, so any move he made had to be taken into serious consideration.</p><br/><p>Qu remained silent beside him. She was sure that Qin Guan would say yes. Qin Guan had to ask some questions first though.</p><br/><p>\"May I know what kind of program it is? I actually know nothing about TV programs.\"</p><br/><p>Miroc smiled. \"You are a modest man. I’ve heard that Chuck hand picked you to portray him out of numerous candidates. You must have great potential if a TV tycoon admires you so much.\"</p><br/><p>You are overestimating me… Qin Guan was speechless by his deduction. Miroc continued his boasting.</p><br/><p>\"I think Chuck would think highly of my program. I will be showing a side of the upper fashion circle to ordinary people. I’ll fulfil the dreams of the average girl. Every girl has dreamed of becoming a supermodel. My program will be called ‘American Supermodel Competition’!\"</p><br/><p>\"Unlike traditional competitions, that select candidates by having them mail videos of themselves, we’ll broadcast live from the very beginning to show the real life of a model. The audience will get to see how they train and work... It will be excellent!\"</p><br/><p>Qin Guan felt a little strange. I have seen that program before. In my previous life, I spent my spare time in the evening before the TV, drinking and appreciating those long legs, full bottoms and big boobs. The most important factor were the disputes among the girls. It was really interesting! I will accept the offer. I like lively disputes!</p><br/>\n</div>"}