{"title": "Chapter 442: Exhausted", "id": 442, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-442-exhausted", "volume_title": "Volume 5", "body": "<h1>Chapter 442: Exhausted</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 442: Exhausted</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The female audience would feel as if they were being conquered by such a man.</p><br/><p>Suddenly, Qin Guan threw the towel away. The camera turned immediately to Samantha. I know you all want to see everything underneath, but I’m wearing shorts. Ha ha!</p><br/><p>Samantha seized Qin Guan's body up boldly. Then she went into his room with the basket, walking up to the naked man leisurely.</p><br/><p>Meanwhile, the voiceover was saying, \"After a short while, Samantha enjoyed Chip the stockbroker.\"</p><br/><p>\"Cut! Excellent! Five-minute break before the next scene!\"</p><br/><p>The director was watching them with relish. Everyone was regretting letting Qin Guan wear shorts. They were happy though, because the next scene was a sex scene!</p><br/><p>In American TV series, there were sex scenes everywhere. Qin Guan lay down helplessly on the bed, waiting for the director's instructions. The whole crew, including the female janitor, were trying to find an excuse to come over.</p><br/><p>I feel like a monkey in the zoo. Have you never seen a naked man before?</p><br/><p>Of course, but you are the most handsome man we have seen naked.</p><br/><p>\"Ready? Three, two, camera!\"</p><br/><p>After restraining them for a long time, Qin Guan’s emotions burst out like a runaway horse.</p><br/><p>\"Yes... Oh, yes...\"</p><br/><p>\"Yes...\"</p><br/><p>His eyes were closed tight and his arms were spread from the extreme sensation. His bed was shaking violently, making cracking noises. At the climax, he suddenly opened his eyes .</p><br/><p>\"Oh, yes...\"</p><br/><p>Samantha fell on the bed and lay down beside Qin Guan.</p><br/><p>Hm… Not the missionary type...</p><br/><p>After sex, people were inclined to open their hearts to each other and enjoy their intimacy. Qin Guan felt that he needed to do something for the beautiful woman in his bed.</p><br/><p>What did women want? Love? A warm and sweet everyday life? Jewellery? Money? To pay his sexy partner back, Qin Guan shared a secret with her.</p><br/><p>\"I have never done this before, but I have some inside information I want to share with you. Yalong Pharmacy will rise sharply in the stock market in the following days...\" Chip told Samantha.</p><br/><p>\"Yalong Pharmacy?\" Although she was panting after their strenuous activity, Samantha didn’t forget to put it down on her notebook. \"Thanks, honey.\"</p><br/><p>Qin Guan hugged her from behind and kissed her earlobe gently. Kim shivered slightly. If we were not filming, I’d definitely do something with you.</p><br/><p>She had to control herself though. Meanwhile, Qin Guan was whispering sweet words to her. \"You are wonderful...\" He patted her bottom vigorously as they continued their games in bed.</p><br/><p>The director turned off the camera without telling them.</p><br/><p>The two of them looked at each other. No one dared look back at the camera. Kim was only in her underwear, while Qin Guan was in the same flowery shorts he had been wearing earlier.</p><br/><p>Their legs were interlocked. Two fair arms were supported on the bed on either side of Qin Guan's head. He smelled a faint fragrance of roses.</p><br/><p>\"I’m exhausted...\" Kim pretended to feel weak. Actually, she could have gone rock-climbing with her bare hands.</p><br/><p>\"I can’t support my body.\" Suddenly, two full boobs in a green bra were falling towards him. In two seconds, they would be on Qin Guan’s face.</p><br/><p>What can I do? What can I do? He would be the first actor to be run over by boobs.</p><br/><p>Suddenly, someone grabbed his ankles and pulled him down. He flew out of the bed and fell onto the floor with a bang.</p><br/><p>Kim fell on the sheets, while Qin Guan landed on the floor, one of his ankles in Qu’s hands. Qu must have been possessed by Mou Xiaoliu. She had pulled a weight of more than 70 kilos.</p><br/><p>\"Come here!\" Qu let Qin Guan go and clenched her fists.</p><br/><p>Essen, who was the mastermind, realized that nobody had noticed him. \"Okay! Cut! Ten-minute break!\" he said quickly in a low voice before he ran away.</p><br/><p>Crack... That was Qu's fingers.</p><br/><p>\"Come here, you b*tch!\"</p><br/><p>Kim shook her head fiercely in bed. \"Never!\"</p><br/><p>\"Come here! I won’t touch you!\"</p><br/><p>Liar! The woman turned into a kitten.</p><br/><p>\"It’s my… My fault... Forgive me!\"</p><br/><p>\"For what?\"</p><br/><p>\"I’m not concentrated on acting. I was flirting with him...\"</p><br/>\n</div>"}