{"title": "Chapter 466: An Unreliable Affair", "id": 466, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-466-an-unreliable-affair", "volume_title": "Volume 5", "body": "<h1>Chapter 466: An Unreliable Affair</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 466: An Unreliable Affair</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"I’ll have the smoked silver carp, oysters and maionese as an appetizer...\"</p><br/><p>\"I want an onion soup. Any other ideas?\"</p><br/><p>\"French fried foie gras and lamb chops as a main course... Caviar or snails for a hot appetizer... Pudding or ice cream for dessert...\"</p><br/><p>The waiter felt sad when he saw the four Asians walk in. My English is really poor, dude.</p><br/><p>Most French people looked down upon other languages. They ignored the fact that English was the most frequently used language in the world.</p><br/><p>However, the handsome guy among them could order in perfect French. The young waiter couldn’t believe his luck.</p><br/><p>The manager won’t yell at me. That guy is beautiful both in and out.</p><br/><p>Everyone was eating, chatting and smiling. The atmosphere was quite merry in the restaurant. It was warm and nice, which made the guests feel right at home. On the contrary, western restaurants in China were usually very classy.</p><br/><p>The dishes were served one after the other. Qin Guan was intrigued by the maionese in the small, white plate, but he was not interested in the juicy foie gras. On the plate were three pieces of bread with a crisp crust. Qin Guan spread the maionese on the bread and took a large bite. He tasted a mixture of yolk, garlic, olive oil, lemon juice and sea salt.</p><br/><p>\"Wonderful!\" Qin Guan said, sighing in satisfaction. The other three people looked at the two pieces of bread left on the plate silently.</p><br/><p>A sneaky figure appeared outside the window. Click, click...</p><br/><p>In the picture, Li was trying to grab the bread from Qin Guan. The photo made them look deliberately intimate with each other.</p><br/><p>The temptation of delicious food didn't depress Blair, who was standing outside. He had volunteered to come to Cannes in search of some striking news for The New York Times. If he took advantage of those photos, he could make a good report.</p><br/><p>Overjoyed, he returned to his hotel without lingering outside the restaurant. Then he began to process the photos on his laptop.</p><br/><p>Gradually, a controversial, catching entertainment report was composed. The executive editor of The New York Times received an email from him soon. He read through the content quickly and checked out the photos. Then he forwarded the email to his staff and made a call.</p><br/><p>\"Ask the editor to check the text again. If there are no mistakes, the report can take up half a page of the entertainment section tomorrow.\"</p><br/><p>The entertainment section only took up eight pages of the newspaper, so Qin Guan would attract the attention of the readers.</p><br/><p>Qin Guan had no idea about what was happening. He was saying goodbye to Lou Ye at the airport. By the time he saw Sister Xue off, another ordinary morning had dawned in New York.</p><br/><p>\"Xu Xiaoxiao, take a look over here. Isn’t this your classmate?\" Xu's father shouted at his son as they sat at the table eating breakfast.</p><br/><p>\"My classmate? In the entertainment section? Did he win the award?\"</p><br/><p>Xu spotted Qin Guan right away. He was hugging a charming Asian beauty. They seemed to be very familiar with each other. In another photo, Qin Guan was holding a piece of bread in his mouth, while the beauty was almost sitting in his embrace. She was looking at him affectionately.</p><br/><p>The title was also very catchy. \"Cannes Best Actor winner meeting a girl in secret. Betrayal!\" Blair had included all the information he had collected from OMG.</p><br/><p>Handsome Asian actor… Talented Columbia student… Childhood sweetheart… Cannes Best Actor Award winner… Secret meeting… Cheating...</p><br/><p>He had used ambiguous words to mislead the readers.</p><br/><p>Xu nearly tore the paper apart. As Qin Guan's loyal fan, he knew about the relationship between him and Cong Nianwei. Their love was as solid as gold. Xu was really jealous of them.</p><br/><p>Liar! You just wait and see!</p><br/><p>\"The New York Times!\" Rongzhi threw some coins at the owner of the bookstore before he read through the newspaper. My idol is in Cannes...</p><br/><p>\"What the f*ck… Liar! You just wait and see!\"</p><br/><p>If Blair had known the consequences of that report, he would have chosen another victim in Cannes.</p><br/><p>As soon as Qin Guan went out of the terminal, he saw Cong Nianwei surrounded by a group of friends from Columbia, as well as He Ming and Lan Jin, who looked very happy to be there.</p><br/>\n</div>"}