{"title": "Chapter 468: Unknown Sentiment", "id": 468, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-468-unknown-sentiment", "volume_title": "Volume 5", "body": "<h1>Chapter 468: Unknown Sentiment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 468: Unknown Sentiment</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Qin Guan stood up with reverence and awe and walked to the door. I’m lucky to have such a reliable agent. When he pushed the door open, Qu said from behind him, \"Congratulations for your award. Okay, you can go now!\"</p><br/><p>Everyone focuses on the gossip and forgets about my award.</p><br/><p>The belated congratulations made his sad heart fall even more. When Qin Guan's steps faded away in the hallway, Qu let out a soft breath.</p><br/><p>Under her desk was a safe exactly like the one in her office in China. It was also for Qin Guan’s collection.</p><br/><p>Qu opened it with the key easily and put the newspaper inside. She took it back again after glancing at the photo. She looked at Li Bingbing carefully and smiled. Then she picked up a small pair of scissors from her desk and cut Li’s image from the photo.</p><br/><p>Disappointed with the hole, she scanned the desk, searching for something to cover it.</p><br/><p>There was a photo frame on the desk. She took her own smiling photo out of it and pasted them together. Although the colorful photo didn’t match the black-and-white paper well, she was satisfied with her work.</p><br/><p>Could this be considered a group photo?</p><br/><p>She pasted the photo to the inside of the safe carefully. On the photo, both she and Qin Guan were smiling softly. She closed the door of the safe and locked it, hiding the strange but harmonious photo. It was locked in the dark safe, as well as in her heart.</p><br/><p>That was what secret love was like. It could remain a secret for a person’s entire life. Qin Guan, who knew nothing about her feelings, returned home tiredly.</p><br/><p>The door was open, and a familiar figure was working in the small kitchen wearing a yellow apron. It was a Chinese tradition to eat dumplings before a journey and noodles when one came back. His girlfriend was preparing warm noodles to welcome him home.</p><br/><p>\"I’m back.\"</p><br/><p>Turning around, Cong Nianwei smiled at him under the light of the setting sun. \"Welcome back. Are you hungry?\"</p><br/><p>\"Of course!\"</p><br/><p>\"Wash your hands for dinner.\"</p><br/><p>\"Okay!\" Qin Guan said in a loud voice, partly out of joy and partly out of hunger.</p><br/><p>His luggage was already unpacked. Everything was in place. The gold crystal cup was sitting on a shelf quietly. This was his first award.</p><br/><p>Everything was just right.</p><br/><p>White noodles were poured into a blue porcelain bowl, the stringy gravy covering them. Steam was slowly rising up before Qin Guan's face. Suddenly, he felt humidity in his eyes. It was probably from the steam.</p><br/><p>Qin Guan felt deep emotion in his heart. It was different from when he had been on the podium. He knew that this was love, the kind of feeling found only in locked hands and joint steps.</p><br/><p> \"Cong Nianwei.\"</p><br/><p>\"What?\"</p><br/><p>\"One day, that shelf will be filled with awards. They will all be for you. All my awards are yours.\"</p><br/><p>\"So? You want to fill the whole shelf before marrying me?\"</p><br/><p>Qin Guan looked at the shelf. It had three layers, but only one lonely cup on it.</p><br/><p>\"Well, there are also all the awards we won as kids. Yours should also be taken into account.\"</p><br/><p>What a shameless guy! The two of them hugged each other. It was a sunny day. Cong Nianwei didn’t say anything about the affair.</p><br/><p>A confident woman never paid attention to gossip. It was sad not to believe one’s own boyfriend.</p><br/><p>On the other side of the ocean, a riot was taking place. The news about the Cannes Festival had spread to China through some domestic reporters stationed in France. They had originally gone there for Lou Ye, but they had been surprised by Qin Guan.</p><br/><p>In two days, the news were in a prominent place in every newspaper.</p><br/><p> \"The third Best Actor in China has been born. It’s Qin Guan, a young 22 year-old actor.\"</p><br/><p>\"The Chinese film lost the Palme d’Or, but a Chinese actor won in Cannes.\"</p><br/><p>\"The acting skills of the handsome Best Actor winner.\"</p><br/><p>An American movie! A leading role! An indie film! Best Actor Award at Cannes! Everyone cooperating with Qin Guan was shocked. </p><br/><p>The directors of the sixth generation swallowed their own toothpaste while brushing their teeth. Director Zhang Jizhong dropped his breakfast, while Zhang Weining smiled in his office.</p><br/>\n</div>"}