{"title": "Chapter 482: Emergency", "id": 482, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-482-emergency", "volume_title": "Volume 5", "body": "<h1>Chapter 482: Emergency</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 482: Emergency</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Among a whirlwind of office workers, white shirts, suit pants, golden-framed glasses and card holders was a talented young man, sitting behind an ordinary desk.</p><br/><p>The director looked around at his staff. \"Remember the sequence?\" he asked.</p><br/><p>The girls nodded with a serious expression.</p><br/><p>The director waved at them. \"Three, two, camera!\"</p><br/><p>Qin Guan got to work right away, working like a robot among the towering files.</p><br/><p>\"Intensive work and pressure are bad for your skin. The oil blocks the pores...\"</p><br/><p>The voiceover paused. Qin Guan looked up from his documents tiredly. He seemed worried about his skin, like any ordinary IT worker.</p><br/><p>\"The girls pay no attention to you...\"</p><br/><p>Two models walked over nervously. As greenhands, they didn't know how to express their scorn. They just used their body language.</p><br/><p>Their necks were bent forward, and their noses were pointed to the sky.</p><br/><p>Qin Guan raised his eyebrows sadly and grimaced.</p><br/><p>One could only look at them from afar, but not play with them...</p><br/><p>\"There is a solution though...\"</p><br/><p>Two other girls ran up to Qin Guan with a product, like angels saving the world.</p><br/><p>It was the first time they were acting in an advertisement. Unlike the previous two, who didn't need to do anything but walk by, they had to perform in front of the camera.</p><br/><p>One of them had to grab Qin Guan's glasses gently from behind him, and the other had to place the L’Oreal men's facial cleanser beside his face. Then the camera would zoom in on the product and Qin Guan.</p><br/><p>The two girls were nervous. The one standing behind Qin Guan had big boobs. Qin Guan could feel them on his back.</p><br/><p>There were too many people around him, so Qin Guan had to crane his neck forward, which made it difficult for the girl to take his glasses off. As a result, her fingers were stuffed into Qin Guan's nose.</p><br/><p>Unfortunately, misfortunes always came in pairs. Startled by the mistake, the other girl dropped the bottle in her hand next to Qin Guan.</p><br/><p>Everyone was familiar with plastic bottles. The edges were always sharp and hard. When the bottle fell down, it slid over Qin Guan's face, leaving a white mark on his cheek.</p><br/><p>In a few seconds, the white mark turned red.</p><br/><p>Everything happened too fast. In 10 minutes, screams broke out amid the silent crowd.</p><br/><p>\"Qin Guan!\"</p><br/><p>Qu rushed up to them, pushing the scared girl away. She pinched Qin Guan's jaw and lifted it up.</p><br/><p>There was a soft red line on his smooth skin. It was not a big deal. If one scratched their arm with their nails, the mark would disappear in a few minutes.</p><br/><p>Of course, that rule didn’t apply to people who had an allergic reaction or really sharp nails.</p><br/><p>The girl came back to her senses and started crying.</p><br/><p>\"I didn't mean to...\"</p><br/><p>Qu let Qin Guan go and berated the girl. \"Shut up! I’ll make sure you go bankrupt if you don’t stop crying!\"</p><br/><p>Then she turned around. \"And you? Are you okay? Move your head from between your boobs!\"</p><br/><p>Her power made everyone go silent. Qin Guan looked up with red cheeks. He stood up and turned around, only to find the girl behind him looking at him shyly. </p><br/><p>This is a disaster! Qin Guan shivered. Shall I weed her out? Will she mess with me? Her eyes remind me of Huang Jiajia!</p><br/>\n</div>"}