{"title": "Chapter 498: Animal Actors", "id": 498, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-498-animal-actors", "volume_title": "Volume 5", "body": "<h1>Chapter 498: Animal Actors</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 498: Animal Actors</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>When Qin Guan got off the plane and experienced Hawaii’s charm first-hand, he stopped complaining about the schedule.</p><br/><p>He rented a roadster, put on a pair of large sunglasses, a flowery shirt, some shorts and slippers, and drove along the clean coastal road, singing Chinese songs happily.</p><br/><p>In Hawaii, anyone not wearing flowery shorts felt like a square peg in a round hole. These were the only American islands where one could enjoy the beach and the waves.</p><br/><p>The shooting location of the film were the two islands with the smallest population, far from the base of the local government and the famous tourist attractions.</p><br/><p>Qin Guan had gone to audition for the leading part. Production would begin in September.</p><br/><p>According to statistics, it was cooler in February and March, but the superstitious locals believed that the fish were mature in September.</p><br/><p>Thus, they worked only in September, even if their work was just being a background for a romantic film.</p><br/><p>Of course, the crew had their own reasons for going to Hawaii so early. These reasons also played an important role in selecting the protagonist.</p><br/><p>It was the actors’ affinity with animals.</p><br/><p>In the film, the actors would have to cooperate with the marine species of a Hawaiian aquarium. An affinity with animals would be a great advantage in getting the part.</p><br/><p>By the time Qu Xuemei and Qin Guan checked in at the hotel, someone had already beat them to it.</p><br/><p>When they arrived at the interview location, Qin Guan saw Adam Sandler, his most powerful opponent, sitting on a stool and trying to befriend some of the supporting actors of the film.</p><br/><p>The penguin and the sea lion were the stars of the aquarium. They were as smart as children. Qin Guan looked around him in interest, while Qu frowned at the scene. Recalling the names of the actors and the director of the film, she made a decision.</p><br/><p>\"Excuse me? My actor was notified about an audition. When will the audition begin?\"</p><br/><p>The assistant was surprised. Several groups had arrived there one after the other. At the sight of Adam Sandler, they had retreated on their own initiative, or had a few words with the director before leaving. It seemed like the Asian actor wanted to have a try though.</p><br/><p>Excited, he led them over to the director, Peter Segal.</p><br/><p>\"New candidate for the audition, sir!\" Peter Segal had been sleeping in the coolest corner of the aquarium, wearing a large straw hat.</p><br/><p>\"What? New candidate?\" Segal woke up. Rubbing his misty eyes, he took a look at the newcomers.</p><br/><p>The image of the new actor became clearer and clearer.</p><br/><p>He was tall with clean short hair. His skin color and figure were perfect, and he was wearing a simple flowery shirt and a pair of shorts, exposing the muscles on his arms and legs.</p><br/><p>Qin Guan took off his sunglasses to reveal his charming face.</p><br/><p> \"What a magnificent scoundrel...\" the director murmured to himself. Qin Guan was the spitting image of the protagonist. A playboy through and through.</p><br/><p>Coming back to his senses, Segal stood up.</p><br/><p>\"Are you here for the leading role?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Follow me.\" Segal took off his straw hat, leading Qin Guan over to Adam Sandler.</p><br/><p>Appearance was not the key. There were two other essential requirements.</p><br/><p>When Qin Guan sat behind Adam, he found out about the first one.</p><br/><p>There was a penguin and a sea lion in front of them. They were the most important characters in the film besides the humans.</p><br/><p>Adam was playing with the penguin, whose name was Little Pea. This was the first time Qin Guan had ever had to flatter an animal. Naturally, he was at a loss.</p><br/><p>He tried to recall his grandma's words, who liked keeping pets. You have to show your friendly side to the animal. Animals with high IQ want to see a sincere attitude.</p><br/><p>Qin Guan nodded at Adam politely. He must be as helpless as I am.</p><br/><p>Qin Guan was wrong this time. Not everyone was as busy as him. Adam had known about the film for some time. As a result, he remained calm when he saw his smile.</p><br/>\n</div>"}