{"title": "Chapter 496: Professionalism", "id": 496, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-496-professionalism", "volume_title": "Volume 5", "body": "<h1>Chapter 496: Professionalism</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 496: Professionalism</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Our tutor was afraid that you’d get too absorbed into the film. He asked us to divert your attention and pull you back to reality.\"</p><br/><p>\"Yes,\" the younger brother confirmed before adding, \"It’s said that outstanding actors always tend to get caught up in the plot and go crazy. Characters that suffer from schizophrenia are especially influential to actors. The better the actor is, the more influenced they are.\"</p><br/><p>Qin Guan sighed at their serious faces. \"This depends on the mentality of the actor. Director Luchant shouldn’t be worried about me. I have a strong heart. Let’s go have dinner! My treat!\"</p><br/><p>One minute earlier, Qin Guan had been lost in tender memories, yet now he realized he was in the gourmet heaven of Buenos Aires.</p><br/><p>Small traders filled the capital, making it hard to compare it to another city. Immigrants from various countries made up the tough unprivileged populace. In that immigrant city, one could find Chinese supermarkets and restaurants every couple of blocks. One could judge the tolerance of the city by the foreign immigrants living there.</p><br/><p>Of course, if a Chinese visitor insisted on having Chinese food, there would be two possibilities. They were either acclimatized, or they were pretending to be something.</p><br/><p>South Koreans were an exception. It was reasonable for them to miss their pickles while they gobbled down kebabs in China. They just wanted to highlight the sense of their presence.</p><br/><p>The local gourmet food would be the best cure for Qin Guan's mood.</p><br/><p>Asado was a typical Argentinian kebab. The mixture of pork, chicken, beef and sausage was cooked on air. Different juices ran down during the process, getting absorbed again by the materials thanks to the meat.</p><br/><p>There were multiple tastes in the dish. Modern Argentinians would put all the food into one giant plate.</p><br/><p>The three friends enjoyed their food together, chatting and smiling. As the scent lingered around one’s teeth, one craved some Argentinian dumplings, which were inspired by traditional Chinese food. That alone made a trip to Buenos Aires worthwhile.</p><br/><p>Qin Guan finished a plate of kebab and three huge dumplings stuffed with beef and carrots. Then he burped.</p><br/><p>The three of them returned to the shooting location with the crew. The store remained the same, except for an aged actor. That was George, the actor who would be portraying Qin Guan's father.</p><br/><p>By the time Qin Guan entered the store again, George was done with his makeup. He went out of the fitting room, wearing a pair of elegant glasses. He had only one arm, thanks to an injury he had suffered during the war.</p><br/><p>Everything was in place. The warmest, most moving scene was about to begin.</p><br/><p>\"The first meeting of father and son. Three, two, camera!\"</p><br/><p>People were crowded on both sides of the street, where a running race would be held among the merchants.</p><br/><p>Bored to death, Qin Guan was standing among the crowd, shaking his legs. He was expecting some kind of accident to happen. He was anxious to see the world in disorder.</p><br/><p>As he had expected, there was an accident. A silent old man was standing beside him, watching him reluctantly in excitement. Qin Guan slowly turned to him, feeling the call of his blood.</p><br/><p>They exchanged a silent glance. Suddenly, Qin Guan knew who he was. After such a long time, his father had approached him that noisy afternoon. He was not prepared for that moment. He had abandoned his plan of seeking his father in Europe.</p><br/><p>Qin Guan was nervous. The scene he had thought about thousands of times vanished as soon as he met his real father. He could do nothing but run to escape from the man.</p><br/><p>As the shot of the race was heard, he ran away. His father followed him closely.</p><br/><p>The cameraman was panting, following Qin Guan's long legs and anxious face as the old man gasped.</p><br/><p>The young man left the old man behind him. Finally, he hid in the underwear store, the place he hated the most. His mother was still busy working. As he looked at her back, he felt mixed emotions.</p><br/><p>Luchant was sitting calmly in his chair, while the cameramen ran around. They followed Qin Guan with the cameras, trying to get the best angle.</p><br/><p>Although he was an old man, George followed Qin Guan, who ran about seven times. When the time was up, he was supported by an assistant, returning to his hotel tiredly.</p><br/><p>Just before Qin Guan could fall asleep, he heard Batiste telling inspirational stories about his co-stars.</p><br/>\n</div>"}