{"title": "Chapter 499: Farce in the Aquarium", "id": 499, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-499-farce-in-the-aquarium", "volume_title": "Volume 5", "body": "<h1>Chapter 499: Farce in the Aquarium</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 499: Farce in the Aquarium</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>When Qin Guan sat down as well, Director Segal said, \"Are you Qin Guan? The audition is simple. What you have to do is flatter these two babies. The more friendly you are, the better. Try your best.\"</p><br/><p>Adam was a little nervous. When Qin Guan headed to the center of the aquarium, he walked over to the director. \"Director, did I make any mistakes during my performance? Why do you want to interview other actors?\"</p><br/><p>Segal looked at Adam. The young man was a good comedian. Shocked by the appearance of the Asian boy though, Segal had the impulse to use that magnificent scoundrel in the film.</p><br/><p>If the actor cooperated well with the two animals… Actually, no. If the two animals were not aggressive with him, Segal would be inclined to choose Qin Guan.</p><br/><p>Of course, that was a big \"if\". Adam felt the threat though. That Asian actor would be his arch enemy.</p><br/><p>He concentrated on Qin Guan, holding his breath as he watched his opponent.</p><br/><p>He was familiar with the script. The Asian actor was very suitable for the role. Adam’s appearance was his only shortcoming. He looked honest and cute, but he was not very handsome.</p><br/><p>A handsome guy would attract a female audience. Everyone knew that. The Asian actor was a natural heartthrob.</p><br/><p>Adam was feeling desperate, while Segal was happy to have found the actor. The situation was getting strange.</p><br/><p>Standing between the short cute penguin and the fierce sea lion, Qin Guan decided to begin with the former. Putting on his most sincere smile, he handed some fresh fish to Little Pea.</p><br/><p>The smart penguin exerted its unique skill by pecking at Qin Guan's hand vigorously.</p><br/><p>Qin Guan was just as smart though. He drew his hand back immediately, leaving a small fish struggling on the penguin’s beak.</p><br/><p>Qu spit out the water she’d been drinking. Segal almost fell down.</p><br/><p>Little Pea didn’t stop though. As a noble penguin, it spared no intruder. It rushed up to Qin Guan at full speed with its pointed beak.</p><br/><p>Unprepared, Qin Guan was caught by the penguin.</p><br/><p>\"Ouch!\" His bare ankle was attacked. A man and a penguin were running around, chasing each other all over the platform.</p><br/><p>\"Help! Ouch!\"</p><br/><p>Qin Guan was attacked again. He had no intention of befriending Little Pea anymore. He just wanted to escape from the penguin.</p><br/><p>Segal buried his face in his hands helplessly. Adam burst into laughter. Being a careful man, he asked a crucial question while everyone else was focused on Qin Guan.</p><br/><p>\"Where is Strong, the sea lion?\"</p><br/><p>His question immediately attracted attention. The Asian guy seemed to be hated by all animals. Where was the sea lion?</p><br/><p>His question was answered soon. As Qin Guan ran to the corner of an artificial hill with a long gentle slope, the sea lion got on the stage solemnly. Qin Guan was looking back to check the distance between him and Little Pea.</p><br/><p>\"Look out! Qin Guan! Behind you!\"</p><br/><p>\"Oh, no! Strong!\"</p><br/><p>Screaming, the sea lion jumped out of the pond and hit Qin Guan.</p><br/><p>Bang! Qin Guan had no time to do anything. He fell down on the ground.</p><br/><p>The fat sea lion adjusted its posture fast. Little Pea had rushed over as well. The two of them exchanged a glance before they took action.</p><br/><p>Strong slowly crushed Qin Guan with its heavy belly while Little Pea remained in place, ready to act.</p><br/><p>Three, two, one… Peck!</p><br/>\n</div>"}