{"title": "Chapter 500: Common Animal Enemy", "id": 500, "volume": 5, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-500-common-animal-enemy", "volume_title": "Volume 5", "body": "<h1>Chapter 500: Common Animal Enemy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 500: Common Animal Enemy</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Ouch!\" The unreasonable attack surprised everyone, making them burst into laughter. </p><br/><p>\"Ha ha ha!\" No one felt sympathy for Qin Guan, not even the trainer. They forgot to save the poor guy from this predicament.</p><br/><p>Adam was so happy that he stuffed a fish into his mouth by accident.</p><br/><p>Strong thought that Little Pea was inefficient and decided to take action personally. As the star of the aquarium, the sea lion was good at acting and clapping its hands. It was as simple as eating and drinking for it.</p><br/><p>As it rolled down Qin Guan's back. the disgusting man raised his face blankly. Strong began to clap against Qin Guan’s face with its forelegs...</p><br/><p>\"Ha ha ha...\"</p><br/><p>\"Trainer, go help him...\"</p><br/><p>Segal was laughing. He must be a common animal enemy. The director sighed to himself. It seemed that the Asian actor would not be playing in the film.</p><br/><p>By the time they rescued Qin Guan from the fighting animals, he was not in as good a mood as he had been upon arriving. His handsome face looked funny. There were some scales on his skin, and his short hair looked like a nest.</p><br/><p>\"Are you okay?\"</p><br/><p>Finally, the depressed man got comforted by humans.</p><br/><p>\"Sister Qu... I cannot do this film...\" Qin Guan grew a backbone as he cried his eyes out.</p><br/><p>After that chaos, the crew set Qin Guan up in a comfortable corner, leaving him to rest. Everyone would look at him carefully as they passed by, trying to restrain their laughter.</p><br/><p>Qu had a discussion with Segal. The result of the audition was clear. Taking advantage of this, Adam, who had won the part, sat down next to Qin Guan.</p><br/><p>\"I’m Adam Sandler.\" The honest comedian stretched his hand out to Qin Guan happily.</p><br/><p>\"Hello, I’m Qin Guan.\"</p><br/><p>Adam was thankful for the penguin and the sea lion, who had weeded his potential opponent out.</p><br/><p>\"If it wasn’t for your unique character, Qin Guan, I would have lost this chance. Thank you so much.\"</p><br/><p>Qin Guan was speechless. The guy continued his attack though. \"It must be awful to have such a personality. You can’t act in a film involving animals, like a Disney show or a move like ‘Anaconda’... Little Pea and Strong are well-trained pets after all. Have you ever cooperated with a python or a leopard as a model?\"</p><br/><p>Adam was taking pleasure in Qin Guan's misfortune. Qin Guan shivered at the thought.</p><br/><p>Adam wanted to say a few more words to him though. The Asian actor was very attractive, but God was fair with everyone.</p><br/><p>Qu, who was done talking with Segal, shouted at Qin Guan. \"It’s all settled! Come and say goodbye to the director. We are going back to New York. There are few animals in big cities...\"</p><br/><p>\"I’m coming!\"</p><br/><p>As he watched Qin Guan and Qu walk away, Adam tried to comfort the young man for a last time, \"See you around, my friend. New York is a good place. There are few mosquitoes there...\"</p><br/><p>Actually, this was his final attack on Qin Guan.</p><br/><p>When they were on the airplane, Qu asked Qin Guan, \"If animals really hate you so much, you must get bitten by mosquitoes every day. Do you?\"</p><br/><p>\"Maybe insects are an exception.\"</p><br/><p>\"Cong Nianwei is so unlucky. If you get surrounded by cockroaches, she will abandon you immediately.\"</p><br/><p>Thank you so much. You are so good at small talk.</p><br/><p>Their different opinions made it useless to talk. Only Cong Nianwei could comfort Qin Guan. When they were together in bed, Qin Guan told her about his terrible experience.</p><br/><p>\"That explains it. There are cockroaches in every apartment in the building, except ours. Ever since we arrived in New York, I have never needed to hang the mosquito net. Besides, all the plants you have been taking care of have died. That potted plant we have is withering. You have only watered it once!\"</p><br/>\n</div>"}