{"title": "Chapter 504: National Athletes", "id": 504, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-504-national-athletes", "volume_title": "Volume 6", "body": "<h1>Chapter 504: National Athletes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 504: National Athletes</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"Okay.\" They all relaxed. Watt was good at the triple jump. They would win that competition.</p><br/><p>They walked to the court, smiling kindly at each other. The onlookers sat quietly in their seats.</p><br/><p>\"Hello, I’m Watt. Who will go first?\"</p><br/><p> \"I’m Qin Guan. This is your home court. After you!\"</p><br/><p>Watt was a slender man of about 1.90 meters. The tight muscles on his body indicated his speciality.</p><br/><p>He was happy about Qin Guan’s suggestion. He was excited to crush such a handsome guy with his outstanding power.</p><br/><p>The referee blew his whistle and the thin man began to run from afar. His high speed produced a breeze as he passed by Qin Guan.</p><br/><p>One!</p><br/><p>Two!</p><br/><p>Three!</p><br/><p>Watt took a leap and landed into the sand pit. The linesman held up the white flag, indicating that there had been no foul.</p><br/><p>\"16.01 meters.\"</p><br/><p>The audience took a deep breath. That distance meant nothing to outsiders. In order to get an idea about the score, Rongzhi searched online. He found the rules and regulations of the triple jump, as well as the statistics for Chinese athletes.</p><br/><p>Sixteen meters was the standard of a national-level athlete. Twelve meters was the standard for third-class level athletes in China, and 15.25 meters was first-class athlete level. In other words, 16 meters was the standard for top Chinese sportsmen.</p><br/><p>Qin Guan was no athlete though. In fact, he had never done this before!</p><br/><p>By that time, Qin Guan was already on the starting line, raising his eyebrows with a smile. For him, this did not seem like a competition, but a walk in his yard.</p><br/><p>Suddenly, he moved.</p><br/><p>His arms started swaying as he sped up, his heart beating faster and faster. His long legs were the symbol of strength and beauty...</p><br/><p>\"Qin Guan, I love you!\"</p><br/><p>\"Cheers, Qin Guan!\"</p><br/><p>He jumped high into the sky like a dancing butterfly. Then he landed and bounced up again like smooth running water. His shoes stomped just behind the line, barely a few centimeters away.</p><br/><p>Then he took his final leap. Looking natural and relaxed, he returned to the embrace of the breeze and landed on the sand with a smile.</p><br/><p>Bang! There was another footprint in the sand pit.</p><br/><p>\"14.85 meters...\" That was Qin Guan’s final score.</p><br/><p>\"What a pity! Watt is better.\"</p><br/><p>\"Are you kidding? You can’t compare an athlete to a star. All things considered, his score is pretty good.\"</p><br/><p>\"Of course! My boyfriend can’t even reach the pit.\"</p><br/><p>What a useless boyfriend...</p><br/><p>Qin Guan’s friends were stunned. Is this his first time doing this? He could be a national second-level athlete, not far behind first-class athletes. Is he even human? </p><br/><p>The Harvard athletes were also stupefied. Only professionals could understand.</p><br/><p>Qin Guan was feeling wonderful. He had just copied Watt's movements and spotted his shortcomings.</p><br/><p>He could imitate Watt, but because of their different physical condition, the same movement couldn't result in the same outcome.</p><br/><p>Watt was taller than him and he had been training for many years. Thanks to his height, arm length, wind, acceleration and aerodynamics, their scores were inevitably different.</p><br/><p>As long as Qin Guan copied him, that difference would remain the same. If he could analyse all the factors involved and choose the most suitable method though, he might make a surprising breakthrough.</p><br/><p>Qin Guan was lost in thought, trying out different methods in his mind. He tried to control his muscles and posture in strange ways.</p><br/><p>Watt finished his second try. 16.28 meters!</p><br/><p>\"Next!\" Before Qin Guan could try out more ways, the referee called him. He decided to test his new theory.</p><br/><p>He just moved with the wind. The speed of the wind was just right. Left leg… Right leg… That’s too far... Damn it!</p><br/><p>The audience sighed. Qin Guan had failed in his second jump. He was sitting down on the sand.</p><br/><p>\"The score is… One meter!\"</p><br/><p>\"Ha ha!\" His opponents laughed at him. Slender legs, huh? You just fell into the sand without bouncing up. We thought you were good at jumping, but that first jump must have been just a coincidence!</p><br/>\n</div>"}