{"title": "Chapter 528: Girls", "id": 528, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-528-girls", "volume_title": "Volume 6", "body": "<h1>Chapter 528: Girls</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 528: Girls</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"After my trip, I will get back to work and my everyday life. In Los Angeles, I was lucky enough to cooperate with three beautiful celebrities.\"</p><br/><p>The locals were enlightened. Cooperate with three celebrities? This explains all the rumors. He sure is handsome enough to be liked by three celebrities. </p><br/><p>\"Will you release a music album? Are you good at singing?\"</p><br/><p>Qin Guan smiled like a gentle breeze in the restless summer. His smile comforted the audience.</p><br/><p>\"That’s not my goal. I like my job, but no one is perfect!\"</p><br/><p>His fans felt sad, but they cheered up again soon. Our idol is too busy anyway.</p><br/><p>\"In the following days, I will be attending another film audition. Today, I had a rare day off, so I came here with my girlfriend to have fun on the beach and watch the outdoor Shakespeare play.\"</p><br/><p>\"Did you like the play?\"</p><br/><p>\"Of course!\" everyone echoed. That was the power of a free play.</p><br/><p>\"It was my honor to participate in this play today. Only personal engagement can make people realize an actor’s hard work. Look at my T-shirt. It’s soaked in sweat. These great, unknown actors play here every day, trying to show you the greatest plays in the world.\"</p><br/><p>\"Tell me, were you moved? Shall we give them our best regards?\"</p><br/><p>\"Of course!\"</p><br/><p>\"Of course!\"</p><br/><p>\"I hope the whole audience, my fans included, will ignore my presence. Please show your appreciation to these lovely people and their splendid performance!\"</p><br/><p>\"As for me, I’ll go look for some food with my beloved.\"</p><br/><p>There was laughter and sighs all around. Before returning the microphone to the director, Qin Guan suddenly recalled something.</p><br/><p>\"By the way, in order to thank my fans, anyone who watched this play will get a poster with my signature from my fan club’s website by showing their postcard. The offer will be valid for one month.\"</p><br/><p>The depressed girls cheered up again.</p><br/><p>\"Ha ha! I got three postcards! Keep your cards, dad and mum!\"</p><br/><p>\"It’s unfair. I’m not a tourist!\"</p><br/><p>\"Silly girl! There are some geeks on that website. We can flirt with them!\"</p><br/><p>\"Good idea!\"</p><br/><p>The director took the microphone and embraced Qin Guan warmly. He got a postcard with the number eight and a 100-dollar bill pinned at the back.</p><br/><p>Best wishes to artists all over the world...</p><br/><p>...</p><br/><p>The trip back to their hotel was uneventful. Qin Guan was driving as fast as he could. Thanks to him, the drama group had received their biggest donation that year.</p><br/><p>Besides, those plain postcards had suddenly started increasing in value. Local fans tried their best to get some extra cards from the tourists.</p><br/><p>After dining and wining to satiety, Qin Guan fell asleep. Actually, he would be happy performing anywhere.</p><br/><p>He woke up the next morning with a satisfied smile.</p><br/><p>Cong Nianwei would pack and return to New York alone, while Qin Guan would attend the audition in Los Angeles. This was his most important job before returning to New York.</p><br/><p>If fortune favored him, he would get some good roles in Los Angeles and start his journey in commercial films. Gold and silver were not afraid of fire, but they needed to melt on the stove first.</p><br/><p>\"Mean Girls\" was a teen comedy with a small budget. No special effects or famous stars were involved in the film. The actors had been selected from inexperienced candidates. The female leads had already been decided.</p><br/><p>The director had failed to find the hero from the actor resumes though. This was because the film had been adapted from a nonfiction book called \"Queen Bees and Wannabes\". The writer, Rosalind Wiseman, the scriptwriter, Tina Fey, and the director, Mark Waters, were all looking for a handsome actor.</p><br/><p>As soon as Qin Guan arrived for the audition, he got a reality check.</p><br/><p>The audition had been deliberately decided to be held at the school where the film would be shot. There were children playing sports on the grounds.</p><br/><p>The female actresses were getting acquainted with the environment as Qin Guan and Qu approached Mark.</p><br/><p>\"Hello, director. This is Qin Guan. He is here to audition for the role of Aaron.\"</p><br/>\n</div>"}