{"title": "Chapter 525: Oh, Juliet", "id": 525, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-525-oh-juliet", "volume_title": "Volume 6", "body": "<h1>Chapter 525: Oh, Juliet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 525: Oh, Juliet</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Before Qin Guan could say something, the director said, \"Did you get a postcard from our staff when you arrived at the beach? You could write down your comments there and leave it to us or take it home as a souvenir.\"</p><br/><p>Qin Guan and Cong Nianwei looked down at their Audrey Hepburn postcards, the most common postcards sold in stores all along the Walk of Fame for one dollar. They were very good quality.</p><br/><p>\"There is a handwritten number at the bottom right corner of the card. I’ll draw a number to pick the lucky guy.\"</p><br/><p>Everyone laughed, waiting to be summoned.</p><br/><p>\"It is said that God spent seven days creating the world. Seven is a lucky number. Please come here if you have number seven!\"</p><br/><p>Qin Guan and Cong Nianwei looked at their cards. Cong Nianwei’s was number seven, and Qin Guan’s was number eight. Cong Nianwei calmly exchanged cards with Qin Guan.</p><br/><p>Qin Guan glanced at her helplessly and stood up slowly, lifting the card up under the brilliant night sky.</p><br/><p>\"Here!\"</p><br/><p>Everyone cheered for him as he walked over to the director.</p><br/><p>\"Welcome, my boy! Go to the makeup room. I wish you a pleasant night!\"</p><br/><p>The director couldn’t see him clearly in the dark, so he thought that the young man was a tourist. Maybe he can’t even speak English.</p><br/><p>Qin Guan entered the simple makeup room, which was crowded by actors. During the break, everyone remained silent to protect their voices.</p><br/><p>They all cast a hurried look at Qin Guan and then lost any interest in him. He seemed like an ordinary Asian boy with a dirty face.</p><br/><p>The prop master handed him an old European style suit. The whole makeup process was skipped. In their eyes, Qin Guan was only a volunteer.</p><br/><p>Qin Guan did not feel dissatisfied about the arrangement. He took the suit and asked an assistant for a script. He was a professional actor after all. He started reading the script while the leading actors got ready.</p><br/><p>\"Come on, lucky audience member. It’s your turn!\"</p><br/><p>\"I’m coming...\" Qin Guan put down the script and put on the loose suit.</p><br/><p>Before leaving the tent, he cleaned his face with some wet tissues. The dust and sweat on his face were wiped away, revealing his natural beauty.</p><br/><p>\"Hey! Don’t you think he looks familiar?\" an old black actor asked one of his colleagues.</p><br/><p>The younger actor didn't take him seriously. He looked at Qin Guan’s back and said, \"No idea. He is only a tourist picked at random by the director. Rising stars are too busy searching for job opportunities. They would never come to a place like this.\"</p><br/><p>\"That makes sense. But I still feel a little strange. I’ll go take a look.\"</p><br/><p>The black man, who trusted his intuition, went out of the tent and walked to the stage.</p><br/><p>There was a long table there. It was Juliet’s coffin.</p><br/><p>Qin Guan was in the middle of the stage in his funny suit. A strong light was shining down on his head, making him sweat in combination with the summer heat.</p><br/><p>Qin Guan was calm as he looked at the crowded audience. This was just a play. Just another scene in a film.</p><br/><p>The narrator stopped talking. When a crisp knock was heard, Qin Guan moved.</p><br/><p>Holding a bouquet of plastic flowers, he walked to the graveyard of the Capulet family to offer them to his beloved Juliet.</p><br/><p>The director was acting as the narrator.</p><br/><p>\"The younger generation of the two families suffered many mishaps in their lives. Their miserable ending buried the conflicts of their parents...\"</p><br/><p>Qin Guan walked to the coffin slowly, pausing half a meter away from it. Squatting down with shaking shoulders, he lay the bouquet down by the coffin and fell into deep thought.</p><br/>\n</div>"}