{"title": "Chapter 536: Negotiation", "id": 536, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-536-negotiation", "volume_title": "Volume 6", "body": "<h1>Chapter 536: Negotiation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 536: Negotiation</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>\"I admire you, sir, but I don't want to be restrained by this admiration. Fortunately, some of my seniors have been very tolerant about me. They want to start a studio with me without any additional terms.\"</p><br/><p>\"I appreciate benefactors of the circle like you. Thanks to your adherence to the rules, I can do my work more easily.\"</p><br/><p>The people across from him looked ashamed at the mention of the word \"rules\". Is this guy trolling us?</p><br/><p>This was a confirmation that the young man was a wild beast instead of the sheep they had originally thought. They instantly gave up on their plan to control him. His unstrained style and part-time regime were big flaws.</p><br/><p>On the other side, Qin Guan's attitude helped other male models get more chances, so he was not that much of a threat after all.</p><br/><p>Sister Xue saw a chance and broke in.</p><br/><p>\"Now you have all seen Qin Guan. If there’s some difficult job, just call me. If Qin Guan is available, he will do his best to help you.\"</p><br/><p>Under normal circumstances, her opponents would have sneered at her. On second thought though, they exchanged a hostile glance and decided to unite in order to fight a common enemy. When they left the meeting room, they would be arch enemies again.</p><br/><p>If their own models failed an audition, the best solution would be to recommend Qin Guan. The harm would be much smaller that way. That was the reality of the situation. Profit always prevailed.</p><br/><p>Sister Xue's suggestion lightened up the atmosphere. Everyone was eager to see what the Chinese woman would bring to the American fashion circle.</p><br/><p>The \"Chinese Foreign Model Exchange Association\" sounded very noble and official. It had been established by Qin Guan just a few days earlier, and it was actually a semi-official Chinese exchange organization that would lift China’s veil to the international fashion circle. From then on, there would be Chinese models working internationally. A Chinese trend would start.</p><br/><p>\"Great! Let's get back to the topic now. May we have the honor of meeting the real leading actors, Ms. Xue?\"</p><br/><p>Qin Guan was quickly brushed off by the profit-oriented businessmen. He rubbed his nose awkwardly and turned his eyes to the door.</p><br/><p>\"Of course, one minute...\"</p><br/><p>Sister Xue stood up to open the door, smiling to herself. She was both relieved for Qin Guan and glad about the bright future of Chinese models.</p><br/><p>Crack! The door opened and a group of top Chinese models in traditional Chinese costumes walked in.</p><br/><p>The cheongsam was one of the most elegant costumes of Chinese women. It complimented their curvaceous figures like nothing else.</p><br/><p>Chinese women were the best interpreters of ancient costumes. The costumes looked like mysterious stories on their bodies.</p><br/><p>The cheongsams made their thin shoulders fuller and their slender waists softer. They covered the broad hips of Asian women and made them look graceful.</p><br/><p>Several tall Asian women walked in gracefully one after the other. The details of their robes unfolded before everyone’s eyes like a dreamy ancient country. The fine handcraft and ingenious composition were full of oriental mystery. This was high fashion at its best.</p><br/><p>The principals were attracted by the gorgeous costumes. They were insiders of the fashion circle after all. The models distracted them as they picked up their resumes, where their height, weight and awards were stated clearly.</p><br/><p>Then they started talking to each other in low voices.</p><br/><p>\"This is Du Juan, 179 cm. She looks gloomy. She is perfect for high fashion!\"</p><br/><p>\"That explains it. She is a dancer from Shanghai. A girl from South China...\"</p><br/><p>\"She has won plenty of awards in China. She also has a nice figure...\"</p><br/><p>\"Wow, she was discovered by Mr. Cai!\"</p><br/><p>He was right. Du Juan had been discovered by Cai Zhiwei when she had been a freshman. Her great potential had inspired many fashion insiders to try to promote her.</p><br/><p>Mr. Cai, who had graduated from the Warton Commercial College, was considered a fashion godfather in Shanghai. He was the director of the Chinese branch of the McCann Worldgroup, one of the largest advertising companies in the world.</p><br/><p>\"Shall we keep her?\"</p><br/><p>\"Of course.\"</p><br/><p>Fierce sparkles started flying among them. They would begin competing over her soon. They had all marked down Du Juan's name.</p><br/><p>Du Juan’s beauty made the next models pale in comparison. They couldn't impress anyone who was familiar with top models.</p><br/><p>The principals thought there was only one pearl among the girls, when Lv Yan, the last model, suddenly walked in.</p><br/><p>Sister Xue had tried to make her look different by making her wear a scarlet robe. Chinese people believed that scarlet suit girls with fair skin. A girl with darker skin would have looked ugly in that robe.</p><br/><p>Qin Guan smiled bitterly. It seems like Sister Xue is not confident about my taste.</p><br/>\n</div>"}