{"title": "Chapter 546: Silence in China", "id": 546, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-546-silence-in-china", "volume_title": "Volume 6", "body": "<h1>Chapter 546: Silence in China</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 546: Silence in China</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Miramax was a local film company, but it had invested a lot in media promotion. The director of the film was a controversial celebrity, so when Qin Guan and his team returned to America, they found a grand reception waiting for them.</p><br/><p>It was the first time Qin Guan was enjoying an official welcoming ceremony. There were reporters instead of fans waiting for them at the airport.</p><br/><p>\"George, someone pointed out acutely that the film was saved by the performance of the leading actor. It didn’t have any other redeeming qualities. What do you think about this?\"</p><br/><p>\"George, European critics gave the film three stars because they found it boring. Do you agree with that?\"</p><br/><p>Qin Guan felt sorry for his director as he heard those harsh questions. Soon, the reporters turned to him.</p><br/><p>\"Mr. Qin Guan, this is not your first time to win a Best Actor Award at a European film festival, but people say that you can only act in indie films. What do you think about that?\"</p><br/><p>\"Mr. Qin Guan, you have won two Best Actor Awards now. Do you think you qualify to star in a teen comedy?\"</p><br/><p>\"I heard that no other actors had a chance of getting cast in ‘Mean Girls’ after your audition. Does this mean that you are a good actor, or are you just sabotaging inexperienced actors?\"</p><br/><p>\"Mr. Qin Guan, why didn't you get cast in ‘50 First Dates’?\"</p><br/><p>The reporters seemed well-prepared. Now that Qin Guan had won a second award, some people seemed eager to steal some of his fame. As a profit-oriented company, Miramax was taking advantage of this to distribute copies of the film all over the country.</p><br/><p>George Clooney was annoyed by the reporters. Thanks to the rest of the crew, he and Qin Guan got into a car and headed downtown. They parted when they reached the urban area.</p><br/><p>Only when Qin Guan returned to his apartment and put the Silver Bear next to the Golden Palm did he realize that all this was actually happening. A second award! I’m getting closer to my goal!</p><br/><p> Qin Guan was focused on getting married. Meanwhile, Sister Xue was reading through the day’s newspapers. There were photos of Qin Guan with the Silver Bear on the front pages with the striking title \"The indie film fairy\".</p><br/><p>The next day, the news were published by the domestic media. Chinese people didn’t pay much attention to foreign films. They only knew that a director named Li Yang had won an award for his first film, while famous director Zhang Yimou had only gotten a consolation prize. Meanwhile, a strange Chinese young man had won the Best Actor Award for an American film.</p><br/><p>The Chinese had won plenty of awards at the festival, which was a good outcome. They had no idea that on the Haijiao forum, fans of Qin Guan, Ge You and Chen Daoming were fighting fiercely over the value of the mainland actors.</p><br/><p>Thanks to his Best Actor Award at Cannes and solid foundation on the China mainland, Ge You was neck to neck with Qin Guan. The talented actor was also a handsome man of the previous generation. Chen Daoming also had a lot of Chinese fans. The domestic prizes he had won were more than Qin Guan’s.</p><br/><p>Qin Guan's fans lost the battle, the invincible girls getting crushed by a larger population.</p><br/><p>\"A supporting actor can also win a Best Actor Award! Does this mean the actors’ skills are not comparable?\"</p><br/><p>\"He is really limited as an actor. He acts only in indie films abroad. Those films win prizes very easily.\"</p><br/><p>\"Why doesn’t he act in domestic indie films, so we can evaluate his acting skills objectively?\"</p><br/><p>\"Yes, the two films were not in theaters in China. Maybe he just portrayed a funny countryman!\"</p><br/><p>\"The ‘Blind Shaft’ only tells a story of miners. It’s destroying our reputation!\"</p><br/><p>That was the disadvantage of misinformation. The abundant analysis of the dark side of humans in Chinese indie films made the audience flinch. When one talked about Chinese indie films, their first thought was their depressing feeling.</p><br/><p>That was why they did not care about the award-winning indie actor. They focused on films about realistic everyday stories instead.</p><br/><p>As a result, the news about Qin Guan were soon pushed aside by other gossip. His influence would be decided by L’Oreal and Tiffany, which had rushed into the Chinese market in a formidable way.</p><br/><p>The principal of L’ Oreal wanted everything to be perfect. In the summer of 2003, the king made his presence known in Asia.</p><br/>\n</div>"}