{"title": "Chapter 549: Sunflowers", "id": 549, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-549-sunflowers", "volume_title": "Volume 6", "body": "<h1>Chapter 549: Sunflowers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 549: Sunflowers</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>As they were planning on pulling Qin Guan onto their boat, Zhang Yang suddenly recalled something. He stood up excitedly and started coughing hard. He had choked on some peanuts.</p><br/><p>\"Careful! If we were not here, you would have choked to death.\"</p><br/><p>Zhang burst into tears as he laughed and coughed at the same time.</p><br/><p>\"I have shot a f*cking film with Qin Guan! I nearly forgot! I have no time to chit chat! I have to claim my copyright with Two Sung as soon as possible! I will also need a distributor. Zhang Weijing! I’ve heard that he likes Qin Guan very much!\"</p><br/><p>The news caused turbulence in the warehouse.</p><br/><p>\"Bloody hell! You are so cunning! When did that happen? Back when he was a nobody?\"</p><br/><p>\"What film? I’ve never heard of such a film!\"</p><br/><p>Zhang Yang put on his helmet fast and turned on the lights of his motorcycle proudly. Then he waved at his brothers in a classical old-film manner.</p><br/><p>\"Sunflowers! It was an indie film!\"</p><br/><p>Liar! It was a propaganda film for the Two Sung DV contest!</p><br/><p>Zhang Yang and Zhang Weining thought of it as a film though. As soon as they heard about the good news from Zhang Yang, Two Sung decided to bring Qin Guan's old posters out again.</p><br/><p>Two Sung had generously sponsored the film.</p><br/><p>The 28-minute short film had been produced by Two Sung and distributed by Zhang Weining. The protagonist had been Qin Guan, the Best Actor Award winner at Cannes and Berlin.</p><br/><p>This was a stain on Qin Guan’s CV.</p><br/><p>Chinese people were fond of such stains though. Qin Guan's fans had gotten to know him through those posters and that film.</p><br/><p>As a film with a limited budget, it had screened three times a day in most cinemas.</p><br/><p>After one week in theaters, attendance had climbed as high as 50%.</p><br/><p>One week later, Zhang Yang had been mad with joy. Despite an investment of only 20,000 yuan, the box office had reached an impressive 5 million!</p><br/><p>At the time, the box office of Chinese films had been very low. The film \"Sunflowers\" had lit up the sky like the final hope of a dark world.</p><br/><p>The premiere had been a quiet affair with few guests. The small hall, which could only hold 200 people, had been filled with directors and distributors that knew each other.</p><br/><p>After the film, most of them had fallen into deep thought. Their sparkling eyes had expressed their admiration of the actor.</p><br/><p>Five minutes after Sister Xue had arrived back in China, film companies began to call her.</p><br/><p>\"Hello, we were wondering if Mr. Qin Guan would return to China to shoot any films anytime soon. We can change our schedule for him.\"</p><br/><p>\"Hello, this is the principal of the China Film Group. What is Qin Guan's schedule like during the next year? We are producing a film called ‘The Emperor Han Wu’...\"</p><br/><p>\"Hello, this is the crew of ‘Dragon Buster’. Would Mr. Qin Guan be interested in participating in our TV show?\"</p><br/><p>\"Hello, I’m calling from ‘Crimson Romance’...\"</p><br/><p>Sister Xue put an ice pop into her mouth proudly.</p><br/><p>After summer vacation, Qin Guan will return to college and his firm. No amount of inglorious films will be able to stop him...</p><br/><p>Suddenly, she received another call on her Nokia. It had to be from the film circle.</p><br/><p>She was quite a busy bee now, so she had gotten a Nokia phone for film contacts, a Sony Ericsson for TV shows, and a Motorola for modelling jobs...</p><br/><p>\"Hi, this is Lu Chuan! You must change Qin Guan’s schedule during the following year. I will be shooting an indie film that will win plenty of awards!\"</p><br/><p>You sound really confident...</p><br/><p>\"What are you talking about?\"</p><br/><p>\"My budget is limited, but Qin Guan said that art is his priority. I’m just informing you. I’ll be contacting Qin Guan directly later.</p><br/><p>Sister Xue panted heavily. Another person dedicated to art... Suddenly, she got another call.</p><br/><p>\"Hello, this is Feng Xiaogang, I have a role in ‘A World Without Thieves’...\"</p><br/><p>Sister Xue threw her ice pop into the dustbin.</p><br/><p>\"Of course, it’s not the leading role, but would he like to audition for it?\"</p><br/><p>A supporting role... Sister Sue looked at the ice pop in the dustbin with regret. Shall I pick it up again?</p><br/><p>As he recovered from the failure of \"Heroes\", Zhang Weining got a new script for Zhang Yimou.</p><br/><p>\"Another period film? Is it a commercial one?\"</p><br/><p>\"Of course! We’ll take advantage of the box office in North America to shoot another film. We’ll make money in America! Considering the fan base we have now, the box office will be even higher!\"</p><br/><p>\"This time, we will use Zhang Ziyi as the female lead and Qin Guan as the hero.\"</p><br/><p>\"Is that even practical?\"</p><br/><p>\"Of course! His appeal is not as low as we imagined. Just look at the box office of his films!\"</p><br/><p>\"We have to call him directly. As far as I know, his agent does not have full authority over his schedule.\"</p><br/><p>\"Okay!\"</p><br/>\n</div>"}