{"title": "Chapter 544: The Silver Bear", "id": 544, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-544-the-silver-bear", "volume_title": "Volume 6", "body": "<h1>Chapter 544: The Silver Bear</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 544: The Silver Bear</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The next day, when Qin Guan stepped on the red carpet, he thought that he was daydreaming.</p><br/><p>The reporters and fans started cheering for him loud enough to wake the dead. Unlike at the Oscars or the fashion shows in Cannes, this was his first time getting cheered on as an actor at a film festival.</p><br/><p>\"Qin Guan, look here!\"</p><br/><p>\"Qin Guan, I love you!\"</p><br/><p>\"I’m your loyal fan. Sign this for me!\"</p><br/><p>\"Qin Guan, look at me! I’m a reporter from France...\"</p><br/><p>As the cameras moved with Qin Guan, the fans got too excited to control themselves.</p><br/><p>The organizing committee had planned for him to stand at the end of the red carpet for several minutes. The fans were competing for a chance to take pictures with him.</p><br/><p>\"Your performance in the film was excellent!\"</p><br/><p>\"Will you come to Milan this year? London would be okay too! I’ll come!\"</p><br/><p>They took advantage of this chance to talk to their idol, expressing their delight to meet him. Smiling, Qin Guan took group photos with them.</p><br/><p>\"This was definitely worth the trip to Berlin.\"</p><br/><p>\"I can die happy now...\"</p><br/><p>Their dramatic responses couldn't influence Qin Guan, who took his seat in the hall. His seat was close to the \"Blind Shaft\" and \"Heroes\" crews.</p><br/><p>Those two completely unrelated films were connected by Qin Guan. Director Zhang Yimou knew Li Yang, but this was the first time George Clooney was experiencing the abilities of Chinese directors.</p><br/><p>The festival seemed to favor Chinese indie films. The film critics and judges were fond of Chinese films.</p><br/><p>They were obsessed with their historical implications. As a result, there were two Chinese nominees.</p><br/><p>As the award ceremony began, George Clooney looked nervous.</p><br/><p>The first award was the Alfred Bauer Special Innovation Award.</p><br/><p>\"The winner of the 53rd Alfred Bauer Special Innovation Award is…‘Heroes’!\"</p><br/><p>The cameras turned to Zhang Yimou, who was a frequent guest at the Berlin Festival. He had begun his journey there with \"The Story of Qiu Ju\". All the media in Berlin knew him.</p><br/><p>Zhang Yimou stood up with a poker face. He looked as calm as ever, but Qin Guan, who had worked with him in the past, could feel his disappointment.</p><br/><p>His failure at the Oscars had hurt him a lot, and now it seemed that the Berlin Festival was not interested in his film either.</p><br/><p>Despite these disturbing thoughts, he had to remain calm before the audience and the media. If he had been a new nominee, he would have been happy about the result, but as a former winner of the Golden Bear, this award was not good enough for him.</p><br/><p>He got off the stage with the cup, completely speechless. It seemed that the ceremony had nothing to do with him, when suddenly another Chinese nominee won an award.</p><br/><p>\"The winner of the Best Actor Silver Bear is Qin Guan...\"</p><br/><p>George Clooney pushed Qin Guan. See? So what if you Chinese directors win awards? I have the Best Actor!</p><br/><p>He automatically protected his honor at Cannes and gave all the credit to himself.</p><br/><p>Wang Baoqiang, who was sitting next to Li Yang, seemed to have taken on an entirely new look. The previous day, when they had returned to the hotel, Qin Guan had sent his own stylist to help him.</p><br/><p>Although the theme of our film is humble, our representatives at the festival should adapt to an international style.</p><br/><p>Wang Baoqiang’s appearance had changed. His messy hair was now short and clean. So was Li Yang's hair. The two men, who were wearing white shirts and fitting suits, seemed more suitable for the red carpet. </p><br/><p>Wang was admiring Qin Guan, who was now on the stage.</p><br/><p>\"Brother Qin is great. He is the Best Actor!\"</p><br/><p>\"Shall I ask Brother Qin for an autograph, director?\"</p><br/><p>\"Director, did I have meat with Brother Qin yesterday?\"</p><br/><p>After delivering an emotional speech, Qin Guan got off the stage with the cute bear and embraced his director, George Clooney.</p><br/><p>Wang turned to Qin Guan like a buzzing bee. Li Yang felt relieved to be rid of the annoying guy. Suddenly, he heard the host say his own name.</p><br/>\n</div>"}