{"title": "Chapter 564: Hint", "id": 564, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-564-hint", "volume_title": "Volume 6", "body": "<h1>Chapter 564: Hint</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 564: Hint</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>DDW: Nice to meet you. I’m Anna.</p><br/><p>Then came the teasing words, \"I like big c*cks...\"</p><br/><p>Qin Guan's eyes widened at the answer.</p><br/><p>When one looked in the distance, their pupils would shrink to focus on a specific point. On the contrary, if something was close to a person’s face, their pupils would expand to cover more than 60% of their eyeballs.</p><br/><p>One could achieve the same effect by controlling the muscles of their eyes. Qin Guan's face occupied the whole screen, his transparent black pupils clear on the camera. Director Nichols couldn't help but admire his charming eyes.</p><br/><p>There was surprise in his eyes. The playboy smiled faintly.</p><br/><p>Qin Guan: You are really bold.</p><br/><p>DDW: Do you want to make love with me?</p><br/><p>At her bolder words, the strict doctor started wondering what to do.</p><br/><p>He suddenly walked to the door and looked around the corridor. Then he locked the door from the inside, locking himself in the solitude of his office.</p><br/><p>There would be no interruptions from patients or nurses now.</p><br/><p>Of course, this was the UK. If this had been China, the doctor would have been too busy to have any spare time.</p><br/><p>The camera zoomed in on the only source of light in the room, the computer on the desk.</p><br/><p>Jude Law sent some even dirtier messages, which would have been impossible to appear on a large screen in China in the fall of 2003.</p><br/><p>The two of them had cyber sex. Qin Guan pulled down the shutters and unzipped his pants...</p><br/><p>Compared to the things he’d had to do during filming \"Confessions of a Dangerous Mind\", this was nothing for him.</p><br/><p>A call came just in time. The two of them talked unscrupulously about sexual fantasies online.</p><br/><p>DDW: Who did you imagine just now?</p><br/><p>Qin Guan: My ex-girlfriends...</p><br/><p>DDW: Details...</p><br/><p>Qin Guan: They fought over me. They bound me down in a hotel and pleasured me.</p><br/><p>Qin Guan: I’d like to share a secret with you. My c*ck is nine inches long...</p><br/><p> Qin Guan glanced down unconsciously, his expression getting captured by the camera.</p><br/><p>Then he looked up again, typing fast on the keyboard. Everyone present was convinced that he really had a nine-inch c*ck.</p><br/><p>He took a piece of chocolate out of his pocket excitedly. Chocolate was the best energy source for doctors.</p><br/><p>His teasing words became bolder and bolder as he chewed on the chocolate as if he wanted to swallow the woman up.</p><br/><p>He had gotten absorbed in the open sexual nature of the woman, when suddenly another call came in. He hung up immediately.</p><br/><p>Then Jude Law made an unreasonable demand. \"Shall we meet?\"</p><br/><p>Qin Guan was a doctor with morals. Feeling disappointed, he replied hesitantly, \"Sorry, but I’m a doctor on duty. We could meet tomorrow afternoon at 1:30.\"</p><br/><p>Jude Law was satisfied. His trick had worked.</p><br/><p>DDW: See you tomorrow, darling.</p><br/><p>Then he turned off his computer.</p><br/><p>Qin Guan was sad that Anna had left, yet a smile still lingered on his face. The woman had attracted his interest. His confident smile was recorded by the camera.</p><br/><p>\"Good! Excellent!\"</p><br/><p>Nichols looked at his watch in satisfaction and realized it was not time for lunch yet. If he was lucky, he could finish another scene.</p><br/><p>\"Qin Guan, do you need a break after your long journey? Is there a time difference?\"</p><br/><p>\"It’s okay, I slept well on the plane.\"</p><br/><p>\"Good! Shall we move on to the next scene?\"</p><br/><p>\"No problem!\"</p><br/>\n</div>"}