{"title": "Chapter 563: London, London", "id": 563, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-563-london-london", "volume_title": "Volume 6", "body": "<h1>Chapter 563: London, London</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 563: London, London</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The taxi drivers in London didn’t get a chance to make fun of Qin Guan's accent though, as Paramount Pictures had sent a car to get him.</p><br/><p>The sun tried its best to declare its presence among the thick fog, but it was in vain. It helplessly buried its head into the clouds again as the car reached the urban area, revealing the historical European city’s beauty to Qin Guan.</p><br/><p>There were no European nobilities dressed elegantly, just busy people shuttling among the streets of the financial center. London looked a lot like Wall Street.</p><br/><p>There were more Asian people there than in New York though. Indians, Pakistanis and Bengalese took up one tenth of the population of the city. The people who worked in the service industry, including waiters, baby-sitters and doormen, were mainly from the Asian continent.</p><br/><p>Qin Guan sighed at the sight. The East India Company was the best example of a colonial operation. The people in South India had been born with a yearning to live in Great Britain and participated in the commonwealth games from afar.</p><br/><p>In London, they would enjoy a nobler education and lifestyle. That concept was planted in their minds since early childhood, taking root deep in their hearts.</p><br/><p>Great Britain had accepted the heritage of its old colony, so it also had to accept a large group of immigrants.</p><br/><p>When Qin Guan joined the crew, he was completely confused. He knew that it was a film with four main characters, but he couldn’t see Natalie Portman, Jude Law, or Julia Roberts anywhere.</p><br/><p>He was the only star among the crew.</p><br/><p>Nichols had to time to explain anything to him, but the screenwriter did.</p><br/><p>\"The four actors never appear together in the same scene. The first half of the film focuses on their different lives and personalities, so the actors need to express themselves well and the director must be confident through the editing process.\"</p><br/><p>\"After discussing this many times, we decided that this small risk is worth it. Just show us your ability, young man. You have gotten a precious chance. If you ruin my script, I’ll kick your ass!\"</p><br/><p>The writer was serious. In Europe and America, screenwriters were much more powerful than their peers in China. In the movie industry in Europe and the United States, a good writer was like a gift from Heaven. They were the soul of the crew and played an important role during the shooting.</p><br/><p>This was a good chance for Qin Guan to do his best. I like this!</p><br/><p> Qin Guan rushed into the makeup room excitedly. As soon as he saw him, Nichols said, \"Tell the stylist not to shave your stubble!\"</p><br/><p>Qin Guan got his costume from the prop team. It was a simple white robe, but he was going to be playing a famous doctor, so it was necessary.</p><br/><p>The first scene was set in a public hospital in London. The crew had rented an independent hospital office. All the lamps were out. Only the lights in the corridor outside were left on, so that the camera across Qin Guan's office could work properly.</p><br/><p>Qin Guan entered the office with a cup of coffee and checked the chat software on the computer screen.</p><br/><p>He had read the script many times, so he was not surprised. London Anonymous BBS was a website where many lonely Londoners and adults who had lost their passion for life tried to meet strangers. It was basically a dating website.</p><br/><p>Doctor Larry was one of those people.</p><br/><p>The camera was rolling.</p><br/><p>\"Larry’s opening scene starts in three, two, camera!\"</p><br/><p>Qin Guan began performing, his fingers typing quickly on the keyboard.</p><br/><p>He was chatting with a user named DDW, who was actually Jude Law posing as a woman.</p><br/><p>Qin Guan’s name was DOC9 and had been assigned to him randomly by the system. He looked casual as he searched through the website.</p><br/><p>DDW: Are you a frequent visitor?</p><br/><p>Qin Guan: No, this is my first time here.</p><br/><p>DDW: What’s your name?</p><br/><p>Qin Guan's hands paused on the keyboard in hesitation before he gave his name.</p><br/><p>Qin Guan: I’m Larry.</p><br/><p>The stranger on the other end of the screen fabricated a woman’s name.</p><br/>\n</div>"}