{"title": "Chapter 570: Old Friends", "id": 570, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-570-old-friends", "volume_title": "Volume 6", "body": "<h1>Chapter 570: Old Friends</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 570: Old Friends</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>Natalie felt awkward. In the next scenes, she would have to strip dance before Qin Guan in an effort to seduce him. The two of them exchanged a glance.</p><br/><p>\"See you tomorrow. I have to read the script again at the hotel.\"</p><br/><p>\"Me too!\"</p><br/><p>The two of them got into their separate fitting rooms.</p><br/><p>Unlike the people in New York, the people in London preferred to lead more fun lives. When Qin Guan opened the door, he found a surprise waiting for him outside.</p><br/><p>\"Ye Dong! Sister Xue! What are you two doing together? I thought I would see you a few days later!\"</p><br/><p>Qin Guan was surprised by Ye Dong's sudden visit. They had made an appointment on the phone for a few days later. Little did he know that Ye Dong would drop in along with his agent.</p><br/><p>\"It sounds like I’m not welcome here.\"</p><br/><p>\"Of course not! I’m so glad to see you!\"</p><br/><p>Sister Xue massaged her sore shoulders and yawned as the two guys hugged each other.</p><br/><p>\"I’m too old for this. I’ll see you tomorrow!\" she said before she opened the door to her room.</p><br/><p>Qin Guan and Ye Dong burst into laughter.</p><br/><p>\"You bastard! You have gotten even more handsome!\" Ye Dong said, hitting Qin Guan on the chest.</p><br/><p>\"Ouch! That hurts!\" That was the exact place where Natalie had hit him.</p><br/><p>\"What's the matter? Did you get hurt during filming? Are you shooting a romantic film or a martial arts film?\"</p><br/><p>Qin Guan invited Ye Dong into his room awkwardly and changed the topic.</p><br/><p>\"Well done! I heard that you are a Chinese ambassador now!\"</p><br/><p> \"Yes, but I’m only in charge of a small project. It actually has something to do with you.\"</p><br/><p>Qin Guan was confused. \"The State Administration of Radio, Film and Television is in charge of promoting films internationally. Your ministry is in charge of imports and exports. Which department do you belong to?\"</p><br/><p>\"Economic Relations with Foreign Countries.\"</p><br/><p>Even Qin Guan knew what this meant.</p><br/><p>\"You are in charge of textiles, right?\"</p><br/><p>Ye Dong snapped his fingers. \"Bingo! Smart boy! I’m also in charge of traditional Chinese art textiles, which are small batches of handmade textiles. What do you think of that? It definitely is related to your work.\"</p><br/><p>His intention was clear. He wanted to promote Chinese textiles all over the world by taking advantage of Qin Guan's influence in the high-end clothing market.</p><br/><p>Qin Guan was cunning though. Ye Dong's flattery did not sway him.</p><br/><p>\"As far as I know, China is a huge textile exporter. We have been making a big surplus these past few years. Most clothes are made in China, and many foreign brands have moved their plant factories there. Our cheap products have nearly driven the British industry, which used to be famous for its textiles, out of the market. Why do you need to promote them even more?\"</p><br/><p>Qin Guan had gotten to the core of the problem. Ye Dong couldn't help but sigh.</p><br/><p>\"I don't care about ordinary products. I don't need to do anything in Europe for orders to come pouring in an endless stream. I’m worried about the guys working for the Ministry of Culture though. They insist that materials can help propel our success.\"</p><br/><p>\"In their opinion, our non-material cultural heritage is fading away. The Chinese market doesn’t welcome expensive folk art and traditional handmade products. These things are not cherished. They are being taken for granted.\"</p><br/><p>\"On the other hand, Westerners have been obsessed with Chinese silk products ever since the maritime navigation era. It's in their blood, so exporting handmade silk products could save us. People will be able to pass on their skills automatically.\"</p><br/><p>Ye Dong seemed like a great man who cared about the fate of his nation.</p><br/><p>\"You’re scaring me! I thought that you wanted me to steal advanced technology from top brands. Don't worry, if this is just about promoting traditional Chinese textiles, I have a gallery that matches what you are looking for!\"</p><br/><p>\"There are limited export channels though, so I’m only a supplier of Hermes and Gucci products. I also introduced Yunjin and shredded silk to America. Because of the complicated production process and low production rate though, as well as the inconvenience of importing goods, the trial is still on a primary stage.\"</p><br/><p>\"If you are in charge of this field though, this is a win-win situation! If you could coordinate the two ministries and open a safe source of supply for me, you wouldn't need to worry about sales in Europe. I could sell anything!\"</p><br/><p>\"The Milan Fashion Week opens in September. We are talking about one of the most famous international fashion weeks. Armani would never miss it.\"</p><br/>\n</div>"}