{"title": "Chapter 587: Record Release", "id": 587, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-587-record-release", "volume_title": "Volume 6", "body": "<h1>Chapter 587: Record Release</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 587: Record Release</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>It was two small Teddy Bear dogs and a Chihuahua with the mighty names Omar, Barton and MacArthur.</p><br/><p>The puppies were so glad to see their master that they jumped up on the couch.</p><br/><p>The housekeeper asked his men to bring in the tortoises, parrots and hamsters. In five minutes, the small living room was filled with different kinds of small pets.</p><br/><p>The housekeeper took a bow. \"What else can I do for you?\"</p><br/><p>Hilton waved him off happily. \"Nothing, you can leave now. Shut the door for me.\"</p><br/><p>When he left, she turned on the TV again. The video clip was broadcasted again at the end of the program. The company sure used every opportunity to promote the record.</p><br/><p>Paris Hilton was focused on Qin Guan, who was sitting on the couch. Suddenly, MacArthur pulled on her sleeve, bringing her back to her senses.</p><br/><p> Paris sighed gloomily and caressed her dogs' heads. \"My boys, this is your master's favorite man...\"</p><br/><p>She looked at the three cute puppies sitting on her thighs. \"If I had to choose between you and him though… I don't think I could abandon you... Oh, my lovely kids...\"</p><br/><p>They all rushed into her embrace. The hamster felt that something was wrong and stopped treading on the wheel. The tortoise in the glass box shrank back in its shell. He could only deal with such a situation by sleeping.</p><br/><p>Qin Guan had no idea that he had been defeated by a group of animals. Cong Nianwei's plan had finally worked. It was good for a couple to get to know each other first. That way, one could discover the shortcomings of a possible partner.</p><br/><p>If they still liked them, then they could continue their journey together. Otherwise, it was better to find out before they got married.</p><br/><p>Qin Guan, Britney and Madonna's fans were excited about the program, which ranked among the top three entertainment shows in America.</p><br/><p>They all expressed their joy online. The next morning, record stores in New York, Los Angeles, Boston, Chicago and other cities experienced high sales.</p><br/><p>The sales should have been slow in the morning, but the staff at the stores were really busy. There were long queues between the shelves. Young men in different outfits waited to sample the single before the TV.</p><br/><p>The record company had paid for that particular service. The single had to be the main attraction in all stores during the week.</p><br/><p>Posters of Qin Guan and the other two stars were everywhere. On the windows, on the shelves, on the doors... As soon as the doors opened, the people passing by would hear the music.</p><br/><p>The unscrupulous publicity attracted the public. If they could have, the store managers would have taken their subwoofers out on the streets. There were actually some people who were doing this in some towns in the South.</p><br/><p>Qin Guan was reminded of past times in China, when all stores had been playing the same pop song for the public to hear.</p><br/><p>The shelves were empty soon. The store owner received urgent calls from his staff.</p><br/><p>\"Boss, the third store in Manhattan is out of stock. We don't have enough VD113 and VD456 left!\"</p><br/><p>That was the power of connected sales. The customers would buy other albums as they waited. That explained why some independent stores liked to cooperate with record companies.</p><br/><p>The store owner possessed half the record stores in New York. He was busy answering calls in his office, all of them asking him for more stock.</p><br/><p>He had originally thought that he had overestimated the single's sales potential, but he had actually sold out all the stock in half a day!</p><br/><p>All he could do now was beg the record company for more copies. He was quite content with the adversity.</p><br/><p>I like to suffer this way.</p><br/><p>As the actor featured in the video of the hit song, Qin Guan felt strange. He was standing on Times Square, witnessing the rise of a Chinese brand among foreign brands.</p><br/><p>Guo Nuoyan was in full formal attire. Even though it was scorching summer, he was still dressed properly. Qin Guan was just a guest at the ribbon-cutting ceremony, so he didn't need to dress like an official.</p><br/>\n</div>"}