{"title": "Chapter 586: A Musical Interview", "id": 586, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-586-a-musical-interview", "volume_title": "Volume 6", "body": "<h1>Chapter 586: A Musical Interview</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 586: A Musical Interview</p><br/><p>Translator: Lan Editor: Efydatia</p><br/><p>The cliff, the combination of high speed and danger, the mix of strength and beauty, and the sharp turn between the blue sky and the ocean was a feeling that men loved. The male audience was inspired with a desire to conquer.</p><br/><p>\"Bloody hell! What a wonderful advertisement!\"</p><br/><p>\"Is this a new car?\"</p><br/><p>\"Shall we buy it, darling?\"</p><br/><p>\"Oh, my! Let me check my bank account...\"</p><br/><p>Qin Guan's fans expressed their confusion immediately.</p><br/><p>\"The model driving the Cadillac looks like Qin Guan.\"</p><br/><p>\"Yes! We couldn't see his full face, but the different parts we saw looked like Qin Guan.\"</p><br/><p>\"It must be Qin Guan.\"</p><br/><p>\"How do you know?\"</p><br/><p>\"Check his blog!\"</p><br/><p>The fans refreshed their browsers and saw the latest news about the car advertisement.</p><br/><p>That was proof enough of Qin Guan's presence in the advertisement. However, Qu was in a bad mood as she looked at the screen.</p><br/><p>Some even more striking news would be released later that night.</p><br/><p>Those cunning businessmen kept exchanging information with each other.</p><br/><p>That explained why Guo Nuoyan had announced in the afternoon that J Clothing would open three flagship stores in New York. The locations included the New York Times Square, the Upper East Side, and the most central part of Wall Street and Chinatown.</p><br/><p>As the director of J Clothing in America, Guo was smart enough to grab this opportunity.</p><br/><p>Qu sighed and kicked her lunch box away before she changed the channel to the most popular music show.</p><br/><p>Record companies were also good at seizing opportunities. During the scorching summer, both Madonna and Britney had been busy preparing for their tours. Their joint single had suddenly been released.</p><br/><p>After a short news broadcast, the host interviewed the two singers. The two blonde women were smiling.</p><br/><p>\"Did anything interesting happen during the recording?\"</p><br/><p>The host showed them the latest issue of VOGUE with a meaningful smile. Qin Guan was smiling on the cover.</p><br/><p>\"It's said that this Asian model caused a fight between you! We are really curious about the details.\"</p><br/><p>The singers exchanged a glance and smiled widely.</p><br/><p>\"You didn't see him. He is so handsome... Pictures only capture one tenth of his charm.\"</p><br/><p>\"Really? But this is a famous magazine!\"</p><br/><p>\"That's true...\" Britney backed up Madonna. \"Do you want to know why we didn't deny the news? He is a really handsome guy, but as you know, the three of us are good friends. We would never fight over a man, but we all admire his beauty. Anyone who has seen him would agree with us.\"</p><br/><p>Britney winked at the camera. Her reply aroused the interest of the host.</p><br/><p>\"It's said that your single, which was released yesterday, features Qin Guan in the video clip...\"</p><br/><p>The two famous singers nodded.</p><br/><p>\"You could buy it and find out. It's a song of very high quality that combines our different styles. It also features the most handsome male model in the world...\"</p><br/><p>\"Yes!\" Madonna nodded energetically. \"Double enjoyment for both your ears and eyes!\"</p><br/><p>\"We fought to get Qin Guan in the video.\"</p><br/><p>The host covered his mouth dramatically. \"So those news were just a warm-up?\"</p><br/><p>\"You have a point!\" the two women answered together.</p><br/><p>Qu tittered and threw the remote control on the tea table. Some banana peels fell down from the table.</p><br/><p>\"My house needs cleaning again. Why did the housekeeping company ask for extra money?\"</p><br/><p>Meanwhile, Paris Hilton was watching the show in her apartment, all kinds of feelings flooding her heart.</p><br/><p>Her housekeeper unpacked her luggage silently. He did not speak until Paris turned the TV off.</p><br/><p>\"Miss Hilton, I have already sorted your luggage out. The rooms here are not enough to hold all your pets though. I only moved a few of them in here.\"</p><br/><p>Hilton smiled with joy. \"Bring them here, please!\"</p><br/><p>The housekeeper asked the staff to bring her pets in one by one.</p><br/>\n</div>"}