{"title": "Chapter 592: Captivated", "id": 592, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-592-captivated", "volume_title": "Volume 6", "body": "<h1>Chapter 592: Captivated</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 592: Captivated</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>A confirmed rumor was a great topic for conversation. They were all glad to be the witnesses of such an important social issue.</p><br/><p>As a result, other officers visited the bustling office one after the other with different excuses. They tried to act calm as they exchanged a few words with the receptionist to get a general idea about the cause and effects of the incident. Then they left, covering their mouths to suppress their laughter.</p><br/><p>In a few minutes, the news had spread all over the station. The sergeant was the last one to hear them. He rolled his eyes and knocked on his desk with a pen, a cunning smile forming on his face.</p><br/><p>\"Let's go! I want to have a look at this troublemaker...\"</p><br/><p>People were usually inclined to flatter their boss, so a group of people followed him in a formidable array as he walked to the office on the first floor.</p><br/><p>The officer in charge was sitting behind his desk. He had gotten a cup of instant coffee and a doughnut for Qin Guan. It was a boring, kind task, but someone had to do it.</p><br/><p>\"What's your name?\"</p><br/><p>\"Qin Guan.\"</p><br/><p>\"Age?\"</p><br/><p>\"22.\"</p><br/><p>\"Occupation?\"</p><br/><p>\"College student.\"</p><br/><p>\"Huh? Something is wrong here. How could a college student cause a public riot?\"</p><br/><p>\"It was not a riot. His fans were just trying to express their joy...\"</p><br/><p>The officer gestured, interrupting Qu. \"I'm questioning him. Who are you?\"</p><br/><p>Qu gave him a business card, trying to express her opinion in the nicest possible way. \"Qin Guan's lawyer is on the way. The man who called the police was just trying to save him. That can't be a crime!\"</p><br/><p>\"That remains to be determined. Was there any damage to public property? Was public security risked? Did you register the event at the administrative office? You are too careless when it comes to your job!\"</p><br/><p>Qu tried to suppress her anger. How was she supposed to know that the record company would release the single that day? It was just a video clip after all. Neither Qin Guan nor Qu had paid any attention to it.</p><br/><p>Qin Guan pulled at Qu's sleeve in an effort to calm her down. The officer was being mean to him for no reason, so all they could do was wait for Cui Ming quietly.</p><br/><p>They both answered the man's questions. As a Chinese guy with great viability, Qin Guan tried to make things better for himself.</p><br/><p>The officer finished questioning him and went into another office. Taking advantage of his absence, Qin Guan tried to put on a performance.</p><br/><p>\"Hey, beautiful. May I have some water?\"</p><br/><p>Qin Guan looked at the receptionist with a helpless expression. His black eyes were misty as he pursed his lips and fixed his eyes on the coffee in her hand.</p><br/><p>The receptionist was a black girl of about 90 kilos. She flushed at his look. She just couldn't control herself in front of the young man.</p><br/><p>\"What would you like? William is taking this too far. This is a police station, not a high-security prison. An innocent young man shouldn't be tortured like this. Wait a minute...\"</p><br/><p>The girl left and came back in two minutes with a tray.</p><br/><p>\"Mineral water, juice and coffee. Make yourself at home!\"</p><br/><p>Qu was ignored once again.</p><br/><p>Qin Guan smiled shyly at the receptionist. \"Thank you so much! You are such a kind girl...\" Then he looked at the young policeman. \"You too. You are the hero who saved my life!\"</p><br/><p>The young man was shocked by the acknowledgment. He felt as refreshed as if he had drunk a glass of iced water in the summer.</p><br/><p>\"You are welcome. I was just doing my duty...\"</p><br/><p>Qin Guan kept acting. By the time William came back, the whole office was captivated by him.</p><br/><p>\"You and your oriental magic! Don't try to play tricks on me!\"</p><br/><p>\"What tricks?\"</p><br/><p>Before the man could finish his threat, he heard a familiar voice behind him. The Police Chief was standing at the entrance of the messy office with his right-hand men.</p><br/><p>Another voice came just in time. \"Hello, I'm Cui. I'm Qin Guan's lawyer!\"</p><br/><p>Cui Ming had appeared like the Savior, followed by Xu. The charged atmosphere eased up immediately. William's attitude changed when he saw his superior, and he sighed helplessly at the arrival of Qin Guan's lawyer.</p><br/><p>Cui started taking care of the standard procedure as the Chief met with Qin Guan and Qu in his office.</p><br/>\n</div>"}