{"title": "Chapter 590: Out Of Control", "id": 590, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-590-out-of-control", "volume_title": "Volume 6", "body": "<h1>Chapter 590: Out Of Control</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 590: Out Of Control</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The reporters were shocked by the crazy customers, who were shuttling among the shelves freely.</p><br/><p>\"Look at this! It's the shirt from the poster. It feels so good… Plus, the price is reasonable!\"</p><br/><p>\"You are right! I'll buy one for my dad. Hey, is there a larger size?\"</p><br/><p>Everyone around was thinking of the strong man in the yellow outfit. As they burst into laughter, more and more people poured into the store. Some of them were curious customers, while others were just looking for Qin Guan.</p><br/><p>\"I can see him!\"</p><br/><p>\"Qin Guan!\"</p><br/><p>\"He's here!\"</p><br/><p>A girl finally spotted Qin Guan through the crack of the warehouse door.</p><br/><p>Before he revealed the poster to the public, Guo had led Qin Guan to the warehouse. It was a smart decision on his part. When most people left, Qin Guan would go out to meet a few customers so the reporters could take some pictures of the warm scenes. This would be really good publicity.</p><br/><p>Reality was cruel though. Who could predict that the combination of the record and the poster would cause such a disaster?</p><br/><p>The troublemaker was eventually spotted by the sharp-eyed fans.</p><br/><p>The girl attracted the attention of all the customers, who put the clothes they had been holding down and looked towards the door.</p><br/><p>They all headed in that direction in a formidable array. Even the aggressive reporters retreated before them.</p><br/><p>Guo turned around nervously and looked at Qin Guan.</p><br/><p>\"What should we do? Run away, Qin Guan!\"</p><br/><p>Impossible! There was no door. There was only a vent hole.</p><br/><p>Amused, Qin Guan stood up calmly.</p><br/><p>\"Don't worry. My fans love me. My charm can solve any problem!\"</p><br/><p>He suddenly pushed the door open. The screams outside were followed by a riot.</p><br/><p>\"Ah! Qin Guan! Catch him!\"</p><br/><p>\"Wow! I liked his dance moves with Madonna!\"</p><br/><p>\"Come here, handsome!\"</p><br/><p>Countless hands reached out for Qin Guan. The problem was not solved by any means.</p><br/><p>\"Help!\" Qin Guan cried out as he was pulled into the crowd, questions still flashing in his mind.</p><br/><p>Why aren't my fans listening to me?</p><br/><p>Why aren't they greeting me politely?</p><br/><p>Why are these guys crazy?</p><br/><p>If he had observed his fans carefully, he would have known the answer.</p><br/><p>The fans that admired his looks and acting skills had been shocked by his outstanding performance and talent. That group were polite and reasonable individuals.</p><br/><p>This was the first time Qin Guan was meeting crazy music fans though. Those kind of fans could destroy a stage during a live concert or hurt the security staff.</p><br/><p>Qin Guan was facing a disastrous defeat.</p><br/><p>Guo was shaking in the warehouse. His men had also failed to contain the crazy fans.</p><br/><p>This was a bad day for Qin Guan. There were numerous record stores around Times Square.</p><br/><p>Safety was always a priority though, so the clever reporters retreated from the store and gathered around the entrance to take pictures of the striking scene.</p><br/><p>The situation was completely out of control. Fortunately, Guo thought of Qu.</p><br/><p>Qu answered Guo's call, covering her face at his stupidity.</p><br/><p>\"Call the police! They are responsible for crowd control. I thought this was a simple event... That was such a mistake!\"</p><br/><p>\"Our priority is to keep Qin Guan safe. Tell him to stop struggling. We don't want him to get stamped on! Do as I tell you! I'll get there as soon as I can!\"</p><br/><p>Qu hung up and drove to Times Square at high speed.</p><br/><p>Guo made several quick calls and then shouted at the crowd, as if he was about to die a heroic death.</p><br/><p>\"Calm down, everyone! Qin Guan is working. Don't bother him. He'll set aside some time for you...\"</p><br/><p>It was a pity that his effort was in vain. Some outraged girls pushed him away. He was standing in the way of their idol after all.</p><br/><p>Bang! A few shelves were knocked down during the riot. Meanwhile, several police cruisers pulled up to the store.</p><br/>\n</div>"}