{"title": "Chapter 600: Warmth", "id": 600, "volume": 6, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-600-warmth", "volume_title": "Volume 6", "body": "<h1>Chapter 600: Warmth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 600: Warmth</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"But he is different! He is a model. A model! Did you know that?\"</p><br/><p>Michael shook his head and had another bite of sausage gloomily. Laura held her head high proudly and pointed at the TV.</p><br/><p>\"Our dads always read such magazines. The people on them hardly wear any clothes. They are all models.\"</p><br/><p>Michael sniffled. \"You mean the magazines mom throws away? My dad takes them back secretly. If he is a model, you can't like him.\"</p><br/><p>\"Why?\"</p><br/><p>\"He is too poor to afford clothes...\"</p><br/><p>\"Ha ha!\"</p><br/><p>The adults burst into laughter. The children's words inspired them though.</p><br/><p>\"I heard that Chinese guy won two Best Actor Awards. He has shot films in different European cities.\"</p><br/><p>\"Yes. Should we invest in a movie considering the tough economic situation?\"</p><br/><p>\"Stop joking! None of us knows anything about that industry. Besides, Italian films do not have a good reputation...\"</p><br/><p>As an authentic Sicilian family, they had lawyers and other people working for them, who were far smarter and better at solving such problems.</p><br/><p>\"But he said that he would like to work with a good director and a good script...\"</p><br/><p>\"That would be simple. We could just find an Italian director.\"</p><br/><p>\"Nobody would dare turn down our money.\"</p><br/><p>Just like that, a strange financial group formed, with a film starring Qin Guan as their ideal investment plan.</p><br/><p>After working for a whole day, the models were presented with two choices on the evening of the Fashion Week.</p><br/><p>The first one was perfect for the average model who was focused on his or her career and public relations. They could attend the customary party before the festival, which brought together top designers from different countries. That event would help along their career and contacts.</p><br/><p>The second choice was for people like Qin Guan, who were inclined to keep a distance from big crowds. Most of them were anti-social, but Qin Guan was just lazy.</p><br/><p>He would rather call his girlfriend, put on a comfortable robe and say goodnight.</p><br/><p>Sister Xue also felt good about the arrangement. Before sleeping, she uploaded the new photos on the blog.</p><br/><p>There was a group of thirsty fans waiting for the photos like cubs crying out for food.</p><br/><p>\"The page has been updated!\"</p><br/><p>The news were spreading online. All the fans went crazy over the photos. They were even jealous of the wall that Qin Guan had touched.</p><br/><p>Even the cab and the lonely fire hydrant in the background of the pictures became objects of obsession. They had been part of Qin Guan's journey after all.</p><br/><p>\"In my next life, I want to be a prop next to you...\"</p><br/><p>\"What if Qin Guan was reborn as a tough man in his next life?\" Wood objected. He was the one closest to reality.</p><br/><p>Qin Guan didn't participate in the discussion. The receiver had fallen from his hand and landed on the blanket. He had fallen asleep.</p><br/><p>The gentle voice of a woman could be heard through the receiver. Then there was a beep... She had hung up.</p><br/><p>A greeting from her lover was enough for her.</p><br/><p>The next day, the weather was sunny again. Qin Guan and some top models from other countries were waiting in the small backstage area. Assistants were holding clothes from different brands. It was a silent battle of the brands.</p><br/><p>Even the best models had to work in that plain room.</p><br/><p>People shuttled in the crowded dressing rooms and messy fitting rooms. Even an experienced director couldn't have maintained the order. There were no VIPs or senior executives there. The models had to fight by using their own abilities. Runway shows were important for evaluating a model.</p><br/><p>Qin Guan was calmly waiting for his turn to use the fitting room. He seemed like a clear spring in the bustling backstage area.</p><br/><p>\"Look at that Asian model! Is it Qin Guan?\"</p><br/><p>\"Yes, there is only one Asian man in the opening show!\"</p><br/><p>\"He looks so calm!\"</p><br/><p>\"Of course. He is the only Asian here, and he will be the first one to get on the stage. One has to be brave to get here!\"</p><br/>\n</div>"}