{"title": "Chapter 617: Stars at the Airport", "id": 617, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-617-stars-at-the-airport", "volume_title": "Volume 7", "body": "<h1>Chapter 617: Stars at the Airport</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 617: Stars at the Airport</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan spotted Liu Xiaoyang and Li Jie among the crowd. The two of them looked speechless from guilt.</p><br/><p>\"Cong Nianwei?\"</p><br/><p>\"Yes?\"</p><br/><p>The couple slowed down.</p><br/><p>\"Are they waiting for us?\"</p><br/><p>\"They must be.\"</p><br/><p>\"Shall we just walk past them and pretend we don't know them?\"</p><br/><p>\"I was thinking the same.\"</p><br/><p>The noisy crowd had attracted the attention of the security guards, who had gathered around them. Some people were whispering to each other.</p><br/><p>\"What happened? Is some big shot flying in?\"</p><br/><p>\"Are you kidding? They would never arrive at a civil aviation terminal. And those kids couldn't have heard about it. It must be some kind of celebrity. They leak the news themselves to create rumors.\"</p><br/><p>\"The security guards have just noticed them. If it was some famous star, their PR team would have informed them in advance. They usually behave themselves.\"</p><br/><p>\"Maybe the news were leaked in secret. Maybe we'll get to see a superstar!\"</p><br/><p>An old Peking man sniffled. \"A superstar? There are only a few international flights at this exit. Those kids like only Korean hoodlums.\"</p><br/><p>He sounded reasonable.</p><br/><p>Qin Guan and Cong Nianwei were lingering around the exit, hesitant to meet those guys. We'd rather get some rest here. </p><br/><p>They set all their luggage down and took a seat. Suddenly, people began to pour through the other exits.</p><br/><p>They saw four young men of different heights and physiques that seemed good at dressing up. Long black hair, blue eyes, clean short hair… The handsome boys looked avant-garde among the Chinese travellers.</p><br/><p>Qin Guan recognized them at first sight. It's the F4 [1]...</p><br/><p>A group of about five people followed them with their luggage. It seemed like they would be attending many publicity events in the Chinese Mainland. They were still popular in China, so they must have come to make some quick money.</p><br/><p>\"They seem like celebrities. We have been abroad for more than a year though, so I'm unfamiliar with them,\" Cong Nianwei told Qin Guan.</p><br/><p>\"They used to star in a campus drama,\" Qin Guan explained patiently. \"They are superstars in Southeast Asia. I'll download their TV show if I can.\"</p><br/><p>They watched the group move towards the exit, when Qin Guan suddenly spotted another acquaintance. Actually, it was an acquaintance from his past life. Qin Guan knew him, but he didn't recognize Qin Guan.</p><br/><p>A man in the center of a group of South Koreans was showing off his identity to the others.</p><br/><p>In 2003, plastic surgery in South Korea hadn't reached its peak yet. There were few handsome men in the entertainment circle, most of whom succeeded thanks to their temperament and stylish outfits.</p><br/><p>The TV show they starred in featured love triangles, illness and death. It was long and very boring.</p><br/><p>Housewives, who were tired of serious TV shows, loved it though. More and more Chinese people fell in love with the actors, so the Koreans had recognized the potential for business opportunities.</p><br/><p>Pei Yongjun had come to China to meet his fans on a secret invitation. The organizer did not want to cause them trouble. All he wanted was a chance to show off. Spending time at an irrelevant place like the airport was unnecessary.</p><br/><p>After being hidden for so long though, the Koreans felt inclined to reveal their presence. They hadn't kept a low profile during their trip. In order to avoid fans, one had to dress in everyday clothes and follow the stream of people, but they did the exact opposite.</p><br/><p>They were all wearing uniform black suits. Pei, who had a white windcoat and a grey scarf on, was in the center of the group. His poor female assistants were pushing two trolleys of luggage behind him. Women were very underprivileged in South Korea. </p><br/><p>The Chinese people around them couldn't bear to watch. The old Peking man spoke again.</p><br/><p>\"Our female comrades should have retired after the war to fight the U.S. aggression and aid Korea.\"</p><br/><p>Qin Guan and Cong Nianwei burst into laughter.</p><br/><p>\"Our boys will be annoyed by their popularity. Look at those mainland guys waiting here! How did they know?\"</p><br/><p>\"I don't know. They are behaving themselves after all. They stood in line without making a fuss.\"</p><br/><p>\"If the fans are alright, you could go greet them. I could take some pictures,\" said the agent of the F4, who was a woman of her word.</p><br/><p>The four boys nodded. Their future would be decided by her agency. Such an order would not affect the whole picture though.</p><br/><p> They all walked over, putting on their famous smiles, which were very popular in Southeast Asia. Many Thailand princesses had been addicted to them.</p><br/><p>\"Hi! How are you?\"</p><br/><p>They went through the corridor, their staff leading and protecting them.</p><br/><p>[1] A group of four men, Yang Chengxu, Zhu Xiaotian, Zhou Yumin and Wu Jianhao, famous for “Meteor Garden” in 2001 in Taiwan.</p><br/>\n</div>"}