{"title": "Chapter 611: An Unprecedented Performance", "id": 611, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-611-an-unprecedented-performance", "volume_title": "Volume 7", "body": "<h1>Chapter 611: An Unprecedented Performance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 611: An Unprecedented Performance</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>A doorknob jingled on the wooden gate as the audience quieted down. The sound was lonely and sad. The lights had changed to a white color that was almost transparent.</p><br/><p>Music was played by the traditional string and woodwind instruments as a man walked through the gate.</p><br/><p>It was Qin Guan. He was walking towards the audience as if he was strolling in a courtyard, watching the tide or appreciating a beautiful rainbow.</p><br/><p>He was wearing red, which was the hardest color to pull off. People usually looked like bridegrooms or countrymen in it. It was very difficult for a model to pull it off on the stage.</p><br/><p>The formal outfit was titled \"succeeding in a government examination\" and it was a re-imagination of a traditional costume in a more dramatic, exaggerated manner. In ancient China, successful candidates of the highest imperial examinations would parade down the streets in such outfits.</p><br/><p>The clothes were made of red Yunjin and they were handmade by Yin, so they were unique in the Milan Fashion Week. The long hem was trailing after Qin Guan on the floor, moving up and down in waves, and the silver threads weaved on the inside were flowing along with his steps. Qin Guan's outstanding skills were admired by the audience.</p><br/><p>His hands were hidden in the long, loose sleeves with the hollow embroidery. There was an intricate cloud pattern on the white silk, and the belt around Qin Guan's waist complimented his perfect figure.</p><br/><p>Before anyone could come back to their senses, Qin Guan had reached the end of the stage. He stood there for three beats and then suddenly started dancing along to the music.</p><br/><p>He opened his arms as wide as he could to show the sleeves to the audience. It was a traditional \"birds paying homage to the phoenix\" pattern, which was the highest level of Chinese embroidery.</p><br/><p>\"Wow!\" The exquisite embroidery earned everyone's admiration. Suddenly, the drums started beating again.</p><br/><p>Qin Guan smiled. His lips were red, and his eyebrows were black. His face looked like a blooming peach blossom.</p><br/><p> Everyone was stupefied as he moved. He waved his long sleeves around while he danced, his steps hidden under the long hem of his outfit.</p><br/><p>The drumbeats became faster and faster as Qin Guan turned around on his tiptoes, the long sleeves moving around him like a flower. The gold and silver threads on the lining were revealed to the audience.</p><br/><p>A harp jumped over the dragon gate, reflecting the title of the outfit. The painting had come to life!</p><br/><p>\"Wow!\"</p><br/><p>People began to talk with each other as the show site turned into a bazaar. When the drumbeats came to an end, Qin Guan paused suddenly and flicked his long sleeves out.</p><br/><p>Then he turned around and left with steady steps.</p><br/><p>It was not easy. Everyone knew that a person got dizzy after spinning around for a long time. One had to train hard in order to walk this leisurely. Models were no ballet dancers though. It was impossible for them to do that.</p><br/><p>Qin Guan was gone with the wind. The final notes of the flute faded away as the mysterious figure disappeared through the gate.</p><br/><p>A deafening applause broke out.</p><br/><p>Ye Dong flushed. He clapped his hands as hard as he could, showing off to the people around him. \"Qin Guan was my classmate. He is Chinese...\"</p><br/><p>He received a lot of praise. Thumbs were waving before his eyes.</p><br/><p>\"It's a miracle! Chinese people must be good at magic!\"</p><br/><p>\"It was so beautiful! I'll buy everything!\"</p><br/><p>As everyone got excited, the gate opened again for the encore. This was Yin Changtao's moment.</p><br/><p>Fully-dressed models clustered around the strong man. Qin Guan stood right next to the designer.</p><br/>\n</div>"}