{"title": "Chapter 624: Taking Clients Out To Dinner", "id": 624, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-624-taking-clients-out-to-dinner", "volume_title": "Volume 7", "body": "<h1>Chapter 624: Taking Clients Out To Dinner</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 624: Taking Clients Out To Dinner</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Surrounded by his students, the cook began his lesson.</p><br/><p>\"Master, who is he? This is a bigger feast than the Spring Festival or any other kind of festival!\"</p><br/><p>\"Yes, it is. The guests are all college students. It must be a student's party,\" the cook replied calmly.</p><br/><p>\"It's not graduation season. Besides, I heard that the host came alone. What a black sheep! If I had done that, my mom would have beaten me to death!\"</p><br/><p>The cook didn't care about the mysterious host.</p><br/><p>\"There are many capable people hidden in the capital. Our restaurant is famous for its palace cuisine, but our dishes are worth their price. The average price is 500 yuan per person. It's nothing. That guy must love gastronomy. He is not foolish enough to order only expensive dishes. If he did, he would have to spend more than 1,000 yuan per person.\"</p><br/><p>His students believed him. Even a portion of egg fried rice cost 50 yuan.</p><br/><p>\"Master, the other patrons over there seem like rich people. The four of them alone will pay just as much as those eight students.\"</p><br/><p>\"Hey! Are you done yet?\" His master lifted the pan high. \"Can we get back to cooking? You have a lot of spare time, don't you?\"</p><br/><p> Master and apprentice relationships in the catering industry were very strict. The students scattered in all directions and got to work.</p><br/><p>The private room was filled with joy. Huang Jiajia and Mou Xiaoliu were sitting at the table closest to the door, so any passers-by were able to spot them right away.</p><br/><p>Unfortunately, this didn't bring them any luck.</p><br/><p>\"Mou! What a coincidence! What are you doing here?\"</p><br/><p>An unwelcome guest walked up to Mou. It was a middle-aged man with a receding hairline.</p><br/><p>\"Who is he?\" Huang Jiajia asked Mou impolitely.</p><br/><p>Mou looked calm. \"Hello, director Liu.\"</p><br/><p>The guy seemed happy with the greeting. He was the director of the Credit Center, so he was very respected among young girls.</p><br/><p>As soon as Mou had been assigned to his office, he had asked around about her. She was just a graduate from a famous college without any eminent social connections.</p><br/><p> The director strode into the hall confidently.</p><br/><p>\"Are you having dinner with your friends?\"</p><br/><p>He shot a cantankerous look at Huang Jiajia. Young girls are lovely these days.</p><br/><p>\"These seats are for ordinary guests. I'm treating some friends to dinner in the private room over there. Shall we have dinner together? You could make some new friends. They are major clients of the Credit Center...\"</p><br/><p>Director Liu gestured at them. Those clients would be important for his credit that year.</p><br/><p> Mou was a good-tempered girl, so she did not get angry. She just pointed inside and said, \"One of my schoolmates is having a party.\"</p><br/><p>Liu looked inside and saw that the dishes were not very expensive. Students are poor. Maybe they are having dinner here by splitting the check.</p><br/><p>Sure about his guess, he waved at Mou. \"Young girls should save money for their future. It's my treat. Follow me to the private room.\"</p><br/><p>He tried to take her hand, but Mou was a martial artist and Huang Jiajia was a very smart girl. Together, they poured a pot of hot tea on him.</p><br/><p>\"Ouch!\"</p><br/><p>The two girls covered their mouths in surprise.</p><br/><p>\"Are you okay?\"</p><br/><p>\"You scared us! If you wanted to have some tea, you could have said so!\"</p><br/><p>That was victim-blaming at its best.</p><br/><p>Fortunately, it was autumn, so the clothes he was wearing were not very thin. Director Liu hadn't gotten burned. There was only a water stain on his crotch, yet he still felt humiliated.</p><br/><p>\"You did this on purpose! You cannot appreciate a polite gesture! Come with me! It's your job to accompany clients to dinner!\"</p><br/><p>The people inside heard his shouts. Liu Xiaoyang and Li Jie, who had been greeting guests on Qin Guan's behalf, saw their roommate's admirers.</p><br/>\n</div>"}