{"title": "Chapter 625: Accidents Happen", "id": 625, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-625-accidents-happen", "volume_title": "Volume 7", "body": "<h1>Chapter 625: Accidents Happen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 625: Accidents Happen</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>They wouldn't let two girls get hurt in their domain, much less if they were Qin Guan's fans. Liu Xiaoyang looked at Cong Nianwei and got her approval.</p><br/><p>Liu always ran wild. He didn't care about any rules or laws. He just wanted to punish the guy, even though the two girls had not really gotten hurt. He walked over to them, rolling up his sleeves on the way.</p><br/><p>Meanwhile, Qin Guan was walking over from the other end of the corridor.</p><br/><p>\"I'm so hungry...\" He suddenly paused. \"What are you doing here? Are you lining up to welcome me?\"</p><br/><p>He thought he was being funny, but everyone else felt awkward. He didn't realize there was anything wrong until he reached the threshold.</p><br/><p>\"What's going on?\" He unconsciously turned to Huang Jiajia and Mou. \"Are you causing trouble again?\"</p><br/><p>\"Qin Guan!\" Huang Jiajia stood up. \"That fat man asked Mou to be a barmaid!\"</p><br/><p>Director Liu screamed upon hearing the fake accusation. \"That's nonsense! I just asked her to meet some major clients in the private room. She is my subordinate. Is there a problem? I also offered to cover the expenses for your party! Be reasonable! Why did you pour tea on me? My clothes are very expensive, you know!\"</p><br/><p>Qin Guan realized what was going on. Freshmen are not easy in the workplace nowadays.</p><br/><p>He pointed inside and asked Director Liu, \"Your treat? Are you sure?\"</p><br/><p>\"Sure! Which table are you sitting at?\"</p><br/><p>The students stood up one after the other. \"Brother Qin!\"</p><br/><p>\"Senior Qin!\"</p><br/><p>\"One, two, three… All of them. Your treat!\"</p><br/><p>Liu realized that he would have to pay for all the tables in the hall.</p><br/><p>Qin Guan waved at the waiter. \"This kind man will be paying the bill. Let him know about the total amount.\"</p><br/><p>\"Okay! It's 4,000 yuan per table.\"</p><br/><p>\"You are so nice, Director Liu! Thanks a lot!\"</p><br/><p>Liu looked as if he was about to blow up in someone's face.</p><br/><p>\"Fine, Mou Xiaoliu. I'm just being kind. You are a slacker at work though...\"</p><br/><p>Before he could finish his words, another voice was heard saying, \"Lao Liu! You invited us here and then disappeared! Are you planning on escaping without paying the bill?\"</p><br/><p>His clients were walking along the long corridor.</p><br/><p>\"Wow! Is that Qin Guan? You bastard! When did you come back to Beijing? Why didn't you call us?\"</p><br/><p>The major clients were some acquaintances of his, including Zhang Zhenqian and Bu Qinglu...</p><br/><p>\"You've been a stranger ever since you won those awards! You still have a share in our company, you know. I would be careful if I were you!\"</p><br/><p>Qin Guan was speechless. They were all successful people after all. Their income reports were increasing every year, yet they were still wearing casual clothes.</p><br/><p>Qin Guan opened his arms, happy to see them again after such a long separation.</p><br/><p>\"I arrived yesterday. I was just having a party for my old schoolmates. You are rich men now. Why are you still wearing those clothes?\"</p><br/><p>They were wearing loose hoodies, pants and slippers.</p><br/><p>\"Let's have dinner together and catch up!\"</p><br/><p>They didn't care about being called spongers.</p><br/><p>\"No problem. Let's eat together! I like to eat with big company!\" Bu Qinglu spoke for the group before he turned to Director Liu, who looked stupefied.</p><br/><p>\"Lao Liu, this is our brother, Qin Guan. He's a Best Actor Award winner! He just returned from America. Let's talk about our affairs later!\"</p><br/><p>\"Besides, you have to go home and change pants.\"</p><br/><p>How considerate!</p><br/><p>\"But… But the loan...\" Liu stammered.</p><br/><p>\"Oh, there's no rush. See you!\"</p><br/><p>But I'm in a rush...</p><br/><p>Liu watched them enter the hall and hug each other around the shoulders. He realized his effort had been in vain.</p><br/><p>Sighing, he cast an angry look at Mou, who was following Qin Guan with her eyes, and ground his teeth.</p><br/><p>Such an employee won't go far. What a toy boy!</p><br/>\n</div>"}