{"title": "Chapter 636: The Dirty Tricks Of The Real Estate Industry", "id": 636, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-636-the-dirty-tricks-of-the-real-estate-industry", "volume_title": "Volume 7", "body": "<h1>Chapter 636: The Dirty Tricks Of The Real Estate Industry</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 636: The Dirty Tricks Of The Real Estate Industry</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"You are really young and you have been living abroad for a few years. You must have no idea about the state of the market. Grandpa Yang has a large yard. All the neighbors are meeting there. Shall we go there, Xiao Qin?\"</p><br/><p>Qin Guan and Cong Nianwei exchanged a look. Cong Nianwei seemed intrigued, so Qin Guan nodded at the old woman.</p><br/><p>The manager looked anxious about their decision.</p><br/><p>\"Brother Qin, your trip back can't have been easy. You shouldn't waste your time on such trifles.\"</p><br/><p>Qin Guan noticed the worried expression in his eyes.</p><br/><p>\"I'm in no hurry. National Day is just around the corner. I have a two-week vacation before me. Old people possess knowledge and experience that we don't. I would like to hear their suggestions.\"</p><br/><p>The old woman was really happy to hear that.</p><br/><p>\"You are an honest boy. Follow me!\"</p><br/><p>\"Okay!\"</p><br/><p>Qin Guan looked at the manager, indicating that they could leave the contracts for later. Then he followed the old woman away.</p><br/><p>After several turns, they arrived at Grandpa Yang's yard. The narrow hutong suddenly became wider in that area.</p><br/><p>In the center of the large square yard was an ancient locust tree, and chrysanthemums were blooming in the flower beds.</p><br/><p>The people in the yard were not in the right mood to appreciate them though. There were several large round tables there, but the visitors had brought their own stools.</p><br/><p>They had also brought along their government and Wanda Group contracts. The meeting was hosted by some professionals.</p><br/><p>\"Grandpa Yang! I brought the new neighbors! Xiao Qin, this is Grandpa Yang. He is the coordinator.\"</p><br/><p>\"How are you, sir?\"</p><br/><p>Qin Guan and Cong Nianwei entered hand in hand. The hearts of the strangers, who were about the same age as Qin Guan's parents, softened.</p><br/><p>People were inclined to judge others by their appearance. Qin Guan got three spare stools for the old woman, Cong Nianwei and himself.</p><br/><p>The manager had not been invited, but he was a shameless guy, so he found a brick on the ground and sat down on it. Thick skin was a job requirement for realtors.</p><br/><p>\"Did you buy a house in our hutong, Xiao Qin?\"</p><br/><p>\"Yes!\"</p><br/><p>\"Okay, let's just continue. You can ask questions anytime you like.\"</p><br/><p>\"First of all, we can't accept that price. They are offering only 8,000 yuan per square meter! That's outrageous for this area! We are no idiots!\"</p><br/><p>\"Exactly! My house is 36 square meters. The money I will get is hardly enough for a house by the Fourth Ring!\"</p><br/><p>\"The prices in Tongzhou have escalated to 4,000 yuan per square meter. How could people pay 8,000 for property by the Second East Ring? What a travesty!\"</p><br/><p>The price was ridiculously low.</p><br/><p>\"Let's discuss the area compensation contract, which is our second choice. We can exchange our houses with luxurious apartments in the suburbs. Let's just put the word \"luxury\" aside though and talk about the word \"suburbs\"! We are talking about Huilongguan! That's outside the Fifth Ring! We have no idea about the quality of the houses there, but the ratio is two to one!\"</p><br/><p>\"Does this mean that one house here equals two houses there?\" an old man asked. A woman shook her head at him.</p><br/><p>\"No! They will be counting the area. A 30-square-meter house here is equal to a 60-square-meter house there. They will cover the difference.\"</p><br/><p>Everyone started shaking their heads. They didn't want to live in such a remote area.</p><br/><p>\"And our last choice...\" Grandpa Yang sighed. \"Our last choice is moving back here. After the buildings are finished, some of them will be put on sale as commercial residential buildings, while others will be reserved for the original residents.\"</p><br/><p>\"The property developers will reserve a couple of buildings for us. We'll get the same area, but our building will be inferior to the commercial ones when it comes to interior design and facilities. The price difference will be determined by the market. Besides, we'd have to find a place to live after moving away.\"</p><br/><p>This was not good news for the residents.</p><br/><p>As an insider, Qin Guan had heard the news before the residents. According to the instructions of the headquarters, the real estate agency had to maximize its profit.</p><br/><p>Qin Guan felt conflicted when he saw everyone's worried expression.</p><br/><p>It's said that the program will be launched in 2004. Let's just take it easy...</p><br/><p>The most favorable option out of the three was getting a new house in their original place of residence. After development was over, the prices of the area could increase by 10, 20 or even 30 times.</p><br/><p>Qin Guan felt wronged on behalf of the old neighbors as he witnessed their unity.</p><br/>\n</div>"}