{"title": "Chapter 640: Injustice", "id": 640, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-640-injustice", "volume_title": "Volume 7", "body": "<h1>Chapter 640: Injustice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 640: Injustice</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan was holding a pair of large clips and a garbage bag in his hands.</p><br/><p>Wherever there were humans, there was garbage that needed to be cleaned up.</p><br/><p>The park service attached great importance to the event. When Qin Guan got out of the car, he realized that the park must have been cleaned that very night.</p><br/><p>The trash bins, which were always full, were empty and clean, their usually dirty surface pure white. Both sides of the roads were clean of any dust and dirt. The lawn, where visitors liked to lie, was as clean as a plate before dinner.</p><br/><p>Of course, there were a few mineral water bottles lying on the ground. They were very easy to spot.</p><br/><p>Reality was cruel though. Qin Guan, who had very good eyesight, found some gum stuck to the bottom of the benches.</p><br/><p>Gum was the average American's favorite snack. They stuck it everywhere after chewing it though, including under bus seats, subway station benches, park benches, and any other public facilities one could imagine. Chinese people might have bad manners, but at least they didn't chew gum.</p><br/><p>Qin Guan picked up a paper cup from the ground. It had been left there on purpose by the park service. He swiped the bottom of a bench with the clips and the gum fell down into the cup like raindrops.</p><br/><p>The park service staff flushed.</p><br/><p>\"Come on! We have a lot of work to do!\"</p><br/><p>His team took their tools out happily and copied what Qin Guan had done. They attracted the attention of the passersby, as they looked quite different from social workers.</p><br/><p>Some people gathered around to take pictures.</p><br/><p>All the photographers in New York knew Qin Guan because, according to reliable sources, their idol Linn was about to suggest him for the cover of \"TIME\".</p><br/><p>Linn was a distinguished photographer, so the news had spread fast among the photography circle.</p><br/><p>What had attracted him to that model? Was he a big source of inspiration?</p><br/><p>Some photographers were in pursuit of art, while others just wanted to get famous.</p><br/><p>Are we meeting him here today?</p><br/><p>\"Qin Guan!\" a young photographer cried out, catching the attention of the people in the park, who turned to stare at the group. Qin Guan stood out among them.</p><br/><p>As visitors began to gather on the lawn, the director told his assistant, \"Tell everyone to be on alert. If people get excited, we might have to leave as soon as possible.\"</p><br/><p>\"But they seem like nice people...\"</p><br/><p>\"Idiot! Don't you remember the news in 'The New York Times' a few weeks ago?\"</p><br/><p>The assistant suddenly remembered what he was talking about. There had been an incident with some crazy fans and a miserable star on Times Square. That miserable star had been Qin Guan.</p><br/><p>Crazy fans? Miserable star?</p><br/><p>The two of them looked around and realized they had been surrounded in two minutes. There were photographers with cameras, professional dog walkers, runners... Everyone was interested in the shooting.</p><br/><p>\"It's too late, director. We are surrounded!\"</p><br/><p>\"It's okay. Cheer up!\"</p><br/><p>Qin Guan was not affected by the crowd's presence. He just turned back with his cup, which was full of dirty gum. There was some dust on his face, and his loose pullover and grey plaid shirt made him look like an ordinary young man.</p><br/><p>The audience felt his happiness and smiled.</p><br/><p>\"Finish your job!\"</p><br/><p>Standing up straight, Qin Guan showed off his achievement to everyone. His delight amused the crowd, which applauded him.</p><br/><p>\"Well done!\"</p><br/><p>\"Cheers!\"</p><br/><p>The park service staff were jealous. Usually, people didn't like being reminded of the regulations, yet they were treating Qin Guan like an idol. It was unfair!</p><br/>\n</div>"}