{"title": "Chapter 641: The Charity Bazaar", "id": 641, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-641-the-charity-bazaar", "volume_title": "Volume 7", "body": "<h1>Chapter 641: The Charity Bazaar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 641: The Charity Bazaar</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The director was reasonable.</p><br/><p>\"If you were as influential as a star, you would be the focus of the cameras.\"</p><br/><p>The staff members were speechless. If we looked like that, we wouldn't be park rangers!</p><br/><p>Qin Guan handed the garbage bag and the tools to the assistant. Qu looked worried as he waved at the crowd.</p><br/><p>\"Thank you for your support! I'm happy that so many people approve of my work. My work here is finished, so I will leave for my next destination. There is another important community service task waiting for me.\"</p><br/><p>\"I will be working at a charity bazaar for starving children all over the world. If you are interested, you are welcome to attend it. It's easy to find. It's just across the Hilton Art Fair, beside the J Clothing store. You could buy something, or do anything you can to help us!\"</p><br/><p>Qin Guan clapped his hands up to the sky. \"For the starving kids of the world!\"</p><br/><p>Everyone clapped along.</p><br/><p>After hearing about the charity event, the crowd walked away immediately, leaving only a few withered leaves swirling in the breeze around them.</p><br/><p>The park keeper felt sympathy for the actor. His appeal was not enough to dig money out of the pockets of the New Yorkers. There was only a dog left on the large lawn, barking at them in protest.</p><br/><p> Qin Guan tried to ease the atmosphere awkwardly.</p><br/><p>\"At least, I have a puppy supporting me.\"</p><br/><p>Before his voice could fade away, a hand stretched out to take hold of the leash.</p><br/><p>\"Sorry, I forgot it. It take care of so many dogs...\" The dog walker took the dog and walked away as fast as possible.</p><br/><p>Everyone shot a pitying look at Qin Guan. That young man does not know New Yorkers at all. Qin Guan craned his neck to look at the timetable in Qu's hands.</p><br/><p>\"What's our next stop?\"</p><br/><p>You just said it was the Hilton Fair. </p><br/><p>Everyone ignored his embarrassment and set out for their next destination, where they would take part in a big activity.</p><br/><p>When they got out of the car, they faced a big commotion. Housewives were bringing charity goods to the bazaar, which was organized by the community staff.</p><br/><p>Guo Nuoyan had decorated the lawn nicely thanks to the support of J Clothing. It was a collecting field with dreamy colors.</p><br/><p>There were balloons with the J Clothing logo everywhere. All the staff were wearing green uniforms, which were also provided by J Clothing. As the sponsor, Guo couldn't help but admire his masterpiece.</p><br/><p>There were round tables with white sheets, packed with candy and biscuits. The household appliances, tools and clothing donated by the residents had been placed in the center of the lawn, along with some food samples.</p><br/><p>A small stage had been set up right next to the tables for the host and the jazz band, who would play music during the break. </p><br/><p>The overall arrangement was very orderly. The organizers were very experienced after all. Guo had also contributed a lot to the event.</p><br/><p>Qin Guan's team attracted everyone's attention. Guo rushed over to him happily and gave him a big hug.</p><br/><p>When they parted, Qin Guan looked confused. \"Did they take a picture of us? How did I look?\" Guo whispered.</p><br/><p>Qin Guan looked at the cameras and realized his intention. He was using every chance he could to improve his image.</p><br/><p>It was a pity that the film would be edited much later. \"I was picking up garbage at a park right before I came here,\" Qin Guan warned him.</p><br/><p>Guo started cursing.</p><br/>\n</div>"}