{"title": "Chapter 656: The First Positive Feedback", "id": 656, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-656-the-first-positive-feedback", "volume_title": "Volume 7", "body": "<h1>Chapter 656: The First Positive Feedback</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 656: The First Positive Feedback</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>They cunningly decided who the winner of the competition would be. The prize would become a legend. If Cong Nianwei knew about its underlying meaning, she would have found it both funny and annoying.</p><br/><p>Everyone was waiting for the final moment in the meeting room. Suddenly, the curtain on the stage rose.</p><br/><p>The procedure was supposed to be simple. The host would present the winning design and announce the winner. Then one of the sponsors would give away the prize on the stage.</p><br/><p>However, when those funny guys saw Qin Guan, they decided to change their original plan and make a few corrections to the host's cue cards. As a result, the ceremony went like this...</p><br/><p>\"The critical moment has come. I will be announcing the winner! Who will it be?\"</p><br/><p>The host unrolled the background poster. \"It's the team from Columbia University and their design 'New Power'! Let's welcome the chief architect, Ms. Cong Nianwei, to the stage with the warmest applause!\"</p><br/><p>Although the other contestants were disappointed, they clapped sincerely for Cong Nianwei's team.</p><br/><p>The young students' talent had been acknowledged before they had even entered the circle. Even Cong Nianwei, who was the calmest person among them, had tears in her eyes. Rongzhi, who was in charge of all the details, had tears and mucus flowing down his face.</p><br/><p>Cong Nianwei stood up and embraced every member of her team before she walked to the stage nervously. The host handed her a spare microphone.</p><br/><p>\"The lucky girl is here! Let's invite our sponsors, Brian, LC, MG, and Tom to present her with the prize!\" the host said, applauding happily.</p><br/><p>Usually, one sponsor was enough for the presentation, but a fight had taken place backstage. Everyone had fought over who would get the chance to present the award. The host had tried to calm everyone down, but it had been in vain. Before his voice could fade away, the four men rushed to the stage impatiently.</p><br/><p>The audience applauded in confusion. Wasn't this a little too much? Maybe the men just liked being in the spotlight.</p><br/><p>\"Congratulations! Congratulations!\"</p><br/><p>\"We are looking forward to cooperating with you in the future!\"</p><br/><p>\"Here is your award, Ms. Cong Nianwei.\"</p><br/><p>\"Don't push me! I almost fell off the stage!\"</p><br/><p>\"There you are, Cong Nianwei! Ah! Stop pushing me!\"</p><br/><p>The audience was totally speechless. The stage was too small to hold so many people, but they all stuck to their posts, for fear of being absent from the ceremony. After the commotion, Cong Nianwei finally got the award.</p><br/><p> It looked like a unique cup for athletes. The base was round, and the cup itself was an unconventional belt with blue and white crystals. </p><br/><p>Before Cong Nianwei could express her gratitude, three of the sponsors fell off the stage screaming, leaving Brian alone on the podium. Taking advantage of the situation, Brian smoothed down his hair.</p><br/><p>\"Congratulations, Cong Nianwei!\"</p><br/><p>\"Thanks!\"</p><br/><p>They shook hands firmly.</p><br/><p>The clever host was hidden behind the curtain as Brian handed Cong Nianwei the check. The paper was still warm from his touch.</p><br/><p>The check was worth 250,000 dollars, which exceeded most standard architecture prizes.</p><br/><p>The other three sponsors had no time to climb up to the stage again. All they could do was hit the stage with their fists angrily as they watched Cong Nianwei leave with the prize.</p><br/><p> Cong Nianwei did not shake hands with them. She thought they had just showed up for fun.</p><br/><p>She returned to her team and handed the cup to her partners. Then she embraced Qin Guan. Money meant nothing to her. It was the award that made her happy.</p><br/><p>This was her first award, but considering her age, she was a very promising young architect.</p><br/><p>\"Qin Guan!\"</p><br/><p>\"Yes?\"</p><br/><p>\"I have contributed to our award display!\"</p><br/><p>These were the sweetest words in the world. It was the first time Cong Nianwei was expressing her decision to spend the rest of her life with him. She had accepted his implied proposal. Life was wonderful!</p><br/><p>Qin Guan hugged her tightly. His dream had come true that day!</p><br/>\n</div>"}