{"title": "Chapter 651: The Casino Staff", "id": 651, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-651-the-casino-staff", "volume_title": "Volume 7", "body": "<h1>Chapter 651: The Casino Staff</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 651: The Casino Staff</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The Asian man suddenly changed completely. He leaned against the back of his chair, crossed his slender legs and raised his jaw at the dealer.</p><br/><p>\"One more!\" Everything changed from that point on.</p><br/><p>Qin Guan transformed into an experienced gambler. He was steady and calm, his outstanding skills misleading the dealer again and again. There were no cracks on his poker face for the dealer to take advantage of.</p><br/><p>Qin Guan's secret weapons were his computing skill and good memory. Chips started mounting in front of him. Sometimes he threw a small white chip in, and sometimes he pushed them all in the circle.</p><br/><p>In a few minutes, the young man had earned about 10,000 dollars. A crowd had gathered around the winner. Even the barmaids shuttling around the hall were attracted by his handsome looks and the chips in front of him.</p><br/><p>\"Do you need someone to count the chips for you, young man?\"</p><br/><p>\"I'm free tonight, darling...\"</p><br/><p>The girls, who were all wearing revealing dresses, kept flirting with Qin Guan.</p><br/><p>A rich handsome guy was much better than an old bald fellow after all. They all wondered if the Asian man had any interest in them.</p><br/><p> They left when they noticed his ordinary clothes though. They were classy beauties, not some poor girls wandering the streets. They had enough time and capital to meet the demands of VIP clients. They had recognized Qin Guan immediately, as the young man was featured frequently in their favorite magazines.</p><br/><p>They knew that he preserved his moral integrity like a monk, and they were sure about their own charm. None of them could be mentioned in the same breath as Paris Hilton, Madonna or Britney Spears.</p><br/><p>If they flirted with Qin Guan, they might lose some other clients. Only a shameless girl eager to get famous would do that, but those kind of girls were unpopular in their industry.</p><br/><p>There were no girls around Qin Guan anymore. Only some crazy gamblers sat beside him, their eyes fixed on him, as if he was a sparkling diamond.</p><br/><p>The chips fell down on the table again with a clatter. The dealer wiped cold sweat from his face again. The manager of the casino was watching the table through the monitor.</p><br/><p>\"Do you need help?\"</p><br/><p>There were always some good gamblers in every casino, hired to detect any cheaters and check if any staff members colluded with the gamblers. The manager was itching to see Qin Guan succeed. He could sense that the young man was not a cheater, but someone who relied on his skills.</p><br/><p>Every casino had a blacklist that included famous card contest competitors as well as notorious cheaters. Those people were not allowed to set foot in a casino.</p><br/><p>That Asian guy had a clean record though. The manager ran a background check on him on the internet just as Qin Guan won his fifth round.</p><br/><p>He hadn't expected to find dozens of news articles about him. He read them all with great interest, forgetting completely about the game. When his staff reminded him, he coughed awkwardly.</p><br/><p>\"Okay, you go watch the table. Be careful. Don't scare the guests away.\"</p><br/><p>The joker of the casino walked out of the office speechless. I'm a gentle man. I'm not some monster!</p><br/><p>One minute later, he appeared on the monitor. He walked to Qin Guan's table without hesitation and patted the blond dealer on the back.</p><br/><p>\"Good job. You can take a break.\"</p><br/><p>Then he performed a short investigation, using the micro inductor in his hand. He is clean. He is not cheating.</p><br/><p>The man was very excited. A skilled opponent was a good stimulant for people like him. He decided to have a small gamble with Qin Guan. This was not unheard of for the casino staff.</p><br/><p>I could set a top limit so he doesn't lose too much money.</p><br/><p>The man took the place of the dealer.</p><br/><p>Humans were very strange beings. Dancers were elegant, fashion insiders were weird and eccentric, and people with a high social status had an invisible oppression about them. Different environments cultivated different temperaments.</p><br/><p>Qin Guan sensed something different about the gambler though. As a Chinese boy who had grown up watching classic Hong Kong gambling films, Qin Guan was familiar with such guys.</p><br/>\n</div>"}