{"title": "Chapter 657: The Shaolin Temple in New York", "id": 657, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-657-the-shaolin-temple-in-new-york", "volume_title": "Volume 7", "body": "<h1>Chapter 657: The Shaolin Temple in New York</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 657: The Shaolin Temple in New York</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>A familiar fragrance lingered in his nose, but the warm feeling of Cong Nianwei's embrace reminded him that this was not an illusion. They had made a lifetime decision very casually. From then on, they would share a common goal.</p><br/><p>Their hearts were beating fast as they looked at each other, smiling knowingly. Qin Guan encouraged himself mentally. I must win more awards in order to realize my dream.</p><br/><p>As they were enjoying those tender moments, the audience began to leave orderly. The sponsors were amazing. Before they left, they gave them envelopes with flight tickets for their trip back home.</p><br/><p>Everyone, winners and losers included, was satisfied, except for the three unlucky sponsors. The shameless men rushed over to Cong Nianwei.</p><br/><p>\"Hi!\"</p><br/><p>Qin Guan and Cong Nianwei got scared when they saw the members of the organizing committee standing around them in a circle with smiles on their faces. The four sponsors were among them.</p><br/><p>\"Hello! We would like to greet you again.\"</p><br/><p>Four pairs of hands stretched out towards Qin Guan. \"Your name precedes you...\"</p><br/><p>\"Ha ha! Now I can show off to my girlfriend that I touched his hand!\"</p><br/><p>\"Do you like to play ball games? Tennis, basketball, golf... Shall we go play together?\"</p><br/><p>They were all talking at once as Qin Guan looked at them in shock. He realized that he had unwittingly acquired some new admirers thanks to the Chinese students' promotion.</p><br/><p>This made him feel under pressure. It was the first time he was not being praised for his looks, but his achievements. He was actually being treated as a talented businessman. They all exchanged cards and decided to meet in their spare time. The four men couldn't wait to have their companies evaluated by Qin Guan's firm.</p><br/><p>They all believed in his work. They had stolen the computers of some accounting firms and compared the data. As it had turned out, QC's services were the best.</p><br/><p>They wanted to know about their market capitalization in the future after repeated financing and investments, and how they could purchase small businesses effectively with their current capital.</p><br/><p>The Hilton Hotels gave them some direct feedback. The group had trusted 10 more hotels to QC in the past few months. This was a good indication of the firm's success.</p><br/><p>As more and more Asian accountants joined it, the firm gained an advantage over other traditional firms. Asians were very keen and they enjoyed boring statistics work as much as malt sugar.</p><br/><p>In other words, they were all complete workaholics.</p><br/><p>Actually, Qin Guan preferred being lazy, but he couldn't turn down such steady work. Cong Nianwei was a good stimulus for him as he worked hard to prepare for the party of the police union.</p><br/><p>Exam season was over, so after the party, he and Cong Nianwei would return to China to enjoy the Spring Festival.</p><br/><p>Encouraged, Qin Guan wrapped himself up in his coat to withstand the piercing New York wind. He was walking to his first stop for the day, the Shaolin Temple of New York.</p><br/><p>That absurd name was the only way Americans could learn about the real Shaolin Temple, Chinese martial arts and Buddhism.</p><br/><p>Established by Master Guolin, the true successor of the 34th generation of the Shaolin Temple in China, the scaled-down version of the Chinese temple had been in New York for a full four years.</p><br/><p>The temple was not far from the commercial streets of the Flushing District. It had actually been constructed by Master Guolin himself.</p><br/><p>In 1999, after his fifth year in America, he had decided to build the temple with the help of some faithful believers and a bank loan. His only aim had been to promote Chinese martial arts. The Shaolin Temple was actually looked down upon for being a street martial arts club.</p><br/><p>Qin Guan felt amused as he stood at the entrance of the temple.</p><br/><p>After visiting the real Shaolin Temple on the Song Mountains, this temple seemed so small that it reminded him of the Earth Temples in the countryside and the temples in Hong Kong movies.</p><br/><p>There were two big red lanterns hanging on both sides of the wooden gate. The round windows were perfect copies of the temple made by the Monkey King. Be serious now!</p><br/><p>Qin Guan braced himself before he pushed in.</p><br/><p>The gate was like a boundary between two different worlds. Qin Guan heard shouts of martial arts practice inside. Four rows of students were practising in the center of the open courtyard.</p><br/><p>Despite preparing himself mentally, Qin Guan was still shocked. The master supervising the students noticed the intruder.</p><br/>\n</div>"}