{"title": "Chapter 653: An Excited Audience", "id": 653, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-653-an-excited-audience", "volume_title": "Volume 7", "body": "<h1>Chapter 653: An Excited Audience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 653: An Excited Audience</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"Up!\"</p><br/><p>Okay, you are paying me. You are the boss.</p><br/><p>Qin Guan climbed up two meters high before he warned the people holding the ladder for him, \"Careful, I'll let go now.\"</p><br/><p>Then he moved to the chair and sat down steadily on it.</p><br/><p>Several elevators were placed around him as the assistants got to work. They fastened a strong transparent wire to Qin Guan's body, to make sure he'd be safe. It was a very high-tech product. Even if the chair was broken, Qin Guan would just hang in the air.</p><br/><p>The prop master hid the chair from the audience by using Qin Guan's loose costume, and the lighting master took advantage of the different lights and colors of the curtains.</p><br/><p>When all the ladders were pulled away, Qin Guan was sitting up in the air like a god.</p><br/><p>\"What do you think?\"</p><br/><p>\"It's marvellous! I have never tried anything like this before. When you look down from that height, the audience seems very small!\"</p><br/><p>Fortunately, Qin Guan was not anxious.</p><br/><p>The problem was how he would get down. Before Qin Guan could ask that question, he felt the chair descending slowly.</p><br/><p>Isn't it fixed to the pole? How can it move?</p><br/><p>Chris pointed to the floor. \"The base can rise and drop. Don't worry, it's strong enough to hold you.\"</p><br/><p>Then he pointed to the auditorium proudly and said, \"Today, I will shock everyone. They will never forget my awe-inspiring performance. I am Chris after all!\"</p><br/><p>He meant what he said. He really shocked the audience.</p><br/><p>Compared to all the strip shows taking place in Las Vegas, Chris' brilliant performance made him seem like a monster of the night. When he entered the stage leisurely floating in the air, screams broke out among the audience.</p><br/><p>His tour to Las Vegas, which had been promoted earlier that year, had attracted loyal fans who followed him everywhere. They screamed and cried to encourage him.</p><br/><p>\"You are a messenger sent by the devil! Admit it! Please accept me... I'll sacrifice my soul to you!\"</p><br/><p>\"Save me! I'm your most faithful believer!\"</p><br/><p>Qin Guan was shocked by the rogues running wild in the audience. Is this some evil cult or something? It certainly is no common audience! It's like a gathering of lunatics!</p><br/><p>He had no time to leave though. Led by Chris, he floated out of the backstage area slowly.</p><br/><p>Suddenly, an anthem rang out like a church choir. Qin Guan entered the stage solemnly. All eyes were fixed on him as he knocked his sceptre against the floor and hovered in the air in a sitting position.</p><br/><p>As the tune rose higher and higher, so did Qin Guan. Suddenly, Chris moved towards him, meeting him in mid-air.</p><br/><p>The scene looked like the meeting of an angel and a demon. One was a pure, sparkling figure, while the other was the personification of evil and ferocious desire.</p><br/><p>\"AH!\"</p><br/><p>Deafening screams rang out as flashlights were turned on. Qin Guan couldn't see anything when he looked down.</p><br/><p>When Chris reached him, they looked at each other in the air, blue lights being projected around their bodies to form a cold halo.</p><br/><p>\"War… Doom… Destiny...\" Despite Chris' provocation, Qin Guan showed mercy. He looked at Chris as if he was an ant and slowly lifted his sceptre.</p><br/><p>There were no lines. No script. He just had some general instructions to follow. The audience had to use its own imagination. Qin Guan looked like a real god. That was the difference between different races.</p><br/><p>The loyal fans, curious visitors and local residents witnessed an epic, poetic performance in the luxurious theater. Words couldn't express their feelings. The thrilling scene touched their souls.</p><br/><p>Qin Guan raised his sceptre proudly, as if he wanted to brush off a tiny bug stuck in his eye. No creature could disturb him.</p><br/><p>He pointed the sceptre casually at Chris like a judge from Heaven. His golden skin and white hair couldn't disguise his graceful demeanor.</p><br/><p>Struck by his power, Chris bent forward and fell down slowly like a broken butterfly.</p><br/><p>\"Ah!\" the audience cried out in unison. They thought it was a terrible accident. When his head was only half a meter away from the floor, he started floating again as if he was in space.</p><br/><p>\"Oh!\" </p><br/><p>He had earned everyone's admiration.</p><br/>\n</div>"}