{"title": "Chapter 662: Great Admiration", "id": 662, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-662-great-admiration", "volume_title": "Volume 7", "body": "<h1>Chapter 662: Great Admiration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 662: Great Admiration</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Before they could come back to their senses, each of the actors took out a long sword that glittered like frost and rotated them like swordsmen during ancient times.</p><br/><p>Clang!</p><br/><p>The sound of the swords was so crisp that it made everyone's hair stand on end. When they finished their performance, the actors retired to the edge of the stage, leaving the spotlight to the other performers.</p><br/><p>The pipa solo grew quiet as some buddhist music rang out. The atmosphere softened a lot. Tommy wiped some cold sweat off his face carefully. He thought Henry would murder him, but fortunately, there were colleagues all around them.</p><br/><p>Suddenly, he got frightened again.</p><br/><p>Master Guolin was standing on the stage in a splendid cassock, hitting the heads of two Shaolin Monks with bricks.</p><br/><p>\"Ah!\" the audience cried out before suddenly stopping.</p><br/><p>The bricks were crushed into pieces. The two monks, who were safe and sound, flicked the dust off their heads and walked behind a brick wall.</p><br/><p>Bang! Bang! Bang!</p><br/><p>The bricks were smashed to pieces one after the other. Everyone under the stage was shocked, their mouths and eyes opening wide. Some people drank wine to suppress their horror.</p><br/><p>They poured the wine into their noses instead of their mouths by accident, spraying the liquid out of their noses.</p><br/><p>The monks picked up some spears and stabbed their throats.</p><br/><p>The wooden poles bent from the pressure, but the steel spearheads touched their throats without piercing them.</p><br/><p>The audience members were not surprised, but they were still horrified. They exchanged a few words nervously in an effort to comfort each other.</p><br/><p>\"Oh my! What did I just see?\"</p><br/><p>\"Are you trying to warn American policemen about something, Henry? Do you think we have supermen in our country?\" That particular person must have read too many Superman comics.</p><br/><p>\"We should be on alert about Asian criminals. They are beyond the reach of ordinary weapons.\"</p><br/><p>\"Yes. I'd rather shoot first and ask questions later!\"</p><br/><p>One of them, who took their job way too seriously, didn't agree with the rest.</p><br/><p>\"I think they must be tutors invited here by Henry. That kind of training could improve our skills tremendously so we could capture criminals way more easily in the future. Thank you so much, Henry! Your work is appreciated!\"</p><br/><p>Henry shot a helpless look at him. The man was fighting a big battle all along the Mexican border, but Henry had had no idea about what a low IQ he had.</p><br/><p>His suggestion still sounded practical though. Chinese martial arts could save lives. As Henry was considering the possibility, the Shaolin monks finished their performance and retired backstage, accompanied by the melody of a Chinese zither.</p><br/><p>All the lights were pointed at one specific spot. A white round circle of light lay on the center of the stage quietly as two girls in red pushed a large white screen onto the stage. Then Qin Guan, the hero of the night, showed up.</p><br/><p>He was wearing white Wushu clothing designed by Yin Changtao, with a decorative design embroidered on it with silver thread. The clustering pine leaves looked like blooming flowers.</p><br/><p>The lotus-like buttons on his chest looked very pretty. Of course, such details couldn't satisfy the audience, but the huge brush in Qin Guan's hand, which was as tall as a child, shocked them.</p><br/><p>The ink was stored in a blue porcelain cloisonné plate. As the music played, Qin Guan dipped the brush into the ink and began to write.</p><br/><p>His every stroke was graceful and elegant. In one minute, he had finished working on the screen.</p><br/><p>\"Good will prevail and kill tyranny!\"</p><br/><p>This was not just a Chinese martial arts philosophy, but also a moto of American policemen. Because of their lacking education, the audience members couldn't understand the real meaning of the Chinese characters or the humanity behind the calligraphy. Its beauty still touched their souls though.</p><br/><p>Cultivating one's spirit and suppressing one's rage through action and inertia was a basic philosophy of Chinese people. The previous threatening acts were concluded by Qin Guan's performance. The audience was in awe.</p><br/><p>Everyone expressed their emotions in the most direct way.</p><br/><p>\"Well done!\"</p><br/><p>The audience clapped loudly.</p><br/>\n</div>"}