{"title": "Chapter 666: The Riot On The Monkey Mountain", "id": 666, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-666-the-riot-on-the-monkey-mountain", "volume_title": "Volume 7", "body": "<h1>Chapter 666: The Riot On The Monkey Mountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 666: The Riot On The Monkey Mountain</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Some smart pedlars were touting not far away. There was an official notice warning about feeding the animals in the area.</p><br/><p>Qin Guan shamelessly bought some bananas and popcorn for the monkeys. I should get some supplies before I head to war.</p><br/><p>Armed with his supplies, Qin Guan walked to the first cage. After taking a look inside, he unconsciously turned back to the pedlar. The old man had escaped with his goods as fast as his feet would carry him.</p><br/><p>Cong Nianwei burst into laughter. The clever monkeys wouldn't stay outside and suffer through the cold. Instead, they found shelter in the warm feeding room.</p><br/><p>As a result, all Qin Guan could see was some feces on the ground, a clear sign of the existence of the monkeys.</p><br/><p>Qin Guan got annoyed by Cong Nianwei's smile. Anxious to give the snacks away, the two of them checked all the cages one by one.</p><br/><p>There were no macaques, no long-tail monkeys, no baboons... There it was! Qin Guan burst into tears when he spotted the baboon inside the cage. His trip had not been in vain after all.</p><br/><p>After taking a closer look, he hesitated. It's so big...</p><br/><p>Of course it was! It had to survive in the African grasslands!</p><br/><p>Qin Guan sized up the animal and relaxed. It was an old baboon with very thin hair. The animal was dozing off in the sunshine, looking kind and harmless.</p><br/><p>Qin Guan looked around and then knocked against the cage bars with the banana.</p><br/><p>The baboon opened its eyes and shot a look at him.</p><br/><p>Humans are so annoying! They bother us even in the winter! Huh? Is that a banana? But that guy looks so ugly... Forget it. Visitors are rare here these days!</p><br/><p>The baboon got up with a yawn and walked over to Qin Guan. Qin Guan turned around excitedly to show Cong Nianwei.</p><br/><p>\"It's coming! Do you want to feed it yourself?\"</p><br/><p>Cong Nianwei looked scared.</p><br/><p>\"Be careful!\"</p><br/><p>\"What?\"</p><br/><p>\"Ah!\"</p><br/><p>Qin Guan turned back in surprise. Five hairy claws had reached for the banana simultaneously. His miserable animal-provoking skills had worked. The baboons inside the cage had rushed over.</p><br/><p>Those animals had no manners. They fought over food, mating, and who would sit on the throne every day. In two seconds, the banana had been seized from Qin Guan's hands.</p><br/><p>Qin Guan took out another one. Soon, it was gone as well.</p><br/><p>The old baboon he had tried to feed was waiting behind the others. When the younger ones rolled over, fighting over the banana, it walked up to Qin Guan slowly.</p><br/><p>A calm claw reached out between the bars. Judging by its experience with humans, this was its best chance of having some food all to itself. This method had been successful many times before.</p><br/><p>The human and the monkey looked at each other with emotion. Qin Guan grimaced and showed the baboon the empty plastic bag.</p><br/><p>\"There are no more bananas. Take this.\"</p><br/><p>The old baboon grabbed a single popcorn in its claw. It looked down at it and then back up again.</p><br/><p>\"Are you kidding me, bastard?\"</p><br/><p>Animals liked to express their feelings straightforwardly.</p><br/><p>The baboon revealed its true nature as a fighter by throwing the popcorn away and baring its sharp fangs at Qin Guan. As an omnivorous animal, it was good at tearing flesh apart. Scared, Qin Guan backed into Cong Nianwei awkwardly.</p><br/><p>\"Why is that monkey so angry?\"</p><br/><p>Before his voice could fade away, all the baboons got just as angry as the old baboon and shook the bars hard to vent their rage.</p><br/><p>\"Qin Guan, the old baboon must be their king!\"</p><br/><p>\"Impossible! It's not strong enough!\"</p><br/><p>\"There must be different laws in the zoo. They must look up to the older, shrewder monkeys.\"</p><br/><p>\"What shall we do then?\"</p><br/><p>\"Run!\"</p><br/><p>The two of them ran away without looking back. The zookeeper had been busy during the commotion. Those annoying visitors always caused him trouble.</p><br/><p>\"Hey! Stop, you two! You have to pay a fine! Feeding the animals is not allowed in the zoo!\"</p><br/>\n</div>"}