{"title": "Chapter 663: Memories of Youth", "id": 663, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-663-memories-of-youth", "volume_title": "Volume 7", "body": "<h1>Chapter 663: Memories of Youth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 663: Memories of Youth</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The deafening applause was much louder than the one the pole dancers had received one year ago in Los Angeles.</p><br/><p>\"That was so cool! I can eat more later!\"</p><br/><p>\"Exactly! This was a show for men!\"</p><br/><p>I saw you cast a longing look at the girls' legs! Tommy gazed at the man angrily, but didn't argue.</p><br/><p>The curtains fell down. When the Broadway dancers got on the stage, Qin Guan clapped along with his friends from the backstage area.</p><br/><p>...</p><br/><p>There was no such thing as an endless meal. The leftovers on the buffet signalled the end of the splendid party. Henry though, who was a conscientious man, would never abandon his benefactor as soon as he didn't need his help anymore.</p><br/><p>He watched the bold Asian guys chat excitedly backstage, hunched over their plates. The police station had offered the actors a free lunch. Qin Guan had specifically asked for takeaway vegetarian meals for the masters of the Shaolin Temple.</p><br/><p>Henry had his reasons for staying there. He wanted to understand the Asian men and achieve unity between the police and the public.</p><br/><p>Those conservative Asians were wary around the police. They were inclined to stay away from policemen, so some stores run by Asians had become favorites of local criminals.</p><br/><p>The policemen also suffered because of the barrier between different languages, cultures and negotiation methods. Their fear of revenge was greater than their financial loss though, so they zipped their mouths shut instead.</p><br/><p>That day was an opportunity for both sides to sit down around the same table and deepen their mutual understanding.</p><br/><p>Besides, Henry needed their help. He was interested in applying that mysterious Chinese combat art to everyday police work. He planned on combining it with the standard police training, so he wanted to have a discussion with them about a future cooperation. If possible, he wanted to invite them to work as counselors for the New York Police.</p><br/><p>Qin Guan was hoping that they would have a successful collaboration in the future. Promoting martial arts culture all over the world was a common dream after all. They all chimed in casually and had a very productive talk.</p><br/><p>Qin Guan had finally finished all his tasks for that year. In the cold winter of 2003, he would return home to enjoy the Spring Festival in China. Their family nests were a warm temptation for both Qin Guan and Cong Nianwei.</p><br/><p>During that period, China had opened its gates to the world. They didn't need to bring that many gifts with them, so they flew leisurely to the Beijing Airport. Not long afterwards, they flew to Y city, the seaside town where Qin Guan had been born and raised.</p><br/><p>The small city still enjoyed a very slow and quiet life.</p><br/><p>...</p><br/><p>The first thing they had to do was greet their old friends and relatives. Qin Guan was a star now, so his return was breaking news in the small city, where everyone was friends or relatives with everyone else.</p><br/><p>It took him about four days to attend all the dinners he had been invited to by different people. Then he was finally able to settle in and relax.</p><br/><p>During peaceful times, people were inclined to cherish the memories of their youth. There were not that many important places in Y city, but some of them were the Nanshan Park, which was perfect for walking outdoors in spring, the Night Fair, and the video game arcade at the Zhenhua Mall.</p><br/><p>Each place brought back memories from Qin Guan's school years, when he and his classmates had used to chase each other around on their bikes.</p><br/><p>Qin Guan and Cong Nianwei decided to revisit their precious memories, starting from their alma mater.</p><br/><p>On the first day of 2004, they went out on a bike ride. The cold wind slapped their faces, but there was a warm spring in their hearts as they headed to the 1st Middle School.</p><br/><p>They panted as they got closer.</p><br/><p>\"Wei!\"</p><br/><p>\"Yes?\"</p><br/><p>\"May I voice a request?\"</p><br/><p>\"Sure!\"</p><br/><p>\"Get down! I can't keep riding anymore. Ah! We are going to fall!\"</p><br/><p>Qin Guan couldn't mount the long slope with Cong Nianwei sitting behind him.</p><br/><p>\"You failed! You are impossible!\"</p><br/><p>\"Don't say the word 'fail'! I never tried to carry you on the backseat before. Besides, when you think of the dynamics… Blah blah...\"</p><br/><p>Cong Nianwei realized that Qin Guan was getting more childish as they got closer to their old school.</p><br/><p>\"Fine, you are right. Just push!\"</p><br/><p>\"Blah blah...\"</p><br/><p>\"Are you done?\"</p><br/><p>Of course not! They went around the playground before they left. The gatekeeper watched them as if they were thieves. They were not the right age to be attending the school. Plus, one of them was dressed like a bandit, which made them stand out on the school grounds.</p><br/><p>The third time the old man walked by them casually, they left as fast as their feet would allow them. Qin Guan forgot to cherish the memory of his favorite dining hall.</p><br/><p>Their first stop had been a failure.</p><br/>\n</div>"}