{"title": "Chapter 670: Good Wang Xiaoya", "id": 670, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-670-good-wang-xiaoya", "volume_title": "Volume 7", "body": "<h1>Chapter 670: Good Wang Xiaoya</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 670: Good Wang Xiaoya</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan was pulled into a small valley. When they rounded the next corner, he saw an altogether different world. There were large yards with logos of different companies all over the place. After going past a few yards, they finally reached their destination.</p><br/><p>The Jing Jian Law Firm had to be his friends' masterpiece.</p><br/><p>Qin Guan couldn't help but admire the two of them. They had found a good location in the city with a square yard and a door that opened to the public. They went through the yard to reach the meeting room and the office.</p><br/><p>The design of the yard was wonderful. It was not as cold and strict as most law firm offices. It actually looked very carefree. There were tall bamboo shelves with gourd vines climbing all over them and some small calabashes trying their best to hide under the leaves.</p><br/><p>When Qin Guan entered the room, he saw a familiar face.</p><br/><p>\"Wei? You are here too? Why didn't you call me?\"</p><br/><p>Cong Nianwei shot a confused look at Zhou Jing. \"They didn't tell you? Didn't I mention it?\"</p><br/><p>She handed him a cup of tea.</p><br/><p>\"I designed their offices in America. I thought you knew. Didn't Sister Xue tell you that Zhou and Li needed your help? Did they want to surprise you?\"</p><br/><p>What are you talking about? Sister Xue only told me about the script.</p><br/><p>Meanwhile, Sister Xue hung up and took a bite of the tomato on a stick in Yin Changtao's hands. The two of them were in the Chaoyang Temple Fair in Beijing.</p><br/><p>Yin, who was American Chinese, had never been to the Spring Festival in China, so everything there was new to him. \"Why didn't you tell Qin Guan?\" he asked Sister Xue, who was enjoying her candy.</p><br/><p>\"It's not an official job. They just want me to watch over the procedure. They are lawyers after all. They do everything by the book, even if they are working with friends. Besides, this is just casual work, it's not business.\"</p><br/><p>Yin was not very cunning. \"Then help will not be offered to the public, right?\"</p><br/><p>\"Probably not.\"</p><br/><p>\"Ha ha...\"</p><br/><p>It was too late for regrets now. They would not stress over cheating their friends.</p><br/><p>Meanwhile, Qin Guan took a sip of tea in confusion. \"What can I help you with? I know nothing about the law.\"</p><br/><p>The two men smiled at him, which made Qin Guan nervous. Zhou Jing rubbed his hands together. \"Do you remember my niece?</p><br/><p> \"Yes. Her name is Xiaoya. She's a plump little girl.\"</p><br/><p>\"She would like to see you and have some ice-cream with you.\"</p><br/><p>\"What happened to her?\"</p><br/><p>\"She participated in a dance competition. Her school won the first prize. After the Spring Festival gala, our TV station will organize a party for the Lantern Festival. All actors and performers will come from the cultural museum, the drama group and other public institutions. Wang Xiaoya was assigned to be a dancer at the gala.\"</p><br/><p>\"The children are really serious about this, but some older actors have had some conflicts with them. The rehearsal has been paused countless times. They have been preparing really hard for the gala, yet they haven't even been able to get on the stage.\"</p><br/><p>\"Wang Xiaoya was really angry. Children always tell the truth, so she told everyone that her Uncle Qin is famous all over the world, but he is still humble and honest.\"</p><br/><p>\"She betrayed your identity before her dance instructor and the director... They now know that she knows an international star!\"</p><br/><p>Wang Xiaoya, who was a proud girl, had held her head high and said, \"I'm not lying! Uncle Qin has come home for the Spring Festival. My uncle is his best friend. They used to play together when they were kids!\"</p><br/><p>The director had called his supervisor, who was the chairman of the TV station, in tears. He had a hunch that the Lantern Festival of Y city wouldn't be outshadowed by the splendid parties of other local TV stations in the Shandong Province again.</p><br/><p>Maybe their party would even win an award for making a contribution to the civilization and construction of the city. The chairman made a wise decision.</p><br/><p>\"We must get Qin Guan to our TV station. He must enjoy the festival with everyone else. He is a resident of Y city after all. Whatever we do, we have to achieve that goal!\"</p><br/>\n</div>"}