{"title": "Chapter 676: Kowloon", "id": 676, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-676-kowloon", "volume_title": "Volume 7", "body": "<h1>Chapter 676: Kowloon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 676: Kowloon</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>It was partly because of Qin Guan's entourage that Director Chen had to bring all his staff to save his dignity.</p><br/><p>They all took a seat in the meeting room. It did not seem like a normal meeting between a director and an actor, but a negotiation among gangsters. If the meeting room was a tea cafe in Miao or Bolan Street, it would have seemed even more like one.</p><br/><p>Straightforward men were rare in Hong Kong, but Director Chen asked Qin Guan some direct questions.</p><br/><p>\"You know this is a musical. I'm aware of your abilities, but I would like to know if you are familiar with the songs.\"</p><br/><p>He didn't have high expectations. All he wanted was for the young man to sing well. The film would be edited during post-production anyway.</p><br/><p>Qin Guan's answer didn't disappoint him.</p><br/><p>\"Yes, I can sing all of them. I have all the material. I don't think that will be a problem.\"</p><br/><p>Director Chen couldn't help but be enchanted by his sparkling eyes. Suddenly, he was filled with boundless pride.</p><br/><p>\"Great! When shall we begin?\"</p><br/><p>\"Any time you like.\"</p><br/><p>Director Chen clenched his fists. \"There are two shooting sites. One is in Shanghai, and the other one is in Beijing. Do you have any questions?\"</p><br/><p>\"Of course not.\" Qin Guan's kind smile made Chen Kexin like the actor even more. He's such a good boy. I thought he would be arrogant because of his entourage, but he's not.</p><br/><p>\"Get some rest today. We'll start tomorrow.\"</p><br/><p>\"No problem.\"</p><br/><p>Sister Xue turned down their proposal to attend a ball that night with the excuse that Qin Guan was tired after his long journey.</p><br/><p>As he walked out of the studio, Qin Guan looked back at the familiar site. It used to be a cradle of famous old films. The Shanghai Paramount building was located in an old tramway alley.</p><br/><p>The tattooed transport workers were just ordinary people struggling to make a living at the wharves. They all belonged to different gangs, and their job was to relay any useful information to the director. That information was a chance for them to make some money.</p><br/><p>The flourishing city experienced both prosperity and deterioration, color and darkness, vigor and erosion. Hong Kong was the meeting point of traditional Chinese culture and occidental colonial culture.</p><br/><p>Its special location and tough residents had led to its success. People from all over the world had taken there delicious food from their own hometowns.</p><br/><p>Cong Nianwei had set out in the crowded city with a backpack and a camera. After the meeting, Qin Guan met her at a very strange place.</p><br/><p>The West Kowloon Police Station was a prominent landmark. All cab drivers knew where it was. After a short walk, Qin Guan and Cong Nianwei reached the dark side of the city.</p><br/><p>Miao Street lay behind the Hong Kong University campus, close to the most prosperous commercial street in Kowloon. Top brands had set up outlet stores there, so there were always long lines before their entrances on the street.</p><br/><p>The young couple had not gone there to shop though, but to eat. Anyone who visited Hong Kong had to have a taste of the city's delicious snacks.</p><br/><p>One could find any kind of delicious food on the street, including Yuanyan Milk Tea, which was advertised on TVB as the best choice for hungry men.</p><br/><p>Most people on the streets were walking and eating at the same time. That was a rare sight in China, as Chinese parents always told their kids to take a seat before eating. That rule didn't apply on the streets though.</p><br/><p>Qin Guan and Cong Nianwei were drawn to the sea of food. There was a certain variety of takeaway food that all visitors had to try.</p><br/><p>First, one had to have a cup of milk tea in the warm winter to avoid choking on any of the other food. The most famous milk tea in Hong Kong was Silk Stocking Tea.</p><br/><p> It was not actually made of silk stockings, but it felt as smooth as silk stockings in one's mouth, and its packaging looked like silk after it had soaked for a long time.</p><br/><p>Traditional Silk Stocking Tea was hard to find in the bustling city though. Authentic milk tea was made from a mixture of Chinese tea leaves and Sri Lanka and Ceylon leaves. After the leaves were dipped in whole milk, the traditional milk tea got its typical thick, mellow texture.</p><br/><p>Qin Guan and Cong Nianwei were idling along the street hand in hand, each of them holding a cup of milk tea in their free hand. They had bought some snacks wrapped in paper, eager to taste the special flavors of the city.</p><br/><p>\"Curry fish balls!\" they exclaimed together.</p><br/><p>There was a long line before the street stand.</p><br/>\n</div>"}