{"title": "Chapter 682: Unromantic", "id": 682, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-682-unromantic", "volume_title": "Volume 7", "body": "<h1>Chapter 682: Unromantic</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 682: Unromantic</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Before he could rejoice, his leg was hit hard again. The hit was strong enough to make the pork on his chopsticks fall back on the pile of rice. The juices splashed his face, creating several funny red spots.</p><br/><p>Qin Guan looked up in confusion. He was right. It had been Zhou Xue who had kicked him.</p><br/><p>\"What's wrong, Sister?\"</p><br/><p>Qin Guan smiled brightly at Zhou, wiping the juices off his face.</p><br/><p>Zhou was shocked. There was only one word echoing in her mind. \"Sister... Sister... Sister...\"</p><br/><p>Zhang suddenly flushed. As the oldest among the three, all he could do was stand up silently and leave. He was a well-bred man after all.</p><br/><p>As soon as he entered a small room to get some rest, he spit his rice out.</p><br/><p>\"Ha ha! That boy is so funny! Water! Where is some water? I'm choking! I need some water!\"</p><br/><p>Unaware of what was happening, Qin Guan fixed his sparkling eyes on Zhou, waiting for her reply. Why did you kick me so hard? What happened?</p><br/><p>Zhou's expression kept changing. Enlightened, Qin Guan suddenly slapped his own head.</p><br/><p>\"Sorry, my bad!\" Qin Guan apologized, stirring the jar with all his strength. He was not paying any attention to her pale face anymore.</p><br/><p>\"Got it!\" His happy cry attracted Sister Xue's attention.</p><br/><p>\"I was so busy eating that I forgot to take care of the only lady present. My bad, my bad. Here you go.\"</p><br/><p>He slowly put a large piece of pork in Zhou's bowl. It was covered in juices.</p><br/><p>\"Take it, Sister Zhou. It's delicious.\"</p><br/><p>Sister Xue ran out of there, covering her mouth. All the idlers in the room left as well, shrugging and lowering their heads.</p><br/><p>\"What are they doing? They haven't finished their lunch yet. Anyway, just forget them. Have some more rice, Sister Zhou!\"</p><br/><p>\"Ha ha!\" Even calm Director Chen managed to escape in time.</p><br/><p>Bang! Zhou threw her chopsticks down onto the table.</p><br/><p>\"Qin Guan!\"</p><br/><p>\"Yes?\"</p><br/><p>\"Are you an idiot? Don't you know why a woman would kick a man's leg?\"</p><br/><p>Qin Guan nodded blankly with his mouth wide open. Then he shook his head hard. Suddenly, Zhou lost all interest in the young man.</p><br/><p>He is incompatible with me. Was that tenderness and love in his eyes just a performance?</p><br/><p>Zhou liked clever men. The moment they had looked into each other's eyes, Zhou had gotten lost in the feeling. Before that feeling could take the form of fireworks though, it had been extinguished by the pork's smell.</p><br/><p>His IQ is as low as a Husky's!</p><br/><p>The mood had been destroyed completely. Zhou stood up.</p><br/><p>\"I'm full. Keep the pork for yourself. Enjoy your meal!\"</p><br/><p>Qin Guan shivered as he looked at her angry back, but the sight of the delicious food on the table distracted him right away.</p><br/><p>\"Thank you so much, Sister! I have a large stomach to fill!\"</p><br/><p>Zhou nearly fell down. She sped up and left in a hurry, her romantic fantasy bursting like a bubble. Qin Guan kept eating at the spare table. Sounds of laughter were getting louder and louder outside. He smiled cunningly.</p><br/><p>Sister Xue returned and stood behind Qin Guan awkwardly. He stood up leisurely and cleaned the table. Then the two of them returned to the old hotel.</p><br/><p>The crew made good use of their accommodation. They could both shoot and stay there, and the hotel was also very close to the Paramount studio, so the producer was very satisfied with it.</p><br/><p>As Qin Guan closed the door of his room, Sister Xue patted her own chest. Her heart was still fluttering in fear.</p><br/><p>\"Are you an idiot? Why were you messing with Zhou? She is very good at acting!\"</p><br/><p>Qin Guan collapsed on his soft, fluffy bed. \"I love the steel-frame bed and the soft mattress. This hotel is perfect!\" he replied, trying to avoid the subject.</p><br/><p>Sister Xue was enraged. Before she could give Qin Guan a lecture, he put one of his arms under his head and turned to look at the crystal lamp on the ceiling. \"What are you so afraid of? Isn't that the best way to deal with Zhou?\" he asked.</p><br/><p>His words confused Sister Xue.</p><br/><p>\"All sixth-generation directors watch the news. They warned me about her, so I knew her least favorite type of man. Isn't this good news for any agent? No affairs. No ambiguity. The filming will start and finish quietly. Everyone wins.\"</p><br/><p>Sister Xue was astonished by his problem-solving method. He was getting more and more mature. He would do well in the entertainment circle after all.</p><br/><p>She still felt sad to see him grow up though.</p><br/><p>Suddenly, an assistant knocked on the door.</p><br/>\n</div>"}