{"title": "Chapter 707: Muddling Up The Ceremony", "id": 707, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-707-muddling-up-the-ceremony", "volume_title": "Volume 8", "body": "<h1>Chapter 707: Muddling Up The Ceremony</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 707: Muddling Up The Ceremony</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The five of them were trembling in a corner, overwhelmed by his might. Qin Guan waved at them blankly.</p><br/><p>\"Hey, I don't think we've met before.\"</p><br/><p>They all nodded at him.</p><br/><p>\"Why are you so afraid of me?\"</p><br/><p>The lead singer of Blink-182, who was the oldest of the five, held his head high, pointing his nose at Qin Guan. He was threatening in manner, but cowardly at heart. Despite his trembling voice, he still seemed undaunted.</p><br/><p>\"We… we are not afraid of you! Musicians are always united. Yes, united!\"</p><br/><p>Qin Guan burst into laughter. When he saw JoJo's sparkling eyes behind his back, the boy felt even more nervous.</p><br/><p>\"What are you laughing at? Stop laughing! You are a wizard who can fascinate people with just a smile! You are an evil spirit!\"</p><br/><p>His answer made Qin Guan laugh even louder.</p><br/><p>\"Ha ha! Nice story! Who told you that?\"</p><br/><p>The singer faced Qin Guan bravely, but he didn't say anything. Suddenly, some familiar voices were heard.</p><br/><p>\"It was me!\"</p><br/><p>\"And me...\"</p><br/><p>\"And me!\"</p><br/><p>Three blonde girls had appeared backstage. It was Britney Spears, Paris Hilton and the protagonist of \"Mean Girls\".</p><br/><p>\"Hey, Lindsay. Why did you slander me? I thought we were on the same side.\"</p><br/><p>Lindsay, who had dyed her brown hair blonde, waved her finger at Qin Guan proudly. \"I just released my first album this year. My manager is the same as Britney's!\"</p><br/><p>Qin Guan was speechless. \"How are the sales going?\" he asked her in a low voice.</p><br/><p>\"Pretty good. I have ranked among the top three new artists.\"</p><br/><p>Qin Guan fell silent. He would never understand American teenagers. Lindsay's voice was abysmal.</p><br/><p>He had been unlucky enough to hear her sing while they had been filming \"Mean Girls\". He remembered that he hadn't had anything for lunch that day.</p><br/><p>The three girls eased the tense atmosphere. As they began to chat with each other, Paris Hilton started silently moving towards Qin Guan. She was in a great dilemma. I like him so much! Qin Guan is so handsome. Oh, no! What about MacArthur? He doesn't like Qin Guan at all...</p><br/><p>Suddenly, the director shouted at them.</p><br/><p>\"The hostess needs to get ready! Music and lighting will be in place in one minute. The subtitles will run at 150 words per minute.\"</p><br/><p>\"Got it!\"</p><br/><p>\"Ready? Go! Go!\"</p><br/><p>The ceremony began at his order. A thunderous applause was heard as the curtain rose. The deafening screams of the fans reached the backstage area.</p><br/><p>\"Qin Guan!\"</p><br/><p>\"Qin Guan! My love!\"</p><br/><p>All the film, TV and music stars backstage turned their heads towards Qin Guan.</p><br/><p>Your fans are bullying us! The fans at previous ceremonies had been divided equally. Does this mean that the whole audience is composed of your fans? Those screams sound terrible!</p><br/><p>The fans seemed to act strange during the ceremony. Half the audience shouted themselves hoarse during the music awards, while the other half remained strangely silent. They were waiting for the film awards, holding up their banners casually as a response to the hostess' words.</p><br/><p>Paris Hilton was lucky. The fans didn't rebel against her. They actually considered her one of them. They had not travelled a thousand miles and almost committed a crime for those singers! They just wanted to see Qin Guan accept his awards. If European film festivals sold tickets, they would have gone there instead!</p><br/><p>They knew all about their consumer rights.</p><br/><p>Hilton remained calm as the distinguished guests of the musical awards lined up to get on the stage.</p><br/><p>Nothing, not even the hot dancers, could stop Qin Guan's crazy fans.</p><br/><p>The live broadcast was shown simultaneously on TV and online all over the world. The viewers at home were laughing on their couches.</p><br/><p>\"Ha ha! This is the funniest ceremony I have ever seen!\"</p><br/><p>\"I wonder about the psychological impact on Paris Hilton and the singers!\"</p><br/>\n</div>"}