{"title": "Chapter 700: The Crazy Building-Jumping Hero", "id": 700, "volume": 7, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-700-the-crazy-building-jumping-hero", "volume_title": "Volume 7", "body": "<h1>Chapter 700: The Crazy Building-Jumping Hero</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 700: The Crazy Building-Jumping Hero</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan knew that the kind-hearted man was worried about him, but he had no idea how dangerous squirrels could be. Qin Guan smiled at the man. I have to convince him...</p><br/><p>He stood up and put both hands on the desk. Then he jumped up and performed an elegant, effortless handstand. He pushed the table hard to pull a perfect backward somersault and land on the floor. Finally, he stretched his hand out towards the stupefied man.</p><br/><p>\"Shall we do it then?\"</p><br/><p>\"Yes!\" the man answered in a trembling voice.</p><br/><p>He was so satisfied with Qin Guan's professional performance, that he led him to the fitting room right away.</p><br/><p>Qin Guan's costume was a simple T-shirt and a pair of sweatpants. His OLLO trainers, which had been designed especially for parkour, weighed only 200 grams. Qin Guan's toes could move freely inside the shoes.</p><br/><p>Their non-existent soles allowed the wearer to run without making a sound. They could also withstand a huge impact if one fell down.</p><br/><p>Qin Guan was really interested in his equipment. Naturally, Nestle hadn't been stingy about the shoes.</p><br/><p>Qin Guan changed clothes and walked to the set with the filming team. It was an ordinary apartment block with several villas visible on the hillside not far away.</p><br/><p>Qin Guan had to make use of everything in order to reach the ground safely. His tutor, David, was a French parkour expert. He was actually the founder of the sport and a trained soldier.</p><br/><p>His strong muscles made him feel contempt for the weak Adonis next to him. He helplessly tried to explain to Qin Guan how to jump over the obstacles elegantly. In his opinion, parkour could help people survive earthquakes, fire hazards and other natural disasters, yet those Yankees only used it to show off.</p><br/><p>David could have killed the Asian Adonis twice in under one minute. The boy seemed casual and annoyed. David didn't think he could learn anything in such a short time. The team would have to find a body double for him and take some photos of his silly smile as he ate chocolate. That would be the best option.</p><br/><p>David jumped up and down between different floors, rolling and walking along narrow paths. This would be hard even for a veteran, if they were unfamiliar with the conditions, let alone a rookie that had never tried parkour before.</p><br/><p>Qin Guan memorized his movements and analyzed the building. He knew where the wires and guard bars were. That would be the best path to follow. When David fell to the ground, Qin Guan completed the map in his mind.</p><br/><p>The fact that he kept looking up made David and the rest of the crew think that he had been shocked by his performance.</p><br/><p>The man from the advertising agency walked up to Qin Guan and patted him on the shoulder in comfort. Qin Guan was the protagonist of the ad after all, not David.</p><br/><p>\"He may have invented the sport, but I trust you. A body double is on standby, so you don't need to worry.\"</p><br/><p>Qin Guan replied with a splendid smile. \"No problem. I'll give it a try.\"</p><br/><p>The man coughed loudly. Calm down, young man.</p><br/><p>Everyone had heard Qin Guan's response. David turned up his nose, while Qu sat down by the road slowly. Suddenly, she shouted at the stunned man, \"What are you looking at me for? He is up there! Move!\"</p><br/><p>The crew turned around and saw Qin Guan disappear down the corridor. In one minute, he was waving at everybody from the fourth floor.</p><br/><p>\"Camera... Full scene!\"</p><br/><p>Cold sweat covered the director's forehead. \"Are all the safety measures in place?\" he asked the prop master. \"Okay, thanks!\" Before they could finish their job, Qin Guan suddenly took action.</p><br/>\n</div>"}