{"title": "Chapter 717: Collapsing At The First Blow", "id": 717, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-717-collapsing-at-the-first-blow", "volume_title": "Volume 8", "body": "<h1>Chapter 717: Collapsing At The First Blow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 717: Collapsing At The First Blow</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Considering their age difference, Jennifer was too old to be Qin Guan's girlfriend, but her beloved husband was hard-hearted enough to accuse her of adultery, regardless of their marital status.</p><br/><p>Qin Guan came back to his senses immediately. Is he calling me a boy toy?</p><br/><p>Even a good-tempered man like him wouldn't stand for that. He bounced up from the couch and rushed over to Brad. The two handsome men, who were about the same height, stood face to face.</p><br/><p>\"This is not our first meeting, Pitt. Do you really want to defame me before you've even gotten a clear look at me?\"</p><br/><p>Brad suddenly realized who he was. His strange makeup made Qin Guan look like a vampire, but after careful observation, Brad was able to distinguish his facial features.</p><br/><p>\"Qin Guan?\"</p><br/><p>He was stupefied. The two of them had collaborated shortly in \"Confessions Of A Dangerous Mind\". Back then, the crew had compared the two handsome men to each other, even though Qin Guan was younger than Brad by about 20 years.</p><br/><p>It was embarrassing. Qin Guan was famous in the entertainment circle for his self-discipline. He never attended any crazy parties, nor did he drink or smoke.</p><br/><p>It was Brad's fault for accusing him of adultery before even finding out his identity. He couldn't back off now though. Thinking of Angelina Jolie's thick lips, he answered sarcastically, \"Defame you? Maybe you've taken things even further in private! Jennifer has just miscarried, yet she was smiling at you happily! You must be in love with her, but she is just pretending...\"</p><br/><p>Jennifer burst into tears at the insult. Qin Guan bristled with anger. Bastard! That explains why Jennifer always looks so sad. The woman was deeply in love with you and tried to have a baby with you, yet you are paying her back like this!</p><br/><p>Jennifer squatted down helplessly, her tears landing on the ground and getting smashed to pieces. Qin Guan couldn't control himself. Qu's friend is also my friend. Qin Guan picked a side immediately.</p><br/><p>He didn't want to talk anymore. He just punched Brad hard in the stomach.</p><br/><p>Bang! He used all his energy.</p><br/><p>Caught off guard, Brad took a few steps back and went down on his knees, crying out in pain. The tall, strong man lay on the ground, twisting and rolling around. All he could do was fight back with words.</p><br/><p>\"Son of a b*tch! Bastard! F*ck...\"</p><br/><p>Qin Guan played his last card, kicking Brad's butt with his pointed leather shoes.</p><br/><p>\"Ouch!\"</p><br/><p>One disaster followed another. Brad's screams attracted the group of children actors, who always went to Qin Guan's room to eat and lie on the comfortable couch. They loved to visit him, and their guardians were aware of that.</p><br/><p>As a result, they watched the whole incident from the crack of the door excitedly. Brad's scream escaped from the crack and reached their ears.</p><br/><p>The crew was too busy to pay attention. The only one idling around was Tim Burton. The old gossiping man hurried over when he heard the screams and found Qin Guan kicking another man's butt. The wretch was rolling around on the floor.</p><br/><p>What was he doing? The man had to be an idiot! If he rolled around, he could get accidentally injured.</p><br/><p>Unable to protect himself from the first kick, Brad rolled over, nearly squeezing his testicles to death.</p><br/>\n</div>"}