{"title": "Chapter 714: A Strange Man", "id": 714, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-714-a-strange-man", "volume_title": "Volume 8", "body": "<h1>Chapter 714: A Strange Man</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 714: A Strange Man</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>A skilled actor could make something out of nothing. They could pretend to see invisible figures or fabricate emotions, which was precisely Qin Guan's advantage.</p><br/><p>In one minute, Tim Burton forgot all about his resentment for Qin Guan. He knocked on a board next to him, threw a wooden stick at the shelf and said, \"Cut!\"</p><br/><p>This was his typical way of finishing a scene. His knock acted like a gong at the end of a boxing round.</p><br/><p>Not everyone was familiar with this habit of his though. The assistants hastened to explain to the children, for fear that they would offend the strange director.</p><br/><p>When the director left, Qin Guan craned his neck around the candy, immediately attracting the attention of the children. He winked at them and made a grimace, making the children burst into laughter.</p><br/><p>Their parents and agents misunderstood their laughter. Qin Guan was behind them, so they couldn't see him. Thinking that the children were making light of their lessons, the adults surrounded them with a strict expression on their faces.</p><br/><p>Qin Guan realized he was in trouble and tried to escape under the cover of the candy, all the while sticking his tongue out at the children. The innocent children tried to explain. \"No, we were not laughing at you! Qin Guan was making faces at us!\"</p><br/><p>\"Where is he?\"</p><br/><p>The adults turned around in the direction the little fingers were pointing, only to find empty space. They all turned back angrily. \"Don't make excuses! You are just messing with us...\"</p><br/><p>Before they could finish their words, they saw a large white face before them. Qin Guan, who had walked around the children, was now making faces at the adults.</p><br/><p>His white face made him look like a scary ghost. The adults nearly fell down from the shock, but the children were really excited.</p><br/><p>\"Look! We were not lying. Uncle Qin was greeting us!\"</p><br/><p>The naughty children just wanted to get out of trouble. Before Qin Guan could complain, the adults surrounded the children with forced smiles and disappeared as fast as they could.</p><br/><p>\"See you!\" They left faster than rabbits.</p><br/><p>Qin Guan looked so strange that the guards had forgotten that he was an award-winning actor. He was just a freak they had to keep a distance from.</p><br/><p>Qin Guan was looking at the empty room sorrowfully, when Qu and Jennifer walked over to him slowly.</p><br/><p>\"Why are they treating me like this, Sister Qu?\"</p><br/><p>\"Rubbish! Could you please wash your face before you greet people? Change out of your costume and then come back and talk with me. You look like a zombie!\"</p><br/><p>Qin Guan walked to the dressing room sadly. \"But my makeup looks so cool!\"</p><br/><p>Qu forced a smile at Jennifer and tried to ease the awkward atmosphere.</p><br/><p>\"Don't get too much into character,\" she told Qin Guan. \"The character's traits are not yours. Remember that!\"</p><br/><p>Qin Guan shrugged. He really liked the film. Even though it was a children's film, the simple story allowed him to show his abilities. If he could get good reviews and succeed at the box office, he might win some awards for his last film.</p><br/><p>As Qin Guan was imagining his future happily, the two ladies were talking about him. Qu shared some funny stories about the award-winning actor with her new friend. The anecdotes made Jennifer feel better.</p><br/><p>Qin Guan returned to the set in another costume. The crew was adjusting the set for the last time before filming began.</p><br/>\n</div>"}