{"title": "Chapter 719: Officially Returning to China", "id": 719, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-719-officially-returning-to-china", "volume_title": "Volume 8", "body": "<h1>Chapter 719: Officially Returning to China</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 719: Officially Returning to China</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>In a corner of the room, Qu was bidding farewell to Jennifer.</p><br/><p>\"So you're leaving?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Will you return to China with Qin Guan?\"</p><br/><p>\"Not anytime soon. I have my own work here in America regarding the studio. I like it. I won't resign. You do not need to worry about me. You have your own problems. Have you made a decision?\"</p><br/><p>Jennifer looked absent-minded for a while.</p><br/><p>\"Yes, we will separate after our company and common assets are taken care of.\"</p><br/><p>\"You will let him go that easily?\"</p><br/><p>\"I'm living my own life. He has been nothing but a stranger ever since we broke up. I would never waste any emotions or energy on a stranger. Why would I?\"</p><br/><p>Qu approved of her foreign friend's attitude. Women had to remain unburdened and independent. The two friends hugged each other before parting ways. Meanwhile, not far away, Qin Guan finished saying his own farewells.</p><br/><p>\"Good luck.\"</p><br/><p>\"I wish the same to you.\"</p><br/><p>Time never paused for anyone. Cong Nianwei was so busy working at the community construction site, that she missed Qin Guan's flight.</p><br/><p>The inventor of the video call would always be praised by couples. Qin Guan had no time to rest at home. He had too many things to do.</p><br/><p>As soon as he switched to his previous phone number upon his return, he received a short message from his realtor.</p><br/><p>\"Hi, Mr. Qin. This is Xiao An. I have some urgent news for you. Wanda Group is facing some conflict with the residents of the Dongzhimen yards. Do call me back when you return to China.\"</p><br/><p>Qin Guan read the message right away. What happened? Why didn't they have a friendly negotiation? Qin Guan glanced at the clock on the wall before he called the man back.</p><br/><p>\"Hello, this is Zhongdahengji Real Estate Company Limited. Thank you for your call. What can I do for you?\"</p><br/><p>\"Hello, I'm a client of yours. My surname is Qin. An Zhijie, your manager, knows me. May I talk to him?\"</p><br/><p>\"Yes, wait a moment.\"</p><br/><p>As soon as An was notified by his assistant, he returned to his own independent office to give Qin Guan a private report.</p><br/><p>\"Hello? Yes, this is Xiao An. Have you returned to China, Mr. Qin? Great! Listen...\"</p><br/><p>Ten minutes later, Xiao An had finished his flawless narration. Qin Guan realized that the events that had taken place in the past six months were enough to write a long script.</p><br/><p>At the beginning, both sides had been reasonable. They had just negotiated about the contract according to their respective standpoint. When the rush of real estate development in the capital had begun though, Wanda Group, which was at the top of the real estate industry, couldn't wait anymore.</p><br/><p>The State-Owned Asset Supervision and Administration Commission made a series of sudden reforms on national real estate investment and development. Following the laws and regulations of the industry, they had met the qualifications of the new institutions of real estate development and investment.</p><br/><p>All real estate companies had been affected by the new policies. The strict requirements and high standards had left only two options to the smaller companies.</p><br/><p>They had to shut down their businesses and transfer any on-going projects to qualified companies, or cooperate with a big company to complete their unfinished projects. Of course, the government would act as an inspector during the whole process.</p><br/><p>Their second option was much simpler. The big fish ate the small fish, so in order to survive, the small fish had to unite and form a big fish that could fight against their enemies.</p><br/><p>Hundreds of small real estate companies in the city merged and formed bigger ones. As a result, real estate companies began competing even more fiercely.</p><br/><p>Wanda Group was surprised to discover that those small fish could sit at the same conference table as them. The new competitors wanted a piece of the pie.</p><br/><p>There were opportunities everywhere, so time was of the essence.</p><br/><p>Before any funds started flowing in, a project had to go through a process of investment, design and construction. For real estate agents, this was a very long procedure. During these golden times of development, it was very important for companies to shorten that process.</p><br/><p>Wanda was no longer calm. The company was eager to start a negotiation, but the price suggested by the stubborn residents was ridiculous. They just couldn't reconcile themselves with the principle of benefit maximization.</p><br/><p>They tried several ways to solve the problem, including differentiation, suppression, conciliation, and threatening. The gong and drum had rung to signify the start of a full-scale drama.</p><br/><p>Plumbing maintenance, circuit damage, environmental sanitation suspension, construction noise... Wanda Group had tried everything in their power to convince the residents of the area.</p><br/>\n</div>"}