{"title": "Chapter 747: A Strange Exhibiting Method", "id": 747, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-747-a-strange-exhibiting-method", "volume_title": "Volume 8", "body": "<h1>Chapter 747: A Strange Exhibiting Method</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 747: A Strange Exhibiting Method</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The uniform products were surrounded by unique artwork. The fair, which was full of surprises, stretched as far as the eye could see.</p><br/><p>It took Qin Guan 10 minutes to get to the Asian section.</p><br/><p>This was the first time a Chinese group was attending the fair. The group looked shy among all the Southeast Asian textiles stands, almost like a young lady revealing her face from behind a screen.</p><br/><p>Traditional textile products, including wedding beddings embroidered with dragons and phoenixes, and other related household products were displayed up front.</p><br/><p>The Renfeng spinning mill, which was a prop from the TV series \"Big Dyehouse\", had been used to defeat the Japanese factories in the Shandong Province. The products of the factory, which had been state-run at the time, had been very popular in Southeast Asia. Even after so many years, textile manufacturers still took delight in talking about it.</p><br/><p>The Chinese had brought their innovative traditional skills to the fair and used them to adjust the products to the taste of modern customers. After more than 80 years, the factory finally sprang forward fiercely.</p><br/><p>The typical fabrics and bright colors attracted Qin Guan's attention and helped him spot the Chinese stands easily.</p><br/><p>Unfortunately, he could do nothing to help the Chinese manufacturers. He couldn't walk around wrapped in a sheet after all. All he could do was act as a free advertising board and hold up a pillow that said \"Good Luck\" in Chinese.</p><br/><p>Smiling was the best method of communication.</p><br/><p>Qin Guan's white suit was the perfect choice for the fair. The white color stood out among the colorful textiles and made him seem prominent among all the soft weaved blankets, large mattresses and smooth silk sheets.</p><br/><p>Looking at the comfortable beddings made Qin Guan feel sleepy. He looked around at the crowd silently, and then took off his leather shoes and set them down next to a blanket. The comfortable touch of the thick blanket made Qin Guan groan.</p><br/><p>He moved his toes up and then back down. Before anyone could notice him, he walked to the innermost corner of the hall, where the pillows were piled up like a mountain, and made himself comfortable. As he looked at the people moving around the room, he found himself recalling his past life.</p><br/><p>What a wonderful day… It's like a leisurely afternoon on campus… Warm sunshine, green grass… Birds and flowers...</p><br/><p>Qin Guan's eyelids dropped and he fell asleep.</p><br/><p>When Wang Liying finished her job, she returned to the fair and found Qin Guan lying on the pillows. The LED lights around him made him feel warm in that dark, cold city.</p><br/><p>His white suit created a sharp contrast against the colorful pillows. The sight reminded Wang of a fairy sleeping among blooming flowers.</p><br/><p>The sleeping man attracted the attention of the bustling crowd. People started gathering around Wang to look at him, but were instead attracted by the exhibits around him.</p><br/><p>The buyers, who had already visited thousands of stands, looked at the Chinese stands carefully. The Chinese manufacturers were surprised.</p><br/><p>A buyer from Amsterdam walked out of the crowd.</p><br/><p>\"May I take a look inside if I take off my shoes?\"</p><br/><p>Wang cast a worried look at Ye Dong. The Chinese manufacturers looked at her eagerly.</p><br/><p>Okay, okay. Business was more important than sleep after all. Wang handed the large bag to Ye Dong carefully.</p><br/><p>\"Hold this for me, please. It's important. I'll show the buyers our products.\"</p><br/><p>\"No problem.\"</p><br/><p>Taking control of the situation, Wang took off her shoes and began to show everyone the products.</p><br/><p>\"How many sheets do you have?\"</p><br/><p>Wang pointed at the shelf. \"Traditional or modern ones?\"</p><br/><p>\"Both.\"</p><br/><p>\"We have 122 kinds here.\"</p><br/><p>\"How are they classified?\"</p><br/><p>\"According to place of origin. We have everything, from traditional Yunnan prints to Northwest handmade wool products. Of course, the handmade ones are more expensive.\"</p><br/>\n</div>"}