{"title": "Chapter 754: The Best Place To Flaunt One’s Wealth", "id": 754, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-754-the-best-place-to-flaunt-one%E2%80%99s-wealth", "volume_title": "Volume 8", "body": "<h1>Chapter 754: The Best Place To Flaunt One’s Wealth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 754: The Best Place To Flaunt One’s Wealth</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Thanks to Qin Guan's influence, he would not have to worry about the sales volume. In one day, the Chinese people would realize their dream of reconstructing their country through business.</p><br/><p>Qin Guan had no idea about this ambition of his. If he had, he would have cooperated with him to achieve that goal.</p><br/><p>He and Cong Nianwei were currently packing for their trip to Dubai, a country that only experienced summer and spring. Even in December, the temperature was still over 70 degrees. A long-sleeved shirt was warm enough for the coldest months.</p><br/><p>The first snow had just fallen in the capital, so when Qin Guan and Cong Nianwei got on the airplane, they were wearing thick clothes. When the plane landed though, they felt like they had gone back in time to last spring.</p><br/><p>Dubai, which was located in the Arabian gulf, was the largest city in the United Arab Emirates and the richest city in the Middle East. It was also the country with the most immigrants among the Arabic nations. The Chinese population there was about 200,000.</p><br/><p>The conservative native women were wearing black robes that only exposed their eyes, unlike the Chinese girls who were dressed like peacocks in that magnificent, fashionable country.</p><br/><p> Western girls took things even further. They wore shorts, flip-flops and miniskirts and enjoyed themselves so much that they often forgot to leave the beach.</p><br/><p>Unfortunately, Qin Guan had no time to appreciate the beautiful scenery. The staff at the airport suddenly found themselves watching a strip show.</p><br/><p>The handsome Asian man took off all his clothes as soon as he walked out of the exit. When he had taken off his scarf, coat, sweater and sunglasses, the pretty girl next to him took off her hat.</p><br/><p>The man murmured, \"Qiuku, maoku [1]\", or something along that line. Suddenly, an exasperated woman walked over to stop him.</p><br/><p>Qin Guan had been invited by a local tycoon, so he was welcomed in a lavish way. Despite his confidence and arrogance though, he was still shocked by the gorgeous festival committee.</p><br/><p>A tall Arabian man in a loose robe stretched his hand out towards the parking lot.</p><br/><p>\"Hello, Mr. Qin. Judging by your entourage, I suggest that you use an ordinary method of transportation. We will get to the hotel by car.\"</p><br/><p>Okay. What would be an extraordinary method of transportation then?</p><br/><p>Qin Guan looked at the lawn far away as the man waved his hand around proudly. \"Unfortunately, your team is bigger than we thought. We have only one spare helicopter at hand. It's not enough to transport all your staff.\"</p><br/><p>Thanks, but I'd rather go by car. I don't mind taking a cab.</p><br/><p>When Sister Xue saw several white Rolls Royces pull over in front of them one after the other, she was impressed by the organizing committee.</p><br/><p>All the drivers were Indians wearing white uniforms with yellow copper buttons. It seemed that most Indians tended to work as drivers in foreign countries.</p><br/><p>Han Zhujiu pretended to check the third car carefully. Then he nodded at Qin Guan, indicating that the car was safe.</p><br/><p>The Chinese were always very polite. The professionalism and calmness of Qin Guan's team impressed the Arabian man, who paid special regards to the Chinese employees.</p><br/><p>They all certainly deserved his respect. The Western judges, who were astonished by the luxurious line-up, started crying and bouncing around like idiots. Arabian people looked down upon such behavior.</p><br/><p>The helicopter and the cars travelled towards the same destination: the only seven-star hotel in the world. People called it the sailing hotel because of its appearance, but its actual name was the Burj Al Arab Hotel.</p><br/><p>The hotel was built on a man-made coast by the sea and it looked like a giant sailing ship. One could imagine how it must have felt when the helicopter landed on a landing field as high as 130 meters in the air. An acrophobe might have suffered a sudden cardiac arrest in the process.</p><br/><p>Qin Guan's team arrived at the hotel by car. The hotel impressed Cong Nianwei, who now realized the perks of being rich.</p><br/><p>Only 202 suites of the hotel were available for reservation. Each room had two floors, and even the smallest ones were as luxurious as five-star hotel suits.</p><br/>\n</div>"}