{"title": "Chapter 755: Refusal", "id": 755, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-755-refusal", "volume_title": "Volume 8", "body": "<h1>Chapter 755: Refusal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 755: Refusal</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The large room was certainly worth the 1,000 dollars a night. Of course, the inner decorations were more cost-effective. There was only one piece of antique furniture that was of the same value as the housing expenses.</p><br/><p>The kind host had booked a royal suite for the couple. The suite was 780 square meters. Sister Xue and the rest of the team had shamelessly occupied the movie theater, library and meeting room.</p><br/><p>When Qin Guan entered the bathroom, he found himself surrounded by Hermes perfumes and bathing products. The guests could take anything they liked, so the people that enjoyed collecting body wash and shampoo samples from different hotels would have a blast.</p><br/><p>Actually, even though he was a Hermes ambassador, Qin Guan didn't have any Hermes products in his luggage. He looked down at the \"Rejoice\" shampoo in his hand and threw it away. He had only brought it in case the hotel supplies were of bad quality.</p><br/><p>When Qin Guan went out, he experienced another shock.</p><br/><p>If one was staying at the hotel, the waiters would bring them food at fixed times. That way, a tourist could eat without having to go out and enjoy all the entertainment programs there.</p><br/><p>As a guest of the film festival committee, Qin Guan's primary task was to judge the indie films. Any movie lover would be glad to do that, but this was a new film festival with limited popularity, so very few films would participate.</p><br/><p>If one ruled out the Chinese films brought by Qin Guan, there were only 66 films from 25 different countries. For an international film festival, this was a pathetically meagre number. Even a primary selection was unnecessary. All the films could be shortlisted right away.</p><br/><p>Thanks to his status, the organizing committee had taken Qin Guan's suggestions into consideration. They actually couldn't invite any stars to the red carpet despite their huge investment.</p><br/><p>Qin Guan suggested turning the award ceremony and red carpet show into a press conference about top fashion brands. Dubai was a commercial city and the film festival aimed to promote tourism, so they could create a perfect balance between art and commerce.</p><br/><p>Indie films and limited-budget films could win a high award bonus in Dubai, so Qin Guan planned on hosting a commercial party to attract global attention and achieve their original goal.</p><br/><p>He massaged his temples in the projection room before filling out the form and throwing it into the ballot box on the center of the table.</p><br/><p>To make sure that the procedure was fair, a notary would be counting the votes. That way, the judges would be able to get some relief before the final event.</p><br/><p>They all gathered in the small bar next to the projection room, where a professional bartender considerately served them some special mixed wine to ease the pressure they felt.</p><br/><p>Qin Guan, who was standing in a corner with his cup, attracted everyone's attention. Suddenly, an Asian director walked over to him with a glass of pure whiskey.</p><br/><p>The elegant man raised his glass in greeting.</p><br/><p>\"Director Li!\"</p><br/><p>It was too late for Qin Guan to escape. All he could do now was respond to the man's warm greeting. The director had finally caught him.</p><br/><p>The man had originally had no intention of attending the festival, but when he had failed to get in touch with Qin Guan through Qu Xuemei, he had decided to go there personally.</p><br/><p> He had found out Qin Guan's schedule through some friends of his in China. His participation was a surprise for the festival committee, but no one would turn him away.</p><br/><p> Thus, Li An caught up with Qin Guan, who now had to deal with the persistent director.</p><br/><p>\"Do you know why I'm here?\"</p><br/><p>\"Yes. Can I say no?\"</p><br/><p>\"Why would you? You didn't mind shooting a similar scene for 'Elephant'.\"</p><br/><p>\"That was different. The characters were sexually confused teenagers. The whole thing had nothing to do with love or desire. It was pure instinct.\"</p><br/><p>Li An couldn't say anything.</p><br/><p>\"Besides, I'm not gay. This could affect my image in China. People are still conservative about this issue. The State Administration of Radio, Film and Television could expel me.\"</p><br/><p>Li An decided to use his trump card.</p><br/><p>\"But you would be nominated for the most prestigious American award!\"</p><br/><p>\"You mean an Oscar?\"</p><br/><p>\"Exactly!\"</p><br/><p>\"But I was nominated this year. For both an Oscar and a Golden Globe.\"</p><br/><p>\"Those were supporting actor awards. This is different.\"</p><br/><p>\"I can't see the difference. It's still an acknowledgement of my acting talent. A true actor wouldn't look down on it. It's a milestone, but it's still not the peak of my career.\"</p><br/>\n</div>"}