{"title": "Chapter 761: A High Box Office", "id": 761, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-761-a-high-box-office", "volume_title": "Volume 8", "body": "<h1>Chapter 761: A High Box Office</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 761: A High Box Office</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>It had been two months since \"Closer\" had formally premiered in America. The popular film had used all available resources to increase its chances of winning an Oscar. This meant that the producers had invested even more on the film's promotion.</p><br/><p>It was a pity that the box office did not match their large investment and the public's praise.</p><br/><p>It was good, but not good enough. Everyone's expectations had been too high, so they were a little disappointed with the moderate result.</p><br/><p>In two months, the box office in North America had reached only 40 million dollars, and it was estimated that the final box office would reach only 70-80 million after nearly six months.</p><br/><p>However, the presence of a particular person changed the status quo completely.</p><br/><p>\"Qin Guan is back!\"</p><br/><p>Qin Guan's blog had been run by his team in New York ever since Rongzhi had left. Articles about his activities, including his splendid Paris Fashion Week performance and amazing trip to Dubai, were posted in real time.</p><br/><p> The fans thought that their idol had just gone on a business trip around the world, but a wise middle-aged fan made the following accurate statement.</p><br/><p>\"As long as the Oscars take place in Los Angeles, America will remain Qin Guan's second home.\"</p><br/><p>His sappy words were like chicken soup for the soul. A few months later, Qin Guan returned. After remaining in the background for a few weeks, \"Closer\" suddenly became popular again. The fans registered on Qin Guan's website had reached more than 2 million all over the world, which was a huge achievement.</p><br/><p>A post in red letters was moved to the top by the site administrator.</p><br/><p>\"We can pay to watch 'Closer' now!\"</p><br/><p>The post drew tears from all the users.</p><br/><p>\"Once upon a time, his departure made me sad and confused, but then I saw his posters around all New York streets. He was standing behind Julia Roberts, looking all mighty and cruel. That was the first time I heard news about him through traditional media after so many months...\"</p><br/><p>\"He disappeared from my life before I knew it. Only now did I realize that my favorite actor had been missing. He used to live in the same city with me. When he returned to China, he took my heart with him.\"</p><br/><p>\"I cried my heart out. I had no courage to buy a ticket for his movie, for fear that I would burst into laughter when I saw him on the screen. I know venting like that doesn't make any sense, which is why I didn't see the film despite its good reviews.\"</p><br/><p>\"Things are different now though. He is back after six months. He is with us again! Although he is not in New York, my joy is almost palpable. This is my chance to finally watch the film!\"</p><br/><p>\"Watching the film so late made me realize his charm. He outshined all the other actors and brought his character to life. I feel better now. Although he returned to China for his own reasons, no one will forget his outstanding acting skills.\"</p><br/><p>\"Hollywood has the best scripts, directors, producers and actors in the world. As long as it dominates the film industry, Qin Guan will belong to Los Angeles and to his American fans. He will return here time and again!\"</p><br/><p>A stone could stir up thousands of waves. Even the people who had already seen the film choked up with emotion and went to the cinema again to show their support for the film.</p><br/><p>After a dry spell of two months, the box office started increasing again. During the first weekend of Qin Guan's return, the film ranked fifth in the American box office with 1.88 million dollars.</p><br/><p>The statistics cheered everyone up. A small voice echoed in their hearts, muttering the words, \"Qin Guan has returned.\"</p><br/>\n</div>"}