{"title": "Chapter 781: Arduous Conditions", "id": 781, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-781-arduous-conditions", "volume_title": "Volume 8", "body": "<h1>Chapter 781: Arduous Conditions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 781: Arduous Conditions</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan put on a large cotton gauze mask and asked the nurse with a poker face, \"What's wrong with her?\"</p><br/><p>The nurse looked at the crying girl with a disdainful expression. \"Hey, that's enough. That bruise is no bigger than a fingernail!\"</p><br/><p>Director Yin zoomed to get a reaction shot of Qin Guan. His beautiful eyes shot an indifferent glance at the girl. He knew all about matters of life and death, so dramatic girls like her were his least favorite kind of patient.</p><br/><p>Qin Guan used an effective method to stop the troublemaker.</p><br/><p>\"Nurse! Nurse, be careful! Please!\" When Li cried out loudly, Qin Guan slapped her across the face. His hands were in disposable gloves.</p><br/><p>It was not a hard slap, but she suddenly stopped crying. The girl looked shocked. Turning her head around, she fixed her eyes on the doctor like an idiot. </p><br/><p>Bang! He gave her another slap.</p><br/><p>\"You… How dare you...\"</p><br/><p>Stupefied, the girl forgot about the small wound on her arm and looked at the man in confusion.</p><br/><p>\"Cut!\" Everyone burst into laughter. Qin Guan took off his thick mask and smiled.</p><br/><p>\"You don't need to worry about acting, Li Bingbing. That character is you!\"</p><br/><p>Li tried to resist laughing. \"Nonsense! I'm not such a coward!\"</p><br/><p>Qin Guan gave her a standard military salute. \"Greetings to the crybaby with the big eyes and the short hair!\" That was his next line.</p><br/><p>If Xu was the purest jasmine in a greenhouse, Li would be the toughest sunflower on a blooming field. The girl gradually started thinking of the military doctor as the only sun in her life.</p><br/><p>Director Yin looked up to the ceiling of the tall military building amid the relaxed atmosphere. The moonlight shone through the cracks.</p><br/><p>\"It's late. We have to finish the most important scene before getting some rest.\"</p><br/><p>\"No problem!\" Everyone returned to their posts.</p><br/><p>It was a cold night in the countryside, so their cotton clothes couldn't protect them against the wind.</p><br/><p>The actors stood by the entrance, stomping their feet on the ground. When the director ordered them to, they rushed out to the trench.</p><br/><p>Taking advantage of her post, Li took some goods that she needed badly from the Commander. She planned on making a good meal for the man she liked.</p><br/><p>It was only rice crust, but food was precious for ordinary soldiers. Before they parted, Li took some small green apples out.</p><br/><p>Fruit of such quality didn't attract attention nowadays, but that winter years ago, it had been considered delicious food.</p><br/><p>Everything around the couple was gray or black. Only the two green apples brought a sense of vitality to the scene. Li nudged Qin Guan's shoulder with her elbow.</p><br/><p>\"Will you write to me from that new place? I'll get your address and write back to you.\"</p><br/><p>\"Forget it.\" Qin Guan moved her elbow back, as if she was his brother. \"We are all really busy. Why would I write to you?\"</p><br/><p>\"I like you!\" she answered loud and clear.</p><br/><p>As Qin Guan fell silent, the camera descended slowly to draw a full stop to her abrupt confession.</p><br/><p>\"Cut!\"</p><br/><p>\"Ouch! Finally!\" Qin Guan bounced up from the ground. He had been squatting down during the long scene and the chilling cold air had frozen his feet.</p><br/><p>Wang quickly gave him a thick coat and led him to the Kang. There was no hotel or country home for tourists in that remote village, so the village committee helped them settled down in some family homes with spare rooms. The farmers would have a wealthy Spring Festival that year.</p><br/><p>Because of the large number of figurants, the actors' living conditions were a little hard. Qin Guan was experiencing for the first time the difficulties of war dramas. He was lying on the Kang in a closet, feeling utterly destitute.</p><br/><p>There were enough quilts, but no thick mattress. After one day of work, Qin Guan took off his coat and collapsed on the hot Kang.</p><br/>\n</div>"}