{"title": "Chapter 787: Be Nicer To Yourself", "id": 787, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-787-be-nicer-to-yourself", "volume_title": "Volume 8", "body": "<h1>Chapter 787: Be Nicer To Yourself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 787: Be Nicer To Yourself</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Before the guests could come back to their senses, Ouyang Fen covered Ou Qiang's mouth. If the bastard was brave enough to snatch the bride, Ouyang Fen would think higher of him, but Ou Qiang just cried in shame under the stage without taking any action.</p><br/><p>The bride had never paid attention to his brother, and his company was relying on Qin Guan.</p><br/><p>After so many years, Ouyang Fen was no longer the young bull fighting with Qin Guan. Before Qin Guan had gone abroad, Ouyang had seen his limitations in the modelling circle, as fashion trends took a strange, sharp turn during those years.</p><br/><p>The modelling circle, both in China and overseas, favored models with unique features. Both designers and critics insisted on high-end taste.</p><br/><p>As a result, despite his A-level status, Ouyang saw his choices become fewer and fewer. His personal label became a tightening ring that held him back from success.</p><br/><p>Male models with inimitable characteristics were gradually budding up and joining different brands. The childlike man was not stupid, so he slowly saved money and started his own business. For a model, selling clothes and fashion products was the simplest solution, so he founded an independent fashion brand and became its boss and representative.</p><br/><p>His brand was called \"O\". It was for that brand that Ouyang had investigated Qin Guan. He had tentatively avoided the civilian route J Clothing and Qin Guan's advanced formalwear line had taken and marketed his brand to mid-to-high-end minorities that liked strange patterns, such as Hongying traditional Chinese patterns or linen clothing, which had gradually become popular in China.</p><br/><p>The brand was targeted at young misfits interested in punk and gothic culture. Ouyang had been wanting to meet Qin Guan for a long time. He had kept Qin Guan's number saved on his phone.</p><br/><p>He wanted to invite him to his press conference so he could make some positive comments about his designs. Ou Qiang pressed his mouth closed. He felt like weeping, but no tears came.</p><br/><p>When he turned his head towards Qin Guan and Cong Nianwei, who were trying their best to suppress their laughter, he felt pain on his hand.</p><br/><p>\"F*ck! You bit me!\" What happened next shocked him.</p><br/><p>Sister Xue heard his cry and got down from the stage without throwing the bouquet. She had decided to give the troublemaker a lesson.</p><br/><p>The white roses that stood for pureness hit Ou Qiang on the head like a feather duster and the white petals fell down like rain. Everyone burst into laughter.</p><br/><p>\"Darling, let me do that! Beware of the thorns!\"</p><br/><p>Yin Changtao took the bouquet and beat Ou Qiang against the head at a high frequency.</p><br/><p>Bang, bang, bang… Soon, there were only a few leaves left on the stems. The culprit was covered in pedals. Sister Xue grabbed the lonely stems back.</p><br/><p>\"Take them, Ou Qiang. Today I won't throw the bouquet for my best friends to catch. I'll break the rules for you. You are my good girlfriend after all. This is my gift to you. Take it and go marry somebody else.\"</p><br/><p>Alas, she didn't even think of him as a man.</p><br/><p>That final blow made Ou Qiang cry. Petals covered his body and bare stems were in his hands as the happy couple left with everyone's blessing.</p><br/><p>The bird did not belong to him. It had flown away forever. He had to forget now. All lives ended. All hearts were broken. Caring for someone was not an advantage. Time healed all wounds. He had to be nicer to himself.</p><br/><p>...</p><br/><p> Ouyang Fen patted his brother on the shoulder as the ceremony ended.</p><br/><p>Qin Guan had to return to his big pile of scripts. Sister Xue would leave for her honeymoon, so Wang Liyang would replace her temporarily.</p><br/><p>She had been promoted and gotten a raise. Her duties were very important to her, so she was strict with Qin Guan.</p><br/>\n</div>"}