{"title": "Chapter 794: A Green Lotus Out Of Water", "id": 794, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-794-a-green-lotus-out-of-water", "volume_title": "Volume 8", "body": "<h1>Chapter 794: A Green Lotus Out Of Water</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 794: A Green Lotus Out Of Water</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Diamond was one of the top jewellery brands in China. Soon, staff from the security and insurance company, as well as Diamond employees, started arriving at the film base with dozens of safes.</p><br/><p>By then, Du Chun was in no mood to antagonize Qin Guan. He just sat down in a corner with a copy of the script, pondering everything.</p><br/><p>Pearl necklaces, agate, white jade bracelets, and Han-style ruby hairpins were poured into the case.</p><br/><p>A Diamond employee delivered the final blow.</p><br/><p>\"These are samples returning to the headquarters for maintenance and polishing. We have insured them, but their value is not high.\"</p><br/><p>Qin Guan didn't take this seriously, but everyone else started spreading the news around. In their opinion, Qin Guan was a real source of money. The jewellery company had given him gold and pearls, and he was showing off his fortune by investing capital in the film...</p><br/><p>Anyway, let's get back to the topic. This was Tian Fen's time to shine. The poor guy had become one of the richest men in the city. He was just like a loser in a web novel. Others relied on money, but he relied on his identity and shamelessness.</p><br/><p>Despite his new fortune, he hadn't changed. He took the jewellery back to his sister times 100. While his sister was appraising the jewellery, Qin Guan furtively put the stolen bracelets back in their case.</p><br/><p>The scene ended in a dramatic manner, as the security guards and the jewellery inspector were all standing around the case.</p><br/><p>The director finished filming the scene without any pressure. Hu Mei even kept some hairpins for the next scenes.</p><br/><p>She was really satisfied with Diamond's promise to provide her with different jewellery on demand.</p><br/><p>Qin Guan's work was going well in Zhejiang, when Cong Nianwei suddenly decided to go visit her boyfriend. She had already finished her job and was feeling lonely in their empty house. After a few short messages, she decided to go to Zhejiang.</p><br/><p>\"Are you busy these days?\"</p><br/><p>\"No, I've had no work recently.\"</p><br/><p>\"What are you doing then?\"</p><br/><p>\"Daydreaming and missing you.\"</p><br/><p>\"We just finished the first draft. I have a few days off to rest.\"</p><br/><p>\"Really? Could you come see me, Wei?\"</p><br/><p>\"Of course. What's the address?\"</p><br/><p>\"XXXX… You will be just in time for my sexy scene. Call Wang Liying when you arrive.\"</p><br/><p>\"Okay!\"</p><br/><p>\"Miss you...\"</p><br/><p>Cong Nianwei set off as soon as she could. When she arrived at the film base with Wang, she found her boyfriend shooting a wet-shirt scene. This was not the erotic scene she had imagined. There was no actress. There was only an old man present.</p><br/><p>Tian Fen was trying to find talented men to work for his nephew. He found Dou Ying by a lake in the suburbs. When the prince had some free time, he liked to spend it fishing.</p><br/><p>If Tian Fen were a nobleman, he would have waited by the bank. In an effort to show his sincerity though, he decided to get in the lake.</p><br/><p>Qin Guan was wearing only a pair of loose linen pants. He was naked from the waist up. The entire crew grew excited at the sight of him.</p><br/><p>The majority of the crew were maids and soldiers from the surrounding villages who had never seen such a good figure. All the women fixed their eyes on Qin Guan's body. This was a natural response to his perfect physique.</p><br/><p>Even the experienced older actors admired the young man's figure.</p><br/><p>\"I was just like him when I was young,\" Jiao Huang told the others. \"It was the poor living conditions that caused me to get thinner.\"</p><br/><p>\"So was I!\" Chao Cuo nodded in agreement. \"He looks like a younger version of me.\"</p><br/><p>Cong Nianwei had arrived just in time for the beautiful scene. Qin Guan greeted Dou Ying and walked past him. Water drops were running down his chest under the sunshine, and his pants had already gotten plastered to his legs. The scene almost reminded one of an idol drama.</p><br/><p>Fortunately, after focusing on his body, Hu Mei moved the camera down to avoid an essential part of his body.</p><br/>\n</div>"}