{"title": "Chapter 805: No Label", "id": 805, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-805-no-label", "volume_title": "Volume 9", "body": "<h1>Chapter 805: No Label</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 805: No Label</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The chaos outside didn't affect the ceremony. The PR agency was good at crowd control.</p><br/><p>Qin Guan was wearing a formal suit from the latest Armani Haute Couture fall collection. The suit was gray-blue, and the tie was trimmed properly. He looked like a businessman in that outfit.</p><br/><p>This was the first time people would discover his identity as a businessman. Everyone held their breath as they tried to estimate his fortune.</p><br/><p>His modelling and acting income aside, his earnings from his firms alone had awarded him a spot in the business circle.</p><br/><p>Besides, Qin Guan was not a graduate of a normal art school, but an elite school, both domestically and internationally. The schoolmates standing behind him reminded people of the subtle differences between him and other guys working in the entertainment circle.</p><br/><p>Qin Guan had friends in politics, business and trade. They were all young and active, with a bright future ahead of them.</p><br/><p>They could be the award-winning actor's solid foundation. Qin Guan was a typical man after all.</p><br/><p>Miss Etiquette suddenly walked up to him with a tray covered in red velvet. The golden scissors seemed to have been made especially for the ceremony as they shone under the lights.</p><br/><p>The peony-like satin matched them perfectly, but everything looked inferior compared to Qin Guan's slender hands. His nails were trimmed and he was sparkling like a star. Qin Guan picked up the scissors and cut the ribbon. The red satin fell apart like a flower. Then Qin Guan put the elegant scissors back on the tray.</p><br/><p>His action signalled the start of all the ceremonies. On the screen, the ribbons were cut one after the other. Qin Guan pulled the curtain down to reveal the large logo to the audience.</p><br/><p>The store was nothing out of the ordinary. A winding passage led inside, where each small cabinet was open to the public. There were two small plastic mannequins in the display, but everything else was on hangers.</p><br/><p>The designing style of different designers was easy to tell apart.</p><br/><p>The cabinet at the entrance was marketed towards white-collar workers. The prices ranged from 200 to 1,000 yuan, which was acceptable for the average customer.</p><br/><p>If one took a turn, the prices increased. There were formal dresses for parties on display.</p><br/><p>If one walked inside further, they would find clothing catalogues. Fashion insiders would realize right away that this was a customization studio.</p><br/><p>Nowadays, people wanted to dress uniquely. Ready-made clothes bought from stores made it too easy for one to accidentally wear the same outfit as somebody else. One saw too many people dressed the same on the streets.</p><br/><p>Qin Guan's store met everyone's demands. A little money could improve one's style and allow them to avoid the embarrassment of wearing the same clothes with another person.</p><br/><p>The costumers reacted differently when they realized this. The starlets were really glad, as their agencies did not pay for their clothes. They had to buy their own formal outfits for award ceremonies, press conferences and street photo-shoots.</p><br/><p>Plus, they could only wear each outfit once before the cameras. They had lost so many chances to make an appearance in public.</p><br/><p>Qin Guan's store was so considerate, it felt almost like a gospel from Heaven. They could pay a small amount to change each outfit into something else. This would save them a lot of money!</p><br/><p>Besides, those clothes were tailored by famous designers. Some of them had even won national contests, so usually only superstars qualified for their services.</p><br/><p>Thanks to Qin Guan, they wouldn't need to worry about what to wear anymore in the future.</p><br/><p>Meanwhile, spies from other companies found it difficult to label the brand. The brand's formal wear was finer and more elegant than others, but it could not be considered high-end due to its reasonable prices.</p><br/><p>Although the prices of the formal outfits were not that low, they would be a second-to-none choice for the average person that wanted to buy formal clothes.</p><br/>\n</div>"}