{"title": "Chapter 809: A Show With Four Famous Actors", "id": 809, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-809-a-show-with-four-famous-actors", "volume_title": "Volume 9", "body": "<h1>Chapter 809: A Show With Four Famous Actors</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 809: A Show With Four Famous Actors</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"Are you Wu Yanzu?\"</p><br/><p>\"Yes, I am.\"</p><br/><p>\"Can I shake your hand?\"</p><br/><p>\"Huh? Oh, okay.\"</p><br/><p>\"You are so handsome. Cheers!\"</p><br/><p>Wu took his hand back and chuckled to himself. He had misinterpreted Qin Guan's last words. He likes my acting. He must consider me a rival.</p><br/><p>Actually, Qin Guan had just made a joke. He was really happy that he had outshined the famous man.</p><br/><p>Thanks to his praise, everyone concentrated on Wu.</p><br/><p>\"Qin Guan is right. Take a good look at him. Wu is a really handsome guy.\"</p><br/><p>\"Senior Qin didn't lie.\"</p><br/><p>\"I think he is just an ordinary actor. I'm just as good as he is.\"</p><br/><p>When Wu returned to Hong Kong after the ceremony, he saw his job offers increase thanks to the power of Qin Guan's words.</p><br/><p>Meanwhile, he was among the group of nominees competing for the Best Supporting Actor Award. Zhang Xueyou, Liu Dehua, Qin Guan and Liang Chaowei were sitting in the middle of the third row.</p><br/><p>They had all been old rivals for many years, with the exception of Qin Guan. The four actors attracted almost all the cameras, so the audience at home could see their every move.</p><br/><p>The hostess was Lin Zhiling, who was a sweet, gentle lady. The host, whose name was Cai Kangyong, couldn't avoid the cameras, even if he dressed like a moving bulb. Everyone fixed their eyes on the sparkling hosts.</p><br/><p>Zhang Xueyou suddenly approached Qin Guan.</p><br/><p>\"Qin Guan?\"</p><br/><p>\"Yes? Brother Zhang?\"</p><br/><p>\"Why have you been staying in the mainland lately? You should accept some work with Hong Kong directors.\"</p><br/><p>\"I was ordered to do so by the SARFT. They want me to contribute to mainstream films.\"</p><br/><p>\"Wow! That's so disappointing! There are no good scripts these days...\"</p><br/><p>Why did you ask me to find a script in Hong Kong then?</p><br/><p>Zhang Xueyou's nonsense inspired the men sitting on either side of Qin Guan. Liu Dehua felt that he had to join the conversation, so he tried to find a new topic.</p><br/><p>\"Qin Guan?\"</p><br/><p>\"Yes?\"</p><br/><p>\"It's already been two years since we cooperated. How fast time flies!\"</p><br/><p>\"Yes.\"</p><br/><p>\"If you find a good script, don't hesitate to call me.\"</p><br/><p>\"I will.\" Liu had signed a contract with Huayi after all. He was in Qin Guan's camp in a sense.</p><br/><p>As Liu succeeded in joining the conversation, the cameras turned to Liang Chaowei. The photographers wanted to watch the world burn, so they zoomed in on Liang to capture the expression on his face clearly.</p><br/><p>Hong Kong was a tiny area, so the competition for resources, connections, scripts and producers was much fiercer than that on the vast mainland.</p><br/><p>Liu Dehua and Liang Chaowei had a similar value, influence and box office appeal. It was impossible for them to call a truce, although the media was pretending that everything was going well between them.</p><br/><p>They had cooperated on the movie franchise \"Infernal Affairs\" three times, and the first two movies had made the final round of the Golden Horse Festival the two previous years. Liu and Liang were both the protagonists of the franchise, but Liu had lost to Liang twice!</p><br/><p>This year, Liu had come to the festival with the third movie of the franchise. If he was defeated by Liang again, his fame and dignity would take a big hit.</p><br/><p>Just the thought made Liu be polite to Qin Guan. He would be happy if Qin Guan won the award. He just hoped that the other actor lost.</p><br/><p>Everyone was looking at them with relish. Qin Guan glanced at Liang guiltily. Do you feel isolated? I'm innocent, Mr. Liang.</p><br/><p>The two men communicated with their eyes. The host's excited voice suddenly brought them back to reality.</p><br/><p>\"The nominees for the Best Actor Award of 2005 are Liang Chaowei, Liu Dehua, Zhang Xueyou and Qin Guan. It's really a galaxy of talent!\"</p><br/><p>\"Let's open the envelope quickly to find out who the lucky guy is!\"</p><br/><p>Cai opened the envelope and the master of the ceremony walked on the stage with the award. The audience suddenly realized that there would be two winners that year!</p><br/>\n</div>"}