{"title": "Chapter 800: Not Really", "id": 800, "volume": 8, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-800-not-really", "volume_title": "Volume 8", "body": "<h1>Chapter 800: Not Really</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 800: Not Really</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>He was not the only person who was sad. Some people showed their sadness on their faces, while others just kept it a secret.</p><br/><p>On the other side of the ocean it was still morning. Smoke was rising from a white coffee cup in a messy room. A woman was looking stupefied at her computer screen. When she came back to her senses, she slammed her laptop shut, put on a pair of black high heels, and locked her case with Qin Guan's memorabilia.</p><br/><p>Paris Hilton was enjoying some rare leisure time in her garden. Her puppies were running around, seemingly aware of her bad mood, in an effort to cheer up their master by moving their tails happily.</p><br/><p>It was another night of gay life and debauchery in Japan. A group of strong men were kneeling on a tatami, waiting for the order to attack. Meanwhile, their leader was typing on her phone nervously.</p><br/><p>Men felt sorrow and joy; they parted and met again. The moon took turns being bright and dim.</p><br/><p>I'll find someone else to mend my broken heart.</p><br/><p>Qin Guan made the headlines of all the major media. The girl who had posted the initial photos online was confused by the situation. Her careless move had caused a striking gossip whirlwind in the entertainment circle.</p><br/><p>Although everybody was happy with the ending, the girl dared not reveal to her friends that she had caused this, afraid that she had destroyed the dreams of several women.</p><br/><p>Qin Guan's secret girlfriend was sad news for some girls. Those girls avoided talking about her so they could cheat themselves into believing that she was not real. This had to be a strategy Qin Guan was using to deal with his crazy fans.</p><br/><p>Their hopeful theory was proven wrong though. Qin Guan had proposed to her through that subtle message! Soon, a wedding ceremony would take place. There was not much space for new awards on that shelf! The whole thing felt like a bomb countdown.</p><br/><p>The girl dared not tell anybody else that she had been the one to light the fuse, because she did not want to suffer the consequences.</p><br/><p>Meanwhile, Qin Guan was enjoying some leisure time. When he read the newspapers, he was able to relax once again.</p><br/><p>Every member of the crew was curious about the gossip. Everyone wanted to speak to him, but stopped on second thought. I won't say anything. Curiosity killed the cat!</p><br/><p>All the feedback was polite and positive. Qin Guan wasn't worried. Now that his fans had accepted the situation, everyone else didn't matter.</p><br/><p>He was right. When Cong Nianwei returned to her team, no one paid any special attention to her. Only a few younger members looked at her face carefully and tried to get a confirmation from her.</p><br/><p>Eventually, everyone just scattered in all directions and got to work. They were too busy to focus on the entertainment circle.</p><br/><p>Thus, Cong Nianwei got through that tough time smoothly.</p><br/><p>Qin Guan felt strange about the person standing in front of him. In his opinion, that guy should have been the last person to worry about his relationship.</p><br/><p>Du Chun didn't know how to approach the topic. Qin Guan and Cong Nianwei had stayed together on the set, as if no one else had been present. He had disagreed completely with their actions even before the news had broken out.</p><br/><p>During the break, the two young men chatted casually in their costumes and makeup.</p><br/><p>\"You've come here highly recommended, Qin Guan. I'm Du Chun.\"</p><br/><p>\"Hello, nice to meet you.\"</p><br/><p>\"I saw the news this morning. Actually, we've met each other not long ago. Maybe I'm a little bit brusque.\"</p><br/><p>So? Qin Guan raised an eyebrow in interest.</p><br/><p>\"We were young actors during the same period. It's the best time for us to attract fans now. I know you are a capable actor, but you just returned to China. I think you should build a solid foundation with your fans. Isn't it too early for you to reveal your girlfriend to the public? If anything changes, it will be really embarrassing. It could actually harm your popularity.\"</p><br/><p>Du had been thinking about this for a long time. In his opinion, Qin Guan was squandering his popularity. It was not a good choice for a handsome man to get married early.</p><br/><p>Spitting the words out finally felt great. This way, he got rid of all the pressure and negative impact Qin Guan had inflicted on him.</p><br/>\n</div>"}