{"title": "Chapter 803: An Independent Brand", "id": 803, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-803-an-independent-brand", "volume_title": "Volume 9", "body": "<h1>Chapter 803: An Independent Brand</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 803: An Independent Brand</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>When Wang Liying hastened to pull Qin Guan away, she saw that the strict actor had suffered a sunstroke.</p><br/><p>Unfortunately, Chen didn't get a chance to talk to Qin Guan that night. The TV show was scheduled to air on CCTV before the next Spring Festival, so the director had to rush to make the deadline. Every day, Qin Guan got up, rushed to the set and worked until nightfall. He was really glad when his part was over.</p><br/><p>Tempted by a beautiful woman, his character got involved in the assassination of the emperor. The timid man finally revealed his true colors and his fear of being a madman. The confused emperor paid a personal visit to his home.</p><br/><p>Qin Guan was wearing a blue robe. His messy gray hair was hanging down loosely on his shoulders as he stood on the roof holding a kite and murmuring to himself, \"Fly, Zhir! Fly with the kite! Beat the Huns!\"</p><br/><p>Even though he was reaching the end of his life, he could still read the emperor's mind. During his last sane moments, he gave his vast wealth to the emperor to aid him in the battle in Northern China. The truth about his insanity was not important to Emperor Han Wu. The old, scared man was no longer an obstacle on his way.</p><br/><p>From then on, he managed to unite his court. His great plan was now in motion.</p><br/><p>Everyone sighed in sympathy for the man on the roof. They felt sad to see a child grow up.</p><br/><p>He was a complicated man, but he was neither good nor bad.</p><br/><p>Qin Guan was a versatile actor. After more than two years, he would finally leave the crew.</p><br/><p>Life was like a TV drama. People hurried to and fro. Some came and some left. Some actors were there for the entire show, while others only had a short part. The protagonist of the show could have been only a minor character in another drama. That was the most fantastic thing about TV.</p><br/><p>The crew was really busy preparing for their trip to the Mongolian grassland, so they had no time to pay attention to the departing actor. Qin Guan left the crew alone in disappointment. Then he smiled at the cold dessert Wang Liying handed him.</p><br/><p>It was Chilled Mango Sago Cream with Pomelo in a small plastic box, an authentic Hong Kong dessert that was very rare at the time. Thanks to the people gathering in Hengdian from all directions, the film base had become an international snack exhibition.</p><br/><p>That particular dessert had a standard recipe, so it tasted practically the same, no matter where one bought it. The only difference lay in the amount of fruit inside it.</p><br/><p>For Qin Guan, some mango and grapefruit were enough. The sago was cooked well, so one could just swallow the round, smooth grains without chewing them. The thick coconut milk, regular milk and sugar made the sauce perfect.</p><br/><p>Before freezing it, one had to add the smashed grapefruit and mango. After half an hour, one could take it out and have a taste. That dessert was the best cold refreshment for a summer day, as it was suitable for people of all ages.</p><br/><p>The wonderful snack granted Qin Guan a lot of energy, so he managed to get home in one piece despite the scorching summer heat.</p><br/><p>When he got there, he found a warm message at the door. He opened the fridge and saw that it was filled with food Cong Nianwei had cooked. Qin Guan immediately felt refreshed. She hadn't forgotten about him, even though she was really busy.</p><br/><p>Only people who did not miss someone forgot about them and used the pressure they were under as an excuse. Qin Guan was really satisfied. After kissing his girlfriend goodbye, he went to the firm to take care of some work before he travelled to Taiwan.</p><br/><p>He had finally picked a name for his brand. He had originally wanted to call it \"Qin &amp; Cong\", but his team had rejected that idea unanimously. Instead, they gave it the catchy name \"LESS/MORE\".</p><br/><p>They were actually planning on turning it into a foreign brand, or just creating a so-called foreign brand, as Chinese people always liked to pursue international success. This way, a good sales volume would be a given.</p><br/><p>Qin Guan voted down that proposal in good faith.</p><br/><p>Those days, people could get more information than ever before. Everyone was familiar with brands, both domestic and overseas ones, so internet users could reveal a brand's past to the public. That was why Qin Guan would rather create an original brand.</p><br/><p>In the end, they decided to call it \"LESS/MORE\".</p><br/>\n</div>"}