{"title": "Chapter 818: The Most Thoughtful Aid", "id": 818, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-818-the-most-thoughtful-aid", "volume_title": "Volume 9", "body": "<h1>Chapter 818: The Most Thoughtful Aid</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 818: The Most Thoughtful Aid</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>An embassy employee helped the crew settle in the hall. Then he greeted them and began to ask questions.</p><br/><p>\"Hello. May I know who is seeking help? Please fill in the form at the reception. We'll be on standby the whole day, in case of an emergency.\"</p><br/><p>A girl in a blue uniform began to give out paper cups.</p><br/><p>\"Would you like some water? Has anyone been injured? Would you like something to eat?\"</p><br/><p>As he heard the last question, Qin Guan couldn't help but lift his hands up. \"Me! I need food!\" Everyone fixed their eyes on him. He felt like a firefly in the dark.</p><br/><p>\"Wow! Is that Qin Guan?\"</p><br/><p>\"Yes! His assistant called us! The receptionist is a fan of his, so... You know...\"</p><br/><p>\"Wait, who is that guy? Oh, my!\"</p><br/><p>\"It's Jean Reno! What are they doing? Are they shooting a new film?\"</p><br/><p>\"I love Leon so much. I'll ask him for an autograph later. I could show it off to my French colleagues!\"</p><br/><p>The atmosphere in the hall became animated as the staff began to order food for them.</p><br/><p>A Cantonese restaurant near the embassy was about to close because of the riots, but the call from the Chinese embassy changed the cook's mind. It was a big order during a good night for business. Dozens of people were waiting for food.</p><br/><p>The boss was confident about the embassy's security, so he accepted the order happily.</p><br/><p>According to the Cantonese cuisine, the ideal supper was rice in a clay pot. This was a rare dish from South China that was usually served in large portions. Even in France, the taste remained the same. Dozens of clay pots were resting in a row on the fire. In 20 minutes, the rice was half-cooked. The cook began to pour juice on it and add Chinese sausages, roasted pork and char siu on the sticky grains.</p><br/><p>Then he covered them and cooked them on the fire.</p><br/><p>Not long after, the rice was soaked in sweet juices and seasoning and turned crisp and yellow. Then the cook added some boiled vegetable leaves on the pork.</p><br/><p>A heavy basket was sent to the embassy through a secret channel in the backyard of the restaurant. Actually, it was just a rope with a few hooks.</p><br/><p>\"We'll pay you tomorrow as usual. It's too late tonight.\"</p><br/><p>\"No problem. Thank you for your patronage. The receipt is at the bottom.\"</p><br/><p>\"Okay! Watch the door. You better not go home tonight.\"</p><br/><p>\"Okay!\"</p><br/><p>The embassy staff pulled the basket up through the window. This was the first time the crew would experience the charm of Chinese cuisine.</p><br/><p>The foreigners were confused as they held the clay pots in their hands. The embassy is treating us to soup?</p><br/><p>Qin Guan opened the lid and the scent of meat and rice filled the hall. The white rice, red sausages, pork and vegetables looked very appetizing. Jean's stomach growled at the smell. Everyone was hungry after what they had been through.</p><br/><p>An embassy employee handed out spoons, trying her best to suppress her laughter. Everyone fixed their eyes on Qin Guan, waiting to see what he would do.</p><br/><p>Qin Guan poured a small packet of sauce on the edge of the pot. They were all waiting to see how the sauce was used. Should we dip the meat into it or mix it with the rice? Qin Guan gave them a different answer.</p><br/><p>He just soaked all the ingredients in the sauce. As he stuffed a spoonful into his mouth, no one could remain calm anymore.</p><br/>\n</div>"}