{"title": "Chapter 814: The Zurich Bank", "id": 814, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-814-the-zurich-bank", "volume_title": "Volume 9", "body": "<h1>Chapter 814: The Zurich Bank</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 814: The Zurich Bank</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>When the scene was finished, everyone let out a long sigh of relief. Qin Guan hung out in the hall, totally absorbed into the art palace. Even the beautiful French actress looked inferior compared to the masterpieces around them.</p><br/><p>Most of them were high-quality imitations of the originals, but one day every week, the museum would reveal the original to the public.</p><br/><p>Walking in the significant hall in the quiet night was a great shock to the visitors. Qin Guan secretly gestured for his assistant to take pictures.</p><br/><p>His feelings were similar to those of a starlet wearing Armani for the first time. Qin Guan felt like he was swimming in the long river of art history as he caressed the frames with pride under Wang's annoyed gaze.</p><br/><p>Unfortunately, beautiful moments were always short. The next scene would begin soon. The French president had only granted them a limited amount of time. The museum would open to the public the next morning as usual, so they had to finish filming as soon as possible.</p><br/><p>After a short break, Qin Guan was pulled back to the set again. The poor guy who played the corpse lay down on the bed.</p><br/><p>As an expert, Qin Guan found the evidence suspicious.</p><br/><p>\"No, it's not the Fibonacci sequence. It's just some kind of code that uses it wrong. If my brain is not fooling me, it must be a logogriph.\"</p><br/><p>He reached this conclusion by using his eyes instead of a pen or any other tools. The actress looked at him in surprise. \"Do you have high-definition eyes?\"</p><br/><p>Qin Guan had to act humble. \"They are not that good, no. But I can memorize most things.\"</p><br/><p>He did some mental calculations to figure out the final answer and then wrote it down in his notebook.</p><br/><p>\"Leonardo Da Vinci, Mona Lisa.\" After getting the first code sequence, they ran to the \"Mona Lisa\" room, where they discovered the second code sequence, as well as the director's blood.</p><br/><p>By then, Jean had realized he had been fooled and rushed back to the museum. Time was pressing. Qin Guan had to memorize the code with his eyes and brain.</p><br/><p>The lonely sight of his back in the dark occupied every frame. This required great expressive force and control from the actor. That was why people considered horror films the ultimate test for one's acting skills. Just screaming and using exaggerated body language couldn't convince the audience.</p><br/><p>Plus, Qin Guan was portraying a calm scholar, which set even higher standards for him.</p><br/><p>Qin Guan and the director's granddaughter found a mysterious cross at the back of another Da Vinci painting and tried to escape from Jean like wanted criminals.</p><br/><p>When their job that night came to an end, everyone breathed out in relief. The real director of the Louvre had been watching them work with a distrustful expression in his eyes.</p><br/><p>He considered every member of the crew a guest of his. That unreliable president! This is a big insult to art. I'll write a letter of complaint to him every day till the crew f*cks off!</p><br/><p>Howard ran away quickly with the camera. He dared not disclose the nature of the next scenes to the director, for fear that he would suffer a heart attack.</p><br/><p>The following night, they would go to the famous red-light district near the Braun Forest Park, which was a man's heaven. French girls in revealing clothes were idling all around that area. This was a different side of the fashion capital.</p><br/><p>Cars were driving by at a low speed. In that area, which was far beyond the reach of the police, Qin Guan would have plenty of time to study the cross.</p><br/><p>The cross was actually a key of the Zurich Bank. Its form and laser holes implied that extraordinary things were hiding in the place it would unlock. That bank had the greatest security in the world and its storage method had a long history. Nobles during ancient times used to hide their fortune there, like a dragon hiding treasure in its cave.</p><br/><p>The key was passed down from generation to generation, along with the bank's logo. The bank had been upgraded, and so had the key, but the family crest on it remained the same. It was a symbol of old money. That, in combination with the code, achieved a double level of security.</p><br/><p>The bank was loyal to its clients, even if they were criminals. The ancient confidentiality agreements and special arrangements made by the noble families were followed strictly by the managers.</p><br/>\n</div>"}