{"title": "Chapter 816: Emergency", "id": 816, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-816-emergency", "volume_title": "Volume 9", "body": "<h1>Chapter 816: Emergency</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 816: Emergency</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>This was a soul-stirring, outrageous suggestion. The crew was really brave to keep filming. Actually, this would be a small-scale confrontation and mutual compromise between modern society and religious groups.</p><br/><p>In today's rapidly-developing society, it was impossible to huckster religious belief like back in medieval times. This was due to the constant awareness of human self and the freedom of belief that every individual enjoyed.</p><br/><p>Still, Columbia Pictures had invested in the film, Howard had chosen to direct it, and Qin Guan had accepted the leading role without hesitation.</p><br/><p>China was not the religion's origin after all. Christians had sent many missionaries to China, but they had still failed to convert the Chinese.</p><br/><p>Actually, these lines were not Qin Guan's, but Ian McKellen's. Lovers of American films would be familiar with the name, as he was the actor who had portrayed Gandalf in \"The Lord of the Rings\" and Magneto in \"X-Men\".</p><br/><p>He was an outstanding experienced actor, who had also sacrificed a lot for the film. He had been under even more pressure than Qin Guan.</p><br/><p>The next scene would be the climax of the film. It was too late for the killer and the bishop of the Opus Dei to realize they had been cheated. The principal conspirator was the lame old man who had taught Qin Guan. He was a crazy scholar obsessed with Jesus' mortality, who aimed to find out the secret of the Holy Grail and pull Jesus off the altar.</p><br/><p>Thus, he had hijacked Qin Guan and the heroine at the Templar Church in London to reveal the secret before the entire world.</p><br/><p>In the end, their 100,000-pound budget had been enough. The bustling church had been cleared during the daytime, and all the equipment had been moved to the halls not open to the public.</p><br/><p>Qin Guan was standing opposite Ian. The clever villain was aiming a gun at Qin Guan, but the scholar was refusing to cooperate with him.</p><br/><p>\"On your knees!\" The low voice of the mighty old man was filled with power.</p><br/><p>Bang!</p><br/><p>Qin Guan did as he was told without hesitation. The heroine was about to join him, but Ian stopped her.</p><br/><p>\"You don't need to. You are the key. Open the key-stone and I'll let you go!\"</p><br/><p>Before his calm, fanatical voice could fade away, the camera turned to Qin Guan. A gun was resting on his head, His life was literally in a madman's hands.</p><br/><p>\"Open it, or he will die.\" It was a crazy, unreasonable threat.</p><br/><p>Suddenly, Qin Guan stood up and grabbed the tube from the heroine's hands. \"As you wish. I'll do it.\"</p><br/><p>There was a stunned expression in Ian's eyes as Qin Guan used all his strength to destroy the sophisticated tube that held the secret map. He wanted to put an end to this silly war. Once the tube was destroyed, the origin of the conflict would vanish.</p><br/><p>Clang!</p><br/><p>The tube fell to the ground. Qin Guan looked at it calmly. No one could guess what he was thinking. He was in the dark, the camera rising as it followed his legs. He looked determined.</p><br/><p>\"Cut!\"</p><br/><p>Suddenly, Jean Reno broke in and put an end to the most tense scene of the entire film. Everyone relaxed. Even though the film was not completed yet, Qin Guan could foresee its bright future.</p><br/><p>Despite all the pressure the crew had been under, the film reached its end at the entrance of the Louvre.</p><br/><p>The crew, who had travelled to many major European cities for the film, celebrated the end of the project. They could have a good night's sleep that night. No more working overnight at strange locations.</p><br/><p>This pleasant time did not last long though. As they began to talk about the celebrating banquet, there was suddenly an emergency. A few policemen drove by slowly and sped down to warn them about the danger.</p><br/><p>\"Return to your hotel! Quick! Stay in your rooms and close all the doors and windows. No more filming! Leave! Now!\"</p><br/><p>What had happened?</p><br/><p>When they saw the guards of the Louvre return to the museum and close the steel gate, they knew that something important must have happened. It was better to obey the rules considering that they were in a foreign country.</p><br/><p>Qin Guan had experienced similar situations in America, so he remained calm during the emergency. The crew drove off towards the hotel fast, only to realize that the road ahead was on fire.</p><br/>\n</div>"}