{"title": "Chapter 813: Jean Reno", "id": 813, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-813-jean-reno", "volume_title": "Volume 9", "body": "<h1>Chapter 813: Jean Reno</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 813: Jean Reno</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>At first, Qin Guan was just enjoying his snacks. As he looked at the accumulating scars on the actor's back though, he started feeling uneasy. He believed it was necessary for him to study any relative knowledge.</p><br/><p>Qin Guan threw his snacks away and returned to the hotel, where he asked help from a Columbia professor. Prof. Beak, who was glad to receive his request, sent a large amount of material to Qin Guan through email.</p><br/><p>He told Qin Guan that the most valuable knowledge was gathered in churches and libraries. A few secret doctrines were even passed down from mouth to mouth. Some basic knowledge would be enough for Qin Guan's role though.</p><br/><p>The honest young man began studying from the very beginning. Actually, if he read everything, he could possibly graduate from a theological school.</p><br/><p>He would have the gift of his extraordinary memory to thank for that. The next day, he appeared in the Louvre with red eyes. He had already gotten a general idea about the basic knowledge of the Catholic Church.</p><br/><p>That explained why his schedule was so tight. The director had omitted most of the dark parts of the church's history. If they were confronted by any radical believers, they would risk losing their lives.</p><br/><p>Thus, Qin Guan began to take his job more seriously. In the next scene, he would be cooperating with Jean Reno, a representative of the European acting school who had starred in \"Leon The Professional\".</p><br/><p>The experienced actor was more than 30 years older than Qin Guan. He was also one of his idols, so Qin Guan decided to try his best to impress him.</p><br/><p>The semiologist finally met the detective before the pyramid of the Louvre.</p><br/><p>It was a beautiful night in Paris. The golden pyramid was sparkling in the dark as Qin Guan walked in the museum slowly, surrounded by cameras.</p><br/><p>The solemn, vast hall was one of the most artistic places in the world.</p><br/><p>The sound of their steps echoed inside and their shadows expanded in the moonlight. The atmosphere was already depressing, but Jean's questions made it even stranger.</p><br/><p>He doubted that Qin Guan was the killer, but he still asked him some provoking questions.</p><br/><p>\"How come you are so familiar with the security measures of the museum?\"</p><br/><p>\"How do you know where the director died?\"</p><br/><p>Actually, the smart semiologist had guessed all this information by looking at a photo of the place.</p><br/><p>Only when he saw the corpse did Qin Guan understand the detective's words. Before dying, the director had drawn a circle with his own blood, which he had taken from his bleeding stomach. Then he had taken off his clothes and lay down in the circle to complete the symbol.</p><br/><p>What kind of symbol was it? This symbol had cost his life. The weird semiologist was feeling very suspicious.</p><br/><p>Long shots made the audience engage in the story. This was an advantage for actors shooting suspense films, yet the director zoomed in on Qin Guan's face repeatedly. His features expanded infinitely like pupils dilating. Qin Guan passed the test without even being aware of it.</p><br/><p>The director didn't tell anyone, but he decided to keep the outstanding shots. The details of the actor's face were both mysterious and beautiful. This was the beauty of horror.</p><br/><p>Qin Guan and Jean finished their lines and stared at each other for a long time in front of the corpse. The camera was still rolling. They were just communicating through their eyes.</p><br/><p>Jean: What is everyone doing?</p><br/><p>Qin Guan: No idea.</p><br/><p>Jean: Ask the director.</p><br/><p>Qin Guan: Why should I do it? I'm too afraid.</p><br/><p>Jean: You are the younger one.</p><br/><p>Qin Guan: Okay.</p><br/><p>The corpse nearly burst into tears. Are you done?</p><br/><p>\"Cut! Perfect!\"</p><br/><p>The first confrontation between Qin Guan and Jean Reno was finished successfully. The prime suspect escaped with the help of the heroine.</p><br/>\n</div>"}