{"title": "Chapter 833: The Crew", "id": 833, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-833-the-crew", "volume_title": "Volume 9", "body": "<h1>Chapter 833: The Crew</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 833: The Crew</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan didn't even need to participate in the promotional activities. All he had to do was attend the award ceremony and share his luck with everyone else. Sister Xue, who was a cunning woman, promised that he would.</p><br/><p>Qin Guan, who had no idea about this, had just reached Chongqing with Ning Hao. They had originally had three alternatives for a shooting location, but as soon as they arrived in Chongqing, they decided it was the exact place they wanted.</p><br/><p>The booming metropolis had been experiencing rapid growth and uncertainty. It was just like the film, whose limitless foreshadowing and coincidences would intersect in a three-dimensional space to form clues that twisted and winded into a story.</p><br/><p>Qin Guan had hired a photographer from China Film Group, and the actors involved were all tough. Even Xu Zheng, who portrayed the villain, was an elegant man.</p><br/><p>They made a group booking at a small hotel, all meals included. Qin Guan's investment covered the cost, so the money-grubber was eager to finish the film as soon as possible.</p><br/><p>The crew did its best while they were in the city.</p><br/><p>They shot three different scenes in an alley that extended in all directions. Director Ning stood in the dead zone as three actors and three cameramen worked separately.</p><br/><p>After filming each scene, Ning Hao would watch the playback. There were no big problems, so they just kept filming.</p><br/><p>The alley was crowded, and all the actors looked like heroes.</p><br/><p>Standing at the entrance of the alley, Huang Bo and Liu Hua portrayed two movers that were actually thieves. Wang Xun, who was the secretary of a real estate company, was standing in the middle. At the end of the alley was Guo Tao, who portrayed the director of an arts &amp; crafts factory.</p><br/><p>The three groups of people, who were seemingly unconnected to each other, had been led to the same alley by destiny.</p><br/><p>The funny, fast-paced action confused the figurants, who couldn't understand the plot.</p><br/><p>Due to the shooting location, the director had asked all the actors to talk with a local accent. It was a funny way of expressing oneself. This was easy for Liu Hua and Guo Tao, who were professional actors that had graduated from the Central Drama Academy in Beijing.</p><br/><p>Qin Guan though, who was portraying a rich businessman from Hong Kong, had to look like a professional, proud, confident thief. Thus, the King made his presence known in his luxurious hotel.</p><br/><p>The crew had rented a fitting room at a hotel. Qin Guan was wearing a business suit and a shirt, which was his usual style. The only difference was the thick golden chain around his neck and the shining diamond rings on his fingers.</p><br/><p>Wang Xun, who was Xu Zheng's sidekick, had hired the best, most professional thief in the circle to make the arts &amp; crafts factory go bankrupt.</p><br/><p>The cameraman followed Qin Guan's movements.</p><br/><p>Wang Xun, who was pretending to be thinking deeply, gazed at Qin Guan. \"Let's just cut to the chase. How much?\"</p><br/><p>Qin Guan took the cigarette from Wang's mouth and threw it into a glass.</p><br/><p>\"100,000 dollars.\"</p><br/><p>\"Do you need a room?\"</p><br/><p>\"All I need is a car.\"</p><br/><p>His diamond ear studs were sparkling in the lens. His face looked cool and solemn. He thought very highly of his profession.</p><br/><p>\"Cut!\"</p><br/><p>The frame lingered on his face for two seconds. Qin Guan's first scene in the film was over. An average actor could film a 30-second scene in one take. People didn't think too much of it, yet they made fun of Qin Guan's nice costume.</p><br/><p>Huang Bo and Liu Hua were dressed like rural laborers, while Guo Tao looked like a security guard. Qin Guan looked like a god among mortals.</p><br/><p>\"Wow, Da Qin. I like your sparkling ear studs. Do they hurt?\"</p><br/><p>\"Tiffany made clips especially for me. I didn't have to pierce my ears.\"</p><br/><p>\"Your suit must have cost a lot. This fabric has been very popular this year.\"</p><br/><p>\"Armani is a sponsor of the film, so he gave it to me for free.\"</p><br/><p>Everyone gathered around Qin Guan and started hitting him. After venting their anger, they turned to Director Ning, who had been hiding in a corner.</p><br/><p>\"Director, we are finished. When shall we resume filming?\"</p><br/><p>\"Immediately! Attention, please! The local thieves will be competing against an international top thief!\"</p><br/><p>It was a battle among professionals. The mighty dragon was no match for the native serpents though. As soon as Qin Guan reached Chongqing, his luggage was stolen by three local thieves.</p><br/>\n</div>"}