{"title": "Chapter 834: A Renowned Thief Vs. A Nobody", "id": 834, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-834-a-renowned-thief-vs-a-nobody", "volume_title": "Volume 9", "body": "<h1>Chapter 834: A Renowned Thief Vs. A Nobody</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 834: A Renowned Thief Vs. A Nobody</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The arrogant man deserved that. He had walked out of the exit as if he was on a runway. His nice suit, silver suitcase and beautiful wind coat shocked the audience.</p><br/><p>What a handsome rich guy!</p><br/><p>However, a beautiful beginning did not always lead to a happy ending. Qin Guan took his sunglasses off and waved at a cab with a faint smile.</p><br/><p>Meanwhile, his Chongqing competitors took action. Huang Bo stood on his tiptoes and covered Qin Guan's eyes.</p><br/><p>\"Guess who I am!\" he shouted with a Qingdao accent. \"You get three guesses!\"</p><br/><p>A dagger slid down Qin Guan's sleeve towards his hand. He was confident about his skills.</p><br/><p>\"You must have mistaken me for someone else,\" Qin Guan answered calmly.</p><br/><p>\"Wrong! Two guesses left!\" Huang Bo grinned from ear to ear behind Qin Guan.</p><br/><p>\"Let me go, sir. Please.\"</p><br/><p>\"Okay, keep your eyes closed.\" Huang Bo ran away as fast as he could.</p><br/><p>Confused, Qin Guan turned around, only to realize that his case and the cab were gone. Nobody was around anymore. The professional thief from Hong Kong had been defeated by his local peers.</p><br/><p>He had lost the first round.</p><br/><p>After the shooting, everyone began discussing the script and laughing.</p><br/><p>Would an internationally renowned thief be defeated in China?</p><br/><p>Are Chinese men really that clever?</p><br/><p>They weren't able to reach an agreement before the next scene.</p><br/><p>The three local thieves discovered the equipment in Qin Guan's case and his reason for coming to Chongqing. He was planning on stealing jewellery worth eight million yuan. The jewellery was guarded by a group of security guards at a temple not far away.</p><br/><p>These security guards were not like museum guards. If they succeeded at their job, they would be able to lead a happy life from then on, so they guarded the jewellery like dogs.</p><br/><p>The second round suddenly began.</p><br/><p>Huang Bo had stolen and put on Qin Guan's night clothes, so Qin Guan had to buy new ones in Chongqing.</p><br/><p>The two thieves showed up at the temple in similar clothing. As a lone ranger, Qin Guan had gone there to scout the security measures, including the power switch.</p><br/><p>Holding a pocket flashlight in his mouth, Qin Guan opened the door of the electricity box to study the lines. He wanted to turn off the alarm. As he was focused on this task, three local men appeared.</p><br/><p>Liu Hua, who was their leader, saw Qin Guan next to the box. He mistook Qin Guan for Huang Bo because of their similar clothes. Angry at the man, he smacked Qin Guan's head.</p><br/><p>\"What are you doing here? You are supposed to be inside the temple!\"</p><br/><p>Ning Hao filmed an extreme close-up of Qin Guan's eyes. The famous thief looked confused as he stared at the angry man in fear.</p><br/><p>The man's next words shocked him. \"You should have stayed inside, idiot! Stop idling around! The police will be here soon!\"</p><br/><p>Then he slapped Qin Guan on the head again. Qin Guan came back to his senses and ran away as fast as he could.</p><br/><p>He had lost the second round.</p><br/><p>\"Cut!\"</p><br/><p>\"Ha ha! That was so funny!\"</p><br/><p>\"I'm so tired. Let's go have a snack!\"</p><br/><p>The cast and crew fled in every direction.</p><br/><p>Huang Bo and the other actors wanted to experience the night life in Chongqing. The residents liked going to night markets, chatting, eating and playing mahjong. Qin Guan turned down the invitation though. He was pulled back to the hotel by Ning Hao. The two of them had to discuss some details concerning the film.</p><br/><p>As the producer of the film, Qin Guan had a lot of work to do. Huang Bo waved a kebab at him from afar, but Qin Guan ignored him.</p><br/><p>He had to pay attention to every penny. Ning Hao had spent all his money halfway through production. From then on, Qin Guan would have to be very careful with the expenses.</p><br/><p>As a result, every scene that saved money cheered him up.</p><br/><p>The next day, everyone gathered around the simple temple, where thieves from all directions would try to steal the jewellery again.</p><br/><p>The prop team was working inside. They would be hanging Qin Guan in the air with a strong wire. As he hung from the ceiling, Qin Guan would try to reach the jewellery case.</p><br/><p>\"Let's shoot the robbery scene. Is everyone ready? Three, two, camera!\"</p><br/><p>Qin Guan descended slowly from the ceiling. As he hung in the air, he turned his body toward the safe. It seemed like a simple movement, but few people knew that the wire was hard to handle due to one's weight, the uncontrollable swaying and the wind. This required skill and strength.</p><br/><p>Fortunately, Qin Guan had experience, so the difficult scene was finished smoothly.</p><br/>\n</div>"}