{"title": "Chapter 848: A Ripe Peach", "id": 848, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-848-a-ripe-peach", "volume_title": "Volume 9", "body": "<h1>Chapter 848: A Ripe Peach</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 848: A Ripe Peach</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The next story had nothing to do with Qin Guan, but the presence of Anthony Perry and Joan Chen explained Jiang Wen's typical narrative technique.</p><br/><p>The next storyline was a mixture of dubious plot development, meaningless scenes, sudden turns and mysterious characters. If one compared Qin Guan's tragedy to a romantic story, the story of Chen Chong, Jiang Wen and Anthony Perry would be a depiction of the twisted humanity of those times.</p><br/><p>Qin Guan felt depressed, so he tried to think about other things in order to relax.</p><br/><p>Has Cong Nianwei received the package I sent her? The deadline for her design is drawing near. If everything goes well, she may be the leader of an independent team that will plan the reconstruction of the small stadium.</p><br/><p>They had gotten used to the quick pace of modern society ever since they had graduated from college. This convenient way of communication allowed two people who were thousands of miles away to connect any time they wanted.</p><br/><p>When will we get married though?</p><br/><p>Someone touched Qin Guan gently, bringing him back to reality.</p><br/><p>It was Yishan Kong, the actress who portrayed Jiang Wen's wife in the film. According to their relation, Qin Guan's character would call her auntie.</p><br/><p>That was unfair, as she and Zhou Yun were nearly the same age.</p><br/><p>Kong, who was a charming woman, was offended that the young man was ignoring her.</p><br/><p>\"What are you thinking about, Qin Guan?\" she asked him. \"I just greeted you.\"</p><br/><p>Qin Guan would never tell anyone that he was missing his girlfriend, so he just pointed to the scene with a serious expression on his face.</p><br/><p>\"I was wondering why the teacher would commit suicide. Logically speaking, a person would be in a good mood if they got rid of all their troubles. A self-important man would be relieved to be free of that burden. He had nothing to worry about anymore. It was unnecessary for him to leave this dirty world.\"</p><br/><p>Kong was impressed by Qin Guan's analysis. What a knowledgeable young man! He will be my partner!</p><br/><p>Qin Guan secretly let out a sigh of relief. I'm good at lying. Why doesn't Cong Nianwei believe me?</p><br/><p>It was because she knew the real Qin Guan!</p><br/><p>The story ended soon. Before the two older actors could get to know the other members of the crew, they had to leave in a hurry. Qin Guan was disappointed, but the next scenes cheered him up.</p><br/><p>Jiang Wen and Kong, who had witnessed the tragedy of his mother's death, were shocked by the duteous young man. He had found them a job and a place to stay in the village, as they had to rely on him in that strange place.</p><br/><p>Kong, who was a fashionable lady from a big city, caused a storm in the small mountain village. She was like a ripe peach trembling on a branch. Her sweet smell stirred something in that village.</p><br/><p>Qin Guan and Kong were talking to each other before the camera. The audience found the sexy woman really attractive. She was dressed decently as she used her crystal fingers to feed some chickens in the yard. She made the simple work of a peasant woman look really fascinating.</p><br/><p>The two of them faced each other from afar. One of them was in the yard, and the other on the path.</p><br/><p>\"She has some questions for you, auntie,\" Qin Guan spoke first.</p><br/><p>Kong looked around in confusion, but nobody was there except Qin Guan.</p><br/><p>Qin Guan smiled and stepped aside. There was a little girl hiding behind him. Qin Guan was the only Mandarin speaker in the village, so he translated for them.</p><br/><p>The girl told him something gently and he translated for Kong.</p><br/><p>\"She said she felt attracted to you the first time you met. She liked your appearance.\"</p><br/><p>Men never understood why a woman's praise was much higher than a man's, but the delight it brought was irreplaceable. Even though the praise was coming from a little girl, Kong smiled wide.</p><br/>\n</div>"}