{"title": "Chapter 845: The Sauce", "id": 845, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-845-the-sauce", "volume_title": "Volume 9", "body": "<h1>Chapter 845: The Sauce</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 845: The Sauce</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"Director, no one would dress like this in the countryside back in the 1970s. My mother looks younger than me! Is there no unspoken rule about this?\"</p><br/><p>Jiang Wen kicked him on the butt. \"There are no unspoken rules in my film. I'm just trying to meet everyone's demands. You should be happy you are dressed decently. Now go away!\"</p><br/><p>Qin Guan left immediately and rushed to his fake home, which was a bamboo house in the village. The prop master set down a ladder in front of him.</p><br/><p>\"Attention, please! We are shooting the first scene! The story of banyan. Three, two, camera!\"</p><br/><p>Everyone stepped back like the tide, leaving Qin Guan to stand in front of the camera in confusion.</p><br/><p>\"Qin Guan, your mother is on the tree again!\" a kind man told the young man, bringing him a ladder.</p><br/><p>Qin Guan put the ladder under his arm and rushed to the entrance of the village. He looked anxious and helpless as he hurried to save his only relative in the world.</p><br/><p>He set the ladder down against the tree and climbed up like a monkey, which seemed to satisfy Jiang Wen.</p><br/><p>\"Okay! Cut! Change costume and let's go again!\"</p><br/><p>What for? Zhou climbed up the tree repeatedly, so Qin Guan had to rescue her again and again. They had to change costumes to show that these were different occasions.</p><br/><p>After several takes, Qin Guan's job that morning was finished. He looked at the large table in the yard and fell into thought.</p><br/><p>The crew must have brought these local dishes.</p><br/><p>When everyone saw the delicious food, they went crazy. Qin Guan squeezed in and took a seat. He was sitting on a small stool next to Jiang Wen. He had no time to moisten his throat with the famous Pu-erh tea. Instead, he just stretched his chopsticks straight towards the main course.</p><br/><p>He had to take advantage of every minute, or the other stronger men would leave nothing for him. The main course was Hani chicken with sauce.</p><br/><p>In other places in China, sauce was only a side for the main dish, but in the Yunnan Province, it could be an independent dish.</p><br/><p>The chicken looked like aluminium foil in the colorful sauce.</p><br/><p>You didn't read wrong. Hani sauce consisted of different materials and colors. It contained white salt, red chilli, green leaves and black fermented beans.</p><br/><p>Plus, the chicken entrails that had been boiled in the original soup were mixed with chicken blood bean curd and eggs. A bowl of sauce alone could feed a grown man. That was why the Hani sauce was so popular.</p><br/><p>Qin Guan was good at seizing food. He took half the chicken into his own bowl and handed it to Wang. Then he began fighting with the others over the sauce. The best part was the yolk and the guts.</p><br/><p>After filling Wang's bowl, Qin Guan buried his face into his own bowl.</p><br/><p>Wang was shocked by the egg. Its soft taste made it even better than the meat!</p><br/><p>Qin Guan made fun of her.</p><br/><p>\"Why are you crying over dinner?\"</p><br/><p>Wang hastened to wipe her tears away in an effort to hide the fact that she had been crying. \"It's really hot!\" Qin Guan pushed the baked bean curd towards her.</p><br/><p>\"Try this to suppress the taste. It's crisp and soft. It's not that spicy.\" He was a real foodie!</p><br/><p>When they had dined and wined to satiety, they began filming the afternoon scenes.</p><br/>\n</div>"}