{"title": "Chapter 856: Spain", "id": 856, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-856-spain", "volume_title": "Volume 9", "body": "<h1>Chapter 856: Spain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 856: Spain</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan was connected to the striking news. All the netizens were shocked. Qin Guan should be at the Spanish film festival. Why did he go to Switzerland? Are you kidding me?</p><br/><p>Reporters started refreshing Qin Guan's website and official blog immediately. The latest news were about his trip to Spain. How did the sports reporters get this scoop? They should just stick to Liu Xiang and leave this to us!</p><br/><p>Their colleagues had just seen Qin Guan waving his flag fiercely in the stadium. The commentator had been really funny, so CCTV 5 just translated his commentary into Chinese.</p><br/><p>\"I just found out that Qin Guan, the Golden Globe winner who has also won awards at Cannes and Berlin, is not just a film star, but also a fan of Liu Xiang. As an authentic Swiss, Qin Guan was the only Chinese guy I could recognize. Thanks to him, I now learned about a Chinese athlete that is no less successful than Qin Guan in his own career.\"</p><br/><p>Liu's international status was suddenly elevated. In half an hour, the news had spread across China and the entire world. By the time Qin Guan got off the plane in Spain, his staff had already posted the pictures online. So had the reporters from the Xinhua News Agency and CCTV 5.</p><br/><p>Saint Sebastian was a small city on the bay. If it wasn't for the famous European film festival, Chinese people would not even know its name. European people loved it though.</p><br/><p>If Spain was considered a heaven for the retired, Saint Sebastian was the heaven of heavens.</p><br/><p>The beach there was not like in other resorts. Playa De La Concha was full of sunshine, warmth and elegant historical buildings. The buildings lined the hills along the beach without interruption. Words couldn't express the beauty of the beach.</p><br/><p>There was also another hidden treasure there. Qin Guan only found out what it was when he met Xu Jinglei at the hotel.</p><br/><p>It was delicious food.</p><br/><p>The city was the gastronomical capital of Spain. The best cooking schools of the country were located there, so it was the cradle of the most renowned cooks in Europe. One could imagine the level of the restaurants there.</p><br/><p>As soon as he heard the good news, Qin Guan rushed out of the hotel, leaving the annoying group photo with Liu Xiang behind him.</p><br/><p>Some people thought that Qin Guan wanted to share Liu Xiang's popularity, but his fans insisted that it would have been impossible for their idol to know the outcome in advance.</p><br/><p>After a heated discussion, both sides fixed their eyes on the fat man in the middle. They hated that lucky guy so much. Fortunately, Xu had returned to America. If looks could kill, the people in China would have murdered him.</p><br/><p>Thanks to the group photo, Qin Guan reached the top of the Jiulang blog, surpassing even Xu Jinglei's blog, which included casual essays and personal stories. Although Wang Liying had texted him the good news, Qin Guan couldn't resist the temptation of food.</p><br/><p>He had found the most famous local food street by asking the hotel staff. It was a wonderful site. There were only various restaurants and bars along the street.</p><br/><p>Even Michelin restaurants were not rare around there. Qin Guan spotted at least three restaurants with Michelin stars within a distance of 30 meters.</p><br/>\n</div>"}