{"title": "Chapter 852: The Lausanne Track Meeting", "id": 852, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-852-the-lausanne-track-meeting", "volume_title": "Volume 9", "body": "<h1>Chapter 852: The Lausanne Track Meeting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 852: The Lausanne Track Meeting</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The plain man found hope in his sincere words and decided to give Qin Guan all the documents. He had made a random kind acquaintance overnight.</p><br/><p>Jiang Wen didn't stop Qin Guan. It was his decision to make. Actually, as a Chinese man, Jiang had no right to hold him back.</p><br/><p>Chen Kang, who was awakened at midnight, read the contract on his computer with tears in his eyes. He felt deeply sorry for his past behavior concerning the small hutong. Lawyers went crazy about cases like this. He would become famous thanks to it.</p><br/><p>I will take it on!</p><br/><p>In the past, Chen Kang had liked to watch the world burn, but now he accepted this case without hesitation. The unpretentious man didn't express his gratitude for Qin Guan's help too dramatically. He just sent him a pheasant.</p><br/><p>As soon as Qin Guan reached the capital, he met Cong Nianwei at the airport. When the crew of \"The Promise\" returned, they started slowly releasing news and photos about the film to attract the audience. The beautiful photos of the Flower Ocean were used for publicity.</p><br/><p>There were warriors fighting for truth everywhere. Before Qin Guan could take any action, some tourists and local reporters showed the public the real Tianchi.</p><br/><p>Cong Nianwei and Qin Guan looked at the photos of the miserable place.</p><br/><p>\"Were you in Yunnan? Did you visit the place in the pictures? Is what they say true?\"</p><br/><p>Qin Guan nodded solemnly. Thanks to the development of the internet, it was impossible to keep any striking news from the public. His calm girlfriend did not get angry often, but architects always evaluated the environment before beginning construction.</p><br/><p>Their everlasting concern was protecting the inherent ecological environment, not designing buildings. The professors at Columbia always tirelessly insisted on the importance of harmony between humans and nature. No professional architect would dare build amid an ecologically precious environment.</p><br/><p>Human greed couldn't be allowed to take over every beautiful landscape in the world.</p><br/><p>Cong Nianwei was really angry about the news. When she heard what Qin Guan had done in Yunnan though, she kissed him.</p><br/><p>\"Well done! We should teach them a lesson. Just leave the matter to the local government. If they do nothing, we will fight for that place.\"</p><br/><p>Qin Guan burst into laughter and gave her a hug.</p><br/><p>Absence made the heart grow fonder, but good things always came to an end. Qin Guan had to fly to Spain for an award ceremony. Then he would return to China as soon as possible to keep an eye on that matter.</p><br/><p>Change always ruined every plan though. Before Qin Guan could even pack for Spain, he received a gift from Xu Xiaoxiao, his friend back in America. After graduation, he had started working in venture investment on Wall Street, but he had taken advantage of his few vacation days to buy tickets for the Lausanne Track Meeting and sent Qin Guan an invitation.</p><br/><p>\"We can fit it in our schedules. We could go to the Track Meeting first and then go experience the fierce Flamenco! What do you think?\"</p><br/><p>Qin Guan felt strange as he typed on the keyboard. \"Is there a special reason you are going on this rare vacation?\"</p><br/><p>\"Are you serious? You are less informed there in China than I am in America. I want to meet Liu Xiang!\"</p><br/><p>Liu Xiang? The athlete right below me on the Forbes list? Xu is a real patriot!</p><br/><p>Qin Guan decided to say yes, so he travelled to Europe earlier to go to Lausanne.</p><br/><p>Lausanne was a city located in the francophone south-west part of Switzerland. The city lay on the north bank of Lake Geneva and overlooked Evian-les-Bains and other beautiful landscapes from a distance. The Olympic Committee thought very highly of that wonderful setting, so its headquarters were stationed there. Lausanne was actually called the Capital of the Olympics.</p><br/>\n</div>"}