{"title": "Chapter 866: Good Fortune In Love", "id": 866, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-866-good-fortune-in-love", "volume_title": "Volume 9", "body": "<h1>Chapter 866: Good Fortune In Love</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 866: Good Fortune In Love</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"Oh!\"</p><br/><p>The lovers chuckled in low voices. The air was filled with ambiguous feelings. Li Man's beautiful eyes were fixed on the man as the couple hugged on the bed with a meaning smile.</p><br/><p>The curtain dropped, hiding the lovers. The onlookers were itching to take a look behind it.</p><br/><p>\"Wow! Wonderful! When I was the same age as Qin Guan, I knew nothing about these things.\"</p><br/><p>The scene ended with Chou's final comment. The two actors took off their costumes and got ready for Gong's arrival. She would be coming to catch the adulterers in the act.</p><br/><p>The film, which had been adapted from the famous play \"Thunder Storm\", wouldn't have a happy ending. It was filled with dirty tricks and danger.</p><br/><p>Thus, the couple's affair would have an awkward ending. The empress broke into the room aggressively with her maids.</p><br/><p>\"Her Majesty has come!\"</p><br/><p>The guards announced her presence a few seconds before she broke in. Then Qin Guan showed everyone his full potential.</p><br/><p>He bounced up from the bed naked, covered his body with a robe and hid Li Man. By the time Gong Lee reached his bed, he was still half-naked and his hair was messy.</p><br/><p>\"What kind of punishment would she get for committing adultery in the palace?\"</p><br/><p>\"Twenty seconds of flogging, a tattoo on the face and expulsion from the palace.\"</p><br/><p>Li Man was trembling as she held her clothes in her embrace.</p><br/><p>It was easy for a man to choose between a tender lotus and an aggressive peony. Qin Guan knelt down for Li Man without hesitation.</p><br/><p>\"It was all my fault. Please spare her.\"</p><br/><p>He is standing up against me for another woman! Gong Lee was hurt by her lover's betrayal. She fixed her eyes on Qin Guan sorrowfully as he tried to avoid her gaze. The huddling man had hurt her feelings deeply.</p><br/><p>In the end, she surrendered before her beloved and tried to explain.</p><br/><p>\"I will spare her, but I won't do it for you. I just want to maintain the stability of the palace before the Double Ninth Festival.\"</p><br/><p>When she saw Qin Guan's doubtful expression, she held her next words back. It was useless to say anything else.</p><br/><p>The crowd left the palace slowly. Rattled by the narrow escape, Li Man collapsed on the floor. The girl was a professional actress. The scene was perfect. It was even better than the grand scene on the terrace.</p><br/><p>Poker-face Chow was also in the crowd, which made the audience feel strange. He looked out of place in that subtly emotional scene. Could his narrow eyes be hiding his feelings? Or had he just gotten used to putting on a poker face whenever he acted?</p><br/><p>Director Zhang tried his best to avoid shooting a close-up of Jay Chou. Could it be some sort of disease?</p><br/><p>Doctor Chow didn't give up on the boy though. When Qin Guan and Gong Lee entered the fitting room, they found him trying to help Chou.</p><br/><p>\"See? Open your eyes when you are excited to show the audience how you feel. Open your eyes!\"</p><br/><p>Chou stared back with effort, but the gap between his eyelids remained almost the same...</p><br/><p>Both the doctor and the patient felt hopeless.</p><br/><p>By then, Qin Guan and Gong Lee had entered the empress' chamber. The empress had made Qin Guan a robe for the family feast of the Double Ninth Festival. It was a royal blue robe embroidered with a large golden chrysanthemum.</p><br/><p>In 2006, the hidden implication of that flower had not been discovered yet. It was only a tradition of the festival. Qin Guan had to suppress his laughter as he recited his lines.</p><br/><p>Gong Lee spread the long robe to show him. \"I made a new robe for you. It's different from the one I made you last year. I added the flower for you...\"</p><br/><p>Qin Guan was left speechless. \"Why?\" he asked, pointing at the golden flower.</p><br/><p>\"For your safety.\"</p><br/><p>\"My safety? What the hell are you planning?\"</p><br/><p>Qin Guan went crazy amid that depressing atmosphere. He destroyed the robe and started fighting with the woman.</p><br/><p>Her black hair was let loose as they moved and fell into Qin Guan's hands. It smelled like the woman's fragrance.</p><br/><p>The two of them ended up on the floor, their bodies close to each other. They exchanged a glance in silence. Then Qin Guan put his hand on her face.</p><br/>\n</div>"}