{"title": "Chapter 874: Style", "id": 874, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-874-style", "volume_title": "Volume 9", "body": "<h1>Chapter 874: Style</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 874: Style</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The businessman had met Qin Guan once in Beverly Hills. He had not only trusted Qin Guan's firm with all his business on the Chinese mainland, but he had also shifted the focus of the whole group to China.</p><br/><p>This was just a trifle for the crown prince of the Chia Tai Group.</p><br/><p>Of course, he would get something in exchange for the favor. The connection between Qin Guan and him would become stronger. Xie had invited Qin Guan to his home in Thailand. His elder relatives and peers were all interested in meeting the young celebrity.</p><br/><p>There was also another underlying reason related to the TV series \"Meteor Garden\", which had been on TV quite a few years ago.</p><br/><p>At the time, the F4 had been completely suppressed by Qin Guan. The Thai princess, who should have fallen in love with Hanazawa Rui, had been fascinated by Qin Guan instead. There were many businessmen in Thailand with good relations with Chinese people, but only Xie Hanren was able to get in touch with Qin Guan.</p><br/><p>Although the princess' title held no real weight, she was still a member of the royal family, so it would be a good idea to introduce Qin Guan to her at a formal event.</p><br/><p>Of course, Qin Guan had no idea what lay ahead. Going on a trip to Thailand in cold weather would be a pleasurable experience. Xie Hanren didn't consider the princess that important. The two of them just set a date.</p><br/><p>Tse and his girlfriend headed to the romantic island after informing Qin Guan about the date of the ceremony. Cong Nianwei's vacation had come to an end, so she returned to Beijing, taking Qin Guan's heart with her.</p><br/><p>Qin Guan flew to Shanghai alone with the crew.</p><br/><p>Shanghai was renowned for its typical Republic of China scenery. Back in that era, it had been the pearl of the Far East, thanks to its cheongsam, beautiful women, scholars and foreigners. It used to be the most exotic city in old China and the most luxurious place of that era.</p><br/><p>One could criticize it for its worship of money, but they couldn't ignore its unique style and elegance.</p><br/><p>The word \"style\" was deeply rooted into the city. The residents there appreciated style even more than money.</p><br/><p>To people from Northern China, they seemed really pretentious, but their extreme shallowness was really cute, so in the end they just left them alone.</p><br/><p>Ang Lee was a generous man. In order to build the Nanjing East Road, the famous street of his dreams, he had to demolish Stephen Chow's previous set. He rebuilt Paramount perfectly based on old photos. Even the trams could travel around. They were actually real!</p><br/><p>The director paid really close attention to detail. Even the boards of the rickshaws shuttling in the background had been copied from relative documents. The secretary's desk in Mr. Yi's office was a real antique from that era.</p><br/><p>Qin Guan felt trapped. Ang Lee was the kind of person that scared him the most. He was an extreme perfectionist!</p><br/><p>He suddenly heard three ladies calling his name. It was Joan Chen, He Saifei and Tang Wei. Their presence made him travel back decades ago, to a tough yet romantic era.</p><br/><p>Joan Chen had cooperated with Qin Guan before, so she introduced the others.</p><br/><p>\"Come here, Xiao Qin. This is He Saifei. You must know her.\"</p><br/><p>\"Hello, Madame He. I like Yang Jiuhong very much. You are such a graceful lady!\"</p><br/><p>No woman could resist such a compliment, no matter how old she was. Plus, the praise was coming from a handsome man! He Saifei felt really happy.</p><br/><p>She was an opera actress, so she greeted Qin Guan in a soft tone. Then Chen suddenly pulled Tang Wei closer.</p><br/><p>\"This is Tang Wei. She will be playing your lover in the film. You are about the same age, but you have more experience in the circle. You should watch over her.\"</p><br/><p>Actually, Tang Wei was two years older than Qin Guan, but she remained an unknown in the circle. If it weren't for Ang Lee's nationwide casting call, she might have wasted the best years of her life and gone back to being an ordinary person, just like other unlucky actresses had. She had been born in 1979 after all, so she was definitely past her prime. A 28-year-old actress without any good films was a failure.</p><br/><p>Tang Wei would grasp at this straw and put up a desperate fight though.</p><br/>\n</div>"}