{"title": "Chapter 882: Hand-Kissing", "id": 882, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-882-hand-kissing", "volume_title": "Volume 9", "body": "<h1>Chapter 882: Hand-Kissing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 882: Hand-Kissing</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Thus, her agent had asked around until he spotted Wang Liying. He was really happy about this opportunity.</p><br/><p>Wang couldn't make a decision like that though. She had to ask Qin Guan's opinion first. Eventually, those two smart, lucky individuals got in touch with Qin Guan himself.</p><br/><p>As soon as they took their seats, the emcee at the entrance shouted at full volume, \"Her Highness the Princess has arrived!\"</p><br/><p>Everyone in the hall fixed their eyes on the entrance. The princess, who was wearing a golden dress, was followed by a group of uniformed maids as she entered the hall slowly. She took off her cloak and handed it over to one of the servants. The young princess greeted the host first.</p><br/><p>Regardless of her status in the royal family, the girl looked very pretty, which only added brilliance to her splendor. Although they were all fans of Qin Guan, she looked much more elegant than the two girls on the balcony.</p><br/><p>The master of the Xie family reminded Qin Guan to stand up and stretch his right hand out towards the princess.</p><br/><p>\"May I have the honor of making your acquaintance?\"</p><br/><p>The princess stretched her hand towards Qin Guan without a word. As her palm lay on his, Qin Guan bent over naturally with his left hand behind his back. He touched the tip of his nose gently against the back of her hand and made a kissing sound with his lips.</p><br/><p>This was standard polite hand-kissing.</p><br/><p>Actually, most films misinterpreted this gesture. Hand-kissing in Europe only involved a touch with one's nose tip. It was no French kiss by any means.</p><br/><p>Qin Guan's outstanding manners impressed the princess and her entourage. Qin Guan arose and said, \"Thank you!\"</p><br/><p>The whole procedure was finally over. Qin Guan led the princess into the hall as everyone went back to their conversations.</p><br/><p>They took a seat on a black leather couch.</p><br/><p>\"Hello, Qin Guan. I'm a fan of yours,\" the princess said. \"I have watched all your films and TV shows. They are wonderful!\"</p><br/><p>\"Thank you!\"</p><br/><p>Qin Guan expressed his appreciation. The princess spoke good Chinese. It was rare for a member of the royal family to speak standard Mandarin so well. Plus, she was an elegant, smart, calm fan. Qin Guan didn't feel any pressure as they talked.</p><br/><p>The girl was very polite at public events. Wang Liying was a little disappointed about that. It seemed that the princess loved the actor and his work, not just his looks.</p><br/><p>When the banquet came to an end, the princess' servant reminded her. The princess stood up reluctantly, ready to say goodbye and leave early.</p><br/><p>Qin Guan stood up from the couch politely, when a man suddenly rushed into the hall. He was wearing a royal blue uniform with bronze buttons. He had to be one of the princess' servants.</p><br/><p>He handed the princess a crystal cell phone.</p><br/><p>\"Your Highness, it's a call from His Majesty!\"</p><br/><p>\"Papa?\"</p><br/><p>When he saw the princess turn serious, Qin Guan paid close attention to the conversation.</p><br/><p>\"Did you know that in advance, papa?\"</p><br/><p>\"If I did, I wouldn't have let you go out tonight.\"</p><br/><p>\"Okay, I'll be careful.\"</p><br/><p>The short, hurried conversation made Qin Guan worry. The princess smiled at him when she ended the call.</p><br/><p>\"It seems that Mr. Qin is destined to stay with me. I have to stay at the banquet for a while.\"</p><br/><p>Qin Guan made a polite gesture. Then the princess and her servants walked over to Xie Guomin.</p><br/><p>Xie Hanren walked over to meet them, which seemed to annoy the girl in red.</p><br/><p>\"What happened? I thought she was about to leave. Why is she approaching my dad?\"</p><br/><p>\"No idea. She just received a call from her dad.\"</p><br/><p>A serious topic like that was out of their league, so they went back to gossiping again.</p><br/>\n</div>"}