{"title": "Chapter 894: The Base In Pinggu", "id": 894, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-894-the-base-in-pinggu", "volume_title": "Volume 9", "body": "<h1>Chapter 894: The Base In Pinggu</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 894: The Base In Pinggu</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>It was like an old fox's trick. When one turned down an invitation, it was hard for them to turn down a second one. Plus, the shooting site was in a suburb of Beijing, the Feilong Film Base in Pinggu County.</p><br/><p>Qin Guan could drive there by car and stay at a hotel overnight if necessary. They eventually reached an agreement.</p><br/><p>Qin Guan hung up and smiled at Wang. \"Please help me fit this into my schedule.\"</p><br/><p>Wang couldn't quite understand his decision. She was confused by his interest in a guest role in such a small production.</p><br/><p>She was right. Everyone had initially looked down upon the crew. After the show had been on CCTV for a week though, it had started attracting everyone's attention. The audience took delight in talking about every detail of the show, which had become a very popular topic among young people.</p><br/><p>Wang was still confused though, \"The show is popular, there's no doubt about that. But it's not worth your attention. It will not benefit you much. You should take the quality of your work into consideration. With all due respect, it's no more than a soap opera.\"</p><br/><p>\"You don't understand my feelings.\"</p><br/><p>In his last life, that show had revived light comedy in China. One decade later, people would not produce such popular shows with a limited budget anymore. That show was like a symbol in the river of history that only determined people with high aspirations could swim in.</p><br/><p>That was why Qin Guan had accepted the job. He wanted to be a part of it.</p><br/><p>They didn't talk about it for long, as a long-lost friend called Qin Guan right afterwards. It was Director Zhang Jizhong.</p><br/><p>He had a new script for Qin Guan, but he was not the director. He was actually the producer. Producers had to worry about audience ratings, money and TV show procedures. Their income was closely related to market information and all related expenses.</p><br/><p>Qin Guan was the most popular actor of his time, so he was a safe source of income in everyone's minds.</p><br/><p>That was why the director had called his old friend. As expected, Qin Guan told him everything about his upcoming schedule.</p><br/><p>\"I'd be happy to join your crew, but the filming would last really long. I can't make such a big commitment. Plus, if I was the protagonist, I could be forced to quit acting.\"</p><br/><p>\"What? Why?\"</p><br/><p>\"If an actor was warned or forced to quit by the SARFT… You know what I mean...\"</p><br/><p>\"Are you kidding? You won't be forced to quit over one role. You are such a talented guy! Your role in 'Lust Caution' didn't cause you any trouble either. It's none of their business!\"</p><br/><p>Qin Guan was moved by the director's bravery.</p><br/><p>\"So what's the script this time?\"</p><br/><p>\"This is my strongest selling point! It's Jin Yong's work 'The Return Of The Condor Heroes'.\"</p><br/><p>\"You want me to play Yang Guo?\"</p><br/><p>\"Of course. I want you to compete against Louis Koo.\"</p><br/><p>\"Who will be Miss Dragon?\"</p><br/><p>\"Liu Yifei. You have collaborated with her before. She looks exactly like an immortal.\"</p><br/><p>Qin Guan hadn't thought about that. His impression of her was still one of a little girl.</p><br/><p>\"That's up to you. You are the producer. Please look at my schedule carefully though.\"</p><br/><p>\"Of course. Do call me back if you make a decision. There is a long waiting list after you.\"</p><br/><p>\"Is Huang Xiaoming in it?\"</p><br/><p>\"Wow! Are you a seer? Yes, all he needs is a chance to shine. He is our fellow after all, isn't he?\"</p><br/><p>Wang was even more confused by Qin Guan's choice. She was an agent with excellent executive force though. After a short period of preparation, they headed to Pinggu.</p><br/><p>Pinggu, which was a county in the suburbs of Beijing, was famous for its specialties and rich history. It produced juicy, sweet peaches that foodies loved. The Great Wall of the Ming Dynasty snaked through the county, serving as the last line of Beijing's defence.</p><br/>\n</div>"}