{"title": "Chapter 895: Qin Tengyun", "id": 895, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-895-qin-tengyun", "volume_title": "Volume 9", "body": "<h1>Chapter 895: Qin Tengyun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 895: Qin Tengyun</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Amid the winter of Northern China, the valley, with its bare trees bustling in the wind, seemed really boring.</p><br/><p>Except for the Tongfu Inn, there was no other presentable construction around. They had chosen the film base halfway up the hill because of their limited budget.</p><br/><p>The popularity of the show had created a bare-necessities shooting trend. All the fans of the show had focused on the wrong point.</p><br/><p>After more than six months, all the actors living there were now familiar with the base. The day of the final episode was drawing near. Everyone had slowed down on their work as they waited for the last guest star to arrive. It was a big name they had not expected.</p><br/><p>The happiest person in the crew was Wang Shasha, who portrayed Mo Xiaobei and was a big fan of Qin Guan's. The unhappiest person was Yao Chen, an actress with a really big mouth.</p><br/><p>She had good reason to be unhappy, as her husband, Ling Xiaosu, had originally been supposed to be the guest star. However, her dream had been shattered and the role had gone to Qin Tengyun instead.</p><br/><p>The other members of the crew were glad to see Qin Guan, It would be a rich experience to collaborate with him. Plus, in the future, they would also be able to say that they had cooperated with Qin Guan.</p><br/><p>Julia Roberts, Chow Yun-Fat and Gong Li had already collaborated with Qin Guan. Now those nameless actors would be added to the list.</p><br/><p>Qin Guan was welcomed by everyone. Wang Shasha even pulled his door open in a dramatic way. Qin Guan joined the group fast.</p><br/><p>\"Will you work abroad next year, Qin Guan?\"</p><br/><p>\"Shall we take a photo together, Qin Guan?\"</p><br/><p>\"Qin Guan...\"</p><br/><p>They were certainly a funny crew. Qin Guan felt really nice around them.</p><br/><p>Ning Caishen, who was the show's scriptwriter, walked over. That man and Director Shangjing, who was a strict, shameless guy, made for a strange combination. Ning was a leading figure among the first generation of web authors in China. He had been the Director of Operations of Rongshuxia, a big literary website, for three years and witnessed his painstaking care get gradually swallowed up by network operations.</p><br/><p>After pondering the matter, he had made the most important decision of his life. He had become a professional scriptwriter. That change had been a huge success for him.</p><br/><p>This was the first project that he was shooting based completely on his own ideas. No one could tamper with his work until it could not be recognized anymore.</p><br/><p>He had poured all his talent into this project, so he appreciated Shang's effort to bring Qin Guan on board.</p><br/><p>When everybody was there, they got ready to witness the end of their effort.</p><br/><p>When Qin Guan walked out of the fitting room, everyone fell silent. The crew was staring at him. Qin Guan looked around in confusion and fixed his costume.</p><br/><p>Everything seems okay. What are you all looking at?</p><br/><p>They were just shocked by his appearance.</p><br/><p>It was lucky that Qin Guan was only participating in the last episode of the show, or he would have outshined the protagonist.</p><br/><p>Sha Yi, who was the protagonist, let out a long sigh of relief. Meanwhile, Wang Shasha was waving a lightstick at Qin Guan.</p><br/><p>The director couldn't tolerate this behavior anymore. \"Get ready!\" he shouted at everyone. \"What are you doing? You can look at him after the scene! Come on! I haven't paid you yet!\"</p><br/><p>He didn't know that the value of his actors would increase by more than 10 times soon.</p><br/><p>Everyone got into position in fear.</p><br/><p>\"This is the 80th episode! Yan Xiaoliu received a transfer order and Qin Tengyun attacked the Tongfu Inn at night. Three, two, camera!\"</p><br/><p>The camera started filming.</p><br/><p>Crack! The door of the inn was pulled open. A young, handsome swordsman rushed into the hall. He had to be a good martial artist, for his movements looked elegant. The people following him were shut out.</p><br/><p>It was a pity that such a handsome man had such a funny accent.</p><br/>\n</div>"}