{"title": "Chapter 899: Meeting The Father-In-Law", "id": 899, "volume": 9, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-899-meeting-the-father-in-law", "volume_title": "Volume 9", "body": "<h1>Chapter 899: Meeting The Father-In-Law</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 899: Meeting The Father-In-Law</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>All things had flaws. Nothing was perfect in the world. After work, Qin Guan decided to spend all his spare time with his family.</p><br/><p>When his fans saw pictures of the sea uploaded on his blog, they realized that Qin Guan had returned to his hometown. He had temporarily gotten time off work to enjoy the Spring Festival with his parents. He was a very obedient son.</p><br/><p>Meanwhile, his parents and Cong Nianwei's parents had reached the agreement that their children would get married before paying more attention to their careers. They were almost 30 years old after all.</p><br/><p>Cong Nianwei's father felt really nervous about this due to Qin Guan's rising status. He loved his daughter very much, so he was very concerned.</p><br/><p>He knew his daughter well. Every time he called her, she was either studying or working. She had mentioned Qin Guan many times, but she hadn't sounded worried. It seemed that Qin Guan's fame had not affected their relationship.</p><br/><p>As a man, he had no idea what the origin of her confidence was, To him, Qin Guan was still the bad boy who had stolen his daughter away.</p><br/><p>While Cong Nianwei's father was busy thinking of 108 ways to torture Qin Guan, the bastard suddenly invited him to a private meeting.</p><br/><p>Why would a rat invite over a cat? Cong Nianwei's father opened the window to make sure that the sun had not risen from the East that day.</p><br/><p>Did he commit some unforgivable crime that he needs to be forgiven for?</p><br/><p>He began to look around the living room for a handy weapon. In the end, he chose a wrench from his tool box. The hammer was too heavy, and the bolt driver was too dangerous, but the wrench was the perfect tool to flatten someone's nose.</p><br/><p>Cong Nianwei's father left in a hurry with a fierce smile on his face. Cong Nianwei's mother nudged Cong Nianwei, who was carefully peeling an apple on the couch.</p><br/><p>\"What happened to your father? He had a strange smile on his face.\"</p><br/><p>Cong Nianwei looked indifferent. She knew her father really well.</p><br/><p>\"Just check the caller ID. He answered the phone before he started acting strange. You don't need to feel embarrassed. I won't laugh at you.\"</p><br/><p>Her mother pressed the buttons on the phone until she saw a familiar number.</p><br/><p>\"Huh? The call was from Qin Guan's home.\"</p><br/><p>While Cong Nianwei and Qin Guan had been in Beijing, their parents had maintained a close relationship, so Cong Nianwei's mother was familiar with their phone number.</p><br/><p>\"That's really strange. If they had something to tell us, Qin Guan would have called you or me. Your father is such a troublemaker...\"</p><br/><p>Cong Nianwei finished peeling the apple and took a bite.</p><br/><p>\"Qin Guan must have some ideas he wants to share with dad.\"</p><br/><p>\"What ideas?\"</p><br/><p>\"God knows!\" Cong Nianwei shrugged. She was used to his unpredictable behavior.</p><br/><p>\"Do you think they are planning to rob a bank or something? I wouldn't put it past them...\"</p><br/><p>They exchanged a meaningful look with each other.</p><br/><p>The best place for a meeting in the winter was a tea house. There were some unique tea houses along the beach, which had been reconstructed from old buildings. There were open halls and lounges with small booths inside. Qin Guan was waiting in a small tea house.</p><br/><p>He was looking at the rising mist amid the rare winter sunshine as he waited nervously for the other man to arrive.</p><br/><p>It had been a long time since he had been nervous about anything. One only felt nervous about matters they really cared about. Qin Guan could predict how the conversation with his father-in-law would go. If he could move the man, then his plan would succeed.</p><br/><p>Qin Guan had dressed formally to impress Cong Nianwei's father, hoping that they could possibly form a male alliance.</p><br/><p>When Cong Nianwei's father entered the tea house in a threatening manner, he saw a sparkling man waiting there. Maybe it was his bad eyesight, or maybe the sunshine was too bright in that place.</p><br/><p>Although he still hated Qin Guan, he had to admit that he looked great.</p><br/>\n</div>"}