{"title": "Chapter 909: An A-Level Film", "id": 909, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-909-an-a-level-film", "volume_title": "Volume 10", "body": "<h1>Chapter 909: An A-Level Film</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 909: An A-Level Film</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The audience was impressed by Qin Guan's hips. However, during an interview with audience members coming out of the cinema, a girl said that she wasn't quite clear about the meaning of the story.</p><br/><p>\"I'm clear about the plot, but the title of the film was really strange. The combination confused me.\"</p><br/><p>\"Exactly. We came here for the handsome protagonist. Maybe a more sophisticated person would get it. \"</p><br/><p>Eventually, some scholars gave an explanation for the common audience. Unfortunately, their explanation confused the audience even more.</p><br/><p>Qin Guan received a call from Director Jiang Wen.</p><br/><p>\"Qin Guan, I have suffered a great loss.\"</p><br/><p>\"I'm sorry to hear that, Director Jiang.\"</p><br/><p>\"I stopped you this time. Without you, it would have been even worse. I think I have to lay low for a while. If I don't win an award in Venice, no producer will work with me in the next few years.\"</p><br/><p>\"Really?\" Qin Guan adjusted his posture on the couch. \"Did you forget your other profession, Director Jiang? You are a good actor!\"</p><br/><p>\"You are right, Qin Guan. I'll collect some money for my next film by acting!\"</p><br/><p>Qin Guan didn't know how to comfort the man. As he had said, people wouldn't watch his films again anytime soon.</p><br/><p>One had to prepare before getting to work. Qin Guan was shortlisted at the Venice Film Festival for his leading roles in both of his films.</p><br/><p>It was hard to understand the judges' train of thought. After so many years of rejecting him, they had finally given him two important opportunities.</p><br/><p>If he won the Best Actor Award in Venice, Qin Guan would achieve a Grand Slam in Europe.</p><br/><p>He was in an unprecedentedly good mood as he took care of all his affairs and left his wife behind reluctantly. He would fly to the festival by himself.</p><br/><p>Due to his fear of being forced out of work in China, he had accepted a new Hollywood film. Its title was \"I Am Legend\".</p><br/><p>This would be Qin Guan's first sci-fi movie. Unlike his previous body double job, this time he would be the real hero of a post-apocalyptic movie.</p><br/><p>Plus, this would be his first film with a budget of over 100 million dollars. According to the standards of the Screen Actors Guild, although he had already been a star worth a 10-million paycheck, he had never been involved in a big-budget film before. This would also be the first A-level film with an Asian protagonist.</p><br/><p>Nobody could predict the film's box office success. The reason Qin Guan had been cast as the lead was that the film required outstanding acting skills. Qin Guan would basically be reciting a monologue. The other actors only played small parts in the film.</p><br/><p>As the producer and the director had been looking for a young actor with extraordinary acting skills, a number of famous directors had recommended Qin Guan.</p><br/><p>Thus, the lucky guy had gotten the part. His interpretation of the original version and the two previous adapted scripts impressed director Francis Lawrence.</p><br/><p>Francis had been shooting sci-fi films for more than 10 years. He was basically obsessed with them.</p><br/><p>Qin Guan convinced the picky director by sending him a video recording a man living alone in a post-apocalyptic world.</p><br/><p>His back was against the sun. His eyes looked as blank as a piece of paper. Francis was so moved that he convinced the two producers to replace Will Smith with Qin Guan.</p><br/><p>The producers approved the plan unanimously, as Qin Guan had a very good reputation in the circle. They were so confident about him that they invested 150 million dollars on the unique sci-fi film, which surprised Qin Guan. He wondered why a film with basically one actor would cost that much.</p><br/>\n</div>"}