{"title": "Chapter 902: The Civil Affairs Bureau", "id": 902, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-902-the-civil-affairs-bureau", "volume_title": "Volume 10", "body": "<h1>Chapter 902: The Civil Affairs Bureau</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 902: The Civil Affairs Bureau</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>It was an ordinary working day, so the staff went to the office at eight o'clock. The janitor had already finished her job, and the officers were already at their posts.</p><br/><p>Actually, getting a marriage registration was quite a simple process. All one had to do was bring all the required paperwork and the staff would help them complete the process.</p><br/><p>The first couple they welcomed that day was a little weird. It was a tall man with a pretty girl. They were a good match look-wise, if one ignored the man's clothes.</p><br/><p>Although it was a chilly winter day, it was unnecessary for him to wear both a scarf and a hat. Plus, he was also wearing a pair of huge sunglasses. He was looking around nervously as he walked.</p><br/><p>He does not seem like a good man.</p><br/><p>Sister Li was a government official, so she was a very smart woman. No evil man could fool her sharp eyes.</p><br/><p>She was sitting behind the desk, when she asked them worriedly, \"Are you here for a marriage registration?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Do you have all the paperwork?\"</p><br/><p>\"Yes, here you go.\"</p><br/><p>Qin Guan took all the documents out of his backpack hurriedly and set them carefully down on the desk with sweaty hands.</p><br/><p>Sister Li looked at the man suspiciously. She didn't pay attention to the paperwork.</p><br/><p>Instead, she said seriously, \"Please take off your hat and scarf, young man. Yes, you. I have to check your identity. What are you so worried about? Have you been married or divorced before? Did you lie to this girl? Take them off! Quick! The sunglasses too!\"</p><br/><p>\"Okay! I'll take them off. It's lucky that there is nobody else here.\"</p><br/><p>Sister Li's voice had attracted all the idle officials in the building. They were all used to the funny and tragic incidents that took place at the bureau. Couples went there with all kinds of stories.</p><br/><p>They thought Qin Guan was just a con artist.</p><br/><p>When Qin Guan got rid of his disguise, Sister Li was stupefied. \"I've come here for a marriage registration,\" he reminded her with a smile.</p><br/><p>Sister Li came back to her senses and picked up the paperwork with trembling hands. Her eyes were still fixed on his face.</p><br/><p>\"Your name is Qin Guan?\"</p><br/><p>\"Yes.\"</p><br/><p>\"And you were born in 1980?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Did you play Tian Fen in 'Emperor Han Wu'?\"</p><br/><p>\"Erm... Yes...\"</p><br/><p>All the women on site suddenly went crazy! The girl in charge of taking pictures passed out tearfully and the lady sitting behind the computer hit her head against the wall!</p><br/><p>Are you kidding me? I'm here for a marriage registration. Why are you acting like a relative of yours just passed away?</p><br/><p>Some of the female staff even refused to help them. They didn't want to personally push their idol into another woman's arms. They didn't want to live with that regret forever.</p><br/><p>\"So you decided to get married?\" someone asked him.</p><br/><p>\"Yes. My bride-to-be is also a resident of Y City,\" Qin Guan answered happily.</p><br/><p>\"Will you hold the wedding banquet here?\"</p><br/><p>\"Of course. This is my hometown!\"</p><br/><p>All the forms and paperwork were filled as they chatted. Qin Guan and Cong Nianwei signed their names and fingerprints in red ink.</p><br/><p>\"Did you bring a photo of the two of you? If you didn't, we have a professional photographer here. You can take a photo on the spot.\"</p><br/><p>\"That's alright, I have one with me. Is this okay?\"</p><br/><p>Qin Guan took out a photo with a red background. Everyone gathered around him to take a look at it.</p><br/><p>Qin Guan had prepared well for the day. On the photo, he and Cong Nianwei were standing shoulder to shoulder with happy smiles.</p><br/><p>It was a simple, yet memorable picture.</p><br/>\n</div>"}