{"title": "Chapter 919: The Daily Express", "id": 919, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-919-the-daily-express", "volume_title": "Volume 10", "body": "<h1>Chapter 919: The Daily Express</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 919: The Daily Express</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The guy flew away dramatically and landed into a pile of lone wax figure parts. Only his trembling arm was visible anymore.</p><br/><p>He looked like an avant-garde artwork that could be titled \"Unyielding Struggle\".</p><br/><p>Everyone tried their best to suppress their laughter. Han adjusted his tie and returned to his original position as the unlucky guy climbed out of the pile.</p><br/><p>\"Oh my God! You brought Qin Guan. I'm at your service. Thank you for your mercy! Amen!\"</p><br/><p>Qin Guan shot a confused look at the staff member, who was trying to figure out a proper way to explain. Suddenly, the praying man hugged Qin Guan's leg.</p><br/><p>\"He is real! What a slender leg...\"</p><br/><p>'\"Go away!\" Wang Liying hit him in the face with her handbag.</p><br/><p>The staff member hastened to pull the man away.</p><br/><p>\"I'm sorry, everyone. Τhis is our chief moulder, Mr. Chris. He is good at making human-like wax sculptures by using moulds. He is a big fan of Qin Guan, so he has been hoping to make his wax figure for the museum. Now his wish has finally come true. Mr. Chris is really excited, which is understandable. Some people are born very passionate.\"</p><br/><p>Passionate? He is crazy!</p><br/><p>Chris returned to his seat tamely.</p><br/><p>\"Wow! Your features are perfectly proportioned! I was deeply attracted to you at first glance. You are God's most perfect creation!\" he said as he took out his tools. \"I prefer a formal suit on you... I can feel your soul through it.\"</p><br/><p>The man got to work happily. After putting down the last measurements, he reached out to caress Qin Guan's forehead.</p><br/><p>\"F*ck off!\"</p><br/><p>Han's order was short, but efficient. Chris stepped back immediately with a tremble. \"What a rude Yankee!\" he murmured.</p><br/><p>Then he nodded at Qin Guan. \"Thank you so much for your cooperation. I'll inform you as soon as the sculpture is finished.\"</p><br/><p>Qin Guan smiled and stretched his hand out towards Chris, who swallowed his saliva before taking it.</p><br/><p>\"Hey, watch your hands! We have a lot of work later.\" Han was the right man to handle such a guy.</p><br/><p>You will leave, but I will remember your face forever.</p><br/><p>Qin Guan was a professional actor, so it was easy for him to maintain his smile. The director of the museum had invited a journalist from the Daily Express for a short interview after all.</p><br/><p>It was not important news that a star was going to have their own wax sculpture in the museum, but it was the kind of news that fit the style of the Daily Express, which was selling like hot bread in the UK. Most of its readers were ordinary people, so this was a good way for them to learn what was going on in the UK.</p><br/>\n</div>"}