{"title": "Chapter 918: The Third Floor Of Madame Tussauds", "id": 918, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-918-the-third-floor-of-madame-tussauds", "volume_title": "Volume 10", "body": "<h1>Chapter 918: The Third Floor Of Madame Tussauds</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 918: The Third Floor Of Madame Tussauds</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>People always praised an actor by using the word \"breakthrough\", but they ignored that each person had their own limitations. No actor could play well all kinds of roles. There was no such person in the world. If an actor dismissed that fact, they could make a fool of themselves.</p><br/><p>Clever actors abandoned that impractical idea and focused on roles that entertained the audience.</p><br/><p>Alice Braga bowed deeply before Qin Guan. Now she understood how he had become an international award-winning actor. He had a much more profound understanding of the circle than she did.</p><br/><p>Qin Guan was delighted to gain another fan in the industry. He took a flight to London in a really good mood.</p><br/><p>He had already called Cong Nianwei several times to invite her to go to the UK with him, but the construction of the Olympic Stadium had yet to be completed. Cong Nianwei's schedule was really tight, so she had to reject his proposal.</p><br/><p>The construction of the Olympic Stadium and all the related facilities had reached a crucial stage, so Cong Nianwei was too busy to even get a decent amount of sleep.</p><br/><p>China's construction companies were the fastest in the world. The country's flourishing cities attracted people from all directions.</p><br/><p>The previous infrastructure and living conditions couldn't satisfy the pouring crowd, so more and more buildings started being built, which in turn attracted even more migrant workers and architects. The pressure was finally eased during the developing process.</p><br/><p>Skilled, hard-working labor workers were the key behind China's outstanding construction speed.</p><br/><p>The main stadiums of the 2008 Olympics changed with each passing day.</p><br/><p>Unlike his sweaty girlfriend, Qin Guan was standing in the entrance hall of Madame Tussaud's, wearing an exquisite suit and a shiny pair of leather shoes.</p><br/><p>A staff member walked over. \"Are you Mr. Qin Guan? Follow me, please.\"</p><br/><p>It was a freckled girl with a lovely smile. She led them upstairs while she made a basic introduction about the museum.</p><br/><p>The wax figures were exhibited on the first and second floor, but the third floor was not open to the public. That was where the figure manufacturing studio was located. All the lucky stars selected by Madame Tussaud's were measured there by professional staff. Then the materials were sent to the headquarters in London.</p><br/><p>The mysterious gate was opened for Qin Guan. A rare exception was being made for the Chinese actor, as the chief craftsman was really interested in him.</p><br/><p>\"Come in, please.\"</p><br/><p>The girl pushed the gate open slowly with a polite smile to reveal a mysterious world. Before Qin Guan could even step forward, a black figure rushed over to him with a loud scream.</p><br/><p>\"Ah!\"</p><br/><p>Before anyone could react, Han Zhujiu took action. As soon as he saw the black figure, he jumped out from behind Qin Guan and blocked the guy. The professional bodyguard threw a kick without hesitation.</p><br/><p>Bang!</p><br/>\n</div>"}