{"title": "Chapter 921: The Pianist", "id": 921, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-921-the-pianist", "volume_title": "Volume 10", "body": "<h1>Chapter 921: The Pianist</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 921: The Pianist</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Is that your way of promoting our museum? All I can do is support Qin Guan.</p><br/><p>Qin Guan had no idea what the two men were thinking. Suddenly, he received a call that added something special to his schedule. The call was from a person who had approached him through some common friends from the American music circle. He didn't need his help. He just wanted to become friends with him.</p><br/><p>The man was Lang Lang, who had just signed a contract with IMG. Although he had studied at traditional music schools in both China and the US, his heart longed for freedom, which made him incompatible with other strict, narcissistic pianists. He thought that music should be introduced to the public through mainstream methods.</p><br/><p>After graduating from college, he had joined IMG to become a popular pianist. His soul wasn't meant for classical music halls.</p><br/><p>That year, he was nominated for a Grammy, which proved his choice right. A Grammy was the equivalent of an Oscar in the music circle. All musicians wanted one like crazy.</p><br/><p>Ironically, Lang Lang was nominated for his Beethoven's First/Fourth Piano Concerto, so his feelings were mixed. When he heard that IMG had failed to invite Qin Guan, he felt the impulse to talk to his successful fellow, who also happened to ignore his occupation.</p><br/><p>Fellowship was important in foreign countries, but it was not easy to meet Qin Guan. Lang was a smart guy, so he used an indirect method.</p><br/><p>Thanks to his connections in the New York Chinese Business Union, Lang Lang received an invitation to a party held by the US Chinese Yacht Club. As a rising pianist, he enjoyed a decent social status, so Chinese businessmen were happy to invite him to their parties.</p><br/><p>Thus, after checking the account of his QC firm in New York, Qin Guan was led to a luxury yacht at the New York harbor by Xu Xiaoxiao and He Ming.</p><br/><p>It was not a party of four anymore, like it had been the previous time, so they had chosen a large yacht that could hold hundreds of people. The vessel was not a ship anymore. It had been transformed into a party venue, which only showed the strength of the private club.</p><br/><p>Qin Guan sighed with emotion. \"Wow! It's only been a few years, but it looks like you replaced a rifle with a cannon!\"</p><br/><p>He Ming was a calm, but proud man.</p><br/><p>\"I worked really hard on it. Plus, there are many rich Chinese people nowadays. Rich people are welcome everywhere.\"</p><br/><p>Although they had been born in talented families, He Ming and Guan Jian had their own personal goals. After getting rich, Guan Jian had returned to China, while He Ming had travelled to different countries and tried to unite Chinese businessmen around the world.</p><br/><p>The two young men had made very brave choices.</p><br/><p>People started getting on board. Qin Guan was happy to meet really successful businessmen. Before making a toast for the 32nd time, He Ming got on the high stage in the middle of the ship with a microphone and announced the start of the bustling party.</p><br/>\n</div>"}