{"title": "Chapter 937: Three Kinds Of People One Shouldn’t Ignore", "id": 937, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-937-three-kinds-of-people-one-shouldn%E2%80%99t-ignore", "volume_title": "Volume 10", "body": "<h1>Chapter 937: Three Kinds Of People One Shouldn’t Ignore</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 937: Three Kinds Of People One Shouldn’t Ignore</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The manager of the museum had to have a long conversation with Qin Guan. During the night, a lot of exhibits came alive and fought with each other. Qin Guan wasn't aware of this, but a couple of cowboys had pulled a general of the Roman Empire to the guillotine.</p><br/><p>The manager talked to Qin Guan in an effort to find out why.</p><br/><p>The director shot a close-up of Qin Guan's face as he explained to the manager sincerely, \"In my opinion, the Romans are too arrogant. The cowboys just wanted to warn him.\"</p><br/><p>Are you kidding?</p><br/><p>The manager disliked his strange sense of humor. Suddenly, Qin Guan realized that all the events that had happened during those wonderful nights had been kept a secret by the previous security guards.</p><br/><p>If he wanted to hold on to his job, he had to bury that secret in his heart. Qin Guan decided to take his son to the museum at night to entertain him.</p><br/><p>\"Cut!\"</p><br/><p>Jack, who was a child star, was looking forward to being Qin Guan's son in the film. His beautiful black eyes and hair made him look like he was mixed-race.</p><br/><p>Jack had started his career at eight years old and become an experienced actor three years later. As a result, he was not shy when he met Qin Guan. He was just waiting for the superstar's approval.</p><br/><p>On each movie set, there were three kinds of people worth one's attention: old actors, children and extras. If inspired, they would give an amazing performance.</p><br/><p>Qin Guan didn't look down upon the boy.</p><br/><p>\"Are you ready?\"</p><br/><p>\"Yes!\" they answered together. As soon as the camera started filming, they held each other's hand.</p><br/><p>Three previous security guards had stolen the golden board that could revive the statues of the museum and used Qin Guan as a scapegoat.</p><br/><p>Qin Guan, who was a brave security guard, had to fight for his reputation.</p><br/><p>\"Jack, run!\" he shouted at his son. The boy rushed out of the room.</p><br/><p>\"I don't want to hurt the old men.\"</p><br/><p>Qin Guan blocked the way of the three old thieves.</p><br/><p>The boy looked back at him with trust in his eyes and got shocked by the scene.</p><br/><p>His brave father was being beaten by an old man!</p><br/><p>Everyone tried their best not to laugh, but as they watched the boy run as fast as a bunny, the director burst into laughter.</p><br/><p>\"Stop! Where is the stylist? Draw some wounds on his face.\"</p><br/><p>The smart director had found a way to hide his mistake.</p><br/><p>Taking advantage of the situation, he checked on the camera positions and the other actors again. That chaotic scene would be the climax of the film. It had finally come after two weeks.</p><br/><p>The massive figures made positioning the cameras really difficult. Each mistake would lead to another take, which was a precious waste of time and money. The Roman soldiers, the cowboys and the Pharaohs patted their chests and promised Director Shawn they would do their best.</p><br/><p>The actors who played Attila's soldiers were the most peculiar among the extras, as they were members of the Chinese Figurant Union. They had asked to join the crew when they'd heard that the production had been looking for Asian actors.</p><br/>\n</div>"}