{"title": "Chapter 934: A Former President", "id": 934, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-934-a-former-president", "volume_title": "Volume 10", "body": "<h1>Chapter 934: A Former President</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 934: A Former President</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>In America, security uniforms in different industries or institutions were also different. Americans liked to stand out, so professional uniforms always had intricate designs.</p><br/><p>Qin Guan's uniform was really handsome. Its brassards and broad belt fit him well. He was also equipped with a walkie-talkie and an alarm buzzer, which only made him look more charming.</p><br/><p>\"Are you ready, Qin Guan?\"</p><br/><p>Qin Guan walked to the center of the museum and gestured at the director.</p><br/><p>This scene would be his alone. A long take with a single actor required extraordinary acting skills. Plus, he had no lines, so he could basically only rely on his acting talent.</p><br/><p>The script only said that the character was supposed to be singing out of boredom.</p><br/><p>Qin Guan walked to the control center and started rapping in Chinese through the speakers.</p><br/><p>It sounded weird, but it was funny.</p><br/><p>Fu Shen, who was standing behind Wang Liying, enjoyed the song along with everyone else.</p><br/><p>No one could recall who Fu Shen was. He had been a nobody in Qin Guan's life. He used to be the president of the Chinese Student Union at Columbia University, but now he worked as a reporter at a TV station.</p><br/><p>\"Qin Guan is the same guy he used to be at college. He is still just as handsome.\"</p><br/><p>\"Yes, the guy is blessed.\"</p><br/><p>Fu Shen was already an elite. He was no longer an energetic young man, but Qin Guan was only two years younger than him. He could also act in a teen drama if he wanted.</p><br/><p>\"He was the most popular guy at college. Could you put in a good word for me later?\"</p><br/><p>\"Sure.\"</p><br/><p>Qin Guan could take responsibility for such a decision after all.</p><br/><p>By then, Qin Guan had fallen asleep on a chair that was too weak to support a tall man like him. The handsome security guard landed on the floor like a frog.</p><br/><p>Bang!</p><br/><p>Everyone burst into laughter.</p><br/><p>The director stopped the cameras. Fu Shen applauded. He felt like flattering Qin Guan, but he was also convinced by his performance.</p><br/><p>\"This is wonderful! I'd never seen him in action before. This is better than watching him on the screen. He really is an outstanding actor.\"</p><br/><p>\"Thank you. Save the flattery for later though, or people will think you are a professional groupie.\"</p><br/><p>Qin Guan approached them.</p><br/><p>The former Student Union president looked quite different than he remembered.</p><br/><p>\"What are you doing here? Why did you come all the way to Canada to see me?\"</p><br/><p>Because there were too many people around Qin Guan in New York. Fu Shen looked frustrated.</p><br/><p>Qin Guan was a considerate man, so he got straight to the point.</p><br/><p>\"What did you come here for? Just tell me what the problem is. I'll fix it, if I can. I might have a star on the Walk of Fame, but I'm a kind man.\"</p><br/><p>Qin Guan was just as easy-going as he used to be. Fu Shen's smile became even more sincere.</p><br/><p>\"Ever since I graduated, I have been working at NBC and other TV stations.\"</p><br/><p>\"Sounds good.\"</p><br/>\n</div>"}