{"title": "Chapter 938: Monkey Boxing", "id": 938, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-938-monkey-boxing", "volume_title": "Volume 10", "body": "<h1>Chapter 938: Monkey Boxing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 938: Monkey Boxing</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Although it was difficult for Asian actors to succeed in Hollywood, their oriental characteristics were indispensable.</p><br/><p>Everyone had their own job.</p><br/><p>Qin Guan stepped into the set with wounds on his face. When the fierce battle came to an end, the three thieves were caught by the statues and the beasts and Qin Guan had successfully retrieved the golden board.</p><br/><p>At the first light of dawn, all the exhibits returned to their original positions. They had saved both themselves and Qin Guan's job.</p><br/><p>What a moving moment! Tears filled Qin Guan's eyes.</p><br/><p>He actually loved the atmosphere on set. The best American comedians were among the cast. As he felt distressed about parting ways with them, the director pulled at his arm.</p><br/><p>\"What are you doing?\"</p><br/><p>\"The film is finished. I'm telling everyone goodbye.\"</p><br/><p>\"Their job is over, but yours is not. You have some scenes to shoot tomorrow.\"</p><br/><p>\"What scenes?\"</p><br/><p>\"You have to interact with some African jungle monkeys. It's an extremely funny scene in the film. Don't you remember?\"</p><br/><p>\"Does it involve special effects?\"</p><br/><p>\"You lucked out. Our prop team found real monkeys just like the statues, so we have to film a few more scenes. Don't worry, they have been trained in a circus. They are smart and obedient. If everything goes well, we'll be done in 10 minutes.\"</p><br/><p>If everything goes well... I like the way you phrased this.</p><br/><p>Reality was really cruel. The next day, Qin Guan met his partner, who used to be a circus star.</p><br/><p>Capuchin monkeys lived in rainforests. The highly intelligent primate had impressed humans with its kindness and cleverness, which was why the circus had trained it and turned it into a performer.</p><br/><p>To Qin Guan, high IQ was a sin, as it could be expressed through facial expressions or body language that could be easily understood by others.</p><br/><p>Thus, Qin Guan's nightmare began.</p><br/><p>As soon as the director started filming, the monkey punched Qin Guan's ear. Bang!</p><br/><p>Qin Guan's reaction was unpredictable. He didn't give up like a spoiled child or remain stupefied. Instead, he fought right back.</p><br/><p>Bang!</p><br/><p>The monkey was confused. Up until now, whenever he attacked a human, they usually thought it was a trick. What the hell is that gorilla doing? He is bullying me!</p><br/><p>The brave monkey stretched his paws out and launched a counterattack. So did Qin Guan. The sounds of their fight echoed around the room.</p><br/><p>Bang! Bang! Bang!</p><br/><p>It was impolite to receive without giving back.</p><br/><p>Everyone stopped to watch, including the director and the figurants. They put off their work to enjoy the battle between the two monkeys.</p><br/><p>The award-winning actor was very dedicated to his job. The director was excited about the result.</p><br/><p>This was genius. It was an improvement on the original script!</p><br/><p>Wang Liying, who was the only one who knew Qin Guan so well, was stupefied. She didn't want to say anything, so she just let the misunderstanding go on to save Qin Guan's dignity.</p><br/><p>\"Wonderful! That's enough, Qin Guan!\" the director shouted in a trembling voice. Qin Guan tried to recall how many rounds they had fought for.</p><br/>\n</div>"}