{"title": "Chapter 943: Shock", "id": 943, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-943-shock", "volume_title": "Volume 10", "body": "<h1>Chapter 943: Shock</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 943: Shock</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Everyone knew that one should bend forward when eating something that contained sausage. The girls had trouble with the unfamiliar food though. They unfortunately dropped sausage on their gorgeous dresses.</p><br/><p>\"Shit!\" one of the girls shouted. Her friends started laughing and screaming around her.</p><br/><p>'NO! NO, NO, NO!'</p><br/><p>Qin Guan and Gao also burst into laughter as an assistant walked up to them.</p><br/><p>\"Attention, please. The auditorium has opened. Please go through the hallway and find your seats by following your name cards. Please stay in your seats and wait for the director's instructions. Do not leave your seats or walk around. Thank you for your cooperation.\"</p><br/><p>The official instructions were clear for everyone. However, Qin Guan noticed that they were the only ones who followed the rules.</p><br/><p>Their seats were in the first row, which was basically the royal box. The principal of IMG, who had been waiting for them there, waved at them and led them to their seats.</p><br/><p>The other guests were not as polite though. Everyone was walking around and talking. The guests sitting in the back row were approaching the people sitting in the front.</p><br/><p>There were only 20 minutes left before the ceremony started.</p><br/><p>\"Take your seats! Sit down, please!\" the director was yelling at everyone as loud as he could.</p><br/><p>Nobody was paying any attention to him. People were still hugging and kissing each other, while also complimenting each other's outfits.</p><br/><p>\"Ha ha! American directors are so unlucky. If this was China, the director would have run the whole event. Plus, the Chinese are as tame as sheep. They would even have laughed according to the instructions!\"</p><br/><p>Qin Guan and Gao talked and chuckled. Lang Lang was smiling behind them. The IMG principal was sitting right next to him, so he dared not comment.</p><br/><p>In the end, the director screamed in the microphone. The harsh sound silenced everyone successfully.</p><br/><p>\"Attention! We are counting down to the live broadcast! On your marks!\"</p><br/><p>The guests looked distressed, but they returned to their seats, holding the hems of their long skirts in their hands.</p><br/><p>\"Ten seconds until the countdown! Five, four, three, two, one… Applaud! Louder!\"</p><br/><p>All the attendants were circle insiders, so they cooperated with the director. The audience would watch the grand event begin under the starry night in the large, bustling stadium.</p><br/><p>As soon as the host surrendered the stage to the first guest performer, everyone knew that the biggest winner of the 47th Grammys would be the Dixie Chicks. It was almost a Grammy tradition that the first band to perform would be the winner.</p><br/><p>Qin Guan, who was sitting in the first row, was experiencing a live concert in America for the very first time. Everything was well-prepared, including the stage, the lighting, the costumes and the props.</p><br/><p>The singers sang live from beginning to end. There was no lip syncing whatsoever. The ceremony was a celebration for everyone in attendance.</p><br/><p>The Grammys were very inclusive, so the organizers had not invited only pop singers to the ceremony. There was also a place for rock music, country music, rap and opera in the show.</p><br/><p>Qin Guan and Gao got lost into an ocean of music. Three and a half hours passed in a flash. The awards were given out one by one. All the winners got on the stage happily and interacted with the audience as if they were in their own backyard.</p><br/><p>The reporters and the guests were all showing off excitedly. Whenever someone appeared on the big screen, everyone would applaud them. Sometimes, the whole audience would stand up and cheer when they saw themselves on the screen.</p><br/><p>Some people sang along with the singers on the stage. Although they were out of tune, their spirit was admirable.</p><br/>\n</div>"}