{"title": "Chapter 942: Low", "id": 942, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-942-low", "volume_title": "Volume 10", "body": "<h1>Chapter 942: Low</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 942: Low</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Unlike film festival sponsors, the sponsors of the Grammys were very diverse. Film festival sponsors were usually clothing, accessories and watch brands, while the Grammys had sponsors from different fields. They were even sponsored by McDonald's.</p><br/><p>There was a poster ad right next to the clown. If one took a photo and shared it on their blog, they could get a coupon for a free hamburger and a Coca Cola.</p><br/><p>Gao Xiaosong was shocked.</p><br/><p>\"Are they kidding? Would these famous guests participate in such a degrading activity?\"</p><br/><p>\"See?\" Qin Guan pointed at the counter. \"I think you are wrong.\"</p><br/><p>Several famous guests in gorgeous outfits were fighting over who would go first.</p><br/><p>The award ceremony would start at five o'clock and last till late at night. If they didn't have dinner, the guests would starve. That was why the food trucks were so popular.</p><br/><p>Gao felt tired as he watched women in long dresses rush towards the poster ad. Was that the female heir of a company? Was that the only daughter of a tycoon? Was that the poster child of the fashion circle?</p><br/><p>They all betrayed their blogs for a hamburger.</p><br/><p>In 10 seconds, the line before the counter had started getting longer and longer. Gao turned around and realized that Qin Guan was eager to try. \"Will you join them?\" he asked him in fear.</p><br/><p>\"Ha! Of course not! Such a small hamburger would only be enough to satisfy a woman. We could have something from the buffet. My treat!\"</p><br/><p>Gao was worried that the Chinese fans might be scared off by the sight. This might be common for Americans, but not for him and Qin Guan.</p><br/><p>Thus, they joined the line before the only buffet in the stadium, which was the only decent source of food around.</p><br/><p>This was the most embarrassing award ceremony Gao had ever attended. In the short 10-meter distance between them and the buffet, they walked by five different groups of people. Americans didn't sit down. Instead, they got together and chatted happily.</p><br/><p>Qin Guan's popularity made the process even more difficult, as everyone walked up to them and tried to say something.</p><br/><p>Gao had no time to say anything as they got stuck in the crowd. His only aim was to get some dinner before all the food was sold out.</p><br/><p>When they finally reached the buffet, there were only three things available: pizza, salad and soft drinks.</p><br/><p>To prevent Qin Guan from starving and posing by the McDonald's poster, Gao bought some delicious pizza and a BBQ chicken for him.</p><br/><p>As soon as there was food in his hands, Qin Guan fell silent and found a quiet corner to enjoy his dinner.</p><br/><p>The two of them sat down in the back row and put the pizza box on the arms of their chairs, which they used as a temporary table. They could see the crowd clearly from there.</p><br/><p>\"Look over there, Gao! That guy must be the chief editor of V magazine!\"</p><br/><p>\"I think those girls are from the Upper East Side. I saw them at the fashion week.\"</p><br/><p>Gao burst into laughter when he saw the girls from the Upper East Side. They were elegant and beautiful, but they had really low IQs.</p><br/>\n</div>"}