{"title": "Chapter 941: A Gorgeous Military-Style Outfit", "id": 941, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-941-a-gorgeous-military-style-outfit", "volume_title": "Volume 10", "body": "<h1>Chapter 941: A Gorgeous Military-Style Outfit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 941: A Gorgeous Military-Style Outfit</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>\"Hi, Qin Guan. I'm the director of CBS. May I have a private word with you? It will only take five minutes.\"</p><br/><p>\"No problem.\"</p><br/><p>\"Could you walk on our red carpet?\"</p><br/><p>\"What do you mean?\"</p><br/><p>\"I mean the one that's meant for the stars. Madonna and Britney will walk on the same carpet.\"</p><br/><p>\"That wouldn't be proper. I'm neither a musician nor a nominee. People will think I'm showing off.\"</p><br/><p>What's wrong with that? If Nicholas Cage was here, I would have asked him to do the same. It's all about the audience ratings, bro!</p><br/><p>The director nearly cried out in exasperation. Qin Guan didn't want to embarrass him.</p><br/><p>\"I could be the last one to walk on it so I can avoid breaking the rules.\"</p><br/><p>\"Really? You are so nice, Qin Guan. I'm a big fan of yours!\"</p><br/><p>It's too late for flattery now.</p><br/><p>Meanwhile, groups of fans had started gathering around the entrance. Although they couldn't get inside, they still wanted to cheer on their idols before they entered the stadium.</p><br/><p>Qin Guan's fans got together and started talking about something. They were holding banners and posters with Qin Guan's face.</p><br/><p>\"Does this mean that Qin Guan has published an album?\"</p><br/><p>\"I have no idea. Could he have been nominated for a Grammy?\"</p><br/><p>\"Maybe the organizers invited him to perform.\"</p><br/><p>\"This is not his domain. I hope he is sure about his abilities before he gets on the stage.\"</p><br/><p>\"Maybe he is shooting a film in the area...\"</p><br/><p>Fans of other idols were also talking in confusion.</p><br/><p>\"Ah! There he comes!\"</p><br/><p>Qin Guan showed up at the red carpet for the reporters. Gao Xiaosong, who was right next to him, was ignored by everyone. Qin Guan was wearing a military style uniform that made his body look even more straight.</p><br/><p>His thin waist and slender legs looked amazing. His unique masculine hormones overwhelmed everyone. Armani had incorporated the 2007 vintage military style to its spring collection.</p><br/><p>The feedback was very positive. It was easy to guess that this style would become popular in the following year.</p><br/><p>\"Qin Guan! We're here!\"</p><br/><p>The flag of Qin Guan's fan club was floating in the wind. \"I love the Grammys!\"</p><br/><p>\"Qin Guan! We got tickets!\"</p><br/><p>\"See you there!\"</p><br/><p>\"Did you film that?\" the director asked the cameraman nervously.</p><br/><p>\"Yes.\"</p><br/><p>\"Okay. Tell the assistant to let the stars walk along the carpet. If a star walks by without being welcomed, we could just play back Qin Guan's entrance.\"</p><br/><p>\"Got it!\"</p><br/><p>Qin Guan had broken through every obstacle and finally entered the stadium. He thought he would be able to rest in his seat at last, but the scene he faced inside shocked him.</p><br/><p>At film award ceremonies, people would usually find their seats by looking at their place cards. As soon as the host got on the stage, silence would prevail.</p><br/><p>The Grammys were different though.</p><br/><p>It was time for dinner, and Americans never missed dinner for anything, so food trunks could be seen everywhere in the stadium.</p><br/><p>Qin Guan and Gao Xiaosong made their way through the crowded entrance and saw some sponsors preparing something in the broader space inside.</p><br/>\n</div>"}