{"title": "Chapter 947: Acquaintance", "id": 947, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-947-acquaintance", "volume_title": "Volume 10", "body": "<h1>Chapter 947: Acquaintance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 947: Acquaintance</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>After carefully reading the material, Qin Guan got a general idea about his job. Actually, what he had to do was quite simple. He would only be a guest star after all.</p><br/><p>There would be three to four preliminary rounds, each round including a different test for the designers. Sometimes, they had to make clothes using non-traditional materials such as waste, art supplies, or even fruit and vegetables.</p><br/><p>Sometimes, they had to make clothing for a specific person. Qin Guan would be that specific person. He would be the test of the second round.</p><br/><p>There was no style limit, so the designers could make anything they thought would suit Qin Guan.</p><br/><p>It was actually a smart test. Thanks to Qin Guan's outstanding looks and popularity, there were many designers that longed for such a chance. Those unknown contestants would achieve their dream through the show.</p><br/><p>One could imagine how many professional designers would envy such a chance and how many audience members would scream before their TVs as soon as they saw Qin Guan.</p><br/><p>This selling point would help the program achieve unprecedentedly high audience ratings and be publicly praised by the fashion circle.</p><br/><p>That explained why NBC wanted to spend millions of dollars for Qin Guan to appear on the show. They would make more profit through that investment.</p><br/><p>Thus, all Qin Guan had to do was show up at the beginning of the program. Later, he would select three to four designers for the final, which would be closely connected to the New York Fashion Week.</p><br/><p>The designers would work as a team to design a series of outfits for a New York Fashion Week show that would be held in Brian Park.</p><br/><p>This would also be a part of Qin Guan's job. His final appearance on the program would be as easy as watching a fashion show.</p><br/><p>This was not work for Qin Guan. Before the fashion week, he would try on some Armani suits, so that the designers would get a chance to meet the senior designers working for Armani.</p><br/><p>When the news was released, the competition would become fiercer than ever.</p><br/><p>Fu Shen was really satisfied with the arrangement. He wanted to see the designers fight as if their lives were on the line. The fact that he had succeeded in bringing Qin Guan on the show had made the senior executives of NBC think higher of him. Now he would get more chances to develop his career.</p><br/><p>Fu Shen was lost in his own world, when Qin Guan suddenly patted his shoulder.</p><br/><p>\"You have wonderful rewards for the winners. 100,000 dollars for brand establishment, advertisements in ELLE, training classes at top brand studios... This must be very alluring for a greenhand. Are there any requirements for applicants? I'd like to send my own designers. Could I get some special treatment for my own people?\"</p><br/><p>Fu Shen nodded immediately. \"Of course. All they have to do is pass the first review of the judge committee, I'll be in charge of the rest of the process. They have to be talented though. Our show will be broadcast all over the country.\"</p><br/><p>\"Of course. All my employees are talented.\"</p><br/><p>The show will be just in time for LESS/MORE.</p><br/><p>As Wang Liying negotiated with Fu Shen, Qin Guan closed his eyes to cultivate his spirit. Suddenly, he felt a pair of soft hands cover his eyes.</p><br/><p>\"Guess who it is.\"</p><br/><p>\"I have no idea,\" Qin Guan answered honestly.</p><br/><p>Before the woman could get angry, he added smartly, \"But judging by your wonderful voice and soft hands, you must be a beautiful lady.\"</p><br/><p>\"Okay, I'll let you go. I'm flattered.\"</p><br/><p>Qin Guan turned around and saw two women standing behind him. One of them was German supermodel Heidi Klum, who was a Victoria's Secret Angel and the founder of her own brand. Her 177-centimeter height allowed her to cover Qin Guan's eyes.</p><br/><p>The other woman was Qin Guan's acquaintance Nina Garcia, who was the chief editor of the American edition of Marie Claire.</p><br/>\n</div>"}