{"title": "Chapter 954: Grandpa And Grandchild", "id": 954, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-954-grandpa-and-grandchild", "volume_title": "Volume 10", "body": "<h1>Chapter 954: Grandpa And Grandchild</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 954: Grandpa And Grandchild</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Soon, the guy with the long hair joined the losers' club.</p><br/><p>Yes, the winner was GIN. The bald man had beat his opponents with a small advantage and won that great honor.</p><br/><p>As a sponsor, Ford provided the show with a sports car. This was nothing for the company. Plus, the show would help advertise their fashionable cars.</p><br/><p>It was Qin Guan who had introduced Ford to NBC. GIN would also get some money and advertising resources.</p><br/><p>The celebration was still going on as Qin Guan and Wang Liying got their cheque backstage. Even though he was a billionaire, Qin Guan still cared about money. He counted the zeroes on the cheque carefully before Fu Shen.</p><br/><p>\"We are old schoolmates, Qin Guan. Are you really afraid that I would cheat you? What did you think of my proposal?\"</p><br/><p>Qin Guan handed the cheque over to Wang and grinned at Fu.</p><br/><p>\"It's not that good. I'm really busy at home. I have no time to be a permanent guest on the show. Plus, one beautiful supermodel is enough. I'm too busy to stay on the show.\"</p><br/><p>\"Will you return to China?\"</p><br/><p>\"Of course! This was only a business trip. I have another task to take care of back at home after the Venice Festival.\"</p><br/><p>\"It seems like you are satisfied with an ordinary life.\"</p><br/><p>\"Of course. Now, I only have one thing left to do in my life.\"</p><br/><p>\"What do you mean?\"</p><br/><p>\"Have a baby!\"</p><br/><p>This was an innate concept of the Chinese. Even elderly people felt revived when they had a grandchild. A baby completed their lives in every way.</p><br/><p>Cong Nianwei's father was such an elderly person. The fundamental reason behind his approval of Qin Guan's proposal was his belief that a woman should give birth to a child while she is still young.</p><br/><p>Everything Qin Guan had said after that had been completely lost on Cong Nianwei's father. He had only kept his grandson in his memory.</p><br/><p>Although their parents knew that the couple couldn't have a baby right after getting married due to their tight schedule, they still dreamed of having a grandchild.</p><br/><p>What would it be like? Would it be similar to being a father or a mother? Would it be a boy or a girl? What about its personality?</p><br/><p>A baby was full of possibilities.</p><br/><p>Given the chance, they would beat about the bush in a blatant way. Thus, Qin Guan had been brainwashed by his parents.</p><br/><p>Cong Nianwei was his home. As soon as her project was finished, he would create a new life with her.</p><br/><p>What about work though? Sorry, my employees. Forgive me...</p><br/><p>Fu, who was a workaholic, couldn't sympathize with Qin Guan. Soon, Qin Guan packed his luggage and set out for Venice.</p><br/><p>While he was at the airport, he received a private call.</p><br/><p>\"Hey, Brother Qin. It's Jay Chou.\"</p><br/><p>\"I know. Why are you calling me? Did you succeed with your great shocking event? Did you want to show off?\"</p><br/><p>\"No. The trends of the entertainment circle have changed, and so has the public's feedback.\"</p><br/><p>\"Are you kidding? You do not own the entertainment circle. It will never follow your directions.\"</p><br/><p>\"Stop!\" Jay nearly cried out. \"Let me finish! At first, my efforts worked and things developed in the right direction. However, a big event took place in the music world a few days ago and attracted the public's attention!\"</p><br/><p>\"What's that?\"</p><br/><p>\"You stayed too long in the US. Stefanie Sun was kidnapped in Egypt!\"</p><br/><p>Was he kidding? According to the media, she was supposed to be preparing for her new album. How could she have been kidnapped in Egypt?</p><br/>\n</div>"}