{"title": "Chapter 959: The Venice Film Festival", "id": 959, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-959-the-venice-film-festival", "volume_title": "Volume 10", "body": "<h1>Chapter 959: The Venice Film Festival</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 959: The Venice Film Festival</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>Qin Guan let down his guard as soon as he got out of the car at the grand venue. This had to be the most crowded film festival he had ever participated in. Not one of the most crowded, but the most crowded.</p><br/><p>As the permanent venue of the festival, the Lido Film Palace was considered the holy hand of indie films. It had actually been especially designed to meet the demands of the festival. Even under normal circumstances, the red carpet and the golden lion standing at the center of the square were dazzling under the scorching sunshine of Italy.</p><br/><p>Everything there was about indie films. The old black-and-white photos and posters made everyone feel nostalgic. Although the adjacent Westin Hotel was not the most luxurious hotel in Venice, tourists liked to stay there during their trip.</p><br/><p>That holy land was as crowded as the temple fair during the Spring Festival in China. After the ceremony, one could find hundreds of shoes there.</p><br/><p>As Qin Guan got out of the car, he tried to look calm. When he waved at everyone, he heard screams in response.</p><br/><p>Cameras and cell phones were sparkling around him as people shouted and screamed from all directions.</p><br/><p>This was Qin Guan's most confusing experience at a red carpet event. People watched him as he walked at a steady pace with a gentle smile on his face. He greeted everyone without exception.</p><br/><p>Actually, anyone who was close to him would be able to see that he was detached. He was only relying on his instincts.</p><br/><p>Qin Guan ignored the flashes and screams and tried his best to walk to the end of the carpet. The handsome policemen couldn't do anything to help him. They were trapped in the crowd, so they were unable to protect anyone or even fend for themselves.</p><br/><p>Fortunately, Qin Guan walked the entire length of the carpet successfully and entered the hall. Most of the seats were already occupied. Ang Lee and Jiang Wen were sitting next to each other and talking about something happily.</p><br/><p>This was a typical seating arrangement at the Venice Festival. Directors with close relationships would be seated close to each other to facilitate negotiations.</p><br/><p>Qin Guan's seat was between the two crews, arranged deliberately this way by the organizers.</p><br/><p>There was nothing unique about the Venice Film Festival. The awards, which were fewer than at the other two festivals, included the Golden Lion, the Silver Lion, the Best Actor Award, the Best Actress Award, the Special Award and the Golden Osellas. Despite their small number, their value was shockingly high in the indie film circle.</p><br/><p>Thus, the audience was stupefied when the host announced the nominees for the Best Actor Award.</p><br/><p>\"According to the tradition of the Venice Film Festival, if an actor applies for the Best Actor Award with two already shortlisted films, only one of them will be selected for the final round. You must know who the lucky guy is. Yes, it's Qin Guan from China! Two of his films were selected for the next round. I have to express my apology to Director Jiang Wen, though. After thorough deliberation, the judges decided that Qin Guan will compete with the film 'Lust, Caution'.\"</p><br/><p>You don't need to apologize. I'm not on the list of nominees for the Best Actor Award.</p><br/>\n</div>"}