{"title": "Chapter 951: Demand Exceeds Supply", "id": 951, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-951-demand-exceeds-supply", "volume_title": "Volume 10", "body": "<h1>Chapter 951: Demand Exceeds Supply</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 951: Demand Exceeds Supply</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>He naturally wanted to warn his new friend.</p><br/><p>\"Do you know why I joined the show?\"</p><br/><p>\"I have no idea.\"</p><br/><p>To get famous? Because you had too much free time?</p><br/><p>\"Because it's the future. The show will bring together all kinds of stars from various fields and attract more and more sponsors. When its influence reaches a certain level, the designers that started their career this way will gradually form a new circle. It will become a striking fashion trend. That's why you have to captivate them with your charm. You should become their first runway choice. This is how supermodels market themselves.\"</p><br/><p>\"Got it. Thank you, Tim.\"</p><br/><p>Your advice would probably be useful for ordinary supermodels, but it isn't for me. When those unknown designers reach Armani's or Chanel's level, they can get back to me.</p><br/><p>In the meantime, all Qin Guan wanted to do was enjoy the rare sunshine of New York and put a full stop to his trip to America.</p><br/><p>In an effort to support native designers, the New York Fashion Week and Project Runway had signed a private contract that there would be a specific runway show planned for the show's final during the fashion week.</p><br/><p>The contestants would be able to participate in all the activities and castings of the fashion week independently. This meant that Project Runway would become an independent brand and take on all kinds of tasks along with other brands.</p><br/><p>The program had just finished its fourth season, so its influence and popularity couldn't rival that of internationally famous brands.</p><br/><p>Fashion insiders just saw the show as an alternative way to spend their time. They didn't pay that much attention to the show's invitations.</p><br/><p>In order to expand its influence, the show's producers had asked the organizing committee of the fashion week for a venue that could hold 300-400 guests. The value of the invitations dropped because of this. The fewer the invitations, the more valuable they would be. This was just common sense.</p><br/><p>Unlike the show's previous seasons, this time Fu Shen had grabbed every opportunity to promote the show and strengthen its status.</p><br/><p>Halfway through the fashion week, all the participants were trying to acquire an invitation to the Project Runway final.</p><br/><p>Fu Shen had released the news gradually and used a successful marketing strategy.</p><br/><p>This time, he didn't send all the invitations out at once. Instead, he came up with a plan.</p><br/><p>During the first round, the designs with the least negative feedback from Tim would be displayed on the stage. Fu had sent 50 invitations to Tim's enemies within the circle. All those people had been more or less criticized by Tim in the past, so they would attend the show just to have a reason to make fun of Tim.</p><br/><p>As expected, they accepted the invitation immediately. Some of them even expressed their gratitude for being invited.</p><br/><p>That was Fu's first step. He didn't follow up a victory with a hot pursuit though.</p><br/><p>When other critics who had been insulted by Tim heard the news and approached the show's producers, the staff informed them regrettably that they had run out of invitations.</p><br/><p>\"What? But it's such a large venue. Have you sent out all the invitations?\"</p><br/><p>\"Yes, sir,\" an assistant replied with her sweetest smile. \"We have sent all the invitations to fashion critics. If you are interested in our show, please leave us your business card. I can reserve an invitation for you for next season's final in advance.\"</p><br/><p>\"Will Tim still be on the show?\"</p><br/><p>\"Yes, he is our exclusive guidance counsellor.\"</p><br/><p>\"Okay, sign me up for the next season. I want at least two- oh no, three invitations.\"</p><br/><p>\"No problem. Please fill in this form. Your application will be prioritized. Congratulations! Your application is the 38th on the list. There will be seats reserved for you at the next final of our show.\"</p><br/><p>\"Thank you.\" The fat man left satisfied, wiping beads of sweat off his forehead.</p><br/>\n</div>"}