{"title": "Chapter 967: Be Careful Around Qin Guan", "id": 967, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-967-be-careful-around-qin-guan", "volume_title": "Volume 10", "body": "<h1>Chapter 967: Be Careful Around Qin Guan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 967: Be Careful Around Qin Guan</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p> Everyone shouted in unison.</p><br/><p> \"We want to see Qin Guan wear it!\"</p><br/><p> Are you kidding?</p><br/><p> \"Qin Guan! Qin Guan!\"</p><br/><p> Even Huang Xiaoming and Fan Pingping kicked up a fuss.</p><br/><p> \"We want to see his glamor, too. This is a robe of honor!\"</p><br/><p> \"Besides, it was designed by J Clothing. You are the brand's ambassador...\" Lin Zhiling added.</p><br/><p> Everyone on site fixed their eyes on Qin Guan eagerly. He couldn't do anything but stretch his hand out to Jing Boran.</p><br/><p> \"Just give me the hat and the cloak.\"</p><br/><p> \"No problem.\" The owner of the costume changed fast.</p><br/><p> Although he was wearing suit pants and leather shoes, Qin Guan looked like a real general in armor. Now everyone could see the difference between those young actors and Qin Guan.</p><br/><p> It was like the difference between an ugly duckling and a white swan. There was only one Qin Guan in the world!</p><br/><p> The camera was fixed on Qin Guan's mighty look. The fans before their TVs burst into tears. This was worth the wait. They all turned on their computers to share their delight with their friends.</p><br/><p> \"Let's comment on Qin Guan's first appearance on a talent show.\"</p><br/><p> \"I'm pleased to hear that Qin Guan was invited to be a guest judge on the show. This was his first participation in a TV program, but it was really satisfying for his fans, who have been eager to see their idol live and hear the latest news.\"</p><br/><p> \"As a loyal fan of Qin Guan's, I can say that his looks and figure are both natural. His films, photos and TV shows have not been subject to excessive editing or photoshop.\"</p><br/><p> \"Based on this live broadcast, I can conclude that it was a wise decision for Qin Guan to rarely participate in live TV shows. He is too busy with his work and he does not need the money. Actually, according to my analysis, he only participated out of kindness. Don't be surprised. I'll show you evidence.\"</p><br/><p> The writer posted a photo, in which Qin Guan was sitting next to Huang Xiaoming.</p><br/><p> \"Look at their feet. Their heads are almost at the same level, but Qin Guan's legs are longer than Huang's by a full 10 centimeters! What does this mean?\"</p><br/><p> \"That Huang has short legs?\"</p><br/><p> \"It means that somebody is faking his height! Let's look at them closer.\"</p><br/><p> \"The 10 young men on the stage will be analyzed later. Let's just talk about the two guys sitting together, who are the same age. While Qin Guan was absent from the Chinese mainland, the actor we promoted the most was Huang. He could be considered a male copy of Fang Pingping.\"</p><br/><p> \"What happens when the most handsome guy in China encounters the most handsome guy in the world? If I was Huang, I would calm down and try to improve my acting skills. Then, I would select a film for a good actor, instead of a handsome one. It would be a shame for anyone to meet Qin Guan without an advantage.\"</p><br/><p> \"After this live broadcast, all Chinese acting agents will turn down any invitation for their actors to show up anywhere with Qin Guan. If somebody wants to gain popularity, they should be careful around Qin Guan.\"</p><br/><p> The truth was really funny!</p><br/><p> Some fans agreed, while others did not. The topics about Qin Guan started increasing online. Even foreign fans got involved in the conversation.</p><br/><p> Although Qin Guan's job was over, he did not leave. In order to avoid the crazy fans, all the judges waited backstage until the audience left. They took advantage of this chance to communicate with each other and expand their social circle.</p><br/>\n</div>"}