{"title": "Chapter 964: The Meaning Of A TV Show", "id": 964, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-964-the-meaning-of-a-tv-show", "volume_title": "Volume 10", "body": "<h1>Chapter 964: The Meaning Of A TV Show</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 964: The Meaning Of A TV Show</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>All of them had thick bangs. There was no exception. Most of them were wearing white clothes covered in silver paillettes. If one ignored their weak chests, the boys actually had nice features.</p><br/><p>It was a pity that they lacked good taste. The style of the Paris Fashion Week had been deeply engraved in Qin Guan's mind.</p><br/><p>When he saw the protagonists of the show, who were the top three contestants around the world, Qin Guan thought the organizers were very smart.</p><br/><p>They had dressed the other seven boys in ugly clothes to make the top three stand out. Their black fitting suits made them look handsome and gave them a better chance of getting a close-up, thus creating the illusion that they were the most outstanding among the top 10.</p><br/><p>As the grand vocal cycle ended, a video was projected on the screen. Fans from China and around the world expressed their best wishes for the show. As they watched fans from America speak, Fan whispered to Qin Guan, \"Is the show that popular in America?\"</p><br/><p>\"No idea. I was too busy working to pay attention to it.\"</p><br/><p>I shouldn't have pulled the rug from under their feet.</p><br/><p>When the video ended, the host began to introduce the judges to the audience. The program had put a lot of effort into inviting guests that represented the younger generation of the film and TV circle.</p><br/><p>The host read the familiar names out loud one by one.</p><br/><p>\"I think everyone knows this guy. He is one of the most handsome men in China. Who is he?\"</p><br/><p>\"Huang Xiaoming!\" the audience shouted. Huang stood up, feeling a little embarrassed.</p><br/><p>\"I'm flattered, but I do not deserve this title. Qin Guan is sitting right next to me!\"</p><br/><p>Lao Liang, who was the host, had proven himself to be the pillar of Dragon Television.</p><br/><p>\"Don't worry,\" he answered smartly. \"I'll introduce him as one of the most handsome men in the world later.\"</p><br/><p>\"Ha ha!\"</p><br/><p>The judges and the audience burst into laughter. Fans started waving glow sticks from the back row. They were all caught off guard by Qin Guan's participation.</p><br/><p>Back in April, the judges' list for the final had habitually started appearing in the media every day, creating some kind of trend. At the time, Qin Guan had not been on the list, as he had been abroad. The organizers had not been hoping that he would return, so they had been just as surprised as the fans.</p><br/><p>In the end, they had decided to keep the news a secret until the live broadcast. All the fans left go of their differences and united. They used glow sticks and LEDs to form Qin Guan's name. This was their way of expressing their love for him.</p><br/><p>All the contestants, including Jing Boran, Ren Qiaoliang and Li Yifeng, were ignored. Who would be interested in them when Qin Guan was there?</p><br/><p>The atmosphere became awkward, but the host remained calm and the director was confident.</p><br/><p>What was the goal of the program?</p><br/><p>No one cared about discovering new talent for the entertainment circle, finding lovely boys for girls to fall in love with, or realizing the dreams of ordinary people. Their goal was to get high audience ratings, find sponsors, influence the audience and sell the copyrights of the show.</p><br/><p>This was the objective of the program.</p><br/><p>Suddenly, the audience ratings rose dramatically, surpassing those of Hunan Television. It was not a slow process, but a quick escalation.</p><br/>\n</div>"}