{"title": "Chapter 971: A Good Script", "id": 971, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-971-a-good-script", "volume_title": "Volume 10", "body": "<h1>Chapter 971: A Good Script</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 971: A Good Script</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>As the pillar of Huayi, Director Feng had never had to worry about finding capital.</p><br/><p>\"We should rethink the leftover scripts. Indie films are not profitable. Most people won't pay to watch them, but they are necessary for the Chinese market. Director Chen Kaige is sincere.\"</p><br/><p>Why do all of you keep glancing at me? Am I such a narrow-minded man?</p><br/><p>Qin Guan was speechless. He had filed that lawsuit because the director had done something wrong. This hadn't been personal. He considered the matter resolved. Qin Guan thought of himself as a reasonable man that never passed on his anger to others.</p><br/><p>However, everyone was looking at him now, so he had to take a stand.</p><br/><p>\"In my opinion, Chinese films should develop all around. The box office is only one factor. The operator of the company could just carry out the original plan. I have no objections to that.\"</p><br/><p>The person in charge of public relations let out a long sigh of relief. She was glad to see the shareholders and directors talk harmoniously. When they didn't, things were tougher for her.</p><br/><p>\"Okay. Then we can get back to Director Chen about his proposal for 'Mei Lanfang'.\"</p><br/><p>\"Chen has gone through lots of difficulties during the past few years. After that Waterloo, it took more than one year for him to prepare for his next film, yet he has finally returned to his field of expertise. That's great. It's much harder for directors to transform than it is for actors.\"</p><br/><p>\"Yes. Not everyone is good at shooting commercial films. Chinese directors should stick to their own style and principles.\"</p><br/><p>This was just polite conversation. In fact, if they were given enough money and good actors, every director would transform, regardless of their style. Nobody would pass on such a chance.</p><br/><p>\"The final project is a franchise collaboration with Tiancheng. It's a big production, so a single company wouldn't qualify. If necessary, we'll unite agencies from Hong Kong, Macau and Taiwan. The franchise includes two films, each one for every year. John Woo will direct. The actors are still being cast.\"</p><br/><p>\"All the departments can come up with suggestions for the casting. We'll leave Qin Guan's issue for later.\"</p><br/><p>Everyone nodded in agreement.</p><br/><p>\"Now, let's talk about TV series. Nowadays, the market is filled with martial art and historical shows. The Ministry of Culture has specifically pointed out that film and TV production companies should be more creative and shoot shows about ordinary people or army life.\"</p><br/><p>\"I have two good scripts in my hands. One of them I got thanks to Qin Guan. The other one came from Director Zhao Baogang. Everyone must be familiar with him.\"</p><br/><p>Thanks to me?</p><br/><p>Although Qin Guan was confused, he didn't break in. He just listened to the speaker.</p><br/><p>\"'Struggle' is a city drama about young people's lives. It stands out among the scripts, as it has nothing to do with family or neighborhood relations. Plus, we do not have to invest much in it.\"</p><br/><p>\"Yes, that's pretty good.\"</p><br/><p>After a short discussion, the show was approved.</p><br/><p>\"The other show is more controversial. Are you familiar with former General Tan from the Beijing Military Region?\"</p><br/><p>Who?</p><br/><p>\"I heard that he was your neighbor in Yantai...\"</p><br/><p>Grandpa Tan? Where was Grandpa Sun then?</p><br/><p>\"In 2002, the Beijing Modern Drama Troupe made a theater play out of it. Its original name was 'Erna Raid'. It was awarded at the Chinese Theater Festival. I wonder why the old general sent it to you. The scriptwriter also agreed to the proposal.\"</p><br/><p>\"The investment will be left up to you.\"</p><br/><p>A good neighbor was better than a brother in another town. Qin Guan nodded repeatedly in excitement. He decided that he would both invest and star in the project.</p><br/><p>Actually, this was treasure. If it was made into a TV series, it would win even more awards. Its literature and cultural awards already indicated its distinction.</p><br/><p>This was Qin Guan's opportunity to star in another classic and make profit from it.</p><br/><p>Qin Guan tried his best to calm down.</p><br/><p>\"I remember him. He is my neighbor. I value his trust, so I won't disappoint him. The budget is not much. I can cover it independently. Are there any regulations or sharing arrangements?\"</p><br/><p>\"Yes,\" an assistant replied.</p><br/><p>\"Okay.\" Qin Guan nodded. \"We will follow the company's rules and procedures.\"</p><br/><p>What a considerate shareholder! He was even willing to take a risk for his company.</p><br/><p>The big drama was yet to come.</p><br/>\n</div>"}