{"title": "Chapter 975: Air China", "id": 975, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-975-air-china", "volume_title": "Volume 10", "body": "<h1>Chapter 975: Air China</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 975: Air China</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p> The newly-built Olympic stadium looked like a beautiful landscape as Qin Guan faced the blue Water Cube and turned his back to the camera. His slender figure was the most outstanding stroke on the painting.</p><br/><p> He turned around and smiled, as if he had just met a long-lost good friend. The sky was clear and the breeze seemed to slow down. It felt like he was asking the audience, \"Are you here yet? I have been waiting for you for a long time.\"</p><br/><p> Anyone who saw his smile would reply, \"I'm sorry to have kept you waiting.\"</p><br/><p> \"Cut! Well done, Qin Guan. Thank you for your help.\"</p><br/><p> \"I'm flattered. I should be the one expressing my gratitude for the opportunity to reach people globally.\"</p><br/><p> \"No, you have really helped a lot...\"</p><br/><p> \"You are so polite, sir...\"</p><br/><p> Wang broke in and put an end to their conversation by handing Qin Guan his schedule.</p><br/><p> \"It's time to go, Brother Qin. We have an appointment with Air China.\"</p><br/><p> \"Really? Okay, let's go!\"</p><br/><p> When their car left the site, Qin Guan turned and told Wang, his heart still fluttering in fear, \"He was so emotional, I couldn't say no to him. That would be like bullying him. This is not right for me. I prefer a calm director.\"</p><br/><p> His wish came true soon. He found a calm director waiting for him in the lounge. The man didn't say a single word during the introduction. He only expressed himself by nodding or shaking his head.</p><br/><p> Even during the shooting, he used gestures or body language to express his feelings.</p><br/><p> Fortunately, Qin Guan was good at understanding and had experience in dealing with different kinds of directors.</p><br/><p> Plus, Air China was a generous company. They had offered Qin Guan free flights for 10 years. Although this money was just pennies for a rich guy like him, this showed the company's sincerity.</p><br/><p> They also wanted to accommodate Qin Guan's personal schedule and arrange their shooting during his next trip to America. Qin Guan decided to do his best for the film.</p><br/><p> He turned into a businessman again before the camera. He was wearing a suit and leather shoes as he got out of a red business car. There was even a Bluetooth headset hanging from his ears.</p><br/><p> He walked steadily, holding a silver suitcase in his hands, as if he was heading to an important business meeting.</p><br/><p> As soon as he entered the VIP lounge of Air China, the short film was finished.</p><br/><p> During the break, Qin Guan asked the staff a question.</p><br/><p> \"Do VIPs enjoy a free pick-up service? I had no idea about that.\"</p><br/><p> Although Qin Guan had a VIP Air China card, he had never used that service.</p><br/><p> \"All our VIP members can use that service after booking their tickets. Most people prefer using private cars, though. If you are interested in this service, we can provide you with a guide.\"</p><br/>\n</div>"}