{"title": "Chapter 973: The Sixth Fuwa", "id": 973, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-973-the-sixth-fuwa", "volume_title": "Volume 10", "body": "<h1>Chapter 973: The Sixth Fuwa</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 973: The Sixth Fuwa</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>As a promising young man from another field, he had naturally attracted the directors' attention. They felt uncomfortable watching such a young man idling around and flattering his wife.</p><br/><p>\"A young idler eventually becomes an old beggar. Mr. Qin has made great achievements, but he should still work harder.\"</p><br/><p>\"He seems too carefree.\"</p><br/><p>\"The Tourism Bureau will be producing an official promotional film for the Olympics. Isn't he an international award-winning actor? He could have a chance of participating in it. How many fans does he have?\"</p><br/><p>\"There are 90 million foreign users on his website.\"</p><br/><p>\"Good, we could use such an advantage. Don't you need help, Lao Gao?\"</p><br/><p>\"Of course. I think he would be perfect for the China Airlines video.\"</p><br/><p>\"I think he could portray Fuwa, the mascots of the Olympics.\"</p><br/><p>\"People always call him a lucky boy. He could be the sixth Fuwa.\"</p><br/><p>\"He will be a good resource of money. Ha ha!\"</p><br/><p>After a short discussion, the directors found a new way to make money.</p><br/><p>Qin Guan was unaware of his impending misfortune. He was talking with Cong Nianwei about having dinner later, when Wang pulled him away.</p><br/><p>\"Brother Qin, our studio has accepted some jobs for you.\"</p><br/><p>\"What? I have already told them that I'm on vacation. What jobs? Is it the money that blinded them?\"</p><br/><p>\"You'll get paid one penny for three films.\"</p><br/><p>\"What the f*ck?\"</p><br/><p>\"It's three promotional films for China Airlines, the Tourism Bureau and the Olympics. China Airlines is footing the bill.\"</p><br/><p>Okay, that wouldn't take him a long time.</p><br/><p>\"Fine. I'll do the Olympics film for Cong Nianwei's sake, but who would dare hire me without paying me?\"</p><br/><p>\"The National Tourism Administration is responsible for the promotion, publicity and national image of the 2008 Olympic Games in China. It's also in charge of the popularization of Chinese culture and China's influence on tourism. The video will air in hundreds of countries. It's a rare chance. Money is not important.\"</p><br/><p>Well, that sounds reasonable.</p><br/><p>\"But why did they approach me together all of a sudden? When did they inform our studio?\"</p><br/><p>They just had...</p><br/><p>Wang shot a look at the group of people who were leaving the site. She believed that they were responsible for the jobs. Sister Xue sounded just as confused on the other end of the line.</p><br/><p>When Qin Guan turned around and looked in the same direction, he saw one of the directors waving at him. An assistant next to him gestured at him to call them.</p><br/><p>Qin Guan realized who the source of his new job was.</p><br/><p>As he shared the story with Cong Nianwei, she burst into laughter.</p><br/><p>\"Why do you look so sad? Plenty of people would fight over such a chance.\"</p><br/><p>\"I wanted to stay with you and watch you work, but now I don't have any time. This could harm our relationship.\"</p><br/><p>You are just lazy, darling.</p><br/>\n</div>"}