{"title": "Chapter 997: My Wife Is Coming", "id": 997, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-997-my-wife-is-coming", "volume_title": "Volume 10", "body": "<h1>Chapter 997: My Wife Is Coming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 997: My Wife Is Coming</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The busy doctor abandoned Qin Guan, leaving his team with him. When Qin Guan returned to reality, he scanned his surroundings.</p><br/><p>There were simple military tents, busy doctors, nurses, and soldiers around him. The crowd shuttled back and forth orderly.</p><br/><p>\"Hey! How are you feeling? If you have nothing serious, you should get up and give your bed to the other patients,\" a nurse said as she walked over.</p><br/><p>When he saw the familiar uniform, Qin Guan smiled unconsciously. His smile scared his team.</p><br/><p>Is our boss okay?</p><br/><p>\"Tell me about the current situation.\"</p><br/><p>\"The first group has reached the first rescue spot. They are already busy helping the soldiers with the rescue missions.\"</p><br/><p>\"Well done!\" Qin Guan nodded in approval. \"When will the second supply arrive?\"</p><br/><p>\"It's on the way. Maybe the day after tomorrow. Oh, Boss Cong is also on her way here.\"</p><br/><p>\"What? It's too dangerous here!\"</p><br/><p>\"I heard that her design of a temporary residence has been approved. It will take a shorter time to build and it's more suitable for this environment. Plus, it will save a lot of money. It's an unprecedented innovation. As the main architect, she is the best person to oversee the construction here... She also heard about your accident...\"</p><br/><p>\"Who told her about it?\"</p><br/><p>\"She is worried about you. If she stays with you, then maybe you will relax...\"</p><br/><p>It was too late to blame anyone, so Qin Guan walked out of the tent and joined the busy crowd.</p><br/><p>\"Wow! Is that Qin Guan? The superstar?\"</p><br/><p>\"It's rare to see a guy like him work with people like us!\"</p><br/><p>\"He is an honest man!\"</p><br/><p>\"It's said that he donated a lot of money to the cause.\" Some reporters took precious photos of Qin Guan against the simple, bleak background.</p><br/><p>\"You are a ray of hope amid this disaster.\"</p><br/><p>Everyone felt a rare positive energy. In their opinion, this was the most beautiful moment in Qin Guan's career.</p><br/><p>\"Cheers! You are the best! We will be by your side forever!\"</p><br/><p>\"Qin Guan!\" As he looked up sweatily, Qin Guan saw the person he had missed the most. \"Wei! You really came here! That was really fast!\"</p><br/><p>\"I have no time to chat. We have a rescue team coming from Japan and some guys from international NGOs.\" Her work was much more important than his. As the designer of the temporary residence, she had to share all the relative documents with the foreigners. This would be the greatest acknowledgment of her work. Qin Guan was proud of China. The wisdom of the Chinese people was inexhaustible.</p><br/><p>These ruins were both the end of a life and the start of a new one. Many people's lives had become connected there. Thanks to the award-winning actor, the photos and news published by the reporters were filled with humanistic warmth. The children smiled in the pictures, while a young couple looked at each other shyly. No one paid attention to their two hands, which were interlocked.</p><br/><p>Be with me! I might have lost everything during this disaster, but you are my starting line.</p><br/><p>Where there was love, there was life.</p><br/><p>\"What are you waiting for? You should get married!\"</p><br/><p>Scared, the couple turned around and saw the award-winning actor waving at them.</p><br/>\n</div>"}