{"title": "Chapter 1002: Do You Want An Autograph, President Hu?", "id": 1002, "volume": 11, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-1002-do-you-want-an-autograph-president-hu", "volume_title": "Volume 11", "body": "<h1>Chapter 1002: Do You Want An Autograph, President Hu?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1002: Do You Want An Autograph, President Hu?</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>The foreign athletes left first, but some happy people stayed in the Bird's Nest. The group of national leaders stood out among the actors, who waited in line to shake hands with the leaders. Only one person among them was absent-minded.</p><br/><p>It's really late at night. Will my honey be afraid at home? She is pregnant now. I have to stay with her...</p><br/><p>\"Qin Guan?\"</p><br/><p>\"Yes?\"</p><br/><p>\"I have watched your films. They are pretty good.\"</p><br/><p>\"Thank you. Do you want an autograph?\" Qin Guan replied unconsciously. Lang Lang, who was standing next to him, looked scared. He suddenly started pulling at Qin Guan's robe like crazy.</p><br/><p>When Qin Guan came back to his senses, he realized that the man in front of him looked familiar. Of course! He saw the man every day on the Network News Broadcast!</p><br/><p>\"How are you, Secretary General? May I have an autograph?\"</p><br/><p>\"Ha! You are so funny, Qin Guan!\" Hu took a pen out of his chest pocket.</p><br/><p>\"Where?\"</p><br/><p>\"Right here!\" Qin Guan took off his white robe immediately.</p><br/><p>This could be a gift for my baby...</p><br/><p>Hu wrote down several big characters in lively cursive writing. Before Qin Guan could come back to his senses, Hu's secretary handed him a piece of paper. \"Your signature, please.\"</p><br/><p>Are you kidding me?</p><br/><p>Only when he left the stadium, did Qin Guan realize the truth. Wang drove him home as fast as she could. She didn't want to do anything but find a corner to calm down.</p><br/><p>There was still a light on by their bed when he got home, but Cong Nianwei had fallen asleep. Qin Guan put the robe carefully in his closet. Only clothes of significance were stored there, including his first Armani Haute Couture and Cong Nianwei's wedding dress. Now, another piece was added to the collection.</p><br/><p>Actually, the costume belonged to the organizing committee, so he'd had to argue with the staff in order to take it home.</p><br/><p>I should have asked the president to sign on my vest!</p><br/><p>Qin Guan turned around and saw Cong Nianwei's sleeping face under the soft light. Happiness suddenly filled his heart.</p><br/><p>Sweet dreams, mother of my child!</p><br/><p>The next morning, Cong Nianwei woke up and found him cooking in the kitchen.</p><br/><p>\"Morning! What would you like to have? Chinese breakfast or Western breakfast? You should watch what you eat from now on.\"</p><br/><p>\"Anything will do.\"</p><br/><p>\"Oh, I nearly forgot. Here you are!\"</p><br/><p>He handed Cong Nianwei several phones.</p><br/><p>\"What are these?\"</p><br/><p>\"Starting today, I won't be spending time on any trivial work. I will be the perfect stay-at-home husband until you give birth to our baby.\"</p><br/><p>\"What? Have you shared this news with your staff?\"</p><br/><p>\"They can take care of themselves. I have faith in them.\"</p><br/><p>\"But I have to work. I'm only two months along!\"</p><br/><p>\"Don't worry, you can do anything you like. I'll just follow you around.\"</p><br/><p>\"Soldiers Sortie\" took advantage of the Olympics and premiered during the same period, soon becoming popular all around the country. Characters and lines from the show quickly went viral online.</p><br/><p>It was a male show without any women, so fan clubs were gradually founded for each actor. Some people liked Chen Sicheng, who looked like an ordinary person. Others preferred Duan Yihong, who always smiled evilly. However, no one could be compared to the scholarly Wu Zhe, who was portrayed by Qin Guan.</p><br/><p>Qin Guan's image in a military uniform impressed his fans once again. After a long while, they came back to reality and realized that there were no more news about their idol. He didn't attend any events or prepare for an upcoming film. His website remained silent for a long time. Qin Guan seemed to have disappeared from the circle like the wind. His firm, on the other side, was functioning as usual. If it wasn't, Brother Wang would have called the police.</p><br/>\n</div>"}