{"title": "Chapter 1000: Another Ending", "id": 1000, "volume": 10, "url": "http://boxnovel.org/rebirth-how-a-loser-became-a-prince-charming-chapter-1000-another-ending", "volume_title": "Volume 10", "body": "<h1>Chapter 1000: Another Ending</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1000: Another Ending</p><br/><p>Translator: Lan_ Editor: Efydatia</p><br/><p>What?</p><br/><p>Qin Guan had worked day and night in the disaster area without paying any attention to his looks. However, he had taken a bath at home before rushing to the rehearsal.</p><br/><p>After braving the wind and dew for so many days, his skin had become darker and tougher. Qin Guan was not the same person Director Zhang remembered.</p><br/><p>\"Don't laugh at me, director! Just tell me about my assignment.\"</p><br/><p>Director Zhang buried his face in his hands. \"Your assignment is to get your fair skin back!\"</p><br/><p>He had forgotten to turn off the loudspeaker, so everyone around the site heard him and burst into laughter. The news of Qin Guan's return spread around, becoming another striking headline.</p><br/><p>At the time, all news had been about the earthquake. All the Chinese people had been concentrated on that issue. They had even forced Sharon Stone to take back her inappropriate comments at the Cannes Film Festival. The world-renowned star had found the gates of China closed before her.</p><br/><p>All the foreign products she represented changed their posters immediately and replaced her with other stars. She had said that this was karma for the Chinese people, so no apologies on her part could fix that. She would just have to bear the consequences of her words.</p><br/><p>Qin Guan had returned just in time. Suddenly, positive news filled the media.</p><br/><p>\"Qin Guan left the disaster area to join the Olympics ceremony rehearsal!\"</p><br/><p>\"We look forward to his performance in the opening ceremony!\"</p><br/><p>There were also some different opinions.</p><br/><p>\"Did he give up his work half-way?\"</p><br/><p>\"Did he decide to join the Olympics rehearsal to escape the hardships in Sichuan?\"</p><br/><p>\"Which job is more important?\"</p><br/><p>As soon as those comments showed up, Qin Guan's staff, fans and workmates in the disaster area stepped forward and clarified the matter.</p><br/><p>\"Have you ever seen a superstar like him drive a truck? He is just as good a driver as he is an actor!\"</p><br/><p>He actually had been a good driver in his previous life.</p><br/><p>\"My girlfriend and I were one of the 36 couples that got married along with him. No matter what people say, I will admire him for the rest of my life. He returned to Beijing to stand up for everyone in Wenchuan. He accepted this assignment for the common good, not for personal profit.\"</p><br/><p>The moving posts and pictures made the people who had doubted Qin Guan's motive feel ashamed.</p><br/><p>Qin Guan had no idea about this debate, as he had dedicated himself to whitening his skin. He had never paid this much attention to his skin before.</p><br/><p>Here I come, Olympics!</p><br/><p>After working for several months, he was finally pushed to the stage by a satisfied Director Zhang.</p><br/><p>The Beijing Olympics started at 8:00 p.m. on August 8th, 2008 under the lights of the Bird's Nest. The audience ratings in China, Japan, South Korea and other Asian countries reached 40%.</p><br/><p>This was a new record in the history of the Olympics.</p><br/><p>The drum beats tagged on the audience's heart strings, showing China's progress to becoming a superpower. The essence of the Chinese culture was unfolded before the world in a splendid way. There were paintings, calligraphy, music, opera...</p><br/><p>The thousands of people performing were like a mighty ocean, while the solo of a single person was able to move the viewers' emotions.</p><br/><p>After the group dance, silence prevailed in the stadium. A dazzling galaxy appeared in the square, so mysterious that everyone was captivated by it. This was the beginning of the next chapter.</p><br/><p>\"Back in ancient times, China had been called the nation of gentlemen...\"</p><br/><p>A person walked along the galaxy slowly in a loose white costume. He looked like an immortal.</p><br/><p>Qin Guan dominated the stage. His charm and power could lift the whole stadium up.</p><br/><p>When he took his last step, he completed his assignment at the Olympics. He was the representative of Chinese rituals and music. The audience got so lost in his charm, that it was unable to come back to its senses.</p><br/><p>\"Director, the audience ratings just increased!\"</p><br/><p>\"That's it! Congratulations, Qin Guan!\"</p><br/><p>Qin Guan was hiding in a corner, calling his wife.</p><br/><p>\"Darling, did you return to Beijing? Did you watch my performance on TV? Great, you're back! Starting right now, I won't be accepting any more work. What for? For our honeymoon, of course! We are newlyweds!\"</p><br/><p>Cong Nianwei smiled on the other end of the line. \"Our honeymoon will have to be postponed indefinitely.\"</p><br/><p>\"I know. You must get the Asian Design Award. We can attend the award ceremony together.\"</p><br/><p>\"No, that's not why, although I did win the award. You are going to be a father! I'm two months along already. Hey! Qin Guan! Are you still there?\"</p><br/><p>Qin Guan was laughing like an idiot.</p><br/><p>\"I'm going to be a father! I love you, honey!\"</p><br/><p>Ten years after his rebirth, Qin Guan had finally realized his dream. He wanted to thank all his companions along the way, including those who loved him, those who hated him, his friends and his family.</p><br/><p>This was his life. He regretted absolutely nothing.</p><br/>\n</div>"}