{"title": "Chapter 3: The World’s Most Terrifying Martial Arts", "id": 3, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-3-the-world%E2%80%99s-most-terrifying-martial-arts", "volume_title": "Volume 1", "body": "<h1>Chapter 3: The World’s Most Terrifying Martial Arts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 3: The World’s Most Terrifying Martial Arts</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Lin Fan opened his eyes, and his expression immediately changed. Upon opening his eyes, several panicked looking faces appeared before him. This could be incredibly traumatizing for anyone.</p><br/><p>“What are you all doing?” Lin Fan’s voice shook slightly, ‘Did these guys possibly do some unspeakable things to me while I was unconscious?’</p><br/><p>Such as...</p><br/><p>“Big Bro, you’re finally awake! I knew you wouldn’t be defeated so easily.” One of the boys surrounding Lin Fan said excitedly.</p><br/><p>“Huh...”</p><br/><p>Lin Fan blanked for a moment, ’What’s up with these guys, and since when did I become their Big Bro? That’s right, the system should be up. I need to analyze it. Let’s ignore these guys for now and directly open it up.’</p><br/><p>Name: Lin Fan.</p><br/><p>Level: 1</p><br/><p>Experience Points (0/10）</p><br/><p>Martial Skills: 《Titanium Grade Demon Body》 5th Level (3000/10000)</p><br/><p>Others explore on your own.</p><br/><p>It didn’t change much from the previous one, except for the experience points.</p><br/><p>“Big Bro must be hungry, hurry up and get Big Bro some food.”</p><br/><p>“Right, right...”</p><br/><p>Not long after that, a big bowl of delicious smelling chicken soup appeared before him. Lin Fan did not say anything, and with his stomach protesting in hunger, Lin Fan immediately finished off the chicken soup under the envious stares of the surrounding people.</p><br/><p>He didn’t think that amongst his fellow punching bags, there were still some good ones hidden like this. Not bad, not bad…</p><br/><p>“Big Bro, you must be tired. Let Big Bro take a good rest after he finishes eating. Big Bro, you have to hold on!”</p><br/><p>“Big Bro will definitely become a dragon and phoenix amongst men in the future.”</p><br/><p>“It was unfortunate that Ergou-dan was beaten to death this morning. He will not be able to witness the future greatness of Big Bro. “</p><br/><p>Saint Devil Sect was a devil sect, and life and death situations were a normal occurrence. Everyday punching bags died, so this sort of thing was no longer shocking.</p><br/><p>After the surrounding people had left, a single individual remained.</p><br/><p>His figure was short, not really sturdy-looking, and also had a look that seemed sorry to the masses. To be able to survive this long could also be considered a talent for someone like him.</p><br/><p>“Big Bro, this is a martial skill passed down in my family. I think, among us, Big Bro is the only one who can obtain it as you are the sole genius. So you must continue on.” The person brought out a time worn and tattered secret manual from his chest and gave it to Lin Fan.</p><br/><p>Lin Fan unreservedly accepted it, then looked at the person in front of him, “Okay, if in the future you don’t die and I become a person who dominates the world, I will ensure your great success.”</p><br/><p>This was the first time Lin Fan made a promise to someone after coming to this world.</p><br/><p>“Huh??”</p><br/><p>“Big Bro, don’t do this, I…this…just want you to try your best.” It was evident that this person didn’t take Lin Fan’s words to his heart. From his perspective, Big Bro’s bluff was a bit too much.</p><br/><p>Lin didn’t say anything else, as he also knew the other party didn’t really believe him.</p><br/><p>Basically, adding flowers to embroidery could never beat delivering charcoal when it was snowing. As he just started up, Lin Fan would remember in his heart every single person who helped him, and for the person in front of him, Lin Fan silently memorized his appearance. In the future, he would surely repay him.</p><br/><p>“Big Bro, you have a good rest. I will go back.”</p><br/><p>“Okay.” Lin Fan nodded his head and then looked at the secret manual.</p><br/><p>‘Ding… Two-bit secret manual 《Monkey Steals Peach》.'</p><br/><p>‘Learn? ‘</p><br/><p>“Of course learn! No matter how small a fly is, it is still meat.”</p><br/><p>Particularly in this world, even though Lin Fan wasn’t some elite of the sect, he still knew that the sect safeguarded it’s martial skills very strictly. As for being able to enter a hidden library and choosing any skills after becoming an outer sect disciple, that was complete bullsh*t.</p><br/><p>For the sect, the outer sect disciples could range from ten thousand to hundreds of thousands. How could there possibly be that many martial skills for everyone to choose from?</p><br/><p>A person had to rely on himself.</p><br/><p>‘Ding… Learned 《Monkey Steals Peach》.'</p><br/><p>‘First level（0/10)’</p><br/><p>This 《Monkey Steals Peach》 supposedly had only two levels, but it was unknown how many level this could rise to now.</p><br/><p>Even though 《Monkey Steals Peach》 is a two-bit technique, Lin Fan believed that he could raise this seemingly trash martial skill to an unbeatable level.</p><br/><p>《Monkey Steals Peach》 had only one move, a move that was absolutely devastating for males, an earth shattering power; one move that directly crushed one's balls.</p><br/><p>Lin Fan takes a deep breath, his body instantly moving as his right hand formed a claw, guiding it towards the indescribably wonderful place.</p><br/><p>+2</p><br/><p>+2</p><br/><p>…</p><br/><p>‘Ding… Two-bit martial skill 《Monkey Steals Peach》 raised to second level…’</p><br/><p>‘Character experience + 10.'</p><br/><p>“Ding, character leveled up.”</p><br/><p>“Haha!!”, Lin Fan laughed out loud, ‘Who would've thought that not even a minute would pass and 《Monkey Steals Peach》 would have already risen to the second level. Looks like I really am a peerless genius!’</p><br/><p>If he were to raise 《Monkey Steals Peach》 to the 100th level, even God’s balls would be crushed.</p><br/><p>Name: Lin Fan.</p><br/><p>Level: 2 （Precelestial stage waiting to be unlocked)</p><br/><p>Experience Points: (0/20）</p><br/><p>Martial Skills: 《Titanium Grade Demon Body》 5th Level (3000/10000)</p><br/><p>《Monkey Steals Peach》 2nd level (10/50)</p><br/><p>…</p><br/><p>Lin Fan stood up and hurried towards the direction of the training grounds. This grand opportunity, how could he let it go waste? He must take advantage of this chance.</p><br/><p>The punching bags in the surroundings couldn’t help but be confused seeing Big Bro leave so hastily.</p><br/><p>“Where is Big Bro going?”</p><br/><p>“Wasn’t Big Bro still heavily injured? From his pace that was full of spring and incredibly lively, was he perhaps all right?”</p><br/><p>“Oh no… Yesterday, Big Bro took all the suffering for us. It must be because I mentioned how Ergou-dan was beaten to death by those outer sect examination disciples, he is now going for revenge. “</p><br/><p>“Big Bro values friendship so much, he will definitely stir up trouble. No, we must hurry over.”</p><br/><p>…</p><br/><p>Shortly, Lin Fan arrived at the scream-filled training grounds.</p><br/><p>Lin Fan looked towards those hard-working outer sect examination disciples, and his heart rejoiced looking at all those experience points.</p><br/><p>‘《Titanium Grade Demon Body》 has already reached the fifth level. I wonder how much experience these guys can give.’</p><br/><p>With that in mind, Lin Fan could not hold back any longer.</p><br/><p>“Everyone stop.” Just like yesterday, Lin Fan let out a roar, which was even louder than yesterday.</p><br/><p>The outer sect examination disciples all became stunned after seeing this and then began talking amongst themselves.</p><br/><p>“This guy again...”</p><br/><p>“This guy was just beaten half to death by us yesterday, how is he still so lively today?”</p><br/><p>“Hmph, after yesterday’s punishments, even he would dare not be so presumptuous.”</p><br/><p>…</p><br/><p>As soon as these outer sect examination disciples finished talking, Lin Fan put one hand behind his back and pointed straight ahead while shouting.</p><br/><p>“Everyone…if I were to be honest…”</p><br/><p>But this time, before Lin Fan could even finish, the outer sect examination disciples were already riled up.</p><br/><p>“Brothers, this guy is once again provoking us… Using words to insult us, we must make him pay.”</p><br/><p>…</p><br/><p>Lin Fan smiled while looking at the rushing outer sect examination disciples, revealing a very pleased expression.</p><br/><p>“How smart, after yesterday’s lesson they can already link things together… not bad, not bad.”</p><br/><p>“In that case, let’s see how much experience all of you can still give 《Titanium Grade Demon Body》. I just hope it isn’t too little.”</p><br/><p>Lin Fan looked at these talented youngsters with expectation and eyes full of hope.</p><br/><p>+0</p><br/><p>+0</p><br/><p>…</p><br/><p>At this moment, Lin Fan’s previous expression of anticipation suddenly changed.</p><br/><p>“What the hell…….”</p><br/><p>“This...this...”</p><br/><p>“Brat I will let you know the definition of misery today.”</p><br/><p>“Forgetful fool, do you really think we are easy to be messed with?”</p><br/><p>“I am the son of the Prince of Zhennan, my Purgatory Art has long been perfected. I will let you taste the pain of a living hell.”</p><br/><p>…</p><br/><p>Lin Fan looked at this group of angry outer sect examination disciples. If it were yesterday, then he would allow them to be excited, because the harder they tried, the more benefits he gained.</p><br/><p>But now…</p><br/><p>“Little bastards, since you are all so useless, I will let you experience the world’s most terrifying martial art’s technique, and let you all never forget this pain for eternity.”</p><br/><p>“《Monkey Steals Peach》…”</p><br/>\n</div>"}