{"title": "Chapter 5: Leveling up Like a Rocket", "id": 5, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-5-leveling-up-like-a-rocket", "volume_title": "Volume 1", "body": "<h1>Chapter 5: Leveling up Like a Rocket</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 5: Leveling up Like a Rocket</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Night...</p><br/><p>A modest-sized tile house, with the inside filled with people…</p><br/><p>Lin Fan’s fight today left the group of punching bags completely speechless. They could only give Lin Fan a thumbs-up, expressing their belief.</p><br/><p>“Big Bro, the move you used today, was it 《Monkey Steals Peach》?”Xiao Liuzi had stayed at the Saint Devil Sect for quite a while, and he understood the matters that went on around here.</p><br/><p>Even though 《Monkey Steals Peach》 was a martial arts technique passed down within his family, he understood that compared to the martial arts of the outer sect examination disciples, the difference in power was vast.</p><br/><p>“Yep.” “Lin Fan nodded his head in affirmation.</p><br/><p>“Amazing, I never thought that my family’s technique was this powerful. But only Big Bro is able to bring out the full potential of its power.” Xiao Liuzi said excitedly. Lin Fan felt a bit embarrassed but didn’t say anything.</p><br/><p>“Big Bro, two days later, the outer sect will begin their examinations. Are you thinking about entering?” Xiao Liuzi asked, his eyes filled with anticipation.</p><br/><p>“Xiao Liuzi, aren’t you asking the unnecessary? Why wouldn’t Big Bro enter, you think he really wants to stay stuck here with us for his entire life?”</p><br/><p>“That is true.” Xiao Liuzi nodded.</p><br/><p>Even though Lin Fan possessed a system, he had been in this world for about a year already. Although he wasn’t overly familiar with it, he still knew that this world was very dangerous. Inside the sect, a mere punching bag like him usually wouldn’t dare defy the outer sect examination disciples. He also understood that to a sect, talent was the most important. If one had the power, one could provoke anyone, but at one’s own risk.</p><br/><p>If one were to just display a bit of talent and be killed by jealous sect members, then this sect wouldn’t have been able to live very long and long ago self-destructed. Lin Fan had two ideas, one was to seriously raise his own power, and the second was to attract the attention of someone from the top and then leave this place.</p><br/><p>But Lin Fan came to one conclusion; the outer sect examination disciples training grounds was a completely obsolete and inferior place inside the Saint Devil Sect it. What kind of top member would have nothing to do and come here?</p><br/><p>Therefore, he had to rely on himself. Since he obtained these golden fingers, if he didn’t do something big, he would feel sorry for all his life.</p><br/><p>The next day...</p><br/><p>Lin Fan woke up early, made some food to fill his stomach, and then hurried on over to the training grounds.</p><br/><p>Now that he was at the ninth level, 《Monkey Steals Peach》 was also at the 10th level, the experience he gained now would be slow. But no matter what, up to the day of the outer sect examination, he would get as strong as he could get.</p><br/><p>…</p><br/><p>A light breeze passed across the training grounds. The cool breeze blew up a cloud of dust from the bricks, and a few leaves floated about in the air before finally landing on the ground.</p><br/><p>Silence… absolute silence.</p><br/><p>“What is this situation?” Lin Fan looks at the scene in front of him, completely dumbfounded, ‘Where did all the people go?’</p><br/><p>The previously fiery training grounds were now absolutely silent and completely empty.</p><br/><p>‘This....this…’ Lin Fan held his chin, looking helplessly in front of him. These outer sect examination disciples were far too brittle. “All they did was lose some peaches, is there any need to be this scared?”</p><br/><p>‘Ha, looks like there will be nothing for these next few days. I will have to completely rely on myself.’</p><br/><p>Defeating others gave him experience, in which case defeating all those monsters and beasts outside should also net him experience.</p><br/><p>But if he were to hate he could only hate himself for only being a mere punching bag in the Saint Devil Sect, who didn’t have the permissions to leave sect grounds. Otherwise, he would go outside and violently exterminate waves of monsters.</p><br/><p>At this moment, Lin Fan saw two people approaching from afar. Lin Fan’s heart leaped with joy, ‘Finally, people arrive!’ But his expression then immediately changed, which was because the number above the head of one of the people was…</p><br/><p>Eighth level Precelestial.</p><br/><p>‘This...’</p><br/><p>Looking towards the young boy standing next to the man in light robes was the unparalleled pretty boy who he had mercilessly beaten yesterday.</p><br/><p>Lin Fan’s heart jolted, ‘Perhaps that guy didn’t accept yesterday’s results and brought along an expert for revenge.’ An eighth level Precelestial who was just two steps away from the postcelestial stage, what was a person like him doing in such an obsolete training ground?</p><br/><p>Furthermore, a person like him should definitely not be the kind of guy to have spare time to go around avenging others.</p><br/><p>“Is this the one you were talking about?” The man in light robes asked.</p><br/><p>“Yes, senior-brother. He is the person I was speaking of.” The unparalleled pretty boy stood respectfully to the side, not daring to make any disrespectful movements.</p><br/><p>Even though his nemesis Lin Fan stood right in front of him, he dared not show the slightest bit of joy at the other party’s misery.</p><br/><p>“No,” Lin Fan’s heart pondered, ‘This guy was not brought along as a helper. If he were brought along as a helper, the pretty boy would definitely not act like this. It seems there is some sort of unspeakable secret hidden here.’</p><br/><p>The man in light robes looked at Lin Fan and slightly nodded his head. Suddenly Lin Fan felt an energy with the momentum of a wave surge forth.</p><br/><p>“Pu.....”</p><br/><p>Lin Fan only felt a tremendous blow on his chest, completely not knowing what happened. The blood inside of him rolled over as he spit out a chunk of blood.</p><br/><p>‘So strong!’</p><br/><p>Lin Fan retreated dozens of steps, clutching his chest while half-kneeling on the ground, looking at the man in front of him.</p><br/><p>‘Ding… experience + 30000.”</p><br/><p>‘Ding… congratulations 《Titanium Grade Demon Body》 leveled up.’</p><br/><p>‘Ding, congratulations 《Titanium Grade Demon Body》 leveled up.’</p><br/><p>…</p><br/><p>Lin Fan was surprised, only feeling how terrifying the attack was. Merely one move and it raised 《Titanium Grade Demon Body》 by two levels.</p><br/><p>“Hm, not bad… A second level precelestial full force strike and only spitting out blood. It seems you have trained the 《Titanium Grade Demon Body》 to a very high level. Come with me.” “The light robed man nodded his head, his eyes flashing with extreme curiosity towards this punching bag that was able to train 《Titanium Grade Demon Body》 to this level.</p><br/><p>“Wait...” Lin Fan soothed the blood flow within his body and looked towards the light robed man.</p><br/><p>This was true strength. If one didn’t possess strength, they would have to let others throw them on the chopping board and be diced. But for Lin Fan, this was a perfect opportunity, how could he let it escape.</p><br/><p>Whether it was on Earth or now, Lin Fan was a madman, a complete madman. If he didn’t utilize all the benefits in front of him, he would never stop. The previous 5th level 《Titanium Grade Demon Body》 endured after receiving the second level precelestial full force strike and only caused him to spit some blood. Who knew what a 7th level 《Titanium Grade Demon Body》 could do?</p><br/><p>Lin Fan knew the eighth level precelestial sect disciple in front of him most likely wanted him for something, so he definitely wouldn’t kill him. But of course, Lin Fan wouldn’t foolishly say, ‘Please come hit me,' or similar ‘asking for a beating’ type of words.</p><br/><p>“You couldn’t withstand the shame I put on you yesterday, so today you brought along a helper. Do you think I‘ll be scared by just this? Let me tell you something. I, Lin Fan am not afraid of anything, I am completely not afraid of people seeking revenge upon me.” As soon as he finished, Lin Fan rushed forward.</p><br/><p>‘Come and hit me.’</p><br/><p>…</p><br/><p>The light robed man looked towards Lin Fan and gave a slight smile, “Amusing...”</p><br/><p>Bam!</p><br/><p>He did not see the light robed man make any movement, only feeling as if there was an invisible wall in front of him, as Lin Fan who rushed up was sent flying back.</p><br/><p>Lin Fan uncontrollably spat out blood again.</p><br/><p>‘Ding…experience + 2000.’</p><br/><p>At this moment, Lin Fan was in utter ecstasy. Earlier, even when he let those outer sect examination disciples beat him freely, they merely gave a few points. Who would’ve thought this guy’s one hit would increase his experience by so much.</p><br/><p>‘Nice…But not enough, your daddy here needs even more experience.’</p><br/><p>“Hmph, weak and powerless, this is the helper you brought along? Seems to me like nothing.” Lin Fan rose up while saying. “Stop it, you may not disrespect senior-brother.” The pretty boy’s expression changed, and he immediately reprimanded.</p><br/><p>“No matter what, it’s a bit interesting for sure. 《Titanium Grade Demon Body》 level limit is three, and even training it to the third level can merely endure one first level precelestial full force strike… This is getting more and more interesting… So be it, let’s see just how much you can withstand.” The light robed man gave a soft laugh.</p><br/>\n</div>"}