{"title": "Chapter 9: You’re Truly a Peerless Genius That Only Appears Once Every Thousands of Years", "id": 9, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-9-you%E2%80%99re-truly-a-peerless-genius-that-only-appears-once-every-thousands-of-years", "volume_title": "Volume 1", "body": "<h1>Chapter 9: You’re Truly a Peerless Genius That Only Appears Once Every Thousands of Years</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 9: You’re Truly a Peerless Genius That Only Appears Once Every Thousands of Years</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>‘Talent Registration Hall’</p><br/><p>Lin Fan stood underneath the hall’s nameplate, lost in thought. ’This name…’</p><br/><p>Dominating…</p><br/><p>Perfectly exhibiting the high-end caliber of a genius; it seemed no matter where one was, talent would always be a high-demand commodity. “Junior-brother, let’s go in.” Ni Mingyang’s attitude towards Lin Fan was very friendly, not containing any trace of urgency. The key point was that having a bad attitude just wouldn’t do. After all, Ni Mingyang’s eggs felt quite painful even now.</p><br/><p>‘This junior brother's attack is a bit sinister… It seems there is a need to report this incident to senior-brother Meng.’</p><br/><p>“Yes....yes.” Lin Fan returned to himself and nodded while following Ni Mingyang inside.</p><br/><p>Along the way here, Lin Fan realized that the Saint Devil Sect was indeed a big sect; the size was rather too huge, to the point that one could get lost in it.</p><br/><p>“Outer sect disciple, Ni Mingyang, recommending a talent… seeking an audience with Elder Li.” Ni Mingyang said while standing respectfully outside the entrance.</p><br/><p>“Understood…” At this time, a faint voice sounded from within the dark hall. This voice sounded a bit scary and cold, making one feel a chill deep down in the bones. Even the fearless Lin Fan involuntarily shuddered.</p><br/><p>“Senior-brother Ni, how is the voice of elder Li this petrifying?” Lin secretly asked.</p><br/><p>“Shhh, be cautious, junior-brother… Remember, in a moment, when you see elder Li, absolutely don’t panic, understand?” Ni Mingyang suddenly remembered something and was a bit regretful for not telling Lin Fan earlier. But now that they were already standing outside the hall, he couldn’t really explain in detail either.</p><br/><p>“Panic? What’s there about panicking?” Lin Fan was surprised for a moment and didn’t quite understand, ‘Was it possible this elder Li was a man-eating tiger? ‘ But even so, Lin Fan was not scared. If it came down to it, one 《Monkey Steals Peach》 should do.</p><br/><p>“Shh, quiet, Elder Li has arrived.” Ni Mingyang’s expression slightly changed while he respectfully stood there. Lin Fan secretly glanced towards the person walking out from the darkness. Dressed in black robes, the figure was a bit burly.</p><br/><p>“Huh…?”</p><br/><p>At this moment, as a ray of sunlight shone on the face of Elder Li, Lin Fan’s expression suddenly changed. His eyes were shimmering with disbelief while at the same time reflecting a bit of fear.</p><br/><p>‘This…this...How could a human look like this?’</p><br/><p>Half a human face, half a skeleton, such that one could even see the pulsing brain inside. Incredibly terrifying, it really was incredibly terrifying.</p><br/><p>Remembering Ni Mingyang’s words, Lin Fan lowered his head, no longer observing Elder Li.</p><br/><p>Even if Lin Fan was open-minded, he had never faced this kind of situation before. If it weren't for Ni Mingyang’s previous warning, Lin Fan would’ve likely shouted out, “A ghost!”</p><br/><p>“Elder Li, this is Lin Fan. His 《Titanium Grade Demon Body》 has been cultivated to a very high level, and can even defend against my eighth level precelestial full-powered strike.” Ni Mingyang introduced in detail.</p><br/><p>The “Talent Registration Hall” was the Saint Devil Sect’s foundation point. Countless talented disciples had been required to register with it, and from then tremendous investments allowed it to further develop.</p><br/><p>Earlier when the “Talent Registration Hall” was first created, the sect was highly attentive to the genius disciples, but as time went on, the number of geniuses continued to grow more and more. So the sect obviously couldn’t provide an indefinite amount of resources, and thus even though the current “Talent Registration Hall” still received quite a lot of resources, it wasn’t as crazy as it used to be.</p><br/><p>“Oh, is that so? Then I would like to see.” With this, Elder Li showed a hint of interest. Lin Fan stood there, and his weak body gave a sudden shudder.</p><br/><p>‘My God! Don’t get so close to me.'</p><br/><p>.</p><br/><p>Lin Fan slightly raised his head, and his vision met with the flaring green of elder Li’s eyes and the half skeleton face. “Are you scared of my face?” Elder Li smiled while observing the rather new midget sect member. Even though Lin Fan’s expression was a bit disrespectful, Elder Li was not angry.</p><br/><p>“No...”</p><br/><p>‘Don’t joke around, I’ll really be a complete idiot if I were to speak the truth now. But this elder Li’s face really is rather bone-chilling.’</p><br/><p>“You cannot blame the ignorant… In your path, you will meet people even scarier than me.” Elder Li ridiculed and then rested one hand on Lin Fan’s shoulder. Lin Fan immediately felt a stream of energy flow throughout his body, as if it were searching for something. Lin Fan was close to tears at this point.</p><br/><p>‘Being infiltrated by people twice in one day, you all will never obtain my virginity.’</p><br/><p>Then, something that made Lin Fan even more panicked happened. The previous calm flaring green of elder Li’s eyes suddenly began jumping and shining with much greater intensity than before, while staring at Lin Fan to the point of giving him goosebumps.</p><br/><p>‘My god, what are these people? Their stares make me feel so awkward. Penetrating, this glare has too much penetration power.’</p><br/><p>“Genius…”Elder Li excitedly grabbed Lin Fan, \"Peerless genius…To cultivate 《Titanium Grade Demon Body》 to such a level, a peerless genius that only appears once every thousands of years…” Ni Mingyang, who had been standing there respectfully the whole time, had previously just been thinking about how elder Li was really talkative today. But upon hearing Elder Li’s first words, the corner of his mouth revealed a slight smile.</p><br/><p>‘Junior-brother is naturally a genius. Otherwise he wouldn’t have been recommended here.’ But when he heard the words that followed, Ni Mingyang was stunned.</p><br/><p>Peerless genius? Furthermore, a peerless genius that only appears once every thousands of years…</p><br/><p>Upon hearing those words of elder Li, the already wide eyes of the fidgety Lin Fan became even wider.</p><br/><p>‘Haha...Genius…Peerless genius…A peerless genius that only appears once every thousands of years.’</p><br/><p>‘Elder Li, a peerless genius like myself that only appears once every thousands of years most definitely will receive the full protection of everyone in the entire sect right? Am I going to become the personal disciple of the sect head and receive personal guidance?” Lin Fan was ecstatic at this point towards the Saint Devil Sect that treasured geniuses so dearly.’</p><br/><p>‘A peerless genius that only appears every thousands of years like myself, won’t I be treasured to the utmost? The various kinds of tremendous sect resources, on top of his own system, wouldn’t that mean his days of becoming an invincible God are drawing near?</p><br/><p>Haha…’</p><br/><p>As he continually thought about it, Lin Fan became thrilled, ‘Who would’ve thought that in this world, Yours Truly would be able to dine in such riches… The heavens are quite kind towards me.’</p><br/><p>At this point, the previously excited elder Li suddenly calmed down.</p><br/><p>“Alright, not bad… Come collect your outer sect necessities. Ni Mingyang, this is your reward for recommending a talent. Afterward, bring this newly initiated junior brother to the assigned residence and explain the Saint Devil Sect’s commandments to him.” Elder Li regained his calm and said.</p><br/><p>“Yes, Elder Li.” Ni Mingyang respectfully received the reward and nodded. “Huh…?”At this moment, a basin of ice cold water poured over Lin Fan from head to toe, fully awakening him.</p><br/><p>“Elder Li, but I am a peerless genius that only appears once every thousands of years, is this the only treatment I get?” Lin Fan was frustrated, ‘Was the previously excited expression just a lie? I was already prepared to meet the sect head, how did it become like this?’</p><br/><p>“All things start from scratch… one step at a time. One must not be too hasty.” With these words, elder Li’s figure gradually disappeared into the darkness of the hall.</p><br/><p>‘F*ck…’</p><br/><p>Lin Fan was completely frustrated at this point, ‘This shouldn’t be how things go.’ The peerless geniuses in novels, if they weren’t hacked to death by people, then they would be cradled like a treasure by them. ‘A peerless genius that only appears every thousands of years and this is the treatment I get...The heavens and great earth…give me an explanation!’</p><br/>\n</div>"}