{"title": "Chapter 8: The Pig Roaming in the Beginner’s Zone", "id": 8, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-8-the-pig-roaming-in-the-beginner%E2%80%99s-zone", "volume_title": "Volume 1", "body": "<h1>Chapter 8: The Pig Roaming in the Beginner’s Zone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 8: The Pig Roaming in the Beginner’s Zone</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Along the way, Lin Fan conversed with Ni Mingyang and gathered quite a bit of information. At the same time, he began to recognize the Saint Devil Sect’s system. Genius, that was the critical point that needed to be raised. In the Saint Devil Sect, the outer sect examination disciples were divided into nine major sites, the area Lin Fan was in was merely a small portion of one of those sites, and this small fraction alone contained hundreds of people.</p><br/><p>An overall estimation would likely end up with a terrifying number. The Saint Devil Sect, in order to discover those hidden geniuses within the sect, enforced a reward system for identifying and reporting a genius.</p><br/><p>“Senior-brother Ni, what kind of person is senior-brother Meng. Do you think he will like a genius like myself?” Lin Fan asked while cackling.</p><br/><p>Ni Mingyang, who was walking in front, stopped suddenly. Lin Fan watched Ni Mingyang, wondering what kind of result this would bring.</p><br/><p>“Junior-brother Lin, senior-brother Meng is a solemn person. You must not be disrespectful in front of senior brother Meng… Be sure to keep that in mind.” Ni Mingyang said seriously. He was afraid that this innocently playful junior-brother might act out of line in front of senior brother Meng.</p><br/><p>“Understood.” Lin Fan nodded his head, a bit curious towards this so-called senior-brother Meng, one of the outer sect’s top ten geniuses. To be within the top ten among the thousands of outer sect disciples, he most likely was a very powerful person. While walking, Lin Fan entered the grand garden. Since the time he became a punching bag, Lin Fan had never been anywhere else. So naturally, he didn’t know how big the Saint Devil Sect was. Thus, the sight in front of him brought Lin Fan into an entirely new world.</p><br/><p>“We have arrived. This is where senior-brother Meng resides.” Lin Fan looked at the house in front of him, his heart yearning, ‘One day, I will also possess all of this.’</p><br/><p>“Enter, and remember, don’t be disrespectful.” Ni Mingyang cautioned again.</p><br/><p>“Okay, I understand senior-brother Ni.” Lin Fan nodded his head. Towards senior-brother Ni, Lin Fan still had a desire to get closer to him. Even though he would occasionally act tough, but the intelligence and compassion was still very touching.</p><br/><p>Within the pearly white walls of the garden, the surrounding green willows, and the adorning mountain rocks gave off an impression of magnificence and elegance. ‘So this is the place one of the outer sect’s top ten geniuses resides in… It truly is desirable.’</p><br/><p>“Senior-brother Meng…”Ni Mingyang stood outside the house and respectfully greeted.</p><br/><p>“Enter.” A faint voice came from inside the house, at which point Lin Fan became a bit nervous. Hearing the voice alone, he could sense the toughness which was quite high.</p><br/><p>…</p><br/><p>Lin Fan followed behind Ni Mingyang and entered inside. The insides of the house emitted a sense of antiquity, like a place where a scholar would reside. For a devil sect, this kind of place was a bit incongruous.</p><br/><p>“Is this the genius mentioned by the underling?”\"Meng Yangquan closed the ancient book within his hands, and then carefully observed Lin Fan. Lin Fan also stared directly at this so-called outer sect’s top ten geniuses.</p><br/><p>‘Sure enough…A dragon amongst men.’</p><br/><p>As a man, Lin Fan also felt some envious hate, ‘What was up with this world? How could there be so many men that possessed such devilish beauty?’</p><br/><p>And the so-called senior brother Meng in front of him, even with his devilish beauty, he didn’t possess a sense of overwhelming superiority but instead gave off an indescribable feeling.</p><br/><p>In more modern terms, an elegant indifference…difficult to speak with, definitely difficult to speak with.</p><br/><p>And when Lin Fan took a look at the level, he was instantly convinced.</p><br/><p>“Sixth level Pericelestial”</p><br/><p>‘Seriously, with a cultivation base that high and still lying around among the outer sect disciples, this is insane.’</p><br/><p>Breaking through to postcelestial would allow one to become an inner sect disciple. Upon entering the pericelestial stage, they could become a core disciple and even compete for the position of sect head; the weaker ones could still become sect elders or the likes.</p><br/><p>‘This is essentially just a max level pig who is stubbornly refusing to leave the beginner’s zone.’</p><br/><p>Of course, this thought was kept inside Lin Fan’s heart. Even though his 《Titanium Grade Demon Body》 had reached the eighteenth level, when Lin Fan thought about it, perhaps even with a mere breath of the other party would reduce him to nothing.</p><br/><p>“You’re Lin Fan?”Meng Yangquan asked.</p><br/><p>“Yes.” Lin Fan silently but non-submissively nodded his head, ‘Even though your cultivation base is quite high, but no matter what, I am someone who possesses the ultimate system. I cannot lose face.’</p><br/><p>“Senior-brother Meng, the cultivation of junior-brother Lin’s 《Titanium Grade Demon Body》 is really high, it can even withstand my full-powered strike. He is a rare talent for sure.” Ni Mingyang said excitedly.</p><br/><p>“Oh.” Senior-brother Meng’s gentle expression slightly changed. Lin Fan suddenly felt as if his whole being was completely exposed in front of senior-brother Meng. Lin Fan felt a bit awkward, ‘The cultivation base of senior-brother Meng is quite high, how is his style like this?’ Not long after that, this kind of feeling disappeared.</p><br/><p>“Not bad, not bad…he is definitely unusual, 《Titanium Grade Demon Body》 is Saint Devil Sect’s lowest body training technique. To be able to train it to that level is also an incredible qualification. But your cultivation base is rather low, so you need to work harder.” Meng Yangquan’s expression was calm, but felt quite shocked on the inside, with a strong feeling of disbelief.</p><br/><p>But how could an expert like him reveal a shocked expression in front of the juniors? “I thank senior-brother Meng for the advice.” Lin Fan said. “Tomorrow morning, take him to elder Li’s place for initiation.” Meng Yangquan said.</p><br/><p>“Yes.” Ni Mingyang nodded his head and prepared to leave.</p><br/><p>“Tomorrow morning......”</p><br/><p>“Senior-brother?”</p><br/><p>“For the inner sect exams in three months, you should work hard, set aside your other businesses and give it a try.” Meng Yangquan said.</p><br/><p>“Senior-brother, wherever you go, I will also be there,” Ni Mingyang said with a firm expression.</p><br/><p>Lin Fan, who stood to the side, silently looked towards the two people and pondered, ‘Does Ni Mingyang perhaps like men?’</p><br/><p>‘Tch, tch...I don’t want to think about it, I don’t want to think about it…’</p><br/><p>“Ha, go.” Meng Yangquan sighed.</p><br/><p>“Yes.”</p><br/><p>…</p><br/><p>Outside…</p><br/><p>Along the way, Ni Mingyang didn’t say a single word, and Lin Fan became a bit bored.</p><br/><p>“What’s the cultivation base of senior brother Meng?”Lin Fan pretended to be clueless and asked. After all, for a sixth level pericelestial to stay in the outer sect, it was quite weird.</p><br/><p>“Third level postcelestial.” Ni Mingyang replied. Lin Fan nodded his head, ‘As expected, there is something up… even hiding the cultivation base and not letting others know. Was Meng Yangquan perhaps actually a ‘tiger pretending to be a pig’ type of big shot?’</p><br/><p>“Senior-brother, senior-brother Meng told you to enter the inner sect exams, why won’t you go? People strive to aim higher, do you want to stay in the outer sect for the rest of your life?” Lin Fan asked.</p><br/><p>“You don’t understand…” Ni Mingyang didn’t say anything more. Hearing this, Lin Fan instantly exploded in his mind. ‘Seriously, I don’t understand? You don’t even bother to explain the situation and just say I don’t understand. Whatever…just whatever.’</p><br/><p>‘I am not a gossiping type of person, who cares if there is some kind of relationship or something between you two, it has nothing to do with me. But it really is intriguing.’</p><br/><p>Lin Fan really wanted to open Ni Mingyang’s head and carefully investigate what exactly was going on, to the point of him being ready to cast aside his chance for promotion and riches.</p><br/><p>But upon seeing Ni Mingyang’s current deadpan expression, Lin Fan didn’t bother to pursue the matter.</p><br/>\n</div>"}