{"title": "Chapter 15: This Cookie From the Heavens, I Won’t Tell Anyone", "id": 15, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-15-this-cookie-from-the-heavens-i-won%E2%80%99t-tell-anyone", "volume_title": "Volume 1", "body": "<h1>Chapter 15: This Cookie From the Heavens, I Won’t Tell Anyone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: This Cookie From the Heavens, I Won’t Tell Anyone</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Inside the house…</p><br/><p>Lin Fan lied powerlessly on the bed, looking at the medicinal pill senior brother Ni Mingyang left behind. He was entirely fine though. ‘Looks like staying inside this sect to level up is rather unreliable. I should probably think about going outside and trying my luck. But the sect rules state outer sect disciples aren’t allowed to leave the mountain… this is also quite troubling.’</p><br/><p>“Hehh…” Lin Fan sighed, then dumped the medicinal pill left by senior brother Ni onto his hand.</p><br/><p>‘Ding… discovered healing medicinal pill, “Rejuvenation pill,” after ingestion, experience + 50.’</p><br/><p>‘Rejuvenation pill: Saint Devil Sect’s common medicinal pill, made from blue vanilla extract.’</p><br/><p>“Hehh…” Lin Fan sighed once again, then stuffed the medicinal pill into his mouth and gulped it down instantly. Lin Fan then opened up his character data panel.</p><br/><p>Name: Lin Fan</p><br/><p>Level: 11 (Second level precelestial stage)</p><br/><p>Experience points: (7000/50000)</p><br/><p>Martial Skills: 《Titanium Grade Demon Body》 19th Level (6000/2000000)</p><br/><p>《Monkey Steals Peach》 10th level (1400/10000)</p><br/><p>Title: Not conceding is dry (Cultivation base is doubled, time limit is one incense candle, one-time use)</p><br/><p>Lin Fan looked at the experience of《Titanium Grade Demon Body》 and felt his head hurt, ‘Two million experience! Relying on these outer sect disciples to beat me up will take me years.’</p><br/><p>“Hehh…” Lin Fan sighed yet again, and then closed his eyes, deciding to take a good rest and wait till nighttime before proceeding.</p><br/><p>After an unknown amount of time passed…</p><br/><p>Lin Fan sensed a light scent within his room; this light scent made Lin Fan very suspicious. ‘I am a straight up man, so I never use goods like perfume. Where in my room would this scent come from?’</p><br/><p>‘Strange… strange.’ Lin Fan opened his eyes, and there was not a single soul inside his room, not even a ghost. ‘Hm, then this light scent, where is it coming from? Perhaps it’s some girl who snuck into my room, trying to take advantage of me being asleep and take off my pants, lift up my brother and turn the world upside down?’</p><br/><p>Upon thinking this Lin Fan felt a bit scared, then looked down at his crotch. Thankfully, it was safe and sound and had not been infiltrated. Otherwise, he wouldn’t know who to go crying to.</p><br/><p>“Oh…” Lin Fan jolted again, and then lift up a jade bottle next to his bed, ‘What’s this thing?’</p><br/><p>The jade bottle was very normal, didn’t have any patterns, and seemed unlikely to hold any treasure. Lin Fan held it then shook it, causing the insides to rattle about as if there was something inside. Lin Fan was sure that before he went to sleep, there was nothing like this next to his bed. Who put this here then?</p><br/><p>Lin Fan got up and opened the door. It was pitch black outside, and not a single person could be seen. The confused Lin Fan then returned inside, sat on his bed and thought it over, but was unable to come up with anything. So Lin Fan then dumped out the contents of the jade bottle.</p><br/><p>A golden medicinal herb with a powerful scent came into sight, upon smelling which brought about a refreshing feel.</p><br/><p>‘Ding… discovered Saint Class medicinal pill, “Supreme pill,” after ingesting + 4 million experience.”</p><br/><p>‘Supreme pill: Formed through a collection of ghost dimension thousand year ice crystals, dozens of high quality thousand year monster materials.’</p><br/><p>‘Effects: acquiring thousand year ultimate qualification, comprehension.’</p><br/><p>‘Haha…’ The previously still hazy Lin Fan, suddenly opened his eyes wide. ‘What the hell. What kind of medicinal pill is this, how is it so overpowered? 4 million experience points! Sh*t, 4 million experience points! Wow!’</p><br/><p>Currently, Lin Fan felt like he was about to go crazy. This was basically a cookie from the heavens.</p><br/><p>Lin Fan, who was desperately trying to become stronger, directly threw the medicinal pill into his mouth without a second thought and started chewing ferociously. ‘Oh, it’s a bit hard. I can’t chew it, well Yours Truly refuses to believe this. Whatever, let’s just directly swallow it instead then.’</p><br/><p>‘Ding… ingested Saint Class medicinal pill, “Supreme pill” + 4 million experience.’</p><br/><p>At this moment Lin Fan felt an irresistible thunderous energy within his body as if his entire body was about to explode.</p><br/><p>‘Ding, activating experience upgrade function bar.’</p><br/><p>His previous practically stuffed body suddenly returned to normal. Lin Fan was stunned, and stiffened a bit, then opened his character data and inspected it closely.</p><br/><p>Name: Lin Fan</p><br/><p>Level: 11 (Second level precelestial stage)</p><br/><p>Experience points: (7000/50000)</p><br/><p>Storage experience: four million. (Can upgrade character level, can upgrade martial skill level)</p><br/><p>Martial Skills: 《Titanium Grade Demon Body》 19th Level (6000/2000000)</p><br/><p>《Monkey Steals Peach》 10th level (1400/10000)</p><br/><p>Title: Not conceding is dry (Cultivation base is doubled, time limit is one incense candle, one-time use)</p><br/><p>Lin Fan looked at the extra 4 million experience and smiled brighter than anyone else, just like a sunflower. His cultivation base was still only second level precelestial, so he couldn’t quite stand it. As a man completely full of swag, how could he allow his own cultivation base to remain so low?</p><br/><p>‘No, I must upgrade.’</p><br/><p>‘Ding… congratulations character level 12, third level precelestial.’</p><br/><p>‘Ding… congratulations character level 13, fourth level precelestial.’</p><br/><p>‘Ding… congratulations character level 14, fifth level precelestial.’</p><br/><p>…</p><br/><p>Lin Fan clicked crazily, feeling as if he were to meet a God, he would kill God, meet Buddha kill Buddha; in other words completely unstoppable.</p><br/><p>‘Ding… insufficient experience, unable to level up.’</p><br/><p>Lin Fan, who was clicking away happily, was suddenly startled in a bit disbelief. He had merely reached ninth level precelestial and he already couldn’t level anymore, this was a complete rip-off.</p><br/><p>But when Lin Fan carefully inspected it, he realized that to go from ninth level precelestial to postcelestial, it actually needed 10 million experience points. At this point Lin Fan was dumbfounded, this was too scary.</p><br/><p>Even though Lin Fan didn’t really look, he couldn’t help but wonder, ‘From eighth level precelestial to ninth level precelestial should have only required around two hundred thousand experience points or so. How come when it reached here, it needs ten million experience points? This…this!’</p><br/><p>If this upgrade system had a customer service, Lin Fan would definitely complain, ferociously complain. This was a complete rip-off product. Looking at the remainder two million experience points, Lin Fan was speechless.</p><br/><p>‘Whatever, let’s use the remainder on leveling up the martial skills. In an instant, I became an expert ninth level precelestial, so it was not so bad. If other people were to find out, they most definitely would be coughing up blood and die.’</p><br/><p>“Hehehe…”</p><br/><p>‘Ding… congratulations 《Titanium Grade Demon Body》 leveled up.’</p><br/><p>‘Ding… congratulations 《Titanium Grade Demon Body》 leveled up to 20, martial skill advanced to 《Eternal Demon Body》.’</p><br/><p>‘Ding… 《Eternal Demon Body》 1st level (0/3000000)’</p><br/><p>Upon seeing 《Titanium Grade Demon Body》 convert to 《Eternal Demon Body》, Lin Fan’s heart almost jumped out. ‘As expected, the martial skills can automatically advance, and from the looks of it, it’s probably unlimited. If I gather enough experience, then in the future I will essentially become a walking tank.’</p><br/><p>Then, Lin Fan directly added the remaining experience to 《Monkey Steals Peach》. Although 《Monkey Steals Peach》 was a very garbage martial skill, Lin Fan was a very nostalgic type of person. 《Monkey Steals Peach》 had achieved illustrious merits for himself, so as a person with a good conscience, how could he give it up? In the future, he would make 《Monkey Steals Peach》 flourish greatly and become a legendary existence.</p><br/><p>‘Ding… congratulations 《Monkey Steals Peach》 level up.’</p><br/><p>‘Ding… congratulations 《Monkey Steals Peach》 level up.’</p><br/><p>At this point, Lin Fan was very happy and looked once again at his character data panel.</p><br/><p>Name: Lin Fan</p><br/><p>Level: 18 (Ninth level precelestial stage)</p><br/><p>Experience points: (0/10000000)</p><br/><p>Storage experience: 400 (Can upgrade character level, can upgrade martial skill level)</p><br/><p>Martial Skills: 《Eternal Demon Body》 1rst level（0/3000000）</p><br/><p>《Monkey Steals Peach》 12th level (1400//30000)</p><br/><p>Title: Not conceding is dry (Cultivation base is doubled, time limit is one incense candle, one-time use)</p><br/><p>Lin Fan smiled contently, trying hard to calm his excited heart. This cookie from the heavens, Lin Fan swore to the heavens he wouldn’t tell anyone about it. Just as Lin Fan prepared to continue lying down and fantasize for a while, he discovered a note next to his bed. Lin Fan picked up the note, glanced through it, and then nodded.</p><br/><p>The handwriting was beautiful, but somehow it also had a dominating feel to it. No, he must be overthinking it.</p><br/><p>It must be so.</p><br/><p>But when Lin Fan finished reading the contents of the note, his expression changed, then he threw the note aside and bitterly murmured.</p><br/><p>“Screw it, I already ate it all. What’s the point of saying anything…”</p><br/><p>…</p><br/><p>At this moment, in the dark night sky, a pair of bright eyes sparkled dazzlingly, just like the stars in the sky.</p><br/><p>“Oh, stupid, that’s not meant for eating.”</p><br/>\n</div>"}