{"title": "Chapter 11: Not Conceding, So Just Do it", "id": 11, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-11-not-conceding-so-just-do-it", "volume_title": "Volume 1", "body": "<h1>Chapter 11: Not Conceding, So Just Do it</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11: Not Conceding, So Just Do it</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>A cool breeze blew across, blowing away all the filth from the heaven and earth. On the outer sect training field, a person lied on the ground while constantly twitching, as if he had suffered some kind of heavy injury.</p><br/><p>…</p><br/><p>Lin Fan returned in high spirits. Although the outer sect training field was rather disappointing, this time's results were not that bad.</p><br/><p>He stole one peach. The experience didn’t increase by much, but his mood was very cheerful.</p><br/><p>'Monkey Steals Peach\"experience increased by 200.'</p><br/><p>'Character experience points increased by 3000.'</p><br/><p>‘Senior brother Han, I hope you will hate me and call a bunch of back-ups to mercilessly humiliate me and ravage me. This Junior brother will cleanse himself and await you.’</p><br/><p>Upon entering the outer sect, Lin Fan was determined to go all out to level up. After all, if his cultivation base were lower than others, he would not be able to achieve anything. So, no matter , he must be full of swag upon finishing his training. Returning back to his quarters, Lin Fan lied down on his bed, pondering about the outer sect.</p><br/><p>No matter what, he had to invoke everyone’s wrath. Only then would he have a chance. But, everybody was training within their own quarters. So, just figuring out what kind of method he should use to turn things around was already painstaking enough.</p><br/><p>‘\"Titanium Grade Demon Body\"…\"Monkey Steals Peach\"…Just what are your level limits?’ Lin Fan looked up at the ceiling and gradually slipped into his thoughts. The time slowly passed by with each second and minute. Lin Fan, who was deep in thought, suddenly sat up.</p><br/><p>\"That’s right, how could I have forgotten something so important?\"Monkey Steals Peach\" and \"Titanium Grade Demon Body\" are completely complementary… If I can steal other people’s peaches, then I can also steal my own peach.’</p><br/><p>Lin Fan looked down towards his pretty well-developed brother, then looked at his own hand, his inner heart in great turmoil. If this experiment were to succeed, then it really would mean walking down a dark path from then on…</p><br/><p>‘No, no.’ At this moment Lin Fan remembered the pain his fellow junior and senior brothers were in when they had their peaches stolen by him, and resisted the impulse in his heart. ‘My eggs can only be rubbed, not stolen.</p><br/><p>At this point, while Lin Fan was still in the middle of this dilemma. Far away inside another room…</p><br/><p>Han Lu’s teeth were chattering as he sat down completely powerlessly. \"Lin Fan, I will never forgive you.\" Han Lu’s eyes looked like they were about to spew fire. To attack for completely no reason, and the place he attacked was that area, no man could withstand that.</p><br/><p>Han Lu’s cultivation base was at fourth level precelestial. But no matter how much he trained, he wouldn’t be able to train that area to the level of an impregnable fortress. Lin Fan’s cultivation base was much lower than Han Lu’s, but the technique \"Monkey Steals Peach\" was cultivated to an unstoppable level.</p><br/><p>Han Lu clenched his legs and gingerly stood up, then proceeded over to the doorway and looked around outside. After confirming that there were no people, he settled down.</p><br/><p>A white jade bottle appeared in his hands. Two years ago, when Han Lu came to the Saint Devil Sect seeking a master, he inadvertently managed to obtain this thing. But, when he first obtained this white jade bottle, Han Lu still didn’t know how to use it. Fortunately, this white jade bottle could be hidden within the body, making it undetectable to anyone.</p><br/><p>But within this half an year, this white jade bottle suddenly appeared again and a signal came from within it. Han Lun then learned that the white jade bottle’s name was called 'Holy Jade Bottle', and at the same time, another signal told him that this Holy Jade Bottle was the personal item of someone called ‘Guanyin Bodhisattva, the pinnacle of mercy, compassion, kindness and love, and world suffrage.' Han Lu tried to gather information about this name, but was never able to find out about this person.</p><br/><p>This Holy Jade Bottle would conceive a drop of water each day, called the ‘Dew of the Gods’, consuming which would result in a wondrous effect. Not only could it increase one’s cultivation base, but it also could cure any sickness or disease.</p><br/><p>The reason why Han Lu was able to go from a mortal to fourth level precelestial in merely half an year was entirely because of this.</p><br/><p>Han Lu than took out a manual he borrowed from elder Chuan Gong, which contained the technique \"Raining Fist of Vastness\" and flipped opened to the first page, reading the incantations and diligently remembering them.</p><br/><p>In the past, Han Lu’s memory was not that good. But after consuming the Dew of the Gods, not only did his memory became stronger, his comprehension also increased drastically. It could even be said to have reached the caliber of a sect’s genius.</p><br/><p>Han Lu treasured this Holy Jade Bottle a lot. Unfortunately, this Holy Jade Bottle was damaged, which he found to be very regrettable.</p><br/><p>Although damaged, the Holy Jade Bottle was still very powerful. So, if it were in completely good shape, just what would it be like? This was something Han Lu anticipated very much. He didn’t think of anything anymore, and carefully swallowed a single Dew of the Gods into his stomach. Suddenly a warm heat flowed throughout his body.</p><br/><p>Han Lu immediately got into the lotus position and meditated on the incantation of \"Raining Fist of Vastness\". Just cultivating the \"Raining Fist of Vastness\" to a small stage would allow him to break through to the Fifth level precelestial stage.</p><br/><p>'Today’s revenge will be remembered and returned on another day. Lin Fan, I will remember you.'</p><br/><p>…</p><br/><p>\"Achoo…\" Lin Fan, who was still in a fierce inner struggle with himself, inadvertently sneezed, ‘Is another guy saying bad stuff behind my back?’ Lin Fan rubbed his nose while wondering.</p><br/><p>At this point, Lin Fan was still in a dilemma, even though he previously had already decided that he would never steal his own peach.</p><br/><p>‘But what if it really did succeed, then what? Such an easy training method, I can’t just give it up.’ Lin Fan pace back and forth, unable to decide.</p><br/><p>‘Screw it…What’s the use of thinking about it so much? A person must die with dignity, so might as well make a gamble… to become invincible… for a better future. If I am unable to face something this small, what’s there to say?’ Lin Fan at this point went all out, his movements quick like lightning.</p><br/><p>\"Monkey Steals Peach.\"</p><br/><p>‘Bam...’</p><br/><p>At that moment, Lin Fan knelt on the ground immediately. His previously colored face turned ghastly pale, his determined eyes also leaking out a few drops of tears. Lin Fan lowered his head painfully, his two hands clutching his crotch.</p><br/><p>‘My God, I regret this.’</p><br/><p>Lin Fan clenched his teeth, now also forced to smell the fart he released because he was kneeling.</p><br/><p>‘Ding…\"Monkey Steals Peach\" experience + 1.’</p><br/><p>‘Ding…\"Titanium Grade Demon Body\" experience + 1.’</p><br/><p>‘Ding… congratulations on achieving: Not Conceding So Just Do it.’</p><br/><p>‘Not Conceding so Just Do it: I am even capable of viciously treating myself, let alone you.’</p><br/><p>‘Effects: Activating will double own cultivation base for the duration of one incense stick.’</p><br/><p>‘Usage: One time.’</p><br/><p>…</p><br/><p>At this point, Lin Fan didn’t care about any of this, because he was feeling a humungous pain, so much pain that he wanted to kill someone.</p><br/><p>Lin Fan swore to the heavens that he would never again use such a devastating move on himself. From now on, he would settle with using other people to level up. Lin Fan stood up with much difficulty and held onto the side of a table. He walked towards his bed and slowly lied down while silently clutching his crotch in tears.</p><br/><p>‘A day can’t be wasted. But today, just let me take a good rest and work hard tomorrow.’ Lin Fan’s body trembled as he slowly closed his eyes. His heart was silently weeping, feeling that he indeed was an idiot. Something like this, just how could he do something like this? But after this experiment, he now understood just how much pain his fellow brothers were in.</p><br/><p>‘I wonder if Senior brother Han will gather a bunch of back-ups tomorrow to seek revenge… It is something I am really looking forward to. As for today, let’s just forget it… Senior brother Han is most likely also lying on the bed, trying to ease his pain.</p><br/><p>...</p><br/>\n</div>"}