{"title": "Chapter 38: High on Medicine", "id": 38, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-38-high-on-medicine", "volume_title": "Volume 1", "body": "<h1>Chapter 38: High on Medicine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 38: High on Medicine</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>The sun and moon alternated.</p><br/><p>The people flying through the air were like some patrol brigade, and Lin Fan was becoming impatient trying to look for a good opportunity to escape.</p><br/><p>A day later.</p><br/><p>After confirming everyone had left, he carefully dug himself out.</p><br/><p>He had to thank the system for hiding his cultivation base. That way, he could safely avoid detection. Otherwise, his energy would have long been detected.</p><br/><p>People who had higher cultivation bases were more sensitive to energy, but now no matter how high the person’s cultivation base was, they wouldn’t be able to detect him. After this incident, Lin Fan also realized the vast difference between stages.</p><br/><p>If he had really faced those two pericelestials head on, he most certainly would’ve been obliterated to the point even his ashes wouldn’t have remained. Even against the level seven postcelestial Yu Feng, if the system hadn’t given him a full resurrection, he would have been totally dead.</p><br/><p>Lin Fan then swore that if he didn’t have a 100% confidence of winning, he would never again pick a fight with people whose cultivation bases were way higher than him.</p><br/><p>…</p><br/><p>Lin Fan brushed the dirt off his body and sniffed his hand, his hand still having traces of aroma on them.</p><br/><p>Lin Fan couldn’t help but become intoxicated. Pretty women were just simply not the same. Even after a day, the fragrance still persisted, women really were deliciously sweet.</p><br/><p>‘Let’s go, march towards the direction of the great Yan Dynasty.’ Lin Fan pumped himself up and with a wave of his hand, strode forth.</p><br/><p>‘How far is it from the great Yan Dynasty? Lin Fan didn’t know anything and hadn’t even thought about it much. As long as he proceeded forth directly, he would definitely reach the end.</p><br/><p>‘Ding… congratulations \"Psychedelic Body\" leveled up.’</p><br/><p>‘Hm, level up?’</p><br/><p>Lin Fan was surprised, then began laughing. Other people walked for naught, but because he had a system, he gained experience by just walking.</p><br/><p>\"Psychedelic Body\" was a good skill, but it consumed a bit too much true energy.</p><br/><p>He only had 200 true energy at the moment. Lin Fan was dissatisfied with only possessing this little true energy, as using \"Psychedelic Body\" consumed 10 points of true energy each hour.</p><br/><p>If he were to run for his life, he would only be able to run for 20 hours.</p><br/><p>Also, the true energy wouldn’t automatically replenish if he didn’t have rest, which was quite troubling for Lin Fan. If Lin Fan had known his current situation would be like this, he would’ve attempted to learn more skills when he had entered the outer sect.</p><br/><p>Along the way, since it was temporarily safe, Lin Fan decided to sort through his loot.</p><br/><p>To be able to pull one over two pericelestial masters, Lin Fan’s heart raced with excitement even now; it was a once in a millennium opportunity.</p><br/><p>One level seven pericelestial while the other a level eight pericelestial, they were both more powerful than even Meng Yangquan.</p><br/><p>Lin Fan first checked the storage ring of Mo Yi Xuan. As he went through it, he found quite a number of items inside and wondered what they were.</p><br/><p>‘Ding… discovered a bottle of lower dark class medicinal pills, darkness pills*10.’</p><br/><p>‘Effects: After consumption will increase cultivation speed.’</p><br/><p>‘Ingestion increase: experience +50000.’</p><br/><p>Lin Fan was delighted. He hadn’t expected dark class medicinal pills… not bad, not bad. At the same time, Lin Fan came to understand that if he were to consume the medicinal pills for their experience, he should also check their effects.</p><br/><p>Medicinal pills that increased cultivation speed were naturally better than those support type healing medicinal pills.</p><br/><p>A bottle of ten darkness medicinal pills, Lin Fan dumped them all into his mouth as if they were candy.</p><br/><p>‘Ding… consumed ten darkness medicinal pills, experience + 500000.’</p><br/><p>After Lin Fan had eaten the medicinal pills, he continued searching. There were several other types of medicinal pills too, and it seemed this wave of looting paid off quite nicely.</p><br/><p>‘Ding… discovered a bottle of lower dark class medicinal pills, Golden purging pills*5.’</p><br/><p>‘Effects: After consumption, will purge all body injuries.’</p><br/><p>‘Ingestion increase: experience+60000.’</p><br/><p>Though Lin Fan hadn’t seen these types of medicinal pills before, he still understood their rankings: Saint-class, heaven class, earth class, dark class, light class, human class.</p><br/><p>These dark class medicinal pills were high ranked, but also at the same time not too high. If it weren’t for those two pericelestials hoarding these medicinal pills, it was unlikely he would’ve even been able to obtain any.</p><br/><p>Without any care, he then directly started pouring all the medicinal pills he could find into his mouth without even bothering to identify them first.</p><br/><p>‘Ding… consumed five golden purging pills, experience + 300000.’</p><br/><p>‘Ding… consumed one advantage god pill, experience + 100000.’</p><br/><p>‘Ding… consumed ten blood god pills experience + 200000.’</p><br/><p>…</p><br/><p>At the moment, Lin Fan had become addicted to the medicine. He then dumped out all the items within Ni Mantian’s ring ad grabbed anything that looked like medicinal pills, stuffing them into his mouth.</p><br/><p>Walking while stuffing his mouth, it felt very pleasant and luxurious.</p><br/><p>‘Ding… consumed one fusion sword pill, experience + 200000.’</p><br/><p>‘Ding… consumed six male and female pills, experience + 1800.’</p><br/><p>…</p><br/><p>‘Wait, what?’ Lin Fan had been joyfully eating the medicine and suddenly realized something was off. Why was the experience for this medicinal pill so little? Something must be wrong.</p><br/><p>These were the assets of a pericelestial master, how could there be such a low-rank medicinal pill.</p><br/><p>‘Ding… male and female pill.’</p><br/><p>‘Effects: temporarily prevents pregnancy during intercourse.’</p><br/><p>\"Pftt blah…\" Lin Fan began frantically spitting out the medicinal pills that he had placed into his mouth. ‘F*ck, I just swallowed birth-control pills. Freaking rip-off item! This medicine obviously belonged to Mo Yi Xuan, a pericelestial master. Ripping off a weak postcelestial like me, how low… what a complete rip-off!’</p><br/><p>Lin Fan grunted, ‘Whatever… It increased my experience by over a thousand. I will forgive you this time.’</p><br/><p>Lin Fan then slowed his pace when consuming the medicinal pills, and went through them carefully, afraid of any more mishaps and rip-offs.</p><br/><p>‘Ding… discovered Wuji White Phoenix pill*10.’</p><br/><p>‘Effects: provides nourishment for a woman’s menstruation period.’</p><br/><p>‘Ingestion increase: experience + 10000.’</p><br/><p>When Lin Fan reached the last bottle and found this medicinal pill, his expression became strange.</p><br/><p>‘This…this…Well, it’s a nourishment medicine… so let’s eat it.</p><br/><p>Lin Fan directly swallowed the Wuji White Phoenix pills without too much hesitation. He couldn’t give up on the one hundred thousand experience points after all.</p><br/><p>‘Ding… consumed ten Wuji White Phoenix pills, experience + 100000.’</p><br/><p>Lin Fan gave a burp after finishing all the medicinal pills; that was satisfying, extremely satisfying. Although the process was a bit annoying, the effects were well worth it.</p><br/><p>‘Ding… congratulations, character leveled up.’</p><br/><p>After finishing the last pill, his character finally leveled up; level two postcelestial successfully became level three postcelestial.</p><br/><p>But Lin Fan wasn’t completely satisfied. Although the two pericelestial had quite a number of medicinal pills, the ranks of them were rather low. After consuming this many and to only level up once...</p><br/><p>\"Hehh…\" Lin Fan shook his head in exasperation.</p><br/><p>If either Mo Yi Xuan or Ni Mantian were to find out that Lin Fan had just wastefully eaten all the pills like he just did, they would definitely die from vomiting too much blood. They had worked very hard to accumulate that many medicinal pills.</p><br/><p>Although they were both pericelestials, medicinal pills were still crucial for them.</p><br/><p>For example, the darkness pill, although the rank wasn’t very high, the effect was still very useful, as it could double one’s cultivation speed. Making them wasn’t difficult, but the ingredients for the medicinal pills were hard to find.</p><br/><p>Lin fan had wasted them all just like that, so it was rather heartbreaking.</p><br/>\n</div>"}