{"title": "Chapter 37: Everyone going all out", "id": 37, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-37-everyone-going-all-out", "volume_title": "Volume 1", "body": "<h1>Chapter 37: Everyone going all out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 37: Everyone going all out</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>A gust of wind gently passed through, stroking the two who laid under the vast sky, like a gentle pair of hands.</p><br/><p>Everything was absolutely silent and peaceful.</p><br/><p>The female’s beauty was unrivaled, her body proud. No female in the world would be able to resist bowing down to her. And the man exposed a strong muscular body, devilishly handsome, his motionless eyes staring into the unending space.</p><br/><p>The worth of his crotch was immense and manly, and although a white cloth was wrapped around his crotch, it couldn’t conceal the majesty that was hidden underneath.</p><br/><p>Ni Mantian had a dream. Inside the dream, she had become the queen of all beings and had led the Lianlong Sect to the highest plane. And the moment she sat on her throne, she felt a sound coming from the void beyond, and then, a pair of hands full of malice came crashing through the layers of the void and everything collapsed.</p><br/><p>\"Ah…\"</p><br/><p>Ni Mantian suddenly opened her eyes as a gust of cold air surrounded her. She then realized that her trusted sword was missing from her hand.</p><br/><p>‘What's going on?’</p><br/><p>Ni Mantian’s body trembled as she suddenly felt an unbearable pain surge forth from her chest. She then dropped to her knees, her previous flushed face turning pale and drops of beaded sweat dripping down from her hair, displaying another sense of style.</p><br/><p>Ni Mantian tried recalling what happened previously. A person had come, but the moment she closed her eyes, she suddenly lost all consciousness.</p><br/><p>‘What happened, just what had happened?’</p><br/><p>She was a level eight pericelestial, her mental concentration deep and impenetrable. How could she have briefly lost consciousness?</p><br/><p>As Ni Mantian was in utter confusion, she then read a distorted handwriting on the ground.</p><br/><p>\"This…\"</p><br/><p>The previously confused Ni Mantian suddenly became enraged, her expression became ice-cold.</p><br/><p>\"Lei Feng…\" Ni Mantian clenched her teeth in hatred.</p><br/><p>\"What happened…\" But by this time, Mo Yi Xuan woke up.</p><br/><p>\"Mo Yi Xuan, you…\" When Ni Mantian saw the area around Mo Yi Xuan’s crotch, a shiver ran through her entire body, \"You shameless person!\"</p><br/><p>\"Ni Mantian…you.\" Mo Yi Xuan paled upon seeing his own appearance, but upon seeing Ni Mantian’s appearance, he was simply shocked.</p><br/><p>‘How did her previous flat chest became like that?’</p><br/><p>And when Mo Yi Xuan saw the words written underneath his feet his, face instantly flushed red. But at the moment he was about to let loose, he felt a sudden pain surge forth from his crotch directly to his brain.</p><br/><p>\"Ah!!!\"</p><br/><p>The moment he screamed, the level seven preicelestial Mo Yi Xuan felt an unimaginable pain run through his entire body, causing him to tremble.</p><br/><p>Mo Yi Xuan tried enduring the pain, but the pain surged forth wave after wave like the tide, catching him off guard.</p><br/><p>\"Have I become wasted?\"Mo Yi Xuan heart was racked with horror, but he then realized that the treasure map of the seventh saint he had been clutching in his hand had gone missing along with his storage ring.</p><br/><p>\"The treasure map of the seventh saint… it’s gone…\" Mo Yi Xuan was horrified.</p><br/><p>Mo Yi Xuan wouldn’t have said anything if it was just the storage ring and his clothes that had gone missing. He would only feel regretful. But upon losing the legendary treasure map of the seventh saint, he completely lost control.</p><br/><p>Ni Mantian was also trying to endure the waves of pain in her chest, and upon seeing the claw marks on her chest, she realized what had happened to her. When Ni Mantian heard Mo Yi Xuan’s words, she became shocked as well.</p><br/><p>The treasure map of the seventh saint was gone?</p><br/><p>\"Bastard, even if I end up overturning my cultivation base, I will send you into the deep abyss.\" Ni Mantian lost her composure. That person had dared to do such things to her, it was unforgivable, completely unforgivable.</p><br/><p>Angering a pericelstial master was a scary thing.</p><br/><p>Before entering the pericelestial stage, one could still be considered human. But after entering pericelestial, one would no longer be human, but instead a celestial.</p><br/><p>\"Infinite Devil Cluster.\"</p><br/><p>Mo Yi Xuan invoked his pericelestial powers, his eyes burning with black energy and his momentum exploding, as he forcibly purged away all pains and distractions. He jumped into the sky, disregarding Ni Mantian.</p><br/><p>Even if he was wearing a white diaper, nothing could stop Mo Yi Xuan’s current prowess.</p><br/><p>A pericelestial’s momentum was evident at this moment.</p><br/><p>\"Infinite Devil!!!!\" Mo Yi Xuan floated in the sky and shouted out in rage. Swirls of black gas surrounded his hands, evil ghosts and spirits laughing within them as if they were about to be unleashed.</p><br/><p>\"Find him, even if you must turn the world upside down… find him.\" Mo Yi Xuan said with a wicked expression.</p><br/><p>\"Will of the Supreme Sword.\"</p><br/><p>Just as Mo Yi Xuan was invoking his Infinite Devil search, a will of the supreme sword containing immense bloodlust flew into the sky and penetrated through the layers of the clouds.</p><br/><p>The evil ghosts and spirits were instantly dispersed upon touching the swords.</p><br/><p>\"Ni Mantian, what are you trying to do?\"Mo Yi Xuan looked towards Ni Mantian with a dark expression.</p><br/><p>\"The map of the seventh saint must not fall into the hands of the devil sects.\" Ni Mantian drifted into the sky, magnificent swords cycling behind her back.</p><br/><p>\"Senior-sister…\" At that moment, a ray of light broke through the clouds in the distance.</p><br/><p>Mo Yi Xuan expression changed, \"Ni Mantian, you may have the upper hand today, but don’t get cocky. The side effects of invoking celestial powers aren’t something you can handle.\"</p><br/><p>\"Do you really think you can escape?\"The map of the seventh saint may have had been stolen, but Ni Mantian didn’t plan on letting the evil being in front of her go.</p><br/><p>Mo Yi Xuan looked coldly at Ni Mantian and clenched his teeth, \"Ni Mantian. Let’s see how you plan to stop me.\"</p><br/><p>At that moment, the momentum surrounding Mo Yi Xuan surged forth forcibly, tearing open a void, as his figure disappeared into it.</p><br/><p>Ni Mantian was startled. Tearing open a void was an ability of a lesser celestial, and Mo Yi Xuan was only a level seven pericelestial, which meant the void he opened was most likely unstable.</p><br/><p>A gamble against life or death.</p><br/><p>Ni Mantian’s face was currently ashen. A spurt of blood flew forth from her mouth, and she fell from the sky.</p><br/><p>\"Senior-sister…\" At this time, a group riding forth with their swords flew next to Ni Mantian. A woman among them held Ni Mantian with a worried expression on her face.</p><br/><p>\"Go, the person who stole the map of the seventh saint must still be near. He must be found.\" Upon saying this, Ni Mantian then instantly blacked out.</p><br/><p>The side effects of forcibly invoking limit-breaking celestial powers were huge, and Ni Mantian would only use them as a last resort.</p><br/><p>If she had let Mo Yi Xuan invoke his ability, then the person who had stolen the map of the seventh saint would have definitely been found.</p><br/><p>\"Senior-sister…\"</p><br/><p>\"Go, find…\"</p><br/><p>\"Yes.\"</p><br/><p>…</p><br/><p>Currently, Mo Yi Xuan was within the turbulent void, his breath becoming more and fainter. As he drifted unstably, the moment he was about to close his eyes, an ancient, dark, evil palace opened it’s doors.</p><br/><p>In the midst of a forest, devoid of people.</p><br/><p>On a flat ground, a pair of eyes was hidden within the dirt, occasionally blinking while looking at the figures flying through the sky.</p><br/><p>\"Haha, luckily, Yours Truly is smart and buried himself. Otherwise, I would have long been found by you lot.\"</p><br/>\n</div>"}