{"title": "Chapter 44: Lin Fan Becomes a Teacher", "id": 44, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-44-lin-fan-becomes-a-teacher", "volume_title": "Volume 1", "body": "<h1>Chapter 44: Lin Fan Becomes a Teacher</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 44: Lin Fan Becomes a Teacher</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>The Great Yan Dynasty had many people; an endless stream of vendors called out through the streets. Lin Fan watched the many different people on the streets, his mood pretty jolly as a result.</p><br/><p>Compared to living in the sect, Lin Fan preferred walking around here. But of course, this was short-lived. He still hadn’t thought about a long term stay here, because he was planning to become stronger and then return to surprise his fellow sect disciples.</p><br/><p>He wondered what would happen when he returned with an invincible cultivation base in front of his fellow brothers.</p><br/><p>Lin Fan happily walked down the lightly colored brick road aimlessly. He naturally wanted to tour the imperial city first.</p><br/><p>\"Fellow brother, are there any influential families within this imperial city?\"Lin Fan was drinking tea in an open-air tea stall as he asked casually.</p><br/><p>\"Yes, the Yan family, the Han family, the Xiao family, and the Yun family, these four families have a long history within the great Yan Dynasty. The reason we can now live peacefully is all thanks to those four families.\" The owner of the tea stall was a young man, and his expression lit up in admiration when he spoke about the four families.</p><br/><p>Lin Fan nodded, not asking anything more, then left the silver he obtained from Qu Xiang Ge before leaving, preparing to continue his tour of the imperial city.</p><br/><p>Lin Fan passed by many mansion compounds and also saw the houses of the four families the tea stall owner mentioned. Judging from their residence, it was as expected of the four families, magnificent and rich.</p><br/><p>Lin Fan had actually been thinking of an idea. Currently, he could only raise his cultivation base through killing people, killing monsters, and eating medicinal pills. For Lin Fan, eating medicinal pills was the most straightforward method, it was fast, and without side effects.</p><br/><p>But when Lin Fan arrived at a heavily guarded place, he stood there for a long time.</p><br/><p>This was the imperial palace.</p><br/><p>The Emperor of the Great Yan Dynasty resided here.</p><br/><p>This was a vast treasure house…</p><br/><p>This was also a difficult area to face…</p><br/><p>\"You there, what are you doing? Stop… don’t run.\"</p><br/><p>When Lin Fan saw the guards in front of the entrance come towards him, he ran away scared. At the same time he was angry, he was just observing, no need to be so unfriendly.</p><br/><p>After confirming that the guards were no longer chasing him, Lin Fan sighed in relief.</p><br/><p>Lin Fan was planning on investigating these places a bit more, and when he became familiar with them, he would then begin his plan.</p><br/><p>Sky Heaven School entrance.</p><br/><p>Lin Fan didn’t know where he was, but upon seeing the Sky Heaven School he stopped. There were two announcements on the entrance, seeing which Lin Fan then began thinking.</p><br/><p>Currently, he lacked an identity, but the Sky Heaven School was now seeking teachers and students.</p><br/><p>Of course, Lin Fan felt that the position of student was too low, so he would definitely go for the position of teacher. After all, he believed that he did possess the qualities for being a teacher.</p><br/><p>Currently, a long line formed in front of the Sky Heaven School. They were all young people, all seeming to be around the age of thirteen-fourteen.</p><br/><p>Lin Fan came to the other recruitment table, where there were no people.</p><br/><p>\"Hey, I am applying for the position of teacher.\" Lin Fan came to the other recruitment table and said.</p><br/><p>Sitting at the recruitment table was a fat man with a mustache. Upon seeing someone come to apply, he quickly sat up straight.</p><br/><p>\"You want to be a teacher?\"The fat man looked at Lin Fan with a small light in his eyes.</p><br/><p>\"Yes,\" Lin Fan nodded.</p><br/><p>\"Okay, the Sky Heaven School treats their teachers very lucratively, but first, you need to pay an application fee of twelve silver.\" The fat man said with a smile.</p><br/><p>Lin Fan wasn’t too concerned with the concept of money. It was all looted anyways, so he didn’t care about it, So, he threw numerous amounts of silver down onto the table.</p><br/><p>The fat man’s heart jumped with joy upon seeing the money. He then welcomed Lin Fan passionately.</p><br/><p>\"Follow me, as long as you pass the examination, you can become a glorious teacher of the Sky Heaven School.\" The fat man said.</p><br/><p>…</p><br/><p>The fat man soon brought Lin Fan to a wooden bamboo house, \"A person inside will examine you. I wish for your success.\"</p><br/><p>When Lin Fan entered, the fat man closed the doors, weighing the silver in his hand with a slight smile, \"Not bad, not bad… another twelve silver.\"</p><br/><p>The fat man believed that the person would soon be rushing out with his face beaten black and blue.</p><br/><p>This recruitment for teachers wasn’t fake, but the requirements were high. Numerous people had come to apply for the position of teacher when the Sky Heaven School began recruitment, but all of them failed.</p><br/><p>The fat man waited happily in front of the entrance, counting the time, wanting to see just how long the person could last.</p><br/><p>Then a person walked out from inside.</p><br/><p>The fat man was surprised, really, that quick?</p><br/><p>\"Fail?\"Seeing that the person was Lin Fan, the fat man said with a regrettable tone and a feeling of sympathy.</p><br/><p>Lin Fan flexed his neck, then smiled slightly.</p><br/><p>\"Take him to D-class.\" A voice came from inside, the voice was plain, but a trace of anger was brimming within it.</p><br/><p>The fat man froze in disbelief, the person had actually succeeded! Over a hundred people had applied before, and no one succeeded. This…this…</p><br/><p>But D-Class wasn’t really that good. It seemed that the person just got lucky and his strength wasn’t really that high. So going to teach these untalented disciples wouldn’t be a problem.</p><br/><p>\"Understood.\" The fat man responded respectfully towards the person inside, then took Lin Fan and left. Before leaving, Lin Fan looked back. This time, Lin Fan could accurately measure his strength.</p><br/><p>Lin Fan hadn’t used Twisting Heaven and Earth or Black Tiger Steals Heart. Instead, he used the proper techniques Immovable Imperial Fist and Wind Chasing Sword Skill. Lin Fan also understood now the advantage of having a large amount of true energy. It enhanced the damage of true energy.</p><br/><p>He currently had 2200 true energy, which could compete with a level five postcelestial, but fighting full force with pericelestials still needed to weighed.</p><br/><p>Then, the fat man brought Lin Fan to the living area of the Sky Heaven School.</p><br/><p>\"If you want to move in, just inform me. I will report the news of you becoming the teacher of D-Class as soon as possible, so you will be able to start tomorrow.\" The fat man then explained all the things clearly.</p><br/><p>\"How is this D-Class?\"Lin Fan was a little excited. This was his first time teaching students, so he wondered what would happen.</p><br/><p>The fat man looked at Lin Fan, \"The Sky Heaven School is split into the class ranks of A, B, C, and D. D-Class is the lowest in the school, which is composed of regular civilians. Their talent isn’t too good, and their future potential is limited.\"</p><br/><p>Li Fan rolled his eyes. That guy was way too narrow-minded. All he did was tear up the guy’s clothes, was there a need to place him in the lowest class?</p><br/><p>But the lowest class was also fine. ‘Yours Truly didn’t come to teach… I just came for the identity. The four families and the imperial palace will not escape from my grasp.’</p><br/>\n</div>"}