{"title": "Chapter 61: Physical Experience Is Better Than Words", "id": 61, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-61-physical-experience-is-better-than-words", "volume_title": "Volume 1", "body": "<h1>Chapter 61: Physical Experience Is Better Than Words</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 61: Physical Experience Is Better Than Words</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>\"Enlightenment: Let’s the students experience the teacher’s beauty, washes away the soul’s filth, truly unlocks the students loving soul.\"</p><br/><p>Lin Fan looked at the description and was confused. It was too ambiguous, who knew what the effects were to be like. But Lin Fan felt the effects shouldn’t be too shabby. Right now would be the perfect time to experiment.</p><br/><p>\"Alright, my dear students, I will help enlighten you all today and let your souls experience a wonderful release. My future glory will now walk alongside you all.\"Lin Fan didn’t know what this enlightenment was. He only knew that master monks would often help enlighten lost souls, but he had never heard of giving disciples enlightenment before.</p><br/><p>\"Teacher, what is enlightenment?\"Liu Shuishui looked puzzledly at her teacher, not understanding what he meant. She just felt that it sounded very complex.</p><br/><p>Lin Fan smiled slightly, his smile like a flower and his eyes tender and loving as he beckoned, \"Come, Shuishui, I will enlighten you first.\"</p><br/><p>\"Teacher you are so nice to me.\" Seeing her teacher’s loving smile, Liu Shuishui nodded happily and then ran up front to her teacher, awaiting his instructions.</p><br/><p>\"Well, you are my favorite female student after all.\"</p><br/><p>…</p><br/><p>Afternoon.</p><br/><p>Lin Fan absent-mindedly completed the morning's enlightenment. After finishing the last one, Lin Fan still hadn’t figured out what enlightenment actually did. He just felt a bit weird.</p><br/><p>He felt as if his own spirit had separated and entered into their bodies.</p><br/><p>Lin Fan didn’t understand this feeling, but whatever. Since he couldn’t figure out what enlightenment was, he’ll just let it be. Currently, he had three abilities, and having these students surpass others in a short amount of time shouldn’t be too much of a problem.</p><br/><p>Lin Fan placed these students in nurturing mode. Cultivating \"Titanium Grade Demon Body\" to level three was currently their most important task.</p><br/><p>Lin Fan wasn’t planning on staying too long at the school, and after hearing the Yan emperor and queen’s words, he felt he should return to the sect and tell this news to the sect’s people.</p><br/><p>The Saint Devil sect had been around for thousands of years, but Lin Fan didn’t think they could withstand a siege from numerous sects.</p><br/><p>\"Zang Tianhao, you piece of trash! Hurry up and disappear from junior sister Han’s side or I will make you pay.\"</p><br/><p>Currently, Lin Fan was exiting the Sky Heaven School when he heard an angry voice not far off. At first, he didn’t mind it, but when he heard the name Zang Tianhao, he became a bit interested.</p><br/><p>Wasn’t he one of the people Lin Fan had met in the forest. Lin Fan knew they were from the Sky Heaven School, but hadn’t thought about looking for them. If they did meet again, then it would be fate, but there wasn’t much point in actively seeking them out; he was still in quite a high danger zone after all.</p><br/><p>Lin Fan went over to spectate and saw a male looking down arrogantly at the collapsed Zang Tianhao. Judging from the clothes, he was an A class student.</p><br/><p>\"Xiaoze, you’ve gone too far. This is the Sky Heaven School, I, Han Mengmeng will be with whoever I want. You can’t stop me.\"Han Mengmeng was in a refined looking green clothing, but she was currently glaring angrily at the male.</p><br/><p>Xiaoze shook his sleeves, ignoring Han Mengmeng’s glare,\" Before, I wouldn’t have cared, but now your Han family is connected with my Xiao family through marriage. From now on, you better be careful about who you are with. The face of the Xiao family and Han family can’t afford to be lost by you.\"</p><br/><p>…</p><br/><p>Lin Fan rolled his eyes. Who’ve thought he would encounter this sort of bloody incident. It made him feel exasperated.</p><br/><p>\"Hmph, Zang Tianhao, a mere untouchable like you dares to eye my fiancée! Why don’t you take a look at yourself in the mirror? What, you want to fight me?\"Xiaoze said in a despising manner.</p><br/><p>Zang Tianhao drew his sword and looked unwaveringly at Xiaoze, \"I, Zang Tianhao, may have a lower cultivation base than yours. But even if I end up dying today, I will fight you to the death.\"</p><br/><p>\"Hmph, a mere speck of light dares to fight a ray of light like me? How about fighting me to the death on the fighting stage?\"Xiaoze said in disdain.</p><br/><p>\"Brother Zang, don’t be so rash. You must not fall prey to his schemes.\" Han Mengmeng quickly stopped him. Zang Tianhao shook his head. Even if ended up dying, he wouldn’t back down.</p><br/><p>…</p><br/><p>Lin Fan shook his head. Zang Tianhao was a bit too rash, he was young after all. A level two postcelestial against a level six postcelestial, when they fought on the stage, he would die instantly. They were acquainted with each other, so if he didn’t step out, then this really would get out of hand.</p><br/><p>Lin Fan was a man of justice, and this sort of ‘bullying the weak’ would naturally not be ignored by him.</p><br/><p>\"Ahem, you three students, I believe you all should calm down. A school is a place of learning, not a place for you all to settle personal vendettas.\" Lin Fan gave a light cough, his face calm, meticulous, as he stepped forth with his hands behind his back.</p><br/><p>A teacher’s pride was displayed flawlessly at this moment.</p><br/><p>\"Senior…\" Zang Tianhao and Han Mengmeng both instantly gasped when they saw who had stepped forth. They didn’t expect to meet senior Lin here.</p><br/><p>Originally to them, senior Lin was a foreign master. To even be able to forge a relationship with him was already a great fortune for them, but now, they unexpectedly had met him again within the school.</p><br/><p>Lin Fan looked at the two and nodded with a smile, then looked towards the imposing Xiaoze, \"As a student of A class, you are considered a senior. How could your mind be so small?\"</p><br/><p>\"Who are you?\"Xiaoze asked, obviously not even considering Lin Fan a threat.</p><br/><p>\"A teacher of D class.\" Lin Fan smiled, not feeling any shame from being a teacher of D class.</p><br/><p>But to others, this was a laughable matter. The surrounding students began laughing, wondering if this D class teacher was perhaps stupid?</p><br/><p>Xiaoze was a student of A class, the strongest group within the Sky Heaven School. Even a B class teacher wouldn’t dare to act presumptuously in front of him, let alone a D class teacher. They remembered that some time ago, a B class teacher had once offended Xiaoze. In the end, Xiaoze had brutally humiliated that teacher on the fighting stage.</p><br/><p>As expected, when Xiaoze heard the words D class, he scoffed and showed even more disdain. A mere D class teacher was practically no different than those garbage students from D class.</p><br/><p>\"A mere D class garbage dares to act mighty in front of me? Get lost.\"Xiaoze said coldly.</p><br/><p>Zang Tianhao and Han Mengmeng both froze, D class? How could senior be a D class teacher? With senior’s strength, he should be more than enough to be A class.</p><br/><p>As expected of senior, he couldn’t be judged from the ordinary viewpoint.</p><br/><p>Lin Fan looked at Xiaoze’s contemptuous expression, then shook his head regretfully.</p><br/><p>\"Everyone, look over there. What do you see?\"Lin Fan pointed towards the door. Everyone looked over puzzledly but didn’t see anything strange. Seeing the confused students not noticing what he was pointing at. Lin Fan then again shook his head regretfully.</p><br/><p>\"Physical experience is better than words.\" Lin Fan pointed towards the words carved on the stone tablet and said wryly.</p><br/><p>\"So you really won’t get lost?\"Xiaoze was angered at this moment. How did it become that a D class teacher dared to act so high and mighty in front of him?</p><br/><p>Lin Fan sighed. This kid was unteachable, but since he was now a role model, he could only make him repent.</p><br/><p>Lin Fan stepped forth one step at a time. Xiaoze was startled and retreated a few steps, but Lin Fan continued forth without any pause.</p><br/><p>\"Come with me to the fighting stage.\" Lin Fan said.</p><br/><p>\"Alright…\" Xiaoze laughed coldly. Since he had asked for it, he couldn’t blame it on others.</p><br/><p>\"Senior.\"Zang Tianhao and Han Mengmeng watched senior’s figure, not understanding why senior was doing this.</p><br/>\n</div>"}