{"title": "Chapter 64: All Sides Making Their Moves", "id": 64, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-64-all-sides-making-their-moves", "volume_title": "Volume 1", "body": "<h1>Chapter 64: All Sides Making Their Moves</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: All Sides Making Their Moves</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Xiaoze wanted to shout out to this bastard that he wasn’t wrong, but for some reason, he was conquered by the waves and waves of shame. Just like when a woman said she didn’t want it anymore and stop, but in the end, beg for one to go faster, while wanting to cry.</p><br/><p>Xiaoze essentially felt like that.</p><br/><p>\"I was wrong…\"</p><br/><p>At this moment, Xiaoze’s voice was hoarse, and it was like he was completely worn out. The spectating students were all stunned; to them, this all seemed surreal.</p><br/><p>The unparalleled thirteenth Xiaoze was defeated and brutally taught a lesson by a mere D class teacher. This had never before happened with the Sky Heaven School before.</p><br/><p>Xiaoze was really competitive. In their minds, Xiaoze was an unusually arrogant person who would never give in to anyone.</p><br/><p>This…this...They didn't know what to say at this moment.</p><br/><p>Lin Fan nodded his head in satisfaction. Under his loving guidance, this stubborn student admitted his errors in the end. This was a good thing.</p><br/><p>Deflowering Finger was a sinister technique in Lin Fan’s opinion. It could make one’s entire body numb and weak, from hard to soft.</p><br/><p>Lin Fan then gentle touched Xiaoze’s body with his finger, and with a clank, Xiaoze felt his body regain strength, and the previous powerless feeling disappearing.</p><br/><p>The first thing Xiaoze did after regaining his strength was to pull his pants up.</p><br/><p>\"To know how to admit your mistakes, you are not lost yet. From now on, be sure to act properly.\" Lin Fan sighed and said, he felt his responsibilities were far too great. To bring a lost sheep back onto the correct path in life brought a great sense of accomplishment.</p><br/><p>If he didn’t have other things to do, Lin Fan really wanted to teach for the rest of his life.</p><br/><p>\"Senior, watch out.\" Han Mengmeng suddenly cried out.</p><br/><p>The recovered Xiaoze flexed his body and his true energy surged suddenly as he angrily smashed his fist into Lin Fan’s chest. Flipping face just like that, it couldn’t be helped.</p><br/><p>For Xiaoze, the humiliation within his heart was still there. He needed to violently unleash it.</p><br/><p>His halberd was completely useless against this person, so the fist was obviously the same. But Xiaoze didn’t care as he just wanted to punch him.</p><br/><p>\"Bam…\"</p><br/><p>Lin Fan, who was initially immersed in his accomplishment, laughed awkwardly. He was unteachable, and this was quite enraging.</p><br/><p>Lin Fan turned his head, then looked at Xiaoze, \"Seems you haven’t taken the lesson to heart yet.\"</p><br/><p>Xiaoze jolted and retreated back while looking at Lin Fan with clenched teeth, then left without looking back. The students offstage stepped aside. They may have been all jolly when they were spectating, but now was different.</p><br/><p>Xiaoze may not have been a match for this D class teacher, but he could still squish all of them easily like ants.</p><br/><p>\"Senior, you’re so strong.\" Han Mengmeng went forth and exclaimed. She was dazzled by senior’s performance just now.</p><br/><p>\"What is the situation between you two and Xiaoze?\"Lin Fan asked.</p><br/><p>Han Mengmeng heard senior’s question and was a bit helpless. She then truthfully explained the situation.</p><br/><p>Lin Fan understood immediately, so that was the case.</p><br/><p>Han Mengmeng belonged to the Han family while Xiaoze belonged to the Xiao family. These two families forging a relationship through marriage was a normal thing.</p><br/><p>Within this realm, whenever big households forged marriages, they usually wouldn’t listen to the female’s opinions. An order from the older generations was essentially sacred and could not be denied.</p><br/><p>Xiaoze was notified of his future fiancee a few days ago. Naturally, he was indifferent, and would just follow the arrangements within his family.</p><br/><p>Since the two houses had forged a marriage together, Xiaoze couldn’t naturally allow his future fiancée to be close with another man, that too someone who he considered a piece of trash.</p><br/><p>Thus, the previous incident had occurred.</p><br/><p>Lin Fan didn’t want to interfere much in this matter. This was the problem of other families, and he was an outsider, so it was better not to interfere.</p><br/><p>He was planning on looting the four great families, so he didn’t have the energy to deal with this matter.</p><br/><p>\"This matter should be solved by yourselves. I have other matters, so I will be leaving.\" Lin Fan exited the school and waved goodbye to the two before leaving.</p><br/><p>Han Mengmeng and Zang Tianhao watched senior’s disappearing figure and clenched their fists.</p><br/><p>Today’s incident made Zang Tianhao feel a deep sense of danger, and towards Xiaoze, he had a deep sense of powerlessness.</p><br/><p>‘Become stronger, become stronger…’</p><br/><p>This strong urge to become stronger within his heart was a first for Zang Tianhao.</p><br/><p>\"I am going to become a disciple of senior.\" Zang Tianhao looked as if had made up his mind.</p><br/><p>\"Hah?\"Han Mengmeng froze, \"Brother Zang, senior is D class teacher. If you take him as your teacher, you will become a D class student. If you do that, you will no longer have the benefits of B class anymore.\"</p><br/><p>\"Whether it be A class or D class, senior is a powerful master. If I don’t take this chance, I am afraid I will end up losing you in the future.\" Zang Tianhao said.</p><br/><p>…</p><br/><p>After Lin Fan left the school, he wandered about around the city.</p><br/><p>He bought thirteen pieces of fine iron from a blacksmith, as he was preparing to make each of his thirteen students their own weapon.</p><br/><p>For the thirteen students, obtaining a good weapon was essentially impossible. They were students of D class after all. Also, he wasn’t planning on staying in the Yan Dynasty for long. He had more important matters to attend to after all.</p><br/><p>Lin Fan finished buying the materials and continued wandering around the city.</p><br/><p>\"Make way, make way.\"</p><br/><p>A thundering voice came from afar. Lin Fan and the civilians then stepped aside, watching as a line of people quickly passed through.</p><br/><p>\"Who are they? They seem to be quite important.\"Lin Fan was a bit curious. Seeing that they were in a hurry, he wondered if something had happened.</p><br/><p>\"It seems the Heaven and Earth commerce market is selling some sort of rare treasure.\"</p><br/><p>\"That was the Yun family symbol just now.\"</p><br/><p>\"Yesterday, I even saw those big-shots from Saint Devil sect appear within the city. They are likely also here for this sale.\"</p><br/><p>…</p><br/><p>Lin Fan listened carefully to the surrounding gossips. He froze when he heard the words Saint Devil Sect. He didn’t expect the Saint Devil Sect to send someone over. What kind of treasure was it to even make the sect take action?</p><br/><p>Lin Fan know had two things to do, one was to notify the sect’s person of the Yan Emperor and Queen’s plot, and the other was to perhaps take this treasure.</p><br/><p>\"Fellow brother, the big-shots from the Saint Devil sect you just mentioned that were in the city, do you know where they are currently?\"Lin Fan asked.</p><br/><p>\"My brother, your question is rather pointless. The Yan Dynasty is a subsidiary of the Saint Devil sect. If a big-shot came from the Saint Devil sect, they would naturally live there.\" The bearded man laughed and pointed towards the imperial palace.</p><br/><p>Lin Fan frowned upon contemplating the difficulty. He didn’t dare go if they lived in the palace. The Yan Emperor and Queen lived there, and those two were very strong. If he ended getting caught, it would be over for him.</p><br/><p>Lin Fan nodded then merged with the crowd. He wanted to see just what Heaven and Earth commerce market was selling that could attract so many people.</p><br/>\n</div>"}