{"title": "Chapter 76: Leveling Like Crazy", "id": 76, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-76-leveling-like-crazy", "volume_title": "Volume 1", "body": "<h1>Chapter 76: Leveling Like Crazy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 76: Leveling Like Crazy</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Lin Fan held his breath and observed the situation, preparing to strike whenever the opportunity presented itself.</p><br/><p>The male Burning Rhino was trying to conquer the female one and trying to suppress it while the Burning Rhino that had its gender changed was resisting ferociously. It couldn’t allow its opponent to succeed as it was a male Burning Rhino, and wondered what in the world was wrong with its companion.</p><br/><p>The fight became ever so fiercer as the bodies of the two Burning Rhino became increasingly scuffled. The Burning Rhino that had its gender changed was currently being dominated by the other and it wouldn’t be long when it would suffer its greatest pain.</p><br/><p>Lin Fan waited, his heart edging them to hurry up. He had been waiting for the most critical moment where he could take down both the Burning Rhinos at once.</p><br/><p>At this moment, the female Burning Rhino gave a cry as its hind legs bent while the male Burning Rhino rode ontop of it.</p><br/><p>The male Burining Rhino was injured, but it still reigned supreme and fought ferociously.,its huge body now moving back and forth as it reached the realm of ecstasy.</p><br/><p>\"Argh!!\"</p><br/><p>The male Burning Rhino roared out as its originally violent face revealed a human-like expression of pleasure.</p><br/><p>The opportunity had arrived.</p><br/><p>Lin Fan didn’t focus on any other matter, his movements swift as he was in stealth mode. The legendary brick in his hand whirled as he smacked it over the heads of the two Burning Rhinos.</p><br/><p>The male Burning Rhino still immersed in pleasure was thus knocked out before it could even react.</p><br/><p>The two Burning Rhinos laid there motionlessly as Lin Fan smiled. As expected, he had succeeded.</p><br/><p>Stealth mode, Twisting Heaven and Earth, and the legendary brick, the three were indispensable.</p><br/><p>Lin Fan took out the Purple Frost Sword and took the lives of the two Burning Rhinos. It was nearing night time, and Lin Fan didn’t want to stay for too long in case something else happened. He was lucky here, so he didn’t want to push his luck out any further. He had to leave.</p><br/><p>‘Ding… congratulations on defeating level two pericelestial wild beast, Buring Rhinoceros, experience + 10000000.’</p><br/><p>‘Ding… dropped Burning Rhinoceros life essence.’</p><br/><p>‘Burning Rhinoceros life essence: upon consumption will enter rage mode, obtaining the natural flames of the Burning Rhinoceros, pitch-black fire, side effects unknown.’</p><br/><p>‘Ding… congratulations on defeating level two pericelestial wild beast, Buring Rhinoceros, experience + 10000000.’</p><br/><p>‘Ding… dropped Burning Rhinoceros life essence.’</p><br/><p>‘Ding… congratulations, cultivation base level up.’</p><br/><p>‘Ding… congratulations, cultivation base level up.’</p><br/><p>‘Ding… congratulations, cultivation base level up.’</p><br/><p>The series of notifications surprised Lin Fan.</p><br/><p>Lin Fan opened his data panel, he had risen by three levels, and his cultivation base was currently at level nine postcelestial.</p><br/><p>‘Ding… cultivation base entered bottleneck, 100 million experience needed to level up.’</p><br/><p>Since his cultivation base was currently at a level nine postcelestial, the next step would be pericelestial stage. Because he had a system, his bottleneck wasn’t as crazy as other people, but the 100 million experience was still an astronomical number.</p><br/><p>It seemed that more effort would be needed if he wanted to enter pericelestial stage.</p><br/><p>The Burning Rhino was a wild beast among wild beasts. Once a Burning Rhino entered rage mode, it would fight its opponent to death, possibly due to their violent nature.</p><br/><p>Lin Fan looked at the two bright red life essences in his bag. They would likely come handy in the future, but he hoped he wouldn’t have to use them.</p><br/><p>Currently, a scent of blood was engulfing the area. Lin Fan didn’t stay any longer and continued on his way with his skill. He could only hope to safely arrive at the sect and report the Yan Emperor’s plot to the sect head.</p><br/><p>He traveled through the night and rested whenever he became tired. Once his true energy recovered, he would then continue. Along the way Lin Fan had encountered many wild beasts, but he ignored them all, not wanting to waste any more time.</p><br/><p>Unless he met a strong enough wild beast, Lin Fan wouldn’t even bother with them. He had been extremely lucky to meet the two Burning Rhinos. Pericelestial stage wild beasts usually lived deep within the forest, and wanting to meet them on the outskirts would depend on one’s luck.</p><br/><p>Two days later...</p><br/><p>Lin Fan saw the nine towering mountain peaks. He was looking forward to it a little in his heart, as he would soon reunite with his familiar brothers. He wondered what their reactions would be once they saw his very much alive self.</p><br/><p>Lin Fan had faked his death only to return alive. It would look dubious, but when he thought about the importance of his report, he decided to pay it no heed.</p><br/><p>Furthermore, distorting the truth was a specialty of Lin Fan, so it shouldn’t be too much of a problem.</p><br/><p>When Lin Fan passed the grave his brothers had dug for him he stopped. The black stone tombstone was engraved with his name.</p><br/><p>At the same time under his name, the names of his senior brothers were listed.</p><br/><p>Ni Mingyang, Yin Mo Chen.</p><br/><p>Inside the sect, those two had the best relationship with him.</p><br/><p>No matter what, Lin Faan needed to report the plot of the Yan Emperor to the sect. At the same time, he hoped his fellow brothers could avoid this confrontation. Their cultivation bases were too low, so if the Yan Emperor and other sects were to really attack, they would most likely die.</p><br/><p>He glanced at the fresh offerings on the ground. It was most likely his senior brothers who had recently come to visit him.</p><br/><p>As he thought about it, Lin Fan had an urge to cry. The way he had been acting as a human was well-earned, he hadn’t expected others to still remember him after his death.</p><br/><p>At the entrance of the Saint Devil sect’s stairs, two outer sect disciples were guarding the entrance at the bottom of the mountain. But at this moment, they saw a person rushing over from afar, so they called out strictly, \"Halt, who are you?\"</p><br/><p>\"My two junior brothers, I am the outer sect disciple, Lin Fan. I have urgent matters that I must report to the sect head, can I ask you two to let me through?\" Lin Fan said.</p><br/><p>\"Do you have your emblem?\"The two people carefully observed Lin Fan, their hearts on high alert. The person was of an unknown origin and he wasn’t carrying the Saint Devil sect’s emblem for disciples.</p><br/><p>Lin Fan sighed. It wasn’t possible for him to still have the emblem. Then without another word to them, his figure flashed and he directly rushed past them.</p><br/><p>\"Stop.\" The two disciples were shocked upon seeing the person daring to break into the Saint Devil sect. Then they began ringing the large iron bell beside them.</p><br/><p>Boom!</p><br/><p>The sound of the bell was loud and clear as it spread throughout the nine peaks.</p><br/><p>The outer sect disciples were conducting their daily business, but they became alerted upon hearing the bell sound from the bottom of the mountain.</p><br/><p>\"The disciples down the mountain rang the bell, did something perhaps happen?\"</p><br/><p>Everyone was startled. They didn’t know what was happening. This was the Saint Devil sect, did someone actually dare to trespass?</p><br/><p>Lin Fan continued rushing forth even after hearing the bell. This made things easier as he wouldn’t have to go searching for them now.</p><br/><p>\"Trespasser, halt now.\" Just as Lin Fan arrived at the top of the mountain, a figure crashed down upon himself.</p><br/><p>\"Senior brother, I am on your side.\" Lin Fan wasn’t looking for a fight as he had urgent matters to report to the sect head.</p><br/><p>Fourth level postcelestial.</p><br/><p>This person was an inner sect disciple. Normally in the Saint Devil sect, upon reaching postcelestial stage one would enter the inner sect. Very few would willingly remain in the outer sect.</p><br/><p>The inner sect disciple became shocked upon seeing the intruder enduring his sword with his bare flesh, then his momentum surged with a cry.</p><br/><p>\"Trespasser, how dare you barge into the Saint `Devil sect? Prepare to die!\" The inner sect disciple roared out in rage, wanting to slice Lin Fan’s hands into pieces. But even though he released his true energy to its maximum, the sword in Lin Fan’s hands still didn’t budge.</p><br/><p>\"Senior brother, I will help you.\" The disciples who were watching from the side all began rushing forth upon seeing their senior brother unable to defeat the intruder.</p><br/><p>\"Don't be too presumptuous.\" Lin Fan was feeling a bit angry now. Yours Truly had come all this way to help you all, and this is how you treat your benefactor?</p><br/>\n</div>"}