{"title": "Chapter 74: Ancient God Pills Are Naturally Not the Same", "id": 74, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-74-ancient-god-pills-are-naturally-not-the-same", "volume_title": "Volume 1", "body": "<h1>Chapter 74: Ancient God Pills Are Naturally Not the Same</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 74: Ancient God Pills Are Naturally Not the Same</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Although the start of the auction was somewhat passionate, they were all just minor scuffles. Since the lesser celestial pills hadn’t appeared yet, everyone still wasn’t going all out. Lin Fan sat down and glanced around, today’s auction wasn’t something simple, and a situation was bound to occur.</p><br/><p>Lin Fan had switched seats to one near the aisles during the auctioning. If anything were to happen, then he would immediately run.</p><br/><p>The Saint Devil sect disciples had already arrived in the city, but now they were nowhere to be seen. Something had happened obviously. It was highly unlikely they were all still sleeping, as they had come all this way for the lesser celestial pills and now were nowhere to be found.</p><br/><p>\"Alright, the next item will be the highlight of this auction.\"</p><br/><p>At this moment, the various sect leaders perked up. The lesser celestial pill was finally up, and everyone began rolling up their sleeves in preparation for the upcoming battle.</p><br/><p>Lin Fan sat in his seat frowning. It seemed they had already figured out he had stolen the lesser celestial pills and swapped them with another rip-off type of ‘pills’.</p><br/><p>\"The lesser celestial pills are items from the ancient times that the Heaven and Earth Commerce Market managed to obtain. Each one is incredibly valuable, and even those with low cultivation bases can instantly jump into the lesser celestial stage after eating one. Now, let us see the true appearance of the lesser celestial pills.\" The auctioneer shouted out in excitement, after all, this was a momentous occasion.</p><br/><p>The various sect disciples around the venue were all hooked, their eyes staring directly at the items on the stage. The auctioneer smiled, and opened the decorated case, then looked towards the ensnarled sect disciples and excitedly proclaimed.</p><br/><p>\"Everyone, behold the lesser celestial pills.\"</p><br/><p>At that moment, the sect disciples who saw the true appearance of the lesser celestial pill all gave a gasp.</p><br/><p>What…what kind of a lesser celestial pill is this?</p><br/><p>Lin Fan was initially curious, but upon seeing the lesser celestial pills on stage, he suddenly stood up dumbfounded.</p><br/><p>Wasn’t this the f*cking dump he took in the box? How was it still there? Didn’t the people of the Heaven and Earth commerce market check the item before the auction began?</p><br/><p>The auctioneer became even further excited upon hearing everyone’s gasps, \"Everyone, behold, these are the lesser celestial pills derived from the ancient times… Priceless treasures, they are truly priceless.\"</p><br/><p>\"Now then…let’s start the bidding…\" The auctioneer shouted. But when he glanced at the lesser celestial pills, he suddenly froze. What was this thing that looked like some sort of coiled up snake?</p><br/><p>This is…this is…</p><br/><p>The auctioneer smelled an odor and his expression suddenly changed, but when he saw the sect disciples suspicious expressions, he clenched his teeth down in silence.</p><br/><p>\"The auction has begun. The starting bid will be 100 million black gold coins.\" The auctioneer decided to go all out. He was certain this wasn’t the lesser celestial pill because he had been holding onto them. But now all of a sudden, they had somehow turned into this ‘thing’. Thus, he didn’t care anymore. He couldn’t afford any mistakes. Otherwise, it would mean his death.</p><br/><p>As soon as the auctioneer stopped speaking, the entire venue burst into an uproar. The various sects began discussing among themselves.</p><br/><p>\"This strangely shaped thing, is it perhaps really the lesser celestial pill?\"</p><br/><p>\"I don’t think so. It doesn’t have any trace of energy circulation within it… And just look at the thing… Its surface doesn’t have any shine to it, and it seems a bit hardened… It’s quite difficult to imagine it as the so-called legendary god pill.\"</p><br/><p>\"Why does it look like a pile of crap to me?\"</p><br/><p>\"Hey, don’t talk rubbish. This is the Heaven and Earth commerce market, they would never bring out a pile of crap for auctioning. Perhaps the pills from the ancient times are just different from ours.\"</p><br/><p>\"Hard to say, hard to say… I had some doubts when I saw it.\"</p><br/><p>\"What do you lot understand? How can you understand the concept of a godly pill? If it was that easy to understand, would it still be called a god pill?\"</p><br/><p>…</p><br/><p>Lin Fan secretly listened in on the surrounding discussions, the corner of his mouth twisting into a smile. He felt very amused, who would’ve thought they would bring out his pile of crap for auctioning.</p><br/><p>And judging from the auctioneer’s face, he was trying to pretend it was real and treat it as the lesser celestial pill up for auction.</p><br/><p>But, he just didn’t know what would happen next.</p><br/><p>\"Everyone, please listen to me. This is an item from the ancient times, so naturally it appears strange. It’s reasonable for it not to have any energy circulation flowing from it. Otherwise, it wouldn’t have lasted up till now. If you don’t believe me, we can choose someone from the venue to test it out. Then we will all know if it’s real or not.\"</p><br/><p>\"Of course, this godly pill can boost one into the lesser celestial stage, but since we will just be slicing a thin piece off, it won’t be able to permanently raise your cultivation base. But still, it should temporarily boost your cultivation base.\" The auctioneer at this point was just making it up as he spoke.</p><br/><p>He actually didn’t know what would happen, or why the lesser celestial pill had turned into this thing. But he knew one thing for sure. This was a pile of crap, and although he didn’t know who the owner of the pile of crap was, he would definitely capture them after this was all over.</p><br/><p>No, there was actually no need to capture them, since they most likely consumed those pills they probably exploded and died.</p><br/><p>\"The person over there, please come onto the stage.\" The auctioneer pointed to a person near the stage. The person walked onto the stage without any expression and glanced at the auctioneer while slightly nodding.</p><br/><p>\"Everyone, please watch carefully now. We will now see if it’s real or not.\" The auctioneer said. He picked up a tool from the side and lightly scraped the surface. A pungent odor assaulted his nose, causing the auctioneer to gag and his eyes to water.</p><br/><p>The person on stage looked coldly at everyone in the venue and then received the thing from the auctioneer, then swallowed it without any hesitation. Lin Fan’s heart was pounding rapidly as he sat there. Who was this guy, how did he swallow that thing without any reaction. This was far too presumptuous.</p><br/><p>Currently, all the sect disciples were staring straight at the person who swallowed the pill. They wanted to see if there were any effects. If there were, then no matter what, they would do all they could to obtain this pill.</p><br/><p>At this time, Lin Fan was surprised. The auctioneer had quietly retreated and had disappeared off the stage.</p><br/><p>Lin Fan had a bad feeling, and instantly rose while entering stealth mode. But he realized at that point that the entrance was closed, and the doors were glowing with a sort of strange runes while sending out bursts of light, as if it were some kind of formation. The entire venue appeared like it had been sealed.</p><br/><p>\"Hey, what is happening to the person?\"All the various sect disciples were in shock as the person had suddenly started swelling. Was there something up with the pill?</p><br/><p>The person who had gone up to experiment was swelling up currently, and plumes of red smoke overflowed from his body, as if he would explode at any time.</p><br/><p>Lin Fan began running without any hesitation and looked for cover.</p><br/><p>\"Bam...\"</p><br/><p>Not long after, Lin Fan heard sounds of uproar coming from the venue as if something had happened.</p><br/><p>Lin Fan continued running straight ahead while in stealth mode until he reached the very end. He didn’t know what was going on, but it definitely wasn’t anything good.</p><br/><p>This was really all too strange, just what was the Yan Emperor planning?</p><br/><p>Dangerous, it was far too dangerous.</p><br/><p>Lin Fan felt terror for the first time. ‘My god, I want to go home. I don’t want to hang around outside anymore… The outside world is far too dangerous.’</p><br/>\n</div>"}