{"title": "Chapter 78: Swearing to the Heavens", "id": 78, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-78-swearing-to-the-heavens", "volume_title": "Volume 1", "body": "<h1>Chapter 78: Swearing to the Heavens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 78: Swearing to the Heavens</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>\"Junior brother Lin, why do you need to see the grand master.\" Meng Yangquan asked. Although he trusted Lin, he would get blamed even though he was a Pericelestial level apprentice if Lin Fan just wanted to talk about something insignificant.</p><br/><p>Lin Fan may be hard to read, but his power was too insignificant. Something major for him may just be a something minor thing for Meng Yangquan.</p><br/><p>‘Currently, this matter should be known by as few people as possible. But Meng Yangquan likes Mu Chenyu. If I do not tell him about the matter because of her presence, he will get upset with me.</p><br/><p>\"Senior brother, during the time I faked my death and left the sect, I lived in the Great Yan Dynasty. Coincidentally, I heard that the Yan Emperor is planning to work with some other sects to attack our sect. So I came back immediately to warn the grand master.\" Lin Fan did not keep any secret.</p><br/><p>Mu Chenyu’s facial expression changed a little. Some light flashed in her eyes, but was hidden immediately.</p><br/><p>\"Impossible. The Yan Emperor is only level seven Pericelestial. Even he got ten more pairs of balls, he would not do this. He cannot endure the consequences.\" Meng Yangquan heard it but did not believe it. The Great Yan Dynasty relied on Saint Devil Sect for hundreds of years. In his opinion, it did not have the ability to rebel against Saint Devil Sect.</p><br/><p>Although the Great Yan Dynasty had the Sky Heaven School, Meng Yangquan thought that the school was vulnerable. The headmaster, who was the strongest in the school, was just at the Pericelestial level. Those students posed even less of a threat.</p><br/><p>\"This kind of matter is not trustworthy to report to the grand master. If this is a joke, it will be fine for me to see you get punished, but do not drag Meng Yangquan into this.\" Mu Chenyu looked at Lin Fan with scorn, \"Although the Yan Emperor is only a Pericelestial, you are just an outer sect disciple. It is impossible for you to conduct eavesdropping on him.\"</p><br/><p>\"Junior brother, this joke is not funny.\" Meng Yangquan shook his head.</p><br/><p>At this time, Lin Fan gets anxious. Why did he not believe him? However, if he put himself into Meng Yangquan’s shoes, he could understand why he could not believe him.</p><br/><p>However, why did they think the Yan emperor was just at the Pericelestial level? He had reached the Lesser celestial level now.</p><br/><p>Ni Yangming stood aside and had no way to join the conversation. He did believe Lin Fan, but he had not heard the intel himself. It was also true that it was impossible for Lin Fan to conduct eavesdropping on the Yan Emperor.</p><br/><p>\"Senior brother, it is true! I swear to the heavens. If what I said is fake, I will die by being struck by heavenly lightning.\" Lin Fan said solemnly.</p><br/><p>During the time Lin Fan was traveling back to Saint Devil Sect, Lin Fan was not sure if the emperor had started to take actions or not. The time was limited, and he needed to warn the sect to be prepared. It was better than realizing it when the enemy would have arrived.</p><br/><p>Meng Yangquan looked at Lin Fan’s face and was a bit surprised. If it were true, it would be a true disaster.</p><br/><p>\"Meng, if this is true, will the sect move away?\" Lin Fan asked.</p><br/><p>\"No.\" Meng Yangquan answered. \"Saint Devil Sect has existed for a long time. Even if a catastrophic event happened, we have to defend the sect at all cost. We will live if the sect lives, we will die if the sect dies.\"</p><br/><p>\"Senior brother, if this is fake, no one will be harmed. However, what I said is true. If you let me see the grand master, I will show evidence to convince our grand master.\" Lin Fan spoke seriously.</p><br/><p>Meng Yangquan thought for a while, staring at Lin Fan and wishing to judge his real thoughts.</p><br/><p>Lin Fan stared back fearlessly. He did not want to lose his only home in this new world.</p><br/><p>Although Lin Fan was just an outer sect disciple, so what? If the sect were in trouble, even a servant would help. If one kept oneself away from trouble, was one still a man?</p><br/><p>\"Senior brother, what are you thinking? This sounds like a rumor.\" Mu Chenyu said hurriedly. Meng Yangquan always responded to her demands. He always listened to her.</p><br/><p>\"Junior brother, I will bring you to the grand master.\" Meng Yangquan said after thinking for a while.</p><br/><p>\"Senior brother, why do you believe them?\" Mu Chenyu said with an unpleasant tone, but a glimpse of worry flashed in her eyes.</p><br/><p>\"Yu’er, I believe Lin Fan will not make this kind of a joke. If this is true and it is not reported, it will cause a huge disaster.\" Meng Yangquan said solemnly.</p><br/><p>Lin Fan and Ni Mingyang were extremely happy, \"Thank you for believing us, Brother Meng.\"</p><br/><p>\"You and I belong to the same sect. I should not doubt you, and this is too important. I have to be cautious. I wish it is fake, but if it is true, it will be a nightmare for our sect.\" Meng Yangquan said with conflicted feelings.</p><br/><p>\"I wish so too, but I heard it with my own ears.\" Lin Fan said.</p><br/><p>\"Let’s go.\" Meng Yangquan said.</p><br/><p>Mu Chenyu saw Meng Yangquan believing them, hence got upset and left in a flurry. When she got outside, her facial expressions changed.</p><br/><p>‘How does an outer sect disciple know this kind of intel?’</p><br/><p>....</p><br/><p>The ninth mountain was surrounded by the other eight mountains. It was high up in the clouds, the place where the grand master lived.</p><br/><p>The ninth mountain hid in the clouds, and was way more marvelous compared to the other eight mountains. White cranes were flying over, and it just seemed like heaven. There was also a great palace hidden in there. It was marvelous, beautiful, holy, and mysterious.</p><br/><p>Outer sect disciples were not allowed to enter the ninth mountain. Even Inner sect disciples would be checked based on their seniority. However, Meng Yangquan was leading the way, so the process was easier.</p><br/><p>When Lin Fan saw the surroundings clearly, he was shocked by the beauty. This was the core of Saint Devil Sect.</p><br/><p>If this great place were ruined by others, it would surely be a pity.</p><br/><p>\"Yangquan, why do you bring these two outer sect disciples here?\" A man wearing gray clothes asked seriously.</p><br/><p>\"Level eight Pericelestial.\"</p><br/><p>This guy’s power was level eight Pericelestial. He was much stronger than Meng Yangquan.</p><br/><p>He was a middle-aged man, but still looked older when compared with Meng Yangquan. His potential was not impressive compared to Brother Meng, as he definitely began training earlier than Brother Meng.</p><br/><p>\"Elder Qingfeng, I brought these two here because of something related to the survival of our sect.\" Meng Yangquan said respectfully.</p><br/><p>\"Grand master is meditating. You can report it to me.\" Elder Qingfeng said blandly, clearly not believing them.</p><br/><p>\"This matter has to be reported to the grand master directly. Elder Qingfeng, please allow us.\"</p><br/><p>\"Yangquan, I think you are falling behind. Did you become dumb in the outer sect? Rules are rules. The grand master is meditating. You want him to come out of meditation?\" Elder Qingfeng responded angrily.</p><br/><p>\"Elder Qingfeng, this is very important.\" Meng Yangquan was perturbed, trying to convince the elder.</p><br/><p>\"Hmm, nothing is more important than grand master’s meditation. Go back.\" Elder Qingfeng was angry by now. This Meng Yangquan was an inner sect disciple. He should know the rules. The grand master cannot quit his meditation just like that.</p><br/><p>At this time, the palace of the ninth mountain was right in front of them. However, an elder was blocking their way. If no action were taken, they would not be able to pass.</p><br/><p>Meng Yangquan was very polite to the elder, so the grand master was needed to be forced out somehow.</p><br/>\n</div>"}