{"title": "Chapter 79: A Storm is Brewing", "id": 79, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-79-a-storm-is-brewing", "volume_title": "Volume 1", "body": "<h1>Chapter 79: A Storm is Brewing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 79: A Storm is Brewing</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>\"Outer sect disciple Lin Fan needs to see the grand master.\" Lin Fan shouted as loud as he could.</p><br/><p>\"Shut up. Grand master is meditating. No one is allowed to disturb him, especially a mere outer sect disciple like you.\" Elder Qingfeng was now losing the little patience left in him. However, Lin Fan had no time to listen to the elder. He knew if he did not see the grand master now, he would not be able to see him again.</p><br/><p>On the side, Meng Yangquan was shocked. He did not think Lin Fan would shout like that. He knew it was forbidden to speak loudly in front of the ninth palace. However, it seemed that it was the only way to get to the grand master, especially when this Elder was blocking their way.</p><br/><p>\"Disciple Meng Yangquan needs to see the grand master. This is about the survival of the sect...\" Meng Yangquan used all his power to shout, sounding like lions and dragons roaring together.</p><br/><p>‘Oh jeez! Senior brother’s shouting is powerful!’ Lin Fan’s ears were hurting due to the shout. What Brother Meng used must be an advanced sound martial skill.</p><br/><p>\"How dare you shout in front of the palace. Just wait as I catch you for punishment.\" Elder Qingfeng was out of breath from the rage. His hand was glowing with green light, trying to catch Meng Yangquan.</p><br/><p>This hand was so powerful that it seemed to catch the world in its grasp.</p><br/><p>\"Blue heaven palm.\"</p><br/><p>Meng Yangquan became serious and activated his power, ready to face the elder.</p><br/><p>\"Disciple Lin Fan needs to see the grand master.\"</p><br/><p>\"Grand master, the disciple has very important things to report.\"</p><br/><p>...</p><br/><p>Lin Fan shouted as loud as he could, but his shouting never got a response. It was like a stone thrown into an ocean. Lin Fan was getting more and more nervous. Senior brother Meng’s level was two levels behind the Elder’s. There was no way he could win. If grand master did not show up, both of them would be caught.</p><br/><p>But when Lin Fan looked over, he couldn’t help but be shocked. Meng Yangquan actually had a huge advantage over Elder Qingfeng.</p><br/><p>‘This is impossible!’</p><br/><p>There was no time to feel surprised. So, Lin Fan kept shouting as loud as he could.</p><br/><p>\" Junior brother Qingfeng, what is wrong?\" At this time, another person came over.</p><br/><p>\"Senior brother, come arrest these two. These two bastards are shouting in front of the palace.\" Elder Qingfeng shouted with joy. He had not thought Meng Yangquan could suppress him. He was stronger than him, but he was suppressed now, which is unacceptable.</p><br/><p>Lin Fan looked at the person who was coming over. He was terrified, because that person was at the Lesser Celestial level. The difference between levels was too great. If this man took action, there was no way Brother Meng would be able to resist.</p><br/><p>He had to do something quick, or things would get too out of hand.</p><br/><p>\"Grand master, what are you meditating for? Your sect is going to be destroyed by others. Are you deaf or what?\" Lin Fan shouted without any burden.</p><br/><p>Meng Yangquan almost passed out when he heard what Lin Fan said.</p><br/><p>‘Why was junior brother Lin so disrespectful towards the grand master?’</p><br/><p>The man who just came over heard the disrespectful statements, and attacked immediately in a tremendous rage. The space seemed to bend due to the power, making Lin Fan feel it hard to breathe or move at all.</p><br/><p>Lin Fan was shocked beyond words, \"Am I going to die again?\"</p><br/><p>\"The eighteenth elder, please have mercy.\" Meng Yangquan shouted when he saw the eighteenth elder attacking. If Junior brother Lin took that hit, he would surely die, unlike the last time. However, he was not powerful enough to be able to save Lin Fan now. He could only wish the eighteenth elder would be merciful enough not to kill Lin Fan.</p><br/><p>\"Hmm, disrespecting the grand master, the punishment is only death.\" The eighteenth elder said cruelly. He did not intend on holding back at all.</p><br/><p>As Lin Fan was waiting for the inevitable to happen, the space suddenly froze, and the attack stopped midway, disappearing into the air without reaching Lin Fan.</p><br/><p>\"All of you can stop now.\" At this time, a voice came out of the palace.</p><br/><p>\"Grand master.\"</p><br/><p>Lin Fan felt released. This must be the grand master. At this urgent time, the grand master saved him, and he could feel tremendous gratitude towards him.</p><br/><p>Lin Fan thought while sighing in relief, \"Good, good… If I died here, it would have been bad.\"</p><br/><p>\"Everyone, come in.\"</p><br/><p>...</p><br/><p>Meng Yangquan was also relieved. If the grand master had not acted just now, the consequences would have been terrible. Both the eighteenth elder and Elder Qingfeng felt that the disrespectful disciple should be executed.</p><br/><p>Lin Fan looked at them without any worries. They were going to kill him, but the grand master stopped them. He had faith in the grand master, and knew he could rely on his sound judgment. Lin Fan thus followed everyone into the palace, filled with confidence.</p><br/><p>Within the palace, there was nothing but eight pillars. At the center of the pillars was a man in common clothes, sitting peacefully in a meditative stance.</p><br/><p>Level three Greater Celestial!</p><br/><p>When Lin Fan saw him, he was really shocked because he was the first Greater Celestial level person he had ever met.</p><br/><p>And this man was also a level three Greater Celestial.</p><br/><p>However, Lin Fan was not happy at all. He was even more worried.</p><br/><p>The grand master was a level three Greater Celestial, but The Yan Emperor still dared to work with other sects to attack Saint Devil Sect. This meant that all other grand masters must have power as strong as his grand master.</p><br/><p>\"Grand master.\"</p><br/><p>...</p><br/><p>\"Em. So you are the one who thinks I am deaf?\" The grand master sat there and asked without any emotions.</p><br/><p>Lin Fan got nervous as he heard the question. The grand master was bearing grudges! This was getting different from what he had thought while entering the place.</p><br/><p>\"I did not really mean that, grand master.\" Lin Fan could not act relentlessly. If he angered the grand master, he could wipe him out without even moving his finger.</p><br/><p>A man should be able to step forward and retreat.</p><br/><p>The grand master looked at Lin Fan and asked, \"What is so important that you two have to risk your lives to see me?\" Meng Yangquan looked at Lin Fan and nodded. He knew only Lin Fan could explain everything thoroughly.</p><br/><p>\"Grand master, I overheard the Yan Emperor in the Great Yan Dynasty that he is going to work with other sects to attack our sect.\" After Lin Fan finished speaking, both the eighteenth elder and Elder Qingfeng exclaimed in shock, \"Impossible.\"</p><br/><p>The grand master raised his head as his eyes lit up.</p><br/><p>\"You are just an outer sect disciple. How dare you say this? Why is the Yan Emperor working with other sects to attack us? We have good relationships with the other sects.\" Elder Qingfeng elder shouted.</p><br/><p>\"Grand master, Elder, what I said is the truth. The Yan Emperor appears to be a Pericelestial, but he is actually a level seven Lesser Celestial. Other sects agreed to attack us because the grand master acquired some sort of God blood.\" Lin Fan did not keep any secrets. He knew if he did not divulge everything he knew, no one would believe him.</p><br/><p>\"What? How did they know?\" Both elders were surprised.</p><br/><p>The God blood was a huge secret of the sect. Yet, other people knew about it.</p><br/><p>\"No, no, you are lying. You say the Yan Emperor is level seven Lesser Celestial. So how did you hear their conversation?\" Elder Qingfeng could just not buy his story.</p><br/><p>At this time, grand master looked at Lin Fan with curiosity. It seemed that he too wanted to know the truth.</p><br/><p>\" I got a special martial skill before. If one practices it to a high level, I will become invisible, and there will be no traces of me. When I got to the Great Yan Dynasty, I had nothing to do, so I became a teacher at the Sky Heaven School. One day, the Yan Emperor and his wife came to visit the school, where I heard their conversation while I was invisible.\" Lin Fan decided to come clean. He also went into stealth mode to prove his statement.</p><br/><p>\"What a skill!\" Everyone in the hall was amazed by the martial skill.</p><br/><p>Even the grand master was moved. ‘When the disciple disappears, it is true that no traces can be found. This is an incredible martial skill!’</p><br/>\n</div>"}