{"title": "Chapter 71: Tragic Huang Xiaochun", "id": 71, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-71-tragic-huang-xiaochun", "volume_title": "Volume 1", "body": "<h1>Chapter 71: Tragic Huang Xiaochun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 71: Tragic Huang Xiaochun</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Before he started leaving, Lin Fan came over to Manyou Er’s bedside. He extended a finger and with a single stroke, \"Deflowering Finger\" activated and made her body powerless. But Lin Fan didn’t think it was safe enough, so he also attacked with a \"Black Tiger Steals Heart\"</p><br/><p>Manyou Er’s chest was very beautiful. Lin Fan was afraid of single handedly destroying this beauty, and only after attacking and seeing that they still looked the same did he become relieved. ‘If she still has enough power after this attack to get up and find me, I, Lin Fan, will submit to you.’</p><br/><p>He had gained experience after using \"Black Tiger Steals Heart\" on Manyou Er’s body. Unfortunately, he had more important matters to attend to. Otherwise, he would love to stay and level up a little.</p><br/><p>After exiting, Lin Fan closed the doors to Manyou Er’s room, and glanced around for a bit. There were already several sect disciples who had taken the women from Moon Whisk Tower into the rooms. As for these sect disciples, Lin Fan naturally disdained them. These rich fellows were likely the sect’s leading people, and he naturally had to be careful of them. Just their cultivation bases alone were way higher than him.</p><br/><p>Lin Fan carried the idea of helping those who could be helped. Those who couldn’t be helped, he could only give up on them.</p><br/><p>After Lin Fan finished saving a leader of the Universal sect, an uproar came from the outside. \"Hunyuan sect’s Huang Xiaochun, get out here right now…\" Manyou Er’s energy surged within the Moon Whisk Tower. A dissatisfied, cold, and murderous momentum surrounded her, which also interrupted many lovely happenings going on in the premises.</p><br/><p>The sect disciples that were enjoying their time with the Moon Whisk Tower’s women were scared stiff by this voice and narrowly avoided disaster.</p><br/><p>The doors to many rooms opened as the sect disciples rushed out, their faces filled with discontent, preparing to punish the person that had interrupted their great time. Some disciples with lower cultivation bases paled instantly upon seeing Manyou Er. But still, although they were scared of Manyou Er, they brutally \"punished\" her in their minds.</p><br/><p>\"Woman, what the hell are you screaming about?\"At this moment, a leading disciple of Hunyuan sect came out wearing thin clothes, his face incredibly furious. He had almost reached climax, but had been scared by this woman, causing ‘it’ to shrink back.</p><br/><p>For him, this was a major rip-off.</p><br/><p>\"Hunyuan sect’s Huang Xiaochun, get out here right now.\" Manyou Er’s soft and weak appearance had disappeared, and she was now as cold as ice.</p><br/><p>She had awoken only to find that the medicinal pills and black gold coins within her storage ring had all disappeared. Aside from that, her chest was surging with an unbearable pain.</p><br/><p>That damn brat had stolen her stuff and then brutally assaulted her. She had to make him pay.</p><br/><p>\"What do you want from my junior brother Huang?Are you perhaps not satisfied yet and want to…hehe\" The Hunyuan sect disciple laughed pervertedly.</p><br/><p>\"Shut up.\" Manyou Er snapped.</p><br/><p>\"What, do you perhaps want to fight?\"The Hunyuan sect disciple didn’t retreat. Even if Manyou Er was a level two pericelestial, it didn’t mean anything to him; he wasn’t scared of her.</p><br/><p>\"Stop arguing, let’s talk it out. Manyou Er, why are you looking for Hunyuan sect’s Huang Xiaochun? If you don’t explain, how will we know what’s going on?\"A Wind Sword sect disciple said in a teasing manner.</p><br/><p>They were all familiar with the Infinite Flower sect’s disciples. They were wonderful, wonderful like a surging wave, wonderful to the point their entire body became ****.</p><br/><p>The other sect disciples began joining in. Their fun in bed had been interrupted, so they might as well listen in on the situation.</p><br/><p>\"Senior brother, Senior brother…\" At this time, a pungent smell wafted in, and a person covered in unknown black and yellow stains came rushing over. The Moon Whisk Tower had been reserved by the thirteenth prince for the entertainment of the sect disciple, so naturally other people weren’t allowed inside.</p><br/><p>But this person smelled so foul that the security guarding the entrance couldn’t bear it and also ran aside. Thus the person managed to rush all the way inside. The Hunyuan Sect disciple wearing thin clothes instantly paled and shouted upon seeing the foul-smelling person rushing towards himself.</p><br/><p>\"Stop, don't move.\"</p><br/><p>\"Senior brother, I am Huang Xiaochun.\" The person covered in filth shouted out hoarsely. His eyes were glistening with tears, as if he had suffered some sort of ultimate humiliation.</p><br/><p>\"Junior brother?\"The Hunyuan sect disciple froze in disbelief. How was this his junior brother Huang?</p><br/><p>\"Despicable brat, prepare to die!\" At this time, Manyou Er’s momentum surged upon hearing the name \"Huang Xiaochun\" and attacked without another word.</p><br/><p>A pink silk cloth full of true energy lashed towards Huang Xiaochun.</p><br/><p>\"Manyou Er, don’t get too ahead of yourself. As if I will let you kill one of my fellow Hunyuan sect disciples.\" Li Haoran stepped forth to shield Huang Xiaochun, but he didn’t dare step too close.</p><br/><p>\"Junior brother, what happened to you?\"Li Haoran asked.</p><br/><p>Upon seeing his senior brother ask that, the grievances within his heart burst forth like a never-ending river.</p><br/><p>\"Senior brother, I was ambushed by someone.\" Huang Xiaochun began wailing, then started explaining all the tragic happenings that had occurred to him. Huang Xiaochun initially had thought he could obtain a treasure, but ended up being ambushed. When he woke up, he realized he was tied up and his entire body was numb and powerless.</p><br/><p>Huang Xiaochun wanted to struggle but couldn’t muster any strength. Then an unfortunate situation happened. As Huang Xiaochun was struggling, he ended up accidentally falling into the feces pool.</p><br/><p>With his hands and feet tied up, the powerless Huang Xiaochun even ended up swallowing a few mouthfuls of waste products, but was unable to climb up. If a person hadn’t happened to be passing by and used a pole to lift him out, he would’ve…he would’ve…</p><br/><p>Huang Xiaochun couldn’t bear to continue on any further.</p><br/><p>\"Senior brother, you have to avenge me. Otherwise, I can’t live on anymore.\" Huang Xiaochun was dreadfully pained as tears streamed down his face.</p><br/><p>Li Haoran was serious. This was his junior brother Huang’s first time outside the sect, and he had encountered this sort of situation. Just how would his junior brother Huang view the world from now on?</p><br/><p>‘No, as his senior brother I must avenge him.’</p><br/><p>\"Junior brother, who did this to you? Do you know him?\"Li Haoran asked.</p><br/><p>\"Senior brother, I don’t know his name, but he is tall and skinny. He was cleanly shaven, his appearance average. Also, he stole my invitation.\" Huang Xiaochun shouted out tearfully.</p><br/><p>Manyou Er’s expression changed. It seemed that that person had impersonated Huang Xiaochun.</p><br/><p>\"Ah…someone help, thief.\" At this moment, screams sounded out from within many rooms, startling everyone outside. Lin Fan had long secretly retreated by then. No matter what had occurred inside, he had retreated without a single look back.</p><br/><p>It would become dangerous if he stayed any longer.</p><br/><p>He had stolen from a few sect leaders, and then even Huang Xiaochun arrived. If he were caught, then it wouldn’t be something as simple as a beating. He would most likely end up being sliced and diced into pieces.</p><br/>\n</div>"}