{"title": "Chapter 86: Death is Not Scary (End of Act 1)", "id": 86, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-86-death-is-not-scary-end-of-act-1", "volume_title": "Volume 1", "body": "<h1>Chapter 86: Death is Not Scary (End of Act 1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 86: Death is Not Scary (End of Act 1)</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>\"I… will make you die with my sect...\" A voice filled with irreconcilable hate and anger came out of the storm.</p><br/><p>\"Everyone watch out… This is strange...\" The nine grand masters frowned simultaneously. This power was too much for even them, and they had to be careful.</p><br/><p>What did this last disciple use to gain this much power?</p><br/><p>Lin Fan stood in the storm, looked at the nine sects and started to laugh. The brutal power seemed to have consumed his consciousness.</p><br/><p>However, the last will stayed in his mind.</p><br/><p>Kill everyone, let them pay.</p><br/><p>\"Hong...\"</p><br/><p>A think dark light flew into the sky. At this time, Lin Fan finally appeared out of the storm. The nine sects’ disciples looked at him and almost lost their minds with the terror.</p><br/><p>Was this a human or a devil?</p><br/><p>A tall and red body, with black flames covering completely… The black eyes reflected the scary, raging power. His eyes were surrounded with a dark flame as well, and the sharp claws felt sinister and cold.</p><br/><p>Scary, too scary.</p><br/><p>Saint Devil grand master looked at this disciple and was stunned. ‘What had happened?’</p><br/><p>Power...This was the Greater celestial level power.</p><br/><p>What was this method? He could boost himself to the Greater celestial level?!</p><br/><p>The power was more evil than even the devil, more violent than even monsters.</p><br/><p>Lin Fan moved, his eyes without a single emotion as they looked once at the disciples of the nine sects. They finally stopped at one disciple and refused to move away.</p><br/><p>\"Senior brother Ni, I will avenge you.\" Lin Fan’s voice sounded evil, as if he were an ancient devil. While the nine grand masters and Heaven Queen were staring unblinkingly at Lin Fan, they realized that he had actually disappeared without them realizing.</p><br/><p>\"How dare you...\" At this time, the black cloak king realizes something. He saw Lin Fan charge into nine sect’s disciples.</p><br/><p>‘You...\" That level eight pericelestial disciple’s face turned pale when he saw this devil appearing right in front of him. He tried to resist, using his strongest attack to hit Lin Fan.</p><br/><p>\"PONG...\"</p><br/><p>The disciple was happy to know that he hit the target. But suddenly, he started to scream.</p><br/><p>\"My hand.\" A sliver of dark hell flame went into his hand. He tried to put it out, but he was unable to.</p><br/><p>\" I will cut you in pieces.\" Lin Fan grabbed that disciple with his giant devil hand.</p><br/><p>\"Stop.\" The Black cloak king saw this and yelled out hurriedly while rushing towards them. This was a level eight pericelestial disciple, he could not die that easily. Lin Fan smiled cruelly. In a flash, he tore that disciple into pieces with both his bare hands. Blood flew everywhere, making the atmosphere feel bloody to all the senses.</p><br/><p>\"Haha...\" Lin Fan’s eyes lit up, and he started to attack the other disciples.</p><br/><p>\"Kill my brothers? I will kill you all.\" Lin Fan charged at those disciples who were too scared to even move. His limited consciousness urged him to kill all of them to avenge his brothers.</p><br/><p>\"Bastard.\" Black Cloak king knew he had to act urgently. However, whenever he acted, Lin Fan would disappear.</p><br/><p>\"Over there.\" Black Cloak King was a Greater celestial level master. He could sense Lin Fan easily, but he was still not able to follow, leave alone intercept him.</p><br/><p>Meanwhile, screams were resounding everywhere. Lin Fan used extremely brutal and bloody ways to kill each sect’s disciples.</p><br/><p>Their bodies were gone. That pair of devil hands tore every enemy disciple into pieces. The dark hell flame subsequently tortured them till they lost their last breaths.</p><br/><p>Kill</p><br/><p>Kill</p><br/><p>Lin Fan only knew how to kill right now, his eyes filled with bloodlust.</p><br/><p>\"Bastard, stop.\" Black Cloak King looked at what was happening and shouted. \"What are you looking at? Stop him or all our disciples will be dead.\"</p><br/><p>The other grand masters came out of their stupor and acted immediately. If they let that guy keep killing, everyone would truly die.</p><br/><p>\"Good, good, good kills...\" Saint Devil grand master laughed while lying on the ground. His tears were flowing out of his eyes like the blood of the enemy disciples, soon dyed red.</p><br/><p>\"Saint Devil grand master, let me kill you first.\" The grand masters yelled to somehow change the momentum of the fight.</p><br/><p>\"Keep him alive, we need to know where the god blood is.\"</p><br/><p>...</p><br/><p>Nine grand masters acted together, trying to kill the last disciple. Lin Fan laughed all this while madly, ignoring the interceptions of the nine grand masters completely. He went only and only for those disciples.</p><br/><p>\"I want to see whether your heart is black or not.\" Lin Fan shouted, as his claw penetrated a disciple’s chest and pulled his heart out.</p><br/><p>\"Grand master, help!\"</p><br/><p>\"He is the devil!\"</p><br/><p>Now, disciples from the nine sects were screaming for help. The devil was killing everything in his path, and these disciples, who all were mighty pericelestial warriors, were crying like babies in the face of a monster.</p><br/><p>The sky was raining down blood. The entrance of the sect was covered with blood as a result of the slaughter that took place earlier, along with what was going on right now.</p><br/><p>Lin Fan needed to use those bastards’ blood to avenge his brothers.</p><br/><p>\"Die...\" Black Cloak King finally found a chance and attacked Lin Fan’s back with a powerful hit. At this time, the nine grand masters blocked his path and used their strongest attacks to stop him.</p><br/><p>Lin Fan shouted in maniacal rage in a voice that could no longer be described as anything related to a human, as dark hell flame rose up around him. \"I will kill you all.\"</p><br/><p>Lin Fan charged at the blue sea old lady, whose one arm had been cut off by the Saint Devil grand master earlier. The old lady had lost an arm, and consequently had become weaker. But still, she smiled when she saw Lin Fan charging at her.</p><br/><p>\"You really have a death wish.\"</p><br/><p>Her Phoenix head stick pointed towards Lin Fan with a green light glowing on it, which suddenly blasted with a fierce noise and power</p><br/><p>\"Pu...\"</p><br/><p>Lin Fan did not dodge it at all, letting the green light pass through his body. He had lost all thoughts of self-preservation by now, and the only thing in his mind was about killing all his enemies and using their blood to satisfy his fallen brothers.</p><br/><p>\" I want you to die.\" Lin Fan shouted, his mouth full of blood. He knew that though his power had increased, he had no chance to live under the attack from the nine grand masters. Lin Fan just wanted to at least take one with him.</p><br/><p>By this time, the other grand masters reached close and attacked together.</p><br/><p>\"Pu...\"</p><br/><p>Lin Fan spat blood from his mouth violently, but he was not going to stop.</p><br/><p>\"Blue sea old lady, just die.\" Lin Fan used his claw and punched at the chest of the old lady. Dark hell flame released from his body was just like fire snakes, wanting to consume the old lady alive. Her faces turned pale and blood rushed out of her mouth.</p><br/><p>\"Slice.\"</p><br/><p>At this time, a light flashed sharply, as Yan Emperor charged his sword from the side and sliced off the arm Lin Fan used to attack the old lady.</p><br/><p>\"Yan Emperor...\" Lin Fan saw the old lady pull out his arm, and start to heal herself. He stared at the emperor with eyes full of hatred.</p><br/><p>\"Kill him.\"</p><br/><p>\"Wait...\"</p><br/><p>The Heaven Queen spoke up at this point</p><br/><p>Lin Fan stood there weakly, the dark flame becoming smaller and smaller, seeming to die at any moment. Blood soaked his body, a body that was full of holes.</p><br/><p>\"Haha...\" Lin Fan laughed bitterly. There was no hope now, but he still did not give up. He just felt a regret, ‘Why could not I get stronger just by a little.’</p><br/><p>\"Let me ask you, what happened to you when you consumed the Almighty pill.\" Heaven Queen asked Lin Fan while looking at him.</p><br/><p>\"You gave that to me?\" Lin Fan asked the beautiful Heaven Queen calmly.</p><br/><p>\"Yes. It was a little gift for you to thank you for helping me. If you do not want to die, then you will tell me.\"</p><br/><p>...</p><br/><p>\"Hehe...\" Lin Fan smiled and looked at the sky. \"Death is not scary. If you really want to know, I will tell you.\"</p><br/><p>\"Heaven Queen, you want to save him?\" People from nine sects were shocked.</p><br/><p>Although this guy consumed the blood of Flame Heaven Rhino, Heaven Queen could probably use her amazing skills to keep him alive. If he lived, the consequences would be horrible for them.</p><br/><p>The Heaven Queen was displeased and stared at the nine grand masters in silent rebuke. The nine masters did not dare to act, so Heaven Queen looked at Lin Fan and said, \"Fine.\"</p><br/><p>Lin Fan moved his body slowly, each step leaving a blood print. His back was hit by eight grand masters and was totally ruined. Even the undead body could not resist such a torment. Lin Fan moved to the front of Heaven Queen slowly, stared at the queen’s clear eyes and said, \"I just want to tell you alone.\"</p><br/><p>\"Fine.\" Heaven Queen did not refuse, her eyes flashing with unclear motives.</p><br/><p>Lin Fan bent his body and got close to her ears, \"Actually..\"</p><br/><p>\"Senior Brother Meng, I will avenge you...\"</p><br/><p>\"Pu...\"</p><br/><p>Lin Fan suddenly bit at the neck of the Heaven Queen. Those devil teeth got into the Heaven Queen’s slender neck, ready to bite off a huge chunk of flesh.</p><br/><p>\"Peng...\"</p><br/><p>The Heaven Queen was startled and punched Lin Fan away with a sudden burst of power. Her white neck had red bite marks clearly visible on t, and blood was flowing freely out of it.</p><br/><p>\"How dare you...\" The Heaven Queen’s face was like frost with anger. The nine grand masters were so afraid that their heartbeats seemed to be ready to stop at any time.</p><br/><p>\"Haha...\" Lin Fan laughed madly, spurting even more blood out of his mouth in the process. But still, he could not stop laughing like a maniac.</p><br/><p>\"Grand master, I tried my best… I did not bring shame to the sect.\" Lin Fan looked at the grand master, his power getting weaker and weaker. The time duration of the title and the blood was almost over. His body was shrinking, and had started to return to its normal state.</p><br/><p>\"Well...well.\" Saint Devil grand master laughed madly. \"Heaven Queen, Black Cloak King, Yan Emperor, Blue Sea Old Lady… all of you from the nine sects, you will all regret this...\" He shouted angrily, and suddenly, his power increased tremendously, as a sense of death started bursting out of his body.</p><br/><p>\"Damn, the old guy is going to detonate himself.\" The nine grand masters got nervous. The result of self detonation of a Greater celestial level fighter was unimaginably powerful.</p><br/><p>At this time, black lights blinded everyone’s eyes. But on the other side, Lin Fan saw a token flying towards him. At the same time, a drop of golden blood came out of the grand master’s forehead.</p><br/><p>Saint Devil grand master put the God blood into Lin Fan’s head while saying.</p><br/><p>\"Go back… to the final destination. Tell the original sect… I am sorry...\"</p><br/><p>...</p><br/><p>\"The sense of the God blood...\"</p><br/><p>At the time, Heaven Queen and nine grand masters detected the sense of the God blood.</p><br/><p>\"It is bad! We were tricked.\"</p><br/><p>At the same time, Saint Devil grand master’s body that was expanding swiftly started to shrink suddenly like a broken balloon. All the power he generated was taken by the token.</p><br/><p>...</p><br/><p>When the light finally disappeared, Lin Fan was nowhere to be seen. Saint Devil grand master’s body was only left in the form of a skeleton, all of his energy taken away.</p><br/><p>\"What happened?\" The nine grand masters looked at each other confusedly. Heaven Queen looked around the place and frowned.</p><br/>\n</div>"}