{"title": "Chapter 88: Official Integration", "id": 88, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-88-official-integration", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Official Integration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: Official Integration</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Lin Fan was sitting on his bed. The death of his senior brothers had made him incomparably sad. His tears would come out of his eyes whenever he thought about them, and all the scenes he saw as his sect was completely annihilated.</p><br/><p>\"Since you are alive, you should face the future. Getting lost in pain is just the action of the weak.\" A voice came over as two people were seen coming from outside.</p><br/><p>Wuya and Yan Zhanwen looked at the disciple, then sighed.</p><br/><p>\"Who are you? What is this place? I...\" Lin Fan saw the unknown people, searching for answers to clarify the situation he was in right now.</p><br/><p>\"Slow down. One by one.\"</p><br/><p>\"This is the Glory Sect. It is also the headquarter of the Saint Devil Sect. Saint Devil grand master used all of his power to activate the token to send you back.\" Wuya said.</p><br/><p>Lin Fan was shocked to hear this news. This was the headquarter, it is what the grand master always talked about. He never thought the grand master would sacrifice himself to send him back.</p><br/><p>\"Is this Xuan Huang world? Can I still go back?\" Lin Fan asked with a small flicker in his eyes.</p><br/><p>\"This is Xuan Huang world. But here is the Dongling Continent. There is a hell sea between the Cangling Continent and us. It is very difficult for you to go back… Even we cannot even do that.\" Wuya replied calmly.</p><br/><p>Lin Fan heard it and couldn’t help but clench his fists. As long as it was possible to go back...</p><br/><p>\"Who are you?\" Lin Fan looked at the two. If this were the headquarter, they would be able to send him back.</p><br/><p>\"I am the senior elder of Glory Sect, Wuya.\"</p><br/><p>\"Senior elder of Glory Sect, Yan Zhanwen.\"</p><br/><p>\"You want us to send you back? But this is impossible, even for our grand master.\" Wuya figured out Lin Fan’s thoughts and hurried to stop him from delving into them more.</p><br/><p>\"Why?\" But at this point, there was no way Lin Fan could just give up.</p><br/><p>\"Long time ago, the legends say that an ultimate being wanted to stop the civil war in Xuan Huang World. Therefore, he cut the world in half. Unless you can find the token which the ultimate one left, you have no way to go back. Of course, two tokens have been used. We are not sure if there are more.\" Wuya said with a slight awe hidden in his voice.</p><br/><p>\"You can stay in the sect. Grand master gives you two choices. One is to come back to the Glory Sect and become a disciple. Another is to give you the unnamed mountain, and you will be the sixth grand master of Saint Devil Sect, in order to continue its legacy.\"</p><br/><p>Lin Fan looked at Senior elder Wuya and said without hesitation, \"I will pass down the legacy of Saint Devil Sect.\"</p><br/><p>\"Are you sure?\" Wuya tried to confirm his choice.</p><br/><p>\"I am sure. Grand master sacrificed his life to send me here. I cannot forget the vengeance. I will find the token to go back to Cangling Continent to avenge my sect.\" Lin Fan answered firmly, his voice shaking with unresolved emotions. He just could not forget the blood feud that now existed between him and the nine sects.</p><br/><p>\"Fine. When you are recovered, I will bring you to the unnamed mountain. Of course, you have to be prepared, there is nothing in the mountain. You have to rely on your own.\" Wuya said with a nod.</p><br/><p>\"Thank you, Senior elder.\" Lin Face bowed gracefully.</p><br/><p>...</p><br/><p>The two people talked for a little while with Lin Fan and then left the room.</p><br/><p>\"Senior brother, why did you tell him about the token? Letting him have some day dreams?\" Senior elder Yan said disapprovingly.</p><br/><p>\"Junior brother, with hope, there could be a miracle.\" Wuya smiled and left the place without saying anything.</p><br/><p>...</p><br/><p>In the next couple of days, Lin Fan recovered swiftly. His body hurt really bad this time, more than ever before. Lin Fan was sleeping most of the time in order to recover. But today, he finally felt that his body was good now.</p><br/><p>Lin Fan tried to open his panel to check his status. However, when he pulled out his panel, he was shocked.</p><br/><p>There was no response, no matter how hard he tried.</p><br/><p>Impossible!</p><br/><p>Now, Lin Fan’s face turned pale.</p><br/><p>His only way to take revenge was the system, but it was gone now.</p><br/><p>\"Ding, the Strongest System fuses officially.\"</p><br/><p>Lin Fan was so glad he almost cried out on hearing the sound of the system.</p><br/><p>But the moment he tried to say something, he went into a deep coma.</p><br/><p>He did not realize how long had passed, but when he opened his eyes, it was dawn outside. Lin Fan checked his status at once.</p><br/><p>What was this official fusion? What happened to the system? Lin Fan opened the panel and checked it carefully.</p><br/><p>Name: Lin Fan</p><br/><p>Power level: Level one postcelestial</p><br/><p>Body: Level one pericelestial</p><br/><p>Potential: unlimited</p><br/><p>Bloodline: None</p><br/><p>Skill: Yin-yang, boost, stealth</p><br/><p>Advantage: Making weapons, teaching students</p><br/><p>Backpack: Nine five big red brick, map of the seven holy treasures</p><br/><p>...</p><br/><p>All the previous panels were gone, and in its place was this new panel. Lin Fan could feel all his martial skills still in his mind. He even felt that he could move as he wished. It was like all those skills had become part of him, feeling much better than before.</p><br/><p>The panel in the past seemed advanced, but he realized that this one was way better. There were some more options. Lin Fan had no idea what they were for, especially the power level. How could he only be at the post celestial level?</p><br/><p>He was going to reach the pericelestial level.</p><br/><p>But Lin Fan did not sense that he had become any weaker.</p><br/><p>What did actually change? He needed to study a little, as just simply guessing wasn’t going to be of any help.</p><br/><p>He had not stepped out of his door for days. He wanted to check it out and find Senior elder Wuya. He needed to see the unnamed mountain.</p><br/><p>Lin Fan opened the door, feeling incomparably warm as the sunshine fell upon him. He looked far into the distance. There were so many buildings and people everywhere. This was the Glory Sect, much stronger and more prosperous than the Saint Devil Sect.</p><br/><p>On the way, Lin Fan saw many disciples from the Glory Sect, and many novel things. The size of the Glory Sect was beyond Lin Fan’s imagination. After visiting some places, Lin Fan finally met Senior elder Wuya midway.</p><br/><p>\"Looks like you have recovered. Let me take you to the unnamed mountain.\" Senior elder Wuya knew Lin Fan had exited his room, so he had come to pick him up.</p><br/><p>What they reached was an empty mountain. It was at the north west of the Glory Sect, and belonged to the back of the sect. For years, no one had passed by, and it was a mountain that had been forgotten by the disciples.</p><br/><p>\"Thank you Senior elder.\" Lin Fan looked at Wuya while bowing, and saw his power level.</p><br/><p>Peak Greater Celestial level</p><br/><p>Although there was no change in level per se, Lin Fan knew that this senior elder Wuya was much stronger than Saint Devil grand master.</p><br/><p>When Lin Fan followed him to finally reach the unnamed mountain, he was shocked by what he saw.</p><br/><p>Empty, quiet, uncivilized</p><br/><p>This was going to be the new place for Saint Devil Sect.</p><br/><p>\"This is what you need to know, check it out. This is all that we can do for you. You chose this road, so no complains. You have the same privileges as other disciples of the Glory Sect. How far you can go all depends on you.\" Senior elder Wuya reminded Lin Fan.</p><br/><p>\"Many thanks to the Glory Sect.\" Lin Fan bowed respectfully.</p><br/><p>\"Em.\" Senior elder Wuya nodded and left. That was all he could do. Lin Fan needed to rely on himself now to grow.</p><br/>\n</div>"}