{"title": "Chapter 81: No Where to Go, Can Only Fight", "id": 81, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-81-no-where-to-go-can-only-fight", "volume_title": "Volume 1", "body": "<h1>Chapter 81: No Where to Go, Can Only Fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 81: No Where to Go, Can Only Fight</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>It was dark outside while the sect was filled with a dark atmosphere of chaos on the inside. Lin Fan stood next to the exit, watching those disciples take off their uniforms and put on regular clothes. He couldn’t help but feel depressed.</p><br/><p>The majority of people still choose to leave. There were not too many who were left.</p><br/><p>Indeed, life was more important.</p><br/><p>\"Senior brother Han.\"</p><br/><p>\"Junior brother Fang.\"</p><br/><p>At this time, Lin Fan saw Fang Han and Han Lu who he had been against earlier. Fang Han and Han Lu saw him as well and frowned a little.</p><br/><p>\"Junior brother Lin, are you not leaving?\" Han Lu asked.</p><br/><p>\"No, I am not. Senior brother Han, Junior brother Fang, I offended you before, and I would like to apologize to you right now.\" Lin Fan wanted to clear out things, considering this might be the last time they would see each other.</p><br/><p>\"Do not worry. They were just minor issues. I am not that mean.\" Han Lu laughed without any happiness. He was not sure what that ba*tard was thinking.</p><br/><p>\"Between you and me, did you offend me before?\" Fang Han asked in confusion.</p><br/><p>Lin Fan stopped for a second, then smiled and waved his hands. \"No, I remembered something wrongly, my bad…ahahaha.\"</p><br/><p>Right now, Lin Fan needed to maintain a good impression. Junior brother Fang’s dorm was destroyed by him. As he did not know that, so it was unnecessary to admit it and create a negative feeling.</p><br/><p>\"Junior brother Lin, see you then.\" Han Lu took his package and left. As he stepped out of the sect, he glanced at Lin Fan with a smile. It seemed he could not take his revenge now. But the other sects would do it for him.</p><br/><p>Han Lu never wished to stay and defend the sect. He had a great tool which could help him get really powerful in the future. There was no need to lose his life here. If he was successful in the future, he could repay the sect by avenging it then.</p><br/><p>Fang Han was the same. He had just looked for shelter in the Saint Devil Sect. Now that the sect was in great danger, there was just no need to stay. He was going to be a Devil Emperor in the future. It was not worthy to fight for the sect. The sect did not have that kind of a value for him, the future emperor, to fight for it.</p><br/><p>After the two of them left, Lin Fan sighed. It seemed that the sect had lost its prosperity.</p><br/><p>\"Em...\"</p><br/><p>At this moment, Lin Fan saw an acquaintance, a very familiar man.</p><br/><p>\"Senior brother Wang...\" Lin Fan called out with a passion. Wang Tianfeng looked at all those junior brothers who had he bullied leaving the sect. He was really upset. However, he heard someone calling his name, so he turns around to check it out.</p><br/><p>\"You...\" Wang Tianfeng was too shocked to believe Lin Fan was here. He hated him to the bones, and even wanted him to turn into ashes.</p><br/><p>This guy attacked his private part, but shouldn’t he be dead? How did he appear again?</p><br/><p>Wang Tianfeng did not know that Lin Fan had returned. Now that Lin Fan showed in front of him, he was intensely surprised. He thought he might actually be seeing a ghost.</p><br/><p>\"Senior brother Wang, you have not left yet?\" Lin Fan was surprised. Wang Tianfeng always bullied weak junior brothers. According to common sense, he should have been leaving right now. Surprisingly, he was still here.</p><br/><p>\"It is none of your business. Leave me alone.\" Wang Tianfeng said after mustering up some courage. He was afraid that Lin Fan would attack him again. That experience left a mark on Wang Tianfeng, and he could never forget that pain.</p><br/><p>Lin Fan smiled, this senior brother was just dirty. However, this might be the last conversation, so Lin Fan stopped bothering him.</p><br/><p>Suddenly, Lin Fan felt someone looking at him, making him feel anxious. When Lin Fan checked it out, he saw a junior sister smiling at him, but did not remember who she was.</p><br/><p>Lin Fan smiled back, without knowing who she was.</p><br/><p>\"Ah...there are monsters....\"</p><br/><p>Meanwhile, screams started coming from the foot of the hill.</p><br/><p>Lin Fan paid attention immediately. Monsters? There were monsters at the foot of Saint Devil Sect hill?</p><br/><p>By now, those disciples who were leaving ran back into the sect.</p><br/><p>Many junior brothers ran away from the foot of the hill while looking shocked. Some looked frightened beyond words while some even had blood on them.</p><br/><p>\"There are so many monsters in the forests at the foot of the hill. When we got there, we were attacked right away. Too many...too many.\" A disciple was so scared that one might think it was hell down there.</p><br/><p>Lin Fan’s facial expression changed as he sighed. It looked like even running away was not possible. The Yan Emperor and other sects probably had taken actions already. They were going to wipe them out completely. They hid the monsters in the forests. If the disciples went down, they would be attacked immediately</p><br/><p>The outer sect disciples were not able to fight those monsters. Even the weakest monster was at the postcelestial level. The outer sect disciples surely could not resist them.</p><br/><p>\"What should we do? Monsters have blocked our way. There is no way to run.\"</p><br/><p>\"I just saw a senior brother at the postcelestial level being eaten by the monsters.\"</p><br/><p>\"Scary, it is too scary. We are going to die here.\"</p><br/><p>\"I do not want to die here. I am the only boy of my family. I came here to learn skills.\"</p><br/><p>...</p><br/><p>At this time, it was completely chaotic. These disciples who were forced back sat on the grounds without spirits. It seemed like they had lost faith in their futures.</p><br/><p>Fang Han and Han Lu returned as well, still scared and in shock. These monsters were too brutal, and they could not fight against them.</p><br/><p>If they were not fast enough, they would be the monsters’ food.</p><br/><p>Now, what should they do? How could they die here? They were still too young.</p><br/><p>\"Calm down...\" An elder showed up at this moment. In front of the crisis, he could not do anything. There were monsters at the foot of the hill, and there was no way of escaping.</p><br/><p>The elder showed up, but it was of no use. Those disciples were in panic now, and they seemed to have lost the ability to listen. Lin Fan looked at those lost disciples and shook his head. The times were truly difficult.</p><br/><p>Lin Fan raised his head and saw the clouds changing colors.</p><br/><p>Maybe the Yan Emperor and other sects had rallied outside of the Saint Devil Sect.</p><br/><p>Lin Fan checked his own data carefully. After all this training, Dragon King Hegemony had reached level two. At the same time, Faceless Sky Demon had reached level two as well. His power level had raised by 5000 points.</p><br/><p>He could fight, but just not enough.</p><br/><p>Death was not fearful, but he needed to die with dignity.</p><br/><p>\"Hu....\"</p><br/><p>A cold wind suddenly blew across the area. Lin Fan looked into the distance, seeing the bright flashes in the distances.</p><br/><p>\"They are coming?\"</p><br/><p>Lin Fan closed his fists. This was the first hard battle of his life.</p><br/>\n</div>"}