{"title": "Chapter 98: Remember, Say What You Can Do", "id": 98, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-98-remember-say-what-you-can-do", "volume_title": "Volume 1", "body": "<h1>Chapter 98: Remember, Say What You Can Do</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 98: Remember, Say What You Can Do</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>Lin Fan was not sure what is going on., but something did not feel right. Ye Shaotian lost power for three years and suffered. Feng Bujue should be the one who was arrogant and bullied people. However, the situation seemed to be reversed.</p><br/><p>Not right, something was not right.</p><br/><p>Lin Fan kept observing. He wanted to see how this was solved. Feng Bujue was a bit pitiful according to Lin Fan. He was a high postcelestial level, one step away from the ultimate level. He should be one of the best in the outer sect.</p><br/><p>Ye Shaotian was also a high post celestial level. Yet, he defeated Feng Bujue in three rounds, that was not easy at all.</p><br/><p>\"Feng Bujue, you should do what you said earlier. The loser gets out of the Glory Sect. Fighting with you is not my will, because you are just an ant to me.\" Ye Shaotian said and smiled with disdain.</p><br/><p>Feng Bujue’s face turned pale, as blood oozed out of his mouth. He was shocked when he heard the words.</p><br/><p>Leaving the Glory Sect?</p><br/><p>In the past, he tried so hard to get in the sect. Now, he had to leave because of the bet he made recklessly.</p><br/><p>Ye Shaotian looked at Feng Bujue, and laughed, \"Do not say I bullied you and gave you no chance. Now, if you kneel before me and apologize, I will not trouble you, and let you stay in the sect. How does that sound?\"</p><br/><p>\"Ye Shaotian, do not act as your wish.\" Feng Bujue shouted angrily. As a man, he would not kneel down, that was a joke.</p><br/><p>\"Brother Ye, do not waste your time. You letting him kneel down is a grace for him. Now he refuses to do so, so we should not be wasting time.\" Ruo Mengyu said coldly.</p><br/><p>Those outer sect disciples were just watching. They had no position here to manage the high-level conflict. Some people were afraid of Ye Shaotian. They did laugh at him for past three years. Now that he was recovered, they would suffer if he wanted revenge.</p><br/><p>Ye Shaotian smiled, \"Well then, you can leave the Glory Sect now.\" Ye Shaotian kept smiling, and it seemed this event was entertainment for him.</p><br/><p>In his eyes, Feng Bujue was no match for him. One of the top ten? Vulnerable.</p><br/><p>The outer sect was just outer sect. The inner sect was the core of the Glory Sect.</p><br/><p>Feng Bujue made his fists and said, \"Fine, I will leave.\"</p><br/><p>After saying this, Feng Bujue’s body starts to shake. This was the outer sect. Although he worked hard to become one of the top ten, he was nothing in someone’s eyes.</p><br/><p>Lin Fan watched all this and shook his head. A big sect was a big sect after all. This kind of thing would never happen in the Saint Devil Sect.</p><br/><p>Feng Bujue was a bit pitiful to Lin Fan. Feng Bujue’s body seemed to age quickly, and he looked extremely depressed.</p><br/><p>\"Then get out of here fast.\" Ye Shaotian laughed viciously.</p><br/><p>...</p><br/><p>\"Ah...\" A sigh came out of the crowd.</p><br/><p>\"You are from the same place, why try to kill each other. Young man, as your junior master, I will say you are over reacting.\" Lin Fan shook his head and acted sadly.</p><br/><p>Ye Shaotian frowns and looked at Lin Fan. Who was he? Where was he from?</p><br/><p>Feng Bujue was going to leave when he stopped and looked at the man.</p><br/><p>\"Who are you?\" Ye Shaotian asked.</p><br/><p>\"I am your junior master. Young man, calm down. Although a junior sister accompanies you now, a junior sister may not feel well for some days. You have to treat people kindly.\" Lin Fan was a little disappointed in the new disciples of the sect.</p><br/><p>This disciple was way too reckless.</p><br/><p>\"You...\" Ye Shaotian knew what he meant. A junior master? That was nonsense.</p><br/><p>Lin Fan ignored Ye Shaotian, and looked at Feng Bujue, \"Do you want to leave the Glory Sect?\"</p><br/><p>Feng Bujue looked at Lin Fan. Although Feng Bujue did not know who he was, Feng Bujue did not want to leave. So, he shook his head, \"No.\"</p><br/><p>\"Em, but you are a man after all. You lost a bet, then you should take the consequences. If you do not, then not only would others look down you, you would probably look down on yourself.\" Lin Fan said deeply.</p><br/><p>Feng Bujue was shocked. He looked at Lin Fan. He thought Lin Fan was here to solve the conflict, but Lin Fan actually asked him to leave.</p><br/><p>Ye Shaotian was on the edge of rage, but he calmed down a bit.</p><br/><p>\"I will leave the sect.\" Feng Bujue said.</p><br/><p>Lin Fan smiled, \"Well, do you want to join my sect?\"</p><br/><p>Feng Bujue had no idea what Lin Fan meant and looked at Lin Fan.</p><br/><p>Lin Fan saw his confused face and smiled, \"Saint Devil Sect on the unnamed mountain, will you join my Saint Devil Sect?\"</p><br/><p>Now, all the outer sect disciples were surprised and started to talk to each other.</p><br/><p>\"He is the man who was given the mountain by the grand master.\"</p><br/><p>\"So he is the one who got the mountain from the grand master.\"</p><br/><p>\"Now, Feng Bujue exits the sect, but joins the Saint Devil Sect. That means, he still stays in the Glory Sect.\"</p><br/><p>\"This man is going to offend Ye Shaotian to save Feng Bujue.\"</p><br/><p>...</p><br/><p>Ye Shaotian was training for pasting few days, so he did not know this. Ruo Mengyu explained quietly, and Ye Shaotian nodded a few times.</p><br/><p>\"Will you do it?\" Lin Fan asks.</p><br/><p>Feng Bujue could not think clearly. This man got the mountain from the grand master. This thing was not a secret in the sect. The grand master also made it clear that the disciples of the Saint Devil Sect would have the same privileges as the ones in the Glory Sect did.</p><br/><p>\"Disciple Feng Bujue greets grand master.\" Feng Bujue knelt down and joined the Saint Devil Sect.</p><br/><p>He decided quickly without hesitation.</p><br/><p>Lin Fan was glad. The first disciple was smart, the sect will grow quickly. \"Em, good. Then follow me to the sect. I have something for you to do.\" Lin Fan was quite pleased with the result. He tricked another man to join to cut weed, great reinforcement.</p><br/><p>\"Stop.\" Ye Shaotian finally shouted.</p><br/><p>Did this man not know what he was doing? I wanted that man to leave, he dared to keep him? He received the mountain from the grand master, so what? That was a grace for a previous division sect, that was unimportant.</p><br/>\n</div>"}