{"title": "Chapter 97: Don't Ask Me How I Know", "id": 97, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-97-dont-ask-me-how-i-know", "volume_title": "Volume 1", "body": "<h1>Chapter 97: Don't Ask Me How I Know</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 97: Don't Ask Me How I Know</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>\"Those outer sect disciples who came yesterday, are they here yet?\" It was kind of late already, they should have shown up by now.</p><br/><p>\"No.\" The servant shook his head. He felt it was strange too, this was the first time such a thing had happened.</p><br/><p>\"Senior brother Li. I find someone suspicious. He just entered a room, and changed a room soon after.\" The servant saw a man sneaking around, and immediately suspected him.</p><br/><p>\"Oh? Is that true? Let me go check it out.\" Li Shun actually did not care about this. However, this was his territory, so he should be responsible.</p><br/><p>...</p><br/><p>In the pill making room, Lin Fan was digging the dirt crazily. The black dirt had absorbed the leftovers which were created by all the pill making. Therefore, it had medicinal effects now. However, the amount of the dirt was limited. Still, Lin Fan was surprised to find that the black dirt could be used to make Suyuan pills.</p><br/><p>Lin Fan checked the pills in his bag and nodded. There were more than one thousand pills, and he had switched couple rooms. When he was done with this rooms’ black dirt, he should be fine. Those pills should be enough to pay wages.</p><br/><p>However, the door was pushed open. Lin Fan stopped and went in stealth mode instantly.</p><br/><p>The servant saw that there was no one inside, so he stepped in.</p><br/><p>\"Ah...\"</p><br/><p>But the black dirt had been taken by Lin Fan. The servant was not careful enough, so he fell to the ground.</p><br/><p>\"This...\" Before the servant could say anything, his neck was hit, and he fainted.</p><br/><p>\"Hue....\" Lin Fan was relieved. It looks like the room was not safe, as anyone could enter.</p><br/><p>He was the sixth grand master of the Saint Devil Sect. It would be embarrassing for others to know he was stealing the black dirt. Lin Fan looked at the servant, then continued to dig black dirt. He kept throwing blocks in the pot, and Suyuan pills kept coming out of the pot.</p><br/><p>Soon after, Lin Fan finally dug out all the black dirt in this room. One thousand three hundred Suyuan pills, they were enough to pay wages, and there would even be some left after the payments were done.</p><br/><p>When Lin Fan was ready to exit the room, he stopped. He thought it was not right to just leave like this. Lin Fan looked at the servant who had fainted on the ground and smiled.</p><br/><p>\"Hehe...\"</p><br/><p>...</p><br/><p>Some time had passed. Li Shun was calling his servant. He had waited for those disciples for too long, so he was bored. He wanted to get his servant to play flute for him so he could relax a bit. However, the servant was missing, so Li Shun was getting angrier and angrier.</p><br/><p>This servant must be crazy. He did like the servant, but how dare he just leave? The servant needed to be taught a lesson when he was back.</p><br/><p>\"Ah...Senior Brother Li, help me.\" Li Shun heard someone calling for help. Wasn’t that his servant?</p><br/><p>It sounded urgent too. Li Shun got out of his room at once without hesitation, and was shocked when he saw the servant.</p><br/><p>His servant was naked...</p><br/><p>This...this…</p><br/><p>\"What are you doing?\" Embarrassing, too embarrassing. Li Shun really had no words.</p><br/><p>\"Senior brother, I have been robbed.\"</p><br/><p>...</p><br/><p>At this moment, Lin Fan was walking back to his mountain. That servant had entered without knocking the door. That was outrageous. He not only took the servant’s belongings, but also took off the servant’s clothes and threw them into the pot. It was dangerous to enter without knocking, so Lin Fan needs to teach him a lesson.</p><br/><p>Lin Fan was singing a song and walked back happily. He was nodding to other disciples around him in a friendly manner.</p><br/><p>He knew he was working towards the right direction. Under the cover of the Glory Sect, the Saint Devil Sect would grow without a problem. Now, his power level had to increase.</p><br/><p>If one were weak, one would be eaten in this food chain.</p><br/><p>However, the Saint Devil Sect had to grow too.</p><br/><p>There used to be more than ten thousand disciples in the Saint Devil Sect. But, it was annihilated by the nine sects. Now that he was the sixth grand master of the Saint Devil Sect, how dare he call himself grand master if there were not more than hundred thousand disciples in the sect?</p><br/><p>\"One of the top ten talented outer sect disciples, Feng Bujue, is going to fight Ye Tianshao… Ruo Mengyu is over there too.\"</p><br/><p>\"What? Is that true? Ruo Mengyu ranks number one among the top ten talented ones, and she is really pretty.\"</p><br/><p>Lin Fan was going to go back to the Saint Devil Mountain when he found something interesting, and was curious about it.</p><br/><p>He had not seen any trouble here since he arrived.</p><br/><p>No, he had to check it out, and see how the people in the Glory Sect solved their conflicts. He followed those disciples, and soon arrived at the scene. Lin Fan saw three people in the field.</p><br/><p>Two men, one woman…</p><br/><p>Those two men looked talented and strong, especially one of them. He looked cool and handsome, giving people a sensation that he was the king.</p><br/><p>That woman was actually a beauty according to Lin Fan. She was slim and beautiful, but her eyes looked at people with disdain. Lin Fan did not like that. According to Lin Fan, those women who looked innocent and gentle should be called beauties. They were the ideal women for him.</p><br/><p>Lin Fan was listening to the crowd’s conversation carefully.</p><br/><p>\"I know Ye Shaotian is strong. Even when he fell from the top one and everyone attacked him, Ruo Mengyu did not leave him. She must know he will get strong again.\"</p><br/><p>\"I never thought one of the top ten Feng Bujue lost to him in just three rounds.\"</p><br/><p>\"Ah, three years ago, Ye Shaotian was the top one among the outer sect disciples. However, his power level dropped dramatically for some unknown reason. He almost became a common person. Now that he has returned, he is much stronger than he was. He will probably become an inner sect disciple soon.\"</p><br/><p>...</p><br/><p>When Lin Fan heard that news, he found that quite interesting. But, something did not seem right.</p><br/><p>\"Ye Shaotian, do not get too excited. The God will take you some day.\" Feng Bujue cursed angrily after losing within three rounds.</p><br/><p>\"Take or not take, is not decided by garbage like you.\" Ye Shaotian said without emotion. The way he looked at Feng Bujue was like he was looking at an ant.</p><br/><p>\"Brother Ye, do not waste your time with this garbage. He is just a stepping stone for you.\" Ruo Mengyu looked at Ye Shaotian gently. It seemed as if this brother Ye was the one for her.</p><br/><p>Lin Fan saw what happened, especially hearing the ‘brother Ye’ title, which made him uncomfortable.</p><br/><p>A bitch, must be a bitch…</p><br/><p>One should not ask Lin Fan how he knows that. Lin Fan was experienced with people. If he could not sense that, he should just give up living.</p><br/><p>Feng Bujue thought it was so unfair. Three years ago, Ye Shaotian ranked number one. He never treated people rightly. Feng Bujue was just a common disciple at the time, not as popular as he was now.</p><br/><p>That day, Feng Bujue was training and trying to level up. However, Ye Tianshao was arguing with some disciple at his critical moment. He almost failed and suffered a heavy consequence.</p><br/><p>Later, he went to argue with Ye Shaotian. Ye Shaotian’s response angered him.</p><br/><p>\"Disciples like you are countless in the sect. Get out of here, do not interrupt my training.\"</p><br/><p>That day, Feng Bujue saw the disdain in Ye Shaotian’s eyes. Then, he trained madly, even during sleeping time.</p><br/><p>...</p><br/><p>Ye Shaotian looked at people around him and smiled, ‘You used to admire me, then laughed at me for three years because I dropped my power level willingly. Now, I am successful again, and stronger than before. You will come to admire me like dogs again.’</p><br/><p>That was hilarious.</p><br/>\n</div>"}