{"title": "Chapter 95: No Trading Equals No Pains", "id": 95, "volume": 1, "url": "http://boxnovel.org/the-strongest-system-chapter-95-no-trading-equals-no-pains", "volume_title": "Volume 1", "body": "<h1>Chapter 95: No Trading Equals No Pains</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 95: No Trading Equals No Pains</p><br/><p>Translator: Kaos Editor: Hitesh</p><br/><p>On Danding Mountain, Senior elder Yanchen’s disciples were all good at making pills. Everyone picked up something from the senior elder. They all had their specialties and were all skillful. Those disciples tended to be arrogant, because they thought they were the elites.</p><br/><p>At this moment, many disciples were rallying in front of a pill making room. These disciples were outer sect disciples. Some had no idea how to make pill, while some were amateurs. They were here to ask the disciple from Danding Mountain to make pills.</p><br/><p>\"Senior brother Li, please make some pills for me.\"</p><br/><p>\"Senior brother Li, please help me. I can give you seventy percent.\" A disciple shouted.</p><br/><p>\"Senior brother Li, I have prepared twenty sets of materials. I just need one pot of Suyuan pill.\"</p><br/><p>...</p><br/><p>This senior brother Li was Li Shun, who was one of the old disciples of Danding Mountain. He used to play the bamboo flute for the senior elder Yanchen. He was really good, so the senior elder liked him and took him in as a disciple. However, Li Shun was not good at making pills. So he was making pills for disciples from the outer sect these years. Other disciples who were in the same class as him had all started to make pills for elders and inner sect disciples.</p><br/><p>However, this was enough for Li Shun for now. Outer sect disciples were fine, as he had a very high popularity among them.</p><br/><p>\"If you want me to make pills, I need to take eighty percent.\"</p><br/><p>\"Suyuan pill is only a low yellow level pill, but the difficulty of making it is not lower than high yellow level. Making one pot of them out of twenty sets of materials is very lucky. You need to prepare forty sets.\"</p><br/><p>\"If you still want me to do it, you will go to my servant and put down your names. When you get everything ready, you can come to see me.\" His voice came out of the room. It sounded gentle like that of some sort of a hermit.</p><br/><p>Those outer sect disciples who needed those pills had no idea what to do. It was difficult to get pills, especially the one they needed. Those disciples from Danding Mountain were too greedy. They were like vampires who wanted to suck their blood dry.</p><br/><p>However, who could one go to in order to get the pills?</p><br/><p>Martial skill and making pills could not be practiced at the same time. Making pills was about patience. One had to clear their mind and be patient every time, or one would fail.</p><br/><p>If one practiced martial skills and pill making at the same time, one would not have enough energy and time.</p><br/><p>Unless one entered pericelestial level, only then would one be able to do so.</p><br/><p>\"Ah...\"</p><br/><p>Disciples who needed the pills sighed. It was so difficult to train.</p><br/><p>\"Come come, do not miss this. I have a deal for everyone. Do not regret this later. You come and you win.\" Lin Fan stepped out of his door and shouts.</p><br/><p>These Suyuan pills were useless to Lin Fan. If he took them, it would only provide ten experience points. If he chose to have the effect, there was little use.</p><br/><p>If he chose the effect, it would be better to make more pills.</p><br/><p>Those outer sect disciples looked over there and wondered what was going on.</p><br/><p>\"Servant, what is happening?\" Li Yan asks from the room.</p><br/><p>\"I am not sure. Maybe it is a pill trade.\"</p><br/><p>Li Shun nodded. He does not care because this was common. He used to be the bamboo flute player for the senior elder, and was the current pill making star for outer sect disciples. He had no pressure at all.</p><br/><p>Those outer sect disciples would come to him eventually. They would not be able to find anyone else besides him. Based on his seniority, even those brothers who were more skillful than him would respect him.</p><br/><p>\"What? Is he the dumb guy on the unnamed mountain?\"</p><br/><p>\"The dumb guy of the unnamed mountain, who is that?\"</p><br/><p>\"Ha, have you seen someone sitting on a rock without moving for ten days?\"</p><br/><p>\"This happened? Why do I not know that? Sitting there for ten days straight makes people dumb.\"</p><br/><p>\"Exactly.\"</p><br/><p>...</p><br/><p>Lin Fan looked around and found them rallying around him. He used some dirt to make these pills, in exchange for some labor. This should work.</p><br/><p>\"You guys look, what is this?\" Lin Fan took out a Suyuan pill and waited for a reaction.</p><br/><p>People blinked their eyes and started to yell.</p><br/><p>‘This is Suyuan pill.\"</p><br/><p>...</p><br/><p>\"Good, you guys are good.\" Lin Fan nodded. People’s excited facial expressions were anticipated by him.</p><br/><p>\"Do you guys know who made them?\" Lin Fan asked.</p><br/><p>People looked at each other, what did that mean? Suyuan pill was not a high-level pill, but the effect was amazing. Boosting one’s training speed related to the power level. Although the ingredients were not expensive, the difficulty level was high.</p><br/><p>Ten sets of material could only produce one pot, and that was very lucky. One pot of pills only contained five of them, which would also be extremely lucky.</p><br/><p>And this legendary dumb guy asked who made them. Of course they knew.</p><br/><p>\"I know, you did.\" One guy said that from the front.</p><br/><p>Lin Fan smiled, \"Good, good, you are good. Here is a free one for you.\" Lin Fan tossed the pill to him. That outer sect disciple could not believe that.</p><br/><p>He gave this to me for free? He was so happy that he shouted, \"Thank you, senior brother Lin.\"</p><br/><p>Other outer sect disciples were so shocked on watching what just happened. Lin Fan saw their shocked faces, and he knew his goal would be achieved. He needed to give them a feeling that he was rich, then they would believe him.</p><br/><p>\"You guys look, what is this?\" Lin Fan smiled and opened his hands.</p><br/><p>\"Ah...\" The crowd totally went crazy.</p><br/><p>Now they stared dumbfoundedly at his hands, because there were so many Suyuan pills.</p><br/><p>There were at least fifteen of them.</p><br/><p>\"Lin...senior brother Lin. You just mention a deal. Are you going to exchange your Suyuan pills?\" One disciple asked.</p><br/><p>\"Good, you are smart. Here is a free one for you.\" Lin Fan threw another one.</p><br/><p>That disciple was way too happy, as he took the pill. He stared at Lin Fan with incredulity. ‘Who said he was dumb? Get out here, and I will beat you to death.’</p><br/><p>He was a super rich guy.</p><br/><p>\"Great, here is the point. You guys know the grand master gave me the unnamed mountain. However, there are too many weeds there. If you help me work for a day, ten pills will be yours.\" Lin Fan says.</p><br/><p>\"Ah...Senior brother Lin, are you serious?\" Those outer sect disciples rallied around Lin Fan and asked.</p><br/><p>\"Of course, but this is too late now. You should go back to rest, come to work tomorrow.\" Lin Fan said.</p><br/><p>\"No, Senior brother Lin. This is not a problem, we will go right now.\" The people were way too excited. How could they be late for this kind of good stuff?</p><br/><p>Ten Suyuan pills, this was not a joke. If they needed to prepare ingredients by themselves, it would take too long.</p><br/><p>Lin Fan saw people’s excitement and nodded in satisfaction. Having money was great, people would rush here to get the job.</p><br/><p>\"Remember, I am not your brother. I am the grand master of the Saint Devil Sect, the division sect. Actually, I should be the junior brother of the grand master, so you guys should call me junior master Lin.\" Lin Fan said.</p><br/><p>For those outer sect disciples, this pill was way too hard to get. Even calling him father would not be a problem at this stage.</p><br/><p>\"Junior master Lin...\" Everyone shouted at the same time.</p><br/><p>‘Fine, go. Work hard… I will reward those who work the hardest.\"</p><br/>\n</div>"}