{"title": "Chapter 106: The violence of Ye Shaotian", "id": 106, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-106-the-violence-of-ye-shaotian", "volume_title": "Volume 2", "body": "<h1>Chapter 106: The violence of Ye Shaotian</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 106: The violence of Ye Shaotian</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Ye Shaotian didn’t want to say much anymore at this point. ‘Fine, even if I can’t defeat you today, don’t think that I won’t be able to hide from you!</p><br/><p>When I’m done mastering my skill sets, I’ll crush you back ruthlessly!’</p><br/><p>But today, Ye Shaotian understood that it was all wishful thinking on his part. The man had appeared in front of his doorstep without provocation.</p><br/><p>\"Lin…Lin Fan! Don’t push your luck too far! While I’ll admit that my skill level isn’t up to par with yours, but if you’re all out to humiliate me, I’ll let you know that even a rat fights back when cornered!\" Ye Shaotian stared at Lin Fan warily. He shifted his heels slightly backward, ready to slam the door shut and run out of the window should anything go wrong.</p><br/><p>\"Oh junior disciple Ye, don’t worry! Your junior master Yours Truly isn’t here to give you any trouble! I’m here to provide you with a solution for your Unspeakable Flaw\" Lin Fan brimmed ear to ear with the most benevolent smile he could muster, thinking that he needed to ease Ye Shaotian’s heart with his warmth.</p><br/><p>But to Ye Shaotian, this smile was…so horrific…so devious!</p><br/><p>Ye Shaotian took in a deep breath, and his eyes revealed a deep dread.</p><br/><p>Scary…this man was truly too scary!</p><br/><p>This smile sent shivers straight down Ye Shaotian’s spine, and without further ado, he retreated and slammed the door shut, rejecting Lin Fan’s presence.</p><br/><p>Ye Shaotian swore to God that he truly did not wish to have another taste of hell for his little nuggets.</p><br/><p>If Lin Fan dared to enter, Ye Shaotian had prepared mentally to fight him to the death. A piece of jade was no longer complete if it was cracked. ‘You wanna play my little nuggets like crumpled little raisins?!? Dream on!’</p><br/><p>Lin Fan, who was standing outside the door, frowned with displeasure. He was unhappy with this attitude displayed by Ye Shaotian.</p><br/><p>How could a junior disciple be so rude? This was too unbecoming.</p><br/><p>Suddenly, Lin Fan let out a sigh. Of course, Ye Shaotian was just a pitiful patient, and he was the noble doctor tasked with saving the dying. How could he give up on the patient just because he refused treatment at this critical moment?</p><br/><p>Since that was the case, and soft tactics had failed, he could only do it the hard way. After all, this junior disciple would truly appreciate Yours Truly’s kindness once it was over.</p><br/><p>...</p><br/><p>In the quarters of the outer sect, the disciples were usually just going on with their carefree life. Some chose to cultivate themselves within their houses, some were consolidating their thoughts about their own learning, while others would meet up, sit down and chat about their hopes and dreams about life, etc.</p><br/><p>But just at this moment, a tragic shrill pierced the peace of the courtyard.</p><br/><p>\"What…what are you doing! Don’t come any further!\"</p><br/><p>\"I’ll…I’ll kill you!!!\"</p><br/><p>\"Ahh, calm down my dear junior disciple. Your junior master is here to help.\"</p><br/><p>\"Loosen your hands NOW!\"</p><br/><p>\"F*CK! How dare you not know what’s good for you. Yours Truly will give you a good lesson today!\"</p><br/><p>\"AHHHH!!!!!\"</p><br/><p>...</p><br/><p>Upon hearing these voices, all the outer sect disciples were extremely bewildered, wondering what had happened. One by one, they stepped out of their houses to check and see which brother was in trouble to have let out such a terrible shrill.</p><br/><p>Suddenly, the door of Ye Shaotian’s house opened up, and Lin Fan stepped out with a look of satisfaction on his face. While Ye Shaotian was a little mischevious, he was subdued by Yours Truly still.</p><br/><p>Before closing the door, Lin Fan stole a glance inside the house at Ye Shaotian’s lifeless body on the floor and let out a smile of contentment.</p><br/><p>Upon realizing that the shrill scream had come from Ye Shaotian’s house, all the outer sect disciples were stunned. Just what had happened?!</p><br/><p>And upon seeing Lin Fan, they were stupefied on the spot.</p><br/><p>Could it be that…Ye Shaotian was beaten to a pulp by Junior Master Lin again?</p><br/><p>The more they thought, the more possible it seemed. After all, that shrill was way too tragic, too pitiful…</p><br/><p>Seeing the growing number of disciples, Lin Fan straightened his back, faced them and waved with a cheery smile on his face. Flicking back his robes, he headed off into the distance.</p><br/><p>...</p><br/><p>After confirming that junior master Lin had gone into the distance, the outer sect disciples stared at one another. What had happened inside and how was Ye Shaotian?</p><br/><p>That shriek was so tragic, so it must be a pitiful scene! Filled with curiosity, everyone wanted to take a look, but yet they didn’t dare to.</p><br/><p>While junior master Lin was somebody they didn’t want to trifle with, so was Ye Shaotian.</p><br/><p>Suddenly, a monstrous roar erupted from Ye Shaotian’s house, causing everyone to jump backward a few steps.</p><br/><p>The roar was akin to that of a wild beast.</p><br/><p>Within the house, Ye Shaotian’s eyes were burning red, breathing like an enraged bull in big huffs and puffs.</p><br/><p>An exploding force was surging through his body, as though looking for an opening to burst out of.</p><br/><p>Ye Shaotian stood up with his body scorching hot and an unspeakable rush within his mind. His crotch area seemed to be stuffed with a stiff baton, supporting his pants high up in the air like a tent.</p><br/><p>Explode…It was going to explode!</p><br/><p>Ye Shaotian felt as though his crotch area was going to explode at any moment.</p><br/><p>\"Ahh…\"</p><br/><p>The disciples who had long gathered outside jumped when they saw Ye Shaotian burst out of the house. Seeing those blood red eyes with a fiery gaze, everyone felt the danger in that moment.</p><br/><p>And when they finally moved their gaze to his crotch, the air stood still as everyone stopped breathing for a moment.</p><br/><p>How could such a ferocious…beast exist in this world? Just what had happened within the house?! Why had things gone this way?!</p><br/><p>...</p><br/><p>Lin Fan leaped along as he walked. Now that the pill was forcefully stuffed into Ye Shaotian’s mouth, it was only a matter of time before he would come seeking for more once he had had a taste of the benefits!</p><br/><p>And at this moment, within a great hall of Glory Sect…</p><br/><p>A disciple was nestled within a furnace lined with exotic symbols and filled with an unknown liquid. He was seated in the center of it all, eyes shut with his face pale beyond measures.</p><br/><p>A closer inspection could tell that he had good features, and he exuded an air of elegance. It was just the presence of wounds which caused him to look so haggard.</p><br/><p>\"Grand Master, I’m afraid…it’s too late to salvage Tianyu’s cultivation foundation\" the Senior Elder of Danding Peak gazed within the furnace while shaking his head brokenheartedly.</p><br/><p>A man who was once a great hope for the sect had fallen. To the sect, this was a terrible loss to be had.</p><br/><p>Zong Hentian lost every bit of color on his face as he heard these words and collapsed onto the floor into a kneel, \" Grand Master! Elder! Please, I beg, I implore, I beseech you! Please save Junior Brother Tianyu! Please! If it were not for saving me, he wouldn’t have lost his cultivation foundation! Without his cultivation foundation, it would be a fate worse than death for Junior Brother! Please!\"</p><br/><p>The cultivation foundation represented everything. The loss of it not only meant the loss of his cultivation base, but also the loss of any hope of regaining any bit of prowess in the future.</p><br/><p>The cultivation foundation was one’s potential. To have Junior Brother Tianyu fall from prime potential to a vegetable instantaneously, what was he to do?!</p><br/><p>Zong Hentian was filled with deep regrets. Everything had seemed to be going smoothly and within grasp as usual for the expedition, when all of a sudden, Fengtian Sect sent out a fellow of peerless skill. In a moment of carelessness, Zong Hentian was nearly killed by his hands, if not for Junior Brother Tianyu’s selfless sacrifice. By now, he would have been just a corpse.</p><br/><p>Grand Master Yan peered within the pot and let out a sigh, \" It is already fortunate that he could even retain his life. This disciple of Fengtian Sect employed a strange skill, causing an energy of death to culminate within his body. The best option is only to force out the gas and keep him alive.\"</p><br/><p>Zong Hentian clenched his fists unwillingly with a vengeance burning in his eyes. If he were to meet the guy again, he swore to behead the mother*cker.</p><br/><p>\"Seal the furnace\" Grand Master Yan sighed.</p><br/><p>It had been a longstanding tradition for the various sects to fight each other to death in the forbidden grounds. While it was always the other sects who had their disciples destroyed, today, it was Glory Sect’s turn.</p><br/><p>To think that Fengtian Sect would have such a disciple…</p><br/>\n</div>"}