{"title": "Chapter 117: An Earth Shattering Fart.", "id": 117, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-117-an-earth-shattering-fart", "volume_title": "Volume 2", "body": "<h1>Chapter 117: An Earth Shattering Fart.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 117: An Earth Shattering Fart.</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Godly pill!</p><br/><p>This was definitely a godly pill!</p><br/><p>At this moment, Lin Fan realized that when he had mixed his own Yin Yang energy with the Sword Qi, the energy produced by the pill was strengthened by a few folds.</p><br/><p>\"Ding...congratulations on crafting Heaven lower graded pill, \"Chaos Sword Pill\"\"</p><br/><p>When Lin Fan touched the pill, an alarming notice came through from the system.</p><br/><p>Little did he expect that the pill would jump 2 grades from a middle Earth tier to a lower Heaven tier with just the infusion of his Yin-Yang energy with the Sword Qi. Lin Fan could not believe it; he was truly a genius!</p><br/><p>But before Lin Fan’s excitement even died down, he realized that something was wrong.</p><br/><p>The Chaos Sword Pill seemed to be suffering from some internal cracks, with streams of Qi flowing out from within.</p><br/><p>This...this!</p><br/><p>Lin Fan was shocked entirely. Fuck! There couldn't be any problems, could it? The pill that Yours Truly had painstakingly created, how could there be anything wrong!</p><br/><p>‘Ding....semi-finished product; mixed purity sword pill. Unable to withstand both the strong Yin Yang and Sword Qi. Disintegrating.’</p><br/><p>Upon hearing the system’s notice, Lin Fan could not agree with it.</p><br/><p>How the sh*t could this be? No. Definitely no!</p><br/><p>Looking at the crumbled pieces of the pill, Lin Fan was anxious momentarily. He would rather kill a wrong person than to let an evildoer run. Following that principle, Lin Fan threw all the remnants of the pills into his mouth without hesitation.</p><br/><p>‘Before you’re totally disintegrated, Yours Truly will take you in first. No matter what, it should at least contain the effects of before.’</p><br/><p>\"Ding...consumed semi-finished mixed purity sword pill. Convert to experience points or inherit effect?\"</p><br/><p>‘Fuck...even at this point you’re still giving me a choice? Damn you.’</p><br/><p>\"Convert to experience points\"</p><br/><p>\"Ding...consumption failed...\"</p><br/><p>Just as Lin Fan was waiting for his experience points to shoot up, the pill he had just swallowed disintegrated within his body. An extremely strong force flowed through his body.</p><br/><p>Sword Qi and Yin Yang energies, the two different types of energies were rampaging and clashing within his body, as though they were about to burst out from his body.</p><br/><p>Lin Fan was stunned. He had not expected things to turn out this way.</p><br/><p>Just at this moment, Lin Fan’s face flooded red. His tender little anus seemed to be anticipating the birth of something.</p><br/><p>\"F*CK! I can’t….!\" Lin Fan shouted, unable to withstand the energies creating chaos within his body.\"</p><br/><p>\"POOT...\"</p><br/><p>\"BANG.\"</p><br/><p>That magnificent yet simple two-storeyed wooden house of his was filled with a burst of energy and exploded within seconds.</p><br/><p>The sound of the explosion shook the earth. Zhang Ergou and Feng Bujue, who were in idle conversation, jumped to their feet at the sound of it.</p><br/><p>\"What happened! What happened?!?\"</p><br/><p>\"How did Master’s wooden house explode!\"</p><br/><p>The two of them glanced at each other, then shouted in panic.</p><br/><p>\"Master…! Master!\"</p><br/><p>They guessed that the explosion must have come from cultivating the pills and they had no idea how Master Lin was right now.</p><br/><p>Rushing into the house and looking at Master Lin seated firmly in his cross-legged position, they heaved a sigh of relief.</p><br/><p>\"Master! What’s wrong?\" Staring at the empty space which used to contain a wall behind Lin Fan, Zhang Ergou asked dumbfoundedly.</p><br/><p>\"Cough…cough... it’s nothing. Just as Yours Truly was cultivating the pills, I transferred some supreme energy within it, and the remainder of it burst this wall. Alright, the two of you head out. No matter what you hear later on, do not come in. Yours Truly needs to focus\" Lin Fan looked at the two of them and replied with a look of calm on his face.</p><br/><p>\"Yes.\" Zhang Ergou and Feng Bujue looked at their master questioningly. But without knowing the entire truth, they could only leave silently.</p><br/><p>Upon their exit, Lin Fan let loose a sigh of relief as well. Rubbing his swollen and bare ass, he lamented. He had blown his own pants away.</p><br/><p>But thank goodness he was calm in the face of the crisis. If he had let those two seen him in such a disgraceful state, how was he to uphold that mighty and noble image of his?</p><br/><p>Lin Fan changed his pants and started analyzing the situation carefully.</p><br/><p>This mixed purity pill could not withstand his own Yin Yang energy along with the Sword Qi. This should be due to the ingredients used, which could not withstand his True Energy. Or perhaps his True Energy was way too strong. Therefore, it exceeded the capacity.</p><br/><p>But with this experiment, Lin Fan now had a hunch. If he was able to obtain high graded ingredients in the future, he should be able to produce some extraordinary pills beyond imagination.</p><br/><p>Lin Fan picked up a few sets of ingredients and threw them into the furnace.</p><br/><p>\"Ding…congratulations on creating Earth middle graded Yin Yang Reverse Sword Pill.\"</p><br/><p>\"Ding… Congratulations on creating Earth middle graded Yin Yang Reverse Sword Pill.\"</p><br/><p>...</p><br/><p>In total, he produced 5 servings of Yin Yang Reverse sword pill. To any practitioner of pills cultivation, this yield was beyond horrors.</p><br/><p>High graded pills like these were not like those low-class ones, where 1 set of ingredients could produce multiple servings. Only one serving could be produced with each set, where the pill thoroughly absorbed every single drop of essence and effects of the herbs used to create a pill of maximum efficiency.\"</p><br/><p>\"Leaving one serving of Yin Yang Reverse Sword Pill, Lin Fan threw the other 4 into his mouth and chomped happily.\"</p><br/><p>\"Ding...congratulations on consuming Earth middle graded Yin Yang Reverse Sword pill. Experience points increased\"</p><br/><p>...</p><br/><p>Consuming 5 pills increased his experience points by a decent amount. But in the face of this huge gulf of experience pool required, it was like filling a tank with a glass of water. But Lin Fan believed that as long as he could bring forth the reputation of Nameless Peak, there would be more people looking for him to cultivate pills.</p><br/><p>At that point, by the rule of accumulation, he would be able to level up by even lying down and popping pills.</p><br/><p>The next set of ingredients were for the Dragon Blood Pill.</p><br/><p>Lin Fan analyzed the ingredients and garnered that this pill was used for strengthening the physical body.</p><br/><p>For the first time after cultivating \"Eternal Demon Body\", Lin Fan came across someone else who was cultivating his physical self.</p><br/><p>The person before should have been cultivating the way of the sword, and it was a level of cultivation that was beyond the mere masses. Therefore, he required such a highly graded Yin Yang Reverse Sword pill.</p><br/><p>Upon consuming the pill, one would experience the feeling of a thousand swords piercing through one’s heart. If one were not sturdy in his will, he would definitely not be able to take it.</p><br/><p>Lin Fan threw the ingredients for the Dragon Blood pill into the furnace, intending to see what would happen if he infused his True Energy within.</p><br/><p>But he was afraid at the same time. The fart produced in the aftermath was apocalyptic. If he were to blow away the entire house, it would be terrible.</p><br/><p>Therefore, he decided that he should just cultivate it with the proper means. Perhaps he’d give it another shot when he obtained better ingredients in the future.</p><br/><p>At this moment, a red dragon appeared above the furnace and spiraled above it.</p><br/><p>\"Ding… Congratulations on creating Earth middle graded Dragon blood Pill.\"</p><br/><p>\"Dragon Blood Pill: Consuming it would transfer the power of the dragons. Hardening one’s physical self.\"</p><br/><p>After Lin Fan cultivated all 10 sets of ingredients, he opened his mouth and popped 9 pills within, enjoying the experience points brought by it.</p><br/><p>Even though he could choose to enjoy the effects of the pills, but Lin Fan felt that there was no need to. After all, these were Earth tiered pills. They were pretty low level for him.</p><br/><p>He might as well make use of the chance to level up.</p><br/><p>But if anyone else were to find out, they would die of shock. While these were Earth tiered pills, they were the hardest to cultivate amongst this tier.</p><br/><p>In terms of cultivating difficulty, there were even harder to craft than Earth upper graded pills.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>There you have it guys, the story helps me in explaining a portion of the intricacies of the pills creation process.</p><br/><p>Cheers!</p><br/>\n</div>"}