{"title": "Chapter 120: Once Again, The Great Actor Appears.", "id": 120, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-120-once-again-the-great-actor-appears", "volume_title": "Volume 2", "body": "<h1>Chapter 120: Once Again, The Great Actor Appears.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 120: Once Again, The Great Actor Appears.</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Senior Brother, why are they not here yet?\" Feng Bujue asked uncertainly.</p><br/><p>\"No worries. Perhaps they’re just on their way\" Zhang Ergou brimmed with confidence. Now that the pills were already created successfully, what was there to be afraid of.</p><br/><p>Ye Shaotian strode alone from a distance with an empty expression. None of his senior brothers and juniors would come. Why couldn’t they just even trust him this once?</p><br/><p>Junior Master Lin was truly a genius in cultivating pills. How could he fail?</p><br/><p>Upon looking at Ye Shaotian’s sole figure, the outer sect disciples sniggered. They did not dare to trifle with Ye Shaotian. Hence, they could only mock subtly.</p><br/><p>\"Senior Brother Ye! Where are the other senior brothers?\" Zhang Ergou hurried ahead and asked while retrieving multiple storage sacks. \"Senior brother, our great master has prepared the pills! I was just awaiting the senior brothers to return their orders!\"</p><br/><p>Ye Shaotian was initially at a loss for words. Upon looking at Zhang Ergou retrieve the storage sacks and informing him that the pills were ready, his expression took a turn. While he was affirmed in his heart that Junior Master Lin would definitely not disappoint him, looking at the pills in actuality brought him a huge delight.</p><br/><p>Opening the storage sack, Ye Shaotian roared in laughter, \"Junior Brother! Hand the pills over to me! I’ll be back in a jiffy!\"</p><br/><p>Ye Shaotian went as quickly as he came. Without a chance to even react to the sight of Ye Shaotian hurrying off, Zhang Ergou shook his head helplessly. What was happening?</p><br/><p>At this moment, there was silence amongst the massive crowd of disciples. Nobody dared to breathe. What did they just hear?</p><br/><p>The pills…were ready?</p><br/><p>How could this be! In just one night, all the high graded pills were crafted successfully? Even Danding Peak did not have such abilities!</p><br/><p>Impossible, this must be a fraud! Ye Shaotian had such a chummy relationship with Nameless Peak. They must have made this up! After all, none of them saw the pills with their own eyes.</p><br/><p>But some of the outer sect disciples wavered. While they attested that their disbelief, the expression on Senior Brother Ye was undeniable. It didn’t look like he was putting on an act. Could they really have succeeded?</p><br/><p>Zhang Ergou laughed at the crowd and stood over back at his booth.</p><br/><p>Not long after, a shocking scene occurred.</p><br/><p>The ten geniuses of the outer sect hurried over rapidly, each of them carrying a look of joy.</p><br/><p>Even the cool and expressionless look on Jian Wudi seemed to have softened, as though a miracle had happened.</p><br/><p>When Ye Shaotian had returned with the pills and told them it was in his hands, none of them could believe it. But upon witnessing the pills on their own, they realized the truth.</p><br/><p>Upon realizing that the lack of their presence to collect the pills personally may have left a bad impression on the disciples from Nameless Peak, they hurried over immediately to make up for their behavior.</p><br/><p>But the true reason was that all of them now wanted to get in the good books of Nameless Peak.</p><br/><p>Once one mastered martial arts to a certain level, not only would they have to cultivate tirelessly, they also had to depend on the external assistance of these pills.</p><br/><p>The human body was not perfect. At times, it needed the boost and help of externalities.</p><br/><p>And for pills of such high caliber, how could they be acquired simply? Other than collecting these rare ingredients, one required the help of a master of pill cultivation.</p><br/><p>And if one had good ties with such a master, then it was a sure boon on this tough road of attaining cultivation.</p><br/><p>\"My two dear Junior Brothers! I seek your deep understanding for my late arrival!\" Meng Hao of the ten geniuses laughed.</p><br/><p>He had received the Dragon Blood Pill in his hands. From the power pulsing through the pill, he could feel that if he had consumed it, his physical self would definitely improve by leaps and bounds.</p><br/><p>\"It’s fine…it’s fine!\" Zhang Ergou waved his hands off hurriedly. He was still puzzled over what was happening.</p><br/><p>Even though he had a hunch in his heart, Zhang Ergou chose to let it slide. After all, it was just a small matter. No point risking their relationship to expose them.</p><br/><p>Thereafter, each and every one of the geniuses expressed their earnest gratitude, causing Zhang Ergou and Feng Bujue to feel flattered beyond words. But beyond that flattery was pride. This was all due to their Master Lin’s capabilities!</p><br/><p>Their great master’s pill cultivation skills were simply beyond anyone else in this world. So what if it were the ten geniuses? They were still easily subdued by their master’s talents.</p><br/><p>Every single outer sect disciple who were mocking them prior to this had closed their mouths shut. They were now in disbelief that it was all real.</p><br/><p>The pills…were actually crafted successfully!</p><br/><p>They could have suspected that Ye Shaotian was in cahoots with Nameless Peak. But now that even the ten geniuses were bowing down, they couldn’t ALL be in cahoots?</p><br/><p>Standing at the sides, Ye Shaotian puffed his chest up proudly. The sides of his mouth let out a huge grin, as though implying that these guys were wrong to have doubted him in the first place.</p><br/><p>The ten geniuses were now convinced beyond measure of Nameless Peak’s capabilities. They all wanted to head up the peak to greet the great Lin Fan, but were stopped by Zhang Ergou.</p><br/><p>‘We only do pills, not meet and greets.’</p><br/><p>Feng Bujue took the chance to prop up the flag and shouted, \"Anyone who wants to cultivate pills, hand your ingredients over here!\"</p><br/><p>Nameless peak could easily craft these high caliber pills. Their ability was undeniably amazing. Given a choice between Nameless Peak and Danding Peak, there was a clear winner.</p><br/><p>Jian Wudi and the ten geniuses did not head forward and just observed from the sidelines. Now that they had the pills they required, they were in no rush to get anything new created.</p><br/><p>Nameless Peak resided within Glory Sect after all, so they could afford the wait.</p><br/><p>Thereafter, anyone who saw Ye Shaotian nodded their heads in gratitude. If not for Junior Brother Ye, they would probably still be troubled over their pills.</p><br/><p>\"Eh? Weren’t you the guy who was mocking us earlier on? What’s up? You still have the cheek to come ask for our help in cultivating pills?\" Zhang Ergou laughed as he spotted a guy who kept his head down sheepishly. Suspiciously, he took a look and found out that this was the guy who was sneering at them earlier.</p><br/><p>The disciple flushed red, speechless as he hung his head down. \"Senior brother, it was my fault just now. Please be gracious and forgive my impudent self. Please let me get a pill cultivated, sir!\"</p><br/><p>\"Hmph! Impossible. You’re no longer someone Nameless Peak welcomes. Shoo off!\" Zhang Ergou barked.</p><br/><p>Trying to get a pill cultivated after jeering at us? Nothing in this world came free, buddy!</p><br/><p>Helplessly, the disciple lowered his head and sighed, deeply repentant at his actions earlier on.</p><br/><p>And just at this moment, a thunderous voice came from behind Zhang Ergou.</p><br/><p>\"Ergou. As a senior brother, how could you bully a junior as such?\"</p><br/><p>Zhang Ergou’s eyes flickered as he turned pale as a sheet, \"Mas…Master…!\"</p><br/><p>And the ten geniuses, who were standing by idly, took a swift turn towards the person who had just spoken. Their expressions sparkled with anticipation.</p><br/><p>At the same time, the crowd turned their heads towards the source of the voice.</p><br/><p>Straight ahead was a man with peerless grace and heavenly charm. He walked over briskly, neither fast nor slow. Every step he took was one of elegance, bringing shame to the masses around him.</p><br/><p>He was like the bright moon in the skies, and they were just mere flickering stars.</p><br/><p>No one could vie with his decorum.</p><br/>\n</div>"}