{"title": "Chapter 122: Danding Peak Can't Take It Lying.", "id": 122, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-122-danding-peak-cant-take-it-lying", "volume_title": "Volume 2", "body": "<h1>Chapter 122: Danding Peak Can't Take It Lying.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122: Danding Peak Can't Take It Lying.</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Regardless of cultivation level, no one could fight the passing of time.</p><br/><p>Half a month later...</p><br/><p>Nameless Peak was way livelier than before. The once desolate peak with just 3 people residing within it was now bustling with crowd and life.</p><br/><p>\"Brother Gou! Here are my ingredients. Please kindly help me to pass them over to Junior Master Lin!\" An outer sect disciple fawned on Zhang Ergou while handing over the ingredients he had painstakingly collected over a month.</p><br/><p>Zhang Ergou was having the time of his life. In the outer sect, he was greeted with respect by everyone.</p><br/><p>Brother Gou. That’s what they called him.</p><br/><p>Towards this nickname, Zhang Ergou did not see anything wrong with it. In fact, he found it rather befitting.</p><br/><p>Ever since the marvelous act with Master Lin, the reputation of Nameless Peak had spread throughout the entire outer sect quarters.</p><br/><p>\"Don’t worry, Junior Brother. Your ingredients? I’ll hand it over to Master as soon as I can.\" Zhang Ergou built a stone bench at the peak’s entrance and spent his days sitting there and attending to arriving disciples.</p><br/><p>\"Thank you, Brother Gou!\" With a face of happiness, the disciple thanked him earnestly.</p><br/><p>\"No matter. Here, have this receipt. When you’re here to collect the pills, you’ll need it.\" While Zhang Ergou had not received much education, he could still write out in simple words and terms.</p><br/><p>Now that the disciples seeking help from Master were increasing, if he did not create some sort of receipt for proof, things would get messy real easily.</p><br/><p>\"Junior Brother, how much do we have?\" Zhang Ergou asked.</p><br/><p>\"Senior Brother, I’ve got 30 sets of ingredients here.\" Feng Bujue replied as he took a look within the storage sack.</p><br/><p>\"Hmm, alright. Pass them to me. I’ll send them over to master\" Each time they received a predetermined amount, Zhang Ergou would send them over to Master Lin.</p><br/><p>In the span of half a month, at least a few hundred disciples had sought help. Even from the servant disciples, countless of them came over.</p><br/><p>From low to high graded ones, Zhang Ergou had witnessed a number of them. As such, his knowledge of pills had improved tremendously.</p><br/><p>\"Junior Brother, I’m heading down for some drinks tonight under Senior Brother Ye’s invitation. You wanna join us?\" Zhang Ergou asked as he was preparing to deliver the ingredients.</p><br/><p>Feng Bujue hesitated momentarily, then shook his head, \"Nah, I’ll pass. Can’t stand the sight of him.\"</p><br/><p>While Zhang Ergou had gradually built up a chummy relationship with Ye Shaotian, the same could not be said for Feng Bujue. Each time these two met, they would be like enemies and barely greeted one another. Regarding this, Zhang Ergou was helpless as well.</p><br/><p>...</p><br/><p>Danding Peak…</p><br/><p>Li Shun gradually felt that something was amiss. Just 10 days ago, there were countless disciples seeking help from him for pills. But 5 days ago, he realized that not only were the disciples count low, they were barely existent. In fact, there were only 2 – 3 every day.</p><br/><p>This was something horrifying for Li Shun.</p><br/><p>In the past, when he headed over to the outer disciples’ quarters, every one of them fawned on him with respect and courtesy. But nowadays, those who had once sucked up to him seemed to no longer be as welcoming.</p><br/><p>This fact displeased Li Shun immensely. Did these guys think that they could make it big without his help now?</p><br/><p>\"Senior Brother! This…is not good!\" the servant boy ran over anxiously from a distance.</p><br/><p>\"Impudent. What’s with all this ruckus?\" Li Shun frowned with displeasure.</p><br/><p>‘Senior Brother! When I headed over to the outer sect disciples’ quarters, all I heard were talks and discussions about heading to Nameless Peak and whatnot… no longer about out Danding Peak!\" the servant boy replied frantically.</p><br/><p>Danding Peak was divided into a few areas. The area Senior Brother Li and a few other seniors were in charge of was to attend to outer sect disciples. But now, the disciples seeking help were growing less by the day.</p><br/><p>Since he had to head over for an errand today, the discovery of this startling fact sent him scrambling back to inform Senior Brother Li.</p><br/><p>Just half a month ago, he had mentioned the fact that disciples from Nameless Peak were setting up a stall for pill cultivation to Senior Brother Li.</p><br/><p>But they did not pay any notice to these amateurs. Who would think that by now, they had really snatched away all the disciples?</p><br/><p>\"What?!\" Li Shun hardly went down the peak. Most of the time, he stayed within Danding Peak. Hence he was not really clear about the situation down in the area of the outer sect. Now that he heard the news from his servant boy, he was shocked in disbelief.</p><br/><p>Recalling the recent situation on Danding Peak, those once calm eyes of his turned somber.</p><br/><p>Following this, he headed towards the distance without a single word.</p><br/><p>\"Senior brother…senior brother!\" Noticing the overcast look on Senior Brother Li’s face, the servant disciple grew scared. But nevertheless, he chased behind.</p><br/><p>...</p><br/><p>Nameless Peak…</p><br/><p>Lin Fan was in the house, cultivating the ingredients Zhang Ergou had brought over. By cultivating a large number of pills, Lin Fan’s pill cultivation skill was already at level 20, awaiting completion.</p><br/><p>While most of the ingredients sent over by the disciples might not be of high caliber, by the rule of accumulation, he too had consumed quite a bit, somewhere around a few thousand pills.</p><br/><p>At the peak’s entrance, Zhang Ergou and Feng Bujue remain seated, patiently awaiting the arrival of ingredients. Towards Master Lin’s pill cultivating skills, they were impressed beyond words. This was just bloody invincible.</p><br/><p>Zhang Ergou did not have much knowledge of the outside world, but to Feng Bujue, Master Lin’s yield efficiency for the pills was beyond terrifying. This was something no mere human could hope to match up with.</p><br/><p>And at this moment in the outer sect grounds, something happened.</p><br/><p>A group of people from Danding Peak were passing the outer sect disciple grounds, heading in the direction of Nameless Peak.</p><br/><p>Towards this matter of Nameless Peak poaching disciples, Li Shun was filled with anger. Not only did he lose out on disciples looking for pills, even his own fellow seniors and juniors were idle without work for a couple of days.</p><br/><p>\"My fellow Junior Brothers, this time round, we need to teach Nameless Peak a lesson. They need to understand that to obtain pills within Glory Sect, there can only be room for Danding Peak!\" Li Shun blared.</p><br/><p>\"Yes! Senior Brother Li is right! Nameless Peak is just trying to push us to a corner!\"</p><br/><p>\"Hmph! Since those people on Nameless Peak don’t know what’s good for them, it’s time for us Danding Peak to teach them a lesson!\"</p><br/><p>...</p><br/><p>Looking at this bunch of angry looking Danding Peak disciples, the outer sect disciples were shocked as well. At first, they did not know what was going on. But when they realized the direction where Danding Peak was headed to, they realized something was amiss.</p><br/><p>\"Are they heading up to find Junior Master Lin of Nameless Peak?\"</p><br/><p>‘This path ahead only leads to Nameless Peak! They must have found out that we’ve been heading over to Junior Master Lin for pills, and thus they’re there to create trouble for him, since they can’t exploit us anymore!’</p><br/><p>‘Go! Let’s follow them! If they dare to show any disrespect to Junior Master Lin, we’ll teach them a good lesson!’</p><br/><p>‘That’s right! But let’s calm down first. It could all just be a big misunderstanding!’</p><br/><p>‘Relax, guys. We all know in our hearts the gratitude we have for Junior Master Lin. What a caring and compassionate Junior Master he is. If anyone dares to create trouble for them, we definitely can’t take it lying down!’</p><br/><p>Therefore, as the Danding Peak people headed forward, a crowd of outer sect disciples formed and followed suit.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Alright guys! Here's another explanation from me!</p><br/><p>Now, for the Chinese, sometimes we refer to people respectfully as 'Brother A', 'Brother B' etc.</p><br/><p>In terms of English, it'd be something like, Boss or Sir. Usually the alpha male of a group or the proclaimed leader would have people calling them Brother 'Something'.</p><br/><p>Just to clarify regarding Brother Gou, in case some of you guys wonder why it's more respectable than Senior Brother Gou.</p><br/><p>Oh and btw, in mandarin there's actually a pun going on. The character 'Gou' for his name is actually dog in english. So he's somehow Brother Dog. Hahaha!</p><br/><p>Cheers!</p><br/>\n</div>"}