{"title": "Chapter 131: Jialan Peak", "id": 131, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-131-jialan-peak", "volume_title": "Volume 2", "body": "<h1>Chapter 131: Jialan Peak</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131: Jialan Peak</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Along his way, the outer sect disciples were passionate like fire, each approaching him with a revering look. Lin Fan enjoyed it thoroughly. Weren’t these people just cute?</p><br/><p>\"Hi Junior Master! This is a Yumei Fruit your Junior Disciple have just plucked from the tree! Please enjoy it!\" An outer sect disciple rushed forward upon seeing Lin Fan and passed him a freshly washed fruit.</p><br/><p>Lin Fan took it while beaming, \"Yes. Thank you, my dear junior disciple.\"</p><br/><p>As Lin Fan carried on moving, the disciple who passed Lin Fan the fruit stood on the same spot, jumping in joy and excitement.</p><br/><p>‘Junior Master Lin had smiled to me! And even thanked me! This…this was such an emotional moment!’</p><br/><p>Thinking of Junior Master Lin’s various impressive feats, he could not help but respect this man.</p><br/><p>Possessing an unparalleled skill of cultivating pills, as though any pills could be made in the hands of Junior Master Lin’s hands…</p><br/><p>Even when Danding Peak’s Elder came up to pick a fight, he was also dumbfounded by Junior Master Lin…</p><br/><p>Who else could be so mighty? Definitely only Junior Master Lin of the Nameless Peak!</p><br/><p>In the past, when the outer sect disciples caught sight of Lin Fan, they would scurry like rats. But now, as soon as they saw him, they’d try to creep closer to him while greeting him ‘Junior Master Lin’. Every single word had Lin Fan elated beyond the moon.</p><br/><p>This feeling was simply too amazing.</p><br/><p>While he was of a higher seniority now and thus losing many experience points in the process, this was all worth it to Lin Fan.</p><br/><p>Hands behind his back and a smile on his face, Lin Fan returned every greeting of the disciples with a gentle smile and nod.</p><br/><p>Now that Lin Fan was the idol in the hearts of the masses, the looks on these disciples as they greeted him was all true from the very bottom of their hearts, without a hint of insincerity.</p><br/><p>Back at the servants’ quarters, Zhang Ergou was enjoying his own moment.</p><br/><p>\"Brother Gou…!\"</p><br/><p>\"Brother Gou! You are truly the pride of us servant disciples! Now that you have gone under the wings of Junior Master Lin, you will definitely be a bigshot in the future! Please don’t forget about us by then!\"</p><br/><p>\"How can Brother Gou be someone like that! Don’t you guys see that he’s already back to visit us?\"</p><br/><p>The servant disciples surrounded Zhang Ergou as though he was a celebrity. And this feeling pleased Zhang Ergou to no ends.</p><br/><p>\"All my dear junior brothers, naturally I won’t forget about you guys. Look, I’m back here just to take a look at all of you!\" Zhang Ergou replied with his eyes twinkling.</p><br/><p>Even though it was a grand affair earlier with his master, but their gazes all stopped on their great Master. Now that Zhang Ergou was alone, he could absorb it all by himself.</p><br/><p>\"Indeed, Brother Gou is a man of loyalty and heart! Even back when he was a servant disciple, he already took great care of us!\"</p><br/><p>The repeated shouts of ‘Brother Gou’ had Zhang Ergou euphoric with joy, and the smile on his face was wider than ever.</p><br/><p>...</p><br/><p>Not too far in the distant crowd, Lu Yan stared at the adoring masses towards Zhang Ergou with jealousy and envy in his face.</p><br/><p>To Lu Yan, he should be the one on the receiving end of such adoration.</p><br/><p>Unconsciously, Lu Yan rubbed the bead necklace hanging around his neck with a glow in his eyes.</p><br/><p>Mahesvara King's Beads.</p><br/><p>The servant boys who were initially chosen by Lin Fan to exterminate weeds were burning with envy looking at Zhang Ergou receiving such adoration. They even hated themselves for running away back then. If they had not done so, they would be in the same situation as Zhang Ergou, receiving such fondness from the masses.</p><br/><p>But now, it was too late for regrets.</p><br/><p>...</p><br/><p>Lin Fan caught sight of a stone tablet of a peak.</p><br/><p>‘Jialan Peak’</p><br/><p>This was the legendary peak in Glory Sect which only accepted female disciples.</p><br/><p>Within Glory Sect, these disciples from Jialan Peak typically did not leave their peaks and stayed up there to cultivate. Lin Fan recalled that Ye Shaotian’s partner was a disciple of Jialan Peak. But after getting to know Ye Shaotian, she left the sect and converted to be an outer sect disciple.</p><br/><p>Regarding the happenings outside, Lin Fan also knew slightly from his own sources.</p><br/><p>Since he was here today, as a Junior Master, naturally he’d have to visit his lovely female Junior Disciples.</p><br/><p>On his way up the peak, Lin Fan bumped into a few female disciples.</p><br/><p>The female disciples who saw Lin Fan could not keep their gazes off him. They were curious. Why was there a male disciple up on the peak, and what was his purpose?</p><br/><p>Passing by a couple more female disciples, Lin Fan sighed helplessly as he looked into the distance. He was slightly dejected, ‘Seems like my reputation has not spread far enough.’</p><br/><p>Of these female disciples passing by, none of them recognized him! To Lin Fan, this was something he could not accept.</p><br/><p>He was the Master of Nameless Peak’s Saint Devil Sect, the revered idol of countless outer sect disciples!</p><br/><p>Furthermore, he could be said to be the number one Pill Cultivating Master of Glory Sect!</p><br/><p>But now…but now…sigh!</p><br/><p>Lin Fan pushed forward silently.</p><br/><p>At the same time, his mind was moving. How should he introduce himself upon arriving at the top? How could he let these female disciples of Jialan Peak worship him? That was of priority.</p><br/><p>Lin Fan was not a man with huge dreams and big aspirations. All he wanted was for his name to spread throughout the entire Glory Sect and to shake the entire world.</p><br/><p>Just a small little hope like this, was it too much? No, this was just a small dream.</p><br/><p>The view on Jialan Peak was beautiful beyond measure. The moment Lin Fan stepped up the peak, the sweet scent of women flooded his nose, causing his blood to boil uncontrollably.</p><br/><p>Slim and slender, thin and tall, white and whole, beautiful and boundless… This was an unparalleled scene.</p><br/><p>Lin Fan could not control his eyes. Indeed, Jialan Peak was a female only sect.</p><br/><p>Amongst these beautiful ladies, the presence of a man caught the attention of everyone.</p><br/><p>Towards these gazes, Lin Fan maintained his composure. Staying cool, he raised his chin and walked ahead with a gentle smile on his face.</p><br/><p>The Jialan Peak disciples started whispering.</p><br/><p>\"Who’s this guy? Why’s he here?\"</p><br/><p>\"No idea. But by the looks of it, he should be a disciple, right?\"</p><br/><p>\"Could he be from the bunch of inner sect disciples that Senior Sister has just chased away recently?\"</p><br/><p>\"Hmph, no man in this world is good.\"</p><br/><p>\"Why don’t all men just die!\"</p><br/><p>\"That was what Senior Elder had told us.\"</p><br/><p>...</p><br/><p>Looking at these female disciples, Lin Fan was more and more dejected by the second. It couldn’t be! How could he not be recognized by even one of them?</p><br/><p>Lin Fan was kind of hurt at this point, but he could not be discouraged. Sweeping his robes back, he continued forward. He did not believe that no one would not recognize him!</p><br/><p>\"Halt there!\" Just then, a Jialan Peak female disciple stood in Lin Fan’s path. \"This is Jialan Peak. Men are forbidden up here. Granted that we’re of the same sect, I shall spare you. Leave the peak now.\"</p><br/><p>Lin Fan smiled, \"Junior Disciple, your Junior Master is here to look for a strand of herb.\"</p><br/><p>As a Jialan Peak disciple, Zhou Yaoyao was in charge of protecting Jialan Peak. Catching sight of this suspicious looking disciple with darting gazes, she determined that he was definitely up to no good. Just like all the other male disciples, he must be here with an ulterior motive. Hence, she stood up front to chase him away, lest her junior sisters got taken advantage of.</p><br/><p>But upon hearing what the other party said, Zhou Yaoyao’s face turned cold, and she snorted angrily.</p><br/><p>How dare this man try to take advantage of her?!</p><br/>\n</div>"}