{"title": "Chapter 134: Wretched Three Of The Sect", "id": 134, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-134-wretched-three-of-the-sect", "volume_title": "Volume 2", "body": "<h1>Chapter 134: Wretched Three Of The Sect</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 134: Wretched Three Of The Sect</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>As darkness fell, the sun exchanged places with the moon.</p><br/><p>But something horrifying had happened at the grounds facing the raging sea with flowers blooming all over.</p><br/><p>That night, disciples walking at the foot of that cliff heard a series of chilling roars. In fact, one could even hear the ground shaking.</p><br/><p>Now, everyone knew that Senior Brother Tian Yu stayed on that cliff. But now that he had turned into a disabled person, this blow was something nobody could handle well.</p><br/><p>Perhaps...it had driven him insane.</p><br/><p>...</p><br/><p>Next day, morning...</p><br/><p>\"Junior Brother, why must you harm yourself like this?\" Zong Hentian could not leave Tian Yu unattended. Thus, he would visit every other day. But upon reaching there today, Zong Hentian was shocked at the scene that greeted him.</p><br/><p>The ground had countless holes in it, as though it was a moon crater. And in the midst of it lied his Junior Brother, smiling retardedly as if he had turned into a fool.</p><br/><p>Tian Yu smiled at his Senior Brother emptily like an imbecile.</p><br/><p>\"Junior Brother…!\" Zong Hentian was heartbroken beyond words. Gripping his fists, he swore that he would avenge his junior brother in this lifetime.</p><br/><p>...</p><br/><p>Nameless Peak...</p><br/><p>The Earth Demons were still busy working tirelessly. Lin Fan and his disciples needed to look for a makeshift place for the night, so he set out early the next morning.</p><br/><p>The moment Lin Fan left, Zhang Ergou followed suit swiftly.</p><br/><p>Feng Bujue was left alone pitifully, with only Earth Demons as his companions.</p><br/><p>...</p><br/><p>Three days later...</p><br/><p>Lin Fan had already been to the places he wanted to go. Eventually, he opted for the two most passionate places.</p><br/><p>One was the outer sect disciple grounds, and the other was Jialan Peak.</p><br/><p>As for those lovely disciples of Jialan peak, Lin Fan totally enjoyed being there. In the presence of such sweet smelling aroma of those girls, Lin Fan felt like he was going to melt away.</p><br/><p>But what puzzled Lin Fan was that why Tian Yu hadn’t come knocking by. Could it be that he lost his way?</p><br/><p>But that shouldn’t be the case either. Now that Saint Devil Sect of Nameless Peak was so famous within Glory Sect, he should be able to find his way there by just asking any random disciple… Unless, he was utterly destroyed by his great penetration of the floor after consuming Biggra.</p><br/><p>Lin Fan’s motive for leaving him the Biggra pill was for him to regain his sense of self, for him to understand that as a man, one musn’t say that he couldn’t do it!</p><br/><p>5 days later...</p><br/><p>The Earth Demons had finally completed their work at Nameless Peak. Rows of houses stood linked with one another. Just one look and one could sense the magnificence of the place. Now, this was how a sect should truly look and feel like!</p><br/><p>Thinking back, their old living conditions was like living in a pig sty.</p><br/><p>\"Big and good!\" Lin Fan gave the bunch of Earth Demons the thumbs up.</p><br/><p>Zhang Ergou and Feng Bujue felt that happiness had come too soon. While it was shabby and dingy in the past, they had already gotten used to the living conditions. Now that the remodeling had Nameless Peak up to par with any other peak, they could not help but feel that this was truly home now.</p><br/><p>The leader of the Earth Demons revealed a big smile, and his oily green eyes shone with delight.</p><br/><p>After that, he mumbled some gibberish towards Lin Fan once again. Propping a big sledgehammer on his shoulder, he waved, and his group of Earth Demons left along with him.</p><br/><p>They left as quickly as they came. To Lin Fan, these critters were just nice guys.</p><br/><p>\"From this day on, this is finally our sect.\" Lin Fan looked at the sight before him and sighed with pride.</p><br/><p>Zhang Ergou and Feng Bujue stood behind him, filled with happiness as well.</p><br/><p>Our sect...finally looks like a proper sect.</p><br/><p>\"Congratulations, Master! As your disciples, we will give my best to uphold the glory of our sect with our lives!’ Zhang Ergou and Feng Bujue knelt after glancing at each other.</p><br/><p>At long last, they finally felt a belonging to this place, a true sense of indescribable belonging.</p><br/><p>Warriors died for those they protected.</p><br/><p>Master regarded them so highly, trusted them, and cultivated them.</p><br/><p>They were not ingrates.</p><br/><p>While Zhang Ergou was more manipulative and crafty, it was to protect himself in this dog eat dog world.</p><br/><p>Zhang Ergou knew that he was not born with talent, and his cultivation base was low. But after being recognized by the Master, he was not only brought into Saint Devil Sect as a disciple, he was the eldest disciple.</p><br/><p>This gratitude, Zhang Ergou carved it deep in his heart.</p><br/><p>Never in his lifetime would he betray this sect. One for all, all for one. He would do his best to uphold the honor of this sect, and spread its glorious name.</p><br/><p>Just like Zhang Ergou, Feng Bujue was hands down in respect. Perhaps he might have harbored thoughts of returning to Glory Sect in the past, but as time passed, he too had gotten comfortable being here.</p><br/><p>In fact, his heart might even be rooted to this place already.</p><br/><p>Spreading out his arms, Lin Fan gazed at the skies and closed his eyes gently. Slowly, he took in a deep breath.</p><br/><p>This was it. This was the feeling.</p><br/><p>‘Ex Grand Master of Saint Devil Sect, believe in me. One day, I will definitely turn Saint Devil Sect into the strongest sect in the world, beyond anyone else in this universe. I’ll kill my way back to Cangling continent, and then, it’ll be time to seek revenge for our countless brothers, for our lost sect.</p><br/><p>\"Ergou! Bujue! From today onwards, Saint Devil Sect shall be our everything.\" Lin Fan declared with a solemn look.</p><br/><p>\"Yes!\" The both of them nodded.</p><br/><p>\"For the sect, we throw our lives here!\"</p><br/><p>At that moment, the skies turned gray, with the three of them wearing a stern look on their faces. They were filled with hope towards their future. Saint Devil Sect was going to be their everything.</p><br/><p>\"Junior Master...is he around?\"\" Just then, a figure appeared from a distance towards the peak’s entrance.</p><br/><p>Focusing his gaze, Lin Fan momentarily let out a smile.</p><br/><p>Zhang Ergou and Feng Bujue looked at each other, then towards Lin Fan, and they nodded their heads.</p><br/><p>They knew what they had to do next.</p><br/><p>The fish was hooked on the bait.</p><br/><p>Master had already told them beforehand that this was the talented genius who had his cultivation foundation destroyed in the forbidden grounds expedition.</p><br/><p>Now that the sect was starting out and they needed a ton of fresh blood, Master seemed to have great hopes for this Tian Yu.</p><br/><p>But, the two of them did not know what Master saw in him. With his cultivation foundation destroyed, what hope was left in him? Unless Master even had the ability to cure someone’s cultivation foundation?</p><br/><p>Hmms, yes. That must be it! In their hearts, Master was a figure who was akin to a God. If it was their great Master, definitely there was a chance.</p><br/><p>And just then, the gray skies cleared. The tense atmosphere from before disappeared, as though it had never been there.</p><br/><p>Spreading through Nameless Peak instead was a scent of a deep plot.</p><br/><p>Now that Tian Yu had knocked on the door himself, there was no way he could escape Lin Fan’s grasp anymore.</p><br/><p>Lin Fan smiled gently and revealed that compassionate face once more. He walked towards Tian Yu, \"Junior Disciple, I suppose you’ve thought it through.\"</p><br/><p>...</p><br/><p>Tian Yu was draped in black robes. He hid himself so that no one would discover him as he left the cliff.</p><br/><p>This was perhaps the last chance Tian Yu had. He did not want to be a disabled man for the rest of his life, but neither did he want to let anyone know he was seeking a cure at the Nameless Peak.</p><br/><p>Not even Zong Hentian knew about this.</p><br/><p>His departure was to let everyone think that he had left for good. When he appeared in the peak once more, it would be when he was at his pinnacle. And everyone would know…</p><br/><p>Tian Yu had returned.</p><br/>\n</div>"}