{"title": "Chapter 146: Fusion Success", "id": 146, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-146-fusion-success", "volume_title": "Volume 2", "body": "<h1>Chapter 146: Fusion Success</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 146: Fusion Success</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>When they returned to their campsite, Elder Yu wasn’t around. He was still busy in discussions with the other sects.</p><br/><p>A frontal attack was definitely unavoidable. Just that with the strength of the Snow Lion, if they were to just rush forth head on, there might be countless casualties. Furthermore, no one was certain of the actual situation. If the Snow Lion were to have any other beasts as a backup, then things would get sticky.</p><br/><p>\"Junior Master! Senior Brothers! Are the surrounding beasts cleared?\" The few disciples who had stayed behind asked.</p><br/><p>\"Yes, all cleared. To think that we even bumped into a pericelestial upper-level beast in this area. I wonder how many higher leveled beasts there are.\" Zong Hentian replied worriedly.</p><br/><p>One pericelestial upper-level beast was still manageable. But if their numbers are in the tens, or worse still, hundreds, then that was certainly an issue.</p><br/><p>\"Pericelestial upper level?!? Floating Snow Peaks is just an average peak! Why would the Snow Lion’s arrival to give birth attract so many high leveled beasts!\" A disciple questioned. He too could not help but start to worry. After all, given the same cultivation bases, beasts had the advantage over humans.</p><br/><p>...</p><br/><p>Lin Fan’s was thoroughly preoccupied in his thoughts with the fusion function.</p><br/><p>To Lin Fan, this was definitely going to be an overpowered function. After all, every function produced by the system so far was simply incredibly strong.</p><br/><p>Excusing himself, Lin Fan entered a tent and began researching on this fusion function.</p><br/><p>Entering his consciousness excitedly, Lin Fan activated the fusion function. Instantly, 2 basins appeared within his mind. From both of them, a golden thread each was coming out, leading up to a 3rd golden basin above them, forming a triangle.</p><br/><p>Lin Fan took out some medicinal herbs and threw them in. Failed.</p><br/><p>He then tried with some pills. Failed again.</p><br/><p>Weapons. Failed. Armor. Failed.</p><br/><p>Everything failed. The only thing he had left was martial arts.</p><br/><p>Theorizing in his mind, Lin Fan threw in 2 martial arts. Just then, something astonishing happened.</p><br/><p>From the 2 basins, a golden glow filled the threads and slowly culminated within the 3rd basin.</p><br/><p>‘Ding…Fuse ‘Twisting Heaven and Earth’ and ‘Black Tiger Steals Heart’. Confirm?’</p><br/><p>Confirm my a*s. Without even confirming the situation, how could he fuse two godly skills together? Obviously, he was going to start with those he rarely used.</p><br/><p>He retrieved the two martial arts and threw in two new ones.</p><br/><p>Light middle grade ‘Immovable Royal Fist’ and ‘Wind Chasing Sword.’</p><br/><p>Not only did Lin Fan rarely use them, he hardly even touched them. Therefore, even if these two were to turn to crap, he wouldn’t be heartbroken in the least bit.</p><br/><p>‘Ding…confirm?’</p><br/><p>‘Fuse.’</p><br/><p>Lin Fan chose without hesitation. To him, these were just worthless rubbish.</p><br/><p>Just then, a sword passed through the air and covered Lin Fan’s eyes. He could not see what exactly was happening.</p><br/><p>‘Ding…congratulations. Fusion success. Please name your new martial art.’</p><br/><p>Lin Fan hated naming stuff. Fine, since he had to do it, he’d just make do with anything.</p><br/><p>‘King of Swords’</p><br/><p>What a name. This name exuded of dominance and something unattainable for the masses.</p><br/><p>Just like him.</p><br/><p>‘Ding…congratulations on naming success.’</p><br/><p>‘Martial Arts able to level up indefinitely. Current level: 1.’</p><br/><p>Lin Fan could feel the power exuding from this new martial art. It was definitely way stronger than the two martial arts he had combined together.</p><br/><p>In fact, the difference in power levels could be described as Heaven and Earth.</p><br/><p>But even though the fusion went through successfully, Lin Fan still did not want to risk it with his proper skills. Only after he had determined its success rate with a couple more attempts would he consider throwing in better skills.</p><br/><p>When Lin Fan exited the tent, the skies were already gray.</p><br/><p>\"Leave the stuff behind, and you may go.\" An inner sect disciple said to someone who seemed to be from Sky City.</p><br/><p>\"There’s still a roasted goat!\" Lin Fan looked ahead. On the long table, there was a couple of roasted ducks and wine. His stomach growled.</p><br/><p>\"Junior Master, you’re out! Dinner is ready.\" A disciple who was standing by the table was already salivating at the sight of the delicious feast. Upon seeing Junior Master’s appearance, naturally, his first task was to greet him towards the food.</p><br/><p>Even though they did not know Junior Master Lin’s true cultivation base. Just the fact that he could pull off such a stunt on Fengtian Sect was enough for them to respect him.</p><br/><p>Furthermore, how could they not understand from Elder Yu’s actions: Lin Fan’s life was the most important thing in this expedition.</p><br/><p>\"To the honorable sect members present, this is my younger sister. Would you guys take a look to see if she’s suitable to join the sect?\" Just then a young man held the hands of a small girl and stared at Zong Hentian courteously.</p><br/><p>This young man was none other than Cai Family’s eldest son, Cai Yi. His purpose here, other than sending food, was to hope that his sister could enter the sect.</p><br/><p>Cai Yi knew for a fact that his potential was too low for the sects to take him in. Therefore, he could only hope that his sister had a chance.</p><br/><p>In Cai Yi’s point of view, the Chu Family must definitely be trying to pull closer strings with the other sects as well. If they were to reach an agreement, things would be bad for the Cai Family.</p><br/><p>Zong Hentian glanced at the both of them and instantaneously said idly, \"Low potential.\"</p><br/><p>As an inner sect talent, Zong Hentian naturally had his pride. He did not pay much attention usually towards mere mortals like them.</p><br/><p>After all, Zong Hentian had bumped into many of these families who were often eager to get some connections with sects.</p><br/><p>If once in a while, one of them possessed immense potential, they could naturally be considered to be brought into the sect. But glancing at both of them, Zong Hentian immediately knew that they did not have what it took.</p><br/><p>\"Junior Master.\" Seeing Lin Fan step forth, Zong Hentian greeted courteously.</p><br/><p>Lin Fan nodded in acknowledgment. Looking at the young lolita who was only about five years old, Lin Fan smiled, \"Small girl, what’s your name?\"</p><br/><p>Looking at this young Lolita, Lin Fan was reminded of some events and people from his past life.</p><br/><p>At the same time, he had some sort of understanding towards this young lolita.</p><br/><p>Tender white skin with large eyes, her makeup was minimal with good clothes. Her cherry peach lips were small and full, and she looked like someone who was obedient and good at pleasing others.</p><br/><p>\"Big Brother! My name is Cai Zhiqiao.\" The young Cai Lolita grabbed her brother’s hands tightly. Even though she was slightly afraid, her voice was still clear and vibrant.</p><br/><p>Lin Fan squatted down and rubbed her head, \"This is a good seed.\"</p><br/><p>Zong Hentian was filled with misgivings, but since Junior Master had said so, he could not refute his words.</p><br/><p>Cai Yi took a leap of joy in his heart. At first, he had thought that there’d be no chance anymore. But to think that this would happen. Seemed like there was hope for his younger sister to enter the sect.</p><br/><p>\"Would you be willing to go somewhere else? But, you would not be able to see your family for a really long time. Is that okay?\" Lin Fan asked.</p><br/><p>In Lin Fan’s eyes, if he were to able to lure a young Lolita back to the sect, it’d be a more lively place. At least, he wouldn’t have to just stare at males like Zhang Ergou daily anymore.</p><br/><p>Cai Yi was extremely excited as he gripped his sister’s arm tightly. Looking at her in anticipation, he could barely contain himself in shouting, \"Agree! AGREE!\"</p><br/><p>The young Cai Lolita looked at Lin Fan, then at her brother. With her bright sparkly eyes, she cowered and shook her head, \"I’ll…be wherever…father and mother are…where brother is…\"</p><br/><p>\"Sir! My…my younger sister is still young! Let me explain…!\" Cai Yi interrupted anxiously.</p><br/><p>From the sides, Zong Hentian snorted coldly. The nerve of these people.</p><br/><p>\"Elder Yu has returned!\"</p><br/><p>Elder Yu, who had left the site to discuss strategies with the other sects, had returned. Looking at the solemn look on his face, Lin Fan garnered that something must have happened.</p><br/><p>\"What are you guys here for?\" Elder Yu asked sternly.</p><br/><p>\"The eldest son of Sky City’s Cai Family, Cai Yi, greets the honorable sir!\"</p><br/><p>\"Hmph! Instead of guarding the 4 entrances of Sky City, what are you doing here? GO!\" Elder Yu replied without any mercy. Evidently, he was fuming over something.</p><br/><p>\"Yes…yes!\" At Elder Yu’s fierce attitude, Cai Yi and the young Lolita were both scared out of their wits.</p><br/><p>\"You guys go on ahead. Once things are settled, I’ll pay you a visit.\" Lin Fan smiled gently.</p><br/><p>The matter ahead was of importance. Whether or not he could lure the young lolita, he would have to leave that up to fate.</p><br/><p>Once again, Cai Yi, who had lost all hope, lit up again. He thanked Lin Fan earnestly and ran off with his younger sister.</p><br/><p>\"Elder Yu, did something happen?\" Lin Fan asked.</p><br/><p>\"Sigh…these mother*ckers…\" Elder Yu gritted his teeth with anger.</p><br/>\n</div>"}