{"title": "Chapter 152: Unbearable Scene", "id": 152, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-152-unbearable-scene", "volume_title": "Volume 2", "body": "<h1>Chapter 152: Unbearable Scene</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: Unbearable Scene</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Killed in a second?!?</p><br/><p>Without room for retaliation?!?</p><br/><p>In the hands of the beast, even three lesser celestial peak cultivation masters were…! This…this…!</p><br/><p>Elders of the six sects could no longer believe their eyes. This was just a lesser celestial upper-level beast! How could it be this strong?!?</p><br/><p>Even with the bloodline of the ancient beast flowing through it, there was no way it should be THIS strong!</p><br/><p>\"Elder, what should we do?\" Zong Hentian’s voice trembled slightly. As a genius, there should be no reason for him to be fearful. But the violence of the beast had caused him to waver ever that slightly.</p><br/><p>Even Lin Ao, the number one genius of Fengtian Sect, was dumbfounded. This level of power was not something they could handle.</p><br/><p>Even lesser celestial full cultivation masters were swiped down by a single claw. Could it have grown to be a greater celestial beast already?!?</p><br/><p>...</p><br/><p>Old Lady Tianji, Zhang Tianheng and Shang Wusheng laid firmly buried feets under the ground, where the surroundings were filled with their blood.</p><br/><p>The initially confident faces of theirs were all now just pale as a sheet, without any trace of blood in it.</p><br/><p>‘How…could this be! How could this be!’ Old Lady Tianji was dumbfounded. As though every single bone in her body was broken, she could not even move a single inch.</p><br/><p>The swipe by the Snow Lion was powerful beyond words. At the moment it came down, they were like little ships being swallowed by a giant tsunami.</p><br/><p>The only saving grace they had was that the Snow Lion did not pay any attention to them. Rather, it was frantically in search of something.</p><br/><p>Disciples from the three sects hurried down the gigantic arks, rescued their elders and left the Floating Snow Peaks.</p><br/><p>They had to return to inform their sects that the situation regarding the Snow Lion had changed.</p><br/><p>...</p><br/><p>The Snow Lion grew ever more berserk as time went by, as though infinite energy was surging through its body.</p><br/><p>Just then, the Snow Lion roared again. The maniacal roar was forceful, as though it could rip apart heaven and earth. She could no longer tolerate it.</p><br/><p>The Snow Lion ran up the peak of the mountain, and with her razor-sharp claws, she shaved and molded the tip. As it turned into a thick and long rod, she plunged herself onto it anus down with a hungry and thirsty look in her eyes.</p><br/><p>\"What…what is the Snow Lion doing!\" All six sects were flabbergasted at the sight. The world had changed instantly.</p><br/><p>‘This…this!’ The six elders did not know what to make or say of this situation. How could the Snow Lion be doing something so shameless?!?</p><br/><p>...</p><br/><p>‘RAWRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR’</p><br/><p>A series of enjoyable and pleasurable roars spread through the entire Floating Snow Peaks. Even the citizens of Sky City could hear this series of roars.</p><br/><p>Everyone was filled with questions. How could that enraged roar from earlier turn into such gentle roars?</p><br/><p>Could it be that the six sects had walloped it so hard that this was the beast’s way of crying out for help?</p><br/><p>...</p><br/><p>Inside the Snow Lion’s body, Lin Fan too was about to explode.</p><br/><p>What the hell is up with this place. Enough with the swirling around at the start, why was it even moving up and down now? What the hell was wrong with it?</p><br/><p>And what he wondered about more was the random appearance of the peak within the beast at times.</p><br/><p>What was going on outside?</p><br/><p>And just then, the peak which had disappeared reappeared once more in front of him, shooting up like a lightning rod. Lin Fan was so taken aback that he jumped back.</p><br/><p>As the body continued bobbing up and down, Lin Fan was dumbfounded.</p><br/><p>‘Don’t tell me that the Snow Lion is using it as a dil…dil…!’</p><br/><p>Lin Fan did not dare to imagine any further. This was too spicy for his tender mind.</p><br/><p>Even though he had used that bit more Biggra and had caused the Snow Lion to feel aroused, but this…this was just too much!</p><br/><p>‘Snow Lion! At the end of the day, you’re still a mother! How can you do something so utterly shameless!’</p><br/><p>‘Stop it this instant! Yours Truly is about to break down from your antics!’</p><br/><p>Lin Fan was thoroughly speechless. His view of this world had been forcefully violated by this Snow Lion.</p><br/><p>Why! WHY!</p><br/><p>‘How could you be doing something like this! How are you going to raise your head high in front of your fellow beasts from this day on!’</p><br/><p>Back on the outside, the six sects were equally stupefied.</p><br/><p>\"Elder, do you think…there’s hope for Junior Master?\" A glory sect disciple asked.</p><br/><p>Elder Yu did not reply. He no longer knew what to say.</p><br/><p>This behavior by the Snow Lion…there has been no record of such behaviour since the beginning of time.</p><br/><p>As the sun set…</p><br/><p>The six sects had been standing there the entire day staring at this show without even blinking an eyelid.</p><br/><p>For this expedition, Fengtian Sect had intended to forcefully take down the Snow Lion’s cubs. But at the sight of this, they no longer had any intention to do anything..</p><br/><p>Violent…this was way too violent.</p><br/><p>It wouldn’t even spare an inanimate mountain…</p><br/><p>This had never ever happened before.</p><br/><p>Never. In. History.</p><br/><p>Every sect had the same idea. Whoever obtained the cubs from this expedition, what if the cubs turned out in this manner as well in the future…?</p><br/><p>They had not expected such a tradition to exist within the bloodlines of an ancient beast. Who knew if they were to breed a Snow Lion cub till maturity and one fine day, it went berserk as such. Who could stop it by then?</p><br/><p>They had to etch this incident into their hearts and when they got back to the sect, immediately record it down for all the future generations of the sect to take note.</p><br/><p>Three days later…</p><br/><p>The crowd had remained for 3 days as well. It wasn’t because they did not want to leave. But each and every one of them wanted to find out how things would eventually resolve.</p><br/><p>And on this day, a sharp howl could be heard in everyone’s ears as finally, everything stopped.</p><br/><p>The berserk Snow Lion had calmed down, as the red fur returned to its original snow white.</p><br/><p>But what surprised everyone was that after it calmed down, it went back into a momentary rage. Swiping away every single peak it could find around the area, it returned to its lair in a huff.</p><br/><p>Everyone glanced at each other, unable to comprehend what had just happened.</p><br/><p>\"Ended? Then, what do we do now?\"</p><br/><p>\"The Snow Lion is not something we can deal with. Let’s return to the sect.\"</p><br/><p>...</p><br/><p>\"Elder! Junior Master…!\" Zong Hentian asked.</p><br/><p>Elder Yu’s face was grim. It had been three days. Based on the Snow Lion’s metabolism rate, Lin Fan should be little more than bones by now. It would be impossible to even find his corpse any longer.</p><br/><p>\"We’ll guard Junior Master Lin’s spirit for 3 days from here on. Prepare the burial grounds.\"</p><br/><p>\"Yes.\"</p><br/><p>...</p><br/><p>Upon returning to the lair, the Snow Lion laid down warmly and entered a deep slumber after exhausting every bit of energy it had.</p><br/><p>Within the Snow Lion, Lin Fan was already befuddled by everything that had happened. Puking every single day, he had lost track of time inside the Snow Lion. Every single day felt like an eternity.</p><br/><p>Had he known that it would be like this, he would rather have died than give the Snow Lion Biggra. If not for his ‘Eternal Demon Body’ being of a high level, he would have long been smashed dead by the peak that entered her.</p><br/><p>Finally, Lin Fan could sit down and rest peacefully. He presumed that the effects of Biggra must have finally ended.</p><br/><p>As to what was to happen next, he had to think of a way to get out. He couldn’t remain cooped within here forever.</p><br/><p>But if he escaped now, wouldn’t he just be slapped dead by the Snow Lion in one smack?</p><br/><p>At this, Lin Fan cried…</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>The Chinese believe that the spirit remains for a short while post-death. So, the Glory Sect was intending to stay behind as a form of respect for Lin Fan.</p><br/><p>But other than that, HAHAHAHA THIS CHAPTER PLEASE.</p><br/>\n</div>"}