{"title": "Chapter 161: Ultimate Hidden Skill: Air Flower Style Whipping", "id": 161, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-161-ultimate-hidden-skill-air-flower-style-whipping", "volume_title": "Volume 2", "body": "<h1>Chapter 161: Ultimate Hidden Skill: Air Flower Style Whipping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 161: Ultimate Hidden Skill: Air Flower Style Whipping</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"See, Junior Master! This man is completely nuts!\" The disciple was extremely enraged.</p><br/><p>\"No issues. Yours Truly wishes to give it a shot. Would you guys please leave first?\" Lin Fan took the whip out of the disciple’s hands.</p><br/><p>\"Yes.\" The disciple nodded his head. Now that this fella’s cultivation base was sealed, there should probably be no way he could harm Junior Master. As for Junior Master’s words about saving this man? That was definitely impossible.</p><br/><p>As for the genius disciple, the sect themselves had tried over the years to not give up on him. But as the years went by, he only grew ever more deranged and changed completely.</p><br/><p>On the outside…</p><br/><p>A few disciples were deep in whispers.</p><br/><p>\"Senior Brother, what did Junior Master mean? Is there still any hope for Mie Qiongqi?\" An outer sect disciple asked suspiciously.</p><br/><p>\"I’ve got no idea what Junior Master intends to do, but Mie Qiongqi is irreconcilable. Back then, even Grand Master himself made his way down. But in front of him, Mie Qiongqi was impudent all the same, even taunting to kill all of the sect’s disciples.\"</p><br/><p>\"We should probably inform the elder of this matter. Even though Mie Qiongqi’s cultivation base is sealed, he is still a dangerous person nevertheless.\"</p><br/><p>\"Yes.\"</p><br/><p>...</p><br/><p>Within the room…</p><br/><p>\"Young one, look at me.\" Lin Fan lowered his voice and focused his eyes on Mie Qiongqi.</p><br/><p>\"What for?!\" Mie Qiongqi growled. Those eyes were deadlocked on Lin Fan, and he couldn’t wait to tear the brains out of Lin Fan.</p><br/><p>\"Do you acknowledge your mistakes!\" Lin Fan asked solemnly. With the wave of his hand, Lin Fan cracked the whip through the air.</p><br/><p>\"Hmph! Mie Qiongqi never apologizes for any kill he makes!\"</p><br/><p>‘PSSH!’</p><br/><p>Just then, Lin Fan swung the whip over to Mie Qiongqi’s crotch.</p><br/><p>Mie Qiongqi’s body was beyond strong, hence he definitely needed to use that bit more strength.</p><br/><p>And this spot was specially chosen by Lin Fan. Based on his current understanding, the purpose of training was to allow one to feel shame and submit before him.</p><br/><p>Mie Qiongqi yelled. Within those eyes was a strand of disbelief.</p><br/><p>His body was tempered beyond this world and bulky. How could he still feel pain?!?</p><br/><p>\"HOW DARE YOU HUMILIATE ME! I’LL KILL YOU!\" Mie Qiongqi was even more deranged than before. But since his cultivation base was sealed up and his limbs tied up, all he could manage was the incessant clanking of the chains shackling him.</p><br/><p>Lin Fan frowned. This wasn’t the feeling from before. Trainer did not seem to be working out too well.</p><br/><p>Contemplating for a moment, Lin Fan wondered for a bit.</p><br/><p>Just then, with the raise of his hands, Lin Fan swished the whip at the 4 chains shackling Mie Qiongqi. With the chains unlocked, Mie Qiongqi fell to the ground, free once more.</p><br/><p>Mie Qiongqi was on all fours. He did not raise his head, nor did he speak. But his eyes burned with a rage that he could not contain.</p><br/><p>\"DIE!\" Mie Qiongqi rushed at Lin Fan, disregarding the latter’s cultivation base.</p><br/><p>\"Impudent!\" Lin Fan raised his whip and slashed through the air.</p><br/><p>PSSH! PSSH!</p><br/><p>Like lightning, two streaks appeared across Mie Qiongqi’s face.</p><br/><p>Mie Qiongqi, who was about to rise, realized something. Something changed. An unspeakable aura filled the room, and this aura caused Mie Qiongqi’s heart to thump furiously.</p><br/><p>\"This feeling…!\" Mie Qiongqi clutched at his chest. This was not good.</p><br/><p>Looking at his behavior, Lin Fan pondered for a moment. Did Trainer work? But evidently, this Mie Qiongqi was one hell of a stubborn boy. If he were to have this boy fully submit, he would have to go all out.</p><br/><p>Lin Fan stepped forward and kicked him lying face up on the ground. With one leg on Mie Qiongqi’s chest, Lin Fan shouted, \"Look at me!\"</p><br/><p>\"No…I won't…!\" Mie Qiongqi felt a fear in his heart. This was a feeling he had never felt before. To think that that unwavering heart of his would feel fear, and in fact, a feeling of submissiveness.</p><br/><p>\"Hmph?!\" Lin Fan snorted coldly and began swirling and twirling his hand. The whip twisted like a snake and wrapped itself around Mie Qiongqi’s crotch.</p><br/><p>\"AHHHHHH….!\"</p><br/><p>Mie Qiongqi cried out. The object on his crotch was tightly wrapped by the whip, and with the rush of blood towards the area, it felt like it was going to explode.</p><br/><p>This was Lin Fan’s virgin attempt at these type of punishment plays. He was a little afraid and nervous as well. But for the sake of experimenting with his new side profession, he had to do it.</p><br/><p>\"Look at me!\" Lin Fan shouted again as he lifted his hand. Mie Qiongqi cried out in pain repeatedly as the object on his crotch felt like it was dropping off.</p><br/><p>This cruel and inhumane punishment was something that Mie Qiongqi had never experienced before. But just this once, Mie Qiongqi actually felt like he was being destroyed bit by bit.</p><br/><p>The disciples waiting outside had goosebumps as they heard the cries from within.</p><br/><p>\"What exactly is Junior Master doing!\"</p><br/><p>\"No idea! But this is the first time I’ve heard Mie Qiongqi scream so tragically!\"</p><br/><p>\"Hahaha! Seems like Junior Master has finally gone for it! Mie Qiongqi will pay the price for his defiance!\"</p><br/><p>...</p><br/><p>\"Look at me…!\"</p><br/><p>Mie Qiongqi turned his head slightly to gaze at Lin Fan, with fear brimming within his eyes. But even more than fear was the feeling of…shame, as his crotch continued to tear apart.</p><br/><p>\"Do you acknowledge your mistakes!\"</p><br/><p>\"Mie Qiongqi is never wrong!\" Mie Qiongqi did not dare to look Lin Fan directly in the eyes as he continued shouting haughtily.</p><br/><p>\"Hmph, still no growth!\" Lin Fan was getting furious. He kicked Mie Qiongqi up in one swift motion. Throwing out his whip, he spun Mie Qiongqi around.</p><br/><p>\"Crouch on all fours!\"</p><br/><p>Lin Fan realized there was something wrong with this position, but it was too late. He could only follow through with it.</p><br/><p>Bam!</p><br/><p>Falling down, Mie Qiongqi landed on his knees, and his hands slapped down onto the cold ground. Just then, the whip in Lin Fan’s hands seemed to have grown eyes and sliced opened Mie Qiongqi’s pants, revealing his backside.</p><br/><p>PSSH! PSSH!</p><br/><p>Like a lively snake, the whip in Lin Fan’s hands danced on Mie Qiongqi’s backside.</p><br/><p>With the boost of Trainer, the whip was like a mystical weapon which left streaks of red etched deeply onto Mie Qiongqi’s backside.</p><br/><p>Mie Qiongqi’s expression changed. With every oncoming whip, he could feel his heart breaking down into a smaller piece.</p><br/><p>\"No…\"</p><br/><p>\"NO…!\"</p><br/><p>\"I’M SORRY!\"</p><br/><p>The initial haughty Mie Qiongqi broke down into tears. Upon hearing this, Lin Fan leaped with joy. After all, a savage torture as such had better work as well.</p><br/><p>But just at that moment, Lin Fan realized something.</p><br/><p>Shit. Something. Was. Wrong.</p><br/><p>‘Ding…inauguration of Trainer’s first successful training! Complementary hidden skills uncovered: ‘Air Flower Style Whipping’.</p><br/><p>‘Ding…system will hand out the complementary skill now. User, please do not blink and learn with your heart.’</p><br/><p>‘F*CK F*CK F*CK F*CK F*CK F*CK F*CK NO!’ Lin Fan was absolutely flabbergasted. Yours Truly was not a sadist…!</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA THIS HAS GOTTA BE ONE OF THE BEST CHAPTERS EVER. WOW. ARE YOU BLOODY KIDDING ME HAHAHAHAHA THEY SERIOUSLY PUT IN SM INTO THIS HAHAHAHAHAHAHAHAHAHAHAHAHA.</p><br/>\n</div>"}