{"title": "Chapter 160: Something's Wrong With This Character", "id": 160, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-160-somethings-wrong-with-this-character", "volume_title": "Volume 2", "body": "<h1>Chapter 160: Something's Wrong With This Character</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 160: Something's Wrong With This Character</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan looked up at the skies and sighed. ‘Trainer…What is your true purpose?’</p><br/><p>Lin Fan was feeling somewhat anxious. Nowadays, the system was getting lazier and lazier. Even as it gave him a new technique, it did not give him a full explanation of it.</p><br/><p>He could only uncover all of it through active experimentation.</p><br/><p>Lin Fan pushed opened the door, ready to head out. It was time to find a good place to test out the purpose of being a Trainer.</p><br/><p>The scenery was beautiful on this very day.</p><br/><p>His young little cute disciple was deep in her slumber. Since he had brought her in, he had the duty to ensure that she was brought up carefully.</p><br/><p>Lin Fan looked around and caught view of Zhang Ergou’s lonely self. He was seated on the stone bench Lin Fan once sat on, gazing across the fields.</p><br/><p>Lin Fan headed over briskly. He could feel the loneliness in Zhang Ergou’s heart.</p><br/><p>\"Ergou, what are you thinking about?\" Lin Fan stood behind Zhang Ergou. Staring at his ugly face, Lin Fan asked gently.</p><br/><p>\"Master. I’m thinking about the future.\"</p><br/><p>Lin Fan grew slightly suspicious. He had not expected the ill-disciplined Zhang Ergou to be contemplating about the future.</p><br/><p>This…was not right.</p><br/><p>\"Ergou.\"</p><br/><p>\"Yes?\"</p><br/><p>\"Your sunken spirit does not allow Yours Truly to see a positive future.\" Lin Fan sighed helplessly.</p><br/><p>Just then, a weird aura encompassed the entire field.</p><br/><p>This aura, while huge, was gentle and light. It was hard for anyone to notice it. Not even Lin Fan himself could.</p><br/><p>The initially sunken Zhang Ergou had a change in his expression. With a look of shame and guilt, he stood up immediately.</p><br/><p>\"Great Master, I will head back and cultivate immediately. I will definitely show you the future of this sect.\" Zhang Ergou said solemnly. Without waiting for Lin Fan’s reply, he headed off back to his house immediately.</p><br/><p>Lin Fan stood there somewhat stunned. What had just happened? Could this be the power of the Trainer?</p><br/><p>But no matter what, Lin Fan did not let it bother him. He headed off to the Punishment Hall of the sect.</p><br/><p>The Punishment Hall was a place where punishments were meted out. It contained disciples who had done any wrongdoings and some spies from the other sects.</p><br/><p>Arriving at the hall, the disciples who stood guard outside recognized Lin Fan immediately.</p><br/><p>In the sect, Lin Fan was some sort of a celebrity now. While not everyone had seen his face before, everyone definitely had heard of his name. And this disciple at the entrance was an outer sect disciple who had the honor of seeing Lin Fan before. Thus, he was all the more excited.</p><br/><p>\"Junior Master Lin! What brings you here?\"</p><br/><p>\"Ah, Junior Disciple, Yours Truly is here to take a visit. While the Junior Disciples within here may have committed mistakes, Yours Truly hopes to be able to enlighten them to repent one day as well.\" Lin Fan’s ability at bullsh*tting was number one in the entire universe.</p><br/><p>But to these disciples at the entrance, they were touched beyond words. To think that Junior Master Lin had such kind intentions. Indeed, what a respectable man he was.</p><br/><p>\"Junior Master, I have to humbly remind you. The disciples locked up here are heinous and evil. Some of them have already entirely lost their human hearts and are worse than beasts.\"</p><br/><p>Lin Fan smiled and nodded, \"Yes.\"</p><br/><p>Of course, to test out the full potential of being a Trainer, Lin Fan had to find some strong test subjects to deal with. If they were too weak, then it’d be meaningless.</p><br/><p>Devious and vicious, worse than beasts…. Great!</p><br/><p>On entering, it was just like a jail. With turns and curves, both sides of the wall were lined with cells which were filled with prisoners.</p><br/><p>Inside, the killing intent filled the entire space. It was like the Infernal Hell. No one was crying out for grievances…the only things that could be heard were growls and the incessant ramblings of ‘Kill…Kill!’</p><br/><p>Lin Fan continued walking briskly ahead. There was a lighted path up in the distance, and the sound of a whip slashing against someone’s skin rang through Lin Fan’s ears.</p><br/><p>\"HAHAHA! ONCE I, MIE QIONGQI, GET OUT OF THIS PLACE, I’LL BE SURE TO PLUCK OFF ALL OF YOUR HEADS AND USE THEM AS BALLS TO KICK AROUND! CMON, WHIP ME HARDER. WITH MORE STRENGTH.\" A disciple was tied up on a pole with his muscles ripped and exposed. There was not a single strand of hair on his head. He just had a deranged look like a beast.</p><br/><p>The entrance of Lin Fan attracted the attention of everyone around.</p><br/><p>\"Eh? Junior Master Lin! Why are you here!\" A disciple who was seated at a corner got up hurriedly to Lin Fan and greeted.</p><br/><p>\"I’m here to take a look. Who is this man here?\" Lin Fan pointed at the tied up disciple.</p><br/><p>\"Junior Master, he is an inner sect disciple and was once one of the geniuses. During a forbidden grounds expedition, he killed our fellow disciples to obtain a treasure!\" The inner sect disciple’s face was furious as he related the story.</p><br/><p>\"What is his sentence?\"</p><br/><p>\"6 years of whipping and the destruction of his cultivation base. Following which, he will be ousted from the sect.\"</p><br/><p>Lin Fan stepped forward and inspected Mie Qiongqi, who was tied up.</p><br/><p>\"Whatcha staring at! Your Father, me, will slap your fucking face into meat buns.\" Mie Qiongqi roared savagely like a beast indeed.</p><br/><p>‘PIAK!’</p><br/><p>\"How dare you be impudent to Junior master Lin!\" With a raise of his hands, a disciple by the side brought the whip onto Mie Qiongqi’s body once again.</p><br/><p>\"HAHAHAHAHA!\" Mie Qiongqi laughed. The whipping meant nothing to him.</p><br/><p>Even though his cultivation base was sealed by the Elders, his body had already reached a level beyond that of mere humans.</p><br/><p>‘Lesser Celestial Upper Level (Sealed)’</p><br/><p>This was the highest cultivation base Lin Fan had seen in any disciple thus far.</p><br/><p>Lin Fan sighed helplessly. Indeed, this man must have been one of the best geniuses within Glory Sect.</p><br/><p>In today’s Glory Sect, no one within the inner sect disciples could hold a candle to him at all.</p><br/><p>Thinking of the thrashing their disciples had received from the other sects…perhaps if this guy had not done anything wrong, Glory Sect would not be in such a situation today.</p><br/><p>\"Regrettable. Regrettable indeed.\" Lin Fan shook his head. \"Lesser Celestial Upper Level, sect Genius, how could you commit murder of our very own blood? What a disappointment.’</p><br/><p>\"Hmph, Your Father can kill anyone he likes! It’s none of your business!\" Mie Qiongqi shouted barbarically as green veins burst out from his forehead.</p><br/><p>\"Junior Master! The environment here is dirty and tainted! The honorable you should head back first!\" The disciple in charge of interrogating him was filled with fury. How dare this fella insult the great Junior Master Lin! Once Junior Master Lin was gone, he’d teach this guy a good lesson!</p><br/><p>\"No worries. By the looks of it, even though he seems feral…Yours Truly can still sense a speck of conscience within him. Perhaps, he is still salvageable.\" Lin Fan waved his hands.</p><br/><p>\"Junior Master Lin, they’ve gone completely insane! His sentence was to be death itself. But Grand Master had considered his past contributions to the sect. Hence his life was spared, and only his cultivation base was destroyed!\"</p><br/><p>\"What are you idiots rambling on about! Your Father does not need anyone’s mercy! Even if you were to kill Your Father, Your Father will reincarnate and f*ck you sh*ts back to hell!\" Mie Qiongqi struggled fiercely.</p><br/><p>Lin Fan frowned slightly. Something was wrong.</p><br/><p>Back in his old life, Lin Fan had read countless of books and novels. A character like him was the perfect fit to be an antihero!</p><br/><p>Strong Cultivation Base. Check.</p><br/><p>Haughty attitude. Check.</p><br/><p>Killing Intent. Check.</p><br/><p>And the most crucial point was that he wasn’t afraid of death at all.</p><br/><p>Most villains would tremble and kneel at the final thought of death, but Mie Qiongqi was different.</p><br/><p>Indeed, something was off.</p><br/><p>It was time for him to give it a shot.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hi guys! We have reached our first stretch goal on patreon and hence this 2 chapter burst release of 160 and 161! I would like to thank you guys so, so, so, so much for all the support and love that you guys have been giving this is all thanks to you guys! So grateful to get to know all of you guys haha.</p><br/><p>Oh and by the way Qidian has a new power ranking thing? That's new? Hahaha!</p><br/>\n</div>"}