{"title": "Chapter 176: A Night Of Tension", "id": 176, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-176-a-night-of-tension", "volume_title": "Volume 2", "body": "<h1>Chapter 176: A Night Of Tension</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 176: A Night Of Tension</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The night was really dark. As the wind howled outside, there were dark shadows every now and then appearing through the paper windows.</p><br/><p>This would have seemed normal to Wang Yanglin on any other day. But after hearing the remarks just now, he was now somewhat nervous.</p><br/><p>Taking a deep breath, Wang Yanglin stretched his body and reassured himself, \"How could there be things such as ghosts in this world? Furthermore, my fellow brother disciples are all around. If any ghosts were to appear, they’d be knocked back to the afterlife in no time!\"</p><br/><p>In order to calm his mind, Wang Yanglin sat back on his bed and went back to his cultivation state.</p><br/><p>It was dead silent outside.</p><br/><p>Suddenly, Wang Yanglin’s eyes darted wide open. He had sensed the presence of something outside. But the opening of his eyes brought him an intense terror, as the shadow of a human figure was standing right outside his paper window shone through the moonlight.</p><br/><p>\"Who…\" Wang Yanglin asked in a deep and cautious voice. The figure did not reply. It just stood there, silent and still. Wang Yanglin’s breathing grew heavier, as his heart thumped harder with his tightening chest.</p><br/><p>Gritting his teeth, he darted towards the door and pushed it wide open. He was determined to see who was trying to make a fool of him. But nobody was there. The shadow on his paper window had disappeared as well.</p><br/><p>Wang Yanglin gulped down his saliva as he stepped back into his house to take a look. But once again, the shadow could be seen clearly from within the house. In fact, it now seemed like it was moving with a twisted neck</p><br/><p> \"WHO!\" This time round, Wang Yanglin was shouting.</p><br/><p>\"What’s wrong, Senior Brother?\" A disciple called out, hearing the commotion.</p><br/><p>\"Nothing much.\" Wang Yanglin gradually calmed down. He asked around, \"Junior Brother, is there anything strange going on around your area?\"</p><br/><p>\"Nopes, not really?’ The disciple shook his head, puzzled. He came over in front of Wang Yanglin to check things out.</p><br/><p>\"Could you be too stressed out, Senior Brother?\"</p><br/><p>\"No…\" Wang Yanglin heaved a sigh of relief. Could it be that he was really too stressed out? But at that very moment, Wang Yanglin froze.</p><br/><p>Behind his Junior Brother…was a ghostly figure. Clad entirely in white, its face was covered entirely with its hair. Wang Yanglin stumbled backward a few steps. When he blinked again, the figure was gone.</p><br/><p>\"Senior Brother, what’s wrong…?\"</p><br/><p>Wang Yanglin’s breathing intensified, \"No…no, nothing. I must have seen wrongly. I must be way too tense.\"</p><br/><p>\"Oh, right. Relax, Senior Brother. Have a good rest!\"</p><br/><p>\"Yes.\"</p><br/><p>...</p><br/><p>Back in the house, Wang Yanglin poured himself a cup of tea from the teapot to calm his nerves. Looking down, he noticed that what he was pouring was no longer tea… but blood.</p><br/><p>He dropped the teapot in shock as it shattered into pieces.</p><br/><p>Something else was happening.</p><br/><p>On his bed, words were being scrawled in blood red: ‘What a tragic death I had…’</p><br/><p>Wang Yanglin couldn’t stop retreating as he stared at everything in utmost shock. Looking at those bloodied words, Wang Yanglin was trembling from head to toe.</p><br/><p>Lin Fan, who was in invisibility state, looked at Wang Yanglin’s stunned face and chuckled silently. Seemed like this guy was scared just about enough. It was time to move on to the next victim.</p><br/><p>With this scare, Wang Yanglin remained awake the entire night, keeping himself at high alert. This night was equally sleepless for some of the other Jiuxiao Sect disciples as well.</p><br/><p>Next day…</p><br/><p>The sparring was about to begin.</p><br/><p>The sparring was to be held at Zhongtian Peak, where Glory Sect’s biggest stage was housed.</p><br/><p>The arrangements around the stage were specially decorated by Zhongtian Peak’s own Senior Elder, Lu Mingyang. Things were set such that disciples could enjoy the sparring thoroughly without any fear of safety issues.</p><br/><p>Zhongtian Peak was extremely crowded, as disciples of Glory Sect swarmed and gathered to observe this once in three years spar. Not only were they full of hopes for Glory Sect to do well, but they were also ready to be amazed by their Senior Brothers’ spectacular performances.</p><br/><p>Just then, Lin Fan was deep in discussion with Senior Elder Wuya. He had had no intentions of joining the sparring, but was forced up the stage by Senior Elder Wuya.</p><br/><p>\"Ah, Lin Fan. I’ve already told them yesterday that you’re a genius of the sect. Please bear with it and head up for a spar.\"</p><br/><p>\"Doesn’t that just show how little confidence you have for our sect’s geniuses, Elder Wuya?\"</p><br/><p>The thought came across Lin Fan’s head. Senior Elder Wuya probably had no other candidates. Hence, he had no choice but to look for Lin Fan. After all, it was Lin Fan’s own fault for being such a dazzling character.</p><br/><p>Wuya looked at Lin Fan, those eyes of his seemed to be saying, ‘You know way too much.’</p><br/><p>\"Arrival of the Jiuxiao Sect members!\" An announcement was made.</p><br/><p>Elder Liang Yichu appeared with his disciples following tightly behind him. But what startled the Glory Sect disciples was the fact that those disciples seemed somewhat worse for wear. They looked haggard beyond words, as though they did not have rest for the past couple of days.</p><br/><p>\"Look at those Jiuxiao Sect disciples! What happened to them? They look really tired out!\"</p><br/><p>\"No idea, but they look as though they could collapse at any moment!\"</p><br/><p>...</p><br/><p>Wang Yanglin was within the crowd, but he looked totally listless. After what happened last night, he had not a wink of sleep as he was filled with tension.</p><br/><p>He did not even dare to close his eyes, as though something fearful would happen once he did so.</p><br/><p>Looking at Wang Yanglin, Lin Fan felt helpless as well. After all, how could a man with such a high cultivation base be so timid?</p><br/><p>Ghosts? Goodness, if anyone heard of it, they’d be laughing their asses off.</p><br/><p>Lin Fan headed over to the inner sect disciples’ area. Zong Hentian sat there, eyes closed in concentration.</p><br/><p>\"How’s it going?\" Lin Fan patted him on the shoulders.</p><br/><p>\"Still alright, Junior Master.\" Zong Hentian was somewhat nervous as well. Especially looking at Xinfeng with his pompous aura, Zong Hentian’s eyelids twitched a little.</p><br/><p>\"Good luck, Junior Master Lin!\" Someone shouted from behind Zong Hentian. It was Ye Shaotian.</p><br/><p>\"Yes.\" Lin Fan nodded his head.</p><br/><p>\"Junior Master, we’ll all be rooting for you over here! The disciples they’ve sent over feel much stronger than three years ago. Do take care!\" Even though Ye Shaotian and gang were outer sect disciples, their cultivation potential and wisdom were not far off from inner sect disciples. It was just that they had yet to reach the required cultivation base.</p><br/><p>But it was only a matter of time before they did.</p><br/><p>Perhaps, some of them might even be able to take part in the sparring three years later.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Guys, I hope you guys aren’t confused by the paper windows. You can try googling for ‘Shoji’. It is a form of architecture in Japan, but the concept is the same as the Chinese used to use such windows in the past as well.</p><br/><p>Cheers!</p><br/>\n</div>"}