{"title": "Chapter 173: Did We Think Too Much?", "id": 173, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-173-did-we-think-too-much", "volume_title": "Volume 2", "body": "<h1>Chapter 173: Did We Think Too Much?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 173: Did We Think Too Much?</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Xinfeng’s haughty face had yet to recover from the shock of what just happened.</p><br/><p>His sword was gone…just like that?</p><br/><p>That was the sword he had painstakingly infused all his Sword Aura into. How…how could this be possible?</p><br/><p>While Xinfeng was burning inside, he knew he had to endure. He could not show it. If he did, where would Jiuxiao Sect’s face go? His heart was undergoing a turbulence. But he had to endure. He had to!</p><br/><p>He. Must. Not. Let. It. Out. NO!</p><br/><p>No matter how painful it was, he had to swallow it in. He had to let the other party know that he could do with or without this sword.</p><br/><p>Xinfeng smiled, withstanding the terrible pain within his heart.</p><br/><p>The disappearance of Xinfeng’s Sword Will aura woke all the Glory Sect disciples up. But looking at the sight before them, they fell into yet another trance.</p><br/><p>Everyone then started discussing excitedly.</p><br/><p>\"Junior Master Lin is simply too strong!\"</p><br/><p>\"Just looking at that sword was enough to feel it’s immense power! To think that Junior Master Lin could shatter it with just a touch! What a man!\"</p><br/><p>\"So, this is what Jiuxiao Sect’s disciples are capable of! Even their toys are broken by Junior Master Lin! What a feeling!\"</p><br/><p>\"When he took out that scary looking sword, I thought we were pretty much done for! But when Junior Master Lin slapped it down just like that, I knew I was thinking too much hahaha!:</p><br/><p>\"Look at those pale faces of the Jiuxiao Sect disciples!\"</p><br/><p>...</p><br/><p>\"Do you dare to receive a brick from me?\" This was Lin Fan’s 3rd time repeating it.</p><br/><p>Under the bright sun, the red brick shone ever more brightly scarlet.</p><br/><p>The skies changed, and the winds stopped blowing.</p><br/><p>Time stood still as Lin Fan stood there, gazing at Xinfeng fixedly.</p><br/><p>This little kid trying to put on such a farce? Lin Fan could not take it at all.</p><br/><p>One could be scared.</p><br/><p>One could cower in fright and run.</p><br/><p>All these were things that Lin Fan could endure and dismiss with a flick of his robes.</p><br/><p>But to act strong in front of Yours Truly?</p><br/><p>No chance, my friend. No chance.</p><br/><p>How could anyone not know that in Lin Fan’s entire life, there was only one kind of person he hated the most: people who acted strong.</p><br/><p>Xinfeng looked at Lin Fan with his heart thumping furiously, somewhat suffocating within. He hated this feeling. The man before him was a genius of Glory Sect. How could he lose to someone like Lin Fan!</p><br/><p>He looked at the brick in Lin Fan’s hands. It was just a normal looking brick without any trace of True Energy.</p><br/><p>It was neither a Light weapon, nor was it a Legendary weapon.</p><br/><p>Unless…</p><br/><p>A thought flashed through Xinfeng’s head. This man before him did not intend to do anything to him. All he wanted to do was to provide a pedestal for Jiuxiao Sect to step down from by using a normal brick.</p><br/><p>What was to happen if he were to slap himself with the brick? One need not think much to know that it would naturally shatter just the same way his sword had shattered when Lin Fan swung it on his chest.</p><br/><p>And just like that, everything would end peacefully, both sides even as everyone would go back happily to prepare for the sparring.</p><br/><p>\"Haha!\" Xinfeng laughed as he finally understood it all. Seemed like this man was pretty gracious to provide them with a pedestal to save face after all.</p><br/><p>To retain Jiuxiao Sect’s face, what was a slap with a brick?</p><br/><p>Wuya and Liang Yichu glanced at each other. They too had the same conclusion that Xinfeng had.</p><br/><p>Even though Wuya and Liang Yichu liked to bicker with one another, their ties with each other were still sturdy and dated back for a long time after all. Now that things had come to this, while both sides had their fair share of snide remarks made, it’d be best for things to end on a good note.</p><br/><p>Wuya looked at Lin Fan and couldn’t help but nod his head in approval as well. What an interesting fellow! Not only that, he knew how to sustain the ties of friendship.</p><br/><p>A man who knew how to cherish relationships, these were the type of characters that Wuya liked within his disciples, even if this man was not directly under Glory Sect, but the sixth Grand Master of the Saint Devil Sect.</p><br/><p>But nevertheless, the Saint Devil Sect was a part of Glory Sect. If this guy were trained well and could eventually take over the post of Grand Master one day, that’d be a good thing as well.</p><br/><p>Wuya did not say anything. He was waiting for the brick show to be over. But he told himself that he must take good care of this man from henceforth. Perhaps he should even recommend him up to the Grand Master.</p><br/><p>While a talented disciple was essential to a sect…to have a disciple who was both skilled and wise, that was even rarer to find.</p><br/><p>Not only must a Grand Master possess immense strength, but he must also possess a gracious and generous heart.</p><br/><p>\"Brother Yichu, since my disciple has received the sword. Let’s both make do and let this be done with.\" Wuya said.</p><br/><p>Liang Yichu looked at Wuya’s expression and smiled warmly as well as he put up a big thumbs up, indicating that it was Glory Sect’s fortune to be able to own such a wise and capable disciple.</p><br/><p>\"Disciple, receive his brick then.\" Liang Yichu laughed.</p><br/><p>\"Yes.\" Xinfeng did not hesitate nor fear at all. After all, what was it to receive a brick? It was just like any other brick anyways.</p><br/><p>At this point, Xinfeng also had a feeling of appreciation towards Lin Fan as a man. Not only were their personalities alike, but their thoughts and actions under tough circumstances were also similar as well. Once this was over, Xinfeng would not mind having this man as the first friend in his life.</p><br/><p>Xinfeng surveyed Lin Fan. Those haughty eyes of his etched Lin Fan’s face deep into his heart.</p><br/><p>‘Buddy, I’m befriending you for life.’</p><br/><p>\"Come on.\" Xinfeng raised his head high. Trembling slightly, he pushed forward, as though to give Lin Fan an easier time.</p><br/><p>Lin Fan chuckled coldly in his heart. Looking at the Nine Five brick in his hand, he was heartened that it finally had its place in the battlefield once more.</p><br/><p>\"Good. Do not fear, it will not cause you any harm.\" Lin Fan said.</p><br/><p>Xinfeng lowered his head as he broke into a grin. Of course, there wouldn’t be any harm. He was a genius of Jiuxiao Sect. How could he be harmed by just a mere brick?</p><br/><p>‘Don’t worry, buddy. Your thoughtful actions, I’ve already seen through it. Thanks, bro.’</p><br/><p>Lin Fan’s hands quivered slightly, as though he barely had any strength.</p><br/><p>The surrounding disciples who were watching were puzzled as well. Just what was happening?</p><br/><p>But the next second, everyone understood instantaneously.</p><br/><p>Bam.</p><br/><p>A light touch.</p><br/><p>Lin Fan turned around. Without even looking back, he kept the brick within his storage.</p><br/><p>\"What a disappointment. Not even worthy of a single blow…\" Lin Fan raised his head up into the air and sighed.</p><br/><p>He placed a finger on Xinfeng’s forehead.</p><br/><p>PLOP.</p><br/><p>Something unbelievable happened. Xinfeng’s body just collapsed onto the ground instantaneously.</p><br/><p>The air was silent. No one could understand what was happening.</p><br/><p>Lin Fan looked at Senior Elder Wuya and nodded.</p><br/><p>Walking off into the distance, a voice came from his direction after a moment, \"And that’s all that Jiuxiao Sect disciples are capable of…\"</p><br/><p>Even though he had long disappeared, the voice lingered on, booming through both sects’ disciples like thunder.</p><br/><p>Wuya looked at Lin Fan’s disappearing back view, then at Xinfeng, who had collapsed lifelessly on the ground.</p><br/><p>He was entirely stupefied.</p><br/><p>‘Did we…think too much?’</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Anyone here understood the 'No chance, my friend. No chance' reference? HAHA.</p><br/>\n</div>"}