{"title": "Chapter 177: A Finger To Break All Skills", "id": 177, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-177-a-finger-to-break-all-skills", "volume_title": "Volume 2", "body": "<h1>Chapter 177: A Finger To Break All Skills</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 177: A Finger To Break All Skills</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Zhongtian Peak’s Podium…</p><br/><p>Grand Master Yan was seated high up on the podium. He asked softly, \"Brother Wuya, does Glory Sect have any hopes this time around?\"</p><br/><p>\"Don’t worry Senior Brother, I had them stay at Nameless Peak last night.\" Senior Elder Wuya let out a smile on his face.</p><br/><p>\"Yes…\" Listening to the news, Grand Master Yan nodded his head in satisfaction as well. \"Let Yours Truly welcome them personally to showcase our respect for Jiuxiao Sect.\"</p><br/><p>...</p><br/><p>Wuya followed closely behind his Senior Brother. The sparring this time around was something Glory Sect must definitely win. Even though this batch of Glory Sect’s disciple’s strength was lackluster compared to the previous batch, strength was not all that was required for a victory. To win, one required strategy as well.</p><br/><p>Planting these guys at Nameless Peak last night, with a guy like Lin Fan around, would they be let off the hook so easily? Hehe.</p><br/><p>\"Brother Yichu, how was your rest last night?\" Since the Grand Master had come personally, Liang Yichu had to reply with utmost courtesy.</p><br/><p>\"Thank you for your concerns, Grand Master Yan. Everything was fine last night.’ He said it from his mouth, but his heart was filled with doubts looking at some of his disciples’ shagged out looks. He could not help but wonder what happened last night.</p><br/><p>But it was all fine. As long as his personal disciple could obtain the first position in the sparring, nothing else would matter.</p><br/><p>...</p><br/><p>Lin Fan waited patiently among the inner sect disciples for the beginning of the sparring. Even though this was just an agreement between the ancestors in the past, it was now as good as a battle of sorts between the two sects.</p><br/><p>DONG!</p><br/><p>The gong rang loudly. Wuya stood high up on the podium and shouted, \"The thousandth Genius Sparring will begin officially! Rules of the sparring: ten disciples from Glory Sect, ten from Jiuxiao Sect, they will draw their opponents through lots! But remember, the sparring is secondary only to friendship! Our relationship is the most important! No one must take the life of another! The ultimate victor will be the recognized strongest genius of the two sects! Begin drawing lots!\"</p><br/><p>\"Junior Master, let’s go draw a lot.\" Zong Hentian rose while saying.</p><br/><p>\"Yes.\"</p><br/><p>In the middle of the sparring ring were two sealed boxes, towards which each sect’s disciples headed forth. The moment Lin Fan stepped into the ring, he waved to his Glory Sect disciples.</p><br/><p>\"VICTORY BE TO JUNIOR MASTER!\"</p><br/><p>\"VICTORY BE TO JUNIOR MASTER!\"</p><br/><p>Zhang Ergou was leading the cheers, waving a huge flag and shouting. Based on his master’s instructions, he had created an extremely large flag. Since Glory Sect was the home ground, he was determined to give a good showing to have the other party get nervous.</p><br/><p>With Zhang Ergou taking charge along with all the other disciples who revered Lin Fan, they cheered in unison. Zhongtian Peak’s skies were filled with shouts of cheers for Lin Fan.</p><br/><p>To these outer sect disciples, Lin Fan was their most idolized man in the sect. Therefore, they naturally hoped that their own sect would take victory in the genius sparring as well.</p><br/><p>Grand Master Yan, who was on the podium, smiled at the scene. He was heartened by what was happening.</p><br/><p>\"Brother Yichu, what do you think of our disciples? Arent they energetic?\" Wuya laughed and asked. Liang Yichu took a glance at Wuya and did not say much. \"Alright, I suppose.\"</p><br/><p>Liang Yichu could not disagree outright. But he did take notice to remember this scene. When the sparring was to be held at Jiuxiao Sect next, he’d be sure to show these guys the energy of Jiuxiao Sect as well.</p><br/><p>The disciples who were drawing lots on the ring felt a little shaken by the cheers as well.</p><br/><p>Grand. They were filled with vigor indeed, these guys. From the depths of their hearts, they actually started feeling a little nervous.</p><br/><p>After drawing lots, the disciples lined up as Elder Putong took charge of the administrative matters.</p><br/><p>\"Junior Master, what’s your lot?\" Zong Hentian asked while looking at his own lot.</p><br/><p>\"Number ten.\"</p><br/><p>\"I wonder which lot that Xinfeng of Jiuxiao Sect has drawn.\" Zong Hentian said, somewhat nervous. Lin Fan snuck a peek at Elder Putong’s records. Xinfeng had drawn lot one, which was far from himself.</p><br/><p>\"Let the sparring begin!\"</p><br/><p>\"Jiuxiao Sect Lot one, Xinfeng versus Glory Sect Lot one, Chou Tianran!\"</p><br/><p>Glory Sect’s side…</p><br/><p>\"Good luck, Junior Brother.\" Zong Hentian patted on Chou Tianran’s shoulders.</p><br/><p>\"Yes.\" Chou Tianran took a deep breath before he leaped up the sparring ring.</p><br/><p>It was much quieter at Jiuxiao Sect’s side as Xinfeng leaped up the ring expressionless. Xinfeng’s only enemy was Lin Fan. He did not regard anyone else in his eyes.</p><br/><p>Disciples below were cheering for their respective Senior Brothers.</p><br/><p>\"I don’t want to hurt you. Admit your defeat.\" Xinfeng said coldly.</p><br/><p>\"Senior Brother Xinfeng, I humbly acknowledge that I am not your match. But to go down without a fight is not something I can accept.\"</p><br/><p>Xinfeng snorted coldly. He did not have anything else to say.</p><br/><p>\"BEGIN…!\"</p><br/><p>The first match started at the call of Elder Putong.</p><br/><p>\"No offense, Senior Brother.\" Chou Tianran’s aura exploded immediately as he pulled a long halberd out of thin air. Disciples who were watching were momentarily stunned at this shocking scene.</p><br/><p>\"Indeed, this child Tianran has potential.\" Senior Elder Wuya nodded in acknowledgment on watching the scene.</p><br/><p>\"But it’s not enough.\" Elder Liang Yichu laughed. Even though this disciple was somewhat decent, he was definitely nothing compared to his own Xinfeng.</p><br/><p>\"Hmph.\" Wuya snorted coldly. What a cocky fellow.</p><br/><p>\"Nine Dragon’s Doom!\"</p><br/><p>Just then, Chou Tianran shouted as his body glowed with a golden light, 9 dragons emerging from him into the air, wrapping around the halberd. Tearing apart the air between them, he dashed towards Xinfeng with the halberd pointing towards the latter.</p><br/><p>Xinfeng was standing with both hands behind his back, and was not in the least bit unnerved. He lifted his hand gently and raised a single finger.</p><br/><p>\"Break.\"</p><br/><p>Just then, time seemed to come to a still.</p><br/><p>When Chou Tianran’s halberd touched Xinfeng’s finger, it stopped instantly. As though it was struck by an aura it could not withstand, the halberd shattered.</p><br/><p>The 9 dragons coiled around the halberd wailed tragically as they vanished into thin air like smoke.</p><br/><p>A black flash appeared.</p><br/><p>The only feeling Chou Tianran felt was as though he was about to be suffocated within his heart. The next thing he knew, Xinfeng was in front of him with a finger on Chou Tianran’s forehead.</p><br/><p>Chou Tianran shuddered, as an aura of death wrapped itself around his heart.</p><br/><p>\"You’ve lost.\" Xinfeng said as he retracted his finger and turned around. Chou Tianran stood there silently, eventually bowing his head, \"Thank you for your mercy, Senior Brother.\"</p><br/><p>The audience disciples stood around dumbstruck. They had not expected the first match to end just like that.</p><br/><p>It was indeed instantaneous. There was no reaction at all.</p><br/><p>On the other hand, cheers erupted from Jiuxiao Sect’s side. Those cheers were like heavy hammers, smashing down on Glory Sect disciple’s heavy hearts.</p><br/><p>\"How was it, Brother Wuya? A finger which can break all skills… the highest state of sword mastery.\" Liang Yichu smiled.</p><br/><p>\"Hmph.\" Wuya turned his head around, refusing to reply the other party. He even rolled his eyes backward.</p><br/><p>\"First Match. Victory to Jiuxiao Sect’s Xinfeng!\"</p><br/><p>\"Second Match. Jiuxiao Sect Lot two Feng Xiaoling versus Glory Sect Lot two Zong Hentian!’</p><br/>\n</div>"}