{"title": "Chapter 178: This Piece Of Sky Belongs To Me", "id": 178, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-178-this-piece-of-sky-belongs-to-me", "volume_title": "Volume 2", "body": "<h1>Chapter 178: This Piece Of Sky Belongs To Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178: This Piece Of Sky Belongs To Me</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"It’s him…\" Zong Hentian’s expression changed, as he looked at the man who stood up.</p><br/><p>\"Who is he?\" Lin Fan asked.</p><br/><p>\"He is one of Jiuxiao Sect’s disciples who is very strong. I saw him once in the forbidden grounds expedition. And he was strong… Very strong.\" Zong Hentian’s mind had some misgivings about this now.</p><br/><p>He had not noticed it at the start. But upon hearing the name, he started having some recollections.</p><br/><p>The loss of the first match had already been a morale suppressor for Glory Sect. Zong Hentian had thought that he would have a firm victory in the second match to stabilize the crowd. But by the looks of it, things weren’t going to be so easy after all.</p><br/><p>\"Fellow brothers, I was unable to win.\" Chou Tianran walked over with his head bowed down, somewhat downcast. Evidently, he was both blaming himself for the loss and feeling helpless for drawing out Xinfeng’s lot in the first match.</p><br/><p>\"Don’t be too hard on yourself, Junior Brother. Junior Master is probably the only one who can match up with Xinfeng. To even bear courage to face him without cowering, that’s the biggest victory you could have given us.\" Zong Hentian consoled him.</p><br/><p>\"Yes.\" Chou Tianran nodded as he looked at Zong Hentian. \"You’re up next, Senior Brother. Good luck.’</p><br/><p>Zong Hentian nodded his head. Towards this, he did not have the utmost confidence.</p><br/><p>Lin Fan took a look at Feng Xiaoling of Jiuxiao Sect. Given Zong Hentian’s current strength, the chances of him taking this was going to be quite a challenge. The chance was slim.</p><br/><p>Even though he was not as strong as Xinfeng, Lin Fan could tell that Feng Xiaoling was nothing to be scoffed at.</p><br/><p>F*ck man.</p><br/><p>The more Lin Fan looked, the more pissed he was. How come Jiuxiao Sect’s disciples all made their Glory Sect’s disciples look like p*ssies?</p><br/><p>But thinking back of Mie Qiongqi, Lin Fan understood as well.</p><br/><p>If Mie Qiongqi had not committed the mistake, he would be undefeatable in the genius sparring today as well.</p><br/><p>Even Xinfeng would not be a match for Mie Qiongqi. But now that Lin Fan had Mie Qiongqi trained under him, and thus unable to take part in the sparring, there was naturally no one left to deal with Xinfeng.</p><br/><p>\"Brother Wuya, even though Feng Xiaoling is nothing compared to my disciple, he is can still be considered number one or two among the geniuses. I’m afraid that your disciples aren’t going to stand a chance against him.\" Liang Yichu smiled.</p><br/><p>Wuya took a look at Grand Master Yan. Grand Master Yan’s expression was warm and calm, totally unfazed by the loss of Glory Sect. Wuya sighed helplessly, \"Victory is yet to be determined, Brother Yichu. Don’t count your eggs too early.\"</p><br/><p>\"Nah, that’s impossible.\" Liang Yichu waved his hands. Based on their cultivation bases, one could determine whose victory it was going to be easy.</p><br/><p>...</p><br/><p>\"Hentian. On a scale of one to ten, how confident are you of winning.\" Lin Fan asked.</p><br/><p>\"Three.\" Zong Hentian hesitated slightly before giving his highest possibility.</p><br/><p>Zong Hentian was not someone who was humble. Therefore, if he were certain of this victory, he would be extremely confident. This just showed that he was clearly aware of the opponent’s strength this time around.</p><br/><p>From the forbidden grounds expedition, even though Zong Hentian had not exchanged blows with him directly, he was able to make out just how strong this man was by looking at him.</p><br/><p>\"Yours Truly can grant you a firm victory, but you have to undergo some pains.\" With this matchup, Lin Fan too was uncomfortable with losing two in a row. No matter what, he had to make it a tie at least.</p><br/><p>\"As long as I can win, I’m willing to endure anything, Junior Master.\" Zong Hentian looked at Lin Fan earnestly. As long as he could take this back for Glory Sect, he would do anything.</p><br/><p>Looking at Zong Hentian’s determined face, Lin Fan nodded. He then waved around, \"Come guys, huddle around me.\"</p><br/><p>Even though the other geniuses did not know what Lin Fan was up to, they still huddled closely with his orders. Surrounding Lin Fan and Zong Hentian, no one could see what they were up to.</p><br/><p>Ripping off his sleeve, Lin Fan handed it to Zong Hentian, \"Here, bite onto this. Do not scream out loud.\"</p><br/><p>Lin Fan was ready for a massacre as he prepared to decimate his own teammates.</p><br/><p>‘Ball Kicking’ had 2 effects. 1: One would instantly lose all will to fight. 2: One would be driven into a frenzy and explode with pure power.</p><br/><p>Even though both effects differed from one another, the pain one would feel was the same.</p><br/><p>Looking at Junior Master Lin’s solemn expression, Zong Hentian took a deep breath and bit onto the sleeve. He nodded his head repeatedly, indicating to Junior Master Lin that he was ready.</p><br/><p>\"Open your legs.\" Lin Fan ordered.</p><br/><p>Without hesitation, Zong Hentian spread open his legs.</p><br/><p>Lin Fan’s expression changed as he stared at Zong Hentian’s crotch area.</p><br/><p>His mind began turning away, calculating the velocity, angle, and strength he would use.</p><br/><p>Zong Hentian’s forehead started beading with sweat. This sweat was not from any pain, but rather, nervousness. Just what was Junior Master Lin about to do?</p><br/><p>What sort of method would grant him a guaranteed victory?</p><br/><p>But looking at Junior Master Lin’s solemn expression, he knew that the method would be nothing simple.</p><br/><p>\"Alright, bear with it.\" At that moment, Lin Fan’s eyes sparkled as his legs flew towards Zong Hentian’s crotch, carrying an aura of impotence.</p><br/><p>BAM!</p><br/><p>A dull thud rang out and Zong Hentian’s body shuddered, as though he was suffering from fits.</p><br/><p>Zong Hentian’s initial flushed look turned a brilliant tomato red, as the veins on his neck began pulsating. Blood veins filled his pupils as his breathing intensified.</p><br/><p>Zong Hentian took out the sleeve from his mouth as he struggled to stand still, his body twisted in different directions. His mouth was agape, as though he had many things to say but could not produce any sound.</p><br/><p>\"Alright, bear with it. Withstand this pain, and redirect it to your opponent!\" Lin Fan knew that Zong Hentian must be in terrible pain. But for the sake of victory, he had to endure it.</p><br/><p>\"Will both parties enter the ring?\" Elder Putong shouted.</p><br/><p>Feng Xiaoling smiled as he leaped onto the ring gracefully. His long hair blew with the wind as he looked elegantly handsome. Stretching out his fingers, he spread open a fan in his palms.</p><br/><p>This atmosphere, this stance. Countless of men would be ashamed of being near such a handsome man.</p><br/><p>Even though the female disciples of Glory Sect were supposed to be rooting on for Glory Sect disciples, they too were momentarily stunned by his suaveness.</p><br/><p>\"What a handsome youth.\" Lu Mingyang sat on the podium and couldn’t help but comment.</p><br/><p>Liang Yichu laughed upon hearing this comment, \"He is number one in Jiuxiao Sect for gracefulness, and is the ideal companion in the hearts of many female disciples. A combination of beauty and strength, he is indeed an ideal disciple.\"</p><br/><p>Looking at Liang Yichu’s smugness, Wuya glared at Lu Mingyang. Wasn’t this boosting the ego of others at the sake of oneself? Lu Mingyang looked at Senior Brother Wuya’s expression and chuckled helplessly as well.</p><br/><p>And just then, Zong Hentian appeared on the ring.</p><br/><p>But something shocking happened.</p><br/><p>Zong Hentian’s legs were spread open, as though there was something wrong with him as he walked a step at a time. Even Wuya frowned at that somewhat comical walking style of Zong Hentian.</p><br/><p>Disgraceful. This was a disgrace to the sect!</p><br/><p>\"Brother Wuya, what an appearance by your genius! Indeed, this is a rare sight indeed.\" Liang Yichu laughed out loudly.</p><br/><p>\"HAHA…! Is that guy sick or what!\" Jiuxiao Sect’s disciples burst out laughing as well, pointing at Zong Hentian.</p><br/><p>\"Indeed, talented people do come out of Glory Sect! HAHA!\"</p><br/><p>...</p><br/><p>Zong Hentian could only relieve himself slightly of the pain by spreading his legs wide open.</p><br/><p>As to Junior Master Lin’s method, Zong Hentian still could not feel the difference at this point. The only thing he could feel right now was tremendous pain.</p><br/><p>But he believed that Junior Master Lin would not deceive him.</p><br/><p>Junior Master Lin had told him:</p><br/><p>The moment he could stand upright with both legs…this piece of sky would belong to him, Zong Hentian.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHAHAHAHA THIS IS HILARIOUS HAHAHAHAHA</p><br/>\n</div>"}