{"title": "Chapter 187: What's There To Feel?", "id": 187, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-187-whats-there-to-feel", "volume_title": "Volume 2", "body": "<h1>Chapter 187: What's There To Feel?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 187: What's There To Feel?</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>And just like that, a month had passed. The plan to change Zhang Ergou was still proceeding smoothly. Nameless Peak was as usual, without any changes.</p><br/><p>On the Nameless Peak, the man with the highest fighting strength was Mie Qiongqi. As the Grand Master of Nameless Peak and Saint Devil Sect, Lin Fan began to worry. Right now, he was only at postcelestial full cultivation. Even though he had met with sticky situations and got out of them just fine, there was one thing he could never forget.</p><br/><p>The blood feud he had with Cangling Continent on the other side.</p><br/><p>\"Master! I can make Whitey follow my orders now!\" Cai Zhiqiao hopped over happily. Following tightly behind her was the Snow Lion with its snow-white fur. It was around the size of a little puppy now.</p><br/><p>Looking at the Snow Lion cub, Lin Fan could not help but wonder. That adult Snow Lion which he had killed…what sort of beast did she bang with? This Snow Lion cub gave off an unusual feeling, and from the looks of it, it was not entirely a Snow Lion breed.</p><br/><p>At first, Lin Fan did not pay much attention to it. But one fine day, he found a small white pair of wings on the Snow Lion cub’s back. This was the first time a Snow Lion had ever grown wings.</p><br/><p>\"Not bad.\" Lin Fan fondled his young disciple’s head. Even though her innate potential was a little low, it was fine. After all, he had been dutifully cultivating and grooming her innate potential every 2-3 days. Even though his side profession was strong, to be able to change one’s innate potential was basically going against Heaven’s will. The higher one’s potential was, the less significant the boosting effect would be. But Lin Fan was in no hurry. After all, as long as he kept at it, he was sure that he’d be able to produce a peerless genius in the years to come.</p><br/><p>Cai Zhiqiao pointed at Whitey and had it perform different poses in front of them.</p><br/><p>This Snow Lion cub stared at Lin Fan with its big, bright eyes as well. It rolled, stood up, and then squatted. Even Lin Fan was amused to laughter with its antics. To think that it might not remain the same way after it grew up one day.</p><br/><p>Glory Sect tenth Peak…</p><br/><p>\"Grand Master, I would like to head out for training.\" Lin Fan had pondered over it for a long time. To grow stronger, the only way was to head out into the vast world.</p><br/><p>Grand Master Yan looked at Lin Fan. Truth be told, he did not want to let Lin Fan out because of his selfishness. After all, ‘Pills Through Thought’ was extremely important to a sect. But at the same time, he knew that Lin Fan had told him his intentions out of respect for him, the Grand Master. After all, from the moment he had accorded Nameless Peak to Lin Fan, Lin Fan was a free man. He could head out to anywhere in the world without anyone’s permission.</p><br/><p>\"Come with me.\" Grand Master Yan did not say much as he headed towards the Grand Hall.</p><br/><p>Lin Fan did not know where the Grand Master was taking him to. After all, the tenth Peak was not a place where disciples were usually allowed. Usually, the Grand Master would reside here alone.</p><br/><p>Following the Grand Master, Lin Fan surveyed his surroundings. As they passed through the Grand Hall, a gigantic Stone Gate stood before Lin Fan.</p><br/><p>The gate looked old, sturdy and possessed an imposing aura. One wondered what sort of material was used to etch the human figure on the gate itself.</p><br/><p>The human figure stood naked, righteous and upright. Holding on to a gigantic ax, it stared straight ahead. Looking at its eyes, Lin Fan could feel a repressive will directed towards his heart, causing him to shiver internally.</p><br/><p>Grand Master Yan stepped up. The moment he placed his hands on the gate, it started vibrating like ripples on water, unveiling a cave within.</p><br/><p>‘Follow me.\" As Grand Master Yan entered, Lin Fan did not give it a second thought and followed suit. While Lin Fan did not know what was going on, he knew that this was definitely extraordinary. Since the Grand Master did not leave the tenth Peak usually, could it be because he was guarding this place?</p><br/><p>By the looks of it, didn’t it look like the Grand Master was about to hand Lin Fan something precious?</p><br/><p>The moment Lin Fan entered the cave, he seemed to have entered an endless darkness. But this feeling disappeared as quickly as it came.</p><br/><p>When Lin Fan opened his eyes and stared forward, he did not know when or how it happened, but the Grand Master was already kneeling before a statue, chanting something in his mouth.</p><br/><p>This statue looked exactly like the figure etched on the stone gate. What was even more shocking was that the eyes of this statue looked totally real!</p><br/><p>After what happened earlier, Lin Fan did not dare to gaze straight into the statue’s eyes. He bowed his head and slowly followed behind the Grand Master.</p><br/><p>\"Grand Master, what is this?’ Lin Fan whispered curiously.</p><br/><p>After the Grand Master finished mumbling, he stood up. \"This is the founder of Glory Sect. In front of our founder ancestor, use your heart to feel.\"</p><br/><p>\"Oh…\" Even though Lin Fan did not know what the Grand Master meant, he knelt down all the same in front of the statue.</p><br/><p>After kneeling down, Lin Fan did not feel anything different. His only thought was that this statue was simply too big. If it were to fall down on top of him, wouldn’t he be dead for sure?</p><br/><p>\"Master, what am I supposed to be feeling?\" Lin Fan tilted his head and asked.</p><br/><p>\"Do not speak. Use your heart to feel the statue. Our founder ancestor will guide and direct you.\" Grand Master Yan’s face was solemn.</p><br/><p>Following Grand Master Yan’s words, Lin Fan tried his best to endure. But it was simply too tough to continue kneeling down on his knees. He thus sat down cross-legged with his eyes closed and one palm on the statue.</p><br/><p>Looking at Lin Fan, Grand Master Yan had a mind to say something about this, but refrained from doing so.</p><br/><p>Glory Sect’s history could date back to the time when the Supreme Being himself had split the Xuanhuang World into two. That was the time when the ancestor founder had founded Glory Sect. Ever since then, every single disciple who was to be chosen as the next Grand Master had to appear before the statue. Using their heart to meditate and feel, they would then inherit the background of the sect.</p><br/><p>The inheritance received by every single generation of Grand Master was different, but they were mostly martial skills.</p><br/><p>And therefore, Grand Master Yan’s intentions of bringing Lin Fan here was for him to receive the inheritance of Glory Sect. Even though the next Grand Master may or may not be Lin Fan, Grand Master Yan had been keeping hidden tabs on Lin Fan all the way.</p><br/><p>\"Man, what’s up with this? After touching it for so long, I can’t feel anything man!\" Lin Fan spat out with his eyes close. Goodness, was the Grand Master going insane? God knew how long this founder ancestor had been dead for. What was there to be feeling about?</p><br/><p>And just at that moment, Grand Master Yan, who had been staring at the statue all the way, had a sudden change in his expression.</p><br/><p>The air around the statue began to vibrate. This was the first time Grand Master Yan had experienced something like this. And this had never been seen before in Glory Sect’s records.</p><br/><p>\"This…!\" Grand Master Yan was worried. Even though he did not know what was happening, he could only observe the situation silently. He did not dare to make any casual moves.</p><br/><p>Lin Fan was cursing and swearing within his heart all this while. But at this moment, he found himself rooted and immobile. In fact, there was an irresistible force sucking onto his consciousness.</p><br/><p>‘F*ck... I’m so f*cking gonna be dead!’</p><br/><p>Lin Fan started panicking. His consciousness was like his soul. If it were to be consumed, then wouldn’t he just be a living zombie from then on?!?</p><br/><p>Lin Fan wanted to scream for help, but no words would come out of his mouth.</p><br/><p>Seemed like he was the only one who could help himself.</p><br/><p>Lin Fan used all his strength to struggle against this force.</p><br/><p>But the force only grew stronger. After a while, Lin Fan lost all consciousness.</p><br/><p>‘F*ck me…’</p><br/>\n</div>"}