{"title": "Chapter 182: Unsurpassable Plan", "id": 182, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-182-unsurpassable-plan", "volume_title": "Volume 2", "body": "<h1>Chapter 182: Unsurpassable Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 182: Unsurpassable Plan</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>‘Are you truly not afraid of death?\"\" Xinfeng asked.</p><br/><p>Xinfeng’s heart began to waver. Looking over, this man did seem like a kindred spirit. He even had an urge to befriend this man. Even though he was entirely outraged by their first encounter, the current situation had Xinfeng hesitating once more.</p><br/><p>Lin Fan wiped any traces of blood from his mouth, \"Come, Brother Feng. Third Sword.’</p><br/><p>\"You…!\" Xinfeng’s heart was experiencing a turbulence at the sight of this.</p><br/><p>Looking at the other party’s determined eyes, Xinfeng felt that he should no longer strike any further. Any more and he would probably regret it himself for the rest of his life.</p><br/><p>On the high podium…</p><br/><p>Wuya was whispering to the Grand Master.</p><br/><p>\"Grand Master, who do I feel that there’s something wrong with this situation?\" Wuya observed the ring and could not help but feel that something was off. Ever since they had taken in Lin Fan into Glory Sect, they had been keeping hidden tabs on this guy.</p><br/><p>And their conclusion was…</p><br/><p>Dog. Dog. DOG!</p><br/><p>He was truly a crafty little dog! Not only was he mysterious all around, he was also shifty and sneaky like a fox.</p><br/><p>To someone who cherished his life beyond anything else, how could he be looking at Xinfeng with such determination as though life was nothing to him?</p><br/><p>\"Battle skills determine everything. Let’s wait for the outcome.\" Grand Master Yan replied without a change in expression.</p><br/><p>Wuya nodded his head without anything to add on.</p><br/><p>Lu Mingyang did not know of the exact situation. But looking at Grand Master Yan and Brother Wuya’s unworried faces, he was also extremely puzzled.</p><br/><p>Lin Fan stepped forth again, \"Come. Third Sword, unless you want me to bear the guilt for my entire life. Glory Sect and Jiuxiao Sect had been helping and looking out for one another for the past 3000 years. If our ties were to suffer in this generation due to our little dispute, then what sort of a grave sin would I, Lin Fan, have committed?’</p><br/><p>Lin Fan gave out a roar. The skies seemed to follow his moods accordingly, as the once clear skies gradually formed gray clouds above them. The faces of all the Jiuxiao Sect disciples changed as well. They were all taken in by Lin Fan’s words.</p><br/><p>That was right, Glory Sect and Jiuxiao Sect had been like family for the past 3000 years!</p><br/><p>Lin Fan’s speech had them feeling guilt from the bottom of their hearts.</p><br/><p>Zong Hentian and Feng Xiaoling gazed at one another from afar. Eventually, both of them nodded in acknowledgment of one another and smiled.</p><br/><p>It was as though any misgivings they had about the other party had disappeared in an instant.</p><br/><p>\"Glory Sect! Lin Fan! I’ve got you guys in my heart from here on forth.\"</p><br/><p>\"Me too. Glory Sect is the comrade in arms of our Jiuxiao Sect! Our family! I must bring back the name of this man back to Jiuxiao Sect, so that all our brothers would know that there’s such a righteous man within Glory Sect!\"</p><br/><p>\"I hope that Senior Brother Xinfeng would not strike him again!\"</p><br/><p>\"No, you don’t understand. Senior Brother Xinfeng must do it. More so than any of us, he cares about this man before him and his honor!\"</p><br/><p>...</p><br/><p>\"Brother Wuya, how about we just call off this generation’s genius sparring?\" Liang Yichu suggested.</p><br/><p>\"Brother Yichu, do you no longer care about the 1st place?\" Wuya smiled gently.</p><br/><p>Liang Yichu shook his head, \"You know it better than I do, Brother Wuya. The sparring was only a means for our ancestors to keep our sects in contact, so that we do not grow distant from one another. Who holds the first place does not matter. Now that Glory Sect has produced such a disciple, I do not wish for any harm to come to him. That would be a loss for both Glory Sect and Jiuxiao Sect.’</p><br/><p>\"Even more so, it would be an impassable mental gulf for my own disciple to pass through.\"</p><br/><p>Wuya looked at the ring and sighed gently, \"Brother Yichu, now that things have come to this, let’s not halt it any longer. If your disciple does not throw the sword, that would be an even bigger mental gulf for him. Just like back then, if I had not whacked you crying, would the both of us be where we are today?’</p><br/><p>Liang Yichu, who was initially heartened, stiffened up at Wuya’s words. He then snorted coldly and ignored Wuya, \"Up to you. Don’t come crying when you collect his body.\"</p><br/><p>...</p><br/><p>\"Come…!\" Lin Fan shouted.</p><br/><p>Xinfeng looked at Lin Fan and shuddered slightly. ‘Alright. No matter what, I, Xinfeng, acknowledge you as a friend from henceforth!’</p><br/><p>\"From this moment on, the third Sword will be named Bosom Sword!\"</p><br/><p>The sword glowed behind Xinfeng as he grasped it with two fingers. Clutching this Bosom Sword which was filled with Sword Will, Xinfeng threw it at Lin Fan.</p><br/><p>Lin Fan stood there, a smile gradually forming on his face.</p><br/><p>The glow of this sword far surpassed the previous two. Even the five blades behind Xinfeng started to tremble at the moment he gathered his Sword Will into this sword and threw it at Lin Fan.</p><br/><p>The remaining five swords culminated into a beam of light and fused within this third Sword as it was flying towards Lin Fan as well. Liang Yichu stood up suddenly with an astounded look, \"That’s a breakthrough!\"</p><br/><p>Every single disciple of Jiuxiao Sect and Glory Sect stood up, with a hint of worry in their eyes.</p><br/><p>Nothing must happen out of this, please!</p><br/><p>Lin Fan, who was ready to receive this blade, had his expression changed slightly. He realized that Xinfeng had undergone some sort of breakthrough.</p><br/><p>And with that, something seemed to have changed with this third Sword, as it contained way more power than before.</p><br/><p>But somehow, Lin Fan felt unusually calm.</p><br/><p>The moment the sword landed on Lin Fan’s chest, there was no tremendous force knocking him back. In fact, the sword slowly dissipated into thin air.</p><br/><p>\"The Bosom Sword does not harm Bosom Buddies.\" Xinfeng’s hands were on Lin Fan’s shoulders as he let out the sincerest smile he had for his entire life.</p><br/><p>Lin Fan smiled as well as he patted on Xinfeng’s shoulders.</p><br/><p>‘Brother Feng.\"</p><br/><p>\"Brother Lin.\"</p><br/><p>The two of them stared at each other for a long time, with emotions in their gazes.</p><br/><p>\"Brother Lin.\"</p><br/><p>\"Brother Feng.\"’</p><br/><p>Both of them burst out laughing as they hugged one another’s shoulders.</p><br/><p>\"Brother Feng, to befriend a friend such as yourself is a lifetime achievement for me, Lin Fan. Even though it is just a match, but for the sake of the future generations, there has to be a winner. Hence, I’ll admit defeat, allowing Brother Feng to be this generation’s number one genius.\" Lin Fan said earnestly.</p><br/><p>\"No, Brother Lin, you do not have to do that. I, Xinfeng, had no friends in this lifetime. You’re the first in my life. It no longer matters who is the first. I’ll back out.\" Xinfeng stopped Lin Fan halfway.</p><br/><p>\"No, I’ll back out…\"</p><br/><p>\"No, I’ll back out, Brother Lin. Do not fight with me for this, or we won't be friends any longer!\"</p><br/><p>\"Brother Feng…\" Before Lin Fan could continue, Xinfeng leaped out of the ring on his own.</p><br/><p>Lin Fan was the last man standing in the ring.</p><br/><p>\"The 1000th Genius Sparring victory goes to Lin Fan!\"</p><br/><p>Elder Putong grasped Lin Fan’s wrist and held it up high.</p><br/><p>This…!</p><br/><p>\"GLORY BE TO GLORY SECT!\"</p><br/><p>\"GLORY BE TO JIUXIAO SECT!\"</p><br/><p>...</p><br/><p>The disciples below chanted in exhilaration. The genius sparring had reached its true peak.</p><br/><p>Lin Fan looked at Xinfeng and the other Jiuxiao Sect disciples.</p><br/><p>Clap…Clap…</p><br/><p>Xinfeng and the other Jiuxiao Sect disciples started clapping and cheering for Lin Fan as well. Lin Fan wiped the edge of his eyes as he looked up the skies.</p><br/><p>Today…was a happy day for Lin Fan.</p><br/><p>Out of all the acts he had put on, this was the most satisfying one.</p><br/><p>Not only had he managed to clinch first place, he even had the other party cheer for him willingly and made a precious friendship. Perhaps he might never be able to surpass this act of bullshit in the future. But even if that were the case, Lin Fan was satisfied.</p><br/><p>For once, Lin Fan truly experienced what it was to kill three birds with one stone.</p><br/><p>On the high podium…</p><br/><p>\"Why do I feel like something is wrong…Brother Wuya?\" Liang Yichu, who was clapping, turned around and asked puzzledly.</p><br/><p>Wuya continued clapping and laughing, \"What’s wrong? All is fine. Glory Sect is number one.\"</p><br/><p>Liang Yichu, ‘…’</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHA WUYA TOO IS PRETTY SHAMELESS HAHAHAHAHA</p><br/>\n</div>"}