{"title": "Chapter 192: Men Left Women Right", "id": 192, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-192-men-left-women-right", "volume_title": "Volume 2", "body": "<h1>Chapter 192: Men Left Women Right</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 192: Men Left Women Right</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Just then, the masses were in a shock. They were looking at that stone hardened cliff, which was vibrating as though something was going to pop out of it. With a sudden boom, a gigantic hole burst open from the stone cliff.</p><br/><p>When a voice rang out from within, everyone was even more shocked.</p><br/><p>\"Bl*ody hell. Instead of walking aboveground, it brought me underground, causing Yours Truly to have a mouthful of sand!\" Lin Fan, who had appeared into the daylight once again, began spitting out his saliva profusely. Patting his head and clothing, he patted out quite a lot of sand.</p><br/><p>Rushing forward by himself, Lin Fan could not take it anymore. Thus, using the Beast Taming Skill and his whip, he subdued another sandy beast from the area.</p><br/><p>This beast was big and long, looking extremely ferocious. With a red head and black back, it had a blue color on its underbelly. This was a shocking sight, as this beast was even bigger than the one Lin Fan had slain earlier on.</p><br/><p>But to Lin Fan, the size of the beast did not matter, as long as he had something to ride on. With his whip which brought love to its victims, the beast was shamefully subdued by Lin Fan.</p><br/><p>As the sand clouds from the opening of the hole started clearing, two claws appeared as the beast slowly crawled its way out.</p><br/><p>Lin Fan grasped one of the two sharp horns of the beast and shouted out, \"Woah woah, calm down. Calm down!\"</p><br/><p>\"That’s the Baizu Sky Dragon!\"</p><br/><p>Just then, someone from the convoy shouted.</p><br/><p>Gong Bingye looked at the ferocious beast before her as a chill shivered down her spine as well.</p><br/><p>The Baizu Sky Dragon was the king of the desert, where countless men had died under it. Especially this one, whose head was red with a black body, it was evident that this was extremely close to being an adult matured beast.</p><br/><p>In case of adult Baizu Sky Dragons, wings would sprout from their backs. By then, they would be unrivaled in the entire desert.</p><br/><p>When the crowd saw someone seated on the Baizu Sky Dragon’s head, they were dumbfounded. This was the first time they had ever seen anyone subdue a Baizu Sky Dragon!</p><br/><p>The fourteen bandits looked at one another. They now understood why their riding beasts ran off hurriedly just now. They had sensed the presence of the Baizu Sky Dragon from far away.</p><br/><p>Sha Dulong did not dare to move an inch. He did not know who this mysterious person was nor why he was here. He knew clearly that just the Baizu Sky Dragon alone was enough to decimate his entire group, let alone the mysterious man who could tame this beast.</p><br/><p>Sha Dulong was not the only one who did not dare to make a move. Gong Bingye as well did not dare to move carelessly.</p><br/><p>The Baizu Sky Dragon curled up on the ground with its upper body straight up, multiple claws retracting in the air. Looking at these human beings, it let out a slightly ferocious look.</p><br/><p>But the moment it thought of Lin Fan who was on its head, it calmed down.</p><br/><p>Looking left and right, Lin Fan caught sight of two different groups of people. Surveying the surroundings, he was puzzled.</p><br/><p>Where the hell had this beast brought him after tunneling through the ground.</p><br/><p>\"Who are you guys!\" Lin Fan stood up and flicked back his long hair. Hands behind his back, he once again exuded the air of a peerless master.</p><br/><p>The masses below looked at Lin Fan. He was so damn young! But they could tell from his demeanor and aura that he carried an air of elegance, strength, and stability of a man who had seen many things in this world.</p><br/><p>\"Senior, I am Gong Bingye, a member of the Gong Family of Mo City.\" Gong Bingye stepped forth and clasped her fists together in a polite greeting. Looking at Gong Bingye exchange greetings with this mysterious man, Sha Dulong started to panic.</p><br/><p>They were bandits with a notorious name. With Gong Bingye’s attractive demeanor and this mysterious man’s youthfulness, wouldn’t things go against them?</p><br/><p>If Gong Bingye insinuated anything flirtingly, wouldn’t the mysterious man just slay all of them to please her beautiful self? Sha Dulong had half a mind to run off, but the Baizu Sky Dragon stared at them fixedly with its glass red eyes, rooting them on the spot.</p><br/><p>\"Senior, these are the fourteen Sand Bandits of the death desert here. Notorious and villainous, they have killed countless of innocents. Today, they have stopped our convoy in the hope of robbing and killing us.\" Gong Bingye remained calm as she reported the happenings clearly. Now that this mysterious man had appeared, perhaps he could finally exterminate these vermin.</p><br/><p>Lin Fan stood on top of the dragon and carefully observed both groups of people.</p><br/><p>After hearing the words of this beautiful maiden, he did have a thought of assisting her with exterminating these men.</p><br/><p>But what sort of a man was Lin Fan? Was he someone who could be charmed so easily by any woman? If he were to do as he was told by this woman, could he still be considered a man with his own character?</p><br/><p>Furthermore, he was a man with an objective. And this Baizu Sky Dragon here was not helping too much with its way of traveling.</p><br/><p>Burrowing up and down under the ground, who the hell could stand it! Lin Fan had no idea how much sand he had swallowed along the way here.</p><br/><p>\"‘Senior, we’re just trying to make a living here!\" Sha Dulong shouted out immediately.</p><br/><p>\"That’s right…that’s right!\" The other bandits echoed in unison.</p><br/><p>...</p><br/><p>When they saw this senior take out a gleaming ax, they were extremely horrified. Gong Bingye, on the other hand, let out a slight smile.</p><br/><p>By the looks of it, this senior was ready to exact justice for the masses.</p><br/><p>But just then, everyone on both sides shouted out in shock.</p><br/><p>They could not understand what had just happened.</p><br/><p>Why did the mysterious man kill the Baizu Sky Dragon!</p><br/><p>Didn’t he tame it perfectly fine?!?</p><br/><p>‘Ding…congratulations on slaying pericelestial middle-level beast.’</p><br/><p>‘Ding…experience points +300,000’</p><br/><p>...</p><br/><p>Gleaming brightly, the ax split the Baizu Sky Dragon’s head cleanly into two. Lin Fan was also extremely pleased in his heart. He could naturally not let such a beast go free.</p><br/><p>Bl*ody hell, pericelestial middle level? That was a sh*t ton of experience points!</p><br/><p>If he were to let it go this easily, then he could forget all about leveling up.</p><br/><p>Both sides of the masses started to shudder. What a vicious man... That was a Baizu Sky Dragon!</p><br/><p>Countless people would wish and dream of being able to tame a Baizu Sky Dragon. But this man here had just slain it without hesitation. This…!</p><br/><p>Lin Fan lobbed the Eternal Axe over his shoulders and pointed at the crowd commandingly.</p><br/><p>\"My apologies, this is a robbery. Line up properly, ladies and gentlemen!\" Lin Fan did not want to say anything more.</p><br/><p>In order to uncover the secret behind the ‘Seven Saint Treasure Map’, Lin Fan couldn’t be bothered with too many questions. By the looks of it, Lin Fan would have to cross many cities and lands before he could arrive at the secret. Therefore, he needed to naturally make the appropriate preparations for himself.</p><br/><p>Looking at both sides, these men here were bound to be rich f*cks! How could he just let them go just like this?</p><br/><p>On one hand, it was a convoy of businessmen. The other hand, bandits. Both sides were bound to be rich.</p><br/><p>\"WHAT?!?\" Everyone was taken aback in disbelief.</p><br/><p>Especially Gong Bingye, her petite lips quivered, \"Senior…\"</p><br/><p>\"Hush, no more nonsense, please. Hurry the hell up. Men on the left and women on the right.\" Lin Fan waved his ax. The ripping sound made by the axe was enough to have them utterly terrified.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>WOW THIS DEVELOPMENT HAHAHA. I swear I could not have expected this in a thousand years. I thought it was time for him to arrive at another city for another arc. But who knows, ladies and gentlemen. That’s Lin Fan for you. HAHA.</p><br/>\n</div>"}