{"title": "Chapter 193: Touch For Yourself If You Do Not Believe", "id": 193, "volume": 2, "url": "http://boxnovel.org/the-strongest-system-chapter-193-touch-for-yourself-if-you-do-not-believe", "volume_title": "Volume 2", "body": "<h1>Chapter 193: Touch For Yourself If You Do Not Believe</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 193: Touch For Yourself If You Do Not Believe</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>With the giant ax lobbed on his shoulders, Lin Fan looked at both sides as though he was reviewing troops. He frowned.</p><br/><p>\"What! Did you guys not catch my words? I said men on the left and women on the right! You guys better get your sh*t together!\" Did these guys think that Yours Truly was joking about this?!?</p><br/><p>Lin Fan could admit that the young lady WAS pretty attractive. But of course, Yours Truly wasn’t someone who would be doused and immersed in lust. If he were to get angry, sh*t, even Lin Fan would be afraid of Lin Fan, let alone a young lady.</p><br/><p>Under Lin Fan’s stern stare, Gong Bingye frowned and moved over to the right side. The fourteen Sand Bandits were hesitating at first as well. But when Sha Dulong nodded, all of them headed to where the black soldiers were and stood in a row as well.</p><br/><p>\"Leader! What’s the meaning of this! This fella…!\" Sha Daotian gripped the weapon in his hands tightly and commented begrudgingly. They were bandits to begin with. If news of them being robbed were to spread, then where could they ever show their faces again? Wouldn’t they be mocked till no ends?</p><br/><p>\"Do not speak.\" Sha Dulong held down Sha Daotian’s hands to have the latter calm down and not make any rash moves.</p><br/><p>Sha Dulong observed Lin Fan keenly, hoping to find some traces of his strength or power level. He had to find out just what cultivation base this man was at.</p><br/><p>But to be honest, the moment this man had struck down the Baizu Sky Dragon in one fell swoop, he knew that this wasn’t a man they could trifle with. He looked at Gong Bingye, who stood like a lone wolf on the other line, and let out a smug smile as well.</p><br/><p>Standing on the right side, Gong Bingye’s heart and mind were turning rapidly. She was trying hard to come up with a plan to have this mysterious man stand on her side.</p><br/><p>It was fine if they were to lose all their valuables. But the important thing was having all of them get out of this place alive.</p><br/><p>Suddenly, Lin Fan beckoned over one of the black soldiers who was stumpy and short. The black solider was somewhat nervous at being called out. But eventually, he clinked and clanked and made his way slowly over with his heavy armor.</p><br/><p>\"Go retrieve all their storage sacks and hand them to me.\" Lin Fan ordered with dominance.</p><br/><p>\"Yes.\" The black solider did not dare to disobey this man. He then moved on to start from the first of the men.</p><br/><p>\"All of you had better be honest and clean about this! If I catch anyone trying anything sneaky…hmm, let’s just say that my ax isn’t a vegan, buddies.\" Lin Fan said in a threatening voice. This was his first attempt at an actual robbery, unlike what had happened in Cangling Continent. By the looks of it, robbery was the best way of amassing wealth.</p><br/><p>And of course, robbery could even help in reaping some unexpected benefits at times.</p><br/><p>Who knew, he might be able to find another treasure just like the ‘Seven Saints Treasure Map’. He had obtained this treasure map by pure chance back then. But of course, he couldn’t let any of these chances pass him by just like that as well.</p><br/><p>\"Sigh, buddy. Hand them over to me.\" The black solider who was in charge of confiscating the storage sacks looked at his comrade helplessly.</p><br/><p>His buddy took a look at him and relented, handing over the storage sack.</p><br/><p>At least these black soldiers were honest about it and handed their stuff over without much hassle. But the same could not be said for the fourteen Sand Bandits.</p><br/><p>Sha Daotian took a look at the stumpy black soldier and his eyes flashed with hatred. He then took out a storage sack and tossed it over to him.</p><br/><p>\"Woah, woah, woah. Hold up there…\" Lin Fan walked over with his Eternal Axe. \"Cmon, robbers with just one storage sack? Are you taking Yours Truly for a fool!\"</p><br/><p>Lin Fan stood in front of Sha Daotian and sized him up and down. As though he could sniff the treasures this guy was holding on to, he called out, \"Cmon, cmon. Out they come!\"</p><br/><p>Sha Daotian was feeling extremely indignant. Bloody hell. They were bandits who had spent their entire lives robbing others. To think that they would be robbed today. This guy was being too impudent!</p><br/><p>Even a bandit had the dignity of a bandit. But this guy was trampling all over their dignity like nothing. Intolerable!</p><br/><p>\"I’ll fight you…!\" Just then, Sha Daotian’s True Energy vibrated out and infused in the saber he was holding in his hand, chopping down towards Lin Fan’s neck.</p><br/><p>\"Stop, second Brother!\" Sha Dulong shouted. But it was all too late.</p><br/><p>Lin Fan looked at Sha Daotian’s enraged face and admired it. Not bad, not bad. But in the end, ‘not bad’ was the highest praise he could give.</p><br/><p>BAM!</p><br/><p>At that moment, the skies quietened down.</p><br/><p>Sha Daotian remained in his same stance, with his True Energy rumbling and his aura explosive. The look of him with the saber cutting down was still awe-inspiring, with a look of resolution in his eyes.</p><br/><p>But just then, the saber dropped onto the floor with a loud clang. His expression changed rapidly as his entire face shrunk into a terrible pain.</p><br/><p>Those bulky arms of his stretched out, along with the five fingers of each hand. In the end, he collapsed onto the ground, all ten fingers covering his crotch.</p><br/><p>A painful and loud yell pierced the clouds straight up in the skies, sending a vibrating shockwave.</p><br/><p>‘Ding…congratulations on defeating pericelestial lower level bandit, Sha Daotian.’</p><br/><p>‘Ding…experience points +200,000. More experience points and treasures can be obtained by finishing the kill.’</p><br/><p>‘Ding…’Ball Kicking’ experience points +10,000.’</p><br/><p>...</p><br/><p>Listening to the notification of the system, Lin Fan was filled with pleasure. Furthermore, that kick was extremely on point.</p><br/><p>\"Second Brother…!\" Sha Dulong called out. His face was filled with worry. But beyond that was also hint of fear.</p><br/><p>His second Brother was of a pericelestial cultivation base! But to think that he was defeated by a single kick! By the looks of it, this man was definitely pretty strong!</p><br/><p>\"Clean up your act, guys! Clean it up! If not, you’ll all experience the same ending as this guy over here!\" Lobbing back his ax, Lin Fan’s expression was calm as ever. He then retrieved a few more storage sacks from Sha Daotian’s body.</p><br/><p>With Sha Daotian as an example for the monkeys, the rest of the proceedings went on smoothly. Sha Dulong was helpless as well, as he eventually took out all his storage sacks and the storage ring hanging on his neck.</p><br/><p>These were stuff that they had looted over all these years. To think that they would be gone just like that in the blink of an eye.</p><br/><p>Sha Dulong pinched his ring reluctantly. But catching Lin Fan’s fierce gaze, he heart thumped furiously. In the end, he still handed it over despite how unwilling he was.</p><br/><p>Being looted till they were bankrupt was like heaven toppling down for the fourteen Sand Bandits. But what could they do about it?</p><br/><p>Lin Fan smiled gently. His mood was over the rainbows.</p><br/><p>Lin Fan came before Gong Bingye and sized her up. Those long, luscious locks of her made the young Gong Bingye look ever more mature, with an air of elegance.</p><br/><p>Furthermore, that white dress of hers was even more charming, bringing about a feeling of purity. One could hardly keep their gazes off her captivating look.</p><br/><p>But…</p><br/><p>\"Alright, alright. Hand em out!\" Lin Fan laughed.</p><br/><p>\"Senior, if you’re willing, could you make a trip over to the Mo City? The Gong Family is willing to supply you with anything you require.\" An idea flashed through Gong Bingye’s eyes.</p><br/><p>\"Cmon, just hand those things over. Now’s the time for robbery! Please cherish the time of everyone present at this moment!\" Lin Fan laughed coldly.</p><br/><p>Man, this little maiden wished to seduce Yours Truly? Ambitious, ambitious. But what she did not know was that Yours Truly was a professional researcher of the major AV films produced by Japan. Having studied a wide variety of different types of girls, what had Yours Truly not seen before? All sorts of sizes from A – G, all sorts of flirty and seductive expressions, yours Truly knew them all.</p><br/><p>‘Trying to cut short the path of Yours Truly’s wealth through lust? No no no, not gonna happen!’</p><br/><p>Gong Bingye looked at Lin Fan and eventually took off the storage ring on her fingers reluctantly.</p><br/><p>\"What you’re keeping in your chest. C’mon, bring them out as well.\" As Lin Fan was keeping the storage ring, he took a quick glance and commented quickly.</p><br/><p>Even though Gong Bingye’s face remained calm, a momentary hint of unrest flashed by it. She then shook her head, \"There’s nothing else.\"</p><br/><p>\"Come clean.\"</p><br/><p>\"If Senior chooses not to believe, he can search for it himself.\" These words by Gong Bingye caught Lin Fan by surprise.</p><br/><p>These were words of provocation!</p><br/><p>Gong Bingye was also taking a gamble. A gamble that the other party would not do anything impolite to her.</p><br/><p>Gong Bingye had seen quite a number of things in this world as well. She could tell that although this man’s actions were weird, he was definitely not an evil man.</p><br/><p>But Lin Fan was still pretty displeased in his heart.</p><br/><p>This person was clearly taunting him! Furthermore, by the looks of it, those melons were at least a size D.</p><br/><p>But…</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Just when I thought this novel couldn’t get anymore hilarious. HAHAHA.</p><br/>\n</div>"}