{"title": "Chapter 205: Kneel In Front Of The Big BOSS!", "id": 205, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-205-kneel-in-front-of-the-big-boss", "volume_title": "Volume 3", "body": "<h1>Chapter 205: Kneel In Front Of The Big BOSS!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 205: Kneel In Front Of The Big BOSS!</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The Eternal Ax left a glowing streak as it sliced through the thin air towards one of the disciples who was possessed.</p><br/><p>Those pitch-black eyes of the disciple glared wide open as he opened his mouth, revealing charred dark teeth while huffing out a puff of black smoke. A ghastly face shape formed from the smoke, opening its mouth while trying to devour the Eternal Ax.</p><br/><p>However, the moment the Eternal Ax came into contact with the smoke, the smoke dissipated immediately without any resistance.</p><br/><p>Poof!</p><br/><p>Lin Fan took a look joyfully. Smacked right in the middle of his skull! Direct hit! Cleaved open cleanly in one hit!</p><br/><p>‘Ding... congratulations on defeating pericelestial middle-level spirit.’</p><br/><p>‘Ding...experience points +100,000’</p><br/><p>After all, Eternal Ax was the weapon of choice for the founder ancestor. Even the black hand which stretched out from the Heavens was sliced cleanly into two by it, let alone this mere black smoke trying to devour it. It got to have been kidding.</p><br/><p>‘Die…!’</p><br/><p>Just then, another evil spirit flew towards Lin Fan. Pointing his finger at it, Lin Fan disintegrated the evil spirit instantaneously.</p><br/><p>Seemed like the skill which was imparted to him by the Supreme Being was bloody powerful. Even though this was only at level one, to think that it was already this devastating. Lin Fan could not wait to see what the higher levels brought.</p><br/><p>‘Firmament Sword, go.’</p><br/><p>The firmament sword, which was made up of his Sword Will, darted forward, ripping through the void and piercing another evil spirit to death.</p><br/><p>‘Ding…congratulations on defeating pericelestial middle-level spirit.’</p><br/><p>‘Ding…congratulations on defeating pericelestial middle-level spirit.’</p><br/><p>...</p><br/><p>As the notifications of experience points rang non-stop from the system, Lin Fan’s heart was filled with nonstop joy as well. This was the type of feeling one ought to have while trying to level up!</p><br/><p>By this point in time, Lin Fan was like a wolf rampaging freely amongst a herd of sheep, chopping up everyone he saw.</p><br/><p>An ax, a sword, and a finger, that was a seamless combination. Like fresh sashimi on a chopping board, the spirits were sliced up, down, left, and right.</p><br/><p>\"Who else!\" Lin Fan stepped on an evil spirit with his feet and roared imposingly, looking at the rest of the evil spirits.</p><br/><p>When Lin Fan had just entered this place, he was so creeped out he could have pissed his pants. But to think that these evil spirits were so trash! One ax, one kill... There wasn’t even any sign of resistance. What a bunch of weak chickens!</p><br/><p>Looking at the evil spirit beneath his feet struggling, Lin Fan cleaved his head open without hesitation.</p><br/><p>Raising his head and puffing his chest, Lin Fan glared at the rest of them. He sneered coldly, \"All of you bunch of evil spirits, you had better know your place and kneel down before Yours Truly, kowtowing for your mistakes. Otherwise, I’ll let all of you have a taste of Yours Truly!’</p><br/><p>Lin Fan hollered all he could. After all, the lives of these evil spirits were all in the palms of his hands.</p><br/><p>Lin Fan was a man who hoarded a number of high-end top tier skills. Along with the fact that he didn’t even rest in between his moves, throwing out several moves at one go, these guys didn’t even have a chance to react against that.</p><br/><p>\"Hmph, how dare all of you ignore Yours Truly’s goodwill? Alright then, let me show you guys the scariest move in this world!\" Lin Fan kept his Eternal Axe within his storage sack and started pinching and snapping his fingers.</p><br/><p>It had been a long while since he had used that. It was time to exhibit to the world once more, and these evil spirits shall make good practice tools.</p><br/><p>\"HAHAHAHA!\" Lin Fan laughed wildly as he dashed within the midst of the spirits.</p><br/><p>\"Twisting Heaven and Earth.\"</p><br/><p>Holding onto an evil spirit with one hand, Lin Fan tore through the void with his other hand and reaching for the crucial target spot.</p><br/><p>‘Ding…experience points +1’</p><br/><p>\"HUH!?\" Lin Fan’s expression changed as his heart felt like a thousand horses had just galloped over it.</p><br/><p>‘That’s all the experience points it gave?!?’</p><br/><p>Those disciples who had been possessed by these spirits did not feel any bit of pain. No matter the changes that happened to their bodies, they could not feel anything anymore.</p><br/><p>‘Trash…!’</p><br/><p>Lin Fan gave a look of disdain, pushing all the blame onto these evil spirits.</p><br/><p>Stretching his finger out, he destroyed the body of that evil spirit entirely with his Deflowering Finger.</p><br/><p>‘Ding…congratulations on defeating pericelestial middle-level spirit.’</p><br/><p>\"Now that you guys are all possessed by evil spirits, naturally as a benevolent senior, I cannot let you guys continue to stay on in this world under such humiliation. Let Yours Truly relieve you guys from this pain right now.\" Lin Fan no longer bothered to experiment anything else with these guys. They were simply way too trash.</p><br/><p>They weren’t capable of helping him grind experience points. What other use were they of?</p><br/><p>‘Firmament Sword.’</p><br/><p>The long sword flew around the void in a circle, killing all the evil spirits at once.</p><br/><p>After keeping his Sword Will, Lin Fan looked at the last remaining altar.</p><br/><p>The runic symbols on the altar were still moving around gently, giving off a holy aura. Lin Fan presumed that it must contain another evil spirit as well.</p><br/><p>But Lin Fan was hesitating if he should let it out to slay it.</p><br/><p>He had a slight worry that this evil spirit may be way stronger than the rest, even stronger than him. If that were the case, wouldn’t he be dead meat?</p><br/><p>After considering for a moment, Lin Fan decided to retreat.</p><br/><p>If it were a weak shit, killing it or not would make no difference. But if it were some high-level spirit and he couldn’t deal with it, wouldn’t that be real bad?</p><br/><p>The final conclusion was that opening this had way more to lose than gain for him.</p><br/><p>Lin Fan turned around to leave without hesitation. But just as he reached the entrance of the tunnel, an eerie voice came from behind.</p><br/><p>\"Stop there…\"\"</p><br/><p>Upon hearing this voice, Lin Fan froze up. Without even looking back, he tried to dash to the exit. But before he could even move, a stone wall fell down, blocking his path forward.</p><br/><p>Lin Fan threw a punch forward, intending to smash his stone wall. But to think that the blow would in fact rebound, causing him to fly a few steps back.</p><br/><p>\"You won’t be able to leave.\" The voice came once more.</p><br/><p>Lin Fan turned around. He saw the black mist from all the corpses floating up and gathering like streams to a river into the final altar.</p><br/><p>And that voice came from within that altar.</p><br/><p>The accumulated black mist coiled around those runic symbols, as though they were struggling to fight against the holy aura produced by it.</p><br/><p>Lin Fan swallowed, somewhat nervous in his heart. But he knew that he couldn’t panic at this moment.</p><br/><p>\"The heavens are benevolent. Yours Truly considered the fact that it wasn’t easy for you to survive this long even as a spirit, hence I decided to spare your life. Are you not cherishing my compassion!\" Lin Fan shouted solemnly without any nervousness.</p><br/><p>He had to give off the aura that to him, this altar was just a little ant.</p><br/><p>But in his heart, he could tell that this was about to f*ck up so bad! He was clearer than anyone if this thing were strong or weak.</p><br/><p>And of course, the system wasn’t all for show. On the system’s notification panel, the indication above the altar was clear as day.</p><br/><p>‘Lesser Celestial Lower Level.’</p><br/><p>If they were all like this from the beginning, Lin Fan would not have been this afraid. But the main point was that, hadn’t things escalated way too quickly?!? From pericelestial all the way up to lesser celestial!</p><br/><p>And in fact, this wasn’t the end. The cultivation base had been steadily increasing for quite a while now. Lin Fan did not even know what it would end up at.</p><br/><p>\"The sacred monks had sealed me for a thousand years, subjecting me to torment day and night. You shall be my first tribute as I break free.\" The voice came again. These words had Lin Fan’s blood running cold.</p><br/><p>‘F*ck it! I’ll fight it.’</p><br/><p>Lin Fan’s face was pale right now. F*ck. He would take it down before it got any stronger.</p><br/><p>Eternal Ax, Firmament Sword, Nirvana Finger…</p><br/><p>\"HAHA! Not bad, not bad. To think that Your Majesty’s first tribute would be this strong.\"</p><br/><p>Lin Fan exploded with all his power. But…a black barrier suddenly appeared in front of the altar, deflecting everything away from it.</p><br/><p>Even the Eternal Ax could not split it open.</p><br/><p>Right now, Lin Fan was truly, truly…petrified.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Wow. Shit has seriously gotten damn real guys.</p><br/>\n</div>"}