{"title": "Chapter 216: Yet Another Breakout Act", "id": 216, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-216-yet-another-breakout-act", "volume_title": "Volume 3", "body": "<h1>Chapter 216: Yet Another Breakout Act</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 216: Yet Another Breakout Act</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The golden whip glimmered brightly, covering the entire sky in its golden shade. Like an agile snake, it coiled around repeatedly in the skies. The 4-tailed phoenix cried out, shaking the heaven and earth, and filling them completely with flames.</p><br/><p>Lin Fan retreated slightly in shock. This whip was so darn strong! How could anyone survive from that?</p><br/><p>Lin Fan looked towards the black vortex. It was as though there was a divine being housed within it, looking at all of this with cold eyes.</p><br/><p>And that domineering whip was the representation of that divine being.</p><br/><p>‘???’</p><br/><p>His cultivation base was only represented by question marks. This must mean that he had transcended beyond Greater Celestial. This was the first time Lin Fan had encountered anyone like this.</p><br/><p>The thought of this made Lin Fan shudder. If he had come to Fiery Hell brashly like he intended to, encountering this Phoenix and acting out all his bullsh*t as always, wouldn’t he be dead meat if this divine being had appeared just like this?</p><br/><p>The battle between the whip and the Phoenix was extremely fierce as their aura exploded everywhere. Lin Fan felt as though he was caught within a tornado, and he could be ripped apart at any moment.</p><br/><p>The Xuanjian Sect disciples on the peak nearby retreated immediately, extremely shocked as well. Even just standing there felt way too dangerous, as the pulsing shockwaves made their hearts throb.</p><br/><p>\"What about Senior Sister Xuan?\" One of the disciples asked.</p><br/><p>\"This situation is no longer within our control.\"</p><br/><p>...</p><br/><p>Lin Fan retreated hastily. This four-tailed phoenix was simply way too strong, as though it could singlehandedly manipulate the power of all the flames within Fiery Hell. All of the beasts stood where they were, howling into the skies without any fear.</p><br/><p>But suddenly, all these beasts exploded into dust by a sudden shockwave.</p><br/><p>Seeing this, Lin Fan was shocked out of his wits. This person was simply way too terrifying! He could destroy them without even moving a single bit!</p><br/><p>At the same time, Lin Fan caught sight of the b*tch who had tried to kill him. But now that things were like this, who was in the mood to bother about what had happened earlier.</p><br/><p>\"Leave now! It’s too dangerous!\" Lin Fan shouted over.</p><br/><p>When Xuan Yunxian looked at what happened to the beasts, she was in a momentary state of shock as well. However, upon seeing Lin Fan, she calmed down. Once more, she was agitated and angered, wanting revenge on this man who had harmed her disciple.</p><br/><p>But just as she was about to strike at him, something unexpected happened.</p><br/><p>The four-tailed phoenix’s battle with the whip had reached its climax. The Phoenix flapped its flaming wings furiously as the entire Fiery Hell shook violently. It was similar to what happened earlier, but way more intense.</p><br/><p>One by one, flames shot out from the ground, forming fire tornadoes of their own. The number of fire tornadoes increased over time, threatening to burn over the entire Fiery Hell.</p><br/><p>Eventually, Xuan Yunxian gritted her teeth and continued to look for somewhere else to hide.</p><br/><p>Lin Fan was following behind Xuan Yunxian. Suddenly, a fire tornado shot out from beneath his feet, scaring the guts out of him.</p><br/><p>But at that moment, Lin Fan’s expression changed.</p><br/><p>‘Ding…Eternal Demon Body experience points +100.’</p><br/><p>...</p><br/><p>Lin Fan stood around in bemusement. Whew! Nothing happened to him! Even though his clothes were burning, his physical body had no damage or anything to it. In fact, he even gained some experience points.</p><br/><p>By now, the flames were like a tsunami of fire, threatening to swallow the entire Fiery Hell.</p><br/><p>\"Here! There’s a cave here!\" Lin Fan shouted over to Xuan Yunxian, who was busy looking for a hiding spot. Upon hearing Lin Fan’s call, Xuan Yunxian turned around. Glancing at Lin Fan once, she then proceeded into the cave.</p><br/><p>\"Why aren’t you coming in?\" Xuan Yunxian realized that Lin Fan was standing outside the cave without budging an inch and hurried him.</p><br/><p>Just then, Lin Fan gave off a resigned laugh. \"The cave only fits one.\"</p><br/><p>Xuan Yunxian’s face changed upon realizing this fact. Looking at Lin Fan in disbelief, she could not believe that this man would…!</p><br/><p>\"You…\"</p><br/><p>Lin Fan looked at Xuan Yunxian with a smile on his face. \"To be able to pass on the hope of living to a beauty like you is an honor of mine. Ever since I first caught sight of you, I was captivated by your grace. I hope that you do not forget about me ever…\"</p><br/><p>Xuan Yunxian wanted to reply, but she was further interrupted by Lin Fan.</p><br/><p>\"Do not speak any further. To be able to just stare at you like this before I die is a lavish demand to the Heavens. Farewell.\" Lin Fan lifted a rock from the side and proceeded to slowly seal up the cave.</p><br/><p>Just then, a burst of flame burnt against his back, circling around Lin Fan’s body. Lin Fan squeezed tears out of his eyes, showing an extremely pained look, as though he was struggling to move that rock to seal up the cave.</p><br/><p>Xuan Yunxian, who was hidden in the cave, did not say anything. She couldn’t; Lin Fan’s words and actions had stunned her speechless.</p><br/><p>...</p><br/><p>By now, Lin Fan was prancing and leaping around the Fiery Hell casually. The clothes he was wearing had already long been burnt to a crisp.</p><br/><p>\"Hehe! Yours Truly is a genius indeed! Seems like my skills at picking up chicks had improved quite a bit. Seems like, in the near future, there would be yet another maiden in this world whose heart will be filled with the radiance of Yours Truly!\"</p><br/><p>The moment Lin Fan realized that these flames did not cause him any harm, a thought had already come to his mind.</p><br/><p>Even if he were to hide in the cave and tide this through, he would still need to run for his life after this was all over. If things were to go south, he might even get caught by the other party.</p><br/><p>Also, how could he miss out on this fantastic battle between the four-tailed phoenix and the whip! If any treasures were to drop from the phoenix’s defeat and he were to pick them up ‘accidentally’, wouldn’t he be in for some big profits?!?</p><br/><p>Lin Fan was like a fish swimming in this pool of fire as he stared up at the skies.</p><br/><p>The battle between the phoenix and the whip was getting so heated up that the flames were burning white. But one could tell that the phoenix was no match for the whip, as it slowly lost its advantage over time.</p><br/><p>Just then, something shocking happened. The whip glowed golden once more, unleashing an ancient aura and coiling the phoenix within it.</p><br/><p>The whip repeatedly coiled without stopping, trapping the phoenix within it. The glow seemed to have some sort of restrictive properties, catching onto the phoenix tightly.</p><br/><p>Looking at this, Lin Fan was somewhat disappointed. Was the phoenix going down just like this?</p><br/><p>Yours Truly was waiting for a situation where both parties would suffer greatly, and he’d just sneakily reap the rewards. He had already prepared his popcorn to watch this fantastic show, and this was it?</p><br/><p>But yet another unbelievable thing happened; from within the black vortex, stretched out a gigantic arm.</p><br/><p>Looking at this arm, Lin Fan no longer had words to describe this bullsh*t.</p><br/><p>Lightning was crackling at each of its fingertips as the gigantic hand itself was covered densely in runic symbols and runes. The speed at which the arm was moving was slow, as though something was holding it back.</p><br/><p>And the direction the arm was heading towards was the lava river.</p><br/><p>The trapped phoenix shrieked out loudly at the sight of this and struggled intensely to try to break free. It beat its gigantic wings furiously and dashed towards the vortex.</p><br/><p>BOOM!</p><br/><p>Just then, a blinding light shot out from the vortex. The ground shook as though the skies were going to collapse at any moment.</p><br/><p>Lin Fan stood dumbfounded. He did not know what had just happened.</p><br/><p>The skies returned to its clear blue state. The vortex was gone, the phoenix was gone... Everything was gone, and silence returned to the earth.</p><br/><p>The lava river was the only thing flowing amidst this silence.</p><br/><p>Lin Fan was stunned for a while. Suddenly, his eyes gleamed.</p><br/><p>There must be something inside…</p><br/><p>Without thinking, Lin Fan dove headfirst into the lava river.</p><br/>\n</div>"}