{"title": "Chapter 219: Fighting Cock Of A Phoenix", "id": 219, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-219-fighting-cock-of-a-phoenix", "volume_title": "Volume 3", "body": "<h1>Chapter 219: Fighting Cock Of A Phoenix</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 219: Fighting Cock Of A Phoenix</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>A brand-new life was hatching before Lin Fan’s very eyes. On that pure, white egg, intricate cracks appeared on after another. Suddenly, a red glow appeared abruptly.</p><br/><p>Lin Fan widened his eyes while looking at the egg. His heart was like a raging storm. The Ancient Beast from the legends was about to be born.</p><br/><p>A tweet rang out from within the egg, so sharp, crisp and clear.</p><br/><p>Suddenly, a red beam shot out from the top of the egg. From there, a crack appeared and two wings spread out.</p><br/><p>After those majestic wings came out, it stretched out its three-fingered claws. It raised its head gloriously, an exemplary representation of the majestic beast it was which had hatched from this egg.</p><br/><p>The featherless phoenix, which was the size of an adult rooster, cried a few times into the skies and retracted its wings. It then hopped down onto the platform, pecking at the eggshell with its sharp beak.</p><br/><p>Up and down, up and down, it pecked at a rapid speed, like a pile driver. Soon, the very egg which it had hatched from disappeared entirely.</p><br/><p>Lin Fan stood there, his heart thumping furiously.</p><br/><p>What the f*ck? This was all that Yours Truly had been camping a month for?</p><br/><p>Thinking back at that mysterious and tough phoenix, he took yet another look at this unassuming little chick. This wasn’t the image he had imagined in his mind. These two shouldn’t be the same living being right?</p><br/><p>The chicken stood perched on the platform and stared at Lin Fan eye to eye.</p><br/><p>Lin Fan was strongly resisting the urge to break down. This was not what he had expected!</p><br/><p>Meanwhile, the chicken tilted its head and looked at Lin Fan with its large eyes, revealing an extremely puzzled look. Why did this living thing before it look so different from itself?</p><br/><p>‘You…!’ Lin Fan stretched out his finger. He had to interrogate this chicken. Just what the hell was this?</p><br/><p>But suddenly, the eyes of the chicken flipped white. Falling headfirst, it landed on the ground, both feet raised high in the air. Stretching out its little pink tongue, it didn’t move anymore after that. It seemed to have died.</p><br/><p>Lin Fan’s face turned pale as a sheet. He reached out immediately, shaking the chicken furiously. ‘WHAT THE HELL?’</p><br/><p>Lin Fan could feel the lifeforce of this newly born phoenix rapidly diminishing. Bloody hell, wasn’t a phoenix supposed to be a beast with boundless lifeforce? Even a 10,000-year-old tortoise wouldn’t be able to compete with its lifespan! Why the hell was it dying the moment it was born?!?</p><br/><p>\"Oi! Oi! CHICKEN! Don’t f*ck with me! Yours Truly has camped here for an entire month for you, and the moment you’re out, you’re going back?!? Aren’t you way too heartless!\" Lin Fan was starting to panic. Just what was happening here? Was there something wrong with the hatching process?</p><br/><p>Or could it be that this phoenix was blatantly playing around thus leading to this pregnancy? Had the genes been mixed with some other random breed that caused the birth of this deformed freak creature?</p><br/><p>The more the lifeforce of the chicken died out, the more Lin Fan flustered.</p><br/><p>If this kept on, it was surely dead!</p><br/><p>Lifeforce?</p><br/><p>Lin Fan recalled the Nirvana Rocks. Weren’t those filled with lifeforce?</p><br/><p>Without hesitation, Lin Fan took out all the Nirvana Rocks he had collected. The moment these rocks came near the phoenix, they let out a red glow before transforming into a red glow like a river, flowing into the phoenix’s body.</p><br/><p>‘It’s working…!’</p><br/><p>Lin Fan could feel that the lifeforce was no longer diminishing. In fact, it was slowly increasing. He then continued to place the rocks one by one beside the phoenix.</p><br/><p>Looking at the rocks flowing into the phoenix like a river, Lin Fan let out a sigh of relief. At least he had managed to resuscitate this phoenix. No matter what, even if it were a mixed deformed freak, it was still a descendant of an Ancient Beast.</p><br/><p>Lin Fan stretched out his hand and rubbed the body of the phoenix. Even though it was featherless, at least if it were to grow up, it would still be a good sidekick for sure.</p><br/><p>But the moment Lin Fan touched the chicken, this thing which was lifeless only moments before rose up immediately and pecked his palm.</p><br/><p>F*CK!</p><br/><p>Looking at the deep sunken hole on his palms, Lin Fan was filled with disbelief. His physical body state was that of a lesser celestial! To think that a single peck from this chicken would be this strong!</p><br/><p>While Lin Fan was still in a state of shock, the chicken rose up with a strutted chest. Even though it was featherless, it was still rather imposing as it stretched out its wings. Turning around, it suddenly broke into a run into the distance. That propped up backside of it was shaking left and right furiously as it made its escape. It was so energetic now like a baby who had just breastfed some milk.</p><br/><p>Lin Fan broke out of his stupor and roared out angrily.</p><br/><p>\"Stop right there…!\" Swift like lightning, he chased after the chicken.</p><br/><p>The chicken, which was furiously escaping, turned around and saw this weird monster chasing after it relentlessly. Clucking frantically, it sped up even more.</p><br/><p>‘Lesser Celestial Lower Level.’</p><br/><p>The moment Lin Fan looked at it, he was extremely astonished. To think that a freshly born chick would already have a lesser celestial cultivation base! Shocking!</p><br/><p>An Ancient Beast was an Ancient Beast indeed. It couldn’t be compared to mere beasts. Normal beasts’ offspring would usually only have a precelestial cultivation base.</p><br/><p>Thinking back to that one peck, if his body had not been this strong, he might have lost this hand entirely!</p><br/><p>The thought only served to enrage Lin Fan even more.</p><br/><p>‘After camping for you for an entire month and saving your life with the Nirvana Rocks, you would turn against Yours Truly immediately? Darn it.’</p><br/><p>‘Disobedient, aren’t you? Fine then, Yours Truly will train you until you’re obedient.’</p><br/><p>Even though this chicken had just been hatched, Lin Fan was alright with it. After all, one had to teach a kid from a tender age. Otherwise, they would grow up to be a wreck.</p><br/><p>As the chicken continued on its hasty escape, it turned back from time to time to see if the weird monster was still chasing after it. But just then, the chicken caught sight of a whip chasing it furiously, as though it had eyes grown on it. It started crying out fearfully.</p><br/><p>Like an agile snake, the whip coiled itself around the chicken’s claws. With a strong tug, the chicken fell onto the ground and was pulled back by Lin Fan.</p><br/><p>Lin Fan looked at the fearful chicken and let out an evil smile.</p><br/><p>From within his backpack, Lin Fan took out a barbeque grill and placed some mysterious ingredients beside it.</p><br/><p>The chicken, which was now tied to a nearby rock, looked at Lin Fan suspiciously, wondering what this mysterious creature was going to do to it.</p><br/><p>Lin Fan threw a side glare over at the chicken. The evil look in his eyes sent it into a panic frenzy.</p><br/><p>From his storage, he took out a domestic fowl. In front of the chicken, he cleaned the feathers off the fowl with a sharp knife easily, and eventually placed the fowl on the grill.</p><br/><p>He had prepared this fowl all the way from Nameless Peak. Naturally, he couldn’t let himself suffer from low quality food on this expedition.</p><br/><p>By the looks of it, the chicken did not seem to be a stupid creature as well. Lin Fan was sure that it could definitely understand his meaning.</p><br/><p>And he was right, because the chicken started crying out frantically. It had finally understood what this mysterious creature was up to.</p><br/><p>Walking towards the chicken, Lin Fan’s smile was giving the chicken goosebumps. He then released the rope around it. The chicken, who had regained its freedom, did not dare to move. It just stood there stilly.</p><br/><p>Looking at the scared look on the chicken, Lin Fan smiled, \"You’ll be called Chicky from now on, get it?\"</p><br/><p>Chicky didn’t hesitate and just nodded its head frantically.</p><br/><p>Horrifying. This was way too horrifying.</p><br/><p>\"And from now on, you’ll only cry out like this.\"</p><br/><p>Lin Fan demonstrated for it: ‘Cuckoo! Cuckoo!’</p><br/><p>Chicky nodded its head furiously once more, before raising its head and crying out, ‘Car..koo!’</p><br/><p>Lin Fan nodded his head in satisfaction. Even though it sounded a little off, he was sure that with time, it would sound the same.</p><br/><p>What was a phoenix in the face of all this?</p><br/><p>Lin Fan was determined to create a fighting cock out of a phoenix.</p><br/><p>But then again, hehe, he would have to train it up first of course. Lin Fan did not believe that this chicken would submit to him so easily.</p><br/><p>Given its high intellect, he was sure that this chicken would understand the concept of shame as well.</p><br/><p>Looking at the evil look on the mysterious creature before it, Chicky trembled with its featherless body.</p><br/><p>Just then, a tragic cry called out.</p><br/><p>‘CAR…KOO…KOO!!!’</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHA WHAT THE HELL PLEASE THIS CHAPTER. This novel never fails to crack me up. By the way, it IS a phoenix, not a chicken. Lin Fan’s the one who keeps calling it a chicken hahaha.</p><br/><p>And if any of you gets confused here, friendly reminder that the Snow Lion was a descendant of an Ancient Beast, thus the cub that Cai Zhiqiao has is a descendant of a descendant of an Ancient Beast. While this is the direct offspring of an Ancient Beast.</p><br/>\n</div>"}