{"title": "Chapter 226: Injustice For The Masses", "id": 226, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-226-injustice-for-the-masses", "volume_title": "Volume 3", "body": "<h1>Chapter 226: Injustice For The Masses</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 226: Injustice For The Masses</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The Qinshen dynasty was built over a thousand years ago, led by the great Zou Qinshen, a man so fearsome he was titled Death God by the masses.</p><br/><p>At this very moment, the Qinshen dynasty was bustling with excitement.</p><br/><p>Two great sects were present in the Qinshen dynasty to recruit disciples. This grand affair was something which only happened once in ten years in the Qinshen dynasty.</p><br/><p>Tongtian Sect and Xianling Sect were the two powerhouses closest to the Qinshen dynasty. Most of the disciples in these two great sects came from the Qinshen dynasty. Thus, both sects maintained a close relationship with the dynasty.</p><br/><p>Within the Qinshen Palace’s huge Outer Halls…</p><br/><p>A fighting ring was erected using limestone, spanning ten feet in both length and width. Two members of the royal family were sparring in the ring. Beneath this great fighting ring sat the Qin Emperor along with representatives from the two sects, observing the sparring side by side.</p><br/><p>Tongtian Sect resided in the middle of a gigantic ocean. Legends had it that Tongtian Sect was mounted on the shell of a 10,000-year-old turtle, but no one knew of the truth.</p><br/><p>On the other hand, Xianling Sect, just like Xuanjian Sect, only accepted female disciples. There were countless of princesses within the royal family. For these princesses, being selected to enter Xianling Sect would mean being able to break free from an otherwise predetermined life for them.</p><br/><p>\"Qin Emperor, the princes and princesses this time round are pretty decent, eh?\" Tongtian Sect’s representative was an elder of the inner sect in charge of disciple affairs. The potential of the Qinshen dynasty’s ancestor, Zou Qinshen, was extremely high. As such, there was a high chance that one of their descendants would also possess similar and high-quality caliber due to these good genes.</p><br/><p>\"You flatter us, Elder Huang.\" Qin Emperor laughed jovially. He was heartened to hear Elder Huang’s praises.</p><br/><p>\"Qin Emperor, what happened to that arrogant and haughty young man ten years ago?\" Huang Bang asked laughingly. Back when he was here to recruit ten years ago, a young lad did attract his attention.</p><br/><p>\"You must be referring to my dear Sheng?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Hais, that boy is only focused on the ways of politics, dabbing in incessant quarrels with his brothers all day long and neglecting his cultivation. Therefore, he is only at a pericelestial cultivation base right now.\"</p><br/><p>\"Not bad still. If only he had returned with us back to the sect ten years ago and focused on his training, with his potential, he would definitely have had a bright future.\" Elder Huang said with a tinge of regret. However, to be able to cultivate to a pericelestial was still a pretty decent achievement.</p><br/><p>The elder of Xianling Sect who had not spoken previously suddenly commented, \"That kid is decent.\"</p><br/><p>Qin Emperor looked over in her direction and chuckled, \"Yes, Shui Yun. That kid’s potential is pretty decent.\" Both of the elders were just like old women doing their shopping in the marketplace, taking their picks at the groceries available.</p><br/><p>The Qin Emperor was also agreeable with this arrangement of the sects picking out disciples from the royal family. After all, he was only a middle-aged man with 3000 concubines in his harem. As such, he naturally had quite a number of children. Dozens of kids would be born each year. Putting a few of them into the sects to be groomed wasn’t a bad idea as well.</p><br/><p>This was a better option compared to having all of them vie for power and authority in the future when they grew up, creating a noisy mess in the royal family.</p><br/><p>\"Prince Teng Long. Victory.\"</p><br/><p>The spar was over. A young man, who seemed to be twelve to thirteen years old, had sent his family member flying down the ring while spitting out blood along the way. Raising both hands, he looked down at the fallen person with eyes of contempt.</p><br/><p>\"Who else wants a go at taking the title of number one in this year’s sparring? If you’re indignant, come on up!\" Teng Long stood in the ring, shouting out arrogantly.</p><br/><p>Looking at this scene, the Qin Emperor shook his head. \"I am presenting a disgraceful scene for the two elders present.\"</p><br/><p>\"No worries… This kid is decent.\" Elder Huang laughed while nodding in approval. This kid had a good potential. He would grow up to be a talent.</p><br/><p>Even though Teng Long was only 12-13 years old, he had a vicious nature. For the sake of training himself, he had murdered countless prisoners in prison with his bare hands.</p><br/><p>His cry of arrogance was filled with murderous intent, sending shivers down the spine of his other brothers and sisters taking part in the sparring.</p><br/><p>\"His murderous nature is too strong.\" Elder Yin of Xianling Sect shook her head.</p><br/><p>...</p><br/><p>Suddenly, the Qin Emperor and both elders stood up immediately. They gazed at the distant skies while frowning. They could feel an intermittent force traveling towards them from the distant skies. Along with it were muffled cries and wails.</p><br/><p>Lin Fan had arrived at the skies of the Qinshen dynasty with Zou Sheng and the others. Catching sight of the royal palace, Lin Fan hastened.</p><br/><p>Zou Sheng and the others were delighted to see the place that Lin Fan had brought them to. But in the midst of their tragic cries and the tormenting pain, they could not say anything else.</p><br/><p>When the Qin Emperor finally made out what was happening, his expression changed entirely. He calmed himself down before asking.</p><br/><p>\"May I know who this sir is? Why have you harmed my son?\" The Qin Emperor looked at Zou Sheng who was behind Lin Fan. Blood was dripping all along the way, and his lifeforce was weak, as though he was mere inches from death’s door.</p><br/><p>The royal family members who were taking part in the sparring took a look into the skies as well. When they saw what was happening, they let out shrieks of distress.</p><br/><p>They knew who this man being dragged was. This was their older brother. Crown Prince Zou Sheng. In the crowd, some people were worried while others were secretly overfilled with joy.</p><br/><p>As the number one in the sparring, Teng Long was immersed in the attention of the masses. But who was this guy who had appeared out of nowhere, stealing his limelight! He was naturally displeased. But when he raised his head and realized that the man who was held captive was his brother, he roared out as well, \"Thief! Let go of my older brother!\"</p><br/><p>Elder Huang frowned and stepped forward, \"What is the matter, sir? Could we discuss this peacefully?\"</p><br/><p>\"Who is the Qin Emperor.\" Lin Fan asked coldly.</p><br/><p>\"I am Your Majesty.\" The Qin Emperor locked eyes with Lin Fan, a fire gradually burning within him as well.</p><br/><p>\"He has massacred 108 innocent villagers. How do you want to settle this?\" Lin Fan asked.</p><br/><p>Upon hearing these words, the Qin Emperor was taken aback. He had thought that it was some earthshattering major event that had happened. But to think that it was just over a trivial issue as such? These villagers didn’t even belong to the Qinshen dynasty. So what if they were killed?</p><br/><p>But looking at the other party’s disposition, this issue might not get resolved that easily. Could he have had any relation with the villagers?</p><br/><p>Was that why he was seeking vengeance?</p><br/><p>Elder Huang frowned as well. Massacring 108 innocent villagers, that was a little overboard indeed.</p><br/><p>\"Thief! Let go of my older brother! It’s just a bunch of ants living in the mountains! So what if they’re dead! If you don’t release him, I’ll take your dog life!\" Teng Long, the young kid who was just 12-13 years old, roared at Lin Fan insolently.</p><br/><p>Even though his age was tender, his capabilities were one in many in the royal family. Using the word genius to describe him was an understatement as well.</p><br/><p>In this selection sparring, he was aiming to enter the sects. Given his potential, as long as he received grooming from a sect, it was only a matter of time before he became somebody significant.</p><br/><p>\"Ants…\" Lin Fan locked his eyes onto this young kid. He then let out a bitter and cruel laugh.</p><br/><p>\"When one possesses power and stands above, he can view everyone else as ants. To you, those villagers may be mere ants. But to Yours Truly, YOU are a mere ant as well.\"</p><br/><p>\"You have some decent potential. But to be so impudent before you’re even a grown man is to seek death.\"</p><br/><p>Lin Fan’s killing intent burst out as his aura filled the entire royal palace.</p><br/><p>\"Hmph! This is the Qinshen dynasty. You better let go of my older brother and prostrate where you are, you thief. Otherwise, I’ll make you suffer and beg for death.\" Teng Long hollered at Lin Fan with naught a fear for this world.</p><br/><p>Lin Fan’s eyes glinted.</p><br/><p>\"Keeping someone like you alive would be an injustice to the innocent masses in the future.\"</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>I guess we can truly see how the destruction of Saint Devil Sect has left its lingering scars within Lin Fan, guys.</p><br/>\n</div>"}