{"title": "Chapter 224: Fate Worse Than Death", "id": 224, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-224-fate-worse-than-death", "volume_title": "Volume 3", "body": "<h1>Chapter 224: Fate Worse Than Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 224: Fate Worse Than Death</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"And your village is just right ahead?\" A man who was riding on a beast asked coldly. He was dressed in embroidered robes, sporting an air of superiority.</p><br/><p>\"Yes, crown prince! It’s just right ahead!\" The man who was following beside young master Zou answered hurriedly.</p><br/><p>\"Very well. If such a creature does exist, then I will guarantee you a lifetime of riches.\" Zou Sheng’s eyes glinted coldly. If the creature were for real, it would be extremely beneficial in aiding him to fight for the throne.</p><br/><p>In the Qinshen Dynasty, there were dozens of crown princes. If one sought to stand out for the throne, not only did he have to be cunning, he also had to have actual fighting strength.</p><br/><p>\"Erm, crown prince, then about the conditions I’ve requested from you…\" The man who was leading the way cowered and asked hesitantly. But the thought of being able to enjoy a lifetime of riches was having him salivating.</p><br/><p>\"Hmph. Once I get what I’m here for, you’ll get your due rewards. But, you DO know the consequences if I find out that you’re lying to me, right?\" Zou Sheng was one of the crown princes vying for the throne. This country bumpkin here had stopped him along his way, claiming that there was a treasure for him, hoping to get something good in return for it.</p><br/><p>To someone like Zou Sheng, he could easily give off rewards and gold. But to think that a treasure would be hidden in this village was pretty unbelievable.</p><br/><p>\"Yes…yes, prince! Don’t worry. Every single word I spoke of was the truth!\" The man replied anxiously.</p><br/><p>\"That had better be the case.\" Zou Sheng nodded his head and waved his hands forth. \"Move on.\"</p><br/><p>A group of fearsome soldiers cladded in black armor followed behind Zou Sheng.</p><br/><p>At the entrance of the Yan Village, a group of children were playing around when before their very eyes appeared a group of soldiers. Some of the older kids ran off immediately to inform the adults.</p><br/><p>Upon hearing the news, village chief Yan hurried over quickly. When he saw the group of people gathered outside, his face changed. Even more so when he saw who it was who was leading them.</p><br/><p>\"Unfilial son! How dare you return?\" Village chief Yan hollered angrily, his face flushed red. The man standing amongst the black soldiers lowered his head shamefully, not daring to make any eye contact with the village chief.</p><br/><p>Zou Sheng laughed coldly as he sat atop his ferocious beast, \"Hand it over obediently…\"</p><br/><p>...</p><br/><p>Lin Fan had already flown tens of miles away from the village, but he could not shake off this feeling that something was amiss. In a place as secluded as this, how could there be such a big group of people? Just what were they up to?</p><br/><p>Besides, the direction they seemed to be heading towards was the Yan Village!</p><br/><p>Worried, Lin Fan turned around and headed back. No matter what, he had to verify for himself what the situation was. Even if there were nothing wrong, he’d only have a peace of mind if he had seen it for himself.</p><br/><p>Since he had already passed by them, he might as well check it out. If there were truly nothing wrong, then he’d just get going along his way as well.</p><br/><p>The closer Lin Fan got to the Yan Village, the more he realized that the skies seemed to be glowing red, with a stench of blood spreading through the air.</p><br/><p>Lin Fan’s heart tightened as he frowned. Was there really something wrong? He pushed forward even faster.</p><br/><p>Just then, he heard sorrowful cries ringing through the skies. Curses, swears, anger, they all entered Lin Fan’s ears.</p><br/><p>Lowering his head, Lin Fan couldn’t help but fume within his heart. He gritted his teeth angrily and spat out a single word.</p><br/><p>\"B*stard.\"</p><br/><p>...</p><br/><p>\"Old man! You had better hand it over! Otherwise, I cannot guarantee the life of this child!\" Zou Sheng laughed coldly holding a long sword in his hand, its tip resting on a child’s neck. It was as though the moment village chief Yan said the word no, this kid would cease to exist.</p><br/><p>\"You bunch of b*stards!\" Village chief Yan roared furiously.</p><br/><p>\"Hmph!\"</p><br/><p>Instantaneously, a human head flew up into the skies. Wringing his wrist, Zou Sheng sliced the flying head into 4-5 pieces with his Sword Will. Blood spurted across the air at this cruel scene.</p><br/><p>\"Old man! Just hand the thing over to the crown prince! You’ll also receive quite a bit of riches… unless you’re wishing for death as well.\" The man who had led the way was also shocked at this development. He had not expected the crown prince to be this cold-hearted.</p><br/><p>\"SHUT UP, UNFILIAL SON!\" Village chief Yan glared at Yan Xiong with bloodshot eyes.</p><br/><p>\"Seems like you’re not giving in then, eh? Alright then, this girl here seems to be 13-14 years old at best. What a tender and ripe age. You can have her, Hei Shan.\" Zou Sheng laughed coldly and unsympathetically.</p><br/><p>\"Thank you crown prince!\" Just then, a soldier in black walked out while grinning. He was extremely large, almost the size of a bear. With a thirsty look in his eyes, he glared at the little girl who was cowering on the floor while trembling. Laughing wildly, he pulled her over.</p><br/><p>\"YOU GUYS ARE DEMONS!\"</p><br/><p>...</p><br/><p>\"Who’s the stone-hearted one here? Seems like you’re still not willing to give it out, old man.\" Zou Sheng said callously, following up with a flash of light.</p><br/><p>The little girl who was held under Hei Xiong had her head separated from her neck. A stream of blood spurted from where her head once rested, spraying across the ground as her body laid limp in this harrowing scene.</p><br/><p>\"I’LL FIGHT YOU GUYS TO DEATH!\" Village chief Yan howled as he rushed forth. But in the eyes of Zou Sheng, he was nothing but an ant. Slicing down diagonally from his shoulders, Zou Sheng cut down on village chief Yan harshly.</p><br/><p>A tragic cry rang through the skies. Even Yan Xiong, who was viewing this, was starting to tremble uncontrollably.</p><br/><p>\"Crown prince…this is my father…Could you…?\" Yan Xiong was fearful.</p><br/><p>\"Hehe. From this day on, you’ll enjoy riches you could only ever dream of. What other use is there for this old man? Unless you wanna die in his place, eh?\" A murderous look flashed by Zou Sheng’s face as he laughed maniacally. This feeling, this was it... The feeling of being able to control the life and death of all these people around here was just the best there was!</p><br/><p>\"Yes…yes…!\" Yan Xiong stuttered. \"You’re…right, crown prince…!\"</p><br/><p>Yan Xiong was the son of village chief Yan. He had long known that there was a treasure passed down from generations to generations by the ancestors of the Yan Village, only to be protected by the village chief. Yan Xiong then had a tainted thought to steal this treasure to sell in the cities in exchange for riches.</p><br/><p>But after several failed attempts, he was discovered by his father. He was then exiled out of the village. Reaching Qinshen Dynasty, he then had an idea to sell out the secret.</p><br/><p>To Yan Xiong, this must definitely be a priceless treasure. Therefore, he couldn’t seek the help of any common man for this. But, there was no way he would ever be granted an audience with the ruler of the dynasty. Thus, after camping for a period of time, he finally caught sight of crown prince Zou Sheng.</p><br/><p>\"Stop right there!\"</p><br/><p>Just then, a streak of rainbow flashed through the skies. Lin Fan looked at the surroundings, feeling his blood run cold. Who the f*ck would do something like this?</p><br/><p>Just like that, all the residents of the village laid around, massacred. Furthermore, none of the bodies were whole. They were all in bits and pieces. Just what sort of a sick b*stard would do something so heinous?</p><br/><p>Not even the children were spared. DAMN IT!</p><br/><p>\"Sir…\" In village chief Yan’s eyes flashed a single sparkle of hope the moment he caught sight of Lin Fan.</p><br/><p>Struggling with whatever remaining strength he had, he clawed against the ground to Lin Fan. With a pair of trembling hands, he gripped Lin Fan’s pants with everything he had.</p><br/><p>\"Sir… the lowly me has a treasure that I’ve been keeping guard over generations for the village…It is hidden beneath the wooden hut you were in…I’m willing to give it to you, sir…Please, I only beg…I beg of you…please avenge all the hundred dead villagers I failed…to protect…\" Village chief Yan choked dismally, shedding tears down his eyes. As he finished, he jerked and breathed his last.</p><br/><p>Standing there, Lin Fan was trembling with rage, his eyes shut tightly. The moment he opened his eyes, the skies changed. A never before seen aura erupted from Lin Fan’s body.</p><br/><p>\"Very well, I will let you know what’s a fate worse than death…\"</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>I think this was a pretty emotional chapter. This chapter really brought back the memories of how Saint Devil Sect got destroyed so suddenly. It really went from 0 – 100 in an instant. Wow.</p><br/>\n</div>"}