{"title": "Chapter 233: I See The Future", "id": 233, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-233-i-see-the-future", "volume_title": "Volume 3", "body": "<h1>Chapter 233: I See The Future</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 233: I See The Future</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan was also puzzled by the actions of the young lady from Manhuang Tribe. The treasure she was guarding with her life, she handed it over just like that?</p><br/><p>Lin Fan observed this seed floating gently in the air. It was dark green all over, and there were no sprouts or anything coming out of it. Yet, it contained a boundless amount of lifeforce.</p><br/><p>Lin Fan had only seen a lifeforce like this twice in his life. The first time was the phoenix in Fiery Hell, and this was the second. Comparatively, the lifeforce emitted from this seed was even stronger than the phoenix from back then. The difference was like Heaven and Earth.</p><br/><p>Even though Lin Fan did not know what this seed was, he knew it was bound to be something scary.</p><br/><p>\"I trust you. The holy treasure of my tribe, I’ll hand it over to you for safekeeping.\" Huang Linger’s face blossomed with a sincere smile.</p><br/><p>Lin Fan was really hesitant by now. Just what was this girl up to?</p><br/><p>He had not come across a situation as such.</p><br/><p>Xue Qing was equally stupefied. Just what the hell was going on? The treasure they had been trying to snatch over for so long was handed over to a man just after a few words of his?</p><br/><p>Then what was the point of them fighting so hard for it?</p><br/><p>Lin Fan’s mind was filled with all sorts of thoughts, and he couldn’t grasp any of them to understand the situation. But he knew that one must not live life without guts. Since the other party had already willingly handed it over, if he didn’t take it, he would be wasting this golden opportunity of a lifetime.</p><br/><p>He might as well use the system to check it out. Just what was this thing?</p><br/><p>Lin Fan grabbed hold of the seed in his hand.</p><br/><p>‘Ding…congratulations on discovering Life Seed. (Yet to germinate)’</p><br/><p>‘Life Seed: Possess infinite possibilities…’</p><br/><p>Lin Fan had wanted to depend on the system for analyzing this seed for him to find out just what it was all about. But the analysis by the system had Lin Fan dumbfounded.</p><br/><p>Bloody hell! What was the difference between this description and not saying a single sh*t? Anyone could feel the boundless lifeforce from this seed. And what infinite possibilities? Then what? What was next?</p><br/><p>Lin Fan sighed in his heart, but his outer appearance did not change as he nodded calmly.</p><br/><p>‘This is for the best. A treasure like this would attract only troubles for you guys. When Yours Truly is free, Yours Truly will head over to the Manhuang area and return this treasure.\"\"</p><br/><p>Huang Linger looked at Lin Fan and nodded her head, \"I trust you…\"</p><br/><p>Upon hearing this sentence of ‘I trust you’ once more, Lin Fan was also getting helpless at this girl’s simplicity. What? Yours Truly was a master of trickery! There was no way Yours Truly was ever heading back to you!</p><br/><p>Nodding her head to Lin Fan once more, Huang Linger let out a wide smile and left with her tribesmen. Lin Fan looked at their back view, stunned. That was it? They were gone just like that?</p><br/><p>Equally stunned and confused was Xue Qing. Manhuang Tribe did not want their treasure anymore? If he had not seen the treasure before, he would have thought that this was just a fraud by Manhuang Tribe. But, looking at the item in this man’s hands, he was 100% certain that this was the treasure he had seen before. This was the treasure of Manhuang Tribe!</p><br/><p>A cold breeze blew by as Lin Fan stood there still stupefied.</p><br/><p>Xue Qing looked at Lin Fan speechless. This…this…!</p><br/><p>...</p><br/><p>\"Holy lady, that’s our sacred treasure!\" One of the tribesmen said.</p><br/><p>A smile formed on the side of the young lady’s mouth.</p><br/><p>\"Everything in this world happens for a cause. I have seen the future…\"</p><br/><p>Upon hearing these words from their holy lady, the tribesmen were shocked as well.</p><br/><p>Future…</p><br/><p>\"Holy lady, what does the future hold?\"</p><br/><p>\"The future has no definite shape. It has always been there. As time twists and turn, when you reach that point, that will be the future.\"</p><br/><p>...</p><br/><p>The holy lady’s words were complex and they did not fully comprehend her meaning. But they believed that the holy lady would definitely lead the Manhuang Tribe to their former glory.</p><br/><p>...</p><br/><p>\"This thing here, Blood Kill Sect must definitely have it. Please lay down your terms, sir.\" Xue Qing hurried over, resisting the urge in his heart and instead offered a proposition for exchanging it.</p><br/><p>Lin Fan looked at Xue Qing and let out a smile. He then continued, \"Take out all your storage rings you’re carrying with you. All of you.\"</p><br/><p>\"Sir, that’s all?\" Xue Qing’s face changed immediately, as though he had heard it wrong. Was this man’s demand so simple? This was weird for sure.</p><br/><p>\"Oh? If you guys don’t hand it over then so be it. Yours Truly is leaving.\" Lin Fan turned around without hesitation.</p><br/><p>\"Hold up, sir!\" Xue Qing stopped Lin Fan hurriedly and retrieved the storage rings of his juniors. Even though Xue Qing thought that this man was pretty suspicious-looking, he did not know what his intentions were.</p><br/><p>He then handed all 7 storage rings into Lin Fan’s palms, \"This is all we have, sir.\"</p><br/><p>Looking at these glowing rings, Lin Fan let out a smile of satisfaction. With a sweep of his robes, he kept all 7 into his storage sack.</p><br/><p>\"Alright, you guys can leave now.\" Lin Fan waved his hands as though he was chasing off beggars. This was all going too smoothly for Lin Fan. Without even a single bit of effort, he had gotten everything he wanted.</p><br/><p>Indeed, he was a genius.</p><br/><p>All those people who had to resort to murder and the likes in order to get the valuables of others, they were nothing compared to his ingenuity! As times were changing, the methods of stealing from others had to evolve as well.</p><br/><p>This was an era of using one’s brains.</p><br/><p>\"What’s the meaning of this?!\" Xue Qing was enraged. He realized that he had been fooled.</p><br/><p>\"There’s no meaning to it. Yours Truly is here to teach you guys a lesson in life. It is unethical and shameless to rob others of their belongings. The reason why I have you guys hand over your storage rings is for you to understand the meaning of turning over a new leaf. Don’t think about ascending to the Heavens in a single leap… You gotta pay your dues.\" Lin Fan replied calmly.</p><br/><p>The moment Xue Qing heard this, he was thoroughly incensed. From the very beginning, this man had intended to toy with them!</p><br/><p>\"Damn it! We from Blood Kill Sect are not pushovers…!\" Xue Qing roared. His face was so enraged it was as though he could swallow Lin Fan whole.</p><br/><p>A rush of killing intent shot up into the skies from Xue Qing as a blood mist surrounded his body once more. He was burning livid at this point.</p><br/><p>\"Kill…!\" Xue Qing bit down on his teeth and hissed out grimly.</p><br/><p>The moment Xue Qing said out the word ‘kill’, it was as though time had stopped for the moment. Lin Fan threw out a casual kick at his crotch. Everything came so suddenly, so peacefully, and so calmly, without any signs of foreboding.</p><br/><p>\"AH…!\"</p><br/><p>The cold, angered face of Xue Qing was now covered by a layer of pain.</p><br/><p>\"You…you…!\" His veins and tendons popped out on his body as he stared at Lin Fan with bloodshot eyes. Lin Fan stepped forth and patted him on his shoulders, reminding him gently, \"Don’t bear with it. Shout it out. It’ll feel better that way.\"</p><br/><p>Xue Qing was on the verge of breaking down, but he could only do as Lin Fan said.</p><br/><p>\"ARGHHHHHHHH!\"</p><br/><p>A long howl spread through the skies, vibrating so violently that it was as though the Earth was going to collapse in.</p><br/><p>‘Ding…congratulations on defeating lesser celestial lower level Xue Qing.’</p><br/><p>‘Ding…experience points +2,000,000’</p><br/><p>‘Ding…’Balls Kicking’ leveled up. Level 15.’</p><br/><p>Lin Fan was elated. After all these time, he had finally gotten it up to level 15! He wasn’t too far off from level 20 now.</p><br/><p>\"Sir, this is blatant bullying of us Blood Kill Sect, isn’t it?\"</p><br/><p>Just then, a voice came out from within the voids.</p><br/><p>Lin Fan’s face changed.</p><br/><p>\"Lord Xueshen…!\"</p><br/><p>Just then, spacetime vibrated as a red-haired man descended slowly from the skies. There was a thick, powerful aura of his blood energy rushing forth like a torrent. All the plants and trees in the area seemed to have lost their lifeforce as they withered immediately in the face of this.</p><br/><p>Lin Fan looked at the man who had appeared from the voids. He then grinned cheekily, \"What can you do about it?\"</p><br/><p>RUN…!</p><br/><p>Lin Fan burst off into the distance. The speed of his escape was enough to make anyone’s jaw drop.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Oh by the way Xueshen’s literal translation is Blood God. Cheers!</p><br/><p>Also, in my personal opinion, I think the next 2 chapters are a little longwinded and boring. You might think that it's repetitive, because thats how the raws are. And I think the author himself had readers who were complaining that these were like fillers? But oh well, do bear with me and going on, things will start picking up once more in 236 imo! Cheers!</p><br/>\n</div>"}