{"title": "Chapter 232: I Trust You", "id": 232, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-232-i-trust-you", "volume_title": "Volume 3", "body": "<h1>Chapter 232: I Trust You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 232: I Trust You</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Who’s there!\" Xue Qing’s face was shocked as he shouted out. To think that he had not discovered someone closing in on them. Evidently, this man must be highly skilled.</p><br/><p>\"Blood Kill Sect is handling business. Please give us some face, sir.\" Blood Kill Sect was renowned in the area of 10000 miles around this place. Even though he did not know the owner of this voice, Xue Qing could only hope that he wouldn’t mess things up.</p><br/><p>Huang Linger, the young lady from Manhuang Tribe, was filled with a worried look. They had come to Dongling Continent to retrieve the holy treasure back to their tribe. To think that they would be spied on and ambushed by Blood Kill Sect.</p><br/><p>And to think that at this crucial point of the fight, someone would appear. At this thought, Huang Linger let out a slight smile, but it disappeared as quickly as it came. She was reminded of what the Elders back in the tribe had told her. Dongling Continent was a dog eat dog world where the weak were preyed upon by the strong. No one here was a good person.</p><br/><p>Those bodyguards who had been infused with the energy from the ancient well were now back to their original cultivation bases and looking pale. Apparently, there was a price to pay for that forced boost.</p><br/><p>\"Holy lady, what should we do?\" One of the bodyguards asked softly, troubled in her mind as well. They must have been betrayed by a traitor. Their journey to the Dongling Continent to retrieve this holy treasure was made known to no one. Then how were they halted on their way back by the Blood Kill Sect?</p><br/><p>\"We’ll play it by ear.\" Huang Linger replied warily.</p><br/><p>...</p><br/><p>\"The world is big and vast, but Yours Truly will never give face to anyone.\" Lin Fan’s voice rang over once more.</p><br/><p>The moment Xue Qing heard this, a look of rage flashed on his face momentarily. But, he could only grit his teeth and bear with this humiliation. He would not strike until he found out about this man’s identity.</p><br/><p>Lin Fan’s figure then appeared.</p><br/><p>The Faceless Sky Demon with 3 heads and 6 arms, which was floating behind him in the air while sitting cross-legged, gave the people present a tremendous sense of fear.</p><br/><p>On those three calm and peaceful faces which revealed their demonic natures, the eyelids were twitching nonstop.</p><br/><p>Anger. Hatred. Evil.</p><br/><p>These three faces represented all the negative emotions of this world. But what these guys were even more fearful of was the fact that beneath this phantom demon was a human figure.</p><br/><p>Hands behind his back, he walked with grace and elegance along with a smile on his face. The aura he carried was worlds apart from the demon right behind him.</p><br/><p>\"Just who is this?\" Xue Qing was deep in his thoughts while thinking about something. Dongling Continent was a large place. Therefore, it was natural that he did not know everyone within it. However, this phantom demon behind that man was materialized from a mental cultivation skill by a certain sect. But just which sect possessed such a skill? This was extremely troubling for Xue Qing.</p><br/><p>Just as Xue Qing was deep in his thoughts, Huang Linger took a look at who it was that had come. Those frowned and worried eyes of hers changed into a different sort of glow.</p><br/><p>And it wasn’t a glow of shock or fear. It was a glow of surprise.</p><br/><p>If Lin Fan had noticed this glow, he would have definitely thought to himself deeply why the girl was so attracted to him at first glance. Could she be captivated due to his unique demeanor and aura?</p><br/><p>Just then, Lin Fan continued walking forward gracefully, bringing with him an aura of benevolence and compassion. His face reflected a nature so warm that if snow were to drop on him right now, it would be instantly melted due to his radiance.</p><br/><p>Toggling between his Stealth only served to amplify Lin Fan’s mysteriousness.</p><br/><p>When Xue Qing and gang looked at Lin Fan, they were shocked as well. Just what sort of techniques was he using that he was completely undetectable? There wasn’t even a single ripple in the air to give off any hints of his strength.</p><br/><p>\"Could I know who this honorable sir is?\" Xue Qing stepped forth and asked, his eyes filled with caution.</p><br/><p>Blood Kill Sect HAD to get their hands on the treasure in Manhuang Tribe’s hands.</p><br/><p>Lin Fan looked at Xue Qing. He could sense the thick smell of blood from this man. It seemed like he had killed tons of people. And actually, Lin Fan could ascertain the fact from this man’s killing aura as well. It seemed like his main intention of cultivating martial arts was for the sole purpose of murder as well.</p><br/><p>Blood Kill Sect?</p><br/><p>This sect too was documented within Glory Sect’s records. Blood Kill Sect was the vilest and evilest sect in the entire Dongling Continent. They did not have a fixed location for the sect, rather their base just comprised of a secretive building.</p><br/><p>But nobody knew where the building was located. Even in Glory Sect’s records, there was no indication of their location.</p><br/><p>Blood Kill Sect’s way of life was to kill, and they were vicious in their methods. Be it martial artists or mere mortals, for the sake of riches and interests, they would kill anyone in their way.</p><br/><p>\"Yours Truly is just a mere man who has traveled along the face of this Earth. When I come across injustice, I step in to resolve it. So, why have you guys been fighting? Why don’t you tell Yours Truly about it?\" Lin Fan smiled gently, giving off a gentle and soothing aura. Anyone who felt this aura would feel at peace and warm.</p><br/><p>But to Xue Qing, this was a dangerous and deadly aura.</p><br/><p>\"Insolent! Who are you to step into Blood Kill Sect’s affairs!\" One of the Blood Kill Sect disciples shouted out.</p><br/><p>As he lashed out, his eyes were filled with killing intent.</p><br/><p>Xue Qing did not move or respond to this development. It was as though he was waiting to see what would happen. He could not tell anything about this man’s strength. The only thing he could guess was his age.</p><br/><p>Upon hearing these words, Lin Fan’s face did not change. He was neither worried nor angry as he continued smiling gently, \"Strong killing intent there. You need to calm down.\"</p><br/><p>Xue Qing’s face changed. He could not believe what had just happened.</p><br/><p>The moment Lin Fan raised his finger gently, his Sword Will materialized multiple long swords out of thin air. They darted towards the disciple and pinned all 4 limbs of his onto the ground.</p><br/><p>Beads of sweat began to drop from Xue Qing’s forehead. That was a pericelestial full cultivation disciple. But without breaking a single sweat, the other party had him taken down with ease. This man was nothing to be scoffed at.</p><br/><p>The other Blood Kill Sect disciples did not dare to make a move at this point. Looking at what happened, all of them were in a state of shock as well.</p><br/><p>Even if their Senior Brother Xue Qing were to head up, he might be taken down in one swift strike.</p><br/><p>\"Alright, alright. Everyone just calm down. Yours Truly has come in the name of resolving this issue, and I’m not out to take anyone’s lives. Now, this young lady from the Manhuang Tribe, how about you place your treasure with Yours Truly. With that, the Blood Kill Sect will no longer have a reason to fight you guys for it. Now, something like robbing others of their stuff is really unethical and shameless, you know?\"</p><br/><p>Xue Qing did not say anything, but he was smirking in his heart. This guy ahead of him was simply dreaming! To have the Manhuang Tribe hand over their holy treasure to him just like that? Who did he think he is?</p><br/><p>But he had to see how the Manhuang Tribe members would react to this.</p><br/><p>After Lin Fan said these words which only fools would agree to, the Manhuang Tribe members were on their toes as well. They immediately shielded Huang Linger behind their backs. To think that this man was here for their holy treasure as well. Indeed, the Dongling Continent was just filled with greedy people.</p><br/><p>Looking at the scene, Xue Qing laughed out as well.</p><br/><p>But something changed.</p><br/><p>Huang Linger pushed away her bodyguards gently. She then walked in front of Lin Fan and hummed gently. A green glow appeared on her chest and under its guise, a weird looking seed flew out of her body.</p><br/><p>\"This is our holy treasure. I trust you.\"</p><br/><p>...</p><br/><p>‘What?!?’ Xue Qing was flabbergasted. He had not expected that somebody of the Manhuang Tribe would hand over the seed so easily. This was unbelievable!</p><br/><p>Looking at the seed, Xue Qing’s eyes were filled with thirst and greed. He wished to snatch it over at that instant. But considering the strength of this man before him, he controlled his impulse.</p><br/><p>Lin Fan was astonished as well. He had not expected the other party to be so decisive about it. Just what was going on?</p><br/><p>Could it be that she was really charmed by his charisma?</p><br/><p>But that was not right. He knew that he couldn’t possibly be this charming. But Lin Fan warned himself in his heart to maintain his composure. He must not let anything let slip.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hahaha hello guys. Don’t ask me why the ‘Faceless Sky Demon’ skill can summon a 3 headed 6 armed demon. The author just made it work like that hahahaha. Cheers!</p><br/>\n</div>"}