{"title": "Chapter 239: Earthshattering Secret", "id": 239, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-239-earthshattering-secret", "volume_title": "Volume 3", "body": "<h1>Chapter 239: Earthshattering Secret</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 239: Earthshattering Secret</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>A building stood towering mightily, reaching into the clouds. It appeared and changed repeatedly within the void. One moment it was standing at the peak of a volcano, and the next, it appeared in the middle of a sea of blood.</p><br/><p>This building was like a mirage. Even if it were seen by mortals, they would have thought that they’d seen wrongly as it would have disappeared in the blink of an eye.</p><br/><p>The building had 12 levels. On the highest level…</p><br/><p>A man was kneeling and trembling before a person clad in black robes wearing a ghastly looking mask.</p><br/><p>The 12th Level was the most mysterious place in Blood Kill Sect. After all, this was the peak of Blood Kill Sect.</p><br/><p>Even though one could not see the emotions beneath the masked man, one could feel that he was filled with anger from the rapid vibrations and tremors of the void around.</p><br/><p>The masked man stretched out his hand. To think that the hand hidden beneath the black robes would be so delicately smooth and snow white. He pinched Xue Qing’s chin gently as those eyes beneath the mask emitted a bright red glow.</p><br/><p>Xue Qing was trembling nervously, large beads of sweat dripping down from his forehead.</p><br/><p>In front of this man, Xue Qing felt as though his entire heart had been seen through. There was no secret which could be hidden from this man.</p><br/><p>\"Hehe…\" The masked man’s voice was deep, like the calling of a demon from the 9th level of hell. As he swept back his robes, Xue Qing, who was kneeling on the ground, disappeared into thin air.</p><br/><p>\"Interesting…\" An aperture in the void appeared before the masked man. Gradually, the man entered the void and disappeared.</p><br/><p>Xue Qing felt as though he had traveled through the boundaries of hell. Opening his eyes and looking at his surroundings, he found himself on the 1st Level.</p><br/><p>\"Sir…\" A disciple nearby greeted him.</p><br/><p>Xue Qing wiped the sweat from his forehead and nodded gently. Facing the Level Master of the 12th level, Xue Qing felt as though he had entered the depths of the 9 hells without a single room for resistance.</p><br/><p>No one in this world had seen the true appearance of that level master. In fact, no one had even seen him strike. But no matter who it was, even if it were the level master of the 11th Level, everyone would tremble uncontrollably before him, unable to make eye contact with him.</p><br/><p>It was as though the person beneath the mask was not a human, but a God, and all of them were ants to that fact, helpless against him.</p><br/><p>But Xue Qing gripped his fists tightly. As long as the 12th level’s level master took action… that guy would definitely stand no chance.</p><br/><p>Even though Xue Qing did not know of Lin Fan’s true strength, he knew that Lin Fan was a dangerous presence. The only chance at vengeance was to report this to the great lord.</p><br/><p>But Xue Qing’s task at hand right now was to take control of the 1st Level. Ever since his father’s death, there had been many eyeing the position of level master. He had to take them all down…</p><br/><p>...</p><br/><p>Next day…</p><br/><p>After the downpour, the forest let out a refreshing smell of nature. The bright morning sun shone, as though purging all the darkness away.</p><br/><p>Lin Fan was waving goodbye to these two people with a smiling face. In that emotional gaze was a look of reluctance. After a night of contemplation, Lin Fan finally gave up on the thoughts he had.</p><br/><p>He did not know what the cultivation base of the man in the shadows was. But for the sake of his own safety, this was a gamble he shouldn’t take.</p><br/><p>\"Farewell.\" Xia Youtian placed his palm over his fists and bid Lin Fan goodbye.</p><br/><p>On the other hand, He Yuhan revealed a wide, knowing smile to Lin Fan as they left. Those bright, deep eyes of hers sparkled as though she had seen through Lin Fan entirely.</p><br/><p>\"Where should we head to…\" After leaving the cave, Xia Youtian sighed.</p><br/><p>\"Brother Xia, we can try out with this place.\" He Yuhan took out a map and pointed at it.</p><br/><p>Looking at the map, Xia Youtian was taken back momentarily, but he eventually nodded his head.</p><br/><p>\"Brother Xia, that person just now wasn’t a good man. You mustn’t sleep so deeply again next time, alright?\" He Yuhan smiled like a blossoming flower.</p><br/><p>\"I think he was pretty decent, isn’t he?\" Xia Youtian shrugged.</p><br/><p>He Yuhan smiled and did not reply.</p><br/><p>...</p><br/><p>After they went on their way, Lin Fan continued along. He was quite a distance from the Dead Demon Seas. He was quite a distance away from Glory Sect too. It seemed like it wouldn’t be so easy getting back to the sect from here on.</p><br/><p>Sigh! He wondered how his fourteen Sand Bandits were doing. But with their brains, they shouldn’t starve to death.</p><br/><p>What about that pseudo male Liu Linfeng he had trained up? How was he?</p><br/><p>Thinking about this, Lin Fan’s heart was filled with melancholy.</p><br/><p>Far from the Qinshen dynasty, he entered a patch of danger grounds. Lin Fan could sense the aura of multiple beasts in the area. Some were strong while others were weak.</p><br/><p>Along the way, Lin Fan had been contemplating about two things in his mind.</p><br/><p>1st was the Life Seed. Lin Fan had explored it thoroughly. Other than the fact that its lifeforce was boundless, he couldn’t get to do anything else with it. He wondered what it was actually used for.</p><br/><p>And the 2nd was the Blood Sea skill. Even though this was a corrupted skill, one could not deny the merits of cultivating it up to a high level.</p><br/><p>Rebirth through just a drop of blood, that was a power countless of people would die for. But he wondered if it were for real. Even Xue Shen may not have reached that level of power.</p><br/><p>GRAWRH.</p><br/><p>Just then, in a forbidden area of the place, a beast stood before Lin Fan’s path while blocking him.</p><br/><p>This beast was muscular and broad. Thick scales lined its back as it stood on all fours. It was like an alligator, and its eyes were filled with a murderous look.</p><br/><p>Boom! Boom!</p><br/><p>The earth shook as the beast tilted on one side and stomped down heavily on its two feet, releasing a vibrating roar across the place.</p><br/><p>\"Die…\"</p><br/><p>Lin Fan jumped towards the beast barehanded, carrying boundless amount of energy in his palms for this karate strike towards the forehead of the beast.</p><br/><p>The gigantic beast opened its mouth, revealing its teeth that were ready to chomp down on Lin Fan’s hands.</p><br/><p>But in that instant, all of its teeth shattered.</p><br/><p>BAM!</p><br/><p>The beast collapsed onto the floor with one slap on its skull.</p><br/><p>‘Ding…congratulations on defeating pericelestial middle-level beast, Steelback Crocodile.’</p><br/><p>‘Ding…experience points +100,000.’</p><br/><p>‘Ding…congratulations on obtaining 1 drop of Steelback Crocodile Essence Blood.’</p><br/><p>...</p><br/><p>Lin Fan could not care much about trash beasts like these. The experience points he needed now to level up was 700,000,000, and he was only halfway there. Experience from trash beasts like this Steelback Crocodile was just a drop of water in an ocean.</p><br/><p>But just then, Lin Fan realized that the essence blood of the Steelback Crocodile seemed to be attracted to him.</p><br/><p>Immediately, the thought of Blood Sea hit Lin Fan’s mind.</p><br/><p>Could a beast’s essence blood be of use?</p><br/><p>After failing to level it up through sitting down and cultivating, Lin Fan thought that this skill could only level up using human blood and was intending to give it up.</p><br/><p>Even though the benefits of Blood Sea were extremely attractive, there was no way Lin Fan would hunt humans for their Essence Blood just for this.</p><br/><p>Lin Fan beckoned and curled his finger as the drop of blood flew towards him. Hesitating for a split moment, Lin Fan swallowed it.</p><br/><p>The essence blood of a beast was not meant to be directly consumed by a human. Even though one would enter a beast like state and turn powerful after consuming it, the impact on one’s body would be extremely heavy, unless it had gone through some sort of processing.</p><br/><p>The moment the essence blood entered Lin Fan’s body, the system rang immediately. But Lin Fan did not bother about it and started channeling Blood Sea.</p><br/><p>Lin Fan felt as though multiple blood lines were spreading out through his body. These lines were like the tentacles of an octopus, surrounding the essence blood and sucking on it.</p><br/><p>‘Ding…Blood Sea. Experience points +100.’</p><br/><p>...</p><br/><p>Lin Fan opened his eyes and revealed a smile of satisfaction. Within those calm eyes of his, a bright sparkly lit up, as though he had just discovered an earthshattering secret.</p><br/><p>‘Here comes Yours Truly…!’</p><br/>\n</div>"}