{"title": "Chapter 240: Chicky, I Choose You!", "id": 240, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-240-chicky-i-choose-you", "volume_title": "Volume 3", "body": "<h1>Chapter 240: Chicky, I Choose You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 240: Chicky, I Choose You!</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan was overwhelmed. To think that the perfect outcome he had thought about in his head would actually work out with the essence blood of beasts. This was an extremely easy task for Lin Fan.</p><br/><p>But the thing that bothered Lin Fan was the fact that the essence blood from the Steelback Crocodile had only given him 100 experience points.</p><br/><p>Would the experience points change depending on the cultivation bases of the beast?</p><br/><p>Lin Fan took out Chicky from his storage. The moment Chicky came out, he spread his wings and cried out loudly. He enjoyed the fresh air of the outside world.</p><br/><p>Patting Chicky on the head, Lin Fan said gently, \"Chicky, gimme a drop of your essence blood.\" Even though Chicky was still a youngling, a drop of essence blood shouldn’t be too much of an issue for him.</p><br/><p>But just then, something shocking happened. The once lively Chicky toppled over and collapsed, tilting his head. But those little claws of his still gripped Lin Fan’s robes so that he did not fall over to the ground.</p><br/><p>‘You…you…!’ Lin Fan did not know what else to say. This bl*ody Chicky! No matter how Lin Fan shook him, he would not wake up as though he was dead. Sticking out his pink tongue, it was as though he had truly died.</p><br/><p>\"Alright, fine fine. I don’t want it anymore. Stop pretending.\" Lin Fan did not know what else to do with Chicky. To think that this was the rebellious nature of an uneducated kid. Lin Fan was speechless.</p><br/><p>And indeed, the moment these words left Lin Fan’s mouth, Chicky regained his lifeforce and energy, hopping around while crying out loudly in joy.</p><br/><p>Lin Fan rolled his eyes and placed Chicky back in his storage.</p><br/><p>\"Fine, seems like there’s only one way about it then. The one thing not lacking in this world is the presence of beasts.\"</p><br/><p>...</p><br/><p>And within that dangerous place, a wolf-like beast was taken down by a single palm of Lin Fan.</p><br/><p>‘Ding…congratulations on defeating precelestial full cultivation beast.’</p><br/><p>‘Ding…experience points +1000.’</p><br/><p>‘Ding…congratulations on obtaining 1 drop of essence blood.</p><br/><p>Lin Fan consumed the blood.</p><br/><p>‘Ding…Blood Sea experience points +80.’</p><br/><p>...</p><br/><p>Lin Fan then continued hunting down some beasts. But Lin Fan gradually realized that not all beasts dropped essence blood. Some beasts, despite being just at the precelestial level, would drop him an essence blood with a kill. But some of them, even if they were pericelestial beasts, might not drop anything post death.</p><br/><p>At the same time, Blood Sea’s experience points depended on the essence blood of the beasts.</p><br/><p>But on the whole, the essence blood provided by precelestial beasts did not differ that much in terms of experience points.</p><br/><p>Same went for the essence blood of pericelestials.</p><br/><p>Seemed like there was a huge amount of essence blood required to level up Blood Sea after all.</p><br/><p>So, what mattered was quantity, not quality.</p><br/><p>Through the day and night…</p><br/><p>A shadow shuttled around the danger grounds, slaughtering countless beasts sadistically.</p><br/><p>With his current cultivation base, Lin Fan would not actively seek out beasts of lesser celestial and above. After all, Blood Sea required quantity and not quality.</p><br/><p>Thus, Lin Fan became the Beast Exterminator. The moment he saw a beast, regardless of cultivation state, he would take them down all the same. The essence blood which he had deemed useless all the way was like precious gems right now.</p><br/><p>If Blood Sea could help someone be reborn just with a drop of blood at its max level, then wouldn’t it be bloody overpowered if Lin Fan could evolve the skill with his system?</p><br/><p>‘Die…!’</p><br/><p>A beast roared with boundless ferocity, but crumbled all the same under Lin Fan’s palms.</p><br/><p>Looking at the massive number of carcasses laying around, Lin Fan revealed a satisfied smile as well. The endless stream of notifications from the system made Lin Fan feel extremely pleased.</p><br/><p>Waving his robes, all the essence blood gravitated towards him as he swallowed all of it in a stream.</p><br/><p>‘Ding…Blood Sea experience points +100.’</p><br/><p>‘Ding…Blood Sea experience points +90.’</p><br/><p>‘Ding…Blood Sea experience points +120.’</p><br/><p>...</p><br/><p>Pleasure! Incomparable pleasure!</p><br/><p>Not only was the skill he was using to kill these beasts leveling up, Lin Fan’s own experience points were jumping as well.</p><br/><p>Coupled with the leveling of Blood Sea, this was killing 3 birds with 1 stone once more!</p><br/><p>Lin Fan only got more enthusiastic as he carried on.</p><br/><p>Roar!</p><br/><p>Just then, the earth shook as a powerful roar vibrated over from a distance.</p><br/><p>Bam! Bam!</p><br/><p>The earth continued to vibrate with every step. The beasts hidden in the surroundings began to raise their heads into the skies and howl as well.</p><br/><p>\"Seems like I’ve attracted the leader of them all.\" Lin Fan stood where he was, observing the distance silently, certain of the fact in his heart.</p><br/><p>The Snarling Bear’s build was large and mighty. Standing on the ground, it seemed to be blocking the sunlight from the skies. How could the beasts in its territory keep dying off like this? These were all its food! If this were to carry on, how would it survive from here on?</p><br/><p>Even though the Snarling Bear was gigantic, it was agile as it raised it’s thick, large hind legs and leaped over a distance towards Lin Fan.</p><br/><p>BAM!</p><br/><p>Dropping from the skies, the Snarling Bear’s landing impact caused a large dust cloud. Seemingly unable to deal with this sudden blow, the ground started cracking. Those eyes of the Snarling Bear were filled with boundless wrath.</p><br/><p>ROAR!</p><br/><p>The Snarling Bear roared in the direction of the small, puny human. The sonic boom whirled around the entire place, as those beasts hiding in the surroundings ran off at sight with their tails between their legs.</p><br/><p>Lesser Celestial Lower Level.</p><br/><p>Lin Fan looked at this ferocious beast. However, compared to the Snow Lion back then, this was way weaker.</p><br/><p>\"Are you trying to bully me with your height?\" Lin Fan raised his head and shouted. The Snarling Bear’s response was a gigantic palm strike in Lin Fan’s direction.</p><br/><p>\"Not bad, not bad. Pretty fierce, aren’t you? Not bad. Yours Truly will play along with you then. Come out, Chicky! You’re up!\" Lin Fan released Chicky.</p><br/><p>The moment Chicky came out, he spread his wings and started crying again form the happiness of being let out once more.</p><br/><p>But his elation lasted for less than a second as he found himself facing a ginormous beast before his small eyes. He froze up. And because he was featherless, one could see all the goosebumps on his skin.</p><br/><p>Chicky flapped his wings and ran behind Lin Fan immediately. He then hugged Lin Fan’s leg with his wings. Looking up with teary eyes, he revealed a look of fear.</p><br/><p>Looking at this, Lin Fan was speechless.</p><br/><p>Bloody hell! How was he so chicken!</p><br/><p>‘Even though the opponent might be a little bigger than you, he’s only a lesser celestial lower level as well! You’re the offspring of an Ancient Beast with the same cultivation level! What are you being chicken about?’</p><br/><p>Lin Fan hooked up Chicky with his finger and faced him. \"You’re saying you’re afraid? What are you afraid of? You’re the descendant of an Ancient Beast! Take out some guts, won’t you?\"</p><br/><p>‘Cuckcuckkoo!’ Chicky flapped his wings frantically, looking at Lin Fan with those same teary eyes. It was as though he was saying, ‘Daddy! The opponent is so big! I can’t beat him!’</p><br/><p>Lin Fan ignored those teary eyes of Chicky as he started swinging his arms. \"Chicky, it’s time for you to show up.\"</p><br/><p>\"My little Chicky, I choose you!\" Just then, Lin Fan shouted loudly and tossed Chicky towards the Snarling Bear.</p><br/><p>‘CUCKCUCKKOOO!!!’</p><br/><p>Flying in midair, Chicky tried to flap his wings repeatedly, hoping to land or something. But those small little featherless wings could not bring about even a single bit force.</p><br/><p>Chicky cried tragically.</p><br/><p>The Snarling Bear roared in Chicky’s direction. The forceful roar caused Chicky to panic in midair. The Snarling Bear then sent his palm flying in the direction of Chicky.</p><br/><p>Terrified, Chicky spread open his wings and stretched out both his claws, all the while crying miserably…</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHA THIS JUST TURNED POKEMON.</p><br/>\n</div>"}