{"title": "Chapter 249: Dead Demon City", "id": 249, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-249-dead-demon-city", "volume_title": "Volume 3", "body": "<h1>Chapter 249: Dead Demon City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 249: Dead Demon City</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The pathway was made up of greenish black tiles, and spanning only a few feet in width. On both sides of the pathway, the water surface was turbulent and ominous. Lin Fan could not shake off the feeling that there was something beneath the surface of the water.</p><br/><p>But of course, that was just an uneasy feeling he had. As for the truth? No one knew.</p><br/><p>\"Make way…make way…!\"</p><br/><p>Just then, a series of ruffled shouts came from the back. Turning around, Lin Fan was shocked momentarily and stepped aside. A fleeting majestic horse carriage passed by him and a series of curses came along behind it.</p><br/><p>\"Hush, that’s the carriage of the Yao Family of the Dead Demon City! Don’t you wanna live anymore?\"</p><br/><p>\"Huh…for real?’\"</p><br/><p>\"Of course! Did you not see the five-clawed emblem at the back of the carriage?!? That’s the coat of arms for the Yao Family!\"</p><br/><p>\"Oh! Wow, I didn’t notice it. Whew, that was a close one!\" A middle-aged man who was carrying a large saber behind his back patted his chest in relief for the close shave.</p><br/><p>Listening to the discussions of these people, Lin Fan’s curiosity grew. Seemed like this Dead Demon City wasn’t that simple after all. But then again, the families who are able to hold a strong footing in a city like this must be far from simple.</p><br/><p>But, Lin Fan wondered if the family had tons of treasures with them. By the looks of the carriage just now, these men didn’t seem to be all that nice.</p><br/><p>Just as Lin Fan approached the city, he was stopped at the gates.</p><br/><p>Looking at the attire of these men, Lin Fan spotted the same five clawed emblem on their clothing.</p><br/><p>\"What?\" Lin Fan asked.</p><br/><p>\"Pay an entrance fee for the city.\" Those two guys guarding the gate while sporting the emblem said haughtily. Some of the people passing by handed them a green glowing crystal around the size of their thumbs obediently and headed in.</p><br/><p>\"What’s up with this?\" Lin Fan asked in bewilderment. He had not seen anything like this before. How was he supposed to obtain one of them?</p><br/><p>\"Shoo shoo! Trying to enter the city without any money? Hmph! Go to the coolie grounds and work as a coolie to earn your entry fee!\" The two men said while shoving Lin Fan away.</p><br/><p>\"Count it on mine.\"</p><br/><p>A white-robed girl appeared before Lin Fan and in her hands was the same green glowing crystal as everyone else. Lin Fan was taken aback. What? Why was this girl here again? Was she following him all the way?</p><br/><p>Even though he did not know what was going on, why waste this opportunity to get in? Despite the woman’s unknown intentions, Lin Fan nodded his head and hastened into the city.</p><br/><p>\"Seems like we’re pretty fated eh? Why’re you here?\" Ye Han asked cheerily while walking beside Lin Fan.</p><br/><p>Lin Fan was feeling a little frustrated now. Had this b*tch taken an eye on him? Lin Fan could not figure out what this woman was up to, but he knew it must definitely be nothing good, so he had to keep his guard up.</p><br/><p>\"Make way!\" Again, Lin Fan heard shouts coming from the back.</p><br/><p>But turning behind, it was a sect this time round. They had brought their disciples and were arguing with the guards over the entrance fee.</p><br/><p>\"Without money, no one can enter the city!\" The guards shouted boldly. So what if these guys were disciples from a sect? That didn’t mean that they could break the rules around here.</p><br/><p>\"Hmph! What money? What’s with this green nonsense. I don’t have it. Make way!\" One of the disciples replied curtly.</p><br/><p>A middle-aged man who was leading the disciples patted down the curt disciples’ hand and said, \"Guys, we’re disciples of the Thousand Dragons Sect. Please give us some face.\"</p><br/><p>\"Thousand dragons or not, I don’t give a shit. Everyone has to pay to get in! Otherwise, head to the coolie grounds to earn your keep!\" The two guards disregarded them entirely.</p><br/><p>The middle-aged man was looking a little infuriated now.</p><br/><p>Lin Fan stopped his footsteps and watched. This middle-aged man’s cultivation base seems decent. Lesser celestial middle level. Lin Fan wondered what would happen.</p><br/><p>\"Do you really refuse our entry?\" The middle-aged man asked coldly.</p><br/><p>\"Yes. No entry.\"</p><br/><p>\"How dare you…\" The middle-aged man struck out. How dare this man be so insolent? They had traveled hundreds of thousands of miles to get over here. They weren’t going to be stopped at the entrance just like this.</p><br/><p>BAM!</p><br/><p>Struck by the middle-aged man, both of the guards flew off without a single bit of resistance.</p><br/><p>\"Hmph. Insolent. Charging money for the Thousand Dragon Sect’s entry.\" Wan Xiangtian snorted coldly.</p><br/><p>\"Enter!\"</p><br/><p>The disciples of the Thousand Dragons Sect laughed heartily at these two tactless guards as they walked in. Bloody hell. Thousand Dragons Sect was a dominant sect. How could they be stopped by just anyone? Their Elder was just giving these guys face by asking politely. Since they refused, they only had themselves to blame for what happened.</p><br/><p>But Lin Fan stood still, waiting to see what would happen next. If the Dead Demon City had a rule of paying entrance fees, then there must be some consequences for not doing so. Otherwise, why would anyone else just pay so willingly?</p><br/><p>And just then, a formidable aura shot out from the skies.</p><br/><p>Lin Fan raised his head and was taken aback. What a strong aura this was! This was definitely a greater celestial at least.</p><br/><p>\"Everyone must play by the rules for entering Dead Demon City!\" Booming from the skies, the voice rang in everyone’s ears a little painfully.</p><br/><p>A gigantic hand came down from the skies. This hand was snow white, and a glowing energy grid chain was coiled around it.</p><br/><p>\"What an energy grid chain!\" Lin Fan exclaimed in his heart. This was the first time he had seen one personally. But that strong pulsating energy being emitted from it couldn’t be wrong.</p><br/><p>And just as Lin Fan was still in a state of shock, the group of people from the Thousand Dragon Sect was held up in the hand like little chicks trapped in a cage. The hand then tossed all of them towards the coolie grounds in the distance.</p><br/><p>The gigantic hand then disappeared, as though nothing had happened at all. But the masses who had witnessed this scene would never forget it in their lifetimes.</p><br/><p>Those people who were here for the first time and were trying to sneak their way into the Dead Demon City all scurried back to the coolie grounds to earn their keep obediently.</p><br/><p>Lin Fan heaved a sigh of relief secretly. Thank goodness he had not resorted to brute strength, or he would have probably suffered the same fate as them.</p><br/><p>But before he made clear of this woman’s identity, he was certain he wouldn’t get too close to her.</p><br/><p>\"Let’s go.\" Ye Han said with a smile on her face.</p><br/><p>Looking at her, Lin Fan was astonished. Just where did this woman come from? To think that she wasn’t nervous in the least bit as though what had happened was extremely ordinary to her.</p><br/><p>Indeed, Dead Demon City was a city that belonged to the edge of the forbidden grounds. It was extremely prosperous.</p><br/><p>Just a quick sweep of his surroundings and Lin Fan could tell that most of the people were martial artists with a cultivation base tagged to them. Even the weakest of them all were postcelestials. Lin Fan could not find anything lower than that.</p><br/><p>This was evidently a city famous for its martial artists.</p><br/><p>\"What was that green glowing crystal?\" Lin Fan asked.</p><br/><p>Ye Han looked at Lin Fan and smiled, ‘That’s the currency of the Dead Demon City, and it can’t be traded anywhere else. Anyone who is here at the Dead Demon City for the first time would have to work for their entrance fees at the coolie grounds.’</p><br/><p>\"Are you familiar with this place?\" This woman seemed more mysterious by the minute.</p><br/><p>\"No, I’m not. Only the sects are familiar with this place. I just happened to have brought some of them around in the past. One thing though, never ever mess with the Yao Family. They are not people who anyone can just offend. Alright, we’ll part ways here. Hopefully, we meet in the future again.\" Ye Han waved her hand and bid Lin Fan farewell.</p><br/><p>Looking at Ye Han’s leaving back view, Lin Fan was extremely puzzled. Just what was this woman thinking?</p><br/><p>Unable to come up with an answer, Lin Fan decided to not rack his brains further and just tour the city.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hi guys! One thing to take note of. The word ‘Yao’ for the family in the city actually means Demon in the raws. But I don’t want to name them as the ‘Demon Family’ because the name would be very misleading in case we have to deal with demons and stuff later on. Cheers!</p><br/>\n</div>"}