{"title": "Chapter 241: Magical Skill", "id": 241, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-241-magical-skill", "volume_title": "Volume 3", "body": "<h1>Chapter 241: Magical Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 241: Magical Skill</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan stared with undivided attention, ‘Chicky! You are the ferocious little bird in Yours Truly’s heart! Your calling is not to act cute and seek attention! Your true calling is to be the ferocious and domineering king of all beasts that you are!’</p><br/><p>‘Do not disappoint Yours Truly!’</p><br/><p>Lin Fan was not a single bit worried about Chicky’s safety. After all, if the descendant of an Ancient Beast were to be killed by any normal beast, there would be no hope left for this world anyways.</p><br/><p>Chicky was frantically struggling midair while the mighty paw of the Snarling Bear looked like impending doom about to turn Chicky into a pancake.</p><br/><p>‘CUCKCUCKKOO!’</p><br/><p>Lin Fan’s jaw dropped.</p><br/><p>The petrified Chicky underwent a change at this very moment. His featherless body began to glow bright red. But it wasn’t flame that was covering him, but an unknown form of energy.</p><br/><p>Even though it looked similar to flames, Lin Fan knew and could feel that it was an entirely different thing altogether. And the thing that had Lin Fan so shocked was that within the red glow, there seemed to be a dragon howling.</p><br/><p>But in an instant, the dragon disappeared as well.</p><br/><p>From Chicky, the red glow expanded out 10 feet wide and exploded outwards, caging the Snarling Bear’s entire body.</p><br/><p>‘Just what is going on?’</p><br/><p>Lin Fan looked at the whole thing stupefied. Where has Chicky gone?</p><br/><p>BOOM!</p><br/><p>The Snarling Bear’s massive body collapsed head front onto the floor without a single wound on his body.</p><br/><p>‘Ding…congratulations on defeating Lesser Celestial Lower Level Beast.’</p><br/><p>‘Ding…experience points +2,000,000.’</p><br/><p>‘Ding…congratulations on obtaining a pair of Bear’s Paws.’</p><br/><p>‘Ding...congratulations on obtaining one drop of Snarling Bear’s essence blood.’</p><br/><p>...</p><br/><p>Lin Fan still stood where he was in disbelief. That was it? The Snarling Bear was down just like that? And HE was the one who received the experience points? What about Chicky!</p><br/><p>Lin Fan broke out of his stupor and searched for Chicky hurriedly.</p><br/><p>Bloody hell! That strike by Chicky was goddamn powerful!</p><br/><p>‘Cuckcuckcuckoo!’</p><br/><p>A series of cries rang out from a distance.</p><br/><p>Lin Fan heaved a sigh of relief and smiled. Chicky was fine.</p><br/><p>A small little bump appeared on the ground as though something was digging through it. And from it burst a little chicken head.</p><br/><p>When Chicky broke out of the ground, he was still bending down his head and shaking uncontrollably. Slowly tilting his head around, he caught sight of the collapsed body of the massive Snarling Bear. The moment Chicky saw this, his eyes flashed brightly.</p><br/><p>Chicky dashed. He dashed and dashed and hopped onto the head of the Snarling Bear. Tossing up his head into the air, raising both wings, he cried out victoriously as though he was at the top of the world, ‘CUCKOOKKOOOOKOOOKOOOO!’</p><br/><p>This was a war cry. He was letting the world know who the best chicken of them all was.</p><br/><p>\"Bravo Chicky, Bravo!\" Lin Fan began a slow clap.</p><br/><p>Chicky hopped down from the Snarling Bear’s head and feet by feet, slowly strutted towards Lin Fan, head held up high proudly.</p><br/><p>Coming before Lin Fan, he crowed proudly once more, ‘CUCKCUCKCUKOOO!’</p><br/><p>\"Cuck your head! Go back inside and lay down!\" Looking at Chicky’s arrogant look, Lin Fan couldn’t help but slap him and toss him back into his storage once more.</p><br/><p>Bloody hell. He didn’t know who Chicky took after to be so arrogant and cocky at such a young age. Did Chicky not know that the Heavens would smite those who were too cocky? Seemed like he had to take Chicky properly into hand from now on.</p><br/><p>But Lin Fan’s evaluation of Chicky was right. Things probably were not as simple as he thought they were. That Phoenix mother of his must have crossbred with some other beast…</p><br/><p>Otherwise, how was it possible that Chicky possessed some magical power other than that of a phoenix…?</p><br/><p>But what Lin Fan did not understand was that the Phoenix was a holy and pure beast. Therefore, it would definitely not breed with just about any other beast. Could it be that Chicky’s mum had gone through a tragic and dark past?</p><br/><p>Thinking back at the gigantic hand from the black vortex back in Fiery Hell, Lin Fan could not help but shudder.</p><br/><p>Could it be a man and beast combination…?</p><br/><p>Oh boy, oh boy, oh boy. The person from the black vortex was a powerful being indeed. To think that he would have such a voracious appetite.</p><br/><p>Lin Fan shrugged and swept his robes, tossing all the items from the Snarling Bear within his storage.</p><br/><p>Seemed like there must be a change on the path of development from here on.</p><br/><p>Even though Chicky’s strength wasn’t THAT strong yet, to be a lesser celestial lower level from birth was still something that was practically impossible in the world of beasts. He wondered when Chicky would finally grow up. Wouldn’t he be outrageous by the time he reached a mature adult state?</p><br/><p>Lin Fan continued trekking forth. After all, the final destination he wanted to arrive at was the Dead Demon Seas.</p><br/><p>Along the way, he had already slain quite a number of beasts and collected a decent amount of essence blood.</p><br/><p>...</p><br/><p>After a night, Lin Fan found a hole in a tree. Sitting cross-legged within it, he began entering cultivation state while swallowing all the essence blood.</p><br/><p>‘Ding…Blood Sea experience points +100.’</p><br/><p>‘Ding…Blood Sea experience points +300.’</p><br/><p>...</p><br/><p>The Snarling Bear’s essence blood gave the most experience points. A full 300.</p><br/><p>‘Ding…Congratulations on leveling Blood Sea.’</p><br/><p>‘Ding…Blood Sea. Level 2. (150/100,000)’</p><br/><p>Lin Fan could feel the blood within his body churning rapidly. It was as though True Energy from the Heavens and Earth had been transfused within him, nourishing every single drop of blood in his body. In fact, Lin Fan could even feel the defensive capabilities of ‘Eternal Demon Body’ steadily rising due to it.</p><br/><p>Blood was the source of the human body. And by the looks of it, Blood Sea was a skill that could cultivate the strength of one’s blood.</p><br/><p>Lin Fan took out his Eternal Axe and made a gentle incision on his fingertip.</p><br/><p>The Eternal Axe was a legendary weapon. Therefore, for it to cut through even his ‘Eternal Demon Body’ was an easy task. And Lin Fan had meant for it, so that he could verify the powers of the Blood Sea.</p><br/><p>Level 1 was just the beginning, allowing one’s blood to be revitalized. Now that he had reached Level 2, he had to see just what sort of miraculous effects there would be.</p><br/><p>Under Lin Fan’s keen gaze, the open wound began regenerating rapidly.</p><br/><p>Even though the pain was still present, as the blood that was oozing out bathed the wound within, its nourishing powers began to heal it back as well.</p><br/><p>Lin Fan chuckled.</p><br/><p>Those people who were trained in Blood Sea so intensely that the stench of blood always surrounded them should have been using the essence blood of humans for themselves.</p><br/><p>Now that he was using the essence blood of beasts, coupled with the help of the system, every single drop of it was absorbed within the Blood Sea skill with his body taking none of it. That should be the reason why he wasn’t suffering from any side effects such as having the blood aura surround him.</p><br/><p>Lin Fan then sat up and continued moving forth.</p><br/><p>Even though Blood Sea was just a Heaven Lower grade skill, Lin Fan had the capabilities of leveling it up indefinitely. He was certain that he could train Blood Sea to a state this world had never seen.</p><br/><p>On his way, multiple beasts fell prey to his hands.</p><br/><p>After all, to these beasts of low intellect, a man who had dared to appear in their territories without any scent of aura was just free food. Or so they thought…</p><br/>\n</div>"}