{"title": "Chapter 246: It Just Wants To Go Home", "id": 246, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-246-it-just-wants-to-go-home", "volume_title": "Volume 3", "body": "<h1>Chapter 246: It Just Wants To Go Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 246: It Just Wants To Go Home</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Green Ridge County…</p><br/><p>\"Please enjoy! These are the finest delicacies we have to offer in Green Ridge County!\"</p><br/><p>On a round table, dishes were lined side by side with countless of them spread out as Xiao Lihai introduced politely.</p><br/><p>‘Cuckcuckoo!’</p><br/><p>Standing on a chair, Chicky observed the food with sparkling eyes. He then hopped up onto the round table, and began pecking around furiously like a drill.</p><br/><p>The table was lined with delicacies made up of extremely rare ingredients.</p><br/><p>For the sake of this chicken before him, Xiao Lihai had thought hard and worked effortlessly to come up with this warm hospitality. If he could entertain this honorable chicken nicely, the godly being should be pleased upon his return as well.</p><br/><p>Even though Green Ridge County did not have many treasures to offer, all they could do was to take care of the godly being’s pet with a sincere and earnest heart.</p><br/><p>If Lin Fan knew that Chicky was having such an extravagant experience right now, he would definitely puke blood. After all, Yours Truly was struggling left and right dealing with the humanoid beast, and this bloody featherless chicken was enjoying a grand feast? Where was his conscience?</p><br/><p>...</p><br/><p>In the forest…</p><br/><p>\"Come! Is that all you’ve got?\" Lin Fan was already slightly dazed from the beating of the humanoid beast. However, he was also extremely pleased with the experience gain that Eternal Demon Body was having.</p><br/><p>BAM!</p><br/><p>Lin Fan was sent flying once more.</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +500,000.’</p><br/><p>Rage, this was all that the humanoid beast had been feeling. Why wasn’t this human going down after everything that’s been sent his way? The humanoid beast arched its head into the skies and howled. This was the most humiliating thing that it had experienced in its life.</p><br/><p>There had never ever been a puny human who could endure its fist in its entirety.</p><br/><p>But to think that this one little man could take so many of it in one go?</p><br/><p>\"Again!\" Lin Fan thumped at his chest and shouted.</p><br/><p>From that thump, Lin Fan could feel that one of his rib bones had been broken. But it didn’t matter, he could still deal with it all. After all, Lin Fan was beginning to fully understand the wonderful effects of Blood Sea.</p><br/><p>Along his way here, he had leveled Blood Sea to Level 3.</p><br/><p>Level 2 involved the rejuvenation of wounds through blood. As for Level 3? Even bones could be rejuvenated.</p><br/><p>Instantly, the bone that was broken cracked back into place under the magical effects of the Blood Sea.</p><br/><p>As it howled, the beast was looking more and more incensed by the moment. If it were capable of human speech, it would have cursed and cussed long ago.</p><br/><p>‘Bloody hell! Why can’t you just f*cking die?’</p><br/><p>At this point, Lin Fan was no longer interested in even trading blows with the humanoid beast. He was just using his body to provoke the beast. Even though it hurt so badly that at one moment, he could feel himself moments away from death, he was eventually revitalized as though nothing had happened.</p><br/><p>The humanoid beast reached out with its gigantic hand and gripped tightly onto Lin Fan.</p><br/><p>The beast howled and yelled as flames surged through its arm. Those black muscles began to expand rapidly and massively. It was determined to squish Lin Fan to death.</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +500,000.’</p><br/><p>\"AH…!\" Lin Fan screamed tragically.</p><br/><p>The moment the beast heard Lin Fan’s tragic cries, it was turned on. Those eyes burned brightly, emitting boundless strength. The cries of Lin Fan had brought to this beast an indefinite amount of motivational energy.</p><br/><p>Squish! Squish! SQUISH!</p><br/><p>\"AHHH…!\" Lin Fan continued screaming.</p><br/><p>But suddenly he looked at the beast straight in the eye, \"Hey brother, could you like, change it up a little? You’ve been squishing for like half an eternity now. It ain’t working man.\"</p><br/><p>The beast who was enjoying squeezing was taken aback at Lin Fan’s apparent lack of injury. Roaring furiously, it released its hands, and the eight tails began whipping Lin Fan in midair, tossing him around, and refusing to let him drop to the ground.</p><br/><p>Slap slap! Slap slap!</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +500,000.’</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +500,000.’</p><br/><p>\"Hey buddy, how about you use your arms too? That would be the perfect combo now.\" Lin Fan remarked casually while popping pills at the same time.</p><br/><p>The beast was really incensed right now. Its heart was burning red with flames, and it had to turn towards the skies to howl and scream. Otherwise, there was no way it could release its current frustration.</p><br/><p>This. Human. Just. Wouldn’t. DIE!</p><br/><p>The beast took its fists and punched Lin Fan in the air nonstop. The void ripped continuously as a strong current destroyed the trees in the surrounding area, creating a devastated empty field around them.</p><br/><p>\"Mmm…nice…!\" Lin Fan shouted out enjoyably while spitting out blood and popping pills at the same time.</p><br/><p>This humanoid beast was like a machine with infinite energy. It was quite nice to know that the strength it was using in its blows did not go down despite the energy toll it was taking on its body.</p><br/><p>‘RAWRGHHHHHHHHHHHHHH!’</p><br/><p>Raising both fists, it pummelled Lin Fan down into the ground. It then pounded the ground repeatedly in anger.</p><br/><p>The Earth shook relentlessly. As though it could not withstand these vicious attacks, the ground gave way and cracked continuously.</p><br/><p>Like a gigolo, Lin Fan laid there peacefully on the ground, awaiting the fists of the beast in pleasure one after another.</p><br/><p>And just like that, time passed by the seconds and minutes.</p><br/><p>Looking at the experience points of Eternal Demon Body climbing consistently to fill up the bar, Lin Fan was excited beyond words.</p><br/><p>...</p><br/><p>Finally, the attacks of the beast came to a stop as it huffed out tufts of white smoke from its nose. Looking at the human buried deep within the collapsed Earth, a smile appeared on its brutish face. This puny human had finally died.</p><br/><p>\"Eh? What’s up? Why did you stop? Continue please.\" Just then, a soft voice rang out from underground. Hearing the voice, the humanoid beast stood there, dumbstruck and trembling slightly in disbelief.</p><br/><p>Lin Fan took a few breaths, and when the fist did not come flying, he climbed out of the deep crater himself.</p><br/><p>Seeing the reappearance of Lin Fan, the beast screamed in anger and with hatred in its eyes, threw yet another punch to send Lin Fan flying.</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +500,000.’</p><br/><p>‘Ding…Congratulations on leveling ‘Eternal Demon Body’. Level 16.’</p><br/><p>‘Ding…Physical Body State upgraded to Lesser Celestial Full Cultivation state.’</p><br/><p>\"Ah…what a wonderful feeling.\" Lin Fan was relishing within this wave of pleasure. ‘Eternal Demon Body’ was inching closer to evolving once again.</p><br/><p>Now that his physical body state had upgraded as well, the beast’s attacks no longer had any effect on Lin Fan anymore. The only thing left to do was to come up with a plan to get close to the beast before rewarding it with a brick.</p><br/><p>But just then, a loud sound came across. Lin Fan raised his head and took a look.</p><br/><p>Holy sh*t. The beast was trying to run!</p><br/><p>The beast slammed its fist on the ground, and a crack opened beneath the surface of the earth. Within that crack, a black light was being emitted, and the bottom surface shimmered like black water.</p><br/><p>Bending down, the humanoid beast got into the posture of a diver.</p><br/><p>It did not want to stay here any longer, not even for a split second more. It wanted to head back home to enjoy life once more.</p><br/><p>But soon, the beast realized that no matter how much he tried, his body was stuck before the gap that had opened in the ground, unable to dive all the way down.</p><br/><p>\"Hey, buddy. You can’t leave, you know? If you were to leave, who am I to look for?\" Lin Fan had made it in the brink of time. Lying flat on the floor, he had managed to pounce forward just in time to hold on to the ankle of the beast with one hand.</p><br/><p>With his other hand, he took out the Nine Five Legendary Brick. \"Come up, and we’ll talk.\"</p><br/><p>The humanoid beast was struggling. It did not want to stay here any longer. All it wanted to do was to leave!</p><br/><p>It had originally thought that destroying a county was such a simple task. To think that it would meet with such a sicko!</p><br/><p>\"Come up. I’ll just say one sentence and you can leave!\" Lin Fan begged. This piece of experience points that was right at his doorsteps mustn’t leave just like this!</p><br/><p>The humanoid beast howled and grasped furiously at the rocks around the gap, trying to dig itself inwards. However, no matter how hard it tried, the human above would not relent nor let go of his grip!</p><br/><p>Just then, something happened. Turning around, the beast used its sharp black claws and severed its leg.</p><br/><p>\"That’s so cruel of you…!\" Lin Fan was stunned. He had not expected this beast to self-mutilate.</p><br/><p>As the beast continued its descent downwards, two streams of fire appeared on the face of the beast.</p><br/><p>These were tears made up of flame…</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHA THE THOUGHT OF THE BEAST’S FACE CRYING I CANNOT.</p><br/>\n</div>"}