{"title": "Chapter 250: This Fart Is Poisonous", "id": 250, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-250-this-fart-is-poisonous", "volume_title": "Volume 3", "body": "<h1>Chapter 250: This Fart Is Poisonous</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 250: This Fart Is Poisonous</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Glory Sect…</p><br/><p>Nameless Peak…</p><br/><p>Lin Fan had been gone for a couple of months now. Nameless Peak, which should have been pretty desolated and lonely, was now bustling with life. One by one, the disciples flowed back and forth with smiles on some of their faces.</p><br/><p>\"This is good stuff! To think that there’s still something like this! This is great!\" A disciple stood in front of a stall and looked at the items on display. Grinning from ear to ear, he took out his money to purchase them.</p><br/><p>\"Sister Gong! I’ve sold all my Candied Hawthorns over there!\" Cai Zhiqiao was carrying her little pouch with the Snow Lion cub in her hand. Both of them had some candy sticking onto the sides of their mouths.</p><br/><p>\"There’s more with your Senior Brother Zhang. Go take them from him, haha.\" And this young woman who was busy over here was none other than Gong Bingye. She was recommending some makeup and beauty products to the female disciples of Jialan Peak.</p><br/><p>\"Orh!\" Cai Zhiqiao wiped her mouth and licked away the candy stains. Hopping along, she hopped to Zhang Ergou and tugged at his sleeves. \"Senior Brother! Give me the Candied Hawthorns!\"</p><br/><p>\"Here you go!\" Zhang Ergou was really busy right now as well as he handed a sack of items to his Junior Sister.</p><br/><p>Cai Zhiqiao happily hopped back to her stall with the sack. Taking out 2 candied hawthorns from it, she took out her little signboard and placed it in front of the stand.</p><br/><p>She then sat on the little stone bench and munched happily on her candied hawthorns; one for her and one for her little Snow Lion cub.</p><br/><p>...</p><br/><p>If Lin Fan were to come back right now, he’d be in absolute disbelief at the sight before him. Was this still the same Nameless Peak of his? Wasn’t this more like a marketplace?!?</p><br/><p>Senior Elder Wuya had brought Gong Bingye up to Nameless Peak for interrogation. Under his watchful eyes, Gong Bingye did not dare to lie and told him everything as it was.</p><br/><p>After a moment of silence, Senior Elder Wuya relented and allowed Gong Bingye to stay on Nameless Peak. But, she couldn’t continue to address herself as Lin Fan’s wife. After all, nothing was settled until Lin Fan’s return.</p><br/><p>But in Wuya’s opinion, Lin Fan had to naturally answer for touching this lovely beauty up and down. But that could only wait till his return as Wuya wondered where that lad had run off to.</p><br/><p>The moment Gong Bingye arrived at Nameless Peak and looked at its desolate state, her brain began to move as she thought up of a small plan and discussed it with everyone around.</p><br/><p>Zhang Ergou’s brain was sharp, so he was naturally the first one to agree with the plan. And with his authority as the Big Disciple, everyone else agreed as well.</p><br/><p>After all, when the Master was not around, everything fell onto the Big Disciple.</p><br/><p>After that, Gong Bingye began to take Mie Qiongqi with her to and fro Glory Sect and Mo City to collect the goods. After all, Mie Qiongqi was the strongest around. With him around, Gong Bingye’s safety was assured.</p><br/><p>And just like that, Nameless Peak began to bustle with life gradually. Many disciples within the sect began to seek Nameless Peak for favors on items found outside the sect, with compensation agreed on beforehand.</p><br/><p>Zhang Ergou and Cai Zhiqiao were especially passionate about these duties. After all, they were more than happy to have Nameless Peak bustling with life. As for Cai Zhiqiao, she could enjoy a boundless amount of candied hawthorn.</p><br/><p>...</p><br/><p>Dead Demon City…</p><br/><p>Lin Fan had stopped before a shopfront.</p><br/><p>This was a medicinal shop. With his forte, Lin Fan naturally had a large number of pills with him. If he didn’t start to exchange some of them for the currency of Dead Demon City, even his basic lodgings and food would become an issue.</p><br/><p>Tianbao Chambers…</p><br/><p>Not bad, a powerful sounding name. Now that Lin Fan was in the Dead Demon City, he wanted to keep a low profile. After what had happened at the entrance, the greater celestial master must definitely be residing within this city. If anything were to screw up, he might be the one with a bad ending.</p><br/><p>\"Guest, would you like to buy anything?\" A shopkeeper of Tianbao Chambers was flipping through the accounts. The moment he saw someone enter, he greeted with a huge smile.</p><br/><p>\"I want to sell some pills.\" Lin Fan said.</p><br/><p>\"Sorry guest, we only sell pills here. We do not buy any in.\" The shopkeeper’s face turned sullen immediately in disappointment, as he went back to sit down and waved Lin Fan away.</p><br/><p>Lin Fan surveyed the streets and looked for another place.</p><br/><p>\"I would like to sell some weapons.\"</p><br/><p>\"Sorry guest, we only sell weapons here. We do not buy any in.\"</p><br/><p>...</p><br/><p>After visiting a few shopfronts, Lin Fan was extremely pissed.</p><br/><p>Bloody hell! Which novel was it that stated that shops would buy in precious items like RPG’s? What a lie!</p><br/><p>None of these shops were taking any items in!</p><br/><p>But then again, how could he blame these shops? After all, these shops were not dumb to begin with. How could they guarantee the quality of these pills that were coming in? Furthermore, to sell the pills of someone else instead of their very own inhouse pills? Why would they do that?</p><br/><p>‘But oh well, forget it.’ Since no one would buy anything from him, Lin Fan had no choice. Yours Truly had to resort to robbery once more.</p><br/><p>Lin Fan then strolled around the streets, casually looking for a good target.</p><br/><p>\"Ahh, young girl! Would you like to be my partner? Hehehe…\" An evil laughter rang into Lin Fan’s ears. Without having to even look at the source of the voice, Lin Fan was sure that the owner of the voice must be extremely shameless.</p><br/><p>Heading towards the direction of the voice, Lin Fan found a young man indeed with a few lackeys following behind him.</p><br/><p>They had bumped into a female martial artist and were flirting with her.</p><br/><p>Lin Fan observed carefully.</p><br/><p>Pericelestial Lower Level.</p><br/><p>Not bad, not bad. With a cultivation base like that, Lin Fan’s attempts were bound to succeed.</p><br/><p>But the young man’s clothing had Lin Fan hesitating for a moment. Even though he was simply dressed, the five-clawed emblem on his back did spell quite a bit of trouble.</p><br/><p>Seemed like this man was from the Yao Family.</p><br/><p>Even though Lin Fan did not know what the Yao Family was capable of entirely, he knew that the gigantic hand at the entrance must definitely be from the Yao Family.</p><br/><p>After all, the Dead Demon City did not have any other powerhouse other than the Yao Family. Therefore, it wasn’t that difficult to guess the source of the gigantic hand.</p><br/><p>Even though the female martial artist who was being flirted with by this young man was much tougher than the man himself, she did not dare to retaliate. The young man just sniggered evilly while he looked for a new target.</p><br/><p>The other martial artists in the area were also cowering in silence against the emblem on his clothing.</p><br/><p>Lin Fan followed behind this man and sized him up along the way. Bloody hell, wasn’t this guy’s clothing extravagant? It was filled with the five-clawed emblem from head to toe, as though he was afraid no one would recognize it.</p><br/><p>\"All of you guys wait outside. I’ll go relieve myself.\" Yao Wuxie waved off his lackeys. \"Yes, that’s right. Further off, don’t come so near now.\"</p><br/><p>\"Yes, young master!\"</p><br/><p>The chance was here.</p><br/><p>After following this guy for quite some time, Lin Fan was extremely excited right now. This was the chance he had been waiting for, when this guy was finally alone.</p><br/><p>\"Hehehe time to relieve myself.\" Yao Wuxie sniggered while taking off his pants and squatting down happily, shaking his head in ecstasy.</p><br/><p>Even though Yao Wuxie was a useless trash of the Yao Family, but so what? He could still have the time of his life out in the city.</p><br/><p>Using stealth, Lin Fan entered the toilet as well. Looking at this guy squatting down happily, Lin Fan was pretty elated as well. Good target, good target.</p><br/><p>POOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT!</p><br/><p>Yao Wuxie’s face was flushed red as a long and blaring fart with an extremely high pitch rang out. This was a perfect chord.</p><br/><p>A yellow smoke surrounded the entire toilet from top to bottom.</p><br/><p>\"That’s…good...ahhhh…\" Yao Wuxie let out a face of drunken pleasure. That was so bloody comfortable.</p><br/><p>As for Lin Fan who had just stretched out and was about to strike, his face changed into a look of disbelief.</p><br/><p>\"This fart is…poi…sonous…\"</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hi guys! Candied Hawthorns are a traditional sweet snack made by the Chinese! You guys can google to see how it looks like! Cheers!</p><br/>\n</div>"}