{"title": "Chapter 264: Finally, Immortal Lin Fan", "id": 264, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-264-finally-immortal-lin-fan", "volume_title": "Volume 3", "body": "<h1>Chapter 264: Finally, Immortal Lin Fan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 264: Finally, Immortal Lin Fan</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>As the legend went, there was a bird. It flew far across the nine skies. It would never land on anything other than parasol trees, nor feed on anything other than bamboos. It would land once every 500 years.</p><br/><p>And on that day of landing, it would be the day of Nirvana.</p><br/><p>Through each Nirvana, it would have to endure a trial of fiery flames and death.</p><br/><p>But after every Nirvana, its feathers would be ever more luscious, its voice ever crisper, and its spirit even more vigorous. And when it spread its wings up into the skies once more, it’s dazzling brilliance would light up the entire world.</p><br/><p>Phoenix’s Nirvana… Rebirth through flames.</p><br/><p>What was left of Chicky was a mix of meat and blood, lying quietly still. The patches of blood were bright red like burning flame.</p><br/><p>Suddenly, the blood seemed to have come alive. Like little flame pixies, they danced around and encased Chicky’s body, as though the blood was praying to a long forlorn God.</p><br/><p>The sounds of water flowing could be heard… when suddenly, the blood ignited. These flames which were filled with lifeforce covered Chicky’s body.</p><br/><p>Burning, burning. It was as though time and space itself were being burnt away by these flames.</p><br/><p>The flames continued burning as Chicky’s body was gradually enclosed within a red shell that was hard like a rock. Even though the shell continued burning, the flames seemed like they could be extinguished at any moment.</p><br/><p>The Phoenix’s Nirvana was filled with boundless lifeforce. But Chicky’s Nirvana seemed to be filled with unstable lifeforce, as though it would end at any moment.</p><br/><p>Within the Heaven and Earth Smelt…</p><br/><p>The gigantic arm was now just like an illusion, a puff of black smoke dancing in the smelt, making its last struggle against the smelt’s powers.</p><br/><p>As for Lin Fan, his physical body had already disintegrated entirely. The only thing left of Lin Fan was a single blood red heart thumping on the floor of the smelt.</p><br/><p>What Lin Fan did not expect was that at the brink of Saint Devil Sect’s destruction back then, the Grandmaster had injected a drop of his godly consciousness blood into Lin Fan’s body.</p><br/><p>It was floating gently above Lin Fan’s heart right now. A distant ancient power served as a slight membrane, covering Lin Fan’s heart and preventing him from dying off entirely.</p><br/><p>However, even though the glow of the blood was brilliant, it was also gradually falling apart against the power of the smelt.</p><br/><p>Besides the heart, an illusory figure sat there silently. This was the remnant of Lin Fan’s consciousness.</p><br/><p>\"Chicky…\" This figure was lamenting tragically.</p><br/><p>Suddenly, a mysterious feeling surged through Lin Fan’s heart. He could feel Chicky’s lifeforce from outside.</p><br/><p>Phoenix’s Nirvana... Rebirth through flames.</p><br/><p>But Chicky’s lifeforce was feeble and weak, unable to sustain a rebirth at all. That small little flame on Chicky’s shell danced dangerously on the edge, barely able to maintain its sustenance.</p><br/><p>Just then, the red thumping heart jumped slightly with a flame dancing on it. This was the flame of ‘Pills Through Thought.’</p><br/><p>\"Chicky, hold on till you get a new master…\" Lin Fan mumbled deeply. The flames of Pills Through Thoughts floated up gently, ignoring the boundaries of the Heaven and Earth Smelt. It passed through the walls and replaced the dying flames on Chicky’s shell with its eternal burning sustenance.</p><br/><p>...</p><br/><p>The black arm was at the edge of its life as well. But Lin Fan knew that the only way to destroy this thing was to hold on and die along with it.</p><br/><p>The only things going through his mind right now were memories, all the dreams he had about becoming Number one in this world and the likes of it. But it was all too difficult…</p><br/><p>‘Smelt…’</p><br/><p>Suddenly, everything in the Heaven and Earth Smelt was in a state of chaos.</p><br/><p>There was no light.</p><br/><p>No flames.</p><br/><p>Nothing.</p><br/><p>It was as though everything had reverted to the very beginning of chaos.</p><br/><p>‘Ding…’Eternal Demon Body’ experience points +1,000,000,000’</p><br/><p>‘Ding…’Eternal Demon Body’ Level 18.’</p><br/><p>‘Ding…’Eternal Demon Body’ Level 19.’</p><br/><p>‘Ding…’Eternal Demon Body’ Level 20.’</p><br/><p>‘Ding…Congratulations on evolving ‘Eternal Demon Body’ to ‘Eternal Immortality’.’</p><br/><p>‘Eternal Immortality: The strongest body cultivation skill. Transfiguration of the physical body, unbounded by any laws of Heavens and Earth.’</p><br/><p>‘Ding…Congratulations on leveling physical body state to Greater Celestial Lower Level.’</p><br/><p>...</p><br/><p>Within the chaos, drops of fresh blood began to seep into it. The black mist of the gigantic arm smelted was seeping into it as well. Those golden miniature words floated within it, and as though attracted by this mysterious force, danced happily.</p><br/><p>Once more, the Heaven and Earth Smelt came into sight.</p><br/><p>A single strand of hair floated silently within the smelt.</p><br/><p>The hair was glowing radiantly.</p><br/><p>Suddenly, warmth erupted from the hair. As though it possessed a life of its own, it started growing more and more.</p><br/><p>1 strand, 2 strands, 3…it grew and grew.</p><br/><p>A strand of hair to grow it all.</p><br/><p>A head.</p><br/><p>A body.</p><br/><p>Two arms.</p><br/><p>Two legs.</p><br/><p>A heart.</p><br/><p>‘Ba-bump. Ba-bump.’ The heartbeat resounded in the Chaos.</p><br/><p>The figure that had appeared sitting cross-legged within the smelt was Lin Fan. He was naked, with smooth, jade-like skin. His skin shone with a beautiful glow and shimmered amazingly.</p><br/><p>As though it had obtained a new life, the black mist culminated into an arm once more. But that arm was no longer black. It was glowing red, and gradually, it entered Lin Fan’s right arm.</p><br/><p>That drop of godly consciousness blood turned into a sea of blood and entered Lin Fan’s bloodstream, becoming one with his own blood.</p><br/><p>Just then, a golden light streaked by as well. Those golden miniature words swirled repeatedly. Finally, they lined up in a row and imprinted themselves on Lin Fan’s back.</p><br/><p>‘Ding…Right hand transformed: Eternal Arm.’</p><br/><p>‘Ding…Fused with Firmament’s Blood.’</p><br/><p>‘Ding…Fused with Heaven and Earth Sutra.’</p><br/><p>...</p><br/><p>After an extremely long time, those shut eyes of the figure opened abruptly. A golden light shot out, causing the Heaven and Earth Smelt to vibrate gently.</p><br/><p>‘I’m…not…dead?’</p><br/><p>Lin Fan checked out his surroundings warily and exited the Heaven and Earth Smelt. Looking at the familiar environment, his spirit surged instantaneously.</p><br/><p>\"Yours Truly is not dead!\" Lin Fan shouted excitedly. His right fist gripped especially tightly.</p><br/><p>BAM! BAM!</p><br/><p>Suddenly, the void broke apart. A current of energy surged from within.</p><br/><p>Lin Fan jumped in shock.</p><br/><p>\"What the sh*t is going on…?\" Thinking that the black arm was still alive, Lin Fan checked his vicinity suspiciously.</p><br/><p>But everywhere else was silent and peaceful. Lin Fan raised his right hand. Even though it looked exactly the same as before, it felt somewhat different.</p><br/><p>Lin Fan raised his hand slightly and drew a line in the air with his finger.</p><br/><p>Something horrifying happened.</p><br/><p>The void where he had drawn a line ripped apart immediately and disappeared.</p><br/><p>\"HOLY F*CK!\" Lin Fan could only use these two meaningful words to express his feelings at that point in time.</p><br/><p>Just then, Lin Fan suddenly recalled... Chicky! He looked around frantically.</p><br/><p>Finally, he caught sight of a ball of fire burning around nearby.</p><br/><p>‘Chicky…!’ Lin Fan looked at the red shell within the flames, feeling extremely anguished.</p><br/><p>\"Chicky, don’t die on me…\" Lin Fan raised his right hand and wiped a tear off his right eye.</p><br/><p>BAM!</p><br/><p>The void ripped apart once more. A current of energy swirled crazily in the place where his right hand was. Lin Fan was stunned beyond words. What the f*ck? He had destroyed the void by just simply raising his hand. This…this…!</p><br/><p>But Lin Fan did not have time to think about it anymore, as he used his left hand to fondle the shell in the flames.</p><br/><p>\"Chicky, you’ve died a tragic death…\" Lin Fan cried to the egg. \"But don’t worry, I’ll always remember your glorious final image…\"</p><br/><p>Just as Lin Fan was crying, a sound came out of the red shell.</p><br/><p>‘Cuckcuckoo…!’</p><br/><p>This sound was somewhat unhappy, somewhat helpless, somewhat sorrowful.</p><br/><p>\"Chicky, you’re not dead…!\" Lin Fan’s heart leaped in joy.</p><br/><p>‘Cuckookoo!’</p><br/><p>Once again, the shell rang out as though saying, \"Hurry up and save me out! I’m alive! But I don’t have enough lifeforce! I’ve got a birth defect! I can’t break myself out of here!’\"</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHA and there we have it ladies and gentlemen, a satisfactory completion of yet another arc I’d say. It seems like the mystery’s starting to deepen as to all these mysterious beings but our dear Lin Fan had received yet another round of powerup! Pretty excited to see what this brings about next!</p><br/><p>Oh but do stay on, because the author himself had this comment in the raws, ‘Finally, our boy is immortal! But if any reader who doesn’t want to follow on from here on because of this, it’s okay but please don’t flame me. After all, we’ve had a good ride all the way till now.’ I don’t think he would be so confident if he didn’t have more things up his sleeves. Furthermore, the novel received extremely great reviews all the way till it’s ending chapter in the thousands. So I believe we’re just at the beginning of it all. Cheers guys!</p><br/>\n</div>"}