{"title": "Chapter 271: Yours Truly is Not Afraid Of Touching!", "id": 271, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-271-yours-truly-is-not-afraid-of-touching", "volume_title": "Volume 3", "body": "<h1>Chapter 271: Yours Truly is Not Afraid Of Touching!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271: Yours Truly is Not Afraid Of Touching!</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan did not care what body part the stone coffin contained. Now that he had fused with the Eternal Arm, he would wallop the sh*t out of this thing.</p><br/><p>If the left arm came out, he would whack it till Parkinson’s Disease looked like a joke.</p><br/><p>If it were either of the legs, he would cripple it so badly it would have to remain in a wheelchair for life.</p><br/><p>If it were a head? Hoho, that was where the fun would start. Hanging it up and punching it against a wall continuously for 3 days and 3 nights.</p><br/><p>\"Get the f*ck out! Stop hiding in the stone coffin and causing all this bullsh*t!\" Lin Fan roared with the demeanor of a powerful man. All the disciples of the six sects were invigorated by this roar as well. Even though what happened earlier on had them somewhat conflicted, they could not help but applaud for this man right now.</p><br/><p>Lin Fan side-glanced at these disciples and said coolly, \"Don’t worry, Yours Truly will ensure that you guys live. Before Yours Truly leaves this place, no one can take away your lives before Yours Truly.\"</p><br/><p>The moment Lin Fan finished, his words raised torrents of emotions within the hearts of these disciples as they shed tears of gratitude.</p><br/><p>Even though this man had killed the elder of the Roc Sect, they were starting to realize that perhaps he wasn’t all that bad after all. In fact, he was actually kinda cute.</p><br/><p>That was right, cute… He was a cute and powerful person!</p><br/><p>The disciples of the six sects then huddled together and gathered behind Lin Fan. Lin Fan then beckoned to the stoned head of the Yao Family, indicating for him to hurry up and come join the others. The coffin was not something he could handle, so he should join the other disciples and hug onto Lin Fan’s thighs while he still could.</p><br/><p>Just then, the surrounding was filled with an eerie silence as the floating stone coffin gave off an immense pressure. Looking at this man who was standing up for them alone, the Roc Sect disciples were pretty conflicted as well.</p><br/><p>This was a powerful man with a weird temperament.</p><br/><p>\"Well, to be honest, we can’t blame this man. After all, we were the ones who had wanted to kill him to snatch over his treasure.\" One of the disciples whispered.</p><br/><p>\"Yeah, that’s right. YOUR Elder Wang was the man who struck first. This powerful man had no choice but to retaliate. It’s just unfortunate that things had to end up that way y’know.\"</p><br/><p>...</p><br/><p>Other than the Roc Sect disciples, the disciples of the other sects started whispering amongst themselves. They had had a 180-degree change of heart towards Lin Fan.</p><br/><p>As for the Roc Sect disciples? They were rendered speechless by the arguments of the others. In fact, some of them were even agreeing silently within their hearts on how much sense it made…</p><br/><p>Looking at the stone coffin, Lin Fan was suppressing a seeping fear against it. Just what existed within?</p><br/><p>A gentle creak permeated through the air as the lid of the coffin moved slightly.</p><br/><p>BAM!</p><br/><p>Suddenly, the lid shot up into the skies as black smoke gushed out from within.</p><br/><p>The black vortex in the skies was still rumbling. The frightening strength of the vortex coiling around the coffin was still sending shivers down everyone’s spines.</p><br/><p>Lin Fan swallowed his saliva. He couldn’t help but admit that the entrance of this thing was pretty intimidating.</p><br/><p>Focusing his gaze, Lin Fan sought to remember this scene for future references.</p><br/><p>An entrance like this could not only give one a feeling of dread, it could bring about a feeling of mysteriousness as well. If it weren’t so creepy, perhaps this entrance might just have scored full marks for style points.</p><br/><p>The stone coffin was filled with a murky black smoke. No one could tell what the actual situation was inside. But everyone could feel with their senses that a vile and maleficent demon was lurking in the midst of it.</p><br/><p>A strange object began to take shape from within the coffin.</p><br/><p>Before they could clearly make out what it was, Lin Fan did not want to make any guesses.</p><br/><p>But if he had to give an answer just based on this small little image, he would say that it looked like an elephant’s trunk. There was a thin line in between that circular snout like thing, and energy surged back and forth as though it was air breathing through.</p><br/><p>Could it really be an elephant’s snout? How else would it be this long?</p><br/><p>Dong! Dong!</p><br/><p>Suddenly, weird noises came out of the coffin. Everyone was puzzled. Just what sort of creature was it for such a weird sound to be produced?</p><br/><p>Even though they were shocked, all the disciples stared at this scene with intense focus. They wanted to see the true appearance of this weird thing.</p><br/><p>Just then, two round things appeared.</p><br/><p>Lin Fan retreated a few steps back. While trembling, he lifted his hand and shot out his middle finger, shivering. He wasn’t shivering in fear or shock. He was just rendered speechless, so much so that he had to express his emotions through the middle finger.</p><br/><p>This…this was…!</p><br/><p>Lin Fan had thought of multiple possible outcomes... but not this.</p><br/><p>Pitch black... Long length... Thick girth.</p><br/><p>Two gigantic balls, smooth and round, fully black... From time to time, they would bounce against each other, giving off a gut smashing sound.</p><br/><p>Lin Fan was not the only stunned person. The other disciples were all watching with their jaws agape.</p><br/><p>How…could this be…?</p><br/><p>Lin Fan’s right hand shuddered. Unconsciously, the hand rubbed against his crotch portion. The hand seemed to remember this feeling.</p><br/><p>Could this be the legendary…’Eternal Donger’?</p><br/><p>This…this terrifying sight…!</p><br/><p>At the point of Eternal Donger’s appearance, the heavens and earth changed color. The Dead Demon Seas roared, the waters gushed, raged, and turmoiled. Everything seemed to have been shocked by this Eternal Donger.</p><br/><p>Lin Fan did not know what to do.</p><br/><p>But the Eternal Donger did not wait. Without any further nonsense, it struck.</p><br/><p>The Heavens seemed to have been shred apart by this thing, as a gigantic shadow like a spear dashed down towards Lin Fan, bent on destroying every single thing in this world.</p><br/><p>With a single flick of the spear, the heavens shook and the earth shuddered.</p><br/><p>\"Powerful man…save us!\" All of the disciples were scared sh*tless at this seemingly unstoppable force. Even Yao Tian’s face was extremely pale and white as well.</p><br/><p>\"Old Master, save me…!\"</p><br/><p>The truth was, before the arrival of everyone else, the old master of the Yao Family had already hidden himself in the void around the area. He wanted to increase the chance of them getting them the treasure if things boiled down to a fight for it. But now that things had come to this…</p><br/><p>No matter how much Yao Tian cried, the void remained silently still.</p><br/><p>The Old Master had long been scared trembling within the void.</p><br/><p>What a horrifying turn of events this day turned out to present!</p><br/><p>In fact, this Eternal Donger was giving him a lot of pressure as well. If he were to just pop his head out right now, perhaps the void containing him might even be ripped apart by the force of this thing as well.</p><br/><p>Lin Fan took in a deep, long breath of cold air. What to do now? What was he to do?</p><br/><p>This was the Eternal Donger they were up against! Should he really just touch it with his right hand?!</p><br/><p>The thought of it had Lin Fan cringing.</p><br/><p>Descending from the skies, the voids on both sides of the Eternal Donger was compressed into chaos, as they were ripped down along with it as well. It was as though the entire Dongling Continent was about to be ripped into two.</p><br/><p>Fighting against the turmoil in his heart, Lin Fan eventually shouted out.</p><br/><p>\"Your mother! Yours Truly is afraid of neither the Heaven nor Hell! Do you think the thought of touching a donger would scare off Yours Truly?!?\"</p><br/><p>Lin Fan’s eyes shone with resolution as an incredible force erupted from his body as well.</p><br/><p>As for the remaining disciples, they were like a tiny boat in the face of a tsunami, ready to topple with the crashing waves at any moment from the clash of these two powerful forces.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHAHAHAHAHA OMFG. OF ALL THINGS. WOW. I AM. WOW. THIS NOVEL CERTAINLY DOESN’T FAIL TO IMPRESS. WE’RE BACK BOYS, FINALLY. WE’RE BACK IN BUSINESS.</p><br/><p>Also, thanks for your support guys! I'm sorry I have to use this column instead of replying my thanks to you guys one by one because there's simply too many for me to do that! I wasnt really that bothered with his comments but I was pretty pleasantly surprised to see all of your reassuring thoughts! Thank you so much hahaha!</p><br/><p>Drama's over! Time for me to go back to translating more chapters HAHA.</p><br/>\n</div>"}