{"title": "Chapter 283: So Bedazzling, So Outstanding.", "id": 283, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-283-so-bedazzling-so-outstanding", "volume_title": "Volume 3", "body": "<h1>Chapter 283: So Bedazzling, So Outstanding.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 283: So Bedazzling, So Outstanding.</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>The moment Lin Fan raised his hand, the sky changed color, and the clouds above his arm started to clear. In their places, lightning now rumbled and crackled loudly.</p><br/><p>Lin Fan looked up, somewhat stunned. What the heck?</p><br/><p>Was this damaged Eternal Arm really so strong that just a simple lift could cause the sky to ripple?!?</p><br/><p>The Moon Palace Sect disciples were equally stunned as well. Why were the skies suddenly filled with lightning and thunder?</p><br/><p>Even the Jiuxiao Sect disciples were shocked by this sudden change. Why had the bright clear skies suddenly changed so drastically? Furthermore, the skies were frighteningly dark. Those streaks of lightning were thick and massive, as if they were filled with immense energy!</p><br/><p>\"Hmph. For a shameless disgrace of the sect like you, Yours Truly shall summon down the smiting thunderbolts from the Heavens to discipline you well!\" Lin Fan hollered. As he twisted his palm the other way around, the thunderbolts in the skies swam down like dragons and coiled themselves around his palms.</p><br/><p>Sizzle sizzle.</p><br/><p>The glow was so bedazzling that everyone was captivated by it. Could the phenomenon that was happening the skies right now truly be created by this man alone?</p><br/><p>Feng Xiaoling was thoroughly stunned as well. This was way too surreal. How could he be this strong? He didn’t seem to be this strong back at the Genius Sparring!</p><br/><p>Could it be that Senior Brother Lin was trying to save face for Jiuxiao Sect back then, hence, he did not strike down Senior Brother Xinfeng intentionally?</p><br/><p>The more he thought about it, the more possible it seemed. Feng Xiaoling’s could only look at Lin Fan with an ever-growing respect.</p><br/><p>To think that Senior Brother Lin had not unleashed his full fighting power back then. If he had done so, Senior Brother Xinfeng would certainly have been defeated thoroughly.</p><br/><p>...</p><br/><p>Lin Fan did not know of all these conclusions that Feng Xiaoling had jumped to in his mind. But if he knew about it, he would definitely be proud of Feng Xiaoling.</p><br/><p>\"How could this be…!\" Li Tianxing’s face took a sharp change. That palm of Lin Fan possessed too much power. He could clearly feel it, and all he could think was to run away.</p><br/><p>Looking at the fear on Li Tianxing’s face, Lin Fan could only laugh coldly.</p><br/><p>\"Too late…\"</p><br/><p>BOOOOM!</p><br/><p>An impossibly strong palm strike crushed down from the Heavens without any hesitation.</p><br/><p>The earth shuddered under this palm strike. Lin Fan had not expected the Eternal Arm to be this strong. Seemed like there’s a lot more he had yet to find out about this arm.</p><br/><p>‘Ding…congratulations on defeating lesser celestial middle-level Li Tianxing.’</p><br/><p>‘Ding…experience points +30,000,000’</p><br/><p>...</p><br/><p>‘Trash.’</p><br/><p>Lin Fan cursed in his heart. What could this meager amount of experience points do for him!</p><br/><p>On the other side, everyone stared at the scene with their jaws agape.</p><br/><p>Flicking his robes, Lin Fan came to the side of the Moon Palace Sect disciples.</p><br/><p>Mu Han had not expected this man to be this terrifying. She had witnessed with her very own eyes that devastating power that was emitted from that single palm strike.</p><br/><p>Furthermore, that lightning and thunderbolts were enough to send one’s heart into a frenzy by just looking at them. To think that this man could contain that very power within his palms.</p><br/><p>Even her own Grandmaster may not be able to withstand the blow from that single palm strike!</p><br/><p>\"Are you alright?\" Lin Fan asked calmly without any change in his expression. In the eyes of the Moon Palace Sect disciples, this man was extremely different from all the other men they had met. He didn’t lust after their appearances.</p><br/><p>\"We’re fine, just that we’ve been paralyzed by that man’s poison and we do not have any idea how to recover from it\"’ Mu Han heaved a sigh of relief. By the looks of it, they had gotten out of their present predicament at least.</p><br/><p>\"Senior Brother Lin, this the Bone Softening Poison that Li Tianxing specializes in. Without the antidote, even a lesser celestial full cultivation being would need two whole hours before he can regain his strength.\" Feng Xiaoling ran over from a distance. He had to start explaining things lest Senior Brother Lin continued to misunderstand him.</p><br/><p>\"Hmph.\" Lin Fan shot Feng Xiaoling a cold glance as he pulled out his right hand. A flame danced within his palm as all sorts of medicinal herbs flew within and began to mix together.</p><br/><p>\"You think that crooked methods as such would daunt someone like me?\"</p><br/><p>Lin Fan had to continue to strut some skills, bringing the atmosphere to a new high.</p><br/><p>Feng Xiaoling stared at what was happening speechless, as though his mind had been glued together. What was that flame dancing in his palms? Could Senior Brother Lin also be an expert in cultivating pills?</p><br/><p>This was just unimaginable!</p><br/><p>Not only was Senior Brother Lin strong in fighting, these pill cultivating skills seemed to be well-honed as well. This was practically impossible for mere mortals to achieve such level of efficiency!</p><br/><p>Even though Li Tianxing knew how to create poison as well, that was just a mere side ability of him learning poison-related skills. It was nothing compared to the art of cultivating pills!</p><br/><p>Mu Han could not find any words to say either at this marvel. She had never heard of anyone cultivating pills through a palm’s flame before! Even though she wasn’t well versed in the art of pills cultivation, she had seen her master do it. But it was nowhere as simple as the way this man was doing it right now.</p><br/><p>Before every session of pills cultivation, her master had to be well prepared mentally with extreme focus.</p><br/><p>In her master’s own words, ‘The best way to ensure good results is when one’s state is at its peak.’</p><br/><p>But this man before her had just broken every single knowledge or rule she knew about cultivating pills the traditional way.</p><br/><p>And just then, the flame within Lin Fan’s palm gave a slight tremble.</p><br/><p>One by one, pearl-like white pills flew out from within the flames.</p><br/><p>\"Some simple antidote pills I’ve created here. Go consume them, and you guys should be fine.\" Closing his palms, the flame disappeared.</p><br/><p>Mu Han could only stare at Lin Fan in disbelief. So fast?!? Time had barely even passed from when he started cultivating them!</p><br/><p>This…this…!</p><br/><p>A fear slowly rose within Mu Han’s heart. This man was way too terrifying!</p><br/><p>Everyone was fed the pills one by one and slowly, and the antidote spread, releasing them from the grip of the poison.</p><br/><p>\"What a powerful pill!\" Mu Han muttered to herself under her breath.</p><br/><p>Feng Xiaoling was in a daze as well. From the moment Senior Brother Lin started cultivating these pills, he was already awe-inspiring. But this was simply out of the world.</p><br/><p>\"Senior Brother Lin…\" Feng Xiaoling began.</p><br/><p>\"Hmph. I told you to stop calling me Senior Brother Lin. I don’t have a Junior Brother like you.\" Lin Fan flicked his robes. That evil hating look of his was best performed right now.</p><br/><p>The Moon Palace Sect disciples were placing an extremely high valuation on Lin Fan as a man.</p><br/><p>Righteous.</p><br/><p>Evil hating.</p><br/><p>Powerful.</p><br/><p>Filled with authority in his sect.</p><br/><p>Handsome.</p><br/><p>Outstanding aura.</p><br/><p>And above all that, he was extremely young.</p><br/><p>These were basically all the perfect conditions for a Prince Charming!</p><br/><p>The female disciples of Moon Palace Sect lowered their heads and blushed deeply. How could they be entertaining such wrong thoughts? But even so, this was probably the last chance for their Big Senior Sister!</p><br/><p>Well, Big Senior Sister, hmm...</p><br/><p>She was pretty strong.</p><br/><p>Beautiful as well.</p><br/><p>Humungous b*obs.</p><br/><p>Great figure.</p><br/><p>And furthermore…furthermore…</p><br/><p>All of the female disciples turned their gazes at their big senior sister and gave a knowing grin.</p><br/><p>At first, Mu Han did not know why her junior sisters were looking at her. But suddenly, it hit her as her cheeks flushed red as well. She gave them a stern look, warning them to act appropriately and not think astray.</p><br/><p>Mu Han stole a peek at that outstanding Lin Fan and shook her head.</p><br/><p>A man like him was like the moon in the skies, bright and dazzling. Even though she might feel a small crush towards him right now, one needed to know their place in life and not reach for things they could not ever hope to attain.</p><br/><p>Suddenly, Feng Xiaoling hurried to talk.</p><br/><p>\"Senior Brother Lin, you’ve got to listen to me, please. Fine, I won’t call you Senior Brother, but you’ve got to hear me out. Senior Brother Lin, please hear my explanation. I really need to explain…!’</p><br/><p>Feng Xiaoling truly wept this time round. Clutching onto Lin Fan’s robes, his face was filled with tears. Couldn’t he just hear him out once?</p><br/><p>\"Hurry up.\" Lin Fan shrugged his hands.</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHHA finally Feng Xiaoling gets to talk HAHAHA. I’m starting to feel like the author placed him here just for comedic purposes.</p><br/>\n</div>"}