{"title": "Chapter 285: What A Marvellous View", "id": 285, "volume": 3, "url": "http://boxnovel.org/the-strongest-system-chapter-285-what-a-marvellous-view", "volume_title": "Volume 3", "body": "<h1>Chapter 285: What A Marvellous View</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 285: What A Marvellous View</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Just as the name indicated, the Moon Palace Sect was located at a place like the moon itself.</p><br/><p>A gigantic crescent moon shaped rock floated in the skies. The rock was tens of thousands of feet wide, and on it, the sect was erected like a heavenly palace on the moon.</p><br/><p>The palace stood in the middle of four great waterfalls. Gushing down with torrents, it was loud and majestic to look at. At the base of the waterfalls, mist filled the area with water droplets sprinkling everywhere.</p><br/><p>With the Moon Palace Sect right in the midst of all that, it was like a sight of Heaven down on earth, picturesque and beautiful.</p><br/><p>At this moment, however, the 4 waterfalls gave off a gentle glow as they flowed and formed a protective bubble over the Moon Palace Sect, protecting it within.</p><br/><p>A group of people was gathered where that shimmering protective barrier was set up.</p><br/><p>\"Hmph… Seems like the Moon Palace Sect has some tricks up their sleeves indeed. This Milky Way Cloud Formation does seem to offer some resistance.\" An old man stood within the void, clad in black robes. His face was wrinkled and looked like an evil yaksha. Filled with thick red veins that twisted and contorted on his face, one might not be able to tell that this was a human unless they looked carefully.</p><br/><p>This old man was none other than that malicious demon of a man, Li Yuanqi. Even though he did not know why the Grandmaster let him out of jail, he could not be any happier anyways.</p><br/><p>The current Grandmaster of Jiuxiao Sect was his Senior Brother after all. Furthermore, both of them were trained by the very same master. Dozens of years ago, for the sake of mastering that dark art, he had laid waste to ten cities, with corpses ending up everywhere. Rivers and mountains were painted red with the blood of the innocents.</p><br/><p>Unable to defeat his Senior Brother, he was eventually taken down and sentenced to an eternity in the sect’s jail.</p><br/><p>But the moment he saw his Senior Brother who had come to retrieve him, he couldn’t help but chuckle. Seemed like that self-righteous man had eventually descended down the dark path as well.</p><br/><p>\"Old lady Yue Xuan, stop these feeble attempts, will you? Just give up and surrender. At least, I’ll allow your sect’s disciples to be my slaves for generations to come, so that I can pick up some easy Yin energy from them.\" Li Yuanqi laughed maniacally while floating in the void. This maniacal laughter permeated the layers of void down into the Moon Palace Sect.</p><br/><p>In the main seats of the formation within the sect, four old ladies sat there cross-legged. Their True Energy vibrated as the Energy Grid Lines channeled from them into the core of the formation.</p><br/><p>\"And Jiuxiao Sect dares to call themselves a great righteous sect, when they’re doing such atrocities such as destroying the sects of others!\" The current Grandmaster of Moon Palace Sect, Old lady Yue Xuan, shouted. Even though her lips did not move, the sound boomed out in everyone’s head.</p><br/><p>\"HAHA! It’s survival of the fittest after all. I shall not waste any more of my breath on you. We’ll see how long your Milky Way Cloud Formation can last!\" With a frenzied laughter, Li Yuanqi flipped his palm in the skies, causing countless ghastly skulls to appear. Howling and opening their black mouths, they started devouring the protective barrier.</p><br/><p>Each time the protective barrier trembled, the four old ladies sustaining the core of the formation turned paler.</p><br/><p>The strongest fighting strength of the Moon Palace Sect were only these four greater celestial upper levels. This was all they could do now: channeling the Milky Way Cloud Formation to protect the sect for now.</p><br/><p>This Milky Way Cloud Formation was a skill passed down from the Founder Ancestor of Moon Palace Sect. Making use of the channeled True Energy from four sources in four directions, a protective bubble could be formed.</p><br/><p>These four waterfalls surrounding the sect served as the medium of the formation to channel the True Energy out.</p><br/><p>Even though they were only of a greater celestial upper-level cultivation base, they could at least defend against Li Yuanqi’s brutal strikes with their protective bubble. However, if Mu Han did not manage to find any reinforcements by the time they were exhausted, that could very well spell the end of the Moon Palace Sect.</p><br/><p>\"Old lady Yue Xuan, I know that you’re waiting for reinforcements from that disciple of yours! But what a pity, I’ve already sent my men to get them. They should be dead along the way by now.\"</p><br/><p>\"There are only nine other sects in a radius of ten thousand miles. Do you really think that these nine sects would dare to send anybody up against me?\" Li Yuanqi’s voice was grim and foreboding. The moment he opened his mouth to speak, a thick blood mist came out from within.</p><br/><p>Evil spirits squirmed and howled within that blood mist, malevolent and horrific. This was the result of Li Yuanqi’s mindless slaughter of innocents.</p><br/><p>Some of the Jiuxiao Sect disciples standing behind Li Yuanqi laughed manically as well. The others could only frown, apparently feeling uneasy towards this situation as well.</p><br/><p>Thinking back to their teachings back at Jiuxiao Sect, the scene they were witnessing right now was just a downright mockery of everything they had ever known.</p><br/><p>But none of them would dare to raise any dissent. After all, they had seen a number of their own brothers devoured whole by Li Yuanqi’s unholy skill, without even a single scrap left of them.</p><br/><p>Even though they hated this situation, they were powerless against this man.</p><br/><p>\"Senior Elder Li, once we break through into their sect, could you gift us those dainty and delicious looking female disciples?\" A Jiuxiao Sect disciple who reeked of malice asked thirstily, as he gulped in hunger while looking at those young, petite female disciples.</p><br/><p>\"Naturally.\" Li Yuanqi gave off yet another frenzied laughter. Those eyes of his shone brightly with a blood red hue. He was certain of taking down Moon Palace Sect easily.</p><br/><p>They didn’t have much time left.</p><br/><p>Those nefarious disciples looked at the females down there with desperate gazes as well. How should they play with these delicious preys later on?</p><br/><p>The tension was high within the Moon Palace Sect as well. This was the first time these female disciples were faced with something so horrifying. Some of them were so scared they were sitting down on the ground helplessly while others were just crying out.</p><br/><p>Secluded from worldly affairs, naturally they could not grow up without any conflict.</p><br/><p>The Founder Ancestor of the Moon Palace Sect had a rather tragic life herself. Suffering from a lifetime of humiliation and bullying, she decided to end her life by committing suicide into a river. However, on that fateful day, a beam of light descended from the skies and entered her body.</p><br/><p>From that moment on, the world had lost a suffering and bullied pitiful girl. In her place, the world gained a peerless empress.</p><br/><p>Ever since she founded the sect, she offered a path forward for women to join. However, she laid down a single rule as well, which was that the sect must never interfere with the affairs of the world.</p><br/><p>\"Fellow sisters, do not worry! Big Senior Sister has gone out to look for reinforcements! We’ll definitely tide through these difficult times!\" A female disciple stood out from within them.</p><br/><p>Even though her eyes were filled with fear as well, she knew that she had to do something to calm the nerves of her fellow sister disciples.</p><br/><p>And indeed, her words allowed some of the timid junior sisters to calm down.</p><br/><p>\"Old lady Yue Xuan, there’s a limit to my patience! I’ll give you ten breaths to decide! Otherwise, I’ll spare nothing within your sect, not even the animals!\" Li Yuanqi commanded grimly.</p><br/><p>His patience had been worn thin by this Milky Way Cloud Formation, and he was nearing the end of his limits.</p><br/><p>The four old ladies looked at one another and nodded their heads. Spitting out a drop of essence blood each, the essence blood fused together and entered the core of the formation.</p><br/><p>The barrier grew even brighter and stronger.</p><br/><p>However, the four old ladies were now trembling and desperately holding on with their final bit of strength.</p><br/><p>\"Hmph. How dare you?\" Li Yuanqi was enraged. His black robes expanded as a rain of blood descended from the skies.</p><br/><p>Twelve Energy Grid Line chains surrounded his body.</p><br/><p>\"Energy grid of the blood, energy grid of the demons, energy grid of kill…rain blood from the skies!\"</p><br/><p>A sea of blood covered the skies, packed tightly with vengeful spirits howling and dancing within.</p><br/><p>\"Suppress…\"</p><br/><p>BOOM!</p><br/><p>Everything shook, as the four mighty waterfalls crumbled, and the protective barrier of the Moon Palace Sect shattered.</p><br/><p>\"Not good…\" The faces of the four old ladies were ghastly. To think that Li Yuanqi was this strong!</p><br/><p>\"Know your places. I was only playing around with you guys. Do you really think that I have no way of dealing with you guys?\" Li Yuanqi laughed out hysterically.</p><br/><p>\"All of you, go! Everything in the Moon Palace Sect belongs to us!\" Li Yuanqi commanded from the skies.</p><br/><p>\"HAHA! Dainty ladies, here we come!\" Some of the Jiuxiao Sect disciples who had been imprisoned laughed, as they turned into streaks of light, dashing into the midst of these helpless sheep.</p><br/><p>The female disciples were totally stumped by now. Crying themselves silly, their helpless screams filled the skies as they struggled futilely. But to these demonic disciples, the more these girls struggled, the more turned on they got.</p><br/><p>Some of the other Jiuxiao Sect disciples could only stand there and turn their heads away, unable to bear this scene before them.</p><br/><p>The evil disciple who rushed ahead targeted a female disciple and laughed heartily. Descending from the skies, his malicious hand reached out.</p><br/><p>When the targeted female disciple saw that malevolent face of his, she could only cry in fear, \"Senior Sister, save me…!\"</p><br/><p>The four old ladies of the Moon Palace Sect closed their eyes shut at this sight. They had tried their best, but still, they could not protect the sect.</p><br/><p>And just then, a bright and clear voice permeated the skies.</p><br/><p>\"Sword Will, fill the skies!\"</p><br/><p>The moment the four old ladies heard this voice, they looked into the distance. These horrified female disciples looked into the distance as well. But when they saw what it was, they were extremely astounded as well.</p><br/><p>All they saw in the distance skies was the distortion of the void, as a boundless Sword Will shot over from the edge of the skies.</p><br/><p>In the middle of the Sword Will was a man, walking calmly through the skies, hands behind his back. The Sword Wills shot out from beside this man, covering the entire skies.</p><br/><p>That was not all. A gigantic three-headed and six- armed demon floated behind this man. Those three faces carried Malevolence, Benevolence, and Anger.</p><br/><p>The female disciples could only stare fixedly at this scene.</p><br/><p>His long hair dancing in the wind.</p><br/><p>That resolute look on his face.</p><br/><p>That gentle walk.</p><br/><p>That overpowering aura.</p><br/><p>These girls were intoxicated. This was the most charming and handsome sight these girls had ever seen.</p><br/><p>\"Someone like you is unbearable for the Heavens and Earth. You ought to die…\"</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>This was a long chapter guys whew. Took me forever to finish this gosh.</p><br/>\n</div>"}