{"title": "Chapter 306: Shooting Keeps You Healthy", "id": 306, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-306-shooting-keeps-you-healthy", "volume_title": "Volume 4", "body": "<h1>Chapter 306: Shooting Keeps You Healthy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 306: Shooting Keeps You Healthy</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Jiuxiao Sect was not the only sect in the far western side of Dongling Continent. Big or small sects, they numbered several dozens. The leader of all of them at one point, Jiuxiao Sect had lost every last bit of control.</p><br/><p>To think that they didn’t even have a single powerful being to reign in these guys. It was a terrible plight that Jiuxiao Sect was in.</p><br/><p>Now that the time was opportune, all the resources and land previously owned by Jiuxiao Sect looked so alluring and tempting to the other sects.</p><br/><p>That was clearly ‘taking someone’s life while they’re sick.’</p><br/><p>Even though they wouldn’t go to the extent of destroying Jiuxiao Sect entirely, wasn’t it too much to exploit them into giving up everything now that they were defenseless?</p><br/><p>Survival of the fittest indeed. Jiuxiao Sect had reigned as the overlord for a long period of time, and while they had the chance, everyone wanted to snatch over that position.</p><br/><p>The moment all of these sects heard of the news about Jiuxiao Sect’s situation, they gathered to come up with a plot to overthrow it.</p><br/><p>Finally, the seat of the overlord of the sects in the far west was up for grabs.</p><br/><p>However, some of the Grandmasters of smaller sects were worried. They questioned, \"Everyone, Jiuxiao Sect’s ally is the great Glory Sect. Would we get into trouble for doing this?\"</p><br/><p>‘HAHA! Don’t worry about that. Do you guys know why Jiuxiao Sect is in this desolate state right now? Let me tell all of you. The reason behind Jiuxiao Sect’s fall is because they attacked Glory Sect! From Han Yongyi down, all the Senior Elders have perished in the hands of Glory Sect. With that said, do you guys think that Glory Sect are still allies with Jiuxiao Sect?\"</p><br/><p>\"Furthermore, I’ve heard news that the Peak Master of Glory Sect’s Jialan Peak had died in the war as well. These two sects are most likely filled with hatred for one another right now!\" One of the Grandmasters laughed cheerily.</p><br/><p>Upon hearing this, everyone else was reassured immediately. This was a fine piece of meat that was dangling right in front of their mouths right now! If they gave up on this, the same opportunity might not present itself again!</p><br/><p>After that, they began discussing how to split up Jiuxiao Sect’s resources amongst themselves. To them, Jiuxiao Sect was already dancing in the palms of their hands.</p><br/><p>...</p><br/><p>Glory Sect…</p><br/><p>\"Holy sh*t…HOLY SH*T!\" Looking at the bright and dazzling treasures, Lin Fan gulped his saliva down.</p><br/><p>The number of treasures right now was blinding his eyes indeed.</p><br/><p>Lin Fan casually picked up a murky black rock.</p><br/><p>‘Ding…congratulations on discovering Extinguishing Rock.’</p><br/><p>‘Extinguishing Rock: Possesses the essence of energy grid lines. Able to increase the speed in which one cultivates energy grid line chains.’</p><br/><p>To think that even such an unseemly item was so precious! Lin Fan could not help but feel impressed with Glory Sect’s wealth.</p><br/><p>‘This seems like a pretty decent item indeed. Now that Mie Qiongqi’s a greater celestial, this should give him a nice boost.’</p><br/><p>Just as Lin Fan was about to place the Extinguishing Rock into his storage, a shadow flashed by.</p><br/><p>Suddenly, the Extinguishing Rock flew out of Lin Fan’s hands as well.</p><br/><p>\"Who are you? Why are you here at the treasure vault?\" Just then, the treasure guardian spirit floated gently in midair, looking at Lin Fan warily. To a treasure guardian spirits, anyone who entered a treasure vault with a purpose of not depositing an item was definitely a bad person.</p><br/><p>‘You’re the treasure guardian spirit around here?\"\" Lin Fan glanced at him. Why the hell did he look the exact same as Jiuxiao Sect’s treasure guardian spirit? Could these guardian spirits all look the same?</p><br/><p>‘That’s right, I’m the guardian spirit of the treasures here. Eh? You’ve got the Grandmaster’s Token? Did the Grandmaster allow you in to take the treasures? Alright, alright, what the hell do you want? Hurry up and get the hell out after taking it.\" The treasure guardian spirit said in a cold attitude. The way he looked at Lin Fan was extremely unfriendly.</p><br/><p>Every year, there would be a few days where the treasure guardian spirits would be in a bad mood as such. That was because each time people came by, the guardian spirit would lose a few treasures within the vault.</p><br/><p>\"The Grandmaster has allowed me to take off half the treasures here.\" Lin Fan surveyed the treasures around him and nodded his head in satisfaction. Not bad, all of these were valuable indeed.</p><br/><p>The moment Lin Fan finished his words, the treasure guardian spirit exploded.</p><br/><p>\"WHAT! WHAT DID YOU SAY?!? HALF? DO YOU WANT TO TAKE MY LIFE AS WELL?\" The guardian spirit was entirely enraged. His expression towards Lin Fan changed as well. Far from being unfriendly, he was now looking at Lin Fan as though Lin Fan had murdered his parents.</p><br/><p>Lin Fan side glanced at the guardian spirit and shook his head, \"Compared to the guardian spirit back at Jiuxiao Sect, I’m truly disappointed in you.\"</p><br/><p>\"You…you…! How dare you insult be as being inferior to my younger brother! I…i…!\" The moment the guardian spirit heard this, he was so angry he barfed out.</p><br/><p>Lin Fan was stunned as well. He had seen before people spewing out blood. But looking at treasure guardian spirits puking out treasures was still quite a sight indeed.</p><br/><p>And what surprised Lin Fan even more was the fact that this guy was brothers with the treasure guardian spirit back at Jiuxiao Sect! What a laughable situation this was.</p><br/><p>\"Guardian spirit, allow him to take half.\" Suddenly, a voice boomed out from the voids.</p><br/><p>\"GRANDMASTER…!\" Upon hearing the voice of the Grandmaster, the guardian spirit could not stop shouting. However, right now, Grandmaster Yan was not in the mood to give a sh*t about him. After all, the Grandmaster’s heart was feeling even more pained than the spirit’s.</p><br/><p>\"NOOOOOOOO…!\" The treasure guardian spirit tilted his head back and screamed in anguish. One by one, treasures were being puked out of his mouth.</p><br/><p>\"Holy f*ck! Hiding so much precious stuff…!\" Lin Fan was dumb stricken. He had thought that the treasures in within the vault were more than enough. But looking at the rate the spirit was spurting out these treasures, there should be way more than this!</p><br/><p>\"Do you really want to take my treasures?\" Having finally shot it all out, the spirit looked at Lin Fan in anger as he clenched both of his fists.</p><br/><p>\"Yes, that’s right.\" Lin Fan nodded his head seriously. Was this spirit going to take on a fight with him?</p><br/><p>\"Alright, you can take them. But I’ll be watching you from the sides!\" The treasure guardian spirit replied in a huff.</p><br/><p>Lin Fan shook his head. This bloody f*cktard…! Bloody hell, he thought the spirit was going to duke it out with him!</p><br/><p>Lin Fan then began to rummage about, specifically looking out for those special looking treasures.</p><br/><p>Just then, Lin Fan’s eye caught sight of a transparent sphere. Within this sphere, a purple light was swirling inside continuously.</p><br/><p>Lin Fan placed the sphere in his palms.</p><br/><p>\"This is a bad item. It’s probably the worst thing there is in this treasure vault! This here at the side is much better!\" The moment the guardian spirit saw this lad picking up the sphere, his heart spiked in pain.</p><br/><p>Looking at the spirit who was floating nearby with his jaws agape, Lin Fan chuckled, \"Hais, seems like you’re a good guardian spirit after all. Of course, I can’t just take all the good stuff, right? Since this is the trashiest, I’ll keep it then so that you won’t feel too heartbroken!\"</p><br/><p>Bloody hell! If not for the system’s verification, he might really have been taken in by this spirit.</p><br/><p>Purple Energy Rejuvenation Pill. To think that this guy would say that such a precious item was a piece of trash! What a load of bull!</p><br/><p>‘Urgh…!’</p><br/><p>Suddenly, the guardian spirit began to spray out again once more. He realized that this was the first time he had experienced such pain ever since he was formed. In fact, he was feeling so gutted that his organs, if he had any, were about to spill out.</p><br/><p>Just then, the guardian spirit realized that this darned lad had picked up yet another item. He then hurried and said immediately, \"Oh, this is great! This is the best item in the entire treasure vault! If you take this, I would be extremely heartbroken!\"</p><br/><p>Stunned for a moment, Lin Fan chuckled and sighed.</p><br/><p>‘Bloody hell, wasn’t this guardian spirit kind of devious?’</p><br/><p>Playing dirty tricks like these. Even though the treasure Lin Fan was holding on to was pretty strong, it required constant sacrifices from its user. So, it wasn’t that decent after all. Now that the guardian spirit was making it out to be some heaven-defying object, he was pretty smart as well, wasn’t he?</p><br/><p>The guardian spirit felt that he had understood Lin Fan’s thoughts. Now that he was making out this item to be a good treasure, he didn’t believe that Lin Fan wouldn’t take it.</p><br/><p>Who else in this world was better than he was at verifying treasures? Just this man and he dared to challenge the experience of a guardian spirit in recognizing treasures? Asking for it seriously.</p><br/><p>\"Alright, since that’s the case, I won’t take it then. I can’t allow you to be heartbroken after all.\" Lin Fan replied gleefully.</p><br/><p>\"Ah, no…no…! Actually, you can have it! Even though it breaks my heart, it’s all good as long as you’re happy!\" The spirit was stunned at Lin Fan’s reply as he stammered.</p><br/><p>\"Nah, it’s fine. There are so many treasures anyways. I don’t really have to insist on that. I think this here is good as well.\" Lin Fan had spotted yet another treasure.</p><br/><p>Looking at what it was, the guardian spirit exclaimed out in shock, \"Shit, that’s extremely precious! That’s…!\"</p><br/><p>Before he could even finish, Lin Fan had already kept the item.</p><br/><p>The spirit floated in midair, staring dumbly at Lin Fan. Unable to control himself, he then began spurting out more. One by one, those glowing treasures danced across the air.</p><br/><p>Lin Fan did not want to choose anymore. With a wave of his hand, half of the treasures were swept within his storage sack.</p><br/><p>And Lin Fan knew his limits as well. When he asked for half, he meant half. He wouldn’t sneak in even a single treasure more than that.</p><br/><p>At the same time, he no longer wanted to look at that guardian spirit in the air, who was still spewing out stuff. He walked out straight away.</p><br/><p>\"Treasure guardian spirit, take care of your health. You seem to be shooting out a little too much.\"</p><br/><p>At some places within Glory Sect, dull moans echoed out.</p><br/><p>‘Ahh...!’</p><br/><p>At this moment, the treasure guardian spirit was not the only one shooting stuff out. On some of the peaks, some couples have gathered to ejaculate out different stuff.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>LOL this author is leaving me breathless at times hahaha. I hope you guys caught all the innuendos at the start. And if not, I hope the last sentence explains it all. HAHA! Cheers!</p><br/><p>Also, I think some of the earlier readers may have noticed that there was this thing called the 'Blah Rock'. I was out of town for a cousin's wedding and I didnt have internet access to verify the exact term for it. My honest apologies. I have since edited it back inside! Cheers!</p><br/>\n</div>"}