{"title": "Chapter 314: Mysterious Inn", "id": 314, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-314-mysterious-inn", "volume_title": "Volume 4", "body": "<h1>Chapter 314: Mysterious Inn</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 314: Mysterious Inn</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Right now, Lin Fan was the hottest topic in the entire Jiuxiao Sect. The moment everyone’s eyes caught sight of Lin Fan, they sparkled with bright glows.</p><br/><p>When the male disciples caught sight of Lin Fan, they extended all their services, feet massages, leg massages, running away from him…</p><br/><p>When the female disciples caught sight of Lin Fan, their eyes carried boundless electrical currents as they shot their sparks towards him, all the while carrying handmade desserts and delicacies.</p><br/><p>Within Jiuxiao Sect existed a goddess of a female disciple. Cold and beautiful, she was the dream of countless male disciples. Towards her fellow male disciples, she had never made any attempts to disguise her disregard with her cold tones.</p><br/><p>If a male disciple could even exchange a few words with her, he would be excited for a couple of days.</p><br/><p>But right now, this goddess was totally head over heels for Lin Fan.</p><br/><p>\"Senior Brother Lin, does it feel alright?\" Lin Fan was laying on a chair right now, feet soaked in a warm water bath. The water was filled with flower petals, while this goddess of all men was carefully massaging Lin Fan’s toes.</p><br/><p>\"Yes, not bad, not bad.\" Lin Fan was thoroughly enjoying his time right now. Ever since he came to Jiuxiao Sect, he had once again understood what it meant to live a perfect life.</p><br/><p>Upon hearing Lin Fan’s praise, a smile formed on that alluring face of the goddess as well.</p><br/><p>For this goddess, Senior Brother Lin was just indefinitely different from any other male disciple. What good fortune of hers would it be if she could just continue to serve him for the rest of her life?</p><br/><p>Some of the surrounding male disciples had their hearts entirely broken, seeing their goddess so deeply doused with the sweet scent of love. But they weren’t angry in the least bit. After all, the target of her affections was their number one revered Senior Brother Lin.</p><br/><p>Neither Heaven nor Earth was enough to withstand Senior Brother Lin’s mighty image.</p><br/><p>Looking at his Brother Lin who knew how to enjoy life, Xinfeng let out a laugh as well. Even though it was his sect’s disciples doing the hard work and chores, it was all natural to him.</p><br/><p>If anyone else dared to make such requests, Xinfeng would probably have leaped for their throats.</p><br/><p>\"Brother Xinfeng, could you help me to look out for this thingy in the future?\" Lin Fan tossed the Supreme Being’s Token Shard to Xinfeng.</p><br/><p>Other than coming to Jiuxiao Sect, Lin Fan’s main objective was to continue searching for these Token Shards.</p><br/><p>Now that he had only found one of them, he did not know where to even begin searching for the rest of them. Based on his own efforts, this might very well take forever.</p><br/><p>Hearing his Brother Lin’s need for help, Xinfeng could not be happier to oblige. Upon receiving the token shard, he exclaimed out in surprise at this familiar looking object.</p><br/><p>\"You’ve seen it?!?\" Looking at the change on Xinfeng’s face, Lin Fan asked hurriedly.</p><br/><p>\"Yes, I have! Back when I visited the Xuanjian Sect with my Master, their Grandmaster had something like this with her as well.\"</p><br/><p>\"Xuanjian Sect?\" Lin Fan found this name pretty familiar.</p><br/><p>Suddenly, it hit him. Wasn’t Xuanjian Sect the one where he had trained that fine lad, Liu Linfeng?</p><br/><p>Due to the trap within the Seven Saint’s lair, he was then teleported elsewhere.</p><br/><p>\"You’re certain?\" Lin Fan continued.</p><br/><p>\"Highly likely. Even though the imprint on it isn’t exactly the same, the look is similar. And it was a piece of shard as well.\"</p><br/><p>Lin Fan nodded his head. Finally, there was a clue now.</p><br/><p>\"Brother Lin, is this thing really important to you?\"</p><br/><p>\"Yes, somewhat.\" Lin Fan nodded his head.</p><br/><p>This thing held the secret of Xuanhuang World’s division into two parts. Once he gathered all of these, he would be able to return to Cangling Continent.</p><br/><p>\"Alright. I’ll get all our disciples to watch out for this from now on forth.\" Xinfeng kept this matter in his heart.</p><br/><p>Lin Fan then had the goddess stop her massage before wiping his feet clean and wearing his shoes.</p><br/><p>\"Brother Xin, it’s about time for me to leave. Seems like I have to pay Xuanjian Sect a visit.\"</p><br/><p>\"Are you in such a rush?!? Aren’t you gonna stay for a little bit longer?\" Xinfeng’s voice had some reluctance in it.</p><br/><p>It wasn’t just Xinfeng who was reluctant, even the disciples themselves were unwilling to watch Lin Fan leave just like that. The goddess herself revealed a look of sadness in her eyes.</p><br/><p>\"Nah, it’s fine. I’ll head back another day.\" Lin Fan replied.</p><br/><p>Knowing that the matter must be pressing, Xinfeng made no further attempts to keep Lin Fan here. Before leaving, Lin Fan passed the battle ark he borrowed from the Grandmaster over to Xinfeng.</p><br/><p>Now that all the top powers of Jiuxiao Sect had passed away, their battle arks’ locations were unknown as well. If Jiuxiao Sect wanted to continue growing, they would require a battle ark for expeditions. Otherwise, it would be inconvenient for them to head anywhere.</p><br/><p>Of course, Xinfeng would have rejected his intentions. After all, Brother Lin had simply helped him too much. If he had accepted this gift as well, then that would be too much.</p><br/><p>But Lin Fan realized that this thing might be too attention seeking at times. Furthermore, while traveling on the battle ark, he might miss out on a lot of locations where he could search for his stuff.</p><br/><p>Since the Supreme Being’s Token Shard was broken, it had the possibility of being anywhere.</p><br/><p>On that dark and breezy night, when Xinfeng came by to look for Lin Fan, he found out that Lin Fan had already left the sect.</p><br/><p>And in his place, the shrunken down battle ark sat quietly.</p><br/><p>Looking at the mini battle ark, Xinfeng’s eyes were filled to the brim with tears.</p><br/><p>...</p><br/><p>In a dense forest far from Jiuxiao Sect…</p><br/><p>Every step Lin Fan took was a leap of a few hundred feet. He was no longer interested in the wild beasts around him. These things were too weak for him to even bother with anymore.</p><br/><p>He was quite a distance from Xuanjian Sect. Even at this rate of travel, he would require some time before reaching them.</p><br/><p>The days and nights passed…</p><br/><p>10 days later…</p><br/><p>Looking at the construct before him, Lin Fan finally slowed down.</p><br/><p>The building before him was an inn. But the weird thing was its location. Why was it situated in such a desolate place?</p><br/><p>And the shocking thing was that despite the desolate location of this place, the number of people entering and exiting it was astounding.</p><br/><p>Just as Lin Fan approached the inn, the people around the inn sized up Lin Fan as well.</p><br/><p>Lin Fan paid no heed to these people.</p><br/><p>Most of them were pericelestials. And by the look of their clothing, they did not seem like they belonged to any sect.</p><br/><p>Within the inn…</p><br/><p>Lin Fan secured a table for himself. Sitting down, he ordered some food and listened in to the conversations taking place nearby.</p><br/><p>Surprisingly, there was quite the spread of fighting strength in this place. Other than pericelestials, there were lesser celestials as well. Amazingly, there was even an ordinary looking old man who was a greater celestial.</p><br/><p>For a vagrant martial artist to be a greater celestial was an incredible achievement to Lin Fan.</p><br/><p>Not long after, Lin Fan finally knew what sort of a place this was.</p><br/><p>This inn was a unique existence. It served as a place for people to trade missions for mercenaries.</p><br/><p>Those people who were here either came with requests or to accept missions.</p><br/><p>The missions here were extraordinary and out of this world, and came in all sorts of varieties. As long as one thought that the compensation was enough, one could choose to accept any one of them.</p><br/><p>Lin Fan did not think that such a place would exist. If he had not seen it for himself, he might not have believed it.</p><br/><p>And just then, a group of people entered from outside.</p><br/><p>A young lady was masked with a shawl, followed by a group of men.</p><br/><p>Even though the female was of pericelestial lower level, her followers were at pericelestial upper level.</p><br/><p>For the standards of vagrant martial artists, these were considered pretty formidable people. But for someone like Lin Fan, these were nothing.</p><br/><p>As the young lady headed up the stage, her crisp, clear voice was quivering and somewhat urgent.</p><br/><p>‘Long Yuan dynasty is seeking able men to resist a Beast Stampede. Reward: Title of Marquis.’</p><br/><p>In her gentle voice, she stood there, looking down at the crowd somewhat anxiously, hoping someone would accept the mission.</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Off we go to the new arc yay! Btw, Long Yuan dynasty loosely translates to Dragon Valley. But because the context isn’t made clear, I’d rather keep it as Long Yuan and inform you guys of it here! Cheers!</p><br/>\n</div>"}