{"title": "Chapter 326: Lin Fan's Love Story", "id": 326, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-326-lin-fans-love-story", "volume_title": "Volume 4", "body": "<h1>Chapter 326: Lin Fan's Love Story</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 326: Lin Fan's Love Story</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Looking at the young man before her, Grandmaster Xuan was a little bewildered. No matter how she looked at it, she could not sense any form of aura nor make out his cultivation state. Yet, he gave off an air of superiority.</p><br/><p>The thought of him being a mere commoner had not crossed her mind. That left only a single possibility: the man before her must be really strong.</p><br/><p>Just as Grandmaster Xuan was about to speak up, she was beaten to the chase by Xuan Yunxian who was beside her.</p><br/><p>\"Is it truly you?\" A look of anticipation took over Xuan Yunxian’s beautiful face. The moment Xuan Yunxian spoke up, everyone from Xuanjian Sect was stunned as well.</p><br/><p>Was Xuan Yunxian acquainted with this man?</p><br/><p>Lin Fan was equally stumped as well. Just what sort of scenario was this leading towards?!?</p><br/><p>He had thought up of all sorts of possibilities, but definitely not something like this!</p><br/><p>Even if Xuan Yunxian recognized him, she would not call him out on it right in front of her Grandmaster, right? She would have definitely waited for the night to come where no one was around and snuck her way into his room to ask him about it!</p><br/><p>But now…this was practically holding him at a knifepoint! It was as though she wouldn’t let this thing go unless he clarified things right here and now!</p><br/><p>\"Yunxian, do you know him?\" Grandmaster Xuan asked by the side.</p><br/><p>But Xuan Yunxian could not even take in her Grandmaster’s words right now. She just continued with her question once more.</p><br/><p>\"Is it truly you?\" Her heart was flustered right now. She could not really believe this and was waiting for his response.</p><br/><p>Lin Fan stood there without budging a single inch or replying to the question. He was really stumped by this question.</p><br/><p>He truly had not considered this option.</p><br/><p>Looking at the anxious look on Xuan Yunxian’s face, Lin Fan wished he could give himself a tight slap in the face right now.</p><br/><p>Bloody hell! Why did he have to be itchy to put on an act back then! Now, he had brought about this whole mess right on himself.</p><br/><p>Thinking back, he could recall the very words he told her back then.</p><br/><p>‘To be able to pass on the hope of living to a beauty like you is an honor of mine. Ever since I first caught sight of you, I was captivated by your grace. I hope that you do not forget about me ever…’</p><br/><p>‘Do not speak any further. To be able to just stare at you like this before I die is a lavish demand to the Heavens. Farewell.’</p><br/><p>Thinking back to these two sentences, Lin Fan was totally about to cry right now. Lavish demand your mother, you stupid Lin Fan!</p><br/><p>Back then, he felt so damn good after putting on that act. But right now, he just felt like an absolute fool. The trouble was real big right now.</p><br/><p>He was especially careful with his facial expressions back then. He was so certain that his act would have been able to touch even the coldest of hearts.</p><br/><p>But little did he know how deep of an impact these words had on Xuan Yunxian.</p><br/><p>Having spent her entire life in Xuanjian Sect, Xuan Yunxian did not have any form of interactions with any strangers of the opposite gender. Even though she was an old virgin at the age of 30, her heart was still filled with teenage fantasies like that of a little girl.</p><br/><p>These words were like seeds that were planted in the heart of Xuan Yunxian, blooming as time went by. Every night, she would stare at the moon and fall deep into her thoughts.</p><br/><p>Because of that, her disposition had mellowed down much more from the past as well.</p><br/><p>At this point, Grandmaster Xuan and the other Senior Elders looked at one another in the eyes. Something seemed to be wrong.</p><br/><p>As for the disciples that were surrounding Lin Fan right now, their faces were frozen in shock as well. They could sense the deep longing within that sentence…</p><br/><p>As they looked at one another in the eyes, a single thought crossed their minds.</p><br/><p>Could Elder Xuan Yunxian have some sort of relationship with this man…?!?</p><br/><p>Thinking back at Elder Xuan Yunxian’s usually cold and haughty look on her face, it was hard to believe that any man would be able to capture her heart.</p><br/><p>Right now, Lin Fan was feeling uncomfortable. Extremely uncomfortable. This feeling was too damn repressing!</p><br/><p>Before he had transmigrated to this world, Lin Fan was a young and innocent virgin boy. Even though he had studied through countless AV films, his inner heart was as pure as a piece of white paper.</p><br/><p>To a man with that much research, women were just the fairer sex in his eyes.</p><br/><p>But the main reason for that was because he had yet to experience a woman who had revealed such deep emotions to himself.</p><br/><p>And that single sentence filled with deep emotions of Xuan Yunxian was causing Lin Fan to feel really unnerved. No matter how strong he was in terms of cultivation base, he was at a loss for actions right now.</p><br/><p>\"Is it truly you?\" Xuan Yunxian took a step forward. Her peerlessly flawless face could not wait to obtain an answer from him.</p><br/><p>Lin Fan retreated backward accordingly, his eyes darting left and right as though he was trying to avoid being devoured by Xuan Yunxian’s passionate eyes.</p><br/><p>Yes or no?</p><br/><p>Lin Fan wanted to deny that question. But when he saw Xuan Yunxian’s look of longing, he hesitated.</p><br/><p>‘Bloody hell, Lin Fan! What are you afraid of? Even if you acknowledge it, so what? It’s not as though she’s going to devour you whole, right?’</p><br/><p>\"Hi, long time no see.\" After taking in a deep breath, Lin Fan finally forced out a smile on his face, trying his best to regain his usual self. Raising his hand, he waved hi to her as a reply.</p><br/><p>But just then, not even in his wildest dreams…</p><br/><p>A fragrant aroma swept into his nose.</p><br/><p>A shadow had leaped into his embrace.</p><br/><p>\"I knew it! I knew it was you! How could you die, right…?\" Xuan Yunxian had pounced into Lin Fan’s arms with a weeping tone.</p><br/><p>Lin Fan truly wanted to weep as well. What the hell was going on right now?</p><br/><p>That day…that day! Hadn’t he just said a few extra words because of his itchy mouth?</p><br/><p>But Yours Truly hadn’t done anything to you…!</p><br/><p>Lin Fan was utterly flabbergasted right now. His awkward hands in midair had no place to rest on anymore.</p><br/><p>He truly did not know what to do at this moment.</p><br/><p>Everything came so suddenly that he wasn’t even in the least bit prepared.</p><br/><p>Grandmaster Xuan stumbled backward aghast. Her face was filled with disbelief.</p><br/><p>All the other Senior Elders were equally shocked. Xuan Yunxian had always been groomed and seen as the next successor to the sect. But now that something like this was happening, what were they to do?</p><br/><p>Amongst the disciples who witnessed this, some of them were touched. The others were in equal shock as their Grandmaster and the others.</p><br/><p>How could an elder of Xuanjian Sect behave as such…!</p><br/><p>A disciple suddenly ran off into the distance.</p><br/><p>Recently, Liu Linfeng had been feeling a sore ache in his heart. Seated in front of his mirror, he was fiddling with his fingers and caressing his cheeks gently.</p><br/><p>Even looking at the rouge on his makeup table, he didn’t have the slightest bit of interest.</p><br/><p>It was too lonely…</p><br/><p>He was missing someone.</p><br/><p>BAM!</p><br/><p>Suddenly, his door was slammed open. Liu Linfeng’s face turned into one of displeasure immediately. How were disciples these days so rude? He had to teach them a good lesson definitely.</p><br/><p>\"Senior Brother Liu! This is not good! Your master is in an embrace with someone outside of the Main Hall!\" The female disciple exclaimed anxiously.</p><br/><p>\"The f*ck…!\" Liu Linfeng’s voice was sharp. Upon hearing this, he stood up in an angry huff. \"Are you certain of what you said?\"</p><br/><p>\"That’s right! They’re still there!\" The female disciple replied hurriedly.</p><br/><p>Suddenly, Liu Linfeng’s eyes flashed with a murderous intent. Just which b*stard was it who dared to vie for his master’s attention?</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHAHA LIN FAN AND HIS BULLSHIT ONCE MORE. Oh and Liu Linfeng finally! Been waiting for this guy to see the fruits of his training! Cheers!</p><br/>\n</div>"}