{"title": "Chapter 336: The Man At The Top Of The Food Chain", "id": 336, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-336-the-man-at-the-top-of-the-food-chain", "volume_title": "Volume 4", "body": "<h1>Chapter 336: The Man At The Top Of The Food Chain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 336: The Man At The Top Of The Food Chain</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Donger of the Blood Demon Emperor?\"</p><br/><p>Lin Fan was utter bewildered right now. He had not expected something like this to come out of a tribute!</p><br/><p>Wow, how could the power of the underworld be this despicable! For the sake of absorbing those energy grid lines, they wouldn’t even let off his donger!</p><br/><p>Lin Fan took a deep breath and gripped his Eternal Axe tightly. It was as if this was an impeccable challenge to him right now.</p><br/><p>\"HUMAN! YOU CAN’T DO THIS! NO…!\" That mighty and imposing Blood Demon Emperor was about to cry right now.</p><br/><p>He had never imagined that this would happen. ‘Power of the underworld! How could you do this…!’ The Blood Demon Emperor was repeatedly howling within his heart right now.</p><br/><p>Lin Fan stood there, silent for a moment. His energy level was rising.</p><br/><p>\"Even if it’s this, there’s no way I can let it go. Just bear with it for a while, Blood Demon Emperor. I know that you will not die as long as the blood seas exist. Don’t worry, you’ll grow it out again anyways!\" Lin Fan consoled him. Raising his Eternal Axe, his eyes flashed with resolution as he began to swing it down.</p><br/><p>Feeling the impending doom that was approaching, the Blood Demon Emperor within the Blood World cried out begging.</p><br/><p>\"OH MIGHTY AND GREAT HUMAN! PLEASE FORGIVE THIS SMALL LITTLE BLOOD BOY HERE WHO HAS ALWAYS REVERED YOU ALL THIS WHILE…!\"</p><br/><p>\"The f*ck…!\"</p><br/><p>Just as he was about to chop down, Lin Fan stopped. He then dug his ear as if he had heard something wrongly.</p><br/><p>‘Little Blood Boy’?!?</p><br/><p>‘Always revered’?!?</p><br/><p>Holy f*ck! Lin Fan had not expected the mighty Blood Demon Emperor to bow over! Looking at how the human had stopped, the emperor continued his relentless begging.</p><br/><p>\"Mighty and great human, please spare me! Please do not cut away my…boohoo!\" The emperor had thrown away every single last bit of his dignity at this point.</p><br/><p>No one else could even begin to understand the pain that was in the emperor’s heart right now. To him, everything that had happened today was just nothing more than a tragedy.</p><br/><p>At the same time, he was filled with boundless hatred towards the unknown powers of the underworld. To think that it could do something so bestial just for the sake of ten energy grid line chains!</p><br/><p>That was even more demonic than a demon!</p><br/><p>Listening to the sorrowful cries of the emperor, Lin Fan’s heart softened a little. This cry was simply too helpless, as if one had lost all hope.</p><br/><p>It was so tragic that one could cry along with it.</p><br/><p>\"Blood Demon Emperor, if I do not cut you down, I would have wasted the energy grid line chains I used as a tribute. How? I still need my essence blood!\" Lin Fan asked.</p><br/><p>\"No, mighty human! You won’t waste them, no! As long as you don’t cut it off, this little blood boy here will offer you my essence blood on my own accord!\" As he begged, 15 drops of essence blood floated gently in the skies.</p><br/><p>Lin Fan was stumped. He had not expected this Blood Demon Emperor to be so tactful! Seemed like the moment he bowed down, he was more obedient than anyone else!</p><br/><p>After considering for a moment, Lin Fan nodded his head in agreement. \"Fair enough. Then, I won’t cut you up. I’ll summon you again next time then.\"</p><br/><p>Upon hearing the second half of the sentence, the emperor who heaved a sigh of relief was scared witless almost immediately.</p><br/><p>\"N-no! Please don’t summon me anymore!\" The moment he heard that this terrifying human was going to summon him again, he almost fainted over.</p><br/><p>\"If I don’t summon you, who do I summon? Don’t worry, as long as the blood sea exists, you won’t die.\"</p><br/><p>\"No! You can summon the Heart Demon Emperor! He is stronger than me. Hence, his essence blood should be even better than mine!\" The Blood Demon Emperor was begging for mercy right now. In fact, just so that Lin Fan wouldn’t summon him, he even sold out his best friend to Lin Fan.</p><br/><p>To the Blood Demon Emperor, as long as humans and anyone else still had demons within their hearts, the Heart Demon Emperor would not cease to exist.</p><br/><p>Heart Demon Emperor?</p><br/><p>Lin Fan was surprised to know that the Blood Demon Emperor was not the only sovereign within the Blood World.</p><br/><p>But looking at how tactful this boy was, Lin Fan decided to let this go.</p><br/><p>\"Alright, you can scram now.\"</p><br/><p>\"Y-yes!\" The Blood Demon Emperor hurried off.</p><br/><p>Within the Blood World, he couldn’t stop shivering. Everything that had happened today was simply just way too terrifying! Thinking back to the fifteen essence blood drops that he had to offer, his heart was wrenching in pain.</p><br/><p>Now that he was so badly injured, the emperor did not even bother to vent out his frustration in the blood sea anymore. He just sank within it to slowly recover.</p><br/><p>As for his best friend, the Heart Demon Emperor, the Blood Demon Emperor could only hope that he could survive under the threat of such a horrifying demon-human.</p><br/><p>Suddenly, the Blood Demon Emperor had a revelation.</p><br/><p>Within the Blood World, he should not offend too many people. Instead, he should make more friends. At times like these, he could put them forth as meat shields.</p><br/><p>\"Heh…Friends are meant to be betrayed.\" It seemed as if he had understood yet another true meaning of the world, as the Blood Demon Emperor sunk into his blood sea to recover.</p><br/><p>Lin Fan flicked his robes. Tossing the fifteen drops of essence blood into his mouth, he churned Blood Sea once more.</p><br/><p>The negative feelings of the Blood Demon Emperor’s essence blood were simply too much. Any normal human being should not be able to control it, and would definitely end up in a maniacal and demonic state instead, after being controlled by it. But under Lin Fan’s system, none of these had any effect on Lin Fan at all.</p><br/><p>Once every single last drop was cultivated, Lin Fan opened his eyes in satisfaction.</p><br/><p>The experience points of Blood Sea had jumped quite a bit yet again. He was now one step closer to level 8.</p><br/><p>With fifteen energy grid line chains left, Lin Fan felt that he ought to give it a shot.</p><br/><p>Now that he had already scalped the Blood Demon Emperor clean, it was time to try out the Heart Demon Emperor.</p><br/><p>\"Tribute. 15 energy grid line chains.\"</p><br/><p>\"Come out, Heart Demon Emperor!\"</p><br/><p>Suddenly, all fifteen energy grid line chains flew up into the air. The power of the underworld had felt it. But the curious thing was that all these fifteen energy grid line chains were just floating quietly in the sky instead of being absorbed by the power of the underworld.</p><br/><p>Seemed like the tribute wasn’t enough.</p><br/><p>The Heart Demon Emperor was truly as strong as the Blood Demon Emperor had mentioned! To think that he couldn’t even be summoned out with fifteen energy grid line chains!</p><br/><p>...</p><br/><p>Within the Blood World…</p><br/><p>Within a murky black mist, there existed a palace entirely black. Within the palace on an exquisite throne, the Heart Demon Emperor sat with a smile of disdain curling upon his lips.</p><br/><p>\"Hmph! Puny humans! Trying to summon me with just 15 energy grid line chains? Know your place.\" His eyes opened slightly, revealing their darkness within before closing shut once more.</p><br/><p>...</p><br/><p>\"Hais, seems like I’ve got to start gathering more energy grid line chains. This Heart Demon Emperor seems like quite the show-off!\" As the fifteen energy grid line chains flew back to Lin Fan, he stopped his tribute.</p><br/><p>Gathering energy grid line chains did not really seem to be anything tough, which he could do at any time.</p><br/><p>At the same time, Lin Fan thought about the ‘Roc’s Descent’. If he could summon out the Roc and kill it, wouldn’t that be awesome? Essence blood aside, just the experience points would be fantastic!</p><br/><p>But to Lin Fan, that was just a thought for now.</p><br/><p>Thinking back to how many treasures the previous summon had cost, his heart could almost break.</p><br/><p>And to think that the Roc only came out for a short while after being summoned!</p><br/><p>Besides, he didn’t even know if he were strong enough to kill the Roc with his power level right now.</p><br/><p>And just as he was about to leave, he saw a shadow approaching from the distance.</p><br/><p>Looking at who it was, he sighed.</p><br/><p>Damn it. Something troublesome had arrived once more.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Yay, new arc? (:</p><br/>\n</div>"}