{"title": "Chapter 345: Here Comes Divine Retribution.", "id": 345, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-345-here-comes-divine-retribution", "volume_title": "Volume 4", "body": "<h1>Chapter 345: Here Comes Divine Retribution.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 345: Here Comes Divine Retribution.</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"None of you shall have a good death…!\"</p><br/><p>\"I, Chen Xuan, am a man blessed by the Heaven’s Will! You shall receive karma for everything that you’ve done to me!\"</p><br/><p>Chen Xuan was gradually regaining consciousness. However, the pain was still like a billion ants eating away at his insides. A frosty numbness was spread across his entire body from head to toe, rendering him almost entirely immobile.</p><br/><p>Lin Fan did not pay heed to Chen Xuan’s cries in the slightest. He was just looking at Chen Xuan’s area for a closer inspection.</p><br/><p>But to Han Mei and the others, they felt really uneasy. Those cries sounded like they contained the grievances of demons who were hungry and thirsty, creeping over one to the depths of their hearts.</p><br/><p>Han Mei wanted to take a look at just what happened to Chen Xuan. However, that group of people was surrounding him so tightly that she couldn’t make clear anything in their midst. All she could hear were those tragic cries.</p><br/><p>...</p><br/><p>\"Oh, that’s why! After this valuable lesson from Boss, I feel like I’ve been through another ten years of robbing others!\" The fourteen sand bandits nodded their heads in agreement.</p><br/><p>\"That’s right! I had not expected that there was so much more to learn from robbing others!\"</p><br/><p>...</p><br/><p>Lin Fan nodded his head in satisfaction. Using Chen Xuan was an example, he had imparted some really irreplaceable and valuable knowledge to his bunch of bandits.</p><br/><p>\"Boss, what should we do with this fella now?\" Sha Dulong asked. They were feeling especially invigorated after this robbing experience. After all, this was the first time they had ever robbed someone this rich!</p><br/><p>The man’s storage rings were like treasure vaults by themselves! Skills, pills, weapons, armors... He had practically everything within them!</p><br/><p>And their Boss was extremely generous, giving them a whole bunch of great stuff. These fourteen sand bandits could not wait to get this over and done with before finding a good place to start cultivating up with their newfound treasures.</p><br/><p>Just the pills that the Boss had handed them alone were enough to help them boost their cultivation states by a great deal!</p><br/><p>\"Seems like we’ve made an enemy out of him. He wanted to kill us, but due to his lack of skills, he was taken captive. If we kill him now, it would be entirely logical as well.\" Lin Fan commented.</p><br/><p>The forty energy grid lines were just right there for his taking. Furthermore, Lin Fan truly hated show offs to his core. The art of bullsh*tting was a classy and sacred profession. How could he let this wannabe lay insult on the trade?</p><br/><p>At this moment, Chen Xuan was channeling True Energy. He was trying to seal his crotch area so as to not let the pain affect his brain. However, the moment his True Energy reached below, it was mercilessly devoured by a mysterious opposing energy.</p><br/><p>Looking at Chen Xuan’s futile efforts, Lin Fan let out a grin.</p><br/><p>As for the other sand bandits looking at the stark naked Chen Xuan, they too sniggered out sinisterly.</p><br/><p>\"Boss, let us do it. You don’t have to dirty your hands.\" Sha Dulong remarked.</p><br/><p>Lin Fan shook his head, \"No, this guy’s physical body state is too strong. It is not something you guys can break through. I’m the only one who can do this.\"</p><br/><p>Well, Lin Fan was actually speaking the truth. Chen Xuan was extremely powerful indeed. With the boosted effect of the forty energy grid line chains to his name, his physical body state would be ridiculously firm even if he didn’t particularly train up a specific physical body skill. This was something that Sha Dulong and the others definitely could not break through.</p><br/><p>The difference in power level wasn’t a gulf that one could just cross or ignore this easily.</p><br/><p>But for someone like him who lived with a BUG in this world, all of these were just illusory.</p><br/><p>\"YOU’LL RECEIVE DIVINE RETRIBUTION!\" Chen Xuan’s eyes were bloodshot right now as he screamed with his naked body. Eventually, he was torn apart to a mental breakdown by that overwhelming pain.</p><br/><p>Just what sort of despicable skill was this? Why would it hurt as such?!</p><br/><p>\"Divine retribution? Yours Truly isn’t afraid at all. Just someone of your likes? Yours Truly have killed a dozen of you guys, yet Yours Truly doesn’t see any divine retribution being rained down.\" Lin Fan replied while laughing.</p><br/><p>BOOM!</p><br/><p>Suddenly, the clear skies underwent a transformation.</p><br/><p>The skies were now filled with grey clouds as thunder rumbled.</p><br/><p>\"Boss, what’s happening!\" Seeing this unusual happening, the fourteen sand bandits exclaimed out in surprise.</p><br/><p>Just as he mentioned divine retribution, the skies changed. Could it really be something of the sort?</p><br/><p>BOOM! BOOM!</p><br/><p>The thunder claps were getting closer in timing. It was as if something was hidden beneath those ominous dark clouds, howling furiously.</p><br/><p>\"HAHA! DIVINE RETRIBUTION…! YOU WANT TO KILL SOMEONE WITH THE HEAVEN’S BLESSINGS?! THEN YOU MUST PREPARE TO RECEIVE RETRIBUTION OF AN EQUIVALENT AMOUNT!\" Chen Xuan laid on the ground laughing wildly. But one could tell the miserable pain hidden behind those wild laughter.</p><br/><p>\"Could this be doomsday?!\"</p><br/><p>\"Those lightning bolts are way too huge! When have we ever witnessed such an occurrence in our lifetime of traveling around?!\"</p><br/><p>BOOM!</p><br/><p>Suddenly, a mountain in the distance was struck down to a piece of flat ground by a bolt of thunder. That frightening sight had everyone’s heart skip a beat, as they could not help but imagine what would happen if they were the ones who were struck by it.</p><br/><p>Seeing this sight, Han Mei and the others were shivering uncontrollably as well. Her beautiful eyes were filled with boundless fear.</p><br/><p>Lin Fan stood where he was. Looking at the Heavens, his lips curled into a grin.</p><br/><p>\"Someone of Heaven’s Will? Interesting, interesting indeed…\" Lin Fan did somewhat believe what Chen Xuan said regarding a person of Heaven’s Will. The records within Glory Sect did mention something about the Heavens sending down Messiahs in dark times when the Earth was filled with demons and the likes.</p><br/><p>Even though Dongling Continent did seem peaceful on the surface, there were a lot of dangers lurking beneath waiting to rise.</p><br/><p>Beast Stampedes.</p><br/><p>The Ancient One.</p><br/><p>All of these strange things that were happening were proof that something big was descending on the Dongling Continent, slowly but surely.</p><br/><p>But, so what?</p><br/><p>So what if he were a man chosen by Heaven’s Will?</p><br/><p>\"Shut up.\" Stamping down on Chen Xuan with his feet, Lin Fan tilted his head into the skies and hollered, \"So what if he’s someone of YOUR Will? Do you expect Yours Truly to be afraid?\"</p><br/><p>The moment he thought that Chen Xuan could be someone chosen by the Heavens, Lin Fan was displeased.</p><br/><p>If not for someone like himself, then Chen Xuan might probably be the protagonist of this world. Killing anyone in his way, god, deities or humans alike… With a temper of a b*stard, forcing the entire world into submission!</p><br/><p>And this ‘protagonist’ was someone so bloody strong as well. Forty energy grid line chains? That was the force that could rule over the entire Dongling Continent!</p><br/><p>If not for his existence, even Glory Sect’s Grandmaster might be hung up for this guy to whack!</p><br/><p>\"Whoever you are hiding in the clouds, come out if you’ve got the guts! Yours Truly will wallop the sh*t out of your face!\" Stomping on Chen Xuan on the ground once more, Lin Fan pointed up towards the Heavens.</p><br/><p>All of the fourteen sand bandits were rooted, staring at Lin Fan in awe.</p><br/><p>They could only use four words to describe their Boss.</p><br/><p>‘Extremely cool beyond words’</p><br/><p>\"HAHA! I’M THE ONE WHO’S CHOSEN BY THE HEAVENS. YOU’RE JUST MEANT TO BE A STEPPING STONE ON MY PATH TO GREATNESS…!\" Looking at the changes in the skies, Chen Xuan continued his frenzied laughter.</p><br/><p>\"Shut up!\" Looking at the cocky attitude of Chen Xuan, Lin Fan could not bear it in anymore as he sent yet another True Origins Crushing Kick.</p><br/><p>\"ARGH…!!!\"</p><br/><p>Chen Xuan’s scream was tragic as his eyeballs nearly popped out. It was as if he was dealt some devastating blow that his entire frame of mind was about to go shatter into the abyss of madness.</p><br/><p>\"I AM THE CHOSEN ONE OF THE HEAVENS! YOU CAN’T KILL ME!\" He was sweating profusely and hyperventilating right now, retaining only a single strand of consciousness.</p><br/><p>Lin Fan glanced at him. F*cking hell. Still putting on a strong front? Not bad, not bad! At this moment, Lin Fan thought up of something fun.</p><br/><p>\"Good, decent indeed. But I’ll see if you can withstand this.\"</p><br/><p>Without hesitation, Lin Fan took out a Biggra and stuffed it in Chen Xuan’s mouth.</p><br/><p>Chen Xuan wanted to struggle and resist. But against Lin Fan’s force, there was nothing he could do but to swallow it.</p><br/><p>With a single kick, Lin Fan sent Chen Xuan flying somewhere in the distance. He would let this guy penetrate Mother Nature first before taking care of him.</p><br/><p>Although, there was a deep-rooted question in Lin Fan’s mind.</p><br/><p>Could someone still get hard after receiving two True Origins Crushing Kicks?</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hi guys! Explanations first! The ‘BUG’ that Lin Fan was referring to was most likely in reference to something like a computer bug or glitch. Since his existence itself is a singular miracle in Dongling Continent to begin with, hence the term!</p><br/><p>Also, could anyone even relate with me to how cool our dear Lin Fan was when he stomped on Chen Xuan’s face and pointed up at the Heavens in defiance? Wow.</p><br/><p>1. Anyways guys, Happy!</p><br/>\n</div>"}