{"title": "Chapter 342: Dont Ignore Me!", "id": 342, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-342-dont-ignore-me", "volume_title": "Volume 4", "body": "<h1>Chapter 342: Dont Ignore Me!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 342: Dont Ignore Me!</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan had been hidden in the skies and looking down for quite some time. Towards the predicament of Sha Dulong and the others, he felt bad as well.</p><br/><p>Even after changing to another place, they still found themselves in such a pitiful state. The moment they came out to rob, they were whacked by others. There should be no other bandits that were as tragic as them.</p><br/><p>But this young man? Lin Fan was pretty displeased at his actions.</p><br/><p>What was Lin Fan’s trademark tagline?</p><br/><p>‘Kill off all show-offs.’</p><br/><p>Especially a guy like this who dared to show off even more extravagantly than Lin Fan? He should know what it meant to be humble.</p><br/><p>But Lin Fan was a little curious towards this young lad as well.</p><br/><p>Even though the cultivation state that he revealed as a pericelestial upper level, the power level that he was hiding within was that of a greater celestial full cultivation! To think that he even had forty energy grid line chains gathered! What an astonishing amount.</p><br/><p>Back to himself, his energy grid line of water was only at 80% right now.</p><br/><p>He still needed a couple more hours before he could get to his first energy grid line chain.</p><br/><p>But the thing that Lin Fan was a little touched by was the fact that Sha Dulong and the others had taken him as the boss.</p><br/><p>The Fifteen Sand Bandits?</p><br/><p>The name did sound a little lacklustre to Lin Fan.</p><br/><p>The moment he descended from the skies, he came before Sha Daotian and popped a pill in his mouth.</p><br/><p>\"Now, tell me. How are you guys in such a pitiful state! How many times have you succeeded in robbing so far?\" Lin Fan asked.</p><br/><p>Upon swallowing the pill, Sha Daotian regenerated quickly to perfect health. He shrugged his head awkwardly to Lin Fan’s question.</p><br/><p>In actual fact, they had not succeeded even once. All the way, they were just rushing forward and scraping to live by. And just as they found this nice place and were ready to settle down into a robbery, they met this wolf in sheep’s skin.</p><br/><p>\"Speechless, aren’t you? To think that you guys are professionals but you’ve succeeded not even once! I’m truly disappointed.\" Lin Fan said while shaking his head.</p><br/><p>\"Isn’t it because you’re not with us, Boss? With no one to lead down, our success rate has gone down a lot…\" The pygmy Sha Miexiong said in a low tone.</p><br/><p>\"Yes, that’s a problem indeed. Without my guidance, you guys are truly failing.\" Lin Fan nodded his head. What Sha Miexiong said was true indeed. He was feeling satisfied.</p><br/><p>Chen Xuan’s face was extremely unfriendly right now. To think that this guy would disregard his existence?!</p><br/><p>This was totally unacceptable to Chen Xuan.</p><br/><p>\"Alright, now that I’m here, the robbery shall continue once more! Watch and learn boys! I’ll show you how to conduct a true robbery.\" Lin Fan continued.</p><br/><p>\"Boss is the best!\"</p><br/><p>\"Boss is the coolest!\"</p><br/><p>...</p><br/><p>Looking at the fourteen of them, Lin Fan did find his mood improving cheerily. He then turned his fact to the menacing looking Chen Xuan.</p><br/><p>\"Dulong, come tell me our robbery’s tagline once more!\" Lin Fan called over.</p><br/><p>\"Yes!\" Now that their Boss was back, Sha Dulong was naturally not afraid of this what Chen Xuan or whoever he was. At the top of his voice, he shouted out, \"Robbery! Men on the left, women on the right! We only look for valuables and not your lives! Better wisen up!\"</p><br/><p>\"Yes, not bad…!\" Lin Fan nodded his head before beckoning with his hand. \"Follow me, we’ll start with counting the goods.\"</p><br/><p>Sha Dulong looked at Chen Xuan. He wanted to warn his Boss that this man was really insolent and was a wolf in sheep’s skin as well. But looking at how his Boss was indifferent to the presence of this man, he decided not to say anything more.</p><br/><p>\"HAHA! The fifteen sand bandits? Seems like you must be the last one then, eh?\" Chen Xuan looked at Lin Fan. He then laughed out coldly at these bunch of fools who were ignoring him.</p><br/><p>\"I’m talking to you! Are you deaf?!\" Chen Xuan was incensed. No one had dared to be this insolent without having to pay the price.</p><br/><p>Even the Three King Bandits of the Green Hell Ancient Grounds and the Kill Rob Gang of the Lolan Demon Seas would not dare to act in this manner! To think that these mere sand bandits would dare to ignore him! How dare they! Damn it! DAMN IT!</p><br/><p>\"B*STARD!\"</p><br/><p>PIAK!</p><br/><p>\"Bothersome little bugger. Okay, hurry up and ask those people on the carriages to come down. It’s robbery time!\" When Lin Fan walked by Chen Xuan and saw that he was still chattering nonstop, he just gave him one tight slap and sent the latter flying.</p><br/><p>\"HOLY…!\" Sha Dulong and the other bandits opened their mouths with their jaws dropping wide apart. That bloody cocky and whatever-his-name-was Chen Xuan was just sent flying by their Boss!</p><br/><p>Everyone within the carriages was stupefied. What? That young man was just sent flying into the sky with a single slap?!</p><br/><p>Han Mei was equally stunned. What the hell was going on?!</p><br/><p>\"Hurry up and get out! It’s a robbery!\"</p><br/><p>\"Men on the left, women on the right! Better wisen up!\"</p><br/><p>\"We’ll only take your valuables and not your lives! Don’t worry, we won’t do anything much to you!\"</p><br/><p>Sha Dulong and the others began to make a clean sweep, pulling Han Mei and the others down from the carriage.</p><br/><p>Lin Fan stood there observing everything while nodding his head in satisfaction. It had been a long time since he was in his old trade. What a reminiscent feeling!</p><br/><p>As for Han Mei, she was frozen solid with her teeth chattering, trying to make tail of what was happening right now.</p><br/><p>Chen Xuan, who was sent flying by Lin Fan, stood up.</p><br/><p>One cheek was snow-white while the other tomato red. The difference was striking.</p><br/><p>\"B*STARD! SINCE YOU ALL WANT TO DIE, I’LL FULFILL YOUR WISHES!\"</p><br/><p>\"I, Chen Xuan, was only holding back my cultivation state to toy with you fools! Since this is the case, let me show you my true powers!\"</p><br/><p>\"Seal Remove!\"</p><br/><p>BOOM!</p><br/><p>Suddenly, Chen Xuan’s aura began rising furiously. It was so tremendous that the Heavens and Earth were rumbling.</p><br/><p>\"Boss! That fella…!\" Looking at the aura being emitted from Chen Xuan, Sha Dulong’s heart was thumping as well.</p><br/><p>Lin Fan tossed a casual sideglance. \"Oh, don’t worry. Let him unseal himself first. Let’s carry on with our robbery.\"</p><br/><p>Looking at Chen Xuan, Lin Fan could not help but feel exasperated. It was pretty much a miracle for him to live this long.</p><br/><p>Why did this fella seem like all those dumb pigs that he had always read in novels? Sealing themselves up for no reason. Well, if that was all, then fair enough. But the time taken to unseal was so damn bloody long!</p><br/><p>While Yours Truly acknowledged that the image caused by the unsealing did look pretty formidable, it was still way too stupid.</p><br/><p>‘Lesser celestial.’</p><br/><p>‘Greater celestial.’</p><br/><p>‘1 energy grid line chain.’</p><br/><p>’10 energy grid line chains.’</p><br/><p>...</p><br/><p>As Chen Xuan’s aura grew stronger, so did the fire blazing in his eyes. \"You bloody b*stard! You can go tremble in the depths of hell!\"</p><br/><p>\"With my mighty strength, I shall make you pay the price for your actions!\"</p><br/><p>\"B*stard! How dare you look down on me! I’ll make you regret it!\"</p><br/><p>At this moment, Chen Xuan was howling to himself all alone at one corner, completely being disregarded. Lin Fan was just making use of the time to do up the robbery.</p><br/><p>\"Hey pretty girl, better be clean! Other than your undergarments and panties, hand everything else over!\" Lin Fan walked up front with Sha Dulong and the others behind him, their hands filled with stuff. All of this was the stuff that they scalped.</p><br/><p>Finally, Sha Dulong could regain the feeling of a true robbery.</p><br/><p>Success…They had finally succeeded!</p><br/><p>After countless months, they had finally done yet another robbery!</p><br/><p>Sha Dulong and the others had an urge to cry out right now. But looking at the mighty back view of their Boss, they were filled with a look of utmost respect.</p><br/><p>The Boss was the Boss indeed. The moment he came, everything changed instantaneously.</p><br/><p>Seemed like robbery was a form of art as well.</p><br/><p>Thinking back to their lifetime of robbery and compared to the Boss, they were really worlds apart.</p><br/><p>‘But Boss…are you really just going to ignore that fella?!’</p><br/><p>‘That fella’s aura’s getting scarier and scarier!’</p><br/><p>And why did those chains surrounding his body give off such a foreboding aura of destruction?!</p><br/><p>\"Everyone, I’m the Mistress of the Han Family. Please give me some face.\" Han Mei’s heart was pretty nervous right now. However, looking at Chen Xuan who was unsealing, she regained a bit of hope.</p><br/><p>\"True. Since you’ve spoken up, I can’t just ignore you and not give you any face. Then, other than your undergarments, panties AND clothes, hand everything else over.\"</p><br/><p>\"URGH…!\"</p><br/><p>At this moment, Sha Dulong and the others were filled with even more respect towards Lin Fan.</p><br/><p>The Boss was the Boss indeed! Even the amount of face he gave was beyond words!</p><br/><p>\"ARGH…HOW DARE YOU GUYS IGNORE ME…I’LL LET YOU FEAR MY POWER…!\" Chen Xuan’s voice rang over from a distance. A surge of energy gushed up into the skies as the color of the Heavens changed.</p><br/><p>‘Damn it…god bloody damn it! He, Chen Xuan, was supposed to be the center of attention! Why was he given the cold shoulder right now?’</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHA. I totally burst out laughing at the slap flying part. And even until now he’s still unsealing! I love how the author just keeps giving us gag characters in gag scenarios like these HAHA! Cheers!</p><br/>\n</div>"}