{"title": "Chapter 359: One Should Definitely Be Shocked", "id": 359, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-359-one-should-definitely-be-shocked", "volume_title": "Volume 4", "body": "<h1>Chapter 359: One Should Definitely Be Shocked</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 359: One Should Definitely Be Shocked</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>If someone had said this to her, ‘At the brink of your sect’s destruction, there will be a man and a beast who will be served at your sect as though they were your Founder Ancestors’, the Grandmaster of Xianling Sect would have laughed off at this absurdity. But now that the facts were right before her very eyes, she couldn’t help but believe.</p><br/><p>At this moment, the Grandmaster of Xianling Sect felt as though something was choking her up her windpipe that she was unable to remove.</p><br/><p>The holy woman, Yanran’s breathing was getting haphazard as well. Her chest was huffing up and down rapidly. She would not have expected that her junior sisters would completely disregard the safety of the sect as a whole.</p><br/><p>Just who was this man? Where did he come from?</p><br/><p>At such a young age, how could he be a match for that demon?</p><br/><p>Laughable. What a joke indeed!</p><br/><p>\"B*stard! Xianling Sect, and you, and your puny chicken… All of you shall die under my majestic demonic powers! I’m done playing with you guys! All of you shall perish!\" Yama hollered out in anger. The demonic aura in the air thickened rapidly into the shape of a malevolent face that was looking down on the ground, threatening to devour the entire Xianling Sect whole.</p><br/><p>Xianling Sect’s Grandmaster and the other Senior Elders turned pale instantly. Not good! They had no confidence of withstanding such a mighty attack!</p><br/><p>The Grandmaster and the other Senior Elders swore to live and die by the sect.</p><br/><p>The holy woman Yanran could no longer bother to pay attention to her junior sisters who had gone insane. She looked up into the sky, biting onto her pink lips. She was pinching her fingers so hard that they were flushed red as well.</p><br/><p>To her, Xianling Sect was a formidable force to be reckoned with. But now that the demon had confronted them head-on, the sect was facing extinction.</p><br/><p>But of course, her deepest disappointment came from these disciples who were completely disregarding the sect. This dug a hole within Yanran’s heart.</p><br/><p>But no matter what, these were her very own junior sisters. She presumed that they must have broken down mentally under the immense pressure right now.</p><br/><p>Lying there, Lin Fan could not help but feel a sense of exasperation.</p><br/><p>Couldn’t the Grandmaster and Senior Elders of Xianling Sect tell that Yours Truly was such a powerful being? Why was it that he was being ignored by everyone other than these female disciples who were serving him?</p><br/><p>This didn’t make sense. Not at all!</p><br/><p>But of course, one could not blame these folks from Xianling Sect.</p><br/><p>The way that he had made his entrance this time round did not really seem to inspire much confidence. Coupled with the fact that he was lying there like a prodigal son right now, enjoying his life, there was no way he presented the demeanor of a powerful man.</p><br/><p>\"Demon, our sect shall fight you to the bitter end today!\" Looking at the rising demonic aura in the sky, the Grandmaster of Xianling Sect made a final holler.</p><br/><p>\"HAHA…! Even if you want to fight me to the end, you’re not worthy.\" Yama laughed cruelly. That sinister laughter sent a shiver down the spines of every other disciple with a fear they could not explain.</p><br/><p>\"Hey, small little demon! Quit your whining! You’re disturbing my sword dance here! Are you looking for death?\" A female disciple who was performing the sword dance for Lin Fan had collapsed onto the ground, unable to withstand the demonic pressure being exerted from Yama.</p><br/><p>\"Huh?\" Hearing this man’s voice, Yama was ever more riled up. He then laughed coldly, \"Kid, you’ve enjoyed in the duration I’ve allowed you to. Now, it’s time for me to show you what is knowing your place.\"</p><br/><p>Yama held a deep resentment towards Lin Fan. As men, how were they treated so differently!? And the fact that Chicky was getting such attention compared to him was absolutely intolerable for Yama.</p><br/><p>Thinking back to his younger days, he was a suave and handsome young man as well. But all of this changed one day. As such, he hated every single man in this world who was having a better life than him. Especially so for this insolent behaving young man before him.</p><br/><p>Torment. Cruel tortures! He had to let this man know what was the outcome of riling someone like him!</p><br/><p>\"Knowing my place? Forget it, I’m too lazy to bother with your nonsense. Let me play with you first.\" Looking at Yama in the sky, Lin Fan waved his hand casually.</p><br/><p>Suddenly, a three-headed and six armed Faceless Sky Demon appeared above Lin Fan.</p><br/><p>‘Firmament Sword.’</p><br/><p>Waving his hand again, six swords that were materialized out of his Sword Will floating in the sky.</p><br/><p>Wielding these six swords, the Faceless Sky Demon looked ever more malicious. With three different expressions, those heads covered all directions.</p><br/><p>\"Go…!\"</p><br/><p>Under Lin Fan’s diligence, Faceless Sky Demon was reaching greater states gradually. As such, it was already pretty formidable right now. Coupled with the sword wills, it could let out an even stronger amount of power.</p><br/><p>Even though this was still far from comparable to Yama, it should be sufficient just to play with him. At the very least, this should last till his massage session and sword dance was over.</p><br/><p>\"Don’t stop. Go on. The dances are great.\" Lin Fan commented softly.</p><br/><p>The moment the Faceless Sky Demon appeared, everyone from Xianling Sect were stunned.</p><br/><p>\"How could this be?\" Looking at the scene before her, Xianling Sect’s Grandmaster looked at Lin Fan in disbelief.</p><br/><p>She knew of the Faceless Sky Demon as well. This was an extremely high leveled skill that one could possess. Furthermore, only someone who had cultivated it to a certain state could even summon a physical manifestation of the Faceless Sky Demon!</p><br/><p>Even among those people in Dongling Continent who had learned the skill, there were barely any who could summon out a Faceless Sky Demon.</p><br/><p>To think that this young man would have such capabilities!</p><br/><p>But suddenly, yet another shock came to the Grandmaster. Something else unbelievable had occurred to her.</p><br/><p>Back when these female disciples came back from the Dead Demon Seas, she was really upset to find out that the Elder she had sent along with them had perished.</p><br/><p>Listening to the description of these disciples related, the Elder had presumably been sucked up by a stone coffin.</p><br/><p>The moment she heard this, she was barely even listening anymore. It all sounded absurd.</p><br/><p>If there was indeed something that strong that existed in this world, how could they have survived? Perhaps these disciples were shocked out of their wits by what happened there and were making up tales.</p><br/><p>As to what they said after that about some young man being a powerful being and destroying every single thing with a single wave of his hand, she could not even listen in to a single thing that they were talking about.</p><br/><p>The world had no shortage of unusual talents, but the best they could do was to obtain a greater celestial full cultivation state at a faster pace than others. However, the gathering of energy grid line chains still required the sedimentation of time.</p><br/><p>One might possibly need countless of years for a single energy grid line chain. And the more energy grid line chains one possessed, the slower the speed they congealed the next one would be.</p><br/><p>\"Hmph! Insolent! Just a mere Faceless Sky Demon and you think you can stop me?! That’s a fool’s dream! Go and die!\" With a single roar, Yama sent a ball of demonic energy flying towards the Faceless Sky Demon.</p><br/><p>Crick. Crick.</p><br/><p>Suddenly, the Faceless Sky Demon rose up. With a slice of the six sword wills, the demonic energy ball instantly disintegrated into nothingness.</p><br/><p>\"Oh, you tiny little small puny demon! You can’t even deal with my Faceless Sky Demon and you’re talking about taking me down? What a joke!\" Looking at what happened up in the sky, Lin Fan replied in disdain.</p><br/><p>‘Cuckcuckoo…!!!’ Chicky cried out to the sky as well, as though he was jeering at Yama.</p><br/><p>\"B*STARD…!!!\" Yama was thoroughly enraged. He darted towards the Faceless Sky Demon personally. He swore that he wouldn’t rest until he tore this guy up to shreds.</p><br/><p>Looking at the scene before her, holy woman Yanran was stumped as well. This wasn’t what she had expected!</p><br/><p>To think that the young man could be this strong!</p><br/><p>\"Senior sister, I’m not bluffing you! This powerful man is really strong! That puny demon is definitely not his match!\"</p><br/><p>\"That’s right, senior sister! Sir Chicky wants you to rub his belly! Come on over!\"</p><br/><p>Listening to these words by her junior sisters, she could barely find a place for herself. It was as though she was the one who was deranged all from the start, and that these junior sisters were the ones who were clear and knowing about the entire situation!</p><br/><p>When she heard her junior sisters talk about the powerful man, she was bewildered thinking that they’ve gone nuts. But now, she had actually witnessed it herself. With a single wave of his hand, he had summoned a Faceless Sky Demon which could hold its own against Yama right now.</p><br/><p>All the other Xianling Sect disciples were rife in whispers right now.</p><br/><p>\"So, the powerful man that these senior sisters were talking about does exist!\"</p><br/><p>\"That’s right! I couldn’t believe it myself at first. To think that he’s this strong!\"</p><br/><p>\"And he’s really handsome, isn’t he?\"</p><br/><p>\"I wish I could be in their positions serving him right now!\"</p><br/><p>\"Big Senior Sister has it lucky though! She was specifically chosen by that Sir Chicky for his belly rub! How I wish I could be Big Senior Sister right now!\"</p><br/><p>\"Dream on, girl! We’re nowhere as pretty as Big Senior Sister!\"</p><br/><p>...</p><br/><p>Listening to these whispers, Yanran was absolutely befuddled right now.</p><br/><p>\"Yanran, erm, how about you go give it a rub?\" Xianling Sect’s Grandmaster suddenly said out aloud.</p><br/><p>\"Ah…!\" Yanran looked at her Grandmaster squarely, feeling like her entire mind was in a state of chaos.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>This book’s new title should be. The Strongest Servants of Lin Fan. HAHAHA.</p><br/>\n</div>"}