{"title": "Chapter 353: This Would Be An Interesting Affair", "id": 353, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-353-this-would-be-an-interesting-affair", "volume_title": "Volume 4", "body": "<h1>Chapter 353: This Would Be An Interesting Affair</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 353: This Would Be An Interesting Affair</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Lin Fan’s single ‘What’s up?’ had everyone completely dumbfounded. His calm demeanor just gave off a feeling that made people want to whack him up. But at the same time, all the elders of Heaven Sea Sect were at a loss of what to do.</p><br/><p>Looking at their lifeless Grandmaster lying on the floor and the man who had knocked straight up their front doors, it would be a lie to say that these elders weren’t mad right now. But against this man of absolute strength, there was nothing for them to resist at all.</p><br/><p>In fact, some of the elders had even begun to find excuses to console themselves.</p><br/><p>‘The Grandmaster has committed many sins, and this was his comeuppance.’ They told themselves.</p><br/><p>But all of these were mere excuses in front of someone that strong. If Lin Fan weren’t so tough, all of these elders would have ganged up and walloped him to death.</p><br/><p>\"N-nothing!\" The elder shook his head furiously.</p><br/><p>Sha Dulong and the others looked at their Boss with their mouths wide agape. At the same time, they were thoroughly impressed with everyone from Heaven Sea Sect. Their Grandmaster has just been killed right before their very eyes, but none of them would even dare to let out a single fart!</p><br/><p>If they were just a little irritated, the fourteen sand bandits would be a little impressed. But to think that they could act as though nothing entirely had happened. That type of strength within their hearts was thoroughly impressive.</p><br/><p>\"I know that you’re all feeling indignant…\" Lin Fan told the masses.</p><br/><p>\"No no no! Nope! Absolutely not! This was his own doing! He destroyed the sects of others and was downright cruel. We had already expected this retribution of his to come one day. You’ve just helped Heaven Sea Sect remove a scourge in our midst!\" One of the elders explained hurriedly.</p><br/><p>\"That’s right! This Sun Changtian has always been selfish and despicable! We, Heaven Sea Sect, are a righteous sect! But under his leadership, we have been forced to commit many crimes! Even if we wanted to rebel, we were definitely not his match!\"</p><br/><p>\"How could we be indignant?! We’re more than happy right now! Glory Sect is a great sect indeed! To think that you guys would help us out, knowing that we’re in deep waters! Heaven Sea Sect shall always remember this gratitude deep in our hearts!\"</p><br/><p>...</p><br/><p>Lin Fan had wanted to add in some additional words to show off his air of superiority. But looking at how these elders were behaving out of his expectations, he was completely stumped.</p><br/><p>The f*ck? Just what sort of a sect was this?!</p><br/><p>Why were the people within it all like clowns?!</p><br/><p>But looking at Grandmaster Sun, a thought crossed Lin Fan’s mind. No matter how small it is, a mosquito still had meat. He had wanted to leave the body to Heaven Sea Sect. But looking at how the situation unfolded, he might as well help them clear it and be done with it.</p><br/><p>\"Since that’s the case, then I’ll help you guys get rid of this guy’s body. That’ll save you guys some trouble.\" Sweeping his robes, Lin Fan tossed the entire body of Grandmaster Sun within his storage.</p><br/><p>The elders glanced at one another with a pained emotion in their hearts. The items on Grandmaster Sun’s body was important to them! After all, there were many things pertaining to the Heaven Sea Sect within his storage.</p><br/><p>\"Well, since I’m exacting justice for the Heavens, you guys can have his storage ring.\" Lin Fan tossed the storage ring over.</p><br/><p>Now that he had knocked straight up their door and killed their leader, to think that they were even thanking him for it. If he were to still rob the stuff clean, then that would be going pretty overboard.</p><br/><p>\"Aiyo! Thank you, sir! Thank you!\" The moment the elders heard this, all of them thanked Lin Fan profusely.</p><br/><p>As for Sun Changtian being slain, there was nothing for them to argue about it. After all, he was dead no matter what. In fact, they weren’t even begrudging of his death. So be it if this guy was ugly to begin with. To think that he would still hold on to most of the power usually, causing the other elders to look as though they were decorative objects who served no purpose at all.</p><br/><p>\"It’s okay, save the thanks. It was no effort at all. Let’s go.\" He beckoned to the others and headed down the peak.</p><br/><p>Seeing that this godlike figure was leaving, everyone from Heaven Sea Sect followed along and sent him off.</p><br/><p>\"Have a safe trip!\"</p><br/><p>\"Thank you!\"</p><br/><p>\"Come and have a rest when you’re free!\"</p><br/><p>\"Glory Sect is Glory Sect indeed! Exacting justice for us!\"</p><br/><p>...</p><br/><p>Following behind Lin Fan, Sha Dulong and the others were feeling extremely strange about everything right now. Seemed like this was a new experience for them to learn from as well.</p><br/><p>Coming to someone’s sect to kill their Boss and in return, receiving all the warm welcome and hospitality from their disciples… Wow?!</p><br/><p>They had once killed a disciple of a sect as well. But they were chased to near death by that sect in return.</p><br/><p>But the person their Boss had killed now was the other party’s Grandmaster! Not only was he free from their wrath, he was even being treated so extravagantly by them! If they were to compare their own experiences with what was happening now, they would really just puke blood over and over again.</p><br/><p>Han Mei had long lost her sense of logic. She just walked flabbergasted behind Lin Fan and the others like a zombie.</p><br/><p>To Han Mei, everything that had happened today was just like a dream. Even as they were leaving, her entire face was just stoned.</p><br/><p>...</p><br/><p>Heaven Sea Sect…</p><br/><p>The elders wiped the sweat off their foreheads and looked at one another.</p><br/><p>‘That’s it?\"</p><br/><p>\"Then what do you want?\"</p><br/><p>\"Even though Sun Changtian went overboard, he was our Grandmaster overall. Now that he’s been slain by someone, where should Heaven Sea Sect hide our faces from now on?\"</p><br/><p>\"Then what do you propose?\"</p><br/><p>\"We should take out our dignity as Heaven Sea Sect disciples! Let’s fight for our disciples! Fellow brothers, what do you think about that?\"</p><br/><p>\"Hmm, not bad. You’re right, junior brother. But this is a tough mission. I guess we’ll have to trouble you alone, junior brother.\"</p><br/><p>\"Eh, senior brother. You guys…\"</p><br/><p>\"Bloody retard…\"</p><br/><p>...</p><br/><p>And just like that, the deal was completed beautifully.</p><br/><p>The little girl started bawling, as if she were finally relieved of all the indignance in her heart. That face of hers which was filled with mud and dirt was wet with tears that were pouring down like rain.</p><br/><p>\"Sir. T-thank you!\" She knelt down in front of Lin Fan.</p><br/><p>\"It’s okay, save the thanks. This was a fair trade which we both agreed to. There’s no sympathy to talk about.\" Lin Fan replied casually.</p><br/><p>\"Please take me in as a disciple, great sir! I promise to always serve by your side from now on!\" She girl’s eyes were filled with a thirsty glint.</p><br/><p>Lin Fan frowned. Bloody hell! Yours Truly was not running an orphanage here! Why was there suddenly someone else who was begging to be his disciple?</p><br/><p>He hesitated slightly.</p><br/><p>\"Little girl, wipe your face.\" Han Mei who was standing at one side took out a handkerchief.</p><br/><p>As the little girl wiped the dirt off her face, Lin Fan was shocked.</p><br/><p>Bloody hell! He hadn’t noticed it earlier, but weren’t her features really exquisite?!</p><br/><p>And to think that there was a birthmark in the form of a plum blossom on her forehead!</p><br/><p>Han Mei was equally stumped at how sharp the features of this girl were. In fact, she could seem to even make out an air of superiority from this little girl, as if she were looking down at the entire world in disdain.</p><br/><p>But Han Mei thought that she must have been mistaken.</p><br/><p>How could a little child give off such a feeling?</p><br/><p>Lin Fan sized this girl up properly.</p><br/><p>\"What’s your name?\" He asked softly.</p><br/><p>\"You Jiuling.\" She replied.</p><br/><p>Lin Fan focused his gaze. You Jiuling’s fortune seemed pretty impossible, with an extremely high innate potential.</p><br/><p>He contemplated silently for a moment. He already had a disciple, Zhiqiao that young lass. Ever since she had acknowledged him as her master, her fortune was improving all the while.</p><br/><p>Even though her innate potential was a little lackluster at the start, with his constant training, her potential was now pretty extraordinary as well.</p><br/><p>If there were no issue, these two girls should probably grow up to excel pretty well.</p><br/><p>But Lin Fan could not shake off a feeling.</p><br/><p>If he were to take in You Jiuling as a disciple, there might come a day where his two disciples would grasp at one another’s throats.</p><br/><p>Interesting indeed!</p><br/><p>\"Okay…\" Lin Fan replied.</p><br/><p>Secretly, Lin Fan was exhilarated when he noticed that You Jiuling’s fortune spiked up once more the moment he agreed to her request. It was like a typhoon that rose.</p><br/><p>Of course, for anyone without the system, this would be impossible for them to see.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Hi guys! An interesting tidbit. You Jiuling’s name in the raw translates to Ghoul, Nine Spirits. Now, if you guys remember, Chen Xuan was just sent to the Nine Spirits Realm to retrieve the Supreme Being’s Token Shard. I wonder if these have any relation. Also, this girl seems pretty scheming. I’m worried that she might harm our cute Cai Zhiqiao :(</p><br/>\n</div>"}