{"title": "Chapter 372: Whacked The Moment He Comes Out", "id": 372, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-372-whacked-the-moment-he-comes-out", "volume_title": "Volume 4", "body": "<h1>Chapter 372: Whacked The Moment He Comes Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 372: Whacked The Moment He Comes Out</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Buddha’s Land was able to take down every single evil in this world. The Buddhist chants turned into mysterious symbols of their own as they coiled together, turning into a golden Buddhist dragon. Howling fiercely, it wrapped itself around the indestructible body of the big ancient demon.</p><br/><p>Meng Hao darted out as well. A single slash to destroy everything, this was the unrelenting will of the God of War. With a long scythe which slashed at everything in its way, Meng Hao cut at the big ancient demon.</p><br/><p>...</p><br/><p>\"HAHA! Ants, ants... I’ve already said that you guys are far from home! Today, all of you shall die.\" The big ancient demon howled out.</p><br/><p>BOOM!</p><br/><p>Suddenly, the ground shook as the skies turned pitch-black. This was not the power of energy grids. This was something far stronger than that!</p><br/><p>In front of the big ancient demon, Mie Qiongqi and the others were simply too weak!</p><br/><p>In the face of absolute power, all efforts were meaningless.</p><br/><p>‘Urgh…!’</p><br/><p>With a single strike by the big ancient demon, everyone’s figures were sent flying back. Spewing out fresh blood, all of their bodies felt like they were shattered.</p><br/><p>\"We’re just too weak.\" Looking at everything before him, Lu Yan could feel the despair growing in his heart.</p><br/><p>Meng Hao wanted to stand up, but that single strike had shattered all his bones.</p><br/><p>Strong... Simply too strong.</p><br/><p>This wasn’t something that they could deal with.</p><br/><p>They might have had confidence in themselves at the beginning. But at this point, Meng Hao finally understood that against the big ancient demon, all of these were just mere tickles.</p><br/><p>The Roc within the big ancient demon’s grasp struggled continuously, churning out the energies of both Yin and Yang. But to the big ancient demon, it was all useless.</p><br/><p>\"Haha! I was the one who had destroyed your race, Roc. Once I regain my peak status, you and your kind shall disappear from the face of this world entirely!\"</p><br/><p>The eyes of the big ancient demon were cruel, as demonic energy filled his body. At this moment, he looked like a peerless demon that had ascended from the very depths of Hell. With a tight pull, those malicious arms of his seemed to be ripping the entire sky apart.</p><br/><p>One of the Ten Great Beasts, the Roc, was torn cleanly into two. Spurting out fresh blood from its body, its lifeless body was all that remained in the hands of the big ancient demon.</p><br/><p>The blood of the Roc stained the big ancient demon. At this moment, his disposition was intimidating like never before.</p><br/><p>With a suck of his belly, the mighty, formidable Roc which was now in two pieces were sucked into the tummy of this big ancient demon.</p><br/><p>When something of this power descended upon the world, no one could stop it at all.</p><br/><p>The Grandmaster of the Roc Sect was completely dumbfounded by now.</p><br/><p>Roc…That was a real life, living Roc!</p><br/><p>That was the strongest existence in their entire sect. And right now, it just perished like it was nothing in the hands of the big ancient demon!</p><br/><p>\"Hey, ant! You better keep summoning more Rocs for me!\" The purple eyes of the big ancient demon were fixated on the Grandmaster of the Roc Sect.</p><br/><p>\"You demon…!\" The Grandmaster of Roc Sect stumbled back a few steps in fear.</p><br/><p>They were all wrong.</p><br/><p>Even after the big ancient demon had fallen for tens of thousands of years, his revival was not something they could handle at all.</p><br/><p>\"Heaven! HEAVENS! WHY DO YOU SEND US TO OUR DEATHS…!\" Right now, the Grandmaster of the Roc Sect was raging at the Heavens.</p><br/><p>Heaven’s Will. This was all the will of the Heavens!</p><br/><p>\"Hmph. The Heavens can barely protect themselves right now, let alone you. All of you can go and die.\" Looking at the skies, the big ancient demon chuckled.</p><br/><p>BOOOM!</p><br/><p>Suddenly, the Heavens and Earth fell into darkness.</p><br/><p>One by one, all 30 top sects were being pushed back against this big ancient demon. There was no room for resistance. If not for the fact that they were cooperating right now, their casualties might be even greater than right now.</p><br/><p>\"Grandmaster, what should we do? This big ancient demon is simply too strong! Our attacks have no effect on him at all!\" Senior Elder Wuya said.</p><br/><p>Grandmaster Yan’s face was grim. He too had no idea what to do.</p><br/><p>This was not an enemy they could handle at all!</p><br/><p>For ancient beings, even an ant would be way stronger than anything else in this world, let alone a demon lord of the ancient times.</p><br/><p>And just then, a bright beam of light erupted out from the skies. This rainbow colored beam wrapped itself around everyone present.</p><br/><p>The expressions of Grandmaster Yan and the others changed, \"This is…!\"</p><br/><p>Everyone could feel the changes in their bodies.</p><br/><p>Lu Yan and the others were suffering great injuries right now. But under the rainbow light of the skies, their injuries recovered rapidly. In fact, their cultivation states were rising rapidly as well.</p><br/><p>The big ancient demon looked at the changes of everyone, then up at the sky, \"Seems like you couldn’t let them go after all, eh? But, so what? All you can do is raise their powers temporarily. Seems like you won’t be able to hold out for much longer as well, eh?\"</p><br/><p>Everyone stood up and looked at the changes on themselves with extreme bewilderment.</p><br/><p>\"Our cultivation states…they’ve increased!\"</p><br/><p>\"Our injuries are all healed!\"</p><br/><p>\"What was that beam of light?! Was that really the Heavens that descended upon us?!\"</p><br/><p>...</p><br/><p>\"Everyone, prepare yourselves! This time around, we must surely stand united and take down the demon lord!\"</p><br/><p>...</p><br/><p>That rainbow beam of light had a massive impact on everyone’s morale. Lu Yan and the others looked at one another.</p><br/><p>‘Greater celestial full cultivation.’</p><br/><p>They were only at lesser celestial and pericelestial cultivation states earlier on. But right now, their cultivation states had rocketed completely.</p><br/><p>Even if this were temporary, it still filled their hearts with immense hope.</p><br/><p>\"Everyone, LET’S GO!\" Mie Qiongqi hollered.</p><br/><p>\"ALRIGHT…!\"</p><br/><p>The aura that erupted from these people who had their cultivation states improved were massive. It was more than ten times stronger than before.</p><br/><p>Buddha Land’s Descent!</p><br/><p>Sword Realm!</p><br/><p>God of War!</p><br/><p>Everyone let loose a dazzling brilliance.</p><br/><p>The Heavens and Earth shattered as though it was doomsday. Everything in a radius of a thousand miles had long been destroyed barren, where nothing could live and grow anymore.</p><br/><p>After this battle, this place would definitely be non-habitable.</p><br/><p>But against this big ancient demon, no one could have any spare thoughts for things like this. If they didn’t suppress this thing, this would be a calamity for the Dongling Continent.</p><br/><p>Four hours passed…</p><br/><p>Even though the time was short in reality, it felt like years had passed for these warriors. Even with the boost of the rainbow beam, they were still no match for the big ancient demon.</p><br/><p>BAM! BAM!</p><br/><p>Right now, everyone from the different sects were on the brink of exhaustion. Every single bit of hope they had earlier were about to be extinguished right here.</p><br/><p>\"Ants…you b*stard ants…!\" The ferocious eyes of the big ancient demon looked down at these humans in disdain.</p><br/><p>How dare these ants be as detestable as that man just now?</p><br/><p>\"Grandmaster, are you alright?\" The body of Senior Elder Wuya was almost at its limit. He coughed out mouthfuls of fresh blood one after another. To think that this battle was even more severe than the previous one for their sect’s existence.</p><br/><p>Perhaps, there was truly no more hope this time left.</p><br/><p>Lin Fan.</p><br/><p>Suddenly, Senior Elder Wuya’s thoughts went to that lad. But he shook his head. Even the combined strength of all these sects were no match for that thing. No matter how strong that lad was, there was no way he could be a match for this big ancient demon.</p><br/><p>\"It’s alright. I can still hang on.\" Grandmaster Yan was looking extremely horrible right now as well.</p><br/><p>...</p><br/><p>Mie Qiongqi had taken the most damage to his body. But the will of Unkillable Indestructible supported him, allowing him to stand up time after time, no matter how much he was downed.</p><br/><p>\"We’ve tried our best.\" Meng Hao laid there, wounds aplenty on his body with white bones protruding. He had slashed and slashed and slashed, such that his hands were now numb with no feeling.</p><br/><p>\"Junior Brother Lu, to think that you’re this strong. I couldn’t tell at all before today.\" Jian Wudi laid there monotonously, eyes looking at Lu Yan.</p><br/><p>Lu Yan did not reply. He just laid there silently, with many thoughts flashing through his mind.</p><br/><p>Back when he just entered the sect…</p><br/><p>That damned Senior Brother Lin chose a few pieces of trash over him with no foresight at all!</p><br/><p>To prove Senior Brother Lin wrong so that he would regret missing out on a genius like him, he had cultivated himself relentlessly. Even with this mysterious prayer beads that he had obtained, he did not take things easy because of it.</p><br/><p>Right now, Lu Yan realized how childish everything had been. But it was still a wonderful memory.</p><br/><p>Letting go of everything with no attachments, this was the one thing Lu Yan had realized at the brink of his death.</p><br/><p>\"If I don’t enter hell, who would?\" Lu Yan muttered softly.</p><br/><p>\"What did you say, Junior Brother Lu?\" Jian Wudi was startled as he looked at Lu Yan.</p><br/><p>Lu Yan stood up expressionlessly. Placing his palms together, a bright Buddhist aura appeared before him.</p><br/><p>A step at a time, he walked towards the big ancient demon.</p><br/><p>\"Junior Brother Lu, what are you doing…!\" Looking at this, everyone exclaimed out in shock.</p><br/><p>But to Lu Yan, it was as though everyone’s voices were shut off by a barrier.</p><br/><p>Suddenly, the mysterious prayer beads on Lu Yan’s neck floated up gently before emitting a piercing golden light.</p><br/><p>An image of Buddha appeared above Lu Yan’s head.</p><br/><p>‘The Supreme Buddha of the world.’</p><br/><p>\"Grandmaster, Elder, Senior Brothers. I shall take my leave before you guys.\" Lu Yan stopped in his tracks before turning around and saying to everyone.</p><br/><p>...</p><br/><p>\"Hmph, little Buddhist monk. You’ve laid down a lofty ambition to take me down, eh? A pity that you’re far from qualified.\" The big ancient demon laughed coldly.</p><br/><p>\"But fair enough. Since that’s the case, I shall fulfill your wishes. I have to see just how strong your lofty ambition is.\"</p><br/><p>Suddenly, a formidable and horrifying fist slammed down from the Heavens. Lu Yan stood there without happiness or fear, awaiting his final moment.</p><br/><p>\"Junior Brother…!\"</p><br/><p>...</p><br/><p>\"The f*ck!? Who the hell dares to stand atop Yours Truly?! Scram one side!\" It was as though someone was trying to burrow out from the ground below, but was blocked by Lu Yan standing above.</p><br/><p>Suddenly, a hand stretched out from beneath the ground. Grabbing Lu Yan’s ankles, the arm hurled Lu Yan to one side.</p><br/><p>\"The f*ck…?!\" As Lin Fan crawled out from below, he was stunned by the sight before him.</p><br/><p>Lin Fan was not the only one stunned.</p><br/><p>Everyone from Glory Sect were equally flabbergasted.</p><br/><p>\"Lin Fan…!\"</p><br/><p>\"Junior Master…!\"</p><br/><p>As for Lu Yan who was flung aside by Lin Fan, a look of displeasure spread out from his face, \"B*stard! It’s you again!\"</p><br/><p>...</p><br/><p>Lin Fan had not expected to be able to see his own sect after coming out of the hole. But just then, he felt as though there was something about to hit him.</p><br/><p>Raising his head, he was exasperated at what he saw above.</p><br/><p>\"The f*ck! Yours Truly have just came out, and I’m gonna get whacked again?!\"</p><br/><p>BAM!</p><br/><p>\"CAREFUL!\"</p><br/><p>Everyone from Glory Sect cried out.</p><br/><p>But it was all too late…</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHA. I never laughed so hard at Lin Fan’s appearance. Who dares stand atop Yours Truly. Goodness, this man please hahaha.</p><br/><p>Anyways, author’s comments once more for you guys: ‘It’s time to write more about the side characters. After all, they will have their own stories to tell in the later stage. For now, please give me more support guys! I promise that the story will no longer have so many fillers! Promise promise!’</p><br/><p>Hahaha! So there you have it. Could we finally have a linear exciting path up? We can only hope! Cheers!</p><br/><p>Ps: I fell sick yesterday. Trying my best to recover but I may not be able to to reply your comments and stuff again. Will still try my best! Sorry! :(</p><br/>\n</div>"}