{"title": "Chapter 374: A Move That Destroys The Balance Of The World", "id": 374, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-374-a-move-that-destroys-the-balance-of-the-world", "volume_title": "Volume 4", "body": "<h1>Chapter 374: A Move That Destroys The Balance Of The World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 374: A Move That Destroys The Balance Of The World</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"INSOLENT…!\" The big ancient demon was totally riled right now. His devastating punch brought with it the power of a thunderstorm as he slammed down at Lin Fan.</p><br/><p>That pitch-black chain ripped through the skies, bringing with it a nerve-chilling aura through the skies.</p><br/><p>\"Hmph. You think you’re the only one that’s strong? Yours Truly didn’t grow up as a ninety-pound weakling either. A hundred pieces of Heaven graded upper armors have already taken away all of my net worth. Today, Yours Truly shall duke it out to death with you!’ With a maddened roar, every single punch of Lin Fan came off with a sting.</p><br/><p>This violent, tremendous force from him rippled through the entire Heavens and Earth.</p><br/><p>\"ANT, YOUR STRENGTH IS SIMPLY FAR TOO WEAK!\" The big ancient demon howled. To think that he couldn’t even kill such a weak little ant! That was a humiliation for him!</p><br/><p>Lin Fan knew that his power right now was limited. Even though his Physical Body State had broken through the barriers of this world, his cultivation base had yet to improve.</p><br/><p>Even if his punch had landed directly on the big ancient demon, it wouldn’t have caused him any damage.</p><br/><p>But to Lin Fan, the most important thing right now was to have a blood pumping battle. After all, how could he captivate the hearts of all these surrounding audiences if the battle wasn’t heated up?</p><br/><p>BOOM!</p><br/><p>The big ancient demon sent a punch pummelling down, coiled with demonic energy along with it. Showing not a single bit of fear, Lin Fan threw back another punch in retaliation.</p><br/><p>The ensuing shockwave rippled through the air. It was so mighty that the people from all the different sects could barely handle this devastating impact.</p><br/><p>\"Too strong…!\"</p><br/><p>\"Just what sort of a beast is he! For him to be able to cultivate his physical body state as such!\"</p><br/><p>\"Goodness, Glory Sect is definitely not a sect which any other sect can deal with at all!\"</p><br/><p>\"Once this battle is over, it is clear which sect would be the No. 1 in the entire Dongling Continent for sure!\"</p><br/><p>Senior Elder Wuya and the others were equally dumbfounded.</p><br/><p>They had thought that Lin Fan was strong, but they had not thought that he was THIS strong. He was so strong that the power exuding was almost causing even them to break down!</p><br/><p>This was no longer a state achievable by a human being!</p><br/><p>A loud cracking boom rang through the skies. The color of the skies changed as the void began to rip apart.</p><br/><p>Just these views alone were beyond the imaginations of anyone’s minds.</p><br/><p>\"HAHA…Big ancient demon? What capabilities do you have to take down Yours Truly?\" Lin Fan could finally experience a battle he could enjoy. Even though his strength might not be able to deal even a single bit of damage onto the big ancient demon, just the feeling of landing punches after punches was exhilarating enough for him.</p><br/><p>Breaking through the barrier of Physical Body State, that was an extremely great feeling!</p><br/><p>While every punch he received would cause 5 Heaven graded upper armors to shatter, this was all worthwhile to Lin Fan.</p><br/><p>Physical Body State: Imperishable Lower Level State.</p><br/><p>This was a mysterious and magical cultivation state which had Lin Fan experiencing all sorts of boundless benefits from it. This was no longer a cultivation state that existed within Dongling Continent.</p><br/><p>Even if Lin Fan were to stand still where he was right now and take in all the attacks of every single last sect in Dongling Continent, none of it would cause him any damage.</p><br/><p>In order to break through this barrier of the Heavens, Lin Fan had gritted his teeth and thrown himself within the Heaven and Earth Smelt. That tormentous ordeal had finally returned its rewards.</p><br/><p>BOOM!</p><br/><p>A fist flew open.</p><br/><p>Floating gently in the air, Lin Fan looked at that totally unharmed big ancient demon and frowned. This situation couldn’t carry on like this. He had to think up of a way to take down this guy.</p><br/><p>The big ancient demon was worthy of his title indeed. Not only was his physical body state stronger than Lin Fan himself, even his power level was far superior.</p><br/><p>\"Ant, even though I don’t know what you did to make your physical body state this strong, but enough is enough. I’ve played enough with you!\" The big ancient demon glared at Lin Fan. Through the body of this ant, he could feel the very same feeling of those darned b*stards he had to deal with back in the ancient times.</p><br/><p>While everyone was shocked by the battle between Lin Fan and the big ancient demon, they could also tell that the big ancient demon wasn’t taking any damage.</p><br/><p>Seemed like it was way too difficult to take down this demon after all.</p><br/><p>Lin Fan did not reply. His brain had been tinkering all this while.</p><br/><p>In order to kill this big ancient demon, the only way to do so might be to drag him within the Heaven and Earth Smelt.</p><br/><p>But even though his physical body state right now was at imperishable, this did not mean that the big ancient demon’s physical body state would be weaker than this.</p><br/><p>No. Wait. There was another way!</p><br/><p>Suddenly, Lin Fan started laughing. As time went by, his laughter only grew in volume.</p><br/><p>\"HAHAHAHA…!\" He laughed wildly. He had finally thought of a way.</p><br/><p>\"ANT! What are you laughing at!\" The big ancient demon hollered.</p><br/><p>This imposing voice rang through the entire skies, causing everyone’s hearts to skip a beat.</p><br/><p>\"Big ancient demon, are you a male or a female?\" Lin Fan asked.</p><br/><p>All the Grandmasters were stumped by this question right now. How could he ask the other party if he were male or female at this juncture?! Wasn’t he just courting death?!</p><br/><p>Anyone with eyes could evidently see that massive junk below!</p><br/><p>\"ANT! HOW DARE YOU TRY TO HUMILIATE ME? I’M AN ANCIENT OVERLORD…\" The big ancient demon was totally riled.</p><br/><p>How dare this puny ant humiliate him as such? How could he tolerate such brazen behavior!?</p><br/><p>\"Seems like you’re a male then. But fair enough. How would you like to experience what it’s like to be a female big ancient demon?\" Lin Fan beamed widely.</p><br/><p>In a swift motion, all the Grandmasters turned their gazes towards Grandmaster Yan, as though implying, ‘This person from your sect, is there anything wrong with his brains?!’</p><br/><p>Looking at the gazes of everyone, Grandmaster Yan lowered his head in embarrassment, as though this was a really difficult question to answer.</p><br/><p>‘Just what are you trying to do, Lin Fan!’</p><br/><p>\"B*STARD ANT…!\" The big ancient demon slammed down with his palm, determined to crush this ant to death.</p><br/><p>\"Hmph... Seems like your embarrassment has turned into rage. Yours Truly will let you understand today what it means to die from menorrhagia.\" With a determined face, Lin Fan flew towards the big ancient demon.</p><br/><p>His agile frame dodged the fist of the big ancient demon.</p><br/><p>Wasn’t this the direst moment to employ something like this?</p><br/><p>The big ancient demon’s body was simply too huge! This might perhaps be his only vital weakness in his entire body.</p><br/><p>Running on the body of the big ancient demon, Lin Fan sprinted towards his crotch area.</p><br/><p>\"ANT…!\" Looking at how defiant this ant was being, the big ancient demon unleashed boundless authority.</p><br/><p>His titanic palm slammed down towards Lin Fan once more.</p><br/><p>BOOM!</p><br/><p>Lin Fan did not even budge a single inch. Using his left hand to defend against the strike of the big ancient demon, his eyes were on the prize.</p><br/><p>There it was…</p><br/><p>The big ancient demon’s pee pee life source.</p><br/><p>\"Just what is Junior Master Lin doing?\" Looking over, Zong Hentian and the others wondered what their Junior Master Lin was up to.</p><br/><p>Male or female?</p><br/><p>What difference did that make?</p><br/><p>Senior Elder Wuya and the others frowned, unable to understand what Lin Fan was pulling as well. But he firmly believed that this lad must have thought up of something good.</p><br/><p>\"Everyone, give him a hand.\" Senior Elder Wuya called out.</p><br/><p>\"Yes…!\" Everyone nodded their heads. Even though they did not know what was happening, they had already placed every single last bit of hope on this lad anyways.</p><br/><p>‘Energy grid line chains!’</p><br/><p>Suddenly, the Heavens shook as one by one, energy grid line chains extended out from the voids.</p><br/><p>The sky was covered with energy grid line chains as they coiled with one another.</p><br/><p>With the combination of all these energy grid line chains, they fused together to form two gigantic energy grid line chains. Agile like snakes, they coiled themselves around the arm of the big ancient demon, restricting its movement.</p><br/><p>\"Good job!\" Looking at this, Lin Fan exclaimed out gleefully. He then increased his speed. Whether or not this succeeded would depend on this!</p><br/><p>And if even this failed, then he would just have to throw his life at this thing to its end.</p><br/><p>Looking at these energy grid line chains on his arm, the big ancient demon howled in anger. Those mysterious runes and symbols on his arm glowed brightly, trying to shake off the tight grasp of these energy grid line chains.</p><br/><p>\"B*STARDS! ANTS! ALL OF YOU F*CKING DESERVE DEATH!\" With a massive yell, the energy grid line chains on his arm began to break down.</p><br/><p>‘URGH…!’</p><br/><p>Everyone from the different sects began coughing out blood.</p><br/><p>This was the aftermath.</p><br/><p>The destruction of their energy grid line chains caused them to suffer damage to their bodies as well.</p><br/><p>Taking in a deep breath, Lin Fan focused his gaze on that massive junk at the crotch of the big ancient demon.</p><br/><p>Breaking free of these energy grid line chains, the big ancient demon came at Lin Fan.</p><br/><p>\"ANT, GO TO HELL…!\" He hollered out furiously. The energy that was erupting out seemed to be extremely devastating.</p><br/><p>\"HMPH, WE’LL SEE WHO DIES FIRST.\" With a single scream, Lin Fan leapt towards the crotch area.</p><br/><p>‘Twisting Heaven and Earth.’</p><br/><p>‘Ice and Fire two Heavens!’</p><br/><p>Coupled with his Twisting Heaven and Earth, the Fire and Water energy grid line chains infused in his left arm unleashed a mysterious energy.</p><br/><p>This was the way of interchanging Yin and Yang.</p><br/><p>Ever since he used it once in Cangling Continent, Lin Fan had never used Twisting Heaven and Earth ever again. Lin Fan felt that this destroyed the natural harmony of the balance of the world.</p><br/><p>But a pity, this big ancient demon asked for it.</p><br/><p>BOOM!</p><br/><p>A vanquishing beam of light covered the entire world, blinding everyone from seeing what was happening.</p><br/><p>But in that instant, a high pitched shriek rang through the Heavens.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHHA. I was thinking that that was the weapon he had in his arsenal right now. But I thought he would be saving it for a ‘natural female’ enemy yknow what I mean guys? I totally did not expect him to use Twisting Heaven and Earth to use THAT. HAHAHAHA. Oh gosh this chapter please.</p><br/>\n</div>"}