{"title": "Chapter 375: Spewing Blood Out Of Excitement", "id": 375, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-375-spewing-blood-out-of-excitement", "volume_title": "Volume 4", "body": "<h1>Chapter 375: Spewing Blood Out Of Excitement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 375: Spewing Blood Out Of Excitement</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Just what in the world happened?\"</p><br/><p>\"That shriek! What’s going on around here?!\"</p><br/><p>That dazzling brilliance filled the entire world, blinding everyone. That was a sign of power at its peak.</p><br/><p>The accompanying shriek was ever more tragic. In fact, there was even sorrow within it, as though it had undergone some form of tormenting hardship.</p><br/><p>When the light faded away, everyone raised their heads to find a figure standing mighty tall.</p><br/><p>That was Lin Fan.</p><br/><p>And the thing that shocked them the most was that the colossal, imposing big ancient demon was now kneeling on the ground, howling wildly.</p><br/><p>‘AHHHHHHHHHHH…!!!’</p><br/><p>\"Ant, what have you done to me?!\" The big ancient demon felt that something about him had changed, but it was hard to use words to describe this change.</p><br/><p>A gentle melancholic feeling was spreading through his heart, and accompanying it was a wave of pain.</p><br/><p>‘Ding…Twisting Heaven and Earth experience points +100,000,000.’</p><br/><p>‘Ding…Twisting Heaven and Earth leveled up. Lvl 18.’</p><br/><p>...</p><br/><p>Lin Fan did not reply, his expression solemn. Even though it was a little awkward, but it had all succeeded in the end.</p><br/><p>Honestly, this big ancient demon was really powerful indeed. Even something like the Twisting Heaven and Earth which could reverse Yin and Yang met with great resistance against this demon.</p><br/><p>But it was all worth it now. As long as the big ancient demon changed entirely, the real show would then begin.</p><br/><p>\"How do you feel?\" Lin Fan chuckled.</p><br/><p>\"B*STARD ANT! WHAT DID YOU DO TO ME…!\" Those malicious eyes of the big ancient demon glowed with boundless evil in those purple pupils. His baleful gaze seemed as though it was bound on devouring Lin Fan.</p><br/><p>\"Oh, nothing much! Just some switching up of the Yin and Yang to let you experience the gentleness and warmth of a woman. Remember, I’m doing it all for free! You’re being charged nothing!\" Lin Fan winked.</p><br/><p>\"You…!\" The big ancient demon’s eyes shone with disbelief as he looked down at his massive junk which was shrinking right now. In fact, the pure Yang demonic energy within his body was gradually converting into Yin as well.</p><br/><p>\"ARGH…!\" The big ancient demon stood up, unable to withstand this humiliation. He was a demon overlord who had conquered over the ancient times! How could this happen to him?</p><br/><p>He had to crush this ant to death viciously! But in the blink of an eye, a sharp pain surged up into his head.</p><br/><p>This pain caused the big ancient demon to give off a look of extreme shock.</p><br/><p>He possessed an imperishable body! How could he be feeling any pain?!</p><br/><p>Impossible…! This was absolutely impossible!</p><br/><p>\"Just what in the world is going on?\" Everyone from the sects enquired. They were entirely stupefied by the scene before them.</p><br/><p>Could this battle’s victory truly belong to them?</p><br/><p>\"I’ve employed a secret technique. This secret skill uses one’s soul as the price for it. But this big ancient demon is just too strong. To think that it only received this much damage.\" Lin Fan’s art of making up bullsh*t lies had reached a level of absolute dominance. It was enough to have anyone’s jaws dropping at his bullsh*t.</p><br/><p>But all these people from the various sects took it as the truth.</p><br/><p>They had witnessed the strength of the big ancient demon for themselves, and they knew how strong this thing was.</p><br/><p>Looking at this big ancient demon, Lin Fan had half a mind to use his Black Tiger Steals Heart as well.</p><br/><p>Ever since he had learned this skill, he hadn’t had the chance to let it evolve. If he could use this big ancient demon to train up that skill, evolution should be a piece of cake.</p><br/><p>But based on the current situation, that might not seem possible.</p><br/><p>Most people would have lost all fighting strength after being dealt with Twisting Heaven and Earth. But to think that this big ancient demon could still hang on like this. Evidently, Twisting Heaven and Earth alone was not enough to deal with it.</p><br/><p>If only Twisting Heaven and Earth had evolved. THAT might probably cause the big ancient demon to lose his fighting strength.</p><br/><p>But even after it lost its fighting strength, it would still be impossible for Lin Fan and the others to kill it using their own methods.</p><br/><p>The physical body state of the big ancient demon had already reached some sort of peak status. It was definitely something that their current cultivation states could not deal with at all.</p><br/><p>\"Changed…it’s finally changed…!\"</p><br/><p>Lin Fan looked over at the throat of the big ancient demon and found that his Adam's apple was gradually disappearing. At the same time, his solemn face was slowly becoming gentler and smoother.</p><br/><p>\"Impossible…absolutely impossible!!!\" The big ancient demon’s tragic cry rang out once more. Upon noticing the changes of his body, he was almost unable to tolerate this entirely.</p><br/><p>This was nothing but a humiliation to him!</p><br/><p>Lin Fan turned around to the masses before grinning.</p><br/><p>Suddenly, he spread open both arms.</p><br/><p>A burst of energy shot out as though he had expended every single thing he had.</p><br/><p>\"What are you doing!\" Noticing this burst of energy, Grandmaster Yan and the others were pale.</p><br/><p>\"Grandmaster! The big ancient demon is an entity that belongs in the ancient times! His physical body state has already surpassed everything within this world! Killing him with just ordinary means would be impossible! For the safety of Dongling Continent, I have to give up everything I’ve got to pull off a horrific skill so that I can take him down!\"</p><br/><p>Lin Fan’s face was filled with determination.</p><br/><p>BOOM!</p><br/><p>Once more, a massive shockwave erupted from Lin Fan. This energy was that of the lifeforce.</p><br/><p>The boundless amount of lifeforce leaked out. Grandmaster Yan and the others could clearly feel this lifeforce.</p><br/><p>\"Lin Fan! Don’t be rash! We can share the responsibility!\" Grandmaster Yan understood what lifeforce represented. It was the essence of one’s being.</p><br/><p>If one exhausted his lifeforce completely, then there would truly be no way to save him.</p><br/><p>\"It’s useless. This horrific secret skill is something that only I can bear with. None of you will be able to help me!\" Lin Fan shook his head as a look of craftiness flashed by his eyes.</p><br/><p>‘Urgh…URGH…!’</p><br/><p>Suddenly, Lin Fan coughed out a few mouthfuls of fresh blood. The moment this blood sprayed up into the skies, they evaporated instantly.</p><br/><p>In the eyes of everyone present, the evaporating blood looked like what would happen to Lin Fan after he was done with this skill.</p><br/><p>\"Hais, to think that I would be able to meet with such a righteous and just man in my life!\"</p><br/><p>\"That’s right! I used to think that Glory Sect wasn’t deserving of the title of being No.1 in the past! But now that I look at it, I realize the distinct disparity between our disciples and theirs!\"</p><br/><p>...</p><br/><p>\"Grandmaster, it’s alright, don’t hold me back anymore. All of this has to happen. Else, everyone would be dead once that big ancient demon recovers!\" Lin Fan’s voice was slightly hoarse right now, as though he was already ready to face his death.</p><br/><p>Looking at the skinny, frail body of Lin Fan right now, Grandmaster Yan and the others were filled with all sorts of emotions.</p><br/><p>As a grandmaster, he had to depend on his disciple’s sacrifice. This…everything felt really terrible…</p><br/><p>He was still too weak after all…</p><br/><p>\"Junior Master…!\" Looking at the scene before him, Zong Hentian began to weep. Mie Qiongqi gripped his fists tightly, filled with indignation towards all this.</p><br/><p>\"Grandmaster, I have a wish. I hope for Dongling Continent to be peaceful. For this, I would willingly sacrifice my life without hesitation. But what a pity that I would no longer be able to accompany you guys in the sect. I can no longer see the smiles of our disciples in the sect any longer…hais…\"</p><br/><p>Lin Fan let out a long sigh and lamented. It caused everyone to be filled with heartache and grief. Listening to these words, Grandmaster Yan felt like something was choking his throat right now, as he found it difficult to breathe amidst his sniffs.</p><br/><p>Senior Elder Wuya held his old, wrinkled hands tightly together. But he knew it was all too late to be stopped.</p><br/><p>The big ancient demon must be destroyed.</p><br/><p>And perhaps, Lin Fan would truly die right here.</p><br/><p>\"No. Glory Sect will always remember you for life. Grandmaster, Wuya here sincerely implores you. Once all of this is over, please craft the second tribute sculpture in our sect to be used for prayers. He shall stand right outside our sect’s Main Halls for our disciples to pay respect to for generations to come…\" Wuya pleaded.</p><br/><p>Grandmaster Yan nodded his head.</p><br/><p>There was only a single tribute sculpture in the entire Glory Sect, and that belonged to the Founder Ancestor. This was a decision never made before to have Lin Fan’s figure sculpted into a statue before the Main Hall of the sect.</p><br/><p>Continuing to spit out fresh blood, Lin Fan’s joy leaped with joy momentously when he heard these words.</p><br/><p>Tribute sculpture! That was the utmost honor of the sect! In fact, it was something that could have never been possible!</p><br/><p>In every sect, there would only be a single tribute sculpture.</p><br/><p>\"Grandmaster, I-I…!\" Of course, one must pull off the act to its climax. Lin Fan was so touched that he didn’t know what to say anymore. Turning his head around, a stuttered voice came, \"G-grandmaster! It’s not worth it! T-that’s too costly for the sect’s core…!\"</p><br/><p>\"I, Duan Wuyi, have never submitted to anyone in my entire life! You are the messiah of Dongling Continent. My Taiwu Sect is willing to take out one-third of our entire treasure vault to contribute!\"</p><br/><p>\"Even though Fengtian Sect has its differences with Glory Sect, Fengtian Sect shall contribute one-third of our treasure vault to it as well once all of these is over!\"</p><br/><p>\"Xuanyang Sect too!\"</p><br/><p>\"Count us Taiyi Sect in!\"</p><br/><p>\"Rapid Lightning Sect is willing as well!\"</p><br/><p>...</p><br/><p>30 top sects…One-third of all of their treasure vaults.</p><br/><p>Lin Fan spewed out more blood again. But this time around, it was not to heighten the mood of the show. He was truly stunned.</p><br/><p>The ingredients required for a tribute sculpture are extremely stringent where only the most precious treasures and valuables are used. With so many sects contributing towards it, how bloody cool would his tribute sculpture be?!</p><br/><p>N-no! Lin Fan could not even begin to imagine it anymore.</p><br/><p>But no matter what, there was one thing he had to clarify.</p><br/><p>\"I thank everyone present right now. But, Grandmaster, could you please craft my tribute sculpture within ten days and place my body on top of it? That way, I would feel like I’m still living within our sect.\" Lin Fan looked at Grandmaster Yan with wide eyes.</p><br/><p>\"Yes…\" With a sorrowful look, Grandmaster Yan nodded his head.</p><br/><p>After receiving his reply, Lin Fan tossed back his head.</p><br/><p>Holy sh*t! He’s really done it this time around! He’s truly made it big!</p><br/><p>\"Big ancient demon! Yours Truly will f*ck you up…!\"</p><br/><p>‘URGHURGHURGHURGH…!’</p><br/><p>Lin Fan puked out another huge amount of blood.</p><br/><p>This was the blood of excitement…</p><br/><p>...</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>HAHAHAHAHAHHA. IS HE GOING TO PULL SOME REVIVAL STUNT. HONESTLY OUR BOY IS SO SHAMELESS BUT I JUST CANT STOP LAUGHING SO BADLY HAHAHAH!</p><br/>\n</div>"}