{"title": "Chapter 389: Old Black Dog Finds His Fated Person", "id": 389, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-389-old-black-dog-finds-his-fated-person", "volume_title": "Volume 4", "body": "<h1>Chapter 389: Old Black Dog Finds His Fated Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 389: Old Black Dog Finds His Fated Person</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>In a blood coloured world, the entire place was dark red. There was a river that was wide and boundless like an ocean. At the far ends, a figure was seated cross-legged, surrounded by a blood bubble.</p><br/><p>As though it had a life of its own, the boundless Blood Sea gushed into the body of that figure rapidly.</p><br/><p>BOOM!</p><br/><p>In that instant, the Blood Sea was split into two. The figure opened its eyes suddenly, as a blood colored flash of light shot out, piercing through the entire Blood Sea to the Heavens and Earth.</p><br/><p>\"Finally, I can communicate through the source of the Blood World.\"</p><br/><p>\"I’ve already fulfilled your wish. It’s time for you to hold up your end of the bargain.\" At that moment, a voice boomed out from the void across the entire Blood World.</p><br/><p>This black robed person was the 12th Level Master of Blood Kill Sect. He or she had made a trade with this mysterious person a year ago. Now that this mysterious person had helped him/her to communicate with the Blood World and understand its source, that could be considered a fulfilled trade.</p><br/><p>\"Acting mysterious and the likes... If there’s anything you want, come out here and tell me yourself.\" The voice of the Blood Kill Sect Grandmaster was neutral, and one would be unable to discern the person’s gender from it at all.</p><br/><p>\"Are you trying to renege on your end of the bargain?\" The voice boomed out once more.</p><br/><p>\"So what if I am? What can you do about that? You’re far too naïve.\" The Grandmaster laughed coldly. Turning into a streak of light, he/she broke through the barrier of the Blood World and exited the place.</p><br/><p>The void was silent. The mysterious person was not angry because of this at all, as though this was all within his/her calculations.</p><br/><p>\"Hmph…\" A cold snort permeated the Blood World before dissipating slowly into nothingness.</p><br/><p>...</p><br/><p>Dongling Continent, Blood Kill Sect Level 12.</p><br/><p>The Blood Kill Sect Grandmaster grasped his/her hands tightly together, feeling the massive amount of energy that was surging through his/her body. At the same time, it was a grand thing for him/her to be able to communicate through to the Blood World’s source. Every single past generation of Grandmasters had tried to communicate to the Blood World, but no one succeeded.</p><br/><p>The only puzzling thing right now was this: Who is that mysterious person?</p><br/><p>Even though the mysterious person’s powers were extremely powerful, he/she was unable to present his/her physical body.</p><br/><p>This was the conclusion of the Grandmaster after countless experimentations. Hence, the Grandmaster decided to make use of such a circumstance to take advantage of it first. As for the mysterious person’s request, naturally, the Grandmaster would delightfully ignore it.</p><br/><p>...</p><br/><p>After a few days of Xuanjian Sect’s hospitality, Lin Fan left the place. As for Xuan Yunxian, he had already come to terms with it. At times, he even felt that the feeling was pretty nice. Well, he would get used to it sooner or later.</p><br/><p>There were still a few places left on the Seven Saint Treasure Map that Lin Fan wanted to search at. Given his current cultivation state, his speed at traversing through the void was extremely fast. Hence, he did not have to waste much time.</p><br/><p>‘Destroyed Grounds.’</p><br/><p>This was one of the remaining places of the Seven Saint Treasure Maps.</p><br/><p>The Destroyed Grounds was one of the most dangerous places in the entire Dongling Continent. There was not a single bit of lifeforce to be found in this place, which remained desolated without boundaries. Even the sky itself was gray and dark there, filling one with a repressed feeling.</p><br/><p>Sects would not even bring their disciples over here to train up. After all, this was a desolated piece of land without a single treasure. Other than the few ferocious beasts that were present, there was nothing else to be gained from a place like this.</p><br/><p>Looking at the desolated place before him, Lin Fan was feeling helpless as well.</p><br/><p>This bloody old dog Seven Saint, he was really good at hiding things, wasn’t he? Every single place he hid things at was funny and weird. Lin Fan wondered where the next secret chamber would be built at in this place.</p><br/><p>But based on that pissy character of the Seven Saint old dog, the treasure must naturally be hidden in the most dangerous place.</p><br/><p>\"Chicky, take a good sniff and find where the secret chamber of that dog lies!\" Lin Fan released Chicky from his storage.</p><br/><p>Landing on the ground, Chicky sniffed left and right. He then leaped off wildly into the distance.</p><br/><p>\"Even though Chicky doesn’t look like it, he IS pretty useful.\" Looking at the fleeing figure, Lin Fan could not help but comment in acknowledgment. Then, he followed after Chicky without thinking too much, with his thousand feet a step speed.</p><br/><p>\"How did this Destroyed Grounds form?\" This was the serious question that Lin Fan was thinking about along the way. But, as he cast his gaze into the distance, he was stunned.</p><br/><p>There was a group of mountains about a million feet tall that had been leveled by some unknown force.</p><br/><p>‘GRAWHHHHHHHHHHHH…!’</p><br/><p>Suddenly, a beast burst out of the ground and lunged at Lin Fan with its mouth wide open.</p><br/><p>Lin Fan did not mind this too much. With his current physical body state, all he had to do was to continue forth and let the beast collide with him for the beast to be destroyed entirely.</p><br/><p>Not too long later, Chicky came to a stop at a deep location.</p><br/><p>Along the way, Lin Fan had encountered multiple beasts. To any normal people, these beasts would be strong enough to suppress them completely. But to Lin Fan, these were like ants.</p><br/><p>\"What the hell is up with this magnificent looking place?\"</p><br/><p>He was stumped by the sight before him.</p><br/><p>The void was pitch black, with lightning crackling across it. A thunderbolt streaked through the Heavens and Earth, as though it was like a deep crevice of Hell, sending chills down one’s spine.</p><br/><p>This was a natural occurrence formed by the Destroyed Grounds, and it had existed for a long time without disappearing.</p><br/><p>‘Cuckoo…!’ Chicky looked at Lin Fan while pawing below, as though telling him that the secret chamber was right below.</p><br/><p>Seeing this, Lin Fan could not help but feel exasperated. Seemed like this old dog Seven Saint was using the same trick over and over again. He loved to have the secret chambers hidden underground.</p><br/><p>Lin Fan placed his palm on the ground, and True Energy poured out of it. With a gentle press, the entire place rumbled violently as the ground caved in. Instantly, the figure of Chicky and Lin Fan were lost within it, swallowed down.</p><br/><p>...</p><br/><p>Lin Fan checked out his surroundings. Indeed, it was as Chicky said, the secret chamber was definitely here. There was a stone gate that was sealed shut. The secret chamber must definitely lie within.</p><br/><p>Beside the stone gates, bones laid scattered everywhere. Evidently, there must have been people who had visited this place in the past. However, for some unknown reason, they had passed away here. However, looking at the state of the white bones, they seemed to have been chewed on. It was as though these guys were murdered by some weird, mysterious beast.</p><br/><p>BAM!</p><br/><p>This stone door was like air to Lin Fan as he sent it flying with a single kick.</p><br/><p>But the moment he entered the secret chamber, he frowned.</p><br/><p>While the layout was exactly the same as before, there was nothing hidden in this place. Not only were the jade white bones gone, so was the box that was supposed to be laid on the stone table.</p><br/><p>At this moment, Lin Fan took out the Seven Saint black dog from his storage.</p><br/><p>\"Seems like you’re in luck. The ‘fated’ person you’ve been waiting for should have been here already.\" Lin Fan chuckled to the black dog.</p><br/><p>The black dog shrugged its head. Those eyes were no longer filled with malice. In fact, they seemed to be recalling something.</p><br/><p>‘Eh…?’ Suddenly, Lin Fan felt it.</p><br/><p>From the unknown, a mysterious force was connected to the black dog.</p><br/><p>\"You deserve death.\"</p><br/><p>HOLY SH*T! The black dog started talking!</p><br/><p>\"Holy f*ck! He turned into a spirit…!\" Lin Fan was startled, evidently not ready for this.</p><br/><p>Listening to these words of the black dog, Chicky cried out loudly and sent a claw flying towards the black dog.</p><br/><p>The domineering look of Chicky was akin to telling the black dog that he should mind his tone.</p><br/><p>The black dog’s body slammed into the walls. Then, it stood up, and the ferocity in its eyes returned once more, \"Pitiful fella. Now that the doomsday of Dongling Continent is approaching, you won’t be able to act that way for much longer.\"</p><br/><p>\"Old dog, even though I don’t understand what you’re saying fully, by the sounds of it, you seem to be living quite a good life now eh? Even though I don’t know who that ‘fated’ person is, how about you bring him over to meet me?\" Lin Fan chuckled once more.</p><br/><p>\"You won’t have the chance to meet him. After all, you’re not too far from death. These two strains of consciousness that you have obtained from me? You can have them. As for the other secret chambers, you don’t have to go anymore. After all, I’ve already retrieved every single last one of them in the past year you were gone. My might is not something you can imagine…HAHAHA!\"</p><br/><p>Instantly, after the black dog finished its words, its body began to expand rapidly.</p><br/><p>\"Hoho. Self-destruction of the consciousness? Boring.\" Drawing a circle in the void, Lin Fan tossed the black dog into those endless void.</p><br/><p>It exploded soon after. But by then, it was none of Lin Fan’s business.</p><br/><p>...</p><br/><p>\"No matter what, this Seven Saint old dog is an Ancient Being. But what’s up with all this Ancient stuff? Xuanhuang World did not have an Ancient period at all in its entire existence. Evidently, none of these belong to this world.\" Lin Fan was silent for a moment. This was the point he could not get at all. Recalling everything that had happened so far, he thought up of a single possibility.</p><br/><p>The cultivation states being restricted.</p><br/><p>Everyone from Dongling Continent being unable to breakthrough to a higher state.</p><br/><p>The barrier between Heaven and Earth.</p><br/><p>This barrier should be the final reason for all of this.</p><br/><p>\"Bloody hell. F*ck all this thinking. We’ll go one step at a time.\" The moment he thought of all this complicated stuff, his head hurt. It was better to live life without much worries and troubles.</p><br/><p>Translator's Thoughts</p><br/><p>Lam Lam</p><br/><p>Wow, this is really cool though. Seems like the consciousness of the Seven Saint were all disconnected at the start. But this guy seems to spell trouble right now. Okay cool, think we’re gonna get into serious arcs real soon right now haha! Cheers!</p><br/>\n</div>"}