{"title": "Chapter 393: Suppress", "id": 393, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-393-suppress", "volume_title": "Volume 4", "body": "<h1>Chapter 393: Suppress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 393: Suppress</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Within the void, the sky rumbled furiously. Those all-encompassing and authoritative eyes looked down on the masses in disdain. It was especially fearsome to look into those rainbow colored pupils, which were filled with visions of death, new life, destruction, creation et cetera.</p><br/><p>The Manhuang Tribesmen prostrated themselves on the ground, quivering in immense fear. This was akin to doomsday in their hearts. They didn't even have the will to resist this immense aura.</p><br/><p>Huang Linger's face was extremely pale right now. Against this absolute aura, every single hope she had for the future had been extinguished entirely.</p><br/><p>\"Dumb human, you shall pay the price for your actions.\" The Heaven's voice boomed out across the entire sky. A tremendous force pummelled down, as though it was bent on crushing down on the masses.</p><br/><p>\"Your mum is dumb. YOU are the dumb one. You couldn't even protect the person who you had so-called acknowledged as blessed by the Heavens, and you dare to be so brazen in front of Yours Truly?\" Stepping forth, Lin Fan's aura was tremendous as it erupted outwards, blocking out the power of the Heaven's Will.</p><br/><p>Seemed like this person who was referring to himself as Heaven's Will was about to strike for real now. If that massive aura landed on these Manhuang Tribesmen, they would be crushed into dust for sure.</p><br/><p>\"If Yours Truly says that he's going to shoot down your eyes, he's going to shoot down your eyes! Today, it's time for you to understand that there's a risk in running out wild in the pugilistic world!\" Lin Fan hollered in disdain.</p><br/><p>'Bloody hell! This guy thinks that he can trample on the masses just by producing a pair of huge eyes? What a dream!'</p><br/><p>\"Human, perish!\" Suddenly, a massive rainbow-colored laser beam shot out from the Heaven's Eyes. It seemed to be carrying with it a power that could annihilate the entire place.</p><br/><p>\"Hmph, perish your head! It's time for you to know how powerful Yours Truly truly is!\" Lin Fan lashed back in anger as his aura rose rapidly as well.</p><br/><p>\"Come on out, energy grid line chains!\"</p><br/><p>Instantly, 450 energy grid line chains erupted outwards. All of them were like agile electric snakes, coiling with one another before fusing.</p><br/><p>\"Hmm…\" An astonished sound came out of the voids, as though the eyes were halted in their tracks by this sight. Perhaps, it was trying to comprehend how a mere human could gather this many energy grid line chains.</p><br/><p>\"Hmph! The show's just starting!\" Looking at those eyes in the skies, Lin Fan laughed coldly. Turning his palms, the energy grid line chains turned into an energy grid line bow, emitting a wild burst of energy.</p><br/><p>\"Today, Yours Truly shall see what it looks like for an eye to be shot into explosion!\" Feeling the surge of energy from the bow, Lin Fan was overwhelmed with joy. To think that it would be this formidable!</p><br/><p>With 450 different elements fusing into a single body, this amount of power was definitely enough to take down the ancients!</p><br/><p>Looking at Lin Fan, Huang Linger was filled with shock. The amount of energy that was coming out from his was surging into her body like tidal waves.</p><br/><p>To think that this person who she had last seen just a year ago was now this fearsome! In fact, he could even hold his ground against the Heaven's Will!</p><br/><p>This was something that Huang Linger could have never imagined.</p><br/><p>Looking at the energy that the Heaven's Eye was accumulating and gathering, Lin Fan slapped his storage. With that, the Eternal Donger appeared in the skies.</p><br/><p>\"Heaven's Eye! Today, Yours Truly will let you experience what it feels like to be shot at! This should be an utmost honor to you!\" Looking at the Heaven's Eyes, Lin Fan's gaze was filled with contempt.</p><br/><p>The invincible Biggras floated and danced around the Eternal Donger, before exploding into a mist.</p><br/><p>With the previous few experiments, it was as though the Eternal Donger was addicted to the Biggra as well. With a big sniff, it sucked in all the mist around it.</p><br/><p>True Origins Crushing Kick!</p><br/><p>With all the procedures taking place one by one, the power that was emanating from the Eternal Donger was stronger than ever.</p><br/><p>Using the Eternal Donger as an arrow, Lin Fan stepped forth and straightened his back. He took aim and drew his bow.</p><br/><p>\"With great precision, Yours Truly shall shoot through your pupils!\" With his forefinger, he stretched the bow to its maximum while fixating his gaze on the Heaven's Eyes. A massive amount of energy erupted out from Lin Fan.</p><br/><p>A bright glow appeared around the bow, as energy flowed and gathered towards it repeatedly.</p><br/><p>\"Foolish human! How dare you take a fight against the Heavens? This is intolerable in the world!\" The voice boomed out from the sky once more. By now, the energy that had been accumulating in the Heaven's Eye had reached its maximum.</p><br/><p>BOOM!</p><br/><p>A formidable force, seemingly encompassing everything, burst out towards Lin Fan.</p><br/><p>\"Hmph, insolent!\" Without a single bit of fear towards the incoming projectile, Lin Fan let go of the bow. With that, the arrow erupted outwards, forming a streak of white light through the skies.</p><br/><p>The light pierced through everything in the world. As though it was unable to withstand this massive surge of energy, the void began to tear along the way.</p><br/><p>The 450 energy grid line chains followed behind the arrow immediately. Coiling together, they turned into another boost of energy and attached themselves onto the Eternal Donger.</p><br/><p>BOOOOOOOOOOOOOOOOOOOM!</p><br/><p>With the collision of these 2 massive forces, an enormous shockwave rippled through the entire Manhuang Area.</p><br/><p>\"How could this be?!\" A voice of shock rang through from the voids. To think that a mere human would have enough power to resist him!</p><br/><p>\"Hmph, nothing is impossible. How dare you try to act tough in front of Yours Truly with just a pair of eyes\" You're way too naïve!\" Lin Fan roared. Wielding the Eternal Axe in his arms, he leaped off the ground towards the other pupil.</p><br/><p>BAM!</p><br/><p>With that, the next scenes were just shocking for anyone in this world to behold.</p><br/><p>The Eternal Donger had pierced through the left pupil wildly. The rainbow colored light scattered rapidly in all directions, as though the Heaven's aura was dispersing up.</p><br/><p>'Firmament…!'</p><br/><p>Lin Fan's body was now stronger than ever. Coupled with 450 energy grid line chains, he could crush anything with ease.</p><br/><p>The power of the Eternal Arm was also infused within this attack.</p><br/><p>'Firmament' was the strongest attack skill that Lin Fan possessed. Now that his strength had turned so sick, the amount of power he could produce was definitely just enough to devastate the world.</p><br/><p>BOOOOOOOOOOOM!</p><br/><p>The axe brought with it a beam of light, distorting and warping spacetime, splitting the right pupil into two entirely.</p><br/><p>Countless rainbow colored lights dissipated in all directions.</p><br/><p>\"Impossible…! How could a mere human being be this strong? Don't tell me that you've managed to break through the barrier in this world?!\" The voice in the void was evidently startled, finding it hard to accept everything that had just happened.</p><br/><p>\"Barrier in this world? Are you bloody kidding me? You expect a small barrier like that to stand in Yours Truly's path to greatness? What a dream! Yours Truly is an existence that takes down any and everything in my path!\" Lin Fan hollered. Looking at the mighty Heaven's Eyes which were now tattered and broken, he couldn't help but laugh out.</p><br/><p>It was simply too awesome! The feeling of such strength!</p><br/><p>\"Oh, you want to run? Carry on dreaming!\" Looking at those Heaven's Eyes trying to make an escape, Lin Fan would definitely not let that happen.</p><br/><p>'Heaven and Earth Smelt.'</p><br/><p>\"What's that?!\" The voice exclaimed out in shock, as though it was startled by the Heaven and Earth Smelt.</p><br/><p>In that instance, the Heaven and Earth Smelt took the Heaven's Eyes in. Within the smelt, the Heaven's Eyes tried to make an escape, but it was suppressed by Lin Fan as it dropped back within.</p><br/><p>'Smelt.'</p><br/><p>'Ding…congratulations on obtaining a strain of Heaven's Consciousness.'</p><br/><p>\"HAHAH! What other f*cked up capabilities do you have? Take them all out! Yours Truly fears nothing!\" Lin Fan pointed his middle finger up into the sky.</p><br/><p>\"B*STARD…!\" An angry roar boomed out from the void, evidently incensed by Lin Fan's actions.</p><br/>\n</div>"}