{"title": "Chapter 395: Walking Gold Mine", "id": 395, "volume": 4, "url": "http://boxnovel.org/the-strongest-system-chapter-395-walking-gold-mine", "volume_title": "Volume 4", "body": "<h1>Chapter 395: Walking Gold Mine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 395: Walking Gold Mine</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Oi, what happened to you? Why are you silent now?\" Lin Fan came in front of Huang Linger. Looking at her standing blankly where she was, he waved his hands in front of her face.</p><br/><p>Just by arriving here, the entire place was already shaken as such. If the pseudo-Heaven's Will had truly struck down, how scary would that have been?</p><br/><p>An existence which could devour even the Heaven's Will itself… How weak could that possibly get? Lin Fan wondered if he could even withstand it himself.</p><br/><p>Sobering from her daze, Huang Linger took a look at Lin Fan and felt her heart skip a beat once more.</p><br/><p>That thing from before was definitely the Heaven's Will. However, that wasn't the true Heaven's Will. She did not know what had happened to the Heaven's Will. But for this man before her to have the power to resist THAT, she was still unable to come to terms with the facts fully.</p><br/><p>\"Nothing much.\" She shook her head. Suddenly, she was startled, \"You've caused the Life Seed to sprout?\"</p><br/><p>She could feel an intense amount of lifeforce that was emanating from Lin Fan. However, she could also tell that the lifeforce was being shaved off continuously.</p><br/><p>\"Yes, it's sprouted. However, it's still a seedling for now. And there's some problem with it as well.\" Lin Fan continued.</p><br/><p>\"Could I take a look at it?\" Huang Linger asked.</p><br/><p>Without hesitation, Lin Fan flipped open his palms. With that, a shriveled up Mythical Parasol Tree floated in his palms. The roots of the Mythical Parasol Tree were translucent and clear. They were attached to Lin Fan's palms at the moment.</p><br/><p>Looking at the Mythical Parasol Tree in Lin Fan's palms, Huang Linger frowned. After a while, she relaxed and continued, \"The Mythical Parasol Tree is the only mythical tree that exists in this world, and has been through countless of eras. Ever since it was destroyed, it turned into a seed and has never ever sprouted again. To think that you could allow it to sprout once more. That's a miracle indeed.\"</p><br/><p>After listening to Huang Linger, Lin Fan could not help but credit the sprouting of the Life Seed to Chicky. If not for Chicky, this Life Seed would have still remained as a seed in his storage.</p><br/><p>\"What's the background of this Mythical Parasol Tree?\" Lin Fan asked.</p><br/><p>\"I don't know exactly as well. However, according to my ancestors, the Mythical Parasol Tree is the source of life between Heaven and Earth.\" Huang Linger shook her head and explained.</p><br/><p>The knowledge she had was limited. Other than the fact that the Life Seed produced a tremendous amount of lifeforce, she didn't even know of any other effects it had.</p><br/><p>\"Now that it's starting to wither, is there any hope to salvage this?\" Lin Fan's purpose here this time round was to find a way to revive the abilities of the Mythical Parasol Tree.</p><br/><p>\"Probably. However, I don't dare to guarantee success. After all, this is the first time I've encountered something like this.\" Huang Linger replied.</p><br/><p>Lin Fan nodded. Even though the Mythical Parasol Tree was still a seedling, it had already provided him with immense benefits. If it were to die just like that, then that would be a terrible pity.</p><br/><p>But even till now, a single fact puzzled Lin Fan. If this Life Seed was so precious, why had she agreed to hand it over to him a year ago? If he didn't clarify this fact, he wouldn't be able to get rid of the uneasiness in his heart.</p><br/><p>\"That's right, since it's so precious. Why did you choose to hand it over to me back then?\"</p><br/><p>Looking at Lin Fan, Huang Linger chuckled, \"You were committing a robbery. We were so weak then. Was there any way we could refuse you?\"</p><br/><p>Stunned for a moment, Lin Fan grinned. That was an interesting excuse there.</p><br/><p>Huang Linger stepped down from the tribute altar. She turned back and looked at Lin Fan, \"I handed it over to you back then because I could see the future. Tomorrow, I'll take you to a place. Whether or not it succeeds, that all depends on you. For now, I'll arrange for the tribesmen to take you for a good rest. I'll look for you tomorrow.\"</p><br/><p>\"Okay.\" Lin Fan nodded his head. Tomorrow then. He still had got stuff within his storage that he needed to sort out properly. These were all the goodies he had obtained after multiple battles so far.</p><br/><p>After Huang Linger left, a brutish looking tribesman made his way over to Lin Fan. He was cowering slightly with a look of respect.</p><br/><p>\"Please follow me.\"</p><br/><p>The Manhuang Tribesmen feared the Heavens. However, now that this man could take down even the Heavens, naturally, he was even scarier to them.</p><br/><p>Looking at how afraid these tribesmen were of himself, Lin Fan could not help but chuckle exasperatedly. With that, he followed that man and left the area.</p><br/><p>Before leaving, he threw a final glance at the statue on the tribute altar and frowned.</p><br/><p>Even though the aura of this statue was different from that of the Founder Ancestor back in Glory Sect, the remnant aura was somewhat similar…</p><br/><p>...</p><br/><p>Night…</p><br/><p>Lin Fan looked at his belongings within his storage.</p><br/><p>The body of the big ancient demon, two strains of Heaven's Consciousness, and a storage ring.</p><br/><p>Lin Fan had plans to smelt the body of the big ancient demon initially. However, on second thoughts, this guy did not have any energy grid line chains at all. If he were to end up gaining nothing from the smelt, wouldn't that be a big waste?</p><br/><p>Even though this big ancient demon had fallen for 10,000+ years and his cultivation base had dropped tremendously, just the sturdiness of his physical body state was definitely more than enough to take down most things. If not for the fact that he had 'Seven Realms', they might have truly died there and then.</p><br/><p>Even with 450 energy grid line chains right now, Lin Fan did not dare to claim that this was definitely enough to take down the big ancient demon.</p><br/><p>Ancient overlord who had conquered over the ancient times… That was definitely no joke.</p><br/><p>Falling deep into his thoughts, Lin Fan could not help but recall back to the plotlines of the all the novels he had read in the past.</p><br/><p>Well, he was pretty satisfied with the pill cultivation process of the Xuanhuang World. But, he wasn't so pleased with the weapons crafting portion.</p><br/><p>Four grades: Heaven, Earth, Dark, Light; three tiers: Upper, Middle, Lower... Seven in total.</p><br/><p>Even at a Heaven grade state, the power that one possessed was extremely limited.</p><br/><p>For example, the Heaven graded upper armor he had produced back then, that was practically the highest graded equipment that he could produce in Xuanhuang World. But even then, only its defensive capabilities were brilliant.</p><br/><p>Now that Lin Fan's weapon crafting skills were the strongest in this side of the world, it was time for him to come up with a new breakthrough for this world.</p><br/><p>And of course, this big ancient demon's body would make for the most precious material he could ever hope to obtain.</p><br/><p>Lin Fan also obtained a lot of inspiration from Demon City in a Palm. Perhaps, he should give it a shot.</p><br/><p>Materials... He needed tons of materials!</p><br/><p>If he could craft out yet another legendary weapon like the Nine Five Legendary Brick or Seven Realms, he would be elated beyond words.</p><br/><p>But right now, the materials for those weren't enough. Time to set the big ancient demon's body aside then.</p><br/><p>Looking at the two strains of Heaven's Consciousness, his lips curled into a grin.</p><br/><p>'Ding…discovered Heaven's Consciousness. Absorb?'</p><br/><p>'Absorb.'</p><br/><p>Lin Fan did not hesitate in the slightest bit. These were good stuff, man!</p><br/><p>As the two strains of consciousness entered his body, Lin Fan frowned momentarily and closed his eyes. Gradually, new scenes began to appear in his head.</p><br/><p>After some time, he opened his eyes with a look of enlightenment.</p><br/><p>'So that's the reason why. Seems like I've been pretty close with my guesses. The voice asking for help was indeed the true Heaven's Will.'</p><br/><p>The images that Lin Fan witnessed after consuming those two strains of Heaven's Consciousness showed him the Heaven's Will of Dongling Continent being devoured by an invader.</p><br/><p>The reason why the pseudo-Heaven's Will he had been fighting could not use up its fullest powers was due to its locked struggle with the true Heaven's Will. If he had used up any more power, he would face retaliation from the true Heaven's Will.</p><br/><p>'Seems like Yours Truly's act of defiance was indirectly beneficial to the situation. However, I wonder how long the Heaven's Will can continue to last.' Lin Fan sighed helplessly as he shook his head.</p><br/><p>'Hais, even though Yours Truly wishes to save you, there's really nothing much I can do. How should I even begin to do that at all?'</p><br/><p>...</p><br/><p>When he caught sight of Chen Xuan's storage ring, he grinned once more.</p><br/><p>\"Twice... What a pitiful fate that fella has. He's just a walking piece of gold mine! To think that he would return to be robbed by Yours Truly once more after the previous round of robbing! What a tragedy! Well, let's see what sort of items he has obtained in the past year then.\" Lin Fan chuckled.</p><br/><p>And of course, Chen Xuan was a pitiable man. To think that he considered himself blessed by the Heaven's because he was supported by the pseudo-Heaven's Will.</p><br/><p>But just as Lin Fan looked into the storage ring, his body froze up in excitement…</p><br/><p>...</p><br/>\n</div>"}