{"title": "Chapter 402: Start Shivering", "id": 402, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-402-start-shivering", "volume_title": "Volume 5", "body": "<h1>Chapter 402: Start Shivering</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 402: Start Shivering</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Hmph, since you want to die. Your father shall grant you your wish.\" Looking at Wang Xiaoliu, who was dashing towards him, the Qiankun Sect disciple gripped his fists with his blood pumping.</p><br/><p>Wang Xiaoliu's face was resolute as he gritted his teeth. Even though his Titanium Grade Demon Body was already at its peak state, he knew that he was no match for this disciple before him.</p><br/><p>But, so what? No matter what, he would pit his life against this person.</p><br/><p>BAM!</p><br/><p>As the punch landed on Wang Xiaoliu's chest, the energy spread out violently.</p><br/><p>The Qiankun Sect disciple smirked. This punch would definitely take his life.</p><br/><p>But at this moment, he was shocked to find out that even though Wang Xiaoliu has taken his punch, he was still gripping on tightly to the Qiankun Sect disciple's wrist like a fly that didn't know its place.</p><br/><p>\"Hmph, know your place!\" The Qiankun Sect disciple hollered out. To think that this punching bag was thinking of retaliating! How brazen!</p><br/><p>\"Hehe…!\" Wang Xiaoliu glared at this man fixedly, spurting a mouthful of fresh blood. He then laughed out sinisterly, \"How dare you laugh at my family technique. I'll show you!\"</p><br/><p>Suddenly, Wang Xiaoliu's hand reached out.</p><br/><p>'Monkey steals peaches!'</p><br/><p>Even though it was a simple move, this was Wang Xiaoliu's family's special technique. Once upon a time, Wang Xiaoliu's family was a distinguished one who specialized in Monkey Steals Peaches. In the end, they fell from grace. The reason behind the fall should be due to the fact that there were no descendants who could properly grasp the essence of Monkey Steals Peaches.</p><br/><p>Looking at the situation, the Qiankun Sect disciple was startled momentarily before shouting out angrily, \"How dare you employ such despicable moves!\"</p><br/><p>Wang Xiaoliu's face changed. He had not expected the other party to react to this!</p><br/><p>BAM!</p><br/><p>The Qiankun Sect disciple sent a kick flying towards Wang Xiaoliu's chest. In that instant, Wang Xiaoliu was sent flying with blood spraying out of his mouth.</p><br/><p>'URGH…!'</p><br/><p>Wang Xiaoliu laid on the ground. His face was dazed with a look of disbelief, 'How could he see through it…? I thought I've clearly mastered the essence of my family technique…!'</p><br/><p>Looking at the pitiful state of Wang Xiaoliu, all the surrounding punching bags shuddered in fear. This was no good. There was definitely going to be a tragedy.</p><br/><p>\"Hmph, trash! You dare to claim that such a despicable move is your family's secret technique? What a bloody big joke!\" The Qiankun Sect disciple laughed wildly.</p><br/><p>Lying on the ground, Wang Xiaoliu gripped his fists tightly. How could his family technique be trash? His family had grown to power in the past just because of that!</p><br/><p>\"Hmph, looking at a useless punching bag like that makes me angry. Whack him! If he dies, throw him out to feed the dogs!\"</p><br/><p>\"Yes…!\"</p><br/><p>Instantly, a bunch of Qiankun Sect disciples surrounded Wang Xiaoliu and rained punches and kicks on him.</p><br/><p>Wang Xiaoliu curled up into a ball, enduring the beating silently.</p><br/><p>He wanted to retaliate. But his hands were still quivering.</p><br/><p>At this moment, he finally felt the fear of death.</p><br/><p>Just as they were whacking him, a torn and tattered blue book fell out from Wang Xiaoliu's chest.</p><br/><p>A sharp-eyed Qiankun Sect disciple picked it up before he burst out laughing.</p><br/><p>\"HAHA! Hey guys, take a look! This is his so-called family technique Monkey Steals Peaches…!\"</p><br/><p>Looking at the time-worn and tattered cover, everyone burst out laughing frantically.</p><br/><p>\"RETURN IT TO ME!\" Wang Xiaoliu howled out in anger.</p><br/><p>Rip.</p><br/><p>That disciple took the book in front of Wang Xiaoliu and shred it into pieces right in his face.</p><br/><p>\"What a joke! Family technique? A deplorable move as such would only be considered as a treasure by trash like you!\"</p><br/><p>Wang Xiaoliu gripped his fists, \"IT'S NOT TRASH…!\"</p><br/><p>\"It's trash.\" All the Qiankun Sect disciples jeered.</p><br/><p>\"It's not…!\" Wang Xiaoliu stood up and looked at everyone with reddened eyes.</p><br/><p>Looking at his eyes, the masses were startled for a moment. Recovering from the astonishment, that embarrassment turned into rage.</p><br/><p>\"A trash is a trash! Bloody punching bag! Speak anymore and I shall rip out your tongue!\"</p><br/><p>Wang Xiaoliu looked at these Qiankun Sect disciples and his heart shuddered. Looking at the shredded pieces on the floor, his heart was equally shredded.</p><br/><p>He truly wanted to reply that it was not trash. However, he was filled with fear right now.</p><br/><p>\"If you don't want to die, you better repeat after me: 'My family technique is trash'.\" The fierce-looking Qiankun Sect disciple glared at Wang Xiaoliu, toying with him.</p><br/><p>Wang Xiaoliu was at a loss right now.</p><br/><p>SHING!</p><br/><p>A sharp blade appeared in the Qiankun Sect disciple's hand. It was as though the only outcome for Wang Xiaoliu if he did not repeat those words was death.</p><br/><p>\"Brother Xiaoliu, say it!\" The other punching bags urged him hurriedly.</p><br/><p>Listening to the voices of the masses, Wang Xiaoliu's heart was in a mess right now.</p><br/><p>\"Hurry up and say it! Otherwise, I'll slice off your head clean…!\" The Qiankun Sect disciple hollered viciously.</p><br/><p>Wang Xiaoliu gripped his fists tightly. This was the skill that was handed down by his ancestors. It represented the most glorious moments of his family's history!</p><br/><p>Wang Xiaoliu could not help but recall his father's final words before he died, \"Xiaoliu…Xiaoliu. Monkey Steals Peaches is the core of our family. You must do well to comprehend the essence of it so that you do not bring shame to its name!\"</p><br/><p>...</p><br/><p>Shing.</p><br/><p>Suddenly, the sharp blade had found its way to Wang Xiaoliu's neck. The razor-edged sword aura sliced at Xiaoliu's neck. If he did not say it, the next second, his head would roll on the ground.</p><br/><p>Xiaoliu was totally lost right now. His heart was in a state of despair. He closed his eyes gently. He had decided. Even if he were to die right now, he wouldn't say it.</p><br/><p>\"It's not trash…\"</p><br/><p>Suddenly, a loud voice permeated from the sky above.</p><br/><p>Everyone was stunned, wondering what happened.</p><br/><p>Wang Xiaoliu opened his eyes as well, searching for the source of the voice. When he looked up into the sky, he saw a figure floating there. However, the scorching sunlight was piercing his eyes, so he couldn't make out the figure floating there properly.</p><br/><p>\"Monkey Steals Peaches is an extremely powerful skill. If that skill is trash, then every other skill in this world is trash.\"</p><br/><p>Lin Fan floated in the air. Looking at the scene of the people bullied below, he couldn't help but recall back those memories of the past…</p><br/><p>...</p><br/><p>\"Big bro! This is my family technique! You're the genius amongst us, big bro! You must fight on for us!\" Taking Lin Fan as a hero, Wang Xiaoliu had handed over his family technique easily to Lin Fan.</p><br/><p>Back then, Lin Fan was filled with gratitude. He swore to himself, 'When I come to dominate the world one day, I will ensure your success.'</p><br/><p>That was the promise that Lin Fan had made to Wang Xiaoliu back then.</p><br/><p>Even though Wang Xiaoliu did not reply, Lin Fan could tell that the other party had not thought this far, nor he took his words entirely to heart.</p><br/><p>Now that he was the strongest in Xuanhuang World, someone who could suppress every single being, it was time for him to fulfill that promise.</p><br/><p>...</p><br/><p>Wang Xiaoliu looked up at the man in the sky. This was the first time he had heard anyone say that his family technique wasn't a piece of trash. As such, he was really emotional right now.</p><br/><p>Yet, he couldn't make out the features of the other party.</p><br/><p>Lin Fan gradually descended.</p><br/><p>As Wang Xiaoliu slowly made out the features of the other party, his face slowly turned into one of disbelief.</p><br/><p>He would never forget that face.</p><br/><p>This face. It reminded him of…of that man…!</p><br/><p>\"Xiaoliu, seems like we're truly fated, eh?\" Lin Fan's mouth curled into a smile.</p><br/><p>\"BIG BRO…!\" Wang Xiaoliu shuddered emotionally. He had not expected the other party to be his ex-punching bag comrade, Lin Fan!</p><br/><p>Back then, Lin Fan had the balls to fight against the disciples of the sect. With that, he earned everyone's respect. Wang Xiaoliu took out his family technique and handed it to him.</p><br/><p>And with that, he recognized this man as a big brother.</p><br/>\n</div>"}