{"title": "Chapter 403: How Could He Have Not Known Something So Simple?", "id": 403, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-403-how-could-he-have-not-known-something-so-simple", "volume_title": "Volume 5", "body": "<h1>Chapter 403: How Could He Have Not Known Something So Simple?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 403: How Could He Have Not Known Something So Simple?</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Fret not, little brother…\" Lin Fan smiled calmly, stretching out his hand and motioning for them to not feel worried.</p><br/><p>Regarding Monkey Steals Peaches, Lin Fan was filled with gratitude towards Wang Xiaoliu. After all, if Wang Xiaoliu had not given him the skill so selflessly, Lin Fan's path to greatness would not have been this smooth.</p><br/><p>This was a really sick skill. Even sick was an understatement for it. All these years, Lin Fan had managed to gain the upper hand in countless situations just because of it.</p><br/><p>As for why Wang Xiaoliu had yet to comprehend the essence of it, Lin Fan was puzzled as well.</p><br/><p>Perhaps, this skill was truly handcrafted for someone just like Lin Fan.</p><br/><p>Right now, the other punching bags from Saint Devil Sect looked at this man curiously. He looked pretty familiar, yet they could not really remember who he was.</p><br/><p>Even though Lin Fan was pretty famous in the punching bag gang back in Saint Devil Sect, not everyone knew about him.</p><br/><p>Furthermore, there were quite a number of punching bags who were killed mercilessly by these Qiankun Sect disciples in the past two years. With that, there was practically nothing left of the punching bag gang.</p><br/><p>...</p><br/><p>\"Who are you?\" The Qiankun Sect disciple glared at Lin Fan coldly.</p><br/><p>He had not expected this man to be an acquaintance of these punching bags. That was weird.</p><br/><p>\"Xiaoliu, did this sect take part in the annihilation of Saint Devil Sect back then?\" Ignoring that Qiankun Sect disciple, Lin Fan asked Xiaoliu directly.</p><br/><p>\"Yes, they are Qiankun Sect.\" Wang Xiaoliu replied hurriedly.</p><br/><p>The moment Xiaoliu finished his words, the Qiankun Sect disciple's face turned cold. With a loud holler, he darted forward, wanting to slice off Xiaoliu's head.</p><br/><p>\"Hmph.\" Looking at the brazen act of this disciple, Lin Fan snorted loudly. He disappeared from where he was and retrieved a specially crafted glove.</p><br/><p>'Monkey Steals Peaches.'</p><br/><p>Everything happened at lightning speed. No one ever saw what had happened. All they saw was the Qiankun Sect disciple lying on the ground, his hands covering his crotch while wailing.</p><br/><p>To this disciple, life was extremely bleak right now. The only thing he could feel was the swelling pain of his nuggets surging up his head.</p><br/><p>\"Xiaoliu. Back then, you handed me the ultimate move of Monkey Steals Peaches. Today, I shall demonstrate to you just how powerful your skill is.\" Lin Fan had wanted to slap the other party to death. But right now, he had a change of mind.</p><br/><p>He felt that he ought to give Wang Xiaoliu some hope.</p><br/><p>For the past few generations, no one in Wang Xiaoliu's family had comprehended the essence of Monkey Steals Peaches. As such, his family had fallen from their graceful position in society. If Lin Fan didn't glorify Monkey Steals Peaches once more, Wang Xiaoliu might truly lose all hope in this family technique of his.</p><br/><p>Now that Lin Fan had even evolved Monkey Steals Peaches to Twisting Heaven and Earth, the benefits were countless.</p><br/><p>But one must not forget the roots of Monkey Steals Peaches. Alright then, today, Lin Fan would use it and display the most potent side of Monkey Steals Peaches.</p><br/><p>Wang Xiaoliu looked at Lin Fan blankly. He had not expected big bro to actually deploy Monkey Steals Peaches against the enemy!</p><br/><p>By now, Wang Xiaoliu had an urge to cry out emotionally.</p><br/><p>He had always believed that his family technique was really strong. However, the fact that no one in his family had comprehended it for a few generations had caused the outside world to view this skill as nothing but deplorable. But through big bro, he could finally see hope.</p><br/><p>Looking at the Qiankun Sect disciple who was groveling on the ground, a weird sensation filled Wang Xiaoliu's heart.</p><br/><p>Was this the true power of Monkey Steals Peaches?</p><br/><p>\"Xiaoliu, Monkey Steals Peaches is a heaven-defying skill. With it, you can negate all defenses and cause the other party to feel an immense pain.\" Lin Fan explained coolly.</p><br/><p>Wang Xiaoliu looked at Lin Fan silently. He then looked at the Qiankun Sect disciple once more and got excited.</p><br/><p>So, this was indeed the power of his family technique, Monkey Steals Peaches! Incredible!</p><br/><p>Looking at the scene before them, all the other Qiankun Sect disciples retreated slightly in fear.</p><br/><p>The state of their senior brother sent a chill down their spines.</p><br/><p>What a vicious move…!</p><br/><p>\"ARGH…IT HURTS…!\" The disciple howled at the top of his lungs. His initially flushed red face was now pale as a sheet. In fact, even the thought of suicide crossed his mind right now.</p><br/><p>It was a feeling like he would die if he didn't continue to hold on to his crotch.</p><br/><p>Painful... Absolutely painful! This was a pain no one could endure at all!</p><br/><p>\"Just who is this little junior who has come to my Qiankun Sect to be so insolent?\" Just then, a few figures appeared on the training grounds.</p><br/><p>\"Grandmaster…!\"</p><br/><p>\"Elder…!\"</p><br/><p>Looking at these figures, Lin Fan curled into a cold smile. Especially that Grandmaster, that was a face that Lin Fan would never forget for the rest of his life.</p><br/><p>\"Who are you!\" Qian Kunzi looked at this young man. He then looked at his disciple who was quivering on the floor before frowning and hollering.</p><br/><p>Seeing Qian Kunzi's arrival, Wang Xiaoliu and the other punching bags could not help but shiver in fear. They were thoroughly afraid from the bottom of their hearts.</p><br/><p>This was an extremely scary man.</p><br/><p>At the same time, Wang Xiaoliu and the others could not help but worry.</p><br/><p>They knew that their big bro had gotten way stronger in these past two years. But even then, he might not be the match of Qian Kunzi just yet.</p><br/><p>\"Grandmaster, why are you wasting your breath on him! How dare this intruder step foot into Qiankun Sect? Let's just take him down!\" A slightly bald elder remarked.</p><br/><p>\"Ho? Since when was this Qiankun Sect's place? This is the Saint Devil Sect.\" Lin Fan glared at Qian Kunzi.</p><br/><p>A fiery flame was raging within Lin Fan's heart. However, he soothed it down.</p><br/><p>It would be a waste to let the other party die an easy death.</p><br/><p>He would take his time to torment this person. This person must know what it was like to experience it.</p><br/><p>The Lin's Style of Torment.</p><br/><p>The moment Lin Fan finished his words, the face of Qian Kunzi changed, \"Who exactly are you?\"</p><br/><p>Even though two whole years had passed, these people from Qiankun Sect still had an uneasy feeling. Looking carefully at Lin Fan, Qian Kunzi jolted for a second, as though he had recalled something.</p><br/><p>\"It's you, that b*stard dreg.\"</p><br/><p>\"B*stard dreg? That does make me feel embarrassed. But well, you're right. That's me alright.\" Lin Fan laughed helplessly.</p><br/><p>\"The God Blood is on you.\" Qian Kunzi's face froze up before laughing out wildly, \"You had a way out of all these, yet you chose to ignore that and come down back to Hell once more. I've been searching for you for the past two years. To think that you would turn up on my doorsteps on your own! Amazing. Seems like I hadn't wasted all my efforts!\"</p><br/><p>The moment he heard the words 'God Blood', Lin Fan's blood boiled. Even though he had already absorbed the God Blood, he did not know what its effects were. Hence, it was almost as though there had been no effect on him.</p><br/><p>However, it was all because of this God Blood that the entire Saint Devil Sect was destroyed…!</p><br/><p>Damn it. HOW WAS THAT WORTH IT?</p><br/><p>Qian Kunzi sized Lin Fan up properly. His aura was practically non-existent. Seemed like he couldn't have gotten that strong after all. In the past two years, all nine great sects had expended all their efforts into looking for him. However, it was as though he had disappeared from the entire face of this world.</p><br/><p>Seemed like that old fogey from Saint Devil Sect still had some tricks up his sleeves to be able to hide someone so deeply and thoroughly.</p><br/><p>\"Big bro…!\" Wang Xiaoliu was worried.</p><br/><p>Lin Fan waved his hand in nonchalance. Smiling and stepping up slightly, he continued, \"That's right, I'm here right at your doorsteps now, Grandmaster Qiankun. Why? Are you thinking of killing me?\"</p><br/><p>Qian Kunzi looked at Lin Fan and burst out laughing, \"As long as you're obedient, I'll promise you get to keep your life.\"</p><br/><p>To Qian Kunzi, this lad was a trash two years ago. Even if he met some sort of miracle in the past two years, how strong could he have gotten? Naturally, Qian Kunzi wasn't worried in the least bit.</p><br/><p>But just then, a loud voice boomed out.</p><br/><p>'Monkey Steals Peaches.'</p><br/><p>'ARGH…!!!'</p><br/><p>Everyone's jaws dropped to the ground, unable to believe the scene that was happening right before them.</p><br/><p>The gleeful look on Qian Kunzi's face had turned ever more tragic.</p><br/><p>It was as though the most dreadful thing in his life had just happened. Hands at his crotch, he squatted down in slow motion.</p><br/><p>This tragic and sorrowful cry rang out across the entire Qiankun Sect. This was a melancholic wail. There was nothing in this world that could compare to the morose tone of this cry.</p><br/><p>Lin Fan was unbothered in the least bit by the state of Qian Kunzi. He turned around slowly and looked at Wang Xiaoliu.</p><br/><p>\"Did you see that? The essence of Monkey Steals Peaches is for you to not rush headstrong in. You've got to wait till the enemy is unprepared. Stretch out, pull, and give it a good rumbling. Of course, for the sake of your health, you've got to prepare some gloves or the likes. Who knows what sort of diseases dirty, stinky old men like these have?\"</p><br/><p>Looking at everything, Wang Xiaoliu could only nod his head blankly.</p><br/><p>'Daddy…! Our family's Monkey Steals Peaches has finally been glorified! Even the Grandmaster of a great sect has fallen prey to it!' Wang Xiaoliu looked up into the sky as two streams of hot tears poured down his face freely. This was a demonstration of his emotions.</p><br/><p>At the same time, he finally began to understand the essence of Monkey Steals Peaches.</p><br/><p>Shifty and opportunistic. That was the way to go about it.</p><br/><p>Something as easy as such, how could he have taken so long to understand?</p><br/>\n</div>"}