{"title": "Chapter 401: Don’t Insult My Family Technique!", "id": 401, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-401-don%E2%80%99t-insult-my-family-technique", "volume_title": "Volume 5", "body": "<h1>Chapter 401: Don’t Insult My Family Technique!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 401: Don’t Insult My Family Technique!</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>\"Oh well. Now that teacher is back, I have naturally something big I wish to attend to. It'll be troubling for me to bring you along with me. How about this? Go and look for your fellow classmates. Once I'm done with my stuff, I'll look for you guys.\" In front of his student, Lin Fan naturally had to show his disposition as a teacher.</p><br/><p>\"Yes, don't worry teacher. I'll go and look for all of them.\" Cao Tianjiao nodded his head excitedly. If they knew that their teacher was back, all of them would definitely be really excited!</p><br/><p>Back then, their teacher had left suddenly without saying goodbye. They didn't even know what had happened. Not long later, the incident in the Great Yan Dynasty happened. After escaping from the dynasty, all of them had to wander as destitutes outside, suffering the cruelty of the world.</p><br/><p>\"Okay.\" Lin Fan nodded his head. Gently raising his hand, he tore a gap in the void and left.</p><br/><p>By now, all the juniors of Cai Tianjiao were completely dumbfounded. They had not dared to speak a single word in front of Lin Fan, only listening with a respectful face.</p><br/><p>After Lin Fan left and they calmed their nerves, they began to clamor excitedly.</p><br/><p>\"Senior brother, why have you never mentioned that you had such a powerful teacher!\"</p><br/><p>\"That's right! Not only is he young, isn't his power level just way too frightening? He was so scary!\"</p><br/><p>\"Let's not even begin to talk about his disposition! One look and one can definitely tell that he's someone extraordinary and peerless!\"</p><br/><p>\"That palm strike just now… that was simply awesome! I doubt even greater celestial beings can be that strong! It felt as though the entire sky was about to collapse!'</p><br/><p>...</p><br/><p>Listening to the praises of his juniors, Cai Tianjiao's mouth twitched slightly with a look of pride.</p><br/><p>\"Of course! That's my teacher for you! Let me tell you guys. Back then, I and my classmates were the ones with the lowest potential within the entire school! Two years ago, my cultivation state was only that of a precelestial. It was only with the guidance of my teacher that my cultivation state could leap so far.\" Cai Tianjiao's mood was much more pleasant right now.</p><br/><p>\"Ah…That can't be right! Senior brother, you were only a postcelestial when you had entered the sect back then! With your current cultivation state right now, wasn't it all due to your own hard work?\" A junior brother disagreed with him.</p><br/><p>\"That's right…!\" The others nodded in agreement that it was due to his own hard work.</p><br/><p>Looking at all of them, the look of gratitude flooded Cai Tianjiao's face once more. He swept his robes and looked up into the distant sky, \"You guys don't understand…\"</p><br/><p>\"If you don't say, how would we understand? Please tell us!\"</p><br/><p>\"That's right…that's right!\"</p><br/><p>...</p><br/><p>Cai Tianjiao smiled and shook his head, \"You guys don't understand…\"</p><br/><p>'...' Everyone else.</p><br/><p>...</p><br/><p>Lin Fan had not expected the first person he would bump into upon returning to Cangling Continent to be an ex-student of his. That was nice.</p><br/><p>It had been two years. He should go and have a look.</p><br/><p>The place where Saint Devil Sect used to be, he wondered how it was right now. Or perhaps, some people might have already taken over it.</p><br/><p>Lin Fan's eyes were cold right now. Now that he was back, there was no way he would be satisfied without causing a hell of a ruckus. Otherwise, he would be letting himself down for the past two years of suffering.</p><br/><p>With that, a figure darted across the sky.</p><br/><p>The place which Saint Devil Sect used to occupy was a prosperous piece of land where Fengshui was plentiful. Even though there were barely any structures left after that massive war, there were still many people who eyed it.</p><br/><p>And right now, that place was occupied by Qiankun Sect.</p><br/><p>After that great war, the nine sects had split up the wealth of Saint Devil Sect equally. With that, this entire place was given to Qiankun Sect.</p><br/><p>The place where Qiankun Sect was situated initially was a pretty decent place. However, they coveted this place where Saint Devil Sect was. After Saint Devil Sect's destruction, the Grandmaster of Qiankun Sect ordered their entire sect to move over to this location.</p><br/><p>Qiankun Sect's Training Grounds…</p><br/><p>Countless of disciples were training tirelessly.</p><br/><p>'URGH…!'</p><br/><p>A series of loud grunts rang through the sky, as all the disciples were hard at training up.</p><br/><p>A figure glided through the entire training grounds like a dragon. He was emanating hot air consistently, as though his body was filled with boiling water.</p><br/><p>'Tiger's Roar!'</p><br/><p>A Qiankun Sect disciple filled with vigor landed a punch on a motionless person standing there.</p><br/><p>Bam!</p><br/><p>A dull thud rang out, accompanied by a loud cry.</p><br/><p>The person who was struck collapsed onto the ground while spitting out blood. His eyes were filled with hatred.</p><br/><p>\"Hmph, trash. Can't even take a punch.\" The Qiankun Sect disciple looked coldly at the punching bag who was sent flying, and his lips curled in disdain.</p><br/><p>The surrounding Qiankun Sect disciples gathered and laughed, \"Hey, senior brother! These bunch of punching bags that are leftovers from the old Saint Devil Sect. How can they still spit out blood after training their Titanium Grade Demon Body for such a long time? What a bunch of weebs! Why's the Grandmaster even keeping them alive?\"</p><br/><p>\"Oh, that's something you guys don't understand. The Grandmaster mentioned that cultivation requires one to have practical fighting experience. These guys used to be punching bags of Saint Devil Sect, and they've trained the lowest possible skill of physical body strengthening. Even though it's pretty useless, they won't die that easily. Especially when that Titanium Grade Demon Body is trained to its peak, they can take quite the beating.\"</p><br/><p>\"Oh, so that's the case! Seems like these punching bags of the Saint Devil Sect are still pretty useful, eh? Well, we've killed quite a few in the past two years. These are the only ones left. Senior brother, you've got to hold it in! Leave some of them for us!\"</p><br/><p>\"HAHA. Of course, of course!\" The Qiankun Sect disciple laughed maniacally. He looked the punching bag viciously, \"Why? You're indignant? All of you punching bags from Saint Devil Sect are a bunch of trashes!\"</p><br/><p>Some of the remaining punching bags from Saint Devil Sect looked at these Qiankun Sect disciples with a raging fire. But what could they do?</p><br/><p>They were only alive right now under their mercy.</p><br/><p>Even though they were punching bags back in Saint Devil Sect, they would still be left with some dignity and mercy. However, these Qiankun Sect disciples were more vicious than the other. None of them took them as human beings.</p><br/><p>During that battle back then, they were nothing but punching bags who could do nothing. Eventually, they were captured as slaves after Saint Devil Sect was destroyed.</p><br/><p>They thought that they might be spared by these sects. To think that the Qiankun Sect Grandmaster would have an eye on them and keep them alive just to be punching bags for his disciples.</p><br/><p>Wang Xiaoliu gripped his fists tightly. Looking at his fellow punching bags from Saint Devil Sect, he gritted his teeth. Even though he feared death in his heart, he had enough.</p><br/><p>\"I've had enough! I want to challenge you! Fine, I'll acknowledge being Saint Devil Sect's punching bag! But to be punching bags for you guys? I can't take that anymore! What else can you do to me other than kill me? I ain't afraid!\" Wang Xiaoliu lashed out at that Qiankun Sect disciple.</p><br/><p>'HAHAHAHAHAHA…!'</p><br/><p>All the surrounding Qiankun Sect disciples burst out laughing.</p><br/><p>This guy was just courting his own death!</p><br/><p>To think that he would even think of resisting at this point! What a joke!</p><br/><p>\"Xiaoliu…!\" Within the past few years, the relationship of these punching bags had grown even stronger. They had thought of resisting earlier on, but this was the enemy's territory. What could they even do? Looking at Xiaoliu resisting for them, their hearts began to worry.</p><br/><p>\"Oh, you? What do you know? You want to beat us with your Titanium Grade Demon Body?\" The Qiankun Sect disciple burst out laughing wildly. He flexed his muscles, causing one to feel intimidated by them.</p><br/><p>Wang Xiaoliu ground his teeth, \"With my family technique.\"</p><br/><p>'HAHAHAHAHA…!' Everyone started laughing once more, as though they had heard the funniest joke in the entire world.</p><br/><p>Family technique? What a bloody damned joke!</p><br/><p>\"Come, I'll see just what sort of dogsh*t family technique you have.\"</p><br/><p>\"I'LL FIGHT YOU! DON'T INSULT MY FAMILY TECHNIQUE!\" With a holler, Wang Xiaoliu darted towards that Qiankun Sect disciple.</p><br/><p>'HAHAHA…!' Looking at this punching bag who couldn't even muster a proper stance, all the disciples started jeering.</p><br/><p>In their eyes, trash would always be trash. Family technique? Joke. What a joke!</p><br/>\n</div>"}