{"title": "Chapter 417: Begging Pitifully", "id": 417, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-417-begging-pitifully", "volume_title": "Volume 5", "body": "<h1>Chapter 417: Begging Pitifully</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 417: Begging Pitifully</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>'Ding…congratulations on killing Utmost Celestial upper-level Heaven Queen.'</p><br/><p>'Ding…experience points +2,000,000,000'</p><br/><p>...</p><br/><p>\"What? That's all the amount of experience points I get?\" Lin Fan twitched his mouth. He was displeased with the amount of experience points that the Heaven Queen gave out.</p><br/><p>That was an utmost celestial upper-level cultivation state!</p><br/><p>But thinking back, this Heaven Queen was only a single strain of consciousness of a powerful being of the upper world. For her to have a cultivation state of an utmost celestial upper level was pretty decent to begin with.</p><br/><p>'Hais…'</p><br/><p>Lin Fan could not help but sigh in exasperation. He hadn't even been to the upper world, yet he had already sown some seeds of discord with two powerful beings. What a tragedy!</p><br/><p>But so what? He wasn't afraid, man! At most, he would just f*ck them up, that's all.</p><br/><p>The higher the difficulty of his challenges ahead, the more excited Lin Fan got.</p><br/><p>Of course, these were just words he used to console himself. He was still pretty nervous in his heart.</p><br/><p>To think that a single strain of consciousness of the powerful being could create such a formidable foe. If he were to really end up in the upper world one day and be discovered by these powerful beings, wouldn't he die with just a single slap?</p><br/><p>Thinking of that, Lin Fan decided that he had better get his act straight.</p><br/><p>\"How's it, Namo Saint Emperor? Are you feeling a pleasurable sensation?\" Coming to the Namo Saint Emperor, Lin Fan's lips curled into a cheeky smile.</p><br/><p>But in response to Lin Fan's questions, only 'PIAK PIAK PIAK' could be heard. The Namo Saint Emperor had already given up entirely on resisting. However, he would never have himself say out the reply, 'Not bad. In fact, the feeling's getting better.'</p><br/><p>To the Namo Saint Emperor, this was a form of humiliation, an unbearable humiliation.</p><br/><p>He had never heard of a pill as such before.</p><br/><p>Lin Fan flicked his robes with his eyes fluttering, as though he was deep in thought about something.</p><br/><p>\"Actually, I've got no grudge to bear with you. I shouldn't kill you.\" Lin Fan said softly.</p><br/><p>\"B*stard! You didn't have a grudge, but now you've got yourself one!\" Namo Saint Emperor thought that the man before him had finally realized the severity of his actions, and was trying to absolve this situation as such. But no, there wasn't anything in this world that was so cheap.</p><br/><p>\"That's right. That's what I thought as well. Since I've already sowed this grudge, then Yours Truly isn't afraid of you either. GO AND DIE!\" With that, Lin Fan sent down a slap that slammed the Namo Saint Emperor deep into the ground. The tremendous amount of energy that was channeled through that slap was cruising through his body indiscriminately.</p><br/><p>BAM!</p><br/><p>A loud thud.</p><br/><p>\"Kid, Your Majesty will make sure you regret this…!\" These were the words that any villain would say at the end of their lives. But Lin Fan was already used to all this.</p><br/><p>'Ding…congratulations on killing utmost celestial full cultivation being Namo Saint Emperor.'</p><br/><p>'Ding…experience points +3,000,000,000'</p><br/><p>...</p><br/><p>With that, the entire land turned silent. The surroundings looked desecrated like the end of the world.</p><br/><p>Other than providing experience points, these two people had no use at all.</p><br/><p>Descending their consciousness. Why couldn't they have brought with them some energy grid line chains as well?</p><br/><p>To the current Lin Fan, nothing was more important than energy grid line chains. After all, he still had to summon the Heart Demon Emperor!</p><br/><p>He needed that essence blood to boost up his Blood Sea to Lvl 9!</p><br/><p>Lin Fan's gaze turned towards that black-robed figure in the distance.</p><br/><p>\"Who are you?\" He asked. He did not know who this person was who had been standing there motionlessly all the while from the start.</p><br/><p>The black robed man floated there motionlessly. Eventually, a hand stretched out from beneath the robes. This hand looked weird; it was both rough and feminine at the same time.</p><br/><p>The black robe danced in the skies as it finally revealed who the person beneath it was.</p><br/><p>Lin Fan threw the person a casual look. But he was stunned thereafter.</p><br/><p>\"What the…?\"</p><br/><p>This person looked pretty familiar, as though Lin Fan had seen the person before. But, he couldn't remember exactly where or under what circumstances it was.</p><br/><p>This guy's power level was pretty surprising as well. To think that there would be such a being in Cangling Continent as well.</p><br/><p>Greater celestial full cultivation being with 10 energy grid line chains.</p><br/><p>He was slightly stronger compared to Han Lu and Fang Han.</p><br/><p>\"Do you still remember me?\" The black robed person spoke up. The voice was both feminine and masculine at the same time, pretty shocking.</p><br/><p>Lin Fan did not reply. He just observed even closer, as his brain began to tinker. This person did seem pretty familiar indeed. In fact, the aura was familiar as well.</p><br/><p>'Body of Yin and Yang?'</p><br/><p>Suddenly, Lin Fan recalled what this aura was. This was the special body type that was brought about after Twisting Heaven and Earth changed up one's Yin and Yang!</p><br/><p>Lin Fan had not twisted much people other than those bandits back then!</p><br/><p>\"You're Qu Xiang Ge?\" Lin Fan asked from the sides.</p><br/><p>Back then, he was young and childish. The reason for him to use his skills casually was also because he was playful. However, ever since he had realized the meaning of life, it had been a long time since he swapped up the genders of others.</p><br/><p>After all, most of the people Lin Fan took down didn't have any blood feud with him. There was no reason for him to change their genders for no reason. That was pretty overboard.</p><br/><p>The special body type of Yin and Yang was pretty strong. In fact, it could even be considered a divine body. But to others, this was definitely something that was unbearable.</p><br/><p>\"That's right…\" Qu Xiang Ge, who now possessed the body of Yin and Yang, nodded his head blankly.</p><br/><p>Lin Fan looked at Qu Xiang Ge. Through the latter's eyes, he could feel the despair towards life, as well as the look of someone who had been through many things in life.</p><br/><p>He wondered just what sort of tribulations this guy had to undergo in these two years. But by the looks of it, it should definitely be nothing that's too great.</p><br/><p>\"Are you here to seek revenge from me?\" Lin Fan felt that this guy must definitely be out to seek vengeance. After all, no one in this world could tolerate something as such. If someone were to turn him from a man to a woman, he would definitely want the life of the other party!</p><br/><p>But, the other shocking thing was that this body of Yin and Yang was truly way too formidable! To think that it could produce such a powerful being after just two years! That was incredible!</p><br/><p>Qu Xiang Ge did not reply as he continued walking towards Lin Fan.</p><br/><p>Each step he took caused a great amount of pressure to rise in Lin Fan's heart.</p><br/><p>Should he strike out or not? After all, he was the one who had caused this man so much misery back then. It would be quite overboard of him to deal yet another blow to this poor person.</p><br/><p>After all, this man was just a bandit back then. He didn't commit any sort of sinful crimes that would deserve such treatment.</p><br/><p>If only he could turn back time right now.</p><br/><p>Lin Fan swore that he would have never turned Qu Xiang Ge and gang into a bunch of Yin and Yang bodies. But Lin Fan was puzzled still. Back then, there were 20+ of them! Why was it only Qu Xiang Ge who was left right now?</p><br/><p>And just then, Qu Xiang Ge appeared before Lin Fan.</p><br/><p>Plopping to the ground in a thud, that calm face of his had disappeared entirely as he broke down into tears.</p><br/><p>\"Oh Senior! Please! I beg you! Please return me to who I was before! I've suffered so much in these past two years! The world outside is way too dangerous! Everyone took me as a freak! All I wanted to do was to be a happy bandit! I didn't want to get involved in so many things!\" Qu Xiang Ge sobbed tragically.</p><br/><p>These past two years were simply way too horrifying! That mysterious fella had captured them, then forced them to train up and kill off one another. In the end, he was forced to kill all of his other junior brothers.</p><br/><p>That fella tried to devour his body as well. But thankfully, he manged to fend off against the mysterious person. But still, he was now the only one left.</p><br/><p>In the past two years, he had not dared to go anywhere.</p><br/><p>When he revealed his features, everyone who saw him tried to kill that weird looking face of his. Scary. Way too scary!</p><br/><p>\"Senior! I've got elders at home waiting for me and no kids! I'm the only son back home, and I've yet to fulfill my duties of passing down more descendants! Please turn me back! I swear that I'll never dare to be insolent or be a bandit any longer!\" Qu Xiang Ge prostrated before Lin Fan and sobbed while begging.</p><br/><p>Lin Fan was totally stumped…</p><br/><p>So, this guy wasn't here for vengeance…</p><br/>\n</div>"}