{"title": "Chapter 422: A Combined Strike Of Monkey Steals Peaches", "id": 422, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-422-a-combined-strike-of-monkey-steals-peaches", "volume_title": "Volume 5", "body": "<h1>Chapter 422: A Combined Strike Of Monkey Steals Peaches</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 422: A Combined Strike Of Monkey Steals Peaches</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Between the Blood World and the Cangling Continent, there existed a barrier. For the Heart Demon Emperor to be able to break down the barrier was something that was supposed to be impossible.</p><br/><p>Perhaps all of this had to do with the Blood Kill Sect.</p><br/><p>The Heart Demon Emperor was an overlord of the Blood World, an existence that ruled over many. Just the Heart Demon Emperor alone would practically be enough to take down the entire Cangling Continent.</p><br/><p>Unless Heaven's Will appeared and subdued the Heart Demon Emperor, no one else would be his match.</p><br/><p>\"Brother Zhui, what level have you reached for Master's Monkey Steals Peaches?\" Cao Tianjiao was attacking all the way with nimble movements.</p><br/><p>\"Oh, I'm not talented. I'm only at Level 5.\" Zhui Mo replied calmly.</p><br/><p>\"Holy sh*t! Brother Zhui, you're too sick, aren't you? There's only a total of 6 levels to Monkey Steals Peaches, and you claim that you're not talented? Even after all these years, I'm only at level 4!\" Cao Tianjiao wanted to puke blood.</p><br/><p>The skill was really incredible indeed. However, the method of usage was a little vulgar.</p><br/><p>\"Hoho, you really think I'm powerful? Let me tell you, I'm pretty damn sure that junior sisters Liu Shuishui and Han Mengmeng are at level 6 itself. Don't you think so, Brother Xiao and Brother Zang?\" Zhui Mo's knowing smile was targeted at the two of them.</p><br/><p>\"Brother Zhui, what are you talking about? I've only gotten to level 4 after working so hard. How can our two junior sisters be at a higher level in the skill than us?\" Cao Tianjiao replied in disbelief. However, his brain finally realized the hidden meaning behind Zhui Mo's words as he sniggered, \"Oh, your mind's really dirty now, Brother Zhui.\"</p><br/><p>Xiaoze and Zang Tianhao looked at Zhui Mo, stumped. Just what had happened in the past two years for their usually quiet Zhui Mo to turn as such.</p><br/><p>\"Alright, victory shall be decided in this one strike.\" Zhui Mo's face was focused as his eyes sparkled. His past two years of hard work shall finally be shown right here and now.</p><br/><p>\"What are they trying to do?\" Zhu Di's Missy was looking at all these people in bewilderment, unable to comprehend their actions.</p><br/><p>\"They're going to unleash the scariest skill known to mankind.\" Han Mengmeng was now blushing thanks to those words by Zhui Mo.</p><br/><p>\"Really?\" Zhu Di's Missy was filled with anticipation. Scariest skill ever! How strong could it be?</p><br/><p>...</p><br/><p>\"I've never seen such a humongous one. I wonder if Monkey Steals Peaches would work out?\" Cao Tianjiao commented worriedly.</p><br/><p>\"No idea. We'll know once we try. You guys steal the front portion, I'll go from the back.\" Zhui Mo started allocating the job scope. This donger of the Heart Demon Emperor was simply way too huge, such that one person could not possibly steal his peaches alone.</p><br/><p>\"Alright…wait, no. Brother Zhui, YOU go from the front, we'll take the back.\" Zhu Di had wanted to agree with the arrangement. But she realized something was wrong.</p><br/><p>Looking at everyone, Zhui Mo eventually nodded his head, \"Fine…\"</p><br/><p>In the blink of an eye, these ants in the eyes of the Heart Demon Emperor had all lunged towards his crotch area. He was puzzled, wondering what these ants were up to.</p><br/><p>'Monkey Steals Peaches!'</p><br/><p>Suddenly, the skies changed color. The palms of everyone present glowed brightly, as though they possessed an unspeakable power.</p><br/><p>This was a power that could disrupt the Heaven and Earth itself. Even though it was weak on its own, in the hands of a human, this was a heaven-defying power.</p><br/><p>BOOM!</p><br/><p>Dozens of people gripped out together at different sides of those peaches. At that instant, those bright flashes of light covered the entire world.</p><br/><p>\"So…piercing!\" Zhu Di's Missy covered her eyes with a hand. That bright light was piercing like needles, causing one to barely be able to open their eyes.</p><br/><p>\"Did we do it…?\" Zhui Mo and the rest were elated. They could feel a sense of surrealism.</p><br/><p>BOOM!</p><br/><p>In that instant, that gigantic massive object of the Heart Demon Emperor jerked. A typhoon appeared in the skies, sending everyone flying.</p><br/><p>\"Ants! How dare you guys try to humiliate your majesty!\" A holler of rage rang through the skies. It was so strong that the shockwave had everyone's blood rumbling, making them spit out a mouthful of fresh blood.</p><br/><p>\"How can this be?\" Everyone was thoroughly shocked. They had failed.</p><br/><p>\"Seems like we still can't do it. This guy is simply too big!\" Zhui Mo could only feel the blood energy within his body surging as though they were about to implode. He was quite fearful, \"Just how strong is this Heart Demon Emperor? To think that a single vibration could almost take us down!\"</p><br/><p>\"This fella is simply too strong! If not for the fact that we possess the Titanium Grade Demon Body, we would definitely be just a slush of meat right now!\" Cao Tianjiao looked at the body that was coming through the void in fear.</p><br/><p>Everyone struggled to stand up before retreating gradually.</p><br/><p>\"Brother Xiao, are you alright?\" Looking at the bloodstains at the side of Xiaoze's lips, Liu Shuishui asked in worry.</p><br/><p>\"I'm fine. But if we don't get out of this place in time, we'll definitely all die. Just what sort of a being is this Heart Demon Emperor? How is he so strong?\" Xiaoze's heart was filled with fear. This wasn't something that they could handle at all.</p><br/><p>\"Teacher, just where are you!\" Cao Tianjiao was on the brink of tears.</p><br/><p>Why the hell did he keep bumping into these type of sick sh*ts? Especially someone who could be immune to that ultimate technique of Monkey Steals Peaches. Wasn't this way too much?!</p><br/><p>Back when he was a postcelestial, he could even take down a lesser celestial with this move alone! But now that there was so many of them, how could there be no effect at all despite them unleashing it all at the same time?</p><br/><p>Surreal! Everything was surreal!</p><br/><p>\"Tianjiao, we've really been f*cked by you, man. Of all places, why did you have to choose this place!\"</p><br/><p>\"How would I know? This gorge looked like it could provide some shelter from the rain and all! To think that this kinda sick sh*t would appear here!\"</p><br/><p>\"What should we do now?\"</p><br/><p>\"I've got no idea! This fella has already sealed up the entire place!\"</p><br/><p>...</p><br/><p>A red light suddenly glowed out and surrounded the entire gorge.</p><br/><p>It was as though there was some sort of horrific existence that was hidden behind this red light as it howled malevolently.</p><br/><p>\"HAHA…! Your majesty's finally out!\" Once the Heart Demon Emperor came out of the void completely, he reared his head up into the skies and howled wildly.</p><br/><p>\"Oh, the aura of humans…! This is definitely the best form of nutrients for me, the Heart Demon Emperor!\" The Heart Demon Emperor's towering figure stood tall between the Heaven and Earth, as he gazed down at Cao Tianjiao and the others with pitch black eyes.</p><br/><p>The Heart Demon Emperor was a demon of the hearts. He could lurk within the souls and recesses of any living beings while sapping at their negative energies and emotions continuously.</p><br/><p>He had long had enough of the Blood World. The world of humans was truly the place where he was most suited.</p><br/><p>Using the greed and lust of their hearts to lure these humans, he would then bring out every single last bit of their inner demons.</p><br/><p>Cao Tianjiao and the others had given up completely.</p><br/><p>Strong... Way too strong!</p><br/><p>Just the aura of the Heart Demon Emperor alone was enough to cause them to want to give up.</p><br/><p>\"Zhu Di, I don't want to die…!\" Looking at the malicious face of the Heart Demon Emperor, the Missy was pale with fright. Zhu Di's big fat body was trembling as well. Since she was about to die, she should just let loose of her inner self. She hugged her Missy tightly and comforted her, \"Don't worry. I'll be here for you even if the skies topple down.\"</p><br/><p>Missy looked at Zhu Di in shock. She had never expected that Zhu Di would ever hug her!</p><br/><p>\"Hais, seems like it's really a tragedy this time round. We didn't manage to wait for the arrival of teacher, but we have to face the arrival of this thing instead. I'm so sorry everyone! It's all my fault for choosing this sh*thole of a place!\" Cao Tianjiao was reproaching himself.</p><br/><p>\"It's alright, Tianjiao. We don't blame you. Teacher will definitely avenge us!\"</p><br/><p>\"Hais, what do you guys say? Shall we commit suicide or let this thing kill us?\"</p><br/><p>\"I think we had better commit suicide. I don't want to get eaten by this thing!\"</p><br/><p>\"Well, so who's gonna start first?\"</p><br/><p>\"You of course! Since you suggested it, you should give us an example!\"</p><br/><p>...</p><br/><p>\"HAHAHA…! Silly humans! You want to die in front of your majesty? Not so easy! I'll have control over your bodies!\" The Heart Demon Emperor laughed maniacally. These ants in his eyes could definitely cause him no troubles at all.</p><br/><p>And just then, a bright, brilliant voice boomed through the air.</p><br/><p>\"Alright, alright, alright! Not bad! Seems like this guy's brought himself to my doorsteps…!\"</p><br/><p>Everyone's gazes turned towards the skies. With that look, Cao Tianjiao was the first to exclaim.</p><br/><p>\"TEACHER…!\"</p><br/><p>\"Guys! It's alright! Teacher's here…!\" Cao Tianjiao called out excitedly.</p><br/><p>After staring blankly for a moment, everyone started screaming out.</p><br/><p>\"SAVE US, TEACHER…!!!\"</p><br/><p>...</p><br/>\n</div>"}