{"title": "Chapter 421: Arriving At The Doorsteps Himself", "id": 421, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-421-arriving-at-the-doorsteps-himself", "volume_title": "Volume 5", "body": "<h1>Chapter 421: Arriving At The Doorsteps Himself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 421: Arriving At The Doorsteps Himself</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Ever since Lin Fan left the Heaven Mountain City, it was as though his entire spirit had been given a great booster. Perhaps this had something to do with that promise back then.</p><br/><p>In the past, when he had laid down the promise, he didn't think too much about it himself either. However, the stronger Lin Fan grew, the more he realized that promises as such were nudging him in his heart consistently. Perhaps, the shackles of the hearts could only be undone once he had fulfilled his promises.</p><br/><p>After he had settled down Wang Xiaoliu's family situation properly, he finally felt relief. Seemed like he had to take extra caution not to just promise that easily anymore.</p><br/><p>For someone such as Yours Truly who was always true to his words, promises were never things to be taken back.</p><br/><p>With that, Cangling Continent no longer had any attachments left for Lin Fan.</p><br/><p>Everything that mattered to him right now was in Dongling Continent. For now, he would go and look for those students of his in the past. After that, he would leave this place and head back to Dongling Continent once more.</p><br/><p>Damn it! He wondered when the bloody hell this Beast Spirit World would begin their invasion. These guys should at least give them some time to prepare, man!</p><br/><p>There were only two worries on Lin Fan's mind right now. First was the issue of the Beast Spirit World, and second the so-called Heaven's Will.</p><br/><p>BOOM!</p><br/><p>Just then, Lin Fan sensed a loud explosion coming off from a distance.</p><br/><p>There was an immense blood aura that surged through the skies in the distance, spreading out rapidly.</p><br/><p>'That's weird. How could a place so unseemly like Cangling Continent cause such a huge ripple? Could something be wrong?' At this moment, Lin Fan was dubious.</p><br/><p>Suddenly, his face changed. Wasn't that the place where Cao Tianjiao had sent out the signal?</p><br/><p>Lin Fan had passed an object to Cao Tianjiao. Once he was done looking for all his classmates, all he had to do was crush the object and his location would be transmitted over to Lin Fan.</p><br/><p>Evidently, that was the location where something was happening right now.</p><br/><p>Even if Cao Tianjiao had received some sort of guidance from Lin Fan in the past, in the face of such an immense power, he was practically nothing but ants!</p><br/><p>Lin Fan hastened his speed immediately…</p><br/><p>\"FUSHU, WHEN'S OUR TEACHER COMING!!!\" Within a gorge somewhere, a group of people were huddled together tightly. Looking at the sight before them, they were so scared they were about to wet their pants.</p><br/><p>The moment they heard that their teacher was arriving, all of them were excited beyond words. With that, they gathered at the gorge happily awaiting their teacher's return.</p><br/><p>However, before their teacher had even arrived, they seemed to have attracted a BOSS.</p><br/><p>They were seated down together, engaged in conversation happily. After all, it had been two years since they were apart. Now that they were finally reunited, they had a lot of tales and stories to share.</p><br/><p>But just then, the void suddenly tore apart right in their faces. At that point of time, they did not know what was within that gap at all.</p><br/><p>But as they took a closer look, they were completely stumped.</p><br/><p>They had traversed across the lands and seen all sorts of beasts. However, this was indeed the first time they saw something like this!</p><br/><p>They could not even tell the end of its body! With a massive aura, this was practically a king amongst demons!</p><br/><p>And just as they wanted to escape, this thing which had referred to itself as the Heart Demon Emperor blocked the path of everyone around. They were thus trapped.</p><br/><p>\"How would I know! All I did was crush the object that my teacher gave to me! It shouldn't be too long before he's here, I suppose!!!\" Cao Tianjiao was practically on the brink of tears right now. Why the hell had things turned as such?</p><br/><p>They had better not be crushed to death by this so-called Heart Demon Emperor before their teacher even arrived!</p><br/><p>\"Brother Xiao, what should we do!\" A girl who was standing beside Xiaoze looked warily at the Heart Demon Emperor who was emerging out of the void slowly. Her heart was filled with fear as well.</p><br/><p>This girl was none other than Liu Shuishui. Back in the classes, Liu Shuishui had already taken a liking to Xiaoze. Ever since the incident of the Great Yan Dynasty, all of them had escaped into the wilderness. Xiaoze and Liu Shuishui had stuck together to face the world. After two years of being together, they had since become a couple.</p><br/><p>\"Don't worry…d-don't worry!\" Xiaoze gulped down his saliva. Even though he was asking her not to worry, his heart was thumping furiously in nervousness.</p><br/><p>\"Senior Brother Xiao, we'll let her leave first! Us men will hold the fort later on!\" Standing at a corner, Zang Tianhao spoke up.</p><br/><p>\"No, we'll all definitely leave together.\" Dressed in green robes, this refined-looking Han Mengmeng's face was resolute. While she was terrified as well, fear should not stop them from making their way out together.</p><br/><p>Zang Tianhao and Xiaoze could be considered love rivals. However, they had made up after that. After all, things could be easily resolved once people faced it together.</p><br/><p>\"Zhu You, what do you intend to do about your Missy?\" Cao Tianjiao asked Zhu You, who had gotten even plumper.</p><br/><p>\"Tianjiao, I'm not called Zhu You! I'm Zhu Di!\" This rotund Zhu Di tried explaining.</p><br/><p>\"Alright, no one cares. After our teacher arrives, you'll still be called Zhu You!\" Cao Tianjiao threw her a single glance.</p><br/><p>Zhu You could be considered a winner in life. Ever since the great escape from the Great Yan Dynasty, she was wandering around the roads like a vagrant. By a stroke of luck, she was adopted by a Missy of a rich family. With that, she became a guard of the Missy and was living a really good life.</p><br/><p>Upon hearing Cao Tianjiao's notice that their teacher had returned, Zhu You naturally couldn't wait to see her teacher once more. At the same time, her Missy insisted on tagging along to take a look at her Zhu You's teacher and find out who he was.</p><br/><p>\"Junior Sister Han, Brother Zang is right. You girls should leave first.\" Zhui Mo who had remained silent all the while spoke up as well.</p><br/><p>Zhui Mo's parent was a servant in one of the four great families of the Great Yan Dynasty, the Yun Family. Ever since that incident, he had escaped out into the wilds as well. Because he was a man of tenacity, he was able to endure all sorts of hardship, and his cultivation state had improved as such.</p><br/><p>Even though he was nowhere near a top tiered powerful figure within Cangling Continent, for someone his age to have that sort of cultivation state was something pretty decent as well.</p><br/><p>\"Zhu Di, what should we do?\" The girl who was being protected by Zhu Di was young with snow-white skin. One look at her exquisite features and one could tell that she belonged to a distinguished family. Therefore, the moment she caught sight of this mysterious creature that had emerged from the voids, she was totally scared witless.</p><br/><p>As a Missy of a great family, she had seen all sorts of things. However, she was totally in thorough shock in front of this Heart Demon Emperor.</p><br/><p>That violent aura coiled around the Earth. Everyone felt as though they were a little boat in the face of a tsunami, where they could be overturned and sink at any moment.</p><br/><p>\"Missy, don't worry! Zhu Di will definitely ensure that you get away safely!\" Zhu Di looked at the Heart Demon Emperor precariously. Her heart was filled with worries, wondering if any of them could even make it out alive.</p><br/><p>\"Eh? Guys, take a look! Look at that position of the Heart Demon Emperor!\" Just then, Zhui Mo pointed out at the Heart Demon Emperor anxiously.</p><br/><p>The moment everyone heard this, their gazes turned in unison. At the same time, they could not understand what he was talking about, \"Brother Zhui, what do you mean?\"</p><br/><p>Looking at them, Zhui Mo could not help but sigh out exasperatedly, \"Do you guys really not remember the skill that our teacher had taught us?\"</p><br/><p>Suddenly, everyone jerked alert. They then clamored excitedly, \"Brother Zhui! Do you mean…MONKEY STEALS PEACHES?\"</p><br/><p>\"That's right. What else could it be? After all these years, I suppose everyone's pretty familiar with the skill?\"</p><br/><p>\"That's right! This skill that teacher imparted to us is definitely strong!\"</p><br/><p>\"Yes, yes! I met with trouble quite a few times. It was through this skill that I was able to get out unscathed.\"</p><br/><p>\"But, that guy's thing is so huge! Can we do it?\"</p><br/><p>\"Stop right there. Whether or not it works, we've got to try it out! Otherwise, by the time this guy comes out of the void fully, we'll definitely have no more chance!\" Zhui Mo took in a deep breath with worry.</p><br/><p>\"Alright then, let's give it a shot. Everyone, take care of your safety! Lets' go…!\"</p><br/><p>Everyone took a look at one another. Nodding their heads, they rushed out together towards that Heart Demon Emperor…</p><br/>\n</div>"}