{"title": "Chapter 431: A Fart To Shock The World", "id": 431, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-431-a-fart-to-shock-the-world", "volume_title": "Volume 5", "body": "<h1>Chapter 431: A Fart To Shock The World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 431: A Fart To Shock The World</p><br/><p>Translator: Lam Editor: Hitesh</p><br/><p>Dongling Continent, at a little village near the boundaries…</p><br/><p>This was a village that was secluded from the rest of the world. People here were relaxed and at ease, far from the scuffles and conflicts of the outside world.</p><br/><p>BOOM!</p><br/><p>Just then, at a far end edge of the village, a rip suddenly appeared and tore through the void. A gap of a few thousand feet suddenly appeared in this village, which was secluded away from the rest of the world.</p><br/><p>Within that gap, black mist rumbled ominously, as though countless demons and devils were about to emerge out from within.</p><br/><p>All these simple villagers immediately let down every single thing they were working on and looked at this gap in shock.</p><br/><p>They had no idea in the least bit what was about to happen.</p><br/><p>'ROAR!'</p><br/><p>Suddenly, a series of roars came out from within, booming through the void.</p><br/><p>Upon hearing these roars, these simple villagers were filled with horror. The color drained from their faces, and all the kids ran towards their parents to hide behind them.</p><br/><p>\"Finally, we're out…!\"</p><br/><p>Just then, a bunch of massive beasts came out from within the void. These beasts were burning with pitch black flames on their bodies. Towering and imposing, they darted towards the humans.</p><br/><p>\"AHHHH…!!! MONSTERS ARE HERE…!\"</p><br/><p>\"RUN!\"</p><br/><p>\"HELP US…!\"</p><br/><p>All these simple villagers could only run around in terror. However, in the eyes of these beasts, they were like fishes on a chopping board.</p><br/><p>\"HAHA…! Human fruits are the best indeed!\" An extremely malevolent looking beast had used his sharp fingernail to pierce through a person's head. Holding this person up like a barbequed meat, he devoured the body whole into his tummy.</p><br/><p>All these villagers in this small village were eventually cornered. One by one, all of these malicious beasts glared at them with a thirsty look in their eyes.</p><br/><p>\"All of these humans are mine!\" That malevolent beast from earlier glared over at these bunch of humans. Opening his wide mouth, he was intent on devouring all these humans in one mouthful.</p><br/><p>BAM!</p><br/><p>Suddenly, a gigantic flaming red hand slammed down on the head of that beast. Blood and meat splashed all over. That malevolent beast from earlier had died just like that.</p><br/><p>\"Whoever dares to consume any human beings shall die.\" A mighty towering colossal beast with exceptional aura howled into the sky.</p><br/><p>If Lin Fan were around, he would have recognized this fella with a single look.</p><br/><p>This was the Flame Overlord who was born from a mix of a human and a beast.</p><br/><p>Under the mighty command of the Flame Overlord, all the other beasts quivered in fear, not daring to resist.</p><br/><p>The Flame Overlord looked down at the entire place. He then looked into the distance. Sensing a familiar aura, he called out, \"All of you, follow me.\"</p><br/><p>BOOM!</p><br/><p>BOOM!</p><br/><p>The ground shuddered with every single step that these beasts took, as the massive group followed the Flame Overlord into the distance.</p><br/><p>...</p><br/><p>One by one, these gaps appeared in many places all around Dongling Continent.</p><br/><p>Some of the villages were not as fortunate as that secluded one.</p><br/><p>Wherever these beasts passed, nothing was left alive or intact. All of the humans were destroyed instantly by the rush of these beasts. In fact, they died extremely horrible deaths.</p><br/><p>All of them were devoured whole.</p><br/><p>There was a huge population in the Great Sheng Dynasty. This was one of the biggest dynasties in the entire Dongling Continent.</p><br/><p>But at this moment, three gaps had appeared outside the Great Sheng Dynasty.</p><br/><p>Everyone was stunned by the appearance of these gaps, from which, the roaring of beasts could constantly be heard.</p><br/><p>Within an inn in the Great Sheng Dynasty…</p><br/><p>Seeing this scene, a young man shuddered, and then appeared at the city walls of the Great Sheng Dynasty. Looking into the distance, he was astonished.</p><br/><p>\"So many mighty beasts! Could this be the end of the world?\"</p><br/><p>\"I definitely can't face them head-on. But, there's no way I should let these beasts destroy this place! Since the direction of the wind is in my favor, seems like I have to use THAT move.\"</p><br/><p>The young man leaped up onto the city walls. Upon seeing this, the guards of the Great Sheng Dynasty urged this young man to head down immediately. However, this young man did not heed their advice.</p><br/><p>Suddenly, right in front of the gazes of everyone present, the young man turned around. Positioning his butt facing outside the city, he looked at the masses, \"Guys, get further away. Just in case you guys suffer from any collateral damage!\"</p><br/><p>'POOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT…!'</p><br/><p>In that instant, the skies boomed out. This sound shook through the Heavens and Earth, causing everything to vibrate violently. An unknown yellow gas spurted out from the young man's anus rapidly, filling up the entire skies instantly.</p><br/><p>\"Done.\" Satisfied with his work, the young man clapped his hands together proudly.</p><br/><p>Everyone looked into the distance. Seeing the scene before them, all of their jaws dropped apart in disbelief. To think that that massive army of beasts would all collapse under this single fart!</p><br/><p>Just what sort of a fart was that for it to be this strong!?</p><br/><p>Yao Wuxie was nonchalant towards the gazes of the audiences. He looked into the distance, \"Brother Lin, seems like it's time for me to look for you. This looks like something big is about to happen.\"</p><br/><p>Yao Wuxie had undergone a massive change in these past one to two years.</p><br/><p>Even though he was still afraid of death and lazy, his power had grown tremendously. At the same time, he had found a way to control his special body type.</p><br/><p>In the hands of Yao Wuxie, his Doomed Poison Body could finally unleash its fullest potential.</p><br/><p>...</p><br/><p>Glory Sect…</p><br/><p>Lin Fan was having a big headache right now. Seemed like the Beast Spirit World was really unscrupulous indeed. To think that they would appear in such a wide range of areas. There was completely no chance for them to save or rescue anyone like that!</p><br/><p>\"Look over there…!\" Grandmaster Yan's face changed as he pointed out into the distance.</p><br/><p>From a location not too far from Glory Sect, a gap of a few thousand feet had begun to open up.</p><br/><p>Within the gap, Lin Fan could sense a horrifying presence.</p><br/><p>Not only was this presence strong, it was familiar.</p><br/><p>Indeed, it was as he had expected in his mind.</p><br/><p>\"Grandmaster, have the disciples hide away first. This battle isn't something that they can handle.\" Lin Fan said solemnly.</p><br/><p>The beasts were uncountable. Besides, beasts were stronger than humans to begin with if they were on equal footing, way stronger. Unless one had a certain cultivation state or level, there was no way one could fight against a beast.</p><br/><p>\"Alright, have all of our disciples enter the secret chamber!\" Grandmaster Yan pumped down the orders without hesitation.</p><br/><p>\"Let's head over to check out the situation.\" Lin Fan continued.</p><br/><p>\"Alright.\"</p><br/><p>Lin Fan and the others headed over towards the gap. Upon reaching the gap, they were dumbfounded by the sight before them.</p><br/><p>Upon reaching there, mountains and mountains of beasts were pouring out of the gap densely. The moment they touched the ground below, nothing could grow in their vicinity.</p><br/><p>\"These beasts are different from the ones in our world. They're much stronger in terms of power.\" Lin Fan frowned. He was concerned.</p><br/><p>Of course, there was no issue that these beasts were appearing around the Glory Sect. However, the presence of these beasts anywhere else would definitely spell trouble.</p><br/><p>It wouldn't be an exaggeration to say that nothing would be left alive.</p><br/><p>\"This is a calamity of Dongling Continent.\" Suddenly, the void rippled, and Ye Han appeared from within.</p><br/><p>\"Level Master Ye, how's the situation over at Cangling Continent?\" Lin Fan asked.</p><br/><p>\"I've already headed over to check. Everything's fine at Cangling Continent.\" Ye Han's face was grim and serious as well. She had not expected things to turn out like this just months after parting from Lin Fan.</p><br/><p>\"That's great.\" Lin Fan heaved a sigh of relief. If both sides were facing the same situation, then there was practically no chance of salvation at all.</p><br/><p>\"Demon City!\"</p><br/><p>Now that his treasure had already been completed, Lin Fan had yet to have the chance to try it out. This was probably the best time for it.</p><br/><p>\"What's that treasure?\" Upon taking a look at Demon City, Ye Han was stunned.</p><br/><p>\"Just something I've crafted casually.\" Lin Fan replied calmly.</p><br/><p>Focusing his gaze, he continued, \"Suppress them.\"</p><br/><p>BOOM!</p><br/><p>Suddenly, the Demon City began to expand rapidly. Covering the entire sky, a boundless amount of demonic aura burst out from within, as it crashed down towards the ground.</p><br/><p>'Ding…congratulations on killing lesser celestial beast.'</p><br/><p>...</p><br/><p>The notifications from the system rang out like a phone call. Lin Fan muted it immediately. This was not the time to be bothered about these.</p><br/><p>And just then, Lin Fan's face changed as he jumped into the void.</p><br/><p>\"Level Master Ye, help me to take care of Glory Sect. I'll be back in a jiffy.\" Lin Fan requested.</p><br/><p>\"Alright.\" Ye Han nodded her head without hesitation.</p><br/><p>Other than Lin Fan, Ye Han was probably the strongest in the Dongling Continent right now. With her around to hold the fort, Lin Fan could be at ease.</p><br/>\n</div>"}