{"title": "Chapter 435: The Part Of The Ancient One's Groin Which Was Lost Forever", "id": 435, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-435-the-part-of-the-ancient-ones-groin-which-was-lost-forever", "volume_title": "Volume 5", "body": "<h1>Chapter 435: The Part Of The Ancient One's Groin Which Was Lost Forever</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 435: The Part Of The Ancient One's Groin Which Was Lost Forever</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'Demon City!'</p><br/><p>In that instant, Lin Fan's aura instantly erupted out. The semi-finished treasure floated gently in the sky. The boundless demonic energy that was being emitted culminated slowly within the skies.</p><br/><p>In that instant, an illusory figure of the big ancient demon appeared between the Heaven and Earth. Rearing its head into a mad howl, it tore through the void and struck down towards the Ancient One.</p><br/><p>\"Eh? Demon King?\" The Ancient One was stumped for a moment before he burst out laughing, \"HAHA…! What a great joke this is! To think that the great demon king, who has conquered over all the ancient times, would be crafted into a treasure by someone! What a tremendous form of humiliation that must be! HAHAHA!\"</p><br/><p>Suddenly, the Ancient One's face changed, as his tone also turned sinister. Revealing a look of disdain, his black robes danced into the sky as he punched out, \"With just you? You're far from qualified.\"</p><br/><p>BOOM!</p><br/><p>Lin Fan's face changed. The Ancient One was stronger than he had ever imagined, way stronger. To think that even the semi-finished pseudo-legendary weapon he had crafted couldn't even deal a single bit of damage! Not only that, it was nearly shattered into pieces with just a single punch from the Ancient One!</p><br/><p>If not for the fact that the pseudo five spirits were boosting its strength by complementing one another, it would have definitely been destroyed by the Ancient One.</p><br/><p>\"Human, hand over my body, or you shall die!\" The Ancient One hollered.</p><br/><p>Disappearing into the void, he appeared right before Lin Fan instantly and threw out a punch.</p><br/><p>\"Hmph, dream on!\" How could Lin Fan even let that happen? If the Ancient One were to fuse back with all his body parts, there would truly be no one who could deal with him at all!</p><br/><p>BOOM!</p><br/><p>As the two punches containing equally devastating power collided with one another, a dazzling brilliance erupted out from the clash. This light blinded the entire Heaven, as the immense energy surge produced from it rippled the void in its surroundings.</p><br/><p>The Ancient One was startled as well. To think that a human could receive this punch of his! THAT was pretty unexpected.</p><br/><p>Lin Fan's finger shivered, as a tremendous amount of energy coursed through his body. In terms of physical body state, Lin Fan was still slightly inferior compared to the Ancient One.</p><br/><p>This arm was definitely not as simple as just 100 energy grid line chains. Even with just around half of his body fused together, the amount of power exerted out by the Ancient One was far from Lin Fan's imaginations.</p><br/><p>If he allowed the Ancient One to fully fuse back with his Eternal Arm and Eternal Donger, that would have some unimaginable consequences.</p><br/><p>\"Hmph, to think that you're this strong, human. But, so what? Killing you would still be as simple as crushing a single ant.\" The Ancient One glared at Lin Fan. He had not expected this human to stand at par with him.</p><br/><p>His body had been split apart thousands of years ago, and his strength right now was probably a mere 1% of his original strength. However, even then, it shouldn't be something a human could stand to oppose.</p><br/><p>In fact, what Lin Fan did not know at this point was the fact that the energy grid line chains were the lowest form of power possible right now for the Ancient One.</p><br/><p>However, ever since his body was split apart, each of his body parts could only cultivate on their own. Through the absorption of the power between the Heavens and Earth, energy grid line chains were the only things they could form.</p><br/><p>However, if the Ancient One were to ever fuse together completely once more…that was the moment when one would understand the true meaning of fear.</p><br/><p>...</p><br/><p>On the other side…</p><br/><p>\"FLAME OVERLORD, HOW DARE YOU BETRAY OUR LORD?\" Before being slapped to death by the Flame Overlord, a humanoid beast howled out in rage.</p><br/><p>\"Hmph.\" The Flame Overlord snorted coldly without replying much. That colossal body of his stood towering at the entrance, not allowing entry to any beasts.</p><br/><p>Looking at that massive wave of beasts that was gushing down like a flood, Chicky's tiny heart could not help but pound rapidly. Turning around, Chicky saw the ripples in the sky due to the fight on the other end. Crying out loudly, flames burst out from Chicky's body as he transformed into a fiery red Phoenix.</p><br/><p>Flapping his wings, Flames of the Nine Heavens burnt down below, covering the beasts in a blanket of fire.</p><br/><p>'CUCKCUCKOOOOOOO…!'</p><br/><p>Spreading his wings out to fly, a bright burst of red light filled the skies as he flew up. Those beasts who were covered in these flames could only remain caged until they were scorched into ashes.</p><br/><p>\"This pet of Little Fan is truly strong indeed.\" Looking at Chicky's majestic display, Grandmaster Yan could not help but sigh with reassurance.</p><br/><p>Looking at how they weren't even comparable to a little bird, Zong Hentian and the others took in a deep breath before dashing out towards the beasts.</p><br/><p>He Yuhan looked at the battle before her, her heart fraught with worries. Eventually, she could only shake her head helplessly, 'Seems like we can only do our best.'</p><br/><p>...</p><br/><p>Lin Fan was already fully held back by the Ancient One.</p><br/><p>'True Origins Crushing Kick!'</p><br/><p>Bam!</p><br/><p>In that instant, Lin Fan caught sight of an opportunity and sent that kick flying towards the groin of the Ancient One. However, Lin Fan's face changed immediately.</p><br/><p>He just recalled something. That portion of the Ancient One was still within his storage!</p><br/><p>\"INSOLENT…!\" The Ancient One howled. Coiling up a surge of devastating energy, he burst it out towards Lin Fan.</p><br/><p>BOOM!</p><br/><p>Like a bullet, Lin Fan was sent flying into the ground below. Unable to withstand the impact, the ground nearby began to crack and crumble.</p><br/><p>'Ding…Eternal Immortality experience points +500,000,000'</p><br/><p>...</p><br/><p>Lin Fan spat out a mouthful of fresh blood. He wiped the sides of his mouth, not bothered in the least bit as he darted up into the skies and engaged the Ancient One in battle once more.</p><br/><p>\"Human, bow before me and I shall spare you!\" The Ancient One hollered.</p><br/><p>\"Spare your mother!\" Lin Fan had completely given up on defense. He was just striking out with every single last bit of offensive moves he had.</p><br/><p>\"Hmph, foolish.\" The Ancient One snorted coldly as his eyes flashed. In that instant, he gripped at Lin Fan's arm.</p><br/><p>\"This arm... it belonged to me, and IT SHALL BELONG TO ME FOREVER!\" The Ancient One howled.</p><br/><p>\"THEN THIS ARM OF YOURS SHALL BE MINE!\" With a maddened rage, Lin Fan gripped at the other arm of the Ancient One as well.</p><br/><p>Both of them tugged hard. In that instant, meat and blood sprayed through the skies.</p><br/><p>The Ancient One was gripping relentlessly on Lin Fan's right arm while Lin Fan was doing so to his left arm. And just like that, both of these formidable figures floated in the air, glaring at one another.</p><br/><p>\"HAHA…!\" Suddenly, the Ancient One laughed maniacally. \"Human, do you think that's all you need? My body belongs to me, now and forever! You shall never be able to have it!\"</p><br/><p>The Ancient One opened his mouth and devoured Lin Fan's right arm whole into his tummy.</p><br/><p>Suddenly, the black robes he was wearing floated into the sky as Lin Fan finally caught sight of the true body of the Ancient One.</p><br/><p>Glancing over, his face was stern. Indeed, it was as he had guessed.</p><br/><p>The Ancient One was short of his right arm and that thing at his groin.</p><br/><p>But at that instant, after the Ancient One had devoured Lin Fan's right arm, that missing right arm began regenerating.</p><br/><p>'POWER REGRESSION…!'</p><br/><p>In that instant, the sky changed colors. The entire body of the Ancient One was enveloped in a vortex. This typhoon was stronger than ever as it shot through the skies.</p><br/><p>The left arm that Lin Fan had ripped out gave a massive jerk and broke free of Lin Fan's grip. It flew towards the Ancient One and fused back together with him, perfect as before.</p><br/><p>Seeing this scene, Lin Fan could not help but grit his teeth. He had a really bad feeling about this. He definitely could not allow the Ancient One to continue as such.</p><br/><p>Slapping out his storage, the Blood Gates appeared in the skies.</p><br/><p>'Tribute! 300 energy grid line chains!'</p><br/><p>'Tribute! Eternal Donger!'</p><br/><p>'Blood World, descend down and suppress my enemies!'</p><br/><p>...</p><br/><p>Upon catching sight of that familiar portion of his body, the Ancient One, who was gradually recovering his strength, howled out.</p><br/><p>\"YOU B*STARD! RETURN ME MY BODY!\" The Ancient One stretched out his arm, trying to snatch back his Eternal Donger.</p><br/><p>But just then, a mysterious force of the unknowns appeared, repelling the Ancient One's arm away. It then confiscated all the items that Lin Fan had used for tribute.</p><br/><p>\"ARGH…!\" The Ancient One howled with a pained look.</p><br/><p>BOOM!</p><br/><p>The skies rumbled as they were stained with the color of blood.</p><br/><p>The Blood Gates burst open, as the Overlord of the Blood World came out from within slowly.</p><br/><p>\"HUMAN, YOU OUGHT TO DIE!\" The Ancient One was thoroughly incensed. The mysterious powers of the unknown were not something that he could deal with. Thus, he could only vent all his frustrations out at Lin Fan.</p><br/><p>\"JUST THE BLOOD WORLD AND YOU DARE TO BE IMPERTINENT BEFORE ME? GO TO HELL!\" With an enraged cry, the Ancient One sent out a punch.</p><br/><p>Those wide opened doors of the Blood Gates shuddered momentarily before crumbling into dust instantly, and disappearing entirely from the world.</p><br/><p>\"How can this be…?!\" Even Lin Fan was stunned by the power of that strike. To think that the Ancient One would be this strong even after it just retrieved a single arm!</p><br/><p>\"I'll definitely not let you fuse!\"</p><br/><p>Just then, the void rippled, and a bright light flashed out.</p><br/><p>\"ARGH…!\" The Ancient One let out a howl of anguish once more as that regenerated right arm was severed yet again.</p><br/><p>\"Lin Fan, we must definitely not let him fuse!\" A figure had suddenly appeared behind the Ancient One.</p><br/><p>That right arm, which was floating in the sky, flew towards Lin Fan.</p><br/><p>\"MY ARM…!!!\" Upon seeing this, the Ancient One howled in wrath.</p><br/><p>...</p><br/>\n</div>"}