{"title": "Chapter 443: A New Hope Or Despair", "id": 443, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-443-a-new-hope-or-despair", "volume_title": "Volume 5", "body": "<h1>Chapter 443: A New Hope Or Despair</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 443: A New Hope Or Despair</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>At that moment, a situation was unfolding over at the side of the Ancient One.</p><br/><p>\"JUST WHAT IN THE WORLD IS HAPPENING? WHY HAS THE ANCIENT ONE TURNED THIS WAY?!\" The Heavenly Emperor Yuan was yelling madly, trying his best to dodge fully. The current Ancient One was leaving the Heavenly Emperor Yuan in fear.</p><br/><p>This was a complete beast here!</p><br/><p>Why had the mighty Ancient One, who had conquered over the ancient times, become as such?!</p><br/><p>BAM…!</p><br/><p>With a maddened howl, the Ancient One slapped his palms together, trapping the Heavenly Emperor Yuan within.</p><br/><p>\"HAHA…! I'VE GOT YOU NOW… HEHEHE…!\" Those burning red eyes of the Ancient One were sparkling brightly.</p><br/><p>Like an agile snake, his tongue, which was filled with lust, made its way towards the cheek of the Heavenly Emperor Yuan. Ever so lightly, he gave it a gentle lick. But, this single lick was like a downpour of rain for the Heavenly Emperor Yuan.</p><br/><p>The Heavenly Emperor Yuan was completely petrified right now. Since when had the Ancient One turned this sick?! He was practically a savage right now!</p><br/><p>Within those burning eyes of the Ancient One, Heavenly Emperor Yuan could make out the boundless desire.</p><br/><p>This was not good…! The Ancient One was definitely having stray thoughts right now!</p><br/><p>Suddenly, a big lumpy object appeared before the eyes of the Heavenly Emperor Yuan.</p><br/><p>\"Mmm…!\" The Ancient One had placed the head of the Heavenly Emperor Yuan in between those swollen lumps that were created by Lin Fan and, having him motorboating between them.</p><br/><p>\"HOLY F*CK…!\" In the past 10,000 years, the Heavenly Emperor Yuan had yet to spout out any vulgarities. However, he was completely blown out of his mind by the situation right now.</p><br/><p>VING!</p><br/><p>The void vibrated as the Heavenly Emperor Yuan managed to slip out through a crack in the void. He glared at the Ancient One warily.</p><br/><p>Even though the cultivation state of the Ancient One was far from its peak, his physical body state was still way too strong! So strong that it could disregard practically any attack!</p><br/><p>\"DON'T RUN! I WANT TO POKE YOU…!\"</p><br/><p>The Ancient One screamed as his tongue flickered in the air. He then leaped out towards the Heavenly Emperor Yuan once more.</p><br/><p>...</p><br/><p>The Supreme Being and the others were completely confounded by now. They could not bear to believe everything that was happening before their very eyes. This was way too piercing for their minds!</p><br/><p>What happened to the Ancient One?!</p><br/><p>That tongue of his, which was spraying saliva left and right, seemed to be filled with limitless seduction. To think that it would lick at the Heavenly Emperor Yuan despicably!</p><br/><p>And what was worse was the fact that towering pillar at his crotch was totally erected. It was as though it was ready to wreak havoc on the bottom of Heavenly Emperor Yuan, poking the entire world out of his body.</p><br/><p>...</p><br/><p>Lin Fan was watching this spectacular and entertaining show with extreme interest. The Ancient One was the Ancient One indeed! To think that every strike of his would be like a tiger pouncing out with complete accuracy.</p><br/><p>If not for the fact that the Heavenly Emperor Yuan was so good at running, he would have long been 'pokey pokey-ed' by the Ancient One.</p><br/><p>\"ASK HIM TO STOP! MAKE HIM STOP…!\" The Heavenly Emperor Yuan could take it no longer. The Ancient One was like a frenzied demon chasing him relentlessly from the back.</p><br/><p>In fact, the most terrifying thing for the Heavenly Emperor Yuan right now was the object at the groin of the Ancient One. Like a wild animal, it had enlarged massively, and was striking out at him!</p><br/><p>There were already a few close shaves where he was nearly poked by that gigantic object!</p><br/><p>\"ANCIENT ONE, DON'T YOU GO OVERBOARD!\" The Heavenly Emperor Yuan was howling madly right now.</p><br/><p>\"I WANT TO POKE YOU!\"</p><br/><p>\"HOW CAN YOU DO THAT?!\"</p><br/><p>\"I WANT TO POKE YOU! POKEY POKEY POKEY POKEY!\"</p><br/><p>...</p><br/><p>\"HURRY UP AND MAKE HIM STOP! I DON'T WANT TO FIGHT ANYMORE!\" The Heavenly Emperor Yuan was sweating bucket loads right now. Even though he had fused with the Heaven's Will, the Ancient One's attack style seemed to have gone so crazed that it was unfathomable!</p><br/><p>\"Do you believe that I'm a genius prodigy that even a billion years may not produce now?\" Lin Fan asked up into the air at the Heavenly Emperor Yuan.</p><br/><p>\"Yes, I do! Yes…! Please hurry and make him stop!\" The Heavenly Emperor Yuan's eyes shone with fear. Even though the Ancient One's strength was definitely incomparable to his past self, the Heavenly Emperor Yuan was only barely able to dodge everything, even with the strength of the Heaven's Will put into use.</p><br/><p>\"Hehe…!\" Lin Fan chuckled. He then shouted over to the Ancient One, \"Ancient One, that's enough! Go and poke the ground yourself!\"</p><br/><p>The Ancient One, who was hot in the chase behind the Heavenly Emperor Yuan, was stunned for a moment. With a look of disappointment on his face, he went down to the ground alone and started humping up and down.</p><br/><p>POKE! POKE! POKE! POKE! POKE! POKE! POKE!</p><br/><p>This sound was like a woodpecker, loud and repetitive. The entire world shook under its tremendous force.</p><br/><p>\"This…!\" Looking at the Ancient One, even the Heavenly Emperor Yuan's eyes were fraught with disbelief.</p><br/><p>This was one of the eight utmost beings of the Upper World. To think that it would be committing such a despicable act right now!</p><br/><p>Let alone the Heavenly Emperor Yuan, even the supreme beings watching this scene were glad that their consciousness was not a physical entity. Otherwise, they would definitely spit out blood and die right now.</p><br/><p>Lin Fan looked at everyone and started chuckling, \"Alright, now that everything's over, we can sit down for a good discussion. After all, this concerns the fate of Xuanhuang World. This isn't something that can be easily gone through with just a couple of words.\"</p><br/><p>\"Heavenly Emperor Yuan, are you still insistent on your ideals?\" Lin Fan asked him.</p><br/><p>\"That's right.\" Finally able to calm his heart, the Heavenly Emperor Yuan replied.</p><br/><p>\"Supreme Being, God of War, Reincarnation Emperor, God of Battle… Are you guys still insistent on your beliefs as well?\" Lin Fan asked them.</p><br/><p>\"That's right. We'll definitely not allow people from Xuanhuang World to send themselves to their deaths for nothing.\"</p><br/><p>Lin Fan looked at the four of them, then at the Heavenly Emperor Yuan. He did not have too much of a reaction. After all, the final decision right now was on the Heavenly Emperor Yuan.</p><br/><p>With the Xuanhuang World being split into two, the Heavenly Emperor Yuan had only devoured 3/4th of the Heaven's Will of Xuanhuang World. However, Lin Fan believed that if the Heavenly Emperor Yuan dared to appear before them as such, this meant that he must have the confidence of tearing down the Heavenly Barrier for sure.</p><br/><p>Thinking back on the deal he made with Ye Han, it was evident that he wanted to use the Blood World as a stepping stone to directly break through this layer of the barrier.</p><br/><p>But, the fact that the Heavenly Emperor Yuan had not done so immediately and was willing to sit down for a proper discussion was evident of his intents to resolve this issue as well.</p><br/><p>\"If I had to stand on the side of the greater picture, I would agree with the four of them. However, if it were based on my personal selfish ideals, I would agree more with the thoughts of the Heavenly Emperor Yuan.\"</p><br/><p>\"If one did not fight, then what difference did one have from a dead fish? No matter how tough the road ahead may be, we must never shirk from the fear of danger, and be a cowardly tortoise. We must always be ready to head forth and duel the fate.\" This was the first time ever that Lin Fan had made such a fair speech.</p><br/><p>Even though on the surface, Heavenly Emperor Yuan looked like the bad guy, Lin Fan knew that all this bad guy wanted was to release everyone from the shackles they were trapped with.</p><br/><p>\"You are different from them. At the same time, I understand your concerns. That's the reason why I did not tear down the Heavenly Barrier straightaway and chose to place my faith in you.\" The Heavenly Emperor Yuan looked at Lin Fan. He then turned his gazes towards the four supreme beings.</p><br/><p>\"All of you no longer have the same hearts you had in the past. Back then, I was the weakest amongst all of you. However, even if all of you were to regain your full strength right now, you wouldn't be my match at all. After all, power stems from the heart. Your feeble and cowardly hearts have caused all of you to be weak.\"</p><br/><p>...</p><br/><p>\"You…!\" The four of them glared at the Heavenly Emperor Yuan, speechless. Eventually, they gave a cold snort and refused to continue talking.</p><br/><p>\"Kid, the fairest thing we could do now is to actually tear down the Heavenly Barrier. That's the only way to allow the entire Xuanhuang World to break free. Everyone should be able to train up and fight together against the Upper World. We shall break free from that fate of being trampled upon.\" The Heavenly Emperor Yuan continued.</p><br/><p>Lin Fan shook his head, his expression grim. \"No. Just like the Supreme Being and the others, I have my own selfish intentions.\"</p><br/><p>\"I have precious people that I care about deeply, and do not wish to lose. Even though I may release them of this shackled fate, that is nothing compared to their lives. I would rather see them keep their lives than to have them chase after that fate where the probability of death is nine out of ten.\"</p><br/><p>\"Even though that's selfish, isn't that the basic trait of all humans?\"</p><br/><p>\"I can choose to suppress and take you down while you're tearing down the Heavenly Barrier, but I will not do that. That's because I know of the difficulties that lie ahead. In order to protect all of them, I've got to be stronger. I've got to get so strong that I can fend against all odds.\"</p><br/><p>The Heavenly Emperor Yuan looked at Lin Fan before he burst out laughing, \"HAHA…! Humans are indeed the most complex of all living beings. We were every bit like you back then, wanting to be strong in order to protect more people from suffering. However, we failed, and resorted to running away with our tails between our legs. But finally, I understand right now. One must depend on oneself. Back then, I had chosen to devour the Heaven's Will, but right now, I'm choosing to place my faith in you. I've already waited for tens of thousands of years. I don't mind waiting for one last hope.\"</p><br/><p>\"Thank you for your faith. Yours Truly has never let anyone down till now.\" Lin Fan beamed confidently. Even though his heart was in turmoil, he had to be resolute and firm.</p><br/><p>\"HAHA…!\" The Heavenly Emperor Yuan reared his head into the skies and laughed out, tears streaming from both his eyes.</p><br/><p>It was as though he was finally letting go of every single bit of resentment and emotions he had kept in all these years.</p><br/><p>Was this a new hope or a new despair…?</p><br/>\n</div>"}