{"title": "Chapter 448: Cleaving Down Everything", "id": 448, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-448-cleaving-down-everything", "volume_title": "Volume 5", "body": "<h1>Chapter 448: Cleaving Down Everything</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 448: Cleaving Down Everything</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'Name: Lin Fan.'</p><br/><p>'Cultivation State: Utmost Celestial Full Cultivation State.'</p><br/><p>'Experience Points: (0/10,000).'</p><br/><p>'Physical Body State: Imperishable Full Cultivation State. (Fused with Energy Grid Line Chains).'</p><br/><p>'Physical Body Experience Points: (7,000/10,000).'</p><br/><p>'Potential: Unlimited.'</p><br/><p>'Bloodline: Upper Firmament Bloodline (Unactivated).'</p><br/><p>...</p><br/><p>Looking at the panel of his personal information on the system, Lin Fan's lips curled into a bitter smile.</p><br/><p>Even though his physical body state had improved from Imperishable Lower Level to Imperishable Full Cultivation state, it was only a farce. While it might look stronger on the surface, he had actually gone down in terms of toughness.</p><br/><p>'Bloody hell! System! Were you suppressed by the rules of this world that made you so submissive as well? What sort of 'strongest module' is this? This is a complete acknowledgment of defeat!' Lin Fan was almost on the brink of tears right now. To think that he had believed in the words of this system! He was so thoroughly f*cked up to his granny's house right now!</p><br/><p>'Ding…Congratulations on fusing 1 energy grid line chain of Xuanhuang World into your physical body.'</p><br/><p>'Ding…Physical body experience points +100.'</p><br/><p>'Holy sh*t…!'</p><br/><p>Lin Fan's face changed as the energy grid line chain he had gathered fused within his body. Didn't this mean that he could level up automatically without being walloped?!</p><br/><p>Lin Fan immediately pulled back the screen of his profile and took a closer look. The speed in which he gathered energy grid line chains was still as fast as ever!</p><br/><p>He was only 3000 experience points away from leveling his physical body state once more. Given this current rate, that means that he would only require around 30 energy grid line chains!</p><br/><p>He would be able to level by a month's time!</p><br/><p>'Not bad, not bad…!' Upon hearing that notification, Lin Fan's lips grinned once more.</p><br/><p>This was practically double insurance! To think that he could level up even without being whacked! This meant that given enough time, even his physical body state would grow to be unlimitedly strong! In fact, invincibility might not be out of the question as well!</p><br/><p>\"HAHA…!\" With that, Lin Fan burst out laughing.</p><br/><p>However, when he looked at how the billions of experience points required initially had now shrunk down to mere tens of thousands, he was a little not used to it. But, this was for the best as well. After all, this made things simpler to look at. The 'lower' amount of experience points required should serve as motivation as well.</p><br/><p>At this moment, it was as though Lin Fan had regained his vitality. Those rules of the Ancient Saint World which were restricting him previously seemed to have disappeared as well.</p><br/><p>Once again, he could feel the massive surge of his own powers returning to him.</p><br/><p>Looking at his surroundings, Lin Fan beamed brightly once more, 'Seems like it's time to take a tour outside and chop down everything in this world!'</p><br/><p>Upon knowing that he would have to ascend up here, Lin Fan had left Chicky behind in Xuanhuang World, because he did not know how things would be like up here.</p><br/><p>If he were to meet with a strong opponent and fall here, that would be an absolute tragedy.</p><br/><p>From the booklet, Lin Fan also found out about the cultivation states of this world and their increasing levels.</p><br/><p>Utmost Celestial.</p><br/><p>Earth Celestial.</p><br/><p>Azure Celestial.</p><br/><p>Desolate Celestial.</p><br/><p>Divine Celestial.</p><br/><p>But even then, Lin Fan knew that Divine Celestial wasn't the end point of it all. That was because the Supreme Being and the others were Divine Celestials as well, yet they were whooped like dogs by the Ancient One.</p><br/><p>Therefore, Lin Fan had to set his expectations straight, and keep a low profile.</p><br/><p>Lin Fan had no idea exactly how long he had spent within the cave. But right now, he was prepared to head out there and give it a good massacre. He had to grow stronger!</p><br/><p>The moment Lin Fan stepped out of the cave and faced the bright, clear skies was a moment of strong battle intent.</p><br/><p>'GRAWL…!'</p><br/><p>As Lin Fan stepped out of the cave and re-entered the forest, the sounds of the surrounding beasts increased in frequency.</p><br/><p>And just as he was warily surveying his surroundings, a massive object leaped down from the skies. This dark figure was so huge that it covered everything above Lin Fan's head.</p><br/><p>Lin Fan's face changed slightly as he shifted his body quickly, side stepping to avoid being crushed by the massive creature.</p><br/><p>Looking at the being before him, Lin Fan could not help but take in a breath of cold air.</p><br/><p>What a mighty giant ape!</p><br/><p>'GRAWH…!!!'</p><br/><p>That single-eyed giant ape howled into the skies. Using both arms, he repeatedly thumped on his chest, giving off dull thudding sounds.</p><br/><p>That sole red colored swollen eye was filled with malice, as he glared straight at Lin Fan and roared.</p><br/><p>'Ancient Beast: Cyclops Giant Ape. Utmost celestial full cultivation.'</p><br/><p>Lin Fan's eyes squinted. All it took was a single look for all of this data to appear! This caused Lin Fan to be a little surprised.</p><br/><p>Could this be the improved framework as a result of the system going berserk? Without even using his intent, he could observe and gauge everything automatically!</p><br/><p>With that, Lin Fan took out the legendary weapon, Eternal Axe.</p><br/><p>\"Big chimp! Come at me!\" Lin Fan taunted the giant ape and beckoned with his palm.</p><br/><p>'GRAWH…!' The cyclops giant ape howled madly as he punched his chest repeatedly with the gigantic arms of his. It was as though he was infuriated by this puny little ant jeering towards him.</p><br/><p>Just then, the cyclops giant ape lunged at Lin Fan with a fist of tremendous force. It was as though he was bent on killing Lin Fan.</p><br/><p>\"Heh, seems like you shall be the first beast Yours Truly kills after coming to this world.\" Wielding the Eternal Axe, Lin Fan slammed down at the fist of the cyclops giant ape.</p><br/><p>'Plop…!'</p><br/><p>In that instant, the air was filled with a mess of meat and blood. That massive fist that the cyclops giant ape sent out was split into two by Lin Fan.</p><br/><p>That mighty body retreated backward instantly. Within those malicious eyes shone a shimmer of fear. He then turned around and tried to run instantly.</p><br/><p>\"Heh, you think you can run after taunting Yours Truly? What a dream!\" Lin Fan looked at the cyclops giant ape, took aim, and tossed out the Eternal Axe.</p><br/><p>The Eternal Axe spun in the air as it sliced upwards from below, ripping the cyclops giant ape apart from his anus.</p><br/><p>'URGH…!'</p><br/><p>Fresh, steaming blood sprayed into the skies and stained the ground all around it.</p><br/><p>'Ding…congratulations on killing cyclops giant ape.'</p><br/><p>'Ding…experience points +100.'</p><br/><p>...</p><br/><p>Lin Fan came before the body of the giant ape. Looking at the mess of blood on the ground right now, he grinned, \"Little one, you think you can be insolent?\"</p><br/><p>Just as Lin Fan was about to leave, a notification startled Lin Fan.</p><br/><p>'Ding…Discovered demonic aura of cyclops giant ape. Absorb it within Demon City?'</p><br/><p>This was a new phenomenon! Could this be a new effect after the system's berserk as well?!</p><br/><p>'Absorb.'</p><br/><p>Lin Fan did not know what it meant, but he just wanted to see what would come out of it.</p><br/><p>In that instant, Lin Fan witnessed a green puff of demonic aura emanating out from the corpse of the cyclops giant ape. It was then absorbed by the system into his Demon City within his storage.</p><br/><p>'Eh…?'</p><br/><p>Lin Fan suddenly realized that something was happening to that semi-finished, pseudo-legendary weapon, Demon City!</p><br/><p>To think that this demonic aura could repair the Demon City! Could it be that these were just the things to allow the Demon City to evolve into a proper legendary weapon?</p><br/><p>At the thought of this, Lin Fan was overwhelmed with joy!</p><br/><p>\"Cyclops giant ape, don't blame Yours Truly! Yours Truly is a man who's starting from scratch right now! I had intended to leave your corpse there entirely. But seems like I can't do that any longer!\" Lin Fan looked at both halves of the body that he had just cleaved. Waving his hand, he then tossed it into the Heaven and Earth Smelt and began smelting.</p><br/><p>'Ding…congratulations on smelting.'</p><br/><p>'Ding…congratulations on obtaining cyclops giant ape's essence blood. 10 drops.'</p><br/><p>'Not bad! Seems like this place is quite the treasure trove! Apparently, there's no hurry to leave. I should totally look for more ancient beasts.' Lin Fan rubbed his chin and decided on his next course of action.</p><br/>\n</div>"}