{"title": "Chapter 441: All Of You Have Got A Point", "id": 441, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-441-all-of-you-have-got-a-point", "volume_title": "Volume 5", "body": "<h1>Chapter 441: All Of You Have Got A Point</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 441: All Of You Have Got A Point</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Within that group of people…</p><br/><p>Suddenly, a burst of an abstruse aura burst out from Mie Qiongqi and Meng Hao. This aura was full of vicissitude and was long drawn.</p><br/><p>BOOM!</p><br/><p>Thousands of miles away, the tribute statue of the Founder Ancestor of Glory Sect began shaking tremendously. A beam of light shot out from the Tribute Sculpture, all the way into the Heavens, tearing through every single layer of void it passed through. In the blink of an eye, it appeared right in the face of everyone right here.</p><br/><p>Looking at the scene before him, even Lin Fan was astounded.</p><br/><p>The God of Battle, Meng Hao.</p><br/><p>The Reincarnation Emperor, Mie Qiongqi.</p><br/><p>And to think that the Founder Ancestor of Glory Sect would be the God of War!</p><br/><p>As for the Supreme Being…</p><br/><p>'Ving…'</p><br/><p>Lin Fan realized at this moment that the Supreme Being Token was vibrating violently within his storage, desperately trying but unable to get out.</p><br/><p>Lin Fan chuckled before taking out the token.</p><br/><p>As a bright light flashed, the Supreme Being Token floated before everyone, as an illusory figure appeared gradually.</p><br/><p>Lin Fan looked at the two illusory figures behind Mie Qiongqi and Meng Hao, shuddering within his heart at the same time. Just that aura alone was enough to raise everyone's goosebumps.</p><br/><p>At that moment, everyone awaited with bated breath. They were completely dumbfounded by the scene before them.</p><br/><p>This feeling of shock was especially profound for Grandmaster Yan and Senior Elder Wuya. The moment they caught sight of the illusory figure of their Founder Ancestor, they had an urge to prostrate and kneel down in respect.</p><br/><p>To think that their Founder Ancestor was lying within the tribute sculpture all this while!</p><br/><p>And at this moment, Grandmaster Yan finally understood the reason why the tribute sculpture could continue to impart down skills and items. This was the very reason behind it.</p><br/><p>...</p><br/><p>\"HAHAHA…! Look at the four of you living such miserable lives! Even the great Reincarnation Emperor, who was rumored to have an indestructible consciousness, couldn't escape the eventual outcome of falling.\" Within the void, the Heavenly Emperor Yuan, who had devoured the Heaven's Will, burst out into a wild laughter. He looked at the four of them in absolute mockery.</p><br/><p>For a moment, there was a reminiscing look in his eyes. But that was replaced by those jeering eyes almost immediately.</p><br/><p>\"Heavenly Emperor, what's your purpose with all this?\" Even though the Supreme Being was only a single strain of consciousness right now, he looked up into the sky at the Heavenly Emperor Yuan with dominance.</p><br/><p>\"Purpose? Hope, of course! Look at all of you guys, submitting to a fate of living as cowards and wimps… Willing to live life eternally just like a bunch of spineless worms trapped in this world, only able to survive ignobly in secret!\" The Heavenly Emperor Yuan was extremely emotional right now.</p><br/><p>\"Heavenly Emperor, it's enough…can't you see the facts before your very eyes? Those are not existences that we can hope to fight against. We've fought through so many trials and tribulations just to make it back here from the Upper World and lay down all these restrictions and confinements. What was all of that for? THAT was to retain this last bit of hope we have!\" The illusory figure of the God of War spoke out.</p><br/><p>\"SHUT UP! You have battled through eternity, never looking back even once. You were never someone who would bow down to adversities! But, look at you now! You're not worthy to even carry the title of God of War any longer! You're weak now... WEAK! You're no longer the God of War I used to know! Today, my aim shall be to break through all of these confinements right here and now! I shall take the human race with me to re-enter the Upper World once more, so as to build a brand-new future!\" The Heavenly Emperor glared at the four of them.</p><br/><p>...</p><br/><p>Lin Fan was totally stunned right now. He totally couldn't catch any balls in this conversation these guys were having.</p><br/><p>\"ALL OF YOU GUYS SHUT UP!\" Lin Fan just had to interrupt in. He was getting a big headache just hearing out these guys.</p><br/><p>That holler surprised all five people who were arguing, as they stopped their conversation and cast all of their glances at Lin Fan.</p><br/><p>\"Junior, this is not an affair in which you can interfere.\" The Reincarnation Emperor looked at Lin Fan, his voice mighty and authoritative.</p><br/><p>Having experienced the path of life, death, and reincarnation time and again, it was as though this man had already attained the peak of the Dao, and could understand every single logic within the Heaven and Earth.</p><br/><p>\"Forget it man. The four of you are just a strain of consciousness each, aren't you? What do you guys want? This guy here has devoured the Heaven's Will… DEVOURED. He's a whole, full being right now. If he wants to kill you guys, you would be right in the palms of his hands!\" The thing that Lin Fan hated the most was other people acting out bullsh*t right in front of him.</p><br/><p>And to him, each and every one of these people right here was going overboard with their bullsh*t.</p><br/><p>A God of War.</p><br/><p>A God of Battle.</p><br/><p>A Reincarnation Emperor.</p><br/><p>A Supreme Being.</p><br/><p>And one more Heavenly Emperor Yuan.</p><br/><p>What the f*ck? Each of their titles was even more imposing than the other.</p><br/><p>Thinking of how he didn't even have a title for himself, Lin Fan was feeling a little sad. Seemed like if he had the chance, he definitely had to give himself a really cool title as well.</p><br/><p>\"HAHA…!\" The Heavenly Emperor Yuan laughed maniacally in the sky, \"Look at the four of you! You can't even see the facts as clearly as a single young man here! He's right. All of you guys are just a single strain of consciousness each! None of you guys can stop me if Your Majesty wants to break through this world right here and now!\"</p><br/><p>\"Young man, fight with me against the Upper World! The human race needs hope, and these guys here no longer have any bit of courage left. They're wimps! They can no longer remain as the hope of the human race, nor are they the glorious saints that should watch over the human race any longer. These guys are pathetic worms who're just struggling to protect their pitiful lives, sh*tty cowards who're struggling in this world…\" The Heavenly Emperor Yuan glared at Lin Fan fervently, his heart burning with anticipation.</p><br/><p>\"Alright…\" Lin Fan replied calmly to the Heavenly Emperor Yuan.</p><br/><p>\"HAHAHAHA…! FINALLY! SOMEONE GETS ME! THERE'S FINALLY SOMEONE WHO UNDERSTANDS MY THOUGHTS! The four of you aren't even comparable to a single young man right here! You guys have truly lived your hundreds of thousands of years of life for nothing! You fools…!\" The Heavenly Emperor Yuan reared his head back and laughed.</p><br/><p>The four supreme beings glared at Lin Fan and shook their heads helplessly, \"Do you know of the consequences of breaking through the barrier of this world? That means that if anyone were to break through beyond the greater celestial full cultivation state in the future, they would be able to enter the Upper World. That Upper World is the land which nightmares are made of! Humans are nothing but mere ants there! That place shall be the place where all humans are annihilated!\"</p><br/><p>\"SHUT UP, YOU FOUR COWARDS! How could the fate of Xuanhuang World be controlled by sh*ts like you guys? Do you know why all the other races of the other worlds are able to head up to the Upper World repeatedly without being sealed off? That's because they understand the true meaning of rebellion! They know that they've got to fight back! But, all you guys know is to avoid and hide! Look at all these other people here! They've all been shrouded in ignorance, unable to choose their own fates for all of their lives! The very reason for that is the selfishness of the four of you! How dare you impose your own ideals forcefully on all of these people?\" The Heavenly Emperor Yuan yelled.</p><br/><p>The four supreme beings gripped their fists tightly, \"Heavenly Emperor, what you're trying to do is to push Xuanhuang World into a treacherous abyss! Don't you know that that will only serve to hasten the annihilation of Xuanhuang World?'</p><br/><p>\"Out of the multitudes of worlds out there, do you know how many worlds have been destroyed?! The Jingang World! Dragon World! Dancheng World…! DON'T TELL ME THAT YOU DON'T KNOW ABOUT THE DESTRUCTION OF ALL THESE OTHER WORLDS AS WELL!?\" By now, the Supreme Being was howling at the Heavenly Emperor Yuan in rage.</p><br/><p>\"Cowards are cowards. All of them have died with no regrets. That's because they've died trying. THEY'VE DIED FIGHTING, while the four of you are playing with this world in your palms just because of your own selfish intents. At the end of the day, people here wouldn't even know why and how they were destroyed! They would die in the dark without any single bit of struggle or resistance…!\" The Heavenly Emperor Yuan replied.</p><br/><p>...</p><br/><p>Lin Fan did not want to reply too much. No matter who was right or wrong, none of it mattered to him. No one could judge either of the two parties in a situation as such.</p><br/><p>If Lin Fan truly had to choose, he felt that both sides had their own rights and reasons.</p><br/><p>Fate was meant to be seized by one's very own hands and not escaped from. If one were to be escaping fate continuously just to buy themselves a little more time, they might as well fight to their deaths and duel the fates.</p><br/><p>However, the supreme beings had their case as well. If one knew that it was a dead end no matter what, why bother resisting? They should just let it end as such as well.</p><br/><p>If he had to endure watching everyone close to him die tragically, Lin Fan could definitely not accept that fate either.</p><br/><p>\"That's enough, Heavenly Emperor Yuan. Return the Heaven's Will to me.\" At this moment, He Yuhan, who had remained silent all this while, had finally spoken up.</p><br/><p>She was manifested from a single strain of the Heaven's Will's consciousness. There was no one else in this world who knew about Xuanhuang World better than her. In order to seize back the Heaven's Will, she had purposefully chosen a man to be blessed by the Heavens. The reason for grooming him was all so that she could make use of his strength.</p><br/><p>The Heavenly Emperor Yuan looked at He Yuhan, \"Heaven's Will, how have you fallen like this? For your own sake, you would rather choose cowardice along with these four people?'</p><br/><p>\"Polluting the Heaven's Will is a crime punishable by death. Just that action alone would render every single last bit of your intents wrong.\" He Yuhan stepped forth, one step at a time.</p><br/><p>She turned around and looked at Xia Youtian. That petite face of hers could not help but reveal an apologetic look.</p><br/><p>\"Brother Xia, I'm sorry. I hope you do not blame me for this.\" Suddenly, He Yuhan's body rose into the air and turned into a bright glow of light.</p><br/><p>\"Sister Yuhan! What are you talking about…!\" Xia Youtian could feel his heart wrenching right now. It was as though he could sense that his Sister Yuhan was about to leave him.</p><br/><p>As though he was interlinked with He Yuhan, the energy from Xia Youtian began to leak outwards as well…</p><br/><p>...</p><br/>\n</div>"}