{"title": "Chapter 458: Seems Like The Human Race Is Pretty Famous After All", "id": 458, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-458-seems-like-the-human-race-is-pretty-famous-after-all", "volume_title": "Volume 5", "body": "<h1>Chapter 458: Seems Like The Human Race Is Pretty Famous After All</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 458: Seems Like The Human Race Is Pretty Famous After All</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Looking at the little kid prancing away from the forest, Lin Fan could not help but grin. By the looks of it, this kid seemed pretty familiar with this place. He wondered where the kid would lead up to.</p><br/><p>Before long, Lin Fan stopped in his tracks upon catching sight of the scenery before him. To think that a village would exist within these mountainous regions as well.</p><br/><p>At the same time, there seemed to be some mysterious, invisible membrane surrounding the village, preventing any aura from being emanated out of it, thus avoiding detection.</p><br/><p>This must probably be a safety measure set up by them.</p><br/><p>At the entrance of the village stood an elderly man. He surveyed his surroundings anxiously with a look of worry. It was as though he was waiting for something.</p><br/><p>\"Grandpa…!\" Just then, the kid who Lin Fan had been trailing leaped out of the woods towards the direction of the elderly man.</p><br/><p>'What's up with this situation?' Lin Fan looked at the wings behind the elderly man. This was evidently a being of the Wings race. How could he be the Grandpa of his kid from the Fox race?</p><br/><p>\"Xuan Er! Where had you gone to? How could you run about like that?\" The elderly winged man's face was solemn. However, knowing that his granddaughter was safe and sound, he couldn't help but heave out in relief.</p><br/><p>\"Grandpa, don't be mad, alright? Xuan Er knows her mistakes!\" Xuan Er nodded her head.</p><br/><p>As though she suddenly recalled something, she continued, \"That's right, Grandpa! I bumped into someone outside!\"</p><br/><p>\"Hmm?\" The elderly winged man's face changed for a moment. \"Ancient race being?\"</p><br/><p>\"Nopes! He looked exactly the same as me, just that he didn't have a tail! He asked me where the adults were, but I didn't tell him anything!\" Xuan Er giggled happily.</p><br/><p>\"Did he follow you back?\" The face of the elderly winged man grew stern once more. He had a bad feeling about this. This was a really isolated part of the world. How would anyone appear in the vicinity?</p><br/><p>\"Nopes! That guy was really stupid! So silly, hehe…!\" Xuan Er continued her giggles as she grinned with pride towards her intellect.</p><br/><p>Lin Fan, who was in Stealth mode and standing behind her all the while, was helpless right now. To think that this little thingy would call him silly! That was unbearable, gosh!</p><br/><p>\"Little one there, it's not right to talk bad about others behind their backs, you know?\" A voice suddenly rang out.</p><br/><p>Xuan Er froze up on the spot. At the same time, the elderly winged man hurriedly pulled Xuan Er behind his back and called out warily, \"Who's there!\"</p><br/><p>\"Everyone, please be at ease. I mean no harm.\" Lin Fan appeared before the both of them.</p><br/><p>\"I-I obviously hid away from you! How could you have…?\" Xuan Er was filled with disbelief right now. She had obviously left this guy behind! How could he have followed her back?</p><br/><p>\"Heh, little one there. You're too naïve, aren't you?\" Lin Fan chuckled. He then cusped his fists towards the elderly winged man, \"I am Lin Fan, a member of the human race from Xuanhuang World. I have just ascended into the Ancient Saint World recently.\"</p><br/><p>Looking at the suspicious look on the elderly winged man's face, Lin Fan felt that it was better for him to announce his identity to put the man at ease.</p><br/><p>At the same time, Lin Fan could not help but wonder just how treacherous the entire Ancient Saint World was for everyone to be consistently on their guard as such.</p><br/><p>And indeed, the moment Lin Fan reported his identity, that grim face of the elderly winged man gradually eased. However, he was still slightly guarded against Lin Fan.</p><br/><p>\"Human race?\" The elderly winged man seemed to be slowly reminiscing about something.</p><br/><p>Suddenly, his face changed, \"Please enter…!\"</p><br/><p>\"Huh…?\" Lin Fan was stunned. He did not understand what was going on right now.</p><br/><p>\"Grandpa, he bullied me just now!\" Looking at how her grandpa was being friendly with this stranger, Xuan Er complained grudgingly.</p><br/><p>\"Xuan Er, do not be rude…\" The elderly winged man patted Xuan Er on her head gently.</p><br/><p>\"Little one, I did not bully you, hoho.\" Lin Fan chuckled at the little kid.</p><br/><p>Xuan Er tossed Lin Fan a glance and huffed out loudly before running into the village.</p><br/><p>\"This kid…\" The elderly winged man shook his head exasperatedly.</p><br/><p>...</p><br/><p>Lin Fan then followed the elderly winged man into the village. The village wasn't too big. However, seeing the stranger Lin Fan, everyone's eyes were filled with surprise.</p><br/><p>At the same time, Lin Fan was curious about these people as well.</p><br/><p>There were all sorts of beings from different worlds here. What sort of a place is this?</p><br/><p>Lin Fan then followed the elderly winged man into a simple looking house.</p><br/><p>It was here that Lin Fan found out that the elderly winged man was the village chief. At the same time, this village had existed for a long time without any outsiders discovering its existence.</p><br/><p>Within the house, Lin Fan accepted the tea that was served by the village chief as he nodded his head gently, \"Village chief, just what sort of a place is this?\"</p><br/><p>The village chief looked at Lin Fan and sighed. \"This is a place that was created just to avoid the strife of this world.\"</p><br/><p>\"Village chief, I noticed that you had relaxed immediately the moment you heard that I was of the human race. Could it be that you guys have some sort of connections to our race?\" Lin Fan's aim right now was to look for more humans. Looking at how receptive this village chief was towards the humans, it seemed as though he had some sort of relationship with their race.</p><br/><p>\"No. In fact, you're the first human I've met in my life.\" The village chief shook his head.</p><br/><p>\"Then why is it that…?\" Lin Fan asked in bewilderment.</p><br/><p>\"Tens of thousands of years ago, all the races from the various worlds were living in immense danger and threat under the powerful Ancient race. Back then, no one from any race would dare to even step out with any form of resentment or resistance against the Ancient race. Eventually, five great beings from the human race stood forth and engaged one of the eight utmost beings of the Ancient race in a duel to the death…\" The village chief started.</p><br/><p>Lin Fan's heart skipped a beat. To think that the Heavenly Emperor Yuan and the others would be so famous here! Seemed like their feats had allowed the human race to hold a respectable position in the hearts of these people!</p><br/><p>At the same time, Lin Fan finally understood why this village had people of all sorts of races. All of them were here to avoid the massacre of the Ancient race, as well as those traitors who had betrayed their own races and now served the Ancient race.</p><br/><p>Even though Lin Fan wanted to dig out more information, the village chief had never ever left this place. Hence, he could provide nothing more than that.</p><br/><p>Now that Lin Fan considered properly, it was easy to hide himself while living in these mountainous areas. At the same time, this place was surrounded by beasts as well.</p><br/><p>Seemed like it would be a decent place for him to grind some experience points.</p><br/><p>As long as he could get his power level up, anything else would cease to be an issue.</p><br/><p>Respect.</p><br/><p>Freedom.</p><br/><p>These were things that were based on one's power level.</p><br/><p>Without power, everything else would just be a dream.</p><br/><p>\"Village chief, I'd like to reside here for a little while. Once the time is ripe, I'll make my way out.\" Lin Fan requested after thinking for a little while.</p><br/><p>\"What? You still wanna head out? It's really safe here while the world out there is extremely horrifying! I hope you'd be able to live the rest of your life here without having to experience the terrors of the outside world!\" The village chief remarked in astonishment.</p><br/><p>\"I do not fear the horrors. I bring with me the hope of the entire human race upon my ascension here. My purpose here is to open up a new path of hope for my entire race.\" Lin Fan replied with absolute resolution in his eyes.</p><br/><p>The village chief looked at Lin Fan before nodding his head in agreement.</p><br/><p>\"Thank you.\" Lin Fan expressed his gratitude.</p><br/>\n</div>"}