{"title": "Chapter 457: The Weird, Creepy Uncle and the Little Kid", "id": 457, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-457-the-weird-creepy-uncle-and-the-little-kid", "volume_title": "Volume 5", "body": "<h1>Chapter 457: The Weird, Creepy Uncle and the Little Kid</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 457: The Weird, Creepy Uncle and the Little Kid</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"B*stard…!\"</p><br/><p>Looking at the light screen from the base of the Ancient race, the Ancient race tribesman was enraged by the scene that was being displayed.</p><br/><p>That damned human! How dare he humiliate their fellow tribesmen? He totally deserved death!</p><br/><p>The sight of those Ancient beasts and their frenzied motions on top of their own tribesmen were especially infuriating.</p><br/><p>With a maddened palm strike, he slapped down on the table, breaking it apart, \"Soldiers! Hunt down that human!\"</p><br/><p>\"Yes!\"</p><br/><p>The hideous face of this Ancient race leader was ever more sinister as he glared at the screen with intense hatred. He waved his hand.</p><br/><p>\"Whoever kills this man shall earn the position of a decanus!\"</p><br/><p>This was a reward, and at the same time, served as an incentive for everyone out there from the thousands of worlds to fight for. This was an opportunity many of them would try to snatch for the sake of survival.</p><br/><p>...</p><br/><p>'Just how big is this Ancient forest? How am I still not out of this place?' Lin Fan had managed to obtain a map from scavenging the body of that decanus he had slain. He then took a good look at it.</p><br/><p>Based on his current location, he should be at the edge of the boundaries of this world. This was a desolate place that was devoid of humans. But to Lin Fan, this place was practically a sanctuary.</p><br/><p>After all, the most dangerous beings in the Ancient Saint World would most likely not reside here. They would probably be gathered at the center of the Ancient Saint World.</p><br/><p>Tearing through the void and traveling through it was out of the question for the current Lin Fan. He was bound by restrictions.</p><br/><p>Due to the firm, resolute strength of the energy between the Heaven and Earth of the Ancient Saint World, Lin Fan could not produce those past feats with his current strength. He could not help but admit that this was quite a tragic thing.</p><br/><p>'Seems like the only thing left to do is to appreciate the sceneries of the Ancient Saint World slowly bit by bit. Well, I wonder how the forces and factions of the Ancient Saint World are divided up.' Lin Fan was attacking wildly along the way. At the same time, he was pretty lost, not knowing where the roads were heading to.</p><br/><p>A few days later…</p><br/><p>When Lin Fan saw an entire valley of mountains ahead of him, he was completely stumped. Right after he had bashed through an entire forest, he was faced with mountains?! Where were the flatlands?!</p><br/><p>Lin Fan gritted his teeth, 'Damn it, you vicious world! Yours Truly shall trawl through the mountains and continue pushing forth!'</p><br/><p>PSHEW! PSHEW!</p><br/><p>Suddenly, Lin Fan's eyes squinted, as a shadow had just darted by him!</p><br/><p>\"How dare you sneak an attack on Yours Truly! Asking for it!\" Lin Fan slammed out with a punch.</p><br/><p>However, when he caught sight of the figure, Lin Fan's face was stunned. He halted his strength immediately. Twisting his wrist, he changed the direction of his punch as the void nearby shook with the force of his redirected punch.</p><br/><p>Suddenly, a cry rang out beside him.</p><br/><p>'URGH…!' That figure was a small little kid. Wielding a purple dagger in his/her hands, that kid stabbed at Lin Fan's chest.</p><br/><p>Clang!</p><br/><p>That sharp clash of metal rang out. The moment the kid's purple dagger touched Lin Fan's chest, it came to a stop.</p><br/><p>'Ding…Eternal Immortality experience points +0.'</p><br/><p>\"H-how could this be?! I-impossible…!\" That kid, whose face was filled with dirt, exclaimed out in disbelief.</p><br/><p>\"Hey, brat. Nothing's impossible.\" Looking at the kid, Lin Fan grinned. He then lifted up the kid with a single hand.</p><br/><p>\"LET ME GO…!\" Being lifted into the air, that little kid attempted to kick at Lin Fan with his/her short little legs. However, his/her legs were so short that they couldn't even come close to Lin Fan.</p><br/><p>\"HURGH…!\" Looking at how he/she couldn't get to kick at Lin Fan, the little kid chomped down hard on Lin Fan's wrist. However, that bite caused his/her entire face to flush red. He/she felt as though those pearly whites of his/hers were going to shatter at any moment.</p><br/><p>'Lesser celestial lower level.'</p><br/><p>Lin Fan could tell the strength of this kid in an instant. At the same time, this was curious. To think that a kid like this could have a cultivation state of a lesser celestial at his age here in the Ancient Saint World. That was pretty astonishing!</p><br/><p>If this were the Xuanhuang World, this kid would be the genius amongst all geniuses!</p><br/><p>But, Lin Fan knew that the Ancient Saint World had special properties. Even if one were to not cultivate at all, the Saint Spirit Qi of the world would slowly infuse within their bodies, raising their power level slowly but surely.</p><br/><p>And of course, if this were the Xuanhuang World, this kid would still be quite a somebody. However, in the Ancient Saint World, he/she was nothing but cannon fodder.</p><br/><p>\"Oh no, no, no! Kiddo! Don't be afraid! I'm a good person here! I'll definitely not do anything weird to you!\" With the face of a creepy old uncle, Lin Fan stared at this little kid that was dangling from his arm.</p><br/><p>At the same time, he could not help but sigh in his heart. This kid did look pretty decent. Even though the kid's face was filled with dust, his/her features were really exquisite indeed.</p><br/><p>\"Eh…there's a tail.\" Lin Fan was startled when he noticed a furry little tail coming out from the back of the kid.</p><br/><p>\"Kiddo, you're from the Fox World?\" Lin Fan chuckled.</p><br/><p>\"You horrid fellow! Let go of me!\" The little kid's face was flushed red as he/she tried to struggle out of Lin Fan's grasp. But to Lin Fan, this kid was even weaker than a little chicken. He wondered how a kid like this could survive in such a desolate area.</p><br/><p>\"Oho, no can do. You've got to answer my question first.\" Lin Fan continued chuckling.</p><br/><p>\"Yes.\" Eventually, the kid stopped and stared at Lin Fan while gritting his/her teeth. 'C-can't you see my tail? You stupid idiot!\"</p><br/><p>\"Oho! What a brazen little kid you are! Seems like Yours Truly would have to instill some manners into you today!\" Looking at how daring this little kid was, Lin Fan could not help remarking at that moment. This kid didn't even know how dangerous the circumstances he/she was in right now!</p><br/><p>Lin Fan loosened his grip and turned the kid around. He then dangled the kid in midair once more, this time round with his/her tail.</p><br/><p>\"Let go of me, you baddy!\" The kid was totally flushed red right now. Hugging on to Lin Fan's thighs, he/she chomped down again. But no matter how hard he/she chomped, Lin Fan felt nothing at all.</p><br/><p>\"Little kid, where are you from?\" Lin Fan knew that there must be others around for this kid to be here. But he didn't know where this kid originated from.</p><br/><p>\"What?\" The kid's face was confused before he/she continued struggling, \"Let me go! Otherwise, I'll make sure you can't even walk up straight after I'm done with you!\"</p><br/><p>Looking at the bewildered face of the kid, Lin Fan could feel some curiosity brimming within him.</p><br/><p>\"Where are your parents?\" He asked.</p><br/><p>\"Don't have…\"</p><br/><p>\"Any other adults?\"</p><br/><p>\"Don't know…\"</p><br/><p>...</p><br/><p>Lin Fan was a little exasperated. No matter what he asked, the kid wouldn't respond. Seemed like this kid was trying to guard against him.</p><br/><p>Suddenly, the struggling kid noticed that the other party had released him/her. He/she gave off a really confused face.</p><br/><p>\"Little kiddo, the outside world is dangerous here. You mustn't run out alone like this next time, alright? Go on home! Don't let your family members worry about you!\" Lin Fan's expression changed into one of benevolence.</p><br/><p>\"Don't think I'm a kid! You just want to follow me, right?\" The little kid raised his/her head and glared at Lin Fan suspiciously.</p><br/><p>\"Err…!\" Lin Fan was startled. To think that he was found out! Seemed like this kid had got some little brains!</p><br/><p>\"How could that be? Do I seem like that sort of a person? Okay, how about this? Let's play a little game! I'll close my eyes, and you'll run off to hide! Sounds good?\" Lin Fan beamed.</p><br/><p>Looking at Lin Fan, the kid nodded his/her head slowly, \"Alright…\"</p><br/><p>...</p><br/><p>Looking at Lin Fan closing his eyes for real, the kid heaved a sigh of relief and burst off into the woods.</p><br/><p>Lin Fan grinned.</p><br/><p>\"Wanting to play hide and seek with Yours Truly with just that bit of smarts? Sigh, it's truly lonely when you're the strongest…\"</p><br/><p>Time passed by the second…</p><br/><p>The kid remained hidden in the dense woods. Seeing as how nobody has caught up to him/her, he/she let off a sigh of relief. But for safety precautions, he/she should just wait a little longer.</p><br/><p>But in actual fact, Lin Fan was squatted right in front of this kiddo, looking at him/her intently.</p><br/><p>Lin Fan had long entered Stealth mode. But of course, it would be impossible for that kid to notice Lin Fan squatting before him/her.</p><br/><p>The kid looked ahead. After ascertaining his/her safety, he/she grinned and ran off.</p><br/>\n</div>"}