{"title": "Chapter 459: A Little Girl's Shock", "id": 459, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-459-a-little-girls-shock", "volume_title": "Volume 5", "body": "<h1>Chapter 459: A Little Girl's Shock</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 459: A Little Girl's Shock</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>With that, Lin Fan began on his short stint at the village. At the same time, there was one thing that left Lin Fan pretty exasperated. To think that that small little kid would be a girl! No matter how he looked at it, she didn't seem like one. And she acted like a boy all the time as well.</p><br/><p>Xuan Er did not have any parents. She was discovered by the village chief around the mountainous areas. By the time the village chief found her, her parents had already been killed by a mighty beast.</p><br/><p>In those mountainous valleys…</p><br/><p>\"You little sh*t, use more strength…!\" A gigantic beast seemed like it was about to break down in front of Lin Fan.</p><br/><p>This beast was having an easy and relaxed life initially. However, after meeting Lin Fan, it was as though his life had turned into a complete tragedy.</p><br/><p>The beast had thought that he would be able to devour the person before him in a single mouth. To its dismay, it realized that this fella was tougher than a rock! He couldn't even bite down at all!</p><br/><p>'Ding…Eternal Immortality experience points +100.'</p><br/><p>\"Bloody hell! You're really too much of a trash!\" Lin Fan was completely frustrated right now. He had thought that this earth celestial middle-level beast would give him quite a good workout. To think that he was only fearsome to look at but totally useless!</p><br/><p>The experience points of Eternal Immortality increased by a pitiful 100 points each time. Based on this pathetic rate, how long would it take for him to level up!</p><br/><p>'OWWWW!!! OWW…!!!' The beast no longer wanted to play with this fella anymore. At the same time, it cried out as though it was begging for mercy and seeking settlement for this issue.</p><br/><p>'Can you please let me go if I don't eat you up?'</p><br/><p>\"Stop your bloody cries! If you don't stop biting me, Yours Truly is going to mutilate you into pieces!\" Lin Fan gave the beast's gigantic head a tight slap as he warned it fiercely.</p><br/><p>The brutish looking eyes of the beast were filled with sorrow right now.</p><br/><p>He was an Ancient beast! How could he be in such a tragic state right now?</p><br/><p>Creak…!</p><br/><p>The beast clamped down its massive mouth. That tasty looking delicious hand was stretched into his mouth. However, it was tougher than anything else. The beast was chomping so hard that even his sharp teeth were starting to crack.</p><br/><p>'Ding…Eternal Immortality experience points +50.'</p><br/><p>\"Holy sh*t…!\" Seeing the drop in experience points, Lin Fan was stunned. Not only was this beast not being diligent, it was actually slacking off?!</p><br/><p>'OWWW!!! OWWW!!!' The beast looked at Lin Fan pitifully. It truly wanted to leave. It had been at this for half a day now.</p><br/><p>It could even feel its mouth getting numb and losing all the strength in its jaws now.</p><br/><p>'Hais, trash…! You're simply too trash! What use do I have for keeping you alive? I'LL CHOP…!' With that, Lin Fan shook his head helplessly as he slammed his axe down.</p><br/><p>'Ding…Congratulations on killing earth celestial middle-level beast.'</p><br/><p>'Ding…Experience points +2,000.'</p><br/><p>...</p><br/><p>'Absorb.'</p><br/><p>Once Lin Fan collected everything he could collect, he sighed helplessly.</p><br/><p>The value of this earth celestial middle-level beast had been wiped clean by him entirely.</p><br/><p>When he had first discovered this beast, he engaged it in a fearsome battle. Even though this beast was high in cultivation state than him, Lin Fan was the most experienced in fighting against things beyond his level.</p><br/><p>Lin Fan kept the corpse of this beast within his storage.</p><br/><p>To these villagers, their livelihoods came from these beasts.</p><br/><p>Even though the cultivation states of everyone within the village wasn't too high, they could easily kill a low leveled beast with their combined strength.</p><br/><p>\"I've got to continue searching. I'm just this much closer to getting stronger! After all, I can't stay here for too long. Hence, if I want to get stronger, I've got to look for way tougher opponents.\" Lin Fan thought in his heart. He then disappeared between the mountainous valleys, searching for higher leveled beasts.</p><br/><p>But at the end of the day, this location was near the boundaries of this world. The high leveled beasts would probably not take an eye to this area.</p><br/><p>After chopping for half a day, Lin Fan had only obtained 3,500 experience points. But on the other hand, he had obtained quite a fair number of corpses.</p><br/><p>Now that night was starting to dim, Lin Fan was prepared to head back.</p><br/><p>Within the village…</p><br/><p>Xuan Er was feeling pretty unhappy recently. To think that Grandpa would allow this fella to reside within the village. At the same time, this fella was really uncooperative with the other uncles and aunties, and refused to work together with them. He was just a bloody leech!</p><br/><p>They hadn't even seen him around for the entire day.</p><br/><p>This damned fella! Grandpa must have been bewitched by him! But no worries, Xuan Er wouldn't fall for his lies and deception!</p><br/><p>\"Everyone, head out and get your share!\" Just then, a voice rang into Xuan Er's ears.</p><br/><p>\"It's that fella!\" Xuan Er ran over immediately. She had to see just what this fella was up to.</p><br/><p>...</p><br/><p>Lin Fan was standing at the village entrance and shouting out right now.</p><br/><p>Everyone in this village had low cultivation states. Hence, it was difficult for them to kill the beasts alone or regularly. Hence, most of them just planted fruits and vegetables in the village.</p><br/><p>Ever since Lin Fan arrived, the village chief had been really polite to him. However, he hadn't interacted much with any of the other villagers.</p><br/><p>This was because in their eyes, Lin Fan was still pretty much an outsider. These people who had been through terrible times and torments were naturally wary of outsiders.</p><br/><p>Xuan Er stood at a corner, pouting and looking at Lin Fan casually with one foot resting on the other. She then ran over and asked him in an unfriendly tone, \"You skiving fella! Where have you gone for the entire day? This is not a place where lazy bums should come! Everyone here is working hard daily. We don't have extra food to feed someone like you!'</p><br/><p>\"Xuan Er, do not be rude.\" Just then, the elderly winged village chief walked over briskly.</p><br/><p>\"Grandpa, why are you always on his side? Look at him, he had disappeared for the entire day!\" Xuan Er's face was flushed right now as she stamped her feet in a huff.</p><br/><p>Looking at this little young brat, Lin Fan shook his head helplessly. He had only teased her a little. To think that she would bear a grudge till this day.</p><br/><p>At the same time, Lin Fan was bewildered. All the villagers were standing near the entrance just staring curiously. None of them would dare to approach Lin Fan, as though he would eat them up.</p><br/><p>\"Village chief, I have toured around the vicinity today and slain some beasts. I'm here to share them with the villagers.\" Lin Fan smiled.</p><br/><p>\"Hmph! 'Slain some beasts'... RIGHTTTTTTTTT. Just you? More like some small little animals, right?\" Xuan Er refused to believe Lin Fan.</p><br/><p>\"Xuan Er…!\"</p><br/><p>\"I know, Grandpa! Fine, I won't talk anymore!\" She tossed her head and stood aside. However, her sparkly bright eyes were still filled with distrust.</p><br/><p>\"Little Fan, please don't put it to heart. Xuan Er didn't mean it.\" The village chief said apologetically.</p><br/><p>Lin Fan waved his hand dismissively, \"It's alright. I won't bear grudges against a kid.\"</p><br/><p>\"Hmph…!!!\" Upon hearing Lin Fan's remark that she was a kid, Xuan Er pouted her lips and snorted even louder. However, looking at how her Grandpa was about to get angry once more, she lowered her head and stood there quietly.</p><br/><p>Looking at this little brat, Lin Fan could not hold in his helpless chuckle. Patting his storage, the corpses appeared out one by one.</p><br/><p>'THIS…!!!'</p><br/><p>Looking at the densely laid out corpses of these beasts, the village chief was absolutely astounded. Those villagers were equally dumbfounded, unable to believe the sight before their eyes.</p><br/><p>\"T-this is the Spinal Beast! Upon maturity, it can hit even an earth celestial cultivation state!\" The village chief remarked on seeing one of the corpses.</p><br/><p>\"Village chief, please let the villagers split these amongst themselves. Let's take this as my rental for staying here for the time being.\" Lin Fan chuckled.</p><br/><p>Generally, Ancient beasts could be consumed as food. As for these beasts that Lin Fan had slain, not only were they edible, they were really delicious too!</p><br/><p>\"How…how can we accept this…?\" The village chief commented in embarrassment. These were really important for the village!</p><br/><p>\"It's alright. I'm slaying beasts every day for cultivation purposes anyways. It'd be a waste to dump these corpses away.\" Lin Fan replied.</p><br/><p>\"Alright then. Let me express my gratitude on behalf of our villagers then. Guys, hurry and take the corpses to prepare for storage properly!\" The village chief ordered to the villagers.</p><br/><p>Xuan Er was frozen on the spot once more. Her little peachy mouth was open so wide one could pop an entire egg within it.</p><br/><p>Lin Fan looked over at Xuan Er and smiled.</p><br/><p>Catching Lin Fan's smile, Xuan Er stomped her feet on the ground and left in a huff.</p><br/>\n</div>"}