{"title": "Chapter 462: The Final Day Before Departing", "id": 462, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-462-the-final-day-before-departing", "volume_title": "Volume 5", "body": "<h1>Chapter 462: The Final Day Before Departing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 462: The Final Day Before Departing</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>A series of cries rang out through the mountainous valleys.</p><br/><p>This was no doubt a bait, a delicious piece of meat waiting to be savored by others.</p><br/><p>Xuan Er was rubbing her eyes and bawling outright like a little rabbit that had lost her way. This was the moment where a big bad wolf should appear and devour this little delicacy into his tummy whole.</p><br/><p>\"Eh? Why is nothing happening at all?\" Xuan Er rubbed her eyes and peeked out at the surroundings. Everything was silent and quiet, without any movements at all.</p><br/><p>Hidden in Stealth mode, Lin Fan was all smiles for this little Xuan Er before him. In terms of acting skills, this kid was pretty darn good! That looked realistic as sh*t!</p><br/><p>He wondered how this kid did it. It was as though tears could just drop out of her eyes for free! What an impressive child this was!</p><br/><p>Xuan Er raised the pitch of her cries ever louder at this moment. In fact, those cries only signaled helplessness within them.</p><br/><p>PSHEW!</p><br/><p>Suddenly, a sound rang out from the woods. It was as though something had darted nearby and was surveying carefully.</p><br/><p>For a moment, that frail little body of Xuan Er shuddered for a moment. However, the thought of Uncle Lin beside her calmed her down once more as she raised her pitch yet another notch.</p><br/><p>'BOOHOO…!!!'</p><br/><p>Lin Fan looked around and grinned. To think that it would work! There seems to be a number of beasts now!</p><br/><p>He wondered what their cultivation states were like.</p><br/><p>But on second thought, he should just scrap that thought. This was near the boundaries, so there shouldn't be any beasts that were too strong lurking around.</p><br/><p>\"Uncle Lin, they seem to be here!\" As the commotion in the woods grew, Xuan Er started cowering her fragile body a little again.</p><br/><p>\"Yes. Don't worry, I'm beside you.\" Lin Fan was smiling.</p><br/><p>\"Okay…\" She nodded her head and bawled ever more helplessly.</p><br/><p>To these Ancient beasts, that sound was absolutely delicious, baiting them in with alluring charm.</p><br/><p>BAM!</p><br/><p>Just then, an Ancient beast lunged out of the woods with tremendous force.</p><br/><p>That muscular body and malevolent face gave Xuan Er a big shock.</p><br/><p>'Ancient Beast: Moonlight Howling Wolf. Utmost celestial full cultivation state.'</p><br/><p>Lin Fan knew that there were not many high leveled beasts around this area. The strongest they could get were mostly utmost celestials.</p><br/><p>'RAWR…!'</p><br/><p>The ground shook as yet another towering beast appeared right before Xuan Er's face.</p><br/><p>'Ancient Beast: Single Eyed Giant Ape. Earth celestial lower level.'</p><br/><p>Looking at the beast, Lin Fan was pleasantly surprised. To think that an earth celestial beast would be lured out. Not bad!</p><br/><p>One by one, the beasts came forth.</p><br/><p>It was apparent that the existence of this tasty little kid had attracted their attentions.</p><br/><p>'ROAR…!'</p><br/><p>The Single Eyed Giant Ape hollered out at some of the surrounding beasts. It was as though he was saying, 'This is my prey! All of you get lost!'</p><br/><p>'AWP…! AWP…!'</p><br/><p>The other beasts yelled out in disgruntlement. However, the Single Eyed Giant Ape was way stronger than them. It was not as though they could snatch the food away from him anyway!</p><br/><p>The Single Eyed Giant Ape smirked as he saw these tactful beasts letting him have his way. He then glared straight at Xuan Er.</p><br/><p>Even though this prey might be a tad small, he could smell her delicious scent. This was a gourmet food for sure!</p><br/><p>\"U-uncle Lin…\" Looking at these beasts before her, Xuan Er's face was pale. However, the sensation of a hand resting gently on her shoulders eased her small little soul immediately.</p><br/><p>'That's right. But Uncle Lin is here. I won't be afraid!' Xuan Er shrugged her small little head. She then looked at these beasts and stuck out her tongue, \"Come on…come on! I'm not afraid of you guys…!\"</p><br/><p>'ROAR…!' The Single Eyed Giant Ape howled. How dare this small little thing be so insolent! He then pounced out at her.</p><br/><p>\"Uncle Lin, he's coming…!\" Looking at the leap of the Single Eyed Giant Ape, Xuan Er shouted.</p><br/><p>\"It's alright. You'll be fine…\"</p><br/><p>Just then, Lin Fan appeared out of his Stealth mode. With a bright flash of his Eternal Axe, he slammed down on the Single Eyed Giant Ape.</p><br/><p>'URGH…!'</p><br/><p>Blood sprayed through the skies. In that single instance, the Single Eyed Giant Ape was sliced clean by Lin Fan.</p><br/><p>That towering figure fell to the ground with a thud, motionless.</p><br/><p>\"We won…!\" At the scene before her, Xuan Er jumped up and down with joy. \"Uncle Lin, you're just way too great!\"</p><br/><p>Looking at the elated look on Xuan Er's face, Lin Fan tossed his hair back and replied calmly, \"It's nothing much. Watch closely now. This is all your credit.\"</p><br/><p>Looking at how the Single Eyed Giant Ape was sliced in one single strike, the other beasts howled out in fear. Turning heels, they tried sprinting away from this place.</p><br/><p>But of course, how could Lin Fan give them the opportunity to do so?</p><br/><p>\"All of you, stay here!\"</p><br/><p>Like a butcher's knife, Lin Fan's single slice with his Eternal Axe's swing reaped in the beasts one after another.</p><br/><p>'Ding…Congratulations on killing Earth celestial lower level beast.'</p><br/><p>'Ding…Experience points +500.'</p><br/><p>'Ding…Congratulations on killing Utmost celestial full cultivation beast.'</p><br/><p>'Ding…Experience points +80.'</p><br/><p>...</p><br/><p>Lin Fan was in ecstasy right now. This was the best sort of feeling, the feeling of experience points gushing through his body.</p><br/><p>\"How was that? Exciting?\" After Lin Fan had slain all the beasts, he turned around and took a look at Xuan Er.</p><br/><p>\"Yepp…!\" She nodded her head repeatedly while her little heart was thumping furiously. \"Uncle Lin! You're really, really the bestest best! None of these beasts are a match for you!\"</p><br/><p>While Lin Fan only grinned lightly, his heart was brimming with pride.</p><br/><p>That was for sure. If these beasts could be a match for Yours Truly, then Yours Truly would have been out in the pugilistic world for nothing!</p><br/><p>\"Xuan Er, you were the one who got us all of these beasts today! Let's head back and show them all to the village chief and the others!\" Lin Fan smiled.</p><br/><p>\"Yepp! Xuan Er is not useless at all!\" Xuan Er clapped her hands happily. She then raised her chin and beamed at Lin Fan with those pretty, cute features of hers.</p><br/><p>Lin Fan kept the corpses in his storage and headed back to the village with Xuan Er.</p><br/><p>Upon reaching the village and taking out the corpses, the villagers were filled with astonishment once more. After realizing that it was due to Xuan Er's credit, the praises were rained upon her as well.</p><br/><p>This had Xuan Er leaping around in happiness with flowers blossoming in her heart. She could almost fly with every step she took.</p><br/><p>Seeing this, the village chief was extremely heartened.</p><br/><p>From Lin Fan's face, the village chief could tell that he was about to leave soon. However, he did not inquire him personally regarding it. After all, that was going to be a fact.</p><br/><p>However, the fact that he had brought so many changes and joy to the village was something that the village chief was really comforted about.</p><br/><p>\"I'm not the strong one! Even though I can't deny that my credit is pretty significant, Uncle Lin did a lot too!\" Xuan Er was now in the center of everyone's attention. She beamed and commented to the villagers around her.</p><br/><p>These villagers naturally knew of the truth behind it. However, they were all willing to play along and praise Xuan Er as long as this could cheer her up.</p><br/><p>Breaking out from the circle of people, Xuan Er ran over to Lin Fan and beckoned to him.</p><br/><p>Lin Fan bent down, allowing Xuan Er to whisper in his ears.</p><br/><p>\"Uncle Lin, see! Xuan Er isn't selfish! I won't take the praise alone! Did you see me asking them to praise you too? I'm such a good person, right?\"</p><br/><p>Looking at this cheeky little mischievous Xuan Er, Lin Fan could not help but grin.</p><br/><p>Lin Fan then had Xuan Er stay within the village and headed out into the woods once more.</p><br/><p>Today was the last day.</p><br/><p>Once tomorrow arrived, he was going to continue forth on his journey.</p><br/><p>A peaceful life could dull one's fighting spirit after all.</p><br/>\n</div>"}