{"title": "Chapter 461: I Trust Uncle Lin The Most!", "id": 461, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-461-i-trust-uncle-lin-the-most", "volume_title": "Volume 5", "body": "<h1>Chapter 461: I Trust Uncle Lin The Most!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 461: I Trust Uncle Lin The Most!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What are you laughing at? Is it because you're feeling extremely happy over my acceptance to be your friend?\" Xuan Er looked at Lin Fan with utmost anticipation. Kids had their own sense of pride as well. This was Xuan Er's own way of being bashful.</p><br/><p>Lin Fan looked at Xuan Er and eventually relented into a smile while fondling her head, \"Yes, that's right. I would very much like to be your friend.\"</p><br/><p>Lin Fan had always had a soft spot for cute little kids. But of course, this had nothing to do with the weird fetishes of creepy uncles. It was just that beautiful things were always something to be admired in the world.</p><br/><p>\"Hehe…I knew it!\" Upon hearing this reply from Lin Fan, Xuan Er beamed out into a wide smile immediately, as her furry tail swirled behind her as well.</p><br/><p>\"You're my friend from now on then! You can just call me Xuan Er! And don't worry about it! I'll always find you to play, so that you won't feel lonely!\" Waving goodbye to Lin Fan, Xuan Er skipped her way off.</p><br/><p>Looking at the back view of this kid leaving, Lin Fan could not help but break into a smile.</p><br/><p>In this place, there were no emotional attachments for Lin Fan. In fact, it was extremely rare to even find a high leveled beast in the woods these days. It was as difficult as striking the lottery.</p><br/><p>Lin Fan had originally had the intentions to leave.</p><br/><p>At the same time, it was also because Lin Fan understood that he was now a fugitive wanted by the Ancient race. There was always the underlying threat related to that if he continued residing here.</p><br/><p>With the events of Xuan Er right now, Lin Fan was even more certain that he had to leave this place as soon as possible.</p><br/><p>This was a peaceful place that he shouldn't overstay at no matter what.</p><br/><p>His target had to be always fixed on the Ancient race, and taking them down. That was the only way to bring peace to this world. Even if the Heaven's Will of the Ancient Saint World was on the side of the Ancient race, Lin Fan had the confidence to take down the Heaven's Will of this world eventually as well.</p><br/><p>So what if it were high and mighty? The Heaven's Will of Xuanhuang World was high and mighty as well. But it was taken down by Lin Fan all the same.</p><br/><p>Within a small little house, Xuan Er laid on her warm bed and flipped left and right. Her cute little face was grinning ear to ear.</p><br/><p>'I've got another friend now! I'm so happy…!!!' Xuan Er smiled sweetly to herself.</p><br/><p>Next day…</p><br/><p>At the break of dawn, Lin Fan woke up from his cultivation state. He packed his stuff and prepared to leave this place. The more peaceful this place was, the more he had to leave. He did not want to see any tragedy befalling this place because of him.</p><br/><p>Just as Lin Fan opened his wooden door, he was greeted with a smiley face that was as bright as the sun itself.</p><br/><p>\"Uncle…!\" Xuan Er stood at his doorway addressing him in a lovely tone. Hands behind her back, her tail wagged excitedly from side to side. \"Could you take me out to the woods? Xuan Er really, really wants to go out there to see how things are like there! But because the beasts are way too strong, I've always been afraid to do so!\"</p><br/><p>Looking at Xuan Er before him, Lin Fan sighed helplessly. His face then turned into a smile, \"Alright, no problem!\"</p><br/><p>Lin Fan shrugged his head, thinking in his mind, 'Oh well, forget it. Just this once then. I'll leave tomorrow.'</p><br/><p>Looking at that happy face of Xuan Er, Lin Fan's heart melted at that moment. How could he not even accede to such a small request?</p><br/><p>\"Yay! I knew that uncle is the best…!\" Xuan Er hugged Lin Fan's thighs happily, and rubbed her cheeks against Lin Fan's thighs endearingly.</p><br/><p>Looking at Xuan Er's happy disposition, Lin Fan could not help but break into a smile. She knew how to please others from such a young age.</p><br/><p>But of course, he wasn't that strong to deserve this amount of affection from her yet. Once he grew even stronger, that was when she would have really reaped the benefits of this.</p><br/><p>...</p><br/><p>As the villagers caught sight of Lin Fan walking by, they beckoned to him with friendliness. Looking at that happy little Xuan Er that was following behind Lin Fan, they broke out into laughter as well.</p><br/><p>\"Xuan Er, where are you off to now?\"</p><br/><p>All these friendly villagers teased Xuan Er. After all, they knew that she wasn't too friendly with this human just days earlier. But now, she was constantly behind Lin Fan's back.</p><br/><p>Xuan Er looked around at the villagers and stuck out her little tongue. It was as though she was saying, 'Hehe, Xuan Er's not gonna bother with you guys!'</p><br/><p>In the mountains…</p><br/><p>\"Wow! Uncle Lin! You're so awesome!\" Lin Fan had placed Xuan Er to sit on a tall tree. From her position, she broke into a loud clap as she saw Uncle Lin slice down a beast with a single chop.</p><br/><p>Lin Fan tossed his long hair and smiled naturally, \"Xuan Er, keep a low profile. That's just a lowly common beast.\"</p><br/><p>\"No! It's not! Everyone could only barely kill a normal beast by cooperating together! But Uncle Lin can do so with such ease! Uncle Lin's the best!\" Xuan Er clapped her hands as her eyes sparkled with excitement and pride.</p><br/><p>Lin Fan could not have asked for anything more: A cute little audience who enjoyed his performances.</p><br/><p>It was especially sweet listening to that tone of awe from Xuan Er.</p><br/><p>Lin Fan's ego could not swell any bigger than this.</p><br/><p>\"Xuan Er, low profile…low profile. These are really just normal beasts and are not worth mentioning. Back in the days, I could take down an entire nest of Ancient beasts with just a single swing of my axe!\" When Lin Fan started his bullsh*t, no one else could compare to him. Xuan Er was also taking in the bullsh*t like it was free.</p><br/><p>To Xuan Er, there was no one more trustworthy than Lin Fan. Therefore, she just clapped her hands and exclaimed happily.</p><br/><p>\"Uncle Lin! That's too great!\"</p><br/><p>\"Xuan Er, do you believe Uncle Lin?\" Lin Fan smiled to Xuan Er.</p><br/><p>\"Of course! I trust Uncle Lin the most!\" As though she was wound up by a spring, her head bobbed up and down repeatedly as she nodded fervently.</p><br/><p>\"Good! Come, I'll show you something more spectacular!\" Lin Fan suddenly thought of a new way to attract beasts.</p><br/><p>\"Something more spectacular?\" She asked curiously.</p><br/><p>Lin Fan beckoned with his hand as Xuan Er leaped down from her tree happily</p><br/><p>...</p><br/><p>Lin Fan started explaining the circumstances to Xuan Er. To Lin Fan, this was the first time he was going to experiment with this. He had thought that Xuan Er would be afraid and chicken out of this.</p><br/><p>But of course, whether or not she chickened out did not matter. Lin Fan just wanted to show Xuan Er something more exciting, that was all.</p><br/><p>But who knew that she would agree to it in a heartbeat. That did kind of surprise Lin Fan.</p><br/><p>\"Uncle Lin, I trust you the most! You're a hero! I know that you'll protect me!\" Xuan Er looked at Lin Fan with her cutesy eyes as she remarked with seriousness.</p><br/><p>Lin Fan looked back at Xuan Er and nodded his head eventually, \"Alright. Good. I'll definitely protect you properly. I swear…\"</p><br/><p>Smooch!</p><br/><p>Xuan Er hugged Lin Fan's head happily and kissed his cheek.</p><br/><p>\"Yepp! I definitely trust you, Uncle Lin!\"</p><br/><p>To be kissed by a small little girl from the Fox race did leave Lin Fan feeling a little embarrassed. This girl was just as cute as his little disciples back home!</p><br/><p>Now that he had ascended for a period of time, he did really miss them. He wondered how they were doing right now.</p><br/><p>\"Uncle Lin, hurry up and hide! It's time for Xuan Er to perform!\" Looking at Lin Fan who was deep in his thoughts, Xuan Er wrung at Lin Fan's arm.</p><br/><p>\"Alright…alright.\" Lin Fan chuckled and entered Stealth mode behind Xuan Er. He did not know whether or not the beasts would take the bait.</p><br/><p>\"Eh…Uncle Lin! Where did you go?\" Looking at Lin Fan who had disappeared suddenly, Xuan Er called out curiously.</p><br/><p>\"Don't worry. I'm just right beside you.\" Lin Fan spoke out from his Stealth.</p><br/><p>\"Okay! Don't worry, Xuan Er isn't afraid…!\"</p><br/><p>...</p><br/>\n</div>"}