{"title": "Chapter 478: That's How Treacherous I Am!", "id": 478, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-478-thats-how-treacherous-i-am", "volume_title": "Volume 5", "body": "<h1>Chapter 478: That's How Treacherous I Am!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 478: That's How Treacherous I Am!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Xia Zehua had no idea how his Brother Lin had managed to rile up this three-headed king. He was feeling helpless at the moment. He direly wanted to lend a hand, but knew that even if all of them from the righteous party were to join in, they would barely be able to do anything at all.</p><br/><p>But, something was causing them to feel bewildered. Just what in the world was going on with that middle head? Why did it look so listless, as though it was hanging dead?</p><br/><p>...</p><br/><p>Lin Fan looked at the three-headed king. He had two options right now.</p><br/><p>The first was to give it his all and take down this three-headed king.</p><br/><p>The other was to make use of the chance to level up his Eternal Immortality.</p><br/><p>But, there was still a lingering issue on his mind between these two options. What should he do once the middle head wakes up from its slumber?</p><br/><p>If the middle head’s awakening were to cause this beast’s power level to spike up once again, then that would be quite the tragedy to behold!</p><br/><p>After thinking for a moment, Lin Fan decided. Everything should play by the safe route for now.</p><br/><p>‘Firmament!’</p><br/><p>The Eternal Axe was flung out. Shining brightly, it tore through the void spiraling towards the 3 headed king.</p><br/><p>‘Three-headed and six-armed Faceless Sky Demon!’</p><br/><p>‘Firmament Sword!’</p><br/><p>\"All of you, disturb his rear!\" Lin Fan’s methods of engagement these days were starting to get more and more shameless. Since he might not necessarily win by fighting head on nowadays, he would just slam them from the sides then.</p><br/><p>So as to secure the victory, all sorts of methods were being produced from Lin Fan’s brains these days.</p><br/><p>Lin Fan had long discovered an issue: The way that everyone attacked and fought were too rigid and by the books. To Lin Fan, those ways of combat would most definitely fail to unleash one’s utmost potential.</p><br/><p>Now that Lin Fan’s Firmament Sword had been infused with the sword will from his Will of the Sword, it was an extremely formidable skill. Even some of the people from the Sword World themselves might have to bow down in acknowledgment of his capabilities.</p><br/><p>The movements of the three-headed and six-armed Faceless Sky Demon were extremely swift. Those three expressions on those three faces represented three different types of powers.</p><br/><p>As Lin Fan raised the skill level of Faceless Sky Demon, its power grew even stronger.</p><br/><p>But for him to attain an exceptionally high state of cultivation for Faceless Sky Demon would still require some time.</p><br/><p>PSHEW! PSHEW!</p><br/><p>Upon receiving Lin Fan’s orders, every single sword will that was flung out by the Faceless Sky Demon was aimed at the anus of the three-headed king.</p><br/><p>For a beast of this cultivation state, the physical body state would definitely not be that weak. Therefore, to play it safe, Lin Fan had decided to attack at the spot where he had the most confidence.</p><br/><p>‘I’LL CHOP…!’</p><br/><p>Cleaving out with his Eternal Axe, Lin Fan clashed against those massive claws of the three-headed king.</p><br/><p>The three-headed king’s razor sharp claws shone brightly. Even the damaged Eternal Axe could not chop them off. That only served to have Lin Fan’s appraisal of this beast rise even further.</p><br/><p>...</p><br/><p>\"Leader, isn’t Big Brother Lin way too strong?! To think that he could hold up against the three-headed king like this!\" Looking at this earth-shattering battle before him, Mu Liang exclaimed with his jaws agape.</p><br/><p>\"That’s right! Even though the cultivation state of the three-headed king is only at azure celestial middle level, in reality, it is an existence that’s even stronger than an upper level due to its bloodline!\" Duan Meng remarked.</p><br/><p>\"These are the types of battles that true men should engage in!\" He Chenghan commented with envious eyes.</p><br/><p>He was a man from the War World, where there were countless wars breaking out everywhere. And in fact, the wars only grew stronger over time. Therefore, it was no doubt that He Chenghan would be jealous of this intense battle breaking out right before him. He wished that he could head up there and join in the fight personally. But at the same time, he knew that he probably wouldn’t even last a single second on the battlefield.</p><br/><p>Seeing the sight before him, Xia Zehua’s inner heart had long ascended up into the Heavens. He had not expected Brother Lin to truly be so sick!</p><br/><p>There were, in fact, a couple of times when he had thought that it was over after his Brother Lin was struck down by the three-headed king. But each and every time, his Brother Lin stood back up with great vigor! It was then that he realized it was all just assumptions on his part.</p><br/><p>Just how strong was the physical body state of his Brother Lin?!</p><br/><p>If it were him, he would have long been mutilated into parts by that ferocious claw of the three-headed king!</p><br/><p>...</p><br/><p>ROAR!</p><br/><p>A maddened holler boomed out of the mouth of the three-headed king. It was thoroughly incensed right now.</p><br/><p>There was this thing behind him that was like a specter! Furthermore, each time that apparition struck out, his body would be struck with yet another attack.</p><br/><p>The anus of the three-headed king was especially sore by now. Each time this human struck out to engage him from the front, that sharp sword will would suddenly appear and pierce out at his precious anus!</p><br/><p>Intolerable!</p><br/><p>Suddenly, the three-headed king could feel some sensations stirring up from its middle head. It was as though it was about to awaken from its unconscious state!</p><br/><p>\"Not good! One minute’s about to be over! That look of anticipation on the other two heads must mean that something bad is about to happen.\" Lin Fan had been observing the expressions of this three-headed king, and concluded with this explanation.</p><br/><p>If the three-headed king knew of the human’s thoughts, it would definitely howl out in rage.</p><br/><p>‘Your majesty’s face is absolutely ferocious and poker! How the hell could you tell?!’</p><br/><p>...</p><br/><p>\"Three-headed weirdo, take my axe!\" Lin Fan pushed hard and rocketed violently with both his feet, causing a dust cloud to form behind him. That level of speed was astonishing.</p><br/><p>BAM!</p><br/><p>The claw of the three-headed king struck out once more, clashing against Lin Fan’s Eternal Axe.</p><br/><p>A massive amount of energy burst out from the clash.</p><br/><p>\"STAB HIS ANUS!\" With him being engaged in combat, Lin Fan’s heart leaped with joy. If Yours Truly couldn’t strike it down from the front, he would use his sword will to stab at its anus, causing it an unrelenting pain!</p><br/><p>But just then, the slumped middle head of the three-headed king opened its golden gaze, as an immense aura burst out from him.</p><br/><p>Lin Fan’s face changed. The three-headed king had turned stronger once more!</p><br/><p>The three-headed king glared at the human before him, after which, the middle head did a 180-degree turn and looked at its rear. Opening its wide mouth, it shot out a sonic boom.</p><br/><p>Under the pressure of this sonic boom, the three-headed and six-armed Faceless Sky Demon, who was busy stabbing the anus of the three-headed king, disintegrated and disappeared from the Heaven and Earth.</p><br/><p>RAWRRRRRRRRRRRRRRRRRRRRRRRRRR!!!</p><br/><p>The three-headed king’s anger was beyond this world at this moment. Now that its full powers had returned, it had to make this human pay the price!</p><br/><p>But just as the imposing middle head made its 180 degrees turn back to the front, a red flash appeared before its face once more.</p><br/><p>To think that this human had shamelessly tossed his weapon down at the claw, causing it to slap out into the air for nothing!</p><br/><p>‘Invincible Big Red Brick! I’ll SLAAAAAAAAAAAAAAAAAAAAAAAAAAAP…!’</p><br/><p>PIAK!</p><br/><p>Dizziness.</p><br/><p>In a moment, that head which had just awoken lost its consciousness once more.</p><br/><p>The three-headed king cried out wildly as its claws swiped out furiously. It was determined to tear this human apart!</p><br/><p>‘Urgh…!’</p><br/><p>Looking at how its claws had finally pierced through the chest of the human, the three-headed king revealed a devious smirk.</p><br/><p>\"BROTHER LIN…!\"</p><br/><p>\"BIG BROTHER LIN…!\"</p><br/><p>Seeing this scene, everyone from the righteous party could not help but scream out. They could not believe that this would be the final outcome!</p><br/><p>Now that Lin Fan was pierced through by the three-headed king, the only outcome left for him was death…!</p><br/><p>\"AHH…! I’M GONNA DIE…!!! NOOOO! PLEASE DON’T EAT ME…!!!\" Lin Fan cried out tragically. Immediately, in less than a second’s time, both his legs fell limp as his eyes closed shut, with his tongue sticking out. He couldn’t be any deader than this.</p><br/><p>ROARRRRRRRRRRRRRRRRRRRRRR!!!</p><br/><p>The three-headed king hollered out with an earth-shattering howl. It was declaring the outcome of this battle. Anyone who went against him would only have death awaiting them!</p><br/><p>The three-headed king moved its claws nearer to its face. It had to take a good look at this human. At the same time, this fella had just reminded him not to eat up his body! But this guy had riled up Your Majesty! How could Your Majesty not eat him up?</p><br/><p>As for those ants in the distance, the three-headed king wasn’t interested in the least bit. However, if they decided to try anything funny, it wouldn’t mind devouring them up as well.</p><br/><p>\"B*STARD! I’LL TAKE REVENGE FOR MY BIG BROTHER LIN!\" Mu Liang was riled up. He was ready to go fight it out with the three-headed king.</p><br/><p>\"Don’t be brash! Do we look like we can go up against it? We’ll just be throwing our bodies at him!\"</p><br/><p>‘HAIS…!’ Mu Liang was filled with indignance, but there was nothing he could do.</p><br/><p>...</p><br/><p>The three-headed king moved its claws nearer to its face to take a closer look at this human it had just pierced through. It wanted to see his final tragic state before devouring him whole.</p><br/><p>But just at that moment, the initially happy three-headed king was suddenly stunned, as though it couldn’t react quick enough due to the shock.</p><br/><p>To think that the fella, who couldn’t get any deader than this, would open his eyes and grin at itself!</p><br/><p>\"I’LL SLAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAPPP…!!!\"</p><br/><p>Lifting up his Nine Five Legendary Brick, Lin Fan slapped down towards the head of the three-headed king.</p><br/><p>With this distance, all he needed to do was to stretch out his hand!</p><br/><p>PIAK! PIAK!</p><br/><p>It fainted over immediately.</p><br/><p>But even before it fainted, the three-headed king could not make out or understand how this guy wasn’t dead.</p><br/><p>\"Hmph! Insolent! Yours Truly had just merely employed his innate ‘Oscar Best Actor’ capabilities to trick you for a little bit! You’ve really got no brains indeed!\" Lin Fan tossed his head as his long hair swayed with the wind. He did not mind that body of his that was pierced through in the least bit.</p><br/><p>After all, the only thing that mattered was how majestic and suave he should look right now.</p><br/>\n</div>"}