{"title": "Chapter 471: Lin Fan Who Was Really Calm.", "id": 471, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-471-lin-fan-who-was-really-calm", "volume_title": "Volume 5", "body": "<h1>Chapter 471: Lin Fan Who Was Really Calm.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 471: Lin Fan Who Was Really Calm.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>As someone from the Wings race, Xia Zehua was a man of magnanimity, and had rarely looked down on people. But of course, if someone were to surrender to the ancient race, Xia Zehua would definitely despise them. In fact, he might even murder the other party personally.</p><br/><p>Even though Mu Liang loved to show off, he knew that this kid did not harbor any ill intentions in his heart as well. This was just the way he was.</p><br/><p>Xia Zehua had already prepared himself mentally. After all, it was already extremely fortunate that someone who had just ascended to even manage to keep their lives. And the reason why he had invited Lin Fan into this party upon their first meeting was so that he could give this newcomer some party support. This way, he would have greater hope in living on in this world.</p><br/><p>But when Xia Zehua caught sight of Lin Fan's name on the ranking list, he was completely dumbfounded.</p><br/><p>'Lin Fan, Human race.</p><br/><p>Killed a centurion. Killed 6 decanus. Killed 1,300 soldiers.</p><br/><p>Reward: Ancient race centurion.</p><br/><p>Ranking: 35,120,620.\"</p><br/><p>This was a ranking that was even higher than Xia Zehua's very own! In fact, just his achievements alone were enough to blind their eyes!</p><br/><p>\"Brother Lin, aren't you hiding way too much about yourself?\" Xia Zehua jerked into reality and looked at Lin Fan in disbelief. Those other party members who were busy munching on their delicious food were getting bewildered by their party leader's look of disbelief.</p><br/><p>\"What's wrong, Brother Xia?\"</p><br/><p>The others gathered around curiously as well. They wanted to know just what it was that had caused their leader to be in such shock.</p><br/><p>In fact, even the chirpy and cheery Mu Liang seemed to have been frozen solid.</p><br/><p>But when everyone finally gathered and checked out the fugitive list ranking, the entire place fell silent.</p><br/><p>Plop.</p><br/><p>Their delicious food fell onto the ground from their hands.</p><br/><p>Instantly…</p><br/><p>\"HOLY SH*T! That's too strong, isn't it?\"</p><br/><p>\"A centurion! Six decanus! 1…1,300 soldiers! This…how did you do this…?\"</p><br/><p>\"HERO…!\"</p><br/><p>Suddenly, everyone burst out in cheers. They could not believe their very eyes!</p><br/><p>Looking at the introduction on the ranking list, Lin Fan frowned. 1,300 soldiers? Had he really killed that many the other day?</p><br/><p>Lin Fan had not really thought about it. After all, all he did was rush into them and kill everything in sight. He couldn't even be bothered about the numbers anymore.</p><br/><p>\"Brother Lin, please receive my respects! From now on, you are the big brother in my heart!\" Mu Liang looked over at Lin Fan excitedly. He took a step forth, then half kneeled and cusped his fists together. Those sparkling eyes of his were filled with the utmost reverence.</p><br/><p>Mu Liang had submitted instantly. The moment he saw the description written, he was completely at a loss for words.</p><br/><p>Hero…! These achievements were simply way too dazzling!</p><br/><p>To think that he had been so proud of himself earlier on! This was really a tight slap to his face!</p><br/><p>Gradually, the other party members began to sober up as well. They then chuckled over to Mu Liang, \"Are you still proud of yourself now, Mu Liang?\"</p><br/><p>\"What are you guys talking about? Since when have I ever been a proud person? Big brother Lin is like my lamp in the dark path forward! He is the motivation for my battles for here on forth!\" Mu Liang replied.</p><br/><p>\"HAHA…!\" Looking at how Mu Liang was behaving right now, the crowd of people burst out into laughter. But they soon turned back their gazes of bewilderment at Lin Fan.</p><br/><p>To them, these achievements were definitely heavenly defying!</p><br/><p>\"Brother Lin, this…!\" Xia Zehua looked at Lin Fan. For a moment, he did not know what to say anymore. If not for the fact that he could tell the sincerity within those eyes, he might have thought that Brother Lin was taking them for a ride!</p><br/><p>Lin Fan looked around at the rest of them as well. He had not expected a small achievement as such to give them such a huge shock. Now, THAT was surprising.</p><br/><p>In fact, what Lin Fan did not know was that even though killing the centurion was already a shock that was great enough for them, it was the fact that he had massacred through 1,300 soldiers that had them truly stunned.</p><br/><p>\"Brother Xia, this is nothing much. Actually, back when I had just ascended into this Ancient Saint World, I bumped into the ancient race. That guy's position seemed to be a decanus or something, so I just chopped him down. Thereafter, I felt that these ancient race guys were really too much, so I just headed forth alone into that base up ahead…\" Lin Fan started commenting calmly.</p><br/><p>However, these words were surging like tidal waves within the hearts of these party members.</p><br/><p>\"W-wait…! Brother Lin, did you just say that you headed up to that base ahead?\" Xia Zehua asked in shock.</p><br/><p>\"That's right. It was over there that I took down their centurion and a bunch of other soldiers.\" Lin Fan replied casually. However, that casual look was ever so imposing in the eyes of these people right now.</p><br/><p>Upon hearing the fact that Lin Fan could take down a centurion and thousands of soldiers in front of their base and make it out alive, everyone was totally amazed right now.</p><br/><p>Xia Zehua did not know what to say anymore.</p><br/><p>He had thought that he was doing a good deed by inviting a human who had just ascended and giving him a feeling of solace. But right now, he realized that all he did was to in fact give his own Righteous Party a potent backing.</p><br/><p>Duan Meng, whose little donger was shocked into hibernation by Lin Fan, looked over with a look of utmost admiration.</p><br/><p>To all of them, the strong were definitely worthy of respect.</p><br/><p>Looking at how these guys before him could not get out of their shock over his brilliant achievements, Lin Fan sighed casually. Seemed like Yours Truly was just bound to be so bedazzling wherever he went.</p><br/><p>It was especially so when he caught sight of the looks of respect on their faces.</p><br/><p>\"Brother Xia, that Marquis of Despair you've mentioned earlier on, does he look like a kid?\" Lin Fan asked.</p><br/><p>\"Ah…! Brother Lin, you've met the Marquis of Despair?\" Xia Zehua's face was stumped once more.</p><br/><p>\"Yup, I have. If he hadn't come out, I could have killed more of the ancient race tribesmen.\" Lin Fan commented casually as though he was talking about something that wasn't worth a mention.</p><br/><p>\"AH…!!!\" Suddenly, everyone's minds were blown off once more.</p><br/><p>\"Brother Xia, just what sort of a person is this Marquis of Despair? Why does he not look like one of the ancient race tribesmen?\" Lin Fan asked.</p><br/><p>\"That… I've got no idea as well. All we know is that this the Marquis of Despair appeared a long time ago, and has settled down in this district. At the same time, many people who had ascended were captured over by him.\" Xia Zehua replied.</p><br/><p>\"Then your expedition this time around is to take down the Marquis of Despair? But I could tell that this guy is nothing to be underestimated.\" Lin Fan continued.</p><br/><p>\"The Marquis of Despair is really strong indeed. But I've heard the news that he's severely injured, and his powers have dropped significantly. That's why we wanted to seize the opportunity to take him down and release this entire district.\" Xia Zehua continued.</p><br/><p>\"Then do you know how many strong underlings does the Marquis of Despair have?\" Lin Fan asked.</p><br/><p>\"No idea…\" Xia Zehua shook his head. He hadn't thought about things like these before.</p><br/><p>\"Huh…?\" Lin Fan was startled. This guy was going to head there without even checking things out properly? Wasn't that just courting death?!</p><br/><p>As for this rumor of him being injured, that was definitely impossible!</p><br/><p>Even though that Marquis of Despair seemed child-like, the aura emanated from his body was extremely strong! It was definitely not something they could handle!</p><br/><p>Not to talk about the Marquis of Despair, in fact, even some of his stronger underlings might be able to take down these guys to begin with!</p><br/><p>At this moment, Lin Fan regretted. This 'Righteous Party' might be a suicide squad instead!</p><br/><p>\"Brother Xia, I propose that we start planning things out first.\" Lin Fan suggested.</p><br/><p>\"Alright, we'll listen to you! Everyone, listen up! From now on forth, Brother Lin is the vice leader of our party! Together, we must take down the ancient race!\" Xia Zehua rallied.</p><br/><p>\"Down with the ancient race…!\"</p><br/><p>\"DOWN WITH THE ANCIENT RACE…!\"</p><br/><p>Everyone rallied excitedly.</p><br/><p>'Hais…'</p><br/><p>Lin Fan sighed. He had really f*cked up big time here.</p><br/><p>This Brother Xia was such a fickle minded person! One moment, he was hell-bent on taking down the Marquis of Despair head on. But he changed his mind almost immediately upon hearing Lin Fan's words.</p><br/><p>Wasn't that decision changed too quickly?</p><br/><p>Could he have some stand of his own?!</p><br/>\n</div>"}