{"title": "Chapter 480: Hunted By The Ancient Beast's Daddy", "id": 480, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-480-hunted-by-the-ancient-beasts-daddy", "volume_title": "Volume 5", "body": "<h1>Chapter 480: Hunted By The Ancient Beast's Daddy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 480: Hunted By The Ancient Beast's Daddy</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>ROARRRRRR!!!</p><br/><p>Within the dense patch of forest, a howl that was even more ferocious than that of the three-headed king rang out.</p><br/><p>\"WHO WAS IT THAT KILLED MY OBEDIENT LITTLE CHILD…?\"</p><br/><p>This three-headed king was a few times larger than the three-headed king earlier on. And this here was apparently that beast’s father.</p><br/><p>Xia Zehua was right. The bloodlines of the ancient beast nobles were interconnected. The ties were even deeper in a father-son relationship.</p><br/><p>This three-headed king right here was extremely berserk. A single howl could cause the entire Heaven and Earth to rattle. In fact, in a radius of 100 miles, no other ancient beast would dare to even make a single peep right now, as they were all trembling uncontrollably in fear.</p><br/><p>Beasts of an extremely high cultivation state gained the ability to speak. This three-headed king looked similar to his son. However, on those three heads were six pitch-black curved horns. Those horns shimmered brightly under the moonlight, looking ever more menacing under the night sky.</p><br/><p>\"EVEN IF IT’S TO THE DEPTHS OF THIS WORLD, I’LL SEEK VENGEANCE FOR MY SON…!!!\"</p><br/><p>BOOOOOOOOOOOOOOOOOOOOOOOOOOOM!</p><br/><p>Suddenly, the three-headed king disappeared from its initial spot, as though it was trying to track down the murderer using its bloodline connection.</p><br/><p>By the time this three-headed king had arrived at the scene of the crime, Lin Fan and the others had long fled.</p><br/><p>\"MY SON…!!!\" Looking at the three heads on the ground, this three-headed king was furious to no ends.</p><br/><p>\"JUST WHO IN THE WORLD WAS IT? TO THINK THAT HE WOULDN’T EVEN LEAVE HIS BODY WHOLE! MY DEAR SON, YOU’VE DIED A HORRIBLE DEATH…!\" Looking at how the three heads were the only thing left of his child, the three-headed king howled in anguish. This roar that was filled with immense vigor shot through the clouds, causing the entire sky to ripple out.</p><br/><p>Lin Fan, who had long escaped thousands of miles into the distance, stopped in his tracks. His heart skipped a beat on hearing that ferocious howl.</p><br/><p>\"Holy sh*t! Thank goodness I ran off in time! The next time I bump into an ancient race noble, I must definitely make sure I run off without wasting time!\" Lin Fan patted his chest in relief.</p><br/><p>This was a really exciting feeling right now!</p><br/><p>\"Brother Lin! I’ve noticed that you’ve kept the body of that three-headed king! Remember that you must never ever take it out! Ancient beasts are the best at bearing grudges! The moment they sense the bloodline, they would definitely appear right before you!\" Xia Zehua reminded Lin Fan.</p><br/><p>He was truly afraid right now. Who knew when his Brother Lin might decide to take out the body of that three-headed king to inspect in a moment of exuberance one day? If that happened, they would be tracked in a matter of seconds. Now THAT would truly be tragedy!</p><br/><p>\"Huh…?\" Lin Fan looked at Xia Zehua, stumped. \"You mean to say that I can’t take out the body unless the other party is dead?\"</p><br/><p>\"That’s right. Unless you’re already prepared with the mentality to go all out against the other party.\" Xia Zehua was really serious right now.</p><br/><p>\"Holy sh*t! Then wouldn’t this thing just be rotting in my hands?!\" Lin Fan was rendered speechless. He had wanted to chop down that sharp claw of the three-headed king to craft into a treasure! By the sounds of it, there was no hope of that happening right now!</p><br/><p>‘Hais…!’ Lin Fan gave off a long sigh, expressing his exasperation. But wait, if Yours Truly could get stronger and lure that big BOSS over with this body so that he could chop that BOSS down, wouldn’t things be great too?</p><br/><p>...</p><br/><p>Time passed…</p><br/><p>Lin Fan and the other members of the righteous party were actively working in this area.</p><br/><p>No one else in the righteous party had a system of course. Therefore, they had to make use of peaceful cultivations to level up. As for Lin Fan? All he needed to do was to kill beasts.</p><br/><p>Along the way, Lin Fan took down quite a number of ancient beasts. However, most of them were of low cultivation states. Now that he didn’t have the strongest BUFF any longer, the experience points gained had dropped by a significant amount.</p><br/><p>The highest cultivation states of the beasts that he had bumped into along the way were of earth celestial full cultivation state. If this were in the past, Lin Fan would have definitely laughed himself silly. However, none of it mattered now.</p><br/><p>As an azure celestial lower level, these earth celestial full cultivation beasts no longer brought him that many experience points. Even azure celestial lower level beasts provided a pitiable amount.</p><br/><p>‘Hais, this damned system is really just forcing Yours Truly to fight against beasts higher than my own level! But oh well, f*ck it. No matter what, the reason why I’m so damn powerful now is also thanks to the grooming of this system.’</p><br/><p>With that, the time for the monthly ascension had arrived…</p><br/><p>Within this period of time, Lin Fan had gained quite a decent amount of experience points. At the same time, those members of the righteous party were now used to Lin Fan’s way of training.</p><br/><p>While others entered cultivation mode, all he did was seek out beasts.</p><br/><p>He Chenghan, who was of the War race, was especially admiring of Lin Fan. After all, it seemed as though Brother Lin’s thirst for battles was even stronger than that of his tribesmen.</p><br/><p>...</p><br/><p>Next day…</p><br/><p>\"Brother Lin, it’s time to go. The time for the ascension has arrived.\" Xia Zehua had been waiting for this day for a long time now. He had never once touched on the idea of rescuing those who had just ascended.</p><br/><p>After all, these were dangerous operations.</p><br/><p>It was far from a simple task to rescue that amount of people from this district that was governed by the ancient race.</p><br/><p>\"Alright everyone, be on your toes! Follow my orders! If I ask you to head North, you must never ever head South! If I ask you to act like you’re dead, you must absolutely not breathe! Do you understand me?\" Lin Fan commanded the party.</p><br/><p>\"Yes!\" All of them stood upright. Towards Lin Fan’s words, they were 100% obedient.</p><br/><p>In fact, even Xia Zehua was completely compliant to Lin Fan’s commands.</p><br/><p>Lin Fan did not even need to employ his sub-profession of a Trainer to train up these people.</p><br/><p>After all, Yours Truly was such a bedazzling character all by himself.</p><br/><p>The members of the righteous party had long been charmed by Lin Fan’s dazzling brilliance. They were all completely entranced by that mighty image of his in their minds.</p><br/><p>\"Alright, let’s go…!\" Lin Fan swept his robes and led the way. All of the others followed with a burning battle intent. They knew that they were out to do something big today, something REALLY big.</p><br/><p>...</p><br/><p>The memory of his ascension was clear as day in Lin Fan’s mind. After all, that was one hell of a f*ckfest. To think that they would be captured the moment they had arrived, without any room for preparations or resistance.</p><br/><p>For any single person who had just ascended, a single ancient race tribesman from the Ancient Saint World had enough power to rule over their entire world, their entire Heavens. He could even be their bloody ancestor!</p><br/><p>The difference in their power levels was as vast as the boundless seas.</p><br/><p>But those of them who were ascending this time around were blessed people. The great god of their lives had decided to descend down and receive them personally. These were people who were so lucky that others would envy them in the light of this.</p><br/><p>The area of ascension was a vast, empty, desolate ground.</p><br/><p>Dust clouds blew up in the desolate grounds. Far in the distance, there was a patch of green woods. That was the forest that Lin Fan had waited within after being rescued.</p><br/><p>\"Big Brother Lin, why is nothing happening?\" Mu Liang asked curiously.</p><br/><p>\"Hush. Don’t speak. Let us just wait and watch. Don’t rush into this.\" Lin Fan whispered.</p><br/><p>\"Ok.\"</p><br/><p>A group of people hid between a gap in the valleys, carefully observing the situation up ahead.</p><br/><p>Those ancient race tribesmen who were here to capture the ascended beings were biding their time quietly somewhere in the valleys as well, as if they were just waiting for their preys to arrive.</p><br/><p>\"They’re here…!\"</p><br/><p>These people who had just ascended were filled with a dazed look on their faces. They did not know where they were. Afterward, just like Lin Fan did when he had just arrived, they entered that stretch of road between the valleys.</p><br/><p>CLANG!</p><br/><p>What a pity! These people who had just ascended were caged by the ancient race tribesmen the moment they entered the valley.</p><br/><p>Down in the Lower Worlds, which one of these beings weren’t the elites of their own races? They were naturally howling out wildly with their arrogant cries.</p><br/><p>But of course, they were nothing but ants in front of these ancient race tribesmen. These ancient race tribesmen could not be bothered in the least bit.</p><br/><p>\"Let’s prepare to strike soon…\" Lin Fan had given it a quick scan. The leader of those ancient race tribesmen didn’t have a high cultivation state. Killing him would be an easy task.</p><br/><p>\"Hold on…!\" Suddenly, Lin Fan pressed down his hand. Within the void, another group of rescuers had arrived, just like back then when Lin Fan was rescued.</p><br/><p>\"Brother Lin, let us go give them a hand!\" Xia Zehua commented.</p><br/><p>\"No hurry. Let’s just observe first.\" Lin Fan replied calmly.</p><br/><p>Once again, ‘As the mantis stalks the cicada, it is unaware of the oriole behind it’.</p><br/><p>‘If these guys can pull this off, Yours Truly shall refrain from showing up this time around.’</p><br/><p>‘But if they couldn’t, then Yours Truly would valiantly appear on the scene.’</p><br/><p>...</p><br/>\n</div>"}