{"title": "Chapter 485: JUST YOU GUYS WAIT!", "id": 485, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-485-just-you-guys-wait", "volume_title": "Volume 5", "body": "<h1>Chapter 485: JUST YOU GUYS WAIT!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 485: JUST YOU GUYS WAIT!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>If Lin Fan knew that this would be the way things would play out, he wouldn’t have used the Biggra even at the death of him! With things coming to this, he was completely stumped right now.</p><br/><p>The ancient race tribunus and the three-headed king both were horrifying existences!</p><br/><p>If his weak and fragile body were to receive their ‘care and concern’, wouldn’t he be the most tragic of all humans that had appeared in the Ancient Saint World?!</p><br/><p>\"Intolerable! Definitely intolerable!\" Lin Fan cried out. The shuffling of his feet right now was higher than any frequency attainable. But these two fellas were still chasing him relentlessly! That howl! Those cries! The moment they arrived in his ears, they boomed out wildly.</p><br/><p>\"Please don’t chase after me anymore! Please! Why can’t you guys just poke one another?\" Lin Fan did not know what he should do any longer. If not for the fact that he had already attained an incredible state in the art of escaping, he would have long been humped in the back into a lifetime of sadness.</p><br/><p>By now, the effects of Biggra had already completely coursed its way through their entire bodies, causing them to lose sight of themselves.</p><br/><p>But, the biggest headache Lin Fan had right now was that both of them seemed bent on having him!</p><br/><p>‘Holy sh*t! Could it be that it’s because Yours Truly is way too handsome? Even though they’ve lost their senses, they still can’t help but be captivated by the beauty of Yours Truly?!’ Lin Fan cried out within his heart. This vast and boundless desolate grounds that knew no boundaries caused Lin Fan to lose almost all hope entirely.</p><br/><p>The power level of these two was far greater than his! What should he even do?</p><br/><p>Even if he continued running as such, he would eventually be captured.</p><br/><p>By then, the outcome would definitely be unimaginable.</p><br/><p>‘HEAVENS! EARTH! YOURS TRULY ADMITS HIS SIN! BUT PLEASE GIVE HIM A CHANCE TO LIVE OH LORDY LORD!’</p><br/><p>\"STOP…!\" The colossal body of the three-headed king was sticking tight to the chase. With every single step he took, the ground quaked.</p><br/><p>The thing that was rigid at his crotch was the scariest thing. It was like a Heaven Piercing Pillar that was bent on piercing anything in its way.</p><br/><p>\"STOP YOUR MOTHER! CAN YOU GUYS STOP CHASING? I’LL ACKNOWLEDGE I’M WRONG, ALRIGHT?\" Lin Fan was crying by now. Even his little guts were thumping furiously from the chase of these two.</p><br/><p>\"BLOODY HELL! DON’T GO OVERBOARD!\"</p><br/><p>Suddenly, something frightening happened.</p><br/><p>The three-headed king’s mouth was dripping with saliva all over the place. He stretched out his long tongue, as though he wanted to lick Lin Fan’s anus.</p><br/><p>\"F*CK YOUR MOTHER…! HELP…!!!!!!\" Lin Fan reared his head into the skies and howled. ‘Any god will do! Someone! Please, anyone! Please save me!’</p><br/><p>But to Lin Fan’s dismay, there was no one at all at this desolate area. No matter how and who he cried out for, there was no response.</p><br/><p>The distance between them was closing up.</p><br/><p>That swirling tongue of the three-headed king was especially horrifying to behold.</p><br/><p>\"N-no…! This can’t do! If I don’t think up of a good way, I’m truly gonna be f*cked!\" Lin Fan cried in his heart.</p><br/><p>\"Eh? There’s a hole up ahead! F*ck it! I’ll just jump in first and decide later!\" Lin Fan spotted a hole right before him. The hole was circular shaped and looked as though it could fit a single person within. If he were to jump in, the three-headed king and the ancient race tribunus shouldn’t be able to follow him!</p><br/><p>As to what was below? That was the least of Lin Fan’s worries right now.</p><br/><p>If he didn’t want to be f*cked to death by these two fellas, he could only jump in right now.</p><br/><p>\"THE TWO OF YOU JUST WAIT! YOURS TRULY WILL BE BACK!\" Lin Fan took a deep breath. With a single thud, he leaped into the hole.</p><br/><p>‘AHHHHH…!!!’</p><br/><p>He did not know where this narrow hole led to, but he could feel himself sliding down a long way down.</p><br/><p>‘HUFF…!’</p><br/><p>Lin Fan heaved a sigh of relief. He was temporarily safe for now. He wondered how things were going on up above.</p><br/><p>ROAR!!!</p><br/><p>A single roar rang through from above.</p><br/><p>Now that Yours Truly had escaped, those two up there should be engaged in their copulation match by now. As to how tragic the outcome would be, Lin Fan could not even bear to imagine it. But, he knew that it would definitely be horrifying and inhumane.</p><br/><p>‘Eh? That’s not right. What the hell is Yours Truly even continuing to slide down for? Now that both of them should be poking one another, Yours Truly should take the chance to climb back up slowly! If I can give both of them a tight knock with the brick, I can just take them down and enter the peak of my life from here forth!’ Lin Fan was getting excited with his thoughts.</p><br/><p>‘That’s right! That’s the way I should f*ck them up!’</p><br/><p>Stop!</p><br/><p>Lin Fan spread out his legs to halt his downward movement, then began to climb back upwards.</p><br/><p>The closer Lin Fan got to the top, the louder he could hear those outrageous yells. In fact, it sounded a little tragic as well.</p><br/><p>‘Just what the hell is going on up there? Damn it, this is way too bloody curiously seductive! How would the ancient race tribunus mount that colossal body of the three-headed king?’</p><br/><p>All sorts of impossible positions appeared within Lin Fan’s mind.</p><br/><p>The more he thought about it, the more excited he got.</p><br/><p>\"Hehe…!\" Suddenly, Lin Fan sniggered. He had realized that he was simply way too smart! Even though he had gone through trials and tribulations, he was still the eventual winner who was going to come out on top!</p><br/><p>BOOM!</p><br/><p>ARGHH….!!!</p><br/><p>\"What a sorrowful cry! What a fascinating duel! Even though the ancient race isn’t human, they do have an anatomy similar to that of humans. Could they be pulling off a bestiality act up there?\"</p><br/><p>Lin Fan’s anticipation grew.</p><br/><p>Soon, Lin Fan arrived at the entrance of the hole. He stretched out his hand carefully. He was going to get out slowly to just observe the situation first. If everything were safe, he would then enter Stealth immediately.</p><br/><p>‘Eh…?!’</p><br/><p>‘What the f*ck is this black thing…?!’</p><br/><p>Suddenly, Lin Fan caught sight of a black glow of light accompanied by a shriek of terror.</p><br/><p>BAM!</p><br/><p>Lin Fan’s head received a hard knocking from that black flash of light, following which, a gigantic hoof stomped down on his head.</p><br/><p>‘THE F*CK…?!’</p><br/><p>Suddenly, the only thing Lin Fan could feel was his entire world spinning and his head going into a daze.</p><br/><p>\"ALL OF YOU JUST WAIT…!\" Those were Lin Fan’s final cries as he was sent tumbling down the hole once more by this tremendous force.</p><br/><p>...</p><br/><p>Lin Fan had no idea where this tunnel led to. All he knew was that he was sliding down continuously.</p><br/><p>Curves and turns... After god knew how long, Lin Fan finally came to a thud.</p><br/><p>\"AIYO…!\" Lin Fan could feel his bum stinging from the landing as he wondered where he was. Everything around him was pitch-black. He couldn’t even see his fingers if he stretched out his hand.</p><br/><p>However, Lin Fan wasn’t afraid of the darkness. After all, now that his cultivation state was high, he could break through these troublesome things and sense his surroundings.</p><br/><p>‘Isn’t this just an underground cave?’ Lin Fan’s heart was bewildered as he surveyed his surroundings.</p><br/><p>‘Eh? What’s this?’ He noticed a shimmering black thing below his foot and picked it up.</p><br/><p>‘Ding…Congratulations on discovering three-headed king’s horn.’</p><br/><p>‘Purpose: Crafting Weapons.’</p><br/><p>Finally, Lin Fan understood. That black flash of light earlier on was from this horn! He looked at the horn. It was stained with some bloodstains on it. Evidently, this horn must have been ripped apart during the copulation match with the ancient race tribunus.</p><br/><p>‘Just what sort of a position could they have been in for this horn to be broken?’</p><br/><p>Suddenly, Lin Fan sniggered evilly.</p><br/><p>...</p><br/>\n</div>"}