{"title": "Chapter 486: Thus, The Master Was Killed By A Bunch Of Wild Fists", "id": 486, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-486-thus-the-master-was-killed-by-a-bunch-of-wild-fists", "volume_title": "Volume 5", "body": "<h1>Chapter 486: Thus, The Master Was Killed By A Bunch Of Wild Fists</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 486: Thus, The Master Was Killed By A Bunch Of Wild Fists</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan kept the three-headed king’s horn within his storage. This horn was a treasure in itself. Born on the head of the three-headed king, this horn was tougher than anything else there could be. At the same time, it possessed the aura of the three-headed king. If Lin Fan were to use this to craft a weapon, he would definitely be able to craft a pretty decent weapon.</p><br/><p>But, Lin Fan would just keep this horn first till he could find suitable materials to add in during the crafting process.</p><br/><p>But, it was a pity that those two fellas above were practically meat on his own plate. Yet, he was sent flying off at the last moment.</p><br/><p>No matter who this happened to, they would definitely feel equally regretful.</p><br/><p>Lin Fan looked around at his surroundings. The walls seemed extremely dry and full of vicissitude. It was as though they had been like this for a really long time now.</p><br/><p>‘Just what in the world is this place? Could this be a home for some ancient beast or something?’ Lin Fan wondered with curiosity. The tunnel he slid down from did not seem to be made naturally. It seemed like it was made artificially.</p><br/><p>‘Forget it. Time to take things one step at a time. Time to take a peek within.’ Lin Fan entered Stealth mode and continued heading forward.</p><br/><p>A mysterious and weird place like this was something that Lin Fan had always hoped to find. After all, in novels, these were the type of places were treasures waited for the one with affinity.</p><br/><p>And of course, Lin Fan believed himself to be that fated man.</p><br/><p>Within the hole, there were three other holes before him. Lin Fan did not know where they led to.</p><br/><p>He stood in front of the holes for quite a while, rubbing his chin. Finally, he decided on the left hole.</p><br/><p>‘Men on the left, women on the right. Demons? They shall head through the center then.’</p><br/><p>Drip. Drip.</p><br/><p>Ever since he entered the tunnel on the left, Lin Fan had continued heading forth. Along the way, there was the sound of water dripping in the cave.</p><br/><p>Lin Fan wondered where this place was. But all he knew was that he felt strange about this place.</p><br/><p>This was an indescribable and unspeakable feeling.</p><br/><p>However, since he was here, he had to find an exit no matter what.</p><br/><p>As Lin Fan headed further, his face frowned.</p><br/><p>Bam!</p><br/><p>Suddenly, a bronze colored gigantic fist pummelled down from the ceilings of that narrow tunnel.</p><br/><p>Bam!</p><br/><p>Lin Fan shifted his body, barely dodging the fist.</p><br/><p>‘Holy f*ck! What the hell are these?!’ Looking at the silent ceiling, Lin Fan’s heart started to turn warier.</p><br/><p>He could swear that he had really seen a bronze colored fist punching out at him!</p><br/><p>\"Who’s there? You better come out! Don’t act mysterious in front of Yours Truly!\" Lin Fan checked out his surroundings cautiously. Just then, Lin Fan noticed bodies buried deep into the ground below.</p><br/><p>He had not paid much attention earlier on. Hence, he missed out these details. But upon closer inspection, he realized that the bumps on the ground were in fact corpses that were decomposing!</p><br/><p>‘The f*ck! What the f*ck is up with this place?!’ Lin Fan’s face frowned. He was starting to get a little worried. It was truly as he had thought earlier on! This hole seemed so obvious! How could it be that no one else had ever come down here?</p><br/><p>Finally, he understood. It was because everyone who had come down had died down here as well.</p><br/><p>‘This is too damn dangerous! I better head back. They should be done with their copulation battle up there. Perhaps I should just climb up and take a look.’ Lin Fan retraced his steps without any hesitation.</p><br/><p>Who the hell knew what was up with this messed up place? There was nothing he knew about this place. It wasn’t worth the risk at all. He’d do better checking up on the ancient race tribunus and the three-headed king. Who knew, he might even get a bargain out of it.</p><br/><p>Therefore, Lin Fan headed back.</p><br/><p>However, when he arrived at the place he had landed in, he realized that the tunnel he had come tumbling down from had disappeared!</p><br/><p>‘What the f*ck…?’ Lin Fan was speechless.</p><br/><p>‘Hais…’</p><br/><p>He sighed. This was just forcefully pushing him forward, wasn’t it? Otherwise, he’d just be waiting for death at this place anyways.</p><br/><p>‘Damn it. Give it a shot then.’ Lin Fan shook his head and sighed.</p><br/><p>...</p><br/><p>Left tunnel…</p><br/><p>Lin Fan took in a deep breath and looked at this endless tunnel, bolstering his courage while at it.</p><br/><p>‘RUSH…!’</p><br/><p>The moment Lin Fan rushed in, he felt that same sense of danger striking out at him once more.</p><br/><p>A gigantic bronze hand slammed out at Lin Fan.</p><br/><p>‘I’ll dodge!’</p><br/><p>‘I’ll give!’</p><br/><p>At this moment, Lin Fan twisted and turned his body into all sorts of weird positions, dodging the fists one by one.</p><br/><p>\"HAHA…! You can’t hit me! Here Yours Truly was thinking how strong you were. But that’s all you amount to!\" Lin Fan burst out laughing.</p><br/><p>The speed of these fists that came from the walls was simply too slow. In fact, they were like snails to Lin Fan, bearing zero challenge.</p><br/><p>Not long after, the bronze fists disappeared entirely, and the entire tunnel fell silent once more.</p><br/><p>\"HAHA…! Kill Yours Truly? You guys gotta check whether you’ve got the capabilities to do so first! Let me tell you, Yours Truly is like Nessie in Loch Ness! I can do anything and am capable of all feats! All you little fries who want to block the path of Yours Truly? Simply courting death!\" Lin Fan raised his head with an imposing look. An air of superiority burst out from him immediately.</p><br/><p>Suddenly, it was as though no one in this world could do anything to Lin Fan.</p><br/><p>No matter what sort of incredible existence one might be, they would all pale in comparison with this marvelous and dazzling gaze of Lin Fan.</p><br/><p>\"Lalala…!\" Hands behind his back, Lin Fan hummed his way through this tunnel calmly. He had thought that this was going to be some powerful sh*t. But that was all it turned out to be.</p><br/><p>As for those who had died here, Lin Fan was filled with disdain. To think that they could be punched to death by these weak fists? What an embarrassment!</p><br/><p>‘Look at how charismatic Yours Truly is! How imposing!’</p><br/><p>That nervous heart of Lin Fan had calmed down by now.</p><br/><p>As for the treasure that awaited him up ahead, Lin Fan was filled with anticipation. However, even if there were no treasure, he was fine with it. He’d be cool with just getting out of this place.</p><br/><p>Just as Lin Fan was happily heading along his way, something changed.</p><br/><p>Bam! Bam!</p><br/><p>From those peaceful walls, a countless number of fists suddenly appeared! The number of fists was way more than before, coming out at a high frequency. In fact, even the speed had increased by quite a bit!</p><br/><p>‘Holy f*ck! This is so damn…’</p><br/><p>Lin Fan’s peaceful heart suddenly started stirring once more. However, before he could even finish his statement, he was drowned in the fists.</p><br/><p>\"Ouch! Not my face!\"</p><br/><p>\"F*ck! Don’t hit my crotch…!\"</p><br/><p>\"You bunch of beasts! Don’t blame me if I get angry!\"</p><br/><p>\"OUCH…!\"</p><br/><p>‘Ding…Eternal Immortality experience points +1,000.’</p><br/><p>‘Ding…Eternal Immortality experience points +1,000.’</p><br/><p>...</p><br/><p>And thus, the master was killed by a bunch of wild fists.</p><br/><p>The fists that had burst out from the walls did not have any sequence to them nor any gaps at all. They were just bloody slamming down on Lin Fan left and right!</p><br/><p>\"This is way too despicable!\" Lin Fan cried out.</p><br/><p>However, his heart was filled with joy upon hearing the notifications of the system as well.</p><br/><p>The experience points of Eternal Immortality were literally skyrocketing!</p><br/><p>Suddenly, Lin Fan turned imposing once more.</p><br/><p>\"Hmph! You bunch of wannabes! Kill Yours Truly if you’ve got the guts! Yours Truly isn’t afraid of you guys!\" Lin Fan shouted out with a glimmer in his eyes.</p><br/><p>Whether or not his physical body state leveled up depended on this place now!</p><br/><p>...</p><br/>\n</div>"}