{"title": "Chapter 483: Perfect Combination of Bravery and Wisdom! Who Are You Talking About?", "id": 483, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-483-perfect-combination-of-bravery-and-wisdom-who-are-you-talking-about", "volume_title": "Volume 5", "body": "<h1>Chapter 483: Perfect Combination of Bravery and Wisdom! Who Are You Talking About?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 483: Perfect Combination of Bravery and Wisdom! Who Are You Talking About?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>BAM!</p><br/><p>That single claw ripped through the void, causing the entire ground to tremble. Even as he returned a punch against it, the ancient race tribunus was sent flying back for a few thousand feet.</p><br/><p>\"Three-headed king! Don’t you dare go overboard! Are you trying to wage war against the ancient race?!\" The ancient race tribunus had not expected things to turn out this way as he howled out to the skies.</p><br/><p>This damned b*stard! How dare he sow the seeds of discord?</p><br/><p>\"Hmph! Do you truly think the three-headed king race should be scared of the ancient race then? Do you think we’re pushovers just because the greatest of our kind has fallen?\" This 3 headed king’s colossal body covered the entire skies. Compared to the one Lin Fan had killed, this was definitely way mightier!</p><br/><p>At the same time, its powers were beyond the Heavens!</p><br/><p>PSHEW!</p><br/><p>The three heads of the three-headed king howled wildly. Those ancient race soldiers who had rushed up were struck down by the sonic blow produced by these howls. They disintegrated into dust immediately.</p><br/><p>\"Bravo, great three-headed king lord…!\" Lin Fan clapped his hand and cheered him on, \"Let this fella know that the three-headed king race still have got their dignity! They aren’t cowards that are meant to be slain like pigs!\"</p><br/><p>ROAR!</p><br/><p>The three-headed king glared at Lin Fan as he hollered out, \"HUMAN! I’ll deal with you later…!\"</p><br/><p>PSHEW!</p><br/><p>With that, the three-headed king darted into the distance, chasing after the ancient race tribunus.</p><br/><p>Looking at the departing back view of the three-headed king, Lin Fan raised his middle finger, \"F*ck you! Don’t let Yours Truly seize the chance or I’ll definitely take down all three of your dog heads!\"</p><br/><p>BOOM! BOOM!</p><br/><p>A series of earthshattering explosions boomed out across the world.</p><br/><p>\"How dare you kill my son, ancient race! I’ll definitely take your life!\" The three-headed king’s might was beyond that of this world. No one could block that single claw of his.</p><br/><p>Even the tribunus of the ancient race was retreating in defeat after every strike. In fact, he hollered back, \"How dare you go overboard, you damned three-headed king? After I kill you, I’ll make sure I kill your entire race! In fact, I’ll have all my boys of the ancient race ravage your wife…\"</p><br/><p>ROAR!</p><br/><p>\"So, you DID have those thoughts in your head! I’LL KILL YOU!\" The three-headed king howled in rage and began exchanging blows with the tribunus once more.</p><br/><p>...</p><br/><p>Watching this devastating battle from a distance, Lin Fan shook his head helplessly.</p><br/><p>Seemed like the intellect of the ancient race tribunus was pretty limited. It was just a trap to frame him initially. To think that he would even go on to taunt and admit those lies!</p><br/><p>\"I am Lin Fan from the human race! Everything I’ve said earlier was just bewitching lies of trickery! Please do not mind them! Now that the situation is critical, please hurry up and leave with everyone!\" Lin Fan looked at Bai Yichen and said.</p><br/><p>Bai Yichen looked at this human before him. He had tons of emotions he wanted to express. However, just as the other party had said, the matter was urgent right now. Besides, this was a great opportunity. If they were to delay this, who knew what might happen in the next second.</p><br/><p>Those ascended beings who were trapped in the cage were released at this moment as well.</p><br/><p>\"Fellow brother, I apologize for the misunderstanding earlier on. Please forgive me. To think that there would be someone like you who possesses both courage and wisdom. Bai Yichen expresses his immense gratitude.\" Bai Yichen replied gratefully.</p><br/><p>\"Alright, that’ll do. Let’s make do with the formalities. All of us are beings of the thousands of races out there. Together, we shall fight against the ancient race. Let’s not take an issue like this to heart. I’ve got some of my party members over there. Please meet up with them and leave together.\" Lin Fan replied calmly.</p><br/><p>Upon hearing these words, Bai Yichen was filled with respect for the human race. To think that this man would take fame and glory so lightly! Impressive. Impressive!</p><br/><p>Suddenly, his face changed, \"Wait a minute, you’re not leaving with me, Brother Lin?\"</p><br/><p>\"No, I’ve got some matters left to resolve. Please leave with them first. We’ll meet once more if we’ve got the affinity.\" How could Lin Fan leave just like this?</p><br/><p>On one hand was a tribunus of the ancient race.</p><br/><p>On the other hand, a three-headed king.</p><br/><p>As long as either side could kill the other, the rewards would definitely be bountiful!</p><br/><p>If he didn’t get anything out of this and left just like this, he would be letting down this immense amount of effort he had put in!</p><br/><p>\"Hurry up and leave! Once those ancient race soldiers start reacting to this, things would get sticky!\" Lin Fan continued.</p><br/><p>Bai Yichen did not hesitate and nodded his head, \"Alright. Please come and seek me out in the Sword race if you’ve got the chance. I’ll definitely thank Brother Lin immensely for this lifesaving favor.\"</p><br/><p>\"Leave…!\"</p><br/><p>Taking the ascended beings along with him, Bai Yichen led them in the direction Lin Fan had pointed to.</p><br/><p>Seeing the departure of Bai Yichen and the others, Lin Fan heaved a sigh of relief. Finally! Now that they were gone, it was time for him to unleash his full potential!</p><br/><p>As for those ancient race soldiers, Lin Fan couldn’t be bothered with killing them any longer. The priority right now was to chase up ahead and check on the situation between those two.</p><br/><p>As the saying went, ‘When shepherds quarrel, the wolf has a winning game.’</p><br/><p>How could he give up that big piece of cake for these small little fries right here?</p><br/><p>Entering Stealth mode and retracting all his aura, Lin Fan burst forth into the distance.</p><br/><p>...</p><br/><p>By now, everyone from the righteous party was completely stumped.</p><br/><p>The moment they saw their Brother Lin head out there fearlessly, a single outcome came into their minds.</p><br/><p>Brother Lin would definitely die at the hands of the ancient race.</p><br/><p>But what happened after had all of them dumbfounded. In fact, it felt as though the entire world has changed. They were too far away to make out what was happening exactly. But the moment the three-headed king appeared, their hearts skipped a beat.</p><br/><p>Not only was there the threat of the ancient race, there was now a matured three-headed king!</p><br/><p>All of them knew that Lin Fan had killed a three-headed king, and this other three headed king that had just arrived was evidently here for revenge!</p><br/><p>Yet, something strange happened!</p><br/><p>As though the three-headed king had a grudge against the ancient race tribunus, the both of them started fighting all of a sudden!</p><br/><p>Every single scene had their jaws dropping apart further.</p><br/><p>...</p><br/><p>Bai Yichen and the others arrived at the spot where Xia Zehua and the others were hiding at.</p><br/><p>\"Are you guys party members of Lin Fan?\" That frosty cold face of Bai Yichen was much gentler right now.</p><br/><p>After all, he was standing before the party members of that wise and brave Lin Fan. Naturally, he would have to converse with them in a welcoming tone.</p><br/><p>\"That’s right! Eh? Where’s Big Brother Lin?\" Mu Liang asked.</p><br/><p>\"Let us retreat out of this place first. I’ll explain slowly later on.\"</p><br/><p>The group of people exited the area swiftly. Upon reaching a safer area, members of the righteous party listened to Bai Yichen’s explanations.</p><br/><p>\"Hais! To think that Brother Lin would have such courage! That was such a resourceful move that he played out! Indeed, it’s worthy of much respect!\" Upon hearing the entire happenings, Xia Zehua could not help but sigh in acknowledgment.</p><br/><p>\"But what’s going on with Big Brother Lin? How could he continue forth solo in such a dangerous situation?\" Mu Liang asked worriedly. At the same time, the respect he had for Lin Fan rocketed to a new peak.</p><br/><p>Glancing at everyone, Bai Yichen lamented, \"To think that someone of such genius intellect would exist in the Ancient Saint World. The way he had turned that deathly scenario around with such ease! If I’ve got the chance, I must definitely learn a thing or two from him!\"</p><br/><p>\"I can only hope that Brother Lin is safe right now.\"</p><br/><p>...</p><br/><p>While everyone was singing praises of Lin Fan, he had long been trailing behind those two.</p><br/><p>Lin Fan did not dare to get too close. After all, the battle was way too intense!</p><br/><p>Everything in a circular radius of ten miles from their fight was practically partially destroyed by the shockwaves being emitted out. At the same time, Lin Fan had finally witnessed the difference in a duel between higher leveled beings.</p><br/><p>Just what sort of a state was a desolate celestial?</p><br/><p>With every single strike, the void tore apart, and the skies changed color.</p><br/><p>Even from this distance, he could feel the feedback from the clashing of their powers…</p><br/>\n</div>"}