{"title": "Chapter 497: Ever Charming For Women", "id": 497, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-497-ever-charming-for-women", "volume_title": "Volume 5", "body": "<h1>Chapter 497: Ever Charming For Women</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 497: Ever Charming For Women</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'Ding…Congratulations on killing Azure celestial middle-level chiliarch.'</p><br/><p>'Ding…Experience points +20,000.'</p><br/><p>To think that the experience points given out from killing this ancient race chiliarch would be these many! That was pretty darn worth it!</p><br/><p>'Absorb.'</p><br/><p>Even though the body of the ancient race chiliarch had already turned into dust particles and blood droplets, leaving those pure drops of essence blood floating all around the sky would be such a waste.</p><br/><p>After his Demon City had absorbed everything, Lin Fan heaved out a sigh of relief. Even though this wasn't an earthshattering battle, it made him understand one thing.</p><br/><p>The power that could be exerted by a high leveled ancient race being wasn't as weak as he had imagined it to be. He should never let his guard down carelessly from now on.</p><br/><p>\"Fellow brother, are you alright?\" Lin Fan looked at the pale-faced Li Tianquan, quite puzzled. Where did this bunch of people turn up from? And looking at their clothing, they seemed to have come from the same place.</p><br/><p>\"We're alright. Thank you for your righteous assistance, brother! Otherwise, all of us would have fallen into the hands of these foul creatures.\" Li Tianquan thanked Lin Fan profusely. The shock of the reality that had just manifested was starting to get to him. If this man had not arrived, they would certainly have died right here.</p><br/><p>At the same time, he was completely stunned by the methods of this man before him. To think that that formidable ancient race chiliarch would have died such a horrific death, without even a corpse remaining!</p><br/><p>\"It's alright, you don't have to thank me. It's only natural for people like me to lend assistance wherever injustice is met. That is the only thing that can give us hope to continue resisting the ancient race. This place is no longer safe. Let's hurry up and leave first.\" Now that the ancient race chiliarch had been killed by Lin Fan, his ranking on the fugitive list must have moved up quite a bit once more. At the same time, the ancient race base must have already received the news as well.</p><br/><p>Lin Fan did not dare to guarantee that he would be a match for any ancient race tribesmen that could hunt him down here.</p><br/><p>\"Alright…\" Li Tianquan nodded his head. He knew that they shouldn't linger here for too long either.</p><br/><p>\"Senior brother, we'll help you up!\" Both the female disciples headed forth to help up their senior brother. However, as one of the female disciples brushed by Lin Fan, she turned her head away and glared down shyly.</p><br/><p>Lin Fan chuckled in his mind. Seemed like no matter where Yours Truly was headed to, he was still brimming with charm for the women.</p><br/><p>...</p><br/><p>Desolate mountain cave…</p><br/><p>Lin Fan and the others searched for a safe and secretive place before hiding here temporarily.</p><br/><p>The entire desolate grounds were vast and empty outside. If the ancient race were to conduct a manhunt, they would definitely be caught easily. They might as well hide for the time being. That would be the safer option.</p><br/><p>\"Brother Li, from the looks of your attire, are you guys from a sect?\" Lin Fan truly did not know if sects existed in the Ancient Saint World.</p><br/><p>Now that the Ancient Saint World was controlled by the ancient race, who could dare to brazenly open up a sect of their own flamboyantly? Who knew when the ancient race might just knock up their doorsteps and exterminate them the moment they opened up the sect.</p><br/><p>\"Brother Lin, we're disciples of the Star Sect. These are my junior brothers and sisters here.\" Li Tianquan replied. At the same time, he was still astonished that this man from the human race before him was someone who had just ascended.</p><br/><p>This was absolutely incredible! To think that someone could be this strong to take down even an ancient race chiliarch after he had just ascended!</p><br/><p>He thought back to himself. He had trained up for tens of years in the Star world before ascending up into these greener pastures of his dreams. However, he had not expected the Ancient Saint World of his dreams to be so drastically different.</p><br/><p>In that period of time, Li Tianquan was utterly anguished and despaired. If not for the fact that he had met with his benefactor, he would have died a long time ago somewhere.</p><br/><p>\"Star Sect? Brother Li, do you mean to say that there's some way to create a sect out in the broad daylights under the watchful eyes of the ancient race?\" Lin Fan asked curiously.</p><br/><p>\"Hais…\" Li Tianquan sighed helplessly. \"That's naturally impossible, Brother Lin. The Star Sect is hidden somewhere in the dark and can never see the light of day. Otherwise, we would definitely be oppressed by the ancient race as well.\"</p><br/><p>\"Actually, there are many sects within the Ancient Saint World. However, most of us are hidden most of the time. Most of the founders of these sects were people who had once ascended as well. In the end, they decided to create a place so that their future generations could have a place to cultivate and train up.\" Li Tianquan elaborated.</p><br/><p>Lin Fan nodded his head in acknowledgment. He had truly not known anything about all this stuff.</p><br/><p>Seems like these people who had turned stronger after ascending into the Ancient Saint World were the ones who created such places in order to take care of their newly ascended fellow race members. Opening up these places would then allow them to guide the others and help them survive in the Ancient Saint World.</p><br/><p>At the same time, Lin Fan inquired about the weapons crafting issues in the Ancient Saint World, and discovered something shocking in the process.</p><br/><p>He had not expected that none of the thousands of races out there could create a treasure such as the one that the ancient race chiliarch had wielded. The only things they could create were some basic weapons with basic properties.</p><br/><p>It was as though there were two countries at war. However, one could only create cold weapons weapons while their rights to create firearms were entirely revoked.</p><br/><p>But why was it that Lin Fan himself could craft those treasures?</p><br/><p>Could it be due to the system?</p><br/><p>Lin Fan did not understand at all. However, it did seem as though there was still nothing that the system couldn't do. Seemed like this was a function that belonged completely to the system.</p><br/><p>\"S-sir Lin! Since you don't have a sect of your own, how about you join our Star Sect?\" One of the girls nearby couldn't help but pop the question.</p><br/><p>Lin Fan frowned slightly. This was a difficult position he was being placed in.</p><br/><p>Eventually, he coughed gently and smiled, as though he had managed to find a way out.</p><br/><p>\"My gratitude for your offer. However, I'm long used to being alone. Furthermore, I'm a human. You guys are from the Star race. If I were to join your sect, it might bring about gossips and displeasure from the others.\" Lin Fan rejected her.</p><br/><p>He understood the circumstances they were in. The reason why the Star Sect had to be hidden was so that they could escape the eyes of the ancient race.</p><br/><p>Furthermore, 'If they aren't of your race, you should watch out for them.'</p><br/><p>Even if Lin Fan were to follow them back to the Star Sect with a thick skin, he might very well be rejected by them instead. Why would they let this random unknown join their sect?</p><br/><p>\"Brother Li, you were obviously betrayed for this expedition of yours. Do you have any idea who it was?\" Lin Fan asked.</p><br/><p>\"I've already got a target, but I'm not exactly certain. Once I head back, I'll definitely report this incident. After all, this is a threat we must definitely get rid of. Otherwise, it would definitely be a calamity for our sect in the future.\"</p><br/><p>Li Tianquan's eyes flashed with a killing intent. It was as though he was burning with hatred towards this traitor in their midst.</p><br/><p>\"Brother Li, I think that we should be safe by now. It should be time to leave. Let us part ways from here.\" Lin Fan stood up.</p><br/><p>\"Alright. If we meet again in the future, I'll definitely thank you heavily once more. Brother Lin, I've got a map over here. There are some ad hoc refugee camps that are set up by the thousands of sects out there. If you ever encounter any difficulties, you can head over there.\" Li Tianquan handed a map over to Lin Fan.</p><br/><p>Lin Fan nodded his head and kept the map. The Ancient Saint World was such a huge place. He couldn't possibly understand this entire world just like that.</p><br/><p>Saving these people from the Star Sect was nothing more than an incidental occurrence.</p><br/><p>Even if the Star Sect were willing to accept Lin Fan as a disciple, he wouldn't go over given his character.</p><br/><p>After all, he was the Grandmaster of the great Saint Devil Sect. He was the one who was going to open up Saint Devil Sect in this Ancient Saint World one day.</p><br/><p>How could someone like him be the disciple of another sect?</p><br/><p>\"Farewell…\" Lin Fan cusped his fists. Instantly, he disappeared from the spot where he stood. The mythical prowess of the Earth spirit river was shown fully at this very moment.</p><br/><p>...</p><br/><p>\"Senior brother, this Sir Lin does not seem like a bad person! Wouldn't it be great if we could have pulled him into our sect?\" The female disciple asked.</p><br/><p>Li Tianquan looked over at his junior sister and shook his head, \"Junior sister, you must always remember never to let your guard down in front of others. Even if he's your lifesaver, you never know if there are any plots hidden behind that lifesaving act. Furthermore, that person is extremely powerful. He's definitely not someone our Star Sect can handle.\"</p><br/><p>\"Oh…\" The girl replied with a look of disappointment, evidently unable to forget Lin Fan's face. After all, it was difficult to find someone with whom one could feel an affinity these days.</p><br/><p>Li Tianquan looked at this group of junior brothers and sisters and couldn't help but feel exasperated. They were still too naïve. After all, they hadn't been through much in life yet…</p><br/>\n</div>"}