{"title": "Chapter 494: A Sweeping Sword Will", "id": 494, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-494-a-sweeping-sword-will", "volume_title": "Volume 5", "body": "<h1>Chapter 494: A Sweeping Sword Will</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 494: A Sweeping Sword Will</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Hehehe…!\"</p><br/><p>The ancient race soldiers jeered as they inched closer towards those of the Star world. Those invasive gazes they cast on the two women were more chilling than ever. At the end of the day, the ancient race was still the most disgusting race in the entire Ancient Saint World.</p><br/><p>If these two women were to be ravished by such beings, they wouldn’t even have the will to commit suicide.</p><br/><p>\"Senior brother…!\" These two female disciples hid behind Li Tianquan closely. However, at this point in time, Li Tianquan was close to breaking down physically. His wounds had started spreading, and he could barely move a muscle.</p><br/><p>\"ANCIENT RACE! DON’T YOU GO OVERBOARD!\" Li Tianquan howled. He knew that if no one were to step in this situation, the outcome of his two junior sisters would be beyond nightmarish.</p><br/><p>\"Overboard? The ancient race is blessed by the Heaven’s Will of the Ancient Saint World. Everything we do is in accordance to the Heavens. In fact, it’s their good fortune that my fellow race beings could even take a liking to them. This is an honor beyond what their lives are even worth!\" The ancient race chiliarch guffawed out. The more these ants struggled, the more excited he got.</p><br/><p>\"YOU…!\" Li Tianquan’s eyes were bloodshot right now. However, there was nothing he could do. If he knew that this would be the case, he would have never brought them along no matter the circumstances. But, it was all too late by now.</p><br/><p>\"DON’T YOU COME OVER! DON’T YOU GUYS DARE TO TOUCH OUR JUNIOR SISTERS!\" The other three men were pale as well as they glared at these ancient race tribesmen with trembling hands. They were truly afraid right now.</p><br/><p>\"We’ll just eat up these three later on then. They should taste pretty decent.\"</p><br/><p>\"That’s right. I heard that beings of the Star world are filled with the taste of the power of the stars. That should be pretty delicious!\"</p><br/><p>\"HAHA…! Know your places, trash! How dare you trashes come and act so insolently in our ancient race territory?\"</p><br/><p>...</p><br/><p>As the ancient race soldiers got ever closer, the only things that were looming on the minds of these Star world beings were just clouds of despair.</p><br/><p>This despair rose like a surging foam within them; there was no escape at all.</p><br/><p>\"We must absolutely not let these foul things defile our bodies!’ Suddenly, the frightened looks on those two women turned into a firm and resolute expression.</p><br/><p>\"HAHA! Here we come…!\" The ancient race beings stretched out their dirty hands.</p><br/><p>\"STOP…!!!\" Li Tianquan howled in anger. However, the only things that he got in return were sniggers and jeers.</p><br/><p>...</p><br/><p>\"All of you, stop right there! How dare you bunch of beasts commit acts of such indecency under the glorious daylight? This is disgusting! Where are your morals?\"</p><br/><p>Suddenly, a clear voice rang out from the distance.</p><br/><p>\"Who’s there?\" Li Tianquan’s heart jerked momentarily. To them, the assistance of anyone right now would be a form of salvation!</p><br/><p>The chiliarch of the ancient race frowned as he looked into the distance.</p><br/><p>Far in the distance, a man walked over calmly with his hands behind his back.</p><br/><p>Lin Fan had not expected to see such vile acts upon arriving in his place. However, coming across something like this had him quite elated.</p><br/><p>These were the type of things he loved coming across the most. Not only could he rescue people, he would even play off a wonderful act.</p><br/><p>Ever since he arrived in the Ancient Saint World, it had been pretty difficult for him to carry out acts due to his lack of power. After all, everything relied on brute power. If he didn’t have power, all his acts of bullsh*t could easily turn him into a real pile of sh*t.</p><br/><p>But now that he had increased his power level, Lin Fan was filled with confidence about himself as well.</p><br/><p>To him, other than the leader of these ancient race beings ahead, the rest were simply cannon fodder.</p><br/><p>Li Tianquan looked at the man who was approaching in utter bewilderment, wondering who it could be.</p><br/><p>However, upon realizing that the help was only a single person, he couldn’t help but worry again once more. This was a chiliarch of the ancient race they were talking about! Not only that, he was an azure celestial middle-level being!</p><br/><p>\"All of you can relax now. With me around, these ancient race beings can’t do anything to you guys.\" Lin Fan replied calmly. That relaxed expression on his face seemed to be telling everyone that this was a casual matter that he could brush off really easily.</p><br/><p>\"Such bold words! Who are you?\" The chiliarch laughed icily. He couldn’t be bothered much with this new person who had arrived now. To this ancient race chiliarch, all those beings from the thousands of races out there were nothing but mere ants.</p><br/><p>Lin Fan chuckled. Ignoring the chiliarch completely, he walked over to Li Tianquan.</p><br/><p>All the other ancient race soldiers barked fiercely at this random guy who was just walking over.</p><br/><p>\"We’ll eat him up…!\" These ancient race soldiers hollered as they leaped at Lin Fan.</p><br/><p>\"Beware…!\" Li Tianquan exclaimed out in reflex.</p><br/><p>Looking at ancient race soldiers, Lin Fan smirked.</p><br/><p>\"A bunch of beasts. Know your places.\" Lin Fan could not care less about these soldiers. With a wave of his hand, a sweeping Sword Will burst out through the entire place.</p><br/><p>One by one, these materialized Sword Wills pierced through the void and tunneled through the bodies of these soldiers.</p><br/><p>‘Ding…Congratulations on killing utmost celestial full cultivation ancient race soldier.’</p><br/><p>‘Ding…Experience points +…’</p><br/><p>...</p><br/><p>The experience points given by these soldiers were so little that they were practically negligible to Lin Fan.</p><br/><p>...</p><br/><p>\"Huh…?\" Looking at how this man who had just arrived could slay these ancient race soldiers with just a sweep of his hand, Li Tianquan was absolutely astounded.</p><br/><p>Powerful being!</p><br/><p>This was an absolutely powerful being!</p><br/><p>\"You’re from the Sword world?\" The chiliarch naturally assumed this random person who had arrived to be from the Sword world given his incredible mastery of the Sword Will. After all, only those from the Sword world could possess such a devastating Sword Will!</p><br/><p>\"Fellow brother, are you alright?\" Once again, Lin Fan ignored the chiliarch completely as he looked at Li Tianquan calmly.</p><br/><p>This gaze of Lin Fan!</p><br/><p>This expression of his!</p><br/><p>This calm disposition!</p><br/><p>All of these qualities spread out through the entire place immediately.</p><br/><p>Looking at the man before him, Li Tianquan’s heart could not help but skip a beat in gratitude. He then cusped his fists thankfully, \"My utmost gratitude for the assistance of a Sword race member. Li Tianquan could not ever thank you enough.\"</p><br/><p>Lin Fan chuckled casually as he tossed over a pill, \"I’m not from the Sword world. Here, this is a pill that can heal up your injuries.\"</p><br/><p>Looking at this golden pill in his hand, Li Tianquan popped it down without hesitation after thanking Lin Fan once more. He then entered a recuperative state.</p><br/><p>\"Thank you for saving us!\" The two women looked at this man with an exceptional demeanor. Those pretty, tender faces of theirs blushed slightly.</p><br/><p>\"It is my principle as someone from the human race to lend my assistance against any injustice I bump into in this pugilistic world.\" Sweeping his robes, Lin Fan raised his head gently towards the sky and replied.</p><br/><p>Looking at this stylish pose of Lin Fan, the two women from the Star Sect could not stop their palpitating hearts as they lowered their heads gently in shyness.</p><br/><p>In their hearts, they were fluttering, ‘This man is so cool! He’s so charming…!’</p><br/><p>Li Tianquan, who was recuperating right now, was stunned at these words as well. He had not expected this man to be of the human race!</p><br/><p>After all, the human race was a really rare sight these days.</p><br/><p>...</p><br/><p>\"YOU B*STARD! I’m the great chiliarch who’s talking to you right here! Can’t you hear me? I’m going to bloody eat you up! Do you believe me?\" This chiliarch who was floating in the sky yelled out consistently. He had not expected this man to disregard his words entirely! This caused him to feel really upset.</p><br/><p>He was a great chiliarch of the ancient race! Even within the race, he was an esteemed figure! To think that he was being ignored by an ant of the thousands of races out there right now! Outrageous!</p><br/><p>\"Hmph! I’ve never felt the need to communicate with scums who are about to die.\" Lin Fan turned his head around. As he did so, a gentle breeze picked up and sent his long hair fluttering gracefully in the air. That calm disposition erupted out even further.</p><br/><p>\"So…cool!!!\" Looking at Lin Fan’s back view, those two female disciples could almost feel their whole hearts popping out!</p><br/><p>Lin Fan smiled gently.</p><br/><p>Seemed like maintaining his cool was still the best way at attracting attention.</p><br/>\n</div>"}