{"title": "Chapter 495: This Dazzling Grace Is Unparalleled In The World!", "id": 495, "volume": 5, "url": "http://boxnovel.org/the-strongest-system-chapter-495-this-dazzling-grace-is-unparalleled-in-the-world", "volume_title": "Volume 5", "body": "<h1>Chapter 495: This Dazzling Grace Is Unparalleled In The World!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 495: This Dazzling Grace Is Unparalleled In The World!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Insolent! So damn bloody insolent! Anyone who had dared to speak with me as such has already been devoured by me! To think that even a puny Sword race being such as yourself would dare to do the same before me? You must be really tired of living!\" The ancient race chiliarch's face was malevolent right now. That furious gaze of his was like he was bent on devouring Lin Fan.</p><br/><p>\"Yours Truly is not from the Sword race! Yours Truly is a human! Don't think that anyone who plays with swords is from the Sword race, you idiot!\" Lin Fan looked at the ancient race chiliarch in the sky calmly without a single bit of fear.</p><br/><p>Azure celestial middle level.</p><br/><p>Even though he could not deny that this was a pretty strong cultivation state, it still wasn't enough to take down Lin Fan. Things MIGHT get a little tricky later on, but that would depend on the situation as well.</p><br/><p>\"Human…HAHAHA! That's the ant race that has remained as cowards for the past 10,000 years! What a living joke!\" The ancient race chiliarch laughed out in disdain. His face then turned cold immediately, \"You shall lay down your life as well for killing my fellow ancient race tribesmen!\"</p><br/><p>\"HAHA! Anyone can lay down threats. But if you've got the guts, you better come at me with all you've got. Otherwise, you're gonna die regretting you didn't do so.\" Lin Fan guffawed as he beckoned to the ancient race chiliarch with his hands.</p><br/><p>\"Hmph! I don't need my full strength to take you down!\" The chiliarch's face turned stern as a massive amount of energy surged out from within his body.</p><br/><p>'Moving Mountains!'</p><br/><p>Suddenly, the body of the ancient race chiliarch turned into a streak out light as he burst out at Lin Fan.</p><br/><p>\"Watch out…!\" Li Tianquan warned cautiously at this scene.</p><br/><p>\"Ant of the human race! This chiliarch here shall tear you down into pieces!\" The ancient race chiliarch hollered. Surrounded by a black mist of light, he tore through the void.</p><br/><p>A series of explosions boomed out across the Heavens and Earth.</p><br/><p>\"Oh? You wanna come at me head on? You're practically asking to be humiliated.\" Lin Fan could not help but burst out laughing at the way this chiliarch chose to attack. With a war cry, Lin Fan burst out from the ground himself to receive the blow.</p><br/><p>\"HAHA! You guys of the human race are just puny and feeble! To clash with my innately strong body of the ancient race? You're just asking for it!\" The chiliarch could not stop laughing as though he was facing the biggest joke in this world.</p><br/><p>The ancient race tribesmen were born with a strong body to begin with. As they grew up with time, their bodies only got stronger to unimaginable standards. Amongst the thousands of races out there, the Vajra race stood out particularly in terms of physical body toughness. However, even they themselves could not deny the prowess of the ancient race's physical body state.</p><br/><p>Just taking one of the previous utmost eight beings, the Ancient One, as example, even after he was severed into pieces, he was still alive. At the same time, each individual body part of his retained a bit of his consciousness.</p><br/><p>Even the current Lin Fan did not possess that sort of an unfathomable power.</p><br/><p>One could even describe those powers as divinely.</p><br/><p>However, Lin Fan could not be bothered with the physical body state of this chiliarch before him.</p><br/><p>'Eternal Immortality' had long been evolved by Lin Fan into this peerlessly supreme physical body skill. If one were to max out its level, it would provide even more miraculous abilities. That wasn't something that some pariah ancient race tribesmen could compete with.</p><br/><p>\"You're just courting death!\" Lin Fan laughed coldly. Churning out Blood Sea, the Blood Qi within his body rumbled continuously. That boundless amount of Blood Qi surrounded his entire body densely as his body gleamed with a red glow.</p><br/><p>BAM!</p><br/><p>A gigantic explosion sounded.</p><br/><p>\"H-how could this be…?\" The chiliarch had thought that he had this human for sure! But to his astonishment, clashing with this human was like clashing against a mountain! This man was like an immovable force that was just rampaging forth!</p><br/><p>BAM!</p><br/><p>Under this immense force produced by Lin Fan, the body of the ancient race chiliarch changed rapidly. A dent formed in his chest as he coughed out a mouthful of stinky, fresh blood.</p><br/><p>\"How could a human like you possess such a strong physical body state? Impossible! Absolutely impossible…!'\" That massive body of the chiliarch collapsed onto the ground in a thud as a look of shock spread out across his face.</p><br/><p>He could not believe that a single human could be this strong! To think that even the body, about which they were so proud of as ancient race tribesmen, could not match up against this human!</p><br/><p>\"Hmph! Pitting your physical body against Yours Truly? That's like an amateur trying to perform his stunts in front of a master!\" Lin Fan laughed back coldly with his strike.</p><br/><p>Even though Eternal Immortality was strong, that wasn't all there was to it. With the addition of Blood Sea, he was practically unparalleled.</p><br/><p>If he could train up to its fullest potential, Lin Fan had the confidence that he could make a mess out of this world with just his physical body state alone!</p><br/><p>By now, Li Tianquan was absolutely flabbergasted by the sight before him. It was hard to imagine that there was someone in the thousands of races out there that could just compete with an ancient race tribesman with just his physical body state alone!</p><br/><p>That was just completely horrifying!</p><br/><p>Back in the Star world, Li Tianquan was an overlord that reigned supreme over the four regions of his world. Even though most of his skills were related to attracting the powers of the stars, there was also an aspect of that which would boost their physical body states. However, even that amount of strengthening could hardly match up to just the innate physical body states of these ancient race tribesmen to begin with.</p><br/><p>Therefore, the fact that this human could stand up to the ancient race tribesman's physical body state was even more shocking to him.</p><br/><p>\"Just what sort of skill is he cultivating?\" Standing there, Li Tianquan looked at Lin Fan with absolutely bedazzled eyes. His heart was filled with bewilderment.</p><br/><p>Even though working on improving one's physical body state could bring about tremendous benefits, everyone knew that the path to achieving it was extremely arduous and tremendous.</p><br/><p>Li Tianquan had once come across a man who died in the path of training up his physical body state. Both his physical and mental state were shattered as he was eaten alive by the pain of it all.</p><br/><p>\"Senior brother, he's so strong!\" The three junior brothers of his stared at this human who had saved them. To think that he could take down this chiliarch all by himself was an amazing feat!</p><br/><p>At the same time, they were overwhelmed with joy. This meant that they would no longer have to die at this place!</p><br/><p>As for those two female disciples, their gazes were long intoxicated by that dazzling Lin Fan. That single clash of the physical bodies moved ripples within their hearts as well.</p><br/><p>In their entire lives, Lin Fan was the manliest of all men they had come across. How imposing! How mighty!</p><br/><p>...</p><br/><p>\"B*STARD! YOU DAMNED B*STARD! HOW DARE YOU MESS ME UP LIKE THIS? I SWEAR THAT I'LL DEFINITELY TEAR YOU UP!\" The ancient race chiliarch howled in fury. That dent in his chest rose up once more as though nothing had happened to it.</p><br/><p>\"YOU DAMNED HUMAN! YOU'VE COMPLETELY RILED ME TO NO ENDS! I SHALL HAVE YOU KNOW THAT ANYONE WHO MESSES WITH AN ANCIENT RACE CHILIARCH SUCH AS MYSELF WILL COME TO NO GOOD END!\"</p><br/><p>Suddenly, a sinister aura burst forth from the chiliarch's body.</p><br/><p>A string of beads shot out from his body.</p><br/><p>The moment this string of beads came forth, Lin Fan's eyes frowned.</p><br/><p>It wasn't that the string of beads was extremely strong. However, the aura that was being emanated was pretty weird. Lin Fan who, had been consistently searching for the ways to craft out true weapons, was someone who was especially sensitive to such auras.</p><br/><p>\"That's a treasure! How could an ancient race chiliarch such as yourself possess that true treasure?\" The moment Li Tianquan caught sight of that string of beads, the color drained from his face.</p><br/><p>\"Watch out! Those are some extremely strong beads he's wielding!\" Li Tianquan warned Lin Fan warily.</p><br/><p>\"HAHA! Not bad. To think that would recognize the powers of this treasure. Let me tell you then! The reason why all of you from the thousands of races out there aren't able to craft out true treasures is because the Heaven's Will of the Ancient Saint World is always watching out for the ancient race tribesmen! All of those trash items that you guys craft are nothing in the eyes of the ancient race!\" The ancient race chiliarch continued his maniacal laughter.</p><br/><p>\"Hehehe…! This string of beads in my hands was created from the vengeful grudges of 999 different races! And you, human? You shall be the 1,000th! With that, these Soul Devouring Beads would truly break through! HAHAHA…!\"</p><br/><p>...</p><br/><p>Lin Fan's brows creased. What the hell did that mean? Could it be that a true treasure was something like that thing in the hands of this ancient race chiliarch? And the reason why anyone from the thousands of races out there couldn't craft them was because they were restricted by the Heaven's Will of this world?</p><br/><p>If that were the case, then what the hell was up with Yours Truly's Demon City and Flying Heavens?</p><br/><p>'Forget it. I'll think about that later. Time to take him down first.'</p><br/>\n</div>"}