{"title": "Chapter 501: Self-Destruct, My Brother!", "id": 501, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-501-self-destruct-my-brother", "volume_title": "Volume 6", "body": "<h1>Chapter 501: Self-Destruct, My Brother!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 501: Self-Destruct, My Brother!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan had not expected this middle-grade Dao weapon of Long Xuan to be this powerful. There was practically no chance given at all! However, now that Long Xuan was focusing totally on expelling the effects of Biggra from his body, there was literally no better chance than now for Lin Fan to escape!</p><br/><p>Biggra was definitely a mythical pill. So what if the other party was a desolate celestial upper-level being? He still had to use up all his attention just so he could deal with Biggra.</p><br/><p>As long as he could make it out of this place safely, Lin Fan was certain that he would have to improve on the effects of Biggra, such that even a little bit of it was enough to cause anyone to break down entirely.</p><br/><p>Long Xuan stood there in a half man half dragon figure. His long hair was floating on the back of his body like a horse’s mane dancing in the breeze. His mouth was wide open, absorbing all the essence of the Dragon world, converting it into white dragons as they were infused within his body.</p><br/><p>This fella was just borrowing external strength to expel the medicinal effects of Biggra! All of these methods were causing Lin Fan to be amazed.</p><br/><p>\"Lad, you’re pretty decent to be able to force me to this state. I’ll admit that I’ve been careless.\" Even while Long Xuan was in this devouring state, he was keeping a close eye on Lin Fan. Not only was this lad tricky, he was sneaky and crafty. No one knew what sort of methods he would deploy next.</p><br/><p>\"Hmph…!\" Lin Fan snorted coldly as he took back his Eternal Axe, \"You’re a traitor, Long Xuan! Don’t act high and noble before me! Yours Truly isn’t afraid of death!\"</p><br/><p>‘Nirvana Finger!’</p><br/><p>‘Deflowering Finger!’</p><br/><p>Even though Lin Fan’s body was rooted right now, he had long since mastered these two skills to an impeccable level. He could conduct attacks from any part of his body.</p><br/><p>A crisp exploding sound boomed out as a boundless amount of energy struck out at the Binding Dragon Whip. However, just as Lin Fan was retaliating, the electric dragon sent out an electric shock that cruised itself through Lin Fan’s entire body. This devastating aura suppressed Lin Fan’s consciousness.</p><br/><p>\"Give it up. This Binding Dragon Whip isn’t something that you can break out of. Even the mighty Heavenly Dragon of the Dragon World would have to bow down like a worm against the might of this powerful Binding Dragon Whip.\" The redness of Long Xuan’s eyes was gradually dissipating. It was evident that he had already expelled a large amount of Biggra from his body.</p><br/><p>\"You…!\" Lin Fan was all ready to cuss at his mother right now. How dare this despicable b*stard use such means to lock down Yours Truly?</p><br/><p>If only Yours Truly were that bit stronger, he would definitely be able to rip this Binding Dragon Whip to shreds!</p><br/><p>The more Lin Fan struggled, the tighter the Binding Dragon Whip coiled around him. It was like the incantation of the golden hoop, tightening against Lin Fan mercilessly.</p><br/><p>‘Heaven and Earth Consciousness!’</p><br/><p>Long Xuan hollered out suddenly, creating a thousand feet long golden dragon that glowed with a golden shine. Devouring the Saint Spirit Energy of the Heaven and Earth, the golden dragon coiled itself around that half man half dragon figure of Long Xuan.</p><br/><p>Long Xuan was using up all his powers to expel out that unspeakable and strange energy. At the same time, he was astonished by it. Just what sort of an object was it that could create such a devastating impact?</p><br/><p>He was a desolate celestial upper-level being! He was only two states away from being a divine celestial, a state where he’d be practically invincible, and could do everything, including taking down the skies and moon themselves.</p><br/><p>To think that this mysterious force would require him to expend all his powers just to resist it. That was incredible!</p><br/><p>\"Good. Very good!\" Suddenly, Long Xuan burst out laughing. His words made no sense at all.</p><br/><p>‘Holy sh*t. By the looks of it, this guy is almost completely done with expelling the effects of Biggra! If I’m not done by then, things would be really tragic.’</p><br/><p>Why the hell was Yours Truly always bumping into sick freaks like these?</p><br/><p>If only Biggra’s effects were that BIT stronger, Yours Truly wouldn’t be in this terrible state right now!</p><br/><p>‘Forget it…’ Lin Fan had a plan in mind. With the way things were turning out, seemed like he could only rely on that move now.</p><br/><p>\"HAHA…!\" Suddenly, Lin Fan howled out into the skies and laughed.</p><br/><p>\"Lad, what are you laughing at?\" Looking at Lin Fan who was apprehended in his grasp, Long Xuan was bewildered. At the same time, his curiosity towards Lin Fan was only deepening by the second.</p><br/><p>\"What am I laughing at? Naturally, I’m laughing at YOU, duh? A traitor like you who would sell his life to the ancient race is nothing but a humiliation to the thousands of races out here. And you would dare to ask me what I’m laughing at?\" Lin Fan glared at Long Xuan straight in the eye. No matter what, this was going to be his last-ditch effort. He had to leave down a legend at the very least.</p><br/><p>Long Xuan was neither angered nor happy. He did not put Lin Fan’s words to his heart at all. After all, he knew that these were truths to Lin Fan. But at the end of the day, who could truly understand the circumstances of Long Xuan?</p><br/><p>\"Death isn’t something that is scary. The scariest thing is to lead a life that is worse than death itself. To think that a desolate celestial such as yourself would bow down under the might of the ancient race and live life as a coward. You’re truly disgusting.\"</p><br/><p>\"You wanna take Yours Truly back? How could Yours Truly accede to that request? LET YOURS TRULY SHOW YOU THE TRUE MIGHT OF THE HUMAN RACE TODAY!\" Lin Fan hollered out as a massive amount of energy burst out from his body. This energy was wild and unrestrained, as though it could take down the entire Heavens.</p><br/><p>\"What are you doing?\" Looking at the massive amount of energy being emanated out from the human, Long Xuan’s heart jerked for a moment, as he could not help but start to panic.</p><br/><p>\"Hmph! Even if Yours Truly is going to die, I’m going to take your Binding Dragon Whip along with me to the graves! EXPLODE!\" With a mad holler, Lin Fan’s body began rupturing. One by one, ripples of energy began to gush out of his entire body. This was every single last bit of hidden power within Lin Fan’s body.</p><br/><p>\"S-stop…!\" Long Xuan’s face changed immediately. To think that this human would self-destruct!</p><br/><p>\"HAHA! ARE YOU FEELING SAD FOR YOUR BINDING DRAGON WHIP RIGHT NOW? IT’S TOO LATE!\" Lin Fan looked over at Long Xuan as his hair flew around wildly in the skies.</p><br/><p>BAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM!</p><br/><p>A dazzling brilliance exploded out as that electric dragon that was coiling around Lin Fan howled out as well. However, in an instant, it was overwhelmed by that massive surge of energy.</p><br/><p>Blood sprayed out all over the skies as the entire Heavens and Earth fell silent. Within the void, there was nothing left of Lin Fan or the Binding Dragon Whip.</p><br/><p>\"W-why did it turn out like this…?\" Long Xuan was stumped. The Blood Qi within his body rumbled once more as he clutched at his chest, spurting out a mouthful of blood.</p><br/><p>Unable to believe the sight before him, Long Xuan’s mental focus was shaken as well. With that, the Saint Spirit Energy within his body began to clash with the effects of Biggra, causing that rumbling of his blood once more.</p><br/><p>\"Why would he choose to blow himself up…? I-I had already promised him his safety…!\" After Lin Fan’s self-detonation, Long Xuan was extremely shaken at this moment.</p><br/><p>\"ARGHHHHH…!!!\" A long howl rang out through the skies as Long Xuan’s eyes were bloodshot. Shifting his body, he turned into a gigantic dragon and broke through the void. With a single swipe, he caused the void to rip apart as he vented out every single bit of frustration in his heart.</p><br/><p>\"TO THINK THAT I WOULD FORCE HIM TO HIS DEATH!!!\"</p><br/><p>Long Xuan had only wanted to take Lin Fan back with him. To think that this human’s reaction would be this extreme!</p><br/><p>The skies lost all their color as Long Xuan continued to howl out emotionally before leaving eventually.</p><br/><p>...</p><br/><p>At that moment, a drop of blood on the ground seemed to have gained a life of its own. It waited silently before seeping into the ground and tunneled into the distance.</p><br/><p>A few thousand miles away from that place…</p><br/><p>‘Rebirth through Blood!’</p><br/><p>With its own life, this drop of blood vibrated immensely before it started expanding, forming a blood figure.</p><br/><p>Nirvana’s Rebirth.</p><br/><p>This blood figure was none other than Lin Fan, who was reborn through his blood.</p><br/><p>...</p><br/>\n</div>"}