{"title": "Chapter 502: Cultivate Every Single Skill", "id": 502, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-502-cultivate-every-single-skill", "volume_title": "Volume 6", "body": "<h1>Chapter 502: Cultivate Every Single Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 502: Cultivate Every Single Skill</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>‘To think that the only way for me to escape was to self-destruct!’ Lin Fan, who had just revived, was feeling especially emotional in his heart right now. This was the first time he had self-detonated. If Rebirth through Blood had not worked at that instance, he would have been shammed to the depths of hell!</p><br/><p>That was the gamble that Lin Fan had to take.</p><br/><p>But by the looks of it, Rebirth through Blood was working perfectly fine. He couldn’t find any parts of him missing. The only thing that was causing him a big headache was the fact that his energy had been thoroughly exhausted.</p><br/><p>Seemed like the amount of energy required for a single rebirth was pretty immense.</p><br/><p>If an ancient beast that was even slightly strong were to appear right now, he might very well lose his life to it. Therefore, in consideration for his safety, Lin Fan decided to seek shelter and hide for now first.</p><br/><p>Without giving it too much thought, Lin Fan tunneled straight into the ground. He then channeled his Mythical Parasol Tree and began to replenish his strength.</p><br/><p>In the Ancient Saint World, the Mythical Parasol Tree was like a fish which had just discovered water. It was completely at home here, sprouting ever more lushly and producing an even greater amount of lifeforce.</p><br/><p>Lin Fan knew that even though he looked strong on the surface, he was actually pretty weak right now. If he met a truly strong opponent, he could probably have enough strength to protect himself from dying. However, there was practically no way he could take down his opponents.</p><br/><p>But that fact alone caused Lin Fan to feel somewhat displeased. After all, he was a man with a system! How could he be tied down by something such as mere cultivation states! If he couldn’t just kill things that were beyond his levels, what was he living his life for?</p><br/><p>‘This system is being too weak these days, isn’t it? Back when Yours Truly had stolen my own peaches, this system gave me an actual title. Why the hell am I not given any sort of acknowledgment for doing something as wild as blowing myself up?’</p><br/><p>Lin Fan felt that the system was really being too stingy this time around. To think that he wouldn’t get a single reward out of it at all!</p><br/><p>That feeling of self-detonation wasn’t something that any mere person could endure. It hurt as hell man! In fact, he could feel his entire body ripping apart in that entire instant. However, the good thing was that the pain went as quickly as it came.</p><br/><p>‘Ding…Owner’s courageous self-destruction is worth commending indeed.’</p><br/><p>‘Ding…Rewarded with Essential Legendary Gear for skipping levels: Desolate celestial cultivation state mythical usage.’</p><br/><p>\"Eh…?\" Lin Fan was equal parts stunned and surprised. He was completely caught unaware by the system’s notifications.</p><br/><p>\"It’s here? It’s really here?\" Lin Fan was just lamenting about the system moments earlier. To think that the system would decide to reward him just like that! This was goddamn telepathic!</p><br/><p>The system must have been feeling bad about Lin Fan’s complaints and decided to award him with something.</p><br/><p>Of course, that possibility wasn’t entirely impossible. But this was great. Since the reward was free, why not take it? However, the name of the reward was leaving Lin Fan extremely puzzled, not knowing what this thing meant at all.</p><br/><p>‘Desolate celestial cultivation state mythical usage: Desolate celestial state is just practically a foundation state for one to get to that ultimate state of being a divine celestial. One could begin sowing seeds in preparation for becoming a divine celestial.’</p><br/><p>Lin Fan knew that the moment one attained a desolate celestial state, one could convert every single thing they had learned in their lifetime into seeds of their own. These so-called seeds allowed the skills to improve independently on their own, and boost the levels of their cultivation as well.</p><br/><p>Taking Stealth, for example, once Lin Fan reached the desolate celestial level, he could cultivate Stealth into a True Skill Stealth seed.</p><br/><p>After he was done cultivating with it, the power of that skill would rise by a significant amount. But of course, the prerequisite for doing that was the skill must first be raised to a certain level.</p><br/><p>For someone like Lin Fan who could start sowing such seeds as an azure celestial right now was totally unheard of. There was never a precedent to such a thing in the entire Ancient Saint World!</p><br/><p>‘Not bad, not bad…!’ Lin Fan let out a gleeful smile. Seemed like he did gain quite a bit out of this eventually!</p><br/><p>Suddenly, Lin Fan’s mind felt clearer than ever. It was as though countless wisdom plates were revolving around his mind, opening up a sea of knowledge to boost all parts of his mental state.</p><br/><p>This sudden feeling caused Lin Fan to freeze up for a slight moment. All sorts of things he couldn’t think through in the past were suddenly clear as day right now.</p><br/><p>Even if he were a mere mortal, he would definitely be able to master any skill with just a single glance of his eyes. His cultivation state would also grow at lightspeed!</p><br/><p>‘I’ve struck gold…! I’ve mother*cking struck gold this time around!’ Lin Fan was so excited he did not know what he could do next. He wanted to climb out of the ground and dance in celebration.</p><br/><p>But soon enough, he knocked back some sense into himself. If he did that, he would undoubtedly just be courting death.</p><br/><p>If he were down on his luck and bumped into a powerful being or an ancient beast, he would die so bad he wouldn’t even know how he died.</p><br/><p>Lin Fan lied on the ground silently. He had wanted to start cultivating some seeds. However, he found out that the True Energy required to cultivate those seeds was way too much for his empty vessel to handle right now. Even if he managed to cultivate them, it would be an issue for him to even employ those skills after that.</p><br/><p>Twisting Heaven and Earth.</p><br/><p>True Origins Crushing Kick.</p><br/><p>Even though all of these looked like simple moves on their own, Lin Fan was the only one who understood the immense amount of energy required to use those moves.</p><br/><p>For example, even though Twisting Heaven and Earth, or as one could loosely term it, Monkey Steals Peaches, was just a simple grab, the amount of energy required for that grab was astonishing. If not for the fact that Lin Fan had the system, he could never have raised it to this state with just his mere abilities.</p><br/><p>One day passed…</p><br/><p>Lin Fan opened his eyes as a huge amount of energy burst out forth. The power in his body had recovered.</p><br/><p>Based on Lin Fan’s current power level, that amount of energy could hardly ever be exhausted. It was like a gigantic river that would never dry up. However, given the fact that his self-destructing act had managed to expend every last drop of that, one could imagine the massive amount of energy required for one to undergo Rebirth through Blood.</p><br/><p>Seemed like Lin Fan had to watch out for this point from here on forth as well. It might not be possible for him to rely on this skill just to kill an opponent.</p><br/><p>However, regarding life preservation, this skill was definitely godly.</p><br/><p>Right now, Lin Fan did not have the intentions to head out at all. All he wanted to do was to cultivate those seeds. Furthermore, being hidden underground seemed to be an extremely safe option right now. Who knew what type of sticky situations he might end up with once he got out.</p><br/><p>\"Hmm, let’s see. For the first seed, I should probably cultivate Eternal Immortality.\" Lin Fan knew that his current strength was far from topping the entire world. He might as well work on his defenses first.</p><br/><p>‘Cultivate!’</p><br/><p>Lin Fan churned his Eternal Immortality. This skill had already been raised to such an exceptional level by him. It was bound to be ready for cultivation.</p><br/><p>Instantly, Lin Fan felt a burst of energy gushing out in all directions within his body. This energy that was being emanated gathered and turned into a vortex within his body.</p><br/><p>‘I-It’s difficult indeed!’ Lin Fan finally realized how much energy cultivating a single seed required.</p><br/><p>Just with this initial step of forming a seed, he had already used up 10% of his entire strength! Seemed like nothing in this world was truly as simple as he might have thought.</p><br/><p>But to Lin Fan, no matter how difficult it would be, he still had to make it a success. After all, turning strong was the only way to ensure that he would never be suppressed by anyone in his path forward.</p><br/><p>‘Cultivate!’</p><br/><p>...</p><br/>\n</div>"}