{"title": "Chapter 516: Trying To Scam Yours Truly?!", "id": 516, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-516-trying-to-scam-yours-truly", "volume_title": "Volume 6", "body": "<h1>Chapter 516: Trying To Scam Yours Truly?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 516: Trying To Scam Yours Truly?!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Little buddy there, you can't go on absorbing the rest of the killing intent here any longer. Otherwise, the Infinite Slaughter Ancient Realm will cease to exist altogether.\"</p><br/><p>Just as Lin Fan was preparing to absorb the rest of the killing intent, this unknown voice rang out in his ears from nowhere.</p><br/><p>\"Who's there!\" Lin Fan frowned. To think that there would be someone else within this Infinite Slaughter Ancient Realm! And he had got some capabilities, for him to avoid detection by Lin Fan.</p><br/><p>\"Who I am does not matter. But please, little buddy, please have mercy and spare the remaining killing intent in this place.\" The voice rang through once more. It was calm and relaxed, without any bit of change in it.</p><br/><p>Lin Fan checked out his surroundings warily. Other than the musky dust all around him, there was nothing else.</p><br/><p>But where in the world was this voice coming from? That was weird indeed.</p><br/><p>'Since there's this bit left, leaving it would not help much either. I might as well suck it all in.' Lin Fan did not know who the other party was. However, if Yours Truly were such an obedient person, he wouldn't have lived the way he had until today.</p><br/><p>If this person had truly wanted to keep the killing intent intact, he wouldn't have chosen to keep himself hidden from the start till now. This person would have appeared to stop him the moment he had started that berserk suction of the killing intent earlier on.</p><br/><p>But by the current situation, it was evident that this fella's intent was not to kill him. Did this mean that he was afraid of Yours Truly?</p><br/><p>Furthermore, even though Lin Fan had received some bounties upon entering this Infinite Slaughter Ancient Realm, he hadn't gotten anything that was superbly big. Thus, that left him pretty displeased.</p><br/><p>\"No…! The killing intent has a self-regenerating property. Even though it may take a couple of hundred years for the killing intent to recover to its initial state, if you suck it dry completely, the entire Infinite Slaughter Ancient Realm will be destroyed and disappear from the Ancient Saint World forever.\" The voice rang out once more, this time a little more hurried.</p><br/><p>\"Let it be destroyed then! Yours Truly has made a round trip here without obtaining a single treasure! How can I be satisfied leaving here without anything at all? Even though this killing intent isn't anything majestic, it can serve as a consolation prize at least!\" Lin Fan wanted to see how the other party would react to this statement.</p><br/><p>The mysterious voice remained silent for some time without speaking up.</p><br/><p>\"Could I persuade you to leave if I gave you a treasure?\" The mystery person asked.</p><br/><p>\"Alright. But I'll have you know that I wouldn't be satisfied with just any mere treasure!\" Lin Fan had not expected this mystery person to offer him a treasure!</p><br/><p>But how could this be as well? There was no such thing as a free lunch in this world. For this person to offer him a treasure like this, someone who was unaccountably solicitous, he must be hiding evil intentions. However, Lin Fan was curious towards the identity of this mystery person.</p><br/><p>To be able to remain well hidden within the Infinite Slaughter Ancient Realm while avoiding detection altogether, Lin Fan could not deny his talent.</p><br/><p>Instantly, the void rippled as a passageway appeared before Lin Fan.</p><br/><p>'Come on in. I'll bring you over to my side.'</p><br/><p>Lin Fan checked out the passageway for a moment before striding in.</p><br/><p>Upon his reappearance, Lin Fan found himself standing before a mountain cave. Attempting to step in, the voice rang out once more.</p><br/><p>\"You wouldn't be able to enter this place. This old man here has been entrapped by those ancient race beings for tens of thousands of years now. If you are able to enter, I would have been able to leave long ago as well. The ancient race had used the Infinite Slaughter Ancient Realm as a foundation to trap me within here. If that place is destroyed, this old man here will never be able to leave ever again. Hence, I implore for you, little buddy, to show some magnanimity. This old man will not treat you shabbily.\"</p><br/><p>From that speech, Lin Fan was utterly convinced that a powerful being was residing within this place.</p><br/><p>However, he remained distrustful of these words.</p><br/><p>\"I've yet to inquire about your name, senior.\" Lin Fan cusped his fists before the mountain cave.</p><br/><p>There was a bright glow of light gleaming at the cave, as though it was a seal of sorts.</p><br/><p>Lin Fan wasn't too familiar with seals in general. Therefore, he did not know what sort of a thing that was.</p><br/><p>\"This old man here is the Patriarch Azure Saint.\"</p><br/><p>...</p><br/><p>Lin Fan had never heard of this name before. Because of that, he did not know what sort of a person this Patriarch Azure Saint was. However, Lin Fan was mindful of being wary instead of trusting the words of this Patriarch Azure Saint instantly.</p><br/><p>\"This old man here has kept a treasure hidden for some time now. It's time to compensate my little buddy, you then.\" Suddenly, the void rippled as an item appeared before Lin Fan.</p><br/><p>The moment Lin Fan caught sight of the item, his brows creased. It was a piece of talisman paper.</p><br/><p>The talisman was yellow in color, with all sorts of weird symbols inscribed on it. All of these symbols glowed with a golden shine. Lin Fan could not make out what it was.</p><br/><p>'This is the Heaven Saint Imperial Talisman. It possesses many marvelous usages. Using this could increase the grade of one's treasure.'</p><br/><p>Upon hearing these words, Lin Fan's heart swayed a little. Increasing the grade of one's treasure? He had got to be kidding, right?</p><br/><p>If that were the case and Lin Fan used this talisman on Demon City, it could instantly turn from a supreme grade spirit weapon to a dao weapon! That was bloody overpowered!</p><br/><p>\"Little buddy, all you have to do is infuse your True Energy within it and refine it. My only request is for you to not let anyone else know of this place after you get out, little buddy.\" Patriarch Azure Saint's voice rang through once more.</p><br/><p>Lin Fan did not reply as he took this shiny talisman into his hands.</p><br/><p>'Ding…Discovered Devil's Switching Talisman.'</p><br/><p>'Devil's Switching Talisman: Once the other party infuses their True Energy within it, one could exchange their bodies with the other party.'</p><br/><p>\"HOLY F*CK…!\" Lin Fan's facial expression did not change at all. However, his heart was stampeding like African wildlife right now.</p><br/><p>Heaven Saint Imperial Talisman my ass! F*ck your mother!</p><br/><p>'Indeed, it's as Yours Truly had guessed. There's no such thing as a free lunch in this world.' Lin Fan lamented within his heart. At the same time, he was filled with some curiosity towards this Patriarch Azure Saint now.</p><br/><p>Most of the time, all of these bad guys who loved to pull off these dirty tricks were just a bunch of pansies. Lin Fan did not believe that Yours Truly couldn't f*ck him up real good.</p><br/><p>Suddenly, Lin Fan's expression changed into one of immense gratitude as tears poured down his face while he cupped his fists.</p><br/><p>\"OH, MY GENEROUS SENIOR!\"</p><br/><p>\"Doesn't matter, doesn't matter! It is the great hope of the thousands of races out there for me to be able to meet with a talented little buddy of your caliber in my lifetime. How about you start refining the talisman here, little buddy? This old man here will send you on your way later on.\" Patriarch Azure Saint chirped happily.</p><br/><p>\"Oh, but there's something you don't know about, senior! As someone of the thousands of races out there, this junior here hasn't had the chance to come across a treasure at all! Even if I were to refine this talisman, it would be useless for me! I might as well leave with this talisman and hope to exchange it for a pretty good treasure out there with someone else!\" Lin Fan acted like he was filled with immense regrets and helplessness.</p><br/><p>Within the cave, Patriarch Azure Saint had not expected the other party would react in this manner! He was startled and couldn't speak for a moment.</p><br/><p>\"What's wrong with you, senior?\" Lin Fan asked on.</p><br/><p>\"Little buddy, you've got no idea. This Heaven Saint Imperial Talisman was created with this old man's tireless efforts! If you leave this Infinite Slaughter Ancient Realm, the talisman will lose its powers! As long as you refine it here and turn it into your personal possession, you can then head out there and exchange it with anyone else easily!\" Patriarch Azure Saint replied.</p><br/><p>'Holy f*ck! This guy is hell bent on scamming Yours Truly! To think that he could come up with this lame a*s reason! Who knows how many others he's managed to scam!' Lin Fan was rife with insults in his heart. However, his outer facial appearance did not change in the slightest bit.</p><br/><p>\"I guess this junior here has no choice but to refine it here then.\" Lin Fan relented.</p><br/><p>\"Good…!\"</p><br/><p>Within the cave, it was pitch black. A set of blackened bones were pinned down onto the ground with some rusty old nails. One could only wonder how long this corpse had remained here for there to not even be any blood left.</p><br/><p>Above the corpse was a tuft of black mist.</p><br/><p>This was the so-called Patriarch Azure Saint.</p><br/>\n</div>"}