{"title": "Chapter 512: Those Experience Points! What A Pity!", "id": 512, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-512-those-experience-points-what-a-pity", "volume_title": "Volume 6", "body": "<h1>Chapter 512: Those Experience Points! What A Pity!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 512: Those Experience Points! What A Pity!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"The thousands of races out there are nothing but sows reared by the ancient race. If you do not wish to die, you had better hand over that spirit vein you found!\" The ancient race being's leader, Gu Yao, looked at Mu Tian with the intentions of toying with him. It was as though Mu Tian's life and death were in the palm of his hands.</p><br/><p>Ever since they had taken control of the Infinite Slaughter Ancient Realm, there had been countless numbers of beings from the thousands of races who were devoured by them. And each and every one of them had thought of themselves to be really smart and clever, only to be played out by the ancient race eventually.</p><br/><p>\"Hmph. If you want this spirit vein, that will have to depend on whether you've got the capabilities to get it from me.\" Mu Tian laughed coldly. He instantly stretched out those long, pale hands of his. The moment he did that, the meat from his hands moved away, revealing those ghastly bones beneath.</p><br/><p>Using his finger, he poked into the void. Suddenly, a gust of energy vortex gushed out towards the ancient race.</p><br/><p>\"Hmph. Know your place. Brothers, take him down!\" The Gu Yao hollered out.</p><br/><p>With that, an earthshattering explosion broke out.</p><br/><p>There was only a single thought on Mu Tian's mind right now. He wanted to get out of this place as quickly as possible. While he knew that he might not be a match for these ancient race beings if they clashed, he knew that they wouldn't be able to take him down as easily either.</p><br/><p>\"Hmph. You wanna leave? Why don't you take a look at who's controlling this place?\" Gu Yao hollered out. His aura was extremely intense right now as it gathered together like a dragoon, causing the void nearby to crack and weave out like a gigantic spider web. The entire void was then sealed. Anyone who wanted to leave would have to try ascending the Heavens first.</p><br/><p>\"Do you really think we wouldn't know that you've been hiding your cultivation state? Even a desolate celestial upper-level being is nothing but an ant to us ancient race beings!\" Gu Yao's aura was extremely formidable right now, coiling around the place like the boundless seas.</p><br/><p>Mu Tian's face changed. He had thought that he could have these guys lower their guards if he intentionally hid his cultivation state. Seemed like he had been overthinking things. Not only had these ancient race beings known about his cultivation state from the beginning, they had purposefully allowed him to enter despite knowing it. That must mean that they had the utmost confidence of taking him down right here.</p><br/><p>Mu Tian retreated step by step. The battle intent of these ancient race beings was unparalleled. Even their physical body states were something that was holding Mu Tian back. He did not dare to clash with them head-on.</p><br/><p>As for those fellas who had entered together with him, they must have perished in the hands of these ancient race beings.</p><br/><p>\"The Heaven's Will of the Ancient Saint World shines upon us from the ancient race! All of you from the thousands of races out there are nothing but ants! Why would you continue to resist us like this?\" Gu Yao's voice boomed out. With a single palm slap, his True Skill seed began to spin.</p><br/><p>'Ancient Saint's Skies!'</p><br/><p>Suddenly, Gu Yao's pitch-black hands rose up into the air, covering everything as they expanded wildly. Right now, Mu Tian was literally nothing but the corpse of an ant. It would definitely be impossible to escape out of this gigantic palm.</p><br/><p>\"DON'T GO OVERBOARD…!\" Mu Tian howled out. The air of creepiness instantly turned horrific as thousands of vengeful spirits began to howl out malevolently.</p><br/><p>'CEASELESS PAIN!'</p><br/><p>A gigantic black door appeared behind Mu Tian. Above the doors, thousands of ghosts were treading all around the place. A grim aura was emanating from it constantly, as if the door led to the boundless hells. With two gigantic hands pulling onto extremely thick chains, the doors creaked open with ghastly howls.</p><br/><p>A fiery red flame burst out from within, targeting the mighty hand of Gu Yao that was holding up the skies. These ghosts had extremely sharp teeth as they opened their mouths while the void extended endlessly as though they were bent on devouring the hand to nothingness.</p><br/><p>\"All you damned people from the Ghost race!\" Gu Yao had not expected this Mu Tian to be so tricky to deal with! Slapping with the back of that gigantic hand, it slammed down like a sharp blade as it cut through the void. The moment it made contact with that gigantic door, an intense clanging sound could be heard.</p><br/><p>Those ghosts who were gnawing on that gigantic hand of Gu Yao were scattered into oblivion with the sound of this gigantic clang.</p><br/><p>'DESTROY…!'</p><br/><p>While Mu Tian and Gu Yao were exchanging blows, the other ancient race tribesmen were deploying their own moves and striking out at Mu Tian.</p><br/><p>Suddenly, the doors of Ceaseless Hell shattered apart as Mu Tian spat out a mouthful of fresh blood. His figure floated unsteadily in the sky.</p><br/><p>\"All you ant-like beings of the ghost race... Go to hell!\" One of the ancient race tribesmen dashed over from the sides.</p><br/><p>\"INSOLENT…!\" Mu Tian hollered.</p><br/><p>'GIGANTIC SKY BURIAL!'</p><br/><p>The moment Mu Tian opened his mouth, a large amount of black gas burst forth from within. A gigantic cemetery suddenly appeared between the Heaven and Earth. Gigantic Sky Burial was Mu Tian's treasure, a supreme grade spirit weapon.</p><br/><p>Mu Tian had ascended into the Ancient Saint World for 100 years now, and had gone through tons of trials and tribulations. There was one time when he came across this treasure within a secret ground by chance. He then refined it within that secret ground itself.</p><br/><p>The moment the Gigantic Sky Burial appeared, the Infinite Slaughter Ancient Realm got ever more sinister like a ghost town. There were numerous tombs and graves in that Gigantic Sky Burial. Some of them were named while others remained anonymous.</p><br/><p>\"Supreme grade spirit weapon…!\" The moment Gu Yao caught sight of the weapon, his eyes shone with greed, \"This isn't something that someone like you should have!\"</p><br/><p>\"Hmph. All of you from the ancient race are avaricious and insatiable. Do you see it though? Some of these graves are unmarked. But, don't you guys worry. You'll be leaving your mark there soon... real soon. You can then have your fill of torture.\" Mu Tian laughed coldly. Slapping out with both hands, his furious and rapid slaps powered this spirit treasure.</p><br/><p>'BOOHOO…!'</p><br/><p>A ghostly energy rippled out into the surroundings as those graves on the cemetery burst open suddenly, emitting a black light from within.</p><br/><p>\"AHHH…!!!\"</p><br/><p>Some of the ancient race beings who were struck by the dark light cried out in tremendous pain. Holes started appearing all over their bodies as though they were pierced by this light itself.</p><br/><p>\"HAHAHA! Resisting me? You guys must be dreaming! This is the Death Qi that was created by killing tons of powerful beings! No matter how tough your physical body states of the ancient race may be, it's all futile!\"</p><br/><p>Those ancient race tribesmen who were pierced by the dark light turned into Essence Qi themselves and were coiled together with the ghostly vortex, being sucked into the cemetery.</p><br/><p>On that Gigantic Sky Burial, all of those ancient race tribesmen who were killed were now wandering around blankly in between the graves, like lifeless zombies.</p><br/><p>\"HAHA…!\" Mu Tian laughed out wildly as he spat out a mouthful of blood. He was using up every single bit of strength he had to deal with these ancient race tribesmen. In reality, some of the abilities of the Gigantic Sky Burial were still beyond what he could use comfortably. However, he forced them out in order to fight against these ancient race tribesmen.</p><br/><p>However, the worrisome thing for Mu Tian right now was that Gu Yao was still alive. No matter what, he definitely had to hold on until he could take Gu Yao down.</p><br/><p>\"B*STARD, YOU'RE COURTING DEATH…!\" Looking at his fellow tribesmen being slaughtered, Gu Yao hollered out in anger as a bright flash of light erupted forth from his body.</p><br/><p>Gu Yao strode forth bare naked, as armor scales began to sprout from within his body, lining his body with a complete body armor.</p><br/><p>Gu Yao, who was clad with full body armor by now, had reached the peak of his powers. To think that the armour itself would be a spirit weapon!</p><br/><p>\"I'LL CRUSH YOUR SPIRIT WEAPON!\" Gu Yao howled out. With a sudden movement, the void shattered with an explosion.</p><br/><p>...</p><br/><p>'Hais, what a pity…' Lin Fan, who was hidden in the corner, could not help but feel pained within his heart at this sight. To think that those living experience points of the ancient race tribesmen would be destroyed by this fella!</p><br/><p>Damn it! God damn it!</p><br/><p>Even though Lin Fan's heart was aching, he dared not step out. After all, the fight between these two was way too intense right now.</p><br/><p>Lin Fan was especially envious of that supreme spirit weapon in Mu Tian's hands. That thing seemed a little overbearing!</p><br/><p>BOOM!</p><br/><p>Suddenly, a devastating force burst out, causing the entire Infinite Slaughter Ancient Realm to quake violently along with it.</p><br/>\n</div>"}