{"title": "Chapter 511: Thunder Trainer King", "id": 511, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-511-thunder-trainer-king", "volume_title": "Volume 6", "body": "<h1>Chapter 511: Thunder Trainer King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 511: Thunder Trainer King</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Ever since Biggra was turned into a skill, it was infused with a will of its own, and its medicinal effects received an improvement as well. However, it might only barely be enough against the top powerful beings of desolate celestial state. But Lin Fan had already planned for ways to improve its effects.</p><br/><p>After all, as long as it was a skill, Lin Fan was certain that he could make it work.</p><br/><p>Suddenly, a tragic wail rang out from within the cave. Lin Fan, who was busy gobbling down Biggras, was startled by the cry as he came to a stop.</p><br/><p>‘That cry sounded so tragic!’ Lin Fan clutched at his chest as though he had just committed some savage crime, ‘Guys, don’t blame Yours Truly! You’ve only got yourselves to blame for your cruel and inhumane acts! Yours Truly had no choice but to do this to you guys!’</p><br/><p>Lin Fan did not have to guess to know what was happening within. It must be a really appalling sight to behold. There hadn’t been many instances where people had survived under the marvelous might of Biggra.</p><br/><p>Other than Long Xuan, every other living being had crumbled under the prowess of Biggra and lost their sanity.</p><br/><p>Moving nimbly, Lin Fan entered the cave. Things must be a real mess right now within. He thought about the sight he would be forced to face once more. Seemed like those innocent eyes of his would once again be tainted by the impurities of this world.</p><br/><p>Within the cave, Lin Fan knew his way around since he was the one controlling the movement Biggra at the start. Hence, he found them really quickly.</p><br/><p>Dense and impenetrable, the shroud was thick and swiveling around everywhere. Within that thick shroud, those two figures seemed ever so beautiful within.</p><br/><p>Bobbing up and down, a clear sound resonated through the caves.</p><br/><p>‘This is a little unbearable to watch!’ Lin Fan covered his eyes. It was hard to imagine the situation that was unfolding before his very eyes. And to think that he was the one who had created this entire scenario! Things were bound to turn really disastrous once the two of them snapped back to their senses.</p><br/><p>Biggra was getting deadlier as time went by. Back in the past, it was just a godly pill to Zhang Ergou and the others while they could endure popping it down daily. However, right now, anyone who took it in was definitely in for it! Pleasure aside, they couldn’t even control themselves from performing all these shameless acts!</p><br/><p>‘War King’s World Extinguishing Fist!’</p><br/><p>Lin Fan could not bear to stain his eyes any longer. In the blink of an eye, he sent two fists flying out as the will of the punch descended into a doomsday calamity that repressed these two guys completely.</p><br/><p>War King’s World Extinguishing Fist wasn’t a difficult skill to cultivate. The only thing required for it was for one to have an extremely strong will to fight. All was good as long as one could supply that never-ending thirst for a battle of the punches. Furthermore, the thick and dense killing intent within this place was the perfect nourishment for that skill.</p><br/><p>Once Lin Fan was done with all of the trashes in this place, he would then take his time to slowly cultivate War King’s World Extinguishing Fist till he could convert it into a True Skill seed and evolve it.</p><br/><p>Those two fellas who were busy releasing their pent-up frustrations had long since discovered Lin Fan. However, even though their inner hearts were struggling and fighting, their minds were like the boundless sea right now, crushing down their will and ability to control their bodies.</p><br/><p>As both of the fists landed with equal will and destruction, these two guys were destroyed instantly.</p><br/><p>‘Ding…Congratulations on killing desolate celestial lower level Thunder race being.’</p><br/><p>‘Ding…Experience points +40,000.’</p><br/><p>‘Ding…Congratulations on killing desolate celestial lower level Ancient race being.’</p><br/><p>‘Ding…Experience points +40,000.’</p><br/><p>‘Ding…Congratulations on obtaining Thunder Esoteric.’</p><br/><p>‘Ding…Trainer profession senses Thunder Esoteric. Absorb?’</p><br/><p>Lin Fan’s face changed immediately. To think that he would find a single True Skill seed floating there after killing that Thunder race being! The True Skill seed crackled with lightning, as though it was filled with a world of thunder within.</p><br/><p>And even more incredibly, to think that his Trainer profession would pop up, requesting to absorb this!</p><br/><p>While Lin Fan did not know what this was used for, if Trainer wanted to absorb it, then absorb it he would!</p><br/><p>‘Absorb!’</p><br/><p>‘Ding…Absorption success. Trainer profession undergoing change.’</p><br/><p>‘Ding…Trainer profession now has a consciousness of its own: Young Thunder Trainer King.’</p><br/><p>‘Holy f*ck…!’ Lin Fan was completely flabbergasted right now. What in the world was going with the system right now? To think that a Trainer profession could even gain a will of its own?! This couldn’t be a joke, right?</p><br/><p>BOOM!</p><br/><p>Suddenly, a young, bald kid appeared before him. This kid was surrounding by crackling lightning all around his body while wielding a long whip.</p><br/><p>This kid’s gaze was extremely sharp, as though a world of righteousness was filled within his eyes. With just a single glance, his gaze was entrancing, causing one to be drawn deeply into him.</p><br/><p>\"I am the Thunder Trainer King.\" A voice boomed out as the kid’s expression did not change in the slightest bit.</p><br/><p>\"Do you require the Thunder Trainer King to conduct training for you?\" The small hands of the young kid slapped out on the ground with the whip suddenly, causing a loud cracking of the whip.</p><br/><p>\"N-no need…!\" Lin Fan shook his head immediately. He was still in a state of loss, trying to figure out what in the world was going on exactly. How the hell did Trainer produce a consciousness of its own after he had just absorbed a Thunder Esoteric?</p><br/><p>Wasn’t this some wild exaggeration!?</p><br/><p>Soon, the Young Thunder Trainer King turned into a streak of lightning and entered Lin Fan’s body. Lin Fan could sense the Thunder Trainer King resting within his body, and that he could summon this child with a single thought.</p><br/><p>This Thunder Trainer King reminded Lin Fan of the founder for use of electroconvulsive treatment for internet addiction, Yang Yongxin.</p><br/><p>‘Don’t tell me that this Thunder Trainer King is going to follow down that same path!’ Lin Fan had always held his Trainer profession in high regards. It was a skill that he would use for people he viewed as valuable but would not submit to him.</p><br/><p>But, with the appearance of this Thunder Trainer King, Lin Fan felt that his life was getting really f*cked up.</p><br/><p>This was some horrifying sh*t!</p><br/><p>Lin Fan did not think too much about this anymore. Once he had the time, he would further examine this Thunder Trainer King.</p><br/><p>The corpses of the thunder and ancient race beings were still fused together. Furthermore, the positions of these two corpses right now were pretty indecent. So, Lin Fan could not be bothered to head up and take a look.</p><br/><p>He took out his Demon City and absorbed their essence within it entirely.</p><br/><p>Now that his Demon City was a supreme spirit weapon with the big ancient demon serving as its foundation, as long as he continued cultivating it, turning it into a Dao weapon or even Utmost treasure was definitely no issue at all.</p><br/><p>...</p><br/><p>The void was flowing with energy in a corner of the Infinite Slaughter Ancient Realm.</p><br/><p>Mu Tian’s hand was like a claw right now as he dug into the ground. A massive surge of energy burst out, causing the pitch-black ground to quake violently. After that, a purple spirit vein was caught within Mu Tian’s hands.</p><br/><p>\"To think that my luck could actually get this good for me to discover the spirit vein of a powerful being who had fallen here!\" Mu Tian kept the spirit vein within his storage ring. Once he was out and he could refine it, it could definitely raise his power level for sure.</p><br/><p>Mu Tian looked up into the never-ending void as his eyes shone with a glint. The secret grounds of the Ancient Saint World were all controlled by the ancient race right now. All the treasures within had been swiped by the ancient race as well. Everything that was remaining were secret treasures that awaited those with affinity. If one did not have the luck, not only could they get nothing, they may very well lose their lives here even.</p><br/><p>Just as Mu Tian was about to leave, his path forward was blocked.</p><br/><p>\"HAHA! Not bad, not bad! To think that you could still find some treasures, eh?\" The ancient race beings had finally caught up with Mu Tian. They were watching him retrieve that item below the ground with thirsty, lustful eyes.</p><br/><p>\"Hmph. I knew that the ancient race wouldn’t be that kind-hearted. But do you guys really think that you can snatch away meat from a tiger’s mouth?\" Mu Tian replied these ancient race beings sternly.</p><br/><p>\"Meat in a tiger’s mouth... HAHA! Let’s see who the tiger is then…\"</p><br/><p>...</p><br/>\n</div>"}