{"title": "Chapter 533: Erupt Forth, My Dear Biggra!", "id": 533, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-533-erupt-forth-my-dear-biggra", "volume_title": "Volume 6", "body": "<h1>Chapter 533: Erupt Forth, My Dear Biggra!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 533: Erupt Forth, My Dear Biggra!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What the hell is up with this human? Why do I get the feeling that he's toying with us?\" Gu Haitian was raining down his fists onto the body of this human. At the start, he thought that his fists were more than enough to kill this human being.</p><br/><p>However, to his surprise, this human would stand up time and again, as if it was nothing to him at all.</p><br/><p>\"Impossible! This human must be making his final struggles with his energy level depleting rapidly. It won't be long now before we suppress him completely!\"</p><br/><p>\"That's right! The reason for him being able to survive so long must be due to that defensive treasure he possesses. However, that treasure couldn't possibly have an infinite power! A large amount of its energy must be expended in order to defend against every single one of our strikes!\"</p><br/><p>After hearing the analysis of the other two commanders, Gu Haitian was gradually buying back into their words as well.</p><br/><p>'That's right. This human mustn't have too long left.'</p><br/><p>\"Ha, look! He's starting to retaliate! But, he is simply way too weak!\" The third commander, Gu Batian, snorted in contempt. With a single punch, he caused the impact of Lin Fan's attack to dissipate immediately as he burst forth towards Lin Fan.</p><br/><p>'Soooooooooooooooooooo good…!' Lin Fan felt like he was a little boat riding the waves of pleasure right now, floating about aimlessly without any destination in mind.</p><br/><p>Surges of energy burst forth from all directions, crashing down on this little boat constantly.</p><br/><p>'Ding…Congratulations. Eternal Immortality has leveled up.'</p><br/><p>'Physical Body State: Azure celestial upper level.'</p><br/><p>'Levelled once more!' Lin Fan's heart leaped with joy. This was the best feeling ever!</p><br/><p>Looking at the three of them expending all their efforts relentlessly without any complaints of fatigue, Lin Fan was heartened. Where else could he look for such hardworking people?</p><br/><p>He wondered what sort of physical body state these three commanders could bring him to.</p><br/><p>Lin Fan's heart was filled with anticipation right now. How great would it be if they could bring him up to desolate celestial full cultivation state?</p><br/><p>But of course, this was all just one sided thoughts on Lin Fan's part.</p><br/><p>Time passed by the seconds and minutes.</p><br/><p>One by one, the ancient race ants began to quieten down as a look of horror began to spread in those hideous pitch black faces of theirs.</p><br/><p>And that was because, it had been a long time since the human had been pummelled up, down, left, and right in the hands of the three commanders. However, he stood up time and again as though he just couldn't die!</p><br/><p>The beings of the thousands of races out there were equally dumbfounded. Even those of the Giant race wouldn't have such a resilient lifeforce as this human!</p><br/><p>With every single strike of the three commanders, the skies changed colors, as though the entire world was about to be destroyed. Yet, it was as if there was no impact on the human at all, as he stood up time and again after each and every single attack!</p><br/><p>Time after time.</p><br/><p>Now that such a long period of time had passed, they were entirely flabbergasted.</p><br/><p>\"Is this a human…or a god?\"</p><br/><p>'Ding…Congratulations. Eternal Immortality has leveled up.'</p><br/><p>'Physical Body State: Azure celestial full cultivation state.'</p><br/><p>Upon hearing the notifications from the system, Lin Fan's lips curled into a smile once more. He had leveled up again.</p><br/><p>On the other hand, the expressions of the three commanders were beyond shocked right now, as they refused to believe the sight before their very eyes.</p><br/><p>\"Are you a human…or a god?\" Gu Haitian's hands were trembling right now. To think that a human could withstand their attacks for such a long time!</p><br/><p>Every single punch hit their mark. Every single punch brought with it an explosion.</p><br/><p>How in the world was he still alive?</p><br/><p>\"Oh, make a guess…!\" Lin Fan chuckled casually. This time around, he had truly earned big by making his way to the Despair City! Not only did he raise his cultivation state, he raised his physical body state as well!</p><br/><p>But where in the bloody world was the Marquis of Despair?</p><br/><p>Could it truly be as they had mentioned? Was he truly not in Despair City right now?</p><br/><p>Based on Lin Fan's understanding of the Righteous Party, there was no way their news could be so accurate!</p><br/><p>Upon hearing these words of Lin Fan, the three commanders were incensed once more.</p><br/><p>\"Guess your mother…!\"</p><br/><p>Lin Fan took a quick check of his Mythical Parasol Tree and realized that the Mythical Parasol Tree had expended quite a fair amount of lifeforce.</p><br/><p>The reason why he could hold on till now was all due to the Mythical Parasol Tree and Blood Sea's efforts. If he didn't possess them, Lin Fan wouldn't have dared to receive their blows with such ease, even if he had ten times the guts.</p><br/><p>\"Alright, it's time for our little games to end now. Next up, it's about time I kill you guys.\" Sweeping his robes, Lin Fan chuckled casually to the three commanders.</p><br/><p>\"HUMAN! YOU'RE WAY TOO BRAZEN!\" Upon this damned human's remarks, the three commanders were agitated badly, as if thunderbolts were about to burst forth from their heads. They had truly never met someone who had dared to get so insolent with them!</p><br/><p>But right now, the bewildering thing was the type of method this human was employing for him to take in all of their attacks, as though it was nothing.</p><br/><p>\"Hehe…\" Lin Fan giggled calmly as he waved his hands gently. Instantly, the void began to ripple as a white mist began to surge out, spreading out through the entire area.</p><br/><p>'Biggra makes me invincible.' This was the Biggra in Lin Fan's eyes.</p><br/><p>Countless powerful enemies had found themselves bending down against the might of Biggra so far.</p><br/><p>Once Lin Fan became the utmost being of this entire universe, he swore that he would definitely give Biggra a rightful title that it deserved.</p><br/><p>\"What…is this…?\" Looking at the white mist that was spreading out, Gu Haitian frowned. Punching out with his fist, he tried to clear the white mist. However, the white mist gathered again almost immediately.</p><br/><p>The other two commanders were forced to retreat consistently against the invading Biggra mist. Slapping out repeatedly into the void, they formed a barrier as they tried to keep this white mist at bay.</p><br/><p>However, to their shock, the white mist sifted through the layers of the void easily, disregarding the defenses of the barrier completely. This was something completely impossible in their eyes!</p><br/><p>Lin Fan took a look at the three commanders and commented casually, \"There's no way you guys can kill me. On the other hand, it isn't impossible for me to kill you guys. All I require is that little bit more effort, that's all. However, it's all worth it right now.\"</p><br/><p>\"DAMNED HUMAN!\" The three commanders did not dare to tread forth without knowing what this white mist was.</p><br/><p>However, even then, the white mist was still inching towards them bit by bit. Suddenly, the mist rumbled altogether, as it turned into a gigantic dragon and howled out balefully at the three commanders.</p><br/><p>PSHEW!</p><br/><p>The roar of the dragon rang through the skies as it tunneled through the three commanders.</p><br/><p>The commanders tried their best to defend against the attack of this dragon. To their surprise, there was no damage done by that humongous dragon, as it just made its way through them without inflicting any injuries!</p><br/><p>\"HAHA! Bunch of tricks! Here we were, worried that it might be something great. Turns out that it's just nothing!\" The three commanders began to laugh out maniacally.</p><br/><p>They had thought that this would be an extremely strong skill, only to find out that it was nothing but a farce, and that was all!</p><br/><p>\"Hmph, human! You've used up all your means! It's our turn now!\" The three commanders glared at Lin Fan coldly.</p><br/><p>Lin Fan looked at them and grinned, \"Don't you feel anything different about your bodies?\"</p><br/><p>\"Different? HAHA! The only feeling we've got wanting to slice you into pieces!\" The three of them gave off a cold chuckle.</p><br/><p>\"Eh…?\" Suddenly, Gu Zhengtian's face changed and his pupils dilated, as though something was about to happen. Following tightly afterward were the other two commanders. They were all beginning to feel something strange.</p><br/><p>\"You…YOU…!\" Gu Haitian pointed his trembling finger unbelievingly at Lin Fan. It was as though he was about to say something, but was choking at the last moment.</p><br/><p>...</p><br/><p>\"Erupt forth, my dear Biggra!\" Lin Fan smiled brightly as he raised up both of his hands.</p><br/><p>The golden age was about to flourish.</p><br/>\n</div>"}