{"title": "Chapter 552: Frenzied Cultivation", "id": 552, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-552-frenzied-cultivation", "volume_title": "Volume 6", "body": "<h1>Chapter 552: Frenzied Cultivation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 552: Frenzied Cultivation</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Tragic… This was extremely tragic.</p><br/><p>For anyone to fall into the hands of a sicko such as Lin Fan, the outcome would be utterly unimaginable.</p><br/><p>'Ding…True Origins Crushing Kick has leveled up.'</p><br/><p>Lin Fan was smiling right now. Each time he leveled up, he would feel the size of the True Skill seed within his body expanding. Lin Fan had taken a long time to raise his Balls Kicking into the True Origins Crushing Kick that it was today. By now, every single level required a sh*tload of experience points.</p><br/><p>If not for the fact that the Sovereign King Wei was this strong, leveling this skill would definitely be harder than ascending the Heavens itself.</p><br/><p>By now, the True Skill seed of the True Origins Crushing Kick was churning furiously within Lin Fan's body. Each time it swiveled, it would absorb in a large amount of energy. Under the nourishment of the energy, the True Skill seed increased in size.</p><br/><p>Time passed by the seconds and minutes…</p><br/><p>In fact, Lin Fan was getting a little tired of kicking by now. This was especially the case given how grotesque the Sovereign King Wei's crotch was looking.</p><br/><p>To think that the great Sovereign King Wei, who was under the direct command of the utmost being, would be subjected to such cruel torments. If news of this were to get out, tons of people would be scared to death because of it.</p><br/><p>Each time Lin Fan dished out his kicks, the Marquis of Despair Xiguang and Long Xuan would wince a little, as though it was really difficult for them to watch this.</p><br/><p>On the other hand, the Thunder Trainer King was watching wide-eyed, without shifting his attention at all. It was as though he was taking the chance to learn a new method, as those shifty eyes of his shone with an absolute brilliance.</p><br/><p>At this moment, Lin Fan's actions came to a stop. He could feel that if he were to carry on with his current path, the Sovereign King Wei's groin would truly explode. It was time to train up some other skills.</p><br/><p>Black Tiger Steals Heart had been ready from the start.</p><br/><p>Without any hesitation, Lin Fan immediately shot out both of his fists like twin dragons.</p><br/><p>'I'LL PUNCH AND I'LL PUNCH…!!!'</p><br/><p>Lin Fan was going at a good pace as the Sovereign King Wei's body thumped up and down under the rapid fire. Due to this, the experience points of Black Tiger Steals Heart were skyrocketing as well.</p><br/><p>The True Skill seed spun wildly as its power level spiked.</p><br/><p>'Ding…Black Tiger Steals Heart has leveled up.'</p><br/><p>'Ding…Black Tiger Steals Heart has leveled up.'</p><br/><p>Huff…</p><br/><p>Lin Fan heaved out a sigh deeply. This was the first time he was having such a pleasurable time leveling up.</p><br/><p>Seemed like the Sovereign King Wei was really useful after all. Even if he were about to die, he could still contribute to the masses. What a glorious event his death would be.</p><br/><p>Once Lin Fan was done with his Black Tiger Steals Heart training, countless Sword Wills burst forth from his body.</p><br/><p>'Firmament Sword!'</p><br/><p>By now, Lin Fan could produce four different types of Sword Wills.</p><br/><p>Based on Firmament Sword's highest state of being, it could produce nine different types of Sword Wills. However, with the help of the system, Lin Fan was sure that he could definitely raise it to new heights.</p><br/><p>'Firmament Sword, poke him down!'</p><br/><p>PSHEW! PSHEW!</p><br/><p>Just like that, Sword Wills filled the skies as they bolted down cruelly towards that swollen groin of the Sovereign King Wei.</p><br/><p>'Ding…Experience Points +100,000'</p><br/><p>'Ding…Experience Points +100,000'</p><br/><p>'Ding…Firmament Sword has leveled up.'</p><br/><p>'Ding…Congratulations on obtaining the Fifth Sword Will.'</p><br/><p>Before long, Lin Fan heard the notification from the system, bringing joy to his heart. Indeed, leveling up was pretty fast right now. However, this was far from enough. He must definitely squeeze the Sovereign King Wei dry of benefits!</p><br/><p>The Fifth Sword Will was made for reaping.</p><br/><p>'Multi Sword Burst!'</p><br/><p>In the blink of an eye, countless Sword Wills appeared in the void and shot down like meteors under Lin Fan's control.</p><br/><p>PSHEW! PSHEW!</p><br/><p>This unparalleled Sword Will sliced at the Sovereign King Wei's body.</p><br/><p>However, this brought about no damage to the Sovereign King Wei's body. In fact, it couldn't even slice off a single strand of hair from him.</p><br/><p>'Ding…Firmament Sword has leveled up.'</p><br/><p>'Ding…Congratulations on obtaining the Sixth Sword Will.'</p><br/><p>'Ding…Firmament Sword has leveled up.'</p><br/><p>'Ding…Congratulations on obtaining the Seventh Sword Will.'</p><br/><p>Under this flurry of strikes, the Seventh Sword Will of Firmament Sword was cultivated.</p><br/><p>Seven different Sword Wills, each with their own unique differences. Naturally, the power produced was different as well.</p><br/><p>The moment Lin Fan had cultivated the 5th Sword Will, he was able to start unleashing the full potential of Firmament Sword.</p><br/><p>The Reaping Sword Will.</p><br/><p>The Void Sword Will.</p><br/><p>The Destruction Sword Will.</p><br/><p>Despite hearing the notifications from the system, Lin Fan continued relentlessly without stopping, trying to see if he could cultivate out the eighth Sword Will.</p><br/><p>For most people, cultivating Firmament Sword would require them to comprehend the Sword Will before cultivating it out. However, for Lin Fan, if he couldn't get to comprehend it, all he had to do was dump experience points at it.</p><br/><p>'Ding…Firmament Sword has leveled up.'</p><br/><p>'Ding…Congratulations on obtaining the Eighth Sword Will.'</p><br/><p>The instant he comprehended the eighth Sword Will, all the other Sword Wills vibrated immensely. It was as though they were undergoing some change now that they were cultivated to a new higher state.</p><br/><p>'Ding…Congratulations on comprehending the Emptiness Sword Will.'</p><br/><p>Suddenly, the True Skill seed of Firmament Sword began to churn and underwent a spontaneous change, turning into the shape of a longsword.</p><br/><p>Shing!</p><br/><p>Suddenly, something happened that blew off Lin Fan's mind. To think that the Emptiness Sword would manage to slice the Sovereign King Wei's skin! Even though it was just slightly ripped, this was still no doubt an improvement to Lin Fan!</p><br/><p>'Indeed, there's nothing between the Heaven and Earth that could be sharper than a Sword Will.'</p><br/><p>And just as Lin Fan was about to go on and cultivate the ninth Sword Will, he realized that no matter how much he struck out, the system did not gain any bit of experience points at all.</p><br/><p>'Seems like this the Sovereign King Wei can't make it anymore now. This eighth Sword Will should probably be the limit right now. If I want to cultivate the ninth Sword Will, it seems as though I would have to thoroughly comprehend the Emptiness Sword.'</p><br/><p>Lin Fan had already managed to comprehend the meaning of everything with ease. Hence, Lin Fan stopped with his training of Firmament Sword and went on to the others.</p><br/><p>Doomsday Calamity Fist!</p><br/><p>Demon God Wheel!</p><br/><p>Firmament!</p><br/><p>All of these skills burst forth from Lin Fan, and the practice target for them was none other than the mighty the Sovereign King Wei.</p><br/><p>Under the repeated blasts of Lin Fan, signs of cracks began to show up on the Sovereign King Wei's body. Even though they weren't really visible, they did exist nevertheless.</p><br/><p>Seemed like the Sovereign King Wei's body truly couldn't withstand it after a certain point.</p><br/><p>With this, Lin Fan understood that this should have been the way it was. Given time, even a single dripping drop of water could penetrate through a piece of rock. No matter how tough the Sovereign King Wei was, his body would eventually give way.</p><br/><p>All the ten True Skill seeds that Lin Fan was cultivating right now expanded enormously, giving off power way greater than before.</p><br/><p>Given Lin Fan's current strength, even though he had yet to cross over to the divine celestial state, he could definitely take down a divine celestial level 1, True state being.</p><br/><p>This was the result of his tireless hard work.</p><br/><p>The Marquis of Despair Xiguang and Long Xuan were just looking at Lin Fan with their mouths wide agape. They had not expected Lin Fan's powers to be this great! In fact, all the skills that he was using were extremely powerful! If not for the fact that his cultivation state was still pretty low right now, all his skills would definitely result in a devastating impact!</p><br/><p>Even though the Marquis of Despair's cultivation state wasn't that high, he did have a pretty wide knowledge of the world, given his reign as an overlord for the past thousands of years.</p><br/><p>By the looks of it, unless his Master were to die an unfortunate death somewhere in the middle, the destruction of the ancient race would definitely not be a mere dream if he were to continue growing at this rate.</p><br/><p>\"Alright, time to kill that Sovereign King Wei.\" Lin Fan laughed coldly.</p><br/><p>It was time for the main show now.</p><br/><p>Since normal methods couldn't kill off the Sovereign King Wei, there was only one thing left to do.</p><br/><p>Heaven and Earth Smelt.</p><br/>\n</div>"}