{"title": "Chapter 561: Treasure Trove", "id": 561, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-561-treasure-trove", "volume_title": "Volume 6", "body": "<h1>Chapter 561: Treasure Trove</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 561: Treasure Trove</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'To think that this Fire Water Secret Grounds would exist in a dimension of its own. This Fire Water Emperor's cultivation state must have definitely defied the heavens! He must be someone who was crazy strong!' The moment Lin Fan pulled Fairy Hongyun with him into the secret ground, his body was torn at by the berserk energy currents surging in from the surrounding dimensional void.</p><br/><p>Lin Fan released a counter aura around his surroundings, keeping the berserk energy currents at bay.</p><br/><p>Fairy Hongyun wanted to unleash everything she had to keep out the energy currents. However, she realized that Lin Fan's counter aura was already doing the job, leaving her shocked beyond words.</p><br/><p>To think that Lin Fan would be this strong!</p><br/><p>\"Unexpected, truly. I have underestimated your powers still. This dimensional torrent could be considered to have the powers of a divine celestial level 1, True state being. Without the use of a treasure, I wouldn't be able to defend against it at all, and would just be shred into minced meat in the blink of an eye.\" Fairy Hongyun remarked.</p><br/><p>Lin Fan smiled indifferently, not bothered with his surroundings in the least bit. Right now, his entire body was like a sharp blade cutting through this dimensional torrent.</p><br/><p>\"We're going to cross through this area real soon now. Time to raise our awareness level.\" Lin Fan warned.</p><br/><p>\"Yes.\" Fairy Hongyun nodded her head. She had not expected things to turn out as such, where the ancient race beings would slaughter her fellow sect members and steal their talisman papers to gain access.</p><br/><p>Right now, Fairy Hongyun was feeling a little worried in her heart, wondering if anything had happened to the remaining fellow sect members of hers. After all, the ancient race beings were really cruel and powerful. If her sect members were to bump into them, there was no guarantee that they could hold out against them.</p><br/><p>Not long after, Lin Fan passed through the dimensional torrent and arrived at this new place together with Fairy Hongyun.</p><br/><p>This world seemed like a merger of the shades of red and blue. Right before their very eyes was a gigantic ocean. One could not tell the boundaries of this ocean with just a single look. There was no hint at all towards the sort of dangers that might be awaiting them in this place.</p><br/><p>And just as Lin Fan and Fairy Hongyun were ready to tread forth, that calm ocean suddenly raged into a frenzy, with gigantic waves forming. Suddenly, a bright flash of light pierced forth from the surface of the ocean.</p><br/><p>\"To think that there would be more beings of the thousands of races arriving. Time to kill them and snatch over their bodies!\" From the deep ends of the ocean, a small, blue colored Water Spirit army gathered.</p><br/><p>These Water Spirits were formed from the gigantic ocean. Without a definite shape, their bodies gleamed with a dark blue hue, ripples moving up and down their formless bodies.</p><br/><p>\"Be careful! These are Water Spirits!\" Fairy Hongyun could not help but warn.</p><br/><p>Lin Fan had not expected naturally borne spirits to exist within this secret ground! His spirits wavered slightly as his Sword Will burst forth, killing one of the Water Spirits instantly.</p><br/><p>To think that these Water Spirits would possess a desolate celestial cultivation state on their own. Not only that, they were clumped together densely. Even if it were a divine celestial level 1, True state being who dropped into their midst due to carelessness, he would definitely find it tricky to deal with.</p><br/><p>'Ding…Congratulations on killing Water Spirit.'</p><br/><p>'Ding…Obtained Water Qi of the Five Elements.'</p><br/><p>Upon hearing the notifications from the system, Lin Fan's face changed. To think that killing these Water Spirits would help him obtain the Water of the Five Elements! This was unexpected!</p><br/><p>Even though Demon City had evolved once by now, it was only supported by pure power as a foundation. While Lin Fan had gathered the Earth component of the Five Elements, he did not have any clues at all regarding the other Four Elements.</p><br/><p>Therefore, the fact that he could obtain Water of the Five Elements just by killing this Water Spirit caused him to feel a little puzzled.</p><br/><p>Even though this was just a strain of the Water Element, the Water Spirits made up for it in terms of quantity. If he were to kill all of them, he might just be able to gather enough of the Water Element.</p><br/><p>\"To think that this living being would dare to kill our comrade! Damn it! Everyone, let's devour him and steal his body!\" The Water Spirit army began to cause a frenzied ruckus, apparently angered over Lin Fan's actions.</p><br/><p>The waves surged up, covering the entire Heaven and Earth.</p><br/><p>\"Let us hurry up and dodge these Water Spirits. If we were to be surrounded by them, it'd be hard to break out of their offenses!\" Fairy Hongyun said nervously.</p><br/><p>Observing the army properly, Fairy Hongyun noticed that some of them were at the divine celestial level 1, True state cultivation state. In fact, there were even divine celestial level 2, Realm state Water Spirits amongst them!</p><br/><p>If they were truly surrounded by them, they might very well be exhausted to death just fighting against them!</p><br/><p>\"No matter.\" Lin Fan waved his hand dismissively.</p><br/><p>Initially, Lin Fan had wanted to make haste on entering this place. However, upon discovering that these Water Spirits possessed strains of the Water Element, he was really excited.</p><br/><p>'Demon City, come on out!'</p><br/><p>The moment the big ancient demon appeared, he howled out in fury. Killing out towards these Water Spirits, he snatched away the Water Element from their very bodies.</p><br/><p>\"Damn it! How dare this living being kill our comrades as well?\" One of the divine celestial level 2, Realm state Water Spirits hollered out in anger on seeing this.</p><br/><p>He wielded a pitchfork with his arm, which shone with a deep blue hue as well. A closer look at it would reveal that it was a middle-grade dao weapon.</p><br/><p>'Water God Realm!'</p><br/><p>Yelling out, a bright beam of light burst forth from the body of the Water Spirit. This light covered all of the Water Spirits, and raised their power levels in the process.</p><br/><p>Slapping out with his palm, Lin Fan sent a boundless aura rippling out towards these Water Spirits. Under the might of this aura, the realm of that Water Spirit began to crack like a mirror, leaving deep scars all over it.</p><br/><p>Crack.</p><br/><p>With a grab of that gigantic hand of his, Lin Fan captured a large number of Water Spirits within his fist. Giving it a tight squish, a thick stream of Water Element dripped down from his fingertips, into the Demon City.</p><br/><p>'What a dense amount of Water Element! Seems like the higher the cultivation states of these Water Spirits, the stronger is their Water Element.' Lin Fan was exhilarated right now. To think that he would meet with such an encounter.</p><br/><p>For any other living being, the Water Element would be utterly useless, unless they could find a good way to cultivate it. However, to Lin Fan, the Water Element was something absolutely irreplaceable.</p><br/><p>This was especially important for the Demon City. As long as he could gather a definite amount of the Water Element, he would be able to form the river of the Water Element. Once he could convert it into one of the true Five Elements, the power of Demon City would definitely rise up once more.</p><br/><p>Looking at the way Lin Fan was slaughtering the Water Spirits, Fairy Hongyun felt her brows tighten, feeling somewhat incredulous.</p><br/><p>To think that the divine celestial level 2, Realm state Water Spirit would be utterly defenseless towards its death! This was definitely unimaginable for Fairy Hongyun!</p><br/><p>Even though its realm might not be the strongest of all, it was undeniable that the Water Spirit was still a true blue powerful divine celestial level 2, Realm state being!</p><br/><p>Just what was the extent of this Lin Fan's strength?</p><br/><p>Fairy Hongyun did not dare to imagine any further.</p><br/><p>\"DEVOUR!\"</p><br/><p>Lin Fan hollered out as his unparalleled aura turned into a razor-sharp sword, cutting up these Water Spirits. Opening his mouth, the big ancient demon sucked in everything in one fell swoop, taking the Water Element that was formed from these Water Spirits into his stomach and cultivating while fusing it with itself.</p><br/><p>\"Everyone, run! That darned living being is devouring us!\" The Water Spirits screamed out in horror. Immediately, the Water Spirit army began to disperse, as they tried escaping into the world of the ocean below.</p><br/><p>The Water Spirits had not expected this living being to be this strong!</p><br/><p>\"Hmph, run? How can I possibly let you guys do that?\"</p><br/><p>For Lin Fan, this place was basically a treasure trove!</p><br/><p>...</p><br/>\n</div>"}