{"title": "Chapter 569: The War Between A Man And Bat That's Intolerable To Witness", "id": 569, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-569-the-war-between-a-man-and-bat-thats-intolerable-to-witness", "volume_title": "Volume 6", "body": "<h1>Chapter 569: The War Between A Man And Bat That's Intolerable To Witness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 569: The War Between A Man And Bat That's Intolerable To Witness</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'Punch of Biggra!'</p><br/><p>\"Master! At a critical moment as such, obviously, I'm the most reliable one you can depend on!\"</p><br/><p>The moment Lin Fan unleashed his Realm, a teenager draped in red dashed out. Looking shiftier and dodgier than any other thing in this world, every single bounce of his steps emitted a thick, white mist.</p><br/><p>Lin Fan was thoroughly exasperated with these Skill Spirits by now. Each and every one of them was cockier than the other.</p><br/><p>Being able to turn Biggra into a skill and infusing it into a realm thereafter wasn't something that Lin Fan had planned out for from the start.</p><br/><p>However, by the looks of it, all of these were the system's credit. After all, the system possessed this function called 'Fusion'. Even though Lin Fan had rarely used it in the past, he realized that it's potential was fully unleashed by the time he had cultivated out his Realm thoroughly.</p><br/><p>\"Master is deploying Biggra now! It's time for us to run!\" Flying Heavens pierced through all the Black Heavens Bat Kings in the sky. However, the moment they caught sight of that white mist permeating through the Paradise, Xiguang and Long Xuan both shouted out in panic.</p><br/><p>It was as though they were encountering something utterly horrifying, as they disappeared from the Paradise instantly, reappearing by Lin Fan's side.</p><br/><p>\"Master, please don't cause any accidental injuries!\" The big ancient demon was tied in a locked struggle with the Bat God right now and didn't pay much attention to the mist.</p><br/><p>Looking at the thickening mist, the Infinite Bat Old Master was filled with confusion as well, wondering just what in the world that was.</p><br/><p>\"Black Heavens Bat Kings, devour that mist!\" Now that victory was seemingly right before his very eyes, the Infinite Bat Old Master did not wish for any mishaps to happen.</p><br/><p>Even though he did not know what the mist was, the Black Heavens Bat Kings were able to suck in everything within this world and turn them into nutrients for themselves.</p><br/><p>Screech! Screech!</p><br/><p>The densely packed Black Heavens Bat Kings pounced over at this sky encompassing thick mist before gulping it in mouthful after mouthful, without a single bit of hesitation.</p><br/><p>The Spirit of Biggra was dumbfounded at the sight of these smelly bats taking in the Biggra so happily. It was as though he had never once expected that any living being would take in Biggra so willingly on their own!</p><br/><p>Looking at the gradually diminishing mist, the Infinite Bat Old Master laughed wildly.</p><br/><p>\"HAHA! What other moves have you got? Lay them all out! This old man here had only intended to get his hands on the Dao Weapon at first! But by the looks of things right now, it seems like I've got to suck your mind dry and get hold of all of your knowledge! Even though your skills aren't anything much, I've got to admit that they're pretty interesting!\" The Infinite Bat Old Master laughed out sinisterly.</p><br/><p>However, in that instant, the Infinite Bat Old Master's laughter suddenly stopped as though someone was choking his neck.</p><br/><p>That grim and sinister face was beginning to flush bright red.</p><br/><p>\"YOU…!\" The Infinite Bat Old Master's gaze shone with fear as he stumbled backward, glaring at Lin Fan in utter shock.</p><br/><p>\"What the f*ck's going on here? Don't tell me that this guy's affected by the Black Heavens Bat Kings sucking in the Biggra?\" Looking at the state the Infinite Bat Old Master was in right now, Lin Fan was puzzled.</p><br/><p>But soon enough, Lin Fan understood. Naturally, all the essence and souls that the Black Heavens Bat Kings sucked in would definitely be transferred over to the Infinite Bat Old Master.</p><br/><p>Now that these Black Heavens Bat Kings were lapping up the Biggra for free, the end result would be the transfer of Biggra to the Infinite Bat Old Master.</p><br/><p>Biggra was a mystical godly object. No matter how strong one was, as long as one was to take it in, he or she would definitely know of a world worse than death.</p><br/><p>Screech! Screech!</p><br/><p>Suddenly, the Black Heavens Bat Kings began to cry out as well. Eventually, they were diving at Lin Fan in swarms. However, at this moment, they were shaking left and right as though they were drunk. The red light in their eyes shone more brilliantly than ever before.</p><br/><p>Thud! Thud!</p><br/><p>The fluttering of their wings was in a thorough state of confusion right now! However, the next thing that happened was absolutely astonishing for Lin Fan.</p><br/><p>These Black Heavens Bat Kings began to turn around and look at one another. These beings of the same breed that they had never ever bothered about in the past were looking ever so alluring right now.</p><br/><p>\"Holy f*ck! This is utterly savage!\" Turning his head around, Lin Fan's face was totally helpless. This was simply way too beastly! How could they commit such an audacity?</p><br/><p>At this moment, the Bat God, which was suppressing down the big ancient demon, was going berserk as well. The big ancient demon shuddered for a moment. He had realized that the eyes of the Bat God were set ablaze suddenly, as though it had suddenly discovered something amazing!</p><br/><p>\"Big ancient demon! Hurry up and return or you'll be in big trouble!\" Lin Fan shouted out to the big ancient demon.</p><br/><p>The big ancient demon looked at Lin Fan, then at the Bat God. Without any hesitation, he retreated back into the Demon City immediately.</p><br/><p>The moment the big ancient demon withdrew into the Demon City, the Bat God pounced on it as though it was ready to duke out a full 300 rounds with him.</p><br/><p>Sweeping his robes, Lin Fan kept the Demon City in immediately. If the big ancient demon were to be attacked by the Bat God, he might end up losing his will to live. He might feel as though his body wasn't pure anymore if he were to be tainted by a bat.</p><br/><p>The moment the Demon City disappeared, the Bat God turned his gaze to Lin Fan.</p><br/><p>Lin Fan felt his heart jerk for a moment. Something felt amiss.</p><br/><p>'Stealth.'</p><br/><p>Lin Fan knew that he must never exchange blows with anyone who had consumed Biggra. After all, any living being would definitely turn extremely shameless after taking in Biggra. One must definitely not look at them like normal beings.</p><br/><p>\"Argh! B*stard! What in the world is this mist?\" The Infinite Bat Old Master hollered. Within his heart, an unknown energy was rumbling furiously, as though it was bent on taking over his consciousness.</p><br/><p>At this moment, Lin Fan, who had entered Stealth mode, remained entirely motionless and mute as he floated gently in the Paradise.</p><br/><p>The Infinite Bat Old Master was howling in a frenzy. Just as he was sensing the fact that he was about to lose all control to that unknown energy, he realized that the Black Heaven King Bats and the Bat God had him surrounded.</p><br/><p>All of these bloodshot eyes were fixated on the Infinite Bat Old Master.</p><br/><p>Within these eyes, the Infinite Bat Old Master could make out an endless amount of excitement. Adding on to his horror, he could make out something black and thick standing upright in the middle of the legs of the Black Heavens King Bats. They were like mountain peaks, standing extremely sturdy.</p><br/><p>\"YOU…! WHAT ARE YOU GUYS TRYING TO DO?\" The Infinite Bat Old Master felt his anus tightening up as a feeling of dread filled his heart.</p><br/><p>Screech! Screech!</p><br/><p>The reply that the Infinite Bat Old Master got was a series of wild screeches coming from those Black Heavens King Bats that lined the entire sky. In their eyes, the Infinite Bat Old Master was their favorite being in the entire world right now.</p><br/><p>\"BAT GOD'S NEST! INFINITE BATS! DISAPPEAR…\"</p><br/><p>Before the Infinite Bat Old Master could finish his sentence, he was drowned by all those Black Heavens King Bats. As for the Bat God, he was just focusing on the bottoms of the Infinite Bat Old Master. But of course, one should wonder what this bottom was referring to.</p><br/><p>Tragic cries were mixed with the screeches…</p><br/><p>What followed closely was appearance of the Infinite Bat Old Master, who was entirely disoriented by the Biggra by now. The powers that were bursting forth from him right now were wilder than when he was trying to suppress Lin Fan, way, way stronger.</p><br/><p>With that ginormous hand, he caught hold of the Bat God. His red robes fluttered through the sky as his long hair danced as well.</p><br/><p>This cruel war between Man and Bat had begun.</p><br/><p>The Paradise vibrated violently while a rain of blood was sprayed over the entire place.</p><br/><p>Lin Fan could not even bear to turn his head over.</p><br/><p>'This is a spectacle way too horrible to endure.' This massive war had gone way beyond Lin Fan's imagination.</p><br/><p>The Spirit of Biggra crossed his arms and hugged both of his shoulders, smiling sheepishly. At this moment, it was as though he was completely satisfied with his doings.</p><br/><p>As for Xiguang and Long Xuan, they were just staring with their jaws agape in utter shock.</p><br/><p>'Completely inhumane…'</p><br/>\n</div>"}