{"title": "Chapter 565: Middle Grade Dao Weapon", "id": 565, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-565-middle-grade-dao-weapon", "volume_title": "Volume 6", "body": "<h1>Chapter 565: Middle Grade Dao Weapon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 565: Middle Grade Dao Weapon</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Lin Fan, hurry up and kill them, lest the ancient race catch up with us.\" Even though Fairy Hongyun was gentle and benevolent by nature, she had also understood something along this journey. Even if they did not kill these Fire Spirits, the ancient race beings or evil beings of the thousands of races would kill them to raise their own strength as well.</p><br/><p>If the enemies were to raise their power levels because of it, it would just spell trouble for the rest of them from the thousands of races, or even her own sect members as well.</p><br/><p>\"Yes.\" Lin Fan looked at Hongyun, a little stunned. However, he chuckled almost immediately. What a fantastic woman this was! To think that she would be so understanding about things!</p><br/><p>\"Junior sister, y-you…you!\" Tianyun did not know what to say any longer! He, for one, knew that his junior sister was kind by nature, and did not like killing at all! But watching how his junior sister was now assisting this man in massacring these Fire Spirits, he did not know how to express this indignance he was feeling in his heart at all!</p><br/><p>\"Senior brother, hurry up and help out!\" Fairy Hongyun called out.</p><br/><p>\"I-I…!\" At this moment, Tianyun truly wanted to spit out a mouthful of blood. Not only did his junior sister not hate this man because of this issue, she had even requested for him to assist that man!</p><br/><p>Tianyun truly did not wish to think any further.</p><br/><p>\"Hongyun, I only need your help. Your senior brother is way too weak! If he drops in their midst, he's almost definitely going to be killed by these Fire Spirits. By then, he'll only delay our time!\" Lin Fan chimed in.</p><br/><p>'Holy f*ck…!' Hearing these words was akin to having someone hammer straight on the heart for Tianyun as it thumped loudly.</p><br/><p>This guy was evidently belittling him right in his face!</p><br/><p>\"Don't look down on me!\" Tianyun could not bear with this any further. To think that this guy would disparage him as such! If he didn't perform some kills right now, that man would definitely take him for a weakling!</p><br/><p>'Demon City!'</p><br/><p>Lin Fan took out his Demon City entirely. Now that it was fused with the Water Element river, the power level of Demon City had risen multiple folds by now.</p><br/><p>Slamming out with his fist, the big ancient demon extinguished the flames. With that, countless Fire Spirits were converted into connate Fire Element and fused with the Demon City.</p><br/><p>Combining their forces, Lin Fan and Hongyun were working hard at killing these Fire Spirits. Muqing did not stand by idly as she rendered her assistance as well, extinguishing multiple Fire Spirits with the sweep of her hand.</p><br/><p>Tianyun looked over at Lin Fan, feeling extremely disgruntled right now. Crying out loud, he put in even more efforts in killing these Fire Spirits.</p><br/><p>Looking at Tianyun who was riled up and frantically killing the Fire Spirits for him over just a single sentence, Lin Fan sniggered in his heart. Did this guy really think that he could play with Yours Truly with just that level of intellect?</p><br/><p>However, Lin Fan really did think that Tianyun was pretty cute as well.</p><br/><p>Seemed like all the living beings who were born in the Ancient Saint World itself were pretty cute.</p><br/><p>If it were someone who had ascended from the Lower Worlds, they would definitely not get so worked up over a single sentence of his. After all, most of them were crafty old foxes, who would not even bat a single eyelid while tricking someone to death.</p><br/><p>\"Damned living beings! How dare you guys kill our comrades? We'll have you dead!\" At this moment, a gigantic Fire Spirit, which was almost 1,000 feet tall, howled out wildly. The flames on his body rumbled continuously, eventually blazing into an armor of flames.</p><br/><p>ROAR!</p><br/><p>A maddened roar shook the entire world as he wielded an endless amount of scorching connate Fire Element in his palms.</p><br/><p>\"Fire Spirit, your opponent shall be me!\" Angered to the brink of insanity by Lin Fan, Tianyun yelled out angrily at the Fire Spirit. Instantly, he threw out a flurry of palm strikes.</p><br/><p>Every single palm strike was bursting with power, endless and continuous. It was as though Tianyun was taking the Fire Spirit as Lin Fan.</p><br/><p>If this happened normally, Tianyun would probably have to expend quite a bit of effort to take down the Fire Spirit. However, it was as though Tianyun was on steroids right now, as he slapped the Fire Spirit to death.</p><br/><p>The moment the Fire Spirit dissipated, its connate Fire Element was absorbed by the Demon City instantly.</p><br/><p>After he killed a big bunch of Fire Spirits, Lin Fan turned his head around gently. Looking at how Tianyun killed that 1,000 feet tall Fire Spirit, he felt his heart beat a little faster as well. Was that guy on crack right now?</p><br/><p>But oh well, this was good as well. This would only serve to increase the rate of killing.</p><br/><p>Lin Fan slapped his storage. Instantly, all the Shengyang Pills that he had cultivated in the time earlier were all shattered immediately.</p><br/><p>A gigantic True Skill seed danced around in the Demon City.</p><br/><p>In the blink of an eye, thousands of palm strikes burst forth. As though it was on crack too, Demon City began to expand rapidly as the big ancient demon grew even more berserk.</p><br/><p>'Roc's Breath!'</p><br/><p>The big ancient demon howled furiously as his eyes shone with a deadly gaze. Opening his mouth, he swallowed everything in his face.</p><br/><p>Unable to resist it, countless Fire Spirits found themselves being sucked into the mouth of the big ancient demon.</p><br/><p>'What a terrifying man!' Muqing, who had just killed a Fire Spirit, found her heart freezing up at this scene before her. This was way too horrific for her to watch!</p><br/><p>'Demon God Wheel! Heaven and Earth Demon Door!'</p><br/><p>Grabbing into the void with a vice-like grip, Lin Fan tore the void open wildly. A demonic aura surrounded the entire Heaven and Earth Demon Door as it appeared through the void with a loud thud.</p><br/><p>'Suppress!'</p><br/><p>Instantly, the Heaven and Earth Demon Door let out a boundless amount of Demonic Qi. One by one, figures of Demon Gods wielding weapons with all of their arms charged out. Just like the Black White Impermanence, they started grabbing the Fire Spirits and tossing them into the Demon City.</p><br/><p>'Emptiness Sword Will!'</p><br/><p>Lin Fan was going all out right now as that Emptiness Sword Will filled the entire sky, tearing the void apart like it was a piece of white paper. A dense amount of tightly packed Emptiness Sword Wills pierced their way through the Fire Spirits.</p><br/><p>Pshew! Pshew!</p><br/><p>In the blink of an eye, there was not even a single living being left in the sea of flames.</p><br/><p>'Is this a man or a god?' Looking at that mighty Lin Fan, Tianyun could not help but feel his mind shudder.</p><br/><p>He had only killed several hundreds of them after all the painstaking efforts. To think that this man could be this terrifying to sweep all of them out with the flip of his hand!</p><br/><p>Compared to Lin Fan, Tianyun realized that he was truly way, way too far away from him.</p><br/><p>...</p><br/><p>Following Lin Fan's explosively intensive killing, Demon City shone brightly with a Yellow, Blue, and Red shade. The brilliance of these three beams of light shone through the world, piercing through the Heavens immediately.</p><br/><p>'Connate Fire Element, congeal!'</p><br/><p>'Fire Element river!'</p><br/><p>Lin Fan hollered out as all his power surged forth as well, assisting the Demon City in cultivating the Fire Element river.</p><br/><p>Within that sea of flames, an altar of a Fire God stood upright in the middle.</p><br/><p>Without any hesitation, Lin Fan seized at it immediately. Like Sword Wills of their own, Lin Fan's five fingers sliced through everything. Any Fire Spirit that wanted to defend their Fire God altar were decimated instantly.</p><br/><p>Tossing the Fire God country into his Demon City, the Fire Element river started jerking furiously. All of the Fire Spirits who had just lost their country howled out madly, leaping at the Demon City, wanting to seize back their Fire God country.</p><br/><p>\"Hmph. Throwing yourselves at death's door. Saving me some effort, eh?\"</p><br/><p>Seeing this, Lin Fan was obviously elated. Since they wanted to toss themselves right in, he would naturally accept their deaths.</p><br/><p>BAM!</p><br/><p>The big ancient demon yelled out as that colossal body of his was suddenly filled with an endless amount of flames. These flames possessed a will of their own, containing an indefinite amount of power within them.</p><br/><p>Instantly, a gigantic river descended from the sky, pouring down onto the body of the big ancient demon. However, the flames were not extinguished because of it. Instead, it began to fuse with the water, causing a frightening glow to burst forth.</p><br/><p>'To think that such a change would happen after congealing the connate Fire Element!' Lin Fan was stunned on witnessing the scene before him.</p><br/><p>\"Lin Fan, your treasure is evolving! Hurry up and cultivate it!\" At this moment, Fairy Hongyun's reminder rang through.</p><br/><p>\"Alright.\" Lin Fan was still in a state of astonishment. He had not expected a level up to take place.</p><br/><p>In that instant, the connate Earth, Water and Fire Element began to coil around one another before, shrinking into a compressed ball of liquid that was only the size of a fist. The shape of the liquid ball was changing rapidly before turning into physical words.</p><br/><p>Earth!</p><br/><p>Water!</p><br/><p>Fire!</p><br/><p>These three words that were shining with a mysterious glow began to revolve around the body of the big ancient demon. Then, they flew into the Demon City. Just like brandings, they were etched in three directions.</p><br/><p>Instantly, it was as though the power level of the big ancient demon was seated on a rocket that was bursting forth to the moon.</p><br/><p>Desolate celestial upper level!</p><br/><p>Desolate celestial full cultivation state!</p><br/><p>Divine celestial level 1, True state!</p><br/><p>'Ding…Congratulations. Demon City has evolved into a middle-grade Dao Weapon.'</p><br/>\n</div>"}