{"title": "Chapter 567: Today, I'll Take You On!", "id": 567, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-567-today-ill-take-you-on", "volume_title": "Volume 6", "body": "<h1>Chapter 567: Today, I'll Take You On!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 567: Today, I'll Take You On!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Infinite Bat Old Master was pretty taken aback right now. To think that he couldn't take down that Dao Weapon! This was way too unimaginable! Given his current cultivation state, even if it were an entire mountain, he would be able to lift it up with a single claw-like grab!</p><br/><p>He was absolutely determined to get this Dao Weapon. He wouldn't give up just like this.</p><br/><p>A Dao Weapon was something that was extremely hard to come across. Even after all his time in the Ancient Saint World, he hadn't seized even a single Dao Weapon from anyone till now.</p><br/><p>\"Lad, even though this old man here doesn't know what sort of secret tricks you've been using, I'll have you know that anything this old man takes an eye on, he shall get it for sure. If you do not wish for your death to be worse than it should be, you should surrender now and hand over that Dao Weapon of mine obediently.\"</p><br/><p>Infinite Bat Old Master looked at Lin Fan and the others with a look of belittlement. That swarm of huge Blood Bats flapped their wings open while screeching.</p><br/><p>Their bloodthirsty look caused Tianyun and the others to rattle within their hearts, unable to hide the look of fear on their faces.</p><br/><p>Even though the Infinite Bat Old Master wasn't exactly an earthshattering existence, his methods were extremely cruel and vicious. In fact, even a powerful being who was of a higher cultivation state than the Infinite Bat Old Master might find himself dead against him in a moment of carelessness. With that, every single last drop of blood of his would be sucked dry, while his essence and soul would disintegrate entirely.</p><br/><p>One must never underestimate this old man at all.</p><br/><p>At the same time, Tianyun and the others were utterly exasperated. If it were any other powerful being of the Paradise state, they might even have a chance of escaping. But, to think that the one they would bump into is a sicko like the Infinite Bat Old Master.</p><br/><p>At this moment, Tianyun and Muqing turned their gazes over to Lin Fan. It seemed like Lin Fan was the pillar of support in their hearts right now, as they entrusted every single last bit of hope onto him.</p><br/><p>\"Infinite Bat Old Master?\" Taking a step forward, a ferocious aura burst forth from Lin Fan, suppressing every single Blood Bat in the vicinity. Even though these Blood Bats did not have a high cultivation state, they had their advantage in terms of numbers.</p><br/><p>\"That's right. That's this old man right here. Lad, hand over that Dao Weapon, and this old man might be able to find that little bit of benevolence in his heart to spare the lives of you peasants.\" Infinite Bat Old Master replied.</p><br/><p>That edged nose of his gave a gentle sniff, able to sense the core of every single last living being in this world.</p><br/><p>\"Even though I've got to say that the Human bloodline that's rumbling inside you with such vivacious energy will make for a lovely delicacy. This old man here would rear a living being such as yourself within my Paradise. Every single day, I would suck out a little bit of your blood, ensuring that you live a lifetime of utter torment. However, if you were to hand over that Dao Weapon in your hands, this old man here can vouch that your life will not come to harm.\" Right now, the Infinite Bat Old Master's mind was on getting his hands on that Dao Weapon entirely.</p><br/><p>The reason why he had followed the Cloud Sect into this secret ground was to get a good reaping of course. To think that he would bump into a few disciples who had been isolated.</p><br/><p>And, to think that one of them even had a Dao Weapon! For the Infinite Bat Old Master, this was a sign of his own lucky encounters coming into play.</p><br/><p>The Cloud Sect was a force to behold. In fact, they were a sect that could even hold their own against the ancient race somewhat in the Ancient Saint World.</p><br/><p>Within the sect, there were tons of powerful beings to be found from all sorts of different races. Every single genius of every race out there was recruited in by the Cloud Sect.</p><br/><p>Because of this, even the Infinite Bat Old Master was taking his steps warily, not daring to go head on against the Cloud Sect just like that.</p><br/><p>In the past, he had once sucked a disciple of the Cloud Sect dry. For that, he was hunted down by several elders of the Cloud Sect for a couple of days. Eventually, he was killed by one of the elders with just a single move. If not for the fact that one of his Blood Bats had barely managed to escape death and survive somewhere, he would have long disappeared from this world entirely.</p><br/><p>\"Even though you can swear that you wouldn't kill us, you'd definitely use your Blood Bats to just suck our essence and soul dry entirely. Do you take us for three-year-old fools?\" Lin Fan scoffed coldly.</p><br/><p>\"Hmph! I gave you guys a path to life. Since you guys do not know how to cherish it, this old man here shall take every single one of your lives before seizing this Dao Weapon for myself!\" At this moment, the Infinite Bat Old Master was angered. A tremendous aura emanated out from his body. It gushed over like fierce tidal waves, bent on swallowing Lin Fan whole.</p><br/><p>\"I'll cover while you guys make your escape! I'll look for you guys again once I get rid of this Infinite Bat Old Master!\" At this moment, Lin Fan wasn't fazed in the slightest as he slammed a punch out behind him.</p><br/><p>This single punch was boundless and devastating. Carrying with it Lin Fan's comprehension of the way of the fist, a figure of a Fist God appeared, howling angrily. In a flash, tens of millions of punches rained down, scattering all the Blood Bats that were blocking their way previously.</p><br/><p>\"Take care of yourself!\" Fairy Hongyun understood that they couldn't possibly provide Lin Fan with any help given their current power level. In fact, they might even end up as burdens.</p><br/><p>\"Don't worry. These stinky bats are far from what it takes to kill me.\" Lin Fan replied.</p><br/><p>Looking at Lin Fan one last time, Tianyun cusped his fists together.</p><br/><p>Turning into a streak of light, the three of them left the place.</p><br/><p>The Infinite Bat Old Master did not stop them at all. After all, his target was Lin Fan. As long as Lin Fan was alive, it didn't matter whether or not those ants got to leave.</p><br/><p>Fairy Hongyun and the others traveled at a really fast speed. In a jiffy, they were out of the vicinity of Infinite Bat Old Master's Blood Bats.</p><br/><p>\"Junior sister, do you think he'll be alright?\" Tianyun asked, slightly worried.</p><br/><p>\"I've got no idea, but I doubt anything will happen to him.\" Fairy Hongyun couldn't reply with utmost confidence. \"Let us hurry up and seek out our elders and the others. If we can make it in time, we might even be able to return to help him with reinforcements.\"</p><br/><p>\"I guess that's the only way right now.\"</p><br/><p>...</p><br/><p>At this moment, Lin Fan was in a standoff against the Infinite Bat Old Master. To the Infinite Bat Old Master, this fella was already a piece of meat on the chopping board, readily available for grilling.</p><br/><p>\"Lad, not bad! Knowing that you can't defeat me, you sent them on their way away first. But, don't worry! Once this old man here is done with you, they wouldn't be able to escape from my hands either.\" The Infinite Bat Old Master laughed coldly.</p><br/><p>\"Huh? What's up with all the crap you're spouting? Yours Truly is here to test out just how capable that Paradise of yours is!\" Lin Fan tossed his robes back, filled with a splendid fighting intent. It was time for him to test out just how far off he was from a divine celestial level 3, Paradise state being!</p><br/><p>\"Know your place, hmph! Bat God's Nest!\"</p><br/><p>Suddenly, the Infinite Bat Old Master struck out with a fist. With that, a series of blood colored circles rippled out, with his fist as the core.</p><br/><p>\"Enjoy your lifetime of suffering in this old man's Paradise! That Dao Weapon of yours shall be taken by this old man here for sure!\" The Infinite Bat Old Master looked at that precious Dao Weapon lustfully.</p><br/><p>The aura being emanated from the Demon City was causing the Infinite Bat Old Master to feel exceptionally excited. This was especially the case for that thick, aromatic scent of the bloodline of that weapon spirit. Infinite Bat Old Master could truly feel that if he were to be able to absorb even a little of that fresh blood, he would definitely be able to raise his Paradise to the next level.</p><br/><p>Those blood colored ripples expanded rapidly, and before Lin Fan knew it, he was encompassed within them. His surroundings were no longer bright, but stained blood red.</p><br/><p>Everything above him was blood red while pulsating continuously, as though it was a living piece of meat above him.</p><br/><p>However, Lin Fan knew clearly that those were the Blood Bats. This was the Infinite Bat Old Master's Paradise.</p><br/><p>No matter the sort of living being it was, as long as they were trapped within this Paradise, they would definitely find themselves sucked into a dried up corpse by these Blood Bats.</p><br/><p>Lin Fan's favorite activity was to chop up monsters that were above his level. However, ever since he had become a divine celestial, he was starting to realize that every single state was a world of difference.</p><br/><p>If he wanted to kill monsters that were above his level like before, that would be way too difficult.</p><br/><p>However, one thing Lin Fan loved to do was to turn the impossible into a possible. So what if this was a divine celestial level 3, Paradise state being? He wanted to use these very hands of his, along with the booster of the system of course, to suppress down every single last thing, and change every single impossible event into one that could happen.</p><br/><p>After all, he was someone who possessed a myriad of unparalleled skills that were leveled up and evolved, coupled with countless mythical items which possessed BUG like effects.</p><br/><p>This day here, he would go forth and have a good battle with this so-called divine celestial level 3, Paradise state powerful being!</p><br/>\n</div>"}