{"title": "Chapter 571: Skyrocketing Tension.", "id": 571, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-571-skyrocketing-tension", "volume_title": "Volume 6", "body": "<h1>Chapter 571: Skyrocketing Tension.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 571: Skyrocketing Tension.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Seems like the Fire Water Secret Grounds is going through some unrest right now.\" Lin Fan focused his gaze into the distance. He could sense some disturbance up ahead, as a series of auras pierced their way into the void.</p><br/><p>Furthermore, it didn't seem as though the clashes were happening on a single spot. Fights were breaking out in all directions.</p><br/><p>The Fire Water Secret Grounds were unestablished secret grounds. Evidently, they were in the sights of coveters.</p><br/><p>However, in a place like this, no matter how many treasures there were, there would definitely be more people grabbing and fighting over them. They would definitely not be enough for everyone. As such, with the dangers lurking around them, they would have to watch their backs.</p><br/><p>With that, Lin Fan chased in the direction where Fairy Hongyun and her sect members had headed off to.</p><br/><p>After Lin Fan's departure, the void trembled. At the spot where Lin Fan was moments earlier, a few men appeared out of nowhere. One of them frowned and tore a hole in the void with a curl of his finger like a mountain.</p><br/><p>\"The Infinite Bat Old Master has been slain. Who in the world would have the capabilities to do so?\"</p><br/><p>The man's expression changed to one of a slight bewilderment. While the actual powers of the Infinite Bat Old Master weren't all that strong, his Paradise was utterly mysterious and strange. It was extremely difficult to kill someone like him.</p><br/><p>\"Brother Luo, there's no lack of wealth to be found in this Fire Water Secret Grounds. The Infinite Bat Old Master was a greedy person who knew no bounds. It wouldn't be that much of a surprise for him to bump into someone tough and get himself killed in reverse.\"</p><br/><p>Another man looked really frosty. His gaze was split into Yin and Yang, with the Yin Yang Qi swirling within his eyes. It was as though he could reverse the Heaven and Earth, changing all of the worlds upside down.</p><br/><p>\"The Fire Water Emperor was a powerful being of the old ancient times. His lifetime's worth of fortune must definitely be astounding. Amidst it, the most valuable item is the True Essence of Water and Fire. If one can obtain the True Essence of Water and Fire, they can inherit the legacy of the Fire Water Emperor. We mustn't linger around here, lest someone else snatches it away.\" A man who was holding on to a hand fan commented.</p><br/><p>This man's disposition was graceful. However, a strong killing intent emitted from him from time to time, which was pretty obscure.</p><br/><p>Despite that, the single strain of killing intent that was sensed from time to time could rattle one's spirits, and have them delve entirely into the power of that endless killing will.</p><br/><p>\"Life Stealing Scholar, the three of us have already agreed that we would walk this path together as comrades. Our encounters shall depend on our fates from the Heavens itself. Whoever dares to backstab anybody shall be shown no mercy from the rest of us.\" Luo Yi gave a grave reminder.</p><br/><p>\"That's for sure. Alright then, let us hurry on our way. This time around, there are quite a number of elders from the Cloud Sect who have come along. Their powers must be pretty decent. Things should get a little tricky. Let us make sure to take care.\" The man with the black and white eyes smiled indifferently.</p><br/><p>...</p><br/><p>At this moment, Lin Fan was observing the situation in the Fire Water Secret Grounds keenly. The deeper he delved into this place, the more he was realising how complex this Fire Water Emperor was. To think that the Heaven and Earth Spirit Qi within this dimension that he had opened up would be this dense and thick! In fact, it was even comparable to that of the Ancient Saint World itself!</p><br/><p>Furthermore, the surroundings were all filled with spirit herbs! Even though some of their levels weren't all that high, they were still pretty useful for Lin Fan.</p><br/><p>Along his way, Lin Fan had collected all the Spirit Herbs he had come across.</p><br/><p>Perhaps these might be items that others might not take a liking to. However, a Grandmaster of cultivating pills such as Lin Fan could create elixirs out of any single spirit herb that no one else would even bother with.</p><br/><p>Lin Fan looked ahead into the distance and spotted Fairy Hongyun, Tianyun and Muqing standing together. Near them were a group of people, who were standing still at their spots as well.</p><br/><p>\"Everyone, watch out! Someone's coming!\"</p><br/><p>Suddenly, a man within the group felt some vibrations through the void around him. His face changed immediately as he threw out those words of caution.</p><br/><p>To think that someone could remain hidden while avoiding their detection! They could only sense the might of the vibrations from the voids upon their arrival.</p><br/><p>The disciples of the Cloud Sect felt their mental states shuddering fiercely while their faces changed.</p><br/><p>Ever since they had entered this place, they were separated from their elders. Within this Fire Water Secret Grounds, they had to tread with extreme caution, lest they met with any powerful beings.</p><br/><p>The moment Fairy Hongyun caught sight of who it was, her face changed into one of elation as she hurried forth, 'Everyone, relax! He's my friend!'</p><br/><p>The moment the masses heard the words of Fairy Hongyun, they heaved a sigh of relief as well.</p><br/><p>The moment Tianyun and Muqing caught sight of Lin Fan, their hearts skipped a beat in happiness as well. Even though this man was pretty close to his junior sister, Tianyun could tell that he was not a bad person. Also, he didn't seem so irksome anymore. Therefore, the grudges that Tianyun bore towards Lin Fan earlier on had disappeared by now.</p><br/><p>\"Are you alright!\" Fairy Hongyun had not expected Lin Fan to arrive this quickly! She had only just met up with her fellow sect members!</p><br/><p>\"Yup, I'm alright. Even though the Infinite Bat Old Master was a little tricky, it's all over now.\" Lin Fan replied before sweeping his gaze at the group of people around him.</p><br/><p>All of their auras were different, as they varied in race. However, their cultivation states were pretty decent. Some of them were divine celestials, while others were desolate celestials.</p><br/><p>However, if these people were to bump into someone like the Infinite Bat Old Master with their current cultivation states, they would definitely not be of any match for him.</p><br/><p>\"The Infinite Bat Old Master is dead?\" Hongyun was stunned, somewhat in disbelief.</p><br/><p>\"Yes. He has already been killed by me. Even though the methods of the Infinite Bat Old Master were somewhat strange, he treads on the path of evil.\" Lin Fan replied casually. Even though the Infinite Bat Old Master was of the Paradise state, his actual powers weren't all that fearsome. The only thing fearsome about him was that ability of his to resurrect indefinitely.</p><br/><p>However, after Lin Fan had seen through his tricks, he was only worth that much at the end of the day.</p><br/><p>Fairy Hongyun could feel her heart pounding right now. To think that he would be able to kill the Infinite Bat Old Master, whom even the elders of her sect couldn't kill! His methods and powers were utterly shocking!</p><br/><p>But of course, Lin Fan's powers right now couldn't be compared to those of the Cloud Sect elders. After all, those elders had not managed to unveil the tricks of the Infinite Bat Old Master, and that was all. They did not know of the fact that he was able to resurrect himself with the Black Heavens Bat Kings even after they had killed him.</p><br/><p>However, that one encounter had the Infinite Bat Old Master injured severely as well.</p><br/><p>All the Black Heavens Bat Kings within the Paradise were slaughtered cleanly by the elders of the Cloud Sect. In the end, it was only one single Black Heavens Bat King who had managed to escape unscathed.</p><br/><p>The Infinite Bat Old Master had only managed to regain his strength after recuperating for a few years.</p><br/><p>\"Hongyun, this friend of yours is…?\" Now that they were separated from their elders, the current leader of this group of Cloud Sect disciples was a senior brother of hers. The moment he caught sight of Lin Fan, his eyes shone with one of disdain.</p><br/><p>\"This man here is the pride of the Human race, Lin Fan. Back when I was being hunted down by the Evil Alliance, he was the one who had saved me. Earlier on when we bumped into the Infinite Bat Old Master, he was also the one who had paved the way for my escape together with senior brother and sister. I was the one who invited him with me into the opening of the Fire Water Secret Grounds.\" Fairy Hongyun explained.</p><br/><p>\"Lin Fan, this is my senior brother here, Fang Weifeng. Senior Brother Fang.\" Fairy Hongyun gave Lin Fan an introduction as well.</p><br/><p>\"My pleasure.\" Since this was one of Hongyun's senior brothers, Lin Fan was naturally courteous and polite with his replies.</p><br/><p>Fang Weifeng cast a single glance at Lin Fan before turning his eyes onto Fairy Hongyun, \"The Fire Water Secret Grounds is an extremely important place. How could you bring someone in without even knowing of their background? The difference between a good and a bad person isn't something you can tell with your naked eyes.\"</p><br/><p>Lin Fan's brows creased, somewhat displeased. Did this guy have a mental problem? Yours Truly had not offended him in any way at all. Why the hell was there so much tension at their first meeting?</p><br/><p>\"Senior brother, Brother Lin here has saved my life. Furthermore, he took down the Infinite Bat Old Master as well. We would definitely be more secure with Brother Lin around.\" Tianyun stood up for Lin Fan.</p><br/><p>\"Such big words. Secure with him around? Tianyun, you're getting bold now, aren't you? Making decisions all on your own. How dare you disregard the words of Senior Brother Fang?\" Suddenly, one of the disciples who were standing beside Fang Weifeng stood out to lecture Tianyun.</p><br/><p>\"Senior Brother Weitian, that is not my intention.\" Tianyun replied.</p><br/><p>\"That's enough! Even our elders could not kill off the Infinite Bat Old Master and you're saying that this guy has the capabilities to do so? Who knows if he had let you guys leave earlier on so that he could plot in secret with the Infinite Bat Old Master!\" Weitian's reply was extremely overbearing as he stood tall.</p><br/><p>\"Senior Brother Wei! How could you be so accusatory?\" Tianyun rebutted.</p><br/><p>\"Impudent! UTTERLY DISRESPECTFUL OF YOUR SENIORS!\" Weitian's face turned cold instantly as he struck out in a flash.</p><br/><p>All the while, Fang Weifeng stood still with an indifferent look. He did not intend to step in to stop this fiasco. Evidently, this was also a demonstration of strength to Lin Fan.</p><br/><p>It was to show the latter who the true leader around here was.</p><br/>\n</div>"}