{"title": "Chapter 577: Coexistence Of Pain And Happiness.", "id": 577, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-577-coexistence-of-pain-and-happiness", "volume_title": "Volume 6", "body": "<h1>Chapter 577: Coexistence Of Pain And Happiness.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 577: Coexistence Of Pain And Happiness.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>By now, Lin Fan had no idea what he should say any longer. Everything was happening way too suddenly!</p><br/><p>The might of Biggra was something that was unparalleled! However, Lin Fan was a man of conscience. Hence, he had never ever used it on a woman.</p><br/><p>However, to his disbelief, the masked person turned out to be a woman!</p><br/><p>In life, there would always be times where one would commit mistakes. Originally, this wouldn't cause any issues at all. Even though he might have fed a woman some Biggra by accident, so what? At most, he would just let the woman deal with it herself. She could follow on the path of the Snow Lion in the past and settle her desires on her own.</p><br/><p>But this time around, he was played right into the equation as well!</p><br/><p>Biggra was truly a pill that had no antidote to it. This was precisely the reason why it was termed as the strongest BUFF there ever could be! If there were an antidote to it, that would mean that there was a weakness to Biggra, and Lin Fan would probably not refer to it as his strongest existence by then.</p><br/><p>And just as Lin Fan was in the midst of struggling, the Fire Water Chick shuddered as though a wave was going to gush out.</p><br/><p>\"Don't tear at my clothes! You're a beast…!\" Lin Fan hollered. However, how could his petite little body fight against the furious assault of this Fire Water Chick?</p><br/><p>\"F*ck my life! To think that Yours Truly would be forced on by a 10,000 years old hag! Where's the justice in this, dear heavens?\" Lin Fan was railing curses. How could he be tainted by this old woman here?</p><br/><p>\"All of you, hurry come out and help me!\" Lin Fan called upon his Dao Weapons. However, to Lin Fan's dismal, a single burst of aura from the Fire Water Emperor had every single one of the Dao Weapons suppressed, rendering them immobile within his body.</p><br/><p>\"Don't bite at my neck! What's that hand of yours up to? What are you trying to do?\" Lin Fan struggled furiously. However, all of a sudden, his entire body quivered.</p><br/><p>To think that the tender, boneless hand of the Fire Water Chick would stretch itself right into the pants of Lin Fan's groin area! That delicate lily white hand of hers was slowly touching up Lin Fan's groin. That hand technique of hers was superb and well polished, causing Lin Fan to be completely stumped!</p><br/><p>\"Y-you…you…!\" Lin Fan had not expected such skills from the Fire Water Chick! This was entirely out of his expectations!</p><br/><p>\"No! How can I allow you to succeed?\"</p><br/><p>\"Spiritual and mental defense! I'll hold it in and I'll hold it in! I'll definitely not get hard!\" Lin Fan was fighting back furiously, channeling all his magical powers while forcefully suppressing everything back. He was bent on not allowing the Fire Water Chick to get her way!</p><br/><p>The Fire Water Chick, who was entirely disoriented by the Biggra, could not help but get anxious right now. It was as though she could not find a way to vent all her frustrations!</p><br/><p>Lin Fan was grappling in this wrestling, determined not to let the Fire Water Chick invade him.</p><br/><p>This beautifully and red flushed Water Fire Chick was pushing down on Lin Fan with one hand, rendering him motionless. With her other hand, she was still furiously tugging and playing with his groin. Suddenly, Lin Fan realized that his defenses were being torn down by the frenzied Fire Water Chick!</p><br/><p>Instantly, an endless amount of energy was being given out by the palms of the Fire Water Chick.</p><br/><p>Lin Fan instantly felt his body being sealed by some sort of a lock, rendering him entirely motionless. In fact, he couldn't even lift a single finger!</p><br/><p>\"Holy f*ck! Y-you…!\" Lin Fan was utterly stumped right now. To think that this Fire Water Chick would seal him up as such before taking her time to play with him!</p><br/><p>How could Lin Fan endure something like this at all?</p><br/><p>'I'll never ever bow down to you!' Lin Fan's eyes were resolute.</p><br/><p>By now, all of Lin Fan's clothes were stripped cleanly by the Fire Water Chick. Even though the Fire Water Chick herself was trying her best to resist this in her heart, she only thought that was swarming her mind under the influence of Biggra was to release. She wanted to release and vent all of these frustrations!</p><br/><p>While her mental state was being rattled by Biggra, her innate capabilities were still existent. For her to be able to become the Fire Water Emperor, her knowledge of the world was definitely something that mere commoners could not hope to compare with.</p><br/><p>In the flash of an eye, Lin Fan suddenly realized that the finger of the Fire Water Chick was lighting up with a bright glow.</p><br/><p>This glow seemed to be fused with the essence of Fire and Water; hot and cold, warm and cool. The magical powers of these properties were imbued at her fingertips, causing Lin Fan much difficulty in resisting this.</p><br/><p>'To think that this is the Fire and Water Twin Heavens!' Lin Fan couldn't hold it any longer. The tables had turned entirely. He was utterly incapable of resistance right now.</p><br/><p>A towering pillar ensued.</p><br/><p>'F*ck! I'm dead!' Lin Fan looked at the situation unfolding before him and shut his eyes gently. Two clear streams of tears ran down the course of his cheeks.</p><br/><p>This time around, he had really been f*cked big time. The other party really got the better of him. From this point forth, there would be a blemish on this life of his.</p><br/><p>Lin Fan's tears of despair made their way down from her eyes. When he next opened his eyes, the Fire Water Emperor was riding on him.</p><br/><p>She was free and happy like a cheery cowgirl riding on a rapid horse, galloping around the grasslands with fervor, humping wildly, bumping crazily, and yelling shrilly.</p><br/><p>Those two cute, little red cheery dots danced in front of Lin Fan's eyes in a hypnotizing cycle.</p><br/><p>Suddenly, Lin Fan discovered a vacuum like suction appearing at his groin area. At the same time, two distinctively mysterious energies were gushing into his body.</p><br/><p>'This is…?' Lin Fan did not know what was going on right now. Before long, he found himself immersed deeply within his Inner World.</p><br/><p>The colors of red and blue were intertwined in the form of two long rivers originating from the body of the Fire Water Emperor. Upon receiving this twin surge of energy, the slowly growing Mythical Parasol Tree suddenly bloomed lusciously, as its roots grew ever thicker and stronger.</p><br/><p>'It's germinating once more!' The secret of the Mythical Parasol Tree was something that had yet to be uncovered entirely by Lin Fan. Normally, he would let it absorb the Saint Spirit Qi of the surroundings and boost it with his own vitality and magical powers.</p><br/><p>However, the current growth spurt of the Mythical Parasol Tree had Lin Fan seeing a new world of hope altogether.</p><br/><p>These twin energies should be the True Essence of the Fire Water Emperor's core!</p><br/><p>Not only were these twin True Essence nourishing the Mythical Parasol Tree, they were seeping within Lin Fan's own realm as well.</p><br/><p>Even though this was only a single strain of the Fire Water Emperor's Essence Spirit, it possessed a portion of the Fire Water Emperor's core. Everything that was going on right now was being transmitted to the main body of the Fire Water Emperor as well.</p><br/><p>Even though Lin Fan had cultivated out his realm, its foundation wasn't all that firm just yet. It was still a piece of work in progress, requiring constant absorption of energy, replenishment, and refining.</p><br/><p>However, under the surge of these twin energies, Lin Fan realized that all the Gods of his Skills within the realm were appearing on their own as well.</p><br/><p>Following that, they started sitting down in a cross-legged position, making use of this twin energy to cultivate themselves.</p><br/><p>Even though it hadn't been that long since Lin Fan had started his path of cultivation, he was someone with a wide knowledge of things. He knew that this was a once in a lifetime opportunity.</p><br/><p>The source of the twin powers that the Fire Water Emperor cultivated was stronger than anything else in this world.</p><br/><p>At its core, Water was used to cleanse every single thing in this world. On the other hand, the core of Fire was used to refine and forge everything in the world.</p><br/><p>BOOM!</p><br/><p>Suddenly, a loud explosion rang out from Lin Fan's realm, and a series of thunderbolts cruised through it. The refinement of true Fire and the nourishment of Water… Under the surge of these two powers, Lin Fan's realm was growing rapidly, and being improved comprehensively.</p><br/><p>At the same time, the realm was starting to take on different shapes. The realm shone with a crystallized radiance. This sparkling gleam was filled with an endless amount of energy, causing Lin Fan's realm to expand outwards continuously.</p><br/><p>\"Master! This energy is way too wondrous! I feel as though I'm about to reach the state of Dao right now!\"</p><br/><p>All of the Skill Gods stood upright within the realm right now. Their bodies illuminated with all sorts of divine luster as though they had just comprehended some form of energy from the unknowns.</p><br/><p>Suddenly, a burst of energy ripped through Lin Fan's realm, creating a black hole. Even though Lin Fan did not know what was going on, he was entirely startled when he took a closer look.</p><br/><p>To think that this was the Paradise of the Fire Water Emperor!</p><br/><p>An aurora was spreading out from the Paradise of the Fire Water Emperor, illuminating Lin Fan's realm. Each place the aurora landed, flowers would blossom, creating life wherever it went.</p><br/><p>'Just how in the world was this Paradise created?' Lin Fan was utterly stumped right now. To think that the Paradise of the Fire Water Emperor would look exactly like a real world!</p><br/><p>Living beings trods around everywhere while the sun shone brightly up in the sky. Countless living beings made their way into Lin Fan's realm and began to cultivate the ground within his realm, planting down innumerable Seeds of Hope.</p><br/><p>Compared to the Paradise of the Fire Water Emperor, the Paradise of the Infinite Bat Old Master could hardly be considered as a Paradise at all!</p><br/><p>Within the lands of the eight Utmost Beings of the Ancient race…</p><br/><p>Eight towering spires stood between the Heaven and Earth. Between them, something was happening in that gigantic black hole that was covered up by a web of light beams.</p><br/><p>Instantly, all eight Utmost Beings of the Ancient race disappeared from their thrones.</p><br/><p>The next time they reappeared, they were already floating above this gigantic hole that was spread out over a vast area.</p><br/><p>'Suppress.'</p><br/><p>A massive amount of energy pushed down upon the hole, repressing the vibrations that were occurring right now.</p><br/><p>Within that pitch black and enigmatic black hole, a woman was flushed red. There was a mixture of expressions on her face right now.</p><br/><p>Some anger.</p><br/><p>Some embarrassment and shyness.</p><br/><p>Some shock.</p><br/><p>However, the most prominent one was the domineering intent within her eyes.</p><br/><p>'Just who in the world is this human? To think that the two great True Essence would actually show signs of wanting to fuse!'</p><br/>\n</div>"}