{"title": "Chapter 587: A Fate Worse Than Death, Played In The Hands Of Others", "id": 587, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-587-a-fate-worse-than-death-played-in-the-hands-of-others", "volume_title": "Volume 6", "body": "<h1>Chapter 587: A Fate Worse Than Death, Played In The Hands Of Others</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 587: A Fate Worse Than Death, Played In The Hands Of Others</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"You wanna play with me? Courting your own death!\"</p><br/><p>Lin Fan tossed his robes aside as the Heavens toppled while the ground cracked. Every single being would bow down to his might. So what if it was a divine celestial level 4, Undying state powerful being? Their fates were been decided the moment they met with Yours Truly!</p><br/><p>Naturally, killing a powerful being of the Undying state came with many benefits. All their essence, spirit, and vitality were absorbed by the big ancient demon as Lin Fan took their Paradise within his own.</p><br/><p>Lin Fan discovered that the higher was one's cultivation state, the more benefits there were.</p><br/><p>As a powerful being of the Undying state, every single piece of meat from Old Demon Kui Sheng possessed an enormous amount of powers within. For a powerful being of this state, even a single thumb-sized piece of meat from them could turn a desolate celestial being into a piece of pancake.</p><br/><p>Therefore, the benefits that were obtained from a powerful being such as Old Demon Kui Sheng were comparable to killing tens of thousands of desolate celestial beings. In fact, it might be even more than that. This was the difference in terms of quality alone.</p><br/><p>The moment he got out of this Fire Water Secret Grounds, Lin Fan would definitely absorb the Paradise Shard of Sovereign King Wei obtained earlier on. That would definitely raise his Paradise to the next level.</p><br/><p>Borrowing the power of that Paradise Shard, entering divine celestial level 4, Undying state would definitely not be something difficult. However, the priority right now for Lin Fan was to check out how Luo Yi and that Ancient race being was doing.</p><br/><p>...</p><br/><p>\"I wonder what's happening within right now.\" Elder Yun He stroked his long beard as he commented solemnly. Looking at that Paradise where flashes of lightning were happening from time to time, Fairy Hongyun's face was fraught with worries.</p><br/><p>They could no longer see what was happening within the Paradise by now. However, the only thing that had them less worried was the fact that the Paradise was still up. This meant that nothing fatal must have happened to Lin Fan just yet.</p><br/><p>Old Demon Kui Sheng, Luo Yi, and that Ancient race being were all powerful beings of the Undying state. Each of them was as mighty as the Heavens itself. Their auras alone were impressively astounding, while they could control the weathers with every single flip of their palms.</p><br/><p>One versus three… This wasn't anything they could have imagined ending well at all. At this moment, Elder Yun He was ever more determined to make some closer ties with this pride of the Human race.</p><br/><p>As long as he didn't die here, his might would definitely surpass everyone else. He was fated to be someone who would stand above at the peak.</p><br/><p>\"Elder, can't you see through it at all?\" Hongyun asked.</p><br/><p>\"I can't. That Paradise is way stronger than any normal Paradise. Just look at those crystallized walls that have materialized. They are as thick as the mountains itself. I wonder how he could have cultivated something as such.\" Elder Yun He commented in acknowledgment.</p><br/><p>Within the Paradise, Lin Fan had been searching for a long time now. By the time he finally found Luo Yi, he was completely stumped.</p><br/><p>Dirty… This was way too dirty!</p><br/><p>So be it if the Spirit of Biggra was dirty alone. Why in the world was the Mythical Parasol Tree being equally dirty?</p><br/><p>Pschhhh! Pschhhh!</p><br/><p>\"Electroconvulsive therapy! I shall bring you into the path of the light! Electrocute, electrocute!\" The Thunder Trainer King was emitting a saintly glow all over his body. At this moment, he was holding onto a circuit box in his hand, along with two whips that were made up of lightning. He tossed them out at both sides of Luo Yi's butt cheeks.</p><br/><p>\"Long Xuan, what are they doing?\" Xiguang asked, puzzled.</p><br/><p>\"Do not view such humiliation. Little Guang, let us turn our gazes away.\" Long Xuan's face tightened up as he covered both of Xiguang's eyes. In front of this scene, even he was feeling a little taxed emotionally.</p><br/><p>\"Brother Mythical Parasol Tree, can you suck him a little slower? All of Your Trainer King's electroconvulsive energy is being sucked up by you as well!\" The Thunder Trainer King remarked in a hurried look.</p><br/><p>\"Brother Spirit of Biggra, can I trouble you to increase your potency? Let him increase his speed of pumping! I've realized that this fella is really stubborn and is still trying to resist!\"</p><br/><p>\"Sure, no problem!\" The Spirit of Biggra smiled indifferently as he increased the dosage of Biggra.</p><br/><p>At this moment, Luo Yi's face was flushed entirely red as he cried out. Hugging onto a round shaped tree branch, he was pushing back and forth repeatedly. This speed of pumping was extremely rapid.</p><br/><p>\"You guys…what in the world are you guys doing?\" Lin Fan was totally flabbergasted right now. What in the world were his guys trying to do? To think that a well and dandy powerful being of divine celestial level 4, Undying state would be toyed around in the palms of such shameless disciples!</p><br/><p>Lin Fan was especially exasperated by the set up that the Thunder Trainer King was using. Bloody hell! Wasn't this the electroconvulsive therapy set up that was used back on Earth?</p><br/><p>How in the world would this bloody Thunder Trainer King know of such techniques and ideas?</p><br/><p>Could it be…? The demon would spawn from one's heart. Could the appearance of the Thunder Trainer King be due to some past attachments that Lin Fan had on Earth, causing his materialization?</p><br/><p>At this point, it was impertinent for Lin Fan to explain. Before he had arrived in the Xuanhuang World from Earth, Lin Fan had always been someone who loved helping others. In fact, he had even voluntarily enrolled himself into an Electroconvulsive Therapy Academy as a volunteer for a short stint.</p><br/><p>With that, he managed to salvage numerous teens who had fallen into the abyss of internet addiction.</p><br/><p>\"Master!\"</p><br/><p>\"Master!\"</p><br/><p>Looking at who it was that had approached them, all of the Skill Spirits came to a shock before quietening down.</p><br/><p>\"Master, this man here is incredibly stubborn and has fallen deep into the lost path! Your Trainer King here is trying to salvage him out of his torments!\" The Thunder Trainer King began to explain his actions. Immediately, his expression changed into one of benevolence as he turned around to his many toddler students who had been guided onto the right path by him.</p><br/><p>\"Take a good look! The Electroconvulsive Therapy Academy is made to save all of these lost sheep! This man here shall be your junior brother! Now that he's lost deeply into the abyss of being evil, I've got to use quite a bit of effort in order to bring him back to us!\"</p><br/><p>\"If I don't enter Hell, who would? Your Trainer King shall deploy my 36 Stances of Electroconvulsive Therapy. The first Stance, Lightning Rake!\"</p><br/><p>This pure, benevolent heart of the Thunder Trainer King lit up the entire Paradise with a dazzling brilliance. In fact, the back of his head glowed even more brightly and saintly!</p><br/><p>\"Oh! The mercy of our Trainer King! Our Chairman is ever so compassionate!\"</p><br/><p>Now that all of those toddlers had been trained up, they cheered loudly in awe.</p><br/><p>\"Damn it! Let me go! All of you are beasts!\" Even though Luo Yi's body was fully controlled by Biggra, his mind remained lucid as ever.</p><br/><p>The fact that all of these fellas who had appeared out of nowhere were putting him under such humiliation was already causing Luo Yi to be feeling extremely aggravated. He had wanted to kill off all of these guys. However, he realized that he wasn't in full control of his body.</p><br/><p>It was as though that circular shaped and bottomless tree branch at his groin region was his favorite item in the world, as he couldn't pull himself out of it no matter how hard he tried.</p><br/><p>However, the tree branch was actually collecting his Paradise Shard as well as the essence, spirit, and vitality of his body entirely.</p><br/><p>If this were to carry on, he would definitely be dead meat for sure!</p><br/><p>The moment Luo Yi entered this Paradise, he had wanted to break his way out of this place almost immediately.</p><br/><p>However, it wasn't long before he realized that something was off.</p><br/><p>A mysterious mist was shrouded within this Paradise. Along with the passing of time, he realized that something weird was going on in his body, as though he was losing all control over it.</p><br/><p>He had tried resisting at the start. But it seemed as though this mist could disregard his suppression techniques entirely, as it found its way into the depths of his heart, before he was completely lost within it.</p><br/><p>Almost right after, these bunch of fellas about whom he had no single bit of idea came swarming from all over the place and started playing with him wantonly!</p><br/><p>'AHHHHHHHHHHHHHHHH!'</p><br/><p>A piercing cry rang through the void.</p><br/><p>An immense power of lightning found itself wrapped around the body of Luo Yi. This mysterious feeling was like a sharp blade that pierced its way straight into the depths of his heart.</p><br/><p>And just at this moment, Lin Fan realized that the tree branches of the Mythical Parasol Tree were rustling in the distance as well. Looking above them, he found out in shock that the Ancient race being of an Undying state was right above them!</p><br/><p>The Ancient race being's actions were exactly the same as what Luo Yi was doing right now. It seemed to be taking the tree branches of the Mythical Parasol Tree as the most ravishing and breath-taking woman in this entire world. The Ancient race being's body was thrusting back and forth, committing this sinful and shameless act.</p><br/><p>He growled out repeatedly with a tomato-like flushed face, as though he was trying to vent out all that pent-up frustration.</p><br/><p>\"It's coming, it's coming! We've got on our hands yet another lost sheep! As the Thunder Trainer King of this Electroconvulsive Therapy Academy, I've got the responsibility to bring him back to our midst!\" Looking at the Ancient race being, the Thunder Trainer King's face was suddenly gleeful as his eyes shone with an incredible glint.</p><br/><p>Looking at everything before him, Lin Fan did not know what he could say any longer.</p><br/><p>'Beastly. This was simply way too beastly!'</p><br/><p>Every single powerful being in this world had a pride!</p><br/>\n</div>"}