{"title": "Chapter 581: Possessed By The God Of Mockery", "id": 581, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-581-possessed-by-the-god-of-mockery", "volume_title": "Volume 6", "body": "<h1>Chapter 581: Possessed By The God Of Mockery</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 581: Possessed By The God Of Mockery</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Holy shit. Why the hell are they still rambling on? Hurry up and get on with the fighting!\"</p><br/><p>Lin Fan was getting anxious now. Fairy Hongyun had already rushed into the fray without care of her own safety, seeing how her elders were being repressed back. To Lin Fan, this was totally expected.</p><br/><p>However, since this was already the case, then they should hurry the hell up and fight so that he could sweep the scene clean!</p><br/><p>However, they weren't doing that at all! In fact, they were just talking nonsense one after another. How long more were they going to keep Yours Truly waiting for?</p><br/><p>'Holy sh*t! F*ck all of you sh*ts! Since you guys don't wanna fight, Yours Truly shall start the ball rolling with the first wave!'</p><br/><p>The highest cultivation state amongst them was only a divine celestial level 4, Undying state. Was he supposed to be afraid of something like that?</p><br/><p>F*ck! At times like these, he must definitely f*ck them up!</p><br/><p>Wasn't this just a fight? It was time to see who's afraid of whom!</p><br/><p>By now, Yun He did not have any more expectations towards this Fire Water Secret Grounds. Given the way things were right now, it would be a blessing if they could even get out of this place alive.</p><br/><p>He wondered how his disciples were right now. Could they all have been slain upon entering this place?</p><br/><p>\"Hongyun, what are you looking for?\"</p><br/><p>Suddenly, Elder Yun He realized that Hongyun's focus was off as she gazed around in all directions, seemingly seeking something. Hence, he probed curiously.</p><br/><p>\"With him around, we'll definitely be fine. Only, I do not know where he is right now.\" Hongyun whispered softly.</p><br/><p>\"Hais…\" Upon hearing these words, Yun He chuckled exasperatedly. This disciple of his had everything, a good gift, potential, and personality. The only flaw about her was that she was way too naïve.</p><br/><p>At a moment as such, how could he even come out of hiding?</p><br/><p>Everyone before them were extremely formidable. If he weren't a fool, he would definitely not send himself out to die. Furthermore, they were only strangers who had met by chance. Why would he take such a risk for her?</p><br/><p>Silly disciple, silly. She was just too trusting of others, and saw everyone through rose tinted glasses.</p><br/><p>However, Elder Yun He did not refute her outright. Now that things had come to this, he might as well let Hongyun bear some hopes for their final moments.</p><br/><p>It was just that he had not expected this well hidden secret ground to be discovered by others.</p><br/><p>Looking at the situation before them, the four Ancient race beings exchanged glances with one another. Now that there was a burden added into the fray, things would definitely get easier from here on forth.</p><br/><p>They had greater confidence of killing this group of people right now.</p><br/><p>However, those five people who were enjoying the show from the sidelines were definitely watching covetously. However, the thought of the Ancient race army arriving outside this place had their fears erased entirely.</p><br/><p>\"Damned living beings! Go to hell!\" In a flash, the four Ancient race beings unleashed a tremendous amount of energy that erupted out from inwards.</p><br/><p>The moment Mu Tian and the others caught sight of the Ancient race making the first strike, their attention was focused even more intently. They were all ready to sneak in their attacks. However, Mu Tian was watching the others warily as well.</p><br/><p>At this juncture, every single promise and whatnot were all dogsh*t lies. The true victor would be the one who manages to obtain the treasure of the secret grounds.</p><br/><p>\"Watch out!\" Yun He's face froze up. Instantly, he retaliated at the Ancient race, bursting off like the clouds.</p><br/><p>Hongyun could feel her heart rattling. The pressure that was being given off by the four Ancient race beings was way too immense! In fact, Hongyun could feel that they would only require a single move if they wanted to kill her!</p><br/><p>The feeling of death was getting ever more imminent.</p><br/><p>\"Where are you?\" Suddenly, Hongyun's thoughts came to Lin Fan. However, in the blink of an eye, an Ancient race being had already made her his target as he bolted right into her face.</p><br/><p>Noticing that Hongyun was in danger, Elder Yun He was petrified. However, he was locked in a struggle against two Ancient race beings. There was no way he could get out of this to help her at all!</p><br/><p>Just as all hope was lost, a bright flash shot right in front of Fairy Hongyun.</p><br/><p>The moment the Ancient race being sensed this aura, the goosebumps on his body rose entirely as he swerved backward immediately, slapping out at the void beside him.</p><br/><p>\"Damned living being! How dare you try to sneak an attack on me? Courting death!\" Having taken a disadvantage, the face of the Ancient race being changed immediately as he changed his target to Lin Fan.</p><br/><p>\"Lin Fan…!\" Catching sight of that figure, Fairy Hongyun's heart was elated. It was as though something really important had returned to her. This was a warm sense of security she was feeling.</p><br/><p>Lin Fan looked behind him. The Ancient race being was growling nastily, as though he was bent on taking Lin Fan's life with him.</p><br/><p>'Good timing!' Lin Fan chuckled in his heart. The tempo for his first wave was pretty decent. However, this was far from enough. He had to create more chaos across the entire battlefield.</p><br/><p>Lin Fan's body shifted nimbly like an agile snake, rendering one unable to guess his movements as he darted out at yet another Ancient race being.</p><br/><p>That Ancient race being was in the midst of holding down another elder from the Cloud Sect. However, sensing this tremendous amount of power that was coming towards him from the sides, he was astonished as he hurried to fend against it.</p><br/><p>\"Small little Ancient race being! If you've got the guts, come at Yours Truly for a good 300 rounds!\" Lin Fan mocked.</p><br/><p>\"Courting death!\" Without any bit of hesitation, this Ancient race being slashed at Lin Fan.</p><br/><p>At this moment, Yun He was being surrounded by two Ancient race beings and was about to fall at just any moment. However, in the blink of an eye, he realized that a shadow was flying at him from the distance.</p><br/><p>\"Who's there?\" Yun He huffed heavily wondering who the other party could be.</p><br/><p>Slapping out with a palm strike, a powerful Sword Qi burst forth from his palms and sliced out at the two Ancient race beings.</p><br/><p>The two Ancient race beings retaliated with a flurry of fists, dispersing his Sword Qi immediately.</p><br/><p>\"Puny Ancient race beings! Do you dare to fight with Yours Truly instead?\" Lin Fan continued mocking. However, he did not slow down on his speed as he continued to dash into the distance.</p><br/><p>\"B*stard f*cker! Kill him!\" The four Ancient race beings were entirely riled now as they chased after Lin Fan in hot pursuit.</p><br/><p>\"Elder, he's Lin Fan! He's the pride of the Human race who had arrived here with me.\" Fairy Hongyun explained as she came by the side of her elder.</p><br/><p>Elder Yun He's eyes were still fixated on that figure in the distance. To think that this pride of the Human race would possess guts as such! Only, what in the world was he doing? Why was he attracting the attention of those Ancient race beings like this?</p><br/><p>\"It's him!\"</p><br/><p>Originally enjoying this fascinating play, Mu Tian's face changed immediately. Those calm eyes of his lit up with a flare right now, burning with a boundless rage.</p><br/><p>This was the fella who had caused him to lose a Supreme grade Spirit Weapon!</p><br/><p>That Supreme grade Spirit Weapon was something that he had obtained after tons of trials and tribulations! To think that this single Human race being would cause him to lose everything he had!</p><br/><p>\"LIN FAN!\" Mu Tian howled out as that endless wrath of his erupted outward.</p><br/><p>\"Hey, stop calling now! I saw you right from the start! To think that a f*ckface manservant such as yourself would be doing so well!\" Lin Fan commented helplessly.</p><br/><p>Everyone would have their own encounters in life. However, Lin Fan was feeling some jealousy and envy over the encounters of Mu Tian.</p><br/><p>Bloody hell! What in the world was that Spirit Vein that this guy had obtained? To think that his cultivation state would fly up with the speed of a skyrocket!</p><br/><p>\"One who survives a disaster is bound to have a life of good fortune forever after. If it weren't for you, I wouldn't have been able to break through everything. If it weren't for you, I wouldn't be standing here right now. Everything right now was thanks to your blessings. For that, I shall have you subjugate to death before me and be turned into one of my Ghost Puppets, so that you shall follow my whims and wills for the rest of eternity!\"</p><br/><p>Catching sight of his foe before his bloodshot eyes, Mu Tian did not want to say anything more. A Ghost God coiled itself around his fist as he punched out at Lin Fan.</p><br/><p>\"Good timing!\"</p><br/><p>Lin Fan's body flickered as he disappeared from the face of the world. In turn, the punch found itself slamming out at the Ancient race beings that were chasing after him.</p><br/><p>\"B*stard f*cker! How dare you interfere?\" Countering the punch, the Ancient race beings blared out at Mu Tian.</p><br/><p>\"Don't run!\" Mu Tian did not pay the slightest heed to the Ancient race beings as he looked around for Lin Fan's figure and darted out.</p><br/><p>Luo Yi and the Life Stealing Scholar did not know what Mu Tian's relationship with this fella was. However, the fiercer the fight, the better it was for them. After all, they could just wait out the mess and profit from it in the end.</p><br/><p>However, the moment this thought even appeared in the minds of Luo Yi and the Life Stealing Scholar, their faces changed.</p><br/><p>A mysterious treasure bolted out from the ground, jetting towards their anuses.</p><br/><p>\"F*cking dog! How dare you provoke us when we're not even attacking you? Die!\" Luo Yi and the Life Stealing Scholar were enraged right now. After dodging that frightening flash, they both chased after Lin Fan as well.</p><br/><p>\"HAHA! This lad is just looking for death! To think that he would openly incite everyone in the area!\" Standing at his spot, Old Demon Kui Sheng laughed out heartily.</p><br/><p>\"Laugh till your mother dies! Come f*ck at me if you've got the guts!\" Suddenly, Lin Fan appeared before the face of Old Demon Kui Sheng and spat a mouthful of saliva in his face while riling at him.</p><br/><p>\"F*ck!\" Old Demon Kui Sheng was stunned, as though he had not expected this fella to come ruffle his feathers as well.</p><br/><p>\"HAHA!\" This time around, the gorgeously dressed cat woman who was standing beside Old Demon Kui Sheng was the one who burst out laughing while jumping around. It was as though she was taking much joy and happiness from the misfortunes of Old Demon Kui Sheng.</p><br/><p>\"Hey, bloody b*tch! Are you looking for breasts because you've got none? Also, you look extremely hideous like a piece of cow dung! Oh yeah, by the way, your breath fucking stinks when you laugh out!\" Lin Fan mocked while he chastised the cat woman.</p><br/><p>\"You…!\" To think that this lad would dare to humiliate her as such! The cat woman was so incensed by it that her face was flushed red like a tomato.</p><br/><p>\"You what you? Come and f*ck me up if you've got the guts!\" Lin Fan replied in absolute disdain.</p><br/><p>\"Lad! Your Mother here's going to scratch you up into shreds!\"</p><br/><p>...</p><br/><p>At this moment, Lin Fan turned around to catch sight of this mass of people queuing up in a long line and chasing after him, then laughed indifferently. The tempo of the fight had finally turned up.</p><br/><p>Next up, the real show was about to begin.</p><br/>\n</div>"}