{"title": "Chapter 582: Phenomenal Work", "id": 582, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-582-phenomenal-work", "volume_title": "Volume 6", "body": "<h1>Chapter 582: Phenomenal Work</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 582: Phenomenal Work</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The scene that was going on right now had everyone from the Cloud Sect absolutely flabbergasted. They were unable to believe everything before their very eyes.</p><br/><p>\"Hongyun, just what in the world is this friend of yours trying to do?\" Yun He felt as though his entire mind was sunk in glue. He was unable to understand anything that was happening right now.</p><br/><p>\"He's trying to gather all the firepower upon himself?\" Yun Fatian, whose hands were entirely caught up in that black mist, gasped in astonishment. He could not believe that this friend of Hongyun could be this insane!</p><br/><p>To think that he would dare to incur the wrath of nine extremely powerful beings upon himself! Just what sort of courage is required for a stunt like this?</p><br/><p>Hongyun did not say anything at all. She too had no idea what Lin Fan was up to.</p><br/><p>Nine powerful beings, nine... Amongst them, there were even three that were of divine celestial level 4, Undying state!</p><br/><p>She knew that Lin Fan's cultivation state was only that of a divine celestial level 3, Paradise state.</p><br/><p>Given his current strength, there wasn't any hope at all!</p><br/><p>\"I think I'm getting it. He's trying to pull all of their attention upon himself so that we can have a chance to escape!\" The other elder, Yun Feng, remarked in stupefaction.</p><br/><p>\"To think that he would sacrifice his own life in order to save us! What a noble spirit he has! How can we even compare to someone as such?\"</p><br/><p>\"I don't think so. He barely even knows us. In order for him to do something as such, it must definitely be because of Hongyun.\" Yun Fatian's eyes looked over to Hongyun strangely.</p><br/><p>\"Elders, you're misunderstood. I've only known him for less than a single day as well. That's definitely impossible!\" Catching the way her elders were looking at her, Fairy Hongyun blushed ever so slightly as she shook her head in denial.</p><br/><p>\"We don't know that for sure. Within the world, there exists something such as love at first sight. If that weren't the case, why would he risk his entire life just to save all of us who are of nothing to him?\" Yun He replied.</p><br/><p>Towards the misunderstandings of her elders, Hongyun did not know what else to say. However, given the situation right now, any form of explanation would only seem like a coverup.</p><br/><p>...</p><br/><p>\"Kid, how dare you humiliate me?\" Old Demon Kui Sheng's said grimly while looking at Lin Fan before him.</p><br/><p>\"Lin Fan, I swear that I'll have you pay for that vengeance we laid down that very day!\" Mu Tian's eyes were burning with wrath.</p><br/><p>Amongst everyone present, there was no one else who hated Lin Fan with a passion like he did.</p><br/><p>Even though it had been quite some time since that farewell of the Infinite Slaughter Ancient Realm, the hatred within Mu Tian's heart had only grown with every single passing day, without extinguishing.</p><br/><p>For Mu Tian, there was no greater wish than to have this goddamned fella killed viciously before his very eyes.</p><br/><p>Looking at everyone before him, Lin Fan's heart skipped a little.</p><br/><p>This line-up of theirs was pretty fearsome. Anyone else would definitely be scared to death by now! However, to someone like Lin Fan, what in the world could something like this amount to? He was someone who once had Sovereign King Wei descend before his very eyes. Yours Truly wasn't a man to bow down to something like this!</p><br/><p>Even if it were these guys, what could they possibly do to Yours Truly?</p><br/><p>Three of the Undying state, five of the Paradise state, and one from the Realm state…If all of them were to die right now, how much experience points would that be? If he could extract all of the Paradise Shards within them, his Paradise would definitely grow even stronger.</p><br/><p>This round of fighting would definitely be worth it then.</p><br/><p>Other than the three of the Undying state, Lin Fan was unbothered about all of the others. However, he knew that he mustn't be overly careless either.</p><br/><p>If anyone else were to know of these thoughts that were running through Lin Fan's mind right now, they would definitely spit out all of their blood.</p><br/><p>Bloody hell! Even the way things were now, he was only concerned about not being overly careless?! Then what in the world could be considered as making a mess out of things?</p><br/><p>\"Hmph! Do you guys know who I am?\" Looking at the nine people before him, Lin Fan didn't falter in the least bit as he questioned them imposingly.</p><br/><p>\"Who you are does not matter to us. After all, you'll be nothing but a corpse before long.\" The Life Stealing Scholar was holding onto a scroll in his hands. He reeked of a scholar no matter how anyone would look at him. It was as though he was someone who had come from the ancient times, and had just aced the national exams with top honors. However, the tone of his voice was piercing to one's soul like sharp blades.</p><br/><p>\"Foolish thing! We've got no intent on knowing who you are at all! After all, you'll be scratched into scraps by Your Mother here soon!\"</p><br/><p>...</p><br/><p>Lin Fan rolled his eyes. Why the hell were these bunch of people so uncooperative?</p><br/><p>\"All of you guys listen up! I am the one and only, dazzling and radiant, brilliant and bright, mighty Motherf*cking Human King who is adored by all the beings of the thousands of races. Lin. Fan!\" Sweeping his robes and raising his chin, Lin Fan answered in absolute pride.</p><br/><p>\"Die!\"</p><br/><p>The moment he finished his words, the Life Stealing Scholar struck. Twisting his wrist, the scroll in his hands unfurled out. He wrote on the scroll using his finger in place of a pen.</p><br/><p>Giving his finger a flick, he wrote out a single 'Kill' word on his scroll, that was emitting a sturdy killing intent. Every single stroke of his finger danced like a Phoenix and burst forth at Lin Fan with vigor ferocity.</p><br/><p>'When the scholar rages, millions shall die. Lin Fan of the Human race, huh? Today, the vast scrolls of the Life Stealing Scholar shall gain yet another vengeful spirit in its ranks!'</p><br/><p>Actually, the Life Stealing Scholar was someone of the Confucian race. However, he veered onto the path of killing. It was as though every single stroke of his possessed demons and gods of their own that were enough to rattle the entire world. With a single movement of his pen, he could kill off any lesser beings in the world.</p><br/><p>\"Looking at your pitiable pauper face, I garner that you can only write out a single word. Time for you to know of the Motherf*cking Human King's might!\" Lin Fan's body flickered repeatedly.</p><br/><p>Every single skill in this world depended on one's innate magical powers. Today, Lin Fan would let all of these guys witness what true strength meant in this world.</p><br/><p>\"Insolent!\" Looking at how this guy dared to rain insults upon his talents, the Life Stealing Scholar was entirely enraged. Bursting out in a roar, his fingers began to write repeatedly page after page.</p><br/><p>Suppress!</p><br/><p>Death!</p><br/><p>Instantly, both of those words distorted and twisted up into the skies with edged strokes. They looked as though they were gigantic dragons.</p><br/><p>\"Hmph! How dare you show off before me with such miserable tricks? Today, it's time for Daddy to school you guys.\"</p><br/><p>Lin Fan's body was just like a dragon that was gliding through the air right now, that no one could catch properly. Stretching his fingers into the air, he began to write in the void as well.</p><br/><p>\"To think that an ignorant being of the Human race would think of himself as a match against me from the Confucian race. You're just seeking out humiliation for yourself. Today, I shall let you know of the immensity of the Heaven and Earth!\" The Life Stealing Scholar was irked right now. Every single stroke he made caused a little vibration to ripple out across the void.</p><br/><p>His talent was breath-taking, as his refined disposition pierced through the skies. Following the relentless writing of the Life Stealing Scholar, the aura that was emanated from the vast scrolls got ever denser. In fact, it had even manifested into a Confucian God that was draped in white robes.</p><br/><p>A stroke of the Confucian God itself caused the entire void to tremble. All sorts of proses and poems danced in the sky, transforming into heavenly troops meant to kill off lesser beings.</p><br/><p>\"Oh! It's been a long time since you've unleashed your literary rage, Brother Life Stealing. Since that's the case, we shall not interfere, so that we can enjoy this magnificent show then!\" Luo Yi's eyes shone with a glint as he began to calm down.</p><br/><p>The other party's aura was deep and mysterious. Luo Yi could not make out the depths of it at all. If that were the case, he might as well let the Life Stealing Scholar test the waters first.</p><br/><p>And of course, Luo Yi wasn't the only one with these thoughts. Everyone else thought similarly.</p><br/><p>'Elders, what are they doing? Why aren't they striking?\" Hongyun asked.</p><br/><p>\"All of them are just testing the waters. The moment he shows any signs of weakness, they would all go in for the kill to shred him into pieces.\" Yun He explained.</p><br/><p>\"Then, what should we do?\" Hongyun could not help but feel the panic rising within her.</p><br/><p>\"There's nothing we can do. However, I wonder how he's going to fight with someone of the Confucian race in terms of literary talents. Undoubtedly, he has already lost half the fight before even starting on it.\" Yun He elaborated, slightly unnerved as well.</p><br/><p>...</p><br/><p>At this point, Lin Fan was almost losing it. To think that no one else would come at him! However, so be it. If this were the case, then he would just reveal a trick or two. It was time to let this Life Stealing Scholar know how wide the world truly is out there.</p><br/><p>\"If you're skilled with the pen, you can trick Lolitas to be with you. If you're skilled with the sword, you can satisfy any woman in bed.\"</p><br/><p>\"How dare you try to compete with me? Know your place!\" The Life Stealing Scholar mumbled in a huff under his breath while he wrote pages and pages of stuff. However, when he raised his head at Lin Fan, his face changed immediately.</p><br/><p>Even though there were only twenty-seven words, the power that was generated from those words were equivalent to those several hundreds of poems that he had written in his scroll!</p><br/><p>\"If you push, you can cause the body before you to stretch out straight. If you pull, you can raise the bum to welcome the breeze of the world.\"</p><br/><p>By the time Lin Fan was done with his last word, a formidable amount of power surged out. Immediately, the face of the Life Stealing Scholar changed once more as he stumbled back a few steps.</p><br/><p>\"How in the world could you compete with me?' The Life Stealing Scholar's eyes were bloodshot red right now.</p><br/><p>\"The vast scrolls shall have one's literary talents soar through the skies. All hail the long reign of the holy!\"</p><br/><p>The powers of the vast scroll climbed steadily as countless white-robed Confucian Gods flew out of it. Each and every one of these Confucian Gods was working hard at scribbling on their scrolls. This amount of energy combined into a long river and crashed down at Lin Fan.</p><br/><p>\"Huh? What in the world is this? How is this any different from magical powers? It's all just the same, isn't it?\" Lin Fan was getting helpless when he sensed the energy emanating from this. However, looking at the state the Life Stealing Scholar was in right now, Lin Fan shook his head repeatedly.</p><br/><p>Since things had come to this, it was time to finish this phenomenal poetry of his then.</p><br/><p>\"Hongyun, just where in the world did you get to know this friend of yours? Evidently, he isn't someone of the Confucian race. However, to think that he could suppress the Life Stealing Scholar with a mere fifty-six words!\" Right now, Yun He's heart was absolutely stunned right now.</p><br/><p>Hongyun's eyes sparkled as she stared fixedly into the distance. His aura was as magnificent as a sun in the bright, mid-noon. This man, Lin Fan, who had risen through everything like a ferocious dragon, just who in the world was he?</p><br/><p>Hongyun's heart was filled with curiosity towards this man who could possess such strength.</p><br/><p>'A powerful man can have a straight man bend over for him, A weak man shall find himself lying beneath a Fujoshi.'</p><br/><p>...</p><br/><p>'On one end, one shall conduct a deep exploration of the poisonous trenches of the anus. On the other end, one shall graciously receive the gentle horn blowing of a breath-taking beauty.'</p><br/><p>Instantly, the length of Lin Fan's writing lengthened considerably while the power level provided by it grew equivalently as well.</p><br/><p>'The Poetry Anthology. Completed.'</p><br/><p>'Author: The Great and Accomplished Poet, Motherf*cking Human King, Lin Fan.'</p><br/><p>BOOOOOOOOOOOOOOOOOOOOOOOOOM!</p><br/><p>Phenomenal, with an aura similar to that of a dragon.</p><br/><p>A berserk amount of energy ruptured out of Lin Fan's body and exploded out towards the Life Stealing Scholar.</p><br/><p>\"I-impossible!\" The Life Stealing Scholar was in utter disbelief as he spat out an entire three liters of fresh blood.</p><br/><p>To think that he would lose!</p><br/><p>How could the combined forces of thousands of Confucian Gods not be a match for this person of the Human race?!</p><br/><p>\"Hmph! Nothing is impossible. This poetry anthology which describes the utmost Dao of the Heavens and the rules of the Earth isn't something that a small little kid like you who is only used to learning trash could understand and compete with.\" Lin Fan stepped forth with an exceedingly superior aura.</p><br/><p>Right now, his disposition was more radiant than ever. Naturally, he had to capitalize on this moment.</p><br/><p>Bam! Bam!</p><br/><p>The scrolls in the hands of the Life Stealing Scholar began to burst and rip apart into dust one by one. It was as though they had acknowledged their defeat in front of that incomparable poetry of Lin Fan, and could only use their own deaths as a final stand against it.</p><br/><p>\"My vast scrolls!\" The moment the Life Stealing Scholar caught sight of this, he felt as though he had just been absolutely gutted inside. Seemingly unable to deal with this devastating blow, he began to spit out blood continuously and fainted over once more.</p><br/><p>\"Come on now. All of you, fight!\" In a flash, Lin Fan crossed through the void. Sweeping his robes, he tossed the Life Stealing Scholar straight into his Paradise.</p><br/><p>...</p><br/>\n</div>"}