{"title": "Chapter 584: Killed With A Single Move", "id": 584, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-584-killed-with-a-single-move", "volume_title": "Volume 6", "body": "<h1>Chapter 584: Killed With A Single Move</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 584: Killed With A Single Move</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Damned ant! How dare you try to hurt me?\"</p><br/><p>At this moment, an Ancient race being was glaring at Mu Tian in a huff. He had not expected this puny little being of the Ghost race to sneak an attack on him!</p><br/><p>\"No, I didn't! I was trying to kill him!\" Mu Tian tried explaining while pointing his finger hurriedly at Lin Fan.</p><br/><p>\"Alright, alright. That's enough! All of you guys are harboring motives of your own, trying to kill everyone around here! Even though all of you guys are surrounding me, I've got to warn you guys of the Ancient race. 'Be wary of anyone that's not of your own race.' As beings of the Ancient race, all of them are definitely going to target you guys!\" Lin Fan remarked.</p><br/><p>\"Shut up! Damn you! Damn you entirely, you sh*t! How dare you try to create a rift amongst us? I'll kill you here and now!\" Mu Tian bellowed as he darted out towards Lin Fan once more.</p><br/><p>'Infinite Ghost Cradle Palm!'</p><br/><p>Mu Tian's ghastly hands grabbed out at Lin Fan. Seizing the chance, Lin Fan flew towards yet another Ancient race being. At this moment, the Ancient race being was looking elsewhere warily, failing to notice Lin Fan's figure darting by.</p><br/><p>However, he had suddenly felt a creepily eerie force striking from his back as his expression changed entirely! Turning his head around, he was faced with a ghostly palm flying in his direction!</p><br/><p>\"You damned being of the Ghost race! How dare you try to sneak more attacks in?\" This Ancient race being was entirely riled right now. Retaliating with a punch, he dispersed that ghostly palm immediately.</p><br/><p>\"No, no, no! I was trying to kill that human!\" Noticing that Lin Fan's figure had disappeared, Mu Tian looked around frantically.</p><br/><p>\"Then explain how that human is over there?\" The Ancient race being demanded.</p><br/><p>\"I-I…!\" Mu Tian looked over into the distance only to find out that Lin Fan was engaged in a fight with the Cat Woman.</p><br/><p>Repelling the Cat Woman with a single palm strike, Lin Fan turned his direction towards Mu Tian, \"Mu Tian! If you want to kill that Ancient race being, then be upfront about it! Stop trying to find excuses for yourself!\"</p><br/><p>\"You bloody dog! How dare you frame me? I'll hang your bones up and sh*t in your ashes!\" Mu Tian howled as he continued chasing in Lin Fan's direction once more.</p><br/><p>However, the moment Mu Tian started moving, he found himself being blocked by an Ancient race being.</p><br/><p>\"What are you trying to do!\" Mu Tian looked at this Ancient race being cautiously.</p><br/><p>\"Hmph! You're trying to run away after your attempt to kill me? You've got to be dreaming! Go to hell!\" Entirely angered, the Ancient race being struck out at Mu Tian.</p><br/><p>Witnessing this, Lin Fan's heart was overwhelmed with joy. Wasn't this too damn bloody easy?</p><br/><p>This was the best thing about a chaotic fight. As long as he were to make a little use of that brilliant brain of his, he could definitely rile these guys up big time.</p><br/><p>This Ancient race being was of a divine celestial level 3, Paradise state. Each and every single one of his strikes were vicious as hell, showing no mercy at all.</p><br/><p>Even though Mu Tian's Realm was extraordinarily unique, giving him the capability to pit himself against those of the Paradise state, the Ancient race beings were unparalleled against the beings of the thousands of races even within the same cultivation state. As such, he was still repressing down on Mu Tian direly.</p><br/><p>Mu Tian was losing his ground steadily. In fact, there were even a couple of times when he was nearly caught by the attacks of the Ancient race being.</p><br/><p>\"Luo Yi! Save me! I swear that I'll relinquish any rights to the treasures of the Fire Water Secret Grounds this time around!\"</p><br/><p>Luo Yi was chasing down Lin Fan hand in hand with Old Demon Kui Sheng. Upon hearing these words, his brows creased as his eyes sparkled with a glint.</p><br/><p>\"Alright!\" Eventually, he reversed his direction towards Mu Tian.</p><br/><p>Luo Yi was a divine celestial level 4, Undying state being. There was no way this Ancient race being of the Paradise state was going to be able to fend against him.</p><br/><p>\"Hmph! I knew that you beings of the thousands of races are definitely untrustworthy from the very beginning! To think that you would try to kill off my underling right now! Courting death!\" The Ancient race being of the Undying state could bear with it no longer. Looking at how Luo Yi was striking out to kill his fellow Ancient race being, he retaliated intensely.</p><br/><p>\"All of you, receive my orders! Kill off every single being of the thousands of races here!\" That leader of the Ancient race beings blared out. He was ready to exterminate every single being of the thousands of races here.</p><br/><p>\"Old Demon Kui Sheng, I'd advise you to head over and help that Cat Woman of yours. She isn't going to hold out for much longer.\" Lin Fan's skillsets were special, as his body flickered continuously.</p><br/><p>Even though Old Demon Kui Sheng was of Undying state, his powers weren't enough for him to kill Lin Fan.</p><br/><p>Old Demon Kui Sheng turned around to discover that the Cat Woman was being flanked by two Ancient race beings on both sides. His heart tightened immediately as he swerved around, darting towards those Ancient race beings.</p><br/><p>\"HAHA…!\" Lin Fan burst out into laughter. This was way too fabulous a feeling!</p><br/><p>All of these people had wanted to kill Yours Truly. However, Yours Truly was a professional sh*t stirrer! 'Time to stir the hell out of your lives and have you guys f*ck one another up!'</p><br/><p>With the help of Luo Yi, things got way easier for Mu Tian as he finally got a break to stop for a while, breathing heavily. However, it was at this moment that he realized a gaze locked onto him.</p><br/><p>By the time he located the source of the gaze, his face changed.</p><br/><p>\"Dog sh*t! This was all your doing!\" The fire within Mu Tian's heart raged on. He knew that the reason why everything turned out this way was due to him!</p><br/><p>Lin Fan did not reply to these words. Time was of the essence now. Any person he killed was a person less to deal with.</p><br/><p>\"Go to hell!\" Lin Fan grabbed out with his arm. His five fingers were mighty like mountains as they sealed Mu Tian up within them.</p><br/><p>Crack.</p><br/><p>Under the pressure of this formidable arm, the void began cracking.</p><br/><p>Mu Tian had not expected Lin Fan to be this strong. This was entirely out of his expectations!</p><br/><p>\"To think that a mere being of divine celestial level 2, Realm state would dare to try fend against me? You're just seeking your own humiliation, eh?\" While the Realm of Mu Tian was pretty f*cked up, Lin Fan knew that killing this man was going to be an act of absolute ease.</p><br/><p>He could already take down any mere Paradise with his current strength, let alone a Realm state being like him.</p><br/><p>\"18 Levels of Hell, open up!\" Sensing the repressing pressure pushing down on him, Mu Tian's face changed as he opened up his Realm immediately. However, his face turned pale instantly in utter bewilderment.</p><br/><p>To think that his Realm would be breaking down under the might of that gigantic arm! An immense amount of power was striking down at him!</p><br/><p>Bam! Bam! Bam!</p><br/><p>Under the strength of that arm, Mu Tian's body exploded out into a mess of blood and flesh.</p><br/><p>\"ARGH! HOW CAN THIS BE?\"</p><br/><p>Mu Tian wailed tragically. This was the 18 Levels of Hell that he had painstakingly created! How could it be destroyed by the other party just like that?</p><br/><p>\"Killing you is as hard as killing a mere dog. I've just been playing around with you from the start.\" Lin Fan laughed frostily.</p><br/><p>Of course, it wouldn't take much effort on Lin Fan's part for him to kill someone the likes of Mu Tian. The only reason why he had spared his dog life from the start was so that he could induce this state of chaos on the battlefield.</p><br/><p>But now, this man had long exhausted his value. As such, the only thing left to do was to kill him.</p><br/><p>When one cleaned something up, one should always clean it fully. Lin Fan could sense a strong, pulsating energy emanating from the remnants of Mu Tian's body.</p><br/><p>The source of this energy must be the Spirit Vein!</p><br/><p>That long and thick Spirit Vein that was pure white in color was instantly extracted out by Lin Fan.</p><br/><p>\"Leave the Spirit Vein!\" The moment Luo Yi, who was locked in a fight with the Ancient race beings, caught sight of the Spirit Vein, he bellowed out and burst forth towards Lin Fan.</p><br/><p>Lin Fan tossed him a look of disdain. Without any bit of hesitation, he tossed the entire Spirit Vein within his Paradise. In fact, now that he had killed Mu Tian, he had even managed to obtain the 18 Levels of Hells that Mu Tian had cultivated.</p><br/><p>But, this was not the moment for Lin Fan to be checking them out. He tossed all of them into his Paradise all the same.</p><br/><p>\"You want the Spirit Vein? We'll see if you've got the capabilities to get it then.\" Lin Fan did not have the intention of exchanging blows with Luo Yi just yet. Entering Stealth mode immediately, he disappeared from the face of the world.</p><br/><p>\"Where did he go?\" Realizing that the Human had just disappeared right before his very eyes, Luo Yi was extremely puzzled. He couldn't make this out at all!</p><br/><p>However, just like that, the Ancient race being had caught up with him as well. It was at this moment that Luo Yi realized just what Lin Fan was trying to achieve. However, it was all too late.</p><br/><p>After all, it didn't matter who was who in the eyes of the Ancient race beings right now. They would just kill at anyone before their very eyes.</p><br/>\n</div>"}