{"title": "Chapter 593: Thank The Heavens, The Earth And The Entire Ancient Race Family!", "id": 593, "volume": 6, "url": "http://boxnovel.org/the-strongest-system-chapter-593-thank-the-heavens-the-earth-and-the-entire-ancient-race-family", "volume_title": "Volume 6", "body": "<h1>Chapter 593: Thank The Heavens, The Earth And The Entire Ancient Race Family!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 593: Thank The Heavens, The Earth And The Entire Ancient Race Family!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What is he trying to do? Is he intending to perish together with the Ancient race beings?\" Seeing this sight, Hongyun was extremely puzzled. She did not know what Lin Fan was planning.</p><br/><p>Elder Yun He was brooding deep in his thoughts right now. Suddenly, his face changed, \"Wait. If he were to make use of the Ancient race beings as vessels, defending against and blocking the Paradise Thunder Calamity may not be entirely impossible…\"</p><br/><p>\"However, these Ancient race beings are no fools either. How would they surrender just like that?\"</p><br/><p>...</p><br/><p>At this moment, Lin Fan did not have any other plans he could think of. Initially, he had thought that he wanted these Ancient race beings to die with him even if he couldn't tide over the Paradise Thunder Calamity. Because of that, he opened up his Paradise without any single bit of hesitation, and dragged all of the Ancient race beings within this place.</p><br/><p>To begin with, Lin Fan's Paradise was extremely strong. The space it encompassed was overwhelmingly huge and boundless. Even though the Ancient race army was great, it still paled in the face of Lin Fan's enormous Paradise.</p><br/><p>However, the moment they entered Lin Fan's Paradise, the Ancient race beings could sense a terrifying power that was brewing above in the sky.</p><br/><p>\"Where is this place?\"</p><br/><p>\"What is that living being trying to do?\"</p><br/><p>\"What is up with this power of thunder over here?! How in the world is it this scary?\"</p><br/><p>The Ancient race army was startled at this moment. Even though they were menacing and stood tall above the rest of the world, they still felt their goosebumps rising at the sight of this formidable power of thunder. A sense of dread was surging in their hearts.</p><br/><p>For some of the Ancient race beings, they might have had no idea at all as to what this was all about. However, the ten legatus and tribunus clearly understood where they were and what was going on in this scene before them.</p><br/><p>\"This living being is undergoing a Paradise Thunder Calamity! He's trying to have us die alongside him! Damn it! God damn it!\"</p><br/><p>\"Everyone, listen up! Use all of your might to attack the Paradise! Make sure you break through the walls of this Paradise!\" The ten legatus of the Ancient race ordered out immediately. However, under the relentless assault of the power of thunder, their voices died out in the chaos, unable to be transmitted across.</p><br/><p>Looking at the countless Spirit Qi Cyclones within the Paradise, the legatus of the Ancient race beings were stumped right now.</p><br/><p>\"Just what sort of an extent has this Paradise accumulated resources till? How in the world could there be Spirit Qi Cyclones that are this strong?\" An Ancient race legatus let out a stupefied look. Roaring out ferociously, he sent all of his body's energy into a single punch that burst out, as though a thousand armies were rushing towards the walls of the Paradise.</p><br/><p>Initially, Lin Fan had wanted to perish together with these Ancient race beings in the Paradise Thunder Calamity. However, something shocking happened in the next moment.</p><br/><p>Even though the thunderbolts in the voids got even wilder and more berserk, the power of thunder began to separate into multiple portions.</p><br/><p>Densely packed, and with the girth of a chopstick, all of these thunderbolts boomed loudly. Even though the total aura did not change at all, Lin Fan could sense that the might of the power of thunder was now being split up evenly.</p><br/><p>'Could this be what they meant by 'Those who see get a share of the pot'? With that, are all of the Ancient race beings are now sharing the burden of the power of thunder?' At this sight, Lin Fan's heart was filled with joy.</p><br/><p>However, the crystallized walls of the Paradise began to tremble. Looking over at the distance, Lin Fan could spot some Ancient race beings trying their best to attack those crystallized walls of his Paradise. Under these ferocious attacks, the walls seemed extremely unstable. It seemed as though they could shatter at any moment!</p><br/><p>'No! This is an extremely rare opportunity! How can I possibly let these Ancient race beings screw this up? Whether or not I get through this Paradise Thunder Calamity depends on them!' Lin Fan was extremely gleeful right now.</p><br/><p>'Mythical Parasol Tree, wrap around the entire Paradise!'</p><br/><p>Grabbing out into the void, the Mythical Parasol Tree jerked violently. With that, countless tree branches ripped out. They dug their way into the Paradise like countless tiny hands.</p><br/><p>Intertwining with one another, the tree branches of the Mythical Parasol Tree formed a gigantic, dense web. The twin True Essences of Fire and Water began to churn rapidly, transforming into a scorching sun and a running long river.</p><br/><p>The swiveling of the scorching sun caused an endless amount of rays to burst forth, plastering the crystallized walls of the Paradise.</p><br/><p>The long river swam through the crystallized walls as well, nourishing everything it touched. Each time the crystallized walls were breached, a soothing and warm energy would seep in, allowing it to regenerate quickly.</p><br/><p>The powers within Lin Fan's body were rapidly burning up as well. One by one, those figures of the Skill Gods howled in anger as they transformed into a gigantic river that gushed within the Paradise.</p><br/><p>In order to sustain the stability of this Paradise, Lin Fan could not help but exert every single bit of strength he had.</p><br/><p>If not for the fact that Lin Fan's foundation was sturdy, he would have turned into a dried up corpse just by utilizing these skills in order to sustain the energy required by his Paradise.</p><br/><p>\"What in the world is with this Paradise?! Damn it!\" All ten of the legatus of the Ancient race army were divine celestial level 5, Essence Spirit state beings. Each of them wielded an unimaginable amount of power.</p><br/><p>Every single punch of theirs would send forth a God of Power that would bellow in fury, ripping everything before their faces. However, every single strike that they landed on these crystallized walls of the Paradise left nothing but a few ripples.</p><br/><p>How could the ten legatus of the Ancient race army tolerate something as such?</p><br/><p>BOOM!</p><br/><p>All of the densely packed thunderbolts that were like chopsticks began to twist and contort while descending from the Heavens. The view within the Paradise right now was absolutely magnificent, and could cause one to hold their breath with just a single look.</p><br/><p>All of these thunderbolts were like a drizzle pouring down. It was impossible to dodge them at all! Filled with these dense and concentrated thunderbolts all over the entire Paradise, it gleamed with an uncanny glow.</p><br/><p>'ARGHHHHHHHHHHHHHHHHHHHH!!!'</p><br/><p>The tragic wails rang out continuously.</p><br/><p>Some of the weaker Ancient race beings could not endure the power of thunder that was raining upon them right now. At every contact, their skin parted ways with their bodies, as a thick, black smoke sifted up from the damage done to them.</p><br/><p>\"To think that this living being would try to make use of us in order to share the burden of his Paradise Thunder Calamity! Damn it!\" A few of the stronger Ancient race beings slammed out with their hands and destroyed the thunderbolts entirely. However, the sight of their fellow weaker Ancient race beings that were smitten down mercilessly had them all yelling in anger.</p><br/><p>A series of thunderbolts struck down on Lin Fan's body.</p><br/><p>'Ding…Eternal God Body Experience Points +1,000'</p><br/><p>Lin Fan realized that the power of thunder was no longer as powerful after being divided up. He was absolutely exhilarated with this fact. He wanted to howl out in joy and vent out all the happiness within his heart right now. However, he had to keep his cool. He still had an important task of maintaining the stability of the Paradise. No matter what, he couldn't allow these Ancient race beings to breach his Paradise at all!</p><br/><p>'Burn, burn!'</p><br/><p>Lin Fan was giving it his all. All of the Shengyang Pills that he had obtained with much effort were now being erupted out. Even though there were only a couple hundreds of thousands of them, Lin Fan did not want to leave any regrets down at this crucial junction.</p><br/><p>Each one of the myriad mythical elixirs he had in his possessions erupted out to supplement the powers that he was losing in order to sustain the Paradise right now.</p><br/><p>BOOM!</p><br/><p>The thunderbolts boomed out once more. And this time around, the girth of the thunderbolt strikes increased slightly.</p><br/><p>This was due to the fact that there were some Ancient race beings who had perished in the previous wave of the thunderbolts. Now that they were smitten into dust, there were less of them to share the burden right now.</p><br/><p>However, this was still something that Lin Fan could deal with.</p><br/><p>'Ding…Eternal God Body Experience Points +1,100'</p><br/><p>The moment the thunderbolts coiled around Lin Fan's body, they were disintegrated as the experience points of his physical body state increased ever so steadily.</p><br/><p>To Lin Fan, this was a sign that hope had appeared.</p><br/><p>'Thank you, Heavens! Thank you, Earth! Thank you, each one of the Ancient race family!'</p><br/><p>Lin Fan really had an urge to cry out right now. He had thought that he was truly about to die this time around. Who would have thought that a living bodhisattva such as the Ancient race would appear in his critical moment of need and bring forth to him salvation in these tough times?</p><br/><p>Lin Fan could not help but lament over his shortcomings in comparison to this noble act of the Ancient race beings.</p><br/><p>Under the current wave of thunderbolts, there were again a number of Ancient race soldiers who could not endure the power of thunder and found themselves being smitten into dust.</p><br/><p>Because Lin Fan could not be considered as the one who had killed these Ancient race beings, he did not receive any experience points for their deaths.</p><br/><p>However, as long as he could sustain and tide over this Paradise Thunder Calamity, Lin Fan could care less about the experience points that were lost right now.</p><br/>\n</div>"}