{"title": "Chapter 604: The Fan Fan Boy Whom Everyone Loves", "id": 604, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-604-the-fan-fan-boy-whom-everyone-loves", "volume_title": "Volume 7", "body": "<h1>Chapter 604: The Fan Fan Boy Whom Everyone Loves</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 604: The Fan Fan Boy Whom Everyone Loves</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The next day…</p><br/><p>Lin Fan followed Fairy Hongyun to the library of the Cloud Sect.</p><br/><p>\"Lin Fan, this is the library here. Because the Grandmaster has spoken up, you do not have to worry about the duration you would wish to stay inside here.\" Hongyun smiled.</p><br/><p>At the same time, her gaze towards Lin Fan was strange.</p><br/><p>The library possessed everything of Cloud Sect. The disciples of the sect would have to train up within the secret grounds till they achieved a certain accomplishment before they were allowed to view the books of the library. Not only that, there was a time restriction for them.</p><br/><p>Most disciples would only be allowed to stay for two days in the library.</p><br/><p>To think that the Grandmaster would grant Lin Fan an infinite amount of time within the library. Seemed like he must be holding some great expectations for Lin Fan.</p><br/><p>If not for the current Grandmaster who was holding on to the affairs of the sect right now, things would have certainly gone out of hand by now.</p><br/><p>The Grandmaster harbored a deep hatred for the Ancient race. He would never ever show any mercy to any of them. As such, he was always kind to the beings of the thousands of races who were against the Ancient race, and was willing to sacrifice anything for them.</p><br/><p>Once upon a time, there was a being of the thousands of races who was trapped and surrounded by the Ancient race within a part of the forbidden grounds because he had slain a legatus of the Ancient race.</p><br/><p>The moment the Grandmaster caught wind of this news, he headed over to rescue him immediately without any bit of hesitation.</p><br/><p>That battle was earthshattering. Some of the Sovereign Kings of the Ancient race joined hands together against the Grandmaster, resulting in him being bloodied from head to toe. Eventually, he managed to escape out with that being, who later on became an elder of the Cloud Sect.</p><br/><p>The guard at the library took a look at Lin Fan. He then nodded his head and opened up the door for him, welcoming him within.</p><br/><p>Lin Fan felt as though something was happening to the space around him. By the time he next opened his eyes, he found himself buried in a sea of books.</p><br/><p>There were two rows of bookshelves that pierced all the way up into the Heavens. Each of them was stacked with a dense number of books. These books gave off a fragrant scent, and carried with them some resonance of magic.</p><br/><p>Books possessed spirits of their own. The more they were browsed by people, the more of a human aura it would possess. Furthermore, some of these books could have been written by powerful beings. As such, they would have some consciousness of their own upon completion. This would be what most people would refer to as Book Spirits.</p><br/><p>'Holy f*ck! Back in my previous life, it was already pretty much of a headache to read through books. To think that I would be faced with a sea of books once more. This is truly a sin of its own.' Lin Fan shook his head and sighed. After that, he dove straight into the sea of books.</p><br/><p>At the Grandmaster's Main Hall…</p><br/><p>\"Grandmaster, Liu Hen has left his mountain peak today and is headed to the residence of that human. I presume that he should be heading over to seek an explanation for the happenings of yesterday.\" The man who was speaking right now was an elder of the Cloud Sect. His aura was concealed as though it was a vast ocean. One could sense great, calm waves from it. However, if he were to be enraged, it would most probably turn into raging tsunamis that would consume everything in their path.</p><br/><p>\"Hais! They have long forgotten about their own dreams and ideals. They've forgotten about the oaths that they had once sworn back when they had entered the sect. To think that they would be so absorbed within this struggle for power. As the Grandmaster, all of these are my responsibilities.\" The Grandmaster of the Cloud Sect blamed himself.</p><br/><p>\"Grandmaster, you do not need to feel reproachful over this. During peacetime, these are things that were bound to have happened.\" Meng Hengtian lamented.</p><br/><p>He too had watched Liu Hen and the others grow up since young. Once upon a time, their hearts were for the common people as well. However, as their statuses grew along with their strength, they gradually changed in character and turned selfish. Eventually, they disregarded the sufferings of the beings of the thousands of races out there entirely, and were totally concerned about their personal wellbeing.</p><br/><p>\"Grandmaster, are you intending to entrust all of your hopes onto that human?\" Meng Hengtian asked.</p><br/><p>The Grandmaster of the Cloud Sect stood up and swept his robes. The next time he reappeared, he was standing in the void up above the Cloud Sect.</p><br/><p>\"Take a look at the changes of the Cloud Sect right now.\"</p><br/><p>Meng Hengtian looked around at that vast and boundless place. Eventually, his expression changed as well.</p><br/><p>\"I'm sure you can tell as well. The aura of this place is changing. Once upon a time, this place was bright as the day. But now, it's in a state of chaos. This is an omen that we're on the brink of destruction.\" Grandmaster Yun said in a worried tone.</p><br/><p>\"Grandmaster, and your intentions are…?\"</p><br/><p>\"That's right... That human is a pride of their race. He represents hope. For a Paradise Thunder Calamity to amount in the thousands, that is a Paradise that goes beyond the orders of the world. It is an existence that is not to be stopped. For the first half of my life, I was blinded by hatred. Thankfully, I had the guidance of a benefactor who brought me onto the right path of life. The Cloud Sect must not be destroyed in my rule, nor should it be a personal tool for Liu Hen and the others. The reason why the Founder Ancestor chose to give up his life and fuse with the Heaven's Will of the Paradise was so that he could give the beings of the thousands of races a last ray of hope. As for me, I'm awaiting that chance as well.\"</p><br/><p>\"Grandmaster, you intend to hand the…\" That initially calm face of Meng Hengtian changed abruptly as he glared at the Grandmaster in disbelief, \"But if that's the case, wouldn't all of them be disgruntled? How could they accept something like that? Furthermore, Grandmaster, how do you know that the human truly cares about the beings of the thousands of races?!\"</p><br/><p>\"Because of Hongyun.\" The Grandmaster of the Cloud Sect replied calmly.</p><br/><p>\"Hongyun?\" Meng Hengtian's face was bewildered right now. He wondered what all of this had to do with that child, Hongyun.</p><br/><p>\"Hongyun isn't someone of the Cloud race. That, you know, right?\"</p><br/><p>\"Yes, I do. This child, Hongyun, she's someone that you brought in from the outside, Grandmaster. However, I do not know what race this child belongs to.\" Meng Hengtian replied.</p><br/><p>\"Once upon a time, I was closely tied by fate with a being of the Heart race. However, the Heart race is a race that the Heaven's Will of the Ancient Saint World could never permit to exist. That's because the Heart race could sense the changes within the future. During an expedition, an Utmost Being of the Ancient race struck out and slew the Heart race. Not only that, they focused their powers at the base of the Heart race and destroyed their core entirely. The only thing I could do was to salvage a single bloodline for the Heart race.\"</p><br/><p>Meng Hengtian did not speak. The more he listened to the words of his Grandmaster, the more his face changed.</p><br/><p>\"Grandmaster, you mean to say that Hongyun that brat, s-she's seeing the future from that human lad?\" Meng Hengtian asked in shock.</p><br/><p>Grandmaster Yun did not reply him directly. He just looked at Meng Hengtian for a long time, \"Do you understand my intent now?\"</p><br/><p>Meng Hengtian looked at his Grandmaster before nodding eventually, \"Hengtian understands. No matter what happens in the future, I'll always support your decision, Grandmaster. That's because I know that your heart has never changed from the very beginning.'</p><br/><p>Meng Hengtian understood the concerns of his Grandmaster, as well as all the pains that he was shouldering right now.</p><br/><p>\"Eh? Grandmaster, take a look over there.\" Suddenly, Meng Hengtian pointed his finger into the distance.</p><br/><p>\"Eh?\" Grandmaster Yun took a quick look. Not too long after, he brought Meng Hengtian with him and left the place.</p><br/><p>...</p><br/><p>The moment the disciples of the Cloud Sect caught sight of their Big Senior Brother Liu Hen leaving the mountain peak, they tagged behind him happily one by one.</p><br/><p>They knew that it was rare for their Big Senior Brother Liu Hen to leave his mountain peak. Therefore, it was somewhat of a rare occasion if they wanted to catch sight of him at all.</p><br/><p>However, some of the disciples knew the reason why their Big Senior Brother Liu Hen chose to leave the mountain peak this time.</p><br/><p>Big Senior Brother Liu Hen must be out to find trouble with that human. They were sure that the human was going to be in for it now. Now that Big Senior Brother Liu Hen was coming personally, could the human possibly be a match for him?</p><br/><p>By the time the masses came by Lin Fan's place of residence, Fang Weifeng had begun to holler out cockily once more.</p><br/><p>\"You bloody dogsh*t, get the hell out! Today, my Big Senior Brother is here! We'll see if you're still such a tough guy!\" Fang Weifeng's mood was extremely wonderful right now. After all, this was his day of vengeance.</p><br/><p>With his Big Senior Brother standing the fort, they were bound to win it this time around.</p><br/>\n</div>"}