{"title": "Chapter 603: The New Beginning Starts Before His Eyes", "id": 603, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-603-the-new-beginning-starts-before-his-eyes", "volume_title": "Volume 7", "body": "<h1>Chapter 603: The New Beginning Starts Before His Eyes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 603: The New Beginning Starts Before His Eyes</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Looking at Lin Fan, Fairy Hongyun heaved a sigh of relief. Thankfully he had chosen to show mercy. Otherwise, things would really turn sour if he had gone on to kill them.</p><br/><p>On the other hand, Lin Fan wasn't feeling all that pleased right now.</p><br/><p>At the end of the day, this was an issue of strength.</p><br/><p>He was within the Cloud Sect right now. Not only was the Grandmaster's strength higher than his, even some of the elders here might be more powerful than him as well.</p><br/><p>By all reasons, he should have killed Fang Weifeng over his unwarranted provocations that had happened time and again. However, Lin Fan couldn't throw all caution to the wind against all the other people of the Cloud Sect.</p><br/><p>If he had absolute power, he wouldn't have needed to bother with them and could just kill off Fang Weifeng without any bit of mercy.</p><br/><p>\"Lin Fan, thank you for your merciful act. They're way too comfortable with staying within the Cloud Sect, leading to this arrogant and condescending temper, showing respect to no one at all.\" Even though Fairy Hongyun's cultivation state wasn't too high, she was adept at telling one's heart.</p><br/><p>She knew that there wasn't much hope for the next generation of disciples within the Cloud Sect.</p><br/><p>The senior disciples of the Cloud Sect weren't thinking about overthrowing the Ancient race at all. In their minds, they were more concerned with the inner politics and conflicts of the sect. All of them were vying for power through the seat of the Grandmaster.</p><br/><p>Lin Fan did not reply as he smiled indifferently and enjoyed the picturesque scenery around them.</p><br/><p>To think that there would be such a flourishing sect within the Ancient Saint World. This was pretty incredible indeed. Even the Xuanhuang World would not be able to catch up with something like this.</p><br/><p>Indeed, a dragon was born through troubled times.</p><br/><p>...</p><br/><p>\"Senior Brother Zhang, are you alright?\" Fang Weifeng was so afraid that he was shivering uncontrollably from head to toe right now. His face was extremely pale. He had not expected that this Senior Brother Zhang of his, who possessed a terrifying amount of strength, wouldn't be a match for that human!</p><br/><p>The gaze that the human cast on him right before he left was especially chilling.</p><br/><p>Zhang Wenzhuang's face was sinister and horrifying to look at right now. He swept the crowd of disciples with a furious gaze. Every single one of their eyes locked on him were akin to invisible hands that were slapping his face.</p><br/><p>\"SCRAM!\" Zhang Wenzhuang growled in wrath. His eyes were filled with a boundless hatred as he got up and left the place. He was unable to tolerate this burning humiliation received today, especially before so many of his junior brothers and sisters.</p><br/><p>The shame that Zhang Wenzhuang felt right now was limitless.</p><br/><p>Fang Weifeng was freaked out so badly by that 'SCRAM' that he stumbled back a few steps as well. He looked at the back view of his leaving Senior Brother Zhang. Even though he was angered within his heart, he chose to follow behind him as well.</p><br/><p>Right now, he was going to report this to the Big Senior Brother so that he could handle this issue personally.</p><br/><p>In his eyes, this Lin Fan was just bloody courting death. If Big Senior Brother were to step in, things would definitely be absolutely nasty.</p><br/><p>Looking at how Zhang Wenzhuang and Fang Weifeng were retreating with their tails between their legs, the surrounding disciples began to discuss with an unbridled sense of eagerness.</p><br/><p>\"Wasn't that guy way too strong? To think that even Senior Brother Zhang would be defeated by him!\"</p><br/><p>\"He's way too domineering! He took down Senior Brother Zhang of divine celestial level 4, Undying state with a single finger! Just how strong of a power does that human wield?\"</p><br/><p>\"Senior Brother Tianyun, hurry up and tell us more about the stories of this human!\"</p><br/><p>Looking at his junior brothers and sisters surrounding his side once more, Tianyun could not help but beam widely.</p><br/><p>\"What now? Are you guys finally believing of my words?\"</p><br/><p>\"Yes, we do! We absolutely do!\"</p><br/><p>\"Senior Brother Tianyun! Please tell us more, please!\"</p><br/><p>Tianyun was smiling right now. After that, everyone crowded around Tianyun like he was the center of the universe as they continued listening to his teachings intently.</p><br/><p>However, at this moment, Tianyun was a little worried actually. After all, the backing behind Zhang Wenzhuang was the Big Senior Brother. If Big Senior Brother were to come forth, what would happen by then?</p><br/><p>The news of this affair traveled extremely quickly.</p><br/><p>Other than the Big Senior Brother, many other senior brothers and sisters had their own factions within the sect.</p><br/><p>Their relationship with the Big Senior Brother Liu wasn't all that good. Even though they did not openly display this hostility, it was common for them to plot against one another in the dark of daily affairs.</p><br/><p>Even though the Grandmaster of the Cloud Sect knew of these happenings, he did not know what he should say.</p><br/><p>...</p><br/><p>\"Hongyun. The Cloud Sect resides within a Paradise. If that's the case, is the owner of the Paradise still alive?\" Lin Fan had still yet to figure out just what was going on with this. After all, living within someone's Paradise meant that they would be handing over their lives to that person.</p><br/><p>Furthermore, the Grandmaster of the Cloud Sect was a divine celestial level 8, Universal Elixir state being. Wasn't the owner of the Paradise afraid that the Grandmaster might turn against him or anything?</p><br/><p>Hearing Lin Fan's inquiry, Hongyun did not make any attempts to hide it at all. After all, this wasn't too much of a secret either.</p><br/><p>\"Actually, this Paradise was created by the Founder Ancestor of the Cloud Sect. However, in order to allow the Paradise to continue sustaining through all of time, the Founder Ancestor had passed away in a seated position of enlightenment back when had created the sect. With that, his body was infused within the Paradise's Heaven's Will, allowing him to maintain the order of this Paradise.\" The moment Hongyun thought of the noble acts of the Founder Ancestor, her face was filled with pride.</p><br/><p>This was a self-sacrificial act in order to bless the descendants.</p><br/><p>Lin Fan looked around at the depths of the cave. Within the depths, there was a ball of mysterious energy that was distinctly disconnected from all forms of exploration.</p><br/><p>On hearing about this Founder Ancestor of the Cloud Sect, Lin Fan was pretty impressed as well.</p><br/><p>Everything was done for the future.</p><br/><p>This was so that he could provide a haven of salvation for the refugees of the beings of the thousands of races. If he were the one in the same position, he would definitely not have been able to do the same.</p><br/><p>After all, which beings of that power level weren't peerless overlords that could control most things? To give up everything, to cut free from the path of true eternity and give everything to the descendants in the form of blessings... What sort of an enlightened being must that person be in order to make such a decision?</p><br/><p>There was nothing short of impressiveness in that noble act of his.</p><br/><p>Under the guidance of Fairy Hongyun, Lin Fan had a good tour of the entire Cloud Sect. At the same time, ideas of how to develop his Paradise from here on forth was starting to bloom in his mind.</p><br/><p>Even though the Cloud Sect resided within a Paradise, it seemed to be in a world of its own.</p><br/><p>Not only were there living beings that were born from the Paradise, there were even artificially created secret grounds. In fact, there were even self-imposed rules of nature in this place.</p><br/><p>There were four seasons that alternated regularly. There was the Sun and the Moon as well as the Stars. It was just that other than the Sun, Moon and Stars, everything else was dark, without a path out elsewhere.</p><br/><p>Lin Fan had been observing all the while. He was sure that his Paradise would definitely have the same capacity at the end of its path. However, there was still a long road on this path that he had to slowly discover and uncover.</p><br/><p>After touring for a long time, Lin Fan finally separated from Fairy Hongyun.</p><br/><p>However, before that, Fairy Hongyun informed Lin Fan of a piece of good news. Tomorrow, she would bring him to the library to check out all the books.</p><br/><p>With a sect as grand as this, Lin Fan already had a good idea of what was to come. The books that were kept were must definitely be as immeasurable as the seas. The depth of the contents was not something he could imagine.</p><br/><p>…</p><br/><p>Big Senior Brother's Mountain Peak…</p><br/><p>Fang Weifeng was burying his head in tears.</p><br/><p>\"Big Senior Brother! That human was simply way too cocky! Not only did he beat up Senior Brother Zhang, he insulted you as well!\" Fang Weifeng was bawling tragically.</p><br/><p>\"Senior Brother Zhang wanted him to pay an apology. However, he started spouting out with big words. He claimed that Senior Brother Zhang does not have the right to talk to him, and demanded you to see him personally!\"</p><br/><p>Liu Hen's face was solemn and indeterminate. However, it was evident that he was slightly pissed indeed.</p><br/><p>How did anybody dare to touch someone under his care in the Cloud Sect? Undoubtedly, this person was not giving him any bit of respect at all.</p><br/><p>Just where in the world did Elder Yun He find this human from? To think that he would dare to act so audaciously upon entering the Cloud Sect.</p><br/><p>\"Wenzhuang, can you confirm the words of Junior Brother Fang here? Did the human truly speak such words?\" Liu Hen asked in a deep voice.</p><br/><p>\"Big Senior Brother, Junior Brother Fang is right. That human did speak these words.\" Zhang Wenzhuang felt as though he had been given tight slaps. To think that he would be schooled as such despite being a divine celestial level 4, Undying state being. This was an utmost humiliation for him.</p><br/><p>However, Zhang Wenzhuang knew that he could blame no one but himself for the lack of skills. But, it was just that the other party was clearly just a Paradise state being! How could he not be a match for him?</p><br/><p>This was the point that Zhang Wenzhuang couldn't be clear of no matter what.</p><br/><p>Even if it were a sinner such as the Ancient race beings, they shouldn't be able to render him so utterly helpless given the cultivation level gap!</p><br/><p>\"Alright. Good, very good! Since this is the case, I'll go and check him out tomorrow then. We'll see just what sort of capabilities he has.\" Liu Hen blasted out as his eyes shone with an ominous glint.</p><br/><p>The moment Fang Weifeng heard that his Big Senior Brother was going to show up personally, he was elated beyond words.</p><br/><p>\"With our Big Senior Brother stepping in, things will definitely be fine! The human will definitely be trampled upon by our Big Senior Brother like a dead dog no matter how strong he is!\"</p><br/><p>However, Fang Weifeng's bootlicking skills had no effect on someone like Liu Hen. The decision was Liu Hen's own to make.</p><br/><p>As the Big Senior Brother, Liu Hen was locked in constant strife with the other senior disciples constantly. Now that someone under his care had been bullied so badly, if he didn't take any action towards this and news of it were to spread out within the sect, he would definitely turn into a laughing stock.</p><br/><p>At that time, there might be a significant decrease in the number of disciples following him. When that happened, there would definitely be an impact to his standing within the sect, as well as his fight for the seat of the Grandmaster.</p><br/>\n</div>"}