{"title": "Chapter 623: An Entrance That Is Highly Dependant On Its Impact", "id": 623, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-623-an-entrance-that-is-highly-dependant-on-its-impact", "volume_title": "Volume 7", "body": "<h1>Chapter 623: An Entrance That Is Highly Dependant On Its Impact</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 623: An Entrance That Is Highly Dependant On Its Impact</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"You guys are simply way too weak.\"</p><br/><p>In terms of cultivation state, divine celestial level 4, Undying state might not put Lin Fan as a heaven-defying being just yet, but if they were to compare in terms of brute strength, even a divine celestial level 5, Essence Spirit state being might not have even ten percent of Lin Fan's strength.</p><br/><p>This was even before considering the fact that Lin Fan's physical body state was now that of a divine celestial level 8, Universal Elixir state being.</p><br/><p>Right now, Lin Fan was akin to a BOSS with an extremely high defense. Most commoners would definitely not be able to take him down at all.</p><br/><p>\"Courting death!\" The moment the Ancient race being caught sight of this living being pointing out with his finger so casually, he was thoroughly enraged. He slammed out with a punch in return. Containing his Paradise within this punch, the powers were boundless and gushing.</p><br/><p>Even though this punch had the powers to devastate the world, it was still far from enough in the eyes of Lin Fan.</p><br/><p>Crack.</p><br/><p>The entire void seemed to have been hardened up by this finger of Lin Fan. With a loud crack, the void began to shatter as though it was just a piece of mirror.</p><br/><p>Bam! Bam!</p><br/><p>All of the Ancient race beings could feel as though an external force had made its way into their bodies. Immediately after that, an irresistible series of tragic wails rang through the air as they exploded into a mess of flesh and blood.</p><br/><p>'Ding…Congratulations on killing Divine celestial level 3, Paradise state Ancient race being.'</p><br/><p>'Ding…Congratulations on killing Desolate celestial full cultivation state Ancient race being.'</p><br/><p>'Ding…Congratulations on killing Divine celestial level 1, True state Ancient race being.'</p><br/><p>...</p><br/><p>Snatch! Snatch!</p><br/><p>Even though the experience points weren't that much, they were still worth taking in the end. At this moment, their essence, spirit, and vitality were absorbed by Lin Fan into his Paradise to boost it as well.</p><br/><p>Demon City was being nourished within the Paradise right now. Therefore, as the Paradise strengthened, so would the Demon City as well.</p><br/><p>With a single move, those hundreds of Ancient race beings were wiped instantly. To Lin Fan, this was practically effortless, and it didn't have him spending too much.</p><br/><p>Clang!</p><br/><p>Zi Yun's sharp and lively gaze were fixated in disbelief at this moment. The Supreme Graded Human Weapon metal fork that she had regarded as a precious treasure dropped to the ground in an instant as well.</p><br/><p>All of the other chicks were equally flabbergasted. To think that these Ancient race beings who were so fearsome and terrifying in their eyes would be killed in a single finger by this mysterious man!</p><br/><p>Wasn't this way too horrifying?!</p><br/><p>\"How could this be?\"</p><br/><p>Zi Yun and the others weren't the only ones feeling the same shock. It was the same thing for those of the Succubus race who were trapped within the cages. The scene right now had them watching with their jaws agape.</p><br/><p>Who in the world was this man? How in the world could he be this strong?</p><br/><p>Was he a friend of Zi Yun and the others?</p><br/><p>Lin Fan tossed his robes back as his long hair breezed in the wind. His eyes were fixated at the distant sky.</p><br/><p>Over there, the magic powers in the sky were rampant, as the Heavens showed a weird phenomenon. Evidently, an intense battle must be breaking out over there.</p><br/><p>By the looks of it, there must be more beings of the thousands of races who were being held down by the Ancient race beings. There was no way to tell of the situation over there right now.</p><br/><p>However, to Lin Fan, all of these Ancient race beings were still experience points nevertheless! These were experience points that he could easily get with the flip of his palms! If he were to give it up just like this, it would be a real pity!</p><br/><p>By the way the skies were looking with the chaotic powers, these Ancient race beings did not seem like they were too weak either.</p><br/><p>By the time the masses had reacted over from the situation, they looked over at this man whose long robes and hair were floating in the breeze right now. Every single one of them was intoxicated by his charm.</p><br/><p>Compared to earlier on, this man now had an aura of a powerful being, which was slamming onto their faces like a tidal wave. Some of the shyer girls of the Succubus race started blushing immediately. Evidently, they already had a crush on this man.</p><br/><p>However, to Lin Fan, he was long used to all of this by now. Given his handsome disposition, it was something natural for all the girls to be attracted towards him.</p><br/><p>Bam!</p><br/><p>Suddenly, Lin Fan leaped off from the ground and headed over into the distance.</p><br/><p>Zi Yun and the others wanted to say something, but before they could, the other party had already left. With that, they hurriedly rescued the rest of their relatives.</p><br/><p>\"Zi Yun, Piao Piao, do you guys know that man?\" A middle age woman with an exceptional grace asked.</p><br/><p>\"No, we don't. We only bumped into this man while we were trying to make our escape. We don't even know his name!\" Zi Yun shook her head.</p><br/><p>She had not expected that this man would be this strong! To think that those formidable Ancient race beings who were practically invincible in their eyes would seem so feeble and weak in the presence of this man. That was something that had them shocked entirely.</p><br/><p>\"The direction he's headed to right now seems to be where the Ancient race army is! The leader of our race is still fighting with the Ancient race beings over there! Let us hurry over as well!\"</p><br/><p>...</p><br/><p>At this moment, Lin Fan was excited beyond words. Ever since he had turned stronger, this life of his was getting more fun by the day. This was especially the case when he got the chance to show off in front of chicks. That feeling was way too domineering!</p><br/><p>That calm expression he gave off just now, that haughty face of his, that fleeting disposition of a champion… all of that must have charmed everyone on the scene entirely!</p><br/><p>\"HAHA!\"</p><br/><p>Lin Fan burst out laughing as he flipped his body in the sky. Evidently, he was overwhelmed with joy right now.</p><br/><p>The closer he got, the more Lin Fan could sense the immense powers that being sensed from the battlefield. However, compared to Grandmaster Yun, this was still way too far to compete.</p><br/><p>...</p><br/><p>\"Leader of the Succubus race, give it up! You guys are completely surrounded by us! You've got no hope at all!\" At this moment, the leader of the Succubus race was surrounded by three Ancient race consuls.</p><br/><p>These three Ancient race beings had a mighty aura, with a boundless power emanating from them. Floating in the void, they seemed to be causing the entire void to freeze up. In fact, they even seemed to be fusing with the universe at this moment.</p><br/><p>The leader of the Succubus race was a young lady. Every single move of hers seemed to possess an immense charm. Looking at this girl, those three Ancient race consuls could not help but let out a lustful look in their eyes as they gulped down their saliva.</p><br/><p>If the Ancient race beings wanted to play with the beings of the thousands of races, they would undoubtedly have to go for those of the Succubus race. After all, the nature and bodies of these Succubus race beings were definitely going to be a memory that was worth relishing over and over again.</p><br/><p>This was especially the case for the leader of the Succubus race. She was someone that these three consuls had been lusting over for the longest time now.</p><br/><p>The moment they caught wind of the hiding place of the Succubus race, even the Ancient race beings themselves were fighting over hunting them. After all, hunting down the Succubus race was an extremely pleasant task to do.</p><br/><p>\"Leader, we must definitely die in combat! Otherwise, if we were to be caught by them, our fates would definitely be worse than death!\" A group of women stood beside the leader of the Succubus race. These women had a sharp gaze in their eyes. Their aura was steady, and their cultivation states were far from weak.</p><br/><p>\"There must have been someone who sold us out! Our Succubus race is aloof from the affairs of the world, and we were hidden so deeply! There's no way we would have been discovered!\"</p><br/><p>\"Mei Ji must be the one who betrayed us! Back when we had rescued her from the hands of the Ancient race beings, I had already realized that something was off with her!\"</p><br/><p>\"Mei Ji!\"</p><br/><p>The faces of the leader of the Succubus race and the others froze up. They looked around hurriedly, and noticed that Mei Ji had gone missing.</p><br/><p>At this moment, a sly laughter came from behind the Ancient race beings. There, a slu*ty looking woman, who was scantily clad, leaned on the body of an Ancient race consul as she used her long finger to curl at her fellow Succubus race beings.</p><br/><p>\"You guys should hurry up and surrender! Our dear consul will be sure to cherish and take good care of you guys.\"</p><br/><p>\"HAHA!\" One of the Ancient race consul burst out laughing. As though he was cradling a small bird, he held this woman of the Succubus race in his arms and laughed devilishly.</p><br/><p>\"She's right. Bow down to us and I shall guarantee that you're free from your sufferings and torments. Otherwise, you shall definitely lead a fate worse than death!\"</p><br/><p>The beings of the Succubus race glared at Mei Ji as rage burned in their hearts, \"Hmph! We would rather die than submit to you!\"</p><br/><p>\"Hehe! If you really wanna die, wouldn't that be easy though? You guys are completely surrounded by the Ancient race right now. Where else can you escape to?\" The Ancient race consul spread out his arms and laughed wildly.</p><br/><p>With the Succubus race in the center, rings after rings of Ancient race beings were encircling them right now. Densely packed and boundless, they were like locusts that were covering an entire field with a blanket. There was no way out!</p><br/><p>For these beings of the Succubus race, there was no longer an escape path.</p><br/><p>Each of them let out a look of despair as they exchanged glances with one another. They knew that these three were part of the seven consuls under the command of the Sovereign King Wei. Their powers were formidable; it wasn't something they could possibly hope to go against.</p><br/><p>\"Are you guys thinking of self destructing with your Paradise? But, it's a pity you guys wouldn't be able to do that. With Your Consul here, do you guys think that I would allow that?\" The Ancient race consul roared out in laughter. Opening his arms, the laws of the world around them began to change immediately. The beings of the Succubus race suddenly realized that their Paradises were being forcefully suppressed! They couldn't even self-destruct from within!</p><br/><p>At this moment, the leader of the Succubus race and the others were truly despairing. It had just struck them that these Ancient race beings had just been playing with them from the very beginning!</p><br/><p>But, it seemed as though they'd grown tired of playing these games by now.</p><br/><p>Looking at these sinister and hideous looking Ancient race beings that were surrounding them, they truly felt anguished within their hearts.</p><br/><p>\"Indeed, this didn't disappoint me! To think that there are so many Ancient race beings over here!\"</p><br/><p>At this moment, a gleeful voice rang out from the void suddenly.</p><br/><p>\"Who's there?\" The faces of the Ancient race consul grew stern as they looked over into the distance. At this juncture, who would dare to come and throw their lives away?</p><br/><p>All the Succubus race beings turned their heads in unison at the distance as well. The moment they looked over, their faces changed as their eyes shone with astonishment.</p><br/><p>The sight in the distance had all of them utterly shocked right now.</p><br/>\n</div>"}