{"title": "Chapter 626: Blossoming Of The Mythical Parasol Tree", "id": 626, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-626-blossoming-of-the-mythical-parasol-tree", "volume_title": "Volume 7", "body": "<h1>Chapter 626: Blossoming Of The Mythical Parasol Tree</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 626: Blossoming Of The Mythical Parasol Tree</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>A chilling aura spread out in all directions, as though a tidal wave had just engulfed the entire world.</p><br/><p>Despite being at some distance from the point of impact, the beings of the Succubus race could feel the ripples in their hearts. Under this frightful aura, everyone's face was pale as they let out looks of horror.</p><br/><p>The leader of the Succubus race looked over at the distance, wondering what the final outcome of this would be like.</p><br/><p>It was no longer any secret that the Ancient race was blessed with the help of the Heaven's Will of the Ancient Saint World. In fact, there was even some powerful being who said that the Heaven's Will of the Ancient Saint World was just in a deep slumber right now. Therefore, it could only react to certain energies from the unknowns, and was unable to directly attack by itself.</p><br/><p>Once the day came when the Heaven's Will of the Ancient Saint World were to awaken once more, all of the beings of the thousands of races out there would definitely be subjugated as slaves by it, or perhaps die in its hands.</p><br/><p>\"Just what in the world is going on over there?\"</p><br/><p>A beam of bright light shot out through that arrow, blinding the entire world in its radiance.</p><br/><p>Zi Yun and the others were rushing over here. However, they stopped right in their tracks. They could feel an aura that was causing their hearts to palpitate furiously.</p><br/><p>This energy was both berserk and sinister.</p><br/><p>...</p><br/><p>\"Damned Motherf*cking Human King! Your actions are unpardonable! Today, we shall have you die under this arrow!\" The three faces on the arrow howled out balefully, and were extremely angst right now as they let out sounds akin to that of angry ghosts.</p><br/><p>Towards this course of action they were taking, Lin Fan felt ashamed for them. Heck, weren't they too damned despicable?</p><br/><p>This Heaven's Will of the Ancient Saint World was way too despicable! To think that it would render them assistance so damn brazenly!</p><br/><p>Even if the three of these consuls were to self-detonate, they wouldn't be able to create such a formidable amount of power! Evidently, everything that was happening right now was all due to the Heaven's Will's doing!</p><br/><p>PSHEW!</p><br/><p>As the arrow seared out, the sound that was created by it ripped through the void and rang out through the entire world. Under the might of this arrow, the void was exploding continuously.</p><br/><p>However, despite this, Lin Fan wasn't afraid in the least bit.</p><br/><p>\"Ants are ants at the end of the day. Even if you've got the help of an external force, it won't do much to give you guys the advantage.\" Lin Fan stretched out two of his fingers and clipped the arrow between them in a sandwich.</p><br/><p>The long arrow was in a frenzy right now. It struggled out violently under the might of Lin Fan's fingers, trying its best to break free from them and pierce Lin Fan to death.</p><br/><p>Instantly, Lin Fan's face changed. Yet another blinding light was emitted from the long arrow as it finally broke free of Lin Fan's grasp and started howling madly once more.</p><br/><p>\"HAHA! Human! Your doomsday is here!\" The three consuls of the Ancient race laughed insanely. For this one moment, they had been waiting a long, long time now.</p><br/><p>However, they did not expect this human to be this strong!</p><br/><p>If not for the fact that the Ancient Saint World had boosted them, their combined powers might have been blocked down entirely by this human himself!</p><br/><p>However, they were at peace and confident right now. There was no way this human was going to survive this right now.</p><br/><p>The Heaven's Will was boundless. It wasn't something that mere ants of the thousands of races could easily fend against.</p><br/><p>In the blink of an eye, the long arrow pierced through Lin Fan's body. However, it disappeared almost immediately after.</p><br/><p>\"Where are we?\" Initially, the three consuls of the Ancient race were all ready to see the human explode into pieces. But to think that they were teleported to a weird and mysterious place suddenly!</p><br/><p>\"This is the Paradise of Yours Truly. Do you guys really think that you can kill Yours Truly with just something like that?\" Lin Fan floated within his Paradise and grinned coldly.</p><br/><p>\"Damn it, DAMN IT! KILL HIM!\" The three consuls had not expected things to turn out this way as they burst out in rage.</p><br/><p>PSHEW! PSHEW!</p><br/><p>This long arrow that possessed a limitless amount of power started darting around the confines of Lin Fan's Paradise as it burst forth to kill Lin Fan.</p><br/><p>Lin Fan kept his composure and floated gently within his Paradise. Curling his fingers, the Mythical Parasol Tree suddenly showed its might as countless branches burst forth from the ground into the sky, coiling and wrapping themselves around this long arrow.</p><br/><p>\"What's this thing?!\"</p><br/><p>\"Our power's diminishing! This thing is absorbing our energy!\"</p><br/><p>\"Heaven's Will! Burst forth, BURST FORTH!\"</p><br/><p>Wrapped by the branches of the Mythical Parasol Tree, the long arrow was stuck in the air and unable to budge even a single inch.</p><br/><p>Just at this moment, something shocking happened for Lin Fan.</p><br/><p>Suddenly, the powers of the Heaven's Will that were boosting this long arrow dissipated before his very eyes, and were absorbed furiously by the Mythical Parasol Tree!</p><br/><p>The branches of the Mythical Parasol Tree began to tremble immensely as it creaked loudly.</p><br/><p>\"It's blossoming?\" Looking at what was happening to his Mythical Parasol Tree, Lin Fan's expression changed.</p><br/><p>It had been a long time since a weird phenomenon as such had happened with the Mythical Parasol Tree! However, the startling thing was that the Mythical Parasol Tree suddenly sprouted out a flower with brilliant colors!</p><br/><p>Even though this flower was still pretty young, Lin Fan knew that every single change that the Mythical Parasol Tree underwent was something that shouldn't be underestimated!</p><br/><p>Thud!</p><br/><p>The long arrow dropped to the ground in a thud. The luster on it began to darken down as its powers were gradually disappearing.</p><br/><p>\"DAMNED HUMAN! WE CAN'T ACCEPT THIS! WE JUST CAN'T ACCEPT THIS!\"</p><br/><p>The three consuls of the Ancient race howled out with their last bit of strength in a high pitched yet feeble voice. Gradually, there was nothing left of these voices.</p><br/><p>'Ding…Congratulations on killing Divine celestial level 6, Law state Ancient race being.'</p><br/><p>'Ding…Experience points +250,000'</p><br/><p>'Ding…Congratulations on killing Divine celestial level 6, Law state Ancient race being.'</p><br/><p>'Ding…Congratulations on killing Divine celestial level 6, Law state Ancient race being.'</p><br/><p>...</p><br/><p>'Absorb!'</p><br/><p>As divine celestial level 6, Law state Ancient race beings, every single part of their bodies was extremely precious. Paradise, physical body, law, et cetera, even a single strand of their hair would probably possess an immense amount of power.</p><br/><p>Their Paradise disintegrated, their physical body was broken, and their laws cultivated.</p><br/><p>Core smelt!</p><br/><p>Instantly, a gigantic river of power started flowing within the Paradise.</p><br/><p>'I've earned big time this time around!' Lin Fan was exhilarated at this moment. Seemed like killing the Ancient race beings was the best choice to make, especially when they were powerful ones at that.</p><br/><p>However, it was a pity that these three Ancient race beings had forsaken their physical bodies in order to come and kill him. Because of that, all of their resources were expended into nothingness, leaving only a bit of that pure power that they possessed.</p><br/><p>If these three Ancient race beings had not sacrificed their bodies, he might even be able to get at their storage rings and grab their possessions. Based on their positions in the Ancient race, there would definitely be a decent amount of treasures to be taken.</p><br/><p>However, it was still pretty alright the way things were right now. The Paradise had grown stronger after all. Also, that boundless amount of power in that long river was seeped within the Paradise as well, nourishing the Skill and Weapon Spirits.</p><br/><p>Outside…</p><br/><p>The beings of the Succubus race were starting to get anxious at this moment. They wondered what had just happened. However, when they caught sight of the figure of that person, everyone was startled.</p><br/><p>That imposing figure of his, that calm face of his, that man was the Motherf*cking Human King!</p><br/><p>He was alright!</p><br/><p>As for the other three Ancient race beings, they had disappeared from the face of the world!</p><br/><p>At this moment, Lin Fan was immersed deeply in his Paradise. The weird behavior of the Mythical Parasol Tree had attracted his attention. To think that the Mythical Parasol Tree would blossom with a flower. Naturally, there had to be an ending to this.</p><br/><p>Could the Heaven's Will be the reason behind this?</p><br/><p>However, how could he go and seek out the Heaven's Will for more of its energy? Forget it, he would just make do with this for now. Based on his current strength, there was no way he could just head out and challenge the Ancient Saint World's Heaven's Will just like that. Even if he could, there was no way he would seek it out right now. </p><br/><p>The fact that the Mythical Parasol Tree had blossomed was a good beginning in itself.</p><br/><p>Looking at the beings of the Succubus race below him, Lin Fan smiled casually.</p><br/><p>\"Leader!\" Zi Yun and the others rushed forth from the distance. The moment they realized that their leader and the others were alright, they heaved out a sigh of relief.</p><br/><p>Vice versa, the leader of the Succubus race was relieved over Zi Yun's safety.</p><br/><p>However, at this moment, everyone's attention then turned towards this figure in the sky.</p><br/><p>The Motherf*cking Human King, Lin Fan.</p><br/><p>Just who in the world was this man? How could he be this strong?</p><br/><p>But, just as everyone was beginning to settle down, a pitch-black darkness blanketed the sky in the distance. The black clouds rumbled like the furious waves in the seas as they made their way over.</p><br/><p>Within this patch of black clouds, a sinister castle was faintly discernible. A sinister aura filled the entire sky with its sketchy movements. Be it Ancient beasts or living beings, everything stood out of its way.</p><br/><p>\"Holy f*ck! Just which troublesome fella is it this time round?!\"</p><br/>\n</div>"}