{"title": "Chapter 625: Playing Cheat!", "id": 625, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-625-playing-cheat", "volume_title": "Volume 7", "body": "<h1>Chapter 625: Playing Cheat!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 625: Playing Cheat!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Ancient Saint Origin's Ancient Saint Fist! Devastate the world!\"</p><br/><p>There was no way these three consuls of the Ancient race can allow this human to continue killing as such. Hence, they laid out their killer moves.</p><br/><p>Three fists rained out, as an energy descended from the unknowns of the Ancient Saint World's Heaven's Will and boosted them. A single punch to break through everything, bringing with it a limitless amount of power…</p><br/><p>Every single fist was as massive as a mountain, bringing with it a tremendous force that caused the entire void to vibrate. The fists turned into images of Fist Gods. These Fist Gods represented the epitome of fist moves, possessing an endless amount of Law within them.</p><br/><p>\"Motherf*cking Human King! Go to hell!\" The three Ancient race consuls did not know whether this was the real Motherf*cking Human King. Therefore, they wouldn't get too careless, and wanted to take down this human with everything they had in a single move.</p><br/><p>This set of fist moves was initially a combined attack by all seven consuls together. The moment all of them were to use it together, it would bring forth a phenomenal strength.</p><br/><p>But at this moment, there were only three consuls who were deploying the skill together. Despite that, the amount of force was still tremendous, definitely way stronger than any other move that any other mere divine celestial level 6, Law state being could deploy.</p><br/><p>Looking at these ant-like Ancient race beings, Lin Fan opened his hands wide and continued slapping down. These dense number of palm strikes swooped down from the Heavens in a flurry and slapped the Ancient race army to death.</p><br/><p>Absorb! Absorb!</p><br/><p>Lin Fan was extremely elated in his heart right now. The Spirit Qi within his Paradise was getting denser than ever. The Mythical Parasol Tree, which was receiving all these essence, spirit, and vitality from the Ancient race beings, was even more active right now.</p><br/><p>The flourishing branches were filled with a lush, green tone to them. There were Flower Spirits which were only the size of a palm that were dancing around the Mythical Parasol Tree and singing along while nurturing it.</p><br/><p>BAM!</p><br/><p>Three fists broke through the void and landed on Lin Fan's body.</p><br/><p>\"It's done!\"</p><br/><p>The three consuls of the Ancient race were elated at this scene. As long as they were to land a full strike, no matter how strong the other party was, they would definitely die!</p><br/><p>However, the three consuls of the Ancient race realized in disbelief that this single punch of theirs that contained all of their powers seemed to have no effect at all, as it landed onto the body of this human right here!</p><br/><p>\"It neither hurts nor itches.\" Lin Fan grinned while patting his clothes.</p><br/><p>If not for the fact that Grandmaster Yun of the Cloud Sect had helped to raise his physical body state to a divine celestial level 8, Universal Elixir state, these three fists would have given him a run for his money as well.</p><br/><p>The higher the status of the Ancient race beings, the stronger their powers were. Be it in terms of comprehension or innate potential, all of these guys were top tiered existences within the Ancient race.</p><br/><p>These three Ancient race consuls were probably second to none in the Ancient race, reigning over everyone else. Other than the Sovereign King Wei, they were the second in command.</p><br/><p>\"How could this be?\" At this moment, the three consuls of the Ancient race yelped out in shock.</p><br/><p>To think that this human could have defended against their killer move with such ease? This man was truly the Motherf*cking Human King! Not only that, has his cultivation state reached a point which was too far for them to reach!</p><br/><p>The moment the leader of the Succubus race caught sight of how the killer move of the three consuls did no damage to Lin Fan at all, she was immediately taken aback. However, her shock turned into a smile soon after.</p><br/><p>If this were truly the case, the Succubus race might just be able to get out of this alright!</p><br/><p>Motherf*cking Human King, Lin Fan?</p><br/><p>Since when did such a powerful being exist within the Ancient Saint World? Why hadn't they heard of it before?</p><br/><p>\"Why could it not be? This is all because you guys are far too weak.\" Lin Fan replied in disdain.</p><br/><p>Right after divine celestial level 4, Undying state was the Essence Spirit state. For most people, if they wanted to become a powerful being of Essence Spirit state, they could first have to cultivate out their second Essence Spirit. However, because Lin Fan possessed the system, all he required was experience points, and that was all.</p><br/><p>As long as his experience points were enough, he would automatically enter the divine celestial level 5, Essence Spirit state. With that, he could automatically form the second Essence Spirit as well.</p><br/><p>There was no way Lin Fan was going to let these three consuls of the Ancient race go at any cost.</p><br/><p>However, at this moment, Lin Fan was in fact more interested in crushing all of the ants of the Ancient race army.</p><br/><p>Even though the big ancient demon had already been subjugated by him and turned into a Weapon Spirit, it was still imposingly mighty. A single move of his could bring forth an immense amount of power, that was unparalleled.</p><br/><p>Just by opening his mouth, he swallowed countless Ancient race beings into his tummy. A single wave of his hands brought forth an immense vortex cyclone that blended the Ancient race beings into dregs.</p><br/><p>If there were enough ants, even an elephant could die by their bites.</p><br/><p>However, to Lin Fan, these ants were merely toothless ants.</p><br/><p>Right now, the Thunder Trainer King was showing off his Buddhistic nature as he was spouting out words of the sutra. Every single character of the words floated out gently in the world, cleansing every single living being out there. Under the cleansing of these sutras, those evil looking Ancient race beings turned extremely calm and docile immediately.</p><br/><p>In a jiffy, the Thunder Trainer King flicked out with his finger. Instantly, the Ancient race beings disappeared, and were brought into the Paradise. The moment they entered the Paradise, they exploded out instantly. Their meat, blood, essence, spirit, and vitality were all divided out and absorbed by the living beings of the Paradise, turning into nothingness.</p><br/><p>\"ARGGGGGGHHHHHHHHHHHHHH!\"</p><br/><p>The three consuls of the Ancient race howled madly. Looking at how their underlings were being massacred by this human, their hearts burned with rage uncontrollably.</p><br/><p>\"I'm afraid we aren't his match at all. However, no matter what, we've got to kill him!\"</p><br/><p>\"Damned human, damned human! I swear that I'll never let it go until I kill him!\"</p><br/><p>The three consuls of the Ancient race exchanged glances with one another, their eyes filled with a maddened frenzy.</p><br/><p>\"MOTHERF*CKING HUMAN KING!\" The three of them howled wildly.</p><br/><p>\"TODAY, EVEN IF WE HAVE TO GIVE IT OUR ALL, WE'LL DEFINITELY KILL YOU!\"</p><br/><p>Initially, Lin Fan had intended to just ignore these three consuls and leave them for the last.</p><br/><p>However, there was something that was causing Lin Fan to frown slightly. All of a sudden, a strange devastating amount of energy erupted out of these three Ancient race consuls out of nowhere.</p><br/><p>As the leader of the Succubus race caught of these changes, her face changed as she yelled out, \"Watch out! These three consuls are trying to use their Paradise, Essence Spirit, and Law as a sacrifice to unleash a horrifying attack!\"</p><br/><p>Lin Fan's expression did not change as he continued watching. He then smiled casually, \"Seems like you guys are really going to go all out just to kill me, eh?\"</p><br/><p>\"Hmph! We know that you're the Motherf*cking Human King, and that you're strong. Right, we definitely aren't your match. But, no matter what, we must have you pay the price!\"</p><br/><p>The three consuls of the Ancient race growled nefariously. Instantly, their bodies shone with a bright light, as their Paradise, Essence Spirit and Law surged out from their bodies and fused together.</p><br/><p>\"MASSACRING ANCIENT ARROW!\"</p><br/><p>With that, the three consuls of the Ancient race disappeared entirely. All that remained before Lin Fan's face was a bow. The aura of this bow was berserk, as it was filled with a massacring aura.</p><br/><p>On the surface of the bow, a facial expression appeared.</p><br/><p>This was one of the Ancient race beings.</p><br/><p>\"Damned human! Did you really think that we're going to die? I'll have you know that there's nothing our Lord Utmost Being cannot do! Even if we were to die, our Lord Utmost Being would definitely resurrect us! As for you, you shall perish entirely under the might of this arrow! Your soul and spirit shall disintegrate as well!\"</p><br/><p>BOOM!</p><br/><p>Within the void, lightning flashed, and a consciousness descended from the unknowns.</p><br/><p>\"May the blessings of the Heaven's Will be with me, may the Heaven's Will descend! The almighty Heaven's Will, go forth, Arrow of the Heaven's Will!\"</p><br/><p>Instantly, an even more terrifying form of energy erupted forth as a pitch black long arrow floated gently in the skies.</p><br/><p>This long arrow was wrapped with a mysterious source of energy around it.</p><br/><p>\"Holy f*ck! These guys are playing cheat!\" Lin Fan had not expected the Heaven's Will of the Ancient Saint World to be this brazen. How dare it help the Ancient race so openly as such?</p><br/><p>This power overwhelmed everything. This was not even including that mysterious power that was wrapped around the arrow above it.</p><br/><p>That aura reeked of the Heaven's Will of the Ancient Saint World.</p><br/><p>With the boost of the Heaven's Will at this place, they were bent on killing him right here and now.</p><br/><p>\"GO AND DIE!\"</p><br/><p>The big bow started arching as it shone with a sharp glint. It fused into one with that devastating long arrow.</p><br/><p>Suddenly, a loud explosion rang out across the entire place.</p><br/><p>A streak of light bolted out at Lin Fan with immense force, surpassing everything before it, including time, space, and the void.</p><br/><p>\"DIE! YOU MUST ABSOLUTELY DIE FOR US!\"</p><br/><p>On the long arrow, three familiar faces appeared howling venomously.</p><br/>\n</div>"}