{"title": "Chapter 629: To Think That It Would Be This Small!", "id": 629, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-629-to-think-that-it-would-be-this-small", "volume_title": "Volume 7", "body": "<h1>Chapter 629: To Think That It Would Be This Small!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 629: To Think That It Would Be This Small!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>To be honest, Lin Fan was someone with quite the vendetta against the rich. This was especially the case for this Evil Alliance Prince. At the start, he hadn't taken a good look at all. However, when the black clouds palace flew over his head, Lin Fan realized that this black cloud palace was an Upper Graded Dao Weapon!</p><br/><p>This was the richest person that Lin Fan had come across so far!</p><br/><p>What sort of riches must any beings of the thousands of races possess in order for them to have a Dao Weapon in their hands? Needless to say, it was probably only that handful of them who could possibly afford it.</p><br/><p>After all, the beings of the thousands of races couldn't craft out weapons of their own. If they wanted a treasure, they would have to snatch it over from the jaws of the Ancient race beings.</p><br/><p>To think that the Evil Alliance Prince would be riding on an Upper Graded Dao Weapon right now. This meant that the Evil Alliance must be pretty strong.</p><br/><p>The beings of the Succubus race had already left this place. Naturally, Lin Fan could not allow the Evil Alliance Prince to catch up with them. Therefore, he used a single Sword Will to cleave the black clouds that were shrouding this palace instantly, revealing the true shape of this palace.</p><br/><p>The image from the innate skill of the Succubus race was sent over to the eyes of the beings of the thousands of races. The moment the palace appeared before their eyes, all beings were startled.</p><br/><p>This infamous name of the Evil Alliance Prince was quite the shocker to some of the beings of the thousands of races. Not only was he strong, his methods were cruel. The most gut crunching thing was that this Evil Alliance Prince would only target female beings. Not only that, he would suck them into dried up corpses each time.</p><br/><p>These methods were way too cruel. Way, way too cruel.</p><br/><p>And, to think that the Motherf*cking Human King would step forth and halt the Evil Alliance Prince in his way. Their hearts were filled with hope. They wanted the Motherf*cking Human King to kill this Evil Alliance Prince brutally.</p><br/><p>\"Who is it that dares to hinder the path of Your Prince here?\"</p><br/><p>At this moment, those golden shining doors of the palace slammed open. Countless light beams burst forth from it, causing the sky to shower and fill with floating flower petals.</p><br/><p>The Evil Alliance Prince, who was draped in red robes, walked out of it flamboyantly. He stood upright in the void and glared at Lin Fan.</p><br/><p>\"Are you the one who is blocking the path of Your Prince here?\" The Evil Alliance Prince asked in a stern manner. Those sinister eyes of his were checking out Lin Fan right now. He did not know the background of this living being right here. To think that he would dare to strike out at his palace! Was this guy tired of living?</p><br/><p>Lin Fan swept a casual glance over at the Evil Alliance Prince. Divine celestial level 7, All in One state.</p><br/><p>Strong, very strong indeed… Even the Sovereign King Wei isn't his match.</p><br/><p>However, this was the very type of strength that would give him the guts to chase after the Ancient race and demand for the beings of the Succubus race back.</p><br/><p>Even though it was widely known that the Ancient race was the ruler of the Ancient Saint World, to put it bluntly, power still came before that.</p><br/><p>The Evil Alliance Prince had an Upper Graded Dao Weapon in his possession. Therefore, his powers weren't something that any mere divine celestial level 7, All in One state beings could deal with.</p><br/><p>Lin Fan did not have his gaze stop at the Evil Alliance Prince. Instead, it was still cast further back into the distance. He could sense an aura striding through the void and heading towards his direction speedily.</p><br/><p>Lin Fan's heart was skipping really quickly as the fresh blood in his body rumbled.</p><br/><p>The Utmost Being of the Ancient race, Cruel. This was an invincibly horrifying character.</p><br/><p>He was so strong that he could raise the hackles of people.</p><br/><p>Lin Fan's heart was beyond nervous right now. However, at this very moment, this path was something that was chosen by him. Even if he were cheated, he would have to bear with it.</p><br/><p>The reason why he had handed a fresh drop of his blood over to the beings of the Succubus race was so that he could leave a final path for himself.</p><br/><p>Even if he were really beaten to a pulp by the Utmost Being of the Ancient race, he could still go through Rebirth through Blood.</p><br/><p>\"Hmph, Your Prince here is asking you a question. Are you deaf?\"</p><br/><p>The Evil Alliance Prince was angered right now. He had realized that this living being was ignoring him! This guy was totally not giving him any bit of respect at all!</p><br/><p>Who was he? He was the bloody Evil Alliance Prince! He was an existence that ruled over practically everyone!</p><br/><p>Not only that, his cultivation state was earth shattering! Even in the Ancient Saint World, he was an existence that could only be described as overbearing!</p><br/><p>He reigned over all the ants of the thousands of races. With a single notion of his, he could easily seize their lives if he wanted to. But, to think that a living being would be ignoring him right now. How could this not anger him like this?</p><br/><p>All the living beings who were surrounding and watching the screen right now could feel a knot in their stomachs.</p><br/><p>Yes, it was true that the Evil Alliance Prince was strong. However, none of that would matter once the Utmost Being of the Ancient race arrived.</p><br/><p>\"This Evil Alliance Prince is acting so brazenly at this moment. However, this would be the way he would die tragically here.\"</p><br/><p>\"That's for sure. Haven't you guys seen how the Motherf*cking Human King is just ignoring him? It's evident that the one who would arrive later on must be the Utmost Being of the Ancient race.\"</p><br/><p>\"That Motherf*cking Human King has just admitted with his very own mouth that he isn't a match for the Utmost Being of the Ancient race. Then, why is it that he's choosing to wait here for the arrival of the Utmost Being?\"</p><br/><p>\"Hasn't the Motherf*cking Human King answered that? His motive is to check out the true face and strength of the Utmost Being of the Ancient race. Does any of you even know just how strong the Utmost Being of the Ancient race is?\"</p><br/><p>At this moment, all of the sects and all of the Shangri-Las began to discuss fervently. All of them knew that the events of today would serve as a morale booster.</p><br/><p>However, the thing that was worrying them was that if the Motherf*cking Human King wasn't a match for the Utmost Being, how was he supposed to keep his life later on?</p><br/><p>...</p><br/><p>\"B*stard sh*t!\" The Evil Alliance Prince couldn't take this any longer. Instantly, he darted down from above his palace and headed straight at Lin Fan for the kill.</p><br/><p>\"To think that you would court death as such! Since that's the case, Your Prince here shall grant you that!\" The Evil Alliance Prince grabbed out with his hand. Instantly, that bloodied hand transformed into a set of white bones. Under the bright gleam of light, it emanated a brilliant radiance as though it was ready to cut through everything.</p><br/><p>Lin Fan stood there without budging an inch. He couldn't be bothered with the attack of the Evil Alliance Prince at all.</p><br/><p>At this moment, he was only concerned about the Utmost Being of the Ancient race. Nothing else mattered in the face of that.</p><br/><p>\"GO TO HELL!\"</p><br/><p>Clang!</p><br/><p>His claw-like grip landed on Lin Fan's chest. However, as though it had just slammed into a metal plate, a ringing sound rang out.</p><br/><p>Lin Fan swiped his hands and activated Bare Nudity instantly.</p><br/><p>In the blink of an eye, the Evil Alliance Prince realized that his body was feeling chilly, and his nuggets were receiving the loving frost of the cool breeze outside.</p><br/><p>At the same time, the Evil Alliance Prince was in utter disbelief that his skill would have no effect at all after landing on the body of the other party! In fact, the other party didn't even budge a single inch!</p><br/><p>This didn't make any sense to the Evil Alliance Prince at all!</p><br/><p>\"How could this be?\"</p><br/><p>He lowered his head and realized that there wasn't even a single thread left on his body. His face turned extremely terrible.</p><br/><p>The moment the beings of the thousands of races who were watching the light screen saw this, they nearly spat out an entire mouthful of blood from their mouths.</p><br/><p>To think that things would turn out as such!</p><br/><p>At the very beginning, they had thought that a fearsome battle would definitely break out between the Motherf*cking Human King and the Evil Alliance Prince. But they hadn't expected things to take on such a dramatic twist!</p><br/><p>\"HAHA! Look at that little donger of the Evil Alliance Prince! How tiny is that? If I were not looking closely, I wouldn't even be able to tell it out at all!\"</p><br/><p>\"I'm afraid that the Evil Alliance Prince doesn't even know just yet that the beings of the Succubus race are using their innate skill to transmit all of these images to us of the thousands of races, right?\"</p><br/><p>\"That skill of the Motherf*cking Human King…It's so strong!\"</p><br/><p>Lin Fan turned around to look at the Evil Alliance Prince. He then shook his head gently, \"To think that it would be this small.\"</p><br/><p>As a man, there was no way the Evil Alliance Prince could endure such humiliation.</p><br/><p>\"How dare you treat me as such? However, so be it! As long as I kill you here today, no one else will ever find out about this!\" This was a soft spot for the Evil Alliance Prince. There had been no one else who had ever known about this, not even those girls that were surrounding him. That was because the moment they found out, it would be the moment they were turned into dried up corpses.</p><br/><p>\"The only way for others to not find out is for it to not exist in the first place. Can you see what that is?\" Lin Fan pointed out with his finger at a bright spot of light that was floating in the skies. Suddenly, it opened up into a screen.</p><br/><p>On this screen was the current state that the Evil Alliance Prince was in right now.</p><br/><p>\"T-the innate gift of the Succubus race!\" The moment the Evil Alliance Prince caught sight of this image, his face changed and was looking as terrible as it could be.</p><br/><p>\"Yepp! I suppose that the beings of the thousands of races must all know about it by now!\" Lin Fan replied.</p><br/><p>\"YOU B*STARD! Since that's the case, I'll just have to kill every single living being of the thousands of races who're watching this right now!\" The Evil Alliance Prince's face was menacing right now as his eyes shone with a boundless killing intent.</p><br/><p>\"I don't suppose that you've got that chance any longer. Soon, the Utmost Being of the Ancient race is about to arrive here, and I suppose that you're just going to have to die here.\" Lin Fan replied indifferently.</p><br/><p>\"Utmost Being of the Ancient race?\" The face of the Evil Alliance Prince changed momentarily. However, he burst out laughing soon after, \"You damned thing! How dare you try to trick me still? How could the Utmost Being of the Ancient race possibly arrive here? This is a lie that even a three-year-old wouldn't believe in at all! To think that you could even spout out such nonsense!\"</p><br/><p>\"He's here!\" At this moment, Lin Fan's face froze up. His body bolted upright as an aura surged into the Heavens. At the same time, the face of the Evil Alliance Prince changed as he looked over at the distance.</p><br/><p>That initially furious expression of his turned pale as a sheet. He mumbled out in disbelief.</p><br/><p>\"How could this be…?\"</p><br/><p>...</p><br/>\n</div>"}