{"title": "Chapter 624: How Does No One Know About My Name Yet?", "id": 624, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-624-how-does-no-one-know-about-my-name-yet", "volume_title": "Volume 7", "body": "<h1>Chapter 624: How Does No One Know About My Name Yet?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 624: How Does No One Know About My Name Yet?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>At the end of the day, the thing that mattered the most to Lin Fan was his entrance. One could never ever make do with an entrance that was anything less than spectacular.</p><br/><p>Otherwise, how was Lin Fan to answer to himself after his lifetime of achievements so far?</p><br/><p>Floating in the air right now was a Colossal Dragon that was 100,000 feet long. It's majestic disposition and boundless dragon might encompassed the entire world. The scales on its body were extremely shiny, akin to glowing heavenly soldiers in the sky right now.</p><br/><p>And, on the head of this majestic Colossal Dragon stood Lin Fan. Hands behind his back, his eyes looked down on all the living beings of this world in disdain.</p><br/><p>Even though the Thunder Trainer King was small in stature, he too was draped in an intricate robe. Toying with thunderbolts in both of his hands while having his long hair dance in the air, there was a Buddha glow gleaming at the back of his head as he smiled imposingly.</p><br/><p>The big ancient demon held the Demon City in his hands, and stood tall with his towering figure, stretching into the Heavens and Earth.</p><br/><p>With these two fellas standing behind Lin Fan, he looked more domineering than ever.</p><br/><p>At this moment, the leader of the Succubus race and the others looked over at the direction of Lin Fan. All of them were stunned.</p><br/><p>That 100,000 feet long Colossal Dragon was the one that had all of their jaws dropping apart especially.</p><br/><p>That was one of the top ten Old Ancient Beasts!</p><br/><p>Each of the Old Ancient Beasts were extremely ferocious. In fact, even the Ancient race might not want to face them at times. To think that it would have a man stand on its head and bow down as his pet willingly!</p><br/><p>This Colossal Dragon here was a product of that precious Paradise of Lin Fan. In order to manifest this Colossal Dragon out of it, he had to expend quite a bit of Spirit Qi of his Paradise.</p><br/><p>However, even though this Colossal Dragon looked intimidating from the front, its cultivation state wasn't that high. It was only that of a divine celestial level 3, Paradise state.</p><br/><p>Despite that, Lin Fan knew that there was a huge potential for this Colossal Dragon. Because it was able to continue cultivating on its own.</p><br/><p>\"Who are you?\" The three Ancient race consuls looked at this man in the void warily as they asked with a stern face.</p><br/><p>Lin Fan's entrance did have the three consuls of the Ancient race a little shaken because of it. This was truly the first time they had seen anyone enter as such. Heck, even the Sovereign King Wei wasn't as domineering at this!</p><br/><p>\"Yours Truly here is the Motherf*cking Human King, Lin Fan.\" Lin Fan tossed back his robes and replied casually.</p><br/><p>It had been some time now since Lin Fan has started using this name. However, he still had the feeling that there weren't many people who knew about this.</p><br/><p>To Lin Fan, this didn't make any sense at all.</p><br/><p>He had toppled the entire Despair City, killed the previous Sovereign King Wei, and annihilated an entire Ancient race army. Which of these weren't an earth-shattering achievement on its own?</p><br/><p>But, despite being so, why the hell didn't anyone know about it?</p><br/><p>What about those fellas that were saved by Yours Truly? Were they doing their jobs of advertising this name for Yours Truly?</p><br/><p>At this moment, the faces of the three Ancient race consuls changed immediately as they hollered out, \"You're the Motherf*cking Human King, Lin Fan?\"</p><br/><p>Initially, Lin Fan did not bear any hope that this would play out. However, upon seeing the reaction of the three Ancient race consuls, he started laughing within his heart. Seemed like these guys know about him!</p><br/><p>What Lin Fan had not expected was for the entire Ancient race army to start clamoring about at the sound of this name.</p><br/><p>\"He's the Motherf*cking Human King, Lin Fan!\"</p><br/><p>\"That's the human who is extremely vicious and never shows any mercy to the Ancient race!\"</p><br/><p>\"We've captured some beings of the thousands of races out there. After tormenting and beating them up, they finally confessed up!\"</p><br/><p>\"The Despair City, the previous Sovereign King Wei, all of them were done in by this guy!\"</p><br/><p>...</p><br/><p>What Lin Fan did not know was that even though he would leave his name at every battlefield he went to, he would always kill all of them, so there was no one left to report about it. Therefore, it was entirely impossible to spread this title of his at all.</p><br/><p>However, there was once when these Ancient race beings had managed to capture some of the beings of the thousands of races. Suddenly, all of those beings of the thousands of races started shouting and exclaiming about some Motherf*cking Human King or something.</p><br/><p>After some intense beating up, they finally confessed and admitted every single one of the Motherf*cking Human King's crimes.</p><br/><p>The Ancient race beings then checked it out on the fugitive list. With that, they realized that this human's ranking was soaring up the charts rapidly.</p><br/><p>And this was none other than the Motherf*cking Human King, Lin Fan.</p><br/><p>\"That's right. Yours Truly here is the Motherf*cking Human King, Lin Fan! The Despair City was destroyed by Yours Truly! Sovereign King Wei was killed by Yours Truly! That 1,000,000 Ancient race soldiers at the Fire Water Secret Grounds? That's right, Yours Truly was the one who had them slain as well. I'm supposing that none of these are secrets for you guys of the Ancient race, eh?\" Lin Fan commented indifferently as though this was something really normal he was talking about right now.</p><br/><p>But of course, it was just in case these Ancient race beings did not know about it, Lin Fan was still careful to name out every single one of his achievements.</p><br/><p>At the start, the beings of the Succubus race did not have any idea who this man was. However, upon hearing those words, their faces turned into one of shock. To think that this man's battle achievements would be this shocking!</p><br/><p>To the beings of the thousands of races in the Ancient Saint World, this man was practically a hero!</p><br/><p>As for the Ancient race beings, he was the devil.</p><br/><p>The three consuls of the Ancient race exchanged glances with one another. Right now, there was a bubbling fear in their hearts. However, they did not know just how true this was.</p><br/><p>If this man before them had truly killed the previous Sovereign King Wei, they would definitely not be a match for him. However, as a being of the Ancient race, there was no such thing as fear in their lives. The only thing they had to do was to kill all the beings of the thousands of races.</p><br/><p>\"Motherf*cking Human King, Lin Fan, eh? Then, we've just got to see whether you've truly got these capabilities.\" The three Ancient race consuls roared out together.</p><br/><p>\"Whether or not I've got the capabilities is something that you guys will find out in a bit.\" Lin Fan let out a grin. Immediately after, he grabbed at the Ancient race army.</p><br/><p>This single grab was akin to grabbing out at the entire world. It was just a simple, casual arm. However, it expanded endlessly and covered the entire sky, holding these Ancient race beings in his hand.</p><br/><p>His powers were akin to that of a dragon. With immense energy contained within them, he closed his fingers and pinched, squeezing them into explosions immediately.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>One by one, these Ancient race beings ruptured out. Their meat and blood spewed all across the sky, converting into essence, spirit, and vitality that was all absorbed by Lin Fan.</p><br/><p>\"What a cruel human!\" Those ants of the Ancient race could only let out looks of fear as they caught sight of how this human had killed all those Ancient race beings with a single squeeze!</p><br/><p>Horrifying! This was way too horrifying!</p><br/><p>When dealing with these normal beings of the thousands of races, they should be doing it with absolute ease! But, why were they so helpless in the face of this terrifyingly strong Motherf*cking Human King? To think that he could snuff out a huge bunch of them in a single stomp!</p><br/><p>\"Consuls, save us!\"</p><br/><p>The Ancient race army started wailing out tragically. This Motherf*cking Human King seemed to be addicted right now. Each time he struck out, a huge bunch of Ancient race beings would die just like that!</p><br/><p>Lin Fan wasn't too bothered about the experience points these ant-like Ancient race beings gave. Instead, the essence, spirit and vitality they provided were essential for the Paradise. Even though the benefits they gave individually were minuscule, if they were to accumulate, it would be pretty significant as well.</p><br/><p>\"Motherf*cking Human King, stop that right now! You shall die for killing our Ancient race beings!\" The moment the consuls of the Ancient race caught sight of this, their faces turned terrible as they burst out at Lin Fan with a killing intent.</p><br/><p>All three of them were divine celestial level 6, Law state beings.</p><br/><p>Even though they looked strong on the surface, they were still nothing compared to Lin Fan.</p><br/><p>Honestly, Lin Fan couldn't even be bothered in the least bit. Perhaps he should just let them warm up a little before he went in for the kill.</p><br/><p>\"Watch out!\" Looking at how the three Ancient race consuls were charging at Lin Fan, the beings of the Succubus race could not help but warn outs.</p><br/><p>\"Go!\" Lin Fan tossed back his robes and ordered. These Ancient race consuls were just like fishes on a chopping block for him right now. Even if they wanted to run, they wouldn't be able to do so!</p><br/><p>Hearing him, the Thunder Trainer King and the big ancient demon charged up at these Ancient race consuls immediately.</p><br/>\n</div>"}