{"title": "Chapter 630: Don't Forget To Rob Even At The Brink Of Death!", "id": 630, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-630-dont-forget-to-rob-even-at-the-brink-of-death", "volume_title": "Volume 7", "body": "<h1>Chapter 630: Don't Forget To Rob Even At The Brink Of Death!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 630: Don't Forget To Rob Even At The Brink Of Death!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Today, sh*t is truly going to get real.\"</p><br/><p>Lin Fan's small little heart was thumping furiously right now. If it were anyone else, they would probably have been scared to death by now.</p><br/><p>Even if it were Lin Fan, he was now starting to shiver a little uncontrollably. Although, this was a shiver of anticipation. To be put bluntly, this was the sort of nervousness that one would get when one finally met a gigantic BOSS that was countless times stronger than oneself.</p><br/><p>The moment Lin Fan caught sight of how the Evil Alliance Prince was right now though, he was stumped.</p><br/><p>Wasn't the reaction of this guy somewhat exaggerated?</p><br/><p>\"Lord Utmost Being! Please spare me!\"</p><br/><p>Somehow, the Evil Alliance Prince was kneeling on the ground by now. Not only that, he wasn't even wearing a single piece of garment on his body, and was just kowtowing furiously without stopping.</p><br/><p>The continuous thudding sounds of the Evil Alliance Prince were causing the firm ground to seem as though it was about to tear apart somehow.</p><br/><p>By now, the entire head of the Evil Alliance Prince was filled with blood. Given his strength as a divine celestial level 7, All in One state being, even if he were to smash the ground of the entire Ancient Saint World to smithereens with his kowtows, it shouldn't even cause a single bit of harm to his body.</p><br/><p>However, there was no way he would dare to use his powers to protect his physical body right now. After all, this was the Utmost Being of the Ancient race that they were talking about.</p><br/><p>The Evil Alliance Prince was totally flabbergasted at this moment.</p><br/><p>He did not know what in the world was happening. Why would the Utmost Being of the Ancient race suddenly descend upon this place? He wouldn't even start to doubt that the monstrous momentum that was surging forth wasn't from the Utmost Being of the Ancient race.</p><br/><p>After all, he had caught sight of a pair of eyes that was looking down on the entire world from that surging momentum that was approaching. That was a might that could only be found from an Utmost Being of the Ancient race.</p><br/><p>\"LORD UTMOST BEING! PLEASE SPARE MY LIFE!\"</p><br/><p>\"PLEASE SPARE ME, PLEASE!\"</p><br/><p>The Evil Alliance Prince was someone who was really haughty and arrogant. However, at this moment, arrogance was going to serve him jacksh*t. As long as he could live, that was the real truth there was to it.</p><br/><p>All the beings of the thousands of races who were surrounding the light screen at this moment held their breaths in a still silence.</p><br/><p>For all these beings, this was the first time they were going to catch sight of the Utmost Being of the Ancient race. Even though the Utmost Being himself has yet to appear, that pair of eyes in the far distance was already enough to have their hearts thumping furiously.</p><br/><p>Some of the more cowardly beings of the thousands of races were already starting to tremble in fright.</p><br/><p>As for the Evil Alliance Prince who was kowtowing nonstop, they had long forgotten him to the back of their heads. After all, the only thing that they were concerned with right now was none other than the Utmost Being of the Ancient race.</p><br/><p>Somewhere in the depths of space and time, within a place that seemed like Hell…</p><br/><p>\"Palace Master, t-the prince has bumped into the Utmost Being of the Ancient race!\" At this moment, an underling who was wearing a pitch-black armour reported anxiously.</p><br/><p>\"WHAT?\" On that jewel throne sat a figure shrouded in a black mist. Even though his features couldn't be seen clearly, it was evident that he was entirely startled at the news.</p><br/><p>\"How in the world would my son bump into the Utmost Being of the Ancient race?\"</p><br/><p>At this moment, the figure leaped to his feet. However, he collapsed back onto his seat in helplessness.</p><br/><p>...</p><br/><p>Initially, that Upper Graded Dao Weapon of the Evil Alliance Prince floated gently in the sky. However, the moment the Weapon Spirit within sensed this remarkably formidable aura, it landed onto the ground immediately. Taking the form of a black-robed man, it started kowtowing on the ground furiously just like the Evil Alliance Prince was doing right now.</p><br/><p>\"What a formidable aura.\" Lin Fan stood there as his body shivered uncontrollably.</p><br/><p>It wasn't that he was afraid. It was just that this aura was way too repressing, pressing down onto him like a gigantic mountain, leaving him helpless to resist.</p><br/><p>\"Master, the Utmost Being is approaching. You've got to be careful.\" Xiguang was the most familiar with the Utmost Being. This was an aura that he had suffered under for 1,000 years. Each time he felt this aura, it was a form of torment for him.</p><br/><p>\"Master, let me out! Let Your Trainer King duel with him for a good 300 rounds and have him tamed under my electroconvulsive therapy treatment!\" The Thunder Trainer King yelled out excitedly.</p><br/><p>Seeing this excited look on the Thunder Trainer King's face, Lin Fan was exasperated as well. Who in the world gave him such tenacity?</p><br/><p>This guy was going so crazy over the thought of being able to train such that he hadn't even bothered to check out the strength of the other party, had he?</p><br/><p>Lin Fan looked at the distance with a fixated gaze. He was determined to verify the strength of the Utmost Being of the Ancient race.</p><br/><p>\"Motherf*cking Human King, Lin Fan? So, you're quite the new ant, eh? However, since you've killed several millions of my Ancient race beings, I'll have you die here today.\" Before the Utmost Being of the Ancient race had even arrived, his voice was brought over first.</p><br/><p>This voice was similar to thunder, booming out and causing the entire world to rattle under its might. In fact, as though the void couldn't even withstand this surge of power, they began to rupture out continuously.</p><br/><p>A single voice that could cause the void to tear apart, this sort of power was way too horrifying.</p><br/><p>Looking at this scene, Lin Fan could not help but acknowledge that he was far from this level just yet. The Utmost Being of the Ancient race wasn't worth his name for nothing.</p><br/><p>Even though this aura was pretty strong, shouldn't he just bloody hell and appear?</p><br/><p>If he were to come out and kill Yours Truly just like that, then Yours Truly would… fine, admit defeat.</p><br/><p>But now that such a long time had passed and he was still hiding, was he trying to put on an act of bullsh*t as well?</p><br/><p>'Forget it! He can come out as he wishes then. Yours Truly is done being an audience here.'</p><br/><p>At this moment, Lin Fan cast his gaze over at the Evil Alliance Prince and let out a grin momentarily.</p><br/><p>The Evil Alliance Prince was completely crumbled within his heart right now. The moment the Utmost Being of the Ancient race spoke up, he was even more panicked.</p><br/><p>Fear, a sense of fear that he had never ever experienced before finding its way into the mind of the Evil Alliance Prince.</p><br/><p>\"Evil Alliance Prince, how long more are you going to kowtow for?\" Lin Fan came before the face of the Evil Alliance Prince and smiled.</p><br/><p>\"Y-you! Don't talk to me now! Now that the U-utmost Being of the Ancient race is here, w-we're all going to die! D-don't stand beside me!\" At this moment, the Evil Alliance Prince had no mood to act brazenly and arrogantly. In fact, even his speech was starting to stammer.</p><br/><p>\"Y-you were the one who brought the L-lord Utmost Being here! D-don't drag me into this! P-please leave! I-I'm b-begging you! P-please leave!\"</p><br/><p>The Evil Alliance Prince had never imagined that the day would come when he would be dragged into trouble by a human. There was no one else at this place right now. Therefore, other than this guy, who else could the Motherf*cking Human King that the Utmost Being had mentioned be?</p><br/><p>Hatred!</p><br/><p>Why the hell must he have chosen such a timing to appear at this place? Couldn't he have just been a little bit later?</p><br/><p>If only he were that bit later, he wouldn't have bumped into the Lord Utmost Being like this!</p><br/><p>\"Eh? That ring of yours looks pretty decent, eh? How about you pass that over?\" Lin Fan took a look at the ten shining and sparkling storage rings on the hands of the Evil Alliance Prince. Right now, he wanted to get his hands on those.</p><br/><p>\"Y-you're a madman! You're insane! Here, you can have them all! All of them! I'll give you everything! Just hurry up and get lost, and don't stand beside me! This is an Utmost Being of the Ancient race we're talking about!\"</p><br/><p>The Evil Alliance Prince was completely stumped right now. Without any hesitation, he took down all of his storage rings and tossed them over to Lin Fan.</p><br/><p>That arrogant attitude on his face was long gone by now. Replacing it was a look of request. He was beseeching the other party to not stand beside him.</p><br/><p>If the Utmost Being of the Ancient race were to think that they were in cahoots, he would definitely be in for it.</p><br/><p>Lin Fan had not expected that the Utmost Being of the Ancient race would be this terrifying in the eyes of the beings of the thousands of races.</p><br/><p>Indeed, this was pretty unexpected.</p><br/><p>Lin Fan shrugged his shoulders and walked towards that Upper Graded Dao Weapon slowly.</p><br/><p>There was already a consciousness attached to that Upper Graded Dao Weapon. Therefore, it could cultivate on its own. Looking at how the human was making his way towards him, the Weapon Spirit was scared out of its wits as well.</p><br/><p>Lin Fan smiled indifferently. Taking advantage of the panicked manner of the Weapon Spirit, Lin Fan absorbed it into his Paradise entirely.</p><br/><p>Even though the Evil Alliance Prince was furious upon looking at this scene, he did not dare to take any actions at all as he continued with his kowtows. He could only hope that the Utmost Being of the Ancient race would take him as a fart and just let him off like that.</p><br/><p>However, the Evil Alliance Prince knew that even that had an extremely slim chance.</p><br/><p>As to running or what not, the thought had never even crossed the mind of the Evil Alliance Prince. Running before the Utmost Being of the Ancient race? Wouldn't he just die even faster that way?</p><br/><p>BOOM!</p><br/><p>Just at this moment, the explosion rang out. </p><br/><p>The void began to erupt repeatedly as a figure appeared in front of everyone in the blink of an eye.</p><br/><p>A berserk aura caged everyone within it.</p><br/><p>This was a supreme might right here!</p><br/>\n</div>"}