{"title": "Chapter 631: Instability Of The Succubus Race's Innate Skill", "id": 631, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-631-instability-of-the-succubus-races-innate-skill", "volume_title": "Volume 7", "body": "<h1>Chapter 631: Instability Of The Succubus Race's Innate Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 631: Instability Of The Succubus Race's Innate Skill</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The Utmost Being, Cruel, had descended. Bringing forth with him a boundless amount of might that rippled over, the entire world trembled under it.</p><br/><p>The Evil Alliance Prince could not even dare to raise his head at this moment. His eyes were filled with nothing but fear. All he could do was kowtow on the ground continuously, hoping that the Utmost Being, Cruel, would take him as just a fart and let him off.</p><br/><p>Even if he were to meet with someone stronger than him, the Evil Alliance Prince would have never shown fear as such. However, this Evil Alliance Prince who wasn't afraid of anyone in this world was afraid of the Utmost Being of the Ancient race.</p><br/><p>The Utmost Being of the Ancient race had never once batted an eyelid or wasted his time in killing someone. If he were going to kill someone, so be it. There was no need for bargaining.</p><br/><p>The worst was that even if the Evil Alliance Prince were to be killed right here, there was nothing that his father could do about it. After all, this was the Utmost Being of the Ancient race they were talking about.</p><br/><p>This was the supreme existence of the Ancient Saint World, the true master who controlled the lives of countless of living beings.</p><br/><p>All of those beings of the thousands of races who were surrounding the light screen at this moment were catching sight of the true body of the Utmost Being of the Ancient race for the first time in their lives.</p><br/><p>Each and every one of them were absolutely shocked out of their wits.</p><br/><p>Bzzzzzzz.</p><br/><p>\"Holy f*ck! What the f*ck is going on? Why is the image gone? Why the hell is this innate skill of the Succubus race so unstable?\"</p><br/><p>\"To think that the image would be cut off at this critical moment! Isn't this just akin to taking our lives?\"</p><br/><p>\"The Motherf*cking Human King has finally met with the Utmost Being of the Ancient race! What's going on right now?\"</p><br/><p>\"This is so cruel! Damn it! Why isn't the Mi race and the Samsung race around? If only those two races were around as well! With their innate skills, they would definitely be able to have this broadcast carry on!\"</p><br/><p>\"To think that the stream would hang up at such a critical moment! What a scam!\"</p><br/><p>At this moment, all of the beings of the thousands of races were entirely speechless. To think that the bloody light screen had disappeared at this moment! How exasperating was this?</p><br/><p>However, what they did not know was that the descent of the Utmost Being of the Ancient race with his tremendous aura had caused the entire void to be destroyed. With that, those bright light spots had naturally dissipated into dust, ceasing to exist entirely.</p><br/><p>However, in the hearts of the beings of the thousands of races, this was all the fault of the Succubus race. It was because their innate skill was unstable! They remembered that there would be disruptions along the broadcast of their own ceremonies in the past as well.</p><br/><p>Damn it! If their technology weren't stable yet, they shouldn't take it out and display to bring harm to the masses! This was especially the case at this moment.</p><br/><p>Lin Fan knew that what happened here was being made known to the beings of the thousands of races. However, with the disappearance of the light spots, he heaved a sigh of relief as well.</p><br/><p>Before the beings of the thousands of races, Lin Fan had to put on a suave, handsome, fearless, and graceful front. Even when faced with this Utmost Being of the Ancient race whom he didn't have a chance of winning against, he had to ensure that even his death would be magnificent and dashing.</p><br/><p>However, at this moment when the image was gone, Lin Fan felt a burden being lifted off his chest.</p><br/><p>No matter how despicable and dodgy he would turn later on, no one would be able to see it.</p><br/><p>This meant that he could finally let loose now.</p><br/><p>At that moment, Lin Fan looked into the distance.</p><br/><p>\"To think that the body of the Utmost Being of the Ancient race isn't really as tall and hulky as I had imagined. However, there's still a chilling feeling to it.\"</p><br/><p>Standing before Lin Fan, the Utmost Being of the Ancient race did not have a bulky stature. Perhaps, it would be more appropriate to say that he was podgy. That pitch black skin of his was coupled with two bones protruding from his shoulders that extended to the back of his body with an arc.</p><br/><p>Those frosty eyes of his were unusually creepy. A single look could send shivers down one's spines. Those sharp and gleaming teeth of his were akin to the mouth of a demon that was wide open.</p><br/><p>A doppelganger of the Utmost Being of the Ancient race's Essence Spirit, divine celestial level 10, Eternal God state.</p><br/><p>\"Holy f*ck! To think that this is only a doppelganger of that fella! Bloody hell! Why didn't he send his true self?\" Lin Fan was kind of speechless right now.</p><br/><p>To think that his doppelganger alone would be that of a divine celestial level 10, Eternal God state cultivation state! Just what kind of cultivation state did his true body have?</p><br/><p>Didn't this mean that even if Yours Truly were to become a divine celestial level 10, Eternal God state being, he still wouldn't have the capacity to provoke and go against the Utmost Beings of the Ancient race?</p><br/><p>\"Headache... This is troubling indeed.\"</p><br/><p>\"You're the Utmost Being of the Ancient race, Cruel?\" Lin Fan wasn't fearful in the least bit at all. Raising his head, he asked imposingly.</p><br/><p>The Utmost Being of the Ancient race, Cruel, did not reply. He just stood there, looking at Lin Fan silently. He then let out a slight grin on his face, revealing those sharp teeth of his at the same time. This was extremely scary.</p><br/><p>\"Smile your mother!\" The moment Lin Fan saw how this Utmost Being of the Ancient race was acting like a retard and just smiling instead of replying to his question, he couldn't keep it within himself any longer.</p><br/><p>Right now, Lin Fan was in a huff of anger. To think that this guy would just send a doppelganger of his Essence Spirit over! Bloody hell! Would it kill him to just send his true self along?</p><br/><p>'Did it matter if Yours Truly would get to know of your true cultivation state?'</p><br/><p>\"Hmm?\" The Utmost Being of the Ancient race, Cruel, changed his expression slightly. To think that an ant as such would dare to scold him. Immediately, he let out a really sinister grin.</p><br/><p>\"Hmm, what hmm? I'll have you know that I've already made all my utmost preparations together with my Evil Alliance Prince here to kill you right here! We'll use your head as a soccer ball and play around with it!\" Lin Fan disappeared from where he was standing. When he next appeared, he stood right beside the Evil Alliance Prince.</p><br/><p>\"N-NO! NO! THIS IS NOT THE CASE! LORD UTMOST BEING! I'M NOT WITH HIM!\" The moment the Evil Alliance Prince heard how this darned Lin Fan was dragging him down into the waters, he was stunned immediately.</p><br/><p>'Prepared your mother! I only passed by here by accident!'</p><br/><p>\"Evil Alliance Prince, against a trash as such, we have to fight him face to face! Let's go together!\" Lin Fan continued.</p><br/><p>\"G-GET LOST! GO AWAY! I DON'T WISH TO SEE YOU!\" At this moment, the Evil Alliance Prince felt like crying. To think that this person would be this shameless! Did he have to take revenge on him like this?</p><br/><p>\"What? You want me to leave so that you can face the Utmost Being of the Ancient race yourself? No, that's not right! How can I leave you to fight someone like this all alone?\" The moment Lin Fan heard those words, his face changed entirely as he turned to look at the Evil Alliance Prince with a solemn look on his face.</p><br/><p>\"Don't worry, I'll never leave you! Even if you ask me to leave, I'll never leave! After all, this was promised and said between us.\"</p><br/><p>\"I-I…!!!\" Noticing that the look on the face of the Utmost Being of the Ancient race getting frostier by the second, the Evil Alliance Prince could feel his guts almost exploding at this moment. He then hurriedly tried begging for mercy, \"L-lord Utmost Being of the Ancient race…\"</p><br/><p>\"CLEAN YOUR NECK AND PREPARE TO DIE!\" Lin Fan pushed down the sentence of the Evil Alliance Prince and interrupted through.</p><br/><p>\"NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!\" The moment he caught sight of this, the Evil Alliance Prince let out a heartwrenching scream. This wasn't the situation he had wanted to see!</p><br/><p>Just at this moment, Lin Fan struck out. Twisting with his palms, he slapped out a few thousand times. Each palm turned into a Doomsday Calamity God of its own as they slammed out towards the Utmost Being of the Ancient race.</p><br/><p>\"ROAR!!!!!!!!\"</p><br/><p>The Utmost Being of the Ancient race growled out in anger as that mighty soundwave filled the entire world. The soundwave transformed into a boundless beam of light that caused the Doomsday Calamity Gods to be disintegrated by it.</p><br/><p>To think that these Doomsday Calamity Gods that were trained to their peak by Lin Fan would be destroyed without a single bit of resistance, as though they were nothing but ants!</p><br/><p>\"Strong!\"</p><br/><p>Lin Fan's brows creased. Even though the doppelganger of the Utmost Being's Essence Spirit was only that of a divine celestial level 10, Eternal God state, it's powers were way too strong.</p><br/><p>His Doomsday Calamity Gods possessed a world-devastating power. Especially after the nourishment of the Paradise, they were now stronger than ever.</p><br/><p>To think that a single doppelganger of the Utmost Being's Essence Spirit could have them destroyed with just a single roar of his voice? This sort of power was absolutely heavenly defying.</p><br/><p>\"Utmost Being of the Ancient race…!\" The Evil Alliance Prince cried out in a panic. He wanted to live! How could he die right here?</p><br/><p>But instantly, a shroud of mist caged the Evil Alliance Prince together.</p><br/><p>Lin Fan did not hesitate at all. The Power of Biggra was emanated from his body immediately. Right now, he wanted to use the Evil Alliance Prince as a meat shield.</p><br/><p>By now, there were no longer any images. If he were to still wait for death right here, wouldn't he just be a moron?</p><br/><p>However, he knew that he wouldn't be able to escape the grasp of the Utmost Being of the Ancient race. After all, just his doppelganger of his Essence Spirit alone was this terrifying.</p><br/>\n</div>"}