{"title": "Chapter 644: The Indignance In The Heart Of Sovereign King Wei", "id": 644, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-644-the-indignance-in-the-heart-of-sovereign-king-wei", "volume_title": "Volume 7", "body": "<h1>Chapter 644: The Indignance In The Heart Of Sovereign King Wei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 644: The Indignance In The Heart Of Sovereign King Wei.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"The three Sovereign Kings are leading a 10,000,000 troop of Ancient race army to surround and attack the Battle Emperor Sect. Shall we head up and help?\" In a sect, an Elder was beseeching his Grandmaster.</p><br/><p>\"Elder Lie Yang. I know that you're on pretty good terms with one of the elders of the Battle Emperor Sect. However, you've got to understand that this is no casual situation right now. Three Sovereign Kings. Even if we were to send our entire sect over, there would only be a single outcome for us.\"</p><br/><p>The moment Elder Lie Yang heard these words, he was filled with pain in his heart. However, he did not wish to let the issue go just like that, \"Grandmaster, perhaps there might be other sects who are lending their assistance as well?\"</p><br/><p>\"Let this matter be. Please head back.\" The Grandmaster did not want to say anything more as he waved his hands and had the elder head back.</p><br/><p>With an issue as such, there were many major sects who had suffered losses before. In the past, there were some sects who could not stand this overbearing way of the Ancient race and had rendered their assistance as well. However, at the end of the day, they realized that there were few sects who would actually lend their help as well.</p><br/><p>Each and every one of them would choose to safeguard their own interests and watch the fire at bay.</p><br/><p>However, it wasn't long before a disciple came running in frantically.</p><br/><p>\"Grandmaster, this is bad. Elder Lie Yang has left the sect!\"</p><br/><p>\"Hais.\" The Grandmaster shook his head, evidently exasperated.</p><br/><p>This was something that was common in the Ancient Saint World now. Even if they were to lend their help, they would only be sending themselves to death's door.</p><br/><p>This was especially the case this time around when three Sovereign Kings were combining forces to deal with a single Battle Emperor Sect. Not only that, they had a 10,000,000 strong Ancient race army at their command. Who would be their match at all?</p><br/><p>Even though there were many beings of the thousands of races, compared to the Ancient race, it was still a world of a difference.</p><br/><p>That was a race that was blessed by the Heavens itself. It wasn't something they could go against that easily.</p><br/><p>The vicinity that the World Crossing Voice Transmission was sent out by the Battle Emperor Sect was way too small. Because of that, there were many sects that did not even know about what was happening right now.</p><br/><p>...</p><br/><p>Battle Emperor Sect…</p><br/><p>It existed within a derelict sculpture. This sculpture was on the brink of collapse and was filled with dust all over the surface. However, this sculpture was the very symbol that represented the Battle Emperor Sect.</p><br/><p>The Battle Emperor Sect resided within an alternate dimension within this sculpture.</p><br/><p>Thousands of years had passed. The progress of the Battle Emperor Sect was rapid as well. However, since the Ancient race was a formidable existence to everyone else, they too have chosen to remain hidden without revealing themselves at all.</p><br/><p>At this moment, outside the sculpture, the skies were a pitch, dense patch of darkness. Only a single look over was needed to see it all filled with Ancient race beings. This was a sight that would have any being of the thousands of races filled with fright, causing fear to stem from the very root of their souls.</p><br/><p>There were so many Ancient race beings. If they were to all strike out together, who in the Ancient Saint World could possibly hold out against them?</p><br/><p>Amidst this vast and boundless Ancient race army, three jewel thrones floated gently. There was an Ancient race being seated on each of those jewel thrones.</p><br/><p>\"The sculpture of the Battle Emperor Sect is pretty decent indeed. To think that it could have hidden them for such a long time. Well, we'll see where they can run this time around.\" The Sovereign King Qi's body was bulky, with chilly eyes. The moment he spoke up, a frosty aura emanated in all directions, as though the life and death of everything in this world were all under his control.</p><br/><p>\"The Lord Utmost Being has spoken. We must take this sculpture of the Battle Emperor Sect back with us. Sovereign King Wei, you've just been appointed not too long ago. Seems like this should be the first mission for you. Later on, you've got to make sure you perform well.\" Sovereign King Zheng chuckled at Sovereign King Wei, who was seated near him.</p><br/><p>However, there was a tone of contempt hidden within this chuckle.</p><br/><p>In the eyes of Sovereign King Qi and Zheng, this newly appointed Sovereign King Wei was nothing but a trash that was forcefully brought up by the Lord Utmost Being.</p><br/><p>This was an ant like Ancient race soldier who had obtained a present from the Lord Utmost Being, and thus this high position of his. But to them, this Sovereign King Wei was nothing but a pawn in the Lord Utmost Being's game of chess.</p><br/><p>King Sovereign King did not reply. It wasn't that he didn't want to, but with the Sovereign King Qi and Zheng beside him, he was feeling an immense pressure.</p><br/><p>He knew his own status. He was once a lowly soldier, without any power at all. It was just on the spur of the moment that the Lord Utmost Being had boosted his strength, allowing him to take on the seat of the Sovereign King Wei.</p><br/><p>However, the heart of the Sovereign King Wei was sinister unlike any others. He swore that he must climb all the way up and have every single other Ancient race being fear him.</p><br/><p>Since the Lord Utmost Being had laid down this mission now, they had to complete this no matter what.</p><br/><p>With that, the Sovereign King Wei stood up. Opening that pitch black wide palm of his, a massive surge of energy burst forth, causing the void to topple in endlessly. The sculpture of the Battle Emperor Sect began to tremble along with it as well.</p><br/><p>It was as though a strong suction force was trying to pull the Battle Emperor Sect out of its hiding place within the sculpture forcefully.</p><br/><p>At this moment within the Battle Emperor Sect, every member from top to bottom was filled with a look of anxiousness.</p><br/><p>\"Are there any other sects that are coming forth to help?\" An elder asked hurriedly.</p><br/><p>\"No.\" The elder who was stationed to receive those sects who were coming forth to render assistance shook his head helplessly. This time around, it was a disaster, a calamity. From this day forth, the Battle Emperor Sect might perish entirely from the ranks of the beings of the thousands of races.</p><br/><p>\"Forget it, forget it. This is the fated tribulation that was destined in our lives.\" The Grandmaster of the Battle Emperor Sect lamented.</p><br/><p>\"All of us are willing to live and die with the sect, standing up against all the Ancient race beings.\"</p><br/><p>Outside the Main Hall stood a grandiose legion of disciples. Standing there, they were upright and honorable in their dispositions. While they knew how horrifying it was outside, they knew that fear wouldn't do them any good either. The only way they could hope to make this out alive was to fight with everything they had for that sliver of hope.</p><br/><p>Looking at these disciples of his, the Grandmaster of the Battle Emperor Sect could not help but sigh in his heart. This would be a really bloody battle today.</p><br/><p>\"Grandmaster, Grandmaster Yun of the Cloud Sect has arrived!\"</p><br/><p>At this moment, a bright light shimmered in the skies. Dozens of figures appeared, floating in the void gently.</p><br/><p>\"Brother Wu He, the Cloud Sect is here to help.\" The moment Grandmaster Yun knew that the Battle Emperor Sect was surrounded by the Ancient race army, he gathered a few elders with him without any bit of hesitation. Breaking through the void, he headed forth immediately.</p><br/><p>\"Many thanks, Grandmaster Yun.\" Wu He looked over at Grandmaster Yun and cupped his fists together with a look of extreme gratitude in his face. With the arrival of Grandmaster Yun, Wu He felt a strand of hope rising in his heart.</p><br/><p>Grandmaster Yun was someone of a divine celestial level 8, Universal Elixir state. This was similar to that of Sovereign Kings Qi and Zheng. He would be able to hold out against one of them at least.</p><br/><p>This time around, Grandmaster Yun brought forth with him 10 elders for the fight. Meng Hengtian wasn't here. He was back in Cloud Sect, holding on the fort while the Grandmaster wasn't around.</p><br/><p>\"The beings of the thousands of races are a big family to begin with. If the Battle Emperor Sect is in trouble, how can the Cloud Sect not come forth? It's just that this time around, the force of the Ancient race is extremely formidable. This is not going to be simple.\" Grandmaster Yun remarked in the face of the truth.</p><br/><p>Suddenly, the entire Battle Emperor Sect began to rattle. There was a tremendous force pulling at them from the outsides.</p><br/><p>\"To think that Sovereign King Wei would have made his move already.\" The face of Grandmaster Yun sterned up. Slapping out with his fist, he repulsed this suction force entirely.</p><br/><p>Outside, Sovereign King Wei was startled to find out that a ferocious power was emanated out back at him. Suddenly, his spirit focused as he slapped out a few times, shattering that opposing force.</p><br/><p>\"Sovereign King Wei, seems like the Battle Emperor Sect has brought forth some strong reinforcements.\" Sovereign King Zheng burst out laughing. Ignoring Sovereign King Wei whose face was looking terrible right now, his fingers grabbed out with a claw like grip that snatched at every single living being.</p><br/><p>Within his body, a Universal Elixir erupted forth with a massive amount of strength.</p><br/><p>\"All of you, come on out!\"</p><br/><p>Under the might of this tremendous force, the Battle Emperor Sect was forcefully plucked out from within the sculpture.</p><br/><p>\"I'd say, I was thinking who it could be. Seems like it's Grandmaster Yun! So, the Cloud Sect is so certain that they're safe and secure that they've gotten the guts to come stand up against the Ancient race as such, eh?\" Sovereign King Zheng could see through the entire Battle Emperor Sect with a single sweeping glance. He jeered out sinisterly as he caught sight of a figure within it.</p><br/><p>\"Sovereign King Zheng, I trust you have been well since our last meeting?\" The moment Grandmaster Yun caught sight of Sovereign King Zheng, his face tightened up.</p><br/><p>In Grandmaster Yun's calculations, if they were to exchange blows right now, the odds of him winning against Sovereign King Zheng were 50/50.</p><br/>\n</div>"}