{"title": "Chapter 649: Calm Down, Calm Down", "id": 649, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-649-calm-down-calm-down", "volume_title": "Volume 7", "body": "<h1>Chapter 649: Calm Down, Calm Down</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 649: Calm Down, Calm Down</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>At this moment, Lin Fan nodded his head indifferently, showing a calm expression on his face.</p><br/><p>No matter what, these eight old fogeys were still divine celestial level 10, Eternal God state beings. Even though they were tortured for 10,000 years in the body of the Utmost Being, causing their powers to be far from their peak, their Eternal God cultivation state was still there.</p><br/><p>The skeletal camel still loomed greater than a horse. It shouldn't be an issue for them to f*ck these guys here to death.</p><br/><p>Lin Fan had actually taken a slight liking to them by now. After tossing them in his Paradise, other than having them cultivate Shengyang Pills day and night, he still gave them the chance to repair their cultivations.</p><br/><p>The Thunder Trainer King was a genius who was skilled in holding two jobs simultaneously: Training and Guidance.</p><br/><p>Not only had he made these guys follow his every whim and will obediently, he had even improved their innate potentials and nature. Therefore, even if one were a useless piece of trash, they could still have a chance to reach their peak status once again.</p><br/><p>At this moment, everyone turned their gazes to Lin Fan with a stoned expression. While the members of the Battle Emperor Sect did not know who the eight of them were, they could tell just from the aura alone that they definitely possessed an unusually strong strength to them.</p><br/><p>Grandmaster Yun's cultivation state was that of a divine celestial level 8, Universal Elixir state. Therefore, his perspective and knowledge on things were most definitely way higher than most other people. As such, he was the one who was most sensitive to pick up on how terrifying the eight of them were.</p><br/><p>\"T-they're at Eternal God cultivation state?\"</p><br/><p>Grandmaster Yun was stumped right now. He did not know how Lin Fan could have taken in such powerful beings under his wings.</p><br/><p>Back when the eight of them had their own freedoms, they were all vicious individuals. They killed wantonly and robbed others of their belongings after. There was no sin or crime they wouldn't commit. Naturally, they were hidden really well. Therefore, within the Ancient Saint World, there weren't many people who knew of their backgrounds and stuff like that.</p><br/><p>Later on, after they were subjugated by the Utmost Being, Cruel, they then disappeared from the Ancient Saint World without a trace, and had never appeared ever since.</p><br/><p>Even people who had once known them gradually forgot about them to the back of their heads.</p><br/><p>\"H-how could this be?!\" Looking at the eight peaceful beings before his eyes, Sovereign King Zheng could not help but feel fright right now.</p><br/><p>The aura emanating from the eight of them gave him a deep and incomprehensible feeling.</p><br/><p>The Fox Emperor and the Evil Alliance Palace Master exchanged glances with one another as a bubbling fear rose within their hearts.</p><br/><p>Even though Lin Fan and Grandmaster Yun were strong, both of them wasn't enough to have them feel fear in their hearts. However, these eight old fogeys out of nowhere possessed an aura one stronger than the other. Evidently, their powers were nothing to be scoffed at.</p><br/><p>If they could fight, they would. If they couldn't, they'd retreat.</p><br/><p>For devious people such as the Fox Emperor and the Evil Alliance Palace Master, this was the creed of life.</p><br/><p>This was the creed that had allowed them to enjoy a life of ease all the way till their peak.</p><br/><p>At this moment, both of them were considering escaping. These eight old fogeys were simply way too beguiling. They wouldn't engage in something they didn't have the confidence in.</p><br/><p>\"Seal up the Heaven and Earth! I don't suppose you guys are going to have any issues killing all of the Ancient race troops?\" Lin Fan asked.</p><br/><p>\"No problem, Master!\"</p><br/><p>Eight divine celestial level 10, Eternal God state powerful beings... If they couldn't even deal with these 10,000,000 ant-like beings, they would have lived their lives for nothing now.</p><br/><p>Ants would be ants at the end of the day. No matter how many of them there were, it would still just be a large number of ants. A truly powerful being could just use his aura to repress all of them and burst his way through.</p><br/><p>\"Grandmaster Yun, then these guys over here, hand them over to me.\" It had been a long time since Lin Fan had been in a true battle now.</p><br/><p>Sovereign Kings Qi, Zheng, the Fox Emperor, and Evil Alliance Palace Master, all of these were powerful beings of the previous generation. Lin Fan wanted to have a taste of his own powers right now.</p><br/><p>\"Lin Fan, you're going to fight them all alone?\" Grandmaster Yun asked, startled with some disbelief. The four of them weren't weak at all. Even if it were him, he wouldn't dare to guarantee that he may be able to get out of their hands alive.</p><br/><p>\"Heh. Have you forgotten about my physical body state?\" Lin Fan chuckled.</p><br/><p>\"Oh, that's true.\" Suddenly, Grandmaster Yun recalled this point.</p><br/><p>Lin Fan's physical body state was that of a divine celestial level 8, Universal Elixir state being right now. Whether or not these few fellas could even harm him was another issue.</p><br/><p>The Fox Emperor and the Evil Alliance Palace Master had already intended to escape. However, at this moment, they found out that the Heaven and Earth were sealed by these guys. There was no way for them to run even if they wanted to.</p><br/><p>Like ravenous wolves, the eight old fogeys darted into the midst of that Ancient race army.</p><br/><p>For these powerful beings of divine celestial level 10, Eternal God state, these Ancient race beings were nothing but weak chickens that they could kill with the back of their hands.</p><br/><p>\"The four of you, come on. Today, I shall have all of you slain.\" Lin Fan beckoned with his hands in a taunting manner.</p><br/><p>\"Motherf*cking Human King! You're courting death!\" The Sovereign King Zheng was riled right now. To think that the Motherf*cking Human King would still have this up his sleeves!</p><br/><p>\"Oh, we won't really know who the victor who emerges eventually will be yet, right? Mark my words. Even though the Ancient race is really strong right now, there will definitely come the day when you guys will finally face the descent of terror upon your faces.\" Lin Fan scorned coldly. He did not want to waste his breath any longer as he darted towards them straight away.</p><br/><p>\"Motherf*cking Human King, let us go now and we'll let this matter go!\" The Fox Emperor remarked.</p><br/><p>\"Dream on! Since you're here, do stay here then!\" Ripples were releasing forth from both of Lin Fan's hands as though they were combing through the Heavens and Earth. Ever since his Nirvana Finger had been strengthened, the tremors of the void possessed an even greater might than before.</p><br/><p>\"I, the Sovereign King Zheng, have reigned over the entire world with my might. Anyone who dares to provoke me as such would only have death awaiting them!\" Sovereign King Zheng knew that the other party wasn't some pushover. Therefore, he didn't dare to be overconfident. The powers within his body surged as a golden elixir inside let out rays of blinding light.</p><br/><p>\"Lin Fan, watch out now. That's the Universal God Beam.\" The moment Grandmaster Yun caught sight of this, he could not help but speak out as a reminder.</p><br/><p>Since Lin Fan had not reached the Universal Elixir cultivation state yet, he naturally did not know about the mythical purposes of that state. However, he had faith in his own cultivation state, which is why he wasn't afraid.</p><br/><p>In the blink of an eye, Lin Fan rained out with a few hundred punches. Every single punch was earthshattering, with a formidable might to them. Each punch transformed into a Doomsday Calamity God. These Doomsday Calamity Gods were extremely menacing, wielding a small little world that was destructive on its own in their palms, causing a boundless amount of Doomsday aura to erupt forth from it as they slammed it out at the Sovereign King Zheng.</p><br/><p>Doomsday Calamity God Fist was a skill that possessed an incredible amount of destructive force to it. Now that Lin Fan had trained it up to a certain degree, he had also infused multiple skills into it, using their strengths to mend its shortcomings. The moment it was deployed, it possessed a monstrous amount of ferocious power.</p><br/><p>The Universe God Beam pierced through everything like a series of sharp blades that slammed out at Lin Fan's body.</p><br/><p>Clang! Clang!</p><br/><p>\"What's this?\" Lin Fan patted his chest indifferently, not bothered about it in the least bit.</p><br/><p>\"To think that your physical body state is this strong! How can that be?\" Initially, when the Sovereign King Zheng saw how the Universe God Beam had landed squarely on the body of the other party, he was exhilarated. However, in the blink of an eye, he stood there watching everything with his jaws agape.</p><br/><p>To think that he could defend against the Universe God Beam with just his mere body alone! That was unimaginable!</p><br/><p>The higher one's cultivation state was, the harder it would be to train up on their physical body states.</p><br/><p>After one entered the divine celestial level 4, Undying state, their powers would be infused into every single fiber of their being. If they wanted to strengthen their physical body states, they would have to strengthen every single piece of meat there was.</p><br/><p>For any single race out there, this was an incredibly difficult feat to achieve.</p><br/><p>Even the Vajra and Giant races whose physical body states were the trademarks of their races would have to pay an incredible price for strengthening their body after attaining the divine celestial level 4, Undying state.</p><br/><p>But, how could a single human possess such a bloody strong physical body state?</p><br/><p>\"What are you looking for? Aren't you guys going to strike as well?\" Sovereign King Zheng bellowed.</p><br/><p>But, just at this moment, a series of tragic wails rang out from the Ancient race army above them. The moment Sovereign King Zheng raised his head up, his eyes widened as the blood in his body started boiling.</p><br/>\n</div>"}