{"title": "Chapter 655: I'll Take Them Away First. You Can F*ck Them Up Afterward", "id": 655, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-655-ill-take-them-away-first-you-can-fck-them-up-afterward", "volume_title": "Volume 7", "body": "<h1>Chapter 655: I'll Take Them Away First. You Can F*ck Them Up Afterward</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 655: I'll Take Them Away First. You Can F*ck Them Up Afterward</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Holy f*ck! Where did these new fellas spout out from yet again?\"</p><br/><p>Lin Fan was kind of exasperated right now. He was in the middle of a good walloping, and now two powerful beings decided to butt in yet again? Not only that, one of them was even using his hands to tear the seals! Didn't this mean that the powers of these two surpassed that of these eight old fogeys?</p><br/><p>Bam!</p><br/><p>Far across in the distance, red clouds were rumbling as the sky became the stage for a weird phenomenon. This momentum that was being brought forth was really intimidating. A single glance was enough to tell that these were no ordinary guys.</p><br/><p>\"HAHA! The Patriarch is here! Motherf*cking Human King, your death is here!\" The Evil Alliance Palace Master was exhilarated right now. At first, he had thought that he was going to die right here. To think that the Patriarch would arrive at this moment.</p><br/><p>In the eyes of the Evil Alliance Palace Master, the Patriarch was a peerless powerful being. In fact, even if he were to face up with the Utmost Being of the Ancient race, he would be able to remain calm at the very least.</p><br/><p>\"Old Master, save me! This Motherf*cking Human King is trying to kill me!\" Initially, the Fox Emperor was bawling his eyes out. However, he had begun to calm down now. His eyes shone with a gleeful look. To think that the Old Master would be here!</p><br/><p>But, he knew that he hadn't informed anyone of him coming here. Didn't this mean that the Old Master has always been tailing him all the time?</p><br/><p>The moment this thought popped into the mind of the Fox Emperor, he could not help but feel strange about it.</p><br/><p>Initially, the position of the Fox Emperor belonged to the Old Master. Later on, the Old Master stepped down from the seat in order to enter seclusion for his own training. The seat was then meant for the Fox Emperor's father. Unfortunately, his father was killed by an Ancient race being in a moment of carelessness. With that, the position then landed onto the current Fox Emperor, something he had been extremely elated about.</p><br/><p>However, the thought that every single action undertaken by him was being observed by the Old Master sent a feeling of discomfort all over him. He felt as though he was being voyeured upon.</p><br/><p>Then again, if the Old Master hadn't been checking on him on the sly, no one would have known what had happened if he had died here today.</p><br/><p>Therefore, in hindsight, this was pretty good as well. This proved that the Old Master was someone who cared about his grandson. At that moment, the Fox Emperor's heart felt as though it was cruising on a slow flowing river of happiness.</p><br/><p>The feeling of being cared for was simply way too good.</p><br/><p>...</p><br/><p>At this moment, Lin Fan wanted to scold out. Wasn't this some f*cking sham? These two bags of experience points in his hands were going to be taken away from him midway?</p><br/><p>And, by the looks of it, they wouldn't ever allow him to kill these two fellas!</p><br/><p>How much money was one's 'face' worth?!</p><br/><p>If Yours Truly were to give them some face, wouldn't Yours Truly have no 'face' to speak of then?</p><br/><p>\"Evil Alliance Patriarch… Old Master of the Fox race.\" Looking at the two figures who brought with them a boundless aura in the sky, Grandmaster Yun felt his heart tighten up as well.</p><br/><p>These were both powerful beings! Within the syndicate of the Evil Alliance, there were many powerful beings. Each of the ten Patriarchs were extremely strong, and ruled over a single area.</p><br/><p>As for the Old Master of the Fox race, he was a powerful being from the previous generation of the Fox race. He had been hidden from the world for a long time now. With that, his personal cultivation state would be so high that it would be almost limitless right now.</p><br/><p>Now that these two godlike figures were here, it'd naturally be impossible to kill off these men.</p><br/><p>\"Lin Fan, these two fellas are really strong. It'd be best not to trample on their wrong foot.\" Before Lin Fan knew it, Grandmaster Yun had appeared beside him and whispered.</p><br/><p>Lin Fan looked up into the void. Those two men who were filled with an overbearing aura had his small little heart and guts palpitating a little.</p><br/><p>\"Grandmaster Yun, if I were to compare these two fellas with the Utmost Being of the Ancient race, who is the stronger one?\" Lin Fan asked.</p><br/><p>Grandmaster Yun looked over at Lin Fan, wondering why he asked the question. However, he answered nevertheless.</p><br/><p>\"Of course, it'd be an Utmost Being of the Ancient race. Even though these two might be divine celestial level 10, Eternal God state beings, no one knows of the true cultivation state of the Utmost Being of the Ancient race, or even how high it can truly get.\"</p><br/><p>\"What if I were to compare them with the doppelganger of the Utmost Being of the Ancient race then? Who is the stronger one?\" Lin Fan asked again.</p><br/><p>\"Alright, I've got it.\" Lin Fan nodded his head. He was clear about the situation right now.</p><br/><p>\"Old Master, please seek vengeance for me! This man has killed your precious great granddaughter! My poor little daughter! To think that she was slain mercilessly by this Motherf*cking Human King! Oh, how my heart stings!\" Fox Emperor screamed out in anguish.</p><br/><p>\"Patriarch, please take revenge for me! My child has been slain by this Motherf*cking Human King! That poor son of mine! He died without knowing how and why! Oh, how my heart stings!\" The Evil Alliance Palace Master screamed out in equal anguish.</p><br/><p>'YOUR MOTHERS!' Lin Fan was indignant right now. These two fellas! Each one of them were better at acting pitiful than the other!</p><br/><p>Back when they were snatching the treasure, each one of them was more energetic than the other. To think that they would start to play out the emotional card right now!</p><br/><p>The Evil Alliance Patriarch and the Old Master of the Fox Emperor placed down their hands, indicating for these two to stay calm. Looking at Lin Fan, they continued, \"Motherf*cking Human King, let this matter rest as such. What do you say?\"</p><br/><p>Even though their voices were calm, it seemed as though they were talking about something that he should never disobey.</p><br/><p>They weren't bothered about this Motherf*cking Human King in the least bit. In fact, they had already made plans to kill him right at this place when they were making their way here. If not for the fact that someone had asked them for a favor to let him off, they wouldn't be doing this right now.</p><br/><p>\"These two fellas look pretty f*cking strong.\" Lin Fan's mind could not help but go astray at this moment. However, he was rattled when he turned his gaze over to the disciples of the Battle Emperor Sect, who were looking at him right now.</p><br/><p>What' was up with those expressions of theirs? Each and every one of them were looking at him with a gaze of expectation! It was as though he was the single unparalleled hero of the world that they were revering at this moment!</p><br/><p>\"Holy f*ck! This is a downright predicament! If I were to bow down in cowardice right now, I'd definitely lose all the face that I have!\" Lin Fan's heart was in extreme pain right now. This was the type of scene that he did not want to have to come across ever!</p><br/><p>It was tough being a hero, man!</p><br/><p>\"Motherf*cking Human King!\" At this moment, the tone of the Evil Alliance Patriarch and Old Master of the Fox Emperor turned harsher, evidently somewhat displeased.</p><br/><p>It was already enough respect that they were giving by allowing the conversation to drag on till now. If the other party still did not know what was good for him, they did not mind striking out.</p><br/><p>\"Evil Alliance Patriarch, Old Master of the Fox race… I am the Grandmaster of the Cloud Sect. This Motherf*cking Human Emperor here is a good friend of the sect…\" Grandmaster Yun could sense the situation getting tense. The worst of it all was that from Lin Fan's expression, he seemed to be hesitating about something!</p><br/><p>From his understanding of this guy back from three years ago, he knew that this lad wasn't someone to bow down that easily. If this were anyone else in this situation right now, there would be nothing to consider about. They would definitely give the other party some face!</p><br/><p>But with this lad here, things might truly not go that way.</p><br/><p>\"Little doll of the Cloud Sect, this has nothing to do with you.\" The Old Master of the Fox race spoke up coldly. He didn't give Grandmaster Yun the slightest bit of respect.</p><br/><p>The moment Grandmaster Yun heard these words, his face turned pretty terrible. Bloody hell! These two old fogeys were just taking advantage of their seniority! While Grandmaster Yun would acknowledge them as powerful beings from the previous generation, no matter what, HE was the Grandmaster of the Cloud Sect right now!</p><br/><p>However, be it then. He would just endure for now. Endure!</p><br/><p>\"Lin Fan, are you thinking about f*cking them up?\" Grandmaster Yun whispered stealthily.</p><br/><p>\"Yes.\" Lin Fan nodded his head.</p><br/><p>\"Good. Tell you what, I'll take everyone from the Battle Emperor Sect and have them leave with me first. You take care later on.\" Grandmaster Yun replied.</p><br/><p>\"Don't worry.\" Lin Fan refused to believe that he couldn't take these guys down. He was someone with eight divine celestial level 10, Eternal God state beings with him!</p><br/><p>\"Oh, right! That giant sculpture of the Battle Emperor Sect is a good thing! When you're going to make your escape later on, don't forget to take it with you!\" As though something had just struck him, Grandmaster Yun added on.</p><br/><p>\"Oh!\" Lin Fan's eyebrows jumped a little. He looked over at that stone sculpture standing idly and his eyebrows creased in joy. To think that there would be a treasure!</p><br/><p>After that, Grandmaster Yun began to retreat slowly. Without making any sudden movements, he brought the masses of the Battle Emperor Sect together with him into his Paradise.</p><br/><p>Even though the Evil Alliance Patriarch and the Old Master of the Fox race were strong, they wouldn't touch him. After all, he was the Grandmaster of the Cloud Sect. If they were to kill him, it would be akin to declaring war against the Cloud Sect.</p><br/><p>By then, every single Old Master that was in seclusion within their sect would come forth and hunt them down as well. And at that time, no matter how strong the Evil Alliance or the Fox race was, they would still have to consider their options.</p><br/><p>\"Evil Alliance Patriarch, Old Master of the Fox race, the Cloud Sect shall not stick our hands into this affair. We'll leave here now.\" Grandmaster Yun spoke up. Without waiting for the masses to reply, he left the place.</p><br/><p>\"Yes. A wise man recognizes his circumstances.\" The Old Master of the Fox race nodded his head in approval, evidently heartened.</p><br/><p>\"Do you release…!\" The Evil Alliance Patriarch raised his voice.</p><br/><p>…</p><br/>\n</div>"}