{"title": "Chapter 669: Oh, I'm Just So Kind And Compassionate", "id": 669, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-669-oh-im-just-so-kind-and-compassionate", "volume_title": "Volume 7", "body": "<h1>Chapter 669: Oh, I'm Just So Kind And Compassionate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 669: Oh, I'm Just So Kind And Compassionate</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan had not expected for the system to give him an actual Dragon Slayer Saber! That was pretty unexpected?</p><br/><p>'Dragon Slayer Saber: This is a gigantic saber, one that is filled with an insatiable bloodlust towards dragon's blood. Acts as a 100% deterrence against any race that is related with the Dragons.'</p><br/><p>'Eh, this seems not too bad. Acts as a 100% deterrence against the Dragon races? I wonder what that'll be like.' Lin Fan chuckled out in his heart, not really taking this Dragon Slayer Saber as anything important at all.</p><br/><p>After all, Lin Fan could not feel any form of power cruising through the body of this Dragon Slayer Saber, and neither could he see any laws of the treasure. Seemed like this should be some unique object.</p><br/><p>Lin Fan was in fact more exhilarated over the two skills that had popped out. One skill per person, and they just happened to pop out with what he needed as well!</p><br/><p>The Ancestor Dragon's Reincarnation was something that was really strong indeed. It was just a pity that Long Yushen and Long Tiangang had yet to master them to their peak. Hence, the amount of power that they could release from it was limited.</p><br/><p>As one of the ultimate moves of the Colossal Dragon race, the Heavenly Dragon's Music was an extremely high tiered soundwave attack.</p><br/><p>\"H-how could this be?\" The Tenth Prince was petrified right now. He could not believe everything that was happening before his eyes. To think that the human could have really killed Long Yushen and Long Tiangang!</p><br/><p>The stark naked Long Yumo was just sitting down on the ground crippled right now, completely stumped. He was finally beginning to realize just how scary this human before him was.</p><br/><p>Everyone from the Phoenix race were flabbergasted at this moment as well. Just like Long Yumo, the fact of this human's strength was beginning to sink into their heads at this moment. Thinking back at how they did not take this human to be anything much at the very beginning was causing them to feel shivers just recalling it.</p><br/><p>But, they had to be thankful that they did not show any sort of negative intent towards this human at all. Otherwise, they might be the ones dead right now.</p><br/><p>Regarding the state the Colossal Dragons were in right now, that was them reaping what they sowed. It was just a euphoric event for those from the Phoenix race.</p><br/><p>\"How now, Tenth Prince? Do you still have any more ultimate moves or whatnot? How about you send them out all together?\" Lin Fan walked towards the Tenth Prince.</p><br/><p>After slaying Long Yushen and Long Tiangang, Lin Fan did not have much interest towards this Tenth Prince. Compared to Long Yushen and Long Tiangang, the Tenth Prince's powers were way weaker.</p><br/><p>However, he was still the Tenth Prince of the Colossal Dragon race nevertheless! Lin Fan could make do with playing around with him for a bit.</p><br/><p>\"YOU!\" Looking at this horrifying human before him, the Tenth Prince's heart was thumping right now. \"If you dare to kill me, the Colossal Dragon race will never let you off!\"</p><br/><p>The Tenth Prince knew that he wasn't a match for this human before him. At the same time, he was filled with regrets in his heart. Why did he have to head here? If he hadn't come over, things wouldn't have turned out as such!</p><br/><p>He was already extremely pained over Long Yushen and Long Tiangang being slain. Those were Colossal Dragons who had cultivated the Ancestor Dragon's Reincarnation! If they were to master it to its peak status, they would be incomparably strong existences!</p><br/><p>From there on, who would dare to challenge his position and authority in the Colossal Dragon race?</p><br/><p>However, everything was gone right now. All of his hopes were extinguished.</p><br/><p>\"Colossal Dragon race, eh? Ho ho. Yours Truly here has never once placed the Colossal Dragon race as any form of a threat to me. If the Colossal Dragon race dared to come seek trouble with me, the outcome would be the exact same as the one I've displayed.\" Lin Fan replied nonchalantly.</p><br/><p>\"I'm a Prince of the Colossal Dragon race! If you kill me, you'll definitely come to a bad end!\" The Tenth Prince hollered out.</p><br/><p>At this moment, Long Yumo was holding the Bandana in his hands and was trying to sneak his way out of this. However, at the moment he was trying to make his escape, a Sword Will was brandished into the sky, piercing straight through him.</p><br/><p>\"DAMN IT! YOU'LL DEFINITELY HAVE A HORRIBLE DEATH!\" The Essence Spirit of Long Yumo howled out.</p><br/><p>\"Hmph! How dare you try to escape under my watch? Courting death.\" Lin Fan's fingers took on the shape of a claw and grabbed out. He then squeezed his fingers, turning Long Yumo's Essence Spirit into the shape of a ball and tossed it into his mouth.</p><br/><p>Looking at how cruel this human was, the Tenth Prince was frozen in shock.</p><br/><p>\"Hmph! Kneel down and speak to me.\" Lin Fan glared straight at the Tenth Prince.</p><br/><p>\"Human, don't you dare try to humiliate me! I am the Tenth Prince of the Colossal Dragon race! The dignity of the Colossal Dragon race isn't something that someone like you can trample on! Even if you were to kill me, I'll never kneel down before you!\" The Tenth Prince was afraid of death. However, he had the pride of a Colossal Dragon.</p><br/><p>Even if he were to die, he must never ever bow down to a human.</p><br/><p>Everyone from the Phoenix race understood where he was coming from as well. Within the Colossal Dragon race, all of them viewed their pride and dignity as something that was above anything else.</p><br/><p>Otherwise, there wouldn't be the saying about a dragon's reverse scale.</p><br/><p>As long as one were to touch the reverse skill, the dragons would definitely fight them to their deaths. In the case of the Colossal Dragon, this meant that one mustn't ever cross their bottom line.</p><br/><p>By the look of it, they could tell that the Tenth Prince was fearful right now. He must be utterly terrified about dying right now in his heart. However, if this human wanted the Tenth Prince to kneel down before him, that would be absolutely impossible.</p><br/><p>\"Oh, dignity, eh? Since that's the case, it's time for me to check out just what sort of a dignity you've got.\" Lin Fan's mind suddenly went to the Dragon Slayer Saber.</p><br/><p>He wondered how this Dragon Slayer Saber that was produced by the system would be like. What sort of a deterrent force would it provide to any dragon related race? This was something that had Lin Fan curious about.</p><br/><p>Clang!</p><br/><p>The Dragon Slayer Saber was specialized in slaying Colossal Dragons!</p><br/><p>When the Dragon Slayer Saber was brandished, a dragon howled out, causing a strange phenomenon to occur in the sky. At this moment, the Tenth Prince's expression changed immediately as well.</p><br/><p>He could sense some sort of a forbidden aura repressing down onto him.</p><br/><p>\"What's that saber?\"</p><br/><p>\"I've got no idea! I can't sense any innate powers within it at all!\"</p><br/><p>The members of the Phoenix race looked over at the Dragon Slayer Saber resting on Lin Fan's shoulders curiously. They did not know what that was either.</p><br/><p>The reason why the members of the Phoenix race could not feel that oppressive aura resonating out of the Dragon Slayer Saber was because they weren't from the Colossal Dragon race. However, it was a different story for the Tenth Prince.</p><br/><p>In the eyes of the Tenth Prince, something about this human had changed all of a sudden. In the blink of an eye, he was shrouded with a thick Dragon Slaying Intent!</p><br/><p>An image appeared in the mind of the Tenth Prince.</p><br/><p>Within his mind appeared a bulky, bald man, with an unparalleled and supreme might. He walked around nude, with a gigantic saber hanging on his shoulders. The saber was filled with bloodstains. It was all blood from the Colossal Dragons.</p><br/><p>And behind that bulky, bald man were headless bodies of Colossal Dragons, all slaughtered by him.</p><br/><p>The Dragon God, the Dragon Emperor, the Dragon King…!</p><br/><p>Countless extremely strong Colossal Dragons… All of them were turned into vengeful spirits under the might of this single saber!</p><br/><p>\"Eh, something's changing! Something's happening!' Lin Fan looked at the expression of the Tenth Prince. It was turning frightful at this moment.</p><br/><p>\"AHHHHHHHHHHHHHHHHHHHHH!!!\"</p><br/><p>Suddenly, a tragic wail rang out.</p><br/><p>With a thud, the Tenth Prince collapsed to the ground. He hugged Lin Fan's thighs and bawled out in tears.</p><br/><p>\"DON'T CHOP MY HEAD, PLEASE! NO! I'M JUST A WEAK LITTLE COLOSSAL DRAGON! I'M A VERY WELL BEHAVED BOY! I'M JUST A CHILD! DRAGON SLAYER WARRIOR, PLEASE LET GO OF THIS PUNY, FRAGILE, COLOSSAL DRAGON, PLEASE! I'LL DO ANYTHING YOU WANT ME TO!\"</p><br/><p>…</p><br/><p>Suddenly, the world went quiet. The members of the Phoenix race looked at this scene with their jaws agape. They had suddenly realized that everything had changed.</p><br/><p>That firm and determined Tenth Prince from earlier on… Why had things changed as such all of a sudden?</p><br/><p>Where has the dignity of the Colossal Dragon race gone to? To think that he would be so fearful of death right now!</p><br/><p>\"Holy f*ck! T-this…!\" Lin Fan did not know what was going on. Didn't he have a change of heart way too quickly?</p><br/><p>Wasn't this Dragon Slayer Saber way too bloody strong?</p><br/><p>Looking at how the Tenth Prince was in a bout of snot and tears, Lin Fan's heart softened. Was he to kill or not now that things were like this?</p><br/><p>\"Hais! Forget it. No matter what, he's just a child. Forget it! I'll just keep him in my Paradise then. Deploying Twisting Heaven and Earth on him, I'll just turn him into a Yin Yang Dragon and have him cultivate the Ancestor Dragon's Reincarnation then.\"</p><br/><p>\"Hais! Seems like this soft side of me hasn't changed a bit at all. I wonder if this personality of mine will work to my disadvantage in the Ancient Saint World in the future.\" Lin Fan was helpless. However, there was nothing he could do. It wasn't his fault that he was such a kind and compassionate person.</p><br/>\n</div>"}