{"title": "Chapter 665: Ten Princes", "id": 665, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-665-ten-princes", "volume_title": "Volume 7", "body": "<h1>Chapter 665: Ten Princes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 665: Ten Princes.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What in the world is this thing?\" Looking at the triangular black cloth in his hand, Lin Fan was puzzled.</p><br/><p>'Ding…Congratulations on discovering unique treasure: Bandana.'</p><br/><p>'Bandana: Keep it close to your body and you can hide your aura.'</p><br/><p>The moment Lin Fan heard the notifications of the system, he was exasperated. Boring… Bloody boring!</p><br/><p>At the start, he had thought that this was some sort of a fabulous item. To think that it was nothing but trash.</p><br/><p>\"Return that to me…! Give it back!\" The moment Long Yumo saw how this precious treasure of his was taken away by this human, his eyes reddened. That extremely ugly looking Bandana was, in fact, his most cherished possession! The only reason why he could accumulate these many treasures with him was largely attributed to the existence of that Bandana!</p><br/><p>By hiding his aura, no one could discover his whereabouts.</p><br/><p>At times when he entered secret grounds looking for treasures, he could even sneak in some stealth attacks and steal some treasures. It was all thanks to this Bandana!</p><br/><p>If this human were to take his Bandana away, it would be beyond difficult for him to amass the same amount of treasures in the future!</p><br/><p>\"You want something as trash as this?!\" Lin Fan asked with absolute contempt.</p><br/><p>If this sh*t were dumped onto the roads, he wouldn't even pick it up if he had passed by it. To think that this Long Yumo would consider it as such a treasure.</p><br/><p>However, the reason why he did not discover Long Yumo appearing by his side at the very beginning was all thanks to this treasure as well.</p><br/><p>\"Motherf*cking Human King, please! I'm begging you! Since it's a piece of trash, please return it to me!\" Long Yumo was close to tears right now.</p><br/><p>In order to keep this treasure safe, Long Yumo had intentionally treated it as a piece of underwear and had worn it at his crotch area. All of that was because he was afraid someone might take it away from him. But, he had not expected this human to be this perverted!</p><br/><p>Not only had he snatched away all his storage rings, he had even stripped him naked cleanly, exposing the existence of the Bandana entirely!</p><br/><p>\"Nopes! There hasn't been an instance when I've returned something I've gotten. Now, how about this. Perhaps, you can use something else in exchange to redeem this.\" Lin Fan said.</p><br/><p>Long Yumo looked at Lin Fan. For a moment, he was at a loss for actions. However, he was really anxious in his heart right now. This was his most prized possession! How could he bear to let it go just like that?</p><br/><p>\"All my treasures have been taken away by you! I've truly got nothing left!\" Long Yumo wanted to cry out so bloody badly. 'Oh, Heavens! Oh, Earth! Please open up your eyes and serve justice by smiting this beast to death!' Long Yumo screamed out in his heart. However, there was nothing he could do about it at all.</p><br/><p>\"Then forget it. Since there's no treasure, how can I exchange it with you? Even though it's nothing but a piece of trash, I think I had better keep it by my side.\" Lin Fan replied as though he was really helpless about the situation.</p><br/><p>\"N-no…! NO!!!\" Long Yumo bawled out. He truly did not wish to lose this item just like that! If it were truly gone, he would definitely cry to his death!</p><br/><p>\"Hais! But, you've GOT to have something to exchange with me for it, right?\" Lin Fan continued.</p><br/><p>Long Yumo was utterly helpless right now. He had already sent out his consciousness seeking assistance. Why hadn't anyone else arrived? It couldn't be that those beings of his same race had already given up on coveting on his treasures, right?</p><br/><p>\"How am I supposed to trust you?\" Long Yumo screamed out in pain.</p><br/><p>However, at the thought of the Bandana, Long Yumo had no choice but to give up another treasure of his.</p><br/><p>The moment Lin Fan heard these words of Long Yumo, he was taken aback for a moment. To think that this fella would still be hiding a treasure! Right now, he was stark naked any everything about him from head to toe was visible! Where else could he be hiding anything?</p><br/><p>\"Alright! I, the Motherf*cking Human King, Lin Fan, swear to God that if you hand me over a treasure for exchange and I still do not return you this Bandana, I'll definitely be struck down by lightning and die without a burial ground to my name.\" Lin Fan replied.</p><br/><p>\"Alright, I'll trust you!\" Even though the wrath of Long Yumo was surging into the skies right now, what other choice did he have?</p><br/><p>If not for the fact that this human was in possession of such a despicable heart striking treasure, he would have long killed this Motherf*cking Human King with a single claw swipe of his.</p><br/><p>\"Out…!\"</p><br/><p>At this moment, Long Yumo whispered out gently. Instantly, a small little rod flew out of his ear and began changing rapidly.</p><br/><p>\"This is a treasure that I found in a world somewhere. It's an object that could hold up the Heavens and can shrink or grow its size! It's a good treasure!\" Long Yumo explained with his heart throbbing.</p><br/><p>This was a treasure he had come across unintentionally. Even though it wasn't all that great in strength, its ability to shrink and grow in size was extremely powerful. Even the Ancient race wouldn't be able to craft out a treasure as such.</p><br/><p>The moment Lin Fan caught sight of that rod coming out from the ear of Long Yumo, he was stunned.</p><br/><p>By the looks of it. Wasn't this just the Ocean Pacifying Needle?</p><br/><p>However, when Lin Fan touched the rod with his hands, the system analyzed it cleanly.</p><br/><p>'Heavenly Supporting Pillar: An object used to support the heavens by the Heaven Supporting race. Can shrink and grow. Pretty useless.'</p><br/><p>Lin Fan sighed in exasperation. Seems like he had been overthinking it. This wasn't the Ocean Pacifying Needle.</p><br/><p>\"This doesn't seem like it has much use to it.\" Lin Fan replied.</p><br/><p>Long Yumo started panicking, \"I truly don't have any treasures left! All of my treasures are with you by now!\"</p><br/><p>\"Alright then. Then I'll keep this.\" Lin Fan said.</p><br/><p>\"Alright! Based on the agreement, you'll return me my Bandana!\" Long Yumo carried on impatiently. As long as he could redeem the Bandana, it didn't matter what he had to lose in the process. It would all be worth it.</p><br/><p>\"Here.\" Lin Fan tossed the Bandana over.</p><br/><p>\"Actually, I don't know just how smart you really are. Why in the world are you just so bent on getting this Bandana?\" Lin Fan was pretty exasperated.</p><br/><p>The moment Long Yumo heard this, he was stumped. He did not really get what Lin Fan meant by those words.</p><br/><p>\"Now, your life is in my hands. Even if I return this Bandana to you right now and chop you up, that Bandana still belongs to me after. That's what I call a good bargain.\" Lin Fan chuckled out.</p><br/><p>\"What? You're going back on your words?\" The moment Long Yumo heard this, his face changed.</p><br/><p>\"What do you mean going back on my words? From the very beginning, I've never said anything about letting you off.\" Lin Fan replied indifferently.</p><br/><p>\"YOU…!\" Long Yumo glared at Lin Fan with an angered look. To think that this human would be this abominable! He was simply way too cheap!</p><br/><p>The moment the members of the Phoenix race caught sight of this scene, they could not help but laugh out as well. This expression of Long Yumo which was both infuriated and helpless at the same time... this was something that brought joy to their hearts.</p><br/><p>As for those two chicks, their heads were lowered down, unable to bear watching this sort of indecency.</p><br/><p>Furthermore, Long Yumo wasn't some fabulously handsome man or anything. The sight his bare body was pretty revolting in that sense.</p><br/><p>However, the members of the Phoenix race knew that they would do well to present themselves appropriately, so that they could have a fair handling of this affair and get out with their lives intact.</p><br/><p>BOOM!</p><br/><p>Suddenly, a series of dragon roars rang through the skies.</p><br/><p>The edge of the skies shone with illusory figures of dragons. These Colossal Dragons seemed really imposing as they coiled for hundreds of thousands of feet with their bodies. Their might was domineering and boundless.</p><br/><p>\"HAHA! YOUR DEATH IS HERE! MY FELLOW RACE MEMBERS ARE HERE! YOU'RE DEAD FOR SURE NOW!\"</p><br/><p>At this moment, Long Yumo screamed out at the top of his lungs.</p><br/><p>\"Everyone, watch out! This fella here has a treasure that can strike at your hearts directly! Shut your auditory senses and do not fall for his tricks!\"</p><br/><p>\"Long Yumo, to think that you would report on your own location. Could it be that you've met with some sort of trouble?\" Within the void from those howling Colossal Dragon images came a booming voice. It caused the entire void to tremble with it as well.</p><br/><p>\"Heart striking treasure?\"</p><br/><p>PSHEW!</p><br/><p>Suddenly, the largest Colossal Dragon amongst them opened his mouth. With that, a shrill sound shot out from it. Lin Fan frowned. Under the might of this sound, his tape recorder was jammed on its tune!</p><br/><p>\"This is the Heavenly Dragon's Music from the Colossal Dragon race! It's an extremely strong skill that specializes in soundwaves. It can destroy any treasure which attacks one's spirits, and it's a secret skill that's only passed on within the Colossal Dragon race itself, a skill that only we of the Colossal Dragon can learn!\"</p><br/><p>The moment the members of the Pheonix race heard this sound, their faces changed. However, for Long Yumo, this sound was ever so invigorating for him.</p><br/><p>\"Tenth Prince, save me! Please save me…!\"</p><br/>\n</div>"}