{"title": "Chapter 677: T-This Monk's Trying To Play Dirty!", "id": 677, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-677-t-this-monks-trying-to-play-dirty", "volume_title": "Volume 7", "body": "<h1>Chapter 677: T-This Monk's Trying To Play Dirty!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 677: T-This Monk's Trying To Play Dirty!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>In this place where everything was covered in trees even up to hundred miles out, Lin Fan truly did not know how many Tree Demons could be hidden within. However, there was no need for him to go hunt for them.</p><br/><p>With a single glance over, his sight was filled with the introductions of the system.</p><br/><p>'Tree Demon: Desolate celestial upper level cultivation state.'</p><br/><p>'Tree Demon: Azure celestial lower level cultivation state.'</p><br/><p>…</p><br/><p>As such, Lin Fan did not want to continue looking at them any longer. Even if they were hidden far from sight in the depths, the system would reveal them as they got under its scrutiny.</p><br/><p>In fact, Lin Fan could even say that life was meaningless with the system at times. It completely removed the sense of excitement that he could have if he had to walk through this alone.</p><br/><p>Since these Tree Demons did not appear to annoy him by themselves, he was sure that they must be preparing to sneak in attacks on him while he was caught unaware.</p><br/><p>Unfortunately, under the observation of the system, any form of demon or ghost couldn't even find a hiding place at all. There was no need to even talk about any sneak attacks.</p><br/><p>The sky was getting darker. Lin Fan was making preparations to rest, and at the same time, check out the other sorts of nonsense that this place could hold.</p><br/><p>The previous four secret grounds earlier on did not give him the same creeps as this place. This place was way stranger than all of them.</p><br/><p>And most importantly, it was that skeleton of the Divine celestial level 7, All in One state powerful being up ahead that was causing him to feel a little nervous. After all, if one were to reach that cultivation state, it wouldn't be too easy to take down someone like that.</p><br/><p>'Forget it. Now's not the time to think so much about it. I'll just go make a fire and check if there are any Ancient beasts around for some barbequed meat.' Lin Fan stood up and walked in.</p><br/><p>At this moment, countless Tree Demons shapeshifted into gigantic trees as they looked at Lin Fan motionlessly.</p><br/><p>\"That living being's here!\"</p><br/><p>\"The Tree Emperor has ordered us not to strike at him.\"</p><br/><p>\"Let's see just what this living being is up to.\"</p><br/><p>\"That living being is standing right before my face! What should I do?!\"</p><br/><p>At this moment, Lin Fan was standing under a gigantic tree. Looking at those flourishing leaves, he could not help but rub his chin, \"Not bad, not bad! Time to chop it up for some firewood. That'll be pretty decent.\"</p><br/><p>\"Ah! This damned living being! He wants to chop off my branches! I'm going to swallow him up!\" The Tree Demon whom Lin Fan had taken a liking to yelped out in anger.</p><br/><p>\"Bear with it! The Tree Emperor has already said so! We've got to endure!\"</p><br/><p>The Tree Demons were communicating with one another telepathically. The Tree Demon whom Lin Fan had taken a liking to could not even cry out if he wanted to right now. Eventually, he grit his teeth and muttered, \"I'll endure…!\"</p><br/><p>\"This tree branch isn't all that bad. Ready for chopping!\" Lin Fan chuckled casually as his axe landed down smoothly. With that, the tree branch dropped at his feet.</p><br/><p>\"AH! That hurts! This living being is causing me immense pain!\" The unlucky Tree Demon cried out.</p><br/><p>\"Brother, hang in there! You've got to stay strong!\"</p><br/><p>\"That's right! This living being here is extremely strong! We've got to wait till he gets injured in the secret grounds before we seize the opportunity to eat him up!\"</p><br/><p>\"Alright, I'll endure! For all of our futures, I'll do it!\"</p><br/><p>…</p><br/><p>Time passed by the seconds and the minutes.</p><br/><p>Each time Lin Fan chopped down a single tree branch, the Tree Demon would yell out once as well. All of the surrounding Tree Demons could only give him mental support and console him to hang in there.</p><br/><p>\"Brothers! Stop rooting for me. I'm already numb to it all!\" This unlucky Tree Demon was about to break down right now. It was being tormented so badly by the pain that it was losing its sense of feeling.</p><br/><p>\"Almost there.\" Looking at the scene before him, Lin Fan nodded his head indifferently. He then bent down and collected all the tree branches in his chest, hugging them and leaving this place.</p><br/><p>\"Brother, you've done it! It's over!\" The surrounding Tree Demons started praising him.</p><br/><p>\"Boohoo…!\"</p><br/><p>That unlucky Tree Demon could only feel like weeping at the sight of his bare naked body now. He was flourishing with luscious leaves all over. But right now, he was almost bald.</p><br/><p>…</p><br/><p>Sizzle. Sizzle.</p><br/><p>The fire crackled as an Ancient beast was hung to be roasted over it.</p><br/><p>It was quite the task searching for Ancient beasts in this area. After a long time, Lin Fan had finally managed to obtain just one. Seemed like these Tree Demons here were pretty imposing, devouring all the Ancient beasts in the vicinity.</p><br/><p>\"Benefactor, this poor monk has finally found you!\"</p><br/><p>Just at this moment, a bright flash of Buddha light descended from the skies. This was a voice that Lin Fan was hoping never to hear again in this lifetime.</p><br/><p>\"Holy f*ck! To think that he could still bloody find me here!\"</p><br/><p>Just as Lin Fan was ready for his scrumptious meal, this voice found its way into his ears.</p><br/><p>\"Bald monk, how in the bloody world did you manage to find me?\" Lin Fan was speechless right now. To think that he would be found even after hiding in such a deep place here. Goodness Christ! F*ck his life!</p><br/><p>\"Benefactor, you've truly brought troubles onto me. If not for the fact that I've heard some rumbling sounds in this area, I wouldn't have known that you were here!\" Reverend Shakya looked like he was worn out after traveling for a long distance. With those two gigantic lumps of meat at his chest, there was no way he could maintain that esteemed image of himself from earlier on.</p><br/><p>'Rumbling sounds?'</p><br/><p>At the thought of this, Lin Fan wished that he could give himself two hard knocks on the head right now. It must be that the disturbances caused when he was slaying those Tree Demons earlier on had alerted this bald monk to this place. To think that this bald monk would be so sharp to check out the entire area.</p><br/><p>If he had known that this would be the case, he would have entered the secret grounds straight up!</p><br/><p>\"What are you here for? Don't be a sore loser now! I've told you from the start that you're responsible for the consequences!\" Lin Fan started.</p><br/><p>How could he not know the reason behind this bald monk hunting him down like this?</p><br/><p>But the most important thing was that he did not know how to remove the effects of Black Tiger Steals Heart himself!</p><br/><p>\"Benefactor, with that said, this is a really terrible state that you've left me in! How is this poor monk supposed to show his face in public in the future?\" Reverend Shakya was on the brink of tears right now.</p><br/><p>The pain from earlier on could be forgotten about. However, the main point was that his chest was in such a condition right now! How should he face the masses in the future and enjoy that life of bullsh*tting?</p><br/><p>\"That's none of my business! Before I struck out, I had said everything really clearly! Do you admit to that?\" Lin Fan asked.</p><br/><p>\"Yes, I admit to it. However, benefactor, you shouldn't have walloped my chest to such a state either!\" Reverend Shakya could not even bring himself to cry out right now.</p><br/><p>\"How was I to know that things would turn out as such? It might be because your chest is way too sensitive! This could be your second puberty!\" Lin Fan exclaimed.</p><br/><p>Reverend Shakya was about to cuss Lin Fan's mother in his heart right now. Second puberty his head! However, he still had to vent out, \"I don't care. No matter what, you've got to revert it to its original shape!\"</p><br/><p>\"I can't revert it at all. This skill is something that I've yet to master completely!\" Lin Fan replied.</p><br/><p>\"Then, what am I supposed to do? No, this poor monk doesn't care! If you don't revert it for me, I'll just follow you forever!\" Reverend Shakya could not help but wish he could chop Lin Fan to death right now.</p><br/><p>With these two gigantic buns on his chest, how was he supposed to continue in the Pugilistic World from now on? If anyone were to find out, wouldn't his image be entirely gone? That reputation of his that he had accumulated over a hundred years, wouldn't it be gone overnight just like that?</p><br/><p>\"Ah, bald monk! You're trying to play dirty now! You were clearly the one who said that you wanted to get walloped! And now that there's an issue, how could you be this unreasonable?\" Lin Fan was exasperated right now. This bald monk was playing too dirty!</p><br/><p>\"Benefactor, please find the mercy in your heart to save me! This poor monk's parents had died really early on! With that, I only had my heart for the well being of all the races! At this rate, even if I were to be killed by an Ancient race being someday, I'll have no dignity to even face my parents in the underworld with this body!\" Reverend Shakya's eyes were brimming with tears.</p><br/><p>If the Heavens could give him another chance, he swore to the Heavens that he would never have acted for that show of bullsh*t. After all, the price to pay was simply way too great.</p><br/><p>To think that he was prided as a genius esteemed monk of the Buddha race! If any of those old monks from the Buddha race were to find out about this, they might even kill him to save the reputation of the Buddha race!</p><br/><p>\"I truly can't revert it, man! But, I've got an idea. Though, that'll still depend on you at the end of the day.\" Lin Fan said in exasperation.</p><br/><p>\"I'm willing to do it! I'm willing…!\" Without even considering, Reverend Shakya agreed to it.</p><br/><p>\"Alright then. Bear with it now.\"</p><br/><p>\"What are you trying to do?\" Initially, Reverend Shakya was filled with glee in his heart. However, looking at Lin Fan raise his axe, he was stumped.</p><br/><p>\"I'm going to chop off these two gigantic buns of yours.\" Lin Fan replied with a serious expression.</p><br/><p>\"THE F*CK!\" Reverend Shakya's face changed, cursing out uncontrollably.</p><br/><p>\"Bald monk, did you just curse?\"</p><br/><p>\"Amitabha! I've sinned, I've sinned! But no, this poor monk doesn't care! Since this was whacked out by you, you shall take responsibility! Otherwise, this poor monk is going to follow you!\"</p><br/><p>\"Y-you…!\"</p><br/><p>Lin Fan was exasperated. This is a f*cking sin of its own!</p><br/>\n</div>"}