{"title": "Chapter 679: A Deep Bond Of Understanding", "id": 679, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-679-a-deep-bond-of-understanding", "volume_title": "Volume 7", "body": "<h1>Chapter 679: A Deep Bond Of Understanding</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 679: A Deep Bond Of Understanding</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan checked out the five people before him right now. On the other hand, the five of them weren't bothered about him in the slightest bit.</p><br/><p>Even that Mu Manfeng, whom Lin Fan had shown some regards for, only had his sight lingering on Lin Fan for a mere second before he couldn't care less anymore.</p><br/><p>\"Within this secret ground…\" Emperor Nan Gong wanted to explain the situation within the secret grounds right now. However, he was cut short by Yu Liutian by the side.</p><br/><p>Yu Liutian's expression changed as he indicated to the masses that there were two other people at the scene right now. In fact, there was already a killing intent rising in his heart as he indicated for the others not to make their moves.</p><br/><p>Mu Manfeng looked at the masses as his eyes shone with a tinge of disdain. He stepped forth and waved with his hand, \"Master here, your Buddhist nature seems strong. Could you be someone of the Buddha race?\"</p><br/><p>For someone like Mu Manfeng, even though Yu Liutian and the other three were pretty strong, he wasn't bothered by them in the least bit. However, the only unknowns lied with these two people right here. In fact, Mu Manfeng was piqued by Reverend Shakya, whose entire body was hidden under that long robe he was draping himself with.</p><br/><p>\"Benefactor, you can sense one's Buddhist nature too?\" Reverend Shakya, who had his entire head hidden beneath the long robes, was startled somewhat as he started to get interested in this person.</p><br/><p>One's Buddhist nature was imperceptible and fleeting. If it weren't someone from the Buddha race, it would be rare for others to tell of it.</p><br/><p>\"Incidentally, I managed to learn some skills of the Buddha race.\" Mu Manfeng chuckled out. Naturally, he would not admit that he had obtained the treasure of a powerful being of the Buddha race under a fortuitous encounter.</p><br/><p>When Reverend Shakya raised his head and looked at Mu Manfeng, he nodded in astonishment, \"To think that the skill of the Buddha race mastered by this benefactor would be this profound! That should be a skill under the lineage of the Great Sovereignty Buddha!\"</p><br/><p>As someone of the Buddha race, Reverend Shakya was well versed in the Buddhist texts. As for all of the different schools of the Buddha race, he knew them by heart.</p><br/><p>However, there was something that Reverend Shakya could not help but be puzzled over. The bloodline of the Great Sovereignty Buddha had fallen a long time ago! To think that someone would be able to cultivate a skill in that lineage!</p><br/><p>Mu Manfeng had not expected this monk before him to be so sharp in his perceptions. He had only given off a slight strain of the Buddhist nature within him, and yet this monk could pick up on it and predict his lineage of cultivated Buddhist skill! This was something he hadn't expected at all!</p><br/><p>\"I've yet to ask for the name of this Master.\" Mu Manfeng felt that this monk was far from normal.</p><br/><p>\"This poor monk is…\" Even though these guys were geniuses of their respective sects, Reverend Shakya knew that his name out there wasn't insignificant either. If he were to announce his name right now, it could possibly stir another round of commotion.</p><br/><p>However, just as Reverend Shakya was about to announce his name, Lin Fan stood up and walked in deeper.</p><br/><p>\"Oh no! Benefactor, where are you headed to? Wait up for this poor monk here!\" Looking at Lin Fan's departure, there was no way Reverend Shakya would dare to linger for any moment longer. He had only managed to find this guy after many difficulties. If he were to let him escape, how else could he find him once more?</p><br/><p>\"Inside the secret grounds.\"</p><br/><p>…</p><br/><p>\"Just what sort of a background did those two come from?\" Looking at how much attention Mu Manfeng was paying to that monk, the face of Emperor Nan Gong could not help but stern up as well.</p><br/><p>\"Hmph! It doesn't matter what's their background. If they hinder our way, we'll just send them up to the Heavens.\" Yu Liutian's tone was cold, and his gaze was even colder.</p><br/><p>\"It's better to be careful. That monk is far from simple.\" Mu Manfeng warned solemnly.</p><br/><p>His instincts would never be wrong. These were instincts that he had grown up with by killing all his way up to where he was right now.</p><br/><p>\"Hmph! Cowardly mice! To think that those two fellas would dare to enter the secret grounds first. That's just as well. We'll just have them scout the way first then. The secret grounds are extremely treacherous. Who knows if we're the only ones entering later on.\" Yu Liutian looked at Mu Manfeng with extreme contempt.</p><br/><p>\"Brother Yu, Brother Mu here is my friend and our teammate as well. I hope that you can mind your words.\" Emperor Nan Gong frowned.</p><br/><p>Did this Yu Liutian wake up on the wrong side of bed or something today? He was being way too unfriendly to someone he had brought over.</p><br/><p>\"Hmph!\" Yu Liutian snorted coldly.</p><br/><p>Xing Wangong and Jia Yongye were gloating secretly. They could not figure out the background of this Mu Manfeng. However, since Yu Liutian was taking the initiative to provoke him, they were hoping to make use of this and check out just what sort of capabilities this Mu Manfeng had.</p><br/><p>\"Yu Liutian, I'm tolerating you on account of Brother Nan Gong. Yet, you've provoked me time and again. Since that's the case, I'm going to go at it with you today. Let's see just what sort of capabilities you've got.\" Mu Manfeng was looking grim right now as a killing intent rose in his heart towards this Yu Liutian.</p><br/><p>\"Brother Mu!\" Emperor Nan Gong had not expected things to turn out as such. This was going to be awkward to pick up after.</p><br/><p>\"Emperor Nan Gong, I think you had better not stick your head into this affair. Since this is the case, let him have a go with Brother Yu then. We'll take the opportunity to check out if he's got what it takes to team up with us.\" Xing Wangong spoke up.</p><br/><p>\"That's right.\" Jia Yongye nodded in agreement.</p><br/><p>…</p><br/><p>\"Benefactor, why are you leaving all of a sudden?\" Reverend Shakya asked out helplessly.</p><br/><p>\"Why? Should I have stayed there to watch you act with all your flaunting?\" Lin Fan tossed him a sideglance. He could tell from a single look the type of sh*t this Reverend Shakya was trying to pull off.</p><br/><p>\"Benefactor! How could you say that of this poor monk?\" Reverend Shakya replied in a hurt tone. To think that he would actually meet with a benefactor who knew him this well! This was something Reverend Shakya hadn't expected.</p><br/><p>Just as the sayings went where talents would recognize it in others and great minds thought alike, Reverend Shakya understood that this Motherf*cking Human King before him was someone well versed in the Dao of flaunting and acting. This was a deep bond of understanding that both of them shared.</p><br/><p>\"Benefactor, there's something wrong with the aura of this secret ground. Furthermore, there are so many geniuses who had arrived at this place as well. I presume that the place must be fraught with dangers. How about retreating, shall we?\" Reverend Shakya commented in a worried tone.</p><br/><p>\"If you're afraid, you're welcome to leave first.\" Lin Fan replied indifferently.</p><br/><p>He had to get his hands on the connate Element of Wood no matter what the cost might be. However, he wondered if there could be something in addition to the connate Element of Wood in this place.</p><br/><p>For it to be able to attract so many powerful geniuses… Evidently, the connate Element of Wood wouldn't have that allure. If that were the case, then there must be some other precious treasure within this place.</p><br/><p>\"Benefactor, this poor monk here isn't afraid. As the saying goes, if I don't enter hell, who would…?\"</p><br/><p>\"Alright, alright! Cut the crap! If you want to follow me, you had better not let greed overwhelm you later on. Otherwise, don't blame me for messing you up!\" Lin Fan continued walking forth. However, he realized that the bald monk had stopped in his tracks. Elated for a moment, he wondered if the bald monk was getting afraid and had decided to leave now?</p><br/><p>\"Benefactor, you may humiliate me, but you shall not insult my integrity. How can a poor monk such as myself let mere things such as greed take over my heart?\" Reverend Shakya said with a righteous tone.</p><br/><p>Lin Fan shook his head helplessly. Bloody hell! There was really something wrong with this bald monk! Lin Fan will just have to see if he can scare this guy off later on.</p><br/><p>Just when Lin Fan passed by the forest, the Tree Demons began to discuss once more.</p><br/><p>\"What should we do now? There are more powerful beings who have arrived. Shall we devour them up as well?\"</p><br/><p>\"The great Tree Emperor has already spoken, devour your head! You better wisen up! Each and every one of these powerful beings here can easily kill all of us!\"</p><br/><p>\"Just what in the world is going on here? Usually, there is hardly any living being who would even enter this secret ground. Why are there so many powerful beings here now?\"</p><br/><p>\"Who knows? But, if Lady Luck is shining on us, we may even be able to pick up on some corpses for free!\"</p><br/><p>\"Oooooh! I love picking up corpses! That is something effortless! We can literally guard our tree stumps here and wait for the rabbits to come on their own!\"</p><br/><p>…</p><br/>\n</div>"}