{"title": "Chapter 695: Let's Make A Wager", "id": 695, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-695-lets-make-a-wager", "volume_title": "Volume 7", "body": "<h1>Chapter 695: Let's Make A Wager</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 695: Let's Make A Wager</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Little buddy there, your potential is unparalleled. The extent of your growth in a mere span of four years has been amazing. If I were to give you even more time, wouldn't you truly be something?\" Feng Qingzi came before Lin Fan with a smile.</p><br/><p>\"You know of me?\" Lin Fan was slightly taken aback. However, it became clear to him before long. Damn! Yours Truly was a flirtatious character. Wherever he went, he would naturally be the center of attraction. Therefore, it was understandable that this old man would know of him.</p><br/><p>\"A year ago, little buddy, you fought against the Essence Spirit of the Utmost Being of the Ancient race solo. This old fellow here is aware of that event.\" Feng Qingzi's sight did not leave Lin Fan in the slightest bit. It was as though he was trying his best to see through Lin Fan entirely, to see just what sort of capabilities this young lad here had that he could grow to such an extent in just four years.</p><br/><p>As for Reverend Shakya by the side, he had long been left in the dust by Feng Qingzi.</p><br/><p>\"Senior Feng Qingzi, this poor monk…\" Reverend Shakya wanted to make an introduction so that Senior Feng Qingzi would pay him some attention. However, just as Reverend Shakya had started with his sentence, he was interrupted by Feng Qingzi.</p><br/><p>\"Little monk of the Buddha race, this old fellow knows who you are.\" The moment Feng Qingzi was done with this sentence, he did not say anything any longer and continued staring at Lin Fan fixedly.</p><br/><p>\"Indeed, your caliber is unmatched. This old fellow here has seen many, many, many geniuses. However, there is none with a potential like yours.\" Feng Qingzi acknowledged.</p><br/><p>\"Se…nior…!\" Feeling like he was neglected, Reverend Shakya was feeling pretty dejected right now.</p><br/><p>This was especially the case when he caught sight of that gloating smile on Lin Fan's face. Reverend Shakya felt even more pained at that moment. This poor monk could be considered as a genius of the Buddha race as well! Why wouldn't he just take an extra look at him?</p><br/><p>\"Little buddy, what do you think about taking me as your master?\" Back when Lin Fan's name was skyrocketing up the fugitive list, he had already attracted Feng Qingzi's attention.</p><br/><p>On the fugitive list, it was unheard of for a living being to bolt up the list this quickly. There was no precedence to this at all.</p><br/><p>As such, Feng Qingzi took the liberty of exiting his seclusion in search of Lin Fan.</p><br/><p>And this one search took him a couple of years.</p><br/><p>In fact, there would even be times when Feng Qingzi would pay a visit to the jails of the Utmost Beings of the Ancient race to check them out. That was just in case a genius as such might be captured by an Utmost Being of the Ancient race.</p><br/><p>Later on, he caught wind of some news. With that, he started searching all the way and eventually found Lin Fan here.</p><br/><p>When he caught sight of how Lin Fan suppressed the Gleaming Blood Lord, Feng Qingzi was especially determined on taking this lad as his disciple.</p><br/><p>'This old man must be sick.' Looking at that penetrative look being given off by Feng Qingzi, Lin Fan could feel his spirits being rattled. There was a feeling of his anus being peeped at by someone.</p><br/><p>The moment Reverend Shakya heard that Senior Feng Qingzi was keen on taking Lin Fan as a disciple, he was extremely startled.</p><br/><p>Feng Qingzi was a great man, whose name was starkly known across the entire Ancient Saint World! There were countless geniuses who wanted to take him as their master, but none of them could catch his eye at all.</p><br/><p>To think that Feng Qingzi would take the initiative to step forth and even ask for Benefactor Lin to be his disciple? This was something that had Reverend Shakya envious to no ends.</p><br/><p>If only he could take Feng Qingzi as his master, he would have truly gone up in status to a whole new level by then!</p><br/><p>However, the moment Lin fan heard these words, he could only scoff in his heart.</p><br/><p>'Huehue…Take in Yours Truly as a disciple? This guy has got to be dreaming!'</p><br/><p>What sort of a person was Yours Truly? This was a God with a system to his name! Furthermore, he was the Grandmaster of Saint Devil Sect! If he were to take someone as his master, wouldn't he be below someone then?</p><br/><p>\"Benefactor Lin, what are you still hesitating about? Senior Feng Qingzi is a great man like no other! There have been countless geniuses who had wanted Senior Feng Qingzi as their master, but they were far from qualified!\" Looking at the hesitation on Lin Fan's actions, Reverend Shakya hurried instantly. He could not wish for more than for Senior Feng Qingzi to take him in as a disciple!</p><br/><p>But, it was a pity that Senior Feng Qingzi had not set his eyes on him.</p><br/><p>This was pretty much a sin for Reverend Shakya.</p><br/><p>\"Bald monk, cut your crap.\" Lin Fan tossed a glance over at Reverend Shakya. However, there was a strange glint in that look.</p><br/><p>Reverend Shakya was a sharp person. The moment he caught sight of Lin Fan's expression, his heart jerked momentarily.</p><br/><p>'Not good! Benefactor Lin is plotting something again!' Even though Reverend Shakya had not been with Lin Fan for all that long, he could tell what sort of a person Benefactor Lin was in general already.</p><br/><p>\"So, you're Senior Feng Qingzi, right?\" Lin Fan sized him up from head to toe.</p><br/><p>\"Once you formally acknowledge this old fellow as your master, you can call me Revered Master.\" Feng Qingzi said in a calm tone. Given his prestige, if he ever mentioned that he wanted to take a disciple in, it would be probable that there would be no genius in the Ancient Saint World who could sit still over the news.</p><br/><p>And this little buddy of the Human race was pretty decent indeed. To think that he could maintain his composure up till now. This was truly befitting as a disciple that this old fellow himself had taken a liking to.</p><br/><p>\"Huh? I've yet to acknowledge you, man. Furthermore, I don't even know if you've truly got what it takes.\" Lin Fan said.</p><br/><p>\"Haha… Those are needless worries, little buddy. This old fellow has traversed through the entire Ancient Saint World. There is no one who doesn't know or hasn't heard of my name. There have been many geniuses who had wanted me to take them in as my disciples, but most of them haven't been to my taste at all.\" Feng Qingzi chuckled out.</p><br/><p>\"It isn't because I'm over worrying. The fact remains that I've lived my entire life without a master, and have gotten to where I am because of my own self learning. There have been countless great men such as yourself who have wanted me to take them as my masters. However, because none of them have ever passed my test, they all backed off in failure eventually.\"</p><br/><p>\"What? Self learning?\" The moment Feng Qingzi heard the words of Lin Fan, his expression changed instantly, evidently somewhat disbelieving of it.</p><br/><p>Reverend Shakya looked at Lin Fan as some disbelief was starting to bubble in his heart as well. Who was he trying to bluff? Bloody hell, no master? How could anyone get this strong without a master?</p><br/><p>\"That's right. If you can get through my test, then that will be the time when I'll acknowledge that you have the capabilities to be the Revered Master of me, Lin Fan. But, by the looks of it, I don't think that you have the confidence to pull through it either.\" Lin Fan said with an unconvinced tone.</p><br/><p>\"Haha! What a joke! Is there anything in this world that this old fellow here is not capable of?\" Feng Qingzi burst out laughing as though he had just heard some sort of a funny joke.</p><br/><p>\"See! You're bragging again. How about you go slay the Utmost Being of the Ancient race right now?\" Lin Fan said.</p><br/><p>'Cough!' The moment Feng Qingzi heard these words, he coughed out instantly. He then waved his hand dismissively, \"L-little buddy! This is a grave matter. The Utmost Beings are not people whom you can kill as and when you like to.\"</p><br/><p>\"Alright, we'll skip that for now then. Do you wish to accept my challenge then?\" Lin Fan asked. However, he sniggered out sinisterly in his heart. He was going to lure this old man in bit by bit.</p><br/><p>Even though this old man was really strong, Lin Fan had never once thought of taking someone as his master. After all, he was someone with a system. As long as he were to progress steadily, he would definitely turn into an invincible existence someday. That was something that he could say with certainty.</p><br/><p>\"Hahaha! This is a first in the world indeed! The world has only known of disciples going through tests in order to acknowledge someone as their master. To think that there would be such a thing as a master taking in a test for a disciple! Alright, speak your mind then. What test is it? This old fellow here might as well open up your vision to a brand new world.\" Feng Qingzi chuckled out. However, it wasn't something he was really bothered about.</p><br/><p>\"Give me some time to think about it.\" Lin Fan snickered in his heart as he began to contemplate deeply.</p><br/><p>On the sidelines, Reverend Shakya was watching with a throbbing heart. Indeed, comparisons would be the death of someone. To think that he wanted to be Senior Feng Qingzi's disciple so badly, yet the other party wouldn't even look at him at all!</p><br/><p>But at the same time, he did not know what sort of a test this Benefactor Lin was thinking of. However, given the crafty nature of Benefactor Lin, there was no way in hell this was going to be something good.</p><br/><p>\"I've got it.\" Lin Fan's heart leaped with joy, \"The test is simple. I'll run for a duration of ten breaths. If you can catch me, we'll consider it as my loss. However, if you can't find me, it'll be your loss. How about that?\"</p><br/><p>\"So simple?\" Feng Qingzi looked at Lin Fan suspiciously. To think that the test would be this simple!</p><br/><p>Given his cultivation state, a thought was all it took for him to control the world in his palms. Not to talk about even ten breaths, a hundred, heck, even a thousand breaths would be no issue at all.</p><br/><p>\"Of course…not! How could it be that simple? You've got to hand over all the storage rings on your fingers. Oh, also that Essence Spirit of the Gleaming Blood Lord. Otherwise, if I were to hide and you were to choose not to find me or something, wouldn't it be a waste of my time?\" Lin Fan said.</p><br/><p>\"Sure, no problems.\" Feng Qingzi was really confident in himself. Therefore, he did not hesitate at all.</p><br/><p>\"Okay. You must be willing to lose if you make a wager. Then, this is a done deal as such!\" Lin Fan received over the storage rings of Feng Qingzi. His heart was overwhelmed as though flowers had just blossomed within.</p><br/><p>\"Bald monk, let us take our leave.\" Grabbing Reverend Shakya with him, Lin Fan tunneled far into the distance.</p><br/><p>Feng Qingzi stroked his white beard and smiled calmly. This was in the bag for sure. Everything was in the palms of his hands. Even if they were to escape to the ends of the world, they wouldn't be able to escape his grasp.</p><br/><p>'How the young ones are these days… They are truly too naïve, and do not know of the immensities of the world at all.'</p><br/><p>A duration of ten breaths? This old fellow could catch up with them by just blinking a few times.</p><br/>\n</div>"}