{"title": "Chapter 694: The Master Of Geniuses", "id": 694, "volume": 7, "url": "http://boxnovel.org/the-strongest-system-chapter-694-the-master-of-geniuses", "volume_title": "Volume 7", "body": "<h1>Chapter 694: The Master Of Geniuses</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 694: The Master Of Geniuses</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"This motherf*cker really knows how to run!\" Lin Fan chased in hot pursuit. Damn it! He was just that single step away from killing that Gleaming Blood Lord entirely! How could he let that fella get away?</p><br/><p>\"The Gleaming Blood Lord is not the Gleaming Blood Lord for show! To think that he could escape this fast with just a single drop of his blood! This is truly startling for this poor monk to witness!\" Reverend Shakya lamented with a look of respect in his face, \"Seems like anyone can produce an astounding amount of power when stuck in dire straits. This Gleaming Blood Lord is a very good example of that.\"</p><br/><p>\"Bald monk, the f*ck are you praising him for?\"</p><br/><p>\"Benefactor, it's just a slight acknowledgment that I was giving him, that's all!\" Reverend Shakya said exasperatedly.</p><br/><p>\"You little scoundrel, Gleaming Blood Lord! You had better stop there for Yours Truly!\" At this moment, Lin Fan was giving it his everything. However, there was still quite some distance between him and the Gleaming Blood Lord.</p><br/><p>\"You two beasts! Your Lord will definitely not let you guys off!\" The Gleaming Blood Lord was raging with fire within his heart right now. He was in so much turmoil he couldn't even bring himself to tears. To think that he would be relegated to such a state by these two ants!</p><br/><p>If he hadn't experienced this personally, he wouldn't have believed that this would one day happen to him even if he were threatened with death.</p><br/><p>\"That's right! Even if you don't want to let us off, you've got to come to a stop and fight us for a good 300 rounds!\" Lin Fan yelled out.</p><br/><p>However, to Lin Fan's dismay, the Gleaming Blood Lord was only focused on running. He had no intentions of fighting Lin Fan for a good 300 rounds at all.</p><br/><p>\"Damn it! All of you just wait for Your Lord here!\" The Gleaming Blood Lord did not want to say anything any longer.</p><br/><p>\"Benefactor Gleaming Blood, the Heavens take mercy on the living. The torments of life are endless. It is for the best that you repent as soon as you can. This poor monk swears that I'll definitely not kill you!\" Reverend Shakya was truly sincere about reforming the Gleaming Blood Lord. Even though it was only a single drop of fresh blood right now, as long as he put in the effort, he was sure that the Gleaming Blood Lord could return to his initial self. By then, if he could reform that Gleaming Blood Lord with that cultivation state, the amount of faith provided would be limitless!</p><br/><p>\"Bald monk, you had better shut your damn mouth for Your Lord here! Wait till the day Your Lord regains his power! That will be the day of the Buddha race's annihilation!\" The Gleaming Blood Lord lashed out in anger. He wouldn't even trust a single one of the words of this bald monks.</p><br/><p>For the Gleaming Blood Lord, everyone from the Buddha race was sanctimonious.</p><br/><p>\"F*ck! You bloody sh*t, to think that you would refuse the dignity that this poor monk has chosen to offer you? Today, this poor monk is going to reform you! Benefactor Lin, after you catch this fella, please hand him over to your poor monk here! Otherwise, this poor monk would not have peace of mind!\" Reverend Shakya said.</p><br/><p>\"Fart off! You can't get peace of mind? What has that got to do with Yours Truly here? Yours Truly has spent so much effort walloping this Gleaming Blood Lord till he's left as just a single drop of blood now. I've even wasted hundreds of millions of Shengyang Pills! If I don't kill him, I won't even recoup the losses in the slightest bit! Bloody bald monk, if you dare to snatch him away from Yours Truly, Yours Truly will ensure that you spend the rest of your life carrying those two lumps on your chest!\" How could Lin Fan not know what this bald monk was thinking about? At the same time, how could he allow the bald monk to do as he wished?</p><br/><p>\"Ah benefactor, those of the Buddha race possess the virtue of generosity. Since you desire it, this bald monk shall naturally grant it to you. Then, I shall hand this Gleaming Blood Lord over to you then, benefactor!\" Even though Reverend Shakya felt miserable in his heart, he did not dare to defy the words of Lin Fan. What if this fella truly did not revert his chest back to normal? Wouldn't he be dead meat then?</p><br/><p>\"Bald monk, you're simply way too dirty. However, I'm not going to continue crapping with you here. Yours Truly is going to increase my speed now.\" Lin Fan did not want to continue nagging along with the bald monk. In the blink of an eye, he used So Near, Yet So Far.</p><br/><p>\"Gleaming Blood Lord, there's no way you're going to escape!\" Lin Fan could be considered to have gone all in for this battle. All of his Shengyang Pills were completely expended. If he did not kill this Gleaming Blood Lord, then he was going to take a hell of a loss!</p><br/><p>The Gleaming Blood Lord turned around hurriedly and took a look in a shock. To think that the speed of this human would be this fast!</p><br/><p>In the blink of an eye, the Gleaming Blood Lord burst forth with a beam of glowing blood as his speed increased as well.</p><br/><p>\"Damned fella! To think that you would be forcing Your Lord here to waste the last bit of my Essence Blood!\" The Gleaming Blood Lord was burning with rage in his heart. If he managed to escape this time around, who knew how long it would take him to recover back to his peak status.</p><br/><p>Back when he was suppressed by those three Buddhas, it took him a thousand years to recover just a mere ten percent of his powers. This time around, it would definitely be nothing short of a few dozens of thousands of years if he wanted to recover fully.</p><br/><p>Damn it!</p><br/><p>The Gleaming Blood Lord was filled with an endless amount of hatred right now. However, there was nothing he could do about it.</p><br/><p>\"Benefactor, watch out!\" All of a sudden, Reverend Shakya suddenly yelled out.</p><br/><p>Far in the distance, a gigantic hand suddenly appeared. The hand seemed like a hand of the Firmaments itself that could grab at everything in this world. The entire world beneath seemed to be under the control of this one hand.</p><br/><p>Piak!</p><br/><p>All of a sudden, the escaping Gleaming Blood Lord was suddenly grabbed by this gigantic hand. There was no chance for him to fight back at all.</p><br/><p>\"What the f*ck?\" Lin Fan came to a stop and was taken aback. He did not know what in the world was going on with this hand.</p><br/><p>\"ARGH! LET GO OF YOUR LORD HERE! YOUR LORD IS THE GREAT GLEAMING BLOOD LORD!\" The Gleaming Blood Lord was trapped within that hand. However, no matter how hard he tried to struggle, he couldn't break free of it at all.</p><br/><p>\"Benefactor, what's the situation right now?\" Reverend Shakya was slightly rattled at this situation that was happening. He was pretty bewildered at what was going on.</p><br/><p>\"Are you dumb? Can't you tell? Obviously, someone's here to steal away the fruits of our labor! The Gleaming Blood Lord was walloped by us till he was down to a single drop of blood! And this gigantic hand is just trying to seize the opportunity to steal our prey away! Damn it!\" Lin Fan was utterly displeased right now. 'Daddy has been fighting here for half a day, and now someone wants to come and take a cheap victory?'</p><br/><p>\"To think that even the supremely unparalleled Gleaming Blood Lord would meet with an end as such today. Seems like what goes around comes around. Karma isn't a pleasant thing to receive.\" From the void, a figure suddenly stood out.</p><br/><p>This figure was wearing a grey cotton shirt, and had a long white beard hanging from his chin. Standing there, he did have some sort of a resemblance to a deity.</p><br/><p>\"This is Feng Qingzi here. Nice to meet the both of you.\" The bearded old man had a benevolent look on his face as he remarked calmly.</p><br/><p>\"What? To think that it's him!\" The moment Reverend Shakya heard this name, his face changed immediately.</p><br/><p>\"Bald monk, you know who he is?\" Looking at the expression on Reverend Shakya's face, Lin Fan asked curiously.</p><br/><p>\"Yes. He is a renowned powerful being of the Ancient Saint World. Many geniuses were under the guidance of this Feng Qingzi here. One could even say that he's the Master of geniuses.\" Reverend Shakya's eyes were sparkling right now. It was as though the best thing that could happen to him right now would be if he could receive some guidance from this man himself.</p><br/><p>\"F*ck! What a bigshot! But, I can't tell that at all!\" Lin Fan looked at this old man before him in shock. To think that this plain and unassuming looking old man would be that big!</p><br/><p>\"Everything is just a reputation that was blown up by the world. Seems like this little monk here knows a thing or two about this old man here, eh?\" Feng Qingzi's face grinned as he felt gleeful in his heart.</p><br/><p>While a tree lived by its bark, a human lived by his skin. Even though Feng Qingzi's cultivation was mighty and deep, he still could not contain that pride he felt when his juniors were looking at him with such reverence.</p><br/><p>\"This poor monk here is Shakya. Greetings to Senior Feng Qingzi.\"</p><br/><p>Lin Fan's mind started tinkering. Based on the situation right now, he had better give it some proper thoughts.</p><br/><p>\"Bald monk, do you think this fella is going to give us some guidance?\" Lin Fan whispered softly.</p><br/><p>\"Most likely. Usually, the places where Senior Feng Qingzi appears would be places where geniuses would receive guidance from him. Seems like I, Shakya, am truly a genius of the Buddha race. To think that I could catch the attention of Senior Feng Qingzi.\" Reverend Shakya replied in ecstasy.</p><br/><p>\"F*ck! You shameless sh*t!\" Looking at the self-important look on Reverend Shakya's face right now, Lin Fan cast him a look of disdain. If it were truly a genius they were talking about, there could be no one else but Yours Truly here!</p><br/><p>However, Yours Truly would have to first check out just what the cultivation state of this old man is first.</p><br/><p>In a flash, Lin Fan sized up the old man from head to toe.</p><br/><p>'Divine celestial level 10, Eternal God state.'</p><br/><p>However, the feeling that this old man was giving to Lin Fan was pretty frightening. In fact, even the Utmost Being of the Ancient race, Cruel, might not be a match for him at all.</p><br/><p>Strong! Indeed, he was really strong!</p><br/>\n</div>"}