{"title": "Chapter 701: Do You See Someone Blowing Air To A Cow?", "id": 701, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-701-do-you-see-someone-blowing-air-to-a-cow", "volume_title": "Volume 8", "body": "<h1>Chapter 701: Do You See Someone Blowing Air To A Cow?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 701: Do You See Someone Blowing Air To A Cow?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Revered Master, what is going on with you?\" Suddenly, Lin Fan got a little worried when he saw Feng Qingzi lying down on the ground.</p><br/><p>\"Disciple, master here has been stricken down by a disease that has one unable to live without a storage ring! I think you had better return that storage ring to your master here.\" Feng Qingzi said with difficulty, then closed his eyes and fainted down.</p><br/><p>\"This is bad! Bald monk! Hurry up and help my Revered Master with a mouth to mouth CPR!\" Lin Fan gasped out in shock. Bloody hell! This crafty old man was still acting at a time like this.</p><br/><p>\"Huh? Benefactor? You've got to be kidding with this poor monk here, right?\" Reverend Shakya's face was startled. To think that a man such as himself would have to give an old man a CPR? What if word of this got out into the world?</p><br/><p>\"Why are you still wasting time? Being someone from the Buddha race, shouldn't you be filled with compassion? Saving a life trumps building a seven storied pagoda! Hurry up!\" Lin Fan continued.</p><br/><p>\"Benefactor, please pardon this poor monk for being unable to accede to that request!\" Reverend Shakya replied with a pained look. No matter what, he couldn't possibly do something as such.</p><br/><p>\"Hurry up and give my Revered Master some CPR! Once you revive him, I'll give you some of the treasures in the storage ring!\" Lin Fan added on.</p><br/><p>\"Benefactor! Are you for real?\" The moment Reverend Shakya heard the terms, he was elated with joy as he double confirmed it.</p><br/><p>\"Of course! Absolutely real.\" Lin Fan said.</p><br/><p>\"Alright! Here comes this poor monk then! As the saying goes, saving a life trumps building a seven storied pagoda. If I don't enter hell, who would? Furthermore, the fact that I can relieve Senior Feng Qingzi here of his torments is the fortune of this poor monk here!\" Without any hesitation, Reverend Shakya bent down immediately and was ready to give Feng Qingzi some CPR.</p><br/><p>The moment Lin Fan saw this, he could not help but sigh out. Damn it! What a greedy bald monk! Seemed like treasures were the only things that could cause his heart to waver.</p><br/><p>The moment Feng Qingzi felt this breath of air coming towards him, his eyes jerked wide open as he replied suggestively, \"Ah, my dear disciple. You're indeed my dear disciple!\"</p><br/><p>\"Thank you for the praises, Revered Master. Saving my Revered Master is my duty as a disciple.\" Lin Fan's expression did not change at all as he replied righteously.</p><br/><p>F*ck this!</p><br/><p>The plans were never-ending! 'What goes around comes back around! So what if he was scammed earlier on? The one who could hold out till the very end would be the true winner!</p><br/><p>There would always be mountains higher than the other. Each generation would succeed the preceding one. So what if he had more experience than Yours Truly? In the end, didn't he still get outplayed by Yours Truly as well?</p><br/><p>Lin Fan did not think that he made much of a loss from this exchange. Not only had he gotten a backing for free, he had even picked up two storage rings!</p><br/><p>Big time! He had really earned big time!</p><br/><p>As for Feng Qingzi, he always felt that something wasn't too right about this. However, he just could not make out what it was.</p><br/><p>\"Let's go!\" Towards this disciple of his, Feng Qingzi felt that he could no longer use his heart to communicate with him. He had got to find a good chance to get back that storage ring someday.</p><br/><p>Lin Fan did not know where they were going right now. However, he was still doused in his bliss.</p><br/><p>\"Benefactor! What about the treasures you had promised this poor monk earlier on?\" Reverend Shakya's mind had been on those treasures in the storage ring. Therefore, he nudged Lin Fan's shoulders and asked.</p><br/><p>\"Hush! Softer! Do you think I'm going to let you lose out by following me?\" Lin Fan gave Reverend Shakya a slow, knowing glance.</p><br/><p>\"That's good. With that, this poor monk can have a peace of mind now.\" Reverend Shakya felt that his efforts had not gone to waste. Even though the journey had been tumultuous, he would still be getting some returns out of this.</p><br/><p>Passing through the void, Lin Fan realized that the powers of this cheap master of his were really quite profound. The speed at which they were traversing through the void was simply way too fast! Initially, Lin Fan had thought that the speed in which he traveled through the void was already quite heaven defying. However, compared to this master of his, he realized that he wasn't even one percent of this speed!</p><br/><p>\"Old man, where are we headed to right now?\" Lin Fan asked curiously.</p><br/><p>\"Disciple, from here on forth, you've got the know the virtues of respect after taking me as your master. You've got to call this old fellow as Revered Master.\" Feng Qingzi's tone was solemn as though he was giving Lin Fan a lecture.</p><br/><p>\"Alright then, Revered Master.\" Lin Fan replied helplessly.</p><br/><p>\"Right now, master is going to take you to the Guarded Ground. There are many geniuses there and it's the final sanctuary and hope for the beings of the thousands of races.\" Feng Qingzi replied.</p><br/><p>\"The last hope?\" Lin Fan was a little stunned. However, he understood after a while. The Ancient Saint World was such a huge place. If the beings of the thousands of races could survive for this long, they must have had some way of doing so on their own.</p><br/><p>Everything that he was witnessing right now was akin to scattered sand. If they wanted to overthrow the Ancient race just like that without any bit of unity, it was definitely a fool's dream.</p><br/><p>\"There are four Guarded Grounds across the Ancient Saint World. Master here is the Guardian of the vicinity governed by the districts of Cruel and Saint.\" Feng Qingzi said in a low voice.</p><br/><p>\"The Guarded Grounds are the safest places in the entire Ancient Saint World. Within every single Guarded Ground, only a million living beings can exist. If it exceeds that figure, they would automatically be purged.\"</p><br/><p>\"Huh? To think that there could be such an incredible place in the Ancient Saint World! Senior, could this be a Paradise that you have opened up?\" Reverend Shakya asked in bewilderment.</p><br/><p>There had been no mentions of these within the records of the Buddha race!</p><br/><p>\"No. These are places that were formed by nature. It also stems from the basis of a balance of life between the world.\" Feng Qingzi replied. \"These Guarded Grounds are places where the Ancient race beings have no way of entering. Even if it's an Utmost Being of the Ancient race, they can't do so either. This is because there exists a delicate relationship between the Guardians and the Utmost Beings of the Ancient race.\"</p><br/><p>\"What sort of a delicate relationship?\" Lin Fan asked.</p><br/><p>Feng Qingzi looked over at Lin Fan slowly before he continued, \"The Ancient race would never ever interfere with any issues of the Guarded Grounds, nor would they ever attack it. However, the Guardians are not allowed to interfere with the issues of the beings of the thousands of races out there either. Therefore, we can only groom talents slowly while providing new blood for the thousands of races out there.\"</p><br/><p>\"Why can't you interfere?\" Lin Fan could not really understand the intentions behind this pact.</p><br/><p>\"That is because if we were to interfere, the Utmost Beings of the Ancient race would come forth together. With ease, they can easily annihilate all the beings of the thousands of races. At the same time, this holds true for the four Guardians as well. Other than the Utmost Beings, every single last Ancient race being would be annihilated.\"</p><br/><p>With this explanation, Lin Fan finally understood the things. This was the same as the previous world he had come from. Every country had their own nuclear powers. However, there was a pact that no matter how hard they wanted to fight, they must never ever resort to using them. After all, once nuclear powers were activated, everything would be annihilated.</p><br/><p>In this case, the Utmost Beings and his Revered Master were the nuclear weapons. The moment they struck out, it would be a tragedy where no one could survive.</p><br/><p>\"Revered Master, the eight Utmost Beings of the Ancient race are powerful beings of Divine celestial level 10, Eternal God state. What about us of the thousands of races? How many Divine celestial level 10, Eternal God state beings do we have?\"</p><br/><p>\"Four.\" Feng Qingzi replied.</p><br/><p>\"That can't be, right? I've seen many powerful beings of Eternal God states!\" Lin Fan himself had subjugated ten Eternal God state beings all on his own. How could there possibly be only four?</p><br/><p>\"Disciple, all of those that you've seen are not true Eternal God state beings. They've only reached there in terms of power and the state itself. These are Pseudo Eternal God state beings. However, a True Eternal God state being would have to attain an Eternal God Seat from the Heavens. But, the number of Eternal God Seats allowed in the world are always fixed.\"</p><br/><p>\"However, there exists a possibility from the unknowns. And, your master here is just searching for that possibility that can break us through these predestined lives of ours.\" Feng Qingzi said.</p><br/><p>\"By the sounds of my Revered Master, that possibility for breaking through this predestined life should be me.\" Lin Fan replied coolly.</p><br/><p>\"Disciple.\"</p><br/><p>\"Yes, Revered Master?\"</p><br/><p>\"The skies are still bright. Can you stop daydreaming now?\" Feng Qingzi asked.</p><br/><p>\"Holy sh*t! Revered Master, if it's not me, who else can it be?\" Lin Fan was a little indignant right now. Given his unparalleled potential, how could it not be him?</p><br/><p>\"It's a powerful female. Even though she did not attain the Eternal God Seat from the Heavens, her battle powers are unparalleled. Because of that, even the Ancient race are having much trouble dealing with her. It's just that…sigh... Let's not talk about that for now.\" Feng Qingzi shook his head and sighed.</p><br/><p>\"Revered Master, are you talking about the Fire Water Empress?\" Suddenly, Lin Fan thought of that perverted b*tch.</p><br/><p>\"Disciple, how do you know about her?\"</p><br/><p>\"Oh, that's because she's my mistress.\" Lin Fan said as though it was all natural.</p><br/><p>\"Disciple.\"</p><br/><p>\"Yes?\" Lin Fan was puzzled.</p><br/><p>\"Can you see a man up ahead blowing air towards a cow?\" Feng Qingzi felt that this disciple of his was getting a little too unreliable.</p><br/><p>\"Holy f(ck! Revered Master, you don't think I'm blowing my horn, are you?\"</p><br/><p>\"Ah, it's good that you get the meaning. Alright, we're here.\"</p><br/><p>\"Benefactor, I was blown to sleep by your bragging.\" Reverend Shakya woke up while rubbing his eyes.</p><br/><p>Lin Fan, \"…\"</p><br/>\n</div>"}