{"title": "Chapter 705: Renting Yourself Out", "id": 705, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-705-renting-yourself-out", "volume_title": "Volume 8", "body": "<h1>Chapter 705: Renting Yourself Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 705: Renting Yourself Out</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Bald monk, you've truly disappointed me.\" Lin Fan had no other attachments in this life at this moment. To think that he would meet with such a noob teammate! One look and it was easy to tell that the fatty boy would be a sure scam! To think that the bald monk would fail at luring him over!</p><br/><p>\"No, benefactor! Even though I was seen through by him earlier on, this bald monk bore the intention of holding him back forcefully. However, just at that moment, the hair on my back stood up as I realized that a consciousness was locking itself on me. Evidently, I must have attracted the attention of the patrols of this place. If this poor monk had really gone on with it, I would have been taken down instantly.\" As someone of the Buddha race, the six senses of Reverend Shakya were really sharp. Every single move and action would be made known to him.</p><br/><p>\"That can't be, right? Bald monk, you're not trying to scam me because of your failure, are you?\" Lin Fan did not sense anyone peeking on him at all.</p><br/><p>\"I'm absolutely for real.\" Reverend Shakya replied.</p><br/><p>\"Alright then. Seems like robbery is out of the question for this place then. I guess we'll have to think of some other way then.\" Lin Fan trusted the words of this bald monk.</p><br/><p>It was bustling with life in the public square. Opportunities were always discovered by one's own efforts. If anyone intended to wait for opportunity to just come knocking by itself, that would be something absolutely impossible.</p><br/><p>Lin Fan and Reverend Shakya stood on the public square and looked at everyone passing by while thinking.</p><br/><p>\"The main thing is that I'm all out of materials. Otherwise, I could easily craft out a Spirit Weapon and sell it for a good price.\" Back when Lin Fan had his hands full with materials, he did not take them as anything important at all. However, now that he was in urgent need of materials, he found himself in possession of none.</p><br/><p>\"Benefactor, look! There seems to be something going on up ahead!\" Reverend Shakya said with a dazed expression. His attention was caught by some squabbling that was going on ahead.</p><br/><p>The moment Lin Fan heard this, his eyes sparkled, \"Let's go. Places that are filled with strife are definitely places where devils are born. I think the chance for us to get rich is here!\"</p><br/><p>Based on his many years of experience, Lin Fan knew that there was always advantages to be gained where there were conflicts going on.</p><br/><p>As long as he could gather 10,000 Contribution Points, he could start receiving missions after that. By then, the Contribution Points would definitely come flowing. As long as he had these Contribution Points, he could exchange them for many items.</p><br/><p>Skills, medicinal elixirs, treasures. In fact, even Dao Weapons.</p><br/><p>…</p><br/><p>\"Fang Xuan, what's the meaning of this? He has already been rented by our Rose Party, and now that we're about to start on the mission, how could you snatch him away just like that?\" A woman with a frosty expression shouted out.</p><br/><p>This woman was the party leader of the Rose Party. This time around, they had obtained an Earth Tiered Upper Graded mission. However, due to the considerations that the risks might be significant, she had spent 20,000 Contribution Points in renting a powerful being of Divine celestial level 7, All to One state. But now that they were on the brink of setting out for the mission, this powerful being that she had rented out suddenly said that he didn't want to go any longer. In fact, he even returned the 10,000 Contribution Points deposit that she had paid.</p><br/><p>This was a blow for the Rose Party.</p><br/><p>An Earth Tiered Upper Graded mission was extremely difficult. No matter who it was that received it, they would have to first pay a certain fixed deposit for accepting the mission. If they did not complete the mission within the allocated timeframe, the deposit would be forfeited instantly.</p><br/><p>\"Liu Qiangwei, you shouldn't look for me for stuff as such. As the saying goes, the offer goes to the highest bidder. It's the price that you set out that was way too low. Naturally, the other party has the right to back out of the deal.\" Standing before Liu Qiangwei was a man with a hulking figure. His skin had a slightly dark golden tinge to it. By the looks of it, he seemed like someone of the Giant race. His physical body state was also pretty strong to a certain extent.</p><br/><p>\"Fang Xuan, you can't go overboard. Even on a day to day basis, you have been pitting yourself against our Rose Party. This time around, our Rose Party has acquired an Earth Tiered Upper Graded mission. How could you behave like this?\" Liu Qiangwei's eyes were almost ready to blaze out with flames. It wasn't difficult to look for Divine celestial level 7 beings within the Guarded Ground. However, now that they were on the verge of setting out, how could they find someone they were satisfied with to replace him this easily?</p><br/><p>\"Earth Tiered Upper Graded mission? I'll have you know that this time around, the Xuan Kui Party has received a Heaven Tiered Lower Graded mission. Compared to that mission of your Rose Party, ours is way more difficult. Therefore, we would require more powerful beings. However, if you can afford to pay more Contribution Points than we did, this powerful being here would naturally join your party.\" Fang Xuan replied.</p><br/><p>\"You…!\" Liu Qiangwei's face was cold right now. This Fang Xuan was too damn accursed! The Contribution Points awarded for an Earth Tiered Upper Graded mission was only 60,000 to begin with! If she were to spend more Contribution Points on this powerful being, what would the rest of her party members get?</p><br/><p>By then, wouldn't the mission that they would have worked so hard for be given away for free?</p><br/><p>\"Party leader, we can do it ourselves!\" The Rose Party was a full female party. Each of them had an extraordinary strength to them. On an average, they were around Divine celestial level 4 and 5. If one were to gather their strength together, they would be a pretty formidable fighting force.</p><br/><p>\"Fang Xuan! You're shameless and despicable!\" Liu Qiangwei shot him an icy look. At the same time, she looked at that powerful being she had rented with a nasty look.</p><br/><p>Now that she was thinking about it properly, this might have all just been a plot of Fang Xuan to ensure that she did not get to complete her mission at all.</p><br/><p>\"Hais. You guys of the Rose Party are really way too weak. I've already said this in the past. If you guys depended on our Xuan Kui Party, you would definitely be better off than you are right now. Furthermore, the bunch of you are extremely ravishing. If you were to be caught by the Ancient race beings during your mission, the outcome would honestly be really tragic.\" Fang Xuan shook his head helplessly.</p><br/><p>…</p><br/><p>\"Bald monk, the time to act has come. Do you want to do it or should I?\" Lin Fan asked.</p><br/><p>\"How can you be troubled over such a small matter, benefactor? This can be settled by this poor monk alone.\" Reverend Shakya was gleeful all over, yet he replied with a solemn expression.</p><br/><p>\"Then go on!\" Lin Fan replied.</p><br/><p>\"Amitabha!\"</p><br/><p>At this moment when Liu Qiangwei and Fang Xuan were arguing, a Buddhist chant rang out.</p><br/><p>\"Female benefactor here, you do not have to argue with him. Someone with such a devious heart will get his due desserts.\" Reverend Shakya put on a serious and solemn disposition as he walked over slowly.</p><br/><p>\"Bald monk, what did you say?!\" The moment Fang Xuan heard these words, he was angered. However, when he felt the aura emanating from this bald monk, he held it back.</p><br/><p>The aura given off by the bald monk was really strong. This was no normal aura.</p><br/><p>\"Benefactor, did this poor monk say anything at all?\" Reverend Shakya replied with a smiling face.</p><br/><p>\"Master there, my greetings.\" The moment Liu Qiangwei saw that it was someone from the Buddha race, she retracted that angry look on her face and greeted with a compassionate expression.</p><br/><p>\"Female benefactor here, since this mission is difficult, how about you rent this poor monk here. Even though this poor monk isn't all that strong, I'm a Divine celestial level 7 state being nevertheless.\"</p><br/><p>The moment Liu Qiangwei heard this, she was momentarily overwhelmed by joy. The cultivation state of this being from the Buddha race before her was extremely profound. Even though he was also a Divine celestial level 7 state being, the aura being given off by him was way stronger than the powerful being she had rented earlier on.</p><br/><p>\"Master, how many Contribution Points would you ask for?\" Liu Qiangwei knew that it did not come cheap to rent a powerful being as such.</p><br/><p>Even though one could rent others with Shengyang Pills as well, most of them would demand Contribution Points instead. After all, Shengyang Pills could be exchanged with Contribution Points.</p><br/><p>\"10,000 shall be enough.\" Reverend Shakya chuckled.</p><br/><p>\"Ah!\" Liu Qiangwei was stumped. To think that it would be this cheap! Even Fang Xuan had not expected this bald monk to be this cheap by asking for just 10,000 Contribution Points!</p><br/><p>\"HAHA! To think that even beings of the Buddha race would be bewitched by the world of materialism to think of money.\" Fang Xuan laughed out. \"Liu Qiangwei, don't think that you can complete this mission for sure just because you had managed to find another Divine celestial level 7 state being. I've checked through your mission beforehand. The difficulty of that mission is similar to this Heaven Tiered Lower Graded mission of mine. Given your current strength, you guys are most likely going to fail it.\"</p><br/><p>Looking at the gloating expression on Fang Xuan's face, Liu Qiangwei felt her heart tightening momentarily as she had an ominous feeling about it.</p><br/><p>\"Bald monk! Are you done with the talking?\" At this moment, Lin Fan stood forth and asked.</p><br/><p>\"Benefactor, this poor monk here is still negotiating. I'm waiting for this female benefactor to reply.\" Reverend Shakya said.</p><br/><p>When Lin Fan made his appearance, Liu Qiangwei was bewildered, wondering what all of these meant. Fang Xuan turned his gaze towards Lin Fan as well, not knowing what this guy was up to.</p><br/><p>\"Chick, how goes your decision? 10,000 Contribution Points and we'll form up to go! Not only that, we'll guarantee your safety. We'll go and return before the end of the day. This is my assurance of quality!\" Lin Fan called out.</p><br/><p>\"AH!\" Liu Qiangwei froze up yet again as though she was unable to recover from the shock of this announcement.</p><br/><p>\"Chick, say something. Deal or no deal? If it's a deal, we'll go. If it's not, say it. Everyone's time is precious. Let's not waste it.\" Lin Fan did not know what was up with everyone here. Why in the hell did everyone have a retarded reaction time? He was pretty speechless about all this.</p><br/>\n</div>"}