{"title": "Chapter 712: This Act Must Be Done Or I'll Feel Like Shit!", "id": 712, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-712-this-act-must-be-done-or-ill-feel-like-shit", "volume_title": "Volume 8", "body": "<h1>Chapter 712: This Act Must Be Done Or I'll Feel Like Shit!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 712: This Act Must Be Done Or I'll Feel Like Shit!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Guarded Ground…</p><br/><p>Fang Xuan led everyone and appeared in the public square. His face was filled with an endless grin.</p><br/><p>\"The Xuan Kui Party has managed to complete a Heaven Tiered Lower Graded mission!\"</p><br/><p>\"So strong! To think that the Xuan Kui Party would be this strong! Seems like they might be at par with the Sealing Heavens Party soon!\"</p><br/><p>\"That's impossible. The reason why the Xuan Kui Party was able to complete this Heaven Tiered Lower Graded mission was that they had rented a couple of powerful beings for it. Most of the Contribution Points obtained by them might have to be split out amongst these powerful beings. However, the fame of completing a Heaven Tiered Lower Graded mission should be enough to make up for it.\"</p><br/><p>\"I suppose the reason why the Xuan Kui Party has rushed through this Heaven Tiered Lower Graded mission this time around is to try to attract more party members. Seems like we've got a chance to go try our luck at it then.\"</p><br/><p>\"Within the Guarded Ground, if one does not have any party status, it would be extremely hard to progress forward. Only when you join a stronger party do you stand a greater chance of improving.\"</p><br/><p>…</p><br/><p>Fang Xuan was all smiles right now. After having completed a Heaven Tiered Lower Graded mission, the reputation of the party has increased by quite a bit. Seemed like they might be able to attract some powerful beings to them this time around.</p><br/><p>\"Has the Rose Party returned?\" Fang Xuan swept his gaze around. However, he did not manage to catch sight of the Rose Party.</p><br/><p>\"No. Ever since the Rose Party left, they haven't returned yet. Even the sole survivor of the Hundred Battle Party who left with those two men hasn't returned either.\"</p><br/><p>\"They're just courting death. To think that they would dare to go against the descent of the Sovereign King Thunder. I'm afraid they might just be food for the Ancient race by now.\"</p><br/><p>\"That's right. However, it's quite the pity for the Rose Party as well. To think that they would dare to go attempt their mission without renting a powerful being as well. I'm afraid the odds should be stacked against them.\"</p><br/><p>Towards the outcome of the Rose Party, Fang Xuan was pretty certain by now.</p><br/><p>\"Initially, the Earth Tiered Upper Graded mission that the Rose Party had accepted wasn't that difficult. However, the Black Demon Sword Lord has been staying at the black mountain recently. One could say that the true difficulty of this mission should be around that of a Heaven Tiered Lower Graded one. By now, the entire Rose Party should have perished at the black mountain.\" Fang Xuan said.</p><br/><p>\"What?! The Black Demon Sword Lord! Isn't he the evil living being who had once annihilated the entire Rising Dragon Party with just a single slice?!\"</p><br/><p>\"If the Black Demon Sword Lord is truly at the black mountain, the Rose Party would definitely be in a disastrous position right now!\"</p><br/><p>Looking at the masses, Fang Xuan shook his head, \"If only the Rose Party had decided to join the Xuan Kui Party, something as such wouldn't have happened then. But then again, forget it. Today, the Xuan Kui Party has finished a Heaven Tiered Lower Graded mission. Are there any powerful beings who would like to be a part of the Xuan Kui Party? Anyone who is at Divine celestial level 5 and above is welcome to join us as well! The benefits would be tremendous!\"</p><br/><p>Some of the vagrant martial artists in the crowd began to harbor thoughts about it upon hearing these words.</p><br/><p>It was important to join a powerful party within the Guraded Ground after all. Not only would one be safer going with them on a mission, one would be able to obtain more Contribution Points in exchange for better stuff as well.</p><br/><p>Within the Guarded Ground, a party was synonymous with survival. If a party wanted to get stronger, they would have to have some stronger party members. If any member wanted to get stronger, they would have to seek out a reliable party.</p><br/><p>\"I'm willing to join!\"</p><br/><p>\"Me too!\"</p><br/><p>\"I'm at Divine celestial level 5 cultivation state! I'm willing to join the Xuan Kui Party!\"</p><br/><p>The moment Fang Xuan caught sight of everything before him, he was instantly exhilarated. The only way for the party to continue growing stronger was for new members to keep flooding in.</p><br/><p>Within the Guarded Ground, the Sealing Heavens Party was one of the top ten parties. Each and every single one of the members there were powerful beings who could hold their own and were not to be underestimated.</p><br/><p>\"Good, good!\" Fang Xuan was in a joyous mood right now, and had his party members take charge of the recruitment.</p><br/><p>BOOM!</p><br/><p>All of a sudden, an explosion rang out.</p><br/><p>\"They're back! The Rose Party and the Hundred Battle Party are back!\"</p><br/><p>The moment everyone heard this voice, their faces were filled with disbelief.</p><br/><p>Fang Xuan's heart was suspicious over this news. How could this possibly be? However, when he caught sight of the figures in the distance, his face changed.</p><br/><p>\"Rose Party. Have you guys completed your mission?\" Some of the bystanders asked curiously.</p><br/><p>\"Hundred Battle Party! Didn't you guys meet with the Sovereign King Thunder? How did you guys make it back alive?\"</p><br/><p>At this moment, a commotion was going on around them.</p><br/><p>\"Make way, make way…!\" Fang Xuan peeled himself away from the crowd and came before the Rose Party. He asked in an astonished tone, \"How did you guys possibly make it back from the black mountain?\"</p><br/><p>Fang Xuan was clear of the Rose Party's capabilities. If they were to meet the Black Demon Sword Lord, the only road awaiting them was death! It was impossible that they could possibly make it back!</p><br/><p>\"Fang Xuan, you hadn't expected this, had you? Seems like you knew that the Black Demon Sword Lord was at the black mountain all along, and were secretly hoping for our Rose Party to be annihilated there.\" Liu Qiangwei remarked as she looked at Fang Xuan.</p><br/><p>\"You guys have truly returned from the black mountain?\" The moment Fang Xuan heard the words of Liu Qiangwei, his face changed.</p><br/><p>\"With Yours Truly watching over them, what can this black mountain place amount to?\" Lin Fan spoke up indifferently.</p><br/><p>\"You…!\" The moment Fang Xuan cast his sights at this person before him, he was filled with disbelief. He then looked over at the Hundred Battle Party. \"You guys…!\"</p><br/><p>\"Hmph! What about them? With Yours Truly around, what can a mere Sovereign King Thunder amount to?\" Lin Fan tossed his robes with an arrogant look.</p><br/><p>This single sentence from Lin Fan had everyone rooted.</p><br/><p>What could the black mountain amount to? What could the Sovereign King Thunder amount to?</p><br/><p>Such tyrannical words!</p><br/><p>\"Impossible! The only reason why you guys have returned from the black mountains must be all due to sheer luck, Rose Party! But the Hundred Battle Party has met with Sovereign King Thunder! How could you have possibly saved them from the grasp of Sovereign King Thunder?\"</p><br/><p>Fang Xuan refused to believe everything before him. How strong of an existence was Sovereign King Thunder?! Even the Sealing Heavens Party would not dare to say that they could kill the Sovereign King Thunder!</p><br/><p>\"I knew it! You guys must have been lying! How strong is the Sovereign King Thunder! Just you alone? Impossible!\" Fang Xuan scoffed in disbelief.</p><br/><p>\"I'd say, are you sick in the head? So, you think that you're the only one who can do something and all of us can't?\" Lin Fan was pretty displeased with Fang Xuan right now. Was this mother*cker retarded or something?!</p><br/><p>\"What did you say?! Did you say that I'm sick in the head?!\" Fang Xuan's face was changed as rage surged into his heart. He then looked around at the masses, \"Do you guys believe in his words?!\"</p><br/><p>Everyone exchanged unconvinced glances with one another. After all, the might of Sovereign King Thunder was supreme. He wasn't someone any mere person could kill at all.</p><br/><p>\"I reckon that should be impossible.\"</p><br/><p>\"That's right. What sort of an existence is the Sovereign King Thunder? How can he be killed just like that!\"</p><br/><p>\"I don't believe it! No matter what, I don't!\"</p><br/><p>Looking at the skepticism in the crowd, Fang Xuan smiled out.</p><br/><p>\"Benefactor, I can't take this any longer! This act, we've got to put it on! Otherwise, this poor monk is going to feel like sh*t all over!\" Reverend Shakya remarked.</p><br/><p>\"Yes, bald monk. I have the same intentions. Go, take out our pet.\"</p><br/><p>\"Alright!\" Reverend Shakya replied gleefully.</p><br/><p>\"You bugger! Stop blocking my way. Yours Truly is on the way to go create a party now.\" Lin Fan waved his hands dismissively, not wanting to say anything any further.</p><br/><p>\"Hmph! Big words. Just someone like…\" Fang Xuan snorted coldly with a look of contempt.</p><br/><p>\"Make way, make way! The pet of this poor monk is about to come out! It's not my responsibility if anyone gets bitten!\" Reverend Shakya yelled out. He was holding on to a rope in one hand. At the other end of the rope was an Ancient race being!</p><br/><p>The moment everyone saw the Ancient race being led by Reverend Shakya, they were frozen.</p><br/><p>\"Holy f*ck! Look at that! What's that?\"</p><br/><p>\"T-this…! How could this be?\"</p><br/><p>\"Sovereign King Thunder! It's truly Sovereign King Thunder! I've seen the mission description as well as his picture before! That's the Sovereign King Thunder for sure!\"</p><br/><p>\"Impossible! Not only has he managed to save the Hundred Battle Party from the hands of the Sovereign King Thunder, but he has also even managed to suppress the Sovereign King Thunder?\"</p><br/><p>\"This is a godly news! To think that the first person to complete a Heaven Tiered Middle Graded mission from the Guarded Ground would be a living being without a party at all!\"</p><br/><p>\"Even the top ten parties of the Guarded Ground hadn't managed to complete this mission! To think that it would be completed by those two!\"</p><br/><p>As for Fang Xuan, he was completely dumbfounded at this moment in disbelief.</p><br/><p>\"Fang Xuan, there is always someone stronger out there. Good luck and misfortunes are closely tied. After snatching the powerful being away from the Rose Party, I bet you hadn't considered that it would in turn lead us to meeting an even more powerful being, right?\" Liu Qiangwei came before Fang Xuan's face and said with disdain. Without looking back, she then followed Lin Fan's lead.</p><br/><p>\"My Hundred Battle Party had met the Sovereign King Thunder. But, it was all thanks to the grace of the great almighty Lin Fan that we were able to escape with our lives!\" Lie Baizhan cupped his fists towards the crowd before hurrying in Lin Fan's direction.</p><br/><p>\"T-this…!\" Fang Xuan felt as though he was having difficulties breathing in right now. To think that he was all self-gratified with completing a Heaven Tiered Lower Graded mission earlier on. But right now, he was just being slapped on his face.</p><br/><p>\"Did you guys hear that! That man hasn't formed a party yet! If we hurry over there now and he starts recruiting, we might be taken in if we have good luck!\"</p><br/><p>\"Go, go! Hurry up and follow them or it'll be all too late!\"</p><br/><p>\"What about Xuan Kui Party? Are we not joining them anymore?\"</p><br/><p>\"What? Join your ass! There're tons of parties like Xuan Kui Party all around the Guarded Ground. But, one with a powerful being who can take down the Sovereign King Thunder? There's only one of that now!\"</p><br/><p>\"That makes sense! Let's go…!\"</p><br/><p>All of a sudden, that initially lively public square was emptied out as everyone headed over to follow Lin Fan. The only ones left standing there were members of the Xuan Kui Party, who were all frozen with shock right now.</p><br/><p>Fang Xuan was actually about to spit out a mouthful of blood.</p><br/><p>In order to complete this Heaven Tiered Lower Graded mission, he had expended quite a bit of Contribution Points! Initially, he had thought to use this to recruit more members. But, by the looks of things now, there didn't seem to be anyone left…</p><br/>\n</div>"}