{"title": "Chapter 721: A Palm To Reign Over The World", "id": 721, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-721-a-palm-to-reign-over-the-world", "volume_title": "Volume 8", "body": "<h1>Chapter 721: A Palm To Reign Over The World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 721: A Palm To Reign Over The World</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Big words!\"</p><br/><p>\"The Green and White Emperor Technique!\"</p><br/><p>All of a sudden, a bright burst of light shone out as the power vortices began to enlarge. From these power vortices, beams of green light that formed up like banners shot out, dragging the entire world into them.</p><br/><p>BOOM!</p><br/><p>An encompassing giant palm plummeted down from the sky. Each finger contained a tremendous amount of energy of their own as a series of dragons of power were coiled around those fingertips howling, growling, and devouring.</p><br/><p>Now that Lin Fan was in this cultivation state, he no longer needed any stance. Every single move he made encompassed all of his skills. With All to One, a myriad of skills was triggered and used with a single thought of his.</p><br/><p>Crack.</p><br/><p>The five fingers of the palms disrupted the world. Those mighty powerful vortices began to burst upon making contact with Lin Fan's fingers, without any room for resistance! Squeezing his fingers together, it was as though Lin Fan was squeezing the entire world within his hands.</p><br/><p>Looking at this, the Green Emperor was astonished. He could not believe that this man before him would be able to suppress all of his moves!</p><br/><p>\"Impossible!\" The blood drained from the Green Emperor's face. Turning his body around, an infinite amount of green light streaked forth, turning into many figures of the Green Emperor's Spirit.</p><br/><p>Each of these Spirits of the Green Emperor possessed a Divine celestial level 4 cultivation state of their own. Grouped together, they were like an immense formation.</p><br/><p>They were mythical, with an unparalleled divine might. However, for Lin Fan, they were nothing more than paper tigers.</p><br/><p>\"What's impossible? Lie down for Yours Truly!\"</p><br/><p>Lin Fan slapped out once more, and the countless Spirits of the Green Emperor exploded without resistance. In fact, they didn't even have the chance to cry out.</p><br/><p>BAM!</p><br/><p>The Guarded Ground quaked as the Green Emperor was slammed down onto the ground by Lin Fan's palm strike. His entire body was ruptured, with fresh blood spraying out everywhere.</p><br/><p>\"Hmph! Acting so brazenly before Yours Truly with just that bit of strength? Courting death.\" Lin Fan stamped down on the body of the Green Emperor with a look of disdain in his eyes.</p><br/><p>BOOOOOOOOOOOOOOOOOOM!</p><br/><p>The crowd exploded into disbelief as they stared wide-eyed at everything before them. They had not expected that incomparably strong Green Emperor to fall within three moves of the other party! How could they believe this?</p><br/><p>\"The Green Emperor has lost?\"</p><br/><p>\"How can this be? The Green Emperor is a Divine celestial level 8 state being! The ultimate skill of the Green Emperor is a top tiered skill as well! At the same time, his Universal Elixir is way stronger than any average Divine celestial level 8 state being's!\"</p><br/><p>\"This is big, this is big! Now that this Revolutionary Army has stomped down on three big parties, their uprising is not to be stopped!\"</p><br/><p>All of these people who were belittling the Revolutionary Army earlier on were coming to understand that the rise of the Revolutionary Army was guaranteed. It was just that their uprising resulted in them obtaining three strong enemies as well.</p><br/><p>The Berserk Dragon Party and Sword God Party were still alright to deal with. The issue was this Green Emperor Party here.</p><br/><p>\"BEAST! LET ME GO! I'M GOING TO KILL YOU!\" At this moment, the Green Emperor who had maintained his composure could not do so any longer. Now that he was stepped on by someone, how could he tolerate that? His expression was extremely malevolent right now.</p><br/><p>Liu Qiangwei's eyeballs seemed as though they were about to pop out. She was about to go silly right now. To think that this incomparably strong Green Emperor would be trampled beneath his feet! This was inconceivable!</p><br/><p>\"Kill me? Hoho... Initially, Yours Truly had only intended to teach you a lesson and spare your life. But, since you've triggered your killing intent towards Yours Truly, I guess I can't keep you any longer. But then again, the Heavens are merciful. Yours Truly isn't one to kill indiscriminately. How about this, Yours Truly will train you up to be my slave, so that you can heed my beck and calls.\" Lin Fan chuckled out.</p><br/><p>However, for everyone else, this chuckle was ever so frightening.</p><br/><p>\"Train as a slave?! That's even worse than killing the Green Emperor!\"</p><br/><p>\"That's right! Now that things had come down to this, why hasn't the Overseer appeared yet?\"</p><br/><p>\"Guys, look! He's here!\"</p><br/><p>…</p><br/><p>\"Using one's powers to settle private duels is forbidden in the Guarded Ground. The Revolutionary Army has broken the order of the Guarded Ground, and in theory, should be purged.\" A solemn voice broke through the void and rang out.</p><br/><p>The moment they heard this, everyone could not help but heave a sigh of relief. All was good now that the Overseer was here.</p><br/><p>At the same time, the moment they heard that the Revolutionary Army was to be purged, they calmed down.</p><br/><p>It was also a sort of responsibility towards the other parties of the Guarded Ground that a party like this which would fight over any disagreement would be purged.</p><br/><p>\"Hmph! Is a mere little Overseer like you someone who can interfere in the way the Revolutionary Army conducts its business?\" Lin Fan's eyes were fixed on the Overseer as his domineering aura gushed out. Spreading his fingers wide, he grabbed at the world.</p><br/><p>\"Come on down!\"</p><br/><p>Within a single breath, Lin Fan's fingers seeped into the void and dragged out the Overseer from within forcefully.</p><br/><p>\"INSOLENT!\" The Overseer was enraged. To think that there would be such an audacious fella within the Guarded Ground!</p><br/><p>The surrounding observers looked at how Lin Fan would dare to strike out at the Overseer and were completely rooted.</p><br/><p>Mad! This man must be mad!</p><br/><p>'Benefactor… Here he goes again.' Reverend Shakya could not help but sigh out at everything before him. Each time there was an affair for a major act, Benefactor Lin would always seize it. There was no chance for this poor monk to flaunt at all!</p><br/><p>\"Our party leader is so formidable! He even has the guts to whack the Overseer!\"</p><br/><p>\"That's our Revolutionary Army! That's the domineering way the Revolutionary Army should behave!\"</p><br/><p>\"At this moment, I'm even about to cry!\"</p><br/><p>…</p><br/><p>Grabbing the Overseer in his hands, Lin Fan rolled his eyes, \"So, you're the one who wants to purge the Revolutionary Army of Yours Truly? Yours Truly wants to ask, who's the one who gave you such guts?\"</p><br/><p>The Overseer had not expected to meet such an overbearing person within the Guarded Ground! At this moment, he could not help but fly into a rage.</p><br/><p>\"GUARDIAN SPIRITS, GRAB THIS MAN!\"</p><br/><p>BOOM!</p><br/><p>That initially peaceful void began to tremble as streams of light shone down from the Heavens.</p><br/><p>\"These are the Guardian Spirits of the Guarded Ground! No matter the cultivation state of this man, he would definitely be trapped within! This is it for him!\"</p><br/><p>\"That's right! No matter how strong his cultivation state is, he wouldn't be able to struggle out at all!\"</p><br/><p>\"A few thousand years ago, there was a Divine celestial level 10, Eternal God state being who had dared to act brazenly within the Guarded Ground. Eventually, he was subdued by the Guardian Spirits of the Guarded Ground without being able to fight back at all!\"</p><br/><p>The streams of light shone down like banners and caged the members of the Revolutionary Army within.</p><br/><p>At the same time, the biggest stream of light was headed for Lin Fan.</p><br/><p>Looking at these Guardian Spirits, Lin Fan had a strange expression. The aura of these Guardian Spirits was weird.</p><br/><p>\"Ah! Let me go! Party leader, save me!\"</p><br/><p>\"Benefactor, what's up with this? This poor monk can't move at all!\" Reverend Shakya was trussed up without being able to fight back at all. He was helpless right now.</p><br/><p>This thickest stream of light from the Guardian Spirits was akin to a gigantic Colossal Dragon rumbling within. All of a sudden, it tied Lin Fan up.</p><br/><p>However, the startling thing for Lin Fan was that he couldn't resist against the leash at all, no matter how he tried! In fact, he couldn't even channel his powers. It was as though he was being sealed up!</p><br/><p>\"The Revolutionary Army has disrupted the order of the Guarded Ground. The crimes are severe. They shall be whipped 10,000 times before being cast out!\" The Overseer boomed out in anger. There was no way he could tolerate such brazen individuals at all.</p><br/><p>\"HAHA!\" At this moment, Nie Kuanglong and Feng Wushuang burst out laughing.</p><br/><p>There was no one who could ever break free from the grasp of the Guardian Spirits. 'Even if your powers were supreme, so what? You still had to bear with the punishment!'</p><br/><p>\"He asked for this!\"</p><br/><p>\"To think that he would dare to act so audaciously within the Guarded Ground. Does he really think he's number one in the world?\"</p><br/><p>\"If he could bear with it a little, he could easily shine in this place. However, by the way things are now, even if he didn't die, he's going to be flogged skinless!\"</p><br/><p>…</p><br/><p>At this moment, Lin Fan's motion was locked up with his hands and feet. He took in a deep breath, \"Guardian Spirits, let go of Yours Truly! Do you guys know who Yours Truly is? Are you guys courting death?!\"</p><br/><p>Lin Fan bellowed out while his eyes were burning with a fiery rage.</p><br/><p>\"Haha! Has this human gone stupid? To think that he would ask the Guardian Spirits to let him go! Does he not know that the Guardian Spirits are the most righteous of them all?\"</p><br/><p>\"That's right! He's a country bumpkin indeed. Once you're trapped by the Guardian Spirits, you don't ever dream of breaking free!\" Nie Kuanglong sneered coldly.</p><br/><p>The Overseer laughed in his heart as well. If he wanted the Guardian Spirits of the Guarded Ground to let go, the only way would be for the Guardian himself to appear.</p><br/><p>But just at this moment, everyone opened their eyes wide and yelled out in disbelief.</p><br/><p>\"IMPOSSIBLE!\"</p><br/>\n</div>"}