{"title": "Chapter 720: The Meddling Green Emperor", "id": 720, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-720-the-meddling-green-emperor", "volume_title": "Volume 8", "body": "<h1>Chapter 720: The Meddling Green Emperor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 720: The Meddling Green Emperor.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"No more, no more please!\"</p><br/><p>\"Please stop kicking me over there!\"</p><br/><p>…</p><br/><p>It was a total wipeout for the Berserk Dragon Party and the Sword God Party right now as their members laid on the ground, wailing out in pain. Their hearts were filled with an intense crushing feeling. This was especially the case for the male members, who were even suffering from a physical crushing of their nuts.</p><br/><p>To them, members of the Revolutionary Army were thorough scoundrels! Each of them had a Spirit Weapon Armor, and not only that, their attack methods were vicious! There was no chance given at all!</p><br/><p>\"Stand up and come again! I'm not done fighting just yet!\"</p><br/><p>The members of the Revolutionary Army were going through an adrenaline rush right now. In all of these years, this was their most comfortable day of all. To think that these parties which they were once unworthy of would be stamped beneath their feet right now!</p><br/><p>No one from the masses had expected the Revolutionary Army to be this strong. Initially, they had thought that this Revolutionary Army was just a party that did not know their place at all. But right now, that image from their minds were crushed entirely.</p><br/><p>This Revolutionary Army was not to be underestimated!</p><br/><p>Obtaining victory despite being overwhelmed in numbers and with a complete set of equipment and vicious methods! The moment they struck, someone was bound to kneel down! This was totally chilling!</p><br/><p>Lin Fan looked at the scene before him and burst out laughing, \"How now, wormy Worm Kuanglong! Are you convinced now?\"</p><br/><p>Nie Kuanglong's pain wasn't limited to his physical state right now. He nearly spat out a mouthful of blood when he heard his name being turned to Worm Kuanglong.</p><br/><p>\"Seems like you're unconvinced.\"</p><br/><p>\"YOU CHEAP SCUM!\"</p><br/><p>\"If your skills aren't as good as mine, you've got no rights to call Yours Truly despicable. The name of Yours Truly isn't something you can mock. Remember this. If you were to bump into the Revolutionary Army from this day forth, you've got to make way with your tail between your legs. The Revolutionary Army isn't something you can afford to offend.\" Lin Fan flicked out his robes and stamped Nie Kuanglong beneath his feet before turning around to the masses imposingly.</p><br/><p>Everyone looked at the Revolutionary Army and could not help but take in deep breaths. They were already fully convinced by the strength of the Revolutionary Army. Strong... Way too strong!</p><br/><p>\"Revolutionary Army, you're going overboard now, aren't you?\" Just at this moment, a voice rang out. The moment everyone turned their heads into the distance, they were shocked.</p><br/><p>\"That's the party leader of the Green Emperor Party!\"</p><br/><p>\"The Green Emperor Party is the third-ranked party in the Guarded Ground! Their strength is way, way stronger than that of the Berserk Dragon Party or the Sword God Party!\"</p><br/><p>\"That's right! Even though the Revolutionary Army might be strong, if they were to be compared to the Green Emperor Party, it's really like a toddler against an adult! There's no way to compare at all!\"</p><br/><p>\"Now that the Green Emperor has chosen to make his appearance, if the Revolutionary Army knows what's good for them, they would be sure to back off.\"</p><br/><p>\"No matter what, this battle is still going to spread the name of the Revolutionary Army. From this day forth, they'll definitely be a famous party in the Guarded Ground.\"</p><br/><p>Everyone was discussing fervently. However, they were mostly looking at the Green Emperor in awe.</p><br/><p>The powerful beings were naturally respected, let alone someone like the Green Emperor.</p><br/><p>\"What kind of a small fry are you? Our Revolutionary Army wants to go overboard, so what? If you're not happy, get your guys over and we'll fight for a good 300 rounds to see who's the first one to fall!\" Lin Fan frowned, unfazed by this Green Emperor in the least bit.</p><br/><p>One had to be domineering in life. 'If you're unhappy, come and try f*cking it up then!' What was there to be talking about, unless this guy was afraid of coming?</p><br/><p>The members of the Revolutionary Army were extremely familiar with this Green Emperor.</p><br/><p>Even though they were brimming with confidence after successfully suppressing two strong parties, the appearance of the Green Emperor still had them feeling a little furtive.</p><br/><p>After all, the Green Emperor was a renowned powerful being within the Guarded Ground.</p><br/><p>The might of the Green Emperor was extraordinary, and he had a bulked up body. He brought with him a sort of majestic aura. Just by him standing there, an immense amount of pressure swept through the entire world.</p><br/><p>\"Hmph!\" The brows of the Green Emperor furrowed as he could not help but snort out coldly. The voice carried with it powers, causing thunder to rumble with it. Everyone could feel their ears hurting just by listening to it.</p><br/><p>The cultivation states of the members of the Revolutionary Army were below average. Naturally, they could not withstand such roars. Their spirits were rattled as their faces turned pale.</p><br/><p>Watching the scene, everyone nearby knew that the Green Emperor was giving the Revolutionary Army a warning.</p><br/><p>There were some who were gleeful over this. This Revolutionary Army was making quite a name for themselves. Someone had to put them in their places. Now that the Green Emperor had struck, things would naturally be different. So what if it were the Revolutionary Army? Could they possibly be a match for the Green Emperor?</p><br/><p>\"You sh*t that doesn't know your place!\" Nie Kuanglong, who was being stamped on under Lin Fan's feet, seethed out in anger. Now that the Green Emperor was here, he knew that things would definitely end horrendously for this Revolutionary Army.</p><br/><p>\"Mind your own business.\" Looking at how this Green Emperor had dared to strike out, Lin Fan was incensed. He couldn't bother with any other rules as he sent a palm strike flying out towards the Green Emperor.</p><br/><p>The moment everyone saw this, they were flabbergasted.</p><br/><p>\"This is the Guarded Ground! If he dares to strike out like that, the Overseer of this place will definitely not sit back and do nothing!\"</p><br/><p>\"The Overseer must have already noticed this place from the start. The fact that the Green Emperor is even here and yet the Overseer isn't must be because he wants to make use of the Green Emperor to teach this Revolutionary Army a lesson!\"</p><br/><p>\"There's that possibility as well. But guys, who do you guys think will win?\"</p><br/><p>\"The Green Emperor for sure. What sort of an existence is the Green Emperor? It would be effortless for him to take down the Revolutionary Army!\"</p><br/><p>\"I don't think it would be necessarily so. The Revolutionary Army has managed to suppress the Sovereign King Thunder.\"</p><br/><p>\"While the Sovereign King Thunder may be strong, if the Green Emperor were to strike out, he might not be weaker than the Sovereign King Thunder.\"</p><br/><p>\"That's true as well.\"</p><br/><p>…</p><br/><p>Looking at the situation before her, Liu Qiangwei was petrified. She had not expected things to turn out as such.</p><br/><p>Everyone knew of the might of the Green Emperor. Now that Lin Fan was looking to pit himself against him, wasn't he just purposely going into a bad situation?</p><br/><p>\"Hmph!\" The Green Emperor snorted coldly. Without any anger, his might was shown forth as a green light streaked through the void and cut out at Lin Fan. This green light was extremely sharp as it minced the void together with it.</p><br/><p>\"What's this? Yours Truly is going to take you down today!\" Lin Fan pounced up nimbly as his figure flashed. A mighty palm strike descended down from the skies. This power was boundless and earthshattering, as it repressed down onto the Green Emperor with absolute momentum.</p><br/><p>The body of the Green Emperor flashed as he streaked through the void. An infinite amount of saintly green lights shone out from the back of his body like a banner that pierced through the entire world and encompassed the void.</p><br/><p>\"That's the Green Emperor's God Glow! This guy is in for it now!\"</p><br/><p>The moment the Green Emperor struck, a boundless amount of might coiled through the world. As everyone watched this, they could not help but shudder.</p><br/><p>It was rare for them to see the Green Emperor in action. But each time they did, it was a world changing affair.</p><br/><p>Lin Fan's fingers were like knives that sliced through the void. He ripped apart that banner of green light with ease, \"Green Emperor, since you seek your own humiliation, Yours Truly is going to take you down today! I'll let you know the consequences of meddling in the affairs of others!\"</p><br/><p>\"The incredible arrogance of a frog in a well.\" The Green Emperor got serious as he did not hold back any longer. His entire body jerked once as a green light filled his body. This green light began to shrink down and was converging into his fingertips. Taking on the shape of a claw, he ripped out towards the void. All of a sudden, his powers rumbled as a series of vortices made up of his powers appeared around his body. A mighty power of suction burst forth.</p><br/><p>The situation right now had attracted the attention of many powerful beings.</p><br/><p>\"This Revolutionary Army is pretty strong indeed. To think that they could hold out until now.\"</p><br/><p>\"But, this all ends now. The Green Emperor is thoroughly enraged. This move isn't going to be so easy to block.\"</p><br/><p>As for the members of the Revolutionary Army, each of them stared at the situation in the void fixedly.</p><br/><p>\"Benefactor, fight on! F*ck this guy up!\" Reverend Shakya shouted out. Even though he was someone from the Buddha race, Reverend Shakya had never watched his words. Vulgarities flew out from his mouth without any restraint at all.</p><br/><p>\"Party leader, fight!\"</p><br/><p>\"Might be to our party leader!\"</p><br/><p>\"Might be to our Revolutionary Army!\"</p><br/><p>At this moment, Lin Fan's face was cool and calm as always. As for this move of the Green Emperor, he wasn't bothered by it. If this guy thought he was strong, so be it. While that suction force may be pretty immense, it meant nothing to Lin Fan.</p><br/><p>\"Green Emperor, that's enough. Lie down for Yours Truly!\" When Lin Fan got serious, even Lin Fan would be afraid of Lin Fan. An outburst from him was enough to have the Gods and Ghosts crying in fear.</p><br/>\n</div>"}