{"title": "Chapter 737: This Poor Monk Is A Dog If He Begs You!", "id": 737, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-737-this-poor-monk-is-a-dog-if-he-begs-you", "volume_title": "Volume 8", "body": "<h1>Chapter 737: This Poor Monk Is A Dog If He Begs You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 737: This Poor Monk Is A Dog If He Begs You!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The world had changed... entirely.</p><br/><p>At the moment when Hong Jingtian acknowledged his defeat, the world changed.</p><br/><p>\"HAHA!\"</p><br/><p>Lin Fan burst out laughing. This was the speed of him reigning supreme over a single place! Speedy! However, the Guarded Ground wasn't a place where he would overstay at the end of the day either. After all, he had to continue raising his strength so that he could go kill the Ancient race beings.</p><br/><p>\"Hong Jingtian, you're decent as well. For someone to be able to endure these many hits of Yours Truly, I'd say you're the first. You ought to be proud of yourself.\" Lin Fan consoled him.</p><br/><p>However, the words came were piercing to hear for Hong Jingtian. What did this guy mean by him being proud of himself? Did he, Hong Jingtian, look like someone who was so easy to defeat?</p><br/><p>But given the situation right now, he did not dare to say anything more. That pair of fists hanging on Lin Fan's arms had him totally fearful. Every single punch had him spraying out blood. Was this even something that was humane?</p><br/><p>A few days later…</p><br/><p>\"Benefactor, why do you seem so crestfallen these days?\" Reverend Shakya looked at Lin Fan and could not help but ask out curiously.</p><br/><p>Lin Fan looked at the bald monk, \"Bald monk, recently, my mental state has been pretty restless. Honestly, I feel like something bad's about to happen. I feel like heading out to take a look.\"</p><br/><p>\"Then, this poor monk…\"</p><br/><p>\"You should just stay here. There has to be someone to watch over the Revolutionary Army here as well.\" Lin Fan said.</p><br/><p>\"Benefactor, you're not thinking of dumping me here, are you?\" Reverend Shakya asked suspiciously. Ever since his chest had been beaten to this state by Lin Fan, he had been feeling really miserable within his heart. However, as time went by, he was gradually beginning to not think so much about such things. It seemed as though he had gotten used to it.</p><br/><p>\"How can that be? I, Lin Fan, am a responsible man. Since I'm the one who caused it, I would naturally help you recover from it.\" Lin Fan said.</p><br/><p>\"That's right. My martial arts have improved quite a bit recently. Perhaps, I may be able to help you regain your original self.\"</p><br/><p>The moment Reverend Shakya heard this, he was elated, \"Benefactor, for real?!\"</p><br/><p>It was natural for Reverend Shakya to be overwhelmed with joy on hearing these words. However, he came back to his senses in just a moment's time, \"Benefactor, you had better just tell me how you intend to solve it. Otherwise, this bald monk is going to feel uneasy.\"</p><br/><p>\"It's really simple. Just let me whack you a few more times and I'll have it bursting in no time. That should return you to your original state. No, don't look at me with that expression. I've experimented with it before. I've got quite a bit of confidence in this.\" Lin Fan looked at the wary gaze of Reverend Shakya and was a little indignant at that moment.</p><br/><p>'If not for the fact that Yours Truly was harboring some feelings of bromance for you, I would have long abandoned you! And yet, now you're behaving as though you're distrustful of the words of Yours Truly? This is a downright insult of Yours Truly!' He thought.</p><br/><p>\"Cough, cough. Benefactor, this poor monk is absolutely trusting towards you. However, after contemplating for a moment, this poor monk thinks that it'd be better to wait this out till you have a hundred percent confidence in it. By then, this poor monk will give it a shot, benefactor.\"</p><br/><p>The moment Reverend Shakya thought of the scenario that Lin Fan had described of them exploding after being whacked, he broke into a shudder.</p><br/><p>That was a little horrifying!</p><br/><p>\"Benefactor, when are you planning on leaving?\" Reverend Shakya asked.</p><br/><p>Lin Fan hesitated for a moment, \"Tomorrow. Ever since I came to this Guarded Ground, my heart has been thumping for quite some time now. It feels as though there's some sort of a feeling that's pushing me to get away from this place from the unknowns.\"</p><br/><p>Reverend Shakya looked at Lin Fan before nodding his head, \"There's always a predetermined destiny awaiting from the unknowns. Since you can sense that feeling, you should follow your heart and leave with it, benefactor. I'm afraid that things will only get worse if you continue to linger here.\"</p><br/><p>\"Yes.\" Lin Fan nodded his head. Even though he hadn't pursued any cultivation on the path of Buddhism, he knew of this logic.</p><br/><p>Shing!</p><br/><p>\"Benefactor, this is the Purification skill. It's my gift for you to cultivate.\" Reverend Shakya raised his finger, and a golden swastika floated out of it while shining brightly.</p><br/><p>Filled with a Buddhist nature, it pushed forth while illusory figures of Buddhas, Bodhisattvas, Arhats, and all sorts of other phenomenon were floating around it.</p><br/><p>\"Bald monk, why are you so generous all of a sudden?\" This Purification skill was something that Lin Fan had been looking forward to for a long time now. To think that this bald monk would actually gift it to him just like this right at the cusp of his departure!</p><br/><p>\"Benefactor, this poor monk thinks that you're insulting this poor monk by saying that. All this while, this poor monk has always been a generous person to begin with. Since you're so suspicious of this poor monk, then this poor monk shall have to take it back.\"</p><br/><p>\"Eh, eh! What are you doing? I was just joking, that's all!\" How could Lin Fan let this Purification skill fly away just like that? Naturally, he had to take it all in.</p><br/><p>While the Thunder Trainer King required this Purification skill, he needed it even more. The thought of training up this Purification skill to its final version had Lin Fan exhilarated right now.</p><br/><p>\"It's a pity that the Great Buddha's Light of Purification has been lost through the times. Otherwise, all the living beings in this world would be able to get purified by it.\" Reverend Shakya commented regrettably.</p><br/><p>Lin Fan smiled calmly and received the golden shining swastika into his body. All of a sudden, the Thunder Trainer King yelped out.</p><br/><p>\"Purification! This is the skill of Purification! As long as I can cultivate this to its peak, Your Trainer King would be able to turn into a Reform Buddha Lord!\"</p><br/><p>The Thunder Trainer King pounced over with a thirsty expression on his face, wanting to devour the swastika whole. However, he was blocked away from it by Lin Fan instantly.</p><br/><p>\"Master, please give it to me, alright?\" The Thunder Trainer King asked in a pitiful manner.</p><br/><p>\"I'll give it to you later.\"</p><br/><p>Naturally, Lin Fan could not allow the Thunder Trainer King to eat this up. Otherwise, what was he to do? This Purification skill was so damn blood tyrannical! If it were turned into that Great Buddha's Light of Purification, wouldn't it be heaven revolting?!</p><br/><p>\"Given the wisdom of Yours Truly, it will be enough to comprehend the Great Buddha's Light of Purification out of this Purification skill.\" Lin Fan declared with confidence.</p><br/><p>\"Brag, yes. Just brag on. Can you have some shame, gosh!\" Reverend Shakya retorted in disbelief.</p><br/><p>\"Haha! Bald monk, when Yours Truly comprehends the Great Buddha's Light of Purification out of this, don't come begging me for it!\" Lin Fan chuckled out.</p><br/><p>\"It's absolutely impossible. This poor monk would be a dog if I were to beg you.\" Reverend Shakya tossed his head away and replied curtly.</p><br/><p>The night darkened…</p><br/><p>With a single excuse that men shouldn't get too close together, Lin Fan dismissed the bald monk away from him.</p><br/><p>Reverend Shakya looked at the bright moon in the dark night sky and suddenly felt a sense of melancholy to write a poem out of. However, he had nothing in his mind that he could think up of at this moment.</p><br/><p>\"Hais! Benefactor Lin is about to leave.\" Reverend Shakya lamented as his eyes shone with some reluctance. However, he started sniggering before long as well.</p><br/><p>\"This poor monk is the vice party leader of the Revolutionary Army. However, if Benefactor Lin were to leave, wouldn't this poor monk be the leader? Not bad, not bad! THAT would give some meaning to life!\"</p><br/><p>Reverend Shakya headed back towards his house as his mind was swarmed with thoughts of how he would be attended by countless members with a single call from now on. This image lingered in Reverend Shakya's mind for a long time before it went away. The more he thought about it, the more excited he got.</p><br/><p>The next day…</p><br/><p>Lin Fan left silently.</p><br/><p>However, in the words of Reverend Shakya, the party leader had just entered a closed seclusion, and would definitely not head out for another hundred years or so.</p><br/><p>For everyone from the Revolutionary Army, Lin Fan was their main support. Who knew what sort of a ruckus would occur once they caught wind of their party leader's departure?</p><br/><p>It was especially more worrying if the other parties were to start mocking the Revolutionary Army mercilessly if they knew about it. Lin Fan could definitely not have something like that happening.</p><br/>\n</div>"}