{"title": "Chapter 756: The Powerful Innate Gift Of The Samsung Race", "id": 756, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-756-the-powerful-innate-gift-of-the-samsung-race", "volume_title": "Volume 8", "body": "<h1>Chapter 756: The Powerful Innate Gift Of The Samsung Race</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 756: The Powerful Innate Gift Of The Samsung Race</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Cruel, that's right. Continue that way! Once we're done with all this, Master here will treat you to a good meal.\" Most of Lin Fan's body was hidden within the Heaven and Earth Smelt. The only thing that was revealed right now was his head.</p><br/><p>\"Yes, Master.\" Cruel replied calmly without even a single bit of emotion on his face.</p><br/><p>That single hammer just now has caused Saint's chest to dent in entirely. However, it healed up in the blink of an eye. If not for Lin Fan's help, Cruel might truly not be a match for this guy!</p><br/><p>Shing!</p><br/><p>Suddenly, the void trembled as a stream of light bolted out to the back of Lin Fan's head almost undetectable.</p><br/><p>Clang!</p><br/><p>\"Holy f*ck! That was too close! You're too despicable, Saint! Since you cant f'*ck me up, you sneak an attack on me? Can you leave some dignity for yourself?\" Lin Fan broke out and scolded. Lin Fan had finally witnessed the shamelessness of this guy thoroughly for himself.</p><br/><p>Saint was so angered that his body was quivering uncontrollably. This was some anger that he had to bear with right now but couldn't endure any longer.</p><br/><p>\"Good. Very good! Didn't you want to try and use your Mythical Parasol Tree to suppress Your Utmost? Your Utmost shall fulfill your wishes then! Time to let you know of the consequences of messing with Your Utmost here!\"</p><br/><p>Saint bellowed out as he opened up his Paradise. Thousands and thousands of living beings shot out from it.</p><br/><p>Lin Fan was a little taken aback at everything before him.</p><br/><p>What was this guy up to? Did he realize that he couldn't win the fight, so he was getting help from others to fight for him?</p><br/><p>But, the cultivation states of these guys didn't seem all that high either.</p><br/><p>On an average, they were all Divine celestial level 5 or 6, and that was all.</p><br/><p>But, even all those Divine celestials would just be destroyed with a single palm of his.</p><br/><p>\"Samsung race!\"</p><br/><p>When Namo Saint Emperor caught sight of these living beings, he could not figure out what was going on for a moment either. However, he exclaimed out in shock all of a sudden.</p><br/><p>\"Lin Fan! You've got to watch out! This is the Samsung race!\"</p><br/><p>\"It's alright. Their cultivation states are so weak. They're barely enough to even fit in my teeth gaps.\" Lin Fan waved his hand dismissively, expressing his disregard.</p><br/><p>\"It's not that…!\" Namo Saint Emperor had wanted to carry on, but it was too late. The only thing that remained was the cold smirk on the lips of Saint. Flicking out with his finger, a Samsung race living being bolted out.</p><br/><p>\"Ant, you shall regret this for the little time that's left of your puny life!\"</p><br/><p>Saint finally spoke up while those sinister eyes of his glowed with a raging fire.</p><br/><p>\"It's not what…?\" Lin Fan was stunned, unable to understand the current situation. How could this Divine celestial level 5 state Samsung race being do anything to Yours Truly?</p><br/><p>However, Lin Fan shut his mouth back almost immediately after. The scene that came all too suddenly next had him stunned silly.</p><br/><p>BOOM!</p><br/><p>That Divine celestial level 5 Samsung race being flew before those tree branches. Suddenly, its body started expanding as though it had taken some sort of a pill before exploding.</p><br/><p>BOOM!</p><br/><p>The sound of that explosion reverberated through the world as an immense shockwave rippled out in its aftermath. Quite a number of those tree branches of the Mythical Parasol Tree were blown off all of a sudden.</p><br/><p>\"Holy f*ck…!\"</p><br/><p>\"Samsung race… Since when have they had such an ability?\"</p><br/><p>Lin Fan was completely stunned. This was way too mother*cking scary!</p><br/><p>\"That's what I wanted to tell you! Amongst the beings of the thousands of races, the Samsung race has the strongest self destruction powers! Even the Ancient race beings are not willing to engage much with these Samsung race beings who can explode at any moment!\" Namo Saint Emperor sighed out.</p><br/><p>The Samsung race had not started out like this from the very beginning. However, as they evolved and changed, their self destruction capabilities got even more powerful.</p><br/><p>And right now, there were less Samsung race beings out among the thousands of races. Seemed like the reason behind it was because they had been captured by Saint.</p><br/><p>\"Holy f*ck! Why didn't you say this earlier?\"</p><br/><p>Lin Fan was about to cry out right now. Was this even humane? To think that the self destruction powers that were brought forth by a Divine celestial level 5 Samsung race being could blast a Divine celestial level 9 state being into a crippled state!</p><br/><p>The Mythical Parasol Tree was crying out right now. Evidently, it was really painful.</p><br/><p>\"Oh, my Little Tree Tree! Don't cry now! Daddy here will take revenge for you!\" Sensing the tears of his Mythical Parasol Tree, Lin Fan felt really pained as well. This was his Mythical Parasol Tree that he had painstakingly nurtured and cultivated! And now that it was finally showing some powers, this bloody beast was trying to play a self destruction game with it!</p><br/><p>Instantly, Lin Fan kept back his Mythical Parasol Tree.</p><br/><p>Looking at the dense cluster of Samsung race beings in the sky, Lin Fan was having a real big headache. If all of them were to self destruct, wouldn't they be annihilated entirely?</p><br/><p>\"Ant, you had better hide in that smelt of yours for all eternity. Once Your Utmost is done with this traitor, I'm going to come take care of you.\"</p><br/><p>Saint growled out as that berserk gaze of his glared straight at Lin Fan. As long as that fella dared to come out, the only thing that would welcome him would be the self destruction of the Samsung race beings.</p><br/><p>Back when Saint had yet to turn into an Utmost Being, he had used this technique to kill off countless powerful beings.</p><br/><p>And ever since he turned into the Utmost Being, he took care of the Samsung race beings by killing and forcing them into his Paradise so that they could be his undead warriors.</p><br/><p>After the nurturing over countless of years, Saint had trained up a huge bunch of Samsung race beings.</p><br/><p>The amount of power that could be brought forth by them was monstrous. Even if it were a powerful being of Divine celestial level 10, they would almost definitely be blasted into smithereens with it.</p><br/><p>\"Cruel, I'm going to torture you slowly till you die.\" Saint was no longer concerned with Lin Fan as he turned his attention towards Cruel.</p><br/><p>Once upon a time, Cruel was nothing but an ant like servant in Saint's hands, who could only serve beneath his feet. To think that this guy would have gotten big enough balls to pit himself against the latter!</p><br/><p>If he didn't kill this guy, what authority would he have to speak of after this day?</p><br/><p>Looking at how Saint was using everything he had to retaliate, Fault smirked out.</p><br/><p>\"Feng Qingzi, this time around, you're all going to fall right here.\" Fault scoffed out coldly. He was on equal footing with Feng Qingzi. If he wanted to kill Feng Qingzi, it would be extremely difficult.</p><br/><p>However, as long as Saint could deal with those ants there, even if Feng Qingzi were alive at that time, he would have to die here nevertheless.</p><br/><p>\"Aiyah! F*ck my life! This is some f*cked up plan he's got there! What shall Your Daddy do?\" Lin Fan was hidden within the Heaven and Earth Smelt. For a moment, he did not know what to do.</p><br/><p>Even though it was extremely safe for him to hide here, he couldn't possibly hide for the rest of his life!</p><br/><p>\"That's right! I can try using that Great Buddha's Light of Purification!\"</p><br/><p>Now that his Purification had been trained up to the Great Buddha's Light of Purification, the ability to purify and reform others was practically heaven revolting.</p><br/><p>There was no way these Divine celestial level 5 and 6 state Samsung race beings would be able to defend against that at all!</p><br/><p>Through the Heaven and Earth Smelt, Lin Fan saw that Saint and Cruel were going at it once more.</p><br/><p>For now, there was no distinct victor just yet. However, if this were to carry on, Lin Fan knew that Cruel would lose out very quickly.</p><br/><p>The faces of Namo Saint Emperor and the Female Empress focused up as they nodded their heads to one another. Even though they did not know why Cruel would obey the words of that lad, the moment now was critical. They could only give it a shot.</p><br/><p>Lin Fan opened up the front lid of the smelt. Just as he was about to push his head out to check it out, a Samsung race being bolted over and exploded right above the Heaven and Earth Smelt.</p><br/><p>\"Holy f*ck! This guy is giving me no f*cking chances at all!\" All this while, Lin Fan had always thought that his plans were really well thought out. To think that this Saint would be hiding his true face and could come up with such intricate plans as well.</p><br/><p>Lin Fan hesitated for a moment before entering Stealth mode. He then sneakily opened up the front lid of the smelt once more.</p><br/><p>Indeed, it was as he had thought. Those dazed Samsung race beings would not take any actions as long as they didn't see him.</p><br/><p>\"Hmph! Blow up Yours Truly? Yours Truly shall show you guys true power!\" Lin Fan raised his finger and moved his mouth.</p><br/><p>A strain of Purifying Light swiveled around the world.</p><br/><p>\"Great Buddha's Light of Purification!\"</p><br/><p>BOOM!</p><br/><p>Suddenly, the world rumbled as golden scriptures lined the entire sky, caging up the Samsung race beings entirely.</p><br/><p>'Ding…Purification success.'</p><br/><p>'Ding…Purification success.'</p><br/><p>When Saint sensed the weird happenings, he jerked his head back. However, he saw something absolutely unbelievable.</p><br/><p>\"YOU PIECE OF DOGSH*T! STOP NOW!\"</p><br/><p>Saint could sense his connection with the Samsung race beings getting weaker by the moment, as though it could break off at any time.</p><br/><p>\"Hmph! Don't even dream of heading over!\" When Namo Saint Emperor caught sight of everything in the distance, his face changed. Wasn't that the Great Buddha's Light of Purification?</p><br/><p>\"Boundless Dimension!\"</p><br/><p>Namo Saint Emperor spat out a mouthful of fresh blood. He was practically using his core essence right now, putting his very own life at risk.</p><br/><p>Instantly, a mysterious power burst forth, and the area around Saint started contorting violently.</p><br/><p>This was the absolute power of the Namo Saint Emperor, a skill that allowed him to forcefully manipulate both space and time. Saint was unable to resist the distorting changes of the twisting power of space and time around him right now.</p><br/><p>However, given his strength, this pocket of dimension wouldn't be able to hold him in there for much longer either.</p><br/>\n</div>"}