{"title": "Chapter 751: Incomparably Frightening Strength", "id": 751, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-751-incomparably-frightening-strength", "volume_title": "Volume 8", "body": "<h1>Chapter 751: Incomparably Frightening Strength</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 751: Incomparably Frightening Strength</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>BAM!</p><br/><p>Right now, the situation outside wasn't looking too optimistic. With the combined strength of two Utmost Beings, even if Feng Qingzi's strength was equivalent to theirs individually, he was being pushed back without being able to do anything at all.</p><br/><p>Namo Saint Emperor opened his mouth in rage. Instantly, a rainbow-colored island appeared floating gently in the air.</p><br/><p>\"Are you going to go at it with your life?\" When the Female Empress caught sight of the rainbow-colored island, her expression changed.</p><br/><p>\"What else can I do unless I go at it with all I've got? If we were to drag this on, we wouldn't be able to hold out until the end!\" Namo Saint Emperor replied seriously.</p><br/><p>\"Since that's the case, this seems to be the only way.\" The Female Empress did not think too much anymore as she opened up her tender, jade-like fingers. From there, a throne that brought with it an endless authority floated within the sky.</p><br/><p>The moment the throne appeared with its endless might, tiles started to extend out with the throne as the center of everything, as it formed a heavenly path. Instantly, the Female Empress appeared on the throne and pointed out as though she was commanding her empire.</p><br/><p>\"Namo Island.\"</p><br/><p>\"Royal Heaven Throne.\"</p><br/><p>Both of these were supreme treasures. They were not crafted out by either the Namo Saint Emperor or the Female Empress themselves. By a miraculous encounter, both of them had managed to obtain each of these treasures, and from then on, soared up without hindrance.</p><br/><p>It was a straight path up to the peak of all of the powerful beings.</p><br/><p>No one knew of the origins of the Namo Island. Even the Namo Saint Emperor himself could only harbor a guess that it had something to do with the Buddha race.</p><br/><p>There were countless living beings in the Namo Island. Colossal Dragons, Buddhas, Arhats… All sorts of countless living beings resided there while chanting Buddhist scriptures all day long.</p><br/><p>A bright Buddhist light shone forth from the island and pierced up into the clouds, as though it was communicating with an existence from the unknowns.</p><br/><p>BOOM!</p><br/><p>Instantly, a ringing Buddhist voice floated out of the Namo Island.</p><br/><p>\"AMITABHA!\"</p><br/><p>This was an ancient Buddhist voice unlike any of the chants that those beings of the current Buddha race were chanting. The moment the voice rang out, the entire world trembled under its might as everything went into chaos while golden lotuses descended.</p><br/><p>A gigantic black lotus floated out of the Namo Island.</p><br/><p>Instantly, the world was caged up by a bright and immense Buddhist light that emanated out of it.</p><br/><p>As for this shut lotus, it suddenly opened up magnificently petal after petal. It was exquisitely beautiful. In the middle of the lotus, there seemed to be someone seated there.</p><br/><p>By the time the lotus had opened up entirely, an extremely vicissitudinous aura was emitted from it.</p><br/><p>Seated in the middle of that lotus was a humongous, pitch black Buddha! His eyes were tightly shut as that precious expression of his was extremely dignified. However, there was a thick and evil Buddhist light seeping out of it at the same time.</p><br/><p>Even if it were an evil Buddhist light, the feeling it gave off was still something that would have everyone feeling that this was the way a Buddha should be.</p><br/><p>\"That's the Ancient Evil Buddha! To think that the Namo Saint Emperor would have an accomplishment like this!\"</p><br/><p>When Feng Qingzi caught sight of this Evil Buddha before him, he was startled as well.</p><br/><p>According to the legends, there was once an extremely powerful being of the Buddha race who had wanted to obtain the seat of the Ancient Revered Buddha in the past. Because of that, he severed all the Seven Emotions and Six Worldly Desires and entrusted them within a treasure.</p><br/><p>After that, because of the changes in the world, this treasure that held onto the Seven Emotions and Six Worldly Desires of the extremely powerful being of the Buddha race was lost within the world. To think that it would be obtained by the Namo Saint Emperor!</p><br/><p>The moment the treasure appeared, Feng Qingzi was not the only one surprised. Even the Utmost Beings of the Ancient race were a little startled as well.</p><br/><p>\"To think that the treasure within which the old bald monk had entrusted his evil thoughts would be obtained by you.\" Looking at the Namo Island, Saint let out a frosty laugh.</p><br/><p>The Namo Saint Emperor did not say anything much. Roaring out, a long river of Shengyang Pills started boiling.</p><br/><p>\"Burn!\"</p><br/><p>The Namo Saint Emperor had lived in seclusion for a long time now. Naturally, the amount of Shengyang Pills he possessed was astronomical. Now that he was faced up against an Utmost Being of the Ancient race, he did not dare to be careless.</p><br/><p>Ever since he had obtained this Namo Island, the Namo Saint Emperor had lived a domineering life as one of the strongest beings in the Ancient Saint World.</p><br/><p>In the past, even if he were to meet any powerful beings, he would not be bothered at all. However, the one he was going up against right now was an Utmost Being of the Ancient race right now. Namo Saint Emperor naturally had to take out all of his abilities at this moment.</p><br/><p>BOOM!</p><br/><p>With that, a large amount of Shengyang Pills was incinerated instantly. Upon receiving this tremendous amount of energy, the Namo Island started going berserk.</p><br/><p>That titanic, pitch black Buddha jerked his eyes open furiously as two beams of jet black Buddha lights shielded down the entire world. Every single place which the naked eye could see was all filled with chaos.</p><br/><p>\"Amitabha.\"</p><br/><p>The titanic, pitch black Buddha stood up all of a sudden and raised a heaven encompassing hand. Countless Buddhas surrounded that gigantic hand as they sang out scriptures. The vast might was boundless as it covered the entire world.</p><br/><p>\"Suppress!\"</p><br/><p>This was everything that the Namo Saint Emperor had right now. He had already taken out the trump card that he had been keeping.</p><br/><p>\"Namo Saint Emperor, to think that you have hid this unusual secret treasure that you had obtained so deeply.\" When the Female Empress caught sight of this, her heart rattled as she smiled out as well.</p><br/><p>The stronger the Namo Saint Emperor was, the more beneficial it would be for them.</p><br/><p>\"Female Empress, what are you still watching over there for? For this lad, I've really given a lot this time around.\" The Namo Saint Emperor said while experiencing a heart-wrenching pain.</p><br/><p>Even though the Namo Island was strong, it wasn't something that was so easy to use.</p><br/><p>Each time he used it, he would be assaulted with all sorts of negative feelings and intents. If he didn't want to be possessed by them entirely, he would have to purge them out of his body.</p><br/><p>Given the situation right now, he would have to sit down and meditate for an entire year at least after this battle.</p><br/><p>\"Alright…\"</p><br/><p>The Female Empress did not hesitate anymore. The throne had the ability to conquer the entire world. With the descent of the Female Empress, all living beings would have to bow down.</p><br/><p>Lifting her tender finger, the throne shone with an intensely brightly light. A boundless amount of power shot down from the void.</p><br/><p>\"Ants! You're all ants! Do you guys really think that you can defeat Your Utmost here with just these tricks?!\" Saint yelled out as his aura erupted out like a dragon.</p><br/><p>BOOM!</p><br/><p>All of a sudden, lightning flashed, and it seemed as though the entire sky had lost its brightness.</p><br/><p>\"THE BOUNDLESS HEAVEN'S WILL! UNPARALLELED POWER!\"</p><br/><p>Both Saint and Fault bellowed out as their entire bodies were covered up in a mysterious and deep power. As they bashed out with a single punch each, the force that came forth and opposed the power of the Female Empress.</p><br/><p>Bam! Bam!</p><br/><p>As though it was provoked, the face of the titanic, pitch black Buddha was incredibly angry, and that colossal body of his began to quiver. The lotus below his feet began to collide against one another. Countless secret skills of the Buddha race gushed forth and turned into Buddha Dragons that wrapped around the hand of the titanic Buddha.</p><br/><p>\"Using a World of Buddhas, Your Emperor here shall fight you guys with all I've got!\" The Namo Saint Emperor roared out as his blood boiled.</p><br/><p>\"Ancient Buddha, communicate through the world and strengthen my body with that limitless Buddha power!\"</p><br/><p>Namo Siant Emperor knitted his brows. The Utmost Beings had long gone beyond his imagination. In the blink of an eye, a punch bolted out, causing a vortex to appear in front of them.</p><br/><p>Using the Namo Island as a basis, Namo Saint Emperor communicated with the Ancient Buddha race that had long disappeared in the rivers of time.</p><br/><p>BOOM!</p><br/><p>Buddha flowers scattered down as the world was covered in a sea of flowers at that moment.</p><br/><p>\"One Flower, One World! A single thought is eternity!\"</p><br/><p>\"Damn it! Namo Siant Emperor, you're seeking your own humiliation!\" Saint bellowed out as he slammed with a palm, suppressing that boundless Buddha power.</p><br/><p>Bam!</p><br/><p>Bam!</p><br/><p>The void started exploding as time and space seemed to have shattered. Namo Saint Emperor's face was deathly pale as he stumbled back.</p><br/><p>That titanic Buddha of his began to break down as it was crumbled by that palm of Saint. Even with the power of an entire world, it wasn't enough to go up against the Utmost Being.</p><br/><p>Feng Qingzi and the Female Empress were striking out simultaneously. However, even as they used their strongest moves, they were all blocked down by Fault.</p><br/><p>\"The Ancient race suppresses across the Infinite Worlds. Do you think that something like would be enough for you to come up against Your Utmost here?\"</p><br/><p>\"We are on the cusp of the opening of the Infinite Worlds, and the Heaven's Will is gradually awakening. Today, Your Utmost shall let you guys have a taste of the Heaven's Will's power!\"</p><br/><p>Saint roared out as both of his arms tore through the sky, and an infinitely huge crack appeared above the heads of everyone.</p><br/><p>SHING!</p><br/><p>All of a sudden, an incomparable amount of energy bolted down into this world. Under the booster of this power, Saint's aura suddenly turned extremely frightening.</p><br/><p>\"Not good!\" Feng Qingzi's face took a huge turn as a really bad feeling wormed itself into his mind right now.</p><br/><p>He had not expected that the Heaven's Will of the Ancient Saint World would be gradually awakening! Even if it were just a fraction of its awakening, the power that was boosting Saint up right now was even more horrifying.</p><br/><p>Saint pointed out with his finger. Instantly, the treasures of the Female Empress and Namo Saint Emperor exploded instantly while they were repelled back without any chance to fight at all.</p><br/><p>…</p><br/>\n</div>"}