{"title": "Chapter 758: Saint Fights Alone", "id": 758, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-758-saint-fights-alone", "volume_title": "Volume 8", "body": "<h1>Chapter 758: Saint Fights Alone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 758: Saint Fights Alone</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"The Samsung race is truly a godly weapon of self destruction! The higher their cultivation states, the more destructive their explosion gets! At times, they would even explode in the least expected moments! That's the sickest property they have!\"</p><br/><p>\"That's because you'll never know when the Samsung race beings are in a bad mood and decide to take you up on a tour with them to the Heavens.\"</p><br/><p>Hiding within the Heaven and Earth Smelt and checking out the situation outside, Lin Fan could not help but take in a breath of cold air. This time around, the explosive power was truly heaven defying. Even the void had started to be get distorted!</p><br/><p>In fact, even Lin Fan, who was just hiding in the Heaven and Earth Smelt and watching Saint endure the torments within the contorting void, felt that this body of his which was blessed by the Heavens might not be able to withstand it either.</p><br/><p>\"BEAST! I'M GOING TO KILL YOU!\" Saint hollered out as his aura expanded out. This mighty aura spread out through the entire world as that berserk body of his was almost causing Lin Fan to be dumbfounded.</p><br/><p>\"Holy f*ck! This Saint is quite resilient, isn't he? Even all of these Samsung race beings may not be able to kill him!\" The bunch of Samsung race beings that Lin Fan had tossed earlier on was really ferocious!</p><br/><p>Even if it were the Namo Saint Emperor and the Female Empress, they would definitely be blown up such that their innards would fly all around if they were in the center of this explosion!</p><br/><p>But, even in Saint's case, his skin was showing signs of being torn apart.</p><br/><p>\"Not good! Seems like I've got to add on more power to it.\"</p><br/><p>Seated within the Heaven and Earth Smelt, Lin Fan let out a few more Samsung race beings. Looking at them, he sighed gently.</p><br/><p>\"All of you guys are good examples. The people will remember you guys!\"</p><br/><p>Without saying anything more, a strain of Spirit of Biggra floated out gently and fused into the bodies of these Samsung race beings.</p><br/><p>\"Repress it within their bodies first before blowing up later.\" Lin Fan did not want to waste this round of explosion by the Samsung race beings. Hence, he got the Spirit of Biggra to slow down first.</p><br/><p>Lin Fan had full confidence that he could make Saint pay with the explosion this time around.</p><br/><p>But of course, the prerequisite was for Saint to not run away from it.</p><br/><p>If Saint were to run away, there could truly be no one who could stop him.</p><br/><p>Instantly, Lin Fan utilized his True Origins Crushing Kick. This was a booster to help the Samsung race beings unleash their strongest potential, so that they could let out the wildest explosion possible.</p><br/><p>\"COME ON OUT!\"</p><br/><p>At this moment, Saint was howling out with bloodshot eyes. He was truly incensed. To think that this beast would dare to do this to him!</p><br/><p>Namo Saint Emperor and the Female Empress were hidden pretty far right now. Looking at this battered and exhausted Saint, they realized that the change of events was far too great!</p><br/><p>The magnificence of the Female Empress was unmatched in the generation with those breathtaking features of hers. However, at this moment, those red lips of hers were parted slightly as she was totally dumbfounded.</p><br/><p>This was clearly a dead end for them earlier on! To think that the tides would turn like this!</p><br/><p>\"YOU DAMNED COWARDLY TORTOISE! ARE YOU GOING TO HIDE IN THERE FOR THE REST OF YOUR LIFE?!\" Saint circled around the Heaven and Earth Smelt while screaming out.</p><br/><p>The moment Lin Fan heard the taunts from the outside, he could naturally not bear with it.</p><br/><p>Clang!</p><br/><p>This ringing sound gave Saint such a shock that he jumped back, thinking that the dogsh*t was going to come out and f*ck him up.</p><br/><p>But when he saw the front lid of the smelt opening up, he turned wary.</p><br/><p>He wanted to rush in and kill that guy entirely. However, he had no clue about how this treasure worked. For a moment or so, he truly did not dare to act foolishly.</p><br/><p>\"COME. ON. OUT.\" Saint was breathing heavily right now. Even though the explosion earlier on hadn't done much harm to him, it caused his blood to rumble nevertheless. This was a situation that he had never encountered after becoming an Utmost Being.</p><br/><p>\"Come on in if you've got the guts!\" Lin Fan was within the Heaven and Earth Smelt right now. No matter what, he was not going to get out.</p><br/><p>If this Saint fella had the guts to come in, it would just be death awaiting him. He would just slam the front lid and follow up with some wild bashings to have this Saint ponder over his life.</p><br/><p>\"Good. You don't want to come out, right? Then, Your Utmost Being shall have them killed!\"</p><br/><p>Saint was so enraged that he did not know what to do anymore. He knew that the other party was right in front of him, yet he did not dare to engage.</p><br/><p>In that instant, Saint jerked his head back and looked at the Namo Saint Emperor and the Female Empress.</p><br/><p>\"ALL OF YOU SHALL HAVE TO DIE!\"</p><br/><p>But, the very moment he turned his head around, Saint felt a chilling aura surge into his heart as though something big was about to happen.</p><br/><p>\"Go on and explode!\"</p><br/><p>At that moment, Lin Fan seized this opportunity and tossed out all of those rampaging Samsung race beings, then shut the lid of the smelt immediately.</p><br/><p>BAM!</p><br/><p>BAM!</p><br/><p>This time around, the power of the explosion was practically toppling the entire Heaven and Earth, giving off a gut smashing feeling.</p><br/><p>Horrifying! This was way too horrifying!</p><br/><p>\"YOU B*STARD! DO YOU THINK THAT THIS WILL DEAL ANY DAMAGE TO YOUR UTMOST BEING? YOU…!!!\"</p><br/><p>\"ARGHHHHHHHHH!!!\"</p><br/><p>Before Saint could even finish his sentence, he was sent howling in pain due to the power of the explosion.</p><br/><p>Even though the explosive powers brought forth by these Samsung race beings were tremendous, they were far from enough to kill Saint. However, under the shameless boosting of their powers by Lin Fan, even Saint could feel a strain of terror.</p><br/><p>\"This explosive power is way stronger than before!\" The Namo Saint Emperor's powers were rumbling to form a protective barrier in order to repel the aftershock.</p><br/><p>Namo Saint Emperor could no longer make out the current situation anymore.</p><br/><p>What in the world was happening right now?!</p><br/><p>In the blink of an eye, the tables had totally turned! This was entirely unbelievable!</p><br/><p>Namo Saint Emperor had truly never seen an Utmost Being who was being tricked so badly. This was practically inhumane!</p><br/><p>\"HAHA! Saint, how was that? Pleasurable?\" Lin Fan burst out laughing.</p><br/><p>This Samsung race was some good sh*t indeed! This power of the explosion was literally heaven revolting!</p><br/><p>\"I'll toss…I'll toss…!\"</p><br/><p>Within the Heaven and Earth Smelt, Lin Fan's hands moved nonstop as he tossed the Samsung race beings out one by one.</p><br/><p>BAM!</p><br/><p>BAM!</p><br/><p>\"DAMN IT! COME ON OUT IF YOU'VE GOT THE GUTS, YOU BEAST! YOUR UTMOST WILL DEFINITELY HAVE YOU KILLED!\"</p><br/><p>Saint was deranged right now. Under the power of the explosion, even that mighty body of his was starting to crack apart despite being imperishable through all the ancient times.</p><br/><p>'Urgh.' At this point, he finally spat out blood.</p><br/><p>To think that the immensely formidable Saint would actually spit out blood under this relentless assault of explosions!</p><br/><p>\"Good disciple! Hand Saint over to this old man! Go and injure Fault by blowing him up!\" Feng Qingzi, who was on even grounds with Fault, suddenly darted before Saint.</p><br/><p>\"F*ck! Old man, this is my prey!\"</p><br/><p>Lin Fan had not expected that even that old man Feng Qingzi would know how to take advantage of a fallen enemy to pulverize him! However, Lin Fan knew that whether or not they could keep these two Utmost Beings here depended on him entirely.</p><br/><p>As the most valuable player on the ground, the pressure on him was immense.</p><br/><p>\"Saint, why did you have to take out the Samsung race beings? Y-you…!\" Fault was enraged at everything that was happening right now as well. The outcome of this battle was all on Saint!</p><br/><p>If he hadn't summoned the Samsung race beings, this wouldn't have happened, as the human wouldn't have had the chance to seize that opportunity!</p><br/><p>However, there was one thing that Fault couldn't get! Why in the world did the Samsung race possess such tremendous self destruction capabilities? Their powers had practically multiplied by many folds!</p><br/><p>Even if it were him who was at the center of the explosion right now, he might not be able to hang on!</p><br/><p>Fault's face was grim right now was he contemplated through things. The situation right now wasn't looking too good.</p><br/><p>\"Fault, your Daddy is coming! Are you ready?\" Lin Fan remained hidden in the Heaven and Earth Smelt as he flew towards Fault along with the smelt.</p><br/><p>After battling with Feng Qingzi up till now, Fault was extremely familiar with the tricks of this lad. There was no way out of this plan of his!</p><br/><p>Pshew!</p><br/><p>Instantly, a bunch of Samsung race beings were tossed over.</p><br/><p>Those Samsung race beings were flushed with bloodshot eyes as they let off a berserk aura, seeming completely insane.</p><br/><p>Fault felt his goosebumps standing all over his back. How would he dare to remain at this place?</p><br/><p>\"Saint, all the best to you!\" Without any hesitation, Fault dove into the void as he made his furious escape.</p><br/><p>He had already thought this through. If he were to be targeted by that damned fella, he might very well end up in the same state as Saint where he was blown into an incomprehensible state.</p><br/><p>If that were the case, escaping was the only true solution out of this.</p><br/><p>There was no way he was going to wait for death along with Saint right here.</p><br/><p>Feng Qingzi and Cruel... Just those two alone would be able to give them a run for their money.</p><br/><p>And that was even before they included that devious being who would throw a bunch of Samsung race beings from time to time.</p><br/><p>\"Holy f*ck! He's running! Don't run! Hurry up and come back so that we can continue fighting for a good 300 rounds!\"</p><br/><p>If Fault wanted to escape, no one could stand in his way.</p><br/><p>\"Disciple, don't bother chasing after him anymore! This is a great opportunity! Let us just suppress Saint entirely!\" Feng Qingzi yelled out excitedly.</p><br/><p>This was a rare opportunity of a lifetime! Other than 10,000 years ago, there had never been another event of someone slaying an Utmost Being!</p><br/><p>When Saint saw how he was surrounded by all sides, he was completely flabbergasted.</p><br/><p>\"Fault…!!!\" Saint grit his teeth tightly. To think that Fault would choose to make his escape at this very moment!</p><br/><p>Pshew! Pshew!</p><br/><p>Right at this moment, something even more chilling for Saint happened.</p><br/><p>Countless Samsung race beings were being tossed out of the Heaven and Earth Smelt at this very instant. They then surrounded him as they formed a circle around him.</p><br/><p>\"Old man, leave this fella to me! You guys go and seal the void around this area! We must definitely not give him the chance to escape!\" Lin Fan remarked.</p><br/><p>\"Alright!\"</p><br/><p>Looking at the dense cluster of Samsung race beings before him, Feng Qingzi felt shivers down his spine for a moment. He knew what this dear disciple of his was going to do.</p><br/><p>At this moment, even he felt sorry for Saint.</p><br/><p>If they were to really self destruct in this group, the outcome would be utterly terrifying.</p><br/>\n</div>"}