{"title": "Chapter 762: I've Got Thousands Of Methods To Kill You", "id": 762, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-762-ive-got-thousands-of-methods-to-kill-you", "volume_title": "Volume 8", "body": "<h1>Chapter 762: I've Got Thousands Of Methods To Kill You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 762: I've Got Thousands Of Methods To Kill You</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan could dare to swear to God that he hadn't obtained any of these things before. At the moment he was slapped into a pile of bloodied meat by Saint, he had completely given up on fighting back.</p><br/><p>But, the weird phenomenon that was happening right now caused him to feel equally startled.</p><br/><p>The moment that life stealing claw of Saint was slapping out, Lin Fan had already given up on defending. All sorts of mystical powers surged through that single claw. However, all of a sudden, a golden ball of light rose up.</p><br/><p>A boundless power pulsed out from it, causing the claw to break apart instantly.</p><br/><p>\"Just what in the world is this thing?\" When Saint sensed this aura, he got really alarmed. There was a bad feeling about this in his heart, as though something was repressing him.</p><br/><p>The golden light gradually dissipated, and it was only then that Lin Fan could clearly make out what it was.</p><br/><p>\"Tadpole sized text words?\"</p><br/><p>All of these tadpole sized text characters twisted and danced around before floating above Lin Fan. He could tell that all of these tadpole sized text characters were really extraordinary, as they gave off a mysterious aura.</p><br/><p>This was an aura that had never been seen before. Yet, it was enough to rattle one's heart.</p><br/><p>\"What's going on? What are you trying to do?\"</p><br/><p>Suddenly, Lin Fan yelped out. His pile of bloodied meat had suddenly started gravitating towards those tadpole sized text characters involuntarily.</p><br/><p>At the same time, those characters started gleaming with a series of godly light before floating up gently and turning into a long dragon that coiled itself around Lin Fan's bloodied meat.</p><br/><p>Lin Fan had initially thought that these mysterious text characters were going to consume his meat. However, all of a sudden, he realized that his powers were actually regenerating!</p><br/><p>Furthermore, there was a really mysterious feeling that was entering his heart.</p><br/><p>All of a sudden, Lin Fan felt himself being immersed deeply into this mysterious sensation.</p><br/><p>\"Damn it! Just what sort of capabilities does an ant like you have again? Your Utmost refuses to believe that I can't suppress you entirely!\" Noticing that Lin Fan's bloodied meat was showing signs of regrouping, Saint flew into a rage and slapped out with both fists instantly, wanting to suppress him down once more.</p><br/><p>Shing!</p><br/><p>All of a sudden, when Saint's powers made contact with those tadpole sized text characters, they started vibrating intensely as though they could contain anything within this world!</p><br/><p>They wanted to absorb these powers!</p><br/><p>\"How could this be? What's going on with these text characters?\" Saint was startled. He could not believe that his own powers would be unable to take down these text characters!</p><br/><p>Saint did not recognize these text characters, neither had he ever seen them before.</p><br/><p>However, the aura that was emanating from them was causing him to tense up.</p><br/><p>At this moment, a single text character started floating up from within the pile. It was contorting and twisting like a spear, a saber, and a dragon. Most common people would not be able to make out what it was at all.</p><br/><p>But, when Lin Fan looked over at first glance, he had a stark feeling that he somehow seemed to recognize these characters.</p><br/><p>\"Attack!\"</p><br/><p>The character that floated up was actually the word for attack!</p><br/><p>This character started swiveling around with a horizontal and vertical stroke. It was just two moves, yet it burst forth with a killing power. With that, the strongest attack between the Heaven and Earth was born just like that.</p><br/><p>Saint's face changed starkly. Even though there didn't seem to be too much on the surface, he could feel an immensely powerful killing intent that was gushing out at him.</p><br/><p>Thud.</p><br/><p>Saint was knocked back as he coughed out fresh blood. His face was alarmed.</p><br/><p>\"How could this be?\" Saint's face was frightened right now, unable to believe everything before his eyes.</p><br/><p>\"Just what in the world are these text characters?! How in the world would they possess such offensive capabilities?\"</p><br/><p>…</p><br/><p>\"Holy f*ck! How ferocious!\" Even though Lin Fan did not know what in the world this was, the fact that a single text character could cause Saint to spit out blood was something that had Lin Fan's heart thumping furiously.</p><br/><p>\"F*ck him! Hurry and f*ck him up!\"</p><br/><p>Lin Fan felt like he was alive once more as his heart was now filled with a boundless hope. While he did not know what this was, as long as it could kill Saint, it must definitely be some good sh*t!</p><br/><p>\"Damn it! Your Utmost refuses to believe that he can't kill you!\"</p><br/><p>Coming out here this time around, Saint could be said to have taken an immensely huge loss. Not only were his Samsung race beings gone, he had even revealed his Ancient Saint Sacrificial Altar.</p><br/><p>And now, if he left without killing this beast, he wouldn't be able to take it lying down!</p><br/><p>\"GO TO HELL!\"</p><br/><p>Saint's eyes were flushed red. As he slapped out with both palms, the Ancient Saint Sacrificial Altar started vibrating violently. A series of light beam gushed up just like banners that bolted out towards Lin Fan to kill him.</p><br/><p>This was the power of the Ancient Saint Sacrificial Altar. An accumulated power over thousands and thousands of years were now entirely gushing out at this moment.</p><br/><p>All of a sudden, yet another text character floated up.</p><br/><p>\"Defend!\"</p><br/><p>It was just a single word, yet it seemed as though the strongest defense between the Heavens and Earth had just been created, such that no attacks could penetrate through it at all!</p><br/><p>BAM!</p><br/><p>The moment the power that gushed forth from the Ancient Saint Sacrificial Altar made contact with this word, it dissipated instantly without a single reaction.</p><br/><p>\"This…!!!\" Saint clutched at his chest and nearly choked on his own breath. This was a blow too huge for him to take in!</p><br/><p>\"HAHA!\"</p><br/><p>Looking at the state Saint was in right now, Lin Fan burst out laughing. This was an opportunity for a comeback! Even though Lin Fan himself was stumped at this comeback method, that didn't matter anymore.</p><br/><p>As long as he could win, nothing else mattered.</p><br/><p>\"Rebirth! Rebirth!\"</p><br/><p>These tadpole sized text characters possessed a boundless power. Under the booster of this power, Lin Fan felt his entire body was surging with power.</p><br/><p>The pile of bloodied meat started fusing back. In a jiffy, Lin Fan was good as before.</p><br/><p>\"How about now? Are you really pissed off now?\" Lin Fan looked at Saint and chuckled. He then flicked out with his finger, \"F*ck him to death!\"</p><br/><p>In Lin Fan's eyes, since these tadpole sized text characters were willing to help him, they should naturally obey his commands as well. However, all of a sudden, Lin Fan stood there awkwardly, realizing that the text characters were just floating in the sky without any intention of moving at all.</p><br/><p>\"What's going on now?\" Lin Fan was stumped, not really understanding this.</p><br/><p>Towards these text characters, Saint was filled with a serious dread. But, when he saw how Lin Fan was unable to control them, he heaved out a sigh of relief. Based on the situation that was displayed earlier on, if these text characters were to strike out, it would definitely be quite troublesome for him.</p><br/><p>\"Ant, you don't seem like you're able to control those text characters.\" Saint smirked out coldly. For him, this was a good thing.</p><br/><p>Lin Fan's face changed. Saint had hit the mark right on the spot. Tons of thoughts were running through his head right now.</p><br/><p>'Ding…Congratulations on activating the Heaven and Earth Sutra.'</p><br/><p>'Heaven and Earth Sutra: The only text characters between the Heaven and Earth. Every single text character possesses a boundless amount of power.'</p><br/><p>At this moment, the notification from the system rang out as Lin Fan's heart tightened. Lin Fan knew of this Heaven and Earth Sutra. This was something that he had obtained a long time ago.</p><br/><p>This was a treasure that had appeared back when he had fused with the right arm of the Ancient One.</p><br/><p>Could all of these be the Heaven and Earth Sutra?</p><br/><p>At this moment, Lin Fan could feel the connection between him and the Heaven and Earth Sutra.</p><br/><p>At the same time, he realized something.</p><br/><p>He finally understood why the Ancient One was killed. It wasn't because the Supreme Being and the others were strong. It was because the Ancient One had been suppressed from the very beginning!</p><br/><p>This Heaven and Earth Sutra possessed an incredible might to it that could repress the powers of the Ancient One! And, it was precisely because of that which allowed the Supreme Being and the others to split up the body parts of the Ancient One!</p><br/><p>Lin Fan looked at Saint and could not help but smirk out. This was a bright and dazzling smirk as though he had just found new land.</p><br/><p>\"Ant, what are you smiling at!\" When Saint caught sight of that detestable smirk from Lin Fan, he barked out.</p><br/><p>\"I'm smiling at the thought of how I'm going to kill you later on! But, it's quite the dilemma, to be honest. I've got a few thousand methods to kill you with. But at this moment, I can't decide which one of them I should use on you.\" Lin Fan gave off a look of helplessness as though he was making a really tough decision right now.</p><br/><p>This feeling that he was having right now was similar to sitting on a rollercoaster. It was scary at times and exhilarating at others.</p><br/><p>To think that being beaten to a pulp of bloodied meat could allow him to activate the Heaven and Earth Sutra! He was just too damned lucky, wasn't he?</p><br/>\n</div>"}