{"title": "Chapter 776: Stepped To Death", "id": 776, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-776-stepped-to-death", "volume_title": "Volume 8", "body": "<h1>Chapter 776: Stepped To Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 776: Stepped To Death</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What's the army here for?\"</p><br/><p>The many merchant convoys here were confused. The Fourteen Sand Bandits had been really law-abiding citizens in their many years in Barren City's vicinity.</p><br/><p>Even though they robbed, they gave back in their own way.</p><br/><p>In the words of some people, the Fourteen Sand Bandits were truly professional and ethical bandits. Their robbing of valuables was only an equivalent of them collecting protection fee!</p><br/><p>In fact, after the Fourteen Sand Bandits made this place their base, some of the other nefarious bandits who had wanted to do harm to the Barren City were blocked out by them!</p><br/><p>And, the most important thing was that the City Master of the Barren City itself had once commended the Fourteen Sand Bandits personally!</p><br/><p>But now that the army was coming down personally, everyone was completely befuddled.</p><br/><p>\"Elder, the base of the Fourteen Sand Bandits is straight up ahead!\" One of the disciples of Jiuling Sect leaned close to a suave and elegant man while he remarked.</p><br/><p>\"Yes. This City Master of the Barren City is absolutely ridiculous. To think that he would dare to say that these bandits here are bandits with morals, and would even dare to term them as the Fourteen Sand Dao Kings! If word of this were to get out, wouldn't this be one hell of a laughing stock?\"</p><br/><p>\"Furthermore, now that the Barren City has already become a colonial city under our Jiuling Sect, if we were to allow the bandits to continue roaming around our colony, wouldn't that be an insult to our Jiuling Sect?\"</p><br/><p>This suave and elegant man did not look any older than in his twenties.</p><br/><p>However, his position was extraordinary, and was an elder of the Jiuling Sect! His cultivation was astounding. Right now, he was already a Greater celestial middle level cultivation state being.</p><br/><p>One fine day three years ago, he was just a man who was accomplished in his cultivation and roaming around the Pugilistic World. Back then, he wasn't a disciple of the Jiuling Sect yet. That day, he met with the Jiuling Female Empress of the Jiuling Sect and immediately recognized her as a divinely being of remarkable beauty. From then on, he submitted to her and wanted to lean closer to her.</p><br/><p>Because of that, he recommended himself to be an elder of the Jiuling Sect.</p><br/><p>However, there was one thing that Feng Wuxiang was helpless about. He was handsome and elegant, and there were countless girls who were intoxicated over his suaveness. Yet, this Jiuling Female Empress couldn't be any colder towards him.</p><br/><p>This was something that Feng Wuxiang could not take lying down. He refused to believe that there was a woman within this world he could not charm.</p><br/><p>Back when he had first met the Jiuling Female Empress, she was still young and looked like a lolita. However, over the past few years, she had matured and grown with an elegant grace and a peerless demeanor. That cold disposition of hers had Feng Wuxiang's heart fluttering even more towards her.</p><br/><p>\"Elder Feng, you are right! I think that the City Master of the Barren City must be colluding with these bandits! Otherwise, why would he speak up for these bandits?\"</p><br/><p>All the disciples surrounded him and fawned while complimenting his words.</p><br/><p>The Jiuling Sect was their asylum. Even though the might of Jiuling Sect could not be comparable to those truly major sects, those major sects somehow would give their Jiuling Female Empress quite a bit of respect. This was something that gave these guys a lot of face.</p><br/><p>When they were outside, as long as they declared their sect, none of the other sects would dare to mess with them.</p><br/><p>\"Yes. The Barren City is now a colonial city of our Jiuling Sect. Once we clear out these bandits in the area of hundred miles around the Barren City, we will head down to the next city. That Saint Devil Sect has already taken down ten cities by now. If we were to fall behind, we are going to be punished.\" Feng Wuxiang commented.</p><br/><p>As a Greater celestial middle level cultivation state being, Feng Wuxiang could be considered as quite powerful in the Xuanhuang World. He wasn't all that weak within the Jiuling Sect as well.</p><br/><p>However, Feng Wuxiang had no idea just what type of background this Jiuling Sect had. Even though he was an elder, he was the weakest out of all the elders!</p><br/><p>All of those people who were around the Jiuling Female Empress were one sicker than the other! Each time he faced them, he would feel as though he was facing some huge mountains.</p><br/><p>That was some crazy pressure!</p><br/><p>\"Elder, check it out! Those bandits are robbing again!\" A disciple before him exclaimed out.</p><br/><p>\"Hmph! Get the whole army out!\" Feng Wuxiang waved out with his hand. \"Today, we shall kill all of these bandits!\"</p><br/><p>All the soldiers of the Barren City did not know what to say any longer.</p><br/><p>How could they not know of the Fourteen Sand Bandits? Their own City Master had always enjoyed chats over wine with the Leader of the Fourteen Sand Bandits personally.</p><br/><p>There was even one time when the City Master wanted to betroth his own daughter in marriage over to the Leader!</p><br/><p>But, after thinking more about it, he knocked off the idea. After all, Sha Dulong was getting a little old now. And, the main point was that he was too ugly.</p><br/><p>Now that this Jiuling Sect and whatnot had taken control over the Barren City, they wanted to engage the entire army and take down the Fourteen Sand Bandits? Were they retarded or what?!</p><br/><p>\"Fourteen Sand Bandits, you guys have committed many grave crimes and have robbed merchant convoys! Today, I, Feng Wuxiang of the Jiuling Sect, shall have all of you killed right here!\" Feng Wuxiang's aura burst forth along with his sharp gaze. The moment he spoke out, it was as though he was standing on the side of the righteousness while he looked down at the Fourteen Sand Bandits.</p><br/><p>\"What's this all about?\"</p><br/><p>\"That's right. What has this got to do with the Jiuling Sect?\"</p><br/><p>\"Everyone, we haven't been robbed at all! And, they're not some crime committing bandits or whatnot either!\"</p><br/><p>The merchant convoys yelled out one after another.</p><br/><p>\"Little doll there, you're quite interesting, aren't you? Our Fourteen Sand Bandits have trodden all over the deserts, and yet, there has never been anyone who had dared to come at us so brazenly.\" Sha Dulong shouted back.</p><br/><p>\"Hmph!\" Feng Wuxiang snorted coldly. He then looked over at the merchant convoys, \"All of you merchant convoys had better leave this place quickly! I'll have you guys know that the blades have no eyes. If you guys were to suffer any losses or anything, you would have asked for it.\"</p><br/><p>\"T-this…!\" All of a sudden, all the merchant convoys did not know what to do any longer.</p><br/><p>Wasn't this one hell of a scam?</p><br/><p>Shopkeeper Li was especially close to puking out blood.</p><br/><p>\"The robbery shall end today. All of you, hurry and leave.\" Sha Dulong frowned. From his point of view, something must have happened to the Barren City. He knew of this Jiuling Sect. But, he hadn't expected them to come knocking for him.</p><br/><p>\"Leader! I-I…!\" Shopkeeper Li was indignant. He was so close to succeeding! How could this happen?</p><br/><p>\"Don't worry. The Fourteen Sand Bandits are a bunch of professional and ethical bandits. Since we've robbed you, we will definitely account for it. Just come back to us next time.\" Sha Dulong remarked.</p><br/><p>\"Leader, I'll hold you accountable to your words!\" Shopkeeper Li was elated.</p><br/><p>\"Sure.\" Sha Dulong nodded his head.</p><br/><p>With the confirmation of Sha Dulong, this bunch of merchant convoys scooted off really far away.</p><br/><p>\"Big brother, these guys aren't weak.\" The masses of the Fourteen Sand Bandits whispered.</p><br/><p>\"Yes. Their aura isn't any bit weaker than ours. It's quite respectable for someone his age to have that type of strength. Let our fellow brothers stay back. This fight isn't something they can handle.\" Sha Dulong said.</p><br/><p>\"Understood.\"</p><br/><p>The only reason why Feng Wuxiang brought all the soldiers was only for a display of might. He did not have any intention of letting them take part in the fight at all.</p><br/><p>After all, in the eyes of Feng Wuxiang, these soldiers were powerless ants. A single breath would be able to blow their existences away. They served no purpose at all.</p><br/><p>\"Fourteen Sand Bandits, surrender now and I can allow you guys to have a dignified death. Otherwise, it'll be a terrible sight if your bodies were to be found lying all torn apart everywhere.\" Feng Wuxiang scoffed coldly.</p><br/><p>\"Don't get all cocky now, you little thing! Back when Granddaddy here made his appearance in the scene, you were still in your mother's womb! Let Granddaddy here teach you a good lesson!\" The short and pygmy Sha Miexiong could take it lying no longer. Wielding his axes, he cleaved out towards Feng Wuxiang instantly.</p><br/><p>\"Hmph! A Lesser celestial full cultivation state being is weak as an ant. You wouldn't be able to take even a single blow.\" Feng Wuxiang laughed coldly. Using his finger as a sword, he drew a line in the void.</p><br/><p>A sharp gleam of light burst forth. Sha Miexiong was taken aback as he used his axes to defend instantly.</p><br/><p>Clang!</p><br/><p>Against this sharp gleam of light, the axe cracked without any resistance at all.</p><br/><p>Thud.</p><br/><p>\"Third Brother…!\" Sha Dulong's face turned grim.</p><br/><p>\"Hahaha! And I thought he might be somebody. Turns out he was so weak! Honestly, the Fourteen Sand Bandits are made up of the ugliest people in the world! A pygmy dwarf, a blind bat, a mute... And look at that incredibly fat fella over there! If I didn't take a closer look, I might have thought that it was a pig right there!\"</p><br/><p>\"If you guys were to compare yourselves to me, wouldn't you guys feel inferior about your own appearances?\"</p><br/><p>Feng Wuxiang mocked them mercilessly. He couldn't be bothered about Sha Dulong and the others at all.</p><br/><p>\"HAHAHA…!\"</p><br/><p>All the other disciples of the Jiuling Sect burst out laughing.</p><br/><p>The soldiers of the Barren City were astounded at this sight before them. To think that this fella from the Jiuling Sect would be this strong!</p><br/><p>They knew of the strength of the Fourteen Sand Bandits. Initially, they were just waiting to see the Fourteen Sand Bandits teach this fella a lesson. To think that this elder from the Jiuling Sect would be this strong that he could send the third Leader of the Fourteen Sand Bandits puking out blood with a single hit!</p><br/><p>\"You guys can come at me together. Otherwise, don't come blaming me, Feng Wuxiang, for not giving you guys any chances.\" Feng Wuxiang swept his robes and taunted overbearingly.</p><br/><p>Instantly, a tremendous aura burst forth from Feng Wuxiang.</p><br/><p>Behind Feng Wuxiang, the powers of the Heaven and Earth flashed intermittently.</p><br/><p>\"Good lad, your Granddaddy here shall teach you a lesson!\" Sha Dulong roared out as the True Energy within his body surged up while he lunged at Feng Wuxiang with a punch.</p><br/><p>\"Oho! Greater celestial middle level cultivation state being? That's some decent strength there that's equivalent to me. But it's a pity…\" Feng Wuxiang's eyes shone with a glint as he opened his palms wide, causing a series of True Energy to start rumbling.</p><br/><p>Sha Dulong could feel that berserk True Energy as his face changed entirely. He felt as though his True Energy was being controlled by the other party instead of himself!</p><br/><p>Piak!</p><br/><p>Instantly, Sha Dulong lost and was trampled down by the other party's feet.</p><br/><p>\"But, it's a pity that the difference between you and me is as great as the Heaven and Earth itself.\" At this moment, Feng Wuxiang was just like a heavenly deity who had descended upon the world.</p><br/><p>The disciples of the Jiuling Sect looked at Feng Wuxiang with reverence. Such tyrannical power he possessed! What Fourteen Sand Bandits and whatnot? They were taken down in a single attack of his!</p><br/><p>The soldiers of the Barren City yelped out with a face of disbelief.</p><br/><p>\"Big brother!\" Looking at how Sha Dulong was being stepped on by the other party, the members of the Fourteen Sand Bandits were riled.</p><br/><p>\"Run! You guys are no match for him!\" Sha Dulong bellowed out. Now that he was being trampled down by the other party, he felt as though his True Energy had been sealed up. There was no way for him to fight back at all.</p><br/><p>\"HAHA! When I detain you back to the Barren City, I'll chop off your head and hang it on the gates of the city. With that, you will serve as a warning for the masses. As for all these underlings of yours, there's no need for them to exist any longer.\"</p><br/><p>Feng Wuxiang laughed out coldly as his killing intent flashed out. A heaven piercing Sword Will rose up from the ground. Waving his hand, the entire voids seemed as though they were being sliced up.</p><br/><p>\"STOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOP!\" The moment Sha Dulong saw this, he screamed out with a broken heart.</p><br/><p>He had not expected his defeat to come so quickly that he didn't even have time to react at all!</p><br/><p>For the Fourteen Sand Bandits, this chilling sword was something they couldn't defend against at all. They could feel the blood within their bodies freezing up as though they were sealed.</p><br/><p>SHING!</p><br/><p>Sha Dulong shut his eyes in unbearable pain. He could not bear to watch this. To think that things would turn out as such!</p><br/><p>But just at this moment, a voice rang out.</p><br/><p>\"To think that you would dare to touch my men as well. Seems like you're hopeless.\"</p><br/><p>This voice was extremely calm and carried neither joy nor sadness.</p><br/><p>The moment Lin Fan arrived here, he did not expect to see Sha Dulong and the others being overwhelmed. Where was he to put his face like this? No matter what, these guys had once spent some time with him! Now that they were being walloped as such, wasn't this just throwing away his face?</p><br/><p>Lin Fan stood upright on the head of Feng Wuxiang, and then pushed gently. With that, a massive amount of power burst forth as the ground began to crack.</p><br/><p>Instantly, Feng Wuxiang's entire body sank into the ground all the way up to his head.</p><br/><p>Lin Fan raised his head gently before stepping down once more.</p><br/><p>BAM!</p><br/><p>A loud explosion boomed out. The ground cracked all the way out as deep cracks extended all the way out till the boundaries of the world.</p><br/><p>'Ding…Congratulations on killing…'</p><br/><p>\"Hais! Seems like yet another genius was stepped to death by me. Sha Dulong, you guys are really disgracing me, aren't you?\" Lin Fan stood there with a face of helplessness.</p><br/><p>Instantly, time seemed to have been frozen in this world.</p><br/><p>All the disciples of the Jiuling Sect were flabbergasted right now. As for the Fourteen Sand Bandits, this familiar voice… this figure…!!!</p><br/><p>When Sha Dulong gently raised his head, he looked over and saw a familiar yet foreign figure, with his long hair breezing with the wind. He couldn't help but start shivering emotionally.</p><br/>\n</div>"}