{"title": "Chapter 796: Everything Makes Sense Now", "id": 796, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-796-everything-makes-sense-now", "volume_title": "Volume 8", "body": "<h1>Chapter 796: Everything Makes Sense Now</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 796: Everything Makes Sense Now</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Hehe!\"</p><br/><p>At this moment, Wang Xiaoming was looking gleeful as he cast his sights on the senior sister at the side. He scooped up his hands, looking exceptionally creepy right now.</p><br/><p>\"Don't come over!\"</p><br/><p>\"Junior brother, save me!\"</p><br/><p>The face of the senior sister was pale right now. She had not expected that not only was this person greedy, he was also lustful towards her!</p><br/><p>\"Chick, don't you worry now. Your Young Master here will definitely not do anything much to you. Your Young Master is a man who knows how to cherish beauties!\" Wang Xiaoming sniggered out eerily.</p><br/><p>\"You dogsh*t! Don't you dare touch my senior sister!\" Yu Fei roared out. He hadn't expected that this degenerate would try to take advantage of his senior sister! Instantly, he felt a burning rage surge within his heart. He wanted to fight with his life against this guy!</p><br/><p>\"Damn it! It's all my fault that I'm too weak! Otherwise, how would something as such happen!?\"</p><br/><p>\"Power! I want power!\"</p><br/><p>\"I, Yu Fei, have already reached a cultivation state in just four months where mere commoners wouldn't be able to reach in their entire lifetimes! If only I could get two more months, I would be able to whack the sh*t out of this b*stard!\"</p><br/><p>Yu Fei was indignant right now. He was the slave of a big family. However, in order to accompany his Young Master, he followed him to join a sect.</p><br/><p>Upon arriving at the sect, Yu Fei discovered that he had a natural familiarity towards all the skills that he could see. It was as though all of these skills were things that he had once cultivated before!</p><br/><p>In fact, when he looked at the average skills, he could even replicate their moves almost instantly.</p><br/><p>With his heaven defying ability, Yu Fei's speed of cultivation was exceptionally fast. He soon became an existence that most mere commoners would look up to!</p><br/><p>From there on, he was elevated from the status of a slave into one of the disciples of the sect.</p><br/><p>Yu Fei gripped his hands tightly and pounded the ground, as those bloodshot eyes of his glared at Wang Xiaoming with a devastating hatred. His throat even started letting out a sound of growling like that of a wild beast.</p><br/><p>The nearer this degenerate got to his senior sister, the more Yu Fei felt as though his heart was about to break down. He wanted to go all out against the degenerate. However, his body was afflicted by the blows dealt by the other party. The pain in his groin area was especially unbearable.</p><br/><p>One should depend on oneself rather than others. It was this very ideology that Yu Fei had always believed in. This was especially the moment for him to believe in it.</p><br/><p>\"DEGENERATE! IF YOU DARE TO TOUCH MY SENIOR SISTER, I, YU FEI, SWEAR UPON MY NAME THAT I WILL MAKE SURE I TEAR YOUR CORPSE UP INTO SHREDS!\" Yu Fei bellowed out.</p><br/><p>\"Hehe… Lad, don't bear such hatred towards me now! Your Young Master here is not someone like that! However, since your senior sister here looks pretty decent, Your Young Master will just toy with her a little here and there. I will definitely not go overboard, okay?\" Wang Xiaoming chuckled out.</p><br/><p>Lin Fan, who had been observing Wang Xiaoming, found himself speechless at this very scene.</p><br/><p>This lad was really quite the troublemaker! Even though this lad would definitely not do something overly savage, his way of toying would definitely include a few light spankings on the buttocks and some light patting of her cheeks. That's for sure.</p><br/><p>If this were to carry on, it was hard to say that the Yu Fei lad wouldn't veer down the path of evil because of it!</p><br/><p>Seemed like it was truly a wise choice for him to have the Heaven's Will keep an eye on Wang Xiaoming from time to time.</p><br/><p>Just as Lin Fan was prepared to have the Heaven's Will strike down with a thunderbolt, he paused suddenly.</p><br/><p>\"Eh? This is…\"</p><br/><p>Lin Fan's eyes sparkled. He had suddenly realized that Wang Xiaoming's body was giving off a strange aura. This aura was extremely imperceptible. If one hadn't been observing keenly, they wouldn't be able to tell at all.</p><br/><p>Since Lin Fan was someone who had fused with the Heaven's Will of the Xuanhuang World, every single mysterious thing, such as the fortunes of the world, could not escape the eyes of Lin Fan at all.</p><br/><p>\"ARGH!\"</p><br/><p>All of a sudden, a weird phenomenon broke out.</p><br/><p>With a maddened roar, the aura of Yu Fei suddenly rocketed up. That single roar was earthshattering and rattled one's hearts.</p><br/><p>\"DEGENERATE! GO TO HELL!\"</p><br/><p>At this moment, Yu Fei suddenly bolted out towards Wang Xiaoming with his fist through a weird path. It was as though he was suddenly filled with power!</p><br/><p>\"Lad, your strength is way too…\"</p><br/><p>Wang Xiaoming had wanted to say something when he noticed that there was something wrong with this fist now! He had a feeling that he wouldn't be able to block this!</p><br/><p>BAM!</p><br/><p>\"H-how could this be?\"</p><br/><p>This punch of power unfurled before Wang Xiaoming as he tried using both his hands to defend. However, just like a bullet, he was sent bolting off in a whizz.</p><br/><p>The Bone Cleansing Pills in his hands flew up into the sky as well. Turning around swiftly, Yu Fei caught the Bone Cleansing Pills in his hands.</p><br/><p>\"Senior sister, let's go.\"</p><br/><p>At this moment, Yu Fei had just burst forth a power so tremendous that even he himself was shocked by it. However, this was no time for him to be startled as he immediately grabbed his senior sister and left this place instantly.</p><br/><p>\"You dogsh*t! You had better wait! I, Yu Fei, will definitely kill you one day before I'm dead! I'll tear your body apart!\"</p><br/><p>\"F*ck! He can even run like that!\" Wang Xiaoming stood up and patted his clothes. When he raised his head, he realized that his prey had long disappeared.</p><br/><p>…</p><br/><p>\"Interesting. This is interesting indeed!\"</p><br/><p>Lin Fan was taken aback. He hadn't expected that there would be a change as such!</p><br/><p>Naturally, he could tell that this Yu Fei's cultivation state wasn't all that high, because it hadn't been long since he started cultivating. But, to think that he would be able to escape from Wang Xiaoming's grasp.</p><br/><p>And the power of that fist that was sent out in the last moment was something that went beyond Yu Fei's very own capabilities!</p><br/><p>\"HAHA! I get it now! I finally understand!</p><br/><p>After pondering for a moment, Lin Fan reared his head into the skies and burst out laughing. He had finally understood what all of this were about!</p><br/><p>Wang Xiaoming had the Eternally Hated Body of the Destined Child. Therefore, all the people he would meet with were the Destined Children of the world.</p><br/><p>And at these critical moments, Wang Xiaoming's special body type would activate, allowing his opponents' to transcend his very own powers.</p><br/><p>In the eyes of Yu Fei, Wang Xiaoming was the final BOSS that would accompany him for life! Even though Wang Xiaoming's strength was much stronger than Yu Fei, he would definitely not be able to kill Yu Fei no matter what.</p><br/><p>And at the very last moment, Wang Xiaoming would then be killed by Yu Fei, who would then grow into a supremely unparalleled powerful being.</p><br/><p>\"If it's really as I have guessed, then things would really get fun!\"</p><br/><p>Lin Fan wasn't too certain about the facts right now. But in order to verify his hypothesis, he would have to persevere down this path.</p><br/><p>Multiple days later…</p><br/><p>Wang Xiaoming bumped into another person once again.</p><br/><p>This time around, the person's cultivation state was way higher than Wang Xiaoming's. At the start, Lin Fan thought that Wang Xiaoming would definitely be walloped to a dog by the other party. But surprisingly, Wang Xiaoming had not only escaped, he even f*cked the other guy up big time!</p><br/><p>The embarrassment of the other party turned into anger as he was extremely frustrated. He swore that he would definitely kill Wang Xiaoming in his lifetime!</p><br/><p>\"Seems like my guess was right! Everyone Wang Xiaoming meets, be it weaklings or powerful beings, they would definitely bear a deep hatred towards him and take him as the foe of a lifetime!\"</p><br/><p>A few days later, Wang Xiaoming bumped into Yu Fei once more. This time around, Yu Fei made it out all the same, and had even caused Wang Xiaoming to lose quite a number of objects.</p><br/><p>\"Seems like that's really the case!\"</p><br/><p>\"So, all of these so-called Destined Children are grown and fed by people like Wang Xiaoming!\"</p><br/><p>Lin Fan had already proven the theory in his heart. However, he felt pretty sad for Wang Xiaoming's life.</p><br/><p>This special body type could be said to be both sick and sad.</p><br/><p>To put it simply, Wang Xiaoming would always be the whetstone for somebody out there. And when the knife was finally sharp enough from being honed, it would mean that Wang Xiaoming's death would have arrived as well.</p><br/><p>However, none of that mattered. As long as Lin Fan was around, he would never ever let Wang Xiaoming die.</p><br/><p>At this moment, Wang Xiaoming did not feel anything different or off. All he felt was that life was simply way too interesting.</p><br/><p>When he had first left the Wang Family, he was a little unhappy. But after experiencing everything, he could not help but feel his spirits being lifted.</p><br/><p>Interesting! Life was way too interesting right now!</p><br/>\n</div>"}