{"title": "Chapter 799: Creator", "id": 799, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-799-creator", "volume_title": "Volume 8", "body": "<h1>Chapter 799: Creator</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 799: Creator</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Within Lin Fan's Inner World…</p><br/><p>Lin Fan realized that his Inner World had changed somewhat. It looked like a galaxy right now, with two spherical balls revolving around it, maintaining a fixed distance and revolution speed.</p><br/><p>Each time they revolved once, Lin Fan could feel a surge of power gushing out and entering his body.</p><br/><p>After cultivating the Xuanhuang World, he felt as though every single thing that happened within the Xuanhuang World itself was embedded within his senses.</p><br/><p>At the same time, those countless of light beams that were planted on the Xuanhuang World were connected to a multitude of other worlds.</p><br/><p>However, even if Lin Fan wanted to cross over to the other worlds, he did not have the capability to do so. It seemed as though these beams had been restricted by something that didn't allow him to pass through at all.</p><br/><p>Among these beams of lights, there was a single light that was cut cleanly apart by some sort of a mystical force, blocking its path forward entirely.</p><br/><p>\"Seems like this must be the path to the Ancient Saint World.\"</p><br/><p>Right now, Lin Fan was the Xuanhuang World, and the Xuanhuang World was something in Lin Fan's possession.</p><br/><p>At this point, any single action made by Lin Fan had an incredible amount of power associated with it. This was the power of the world. With the entire Xuanhuang World boosting him on, Lin Fan's powers were pushed to yet another new peak.</p><br/><p>'Ding…Congratulations on cultivating Xuanhuang World.'</p><br/><p>'Ding…Congratulations on unlocking function of the thousands of worlds.'</p><br/><p>'Ding…Title of Creator activated.'</p><br/><p>'Title: Creator. This is the strongest title. Requires cultivation of a fixed number from amongst the thousands of worlds: (1/1000).'</p><br/><p>After cultivating the Xuanhuang World, Lin Fan truly did not expect that he would somehow activate some unknown title all of a sudden. What in the world was up with this Creator and all? This got Lin Fan extremely confused.</p><br/><p>However, by the looks of it, it did seem like it was pretty darn strong.</p><br/><p>But just as Lin Fan thought that it was all over, something even more shocking happened.</p><br/><p>'Creator: Xuanhuang World.'</p><br/><p>'Hundred Years in a Single Thought: Requires ten trillion Shengyang Pills.'</p><br/><p>'Precious Treasure descended from the Heavens: Requires ten trillion Shengyang Pills.'</p><br/><p>…</p><br/><p>When Lin Fan caught sight of everything, he was completely dumbstruck. For a moment or so, he truly could not snap back to his senses.</p><br/><p>At that moment, Lin Fan chuckled out. It was a bright and happy chuckle. He had finally understood. This was Cheat Mode on! And, if he wanted to activate a Cheat, he would have to have Shengyang Pills!</p><br/><p>Burning up ten trillion Shengyang Pills could allow him to cause hundred years to pass by within the Xuanhuang World with just a single thought of his.</p><br/><p>And that Precious Treasure descended from the Heavens and whatnot, wasn't that something that would just increase the amount of treasures within all the secret grounds in the Xuanhuang World?</p><br/><p>Seemed like this title of Creator truly lived up to its name!</p><br/><p>With a single move, he could allow the power of that world to grow and increase his own strength!</p><br/><p>It was just that this title of Creator had yet to be activated fully. To do that would require a thousand from amongst the thousands of worlds.</p><br/><p>In Lin Fan's opinion, this was way harder than hard. This wasn't anything simple to achieve at all!</p><br/><p>But to Lin Fan, this was also a form of hope. As long as he fulfilled the requirements, there wasn't anything he couldn't do. While ten trillion Shengyang Pills might seem like a scary number, as long as he could obtain the Shengyang Pills, Xuanhuang World could undergo a phenomenal change.</p><br/><p>And a change like that was definitely going to be unusually heaven defying. With that, Lin Fan's heart bubbled with an infinite hope.</p><br/><p>This was especially the case for Hundred Years in A Single Thought. This was something that Lin Fan felt was the most important ever. Right now, the opening of the Infinite Worlds was imminent. For the masses of the Xuanhuang World, what they lacked was precisely time.</p><br/><p>If he could give Xuanhuang World a hundred years, the extent to which the geniuses of the Xuanhuang World would grow was something that even Lin Fan could not imagine.</p><br/><p>\"The system lives up to its name indeed. To think that it would open up the Cheat Mode to a certain extent. Honestly, this is just unlawful!\" Lin Fan chuckled out in his heart. This feeling was simply way too great.</p><br/><p>Xuanhuang World…</p><br/><p>Seeing all of these phenomenal changes in the world, the masses were filled with an immense fear. Just as everyone thought that doomsday was upon them, they realized that the skies had started clearing. Those initially sinister grim skies started turning bright once more.</p><br/><p>All of the weird phenomena disappeared entirely.</p><br/><p>For any normal being of the Human race, this feeling was as though they were just given a new lease of life. It allowed them to see a renewed hope towards the future.</p><br/><p>\"Master, you have already cultivated the Xuanhuang World. From now on, with a single thought of yours, everything inside the Xuanhuang World shall be within your control.\"</p><br/><p>The Heaven's Will, who had now discarded all Seven Emotions and Six Worldly Desires, floated gently before Lin Fan.</p><br/><p>Right now, the Heaven's Will had discarded all emotions and was truly without a single trace of the Seven Emotions and Six Worldly Desires. There were no feelings or sadness in it. From here on forth, it would only serve as the foundation for Lin Fan's will.</p><br/><p>And if one day, Lin Fan were to order for the Heaven's Will to destroy the entire world, it would obey unconditionally, without any hesitation.</p><br/><p>\"There is a seal that exists within the Xuanhuang World. Only, I do not know who it was who could have set up this seal. The power held by it is unimaginable.\"</p><br/><p>Lin Fan was in slight disbelief right now.</p><br/><p>Given his current cultivation state, any seal should come before him as a piece of paper tiger. But, who would have thought that the seal of the Xuanhuang World would leave Lin Fan helpless against it?</p><br/><p>In fact, he could even receive an immense countereffect by trying to forcefully remove it. If not for the fact that his physical body state was so strong, he might have even been killed by that power.</p><br/><p>Lin Fan was starting to feel that this world getting more and more mysterious. With just this seal alone, Lin Fan could tell that the Xuanhuang World was one of the strongest existences ever.</p><br/><p>Even if it were the Heaven's Will of the Ancient Saint World, it was nowhere as mysterious as this seal.</p><br/><p>And based on the current situation, if he wanted to remove this seal, he should most likely be at least a Divine celestial level 10, Eternal God state being.</p><br/><p>Given Lin Fan's current strength, as long as it wasn't a powerful being who had attained an Eternal God Seat, Lin Fan could f*ck any Divine celestial level 10 cultivation state being over and over. But, to think that this seal would cause him to get stuck here. This was something that had Lin Fan's nuts hurting over it.</p><br/><p>\"The seal at the core was something that I had once tried destroying as well. However, it all ended in failure. But, I've slowly discovered that this seal isn't all that bad of a thing either. It seems as though it's resisting some incredible existence.\"</p><br/><p>The Heaven's Will had gained control over the Xuanhuang World for a long time now. As such, it had naturally attempted to release the core from the seal before. He was extremely clear about the changes in it. However, the power of this seal was something that had far exceeded his expectations.</p><br/><p>Furthermore, given the Heaven's Will's current strength, there's absolutely no way it could release the seal at all.</p><br/><p>\"Forget it. Since that's the case, we'll let it continue as such then.\" Lin Fan was magnanimous. This didn't bother him at all.</p><br/><p>Once his strength was increased to a certain extent, all of these doubts would be cleared up.</p><br/><p>\"Seems like that is the only way then. Your Paradise is extremely strong, Master. If we can fuse it together, the Xuanhuang World will grow even stronger.\"</p><br/><p>The Heaven's Will could sense that the Paradise within Lin Fan's Inner World possessed a boundless amount of power.</p><br/><p>\"Yes. It'd naturally be good if we can fuse them together.\"</p><br/><p>While incomparable to the Xuanhuang World, Lin Fan's Paradise could be considered as a world of its own. There were countless living beings that were all born from that Utmost Treasure of the Paradise.</p><br/><p>And, if he wanted to breed all of the living beings from that Utmost Treasure of the Paradise, the amount of Shengyang Pills he required would be astronomical.</p><br/><p>Lin Fan was extremely poor right now. He only had half a trillion Shengyang Pills left.</p><br/><p>If he could have enough Shengyang Pills, Lin Fan's powers could reach an extremely terrifying state.</p><br/><p>However, stuff like this was something Lin Fan did not put to heart at all.</p><br/><p>Wasn't it just Shengyang Pills? As long as he could kill enough Utmost Beings of the Ancient race, he could obtain more Shengyang Pills.</p><br/><p>Furthermore, the fusion of the Xuanhuang World and his Paradise might cause an automatic change, allowing the Utmost Treasure of his Paradise to start manifesting more living beings.</p><br/><p>For Lin Fan, that was of imperative importance.</p><br/><p>However, all of that would require time.</p><br/>\n</div>"}