{"title": "Chapter 790: Great Change In Attitude", "id": 790, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-790-great-change-in-attitude", "volume_title": "Volume 8", "body": "<h1>Chapter 790: Great Change In Attitude</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 790: Great Change In Attitude</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>At this moment, everyone from the top to the bottom of the Han Family was in shock. They were no fools. They knew that the scene they had just witnessed moments earlier was just way too sick!</p><br/><p>Wielding control over the Heavens, making it snow on his whim…Creating life from snow…</p><br/><p>These were things never seen or heard before!</p><br/><p>\"Why aren't you talking now? Didn't you wish to see Yours Truly? And now that Yours Truly is here, you've gone all quiet now.\"</p><br/><p>Towards this Han Family, Lin Fan truly did not have the intention of doing anything much. No matter what, this Han Family was chosen by his disciple himself.</p><br/><p>Given his Greater celestial lower level cultivation state, it would naturally not be an issue for him to want to leave the Han Family. However, Zhu You chose to stay on his own accord. One side was willing to endure the insults while the other side rained down the insults. There was nothing to be said about this.</p><br/><p>However, no matter what, Lin Fan still had to regain some face for his disciple. Otherwise, he would have endured years of bullying for nothing.</p><br/><p>The face of the Han Family Head took on a stark change. All of a sudden, he was all smiles now, \"Senior, it's a misunderstanding! This is just a misunderstanding!\"</p><br/><p>Immediately, the Han Family Head stood up and rushed to Lin Fan's side.</p><br/><p>At the same time, the Han Family Head was feeling really terrible right now in his heart. 'Zhu Di, if you had such a strong teacher, why didn't you work harder at proving this to us?' While it would be difficult for us to believe you, we wouldn't choose not to believe you if you had been more serious as well!'</p><br/><p>Back when the Han Family Head had agreed to let his daughter marry Zhu Di, it was mainly because of the fact that Zhu Di had a teacher.</p><br/><p>His daughter had once told him that Zhu Di had a teacher, a teacher who was extremely powerful. His powers were beyond ordinarily powerful.</p><br/><p>With that, the Han Family Head bore an agenda. If that were truly the case, wouldn't his Han Family gain an even stronger backing by then?</p><br/><p>And furthermore, the relationship of his daughter with this man was getting a little out of hand as well. Since that was the case, the Han Family Head took the initiative and just married off his own daughter straight.</p><br/><p>But as things progressed, the Han Family Head started to realize that things weren't right at times. Did Zhu Di really even have a teacher? This guy didn't even appear at Zhu Di's day of wedding! For the Han Family Head, this didn't sound too credible all of a sudden.</p><br/><p>And later on, his embarrassment turned into anger as he worked himself into a rage. He felt that he was cheated. If Zhu Di truly had a powerful teacher as mentioned, how could that guy not appear at the wedding day of his very own student?</p><br/><p>Therefore, the Han Family Head got ever angrier each time he thought about it. Not only did he lose a daughter, he gained nothing in return! With that, he had never treated Zhu Di with respect ever since.</p><br/><p>\"Ohhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh! Misunderstanding?\" Lin Fan raised one side of his brow and gave a long, implying reply.</p><br/><p>\"Senior… It's truly a misunderstanding! Even though Zhu Di is my son-in-law, he's as good as my son! And the reason for marrying down my daughter to Zhu Di is because I took a liking to him!\"</p><br/><p>The Han Family Head explained hurriedly as his inner heart thumped furiously. He hadn't expected that everything that Zhu Di had said was all real! He truly had such a powerful teacher!</p><br/><p>If he had long known that this was the case, he wouldn't have dared to act so brazenly even if he had ten guts to him! He would even fawn over Zhu Di like he was a treasure!</p><br/><p>How could he possibly have Zhu Di get wronged as such?</p><br/><p>\"Marry downnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn?\" Lin Fan furrowed his brows, acting like he was displeased.</p><br/><p>The Han Family Head's face froze as that old face of his turned pale. He had realized that he blurted out the wrong thing by accident!</p><br/><p>\"N-no! I meant marry up! Marry up!\"</p><br/><p>Everyone from the Han Family lowered their heads at this moment. They had mocked and insulted Zhu Di earlier on as well, but right now, they were all shutting up.</p><br/><p>At the same time, they felt their hearts shivering. The Han Family Head would definitely not have anything happening to him since he had a daughter to back him up! But, if Zhu Di were to complain pitifully to his teacher about all the grievances he had suffered all these years, then they could very well be punished!</p><br/><p>Han Lei looked at the way her own father was so scared, and did not even know whether to laugh or to get angry.</p><br/><p>How could her own father behave as such?</p><br/><p>\"Aiyoh! My dear good son-in-law, it's your father-in-law's temper that's not good! I hope that you don't put it to heart!\" The Han Family Head came over to the side of Zhu Di and patted the latter's palm sincerely and earnestly.</p><br/><p>\"I've only got one dear daughter! Naturally, I would wish that she didn't marry the wrong man! Even though I may have been slightly harsher with you normally, it's all for your own good! Perhaps the way I've presented myself may have been wrong as a father-in-law, but I'm sure you won't hold it against me, right?\"</p><br/><p>The Han Family Head was like a changed man right now. From the way he spoke to the expression on his face, everything had changed entirely.</p><br/><p>He was all amicable and kind right now.</p><br/><p>Zhu Di was finding it a little hard to adapt to the sudden changes in the attitude of the Han Family Head.</p><br/><p>\"I wouldn't dare to.\" No matter what, the Han Family Head was Zhu Di's father-in-law. He would naturally help him retain some face.</p><br/><p>\"Oh! It's good that you don't hold it against me! Once I reach the age of hundred, I've still got to entrust the mantle of the Han Family into your hands…!\"</p><br/><p>…</p><br/><p>Looking at the expression on her father's face, Han Lei's heart softened. She then looked at Zhu Di. When he caught sight of Han Lei's gaze, he understood what he had to do immediately.</p><br/><p>\"Teacher, my father-in-law has treated Lei'er and me nicely. Please let this matter be over.\"</p><br/><p>Zhu Di knew the temper of his Teacher, it was short to the extreme. If this were to drag on, things would definitely be bad for the Han Family.</p><br/><p>However, the most he could do was to plead for them, that was all.</p><br/><p>\"Since you said that, this will be the end of it then.\" Lin Fan replied.</p><br/><p>This was a family affair of Zhu Di no matter what. Whether or not the Han Family Head treated him nicely, it didn't matter to Lin Fan. After all, with Lin Fan's repressive presence, even if he didn't want to treat Zhu Di nicely, he would have to, unless he was tired of living.</p><br/><p>The moment the Han Family Head heard this, he heaved out a sigh of relief.</p><br/><p>That two moves of Lin Fan had already rattled the entire Han Family. If they were to anger this guy, it would definitely be a tragedy!</p><br/><p>\"Alright! Zhu Di, come with your teacher to look for your other student brothers.\" Now that this was settled today, Zhu Di would definitely not come across any difficulties in the Han Family in the future.</p><br/><p>\"Yes.\" Zhu Di replied.</p><br/><p>After that, Zhu Di settled down Han Lei and left with Lin Fan.</p><br/><p>The moment Lin Fan left, the Han Family Head collapsed down onto the ground with a thud and breathed heavily as though he could not handle such an intense pressure any longer.</p><br/><p>\"To think that Zhu Di's teacher would be this strong!\" The Han Family Head gasped out in rejoice.</p><br/><p>\"Father, I've long told you that the teacher of my husband is extremely strong. The reason why he hadn't appeared in the past five years was because he had ascended up into the Upper World.\" Han Lei could finally put down a huge piece of rock in her heart as well.</p><br/><p>\"Ascended…?\"</p><br/><p>The moment the Han Family Head heard this, he hated himself in his heart. Why hadn't he chosen to believe this in the past? If he had, how could something as such possibly happen?</p><br/><p>He would have long tried to build a good and lasting relationship with this son-in-law of his. The result of it by now would have been unthinkable!</p><br/><p>But now that the Han Family Head thought about it, it wasn't too late to start building it up now. Han Lei was his own daughter and Zhu Di was his son-in-law. These were facts that even the Heavens could not deny.</p><br/><p>\"Alright! So, we're going to go all out on building ourselves up and progressing from now on. If we were to meet with any issues we can't resolve, do you think this son-in-law of mine can help to settle it? And even if this son-in-law can't deal with it, we can then look for his teacher for help, right?\"</p><br/><p>\"Father, stop imagining things. Zhu Di's teacher does not like unnecessary fuss, nor does he like to commit evil.\" Han Lei replied.</p><br/><p>\"Daughter, how is your father imagining things? Alright, that's that now. I've got to go accompany this granddaughter of mine now!\"</p><br/><p>Han Lei looked at everything before her. Even though she knew that this was all because of Zhu Di's teacher, she felt satisfied with the outcome as well.</p><br/><p>…</p><br/><p>\"Zhu Di, it's not that your teacher here wants to berate you. But, for you to live till such a state as a man, it's really quite something.\" Within his Paradise, Lin Fan spoke out.</p><br/><p>Zhu Di shrugged his head, expressing his embarrassment.</p><br/><p>\"Teacher, I couldn't have done anything.\"</p><br/><p>\"Hais! Alright, we'll leave it at that. Go and accompany Tianjiao. That kid has been through a lot and has now turned despondent. We've got to help him walk out of this mental turmoil of his.\" Lin Fan said.</p><br/><p>…</p><br/>\n</div>"}