{"title": "Chapter 792: This Isn't A Simple Fart!", "id": 792, "volume": 8, "url": "http://boxnovel.org/the-strongest-system-chapter-792-this-isnt-a-simple-fart", "volume_title": "Volume 8", "body": "<h1>Chapter 792: This Isn't A Simple Fart!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 792: This Isn't A Simple Fart!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p> \"Young Master, where are we preparing to head out for fun these days?\"</p><br/><p>Within the yard of the largest mansion in the Yao Family at this moment, a young man laid there in a carefree manner. He was being massaged by several female attendants at this moment.</p><br/><p>Beside him, Da Ha, Er Ha, and San Ha stood while looking at their Young Master respectfully.</p><br/><p>During that act back then, they had performed seamlessly. And it was exactly because of that that their Young Master was bluffed for two whole years. That caused their Young Master to have to endure quite a bit of suffering outside.</p><br/><p>And when their Young Master returned home for revenge, he found out that the three of them were living a splendid life. At that moment, he was entirely taken aback for a moment or so.</p><br/><p>After numerous explanations, Yao Wuxie could only sigh out with a face of helplessness, indicating that since things had already happened as such, what could he do about it?</p><br/><p>\"San Ha, why are you still calling him Young Master? You've got to call him Sixth Master now!\" Da Ha warned San Ha.</p><br/><p>\"Doesn't matter. We're family. What's the difference?\" Yao Wuxie waved his hand dismissively, unbothered by it in the least bit.</p><br/><p>The current Family Head of the Yao Family was the big brother of Yao Wuxie.</p><br/><p>However, Yao Wuxie was no longer someone hated in the Yao Family. The reason why the Yao Family could do so well and flourish had a lot to do with him after all.</p><br/><p>Yao Wuxie was a renowned powerful being within the Xuanhuang World right now. There was no one who would dare to act insolently against him.</p><br/><p>In fact, there were even many big families that wanted to marry off their daughters to Yao Wuxie, so that they could tie some strings with the Yao Family. However, for Yao Wuxie, these chicks were way too lowly. At the same time, he didn't want to be tied down by women.</p><br/><p>\"Sixth Brother! Help me! Help me!!!\"</p><br/><p>At this moment, a hurried cry rang out from outside. He saw a figure rushing in anxiously.</p><br/><p>\"Third Master!\"</p><br/><p>When Da Ha and the others caught sight of who it was, they greeted him respectfully.</p><br/><p>\"Third Brother, what's the issue that has you panicking as such?\" Yao Wuxie asked in a calm voice.</p><br/><p>In the past, those five brothers of his would come and whack him for no reason from time to time. However, Yao Wuxie had long let go of the unhappiness in the past, and had allowed everything to start afresh.</p><br/><p>And right now, these five brothers of his were extremely loving and doting towards him. This had Yao Wuxie feeling the true warmth of family.</p><br/><p>\"Sixth Brother, you've got to help your Third Brother here! Just now within the city, your Third Brother here caught sight of a chick. And there I was thinking to myself, 'Isn't this the type of girl that my Sixth Brother would like?' With that, I decided to go up and bully, no, I mean, flirt with her! But who 'knew that out of nowhere, a man would appear and slap your Third Brother's face swollen with a single slap! Sixth Brother, you've got to stand up for me!\" The third son of the Yao Family, Yao Xingfeng cried out.</p><br/><p>Right now, Yao Wuxie was the strongest in the entire Yao Family. In fact, even within the Xuanhuang World, these six brothers were all top tiered powerful beings, the crème of the crop.</p><br/><p>\"Oh? To think that someone would dare to create trouble in the Dead Demon City! Do they not know that you're the Third Brother of Yao Wuxie?\" Yao Wuxie's brows twitched, a little interested now.</p><br/><p>\"I said that! But that fella said that he's THE brother and continued whacking…!\" Yao Xingfeng covered his face and complained out.</p><br/><p>\"I see. Alright then. Since I'm free anyway, let's go take a look. Don't worry, Third Brother. With me around, I'll definitely seek justice for you.\" Yao Wuxie said.</p><br/><p>\"Sixth Brother, you're so nice to me! And to think that I treated you as such in the past…! I-I…I must have been blind!\"</p><br/><p>\"Third Brother, don't say that. We're all a family. Let bygones be bygones. Alright, let us go. I've got to see just where this guy hails from.\" Yao Wuxie waved his hand. Instantly, everyone walked out imposingly towards the city.</p><br/><p>When Lin Fan arrived at the Dead Demon City, he had wanted to head over to Yao Wuxie's place immediately. However, he caught sight of a guy taking liberties with a chick. At first, Lin Fan had thought that that must be Yao Wuxie! But on second glance, he realized that it wasn't. And not only that, he heard the other party mentioning that he was the Third Master of the Yao Family. Naturally, Lin Fan had to teach him a good lesson.</p><br/><p>\"Little buddy there. when the Sixth Master of the Yao Family appears later, you've got to acknowledge your wrongdoings!\"</p><br/><p>\"That's right! Even though the Sixth Master of the Yao Family is flamboyant, he is quite kind hearted and isn't an evil soul! As long as you admit your mistake, things will definitely be fine!\"</p><br/><p>The surrounding bystanders started advising Lin Fan, who sat there and shrugged it off while grinning, totally unbothered at all.</p><br/><p>Using his fingers, Lin Fan smudged across his face. His face started vibrating before taking on another look. He had to see for himself the extent to which Yao Wuxie had grown by now.</p><br/><p>\"Who is the one who dares to bully the Third Brother of Yao Wuxie? Are you tired of living!?\" Before he even arrived, his voice boomed out first.</p><br/><p>The moment Lin Fan heard this voice, he chuckled out. Even though it had been so many years, this guy's character hadn't changed at all!</p><br/><p>The crowd that were surrounding Lin Fan dispersed. However, they still looked at him worriedly nevertheless. If this guy were to continue acting so tough, it would be hard to resolve this issue soon.</p><br/><p>\"Were you the one who slapped my Third Brother?\" The moment Yao Wuxie appeared, he acted extremely tyrannically as he pointed out at Lin Fan while saying.</p><br/><p>Right now, Lin Fan's features were not the only things that had changed. His aura had changed as well. Therefore, it was only natural that Yao Wuxie could not recognize it.</p><br/><p>\"That's right. I was the one who slapped him! I heard that you're Yao Wuxie, the number one powerful being in the entire Dead Demon City?\" Lin Fan croaked out with a hoarse voice.</p><br/><p>\"Huh? Number one powerful being? N-no…nononononononononononono! I, Yao Wuxie, am the number one powerful being in the entire Xuanhuang World!\" Yao Wuxie raised his head and said in a domineering manner.</p><br/><p>At the start, Lin Fan had thought that Yao Wuxie finally knew how to be humble! But when he heard the second half of the sentence, he realized that this guy was too damned arrogant!</p><br/><p>\"Gosh, you're really getting more and more shameless.\" Lin Fan replied exasperatedly.</p><br/><p>Just this character of his was enough for Lin Fan to admit defeat.</p><br/><p>\"This person, really. Do you know how to talk? Why are all your words so nasty sounding? How should we settle this? You gave my Third Brother a slap. I don't think this is going to blow away that easily. How do you think we should settle this, Third Brother?\" Yao Wuxie asked.</p><br/><p>\"Sixth Brother, he gave me a single slap. I want to give him ten!\" Yao Xingfeng replied.</p><br/><p>\"Hmm… That sounds about fair.\" Yao Wuxie nodded his head. He then looked at Lin Fan, \"You've heard him! Return him ten slaps and this matter shall be over.\"</p><br/><p>\"HAHA…!\" Lin Fan burst out laughing. \"Since you say that you're the number one powerful being in the entire world, how about we fight then? Come at me if you've got what it takes.\"</p><br/><p>Lin Fan floated up into the void and headed off into the distance.</p><br/><p>\"Hmph! Who's afraid of whom? Since I'm pretty bored right now and it's hard to find entertainment these days, I shall play with you a little now that you have come knocking on my doorsteps yourself.\"</p><br/><p>Yao Wuxie was fearless as he followed tightly behind Lin Fan.</p><br/><p>In a wide open space, Yao Wuxie placed his hands behind his back.</p><br/><p>\"Make your move. I'm afraid that you might not get the chance to fight back after I strike out.\" Yao Wuxie commented.</p><br/><p>\"Yao Wuxie, you are not my opponent. I heard that you're really good at farting. Come, send one at me. I'll take it face on.\" Lin Fan was pretty interested in the might of Yao Wuxie's farts.</p><br/><p>Back when he wasn't all that strong, Lin Fan had developed a fear towards that fart. But right now, he was a Divine celestial level 9 cultivation state being. He wanted to give it a shot indeed.</p><br/><p>\"Hmph! Big words.\" Yao Wuxie struck out instantly. However, he did not fart. In Yao Wuxie's eyes, a single fart of his could rattle the entire world, causing even deities and ghosts to cry over it. There was a high possibility that the other party might be killed by it.</p><br/><p>\"You are not my match.\"</p><br/><p>Lin Fan spread out his fingers and used a slight bit of force, slapping it out towards Yao Wuxie.</p><br/><p>Instantly, Yao Wuxie's heart froze up. An extremely repressive amount of power was slamming out towards him, one he couldn't fight against at all!</p><br/><p>\"If you refuse to fart, the only thing that awaits you is death.\" Lin Fan said out.</p><br/><p>At this moment, Yao Wuxie could feel himself being caged up in that wave of power. His body started shivering uncontrollably as well.</p><br/><p>Such a formidable strength!</p><br/><p>This opponent seemed quite ferocious! Seemed like he has no other choice but to accommodate the other party's wishes then.</p><br/><p>\"You've asked for this.\"</p><br/><p>After that, without any hesitation, Yao Wuxie channeled all the True Energy within his body and sucked in a huge breath. He then aimed his butt straight at Lin Fan.</p><br/><p>'POOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOT!'</p><br/><p>A tremendous explosion boomed out into the world.</p><br/><p>Instantly, the entire Heaven and Earth shook intensely. The Spirit Qi within the void seemed as though it was being squeezed together.</p><br/><p>Lin Fan's face froze up. He could sense that this fart from Yao Wuxie was far from simple! This was something that shouldn't be existing within the Xuanhuang World at all!</p><br/>\n</div>"}