{"title": "Chapter 802: Strike Me Down If You Can!", "id": 802, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-802-strike-me-down-if-you-can", "volume_title": "Volume 9", "body": "<h1>Chapter 802: Strike Me Down If You Can!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 802: Strike Me Down If You Can!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan looked at the boundless terrain of the Ancient Saint World and felt a limitless battle intent rising in his heart. His personal strength had improved tremendously.</p><br/><p>Now that his physical body state was at Divine celestial level 10 cultivation state, it might very well be at the pinnacle of his limits. But, the path of improvement was one that was never-ending. Since the system did not give off any notifications, there was a huge possibility that further improvement might be possible.</p><br/><p>Right now, Lin Fan was feeling a little smug. With one hand on his waist and another pointing up at the heavens, he hollered, \"Heaven's Will, you little dipshit… This time around, Yours Truly has brought a ton of helpers back with me. I'll see how you wish to go against Yours Truly now!\"</p><br/><p>Lin Fan knew that the Heaven's Will was still in deep slumber. While it could awaken from time to time, the amount of power that it could send forth was limited still.</p><br/><p>And it was precisely because of this that Lin Fan did not fear the Heaven's Will. As to what would happen after it was to awaken, he would leave it till then to decide.</p><br/><p>Right now, there were only two thoughts on Lin Fan's mind.</p><br/><p>The first was to find any lone Utmost Being before killing them and snatching their treasures to strengthen his own body.</p><br/><p>At the same time, that Ancient Saint Sacrificial Altar hadn't had many changes up until now. If he had the chance, he would give it a good look.</p><br/><p>At this moment, Lin Fan wanted to make a trip over to the Guarded Ground to drag Cruel out, so that they could form a team with the Ancient One and start hunting down Utmost Beings.</p><br/><p>BOOM!</p><br/><p>But all of a sudden, something started happening between the world.</p><br/><p>\"Eh? What in the bloody world is happening right now? Is it going to rain?\"</p><br/><p>Within the void, lightning flashed out while gray clouds gathered. There was a boundless might that was forming up in the void.</p><br/><p>Boom! Boom! Boom! Boom!</p><br/><p>\"Wow! The sound of this thunder IS a little scary, eh?\"</p><br/><p>A thought flashed through Lin Fan's mind as he sensed that something was up with this situation right now. The thunderbolts were as thick as dragons. Not only that, they carried a devastating power with them. It was as though a single thunderbolt could strike Lin Fan to death instantly.</p><br/><p>\"Human! Hand over the Ancient Saint Sacrificial Altar and the Eternal God Seat!\"</p><br/><p>At this moment, a booming voice rang through the void. It was bright and solid, rattling Lin Fan so badly that his little heart was palpitating intensely.</p><br/><p>'Heaven's Will.'</p><br/><p>The moment he heard the voice, Lin Fan did not have to guess to know who the fella was.</p><br/><p>Within the Ancient Saint World, the Heaven's Will was the ruler. However, given the current situation, Lin Fan wasn't fazed by this Heaven's Will. It was not as though the Heaven's Will had awakened entirely.</p><br/><p>Lin Fan opened up his arms spread eagle, indicating that the Heaven's Will could come at him as it wanted.</p><br/><p>\"Heaven's Will, don't you bloody go overboard now! Yours Truly has just returned, and you're already here causing me troubles? Do you have some sort of a feud with me?\"</p><br/><p>Lin Fan scolded out. While he was a little nervous in his heart, he wasn't completely afraid.</p><br/><p>Based on the way things would go, if the Heaven's Will of the Ancient Saint World were truly so damned strong right now, it would definitely not bother to continue nagging all the way till now. Instead, it would probably choose to fight him straight up and snatch away the items on its own. It could practically squeeze Lin Fan in its palms and kill him with a slight bit of effort.</p><br/><p>\"Hand over the Ancient Saint Sacrificial Altar and the Eternal God Seat.\"</p><br/><p>This bright voice rumbled over once more like raging waves.</p><br/><p>\"Heaven's Will, don't you go overboard now! Yours Truly is not going to hand it over! Come and kill Yours Truly if you've got the guts! If Yours Truly would even twitch a single eyelid…\"</p><br/><p>BOOM!</p><br/><p>Before Lin Fan had even finished his words, a thunderbolt struck down from above the firmaments. This thunderbolt seemed as though it could even rip the entire world apart.</p><br/><p>It tore a large section apart in the void.</p><br/><p>BAM!</p><br/><p>\"Holy f*ck!\"</p><br/><p>This Heaven's Will is simply way too audacious! Before Lin Fan could even complete his sentence, it sent a thunderbolt down right away. It was giving Yours Truly no respect at all!</p><br/><p>Lin Fan's body jerked momentarily. Within the thunderbolt, there was an endless amount of devastating power as it struck down on Lin Fan's body.</p><br/><p>CRACK! BOOM!</p><br/><p>Lin Fan's body immediately met with a series of electrical currents that cruised through him.</p><br/><p>\"Holy f*ck! This is quite something!\"</p><br/><p>A deep crack appeared as the hairs on Lin Fan's body stood upright while he was charred black. The powers in his body rumbled momentarily before returning to normal.</p><br/><p>'Ding…Eternal God Body Experience Points +50,000.'</p><br/><p>Just at this moment, Lin Fan's face froze up as though he had just discovered a new world.</p><br/><p>\"Bloody hell! This bloody thing is giving me so many experience points?\"</p><br/><p>Lin Fan hadn't expected that a single thunderbolt by the Heaven's Will would bring forth these many experience points for his physical body! This was something startling indeed!</p><br/><p>Even if it were the Ancient One who was whacking him, he was no longer gaining any more experience points from that! But, this thunderbolt gave him 50,000 points straight away! This was way too astonishing!</p><br/><p>At this moment, Lin Fan gave out a loud roar as he shrugged his body. Lifeforce cruised through his entire body, and that charred black skin of his healed back to normal immediately, filled with a boundless amount of lifeforce.</p><br/><p>But just at this moment, Lin Fan suddenly recalled something important.</p><br/><p>Initially, Lin Fan had thought that this was practically more or less the limit for his physical body after reaching Divine celestial level 10.</p><br/><p>After all, even an Utmost Being could no longer give him any experience points. He was still wondering who else he could look for to train up his physical body state from now on.</p><br/><p>But at this moment, the thunderbolt of the Heaven's Will was giving him quite some experience points. Perhaps this could be a form of training method as well!</p><br/><p>\"You! How could you…?\"</p><br/><p>At this moment, the Heaven's Will realized that the human was fine, without any damage at all! It couldn't help but let out a shocked expression, evidently unable to believe that this could be happening.</p><br/><p>'Not good! I must definitely not allow the Heaven's Will to discover that its thunderbolts have no effect on me! Otherwise, it wouldn't send them forth anymore!'</p><br/><p>Lin Fan was someone who would never ever give up on any opportunity to increase his strength. As for this Heaven's Will, since it could increase his strength right now, Lin Fan would definitely not let it go.</p><br/><p>\"Aiyoh! That smarts!\"</p><br/><p>Right now, Lin Fan's acting skills could be comparable to those Oscars winners. This expression of him acting dead right now was intricate down to the very last wrinkle on his face.</p><br/><p>Instantly, Lin Fan gave a petrified look as he clutched at his chest as though he had just been dealt a heavy blow. His body started quivering, and his eyes lost their luster. The other free hand of his clutched at the Heavens as though he was about to reach for something.</p><br/><p>\"Aiyoh! That stings! It hurts…!!!\"</p><br/><p>Thud.</p><br/><p>Lin Fan collapsed onto the ground. He struggled to rise up, but just as he managed to barely stand up, he collapsed back down once more as though he was severely injured.</p><br/><p>In the opinion of the Heaven's Will, the state that Lin Fan was in right now was a half-dead state.</p><br/><p>Within the void, the Heaven's Will nodded its head in satisfaction as it observed the current situation right now.</p><br/><p>\"That should be the way things should be! How could he possibly be fine?\"</p><br/><p>According to the Heaven's Will, there was no way the other party could possibly be alright after its thunderbolt. The situation right now was exactly what the Heaven's Will wanted to see.</p><br/><p>However, there was something off about this. According to the Heaven's Will, that thunderbolt should have been enough to kill the other party.</p><br/><p>But to think that the human was not dead at all! This was something that it hadn't expected.</p><br/><p>\"Human, hand over the Ancient Saint Sacrificial Altar!\"</p><br/><p>\"Hand over the Eternal God Seat!\"</p><br/><p>The voice of the Heaven's Will boomed out once more.</p><br/><p>\"No! Strike me down if you've got the guts!\"</p><br/><p>Lin Fan yelped out while rolling left and right on the ground and wailing nonstop. However, he took notice to check his surroundings out from time to time as well.</p><br/><p>After all, this was something that would cause him to lose his image.</p><br/>\n</div>"}