{"title": "Chapter 804: What Goes Around Comes Back Around", "id": 804, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-804-what-goes-around-comes-back-around", "volume_title": "Volume 9", "body": "<h1>Chapter 804: What Goes Around Comes Back Around</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 804: What Goes Around Comes Back Around</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Heaven's Will, are you truly not attacking any longer?\"</p><br/><p>Lin Fan was feeling a little hurt within his heart right now. Wasn't this just pulling a prank on him? He was getting excited and close to climaxing, and yet, the other party refused to contribute any longer! How hurting was this?</p><br/><p>\"It can't be that because the Heaven's Will only had a part of it awakened, all the striking downs has caused its powers to deplete entirely, eh?\"</p><br/><p>Lin Fan was suspicious right now, but he couldn't be certain. He did not know what the actual situation was. However, given the state of the Heaven's Will, something as such shouldn't happen in theory.</p><br/><p>Who would suddenly suppress fire right at the point when they were about to climax?</p><br/><p>Wasn't this like when people engaged in 'vigorous exercises', and the man suddenly announced at the very last moment that he was out of stamina and couldn't catch his breath, going soft entirely?</p><br/><p>However, it was indeed as Lin Fan had guessed.</p><br/><p>There was only a small portion of the Heaven's Will of the Ancient Saint World that had awakened. But, even that small portion possessed such power that mere commoners would not be able to handle it at all. Every single thunderbolt brought with it a power that could devastate the entire world.</p><br/><p>In front of that perfect acting and mockery of Lin Fan, the Heaven's Will of the Ancient Saint World went mad as well.</p><br/><p>It was only after he struck down till the very end that he realized that he no longer had what it took to sustain it, and could only disappear eventually.</p><br/><p>\"Hais! This is so helpless.\"</p><br/><p>Lin Fan patted his bum and just walked away.</p><br/><p>Peace returned to the world once more. The countless places that were struck by the thunderbolts were now completely devastated, and were in a horrible state, looking as terrible as the end of the world.</p><br/><p>…</p><br/><p>Amongst the Utmost Beings of the Ancient race…</p><br/><p>\"Why do the powers of the Heaven's Will seem to have disappeared?\"</p><br/><p>The Utmost Beings of the Ancient race exchanged glances with one another in bewilderment. Right now, the six Utmost Beings of the Ancient race were extremely troubled.</p><br/><p>Now that two out of the eight Utmost Beings had been killed off, it caused a huge stir in the Ancient Saint World. There were many powerful beings of the thousands of races who wanted to cause uprisings.</p><br/><p>At a critical moment as such, they could naturally not allow the beings of the thousands of races to make a comeback.</p><br/><p>For the Utmost Beings, dealing with the beings of the thousands of races was something they would leave to the beings of the thousands of races themselves.</p><br/><p>There were many beings of the thousands of races who had submitted to the Ancient race. Therefore, there were many issues that did not require the personal presence of the Ancient race.</p><br/><p>Fault looked over at the other Utmost Beings. For some unknown reason, he had a really uneasy feeling of impending danger in his heart. This was a mysterious feeling.</p><br/><p>Given their current strength and status, there shouldn't be any existence in the world that should be able to threaten them at all.</p><br/><p>Fault cast away the uneasiness of the impending danger and looked into the distance.</p><br/><p>For the Utmost Beings of the Ancient race, as long as the Infinite Worlds would open up, the Heaven's Will would be able to devour the Infinite Worlds. And that would be the day of the Ancient Saint World's evolution.</p><br/><p>This was a moment they had been waiting for a long time now. There must definitely not allow any hiccups to occur, none at all.</p><br/><p>…</p><br/><p>Inside the Guarded Ground…</p><br/><p>The moment Lin Fan stepped foot in onto the public square of the Guarded Ground, there was a sudden commotion as everyone turned their heads around in unison.</p><br/><p>Recently, they knew that something big had happened.</p><br/><p>\"Sup, everyone? I'm back again!\" Looking at the familiar place around him, Lin Fan could not help but chuckle out once more.</p><br/><p>The crowd in the Guarded Ground looked at Lin Fan in a daze. While some people knew of the great name of Lin Fan, they hadn't seen him in the flesh yet.</p><br/><p>But most of the other people could not help but exclaim out the moment they caught sight of that figure.</p><br/><p>\"That's the Party Leader of the Revolutionary Army!\"</p><br/><p>\"Why is he back again?\"</p><br/><p>\"The Revolutionary Army right now is already extremely fearsome! Now that the Party Leader of the Revolutionary Army is back, wouldn't they be even scarier?\"</p><br/><p>Mumble, chatter, clatter.</p><br/><p>The entire crowd fell into a huge commotion as they started conversing. There were even some people who left immediately to spread the news.</p><br/><p>For all the parties out there, this Revolutionary Army was too damned mother*cking scary! They were just a bunch of complete savages!</p><br/><p>\"Party Leader…!\"</p><br/><p>At this moment, a figure hurried over from the distance.</p><br/><p>When Lin Fan took a closer look, he laughed out and called out loudly, \"How's everything been, bald monk?\"</p><br/><p>\"Party Leader, you've got to call me a poor monk!\" Reverend Shakya had replaced Lin Fan's duties and took care of the Revolutionary Army recently. He had been living days of pleasure and carefreeness.</p><br/><p>Each day would just involve him skiving and picking up some missions here and there. They were quite some carefree days.</p><br/><p>Even the robes he was wearing in the past had been changed. Naturally, he changed them to those of the highest quality.</p><br/><p>\"Party Leader!\"</p><br/><p>For all of these members of the Revolutionary Army, Lin Fan was their idol. Ever since they joined the Revolutionary Army, they had found their goal in life.</p><br/><p>As for those newly joined up members of the Revolutionary Army, while they did not know what their Party Leader looked like, they were also filled with an immense curiosity towards this mysterious Party Leader.</p><br/><p>But with a single glance now, they could tell that he was indeed extraordinary. Each of them looked at Lin Fan in reverence. Their eyes were sparkling so brightly that light was almost bursting out of them.</p><br/><p>\"Bald monk, take a look. What is this?\" Suddenly, Lin Fan chuckled out as he pointed out with his finger. Instantly, a Purifying Buddha Light wrapped itself around his finger.</p><br/><p>There were millions of Buddhas that were chanting scriptures within this Buddha light. That extremely formidable Buddha light had Reverend Shakya open his eyes wide in astonishment.</p><br/><p>\"Benefactor! You couldn't have…you couldn't have…!!!\"</p><br/><p>Reverend Shakya was dumbfounded right now. He couldn't have mistaken this! To think that this was the bloody Great Buddha's Light of Purification!</p><br/><p>This was a godly power that every single being of the Buddha race would dream about, the Utmost godly power that they were all working hard towards!</p><br/><p>\"HAHA! How about now? Are you envious now? Are you jealous?\" The moment Lin Fan returned, he had to flaunt it up in front of Reverend Shakya to show how awesome he was.</p><br/><p>At this moment, in the eyes of Reverend Shakya, Lin Fan was the being worth being fawned over the most right now.</p><br/><p>\"Benefactor! Impart it to me purlease! Purleaseeeeeee!!!\" Reverend Shakya came before Lin Fan and begged him fervently.</p><br/><p>If he could learn this Great Buddha's Light of Purification, wouldn't it be heaven revolting!?</p><br/><p>If he were to return to the Buddha race with this, wouldn't he be the center of attention? He would be the True Buddha in the eyes of all the beings of the Buddha race!</p><br/><p>\"Hehe. Not imparting!\" Lin Fan chuckled out before sniggering continuously.</p><br/><p>\"Benefactor! Look at how well I've managed the Revolutionary Army in the days you haven't been around! Just impart it to me purleaseeeeeee!\" Reverend Shakya truly wanted to learn it. This was a godly skill of the Buddha race! Once he learned it, his achievements would be infinite in the future!</p><br/><p>\"Hais, bald monk. As the saying goes, what goes around comes back around. For Yours Truly here, being able to comprehend the Great Buddha's Light of Purification out of the Purification skill itself is something that's extremely easy! Well, it's not really impossible for you to learn it as well. But, I suppose it'll have to depend on your performance to come then!\"</p><br/><p>At the moment when Lin Fan had first noticed the Purification skill, he had wanted to learn it badly. However, this bloody bald monk was still acting in front of him all day and night, refusing to tell him about it.</p><br/><p>But now, the tides had turned and he had the upper hand! Naturally, he had to tease Reverend Shakya for a little first.</p><br/><p>\"AH!\" Reverend Shakya felt helpless right now.</p><br/><p>Shing!</p><br/><p>At this moment, the void vibrated as a passageway opened up. This was a passageway that led to the uppermost area of the Guarded Ground.</p><br/><p>\"Bald monk, take your time and think about it. No hurries though! I've got something on now, so I'll leave first, aite?\"</p><br/><p>Lin Fan hopped into the passageway straight away and waved bye to Reverend Shakya. Looking at that yearning look on Reverend Shakya's face of wanting to learn but being unable to, Lin Fan could only chuckle out.</p><br/><p>After Lin Fan's departure…</p><br/><p>Reverend Shakya took in a deep breath and encouraged himself in secret, 'For this period of time, seems like I've got to let go of my dignity. No matter what, I've got to get my hands on that Great Buddha's Light of Purification!'</p><br/><p>At the same time, Reverend Shakya felt extremely indignant that Lin Fan was able to learn the Great Buddha's Light of Purification. He was a genius of the Buddha race! And yet, he was unable to comprehend that skill out of Purification! How could Benefactor Lin have done it?!</p><br/><p>\"Hais…\"</p><br/><p>Unable to understand how things turned out as such, Reverend Shakya gave up on thinking about it eventually.</p><br/><p>Now that Lin Fan was back, this was quite the headache for some of the parties of the Guarded Ground.</p><br/><p>However, there was nothing they could do at all.</p><br/><p>During that gang fight the last time around, they nearly had their own sh*ts whacked out of them.</p><br/><p>And for those chicks that were originally in their parties, they had all defected over to the Revolutionary Army. For some of those stronger parties, this was undoubtedly just a form of humiliation for them.</p><br/>\n</div>"}