{"title": "Chapter 819: Seeking Kin", "id": 819, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-819-seeking-kin", "volume_title": "Volume 9", "body": "<h1>Chapter 819: Seeking Kin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 819: Seeking Kin</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"This doesn't make sense!\"</p><br/><p>Lin Fan was in some slight disbelief right now. He hadn't expected things to turn out as such! All the while, Chick Shen Wu had been presenting a 'Your Mummy is not going to let this off until she gets her hands on you!' expression! But to think that she would admit defeat all of a sudden! This had Lin Fan dumbfounded.</p><br/><p>Lin Fan stopped the motion of his hands and took a good look. He wanted to ascertain if Chick Shen Wu was putting on an act. But no matter how he looked left and right, he couldn't make out a shred of falsehood in it.</p><br/><p>At this moment, the expression of Chick Shen Wu was dazed. In fact, there were even two streams of tears flowing down both sides of her cheeks. It was as though those were tears of a broken heart after being abused by someone.</p><br/><p>'It can't be that I'm way too awesome and have managed to spank the Dragon Empress Shen Wu into submission, right?' Lin Fan thought in his heart silently. The more he thought about it, the more he felt that this was a possibility.</p><br/><p>\"Do you truly believe me now?\" Lin Fan asked once more, still not truly convinced just yet.</p><br/><p>\"I do. I do!\" Dragon Empress Shen Wu nodded her head fervently, without a single shred of hesitation.</p><br/><p>Reverse Scales and whatnot, none of those existed at this very moment.</p><br/><p>Dragon Empress Shen Wu had realized that Lin Fan was simply way too twisted! Even if her Reverse Scale was there, it didn't mean jacksh*t!</p><br/><p>Under the abuse of this inhumane thing, Dragon Empress Shen Wu had admitted defeat completely. She no longer bore any thoughts of wanting to fight back against the other party.</p><br/><p>\"Impossible!\"</p><br/><p>When Dragon God Wan Sheng saw this, he was taken aback, evidently confounded.</p><br/><p>The end result for this human after touching the Reverse Scale of the Dragon Empress Shen Wu was definitely to endure an eternal fury of hers for his entire life!</p><br/><p>But, to think that Dragon Empress Shen Wu would actually admit defeat and take the initiative to apologize to this human!</p><br/><p>This single scene had everyone watching with their mouths agape.</p><br/><p>Even though the Tenth Prince had been subdued by Lin Fan, he retained a sense of self consciousness. At this moment, he could not help but be impressed with Lin Fan's methods as well. To think that he could even subdue the Dragon Empress Shen Wu, whose Reverse Scale he had touched!</p><br/><p>\"Yes, it's all good as long as you believe. Look at you here now. It was really difficult for me as well. Wouldn't it have all been fine had you done this from the start?\"</p><br/><p>\"This is the basic form of trust that individuals should have between them! This world is so big! There're all sorts of wonders within it! Let's not even talk about repairing one's Universal Elixir, one can practically revive even after dying. Furthermore, look at me! Do I look like the type of person who would deceive others?\"</p><br/><p>\"So, you must absolutely believe in me in the future! You must never ever look at me with any doubts, understood?\"</p><br/><p>Looking at how well behaved the Dragon Empress Shen Wu was, Lin Fan could not help but heave out a sigh of relief as he elaborated at length.</p><br/><p>\"Understood.\"</p><br/><p>As though the Dragon Empress Shen Wu had been subdued down by violence, it didn't matter what Lin Fan said, she would just nod her head without even thinking twice.</p><br/><p>All the surrounding members of the Colossal Dragon race no longer knew what to say about this scene right now.</p><br/><p>They did not know where in the world this human had popped out from. To think that he could even subdue the Dragon Empress Shen Wu! These methods could definitely shock the entire Heaven and Earth!</p><br/><p>At the same time, they were immensely curious in their hearts. While they did not know what he did to subdue the Dragon Empress Shen Wu, they hoped that they could learn it. If they did, wouldn't they be able to take liberties with the other chicks of the Colossal Dragon race for free?</p><br/><p>Instantly, countless eyes that sparkled with hope were cast at Lin Fan.</p><br/><p>Sensing the attention of all these gazes, Lin Fan felt his heart clench. He had a feeling that he was an object of voyeurism for these members of the Colossal Dragon race!</p><br/><p>Lin Fan looked at the Dragon Empress Shen Wu, then took a step forward as he wanted to open up his mouth and speak. However, all of a sudden, Dragon Empress Shen Wu shivered uncontrollably and stepped back hastily, with fear shining through her eyes.</p><br/><p>\"Eh?\"</p><br/><p>Lin Fan was exasperated right now. It couldn't be that she was afraid of him now, right?</p><br/><p>No matter what, Dragon Empress Shen Wu was the female pride of the Colossal Dragon race! Didn't he just spank her bum for a good few hundred times? Did she have to fear him like this?</p><br/><p>Seemed like he would have to communicate this through with her properly if there was the chance.</p><br/><p>BOOM!</p><br/><p>At this very moment, the void above trembled as a long tear appeared between the world. An extremely formidable aura seeped out from the tear.</p><br/><p>A figure walked out briskly. This figure was as huge as the Heaven and Earth itself, exuding an extremely imposing and authoritative aura. A pair of golden dragon eyes were shining with a godly glow.</p><br/><p>\"Alright now. This is the Sacred Ground of the Colossal Dragon race. Isn't it about time for you to leave, human?\"</p><br/><p>This boundless voice boomed out from within the void.</p><br/><p>When all the members of the Colossal Dragon race caught sight of this figure, all of them prostrated on the ground immediately.</p><br/><p>\"God of the Dragon Ancestors!\"</p><br/><p>Those members of the Colossal Dragon race who were deep in discussion moments earlier turned extremely stern and serious the second they caught sight of this figure. All of their faces were filled with a look of reverence.</p><br/><p>\"God of the Dragon Ancestors?\" Lin Fan raised his head over. This was the first time he was catching sight of the Big Boss of the Colossal Dragon race. This aura, in Lin Fan's opinion, was indeed extremely formidable.</p><br/><p>To think that this affair would even rattle the God of the Dragon Ancestors. This was something thoroughly unexpected.</p><br/><p>\"I'm here to seek out relatives. If I don't find who I'm looking for, I'm not leaving this place.\" Lin Fan replied loudly. Even if it were in the face of the God of the Dragon Ancestor, Lin Fan did not feel any fear at all.</p><br/><p>After all, his purpose for the trip this time around wasn't to cause a fight with anyone. He was truly here to seek out roots. As for this issue with the Dragon Empress Shen Wu, it was just a complete accident!</p><br/><p>\"Seeking relatives? You're of the Human race while we are of the Colossal Dragon race. What relatives do you speak of?\" The God of the Dragon Ancestor asked.</p><br/><p>\"I'm not seeking out kin for myself. I'm helping my Little Bro to seek out his relatives.\" Lin Fan replied.</p><br/><p>\"Oh. So, who are you looking for?\" The God of the Dragon Ancestor asked.</p><br/><p>\"I have no idea. We'll decide after we take a look.\" How in the world would Lin Fan know who Chicky's Daddy was? He could only try at using the connections of their bloodlines.</p><br/><p>It was evident that Chicky was a mixed breed. But, if Chicky's Daddy weren't here, then this would be one hell of an embarrassment!</p><br/><p>As for Chicky's bloodline, it was pretty obvious that it was pretty high class. Not only that, his personal physical body type was pretty special. As such, the Daddy of Chicky must be no ordinary Colossal Dragon even within the Colossal Dragon race.</p><br/><p>\"Chicky, come on out!\"</p><br/><p>Lin Fan spread out his fingers and released Chicky out from his Paradise instantly.</p><br/><p>\"Cuckcuckoo!!!\"</p><br/><p>At this moment, the stance in which Chicky came forth from his Paradise was extremely suave. With both legs stepping forth, that chicken head of his was raised high. His eyes were shining with an unparalleled gleam.</p><br/><p>\"HAHAHA!\"</p><br/><p>\"What the f*ck is that sh*t!?\"</p><br/><p>\"How could that be a descendant of our Colossal Dragon race? I bet that must belong to those bunch of little birds of the Phoenix race!\"</p><br/><p>\"Are you tired of living?! How dare you spout out such words now!\"</p><br/><p>\"Oh, right! Right! I nearly forgot!\"</p><br/><p>The members of the Colossal Dragon race broke out into heated discussions once more. They were practically rolling on their bellies in laughter over the appearance of Chicky.</p><br/><p>They were of the Colossal Dragon race! And what in the world was this thing that looked like a chicken?</p><br/><p>\"Cuckcuckoo!!!\"</p><br/><p>Chicky wasn't bothered with the conversation going on as he crowed out loudly.</p><br/><p>Chicky tossed his head before exchanging glances with Lin Fan. Lin Fan nodded his head in acknowledgment silently, 'Go forth and start looking for your Daddy!'</p><br/><p>Chicky followed the sensation of the bloodline within his body and started sweeping his gaze at these members of the Colossal Dragon race one by one.</p><br/><p>And just at this moment, Chicky realized that there was a pair of eyes that had been gazing at him intently. He swung his head over immediately.</p><br/><p>Instantly, he could feel a deep connection rising from the unknowns. All of a sudden, Chicky could feel the blood within his body starting to rumble!</p><br/><p>Lin Fan had been following Chicky's line of sight as well. But at this moment, all he saw was Chicky exchanging glances with that God of the Dragon Ancestors.</p><br/><p>At this moment, Lin Fan was stunned.</p><br/><p>It couldn't be that Chicky had some sort of relationship with this God of the Dragon Ancestors, right…?</p><br/>\n</div>"}