{"title": "Chapter 817: A Dragon Has Reverse Scales.", "id": 817, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-817-a-dragon-has-reverse-scales", "volume_title": "Volume 9", "body": "<h1>Chapter 817: A Dragon Has Reverse Scales.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 817: A Dragon Has Reverse Scales.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The moves of Dragon God Wan Sheng rained out in a frenzy. He possessed an extraordinary momentum, as the sky were filled with images of dragons that rattled out in all directions. It was as though he was bent on killing Lin Fan for sure.</p><br/><p>He had been hiding outside the imperial palace of Dragon Empress Shen Wu the entire time. The reason for that was so that Dragon Empress Shen Wu could not sneak him out somehow.</p><br/><p>But things were good now. For some unknown reason, Dragon Empress Shen Wu had started fighting with this human!</p><br/><p>With that, Dragon God Wan Sheng naturally could bear with it no longer. He had to seek revenge for his son!</p><br/><p>Instantly, a figure appeared before the face of Dragon God Wan Sheng.</p><br/><p>\"Father! It's me! Stop fighting!\"</p><br/><p>Ever since the Tenth Prince had converted under Lin Fan, he had been living it up in life. With that heaven revolting Ancestor Dragon's Reincarnation skill, his cultivation state had been skyrocketing. In fact, he was even at the boundaries of touching base with the Divine celestial level 10, Eternal God state right now!</p><br/><p>He was just that step away. And this single step wasn't all that far for the Tenth Prince either.</p><br/><p>The moment Dragon God Wan Sheng, who was bearing an extremely ferocious momentum, caught sight of this figure before him, he retracted his attacks immediately. His tone was startled, and he had a look of disbelief.</p><br/><p>\"Son? You're alright?\" Dragon God Wan Sheng was extremely emotional right now. Due to his overexcitement, even that long beard of his was trembling at this moment.</p><br/><p>That infuriated expression of his turned tender and gentle all of a sudden.</p><br/><p>The moment he caught wind of the news that his very own child was killed in the hands of this human, he had blown up right away in his heart.</p><br/><p>Dragon God Wan Sheng had ten sons, and the Tenth Prince was the youngest of them all. However, for Dragon God Wan Sheng, he had only one son right now. As for the other nine before him, they had brought death upon themselves outside by being cocky.</p><br/><p>They were either killed off by the Ancient race or other powerful beings.</p><br/><p>Therefore, Dragon God Wan Sheng placed a lot of emphasis on this son of his. Each time the Tenth Prince went out, Dragon God Wan Sheng would send out powerful beings to escort him. That was because he was afraid that this son of his might bring death upon himself by insulting others.</p><br/><p>\"Father, I am alright! I'm doing fine! This guy here is my Big Brother! Why must you attack him?\" The Tenth Prince had a bewildered face. Even though he had been purified by Lin Fan, under Lin Fan's instructions, the feeling that he was giving off right now was that of the obedient little child of Dragon God Wan Sheng.</p><br/><p>\"My child!\"</p><br/><p>Unable to hold back his emotions, Dragon God Wan Sheng rushed up forth and hugged him tightly. Within this period of time, the heart of Dragon God Wan Sheng seemed as though it was pierced through by a thousand swords. Starting with his very first child all the way to his tenth child here. The heart of Dragon God Wan Sheng had long broken down into shards.</p><br/><p>And now that this tenth child of his was still alive, this was naturally the greatest gift that Dragon God Wan Sheng could receive right now.</p><br/><p>Looking at the scene before him, Lin Fan felt relieved. At least he had settled that Dragon God Wan Sheng now.</p><br/><p>The Tenth Prince turned around and gave Lin Fan a smirk. The meaning was clear, 'Count on me!'</p><br/><p>Lin Fan nodded his head. His meaning was clear too, 'I'll hand everything to you.'</p><br/><p>\"Eh? My son, your aura…!\" The cultivation state of Dragon God Wan Sheng was heaven revolting. Therefore, his wisdom was as high as the Heavens as well. A single look was enough for him to perceive the body of the Tenth Prince.</p><br/><p>The face of Dragon God Wan Sheng was startled right now, evidently in disbelief.</p><br/><p>He knew that while this son of his had a pretty decent potential, it was one that could only be considered as average within the Colossal Dragons race. However, the aura that his child was giving off right now was extremely special, with a harmony between Yin and Yang.</p><br/><p>All of a sudden, Dragon God Wan Sheng caught sight of a gigantic Taichi Yin Yang Colossal Dragon that was coiling up within the body of the Tenth Prince. That was the Reincarnation technique! Not only that, it had been cultivated to an extremely profound state right now!</p><br/><p>\"My son! You've cultivated the Ancestor Dragon's Reincarnation?\" Dragon God Wan Sheng asked in an astonished manner, unable to believe this at all.</p><br/><p>The Ancestor Dragon's Reincarnation was one of the few great secret techniques of the Colossal Dragons race! It wasn't something that one could learn as and when they wanted to! They had to have the innate potential for it! And, this innate potential was something that only a bare few could have within the entire Colossal Dragons race!</p><br/><p>\"That's right, Father! With the help of Big Brother, I have already cultivated the Ancestor Dragon's Reincarnation to Level 8! I'm only that single step away from becoming a Divine celestial level 10 state being!\"</p><br/><p>The Tenth Prince commented.</p><br/><p>Dragon God Wan Sheng looked at his own child, then looked over at Lin Fan. For a moment or so, he truly did not know what to say anymore.</p><br/><p>All of a sudden, he was starting to feel that all of this wasn't real.</p><br/><p>\"Shen Wu, this matter is truly a misunderstanding!\" Lin Fan explained hurriedly. Even though this matter was definitely not a misunderstanding, in the face of Shen Wu, no matter even if he had to be whacked to death, Lin Fan would definitely stick by his claim that this was the truth!</p><br/><p>\"SHUT UP!\"</p><br/><p>The face of Dragon Empress Shen Wu right now was extremely frosty. She did not believe in Lin Fan's words in the least bit!</p><br/><p>At this moment, Lin Fan had a huge headache. Why in the world did this Dragon Empress Shen Wu have to be this stubborn!?</p><br/><p>\"Father, he is my benefactor! The only reason why your child I am able to cultivate the Ancestor Dragon's Reincarnation is all due to my Big Brother's credit! You mustn't allow the Dragon Empress Shen Wu to strike at Big Brother!\" The Tenth Prince added on hurriedly, hoping that Dragon God Wan Sheng could settle this issue down.</p><br/><p>\"Don't bother with this matter. Let us leave.\" Dragon God Wan Sheng did not say much. He then tugged at the Tenth Prince and wanted to leave this place.</p><br/><p>\"No! I'm not leaving!\" The Tenth Prince started acting coquettishly.</p><br/><p>For Dragon God Wan Sheng, the Tenth Prince was like a piece of his heart! For a moment, he did not know what to do!</p><br/><p>However, Dragon Empress Shen Wu was enraged at this moment. The more she thought about it, the angrier she got. It was as though she could not think through it at all!</p><br/><p>\"Does it feel good to lie to me?\" Dragon Empress Shen Wu blasted out.</p><br/><p>\"I swear to the Heavens that I'm not lying! I'm truly injured! However, my skill is just slightly more unique! Therefore, even if my Universal Elixir is slightly damaged, it would be able to heal up automatically!\" Lin Fan replied.</p><br/><p>\"Hmph! And you really think that I'll believe you!\"</p><br/><p>Instantly, Dragon Empress Shen Wu bolted out towards Lin Fan once more. That peerlessly ravishing face of hers shone with a look of fury once more.</p><br/><p>\"Holy f*ck! Why the hell is this woman so stubborn!\"</p><br/><p>Lin Fan was infuriated at this point. Bloody hell! Yours Truly had been trying to pacify her through words. Yet, this chick had been so brazen time and again! Intolerable! Absolutely intolerable!</p><br/><p>BAM!</p><br/><p>Lin Fan did not dodge as he grabbed on to the Dragon Empress Shen Wu with a furious look, \"Everything I said was real! Why do you just refuse to believe me!\"</p><br/><p>\"To hell I would! All humans are crafty individuals!\" The Dragon Empress Shen Wu struggled, \"Let go of me!\"</p><br/><p>\"Chick, you're really way too stubborn. And to think that you would say something such as the entire Human race being crafty individuals! Seems like I've got to teach you a lesson here to show you that trust must exist between every single individual!\"</p><br/><p>Lin Fan then lifted the Dragon Empress Shen Wu up and held her by the waist with just a single hand.</p><br/><p>\"What are you trying to do?\" Dragon Empress Shen Wu yelped out in shock. She did not expect that something as such would happen!</p><br/><p>When Dragon God Wan Sheng caught sight of this, he was momentarily startled as well. Just as he was about to move forth to rescue Dragon Empress Shen Wu, he was halted by the Tenth Prince in an instant.</p><br/><p>\"Father, what are you thinking of doing? That's my Big Brother!\"</p><br/><p>Dragon God Wan Sheng was stunned as he stopped whatever he was doing.</p><br/><p>Dragon God Wan Sheng could not make out what in the world was happening right now.</p><br/><p>Piak!</p><br/><p>Just at this moment, a clean, crisp sound rang out.</p><br/><p>Dragon God Wan Sheng froze up and turned his head in disbelief. It was as though he had just witnessed something absolutely inconceivable.</p><br/><p>\"Y-you…!\"</p><br/><p>\"What? What do you think I'm doing? I'm trying to teach this stubborn chick here a lesson!\" Lin Fan had suddenly realized that there was something wrong with the expression on the face of Dragon God Wan Sheng. For a moment, he was starting to realise that there seemed to be some problem of sorts.</p><br/><p>\"A-A dragon has Reverse Scales…if you touch them, you die!\"</p><br/><p>\"B*STARD, I'M GOING TO KILL YOU!\"</p><br/><p>All of a sudden, Lin Fan realized that Dragon Empress Shen Wu was resisting crazily out of nowhere.</p><br/><p>'It can't be…right?'</p><br/><p>Lin Fan had not expected that the Reverse Scale would exist on the bum of the Dragon Empress Shen Wu! Bloody hell! If any mother*cker were to get together with Dragon Empress Shen Wu, wouldn't they get into a fight each time her bum was touched?</p><br/>\n</div>"}