{"title": "Chapter 823: Time To Carry On Then!", "id": 823, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-823-time-to-carry-on-then", "volume_title": "Volume 9", "body": "<h1>Chapter 823: Time To Carry On Then!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 823: Time To Carry On Then!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The thing that Lin Fan was most afraid of was that Chicky might foolishly tell how these three perverted sons of his came about. If they were to know that these three perverted sons were the offspring of a domestic fowl, he wondered what sort of expression they would have.</p><br/><p>In Lin Fan's opinion, they might probably just explode!</p><br/><p>\"How did she die?\" Zi Feng asked.</p><br/><p>\"Difficulties when giving birth.\" Chicky replied.</p><br/><p>The fact that a single domestic fowl could successfully give birth to three perverts like these was something that Lin Fan couldn't make sense of for the longest time.</p><br/><p>In theory, the amount of Spirit Qi that's required in the process of bearing them was already enough to suck up the domestic fowl cleanly. To think that she could hold out till such an extent.</p><br/><p>But, what Lin Fan did not know was that back when the hen was bearing these three little perverts, Zhang Ergou and the others had been worked to the bone. A countless and endless amount of Elixirs were fed to this domestic fowl dedicatedly.</p><br/><p>If any outsiders were to catch wind of it, they would definitely spit out a mouthful of old blood. That was way too wasteful!</p><br/><p>\"Hais, my son, you don't have to be too sad. I wonder what race she was from. If there's a chance, I'll go visit them with your Daddy.\" Zi Feng consoled.</p><br/><p>Chicky blinked his eye blankly and thought for a moment. He then replied, \"I think it's the Hen race.\"</p><br/><p>\"EH?\"</p><br/><p>\"Hen race? What sort of a race is that?\"</p><br/><p>Both the God of the Dragon Ancestor and Zi Feng were stunned. They hadn't heard of that race before!</p><br/><p>Lin Fan was equally taken aback. Hen your mother!</p><br/><p>That bloody Hen race was none other than the 'Once you grow, up you're thrown into a hotpot to be eaten' race!</p><br/><p>\"This Hen race is a race that belongs to the Xuanhuang World. While it might not be comparable to the Top Ten Old Ancient Beast races, it has some capabilities as well.\"</p><br/><p>\"At the breaking of dawn, the Hen would cry out loudly to bring forth the coming of life for the living beings of the world. For the living beings of the Xuanhuang World, the importance of the Hen is supreme, and the value of their deeds is tantamount to the Heavens.\" Lin Fan forcefully explained his way out of this.</p><br/><p>While the God of the Dragon Ancestor and Zi Feng did not know what in the world this Hen race was, when they heard of the noble way in which Lin Fan had described it to be, they nodded their heads in agreement as well.</p><br/><p>While there was definitely some distance away from being comparable to the Top Ten Old Ancient Beasts, it wasn't all that bad either.</p><br/><p>At this moment, Lin Fan did not want to continue this farce with the God of the Dragon Ancestor. He then indicated over to Chicky.</p><br/><p>Chicky thoroughly understood Lin Fan's meaning down to his core. He then said out in a bashful manner, \"Dearest Mummy, I'm hungry.\"</p><br/><p>\"Yes, yes! Your Dearest Mummy will bring you there right away!\"</p><br/><p>The moment the God of the Dragon Ancestor heard this, he was put in quite the spot for a moment. That was his own treasure stash! He was a little reluctant to let anyone in just like that!</p><br/><p>But, under the strong pressure of Zi Feng, he did not dare to disobey and could only agree silently as well.</p><br/><p>Initially, Lin Fan did not have the rights to enter. But, with the help of Chicky and his three little chicklings, he had still managed to get in successfully.</p><br/><p>Even if the God of the Dragon Ancestor had a thousand emotions of unwillingness, he had no choice in this matter at this moment.</p><br/><p>When Lin Fan caught sight of the stone gates before him, he felt excited from up to down.</p><br/><p>This was the treasure stash of the God of the Dragon Ancestor! Who knew how many treasures there would be inside!</p><br/><p>\"Open up?\" Zi Feng glared straight at the God of the Dragon Ancestor.</p><br/><p>The God of the Dragon Ancestor felt a slight pain of reluctance in his heart. But, under the pressure of his woman, he could only sigh and open up the doors of the treasure stash.</p><br/><p>BOOM!</p><br/><p>The treasure stash opened up as a thick treasure aura gushed out from the gaps.</p><br/><p>Sensing the thick treasure aura from within, Lin Fan could not help but acknowledge in his heart. Just this bit of treasure aura that was coming forth, and the type of might that was brought forth with it, was enough for him to tell just how many treasures were within.</p><br/><p>The Colossal Dragon race could be considered as one of the richest races there were.</p><br/><p>\"Take anything you'd like. Don't stand on courtesy at all!\" Zi Feng said.</p><br/><p>Lin Fan did not know how to reply, and could only nod his head silently. As for Chicky and those three chicklings of his, they did not hesitate at all as they bolted right inside the treasure stash.</p><br/><p>Lin Fan followed closely behind.</p><br/><p>\"Zi Feng, this is not too good, right? To let a human into the treasure stash! If this were to…\" At this moment, when only the two of them were left outside in the world, the God of the Dragon Ancestor asked.</p><br/><p>\"Why not? You can't bear to?\" Zi Feng retorted.</p><br/><p>\"That's not what I mean. I just feel that it's not really a good idea to let a human into our treasure stash!\" The God of the Dragon Ancestor could feel his heart bleeding. These were treasures that he had accumulated tirelessly over endless years! If this human were to swipe the entire treasure stash clean, what should he do?</p><br/><p>\"What's not too good about it! Can't you tell that our child has an extremely close relationship with this human? And also, what's the use of you keeping so many treasures? Unless you're thinking that you can find someone else with it after I'm dead…!\"</p><br/><p>\"Zi Feng, what are you saying? How could I, Huang Wusheng, be someone like that?\"</p><br/><p>\"Hmph! A single look and I can tell that you're dishonest! Isn't your fortune going to be left for our child in the future as well? And now, for anything our child wishes to give away, you had better not give me that crap! Once this heavenly calamity is over this time around, you're to step down from your position!\"</p><br/><p>\"Alright.\"</p><br/><p>…</p><br/><p>\"Holy f*ck! This is mother*cking even richer than an entire world of its own!\"</p><br/><p>When Lin Fan entered the treasure stash, he was bedazzled by the sight before him. Within the void, there were dense clusters of treasures floating all around.</p><br/><p>Dao Weapons. They were all Dao Weapons!</p><br/><p>And some of those Dao Weapons did not have a master at all!</p><br/><p>One by one, Weapon Spirits were flying all around the treasure stash and having fun playing around.</p><br/><p>In fact, even those pills that had been kept here had given birth to Pill Spirits of their own!</p><br/><p>Lin Fan looked around hurriedly to catch sight of Chicky. By the time he found him, Chicky had already leaped into a pile of pills and was gulping down with his life.</p><br/><p>\"This is really rich indeed! Chicky's life is way too good right now!\"</p><br/><p>Lin Fan lamented. Based on the treasure stash's resources here, even 10,000 sects wouldn't be able to compare to it!</p><br/><p>Lin Fan had been searching for Shengyang Pills all this while. Hence, none of these treasures and pills were things that Lin Fan could be enticed over. As long as he had sufficient materials, he could craft these out as well.</p><br/><p>At this moment, Lin Fan came to a halt with his footsteps.</p><br/><p>All he saw up ahead of him was a dragon that was made up of some unknown materials. It spiraled and coiled all the way up into the Heavens. The moment that dragon opened its gigantic mouth, countless Shengyang Pills spilled out of its mouth.</p><br/><p>\"T-this…!\"</p><br/><p>When Lin Fan saw this, he was completely stumped.</p><br/><p>In a single breath, the amount of Shengyang Pills that were spat out were innumerable! It was absolutely heaven revolting!</p><br/><p>Shengyang Pill river! This was the true Shengyang Pill river!!!</p><br/><p>One after another, the gigantic Shengyang Pill dragons swiveled up into the skies. Each dragon was made up of 100,000,000,000 Shengyang Pills.</p><br/><p>At this moment, Lin Fan wanted to reap everything in just like that so badly. But, the moment he considered the fact that he was in the territory of someone else, he realized how unreasonable it would be if he were to just swipe everything clean.</p><br/><p>Sweeping his robes, Lin Fan took ten Shengyang Pill dragons into his Paradise.</p><br/><p>That made one trillion for him now.</p><br/><p>Lin Fan did not know what the limits of the God of the Dragon Ancestor's tolerance were. Hence, he decided to take it little by little to test his attitude towards it.</p><br/><p>Outside…</p><br/><p>\"To think that the lad would take away a trillion Shengyang Pills directly!\" The God of the Dragon Ancestor had been keeping a close watch on what was going on within. However, he realized that this human wanted nothing but Shengyang Pills!</p><br/><p>Even though Shengyang Pills weren't something that were all too precious for the Colossal Dragon race, one trillion was still something outrageous!</p><br/><p>\"You're heartbroken over just one trillion? Are you still the God of the Dragon Ancestor?\" Zi Feng said.</p><br/><p>\"That's one trillion! Even if I have the great formation of Dragon Gods, they will take a thousand years to produce this much!\" The God of the Dragon Ancestor cried out in pain.</p><br/><p>\"That lad's moving out again! Yet another one trillion! No, I've got to stop this!\" Noticing that the other party had taken in yet another trillion, the God of the Dragon Ancestor was instantly panicked.</p><br/><p>\"I-I…!\" The God of the Dragon Ancestor was distraught right now.</p><br/><p>In a short period of time, two trillion Shengyang Pills were gone just like that!</p><br/><p>At this moment, Lin Fan's guts were indeed getting bolder. When he had taken the first two trillion, his heart had skipped a small beat. He felt that he might have taken too many. But, when he realized that the God of the Dragon Ancestor did not give off any dissent, Lin Fan's guts only grew bigger.</p><br/><p>\"There's still so much more!\"</p><br/><p>Lin Fan checked out the rest of the Shengyang Pills in the treasure stash. Suddenly, he realized that the two trillion that he had taken were but a drop of the ocean, neither enough to cause an itch nor pain!</p><br/><p>Since that was the case…time to carry on then!</p><br/>\n</div>"}