{"title": "Chapter 824: Ten Trillion Obtained", "id": 824, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-824-ten-trillion-obtained", "volume_title": "Volume 9", "body": "<h1>Chapter 824: Ten Trillion Obtained</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 824: Ten Trillion Obtained</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"This looks like a formation meant to cultivate out Shengyang Pills continuously and endlessly. Even the Mythical Parasol Tree can't compare to this! Within a single breath, the amount of Shengyang Pills produced can practically fill up an ocean!\"</p><br/><p>By now, Lin Fan had already reaped in two trillion Shengyang Pills. If he could swipe this entire treasure stash clean, there was definitely enough to make up ten trillion! But the thing was, if he were to swipe everything away, he might have to end up facing the wrath of the God of the Dragon Ancestor.</p><br/><p>While Lin Fan could be considered as someone thick-skinned, he couldn't possibly swipe the Shengyang Pills of this entire treasure stash clean. That would be a little overboard.</p><br/><p>Lin Fan flew up into the void and opened up his palms to touch that Colossal Dragon that was opening its gigantic mouth.</p><br/><p>'Ding…Heavenly Dragon Formation: The presence of the Essence Spirit of every single generation of God of the Dragon Ancestor of the Colossal Dragon race. Swallows and spits out Saint Spirit Qi into Shengyang Pills.'</p><br/><p>\"Goodness, what a miserable life the previous generations of the God of the Dragon Ancestor lead. To think that they can't even rest after their deaths, and would have to spit out Shengyang Pills day and night.\" Lin Fan pursed his lips while saying.</p><br/><p>At the same time, Lin Fan felt a little disappointed. Initially, he had thought that he would be able to create a Heavenly Dragon Formation within his Paradise as well. But, it seemed impossible right now. Where in the world was he to find the Essence Spirits of the Gods of the Dragon Ancestor? If he were to move this out, the entire Colossal Dragon race might come at his life.</p><br/><p>'Forget it. Time for my hand to roam and touch around more.'</p><br/><p>But, this hand of Lin Fan was far from being messed with. Just like that, another trillion Shengyang Pills were kept into his Paradise. He then stopped and waited patiently. If the other party were unhappy about it, he would definitely cough out. Lin Fan would then be a tactful man and leave. That should mean that all would be fine.</p><br/><p>Outside…!</p><br/><p>\"Take a look! That greedy human had taken yet another trillion! That makes three trillion Shengyang Pills!\" The God of the Dragon Ancestor complained in pain. That was three trillion! For the Colossal Dragon race, that was a fortune tantamount to the Heavens!</p><br/><p>While the Colossal Dragon race might be extremely rich and strong, that was because they had accumulated their fortune and wealth over countless of generations!</p><br/><p>\"What are you heartbroken about! Do you think that our son and those three grandsons aren't worth three trillion!?\" Zi Feng asked.</p><br/><p>\"N-no, wifey! It's just that that human is way too greedy! If I don't give it a stop, he's going to swipe our entire stash of Shengyang Pills clean!\" While the cultivation state of the God of the Dragon Ancestor was heaven defying, now that he had this many Shengyang Pills swiped away, his heart was aching badly.</p><br/><p>Even though Chicky was his son, there ought to be a buffer period for him to start building any sort of relationship with him!</p><br/><p>\"So what if he swipes it clean? Does our Colossal Dragon race have such a small magnanimity in our hearts? He had painstakingly brought up our child and grandchildren! Let alone three trillion, if he wants to take everything, I'm willing to give it all!\" Zi Feng replied.</p><br/><p>When the God of the Dragon Ancestor looked at his own wife, he did not know what to say for a moment or so. This was all his wife's personal opinion! If he were to be swiped clean, how were they going to lead their lives from now on forth!?</p><br/><p>However, in order to pacify his wife, the God of the Dragon Ancestor could only keep those words down his throat. But, those eyes of his were still glaring fixedly at Lin Fan.</p><br/><p>It was as though if Lin Fan would take anymore, he would have it out with this guy.</p><br/><p>\"Eh? That's strange. To think that he hasn't stepped in just yet. Seems like he agrees to me taking a bit more then!\" Lin Fan's heart froze for a little, thinking that the Colossal Dragon race was way too generous!</p><br/><p>Had he known that the Colossal Dragon race would be this generous, he wouldn't have fought with them from the very beginning! He would have even tried his best at maintaining a good relationship with them!</p><br/><p>Lin Fan looked down at that ocean worth of Shengyang Pills. Just that look alone and he could tell that there were still several trillion left.</p><br/><p>Right now, he was only around 5.4 trillion Shengyang Pills short of his ten trillion Shengyang Pills. If he were to put shamelessly take that all at one go, he wondered if anything would happen.</p><br/><p>\"Old Bro, what are you doing? Why are you not taking anything?\" At this moment, Chicky flew over while skipping up and down.</p><br/><p>Lin Fan exchanged a glance with Chicky. Everything that needed to be communicated through was exchanged through their gazes. Both of them stayed that way, just silently looking into one another's eyes. Lin Fan then nodded his head, and Chicky did the same.</p><br/><p>\"Old Bro, don't worry about it. This is my home here. I've already found my parents. What belongs to them belongs to me as well. Since you love Shengyang Pills, Old Bro, then take more of them please.\"</p><br/><p>At this moment, Chicky spread out his wings and flapped, causing a tornado to appear. Dozens of Shengyang Pill dragons were sudden sucked in by this strong force and entered Lin Fan's Paradise.</p><br/><p>\"Old Bro, this is my gift to you. Let us head out!\"</p><br/><p>Chicky did not wait for Lin Fan to reply as he darted for the exit straightaway.</p><br/><p>When the God of the Dragon Ancestor outside caught sight of this, he nearly spat out a mouthful of old blood.</p><br/><p>\"T-this wastrel…! I-I…!!!\" The God of the Dragon Ancestor was shivering uncontrollably as though he was unable to take this loss.</p><br/><p>\"What? This is the first time our son is giving a gift to someone! Are you telling me you're not going to be supporting him?\" Zi Feng threw a stern glare at the God of the Dragon Ancestor and said with a tone of displeasure.</p><br/><p>\"Wifey, we can't indulge him as such! While our family may be pretty wealthy, we can't afford to give away everything to others like this! No, I've got to step forth and hold this back! That's a full 25% of our entire Shengyang Pills stash!\" The God of the Dragon Ancestor said with an anguished heart.</p><br/><p>\"Alright, go on! Sure, go ahead! The moment you go, I'll take my son with me and leave this place back to my mother's home! Since your Colossal Dragon race can't afford the gift, our Phoenix race will afford it then!\" Zi Feng replied coldly.</p><br/><p>\"I…!\" When the God of the Dragon Ancestor caught the expression of his wife, he knew that she wasn't joking about it at all. Eventually, he relented with a sad sigh. This was one hell of a loss acknowledging this son, wasn't it?</p><br/><p>At this moment, Lin Fan was beyond exhilarated. He had truly gotten ten trillion Shengyang Pills!</p><br/><p>Even the Utmost Beings of the Ancient race couldn't compete with the wealth of the Colossal dragon race!</p><br/><p>But on second thoughts, this should be the case as well. After all, the Colossal Dragon race had accumulated this over many generations. This wasn't something that the Utmost Beings could compare with.</p><br/><p>When they arrived at the entrance, there was a bright light screen that covered Lin Fan and Chicky within it. The next time they reappeared, Lin Fan could already see that pained expression of the God of the Dragon Ancestor.</p><br/><p>\"Many thanks, many thanks!\"</p><br/><p>Since he had taken so many things, it was only natural for Lin Fan to express his gratitude.</p><br/><p>\"Rumours have it that the heart of the God of the Dragon Ancestor is extremely magnanimous. Seems like you really live up to the rumors. I think I've taken a little too many Shengyang Pills, so I should probably give it back.\"</p><br/><p>\"Sure, sure!\" The moment the God of the Dragon Ancestor heard these words, his heart leaped with joy. He could not wait for Lin Fan to return these immediately.</p><br/><p>\"No, it's alright. This is a gift for you from the Colossal Dragon race! Please keep it!\" Zi Feng smiled out. Her tone then suddenly changed as she asked her husband in a tone full of implications, \"Hubby, what do YOU think?\"</p><br/><p>\"AH!\" The God of the Dragon Ancestor looked at his own wife, and then at Lin Fan. Eventually, he shut his eyes gently and nodded his head solemnly, \"That's right. This is a gift for you from the Colossal Dragon race.\"</p><br/><p>The moment these words came out, the God of the Dragon Ancestor could even feel his inner heart being stabbed through. That bitter, sour feeling… Oh, how lovely that felt!</p><br/><p>To think that in less than two hours, he would lose multiple trillions of Shengyang Pills, and gain a son and three grandsons!</p><br/><p>Who in the world could actually compare with him for something like this?</p><br/><p>\"Many thanks, many thanks!\"</p><br/><p>At this moment, Lin Fan was overwhelmed with joy in his heart. This was a fortune that had dropped down from the skies! However, Lin Fan was already prepared to reap in quite a fortune when he had first brought Chicky here to seek his kin.</p><br/><p>And indeed, it hadn't gone out of his expectations. The reaping was good and well.</p><br/><p>Only, he did not know how things would be like if he brought Chicky over to the Phoenix race. That was something he was looking forward to now.</p><br/>\n</div>"}