{"title": "Chapter 832: Seclusion! I Must Enter Seclusion!", "id": 832, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-832-seclusion-i-must-enter-seclusion", "volume_title": "Volume 9", "body": "<h1>Chapter 832: Seclusion! I Must Enter Seclusion!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 832: Seclusion! I Must Enter Seclusion!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Goodbye, uncle.\"</p><br/><p>Wang Xiaoming looked at Lin Fan earnestly and waved his hands. After Lin Fan left, he let out an excited look.</p><br/><p>\"All of you heard that, didn't you? In the future, Your Great King is going to be the Head of three worlds! Those geniuses think that they want to come and fight with me? They're way too naïve! Why don't they take a look at who's backing me up? Hmph!\"</p><br/><p>Wang Xiaoming opened up his Paradise and let out all the baddies.</p><br/><p>\"Great King, are you really tired of it all? Are you going to abandon us?\" The moment those baddies got out, they asked in a saddened tone. Right now, they were all on the same ship as Wang Xiaoming! If Wang Xiaoming were to disembark from this ship alone, they would be in for it!</p><br/><p>\"Who said that I was tired?\" Wang Xiaoming cast them a sideglance while asking. If he was tired of it, he would truly be a fool! How meaningful was life like this daily?</p><br/><p>\"But just now…!\"</p><br/><p>\"That was my Uncle Lin! In front of my Uncle Lin, I naturally had to present myself in a slightly aggrieved manner. How else would my Uncle Lin give me any benefits? Do you think that I've messed around my past hundred years for nothing?\"</p><br/><p>\"How could I not understand the thoughts of my Uncle Lin? Your Great King here is the whip for those geniuses out there! I'm here to guide them towards improving themselves. While it may be quite the tough job, but the joys are immense!\"</p><br/><p>Everything that Wang Xiaoming had told Lin Fan earlier on was all made up. While he might have been a little frustrated with being hunted down for the past hundred years, he was totally enjoying himself!</p><br/><p>That Wang Family Head's position? How would he be bothered about that?</p><br/><p>\"Great King, who in the world is that Uncle Lin?\" By now, all these baddies have thoroughly submitted down into the might of Wang Xiaoming.</p><br/><p>They were once baddies who would do any and every crime. If they were targeted down by any powerful beings, it would be one hell of a headache for them. But, their Great King here was different. Even after being targeted by a huge bunch of powerful beings like that, he could still live life extremely flamboyantly! This was something absolutely inconceivable!</p><br/><p>\"Huehue, that is the backing of Your Great King, the strongest being in this entire universe! Alright, what are you guys asking so much for? Let us go forth to the next base! Thankfully, Your Great King is someone with foresight and have already prepared countless of bases ready. As for those geniuses, we'll just play with them slowly!\" Wang Xiaoming was filled with fighting spirit right now. This was especially the case after meeting with Lin Fan. He was now extremely confident!</p><br/><p>Weren't they just geniuses? By the time he toyed with them till the end, Your Great King was going to be a man who would rule over a world as the head of it! As for those guys? They were just the early game fun.</p><br/><p>\"Might be to our Great King!\" While the baddies did not know the actual background of Lin Fan, the moment they heard their Great King speak about it all, they knew that Lin Fan must be one hell of an outrageous fella.</p><br/><p>As long as he was outrageous, that would do!</p><br/><p>…</p><br/><p>Everything within the Xuanhuang World was within Lin Fan's control. While all of those geniuses might be suffering a little here and there now, it was all for the sake of turning them into powerful beings at the very top. Therefore, he could only leave it as such.</p><br/><p>Ancient Saint World, Colossal Dragon race base…</p><br/><p>Lin Fan retracted his consciousness from the Xuanhuang World. Time had only gone by a single day, and that was all.</p><br/><p>Opening the door, Lin Fan felt that it was about time for him to leave the Colossal Dragon race now.</p><br/><p>\"Old Bro…!\"</p><br/><p>At this moment, Chicky flew over from the distance.</p><br/><p>Landing on Lin Fan's shoulders, Chicky raised his head and looked over at the distance, \"Old Bro, it's time for us to continue heading out to make waves for ourselves!\"</p><br/><p>\"Ah, Chicky, Chicky... Bloody hell! I still prefer you going Cuckcuckoo all over. The way you sound when you talk is really a little too despicable!\"</p><br/><p>\"Cuckcuckoo!\"</p><br/><p>Chicky raised his head and crowed while rubbing at Lin Fan's cheeks.</p><br/><p>\"HAHAHA!\"</p><br/><p>Lin Fan burst out laughing. Chicky had been with him since he was young. Therefore, the depth of their relationship was something that needed no explanation.</p><br/><p>\"Eh? You seem to have grown yet another tail, and your cultivation state has raised by quite a bit, eh?\" Lin Fan realized that Chicky's cultivation state had increased once more and was surprised.</p><br/><p>Seemed like Chicky's parents had put in a little something for Chicky, hadn't they?</p><br/><p>\"Cuckcuckoo!\"</p><br/><p>At this moment, three more figures appeared from the edge of the sky.</p><br/><p>Chicken Big, Chicken Two and Chicken Fat, these three perverted sons of Chicky had their cultivation states improved by quite a bit as well. However, they looked exactly the same in terms of appearance, ever so perverted.</p><br/><p>These three perverted chicklings landed on the ground and surrounded Lin Fan's feet. They wanted to follow in the footsteps of their father and reign out over the Pugilistic World!</p><br/><p>\"Hais! This son and three grandsons of mine wish to head out. While I may be unwilling as their mother, all powerful beings are molded out by tribulations. I can only hope that you will take good care of them.\" Zi Feng appeared beside Lin Fan and said. As for the God of the Dragon Ancestor, he could not hope for anything better than this.</p><br/><p>The moment this son and three grandsons of his had appeared, he realized that his position had been dipping down rapidly. And not only that, he had even lost quite a few treasures. This was something that had him torn in his heart.</p><br/><p>\"For sure, for sure!\" Lin Fan cupped his fists together while saying. For Lin Fan, this was something that was only natural.</p><br/><p>\"Dearest Mother, I'll be heading off with my Old Bro now! I'll come visit you when I get the chance!\" Chicky hopped into the embrace of Zi Feng and said coquettishly.</p><br/><p>\"Be careful out there on the roads. Don't act too bravely either!\"</p><br/><p>…</p><br/><p>Lin Fan stood at the sides watching. As for this scene, he had experienced it many times before now. However, this time around, he had truly gained quite a bit from this Colossal Dragon race.</p><br/><p>At the same time, Lin Fan was a man who knew how to be satisfied. If he had continued to hanker after their wealth, it would be a little too much.</p><br/><p>There were still quite a few of the Top Ten Old Ancient Beast races that he hadn't had the chance to visit just yet. Now should be the time for him to take a look then.</p><br/><p>The God of the Dragon Ancestor was trying hard to repress the intention to smile in his heart. When he noticed the human was looking at him, his expression changed slightly as he let out a look of reluctance.</p><br/><p>\"Oh, my son! As your father, I can't bear to watch you leave! Now that all of you are going to leave right now, it will be so much lonelier for your mother and me.\" The God of the Dragon Ancestor said in a sad tone.</p><br/><p>Lin Fan pursed his lips. This God of the Dragon Ancestor was definitely not a responsible father! Those acting skills were way too lousy!</p><br/><p>The moment Zi Feng heard these words come out from the God of the Dragon Ancestor, she nodded her head, heartened. While this son of his might have taken on the physical traits of the Phoenix race in terms of appearance, his bloodline still belonged to that of the Colossal Dragon race.</p><br/><p>From the start, she knew that her husband had some unhappiness over this. But the fact that he was able to say words as such had her feeling extremely heartened.</p><br/><p>\"Dearest Mummy, I don't know how long more it'll take before I can return after leaving with Old Bro this time around. Father is right. Once we leave, you guys will be extremely lonely! How about I leave them behind to accompany you? How does that sound?\" Chicky was contemplating in his head. If he were to bring these three sons with him along and he was to bump into a Hen when they were out, he would have no chance to strike at all!</p><br/><p>If he could leave them here, everything would be fine and dandy!</p><br/><p>Instantly, the three chicklings jerked their heads around furiously and turned to look at their grandfather in a flush. They then ran over to him while twerking their bums. Spreading their wings, they hugged his leg!</p><br/><p>For them, this place had everything, a good accommodation, good food! Furthermore, they could receive the love of their grandma and grandpa! What sort of joy would that be?</p><br/><p>When the God of the Dragon Ancestor caught sight of this, he suddenly realized that something was wrong!</p><br/><p>\"The both of you, since this is the case, I think it would be good to leave the three of them behind then. That would also save you guys some boredom.\" Lin Fan was sniggering in his heart. 'Since you wanted to act, I'll leave them here with you directly and see how you're going to react!'</p><br/><p>The three of them were one more perverted than the other! If he were to keep them here in the Colossal Dragon race, they'd definitely create a ruckus!</p><br/><p>\"That works too!\" Naturally, Zi Feng felt great about this. This would spare them from having no one to accompany them in the future as well!</p><br/><p>The God of the Dragon Ancestor had many things he wanted to say. However, at this moment, he was just stunned. For a moment, he wanted to give himself a few tight slaps. It was all his fault for being a big mouth!</p><br/><p>\"CUCKCUCKOO…!\" The three perverted chickens crowed out in happiness as the bugged the God of the Dragon Ancestor entirely.</p><br/><p>\"I…!\" The God of the Dragon Ancestor suddenly felt this throbbing pain in his heart. He hadn't expected that things would come to this at all!</p><br/><p>\"Chicky, let us leave.\"</p><br/><p>\"Farewell then!\"</p><br/><p>Instantly, Lin Fan bolted into the void.</p><br/><p>And at this moment, the entire world fell silent. The God of the Dragon Ancestor truly had many things he wanted to say. But, when he lowered his head and saw those three grandsons of his who were twerking their bums, he could only weep in his heart silently.</p><br/><p>Seclusion! He must definitely enter seclusion!</p><br/><p>He would head into seclusion later on and never appear ever again…!</p><br/>\n</div>"}