{"title": "Chapter 841: I Am The Strongest Through All Eternity.", "id": 841, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-841-i-am-the-strongest-through-all-eternity", "volume_title": "Volume 9", "body": "<h1>Chapter 841: I Am The Strongest Through All Eternity.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 841: I Am The Strongest Through All Eternity.</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Eh? Where has that human gone to?\"</p><br/><p>Fault was caught in a fluster right now after being surrounded by the two Utmost Beings from both fronts. But, when he took a closer look, he realized that the human had suddenly disappeared since god knows when.</p><br/><p>\"Where has he gone to?\"</p><br/><p>Fault looked intently for him left and right. All living beings would instinctively develop a sense of insecurity towards the unknowns.</p><br/><p>This was especially the case towards someone like this human. In the eyes of Fault, this guy was evil beyond anything else, and shouldn't be looked at with a normal point of view.</p><br/><p>Instantly, Fault's heart skipped a beat as a tremendous power slammed out from his sides. When Fault turned around, he saw the Ancient One packing a punch with a monstrous might at him.</p><br/><p>BAM!</p><br/><p>Receiving this punch, Fault's body exploded out intensely. This punch possessed an incredibly destructive power that burst forth, wreaking havoc all over Fault's body.</p><br/><p>\"Ancient One… You can't do this to me! I've once helped you before!\" Fault yelled out. That half crippled body of his seemed to have been entirely destroyed in the hands of the Ancient One.</p><br/><p>He then churned his powers furiously and repaired it instantly, having it heal up back to new.</p><br/><p>However, the strength of the Ancient One did cause Fault to feel in a little peril right now.</p><br/><p>To think that the Ancient One would have turned stronger after being out of the picture for 10,000 years!</p><br/><p>\"Hmph! Fault, pitting yourself against my Master leaves only death for you.\" The Ancient One's might was supreme as he snorted out coldly. The entire void exploded out from that.</p><br/><p>A duel between Utmost Beings wasn't something that ordinary humans could take part in.</p><br/><p>With every single punch, a single part of the world could be destroyed instantly. For the beings such as the Fox race, if not for the fact that the Ancient One and the others had tried to rein in their auras, the auras alone would be able to crush them into mere bits.</p><br/><p>\"As an Utmost Being of the Ancient race, to think that you would dare acknowledge someone from the Human race as your Master! This is an utter humiliation!\"</p><br/><p>\"Holy f*ck!\"</p><br/><p>\"Stop whacking!\"</p><br/><p>At this moment, Fault did not have any chance of fighting back at all. Yes, he might be an Utmost Being of the Ancient race. However, facing up against two Utmost Beings was practically taking his life away!</p><br/><p>\"All Ancient Eternal!\"</p><br/><p>Fault burst out in rage as he held up the Heavens with both hands, and an eternal aura burst forth from him. Across all ancient times, the Ancient race was the only one that was eternal. Everything else would eventually disappear in the sands of time.</p><br/><p>But, just at this moment, a gigantic palm that was like a cattail leaf fan descended down from the sky and slapped onto Fault's head.</p><br/><p>BAM!</p><br/><p>Oppression. This was downright oppression!</p><br/><p>If it were a one on one fight, Cruel might not be able to take down Fault. But, even if it were a one on one with the Ancient One, Fault would definitely be beaten to a pulp.</p><br/><p>Fault's body was like a bullet that was dug deep into the ground right now. The entire Earth began to crack out like the back of a turtle's shell. Every single crack extended into deep crevasses that spread out in all directions.</p><br/><p>\"Ancient One! Don't you go overboard!\"</p><br/><p>Fault's enraged roar boomed out deep down from the abyss dug in the ground. He hadn't expected something as such to happen to him. He raised his head and looked at the two figures in the sky while his eyes flashed with a grim look.</p><br/><p>He knew that things weren't going to end this easily this time around. Faced against two Utmost Beings, he did not stand a single chance of victory at all.</p><br/><p>This was especially the case now that the Ancient One had returned and was serving that Human. This was going to be quite the blow for the Ancient race.</p><br/><p>'No, I've got to think of a way to escape. Otherwise, I might really die right here.'</p><br/><p>…</p><br/><p>When the members of the Fox race saw how Fault was being suppressed so badly, all of them held their breaths in excitement. No one dared to breathe out at all. This was all too explosive in their minds!</p><br/><p>If they hadn't witnessed this for themselves, they would have found it hard to believe that these past Utmost Beings of the Ancient race would be helping them!</p><br/><p>At this moment, their hearts were all bubbling with curiosity. Who in the world was that human? To think that he could even subjugate the Utmost Beings of the Ancient race. This was something absolutely inconceivable for the beings of the thousands of races!</p><br/><p>BOOM!</p><br/><p>Fault floated out gently from that deep abyss beneath as he glared at the two Utmost Beings with a sharp gaze, \"You guys will suffer due retribution for defecting to the Human's side. The day the Heaven's Will awakens, you will pay the price for your actions!\"</p><br/><p>\"ARGH!\"</p><br/><p>At that moment, Fault suddenly screamed out as a boundless aura surged out from his body. A series of eternal air currents wrapped around his body. Every single eternal air current carried with it a force which seemed enough to destroy the entire world.</p><br/><p>Pshew! Pshew!</p><br/><p>Like giant pythons, the eternal air currents wrapped themselves one another. Before they knew it, Fault was gripping onto a long spear.</p><br/><p>\"Dao of Destruction!\"</p><br/><p>Fault's hands trembled as he roared out. As he pierced out with that spear, a bright flash of light shone out.</p><br/><p>\"Ancient One, Cruel… you guys want to take down Your Utmost? That will have to depend on whether you have the capabilities! This is a legendary weapon that is given by the Heaven's Will! Even if you're THE Ancient One, so what?\"</p><br/><p>This single spear of Fault contained thousands of Dao within it. The moment he deployed it, it sent forth a devastating aura as ripples began to blossom out in the air like flowers. Using an abnormal method, it caged up the Ancient One and Cruel within.</p><br/><p>\"All of you can go to hell!\"</p><br/><p>\"All Ancient Impertinence! Revolution of the Heaven's Will!\"</p><br/><p>On the tip of Fault's spear, a Reincarnation Millstone appeared suddenly. This Reincarnation Millstone let off a bright radiance as though all the reincarnations of the Infinite Worlds were captured within it. A series of mysterious air currents burst forth from this Reincarnation Millstone and bolted out towards the two Utmost Beings.</p><br/><p>The Ancient One was composed, \"You're not his opponent. Leave this to me.\"</p><br/><p>Cruel stood behind the Ancient One and nodded his head silently.</p><br/><p>\"Fault, I've said this before 10,000 years ago. You're too reliant on the Heaven's Will. Because of that, your strength will always be the weakest amongst the Utmost Beings. Today, I shall have you know of the importance of your own personal strength!\"</p><br/><p>\"Even a thousand of those treasures wouldn't be able to endure a single palm strike of mine!\"</p><br/><p>BOOM!</p><br/><p>At this moment, the Ancient One took a step forth while a titanic illusory figure floated behind him.</p><br/><p>\"Utmost Being's Body!\"</p><br/><p>When Fault caught sight of this illusory figure, his face changed as though it was filled with incredulity.</p><br/><p>\"That's right. This is the highest achievement an Utmost Being can ever attain, the Utmost Being's Body. This is something you will never be able to achieve in all of eternity.\"</p><br/><p>A boundless palm descended from the sky with five fingers as thick as mountains individually. Gripping together tightly, the five fingers were akin to a claw as they grabbed out at the Reincarnation Millstone.</p><br/><p>Dong!</p><br/><p>The air current that was wrapping around the Reincarnation Millstone began to explode out one after another as though they had just met some unstoppable obstacle, before turning into dust.</p><br/><p>\"Impossible! How can this be possible!?\"</p><br/><p>When Fault caught sight of his, the color drained from his face as he could not believe what had just happened.</p><br/><p>\"Nothing is impossible. You will never be able to understand the reason why an Utmost Being is termed as an Utmost Being. In these past 10,000 years, while Your Utmost has remained silent, the improvement of Your Utmost has definitely been way further than any of you.\"</p><br/><p>\"I, the Ancient One, am the Heavens! I am the Ancient race's strongest in all eternity!\"</p><br/><p>BOOM!</p><br/><p>A claw that covered the entire sky as though it was some unworldly demon's descent appeared. When the surrounding Fox race beings caught sight of that colossal claw, they all shivered in fear. That aura was simply way too formidable.</p><br/><p>In their eyes, this was no different from the arrival of Doomsday.</p><br/><p>\"To think that the Ancient One would be this strong!\"</p><br/><p>Even Lin Fan felt rattled over this. He hadn't seen the Ancient One go all out before. And right now, the battle prowess given off by the Ancient One was turning out to be extremely sick!</p><br/><p>Perhaps even that Evil Lord wouldn't be a match for a single move at all!</p><br/><p>\"NO! YOU ARE A TRAITOR! OUR ANCIENT RACE DOES NOT HAVE AN UTMOST BEING SUCH AS YOURSELF! ANYTHING UNDER THE HEAVEN'S WILL BELONGS TO IT. AND YET, YOU COVET ON SHAKING THE POSITION OF THE HEAVEN'S WILL! THIS IS OUTRIGHT HERESY! GO TO HELL!\"</p><br/><p>Fault screamed out as green veins popped out of his head. That berserk aura of his was even causing the entire world to start shaking due to it. As he waved his spear forth, the entire world was faced with a power of annihilation.</p><br/>\n</div>"}