{"title": "Chapter 843: The Dignity Of The Utmost Beings Is Entirely Gone", "id": 843, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-843-the-dignity-of-the-utmost-beings-is-entirely-gone", "volume_title": "Volume 9", "body": "<h1>Chapter 843: The Dignity Of The Utmost Beings Is Entirely Gone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 843: The Dignity Of The Utmost Beings Is Entirely Gone</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"What's wrong with Fault?\"</p><br/><p>At this moment, the surrounding Fox race beings had this thought popping up in their minds. They could tell that there was something different about the expression on Fault's face. That authoritative body of his was breaking out in shivers, as though something had happened.</p><br/><p>But, they clearly did not spot anything happening! Why would the Utmost Being Fault turn like this all of a sudden?</p><br/><p>Pshew!</p><br/><p>At this moment, Fault jerked his head around furiously. Those bloodshot eyes of his which were filled with an endless lust caused the hearts of the Fox race beings to skip a beat. It was as though there was a part of their body that were being voyeured at right now!</p><br/><p>In fact, they had discovered that as the gaze of the Utmost Being Fault passed by their bodies, it had eventually lingered down on their lower bodies!</p><br/><p>'It can't be, right…?'</p><br/><p>The Fox race beings could not help but break into a cold sweat. All of this was way too horrifying.</p><br/><p>\"ARGHHHHHHHHHHHHHHHH!\"</p><br/><p>Fault howled out in rage, \"DAMNED HUMAN! JUST WHAT HAVE YOU DONE TO ME? \"</p><br/><p>Lin Fan shrugged his shoulders, \"Yours Truly is just standing right here. What could I have done to you?\"</p><br/><p>\"Alright, let me explain to all of you guys.\"</p><br/><p>At this moment, the Spirit of Biggra jumped out and opened his mouth. From his mouth, he spat out a cloudy smoke that slowly transformed into a whiteboard.</p><br/><p>It was as though the Spirit of Biggra had turned into a teacher or something right now!</p><br/><p>\"Alright, everyone please look over here. Let me explain just what is it you're seeing here.\"</p><br/><p>\"Good afternoon, everyone. I am called the Spirit of Biggra, and am a Pill Spirit that was evolved from a pill. And of course, this Power of Biggra here is none other than my masterpiece.\"</p><br/><p>\"After swallowing the Power of Biggra, the first sensation would be the flushing red of one's face. Now, if everyone would just take a look, the face of the Utmost Being Fault is displaying the first reaction right now.\"</p><br/><p>The Spirit of Biggra had transformed into a lecturer, and was now describing his own effects right now.</p><br/><p>On the other hand, Fault's heart was thumping furiously. He could already sense himself losing control towards this mist, which had taken over his heart completely.</p><br/><p>\"And now, the second reaction would be the intense sweeping of one's gaze. At this point, he is seeking for prey. Everyone, check it out. The eyes of the Utmost Being Fault are darting about right now, aren't they?\" The Spirit of Biggra asked.</p><br/><p>\"That's right!\" The Fox race beings could not help but nod their heads in agreement like obedient students who were listening attentively. They nodded their heads repeatedly, feeling extremely mystified.</p><br/><p>\"And the third reaction is going to be outrageous! He will then let out some carnal lust, leading to his groin area protruding up straight into the Heavens! Look, just like that!\" The Spirit of Biggra pointed out at the crotch of the Utmost Being Fault and explained.</p><br/><p>\"Wow!\"</p><br/><p>When the Fox race beings caught sight of this, they could not help but gasp out.</p><br/><p>At this point, the Female Empress was already entirely flabbergasted. This was clearly the most dangerous moment! Why had things suddenly changed like this?</p><br/><p>And at this moment, Fault could only feel his groin swelling up with an intolerable sensation. There was a fiery blaze that was burning within his body as though it could burst out at any moment.</p><br/><p>\"Cough, cough!\"</p><br/><p>\"Now, this fourth reaction is going to be heaven defying now. He is going to lose complete control over his instincts. Anything that's available in the world will be something that he can poke! And this penetrative poking will be far from ordinary! It can practically cause the Gods and Ghosts to all weep over it! This is something that one can barely resist! There, check it out! He's going to make his move!\" The Spirit of Biggra yelled out.</p><br/><p>\"WOW!\"</p><br/><p>The beings of the Fox race yelled out together. It was as though their views about life, the world, and values were all refreshed at this point.</p><br/><p>\"ROARRRRRRRRRRRRRRRRRRRRRRR!!!\"</p><br/><p>Fault howled out furiously like a wild beast. His entire body was flushed red as though it was burning with fiery flames. Those eyes that were filled with an endless lust were glaring right at Lin Fan.</p><br/><p>There was only a single thought within Fault's eyes right now: Vent.</p><br/><p>And his target was none other than Lin Fan!</p><br/><p>The Ancient One and Cruel heaved in a deep breath each. Both of them had already witnessed the power of the Spirit of Biggra from within the Paradise.</p><br/><p>It was just insanely twisted!</p><br/><p>\"I'M GOING TO POKE YOU TO DEATH!\"</p><br/><p>At this moment, Fault had lost his sanity entirely as he grabbed out wildly with his palms and yelled while clutching towards Lin Fan.</p><br/><p>\"Holy f*ck! Out of this many people, to think that he would have taken a liking to Yours Truly!\" Lin Fan yelled out while kicking out with his leg furiously.</p><br/><p>\"True Origins Crushing Kick!\"</p><br/><p>This leg could be considered as one that could shake the entire world, and cause Gods and Ghosts alike to cry out. This was a single kick that was more terrifying than anything in the world combined.</p><br/><p>With a sinister feeling of utmost elegance, this kick floated over.</p><br/><p>BAM!</p><br/><p>'Ding…True Origins Crushing Kick Experience Points +10,000.'</p><br/><p>As for Fault, he had long since lost any sense of self. This single kick did not bring forth any effect on him.</p><br/><p>\"Holy f*ck!\"</p><br/><p>Lin Fan shouted out. He hadn't expected that something as such would happen!</p><br/><p>Lin Fan had truly not tried the True Origins Crushing Kick on any living being that had received the power of the Spirit of Biggra yet. Initially, he thought that Fault would lose his fighting spirit. But, to think that it would cause him to get even more ferocious instead!</p><br/><p>\"Old Bro! These are all useless! My powers have already improved such that these skills can no longer cause him any damage!\" The Spirit of Biggra yelled out to Lin Fan.</p><br/><p>The moment Lin Fan heard this, his mind blew up. He wanted to cuss in return. But, all of a sudden, Fault had appeared before Lin Fan.</p><br/><p>\"Ancient One, Cruel! You guys, go!\" Lin Fan gave his hand a huge wave. But, to think that the Ancient One and Cruel would both retreat furiously while shaking their heads rapidly!</p><br/><p>In their eyes, having to hug together with this fella was simply way too disgusting!</p><br/><p>\"HOOOOOOLY F*CK…!!!\"</p><br/><p>Lin Fan was taken aback. Who would have thought that those two fellas would actually throw shade on Fault? 'You guys are the same beings as Fault! How can you guys scorn him as such?'</p><br/><p>\"Seems like I've got no choice but to unleash my ultimate move then.\"</p><br/><p>\"Big Ancient Demon! Come on out!\"</p><br/><p>Lin Fan yelled out and released the Big Ancient Demon immediately. The moment the Big Ancient Demon came forth, he roared in glory. He loved dueling the most, especially the one that had intense physical skin contact!</p><br/><p>\"Demon Emperor, take him down!\" Lin Fan waved with his hand.</p><br/><p>\"Who dares to be brazen?\" The Big Ancient Demon howled out in rage. However, his face changed immediately into one of shock as he could not help but proclaim, \"NOT AGAIN!\"</p><br/><p>That affair the previous time was something that the Big Ancient Demon would never forget at all. He had hugged together with the other fella and just whacked on. That single event had long created a deep, long lasting trauma in the heart of the Big Ancient Demon.</p><br/><p>And just as the Big Ancient Demon was still lamenting in reluctance, Fault had already leaped over and pushed the Big Ancient Demon down onto the ground immediately.</p><br/><p>\"DAMN IT! I'm the Demon Emperor! How dare you push the Demon Emperor down onto the ground?\" The Big Ancient Demon jerked his body with a tyrannical aura overflowing from him as he pushed Fault down instead.</p><br/><p>All the surrounding Fox race beings were long stupefied by now.</p><br/><p>They felt as though they had seen a ghost!</p><br/><p>As for the Female Empress, everything was way, way too fuzzy right now. If she hadn't witnessed this for herself, she wouldn't have believed this scene right now even at the death of her.</p><br/><p>\"Big Ancient Demon! Good one! Hold him right there!\" Lin Fan instantly took out a red brick from his storage.</p><br/><p>At this moment, what was needed was a good tight slap to his head with the brick before crushing the other party harshly.</p><br/><p>\"Come on!\" The Big Ancient Demon hollered out. As for the way this situation would play out, he was long familiar with it.</p><br/><p>\"Hmph! To think that this crotch thing would dare to cross at Your Emperor? This is just plain dreaming right now!\" The Big Ancient Demon bellowed out and used all his strength to pin down Fault.</p><br/><p>\"So tragic!\"</p><br/><p>When the Ancient One and Cruel caught sight of Fault being pinned under, they could only shake their heads and sigh.</p><br/><p>There was completely no dignity left for the Utmost Beings.</p><br/>\n</div>"}