{"title": "Chapter 855: Colossal Shark Race", "id": 855, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-855-colossal-shark-race", "volume_title": "Volume 9", "body": "<h1>Chapter 855: Colossal Shark Race</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 855: Colossal Shark Race</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>The two elders who had been sealing up the entrance of the Cloud Sect were totally dumbfounded by now. They hadn't expected that things would turn out as such!</p><br/><p>To think that Sha Jingwang would be slammed to death with a single palm just like that!</p><br/><p>Bloody mother*cker! How did things come to this?</p><br/><p>In their opinion, the Cloud Sect was definitely doomed to fall this time around. But, who would have thought that this guy would appear?</p><br/><p>And they knew about this fella as well! He was the human who was once invited to the Cloud Sect as a guest!</p><br/><p>But, to think that he would turn this strong upon his reappearance!</p><br/><p>Thud.</p><br/><p>\"Grandmaster! Spare our lives! We must have been blinded at that moment! Please spare our lives!\" The two elders begged fervently, hoping that the Grandmaster could spare their lives.</p><br/><p>Had they known that things would come to this, they would have never dared to side with the Ancient race even if it cost them their lives! But right now, it was all too late for those words.</p><br/><p>\"Grandmaster Yun, this is an affair of the Cloud Sect. I'll leave it to you.\" Lin Fan hated people who sided with the Ancient race the most.</p><br/><p>At this moment, Grandmaster Yun was extremely infuriated as well. Slapping out with two palm strikes, he crippled the elders instantly.</p><br/><p>\"Hmph! Betraying the sect is something that even death will not compensate enough. But, on account of your contributions as elders of the sect, I shall strip you guys of your cultivation states and have you locked up in jail for all eternity.\" Grandmaster Yun said.</p><br/><p>\"NOOOOOO…!\"</p><br/><p>The two elders suddenly realized that they were crippled right now as they howled out tragically. What was the difference between killing them and turning them into crippled handicaps?</p><br/><p>\"Grandmaster Yun, what do you intend to do from here on?\" Lin Fan allowed his consciousness to slip into the pocket dimension. He discovered that the aura of the Founder Ancestor of the Cloud Sect was no longer present. Seemed like he must have dissipated entirely.</p><br/><p>\"Hais! Now that the barrier of the sect has been broken, it can be considered as useless. Seems like we can only seek out a new place.\" Grandmaster Yun replied.</p><br/><p>Lin Fan pondered for a moment before speaking up, \"How about coming to the Xuanhuang World? I've already integrated with that place. There should be no need to worry about the Ancient race.\"</p><br/><p>\"Alright.\" Grandmaster Yun did not think twice.</p><br/><p>Lin Fan spread out his fingers and brought all the structures of the Cloud Sect within the Xuanhuang World. Now that the Xuanhuang World had been cultivated by Lin Fan, safety was definitely not an issue for the masses to cultivate there.</p><br/><p>At the same time, Grandmaster Yun was a righteous and just man. After he entered the Xuanhuang World, he would be able to converse well with the Grandmaster of Glory Sect.</p><br/><p>After arranging everything, Lin Fan noticed a pair of eyes that had been following him intently. When Lin Fan turned around, he realized that it was Fairy Hongyun.</p><br/><p>\"Still doing okay?\" Fairy Hongyun walked up and inquired softly.</p><br/><p>\"Yes, not bad.\" Lin Fan nodded his head. \"Later on, just head over to the Xuanhuang World first. Once we chase away the Ancient race, there will be much more free time by then.\"</p><br/><p>Lin Fan's words could be taken either way. He did not know if Fairy Hongyun would be able to catch his drift.</p><br/><p>\"Understood.\" Fairy Hongyun nodded her head and did not say anything more. This was quite the cold conversation to have for this reunion after a long time.</p><br/><p>\"Lin Fan, what are you preparing to do now?\" Grandmaster Yun asked.</p><br/><p>\"Since this Colossal Shark race chose to side with the Ancient race, I'll go over to their base and check it out properly.\" Lin Fan was in urgent need of Shengyang Pills right now. Since this Colossal Shark race chose to jump out by itself, there was no way Lin Fan could let this off just like this, right?</p><br/><p>As one of the Top Ten Old Ancient Beast races, there should definitely be no lack of treasures they had.</p><br/><p>\"But, you've got to be careful. The Shark God of the Colossal Shark race is extremely formidable, and there are many old-timers in their midst. If the situation doesn't seem right, it'd be best to run off.\" Grandmaster Yun warned.</p><br/><p>\"Yes, rest assured.\"</p><br/><p>Lin Fan then swept his robes and had everyone from top to toe of the Cloud Sect kept into the Xuanhuang World. Lin Fan was only accumulating strength right now. The only way for him to have more confidence in fighting against the Ancient race was through increasing his strength and forces.</p><br/><p>PSHEW!</p><br/><p>Darting into the void, Lin Fan headed for the base of the Colossal Shark race.</p><br/><p>…</p><br/><p>A palace stood tall within a vast ocean. There was a ruler seated on his royal throne and playing around with a precious pearl in his hand.</p><br/><p>All of a sudden, the pearl shattered into dust that scattered down on the ground.</p><br/><p>All the surrounding beings of the Colossal Shark race lowered their heads. Under this repressing aura that was emanating forth, none of them dared to utter a single word.</p><br/><p>\"B*stard thing.\" The God of the Colossal Shark race that sat on the throne finally spoke up. His eyes were glowing with a glint of frosty fury.</p><br/><p>\"God, the tributes are here.\"</p><br/><p>At this moment, a member of the Colossal Shark race walked in from outside.</p><br/><p>Following him, a cage was carried in by several other members of the Colossal Shark race. There were four kids that were locked up in the cages. These kids had smooth and tender skin, looking full of spirit.</p><br/><p>When they caught sight of everything before them, the four little began to bawl out loudly.</p><br/><p>The Shark God inhaled deeply, sucking in the four children into his mouth, then started chewing down. All of these pieces of meat contained the purest Spirit Qi.</p><br/><p>It was only at this moment that the Shark God's anger was slightly appeased.</p><br/><p>\"Not bad.\"</p><br/><p>The Shark God stretched a finger into his mouth and pulled out a bone from one of the corpses of the children, using it to pick at his teeth before biting this bone into dust again.</p><br/><p>\"These bunch of trashes could even fail something such as destroying the Cloud Sect. They are seriously a disgrace to our Colossal Shark race.\" The Shark God said.</p><br/><p>Everyone below trembled in fright and did not dare to reply. This was because they knew that the Shark God was still infuriated. No one dared to bump heads with him at this moment.</p><br/><p>…</p><br/><p>After a long time, Lin Fan arrived at the water region where the Colossal Shark race should reside based on the old records.</p><br/><p>\"Indeed, they are one of the Top Ten Old Ancient Beast races. To think that they would occupy an ocean that is tens of millions of miles wide in radius. With such a huge territory, there must be abundant resources and wealth!\" Lin Fan checked out this patch of limitless ocean region. All of a sudden, he caught sight of a black shadow up ahead. He then flew towards the black shadow.</p><br/><p>Above the water surface…</p><br/><p>A wooden barrel was floating on the surface of the water. Within the barrel, a young boy checked out his surroundings warily while waving a wooden bat in his hands.</p><br/><p>The wooden barrel was extremely tiny, such that even a single wave could flip it over. It was undoubtedly a fool's dream to expect that this thing could cross this entire ocean. And not only that, under the circumstances of having no food, how long could this guy sustain himself?</p><br/><p>\"I'll never give up! I have to get outside and learn some capabilities so that I can rescue my race members!\" The eyes of the young boy were shining with a glint of resolution.</p><br/><p>Broop, broop, broop!</p><br/><p>All of a sudden, there was a huge disturbance on the surface of the ocean.</p><br/><p>The young boy yelped out in astonishment. Right before his very eyes, there was a gigantic Sea Beast that was opening its huge mouth. The cruel eyes of the beast were glaring straight at that young boy who was in the wooden barrel. It then lunged over greedily, wanting to eat him up in a single mouthful.</p><br/><p>\"AHHHHH! SAVE MEEEEE!\"</p><br/><p>The young boy screamed out in fear before shutting his eyes tightly, not daring to watch everything before him. After a long time, when the young boy realized that he was still fine and alive, he finally opened his eyes slowly.</p><br/><p>All he saw was that gigantic Sea Beast floating on the surface of the ocean after being cut into two. The blood stained the entire ocean, attracting many predators.</p><br/><p>\"Kid, what are you doing?\"</p><br/><p>The moment the young boy heard this voice, his heart skipped a beat, feeling a little afraid. But when he caught sight of that figure, he heaved out a sigh of relief.</p><br/><p>Nevertheless, he still whispered out in a hushed tone, \"What sort of a person are you?\"</p><br/><p>Lin Fan looked at the kid and chuckled out asking, \"What do you think?\"</p><br/><p>\"A good person?\" The boy asked.</p><br/><p>\"Yes, I'm a good person then! Now, why are you here all alone?\" Lin Fan asked.</p><br/><p>\"I-I…!\"</p><br/><p>After hearing everything the kid said, Lin Fan could not help but feel impressed with the courage of the boy. To think that he would dare to set sail with this setup! If not for the fact that he had bumped into Lin Fan, he would have long turned into the food of the Sea Beast!</p><br/><p>But by the looks of things, Lin Fan garnered that he must have arrived at the correct location as well.</p><br/>\n</div>"}