{"title": "Chapter 865: Horrifying Insect Ancestor", "id": 865, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-865-horrifying-insect-ancestor", "volume_title": "Volume 9", "body": "<h1>Chapter 865: Horrifying Insect Ancestor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 865: Horrifying Insect Ancestor</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>A place where humongous mountains stood…</p><br/><p>There was a cluster of mountains surrounding this area. In the Ancient Saint World, the Heaven Spirit Sect was but a negligibly tiny sect, and that was all.</p><br/><p>The Grandmaster of the Heaven Spirit Sect was someone of the Spirit race. When he had ascended from the Lower World, he was saved by a powerful being due to some fated encounter, and was, thus, saved from the evil grasps of the Ancient race. Later on, when his cultivation reached a pretty decent standard, he created his own sect in order to give the Spirit race beings a respite from the Hells outside. Thus, the Heaven Spirit Sect was created.</p><br/><p>There were countless Spirit race beings who were being held captive and reared by the Colossal Shark race. As such, the final mission of the Heaven Spirit Sect was to be able to save those fellow Spirit race beings.</p><br/><p>As such, after every disciple became somewhat accomplished in their cultivation, they would head over there to attempt and save their fellow Spirit race beings. However, this wasn't a compulsory mission, nor was there any requirement for them to complete. For the sect, any Spirit race being saved would be good enough</p><br/><p>Over a few couple hundred years, the number of Spirit race beings that were saved from that place amounted to the thousands. However, there were countless Spirit race beings who had fallen there because of it as well.</p><br/><p>As one of the Top Ten Old Ancient Beast races, the Colossal Shark race was extremely formidable, and wasn't something that they could stand shoulder to shoulder with.</p><br/><p>But today, the Heaven Spirit Sect was faced with the biggest calamity in their entire history.</p><br/><p>On this bright and sunny day, in these wild mountainous regions, the disciples of the Heaven Spirit Sect were just out cultivating as always. But all of a sudden, a humongous mountain suddenly appeared out of nowhere.</p><br/><p>From the mountain, a crack tore open and countless monsters swarmed out.</p><br/><p>These monsters did not have a human form; they were like insects. They had many legs and heads, and their bodies were covered by a plate of armor.</p><br/><p>These armors were extremely resilient and tough. Normal martial arts and mystic skills wouldn't be able to cause any damage to them at all.</p><br/><p>The leader of this Insect race was even more formidable, commandeering countless Insect race beings. Even the Grandmaster of the Heaven Spirit Sect wasn't a match for him at all.</p><br/><p>At this moment, the outside area of the Heaven Spirit Sect was filled with cricketing sounds made by these dense clusters of Insect race beings.</p><br/><p>Facing these Insect race beings, the disciples of the Heaven Spirit Sect did not have any way of fighting back at all. The capabilities of these Insect race beings were extremely sinister. Some of them had poison from top to toe, and were rotting everything around them. Even if one's powers were extremely profound such that they were able to form an Astral Qi shield, they wouldn't be able to block against it at all.</p><br/><p>The Grandmaster of the Heaven Spirit Sect, Ling Tianzi, had headed forth alone to try and slay the leader of the Insect race. However, he had a limb bitten off in return.</p><br/><p>With a cultivation of Divine celestial level 8 state, Ling Tianzi could regenerate his limbs if they were broken. However, in the area from where his limb was bitten off, there was a mysterious poison that shrouded and ate into the area consistently, rendering him unable to regrow that limb.</p><br/><p>At the same time, the poison was just corroding into his powers continuously. If he did not defend against it, even his Universal Elixir might be consumed by it.</p><br/><p>\"Cricket…\"</p><br/><p>Countless enormous sized Insect race beings that seemed like mountains surrounded the entire Heaven Spirit Sect.</p><br/><p>At this moment, there was a light screen that was shielding the Heaven Spirit Sect. However, this light screen was fluttering endlessly, as though it could break down at any moment.</p><br/><p>This was the Protective Formation of the Heaven Spirit Sect. But, by the looks of things right now, it's not going to hold out for much longer.</p><br/><p>\"I've already informed all the disciples who are out on expeditions to not return. I have no idea where these monsters hail from, for them to be this strong.\" Ling Tianzi's face was grim. He did not bear a single strand of hope in his heart right now.</p><br/><p>As he raised his head, all of those monsters that were mountain-sized individually seemed extremely horrifying.</p><br/><p>\"To think that the thousands of races would have the guts to set up a base in the territory of my Insect race. This is undoubtedly just seeking death.\" A loud voice boomed out. It seemed as though this Insect race was familiar with the thousands of races.</p><br/><p>\"Grandmaster, what should we do now?\" The elders of the Heaven Spirit Sect asked with a solemn look. The sudden appearance of these terrifying Insect race beings had them unable to react in time, making them no match for the invaders. By the time they realized what was happening, the disciples were already in a mess of casualties.</p><br/><p>And right now, they were all cramped up in the Main Hall. All their other surrounding territories had fallen entirely into the hands of the enemies.</p><br/><p>Ling Tianzi did not reply. That dark face of his right now was enough to express everything he felt.</p><br/><p>Today was probably going to be the day the Heaven Spirit Sect perished. However, as long as they had some legacy remaining outside, the spirit of the Heaven Spirit Sect would never be lost.</p><br/><p>Ling Tianzi waved his hands, indicating for the disciples to leave. He then stood at the edge of the barrier and looked at these monsters, \"Just what sort of a race are you guys? Why are you guys striking out at the Heaven Spirit Sect?\"</p><br/><p>\"Cricket…!\"</p><br/><p>These Insect race beings did not reply. However, their feelers were waving around, giving off a really eerie sound. At this moment, the Insect race beings who were hogging up the area around the Heaven Spirit Sect made way and the Insect race leader who tore off Ling Tianzi's limb appeared in the gaps.</p><br/><p>Even though the body of this Insect race being wasn't all that huge, he was pretty tall, with eight feelers wriggling around in the air above. That face was filled with eight olive green eyes that gave off a savage glint.</p><br/><p>\"Cricket... Spirit race, it's been several dozens of thousands of years since I've had a taste.\" The Insect Ancestor spoke in human tongue. However, its voice was extremely frosty and cold, giving off a chilling aura.</p><br/><p>\"The scent of the Spirit race alone has Your Ancestor here reminiscing over it. A long, long time ago, there was also a Spirit race being who did not know what was good for him, and wanted to come and kill Your Insect Ancestor. Eventually, he was just devoured by Your Insect Ancestor here.\"</p><br/><p>\"Oh! Your Ancestor here still remembers the name of that Spirit race being. If I'm not mistaken, he was called the Spirit King Emperor.\"</p><br/><p>\"Cricket. That Spirit race being was way stronger than any of you guys here.\"</p><br/><p>The moment Ling Tianzi heard these words, his face froze up as he let out a look of horror and disbelief.</p><br/><p>At this moment, the Insect Ancestor spoke up once more, \"Oh, right. Your bloodline is extremely similar to that Spirit King Emperor. I reckon that that Spirit King Emperor must be your ancestor then, eh?\"</p><br/><p>\"That's right. He must be your ancestor.\"</p><br/><p>\"But, what a pity! You don't even have half of what your ancestor had in terms of strength.\"</p><br/><p>All of a sudden, the body of the Insect Ancestor started to transform and change. That ugly outer shell was discarded, and out came a middle-aged man with an authoritative-looking, middle-aged man.</p><br/><p>\"Ancestor…!\"</p><br/><p>When Ling Tianzi caught sight of this middle-aged man, he could not help but mumble out to himself. But, his face changed all of a sudden. Wait, this wasn't right. This wasn't the ancestor.</p><br/><p>\"Cricket…Your Ancestor here has devoured countless living beings. Everything that belongs to them is always recorded within my memories.\"</p><br/><p>The middle-aged man gave off a sinister laughter, then transformed once more to return to that hideous body from earlier on.</p><br/><p>The Insect race was the most horrifying race in the Infinite Worlds. Because of that, the Ancient Saint World sealed them up and prevented them from ascending.</p><br/><p>Because of the carnivorous nature of the Insect race, they were no longer satisfied with their own Lower World. After traveling through the Infinite Worlds, they had eradicated countless races and species.</p><br/><p>Now that the barrier had opened up, the Insect race finally ascended to the Ancient Saint World with an indomitable attitude, bent on devouring the thousands of races.</p><br/><p>This was the pact between the Ancient race and the Insect race.</p><br/><p>The Infinite Worlds had opened up numerous times, and like this, the Insect race had ascended the same number of times.</p><br/><p>For the thousands of races out there, the Heaven's Will of the Ancient Saint World wasn't the only thing they needed to fight against. They needed to deal with that horrifying Insect race as well.</p><br/><p>The Spirit King Emperor was one of the supreme powerful beings during the opening of the Infinite Worlds the previous time around. However, he too fell in the hands of the Insect Ancestor.</p><br/><p>\"Living beings of the Spirit race, just surrender and give up now. Do you guys really think that this barrier is able to keep you safe within? That's undoubtedly a fool's dream.\"</p><br/><p>Using an extremely sharp feeler, the Insect Ancestor tapped on the barrier gently.</p><br/><p>Creak.</p><br/><p>Instantly, the barrier shattered apart and revealed the Heaven Spirit Sect entirely.</p><br/><p>\"How could this be?\"</p><br/><p>When Ling Tianzi caught sight of everything, his heart took a dive as though he could not believe everything right now.</p><br/>\n</div>"}