{"title": "Chapter 876: F*cking With Me?", "id": 876, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-876-fcking-with-me", "volume_title": "Volume 9", "body": "<h1>Chapter 876: F*cking With Me?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 876: F*cking With Me?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Pshew! Pshew!</p><br/><p>\"What is happening?\"</p><br/><p>Lin Fan was just completely stunned by this situation before him. They were just motherf*cking playing with him!</p><br/><p>All he saw was a single tombstone that vibrated violently before bolting up into the sky, diving straight into that endless void. Lin Fan wanted to stretch out his hands to stop it. But all of a sudden, he stopped himself. His little guts were feeling ever slightly so unnerved, and he did not dare to act too brazenly.</p><br/><p>All of these tombstones were shrouded with a boundless amount of power. Just the aura alone was enough to rattle one's hearts. Lin Fan was truly afraid that some sh*t might just blow over if he were to try and stop it.</p><br/><p>\"ROARR!\"</p><br/><p>All of a sudden, those sinister looking tombstones emitted a series of ghastly black mist.</p><br/><p>In a split second, an illusory figure appeared above the tombstone of the Death Demonic God Shi Yan of the Ancient race. This illusory figure was shrouded with a deathly aura, as a long black robe was draped all over its body while it wielded a black scythe.</p><br/><p>Above the scythe were black thunderbolts that were coiling around the blade that possessed a boundless aura of death.</p><br/><p>Gulp.</p><br/><p>Lin Fan swallowed his saliva. Such a formidable amount of power! To think that it could possess such a formidable might even despite being dead! If the true body were to descend down, wouldn't Yours Truly's anus be pierced through with a huge hole?</p><br/><p>Following tightly behind, illusory figures appeared on top of the various tombstones. All of these illusory figures started spreading out and appearing one after another, forming a dense crowd of them. All of them were top tiered powerful beings with extremely fearsome auras. With this many of them, the might that was exuded was even more horrifying.</p><br/><p>Step. Step.</p><br/><p>Lin Fan stepped back a couple of steps involuntarily with a look of astonishment. Right now, he felt as though he was being crushed by a gigantic mountain.</p><br/><p>He tried checking out the cultivation states of these illusory figures. However, there was no indication at all. This was truly the first time he was meeting with something as such!</p><br/><p>Lin Fan could feel his little heart pitter patter. He was so nervous right now.</p><br/><p>All of a sudden, the tombstones above started to vibrate out and illusory figures suppressed out one after another as well!</p><br/><p>It was as though they were suppressing these 3,000 Demonic Gods of the Ancient race!</p><br/><p>BOOM!</p><br/><p>The void broke open.</p><br/><p>Lin Fan opened his eyes wide and watched everything before him. His finger twitched a little, and he could feel two tremendous forces opposing one another as though they were fighting for something.</p><br/><p>\"Just what in the world is going on here? Why does it seem like something's off right now!\"</p><br/><p>Lin Fan's face changed, sensing that things were getting bad.</p><br/><p>All of a sudden, a black streak of light tore through the void. This black light sliced through the entire world and pierced over.</p><br/><p>Lin Fan could feel the hair at the back of his body raising. It was as though his little life no longer belonged to him himself.</p><br/><p>Heaven and Earth Smelt.</p><br/><p>Lin Fan instantly hid within.</p><br/><p>BOOM! BOOM!</p><br/><p>The Heaven and Earth Smelt vibrated as though it had just received a huge blow. At the same time, Lin Fan checked out the situation around him warily.</p><br/><p>All of a sudden, a shriek rang out, scaring the bejabbers out of Lin Fan. Could it be that these Super Powerful BOSSES were not dead?</p><br/><p>At this moment, right before Lin Fan's eyes, the Death Demonic God Shi Yan of the Ancient race gently raised the scythe in his hands as though he was observing everything before his eyes keenly. This wasn't the situation he had expected.</p><br/><p>\"Human…\"</p><br/><p>A voice permeated over. However, this voice was ever so sinister and eerie in the ears of Lin Fan. It seemed to be coming from beneath those black robes.</p><br/><p>Lin Fan opened his eyes wide and took a look. For a moment, his entire mind went blank.</p><br/><p>At this moment, Lin Fan even had the heart to just commit suicide. What in the motherf*cking world was this, and what was up with these fellas?</p><br/><p>Weren't they already dead? How come they were able to talk?</p><br/><p>And, even their tombstones were already crafted out. What else did they want?</p><br/><p>'Not going out. Definitely not going out.' Before Lin Fan could make out just what in the world was going on, he would definitely not head out and put on an act.</p><br/><p>\"After the fall of countless eras, we have descended once more. Power Demonic God Pangu. Betrayal of the Ancient race. Deserves death!\"</p><br/><p>\"Great Sage Equal To Heaven, Rulai Buddha… Our battle has only just begun…\"</p><br/><p>…</p><br/><p>BOOM</p><br/><p>Countless black pillars pierced up into the air, striking at the tombstones of those utmost powerful beings of the thousands of races. A tear then appeared in the void as the tombstones of the 3,000 Demonic Gods of the Ancient race bolted out in all directions, before eventually vanishing without a trace.</p><br/><p>All of the utmost tombstones of the thousands of races started vibrating immensely as well before seeping into the endless void.</p><br/><p>All of a sudden, the entire world fell silent. All of those dense clusters of tombstones had all disappeared just like that, as though they were never there to begin with.</p><br/><p>\"What the f*ck?\"</p><br/><p>Lin Fan was stunned as he blinked his eyes repeatedly.</p><br/><p>\"Seems like something big is about to happen.\"</p><br/><p>\"But, everything has happened way too suddenly, right?! There's no room for anyone to react at all!\"</p><br/><p>At this moment, Lin Fan came out of the Heaven and Earth Smelt. Towards everything he had just seen earlier on, he was completely rendered speechless.</p><br/><p>Everything was way too surreal. If he hadn't been here seeing it for himself, he would have thought that he was still dreaming!</p><br/><p>Lin Fan knew about many names on those tombstones.</p><br/><p>The Great Sage Equal To Heaven… Wasn't that the Monkey King? Since when did he turn into an utmost powerful being of the Monkey race?</p><br/><p>And that Lucifer. Wasn't he an angel? Why was he the utmost powerful being of the Wings race right now?</p><br/><p>What about the Lord of the Demon race? Why the hell was it Di Jun? Wasn't the Big Ancient Demon the King of the Demon race?</p><br/><p>\"Holy f*ck. Changed. EVERYTHING HAS CHANGED!\"</p><br/><p>\"And which camp does Yours Truly belong to then? Why the f*ck didn't I see the huge BOSS of the Human race just now? Everything aside, wasn't that Nuwa someone who was making humans? Why did she turn into the Utmost Being of the Snake race?\"</p><br/><p>…</p><br/><p>\"Big Ancient Demon! Come on out! Just who is this Di Jun to your Demon race?\" At this moment, Lin Fan yelled out. He was completely rattled by the scene earlier on.</p><br/><p>The Big Ancient Demon had long been reformed by Lin Fan, and was now slowly going through his memories.</p><br/><p>\"Di Jun, hmm…\"</p><br/><p>\"That's right, that's right! What do you know about him?\" Lin Fan asked.</p><br/><p>The Big Ancient Demon shook his head, \"Too far. He belongs to an age too far back that I can't even remember it properly.\"</p><br/><p>\"Holy f*ck…!\" Lin Fan was just speechless right now. This motherf*cker used to be the Emperor of the entire Demon race! If even he did not know who Di Jun was, who else could Lin Fan ask?!</p><br/><p>And furthermore, he did not even know where those tombstones had disappeared to!</p><br/><p>BOOM!</p><br/><p>Right at this moment, Lin Fan felt as though the entire voids was starting to vibrate. He could feel an immense suction power that was coming forth everywhere.</p><br/><p>'Ding… Infinite Worlds opened up and the Big Era shall descend. System undergoing upgrade.'</p><br/><p>Lin Fan, \"…\"</p><br/><p>…</p><br/><p>\"WHAT THE F*CK?! Have the Infinite Worlds opened up just like that?\"</p><br/><p>Lin Fan was just completely lost for words right now. Everything was happening way too suddenly, wasn't it? He wasn't even prepared for anything at all!</p><br/><p>\"Purify…\"</p><br/><p>Without any hesitation, Lin Fan started working hard at cultivating the Earth instantly.</p><br/><p>At this moment, no God Chains were appearing. Therefore, for Lin Fan, cultivating the Earth was something that had gotten much simpler right now.</p><br/><p>'Ding…Congratulations on cultivating Earth.'</p><br/><p>'Title: Creator. The strongest title. Requires cultivation of a fixed number of the thousands of worlds: (2/1,000).'</p><br/><p>Lin Fan instantly kept the Earth into his Inner World. Right now, within Lin Fan's Inner world, there was the Earth and the Xuanhuang World.</p><br/><p>These were the roots and foundations of the entire Human race. Everything was under Lin Fan's control right now.</p><br/><p>All of a sudden, a mysterious amount of power surged right at Lin Fan and entered his body. It was as though it was trying to connect with the Xuanhuang World and Earth!</p><br/><p>'Ding…Discovered unknown power that's trying to connect with the Xuanhuang World and Earth. Severing it.'</p><br/><p>Towards this mysterious power, Lin Fan had no way of fighting back at all. Because of that, the system stood in immediately and severed the power entirely, ensuring the safety of the Xuanhuang World and Earth.</p><br/><p>\"That was close. WHEW, that was close! Thankfully, the system is bloody overpowered!\"</p><br/><p>'Ding… Strongest System upgrade complete in order to prepare owner to conquer over the Infinite Worlds with even more tyranny.'</p><br/><p>'Ding… Ultimate Mission Activated: Conquer the Infinite Worlds.'</p><br/><p>Lin Fan, \"…\"</p><br/><p>\"Is this thing f*cking with me…?\"</p><br/><p>…</p><br/>\n</div>"}