{"title": "Chapter 886: Extremely Tough Life", "id": 886, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-886-extremely-tough-life", "volume_title": "Volume 9", "body": "<h1>Chapter 886: Extremely Tough Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 886: Extremely Tough Life</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>At this moment, Reverend Shakya was extremely jumpy. Therefore, he was entirely nerve wrecked by this voice that came all of a sudden. Feeling as though something was about to come out from beneath his feet, he did not even have to think twice before stamping down hard once more.</p><br/><p>\"Aiyoh! Holy f*ck! Yet another stamp?!\" Just as Lin Fan was about to get up, the guy who was standing above him suddenly stamped down once more, causing him to blow his top entirely.</p><br/><p>Who the f*ck did he piss off? All he did was hide within a hole under the ground and fall asleep because he was a little tired, didn't he? Did he have to deserve such treatment?</p><br/><p>Lin Fan did not think anymore as he pushed the feet that were above him apart and stood up furiously.</p><br/><p>Reverend Shakya was almost scared out of his wits right now. This was especially when he caught sight of the mud man before him, as he was even more astounded…!</p><br/><p>\"It's you…!\" Just as Lin Fan was prepared to send this guy who had stepped on him flying, he was taken aback.</p><br/><p>Wasn't this the bloody bald monk?</p><br/><p>And by the looks of it, things didn't look too good for the bald monk right now. Was he being hunted down by someone or something?</p><br/><p>Boom!</p><br/><p>Boom!</p><br/><p>At this moment, the Buddha Palm was still pushing down from the Heavens, as though it could crush the bald monk at any moment. Lin Fan did not say anything much as he shook his head helplessly. Seemed like this bald monk hasn't been doing all that well recently.</p><br/><p>Lin Fan stood up straight and thrust a single fist upward, looking extremely imposing with his stance. It might look simple, but it was extremely violent.</p><br/><p>That single fist was enough to cover the entire sky, as it caused the mighty looking Buddha Palm to disperse away before turning into countless spots of Buddha Light that disappeared within the world.</p><br/><p>When Reverend Shakya caught sight of this, he was completely stumped. So damn bloody tyrannical!</p><br/><p>These few beings of the Buddha race who had been chasing him down were extremely strong! Along the entire chase, he could do nothing other than dodge and run. He couldn't even fight back at all!</p><br/><p>But, the fact that this mud man before him right now was so damn overbearing had Reverend Shakya freezing up at his spot in shock.</p><br/><p>\"Fellow brother, thank you for your great help in blocking the blow. You will definitely receive good karma for this in the future!\" After Reverend Shakya snapped out of that short stupor, he knew that he shouldn't linger any further at this place and proceeded to continue escaping.</p><br/><p>And just as Reverend Shakya was about to scoot off, Lin Fan spoke up.</p><br/><p>\"Bald monk, what now? Do you bloody hell not even recognize me anymore? Do you want to die right now?\"</p><br/><p>\"Benefactor, I'm not a bald…\"</p><br/><p>Hearing others calling him bald monk, Reverend Shakya would still get very annoyed. But, when he was about to correct the other party, he froze up for a moment.</p><br/><p>That was because he had realized that this voice and the way the other party was addressing him was really familiar!</p><br/><p>\"Y-you…!\" Reverend Shakya glared at this mud man before him and was startled there.</p><br/><p>Lin Fan smiled calmly before checking out how he looked right now. Raising his palm, he used the connate Element of Water to wash his entire body, cleaning away all the mud before he revealed his true face.</p><br/><p>\"Benefactor! It's you! I've finally found you!\" At this moment, Reverend Shakya yelped out in joy as though he had just found some godly riches.</p><br/><p>\"Benefactor! Save me! I'm being hunted down by these guys!\" But then, he hid behind Lin Fan immediately.</p><br/><p>\"How are you doing so badly right now?\" Lin Fan looked up at the few figures in the void, \"Aren't these just a couple of Eternal God state beings who have not obtained an Eternal God Seat? To think that they're able to push you to such an extent. What an embarrassment!\"</p><br/><p>\"Amitabha! Benefactor here, this person is a sinner of the Buddha race. Please hand him over to us.\" At this moment, a figure who was emitting a Buddha Light all over his body spoke up with a gentle voice. He was holding up a single palm before his chest and carried a big clock with him.</p><br/><p>\"Bullcrap! I'm not a sinner! It's you b*stards who want to steal my Great Buddha's Light of Purification!\" After being chased for so long, even Reverend Shakya had begun to bore some resentment. These guys were just a bunch of degenerates! The moment they chased him, they wanted his life! There was no time for him to cut a rest at all!</p><br/><p>\"Hmph!\"</p><br/><p>A fat Buddha that was at the side snorted out coldly. His angry face alone would be enough to scare off weaker beings.</p><br/><p>Reverend Shakya hid behind Lin Fan's back once more, \"Benefactor, this bunch of fellas are particularly cruel. They don't even behave like beings of the Buddha race at all! Whoever they meet, they kill! Anyone who doesn't believe in them are killed instantly! The Buddha race right now has changed significantly!\"</p><br/><p>Lin Fan wasn't bothered in the least bit about this bunch of fellas. At the same time, he did not want to have too much of an interaction with them.</p><br/><p>\"This bald monk is a man of Yours Truly. If you guys know what's good for you, you had better scram. Otherwise, don't blame me for being merciless in my strikes if you still wish to be brazen.\" Lin Fan replied.</p><br/><p>\"Amitabha! Benefactor, we will not leave until we bring this sinner back with us!\"</p><br/><p>\"Hmph! Condoning the sinner makes you a sinner as well! Take him down and we shall decide on his punishment after we return!\"</p><br/><p>The Buddha with an angry face by the side barked out.</p><br/><p>\"I gave you guys face, but you refuse to take it? How dare you try to lay your hands on my men? Get the hell lost!\" Lin Fan instantly threw out a single punch.</p><br/><p>Suddenly, something startling happened. That fist looked as though it could tear through the firmaments as it streaked out at the Buddhas.</p><br/><p>BOOM!</p><br/><p>\"It's over.\"</p><br/><p>BAM!</p><br/><p>One by one, the Buddhas let out astonished looks. Their bodies then started exploding apart as though they had just met with an unblockable force.</p><br/><p>'Ding…Congratulations on killing beings of the Buddha race.'</p><br/><p>'Ding…Infinite Worlds Great War initiated. Impressions function initiated.'</p><br/><p>'Buddha race's Impression Points dropped.'</p><br/><p>\"Buddha race: Hatred.'</p><br/><p>Lin Fan was stunned. To think that there would be such a function! But none of it matters now. Since this was the Infinite Worlds Great War, then he would represent the Human race then!</p><br/><p>'As long as we meet with anyone who is indignant, f*ck them all to death!'</p><br/><p>\"Holy f*ck! Benefactor, you're too strong now, aren't you?! To think that you would have turned this formidable after just a few years of not seeing you!\" Reverend Shakya exclaimed out in disbelief.</p><br/><p>\"And what's wrong with you? How are you living life so badly right now? To think that after a couple of years of not seeing you, you're just a Divine celestial level 9 state, that's all! Was your innate potential eaten up by dogs or what?\" Lin Fan remarked.</p><br/><p>\"It's not that, Benefactor. I have been hunted down day and night for a few years now! How could I have the chance to even cultivate in peace?\" How could Reverend Shakya allowed Lin Fan to ridicule him as such?</p><br/><p>No matter what, he was a genius of the Buddha race!</p><br/><p>But, by the looks of the situation right now, he could no longer return to the Buddha race. He had already become a sinner of the Buddha race.</p><br/><p>Bloody hell! They were way too cruel! All he did was to withhold the skill from them, wasn't it? Did they have to chase him down so relentlessly? This is truly f*cking sh*tty doggish!</p><br/><p>\"What about the Guarded Ground?\" Lin Fan asked.</p><br/><p>\"It's gone.\"</p><br/><p>\"What about our Revolutionary Army?\" Lin Fan asked again.</p><br/><p>\"Ah, Benefactor! Our Revolutionary Army has long disbanded! Those members of ours were really way too spineless! The moment they heard that there were utmost powerful beings from their own races blessing and protecting them, all of them ran off one faster than the other to head back to side with these utmost powerful beings who had spouted out of nowhere!\"</p><br/><p>The moment he got to this, Reverend Shakya's heart was filled with pain.</p><br/><p>That was a beautiful, sunny and bright day. But, those members who had just escaped with Reverend Shakya came before his face one after another.</p><br/><p>\"Vice Party Leader, I'm sorry. There's an utmost powerful being for my race who has emerged now. I'm going to head back now.\"</p><br/><p>Did they have any conscience left at all? None! Their consciences had all flown into the Heavens!</p><br/><p>\"What the f*ck am I still doing here with the Revolutionary Army? I've got an utmost powerful being with my race now! Time to go back and hug his legs!\"</p><br/><p>…</p><br/><p>Eventually, all of the members escaped, and Reverend Shakya became the leader of no members. Hence, he could only return to the Buddha race. But, who would have thought that after he returned to the Buddha race, he would meet with something outrageous as such?</p><br/><p>Tough! This was an absolutely tough life he was leading!</p><br/>\n</div>"}