{"title": "Chapter 892: God Mountain", "id": 892, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-892-god-mountain", "volume_title": "Volume 9", "body": "<h1>Chapter 892: God Mountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 892: God Mountain</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"The Eternal God Seat is something that I, Heavenly King Huang Shen, must definitely get my hands on!\"</p><br/><p>A big dude with half of his body nude stood upright. He was hundreds of feet tall, and had a bronze colored skin, emanating a chilling aura. This was a powerful being of the Giant race. Right now, his cultivation state was at the Divine celestial level 9, Eight Desolates United state.</p><br/><p>His aura was extremely thick, and was stronger than most other powerful beings of the same state. This was especially the case for that hammer behind his back that was shrouded by electricity and inscribed with mysterious runes. It gave off an aura that could devastate the Heavens and crush the Earth.</p><br/><p>\"Since when has there been a powerful being as such from the Giant race?\" Lin Fan was bewildered. But when he thought about that King of the Giant race, Kua Fu, some things began to make sense.</p><br/><p>Seemed like with the return of the utmost powerful beings, every single race improved tremendously as well in terms of their strength.</p><br/><p>Just this being of the Giant race before Lin Fan's eyes right now, if this were five years ago, would have been a powerful being right at the peak. There was no way he would have remained silent and unknown.</p><br/><p>\"Heavenly King Huang Shen, the Eternal God Seat this time around might not belong to you.\"</p><br/><p>Beside the Heavenly King Huang Shen, there were a number of other powerful beings as well. All of they had cultivation states of Divine celestial level 9, and they had a thick aura around them that was extraordinary. They were very different from the beings that Lin Fan had seen five years ago.</p><br/><p>This was all due to the changes in their fortune and momentum.</p><br/><p>And, it was evident that these changes were brought forth by those utmost powerful beings who had appeared.</p><br/><p>\"Bald monk, do you know of their backgrounds?\" Lin Fan asked.</p><br/><p>\"Heavenly King? When this poor monk was on the run, I did hear something about this. The thousands of races have a ranking system now as well. Among them, the geniuses who are in the top 100 can enter the rankings. And, this Heavenly King Huang Shen should evidently be one of the Heavenly Kings of the ranking list then.\" Reverend Shakya replied.</p><br/><p>Lin Fan nodded his head. To think that they would have created a ranking as such. He then chuckled and asked, \"Bald monk, how could you not be inside that ranking then?\"</p><br/><p>\"Initially, I could have entered it. But, after being hunted down by the Buddha race, the chance was naturally gone as well.\" Reverend Shakya replied regretfully.</p><br/><p>…</p><br/><p>The appearance of Lin Fan and Reverend Shakya did attract the attention of some people. However, the latter did not feel bothered with both of them at all.</p><br/><p>Right now, they were just waiting for that mountain peak to open up before bolting within and snatching that only Eternal God Seat.</p><br/><p>In the past, the Eternal God Seats were restricted by that existence within the unknowns. However, ever since the utmost powerful beings of the thousands of races had returned, these Eternal God Seats were scattered all around the world as well.</p><br/><p>Those powerful beings who were stuck at the Divine celestial level 9 state knew that they would be able to skyrocket into that mystical Divine celestial level 10, Eternal God state the moment they obtained an Eternal God Seat.</p><br/><p>\"Are we going in later?\" Reverend Shakya asked.</p><br/><p>\"Of course we are! Why shouldn't we? Right now, your cultivation state is simply way too low. You must definitely be feeling an immense pressure on being my friend. Therefore, we've got to raise your cultivation state.\" Lin Fan chuckled out.</p><br/><p>\"Eh?\" The moment Reverend Shakya heard this, he even had the thoughts of committing suicide. How could this guy speak as such? What pressure and whatnot? This poor monk felt no pressure at all!</p><br/><p>BOOM!</p><br/><p>Suddenly, the Earth moved and the mountains shook as the towering mountain peak that extended into the clouds started trembling. It was as though they had been split open by a gigantic pair of hands, causing a gigantic crack that tore down from the Heavens to lead down to the Earth.</p><br/><p>\"The God Mountain is open!\"</p><br/><p>All of a sudden, all of those powerful beings who had been waiting transformed into streaks of light and bolted right into the mountain peak.</p><br/><p>For all of these powerful beings, time was of the essence. There was only a single Eternal God Seat. If they were any bit slower, they might be overtaken by someone else.</p><br/><p>\"Bald monk, let us go in as well.\" After the masses had headed in, Lin Fan then said slowly.</p><br/><p>In the face of a situation as such, Lin Fan was not at all hurried.</p><br/><p>After he entered the God Mountain, Lin Fan checked out his surroundings and couldn't help but let out a look of astonishment. This didn't look like a secret ground at all! It looked more like a Dimension World.</p><br/><p>Mountain peaks lined up one after another, with no end in sight. At the same time, there were no Ancient Beasts at all. It was as though this was just a utopia of its own. But in Lin Fan's opinion, it seemed as though there was more to this place than met the eyes.</p><br/><p>Lin Fan was flying around in the void when he caught sight of the powerful beings from earlier on standing ahead as though they were discussing something.</p><br/><p>\"What are they doing?\" Reverend Shakya asked in bewilderment. A group of people just standing there? It was not as though they could be gossiping for nothing, could they?</p><br/><p>When Lin Fan landed amidst them, he found out that they had their path ahead blocked.</p><br/><p>Gazing into the distance within the mountainous valley, he saw an Eternal God Seat that shone with a godly radiance. There was a man expressionlessly seated on that Eternal God Seat.</p><br/><p>His aura was calm as if he was a dead corpse, without any motion at all.</p><br/><p>But, this was not the case for all of these powerful beings as their faces were grim.</p><br/><p>\"Heavenly King Huang Shen, the Eternal God Seat is just right ahead. Why are you not going?\" A man from the Dragon race who was also a part of the Heavenly King Ranking tried goading Huang Shen.</p><br/><p>\"Huehue. There's no hurry.\" Heavenly King Huang Shen replied.</p><br/><p>However, he was filled with doubts in his mind. He did not know who that man seated on the Eternal God Seat was. Before he was clear about the facts, he would definitely not make a move.</p><br/><p>\"Hmph! The Eternal God Seat is just right ahead. Since you guys refuse to go for it, I will!\" A man from the Horns race roared out before unleashing all his martial arts and skills. He turned into a beast with a single horn on his head and dove into the void, reaching out for that Eternal God Seat.</p><br/><p>At this moment, some of the surrounding powerful beings could not sit idly anymore either. The Eternal God Seat was just right up ahead. How could they not go and fight for it as well?</p><br/><p>Pshew! Pshew!</p><br/><p>Yet another few figures broke through the sky and turned into lightning streaks that bolted for the Eternal God Seat.</p><br/><p>\"It's going to be a tragedy for these guys.\" Lin Fan opened up his mouth and spoke up.</p><br/><p>\"What do you mean?\" Reverend Shakya asked puzzledly.</p><br/><p>\"Huehue. Indeed, there must be something strange about this. For that existence which treats the Eternal God Seats as treasures, how could he possibly hand over the Eternal God Seats and scatter them around as such so obediently? Seems like he's just been waiting for people to take the bait.\"</p><br/><p>\"The previous life of that living being was lived as the possessor of that Eternal God Seat. Even though he has fallen, his consciousness remains and is still extremely formidable. While these beings of the thousands of races are of Divine celestial level 9 state, they are simply too weak if they were to be compared with a true Divine celestial level 10 state being like him.\" Lin Fan explained.</p><br/><p>\"Oh! So that's the case!\" Reverend Shakya nodded his head. However, he did not remind those beings of the thousands of races either.</p><br/><p>Right now, times had changed. In the past when the thousands of races were oppressed by the Ancient race, they were already having difficulties in bonding together. Now that the thousands of races had all grown stronger, all of them naturally had their own agendas.</p><br/><p>If they were to die, so be it then. Either way, it was none of his business.</p><br/><p>\"The Eternal God Seat is mine now!\" One of the Heavenly Kings of a Divine celestial level 9 state howled out. As he used his fingers to pinch out at the void, the void exploded as he tried to grab the Eternal God Seat in his hands.</p><br/><p>All of the other powerful beings could not possibly let him have his way as they tried their best to fight for it as well.</p><br/><p>But all of a sudden, the figure that was sitting on the Eternal God Seat bolted up. At that single moment, the clouds surged as the world shook.</p><br/><p>A sharp flash of light bolted up from the ground.</p><br/><p>Urgh!</p><br/><p>Nobody had reacted to it just yet. However, by the time they finally did react to it, all of the powerful beings who were floating in the void came to a stop before standing there motionlessly.</p><br/><p>\"What's going on?\"</p><br/><p>All of the other observing powerful beings were bewildered, not understanding what was going on right now.</p><br/><p>But all of a sudden…'Crack!'</p><br/><p>The head of one of those Heavenly King dropped down, separated from that body as his blood sprayed all over the ground. An extremely sharp Sword Will burst forth from his body and penetrated through it.</p><br/><p>BAM!</p><br/><p>One of the Heavenly Kings had fallen just like that.</p><br/><p>Following that, the same thing happened to all of the other powerful beings. Their bodies exploded out as a thick river of blood stained all the mountains nearby.</p><br/><p>They did not even have a chance to get to Rebirth through Blood.</p><br/>\n</div>"}