{"title": "Chapter 900: And Just Like That, The Favourable Impression Has Risen!", "id": 900, "volume": 9, "url": "http://boxnovel.org/the-strongest-system-chapter-900-and-just-like-that-the-favourable-impression-has-risen", "volume_title": "Volume 9", "body": "<h1>Chapter 900: And Just Like That, The Favourable Impression Has Risen!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 900: And Just Like That, The Favourable Impression Has Risen!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Stop that now! Are you sick in the head or something?! Do I even know you?! Why are you slamming me with your stick for nothing?\"</p><br/><p>Lin Fan dug out of that pit in the ground. When he caught sight of this overbearing monkey wanting to slam out at him with another round of the stick, he yelled out.</p><br/><p>Who in the world had he offended?! He was just going on his own way while traveling through the void!</p><br/><p>At this moment, a single fella suddenly came into the mind of Lin Fan. Wasn't this the Great Sage Equal to Heaven that he had seen that time?</p><br/><p>Checking out his surroundings, Lin Fan garnered that he must have arrived in the territory of the Monkey race. There were many living beings of the Monkey race that were glaring at Lin Fan curiously from the sides.</p><br/><p>There wasn't much of a difference between these living beings of the Monkey race and the Human race. It was just that they were covered with a layer of yellow hair around their body.</p><br/><p>\"The guts of trespassing into the territory of the Monkey race… Who are you?\" After the Great Sage Equal to Heaven had awakened, he had returned to the base of the Monkey race.</p><br/><p>When the living beings of the Monkey race caught sight of this extremely powerful being of the Monkey race appearing, they were naturally startled.</p><br/><p>\"I'm from the Human race. You're the Great Sage Equal to Heaven?\" Lin Fan asked.</p><br/><p>\"This Old Monkey IS the Great Sage Equal to Heaven!\" The metal rod in the hands of the Great Sage Equal to Heaven gave off a godly aura, and was filled with an unparalleled battle intent. This wasn't something to look down upon.</p><br/><p>Lin Fan realized that the strength of the Great Sage Equal to Heaven wasn't weak at all. But, by the looks of it, he didn't seem to have any grudges or anything towards Lin Fan. That had Lin Fan heaving out a breath of relief.</p><br/><p>\"Great Sage Equal to Heaven, I am only passing by. I do not have any intention of doing anything to the Monkey race.\" Lin Fan said.</p><br/><p>The Great Sage Equal to Heaven looked at Lin Fan, \"Your strength is decent. Come fight with me for a round!\"</p><br/><p>\"What?\"</p><br/><p>All of a sudden, Lin Fan was stunned. Fight your mother! Didn't Yours Truly just pass through this place, and that was all? Why did it have to come to this?</p><br/><p>But at this moment, the Great Sage Equal to Heaven raised his rod and slammed out at Lin Fan. This single rod brought with it an extraordinary might, as though it could destroy everything in the world.</p><br/><p>BAM!</p><br/><p>Lin Fan blocked instantly and felt his hands getting sore from the strike. Thankfully, his strength had just risen. Otherwise, he might have been slammed to death by this fella just like this!</p><br/><p>\"Use your mouth and not your hands! Anyone who passes by is a visitor! Is this how the Monkey race treats your visitors?\" Lin Fan exclaimed out. This mother*cker truly didn't make any sense at all!</p><br/><p>\"Great!\"</p><br/><p>The Great Sage Equal to Heaven yelled out madly. Disregarding Lin Fan's complaints entirely, he struck out once more.</p><br/><p>\"F*CK!\"</p><br/><p>Lin Fan felt that this monkey was really way too much now! This was some overbearing bullying!</p><br/><p>At this moment, Lin Fan fought out with the Great Sage Equal to Heaven. However, he could feel as though the Great Sage Equal to Heaven was reining in his strength and did not unleash all his powers. Otherwise, given Lin Fan's own cultivation state, there should be no way he could hold out until now.</p><br/><p>\"Great! This is the first time I'm feeling this great after awakening!\"</p><br/><p>\"HAHAHA!\"</p><br/><p>After a long time, the Great Sage Equal to Heaven finally came to a stop, \"Human, you're pretty good.\"</p><br/><p>Lin Fan's hands and legs were feeling slightly numb right now. However, there was nothing much other than that.</p><br/><p>\"Thank you for your praises.\"</p><br/><p>However, he could tell that this Great Sage Equal to Heaven wasn't as berserk as the Ancestral Buddha and the others. He was quite a righteous man.</p><br/><p>\"I've seen beings of the Human race in the past. But, for someone of the Human race to be as strong as yourself, now that's pretty rare.\" The Great Sage Equal to Heaven said.</p><br/><p>Lin Fan chuckled out. Didn't this sentence just imply that there was no one strong from the Human race? However, that was a fact. What else could they do about it?</p><br/><p>\"That fight with you earlier on was only to relive some pleasures of battling. Since you're passing by here, how about taking a rest here, and I'll have my people hold a welcome feast for you?\" The Great Sage Equal to Heaven offered.</p><br/><p>The Monkey race had nothing to do with the secular world out there. There were quite a number of powerful beings from the Monkey race. At the same time, there were quite a number of them who wanted to fight for supremacy as well. But, after the descent of the Great Sage Equal to Heaven, he defeated all of those ambitious ones immediately.</p><br/><p>There was no need for the Monkey race to fight with the thousands of races. All they had to do was to secure this place of sanctuary for themselves.</p><br/><p>\"My thanks then.\" Lin Fan replied. He had not expected to meet this friendly Monkey race. But, since that was the case, he should just stay here.</p><br/><p>But, when he caught sight of the food prepared by the Monkey race, Lin Fan was slightly taken aback.</p><br/><p>Did monkeys these days eat meat or something? The entire table was filled with meat dishes!</p><br/><p>During this feast, the Great Sage Equal to Heaven sat up above. There were a couple of powerful beings from the Monkey race seated beside him as well. They all had quite the favorable impression of this human, the main reason being that the Human race hadn't killed anyone from the Monkey race.</p><br/><p>However, Lin Fan knew that was also because the Human race had mainly been stuck within the Xuanhuang World the entire time, and could not make it over to the Ancient Saint World.</p><br/><p>At this moment, the powerful beings of the Monkey race around him were extremely passionate towards Lin Fan. And towards them, Lin Fan was all smiles as well.</p><br/><p>\"Great Sage, is this what you guys eat normally?\" Lin Fan asked.</p><br/><p>Right now, this world was pretty dangerous. There would definitely be good out of making friends with a few more powerful beings.</p><br/><p>If he had known some powerful beings earlier on, he wouldn't have had to fight so badly as he had when the bald monk brought people to ambush him previously.</p><br/><p>\"That's right. Unless… these foods aren't to your liking, eh?\" The Great Sage looked at Lin Fan perplexedly. These foods were made out of the most valuable ingredients! These were portions that were carved out from the most delicious parts of top grade Ancient Beasts!</p><br/><p>\"It's not that. Just that, don't you guys eat bananas normally?\" Lin Fan asked.</p><br/><p>\"Banana? What's a banana?\" The Great Sage was stunned. All the other powerful beings of the Monkey race nearby were equally confused, wondering what this human was talking about.</p><br/><p>Normally, they did not fight or engage in politics with others. Therefore, they led a life of leisure. But, they were pretty particular towards seeking out good food.</p><br/><p>However, as for this thing that the human had mentioned, let alone see it, they hadn't even heard of it before!</p><br/><p>'Holy f*ck! To think that they wouldn't even know of bananas as monkeys! If that's the case, they probably don't even know of peaches then! Seems like I'll have to depend on these to establish a good relationship then.'</p><br/><p>Thereafter, Lin Fan chuckled out, \"Just nice. I've got some of these delicacies. I'll take some out to share with you guys then!\"</p><br/><p>Lin Fan entered Earth and took out a huge bunch of bananas and peaches.</p><br/><p>\"What are these?\" When the Great Sage caught sight of these, his face was puzzled all of a sudden. All of the surrounding powerful beings of the Monkey race were equally baffled. They truly hadn't seen this before!</p><br/><p>\"All of you can come and have a try.\" Lin Fan said.</p><br/><p>He then took over a single banana and demonstrated how to peel the skin open before he ate it up. At this moment, the Monkey race beings were learning to do the same from Lin Fan.</p><br/><p>When they tasted their first mouthful, all of their expressions turned somewhat strange.</p><br/><p>\"What's this? Even though there are no powers to it, this taste… It's as though it was prepared just for us from the Heavens!\"</p><br/><p>When one of the Monkey race beings bit down on his first mouthful, he shouted out. His face was ecstatic as though he had just discovered something incredible!</p><br/><p>The Great Sage gave it a taste as well. But, this single mouthful had his face filling up with a myriad of expressions. He then looked around at everything. He was in love so deeply that he could barely part from them!</p><br/><p>\"Lin Fan… What are these!\" The Great Sage grabbed some peaches in his hands and asked.</p><br/><p>Lin Fan smiled out calmly before replying, \"Great Sage, those are peaches. They are delicious!\"</p><br/><p>\"PEACHES!\"</p><br/><p>The Great Sage grabbed the things in his hands as his heart was surging with a sense of gushing emotions! Compared to those meats on the table, these were way more delicious!</p><br/><p>\"Everyone, there's no need to rush. I've still got many more here! In fact, you can even plant them at this place of yours!\" Lin Fan said.</p><br/><p>\"What? They can be planted?\" The face of the Great Sage was taken aback as his expression turned excited.</p><br/><p>Even though he had been through countless of eras, every single era was just akin to swimming through time for him. Since they did not have any contest with the other races, he had long gotten used to an average, simple life, despite the awakenings time after time.</p><br/><p>But right now, these bananas and peaches truly had the Great Sage thoroughly drawn in!</p><br/><p>Lin Fan smiled out faintly and pointed out with his finger. Instantly, the seeds of bananas and peaches lined the entire base of the Monkey race.</p><br/><p>The connate Elements of Wood and Water started churning out at this moment. The seeds germinated, and in a short period of time, they started blossoming out brilliantly.</p><br/><p>When the living beings of the Monkey race caught sight of this, they started clamoring in excitement. The things that this human had taken out were simply way too mysterious in their eyes!</p><br/><p>'Ding…Monkey race's Impression level raised: Endless Friendship regardless of age.'</p><br/><p>The moment Lin Fan heard the notification of the system, his heart leaped with joy. To think that his relationship with the Monkey race would have been raised just like that so easily!</p><br/>\n</div>"}