{"title": "Chapter 908: Go Forth, My Young Ones!", "id": 908, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-908-go-forth-my-young-ones", "volume_title": "Volume 10", "body": "<h1>Chapter 908: Go Forth, My Young Ones!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 908: Go Forth, My Young Ones!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Let me go…!\" The Pill Spirit of the Nature Elixir roared out in rage as it wanted to break free from Lin Fan's palms. However, now that he was in Lin Fan's hands, how could the latter possibly let him escape? The Nature Elixir was a type of godly pill. The fact that it could have a Pill Spirit was something that Lin Fan had expected.</p><br/><p>\"Human… as long as you let me go, I can bring you to the Pill World! There, you'll be able to find the Pill race of the Legends! Every single living being there is formed from godly pills. Once you swallow them, you can definitely skyrocket and ascend onto the path of eternity!\" The Pill Spirit of the Nature Elixir tried to tempt Lin Fan so that he could escape from this place.</p><br/><p>He was the Nature Elixir! He was not something to be devoured by these ordinary beings! He wanted to rule over the entire world and travel across it while looking down on the masses of the world in disdain!</p><br/><p>\"Bloody hell! Why in the world is a bloody pill so talkative? Can't a man just pop some pills in peace now?\" Lin Fan was exasperated. Back in the past, pills were such wonderful things. They would just be quiet and silent, and did what they were supposed to do.</p><br/><p>\"Human… You'll have a terrible death! I'll curse you…!\"</p><br/><p>Creak!</p><br/><p>The Pill Spirit of the Nature Elixir barked out an endless amount of curses in Lin Fan's ears. From the unknowns, Lin Fan could even feel some power of the curses descending upon him! But for him, the power of these curses was something that wasn't even worth a single hit as it dissipated immediately.</p><br/><p>Right now, Lin Fan had already attained his Eternal Ancient Imperishable Body, which was impenetrable for all evils. To think that this puny little power of curses would think about damaging his body? Now THAT was a fool's dream!</p><br/><p>\"You're so savage! You'll definitely have a bad end!\" The Nature Elixir cried out with his final shouts.</p><br/><p>Lin Fan tossed the pill into his mouth straight and chewed on it. The taste was pretty decent. Between his teeth, an endless amount of power started cruising through.</p><br/><p>'Ding…Congratulations on consuming the Nature Elixir.'</p><br/><p>'Ding…Experience Points +100,000.'</p><br/><p>The savage behavior of Lin Fan had totally entered the eyes of those Legendary Items within the Heaven and Earth Smelt. Immediately, all of them started ramming out and trying to escape from the Heaven and Earth Smelt as though their lives were at stake.</p><br/><p>At this moment, Lin Fan grabbed out onto a text character.</p><br/><p>'Ding…Congratulations on discovering Legendary Item: Text Character 'Demon'.'</p><br/><p>The word 'Demon' was entirely pitch black. Every single stroke of the word contained an unparalleled Dao, as though it could control one's mind and spirit. The infinite demons within it howled out madly. It represented the True Essence of the 'Demons' in the whole world.</p><br/><p>\"Damn it! Damn it…!!!\" The Demon Spirit knew that there was no way he could escape anymore, and just like the Nature Elixir, he could only curse out at Lin Fan.</p><br/><p>\"This text character seems like it will have many uses. Perhaps, it can raise the power of the Demonic God Wheel.\"</p><br/><p>\"Fusion!\"</p><br/><p>Lin Fan swallowed the 'Demon' text character, and as a result, the mysterious runes on the Demonic God Wheel started fusing together with the 'Demon' text character.</p><br/><p>Thick Demonic Qi wrapped around the Demonic God Wheel and fused up while complementing one another.</p><br/><p>A Demonic God stood on the edges of the boundless World of Demons and howled out furiously while tearing through the crystallized walls of the Demons and breaking through to yet another higher state.</p><br/><p>'Ding…Fusion Success.'</p><br/><p>'Demonic God Wheel has upgraded to Demon Realm.'</p><br/><p>There were countless Legendary Items within the Heaven and Earth Smelt. This time around, Lin Fan had really come across an astronomical wealth. Without caring for anything more, he devoured all of them together. Some of the Weapon Spirits of the Legendary Items howled out furiously as they fought and struggled. However, it was all for naught.</p><br/><p>'Ding…Congratulations on devouring Yin Yang Elixir.'</p><br/><p>'Ding…Congratulations on devouring Nine Turns Golden Buddha Pill.'</p><br/><p>'Ding…Congratulations on discovering Gold Rattling God Metal.'</p><br/><p>…</p><br/><p>All the pills were converted into experience points while some of the Legendary Materials were fused into the Paradise to become one with it.</p><br/><p>As far as Lin Fan was concerned, this was the happiest moment for him. Something explosive was going on within his Paradise.</p><br/><p>With such a huge number of Legendary Items boosting it, the connate Paradise Imprint that hadn't been activated for a long time now started churning furiously, and a series of living beings appeared one after another.</p><br/><p>The radius of the Paradise expanded out continuously as the crystallized walls of the Paradise began to upgrade once more, gradually taking the steps towards becoming an actual World. In Lin Fan's opinion, even the Paradises of the utmost powerful beings might not be as strong as his was.</p><br/><p>Right at the moment when Lin Fan was about to break through, a bunch of Outworld Fiends were hiding within the endless void. Ever since they had been shat on by that Evil Lord, they had remained hidden ignobly within the void, and were just biding their time and waiting.</p><br/><p>Those utmost powerful beings were simply way too strong. The Outworld Fiends knew that they were no match for them.</p><br/><p>But, right at this moment, the aura that was being emitted from Lin Fan, who was in the midst of cultivation, had attracted the Outworld Fiends from all over the place.</p><br/><p>A pair of sinister vile eyes laid their sights onto Lin Fan with a ghastly gleam.</p><br/><p>\"That human is alone now!\"</p><br/><p>\"He's in the midst of cultivation! If we rush at him together, we will definitely be able to take over his body and snatch over everything from him!\"</p><br/><p>\"That's the smell of Legendary Items! It's been a long time since I've caught a whiff of that scent!\"</p><br/><p>Among the Outworld Fiends was a King of the Outworld Fiends. His eyes shone with a greedy glint. This human before him was just looking way too delicious!</p><br/><p>\"That damned Evil Lord! To think that he would drag us over here. Even though those utmost powerful beings haven't laid their hands on us, they will definitely have us killed once everything's over.\" The King of the Outworld Fiends said in a harsh tone.</p><br/><p>They loved possessing the bodies of those that were already dead. Even if it were the utmost powerful beings, if they were dead, these Outworld Fiends would be able to take over their bodies and obtain everything of theirs.</p><br/><p>However, those utmost powerful beings would definitely not give them the chance to do so. As long as the time was ripe, they would definitely slay all of the Outworld Fiends.</p><br/><p>For these Outworld Fiends, that was something that was absolutely intolerable.</p><br/><p>\"My young ones, go forth and rush into his body! We'll steal everything of his!\" The King of the Outworld Fiends roared out.</p><br/><p>Instantly, millions and millions of these Outworld Fiends swarmed forth and clawed towards Lin Fan with their sharp teeth and claws.</p><br/><p>At this moment, Lin Fan's Paradise was undergoing some changes. The large number of Legendary Items had pushed his Paradise to the pinnacle state immediately.</p><br/><p>The clouds rumbled out furiously while lightning flashed and crackled repeatedly. An endless number of living beings were gushing forth as the Dao of the Paradise was changing at this moment.</p><br/><p>This was the upgrading process of a World!</p><br/><p>The Earthly Fires and the Heavenly Winds gusted over as though they were going to destroy this world.</p><br/><p>Lin Fan felt a headache right now. To think that he would have allowed something as such to happen due to a moment of carelessness!</p><br/><p>\"Suppress!\"</p><br/><p>Lin Fan could only deploy all of his powers to try and suppress these Earthly Fires and Heavenly Winds. There was still that endless Calamity of World Creation to take care of.</p><br/><p>If one wanted to cultivate an entire World out of their Paradise, they would have to endure a calamity. Even the utmost powerful beings would find this extremely difficult to accomplish, let alone someone like Lin Fan whose cultivation state was only at the Immemorial Ancient state lower level!</p><br/><p>At this moment, Lin Fan stood within his Paradise and watched the endless calamities. The Big Ancient Demon and all the other Weapon Spirits furrowed their brows as well. They could feel an enormous amount of power that was accumulating within the Paradise right now.</p><br/><p>\"The Paradise is about to turn into a World! No matter what, we have to suppress this calamity!\" Lin Fan said out.</p><br/><p>\"Old Bro, don't worry about it! Glory or defeat, we'll all stand together! Even if we have to give up our lives for it, we will defend this Paradise!\" The Big Ancient Demon's aura was rumbling furiously as a dense Demonic Qi coiled out. He was ready to strike out to suppress this.</p><br/><p>\"There should be no worries of losing lives. However, the fact that the Paradise wants to turn into a World is something that goes against the natural order of things. The target of these calamities is the Paradise. They're just trying to stop it from upgrading.\"</p><br/><p>Back when Lin Fan had gone through the Spirit Qi Cyclone, he had already understood that his Paradise would have a greater achievement than others. Now that he had devoured endless Legendary Items and pushed it to a pinnacle state, it was naturally time to upgrade once more.</p><br/><p>BOOM!</p><br/><p>Right at this moment, the calamity arrived…</p><br/><p>\"STRIKE OUT!\" Lin Fan yelled out before fighting against the calamity with his might. But just at this moment, something that startled Lin Fan happened.</p><br/>\n</div>"}