{"title": "Chapter 922: The Locust Army Strikes!", "id": 922, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-922-the-locust-army-strikes", "volume_title": "Volume 10", "body": "<h1>Chapter 922: The Locust Army Strikes!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 922: The Locust Army Strikes!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Lin Fan had settled into the Disciplinary Hall officially. Even though the name was a little gaudy sounding, he had no intention of changing it at all. After all, he was not going to linger around the Thunder Sect for too long. Once he was done with what he had to, he would leave immediately.</p><br/><p>The act of Lin Fan taking down Lei Kuanglong with such absolute power and snatching over the seat of the Hall Master of the Disciplinary Hall naturally created an uproar throughout the entire Thunder Sect. There were countless disciples discussing this affair. Naturally, news of this was undoubtedly earthshattering.</p><br/><p>Lei Kuanglong and the other four Vice Hall Masters had been swept out of the Disciplinary Hall, and were arriving at the area where the unaffiliated disciples lived right now.</p><br/><p>\"Hall Master, we feel indignant!\" The other four Vice Hall Masters said with fury. They could not bear to rip Lin Fan apart cruelly. However, they knew that they could not compare with him in terms of strength. And for the time being, there was nothing they could do to raise their strength in a short period of time either.</p><br/><p>If even Lei Kuanglong wasn't a match for him, it was needless to even talk about themselves.</p><br/><p>When they were faced up against Lei Ming, they could not even withstand a single blow of his. What sort of horror was that?</p><br/><p>The face of Lei Kuanglong was darker than anything else right now. This was the most humiliating experience he had ever gone through. No matter what, he had to seize back everything he had lost.</p><br/><p>\"This is a vengeance we have to return no matter what. Everything I've lost, I must definitely take it back with my very own hands. Lei Ming…we'll just let him gloat in his arrogance for the time being.\" But in reality, Lei Kuanglong's inner heart was feeling a little defeated.</p><br/><p>Initially, he had thought that the Old Master Thunder would actually intervene. But, who would have thought that there was no sign of the Old Master Thunder even at the end of it all?</p><br/><p>At this moment, Lei Kuanglong finally understood it; he could only depend on himself for everything.</p><br/><p>However, now that his underlings were questioning it all, he naturally could not show signs of weakness. He had to endure for the time being to ensure that things went smoothly. Once the opportunity arose, he would definitely have Lei Ming pay the price.</p><br/><p>Holy Thunder Hall…</p><br/><p>\"Holy Master, that Lei Ming is not coming for the feast. He said that he has no time.\" According to the wishes of the Holy Master, Qingxuan had invited Lin Fan for a feast. But, who would have thought that she would be sent back without even getting a chance to look at him in the face?</p><br/><p>\"Hmm!\"</p><br/><p>The face of the Holy Master was calm without much of a reaction. However, Qingxuan knew that her Holy Master must be fuming in her heart.</p><br/><p>However, it was just that Lei Ming's strength was far too strong, and he wasn't someone that ordinary people could ever hope to deal with. There was probably no other way about this matter except swallowing it in their stomachs.</p><br/><p>\"I've got it. Just pay attention to every single move the Disciplinary Hall makes from now on.\" The Holy Master replied.</p><br/><p>\"Yes.\"</p><br/><p>…</p><br/><p>The next day…</p><br/><p>Lin Fan had scoured around the entire Disciplinary Hall once. However, he did not find anything valuable. Seemed like everything valuable must have been reaped in by Lei Kuanglong beforehand.</p><br/><p>This was pretty infuriating.</p><br/><p>At this moment outside the Main Hall, the disciples of the Disciplinary Hall were standing properly in a formation and with full attention. Everyone was beyond excited in their hearts, because today was the day their Hall Master was going to take them out to make it big out there!</p><br/><p>Lin Fan stood on an elevated platform and took a look at the dense clusters of disciples below. He then waved out with his arm, \"Army, let's move out!\"</p><br/><p>Instantly, Lin Fan enveloped these disciples in his aura and dove into the void, heading out into the vast world outside.</p><br/><p>When some of the disciples who were tasked to keep watch over the Disciplinary Hall caught sight of that huge group of people, they were stunned for a moment as well. They did not know what Lei Ming was up to.</p><br/><p>That night, Lin Fan had initially thought that the Old Master Thunder would appear to meet him for a talk. But, to think that he did not make an appearance at all.</p><br/><p>Based on Lin Fan's train of thoughts, he garnered that the Old Master Thunder naturally did not put him to heart at all.</p><br/><p>But, when he thought about the relationship between the bloodline of the Thunder race and the Old Master Thunder, everything made sense to him.</p><br/><p>The Old Master Thunder wielded control over the entire Thunder race's bloodline. It could be said that the life and death of all beings from the Thunder race belonged to him. Therefore, no matter how much of a ruckus he created, he was nothing more than an ant in the eyes of the Old Master Thunder.</p><br/><p>\"Hall Master, there are people up ahead.\" At this moment, a disciple shouted out.</p><br/><p>Naturally, Lin Fan had known from the start that there were people up ahead. And by the looks of it, there were quite a number of them. There should be at least a few thousands of living beings.</p><br/><p>When Lin Fan caught sight of these living beings, his eyes shone with a delighted glint. A plan then emerged in his mind.</p><br/><p>\"Let's go. Today, I'll make sure you guys get rich!\" Lin Fan waved out with his arm to rally everyone's fighting morale.</p><br/><p>Most of the thousands of living beings up ahead were from the Wings race. They had gathered here because they had just come out of a secret ground.</p><br/><p>Every single being was letting out a gleeful expression. Evidently, they must have reaped in quite a fair bit of rewards from the secret ground.</p><br/><p>By now, the Wings race was also a race that had an utmost powerful being watching over them. Therefore, they naturally did not fear the Ancient race even when they came out.</p><br/><p>\"Congratulations to Senior Brother Yi for obtaining the corpse of a Supreme state powerful being!\" The surrounding disciples of the Wings race were gathered around a young man while congratulating him.</p><br/><p>A long time ago, this secret ground was the cenotaph of a Supreme state powerful being. The greatest treasure within it was naturally the corpse of that Supreme state powerful being. Even with the passage of time, that corpse was still extremely bedazzling and extraordinary.</p><br/><p>This was especially the case for those martial arts mystic runes on the bones of that corpse. They were the treasures amongst treasures.</p><br/><p>As long as one could comprehend the wisdom behind it, they would be able to inherit all the cultivation of that Supreme state being.</p><br/><p>\"You guys have done decently as well to obtain the remaining pills and martial arts mystic skills left behind by that Supreme state being. Right now, there's not much use of this secret ground any longer. Let us head back.\" Yi Hongtian laughed out cheerily.</p><br/><p>This time around, they had gained a ton from this expedition. As long as he were to cultivate this corpse when he returned, his cultivation state would definitely skyrocket. With that, his position in the sect would naturally rise incredibly high along with it.</p><br/><p>\"Senior brother, check it out! What's that there?\" Just at this moment, a disciple looked over into the distance and caught sight of some flashing thunderbolts. It was extremely imposing; hence, he could not help but ask out worriedly.</p><br/><p>The brows of Yi Hongtian furrowed as he cast his sights over. When he made clear of whom it was, he chuckled out, \"It's nothing. That's just the Thunder race. The Wings race have got a pretty good relationship with the Thunder race. They should just be heading out for training and are passing by this area, that's all.\"</p><br/><p>…</p><br/><p>\"Hall Master, that's the Wings race up ahead.\"</p><br/><p>When Lin Fan caught sight of everything ahead, he let out a smirk, \"Alright. Everyone, prepare yourselves! We'll just snatch away all the valuables they have!\"</p><br/><p>\"Ah! But Hall Master… the relationship between the Wings race and the Thunder race is pretty good…! This…!\" A disciple said reluctantly.</p><br/><p>\"What are you afraid of? This is a world where it's the survival of the fittest. Why? Should our Disciplinary Hall be afraid of anyone? The Wings race are the Wings race and our Thunder race is the Thunder race. We're from different races. Naturally, there's no such thing as a close relationship forever then. So what if we take away their treasures? They can only blame it on their own lack of strength!\"</p><br/><p>Why in the world would Lin Fan be bothered about all of this? Right now, there was something wrong with the way the world worked. The utmost powerful beings did not make any moves, but they were all taking him as the number one public enemy. If he didn't create a little something for them to get distracted with, how in the world could he continue to put on an act using his true face in the future?</p><br/><p>\"Brothers of the Thunder race, where are you guys headed off to?\" Yi Hongtian yelled out to ask.</p><br/><p>\"Brother your mother! Everyone, go up there and strip them of their clothes! ROBBBBBB!!!\" Lin Fan roared out and pushed out with his palms, suppressing all the beings from the Wings race immediately, rendering them unable to resist to fight back.</p><br/><p>\"You guys…!\" Yi Hongtian was stunned, not expecting that things would turn out as such.</p><br/><p>And to his fright, it was as though his cultivation state had been sealed up by someone! There was nothing he could do to fight back at all!</p><br/><p>\"All of you, go! We're not going to take any lives, but we're going to strip them clean!\" Lin Fan bellowed.</p><br/><p>\"Yes, Hall Master!\" All the disciples of the Disciplinary Hall cheered out as they rushed up like a swarm of locusts.</p><br/>\n</div>"}