{"title": "Chapter 927: How Did They Turn Into Degenerates?", "id": 927, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-927-how-did-they-turn-into-degenerates", "volume_title": "Volume 10", "body": "<h1>Chapter 927: How Did They Turn Into Degenerates?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 927: How Did They Turn Into Degenerates?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Great Sage, now is not the time to be acting recklessly! If we don't leave right now, by the time they come back to their senses, it will truly be too late!\" Lin Fan urged.</p><br/><p>Given the current situation, even though the state of affairs might have changed, it also meant that there was an added sense of danger shortly.</p><br/><p>If he were to be discovered that he was from the Human race, even Lucifer and the others would surround and group on them. By then, it would be truly troublesome.</p><br/><p>While his Physical Body State might be pretty invincible, under the massive assault of the many utmost powerful beings present, it might really turn serious. While he might not be in direct danger of losing his life, things would be definitely bad if they joined forces to seal him up.</p><br/><p>\"You can leave first. Help me to take good care of my people from the Monkey race! If the situation goes to the worst, you can allow them to fend for themselves and leave them alone. This Old Monkey will definitely not bear a grudge towards you!\" At this moment, the eyes of the Great Sage burst forth with a bedazzling gleam as though he was bent on fighting with them to the end of his life.</p><br/><p>Lin Fan was speechless right now. Bloody hell, why did he have to be so inflexible?</p><br/><p>Didn't he know the meaning of 'where there's life, there's hope'?</p><br/><p>If he were to carry on this way, the only thing awaiting him was definitely death!</p><br/><p>The Lin Fan of this moment wished he could just give the Great Sage one good kick to the ground so that he would know the meaning of enduring for the moment to ensure the peace so that he could plan for the future later on. If he were to get stubborn and insist on taking that step forward, he would definitely just vanish like dust.</p><br/><p>He wouldn't even have a single scrap left to him!</p><br/><p>At this moment, Lei Kuanglong and the others were completely astounded by the fight that was taking place amongst the Old Masters right now.</p><br/><p>Everything had happened way too suddenly. To think that these various utmost powerful beings who were getting along just nicely moments earlier were now all killing at one another as though there was some grudge between them.</p><br/><p>However, for Lei Kuanglong, none of that mattered much. For him, the most important was that Lei Ming. The humiliation that Lei Ming caused him was something that he would never forget in this entire life.</p><br/><p>If not for that fella, he would not have lost all his face in front of that huge crowd back then. And now that that fella had been killed by the Old Master, Lei Kuanglong was naturally overwhelmed with joy.</p><br/><p>Even if that guy was dead, he was not going to let him have a good time!</p><br/><p>Right now, Lei Kuanglong was thinking about bringing Lei Ming's corpse back with him so that he could give it a good whipping back in the sect. At the same time, he was going to turn him into a Ghost Puppet so that he could serve as his dog for all eternity.</p><br/><p>But, when Lei Kuanglong turned his sight towards the corpse of Lei Ming, he realized that he had disappeared entirely all of a sudden!</p><br/><p>Lei Kuanglong felt his heart skip a beat as though something had just happened. Thereafter, he searched left and right furiously. However, he still couldn't find Lei Ming's corpse.</p><br/><p>At this moment, Lei Kuanglong yelped out as though he had just discovered something outrageous.</p><br/><p>\"Old Master! You have all been deceived! The corpse of that fella, Lei Ming, is gone!\"</p><br/><p>Lei Kuanglong howled out and reported this matter to the Old Master.</p><br/><p>The face of the Old Master Bat who was in the midst of suppressing the Old Master Thunder took a stark change as he cast his sight at the place where Lei Ming's corpse was.</p><br/><p>But, when he looked over, he realized in astonishment that it was gone!</p><br/><p>\"Old Master Thunder, Your Ancestor has already said this! That is nothing but mere instigation!\" The Old Master Bat roared out.</p><br/><p>…</p><br/><p>Lin Fan, who was still in the midst of persuading the Great Sage, exploded when he heard these words. Motherf*cking hell! He had been discovered!</p><br/><p>\"Great Sage…!\"</p><br/><p>\"You just leave first! Don't bother about me!\" The Great Sage replied firmly.</p><br/><p>\"F*cking hell! Just lie down first!\" Lin Fan was panicking right now. Throwing all caution to the wind, he slapped the Great Sage to faint over with a single brick before throwing him into his Paradise.</p><br/><p>Bloody hell! It was too damned difficult persuading this guy! It'd be more convenient to just slam him into fainting with a single brick first!</p><br/><p>\"Lei Ming…!\" When the Old Master Thunder caught sight of that figure that had appeared out of the void from his Stealth mode, he hollered out.</p><br/><p>\"Lei your mother! Go play with your own balls!\" Lin Fan shouted back and sprinted off into a run. These utmost powerful beings were no jokes! If they were to truly fight with him, he would be in for a tough time!</p><br/><p>Lucifer and the others were stunned as though they were just dumbfounded by everything that was happening right before them. They still hadn't understood just what in the world was happening yet.</p><br/><p>\"Guys, take a look! All of this was a part of the lad's plan! We've all been fooled! He has even rescued that monkey!\" The Old Master Bat roared out.</p><br/><p>In order to take down the Great Sage, they had discussed and planned for a long time now. But right now, none of that mattered at all.</p><br/><p>\"Chase…!\"</p><br/><p>The Old Master Bat bellowed out as he flapped those demonic wings of his. All of a sudden, he turned into a long streak of light that bolted off, chasing after Lin Fan.</p><br/><p>At this moment, the Old Master Thunder came to a realization as well as he roared out. He hadn't expected that he would have been fooled!</p><br/><p>Damn it! God damn it!</p><br/><p>Lin Fan felt that the situation that was going on right now was way too intense! With a bunch of utmost powerful beings chasing after him relentlessly, they were just coming straight for his life!</p><br/><p>When Lin Fan turned around, he realized that those utmost powerful beings were hot on his heels in pursuit.</p><br/><p>There was no way to shrug them off at all!</p><br/><p>\"What to do? Just what should I do so that I can shrug these guys off my a*s?\" At this moment, Lin Fan's mind when into a whirl as he thought up of all he could. But, for a moment or so, he just couldn't come up with anything at all!</p><br/><p>Ten days later…</p><br/><p>Lin Fan had leaped through several worlds by now and was just thinking of all sorts of methods to get these guys off his back. But, it was as though these guys were on drugs and were just bent on chewing him down. There was no getting away from them!</p><br/><p>In the past ten days, Lin Fan had been bombarded by these utmost powerful beings for God knows how many times. If not for the fact that his Physical Body State was quite something, he would have long been blown apart by this bunch of fellas.</p><br/><p>Just at this moment, Lin Fan's eyes sparkled. He had caught sight of a world up ahead that was filled with a peaceful aura. It was surrounded by a beauteous nature with birds chirping and the amazing scent of flora. This looked just like a Paradise on Earth!</p><br/><p>At this moment within that world, there were two figures that were bathing in a white pool within.</p><br/><p>The white pool gave off a rainbow colored mist.</p><br/><p>\"Big Sister Jade Pool, this Universal God Water is some good stuff indeed. Taking a bath in this every now and then has really gotten my complexion much better!\" There was a girl with nine silver furry tails on her back.</p><br/><p>This woman was none other than the Old Mistress of the Fox race. Even though she looked breathtaking from the surface, she was an old monster that had already lived for countless of eras.</p><br/><p>And this Big Sister Jade Pool was the Old Mother of the Jade Pool. Amongst the utmost powerful beings, she was one of the very few females.</p><br/><p>\"That's only natural! Little Sister Da Ji, you should come over to your Big Sister's place over here more often.\" The Old Mother Jade Pool chuckled out while saying.</p><br/><p>That curvy figure of hers hidden within the pool was faintly discernable. It was extremely alluring to look at indeed.</p><br/><p>And just at this moment, an aura bolted over all of a sudden. The faces of the both of them changed.</p><br/><p>Lin Fan crossed through the void and whistled out in a high cheery tone, \"Wow! Beauties! We're here for a tour, hehe!\"</p><br/><p>\"Degenerate…!\" When the two women caught sight of Lin Fan, their faces changed. In a flash, they draped their clothes over their bodies.</p><br/><p>\"Old Master Thunder, Old Master Bat, Old Master Devouring Heavens…! I caught a peep! You guys hurry and head over too!\" Lin Fan's eyes shone with a sharp glint. Whether or not he could escape would depend on this now!</p><br/><p>When the Old Mother Jade Pool and the Old Mistress Fox heard these words, they both of them froze up and turned around into the void. Indeed, there were several other utmost powerful beings that were coming through after this degenerate!</p><br/><p>\"Brazen! How dare you bunch of degenerates trespass into these Sacred Grounds?\"</p><br/><p>…</p><br/><p>At this moment, Old Master Thunder and the others were almost dying out of rage. This damned fella was running faster than any of them! For a moment or so, they truly could not catch up with him at all!</p><br/><p>But just at this moment, two figures appeared right before their faces. Momentarily, the face of Old Master Thunder broke into a glee, \"Both of you, would you mind helping us hold off that fella…?\"</p><br/><p>But all of a sudden, something that startled the Old Master Thunder and the others happened. The Old Mother Jade Pool and Old Mistress Fox had struck down at them immediately right in their faces!</p><br/><p>\"Degenerates…!\"</p><br/><p>The Old Master Thunder was taken aback as he yelped out in his heart. How did they turn into degenerates…?</p><br/>\n</div>"}