{"title": "Chapter 923: The Crazy Robbing Party", "id": 923, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-923-the-crazy-robbing-party", "volume_title": "Volume 10", "body": "<h1>Chapter 923: The Crazy Robbing Party</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 923: The Crazy Robbing Party</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Brothers of the Thunder race, what are you guys doing? We're all good friends, aren't we?\"</p><br/><p>\"Holy f*ck! How could you do this? Don't tear my clothes! Otherwise, I'm going to get mad!\"</p><br/><p>\"What Hall of the Thunder Sect are you guys from? I'm going to go complain to your Old Master!\"</p><br/><p>Piak!</p><br/><p>A resounding slapping sound rang out.</p><br/><p>\"Shut the f*ck up! If you say anything more, I'm going to kill you!\"</p><br/><p>In order to set up a good example for these disciples of the Disciplinary Hall, Lin Fan naturally took the lead as the vanguard to take Yi Hongtian down immediately and rob him first.</p><br/><p>His storage rings were all confiscated, and even his clothes were not let off! He was left with just a single piece of underwear.</p><br/><p>\"Stop that now! Return me my storage rings! Just who in the world are you?\" Yi Hongtian hollered out in rage.</p><br/><p>The corpse of that Supreme state powerful being was within those storage rings along with a large chunk of his personal possessions! If it were all taken away by the other party, he would truly be taking a huge loss this time around!</p><br/><p>Lin Fan's moves were swift and ruthless. Instantly, he stripped Yi Hongtian clear and shouted out, \"Alright everyone, listen up! I am the Hall Master of the Thunder race's Disciplinary Hall! So what if you guys are from the Wings race? Our Thunder race is just going to rob you guys clean!\"</p><br/><p>\"Stop that! If you dare to continue as such, I'll definitely report it to my Old Master when I head back!\" Yi Hongtian was stumped. To think that these guys from the Thunder race would dare to be this overbearing!</p><br/><p>They were totally disregarding any ties of friendship between them!</p><br/><p>\"Old Master of the Wings race? Hmph! Go back and report this properly then! Our Old Master gives no sh*t about that whatsoever Old Master of yours! As long as you guys dare to step foot on the Thunder race, I'm sure that our Old Master will have YOUR Old Master looking to pick up his teeth from the ground!\" Lin Fan humiliated them indiscriminately.</p><br/><p>\"And, remember this as well! Our Old Master has said that the Old Master of your Wings race is nothing more than a Birdman! Flapping his wings left and right all day and night? One of these days, he's going to roast your Old Master into a barbequed chicken!\"</p><br/><p>When Yi Hongtian heard these words, his entire face flushed red instantly. His eyes were like that of a mad bull right now as he glared at Lin Fan with a death stare.</p><br/><p>\"Y-you…!!!\"</p><br/><p>Lin Fan felt that he was truly being a little too much right now to put out such overbearing words. If these fellas were to head back and report this to Lucifer, he would definitely come straight for the life of the Old Master Thunder!</p><br/><p>\"You what you? Could it be that you've got no idea how it's like for a Birdman to be roasted? I'll let you know right now!\" Lin Fan gathered a strain of the Power of Thunder on his hands and pointed it out at Yi Hongtian's wings.</p><br/><p>A sizzling sound rang out along with a scent of a something being burnt. With that, the snow white wings of Yi Hongtian suddenly had a charred black patch on it.</p><br/><p>\"Did you see that? That's what it's like to roast Birdmen.\" Lin Fan replied.</p><br/><p>\"AHHHH…!\" When Yi Hongtian caught sight of this, he roared out in anger, \"DAMN IT…!\"</p><br/><p>Lin Fan kicked Yi Hongtian down onto the ground instantly. Yi Hongtian, who was wearing nothing but his briefs, looked over at Lin Fan with his bare body, bearing an infuriated look in his eyes.</p><br/><p>Now that there was Lin Fan to lead them along the way, the disciples of the Disciplinary Hall were naturally extremely elated. To think that it would be so joyful robbing others!</p><br/><p>\"HAHAHA! I've got myself an elixir!\"</p><br/><p>\"Holy f*ck! That is a Triple Turns Elixir! That thing can raise one's cultivation state! Do you want to swap it with me? I've got a Godly Medicine here!\"</p><br/><p>\"Get on the side! Not swapping man!\"</p><br/><p>\"I found a martial arts mystic skill over here! This is a mystic skill that belongs to a Supreme state powerful being!\"</p><br/><p>\"I've got a Dao Weapon over here as well!\"</p><br/><p> \"What's a Dao Weapon even comparable to? I've got myself a Lower Graded Utmost Treasure here!\"</p><br/><p>\"Oh! I'm so envious of you guys! The Birdmen of the Wings race that I've robbed here are simply way too poor! To think that they've only got Shengyang Pills!\"</p><br/><p>\"Birdman! You had better hand over your stuff honestly! Are you still hiding anything else with you! No, this will not do! I'm going to strip you of your underwear as well to see if you've got anything else beneath!\"</p><br/><p>\"Holy f*ck! All of you Birdmen are simply way too crafty! To think that you would hide your treasures within your underwear!\"</p><br/><p>…</p><br/><p>All of these disciples of the Disciplinary Hall were equally swift and ruthless. These utterly defenseless beings of the Wings race were swiped clean in an instant without leaving them with anything.</p><br/><p>They were even more like bandits than bandits right now.</p><br/><p>At the start, there were some disciples who were hesitant to lay their hands on these people. But, when they caught sight of how their senior brothers were all receiving good items out of the robberies, they could not resist it in their hearts anymore. And thus, they too joined in with the huge robbing party.</p><br/><p>\"THUNDER RACE! OUR WINGS RACE WILL NEVER LET YOU GUYS OFF!\" Right now, Yi Hongtian's heart was bleeding out. They had obtained quite a few decent rewards from clearing the secret grounds. But, to think that these bandits of the Thunder race would rob them clean of everything!</p><br/><p>How could they possibly endure this?</p><br/><p>A torrential amount of fury was accumulating in their hearts. This was simply way too intolerable.</p><br/><p>Seeing this current situation, Lin Fan was extremely pleased. The Supreme state powerful being's corpse that Yi Hongtian had obtained in the secret ground was not of much use for Lin Fan. So, he tossed that sh*t into the Xuanhuang World for Xuan Yunxian and the others to cultivate with.</p><br/><p>When he saw how that vast group of beings from the Wings race were now stark naked without anything left, Lin Fan's heart skipped with joy. He then waved his hand.</p><br/><p>\"Alright, time to go!\" Lin Fan announced.</p><br/><p>\"Yes, Hall Master!\"</p><br/><p>The disciples of the Disciplinary Hall who had followed Lin Fan out were all extremely satisfied right now. Even if they had not robbed over anything particularly special, they had obtained quite a number of pills still.</p><br/><p>After Lin Fan and the others had left, Yi Hongtian flew into a rage.</p><br/><p>When he looked at his junior brothers whose faces were filled with looks of despair, his entire heart was just surging with wave after wave of hatred.</p><br/><p>\"DAMNED THUNDER RACE! WE WILL DEFINITELY NOT LET YOU GUYS OFF!\"</p><br/><p>\"I must definitely report this matter over to the Old Master so that he can take care of these guys personally!\"</p><br/><p>\"Fellow junior brothers! We have endured the humiliation and robbing of the Thunder race today! This is something we cannot possibly tolerate! Let us head back now and report this to the Old Master so that he can seek redressal for us!\" Yi Hongtian hollered out in wrath.</p><br/><p>\"Yes! Report to the Old Master! From this day forth, the Thunder race shall be the sworn enemy of our Wings race!\"</p><br/><p>With that said, the entire group of butt-naked beings of the Wings race burst into the void and headed back to their base.</p><br/><p>Along the way, when various other races caught sight of these butt-naked beings of the Wings race, they were dumbfounded as well. From this moment forth, the name of the Wings race that had a weird fetish started spreading out amongst the thousands of races like wildfire.</p><br/><p>And at this moment, Lin Fan had already changed a location.</p><br/><p>\"Hall Master, to think that these guys from the Crocodile race would be even poorer than those of the Wings race! There's simply nothing good to rob out of them!\" A disciple reported to Lin Fan with a look of reverence.</p><br/><p>For them, today was simply way too pleasurable of a day!</p><br/><p>'Rob…rob…!!!'</p><br/><p>Just like that, they robbed a few races in succession. Whomsoever they met with, they threw every single bit of caution to the winds and pounced out like ferocious tigers.</p><br/><p>'Rob completely!'</p><br/><p>'Strip completely!'</p><br/><p>'Leave them with absolutely nothing.'</p><br/><p>Lin Fan was pleased with the results of today's battle. This time around, even if the Old Master Thunder were to jump into the Yellow River, he would not be able to wash off this allegation from himself.</p><br/><p>At this moment, the disciples of the Crocodile race looked at Lin Fan in fright. They could not believe that the Thunder race would dare to do something as such!</p><br/><p>At the same time, these guys had even insulted their Master!</p><br/><p>\"Let's go…!\"</p><br/><p>Without lingering any further, Lin Fan brought the masses with him away.</p><br/><p>Two days later…</p><br/><p>Lin Fan stood in the void with the disciples of the Thunder race all grinning from ear to ear. They did not know just how many races they had robbed in these past two days.</p><br/><p>In any case, it was just a lot… a lot.</p><br/><p>And right now, their wealth had already reached an astounding state that was absolutely incredible.</p><br/><p>Shing!</p><br/><p>Right at this moment, the bloodline of the Thunder race within Lin Fan's body began to rumble. From a dimension far from the beyond, it seemed as though there was a mysterious power that was beckoning out to him.</p><br/><p>…</p><br/>\n</div>"}