{"title": "Chapter 925: And Everything Turns Chaotic!", "id": 925, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-925-and-everything-turns-chaotic", "volume_title": "Volume 10", "body": "<h1>Chapter 925: And Everything Turns Chaotic!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 925: And Everything Turns Chaotic!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"The strength of the Great Sage is extraordinary indeed. Even up against the five of us, you are still be able to handle it with ease. But, it's a pity the same can't be said for others of your race.\"</p><br/><p>The Old Master of the Bat race was extremely sinister, and knew how to attack the mental psyche of his opponents. It was especially crucial at a moment like this where they could not take down this monkey even with the combined forces of five of them just yet! This was something that was causing them to feel a little troubled.</p><br/><p>The metal cudgel in the hands of that monkey was a Legendary Item with an unrivaled might. The battle power that burst forth from it was more horrifying than anything else.</p><br/><p>If it were a one on one fight, they might truly not be a match for him.</p><br/><p>But right now, it was five on one. No matter who it was, the opponent would have to just lie down obediently.</p><br/><p>The heart of the Great Sage was burning with anger. When he turned around and looked at those of his fellow race, that firm and resolute spirit of his began to tremble.</p><br/><p>\"DIE!\"</p><br/><p>The Great Sage howled out in an anguished manner, \"ALL OF YOU F*CKING B*STARDS! GO AND DIE!\"</p><br/><p>At this moment, the arms of the Great Sage swelled up as that metal cudgel of his shone with an infinite brightness. The light beam pierced up into the Heavens. With that single move, the entire world toppled over.</p><br/><p>\"Old Master Thunder, it's time.\" The Old Master of the Bat race said coldly.</p><br/><p>\"Yes.\"</p><br/><p>BAM!</p><br/><p>That cudgel struck down; four utmost powerful beings exchanged glances with one another as they defended against that strike.</p><br/><p>And right at this moment, the Old Master Thunder transformed into a God Thunderbolt that appeared right behind the Great Sage suddenly. Slapping out with both his palms, a boundless Power of Thunder burst forth ferociously.</p><br/><p>\"Monkey, it's over!\"</p><br/><p>The Great Sage gritted his canines and turned around as his entire body shuddered in the face of this devastating power that was cruising through his entire body. This was the Old Master Thunder's attack that came with all of his power.</p><br/><p>Even if it were an utmost powerful being, they would not be able to defend against this.</p><br/><p>\"HAHAHA!\"</p><br/><p>The Old Master Thunder roared out in laughter. He seemed deranged right now.</p><br/><p>Just as the Old Master Thunder was about to capitalize on this advantage and take down the Great Sage entirely, a series of powers descended down from the void.</p><br/><p>\"Old Master Thunder! How dare you bully my race!\" Darkness descended as the sixteen pairs of Lucifer's wings covered the entire sky. An unparalleled godly glow shone down on the entire world.</p><br/><p>\"EH?!\"</p><br/><p>Old Master Thunder was stunned for a moment, not understanding what was happening.</p><br/><p>He had been discussing with these few utmost powerful beings about how to take down the Monkey race for a long time now. Since when had he ever gone to bully anyone else?</p><br/><p>\"Old Master Thunder! If you don't give me an answer for it today, my Crocodile race will definitely not let you off at all!\" And right at this moment, a Crocodile that spanned up to a hundred million feet in length appeared in the void. Its four limbs were just like heaven piercing pillars that ripped through the void and appeared in the world.</p><br/><p>For a moment, the Old Master Thunder was truly caught at a loss and was frozen.</p><br/><p>\"What's going on? Just what does this Old Master of the Crocodile race want me to account for?\"</p><br/><p>When Lin Fan caught sight of what was going on at this moment, his heart leaped with joy. To think that he would have done such a good deed!</p><br/><p>Initially, he had only intended for the Old Master Thunder to endure a group assault by the others. But, to think that right when the Monkey race was experiencing this ordeal right now, the appearance of these two races would just be akin to lifelines!</p><br/><p>However, Lin Fan remembered that he had bullied quite a number of races. Why were there only two that had arrived right now? If all of them were to come, it would definitely be lively!</p><br/><p>\"Lucifer, Old Master Crocodile, what's the meaning of this? Since when has Your Old Master here ever offended you guys?\" Right now, the Old Master Thunder was truly stumped.</p><br/><p>To think that these fellas would spout right out of nowhere! If he didn't settle this properly, it might lead to yet another great battle instead!</p><br/><p>If it were any other time, the Old Master Thunder would definitely have ignored them. If they wanted to fight, then they might as well come at him! Who was afraid of whom?</p><br/><p>But, this was a different situation.</p><br/><p>Right now, he was in the midst of taking down this monkey. If any hiccups were to occur and this monkey were to give them the slip, all their efforts would have gone to waste, and the outcome would be unimaginable.</p><br/><p>\"Hmph! Old Master Thunder, how about you take a look at what this is?\" At this moment, Lucifer swept his robes as a bright burst of light flashed out.</p><br/><p>This was an image that was conjured with his powers that displayed everything that had happened.</p><br/><p>When Lin Fan caught sight of the image, he was stumped as well. This bloody did not make any sense at all! When in the world did those Birdmen record him down? This was somewhat terrifying now!</p><br/><p>Within the image, Lin Fan stormed into the midst of the Wings race and engaged in his robbery. The disciples of the Wings race were extremely pitiful as they were robbed stark naked from head to toe.</p><br/><p>And when the portion of Lin Fan's speech came about, Lucifer's face was even darker.</p><br/><p>\"Your Wings race's Old Master is nothing but a Birdman! One day, we're going to roast your Old Master into a Birdman!\"</p><br/><p>…</p><br/><p>Every single word that Lin Fan had produced was beyond tyrannical.</p><br/><p>\"Old Master Thunder! What else do you have to say for yourself? Do you really think that I, Lucifer, am a pushover?\" The heart of Lucifer was burning with rage right now as he could not bear to rip the Old Master Thunder into shreds.</p><br/><p>When the Old Master Thunder caught sight of this image, he was confounded as well.</p><br/><p>Bloody hell! Since when had Your Old Master said something like that? When he looked at that face in the image, his entire face burnt with an endless rage.</p><br/><p>\"LEI MING! GET THE HELL OVER FOR YOUR OLD MASTER!\" Right now, the Old Master Thunder was completely enraged.</p><br/><p>This bloody cock of a descendant! To think that he would cause such trouble for Your Old Master! Since when had Your Old Master ever said something like this?</p><br/><p>Lin Fan's heart skipped a beat. With that roar of the Old Master Thunder, the bloodline of the Thunder race within his body rumbled. If he were to use that bit more strength, it was as though this bloodline could just explode at any time.</p><br/><p>\"O-old Master.\" Lin Fan acted as though he was slightly startled as he hurried over.</p><br/><p>\"You tell them! Since when had Your Old Master said such words? Also, why did you do something as such to the Wings race and the Crocodile race? If you dare to even speak of a single bit of lie, Your Old Master is going to peel your skin right off!\" The voice of the Old Master Thunder was harsh right now as he could not bear to pinch this Lei Ming right to death.</p><br/><p>This bloody fella that did more harm than help!</p><br/><p>\"Damned lad!\" Lucifer sized up Lin Fan as his eyes shone with an endless killing intent. However, he bore with it for the moment. He wanted to see just what in the world was up with this as well.</p><br/><p>When Lin Fan checked out the situation right now, his mind started whirling. He then continued, \"Old Master, these were the orders that you gave me! You said that both the Wings race and the Crocodile race are disgusting races! This was especially the case for the Wings race's Old Master Lucifer, who had sixteen pairs of wings. That's just a complete Birdman! And the shape of that Old Master Crocodile looks extremely hideous to the point of it being nauseating to even look at him! That's why your underling, I, chose to commit such acts!\"</p><br/><p>\"Bullsh*t! I think you're just looking to die!\" The Old Master Thunder was enraged as he roared out, sending a formidable force slamming over.</p><br/><p>Lin Fan's sharp mind thought for a moment as he puked out a mouthful of old blood. His eyes were filled with fright, \"Old Master, I've always been loyal to you with all my heart! Why are you doing this to me?\"</p><br/><p>When the other Hall Masters of the various Halls caught sight of this, their hearts leaped with joy. This was especially the case for Lei Kuanglong who was mixed in with the crowd. He gave off a sinister smirk.</p><br/><p>\"I reckon that you won't know when to give up until you see your coffin. Today, Your Old Master is going to rip your body apart!\" The Old Master Thunder roared out with a torrential aura as God Punishment Thunderbolts swarmed out across the entire sky. They were like pythons that were coiling around the entire Heavens.</p><br/><p>When Lin Fan caught sight of this, his entire face was alarmed as he screamed out tragically, \"Bat Ancestor, save me! Please don't kill me, Old Master! I'll confess! Everything was because I was instructed by the Bat Ancestor and the Old Master Devouring Heavens…!\"</p><br/><p>Old Master Thunder, who was just about to kill Lin Fan, froze up for a moment. But, the Bat Ancestor and the Old Master Devouring Heavens were even more stunned. Their hearts burned with wrath as they roared out, \"B*stard sh*t! How dare you speak nonsense? Courting death!\"</p><br/><p>All of a sudden, the Old Master Devouring Heavens opened his mouth wide and tried devouring the entire world. It was as though he wanted to devour Lin Fan with that single mouthful.</p><br/><p>But, the face of the Old Master Thunder changed as he blocked off the attack of the Old Master Devouring Heavens. He then glared straight at Lin Fan, \"YOU tell me! Just what is going on right now?\"</p><br/><p>All of a sudden, the tension of the entire place seemed to have changed altogether.</p><br/><p>But for Lin Fan, this was a mother*cking magical feeling! To think that this mess that he had created could have caused the situation right now to turn even more chaotic!</p><br/>\n</div>"}