{"title": "Chapter 934: Just A Small Little Experiment", "id": 934, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-934-just-a-small-little-experiment", "volume_title": "Volume 10", "body": "<h1>Chapter 934: Just A Small Little Experiment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 934: Just A Small Little Experiment</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>'What in the world is this Intent of Power thing?'</p><br/><p>Lin Fan did not know what the Demonic God Pangu was up to.</p><br/><p>One thing that Lin Fan hated the most was when people just left their sentences midway and left everything totally unclear. If not for the fact that he could not defeat the Demonic God Pangu, Lin Fan might have truly whacked him sprawling over so that he could say everything out clearly and properly.</p><br/><p>'Ding… Congratulations on discovering Intent of Power.'</p><br/><p>'Ding… Do you wish to accumulate the Source of Power?'</p><br/><p>Lin Fan was stunned. Was there even a need to ask this? Naturally, he had to accumulate it, duh? Wasn't that just a nonsensical question?</p><br/><p>Ever since Lin Fan had the System, he knew that he didn't have to be wary of being scammed by anything.</p><br/><p>In front of the System, nothing could hide their true intentions at all. Back in the past when that Seven Saint Old Dog had wanted to scam him to death with the pills, it was all thanks to the checks of the System that Lin Fan had avoided the scam.</p><br/><p>And right now, this Intent of Power here had Lin Fan developing some favorable impressions of the Demonic God Pangu. To think that he would come forth to give him such a nice gift!</p><br/><p>The Demonic God Pangu who had already left long ago looked back into the distance behind him.</p><br/><p>Towards this Motherf*cking Human King, he had pretty high hopes. If anyone could transcend through everything, it might just be this Human right here.</p><br/><p>\"Hais, only, I wonder if that Human will be able to comprehend the Intent of Power.\"</p><br/><p>\"Power is something that everyone has. However, the Source of Power is not something that everything can hope to comprehend.\"</p><br/><p>As the Power Demonic God, the Demonic God Pangu was the strongest existence in the entire world. However, even if it were him, he could not break through everything and transcend. If this Motherf*cking Human King wishes to transcend without being able to comprehend the Source of Power, that would naturally be something impossible as well.</p><br/><p>Shing!</p><br/><p>Just at this moment, the void far in the distance began to tremble as a formidable power surged its way into the void.</p><br/><p>\"T-this…!\"</p><br/><p>The Demonic God Pangu was dumbfounded when he sensed the power that was emanated forth.</p><br/><p>How could this be?</p><br/><p>\"How could that lad possibly comprehend the Source of Power so quickly?\" The Demonic God Pangu was absolutely astounded right now as his face was filled with utter bewilderment. As the Power Demonic God, it was born in him to be able to comprehend the Source of Power.</p><br/><p>Over the countless of eras that had passed, he had gifted the Power Imprint to many of the savants and geniuses of those eras as well.</p><br/><p>However, to the disappointment of the Demonic God Pangu, none of them were able to comprehend the Source of Power. Although, those geniuses were pretty exceptional in their own rights as well. Through the Power Imprint, they managed to comprehend all sorts of mystical and supreme martial arts skills.</p><br/><p>This was something that the Demonic God Pangu had considered as extraordinary as well.</p><br/><p>But right now, he was left entirely speechless. He had ONLY just left, and the Motherf*cking Human King had already comprehended the Source of Power? This was way too horrifying!</p><br/><p>Looking over with a deep gaze for one final time, the Demonic God Pangu eventually left the place.</p><br/><p>…</p><br/><p>\"Could this be the Source of Power?\"</p><br/><p>Right now, Lin Fan could feel some changes going on within his Inner World. Within the center of his Inner World was a source that was like the mouth of a spring being surrounded by a Mist of Power.</p><br/><p>The Xuanhuang World, Earth, and his Paradise were all revolving around this Source of Power continuously.</p><br/><p>\"This is pretty interesting.\"</p><br/><p>Lin Fan had suddenly realized that his powers had gotten more mysterious right now. He then returned to the Pill Shop and continued to try figuring this out even further.</p><br/><p>Yang Wantian looked at his Master. He realized that his Master seemed a little different upon his return.</p><br/><p>After entering the backroom, Lin Fan sat down cross-legged as his Essence, Spirit and Vitality were all fused into his Inner World.</p><br/><p>'Source of Power: Level 1.'</p><br/><p>\"To think that there's even a level to this! Seems like I've got to comprehend this properly on my own.\"</p><br/><p>Ever since he got the system, everything had turned into numerical values. Even if he wanted to level up, he would require experience points.</p><br/><p>When Lin Fan's Essence, Spirit and Vitality started churning together with the Source of Power, the notifications of the experience points rang out.</p><br/><p>\"Oh, so that's the case!\"</p><br/><p>Ever since he had comprehended the Source of Power, every single strike that Lin Fan made was filled with a formidable amount of force that ruptured forth. Even though his personal cultivation state had yet to be raised, every move of his was way stronger compared to before.</p><br/><p>The days passed one after another…</p><br/><p>One month later, when Lin Fan opened his eyes, a brilliant light shot out of both his eyes.</p><br/><p>\"Could this be the True Essence of Power?\"</p><br/><p>After an entire month of hard work at cultivation, the Source of Power had finally reached level 2 successfully. Even though it was just an increase of a single level, Lin Fan could clearly feel that his personal strength had turned ever stronger.</p><br/><p>This was the booster of the True Essence of Power, similar to when he was buffed with the True Essence of Fire and Water from the Fire Water Empress.</p><br/><p>However, the True Essence of Fire and Water that he had once comprehended were imparted to him by the Fire Water Empress, and not something he had cultivated out on his own.</p><br/><p>But right now, this Source of Power was something that belonged to him personally. No one else would be able to snatch this from him.</p><br/><p>\"Master, you're out of your seclusion!\" When Lin Fan came out, Yang Wantian rushed forth and greeted him immediately.</p><br/><p>\"Yes.\" Lin Fan nodded his head.</p><br/><p>He then looked over at Yang Wantian's son beside him. Suddenly, a thought struck Lin Fan.</p><br/><p>Or perhaps, this could be considered as an experiment.</p><br/><p>Now that he had already comprehended the Source of Power, he wondered if he could have Yang Batian comprehend the same Source of Power as well.</p><br/><p>If he could do that, wouldn't it be absolutely heaven revolting?</p><br/><p>After all, the name of this lad was something that he had given himself! With such a domineering name, if he didn't have an equivalent amount of power matching it, wouldn't that be something irreconcilable?</p><br/><p>\"Lad, come over here.\" Lin Fan curled with his finger.</p><br/><p>Yang Batian twerked his bottom and came before Lin Fan. Those innocent and huge eyes of his shone with curiosity, wondering what his Master had called him over for.</p><br/><p>During this period of time, Yang Wantian had been brainwashing his own son. The man before him was his Master. Therefore, it was naturally easy to brainwash his child, and it was thus no wonder that by now, Yang Batian was clear of the fact that Lin Fan was HIS Master as well.</p><br/><p>Yang Wantian looked over at his Master and then back at his child. He wondered what his Master was up to.</p><br/><p>Lin Fan placed his palms on the head of Yang Batian.</p><br/><p>\"Impart.\"</p><br/><p>The Trainer module had the function of imparting skills naturally existent within it as well.</p><br/><p>\"Source of Power.\"</p><br/><p>Indeed, it was as Lin Fan had suspected! The Source of Power could truly be imparted over to Yang Batian!</p><br/><p>\"The System is just absolutely heaven revolting now!\"</p><br/><p>If the Demonic God Pangu were to find out about this, he would definitely be shocked sh*tless.</p><br/><p>At the start, Yang Wantian did not know what was going on just yet. But all of a sudden, he realized that the aura of his child had changed!</p><br/><p>A boundless amount of power was bursting forth from the body of his child. This power brought with it an aura that could devastate the entire world!</p><br/><p>Yang Wantian was a Divine celestial state powerful being. Therefore, he could naturally sense the difference in terms of the power. This could be considered as something that had surpassed everything!</p><br/><p>\"You're still too young right now and it's definite that you will not be able to control this well. I guess I should only activate it for you when you're older.\"</p><br/><p>Lin Fan felt that if outsiders were to find out that a power as such was being emanated out of the body of this child, they would definitely tear him apart to experiment on him! Therefore, it was better for him to seal up the skill and wait for him to grow older before he started cultivating on it. By then, he should be able to have more mastery over it.</p><br/><p>Thud!</p><br/><p>At this moment, Yang Wantian collapsed onto the ground, kneeling in a loud thud.</p><br/><p>\"Thank you, Master! I, Yang Wantian, will definitely serve you with all my heart from now on forth even at the cost of my life!\"</p><br/><p>It was natural that Yang Wantian could sense the power that was brooding within the body of his son. This power had him feeling absolutely fearful. Therefore, there was no need to even talk about how great of a gift this was.</p><br/><p>\"Yes.\"</p><br/><p>Regarding something as such, Lin Fan naturally did not put it to heart. This was just a small affair. Furthermore, this was also just a small little experiment on its own.</p><br/><p>Right now, Yang Batian was still too young to understand. However, this path he was on was one that was retrospective at this moment.</p><br/><p>By the time he came of age and awakened this Source of Power within him, he would definitely be on the path where he would hang and whack any genius in his path.</p><br/><p>And, to think that all of this was just a little experiment in the eyes of Lin Fan.</p><br/>\n</div>"}