{"title": "Chapter 938: Come At Me Then!", "id": 938, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-938-come-at-me-then", "volume_title": "Volume 10", "body": "<h1>Chapter 938: Come At Me Then!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 938: Come At Me Then!</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>\"Motherf*cking Human King, you had better stop there for Your Old Master!\"</p><br/><p>Right now, the Old Master Bat was excited beyond anything else. To think that he would be the one to discover the whereabouts of the Motherf*cking Human King!</p><br/><p>This Motherf*cking Human King had stolen tons of Legendary Items, and had long incurred the wrath of the utmost powerful beings who could not wait to rip his body up into shreds.</p><br/><p>The moment the Old Master Bat realized that his Blood Sea Formation had been destroyed, he sent over a trace of his consciousness from the void. And when he discovered that it was Lin Fan, he was thoroughly exhilarated.</p><br/><p>The previous time around, he had chased down this guy with the Old Master Thunder and the others for quite some time. But eventually, this damned Human gave them the slip. That was something that had them feeling extremely vexed. Right now, the Old Master Bat swore to the Heavens that he would definitely not let this Human make his escape once more.</p><br/><p>\"Stop your mother! Come chase after me if you've got the guts!\" Lin Fan dove into the endless void as he roared out towards the Old Master Bat.</p><br/><p>Just someone like the Old Master Bat and he wished to be able to take down Lin Fan? That guy had got to be dreaming! The eventual victor of this matter was to be determined just yet!</p><br/><p>\"Hmph! When I get my hands on you later on, I'll definitely have you know the true meaning of horror!\" The Old Master Bat laughed out sinisterly. He was determined to suppress this Motherf*cking Human King entirely. If that were the case, all of those Legendary Items would belong to him!</p><br/><p>The moment he thought of this, the Old Master Bat was filled with an endless amount of fighting spirit.</p><br/><p>\"Great Sage, how are you now!\" Lin Fan had been communicating with the Great Sage in his Paradise this entire time. Through the couple of months of recuperation, the wounds of the Great Sage had healed up more or less by now.</p><br/><p>\"Almost done now!\" The aura of the Great Sage had stabilized by now, and there wasn't much of an issue anymore. With no major issues bothering the Great Sage, Lin Fan heaved out a sigh of relief as well.</p><br/><p>At this moment, Lin Fan checked out the situation of his surroundings. This was a desolate place with no signs of life whatsoever.</p><br/><p>Leaping out of the void, Lin Fan floated gently up in the sky.</p><br/><p>\"Why have you stopped running?\" When the Old Master Bat saw how the Motherf*cking Human King was just floating up in the sky, he broke into a cold laugh.</p><br/><p>\"Why should I run? Unless, you really think that you can take down Yours Truly, eh?\" Lin Fan burst out laughing. Given his current strength, it wasn't much of an issue fighting with an utmost powerful being for a bit now.</p><br/><p>In this period of time that had passed, Lin Fan had not just been dazing off in his shopfront and doing nothing else.</p><br/><p>The Unrivalled Heaven Duelling Mystic Technique was a mystic martial arts skill of the Great Sage. Towards this mystic skill, Lin Fan could say that he had some sort of a personal understanding, because of which, his battle prowess had risen quite a fair bit as well.</p><br/><p>As for the Source of Power, it had reached Level 3 by now, and that gave his strength yet another major boost as well.</p><br/><p>Even if he were to fight it out with the Old Master Bat, it wasn't going to be entirely impossible.</p><br/><p>However, an utmost powerful being was still an utmost powerful being no matter what. In terms of the states they were in, they were still above and pressing down on Lin Fan.</p><br/><p>Right now, Lin Fan just wanted to try out his strength for a little.</p><br/><p>In a flash, Lin Fan's body expanded out as a heaven piercing aura burst forth from him.</p><br/><p>His battle intent was torrential as though he had just conquered through all the ancient times.</p><br/><p>\"Old Master Bat, show Yours Truly just how strong you utmost powerful beings are!\" Lin Fan's body jerked tremendously as he activated his movement skill, So Near, Yet So Far. Instantly, eight Lin Fans appeared out within the void.</p><br/><p>When these eight Lin Fans moved their bodies, countless of martial arts mystic skills were deployed in the blink of an eye. For utmost powerful beings, any form of stances or skills were all useless. To them, only absolute power could suppress everything.</p><br/><p>Ever since he had comprehended the Intent of Power, Lin Fan had a great deal of confidence in his own strength.</p><br/><p>\"Pretty interesting!\" When the Old Master Bat caught sight of the scene before him, he laughed out coldly. Momentarily, a torrential blood sea surged up into the sky as an unparalleled mystic skill was deployed.</p><br/><p>The eight Lin Fans fused into one immediately and appeared on the side of the Old Master Bat. Slamming out with a single fist, a large amount of accumulated power was released, converging onto a single point that formed a typhoon of power, curling out before shredding at the Old Master Bat straightaway.</p><br/><p>This single fist was the comprehension of Lin Fan gained over these past few months. It was as though a Power Demonic God was standing right on this fist itself. This was a fist that possessed the might of the Source of Power.</p><br/><p>Lin Fan had an extremely talented gift and was able to comprehend any martial arts mystic skills in the shortest period of time. This was especially with this System that he possessed which was just like a BUG. This made him the sickest existence in this entire world.</p><br/><p>Even though the Old Master Bat had always been looking down on the Motherf*cking Human King, when the fist burst forth with that unparalleled gleam of light, even the former's face could not help but tense up.</p><br/><p>BAM!</p><br/><p>This earthshattering fist was blocked out by that blood sea of the Old Master Bat. For Lin Fan, this punch felt as though it had just landed onto sponge. It felt weak and powerless as though all the boundless impact had been absorbed up by that blood sea.</p><br/><p>\"HURGH!\"</p><br/><p>Lin Fan roared out as the power of all three Worlds within him rumbled out furiously and the Source of Power boomed out even more intensely. With the powers being channeled, this punch caused the entire blood sea to disperse in an instant.</p><br/><p>Step, step!</p><br/><p>The Old Master Bat stumbled back a few steps as he put on a serious expression thereafter.</p><br/><p>\"That's the Source of Power of the Demonic God Pangu. How could a Human like you…?\" Under a moment of carelessness from the Old Master Bat, he had actually taken in a slight loss! This was something that he felt absolutely unbelievable.</p><br/><p>The Demonic God Pangu was once a Demonic God of the Ancient race. Later on, he became Sworn Brothers with an utmost powerful being of the thousands of races. Eventually, this Sworn Brother of his was killed by the Demonic Gods of the Ancient race. This had the Demonic God Pangu anguished beyond anything else, and in a fit of fury, he killed into the midst of the Demonic Gods of the Ancient race.</p><br/><p>During that battle back then, the Old Master Bat had been a witness of everything. Towards the strength of the Demonic God Pangu, even he felt trepidation in his heart. At the same time, he became extremely familiar with the Source of Power. That's the reason why he could sense it the moment Lin Fan made use of the same move.</p><br/><p>\"What now? Are you surprised? But that's not the most surprising thing just yet. I've heard from the rumors that you're the weakest amongst all the utmost powerful beings! Old Master Bat, today, Yours Truly is going to take you down then!\"</p><br/><p>With that punch from earlier, Lin Fan could truly feel as though he had a shot at victory.</p><br/><p>Even though his current strength wasn't even at the Immemorial Ancient full cultivation state yet, he felt that he had the confidence to be able to defeat the Old Master Bat.</p><br/><p>\"Big words! To think that with just someone like you, you'd think of taking down Your Old Master here! I'll have you know what a fool's dream that is!\" The Old Master Bat roared out as a humongous golden bat with four wings soared into the sky. That golden body of his shone with a chilling aura.</p><br/><p>The Old Master Bat boosted the power of the Bat World onto his own body. As that golden four-winged bat screeched out, it turned into a gigantic golden palm that tore through the void.</p><br/><p>Lin Fan took a step forth and the void beneath him shattered. However, that did not bother him at all as a torrential battle intent burst forth from him. That battle intent was extremely formidable, making it seem as though he could fight across the endless firmaments.</p><br/><p>\"Unrivalled Heaven Duelling Mystic Technique…!\" The Old Master Bat gasped out in shock. To think that this Human would even comprehend the mystic skill of the Great Sage as well!</p><br/><p>Lin Fan's battle intent was surging right into the Heavens right now. When that gigantic golden palm slammed down onto Lin Fan's body, it did not cause him any harm at all.</p><br/><p>\"How could this be…?\" The face of the Old Master Bat had lost all color right now as he was filled with disbelief.</p><br/><p>Lin Fan laughed out coldly. What a country bumpkin! Bloody hell! The physical body state of Yours Truly had already reached an Immemorial Ancient full cultivation state! Even if he took out the strength he used to suck on his mum's tits, it wouldn't have a single f*ck use on Lin Fan!</p><br/><p>Bam!</p><br/><p>That unrivaled battle intent pierced through the Heaven and Earth as Lin Fan appeared right before the face of the Old Master Bat. As he punched out, his fist landed squarely on the Old Master Bat's chest.</p><br/><p>BAM!</p><br/><p>BAM!</p><br/><p>The power exploded out as the body of Old Master Bat ruptured furiously as well.</p><br/><p>The Blood Bursting Fist of the North Star was no joke. Even if the other party were an utmost powerful being, they would have no way of defending gainst this as well.</p><br/><p>When that golden colored fresh blood sprayed out through the sky, the Old Master Bat screamed out at the top of his lungs, \"MOTHERF*CKING HUMAN KING! YOUR OLD MASTER HERE IS GOING TO F*CKING KILL YOU!!!\"</p><br/><p>But, Lin Fan could only laugh out indifferently, \"Come at me as you wish then…\"</p><br/>\n</div>"}