{"title": "Chapter 947 - Mysterious Black Shadow", "id": 947, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-947-mysterious-black-shadow", "volume_title": "Volume 10", "body": "<h1>Chapter 947 - Mysterious Black Shadow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter947mysteriousblackshadow\">Chapter 947: Mysterious Black Shadow</h3><h4 id=\"translatorlam_editorhitesh_\">Translator: Lam_ Editor: Hitesh_</h4><hr/><br/><p>The living beings of all the races had Lin Fan surrounded right now. This didn’t seem quite the friendly situation for sure.</p><br/><p>“What do you guys want? Why, do you want to make a move on me?” Lin Fan asked.</p><br/><p>‘Hand over the Eternal God Seat and that elixir. Otherwise, you can only dream of leaving.” The many living beings roared out simultaneously. If Lin Fan were to not hand over the treasures, the outcome that was awaiting him was one that would be extremely terrible.</p><br/><p>If it were any ordinary person who was faced with this many powerful beings, they might have been scared to death by this scene itself. If all of these living beings were to strike out at once, the power sent forth would definitely be earth-shaking, which one would not be able to resist at all.</p><br/><p>But, against someone like Lin Fan, weren’t these guys just courting death?</p><br/><p>“Everyone, what are we still wasting our breath on him for? If he doesn’t hand it over, all we have to do is take him down!” A woman with a remarkable disposition had a gaze that was filled with killing intent. She was clearly someone who was extremely ruthless.</p><br/><p>“Woof, woof!”</p><br/><p>Tai Ritian barked out as though he wanted to unleash all that berserk desolate power within him. When he smelt that fragrant scent of that chick, it turned him on so badly that he could barely hold it in.</p><br/><p>But, just when the masses were prepared to strike out, a formidable aura burst forth from Lin Fan’s body. This aura was so strong that it seemed as though the entire world was under his control.</p><br/><p>When all of the living beings who were prepared to strike out felt this aura, all of them let out faces of shock.</p><br/><p>This aura…</p><br/><p>So strong!</p><br/><p>They felt as though they were little ships in the middle of a raging tsunami. If the Heavens were to get enraged, any single wave could topple them over and sink them without any chance of life at all.</p><br/><p>“Do you guys still want to snatch it over?” Lin Fan asked indifferently.</p><br/><p>Step, step!</p><br/><p>All the living beings around stumbled back with a look of horror as they looked at this living being. In their eyes, the aura that was exuded out by this living being was way too strong… so strong that they could feel trepidations in their hearts.</p><br/><p>At this moment, Lin Fan focused his gaze and looked at the woman who had wanted to kill him earlier on. The woman felt her heart skip a beat. It was as though the Universal Elixir in her body was about to explode.</p><br/><p>“Senior, please spare my life…!” The woman prostrated on the ground, begging immediately. Just that single gaze was enough to send her heart palpitating out. If the other party truly wanted to kill her, he might perhaps require only a single thought.</p><br/><p>Horrifying! Way too horrifying!</p><br/><p>“Scram!”</p><br/><p>Lin Fan bellowed out. His voice was like a tidal wave that blanketed the entire world, drowning all the living beings within it.</p><br/><p>All the living beings could feel their mental states rattled and did not dare to linger here any longer. Just that voice alone was enough for their mental states to be affected so badly. They did not dare to imagine how violent it would be if he struck out personally.</p><br/><p>“Thank you for sparing our lives, senior!”</p><br/><p>“Thank you for sparing our lives, senior!”</p><br/><p>Pshew!</p><br/><p>Pshew!</p><br/><p>In the next instant, none of those living beings dared to stay for any bit longer; so they naturally left the place straightaway.</p><br/><p>“Now, everything’s quieter.” Lin Fan sighed out.</p><br/><p>All of these living beings scrambled away faster than anyone else. It was as though they were wishing that they could grow another leg to run even faster.</p><br/><p>However, these living beings could still be considered to have earned out of this place. Other than missing out on the Eternal God Seat, they had obtained quite a fair bit of rewards.</p><br/><p>In Lin Fan’s opinion, the one who lost out the greatest this time around was that Seven Saint Old Dog.</p><br/><p>This trap that he laid down hadn’t even begun to activate before it was seen through by Lin Fan. That was truly pretty miserable for him.</p><br/><p>At this moment, the void was just a patch of emptiness.</p><br/><p>The Seven Saint Old Dog roared out. By now, he had already materialized into a real body. A single look at him and one could tell that he had a disposition of a superior being, as though he was some immensely skilled being who had gone into hiding. However, that malevolent face of his was ever so menacing. A single look at it was terrifying enough.</p><br/><p>“Damn it! To think that I would bump into that darned fella!” Seven Saint Old Dog was fuming right now. After he had come here from the Xuanhuang World, he had been hiding himself for the longest time, and did not dare to reveal himself within the world.</p><br/><p>Back when the Ancient Saint World was still being ruled over by the Ancient race, Old Master Seven Saint had managed to gain control over an Ancient race being. With that, he just hid ignobly while cultivating his own strength from the depths.</p><br/><p>But, who would have thought that the world would change this quickly?</p><br/><p>Out of nowhere, the Ancient race was on the losing end, and the Infinite Worlds had fused together with the descent of countless of supremely powerful beings. This was something that had the Old Master Seven Saint completely stumped.</p><br/><p>“No matter what, I have to continue living on. Once I live till the very end, I’ll teach that damned fella a lesson to let him know of my strength!”</p><br/><p>From a long time ago, Old Master Seven Saint had already started plotting for this plan of his. Ever since he fell in the previous era, he had been awaiting the chance for his revival.</p><br/><p>Back in the Xuanhuang World, he had initially thought that he could depend on his own strength to groom out a peerless genius. But, who would have thought that he would actually bump into a twisted sicko like that guy?</p><br/><p>Not only did he expose his plan, that guy had even fused him together with the body of a dog!</p><br/><p>Finally, after enduring an endless amount of trials and tribulations, he had finally arrived at the Ancient Saint World.</p><br/><p>And, just as things were about to get better for him, what was up with the situation right now? This was something that had the Old Master Seven Saint infuriated beyond anything else. This fella had spoilt his plans once more!</p><br/><p>Half of his consciousness had already been messed up by Lin Fan, causing his personal condition to be pretty unstable. It was only after he had taken in the Essence, Spirit, and Vitality of the living beings of the thousands of races that he had started healing back up.</p><br/><p>And, just as the Old Master Seven Saint was still hating on Lin Fan, the void started vibrating out as a pitch black shadow appeared before him.</p><br/><p>“Master.” The Old Master Seven Saint prostrated on the ground respectfully. In fact, there was even a sense of fear that was bubbling in his heart.</p><br/><p>“How are things coming along?” The black shadow was grim and sharp. It was as though this was a fiend from the Nine Spirit Hells.</p><br/><p>“I’ve already gained control of 1,600 living beings.” The Old Master Seven Saint replied while shivering.</p><br/><p>“Hmph! That is not enough yet. You had better go get me control of more of them.” The black shadow commanded.</p><br/><p>“Yes.” The Old Master Seven Saint replied immediately. By the time he raised his head, the black shadow had disappeared already.</p><br/><p>The reason why the Old Master Seven Saint was able to obtain quite a number of Eternal God Seats was this black shadow, who had given them all to him.</p><br/><p>While he did not know who the black shadow was, he knew that he definitely could not offend the other party. Even though he hadn’t seen the other party strike out yet, just the aura alone was enough for him to know that this being before him was the most horrifying of them all.</p><br/><p>Even those utmost powerful beings were no match for him.</p><br/><p>At this moment, the Old Master Seven Saint stood up as his eyes burned with a searing blaze, “Damned Lin Fan, you just wait and see! One fine day, I’ll definitely have you pay the price!”</p><br/><p>The Old Master Seven Saint’s hatred was deeply embedded. But, when he remembered the grand plans of his Master, he did not dare to waste any more time as he prepared to continue heading out to scam more beings.</p><br/><p>…</p><br/><p>At this moment, Lin Fan was prepared to leave the Empty Ashes Secret Ground. But all of a sudden, an explosion boomed out as the barrier of the Empty Ashes Secret Ground started exploding. With that, an imposing figure then appeared before Lin Fan.</p><br/><p>That figure was wrapped around with the power of Thunder, and those eyes had thunderbolts cruising through them.</p><br/><p>“Old Master Thunder…!”</p><br/><p>Lin Fan hadn’t expected that the Old Master Thunder would hunt him down here! He had been hiding all his traces the entire time! How in the world did this old fogey manage to track him down here?</p><br/><p>But, when he thought more about it, everything made sense. Seemed like when he met with Chicken Big and Tai Ritian earlier on, he must have been discovered.</p><br/><p>“Old Master Thunder, are you bent on fighting with me with your life like this?” Lin Fan raised his head and looked over.</p><br/><p>“Motherf*cking Human King…!”</p><br/><p>The voice of the Old Master Thunder was hoarse, yet it was filled with a boundless hatred.</p><br/><p>Lin Fan supposedly carried with him many Legendary Items, and was a target that all the utmost powerful beings would wish to kill. But actually, Lin Fan had already smelted all of those Legendary Items by now. There wasn’t even a single scrap left of them.</p><br/>\n</div>"}