{"title": "Chapter 950 - You Can't Do That!", "id": 950, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-950-you-cant-do-that", "volume_title": "Volume 10", "body": "<h1>Chapter 950 - You Can't Do That!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter950youcantdothat\">Chapter 950: You Can’t Do That!</h3><br/><p><strong>Translator:</strong> Lam_ <strong>Editor:</strong> Hitesh_</p><hr/><br/><p>“Let you go? No, that’s not nice, is it? Look at us now! Me throwing you a punch and you returning with a palm strike… Awesome! Let us continue hurting one another!” Lin Fan chuckled out.</p><br/><p>Right now, the Old Master Thunder was already thoroughly captured by Lin Fan. His throat was being choked as his face was pressed against Lin Fan’s chest.</p><br/><p>“LET LOOSE!” The Old Master Thunder wanted to struggle out of this. However, he discovered that the strength of this Motherf*cking Human King was simply way too strong, that he couldn’t break free at all!</p><br/><p>At this moment, the Old Master Thunder raised his bum and struggled to try and retreat. He hadn’t expected that this Motherf*cking Human King would play so dirtily.</p><br/><p>At the same time, the thing that infuriated him the most was that this Motherf*cking Human King was just depending on that undefeatable Physical Body State of his. To think that he would be this despicable!</p><br/><p>“Old Master Thunder, let’s just watch and see what other capabilities you’ve got to break out of this.” Lin Fan sniggered out sinisterly.</p><br/><p>“YOU DOGSH*T…!” The Old Master Thunder took out every last bit of strength he had as though he was sucking milk out of titties as he struggled and pulled back relentlessly.</p><br/><p>But, even if he coiled his entire body with the Power of Thunder, it was all useless.</p><br/><p>How in the world did this Motherf*cking Human King train his Physical Body State to this point? Even if it were the other utmost powerful beings, they definitely wouldn’t be able to withstand this Power of Thunder at point blank!</p><br/><p>But for this Motherf*cking Human King, it did nothing at all! The Old Master Thunder could not help but feel saddened over this fact.</p><br/><p>“Old Master Thunder, look at this. Tell me what it is.” Lin Fan gripped his fist and waved it in front of the Old Master Thunder.</p><br/><p>“Fist.” The Old Master Thunder could not help but reply.</p><br/><p>“You’re wrong. This is a fist that’s as big as a punching bag.” After Lin Fan said that, he punched down once on the face of the Old Master Thunder.</p><br/><p>The force of that single punch was horrifying beyond anything else. The Old Master Thunder could feel as though his entire face was being distorted and wrecked by it right now.</p><br/><p>Blood Bursting Fist of the North Star.</p><br/><p>This was a special fist glove that Lin Fan had created and was invisible when he wore it on his fist. A single punch would cause blood to burst out while three punches would cause an explosion for sure.</p><br/><p>Fresh blood was spraying everywhere right now!</p><br/><p>The Old Master Thunder had never ever thought that his face would be so fragile that it would spray out blood with just a single punch.</p><br/><p>The fresh blood of utmost powerful beings was something far from normal. Every single drop of blood possessed an endless amount of power.</p><br/><p>If it were any normal person who had obtained this, licking a single drop of this blood could have them imploding from within due to the overload of power.</p><br/><p>And, even if it were any other martial artist, a single drop of blood could have them cultivating for a long period of time.</p><br/><p>“Does it hurt?” Right now, Lin Fan was totally on a comeback in the advantaged position. Now that the Old Master Thunder had fallen into his hands, he definitely wanted to beat him up badly.</p><br/><p>This Old Master Thunder had been hunting him down for such a long time now. Each time he appeared, the shadow of the Old Master Thunder would definitely be chasing him from close behind. Now that the other party had fallen into his hands, if he did not let this guy know the feeling of being whacked up, he would definitely take Yours Truly as a pushover!</p><br/><p>“Motherf*cking Human King, let me go! Your ancestor wants to fight you for a good 300 rounds!” The Old Master Thunder yelled out.</p><br/><p>“300 your mother! If I let you go, you will definitely make a break for it, you piece of dogsh*t!” Lin Fan laughed out before punching on the face of the Old Master Thunder once more.</p><br/><p>BAM!</p><br/><p>“ARGH!”</p><br/><p>It was as though the blood of the Old Master Thunder was a part of some buffet as it sprayed out everywhere. For an utmost powerful being, receiving a humiliation as such was something he couldn’t possibly endure.</p><br/><p>“Do you know what’s the name of this fist technique?” Lin Fan asked.</p><br/><p>“Let go of your ancestor!” The Old Master Thunder did not want to know the name or anything else. The only thing he wanted right now was to be released and to take down this Motherf*cking Human King harshly.</p><br/><p>“I’ll tell you… This is the Blood Bursting Fist of the North Star. Do you know what’s the effect of being punched by this three times in a row?” Lin Fan scoffed out.</p><br/><p>“You bloody let go of me right now!” The Old Master Thunder howled out.</p><br/><p>Lin Fan did not reply as he sent yet another punch down.</p><br/><p>BAM!</p><br/><p>An exploding sound boomed out.</p><br/><p>This was the third punch that was hit.</p><br/><p>The face of the Old Master Thunder split right open with flesh and blood flying everywhere. This was a terrible sight to endure. If any other utmost powerful beings were present here, they would definitely have their sh*t scared right out of them.</p><br/><p>This was a bloody utmost powerful being, not some punching bag!</p><br/><p>The anger in the heart of the Old Master Thunder was burning as the Power of Thunder wrapped all around his body.</p><br/><p>Crack, crack, sizzle, sizzle!</p><br/><p>Under the Power of Thunder, the entire void started crackling and exploding. But for Lin Fan, it wasn’t as though it could possibly deal any damage to his physical body at all.</p><br/><p>“Old Master Thunder, do you know what’s the sister punch of the Blood Bursting Fist of the North Star?” Lin Fan asked coldly.</p><br/><p>The Old Master Thunder did not reply. Right now, he was already incensed after being punched by Lin Fan repeatedly. That raised bum of his was swaying left and right up in the air as he tried his hardest to get out of this predicament.</p><br/><p>“I’ll tell you! The sister punch of the Blood Bursting Fist of the North Star is the Boobs Bursting Fist of the North Star.”</p><br/><p>“The first punch.”</p><br/><p>BAM!</p><br/><p>Lin Fan punched out to the left side of the Old Master Thunder’s chest. Momentarily, a sharp pain spiked through him. Unable to endure the pain, the Old Master Thunder cried out in anguish.</p><br/><p>“T-THIS…!!!”</p><br/><p>All of a sudden, the Old Master Thunder discovered that his chest had grown larger! This…!</p><br/><p>“MOTHERF*CKING HUMAN KING! JUST WHAT IN THE WORLD HAVE YOU DONE TO YOUR ANCESTOR…?”</p><br/><p>The Old Master Thunder screamed out at the top of his lungs. He felt that this Motherf*cking Human King was simply way too despicable and shameless!</p><br/><p>“Huehue… This is where the magic of this fist technique lies. The next punch shall be your other chest, alright?” Lin Fan laughed out coldly.</p><br/><p>“STOP THAT, MOTHERF*CKING HUMAN KING! YOU HAD BETTER STOP THAT FOR YOUR ANCESTOR! AS A KING WITH A CULTIVATION OF IMMEMORIAL ANCIENT STATE, HOW CAN YOU STOOP SO LOW TO USE SUCH DESPICABLE MOVES?” The Old Master Thunder bellowed out. As an utmost powerful being, how could he possibly go out into the world with such a body?</p><br/><p>“EH? Old Master Thunder, a single look and one could tell that you evidently have no understanding of the sort of person Yours Truly is. Ever since Yours Truly started off in the Xuanhuang World, the first move I had learned was Monkey Steals Peaches. Do you want to know how the Monkey Steals Peaches goes about?” Lin Fan chuckled out frostily.</p><br/><p>“LET GO OF YOUR ANCESTOR! FIGHT WITH YOUR ANCESTOR FOR A GOOD 300 ROUNDS IF YOU’VE GOT THE GUTS!” The Old Master Thunder was burning in wrath right now as he howled out uncontrollably.</p><br/><p>“Hehe… The second chest!”</p><br/><p>BAM!</p><br/><p>When the punch had landed and the Old Master Thunder realized the state of his chest afterward, he started wailing out once more. He then churned his powers and tried his best to suppress this strange situation that was happening in his body. But to his surprise, nothing would work at all!</p><br/><p>Just what in the world was going on right now?!</p><br/><p>“How now? What are your thoughts on this currently?” Lin Fan chuckled out and asked.</p><br/><p>The Old Master Thunder glared at Lin Fan with a death stare, “YOUR ANCESTOR CANNOT WAIT TO RIP YOU UP INTO SHREDS!”</p><br/><p>Lin Fan shrugged his shoulders, “Don’t sweat it. Given your strength, you wouldn’t be able to even break through the body of Yours Truly, let alone talk about ripping into shreds.”</p><br/><p>The Old Master Thunder looked at Lin Fan with an endless amount of hatred. However, he could not help but admit that the words of the Motherf*cking Human King were right on the spot. He couldn’t even break through the other party’s defenses.</p><br/><p>“Alright! Since I’ve played with you for such a long time now, Yours Truly shall send you on your way then.” Lin Fan said.</p><br/><p>The moment the Old Master Thunder heard these words, his face changed, “YOU WANT TO KILL ME…?”</p><br/><p>“That’s right.”</p><br/><p>“IMPOSSIBLE! YOU WILL NEVER BE ABLE TO KILL YOUR ANCESTOR FOR ALL ETERNITY! YOUR ANCESTOR IS THE ANCESTOR OF THE THUNDER RACE! THUNDER IS ABSOLUTELY INDESTRUCTIBLE! JUST SOMEONE LIKE YOU AND YOU THINK THAT YOU CAN DO IT…?” The Old Master Thunder mocked out.</p><br/><p>“Past life, slay.”</p><br/><p>Instantly, the face of the Old Master Thunder lost all its color, “Y-you…!”</p><br/><p>“Don’t get anxious now. This is just the Triple Lifetime Reincarnation Sutra of the Ancestral Buddha, that’s all. I’ll just slay all three of your lifetimes so that you can’t even reincarnate.” Lin Fan replied in a composed manner.</p><br/><p>“NO! WAIT! YOU CAN’T DO THAT!” At this moment, the Old Master Thunder panicked. He hadn’t expected that the Motherf*cking Human King would actually know of this mystic skill!</p><br/><p>“Hehe…!”</p><br/><p>…</p><br/>\n</div>"}