{"title": "Chapter 955 - Plentiful Rewards", "id": 955, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-955-plentiful-rewards", "volume_title": "Volume 10", "body": "<h1>Chapter 955 - Plentiful Rewards</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 955: Plentiful Rewards</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>“Old Master Water Dragon, Drought Demonic God… what are you guys hurrying for? Let us have a good talk, shall we?” Lin Fan floated in front of these two pieces of bloodied meat and smiled out.</p><br/><p>To think that there were two that were still alive! This wasn’t a waste of his efforts after all!</p><br/><p>Old Master Thunder, you haven’t sacrificed your life for nothing now! Actions speak louder than words. With this, you’ve proven that you’re way stronger than anyone else!”</p><br/><p>To be able to f*ck over six utmost powerful beings with a single self destruction… Now that was indeed extremely formidable!</p><br/><p>The moment they heard this voice, the Old Master Water Dragon and the Drought Demonic God were both stunned. That was followed by a tragic wail.</p><br/><p>“Oh, Motherf*cking Human King! The both of us have no grudges with one another! Please spare us!” The Old Master Water Dragon begged out, “All of this was the idea of the Old Master Thunder! This has nothing to do with us!”</p><br/><p>“I am a Demonic God of the Ancient race! You mustn’t kill me! As long as you let me off, I can let bygones be bygones!” The Drought Demonic God begged as well.</p><br/><p>He hadn’t expected that this would be his eventual outcome. Had he known that this would be the case, he wouldn’t have come here even if someone threatened him with his life!</p><br/><p>Everything… Every single thing… was the fault of that Old Master Thunder!</p><br/><p>“Hais! How sad!” Lin Fan spread open his palms and grabbed the two pieces of bloodied meat in his hands. These two pieces were all that remained of those two utmost powerful beings.</p><br/><p>Even a normal being would be able to kill the both of them right now. That was enough to tell how devastating that explosion from earlier on was.</p><br/><p>For an utmost powerful being to be blown into such a state, even if it were Lin Fan’s Immemorial Ancient full cultivation state physical body, he might not have been able to hold out either.</p><br/><p>Right now, the Old Master Water Dragon and the Drought Demonic God had zero ability to fight back at all. They understood clearly that their lives and deaths were in the hands of this Motherf*cking Human King.</p><br/><p>If they wanted to live, the only way out was to talk things through with the Motherf*cking Human King. But, looking at the current situation, that didn’t seem like it would be easy.</p><br/><p>“Motherf<em>cking Human King, just what in the world do you want?” The Old Master Water Dragon was feeling an immense hatred in his heart. Back in the past, he was always high and mighty up above everyone else. Yet, to think that he would fall into the hands of this Motherf</em>cking Human King. How could the Old Master Water Dragon possibly endure this?</p><br/><p>“Oh? I don’t want anything much… just your lives, that’s all.” Lin Fan laughed out merrily. That smile of his looked ever so sinister right now.</p><br/><p>“Motherf*cking Human King, let me go! I’m willing to give you an endless amount of wealth and all the power you can possibly crave for!” The Drought Demonic God truly did not wish to die. He hadn’t lived long enough just yet! He still wanted to transcend!</p><br/><p>Slosh!</p><br/><p>The moment the Drought Demonic God spoke up, Lin Fan squeezed his palm and turned his remaining self into dust.</p><br/><p>‘Ding… Congratulations on killing Drought Demonic God.’</p><br/><p>‘Ding… Cultivation State leveled up.’</p><br/><p>‘Cultivation State: Immemorial Ancient state upper level.’</p><br/><p>At that moment, Lin Fan could feel a tremendous surge of power that was rumbling out within his body. This was the feeling of being invincible.</p><br/><p>Now that his cultivation state had been raised, he was feeling extremely exhilarated.</p><br/><p>However, the amount of experience points he required to level up from Immemorial Ancient state upper level to full cultivation state was as vast as the ocean.</p><br/><p>“You…!” When the Old Master Water Dragon caught sight of how this Motherf*cking Human King had killed the Drought Demonic God, his tone was filled with fright. He then started pleading, “Please! I’m begging you! As long as you don’t kill me… Just don’t kill me!”</p><br/><p>“Back when you guys decided to pit yourself against Yours Truly, your fates had already been determined. All of you shall do nothing but aid Yours Truly in reaching my pinnacle state.” Lin Fan laughed out coldly before using some slight strength.</p><br/><p>BAM!</p><br/><p>The consciousness of the Old Master Water Dragon was destroyed. From this day forth, there would no longer be the existence of the Old Master Water Dragon anywhere in this world.</p><br/><p>‘Ding… Congratulations on killing Old Master Water Dragon.’</p><br/><p>‘Ding… Experience Points +…’</p><br/><p>That amount of experience points instantly allowed that vast quota of experience points to be filled up slightly with a bolus. However, there was still quite a bit of distance from reaching that full cultivation state.</p><br/><p>But for Lin Fan, none of this mattered. Full cultivation state was something that would eventually come to him. It shouldn’t be long before he would be there.</p><br/><p>The only thing that had him slightly disappointed was the fact that the Old Master Water Dragon and the Drought Demonic God both did not pop out any items either. Evidently, they must have also used all of their Legendary Items to try and defend against the self destruction of the Old Master Thunder, thus causing everything to evaporate into dust.</p><br/><p>There wasn’t even a single martial arts mystic skill that could be obtained from them! That was an extreme pity.</p><br/><p>“There are still two other utmost powerful beings left. I wonder if they’re still alive.”</p><br/><p>Lin Fan continued searching. However, to his disappointment, even after searching for an entire round, he still could not find any remnants of the meat and flesh of those two utmost powerful beings.</p><br/><p>EH!?</p><br/><p>Just as Lin Fan was wallowing in his disappointment, he caught sight of a red light up ahead that attracted his attention.</p><br/><p>Pshew!</p><br/><p>But when Lin Fan bolted over, he could not help but be filled with regrets.</p><br/><p>“Seems like I was too late again. To think that this Lucifer would have just died like that.” This bloodied meat here belonged to Lucifer. However, even this utmost powerful being did not manage to hold out.</p><br/><p>Lin Fan went to search around once more, and when he eventually reached a dead corner, he found the flesh and meat of the Extreme Heavens Demonic God.</p><br/><p>But, the latter had passed away as well, without any bit of aura left in him. This was something that had Lin Fan really crestfallen. But, on the whole, this plot that he had deployed this time around did not cause him a total loss.</p><br/><p>Being able to kill three utmost powerful beings directly and raising his cultivation state to upper level state meant that he wasn’t too far off the full cultivation state right now.</p><br/><p>As long as he were to continue working hard, it shouldn’t be much of an issue for him to level up to the full cultivation state.</p><br/><p>Lin Fan looked at the nothingness in the void around him and shook his head, “To think that I would cause everything to be wrecked as such in a moment of carelessness. This is pretty pitiful as well.”</p><br/><p>Without any hesitation, he dove right into the void and headed off into the distance. But, what Lin Fan did not know was that after he left, there were a pair of frightful eyes observing everything that was happening in horror.</p><br/><p>When the Seven Saint Old Dog had caught sight of everything, he had long been scared till he was almost pissing on himself.</p><br/><p>He hadn’t expected this Motherf*cking Human King to have this much of an impact that he could scam and kill so many utmost powerful beings!</p><br/><p>This was way too sick!</p><br/><p>Initially, he had wanted to pit himself against Lin Fan till the very end. But right now, Seven Saint Old Dog swore that before he was done with accomplishing the major affairs of his Master, he would not risk his life to fight this crafty Motherf*cking Human King.</p><br/><p>Even though Seven Saint Old Dog had bowed down to that mysterious person, he wasn’t someone who could possibly stand being the dog of someone else just like that. He was hatching a plot of his own and waiting for the very last moment to descend.</p><br/><p>All seven utmost powerful beings here had fallen.</p><br/><p>Even though news of this had not spread out, many of the Demonic Gods of the Ancient race could already feel that the Drought Demonic God and the Extreme Heavens Demonic God had fallen.</p><br/><p>In the hearts of all the Demonic Gods and utmost powerful beings, a sense of seriousness was bubbling quietly. This was the most severe event that had happened in the countless of eras so far.</p><br/><p>…</p><br/><p>And at this moment, Lin Fan was just traversing across the void. After all, that place no longer had any reason for him to linger behind.</p><br/><p>He could feel that his current strength was already enough for him to fight it out against many of those utmost powerful beings.</p><br/><p>His consistent hiding had allowed those utmost powerful beings to assume that he was a pushover to be bullied. And right now, Lin Fan felt that it was about time for him to display his true strength and suppress everything so that those utmost powerful beings could understand that he was no weakling.</p><br/><p>As for the Humans back in the Xuanhuang World, there had been many geniuses who had been produced by this time. However, it wasn’t something easy if he wanted to allow those geniuses to reach a Divine celestial level 10, Eternal God state in just the Xuanhuang World alone.</p><br/><p>For that to happen, the Human race had to be established. They needed to have a firm footing in this world here.</p><br/><p>And just as Lin Fan was contemplating about all these things, an aura far in the distance attracted his attention.</p><br/><p>This aura… Didn’t it belong to that cheap Master of his?</p><br/><p>Lam_ Lam_ HAHAHA. It’s been a long time. And to be honest, Feng Qingzi did treat Lin Fan pretty nicely. Lets see where the plot moves to this time round. Cheers!</p><br/>\n</div>"}