{"title": "Chapter 978 - The Journey Is About To Begin", "id": 978, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-978-the-journey-is-about-to-begin", "volume_title": "Volume 10", "body": "<h1>Chapter 978 - The Journey Is About To Begin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Elder! H-he…! He…!” The disciples of the Heaven and Earth Sect were all stunned silly right now. Just what in the world was this situation? Their elder was a True Immortal state powerful being! How could he lose to a single young man?</p><br/><p>Qing Yangzi was just standing there. Even though his expression was calm, he felt as though he had lost all hope in life. That old face of his stung a little as though he had just been slapped thoroughly left and right.</p><br/><p>To think that given his strength as a True Immortal state lower level being, he would actually be defeated by some lad of Immemorial Ancient state upper level.</p><br/><p>If word of this were to get out, how much face would he lose because of it?</p><br/><p>And, that was even before considering the fact that this place here was swarmed with people right now. His defeat had been witnessed by countless of people.</p><br/><p>All of the spectating commoners yelped out in shock.</p><br/><p>“That old bigshot of the sect has actually lost to the Young Master of the Lin Family? This is way too explosive of an affair!”</p><br/><p>“Just what sort of strength does that Young Master of the Lin Family possess?! How could he possibly be this strong?”</p><br/><p>“That move from earlier on was way too tyrannical! Using his hands as a sword, he just slammed it down straight on the head of that old bigshot of the sect!”</p><br/><p>“By the looks of it, this is going to be the uprising of the Lin Family right now. With a strength of that level, who in the world would still dare to go against the Lin Family in the future?”</p><br/><p>“I heard that the Family Heads of the other seven great families had gone to the Lin Family yesterday to propose for marriage. Even though I don’t know what the general outcome of that was, it is pretty evident that those seven Family Heads are just trying to pull some connections with the Lin Family.”</p><br/><p>“I heard that all of them were rejected by the Young Master of the Lin Family. After all, this Young Master Lin is someone who is going to be the disciple of a major sect. By that time, the girls he comes into contact with would definitely be those of a breathtaking and ravishing caliber. They are not people that these daughters of the seven great families could hope to compete against!”</p><br/><p>…</p><br/><p>“Elder, he…!”</p><br/><p>Qing Yangzi waved it off with his hand. Although this was a little embarrassing, a loss was a loss. There was nothing more to be said of it. Instead, he actually felt a small sense of excitement.</p><br/><p>As the elder in charge of recruitment for the sect, Qing Yangzi had recruited countless disciples in the past dozens of years. Back in the past, Qing Yangzi had managed to dig out a Lie Qingtian. However, that man was someone who was extremely pragmatic. He used the Heaven and Earth Sect as a stepping board and entered the number one sect of the nine great righteous sects back then, the Panic Sect.</p><br/><p>That had caused the Heaven and Earth Sect to be the butt of all sorts of jokes.</p><br/><p>And now that he had managed to uncover a disciple as such in the Rising Dragon City, Qing Yangzi knew that this lad was in no way weaker than Lie Qingtian. In fact, he might even be a step above the latter.</p><br/><p>“This young lad is a supreme paragon, and surpasses even that Lie Qingtian. The fact that he’s able to be discovered by me must be due to good fortune that I’ve accumulated over several lifetimes.” Qing Yangzi remarked in excitement.</p><br/><p>When the surrounding disciples heard how high their elder’s evaluation of this young man was, all of them were stunned.</p><br/><p>Stronger than Lie Qingtian? What sort of an idea was that?</p><br/><p>That was something that they did not even dare to imagine any further.</p><br/><p>Lin Family…</p><br/><p>Right now, Lin Fan was being surrounded by the masses.</p><br/><p>“My son! That was simply way too incredible! Even I have difficulty believing that I could give birth to such an incredibly amazing son! Hurry up and tell your father… Are you truly my son?” Lin Haoming was so ecstatic he was dancing with his hands up in the air. At this moment, he felt as though he could practically fly up into the heavens.</p><br/><p>Right now, Lin Fan was really exasperated. He truly wanted to reply with a, “Yes, you’re right. I’m not your son.”</p><br/><p>However, he decided to shrug off that idea.</p><br/><p>Even if he said that, no one would believe him.</p><br/><p>As for this fella, he was quite the decent man to be honest. Well, that would suffice to give him the rights to relish in this self pride for now.</p><br/><p>“Tomorrow, I’ll be leaving the Lin Family. You guys…” No matter what, Lin Fan had lived here for a full eleven years. Now that he was about to leave so suddenly, he naturally had to console all of them.</p><br/><p>But before Lin Fan was even done with his sentence, Lin Haoming spoke up.</p><br/><p>“Oh, my son! You are like the mythical dragons of the skies! The Rising Dragon City isn’t enough to accommodate someone like you! Once you enter the sect, you must definitely work hard to get a good seventeen or eighteen beautiful fairies. Then, you can come and bring us glory, filling up our halls with future descendants!”</p><br/><p>“Don’t worry now! With me around, the Lin Family will definitely be able to pull through this period of time! Just remember to visit us often in the future!” Lin Haoming said in exhilaration.</p><br/><p>Alright, there was truly nothing that Lin Fan had to say anymore.</p><br/><p>“Big Brother! Lan’er can’t bear to see you go…!” Lin Lan’er ran into Lin Fan’s embrace and hugged him while saying sadly.</p><br/><p>Lin Fan fondled her head and replied, “I’ll return to visit you guys often.”</p><br/><p>“Little Brother, good luck!” Lin Hanyu and Lin Feixue cheered their younger brother on.</p><br/><p>Mrs. Lin was extremely reluctant as well. However, she knew that the fact that the Lin Family could produce such a prodigy was the fortune of the entire Lin Family.</p><br/><p>If she were to insist for him to stay in this tiny little Rising Dragon City, she would definitely be scolded to death by the ghosts of the Ancestors of the family.</p><br/><p>“Yes, you guys, don’t worry! I’ll definitely return.” Lin Fan replied.</p><br/><p>…</p><br/><p>This duel of Lin Fan suppressing the old bigshot of the sect had the seven Family Heads totally shocked silly.</p><br/><p>Initially, they had already thought that the Young Master of the Lin Family was incredible enough. But, it was only now that they realized he wasn’t incredible at all. He was just heaven revolting!</p><br/><p>That was an old bigshot of a sect… and an elder to boot!</p><br/><p>If the Young Master Lin was already this strong right now, how would things be like after he entered a sect?</p><br/><p>This was a deep remorse they were feeling right now.</p><br/><p>Had they known that this would be the case, they would have insisted on the Young Master Lin taking in their daughters even if they had to kneel down for it. Gosh, even if it were just a wife in name, that would do.</p><br/><p>But, it was a pity. It was far too late for all of this by now.</p><br/><p>To think that such a great affinity would have slipped off their hands just like that. This was a bucket full of regrets they had to carry now.</p><br/><p>…</p><br/><p>The next day…</p><br/><p>The Lin Family was decorated with lanterns and colored banners as though there was some joyous occasion going on. The band at the doorsteps was playing music as well.</p><br/><p>From top to bottom, the entire Lin Family, from their Family Head down to the servants, heck, even the family pets, were brought into the sending off ceremony.</p><br/><p>Countless of commoners gathered over; they were here to take a look at the Young Master Lin.</p><br/><p>This was the most remarkable prodigy that was ever produced in the history of the Rising Dragon City.</p><br/><p>Standing in the middle of the courtyard, Lin Fan raised his head and looked at the void.</p><br/><p>At this moment, there was a Battle Ark floating up in the void silently. Even though this Battle Ark wasn’t really huge or anything, it was extremely awe-inspiring. A single look was enough to tell that it was no normal object.</p><br/><p>Qing Yangzi stood on the Battle Ark and looked down at Lin Fan below with an appreciative expression. This was a supreme paragon that he had discovered, and could be considered as the most glorious moment in the entirety of his career.</p><br/><p>As long as there were no accidents, it was definite that this lad would one day become a supreme powerful being who could shake the entire world under his feet. As for him, Qing Yangzi, he would then be known in the texts of history as the one who had uncovered this supreme powerful being.</p><br/><p>The moment he thought of that, Qing Yangzi felt some tingles of excitement.</p><br/><p>Lin Fan looked around at the masses before nodding his head eventually, and his body started floating towards the sky.</p><br/><p>“Young Master, remember to come back and visit us!” The servants shouted out.</p><br/><p>“Big Brother, remember to think of me!”</p><br/><p>“Little Brother, have a safe trip!”</p><br/><p>“My son… Remember to work hard and bring back seventeen to eighteen wives for our family!”</p><br/><p>The surrounding commoners erupted out in cheers as well.</p><br/><p>When he arrived at the Battle Ark, Lin Fan nodded his head towards Qing Yangzi and the others. He then looked down below and surveyed the entire Rising Dragon City beneath his feet.</p><br/><p>Qing Yangzi came to his side and said, “Don’t worry! I’ve already implanted the Imprint of the Heaven and Earth Sect into this part of the world here. No matter which sect it is, they will know that this is part of the Heaven and Earth Sect’s territory. There will be nothing that will happen to this place.”</p><br/><p>“And, if anything does happen to this place?” Lin Fan asked calmly.</p><br/><p>“Then they shall have to withstand the endless fury and wrath of the entire Heaven and Earth Sect. The Heaven and Earth Sect places an unparalleled importance to the families of our disciples. We will definitely not allow them to suffer any harm at all.” Qing Yangzi replied.</p><br/><p>“Alright, let us leave then! Time to see just what this Heaven and Earth Sect is like.” Lin Fan peered out into that vast and endless world before him.</p><br/><p>Right now, this was the true beginning of his journey.</p></div>\n</div>"}