{"title": "Chapter 976 - That's Not Enough From You", "id": 976, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-976-thats-not-enough-from-you", "volume_title": "Volume 10", "body": "<h1>Chapter 976 - That's Not Enough From You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 976: That’s Not Enough From You Translator: Lam_ Editor: Hitesh_</p><br/><p>The restaurants surrounding the Sparring Arena were suffering from overcrowding right now.</p><br/><p>“The A-class seats that are near the wooden railings… There is only a single seat left! Who wants it?” The attendant of the restaurant shouted out.</p><br/><p>“Me! I want it!”</p><br/><p>“None of you snatch it from me! I want it!”</p><br/><p>“Bloody hell! Do you guys have more money than me to snatch it from me? Attendant, give it to me!”</p><br/><p>This time around, the duel was unprecedently grand. As such, all the surrounding restaurants were all filled to the max.</p><br/><p>This was especially the case for the seats on the top floors of the restaurants. These were seats that one could barely purchase even with all t the riches.</p><br/><p>On the streets, many vagrant martial artists were squeezing through the crowd with their lives as well.</p><br/><p>“Hurry up and find a good spot! Otherwise, we’ll miss out on watching it!”</p><br/><p>“The duel this time around is simply way too grand! The Young Master of the Lin Family fighting with an old bigshot of a sect? This is a rare sight that hardly happens even in a hundred years!”</p><br/><p>“That’s right! The rumors had it that the Young Master of the Lin Family was some trash cripple. But, who knows when he had turned so powerful!”</p><br/><p>“Hue! All of you have been fooled! The Young Master of the Lin Family is an unrivaled talent whose innate potential is tremendous. It’s only because he was way too low profile that he was mistaken by others!”</p><br/><p>“Oh, so that’s the case. Those people who were spreading these false rumors are really too detestable!”</p><br/><p>…</p><br/><p>On the Sparring Arena…</p><br/><p>Qing Yangzi stood there with his eyes gently shut. For someone from this small Rising Dragon City to challenge him to a duel, this was something that he could have rejected completely.</p><br/><p>But, the young lad that had requested for the duel had him feeling extremely curious about it. He did want to see just what the young lad could do.</p><br/><p>It was easy to seek out people with fortitude. But, to seek out the young ones with an unrivaled potential? That was something extremely difficult.</p><br/><p>As the elder who was in charge of recruiting disciples for the sect, there was a need to inject only the purest of blood into the sect.</p><br/><p>If he were able to find a disciple of this sort here in the Rising Dragon City, it would be easy for him to account for matters after heading back into the sect.</p><br/><p>After all, even 10,000 ordinary disciples could not amount to a single genius disciple.</p><br/><p>On the Viewing Platform…</p><br/><p>“Why would elder agree to duel with that brat?” One of the junior brothers said out in a huff.</p><br/><p>“I feel that the young man is pretty decent. If he were to join our sect with us, I think that would be awesome.” A female disciple chuckled out.</p><br/><p>As for that square-faced disciple, he spoke up as well, “That young man has an extraordinary strength. Just look at that Sword Will that he displayed that day… Even within our sect, there are only a few who can match up to something like that. I’m sure elder is just someone who knows how to appreciate talents.”</p><br/><p>“Since that young man wishes to have a duel with the elder, the reason why the elder agreed to it must naturally be to sniff out the foundations of this young man.”</p><br/><p>“But senior brother, isn’t that brat a little too brazen? Our Heaven and Earth Sect is one of the nine great righteous sects. Do you think he has the right to choose us?” A disciple said out in indignance.</p><br/><p>“Huehue… Have you forgotten about Lie Qingtian?”</p><br/><p>The moment that disciple heard that name, his face changed slightly. He then rebutted, “But, how could that be? That Lie Qingtian is an unrivaled prodigy. Naturally, that guy has the right to choose between the sects.”</p><br/><p>“Even though you may be right, now is the time to check out whether this young man has the same capabilities as that Lie Qingtian.”</p><br/><p>“Eh, that person is here.”</p><br/><p>At this moment, Lin Fan walked over carefreely. Behind him, Lin Haoming had brought along servants with crash cymbals and drums to hype up the place and boost the former’s morale.</p><br/><p>Seeing this situation, Lin Fan was completely helpless. He honestly could not help but feel that every person within this Lin Family was more of a clown than the other.</p><br/><p>“Oh, son! You must give it your best later on, alright? I’d say, look at that old man. He looks pretty old. Therefore, his stamina will definitely not be able to keep up with yours. Let’s just play for time and waste his energy, alright?” Lin Haoming remarked.</p><br/><p>Lin Fan shook his head. By the time they were at this cultivation state, age played no role at all.</p><br/><p>For someone of Yang Qingzi’s cultivation state, if he wanted to turn young once more, it was something he could do with just a single thought.</p><br/><p>“Big Brother, good luck!” Lin Lan’er cheered him on.</p><br/><p>“Little Brother, if you really cannot hold out later on, don’t force yourself!” Lin Hanyu said.</p><br/><p>“Daughter, how could you imply that your younger brother can’t beat that old man?” Lin Haoming said.</p><br/><p>“I just don’t want my Little Brother to get hurt!” Lin Hanyu said sadly.</p><br/><p>…</p><br/><p>By the time Lin Fan arrived at the scene, the atmosphere surrounding him had already reached its climax. Everyone from the seven great families was here to spectate.</p><br/><p>This was a duel that was far from ordinary, and not to be underestimated.</p><br/><p>Within the Huang Family, when Huang Tailong caught sight of that figure, his face revealed traces of fear. But for the most part, it was plain exasperation.</p><br/><p>Regarding things like revenge and whatnot, Huang Tailong did not dare to think about it anymore.</p><br/><p>He could only chant silently in his heart.</p><br/><p>“Lin Fan, you must definitely lose!”</p><br/><p>…</p><br/><p>“Lad, this old man here will not go any further than necessary. You do not have to worry.” Qing Yangzi said in a casual manner.</p><br/><p>“Oh.” Lin Fan nodded his head, although he was pretty unbothered by it.</p><br/><p>When Qing Yangzi pointed out with his finger, the entire space around him got sealed up instantly. This was to prevent their powers from being leaked out and causing innocents to be injured.</p><br/><p>“We can start now. Strike at me then.” Qing Yangzi said.</p><br/><p>But at this moment, Lin Fan was still contemplating.</p><br/><p>For the duel this time around, he should hold back on some of his moves. The main point was to test out the strength of a True Immortal state being.</p><br/><p>As for the Nine Five Legendary Brick, Twisting Heaven and Earth, and whatnot, there was no need to deploy them at all. This wasn’t a life and death duel. It would be better for him to keep some tricks up his sleeves.</p><br/><p>Shing!</p><br/><p>At this moment, Lin Fan’s aura started to change. That initially stable aura of his started to expand out.</p><br/><p>When Qing Yangzi felt this aura, his eyes shone with a weird expression as well.</p><br/><p>He was observing Lin Fan with extreme scrutiny; every single change of this lad was being evaluated by him right now.</p><br/><p>“What a strong aura…!” The square-faced disciple let out a look of shock.</p><br/><p>All of a sudden, something changed at the arena.</p><br/><p>In a flash, Lin Fan sent a punch flying out towards Yang Qingzi. The momentum of his punch was explosive as it ripped through the entire void.</p><br/><p>Qing Yangzi stood on the ground as his robes fluttered. He frowned as his heart skipped a beat. This strength was too formidable! Wasn’t this lad a sword user?</p><br/><p>To think that even his melee fighting strength would be this strong as well!</p><br/><p>Composed and calm, Qing Yangzi stretched out his palm and received Lin Fan’s fist.</p><br/><p>“This fist of yours…” Just as Qing Yangzi wanted to give some opinion about that fist, his face changed slightly all of a sudden. He could sense that there was a power contained within the fist that seemed like a wild beast that was awakening.</p><br/><p>A boundless power was bursting forth from the depths of that fist.</p><br/><p>“Old man, you had better show some true skills. Otherwise, you’re going to have to lie down on the ground.” Lin Fan roared out with an unrivaled fighting prowess as the Source of Power gushed out.</p><br/><p>This was a punch that possessed momentum on two different layers.</p><br/><p>And, this second layer of momentum was none other than the existence of the Source of Power.</p><br/><p>Even though Lin Fan’s cultivation state was at Immemorial Ancient state upper level, he could take down powerful beings of Immemorial Ancient full cultivation state. And, while this Qing Yangzi was someone of True Immortal state lower level, Lin Fan had the confidence of going head-on against him.</p><br/><p>BAM!</p><br/><p>Qing Yangzi stumbled back for a few steps. Every single step he retraced caused the golden tiles on the ground to explode out wildly.</p><br/><p>By the time he was at his third step, Qing Yangzi’s body convulsed momentarily. An aura that was akin to that of a sharp blade burst forth from the back of his body before slamming out at the barrier. It was only then that Lin Fan’s powers were fully dissipated.</p><br/><p>“Good lad! Just that move of yours is enough reason to suffice bringing you into the Heaven and Earth Sect as a disciple!” Qing Yangzi could not help but get serious at this moment. The amount of surprises brought forth to him by this lad was way too much.</p><br/><p>“But old man, if you want to pull me into the sect with just this strength that you’re displaying right now, that is still too far from enough.” Lin Fan chuckled out.</p><br/><p>As for the disciples on the Viewing Platform, all of them were astounded.</p><br/><p>“What? That brat was able to push our elder back by three steps?”</p><br/><p>The masses were watching with open jaws as they felt the incredulity of this situation.</p><br/><p>“Bravo, Big Brother!” Lin Lan’er cheered out with her cheeks flushed red.</p><br/>\n</div>"}