{"title": "Chapter 984 - Do You Think You're Number One?", "id": 984, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-984-do-you-think-youre-number-one", "volume_title": "Volume 10", "body": "<h1>Chapter 984 - Do You Think You're Number One?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 984: Do You Think You’re Number One?</p><br/><p>Translator: Lam_ Editor: Hitesh_</p><br/><p>Hu Qing was still suffering from some lingering trepidations. He felt that he had truly been way too careless. If not for the fact that Junior Brother Lin had stepped in earlier on, he would have lost that little life of his in the hands of these Earth Demons for sure.</p><br/><p>“My thanks, Junior Brother Lin.” Ever since he had tested out Lin Fan’s strength, Hu Qing had never once belittled the former. And now that there was this lifesaving grace of his, Hu Qing was naturally immensely grateful.</p><br/><p>“It’s nothing. Since we’re a party, we’ve got to help out one another.” Lin Fan said.</p><br/><p>“This is the core of that leader of those Earth Demons. By all reasoning, this should belong to Junior Brother Lin.” Su Hongchen dug out the core of that Earth Demon leader.</p><br/><p>Back in the sect, this core can be used to exchange for quite a significant amount of Contribution Points.</p><br/><p>“Keep it and we’ll split it fairly later on.” Lin Fan replied.</p><br/><p>Lin Fan had no use for stuff like this. For Lin Fan, the most practical thing to take note of was to kill as many Earth Demons as he could right now.</p><br/><p>And not only that, it had to be those Earth Demons with the strongest strength. Only those types of Earth Demons could provide him with a continuous stream of experience points.</p><br/><p>Lin Fan’s actions naturally curried favor with everyone around. A party mate as such was someone that everyone would love to be with.</p><br/><p>“Even though these Earth Demons are not too strong, their cores should be worth some Contribution Points as well. We can’t let them go to waste now.” Su Hongchen dug up the cores of those other fallen Earth Demons.</p><br/><p>…</p><br/><p>For the next few days, Lin Fan and the others had been slaying Earth Demons within this Earth Abyssal Demon Cave.</p><br/><p>As a result, the cores that they had obtained were numerous. However, to Lin Fan’s disappointment, even the highest cultivation state of the Earth Demons they had encountered was only Immemorial Ancient state upper level.</p><br/><p>Lin Fan truly wanted to kill down to the deeper levels. However, when he considered that Su Hongchen and the others were with him, he gave up on that thought.</p><br/><p>After heading back this time around, Lin Fan had the intentions of heading over alone the next time.</p><br/><p>The deeper they got, the more the surroundings around them started changing.</p><br/><p>There were more corpses lying all over the place.</p><br/><p>Some of the corpses were from long ago while others could not have been there for that long. At best, they ended up here only recently.</p><br/><p>“Such a thick Demonic Qi!”</p><br/><p>At this moment, Su Hongchen’s brows furrowed as she could sense that the Demonic Qi here was truly detestable.</p><br/><p>Hu Qing and the others were equally surprised. They too had felt this Demonic Qi here. And not only that, the Demonic Qi was extremely vile compared to anything else. There was even a trace of Essence Blood that could be sensed in it.</p><br/><p>“Someone is cultivating here.” Ru Wanshu remarked.</p><br/><p>Lin Fan raised his finger, “This Demonic Qi should be coming over from that place over there.”</p><br/><p>Everyone exchanged glances, “Shall we head over to check it out?”</p><br/><p>Lin Fan was lacking powerful beings to kill right now; therefore, he immediately nodded his head, “We can try.”</p><br/><p>These few people then hid their auras and slowly inched closer before hiding behind some boulders.</p><br/><p>“They are not cultivating some demonic skills, just cultivating their treasures.” Su Hongchen said.</p><br/><p>When Lin Fan caught sight of the situation ahead, his interest was piqued slightly. Above a pool of blood was a young man who looked extremely devilish. Beside him was a blood red saber floating around him.</p><br/><p>There were a few blood red threads that extended out of the red saber. These blood threads seeped into the pool of blood and sucked out the Essence Blood within.</p><br/><p>As for the Earth Demons around, they were lying with their stomachs propped up. When they opened their mouths, an endless amount of Essence Blood sprayed out.</p><br/><p>“That’s a disciple of the Blood Demon Sect. Cultivating their weapons with Essence Blood, that is a technique that only the Blood Demon Sect employs.” Su Hongchen commented.</p><br/><p>The Blood Demon Sect was a Demonic Sect, and was one of the nine great righteous sects as well.</p><br/><p>“Who’s there?”</p><br/><p>All of a sudden, that disciple of the Blood Demon Sect jerked his eyes wide open and spat out a mouthful of Blood Qi that turned into a blood red streak of light, crushing the boulder they were hiding behind.</p><br/><p>“Hmph! Here I was wondering who it was. Seems like it’s the disciples of the Heaven and Earth Sect.” That young man stood up as his eyes shone with a demonic gaze. There was a bone chilling feeling about him.</p><br/><p>“Number sixty seven on the True Immortal Substitute Roll, Xue Tianzi!” At this moment, Hu Qing recognized who this person before him was.</p><br/><p>That long robe he was wearing which was red as blood, and that demonic gaze of his… This was a powerful being on the True Immortal Substitute Roll!</p><br/><p>“Go, hurry and go! We’re not his match!” Hu Qing exclaimed out and dragged everyone along with him. For someone to be able to get on the True Immortal Substitute Roll, they must definitely be a powerful being.</p><br/><p>This wasn’t an existence they could deal with!</p><br/><p>“HAHA! Since you’re here, why not stay here? What are you guys trying to leave for?” Xue Tianzi laughed out as the sky vibrated. A series of blood red banners sealed up the entire sky and blocked off everyone’s escape path.</p><br/><p>Back in the past, Lin Fan did not know what the True Immortal Substitute Roll was. But, he now knew clearly.</p><br/><p>This roll was the ranking of all the Immemorial Ancient state beings that had yet to enter the True Immortal state. Those who are able to have their names on the substitute roll were basically Immemorial Ancient state full cultivation state beings.</p><br/><p>But, even then, only paragons would be able to make it into the top 100 of the list with just an Immemorial Ancient state upper level.</p><br/><p>Since this Xue Tianzi was able to rank sixty seven, his strength must be stronger than most others for sure.</p><br/><p>Even though the cultivation state of Hu Qing and the others was pretty decent, compared to those on the True Immortal Substitute Roll, they were still too far off… way too far off.</p><br/><p>Thus, it was no wonder that they would have to make a run for it upon meeting someone from the True Immortal Substitute Roll.</p><br/><p>“This Scarlet Blood Demon Saber of mine is just short of that bit of Essence Blood to be upgraded to a Supreme Grade Utmost Treasure. Since you guys are here, then you shall contribute your Essence Bloods for Your Tianzi here!” Xue Tianzi was someone of the Demonic Sect after all, and they leaned heavily towards killing.</p><br/><p>Since Lin Fan and the others had ventured here, he would naturally not let them off.</p><br/><p>“Not good! Xue Tianzi’s killing intent towards us has been activated!” Bing Linxing’s face was pale with fright.</p><br/><p>“Xue Tianzi! We are Inner Sect disciples of the Heaven and Earth Sect! If you dare to kill us, the Heaven and Earth Sect will definitely not let you off!” Hu Qing warned harshly.</p><br/><p>“Hehe… Let me off? Well, have your Grandmaster make a trip over to the Blood Demon Sect then.” Xue Tianzi roared out in laughter as he gripped that Scarlet Blood Demon Saber of his.</p><br/><p>With that, a torrential sea of blood surged up from behind his body.</p><br/><p>“Hundred Weapons Breaking Formation!”</p><br/><p>At this moment, Bing Linxing roared out as a bedazzling gleam of light shone out from his body. Countless weapons flew out of it and formed up a Weapon Spirit.</p><br/><p>The figure of this Weapon Spirit was immensely huge. When he slashed out, the entire world shook along with it.</p><br/><p>“Insignificant tricks!”</p><br/><p>Xue Tianzi scoffed coldly as he sliced out with the saber in his hands. A blood shade tore through the firmaments. This Scarlet Blood Demon Saber brought out an endless streak of blood red light; it was so sharp that even the void shattered in its presence.</p><br/><p>Creak.</p><br/><p>The Weapon Spirit crumbled without even having a chance to fight back at all.</p><br/><p>Despite that, the speed of the Scarlet Blood Demon Saber did not diminish in the least bit! In fact, it got even faster!</p><br/><p>“Not good…!” The faces of the group were stunned. Ru Wanshu even spat out a mouthful of his Essence Blood, hoping that the blood could draw in the righteous powers of the Heaven and Earth.</p><br/><p>But, in the face of this weapon that was about to turn into a Supreme Grade Utmost Treasure, all efforts were futile.</p><br/><p>“Everyone, I’m afraid that we’ll all have to fall here!” Hu Qing was filled with immense regrets right now. If only they hadn’t come forth due to curiosity, nothing like this would have happened then.</p><br/><p>“Who determined that?”</p><br/><p>At this moment, Lin Fan stood forth and raised his hand. He blocked the Scarlet Blood Demon Saber with his bare palms and gave it a simple grip. The saber then shattered and disintegrated into the air.</p><br/><p>“Number sixty seven on the True Immortal Substitute Roll? Do you really think that you’re number one? And, even if you’re number one, your outcome will still be the same.” Lin Fan said.</p><br/><p>Eh?</p><br/><p>The group looked at Lin Fan in astonishment. How could that Scarlet Blood Demon Saber break so easily? This was way too unreal!</p><br/><p>Lam_ Lam_ Why is the Blood Demon Sect described as a Righteous Sect as well? I have…no idea. I’ll update and change this if anything happens in the future. But mostly I blame our author for not giving me an extremely detailed explanation as usual. He just tossed a random ‘9 sects, 6 blah blah 3 blah blah blah blah blah.’ <em>Rolls eyes</em> HAHA. Cheers!</p><br/>\n</div>"}