{"title": "Chapter 995 - Creating A Mess of Things", "id": 995, "volume": 10, "url": "http://boxnovel.org/the-strongest-system-chapter-995-creating-a-mess-of-things", "volume_title": "Volume 10", "body": "<h1>Chapter 995 - Creating A Mess of Things</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The crowd was bustling with excitement right now.</p><br/><p>“Holy f*ck! The guts of that Ma Tengyun are way too huge now! To think that he would dare to challenge at the Remnants now!”</p><br/><p>“Who knows? Perhaps that fella is just trying to draw some eyeballs to his antics?”</p><br/><p>“Senior Brother Ling Wuzun is a powerful being who is ranked number forty eight on the True Immortal Substitute Roll!”</p><br/><p>“Hehe! Out of us ten great Remnants of the Heaven and Earth Sect, nine occupy a spot on the True Immortal Substitute Roll.”</p><br/><p>…</p><br/><p>“What’s your name? To think that you would have the guts to challenge me.” Ling Wuzun descended from the void and stood upright on the competition arena. He looked down at Ma Tengyun with a face full of disdain.</p><br/><p>Ma Tengyun rolled his eyes, “Wait till you’re able to win against me in the challenge before you get the right to ask me my name. Otherwise, in my eyes, you are but another disciple who is about to lie flat on the ground!”</p><br/><p>Tyrannical!</p><br/><p>The moment Ma Tengyun spoke those words, all the surrounding disciples were totally frozen in absolute shock. The many elders who were up on the platform were equally astounded as well!</p><br/><p>The Heaven and Earth Sect was not the Heaven and Earth Sect for nothing! The disciples here were one more tyrannical than the other! With disciples of this caliber, there were no worries that the sect would not flourish!</p><br/><p>“Courting death!” Ling Wuzun was totally enraged right now as he struck out instantly.</p><br/><p>Ma Tengyun’s face was filled with a resolute expression. It was as though he had prepared his plan long before this duel.</p><br/><p>The strength of this Ma Tengyun was a lot weaker than Ling Wuzun’s. If there were no accidents, he would definitely lose for sure.</p><br/><p>Bam!</p><br/><p>Ling Wuzun struck out with a palm towards Ma Tengyun’s body furiously. However, this Ma Tengyun did not even bother to dodge as he stood there and struck out on Ling Wuzun’s body heavily as well!</p><br/><p>This was just going head-on with brute force against brute force!</p><br/><p>In the blink of an eye, Ma Tengyun was sent flying to one side like a kite that was cut off from its string. His mouth was spewing out a stream of fresh blood as well.</p><br/><p>Ling Wuzun had not expected that the other party would actually come at him head on! However, receiving a palm strike from the other party was not much of an issue either.</p><br/><p>And just as Ling Wuzun thought that this had already ended, he realized that Ma Tengyun had stood up as though he was completely fine!</p><br/><p>When Lin Fan caught sight of this scene before him, he could not help but chuckle out.</p><br/><p>Amazing!</p><br/><p>To think that this fella would really go head on against Ling Wuzun with brute force just by popping pills!</p><br/><p>And to Lin Fan’s astonishment, this Ma Tengyun was actually starting to play with self destruction!</p><br/><p>The method of his self destruction was by using Dao Weapons.</p><br/><p>For an Immemorial Ancient state powerful being, the self destruction of a Dao Weapon would not really deal much damage. But, when it was at point blank, the impact was no joke either.</p><br/><p>That blast could cause someone’s death!</p><br/><p>Not only that, Ma Tengyun wasn’t even self destructing them one after another! He was just mass exploding four-five of them together!</p><br/><p>Bloody hell! This was just the way the rich played!</p><br/><p>And, the eventual outcome of this was that Ling Wuzun was left spraying out blood left and right by the resultant blasts. Even though the injuries on Ma Tengyun’s body were severe, he recovered in the blink of an eye as he started popping those pills in broad daylight.</p><br/><p>“Hehe!”</p><br/><p>Each time he popped a single pill, Ma Tengyun would scoff out coldly once. It was as though he was saying, “Your Tycoon here is going to play you to death completely!”</p><br/><p>Seeing this scene, everyone were totally frozen solid. This was way too unreal, way too tyrannical! This wasn’t something that ordinary people could play with!</p><br/><p>Eventually, the outcome was obvious: Ma Tengyun stood victorious.</p><br/><p>As for Ling Wuzun, his entire face was just filled with bewilderment. He had not expected that he would lose! He also did not know how this fella could do it!</p><br/><p>It was as though those Dao Weapons did not cost any money as they self destructed one after another!</p><br/><p>And each time, the self destruction happened so close to him that he could not even react to it!</p><br/><p>As the person in charge, when Elder Huo caught sight of everything before him, he did not know what to say for a moment or so.</p><br/><p>“Inner Sect disciple Ma Tengyun has succeeded in the challenge and is promoted to be a Remnant. Previous Remnant Ling Wuzun has lost the battle and shall become an Inner Sect disciple.”</p><br/><p>When Elder Huo spoke out with these words, the entire crowd seemed as though it was about to explode.</p><br/><p>T-this…!</p><br/><p>“Reporting to the Grandmaster, reporting to the Elder, I do not wish to be a Remnant. This disciple here knows that my strength is not as strong as this person before me. However, what this disciple wanted to prove was that even if I’m weaker, I’m able to take down someone stronger than myself.” Ma Tengyun stood on the arena saying before he turned around and left right away.</p><br/><p>And just as he was ready to hop down from the arena, Ma Tengyun turned around to look at Ling Wuzun, “I told you, you’re not qualified to know my name.”</p><br/><p>Every single word that Ma Tengyun spoke of was just like a tight slap that was rained down onto Ling Wuzun’s face.</p><br/><p>At this moment, Ling Wuzun was totally flabbergasted. He felt that he would definitely turn into a laughing stock from this day forth!</p><br/><p>‘That fella is really mother*cking good at putting on an act! But, he probably knows that even if he becomes a Remnant, he will not be able to hold onto that position.’ Lin Fan thought in his heart.</p><br/><p>This first duel had brought the mood of the crowd to a peak.</p><br/><p>To think that an Inner Sect disciple would have stood victorious! This invigorated the hearts of many Inner Sect disciples!</p><br/><p>Even though the method of victory used by this fella was pretty weird, it was truly tyrannical!</p><br/><p>When the Grandmaster of the Heaven and Earth Sect caught sight of this disciple, he could not help but nod his head as well. This lad had character!</p><br/><p>Even though there was a good start from the Inner Sect disciples, for a moment or so, there were no other Inner Sect disciple who had taken the initiative to come forth and challenge again. Their greatest goals were still to obtain the rewards for the top ten disciples amongst the Inner Sect Grand Competition.</p><br/><p>At this moment, Elder Huo stood there and cast a glance over at Dao Wentian.</p><br/><p>Dao Wentian’s expression was haughty as he stood up.</p><br/><p>“Reporting to the Grandmaster, even though the Heaven and Earth Sect is one of the nine righteous sects right now, this disciple feels that the quality of the disciples that are being brought in every year is of extremely low caliber. Therefore, this disciple wishes to challenge Elder Qing Yangzi so that I can take on the role of the Elder in charge of reviewing the sect’s disciples.” At this moment, Dao Wentian spoke up.</p><br/><p>Everyone had not expected that Dao Wentian would actually challenge Qing Yangzi!</p><br/><p>Qing Yangzi who was standing there felt his face freeze up a little as though he was caught in disbelief.</p><br/><p>Lin Fan’s brows furrowed. What was the meaning of this?</p><br/><p>“Dao Wentian, what do you mean by that!” Qing Yangzi was enraged right now. Was this fella implying that the disciples he had chosen for the sect were all that could not make it?</p><br/><p>“I mean nothing much, Elder Qing Yangzi. Your judgment is simply way too poor. Have you brought in any good seeds for the sect in the recent years?” Dao Wentian asked.</p><br/><p>“The positions of the entry level elders are to be occupied by those who are capable. As a Remnant, I, Dao Wentian, have the capability to challenge the elders. Do you dare to accept my challenge?”</p><br/><p>Within the Heaven and Earth Sect, disciples could challenge the entry level elders. However, the prerequisite for that must be that their cultivation states must be at True Immortal state.</p><br/><p>Even though this Dao Wentian wasn’t someone at True Immortal state, everyone knew that he was someone who could enter the True Immortal state anytime he wished.</p><br/><p>Li Qing, who was standing beside the elder, was glaring with Dao Wentian with a look of fury. He did not expect that Dao Wentian would actually speak up to challenge Qing Yangzi!</p><br/><p>“I’ll permit it.” Elder Huo spoke up.</p><br/><p>Qing Yangzi was beyond furious right now as he headed for the arena straightaway, “You, lad! Since when have I not brought in any good seeds for the sect? Who are you to say that?”</p><br/><p>“Whether or not that is the case does not matter anymore. Today, I, Dao Wentian, am going to challenge you.” Dao Wentian replied calmly.</p><br/><p>At this moment, all of the disciples present were just completely startled. They had not expected that there would be so many major events happening during the Grand Competition this time around!</p><br/><p>Elder Huo gloated out in his heart. This was something that they had been waiting for over a long time now. Finally, the chance had arrived.</p><br/><p>However, some of the elders who were of True Immortal state and above frowned. They felt that this Dao Wentian was going overboard with this now.</p><br/><p>As an elder in charge of reviewing disciples, Qing Yangzi had selected quite a few decent disciples for the sect. To think that something as such would happen today.</p><br/><p>Even though there was this rule within the sect, there were few who would invoke this right to challenge outright.</p><br/><p>“Three moves… Within three moves, I’ll be able to take you down.” Dao Wentian glared at Qing Yangzi coldly.</p><br/><p>“Lad, don’t get too cocky now!” Qing Yangzi was enraged.</p><br/><p>Lin Fan, who was standing down below calmly, knitted his brows tightly. He knew that Qing Yangzi was no match for this Dao Wentian.</p><br/><p>“Let the duel begin.” Elder Huo spoke up.</p><br/><p>“The first move.”</p><br/><p>BAM!</p><br/><p>A palm strike flew over and sent Qing Yangzi stumbling backward.</p><br/><p>“The second move.”</p><br/><p>An extremely profound power gushed out. Even though Qing Yangzi was someone with the strength of True Immortal state, he was still no match for Dao Wentian nevertheless.</p><br/><p>“The third move.”</p><br/><p>BAM!</p><br/><p>“Elder…!”</p><br/><p>A figure was sent flying out of the arena.</p><br/><p>Qing Yangzi sprayed out a mouthful of fresh blood as his eyes were filled with an endless amount of wrath.</p><br/><p>On the sparring arena, Dao Wentian swept his robes with an arrogant expression, “If I say three moves, I mean three moves. There wouldn’t be any more move.”</p><br/><p>Li Qing rushed up front and hugged up Qing Yangzi. When he checked out the wounds, he raised his head, “DAO WENTIAN! WHY DO YOU HAVE TO BE HEAVY WITH YOUR ATTACKS?”</p><br/><p>Li Qing howled out in rage. He had realized that Elder Qing Yangzi’s Laws as a True Immortal were broken apart!</p><br/><p>“Fists and kicks have no eyes. The fact that I did not take his life is already mercy on my part. Qing Yangzi’s judgment has been eroded, and he has not brought forth any disciples with potential for the sect over many years now. This has an impact on the sect’s development and he could be said to have failed in his job. If there are no successors for the sect in the future, he will be the greatest sinner for that. Honestly, this is the greatest mercy I can accord him.” Dao Wentian replied coldly.</p><br/><p>Li Qing realized that the Grandmaster was just sitting there without saying anything. In a moment of fluster, he shouted out, “Grandmaster! Elder Qing Yangzi has fought tirelessly for the sect, and has given it his entire heart and soul! Dao Wentian is just spouting falsehoods and accusations there!”</p><br/><p>“Oh!” The Grandmaster spoke up.</p><br/><p>Urgh!</p><br/><p>Qing Yangzi spat out a mouthful of old blood. He hadn’t expected that the Grandmaster would reply with just a single word!</p><br/><p>“GRANDMASTER! I, QING YANGZI, HAVE GIVEN THE SECT MY EVERYTHING AND MORE!” Qing Yangzi shouted out.</p><br/><p>“Elder, don’t speak anymore.” At this moment, Lin Fan stood up and took out the Damage Leaving Pill so that Qing Yangzi could consume it.</p><br/><p>But right now, Qing Yangzi’s emotions were evidently extremely worked up. He pulled on Lin Fan’s sleeves, “I, QING YANGZI, HAVE GIVEN THE SECT MY EVERYTHING AND MORE!”</p><br/><p>Li Qing looked at Dao Wentian, who was standing on the arena looking all smug and cocky, and felt his entire body burning with a rage and indignance.</p><br/><p>“Senior Brother Lin, you must prove yourself!” Li Qing tugged at Lin Fan with bloodshot eyes.</p><br/><p>“Me?” Lin Fan was stunned, not understanding what was going on. What had this got to do with him again?</p><br/><p>“Senior Brother Lin, you are a paragon that Elder Qing Yangzi has brought back into the sect! For that, Elder tried pushing for the Seat of the Remnant for you, but it was taken away by that Spirit Fire of the Heaven and Earth that Elder Huo has brought back. Elder was afraid that you might be displeased over the fact, and therefore, he made use of the Contribution Points that he was saving up for the Immortal Calamity to exchange for the mystic skills of the martial arts and pills that only Remnants should rightfully possess!”</p><br/><p>The moment Lin Fan heard this, he was taken aback. He truly hadn’t expected that things would actually be as such.</p><br/><p>Lin Fan took in a deep breath before walking over to Qing Yangzi’s side, “Take this pill and consume it. I’ll prove the rest of it for you.”</p><br/><p>At this moment, Lin Fan walked up onto the arena slowly.</p><br/><p>“Grandmaster, this disciple here is Lin Fan. I am a disciple that Elder Qing Yangzi has brought back.”</p><br/><p>“Elder Qing Yangzi has been framed by this small boy, I’m indignant about that. I heard that the number one Remnant in the entire sect is Dao Wentian. That is something I’m indignant about as well. I wish to challenge him.”</p><br/><p>The moment Lin Fan said this, every single person present was totally stunned.</p><br/><p>Qing Yangzi was even more astounded. To think that Lin Fan would wish to challenge Dao Wentian himself! How could he possibly win?</p><br/><p>“Permitted.” The Grandmaster spoke up. From the start to the end, it seemed as though the Grandmaster could only speak in simple words.</p><br/><p>Some of the elders who were sitting beside the Grandmaster felt that this was extremely strange. Given this situation and his character, he would definitely step in to prevent it. But, what in the world was going on right now?</p><br/><p>After looking over carefully, the elders were even more surprised.</p><br/><p>This was such an important occasion! And yet, this bloody Grandmaster had actually sent forth an emotionless Puppet Doppelganger in his place! This was something that only knew simple replies such as, ‘Oh’, ‘Permitted’, ‘Okay’, and ‘Not bad’!</p><br/><p>Could he not know that something major was happening here? Qing Yangzi must be feeling so disillusioned right now.</p><br/><p>At this moment, Lin Fan extended his palm and looked at Dao Wentian calmly.</p><br/><p>“One move. If you can remain standing after, we’ll take that as my loss.”</p><br/><p>BOOM!</p><br/><p>Explosion!</p><br/><p>The entire crowd was totally dumbstruck by these tyrannical words.</p><br/><p>As for some of the elders, they were beyond astounded. This entire affair was just incredulous. But, one might as well forget it. Since things had escalated to such an extent, they were not going to carry the weight of the responsibility right now. They would just wait for the Grandmaster’s return to settle this himself personally.</p><br/><p>“HAHAHAHA…!” Dao Wentian roared out in laughter. He was laughing so hard he was almost tearing up.</p><br/><p>His face then froze up before being replaced with a look of absolute contempt, “Just someone like you?”</p><br/><p>The other Remnants who were seated there burst out in laughter as well. The look they had as they stared at Lin Fan was as though they were looking at a dumb fool right now.</p><br/><p>Su Hongchen and the others were just watching with their jaws hanging agape right now. Junior Brother Lin was just out and bent on creating a mess of things!</p></div>\n</div>"}