{"title": "Chapter 1029 - One Hell Of A Loss!", "id": 1029, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1029-one-hell-of-a-loss", "volume_title": "Volume 11", "body": "<h1>Chapter 1029 - One Hell Of A Loss!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1029: One Hell Of A Loss!</p><br/><p>Lin Fan’s strength right now was far stronger than three years ago. And, this was all thanks to the Boundless Future Buddha Lord.</p><br/><p>During the three years he had spent in that space, Lin Fan dueled fiercely with the Boundless Future Buddha Lord. Not only were countless mystic skills of martial arts deployed, it also allowed Lin Fan to cultivate them to a pinnacle state.</p><br/><p>Furthermore, when he defeated the Boundless Future Buddha Lord eventually, that consciousness of his had given Lin Fan an extraordinary amount of experience points.</p><br/><p>Even though he had only pointed out with a single finger, that was something that possessed the utmost will state of the Sword Dao. This was even sicker after Lin Fan had fused all of his comprehension together into a single Sword Will.</p><br/><p>Even the top tiered mystic skills of the Heaven and Earth Sect would definitely not be a match for this single finger move.</p><br/><p>“You…!” The Old Master Inferno Requiem let out a look of shock. It seemed as though all the powers in his body had been severed by this single Sword Will, causing a vacuum to appear.</p><br/><p>With that, all his powers seemed to be frozen, as he could not work them at all!</p><br/><p>Seizing this moment, Qiu Zhanyu and Jin Zhengu snatched back the Heaven and Earth Net instantly.</p><br/><p>Ding!</p><br/><p>The finger was pointed on the forehead of the Old Master Inferno Requiem, for whom, this was something extremely horrifying, causing sweat to pour heavily.</p><br/><p>“Wait up!” The Old Master Inferno Requiem spoke up as his eyes was filled with an endless amount of fear. He had discovered that the strength of this guy before him was far from ordinary. Even he was not a match for this person at all!</p><br/><p>“I can’t wait.” Lin Fan’s lips curled into a grin as he pointed out his finger. Like water ripples, circles started spreading out layer after another.</p><br/><p>The Old Master Inferno Requiem’s eyes opened wide as his body shivered slightly as a Sword Will pierced out of Lin Fan’s finger, penetrating right into his body</p><br/><p>No one else knew what was going on.</p><br/><p>When Qiu Zhanyu and Jin Zhengu looked at what was happening up in the void, their hearts were filled with bewilderment. They did not know what their Big Bro was doing with this Old Master Inferno Requiem.</p><br/><p>But by the looks of it, it seemed extremely strange.</p><br/><p>Creak!</p><br/><p>All of a sudden, a clean, crisp sound rang through the void. It sounded just like glass breaking, clean and brittle, yet ever so chilling to hear.</p><br/><p>“How could this be! I, the Old Master Inferno Requiem, have reigned over the world throughout my entire life! How can I possibly fall here?” The heart of the Old Master Inferno Requiem was filled with indignance. He was a Golden Immortal being who had reigned supreme over the entire world with a lifetime of groundbreaking cultivation!</p><br/><p>The only reason he had come here this time around was that he had heard about a Supreme Grade Immortal Weapon from Luo Li!</p><br/><p>But, to think that he would have to fall here!</p><br/><p>Lin Fan placed his hands behind his back and glanced over at the Old Master Inferno Requiem, then turned around to head over to the side of Qiu Zhanyu and Jin Zhengu.</p><br/><p>“Big Bro, he…!” Qiu Zhanyu looked over at the Old Master Inferno Requiem up in the void nervously. He did not know what was going on right now.</p><br/><p>Crack!</p><br/><p>Just as he was feeling perplexed over the situation, the face of the Old Master Inferno Requiem suddenly started shattering apart into shards that disappeared into the void one after another.</p><br/><p>The body of his that was hidden beneath his clothes started breaking apart in the same way. Thereafter, an infinite amount of Sword Wills burst forth from his body, filling the world with a blinding brilliance.</p><br/><p>The body of the Old Master Inferno Requiem was just like a Supernova right now. The light was so blinding that no one dared to look at it directly.</p><br/><p>BAM!</p><br/><p>An explosion boomed out in the next instant, and that malevolent looking Old Master Inferno Requiem vanished just like smoke!</p><br/><p>‘Ding…Congratulations on killing Golden Immortal lower level Old Master Inferno Requiem.’</p><br/><p>‘Ding…Experience Points +…’</p><br/><p>‘Ding…Obtained Unparalleled Mystic Skill, Heavenly Inferno Requiem Frost.’</p><br/><p>Lin Fan had not expected that a mystic skill would pop up after the explosion! He then took it over in his hands.</p><br/><p>This mystic skill wasn’t weak at all. However, it was just that the Old Master Inferno Requiem’s strength wasn’t all that great, and on top of that, he had met with a sicko like Lin Fan. If it were an ordinary person who had encountered the Old Master Inferno Requiem, their only outcome would most probably have had been death.</p><br/><p>After Lin Fan learned the mystic skill, yet another Mystic Skill Rune appeared within his body.</p><br/><p>As he flipped his palm around, a frosty air rumbled out, freezing even space itself. This was finally an Unparalleled Mystic Skill that he could take out to use.</p><br/><p>“To think that the Old Master Inferno Requiem would have died just like that.” When Feng Yanyun caught sight of everything before her, she was so astonished that she no longer knew what to say.</p><br/><p>Lin Fan looked at Feng Yanyun and the elderly man beside her, feeling a little confused. He did not know who these two were, or how Qiu Zhanyu and Jin Zhengu got to know of them.</p><br/><p>Seeing the look on his face, Qiu Zhanyu and Jin Zhengu relayed to Lin Fan straightaway everything that had happened in the past few years.</p><br/><p>The moment Lin Fan heard everything, he froze up, “Three years!”</p><br/><p>“That’s right, Big Bro! You had fainted over for three years already!” Qiu Zhanyu said.</p><br/><p>“I’m going to f*ck that bloody darned Boundless Future Buddha Lord! To think that he would f*cking steal away from me three years of my time!” Now that Lin Fan realized he was asleep for a whole three years, his heart burned with an endless rage.</p><br/><p>This was too darned inhumane!</p><br/><p>At the start, Lin Fan was still feeling that he had earned by destroying that consciousness of the Boundless Future Buddha Lord.</p><br/><p>But now that he knew he had fainted over for 3 years, he nearly spat out a mouthful of old blood.</p><br/><p>Bloody hell! He had wasted yet another three years!</p><br/><p>If he had spent those three years on killing powerful beings, how formidable would his cultivation state have been right now?</p><br/><p>Perhaps, he might have even reached that Heavenly Lord state or whatnot by now!</p><br/><p>Lin Fan was filled with an immense regret! In fact, he even had an impulse to go kill the Boundless Future Buddha Lord mercilessly!</p><br/><p>But then, he merely sighed out to vent the unhappiness in his heart.</p><br/><p>‘Forget it! Forget it!’</p><br/><p>Now that things had already come to this state, what else could he say?</p><br/><p>“Thank you.” Feng Yanyun spoke up. In the past, she had the courage to try and retain Qiu Zhanyu and Jin Zhengu. But, facing Lin Fan right now, she did not harbor such thoughts at all.</p><br/><p>That was because she knew that this person before her wasn’t someone who could be restrained by a small little city such as the Maple Forest City.</p><br/><p>Lin Fan nodded his head without saying anything more.</p><br/><p>Looking at how this man was so cold to her, Feng Yanyun felt a little awkward in her heart. However, she did not dare to feel any bit of displeasure at all. Even though she was the ruler of the Maple Forest City, she knew that she was nothing but an ant in the eyes of such a powerful being.</p><br/><p>“Now, what about you guys? Are you guys going to continue following me or will you stay in this Maple Forest City?” Lin Fan asked.</p><br/><p>“Of course, we’re following you, Big Bro! Now that you have slain that Luo Li, this Maple Forest City will be safe from now on, Big Bro!” Qiu Zhanyu chuckled out.</p><br/><p>“That’s right! The Maple Forest City of today has the capabilities to protect itself! In the past three years that we’ve been here, the two of us had set up a martial arts school. Even though it’s not at a point where everyone is learning martial arts, there are still plenty of pretty capable students!” Jin Zhengu added on.</p><br/><p>Lin Fan chuckled out, “To think that both of you would have done so many things in the past three years. However, rest at ease. Since this is your hometown, I will naturally not sit idly by either.”</p><br/><p>At that moment, Lin Fan flipped out his palm, deploying the Source Sealing Technique instantly.</p><br/><p>As he drew a line with his finger, a Sword Will was infused within.</p><br/><p>After the deployment of the Source Sealing Technique, the entire Maple Forest City was enveloped up within it. The Sword Will that was infused in was even Lin Fan’s personal one. This was a Sword Will that could kill even Golden Immortal powerful beings. He reckoned that this should be powerful enough.</p><br/><p>“I’ve already laid down my seal at this place. Even if you guys were to meet with enemies in the future, there shouldn’t be too many problems.” Lin Fan said.</p><br/><p>“Thank you, Big Bro!” Qiu Zhanyu and Jin Zhengu could naturally sense how formidable the formation enveloping the Maple Forest City was. Even if it were them, there was probably no way they could possibly withstand it.</p><br/><p>Feng Yanyun was especially grateful. If she could, she would even offer herself in marriage. However, she knew that she wasn’t worthy of Lin Fan.</p><br/><p>“Big Bro, where are we headed off to now?” Qiu Zhanyu asked.</p><br/><p>Lin Fan hesitated for a moment. Honestly, he wasn’t too clear about where they should go now himself.</p><br/><p>“We’ll return to the sect first. It has been three years since I left. They might have even presumed me dead by now.” Lin Fan said.</p><br/>\n</div>"}