{"title": "Chapter 1032 - One Move, Just One Move", "id": 1032, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1032-one-move-just-one-move", "volume_title": "Volume 11", "body": "<h1>Chapter 1032 - One Move, Just One Move</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>1032 One Move, Just One Move</p><br/><p>Lin Fan had been observing from below for some time now, feeling that this was really a huge loss of face for the Heaven and Earth Sect this time around. To think that they would only win two matches in this competition. That was pretty pathetic!</p><br/><p>Out of the nine great Remnants of the Heaven and Earth Sect, there were two unfamiliar faces. Lin Fan did not know if two of them had been demoted after losing to Inner Sect disciples or they had chosen to step down from the Seat of the Remnants to turn into ordinary elders.</p><br/><p>However, none of that mattered to Lin Fan.</p><br/><p>As for Qing Yangzi, whose face was filled with embarrassment up till this point, he bolted upright emotionally when he caught sight of the person who had walked out of the crowd. Flushing red entirely, he shouted, “This lad has finally decided to head back!”</p><br/><p>The surrounding disciples broke out in chatter.</p><br/><p>“Who is that person?”</p><br/><p>“I’ve got no idea. But, he looks extremely familiar, as though I’ve seen him somewhere or something.”</p><br/><p>“Are you guys stupid or what! That’s the number one Remnant, Senior Brother Lin!”</p><br/><p>“Holy sh*t! That’s the guy who had trampled down on Dao Wentian and assaulted Elder Huo with his fist relentlessly? THAT Senior Brother Lin?”</p><br/><p>“That’s the one! I’ve heard that he had headed out of the sect for three straight years without returning now! To think that he would be back at this time!”</p><br/><p>When Su Hongchen and the others caught sight of Lin Fan, their expressions were equally dumbfounded.</p><br/><p>After three years, they did not even dare to imagine the extent of Senior Brother Lin’s growth. Even though their strength had been raised by a fair bit as well, they did not dare to compare themselves with Senior Brother Lin.</p><br/><p>Senior Brother Lin was a supreme paragon, not someone they could ever be on the same level with.</p><br/><p>Han Juntian heaved a sigh of relief at this moment as well. He had quite a bit of confidence toward the strength of that lad. However, the fact that there was no news of him for the past three years did have him feeling a little skeptical at first. If not for the fact that he was still holding on to that Remnant token, Han Juntian would have suspected that he might have jumped ships.</p><br/><p>When Ling Wuzun, who was being suppressed right now, caught sight of the figure before him, his eyes shone with a deep indignance momentarily. However, there was more of fear within them as well.</p><br/><p>Three years ago, he was taken down by Lin Fan so badly that he did not even have a chance to retaliate. But now that this guy was back, Ling Wuzun’s heart was actually filled with hope instead, wishing that he could take down the Kunlun God Sect harshly.</p><br/><p>Lin Fan looked down at Ling Wuzun and shook his head, “It’s been three years since I’ve seen you, yet you are still as useless as ever. To think that your cultivation state would have only been raised to that mere point.”</p><br/><p>The moment Ling Wuzun heard these words of Lin Fan, his face changed immediately as a ball of flames burst forth in his heart. The moment this fella is back, he came straight to humiliate him again! However, Ling Wuzun did not dare to fight back anymore. This person before him was the number one Remnant, and his senior brother at that.</p><br/><p>“You are right in your scolding, senior brother.” Ling Wuzun lowered his head and replied in respect.</p><br/><p>“Yes… Since you know that it’s your bad, hurry up and scram back to train up properly.” Lin Fan placed his hands behind his back, filled with a domineering disposition.</p><br/><p>Ling Wuzun nodded his head immediately, “Yes.”</p><br/><p>Lin Fan then cast his sight onto the seating area of the Remnants. The remaining eight great Remnants bolted upright and greeted politely in reverence, “Senior Brother Lin.”</p><br/><p>Lin Fan replied with a ‘hmm’, expressing his satisfaction toward this behavior of theirs. He then looked over at Jian Cangqiong, “Your strength has risen by a fair bit. Seems like you’ve been working hard for the past three years.”</p><br/><p>Jian Cangqiong was respectful in his words, “You have been my role model, senior brother.”</p><br/><p>“Yes, very well.” Right now, Lin Fan was extremely cocky. At the same time, he was pretty proud of himself in his heart. This should be the style a senior should have, being feared without him showing his temper.</p><br/><p>“Big Bro is so tyrannical!” Down at the viewing platform, Qiu Zhanyu remarked emotionally.</p><br/><p>Jin Zhengu nodded his head as well, “That’s right! Wherever Big Bro stands, those Remnants would have to look at him with respect! They even seem as though they’re pretty afraid!”</p><br/><p>“Hehe… Of course, they’re afraid! Our Big Bro is an invincible existence!” Qiu Zhanyu added on.</p><br/><p>When the newly recruited disciples of the Heaven and Earth Sect caught sight of this, they were all shocked silly.</p><br/><p>They had never seen Lin Fan before. However, they were extremely familiar with the other nine great Remnants, whom they had seen from time to time. All of those senior brothers were extremely haughty characters with an extraordinary aura. Even when they bumped into these Remnants usually, they would feel unusually nervous.</p><br/><p>But, when all nine of those Remnant senior brothers caught sight of this figure on the sparring arena, they were all obedient and polite! This was something that had them extremely astonished. If they had not witnessed this for themselves, they might not have dared to believe it.</p><br/><p>Yan Qingxue laughed out coldly, “Alright, stop with the acting now. You’re a Remnant and their senior brother, right? Since you’re on the sparring arena now, come and fight a round with me. I do have to see for myself what capabilities someone like you has as a senior brother. Just make sure that you don’t get walloped like a dog by me later on.”</p><br/><p>“Damn it…!” When the disciples of the Heaven and Earth Sect heard these words, they were incensed. This b*tch was really way too arrogant! She was just not giving any respect to their Heaven and Earth Sect!</p><br/><p>The Remnants of the Heaven and Earth Sect were equally infuriated. This b*itch was way cockier than anyone else!</p><br/><p>Lin Fan chuckled out softly and shook his head as he looked at this b*tch, “You’re way too weak. All the Remnants of the Kunlun God Sect, come at me together.”</p><br/><p>“What?” The Remnants of the Kunlun God Sect were startled before they burst out into laughter.</p><br/><p>“Is this Remnant of the Heaven and Earth Sect nuts or something?!”</p><br/><p>“What did he just say? That our junior sister is too weak? He wants us all to go attack him together? There can’t be something wrong with his brain, can it?”</p><br/><p>“I think there’s a high chance of that being the case. Does he not know just how powerful our junior sister is?”</p><br/><p>“If all of us were to go together, he would probably be left with nothing but a corpse I suppose!”</p><br/><p>…</p><br/><p>“HAHAHA!” Yan Qingxue roared out into laughter. That was an extremely arrogant laughter, “To think that the Remnants of the Heaven and Earth Sect are one better than the other at bragging! Seems like my knowledge of the world has really been expanded today! Someone like you who can only spout out nonsense will definitely be trampled under my feet harshly later on!”</p><br/><p>On the seat of the Grandmasters…</p><br/><p>“Brother Han, that disciple of your sect is quite arrogant eh?” The Grandmaster of the Kunlun God Sect chuckled out.</p><br/><p>Han Juntian’s lips curled into a smirk, “Those are just kind words of advice from my sect’s disciple.”</p><br/><p>“Huh?” The Grandmaster of the Kunlun God Sect was stunned. He then burst out into laughter as though he had just heard some joke.</p><br/><p>Lin Fan looked over at Yan Qingxue. His hands were still behind his back, totally unbothered by it, “You don’t have to laugh now. That was a piece of advice that I was giving you because you’re a female. But, if you refuse to believe in it, it doesn’t matter. Just be prepared to receive the consequences later then.”</p><br/><p>“What did you just say? I can’t hear you properly. Please speak louder, eh?” Yan Qingxue cupped her ear with a single hand as though she had not heard him clearly. Her expression then changed immediately, “Well, don’t say that Your Lady here didn’t give you any chances. Take out your full capabilities. Otherwise, don’t come complaining that Your Lady didn’t remind you about it when you get trampled under my feet!”</p><br/><p>Lin Fan was still standing there ever so idly as he looked at this person before him with disdain. He had not thought that women these days would be this cocky. To think that she would really dare to step over the heads of the Heaven and Earth Sect Remnants. She was indeed cockier than anyone could be.</p><br/><p>When Yan Qingxue realized that the other party was looking at her in disdain, she got enraged, “Prepare to die!”</p><br/><p>Pshew!</p><br/><p>That figure of hers disappeared all of a sudden as though she had vanished from the sparring arena entirely. As for Lin Fan, he was just standing there as per normal without budging even a single inch, as if he was rooted.</p><br/><p>“What in the world is Senior Brother Lin trying to do?” Su Hongchen and the others exclaimed out. The strength of this Yan Qingxue had far exceeded their imaginations.</p><br/><p>All the other Remnants of the Kunlun God Sect curled out into a grin, “To think that junior sister would have succeeded in training this movement skill! Seems like she has been keeping quite a few things hidden from us, eh?”</p><br/><p>“That fella is a Remnant of the Heaven and Earth Sect. But, he’s most probably about to be trampled by the feet of our junior sister cruelly soon!”</p><br/><p>Just at this moment, Yan Qingxue’s figure appeared, “Kneel down!”</p><br/><p>Lin Fan was STILL standing there as he shook his head slightly. In the next instant, he raised his palm.</p><br/><p>Bam!</p><br/><p>A gigantic explosion boomed out immediately.</p><br/><p>When everyone caught sight of what happened, they were absolutely dumbfounded.</p><br/>\n</div>"}