{"title": "Chapter 1042 - Waiting", "id": 1042, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1042-waiting", "volume_title": "Volume 11", "body": "<h1>Chapter 1042 - Waiting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1042: Waiting</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_At this moment, everyone present held their breaths. This was especially the case for those three senior sisters of Lin Hanyu whose eyes shone with looks of fear. They had a feeling that something horrifying was really about to happen later on.</p><br/><p>“ARE YOU REALLY GOING TO KILL ME?” Ning Tiekun screamed out at the top of his lungs as both his eyes widened like those of a cow. In fact, his voice was almost turning hoarse from it.</p><br/><p>“What now? Is there any reason why I can’t kill you?” Lin Fan asked coldly. He was totally unbothered by an existence as such. Every single one he killed was one more, and that was it. Even if he had some status to him, so what? Lin Fan would still f*ck him to death without discussion.</p><br/><p>When Ning Tiekun heard those words, his entire heart froze up. He could feel the killing intent emanating out of the other party, causing him to scream out, “YOU CAN’T KILL ME! MY FATHER IS THE GRANDMASTER OF THE METAL SWORD SECT! EVEN IF THE METAL SWORD SECT ISN’T COMPARABLE TO THE HEAVEN AND EARTH SECT, YOU WILL STILL REGRET IT IF YOU WERE TO KILL ME!”</p><br/><p>Right now, Ning Tiekun was truly frantic in his heart. He was hoping that the other party would consider about this issue and spare his life. However, he was probably going to be disappointed this time around.</p><br/><p>If Lin Fan were the type of person who would cower in fright, he wouldn’t have gotten to where he was in such a short span of time.</p><br/><p>“Hmph! Even if your father were here, it would be of no use at all. It would be better for the Metal Sword Sect to not come and mess with me, in fact. If they did, the only path awaiting them would be death.” Lin Fan laughed out coldly as he used some slight strength with his hands.</p><br/><p>Snap!</p><br/><p>A crisp, clean sound rang out along with a low growl. However, it was all over in a flash.</p><br/><p>‘Ding…Congratulations on killing Immemorial Ancient state weak chicken.’</p><br/><p>‘Ding…No Experience Points gained.’</p><br/><p>Lin Fan glared at the corpse in his hand coldly and wrung his wrist. As he pointed out with his finger, the corpse of Ning Tiekun disintegrated into dust that scattered out in the air.</p><br/><p>Dead!</p><br/><p>He was really dead!</p><br/><p>At this moment, everyone was shocked senseless.</p><br/><p>From the start till the end, Lin Hanyu did not say anything at all. That was because she had long been shocked silly.</p><br/><p>She had not expected that her younger brother would be this violent! To think that he would not show any bit of mercy at all even though this Ning Tiekun was the Young Master of a sect!</p><br/><p>Zhou Jun and Wang Yun did not say anything either. This was an outcome they had long expected. Senior Brother Lin would definitely not take many things into consideration when he struck out. He would definitely just have the other party dead.</p><br/><p>Moreover, if the father of Ning Tiekun dared to come and create trouble for Senior Brother Lin, he would definitely not have a good ending either.</p><br/><p>“Ah, son! This wouldn’t cause any issues, would it?” Lin Haoming let out a look of worry.</p><br/><p>This was the son of the Grandmaster of the Metal Sword Sect! Now that his son had killed this person just like this, wouldn’t it cause any accidents or anything?</p><br/><p>“What issues could there be? If the Metal Sword Sect were to not know what’s good for them, they would just be seeking their own doom.” Lin Fan did not bother about the Metal Sword Sect at all. If they really dared come, he would let them know the true meaning of horror.</p><br/><p>Furthermore, Lin Fan was lacking in powerful beings who wanted to harass him. The only issue was that Metal Sword Sect was just a small sect. Lin Fan did not know if there would be any powerful beings within it.</p><br/><p>Meanwhile, the commoners outside were totally stupefied.</p><br/><p>“Young Master Lin is incredible! To think that he would really kill that person!”</p><br/><p>“I heard from others that he was the son of the Grandmaster of the Metal Sword Sect! Would there be any problems caused by killing someone of that status?”</p><br/><p>“How could there be any problems? Didn’t you see it for yourself just now? That so-called son of the Grandmaster was already so polite to those two earlier on. And then, those two had to kneel and kowtow in fear so badly at the mere sight of Young Master Lin for such a long time!”</p><br/><p>“That’s true. I wonder what the status of Young Master Lin is. To think that he would be so incredible that everyone would be so afraid of him!”</p><br/><p>“I’m not too clear either. He seems to be one of the Grandmaster Candidates.”</p><br/><p>“Doesn’t that mean to say that there’s a chance Young Master Lin would become the Grandmaster one day?”</p><br/><p>“Incredible! That’s way too incredible! With Young Master Lin, the Lin Family would definitely rise for sure!”</p><br/><p>“That’s right!”</p><br/><p>…</p><br/><p>The discussions outside were rife.</p><br/><p>At this moment, Lin Fan cast his glance toward the three senior sisters standing beside Lin Hanyu.</p><br/><p>When the three of them caught sight of Lin Fan’s gaze, they felt their hearts squeeze tightly as beads of sweat began to pour down their forehead. They were feeling extremely fearful in their hearts.</p><br/><p>Lin Hanyu knew how frightened her senior sisters were. No matter what, as their junior sister, she could not just stand by idly.</p><br/><p>“Little Brother, they are all senior sisters in my sect. They have been caring toward your Big Sister.” Lin Hanyu spoke up.</p><br/><p>She was starting to feel that it was getting more difficult to see through her Little Brother. In the past, he was always silent and quiet, different from everyone else.</p><br/><p>It was only till now that she understood that it was all because her Little Brother was a supreme paragon. In just a few years’ time, he had already grown to such an extent.</p><br/><p>“Son, they are from the same sect as your Big Sister.” Lin Haoming tugged at Lin Fan while saying.</p><br/><p>Lin Fan nodded his head, “Forget it! Since you guys have spoken up for them, I’ll let this matter be then.”</p><br/><p>Zhou Jun and Wang Yun were standing there in shivers. They were really thrown into a pit by someone today.</p><br/><p>That Ning Tiekun had thought of himself to be quite the somebody. To think that he would have met with a dead end today. Due to the fact that he had pushed both of them into this pit along with himself, there was truly no one to pity his death.</p><br/><p>However, both of them did not resent Senior Brother Lin for it at all. After all, if something as such were to happen to anyone, they would not let it go either.</p><br/><p>“Thank you, Senior Brother Lin.” Xiao Yuya spoke up with gratitude, and the other two followed suit.</p><br/><p>“Big Brother, you’re so amazing now!” Lin Lan’er said excitedly.</p><br/><p>Lin Fan fondled her head, “Yepps. When there’s time, I’ll bring you over to the sect as well and have you join our Heaven and Earth Sect.”</p><br/><p>The moment Lin Haoming heard this, he was stunned, “Ah, son! The Heaven and Earth Sect is a big sect! Can they let just anyone join just like that?”</p><br/><p>Lin Fan chuckled out, “This isn’t anything much.”</p><br/><p>Zhou Jun and Wang Yun spoke up at this moment, “Senior Brother Lin is the Grandmaster Candidate of our sect! It’s definitely no issue for him to bring some people back in!”</p><br/><p>Lin Haoming was elated right now. To think that their Lin Family would have produced such a character. This was a matter of great pride on their ancestor’s tomb!</p><br/><p>As for the other remaining seven Family Heads, their eyes shone with a bright glint as well. If that were indeed possible, wouldn’t they be able to pull people from their own families into the Heaven and Earth Sect as well?</p><br/><p>However, they naturally kept those thoughts in their minds for now. They’d wait for an opportune moment to speak with Lin Haoming about this. After all these years, their relationships were pretty decent. They should most likely not be rejected for it.</p><br/><p>At the same time, after this matter, they were even more certain that they would have to support the Lin Family keenly from now on.</p><br/><p>The Lin Family of today was incomparable from its past stature. It wasn’t something they could hope to compare with.</p><br/><p>As long as Lin Fan were to not fall, the Lin Family would definitely reign over the land for centuries to come. What could the mere Rising Dragon City amount to? They might even be able to reign supreme over the Endless Mainland one day!</p><br/><p>But that naturally required time to come to fruition. However, all of them believed that that was something bound to happen one day.</p><br/><p>After everyone dispersed, Lin Fan headed back into the house. Right now, he wanted to wait for the other party to descend.</p><br/><p>Since Ning Tiekun was killed by him, the Metal Sword Sect would definitely head here to check it out. But, that was fair as well. He’d just see what the situation would be like later on.</p><br/><p>In another house…</p><br/><p>Lin Hanyu was being surrounded by her two senior sisters. Right now, she was a big character in their eyes.</p><br/><p>Even though she was only an Outer Sect disciple in their sect, her younger brother was a Grandmaster Candidate of the Heaven and Earth Sect! That was something absolutely incredible!</p><br/><p>Xiao Yuya stood outside and maintained an astonished expression. She then took out a talisman and burnt it to transmit her voice with it.</p><br/><p>She had to report this matter back to the sect.</p><br/><p>If she were to let things continue progressing as such, there was a chance that Junior Sister Lin would leave the sect and join the Heaven and Earth Sect instead.</p><br/>\n</div>"}