{"title": "Chapter 1056 - Stabbing Maniac", "id": 1056, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1056-stabbing-maniac", "volume_title": "Volume 11", "body": "<h1>Chapter 1056 - Stabbing Maniac</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1056: Stabbing Maniac</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_A few days later…!</p><br/><p>Lin Fan had set out with Mo Qingxuan for a couple of days now, and the news of Long Jinfei’s death had spread over to the Kunlun God Sect as well by now.</p><br/><p>The sect was incensed from head to toe, hell bent on sniffing out the killer. But, they did not even know who was the one who had committed the crime, making them even more infuriated. The only ones present were Golden Immortal Tian Ci and Golden Immortal Chi Jiao. If they wanted to know who had killed Long Jinfei, it would only be possible to get the information from their mouths.</p><br/><p>But, even they did not know who the other party was. The only thing they could do was draw out an image of his.</p><br/><p>When the disciples of the Kunlun God Sect first saw the drawing, they could not make out who it was at first. But, one of the Remnants who had headed over to the Heaven and Earth Sect the previous time suddenly yelped out when he saw the drawing. Wasn’t that the mother*cking dog, Lin Fan?!</p><br/><p>Tai Qiantian was thoroughly enraged and declared immediately that no matter who it was, as long as they could kill Lin Fan, they would be gifted with an Upper Grade Immortal Weapon. At the same time, they would be able to go cultivate in the deep areas of the sect.</p><br/><p>A reward of that level was something that blew the minds of the disciples of the Kunlun God Sect. Even some of the elders were tempted over it.</p><br/><p>An Upper Grade Immortal Weapon was absolutely extraordinary. If it were to be deployed, it could raise one’s strength by a huge margin! And, if they could head to the deep areas of the sect for cultivation, that would be something even more incredible!</p><br/><p>When the Heaven and Earth Sect caught wind of this issue, Han Juntian was totally stupefied. Couldn’t this lad just not bloody cause any trouble?</p><br/><p>Eventually, he had to instruct his disciples to not head out too much for a while. As for those Grandmaster Candidate disciples that were outside, he was naturally not too concerned over their safety. After all, all of them had an extraordinary strength, and many ways to protect their own lives.</p><br/><p>As for Han Juntian, he was just entirely focused on every single move and action that the Kunlun God Sect was going to make. If Tai Qiantian or any other Vice Grandmasters were to make a move, he would definitely step in to stop them.</p><br/><p>But, at the end of the day, Han Juntian too was feeling too amazing over the way things were moving right now.</p><br/><p>…</p><br/><p>A few days later, in the endless void…</p><br/><p>A man dressed in yellow robes stood there, carrying an almighty aura. His face was calm, yet he emanated a chilling aura from head to toe. Looking at the few people before him, he started speaking up slowly.</p><br/><p>“Are these the people that the Kunlun God Sect has selected?”</p><br/><p>One of the elders of the Kunlun God Sect nodded his head, “That’s right! You had borrowed the God Fire of the Kunlun God Sect to refine your mystic skills, so these are the three people we are sending in for the treasure ground exploration this time around. Our sect hopes that you can keep your word.”</p><br/><p>“That’s of course. I, Qin Shengjun, am a man of my words. In the treasure ground, the sort of encounters they face will depend on their affinity. I will not take their lives. But, if they dare to resort to any form of trickeries, then don’t blame me, Qin Shengjun, for being ruthless.” Qin Shengjun said coldly.</p><br/><p>The three people recommended by the Kunlun God Sect were all Grandmaster Candidates. But when they looked at Qin Shengjun, even they could feel their hearts sinking.</p><br/><p>So strong!</p><br/><p>The three of them did not have a weak cultivation state, and were powerful beings who reigned over a part of the Endless Mainland as well. But, in the face of Qin Shengjun, they could feel as though the powers in their bodies were freezing up, unable to flow properly.</p><br/><p>“I’ve already instructed them before coming here. Once they enter the treasure ground, they will separate from you and not disturb you.”</p><br/><p>This time around, their main priority of entering the treasure ground was not to hunt some precious treasure of anything within it. The strength of this Qin Shengjun was supernatural, and he was incomparably familiar with this treasure ground. He would definitely not leave anything behind.</p><br/><p>Therefore, the main motive of the Kunlun God Sect’s Grandmaster was for these three disciples to go survey the place properly and see if they could make out who the person who had left this treasure ground behind was, or perhaps if there were any loopholes in that place. Of course, if they could have the affinity to meet any form of treasure encounter or whatnot, that would be for the best as well.</p><br/><p>These three disciples were pretty famous outside.</p><br/><p>Ancestor Immortal Jiu Li, Jin Jiuli.</p><br/><p>Golden Immortal Kun Dong, Zheng Qiankun.</p><br/><p>Fairy Bi Liu, Yu Xiao’er.</p><br/><p>Even though they were renowned in the outside world, in front of Qin Shengjun, they did not dare to even breathe heavily.</p><br/><p>“That would be the best.” Qin Shengjun nodded his head before flicking his robes aside and bringing the three of them into the void. There was still quite some distance between this place and the treasure ground after all.</p><br/><p>…</p><br/><p>Lin Fan followed Mo Qingxuan and the others in the void. He did not know just where this treasure ground was, but in the past few days, they must have had already traveled an extremely large distance.</p><br/><p>“It’s just right up ahead.” Mo Qingxuan finally spoke up just as Lin Fan was wondering.</p><br/><p>Lin Fan glanced over, finding it to be an extremely normal place; however, there seemed to be something wrong with the dimension. If not for the fact that he was already at this cultivation state, even if he passed by this place, he would not have discovered that there were some signs of overlap of the void in this dimension.</p><br/><p>“This place seems pretty plain. How could it be some huge treasure ground?” Lin Fan asked.</p><br/><p>“Even though this place looks normal on the surface, one would require a key to enter the treasure ground. And just so, I happen to have a key with me here. While it’s just a small part of it, it can still open up the doors of the treasure ground and lead us in.” Mo Qingxuan replied.</p><br/><p>At this moment, Mo Qingxuan took out a crystal shard that was only the size of her fingernails. There was nothing special about this crystal shard, yet there was a mysterious aura emanating from it. This was an aura that Lin Fan had never experienced before.</p><br/><p>“This is?”</p><br/><p>“This is a key item to be used for entering this treasure ground. Without this, no matter how strong you are, one will never be able to enter the treasure ground.” Mo Qingxuan continued.</p><br/><p>“Rumors have it that this is an endless space, the largest treasure ground out there, with an infinite number of treasures. Even though there is no one who has entered here before, there would be no smoke without a fire. Hence, there must be some truth to those rumors.” The burly man said.</p><br/><p>“The largest treasure ground!” Lin Fan was a little taken aback and excited at the same time. He wondered what sort of things this treasure ground would actually contain.</p><br/><p>“It’s about time. I think we should head in now.” Mo Qingxuan spoke up.</p><br/><p>Lin Fan’s heart skipped a beat, feeling that something dangerous was about to happen.</p><br/><p>Mo Qingxuan did not say anything more. She channeled her powers, and with that, the little crystal shard burst with a beam of light that struck out into the dimensions of the void.</p><br/><p>With that, a tear ripped open in the void. It couldn’t be considered big, and could only accommodate one person at a time.</p><br/><p>“Who’s going in first?” Lin Fan had no issues about it. However, he knew that Mo Qingxuan would definitely not be that kind-hearted.</p><br/><p>Even though he hadn’t come across the Suppressing Demons Heaven Faction yet, who would believe that a Demonic Sect would actually be so kind-hearted to inform others about discovering a treasure ground? Did they really think that people out there were fools?</p><br/><p>But, no matter whether others bought it or not, Lin Fan did not buy it.</p><br/><p>They must definitely be plotting something.</p><br/><p>“I’ll head in first.” Mo Qingxuan said before turning into a streak of light and entering.</p><br/><p>At this moment, Lin Fan looked at the burly man, and then at the two others behind. The burly man did the same and revealed a smile. However, those pearly whites of his seemed extremely frightening.</p><br/><p>“Do you know who I am?” The burly man said.</p><br/><p>“No idea! Come on, share with me what your background is.” Lin Fan chuckled and asked.</p><br/><p>“I am the Hall Master of the Extreme Evil Hall in the Suppressing Demons Heaven Faction, Hall Master Black Demon.” Hall Master Black Demon said condescendingly.</p><br/><p>Lin Fan patted the shoulder of the Hall Master Black Demon, “I heard that the Extreme Evil Hall of the Suppressing Demons Heaven Faction is extremely horrifying! All the mystic skills that you guys cultivate are completely inhumane and terrifying!”</p><br/><p>“It’s good that you know.” Looking at how the other party was patting his shoulder, Hall Master Black Demon smiled.</p><br/><p>“Yes.” Lin Fan nodded his head. All of a sudden, he stabbed out toward the stomach of the Hall Master Black Demon.</p><br/><p>Pshew!</p><br/><p>“That move is useless now.” The Hall Master Black Demon grabbed onto Lin Fan’s wrist and revealed a smile.</p><br/><p>Lin Fan blinked his eye, “That seems to be the case. I think that move is definitely useless now. But, it’s not like that’s the only move I know.”</p><br/><p>“Huh!” The Hall Master Black Demon was stunned as he suddenly felt his head going giddy.</p><br/><p>Out of nowhere, the palm that Lin Fan had rested on Hall Master Black Demon’s shoulder suddenly grasped a brick which he used to slap out on the back of the latter’s head.</p><br/><p>With that, the hand that the Hall Master Black Demon used to grip onto Lin Fan’s wrist loosened up.</p><br/><p>Lin Fan then held up the body of the Hall Master Black Demon. With a twist of his wrist, he stabbed down subsequently.</p><br/><p>“Even though it was useless at the start, it’s useful again now!” Lin Fan smiled brilliantly.</p><br/><p>Once.</p><br/><p>Twice.</p><br/><p>Thrice!</p><br/><p>Every single stab was ever so pleasurable.</p><br/><p>“Do you guys really think that I’m stupid? Even if you guys don’t make a move first, I’m definitely going to make MY move first! The one who strikes first get the advantage, and the one who strikes last loses out. How can you guys call yourselves a Demonic Sect without even knowing that logic?” Lin Fan giggled.</p><br/><p>The other two who were standing by the side looked at everything before them with fear. Their hearts were filled with an endless amount of horror, as though they had just seen a ghost.</p><br/>\n</div>"}