{"title": "Chapter 1055 - Who's Afraid Of Whom?", "id": 1055, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1055-whos-afraid-of-whom", "volume_title": "Volume 11", "body": "<h1>Chapter 1055 - Who's Afraid Of Whom?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1055: Who’s Afraid Of Whom?</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_The burly man felt some hesitation in his heart. This man had killed a Grandmaster Candidate of the Kunlun God Sect, sowing a grudge with them in the process. If they were to get too close with this guy, they might end up attracting some trouble for themselves.</p><br/><p>However, since the madam did not seem bothered by it all, he naturally did not say anything more either.</p><br/><p>The death of Long Jinfei did not cause too much of a commotion. It had only spread out in a small area centered around where he was because there was no earthshattering battle. For him to die in three mere stabs as an Ancestor Immortal state being was something that seemed absolutely impossible and unreal.</p><br/><p>Ancestor Immortal state beings could be considered as indestructible existences. Even if their bodies were smashed into smithereens, their consciousness would be able to escape. But, with those three stabs of Lin Fan, consciousness aside, even Long Jinfei’s Laws of Ancestor Immortal state were all totally erased from existence.</p><br/><p>“This is a pretty decent place indeed.” Lin Fan looked around at his surroundings and lamented.</p><br/><p>It might take some time before the death of Long Jinfei would be relayed back to the Kunlun God Sect. As for now, Lin Fan wasn’t afraid in the least bit. What would come would eventually come anyway. While he could still try to dodge it, there was no reason why he should have to live life so tiringly.</p><br/><p>“Please hold your steps.” At this moment, a voice rang out.</p><br/><p>Lin Fan turned his head around and looked at the few people before him. His gaze was especially fixated on the token hanging at the waist of the shawled woman, which read ‘Suppressing Heavens Demon Faction’.</p><br/><p>“What’s up?” With a quick glance, Lin Fan could tell that the cultivation states of those few people were pretty strong. This was especially the case for the burly man standing at the back. To think that he would be an Ancestor Immortal state upper level being!</p><br/><p>As for that shawled woman, her cultivation state was at the Ancestor Immortal lower level. The rest of them weren’t really worth Lin Fan’s attention, mere Golden Immortal ants. Heck, they weren’t even full cultivation state beings.</p><br/><p>The woman spoke up while chuckling, “For someone to be able to still walk around so carefreely after killing the Grandmaster Candidate of the Kunlun God Sect, this IS the first time I’m coming across something like this.”</p><br/><p>Lin Fan shrugged his shoulders, “It’s nothing much, I suppose. Although, what do YOU guys want?”</p><br/><p>“Nothing much either! Just wanna make friends, I suppose.” The woman replied nonchalantly.</p><br/><p>Right now, Lin Fan had an urge to chop the other party to death. Not only were their cultivation states pretty decent, they were even people of Demonic Sects. Even if he were to chop them to death, it would be exacting justice for the Heavens, and he wouldn’t even have to feel bad in his consciousness. Who knew, he might even be thanked for it!</p><br/><p>But of course, those were just mere thoughts in his mind. Given the Ancestor Immortal upper level cultivation state of that burly man, things might not be that easy.</p><br/><p>On the surface, his aura looked calm and unassuming. However, there were black lines intertwined on his body, with an extremely formidable aura cruising through as though he had cultivated some unparalleled mystic skill.</p><br/><p>“Making friends is fine as long as you guys aren’t afraid to die. So, may I ask for your name, beauty?” Lin Fan chuckled out.</p><br/><p>The burly man was enraged immediately, “Insolent! Mind your tone!”</p><br/><p>“Aiyoh! Pretty high class, aren’t we? Even though an Ancestor Immortal upper level cultivation state is pretty decent, it’s not exactly impossible if I want to kill you as well. Therefore, YOU had better mind YOUR tone!” Lin Fan glanced over at the burly man, unaffected by him in the least bit.</p><br/><p>Even though if they were to talk about strength, he truly might not be able to kill the other party, this big rockhead seemed a little dumb.</p><br/><p>“Shut up!” The woman scolded out. The burly man glared at Lin Fan with an angry expression before moving to the back without saying anything anymore.</p><br/><p>“Mo Qingxuan.”</p><br/><p>“Decent name. Remember mine: Lin Fan.” Lin Fan replied.</p><br/><p>When that name was said out, the face of the initially angry burly man changed, “You are that person who had taken down the Kunlun God Mountain!”</p><br/><p>“Grandmaster Candidate of the Heaven and Earth Sect, Lin Fan!”</p><br/><p>“Huh!” Lin Fan was stunned. The issue of Your Daddy taking down the Kunlun God Mountain should not have been known by too many people, right? Could Tian Fengling be the one who had publicized the news himself?</p><br/><p>But, how magnanimous of a heart must he have to spread it to the world after being f*cked over by someone? This guy was amazing! Lin Fan could not help but feel impressed toward him.</p><br/><p>Mo Qingxuan chuckled out with a jingle, “To think that a Grandmaster Candidate of the Heaven and Earth Sect would have such guts to f*ck over the Kunlun God Mountain of the Vice Grandmaster from the Kunlun God Sect, Tian Fengling. Not only that, you still dare to use your real name out in the open! This maiden is impressed with you.”</p><br/><p>Lin Fan wasn’t bothered at all, “If one has got the skills, what need is there to hide oneself? If I wanted to hide from the very beginning, I wouldn’t have done what I did.”</p><br/><p>Mo Qingxuan was slightly taken aback before laughing out.</p><br/><p>“Speak then, just what do you guys want? There’re only two types of people I know in the world outside…The first are strangers, and the second are foes.” Lin Fan said.</p><br/><p>“Interesting! For us stepping forth this time around, the first reason is that we wanted to see for ourselves just what sort of a character would have the guts to kill a Grandmaster Candidate of the Kunlun God Sect. The second reason is that I would like to cooperate with you.” Mo Qingxuan replied.</p><br/><p>Lin Fan LOVED cooperating with others. However, in collaborations as such, there would usually be nothing good that coming out. Eventually, both sides would definitely come at the other’s throats.</p><br/><p>“Cooperation? I love it! Just what is this all about? If there’s any good to be gained out of it, I don’t think I would really mind.” Lin Fan asked.</p><br/><p>“I’m afraid that this is an inconvenient place to carry on with this conversation. How about we follow up with this chat in a shop?” Mo Qingxuan suggested.</p><br/><p>“Alright.”</p><br/><p>…</p><br/><p>Within a shop…</p><br/><p>“You’re referring to a treasure ground where you want me to go with you guys as a companion?” Lin Fan was startled. To think that something this good would exist!</p><br/><p>“Naturally, this is a treasure ground which only Qin Shengjun of the God Essence Sect knows about. Well, other than him, I do know a little about it as well. But compared to Qin Shengjun, there really is a world of a difference.” Mo Qingxuan said.</p><br/><p>“Huehue.” Lin Fan chuckled out as he started scheming in his heart. There must be some catch to this for sure. If there was really some great treasure awaiting, would they want to share it with him just like this?</p><br/><p>“Sure, no problem. We can cooperate on this.” Lin Fan agreed immediately without having to think twice.</p><br/><p>No matter what sort of tricks these guys were plotting, it was of no use against him. As long as he were to arrive at the destination, he would act solo.</p><br/><p>Mo Qingxuan was stunned before chuckling out, “Alright! Since that’s the case, we’ve got a deal then.”</p><br/><p>It was ultimately decided that they would move out the next day.</p><br/><p>…</p><br/><p>“Madam, Qin Shengjun has headed over to the Kunlun God Sect to borrow their God Fire and refine his mystic skill, and has permitted three slots for the Kunlun God Sect’s side. Things might get a little tricky then. This is especially the case with this fella we just met. A single look and one can tell that he’s no kind soul. Why do we have to keep such an unpredictable element around us? Even if you respect his strength, Madam, is there a need to keep someone as dangerous as him by our side?”</p><br/><p>Mo Qingxuan smiled. However, that smile bore with it a frosty undertone, “Respect? Initially, I had only wanted to see for myself just what sort of capabilities this person had. But, now that I’ve confirmed that he is a disciple of the Heaven and Earth Sect, I’ve got yet another plan bubbling in my mind. If this can work out, things might just have a really different outcome.”</p><br/><p>Looking at how contemplative Mo Qingxuan was, the burly man then broke out into a smile as though he had finally understood the connection between everything she had done.</p><br/><p>On another side of the city…</p><br/><p>Lin Fan was sitting cross-legged. Right now, his cultivation state was at the Golden Immortal full cultivation state, just that step away from reaching the Ancestor Immortal state. If he could raise his level up, he would be able to kill any gods or buddhas that would come in his path.</p><br/><p>As for those big sects, anyone below the position of a Vice Grandmaster would be killed by Lin Fan in a single punch.</p><br/><p>And this time around, Lin Fan had seized the opportunity.</p><br/><p>Be it the Kunlun God Sect or the Suppressing Demons Heaven Faction, he would have to slaughter all of them without letting anyone off. The astronomical experience points were what Lin Fan truly required.</p><br/><p>Wanting to take him to the treasure ground? Didn’t they just want to scam him to death?</p><br/><p>‘If they want to do so, come on then! Who’s afraid of whom?’</p><br/>\n</div>"}