{"title": "Chapter 1057 - Let's Stick Together!", "id": 1057, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1057-lets-stick-together", "volume_title": "Volume 11", "body": "<h1>Chapter 1057 - Let's Stick Together!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1057: Let’s Stick Together!</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_Run!</p><br/><p>This was the only thought they had on their minds right now. In their eyes, this man was even scarier than anyone from the Demonic Sects.</p><br/><p>His methods were unnatural, and left one with no chance to live at all.</p><br/><p>“Don’t run! Let me chop you guys to death!” Lin Fan yelled out as he took out his Eternal Axe and swung it furiously. A streak of axe flash sliced out across the Heaven and Earth.</p><br/><p>Urgh!</p><br/><p>As he sliced at the both of their bodies, it didn’t matter even if they were Golden Immortal powerful beings. Nothing would work at all to stop the axe.</p><br/><p>The two of them stood tall between the Heaven and Earth before their upper bodies started sliding down, splashing blood all over the place as they were cleaved into two.</p><br/><p>Bam!</p><br/><p>In the next instant, they exploded out and turned into dust.</p><br/><p>‘Ding… Congratulations on killing Ancestor Immortal upper level powerful being.’</p><br/><p>‘Ding… Congratulations on killing Golden Immortal powerful being.’</p><br/><p>…</p><br/><p>As expected, the experience points skyrocketed rapidly.</p><br/><p>Especially after killing that Ancestor Immortal upper level being, Lin Fan was just that bit of experience points away from a breakthrough. But, it was alright; there were going to be a lot more opportunities awaiting him inside.</p><br/><p>Coming next to the corpse of Hall Master Black Demon, Lin Fan’s god tiered technique, Bare Nudeness, was deployed instantly to strip him naked. Swinging down his axe, he then chopped off the guy’s head and held in it his hands while walking toward that tear in the void.</p><br/><p>Right now, the tear in the void wasn’t sealed yet. Evidently, Mo Qingxuan must be holding onto it from within.</p><br/><p>Standing before the tear, Lin Fan’s lips curled into a grin. This time around, things were getting bloody interesting.</p><br/><p>To think that he would be marked by the other party. There must definitely be some plot behind this. Could it be because of the Kunlun God Mountain?</p><br/><p>Thinking left and right, he found it to probably be the most valuable item he had right now which everyone seemed to know about.</p><br/><p>Not only was the Kunlun God Mountain a Supreme Grade Immortal Weapon, but it was also an item of Tian Fengling’s true body. If any ordinary person were to find out about it, they would definitely want to get their hands on it.</p><br/><p>However, this Mo Qingxuan must be thinking of taking the middle path to slowly scam it out of Lin Fan.</p><br/><p>According to his calculations, Mo Qingxuan must have definitely set up a death trap on the other end of the tear.</p><br/><p>Within the treasure ground…</p><br/><p>Mo Qingxuan had set forth all the power from a single Middle Grade Immortal Weapon. This Middle Grade Immortal Weapon was a sword formation that possessed an unparalleled offense and defense. As long as that fella were to enter along with Hall Master Black Demon, forcefully killing him shouldn’t be an issue at all.</p><br/><p>“Eh? Why are they so slow?” Mo Qingxuan’s eyes were filled with confusion, not knowing what had happened. In theory, the other party should have entered by now.</p><br/><p>Ever since she found out that the other party had murdered a Grandmaster Candidate of the Kunlun God Sect, Mo Qingxuan’s interest was piqued. If it were an ordinary person, she would have thought of using the other party properly, but would never ever reveal the secret of the treasure ground.</p><br/><p>But, when she found out that the person who had murdered Long Jinfei was the same person who had taken down the Kunlun God Mountain, Mo Qingxuan’s heart skipped a beat, knowing that this was definitely no usual situation.</p><br/><p>After all, that person had the Supreme Grade Immortal Weapon, the Kunlun God Mountain!</p><br/><p>The Kunlun God Mountain was an Immortal Weapon of the true body of Kunlun God Sect’s Vice Grandmaster. At the same time, it was an Immortal Weapon that stabilized and held the Kunlun God Sect’s fortune. If any ordinary person were to obtain it, wanting to soar into the Heavens wouldn’t be a tall task. And, if SHE were to get it, then her cultivation state would definitely skyrocket, and wanting to enter an even higher cultivation state wouldn’t be that difficult either.</p><br/><p>Therefore, she decided to divulge the secret of the treasure ground straightaway, hoping that the other party would be interested.</p><br/><p>At the same time, after revealing this big secret, she had already thought of her backup plan. If the other party did not believe in her words, she would then make her next move to convince the other party of it.</p><br/><p>But, the moment Lin Fan agreed to it without having her to resort to her backup plan, she found it to be absolutely tyrannical!</p><br/><p>Right now, Mo Qingxuan was getting a little flustered. It had been such a long time now, and yet they were not here. Could there have been some issues?</p><br/><p>However, that shouldn’t be right. The Hall Master Black Demon wouldn’t strike at him outside.</p><br/><p>And just as Mo Qingxuan was still busy worrying about it, there was some activity within the tear in the void.</p><br/><p>Mo Qingxuan’s heart leaped with joy.</p><br/><p>Pshew!</p><br/><p>Instantly, a ball of light bolted out of the tear in the void.</p><br/><p>Mo Qingxuan was stunned as though she had yet to react to it. But, by the time she snapped to her senses, her entire face changed and turned frightfully pale as she glared at everything before her in horror.</p><br/><p>Bump, bump.</p><br/><p>The sounds of a ball rolling across the ground arose. But when the ball came to a stop, it turned to be a head! To think that it was the head of the Hall Master Black Demon!</p><br/><p>Those pair of eyes which were wide open and filled with grievances were imprinted deep into Mo Qingxuan’s mind.</p><br/><p>How could this be…!</p><br/><p>However, before she could even react, Lin Fan appeared right before her face.</p><br/><p>“What’s wrong?” Patting on her shoulders, he asked right away.</p><br/><p>Gulp!</p><br/><p>Mo Qingxuan swallowed her saliva and looked at him in the utmost horror, as though she could not believe everything she was seeing right now.</p><br/><p>Lin Fan chuckled out and raised his hand to tear away Mo Qingxuan’s shawl, “Say, why is a woman like you always wearing her shawl? Oh boy! Pretty decent, eh? Why are you hiding left and right when you’re so beautiful?”</p><br/><p>“Y-You…!” By now, Mo Qingxuan was starting to stammer in her speech because of the fear.</p><br/><p>The Hall Master Black Demon was an Ancestor Immortal state being! How could he die just like that!</p><br/><p>“Don’t mind me now. That guy had been getting on my nerves for a while now, so I decided to just kill him casually before coming in. You wouldn’t mind, would you?” Lin Fan asked.</p><br/><p>Mo Qingxuan’s body froze up, not knowing how to reply. This was truly the first time she was coming across such a situation.</p><br/><p>“Do you mind or not? No matter what, he is one of your men. Now that I’ve chopped him up, if you’re feeling unhappy in your heart, do voice it out. I’m a really democratic person!” Lin Fan chuckled.</p><br/><p>Mo Qingxuan looked at Lin Fan, especially at that smile of his and those two rows of pearly whites. She could not help but feel her heart tensing up.</p><br/><p>She was only at the Ancestor Immortal lower level, while the Hall Master Black Demon was at the Ancestor Immortal upper level. If even the Hall Master Black Demon were not a match for Lin Fan, then what did she even amount to?</p><br/><p>“No.” Right now, Mo Qingxuan was feeling immensely regretful. Why would she harbor such thoughts back then? Right now, she was giving herself to him without even knowing what the other party was intending to do!</p><br/><p>“Ah, it’s good that you don’t mind! As I was saying, people from Demonic Sects only care about themselves, and everyone else can just die, right? A single look at that Hall Master Black Demon was enough for me to know that he was no good guy. Therefore, I chopped him to death, and that was that. It’s just that who in the world are you?” Lin Fan asked out. This tone of his made it sound like both of them were good buddies.</p><br/><p>“I-I…I am the daughter of the Faction Leader of the Suppressing Demons Heaven Faction.” Mo Qingxuan replied.</p><br/><p>“Oh! You’re a Missy! No wonder! I was wondering why the Hall Master Black Demon would be so respectful toward you when his cultivation state is so much higher than yours!” Lin Fan remarked.</p><br/><p>Mo Qingxuan did not reply. But, at this moment, her body jerked intensely. Lin Fan hugged her with a single hand as the both of them walked side by side.</p><br/><p>“Come, come! A single look and one can tell that this treasure ground is pretty extraordinary! We’ve got to stick closer now! In that way, if there’s any danger, we can at least look out for one another!” Lin Fan chuckled.</p><br/><p>But after taking a step, he raised his head, “Say, this sword formation is pretty peculiar! To think that it would be equivalent to a Middle Grade Immortal Weapon once grouped together! What is this for? Did you meet some trouble?”</p><br/><p>Mo Qingxuan could not figure out what the other party wanted at all right now. But despite that, she replied while trembling, “That’s right. I met with some slight troubles just now.”</p><br/><p>As he slapped out with his palm, the entire sword formation dispersed and turned into thumb sized flying swords.</p><br/><p>“I like this thing! As the Missy of a big faction, I’m sure you wouldn’t care much for something like this, right?” Lin Fan swallowed the entire Middle Grade Immortal Weapon and chewed it a few times.</p><br/><p>Crunch, munch, nom… Not much taste to it…</p><br/><p>Mo Qingxuan looked at Lin Fan with an aghast expression, as though she had just seen a ghost. To think that he would devour an entire Middle Grade Immortal Weapon in just a single mouthful! At the same time, she had lost all connection between it and her body.</p><br/>\n</div>"}