{"title": "Chapter 1061 - Pill Planet", "id": 1061, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1061-pill-planet", "volume_title": "Volume 11", "body": "<h1>Chapter 1061 - Pill Planet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1061:</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_</p><h3></h3><br/><p>In the deepest region of the treasure ground, Qin Shengjun’s eyes shone with a crazed look.</p><br/><p>“HAHA! Unexpected! Truly unexpected! To think that this place was actually left behind by my previous incarnation! HAHAHA…!” Qin Shengjun would have never ever guessed that there would be this much of a relationship between him and this treasure ground, for it to actually be left behind by his previous incarnation before he fell! His entire lifetime’s worth of treasures were all sealed here, awaiting him to come and collect them in this lifetime!</p><br/><p>“Damned God Essence Sect and that Kunlun God Sect as well! They’ve been coveting after the treasures of I, Qin Shengjun, the entire time. Once I regain my strength, I’m going to take all of you down so that you guys will have to grovel under my feet like dogs for all eternity!”</p><br/><p>Ever since Qin Shengjun entered the treasure ground, there was a voice beckoning toward him from the unknowns. And now that he arrived here, he was connected to a trace of consciousness which allowed him to know everything.</p><br/><p>He was the Old Ancient Immortal King, an Immortal might that swept across the entire world, being absolutely unrivaled. It was just that when he was rushing to break through the Heavenly Lord state, he failed in the blink of an eye, leaving nothing but a single trace of his consciousness to allow him to reincarnate.</p><br/><p>Now that he had received this trace of consciousness here, he regained a large part of his memories from his previous life, and gained a myriad of unparalleled mystic skills.</p><br/><p>But right now, his main priority was to refine this treasure ground entirely. This treasure ground was the treasure of his own life. As long as he could refine it, everything within this place would return to him, and he would be able to ascend to that throne of his pinnacle once more.</p><br/><p>At the depths of the ground sat an actual throne. Qin Shengjun went to sit on it directly before closing his eyes and starting to refine the treasures. He wanted to refine the entire treasure ground and wield control over everything within it.</p><br/><p>Elsewhere…</p><br/><p>“We’ve been scammed by Qin Shengjun! He was waiting for us here intentionally so that we would fall right into this trap!” Ancestor Immortal Jiu Li yelled out as he crushed a single living being with his arm.</p><br/><p>There were uncountable living beings here, all having a cultivation base of at least Golden Immortal realm. Some of them were even Ancestor Immortal beings.</p><br/><p>No matter how strong they were, it was still pretty difficult for them to continue holding out.</p><br/><p>No one knew for how long these living beings had been here in this place. Even though they had not cultivated Laws of Golden Immortals or Ancestor Immortals, they had the advantage in numbers. If this were to continue on, it was hard to be sure that they would not get killed here.</p><br/><p>“Damn it…!”</p><br/><p>…</p><br/><p>At this moment, Lin Fan was just roaming around everywhere with Mo Qingxuan after having suppressed those seven Supreme Grade Immortal Weapons. Wherever he passed by, he pillaged.</p><br/><p>‘Just whose treasure ground is this? This is way too abundant, isn’t it? Wherever I go, the place is filled with treasures! How scary is this!’ Right now, this was the only thought on Lin Fan’s mind. If any ordinary person were to catch sight of a situation as such, they would definitely be scared into peeing.</p><br/><p>Horrifying! Way too horrifying!</p><br/><p>A treasure ground as such? If he had not come here personally, he would not have dared to imagine.</p><br/><p>Items without masters were just flying all around the sky. One did not even know where the beginning of it all was.</p><br/><p>As for the Legendary Items for crafting weapons, they were practically just meteorites floating around this entire cosmos.</p><br/><p>“So fragrant…!” Lin Fan took a sniff, “This is the fragrance of pills!”</p><br/><p>Mo Qingxuan truly felt like dying right now. She knew that she was going to die due to the impact of her stupidity.</p><br/><p>Why in the world did she have to hanker after that Kunlun God Mountain or whatnot and end up messing with this frightening man? If they had come here themselves, how wonderful would that have been! The amount of treasures here were simply heaven revolting! Even that Kunlun God Mountain would not be able to compare with it all!</p><br/><p>Out of all those Legendary Items for crafting weapons that were floating around the sky, if she could even obtain even a single one, she would have been rich! Hell, even a single item from amongst those seven Supreme Grade Immortal Weapons from earlier on would be totally outrageous!</p><br/><p>As they landed on a particular planet, they were just totally stupefied by the scene before them. Mo Qingxuan was even clutching at her chest as though she was having difficulty breathing right now.</p><br/><p>“T-This…!” Mo Qingxuan’s eyes shone with utmost horror as though she had just seen a ghost.</p><br/><p>The surface of that planet was filled entirely with pills! There were even countless Pill Spirits were dancing around in cheers!</p><br/><p>Some of the Pill Spirits had taken on a material form and were wielding swords while waving out a series of mysterious sword stances.</p><br/><p>Some of the Pill Spirits were just trying to comprehend the Dao of the Heavens.</p><br/><p>Some of the Pill Spirits were singing out in praise to the Heaven and Earth as though they were trying to obtain its recognition.</p><br/><p>“Lower Grade Immortal Pills, Middle Grade Immortal Pills, Upper Grade Immortal Pills…To think that there would even be Supreme Grade Immortal Pills!” Mo Qingxuan was just totally astounded right now, unable to believe everything she was seeing.</p><br/><p>Just these pills alone were frightening beyond anything else! If they were obtained by a single sect, who knew how many Golden Immortal disciples could be groomed from these pills alone! There might not even be lack of Ancestor Immortal disciples too!</p><br/><p>Lin Fan raised his head over and saw that there was a text character on the planet. This text character was none other than ‘Pill’.</p><br/><p>The text character gave off a mysterious aura that shrouded the entire planet fully. It was as though it was trying to prevent the pills from escaping, or maybe was trying to nurture something.</p><br/><p>At this moment, Lin Fan’s eyes gave a sparkle. He had just discovered something surprising.</p><br/><p>Just earlier on, he caught sight of a pill that dropped down from that ‘Pill’ text character! It was as though all of these pills were being spat out of that ‘Pill’ text character!</p><br/><p>Lin Fan grabbed out at the planet immediately.</p><br/><p>Eh?</p><br/><p>In a flash, Lin Fan was beyond astounded as though he was in disbelief. Outside the planet was a barrier that isolated it from everything else!</p><br/><p>When the pills within saw that someone approaching, they spoke up.</p><br/><p>“Mortal, don’t waste your efforts. This place is protected by the seal of the Lord Immortal King. Given your strength, you will never be able to break through it.” Those Pill Spirits had been sealed here for god knows how many years now.</p><br/><p>From the moment they were born, they had gained sentience of their own. They too had once thought about leaving this place, but they failed every time they tried.</p><br/><p>When Lin Fan looked at those pills, his heart was almost ready to pop out. So many! There were just so many pills here! If he could swallow them all in a single mouthful, how much experience points would that give him?</p><br/><p>He did not dare to imagine…He truly could not imagine!</p><br/><p>His little guts were almost spilling out in anticipation as well.</p><br/><p>This was especially so for that ‘Pill’ text character! It did not seem ordinary in the slightest bit!</p><br/><p>Mo Qingxuan did not even know what to say right now anymore. The blows that she had received today were simply way too huge. If she had not witnessed all of this for herself, she might not have believed it at all.</p><br/><p>…</p><br/><p>Somewhere in the depths, Qin Shengjun was refining the entire treasure ground. He had already known of the fortune that his previous incarnation had left for him.</p><br/><p>A treasure made of a set of seven Supreme Grade Immortal Weapons.</p><br/><p>A limitless supply of pills.</p><br/><p>Within the Heaven and Earth here, there were Legendary Items used for crafting weapons as well.</p><br/><p>All of these things were sufficient to have his cultivation state skyrocket and reach new heights.</p><br/><p>Even though Qin Shengjun’s cultivation state had been rising extremely quickly in the past few years, he knew that his potential was almost used up. Now that he had discovered everything left for him from his previous life, it was practically rendering assistance in his time of need.</p><br/><p>As long as he could refine this treasure ground, he would be able to wield control over everything. Everything in this place would then belong to him.</p><br/><p>“HAHAHA…!” When that thought struck him, Qin Shengjun was overwhelmed with joy.</p><br/><p>…</p><br/><p>Looking at the pill planet before him, Lin Fan only had a single thought: to take it all down. He could make do without the rest of the stuff, but these pills here? He definitely had to get them all.</p><br/><p>“We can’t enter this place. Perhaps we can go check out elsewhere.” Mo Qingxuan suggested.</p><br/><p>Lin Fan sniggered out, “Who says that I can’t get them? Watch how I’m going to toss them into my hotpot!”</p><br/><p>At this moment, Lin Fan was about to display his might.</p><br/><p>Expecting him to give up these many pills before him was practically just dreaming!</p><br/>\n</div>"}