{"title": "Chapter 1066 - Eternal Night Demon Plate", "id": 1066, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1066-eternal-night-demon-plate", "volume_title": "Volume 11", "body": "<h1>Chapter 1066 - Eternal Night Demon Plate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 1066: Eternal Night Demon Plate</h3><br/><p><strong>Translator: </strong>Lam_ <i class=\"_hr\"></i><strong>Editor: </strong>Hitesh_Lin Fan had already thought out the plan to be followed after purifying her. As one of the six factions, Suppressing Demons Heaven Faction had countless powerful disciples within it. Even though there was still some difference compared to something like the Kunlun God Sect, it wasn’t something that the current Lin Fan could not deal with.</p><br/><p>If he could send Mo Qingxuan back into her sect after purifying her so that she could lure out some powerful beings for him to kill, then everything would be worth it.</p><br/><p>“No! You can’t purify me! I’ve got no grudge with you! Why are you purifying me?” Mo Qingxuan’s face was frightfully pale. She would have never imagined that she would have an end like this. This man before her was way too merciless! He would definitely not give anything a consideration!</p><br/><p>The power of purification was way beyond its past level right now. Buddhas danced around the sky while chanting out scriptures. Instantly, the entire Heaven and Earth were filled with a Buddhist light that shone down on the world, suppressing every single evil demon.</p><br/><p>As the daughter of the Faction Leader of the Suppressing Demons Heaven Faction, Mo Qingxuan has had no lack of resources to cultivate with, and had been through countless dangerous situations since young. But even then, she had broken down completely at this moment. In the face of this impending doom, she had no way to defend against it. She could not even summon up the will to fight back.</p><br/><p>“Not killing you is the biggest grace I can afford you. You should be feeling relieved instead of showing me such franticness.” Lin Fan said with an indifferent expression.</p><br/><p>“Purify.”</p><br/><p>As he pointed his finger out, the Purifying Buddha Light formed a Buddha Dragon that coiled around Mo Qingxuan and roared out. Each time the Buddha Dragon roared out, it would spit out countless golden Buddhist texts that possessed an infinite power of purification within them, able to purify one’s spirits, will, and essence. It seemed like every single being would have to bow down under the might of this power of purification.</p><br/><p>While Mo Qingxuan’s cultivation state might not be too weak, in the face of an attack as such from Lin Fan, she was still rendered totally helpless. The barriers to her heart were blown wide apart as the power of purification gushed right in and forcefully started purifying her.</p><br/><p>“NOOOOOO…!” Mo Qingxuan was screaming out at this moment as those exquisite features on her face started showing signs of despair. In fact, tears were even flowing out, “NO! I can’t lose myself just like this! I’ve still got so many things that I’ve not done!”</p><br/><p>“Please let me go! Please, I’m begging you! Please let me off!” Mo Qingxuan’s voice was filled with pleading cries as she hoped that Lin Fan would let her off. However, now that this power of purification had already been deployed, there was no way of going back anymore.</p><br/><p>Placing his hands behind his back, Lin Fan awaited the purification of Mo Qingxuan.</p><br/><p>BOOM!</p><br/><p>But just at this moment, he frowned as though he had met with some sort of a situation.</p><br/><p>When the power of purification entered Mo Qingxuan’s body, it was somehow blocked off by a mysterious power, and was unable to penetrate into the depths to purify her completely!</p><br/><p>A dim light emanated out from Mo Qingxuan’s body, and gradually, her entire body was enveloped by it. As for that horrified Mo Qingxuan, she actually fell into a deep slumber as the aura of her entire body turned mysterious!</p><br/><p>“Who’s there?” Lin Fan’s brows furrowed. He could feel that his power of purification had just been dispelled. This was something that was absolutely incredible in his eyes, something he had yet to encounter ever.</p><br/><p>“Sir…”</p><br/><p>At this moment, a figure floated out above Mo Qingxuan’s head. This figure wasn’t a material body and looked like a sort of consciousness or something.</p><br/><p>For such a figure to reside within Mo Qingxuan’s body was something pretty incredible. The aura emanated from this consciousness was extremely formidable, definitely not something that even mere Ancestor Immortals could compare with.</p><br/><p>“Who are you?” Lin Fan frowned, truly not expecting that something as such would happen.</p><br/><p>He had not expected that the Purifying Buddha Light he had deployed would actually bring out something as such from the body of this chick here.</p><br/><p>This truly had his interest piqued slightly. Only, he wondered what sort of a background this consciousness had.</p><br/><p>And to Lin Fan’s astonishment, that figure actually looked around seventy percent similar to Mo Qingxuan! Or rather, it’d be better to say that Mo Qingxuan looked similar to this figure.</p><br/><p>“I am the mother of Qingxuan.” Ling Jun spoke up.</p><br/><p>At the same time, her gaze toward Lin Fan was filled with bewilderment as though she was trying to see through him.</p><br/><p>“What are you trying to do?” Lin Fan did not know what this fella meant by this. But, if she could take down his power of purification, she definitely had some capabilities.</p><br/><p>“I would like to implore you to spare the life of my daughter, sir. My daughter is someone with a tough life as well. She should not receive so much suffering in her life.” Ling Jun said.</p><br/><p>While Lin Fan would proclaim that he was not a bad person, he wasn’t all that good of a person either. His lips curled into a grin, “It’s not that I can’t let your daughter off. But, what do you have that you can take out in exchange?”</p><br/><p>Ling Jun looked at Lin Fan and pondered slightly. She then lifted her palm as a spot of light floated out gently.</p><br/><p>“Would it do if I were to use this item to exchange for the freedom of my daughter?” Ling Jun’s voice was calm, but she could not hide a trace of begging in her tone.</p><br/><p>Lin Fan grabbed the item in his hand, which turned out to be a bead.</p><br/><p>‘Ding… Congratulations on discovering Eternal Night Demon Plate.’</p><br/><p>‘Eternal Night Demon Plate: Part of a treasure backing the strength of the Suppressing Demons Heaven Faction, the Source of Heaven Dao’s Reincarnation.’</p><br/><p>Lin Fan raised his head over as his face was somewhat perplexed, “Who exactly are you? By the looks of it, you don’t seem to be a human, right?”</p><br/><p>Ling Jun smiled out softly, “You’ve got a keen eye, sir. I am truly not a human. I am a Weapon Spirit. In fact, right now, I’m nothing more than a trace of consciousness.”</p><br/><p>Lin Fan was taken aback and slightly surprised, “Haha! To think that you would be the consciousness of a Weapon Spirit! If she is your daughter and the daughter of the Faction Leader of the Suppressing Demons Heaven Faction, doesn’t that make you the wife of the Faction Leader of the Suppressing Demons Heaven Faction?”</p><br/><p>The moment Ling Jun heard those words, a weird look flashed through her eyes. But at this moment, she did not say anything more. She did not wish for others to know about this matter. Thus, this was the most she could do.</p><br/><p>Right now, she was only a trace of consciousness that could disappear at any moment. Dispelling the Purifying Buddha Light in Qingxuan’s body was already the maximum her powers could do right now. If the other party truly wanted to kill Qingxuan, there was no way she could stop him.</p><br/><p>“Good! I’m someone who loves making deals the most. This item is something I’m really satisfied with, and will do for you to buy your daughter’s life. Although, that treasure that is backing the strength of the Suppressing Demons Heaven Faction, the Heaven Dao Reincarnation, is located in the depths of the Suppressing Demons Heaven Faction. Wanting to even come into contact with it is something that’s more difficult than difficult itself.” Lin Fan said.</p><br/><p>This Eternal Night Demon Plate was a core item of Heaven Dao Reincarnation; being in possession of this core item would mean that he would have a chance to wield control over that Heaven Dao Reincarnation. However, things were not as simple as they seemed. He would probably have to make a trip over to the Suppressing Demons Heaven Faction once he was stronger to try and snatch this Heaven Dao Reincarnation over.</p><br/><p>Rumors had is that this Heaven Dao Reincarnation was a treasure that surpassed even Supreme Grade Immortal Weapons, and possessed a supernatural amount of power.</p><br/><p>“Many thanks, sir.” Ling Jun heaved a sigh of relief before bowing over slightly in gratitude.</p><br/><p>“You don’t have to thank me. But, I think you had better let your daughter know that she should not spread the word about this.” Lin Fan said.</p><br/><p>“Don’t worry, sir. I will seal every related memory, so that she will definitely not bring any troubles for you, sir.” Ling Jun replied.</p><br/><p>Lin Fan looked at Mo Qingxuan one last time before taking his leave. This was the biggest compromise he could agree to.</p><br/><p>If he had truly wanted to kill the other party, that wouldn’t be impossible either. But, the type of troubles it would lead to was not something he was fully cognizant about.</p><br/><p>Anyway, obtaining a valuable item like this was still pretty surprising for him.</p><br/>\n</div>"}