{"title": "Chapter 1078 - Gate Of The Immortal King", "id": 1078, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1078-gate-of-the-immortal-king", "volume_title": "Volume 11", "body": "<h1>Chapter 1078 - Gate Of The Immortal King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Lad, are you really trying to die?” Han Juntian looked over at Lin Fan with a face of stupefaction. This guy was just stirring up a pot of sh*t! Not only that, this was some big sh*t!</p><br/><p>At the moment when the Old Master Qi Tian had asked for this matter to end, Han Juntian knew that it was only a temporary end. He knew that this matter would not be blown over this easily. He had caught wind that there was a Senior Old Master in the Kunlun God Sect who was about to level up to the Heavenly Lord state. If he were to turn into a Heavenly Lord successfully, the tides of the entire Endless Mainland would definitely change entirely.</p><br/><p>After the events of today, the Kunlun God Sect would harbor a deep grudge toward the Heaven and Earth Sect. As long as that Senior Old Master of the Kunlun God Sect were to attain the great Dao of Heavenly Lord, the Heaven and Earth Sect would most likely be the very first sect they would annihilate.</p><br/><p>“Grandmaster, the entire situation is under control right now. How many Senior Old Masters do you think the Kunlun God Sect has?” Lin Fan asked calmly. He had thought a situation like this many times over in his head. As long as this Old Master Qi Tian were to come out, it would be the time for him to perform and shine.</p><br/><p>Han Juntian shook his head, “I’ve got no idea. However, right now, things have gotten truly complex. Don’t get overly brazen now… Otherwise, even I will not be able to bail you out.”</p><br/><p>Lin Fan chuckled out with a nonchalant expression, “Don’t worry! For a paragon such as myself, there’s no way the Old Masters of our sect would sit by idly!”</p><br/><p>Han Juntian looked over at Lin Fan with an entirely exasperated face, implying, ‘Even if that’s the case, you can’t do this still! If the Senior Old Masters were to really not come out, wouldn’t you be dead meat?’</p><br/><p>At that moment, the figure of Old Master Qi Tian appeared between the Heaven and Earth. On that exceptionally handsome face of his was a furious look. The way he looked at Lin Fan was the same as he would look at an ant that had dared to bite him. He was an indestructible, powerful being of the Immortal King state. And yet, an ant as such would dare to blow his consciousness doppelganger apart with the use of an Immortal Weapon’s self destruction! An act as such could only be compensated with the latter’s life.</p><br/><p>“Old Master Qi Tian…” Han Juntian looked over at this gigantic mountain that he could not cross before his eyes. Yet, even though his cultivation state wasn’t comparable to the other party, he showed no signs of fear nevertheless, “My disciple is the one in the wrong in this matter. Please do not take it to heart, Old Master Qi Tian.”</p><br/><p>The name of the Old Master Qi Tian had been around for a long time now. This was a supremely powerful being existing at the peak of the world since several thousand years. In fact, Han Juntian hadn’t even been born back then. In the eyes of Old Master Qi Tian, he was nothing but a young one.</p><br/><p>“Han Juntian, to think that as the Grandmaster of the Heaven and Earth Sect, you could not even take a single small little disciple in hand! Since that’s the case, Your Old Master will help you in disciplining him!” Old Master Qi Tian scoffed out coldly.</p><br/><p>Lin Fan took a step forward, “Old Master Qi Tian! I heard that those of the Immortal King state claim to be indestructible. But I, Lin Fan, am not convinced! Today, we’ll see just what capabilities you hold!”</p><br/><p>“Go and explode…!”</p><br/><p>Two Supreme Grade Immortal Weapons whisked by Lin Fan and bolted right at the Old Master Qi Tian.</p><br/><p>“Hmph, young one!” Old Master Qi Tian snorted coldly as he opened up his palm wide, which started extending out as though intending to cover the complete sky. Those Laws of the Immortal Dao were extremely domineering, such that no one was able to defend against it at all. When the powerful beings who were hidden in the void caught sight of Old Master Qi Tian striking out, they trembled reflexively.</p><br/><p>This was the might of an Immortal King! Even though he wasn’t striking out at them, the power had them enveloped in as well. It seemed as though they could not escape from it no matter where they rushed to.</p><br/><p>Piak!</p><br/><p>Closing his palm, he controlled the two Supreme Grade Immortal Weapons in his hands.</p><br/><p>“Explode!”</p><br/><p>Boom!</p><br/><p>Just at that moment, the two Supreme Grade Immortal Weapons blew up instantly. However, the unfolding situation had Lin Fan slightly taken aback. To think that it would be of no use!</p><br/><p>Lin Fan was truly astounded. For two Supreme Grade Immortal Weapons to blow up in the palm of Old Master Qi Tian without creating a single bit of impact was way too incredulous and unbelievable!</p><br/><p>Was this really the might of an Immortal King?</p><br/><p>“Young one, even though the self destruction of Supreme Grade Immortal Weapons may bring about a mighty force, all of that means nothing in the eyes of a truly powerful being.” Old Master Qi Tian remarked.</p><br/><p>Lin Fan shook his head. So damned bloody powerful! The strength of an Immortal King was truly far from what he could imagine. The fact that two Supreme Grade Immortal Weapons blowing up could not even damage a single hair of his was something that would definitely leave one feeling helpless.</p><br/><p>All of the surrounding spectating powerful beings felt a shock in their hearts as well.</p><br/><p>“The strength of this Old Master Qi Tian is truly horrifying! To think that he wasn’t even harmed by a single bit even with those Supreme Grade Immortal Weapons exploding in his hands!”</p><br/><p>“I’m afraid that lad is most probably going to be dead! His greatest backing comes from those Immortal Weapons. Now that they’re useless against the Old Master Qi Tian, I don’t think he’s got anything up his sleeves anymore!”</p><br/><p>“That’s not certain just yet. Those Senior Old Masters of the Heaven and Earth Sect would not just sit by idly. They would definitely bail out this lad eventually.”</p><br/><p>…</p><br/><p>Qin Shengjun, who was deeply impacted by what happened at the Triple Emperor Heaven Cache, was witnessing everything through an unparalleled mystic skill. Seeing it all, his heart was beyond mortified. Who the hell was this person? How could he be this strong?</p><br/><p>If it were him, he would definitely not have been able to defend against the self destruction of those Immortal Weapons!</p><br/><p>If he were the one facing up against this fella, he might not fare that well either.</p><br/><p>At this moment, Qin Shengjun felt an inexplicable pressure as though his limelight had just been stolen by someone else. Even though he had never ever faced up against this person before, he could not explain why, but he just felt so damned pissed off when looking at this guy. It was as though they had some blood feud with one another.</p><br/><p>“Heaven Slay!”</p><br/><p>Old Master Qi Tian growled out softly as he cleaved down with his palm like a knife, sending a straight cut that slashed out at Lin Fan. But, just as Lin Fan was about to reach for his Legendary Item, Han Juntian stood out and blocked before Lin Fan, “It has been a long time since I’ve fought with a truly powerful being now. Since this is a rare chance, I shall give it a shot then.”</p><br/><p>“Old Master Qi Tian, even though you are an Immortal King, I, Han Juntian, have been roaming about the gates of the Immortal King state for some time now as well. Today, I shall have to taste just how strong someone of the Immortal King state can be!” Suddenly, Han Juntian’s body expanded out as his entire aura burst forth without restraint. In that instant, he deployed countless mystic skills that slammed out at Old Master Qi Tian.</p><br/><p>Looking at Han Juntian, Lin Fan could not help but feel impressed as well. This was truly amazing indeed! Even though his strength was so far off from Old Master Qi Tian, he still had the guts to step up like this! This was so impressive!</p><br/><p>But, since the Grandmaster himself wanted to duke it out with the Old Master Qi Tian, Lin Fan would just have to let him shine as he wanted to then. Later on, if things were not right, it would not be too late for him to step up as well.</p><br/><p>Bam!</p><br/><p>That move of Old Master Qi Tian was blocked out by Han Juntian, causing the void to explode because of the impact. The remnant shockwaves formed rippled out in all directions.</p><br/><p>“So strong…!” Lin Fan acknowledged in his heart. Be it Old Master Qi Tian or Han Juntian, both of them were extremely strong. This was particularly so for Han Juntian though. There was really a reason why he was the Grandmaster of the Heaven and Earth Sect indeed. While his strength was clearly much lower than Old Master Qi Tian, he was still able to hold out in front of the other party! That level of prowess was something that one could not help but be impressed with.</p><br/><p>Old Master Qi Tian took a glance at Han Juntian as his eyes flashed with ruthlessness. Instantly, he channeled out a mystic skill and sent an Immortal King Power crushing out at the latter.</p><br/><p>This Immortal King Power was not to be underestimated as its might spread throughout the entire world.</p><br/><p>Seeing that, Han Juntian’s expression tensed up. That pulsating Immortal King Power enveloped the entire world in it before converging down onto a single point and pushing down on Han Juntian.</p><br/><p>“So, that’s the case! Seems like at the Immortal King state, one is able to replace the Heavens to descend with their might. Seems like I’ve been looking at it wrong the entire time now. But, this is good as well. Let me rise up under this mounting endless pressure to break through everything and enter the Immortal King state!” Han Juntian roared out in laughter as an unparalleled battle intent soared out with him as the center, forming a light beam that sliced through the entire Heaven and Earth.</p><br/><p>Both of Han Juntian’s eyes were fixated on the void as his hands turned illusory before materializing into a single fist that punched through the firmaments.</p><br/><p>“GATE OF THE IMMORTAL KING! BOUNDLESS POWER!”</p><br/><p>“BREAKTHROUGH!”</p><br/><p>Han Juntian bellowed out as he spat out a mouthful of Immortal Qi that materialized into a gate, floating out between the Heaven and Earth.</p></div>\n</div>"}