{"title": "Chapter 1090 - Pillnorexia", "id": 1090, "volume": 11, "url": "http://boxnovel.org/the-strongest-system-chapter-1090-pillnorexia", "volume_title": "Volume 11", "body": "<h1>Chapter 1090 - Pillnorexia</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Even after throwing away those Lower Grade Immortal Pills, Lin Fan did not feel the slightest bit of pain in his heart. All of those Lower Grade Immortal Pills were literally just enough to fill his tooth gaps. Not only that, they didn’t taste all that good either! After popping them, all Lin Fan had was a nauseating feeling.</p><br/><p>But, things were all good right now. The only things floating out in front of Lin Fan were Middle Grade, Upper Grade, and Supreme Grade Immortal Pills.</p><br/><p>In fact, he was actually resisting an impulse to toss away all of these pills. But after deliberating further, he decided against it. All of those Middle Grade Immortal Pills could still provide some experience points, so it would be quite a pity to toss them away. He would just have to force himself a little and consume them.</p><br/><p>Heaven and Earth Sect…</p><br/><p>A disciple was walking outside, about to go exchange for some pills using his Contribution Points. Ever since he had entered the sect, he had worked hard with his own abilities all the way till now to finally accumulate sufficient Contribution Points. This was something that had him feeling particularly excited; he felt that he was still pretty useful.</p><br/><p>Pok!</p><br/><p>All of a sudden, he felt as though he was knocked on the head by something.</p><br/><p>“Who? Who was the one who sneaked an attack on me?” This disciple instantly swung around and looked left and right hurriedly. But to his surprise, none of his senior or junior brothers were around him at all! Then what in the world was the thing that had struck him?</p><br/><p>As this disciple searched left and right, he suddenly caught sight of a little black ball on the ground, looking to be some sort of a pill or something.</p><br/><p>“Eh? That’s weird. What’s this?”</p><br/><p>Picking up the thing, he took a closer look at it while sniffing it with the tip of his nose. Instantly, an extremely rich fragrance pounced right into his nose as the powers within his body rumbled out furiously.</p><br/><p>“Just what in the world is this?” This disciple exclaimed out as though he had just bumped into a ghost!</p><br/><p>But when he caught sight of the Laws of Immortal Dao on the surface of that pill, he was instantly flabbergasted, trembling violently.</p><br/><p>“This…This is an Immortal Pill!”</p><br/><p>Even though he had never ever consumed a single Immortal Pill in his life before, he had definitely seen one! The most significant mark of an Immortal Pill was the presence of Laws of the Immortal Dao around it!</p><br/><p>A single Law of the Immortal Dao meant that it was a Lower Grade Immortal Pill. And right now, what he was holding in his hands was exactly that — a Lower Grade Immortal Pill.</p><br/><p>“Could it be that my, Zhang Dafei’s good fortune has finally arrived? This is literally an Immortal Pill that dropped from the skies!” Zhang Dafei was beyond excited right now as he raised his head. But when he caught sight of the situation up in the sky, he could not help but shout out.</p><br/><p>“IT’S THE ATTACK OF THE IMMORTAL PILLS!”</p><br/><p>A wild howl boomed out into the sky.</p><br/><p>All of the surrounding disciples raised their heads up in a flush. All they could see were little black spots dotting the entire sky, dropping down like raindrops.</p><br/><p>When that fragrant smell of pills spread throughout the sky, it had everyone so rattled that their jaws dropped wide open. This was absolutely unbelievable!</p><br/><p>This single commotion brought about the attention of the inner parts of the sect as well.</p><br/><p>“What? Immortal Pills dropping from the sky in our sect? How could that be possible?”</p><br/><p>Countless people rushed outside to witness the scene. But when they raised their heads, what filled their faces was nothing but shock.</p><br/><p>Immortal Pills had a Spirit to them. Some of them floated out in the void and were just spiraling all around as they willed. However, they could not break through the barriers of the Heaven and Earth Sect no matter what.</p><br/><p>“The Immortal Pills are all coming from over there!” A disciple shouted out while pointing at a mountain peak in the distance.</p><br/><p>“That’s Senior Brother Lin’s mountain peak!”</p><br/><p>“Could this be a gift for us from Senior Brother Lin?”</p><br/><p>“Long live Senior Brother Lin! Senior Brother Lin is the most tyrannical!”</p><br/><p>At this moment, everyone burst out into excitement.</p><br/><p>When the Vice Grandmasters and the elders of the sect caught sight of this, all of them were dumbfounded. These pills were way too horrifying, weren’t they?</p><br/><p>All of them were Lower Grade Immortal Pills! For all of these ordinary disciples, they possessed an incredible effect. Even if they were to consume them, they would not cause them to explode.</p><br/><p>However, there was one thing that they could not understand: why would he toss out so many Lower Grade Immortal Pills?</p><br/><p>After knowing about the situation, Geng Yangtian could only shake his head helplessly as well. Seemed like he had still underestimated the depths of this lad’s resources after all.</p><br/><p>He had not asked this disciple if he had ever gone through any encounters or whatnot — that was a secret of the disciples themselves. Therefore, even though he was a Senior Old Master of the sect, he would not mention about it.</p><br/><p>After all, a disciple like Lin Fan was THE future of the sect.</p><br/><p>Right now, within the mountain peak…</p><br/><p>Lin Fan opened his mouth wide and chomped down, swallowing a whole bunch of pills with that single mouthful. In fact, he didn’t even have to chew as he swallowed them whole.</p><br/><p>All the surrounding Pill Spirits were crying out in fear.</p><br/><p>“Don’t eat us!”</p><br/><p>“Please let us go! We are Pill Spirits and we have our own consciousness! We have a life as well!”</p><br/><p>“Damn it! How dare you eat us! We’re going to fight you with our lives!”</p><br/><p>…</p><br/><p>The Pill Spirits broke out into a huge resistance. However, in the eyes of Lin Fan, all of them were ants. There was no need to bother about any of them at all.</p><br/><p>Every single mouthful caused a huge patch of pills to disappear from the skies. This was something absolutely terrifying.</p><br/><p>‘Ding…Experience Points +200,000.’</p><br/><p>‘Ding…Experience Points +50,000.’</p><br/><p>‘Ding…Experience Points +300,000.’</p><br/><p>…</p><br/><p>“I’ll eat! I’ll eat! Even if I eat till I can’t move at all, I’ll have to continue eating!”</p><br/><p>Lin Fan opened his mouth left and right as he stuffed all the pills inside. This time around, he was truly giving it his all. If he didn’t finish all those pills, he swore that he wouldn’t be considered a human any longer!</p><br/><p>Even though he felt like vomiting, he bore with it and forced that feeling back down his throat.</p><br/><p>“Huff…!”</p><br/><p>He was fighting on with diligence.</p><br/><p>One day passed by…</p><br/><p>In the secret chamber where Lin Fan was in seclusion, there was only a single constant sound being produced, the sound of pills being popped down.</p><br/><p>Two days passed…</p><br/><p>Three days passed…</p><br/><p>…</p><br/><p>Ten days later…</p><br/><p>“No more! I really can’t take it anymore! I’m going to get Pillnorexia soon!”</p><br/><p>Right now, Lin Fan was sweating all over with his face flushed entirely red. It was as though he had held it in for an extremely long time, and could no longer take it anymore.</p><br/><p>If he were to carry on this way, he might become the very first existence in this world who would die from an overdose of pills.</p><br/><p>But the thing was that the words he had declared meant promises that he would have to fulfill even if he had to kneel down! If he didn’t finish the pills, he swore that he couldn’t be considered as a human any longer!</p><br/><p>Looking at the small mountain of pills before him, Lin Fan gritted his teeth and bore with it. No matter what, he would have to finish those pills.</p><br/><p>He looked at the experience points in his System — they had truly risen up by a significant chunk.</p><br/><p>The amount of experience points required to reach the Immortal King state could only be described as terrifying. Lin Fan could only bear with his own sin and forcefully finish the pills.</p><br/><p>The next day!</p><br/><p>Sounds of vomiting!</p><br/><p>Standing straight up, Lin Fan’s entire body was wobbling right now as though he had just gone through some tremendous trauma. His hands and legs had no strength in them while his lips were entirely numb right now. He probably was having no feeling at all.</p><br/><p>He had wanted to vomit out earlier on, but he really held it back in. There wasn’t a single pill left in sight right now.</p><br/><p>His face let out a deranged smile, “HAHAHA…!”</p><br/><p>A crazed laughter came out of his mouth, him almost fainting out from laughing.</p><br/><p>“I’ve finally done it! What sort of an existence am I, Lin Fan?! Who could play with me anymore now that I’ve finished all of these pills?” Lin Fan mumbled out to himself.</p><br/><p>“Don’t eat me! Please don’t eat me!” Suddenly, a voice traveled out into Lin Fan’s ears.</p><br/><p>“Huh?” Lin Fan’s brows furrowed as he looked over at a corner of the walls.</p><br/><p>He saw a single pill hiding there, with the Pill Spirit within quivering in immense fear. Its eyes were clouded with a deep rooted fear as though its heart was no longer functioning after this deep, dark trauma.</p><br/><p>“You…” Lin Fan looked at that pill as his heart skipped a beat.</p><br/><p>“D-Don’t eat me…” The only remaining Pill Spirit could only plead out pitifully.</p><br/><p>When Lin Fan caught sight of that pill, he slammed his palm toward his mouth immediately, clutching it as he supported himself against the wall with his other hand. He was a moment too late, as a mouthful of vomit had already spilled out.</p><br/><p>Lin Fan swept his robes, and an exit burst wide open from the secret chamber immediately, “Scram! Hurry up and scram! Don’t let me catch sight of you ever again…!”</p><br/><p>When the Pill Spirit caught sight of this, it bolted out in a frantic fluster without even having to think twice.</p><br/><p>Scary! Way too scary!</p><br/><p>That demon was way too horrifying! He had swallowed so many of his friends!</p><br/><p>“Not good! I think I’ve really contracted Pillnorexia.” Lin Fan’s heart clenched up, feeling like he was truly sick right now.</p></div>\n</div>"}