{"title": "Chapter 1115 - Training", "id": 1115, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1115-training", "volume_title": "Volume 12", "body": "<h1>Chapter 1115 - Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“This is one hell of a bloody motherf*cking dogsh*t!” Lin Fan stood tall between the Heaven and Earth and cussed out. To think that there wasn’t even a single shadow at the last two places! All of them had run away completely! That was truly one hell of a sh*tfest! However, he could understand the reason why — all of them must have known that he was going to come, and therefore, were hiding away to avoid facing him.</p><br/><p>Naturally, Lin Fan chose to forgive them. Only, if he were to bump into them again, all of them had to be chopped to death.</p><br/><p>“This Black Heavens Demon King Army is pretty decent. However, there’s one big problem with it. Does that Southern Demon Immortal King really think that Yours Truly is an idiot? If something like this was all that an Immortal King could craft, that would be one hell of an embarrassment!” Lin Fan was no fool. If an Immortal King had to craft for such a long time only to create something of this level, that would really be something that he ought to be ashamed of.</p><br/><p>However, it WAS true that something like this could truly only be created by the Southern Demon Immortal King. After all, some of the materials required were pretty special, and exclusive only to the Southern Demon Ocean Regions.</p><br/><p>This Black Heavens Demon King Army looked like they were living beings, but in reality, it was just a treasure, one that could manifest into a human form. Lin Fan was prepared to work with it slightly so that he could give this Black Heavens Demon King Army a boost in its power.</p><br/><p>Heaven and Earth Smelt!</p><br/><p>He tossed the Black Heavens Demon King Army into it right away as the blazing flames burnt to remove any bit of impurities from it. Within the Heaven and Earth Smelt, the Black Heavens Demon King Army was transforming continuously. Thereafter, Lin Fan discovered a trace of the Southern Demon Immortal King’s Will within it — this was the thing that was used by the Southern Demon Immortal King to maintain control over it. As long as this wasn’t purged out, the Black Heavens Demon King Army would always belong to the Southern Demon Immortal King forever, and Lin Fan would only just be making use of it temporarily.</p><br/><p>The Will of an Immortal King was not something that was to be removed so easily. However, in the face of the Heaven and Earth Smelt, there was nothing that couldn’t be purged in this entire world.</p><br/><p>A drop of fire landed onto the Will of the Immortal King, giving off a sizzling, burning sound.</p><br/><p>Within the black mountain, the Southern Demon Immortal King was contemplating about everything that had just happened, and at the same time, thinking about the measures he should take to deal with everything he would be facing in the future. All of a sudden, he felt his heart jerk — his control over the Black Heavens Demon King Army had suddenly disappeared!</p><br/><p>The Southern Demon Immortal King furrowed his brows and bolted upright immediately. “How could this be? To think that that lad would be able to wipe my Will away from it! That is something that’s pretty incredulous now. The Boundless Future Buddha Lord is clearly stronger than this lad, yet he chooses not to have him killed. By the looks of it, there must be something that he’s taking into consideration. Seems like this lad is not someone simple. I must be careful not to fall into the traps of the Boundless Future Buddha Lord either.”</p><br/><p>Within the Heaven and Earth Smelt…</p><br/><p>A black mist was billowing out before changing forms repeatedly, and finally regrouping into that Black Heavens Demon King Army. Its aura was way stronger than before. While it wasn’t at some utterly horrifying state, it was still quite a lot better than its earlier state. At the same time, Lin Fan now had absolute control over the Black Heavens Demon King Army. As for that Southern Demon Immortal King? He could just scram as far as he could at this point.</p><br/><p>“Master.”</p><br/><p>Thud! Thud! Thud!</p><br/><p>The entire Black Heavens Demon King Army dropped to their knees. Every single one of them was at least ten feet tall, and could be described as mini moving mountains. The warhorses that they were riding on were extremely robust, and filled with a mighty disposition.</p><br/><p>“This is what I call something of my own.” Lin Fan smiled out. Indeed, the Southern Demon Immortal King still had some capabilities after all, for him to be able to create something as such. Now that Lin Fan had destroyed the other party’s authority over this entirely, he wondered what that guy must be thinking. However, if he were willing to hand over something as such to Lin Fan, he must definitely be keeping something stronger up his sleeves.</p><br/><p>“Get up.” Lin Fan said.</p><br/><p>“Yes!”</p><br/><p>There were a full 10,000 troops in that Black Heavens Demon King Army. If they were to join forces, they were truly capable of surrounding and trapping any ordinary Immortal King state beings. However, they would not have what it took to have those Immortal Kings killed.</p><br/><p>Lin Fan spread his palm wide open, and all the pills that he had obtained from killing the Truth Immortal King flew out instantly. As those pills floated out in the void; Lin Fan could not help but acknowledge that the amount of pills stored by a veteran Immortal King was indeed immense. Striking out, he destroyed all of those pills immediately. The Pill Spirits within did not have a single chance at fighting back as they were all converted into a Pill River.</p><br/><p>When Lin Fan looked at Immortal Pills now, the only feeling he had was repulsion. Even if he were to just take a whiff of their scent, it would be enough for him to puke out.</p><br/><p>But right now, there was finally a place for those pills to be used — they would boost the strength of the Black Heavens Demon King Army entirely.</p><br/><p>Lin Fan clapped out with his palms furiously, and right away, that tremendous amount of pill power gushed down just like a waterfall.</p><br/><p>The troops of the Black Heavens Demon King Army raised their heads and opened their gigantic mouths, drinking down this pure flow of the power of pills.</p><br/><p>Crack!</p><br/><p>Crack!</p><br/><p>The sounds of bones cracking sounded out as a series of ferocious roars boomed across the entire world. One after another, those Black Heavens Demon Kings growled out furiously as the Evil Demon Horns on the top of their heads produced lightning that coiled around it constantly. The lightning then surged out all the way, curving toward their backs before finally extending down onto their heels.</p><br/><p>One after another, the faces of those Black Heavens Demon Kings turned even more malevolent, as though they were some vile abyssal devils. Just that might alone was more than enough to scare the sh*t out of people.</p><br/><p>When those warhorses that they were riding on sucked in a portion of that medicine, they started evolving as well. All four of their hooves started burning with a fiery purple flame as though they were treading onto the grounds of Hell itself.</p><br/><p>An aura burst forth from these Black Heaven Demon Kings as they formed a vortex that enveloped the entire Heaven and Earth within.</p><br/><p>With that, Lin Fan nodded his head in satisfaction. This was the way a TRUE Black Heavens Demon King Army should be like! The booster of these pills from the Truth Immortal King had literally raised their power level up by a few states.</p><br/><p>“Not bad! Given the current situation, even if it’s the ordinary Immortal Kings, it should be able to kill them instantly.”</p><br/><p>“Let’s go! Time to take you guys for a test drive.” Spreading his hand wide open, all of those Black Heavens Demon Kings immediately converged into a single war flag that flew out into his hand.</p><br/><p>If the Southern Demon Immortal King were to catch sight of this, he would definitely spit out a mouthful of old blood. To think that this lad would use the entire fortune of the Truth Immortal King on these trashes! He would definitely faint over in a fit of anger at this sight.</p><br/><p>That was because the fortune of an Ancient Immortal King was something that was vast as the oceans. If one were to utilize it properly, they would definitely be able to unleash a huge amount of potential.</p><br/><p>…</p><br/><p>All the Senior Old Masters of the Heaven and Earth Sect and the other major sects were striking out right now. They had already divided and delegated out the portions of the Endless Mainland that had yet to be overrun, and had sent disciples of their sects to guard over them so as to fight against the invasion of the Moon Shadow Mainland.</p><br/><p>However, the invasion of the Moon Shadow Mainland truly came in gigantic waves. Compared to the Endless Mainland, their numbers were countless times greater.</p><br/><p>At this moment, when Lin Fan appeared out of the void, there was a line of defense that was engaging in a fight against an invading assault. The troops of the Moon Shadow Mainland had descended and brought with them all sorts of magical beasts. This was yet another product of the Moon Shadow Mainland.</p><br/><p>All of those magical beasts varied in types and were proficient in both ranged and melee attacks. Not only that, their physical bodies were extremely strong, such that even legendary weapons and equipment of the Endless Mainland could not peel away their defenses at all.</p><br/><p>Right then, there was a thin obstructing barrier wall that was constructed with unparalleled mystic skills as a temporary resort. As countless disciples looked upon this barrier wall, their eyes shone with a troubled look. They had already defended against quite a few waves of enemies by now, and had sustained considerable losses. At the same time, those magical beasts were also gaining more of an understanding toward them.</p><br/><p>BOOM!</p><br/><p>A furious roar reverberated throughout the Heaven and Earth.</p><br/><p>In the far distance, the ground tore asunder as spikes shot up one after another from beneath. These spikes were a full dozens of feet tall, causing a gigantic blister to form on the ground as though something was trying to bore through it.</p><br/><p>BAM!</p><br/><p>The blister exploded out as a gigantic towering figure appeared before the eyes of all these disciples. That figure was an enormous bear; when it stood erect, it was a full colossal 100 feet tall! The ash gray fur on its body was immensely thick. Following behind this gigantic bear was a huge legion of magic beasts; every single one of them were extremely enormous as well. However, compared to this gigantic bear, it was naturally like comparing an adult with a child.</p><br/><p>“Watch out! That’s the Moon Shadow Mainland’s Super God Beast, Big Earth King Bear!” Some of the disciples on top of the wall shouted out.</p><br/><p>Lin Fan turned his head around and looked over at the distance where a heaven piercing totem stood upright. On top of the totem was a weird humanoid creature with nine heads. That was the God in the eyes of these magical beasts — the Magical Beast Master God.</p><br/><p>ROAR!</p><br/><p>The Big Earth King Bear spread both of its paws wide open and roared out furiously, causing a ferocious, thunderous growl to reverberate across everyone’s eardrums. Some of the disciples with a lower cultivation state could only clutch at their ears in pain.</p><br/><p>“Don’t you dare get brazen now…!” All of a sudden, an elder on the top of the wall bolted up into the skies, as the longsword he was wielding in his hands let out a long streak of light when he slashed out at that Big Earth King Bear.</p><br/><p>This was a Saint Immortal state being with a rather formidable strength. As he slashed out with his sword, the entire void was ripped apart by his Sword Will, that crushed out onto the body of that Big Earth King Bear.</p><br/><p>“Elder Qingshan has made his move…!” The disciples on the top of the wall shouted out excitedly. However, that excited feeling they had did not sustain for much longer as they were totally rattled by the sight before them.</p><br/><p>Slamming out with his bear paw, the Big Earth King Bear caused the entire void to crumble down and collapse onto the body of Wang Qingshan.</p><br/><p>The sword light in his hands flashed out as he tried to fight it forcefully, sending forth a tremendous amount of power in retaliation. Even though he was a Saint Immortal, he was being way too careless right now — he should have never tried to fight against the might of the Big Earth King Bear forcefully.</p><br/><p>BAM!</p><br/><p>Just like a bomb, Wang Qingshan was sent darting back before shooting right into the ground. Spitting out a fresh mouthful of blood and trying his best to endure the injury sustained, his body then flashed out and moved nimbly as he dodged the gigantic stomp of the Big Earth King Bear that came right after, escaping back onto the top of the wall.</p><br/><p>Standing upright where he was, the Big Earth King Bear opened its mouth. “These Indigenous Beings are far too weak.”</p><br/><p>Just as everyone was feeling tense about the current situation, the void boomed out with a reply, “Is that so…?”</p><br/><p>A black flag pierced through before being planted firmly onto the ground right before the face of the Big Earth King Bear, digging itself deep into the Earth.</p><br/><p>The flag swayed along with the winds, giving off a mighty pounding sound as it exuded a tremendously mighty killing intent.</p><br/><p>Everyone raised their heads and turned their gazes toward the void above them in a flush.</p><br/><p>Lin Fan stood there, calm and nonchalant as he spoke up indifferently, “Kill…!”</p></div>\n</div>"}