{"title": "Chapter 1112 - Indignant, Return to Kill!", "id": 1112, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1112-indignant-return-to-kill", "volume_title": "Volume 12", "body": "<h1>Chapter 1112 - Indignant, Return to Kill!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Within the Tower of Truth, the Truth Immortal King was standing in front of one of the windows right now. Gazing at the void outside, those peaceful eyes of his flashed with a lively glint.</p><br/><p>“What has the Endless Mainland got to do with me? All I need to do is to preserve my own life and seek out the Truth. Perhaps one day, that will lead me to attain the great Dao of the Heavenly Lord eventually.” The Truth Immortal King was someone that was a recluse from the entire world. Controlling the Heaven and Earth Truth Roll, his only motive was to attain the Dao of the Heavenly Lord and nothing else. However, despite that, he had not succeeded in all this while.</p><br/><p>Although, now that the Endless Mainland was being invaded by the Moon Shadow Mainland, that did invoke some ideas in the mind of the Truth Immortal King, as though he had just discovered something.</p><br/><p>Perhaps, his brand of Truth should be spread out into the rest of the world, so that countless people could revere and pray to it as THE Truth.</p><br/><p>Even if the Boundless Future Buddha Lord had not come looking for him, he might not have stepped into the fray anyway. After all, by the time one was at a state like his, they were practically indifferent to many things that were happening out in the world.</p><br/><p>“Eh?”</p><br/><p>All of a sudden, the Truth Immortal King saw the figure of Lin Fan in the void who had left earlier on. To think that he would return once more!</p><br/><p>Initially, Lin Fan had really left the place. The fact that the Truth Immortal King was so darned cowardly was something that he could not change. But as his foot stepped forth and he was prepared to leave, he got more infuriated thinking about everything.</p><br/><p>As an Immortal King who had inherited the Truth of the Heaven and Earth, as someone who was regarded by every single being of the Endless Mainland to be a bearer of Truth, to think that he would bloody want to just stay back and watch a show now that the Endless Mainland was in danger! Bloody hell! It was as though he was really approving of the Moon Shadow Mainland’s infiltration of the Endless Mainland! This was something that Lin Fan was extremely pissed off about.</p><br/><p>To think that this guy would decide to not come out at all during such a critical juncture!</p><br/><p>Then…</p><br/><p>What was the use of keeping him alive?</p><br/><p>Right now, the only thought on Lin Fan’s mind was to have the Truth Immortal King chopped to death. Otherwise, he would definitely feel vexed in his heart for not doing so.</p><br/><p>Not only that, there was the bloody aura of the Boundless Future Buddha Lord here earlier on as well. That must mean that this f*cker must have discussed things through with that bald monk then. Coupled with this fact, Yours Truly was hell bent on destroying this guy.</p><br/><p>“What have you returned for?” The deafening voice of the Truth Immortal King boomed out. Within it was a trace of anger, as though if the other party chose not to leave, the only outcome awaiting them was death.</p><br/><p>He had been in this Tower of Truth for an extremely long time now. There had never been anyone who had dared to come here and act so audaciously. Heck, even those Senior Old Masters of those major sects would not dare to come here as such. Therefore, the fact that this person had even dared to return was something that really displeased the Truth Immortal King.</p><br/><p>“To chop you up…” Stepping out onto the void, Lin Fan spoke out nonchalantly as he swung out his right arm, causing the Eternal Axe to appear in his palm amidst a flash. Raising it above his head, he cleaved it out at the Tower of Truth. “To think that you could be so bloody indifferent toward the dangers of the Endless Mainland, and even dare to collude with the Boundless Future Buddha Lord. Since that’s the case, what’s the use of having you?”</p><br/><p>An axe flash burst forth like a raging dragon that howled out malevolently, striking out at the Tower of Truth with a frightful force. That berserk power ripped the void and caused the barriers that surrounded the Tower of Truth to shatter immediately. Against an Immortal King, what use were these barriers? They were nothing more than pieces of paper.</p><br/><p>The Truth Immortal King was enraged right now as he flicked out the Crystal Brush in his hands furiously. Right away, a text character of ‘Kill’ swam out like a coiling dragon between the Heaven and Earth. Even though it was just a single word, it possessed a boundless amount of killing intent. Right now, he was truly incensed. To think that someone would dare to strike out at him in this place of his. This guy was just practically showing him no respect at all!</p><br/><p>With that, a loud explosion boomed out.</p><br/><p>Those two massive forces collided against one another and erupted instantaneously, causing the surrounding void to crumble down and collapse endlessly. This was a duel between Immortal Kings, and was something that could only be described as earthshattering.</p><br/><p>“A little interesting.” Lin Fan chuckled out as he kept his Eternal Axe. Closing his palms together, the Source of Power within him jerked furiously. Within the void, a beam of light emerged; the amount of power possessed within this was unmatched, and just the epitome of horror in itself. This was not something that ordinary people could hope to defend against.</p><br/><p>“You can go to hell…!”</p><br/><p>Lin Fan roared out as he clapped his palms, aiming to crush the other party entirely. With that, the body of the Truth Immortal King shivered slightly.</p><br/><p>“You shall not desecrate the Truth! Disarm!”</p><br/><p>Next, a gigantic golden text character appeared and floated through the Heaven and Earth before revolving out and forming a shield with it, blocking against the entire world. When that formidable power smashed against it, a reverberating sound boomed out.</p><br/><p>The expression of the Truth Immortal King was unchanging. Even though he was not the strongest Immortal King there was, was he an existence that could endure the humiliating actions of a junior at this level?</p><br/><p>Only, he had not expected that this junior that he was once keeping an eye on had actually grown to such a state. This was something that was rather inconceivable. In the history of the entire Endless Mainland, there had truly never been another junior being who could cultivate at such a rapid speed.</p><br/><p>In just a few mere years, he had already grown to such an extent. If he were to be accorded any more time, wouldn’t he simply just defy the entire Heavens by himself?</p><br/><p>However, there was no way that the Truth Immortal King would actually show some thoughts of mercy or pity just because the other party was a supreme paragon. Now that this junior had angered him, his only response was to have him slain so that he could rest in eternal slumber at this place.</p><br/><p>At that moment, the Truth Immortal King suddenly felt the void in front of him tremble slightly. In the blink of an eye, a single fist that brought forth a berserk amount of power pummelled down at him.</p><br/><p>BAM!</p><br/><p>Lin Fan had not expected that the reaction of the Truth Immortal King would be this quick, and would be able to defend against that attack of his with his palm instantly. Now that Lin Fan was an Immortal King, the one thing that he loved to do was engage in melee combat. It was only through this that he could actually feel the adrenaline and pleasures of fighting.</p><br/><p>The Nine Five Legendary Brick appeared in his left hand in a flash, moving out at lightspeed and slamming toward the back of the Truth Immortal King’s head.</p><br/><p>The Truth Immortal King was stunned when he caught sight of that mysterious red object. Even though he could not feel even the slightest trace of aura from it, he did not know why, but he had a hunch that it was something extremely dangerous. Instantly, he lifted his finger and tapped onto that Nine Five Legendary Brick.</p><br/><p>But, it was right then that Lin Fan’s lips curled into a smirk. Raising his right leg furiously, he swung it toward the groin of the Truth Immortal King.</p><br/><p>“So despicable…!” The Truth Immortal King frowned as his body moved nimbly. In the blink of an eye, he had already switched positions and was now behind Lin Fan’s back. The Crystal Brush in his hand pointed out at the back of Lin Fan and shot forth with a tremendous amount of power.</p><br/><p>Urgh!</p><br/><p>A mouthful of fresh blood sprayed out.</p><br/><p>Lin Fan’s body suddenly wobbled forward.</p><br/><p>“Truth Immortal King! Now that the Endless Mainland is in the midst of deep trouble, why do you choose to sit back idly and just watch?” Lin Fan clutched his chest as he raised his head and looked at the Truth Immortal King while asking.</p><br/><p>“You do not understand my pursuits.” The Truth Immortal King lifted his hand. The Truth Crystal Brush in his hand quivered slightly, possessing all the Truth of the Heaven and Earth. As he pointed out with it, the void crumpled slightly, sending that impact onto the body of Lin Fan.</p><br/><p>Lin Fan took a step forward. All of a sudden, his face was frightfully pale as though he had lost any bit of heart left to resist this. Raising his head, he continued, “Yes, I truly do not understand your pursuits. However, there is still no reason for you to collude with the Boundless Future Buddha Lord.”</p><br/><p>The Truth Immortal King looked at Lin Fan before him. However, there was something that was nagging at him in his mind right now — had his strength truly turned that formidable somehow? The other party was an Immortal King as well. Even though this guy might not be a match for him personally, there should be no reason how he could be defeated this quickly, right?</p><br/><p>Could he have unconsciously treaded onto a higher cultivation state in his pursuit for the Truth after all these years? Was it because he had not realized it himself, and that was all?</p><br/><p>However, at this point, he was no longer thinking that much about everything. That was because this person before him HAD to die, no matter what.</p><br/><p>The might of the Truth Immortal King was not something that this fella could come and insult.</p><br/><p>Furthermore, if one were truck out by the Truth Crystal Brush, even if they were Immortal Kings, they would not be able to endure it.</p><br/><p>One step after another, Lin Fan walked out toward the Truth Immortal King. At this point, he was practically nothing in the eyes of the Truth Immortal King.</p><br/><p>As the latter pointed out his brush one stroke after another, a series of bright flashes of light struck out and exploded onto Lin Fan’s body.</p><br/><p>“The affairs of the Boundless Future Buddha Lord are not something that you can hope to understand. While the pursuits of you beings are to merely live on with life and survive, our pursuits lie in the path of the great Dao of the Heavenly Lord. If you were to devote your heart toward cultivating, perhaps someone like you might have a shot at attaining the great Dao of the Heavenly Lord. But, it’s a pity that that chance is gone. After all, you’re just going to have to die here.”</p><br/><p>The Truth Immortal King scoffed out coldly as the Crystal Brush in his hand struck out at Lin Fan’s body time and again.</p><br/><p>Right now, Lin Fan’s body was drenched with fresh blood dripping down all over him. Yet, he continued to wobble and struggle ahead till he finally arrived at the face of the Truth Immortal King. He then lifted his fist ever so slightly; however, it was all soft and limp, without any bit of strength in it at all.</p><br/><p>Piak!</p><br/><p>It made contact with the chest of the Truth Immortal King. Thereafter, he croaked out as though he was using every single last bit of strength he had, “Y-You’re really not fit to be the Truth…”</p><br/><p>His fist slipped down.</p><br/><p>Both his knees curved down.</p><br/><p>It was truly as though Lin Fan had expended everything he had.</p><br/><p>The eyes of the Truth Immortal King were fixated onto Lin Fan before him with an extremely indifferent expression — he could not care less about this person before him.</p><br/><p>As Lin Fan’s hand slowly continued on its path of descent, it went from his chest down to his tummy… then to his crotch.</p><br/><p>Crunch.</p><br/><p>“TWISTING HEAVEN AND EARTH!”</p><br/><p>A reverberating sound rang across the entire world.</p><br/><p>That initially calm expression of the Truth Immortal King was suddenly replaced with one where his jaws were gaping wide open. His eyes jerked open with horror, as that once nonchalant expression of his gradually grimaced…</p><br/><p>For the Truth Immortal King, the entire Heaven and Earth seemed as though they were crushed at this very moment. A melancholic and sharp pain was slowly traveling through his body from that crotch area of his.</p><br/><p>“ARGH…!”</p><br/><p>A tragic cry rang out. Even if it were an Immortal King state being, there was no way they could actually withstand this underhanded move at this moment.</p><br/><p>The sweat of the Truth Immortal King was literally pouring down his head as his knees buckled out slowly into a beautiful arc. Looking at Lin Fan with a face of pain, he struggled to speak up.</p><br/><p>“LOO… SEN…!”</p><br/><p>Lin Fan looked at the Truth Immortal King calmly while shaking his head gently. Reaching into his storage, Lin Fan took out a dagger with aplomb.</p><br/><p>“Well… goodbye now… Truth! Don’t worry, I’ll bring your experience points together with me and we’ll work hard together, alright? That just proves that you’re still somewhat useful, doesn’t it?”</p><br/><p>Splitch!</p><br/><p>One stab!</p><br/><p>Two stabs!</p><br/><p>Three stabs!</p><br/><p>Four stabs!</p><br/><p>…</p><br/><p>The stabs continued until the Truth dissipated from the world totally. From that day forth, the rolls of the Heaven and Earth disappeared from the face of the universe.</p></div>\n</div>"}