{"title": "Chapter 1119 - Come If You Dare To!", "id": 1119, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1119-come-if-you-dare-to", "volume_title": "Volume 12", "body": "<h1>Chapter 1119 - Come If You Dare To!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ten Master Gods… Coupled with the Magical Beast Master God, that made it eleven of them. Not only that, there was the Boundless Future Buddha Lord, whose level of craftiness was on par with Lin Fan, that was watching by the side-lines covetously. At that moment, Lin Fan felt an impossibly immense pressure on himself.</p><br/><p>The void quivered as ten of those Master Gods appeared. Right away, the entire Heaven and Earth was blanketed over by their God Powers. All of their varying God Powers spread out slowly and continuously across the sky. Furthermore, the amount of power being exuded at this instant was definitely not something to be trifled with. Even if it were an Immortal King, there was a chance he could be blown up instantaneously as well.</p><br/><p>While Lin Fan might not know who these ten Master Gods were, the ten of them definitely knew who he was. For these ten Master Gods, this Indigenous Being had been really troublesome recently, killing many of their people. That was something absolutely intolerable for these Master Gods. To them, those people represented faith that they could make use of. If someone would dare to sever that faith, that person would definitely be an enemy of theirs.</p><br/><p>“Amitabha, Benefactor! Do you still have anything you wish to say? Lay down your sins and leave with us.” The Boundless Future Buddha Lord looked over at Lin Fan calmly. That dignified face of his was gleaming with a bright, compassionate expression. If any ordinary person were to bump into him, they might even take him for some revered monk of the Buddhist Clan who was here to purify the entire world.</p><br/><p>Right now, Lin Fan felt drops of sweat on his forehead; the situation was truly not that great right now. He felt as though he was being targeted so badly right now. It was as though they did not mind if they lost the battle as a group entirely, as long as Lin Fan was killed.</p><br/><p>The Magical Beast Master God looked over at the many other Master Gods. “This Indigenous Being is mine. Don’t interfere!”</p><br/><p>The fact that Lin Fan had killed many of the Magical Beast Master God’s people had him extremely infuriated from the start. He was going to use the fresh blood of this Indigenous Being here to wash away the shame that he had endured.</p><br/><p>The Boundless Future Buddha Lord spoke up, “Magical Beast Master God, this man is extremely crafty. In order to prevent any accidents from happening, it is imperative that we strike at him together and have him killed.”</p><br/><p>Lin Fan blew up right away as he pointed out at the Boundless Future Buddha Lord. “What the f*ck are you saying? I’m crafty? F*ck you! You’re way craftier than I am! Please, you were the one who had f*cked the Radiant Master God over to death!”</p><br/><p>The Boundless Future Buddha Lord had wanted to say something when the entire place fell deathly silent all of a sudden. All eleven of those Master Gods turned their gazes at the Boundless Future Buddha Lord in a flush.</p><br/><p>They knew of the death of the Radiant Master God, and at the same time, they also knew that he was killed by this Indigenous Being here. But now that this Indigenous Being was spilling out the beans about that matter, this was something that had the eleven Master Gods feeling misgivings over it.</p><br/><p>The face of the Boundless Future Buddha Lord was alarmed as he felt a flame of rage burning up in his heart right away. He then scolded out in wrath, “Don’t come and accuse me with your venomous slander! You were the one who had the Radiant Master God killed! Fellow Master Gods, please don’t let this person sow these seeds of discord amongst us. That person is well known throughout the entire Endless Mainland for being wily. God knows how many people have been scammed to death by him. Therefore, it is without a doubt that the Radiant Master God was also scammed to death by him.”</p><br/><p>Lin Fan smiled out indifferently. If he did not try to scam his way out of this situation, his only outcome after being gangbanged by these eleven Master Gods was death. And not only that, his death would definitely be extremely miserable, without any single bit of chance at fighting back.</p><br/><p>“Hmph! You say that I’m venomously slandering you right now? You were the one who came at me together with the Radiant Master God to try and kill me. When you discovered that the situation wasn’t right, you backstabbed the Radiant Master God, and now you’re accusing me of being the wily one?” Lin Fan then turned his sights toward the rest of those Master Gods. “All of you should know that the reason why this bald monk is working together with you guys is definitely not out of goodwill. I was the one who had witnessed it personally…At that final critical moment, he pushed the Radiant Master God toward danger and escaped himself.”</p><br/><p>The Space Master God frowned out and turned around to look at the Boundless Future Buddha Lord. “Boundless Future Buddha Lord, I suppose you ought to give us an explanation for this matter, eh? Could it truly have been as this Indigenous Being is saying right now?”</p><br/><p>The Boundless Future Buddha Lord was entirely infuriated. “Space Master God, do you really think that it is possible? This person here is so weak… What capabilities does he have to have Your Buddha Lord here fear him?”</p><br/><p>The other Master Gods nodded their head, feeling that there was absolutely nothing wrong with what the Boundless Future Buddha Lord was saying. The strength of this Indigenous Being before them did not seem like he was much stronger than the Boundless Future Buddha Lord. Clearly, he should not have what it took to force the Boundless Future Buddha Lord into a spot.</p><br/><p>Right then, the Space Master God turned around to Lin Fan. “What proof do you have?”</p><br/><p>Lin Fan scoffed out, “Proof? All you need is to get the War Master God to come and verify what I just said. After the Boundless Future Buddha Lord escaped, he went to look for the War Master God for help. If the Boundless Future Buddha Lord were not present on the scene, how could he possibly know about what happened between the Radiant Master God and me?”</p><br/><p>The Boundless Future Buddha Lord retorted, “Everyone, please don’t believe in the one sided story of this lad here. Right now, the War Master God is in the midst of a battle. Therefore, it’s definitely impossible for him to rush over from where he is right now. This lad must definitely be trying to delay so that he can come up with a plan to escape. If all of you guys believe in Your Buddha Lord, let us strike out together and have this lad crushed for real.”</p><br/><p>At that moment, all eleven Master Gods exchanged glances before nodding eventually. Even though they did not believe in the Boundless Future Buddha Lord, compared to this Indigenous Being before them, he was certainly still more trustworthy no matter what.</p><br/><p>“Lad, since you do not wish to lay down your sins, you can go all the way to Avici then!” The Boundless Future Buddha Lord roared out as he shot forth with a bright flash of Buddha Light, covering the entire sky with his palms. But all of a sudden, when the Boundless Future Buddha Lord caught sight of the item before his eyes, his heart clenched up as he retracted that palm right away.</p><br/><p>“Huehue… Come at me if you’ve got the guts.” Standing there, the white piece of soap in Lin Fan’s hand was ever so eye-catching. Throwing it up and catching it, up and down…The aura that was being given off by the soap right now caused the Boundless Future Buddha Lord to hesitate.</p><br/><p>Lin Fan mumbled out to himself, “You should know very well what this is. If you dare to take another step forward, whether you get out alive or dead is going to be something difficult to determine.”</p><br/><p>He then cast his sight over at the rest of the eleven Master Gods. “Fellow Master Gods here, you guys ought to be careful as well. The Boundless Future Buddha Lord knows what this item in my hand is. But, has he ever mentioned it to you guys?”</p><br/><p>All the eleven Master Gods cast their gazes at the Boundless Future Buddha Lord in a flush once again. The strength of this Indigenous Being was clearly not strong, and yet, the actions of the Boundless Future Buddha Lord were extremely unusual! It was as though he was being wary about something! Just what was it that the other party was wielding in his hand? Why had they not heard the Boundless Future Buddha Lord mentioning it even once?</p><br/><p>Right now, Lin Fan felt the need to hold himself firm; this was one hell of a f*cked up situation.</p><br/><p>There were twelve Immortal King state beings surrounding him at this moment. Not only that, there were some Master Gods that were on the same level as the Boundless Future Buddha Lord. If he were to strike out at them, there was no doubt that the only outcome awaiting him was death.</p><br/><p>Not only that, he could not even make use of the soap. If he did use it, he would be in for a tragedy.</p><br/><p>The most he could kill would be two of them.</p><br/><p>However, there were a full twelve of them here right now! Besides, who was to say whether or not he would be successful in killing those two even?</p><br/><p>Lin Fan heaved in a deep breath of air as he sensed the Heaven and Earth. The space around this entire place had been sealed up by someone; there was absolutely no way of escaping for him. “Boundless Future Buddha Lord, you know very well what this item that I’m holding in my hands is. If you’ve got the balls, come up ahead alone and prove it to the rest of the Master Gods. Do you dare to?”</p><br/><p>The Boundless Future Buddha Lord yelled out, “What do I not dare?”</p><br/><p>“Since you dare to, come on then!” Lin Fan rebutted.</p><br/><p>“I…!” The Boundless Future Buddha Lord was stunned, undecided over what to do at this moment. All the surrounding Master Gods were starting to feel misgivings toward the entire situation as well.</p><br/><p>Lin Fan’s lips curled into a grin. “Let me tell you guys then…The name of this treasure is called ‘Soap’. It has a heaven revolting ability…no matter how profound your cultivation state is, as long as you are struck by this soap, you will definitely be controlled by it. The very reason why the Boundless Future Buddha Lord does not dare to come forth is because of the horrifying nature of this item. If you guys don’t believe in me, you can see for yourself whether or not the Boundless Future Buddha Lord would dare to come and face me.”</p><br/><p>After he was done saying that, Lin Fan hurriedly crafted something that looked the exact same as the soap. Whether or not he could get out of this alive would all have to depend on the situation later on then.</p></div>\n</div>"}