{"title": "Chapter 1124 - Kill", "id": 1124, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1124-kill", "volume_title": "Volume 12", "body": "<h1>Chapter 1124 - Kill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Thinking of running?” Lin Fan stood there firmly. He had already seen through the thoughts in the Insect Race Master God’s mind.</p><br/><p>Licking off the fresh blood from the side of his lips before glaring at Lin Fan with a malevolent expression, the Master God said. “Indigenous Being, don’t think that you’re capable of killing me. You don’t have what it takes.”</p><br/><p>“Is that so? Then, we’ll just have to wait and see if I’ve got what it takes, won’t we?” Lin Fan chuckled coldly. Today, he was going to kill yet another one of these Master Gods. With that, the seventy two Master Gods would go down to sixty nine.</p><br/><p>The Insect Race Master God looked at this Indigenous Being warily before roaring furiously. His back wriggled out as though something was about to break out of it.</p><br/><p>PSCHHHHHHHHH!</p><br/><p>In that instant, a metamorphosis occurred.</p><br/><p>A pair of insect wings burst out of the Insect Race Master God’s body and extended out, bringing with it a sticky, gooey liquid that covered it completely, looking extremely grotesque. There were mysterious patterns etched on those insect wings, giving off a dim glow of their own.</p><br/><p>“Source Sealing Technique!”</p><br/><p>Lin Fan did not hesitate at all as he propped up the Heavens with both palms, causing the powers within his body to rumble out furiously as he laid down the Source Sealing Technique over the entire world. He could sense that the Insect Race Master God was prepared to leave this place now.</p><br/><p>“Indigenous Being, I’ll be back!” The Insect Race Master God roared out as he flapped both wings rapidly, vanishing from where he was instantaneously. That was a speed that surpassed everything, to the point one could not even follow it with their bare eyes.</p><br/><p>BAM!</p><br/><p>“ARGH! That hurts…!”</p><br/><p>All of a sudden, the Insect Race Master God found his head bleeding somewhere far in the distance. One of his insect wings was bent and broken while bleeding out continuously as his eyes shone out with a look of disbelief.</p><br/><p>“How could this be! What have you done to the Heaven and Earth! Why am I unable to leave this place!” The Insect Race Master God screamed out.</p><br/><p>Looking at the state the Insect Race Master God was in, Lin Fan smirked out. Ever since this Source Sealing Technique of his had been evolved into an Immortal Art, its might was far from ordinary. While it had no offensive capabilities of its own, it excelled in sealing the entire Heaven and Earth.</p><br/><p>Since the Insect Race Master God wasn’t someone from the Endless Mainland, he naturally did not know about this mystic skill. Now that he was trying to make his escape, the fact that he collided with such a huge impact because of that sprint of his was within Lin Fan’s expectations.</p><br/><p>But at the same time, Lin Fan was grateful that he was such a smart fella and had prepared himself well early on. Otherwise, given the speed of that Insect Race Master God, he might truly not have been able to hold him back if the latter really wanted to escape.</p><br/><p>In the mere blink of an eye, he had vanished just like that. The only thing that Lin Fan could catch sight of was an afterimage. But of course, the fact that the Insect Race Master God was in this current state had him chuckling out nevertheless.</p><br/><p>Taking a step forward, Lin Fan appeared right before the face of the Insect Race Master God and scoffed out, “Your death sentence has arrived…”</p><br/><p>Alarmed, the Insect Race Master God used his feelers to pierce Lin Fan.</p><br/><p>Sploch!</p><br/><p>The Insect Race Master God’s face revealed a smirk — he had sensed that his feelers had managed to penetrate through the other party’s body. He then roared out in furious laughter, “HAHAHAHA…!”</p><br/><p>But all of a sudden, his face turned into one of fright. To think that this Indigenous Being before him would actually grab his feeler with one hand instead! As for his other hand, it was raised up high before crashing down onto his head.</p><br/><p>“Insect Race Master God, given the current situation, I doubt you’re going to be able to escape any longer.” This single palm strike of Lin Fan’s brought with it an incredible amount of power. It was something that possessed countless Immortal Arts and mystic skills; there was even a destructive aura mixed within.</p><br/><p>“NOOOOOOOOOOOOO…!” The Insect Race Master God howled out with an endless fright spreading out in his eyes as he fought and struggled furiously.</p><br/><p>But in the blink of an eye…</p><br/><p>BAM!</p><br/><p>Explode!</p><br/><p>The head of the Insect Race Master God was split wide open! From the area of that wound, insects wriggled and squirmed out one after another while the entire place was filled with his voice, “You will never be able to kill me! I am the Insect Race Master God! You will NEVER be able to kill me…!”</p><br/><p>“If I can’t kill you with a single strike, I guess I’ll just have to strike a couple more times then.”</p><br/><p>Lin Fan snapped the feeler of the Insect Race Master God that was inside his body immediately as his lifeforce churned out and healed up his injury in the blink of an eye.</p><br/><p>His body flashed as he appeared behind the back of the Insect Race Master God. He then grabbed both of his insect wings and kicked his leg onto his back for support before giving it a tight wring.</p><br/><p>Shred!</p><br/><p>Blood sprayed out in the sky as a pair of insect wings were ripped off just like that, followed by a tragic cry being howled out.</p><br/><p>“If your God Core is gone, what else can you do?” Driving his palm right into the chest of the Insect Race Master God, Lin Fan grabbed the God Core within his body and ripped it out.</p><br/><p>Looking at that gray God Core in his hands, Lin Fan let out a smirk. “How about now?”</p><br/><p>The moment the God Core left the body of the Insect Race Master God, his aura started diminishing rapidly. “RETURN ME MY GOD CORE…!”</p><br/><p>Lin Fan looked at the Insect Race Master God before him as his lips curled out into a grin. “Do you think that’s possible? You’ve killed countless of my junior brothers, and yet you’re begging for your life now? That has got to be a bloody dream. I was thinking about tormenting you slowly and endlessly, but to prevent unnecessary troubles, I guess I’ll just have you kill you outright.”</p><br/><p>Creak!</p><br/><p>Lin Fan’s fingers gripped tighter with more strength as the God Core in his hand started to crack even more.</p><br/><p>“NOOOOOOOOOOOOOOOOOOOO…!” The shrill voice of the Insect Race Master God screamed as though he had just felt the most horrifying thing ever known in the entire world.</p><br/><p>BAM!</p><br/><p>The God Core exploded out, turning into specks of stardust.</p><br/><p>“ARGHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!”</p><br/><p>The body of the Insect Race Master God started convulsing before breaking down into pieces one after another.</p><br/><p>Creak!</p><br/><p>In the blink of an eye, he turned into small little pieces that were scattered throughout the Heaven and Earth.</p><br/><p>‘Ding… Congratulations on killing the Insect Race Master God.’</p><br/><p>‘Ding… Experience Points +…’</p><br/><p>Finally, he was killed.</p><br/><p>Lin Fan heaved in a huge breath of air. The Insect Race Master God did not have him feel any pressure at all. At the same time, he felt that the reason why the latter was killed by him this quickly was that he was being way too careless.</p><br/><p>The main reason was that Lin Fan’s Physical Body State was overly strong, such that some of the Insect Race Master God’s methods could not be deployed at all.</p><br/><p>And with that pair of insect wings of the Insect Race Master God which were extremely fast, if not for Lin Fan’s Source Sealing Technique that was laid down, it would have been impossible for him to stop the Insect Race Master God from escaping.</p><br/><p>And, the final and most crucial point was that the Insect Race Master God was a dumbf*ck himself. He was the one who had bumped into the Source Sealing Barrier and had his entire head smashed in by himself. What did that have to do with Lin Fan?</p><br/><p>Checking his experience points, Lin Fan discovered that they had indeed grown by quite a bit. But, it was a pity that there was still quite some distance from the Heavenly Lord state.</p><br/><p>All of a sudden, the void started trembling out as Geng Yangtian appeared.</p><br/><p>“Just what in the world is going on here?” After receiving Lin Fan’s news, Geng Yangtian was stunned.</p><br/><p>The breach of the Heavenly River Mountains.</p><br/><p>The fall of Junior Brother Yu Ling.</p><br/><p>The massacre of countless of disciples.</p><br/><p>This was a blow that was simply way too great for Geng Yangtian. Because of that, he rushed over right away upon receiving the news so that he could find out just exactly what was happening for himself.</p><br/><p>Lin Fan looked over at Geng Yangtian. “Old Master, the Insect Race Master God brought his massive army and descended here, breaching through the entire Heavenly River Mountains.”</p><br/><p>“The Insect Race Master God?” Geng Yangtian was stumped before turning around to look at Lin Fan. “Then, you…?”</p><br/><p>“I’ve just had the Insect Race Master God slain. This would have been considered as me avenging them.” Lin Fan replied. At the same time, his mind was now moving on to ponder about another issue entirely. Defending forever was not going to be the best option out there for them. The only way to resolve everything should be for them to take the initiative at attacking the other party.</p><br/><p>“Hais…!” Geng Yangtian was solemn right now, feeling pained in his heart.</p><br/><p>Junior Brother Yu Ling…Countless of disciples…</p><br/><p>All of them dead, just like that. This was truly a huge blow for his heart.</p><br/><p>“Old Master, I feel that we should gather all of our forces for a combined attack. If we were to just continue defending like this and let them take the momentum, it is going to be extremely disadvantageous for us.” Lin Fan raised his suggestion.</p><br/><p>Geng Yangtian waved it off with his hand. “We’ll go over to the side of the Heavenly River Mountains and bring all of their corpses back home first…”</p><br/><p>Lin Fan nodded his head in agreement. Regarding this matter, the best thing was most probably for them to head back and discuss it thoroughly.</p></div>\n</div>"}