{"title": "Chapter 1131 - Starting On The Path of Massacring", "id": 1131, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1131-starting-on-the-path-of-massacring", "volume_title": "Volume 12", "body": "<h1>Chapter 1131 - Starting On The Path of Massacring</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“What a tyrannical Immortal Art!” Han Juntian gasped out. This was an Immortal Art that was far from ordinary. Purifying all of those living beings from the Moon Shadow Mainland in one go was just absolutely inconceivable before this point! He could sense an extremely strong power of the Buddha clan emanating out of this Immortal Art.</p><br/><p>Compared to the Good and Evil Buddha Sect, it was just equally formidable, if not even more mystifying.</p><br/><p>Looking at the living beings that were purified down below, Lin Fan let out a grin. “Grandmaster, now that these living beings have been purified, we’ll let the Moon Shadow Mainland kill amongst themselves. That would serve to help preserve the resources of our Endless Mainland.”</p><br/><p>“Indeed!” Han Juntian nodded his head, feeling that everything Lin Fan had just said truly made sense.</p><br/><p>Lin Fan looked at the Northern region. “By now, all of the sects in the Northern region have withdrawn. As for those that didn’t manage to leave, they have all been turned into ice sculptures. I wonder if those elders, the Grandmaster, and the Old Masters of the Emperor Dao Sect who had been turned into ice sculptures could be reverted to their states before.”</p><br/><p>Seeing the might of this Master God of the Moon Shadow Mainland, Han Juntian was unnerved right now. For someone to be able to freeze up powerful beings of Immortal King state, how strong did they have to be? This wasn’t something that any ordinary Master God would be able to do.</p><br/><p>However, now that that Master God had been injured by Lin Fan, it might not be too soon before she could recover.</p><br/><p>The two of them arrived at the skies above the Emperor Dao Sect. The Grandmaster and those Old Masters who had been frozen into ice sculptures were lying on the ground motionlessly. Even though the ice had already melted off, there was no way of telling if they were dead or alive.</p><br/><p>Han Juntian’s brows furrowed. “Are they dead?”</p><br/><p>“No.” Lin Fan shook his head. As he pointed out his finger, a stream of life force gushed out of the Heavens and entered their bodies.</p><br/><p>Gradually, the bodies of the Grandmaster and Old Masters of the Emperor Dao Sect started changing slowly, until it was followed by sounds of breathing eventually.</p><br/><p>The Grandmaster of the Emperor Dao Sect was the first to bolt up as he sucked in a huge breath of air. “I’LL FIGHT YOU TO DEATH…!”</p><br/><p>But when he finally realized what was going on around him, he was somewhat stumped. “What’s going on here?”</p><br/><p>“Brother Ning Dao…” Han Juntian landed down from the void and heaved out a huge breath of relief. The fact that the Grandmaster and the Old Masters of the Emperor Dao Sect were not dead was the best possible outcome they could possibly wish for.</p><br/><p>Otherwise, this would have been a tremendous loss for the Endless Mainland.</p><br/><p>What sort of existences were Immortal Kings? Even if they could not defeat the strongest Master Gods out there, they could still ensure the safety of a part of the world at the very least.</p><br/><p>“Brother Han?” The Grandmaster of the Emperor Dao Sect looked over at Han Juntian as his face lit up. But, it was filled with bewilderment soon after. “What’s going on over here? Where has that witch gone to?”</p><br/><p>Lin Fan spoke up, “Grandmaster Ning, that Master God has left with injuries.”</p><br/><p>Ning Dao looked closely at Lin Fan. It took him a while before his face changed and he gasped out, “Lin Fan?”</p><br/><p>Lin Fan sniggered out. Seemed like he was still rather famous after all, such that even some of the major sects knew about his name. He then nodded his head back to greet Ning Dao.</p><br/><p>Ning Dao’s gaze surveyed his surroundings as it was gradually filled with an enraged look. He then asked, “What about my disciples…?”</p><br/><p>Lin Fan shook his head. “The strength of that Frost Master God was way too strong. Given the strength of those disciples, there was no way they could have defended against her powers. Their life forces had long dissipated out from within their frozen ice forms. It is because your powers are stronger that you were still able to hold out. But, if things were to delay further, I’m afraid you guys would have probably ended up the same way as well.”</p><br/><p>The hearts of the Grandmaster and those Old Masters of the Emperor Dao Sect were filled with wrath. To think that as one of the nine sects, they would be destroyed by a single Master God of the Moon Shadow Mainland. Even though they themselves were still alive right now, but those disciples of theirs…! Hais!</p><br/><p>Han Juntian continued, “Brother Ning Dao, fellow Old Masters, this is a critical period for the Endless Mainland right now. We must no longer operate like a plate of scattered sand. I feel that we should gather and stand against the Moon Shadow Mainland together.”</p><br/><p>Ning Dao nodded his head. “Alright! Now that those darned Master Gods of the Moon Shadow Mainland have caused my Emperor Dao Sect to be destroyed, if I don’t seek revenge for those disciples of mine, how am I befitting of being their Grandmaster?”</p><br/><p>Han Juntian nodded his head as well. “Right now, we already have several major sects that are gathering one after another so that we can discuss about the big matters on hand. Take this Northern region for example. There are so many sects that are either dead or escaping with their lives. If we are to continue letting the Moon Shadow Mainland eat us up as such, it will be too late by the time we come to realize what’s happening.”</p><br/><p>At this point, Lin Fan felt a tremendous amount of pressure setting in. If he had not met the Frost Master God, he would not have felt this way. But now that he had, he was truly feeling the stress. The strength of that Frost Master God was truly far from ordinary. In front of her, he found even himself completely useless and incapable of fighting back at all.</p><br/><p>If there were other Master Gods of that level within the ranks of the Moon Shadow Mainland, what was he to do?</p><br/><p>Strength!</p><br/><p>Absolute strength!</p><br/><p>That was the only thought running through Lin Fan’s mind at this moment — he wanted to raise his strength as quickly as possible. Once it was to reach a certain state, he would be able to defend against all troubles that they were to face.</p><br/><p>Lin Fan commented, “Let us take a short separation from this point first. After this matter, I’m in dire need of finding a way to increase my own strength. Otherwise, if we were to meet with another powerful being that’s similar to that Frost Master God, I’m afraid it’s going to be extremely difficult to fend against them.”</p><br/><p>Han Juntian wanted to say something, but when he thought about how Lin Fan had plans of his own, he could only nod his head in agreement.</p><br/><p>Given the current circumstances, there was no time available for them to hesitate anymore. If anyone were to hesitate, the only outcome awaiting them was death.</p><br/><p>“Alright! But, always remember that your safety MUST come first.” Han Juntian warned.</p><br/><p>Lin Fan nodded his head. Without waiting any longer, he dove right into the void. Right now, he was going to look for those Master Gods. He definitely had to think up of some way to have those Master Gods killed.</p><br/><p>If he wanted to seek out extremely strong Master Gods such as the War Master God and such, he truly had no way about it. But, he would just kill the likes of the Radiant Master God and the Water Master God he could actually come across without feeling even the slightest bit of pressure.</p><br/><p>…</p><br/><p>At this moment in a World of Frost, the void trembled slightly as a figure suddenly appeared suddenly.</p><br/><p>The face of the Frost Master God was frightfully pale right now, with fresh blood dripping from the sides of her lips. Her body was quivering slightly as she wobbled out. She had not expected things to turn out as such. That Indigenous Being was simply way too crafty!</p><br/><p>“Damned Indigenous Being!” The Frost Master God cursed out in her heart before spreading her arms wide open, causing a surge of frosty winds to gust over from all directions.</p><br/><p>In this World of Frost were many ice sculptures fixed on their spots. But, at that moment, those Ice Sculptures were actually showing signs of cracking as their Essence, Spirit, and Vitality gushed out in streams toward the Frost Master God.</p><br/><p>This was her method of healing up her own body. The reason why the Frost Master God had kept this many ice sculptures was just so that she could take in all the energy that was preserved behind by these ice sculptures at critical moments as such.</p><br/><p>Closing her eyes gently, the Frost Master God was enveloped by ice all over her entire body.</p><br/><p>Under this healing energy, that cracked God Core started to regenerate. However, the speed of it was simply way too slow. There was no way of telling when this would actually heal up completely.</p><br/><p>…</p><br/><p>After parting ways with Han Juntian and the others, Lin Fan’s priority right now was to look for those Master Gods of the Moon Shadow Mainland.</p><br/><p>By now, the living beings of the entire Moon Shadow Mainland had already occupied a good half of the Endless Mainland’s territories. Therefore, it was only by going to those places that Lin Fan had the greatest chance of seeking out Master Gods of the Moon Shadow Mainland.</p><br/><p>Floating up in the void, Lin Fan felt that it was going to be rather odd going around with this face of his. No matter where he went, he would definitely be recognized by a single look.</p><br/><p>But thankfully, he had a mask which could alter one’s appearance as they willed. Even auras and whatnot could be concealed.</p><br/><p>Spinning a circle, Lin Fan changed his entire appearance altogether.</p><br/><p>‘That’s right!’</p><br/><p>With the way he looked right now, there was probably no one who could recognize him anymore.</p>\n</div>"}