{"title": "Chapter 1158 - Impossible!", "id": 1158, "volume": 12, "url": "http://boxnovel.org/the-strongest-system-chapter-1158-impossible", "volume_title": "Volume 12", "body": "<h1>Chapter 1158 - Impossible!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>This was the strongest power that Lin Fan could deploy right now, and was a method of fighting with the most disregard for his own life as well. It was something that would cause himself 800 points of damage for every 1,000 points of damage to the enemy!</p><br/><p>Not worthwhile! It was simply way too unworthwhile!</p><br/><p>That initially calm expression on the face of the Boundless Future Buddha Lord suddenly took on a stark change as his Buddha Face screwed up slightly. “Heavenly Lord Xin Feng?”</p><br/><p>BOOM!</p><br/><p>The Heaven and Earth broke apart as an infinite amount of power gushed through. The power exuded from the Heaven and Earth Sutra converged into a ball and rushed out at this moment.</p><br/><p>With that, a single image of a heavenly figure started to take shape. As it extended out his palm, it was as though the power of the entire world was contained within his hands, blocking the Buddha Finger of the Boundless Future Buddha Lord gently.</p><br/><p>Bang!</p><br/><p>A desecrating amount of power erupted from the collision of absolute powers, the force produced from the impact being enough to rattle the entire world.</p><br/><p>“Heavenly Lord Xin Feng.” When the Boundless Future Buddha Lord caught sight of that person, it was as though he could not believe his eyes at all. However, he rejected that thought in his mind right away as well. “No, this can’t be Heavenly Lord Xin Feng. This is merely an image projected from his consciousness!”</p><br/><p>Lin Fan looked at the illusory figure that was standing up in the void. While he felt a little shaken over this as well, he could not really think too much about anything by this point anymore.</p><br/><p>“Attack…!”</p><br/><p>Now that the chance had come, why was it not attacking yet?</p><br/><p>Furthermore, Lin Fan’s strength was dipping by the moment. It wouldn’t be long before he would enter his weakest state. If he could not take down the Boundless Future Buddha Lord by then, it would truly be way too late for anything else.</p><br/><p>The Boundless Future Buddha Lord barked out in rage, “What can a mere consciousness projection do to me?”</p><br/><p>A maddened howl boomed out as a power that was even greater than before burst forth.</p><br/><p>Lin Fan threw out a single punch and hurled it over. But for the Boundless Future Buddha Lord, it was akin to something scratching an itch of his, leaving not even the slightest trace of pressure on him.</p><br/><p>“To think that even an ant would dare to strike out at Your Buddha Ancestor…Courting death!” The Boundless Future Buddha Lord snorted out coldly as a gigantic Buddha Palm appeared from behind his body and crushed down on Lin Fan fiercely.</p><br/><p>Urgh!</p><br/><p>Lin Fan could only feel the blood inside his body going into a berserk rage as a result of the absolute powers that were disrupting it from within. The lifeforce provided by the Mythical Parasol Tree started to gush forth as it healed up his body’s wounds rapidly.</p><br/><p>The heavenly might of Heavenly Lord Xin Feng was boundless as the Boundless Future Buddha Lord found himself being pushed back by it. However, it was still unable to suppress the latter thoroughly. Heavenly Lord Xin Feng then cast his sight over into the distance.</p><br/><p>As he pointed out with his finger, a ripple burst forth.</p><br/><p>BOOM!</p><br/><p>From far in the distance, a mysterious aura drifted over as a gigantic Secret Ground instantly appeared before the everyone’s faces.</p><br/><p>When the Boundless Future Buddha Lord caught sight of this, he felt his heart clench a little, not knowing what this was.</p><br/><p>But when Lin Fan caught sight of that Secret Ground, he was stunned. This was the Ancient Saint World and the Infinite Worlds…!!!</p><br/><p>Heavenly Lord Xin Feng spoke up, “If you wish to become a Heavenly Lord, you will have to recover all of your Source. Refine it and have everything return to your body as One… That will complete your Heavenly Lord ascension.”</p><br/><p>Lin Fan was rooted for a moment as he cast his sight at Heavenly Lord Xin Feng and then at the Secret Ground. He scolded out in rage, “F*ck off! Yours Truly does not have to sacrifice my own family to accomplish the Dao of the Heavenly Lord! Even without ascending into the Heavenly Lord state, I will be able to slay this bald monk!”</p><br/><p>The moment the Boundless Future Buddha Lord heard those words, he turned his sight toward that vast Secret Ground that was floating out in the void right now. Was this where the Source of Heavenly Lord Xin Feng lay?</p><br/><p>“HAHAHA…!” The Boundless Future Buddha Lord roared out manically, “Power of Source…Your Buddha Ancestor here shall accept it with pleasure then!”</p><br/><p>At that moment, the Boundless Future Buddha Lord spread his hands wide open, blanketing the entire world and grabbing out at the Secret Ground.</p><br/><p>“Courting death!” Lin Fan struck back immediately. However, for the Boundless Future Buddha Lord, this was nothing more than an insignificant effort of anger produced by an ant.</p><br/><p>Heavenly Lord Xin Feng raised his finger as a bright light shrouded the entire Secret Ground, protecting it within. He then turned over to look at Lin Fan. “He is not your final enemy. Even if you triumph over him, it is useless.”</p><br/><p>Lin Fan froze for a moment before catching the gaze of Heavenly Lord Xin Feng. “What do you mean by that?”</p><br/><p>The Boundless Future Buddha Lord came to a halt as well. “You…!”</p><br/><p>He then roared out in laughter thereafter, “HAHAHA! This is the pinnacle of jokes! Useless to triumph over me? Could there actually be anyone stronger than Your Buddha Ancestor in this entire universe?”</p><br/><p>After he was done with those words, the Boundless Future Buddha Lord wanted to continue further. However, a single person suddenly came into his mind.</p><br/><p>Impossible! Definitely impossible!</p><br/><p>Eventually, he turned his eyes toward Heavenly Lord Xin Feng and Lin Fan. “You guys are spouting way too much nonsense. The both of you can just go to hell!”</p><br/><p>“Infinite Evil Buddha, purify…!”</p><br/><p>The Boundless Future Buddha Lord then let out a maddened bark as the entire world was suddenly encapsulated within a Buddhist Power that was filled with a supernaturally evil aura. He was deploying his ultimate move right now, bent on killing everyone around here!</p><br/><p>Heavenly Lord Xin Feng said calmly, “I’ll hold him off. You can just use the Heaven and Earth Smelt to take him down.”</p><br/><p>Lin Fan’s brows furrowed as he complained in his heart, ‘Ha! Talk is cheap! How could things be that simple in reality?’</p><br/><p>However, even if that were the case, it was his final hope as well.</p><br/><p>The Boundless Future Buddha Lord had not expected that at a moment as such, the consciousness projection of Heavenly Lord Xin Feng would actually be triggered into awakening by the Heaven and Earth Sutra.</p><br/><p>Damn it!</p><br/><p>GODDAMN IT!</p><br/><p>Wasn’t this just a mere projection? Yet, the power contained in it was so darned formidable!</p><br/><p>He was someone who had absorbed every single bit of power in that Buddha Pool! How could he lose out to a mere projection?</p><br/><p>“Heavenly Lord Xin Feng! I refuse to believe that you can actually take me down!” The Boundless Future Buddha Lord roared out in a furious rage.</p><br/><p>However, Heavenly Lord Xin Feng was floating up in the void as he lifted his finger gently and caused the void around him to take on a sudden change. With that, a book and brush floated out in the void.</p><br/><p>“First, was chaos. Then, came the Heavens. And before all of that…Heavenly Lord Xin Feng. Everything that happened in this world is but a story written down by Your Lord here to form an endless number of worlds through gathering my unrivaled Will. Your fates have long been sealed through the books. Everyone has their own destiny, and yours is set. Fighting it will be nothing but futile efforts.”</p><br/><p>At that moment, the mysterious book that was floating up in the Heavens suddenly started flipping open. Every single page that was flipped by had images appearing one after another — these were all the events that were happening in the entire world at every single given moment.</p><br/><p>When it flipped to the last page, the image that was shown was the figure of the Boundless Future Buddha Lord.</p><br/><p>When the latter saw how the figure of himself in that image had fallen to this lad, he became totally frenzied.</p><br/><p>“IMPOSSIBLE! I AM THE BOUNDLESS FUTURE BUDDHA ANCESTOR! HOW COULD I POSSIBLY BE CREATED! I REFUSE TO BELIEVE THAT! GO TO HELL…!” The Boundless Future Buddha Lord had gone entirely deranged by now. For someone to tell him right now that he was nothing more than an existence crafted out by someone else, what sort of a blow was that? Did that mean to say that his fate had always been in the control of someone else out there?</p><br/><p>There was no way Lin Fan could be bothered with all of this right now. Whether or not he was made up, the Boundless Future Buddha Lord would have to die no matter what!</p><br/><p>With that, a single fist flew out toward the head of the Boundless Future Buddha Lord.</p><br/><p>“IMPOSSIBLE! YOU GUYS ARE TRYING TO DECEIVE ME!”</p><br/><p>BAM!</p><br/><p>The Boundless Future Buddha Lord grabbed Lin Fan’s arm as he glared at him and snarled out, “THESE MUST BE TRICKS THAT YOU’VE COME UP WITH, LAD! EVERYTHING IN THOSE IMAGES IS MADE UP!”</p><br/><p>Lin Fan raised his head and looked at the images before roaring out as well, “PREPARE TO DIE!”</p><br/><p>Shing!</p><br/><p>From the void, a Sword Will instantly sliced off Lin Fan’s arm. That arm of his which was severed away held on to the Nine Five Legendary Brick as it slammed onto the Boundless Future Buddha Lord’s head.</p><br/><p>Piak!</p><br/><p>The Nine Five Legendary Brick had hit the target right on the mark.</p><br/><p>Seeing this, Lin Fan’s face shone with a tired smile — his combo here was really strong indeed!</p><br/><p>At that moment, Lin Fan did not hesitate as he let Geng Yangtian and the others out of the Heaven and Earth Smelt immediately before heading over to take down the Boundless Future Buddha Lord.</p><br/><p>“Won…!” Lin Fan shouted out in ecstasy.</p><br/><p>When Geng Yangtian and the others caught sight of that, they cheered out in excitement as well.</p><br/><p>They had truly won…!</p><br/><p>Right then, Heavenly Lord Xin Feng spoke up, “No, this merely spells the end of the story that Your Lord here has written. The final changes are still undergoing…”</p><br/><p>With that, the entire masses froze up.</p><br/><p>Lin Fan looked at Heavenly Lord Xin Feng. “Don’t come and try to scare me off…”</p><br/><p>“I’m not scaring anyone off. Those are the facts…” Heavenly Lord Xin Feng shook his head before casting his sight into the void. “Everything happening to you guys till this point was merely a beginning.”</p><br/><p>Lin Fan shook his head. “I don’t understand. Just what in the world are you trying to say?”</p><br/><p>Heavenly Lord Xin Feng’s face then turned extremely grim. “Let me tell you then.”</p><br/><p>…</p></div>\n</div>"}