{"title": "Chapter 7", "id": 7, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-7", "volume_title": "Volume 1", "body": "<h1>Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Blue birthmark</b></p><br/><p>Earth peak has a lot of rooms, slightly bigger than where You XiaoMo was before. However the furnishings are just as simple as the one before, except for an additional simple screen, behind which is a very big wooden tub. The screen is placed facing the door, blocking the view of others. You XiaoMo moves in that very day. He has very few things, only two sets of clothes and four books. He doesn’t intend to return the books immediately to the library. Last night, in order to deal with the situation, he was almost like <b>swallowing a date whole</b>, stuffing all the contents into his brain He still haven’t had the time to digest them, already failing to remember clearly some of them. Furthermore the loan period of the library typically has a limit of half a month.</p><br/><p>You XiaoMo puts his clothes and books in the wardrobe before starting to clean the room. Most probably no one lived in this room before, and no one comes over to clean it regularly, so the floor, table, chair, and bed are all coated with a layer of dust. You XiaoMo touches the surfaces with his finger, the layer of dust is really quite thick. There is a wooden washbasin in the room. You XiaoMo uses it to fetch clean water from outside, taking an hour to clean up the room. By this time, the sun had already set behind the mountain.</p><br/><p>Not long after, that Brother Li comes over to get him and the other new recruits for dinner. Earth peak has a dedicated canteen, three meals a day. A lot of the disciples will head over here to have their meals. However there are also those who are fasting, not needing to come over for meals. The dishes are set up like a modern day buffet. Each of the three meals is cooked beforehand by the cook, and placed in large pots. The disciples then take whatever they wish to eat. But in order to avoid wasting food, one of the rules of the canteen is that you only take however much you can eat. Any evidence of wasting food will be met with punishment.</p><br/><p>You XiaoMo follows Brother Li to pick up a food tray. He doesn’t have a big appetite, so he scoops up less food. Just when he is about to start eating, a small commotion comes from the entrance. You XiaoMo raises his head and looks over. Looks like Elder brother Fang ChenLe has arrived. His arrival is immediately met with greetings from a lot of people. It is evident that he is quite popular in Earth peak, maybe only second to the Master.</p><br/><p>After dinner, You XiaoMo returns to his room. Remembering that he has yet to take a bath, he takes out a set of clothes from the wardrobe and places them on a small stool beside the wooden tub. There is actually a hot spring in TianXin sect, however, it is quite far away. Therefore most people would bring back hot water to their rooms to bathe. During the day, Brother Li brought them to the place for hot water, so You XiaoMo knows the way. Going back and forth five times, You XiaoMo finally fills the tub. You XiaoMo wipes the sweat off his brow, closes the door, takes off his clothes and slips into the water. The water temperature is just right, wrapping around his body, making him feel drowsy. You XiaoMo struggles to keep awake, using the towel to wash his hands and legs once over.</p><br/><p>Just when he wasn’t paying attention, something similar to a birthmark slowly emerges on his chest that had been soaking in the water. Like a blue tear drop. The color becoming brighter and brighter. You XiaoMo suddenly feels his chest is very hot. Looking down, he can’t help but be dumbfounded. When did this birthmark appear on his chest. Furthermore, it is blue, very strange. Looking at the bright drop, it seems as if it is about to drip out of his chest, he can’t help but touch it with his hand …….</p><br/><p>Two breaths later, You XiaoMo who should be taking a bath, suddenly disappears. A few ripples float across the surface of the steaming water, slowly fading away, as if You XiaoMo was never there, the whole room cloaked in silence.</p><br/><p>Notes:swallowing a date whole – read without understanding</p><br/>\n</div>"}