{"title": "Chapter 5", "id": 5, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-5", "volume_title": "Volume 1", "body": "<h1>Chapter 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Accepting a Master at the Hall of Mages</b></p><br/><p>When he reaches his room, the sun is just about to set behind the mountain. You XiaoMo glances at the room next door, supposedly the room of the young man that came to see him earlier today, Jiang Liu. But the room is all quiet, looks like he had already moved out. This type of good luck, of course he is envious. After all, the original You XiaoMo’s talent has already been completely determined, a <b>genuine goods at fair price</b> soul with a green aura. But that was before he was transported over, after the change in souls, it must have changed. But You XiaoMo has no intention of getting re-appraised. If it turns out the two appraisals are different, he would most likely be subjected to suspicion. Afterall, he wouldn’t want to die once again after just being here for a few days. Therefore, even though he really wants to know his talent, he has no interest in getting re-appraised.</p><br/><p>Back in his room, he puts the four books on the table. It has to be said that the things he superficially looked at in the East pavilion, are very profound. Perhaps others would be able to understand, but for an outsider like him, with absolutely no understanding of mages, for him to come to a sudden understanding, it really is somewhat difficult. However, despite the difficulty, he still has to digest these 4 books before the next day. Because they have to go the the Hall of Mages tomorrow, where it will be decided if they can find a good Master for them to learn from. In order to become a mage, other than one’s own efforts, an outstanding Master is also a critical factor.</p><br/><p>You XiaoMo doesn’t know if he will be chosen, but he still can’t afford to go there without knowing anything. Who knows if the selection process would entail some sort of assessment, if he <b>gives 3 I don’t knows to each question</b>, he can realistically picture how no one would be willing to accept him. Therefore, You XiaoMo intends to supplement his knowledge, but 4 books in a night is really no easy feat. After taking a huge breath, You XiaoMo resolutely burns the midnight oil.</p><br/><p>As a result, the next day, You XiaoMo has an extra pair of panda eyes. But his worry was by no means superfluous. Early next morning, someone from the Hall of Mages comes over to lead the way. The person they sent over is a young man in his twenties, with an indifferent expression. He gives them 15 minutes to get ready, not saying anything else the whole time, as if he couldn’t really be bothered. You XiaoMo sees a few bitter smiles from the others, because they are all considered ‘leftovers’. The reality is the ones with great potential, for example those with blue or purple auras have already been chosen long ago, leaving only those with inferior talent, just like You XiaoMo. He is the worst among the five, as the others have green auras. But You XiaoMo doesn’t feel inadequate, afterall, as Edison once said, genius is 99% perspiration and 1% inspiration.</p><br/><p>15 mins later, they arrive at the Hall of Mages. The grandeur of the Hall of Mages is in no way inferior to the library. It’s unclear if they are the last ones to arrive as there are already a lot of other people assembled inside. However the others look pretty much like them, dressed in simple green robes with ordinary hairpins in their hair, probably having entered TianXin sect at about the same time. You XiaoMo had thought that there were only the few of them, never expecting that there would be so many. No wonder TianXin sect is able to develop into the number one major sect in Long Xiang continent, with the importance they attach to the quality of their disciples.</p><br/><p>Because the elders have not arrived, the anxious crowd starts to exchange words. It’s just that the topics are all of the same kind, ‘what is the color of your aura’, ‘I wonder who would pick me’, ‘it would be great if I was spotted by so and so elder’, that kind of worthless talk. You XiaoMo lets out a huge yawn. After staying up the whole night, he finds it a little difficult to hold on. Just when he is about to find a corner to take a nap, a piercing voice makes him jump.</p><br/><p>“Silence everyone.”</p><br/><p>Notes:genuine good at fair price – 100% percentgives 3 I don’t knows to each question – clueless</p><br/>\n</div>"}