{"title": "Chapter 8", "id": 8, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-8", "volume_title": "Volume 1", "body": "<h1>Chapter 8</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Percentage</b></p><br/><p><b>*pu tong*</b></p><br/><p>A human figure drops from the sky splashing right into jade green waves. The bone chilling ice-cold water covers the top of his head in an instant. You XiaoMo is freaks out, <b>all six vital organs failing to function</b>. He flails around in the water, thinking he has fallen into the sea. The fact is, he can’t swim!! You XiaoMo thinks in despair, don’t tell me I’m going to drown right now just after crossing over here? He can’t help but mourn his fate as a <b>short-lived ghost</b>. Thinking this way, You XiaoMo just gives up and stops struggling. Since he is bound to die sooner or later, he might as well just die already. He only hopes that he won’t be a short-lived ghost in his next life. Relaxing his whole body, You XiaoMo slowly waits for the moment when he sinks to his death under the water.</p><br/><p>Maybe because he has completely unburdened himself, he starts to feel something is not right. Flipping open his eyes, he is stunned to find that the water is only waist deep. <b>-_-||</b>…….</p><br/><p>Only then does You XiaoMo realize that he is no longer in his room. He finds himself in unfamiliar surroundings, standing in a lake. The lake takes up a fifth of the area. It’s a peculiar space. White clouds and blue skies above. A clear day but with no sun in sight. After careful examination, he finds out that everything is static. The white clouds show no signs of movement. There is no sound of wind in the air. The fresh green grass bows to the ground but remains motionless. Even the lake below him lacks the slightest ripple.</p><br/><p>You XiaoMo looks down at the blue tear drop lying quietly on his chest. Could it be that he is here now because he accidentally touched it? With that in mind, he can’t help but stretch out his hand and touches it again. Unexpectedly everything turns black in front of his eyes, <b>*pu tong*</b>, and he finds himself back in the tub of hot water. His ice-cold body that was completely submerged in the lake slowly starts to warm up.</p><br/><p>You XiaoMo stares at the blue teardrop on his chest. After hesitating for quite a while, he finally decides to leave it alone. He hastily finishes his bath and climbs out of the tub and puts on his clothes. It could be his imagination but he feels more invigorated than he was before. In order to discard the bath water, You XiaoMo again makes several trips. At this time the sky starts to darken. There doesn’t seem to be anyone up and about, only the occasional disciples on patrol. Because it is his first day here, being in unfamiliar surroundings, You XiaoMo doesn’t dare to run about wildly. After finishing pouring away the bath water, You XiaoMo returns to his room. He lights a candle, lighting up the room and then takes the book on his desk and continues his reading.</p><br/><p>Speaking about mages, even though there are three big peaks in TianXin sect, the reality is, very few people can become mages. It’s not a question of the lack of effort, but rather the lack of natural talent. In order to determine if someone can become a mage, the most straightforward method is to look at his soul. Only souls with colored auras can become mages. The martial artists on the other hand, all have colorless transparent souls. Long Xiang continent has thousands upon tens of thousands of people, however colored auras appear in only one percent of the people. That’s to say, only one in a hundred can become mages. Furthermore, these may not necessarily be high level mages, most likely ending up as low level mages. Clearly, mages are a rarity in Long Xiang continent. Since surveying a person’s soul is now widely used to identify potential mages, most major sects carry a soul detection crystal, the size of a small bowl. It’s only because of this that You XiaoMo is able to avoid a disaster. After successfully entering TianXin sect as a probationary disciple, he no longer has to get his soul appraised. However, where he goes from here, still depends on his own efforts.</p><br/><p>Notes:</p><br/><p>all six vital organs failing to function – scared out of his wits</p><br/><p>short-lived ghost – die prematurely</p><br/><p>black line – <b>-_-||</b></p><br/>\n</div>"}