{"title": "Chapter 16", "id": 16, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-16", "volume_title": "Volume 1", "body": "<h1>Chapter 16</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Precision control.</b></p><br/><p>You XiaoMo feels a little uneasy. Just when he was hesitating over whether he should continue eavesdropping, the two people walk further away, their voices getting softer. He practically can’t hear “Elder brother’s” reply, or maybe he didn’t answer. Whatever the case, he didn’t hear it. Even though he didn’t her the “Elder brother’s” voice, You XiaoMo subconsciously thinks back to the pair he encountered in the library. Could it be the Junior sister they referred to is that girl? You XiaoMo doesn’t dare to dwell on it further, quickly forgetting all about the matter.</p><br/><p>Hurrying to the library, You XiaoMo returns the four books before borrowing another two. One of the books records the magic herbs found on LongXiao continent up to level six. It also has colored drawings. Most of the common magic herbs are included. The other book is on basic alchemy. Tomorrow he will start refining magic pills. It would be good to read up beforehand on the important points so that he would know what to do if something goes wrong.</p><br/><p>You XiaoMo leaves in high spirits after borrowing the books, completely unaware that the old man guarding the library suddenly opens his eyes and scrutinizes him. He has guarded the library for almost one hundred years and this is the first time he has seen a probationary disciple run here <b>twice every three days</b>. Although he has inferior inborn talent, he is a hard working baby. But that’s all it is, the old man soon shuts his eyes again.</p><br/><p>After this, You XiaoMo simply brings along the books to the canteen for breakfast. Since he spent some time looking for books at the library, when he arrives, there is <b>a sea of people</b>. The food is also mostly gone. Luckily he is not a <b>rice bucket</b>. After breakfast, You XiaoMo follows along several disciples who were going the same way towards the Hall of Enchanted Herbs.</p><br/><p>For todays lesson, Elder brother Fang no longer focuses on book knowledge. Since they have already stimulated the force of the soul, today they can start trying to refine magic pills. Elder brother Fang brings them to a stone room. Five cauldrons are placed in a row, on stone platforms. Next to each is a rectangle wooden table.</p><br/><p>“From today onwards, this is where you will be refining magic pills. Now choose one cauldron and stand by it.”</p><br/><p>You XiaoMo is standing at the back, so by the time he goes over, the other four have already chosen their cauldrons, leaving him the one right at the back.</p><br/><p>After seeing that they have chosen their cauldrons, Elder brother Fang says, “Now look at the cauldron in front of you. It is the tool by which you will refine magic pills. Level one and level two magic pills can be refined in this cauldron.”</p><br/><p>Hearing him say level one and level two magic pills, You XiaoMo blurts out, “Elder brother, don’t tell me that level three magic pills cannot be refined in this cauldron?”</p><br/><p>The other four disciples immediately give him looks of contempt. Elder brother clearly stated level one and level two. Of course level three cannot be refined in this cauldron and yet he actually asks such a stupid question. You XiaoMo dreadfully regrets it after the words popped out of his mouth.</p><br/><p>Fang ChenLe smiles, but does not rebuke him, “Level three magic pills is the first threshold for mages. It requires the use of a stronger force that an ordinary cauldron would not be able to support. So changing cauldrons is required at every stage unless one starts out with a relatively good cauldron.”</p><br/><p>You XiaoMo hangs down his head, it seems to him that is again a question of money.</p><br/><p>Following that, Fang ChenLe explains how to use the cauldron. Simply speaking, it is to transport the force of the soul into the cauldron. Because ordinary cauldrons have three small openings on the top, the soul force has to be divided into three before entering the cauldron. Therefore this depends on how skilled a mage is in manipulating the soul force. If the skill is bad, even with top grade magic herbs, with good luck, a low grade magic pill will be produced, with bad luck, the magic herbs will be rendered useless. Therefore the ability to control the soul force with precision is very important when refining magic pills.</p><br/><p>Fang ChenLe has his own things to take care of, so he can’t stay by their side while they practice. So he calls over a relatively younger disciple named Wu to help out. After he leaves, You XiaoMo and the others throw themselves into practice.</p><br/><p>Everything is hard in the beginning. This saying is quite true. Just when You XiaoMo is deep in thought trying to figure out how to divide the soul force, one of the other disciples goes ahead impatiently. <b>*peng*</b> The cauldron flies from the explosion. When You XiaoMo looks over, that disciple is already red-faced, full of disbelief.</p><br/><p>Big brother Wu who the Elder brother had entrusted them to doesn’t seem fazed, since he has witnessed more unexpected things. He walks over and gives the disciple a few pointers. The others quickly prick up their ears, including You XiaoMo. You XiaoMo takes a deep breath. When his concentration is at a high point, he sees a white diaphanous ball in front of him. That’s the essence of the soul force. Under his control, he divides the soul force into three equal parts, before bringing them close to the three openings and drops them in. He can feel the soul force flooding the ice-cold narrow space. He can even ‘see’ what is happening inside. Dark surface, metal that is both black and hard with the occasional glimmer from other metals. Going down the openings, he finally ‘sees’ the whole space. It’s a cavity with nothing else.</p><br/><p>You XiaoMo moves the soul force around the space before retrieving it. When he snaps out of it, he feels that the stone room is strangely quiet. He raises his head to see the others staring blankly at him, including Big brother Wu who is looking at him in amazement.</p><br/><p>Notes:</p><br/><p>twice every three days – almost every day</p><br/><p>mountains and oceans of people – sea of people</p><br/><p>rice bucket – big eater</p><br/>\n</div>"}