{"title": "Chapter 27", "id": 27, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-27", "volume_title": "Volume 1", "body": "<h1>Chapter 27</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>The truth beneath the gentleness.</b></p><br/><p>Tonight is the night that You XiaoMo has the most restless sleep ever since he came to this world.</p><br/><p>The next day, he is forced by Ling Xiao’s despotic attitude to follow him to the assembly point. Because he is terrified by those last words he said yesterday, he doesn’t dare to resist. Only when he appears in front of everyone with Ling Xiao does he realize what he’s in for.</p><br/><p>He who had always been insignificant and transparent is now the center of everyone’s attention. The first to react is the Junior sister Tang YunQi, rushing up to Ling Xiao. After giving You XiaoMo a look of disdain, she says to Ling Xiao, “Elder brother, did you finish what you had to do?”</p><br/><p>Ling Xiao nods indifferently. This time he is not acting. This Junior sister just doesn’t give him a good feeling. But Lin Xiao has always treated the Junior sister in this way, so no one feels that something is amiss.</p><br/><p>On the other hand, You XiaoMo wipes the sweat off his brow. But before he could slip away, Tang YunQi aims a spearhead at him.</p><br/><p>“Elder brother, why are you with this person?”</p><br/><p>Tang YunQi wraps herself around Ling Xiao’s arm, her elegant eyebrows raised, looking at You XiaoMo with disdain upon disdain.</p><br/><p>Ling Xiao calmly extricates his arm, curving up the corners of his mouth in a slight smile, “Is it a problem that I came here with him?”</p><br/><p>A smile that makes people think of the spring breeze blooms on the handsome face that does not belong to him. But it gives off a feeling of perfection, as if this person should always be smiling. But, only You XiaoMo knows that this is all an act. He personally experienced yesterday how this man can switch faces, flipping back and forth, just like someone with multiple personalities.</p><br/><p>The smile on Tang YunQi’s pretty face disappears. Her pupils enlarge slightly as if she can’t believe that Elder brother is speaking to her in this way.</p><br/><p>Mo Gu also sees that the Ling Xiao today is not quite the same as the one from yesterday, but he doesn’t suspect that he is not the real thing. Although he is surprised that he would be together with a nobody from Earth peak, he doesn’t think much of it.</p><br/><p>“Since everyone is here, let’s go!”</p><br/><p>Saying this, Mo Gu leads the disciples towards the winged-bird square.</p><br/><p>You XiaoMo plans to slip away secretly to join the Earth peak disciples but who knew that just when he turns around, he is almost strangled by a strong pull on his collar. Turning around, he is met with Ling Xiao’s ‘gentle’ look.</p><br/><p>“Little brother, where do you think you’re going?”</p><br/><p>You XiaoMo shrinks, saying spinelessly: “Nowhere, I’m not going anywhere.”</p><br/><p>Ling Xiao seems to be very pleased with his spineless reaction, releasing him and telling him to keep up before walking ahead.</p><br/><p>As for Tang YunQi, looking at his receding back, she suddenly turns around and gives You XiaoMo a ferocious stare before chasing up to Ling Xiao.</p><br/><p>You XiaoMo hangs down his head, resigning himself to his fate. He feels that this trip down the mountain is really filled with bad luck, actually attracting such an unbelievable mountain of trouble. Not only that, he is now hated by Junior sister. His peaceful existence that only lasted a few days is now officially over.</p><br/><p>Upon reaching the winged-bird square, You XiaoMo receives another hateful glare from Tang YunQi. This time, her fury is even more obvious. That’s because Ling Xiao wants to sit on the same winged-bird as him. Even though he says it indifferently, he gives the impression that it is non-negotiable.</p><br/><p>As a result, those glaring at him is not just Tang YunQi. Several Heaven peak disciples are also looking at him unpleasantly. Especially the one that was told to sit with the Earth peak disciples, his face bright red from suppressed anger.</p><br/><p>“Little brother XiaoMo, come sit over here.”</p><br/><p>Ling Xiao pats the spot by his side, speaking to the dawdling You XiaoMo.</p><br/><p>As soon he says those words, everyone’s gaze locks onto You XiaoMo. There is jealously, there is anger, and there is even admiration. But the most obvious one is the furious glare from Tang YunQi. Finally unable to take it any longer, she states, “Elder brother, that is my spot.”</p><br/><p>“Is that so!” Ling Xiao seems to think it over before saying, “Then I’m fine with the back seat.”</p><br/><p>Saying this, he gets up and walks over to You XiaoMo and plonks down next to him. Completely disregarding everyones stares, including the aggrieved Tang YunQi who looks as if she is about to cry.</p><br/><p>The one with the most seniority, Mo Gu, takes it all in but doesn’t say anything. What can he say? One is the daughter of the Grand Master, the other is the Elder disciple that the Grand Master places high hopes on. This old man can’t interfere with the affairs of the younger generation. Furthermore, he roughly understands Lin Xiao’s character. If Lin Xiao really likes YunQi, he would not have always treated her indifferently.</p><br/><p>In the end, Tang YunQi is unable to change Ling Xiao’s decision. Even though she had defended her position, she was still pushed away by Elder brother. Even though he acts differently, for now the face is still the same.</p><br/><p>The winged-bird takes off, spreading out its beautiful wings on both sides. In an instant they are soaring up to the sky, Tang YunQi’s resentful whimpers replaced by the whistling wind rushing by their ears.</p><br/><p>Because the speed of the winged-birds is very fast, usually no one would speak at this time. You XiaoMo also thinks so but suddenly a teasing voice tinged with evil reaches his ear.</p><br/><p>“You see, Little brother. Now everyone is envious of you.”</p><br/><p><b>*Boom*</b>, You XiaoMo feels something explode in his head. He reflexively turns around and comes face to face with a pair of cold mocking eyes. But he doesn’t fail to detect the flash of mischief in those eyes that leave him reeling in shock. He stares at him, eyes bulging, this… this is intentional? If he had not said those words, he would not have known that it is indeed intentional.</p><br/><p>When they reach TianXin sect, You XiaoMo still hasn’t made any sense of the situation. But throughout the whole journey, the way Ling Xiao treats him could not be any better.</p><br/><p>At the fork, Mo Gu wanted to ask Ling Xiao if he wants to go with them to Heaven peak. Instead, Ling Xiao lets them go ahead since he wants to go together with You XiaoMo. With Tang YunQi looking back at them resentfully every now and then, You XiaoMo is forcefully escorted by Ling Xiao back to Earth peak. On the way, the other four disciples dare not speak, frequently stealing glances at Ling Xiao. In their hearts, they are probably thinking the same thing as the Heaven peak disciples. Why is it that in one day the relationship between You XiaoMo and Ling Xiao has become so close?</p><br/><p>Upon reaching Earth peak, Ling Xiao follows You XiaoMo to his room. Luckily it is the time for morning classes, so they don’t come across anyone on the way.</p><br/><p>You XiaoMo pushes open the door and walks in. Ling Xiao stands at the doorway and evaluates his room, saying: “How shabby <i>na</i>!”</p><br/><p>You XiaoMo glances back at him and stammers: “All of Earth peak rooms are like this. If you… you are not used to this, you can go back to your own room.”</p><br/><p>The last part was said very softly but Ling Xiao hears everything. His lips start to curve upwards as he laughs, “Little brother XiaoMo, would it be better if I move in with you?”</p><br/><p>You XiaoMo immediately looks at him in horror. You’ve got to be kidding!</p><br/><p>His expression fills Ling Xiao with delight making him roar with laughter.</p><br/><p>You XiaoMo blushes instantly, realizing that he was tricked.</p><br/><p>In the end, Ling Xiao doesn’t stay. It seems as if he was only surveying the lay of the land. Before long, a Junior brother comes over to fetch him, saying that he was sent over because the Grand Master is looking for him regarding something urgent. They soon leave.</p><br/><p>Once they leave, You XiaoMo climbs weakly on to the bed. Wiping the sweat off his brow, he feels that today’s experience really <b>shook him to the core</b>!</p><br/><p>Notes:</p><br/><p>someone whose name is not in the classics – nobody</p><br/><p>alarm heart move soul – terrifying</p><br/><p>________________________________________<wbr>_________</wbr></p><br/>\n</div>"}