{"title": "Chapter 20", "id": 20, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-20", "volume_title": "Volume 1", "body": "<h1>Chapter 20</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Accumulate energy pill.</b></p><br/><p>You XiaoMo hands over the forty pills that he had set aside. Uncle Zhao flips through the records. Ninety level one magic pills. Surprisingly a complete success. Again another record. But he’s only a little surprised. After all, a high success rate for level one magic pills is not a big deal. During the exchange, Uncle Zhao gives him a magic bag to store his magic pills. The magic bag has a capacity of five square meters. TianXin sect has plenty of these small scale bags. Each disciple is entitled have one. Fang ChenLe did not give them the bags earlier because he was busy.</p><br/><p>Although the capacity is rather small, but it’s better than nothing. However, You XiaoMo is not like the other disciples whose faces lit up upon receiving the magic bags. That’s because he had already figured out how to deal with this issue. But in front of Uncle Zhao, he leaves an impression of someone that is not easily fazed.</p><br/><p>Following this, You XiaoMo asks Uncle Zhao for a hundred portions of magic herbs. Uncle Zhao is not surprised, quickly sorting and counting the magic herbs before handing them over to him. This is because he is not the first one to bring the cauldron back to the room. Hardworking and smart Earth peak disciples will also do it that way. After that, You XiaoMo smoothly obtains permission from Elder brother Wu to go down the mountain.</p><br/><p>In the dead of the night, when everything is quiet, You XiaoMo takes out the cauldron that he brought back from the stone room. Then he takes out the one hundred portions of magic herbs from the magic bag and places them on the table. The reason why he brought back the cauldron is so that he can refine magic pills at night. But they will be different from the ones he refines during the day. This time he is going to try to reduce the risk associated with the magic pills.</p><br/><p>Because the quality of the magic herbs is a limiting factor, even if his talent is great, he has no way of improving the grade of the magic pills. So he can only work on the distillation step, to reduce the risk associated with taking magic pills.</p><br/><p>During the day, You XiaoMo observed the other disciples when they were refining magic pills. He discovered that when they distilled the magic herbs, they could do it only one or two times, not more. So the risk associated with the resulting magic pills is only reduced by fifteen percent. That leaves the low grade magic pills with twenty percent risk. So he thought to himself, if he were to further distill the herbs, would the risk get lower? He doesn’t dare to attempt it during the day so he only chooses to do so at night.</p><br/><p>He puts the cauldron on the table and picks up three stalks of magic herbs – rock jasmine, winter ice herb, and korean mint. These three magic herbs make up the Accumulate energy magic pill. The Accumulate energy pill is directed at martial artists.</p><br/><p>Usually before entering the world of mystics, martial artists are ordinary people. Ordinary people need to open up their the meridians in their bodies in order to become martial artists. Opening up the meridians require the assistance of the spiritual energy of the universe. Therefore, if they do not have help from a master, they can only rely on the Accumulate energy magic pill.</p><br/><p>The accumulate energy magic pill is able to briefly concentrate spiritual energy in the body. This spiritual energy is able to help in opening the meridians. But because the Accumulate energy magic pill is a level one magic pill, its effect is limited and it also has a high associated risk. Therefore, most people will choose not take the Accumulate energy magic pill unless it’s the last resort.</p><br/><p>Of course, You XiaoMo is aware of this. But he also knows that the main reason why people do not take the Accumulate energy pill, is because the risk is too high. If not careful, it is possible that it will cause the spiritual energy to run amok in the body. Not everyone will be able to survive the fallout. But if the risk is reduced, the outcome would be different. The effect of one low grade Accumulate energy pill is limited, but if multiple pills are taken and if the risk is not high, then the choice would be easier. When the time comes for him to sell them, he should be able to get a higher price. But this is just what he thinks, the reality will depend on the effect of the Accumulate energy magic pills he refines.</p><br/><p>Thinking of this, You XiaoMo throws the magic herbs into the cauldron and starts the distillation process. The distillation process involves the removal of impurities before dropping them into the cavity of the cauldron. Doing this repeatedly gets harder with each repetition, using up more and more soul force.</p><br/><p>During the day, it took You XiaoMo the time to brew half a small cup of tea to refine one magic pill. But with the additional two rounds of distillation, each magic pill now takes twice as long. Although the time needed is increased, the risk actually drops. It’s unclear how much risk is reduced. The light blue color of the magic pill appears a little stronger. The difference is noticeable when examined closely.</p><br/><p>You XiaoMo doesn’t know how to judge the risk of magic pills. After trying out one pill, he goes on to the second one. Like this, he only manages to refine fifty pills through the night, half of which were only distilled once.</p><br/><p>During the day, he goes to the stone room as usual. Refining one hundred magic pills, just like the day before. At night he returns to the room and continues refining pills without sleep or rest, finally making it through the first batch of magic pills.</p><br/><p>The next day, he gathers all his belongings and prepares to go down the mountain.</p><br/><p>Notes:</p><br/><p>rock jasmine – Androsace Umbellata</p><br/><p>winter ice herb – Rabdosia Rubescens</p><br/><p>korean mint – Agastache Rugosa</p><br/>\n</div>"}