{"title": "Chapter 23", "id": 23, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-23", "volume_title": "Volume 1", "body": "<h1>Chapter 23</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>First bundle of riches.</b></p><br/><p>The manager looks at the magic pill in the palm of his hand in amazement. This is clearly an Accumulate energy pill. But it’s not quite the same. Looking at it carefully, you can tell the difference from the color. The light blue color of this magic pill is a little deeper when compared to the previous bottle. He has seen this phenomenon before but those were all mid-grade magic pills. The color of mid-grade magic pills are naturally deeper than low grade magic pills. But this Accumulate energy magic pill in his hand is not a mid-grade magic pill because its color is lighter than a mid-grade magic pill. The manager quickly picks up the fourth bottle. Inside are Dispelling magic pills. They are like the Accumulate energy magic pills in the third bottle. He, who has seen much and experienced much, is still confused. Why is it that even though they are all low grade magic pills, but yet their depth of color is different?</p><br/><p>“Distinguished guest, this one?” The manager finally asks, unable to hold back any longer.</p><br/><p>You XiaoMo had long before heaved a sigh of relief when he saw the astonished expression on the manager’s face. He presumes that it means his magic pills are still in play. He should be able to sell them at a slightly better price.</p><br/><p>“These two bottles are not the same as the other two. Although they are low grade magic pills, their associated risk is not high. Only about ten percent.”</p><br/><p>Hearing this, the manager is stunned. He looks at You XiaoMo as if he is looking at strange object. There is also a hint of conflicting emotions. He really did not expect that this young man would bring him something so shocking. He is someone that sells magic pills, so of course he knows a thing or two about magic pills. From his past experience, even if distillation rounds were increased, the risk associated with low grade magic pills have never fallen below fifteen percent. He doesn’t know if other mages have achieved this before but this is the first time he has come across this. If this were to get out to others, it would most probably lead to an huge commotion. Low grade magic pills with a ten percent risk. Lower by five percent but enough to cause the people of Long Xiao continent to rush forward like ducks. If he was able to monopolize the source of these magic pills …….</p><br/><p>The manager looks at You XiaoMo with a complicated expression. This young man is really one of a kind. After muttering to himself, he asks, “Distinguished guest, did you refine all these magic pills by yourself?”</p><br/><p>“I refined them by myself, but I was taught by my master.”</p><br/><p>You XiaoMo looks at the manager with shining eyes. May God forgive me for telling lies. From the shocked look in the manager’s eyes, he knows that the pills he refined must be quite different from the usual ones. In order to avoid unnecessary complications, he doesn’t dare to say that he figured this out by fumbling around by himself. So he can only implicate that master of his with whom he has yet to have a formal meeting, Kong Wen.</p><br/><p>“And your honorable master is?” The manager is not surprised. In fact, he feels that this answer is the most probable.</p><br/><p>“This, I’d rather not say.”</p><br/><p>You XiaoMo doesn’t want to flash the TianXin sect trump card lightly. Even though he knows that it would make the manager look at him in a new light, it could also bring about problems. If this were to get back to TianXin sect, he wouldn’t be able to finish what he had dished out.</p><br/><p>The manager signals that he understands. If he knew this technique, he would also keep it under wraps. But since this young man is able to bring these magic pills out to sell, it must mean that he has permission from his master. This way, it is also easier to handle.</p><br/><p>The manager puts the magic pills back into the bottles and says seriously, “Distinguished guest, since you want to sell these magic pills, I will give you a suitable price and we will see how you feel about it. The two ordinary bottles for twenty gold pieces per bottle. For the other two bottles of magic pills, I will give you ten gold pieces per pill. Is this acceptable for you?”</p><br/><p>At once, You XiaoMo’s deep black eyes start to shine. Ten gold pieces for one pill versus twenty gold pieces for one bottle, this difference seems really too much. But the price of twenty gold pieces per bottle seems higher than what he figured out from the other shops. The four bottles hold twenty magic pills each. But this is only half of what he has. He had kept the other half to try out other shops but now that the manager has given him such a high price, he can’t help but feel a little touched. But —-</p><br/><p>“Manager, the price you quoted, seems higher than that from other shops, yes?” You XiaoMo asks tentatively.</p><br/><p>He doesn’t think he has a face that would arouse sympathy from the manager, so there must be another reason for the high price.</p><br/><p>The manager smiles, “Distinguished guest is a really smart person. Indeed the price I quoted is higher than the other shops. I only hope that distinguished guest would continue to sell these magic pills to us the next time if you have any. Even if not all, but if you would at least reserve half for us.”</p><br/><p>You XiaoMo considers for a moment. This actually works. He already didn’t plan on publicizing this. Furthermore, the price given by the manager is high. He wants to buy many magic herb seeds. He had worried that the money he would get from selling these magic pills wouldn’t be enough, so this move by the manager is really like a delivery of charcoal in snowy weather.</p><br/><p>“Manager, I can sell these magic pills to you but I have a condition.”</p><br/><p>“What condition?” asks the manager.</p><br/><p>You XiaoMo speaks cautiously, “I hope that you will not tell anyone that these magic pills were refined by me. In short, don’t tell anyone anything about me. If you agree, aside from the magic pills for my personal use, I will sell the rest to you.”</p><br/><p>“Deal!” the manager agrees without even having to think twice.</p><br/><p>He was not planning on revealing anything anyway. Such a valuable source, of course he would want to keep it firmly under his control. Furthermore this condition is very reasonable.</p><br/><p>After agreeing on the terms, the manager counts the money and hands them over. Two bottles of ordinary magic pills is forty gold pieces. Two bottles of special magic pills is four hundred gold pieces. Altogether four hundred and forty gold pieces. This is You XiaoMo’s first bundle of riches in this world. From what he knows, an ordinary household would be able to live for half a month on one piece of gold.</p><br/>\n</div>"}