{"title": "Chapter 22", "id": 22, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-22", "volume_title": "Volume 1", "body": "<h1>Chapter 22</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Magic pill shop.</b></p><br/><p>No wonder he didn’t see the disciples from the Warrior division at the foot of the mountain. Looks like they had already reached the town before them. But You XiaoMo didn’t expect that the Military division would send Lin Xiao. Thinking over what he overheard the other day, he feels all the more that something unexpected will happen on this trip.</p><br/><p>You XiaoMo had planned that he would <b>part from the rest</b> after they leave this area. Furthermore, the things that he plans to do should not be revealed to others.</p><br/><p>Tang YunQi is the daughter of the Grand Master. The most favored Junior sister of TianXin sect. The whole way here, the thing that You XiaoMo heard the most was the <b>*ge ge*</b> sound of her coy giggling. Especially when the others were lavishing praise on her, as if it made her feel especially pleased. How long the winged birds flew, was how long she giggled.</p><br/><p>When Lin Xiao appears, Tang YunQi is the first one to rush over. After an extremely nauseating “Big brother Xiao”, she throws herself at Lin Xiao. But she was destined to miss as Lin Xiao dodges out of the way. Tang YunQi does not feel embarrassed nor humiliated, as if this a common occurrence. She wraps her hands around Lin Xiao’s arm and look up at him adoringly. The other disciples are full of envy, including the four disciples with You XiaoMo.</p><br/><p>Lin Xiao’s relationship with them is quite good. Especially with Mo Gu. Before, from the time they met up until now, You XiaoMo didn’t see Mo Gu smile even once. His expression was always very serious, as if someone owes him money. Now, after Lin Xiao appears, a smile is hanging on his face while he nods from time to time watching Lin Xiao and Tang YunQi. Upon meeting, they exchange a few pleasantries before setting out.</p><br/><p>Leaving the square, Mo Go turns around and says, “We have reached He Ping town. Buy what you have to buy. We will meet up here tomorrow at this time. We will not wait for those who come late.”</p><br/><p>Saying this he leads his disciples toward the bustling market along with all the disciples from the Warrior division, leaving not a single one.</p><br/><p>The one leading the Earth peak disciples, Big brother Liu sighs softly, as if this is something he expected. Soon after, he says to You XiaoMo and the others, “From here, I will go with Junior brother Li to make the purchases Master has requested. You all should finish what you all want to do within a day. You all heard what Uncle Mo said. He will not wait for you if you are late tomorrow.”</p><br/><p>“We understand, Big brother Liu.”</p><br/><p>Big brother Liu nods before heading off with Junior brother Li in the same direction as Uncle Mo Gu. After they leave, the other disciples head off in their respective directions, going home to visit relatives. Only then does it dawn on You XiaoMo that this is his first time in He Ping town …….</p><br/><p>You XiaoMo, his first time in He Ping town has no choice but to head in the same direction as Big brother Liu, towards the most lively area of town. From there, he slowly searches, asking around when lost, finally finding what he is looking for.</p><br/><p>…….</p><br/><p>He Ping town is most famous for magic pills. Because of its proximity to TianXin sect, they frequently have dealings with the disciples from TianXin sect. They also do business with other smaller sects. Over time, He Ping town slowly becomes more developed, bringing along the surrounding smaller villages.</p><br/><p>The magic pill shops are all located on the busiest street in He Ping town, called North street. The south facing side of North street is a row of Magic pill shops. It’s the most crowded place, practically customers in every shop, with some to the point of overcrowding.</p><br/><p>You XiaoMo stands at the side of the street and observes with his eyes wide open for a quite a while. He finally settles on a shop that is not too popular but not too deserted, and walks inside.</p><br/><p>When he walks in, a young man dressed as an ancient shop attendant immediately comes up to him, speaking in a polite tone, “Distinguished guest, are you here to buy magic pills?”</p><br/><p>You XiaoMo glances over the shop, before returning to the brilliant smile of the young man, saying in a small voice, “Do you accept magic pills here?”</p><br/><p>The young man freezes before coming to his senses, smiling without changing the look in his eyes saying, “We do. Our shop also accepts magic pills. Distinguished guest please come this way.”</p><br/><p>Buying and selling are not done in the same place. In order to protect the privacy of the customers, most shops set up inner rooms. Furthermore, the magic pill shops of North street have good reputations so one usually does not have to be worried about getting cheated or robbed. You XiaoMo thinks that since they dare to set up shop close to TianXin sect, they wouldn’t dare to cheat people. So he follows him inside without apprehension.</p><br/><p>The one attending to him switches to the shop manager. A sixty something year old man with grey hair on both his temples. His energy though is pretty good for a sixty year old, with a smiling face that makes him seem even more amiable.The manager sees You XiaoMo and surreptitiously gives him the once over. Rather than make small talk, he goes <b>straight to the point</b>.</p><br/><p>“Distinguished guest, what level magic pill are you selling?”</p><br/><p>“It’s ……. level one magic pills.” You XiaoMo answers, a little embarrassed.</p><br/><p>When he just stepped inside, he took stock of the situation in the shop. Most of the magic pills are level two and level three. There are level one magic pills but definitely not many. This makes him feel a little inadequate, since the magic pills in his hand are all level one.</p><br/><p>The manager is stunned for a moment before saying politely, “Distinguished guest, would you like to take out your magic pills and let this old man have a look?”</p><br/><p>You XiaoMo silently takes out a few bottles of magic pills. A total of four, containing four different types of magic pills. Actually, there are only two types. It’s only that the number of distillation rounds is different, so the quality is different, that’s why he put them in different bottles.</p><br/><p>The manager picks up one of the bottles and pours out a pill and examines it closely. It’s a common Dispelling magic pill. He picks up another bottle and sees its also a very common pill, an Accumulate energy pill. He can’t help but frown. He had thought that this young man is from a major sect, so the level one magic pills he brings should be something out of the ordinary. Such as top grade magic pills. But after looking at two bottles and finding that they are regular run of the mill low grade magic pills, he can only feel disappointed.</p><br/><p>But for someone who has been in this line of business for many years, living all these years, he has seen many unexpected things. He quickly recovers and patiently picks up the third bottle. One look at the magic pill he pours out leaves him stunned speechless.</p><br/><p>Note:raise horse bit towards different routes – part wayssees the mountain upon opening the door – straight to the point</p><br/>\n</div>"}