{"title": "Chapter 32", "id": 32, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-32", "volume_title": "Volume 1", "body": "<h1>Chapter 32</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Earth peak disciple.</b></p><br/><p>Of course Ling Xiao can’t go and steal TianXin sect’s alchemical technique for training the soul force. That volume of alchemical technique is kept on the highest level of the East pavilion. Guarded by Elders of TianXin sect that have retired to work behind the scenes. Each of them eccentrics with great strength. But this doesn’t mean that he can’t get that volume of alchemical technique, it’s just that if the alchemical technique is stolen, there will definitely be a huge uproar in TianXin sect.</p><br/><p>That volume of alchemical technique is deemed as a very important treasure for TianXin sect, so it is checked on frequently. Once the theft is discovered, TianXin sect will definitely suspect that there is a traitor within its ranks. Then that group of old guys will definitely appear from behind the scenes to examine each and every disciple. This would be very troublesome for him. Furthermore, You XiaoMo himself seems to have quite a bit of secrets. So stealing the alchemical technique is a very bad move. He won’t choose this method except as a last resort.</p><br/><p>But he already told You XiaoMo that he would get him a volume of alchemical techniques to train the soul force. As a trustworthy man, he must do what he says he would. Hence the next day, You XiaoMo learns from others that Ling Xiao has gone down the mountain.</p><br/><p>Yesterday, after finishing their discussion, Ling Xiao stayed for a while before leaving with twenty magic pills. This leaves You XiaoMo with thirty magic pills. He feels that he can rely on selling these for money the next time he goes down the mountain. Even though it is not a lot, it would at least stop his money bag from becoming flat.</p><br/><p>As for why Ling Xiao went down the mountain, You XiaoMo unconsciously thinks that he could be going to look for alchemical techniques to train the soul force. He feels a little guilty in his heart, since Ling Xiao is helping him look for it even though it obviously has nothing to do with him. But when he considers that after obtaining the alchemical technique he will be able to refine even more magic pills, that guilty feeling slowly disappears.</p><br/><p>Holding the fifty magic pills he refined yesterday, You XiaoMo gets ready to go to the Hall of Enchanted Herbs to turn them over and at the same time collect some magic herbs. The Hall of Enchanted Herbs stipulates that half of the magic pills from the previous batch of magic herbs must be turned over. If not, you won’t be able to get more magic herbs.</p><br/><p>There are one hundred and twenty types of level one magic herbs, that can be made into forty types of magic pills. Up till now, You XiaoMo has refined three types of magic pills. Even though it is a long way from forty, and even though it is not necessary that he has try all of them once, You XiaoMo decides that he will try to refine each one once. After all, Ling Xiao did say that uninterrupted practice is needed to increase the soul force.</p><br/><p>As before, the person in charge of the Hall of Enchanted Herbs is Uncle Zhao. Seeing him head over, he is no longer surprised. The bottle contains the usual fifty magic pills. Not one more, not one less. Uncle Zhao doesn’t bother to count, not worried that there may only be forty odd magic pills.</p><br/><p>“How many stalks of magic herbs do you want this time?” Uncle Zhao asks without even raising his eyes.</p><br/><p>“Six hundred stalks.” You XiaoMo hesitates a little before answering.</p><br/><p>This is not a small number, although you can only refine two hundred level one magic pills from this number. Still, very few disciples will take more than five hundred stalks at once. But Zhao Zhen knows this young man’s speed. He can refine more than one hundred magic pills in a day. Six hundred stalks will only take two days.</p><br/><p>Just when he is about to record the amount, You XiaoMo speaks up again, “Uncle Zhao, I have a request. I would like to get ingredients for ten types of magic pills, may I?”</p><br/><p>You XiaoMo glances at him and quickly lowers his head when he looks back at him. He knows that he is being a little unreasonable. Zhao Zhen finally looks at him properly, a little surprised but not extremely so, “You may.”</p><br/><p>Saying this, he starts to gather the six hundred stalks of magic herbs for him. Ten types of magic pills requires thirty different types of magic herbs. He doesn’t have that many, only half the amount, so Uncle Zhao allows You XiaoMo to go get them from the medicine garden. The one who leads him there is a disciple from the Hall of Enchanted Herbs, a disciple that entered the sect before him.</p><br/><p>“You’re You XiaoMo?”</p><br/><p>Walking one ahead and one behind, You XiaoMo suddenly hears the voice of the big brother. Not sure if it is his imagination but the big brother’s tone is quite unkind. It feels a bit like disdain, like he is talking someone that is unworthy.</p><br/><p>You XiaoMo can’t make any heads or tails of it. It doesn’t seem as if he has done anything to offend this big brother. Furthermore, he has always maintained a low profile with no reason to offend anyone. Most importantly, he has no recollection of this big brother. On top that, when did he become so famous such that a big brother he doesn’t recognize is able to call out his name?</p><br/><p>The other party stops in front of the entrance to the medicine garden. Turning around to face him and seeing the bewildered look on his face, he says: “Looks like you yourself are not aware <i>ba</i>. Now, everyone in the mage division knows of your existence. And also know that Elder brother Lin Xiao from the Warrior division embarrassed Junior sister YunQi in front of everyone because of you. I also heard that Elder brother Lin Xiao went to look for you in the afternoon. What’s so great about you? Why would Elder brother Lin Xiao suddenly take an interest in you?”</p><br/><p>You XiaoMo is dumbstruck. Not even a day has passed and it actually spread to this extent. It’s too bad that he can’t say anything. If it was the previous Lin Xiao, he definitely wouldn’t have anything to do with him. But inside the shell of “Lin Xiao”, it’s already a different person. Furthermore this person is very hateful, always taking delight in bullying him.</p><br/><p>But in the eyes of the people in TianXin sect, Lin Xiao really did take a sudden interest in him. So it is not possible that there is no reason behind it.</p><br/><p>After some thought, You XiaoMo questions, “This big brother, are you a Earth peak disciple?”</p><br/><p>There is an abrupt change in the expression of the other party. After giving You XiaoMo a glare, he turns around and leaves. After all, they have already reached the medicine garden.</p><br/><p>You XiaoMo rubs his nose. Those words are a little provocative, but he has no choice. Who asked him to be so aggressive?</p><br/><p>The bad relationship between Earth peak and Heaven peak is an open secret. This bit is clear from what he experienced at the Hall of Mages a little while back during the choosing of disciples. After that, You XiaoMo did some digging. Even though the relationship between the two peaks is not as terrible as he imagined, they have always been locked in secret competition.</p><br/><p>But Earth peak is the one that loses terribly each time. That’s because the good resources and good talent are all taken by Heaven peak beforehand. This is also the reason why Master Kong Wen is always in seclusion, refusing to appear.</p><br/><p>As for Flying peak, always stuck in the middle, not much brilliance but also unlikely to end up at the bottom. So they end up being a passive observer.</p><br/><p>There are specialized guards to look after the medicine garden. Each day there will be a few on duty. After entering, You XiaoMo hands over the thing that Uncle Zhao gave him to one of them. After taking a look, the other party simply gathers the remaining magic herbs for him.</p><br/><p>Upon leaving the medicine garden, You XiaoMo heads directly back to his room.</p><br/><p>Upon reaching his room, he doesn’t immediately start to refine magic pills. Instead he takes out twenty white bottles from his magic bag. The twenty bottles is what he got from Uncle Zhao before leaving the Hall of Enchanted Herbs. Other than for storing the magic pills, he plans to use five bottles to hold water from the lake in his dimension.</p><br/><p>Since this lake water can replenish his soul force and physical strength, You XiaoMo decides to prepare some in his magic bag, so he can use it at any time. This way, he won’t have to go get it from the dimension when the time comes.</p><br/><p>With this intention in mind, the body soon appears in the dimension. This is a result of his research after fumbling around for a day. As long as he wishes it strongly in his mind, he doesn’t need to touch the teardrop on his chest to get there.</p><br/><p>It’s just that before he could walk over, he is shocked by the sight of a huge expanse of lush green things in front of his eyes. He doesn’t even realize that the bottles in his hand have dropped to the ground.</p><br/>\n</div>"}