{"title": "Chapter 43", "id": 43, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-43", "volume_title": "Volume 1", "body": "<h1>Chapter 43</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Miscalculation.</b></p><br/><p>Walking in front is a young woman dressed in a set of pink traveling clothes whose beauty and elegance is clear from afar. With <b>smooth and glossy</b> skin, an <b>oval</b> face like a goose egg, paired with a pair of large and beautiful eyes. Along with gentle curves, she is simply a beauty that moves people. An unrivaled beauty through and through. If her character was also as delightful as her outward appearance, she would definitely be a well-loved super <b>Mary Sue</b>.</p><br/><p>It’s a pity that her character is completely unlike that of her outward appearance. As pretty as she is, she is also somewhat crafty and wilful, ordering everyone around with just a tilt of her chin. This beautiful young woman is none other than Tang YunQi, the daughter of TianXin sect’s Grand Master. She is also the most beautiful woman in TianXin sect. It is said that when she turned eighteen, quite a few people came forward to ask for her hand. But Tang YunQi found none of them to her liking as her heart is obviously fixed on Lin Xiao.</p><br/><p>This bit is known by everyone in TianXin sect. Even You XiaoMo who has only met her two or three times can tell. It only proves how clearly she shows it.</p><br/><p>The other person is the disciple who was squeezed out to another winged-bird when You XiaoMo and Ling Xiao sat on the same winged-bird the last time. This person has always looked at You XiaoMo with hatred ever since the first time, as if he can’t wait to peel off his skin. He is clearly still brooding over what happened before.</p><br/><p>Seeing You XiaoMo looking at those two, Ling Xiao remembers that those two are behind him. Without waiting for You XiaoMo to ask, he simply explains: “Junior sister Tang and Junior brother Li also happen to be on their way down the mountain. Knowing that I too will be going down the mountain, the Grand Master asked me to bring them with me, so that I can also keep an eye on them.”</p><br/><p>The corner of Ling Xiao’s mouth start to curve upward upon mentioning the last bit. Looks like he seems to be in a good mood.</p><br/><p>You XiaoMo notices this act but his instinct tells him that Ling Xiao is not in a good mood so it’s better not to provoke him.</p><br/><p>Speaking of which, yesterday he had just used this excuse. And now, someone else used this excuse on him, what more a personal request of the Grand Master. There is simply no way to refuse. It would only be strange if he is in a good mood.</p><br/><p>Tang YunQi obviously did not expect that the person going down together with Ling Xiao would be You XiaoMo. Upon seeing him, she asks bluntly: “Why is it you again?”</p><br/><p>Well isn’t that just how it is? He also doesn’t wish to see her. It’s just that sometimes <b>‘ape shit’</b> is just like this. The more you don’t want to see that person, the more likely it is that that person will appear in front of you.</p><br/><p>You XiaoMo smiles awkwardly, not giving her an answer.</p><br/><p>Tang YunQi dislikes this disciple that had just entered the sect not too long ago. If not because of him, she wouldn’t have lost face in front of so many people the last time. If it wasn’t because they are in different peaks, she would have tormented him to death a long time ago.</p><br/><p>Since it’s only four of them this time, they simply choose a winged-bird that can seat five. Unexpectedly, Tang YunQi objects. She is used to sitting on the big winged-birds so she feels that sitting on a small bird is beneath her. But just a casual remark from Ling Xiao shuts her up.</p><br/><p>“Since you don’t want to sit on this winged-bird, you can just sit on another one with Junior brother <b>Chen</b>.”</p><br/><p>You XiaoMo looks at Tang YunQi with both sympathy and glee. Still daring to provoke him at this crucial moment. This Junior sister Tang is really brave!</p><br/><p>Tang YunQi is worried that Elder brother will really chase her off onto another winged-bird so she hastily denies: “There’s no need for that Elder brother. Really ……. taking a small winged-bird is actually good. I don’t mind, really. Don’t ask me to take another winged-bird.”</p><br/><p>Actually she wanted to sit on the large bird in order to separate You XiaoMo from Ling Xiao. What she didn’t expect is that the latter would instead chase them off.</p><br/><p>“No no no, I should thank you for reminding me. Four people on a winged-bird is too crowded. If something were to happen on the way and someone were to fall off, what would we do? So, I have decided that you should sit on another winged-bird with Junior brother Chen <i>ba</i>. A little more space is better.” Ling Xiao beams while saying.</p><br/><p>“Elder brother.” Tang YunQi stamps her feet. Her anger distorts her mouth, but she still looks pretty.</p><br/><p>“Junior brother Chen, for this trip, I have to trouble you to take good care of Junior sister.”</p><br/><p>Ling Xiao doesn’t care if he agrees. He dictatorially orders the Junior brother who is showing some signs of delight.</p><br/><p>For Tang YunQi, of course she doesn’t want to be separated from Ling Xiao. But for Junior brother Chen, he actually can’t wait to share the same space with Junior sister. Therefore, Ling Xiao’s suggestion gives him a huge opportunity. He just doesn’t let it show on his face.</p><br/><p>In the end, Tang YunQi is still unable to change Ling Xiao’s decision. She and Junior brother Chen were chased onto another winged-bird. The latter very happy although his face only shows signs of fury.</p><br/><p>On the winged-bird, You XiaoMo secretly looks back at Tang YunQi, whose face is distorted in anger. He then looks back at Ling Xiao who is mightily pleased with himself, with a face like the spring breeze. Pouting, he is certain that Ling Xiao didn’t think of this in the beginning. If Tang YunQi didn’t give him the inspiration, they would probably all be on the same winged-bird at this time. This is what they call being a victim of one’s own brilliance.</p><br/><p><b>Notes:</b></p><br/><p>skin like congealed fat – smooth, soft, and glossy</p><br/><p>melon seed face – oval face</p><br/><p>Mary Sue – idealized character with extraordinary abilities</p><br/><p>ape shit – homonym for fate</p><br/><p>junior brother – somehow his name changed from Li to Chen</p><br/><p>________________________________________<wbr>__________</wbr></p><br/>\n</div>"}