{"title": "Chapter 50", "id": 50, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-50", "volume_title": "Volume 1", "body": "<h1>Chapter 50</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Deal</b>.</p><br/><p>The cowardly, afraid of getting into trouble, and weak You XiaoMo, Ling Xiao never liked this type of people. But unexpectedly not only does he not detest You XiaoMo, he actually finds the him that is this way very lovable, so much so that he sometimes can’t stop himself from teasing him, deriving great pleasure from it.</p><br/><p>“Little brother, if you don’t want to die, you have to listen to me obediently, understand?”</p><br/><p>Ling Xiao raises the corners of his mouth and says in delight.</p><br/><p>You XiaoMo immediately nods his head as if he’s pounding garlic. Now, his life is already in his hands. Even if he doesn’t understand _______ he still has to pretend to understand!</p><br/><p>Ling Xiao stands up and walks a few steps. He turns back towards You XiaoMo that is following his every move: “From now on, don’t let anyone besides me see the blue water drop on your chest. This is very important. Understand?”</p><br/><p>“Understand!”</p><br/><p>You XiaoMo nods his head vigorously. Although he very much wants to tell him that it’s not a blue water drop but a blue teardrop, after thinking it over for a bit, he decides to let that rot in his stomach. After all the shape of a water drop and teardrop are pretty much the same.</p><br/><p>“Also, the magic herbs planted in this dimension. When the time comes, you can take out a few but not too much to avoid attracting the attention of observant people. Furthermore, the reason why you can refine over a hundred magic pills in a day is due to the effect of the lake water. If an observant person wants to investigate you, sooner or later they will find out that something is not right. So from today onwards you must not overdo it.”</p><br/><p>Ling Xiao instructs him word by word with a serious tone that he has never used before.</p><br/><p>You XiaoMo also knows how important it is so he agrees to all of them. After committing all these to memory, You XiaoMo suddenly thinks of another issue and asks hastily: “Elder brother Ling, can I still drink that magic water?”</p><br/><p>Ling Xiao thinks it over briefly, “Yes, but you must not hand over the magic pills too early. You should at least wait one or two days.”</p><br/><p>There’s no need for a detailed explanation, You XiaoMo knows what he means. The last time, he took one thousand and two hundred magic herbs and finished them off in four days. This speed is really too fast. For a disciple with his innate talent, it is quite abnormal.</p><br/><p>After going through all the details, Ling Xiao casts his gaze on the large field of magic herbs in front. The colorful magic herbs are growing quite well, quite unlike those the original Lin Xiao had seen before. The ones that Lin Xiao had seen were the magic herbs of Heaven peak. Because he is the elder disciple of the Grand Master and because Tang YunQi is the daughter of the Grand Master, so based on this relationship, Lin Xiao is rather close to Heaven peak. Before, when he visits Heaven peak, the disciples and seniors did not treat him cautiously just because he is from the warrior division. But this may no longer be the case now.</p><br/><p>Recently, the rumors that he is very close to You XiaoMo is very rampant. On top of that, You XiaoMo is now a direct disciple to Kong Wen. It’s hard to say if there will be those that read more into it. But Ling Xiao has not gone over to Heaven peak for some time so he doesn’t know if those people have changed they attitude towards him.</p><br/><p>“The area of this land in this dimension is quite large. Are you planning on using that piece of land to grow magic herbs?”</p><br/><p>Ling Xiao surveys the dimension. The area of this dimension is actually not considered small. Just that small lake is as big as Heaven peak.</p><br/><p>“No, I actually plan to use the whole area to plant magic herbs. But, <i>uh</i>, there’s too many weeds, I still haven’t finished clearing them.”</p><br/><p>You XiaoMo lowers his head, his cheeks blushing shamefully. It has already been ten days but he only has one pair of hands. His time is usually spent refining magic pills, basically leaving him with no spare time to weed. On top of that, he was in seclusion for four days before this, not even having the time to harvest the mature magic herbs, let alone weeding.</p><br/><p>“Given your efficiency, you may not even finish it in a year’s time.” Ling Xiao says indifferently, glancing at him.</p><br/><p>You XiaoMo can’t refute it. This dimension is so big. It is true that he may not be able to clear all the weeds in a year’s time. Thinking it over, he then asks cautiously: “Then do you have any ideas?”</p><br/><p>A gentle smile like the spring breeze suddenly blooms on Ling Xiao’s face, “Not just anyone can get the great me to lend a hand.”</p><br/><p>You XiaoMo pouts, “How many magic pills do you want?”</p><br/><p>“Twenty. And the best kind.” Ling Xiao says without the slightest bit of shame.</p><br/><p>You XiaoMo grimaces. He knew it wouldn’t be a small demand. Twenty magic pills, of the best quality at that. With his current ability, it would probably take a day. Luckily the magic herbs in his dimension is already mature. This way, he wouldn’t have to continuously go to the Hall of Enchanted Herbs to get magic herbs. He also doesn’t have to hand over half so it will save him quite a bit of time.</p><br/><p>In the end, You XiaoMo exchanges twenty top quality level one magic pills for Ling Xiao’s effort.</p><br/><p>Then a shocking scene unfolds. From where did he conjure up tornadoes? Several small tornadoes appear out of thin air, and purposefully wreaks havoc in the dimension. Everywhere they go, all the weeds are uprooted. You XiaoMo doesn’t even need to further prepare the land. In under an hour, other than where they are standing, and that field of magic herbs, every other inch appears to have met with some disaster, in a complete mess …….</p><br/><p>________________________________________<wbr>__________I don’t speak Chinese. Corrections welcomed.</wbr></p><br/><p>Hello! It’s 50 chapters and this is not even 10% of it. Time to revisit the . It’s a very longggggg story so please don’t get too attached to it. Although I don’t want to give out spoilers but this seems to be important to readers so …. This story is really just an adventure story. The bl stuff is just a side note. The steamy stuff is really next to zero in this story. Maybe once or twice in over seven hundred chapters. So please don’t expect it! It’s very light reading, the complete opposite of .</p><br/>\n</div>"}