{"title": "Chapter 59", "id": 59, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-59", "volume_title": "Volume 1", "body": "<h1>Chapter 59</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Pick up.</b></p><br/><p>The next day, You XiaoMo wakes up very early and is still full or vigor. Last night he refined magic pills for almost six hours. But that was with the help of the magic water. The effect is really extraordinary. He doesn’t feel the least bit tired. He then heads towards the front of the West side to assemble with the rest.</p><br/><p>Just when Uncle Zhao is dividing up the people, Ling Xiao appears. Not a minute earlier, not a minute later.</p><br/><p>Upon seeing Ling Xiao, the Earth peak disciples all feel very curious. Although he did go to the Earth peak canteen the last time, not everyone saw him. Most of the people’s impression of Ling Xiao are still based on the rumors they heard before.</p><br/><p>But thinking of the recent rumors, everyone turns to look at You XiaoMo. Ling Xiao showing up here most probably means he is here to see You XiaoMo <i>ba</i>!</p><br/><p>“Uncle Zhao.”</p><br/><p>Although Ling Xiao is here to pick up You XiaoMo, he is not that arrogant to ignore Uncle Zhao.</p><br/><p>Although with respect to his status and standing, Uncle Zhao really nobody in his eyes. But although the original Lin Xiao is arrogant, he still treats the elders very politely. Since he is now playing the part of Lin Xiao, it’s better if his character doesn’t depart too much from the original.</p><br/><p>Uncle Zhao had also the heard the rumors about Ling Xiao and You XiaoMo but he never did give it much thought. Now, seeing that Ling Xiao is here personally, and seeing the reactions of the other disciples looking towards You XiaoMo, he more or less figures it out. But although he understands, Uncle Zhao doesn’t say it out, only asking, “Nephew Lin, are you here to receive the disciples?”</p><br/><p>Ling Xiao raises the corner of his lips saying smoothly, “To tell Uncle Zhao the truth, Ling Xiao is here to pick up Little brother You.”</p><br/><p>Standing among the people, You XiaoMo feels his eyelids twitch. Even if he is here to pick him up, does he have to stress the word ‘Little’? Although he is not yet an adult, he is definitely not the youngest one here. Among them, there is still one that is a year younger than him.</p><br/><p>“Nephew Fu also wants to go, if Nephew Lin doesn’t mind, could you let Nephew Fu go along with the both of you to the Central lineage?”</p><br/><p>Zhao Zhen nods his head, with Lin Xiao bringing them over, he feels more at ease. So he doesn’t object and even hands Fu ZiLin over to him. Speaking about that, the one he is most worried about is Fu ZiLin. This disciple looks very even-tempered but in reality he is actually very stubborn.</p><br/><p>“I don’t mind.”</p><br/><p>Ling Xiao beams while replying. Zhao Zhen’s suggestion was what he expected. As long as it’s not Fang ChenLe, any other disciple would be fine.</p><br/><p>Zhao Zhen immediately feels relieved and calls out Fu ZiLin and You XiaoMo.</p><br/><p>The Central lineage is not the same as the other lineages. The atmosphere is more serious. The most unacceptable thing is being a blabber a mouth or enquiring about the internal matters. Therefore, after Zhao Zhen calls them up to the front, he strongly urges them to not do things that are uncalled for. They must abide to what the elders put in place. He repeats his advice to stress its importance.</p><br/><p>Even though Fu ZiLin is as cold as ice, hearing these words he nods his head slightly. Although the action is small, Zhao Zhen knows that he understands.</p><br/><p>You XiaoMo doesn’t dare to answer Zhao Zhen as indifferently as Fu ZiLin. When he finished speaking, he nods his head vigorously and also says that he understands.</p><br/><p>Seeing their repeated assurances, Zhao Zhen finally feels at ease and hands them over to Ling Xiao.</p><br/><p>With that, the three of them head towards the Central lineage. At this time, the friendly competition has yet to begin.</p><br/><p>You XiaoMo walks in the middle, strongly feeling that he is walking in the wrong position. To his left is a walking iceberg, frequently releasing puffs of cold air. To his right, is a wolf in sheep’s clothing, able to turn into the devil at any time.</p><br/><p>He didn’t realize it before so this is the tragic result. When he thinks of changing positions, Ling Xiao’s meaningful look falls on him again and again, scaring him stiff such that he can’t even think of changing positions. He proceeds in this uncomfortable situation all the way to the Central lineage.</p><br/><p>The Central lineage is located on the highest peak of WuShuang mountain. That enormous peak is located behind the other four lineages. And behind that is an endless sea of clouds.</p><br/><p>Ling Xiao brings them there via a relatively remote route so they don’t meet other disciples from the Warrior division along the way. Finally they stop in front of a huge temple gate. A black gold-rimmed plaque hangs on top of the gate. On the plaque is written grandly two words – Central lineage. The imposing air is quite extraordinary. People of lower strength would feel uncomfortable looking at it.</p><br/><p>The person who wrote those words must be very powerful. Just glancing at it, You XiaoMo’s heart starts to beat faster. He can’t help feeling his heart waver. But it’s only for a moment. Although he is not a martial artist, his soul is stronger and more resilient that normal people. This cannot be separated from him practicing the [Heavenly Soul Scroll]. If it was one of his other brothers, they might not feel this way.</p><br/><p>Fu ZiLin is a level four mage. His soul force is much stronger than You XiaoMo’s. The power of the two words have no effect on him.</p><br/><p>As for Ling Xiao, don’t even talk of making an impression on him. It wouldn’t even be strange if the person who wrote these two words is in awe of him.</p><br/><p>You XiaoMo shakes his head and finally shakes of that feeling. He raises his head and run into Ling Xiao’s gaze at him. The latter is expressionless. Seeing that he is fine, Ling Xiao withdraws his gaze. You XiaoMo then sees Ling Xiao take out a black tablet from his chest and throw it through the temple gate.</p><br/><p>The still air start to ripple outwards. The black tablet looks as if it is sinking into a swamp, slowly swallowed up by the ripples and finally disappears. You XiaoMo has seen this type of phenomenon before in the library.</p><br/><p>When he wanted to take the books off the shelves, he also needed a tablet. Later he learned that the bookshelves are protected by a barrier. If you don’t take the tablet from the old man guarding the library, even if you manage to enter the library, you still won’t be able to take the books off the shelves. On top of that, you will also be discovered.</p><br/><p>Now this situation most probably means that this is also a barrier. That black tablet is simply the key to open the barrier.</p><br/><p>After having experienced it so many times, it is not unexpected that You XiaoMo is no longer shocked by these strange happenings. In fact, the happenings in this world have long surpassed the scientific reasoning he is familiar with in his past life. If he still wants to use scientific reasoning to explain all of these unscientific events, he might as well put a knife to his own throat and kill himself.</p><br/><p>Although the temple gate doesn’t change, after the tablet disappears, You XiaoMo knows that they can now enter.</p><br/><p>Fu ZiLin doesn’t wait for Ling Xiao to speak, and walks ahead into the gate.</p><br/><p>You XiaoMo wants to follow closely but he suddenly remembers his uncomfortable position. Right at this moment of hesitation, his shoulder is pulled and held with a strength that can’t be easily denied. A familiar scent floods his nose. If it’s not Ling Xiao, who else can it be?</p><br/><p>“Beloved little brother. If you don’t want to walk, I can carry you <i>oh</i>.”</p><br/><p>Shallow laughter floats above his head.</p><br/><p>You XiaoMo unconsciously pictures himself being carried by Ling Xiao. Goosebumps immediately spring up. It’s really too scary okay. He then immediately runs for his life chasing after Fu ZiLin.</p><br/><p>Ling Xiao looks at his escaping back before raising his head and having a good laugh.</p><br/>\n</div>"}