{"title": "Chapter 54", "id": 54, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-54", "volume_title": "Volume 1", "body": "<h1>Chapter 54</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Spot on the list.</b></p><br/><p>“I heard Uncle Zhao say that you didn’t refine many magic pills this month. Did something happen?”</p><br/><p>Kong Wen looks at him calmly, his eyes falling onto his right foot. Seeing that he is walking normally, he doesn’t bring it up and just brings up the issue of refining magic pills. Since he is his Master, this is also quite reasonable.</p><br/><p>You XiaoMo had long ago prepared himself mentally for this. After all, he refined much less magic pills this month compared to last month. In fact, it’s not even half. Putting aside the doubts of Uncle Zhao, Kong Wen as his Master must have even more doubts since it’s very likely that Kong Wen accepted him as a disciple because of this issue.</p><br/><p>You XiaoMo had already thought up his excuse, immediately saying respectfully: “Master, before this, your disciple went overboard with refining magic pills. The result is there was not strength left even though the will is there. Your disciple is worried that the body wouldn’t be able to take it so decided to slow down a little.”</p><br/><p>Refining over one hundred magic pills in a day is just too uncommon. Now that he has slowed down, he finds a convenient excuse.</p><br/><p>Kong Wen also doesn’t suspect him, nodding while saying: “When refining magic pills, one must be sure to move ahead steadily and strike sure blows. This you must be sure to remember from now on.”</p><br/><p>“Disciple will sincerely follow Master’s guidance!”</p><br/><p>You XiaoMo is all respectful and earnest.</p><br/><p>Kong Wen nods in satisfaction, then lets him sit at the lowest position below him. This is arranged according to seniority. You XiaoMo is the newest disciple and also the youngest. Above him are all older brothers and sisters. It’s reasonable that he should sit at the last position.</p><br/><p>Before long, Second brother Fu ZiLin arrives.</p><br/><p>Although letting his brothers and Master wait for him seems a little self-important, but everyone more or less understands his character. No one seated shows any sign of displeasure, including the one who usually <b>makes thoughtless remarks</b>, Zhao DaZhou.</p><br/><p>But Fu ZiLin actually has the qualifications to let others wait. Not mentioning the fact that he is a level four mage, it seems that this time down the mountain, he brought some good things for Master.</p><br/><p>You XiaoMo cranes his neck and peeps outwards. He sees a black figure stepping steadily over the threshold. The first impression he gets is one as cold as ice.</p><br/><p>Fu ZiLin is very handsome. His facial features appear strongly etched. Deep features and a prominent nose, completely different from what he had in mind. He had thought that he would be pretty boy. He didn’t think that he would actually be such a handsome young man, and basically a human-type air-conditioner. This type of person if you put him next to Elder brother, you would definitely not think that he is younger than Elder brother by two years.</p><br/><p>You XiaoMo observes that since Fu ZiLin stepped inside, he only looked towards Elder brother, Master, and the other Uncles. As for his other younger brothers, he seems to overlook them completely.</p><br/><p>“Master, your disciple is back!” Fu ZiLin bows with cupped hands as he speaks in a cold and firm voice.</p><br/><p>Kong Wen doesn’t ask him to account for his lateness because this Second disciple is not someone who would come late without a serious reason. He simply nods and lets him take his place.</p><br/><p>Seeing that everyone has arrived, Uncle Zhao nods towards Master.</p><br/><p>The reason for this gathering is to discuss an important matter. I’m sure you all know that the warrior division will soon hold their grand annual friendly competition. Although it is a friendly competition, it is considered a grand event for TianXin sect, so the Grand Master of course is taking this competition seriously. The ones that went last year were ChenLe, Wu Yan and Mao Can. This year, you all discuss among yourselves who will be the ones to go!”</p><br/><p>Upon hearing this, You XiaoMo immediately becomes pensive. Friendly competition? Why has he not heard of this? It sounds like a grand occasion. Seems his seclusion left him out of the loop.</p><br/><p>But You XiaoMo has some doubts. What does the Warrior division’s friendly competition have to do with the Mage division such that they have to send people over!</p><br/><p>Seeing that the disciples are not saying anything, Kong Wen adds: “You all must be aware of the demon appearance a month ago at HePing town. Although TianXin sect did not uncover any demons, that doesn’t mean that there are no demons here. A few days ago, I, your uncles, and the Grand Master already discussed this. There must always be at least two of us guarding Earth peak at all times. As for the Warrior division’s grand friendly competition, you all can also bring some extra people. When the time comes, your Uncle Zhao will take the lead.</p><br/><p>“Master, this time will <b>disciple</b> also be going?”</p><br/><p>Fang ChenLe stands up and asks respectfully.</p><br/><p>“That sounds good, you can also choose three others to go with you.”</p><br/><p>Kong Wen considers briefly and answers him. Although Elder brother already went the last time, but if he is there then as a Master he would feel more at ease.</p><br/><p>Fang ChenLe as the Elder brother not only has a relatively high seniority, he also has popular support. Most importantly, he is cautious, well prepared and calm in the face of unexpected events. If something comes up, it would be a good thing to have him in charge. Among his seven disciples, Kong Wen feels the one he can rely on the most is this Elder brother.</p><br/><p>The other disciples are in agreement. It’s clear that Fang ChenLe is very well-liked in Earth peak.</p><br/><p>“Younger brother Fu escaped the last two times. So there is no escape this time.”</p><br/><p>Fang ChenLe smiles as he looks at Fu ZiLin at his side. The latter just stays quiet.</p><br/><p>Kong Wen also laughs out loud while nodding, saying, “That’s right. This time your Elder brother has decreed. ZiLin can’t have any excuses.”</p><br/><p>Fang ChenLe knows that Master wouldn’t object, continuing, “Third brother and Sixth brother went last year so not this year. So the second person would be younger sister NanGong <i>ba</i>. Women are more attentive. As for the last spot ……. little brother XiaoMo, it’ll be you <i>ba</i>. It’s not good to constantly be in seclusion. One should go out and experience things.”</p><br/><p>Being called on, You XiaoMo freezes then immediately raises his head, his line of sight colliding with the beaming face of Elder brother. He thought there would be no chance for him since he only entered the sect two months ago.</p><br/><p>“Elder brother, I also didn’t go last year.” Zhao DaZhou that is separated with You XiaoMo by a hair finally voices his objection.</p><br/><p>He had thought that this time would definitely be his turn. Who would have thought that the last spot would go to You XiaoMo. This little brother that he thinks nothing of, who basically doesn’t have any right to the spot based on his qualifications.</p><br/><p>Fang ChenLe had already expected that he would say that so he calmly explains: “Fifth brother, you are now at the critical point before your breakthrough. You should concentrate on refining magic pills.”</p><br/><p>Zhao DaZhou opens his mouth but is unable to say a word to counter his argument. He looks up and sees that his father doesn’t have the slightest reaction meaning he also agrees with Elder brother. He is unable to stop feeling disappointed since he thought that it will finally be his time and yet there’s nothing for him.</p><br/><p>You XiaoMo who is sitting right at the back also opened his mouth. Seeing Brother Zhao protest, he thinks of giving the spot to him but unexpectedly Elder brother is one step faster, voicing out this reason.</p><br/><p>He can’t see what advantage there would be to go over to the Warrior division. He feels that refining magic pills in order to rise in level is more important. Thinking this way, he dismisses his request to avoid being a villain.</p><br/><p>“Alright, it’s decided. You will all set out the day after tomorrow. Remember to prepare yourselves.”</p><br/><p>Seeing that everything is settled, Kong Wen lets them disperse.</p><br/><p>Uncle Zhao walks up to his son, patting his head in consolation. How can he not know what his son is thinking? Undoubtedly he wants to go over to join in the fun and play around with some small scoundrels over at the Warrior division. It would be better for him to concentrate on refining magic pills, so he didn’t object.</p><br/><p>While leaving the Assembly Hall in a daze, You XiaoMo suddenly cries out ‘ah’. Fang ChenLe and Fu ZiLin that were just about to step out turn around. One looking questioningly while the other frowns.</p><br/><p>You XiaoMo doesn’t notice. He is completely absorbed in what just came to his mind. Going over to the Warrior division, doesn’t that mean that he will have to see that bloke Ling Xiao? This is _______ too horrible!</p><br/><p>“Little brother XiaoMo, what is it?”</p><br/><p>Fang ChenLe walks over and asks him in concern.</p><br/><p>The moment You XiaoMo raises his head, he sees Fu ZiLin that is behind Fang ChenLe. Fu ZiLin glances at him somewhat impatiently. With a start, You XiaoMo quickly shifts his gaze onto the warm and gentle Elder brother.</p><br/><p>“Elder brother, this trip to the Warrior division, how many days will it be?”</p><br/><p>Taking advantage that Elder brother is in front of him, he decides to get answers to the parts he doesn’t understand.</p><br/><p>“If it goes well, it will only be five days.”</p><br/><p>Fang ChenLe laughs while speaking. He had forgotten that his little brother probably doesn’t know anything.</p><br/><p>“Then if it doesn’t go well <i>ne</i>?”</p><br/><p>You XiaoMo asks without thinking. Five days is already too long. Wouldn’t it be even longer if it doesn’t go well?</p><br/><p>“That’s hard to say. But you don’t have to worry. It won’t go longer than ten days. After all, the Mage divisions also have their own things to take care of and can’t stay too long.”</p><br/><p>Fang ChenLe feels that this little brother is getting cuter every time he sees him, saying whatever comes to his mind. He can’t help but stretch his hand and pat his head.</p><br/><p>You XiaoMo is lulled into a daze by the patting. He only comes back to his senses after they had left. He seems to have been treated like a little kid.</p><br/><p>After coming back from the meeting, You XiaoMo quickly asks around about the grand friendly competition. If he was still the You XiaoMo from over a month ago, most probably no one would answer him. But after becoming Kong Wen’s disciple, the number of people who want to suck up to him have increased. If it wasn’t because he was holed up all this time, the chatterboxes would probably have told him long ago.</p><br/><p>This so called grand friendly competition is actually an internal incentive-based competition held by TianXin sect so all disciples can participate. But since it’s a competition, there will be times when injuries happen. Internal injuries can be resolved with magic pills. Exterior injuries however cannot be treated with magic pills so in order to not affect the Warrior division’s competition, the mages are needed. On one hand, they can help with treatment. On the other hand, they can also interact with the disciples from the warrior division.</p><br/><p>This type of policy is actually quite like foreign relations. Furthermore, this is very important for the Mage divisions because it affects the futures of mages.</p><br/><p><b>Note:</b>say three say four – make thoughtless comments</p><br/>\n</div>"}