{"title": "Chapter 66", "id": 66, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-66", "volume_title": "Volume 1", "body": "<h1>Chapter 66</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>First night</b></p><br/><p>That night, in Ling Xiao’s room where outsiders can’t see, the shadow of You XiaoMo from the night luminescent pearl falls on the window. The still and absorbed appearance is very fascinating. It’s said that that a man is most charming when he is completely focused. This saying is of course not false. Ling Xiao that is sitting in front of him, other than occasionally closing his eyes, for the most time is staring at You XiaoMo.</p><br/><p>From the <b>Shu period</b> to the <b>Zi period</b>, You XiaoMo refined magic pills for a full four hours. He only stops when he uses up all his soul force.</p><br/><p>Putting the last magic pill into the bottle, You XiaoMo wipes the sweat off his forehead. Although his complexion is a little pale, he can’t help from grinning. This time, his speed in refining magic pills increased again. He refined ten high grade magic pills in four hours. Much faster than yesterday.</p><br/><p>“Elder brother Ling, here are ten magic pills. The taste should be the same as the one you ate.”</p><br/><p>You XiaoMo tidies up all the things on the tea table before handing over the bottle containing the magic pills to him.</p><br/><p>Ling Xiao looks at the bottle in his hand and then glances at his pale cheeks. Just when You XiaoMo thinks that he is going to refuse, he suddenly takes the bottle and says expressionlessly, “Next time, you don’t have to be so hurried.”</p><br/><p>Saying that, he turns around and heads into the inner room.</p><br/><p>You XiaoMo, “…….”</p><br/><p>Bastard, you should have said that earlier!</p><br/><p>When he was refining the magic pills, he thought that Ling Xiao was waiting impatiently for them. That’s why he carried on for four hours non-stop to pump out the ten magic pills. Who knew that when he finished, he actually said those words. Clearly he tricked him!</p><br/><p>After cursing inwardly, You XiaoMo then follows him into the inner room.</p><br/><p>Zi period is equal to the time between 11pm to 1am on earth. It’s now 11pm. Although not especially late, all the lights are out in the Central lineage. Exactly the time when everything is silent.</p><br/><p>When You XiaoMo walks in, Ling Xiao was just taking off his outer garment. Only a white inner robe remains. His tall slender figure is vaguely visible under the robe revealing the contours of his muscles. His manner although indifferent is still majestic and threatening. Looking on, You XiaoMo’s face suddenly flushes, much like steamed shrimp.</p><br/><p>Only now does he remember that he will soon be sleeping on the same bed as Ling Xiao.</p><br/><p>“Little brother, why are you still standing there? Get over here and sleep.”</p><br/><p>Turning around, Ling Xiao sees You XiaoMo rooted on the spot seemingly at a loss. His cheeks were no longer pale like before. Instead they are bright red. In a glance, he can tell that he is very nervous.</p><br/><p>You XiaoMo already doesn’t know what to do with his hands and feet. He says cautiously, “Elder brother Ling, I think it would be better if I put the futon on the floor for myself. Two people sleeping together is a little cramped. And adding on one more person all of a sudden, you would also not be used to it <i>ba</i>!”</p><br/><p>Ling Xiao curves his lips, “Haven’t done it yet, how do you know that I won’t be used to it?”</p><br/><p>You XiaoMo is rendered speechless. This type of thing and you still need to try it first? Nonsense!</p><br/><p>Without asking his permission, Ling Xiao walks over to him and grabs him by the arm and pulls him to the bed. He then says suggestively, “Little brother, do you need me to help you undress?”</p><br/><p>The first reaction for You XiaoMo is to use his other hand to grip his collar as if terrified that Ling Xiao would really help him undress. But when he regains his senses he almost falls to his knees. Why did he react like a woman? It’s all Ling Xiao’s fault. If he didn’t always tease him with that tone, he wouldn’t have developed such a conditioned reflex!</p><br/><p>“No, no need, I’m used to sleeping in my clothes.”</p><br/><p>You XiaoMo blushes and forces out a seemingly fair and sensible reason.</p><br/><p>Ling Xiao looks him up and down, raising the corner of his mouth: “Sleeping in your clothes, wouldn’t it be uncomfortable?”</p><br/><p>You XiaoMo laughs stiffly, “Still OK.”</p><br/><p>Hearing these words, Ling Xiao glances at him ambiguously, “Since you like it, I also won’t force you. Now, it’s time for bed <i>ba</i>?”</p><br/><p>“Of, of course.”</p><br/><p>You XiaoMo quickly takes off his shoes, terrified that Ling Xiao will suddenly change his mind. He crawls onto the bed and immediately burrows himself into a corner on the inner side of the bed. Then he furtively pulls a corner of the blanket and wraps himself up in it.</p><br/><p>When Ling Xiao lies down, he sees his weak posture like a curled up turtle. He can’t help laughing out loud. Supporting his head with one hand, he taunts him: “Little brother, do you have to be so afraid? Can it be that you’re afraid that I’ll eat you up?”</p><br/><p>“No, I think that this is just nice …….”</p><br/><p>It’s just that it’s a little unusual, that’s all.</p><br/><p>This type of feeling is actually like how two enemies who refuse to live under the same sky suddenly find themselves sleeping on the same bed. That feeling is one of extreme awkwardness. Who would have thought that they would sleep on the same bed one day. Although Ling Xiao and him are not enemies, he still feels the same way. That’s the feeling that if he were to relax his hands and feet a little, the other party would do something terrifying at any time.</p><br/><p>“As you say!”</p><br/><p>Ling Xiao languidly spits out those words, turns over and goes to sleep, no longer paying any attention to the cocooned You XiaoMo.</p><br/><p>You XiaoMo makes use of the moonlight from outside the window to see Ling Xiao closing his eyes. His relaxed and even breathing suggests that he is already asleep. This speed can almost be entered into the Guinness Book of Records.</p><br/><p>Pulling at the blanket, You XiaoMo feels that the blanket is too small. He obviously forgot about this when he was putting things in order earlier that morning.</p><br/><p>Because this is originally a one-person room, the blanket will of course not be too big. Furthermore, Ling Xiao is taller and wider than him so when he covered himself, he already used up half. On top of that, he is curled up in a corner, so his body is mostly uncovered with a huge empty space in between them. With the cold air invading, it’s so cold that he can’t stop shivering.</p><br/><p>You XiaoMo rubs both of his arms. Looks like he can only tough it out tonight. Tomorrow he will think of something.</p><br/><p>Not long after, sleepiness sets in. You XiaoMo is eventually unable to ward off his sleepiness, closing his eyes and falling asleep.</p><br/><p>Just at this time, the one that should be already asleep, Ling Xiao, opens his eyes. He turns his head and looks at You XiaoMo curled into a ball, amusement showing in his eyes. Actually, with his physique, this type of cool night air is really nothing. He can even sleep in the ice and snow. He only did this to see how long You XiaoMo can hold out before getting closer.</p><br/><p>Unexpectedly, before that happened, he actually fell asleep!</p><br/><p>Shaking his head in disappointment, Ling Xiao takes the blanket and wraps him up. He then closes his eyes again and quickly falls asleep.</p><br/><p>Ling Xiao had thought that he would be able to sleep until daylight. Unexpectedly, in the middle of the night, he is awakened by a warm body rubbing against him. When he opens his eyes he sees that the one who should be in the corner, You XiaoMo, sticking to his body like an octopus with eight feet. He even brought the blanket along with him except that there is only a corner that is still covering his thin body. The most of it still remaining in the corner.</p><br/><p>Most probably because it sensed a heat source so You XiaoMo’s body unconsciously moved over to rub against the heat source. The head rests on his chest, and maybe because it’s too stiff, so the lips move as if making some small complaints. But the hands and feet are tightly wrapped around his body, the body no longer shivering from the cold, seeming to be in an even deeper sleep.</p><br/><p>By the time Ling Xiao realizes what is going on, You XiaoMo is already hanging onto his body. Every breath he takes is full of his scent.</p><br/><p>You XiaoMo is a restless sleeper. Hanging on his body and yet he still flails around. He accidentally rubs against a certain part on the lower half of the body eliciting a slight reaction. Ling Xiao’s expression changes slightly. He quickly restrains this fidgeting body. You XiaoMo then stops moving and looks for a comfortable position. Pouting, he falls into a deep sleep. Because a certain body is starting to react, the body becomes hotter and hotter. You XiaoMo feels the increasing warmth and becomes even more reluctant to let go.</p><br/><p>Ling Xiao lowers his head and sees You XiaoMo sprawled on his chest. His mouth opens slightly suddenly showing his teeth.</p><br/><p>Luckily his willpower is extraordinary. If not, something embarrassing would have happened. Strongly pushing down the reaction, Ling Xiao is no longer able to fall asleep. With his eyes open, he stares at You XiaoMo for most of the night.</p><br/><p>The next day, You XiaoMo wakes up and finds himself sleeping in Ling Xiao’s arms. He jumps in fright and tries to get up.</p><br/><p>Unexpectedly this movement affects the eyes-closed but not really sleeping Ling Xiao. Ling Xiao opens his eyes and glares fiercely at You XiaoMo. The two arms encircling his waist don’t budge. He says thickly while breathing heavily: “You XiaoMo, just you try and move again!”</p><br/><p>You XiaoMo immediately doesn’t dare to move. He shivers and shrinks back into those arms speaking falteringly, “I, why am I sleeping here?”</p><br/><p>“Why do you think <i>ne</i>?”</p><br/><p>Ling Xiao’s husky voice spits out those words. Although the voice is very sexy, it still gives off a sinister feeling.</p><br/><p>You XiaoMo shivers. If he knew, then he wouldn’t have to ask. Thinking like this, he feels something stiff and hard poking his thigh. When he realizes what that stiff and hard thing is, his whole face, including the ears and neck turn bright red like the color of blood …….</p><br/><p>This this this, this is really too horrifying!</p><br/><p>Even though morning vigor is a normal physiological phenomenon for men, but when he thinks that his thigh is being poked by that plaything, he feels his scalp getting numb.</p><br/><p>Why is it like this right after he wakes up? Who can tell him <i>ah</i>? <i>Ah</i>?”</p><br/><p><b>Notes:</b>Shu period – 19:00-21:00Zi period – 23:00-01:00</p><br/>\n</div>"}