{"title": "Chapter 67", "id": 67, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-67", "volume_title": "Volume 1", "body": "<h1>Chapter 67</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>As long as you help me.</b></p><br/><p>You XiaoMo is not used to being in such close contact with a man. But for some reason, with just a slight move, that stiff hard thing seems to get bigger, pushing against his thigh. Not only getting hotter but he can also feel it getting harder.</p><br/><p>At this time, Ling Xiao’s arms, looped around his waist grips him tighter. Tightening around his waist as if wanting to snap him in two. You XiaoMo endures until his whole face is bright red. He finally can’t take it any longer. He feels that if he were to keep quiet any longer, he would really be snapped in two.</p><br/><p>“Elder brother Ling, can you let me go first? I ……. soon I won’t be able to breathe.”</p><br/><p>Ling Xiao glares at him again. Although he doesn’t say anything, he loosens his grip on him.</p><br/><p>You XiaoMo feels it and immediately heaves a sigh of relief. He was almost crushed to death. He then steals a glance at Ling Xiao and stammers, “Elder brother Ling, since it’s no longer early, we ……. should be getting out of bed? Also, you have to compete today <i>ne</i>!”</p><br/><p>Ling Xiao doesn’t answer, the expression in his eyes profoundly alluring. The black pupils of his eyes reflect the bright red face of You XiaoMo.</p><br/><p>A youngster of seventeen to eighteen years old. A delicate and fair radiant face. Not tall but very thin and small body. At first glance, this person’s appearance is not the type that would catch people’s attention in one glance. But after staying with him for a while, it starts to fascinate him, making him want to understand him further.</p><br/><p>You XiaoMo is a man of many expressions, frequently revealing all his thoughts on his face. Someone that is very easy to understand. It precisely for this reason that Ling Xiao always finds it hard to resist teasing him.</p><br/><p>But You XiaoMo is also the one that is most able to endure out of all the people he has met before. Clearly feeling wronged, to the extent that flames are leaping in his eyes, and yet not uttering a single word and forcing it down. But what he doesn’t know is that the more he does this, the more Ling Xiao will tease him, trying to find his breaking point.</p><br/><p>It’s just that he suddenly realizes that You XiaoMo is actually quite good looking. The fair and clear face that seems to have two pink puffy clouds on each side. Looking at them, they look like plump, juicy, and fragrant sweet honey peaches. Enticing people to take a bite. In fact, Ling Xiao does just that. Lowering his head and taking a bite out of one of his cheeks. The latter, because of extreme shock, loses his soul, simply not having any reaction whatsoever.</p><br/><p>Luckily Ling Xiao only bites him lightly but it still leaves a faint mark on You XiaoMo’s face.</p><br/><p>“Really delicious!”</p><br/><p>Ling Xiao licks his lower lip, revealing an unsatisfied expression. A pair of sharp cheetah-like eyes, fixed on You XiaoMo’s flushed pink cheeks. As if he’s thinking of taking another bite.</p><br/><p>You XiaoMo’s mind that had flown away returns to him when Ling Xiao says ‘Really delicious’. His first reaction is to cover the place where he was bitten and open his eyes wide in shock. With an expression of disbelief, “You you ……. ”</p><br/><p>“What about me?”</p><br/><p>Ling Xiao smiles until his eyes turn into slits. The irritability he felt from not sleeping the whole night, immediately disappears when he sees this expression on You XiaoMo’s face.</p><br/><p>“You, how can you bite me?”</p><br/><p>You XiaoMo puts on a tiger face and says indignantly.</p><br/><p>Ling Xiao ponders for a moment then beams while saying, “Because I feel like it.”</p><br/><p>You XiaoMo is so angry that his lips start to quiver. He glares at him saying, “You feel like it so you bite? I’m not a piece of meat on the chopping block.”</p><br/><p>Ling Xiao suddenly raises the corners of his mouth, revealing a cynical and frivolous expression, “How do you know you’re not a piece of meat on the chopping block, <i>en</i>?”</p><br/><p>The last syllable is said in an extremely sexy manner, making the listener feel the magnetism in that rich, deep and low voice.</p><br/><p>If the sisters of the Central lineage were here, they would definitely be squealing in excitement.</p><br/><p>It’s too bad that the only other person here is You XiaoMo. His whole attention is focused on the first half of Ling Xiao’s words. There’s no way for him to pay any attention to how that last word is different from normal. He is already so angry that his whole body starts quivering.</p><br/><p>“You, what is the meaning of this?”</p><br/><p>You XiaoMo gnashes his teeth. Don’t think that just because he has no combat ability, so he can be easily bullied. He is also someone that can’t be trifled with.</p><br/><p>“It exactly what you think it means.”</p><br/><p>Ling Xiao’s smile is quite moving. The clearly manly handsome face is tinged with an enchanting elegance. His tone as light as down, as if in a pretty good mood.</p><br/><p>“I ……. ”</p><br/><p>You XiaoMo widens his eyes, wanting to object but looking at the brilliant smile that makes him look like a whole different person, the courage he drummed up immediately shrivels up. The expression on his face is also immediately replaced by a cute and pitiful look, like a bullied damsel in distress, “Wasn’t it still fine last night ……. ”</p><br/><p>Ling Xiao is immediately elated. This fellow was obviously in a fit of rage, and yet in just a moment, he actually went back to his original nature. And here he thought that he had grown some balls, actually daring to talk back at him. But as happy as he is, Ling Xiao doesn’t plan on letting it go just like this. Making him unable to sleep the whole night, this debt must be paid.</p><br/><p>“Little brother, why do you think you ended up sleeping in my arms?”</p><br/><p>He also wants to know the answer to this question. Why is it that the first thing in morning, he finds himself waking up in Ling Xiao’s arms!</p><br/><p>You XiaoMo thinks that he has a good sleeping posture. Although he moved out to live by himself in his last life, when he was still living back home, his parents and his younger brother that lived in the same room never said that he had bad sleeping habits. So he always felt that his sleeping posture is very proper, just like that.</p><br/><p>But this belief is destroyed today. He really wants to scream that it’s not true but looking at Ling Xiao’s expression, it’s obvious that something must have happened last night. If not, Ling Xiao would not have any reason to say these words!</p><br/><p>Thinking like this, You XiaoMo can’t help but laugh in embarrassment, “Did something happen last night?”</p><br/><p>In an instant he changes from an indignant and justified victim to the accused. Furthermore, he is now the helpless person with all the power now being in the hands of the other person.</p><br/><p>Of course, this little lamb, no matter how it tries to disguise itself, it is still inherently a little lamb. This thing just can’t be changed!</p><br/><p>A gleam flashes in Ling Xiao’s eyes. He lies with a poker face, “Last night, you ……. after sleeping for half the night, you suddenly woke up and pressed down on me. And not just that, you had this animal strength from who knows where and you suddenly wanted to tear off my clothes. If not for the good quality of my clothes, they would have been torn to shreds by that animal strength of yours long ago.”</p><br/><p>You XiaoMo listens until he feels his heart shudder. Analyzing this long string of words, his heart feels like a well with seven buckets going up and eight buckets going down. Right until he hears those words ‘tear off my clothes’, it completely floors him such that he desperately wants to play dead.</p><br/><p>Oh my God, this person is definitely not him. No way. It must be an illusion. How can he do such things? But looking at Ling Xiao’s expression, he doesn’t seem to be lying. He is suddenly thrown into chaos. This revelation is too explosive. He had never thought that he has such a ……. <i>uh</i>, ‘hot-blooded’ side to him.</p><br/><p>“Then then then …. after that <i>ne</i>?”</p><br/><p>You XiaoMo’s tongue is in knots.</p><br/><p>“After that?”</p><br/><p>Ling Xiao raises his brows and snorts, “Of course I stopped you in time, but ……. ”</p><br/><p>You XiaoMo immediately lets out his breath, this is the best thing he has ever heard. But just as he started to relax, Ling Xiao’s ‘but’ again makes his heart jump up to his throat, <b>*peng peng peng*</b>, as if it is about to jump out. There’s still more?</p><br/><p>“But, but what?”</p><br/><p>“Although I managed to stop you, you still held on to me and refused to let go. On top of that, you wouldn’t stop flailing on top of me, keeping me awake the whole night.”</p><br/><p>Those last words were said somewhat vengefully.</p><br/><p>You XiaoMo’s ears appear to be flooded with blood, the temperature of his cheeks also rise to the boiling point. He doesn’t dare to look at Ling Xiao anymore.</p><br/><p>No wonder this morning when he woke up, Ling Xiao also immediately woke up. So he didn’t sleep the whole night. If someone were to press on him and flail about, he also wouldn’t be able to get any sleep. Like this, he really falsely accused him!</p><br/><p>“I’m sorry.”</p><br/><p>You XiaoMo is red-faced, apologizing meekly.</p><br/><p>You XiaoMo has his head lowered so he doesn’t realize that Ling Xiao is beaming. Where’s the anger? But he still doesn’t want to let him go just like that. So he clears his throat and says, “Don’t think that it will be fine with just an apology. But I can forgive you, as long as ……. ”</p><br/><p>“As long as what?”</p><br/><p>You XiaoMo eagerly chimes in. After all, he’s the one in the wrong.</p><br/><p>A devious look flashes across Ling Xiao’s eyes, “As long as you help me think of a way to soften that hard stick down there.”</p><br/><p>Saying that, he intentionally jerks his lower body.</p><br/><p>“Ah?”</p><br/><p>You XiaoMo is unable to ward off the jab. He immediately jumps up as if someone stepped on his tail. Luckily Ling Xiao didn’t use much strength to restrain his waist so he breaks free in an instant.</p><br/><p>Gaining his freedom, You XiaoMo quickly scurries into the corner, looking at Ling Xiao in shock.</p><br/><p>If he didn’t look he wouldn’t have known, but with one look he jumps in shock.</p><br/><p>His line of sight unconsciously moves to Ling Xiao’s lower half. He sees a huge tent pitched between his thighs. Only separated by a thin layer of white cloth, the huge ferocious thing is faintly visible. Thinking that he was just jabbed by that plaything, You XiaoMo feels his scalp getting numb.</p><br/><p>That’s really too big <i>ba</i>?</p><br/><p><i>Ah pei</i>, that’s not the most important thing now. Ling Xiao actually wants him to help him …….</p><br/><p>________________________________________<wbr>__________</wbr></p><br/>\n</div>"}