{"title": "Chapter 76", "id": 76, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-76", "volume_title": "Volume 1", "body": "<h1>Chapter 76</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Looting ice sculptures.</b></p><br/><p>“Elder brother Ling?”</p><br/><p>You XiaoMo calls Ling Xiao. He feels that Ling Xiao is a little strange today.</p><br/><p>Ling Xiao coughs, “It’s not that there is no way, it’s just that my way would probably damage the magic herb inside, so we have to find another way. When I came in just now, I discovered that the construction of this ice cave is a very unusual. It doesn’t seem like it is man-made by hatchets and chisels. Instead it feels as if it was formed by spiritual energy.</p><br/><p>You XiaoMo takes a deep breath. There really is a very strong spiritual energy.</p><br/><p>This is really awesome. It’s so unexpected that such a magical place exists in WuShuang mountain. If it was really formed by spiritual energy, then all the ice sculptures in this ice cave may be made of super concentrated spiritual water.</p><br/><p>“Elder brother Ling, if these ice sculptures are really made from spiritual energy, then how can we take out the magic herb?”</p><br/><p>You XiaoMo’s face fills with hope. It’s not as if he doesn’t have magic herbs. But those are level one, two and three. Level four and above, he doesn’t have a single stalk.</p><br/><p>That’s why he is excited when he sees the magic herb inside the ice sculpture. Because he already saw it in Kong Wen’s courtyard so although he doesn’t know what level it is, it must definitely be level four and above.</p><br/><p>“You can try using the soul force.”</p><br/><p>Ling Xiao suggests gently while looking at him.</p><br/><p>You XiaoMo immediately closes his eyes and does as he says, releasing his soul force and slowly covering the ice sculpture. And then a shocking scene happens. When You XiaoMo’s soul force touches the ice sculpture, the naked eye can see that the ice sculpture melts quickly. Seeing this, You XiaoMo immediately puts forth more soul force. The originally half the size of a person ice sculpture immediately melts to form a pool of spiritual liquid with shocking spiritual energy. The magic herb that was enclosed in the spiritual liquid shakes lightly, with leaves as fresh as jade, with no signs of damage.</p><br/><p>You XiaoMo immediately takes out a small spade from his magic bag. With light hands and feet, he digs out the magic herb along with the dirt around its roots.</p><br/><p>This stalk of magic herb is in a very good shape. It’s obvious even to the naked eye that the roots, stems and leaves are bursting with spiritual energy, to the extent that it is even better than the magic herbs watered with magic water in You XiaoMo’s dimension. Maybe it’s because it has been growing all along in a place full of spiritual liquid, so it is always bathed in the perfect environment, unlike the magic herbs in his dimension, only watered three or four times.</p><br/><p>After admiring it endlessly, You XiaoMo transfers it into his dimension by thought.</p><br/><p>“Elder brother Ling, which do you think is better? This spiritual liquid or the magic water in the dimension?”</p><br/><p>You XiaoMo uses his hand to scoop up a handful of spiritual liquid, feeling as if the concentration of the spiritual liquid is higher than that of the magic water.</p><br/><p>Ling Xiao had moved elsewhere to check things out when he was digging out the magic herb. Hearing his words, he doesn’t even hesitate before replying, “Of course magic water is better.”</p><br/><p>“Why?”</p><br/><p>You XiaoMo turns around and asks.</p><br/><p>“This ice cave was formed because there are a lot of contraptions underground. Those contraptions mutually act on each other to form this inconceivable phenomenon. But the spiritual liquid in here only absorbed the spiritual energy from WuShuang mountain and was formed by compression. If we consider the purity, it can’t compare to the magic water in your dimension. But ……. ”</p><br/><p>Ling Xiao doesn’t even turn back, landing a kick on a sculpture of a beautiful figure. His foot lands squarely on the face of the beautiful ice sculpture. You XiaoMo turns to look and can’t stop from pouting, continuing from his words, “But what?”</p><br/><p>“But this spiritual liquid is not of no use. You can store them up and use them as leverage.”</p><br/><p>Ling Xiao turns around, a sinister aura is suddenly apparent in his smile. You XiaoMo sees this and feels his spirit waver wondering if he is mistaken.</p><br/><p>“Are you saying to give away the spiritual liquid?”</p><br/><p>You XiaoMo says in surprise.</p><br/><p>“Thats right, spiritual liquid to the mystics of LongXiang continent is a very rare treasure. It can be used to grow magic herbs, and it can also be used like how you use the magic water to replenish the soul force. That’s right ……. ”</p><br/><p>Ling Xiao suddenly turns around, his profound eyes shining as he looks at You XiaoMo, “Didn’t you say that you were going to auction off the magic pills? This spiritual liquid can also be auctioned off.”</p><br/><p>“Really?”</p><br/><p>You XiaoMo’s shrewd eyes suddenly light up.</p><br/><p>“Of course not.”</p><br/><p>Ling Xiao feels the itch in his heart. Why did he not find this pair of eyes so lively before? Because of that, on a whim, he automatically teases him again.</p><br/><p>You XiaoMo’s beaming face immediately falls. Bloody hell, actually deceiving him at this time. Does he have to be that mean ah?!</p><br/><p>When Ling Xiao sees the look of resentment on his face, he immediately recovers. He clears his throat and laughs <b>*ha ha*</b>, “Just kidding. Of course it’s real. This spiritual liquid would probably fetch a much higher price than your Fasting magic pill. Alright, hurry up and take all the ice sculptures. We have to rush back before the patrol.”</p><br/><p>You XiaoMo glares at him saying, “There aren’t many barrels left in the dimension. Probably not enough to hold the spiritual liquid.”</p><br/><p>Ling Xiao thinks it over and comes up with a way, “First, don’t melt the ice sculptures. Try to see if you can cut them out using your soul force. If you can, move them in chunks. This will be more efficient and much faster than melting them into spiritual liquid.”</p><br/><p>You XiaoMo thinks that his way is not bad so he starts to do as he suggests.</p><br/><p>Since the soul force can melt the ice sculptures, so cutting them is not a difficult thing. A controlled soul force in the form of thin beam cuts across the bottom of the ice sculpture. Soon the ice sculpture separates from the floor and is moved into into the dimension by You XiaoMo. A smooth glossy surface like a mirror remains on the cut surface of the floor.</p><br/><p>Finding this method very effective, You XiaoMo energetically throws himself into it.</p><br/><p>Because Ling Xiao has nothing to do, he helps out by looking to see which ice sculptures has magic herbs or other good stuff hidden in it and then tells You XiaoMo to let him come cut it.</p><br/><p>Both of them working together, the speed is pretty fast. In two hours, they cut away one twentieth of the ice sculptures in the ice cave. You XiaoMo is the first to stop because his soul force is about to be depleted.</p><br/><p>“Lets stop here for today. We’ll find another time to come again later. You have already harvested quite a lot, enough to use for now.”</p><br/><p>Ling Xiao walks to his side and puts his arm under his armpit and hauls the weak him up from the floor.</p><br/><p>You XiaoMo nods. Although he wants more, the harvest this time is quite a lot. Other than the pile of ice sculptures in the dimension piled up like a small hill, there are also ten over stalks of magic herbs. But because he doesn’t recognize magic herbs of level four and above, they are also piled up together for now.</p><br/><p>When the two of them leave the ice cave, the sky is already dark.</p><br/><p>The back of the mountain is shaded by dense trees that cover the mountain. When the sky gets dark, it becomes even harder to see anything. Bleak and dreary cold wind penetrate the bones. Occasionally the roar of wild beasts can be heard. You XiaoMo can’t help but rub both his arms. His legs are weak. If not for Ling Xiao holding him at his waist, he would have ended up sitting on the ground a long time ago.</p><br/><p>“I’ll piggy-back you <i>ba</i>.”</p><br/><p>Ling Xiao says in a low voice next to his ear. The hot breath covers his ear making it both numb and ticklish. You XiaoMo’s whole ear turns red from his breath. He can’t help but rub his ear, “Can’t you use some other way?”</p><br/><p>Ling Xiao’s lips curve up, his smile carries a hint of mockery. He hangs one of his arm over his shoulder saying, “Little brother. Are you telling me that you prefer the princess hold?”</p><br/><p>“Then piggy-back it is <i>ba</i>.”</p><br/><p>You XiaoMo says immediately. Princess hold? He is not a woman.</p><br/><p>“Then get on <i>ba</i>.”</p><br/><p>Ling Xiao turns his back to him. He bends down slightly revealing the strong powerful contours of his back, slender with perfect proportions, with a feel of perfect tension. Even the back is so perfect, no wonder so many women attack him with such starry-eyed infatuation. Comparing oneself to him will only make one die of frustration.</p><br/><p>You XiaoMo hesitates a little before climbing on his back huffing and puffing. He loops both his arms tightly around his neck. Close contact between men is nothing strange, so in order not to fall off, he also doesn’t act awkwardly bashful.</p><br/><p>Feeling the warm body climbing up his back, Ling Xiao reveals a crafty smile of success. When he straightens up his body, both his hands firmly grasp the the two perfectly round and elastic round orbs of You XiaoMo’s butt. In the morning he already felt it, You XiaoMo’s butt is very elastic. It feels very soft when he was sitting on his thigh, causing the lust in his eyes to almost come rushing out.</p><br/><p>Feeling his butt being grasped by two hands, You XiaoMo stiffens.</p><br/><p>Letting a man rub his butt is a little awkward. Although the other party is doing it for his own good, he still feels a little awkward inside.</p><br/><p>There’s no helping it. You XiaoMo immediately says in his heart. We are both men. It’s no big deal. It will be over in a bit.</p><br/><p>Soon he feels himself soaring. The <b>*hu hu*</b> cold wind is whistling past on both sides of him. Because Ling Xiao’s body is shielding him, You XiaoMo doesn’t feel the least bit cold. Instead he feels that the warmth from his body is making him feel especially warm. If it is possible, he doesn’t want to leave.</p><br/><p>Ling Xiao’s speed is very fast. Fifteen minutes later, they are out of the back of the mountain, reaching the small path that they were on during the day. From far, they can see the lamps of the Central lineage. Making use of the cover of moonlight, Ling Xiao dodges past the guards patrolling outside to the wing of the house. Luckily the guards have just started patrolling so they haven’t reached them. Also the room still has the barrier he set up before so no one discovers that were not in the room for almost four hours.</p><br/><p>After entering the room, Ling Xiao puts You XiaoMo down, “Stay in the room. I’ll be back in a bit.”</p><br/><p>He turns and leaves.</p><br/><p>You XiaoMo immediately asks, “Where are you going?”</p><br/><p>“I’ll tell you when I get back.”</p><br/><p>Ling Xiao leaves right after saying that. Leaving the room, he reinforces the barrier before flying quickly into the dim of the night.</p><br/>\n</div>"}