{"title": "Chapter 94", "id": 94, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-94", "volume_title": "Volume 1", "body": "<h1>Chapter 94</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Assessment (I)</b></p><br/><p>After that, You XiaoMo used two days to try refining thirty magic pills.</p><br/><p>Although the quality of the magic herbs is very low, it is not completely of no use to You XiaoMo. Because of the low quality, the magic herbs contain quite a bit of impurities. You XiaoMo makes use of this point to practice his ability to distill level two magic herbs.</p><br/><p>After two days of experimenting, he figures out that he can at most distill the magic herbs three to four times. This number is already considered very high for other mages because ordinary mages can only distill level two magic herbs one to two times, and not any more than that. On top of that, the quality of the magic herbs is not high so the resulting magic pills can only be described as ‘poor’. Furthermore, the risk remains as high as thirty five percent.</p><br/><p>But after several rounds of distillation, You XiaoMo is able to reduce the risk of level two magic pills. He reduced the risk of low grade level two magic pills to fifteen percent. Although it still can’t compare to the high grade magic pills he refined before, but for low grade magic pills, it is considered pretty good. Some people are too poor to buy a single high grade magic pill even after saving up for it their whole lives.</p><br/><p>After sighing with emotion, You XiaoMo no longer hides in his room refining magic pills. For the remaining day, he starts to learn to interact with his neighboring disciples, gaining a lot of useful information from them.</p><br/><p>Because the assessment is tomorrow, the disciples that came in half a year ago like him are all very nervous because tomorrow’s assessment will affect their future. It’s not possible for them not to be nervous.</p><br/><p>You XiaoMo is already a level two mage so he is not worried. It’s just that he finds it unexpected that all three peaks will be undergoing the assessment together.</p><br/><p>“Elder brother Chen, why do the three peaks hold the assessment together?”</p><br/><p>You XiaoMo asks a Big brother who speaks frankly and confidently.</p><br/><p>Brother Chen turns around and sees that You XiaoMo is the one that asked the question. He actually doesn’t want to answer him but seeing that the surrounding brothers are all looking at him wide-eyed, he feels that it’s not good if he doesn’t answer, “This rule was put in place by the founder of our Mage division to promote interaction and friendship among the three major peaks. But with the passing of time, this assessment lost it’s original intention and turned into a big contest between the three major peaks.”</p><br/><p>This Brother Chen was the one that went to the Stone room together with You XiaoMo at that time to train the soul force. The one that was sent flying after he accidentally caused his cauldron to explode.</p><br/><p>At that time he was embarrassed by You XiaoMo’s instant success. Then, when You XiaoMo was praised by Fifth brother, his heart became even more unhappy with You XiaoMo. And when he found out that he was accepted by Kong Wen as a disciple, his heart became even more dissatisfied.</p><br/><p>But after that, he rarely saw You XiaoMo again. Now seeing him once more, his heart is still a little unhappy but he no longer shows it on his face.</p><br/><p>“Brother Chen, according to what you said, if we do badly, wouldn’t that mean we would lose face in front of everyone?”</p><br/><p>You XiaoMo becomes aware of the conflict between the three major peaks for the first time. If it continues going on like this, the relationship between Earth peak and Heaven peak would reach an extent where they can no longer reconcile their differences, very disadvantageous for the inner workings of TianXin sect.</p><br/><p>“That’s for sure. Especially for you Brother You. You are Kong Wen’s direct disciple. If you were to lose face in front of everyone, the result would be unimaginable!”</p><br/><p>When Brother Chen speaks about You XiaoMo, there is an added faint gloating at his misfortune.</p><br/><p>“Thank you for your concern. I will try my best.”</p><br/><p>You XiaoMo smiles as he answers.</p><br/><p>Who is concerned about you? Brother Chen snorts <b>*qi*</b>.</p><br/><p>Although he got the information that he wanted, You XiaoMo doesn’t leave immediately, hanging around with everyone for a bit.</p><br/><p>In the evening, a disciple comes over to inform You XiaoMo that the assessment tomorrow will be held in the morning during the <b>Si period</b>. Everyone is to assemble at the Hall of Enchanted Herbs before the Si period.</p><br/><p>After sending the disciple off, You XiaoMo closes the door and goes to sleep. He doesn’t seize this time to refine magic pills. After all, nothing much can be done in a night. Also, it has already been a long time since he had a good rest.</p><br/><p>Ling Xiao didn’t come to find him that night. Maybe he is busy so You XiaoMo doesn’t see him even after he woke up and went to the assembly point.</p><br/><p>This time the one that leads them to the assessment is Kong Wen.</p><br/><p>Although the disciples undergoing to assessment are those that entered the sect about half a year ago, adding them up, it still amounts to a considerable number. And they are all the future lifeblood of the three major peaks so Kong Wen attaches great importance to this matter.</p><br/><p>Their destination is the Hall of Mages.</p><br/><p>The Hall of Mages is the most peculiar looking building in TianXin sect. Its outer shape is that of a black cauldron, making it look very distinctive. There are two powerful stone guardian lions flanking the entrance. Their eyeballs are carved out of red jade that seem to give of rays that can see through a person’s heart. Just one look and you wouldn’t dare to look at them again.</p><br/><p>An inscribed dark red sandalwood plaque hangs on top of the building. On it is inscribed clearly ‘Hall of Mages’. Three large and simple characters written with forceful strokes, clearly the work of a great Master.</p><br/><p>Kong Wen says a few words to the two guards standing outside the Hall of Mages before leading them inside.</p><br/><p>You XiaoMo follows behind everyone. He looks up at the plaque of the Hall of Mages and feels that it is very majestic. Then he looks in all directions but doesn’t see anyone from Heaven peak or Flying peak. Maybe they haven’t arrived or they could already be inside.</p><br/><p>Walking into the Hall of Mages, a slight medicinal fragrance immediately floods the nose, instantly lifting spirits and easing minds.</p><br/><p>The main hall is very spacious roughly able to hold more than five hundred people. From the outside one can’t actually tell that it is so wide, making it suddenly feel bright and open. There are groups of people standing inside chatting in groups of two to three. Most of them are very young, some not even older than fifteen.</p><br/><p>Hearing the sound of footsteps, they look towards the entrance. Seeing Kong Wen at the lead, everyone’s questioning eyes immediately change to looks of respect.</p><br/><p>Although Kong Wen is from Earth peak, no matter how you look at it, he is still a high level mage and also their senior. Even if they look down on the disciples of Earth peak, they still don’t dare to show any inkling of that in front of him.</p><br/><p>You XiaoMo doesn’t recognize the people inside but the disciples around him do.</p><br/><p>Upon seeing them, the happy chatting voices quiet down. Their faces also look rather unhappy. You XiaoMo guesses immediately that these disciples are most probably from Heaven peak.</p><br/><p>A middle-aged man sporting a black beard steps out from the crowd. Kong Wen turns around and tells the disciples to wait for him where they are before walking up to that man.</p><br/><p>You XiaoMo finally recognizes that person. He is Mo Gu, the Heaven peak elder he met when he went down the mountain the first time. A level five mage.</p><br/><p>“Brother Kong, why are you bringing them over personally this time? Where is Brother Xiao?”</p><br/><p>Mo Gu cups his hands as he bows towards Kong Wen. His seniority is lower than Kong Wen so it is only right that he bows.</p><br/><p>Kong Wen nods his head slightly, “He had something to do so it’s up to me to bring them this time. It’s almost time to start. Flying peak is not here yet?”</p><br/><p>Brother Xiao is one of the Elders that was there when You XiaoMo faced the ‘combined judgement of three courts’. Before he was always the one that led the disciples over for the assessment. So Mo Gu is a little surprised that it is Kong Wen this time.</p><br/><p>Just as he says these words, sounds of footsteps can be heard coming from the entrance.</p><br/><p>Kong Wen and Mo Gu look over at the same time. The person leading the way is the master of Flying peak, Zhou Yu. He has a mottled grayish white beard with a kindly face, looking very much like a friendly and benign person. Like Kong Wen, he is also a high level mage with considerable prestige but is especially low profile. This is one of the reasons why he is always the peacemaker when conflicts arise between Heaven peak and Earth peak.</p><br/><p>Because of his low profile, some people would sometimes forget about his existence. Not only that, the disciples of Flying peak are also just as low key.</p><br/><p>As for coming just in time, Zhou Yu apologizes very politely. Kong Wen treats him indifferently while Mo Gu says a few flattering words.</p><br/><p>Zhou Yu strokes his beloved beard with the same slight smile on his face. A smile that is just right, so as to not be irritating. It shows that he really has the ability to act as a peacemaker.</p><br/><p>“It’s time. Gather up the disciples <i>ba</i>. Then the testing will commence.”</p><br/><p>Kong Wen says these words to the two of them then turns to walk back to his own disciples.</p><br/><p>Zhou Yu and Mo Gu return to their own disciples wordlessly, and start to make arrangements for the assessment.</p><br/><p>This assessment is for the disciples that TianXin sect took in half a year ago. Some are already formal disciples while some are still probationary disciples. Although the status is different, the assessment is still the same. Of course there are also a few people that entered a few days earlier or later.</p><br/><p>Kong Wen calls his disciples up to him. He didn’t ask You XiaoMo to stand in front of him just because he is his direct disciple. After instructing them on things they should pay attention to during the assessment, he starts to arrange them in order.</p><br/><p>In order to prevent chaos, each disciple from each peak is given a tablet. A number is carved on each tablet. During the assessment, the disciples will go up according to the numbers called.</p><br/><p>Earth peak has a total of twenty four disciples. This number is a little less than the year before but it’s still consistent with the average. Heaven peak and Flying peak also have twenty four each, but their quality is clearly better than Earth peak.</p><br/><p>You XiaoMo receives a yellow tablet that has the number seven on it.</p><br/><p>He glances over to Heaven peak and Earth peak. They have red and green tablets respectively. Clearly it’s to distinguish the disciples.</p><br/><p>The one presiding over the assessment is a Senior from the Hall of Mages. Seeing that everyone has gotten a tablet, the Senior announces the start of the assessment. With these words the floor suddenly shakes and nine stone platforms immediately rise from under the floor.</p><br/><p><b>Note:</b>Si period – 09:00-11:00</p><br/>\n</div>"}