{"title": "Chapter 98", "id": 98, "volume": 1, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-98", "volume_title": "Volume 1", "body": "<h1>Chapter 98</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Inner demons of the void.</b></p><br/><p>“If an oath is useless, why would Master make you swear it?”</p><br/><p>Kong Wen says in a deep voice. He then explains the general points on oaths that relate to mystics. In brief, oaths are like a checkpoint type of barrier. If you break an oath, no matter if you’re a mage or martial artist, this oath will follow you forever, like an inner demon. It would only disappear if you manage to defeat it, or ……. if you yourself disappear.</p><br/><p>If you are a mage, it is a hundred percent certain that you will remain at that same level from that point onwards. If you are a martial artist, it is even worse. When training to have a breakthrough, the oath will wind around you. At the least, it will leave you with a severe injury. At the worst, it would leave behind a hidden danger making you stuck in that state. That’s why a lot of martial artists and mages won’t swear an oath lightly.</p><br/><p>You XiaoMo listens until he starts to drip with cold sweat. Luckily he didn’t break the oath he swore the last time at the Central lineage. If not that plaything would latch on to him like an infection that reaches the bone. Then he will have no hope of ever rising in rank.</p><br/><p>But speaking of being loyal to TianXin sect, You XiaoMo feels that he definitely doesn’t feel much attachment to TianXin sect. Furthermore, he has no need for TianXin sect’s alchemical techniques. If he were to let himself be controlled by TianXin sect for a useless volume of alchemical techniques, isn’t that just not worth it?</p><br/><p>Luckily Kong Wen didn’t ask him swear the oath right away. Passing on the alchemical techniques is a serious matter. Even though he is one of the three highest level mages of TianXin sect, he still can’t pass on the alchemical techniques to his own disciple without prior authorization. He still has to report to the higher ups and wait for the elders to discuss it before making their decision.</p><br/><p>This lets You XiaoMo heave a sigh of relief.</p><br/><p>“Little Seven, this is as far as Master can help you. What comes next will depend on your own efforts. Also, Master promised you the last time that if Elder brother and Second brother passed Uncle Ye’s test, Master would grant you a request. This matter is now valid so have you thought about what you want?”</p><br/><p>Kong Wen says warmly.</p><br/><p>“Thank you Master. But I still haven’t decided. Can it wait until I have decided?”</p><br/><p>He almost forgot all about that matter.</p><br/><p>“Yes. You can tell Master whenever you have decided.”</p><br/><p>Kong Wen nods his head.</p><br/><p>After taking his leave from Master, You XiaoMo trots all the way back. He comes across a lot of brothers on the way. Seeing him, all of them become very excited, congratulating him one after another for passing the assessment. Some of then even slapped him forcefully on the shoulder, praising him greatly for beating the most outstanding Heaven peak disciple, Jiang Liu. All of them can’t hide the joy in their hearts, especially the brothers that were mocked by Heaven peak before.</p><br/><p>You XiaoMo rubs his nose helplessly. He didn’t think that this matter would spread so quickly.</p><br/><p>After bidding farewell to those brothers, You XiaoMo returns to his own room. He finds out that the brothers next door have not returned. Remembering that two of the brothers also passed the test, he guessed that they must be out celebrating with everyone.</p><br/><p>Pushing open the door, You XiaoMo is just about to walk in when his steps suddenly come to a halt. He feels that there is an additional familiar scent in the room. Raising his head, he sees a figure stepping out from behind the folding screen. Dressed in a set of magnificent white robes, the man’s body is slim and graceful.</p><br/><p>Seeing him, You XiaoMo’s eyes immediately light up, “Elder brother Ling, how come you’re here?”</p><br/><p>“Why? Are you not happy to see me?”</p><br/><p>Ling Xiao narrows his eyes slightly but a smile escapes from his lips.</p><br/><p>“No, no, I’m also looking for you.”</p><br/><p>You XiaoMo quickly shakes his head, bouncing happily up to Ling Xiao, “Elder brother Ling. I have some good news to tell you. I already passed the test and am now a formal disciple of TianXin sect. Now I can go down the mountain whenever I want.”</p><br/><p>Ling Xiao places his palm on his head and smiles lightly, “I already know. But these things you’re telling me, the last bit is what you really want to tell me <i>ba</i>?”</p><br/><p>You XiaoMo laughs <b>*hei hei*</b>. That is exactly his intention.</p><br/><p>“The matter with the auction, I’ve already arranged it. When the time comes, you just have to prepare the things and we can go at any time. But before that, we must first settle the thing with you.”</p><br/><p>That is the reason why Ling Xiao is here.</p><br/><p>“Me? What about me?”</p><br/><p>You XiaoMo asks in surprise.</p><br/><p>Ling Xiao suddenly pinches his nose and snorts, saying, “Are you telling me that Kong Wen didn’t bring up the matter regarding that volume of alchemical techniques?”</p><br/><p>You XiaoMo is unable to breathe and hastily pulls away Ling Xiao’s hand, saying in surprise, “How did you know? Master really did bring it up, just before this. Also, he said I would have to take an oath if I wanted to study them. I was just thinking about discussing this matter with you <i>ne</i>!”</p><br/><p>Regarding the fact that he would be the first one that he looks for when something happens, Ling Xiao is very pleased with that. Because this proves that You XiaoMo is already starting to get used to his presence. He is also starting to depend on him more and more. He supposes that with time, this dependence will make him unable to leave his side.</p><br/><p>“This matter is not hard to understand. You displayed extraordinary talent in the Hall of Mages, taking down Heaven peak’s disciple in one fell swoop. Based on this alone, it is enough to make TianXin sect regard you with importance. Although your innate talent is a restriction towards your future development, not all core disciples of TianXin sect are high level mages. In light of your stellar performance, if Kong Wen doesn’t reel you in, that would mean that he just appears more impressive than he really is.”</p><br/><p>Ling Xiao speaks confidently. Although he did go see the assessment for himself, all these are just guesses.</p><br/><p>You XiaoMo looks at him in admiration, praising him sincerely, “Elder brother Ling, you’re really incredible. The assessment just ended and you already know so much. Then, what do you think I should do? I already have the Heavenly Soul Scroll. TianXin sect’s volume of alchemical techniques don’t seem to be of much use to me.”</p><br/><p>He doesn’t want to take the pledge. He doesn’t want to be restrained for no reason by an oath just for a useless volume of alchemical techniques. But he can’t refuse because once he does, that would mean that he has no intention of being loyal to TianXin sect. If that happens, the result would be even more disastrous than taking the pledge. He can even imagine Master’s abrupt change in expression at that time.</p><br/><p>“That volume of garbage is really of not much use to you.”</p><br/><p>Ling Xiao walks towards the inside.</p><br/><p>You XiaoMo immediately follows him while trying to flatter him, “Elder brother Ling, you are so powerful. Do you have a way for me to not take the pledge and yet not make Master suspect me?”</p><br/><p>Ling Xiao glances at him with a twinkle in his eye. He lifts up his hand and raps him on the head, “So you’ve actually learned the art of <b>flattery</b>.”</p><br/><p>You XiaoMo pouts as he covers his head. He curses in his heart that he is only doing what he must!</p><br/><p>“Come here.”</p><br/><p>Ling Xiao walks to the bed and sits down, beckoning him over with his finger.</p><br/><p>The smile on his face is clearly a gentle one yet it undeniably makes You XiaoMo feel as if a big-tailed wolf is waving to him. That appearance, one look would make the heart feel ill at ease but he has no other choice. The person he can rely on the most now is Ling Xiao.</p><br/><p>Walking over as slowly as he can, You XiaoMo gives out a silly laugh, “Elder brother Ling, what are you doing?”</p><br/><p>“Take off your shoes and get on the bed. Then I’ll tell you.”</p><br/><p>Ling Xiao looks at him teasingly, pointing to the space at his side.</p><br/><p>You XiaoMo’s face slowly starts to get a little red. He is obviously thinking of things that he shouldn’t be thinking of. The feeling gets stronger and stronger until he really wants to turn around and leave, but he can’t …….</p><br/><p>Taking off his shoes, he slowly climbs onto the bed. You XiaoMo sits cross-legged in front of Ling Xiao.</p><br/><p>Ling Xiao suddenly moves closer to him, the tip of his nose not even one centimeter away from him. The hot air from his breath is like the steam rising from boiling water, spraying onto You XiaoMo making his ears turn red.</p><br/><p>“Elder brother Ling ……. ”</p><br/><p>You XiaoMo sounds like a kitten, not knowing where he should put his hands.</p><br/><p>Ling Xiao raises the corners of his lips slightly, “No need to worry. First I’ll tell you how oaths are made.”</p><br/><p>You XiaoMo blinks. How oaths are made? It seems Master actually didn’t tell him. He only roughly described the restrictive and harmful effects that oaths have on mages and martial artists.</p><br/><p>“Do you know why oaths are effective on martial artists?”</p><br/><p>Ling Xiao asks.</p><br/><p>You XiaoMo shakes his head. This is what he really doesn’t understand. If oaths are really effective, all the people of the twenty first century would be wiped out since they always swear oaths only to break them again and again.</p><br/><p>Ling Xiao didn’t expect that he would know. He says wistfully, “Outside the universe, there is a void. In it live peculiar creatures that are called the void. When a martial artist swears an oath, it would break through the void and enter the oath-taker’s body, attaching onto the surface of the soul. If the martial artists breaks the oath, the void would drill into the soul much like an evil infection that reaches the bones, only disappearing when the oath-taker is destroyed.</p><br/><p>You XiaoMo’s feels his hair stand up in terror. He rubs his arms vigorously, “Is there really no way to defeat this void?”</p><br/><p>Ling Xiao smiles, saying, “There isn’t. One can only rely on willpower to defeat the void. Only this way will one be able to shake off the void forever. But after shaking off the void, there is a tremendous benefit.”</p><br/><p>“What benefit?”</p><br/><p>You XiaoMo’s eyes light up as he asks hurriedly.</p><br/><p>Ling Xiao looks at his sparkling eyes and suddenly feels an itch in his heart. He narrows his eyes saying, “The benefit is, you no longer have to fear the void anymore when swearing an oath. Because the oath would make a different void appear. If the void that appears is smaller than the one before, then even if you break the oath, nothing would happen.”</p><br/><p>“Such good benefit <i>ah</i>. Then ……. ”</p><br/><p>You XiaoMo exclaims happily.</p><br/><p>“Yes <i>ah</i>, so do you want to try?” Ling Xiao smiles deviously as he asks softly.</p><br/><p>You XiaoMo looks at his expression and immediately comes back to his senses. He hastily waves his hand laughing <b>*hei hei*</b>, saying, “I’m just joking.”</p><br/><p><b>Note:</b>beat horse fart – flatter</p><br/>\n</div>"}