{"title": "Chapter 103", "id": 103, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-103", "volume_title": "Volume 2", "body": "<h1>Chapter 103</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Appraising treasures.</b></p><br/><p>You XiaoMo raises his head and sees the gigantic auction house towering in front of him. He can’t help but gasp in amazement.</p><br/><p>This auction house is really too big. Even the Olympic games’ iconic structure ‘Bird’s Nest’ is not as big as this Big Mac in front of his eyes. At that time he made a special trip there to see the Olympic games. Then he was shocked by the grandness and size of the Bird’s Nest. Now, looking at the auction house of HunJi city, he realizes that there’s just no comparison between these two things.</p><br/><p>The Bird’s Nest is not even half the size of the auction house. Furthermore, the building material is obviously not something ordinary. Completely constructed with black-colored stone. It isn’t clear how many years it has been but there is no sign of wear and tear on the surface.</p><br/><p>The name of this Big Mac is the Seven Stars auction house. It is said that it is backed by HunJi city’s master, a very strong and powerful ace. Under his command are many strong soldiers and valiant generals. That’s why no one has ever dared to stir up trouble at the Seven Stars auction house.</p><br/><p>Outside the door of the Seven Stars auction house, there are twenty or so guards equipped with sharp weapons and dressed in black uniforms. Their eyes are penetrating like hawks, constantly fixed on the people coming and going on the street as well as the people going in and out of the auction house. You XiaoMo can faintly feel the power oozing out them, his amazement showing in his eyes. These people are really impressive. No wonder this is Long Xiao continent’s third largest city. Behind its prosperity is a powerful leader.</p><br/><p>When they appear, seven or eight out of the twenty or so black-clothed guards set their eyes on them. Accurately speaking, they fall on Ling Xiao. As for the puny You XiaoMo, he is completely ignored by them.</p><br/><p>After getting off the carriage, Ling Xiao strokes the Raging fire horse near its ear and says softly, “Go. Find a place on your own and wait.”</p><br/><p>With those words, the Raging fire horse turns the carriage around and gallops towards the city gate.</p><br/><p>You XiaoMo hears the noise and turns around to witness this scene. He exclaims and is about to rush over to bring back the Raging fire horse when Ling Xiao calmly pulls him back.</p><br/><p>“Why did you pull me back? The horse got away.”</p><br/><p>You XiaoMo immediately says anxiously.</p><br/><p>“Don’t worry, he can’t run away.”</p><br/><p>Ling Xiao consoles him.</p><br/><p>You XiaoMo turns around and looks at him, seeming to ponder the truth in his words. But no matter if it’s true or false, it’s already too late because the Raging fire horse is gone without a trace.</p><br/><p>Under the watchful eyes of the black-clothed guards, Ling Xiao just picks You XiaoMo up and goes with flow of people into the auction house.</p><br/><p>Although the auction has not started there are quite a lot of people coming and going. An endless stream of people are moving around inside the vast interior. You XiaoMo is still in awe of the enormous space when Ling Xiao puts him down and pulls him towards the center of the great hall.</p><br/><p>Right on top of the center of the great hall is a black screen that seems to be made out of jade. On the screen, many items are scrolling past. There are magic pills, magic herbs, techniques, and other items for auction. The lowest is level four. For grand scale auction houses like Seven Stars, low level magic pills and magic herbs don’t qualify to show up here.</p><br/><p>You XiaoMo stretches out his head here and there checking out the things on the screen. For others, these are ordinary things. But for him, these things are precisely what he needs. As for the rare things that don’t show up on the screen, even if he manages to get them, he won’t have the opportunity to enjoy them for now. Furthermore, he is currently a pauper, with only ten or so gold pieces on him.</p><br/><p>Ling Xiao takes a sweeping look and his eyes fall on stone room that has a sign that says treasure appraisal hanging on top. Two burly strong men are standing at the door. Seeing them walk over, they glance at them before letting them in.</p><br/><p>You XiaoMo pops his head out from behind Ling Xiao and looks in amazement at the numerous closely-spaced small secret rooms. One can faintly see the movement of people inside. This type of separation will ensure that the people bringing their treasures to be evaluated will not have to show others the treasures they have. This way, attracting the attention of deceitful and covetous people can be averted.</p><br/><p>Just when he is looking at this, a scantily clad female attendant walks over to them, snow white breasts on the verge of popping out, the revealing factor not any less than in modern times. The attendant’s eyes sweep past You XiaoMo and finally locks onto the tall and handsome Ling Xiao, immediately revealing a flirtatious smile. She says in a voice that makes the listener weak-kneed: “The two sirs are here to appraise treasures or to submit items for auction?”</p><br/><p>Ling Xiao just replied with a word when he sees You XiaoMo looking at the attendant with a stunned expression. He is immediately displeased and frowns. The attendant thinks that Ling Xiao doesn’t like this manner of speaking so she immediately changes her way of assistance, respectfully bringing them to a secret room.</p><br/><p>When she turns around, Ling Xiao grabs a hold of You XiaoMo and says unhappily, “What are you looking at?”</p><br/><p>You XiaoMo doesn’t notice his expression, exclaiming, “I didn’t expect that the women over here would be so open. I had thought they would be more conservative. Too shocking!”</p><br/><p>“So, you like this type of woman?”</p><br/><p>Ling Xiao narrows his eyes and asks softly.</p><br/><p>“How is that possible!”</p><br/><p>You XiaoMo refutes without thinking. He then adds, “I still prefer rather innocent ones with <b>pretty eyebrows</b>. This one is too racy. I don’t like it.”</p><br/><p>When he hears him refute loudly, Ling Xiao’s expression immediately softens considerably. But before he can be happy for a few seconds, he hears what he continues saying. Immediately dense dangerous storms emerge and yet a certain person still fails to realize what is happening.</p><br/><p>“You like innocent ones with pretty eyebrows?”</p><br/><p>Ling Xiao hugs him tightly next to him. His breath is clearly scorching hot but the words are cold and sinister, freezing three inches deep. From his words, he deduces that pretty eyebrows are referring to women.</p><br/><p>A certain obtuse young man finally realizes. He raises his head and sees Ling Xiao smiling very sweetly. Even the eyes are smiling. It’s just that it is a rather black smile. Immediately alarm bells start ringing in You XiaoMo’s heart.</p><br/><p>It’s the end. The end. He has never seen Ling Xiao smile like this ever since he met him. The twenty-first century has Black Friday. Ling Xiao has Black Smile …….</p><br/><p>“El ……. Elder brother Ling, we ……. should go in ……. ”</p><br/><p>You Xiao trembles in fear as he speaks. The little man in his heart sheds tears in his place. What happened this time? Tears!</p><br/><p>Ling Xiao smiles slightly, “You still haven’t answered my question.”</p><br/><p>The horror. Compared to when he watched horror films, this smile makes him feel even more terrified. Good grief. He has an inkling that this smile will probably scare him his whole life. Now looking at him smiling like that, his heart is seized with fear.</p><br/><p>“That ……. you’ve misunderstood ……. ”</p><br/><p>You XiaoMo swallows, his eyeballs turning round and round as he tries his hardest to find a way out.</p><br/><p>“What did I misunderstand?”</p><br/><p>Ling Xiao narrows his eyes.</p><br/><p>You XiaoMo’s eyes turn round and round as he says nervously, “What I meant by like, is actually ……. actually means appreciate. That’s right. I mean appreciate. Just now you also saw. That attendant dressed so revealingly, to the point of indecency, offending the eyes. This type of woman, no one will like them <i>ba</i>. So, one that is rather innocent is better. At least it won’t get out of hand ……. ”</p><br/><p>Ling Xiao raises his brows and looks at him for half a day, narrowing his eyes, “Is that right?”</p><br/><p>You XiaoMo wipes a handful of sweat as he nods his head in affirmation, “Of course.”</p><br/><p>How could he dare to say that’s not it? If he were to really shake his head and say that, Ling Xiao would strike him dead. His budding life is just about to blossom. He doesn’t want to die so soon!</p><br/><p>“There is indeed some truth in your words ……. ”</p><br/><p>Ling Xiao puts away his threatening look, his handsome face finally recovering his original fake gentleness. He pats him lightly on the shoulder and beams while saying, “I’ll let you go this time.”</p><br/><p>You XiaoMo sniffs tragically, almost overwhelmed with gratitude. Heaven knows that the amount of cold sweat dripping down today is equal to the sum of all of that before.</p><br/><p>The two of them walk into the secret room that the attendant pointed out to them. You XiaoMo immediately closes the door eagerly. The door of the secret room is made out of iron. It’s very thick, able to block out sound, preventing people from eavesdropping on the outside.</p><br/><p>The secret room is not big. Right in the middle an old grey-haired man is standing. The old man is dressed in black robes. His face is covered with deep wrinkles but his eyes are gleaming shrewdly. Right now his penetrating stare is sizing them up.</p><br/><p>You XiaoMo discovers that this old man seems to be a mage. As for why he knows, it’s because he can feel the latter’s soul is rather strong. Martial artists are not mages. They have no way to train the soul so their souls are a little weaker when compared to mages.</p><br/><p>“Please take a seat.”</p><br/><p>The old man points to the two chairs in front of the table. After sitting down, he says calmly, “The treasure that the two sirs would like to appraise. You can take it out now.”</p><br/><p>You XiaoMo sits down and then takes out a block of ice that is the size of a head from his magic bag, and puts it on the table.</p><br/><p>The old man expected them to bring out magic pills and the like. Suddenly what looks like a block of ice appears so he can’t help but narrow his eyes. Although he is a little surprised, but things that can be auctioned must be quite extraordinary. But when his soul force senses the block of ice, his body shivers fiercely. Immediately his eyes widen, “This is ……. ”</p><br/><p>The old man brings the block of ice under his nose and sniffs. His face changes, “This is spiritual liquid?”</p><br/><p>Spiritual liquid, this type of treasure, is an extremely rare thing in Long Xiao continent. Because it can immediately renew the spiritual strength of martial artists, if in the midst of battle, this type of thing is equivalent to a life saving magic pill. It’s something martial artists crave so much that they even dream about it. It has always been something that is priceless yet no one wants to sell.</p><br/><p>You XiaoMo nods, “This is only a small piece. Please take a look and determine what price it can be auctioned at.”</p><br/><p>The old man calms down the excitement on his face and takes another careful look. He ponders for a bit before saying, “This is indeed spiritual liquid. But it is not pure. There are a quite a bit of impurities inside. It needs to be refined before using. But like this, this size will only result in on drop of actual spiritual liquid. According go the estimation guidelines of HunJi city, one drop of spiritual liquid is at least one hundred thousand.”</p><br/><p>You XiaoMo immediately tastes <b>all the five flavors</b> …….</p><br/><p>A block of this size can only yield one drop of actual spiritual liquid. But what gives him comfort is that the price of one drop is a hundred thousand. This sum exceeds his expectation. He thought that it would be ten thousand at the most.</p><br/>\n</div>"}