{"title": "Chapter 102", "id": 102, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-102", "volume_title": "Volume 2", "body": "<h1>Chapter 102</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Rules.</b></p><br/><p>A number of men on horses whistle past on the road, kicking up a cloud of yellow dust. Ten thousand horses galloping ahead in an imposing manner finally come to a stop a few hundred meters outside HunJi city. The tall gigantic city walls that soar to the clouds make everyone appear extremely small.</p><br/><p>You XiaoMo feels that he is very unlucky. After finally managing to get off the horse carriage, he was just about to take in some air when a group of horsemen gallop across in front of him, the hooves kicking up yellow dust covering his whole face, even into his mouth.</p><br/><p>“<i>Ah pei</i> ……. ”</p><br/><p>You XiaoMo’s lips twitch somewhat dejectedly, spitting out a mouthful of yellow dirt. How unlucky.</p><br/><p>These people actually have no consideration for others. This is just outside HunJi city. There are who knows how many people queueing waiting to enter the city. Causing such a commotion, the ones affected is not just him alone. Quite a few people are just like him, faces covered in dust. What surprises him is that they all seem to be furious but do not dare to voice their anger.</p><br/><p>Just when he is wondering about this, someone gives him the answer.</p><br/><p>“Boy, are you the one that spit just now?”</p><br/><p>A tall and lean man riding a large horse suddenly turns his horse around and goes over to You XiaoMo. Looking at him from above, at You XiaoMo who is wiping his mouth, his face is forbidding, as if he is looking at mole crickets and ants.</p><br/><p>You XiaoMo is stunned. What is the meaning of this? Don’t tell me he is not allowed to spit after having his mouth filled with dirt?</p><br/><p>But what is really surprising is that he could actually hear someone spitting amidst the thundering hooves.</p><br/><p>Thinking of this, he sees the onlookers all showing sympathetic and pitying expressions. But not a single one comes to help him out. There are actually a few standing with their arms crossed watching the scene in glee.</p><br/><p>You XiaoMo racks his brains, then asks, “May I ask what you want?”</p><br/><p>The tall lean man grins saying, “Boy. I couldn’t tell that you have that much guts. But in front of the great me, guts is of no use, only fists are useful.”</p><br/><p>Guts? You XiaoMo feels that what he lacks the most seems to be guts.</p><br/><p>But when he doesn’t hear what the real deal is after waiting half a day, he starts to get impatient. His body was tossed around for half a day and he is still feeling a little uncomfortable. So he asks, “This big brother. What is it that you want?”</p><br/><p>Seeing the impatience on his face, the tall lean man’s face turns cold, he stretches out his hand and reaches back drawing out a large knife in the shape of a crescent moon. He swings it straight at the stunned You XiaoMo cutting downwards while saying, “Boy. I see this is your first time in HunJi city. Now I will teach you one of the rules. Don’t <b>think you’re somebody</b> over here. In my eyes, you’re not even an ant!”</p><br/><p>You XiaoMo completely can’t figure out why this person suddenly attacks when they were just speaking. It doesn’t seem as if he said anything offensive <i>ah</i>.</p><br/><p>But that crescent blade has no chance of falling onto You XiaoMo’s body. Behind him a slender hand like white jade stretches out from the carriage window and easily stops the sharp crescent blade. No matter how much force the tall lean man uses, the crescent blade has no way of lowering even a little bit.</p><br/><p>The tall lean man’s face changes suddenly. A sinister gleam flashes in his eyes as he shouts fiercely, “Who dares to oppose my Wolf fang gang? Tired of living? Show yourself if you dare!”</p><br/><p>“Boy. I also have a rule for you. In front of the great me, don’t even try to touch my man.”</p><br/><p>The drapes of the carriage flutters with the wind. A warm voice comes out from inside the carriage, a lazy drawl. The voice is somewhat captivating and languid, unhurried, very pleasing to the ear. But the words are dripping with scorn, raking the taut nerves of that tall lean man.</p><br/><p>Soon after, a pair of silver white brocade boots reveal themselves from under the carriage drapes. They are followed by a tall slender man slowly stepping out. He is dressed in a snow white soft robe decorated with gold silk, fluttering with the wind. Dashing eyebrows and sparkling eyes. Elegant and full of style. Grabbing everyone’s attention when he appears.</p><br/><p>The man’s lips hold a gentle smile, as if he is just meeting a friend, and not seizing the tall lean man’s crescent blade with one hand.</p><br/><p>Upon seeing Ling Xiao, You XiaoMo immediately gets up shakily and hides behind him.</p><br/><p>Looking back at the crescent blade that is very close to him, he shivers again. Really dangerous. If Ling Xiao didn’t make his move, he would already be cut into two right now.</p><br/><p>He feels like he is in extreme danger. This world is too terrifying. Killing people at the drop of a hat. He really wants to go back to Earth!</p><br/><p>Not waiting for the tall lean man to speak, Ling Xiao simply bends his finger and flicks the crescent blade away.</p><br/><p>The force of his flick is not much but the tall lean mean is unable to withstand it. On top of that, he is riding on the back of a horse. Struck by this force, the whole person simply falls off the horse landing heavily on the ground, stirring up a huge cloud of dust.</p><br/><p>“<i>Ke ke</i> ……. ”</p><br/><p>The tall lean man coughs violently and struggles to get up on his feet. He feels that some of his ribs are broken. When he looks at Ling Xiao again, his eyes reveal some fear and frustration, “If you have the guts, stand here and don’t run. Wolf fang gang will definitely not let go of the both of you.”</p><br/><p>Ling Xiao raises his eyes and looks at the not too distant Wolf fang gang, with their sharp swords drawn, itching for a fight.</p><br/><p>Most probably because they saw their head easily thrown down by Ling Xiao, so all of them do not dare to act rashly. He can’t help but snicker. Really such a ragtag band. Just this little bit of ability and they still dare to stir up trouble as they wish.</p><br/><p>“Idiot!”</p><br/><p>Ling Xiao sneers as he ridicules him. He then pulls You XiaoMo and turns back into the horse carriage.</p><br/><p>At this moment, the Raging fire horse somewhat intelligently neighs. He stomps his back hooves and starts galloping again. But this time the speed is slower, no longer making people feel like they are being tossed about. Maybe it’s because this is outside HunJi city with people coming and going so it’s not suitable for a full-speed gallop.</p><br/><p>The sound of the hooves drown out the cries of alarm. Only now does everyone notice that the horse pulling the carriage is a Raging fire horse. Legend has it that its temperament if very volatile. A precious horse with unbelievable stamina. But it’s a pity that Raging fire horses are only found in the MoRi forest, so they are rarely seen. Unexpectedly, one actually shows up here, immediately causing quite an uproar. Too bad the owner of the horse has already left.</p><br/><p>When they are about to reach the grand gate of HunJi city, the horse carriage is immediately blocked by two guards.</p><br/><p>The Raging fire horse feels a light pressure coming from inside the carriage, and neighs, then rather unwillingly comes to a stop.</p><br/><p>The two guards secretly let out a sigh of relief. It’s not as if they haven’t come across a Raging fire horse before. They know that its temperament is very volatile. If it really wants to barge through, they won’t be able to stop it based on their strength. Furthermore, someone who is able to tame a Raging fire horse is definitely no ordinary person. If they were to offend the person inside the horse carriage because of this, it would not be a good thing.</p><br/><p>“I’m sorry but everyone that wants to enter HunJi city needs to hand over two pieces of gold each.”</p><br/><p>One of the guards speaks.</p><br/><p>This is one of the ways HunJi city earns money. Except for the native residents, all outsiders must pay an entrance fee each time they enter the city. According to the number of people, the more people entering the city, the more entrance fees are collected. Although two pieces of gold can support an ordinary family for two months, it is not considered much for most people. Just finding some spot inside the city and setting up a stall, two pieces of gold can be earned back at any time. So this entrance fee is within the acceptable range for a lot of people.</p><br/><p>After the guards finish speaking, a slender hand stretches out from the window with four gold coins lying in the palm.</p><br/><p>The guard looks inside through the crack of the window and can faintly see two figures. Also, people who use Raging fire horses can’t lack a few gold coins so he doesn’t ask to check inside the horse carriage before letting them in.</p><br/><p>Inside the horse carriage, You XiaoMo exclaims happily, “Luckily I have gold coins on me. If not, we wouldn’t even be able to make it pass the gate.”</p><br/><p>Ling Xiao smiles. He doesn’t tell him that actually it wouldn’t matter even if they don’t have gold coins. Because it can be replaced with other things. And if those things are worth more than four gold coins, then that guard would most probably keep it for himself and use his own gold coins to make up for it. This kind of situation is not uncommon. HunJi city also doesn’t prohibit it so it just depends on the luck of the guard.</p><br/><p>“Elder brother Ling. Where are we going now?”</p><br/><p>You XiaoMo keeps the pouch holding the gold coins and then lifts up the window curtain and looks outside in high spirits. The bustling streets are filled with bobbing heads in all directions. This spectacular sight is much livelier than HePing town. Soon he completely forgets about what happened outside the city gates.</p><br/><p>“First, we’ll go the auction house and declare what we will be putting up for auction. We’ll discuss the rest after that.”</p><br/><p>Ling Xiao leans languidly inside the carriage. His eyes fall on the side profile of You XiaoMo’s face that is a little red from the excitement. He tries to restrain his eyes.</p><br/><p>“Where is the auction house?”</p><br/><p>You XiaoMo asks curiously. But he feels a little doubtful that the Raging fire horse will really be able to bring them right to their destination. He never knew that horses can tell the way. But he also knows that the animals of Long Xiao continent can’t be explained with common sense.</p><br/><p>“At the end of this street.”</p><br/><p>Ling Xiao replies.</p><br/><p>You XiaoMo is just about to push open the beaded curtain when the horse carriage comes to an abrupt stop. A moment of inattention, and the whole person flies forward. Just when he is about to tumble out, Ling Xiao’s large hand catches hold of him and scoops him up.</p><br/><p>You XiaoMo is sprawled in his embrace, still feeling flustered but before he can ask what happened, Ling Xiao says over his head, “We’ve reached the auction house.”</p><br/><p>Saying that, Ling Xiao carries him and jumps out of the horse carriage.</p><br/><p>Amidst the surging crowds at the end of the street, the sight of a man appearing carrying another man, even though the one being carried is a young man that appears rather small and thin, it still can’t change the fact that he is a man.</p><br/><p>Feeling the surprised looks coming from all sides, You XiaoMo blushes and quickly jumps out of Ling Xiao’s arms.</p><br/>\n</div>"}