{"title": "Chapter 119", "id": 119, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-119", "volume_title": "Volume 2", "body": "<h1>Chapter 119</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Fox spirit.</b></p><br/><p>The next day, Ling Xiao simply puts the sulky You XiaoMo over his shoulder and heads straight back to TianXin sect.</p><br/><p>After being on the road for one whole day without any stops, You XiaoMo is only put down when they reach the foothills of TianXin sect. He feels that his stomach is clamoring with unease, but since he didn’t eat anything the whole day, there is nothing for him to throw up.</p><br/><p>“Elder ……. ”</p><br/><p>You XiaoMo wipes his mouth and opens it, wanting to question him.</p><br/><p>Ling Xiao suddenly signals him to keep quiet, his brows slightly raised, as if having discovered some problem.</p><br/><p>Although You XiaoMo is not happy, he doesn’t say anything more. He looks in all directions. The foothills of TianXin sect doesn’t seem any different from usual <i>ah</i>, but maybe it’s just that he hasn’t figured it out yet. He asks cautiously, “Elder brother Ling, is something wrong?”</p><br/><p>Ling Xiao’s raised brows are now relaxed. Hearing his words, he nods while laughing, “Someone is coming.”</p><br/><p>Before he can ask anything, as if to give credence to his words, two figures suddenly appear on the mountain top. One following the other, they rush in their direction, arriving in front of them in no time. The younger one, after one look at Ling Xiao, lights up completely. With a few steps he dashes up to Ling Xiao and says excitedly, “Elder brother, you’re finally back.”</p><br/><p>Ling Xiao smiles as he says, “The few days I wasn’t here, did something major happen in TianXin sect?”</p><br/><p>This younger brother immediately nods his head like a chick pecking rice, “I’m not sure about something major but Grand Master instructed us to ask you to go see him immediately if we see you coming back.”</p><br/><p>“I understand. Thank you for letting me know.”</p><br/><p>Ling Xiao smiles as he speaks. Just now he felt that TianXin sect’s surveillance seems to be much tighter than it was before he left. Seems like something major happened. Otherwise, they wouldn’t be asking him to go over so urgently.</p><br/><p>Saying that, he turns to You XiaoMo and says, “Little brother, let’s go <i>ba</i>.”</p><br/><p>You XiaoMo is momentarily dazed and then quickly nods, hurrying to catch up with his pace.</p><br/><p>When the two of their backs disappear on the only road at the foothills, the one that just was completely delighted upon seeing Ling Xiao puts away the smile on his face. He looks with some resentment in the direction that they left.</p><br/><p>“Brother Li. Why do you think Elder brother treats that You XiaoMo so well? What is so good about him?”</p><br/><p>That Brother Li, although he has never spoken a word to Ling Xiao before, he still takes Ling Xiao as his idol, since very long ago. Furthermore, his fanboy behavior seems to be growing. Hearing his younger brother say that, he frowns. He himself doesn’t understand, “Maybe that You XiaoMo cast some spell on Elder brother causing Elder brother to treat him especially well.”</p><br/><p>Elder brother accompanying You XiaoMo down the mountain, when they found out about this matter, they didn’t really believe it because Elder brother very rarely goes down the mountain with his brothers. Even if he did, it would be one big group of people. This time, being so unusual, maybe You XiaoMo really used some dirty trick.</p><br/><p>“That You XiaoMo. In my opinion, he may be the reincarnation of a <b>fox spirit</b>.”</p><br/><p>The younger brother speaks in a huff.</p><br/><p>“Younger brother Zhao. It’s better if you don’t say these things out loud so as to not let others hear you.”</p><br/><p>Brother Li warns him.</p><br/><p>“I know, Big brother Li.”</p><br/><p>Younger brother Zhao answers unwillingly.</p><br/><p>Naturally, You XiaoMo has no idea that because of Ling Xiao, he has been converted from a normal person to a fox spirit. Fanboys are so terrifying. They can’t sully their idols so they can only splash the dirty water on someone else.</p><br/><p>Ling Xiao doesn’t send him all the way to Earth peak. The two of them part ways at the fork in the road. Since it is TianXin sect’s domain, he isn’t worried that You XiaoMo would be bullied and the like. After all, he is still Kong Wen’s direct disciple. If you don’t do it for the monk’s sake, you still have to do it for Buddha’s sake.</p><br/><p>After being away for a few days, You XiaoMo doesn’t immediately go back to his room upon returning to Earth peak. Instead he goes looking for Fang ChenLe but to no avail. Then he finds out from the other disciples that Elder brother and Second brother are still at Yun Shui peak with Uncle Ye and would only back in a few days.</p><br/><p>Then he also goes to see Kong Wen. After all, he still has the nominal title of disciple hanging on him so naturally he has to give his greetings to his Master upon coming back, lest other people say that he doesn’t respect his elders.</p><br/><p>Kong Wen also doesn’t feel it’s strange. He doesn’t ask where he and Ling Xiao went after going down the mountain, or what they did. He only asked a few routine questions before letting him go.</p><br/><p>After coming out, You XiaoMo finally heaves a sigh of relief. Every time he goes to see Kong Wen, he would feel significant pressure in his heart. As for why he didn’t ask, Ling Xiao said that day that he had arranged everything. Presumably he had also made up an excuse so he has nothing to worry about.</p><br/><p>After returning to his room, You XiaoMo remembers that he already hasn’t refined magic pills for quite a few days. He wonders if his actions would be rusty.</p><br/><p>But before that, he washes himself from head to tail once over, then has a lovely dinner before reading a book, right up to <b>Hai period</b>. After making sure that no one would come look for him, he tidies his things and closes the door and windows tightly and enters his dimension.</p><br/><p>These few days he was at the mercy of Ling Xiao. Every night he was hugged by Ling Xiao while sleeping so he didn’t go in and tidy the magic herbs these few days. Now, ninety percent of the magic herbs in magic herb fields are already mature, swaying in the wind.</p><br/><p>Harvesting magic herbs is already something he is so used to that it is like driving a light carriage down a familiar road. He finishes harvesting them all in under two hours. Then he plants more seeds again. Only this time he doesn’t plant them all with level two and level three magic herb seeds. He leaves fifteen pieces to be planted with mid level magic herbs.</p><br/><p>After finishing sprinkling the seeds, he waters them with diluted magic water one by one. It is one hour later by the time he finishes. It should soon be daylight outside. He drinks a mouthful of magic water to chase away his fatigue. He goes out once before starting to build his small wooden hut.</p><br/><p>In the previous world, the university he was preparing to go to was most famous for its architecture department. At that time, the one he chose was that architecture department. Although he didn’t go study in the end, he still has some understanding of architecture. Small wooden huts like this is the most simple. After spending not too much time, and a period of hammering and banging, the small wooden hut takes shape. Then he moves out the wooden racks and wooden barrels that he bought from HunJi city.</p><br/><p>The wooden racks were divided into batches by him according to the level of the magic herbs. The wooden barrels were pushed together waiting to be used when needed. After doing all these things, half a day has passed.</p><br/><p>You XiaoMo rests on the spot for a while and then walks into the small wooden hut. He pours out everything from the magic bag. Level eight magic beast egg, weapons, techniques, magic herbs, magic pills, seeds, magic pill formulas, snacks, magic fruits etc. Everything is neatly divided into categories and placed inside the small wooden hut. For now, he can’t use the mid level magic herb seeds. Even if he wants to plant them, he can’t use too many. So he keeps the rest of them and stores them in the cupboard.</p><br/><p>By the time he leaves the dimension, the sky is already bright outside.</p><br/><p>Golden sunlight shines on his window, bathing his room, making it extremely bright.</p><br/><p>Although he worked for almost a whole day, he is not tired. You XiaoMo takes a few books that he already finished reading from the bookshelf and runs towards the library. After exchanging them with books he hasn’t read, he changes course to the Hall of Enchanted Herbs.</p><br/><p>The high spirited You XiaoMo has no idea that not long after he left his dimension, that magic beast egg that he put on the table suddenly emits intense white light. The white light sparkles endlessly then the spiritual energy surrounding the magic beast egg forms a vortex. The epicenter of the vortex is that magic beast egg. A huge amount of spiritual energy is sucked in by the magic beast egg right until it is almost unable to withstand it then the vortex stops, returning to its original condition.</p><br/><p>Hall of Enchanted Herbs.</p><br/><p>You XiaoMo walks towards Uncle Zhao’s location as before. Unexpectedly, he finds that the one sitting at the counter has turned into Fifth brother Zhao DaZhou. But thinking of his relationship with Uncle Zhao, he feels that it isn’t unexpected.</p><br/><p>You XiaoMo takes out a few bottles of magic pills from his magic bag. These are level two magic pills that he refined in advance. It’s half of the one month portion that he got from Uncle Zhao before. He completed refining them in advance so he conveniently brings it over.</p><br/><p>Seeing him, Zhao DaZhou frowns, “Younger brother You, you already picked up this months portion of magic herbs. Unless you have merit points, I can’t give you anymore magic herbs.”</p><br/><p>You XiaoMo smiles, not minding his tone. He simply hands over the few bottles of magic pills to him, “Big brother Zhao, these are the magic pills I refined. Count and see.”</p><br/><p>If it is Uncle Zhao who is here as usual, he wouldn’t count it because he believes that You XiaoMo doesn’t dare to deceive him. Also, he has a hundred percent success rate, so even if there is a little less, it’s nothing, because each time the other disciples hand over the magic pills, it is only thirty or forty percent. Some of them are even less than thirty percent. So, in comparison, You XiaoMo is indeed a lot better.</p><br/><p>But Zhao DaZhou is not Zhao Zhen. He doesn’t trust You XiaoMo so he starts counting in front of him. By the time he finishes counting, his face finally changes.</p><br/><p>Nine hundred stalks of magic herbs is enough for three hundred level two magic pills. If the success rate is a hundred percent, he has to hand over a hundred and fifty pills. As far as he knows, even Elder brother and Second brother can hardly manage it. But this newly promoted level two mage, You XiaoMo, after not even a month can actually do it all successfully?</p><br/><p>Right now, the bottles in his hand, added up altogether is exactly one hundred and fifty pills, not more not less!</p><br/><p><b>Note:</b></p><br/><p>fox spirit – vixen</p><br/><p>Hai period – 21:00-23:00</p><br/><p>________________________________________<wbr>__________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/>\n</div>"}