{"title": "Chapter 128", "id": 128, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-128", "volume_title": "Volume 2", "body": "<h1>Chapter 128</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Tricked again.</b></p><br/><p>Feeling that he has gotten himself one more friend, You XiaoMo simply hums the nursery rhyme ‘two little tigers’ on his way back, attracting strange looks from a few disciples.</p><br/><p>There’s no helping it. Who asked him to be only able to sing nursery rhymes? From small, he was brought up under the strict upbringing of his parents. He can only watch news and current affairs on TV. Cartoons, fiction, pop music and all that were all not allowed.</p><br/><p>But it’s not as if he couldn’t watch anything. At the least, he gets to watch one hour of TV drama every day. But what makes him want to rant is that nowadays the TV drama will broadcast two to three episodes every day. He can only watch one hour so what the hell <i>ah</i>. After watching this episode, he won’t know what happens in the next episode. But he only rants in his heart. He is still very much afraid of his parents’ authority.</p><br/><p>Pushing open the door and walking inside, You XiaoMo turns around and just when he closes the door, a large hand stretches out from beside him. In an instant, it covers his mouth and drags him inside with considerable strength.</p><br/><p>You XiaoMo is frightened causing his <b>three spiritual souls and seven physical souls</b> to fly away. He thinks he has encountered a petty thief but a split second later, he smells the familiar scent coming from the body behind him. He also hears the terribly familiar sound of the strong and powerful heartbeat coming from that person’s chest so he stops struggling.</p><br/><p>Seeing that he isn’t struggling, that person loses interest and grumbles, “Little brother, why are you not reacting <i>ya</i>? Don’t tell me you’re not afraid that I would defile you again and again?”</p><br/><p>You XiaoMo immediately -_-||. This bastard. What defile again and again. He is a man! After not meeting for only a few days, his skin actually got so much thicker.</p><br/><p>You XiaoMo flares up, grinding his teeth and yells, “As if!”</p><br/><p>He doesn’t believe that he can get it up for a man. Although he was forced to experience masturbating together before, You XiaoMo always believed that that was a normal morning vigor experience that ……. had to be resolved. They were just helping each other. Furthermore, he can’t imagine two men doing it …….</p><br/><p>Ling Xiao immediately stops his molesting actions. After a while, he lets out a low laugh with his chin hanging over You XiaoMo’s shoulder. He says teasingly, “Since you don’t believe it, we should just give it a try.”</p><br/><p>Saying that, without waiting for You XiaoMo to react, Ling Xiao bends down and lifts him up horizontally.</p><br/><p>You XiaoMo almost screams in fright but a second later he immediately covers his mouth because Ling Xiao whispers something laughingly in his ear.</p><br/><p>“If you cry out, you will cause the neighboring to disciples to come over <i>oh</i>.”</p><br/><p>Because of the strange occurrence that happened the last time while training, he already caused the neighboring disciples to come over once before. You XiaoMo doesn’t want that to happen again. He also doesn’t want to let other people know that Ling Xiao is in his room.</p><br/><p>Passing the room divider, Ling Xiao carries him to the bed. After giving him a slight smile, he throws him on the bed while he looks at him in horror. Luckily there is a reasonably thick quilt spread on the bed.</p><br/><p>Once he is let go, You XiaoMo immediately rolls to the corner and lifts up both his arms in a cross in front of his chest, adopting a defensive stance. He then yells in a threatening manner outwardly while shaking inwardly, “What do you want?”</p><br/><p>“What do I want?”</p><br/><p>Ling Xiao laughs lightly while looking at him, “Of course I want to defile you <i>ah</i>.”</p><br/><p>You XiaoMo almost chokes on his own saliva. He studies Ling Xiao’s expression with wide open eyes, as if trying to see if he is teasing or ……. serious.</p><br/><p>Ling Xiao loves to see his furious expression with his eyes open wide. He is clearly a little lamb and yet he loves to pass himself off as a little leopard. Although little leopards are also very cute, the thing is he doesn’t have sharp claws. Rather, he only has two pudgy paws.</p><br/><p>Under his defensive gaze, Ling Xiao bends down and picks up the quilt with his hands. He looks at You XiaoMo in the corner in delight, the corner of his lips curving upwards while saying, “Actually ……. I don’t like to force myself on others, I rather prefer ……. consensual sex!”</p><br/><p>You XiaoMo’s cowardly heart immediately explodes.</p><br/><p>Con con con ……. consensual sex. It can’t be what he is thinking <i>ba</i>?</p><br/><p>Ling Xiao can’t suppress his amusement. As if seeing through his doubts, he says suggestively, “<i>Oh</i>, it’s exactly what you are thinking. How about it? Any interest in trying it out with me?”</p><br/><p>Try try try ……. try your ass <i>ah</i>!</p><br/><p>His poor heart. The number of times it has been provoked today is more than all the times added together in the past.</p><br/><p>You XiaoMo thinks pitifully how he can be so hateful. The little man in his heart is pounding his chest. How is it that he can say those kinds of things with a straight face? Can it be that two men can really ……. do it?</p><br/><p>He must be losing his mind.</p><br/><p>You XiaoMo shakes his head fiercely, determined to not give it a try.</p><br/><p>Ling Xiao doesn’t get angry. He suddenly pulls the quilt in his hands, pulling it strongly towards himself. You XiaoMo is unprepared forgetting that he is on the quilt. Unable to stop himself from moving with the quilt, he falls backwards. Without waiting for him to crawl back up, both his feet are seized and pulled over.</p><br/><p>By the time he recovers, Ling Xiao’s handsome magnified face appears in front of his eyes, making him jump in fright. No longer does he have that brave manner, stammering, “You, what is it that you want?”</p><br/><p>“Didn’t I already tell you?”</p><br/><p>Ling’s Xiao gently caresses his cheeks with the fingers of his right hand. Whether it is his actions or his words, all are tinged with sensuousness and seductiveness.</p><br/><p>“But, but, I am a man ……. ”</p><br/><p>You XiaoMo is really red in the face, stammering as he speaks.</p><br/><p>“I know. No one is clearer about that than me.”</p><br/><p>Ling Xiao’s smile gets even wider. He says meaningfully, “And, didn’t I already tell you before? Man and man is really possible.”</p><br/><p>“Really?”</p><br/><p>You XiaoMo’s eyes bulge open. Saying that, he really wants give himself a tight slap. Now is not the time to worry about real or not.</p><br/><p>Of course, hearing this Ling Xiao can’t stop himself from roaring with laughter. He continues laughing while You XiaoMo appears -_-||, stopping only when he is on the point of getting angry from embarrassment.</p><br/><p>“Little brother, we only have to try it once and you will know whether it is possible or not.”</p><br/><p>Ling Xiao says this in a low voice and then taking advantage of You XiaoMo’s state of shock, he bends forward and seizes his jaw. He covers his lips with his mouth and sucks on them forcefully.</p><br/><p>You XiaoMo is taken by surprise. Feeling his lips get numb from getting sucked on, he finally starts to struggle. Because his legs have been pulled apart, causing them to lose strength, he can only use his hands to resist him.</p><br/><p>He has no idea that the more he struggles, the more Ling Xiao gets excited. His weak actions are unable to shake him in the least. Those hands instead cause his whole body to shiver, making the lust in his eyes get deeper and deeper, blazing hot and boiling. He simply unties the sash on his own waist and tosses aside his robe. Separated by a thin layer of underpants, the swollen enormous thing in between his legs is rather apparent.</p><br/><p>You XiaoMo catches a glance of it when he lowers his head, and his whole scalp immediately starts to tingle.</p><br/><p>This is not his first time seeing Ling Xiao’s little brother. It’s also not the second time. Rather, they have already met quite a few times. But every time he sees it, he can’t help but shiver. It really is extraordinarily big. Every time he helps him out, the next day his hands would ache terribly, even making him unable to refine magic pills.</p><br/><p>Seeing his reaction, Ling Xiao laughs in delight. He bucks his lower body a few times, using that huge swollen and hard thing to rub the insides of his thighs.</p><br/><p>You XiaoMo immediately lets out a gasp. As a little virgin, his body quickly weakens. He can’t stop his mind from thinking back to the the scene from the last time. Erotic and stimulating. His nose suddenly heats up, as if something is going to flow out. He quickly covers his nose in fright.</p><br/><p>Thinking of what that might be, he suddenly feels as if he has been struck by lightning. He he he ……. he really is becoming more and more abnormal.</p><br/><p>Ling Xiao releases the little lips that have turned red from all the sucking. Looking at his expression, he lets out a low laugh. Then he lowers his head again and nips on his earlobe. Soft light nibbles. Then he goes further down from there. His large hands have not been idle. Moving slowly from his face to his chest. His finger pads grasping the two little pink points on his chest. He gives them a few rather forceful twists and pinches.</p><br/><p>Such stimulating feelings, coursing through the little virgin’s body making it twitch uncontrollably. Waves of pleasurable sensation spread out from the two points on his chest like electric shocks, wave after wave. Alluring moans escape unconsciously from his lips. The repressed voice almost on the brink of losing control.</p><br/><p>Ling Xiao raises his head and kisses his small lips, swallowing the rest of his moans. Then he lifts up his other hand and quickly weaves a seal in mid-air, same as the barrier that he usually sets up for You XiaoMo.</p><br/><p>It’s not the first time You XiaoMo is aroused. But every time he gets aroused, it is the same as the first time, he finds it very hard to keep himself under control.</p><br/><p>Soon he is enthralled by Ling Xiao, forgetting who he is. He wantonly entangles his tongue with his, letting out slippery <b>*ze ze*</b> sounds. His hands instinctively circle around Ling Xiao’s nape. His legs squeezing on his strong lean waist. His whole body is hanging on to him like a koala.</p><br/><p>Ling Xiao is secretly delighted. He is happy that the young man is crazed with lust because of him. But his response provokes the lust in him making it surge again and again. He urgently reaches one of his hands inside his clothes, caressing deliberately. Feeling the warm and velvety texture transmitted through his hands, letting out a slight low moan.</p><br/><p>Just when he moves his hands to his underwear, wanting to take it a step further, the sound of someone knocking on the door comes from outside …….</p><br/><p>Ling Xiao’s hands freeze momentarily. By the time he wants to look back, the person under his body already looks like a bird that is startled by the twang of a bow. Startled back to his senses, his whole face in shock.</p><br/><p><b>Notes:</b></p><br/><p>three spiritual souls and seven physical souls – in Taoism, there are three souls and seven senses</p><br/><p>tailless bear – koala</p><br/><p>________________________________________<wbr>__________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/>\n</div>"}