{"title": "Chapter 148", "id": 148, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-148", "volume_title": "Volume 2", "body": "<h1>Chapter 148</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Changes in the dimension.</b></p><br/><p>The following days pass with calm winds and gentle waves.</p><br/><p>Although Tang YunQi said those kind of words, You XiaoMo doesn’t see her again. He also didn’t hear anything about her going to find Ling Xiao and such. But he also hasn’t seen Ling Xiao since then.</p><br/><p>Later, he hears that Tang Fan gave him an assignment so he is very busy, no shadow of the man almost every day. It’s clear how busy he is. You XiaoMo guesses that probably either Tang YunQi or Xiao Long went to complain to Tang Fan. So in order to not let Ling Xiao have the time to come find him, Tang Fan gave him these assignments.</p><br/><p>But these are all what happens later.</p><br/><p>Returning to Earth peak, You XiaoMo first goes to find Zhao DaZhou, and chats with him for about half an hour before returning to his room.</p><br/><p>Not being around for a few days, the whole room is covered in a thin layer of dust. You XiaoMo picks up a basin and goes outside to fetch a basin of water. It only takes him a while to wipe the desk, chair, and cupboard clean. After coming back from throwing out the water, he enters the dimension.</p><br/><p>Just as he opens the door to the little wooden hut, a white figure throws itself at him.</p><br/><p>You XiaoMo lowers his head and takes a look. Xiao Piqiu is looking at him with an aggrieved expression, blinking his pair of red eyes while whimpering softly, trying to make him feel guilty.</p><br/><p>You XiaoMo’s mouth twitches as he is determined not to be fooled. Because if he lets it out, it would definitely trample on his magic herb fields again. He definitely would not let something that happened before happen once again.</p><br/><p>Seeing that his Master does not react, Xiao Piqiu bares his teeth at him.</p><br/><p>You XiaoMo pretends not to see anything, putting it back on the floor. Then he takes out a piece of Miraculous sheep meat from his magic bag. Because the meat has yet to be cleaned, the small wooden hut is immediately filled with a faint bloody scent.</p><br/><p>You XiaoMo doesn’t mind it and puts the meat into a wooden basin. He then takes it into the simple and crude tiny kitchen.</p><br/><p>Behind him, when he took out the piece of meat, Xiao Piqiu’s eyes immediately locked onto the piece of meat, not looking away again. That look is like having caught sight of its prey. Glaring like a tiger with a hint of savagery. Although it is still young, it is clear that when faced with its prey, the instinct is strong.</p><br/><p>Seeing You XiaoMo walk away, Xiao Piqiu follows quickly.</p><br/><p>When You XiaoMo was building the small wooden hut, he did consider that he might want to cook, so he purposely left space for a small kitchen. Although the kitchen is small, it is fully equipped with pots, bowls, ladles, tubs, firewood, rice, oil, salt, soy sauce, vinegar and tea, not lacking anything.</p><br/><p>Because there isn’t any ordinary water in the dimension, You XiaoMo simply uses the magic water to rinse the meat. After cleaning it, he puts it on the cutting board. He is in no hurry to cook for Xiao Piqiu. He then takes out a few things from his magic bag again. It’s all things that he bought the last time he went down the mountain. There are all kinds of herbs, spices, sauces, and the like.</p><br/><p>After placing all these in order one by one, You XiaoMo lifts the cleaver and cuts the piece of Miraculous sheep meat into eight pieces of about equal size. Then he puts them one by one into the pot he had prepared. After boiling for a few minutes, he scoops it out again. Then he puts it back in with all sorts of seasonings that he prepared into the pot and pours in some magic water. Putting on the cover, he prepares to increase the flame.</p><br/><p>As someone who is used to the modern gas stove, You XiaoMo is not used to using a primitive firewood stove. It takes quite a lot of effort to get a strong flame going and keep it going.</p><br/><p>Although he has never cooked the meat of Miraculous sheep before, he feels that it is similar to beef and the like. In order to make it soft and full of flavor, it needs to be cooked for a long time so he has to keep watch over it. This is rather troublesome.</p><br/><p>You XiaoMo can actually cook other dishes. After all, he has lived by himself before for a period of time so it is unlikely that he can’t cook. But Xiao Piqiu is a carnivorous animal. No matter how pretty he makes the dishes, it wouldn’t appreciate it. So he simply makes a pot of meat stew.</p><br/><p>But, very quickly he gets a taste of his ignorance.</p><br/><p>He thought that a pot of Miraculous sheep meat will take about the same time as a pot of beef, about two and a half hours, because there is quite a bit of meat. He didn’t consider that the Miraculous sheep is a level eight magic beast. The meat of a level eight magic beast is not something that can be compared to beef. Although the meat is incomparably delicious, but because it is filled with spiritual energy, it can’t be cooked by ordinary fire …….</p><br/><p>After squatting down and cycling through many different positions, You XiaoMo finally realizes that it is taking too long.</p><br/><p>So, an hour later, when he opens the lid, he sees that the meat looks just as it did when he put it in an hour ago. He is totally speechless. The water is boiling. The spices and seasonings are all mixed up. But most importantly, there is no change at all in the meat.</p><br/><p>Suffering a blow, You XiaoMo can only first extinguish the flame and then ponder where he had gone wrong.</p><br/><p>After some difficulty, he figures out that it has something to do with the quality of the meat. It’s a pity that he only has access to ordinary fire.</p><br/><p>Right at this time, he feels that his pants are going to be pulled down. He hastily holds on to his pants and looks down to see Xiao Piqiu stuck on his pants, trying his best to climb upwards. Its eyes are shining, fixed on the piece of meat in his hands.</p><br/><p>You XiaoMo is silent for a moment before lifting up the cover of the pot and scooping the meat out. The moment he puts down the plate, Xiao Piqiu suddenly howls and rushes over, sticking his head right into the plate, eating up the raw meat with saliva splashing everywhere.</p><br/><p>Although Xiao Piqiu was born less than one month ago, its teeth are extraordinarily sharp, <b>*chi la chi la*</b> ripping up the meat of the Miraculous sheep. Very quickly, he polishes off a huge chunk.</p><br/><p>You XiaoMo takes one look and doesn’t look back again. As a human who has eaten cooked food for over ten years, he can’t accept eating raw meat. That’s why he doesn’t like to eat Japanese sashimi. The peculiar thing is, everyone else in his family likes it. It’s only him that doesn’t like it. He has always wondered about this.</p><br/><p>No longer paying any attention to Xiao Piqiu, You XiaoMo picks a few hundred stalks of magic herbs from the racks. He already hasn’t refined magic pills for a few days. In order to advance as quickly as possible, he has to practice regularly. But before that, he sits down to meditate in the dimension while practicing the Heavenly Soul Scroll. He only leaves the dimension an hour later.</p><br/><p>You XiaoMo goes out and takes a walk. He sees that the atmosphere in Earth peak is about the same as before. Before returning, he asked about the whereabouts of Elder brother. Just as he expected, he is still at Yun Shui peak. Since he’s not able to meet with Elder brother, You XiaoMo can only go back to his room.</p><br/><p>After laying out the few hundred stalks of magic herbs on the table, You XiaoMo starts to refine level three magic pills. Ever since his first failure when he first started refining level three magic pills, You XiaoMo works with determination to ensure that he maintains the glorious zero failure rate from before.</p><br/><p>At that time, he didn’t know his real innate talent. He had thought that his success was due to his hard work. Now that he knows, he feels that he should maintain the zero failure record. Otherwise, it would be an insult to his soul.</p><br/><p>Even though that is how he feels, You XiaoMo still feels some psychological burden.</p><br/><p>Once he had figured out his outstanding talent, he would think that he would have to perform the best, not allowing himself to fail. But since it’s like this, the heart would be perturbed, and this would in turn make it easy to fail.</p><br/><p>So, when the magic herbs in the cauldron fails for the second time during the blending step, You XiaoMo is thoroughly dumbfounded.</p><br/><p>What the hell is the meaning of this? Why is it that after he found out his innate talent, his rate of failure for refining magic pills actually increases?</p><br/><p>You XiaoMo pulls at his own hair with all his strength. He does know why he is continuously failing. The most important reason is that he is too agitated. He keeps thinking that he must succeed. Because of that, he can’t keep his focus. If he had known that it would be like this, he would rather never find out about his own innate talent.</p><br/><p>After struggling with it for a long time, You XiaoMo decides not to continue refining magic pills. Instead, he enters the dimension to practice the Heavenly Soul Scroll.</p><br/><p>He has to calm down his heart. If not, no matter how good his innate talent, it would be ruined by him.</p><br/><p>After closing his eyes, he quietly activates the Heavenly Soul Scroll. The pores in his body seem to widen. The spiritual energy in the dimension rushes into his body following his pores, then pours into the space between his eyebrows. His soul seems to expand until there is no space left for any more spiritual energy.</p><br/><p>Right at this moment, You XiaoMo’s body suddenly shudders. Then, a boundless soul force jets out of the space between his eyebrows, like a flood, causing waves of ripples to form on the calm water surface. Spreading out endlessly with him at the center …….</p><br/><p>It continues until his soul force fills up the whole dimension. Suddenly a change occurs at the previously calm center of the magic water lake. The center seems to be boiling, as if something is about to break out at any moment, as if there is something that wants to come out from the bottom of the lake. An instant later, a fist sized opening forms in the center of the lake, like a bowl. A sky blue pearl is lying in the middle of the tiny groove.</p><br/><p>A second later, this sky blue pearl appears to be affected by some force, causing it to fly out from the groove, instantly turning into a piercing ray of light, shooting into the space between You XiaoMo’s eyebrows …….</p><br/><p>When the pearl disappears, an indistinct seal suddenly appears in the space between You XiaoMo’s eyebrows. The seal shimmers a few times before disappearing.</p><br/><p>An hour later, You XiaoMo finally opens his eyes. There is no longer any sign of fluctuating emotions in his eyes. Looks like he has at least calmed down. Although he isn’t certain, he feels that his soul force seems to have increased. Stretching out his right hand, he suddenly feels very attuned to his surroundings, as if he can sense each and every blade of grass and tree in the dimension.</p><br/><p>He suddenly remembers that some of the magic herb fields are already matured. It should be time to harvest. But thinking about digging them up one by one, he feels a little helpless. This process is really too time consuming. If the magic herbs could get up from the soil by themselves, and place themselves on the racks, that would be best.</p><br/><p>The moment this thought flashed in his mind, a stalk of magic herb floats past his eyes. You XiaoMo is momentarily stunned, thinking that he must be seeing things, so he lets it be. But when the nth stalk of magic herb floats past his eyes, he is finally dumbfounded.</p><br/><p>Even if he is seeing things, it can’t be that he is seeing the same thing n times.</p><br/><p>After being in a daze for about fifteen minutes, You XiaoMo finally stands up and runs towards the magic herb fields. Sure enough, there is suddenly a bare patch on the magic herb field where there used to be mature magic herbs. The soil also looks as if it has been tilled, loose and fluffy.</p><br/><p>This ……. what exactly is going on?</p><br/><p>After awakening from over an hour of practice, this kind of thing actually happens? Seems too miraculous.</p><br/><p>You XiaoMo is sure of one thing. This new capability wasn’t there before. So, most probably something he wasn’t aware of happened while he was practicing just now, bringing about this kind of thing.</p><br/><p>Although it is totally unexpected, he can’t deny that this kind of ability is really too awesome!</p><br/><p>With this kind of ability, You XiaoMo no longer has to worry about planting and watering the magic herbs. He only has to form the intention, and the dimension will help him carry it out. He had wanted to buy a few more magic beasts, but now, it looks like he no longer has to.</p><br/><p>That’s right, what happened to Xiao Piqiu?</p><br/><p>Just as the thought crosses his mind, a sweetly sleeping little magic beast curled up into a ball with a bulging belly appears in front of him. Xiao Piqiu’s snow white belly is facing upwards as it snores very loudly.</p><br/><p>But in this short span of time, You XiaoMo discovers that Xiao Piqiu seems to have grown bigger. Originally he was only the size of an adult head. Now he’s turned into the size of two adult heads. Its shape is gradually breaking away from that of a young pup. Its outer appearance is starting to take on the imposing look of an adult Blue-blooded wolf.</p><br/><p>You XiaoMo looks at it with his mouth hanging open for quite a while. All sorts of strange things are happening today.</p><br/><p>Although he doesn’t know the reason, he can guess that it has something to do with the Miraculous sheep meat that Xiao Piqiu ate. No wonder Ling Xiao likes the meat from this type of level eight magic beast. Looks like the meat of the Miraculous sheep is really magical.</p><br/><p>According to this trend, it wouldn’t take long before Xiao Piqiu turns into <b>Da Piqiu</b>.</p><br/><p>Wrapped in excitement, You XiaoMo doesn’t try to refine magic pills again for the day. He also isn’t in the mood to refine magic pills.</p><br/><p>Since the meat of the Miraculous sheep can make Xiao Piqiu grow up, he decides that during the two months before the Paradise realm opens, he would feed Xiao Piqiu and turn it into Da Piqiu. But because he doesn’t have the requisite type of fire, he can only feed it raw meat.</p><br/><p>After making this decision, the next day, You XiaoMo settles his emotions in order to refine magic pills.</p><br/><p>This time, he no longer fails again. Maybe because he had a breakthrough in his emotional stability or his soul force, he feels that refining magic pills is going more smoothly than before.</p><br/><p>Just like this, a span of two months passes in a blink of an eye.</p><br/><p>Kong Wen’s time limit of two months is also up.</p><br/><p><b>Note:</b></p><br/><p>Da Piqiu – big rubber ball</p><br/><p>________________________________________<wbr>__________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/>\n</div>"}