{"title": "Chapter 144", "id": 144, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-144", "volume_title": "Volume 2", "body": "<h1>Chapter 144</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Evaluation stone.</b></p><br/><p>Maybe she already heard about the matter from the small boy, so the woman with tears dancing in her eyes thanks You XiaoMo and Ling Xiao over and over again, her body swaying on the point of falling. Each sentence is followed by several coughs.</p><br/><p>Even though she is unwilling to sell off the twelve heirloom jade carvings, it is for the sake of survival so the woman has no other option.</p><br/><p>Although SiFang town is small, the competition is still very intense. She can go for a few days without eating or drinking but she can’t let her son suffer with her. That’s why she is willing to sell off the twelve jade carvings.</p><br/><p>Who knew, because the price of the jade is too high, and because the people that usually come to SiFang town are not especially rich, so the jade carvings since they were brought out a month ago, not even one was sold. Now, when the mother and son are on the point of dying from illness and starvation, someone finally comes to buy their jade sculptures. Furthermore, it’s all twelve at once. The mother and son have never seen so much money in this lifetime. It would be a lie to say they are not moved. The woman has long ago started to drop tears like rain.</p><br/><p>After an arduous wait for the woman to finish crying, You XiaoMo is finally able to ask about the Evaluation stone.</p><br/><p>After hearing that the customers want to buy an evaluation stone, the woman wipes her tears with a handkerchief, raises her head, and asks in surprise, “Two young brothers want to buy an evaluation stone?”</p><br/><p>Her gaze sweeps over You XiaoMo and Ling Xiao, finally falling on You XiaoMo, “You are a mage?”</p><br/><p>You XiaoMo pouts. So it’s that obvious? Fine <i>ba</i>. Compared to martial artists, he is indeed more like a weak mage. But the woman’s insight is very sharp. After all, she is so sick to such an extent.</p><br/><p>After getting an affirmative answer, the woman immediately leads them into the rear courtyard.</p><br/><p>Evaluation stones are not usually displayed inside the shop. Not because it should not be seen by others, but because each evaluation stone is as tall as one and a half meters, and weighing about two hundred pounds. Very heavy. Usually, it can only be moved by adult males.</p><br/><p>You XiaoMo follows the women into the rear courtyard. He sees a milky white crystal in the courtyard. This is most probably the evaluation stone. There seems to be only one such thing in the whole courtyard.</p><br/><p>Most mages take the test on the spot unless they are from major sects. Because there are many people, major sects would buy the evaluation stone back. For a solitary mage like You XiaoMo, no one would be dumb enough to purposely buy an evaluation stone. But he is different because he already underwent the evaluation once, so he can’t take it again in front of everyone.</p><br/><p>The woman also doesn’t ask him why he doesn’t do the evaluation right away. She wanted to give the evaluation stone to You XiaoMo but You XiaoMo insists on buying it or he would go somewhere else to buy one. The woman can’t change his mind so she can only give him a rather low price, selling it to him for fifty gold coins.</p><br/><p>The shops in Qing city were selling evaluation stones at one hundred gold coins each. Also, they were a little smaller than the one here. The woman’s selling price of fifty gold coins is indeed quite a lot cheaper.</p><br/><p>This time, You XiaoMo doesn’t refuse anymore. He gives them another fifty gold coins and then leaves SiFang town with Ling Xiao.</p><br/><p>What the two of them don’t know is that five days later, some people came around asking in SiFang town. Those people by chance came inside the woman’s shop to ask. But the woman is also not someone who doesn’t know anything. Seeing that those people appear to have come with ill intent, she simply pretends not to know anything. After waiting for them to leave, the woman tells her son not to say anything about them.</p><br/><p>But these are all after the fact. At this time, You XiaoMo and Ling Xiao have left SiFang town. When they reach a place with no one around, he enters his dimension with Ling Xiao. He puts the evaluation stone straight into the dimension.</p><br/><p>The evaluation stone is placed in the courtyard of the small wooden hut. You XiaoMo stands in front of it and steals a glance at Ling Xiao. After some hesitation, he asks, “So ……. Elder brother, do I really have to do the test?”</p><br/><p>Ling Xiao gives him a sweet smile and asks him in reply, “What say you <i>ne</i>?”</p><br/><p>I say ……. it’s already bought. To not do the test is equivalent to throwing away fifty gold coins for nothing. This type of wasteful behavior to You XiaoMo, is definitely an incomparably shameful act. So in despair, he can’t help but agree with Ling Xiao.</p><br/><p>“Then, what am I supposed to do next?”</p><br/><p>You XiaoMo swallows a few times, suddenly feeling embarrassed.</p><br/><p>He hasn’t seen other people do the test before so he doesn’t know the specific steps. But ……. he regrets right after asking because the previous ‘him’ already took the test so this careless slip exposed himself.</p><br/><p>Ling Xiao looks at his miserable expression. His lips curve up playfully as he speaks with beaming eyes, “Put your hand on it and then transmit your soul force into the evaluation stone. That will do.”</p><br/><p>You XiaoMo’s hand shakes as he places it on the evaluation stone. A burst of ice cold sensation is felt coming from the evaluation stone. He shivers involuntarily before doing as Ling Xiao told him to, stimulating a thread of his soul force and transmitting it into the evaluation stone.</p><br/><p>In just an instant, the milky white evaluation stone suddenly emits an intense burst of bright light …….</p><br/><p>You XiaoMo’s eyes are blinded so he immediately closes his eyes, only opening them again when the rays start to weaken. When he looks at the twinkling lights on top of the evaluation stone, his eyes can’t help opening wider. What is the meaning of this?</p><br/><p>An ethereal glow is shining on top of the evaluation stone. He has never seen this color before. It’s not pink. Also not yellow. Neither is it green. It’s definitely not blue. It can only be described as a very ethereal color.</p><br/><p>You XiaoMo doesn’t know how to define the caliber of his own soul. The soul of the original You XiaoMo was green, below average innate talent. So what is his?</p><br/><p>“Elder brother Ling, what color should this be?”</p><br/><p>You XiaoMo can’t figure it out so he can only look questioningly at Ling Xiao. But when he looks at Ling Xiao, the latter’s usual smiling expression had disappeared leaving him looking completely expressionless. He can’t help getting a prickling sensation in his heart. It can’t be that there is something wrong <i>ba</i>?</p><br/><p>Seeing that he doesn’t answer, You XiaoMo calls out to him gingerly. He then waves his hand in front of his face, “Elder brother Ling, what’s the matter <i>la</i>?”</p><br/><p>Ling Xiao recovers extremely naturally, folding his hands across his chest. He glances at him with an unreadable expression, “Do you know that other than low, medium, and high, there is still another level of mages?”</p><br/><p>You XiaoMo silently sticks up his middle finger in his heart. At any rate, he is a level three mage. If he doesn’t even know this, he would have lived this half a year in vain.</p><br/><p>“Other than low, medium and high, there is one more class of super high level mages, the transcendent level mage. But this type of mage seems to have not appeared before. I hear that the very awesome mage called QiuRan also cannot be considered a transcendent level mage.”</p><br/><p>As for this QiuRan. You XiaoMo has only heard of how totally awesome he is. But he completely doesn’t know that the Heavenly Soul Scroll that he is currently practicing actually belongs to him. But, no matter how totally awesome he is, he still can’t touch the threshold of a transcendent level mage.</p><br/><p>“Then which level do you think you belong to?”</p><br/><p>Ling Xiao asks in high spirits.</p><br/><p>You XiaoMo’s mouth twitches furiously. If I knew, why would I need to ask you? But he still answers, “If I were to guess <i>ba</i>. The color on top of the evaluation stone does not match low, medium or high level.”</p><br/><p>He is not so narcissistic that he would think that he is a transcendent level mage.</p><br/><p>Ling Xiao’s eyes flashes as he speaks in a rather agitated voice, “If I were to tell you that you have the innate talent to become a transcendent level mage, would you believe it?”</p><br/><p>You XiaoMo doesn’t even have to think before shaking his head, “I don’t believe it!”</p><br/><p>He then gives him a scornful glance but after pondering for a bit, he starts to be unable to hide his excitement, saying eagerly, “If you say I have the innate talent to become a high level mage, then I can barely believe you ……. <i>ah</i>, it hurts!”</p><br/><p>The answer Ling Xiao gives him is rapping him once on the forehead. Then, as if feeling that it wasn’t hard enough, he raps him once again before he is able to cover his forehead. After rapping him, he asks cheerfully, “Now is it still barely?”</p><br/><p>You XiaoMo holds his forehead, shaking his head as tears dance in his eyes, sobbing pitifully, “Not barely, no longer the least bit forced, <b>*wuwu*</b> ……. ”</p><br/><p>This fellow’s actions are getting more and more ruthless. He feels that his low IQ must be Ling Xiao’s fault.</p><br/><p>Ling Xiao snorts lightly twice before pulling him up to himself. He takes his hand and gently rubs his forehead while saying, “The evaluation stones here are rather low grade. It is unable to accurately determine the level of your soul. But I can solemnly tell you that your soul is multicolored.”</p><br/><p>The person in front suddenly turns completely silent.</p><br/><p>Ling Xiao waits and still doesn’t get any reaction so he looks down to see our friend You XiaoMo with his mouth hanging open, looking stunned and silly. He can’t help but stretch out his hand and pinch his cheeks a few times.</p><br/><p>You XiaoMo suddenly cries out and regains his senses with some difficulty. He discovers that half his face is being pinched in someone’s hands, yet he already doesn’t have the power to bother about these things. He quickly grabs Ling Xiao’s hand and with sparkling eyes speaks excitedly while stuttering, “Elder brother Ling, is what you said true? My soul is is is ……. multicolored?”</p><br/><p>Ling Xiao laughs in amusement while answering, “You think that I always have to lie to you?”</p><br/><p>You XiaoMo immediately nods, “Yes!”</p><br/><p><b>*Dong*</b> rings out as Ling Xiao’s hand raps on his melon seed head again. With a threatening look and narrowed eyes, he says, “Say it again!”</p><br/><p>You XiaoMo grins foolishly without saying anything. This uncle is at the height of happiness so I won’t argue with you!</p><br/><p>After a while, he suddenly comes back to his senses, “Elder brother Ling, what did you just say? What do you mean ‘The evaluation stones here are rather low grade. It is unable to accurately determine the level of your soul.’ Didn’t we already determine it?”</p><br/>\n</div>"}