{"title": "Chapter 167", "id": 167, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-167", "volume_title": "Volume 2", "body": "<h1>Chapter 167</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Causing trouble</b></p><br/><p>Ling Xiao tilts his head and sees an ox skin sheet in his hand.</p><br/><p>This piece of leather seems very familiar. It seems to be very similar to the incomplete map of the Jade Spiritual cave that he has.</p><br/><p>You XiaoMo spreads it out and takes a look. There is a route marked on it but it is not clear. Also, it doesn’t indicate where it is leading to. This map was found in Ye Dan’s magic bag.</p><br/><p>At this time, Ling Xiao fishes out another piece of leather from the pile of stolen goods. It is the same as the one he has in his hand. If you want to insist on the details, they are different in size.</p><br/><p>The one in his hand is only the size of two palms. The one in Ling Xiao’s hand is the size of an A4 paper. On it, the terrain and routes are depicted very clearly. At the center of the map is a symbol of a palace. It seems as if most of the routes are leading to the palace.</p><br/><p>Comparing the two maps, it’s clear that the one in Ling Xiao’s hand is better. You XiaoMo immediately tosses away the map in his hand and goes over to Ling Xiao to read the map together.</p><br/><p>“Elder brother Ling, does the Paradise Realm have this kind of place?”</p><br/><p>You XiaoMo asks, full of curiosity.</p><br/><p>“The Paradise Realm used to have a Master. The existence of a palace is nothing strange.”</p><br/><p>Ling Xiao opens up the map and lays it on the ground. Looking at it like that, this map is actually very complete. The places they had gone to are mostly in it and there is still a lot they haven’t covered.</p><br/><p>The preparations of the demons are so complete. Looks like they have been paying attention to the Paradise Realm for a long time. Or perhaps they prepared all these things to deal with the disciples of the major sects. After all, most of the magic herbs are of no use to them. Only magic beasts are of use.</p><br/><p>You XiaoMo compares them for a second and discovers that although Ye Dan’s map is small, the map’s final destination is also that palace via a different route.</p><br/><p>“Elder brother Ling, do you think that both of them were headed to this palace? Qing Cheng sect has it so TianXin sect should also have it <i>ba</i>?”</p><br/><p>You XiaoMo thinks it over and suddenly looks towards Ling Xiao.</p><br/><p>But Ling Xiao definitely didn’t get this map. Furthermore, Elder Shi pointed them in the complete opposite direction from the palace. He seems to have purposely sent him further and further away from the palace, making it clear what his intentions were.</p><br/><p>Ling Xiao smirks, “Not even telling me such an important thing. Looks like Tang Fan has been wary of me for a long time. Oh well. Let’s go over and take a look. What is the secret hidden in the palace, attracting the attention of all the major forces?”</p><br/><p>You XiaoMo immediately nods his head in glee.</p><br/><p>He also wants to go take a look but he’s not in a hurry.</p><br/><p>The place they are at now is the Jade Spiritual Cave. From here, it would take at least half a day to get there. Furthermore, they would probably come across whatever magic herbs or magic beasts. Dig here, dig there, will also take some time. In the end, it would probably take over a day.</p><br/><p>As for the others, their situation is probably the same as them. Furthermore, they may not necessarily have such a clear map.</p><br/><p>After that, You XiaoMo and Ling Xiao pick through the things together, finally dividing up all their spoils of war.</p><br/><p>There are seven to eight martial arts techniques all together. Because they are from the same forces, there are a few copies of the same techniques. Luckily, Eleventh Star’s martial art technique is a high quality mid level volume. It seems to be one practiced by the core disciples of XingLuo group. However, since its nature is rather dark, what people would consider tainted ways, it can only be stored or sold.</p><br/><p>As for the demons, their martial art techniques are passed on from generation to generation so there is no specific volume of martial art techniques.</p><br/><p>Next are the magic pills. There are seven mid-level pills and more than five hundred low level pills. Half of them were dug out from the magic bags of the two mages. It’s too bad that Ling Xiao doesn’t like them so You XiaoMo can only put them away and find a way to sell them off later.</p><br/><p>Last of all, the magic herbs. Big sects are not the same. Their assets are rather significant. Furthermore, people like Eleventh Star would have come across good magic herbs. There are a few stalks of mid-level magic herbs that You XiaoMo doesn’t have. Moreover the quality is not low. It’s too bad that there isn’t a single stalk of level seven magic herb in their magic bags.</p><br/><p>By the time they finish dividing up and putting away the things, it is exactly an hour later.</p><br/><p>You XiaoMo places all the magic bags into one of the magic bags and then hands it over to Ling Xiao.</p><br/><p>Ling Xiao takes the magic bag and smiles until his eyes turn into slits. With a flick of his hand, he flings the magic bag with quite a lot of force. The naked eye can see the magic bag soaring through the air but just for a little while. Very quickly, it disappears from their field of view. Who knows where it flies off to.</p><br/><p>“Strange, why is Da Piqiu not back yet?”</p><br/><p>As You XiaoMo watches the magic bag disappear, he finally realizes that the agreed upon time has already passed.</p><br/><p>“Maybe he is too caught up in the joy of playing.”</p><br/><p>Ling Xiao seems to be thinking of something, the corner of lips lifting up showing a hint of amusement.</p><br/><p>“Playing?”</p><br/><p>You XiaoMo doesn’t understand.</p><br/><p>“Blue-blooded wolves are famous for their combat ability. Furthermore, fighting is the fastest way for them to rise in level. You were only willing to let it out after all this time so of course he has to ‘play’ to its heart’s content before coming back.”</p><br/><p>Ling Xiao rests his head on his arm and says contentedly.</p><br/><p>” ……. ” You XiaoMo.</p><br/><p>Looks like the playing he was referring to is fighting. He does know it is the nature of Blue-blooded wolves to love fighting but he didn’t know that they actually rise up in level by fighting.</p><br/><p>You XiaoMo asks helplessly, “Then when do you think it will come back?”</p><br/><p>Ling Xiao ponders for a moment and laughs while saying, “Wait for it to get over its excitement, then maybe it will remember your instructions.”</p><br/><p>You XiaoMo immediately feels the blow but soon thinks of something, “Since you already knew, why didn’t you say something earlier?”</p><br/><p>“Why should I say anything?”</p><br/><p>Ling Xiao gives him an odd glance. “Your Da Piqiu should get some training. Isn’t the Paradise Realm the best opportunity? Furthermore, if it doesn’t train for too long, it may be end up weaker than normal level eight magic beasts. Are you willing to see a mighty Blue-blooded wolf end up as a useless lump of meat?”</p><br/><p>You XiaoMo thinks it over for a second. A useless lump of meat. How fat would Da Piqiu end up? This type of thing is not uncommon in the 21st century earth. Often, he would see these kind of things on TV or on the web.</p><br/><p>He shudders in disgust. If Da Piqiu really ends up like that, he would probably have to commit suicide out of guilt. But he is curious. How did Ling Xiao come up with that expression?</p><br/><p>You XiaoMo steals a glance at Ling Xiao. The latter has no reaction whatsoever, only saying, “Alright <i>ba</i>. Let’s just wait for an hour.”</p><br/><p>And so, they really waited for an hour.</p><br/><p>During that time, You XiaoMo looked out quite a few times, right until an hour later. This time, when he stretches his head out to take a look, he finally catches a glimpse of a beast. Except that, this beast figure doesn’t seem to be a white Da Piqiu. Rather, it is a very bloody Da Piqiu.</p><br/><p>You XiaoMo runs out in shock, “Da Piqiu, how did you end up like this?”</p><br/><p>Da Piqiu seems to know that it is in the wrong. It whimpers *ao wu* and then turns away shamefully, not daring to look at him or get any closer.</p><br/><p>You XiaoMo also doesn’t dare to get closer. The bloody stench is too strong, almost causing him to faint of suffocation.</p><br/><p>Ling Xiao walks out from behind and gazes at Da Piqiu delightedly. With a rather judging tone, he says, “Not bad, not bad. Your first time out and you hunted down so many. As a newbie, your performance is really not bad. But it’s still a little lacking. Not only are you covered in filth, you are actually injured!”</p><br/><p>“Da Piqiu is injured?”</p><br/><p>You XiaoMo cries out in alarm and immediately forgets about the bloodiness. He quickly walks over and examines it thoroughly once over. Finally, he discovers a cut behind its right hind leg.</p><br/><p>Seeing this cut, You XiaoMo lets out a gasp.</p><br/><p>This cut is rather too big. Who knows what caused it, resulting in such a large wound. The cut is four cms deep. The white bone is almost visible, and fresh blood is flowing out continuously. But it would have been overlooked if not examined closely. Who asked it to be covered in blood, a moment of inattentiveness, and it would have been overlooked.</p><br/><p>In a moment of panic, You XiaoMo wants to put it back into the dimension.</p><br/><p>At his side, Ling Xiao places a hand on his shoulder to stop him, “Wait a bit, people are coming.”</p><br/><p>Just after he says this, shrill sounds can be heard coming from afar. The sound is getting nearer and nearer. It’s the sound of flying swords piercing through the sky. Clearly a lot of people coming. A mix of furious voices can be heard.</p><br/><p>Because You XiaoMo will soon advance to become a level four mage, his soul’s awareness is getting stronger and stronger. From far away, he can hear what the voices are saying. Most of it is ‘Where did it run to?’ ‘Quick give chase, don’t let it run away’ and so on. Although they don’t specify what ‘it’ is, You XiaoMo can guess that they should be referring to Da Piqiu.</p><br/><p>Soon after, that group of people appear in their field of vision one after the other.</p><br/><p>One after another they float down from the sky flauntingly, <b>red men, green women</b>, as if afraid that others won’t know that they come with powerful backing.</p><br/><p>You XiaoMo takes a closer look and his eyes almost fall out of their sockets.</p><br/><p>The people in front are actually people he recognizes. These people should be heading to the Southwest direction, Lei Ju and company. Why have they ended up here?</p><br/><p><b>Note:</b></p><br/><p>red men, green women – dressed fashionably</p><br/><p>________________________________________<wbr>__________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/>\n</div>"}