{"title": "Chapter 176", "id": 176, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-176", "volume_title": "Volume 2", "body": "<h1>Chapter 176</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Ascending Magic Beast Peak.</b></p><br/><p>The first human figure to appear is a pretty young man who looks sunny but is actually gloomy.</p><br/><p>The pretty young man has a beautiful face but not like a <b>flower vase</b>. His figure is rather delicate with a very slim waist that looks as if it won’t stand up to a hold. The face of the pretty young boy that should clearly warm the heart and delight the eyes is instead cold, as if everyone owes him a gold coin.</p><br/><p>This pretty young man is none other than Xiao Hei!</p><br/><p>Xiao Hei doesn’t seem to be too happy with his own human form, cold-faced from the start to the end. After appearing, he doesn’t even greet You XiaoMo and Sheqiu, and just sits down in a huff, cross-legged on the ground.</p><br/><p>But still there is something good that came out of it. His cultivation is now higher than it was before shapeshifting. Originally, he hadn’t broken through Star level. After shapeshifting, he advanced right through level six, becoming level seven and two stars.</p><br/><p>You XiaoMo wanted to ask him what’s the matter but he was distracted by Da Piqiu.</p><br/><p>Right after the appearance of Xiao Hei, Da Piqiu also walks out in human form from the place he was cultivating …….</p><br/><p>A short and stout little fatty is striding over on his two stumpy legs. However, probably because he is still not used to walking on two legs, the little fatty falls over with each step he takes. This happens again and again until the little fatty finally gets mad and gives up walking on two legs altogether. He simply falls to the ground and crawls towards them on his hands and feet …….</p><br/><p>You XiaoMo, ” ……. ”</p><br/><p>Xiao Hei, ” ……. ”</p><br/><p>Sheqiu, ” ……. ”</p><br/><p>What is this difference between now and what it was before shapeshifting?</p><br/><p>Little fatty crawls up to them with much difficulty. Although it is only a short several hundred meters, he is already huffing and puffing tiredly. He sits on the ground wheezing as he catches his breath.</p><br/><p>You XiaoMo is the first to react, exclaiming happily, “How apt that you’re my Da Piqiu, still looking like a ball even after shapeshifting. Looks like you really like the name I picked for you. But I didn’t expect you to be so this small after shapeshifting. I see that Da Piqiu doesn’t seem to really fit you.”</p><br/><p>Don’t look at the huge size of Da Piqiu’s actual body. The fact is, it has only been about two months since his birth. It’s already a miracle that he is able to shapeshift so one shouldn’t quibble about his human form.</p><br/><p>However, after hearing those words, Da Piqiu’s expression lights up in an instant as he looks expectantly at his master.</p><br/><p>He had wanted to get rid of this ridiculous name a long time ago but at that time, he was unable to speak so he had no choice but to accept it.</p><br/><p>Then You XiaoMo claps his hands and says, “From now on, you’ll just be known as Piqiu.”</p><br/><p>Piqiu who suddenly lost the word Da, ” ……. ”</p><br/><p>Xiao Hei and Sheqiu looks at Da Piqiu with sympathy, oh wait, now it’s Piqiu, but ……. there doesn’t seem to be a difference from before.</p><br/><p>Piqiu objects, “Master, I don’t like Piqiu.”</p><br/><p>You XiaoMo exclaims in surprise, “Why? Piqiu is very nice sounding, just like Sheqiu. Later on you all can form a Qiu team. How good <i>ah</i>. That’s right, there’s also Xiao Hei. Since everyone has the character Qiu, it’ll be fine if Xiao Hei also changes his name.”</p><br/><p>Xiao Hei grinds his teeth as he says, “I don’t want to.”</p><br/><p>You XiaoMo sees that his face turns black so he immediately explains, “Xiao Hei will change his name to <b>Heiqiu</b>. After all, your fur is black. But since everyone is used to calling you Xiao Hei, although your real name will be Heiqiu from now on, everyone call still call you Xiao Hei.”</p><br/><p>Sheqiu’s pair of green eyes suddenly light up but it was only for an instant. Very quickly the rays of hope are extinguished. Although he really wants to change his name, he might as well not say anything.</p><br/><p>Why would You XiaoMo care if they like it or not? He wants them to form a Qiu team so it will be so even if they don’t like it. Therefore, resisting is completely pointless.</p><br/><p>Clearly Sheqiu understands this point. Therefore, he doesn’t make too much of a fuss about his name.</p><br/><p>Although he hasn’t been together with You XiaoMo for long, he can still tell that this puny little mage is definitely not someone without his own ideas. The things that he has decided upon, unless you can convince him otherwise, he definitely wouldn’t care about you. Even if you speak until your lips split, he would still continue on resolutely with what he has decided.</p><br/><p>And so, a three person Qiu team comes out fresh from the oven.</p><br/><p>You XiaoMo smiles in satisfaction. Later, when they gather enough members, they may be able to form a five person basketball team or even make up two soccer teams.</p><br/><p>Right at this moment, a hysterical laughter rings out in the sky.</p><br/><p>When everyone raises their heads, the owner of that laughter has already appeared in front of them. A dashing and imposing ……. old man?</p><br/><p>You XiaoMo pouts, “Elder brother Ling, you’ll look better if you resume your original appearance.”</p><br/><p>He really can’t bear to look at Ling Xiao’s usual expression on the face of an old man. It makes it seem surreal. Maybe it will even cause him to recall the old man Ling Xiao every time he sees him from now on …….</p><br/><p>The old man laughs sinisterly, “Little brother, do you judge people solely by their appearance?”</p><br/><p>You XiaoMo throws up,”<i>Ou</i>~”</p><br/><p>Piqiu, Heiqiu, and Sheqiu look up at Ling Xiao in worship.</p><br/><p>After teasing his own Little brother, Elder Li, who is Ling Xiao, agrees to You XiaoMo’s request and finally resumes his original appearance. Of course, this is not his true appearance but Lin Xiao’s appearance.</p><br/><p>Seeing Ling Xiao in his original appearance, You XiaoMo feels a little better, saying wearily, “Why did you come in? Were you found out?”</p><br/><p>“If I don’t let them find out, do you think they can?” Ling Xiao’s nose is almost pointed to the sky. These words are spoken with utmost self-confidence, spoken as if Luo ShuHe and company do not exist.</p><br/><p>You XiaoMo is silent.</p><br/><p>Even though it is rather arrogant, it can’t be denied that this fellow has the right to be arrogant.</p><br/><p>Speaking about that, Ling Xiao had a good idea at that time, to impersonate Elder Li. And so, fifteen days ago, the Elder Li that entered Ling He canyon simply wasn’t able to check on Sheqiu and the Emperor’s Blood herb before he was eliminated by Ling Xiao.</p><br/><p>After eliminating that fellow, he tossed Elder Li’s body into the black hole. Because he absorbed Elder Li’s memory, he was able to mimic him very closely. Luo ShuHe and company completely couldn’t tell that he was a fake.</p><br/><p>“Elder brother Ling, are they preparing to head to the palace?”</p><br/><p>Counting the time, You XiaoMo realizes that two thirds of the month have already passed, so it should be about time.</p><br/><p>Ling Xiao utters a vague sound of agreement, and then says, “I have gotten quite a lot of information from Luo ShuHe and company these few days. However, I still feel that Luo ShuHe seems to be hiding something.”</p><br/><p>“He can’t even tell Elder Li?” You XiaoMo asks excitedly, “Then what could he be hiding? Can it be that you’re overthinking things?”</p><br/><p>According to the situation, it’s unlikely that Luo ShuHe would conceal things from his own people, especially from two strong Elders. That’s because there are dangers upon dangers in the Paradise Realm. If they don’t work as one, many things can’t be accomplished.</p><br/><p>Ling Xiao casts a sidelong glance at him and narrows his eyes while saying, “Little brother, do you think I’m overthinking things?”</p><br/><p>You XiaoMo laughs hollowly, “I’m only guessing, that’s all.”</p><br/><p>Piqiu, Heiqiu, and Sheqiu look at him with disdain. So domineering towards them and yet not even daring to exhale when it comes to Elder brother. Utmost contempt!</p><br/><p>After this, Ling Xiao is not planning to follow Luo ShuHe and company any more. Firstly, they already have enough information so it’s unlikely that they would have to rush around blindly when they go up Magic Beast peak. Secondly, all of Qing Cheng sect’s disciples will be gathered together so there would be a significant decrease in efficiency. Following them would only be a waste of time. Since he has decided not to follow them any longer, ‘Elder Li’ no longer has to go back there.</p><br/><p>At the same moment, not long after ‘Elder Li’ left, Luo ShuHe and company finally see the first batch of people they were waiting for.</p><br/><p>Not long after the first batch reaches the small valley, more Qing Cheng sect disciples start to arrive one after another. Roughly throughout the day, the disciples arrive until finally everyone is here. However, there are some casualties. Fortunately the disciples who are hurt do not have serious injuries.</p><br/><p>Luo ShuHe takes a headcount and realizes that Elder Li has yet to return.</p><br/><p>Elder Li is not an irresponsible person. Not returning after such a long time probably means he has met with some thorny issues. However, they do not know where he went so they can’t go look for him. In the end, Luo ShuHe decides to wait for half a day. If he doesn’t come back by then, they will set out without him.</p><br/><p>The result is a foregone conclusion. ‘Elder Li’ simply doesn’t come back.</p><br/><p>On the other side, Ling Xiao and You XiaoMo, who set out one step before them, rely on the map and very quickly arrive at the foot of Magic Beast peak.</p><br/><p>During that time, they came across groups from the other sects and forces.</p><br/><p>Vast and mighty with a rather imposing manner. Among them are those from TianXin sect. Naturally, they have also assembled together, led by a few strong Elders. Among the people are Lei Ju, Tang YunQi, and others.</p><br/><p>It is worth mentioning that the group of people also contain the few disciples who parted ways with Ling Xiao at the stone platform. Looking at them, it seems as if they have not told anyone about what Ling Xiao told them to do.</p><br/><p>Other than that, Fang ChenLe and Fu ZiLin are also present.</p><br/><p>The curious thing is, Fang ChenLe doesn’t seem to be regarded highly by the few Elders as You XiaoMo imagined.</p><br/><p>Especially that Elder Shi that abandoned him to save himself. He definitely isn’t trying to get on Fang ChenLe’s good side. Instead, he is with the haughty and pompous Tang YunQi and Lei Ju. They must have had some lucky encounters these fifteen days, actually bonding with a level seven and level six magic beast.</p><br/><p>As for the Poisonous Flood Dragon that Fang ChenLe bonded with, there is no sign of it. Most probably it is hiding as its mini-version.</p><br/><p><b>Notes:</b></p><br/><p>flower vase – just a pretty face</p><br/><p>Heiqiu – black ball</p><br/><p>________________________________________<wbr>__________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/><p>Thanks for the kind words! Let’s plod on in the meantime.</p><br/>\n</div>"}