{"title": "Chapter 174", "id": 174, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-174", "volume_title": "Volume 2", "body": "<h1>Chapter 174</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Lucky Luo ShuHe.</b></p><br/><p>Hearing the words Green Cloud magic pill, You XiaoMo already has no doubt that the one coming is Luo ShuHe.</p><br/><p>Hearing his tone of voice, it seems as if they had the luck to bond with that Heavenly Bird of Six Thunders. And the one that bonded with him should be Luo ShuHe. Martial artists can also bond with magic beasts but they need the help of a mage.</p><br/><p>“Congratulations Elder brother, congratulations elder brother! Now we only have to let Junior Sister Yun bond with this Nine-Winged Magic Horn Serpent, and that would mean that Qing Cheng sect will have three emperor level fighters. When that time comes, the lowly TianXin sect will no longer be a match for us. We could even eliminate them.”</p><br/><p>“<i>Ah</i>, these things shouldn’t be said too early. It’s possible that TianXin sect is also as lucky as us, bonding with two level nine magic beasts all of a sudden.”</p><br/><p>Luo ShuHe chuckles. Although there is faint admonishment in his words, anyone can hear that he doesn’t mind it and is actually quite excited. In his heart, he just doesn’t think it’s possible that the disciples of TianXin sect can be as lucky as them.</p><br/><p>That Junior brother who was speaking scoffs, “What’s so great about TianXin sect? This kind of luck is not something anyone can have. The way I see it, they would be lucky to bond with one level eight magic beast.”</p><br/><p>“Big brother Yang, what Elder brother said is not wrong. It’s too early to decide the outcome. One month is not yet over. No one knows how it will turn out in the end.”</p><br/><p>A gentle voice suddenly speaks up. Seems to be that Junior sister Yun.</p><br/><p>“I know <i>la</i>. Seems like Junior sister Yun speaks up for Elder brother every time.”</p><br/><p>Big brother Yang teases.</p><br/><p>These words seem to anger that Junior sister Yun. She can be heard stamping her feet as if shamed to anger while saying, “I’m only agreeing with Elder brother’s view. Don’t talk nonsense Big brother Yang.”</p><br/><p>Big brother Yang laughs *hei hei*, seemingly not believing her words.</p><br/><p>Maybe because Luo ShuHe bonded with a level nine magic beast, so the group of people are no longer as uptight as they were when they first entered the Paradise Realm. Now they are already in the mood to joke around.</p><br/><p>After a while, Luo ShuHe finally opens his mouth, “Everyone should not forget themselves. The Nine-Winged Magic Horn Serpent is not like the Heavenly Bird of Six Thunders. He has already shapeshifted for many years. His injuries are also not as severe as that of the Heavenly Bird of Six Thunders. Whether we will be able to bond it is yet uncertain. Furthermore, the canyon is very deep. It is unclear whether there are other magic beasts inside. Everyone be a little more careful.”</p><br/><p>“What Young Master says is right. The situation inside the canyon is not clear. How about you let old me go first to take a look <i>ba</i>.”</p><br/><p>“Then, we’d have to trouble Elder Li.”</p><br/><p>Luo ShuHe says.</p><br/><p>“Young Master is too polite. If old me doesn’t come back out in a hour, Young Master should lead everyone away from here and find another opportunity to come back later.”</p><br/><p>Elder Li says.</p><br/><p>Luo ShuHe frowns. If Elder Li who is Star level seven stars were to fall inside, it would mean that the situation inside is not as rosy as they imagine. He then says, “ShuHe understands.”</p><br/><p>Naturally, not one word of their conversation escapes Ling Xiao’s ears.</p><br/><p>Ling Xiao didn’t expect that their group of only three Star level fighters could actually walk up to here. Furthermore, Luo ShuHe has pretty good luck. He chanced upon a heavily injured level nine magic beast. If he really gets to bond another level nine magic beast, TianXin sect would really be pushed down completely by Qing Cheng sect.</p><br/><p>It’s a pity that their rosy plan is doomed to fail.</p><br/><p>You XiaoMo wanted to catch that Heavenly Bird of Six Thunders to bond with Fifth Brother or Second Brother. Unfortunately Luo ShuHe was ahead by a step so he can’t help feeling a little disappointed.</p><br/><p>You XiaoMo speaks hastily, “Elder brother Ling, that Elder Li is coming in soon. Should we not hide?”</p><br/><p>“No need. I thought of a good idea.”</p><br/><p>The corners of Ling Xiao’s lips rise up slightly, revealing an especially warm smile, as if he has just thought of some excellent idea.</p><br/><p>Half an hour later, Elder Li who entered the canyon comes back out safely, but with a disappointed expression.</p><br/><p>Luo ShuHe frowns when he sees his expression but still asks hopefully, “Elder Li, what is the situation? Is that Nine-Winged Magic Horn Serpent really heavily injured?”</p><br/><p>Elder Li sighs, “Young Master, we are one step late. That Nine-Winged Magic Horn Serpent was taken by someone one step ahead of us. I just went in to take a look. There is nothing left inside.”</p><br/><p>Luo ShuHe’s face can’t help but falls as he speaks in a heavy tone, “That Emperor’s Blood herb <i>ne</i>?”</p><br/><p>Elder Li smiles drily while shaking his head, “Also gone.”</p><br/><p>In an instant, the very happy atmosphere that was there half an hour go disappears all at once, replaced with a very subdued heaviness. Everyone is silent. If it was only the Nine-Winged Magic Horn Serpent that disappeared, everyone would probably not be so disappointed. But that Emperor’s Blood herb was the purpose of this mission. If it’s gone, finding another one would be difficult.</p><br/><p>After a while, Luo ShuHe frowns as he says, “Elder Li, who do you think took the Emperor’s Blood herb?”</p><br/><p>Elder Li ponders for a bit, “The Emperor’s Blood herb is a level nine magic herb. If not careful, or if one’s level is too low, it’s impossible to to dig it out completely without damaging it. Old me saw what was left after the Emperor’s Blood herb was dug out. Extremely complete. So old me thinks that the person who dug out the Emperor’s Blood herb must be at least a level five mage.”</p><br/><p>“Level five mage. Only TianXin sect and XingLuo group have that capability.”</p><br/><p>Luo ShuHe speaks solemnly.</p><br/><p>For second class forces like XiaoYao group and the rest, they would definitely not send a level five mage to the Paradise Realm. Although the Paradise Realm is a rare opportunity, the element of danger is high. They would’t be able to bear the loss.</p><br/><p>It’s not the same for TianXin sect and XingLuo group.</p><br/><p>They have level eight and even level nine mages. Why would they bother about a level five mage? They have deep resources and deep talents. They just have to pay a little more attention in nurturing and that would do.</p><br/><p>“TianXin sect already knows that the magic pill recipe was ‘taken’ away by Grand Master. If it falls into their hands, it would be very troublesome. As for XingLuo group, they still don’t know about the level nine magic pill recipe. If we act rashly, it would only cause them to be suspicious. Furthermore, we just don’t know who dug it up.”</p><br/><p>The other Star level seven star Elder Mo shakes his head and sighs as he speaks.</p><br/><p>“You can’t mean just let it go?”</p><br/><p>Brother Yang says unwillingly.</p><br/><p>They have been looking for the Emperor’s Blood herb for a long time. They only managed to charge into the Jade Spiritual Cave after much difficulty. It was clearly something that was just before their eyes and yet they were just one step behind. This kind of feeling leaves them feeling especially helpless and furious.</p><br/><p>“Whatever it is, let’s leave here before talking it over <i>ba</i>.”</p><br/><p>Elder Li says.</p><br/><p>Although everyone’s mood is down in the dumps, they know that they shouldn’t linger here. Ling He canyon is no longer presided over by a level nine magic beast. Very quickly, other magic beasts will come over when they get wind of it. Although they have two Star level seven star fighters, it’s better to take precautions.</p><br/><p>Very quickly they return to the nest of the Heavenly Bird of Six Thunders.</p><br/><p>Because the Heavenly Bird of Six Thunders is heavily injured, Luo ShuHe left it in its nest.</p><br/><p>Although he is very furious that the despicable human cultivators took advantage of his injuries to act, there is nothing he can do about it. That human cultivator named Luo ShuHe seized the opportunity to form a life-bond with him. Killing him would be the same as killing himself. That is not something he’s looking to do. Right now, the important thing is to recover from his injuries. If the news that he is injured gets out, the other magic beasts will take the opportunity to seize his territory.</p><br/><p>As for magic herbs, it’s a pity that he only has a stalk of level eight magic herb. The number of level nine magic herbs in the Jade Spiritual Cave can be counted on one hand. Otherwise, he wouldn’t have to go snatch the Nine-Winged Magic Horn Serpent’s level nine magic herb.</p><br/><p>The cave of the Heavenly Bird of Six Thunders is rather special. It’s located on the edge of a very steep cliff. At the precipice of the cliff, there is an enormous opening. The mountain cave is big enough to accommodate his true form.</p><br/><p>Because of injury, the Heavenly Bird of Six Thunders has no way of retaining his human form. He can only assume his true form and rest inside the cave.</p><br/><p>When Luo ShuHe returns, he catches sight of the humanlike flash of anger in the expression of the Heavenly Bird of Six Thunders. He knows that he is angry about something. Thinking that they would be partners from now on, he says, “Heavenly Bird of Six Thunders, I know you are very unhappy. But we are now partners, with you being my life-bond magic beast. I promise that I won’t treat you badly.”</p><br/><p>The Heavenly Bird of Six Thunders rolls his enormous eyeballs and gives him a glance. Although he acknowledges the truth in his words, he still won’t accept him right away. It doesn’t matter if he is the son of whatever Qing Cheng sect’s Grand Master, or however great his potential.</p><br/><p>Luo ShuHe knows that he needs to give him a little time so he doesn’t bring up the matter about the bond again. Instead, he asks tentatively, “Heavenly Bird of Six Thunders, we want to leave this place. You ……. can you still fly?”</p><br/><p>At first, the Heavenly Bird of Six Thunders doesn’t react. After a while that enormous body suddenly gets smaller and smaller. Finally turning into a mini version of the Heavenly Bird of Six Thunders. If one doesn’t look closely, one wouldn’t be able to tell what kind of magic beast he is.</p><br/><p>The cavernous mountain cave feels extremely wide all of a sudden.</p><br/><p>Luo ShuHe is struck with glee. The willingness of the Heavenly Bird of Six Thunders to shrink himself means that he is already showing some signs of accepting him.</p><br/><p>At that time, when he was establishing the bond with the Heavenly Bird of Six Thunders, he did feel some hesitation. After all, forming the bond by force increases the possibility of lowering the affinity of the bond. Looks like there is some hope.</p><br/><p>Luo ShuHe scoops up the mini Heavenly Bird of Six Thunders and places him carefully on his shoulder before leaving the cliff.</p><br/><p>Seeing the Heavenly Bird of Six Thunders, everyone’s mood finally starts to lift a little. Although they weren’t able to find the Emperor’s Blood herb, having a level nine magic beast allows Qing Cheng sect to rise up one level, putting TianXin sect under their feet.</p><br/><p>Now their mission continues with their quest for other magic herbs and magic beasts. For the moment, the dreams of level nine magic herbs are put to one side.</p><br/><p>Because the Heavenly Bird of Six Thunders told them that although there really are more level nine magic herbs in the center of the Jade Spiritual Cave, the magic beasts guarding the level nine magic herbs are even stronger. Some are almost on the point of breaking through past level nine. They would only be walking to their deaths if they proceed.</p><br/><p>Although it’s too bad, while depending on the Heavenly Bird of Six Thunders, they really managed to find quite a few good magic herbs and magic beasts of acceptable level in the following fifteen days. Although their levels cannot match that of the Heavenly Bird of Six Thunders, level six and level seven is not too shabby. Although some of the magic beasts have already gained spiritual enlightenment, they would still lose when battling with humans.</p><br/><p>In no time the contingent that started with five people, rises like a dragon all of a sudden, with the addition of seven mid-level magic beasts. Not only that, this lineup can probably be considered the strongest lineup in the Paradise Realm.</p><br/><p>________________________________________<wbr>___________I don’t speak Chinese. Corrections welcomed.</wbr></p><br/>\n</div>"}