{"title": "Chapter 178", "id": 178, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-178", "volume_title": "Volume 2", "body": "<h1>Chapter 178</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Magic crystal.</b></p><br/><p>The ice cold deep water almost pierces the skin but it’s only for a moment before the feeling disappears, replaced by a gentle energy. That gentle energy surrounds him and spreads out forming a membrane like a water bubble, gently undulating as it encloses him and Ling Xiao within.</p><br/><p>You XiaoMo takes one look and knows that it is Ling Xiao’s work of art. Just as he is about to say something, *peng* rings out, and the membrane of the water bubble shakes suddenly. There seems to be something in the ice cold deep waters.</p><br/><p>At this moment, Ling Xiao’s voice enters his ears, “Take your soul force and condense it in both of your eyes.”</p><br/><p>You XiaoMo doesn’t hesitate and takes a wisp of his soul force and covers his eyes with it. Faint white rays immediately shine from his black eyes. When he looks forward again he finally sees the water demons dashing against the barrier.</p><br/><p>One, two, three ……. countless water demons surround them, with cold expressionless faces, as if they are already food in their mouths.</p><br/><p>After the first water demon dashes against the barrier enclosing them, sounds of the second and third hits rise and fall. The water demons are slamming against the barrier frantically as if their lives depended on it. Each and everyone not seeming to tire nor bruise, slamming into the barrier such that it rings *peng peng* as if it could break at any time.</p><br/><p>You XiaoMo grips Ling Xiao’s arm tightly, terrified that they would really puncture the barrier. Although he knows in his heart that it is not possible, he still feels his insides quake with fear.</p><br/><p>Furthermore, these water demons are just like those described in the scrolls, mostly of level four or five strength. Based on their strength and power, it is impossible for them to break Ling Xiao’s barrier.</p><br/><p>This situation continues for roughly the time it takes to burn half a josstick. Then the water demons finally stop their self-harming ramming actions. Each and every one of them opens their mouths and let out bursts of sound waves. However, the sound waves do not reach You XiaoMo’s ears because they are kept outside by Ling Xiao’s barrier.</p><br/><p>Very quickly, You XiaoMo realizes why they are roaring.</p><br/><p>Looks like they were issuing sound waves not to attack them, but to summon their own kind.</p><br/><p>Ling Xiao had said that this Shallow Shores is a ten thousand year old abyss. Over a thousand water demons lie in its depths.</p><br/><p>Although the ones here now are really only those of level four and five strengths, no one can guarantee that there aren’t stronger water demons in the Shallow Shores.</p><br/><p>A few minutes later, You XiaoMo sees a water demon that is different from the others. Its body is still transparent but there are dark purple rays coming from within it. If ordinary practitioners were to see this, they probably have no choice but to run for their lives, because this water demon is actually a level nine.</p><br/><p>Unlike You XiaoMo’s look of horror upon seeing this water demon, Ling Xiao expression turns to joy upon seeing it, his eyes almost shining, “Turns out there really is a magic crystal down there. This water demon has a level nine cultivation most probably because it absorbed the magic crystal at the bottom of the abyss.”</p><br/><p>Magic crystal is something very different from magic water.</p><br/><p>Simply put, a magic crystal is almost equivalent to the condensed essence of a million drops of magic water. Hence, it’s clear how precious it is.</p><br/><p>However, things like magic crystals are not the same as magic water. Places with magic water may not necessarily produce magic crystals. The formation of magic crystals requires the right time and the right place. Just like the magic water in You XiaoMo’s dimension, although he has a lake that is completely made up of extremely pure magic water, it doesn’t satisfy the condition of the right time. It can only be considered man-made so it can’t produce magic crystals.</p><br/><p>So to put it more accurately, the Shallow Shores is an immense pool of magic water, most probably a naturally occurring one. Then the master of the Paradise Realm decided to rear water demons in it so it appears here. Furthermore, because there is ice poison below the magic water, no matter how attractive it is to men, they can only look at it from afar as it is not something that can be touched carelessly.</p><br/><p>However, the allure of the precious magic crystal is sufficient to drive martial artists and mages mad with desire. Therefore there are times when even knowing that the danger is greater than the chance, there still will be people coming to replace the fallen for all kinds of treasures.</p><br/><p>Hearing that the water demon had absorbed the magic crystal, You XiaoMo asks hastily, “Elder brother Ling, we can’t be too late <i>ba</i> now that the magic crystal in the abyss has been absorbed by this water demon?”</p><br/><p>If it really is like that, they luck is really too bad. After finally coming across this rare chance of finding an abyss with a magic crystal, they are actually one step too late.</p><br/><p>Ling Xiao says, “This abyss is at least over a few ten thousand years old. There are probably quite a few magic crystals inside. No matter how capable the water demon, it is impossible for them to absorb it completely.”</p><br/><p>You XiaoMo tugs on his clothes repeatedly, “Elder brother Ling, then let’s quickly go down and have a look.”</p><br/><p>At this moment, that water demon finally starts to act. It raises its head and roars. Its big and sharp mouth seems like a cannon, as it slowly starts to condense energy into a ball. The power in that sphere of energy is extremely violent. Everything underwater seems to be affected. Even You XiaoMo, hiding inside barrier, can feel the shockwaves.</p><br/><p>A moment later, the water demon’s energy ball is fully formed.</p><br/><p>A faint sinister and ferocious ray flashes in the eyes of the water demon as it gives out a deafening roar and shoots the ball of energy at them.</p><br/><p>The naked eye can see the ball of energy speeding towards them. The tremendous power seems to cut open the water. In a flash, it envelops the barrier surrounding them.</p><br/><p>Logically speaking, having such a tremendous amount of energy hitting the barrier, it should at least shake a little. However, You XiaoMo’s wide open eyes can only see that after it hits the barrier, it very quickly ……. gets absorbed.</p><br/><p>That water demon clearly has very high spiritual intelligence. Seeing that its attack is unsuccessful, and how easily it was neutralized, its pupils widen suddenly. Just as You XiaoMo thinks that it’s going to continue its all out assault, the water demon turns tail and runs off.</p><br/><p>That speed, that action, no matter how you look at it, it looks as if it has happened many times before. You XiaoMo had thought it had so much backbone, and was so awesome, never expecting that it would run away just like that.</p><br/><p>Naturally Ling Xiao chases right after it without saying a word.</p><br/><p>The Shallow Shores is very deep. Looking for it will be troublesome. Ling Xiao has always been someone who likes to get straight to the point.</p><br/><p>The water demon is only at level nine, clearly no match for Ling Xiao. He catches up to it in no time. Seeing the water demon fleeing at top speed, this old fellow appears in front of it with utmost ease. Stretching out his hand, a formless hand appears outside the barrier. The water demon struggles with all its might but it is still caught by Ling Xiao’s magical hand.</p><br/><p>Looking at the water demon struggling non-stop, Ling Xiao smiles at You XiaoMo, “Little brother, do you have any interest in bonding with a level nine water demon?”</p><br/><p>You XiaoMo looks at that water demon and shakes his head vehemently, “I don’t want.”</p><br/><p>Thinking that the water demon was once human, he feels a wave of nausea. Furthermore, the body of the water demon has the highly contagious ice poison. This plaything sounds very much like the narcotics that drive men to depravity. Just thinking that this thing will be following him around all the time makes him have goosebumps.</p><br/><p>“That’s a real pity.”</p><br/><p>Ling Xiao sighs.</p><br/><p>Not in the least, is what You XiaoMo thinks as he clenches his teeth.</p><br/><p>Ling Xiao then smiles at that water demon while saying, “Since little brother doesn’t want you, the only use left for you is to lead the way. Don’t try to refuse me <i>oh</i>. Otherwise, I can still find the magic crystal after I kill you. But I don’t want to kill you so be good and listen.”</p><br/><p>A faint expression of horror flashes across the purplish transparent face. Looks like it can already imagine what Ling Xiao would do. If it really dares to refuse, it believes that this man in front of it will definitely kill it without the slightest hesitation. After weighing the pros and cons, the water demon finally still takes them to the magic crystal.</p><br/><p>Not only is the Shallow Shores deep, the underwater world is also vast.</p><br/><p>The water demon brings them down for almost five thousand meters before reaching the bottom. Not long after, an enormous piece of milky white crystal appears before them.</p><br/><p>At this point, the water at the bottom is clearly divided into two distinct colors.</p><br/><p>The water surrounding the crystal is faintly milky white, enclosing the enormous crystal at the bottom of the water.</p><br/><p>The water demon stops in front of this piece of crystal and actually approaches it of its own accord. It even stretches out its hand to touch it as if telling them that this piece of crystal is the magic crystal they are looking for.</p><br/><p>Ling Xiao stretches out his hand but stops his hand suddenly just before he touches the ‘magic crystal’. At this time, he beams as he raises his head and looks at the water demon with an extremely sweet expression. He parts his lips lightly and says, “Are you hoping that I would touch it?”</p><br/><p>The expression of the water demon changes abruptly. A fist booms towards the so-called ‘magic crystal’. The ‘magic crystal’ is unable to withstand the force of the fist. In an instant, a huge chunk of it splits with a *hong*. The fragments of the ‘magic crystal’ immediately flies towards Ling Xiao who is the nearest to it.</p><br/><p>But the result is still the same. The moment it gets close to the barrier, it is repelled outwards. Not the least bit effective.</p><br/><p>These things are actually not magic crystals. The IQ of the water demon is so high. There is no way it would be willing to give away the magic crystal it has been guarding in preparation to ascend in level. Therefore, it intentionally led them to the crystal formed by ice poison, wanting to deceive these two people with it. It didn’t expect that they would find out.</p><br/><p>“Overestimating your own strength.” Ling Xiao snorts *hng*, “I gave you a chance, yet you did not appreciate it. So don’t blame me.”</p><br/><p>Then Ling Xiao flicks his finger. The purple flames that haven’t appeared for a long time come to live once again. It’s just that this time the purple flames seem to be not quite the same. There are traces of other flames in its midst, as if two types of flames are intertwined together. It finally takes the form of a fire dragon that charges at the water demon.</p><br/><p>As soon as the water demon catches sight of the flames, it feels the burning hot temperature transmitted by the flames, causing its eyes to widen in horror. Finally, it really feels the terror.</p><br/><p>________________________________________<wbr>__________I don’t speak Chinese. Corrections welcomed.</wbr></p><br/>\n</div>"}