{"title": "Chapter 188", "id": 188, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-188", "volume_title": "Volume 2", "body": "<h1>Chapter 188</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2>Zhou Peng’s Incident</h2><br/><p>By the time You XiaoMo was just about to climb the winged bird, Xiao Long had already flown away. Fang ChenLe who was beside him, patted his shoulder, signaling him to sit down because the winged bird was about to fly.</p><br/><p>Although it was impossible to get information from other people, the one who picked them up at the summit was You XiaoMo’s Fourth-shijie, Nan GongYing. When they asked, although Nan GongYing was hesitant, she still told them anyway.</p><br/><p>Actually, something big had happened at the Tian Xin Sect.</p><br/><p>A month ago, all the major forces and the demons had been in constant dispute. Both sides had many casualties. The bad relationship had continued to get worse, but not that long ago, just around half a month after they enter the Paradise Realm.</p><br/><p>The Tian Xin Sect dispatched several armies against the demons attack, only to be caught in a surprise attack by the demons and were totally annihilated. Among these people, there was Xiao Long’s best disciple, Wang YuFei. He was the one who mocked You XiaoMo at the library because of the Lei Ju’s incident.</p><br/><p>Actually, the demons’ attack toward the Tian Xin Sect was something that they had expected. But the problem was that the Tian Xin Sect’s armies were something that was temporarily because of the conditions. They still hadn’t fixed any schedules yet for the shift changes, and it changed almost everyday.</p><br/><p>Somehow the demons looked like they knew when and where the shift changed. Not only did they manage to sneak into the Tian Xin Sect’s territories, they also managed to kill two patrols. When he found out about this matter, the Grand Master became furious and ordered the matter to be investigated thoroughly.</p><br/><p>To be able to know the exact time and place clearly, there were only two possibilities: one was that there was a spy from the demon’s side hiding inside Tian Xin Sect. Second was someone was working together with the demons, and that’s how the information leaked out.</p><br/><p>And thus, Tang Fan gathered all the people who knew this information, and investigated them one by one. In the end, they found a suspect. That person was Zhou Peng, Ling Xiao’s closest junior.</p><br/><p>Actually, there was no clear evidence about Zhou Peng teaming up with the demons. He couldn’t tell them his whereabouts that day, and no one could give any testimony for his alibi, so he became the suspect, and was put on death row by the Tian Xin Sect.</p><br/><p>As to why they took Ling Xiao, that was because Zhou Peng and Ling Xiao’s relationship was as close as brothers and Zhou Peng usually obeys Ling Xiao’s words. Moreover, Ling Xiao’s behavior for the past year was very unusual. So the Grand Master suspected there was something wrong with him, and asked Xiao Long to bring him back to the Tian Xin Sect.</p><br/><p>You XiaoMo became speechless, “You can arrest people without evidence?”</p><br/><p>Tang Fan clearly wanted to control Ling Xiao, so he took this opportunity to make Ling Xiao become powerless.</p><br/><p>Nan GongYing was actually really puzzled too; Lin Xiao is the Grand Master’s top student. He’s powerful, kind towards people, all disciples–whether it’s junior or senior– put their trust in him. You could even say that he had the possibility to become the Grand Master’s successor. Usually, the Grandmaster should have had a proper investigation done before ordering people to take Lin Xiao back, his way was not the proper way to treat the future heir.</p><br/><p>Then again, no one could ever guess what was inside the Grand Master’s head, so even if they puzzled over his actions, the most they can do was just observe from the side.</p><br/><p>“Anyway, I believe Lin Xiao should be okay. We just have to wait for him, the Grand Master might release him in two days.” Fang ChenLe said while looking at You XiaoMo. He obviously said this to relieve You XiaoMo, because he assumed You XiaoMo would be very worried about Ling Xiao. In fact, You XiaoMo never worried about him. On the contrary, he only hoped that this matter won’t become serious or else, it would be over, especially if they ended up provoking Ling Xiao.</p><br/><p>On the third day the sun begun to rise, they finally arrived at the summit. Due to the demons’ attack, the atmosphere at the summit was much more oppressive compared to a month ago.</p><br/><p>When the five of them got to the summit, they received so much attention from all disciples. Actually, there was one more disciple that should have been there and that person was Zhao Zhang’s nephew. Unfortunately, his luck was not as good and he had died in the Paradise Realm’s territory.</p><br/><p>Fang ChenLe, while leading his juniors, walked towards Kong Wen, “Shifu, your disciples have come back.”</p><br/><p>Kong Wen showed a comforting smile, his gaze falling towards the Poisonous Flood Dragon which was on Fang ChenLe’s shoulder. “As expected of my disciple. The Poisonous Flood Dragon is not a normal mid-level demon beast. Pretty good, pretty good. Shifu didn’t raise you as my disciple all these years for nothing. And ZiLin, even though you only got a contract with level six demon beast it’s better than nothing. Please continue to work hard.” He talked while looking at Fu ZiLin. This second disciple of his, although he didn’t really like his cold demeanor, he had the skill that could only be found one in a hundred. That made him proud.</p><br/><p>The level six demon beast that he talked about is the dead soul beast which was ying on top of Fu ZiLin’s shoulder. This dead soul beast is a high level ancient demon beast, and there were no records about it in the library’s scrolls; besides, it concealed itself on purpose, so even Kong Wen couldn’t recognize it.</p><br/><p>After that, Kong Wen called the other two elder disciples over. Their luck was not as good as Fang ChenLe and Fu ZiLin, each of them only able to obtain a level four and level five demon beast.</p><br/><p>Other than the demon beasts, some people got many spirit grasses in the Paradise Realm, especially Fang ChenLe. He contracted with the demon beast quite early. The Poisonous Flood Dragon was a beast that guarded many spirit grasses. Since these kind of things were done individually, no one had to seek permission.</p><br/><p>There were five people, but he only called and praised four people. Kong Wen left out You XiaoMo, either consciously or unconsciously.</p><br/><p>Fang ChenLe who didn’t seem to realize it, used all of his strength to bring out You XiaoMo, who was hiding in the crowd, to the front. He happily said, “Shifu, there’s still You XiaoMo. He is the same as ZiLin, he contracted a level six blue-blooded wolf at the Paradise Realm.”</p><br/><p>Kong Wen’s smiling face immediately shrink, he answered drily and didn’t say anything after that; as if he’d lose something if he said more. Before this, even if he didn’t really like You XiaoMo, he wouldn’t obviously show it but now he did it in front of a lot of people.</p><br/><p>Fu Zilin, who usually doesn’t really talk, softly said, “Shifu, you don’t feel happy for You-shidi?”</p><br/><p>Kong Wen took one look and immediately choked on his words,he breathed in quickly, and then gazed at his two students’ faces, said, “Of course not, as a teacher, I’m really happy for him.”</p><br/><p>Fu ZiLin nodded, “That’s good, then. I’m also happy for him.”</p><br/><p>Kong Wen stared at You XiaoMo, drily laughing. <i>Who is possessing Second-Shixiong right now? </i>This made him extremely unhappy. Kong Wen became angry at his two disciples; he didn’t say anything again, and just found an excuse to leave.</p><br/><p>After Kong Wen left, You XiaoMo immediately felt that the pressure had reduced a lot. He left after he talked with the other disciples.</p><br/><p>As soon as he arrived in his room, he went to his bed and quickly fell asleep as soon as his head touched the pillow. During the whole month in the Paradise Realm, he didn’t get decent sleep. He slept through the whole day until the next morning, and felt refreshed after he woke up.</p><br/><p>Just when he opened the door, he ran into Yang Yi, who lived next door. Yang Yi was the same as ever, still loving to gossip with his talkative mouth, if he stopped gossiping for one day he would feel uneasy, and to think that his practice was still progressing well while he gossiped.</p><br/><p>It was good to have a senior who loved to gossip, he could ask him about everything happened that he didn’t know.</p><br/><p>The news about Tang YunQi’s death in Paradise Realm had become an uproar in no less than a day. However, because she did so many evil deeds while she was still alive, many people didn’t really like her. So the people who secretly <b>took joy in the calamity and delighted in the disaster </b>(t/n: to rejoice in other people’s misfortune) were quite a lot.</p><br/><p>Tang Fan demanded that they investigate it thoroughly. But after much discussion, most people believed that the murderer was most likely from the Qing Cheng Sect. The Qing Cheng Sect and the Tian Xin Sect hated each other, besides, the only one who wasn’t afraid of the Tian Xin sect was the Qing Cheng Sect. Other factions, although they wanted to kill her to take her treasure, they still had to consider the one who was backing up Tang YunQi.</p><br/><p>So even though they said that they wanted to investigate thoroughly, in fact they had already determined that the Qing Cheng Sect was the one who had murdered Tang YunQi. According to the most reliable information, Tang Fan had already given an order to not hold back the next time they ran into any Qing Cheng Sect disciples.</p><br/><p>But You XiaoMo didn’t care about any of that information, he only cared about Ling Xiao’s matter.</p><br/><p>When Yang Yi heard him question about Ling Xiao, he wasn’t surprised, but he looked at him apologetically, “Actually, myself don’t know anything regarding Lin Xiao.This matter is in the Tian Xin Sect’s classified information, no matter how much I asked, they won’t tell me anything. But if it is you who wants to know what happened with the person who is the strongest after Lin Xiao, I can give it to you.”</p><br/><p>You XiaoMo thought about it for a minute, and then asked, “That Zhou Peng?”</p><br/><p>Yang Yi was surprised, immediately looking around to check, and when he was sure that no one was around, he whispered, “You-shidi, regarding Zhou Peng’s matter, please keep it a secret. The Grand Master already gave an order to forbid anyone from talking about this matter.”</p><br/><p>You XiaoMo was surprised, “Why is that?”</p><br/><p>Yang Yi whispered, “You still asked why? Grand Master and the others apparently have already determined that Zhou Peng was the one who worked together with the demons. I heard that the Grandmaster has already decided to expel Zhou Peng.”</p><br/><p>You XiaoMo’s eyes widened, “What do you mean by decided?”</p><br/><p>Yang Yi sighed and said, “I mean it as it is. I feel that Zhou-shixiong is really pitiful.”</p><br/><p>Although he was not familiar with ZhouPeng, but he had heard many things about Zhou Peng. He is a straightforward and tough guy, generous, and never speaks arrogantly. There was no way that this kind of person could work together with demons, furthermore, working together with the demons wouldn’t give him any benefits.</p><br/><p>Even he could guess it, how could the Grand Master not? Moreover, Zhou Peng is his disciple. Now he even dealt with his two most outstanding disciples; they really couldn’t guess what was inside the Grand Master’s head.</p><br/><p>You XiaoMo reluctantly shook his head. No matter how he thought about it, actually Tang Fan wasn’t clever enough.</p><br/><p>The demon and the human conflicts were getting more serious each day, and on top of that, they still had issues with their relationship with the Qing Cheng Sect. The war between these two sects could break out at anytime, yet he still detained his own disciples during this crucial time. Was he not afraid that other people would object him?</p><br/><p>After Yang Yi left, You XiaoMo went to the dining hall.</p><br/><p>He realized, the seniors and juniors who weren’t that close to him during peaceful times, were now acting cold towards him, some even avoiding him. How puzzling.</p><br/><p>Even though he didn’t know why, he preferred it this way.</p><br/><p>When he went back to his room, he ran into Zhao DaXhou, who was looking for him.</p><br/><p>Zhao DaZhou actually had come yesterday, but You XiaoMo was sleeping. Knowing that he must be tired, he didn’t disturb him and just went away. He just came and went away by himself, even Yang Yi didn’t know about it.</p><br/><p>Zhou DaZhou apparently had heard about how Kong Wen treated him yesterday, he looked at him up and down in a glace, and carefully asked, “Seventh-shidi, are you okay?”</p><br/><p>You XiaoMo raised his eyebrow and looked at him, “What’s wrong with me?”</p><br/><p>Zhaou DaZhou thought that it seemed that he didn’t lie, instantly sighing in relief, “If you think that there’s nothing wrong, then it’s okay. Oh right, I’ve heard about Lin Xiao, you don’t have to worry, Lin Xiao is very outstanding, and he has large potential. The Grand Master won’t make things difficult for him.”</p><br/><p><i>Why did you guys think that I’d be worried about him?</i> You XiaoMo became depressed. If they heard this tone, it would look like he was worried that Ling Xiao wouldn’t be able to sleep or eat. Even heaven knows that that guy is tough, that kind of guy doesn’t need his little mage to worry about him. But of course, he couldn’t say it out loud.</p><br/><p>When he looked at him, You XiaoMo suddenly remembered one thing, “Fifth-shixiong, please come with me, I have something for you.”</p><br/><p>Zhou DaZhou suddenly realized that they were still standing outside his room, but he was very curious about what You XiaoMo had for him, so he followed him inside.</p><br/><p>You XiaoMo turned towards him and said, “Please wait here for a while.”</p><br/><p>After he said that, he went behind the changing screen. When he was sure that Zhou DaZhou wasn’t peeking, he secretly took out the small Six Winged Divine Tiger demon beast from his space. The little Six Winged Divine Tiger opened its eyes, both of its paws holding its mother’s condensed spirit, and looked at him rather dazed.</p><br/><p>You XiaoMo immediately looked at this <b>meng</b> face that was still covered in blood. This small fellow was too cute. Although he hated to part with it, but beside this little one, You XIaoMo had no other choice to pick.</p><br/><p>Zhou DaZhou wondered what took him so long, and then he saw him coming out from the screen. Just when he was about to talk, attracting his attention was the small demon beast, “Seventh-shidi, this is…?”</p><br/><p>You XiaoMo carried the Six Winged Divine Tiger demon beast in front of him, excitedly saying, “Didn’t you ask me to help you find a demon beast the other day? I found this to give it to you. How is it? Cute isn’t it?”</p><br/><p>Zhou DaZhou gaped, too speechless and only said, *<i>Na, Na</i>*. He had long forgotten about that.</p><br/><p>At that time, although he had asked You XiaoMo to find him a demon beast he didn’t really say it seriously, and he didn’t think that he would really find one. Moreover, he never saw this type of demon beast species.</p><br/><p>After the long silence, Zhou DaZhou finally couldn’t help but ask him with trembling lips, “Seventh-shidi, is this demon beast really for me?”</p><br/><p>You XiaoMo nodded, “Really.”</p><br/><p>Zhou DaZhou, “Really, really?”</p><br/><p>You Xiaomo nodded again, and said patiently, “Really, really.”</p><br/><p>Zhou DaZhou: “Really, really, really?”</p><br/><p>You XiaoMO: “……………”</p><br/><p>————————————————————-</p><br/><p>T/N; meng = moe (in japanese)</p><br/>\n</div>"}