{"title": "Chapter 183", "id": 183, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-183", "volume_title": "Volume 2", "body": "<h1>Chapter 183</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Killing intent</b></p><br/><p>Seeing You XiaoMo, Tang YunQi naturally searches for Ling Xiao’s figure nearby.</p><br/><p>But after looking right and left, and discovering that Ling Xiao is nowhere to be found, a strange expression appears on her pretty face.</p><br/><p>Tang YunQi narrows her eyes and looks You XiaoMo up and down before saying bluntly, “Why are you the only one here? Where did Brother Xiao go?”</p><br/><p>You XiaoMo glances at the Seven-tailed Demon Fox at her side. This Seven-tailed Demon Fox already has all seven tails. Clearly it is already of level seven cultivation. He curses in his heart ‘damn it’, why is it that he has to come across this devious and unreasonable girl when he is with a single spear and a single horse? How terrible is his luck <i>ah</i>!</p><br/><p>You XiaoMo doesn’t dare to say that he doesn’t know where Ling Xiao went. Admitting it will only tell her that he is alone. His eyeballs roll one round as he says, “Elder brother Ling is nearby. He ……. asked me to wait for him here for a bit. Do you want to wait with me for Elder Brother?”</p><br/><p>The last sentence is definitely not sincere but he is afraid that Tang YunQi won’t believe him.</p><br/><p>“Brother Xiao is really nearby?”</p><br/><p>Tang YunQi who usually looks as if she has no brains at this moment actually does not show the usual excitement at wanting to see Ling Xiao. Instead, she doubts You XiaoMo’s words. Her not so shrewd eyes reveal a trace of sharpness, as if she wants to skin You XiaoMo alive.</p><br/><p>You XiaoMo gulps, “Of course.”</p><br/><p>This Tang YunQi, why does it seem that she looks a little different from usual?</p><br/><p>Tang YunQi suddenly stretches out her neck, and looks at him pointedly while enunciating every single word, “You XiaoMo, you’re lying to me. Brother Xiao is simply not nearby. You got separated from Brother Xiao right?”</p><br/><p>You XiaoMo’s eyes widen. When did this <b>flower vase</b> get so smart? Actually seeing through his lie.</p><br/><p>His reaction confirms Tang YunQi’s guess. The smug expression abruptly changes as she lets out a crazed and unrestrained laugh. The pretty face distorts slightly revealing a hideous look. The corner of her mouth curls up into a sneer, “You XiaoMo. There is also this kind of day for you. Brother Xiao is not at your side. I’d like to see how you can defend yourself!”</p><br/><p>Actually, he does have a way to protect himself. For real!</p><br/><p>However, the existence of the dimension must be kept a secret from Tang YunQi at all costs.</p><br/><p>However, looking at his current situation, Tang YunQi seems to have something planned for him, and not a single one of his Qiu team is here by his side. Even the weakest Piqiu was put in Ling Xiao’s dimension …….</p><br/><p>“You, don’t get any ideas. TianXin sect forbids their disciples from killing each other.”</p><br/><p>You XiaoMo takes a few steps back hastily.</p><br/><p>“Haha, so what?”</p><br/><p>Tang YunQi throws her head back and laughs out loud before replying flippantly, “There is only you and me here. If I kill you, who would know? Even if someone were to see it, do you think my dad would punish his daughter because of you?”</p><br/><p>Of course not!</p><br/><p>He is only a puny mage, and one that is involved with Ling Xiao at that.</p><br/><p>Now, Tang Fan has already decided to forsake the fake Lin Xiao, Ling Xiao. Naturally, he also can’t wait to see the both of them die.</p><br/><p>It’s possible that after Tang Fan finds out that Tang YunQi killed him, not only will he not get angry, he might even praise her.</p><br/><p>“Demon fox, finish him off!”</p><br/><p>Tang YunQi can’t wait for You XiaoMo’s answer. In order to avoid <b>a long night fraught with dreams</b>, she wants You XiaoMo to die right now in front of her. She has had enough of all of this. Every time she sees that Brother Xiao only has You XiaoMo in his eyes, ignoring her, she feels as if a knife is stabbing into her heart, making her want to flip out crazily every single time.</p><br/><p>This time the father in heaven is finally on her side, letting her come across You XiaoMo when he is by himself. Not only is Brother Xiao not by his side, even his bonded magic beast is nowhere in sight. Such an amazing opportunity would even make her laugh out loud in her dreams.</p><br/><p>The excitement makes Tang YunQi unable to think of anything else. Therefore, she doesn’t consider why You XiaoMo, who clearly shouldn’t appear in this place, is actually here!</p><br/><p>The Seven-tailed Demon Fox glances at Tang YunQi darkly.</p><br/><p>Although it doesn’t know what kind of grievances exist between them, a woman that even wants to kill a fellow disciple, simply does not deserve to be its bonded one.</p><br/><p>But it can’t disobey this despicable woman. Otherwise, its bond would rebound and strike it.</p><br/><p>Looking at the Seven-tailed Demon Fox advancing towards him step by step, You XiaoMo retreats with a complicated expression.</p><br/><p>You XiaoMo wavers non-stop between revealing or not revealing the existence of the dimension. If he doesn’t escape into his dimension, he will die. If he escapes into his dimension, probably ……. Tang YunQi will die, because Ling Xiao would definitely kill her to silence her.</p><br/><p>Choosing between his own death and Tang YunQi’s death, You XiaoMo thinks, unless he is a white lotus flower that is whiter than white, even an idiot would know to choose the latter.</p><br/><p>“Wait first! I have something to say.”</p><br/><p>You XiaoMo hastily stops them.</p><br/><p>The Sevel-tailed Demon Fox pauses. This human is a little strange. It turns around and glances at Tang YunQi.</p><br/><p>Although Tang YunQi can’t wait for You XiaoMo to die, she is still very happy to see You XiaoMo’s desperate struggles before death. So she grants him his wish, smiling smugly, “I’ll give you an opportunity to have your last confession. If I’m happy, I may even help you convey them to Brother Xiao.”</p><br/><p>You XiaoMo looks at her with her ‘big show of mercy’ expression and feels a little peeved. This hateful girl. Who says he wants to confess?</p><br/><p>“Junior sister Tang, I still think it’s better for you to run away. What I just said is the truth. Elder brother Ling will be here very soon. If he finds out that you want to kill me, he would really kill you.”</p><br/><p>After saying these words, You XiaoMo feels that he has really become a fast-talker. Clearly he has been hanging around Ling Xiao for too long, causing him to be infected with his deceitful nature.</p><br/><p>“Shut up!”</p><br/><p>Tang YunQi’s face darkens instantly as she glares at him, “You XiaoMo, do you know what part of you I hate the most? It’s precisely your self-righteous attitude. What makes you think that Brother Xiao would do all that he can for you? Who do you think you are? I have known Brother Xiao for almost ten years. As for you <i>ne</i>, not even a year. What makes you think that Brother Xiao is yours? Tell me, what makes you think so <i>ah</i>!!”</p><br/><p>Speaking up to here, Tang YunQi is almost screaming hysterically. Green rays are shooting out of her eyes as she glares at You XiaoMo with murderous intent.</p><br/><p>Actually, You XiaoMo also really wants to know, but after thinking here and there, he can only come up with one conclusion.</p><br/><p>It’s because he knows that Ling Xiao is not the real Lin Xiao. He knows Ling Xiao’s secret and Ling Xiao also knows his secret.</p><br/><p>But he can’t say that. He can only say that love is blind!</p><br/><p>“If that is what you want to say, then you can go and die now. Demon fox, kill him!”</p><br/><p>After yelling, Tang YunQi finally regains her balance, smugly ordering the Seven-tailed Demon Fox.</p><br/><p>The Seven-tailed Demon Fox looks fixedly at You XiaoMo. This time, it no longer hesitates. It spits out a fiery red ball of flames. The red ball of flames contain an enormous amount of destructive energy, flying swiftly towards You XiaoMo.</p><br/><p>When it seems as if the only choice left is to expose the existence of the dimension, a black shadow appears in front of You XiaoMo just as he is about to enter his dimension. Not only does the ball of flames get blocked, it is actually sent flying back.</p><br/><p>The Seven-tailed Demon Fox completely doesn’t expect that someone would block its move and almost gets hit by his own attack in a moment of inattention. Although it manages to avoid the majority of the impact, a few patches of its white fur that covers its whole body gets singed black. Luckily, he didn’t go all out before because he saw that You XiaoMo is only a puny mage. This is what’s called karma <i>ba</i>!</p><br/><p>“Sheqiu? So happy to see you.”</p><br/><p>You XiaoMo gets a clearer look at his helping hand and is overjoyed and excited. He almost forgot that before they climbed up Demon Peak, Ling Xiao left Sheqiu in Death Valley. And now that something happened to Demon Peak, Sheqiu who just happened to be at the foot of the mountain would be in the safest position.</p><br/><p>Sheqiu , “If you don’t call me Sheqiu, I too would be very happy to see you.”</p><br/><p>You XiaoMo laughs while saying, “Clearly Sheqiu is a very nice sounding name <i>ma</i>”</p><br/><p>“Who are you? Why are you meddling in our business?”</p><br/><p>At this time, Tang YunQi who was neglected by them at one side finally reacts. Her voice which used to be very sweet turns shrill and sharp. If not for her pretty face, if you just listened to her voice, you would think that it belonged to a heinous woman.</p><br/><p>Sheqiu scoffs coldly. He really hates narcissistic women, “Hateful woman, if I hear that grating voice of yours again, I will cut off your tongue.”</p><br/><p>Tang YunQi had long lost her cool. Hearing his words, she suddenly can’t conceal the fury on her face. Seeing that You XiaoMo was so close to dying in front of her before this <b>Cheng YaoJin</b> rushed out of nowhere, her heart can’t help feeling vexed and impatient. Pointing at Sheqiu and You XiaoMo, her lips quiver as she says, “Seven-tailed Demon Fox, go ……. eat up the both of them. Don’t leave an intact corpse!”</p><br/><p>Who would expect that the Seven-tailed Demon Fox, that had just listened to her obediently before, would not react at all in response to her order. Seeing that the Seven-tailed Demon Fox remains motionless for a while, Tang YunQi glowers at it, “Useless thing, did you not hear me tell you to eat them?”</p><br/><p>Hearing her call him a useless thing, the Seven-tailed Demon Fox lowers its eyes, “Master, I can’t beat him.”</p><br/><p>Tang YunQi seems to have been provoked. Her eyes open wide instantly as she vents her fury at it, as if trying to cover up her panic and confusion, “You’re worthless. Aren’t you a Seven-tailed Demon Fox? How can you not even beat a human? Get over there right now and eat them. I order you!”</p><br/><p>The enormous body of the Seven-tailed Demon Fox shudders abruptly but it still says, “Master, he is a level nine magic beast who has shapeshifted.”</p><br/><p>It, that is only a level seven, going up against a shapeshifted level nine magic beast, would only be walking towards on the road of death. Although it signed an ordinary bond with Tang YunQi, it still values this life very much. Otherwise it would have killed off this bonded master long ago.</p><br/><p>As if her throat is completely blocked up, Tang YunQi no longer says a word, looking at Sheqiu with a face full of terror.</p><br/><p>This person is actually a shapeshifted level nine magic beast?</p><br/><p>How can this be? Isn’t You XiaoMo’s bonded magic beast a Blue-blooded wolf?</p><br/><p>How did it turn into a level nine magic beast?</p><br/><p><b>Notes:</b></p><br/><p>flower vase – just a pretty face</p><br/><p>black line = -_-|| or …</p><br/><p>Cheng YaoJin (Tang dynasty general) – busybody</p><br/><p>________________________________________<wbr>_________</wbr></p><br/><p>I don’t speak Chinese. Corrections welcomed.</p><br/>\n</div>"}