{"title": "Chapter 198", "id": 198, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-198", "volume_title": "Volume 2", "body": "<h1>Chapter 198</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2>Chapter 198</h2><h2>Tang Fan is an Idiot</h2><br/><p>Tang Fan’s face turned purple with rage. He has been Tian Xin Sect’s grandmaster gloriously for hundreds of years, no one has ever been disrespectful or impolite to him before, let alone publicly disgracing him in front of so many people.</p><br/><p>Even though he could tolerate it, his expression said otherwise.</p><br/><p>Tang Fan took a deep breath and tried his best to calm down the anger raging inside his heart. As his eyes rose with a killing intent it was like a sharp arrow pierced through You XiaoMo and SheQiu. Being disgraced by his own disciple in front of a crowd, if he didn’t give them a lesson today, even if he won today’s war, he would still be the laughing stock of this continent.</p><br/><p>“Who do you think you are to come here and cause a fuss, You XiaoMo. You bear a grudge against me for expelling you. You even allowed your friend to speak such gibberish. If today I let you two go, this grandmaster title of mine will be nothing but trash!”</p><br/><p>Tang Fan stared at them, he no longer cared about how a grandmaster should behave anymore. Even if it resulted in him being criticized for bullying the weak, he still wanted to kill both You XiaoMo and the man next to him.</p><br/><p>“Oh ho, that old fart is so ashamed that he got angry.” SheQiu laughed without any fear.</p><br/><p>Tang Fan eyes instantly flashed with killing intent, he turned over his hand and blasted out a palm force toward You XiaoMo.</p><br/><p>The power of this technique took half of his spiritual power, the huge palm was surrounded by a raging flame, carrying the pressure of an Imperial warrior as it blasted down from the sky.</p><br/><p>In the eyes of many people, You XiaoMo and that man wouldn’t be able to survive.</p><br/><p>If they dared to challenge an Imperial warrior, they must dare to accept the rage of an imperial warrior. The existence of an imperial warrior is rare like a “phoenix feather and unicorn horn,” half of their strength could easily kill a peak seven star Spiritual level, let alone a small mage like him.</p><br/><p>But surprises always come unexpectedly.</p><br/><p>When all the people thought that the two would die under Tang Fan’s palm force, the man who was just mocking Tang Fan earlier suddenly stood in front of You XiaoMo as he quickly punched out a fist.</p><br/><p>A weird green aura was suddenly emitted. A *puchi* sound and the shot went straight to Tang Fan’s palm force. In a blink, it heavily hit the force and all of the sudden, a big explosion came out from the collision of the two energies, the aftermath caused the atmosphere to ripple.</p><br/><p>Above the sky, Tang Fan’s expression suddenly changed and he immediately took a step back.</p><br/><p>At the same time, that strange green aura turned into green arrows as it came out from the explosion, targeting Tang Fan with super speed, in just a blink of an eye.</p><br/><p>Tang Fan crazily pushed the spiritual power to flow inside his body. Fortunately he had prepared beforehand, he quickly formed a thick shield made from condensed spiritual power in front of him. However, when that green aura with a <i>*puchi*</i>sound struck his shield, it made many small holes on it.</p><br/><p>In the square, people went completely silent.</p><br/><p>Although no one knew what happened, those with sharp eyes saw it clearly.</p><br/><p>Tang Fan used half of his energy and yet that man could easily dispel it, and even make a hole in his spirit shield.</p><br/><p>Everyone was horrified looking at the holes in Tang Fan’s shield, which was the shield made by an Imperial level martial artist.</p><br/><p>A few seconds later, the sound of gasping continued one after another. To break that kind of defense, unless he were also on the same level, this unusual looking man, was he also a genuine Imperial warrior? Some people couldn’t hold back and let out foul language.</p><br/><p>“Fuck, that guy is too buff!”</p><br/><p>“Since when did Imperial warriors start spawning everywhere? <i>Ah,</i> to think another imperial warrior appeared again, it seems like they have become bok choy.”</p><br/><p>“I bet, Tang Fan is definitely crying inside.”</p><br/><p>“Me too, I bet Tang Fan is bleeding inside his heart right now, he just kicked out a disciple that has an imperial level friend, such an idiot <i>ah!”</i></p><br/><p>People started to discuss one after the other, even Luo ChengYuan was also in shock as he looked over at that guy, his eyes were filled with surprise.</p><br/><p>As for Tang Fan, he was terrified from the inside out. You XiaoMo has an Imperial level man to protect him? No wonder the aura surrounding him was a bit strange. He didn’t expect that man would turn out to be an Imperial warrior, and not mention his strength is no less than his?</p><br/><p>“I don’t know who you are, but this is a matter between me and that Tian Xin Sect’s disciple. I have to ask you, sir, not to intervene. Even if you are an Imperial level martial artist, fighting against two other Imperial at once might still be too much for you.”</p><br/><p>Tang Fan, although he was endlessly astonished, he was, after all, still the head of a sect, he had to quickly calm down. At the present, the Tian Xin Sect was still at the biggest advantage, if he angered this man, causing him to switch sides to the Qing Cheng sect, then the scale would tilt and the gains would not make up for the losses.</p><br/><p>Only, Luo ChengYuan didn’t wait for that man to answer and he burst out laughing, a very apparent satirical laugh.</p><br/><p>“Tang Fan, your skin is really thick, this little friend here just got kicked out of your door, and now you said he is a Tian Xin’s disciple? Must be a talent to say those words with your eyes wide open.” As he ended the sentence, Luo ChengYuan immediately turned around and said to SheQiu, “My friend, this lower man, Luo ChengYuan, as the head of the Qing Cheng Sect, if you are in a dire situation, I’m very happy to help out.”</p><br/><p>Tang Fan’s face suddenly got colder, and he gloomily looked at Luo ChengYuan.</p><br/><p>SheQiu slowly smiled, these two sly fox’s intentions, how could he not know them. “Ha, you two can say such nice words. Too bad you ask the wrong person.”</p><br/><p>Ask the wrong person? Including Tang Fan and Luo ChengYuan and the people in the square, everyone started asking themselves this question.</p><br/><p>SheQiu pushed You XiaoMo, who didn’t want to see anyone, forward. SheQiu evilly laughed, “He is my master, so naturally he has the final say.”</p><br/><p>Everybody immediately rolled their eyes as their stared at the uneasy You XiaoMo. This little mage is the master of an imperial warrior? Since when were Imperial level martial artists so cheap to be this little mage’s bodyguard?!</p><br/><p>Right away, a voice of anger suddenly shouted out.</p><br/><p>“It’s really you, <b>Nine winged unity serpent</b>!”</p><br/><p>Everybody felt a buzz inside their ear, Nine winged unity serpent? Isn’t that a high level demon beast? Following the direction of the voice, everybody recognized this sentence was said by the Six thunderbird.</p><br/><p>At this moment, the six thunderbird was already in his human form, his angry face stared at the man behind You XiaoMo. If he hadn’t had such a bad injury in the first place, his freedom wouldn’t have been grabbed by chance by this practitioner.</p><br/><p>Chaos! Too chaotic!</p><br/><p>So that man is not a practitioner, he is a level nine beast!</p><br/><p>SheQiu has soon guessed that bird would recognized him, and he didn’t deny it, he even generously admitted, “Didn’t expect you to still be alive.”</p><br/><p>Six thunderbird grinded his teeth, “Since you haven’t died yet, then how can I die soon?”</p><br/><p>No one noticed that Luo ShuHe’s face became excited, he has been suspecting that the nine winged unity serpent probably was contracted to at least a level 5 mage. He never thought that it would be this little mage.</p><br/><p>If you put it that way, then that Emperor Blood herb definitely was also taken by him, and not only just that, he probably also has something to do with the missing Elder Li too. Well, but then, he didn’t have any evidence to prove it was his doing.</p><br/><p>You XiaoMo listened to their conversation and he began to feel a headache coming on. “SheQiu, don’t quarrel with him.”</p><br/><p>He only came here for the fun, until today he had never thought that, one day, he would be in the spotlight like this, he couldn’t digest this fact at all.</p><br/><p>SheQiu also didn’t intend to make a fuss any longer, he promptly took a step back.</p><br/><p>This action answered everyone’s question. This man truly was this little boy’s contract beast, seeing how obedient he is toward him.</p><br/><p>As for Tang Fan, his expression is like it had gone deep into a different world. There is a big difference between having an Imperial warrior friend and a level 9 contract beast. Your friend can ditch you, but a contract beast cannot, as both lives between the beast and its master were linked, it is absolutely impossible for a beast to leave its master.</p><br/><p>“My little friend You, with my position as the Great Eder, I have decided to annul your expulsion from grandmaster Tang, you are still a Tian Xin disciple.” The great elder took this moment to suddenly open his mouth, his sudden words were like dropping a stone onto a calm lake, causing a ripple among it.</p><br/><p>This made people break out in shock, even though Yuan Mo rarely appeared in these past hundred years, his prestige is much higher than Tang Fan. No one would dare to disobey his word, even Tang Fan had to give him face. Today, in front of all the people, he publicly degraded Tang Fan, although it may lead to Tang Fan harboring resentment, it was worth it if he was able to grab a level 9 beast to their side.</p><br/><p>Before the sentence was even finished, Tang Fan’s expression turned gloomy like water.</p><br/><p>While people were waiting for You XiaoMo’s answer, he shook his head, “I’m sorry Great Elder, I don’t want to return to the Tian Xin’s Sect.”</p><br/><p>“Why?” Yuan Mo asked, “If it was because of Lin Xiao’s lock up, then I shall free him.”</p><br/><p>You XiaoMo was surprised by that acknowledgment.</p><br/><p>Tang Fan’s face became more and more twisted.</p><br/><p>————————————————————————————————————————-</p><br/><p><b>Nine winged unity serpent () : </b>previously translated as Nine winged Magic horn serpent. The previous translation is not wrong, because <b> </b>really translate as Magic Rhino horn. But this term is a metaphor for “reputed to confer telepathic powers; fig. mutual sensitivity; tacit exchange of romantic feelings; a meeting of minds; tacid understanding or comprehension”, or explain in a simple way, the unity/understanding between one mind to another.</p><br/><p>=&gt; no, SheQiu doesn’t have a horn, It means that his species is an intelligent type that you feel like he can read your mind or like your mind is in unity with his mind.</p><br/>\n</div>"}