{"title": "Chapter 194", "id": 194, "volume": 2, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-194", "volume_title": "Volume 2", "body": "<h1>Chapter 194</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2>You XiaoMo’s Soft Spot</h2><br/><p>Motherfucker, finally he spilled the beans!</p><br/><p>You XiaoMo had soon figured out that Kong Wen had another purpose for calling him here, after a long wait, finally the cat was out of the bag.</p><br/><p>Although, You XiaoMo was caught by surprise as Kong Wen’s words seemed to imply he is after something he owned. Has Kong Wen found out about his secret space?</p><br/><p>Impossible <i>ah,</i> he has been extra careful up to now, beside Ling Xiao had also said before that he already set up a barrier around his room. If Kong Wen secretly monitored him, Ling Xiao should have found out.</p><br/><p>You XiaoMo couldn’t determine whether Kong Wen had learned about his space or not, he had no other option but to say, “What do you mean?”</p><br/><p>Kong Wen squinted his eyes, “You don’t have to pretend, I already knew, with your qualifications, if it not for that item, it would be absolutely impossible for you to gain three levels in just a year. I am now giving you a choice, do you want to take it out yourself or do you want me to do it for you?”</p><br/><p>You XiaoMo’s heart suddenly beat really fast, Kong Wen really is a sly fox. He had long suspected him but still pretended as if nothing had happened. It seems that he really has found out about the existence of the space and wants to claim it for himself, that’s why he stayed quiet about his discovery until now.</p><br/><p>At this moment, interrupting his thoughts was SheQiu’s anxious voice.</p><br/><p>SheQiu said, “Master, you must not believe him, he is deceiving you, he doesn’t know about the space existence as all, he is literally setting you up with words, don’t fall into his trap.”</p><br/><p>You XiaoMo finally reacted in time, he lifted his head as he saw Kong Wen’s eyes sharply stare at him, as if he was trying to find some clue from his expression. You XiaoMo was surprised a little, but then quickly calmed down.</p><br/><p>You XiaoMo said, “I also cannot fathom what you’re saying.”</p><br/><p>Kong Wen laughed, his smile hidden with a creepy chill, solemnly saying, “I have given you a chance, since you didn’t cherish it, then don’t blame me for being ruthless. You are about to die anyway, even if you disappear no one would investigate it, maybe Tang Fan would even send his gratitude to me as I help him finish you.”</p><br/><p>Even though You XiaoMo denied it, but from his reaction, Kong Wen finally got the answer he wanted.</p><br/><p><i>This You XiaoMo, as expected he is hiding a secret, a quick level up method.</i> If he could have it, those geezers of Heaven peak would have to be humble before him.</p><br/><p>Think of this, Kong Wen didn’t give You XiaoMo any chance to dispute, he had already decided You XiaoMo is holding a sacred treasure, which is enough. Afterward, he raised his hand toward You XiaoMo, grimly smiling. “Behave and take out that item, then I will see you as my used-to-be disciple, and spare you from the hurtful death.”</p><br/><p>You XiaoMo wanted to take a step back, but then he found out his body couldn’t move, he couldn’t help but panic. Kong Wen really did have some underhanded tricks, no wonder he decided on this day to finish him off.</p><br/><p>Just right about when Kong Wen nearly caught him, a green shadow climbed out from You XiaoMo clothes. This shocked Kong Wen and he wanted to take his hand back but It was too late. On the back of his hand there now appeared two small bloody holes, as his red blood spilled out, it slowly had become a greenish color.</p><br/><p>Kong Wen screamed, he drew back a step and hit the desk beside him, which made all the pen brushes on the table fall off and scattered on the floor. He panicked and looked at the green shadow on You XiaoMo’s shoulder. He found out that that green shadow is a green snake in mini size curling up on You XiaoMo’s shoulder, it’s bright red tongue flicks toward him.</p><br/><p>Kong Wen raises his hand to take a look. He’s frightened to find out that the venom has extended to the whole arm, if not for his quick action of protecting his inner core circulation system, he was afraid that this venom would have spread further.</p><br/><p>“What kind of snake is this?” Kong Wen’s pupil’s constricted and he glanced toward the thing on You XiaoMo’s body, “You didn’t contract with just one demon beast right? This is also your contract beast?”</p><br/><p>If this was the level six Blue blood Wolf, Kong Wen himself could deal with it, he is a level eight mage, his soul is capable of attack and defense, that is why he has confidence in dealing with You XiaoMo. Unexpectedly, You XiaoMo didn’t contract with just one beast, since this snake could easily breakthrough his defense, this one is absolutely above level eight!</p><br/><p>Thinking about this, Kong Wen knew things had gone out of his control, at the moment he shouted those words, he immediately rushed to the window. Before they had time to react, he had to run to where there were lots of people.</p><br/><p>But his intention is destined to fail, the windows that were previously opened suddenly slammed down, a black shadow appeared in front of it, blocking his escape path.</p><br/><p>Kong Wen was startled. He hurriedly rotated his footsteps to another direction to escape, but as he turned around, the way was already blocked by another bewitching face person, MaoQiu.</p><br/><p>All of the escape routes had been cut off.</p><br/><p>Kong Wen’s heart sank, his facade couldn’t conceal his terrified expression.</p><br/><p>Being a level eight mage, naturally he had recognized their true identity as demon beasts, but what scared him was that most of these beasts here hadn’t reached level nine. Yet they are all in human form, which indicated one thing, You XiaoMo must have the shape shifting herb. Not herb, but herbs.</p><br/><p>Kong Wen quickly shifted his intention, this was not the time to seize the treasure, protecting himself is the first priority.</p><br/><p>The whole process only occurred in a brief moment, Kong Wen with his escape route being blocked, blatantly shouted, “You XiaoMo, what do you want to do, you want to <i>‘disgrace your teacher and annihilate your ancestor</i>?’” (<b>t/n: do disrespect things toward the person who raised you.)</b></p><br/><p>Because Kong Wen deliberately shouted loudly, acting as if he did it unintentionally. Even Zhu An, who was standing outside would definitely hear it, even the nearby people most likely could. If he had expected the appearance of the demon beasts, how could he have not taken the time to prepare? That why, the moment You XiaoMo came to the courtyard, they had already cooperated.</p><br/><p>MaoQiu with a bewitching face as she gave away a sneering smile, “You don’t have to shout, this room has been covered by my psychic spell, outsiders won’t be able to hear anything.”</p><br/><p>A demon fox is best known for its confusing trickery, and psychic spells were one of their specialties.</p><br/><p>Although he had expected this outcome, but when he heard the answer, Kong Wen can’t help but feeling disheartened, the hunter now had become the hunted.</p><br/><p>Who would have thought that this used-to-be weak little mage now have become so powerful. In just a short year, not only had he become a level three mage, but he had also contracted with four powerful demon beasts. Really this was a ‘<i>didn’t see for three days and have to change the treatment’ </i><b>( t/n: have to see in a different light as nothing stay the same)</b>situation. With this kind of fighting strength, he could easily take over the south!</p><br/><p>Kong Wen regretted this, but the dignity of a level eight mage didn’t allow him to bow down to his disciple. When he thought of his two favorite disciples, his fear suddenly decrease little by little.</p><br/><p>“You XiaoMo, if you let me go free today, I will treat it as if nothing has happened. Of course, you can also choose to kill me, but in the future when your two seniors learn about this matter, you think you can continue your relationship with them? Your brotherhood shall never be reparable again!” Kong Wen coldly *heng* a sound.</p><br/><p>When he finished his sentence, Kong Wen face had already calmed down by a lot. He believed You XiaoMo relationship with his two disciples is his last card from being killed.</p><br/><p>He have no choice but to admit, Kong Wen’s words indeed had caught You XiaoMo in his soft spot.</p><br/><p>Until now the reason You XiaoMo hadn’t spoken a word was because of this thought. Kong Wen can kill him without hesitation, but he can’t.</p><br/><p>It not that he was afraid of accepting the ‘shifu murder’ sin, it was because he didn’t want to put those who were nice to him in a tough spot. In this life, he might not have many friends, but his Da shixiong, second and fifth shixiong had always been sincere to him.</p><br/><p>Seeing him not uttering a word, Kong Wen knew he had hit the right spot.</p><br/><p>You XiaoMo really cared about his brotherhood with his seniors, this way, although Kong Wen might be at a disadvantage, but in the emotional aspect, he still has the initiative.</p><br/><p>Kong Wen couldn’t help but put on a contented smile. “You XiaoMo, take away your demon beasts, I will ignore what happened today, and you shall still be my good disciple.”</p><br/><p>XiaoHei, MaoQiu and PiQiu immediately rolled their eyes at him, this old coot really is a “give him an inch and he will take a yard” type. This egotistical man, he thought that their master would be dumb enough to believe in his words?</p><br/><p>Unfortunately fo Kong Wen, You XiaoMo is not dumb. However he was still having a hard time, to kill or not to kill is the hardest choice he had ever encountered since he came to this world.</p><br/><p>The atmosphere went silent for a while, SheQiu who had been staying on his shoulder, now suddenly said, “Master, let me say a word, I think you treat your three seniors way too nice. Even though they also take care of you, but on the scale speaking, they haven’t had a chance to treat you better and yet you already gave them your best. Just think, is there any shidi with this greatness, out of worry for their safety you even found three high level beasts for each of them. Although I haven’t seen many different people, I can assure you, you are definitely the foolish one.”</p><br/><p>“You have given them too many blessings, even gone way passed the borderline of brotherhood. If later they sever their relationship with you as they blame you for killing their shifu, then I think they are not worthy of your goodwill. The shifu has abandon the teacher-student bond to kill and steal, and you as the disciple have to just stand still and let your shifu kill you? Moreover this shifu never gave you any affection. He even accepted you as disciple only for a personal purpose. That is why, if they cannot sympathize with your situation, you should just let the relationship die. Don’t feel regret about it, and I believe, if boss Ling Xiao is here, he would also say the same thing.”</p><br/><p>After listening to SheQiu’s analysis, You XiaoMo hesitation had disappeared and now he became engrossed in something else. He looked at Kong Wen with the eyes full of thought, as if he is judging what SheQiu said about Kong Wen, and whether it is right or wrong.</p><br/><p>Kong Wen, standing on the opposite side, saw this face. His heart suddenly sunk low, his facial expression becoming extremely unsightly. You XiaoMo’s resolve had been shaken by just a few sentences?</p><br/><p>If You XiaoMo really listened to the snake on his shoulders, then Kong Wen was in a very dangerous situation.</p><br/><p>——————————————————————————————————————–</p><br/><p><b>t/n:</b> the Qiu teams always use <b>“Da ren”</b> to call Ling Xiao. <b>“Da ren”</b> is a honorific given to those superior than you, or the person you respect, with the meaning literally translated as “Big man”.</p><br/><p>So rather keeping the same Chinese term, we changed it into boss.</p><br/><p><i>Note from Ra: …….*whisper* Momo was the first to call Ling Xiao “boss”, not us, and he even used it twice in English. While boss would always , erm,….. He flirtily called You XiaoMo as Xiao MoMo, or sometimes Mo Mo, so we shortened it to Momo. (This can also mean peach in Japanese and a peach emoji looks like butt and boss likes Momo’s butt. And I have lost my point again). </i></p><br/><p><i>Viva la baka couple boss x momo forever!</i></p><br/>\n</div>"}