{"title": "Chapter 215", "id": 215, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-215", "volume_title": "Volume 3", "body": "<h1>Chapter 215</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2>Chapter 215 : Deadly Face</h2><br/><p>Translated by Rara</p><hr/><br/><p>As he stepped inside the Emerald Court, You XiaoMo looked around to check everything out. The decoration inside the store was even more of an exquisite luxury than the outside, and it was very spacious also. It had only one floor, so the inside was divided into smaller blocks, each block displayed many beautiful fine jewelries. Since they wanted to buy a mask, they went over to the third block on the right.</p><br/><p>Various types of exquisite masks were hanging on the shelves, under the light, they were magnificently lit up and very dream-like. The two hadn’t yet stepped inside and they already saw how glorious they were.</p><br/><p>Seeing two people walk by, the sales lady in purple clothes came over to welcome them. But as her eyes saw Ling Xiao, she immediately became stunned, and then her cheeks suddenly flushed with pink, even the basic etiquette was forgotten.</p><br/><p>You XiaoMo twitched. He became more determined to make Ling Xiao wear a mask, or else under this situation, he would wind up with more love rivals in the future. He totally disliked the idea of spending every day driving away rivals.</p><br/><p>You XiaoMo ignored that silly girl as he picked up a mask off the shelf.</p><br/><p>This was a purple mask that was made from some unknown materials, very flashy, probably would attract more attention if worn. This one only covered the eyes, it couldn’t meet his requirements.</p><br/><p>When You XiaoMo put down that mask, that purple clothes lady finally gained back her soul.</p><br/><p>With an embarrassed look on her face, the lady carefully asked, “Guest, what type of mask would you like to buy?”</p><br/><p>You XiaoMo glanced at her, he pointed at the snow white mask on the top shelf, “Take that one down and let me have a look.”</p><br/><p>The lady followed the direction of his finger, and seeing him randomly picked the most expensive mask of all, she was surprised for a moment. Then she immediately was filled with joy before quickly taking down that mask.</p><br/><p>As You XiaoMo received the mask, he was also surprised. That mask was actually very thin like a cicada’s wing, and the texture was very soft, smooth and soothing but it didn’t feel ice-cold. It was a very delicate but well made mask. The most important thing was that this one also covered half the face, only showing the lips and chin.</p><br/><p>“What do you think about this one?” The more he looked, the more he loved it. He quickly showed it to Ling Xiao.</p><br/><p>Ling Xiao checked out the mask, he felt the texture of the mask, and directly wore it on his face. The quality was certainly not bad. He felt like he was wearing nothing at all.</p><br/><p>You XiaoMo widely opened his eyes as he stared at Ling Xiao, he couldn’t help but feel utterly defeated.</p><br/><p>Ling Xiao obviously wore a mask and yet he was still too attractive. Even though half of that handsome face was covered by the mask, because he himself preferred white clothing, it corresponds with that white mask, making it as if he was covered in a layer of sparkling white, even more dazzling than usual, like he was a god descended to this mundane world!</p><br/><p>Fuck, his eyes burned!</p><br/><p>You XiaoMo got an urge to blind his eyes, as he was afraid he couldn’t hold back his nosebleed.</p><br/><p>His reaction was still in check, but that lady in purple was immediately dumbfounded like a statue.</p><br/><p>“How is it?” Ling Xiao grinned and looked at You XiaoMo.</p><br/><p>You XiaoMo avoided his eyes, coughing, “Looks pretty.”</p><br/><p>Ling Xiao smiled, “Then buy this one, I also like it.”</p><br/><p>You XiaoMo internally screamed, huneh, please don’t smile!</p><br/><p>After he finished screaming inside, beside his ear came a *Bam* sound, like something heavy dropped to the floor, You XiaoMo turned over and what he saw somehow had comforted him in a way. Looks like he had more resistance against Ling Xiao attraction around several times more than ordinary people. Look, that purple clothes lady they ignored before had now fainted on the ground with her nose bleeding a flood nonstop, someone’s face is surely a deadly weapon!</p><br/><p>Fortunately You XiaoMo never passed out like that, or else he would die in shame.</p><br/><p>After that, Emerald Court men quickly carried the lady away, and then sent out another staff person, this time it was a serious looking man. He seemed like he was one of the upper management, because people beside him were very respectful toward him.</p><br/><p>Seeing the mask on Ling Xiao’s face, the man lowered his voice saying, “This mask was made from a hundred year old Ice silk, that is why the price is quite high. It costs 5000 crystal coins.”</p><br/><p>“Crystal coin?” You XiaoMo dazed, how could he have not heard about this currency before?</p><br/><p>Ling Xiao suddenly remembered he forgot to tell You XiaoMo about this, he lowered his head to You XiaoMo’s ear and whispered, “Crystal coins is a currency worth more than gold coins, 1000 gold equals one crystal. Yan City is the most prosperous area in the Long Tian Continent, so the basic currency unit here is crystal coins.”</p><br/><p>After hearing those words, You XiaoMo suddenly felt his heart pumping hard, 1000 gold coins only equals one crystal coin, then wasn’t 5000 crystal coins equal to five million gold coins?</p><br/><p>Seeing his pocket deflating by half, You XiaoMo could feel his skin tingling in pain, but that mask was so suitable to Ling Xiao. He bit his lips, big deal! He will find a chance to find more money.</p><br/><p>In the end, he bought the mask.</p><br/><p>Good lord, at first he thought about wandering around to see if there was anything nice, but looking at this situation it seemed like he would have to throw away this idea.</p><br/><p>Such an expensive thing, with the rest of his money, he was afraid he wouldn’t be able to buy any other good items.</p><br/><p>Fortunately, in order to prepare for any unexpected circumstances, You XiaoMo had specifically refined some level 4 pills beforehand, but he didn’t expect it would come in handy this fast. And in addition, if selling magic pills couldn’t bring in enough money, he may need to take some risk and sell some magic herbs.</p><br/><p>After paying the money, You XiaoMo felt he couldn’t stay here any longer, he quickly turned around and couldn’t wait to leave. He didn’t think that when he had just taken two steps that he would be dragged back by Ling Xiao. Unable to believe this, he asked, “What?”</p><br/><p>Ling Xiao pointed at the clothing shop next to it, this was also one of the establishments of Emerald Court. Since Emerald Court was a large mall-like building, there were lots of shops inside of it. All the basic daily necessities can be found here.</p><br/><p>Ling Xiao didn’t want to buy clothes for himself, he knew that You XiaoMo only wore three to four sets back and forth, not to mention the quality was lacking.</p><br/><p>You XiaoMo thought that Ling Xiao wanted to buy some for himself, he didn’t wait for any words to come out, immediately refusing. “We can’t, <i>ah</i>, those clothes might be too expensive. We need to save the rest of the gold in case of emergencies.” They had yet to find any information about the academy at this point.</p><br/><p>Ling Xiao, of course, only needed a glimpse to know what he was thinking and he couldn’t help but laugh. “What are you thinking? An expensive mask doesn’t mean clothes will also be expensive. I have looked, those clothes aren’t made from any special materials, so the price won’t be any higher than this mask. You will still have at least a million left to use.”</p><br/><p>“Is it true?” You XiaoMo asked.</p><br/><p>“Yeah.” Ling Xiao again guaranteed, “Ice silkworm is a lv 7 demon beast, it is normal for a hundred year old Ice silk to be expensive.”</p><br/><p>You XiaoMo decided to temporary believe him, and followed him inside the shop. He asked for the price, and it seemed like they were not too expensive. A clothing set cost about five crystal coins, and the quality was not bad.</p><br/><p>“Fine, you should hurry up and pick two.” Ten crystal coins was still affordable.</p><br/><p>Ling Xiao could guess You XiaoMo had misunderstood, he didn’t bother to explain, simply pulling him over before picking up a set of clothes that would more or less fit You XiaoMo’s size. “This doesn’t seem bad, want to try it on?”</p><br/><p>You XiaoMo finally realized he wanted to buy for him, and he silently cursed his dumbness. How could Ling Xiao replace his water and fireproof clothes, even knives couldn’t penetrate, for some ordinary clothes with no defense. If those clothes were burned in fire and he would have to change clothes everyday then the one who would suffer would be his pocket.</p><br/><p>Ling Xiao, on the contrary, wanted to give You XiaoMo invulnerable clothing, but his clothes were too big for You XiaoMo. Such place didn’t have anyone that could tailor his clothing that was made from the silk of a Nine Hell beast to fit You XiaoMo.</p><br/><p>In fact, You XiaoMo still thought that five crystal coins was expensive enough, and he himself already had clothes to wear, and so he immediately pushed it away. “I don’t need it, I still have some clothes.”</p><br/><p>Of course, how could Ling Xiao let You XiaoMo refuse? He directly picked out a good set and gave it to him. “Your clothes are too shabby. Are you sure that when we walk side by side others won’t see you as my servant? Stop whining. Go and try some on.”</p><br/><p>You XiaoMo was sullen. Fine, those words certainly had convinced him. This was also one of the thorns inside his heart. <i>Ah</i>, no way he wanted to be treated as a servant, he had no choice but to obediently take the clothes into the dressing room.</p><br/><p>Ling Xiao picked out a set of white clothes with blue patterns on the rim. A refined and delicate looking one. When You XiaoMo wore it, his whole body radiated with a clean and bright aura, compare to those hemp fabrics he usually wore. Right now there was no doubt he was more dazzling. Not like You XiaoMo’s looks were inferior but he just didn’t know how to dress.</p><br/><p>Seeing You XiaoMo come out of the dressing room, Ling Xiao eyes suddenly lit up.</p><br/><p>After changing into new clothes, You XiaoMo’s aura seemed to slightly change. Who would have thought, that the ordinary looking You XiaoMo from before was this boy.</p><br/><p>Ling Xiao gave himself praise for having such good eyes, but those eyes looked at You XiaoMo revealing a little bit of a lustful look.</p><br/><p>Although the original idea was to let You XiaoMo wear better quality clothes, Ling Xiao really insisted on choosing the color. If they both wore the same color white, people would stop seeing You XiaoMo as his servant, and maybe people would think they were a couple.</p><br/><p>You XiaoMo didn’t know Ling Xiao’s thoughts, this was the first time he wore such quality clothes, and it really gave him a nice sensation. It was a very soft texture and even the size was right. In the end, they bought four sets before leaving the Emerald court.</p><br/>\n</div>"}