{"title": "Chapter 225", "id": 225, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-225", "volume_title": "Volume 3", "body": "<h1>Chapter 225</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Compared to yesterday’s grand occasion, it’s obvious that the number of people at the square today is much less than yesterday.</p><br/><p>Because only You XiaoMo would be participating in the assessment, Ling Xiao and Liu Yue both accompanied him there.</p><br/><p>Even though they went through the backdoor yesterday, they’re still not on very familiar terms with Gao Yang so You XiaoMo didn’t plan to find Gao Yang to go through the backdoor again today. However, he doesn’t know he’s already famous.</p><br/><p>Just as he arrives at the mage assessment area, someone walks over.</p><br/><p>You XiaoMo fixes his eyes upon the other and discovers that it’s Gao Yang. Judging from his looks it seems like he’s been waiting for quite a while, one can’t help but feel surprised.</p><br/><p>Gao Yang is very happy to see him, he doesn’t discover there’s now an extra male wearing a mask by his side until he walks over. The male’s clothes are luxurious, he doesn’t seem like a normal person but Gao Yang has another objective today so he didn’t pay much attention and shifts his gaze to You XiaoMo and happily says, “Fellow You, elder brother has already waited for you for quite a while, Ning Jing DaoShi wants me to bring you over to see her.”</p><br/><p>You XiaoMo raises his eyebrows, “Wants me to go over?”</p><br/><p>Gao Yang explains, “Aren’t you here to participate in the assessment today? It just so happens that Ning Jing DaoShi also needs to assess a group of people, she wants me to take you over there quickly. This is clearly better than you having to line up in the queue for a long time.”</p><br/><p>You XiaoMo looks towards Ling Xiao and the other nods his head at him, “Then I’ll have to inconvenience Gao DaGe to show us the way.”</p><br/><p>Seeing that he went to seek the masked man’s opinion, Gao Yang stares at him blankly before quickly snapping out of it.</p><br/><p>Going through the backdoor the second time, You XiaoMo no longer feels superior, he can pretty much guess who the group of people Gao Yang referred to are. He was already in the limelight yesterday, he’s dead set on not standing under the limelight again today.</p><br/><p>Three people follow Gao Yang and arrive at the destination after walking for ten minutes. This time it’s no longer at the guild hall he went to yesterday, instead it’s a building that’s located behind the guild hall that looks very grand. The outer appearance of the building is particularly appealing.</p><br/><p>You XiaoMo discovers that it’s pretty similar to the mage hall he previously took an assessment in, they all look like a cauldron, it’s just that this cauldron is a dark red. The plaque above his head has four vigorous and forceful words on it — Mage Association! (E/N: Original Chinese characters are four.)</p><br/><p>The Mage Association is the biggest and only association in Yan City, it doesn’t belong to any powerhouse and was established a few years ago by a few high level mages of Yan City in collaboration. The association aims to solicit all mages from all over the land, as long as the mage meets the association’s conditions they will be accepted. It’s difference compared to DaoXin Academy in that it doesn’t have an age restriction.</p><br/><p>This year, DaoXin Academy’s student recruitment assessment is still held at the Mage Association, but it’s only limited to the children of the City Yan’s four big families and those from a few powerhouse’s, there are also a few other mages who don’t have a wealthy background or patron but have huge potential and talent.</p><br/><p>When Gao Yang took them inside, there was already a group of people gathered at the association’s assessment hall.</p><br/><p>They didn’t really arrive late, yet there had already been a dense crowd here hours ago. Luckily, the assessment hall is very grand and spacious so it’s not too congested.</p><br/><p>Everyone who was able to come here to be assessed are all privileged upper echelons, thus they attract attention from others as soon as they arrive. Multiple judging gazes shoot towards them and land on You XiaoMo’s group of three, their strong curiosity can’t be covered up, some people even start to chat softly.</p><br/><p>“How come Gao Yan-gexia brought three people here, which one is You XiaoMo?”</p><br/><p>“Idiot, of course it’s the youth that looks the smallest and weakest.”</p><br/><p>“Eighteen year old young genius You XiaoMo, so he really did come here, there’s much to look forward to!”</p><br/><p>“What is there to look forward to, do you think there won’t be a lot of other geniuses from Yan City’s four big families? It’s not like a level four mage who’s younger than him doesn’t exist, thinking back to those days, Teng ZiYe-gexia became a level four mage when he was only sixteen years old, now he’s only twenty one and is already a mid level five mage.”</p><br/><p>“Teng Ye- gexia was an existence that couldn’t be surpassed back in those days.”</p><br/><p>Hearing whispering sounds around him, some which are in admiration, some in envy and others in jealousy… a hint of surprise flashes in You XiaoMo’s eyes, he had thought that the assessment would be the same as yesterday with only between ten to twenty people participating. He didn’t imagine there’d actually be so many people and judging from their looks, they don’t seem like normal students.</p><br/><p>Gao Yang turns around and tells him, “Fellow You, these are all the juniors from the four big families, there’s no need to pay attention to their words, they’re all just people who say the grapes are sour because they can’t eat the grapes[1].”</p><br/><p>You XiaoMo almost laughed out loud, he didn’t think that last sentence was actually commonly used in this world as well, “Gao DaGe, you don’t need to worry about me, I understand!” Jealousy is common to all men, but it hasn’t been too long since he arrived at Yan City, he doesn’t really understand anything to do with the so called four big families so he definitely won’t take it to heart.</p><br/><p>Under the gazes of many, Gao Yang takes You XiaoMo’s group of three through the crowd to Ning Jing DaoShi’s place.</p><br/><p>Ning Jing DaoShi had been waiting for them for a long time, seeing that they arrived, her beautiful eyes look around in a charming manner with hints of joy surging around like rays of dazzling light. All onlookers can’t take their eyes off her, although she’s not young anymore, she’s still the unrequited love of many students.</p><br/><p>“You brat, you made DaoShi wait a long time.” Ning Jing DaoShi looks at You XiaoMo and says in a teasing manner.</p><br/><p>“Uh… sorry.” You XiaoMo rubs his nose and apologises with a slightly red face. Compared to other people in the hall, he really did come quite late, but he didn’t even think he’d come here to take the assessment in the first place.</p><br/><p>Ning Jing DaoShi can’t hold it in any longer and goes ‘pffft’ in laughter, “I’m joking with you, brat. There’s no need to take it seriously, it was me who forgot to tell you to come here for the assessment yesterday. It’s not your fault, there’s no need for you to apologise to me.”</p><br/><p>You XiaoMo laughs and doesn’t reply. Of course he knows that Ning Jing DaoShi is joking with him, but if he doesn’t apologise then is he somehow supposed to refute her words. If he said that, he’d probably be poked to a hornet’s nest by all the gazes around him.</p><br/><p>Even though Ning Jing hasn’t known him for a long time, she knows that his personality is a bit shy so she won’t tease him anymore. Her line of sight lands on Ling Xiao who’s standing behind him with a snow white mask on and she raises her brows up in surprise.</p><br/><p>Although the male is wearing a mask, his noble temperament can’t be concealed no matter what, luxurious snow white clothing outlines the man’s tall and slender figure, the temperament he gives off carries a slight unrestrained and gentle vibe, unsurpassable beauty yet also has a sort of delicate attractiveness.</p><br/><p>Without a doubt, this is an elegant and noble man, many people have taken notice of his existence, quite a lot of people are softly chatting about him. Ning Jing is somewhat curious, she didn’t see this man yesterday.</p><br/><p>You XiaoMo observes Ning Jing DaoShi’s line of sight and follows it to discover that she’s looking at Ling Xiao and then goes to explain, “DaoShi, this is my friend, he’s called Ling Xiao. He went to participate in the warrior enrollment assessment yesterday.”</p><br/><p>Ning Jing instantly reveals a gentle smile and nods at him, “Student Ling, I welcome you to join Dao Xin Academy.”</p><br/><p>Ling Xiao slightly lifts the corners of his lips and opens his mouth to say, “Thank you!”</p><br/><p>You XiaoMo was suppressing his laughter so much that he could almost get an internal injury from it, Student Ling, haha, it’s so funny he could laugh to death.</p><br/><p>Ling Xiao stealthily shoots him a look, his eyes are filled with traces of an unfathomable smile, almost like he’s saying ‘you’re dead meat’.</p><br/><p>You XiaoMo coughs and hurriedly averts his gaze, “Oh yeah, DaoShi, hasn’t the assessment started?”</p><br/><p>Ning Jing smiles, “There’s still a few people who haven’t arrived, we’ll wait a bit longer.”</p><br/><p>You XiaoMo was just about to ask who these big shots were, they actually made so many people wait for them, even DaoShi is waiting for him, when noisy chatters resound from the direction of the entrance, he looks over and sees a group of people walk in. The people who were crowding the entrance all willingly make way for them, their attitudes really are respectful and modest, there’s also hints of ingratiation and fear.</p><br/><p>One only sees a tall silhouette walk through the opened doors first, it’s a male who’s quite handsome in appearance, he looks to be around twenty years old, his forehead radiates touches of gentleness, a gorgeous blue robe makes him seem extremely honorable. The jade belt on his hips sways in the air as he walks, magnificently beautiful yet also chic and elegant.</p><br/><p>Gao Yang to the side takes notice of You XiaoMo doing the elevators and explains, “This is Tong YueXu from the Tong family and is one of the best geniuses of the Tong family. Although he’s twenty years old today, he was already a level four mage three years, there were a few reasons as to why he didn’t enter Dao Xin Academy but this person’s talent at making pills is extremely high. He counts as one of the best here in Yan City. Apparently, he’s already got half a foot in the level five field already.”</p><br/><p>You XiaoMo doesn’t fully understand and shifts his gaze from Tong YueXu to the youth behind him.</p><br/><p>The youth looks younger than Tong YueXu with delicate facial features. His looks carry a lively and delicate beauty, when the other smiles he has a pair of deep dimples on his face and looks very sweet.</p><br/><p>You XiaoMo asks, “Who’s the youth behind him?”</p><br/><p>Gao Yang says, “The youngest son of the BaiLi family, BaiLi XiaoYu, he’s eighteen just like you. He became a level four mage seven months ago, he’s not the most outstanding one amongst the younger generation of the BaiLi family but his talent is still one of the best there.”</p><br/><p>You XiaoMo listens and is astonished, the big families are definitely worthy of their name, they really do have talented people one after the other.</p><br/><p>As soon as Gao Yang finishes speaking, the entire assessment hall suddenly quiets down, but it’s only for a few seconds, very quickly there’s another loud and noisy commotion, quite a lot of people, especially males, look towards the entrance with sparkling eyes.</p><br/><p>You XiaoMo whips his head around to have a look, he just so happens to get a quick glimpse of the enchanting figure that just walked in.</p><br/><p>T/N</p><br/><p>[1]  Used to describe when someone’s bitter that someone else has something but they don’t have it, and so to try make themselves feel better they just go and say that the thing’s bad. The children’s story behind this saying is that one day there was a fox who found a vine of grapes hanging up high and couldn’t reach it no matter how hard he tried. Then a bird comes flying over and takes a grape, the fox sees this and feels bitter so he just walks away while telling himself, “I don’t want to eat the grapes anyways, they’re definitely sour.”</p><br/>\n</div>"}