{"title": "Chapter 238", "id": 238, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-238", "volume_title": "Volume 3", "body": "<h1>Chapter 238</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Rara</p><br/><p>“Why are you here, ah no, how do you know that I’m here?”</p><br/><p>You XiaoMo looked at the man and was nearly shocked to death, Ling Xiao literally was on the arena not long ago, and yet he just magically appeared in front of him.</p><br/><p>Ling Xiao put a hand on the wall behind You XiaoMo while trapping You XiaoMo under his body, then revealed a smile, “I realized it the moment you appeared at the arena, however, I noticed someone was happily talking to a strange man and then left without paying attention to me. How are you willing to pay this debt?”</p><br/><p>Looking at Ling Xiao’s smiling eyes, You XiaoMo heart beat quicker nonetheless. What is this man’s nose made of, how did he know exactly when he appeared? And he even managed to find the way here.</p><br/><p>You XiaoMo rolled his eyes as he smiled apologetically, “Because I believed you definitely would win. Ah, that was why I didn’t stay back.”</p><br/><p>Ling Xiao stared at his face for a moment before he spitted out one word, “Nonsense!”</p><br/><p>You XiaoMo suddenly choked.</p><br/><p>Ling Xiao said, “Give me your card.”</p><br/><p>You XiaoMo was puzzled, but still obediently gave him his black card.</p><br/><p>Ling Xiao first received You XiaoMo’s black card, then he also took out his own and then he slightly swiped the two card against each other while using his spiritual power, suddenly, 150 points was directly transferred to You XiaoMo’s card. After he had finished, he gave the card back.</p><br/><p>You XiaoMo looked at the number on the card turning from “10” to “160”, he couldn’t help but stare at Ling Xiao. “Don’t you want to rent a room? Why did you give me this many points, doesn’t that mean you can only rent for 5 days?”</p><br/><p>Ling Xiao faintly raised the corner of his mouth, “You think within 5 days, I can’t earn more points? You should be the one to talk, if I don’t give you the points, won’t it mean you have to stay with three others in the same room? Do you dare to refine magic pills in that situation then?”</p><br/><p>You XiaoMo was speechless. Fine, he really couldn’t, after all he used high grade magic herbs to refine pills.</p><br/><p>If he still insisted on staying with Jiang XiaoFeng, then he wouldn’t be able to refine magic pills. For You XiaoMo, this matter compared to being killed was even more annoying, because he chose to earn points by using the fourth method, and this method had something to do with refining pills.</p><br/><p>“I don’t live with three people though. BaiLi XiaoYu and Tong YueXu have relocated, only a person called Jiang XiaoFeng is left. Actually, I left the place with him earlier, but we kinda lost each other halfway through.” You XiaoMo explained.</p><br/><p>Ling Xiao said, “Then, how do you plan to earn points?”</p><br/><p>Actually Ling Xiao knew the reason You XiaoMo didn’t stay behind to see him compete, because he was busy inquiring methods to earn points.</p><br/><p>You XiaoMo lifted up his black card, “Refining pills is my only forte, I cannot do anything else.”</p><br/><p>Ling Xiao didn’t take it seriously, “There are many mages inside Dao Xin Academy who have the same idea as you, are you sure people will definitely buy your magic pills?”</p><br/><p>You XiaoMo smiled contently, “Of course I have think about this, because I just heard, Block One has especially set up a bazaar, which is also the only marketplace that sells magic pills in the B ward. Lots of mage will go there to set up a stall, even though it a very competitive business, but I have thought up some method. If selling magic pills is a loss, then I can sell some high grade magic herbs instead, because next to the magic pills area is the magic herb area.”</p><br/><p>“Not a bad idea, but I heard the renting price inside the magic pill and magic herb area is very high. Since you have to pay for both the room rent and booth rent, do you have enough?” Ling Xiao copied You XiaoMo’s action and swinged the black card.</p><br/><p>You XiaoMo twitched his mouth, this man thinks too highly of himself! Even though he understood well enough, but he already received 150 points from Ling Xiao, if he took more then that wouldn’t it mean he would end up taking all of Ling Xiao’s ” hard earned” points? Ah!</p><br/><p>You XiaoMo pondered for a moment, then said, “How about we go and check out the stall’s rent first, then we will discuss it later.”</p><br/><p>For the time being, You XiaoMo didn’t need to rent the private pavilion, a single room is enough. With six points per days, using the points on his card, he could rent for a month.</p><br/><p>Ling Xiao put his hand onto You XiaoMo shoulder, “I’ll accompany you.”</p><br/><p>You XiaoMo knew Ling Xiao would say so, and he did really want to find a companion to go with though, he just didn’t think it would be Ling Xiao. But, You XiaoMo still suspiciously looked at him, “If I go with you, won’t we stand out too much?”</p><br/><p>Ling Xiao just beat that Sun Zhe guy earlier, if he went together with him, then people would definitely regard him as Ling Xiao’s partner, well, it was the truth though.</p><br/><p>Ling Xiao grinned at him very gently, “By the time you’ve said those words, don’t you think it’s already too late?”</p><br/><p>You XiaoMo took a look around and saw people occasionally stealing a glance at them with curious eyes, indeed, it was too late now.</p><br/><p>That was why, he had no better option but to go with Ling Xiao to the bazaar.</p><br/><p>Located in the middle of Block One and Two, were the two selling spots, the Magic pill and the Magic herb areas. Since they were the neighboring areas of both blocks, they were very close.</p><br/><p>The middle area was a fixed spot, that was why everyday the place was flooded with the endless streams of people. On their way to the bazaar, they met more than a dozen of people and horses, a good amount of individual practitioners went and left.</p><br/><p>By the time they arrived, all the magic pills selling spots were very lively. Since the sun has not set, lots of the magic pill stalls hadn’t closed yet.</p><br/><p>It was no wonder why the magic pill area was the most popular place in the bazaar. The surge of people was so strong, even the stalls in the corner also had guests. After seeing the situation, You XiaoMo no longer felt worried that his magic pills wouldn’t sell well.</p><br/><p>You XiaoMo and Ling Xiao wandered around the bazaar, he realized some stalls had a fixed customer base. Those stalls probably were one of the hottest attractions in the area. Moreover they also recognized, all the vendor’s owners seemed to belong to many different sections, because each stall owner, on their clothes was a different, very symbolic crest.</p><br/><p>After some digging, You XiaoMo found out that those men belonged to several forces of Block Two.</p><br/><p>Because this was You XiaoMo’s first day at the academy, he didn’t know how many forces there were.</p><br/><p>The two of them sort of gave those stalls a quick look before they moved on to another place, the ‘hot cake’ area was definitely not a cheap place to rent, so they could only go for the corner booth.</p><br/><p>You XiaoMo strolled around, he then found three spots that were a little deserted. Probably because only a few people go there, there weren’t many stall around these spots, which means the rent of these booths should be very low.</p><br/><p>Since he had determined the location, You XiaoMo didn’t leave with Ling Xiao right away but instead, he went to wander all the hottest booths for a few rounds, to make sure which magic pills were trending.</p><br/><p>After a few rounds, he found out between the variety of the most popular pills, one of which he had refined a lot before, and that was the Yuanyang pill. Originally he had thought that only a few practitioners would need this pills, who would have thought at this place it became the most popular item.</p><br/><p>Beside the Yuanyang pills, there were also the spiritual energy restoration pills, Tianling pills, the pill that healed internal injuries, the Zhenyang pill, and the pill that healed external injuries, the Huoxue pills. These four types of pills were the hottest items of the magic pill area. Except the Tianling pill, which was a level 5 pill, the other three were level 4 pills, so almost all the students of Block Two could refine them.</p><br/><p>But having the ability to refine them was not equal to having the ability to refine them a lots, because magic herbs is needed to refine, and you need points to buy them, unless you own some or grow some.</p><br/><p>In addition, they also inquired about the price of the four magic pills, which, can simply be explained through one word, and that was – expensive!</p><br/><p>The Yuanyang pill was four points, the Huoxue pill was three points and the Zhenyang pill was five points. Because the Tianling pills were a level 5 magic pill, the price was set higher, a total of seven points, the price was even more expensive than renting a single room, no wonder selling magic pills is one of the most profiteering jobs, it seemed reasonable enough.</p><br/><p>“So?” Ling Xiao turned to the side and looked at the pondering You XiaoMo.</p><br/><p>You XiaoMo said, “Between those four magic pills, for now, I can only make two, the Yuanyang pill and the Zhenyang pill. For the Huoxue pill I’m missing two types of magic herbs, but I’m not in the hurry right now so two is already enough, but…”</p><br/><p>Ling Xiao asked, “But what?”</p><br/><p>You XiaoMo frowned, “The Yuanyang pill only has its use in an emergency situation, this type of pill shouldn’t be this hot in the academy, yet so many are willing to buy it. Even if it was for competing at the arena, there is no need to use it that often, right?”</p><br/><p>Ling Xiao also didn’t know about this matter, even though his strength was beyond anyone else, he was still the same as You XiaoMo in that they had just enrolled in the academy. Moreover, he hadn’t come into contact with other students, except the first one whom was Sun Zhe, he was even more clueless.</p><br/><p>You XiaoMo also didn’t really expect Ling Xiao to have something to say to him. Since he had class tomorrow anyway, he could find a chance to ask Ning Jing-daoshi.</p><br/><p>After making sure of all the details, You XiaoMo then pulled Ling Xiao, “Let’s go to the realtor office to inquire about the rent, then we will go back.”</p><br/><p>Ling Xiao ignore the fact that You XiaoMo pulled him and let it be.</p><br/><p>But when they were about to reach the entry, suddenly from the edges of the area came a group of people. Those bunch of people were talking and laughing so loudly. Even though You XiaoMo and Ling Xiao didn’t recognize them, they recognized Ling Xiao, so, after seeing him, the lively atmosphere suddenly became quiet and cooled down. All of them stared at Ling Xiao with ill intentions in their eyes.</p><br/><p>“Yo, is this the cocky freshman that just wounded senior Sun Zhe?”</p><br/><p>The young man standing in front of the group talked with a very enigmatic voice, he stared at Ling Xiao with eyes that were like the needle rains pear flower that couldn’t stop shooting needles straight to Ling Xiao.</p><h5>(T.N: I don’t know how to put this, basically  is a type of weapon that when activated, it rotates and shoots needles aimlessly, very dangerous indeed, literal translation is pear flower in the storm Needle.)</h5><br/><p>Ling Xiao’s figure was taller than him, even though people couldn’t see the true appearance under the mask, his eyes looked at the people filled with an almighty sense. Hearing their words, Ling Xiao joking lifted his mouth, “You said it wrong. It should be that even though I won the fight, Sun Zhe and I were having a just and honorable fight on the arena, saying I wounded him could mislead people ah.”</p><br/><p>The young man’s face suddenly sunk down, but he seemed to remember the gap between the two of them, so he tried to suppress his anger, still ferociously saying, “Ling Xiao, don’t be too proud of yourself. Sooner or later, you will find out that Block One is not the place you can act so cocky.”</p><br/><p>Ling Xiao gracefully said, “Umhm, Sun Zhe also said so.”</p><br/><p>The young man ruthlessly left with a * heng* sound before he disdainfully lead his companions by them.</p><br/><p>Ling Xiao lifted the corner of his mouth, turned around to You XiaoMo and said, “Let’s go.”</p><br/><p>You XiaoMo felt that Ling Xiao’s ability to make trouble was not lesser than his.</p><h4>————————————————————————————-t/n: Yuanyang () – Zhenyang ()- Tianling() are the three acupuncture points in a humans mediarian system. Meanwhile, Huoxue() is the blood circulation system. These four terms are related in the traditional chinese medicine study, which needed an adept study to understand this, hence, it was very hard to even be able to translate it probably, so we decide to keep it in pinyin. (Addis side note: we really wanted to name the YuanYang pill the Yuanyulin pill to see if any of you would actually notice. XD)</h4><br/>\n</div>"}