{"title": "Chapter 249", "id": 249, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-249", "volume_title": "Volume 3", "body": "<h1>Chapter 249</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Kollumceti</p><br/><p>It was not long before the whole academy knew about the incident.</p><br/><p>A few good samaritans revealed the reason for the duel between You XiaoMo and Chai Jun. This even caused the bystander, Liu Yue, to become more famous.</p><br/><p>Originally, it was normal for new students to undergo some hazing. This was because some new students were too wild, so they would need someone to knock them off their high horses. This was also the reason for Sun Zhe making trouble for Ling Xiao.</p><br/><p>Regardless, Liu Yue was now affixed with the label of You XiaoMo’s underling, and no one dared to bully Liu Yue. Those who were beating him up also came to his door to apologise.</p><br/><p>As they were just following Chai Jun’s orders, Liu Yue did not cause a big fuss over this matter. He was worried that accumulating too much resentment would make You XiaoMo and his school life more difficult. He may have suffered greatly, but one could say that he had profited from this misfortune.</p><br/><p>When You XiaoMo and BaiLi XiaoYu arrived, Liu Yue had just sent off a bunch of people who came to apologise.</p><br/><p>Liu Yue changed his clothes, and with You XiaoMo’s magic pills, he was feeling much better. In addition, his wounds were already in the midst of recovering.</p><br/><p>Upon seeing him walk over, Liu Yue walked over and happily greeted, “Young Master!”</p><br/><p>You XiaoMo gave a cough. Every time he heard Liu Yue calling him young master, he would feel uncomfortable. Although he had warned Liu Yue not to call him that, once he turned his back, Liu Yue would continue to address him as such. If this continued, You XiaoMo would get used to this form of address.</p><br/><p>“Liu Yue, pack your belongings, come with me to the Third Winter Courtyard.” You XiaoMo said.</p><br/><p>“The Third Winter Courtyard? Whatever for?” Liu Yue was surprised. There were only good-quality single person rooms there.</p><br/><p>“Of course you’re going to be staying there. Did you think you were going there to appreciate the scenery?” You XiaoMo replied.</p><br/><p>Before coming to Liu Yue, he had already consulted with Elder Gong, who was in charge of room rentals. He could transfer the room under his name to someone else, or cancel his booking. However, there was a one-time processing fee of two points to change rental ownership, and a refund of one point for cancelling. For example, the single room that he was renting now cost six points per day. If he cancelled his booking, it would be a net cost of five points. Since it was like this, it would be more cost-efficient to change ownership.</p><br/><p>You XiaoMo’s room booking still had three days left, so he might as well transfer the room to Liu Yue.</p><br/><p>Upon hearing that Young Master had helped him rent a single person room for three days, he did a double take, and anxiously replied, “Young Master, you can’t do this. You are the Young Master. It is natural for me to be the one on the giving side. How can I let you give me points? I cannot accept this.”</p><br/><p>You XiaoMo took a plaque from his magic bag and gave it to Liu Yue. “Whether you want to accept it is up to you. I have already transferred the room to you. It is your decision to stay in it. I see that your wounds are much better. You can move over by yourself. I’ll be going first.”</p><br/><p>Without giving Liu Yue a chance to refute, You XiaoMo and BaiLi XiaoYu left the Sixth Winter Courtyard and returned to Block Two.</p><br/><p>On the way back, You XiaoMo found that the gazes observing him had greatly increased. He knew that he had once again attracted the limelight, but it couldn’t be helped. Who asked that rat Chai Jun to touch his underling? Of course he could not let that go.</p><br/><p>Calmly disregarding the gazes, You XiaoMo headed towards his new pavilion. Due to the fact that he did not have enough points on his Black Card, he could only rent it for five days.</p><br/><p>BaiLi XiaoYu originally intended to return to the four person room, but You XiaoMo mused – BaiLi XiaoYu did not have the bad habits of the disciples from big practitioner clans, and they got along quite well. Thus he permitted him to follow You XiaoMo.</p><br/><p>Therefore, BaiLi XiaoYu joyously moved out from the four person room, and used the points that his brother gave him to rent a pavilion next to You XiaoMo.</p><br/><p>After moving in, You XiaoMo discovered that the pavilion’s spiritual energy was much denser than the surroundings.</p><br/><p>To practice in such an environment would mean half the work to gain twice the results. Hence, he immediately summoned SheQiu and the Qiu team.</p><br/><p>The Qiu team, which was in the midst of their cultivating, were suddenly displaced, and a couple were disturbed from their practice. Only XiaoHei was unperturbed, however, upon discovering that the spiritual energy in the room was higher than You XiaoMo’s space, he was taken aback.</p><br/><p>“What is this place? Why is the spiritual energy here so dense?” SheQiu took a deep breath, detected that the purity of the spiritual energy was about the same as the dimension, and was momentarily stunned. He had always assumed that the spiritual energy in the space was already very dense.</p><br/><p>“Master, Master, this place is really good!” The round and bouncy PiQiu was unable to describe his feelings, but he really liked the small pavilion. If he could cultivate here, his advancement speed would definitely increase.</p><br/><p>You XiaoMo wanted to retort, but upon seeing that MaoQiu and XiaoHei already found a corner to start cultivating, the corner of his mouth started twitching.</p><br/><p>SheQiu was not that hurried. Curiously investigating the small pavilion, he finally discovered the reason. “I see, so it’s like that. And it’s quite a big one too… …”</p><br/><p>“What is it?” You XiaoMo promptly asked, he had always wanted to clarify this matter.</p><br/><p>SheQiu slowly replied, “The ground beneath this residential area should have a leyline. DaoXin Academy uses a type of special array to consolidate the spiritual energy from the leyline, and trap the spiritual energy in a barrier. This method allows the interior of the small pavilion to be filled with dense spiritual energy, but there is a severe disadvantage for this type of method.”</p><br/><p>You XiaoMo curiously asked, “What disadvantage?”</p><br/><p>SheQiu replied, “There would be a day when the leyline withers. From my estimation, DaoXin Academy has been using this approach to encourage the students for quite a period of time, for approximately two thousand to five thousand years. No matter how strong the leyline is, I’m guessing that it’s close to being exhausted.”</p><br/><p>You XiaoMo did not think that the issue was so serious. Should the leyline completely wither, the students would lose their motivation, and some would even want to drop out of the academy. Although he had only been here for a few days, he had already intuited that the desperation of the students could largely be attributed to the spiritual energy in the residences.</p><br/><p>“Is there any way to remedy this?” You XiaoMo asked. Although the leyline was not his main reason for entering DaoXin Academy, he had only just registered, and this would be his home for his period of study.</p><br/><p>“I’m sure there’s a method.” SheQiu said.</p><br/><p>“What is it?” You XiaoMo excitedly asked.</p><br/><p>“How would I know?” SheQiu stared at him. He was born with spiritual knowledge, but always remained in the Paradise Realm, and only vaguely knew of leylines. He was not certain of the details regarding leylines.</p><br/><p>You XiaoMo looked at him with eyes full of pity.</p><br/><p>SheQiu couldn’t be bothered with him, and found a spot to cultivate.</p><br/><p>Seeing that no one was paying attention to him, even the cute PiQiu also went to cultivate, he had no choice but to refine pills upstairs.</p><br/><p>Both parties were not aware that what they just discussed was a highly confidential matter in DaoXin Academy. Knowledge of this secret was restricted to the top people in the academy and disclosing it came with heavy consequences.</p><br/><p>You XiaoMo was not that concerned. He had enough awareness to know that this matter cannot be causally discussed, and since it didn’t affect him, there was no need to invite difficulties upon himself.</p><br/><p>On the second day, You XiaoMo did not open his stall. He planned to refine his remaining magic herb to magic pills and then sell them in one shot. Refining day and night, he nearly forgot to attend the orientation; luckily BaiLi XiaoYu came to look for him to attend classes together.</p><br/><p>The two proceeded to the classroom, but since they came a little late, the seats in the classroom were filled. Fortunately, Tong YueXu had the foresight to reserve two seats for them.</p><br/><p>You XiaoMo looked around the classroom, yet he did not find a trace of Chai Jun.</p><br/><p>Seeing it, Tong YueXu explained, “Since Chai Jun was injured, he was sent back to the Chai Family. It seems like he will take some time to recover, so you don’t need to worry. If the Chai Family tries to make things difficult for you, the academy won’t idly sit by.”</p><br/><p>You XiaoMo nodded. He had already thought about the pros and cons, so he was not afraid that the Chai Family would make any trouble.</p><br/><p>Before the lesson started, Ning Jing-daoshi talked about the division of classes. Division of the classes were mostly based on their levels, however there were some special cases. Taking You XiaoMo as an example, with his enormous potential, the academy would assign a Daoshi to personally instruct him. Thus he would not need to go to Class Three for lessons.</p><br/><p>After class, Ning Jing-daoshi asked You XiaoMo to stay back to speak alone with him. Teng ZiXin, who was not called out, was the first to leave the classroom with a frigid expression.</p><br/><p>“You little brat, after the fight with Chai Jun, I bet you can be at ease now?”</p><br/><p>Entering the room, Ning Jing-daoshi mocked You XiaoMo.</p><br/><p>You XiaoMo embarrassedly looked away and hesitantly said “En… …It is much more relaxing now.”</p><br/><p>Ning Jing-daoshi let out a ‘Pu Chi” sound and smiled, but turned around and angrily replied: “You silly boy, still daring to say these things. You do things without thinking of the consequences. The academy can only protect you while you are a student, but cannot protect you for life. You insulted the Chai Family’s reputation in front of so many people. Based on the pettiness of the Chai Family, you will have to watch your back.”</p><br/><p>You XiaoMo did not meet her gaze, and diverted the topic, “Daoshi, I will be careful. Did you look for me to tell me this?”</p><br/><p>“Of course not!” Ning Jing-daoshi replied. She passed a jade drive to him, “This contains information on the high level mages in Block Two. Go back and look through it. If you have any Daoshi that you’ve taken a liking to, tell me. I’ll help you speak to them.”</p><br/><p>“Thank you Daoshi!” You XiaoMo received the jade drive, and sincerely gave her his thanks.</p><br/><p>“If you want to thank me, just don’t forget about Daoshi after you have achieved meteoric success.” Ning Jing-daoshi smiled and said; “All right, I was just joking with you. If there’s nothing else you can leave.”</p><br/><p>You XiaoMo had no choice but to leave. To tell the truth, he always thought that his teacher would be Ning Jing-daoshi. He was a little regretful that she couldn’t be his teacher.</p><br/><p>Leaving Ning Jing-daoshi’s residence, he returned to his small pavilion and continued to refine his remaining magic herb into magic pills. He planned to sell magic pills at his stall with BaiLi XiaoYu the next day.</p><br/><p>Who would have thought, the two guys who bought his magic pills the last time were there again, and were specifically waiting for him there.</p><br/>\n</div>"}