{"title": "Chapter 242", "id": 242, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-242", "volume_title": "Volume 3", "body": "<h1>Chapter 242</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Rara</p><br/><p>Tong YueXu looked toward You XiaoMo with surprise, he realized he became more and more unable to understand this fella.</p><br/><p>Meanwhile BaiLi XiaoYu was incapable of hiding his feelings, he couldn’t help but speak out everyone’s inner thoughts with sparkling eyes, “Xiao Mo, you are able to switch to a single room so fast! You are so amazing, ah!”</p><br/><p>You XiaoMo felt awkward toward his praise, since half of it was thanks to Ling Xiao’s help. If it wasn’t for the one hundred and fifty points Ling Xiao had given him, You XiaoMo would very likely still be struggling trying to earn points right now.</p><br/><p>“The points I used to pay for the rent was from my friend.” You XiaoMo explained.</p><br/><p>“Your friend?” BaiLi XiaoYu stared at You XiaoMo, “You mean that guy who challenged that Sun Zhe something guy earlier?”</p><br/><p>“How did you know?” You XiaoMo was surprised.</p><br/><p>BaiLi XiaoYu immediately said, “Of course I know, the duel between your friend and Sun Zhe is already being spread throughout Ward B, lots of people have heard about it by now.”</p><br/><p>BaiLi XiaoYu had seen Ling Xiao before, and had also heard the man’s name through You XiaoMo’s introduction, so he knew right away that the man was You XiaoMo’s companion. Only, he and the others were still very astonished by the fact that the man that had seemed so low-profile at first, turned out to be powerful enough to even manage to defeat Sun Zhe, the person who had taken ninth place in the top ten most powerful men of Ward B.</p><br/><p>When You XiaoMo asked this question, he also roughly figured out the answer already, so he didn’t feel too surprised after hearing the answer.</p><br/><p>Some minutes later, Ning Jing-daoshi finally arrived. She was wearing a pink skirt that set off her outstanding, ethereal beauty, the breath-taking appearance of hers seemed to make her seem a few years younger. Her presence had taken people’s attention and they no longer set their eyes on You XiaoMo.</p><br/><p>Ning Jing-daoshi first began by asking about people’s well being. Her soft voice like an oriole singing, very pleasant to ear, quickly changing the atmosphere inside the classroom. Before this she had only told them about some matters they needed to watch out for, but right now, it was time to talk about the inside the academy, and You XiaoMo was finally able to receive answers for some of his questions.</p><br/><p>( t/n: in chn culture, to compare one’s voice to oriole means the voice is really clear and soft)</p><br/><p>“Behind our academy is a deep mountain area that stretches a thousand miles. It is packed with demon beasts in the air and on the ground. Even though the danger level there is not as dangerous as the MoRi mountains, it is famous for being the home of demon beasts. Students of the academy are expected to practice inside their rooms, however the deep mountain is also one of the places where students can often visit.”</p><br/><p>“In order to catch demon beasts, which is also a way to train themselves, students frequently organize parties to raid the deep mountain. Of course, not only can Block One students, the students of Block two can also form their own teams. But let your daoshi advise you, if you want to hunt down demon beasts, it is best for you to work together with others. The danger inside the deep mountains is something you can’t imagine, if you are not 100% sure, don’t go too deep in there.”</p><br/><p>You XiaoMo was finally able to comprehend the reason why Yuanyang pills were one of the hottest selling items, all because of this very matter.</p><br/><p>To those who occasionally raided deep inside these mountains, the chance of getting hurt and being at risk was high. Therefore, the academy’s students, in order explore that area, must prepare magic pills just in case.</p><br/><p>As for the best selling items, nothing can surpass the Tianling pills, because under such a risky situation, it was definitely the most efficient pill. It was no wonder they were sought-after the most. Unfortunately, Tianling pills were still out of his reach for now, otherwise, he would rather make a couple of this type and sell them, because the profit was obviously higher.</p><br/><p>When he had come to this conclusion, You XiaoMo had the urge to breakthrough to level 5 as soon as possible.</p><br/><p>“And now, I shall show you some methods to earn points. I believe some of you have already asked around, so I will sum it up simply…” Ning Jing-daoshi ‘s soft voice echoed through the classroom as everyone was listening to it with pleasure. But since You XiaoMo already knew everything she was explaining, his mind drifted miles and miles away.</p><br/><p>Half an hour of talking and yet the lesson still hadn’t finished. Besides talking about how to earn points, Ning Jing-daoshi also mentioned about the room renting matter, and it was not until these last few sentence of Ning Jing-daoshi’s that You XiaoMo, who was dozing off, finally woke up.</p><br/><p>You XiaoMo quickly regained his focus and continued listening to Ning Jing daoshi, “Ward B is different from Ward A, if you want to go to Ward A, where they have better treatment, then everyone should try your very best to become a level 7 mage. Or to win a spot in the top ten at Ward B’s annual competition. Then whether or not you are a level 4, 5 or 6 mage, you are still qualified to enter Ward A.”</p><br/><p>This method didn’t seem so bad, but after hearing it, You XiaoMo shook his head.</p><br/><p>The highest level of Ward B was level 6, even if you were eligible to enter Ward A, you would still end up being at the bottom there.</p><br/><p>You XiaoMo had heard that the study system of Dao Xin academy was very intense, especially in Ward A. The arena there compared to Ward B’s arena was even more fiery, dueling battles and provocation happened frequently. So if you went there being one of the lowest students, no one could guess what could happen.</p><br/><p>“Last thing, let’s talk about the class distribution.” Ning Jing daoshi said as her eyes swept across every single one of them. “In Block 2 there are a total of nine classes. Class One to Three is for level 4 mages, the numbers go up respectively in order from the lowest levels to mid levels and then high levels.”</p><br/><p>A student in the first row stood up and raised his hand, “Daoshi, how about a peak level 4 mage?”</p><br/><p>“Then you will also belong to class Three.” Ning Jing-daoshi said, “Now, I need to hear everyone’s level to make a list. Starting from the first row, tell me your name and level. Those who has finished can leave the classroom.”</p><br/><p>Hearing this, You XiaoMo felt regretful. He regretted picking this nearly-at-the-end row, because it would take a while before it would be his turn.</p><br/><p>There were too many students inside the classroom, and You XiaoMo estimated that there were probably around two hundred people, and judging by his position, he was probably within the last two hundred.</p><br/><p>But to other people, this was not a disadvantage, since they could take this chance to learn about other people’s strength.</p><br/><p>Fortunately the speed was not slow, because Ning Jing daoshi used the jade drive to record the info. To record information into the jade drive, you only needed to use a small trace of soul force or spiritual energy, which only took a few seconds to finish.</p><br/><p>t/n: soul force = power came from the soul of the mage, spiritual energy = energy came from the surrounding. Because practitioner can’t use soul force, so they need to use spiritual energy in situation like this.</p><br/><p>Teng ZiXin and Chai Jun’s group was sitting at the front, so their turn came not long after. Although everyone had already known Teng ZiXin’s level, but to hear it directly was still shocking enough.</p><br/><p>Many people revealed a trace of fondness in their eyes after seeing her beautiful and indifferent expression.</p><br/><p>Even though half of the students had finished, none decided to leave, including Teng ZiXin. Everyone sat back in their seats and silently listened to others announcing their names and levels.</p><br/><p>You XiaoMo discovered that even BaiLi XiaoYu and Tong YueXu were engrossed in listening. No wonder they were the children of big clans, they were probably making a list of all the potential talents inside their head right now. Even though You XiaoMo did not really understand but if he carefully thought about it he probably would be able to do so as well.</p><br/><p>As time passed, You XiaoMo realized that the atmosphere inside the classroom was becoming more and more strange.</p><br/><p>At first there was some still gossip floating around, but as it nearly reached to the end, the whole classroom slowly sunk into silence, as the tension and expectations began to take up its place, as if people were waiting for someone.</p><br/><p>You XiaoMo had a narcissistic thought. Don’t tell him they are waiting for his turn?</p><br/><p>When he was lost in thought, BaiLi XiaoYu, who was sitting beside him immediately stood up. He exposed his white teeth and said, “My name is BaiLi XiaoYu, I’m eighteen this year and I’m a low level 4 mage.”</p><br/><p>He sat down immediately after finishing his introduction and the classroom suddenly filled with a burst of applause. Well, it was naturally coming from the people in the BaiLi clan and the people of Tong clan were forced into it.</p><br/><p>You XiaoMo, “…”</p><br/><p>After the applause died down, the classroom became quiet again.</p><br/><p>You XiaoMo realized everyone’s attention was on him, then he finally became aware that it was finally his turn.</p><br/><p>You XiaoMo stood up and said, “My name is You XiaoMo, I am a level 4…Erm….a peak level 4 mage.”</p><br/><p>Since BaiLi XiaoYu had just told him, Ning Jing daoshi didn’t require them to tell their age, so in order to avoid people mistakenly thinking he was competing, he directly cut down the age thing, since many people already knew it anyway.</p><br/><p>The classroom was so quiet and all the attention was scorching. Some people even continuously moved their line of sight back and forth between him and Teng ZiXin as if they were comparing them.</p><br/><p>You XiaoMo found out that he was not being narcissistic, people really were waiting for his turn! But he was puzzled, his level shouldn’t be a secret to them. Why did people act like they didn’t know about it?</p><br/><p>Tong YueXu seemed to see through his doubt, so he explained, “Actually everyone already knew you are a level 4 mage, but not the detail. They were still guessing whether you are a high level or peak level, but most people only guessed you are a high level.”</p><br/><p>You XiaoMo was finally enlightened. Between high level and peak level, there was still a big difference. A high level mage still needed a large amount of time to practice to be able to breakthrough, while a peak level could breakthrough whenever they wanted. It was a different meaning, with a different result.</p><br/><p>He could guess that people were probably comparing him to Teng ZiXin right now.</p><br/><p>Teng ZiXin was already a level 5 mage at eighteen, so, if he could also breakthrough to level 5 at the age of eighteen, then that means his potential is as high as Teng ZiXin’s. Which, in turn, would make all the rumors about him before eventually collapse by itself, and Teng ZiXin wouldn’t be the only super genius anymore.</p><br/><p>That was why, probably even inside Teng ZiXin’s head right now, she also wished he was only a high level 4 mage.</p><br/><p>Those people must have been so bored, staying back just for this. He admitted a genius existence is always superior than others, but there was no such thing as the highest spot, because the world didn’t have just one genius.</p><br/><p>You XiaoMo couldn’t help but laugh when he thought about this, if people were looking forward to it, then he very happy to have had struck such a heavy blow on all of them. This was so that people wouldn’t think of him as a paper tiger anymore.</p><br/><p>t/n: paper tiger = only have the name but no talent</p><br/><p>Seeing him like that, BaiLi XiaoYu curiously asked, “Xiao Mo, why are you laughing?”</p><br/><p>You XiaoMo shook his head, “Nothing, I just feel that, high level or peak level is still the same thing to me.”</p><br/><p>As his sentence flowed out, everyone all perked up their ears.</p><br/><p>BaiLi XiaoYu didn’t fail people’s expectation, as he continued by asking, “Why?”</p><br/><p>You XiaoMo opened his mouth, “Because I only became a level 4 mage, half a year ago, ah!”</p><br/><p>“Tchhhhh….”</p><br/><p>The whole classroom went into complete silence for a full five seconds. It was so quiet that there was almost no sound at all. No one knew who was the one broke the silence with that gasp, which broke the atmosphere instantly.</p><br/><p>—————————————————————————————————————————————</p><h4>t/n: reminder for the mage system again.</h4><h4>From level 4 and beyond, since the distance between each level gets wider and harder to reach a new level, within a level is now divided into three smaller parts, Low – Mid – High. This refers to the progress within a level.</h4><h4>And between each level, there is also a stage called “peak”. If you nearly reach a new level and breakthrough, then you are at the peak.</h4><h4>Example: level 4 mage that has a progress halfway to a new level =&gt; mid level 4</h4><h4>Level 4 mage that have progress 2/3 to the new level =&gt;high level 4</h4><h4>Level 4 mage that have progress 2/3 to the new level and almost breakthrough to new level=&gt;peak level 4</h4><br/>\n</div>"}