{"title": "Chapter 252", "id": 252, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-252", "volume_title": "Volume 3", "body": "<h1>Chapter 252</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Rara</p><br/><p>Thanks to the density of the spiritual energy inside the pavilion, You XiaoMo didn’t have to worry about overusing it. Even if this was Ling Xiao’s territory, he believed, besides him, Ling Xiao would never allow a third person stepping in here, so his mind was at ease when he knew there wouldn’t be an outsider jumping out of nowhere.</p><br/><p>(ra: wifey is confident his hubby won’t cheat )</p><br/><p>Then, he took a deep breath, closed his eyes and began the soul training. The tranquility of the pavilion calmed his mind, and he somehow could see the spiritual energy, like a bright and glowing white ray, quietly floating in the atmosphere, just a single deep breath could make one’s whole body relax.</p><br/><p>However, his eyes was obviously closed, yet he could see this as clear as a picture. Since he never came across such a situation before, You XiaoMo felt overwhelmed nonetheless. But as soon as possible, when he averted his eyes to another side, a wide and transparent meridians system appeared in front of him, silver-white rivulets were flowing methodically inside the meridians but none connected with each other.</p><br/><p>This is clearly the meridians inside my body- as this thought came to his mind, his ‘light of sight’ changed.</p><br/><p>This time, the scenery shifted into a pitch black space.</p><br/><p>While You XiaoMo puzzled over the existence of this place, all of sudden, a bright spot came within his view. He took a glimpse at it, and it was actually something alike the galaxy that composed by an abundance of white luminous fragments, and in the center of it, seemed to exist an attractive force. All of those luminous fragments were gathered into a beautiful galaxy and orbited around a light green crystal, that crystal was only as big as a fist.</p><br/><p>He noticed, between every short period of time, those luminous fragments would overflow with a gas-form light green energy, and then those thread of energy were absorbed by that centered light green crystal.</p><br/><p>Just as he vacantly stared at it, those white luminous fragments suddenly accelerated the rotation. After that, more and more light green energy seeped out, and eventually completely being absorbed into the center crystal. Then, You XiaoMo found out that the original light green color now seemed to be much more deeper and denser.</p><br/><p>At the same time, You XiaoMo could feel the bottleneck he hadn’t able to break before faintly loosen up, he was stunned at first, but the feeling soon changed into pleasant surprise.</p><br/><p>This was an unexpected amazement!</p><br/><p>Although he didn’t know the principle behind it, but he felt that, if he could speed up the rotation of those luminous fragments, making them gush out more energy for that crystal to absorb, then, without any doubt, he would be able to break out of level four in no time.</p><br/><p>But how to accelerate the rotation speed? You XiaoMo fell deep in thought.</p><br/><p>Just a moment ago, those luminous fragments weren’t rotate that fast, and he didn’t find anything strange, but then when the speed got faster, he could faintly feel heat. Subconsciously, You XiaoMo withdrew from this black space and went back to the meridians system, and with his naked eyes, he could see the spiritual energy flowing inside the meridians system had sped up quite a bit. Then he traced the flowing direction of this meridians but was unable to find the place for them to converge.</p><br/><p>Still, You XiaoMo had confirmed one thing – if he wanted to accelerate the rotation of those luminous fragments, it might have some sort of relation to the flow speed of the spiritual energy of the meridians, and that flow speed might also connected to the width of the meridians and the spiritual energy absorption speed.</p><br/><p>With this discovery, You XiaoMo didn’t have to blindly search for clues anymore. Whatever the reason, right now, he only needed to accelerate the flow speed of the meridians.</p><br/><p>And so, You XiaoMo immediately freed his mind from his body. He called that phenomenon when he could see the meridians inside his body, inner sight, and as for that dark space, it very likely that was the inside of his head.</p><br/><p>When his consciousness had left, his eyes was still tightly shut but his hands placed in front of his chest were unconsciously making a hand seal. This hand seal was part of the Heavenly Soul Scripture. Despite the fact he had already reached the second stage of it and this hand seal belonged to the last step of the second stage, but before, he refused to use it due to the complication of this hand seal. Each time he had practiced performing it several times, and not until he had guaranteed there were no mistake did he dare to use it.</p><br/><p>It was mentioned in the Heavenly Soul Scripture that, when one perform this seal, one cannot making any mistake in the mid of it, because once one make an error, it will cause the soul force inside the body become chaos, which will easily cause a qi deviation, so You XiaoMo had no choice but to be this careful.</p><br/><p>The purpose of this hand seal was to assist him in speeding the spiritual energy absorption, before, the meridian system inside his body was very wide, so the absorption rate was slower than the refining rate, which caused the balance to be tilted. However, today, with the help of the hand seal, You XiaoMo could feel his absorption had increased.</p><br/><p>If someone came in at this time, they would literally see the spiritual energy of the pavilion surging toward You XiaoMo like a sea wave and rush to his glabella, and with the naked eyes, one could see the spiritual energy of the pavilion rapidly reduce.</p><br/><p>But in less than two seconds, the spiritual energy inside the pavilion was replenished, and very soon the density was restored to its usual state. This cycle was repeated over and over again, and after countless stages of replenishing, You XiaoMo finally stopped the absorption.</p><br/><p>Not long after, a wave of fluctuating energy, in a corrugated shape surrounding his body, spread out to the atmosphere and pushed the spiritual energy to the side, however, it didn’t seem too stable.</p><br/><p>On his glabella, a faint sight of a seal once again appeared. Whenever he leveled up, that seal would spread further to both sides of his forehead. Previously, it was only the size of the fingernail, but compared to now, it had become as big as a small pinky finger. After several times flickering, it finally disappeared yet again.</p><br/><p>Meanwhile, Elder Gong who was responsible for the room rental suddenly made a “Eh” sound.</p><br/><p>He discovered that the spiritual energy of one of the pavilions of Block One was rising very rapidly. If he hadn’t discovered that a piece of the crystal orbs was cracked, he probably wouldn’t have found out about this situation.</p><br/><p>Each crystal orb represented a pavilion, so when the crystal orb started flashing with high frequency, it indicated that the spiritual energy inside that pavilion was circulating intensively. By the time Elder Gong came over to check out, the crystal was already flashing.</p><br/><p>Elder Gong looked down at the orb to see who the owner of the pavilion was, one look and he couldn’t help but be surprise, it was that freshman Ling Xiao again.</p><br/><p>Judging by the situation, there was an eight out of ten chance the owner of the pavilion was in the middle of practicing.</p><br/><p>Due to the fact that many students came to him for a rental everyday, he was always fast and well-informed to news. As far as he knew, Ling Xiao went out yesterday, so he shouldn’t have come back by now, that meant only someone that Ling Xiao had definitely given permission to go inside. Could it be that… You XiaoMo?</p><br/><p>Elder Gong felt a bit agitated, he was also curious about this freshman.</p><br/><p>After walking in circle for half of a day, Elder Gong finally decided to personally see for himself, if it was really You XiaoMo, then it would very likely that he has broken out of level four and became a level five mage. After all, seeing the crystal flashing like crazy like that, the chance of eight out of ten was highly possible.</p><br/><p>However, You XiaoMo didn’t know his story had caught people’s attention. After the fluctuating energy faded away, You XiaoMo opened his eyes, his black pupils seemed more profound than before.</p><br/><p>Thanks to being able to timely replenish without delay of spiritual energy, his practicing was undisturbed and extremely comfortable. This time the meditation time was rather long, yet he didn’t feel even the slightest bit of exhaustion, his whole body was refreshed inside out, as if his whole body was washed all over.</p><br/><p>You XiaoMo stood up and gave his body a sweep, he then took a deep breath, the breakthrough this time went very smoothly. Before, when he broke out of level three, it was not as smooth as this.</p><br/><p>You XiaoMo felt his level after breaking though, without a doubt, he was now at low level five, but what left him in wonder, was that after the breakthrough, he could somehow feel he was near to mid level five, which, was a very unexpected pleasant surprise, but thinking over what happened while practicing, he wasn’t surprised for too long.</p><br/><p>While practicing, he couldn’t feel the time flow, so after waking up, You XiaoMo discovered that almost three hours had passed and he didn’t know if Ling Xiao had come back yet. That was why, You XiaoMo immediately walked downstairs, but the only thing he found was emptiness, which clearly stated that Ling Xiao had not come back. You XiaoMo couldn’t help but furrow his eyebrows, where the hell was Ling Xiao going in the end that took him so much time?</p><br/><p>Since the sun about to set soon, he didn’t have enough patience to stay here and wait anymore.</p><br/><p>The academy had a rule, a student from Block Two shouldn’t stay in a Block One student’s room for too long and vice versa, unless the student owned the purple card, which gave the student the power to do so, even more, they could also live together.</p><br/><p>You XiaoMo thought about the requirements for the purple card exchange and felt hopeless for the time being, because either you get over five thousand points on the card, or had a significant contribution toward the academy.</p><br/><p>Even though he had enough confidence that he can earn more, but he also needed to spend those points. Not to mention, saving up to five thousand was hard enough. And that thing about having a great contribution to the academy, the hurdle was even higher. So after going under the fruitless frustration, You XiaoMo finally gave up on the idea.</p><br/><p>After walking out of the pavilion, You XiaoMo stretched his body, the feeling after level up was so relaxing. Now that he had become a level five mage, he could get his hand on the Tianling pill right away, because this was even a hotter item than those level four pills.</p><br/><p>As he was thinking this, suddenly someone came before him with a smile on their face, “You XiaoMo, looks like you have leveled up.”</p><br/><p>This sentence gave him a sudden shock. He was inside the pavilion the whole time, people shouldn’t have known about it, so why is this Elder Gong know?</p><br/><p>————————————————————————————————————————-</p><br/><p>T/n:</p><br/><p> = qi deviation, literally translated as possessed by devil (qi = energy).</p><br/><p> = hand seal</p><br/>\n</div>"}