{"title": "Chapter 263", "id": 263, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-263", "volume_title": "Volume 3", "body": "<h1>Chapter 263</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><b>Chapter 263: The Fifth Elder</b></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>A few days later, You XiaoMo heard of some news.</p><br/><p>It was rumored that there was a level six mage from the Dao sect who was seriously injured. Preliminary estimates stated that his soul may have been damaged. If treatment was not successful, the Dao sect could lose a level six mage.</p><br/><p>That mage knew how serious his injury was, and in a moment of fury, pushed the blame to Xu Yun. If not for Xu Yun begging for his accompaniment, he would not have gotten injured.</p><br/><p>Hearing this, the Dao sect leader was furious. Disregarding advice from some people, he chased Xu Yun out of the Dao sect.</p><br/><p>If the one who was injured was a level four or five mage, the sect leader’s reaction would not have been that violent. But it just had to be a top-grade level six mage who was injured. In the current climate, there were very few level six mages who were willing to join the Dao sect. Therefore, a level six mage was a very important existence to the sect.</p><br/><p>This time, Xu Yun who was chased out of the sect, was really finished.</p><br/><p>There were no forces that would run the risk of offending the Dao sect by taking him in. One after another, those who were normally on good terms with him also kept their distance. In addition, due to Xu Yun, the Xu Family was also slightly marginalised.</p><br/><p>No one would have thought the situation would become this bad.</p><br/><p>When You XiaoMo heard this news, he could only lament on how fast his luck could change. If Xu Yun’s heart was upright, Chai Zheng would not be able to manipulate him, and he would not have fallen this far in the end. Ever since Ling Xiao told him that Xu Yun and Chai Zheng had been in contact, he had guessed the reason. Since Xu Yun had made his bed, he could only lie in it. He had suffered a great loss just for the sake of currying favor with the Chai Family.</p><br/><p>You XiaoMo already knew how the level six mage had gotten injured. Other than Ling Xiao who was being a little weird that day, there could be no other reason.</p><br/><p>But You XiaoMo would never admit that he had rejoiced a little in his heart when he heard this news. By his estimate, this Xu Yun would probably not appear in front of him again. This was great, as he did not want to see a person who was full of deceit.</p><br/><p>One month passed in a blink of an eye. After becoming the old geezer’s apprentice, You XiaoMo did not see a hint of his presence at all and did not know where he ran off to.</p><br/><p>On the side of the academy, Ning Jing-daoshi had called him out for a discussion concerning the old geezer. He did not know where she heard the news that he had taken the old geezer as his master, but she had advised him to patiently wait for the old geezer to find him. As for the old geezer’s identity, at the moment, she could not disclose it to him.</p><br/><p>Since You XiaoMo did not need to go to class, he cooped up in the pavilion to cultivate every day. Ling Xiao did not have any interest in the activities for Block One, so he also remained in the pavilion to accompany You XiaoMo. Occasionally he would find somewhere to cultivate, but the time he spent on cultivation was very short.</p><br/><p>Ling Xiao had eaten the level nine magic pill ten days ago.</p><br/><p>On that day, You XiaoMo specially cleared his schedule and squatted down in front of Ling Xiao to watch him cultivate.</p><br/><p>He had always been very curious about Ling Xiao’s affairs. Ever since he knew Ling Xiao, he had never seen Ling Xiao cultivating. He had always wondered – if Ling Xiao had not been cultivating, how could his level be so high?</p><br/><p>Unfortunately You XiaoMo could not see any changes, and only felt that the flow of the spiritual energy in the pavilion had sped up.</p><br/><p>After looking for a while, You XiaoMo lost interest and headed back to refine pills.</p><br/><p>Nowadays, his magic pills were very popular in Ward B. Seeing his success, some new and old students began to follow his practice, and put more effort into refining the magic herbs. Thus, the quality of the magic pills that were refined was much better than that of the Five Great Powers.</p><br/><p>Although the quality of pills could not beat You XiaoMo’s magic pills, it greatly satisfied the students’ demands.</p><br/><p>As for the students, they were willing to spend a little more on higher quality magic pills rather than spending the points on pills that would leave behind hidden dangers after it was consumed.</p><br/><p>Where there were people who rejoiced, there were also others who were unhappy!</p><br/><p>To the Five Great Powers, this situation was not ideal for them. Their sales volume had greatly decreased, and currently, it was not even half of the volume they had attained in the past.</p><br/><p>Although some people from Five Great Powers wanted to find trouble for You XiaoMo, there were rumors that You XiaoMo had been taken under the wing of a high level mage in the academy. No matter if it was true or false, this rumor was enough to compel them give the idea up.</p><br/><p>In the end, the Five Great Powers had no other alternative but to raise the quality of their magic pills. They struggled to increase their sales volume to previous levels, but were only able to get back one or two percent. In light of their previous actions, many felt that their conduct was too malicious. Therefore, some practitioners decided to buy from the other sellers instead.</p><br/><p>You XiaoMo took this matter as gossip as this did not affect his customer base. Instead, it helped to raise his name and attracted a lot of customers. However, the quantities of the pills that he refined were not enough to satisfy all of them. Therefore, he would direct most of the customers to Jiang XiaoFeng or BaiLi XiaoYu.</p><br/><p>Ever since he introduced Jiang XiaoFeng to Tang YuLin, the former had started working very hard. Though the amount of pills he could refine in a day was not much, but by virtue of his own efforts, he finally managed to rent a single person room.</p><br/><p>As for Liu Yue, if Rong Xuan had not told You XiaoMo, he would not have known that this youngster had joined the Yan group. Once in awhile Liu Yue would follow the Yan group into the mountains to hunt demon beasts, and every time he went through a lot of hardship. Liu Yue was now a four star Sun Realm practitioner. His pace of growth could not be said to be slow.</p><br/><p>A month was neither a long nor short length of time.</p><br/><p>You XiaoMo looked at the Black card in his hand. In this month, he has sold dozens of high-grade magic pills to Rong Xuan. Every pill cost more than twenty points. Now, the points in his card were more than three thousand.</p><br/><p>To reach five thousand points, he still needed about a thousand more. With a little more time, he could get a Purple card. But he had no patience left to wait, and to perform the exchange to a Purple card, there was an additional cost of five hundred points. It was really too absurd. Moreover, he had been looking forward to getting a skill training manual for the past few days. Thus, he decided to give up on getting the Purple card. Now, he probably had enough points in his card to trade for one or two high level skill training manuals.</p><br/><p>When he thought of this, You XiaoMo immediately put away the Black card he was holding.</p><br/><p>He had just finished selling all his magic pills yesterday. As he did not intend to refine pills today, he was planning to take a gander at the Skills Pavilion.</p><br/><p>Ling Xiao saw him coming down and recalled You XiaoMo’s restlessness these few days. He guessed You XiaoMo’s destination, and stood up and said, “I will accompany you, ba. Anyway, I also want to see what is in DaoXin Academy’s collection.”</p><br/><p>You XiaoMo nodded, and immediately went out together with Ling Xiao, leaving SheQiu and the others to look after the pavilion.</p><br/><p>DaoXin Academy had three treasures. The first treasure was the mountain range, which had many demon beasts and magic herbs. The second treasure was the rooms and pavilions that they were leasing, which was famous for being filled with spiritual energy. The third treasure was the Soul Training Pavilion and Skill Training Pavilion- You XiaoMo was heading to one of the two pavilions.</p><br/><p>You XiaoMo asked around, and heard that the Soul Training Pavilion and Skill Training Pavilion was the only place that Ward A and B students had in common. Although the location was not fixed, with a special method, students from both wards could enter and exit the same area from different locations.</p><br/><p>DaoXin Academy had five famous Elders. They were distinguished as the Fifth Elder to the Great Elder. The strength of the five famous Elders was unfathomable, and most of the Elders were very elusive. They rarely appeared in Ward B, but there was one Elder who was more commonly seen – that was the Fifth Elder who guarded the two pavilions.</p><br/><p>Using the transport circle, You XiaoMo and Ling Xiao were instantly transported to the periphery of the two pavilions.</p><br/><p>The two walked through a two hundred meter passageway. Besides them, there were also a few people who they did not recognize heading in the same direction. From the faint waves coming off their bodies, You XiaoMo estimated that none of their levels were lower than the Ward B students. They were probably students from Ward A.</p><br/><p>At the entrance of the West Pavilion, You XiaoMo saw the Fifth Elder.</p><br/><p>The Fifth Elder’s name was Dong Lin and he had a very distinct characteristic. That was his glossy and shiny black beard and hair. With a look, one would never forget it. Whenever anyone wanted to enter the two pavilions, they would have to get a blue jade plaque which functioned as a checkpoint pass.</p><br/><p>This was because the two pavilions were covered with an energy shield. The energy shield would not open without the blue jade plaques, and no one could forcefully break through the shield. Once the attempt was discovered, the most serious consequence was an immediate expulsion from the academy.</p><br/><p>Walking towards the Fifth Elder, You XiaoMo pulled Ling Xiao over to line up.</p><br/><p>Luckily there were not many people and it only took a moment before it was their turn. You XiaoMo took out his Black card and Ling Xiao’s Purple card and passed it to the Fifth Elder.</p><br/><p>Accepting the two cards, the Fifth Elder immediately took a measure their levels. His drooping eyelids twitched a little when he saw how low their levels were. These people were from Ward B, yet one of them had a Purple card – his capability should be quite high. But he did not say anything and after extracting the information on the cards, he handed You XiaoMo two blue jade plaques.</p><br/><p>“Many thanks to Fifth Elder!” After receiving the two plaques, You XiaoMo joyously gave his thanks before entering the pavilion with Ling Xiao.</p><br/><p>The Fifth Elder gave their retreating backs a light glance, and his gaze alighted on Ling Xiao’s figure. He gave a slight frown – the feeling that student gave him was a little strange.</p><br/><p>Before entering the Skill Training Pavilion, You XiaoMo passed Ling Xiao one of the plaques and following the student who just entered, placed the blue jade plaque in the indentation in the wall beside the door. There was also a thin layer of energy film covering the indentation, but after placing the blue jade plaque in it, the energy film disappeared. A hole big enough for a single person to pass through appeared in the energy shield covering the two pavilions. This hole would remain open for three seconds before closing up.</p><br/><p>When the two entered the energy shield, the smell of decadence wafted over to their noses…</p><br/>\n</div>"}