{"title": "Chapter 270", "id": 270, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-270", "volume_title": "Volume 3", "body": "<h1>Chapter 270</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Cat Ball, Cat Ball, how can it not fit!</p><br/><p>It was as if it was created to be on You XiaoMo’s Qiu team.</p><br/><p>The two conversed as they walked. When You XiaoMo mentioned that Teng ZiXin was Qiu Ran’s disciple, Ling Xiao was slightly astonished. There must be quite some ‘fate’ involved, but logically thinking, this matter could be traced.</p><br/><p>With Teng ZiXin’s family background, only a level nine or ten mage could take her as a disciple.</p><br/><p>Although level nine mages numbered one in ten thousand mages, they were not so rare as to let the Teng Family be afraid of the consequences. This was because the Teng Family also had level nine mages. Thinking over it carefully, it was very possible that Teng ZiXin’s master could only be Qiu Ran.</p><br/><p>However, this matter was no longer a concern for You XiaoMo.</p><br/><p>He had a premonition that in the next six months Teng ZiXin would not wish to see him. As for the reason, did it even need to be said?</p><br/><p>Once he thought about how the two’s relation changed from classmates to Shizi and Shishu, You XiaoMo nearly could not help cackling.(t/n: Shishu is Martial Uncle and Shizhi is Martial Niece)</p><br/><p>Seeing You XiaoMo’s stupid expression, Ling Xiao felt that his hand was very itchy and could not resist knocking You XiaoMo’s head a few times. Didn’t he see that the people walking past were all looking at him? He still dared to smile so stupidly, was it not embarrassing enough?</p><br/><p>They had not reached the pavilion yet, but You XiaoMo was impatient to know what the ‘meeting for the first time’ gift by Yan Fa was.</p><br/><p>Ling Xiao was also quite curious about what Yan Fa would gift to You XiaoMo. If he remembered correctly, Yan Fa was a practitioner and not a mage. He should not have many rare goods to give to Duan QiTian’s disciple.</p><br/><p>The gift was a squarish black box, and the size was a little bigger than You XiaoMo’s palm.</p><br/><p>The box felt ice-cold to the touch. As the jade box was very small, it could not hold many things inside.</p><br/><p>You XiaoMo opened the box, and the first thing he saw made his eyes widen.</p><br/><p>Ling Xiao stroked his chin, “This Yan Fa’s is quite generous, to the extent of being willing to part with a Red card. I remember that even in Ward A, those who hold Red cards do not number more than twenty.”</p><br/><p>That’s right. The ‘meeting for the first time’ gift that Yan Fa gave You XiaoMo was a red colored crystal card.</p><br/><p>Perhaps he knew of You XiaoMo’s speed of earning points. If he gave You XiaoMo a Purple card it would fail to embody his regard. Thus he gave You XiaoMo a Red card. This ‘meeting for the first time’ gift was not worth any less than the Thousand Illusion Cat Ball from Qiu Ran.</p><br/><p>You XiaoMo held the Red card and grinned in happiness, but when he turned it over, his smile disappeared from his face. He quietly grumbled, “What the hell, there’s not even a single point inside.” Rather than a crystal card, what You XiaoMo loved more were points, as that was something tangible.</p><br/><p>Hearing that, Ling Xiao smiled, “That’s easy to solve, just sell this Red card and you would have points.”</p><br/><p>“Eh… …” You XiaoMo choked for a moment, “If it’s like that, then forget about it, ba.”</p><br/><p>To sell the ‘meeting for the first time’ gift given by an elder in the blink of an eye, no matter how one dresses the matter up, it would give the impression that You XiaoMo considered everyone else beneath him, and was disrespectful to one’s elders. Moreover, if he wanted to sell a gift, he would sell the Thousand Illusion Cat Ball instead.</p><br/><p>After the two returned to the pavilion, the Thousand Illusion Cat Ball was immediately enthusiastically surrounded by SheQiu and the team.</p><br/><p>The tiny Cat Ball was cuter than PiQiu. In particular, its two big eyes, which were truly big, were bright and intelligent and looked like two glistening black precious stones. However, its strength was slightly lesser than PiQiu.</p><br/><p>SheQiu lazily commented, “Lucky brat.”</p><br/><p>The cold and elegant XiaoHei, “Yet another idiot has come.”</p><br/><p>The evil-looking and gorgeous MaoQiu, “How lucky.”</p><br/><p>The joyful and silly PiQiu, “I have gained another companion, later I will have someone to play with.”</p><br/><p>You XiaoMo, “… …”</p><br/><p>Ling Xiao laughed until his shoulders were shaking.</p><br/><p>Thus, Thousand Illusion Cat Ball did not need to change its name, and was directly called CatQiu. After it formed a contract with You XiaoMo, it formally became a member of the Qiu team. It was just nice that there were five members, as You XiaoMo was currently a level five mage. In the future, even if his Qiu team appeared in full force in front of others, he would not need to worry about there being any problems.t/n: Cat in chinese is Mao(), and Fur in chinese is also Mao(). Thus, we decided to leave it as CatQiu(Cat Ball) so people won’t confuse with the other MaoQiu (Fur Ball).</p><br/><p>Truth to be told, he actually had another egg. That egg was picked up in the Paradise Realm. After getting a hold of it, You XiaoMo did not see any demon beast that would hatch from that egg. It could be that the egg needed a longer incubation period.</p><br/><p>Afterwards, when PiQiu was playing, he knocked the egg into the lake. The egg did not have any reaction to being submerged, so You XiaoMo let SheQiu and the rest keep an eye on it. But after SheQiu and the team came out, they seldom stayed for a long time in the dimension. Therefore he was unsure of the current situation in the dimension. In addition, there were also two Hidden Dipper stink bugs inside.</p><br/><p>Speaking of that, he had not entered his dimension in a long time. The things inside were in a hideous mess as he did not have the time to organize them. It looked like he would have to find some time to pack his dimension.</p><br/><p>After forming the contract, You XiaoMo did not give the Shapeshifting Herb to CatQiu.</p><br/><p>The major reason was because Little CatQiu was given by Qiu Ran, and this gift would be known to some people.</p><br/><p>If others knew that Little CatQiu was not at level nine but could shape-shift, there would be trouble. Of course, the Shapeshifting Herb was not so rare that it had to be hidden away, but precautions should be taken primarily for safety reasons. Besides, Little CatQiu’s demon beast form was really cute.</p><br/><p>As for shape-shifting, You XiaoMo would wait till it cultivated to level nine before giving it a stalk of Shapeshifting Herb. This would help to increase the success rate of shape-shifting.</p><br/><p>The next day, You XiaoMo discussed a matter with Ling Xiao before he left.</p><br/><p>Right now, there was a possibility he would have to periodically go over to Duan QiTian’s place to learn. Thus the time he had to refine pills would lessen a lot, so in the future he could only depend on Ling Xiao.</p><br/><p>You XiaoMo tidied up his clothes, and looked back at Ling Xiao who was standing on the stairs, “You better not loaf on the job. If no one is willing to duel you at the arena, you can sell magic herbs. I have not finished using the magic herbs that you picked in the mountains, you can sell those. Or else, you can take a suitable amount of high-grade magic herbs to sell.”</p><br/><p>After hearing this, Ling Xiao beamed, “Aren’t you afraid that those high-grade magic herbs would attract people who would covet them?”</p><br/><p>You XiaoMo replied, “It’ll be fine if you don’t sell too much. Remember to raise the price a little more. I have a premonition that some people will definitely come to buy. We can’t let them take advantage of us any longer.”</p><br/><p>Then he took out the magic herbs that he had already prepared from his dimension.</p><br/><p>As he did not have such a large jade box like Tang YuLin’s, he could only store it in his magic bag. As long as the storage time was not too long, it would not have too much of an impact on the grade of the magic herb.</p><br/><p>Ling Xiao did not have much interest in dueling in the arena. The wins did not carry a sense of achievement as it was like an Emperor Realm practitioner bullying a Sky Realm practitioner. Therefore, he did not have any objection to what You XiaoMo said.</p><br/><p>After determining the price of the magic herbs, and passing the magic pills he had refined over the past two days to Ling Xiao, You XiaoMo solemnly entrusted Ling Xiao with his task and left the pavilion.</p><br/><p>The teachers in Ward B stayed in the Chrysanthemum Courtyard, but that did not include Duan QiTian.</p><br/><p>Although Duan QiTian was also one of the many high leveled mages in the academy, he had a separate courtyard which was next to the Chrysanthemum Courtyard. His courtyard also had a large magic herb field. It was said that the magic herbs in the field had been planted for several decades – most were mid-grade magic herbs, and some were approaching maturity.</p><br/><p>When he reached the Orchid Courtyard where the old geezer lived, You XiaoMo saw the man who brought him to see the old geezer yesterday.</p><br/><p>The man was not surprised at his arrival, and had a neutral expression on his face. He did not let out a fraction of a flattering expression just because You XiaoMo was the old geezer’s disciple, and merely directly brought him to the old geezer. The man only told him that the old geezer was in the Pill Refining Room, and let him enter to look for the old geezer himself.</p><br/><p>You XiaoMo looked back at the silhouette of the man, and felt that this person was rather odd. Nevertheless, he did not think much over it, and pushed open the door of the Pill Refining Room and entered.</p><br/><p>The old geezer’s Pill Refining Room was colossal. After he entered, he did not see signs of anyone present.</p><br/><p>You XiaoMo searched every single room, and finally found a trace of the old geezer in the innermost room which was the largest.</p><br/><p>Through the door, he could feel great fluctuations in energy coming from the room. Just when he was hesitating to enter, the old geezer’s cold and detached voice sounded from inside, “You still haven’t come in?!”</p><br/><p>You XiaoMo did not hesitate further, and pushed open the door and walked in.</p><br/><p>The first thing he saw was Duan QiTian’s back. Duan QiTian was standing in front of a gigantic caldron that was two meters tall and one meter wide, and the energy fluctuations were coming from the caldron.</p><br/><p>The old geezer’s imposing voice sounded again, “Give me the magic herbs that are on the second shelf on the right.”</p><br/><p>Although he felt that the old geezer’s behavior was a little strange in all aspects, You XiaoMo still followed his instructions. Walking over, he discovered that there were thirty to forty stalks of magic herbs on the second shelf. He faltered, and then asked, “Shifu, there are many herbs here. Which one do you want?”</p><br/><p>“You dunce, I want you to bring over all the magic herbs!” The old geezer bluntly scolded.</p><br/><p>You XiaoMo frowned. This address of ‘dunce’ was very familiar to him. It was clearly a catchphrase belonging to the person who he had instructed to sell magic herbs and pills this morning – Ling Xiao! However, when it was said by the old geezer, it was slightly different from Ling Xiao’s tone.</p><br/><p>Ling Xiao was always beaming while scolding others, but the old geezer’s face was cold, and looked like someone had owed him several thousand points.</p><br/><p>You XiaoMo restrained himself, and brought the magic herbs to the old geezer.</p><br/><p>The old geezer did not even look at him and said, “Throw them all into the caldron.”</p><br/><p>You XiaoMo frowned. The caldron was very tall, did the old geezer intend for him to stand below and throw the herbs stalk by stalk up into the caldron? Just as he was thinking of doing that, he spied a wooden ladder beside the caldron. Thus, he borrowed the ladder and climbed up. You XiaoMo looked into the caldron, but could not see anything. It was as if the exterior of the caldron was blocked by a layer of some mysterious thing. He could not see what was inside, and immediately threw the magic herbs in the sieve into the caldron.</p><br/><p>“You dunce, hurry up and come down. You still need me to remind you about this too?” The old geezer’s annoying voice sounded once again. You XiaoMo did not know what medicine he had eaten, he seemed to have turned into a different person.</p><br/><p>You XiaoMo looked at the old geezer who had his eyes closed with a cold and detached expression on his face, and climbed down the stairs and stood at one side.</p><br/><p>The old geezer did not say anything else, and his whole body was suddenly like a piece of wood, not even a single muscle moved. Looking at him, You XiaoMo did not think he was refining pills, but that was not possible. If not, why would the geezer ask him to throw the magic herbs into the caldron?</p><br/><p>You XiaoMo could not understand this.</p><br/><p>If the old geezer was refining pills, why did he just stand still? Could it be he could refine pills just by standing still?</p><br/><p>You XiaoMo’s brain couldn’t help but come up with a picture.</p><br/><p>An old geezer was standing in front of a caldron with bright and shiny eyes, and he stared at the caldron and chanted, “Give me pills, give me pills, give me pills… …”</p><br/><p>“Pu -” He was struck by his own imagination, and You XiaoMo could not help but do a spit-take.</p><br/><p>The next second, he felt a bunch of eyes looking at him with laser-like intensity.</p><br/>\n</div>"}