{"title": "Chapter 274", "id": 274, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-274", "volume_title": "Volume 3", "body": "<h1>Chapter 274</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>While You XiaoMo was looking at the encyclopedia, Ling Xiao was randomly browsing Duan QiTian’s library.</p><br/><p>After approximately half an hour, the old geezer finally got up from bed. The first place he went to was the study. Opening the door and entering, he found You XiaoMo flipping through the encyclopedia. When he caught sight of the old geezer, his movements abruptly froze, and he stiffly looked at the old geezer.</p><br/><p>This old fart gave him trouble for two continuous days. Who knows what other tricks he will play this time?</p><br/><p>“Tu Er, why did you come so early today?”</p><br/><p>When the old geezer caught sight of You XiaoMo, he let out an expression of happiness. With his compassionate and benevolent appearance, he looked just like a normal elderly person at a first glance.</p><br/><p>You XiaoMo felt a headache coming on and groaned. Did this old fart want to toy with him again? He had clearly used this same method yesterday. Did he think that You XiaoMo will be fooled again?</p><br/><p>“Shifu, didn’t you have enough fun fooling around? This time I won’t fall for your tricks again!”</p><br/><p>Hearing this, the old geezer was surprised, but soon after he replied, “Tu Er, Shifu is not fooling around, and Shifu also didn’t lie to you. You must believe Shifu.” When he finished speaking, he rushed over and attempted to hold You XiaoMo’s hands.</p><br/><p>Startled by the old geezer’s actions, You XiaoMo jumped up from the ground, and swiftly ran and hid behind Ling Xiao. With an expression stating ‘I won’t believe you anymore’, he said, “I don’t believe you. Yesterday you caused me to fall into the lake. What kind of tricks are you trying to play today? Let me tell you, this time I definitely won’t accompany you.”</p><br/><p>The old geezer mournfully looked at You XiaoMo, “Tu Er, Shifu is really not lying to you.”</p><br/><p>You XiaoMo peeked out from behind Ling Xiao, and suspicion was written all over his face. However, when he took a closer look at the old geezer’s expression, he did not feel that the old geezer was putting on an act. If he was really acting, You XiaoMo believed that the old geezer could win an Oscar.</p><br/><p>Ling Xiao held You XiaoMo’s hand, and gave the old geezer an once-over, “He’s presumably not acting.”</p><br/><p>He should be able to perceive if Duan QiTian had ulterior motives.</p><br/><p>You XiaoMo was convinced from Ling Xiao’s words and asked, “Shifu, what is going on?”</p><br/><p>The old geezer sighed, “This matter is a long story.”</p><br/><p>You XiaoMo said, “Then make the long story short.”</p><br/><p>The old geezer, “… …”</p><br/><p>In truth, the matter was not that complicated. Indeed, the old geezer had dual personalities, instead of the three or four personalities that You XiaoMo guessed. If he had more, he would have died of schizophrenia a long time ago.</p><br/><p>Not many knew that the old geezer had dual personalities. This was because whether it was the first or second personality in control, there was no significant difference in the old geezer’s behavior. Even Qiu Ran, his eldest disciple, did not know about this matter, thus one could see how deeply the old man was hiding this.</p><br/><p>The second personality came into existence one hundred years ago. At that time, the old geezer was only a level nine mage. The second personality came about when he was advancing to a level ten mage and encountered a hiccup while cultivating. In the end his psyche was split up into two personalities.</p><br/><p>Originally, it was not a problem if other people found out about this. But the crux of the matter was that the old geezer’s first personality was unable to refine level ten pills – only when the second personality was in control could he refine them.</p><br/><p>This was a very strange situation and even the old geezer could not figure it out.</p><br/><p>Thus, a hundred years passed in this manner. Till today, he still had not found a solution.</p><br/><p>Moreover, because the switches between the two personalities were unpredictable, each alter ego was unsure when they would appear. Therefore, this was equivalent to a ticking time bomb where none knew when it would explode.</p><br/><p>“Shifu, what you said just now was a little complicated. I didn’t quite understand. Why don’t you repeat what you said again?”</p><br/><p>You XiaoMo mused over it, but he still did not understand why this situation could not be known by others. Although the first personality could only refine level nine pills, to be able to refine level nine pills was already very amazing!</p><br/><p>The old geezer, who was waiting for his disciple to console him, plaintively eyed You XiaoMo when he heard that sentence.</p><br/><p>In actual fact, he did not intend to tell his little disciple about this. Who knew after meeting him again a month later, his little disciple actually saw through him in one glance. Therefore, he could only tell You XiaoMo the truth, lest he spill the beans to someone else.</p><br/><p>Ling Xiao injected, “Is Qiu Ran related to the reason why you are not able to disclose this?”</p><br/><p>The old geezer looked at him in astonishment, and then he looked back at You XiaoMo. Suddenly the scales fell from his eyes, and he exclaimed, “So that’s how it is!”</p><br/><p>You XiaoMo said, “Shifu, why is it getting more difficult to understand what you’re saying?”</p><br/><p>The old geezer told Ling Xiao in sympathy, “It’s been hard for you.”</p><br/><p>Ling Xiao’s mouth twitched. He eyed You XiaoMo with an expression that was like a smile yet not and replied, “It’s not hard, and I have already gotten back both my principal and interest.”</p><br/><p>You XiaoMo, “… …”</p><br/><p>Just when he was about to blow his top, Ling Xiao finally told You XiaoMo of his conjecture.</p><br/><p>It was previously mentioned that in the Long Xiang Continent, there were two level ten mages – the old geezer and Qiu Ran. Although Qiu Ran was the old geezer’s eldest disciple, the relations between master and disciple was not as pleasant as what was portrayed to outsiders.</p><br/><p>In actual fact, if it was not for the old geezer suppressing Qiu Ran, Qiu Ran would have long flipped the heavens.<strong>t/n: flipped the heavens means all hell breaking loose.</strong></p><br/><p>Therefore, Qiu Ran cannot have knowledge of the existence of the second personality.</p><br/><p>The old geezer sighed, “Although Qiu Ran is my eldest disciple, it has been years since he was under my influence. He has long changed to harbor improper schemes, so I have always been worried. If he knew about my situation, he would no longer have any misgivings before attempting something.”</p><br/><p>A level ten mage who was harboring improper schemes – if there was no one suppressing him, he would certainly be an enormous catastrophe to the Long Xiang Continent.</p><br/><p>You XiaoMo asked, “Shifu, other than me, who else knows about you having dual personalities?”</p><br/><p>The old geezer solemnly replied, “Besides the two of you, the people in the know are the principal and vice-principal. They are old friends from my youth and would never reveal this. So you guys must also help me keep this a secret.”</p><br/><p>You XiaoMo immediately nodded, “Rest assured Shifu, we absolutely won’t reveal this to anyone.”</p><br/><p>The old geezer looked at Ling Xiao.</p><br/><p>You XiaoMo followed his gaze and looked at Ling Xiao too.</p><br/><p>Ling Xiao helplessly surrendered, “Okay, I won’t tell anyone about it too.”</p><br/><p>You XiaoMo said, “Shifu, you can rest easy now.”</p><br/><p>The old geezer, “… …” How could he be assured without even a single vow? For such an important matter, did these two intend to use a single sentence to skimp on their promise of guarding this secret?</p><br/><p>Unfortunately, You XiaoMo could not read the expectation in the old geezer’s eyes. He was also not the type of person who would carelessly swear a vow. Ever since he knew that taking a vow would let the heart demons enter his mind, he did not dare to casually swear a vow.</p><br/><p>The old geezer did not feel comfortable to directly request a vow. However, he was willing to believe in his disciple’s integrity. At any rate, he had personally observed You XiaoMo for a few days; even if he had doubts he would just have to believe in his own eyes.</p><br/><p>This day was full of fulfillment for You XiaoMo.</p><br/><p>Not only did the first personality of the old geezer not order him around, he also took the initiative to teach him about pill refining. With only a day, he felt that he had learnt a month’s worth of knowledge, and it was much more than what he learnt in the past two days.</p><br/><p>As the night fell, for the first time, You XiaoMo felt reluctant to leave.</p><br/><p>You XiaoMo hugged the old geezer’s arm and said, “Shifu, I cannot bear to leave you.”</p><br/><p>If you switch into the second personality tomorrow, he will become extremely miserable. This was the first time he had wished that the twelve hours could be indefinitely extended.</p><br/><p>“Then just don’t leave.”</p><br/><p>You XiaoMo lifted his head, and saw the old geezer menacingly looking at him. If this wasn’t the second personality, what else could it be? All of a sudden, You XiaoMo felt like crying but he had no tears left. Old man, please don’t switch on the spur of the moment ah. At least give him a warning first ah.</p><br/><p>The old geezer gave a cold snort, “If you don’t want to leave, then stay behind. It just so happens that I am still missing… …”</p><br/><p>The old geezer had not finished speaking before You XiaoMo dragged Ling Xiao and ran away without looking back.</p><br/><p>The old geezer, “… …”</p><br/><p>Only when he ran out of the old geezer’s courtyard did You XiaoMo stop while heavily panting. The second personality was really getting more and more terrifying. If this continued, sooner or later, he will really be tormented to death.</p><br/><p>Ling Xiao laughed in delight, “That second personality is really interesting.” With the alter ego switching without warning and with his deathly explosive temper, no wonder You XiaoMo could not stand him. He was probably yelled at more than ten times a day.</p><br/><p>You XiaoMo gave Ling Xiao the cold shoulder and muttered, “Interesting my ass.” He was not the one suffering the old geezer’s mood swings.</p><br/><p>Ling Xiao patted his head in consolation, “Think about it, that old man’s temper is so explosive. He would definitely scold everyone in sight, right?”</p><br/><p>You XiaoMo paused, then he nodded. What Ling Xiao said was not wrong. He did see the old geezer repeatedly scolding the man cleaning the yard being. But he probably got used to it, as every time the man was scolded, he always had an expressionless face.</p><br/><p>Ling Xiao continued, “If he’s even so fierce to you who is his disciple, then you should think about when Teng ZiXin will be scolded by the old geezer.”</p><br/><p>You XiaoMo’s eyes brightened. All right, he was comforted now.</p><br/><p>Sure enough, people needed something to compare with to regain their mental equilibrium.</p><br/><p>After half a month, his wishes were finally fulfilled.</p><br/><p>It was a new day, and when he went to the old geezer’s place, he met Teng ZiXin who was also on her way to find the old geezer.</p><br/><p>This time, Teng ZiXin was not by herself. Following her was the beauty he met at the Skill Training Pavilion. The beauty’s expression was quite complicated when saw him. She glanced at Teng ZiXin, and as expected, Teng ZiXin’s expression had changed.</p><br/><p>You XiaoMo did not want to walk along the same road as them, thus he picked up his pace. But who would have thought that Teng ZiXin also sped up. In the end, the two were sharing the same route. Just when he thought that this Missy was preparing to unrelentingly fight for superiority with him, Teng ZiXin suddenly revealed a faint smile.</p><br/><p>“You-shishu, you are the one with seniority, please go ahead!”</p><br/><p>You XiaoMo’s expression revealed a hint of surprise. They did not see each other for half a month, and Teng ZiXin suddenly become better at concealing her real feelings. Now, she could even smile at him. Did she become so abnormal, because she was stimulated by something?</p><br/><p>Despite all his doubts, You XiaoMo did not decline her offer to walk in front of her.</p><br/><p>It was natural for the Shizhi to let the Shishu pass first. There was nothing awkward about it!</p><br/>\n</div>"}