{"title": "Chapter 272", "id": 272, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-272", "volume_title": "Volume 3", "body": "<h1>Chapter 272</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><br/><p>Translated by Rara of Exiled Rebels Scanlations</p><br/><p>The next day, You XiaoMo woke up early. Although he still had to go to the old geezer’s place, he didn’t forget his daily task: refining pills.</p><br/><p>After he had refined today’s portion, You XiaoMo directly gave them all to Ling Xiao who was just idling his time away. For a level five mage, refining level four pills was a piece of cake, so his speed was fast.</p><br/><p>Afterward, he left for the old geezer’s place, but when he got there, he couldn’t find the one that was here before, so he just went straight to the old geezer’s room. That old geezer’s room was at the rear of the Pill Refining Room, however, he didn’t have to wait for his shifu to come and he already saw not far from here, a person was crouching on the magic herb field. Judging from the back, it was that stinky old geezer.</p><br/><p>You XiaoMo tread lightly toward him, then extended his head out and saw the old geezer was fiddling with the herbs, You XiaoMo carefully opened his mouth, “Shifu, is there anything to do today?”</p><br/><p>The old geezer turned his head around while revealed an airy smile upon his arrival, “Tu Er, you came.”</p><br/><p>You XiaoMo was speechless. This tone, this smile, this seemed to be the first personality, but then he couldn’t be careless, who knows if this was the second personality trying to fix him, “Shifu, how are you feeling today?”</p><br/><p>“Not bad ah!” The old geezer nodded, “Come help me remove all the weeds.”</p><br/><p>Hearing that, You XiaoMo let out a sigh of relief, looked like today was the first personality.</p><br/><p>As You XiaoMo crouched down and looked at the field filled with weeds, he remembered that within the magic herb field inside his dimension weeds would occasionally appear, but was never much. This might be due to the different planting location, so he never had to spend too much time removing weeds.</p><br/><p>An hour later, he finally finished pulling out all the weeds, when he stood up, he didn’t see the old geezer’s figure anywhere.</p><br/><p>You XiaoMo walked to the lakeside to wash his hand and also swept down all the soil and grass off his clothes, but when he straightened up his back, a familiar roar unexpectedly came from behind his back.</p><br/><p>“You XiaoMo, you idiot, how long are you going to take just to wash your hands!”</p><br/><p>Plop ——</p><br/><p>Following the old geezer’s angry roar was the sound of You XiaoMo falling into the water due to shock. The lake’s tranquility was disturbed as water splashed everywhere and You XiaoMo drowned in it.</p><br/><p>A minute later, You XiaoMo slowly surfaced. As wet as a rat, he looked at the old geezer standing not far away with a face full of smug joy toward his misfortune. Seeing that annoying expression, he was completely certain that this old geezer was obviously fooling around with him.</p><br/><p>“Idiot, why are you still standing still and not coming up fast. You can’t even handle such a tiny matter well, and yet you want to be this Duan QiTian’s disciple. If you don’t feel humiliated, I feel humiliated for you!” The old geezer was standing proudly and arrogantly at the lakeside while watching him.</p><br/><p>You XiaoMo climbed out of the lake, unfortunately, his body was soaked from head to toe.</p><br/><p>The old geezer simply couldn’t see how bad his action was, so he just casually instructed, “Go change your clothes, then go to the Pill Refining room and organize the herbs on the shelves.”</p><br/><p>You XiaoMo paused a bit. You stinky old geezer, one day I will make you pay.</p><br/><p>After he had changed into new clothes, he went to the Pill Refining Room. This was the second time he saw the cauldron inside the room, and he immediately recalled the image of the old geezer refining pills yesterday, that technique of his really gave him an itch, and precisely why he had to tolerate that old geezer.</p><br/><p>If it had not been for this goal, he believed, no one would ever be able to stand this second personality. Such an awful personality to the extreme, in order to fool him, he even pretended to be the first personality. But there was a thing he couldn’t get a hang of, why was this second personality still taking charge for two consecutive days. Was there a special condition for the first personality to show up?</p><br/><p>You XiaoMo kept on thinking while sorting out the herbs. But in the end, he still didn’t figure out, after all, he had not had much contact with the old geezer.</p><br/><p>The old geezer didn’t wait for him to finish as he came again, seeing him still sorting out the herbs, his complexion became gloomy, “Are you an idiot? Even organizing the herbs took you this long!”</p><br/><p>You XiaoMo, “…”</p><br/><p>Bloody god, he could even blame him about this?</p><br/><p>Couldn’t be!</p><br/><p>Dammit, if those herbs were all mid-level herbs, then he was certain to say he could recognize most of them, but those piles of herbs, there was always one or two stalks of high-level herbs mixed in between. Moreover, some magic herb’s appearances were almost identical, if he didn’t carefully identify them, it would be easily mistaken!</p><br/><p>Likewise, he didn’t just sort them out then toss them into the same pile, he had to put them into the jade cabinet on the opposite side. Each unit of the cabinet was marked with the herb’s name, he could recognize the words, but he didn’t know which herb corresponded to which unit.</p><br/><p>You XiaoMo calmly said, “Shifu, there are some level six herbs and level seven herbs I don’t know.”</p><br/><p>The old geezer looked down upon him and scolded, “Are you really the freshman that has the highest potential? Even Teng ZiXin could do better than you.”</p><br/><p>You XiaoMo,”…”</p><br/><p>Seeing him speechless, the old geezer knew he poked right at You XiaoMo’s sensitive spot, so he showed some mercy. “From now on, go to the study room everyday for two hours. That place has numerous illustrated handbooks for magic herbs. If you can’t study everything in a month, then don’t go out and tell people you are my disciple.” After finishing his sentence, he left.</p><br/><p>Sir, you simply have never seen me as your disciple, You XiaoMo cursed.</p><br/><p>But he couldn’t say this was a very big pleasant surprise, he had long been targeting the old geezer’s study room.</p><br/><p>Yesterday when he went to clean the study room, he found out the books inside there were way more than what TianXin sect’s library have, his approval gave him so much thrill that he wished he could just sleep in the study room.</p><br/><p>The old geezer’s study room had tons of collections. Some were even valuable treasures. Unless one had his consent no one could charge in without receiving a heavy penalty from the academy.</p><br/><p>But for You XiaoMo, after getting his approval, he could easily access using his card.</p><br/><p>The first thing that caught his eyes was something that looked like a pillar, tall and big, filled with books and bookcases. This could be considered as one of the major assets of the study room. Sadly enough, in order to take those books on the top, you need to climb the ladder, which was quite troublesome.</p><br/><p>Yesterday when he was cleaning the room, You XiaoMo also discovered another thing.</p><br/><p>Perhaps because the old geezer was a high rank mage, so he let the previous helper clean the room and arrange the books according to the level. But this was not in the order people would usually think from low to high, but from high to low, which means, the uppermost bookcase was the low level, and so on.</p><br/><p>Such behavior was clearly to irritate someone else other than the owner.</p><br/><p>You XiaoMo was not tall enough, and he had no other choice but to climb the wooden ladder to find the illustrated handbook of magic herbs. Fortunately, he only needed to climb only once to find exactly what he needed. These two magic herb encyclopedias had a very ‘considerable’ thickness, he had to go up and down two times to bring them down, and nearly cause him to fall down the wooden ladder.</p><br/><p>Holding the encyclopedia of level six magic herbs inside his hand, You XiaoMo took a deep breath.</p><br/><p>No wonder the old geezer gave him a month. To remember such a thick magic herb encyclopedia was quite a challenge.</p><br/><p>But no matter how hard it was going to be, he still wanted to learn it, because he didn’t want the old geezer to compare him to Teng ZiXin the next time. One time was enough to make him vomit.</p><br/><p>Opening the encyclopedia, You XiaoMo’s eyes glistened, this was the most completed encyclopedia he had ever read. Each herb that was introduced was very detailed, even more specific than those books inside the library of the TianXin Sect, and some of those herbs also had handwritten notes next to it, which must be written by the old geezer himself. And not to mention, lots and lots of varieties of herbs.</p><br/><p>You XiaoMo hadn’t visited the academy’s library yet, but he believed that the books over there wouldn’t be as complete as the one here.</p><br/><p>Just like a sponge, You XiaoMo began to absorb the knowledge inside the encyclopedia like crazy, some of them he had already knew about, but he still revised them again once more.</p><br/><p>Two hours passed and You XiaoMo had never felt time would fly this fast.</p><br/><p>You XiaoMo closed the encyclopedia and was somewhat unsatisfied. When he was about to put back the encyclopedia, he suddenly heard the old geezer’s roar came from outside. Yet again another sudden shout came, and You XiaoMo nearly missed a footstep right there.</p><br/><p>“You XiaoMo, you better roll your ass out here when you’re done reading.”</p><br/><p>That stinky old geezer really needed to fix his temper! If he continued scaring him like that everyday, he was really worried that someday he would go psycho from shock. Then he returned the books and immediately left the study room.</p><br/><p>The old geezer’s voice came from the Pill Refining room, it must have not been easy for him to shout this loud, yet he could hear his voice loud and clear. Was this the benefit from regularly shouting?</p><br/><p>The old geezer was refining pills at the moment. Just like the last time, he was standing in front of the cauldron, however this time You XiaoMo could feel the geezer’s soul power flooding the room. The old geezer had him toss the herbs into the cauldron, and he saw that all the herbs going to be used this time were all level four. Furthermore, each type of herb had ten stalks. Did he want to refine ten pills at once?</p><br/><p>Following the doubt, You XiaoMo threw all the herbs into the cauldron.</p><br/><p>The geezer said, “Use your soul to feel the refining process.”</p><br/><p>You XiaoMo furrowed his eyebrows, use the soul to feel? He carefully asked, “Shifu, do you mean the soul power?”</p><br/><p>The geezer suddenly opened his eyes and glared at him, “Are you an idiot? Even clueless about this matter!”</p><br/><p>You XiaoMo, “…”</p><br/><p>Although on the surface his scold was very harshful to ear, he still explained to him.</p><br/><p>The old geezer said soul as in the soul perception. Slightly different to the soul power, the soul perception was an invisible existence, precisely to say, it was a state. No matter how many practices one had gone through, the soul perception will never form into shape, so speaking through a mage’s point of view, the soul perception was something one may come by through luck, but not by searching for it. Since it was a type of opportunity, if one’s luck wasn’t so bad, one maybe able to understand what others couldn’t.</p><br/><p>What the hell was the soul perception? You XiaoMo silently gave the old geezer the middle finger inside his mind.</p><br/>\n</div>"}