{"title": "Chapter 282", "id": 282, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-282", "volume_title": "Volume 3", "body": "<h1>Chapter 282</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 282: There’s No Taste</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>The next day, the second round of the competition began.</p><br/><p>Before leaving, You XiaoMo released PiQui and CatQiu who had been locked up for the whole night. When the two had been freed, they did not dare to make trouble again. Under You XiaoMo’s threats, they guaranteed that they definitely would not run amok again.</p><br/><p>However, You XiaoMo was still not assured, thus he asked MaoQiu to keep an eye on the two beasts before he felt relieved enough to be able to leave with Ling Xiao. Compared to SheQiu and XiaoHei, MaoQiu was easier to talk to.</p><br/><p>There were some strong participants who were eliminated after yesterday’s battle royale, but it did not affect everyone’s anticipation of the second round of competition.</p><br/><p>When the two arrived, the seats at the venue of the second round had been filled.</p><br/><p>You XiaoMo sat in Ling Xiao’s seat, and Ling Xiao went onto the stage with the nineteen other participants to draw lots. As he was the winner of the first round, he was the first to draw a lot.</p><br/><p>In front of Ling Xiao was a box containing his name and the names of the rest of the participants. If he drew his own name, he would not be able to try again, as every person only had one chance at the ballot.</p><br/><p>Ling Xiao drew a lot, and handed it to the teachers standing at the side after looking at it. Methodically, the other participants also drew their lots.</p><br/><p>When Ling Xiao came down from the stage, You XiaoMo immediately asked, “Whose name did you get?”</p><br/><p>Ling Xiao thought for a while before replying, “A name I didn’t recognize.”</p><br/><p>Black lines appeared on You XiaoMo’s face, “You recognize a lot of people in the academy ma?” He felt that in the whole academy, there were only a few students that Ling Xiao could remember.</p><br/><p>Ling Xiao smiled at him, “I should recognize about ten ba.”</p><br/><p>The results of the ballot were soon revealed.</p><br/><p>The opponent that Ling Xiao drew was a participant who liked to fish in troubled waters. After he realized that Ling Xiao drew his name, he totally lost the will to fight.<strong>t/n: to fish in troubled waters means to take advantage of a crisis for personal gain</strong></p><br/><p>There was also a match where one participant had drawn Ling Xiao’s name. Unfortunately, that person who drew his name was Qin Zhang.</p><br/><p>Qin Zhang was the tenth ranking student in Ward B, and his strength was slightly lesser than Teng Jian and Chai Tian. With a single glance at Ling Xiao, he knew that he had no chance of winning.</p><br/><p>After the competition began, the first match was between Ling Xiao and the hapless student who had been chosen by him. The audience originally thought that they would be able to see an overwhelming match, but the ending was more than thoroughly overwhelming, as the participant admitted defeat before even stepping onto the stage. Unsurprisingly, Ling Xiao got the first point.</p><br/><p>The result immediately caused everyone to sigh incessantly. Whatever the outcome, shouldn’t he just fight for a bit?</p><br/><p>However, many did not feel that the participant’s actions were stupid and cowardly. There was already a huge gap in their strengths. If they were in his shoes, they would have probably done the same, because no one was willing to be swept out of the ring with a single slap from their opponent.</p><br/><p>Despite not being able to see an intense battle in the first match, the latter matches were made of the stuff of dreams. The participants included the first and second ranking students in Ward B, and it was quite an intense fight.</p><br/><p>Following that was Rong Xuan’s match. Rong Xuan was ranked fourth and his opponent was ranked fifteenth. The result of the match was as expected. This continued until the afternoon, when it was finally time for Ling Xiao’s second match.</p><br/><p>You XiaoMo happily told Qin Zhang, “Big Brother Qin, try your best. You must not lose to Ling Xiao.”</p><br/><p>Qin Zhang did not know whether to laugh or cry, “Fellow Brother You, you are thinking too highly of me.”</p><br/><p>You XiaoMo replied, “That… If it were someone else, I would be looking down on them!”</p><br/><p>Ling Xiao leaned over, “How about me?”</p><br/><p>You XiaoMo beamed and replied, “Remember not to let Big Brother Qin lose too miserably.”</p><br/><p>Ling Xiao turned his head and looked back at Qin Zhang, “Okay!”</p><br/><p>Qin Zhang, “… …”</p><br/><p>After the match began, Qin Zhang did not immediately admit defeat like the first competitor. He tenaciously went for a round with Ling Xiao and after hitting a record he candidly stepped off the stage and admitted his defeat.</p><br/><p>The next day, the results for the competition for Block One were finally out.</p><br/><p>The first place went to Ling Xiao, who fully deserved his placement. The second place went to the student ranked first in Ward B and the third place went to Rong Xuan. Although Qin Zhang lost to Ling Xiao, he was fortunate enough to take the ninth place, and managed to slip into the top ten.</p><br/><p>The top three participants were able to receive rewards. The participants had the choice of two forms of rewards – the first was in points; the other was in materials and the like. The participant could only choose one of the two.</p><br/><p>For the first place, the reward was a thousand points. If one did not want points, one could choose materials such as magic herbs or demon beasts. Ling Xiao chose to receive his reward in the form of materials as he could earn points by himself. The second and third place both chose to take up points.</p><br/><p>Thus, the competition for Block One ended in this manner.</p><br/><p>If not for the Teng and Chai Family experiencing a complete wipeout in the first round of the competition, perhaps the competition would have been more entertaining to watch.</p><br/><p>You XiaoMo and Ling Xiao left the competition venue together. The two did not immediately return to the pavilion, instead, they headed to the sales area for demon beasts.</p><br/><p>After ‘saving’ PiQiu and CatQiu from the cage, the two beasts had been clamoring to eat the monster fruits. They had probably been enthralled by the monster fruits. Finally, You XiaoMo had to relent, and promised to buy some for them.</p><br/><p>The sales area was for the buying and selling of demon beasts, but there should be people specializing in selling monster fruits as only demon beasts liked to eat monster fruits. You XiaoMo was planning to look for the youth who gave PiQiu and CatQiu monster fruits to eat.</p><br/><p>That youth was still selling demon beasts at the same position, but his stall was not as lively as the last time. Catching full sight of You XiaoMo, his face rapidly paled.</p><br/><p>“Wasn’t the matter resolved the last time? Is there anything else you want?” Assuming that You XiaoMo was here to look into the previous matter, the youth was somewhat nervous.</p><br/><p>You XiaoMo immediately explained what he wanted, “I’m not here to look into the previous matter. It’s like this, after I brought them back, they kept thinking about () the monster fruits. So I want to ask, do you still have monster fruits? If you do, could you sell some to me?”</p><br/><p>The youth abruptly let out a sigh of relief, “I do, but one monster fruit costs ten points. How many do you want to buy?”</p><br/><p>Monster fruits were one of the specialties found in the mountains. It mainly grew in the outlying areas of the mountains, but as there often demon beasts wandering near the monster fruits, some risks needed to be taken to harvest the fruits. Thus, the price for monster fruits was high.</p><br/><p>Not many could afford it, and most would occasionally buy a single fruit, as demon beasts did not have to subsist on monster fruits only.</p><br/><p>One fruit for ten points was really quite expensive.</p><br/><p>You XiaoMo mused over it before saying, “Give me fifty fruits.”</p><br/><p>The youth gasped in surprise, and looked at him with disbelief, “Are you sure you really want fifty fruits?” He had thought that this person would only want two at the most. This quantity had already greatly exceeded his highest expectations.</p><br/><p>You XiaoMo nodded with certainty, “Is there a problem?”</p><br/><p>Although only PiQiu and CatQiu said that they wanted to eat monster fruits, many demon beasts loved monster fruits, so SheQiu and the rest should also like them too. In his view, fifty fruits were already a conservative estimate.</p><br/><p>“No, no, no… …” The youth promptly shook his head, with a look of joy on his face.</p><br/><p>The youth did not carry that many monster fruits around, as his stock was stored at his residence. Thus, he packed up his stall and headed to his residence with You XiaoMo and Ling Xiao. Fifty monster fruits would net him a large profit so he had no qualms about closing his stall early. After the transaction, the two left the youth’s residence.</p><br/><p>You XiaoMo held out a monster fruit for a look. The appearance was not much different from an ordinary Spiritual fruit. It was only a little bigger than a Spiritual fruit, and the flesh of the fruit was red.</p><br/><p>Thinking of CatQiu, You XiaoMo frowned, “Ling Xiao, do you think CatQiu would be able to finish one fruit?” CatQiu’s body was the same size as the monster fruit in his hand, and he really doubted it could finish the fruit.</p><br/><p>Ling Xiao stared the monster fruit in his hand, then he turned his gaze away and replied, “Don’t look down on beasts, they have monstrous appetites.”</p><br/><p>You XiaoMo sniffed the fruit, but he could not smell any fruity fragrance, and could not help but wonder, “Is it true that only demon beasts can smell this? It is really that delicious?” He suddenly had an urge to take a bite.</p><br/><p>Ling Xiao smirked, “Why don’t you try it out?”</p><br/><p>What a great idea!</p><br/><p>He had never eaten such a bright red fruit before.</p><br/><p>You XiaoMo took out another monster fruit. After cleaning them a few times, he passed one of the fruits to Ling Xiao with a smile, “You should also try one.”</p><br/><p>Ling Xiao did not hesitate and took a bite.</p><br/><p>You XiaoMo asked, “How is it?”</p><br/><p>Ling Xiao replied, “Not bad.”</p><br/><p>You XiaoMo’s eyes brightened. He lifted up the monster fruit he was holding and took a bite. When the flesh of the fruit entered his mouth, he frowned and shuddered. With his principle of not wasting food, he swallowed his bite with most difficulty.</p><br/><p>Ling Xiao asked, “What happened?”</p><br/><p>You XiaoMo’s facial features puckered up, “It’s a little unpalatable, and there’s no taste at all. My luck is really too poor, I actually got one with no taste.” Then he enviously looked at the monster fruit in Ling Xiao’s hand that he had taken a bite out of. You XiaoMo’s expression was clearly saying, give me a bit ba.</p><br/><p>Ling Xiao paused then he quickly and effortlessly finished the monster fruit. Not even the pit was left.</p><br/><p>You XiaoMo, “… …”</p><br/><p>After eating, Ling Xiao spread his hands and said, “There’s none left.”</p><br/><p>You XiaoMo looked askance at Ling Xiao, “You stingy man!”</p><br/><p>Ling Xiao smiled, and calmly accepted these three words.</p><br/><p>You XiaoMo was in a bad mood and he turned and left. Ling Xiao immediately followed him, and after a while, the two reached the pavilion. PiQiu and CatQiu were not locked inside the beast cage, as they had been relatively law-abiding for the past few days. Based on their recent good behavior, You XiaoMo released them from the cage.</p><br/><p>Seeing their Master return, PiQiu and CatQiu instantly threw themselves at You XiaoMo, but midway, Ling Xiao flicked them back with a finger. The two beasts promptly knew not go beyond one’s bounds and calmed down.</p><br/>\n</div>"}