{"title": "Chapter 292", "id": 292, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-292", "volume_title": "Volume 3", "body": "<h1>Chapter 292</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 292: Coercion</h3><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>In the nick of time, You XiaoMo prevented himself from falling on his face with his knees.</p><br/><p>But hitting them against the floor so hard was really painful, and his tears nearly soared out.</p><br/><p>The sneak attacker Teng ZiXin, was not satisfied when she saw this, and even wanted to continue attacking You XiaoMo. However she lost her chance as Tong YueXu had already shaken off the two people hampering him, and was blocking her way to You XiaoMo.</p><br/><p>“Teng ZiXin, you’re so despicable!” Tong YueXu gravely said.</p><br/><p>Teng ZiXin gave a cold snort, “Battle royales have always been like this. Or did you assume that others would show mercy to you? Tong YueXu, you would be naïve to expect this!”</p><br/><p>Tong YueXu said, “Since you’ve said as such, then don’t blame me for not showing mercy.”</p><br/><p>Teng ZiXin sneered, “You really think too highly of yourself, Tong YueXu! You are not my match regardless of what happens.”</p><br/><p>Tong YueXu calmly replied, “Whether that’s true or not, we’ll only know after we compete.”When he finished speaking, he assumed a ready-to-attack stance. Just as he was about to make a move, You XiaoMo unexpectedly stopped him.</p><br/><p>“Wait!” You XiaoMo endured the pain as he stood up.</p><br/><p>Tong YueXu guardedly peered at Teng ZiXin before he walked to You XiaoMo’s side. As he supported You XiaoMo’s arm, he asked with worry, “How are you? Is the injury serious?”</p><br/><p>You XiaoMo shook his head, “It’s of no importance, I can still hold on for a while.”</p><br/><p>To tell the truth, You XiaoMo was slightly afraid of pain, because he seldom got injured since his childhood. Although it was hard for him to withstand pain, he did not want to see Teng ZiXin’s proud and superior-looking face, and he wanted to let her know the consequences of sneak attacking him.</p><br/><p>Seeing that he was looking awful and yet was clenching his teeth, Tong YueXu probably understood his insistence and did not say anything else. He just circuitously asked, “Do you need my help?”</p><br/><p>You XiaoMo immediately replied, “Yes!”</p><br/><p>Tong YueXu said, “How do you want me to help?”</p><br/><p>You XiaoMo replied, “You just need to stand at the side and keep an eye on Teng ZiXin’s every move. Don’t let her wound me again!”</p><br/><p>Tong YueXu said, “… …Okay!”</p><br/><p>He assumed that You XiaoMo wanted him to stand at the side to watch Teng ZiXin, and prevent her from having another chance to perform another sneak attack.</p><br/><p>You XiaoMo pulled his arm away from Tong YueXu who was supporting him, and walked two steps forward. Then he pretended to touch his magic bag. In actual fact, he took a small bottle of spiritual water from his dimension, which only had five drops of spiritual water inside. Raising his head, he drank all of the spiritual water.</p><br/><p>This competition did not stipulate that participants could not use other means to restore their soul force. You XiaoMo dared to openly drink his spiritual water since he took advantage of this loophole.</p><br/><p>Upon seeing this, Teng ZiXin’s eyes flashed twice.</p><br/><p>You XiaoMo threw the empty bottle into his magic bag, looked at Teng ZiXin and grinned, “I remember that there was a day where someone easily lifted my magic bag as I came out from Shifu’s courtyard. There happened to be a small bottle of spiritual water inside, did Teng-shizhi happen to have seen it?”</p><br/><p>Teng ZiXin’s expression chilled, “On that day, I left earlier than you. How would I… …”</p><br/><p>When she said that, Teng ZiXin trailed off as her expression suddenly changed, and she could not continue her sentence.</p><br/><p>You XiaoMo let loose an extremely proud smile, “Aiya, I did not say when it was, and Teng-shizhi actually knew what I was talking about.”</p><br/><p>He did not clearly state what he was implying, but people who use their heads would know what it meant once they heard it.</p><br/><p>Hearing their conversation clearly, Tong YueXu’s eyes widened a little, and he looked at Teng ZiXin with incredulity. He knew that You XiaoMo’s magic bag had been stolen. With his intelligence, he probably understood the truth from these few sentences.</p><br/><p>You XiaoMo abruptly lowered his voice, “In all likelihood, you haven’t finished that bottle of spiritual water yet right? Now…do you dare to use it in front of everyone?”</p><br/><p>Teng ZiXin’s face showed fear and anger. Although he hit the mark, she was not stupid enough to step into his provocation, “I do not understand what you are saying one bit. You must be dreaming if you’re trying to stall for time!”</p><br/><p>She immediately molded a hand seal as she finished speaking, thinking of taking advantage of the time before You XiaoMo’s soul force had fully recovered to attack him.</p><br/><p>In front of her, a majestic and powerful soul force rapidly condensed into a large palm. Teng ZiXin lighty tsk and the large palm swept towards You XiaoMo.</p><br/><p>Feeling the oppressive aura emitting from the large palm, You XiaoMo lifted his hand. A solid and thick spiritual barrier instantly condensed at his palm. In an instant, the large palm smashed into the spiritual barrier.</p><br/><p>“Bang!”</p><br/><p>The two attacks collided, and invisible soul fluctuations rapidly spread out from their point of contact. The fluctuations created a hurricane that cut into the ground, shattering the stone tiles and sending the fragments flying around. Some of the spectators who were at the edge of the competition stage were frightened into letting out loud cries of alarm as they fled away.</p><br/><p>You XiaoMo glanced at Teng ZiXin opposite him. Suddenly, his hands covertly formed a few hand seals, gathering a wave of soul force at his fingertip. Availing himself of the time before the hurricane had yet to disperse, he shot the soul force at his fingertip out.</p><br/><p>Two fingers of soul force shot through the soul hurricane, mixing into it. It was too late for Teng ZiXin when she discovered this. Her hastily built defense barrier was broken through, and the remaining soul force hit her right shoulder. Blood was immediately seen.</p><br/><p>Teng ZiXin was frightened and angry as she clutched her injured shoulder.</p><br/><p>After ten seconds, the soul storm finally dispersed, and the situation on the competition stage was revealed at last.</p><br/><p>The spectators surrounding the stage let out sounds of confusion. Why was Teng ZiXin’s shoulder also injured after just a blink of the eye?</p><br/><p>At this moment, Feng ChiYun’s side had distinguished the winners from the losers. Despite Qing Qiu’s strength being pretty good, against the experienced Feng ChiYun, she was not match at all. She was soon at a disadvantage, and was forced down the competition stage by Feng ChiYun.</p><br/><p>Teng ZiXin’s two helpers were injured by Tong YueXu, and had lost half of their fighting strength. Therefore, there was only one Zhong JingShan left on Teng ZiXin’s side. Unfortunately one Zhong JingShan was not much help at all.</p><br/><p>The situation had reversed in an instant.</p><br/><p>You XiaoMo said, “Do you admit defeat or not?”</p><br/><p>Teng ZiXin pursed her lips and remained silent.</p><br/><p>You XiaoMo smirked, “If you don’t admit defeat, I’ll just beat you until you do so.”</p><br/><p>The implication was that he did not plan to strike Teng ZiXin off the competition stage. Instead, he wanted her to take the initiative to throw the towel in. It need not be said that this move was quite malicious. Compared to being knocked out of the stage, it would be an even greater blow to make a proud person voluntarily surrender.</p><br/><p>Zhong JingShan recalled that he had helped Chai Zheng scheme against You XiaoMo. He did not know if You XiaoMo would hold a grudge. He took the initiative to jump off the competition stage for fear of dealing with You XiaoMo. Looking at the situation on the stage, they did not have a chance of winning at all. Rather than standing on top in humiliation, it would be better to simply give up.</p><br/><p>Unfortunately, Teng ZiXin was unable to follow Zhong JinShan’s example and simply give up.</p><br/><p>You XiaoMo did not find that surprising. It was even better for him if Teng ZiXin did not admit defeat, as he would have a reason to beat her up.</p><br/><p>Hai Lan then hastily walked over to Teng ZiXin and whispered, “ZiXin, we have already lost. It’s more advantageous to admit defeat now.”</p><br/><p>Teng ZiXin darkly glanced at Feng ChiYun who was about to walk over, and bitterly looked at You XiaoMo, before she finally decided to give up. If she continued to fight, she would be the one to lose out. However, it was impossible for her to take the initiative to surrender.</p><br/><p>Thinking of this, Teng ZiXin turned and walked away.</p><br/><p>You XiaoMo immediately threw out a burst of soul force.</p><br/><p>Teng ZiXin’s expression slightly changed, and she had no choice but to dodge to one side. After she found her footing, she angrily stared at You XiaoMo, “You XiaoMo, don’t think that I’m afraid of you.”</p><br/><p>You XiaoMo happily laughed, “Of course you’re not afraid of me. You, Missy Teng, have always been fearless. No matter when, there’s always a ‘I alone am superior and aloof’ expression on your face. How can you be afraid of a small potato like me?”</p><br/><p>Hai Lan was furious as she listened to his nonsense, “You XiaoMo, we have already admitted defeat. Don’t you dare go too far! Have some shame, you’re still a man!”</p><br/><p>You XiaoMo was surprised, “Did you guys say that you admit defeat just now?”</p><br/><p>Dumbstruck, Hai Lan was unable to form a reply.</p><br/><p>You XiaoMo continued, “What can just turning around represent? How could I know if she was preparing to concoct a killing move, or trying to make me lower my guard in order to perform another sneak attack on me? As a precaution, it’s only natural that I am obliged to strike first and gain the upper hand.”</p><br/><p>In the time they took to exchange words, Feng ChiYun and his friends had already blocked off the retreat of Teng ZiXin and her group.</p><br/><p>Unless they took the initiative to surrender now, Teng ZiXin and her group could only continue to fight on.</p><br/><p>Teng ZiXin glanced around with an extremely gloomy complexion.</p><br/><p>Although Feng ChiYun and his friends had used up a lot of their soul force, Teng ZiXin and Hai Lan also did not have much soul force left in their reserves/running on fumes. If they really started fighting, their chances of victory were less than thirty percent.</p><br/><p>“You XiaoMo, you win, I surrender!” Teng ZiXin bitterly spat this sentence out. Then, along with Hai Lan and her other helper, she left the competition stage.</p><br/><p>Their departure marked the end of the battle royale.</p><br/><p>Under the efforts of You XiaoMo and his group, Teng ZiXin, Chai Zheng and Qing Qiu who had the strength to contend with the top three people, were finally and unexpectedly wiped-out.</p><br/><p>Immediately, You XiaoMo excitedly beckoned Feng ChiYun and the rest over, “Quickly come over here, let’s distribute the scores for the five places.”</p><br/><p>The audience was taken aback. That’s right! There could be high and low scores for the five places. But what was You XiaoMo trying to do that made him so excited?</p><br/><p>It was not only just the audience who were bewildered. Even Tong YueXu and the rest did not understand what You XiaoMo was trying to do.</p><br/><p>Off the stage, Ling Xiao looked at You XiaoMo with surprisingly bright eyes.</p><br/>\n</div>"}