{"title": "Chapter 299", "id": 299, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-299", "volume_title": "Volume 3", "body": "<h1>Chapter 299</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 299: Half a Lake of Spiritual Water</h3><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>SheQiu, HeiQiu and MaoQiu were cultivating beside the lake, sitting cross-legged in their human forms.</p><br/><p>Though the air in here wasn’t as saturated with spiritual energy as the air in the suite, they had the support of the spiritual water, so their cultivation speed wasn’t bad. That was excluding PiQiu and CatQiu, who often played hooky; they hadn’t been cultivating as much as they should.</p><br/><p>You XiaoMo walked into the Magic Herb fields and, seeing that the Hidden Dipper Stink Bug seemed to be doing fine in their second stage of transformation, grabbed Piqiu and CatQiu who were playing around in the fields.</p><br/><p>You XiaoMo brought them up to eye level, saying with a smile, “You two, let me, your owner, tell you something. If you continue slacking off from cultivating, then I’ll throw you both in the beast cage for the next month. I’m sure Xiao Hei and the others will be very pleased.”</p><br/><p>PiQiu hugged his finger with his two claws. “I’m really sorry, master.”</p><br/><p>CatQiu imitated whatever PiQiu did. “Meow~”</p><br/><p>You XiaoMo was unmoved. “Don’t think you can elicit any sympathy from me like that. Tell me your decision now.”</p><br/><p>The two immediately hung their heads in surrender.</p><br/><p>You XiaoMo put them down, satisfied. “Now, go and cultivate next to the lake. Unless it’s your turn to work, you won’t be leaving the lakeside. If you behave, I can give you a day off.”</p><br/><p>For these two who took every day off, a day off meant nothing.</p><br/><p>You XiaoMo calmly said, “If you don’t like holidays, then we can get rid of that. I’m a very generous owner, and will respect your choices.”</p><br/><p>PiQiu and CatQiu immediately hugged his legs tearfully.</p><br/><p>You XiaoMo huffed.</p><br/><p>Walking to the lakeside, You XiaoMo gazed at the egg at the center of the lake. It hadn’t reacted at all yet. Could it be that this egg was dead already?</p><br/><p>The more he thought, the more it seemed possible. You XiaoMo hurriedly turned to PiQiu and said, “PiQiu, go and fish that egg up.”</p><br/><p>PiQiu turned. “Arf?” Why?</p><br/><p>You XiaoMo cuffed him over the head. “Talk like a human.”</p><br/><p>PiQiu immediately said, “I’m going down now.”</p><br/><p>CatQiu looked at PiQiu in shock. That wasn’t what you said.</p><br/><p>As soon as he finished speaking, he assumed a human form, butt-naked and bits hanging. Just as he prepared to dive into the lake, something strange suddenly happened to the spiritual water and the surface of the lake began to swirl like a whirlpool.</p><br/><p>This movement brought SheQiu and the others out of their cultivation. They opened their eyes, looking at the whirling water with shock.</p><br/><p>SheQiu asked, “What’s happening?”</p><br/><p>Sharp eyed Xiao Hei replied, “I think it’s that egg in the center of the lake.”</p><br/><p>Xiao Hei only spoke like a normal person to SheQiu, who was stronger than him.</p><br/><p>MaoQiu said, “Not I think, it just is.”</p><br/><p>Hearing their words, You XiaoMo gazed into the lake with curiosity. And then he immediately regretted not getting someone to fish the egg out. After the whirlpool swirled for a full five minutes, the water level visibly fell. Where it was originally only twenty or thirty centimeters from the bank, the water level had suddenly fallen by almost half a meter.</p><br/><p>You XiaoMo was dumbstruck.</p><br/><p>PiQiu and CatQiu also widened their eyes.</p><br/><p>Only SheQiu and the other two were unmoved, as if even if the sky fell it wouldn’t have anything to do with them. Although if the sky did fall in this dimension, it really wouldn’t have anything to do with them.</p><br/><p>“Quick, quick, fish it out!” You XiaoMo finally recovered and hastily ordered. If it continued, the spiritual water would all be gone. Then he wouldn’t be able to stop himself from killing that egg.</p><br/><p>By the time he had finished yelling, the water level had fallen by another half a meter. The only good thing was that the egg had finally stopped absorbing the water. However, with such a large lake of spiritual water suddenly reduced to half, You XiaoMo’s heart ached. The spiritual water replenished itself very slowly. The amount it grew by each day wasn’t even enough for him to use.</p><br/><p>You XiaoMo threw PiQiu into the lake, snarling, “Fish it up.”</p><br/><p>PiQiu shuddered. This was the first time he had seen his master so mad and he was afraid to say anything more, instantly grabbing the egg.</p><br/><p>You XiaoMo held the egg, wondering if he should fry it or boil it.</p><br/><p>However, after sucking up half a lake of spiritual water, the demon beast egg was no longer grey and dull. Instead, it had changed to a shimmering fire red. It seemed like it had a life, jumping like a heartbeat with a “thud thud thud”.</p><br/><p>SheQiu suddenly spoke up, sounding like he had been enlightened. “So it’s like that.”</p><br/><p>You XiaoMo asked, “What’s it like?”</p><br/><p>SheQiu began to explain, “That egg had been in the palace for too long without spiritual energy, causing its lifeforce to steady weaken. That’s why it had been unresponsive until now. After half a year of soaking in the lake, it had plenty of spiritual water to help it, so it recovered.”</p><br/><p>You XiaoMo’s expression was pinched, “There’s no need for it to absorb half of the lake though, is there?”</p><br/><p>“That, I’m not sure about. It’s possible that a full recovery would require a lot of spiritual energy. You haven’t properly checked in a while, but the water in the lake had been decreasing by a thousand drops each day.”</p><br/><p>You XiaoMo: “…”</p><br/><p>This guy probably had been harboring these suspicions for a long time, but never told him.</p><br/><p>You XiaoMo raised the egg in his hand. “Say, would it be worth it to cook it for dinner?”</p><br/><p>SheQiu said, “… Before it took half of the spiritual water, you wouldn’t lose much if you ate it, but now its definitely not worth it. It doesn’t seem to be a normal high grade demon beast, and won’t your heart ache if you ate half a lake’s worth of spiritual water in one go like that?”</p><br/><p>You XiaoMo replied with sadness, “It would, but thinking of how to sucked up so much spiritual water, I just really, really want to have it for dinner.”</p><br/><p>As he finished speaking, the egg started moving from where it was lying quietly on his palm, jumping onto the ground and away.</p><br/><p>You XiaoMo stared, but then saw the direction in which it was heading in and startled. He hurriedly yelled, “Aaaahhh, stop it! Don’t let it jump into the lake!”</p><br/><p>PiQiu lunged, but was dodged.</p><br/><p>CatQiu tried to block its way, but it just bounced off CatQiu’s head, causing the beast to run back over tearfully.</p><br/><p>At the crucial moment, Xiao Hei’s foot came down and held the egg in place.</p><br/><p>You XiaoMo lunged over and gave Xiao Hei a thankful look, only to get a roll of the eyes in response. He picked up the struggling egg and threatened it, “If you keep struggling, I’ll barbeque you.”</p><br/><p>The egg fell silent.</p><br/><p>You XiaoMo grinned, but didn’t even have the time to say a second sentence when it started struggling again, as if it was unfazed by the threat.</p><br/><p>MaoQiu spoke up: “It might not be afraid of fire.”</p><br/><p>You XiaoMo asked in surprise, “Then what is it afraid of?”</p><br/><p>MaoQiu replied, “I don’t know, but the higher the level of the demon beast, the less its afraid of.”</p><br/><p>You XiaoMo knocked on the egg’s shell. “Do you think it’ll be afraid of Ling Xiao?”</p><br/><p>MaoQiu: “… Definitely!”</p><br/><p>In this world, the number of demon beasts that weren’t afraid of the boss could be counted on one hand.</p><br/><p>You XiaoMo realized that as the word left MaoQiu’s lips, the egg finally stopped struggling, lying in his arms like it was playing dead. Even when he put it on the ground, it still didn’t move.</p><br/><p>You XiaoMo was elated. “Wow, it really stopped moving.”</p><br/><p>MaoQiu didn’t reply.</p><br/><p>Though the egg’s lifeforce had been rather weak in the past half a year, it could still feel how powerful Ling Xiao was and had a vague understanding of the situation outside. It wasn’t afraid of normal attacks, but if it was that guy, he could probably crush it between two fingers and might even squeeze out some “yolk.”</p><br/><p>You XiaoMo picked it up again. “You guys keep cultivating. I’m going to show it to Ling Xiao.”</p><br/><p>The egg wanted to struggle, but it was too late.</p><br/><p>Before he left, he went to take one last look at the Hidden Dipper Stink Bugs. The second transformation would take a while. Then, You XiaoMo left with a single thought and fell directly onto the bed, and the resting Ling Xiao.</p><br/><p>Ling Xiao hummed lightly, embracing him and saying, “You’re rather eager!”</p><br/><p>You XiaoMo scrambled up. “Wait a second, I want to show you something, huh? Where’s that egg?”</p><br/><p>Ling Xiao took a red egg out from the covers. “You mean, this egg?”</p><br/><p>You XiaoMo nodded joyfully, but thinking of what the egg had done to his lake, his face fell again. Ling Xiao asked him what was wrong and he explained everything.</p><br/><p>Ling Xiao smiled, saying, “This egg really isn’t a normal egg. You’ll see when it hatches. If you think it’s wronged you then just make it work for you after it comes out to repay you through labor.”</p><br/><p>You XiaoMo looked at the cowering egg and nodded. “That’s a good idea!”</p><br/><p>Ling Xiao grabbed his waist, running his hands across You XiaoMo’s body and grinned, saying, “Now, let’s fulfill that promise from before.”</p><br/><p>Hearing this, You XiaoMo’s expression froze. He had only just realized he had been sitting right on that gradually awakening part of Ling Xiao.</p><br/>\n</div>"}