{"title": "Chapter 296", "id": 296, "volume": 3, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-296", "volume_title": "Volume 3", "body": "<h1>Chapter 296</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 296: Battle</p><br/><p>Translated by Jouissance of Exiled Rebel Scanlations</p><br/><p>You XiaoMo also noticed their expressions. These four did seem rather strong, but, even disregarding Ling Xiao, the other nine from Block One weren’t pushovers either. Were they that certain of their victory?</p><br/><p>You XiaoMo couldn’t help but turn and ask Tong YueXu.</p><br/><p>Tong YueXu thought for moment. “I think it might have something to do with the different cultivation methods they use in Ward A.”</p><br/><p>This made even Feng ChiYun show some surprise.</p><br/><p>Confused at what he was talking about, You XiaoMo asked, “Different methods of cultivation? How can it be different?”</p><br/><p>Tong YueXu shook his head, saying, “It is different. Apart from going into the mountain and fighting in the arena to train, the biggest specialty of Ward B is the spiritual energy present in the four compounds, Spring, Summer, Autumn, and Winter. However, Ward A doesn’t have that; their accommodations are just normal houses. But they do have a special cultivation area, which can speed up cultivation for both martial artists and mages alike. Apparently it has something to do with the spiritual ley line, making cultivation even easier than in the pavilions. I’m not too sure about the specifics though.”</p><br/><p>“A cultivation area even better than the pavilions?”</p><br/><p>You XiaoMo was instantly impatient to go to Ward A, but… He recalled something SheQiu had said to him a long time ago, also about the ley lines.</p><br/><p>If that cultivation area relied on a ley line, then when that ley line runs dry, wouldn’t the cultivation area disappear?</p><br/><p>Tong YueXu continued, “I think their confidence comes from having raised their strength by practicing in that cultivation area.”</p><br/><p>You XiaoMo looked over at Ling Xiao; the latter had already arrived on the stone stage and his opponent, a strangely strongly built man dressed in black, was standing opposite him. Ling Xiao might be one ninety in height, but compared to this man, he was shorter by half a head.</p><br/><p>It was then that an elder surnamed Tang suddenly spoke up, “Fifth Elder, is this Ling Xiao the champion of Ward B’s big competition?”</p><br/><p>The Fifth Elder nodded, replying, “That’s right. Do you think he’ll be able to defeat Yu Wen?”</p><br/><p>Elder Tang looked to Ling Xiao. He had quite some ability to be able to come out first in the Competition; he must’ve done very well in both the individual matches and the free for all, but… his level seemed to only be a Star Level 5 star. It wasn’t enough when compared to Yu Wen’s Celestial Level 1 star.</p><br/><p>Elder Tang said, “Yu Wen is the strongest out of all those present. Though he might not be one of the top hundred, his strength is still near the top in Ward A. More importantly, Ling Xiao hasn’t been here for even a year yet. I don’t believe he can beat Yu Wen.”</p><br/><p>The Fifth Elder stroked his beard, letting out a small, but meaningful smile.</p><br/><p>Seeing this, Elder Tang asked in surprise, “Does the Fifth Elder think he can defeat Yu Wen?”</p><br/><p>The Fifth Elder looked to the stone stage, saying, “You’ll see. There’s more to him than the eye can see.”</p><br/><p>Elder Tang looked in the same direction, just in time to see Yu Wen fall from the stage. He couldn’t help but widen his eyes in surprise. Yu Wen had lost in such a short time?</p><br/><p>The Fifth Elder smiled, saying, “I almost forgot to say, during the free for all, he fought over ten people at once and came out without a scratch. Amongst them, two were ranked higher than him.”</p><br/><p>Elder Tang watched Ling Xiao walk off the stone stage with disbelief. So he had hid his strength, that was why he felt like he couldn’t figure this guy out. Winning against Yu Wen so easily, it seemed that his strength was far above Yu Wen’s. After officially entering Ward A, he couldn’t probably get into the top hundred.</p><br/><p>In the end, only Ling Xiao won, and he was also the only one who knocked his opponent off stage.</p><br/><p>As for Rong Xuan, Qin Zhang and the others, Rong Xuan could’ve become the second one to pass, had he not stepped on the edge of the stage in the fifth round, causing one of his feet to slip.</p><br/><p>“Next is the students from block two. If your name is called, go up.” The Fifth Elder looked at the nervous faces in front of him and said, “First place You XiaoMo, second place Tong YueXu, third place Feng ChiYun, fourth place Chai Zheng, fifth place Qing Qiu.”</p><br/><p>You XiaoMo suddenly noticed that he was the first to be called up, and the names were called by the rank they obtained in the Competition.</p><br/><p>Tong YueXu smiled, nudging his shoulder. “Come on, our turn.”</p><br/><p>You XiaoMo walked to the place opposite his opponent. His opponent was a smiling young man, who seemed to be very good natured, but his strength was formidable, a low grade level seven.</p><br/><p>“Are you the champion of the competition?” The young man asked with a laugh.</p><br/><p>You XiaoMo nodded, “I’m You XiaoMo, please take care of me.”</p><br/><p>The young man smiled, saying, “The famous You XiaoMo. I hear you’re Master Duan’s pupil; did Master Duan teach you a lot of powerful tricks? Is that why you managed to win as a level six low grade mage?”</p><br/><p>You XiaoMo was a little taken aback. How come these words sounded a little strange; was he understanding them wrong? Coming back to the present, he calmly spoke, “If you really want to know, why not see for yourself in a moment?”</p><br/><p>The young man’s smile didn’t change. “I’m wondering, but how many rounds can our champion last?”</p><br/><p>This guy’s words really made him quite annoying</p><br/><p>You XiaoMo wished that he could just shut up.</p><br/><p>After that, the two backed up to an appropriate distance. After the free for all, You XiaoMo knew what the early bird gets the worm was all about, so he attacked first, testing the waters by firing a bullet of energy with Resonance Finger[1].</p><br/><p>Seeing this, the young man gave a soft laugh of contempt, using a Spiritual Barrier to easily block You XiaoMo’s attack. At the same time, he said, “That’s your strength? Seems like the champion isn’t anything to boast about. If you have no other moves to make, it’s my turn to attack.”</p><br/><p>The young man dismissed his barrier with a wave of his hand and quickly made a hand seal. A powerful pulse of soul force erupted from within him, becoming an incorporeal leopard that charged at You XiaoMo…</p><br/><p>You XiaoMo knew that it would be futile to use Resonance Finger to block, so he pulled up a Spiritual Barrier. Yet, something shocking happened. Just as the incorporeal leopard was about to smash into the Spiritual Barrier, it suddenly split into two. One half hit the barrier and the other half swerved, attacking from the side.</p><br/><p>The young man facing him laughed. “Kid, this isn’t like the games you play in Ward B. I’ll let you taste defeat today, and remind you of your place in the future.”</p><br/><p>You XiaoMo’s eyes widened. Seeing that the jackal was about to strike him, his feet suddenly moved like the wind, and the leopard smashed into where You XiaoMo had been standing a moment ago.</p><br/><p>Not far off, You XiaoMo sighed in relief, staring at the cracks in the stone floor.</p><br/><p>It was a good thing he managed to dodge, otherwise he might’ve directly fell off the stage had he been struck.</p><br/><p>He suddenly felt grateful that Ling Xiao had been forcing him into speed training. Though it was just two days, the effects were already evident.</p><br/><p>But these two pythons were even stronger than Zhong JingShan’s pythons. If he hadn’t been on guard, he would’ve probably been seriously hurt.</p><br/><p>You XiaoMo watched the young man carefully. That technique of his wasn’t bad; being able to split into two forms like that was a useful ability to have. If he could learn it, it would definitely benefit him.</p><br/><p>You XiaoMo tried to recall the hand seals the young man had made before the attack, but couldn’t remember them. He hadn’t really been paying attention, but if it was formed through one’s soul force, the control of the technique would probably be in their own hands.</p><br/><p>“Tsk, he managed to dodge it.” The young man was evidently very displeased by this, spitting lightly. “But it won’t be so easy next time.”</p><br/><p>After that, the young man attacked once more.</p><br/><p>This time, You XiaoMo raised several Spiritual Barriers around himself, covering himself and protecting himself from attack. Then, he began to make hand seals.</p><br/><p>The two pythons[2] struck the Spiritual Barrier fiercely, and not long later, the barrier to vibrate audibly. Since he had spread out his soul force, it wasn’t as durable as before. Three seconds later, a crack appeared on the Spiritual Barrier and began to spread across the surface.</p><br/><p>Once the cracks had covered the barrier, it could no longer take any more force and shattered with a bang. You XiaoMo, who had been inside, had already retreated from the Spiritual Barrier a second before it shattered, but the shockwave gave him a few light cuts and bruises.</p><br/><p>The good thing was that his hand seals were done.</p><br/><p>A golden seal spun between his palms, holding within it an immense power and making everyone’s expression change, especially the young man facing him.</p><br/><p>Though he had heard of You XiaoMo and his accomplishments, he wasn’t very clear on the specifics of the competition.</p><br/><p>You XiaoMo smiled at him. “XueZhang[3], taste my Golden Sumeru Seal!”t/n:[1] Resonance Finger is , more widely known as LingXi Finger, which is where you gather spiritual energy into your fingers and use it to do stuff like shoot it out as a bullet or catch a sword between your fingers.  (literally spirit rhino) refers to a rhino’s horn, which was thought to be able to sense emotions and resonate with others spiritually, and therefore used to describe empathy and understanding.  is just finger</p><br/><p>[2] If you – like me – had no idea what was happening here with the leopard and jackal and python… the guy fighting Momo shaped his soul force into a leopard, which split into a leopard and a jackal. So, the jackal tried to bite Momo and I don’t know why it says the leopard crashes into the ground since the leopard should’ve crashed into the barrier already, but just roll with it. Then, the two groups of formless soul force turned into two pythons… Or something like that</p><br/><p>[3] XueZhang is  which is like senpai, referring to a more senior student of the academic institution or area of study</p><br/>\n</div>"}