{"title": "Chapter 309", "id": 309, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-309", "volume_title": "Volume 4", "body": "<h1>Chapter 309</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 309: Selling Oneself</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>You XiaoMo suffered a huge mental attack with Ling Xiao’s words.</p><br/><p>He immediately guessed the reason for Ling Xiao’s fabrication after hearing that sentence. Ling Xiao probably did not want to let others think that he had easily defeated Tang MengCheng, so he deliberately engaged in such an action, causing him to really think that Ling Xiao had some secret move called Lightning Ace.</p><br/><p>Ling Xiao was amused by You XiaoMo’s resentful expression and just when he wanted to say something, an exclamation of pleasant surprise sounded from behind him.</p><br/><p>“Fellow You, Fellow Ling, you’re really here.”</p><br/><p>The two turned towards the direction of the voice at the same time and saw a familiar person quickly walking toward them. This person was none other than the one who pulled some strings for You XiaoMo at the entry assessment – Gao Yang.</p><br/><p>You XiaoMo had thought of going over to look for Gao Yang ever since he rose to Ward A. However he did not know where Gao Yang was staying, and with the latter’s personality, he was probably at the Cultivation Center. It would have been a little troublesome to find him so he put the matter on hold. Who would have thought that You XiaoMo would meet him here?</p><br/><p>You XiaoMo happily cried out, “Gao-dage, it’s been a long time since we last met!”</p><br/><p>Gao Yang walked over and nodded to Ling Xiao, “It’s really been a long time. It’s a pity that I couldn’t personally welcome you guys when you rose to Ward A.”</p><br/><p>You XiaoMo replied, “Gao-dage was at the Cultivation Center right? Then it couldn’t be helped. And it doesn’t matter whether you could welcome us or not, it’ll be okay if we have an chance to meet somewhere down the line.”</p><br/><p>Gao Yang explained, “I wasn’t busy with cultivation. At that time I had received a task which was a little difficult, so I spent a lot of time on it. But it’s finally completed now.”</p><br/><p>When he finished speaking, he stared at Ling Xiao and gave him a look-over.</p><br/><p>Gao Yang was pleasantly surprised, “Fellow Ling, I didn’t realize you were this strong, congratulations. We should find an opportunity to swap pointers with each other.”</p><br/><p>Ling Xiao glanced at Gao Yang’s level and replied, “If there’s an opportunity.”</p><br/><p>You XiaoMo curiously asked, “Gao-dage, how high is your current level now? What’s your ranking on the top hundred list?” As the disciple of the Vice-Principal, Gao Yang’s strength should be quite high.</p><br/><p>Gao Yang gave a modest smile, “I’m only at the level of a four star Spiritual Realm, ranking fifth on the top hundred list, slightly behind BaiLi TianYi and the rest. They’re all geniuses and are much stronger than me.”</p><br/><p>You XiaoMo patted his shoulder, “Gao-dage, you’re already very strong. I believe that you’ll be stronger than them in no time.”</p><br/><p>Gao Yang burst into laughter, “Then I’ll just have to thank you for your kind words.”</p><br/><p>Ling Xiao looked at the hand You XiaoMo put on Gao Yang’s shoulder, and faintly narrowed his eyes.</p><br/><p>You XiaoMo suddenly felt as if a hole was burned into the back of his hand. Turning his head, he saw Ling Xiao staring at his hand without blinking. The sight was so scary that it made him immediately retract his hand.</p><br/><p>Gao Yang discovered this and asked, “What happened?”</p><br/><p>You XiaoMo embarrassedly smiled, “Nothing, I was just bitten by a mosquito.”</p><br/><p>Gao Yang felt that it was strange but did not ask further. The two chatted for a while before he left. Gao Yang had just returned not long ago. If he had not been drawn over by the commotion here, he would have been on his way to submit his report on his task.</p><br/><p>Soon after Gao Yang had left, the victor had been decided in BaiLi TianYi’s challenge.</p><br/><p>As Tong YueXu had said, that person called Teng Yu was completely not BaiLi TianYi’s match.</p><br/><p>However, this person really had great perseverance. His zeal of persisting in fighting despite continuous setback was worthy of learning!</p><br/><p>You XiaoMo and Tong YueXu parted ways in the middle of the road going back. Tang YuLin still had magic herbs for him, so he followed them back to the residential area.</p><br/><p>There were many magic herbs on the list that You XiaoMo had handed to him. It included the ones that he needed now and the ones that he needed some time later. Anyways, he was pleased that there was a person willing to do free labor to look for the herbs he needed, though payment in the form of some points was required. Thus he got somewhat carried away and wrote down many types of level seven and eight magic herbs when he wrote the list.</p><br/><p>However he did not think that Tang YuLin would actually manage to find one fifth of the magic herbs on the list in such a short time.</p><br/><p>He had said that Tang YuLin could give him seeds or immature magic herbs instead, and mature level seven and eight magic herbs were indeed not easy to find, so Tang YuLin really had found a lot for him.</p><br/><p>You XiaoMo did a little calculation and transferred four hundred points over to him.</p><br/><p>Tang YuLin took his Black card. He was a little dazed upon seeing that the points on it had nearly doubled. As expected, it was worthwhile to deliberately chase him after You XiaoMo, doing business with him was really the best.</p><br/><p>BaiLi TianYi unsympathetically said, “Ah Lin, have you not forgotten something?”</p><br/><p>t/n: Ah- is a prefix to name in order to show familiarity.</p><br/><p>Tang YuLin instinctively covered his own card, and blankly looked at him, “What did I forget?”</p><br/><p>BaiLi TianYi hated for iron for not becoming steel as he said, “Have you forgotten the promise we made? We agreed that I would help you find the magic herbs, but after selling them, we would split the profits forth-sixty. Are you planning to pocket it all?”</p><br/><p><strong>t/n: hate for iron for not becoming steel means to feel resentful towards somebody for failing to meet expectations and being impatient to see improvement.</strong></p><br/><p>Tang YuLin embarrassedly frowned. He definitely wanted to pocket it all. Looking at the points on his card, it felt like a piece of flesh was forcibly scraped off his body for him to give some to BaiLi TianYi.</p><br/><p>Tang YuLin murmured, “Sixty for me, forty for you?”</p><br/><p>BaiLi XiaoYu lightly laughed, “Wrong, it’s sixty for me and forty for you.”</p><br/><p>Tang YuLin suddenly had a deadpan expression. If he got forty percent, he would only get one hundred and sixty points, which was not even half of the sum he had received. How could he accept this?</p><br/><p>Tang YuLin tightly gripped the card in his hands. He clearly wanted to renege on their promise.</p><br/><p>BaiLi TianYi was not surprised. He gently chuckled and leaned over to whisper in Tang YuLin’s ear, “Ah Lin, I’m all right to hand all the points over to you, but you must agree to one condition of mine.”</p><br/><p>Tang YuLin thought over it and asked, “What condition?”</p><br/><p>BaiLi TianYi whispered, “I want you to move in with me.”</p><br/><p>Tang YuLin paused, “I won’t pay the rent.” He knew that the room BaiLi TianYi was staying in needed two points every day, so it was necessary to affirm this.</p><br/><p>BaiLi TianYi smiled so widely that there were flowers blooming, “Of course!”</p><br/><p>After reaching an agreement, BaiLi TianYi impatiently dragged Tang YuLin off. He will help Tang YuLin move to his room now, lest Tang YuLin have second thoughts.</p><br/><p>You XiaoMo did not hear some contents clearly as they had been whispering, but he was curious to death about it, so he asked Ling Xiao. Ling Xiao’s strength was high and he should have been able to hear their dialogue.</p><br/><p>After listening to his retelling, You XiaoMo was at a loss for words, “So he sold himself just like that?”</p><br/><p>Ling Xiao held his chin and roguishly grinned, “Exactly, selling himself just for two hundred points, he’s even more stupid than you. At the least it should be more than two thousand right?”</p><br/><p>You XiaoMo was nearly blinded by his pearly grin. Hearing what Ling Xiao said, he almost subconsciously nodded a ‘yes’. Fortunately he managed to react in time to stop himself.</p><br/><p>However, this line of thinking was really similar to his. Ling Xiao really understood him.</p><br/><p>Thinking of this, You XiaoMo righteously stated, “I will not succumb even if you gave me two thousand points.”</p><br/><p>“Really?” Ling Xiao obviously did not believe him.</p><br/><p>You XiaoMo nodded, “Of course, if you don’t believe me, you can give it a try.”</p><br/><p>Ling Xiao replied, “Try? Earn two thousand points and then try to lure you with it?”</p><br/><p>You XiaoMo said, “That’s not a bad idea.”</p><br/><p>Ling Xiao looked at him in delight, “Do you think I’m the type to be duped with just a few words?”</p><br/><p>You XiaoMo’s eyes glittered and he pretended not to understand what Ling Xiao meant, “What are you saying? I don’t understand what you’re meaning. No one will force you if you don’t want to try,.”</p><br/><p>Ling Xiao said, “I feel that lately you’re getting bolder and bolder.”</p><br/><p>You XiaoMo played the fool and laughed, “How can it be? You should already know that I’m not bold at all.”</p><br/><p>Ling Xiao tenderly held his waist and whispered, “Your cultivation seems to have fallen a lot recently. It’s time to resume your training courses. I hope for your sake that your speed has not dropped too. ”</p><br/><p>You XiaoMo let out a cry of ‘ao-wu’, crap!</p><br/><p><strong>t/n: ao-wu is an onomatopoeia that describes a wailing or howling sound.</strong></p><br/><p>The tragically ravaged You XiaoMo was finally liberated in the dead of the night.</p><br/><p>The next day, his whole body was aching so much that he could not crawl out of bed. This symptom was the same as the thing they were doing every night that cannot be seen by children, no, it was even worse than that. You XiaoMo suddenly had a delusion while lying on the bed.</p><br/><p>Compared to being chased and bitten by the Thunder Flame Leopard every day, he would rather be pressed down and bitten by Ling Xiao.</p><br/><p>At the least he would be able to drink a bit of spiritual water. Ling Xiao generally did not allow him to drink it when training, saying that it would weaken the effect of the training. He really did not know if Ling Xiao was messing with him or not!</p><br/><p>In the afternoon, his body was still somewhat sore, but You XiaoMo did not continue to lie on the bed to rest.</p><br/><p>He had not even been to the Gravity Room once ever since he entered into Ward A. It was mainly because the results from the Gravity Room were not as evident as the Cultivation Center, and he did not have the time as he also needed to refine pills.</p><br/><p>The Gravity Room in Ward A was in fact a Gravity Mountain. There was only one such mountain, and it was rumored to be so large it could accommodate more than ten thousand people. It was truly poles apart from the Gravity Room that had been used in the competition before. However, there were less people going to the Gravity Room every day as compared to the arena and the Cultivation Center.</p><br/><p>Before leaving the house, You XiaoMo looked at Ling Xiao who was pretending to be elegant and drinking tea, “I’m going to the Gravity Mountain. Do you want to come along and take a look?”</p><br/><p>Ling Xiao put his tea cup down, “Let’s go together then.”</p><br/><p>You XiaoMo replied, “Then you should hurry up.”</p><br/><p>The two left the residential area a while later.</p><br/><p>The Gravity Mountain was in the same direction as the Cultivation Center and both were located not far from each other. Thus, there was a huge crowd in the beginning, however, the number of people on the road slowly decreased when the road forked.</p><br/><p>The two finally reached their destination after half an hour.</p><br/>\n</div>"}