{"title": "Chapter 301", "id": 301, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-301", "volume_title": "Volume 4", "body": "<h1>Chapter 301</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 301 The Cultivation CenterTranslated by Rara of Exiled Rebels Scans</p><br/><p>The two most bustling zones of Ward A, one was the arena, and the other one was a place called the Cultivation Center. The livelihood of this place was nowhere inferior than the bazaar.</p><br/><p>You XiaoMo had to ask some seniors for the location of the arena and the Cultivation Center. The seniors, guessing that they must be the freshmen, told them the location without making thing difficult, and then hurriedly left.</p><br/><p>You XiaoMo looked toward their direction and was surprised, “Eh, are they leaving for the Cultivation Center too?” Quickly leaving after telling them like that, that was a bit impatient.</p><br/><p>Ling Xiao walked over and hugged You XiaoMo’s shoulder, “There might be something fun over there. Let’s check the place out.”</p><br/><p>The two immediately followed them. On the way, they ran into Tong YueXu and Feng ChiYun.</p><br/><p>Tong YueXu and Feng ChiYun were surprised to see their appearance, since it seemed like they were also going to the Cultivation Center.</p><br/><p>After a slight moment of surprise, Tong YueXu gently nodded toward them, “I didn’t see you guys here yesterday, are you going to the Cultivation Center today?”</p><br/><p>You XiaoMo blushed while remembering yesterday event.</p><br/><p>Ling Xiao’s face was much thicker, he talked as if nothing happened yesterday, “You went to that place?”</p><br/><p>Tong YueXu nodded, “I went there once yesterday. That place is quite good, although..”</p><br/><p>You XiaoMo hastily asked, “Although?”</p><br/><p>Feng ChiYun continued the sentence, “Although its restrictive condition is very stringent. I heard that it wasn’t this strict before, but it seems like something has happened, causing the rule to be changed abruptly. This started roughly a year ago…”</p><br/><p>The Cultivation Center was the most unique feature of Ward A. The place was a huge circular structured building with numerous stone rooms. Like Ling Xiao had said before, the deeper one went in, the more effective it was for cultivation, but…</p><br/><p>A year ago, the restriction against the cultivation was not particularly strict, which was reflected through the point cost for a stone room. Somewhere around last year, the cost for each room suddenly rose up a time and a half, for example, a room that cost only four points before, now needed six points.</p><br/><p>For most people, this was a bad news!</p><br/><p>Earning a point everyday had always been a very difficult task to begin with, and with this unexpected rise of cost, a lot of students felt reluctant.</p><br/><p>In the end, the academy’s side also didn’t make an explanation, and this matter remained unsolved.</p><br/><p>Although people couldn’t understand, no one was willing to give up such a wonderful place for cultivation, therefore, even if the majority felt reluctant, the place was still packed with an endless stream of people everyday.</p><br/><p>However, this was not the only one restriction.</p><br/><p>There was another one that was much more stricter than the increase of points, which also limited more students, and it was a condition related to the student’s card.</p><br/><p>From outside to inside, the Cultivation Center was divided into three areas, the Black card zone, the Purple card zone and the Red card zone. As the name suggested, black cards were only able to access the Black card zone, while the Red card could enter all three.</p><br/><p>Yet before, this restriction didn’t even exist. As long as one had enough point, any of the three areas were accessible, of course, not like many people could afford the costly price for the Purple and Red card zone.</p><br/><p>It was a bit pity, but in contrary, very few people cared about this matter.</p><br/><p>Not long after, the four of them reached the destination.</p><br/><p>Along the way, they encountered more and more people, some came individually, but mostly were in a group, and eventually, everyone stopped in front of a white circular building. Its exterior design closely resembled the auction house You XiaoMo had gone to.</p><br/><p>You XiaoMo gazed afar, “This is the Cultivation Center? What a majestic building, looks like there are plenty of spirit gems underground…”</p><br/><p>Tong YueXu was astonished, “What did you just say?”</p><br/><p>You XiaoMo quickly shook his head and shifted to another subject, “Nothing, so when can we go inside?”</p><br/><p>Tong YueXu answered, “We can go in right now. But since this is your first time here, maybe you should check out the Black card zone first to adapt the energy fluctuation of this place.”</p><br/><p>You XiaoMo nodded, “No problem. So, let’s go in.”</p><br/><p>Since there were too many people, they needed to line up. Thankfully it didn’t take much time, and they went with the people that flowed into the Black card zone.</p><br/><p>The stone rooms inside the Black card zone were circularly distributed. The Black card zone had a total of three passageway. Despite the fact all three passages belonging to the Black card zone, there were some differences, as each passage was charged for differently, there were passageways for two points, three points and four points respectively.</p><br/><p>Tong YueXu and Feng ChiYun used the third passage.</p><br/><p>You XiaoMo looked around first, then chose a vacant stone room on his side. However, he looked at Ling Xiao with glistening eyes, “Seems like a stone room can hold more than one person. Then, can we only pay one point, and both of us can come in and cultivate together?”</p><br/><p>“Don’t be silly, the academy must have long thought about this matter.” Ling Xiao immediately shaming him.</p><br/><p>You XiaoMo unwillingly made a sound, “Let’s try it first and we will see.”</p><br/><p>After his sentence, they opened the door. Entering their eyes were walls on every sides and there was almost nothing inside. The stone room was empty, but You XiaoMo saw there were four small square shape white podium dais, each of them was one meter square. In front of the dais was a small socket, which was used to swipe the card.</p><br/><p>Ling Xiao leaned against the door, interestingly laughed, “Look.”</p><br/><p>You XiaoMo pouted, shut the door and came closer.</p><br/><p>This dais must be the medium for cultivation. As long as one paid the points in advance, one would be able use the dais to cultivate.</p><br/><p>You XiaoMo asked, “Do you want to cultivate together?”</p><br/><p>Ling Xiao indifferently shrugged his shoulder , “Better than nothing.”</p><br/><p>Then Ling Xiao picked the dais on the opposite and swiped his purple card, four points were deducted from his card.</p><br/><p>You XiaoMo looked at Ling Xiao who had crossed his leg on the dais with curiosity. Seeing Ling Xiao’s cultivation situation was no difference to others, he then averted his eyes away. He took out his card and looked at the point on it. He nodded satisfyingly, looked like he wouldn’t need to earn points for a meanwhile, the points he owned was substantial enough for a long time.</p><br/><p>After swiping his card, You XiaoMo crossed his leg on the dais. As expected, he felt an endless surge of energy coming from the dais. It was a kind of energy that was much more pure than the spiritual energy and he could feel every pore on his body comfortably opening up.</p><br/><p>You XiaoMo immediately used the Heavenly Soul Scripture, and after a short while, he opened his eyes with a frown.</p><br/><p>Ling Xiao noticed his unusual expression, so he opened his eyes and asked, “What happened?”</p><br/><p>You XiaoMo scratched his head, “The energy absorption speed is a bit slow, ah wait, it more like, the energy transmission speed is a bit slow, it can’t keep up with my absorption speed.”</p><br/><p>Ling Xiao said, “Then we should switch the other stone room, we should go to the Purple card zone to try.”</p><br/><p>You XiaoMo, “But we only arrived here, if we don’t fully use what we have paid, it would be too wasteful.”</p><br/><p>Ling Xiao put his chin onto his hand, “You don’t like the slow speed, but you also dislike being wasteful, just say it straight, what do you want?”</p><br/><p>You XiaoMo guiltily laughed, “How about we go there tomorrow? That’s right, how is your cultivation, is it effective?”</p><br/><p>Ling Xiao raised his shoulder, “At my level, I can only accumulate bit by bit, of course, it not like there aren’t any other options, but…”</p><br/><p>You XiaoMo asked, “But what?”</p><br/><p>Ling Xiao glanced at him, then slowly smirked, “But, you are a level six mage, you are still unable to satisfy me ah!”</p><br/><p>You XiaoMo face went red, why did he feel another meaning in Ling Xiao’s word. This was definitely the result of being bullied by him everyday, that was why everytime he heard Ling Xiao say anything, he would always have a misleading association.</p><br/><p>“Can your current level only be increased by relying on magic pills?” You XiaoMo thought for a moment, then asked Ling Xiao.</p><br/><p>“Not necessary, but eating magic pills is the quickest way. As for the other methods, you could only wait for an opportunity to come by. Luck also has something to do with it. But luck is something that is much harder to grasp than fate. Sometimes, it could take thousands of years to encounter such luck.” Ling Xiao said.</p><br/><p>“Thousands of years?” You XiaoMo gaped and became speechless, no wonder Ling Xiao had no hope for luck to arrive. Even himself wouldn’t want to waste all of his effort onto some illusory luck, leveling up would be so much faster.</p><br/><p>You XiaoMo ensured, “I will work hard to level up.” You XiaoMo suddenly realized, he finally found his goal, which was to make Ling Xiao stronger.</p><br/><p>Ling Xiao laughed, “Yeah, I believe you.”</p><br/><p>Afterward, they really spent a day in this stone room before leaving this Black card zone for the Purple card zone, and they didn’t go back to their room halfway through. With their current cultivation, eating had become unnecessary, even the Breatharian pills You XiaoMo had refined before were not needed. However, You XiaoMo was already used to eating three meals a day, so occasionally he would treat himself to some food.</p><br/><p>Entering the Purple card zone was the same as the Black card zone, there were three passages, each passage cost five points, six points, and seven points respectively.</p><br/><p>When they were about to go in, they were stopped.</p><br/>\n</div>"}