{"title": "Chapter 307", "id": 307, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-307", "volume_title": "Volume 4", "body": "<h1>Chapter 307</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 307: Yin Ge</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Half a month later, Ling Xiao began his onslaught on the top hundred rankings.</p><br/><p>It had been a few months since the two had entered Ward A. Ling Xiao’s advertised level was not low, but as he had never challenged the top fifty people, his rank remained at the fifty-first rank, never increasing or decreasing.</p><br/><p>Many people had discovered this phenomenon. Those who could be ousted from the top fifty at any time were even more anxious and fearful. If they dropped from the top fifty, it would be even more difficult for them to raise their rank.</p><br/><p>Of course, there were also others who were dismissive of this.</p><br/><p>They believed that Ling Xiao did not dare to challenge others even if he was the top student in Block One of Ward B. In Ward A, one had to obediently submit no matter if they were a dragon or a worm.</p><br/><p>Therefore, when Ling Xiao suddenly sent a challenge to the Fiftieth ranking Tang MengCheng, all the students were in an uproar, and then each and everyone took on a ‘watching a good show’ attitude.</p><br/><p>“The number two in the Stone Gate, Tang MengCheng. Although the Tang Family is not very famous in Yan City, they have a very good relation with the Chai Family. The daughter of head of the Tang Family, Tang YinYin, is Chai Jun and Chai Zheng’s mother who had married the current head of the Chai Family thirty years ago. Furthermore, she has retained her status as the head wife, and is an extremely capable woman. Under her protection, the Tang Family could be described as flourishing, and no one would dare to offend them. As the sole heir of the Tang Family, Tang MenCheng’s status is even loftier. It just so happens that his cultivation talent is top-notch so he is somewhat supercilious and bigoted.”</p><br/><p>After knowing that Ling Xiao had challenged Tang MengCheng, Tong YueXu came over to personally deliver the news.</p><br/><p>Despite the fact that this current situation surprised him a little, when he thought of the relation between the Chai Family and the Stone Gate, such a development was to be expected.</p><br/><p>You XiaoMo asked, “How strong is this Tang MengCheng?”</p><br/><p>Tong YueXu replied, “Tang MengCheng’s is a six star Celestial level practitioner. You should be careful when dealing with him. He is a person who will resort to any means to attain his objective.”</p><br/><p>Resort to any means? No matter how despicable his means were, it could not be more despicable than Ling Xiao!</p><br/><p>Furthermore, until now he had not seen any who had dared to play tricks in front of Ling Xiao remain safe and secure.</p><br/><p>You XiaoMo was not worried about this point at all.</p><br/><p>Feng ChiYun abruptly asked, “Why are you guys so certain that Tang MengCheng will accept the challenge?”</p><br/><p>You XiaoMo let out a proud smile when speaking of this and said, “You wouldn’t know this, but I accompanied Ling Xiao when he sent the challenge. The people from the Stone Gate and I have a little grudge, and there was someone inside who recognized me. And as Tong-dage said, this Tang MengCheng is supercilious and arrogant guy. Faced with a challenge from a person with a lower rank than him, it’s impossible that he won’t accept it. Maybe the Stone Gate is currently setting off fireworks to celebrate Ling Xiao sending himself to slaughter!”</p><br/><p>Feng ChiYun nodded in clear understanding. He had been in closed-door cultivation so he did not know of these matters.</p><br/><p>In the afternoon, an immense crowd flocked towards the arena.</p><br/><p>Besides the Cultivation Center, the arena in Ward A’s arena had the highest traffic flow, and there would be a variety of interesting challenges occurring daily.</p><br/><p>Before setting off, You XiaoMo met Tang YuLin who had been looking for him. Both were surnamed Tang, but they belonged to a different clan, and based off their characters, Tang YuLin and the Tang Family were too different.</p><br/><p>BaiLi TianYi had followed Tang YuLin over. Ever since Tang YuLin rose to Ward A, this fella stuck to him wherever Tang YuLin went and was as sticky as a slug. Tang YuLin was unable to remove him, so he had no choice but to let BaiLi TianYi follow.</p><br/><p>“Yo, everyone!” BaiLi TianYi greeted everyone with a smile.</p><br/><p>“Hello!” You XiaoMo politely smiled back. BaiLi TianYi had always given him a good impression.</p><br/><p>“Looks like your destination is the arena. I’m just about to head there too. Do you want to go together?” BaiLi TianYi shot an unobtrusive glance at Ling Xiao.</p><br/><p>You XiaoMo looked at Tang YuLin, “I’m busy now, why don’t we discuss this when we come back?”</p><br/><p>He understood that Tang YuLin would definitely not come over to look for him if there was nothing, especially after You XiaoMo had teased him a little bit the last time. Therefore it was very possible that he came over as he had collected some of the herbs from the list.</p><br/><p>Tang YuLin looked at everyone, and then he nodded.</p><br/><p>The group grandiosely headed toward the arena. At the arena, the scene of people as far as the eye could see made You XiaoMo feel that the oxygen in the air had been drawn away. His back was nearly sweating after being pushed all around in the crowd.</p><br/><p>There were numerous competition stages in the arena and the duel between Ling Xiao and Tang MengCheng was at the eighth competition stage. There was already a large crowd surrounding the periphery of the stage when they arrived.</p><br/><p>On the way, Tang YuLin had been pulled away by BaiLi TianYi.</p><br/><p>As a famous expert in the top hundred ranking, there were naturally many people who sent challenges to BaiLi TianYi. The challenges did not only come from those who wished to rise into the top hundred ranking, but also came from those who were in the top fifty rankings – all for the purpose of rising in rank.</p><br/><p>BaiLi TianYi originally did not intend to accept their challenge, but when he thought of Tang YuLin, he decided to let Tang YuLin see his valiant and heroic bearing. However, he only accepted one challenge.</p><br/><p>On the other side, You XiaoMo and his group had reached the eighth competition stage.</p><br/><p>Tang MengCheng had not arrived, but many from the Stone sect were present.</p><br/><p>Seeing that he had arrived, each and every one looked over with hostile glares, particularly the two who had been schooled by You XiaoMo at the sales area, and the man who had been mocked at the entrance of the Cultivation Center. The three looked at him as if he was the killer of their father.</p><br/><p>Feng ChiYun said, “Your ability to offend people is really strong.”</p><br/><p>You XiaoMo joked, “You can’t blame me for that. They were the first to strike. I couldn’t possibly stand there motionlessly and let them beat and scold me.”</p><br/><p>Feng ChiYun replied, “That’s true!”</p><br/><p>Suddenly he the subject changed and asked, “Do you know the three over there? They seemed to have been looking at us.”</p><br/><p>You XiaoMo followed his line of sight and peered over. Within the chaos of the crowd, he saw a head of familiar silver hair, and abruptly remembered the three he had met in the Red card area. Although it had been some time since they had last met, he remembered at once when he saw the silver-haired man.</p><br/><p>Ling Xiao leaned over, “You know them?”</p><br/><p>You XiaoMo quickly replied, “I don’t, I only saw them once at the Cultivation Center.”</p><br/><p>Ling Xiao was dissatisfied and said, “Then why were they looking at you?”</p><br/><p>You XiaoMo retorted, “How would I know?!” He also wanted to know why.</p><br/><p>At this time, Tong YueXu walked over and stated, “I know those three. That silver-haired man is number one on the top hundred rankings, Yin Ge. He is extremely powerful and he rarely puts in an appearance. He has held the first place for three years and no one has ever snatched it from his hands before. However, he has a cold temperament and seldom speaks.”</p><br/><p>You XiaoMo inquired, “Then the other two ne?”</p><br/><p>Tong YueXu replied, “The man who looks very gentle is called Zhan YuXuan, and he holds the third rank. He is very close to Yin Ge. Many people have felt that it was strange, as Zhan YuXuan had such a good temperament, how could he be such good friends with Yin Ge.”</p><br/><p>You XiaoMo asked again, “Then how about that woman?”</p><br/><p>Tong YueXu responded, “That woman is called An YunRui. Her rank is lower, just falling nicely at the tenth rank. She’s the only woman in the top ten. With her beauty and a pretty good temperament, there are many chasing after her. However, it is rumored that she likes Yin Ge, but with Yin Ge’s personality, her road to lover is bound to be bumpy.”</p><br/><p>You XiaoMo gave Tong YueXu a weird look.</p><br/><p>Tong YueXu touched his face, not understanding what happened and asked, “What?”</p><br/><p>You XiaoMo smiled, “I found that you are actually quite gossipy!”</p><br/><p>Tong YueXu made a rarely seen outcry and flushed, “This is not gossiping, many people know these things. If you probe around, everyone will say as such.”</p><br/><p>You XiaoMo laughed but he did not tease Tong YueXu anymore, and continued his questioning, “Do they have a match today?”</p><br/><p>Tong YueXu gave a slight sigh of relief, “No they don’t. Very few dare to challenge Yin Ge and Zhan YuXuan. As for An YunRui, because she’s a woman, if one challenged her, many would hold them in contempt. Although everyone wants to enter into the top fifty, they do not want to shame themselves/lose face.”</p><br/><p>You XiaoMo asked, “Since they don’t have a match, why did they come here?”</p><br/><p>Tong YueXu replied, “Maybe they found a person that caught their attention? This is especially so for Yin Ge, as he would not come to the arena if there was no need for it. Therefore there should be someone who caught his attention.”</p><br/><p>You XiaoMo let out an ‘oh’ sound!</p><br/><p>You XiaoMo queried, “That’s right, who is the second ranking person?”</p><br/><p>Tong YueXu was astonished, “Don’t you know? It’s BaiLi TianYi.”</p><br/><p>You XiaoMo immediately looked in the direction of BaiLi TianYi’s competition stage, where the latter had already ascended up the stage.</p><br/><p>This time there was no need for him to ask as Tong YueXu automatically explained, “BaiLi TianYi has a sworn enemy that’s ranked fourth on the top hundred ranking. He will send BaiLi TianYi a challenge every month, but he has never won once.”</p><br/><p>You XiaoMo laughed, “This poor guy. But I have to say that he really has perseverance.”</p><br/><p>Tong YueXu said, “I forgot to tell you, that person is Tong YueXu’s cousin, Teng Yu.”</p><br/><p>You XiaoMo immediately changed his tune, “This audacious guy! I really hate this sort of person who endlessly pesters others!”</p><br/><p>Tong YueXu, “… …”</p><br/>\n</div>"}