{"title": "Chapter 327", "id": 327, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-327", "volume_title": "Volume 4", "body": "<h1>Chapter 327</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 327: I’m so Nervous</p><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>Even though the Trials had only started four, five days ago, a quarter of the tasks had already been completed.</p><br/><p>Although, the most surprising fact was that all the top five tasks had been completed.</p><br/><p>The fifth task by Teng Yu, the fourth by Gao Yang, the third by Yin Ge, the second by BaiLi TianYi and due to the sudden turn of events, BaiLi made an agreement with Zhan YuXuan to exchange the life crystal with what Zhan YuXuan wanted.</p><br/><p>As for the first Task, no one thought Ling Xiao and his partner could do it, but they did.</p><br/><p>After Yan Fa had one of the Elder’s record the results, he told everyone to leave except for Ling Xiao and You XiaoMo, taking them with him.</p><br/><p>You XiaoMo felt butterflies in his stomach as he pondered whether to speak of the incident with Dong Shen. He was hesitant since it was related to his secret. If he chose not to tell and they came again, the commotion would not go unnoticed by the Vice Principal.</p><br/><p>You XiaoMo looked over at Ling Xiao, if he had known earlier, he could’ve fully prepared a proper testimony with Ling Xiao.</p><br/><p>That was when Ling Xiao spoke directly in his mind, “Just leave this to me, you just need to nod.”You XiaoMo blinked in response, an indication that he understood.</p><br/><p>A while later, Yan Fa finally brought them to their destination, a meeting room. Inside, five people stood wearing serious expressions, emitting a suffocating and oppressive pressure.</p><br/><p>There was only one-person You XiaoMo recognized and that was the Fifth Elder Dong Han.</p><br/><p>As Yan Fa walked in, he gestured in obeisance towards the Elder who stood in the center wearing a black cloak and spoke, “Grand Elder, I have brought them both.”</p><br/><p>As the black cloaked Elder nodded with a frigidness, his piercing gaze landed on Ling Xiao and You XiaoMo.</p><br/><p>You XiaoMo felt his heart race as the tension caused him to break out in a cold sweat. The Elder’s imposing manner was so nerve-wrecking that with just a glance, You XiaoMo’s knees almost buckled beneath him.</p><br/><p>Ling Xiao too, showed a little sign of weakness as his face paled, to not raise suspicion, but not to the point of You XiaoMo of course.</p><br/><p>With the corner of his eyes, You XiaoMo caught this and couldn’t help but curse at Ling Xiao’s award winning acting skills.</p><br/><p>“In detail, recall the events you saw at Uneven Slopes,” the Grand Elder finally spoke, his voice didn’t sound old, but instead a hint of youthfulness in it.</p><br/><p>As Ling Xiao was about to speak, the Grand Elder suddenly turned to You XiaoMo and said, “You’ll speak instead.”</p><br/><p>You XiaoMo’s eyes widened immediately. Did they need to be this cautious?</p><br/><p>He didn’t dare look over to Ling Xiao since everyone was staring at him, as if to find some sort of clue.</p><br/><p>At this point, You XiaoMo was sweating all over. He quickly tried to reorganize his scattered brain, attempting to find the right answer. After a while he finally stuttered something out, “I-it’s…a-a-actually…ummmm….”</p><br/><p>As Yan Fa listened to this horrific response, he felt the slight urge to palm his forehead.</p><br/><p>“Don’t rush, talk slowly,” he advised.</p><br/><p>Instantly You XiaoMo turned to Yan Fa and responded, “You are all looking at me and it makes me nervous.”</p><br/><p>The corner of Yan Fa’s lip twitched.</p><br/><p>The reality was, facing so many dignified Elders, You XiaoMo felt the nervousness of being pulled out during class to recite a poem from memory. To someone of little presence as him, that kind of emotional pressure was beyond great. Not only that, he still hadn’t been able to organize his thoughts, much less communicate it.</p><br/><p>After a few seconds of staring, the Grand Elder finally gave up and turned towards Ling Xiao, “You speak instead.”</p><br/><p>With unchanging expression, Ling Xiao started, “Yes Grand Elder, what happened was…” Ling Xiao’s rendition of the events at Uneven Slopes transformed them, the main characters, into bystanders. As the two sides fought, they sneaky slipped in and when the level nine demon beast went to spectate, they dug up the Ling Cao. As for who was fighting? They had no idea.</p><br/><p>Although when Dong Shen come find them again, the lie would be exposed, but to deal the Grand Elder, this was the only answer. They didn’t have a better reason as to why they were able to complete the task.</p><br/><p>“Is that all, were you able to catch their appearances?” Asked the Grand Elder.</p><br/><p>“No, it was too far away but this student did see a gigantic demon beast appear above Uneven Slopes. That beast was of a deep blue color, as were his eyes, very beautiful just like the Sirens. This student can tell, it was stronger than the Bird of Pride of Uneven Slope.” Ling Xiao replied.</p><br/><p>“Could it have been…the Netherworld Siren?” Yan Fa immediately thought of this demon beast and according to his description, it was most likely the case. However, how could an Emperor Beast appear on Long Xiang Continent?</p><br/><p>“Since that person dared kill one of our students, we will find them no matter what!” The Grand Elder spoke turning to You XiaoMo and Ling Xiao, “You may go now, remember, do not speak a word about this to anyone.”</p><br/><p>Assenting to this, the two left.</p><br/><p>After they walked out, then did the Second Elder speak, “Grand Elder, do you think they lied?”</p><br/><p>Before the Grand Elder replied, the Elder wearing yellow, the Third Elder explained, “Why would they have an incentive to lie? I went with the Grand Elder to the scene, according to the scent left behind, I’m almost confident it was that Netherworld Siren.”</p><br/><p>“Those people wouldn’t have appeared at Uneven Slopes without a reason. For the time being, keep a close eye on it, if they have an objective, they will appear again.” Concluded the Grand Elder.</p><br/><p>Once out of the meeting room, You XiaoMo let out a sign of relief.</p><br/><p>Just as he was about to speak, Ling Xiao stopped him.</p><br/><p>You XiaoMo instantly covered his mouth. He knew, the walls had ears, although there were really no walls surrounding them.</p><br/><p>In this unscientific world, something like science could just disappear!</p><br/><p>Looking at his face that spelled “I know” across it, the corner of Ling Xiao’s mouth twitched a little, but he said nothing.</p><br/><p>Once You XiaoMo saw the accommodation area, he couldn’t hold it in any longer, “Can I talk now?” He felt as if he was going to suffocate to death with all the queries he had.</p><br/><p>Ling Xiao looked over, “What do you want to say?”</p><br/><p>As You XiaoMo opened his mouth to speak, the corner of his eyes caught sight of everyone staring at them and quickly said, “Never mind, let’s talk later.”</p><br/><p>Just as if he saw an idiot, Ling Xiao looked at him and quickly walked on.</p><br/><p>You XiaoMo rubbed his nose feeling a little guilty and followed suit.</p><br/><p>Once they were back, You XiaoMo conscientiously closed the door and just as he was about to walk in, there was a knocking sound. Impatiently he turned to find Tang YuLin at the door, probably seeking information.</p><br/><p>Before he said anything, You XiaoMo spoke, “The Grand Elder told me to not say anything.”</p><br/><p>Puzzled, Tang YuLin asked, “What ‘thing’?”</p><br/><p>Anxiously You XiaoMo replied, “What else could it be, it’s about the death of the six students!”</p><br/><p>Tang YuLin looked at him hesitantly and said, “My deepest condolence to you!”</p><br/><p>You XiaoMo: “What?”</p><br/><p>This sounded so familiar!</p><br/><p>Tang YuLin patted his shoulder in comfort, “People can’t come back to life, I know you’re sad, but you still have to give me your points.” As he spoke, he pulled out his magic bag. As You XiaoMo was attending the Trials, he was gathering some high-level magic herbs and it cost him a bunch of points. So, the moment You XiaoMo came back, he rushed over for repayment.</p><br/><p>You XiaoMo took a deep breath.</p><br/><p>He was wrong, Tang YuLin was not on the same wavelength.</p><br/><p>“Level Nine Magic Herbs were hard to find, it took me three hundred points to get two immature stalks and twenty or so Level Eight Magic Herb seeds.” Tang YuLin spoke with glittering eyes as he stared at You XiaoMo. One hundred and fifty points for one immature magic herb stalk didn’t sound that bad, but this was the result after his constant bargaining. To obtain this deal for these two stalks of magic herbs, he went to find the seller every single day to ‘converse’, and only stopped until the seller sold to him.</p><br/><p>The higher level the Magic Herb, the less likely it was on the market, thus most of what Tang YuLin found were seeds. It was fortunate that was exactly what You XiaoMo had wanted.</p><br/><p>Including the delivery fee, You XiaoMo gave Tang YuLin five hundred points in total. Level Eight Magic Herbs’ seeds were worth a lot, but also not that much since it took hundreds of years to blossom. It was usually a hard sell so twenty or so seeds for one hundred points was not cheap, and a hundred points were for the delivery.</p><br/><p>Really, who could be this generous!</p><br/><p>Tang YuLin was usually an opportunist.</p><br/><p>Sending away the miser Tang YuLin, You XiaoMo was finally going to lock the door, no matter who knocked, he wasn’t going to open it. But alas, as he was about to lock it, “knock, knock…”</p><br/><p>You XiaoMo peeked out behind the door, as he saw Tong YueXu, he laughed, “Tong-dage, are you here for gossip?”</p><br/><p>Tong YueXu felt his words get stuck within his throat, “No…I’m just here to see you.”</p><br/><p>“Well, you saw me.”</p><br/><p>“…Yes.”</p><br/><p>“I won’t see you out then!” With a slam, he shut the door.</p><br/><p>“…”</p><br/>\n</div>"}