{"title": "Chapter 324", "id": 324, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-324", "volume_title": "Volume 4", "body": "<h1>Chapter 324</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 324: Life Experience</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Though Ling Xiao had wanted to chase after them, Dong Shen’s Sword of Breath hindered his movements.</p><br/><p>The two were good at escaping. By using the Sword of Breath to block him off, the two had already made a clean getaway when he had finished dealing with the sword.</p><br/><p>However… …</p><br/><p>A chilling light flashed across Ling Xiao eyes as two purple flames shot out from his fingertips, heading towards the backs of the escaping two. The violet fire sped along whilst carrying a dreadful pressure and the power to destroy all things. The two soon discovered the flames pursuing them.</p><br/><p>The Netherworld Siren’s expression slightly changed. The pressure from this flame was more threatening than the ones before. It was fortunate that he would be able to deal with it with his level of strength, but Dong Shen was not that fortunate.</p><br/><p>A fair bit of his spiritual power had been used up since he had deployed the Sword of Breath. The Qilin Sacred Fire immediately reached him, and Dong Shen gave a blood-curdling screech as it climbed up his arm.</p><br/><p>The Netherworld Siren rapidly flashed to his side, cutting his arm off with a swipe of his hand. Then he carried Dong Shen and hastily sped away. The arm that was cut off fell into the forest below.</p><br/><p>Ling Xiao looked in the direction they had run in and coldly snorted, “They’re actually quite fast at escaping.” He suddenly looked in another direction after he said that. A second later, he returned to You XiaoMo’s side, picked him up and said, “Let’s go!”</p><br/><p>The Bird of Pride took on a human form. Together with SheQiu, he followed behind as they rapidly left the scene of the battle.</p><br/><p>The perception of the Bird of Pride and SheQiu was strong. There were two extremely powerful people heading over in their direction from DaoXin Academy and they would arrive soon.</p><br/><p>The sound of piercing winds rang out as two figures whistled through the air, appearing above the Uneven Slopes fifteen minutes later. They were an elderly man clad in yellow clothes and an elderly man in black robes, both who were unfamiliar to You XiaoMo.</p><br/><p>There were many vestiges of the battle left on the scene as a battle had just occurred here.</p><br/><p>The yellow-clothed elderly man closed his eyes and spread his senses out. Then he opened his eyes, “Great Elder, the ones here have long been gone.”</p><br/><p>The black-robed elderly man faintly nodded. He looked below at the destruction that caused the Uneven Slope to be riddled with gaping holes. His mien was somewhat solemn as he stroked his beard, “It seems that this destructive power does not belong to an ordinary expert.”</p><br/><p>The elderly man in the yellow robes replied, “That Bird of Pride seems to be involved too… …”</p><br/><p>Traces of the Bird of Pride’s aura remained at the scene, but the aura was awfully faint as he did not take part in the battle. They would probably know who were fighting if they could find him.</p><br/><p>There were not many strong experts on the Long Xiang Continent and the two knew most of them. However, they both did not recognize the aura left on the scene. Therefore, the culprits were either outsiders, or some old guy that was a hidden recluse.</p><br/><p>“Though the Trials are still in progress, we’ll have to suspend it.” The black-robed man gently sighed. Since they were unable to discover the origins of the people that had been fighting, it was natural for the Trials to be suspended as the academy could not let the students be exposed to unknown dangers.</p><br/><p>With that, the two soared away and vanished into the horizon.</p><br/><p>Meanwhile, Ling Xiao and You XiaoMo had left the Uneven Slopes far behind. Only until they could not see the Uneven Slopes did they slow down.</p><br/><p>Ling Xiao turned back to the Bird of Pride, “Return to the Uneven Slopes and find a chance to bring the stalk of level nine magic herb over.”</p><br/><p>The Bird of Pride did not hesitate and left after agreeing. He had witnessed Ling Xiao’s strength so he absolutely would not dare to play tricks on him.</p><br/><p>You XiaoMo patted Ling Xiao’s shoulder, “Put me down.”</p><br/><p>Ling Xiao looked down and saw You XiaoMo staring at him with fixed eyes. He lightly coughed then he put You XiaoMo down, “We’ll wait for the Bird of Pride to bring the magic herb back before returning. The old guys at the academy already know of what occurred at the Uneven Slopes. It’s very possible that the Trials will be stopped.”</p><br/><p>You XiaoMo nodded and looked at him in askance, “Ok. But before that, is there not something you should tell me?”</p><br/><p>Ling Xiao innocently blinked, “What do you want me to say?”</p><br/><p>You XiaoMo made a long face, “I want to say what you’ve hidden?”</p><br/><p>Ling Xiao recalled for a moment, “There’s quite a lot.”</p><br/><p>You XiaoMo’s charming face was full of spider webs in a split second. This fellow actually concealed so many things! His mood blackened and he yelled, “If you have that many then you say them all!”</p><br/><p>“Okay.” Ling Xiao helplessly raised his hands, “You’re the one who wanted me to say it. To tell the truth, one time we made love on the bed, I deliberately did not clean your insides oh. I left my sperm within your body.”</p><br/><p>You XiaoMo blushed all over, flustered and exasperated, while kicking Ling Xiao’s leg, “How are you so shameless? To actually leave your spe… …Pei! Who said to talk about these things?! You better give me an honest account about this Qilin matter.”t/n: Pei = to spit, which is like saying Fuck</p><br/><p>You XiaoMo bluntly cut to the main point. Who knew if he would say something deathly embarrassing again?</p><br/><p>SheQiu tried his best to act as if he was invisible on the sidelines. Boss Ling Xiao still appeared to have the upper hand despite him being in the wrong. He definitely deserves to be called the Boss.</p><br/><p>Ling Xiao laughed, “What’s there to talk about for that? Isn’t it just like what you’re thinking of?”</p><br/><p>“That person said that your purple flame is the Qilin Sacred Fire. Then what’s the red flame? I’ve seen you using more than one type of flame.” You XiaoMo gave a ‘humph!’ with his nose in the air, don’t think that he didn’t realize it.</p><br/><p>“When did you become so smart?” Ling Xiao exclaimed.</p><br/><p>“I’m already clever, don’t change the subject.” You XiaoMo would not be fooled no matter what was said. This time he must get Ling Xiao to tell him everything.</p><br/><p>Ling Xiao elucidated, “The red flame is the Ancient Demon Phoenix’s natal flame. Although its strength is inferior to the Qilin Sacred Fire, it is ranked in the top three in the Sacred Fires’ power ranking.”</p><br/><p>You XiaoMo blinked, “You said the Ancient Demon Phoenix. Does it refer to the Fenghuang?”</p><br/><p><strong>t/n: Unlike the Phoenix of Western mythology, the Fenghuang is in fact two birds – the male (Feng) and the female (Huang). The Fenghuang also looks different from its Western counterpart in that a very colorful and fiery plumage and its tail is colored in the five sacred colors: red, blue, yellow, white, and black. Fenghuang is also a true immortal bird as it does not grow old and die to be reborn again, unlike the Phoenix. In context, Ling Xiao said (Demon)(Huang), so You XiaoMo was unsure if Ling Xiao meant the Fenghuang(Phoenix).</strong></p><br/><p>Ling Xiao, “You could say that.”</p><br/><p>You XiaoMo looked at him with an odd expression, “Since you have the Qilin Sacred Fire and the Demon Phoenix’s natal fire. Could it be that you’re a hybrid?”</p><br/><p>He had thought that Ling Xiao would refute it, but Ling Xiao unexpectedly sighed in defeat.</p><br/><p>“You’re correct. My father is a Qilin, and my mother is an Ancient Demon Phoenix. Their union led to me, so I have inherited the natal fires of the Qilin and the Ancient Demon Phoenix.”</p><br/><p>“That’s… …not bad ah.” You XiaoMo did not know what he was resigned about. At the least, he thought that it should be a lot more awesome to have inherited the ability of two formidable clans unlike other people ba.</p><br/><p>Ling Xiao sighed, “It’s not as simple as you think.”</p><br/><p>You XiaoMo, “What do you mean?”</p><br/><p>Ling Xiao explained, “The relations between the Qilin and Ancient Demon Phoenixes are quite bad. Elite races are very particular about blood purity, thus the union between my father and mother made both races dissatisfied. Before this happened, while the relations between the two races were not particularly close, it also wasn’t particularly bad. But when the affair between my father and mother was exposed, the relations between the two races thoroughly worsened.”</p><br/><p>You XiaoMo felt that he could guess what had occurred next and though he could not bear to reopen Ling Xiao’s scars, he could not restrain his curiosity, “Then what happened afterwards?”</p><br/><p>“Afterwards ah… …” Ling Xiao sorrowfully recalled, “The Qilin Clan claimed that it was my mother who seduced my father. The Demon Phoenix Clan then claimed that my father seduced my mother. They pushed the blame around and my parents were separated and locked up by their respective clans in the end. It roughly went like that.”</p><br/><p>“Then how about you? You XiaoMo was captivated as he listened to the sensational story. But this ending was not really good. How was Ling Xiao born if his parents had been locked up?</p><br/><p>Ling Xiao knew what he was thinking, “I was born before my parents were locked up. The one who brought me up was my father’s trusted aide and he was the one to tell me about my parents’ situation. He allowed me to save them after I grew stronger. However, I presently don’t have enough strength to simultaneously confront the Qilin and the Fenghuang Clan. Therefore I need to become even stronger and turn into an existence that the Qilin Clan and Demon Phoenix Clan are afraid of.”</p><br/><p>You XiaoMo felt a turbulence of emotions after hearing his story.</p><br/><p>He had never thought that the full of mettle and insufferably arrogant Ling Xiao would have such a tragic life experience. Although his parents were still alive, it was not much different from them being deceased.</p><br/><p>“Eh… …Don’t be sad, you’ll become stronger someday. I-I’ll help you.” You XiaoMo looked at Ling Xiao with determination. He did not really know how to comfort people.</p><br/><p>“Really?” Ling Xiao buried his head in You XiaoMo’s neck as his subdued voice slowly echoed out.</p><br/><p>“Really, I’ll work harder in my cultivation, and then I’ll be able to refine higher level magic pills.” You XiaoMo was not used to Ling Xiao behaving in this way and was somewhat uneasy.</p><br/><p>“Then… …can you agree to a request of mine?”</p><br/><p>“What request?”</p><br/><p>“I want to do it here.” Sensing his reservation, Ling Xiao fell silent for a moment, “We have not done it for five days already. Moreover, you made a promise before.”</p><br/><p>Oh my god, don’t say such a shameful thing out loud using this grief-laden tone! If he used such a tone, You XiaoMo wouldn’t know how to reject him. The worse thing was that his heart had already softened.</p><br/><p>You XiaoMo had never thought that Ling Xiao would put forward such a request. This was a wild, mountainous country with demon beasts all around. Just thinking about a demon beast suddenly appearing while they were doing it halfway was enough for him to feel humiliated to death.</p><br/><p>But Ling Xiao did not say anything. He had definitely promised after he had lost in the previous race. Furthermore, the request was also in line with the on-site conditions, as what he promised that time was a “battle” in the wilderness!</p><br/><p>“But, SheQiu is here… …” You XiaoMo squeaked out.</p><br/><p>“I have already put him back into the dimension.” Ling Xiao replied.</p><br/><p>“…”</p><br/><p>The heavens had aligned with the right place, time and people. It seems that it’s impossible to disagree.</p><br/><p>In the dimension, SheQiu stood in a desolate meadow and speechlessly face-palmed. Master ah, Master, looks like in this lifetime, you’re destined to be eaten to death by Boss Ling Xiao. With Boss Ling Xiao’s personality, how would be possible for him to have that sort of sorrowful expression? Did you not see the corner of his mouth repeatedly rising up?</p><br/>\n</div>"}