{"title": "Chapter 334", "id": 334, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-334", "volume_title": "Volume 4", "body": "<h1>Chapter 334</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 334: Return</p><br/><p>Translated by Kollumceti and Crystal of Exiled Rebels Scanlations</p><br/><p>It was only after overhearing everyone’s discussion did Zhao DaZhou realize that someone had sneaked in and attacked them during the duel. Fortunately, someone strong saved them, otherwise XiaoHu and him could have lost.</p><br/><p>Just as Zhao DaZhou thought to look for the person who rescued XiaoHu and him, an excited voice arose from below the stage.</p><br/><p>“Fifth-shixiong, we’re here.” The voice was exceptionally familiar and Zhao DaZhou, for a moment, didn’t react.</p><br/><p>When he saw the person waving at him from below the stage, Zhao DaZhou was so thrilled that he bounced over and even forgot to call back his cute little tiger.</p><br/><p>“Little-shidi, I’ve finally found you.” Zhao DaZhou hugged You XiaoMo with such eagerness that his eyes nearly fell out. Only heaven knew the struggles he went through on the road from TianXin Sect to Yan City.</p><br/><p>You XiaoMo was also happy to be able to see a familiar face in a foreign land. Like two overgrown kids, You XiaoMo and Zhao DaZhou spun around as they hugged. This was a rare moment when Ling Xiao did not stop him from getting too close to another man.</p><br/><p>The Lei Tian Platform was naturally not a good place to talk and Zhao DaZhou could be considered a main player during the incident so there was many who were paying close attention. Therefore, You XiaoMo refrained from the serious business and instead asked about how he had started the feud with the youngster on the way.</p><br/><p>The cause of this incident could be said to be due to Zhao DaZhou’s incitement, however, the continuation was not all completely his fault.</p><br/><p>It was the first time that Zhao DaZhou and the cute little tiger had visited such a big city, so they were naturally shocked to witness such a sight. It was rare for the cute little tiger was to be so interested, thus the human and beast enthusiastically strolled around. During that, the cute little tiger accidentally knocked into that youngster, and even stained his clothes with something dirty.</p><br/><p>As one could imagine, the youngster was not very forgiving. Zhao DaZhou soundly apologized, but the youngster refused to budge on teaching the cute little tiger a lesson. Zhao DaZhou took offense, thus sparked the duel at the Lei Tian Platform.</p><br/><p>Fortunately the incident had been resolved, and thus the youngster and his entourage became but a brief interlude.</p><br/><p>The party hastily returned to the inn. Since it concerned personal business, on the way, Gao Yang and his teammates bid their farewells and returned to DaoXin Academy.</p><br/><p>Closing the door, You XiaoMo even let Ling Xiao put up a layer of wards on the outside of the room to prevent others from eavesdropping.</p><br/><p>But Ling Xiao just looked at him with disdain.</p><br/><p>“Fifth-shixiong, tell me quickly, what happened to the TianXin Sect? Was it Ye-shishu who send you here?” Once he opened his mouth, You XiaoMo shot out a barrage of questions.</p><br/><p>Zhao DaZhou knew that his Little-shidi was very anxious. He had been prepared to tell him about this matter, so he explained calmly and thoroughly, “For the time being, the TianXin Sect is all right. You don’t need to worry. It is indeed Ye-shishu who sent me to look for you.”</p><br/><p>Originally, the best candidate to send over to You XiaoMo was Fang ChenYue as he was more tactful. However, Fang ChenYue and Fu ZiLin had left the TianXin Sect a year ago to go on a journey, and no one was sure when they would be back.</p><br/><p>Ye Han couldn’t possibly have sent a random person to look for You XiaoMo and Ling Xiao, therefore he could only resort to Zhao DaZhou, the one who You XiaoMo was usually the closest to.</p><br/><p>Zhao DaZhou did not disappoint him either. Knowing that You XiaoMo could be in danger, he took on this task without demur and did not even ask for a reason. However, Ye Han did fill him in a little.</p><br/><p>You XiaoMo discovered that everything proceeded as per Ling Xiao’s speculations, and asked, “Then, it was Ye-shishu who revealed the information that we’re in DaoXin Academy?”</p><br/><p>Zhao DaZhou was not thick, and he knew what You XiaoMo was alluding to.</p><br/><p>Zhao DaZhou said, “It was indeed Ye-shishu who revealed that information. However, you should not blame him either, as he did it for the sake of the TianXin Sect. Those people were just too strong. If he did not reveal it, only destruction awaited the TianXin Sect.”</p><br/><p>“Then did he not consider our situation?” You XiaoMo said with a tint of distraught.</p><br/><p>Zhao DaZhou suddenly laughed, “Ye-shishu said that you guys would be fine.”</p><br/><p>Actually, in the beginning, he did not believe it either as those people were truly strong. Even the sect master and the great elders could not beat them, but now seeing them completely fine, he believed in Ye Han’s words.</p><br/><p>“What does that mean?” asked Ling Xiao.</p><br/><p>Zhao DaZhou looked at Ling Xiao. He never understood why his Xiao-shidi would be together with this person, but since this was his choice, there was nothing Zhao DaZhou could say. And proven by the situation, if Ling Xiao was not by his Xiao-shidi’s side, his Xiao-shidi would not have come out unharmed.</p><br/><p>“Ye-shishu said you’re stronger than those people, and you guys were living in DaoXin Academy. No matter how strong those people were, they would not dare to challenge the DaoXin Academy. Therefore, even if he told them your whereabouts, they could not have done anything to you guys either.”</p><br/><p>“He sure is confident.” Ling Xiao said as he smirked.</p><br/><p>This Ye Han was not to be taken lightly. In fact, he was more suitable to be the sect master. Unfortunately, he had his ambitions elsewhere; otherwise Zhou Peng would not be the one in the sect master’s position.</p><br/><p>You XiaoMo also had to admit that Ye Han’s actions were correct. With one move, he could let them know that there were people coming, harboring ill will, and protect the TianXin Sect – it was just like killing two birds with one stone.</p><br/><p>Although half of You XiaoMo’s memories from the TianXin Sect were not good, the current TianXin Sect was not the same as the past and he no longer wished for the eradication of the TianXin Sect.</p><br/><p>“In addition, Ye-shishu told me to convey something to you guys.” Zhao DaZhou continued, “Ye-shishu said that the reason those people would have knocked on the TianXin Sect’s door would be related to your hometown, Peach Blossom Village. Furthermore, Jiang Liu, who also originated from Peach Blossom Village and joined the TianXin Sect together with you, disappeared after the event. Ye-shishu also said that if you want to know the truth, it’s best to head to Peach Blossom Village. Maybe you’ll be able to unveil the truth.”</p><br/><p>t/n: Jiang Liu first appeared in Chapter 1. He came from the same hometown as You XiaoMo and was also the one who helped Tang YunQi kidnap You XiaoMo in Chapter 71.</p><br/><p>You XiaoMo felt deeply that he would have to make a trip back as expected.</p><br/><p>Ling Xiao was indifferent to it all. He had never objected to returning, and they needed to get to the bottom of this matter. Otherwise, it was not possible for them to determine the real objective of that group.</p><br/><p>“How did Jiang Liu disappear?” Some memories surfaced for You XiaoMo after hearing this familiar name once more. Naturally, the memories were nothing good.</p><br/><p>Zhao DaZhou shook his head, “We don’t know, he just disappeared suddenly.” He had no real impression of Jiang Liu. The TianXin Sect did dispatch some people to look for him after he disappeared, however they were unable to find him.</p><br/><p>You XiaoMo did not have a favorable impression of Jiang Liu and simply asked out of a token of curiosity then stopped. For now, they had to take leave as soon as possible for a trip back and to clarify the sequence of events for them to deal with the aftermath.</p><br/><p>After that, You XiaoMo felt worried about Zhao DaZhou, and told Ling Xiao to take him into his dimension. For the time being, it was inconvenient for him to know about You XiaoMo’s dimension. Not that he was afraid that Zhao DaZhou would reveal it, but he was afraid that if he knew it, it would bring disaster upon him.</p><br/><p>Zhao DaZhou also wanted to experience what an expert’s dimension was like so he agreed to enter into the dimension once they have returned to DaoXin Academy.</p><br/><p>When they finished talking, You XiaoMo accompanied Zhao DaZhou out to Yan City on a stroll around the city.</p><br/><p>He himself was not very familiar with Yan City either, so the two went crazy for a whole day before showing some constraint.</p><br/><p>They were unaware that others had been monitoring them for the entirety of the day.</p><br/><p>Only until You XiaoMo prepared to return to DaoXin Academy did those people cease their surveillance, as there were many who were strong in DaoXin Academy, their spies were unable to enter.</p><br/><p>However, unbeknownst to them, after they left the inn, someone visited the room that Zhao DaZhou stayed in. Yet they were foreordained to miss the person they were looking for.</p><br/><p>“Damn it!” The youngster ferociously punched the table. The table was of good quality, but even so it was unable to bear the youngster’s strength and with a ‘bang’, it collapsed.</p><br/><p>The youngster was the one from yesterday who got into a conflict with Zhao DaZhou.</p><br/><p>A middle-aged man spoke, “Master, there is no need to be angry since they’ll pay eventually. Although I didn’t expect them to be acquaintances.”</p><br/><p>In a malicious tone the youngster said, “You’re right, we’ll get them together.”</p><br/><p>Back at Dao Xin Academy, You XiaoMo knew that two days weren’t going to be enough for his excursion, so he needed an extension. For the application to go through immediately, he went to find the old man.</p><br/><p>The old man was one of the Academy’s head so if he approved, You XiaoMo didn’t need to go through anyone else.</p><br/><p>For the success of getting the old man to approve, You XiaoMo specifically waited till the day the first personality came out to speak of him going back to his old home.</p><br/><p>As expected the first personality was easier to convince then the second, just after he told him of the issue the old man approved his vacation. It was so quick and simple that You XiaoMo felt teary eyed. He really treasured the first personality more.</p><br/><p>Once Feng ChiYun and Tong YueXu found out he was going to leave for a while, arrived a day before his departure to say goodbye only to find he was already level eight. Then as silently as they came, left.</p><br/><p>Tang YuLin didn’t join them since he was still at the Cultivation Center. He’d pretty much stopped eating and sleeping to train.</p><br/><p>This almost made BaLi TianYi go insane. Although the problem of Tang YuLin being too lazy to train was solved, another arose. If he wasn’t at the Gravity Mountain he was at the Cultivation Center a direct cause of their plumping in-bed time. It must be said, once you had experienced it once, quitting, like alcohol, was difficult.</p><br/><p>On a morning two days later, You XiaoMo and Ling Xiao left Dao Xin Academy together.</p><br/><p>The moment they made sure no one was trailing them, Ling Xiao pulled Zhao DaZhou out.</p><br/><p>“I’m never going in that dimension again.” Exclaimed Zhao DaZhou as he got out. Faced red from holding in his breath, he had thought that the dimension was a magical place but instead there was nothing.</p><br/><p>You XiaoMo glance at him, “Even if you wanted, there wasn’t going to be another chance.”</p><br/><p>Zhao DaZhou choked a bit.</p><br/>\n</div>"}