{"title": "Chapter 340", "id": 340, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-340", "volume_title": "Volume 4", "body": "<h1>Chapter 340</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 340: Cudgel One’s Brain</p><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>Before leaving the South, Ling Xiao pulled You XiaoMo over to make him do a briefing of their trip. His attitude was as if it was an annual report, by You XiaoMo standards that was highly suspicious.</p><br/><p>What was there to conclude? So, You XiaoMo asked in confusion, “Do I really need to?”</p><br/><p>Ling Xiao nodded seriously, “Yes, let me hear your thoughts.”</p><br/><p>“Ehhhh….” You XiaoMo scratched his head and said, “I’m happy to see my relatives, knowing the whereabouts of my father makes me happy, and…and…”</p><br/><p>And what?</p><br/><p>Sneakily, You XiaoMo peeked at Ling Xiao, “Do you want to add anything?”</p><br/><p>Ling Xiao became angry to the point of laughing. He knew he couldn’t count on You XiaoMo’s brain and instead went straight to the point, “About the TianXin Sect, what are your thoughts?”</p><br/><p>You XiaoMo blinked a little, “The TianXin Sect huh…My thought is, it’s too bad we didn’t get to see Da ShiXiong and Second ShiXiong. I wonder where they went for training, I want to meet them again.”</p><br/><p>Squinting his eyes Ling Xiao asked, “That’s it?”</p><br/><p>Seeing the dangerous expression, he was making, You XiaoMo knew he didn’t get to the point but no matter how hard he tried, he couldn’t think of anything else. Out of ideas, he carefully asked, “Maybe, you can give me a hint?”</p><br/><p>Ling Xiao rubbed his hair and answered, “Is your way of treating people to treat them back double if they’re nice to you?”</p><br/><p>You XiaoMo replied obviously, “Of course, it isn’t this normal?”</p><br/><p>In his previous life, he didn’t have many friends, you could count them with one hand. It wasn’t because he was a loner but because his family was strict. They kept a tab of who he became friends with so when he just start a friendship with a classmate, his family would scare them away.</p><br/><p>Especially his devil like brothers, for some reason they had to test all of his friends, too see if they were worthy. Of course, that just scared them away.</p><br/><p>Whenever he remembered this he became super frustrated, those two were such a pain!</p><br/><p>But it was because of that he treasured his friends very much.</p><br/><p>So, Ling Xiao continued asking, “Your lingering feelings towards the TianXin Sect, is it because of your three ShiXiong?”</p><br/><p>Without thinking You XiaoMo said, “Of course. If Zhao ShiXiong left as well, then I wouldn’t have a reason to go to the TianXin Sect.” After he said this, he looked over at Ling Xiao suspiciously, “You’re really weird today, why did you bring this up all of a sudden? Is there something you’re not telling me?”</p><br/><p>Suddenly Ling Xiao laughed and raised his finger to hook You XiaoMo’s nose, “Seeing that you’ve suddenly became smarter, I’ll let you in on a secret.”</p><br/><p>You XiaoMo’s eyes went wide. There really was something?</p><br/><p>Ling Xiao whispered to You XiaoMo’s ears, “About two years ago, when we left the TianXin Sect, I told a secret to your Da ShiXiong and Second ShiXiong.”</p><br/><p>You XiaoMo froze. It took a second before he found his voice again, “Wha-What secret?”</p><br/><p>“What do you think?” Ling Xiao asked in return.</p><br/><p>You XiaoMo stayed silent for a while before asking, “You actually told them? It’s not a prank, right?” There was too much precedence for You XiaoMo to not be vary.</p><br/><p>“Why would I lie, it’s not like I get to eat your saliva.”</p><br/><p>You XiaoMo didn’t blush, instead he rubbed his hand together nervously, “Umm…What were they’re reactions?”</p><br/><p>Ling Xiao looked at him expressionlessly and suddenly smiled.</p><br/><p>As if a bucket of cold water was dumped on him, You XiaoMo felt cold inside out, was he tricked again?</p><br/><p>Ling Xiao said, “Actually I didn’t say everything, I just told him that Kong Wen had died. He set his eyes on someone else’s treasure and wanted to kill for it, but instead he died. Although…”</p><br/><p>Just as You XiaoMo let out a breath of air, the ‘although’ made him panic again. Stuttering he asked, “Although what?”</p><br/><p>Ling Xiao continued, “Although it would seem as if they guessed it already. Want to know their reactions?”</p><br/><p>You XiaoMo kicked him.</p><br/><p>Ling Xiao grinned, “Fang ChenYue blanked for a second, Fu ZiLin just let out a ‘oh’ sound and they both left after acknowledging they knew. Looking at them, it seems like they were unsurprised.”</p><br/><p>Blinking You XiaoMo asked, “That’s it?”</p><br/><p>Ling Xiao nodded, “That’s it, but I think they were playing dumb.”</p><br/><p>Playing dumb seemed like a good option, if You XiaoMo was in that situation, he would probably do the same. As long as everyone had a mutual understanding, it seemed like he didn’t need to worry anymore.</p><br/><p>Looking up, You XiaoMo stared at Ling Xiao with sparkling eyes. Ling Xiao rubbed his head in return, “Yes, you don’t have to worry about it anymore.”</p><br/><p>You XiaoMo responded by putting his hands around his waist and laughing. It was so great to let go of a burden.</p><br/><p>After he finished, Ling Xiao chilled his excitement, “After this, if there is no need to, don’t get into contact with Ye Han.”</p><br/><p>A sudden stop came to the laughing, You XiaoMo threw over a question, “Why?”</p><br/><p>Ling Xiao continued matter of factly, “If he can sell us out once, he can do it again. Ye Han’s roots are at the TianXin Sect so regardless of me being there, strong or not, his only has one option and that’s to protect the TianXin Sect.”</p><br/><p>You XiaoMo paused for a moment, he had never thought about this before. When he met Zhao ShiXiong, he told him the reason Ye ShiShu revealed their location was because he knew Ling Xiao was strong enough to deal with them. Everything was built on that notion that Ling Xiao was stronger.</p><br/><p>This was what Ye-shishu told Zhao ShiXiong to relay. After Ling Xiao gave the hint, he realized he was tricked.</p><br/><p>Since it was told by Zhao ShiXiong, who he hadn’t seen for two years, when they met, his attention wouldn’t be on the conversation and so he would have no suspicions. But if it was someone else, like those other fellow disciples who he was not close with, the situation would be very different.</p><br/><p>The most important thing though, he realized, by Zhao DaZhou’s strength, this task of going to DaoXin academy was too much for him to handle..</p><br/><p>He was just a level five mage with no fighting power. Enough with the cute little tiger, humans were deceptive, and Zhao DaZhou was not very clever. If he got tricked by someone with ulterior motives, he’d be dead. For the TianXin Sect, Ye Han-shishu would cudgel his brain out.</p><br/><p>Seeing his troubled face, Ling Xiao knew he understood, “I won’t object to you meeting with your seniors but only as pure friends. Anything related to the TianXin Sect you shouldn’t be involved with.”</p><br/><p>You XiaoMo looked at him listlessly, “Okay, but didn’t you help Zhou Peng-shixiong get to where he is now? He seems like your little brother.”</p><br/><p>At that, Ling Xiao raised his eyebrow, “That’s his path to take, I just gave him an opportunity. Even if he destroys it, it has nothing to do with me.”</p><br/><p>You XiaoMo bared his teeth, he thought that Ling Xiao wanted to make the TianXin Sect be his first place of power in this middle level realm since he wasn’t one to help without a reason. But it seemed like he was wrong, Ling Xiao didn’t plan on having any influences on Long Xiang Continent.</p><br/><p>Seeing that Nan Ye City was up ahead, You XiaoMo remembered a question. Ling Xiao had said before that he came to a middle-levelled realm for to find someone, and that someone was him.</p><br/><p>To be honest, he was certain they had no interactions before this and as for the original You XiaoMo, if Ling Xiao knew him, he would know his identity. Clearly, he didn’t, so it was most likely Ling Xiao found him by his soul.</p><br/><p>“Ling Xiao, what you said in the trials, about my past, its it true?” After the atmosphere was silent, for a while, You XiaoMo couldn’t help but ask. Ling Xiao didn’t seem like one of those evil-doers with a terrible past. Also, if he really were to fight with the QiLin Clan and the Demon Phoenix Clan, shouldn’t he develop his influence or recruit some underlings? The more he thought, the more things didn’t add up, the chance of this being a lie was very high.</p><br/><p>Ling Xiao let out a sign, “What is there to lie about? It’s not like you’re going to give me your heart. Seriously, I tell you the truth and you don’t believe me. Do I have to lie for you to trust me?”</p><br/><p>You XiaoMo felt a little guilty, “That’s because you had such a bad record previously. But what does your past have to do with you finding me?”</p><br/><p>Ling Xiao said, “When did I say these two things were related?”</p><br/><p>Now You XiaoMo was confused, “Then why did you come find me?”</p><br/><p>From the corner of Ling Xiao’s eyes, he could see You XiaoMo’s face shine in expectation and said, “The reason…I can’t tell you right now.”</p><br/><p>This got You XiaoMo’s interested and he said impatiently, “Why can’t you say?”</p><br/><p>Ling Xiao replied warmly and caringly, “I’m afraid you’ll feel pressured. The reason I found you is not simple, if I tell you now, it might be a hindrance to your training so it’s best if you stay oblivious to it.”</p><br/><p>You XiaoMo felt his mouth twitching, he really didn’t like this conclusion one bit, “Fine, let’s not think about these questions anymore. See, we are at Nan Ye City already.”</p><br/>\n</div>"}