{"title": "Chapter 353", "id": 353, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-353", "volume_title": "Volume 4", "body": "<h1>Chapter 353</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 353: Lies</p><br/><p>Translated by Rachel of Exiled Rebels Scanlations</p><br/><p>Ling Xiao had a no-nonsense attitude and went straight to the point. “Where is the Elemental essence?”</p><br/><p>The Monster Fox was not surprised. Shaking her head, she said, “Good Sir, I don’t know where the Elemental Essence is. The Azure Sea Dragon is extremely suspicious. Ever since he knew of the existence of the ley line, he suppressed all news about it. We may be in a partnership but he hides many secrets from us. But…”</p><br/><p>The Monster Fox watched him cautiously, afraid of giving him an unsatisfactory reply. Things were already this terrible, she couldn’t afford to make it worse by lying to Ling Xiao.</p><br/><p>“But what?” You XiaoMo interrupted.</p><br/><p>The Monster Fox glanced at him briefly before lowering her gaze.</p><br/><p>“I have heard that the Azure Sea Dragon may appear to be a seven-star level ten, but in reality, he is already halfway to level eleven. If he gets the Elemental Essence, he can transform into a dragon as soon as he touches the water. When that time comes, I’m afraid only the principal of DaoXin Academy can be his match. Of course, not forgetting you too, Good Sir.”</p><br/><p>The last sentence was rather flattery. To be honest, she didn’t think that Ling Xiao could be more powerful than the Azure Sea Dragon. If such an individual existed on the Long Xiang Continent, she would have already received the news.</p><br/><p>“And?” Ling Xiao asked plainly. This time, he didn’t bother to probe.</p><br/><p>“I suspect the origin of the ley line is most likely about a few thousand meters away from Azure Island, under the Blaze Island. Even if it’s not, it’s definitely near the Blaze Island.”</p><br/><p>“Why are you so sure?”</p><br/><p>“Because ever since news of the ley line got out, the Azure Sea Dragon suddenly sent troops and heavy reinforcement to guard the Blaze Island. Anyone who steps foot on it gets killed! If there’s nothing suspicious about that place, why would he suddenly do all this! The Blaze Island is scattered with volcanoes, they erupt every now and then and hardly anyone goes there. Suddenly sending troops to guard, even two of his right-hand men, doesn’t it say something about the Blaze Island?” The Monster Fox frowned. If not for the hiccup along the way, she would have liked to go down personally to take a look.</p><br/><p>Ling Xiao asked a few more questions and the Monster Fox answered to the best of her knowledge.They were ambushed this time due to the oversight of the Academy. If they were able to obtain information of Mirage Sand Sea, so could their enemies. Furthermore, the other party had two additional level ten fighters and they were planning to take advantage of that by finishing them off one by one. So ever since they entered Mirage Sand Sea, they had already been monitored.</p><br/><p>“Where is that Azure Sea Dragon now?” Ling Xiao asked out of the blue when he was almost done with questioning.</p><br/><p>“Most likely on Azure Island. He knows that Hei Tian from Daoxin Academy will surely look for him so he decided to just stay on Azure Island and wait for Hei Tian.” The Monster Fox answered with her head bowed.</p><br/><p>“Oh…”</p><br/><p>The Monster Fox couldn’t resist raising her head and asked hopefully, “I have told you everything you wish to know, Good Sir. Can you let me go now?”</p><br/><p>Ling Xiao paused for a moment before smiling back at her. “Of course, how about I send you off.”</p><br/><p>The Monster Fox’s eyes widened. Two balls of purplish red flames were reflected in her eyes.</p><br/><p>The next second, the flames reached her and soon she was engulfed. The heat was too much, it scorched her skin and she felt as if the was going to melt in the next second. The Monster Fox screamed in pain. her screams were heard far away, frightening.</p><br/><p>“Why! Why?” The Monster Fox roared angrily.</p><br/><p>The man’s voice murmured from above her head. “Why? I thought you knew.”</p><br/><p>The Monster Fox had a face full of shock.</p><br/><p>Burned by the flames, the Monster Fox couldn’t hold on any longer and revealed her true form. Her body started to melt, first was the fur, then the flesh and blood and lastly her bones. Soon after, the Monster Fox had been reduced to a pool of bloody water. She had met her fiery demise. Even the pool of blood had evaporated.</p><br/><p>It was worse than dying without a complete body. Not even a hair was left behind.</p><br/><p>This was the first time You XiaoMo witnessed such a cruel way of killing. His legs had given way.</p><br/><p>It was only with Ling Xiao’s help that You XiaoMo managed to remain upright.</p><br/><p>You XiaoMo felt he wouldn’t be able to eat anything for a period of time, he couldn’t keep anything down his throat after a scene like that. Seeing a demon beast being melted by the flames, up close too, left a deep impression.</p><br/><p>“Are you afraid?” Ling Xiao stood flush against him, speaking softly into his ear.</p><br/><p>“Of course I’m afraid!” You XiaoMo gulped.</p><br/><p>“But this is the real me…” Ling Xiao’s voice rang out, devoid of any emotion.</p><br/><p>You XiaoMo turned his head to look at him and blinked. “I know, you don’t have to specially remind me. That said, weren’t you originally like this?”</p><br/><p>“Didn’t you say you were scared?” Ling Xiao hesitated before replying to You XiaoMo’s question.</p><br/><p>“I believe I’ll get used to it someday.” You XiaoMo replied without thinking. Ever since he got together with Ling Xiao, he had witnessed many gruesome things. Furthermore, with Ling Xiao always speaking the names of people whom he killed into his ear, he was already relatively immune to Ling Xiao’s kills.</p><br/><p>Ling Xiao was silent before continuing, “… Do you still want to see me kill people?”</p><br/><p>You XiaoMo was stunned for a moment. Oh yeah, he could have totally avoided seeing such a disgusting image. “How about you give me a heads up before you decide to torch anyone next time.”</p><br/><p>Ling Xiao decided to put an end to this conversation.</p><br/><p>“Oh yeah, what were you guys saying in the last few sentences, a riddle? How come I don’t understand anything?” Seeing that he was unwilling to speak, You XiaoMo decided to change the topic.</p><br/><p>Ling Xiao rested his chin on his shoulder and said, “She was lying. I originally intended to leave her a complete body when I killed her.”</p><br/><p>“How would you know?”</p><br/><p>Ling Xiao didn’t answer his question directly. Instead, he shot a question back at You XiaoMo.“If it were you, would you declare to others where the treasure is hidden if you clearly knew where it was?”</p><br/><p>“Of course not! I’m not an idiot… so you’re saying, the Monster Fox was lying when she told us that the Elemental Essence was under the Blaze Island? That all this was the Azure Sea Dragon’s ploy?”</p><br/><p>“That’s right.” Ling Xiao nodded.</p><br/><p>“The Monster Fox had already thought of this point. She was so confident in telling us that the Elemental Essence was at the Blaze Island. No doubt it was a ploy to lure us there.”</p><br/><p>“Then where is the real Elemental Essence?” You XiaoMo asked.</p><br/><p>“It should be on Azure Island. Azure Island Is the Azure Blue Serpent’s main camp. With two emperor level powerhouses fighting there, the Island would definitely be affected. The Sea Dragon isn’t that dumb. Under normal circumstances, he should have left the island.” Ling Diao explained.</p><br/><p>“But he hasn’t. He stayed there instead, so something’s fishy.” You XiaoMo caught his drift.</p><br/><p>“But then again, won’t he be afraid of being found out by the Grand Elder? With the Grand Elder’s familiarity with the Elemental Essence, it’s not possible that he hasn’t discovered.”</p><br/><p>“Clever!” Ling Xiao beamed and tapped on the space between his brows.</p><br/><p>“If the Elemental Essence is at Liu Li Isand, Hei Tian will definitely find it. But if the Elemental Essence is still hidden within the ley line, even with Hei Tian’s capability, he stands no chance.”</p><br/><p>“Then what are we waiting for, let’s go to Azure Island. Someone must have guessed this too. If they find it first it’ll be troublesome.” You XiaoMo was starting to get agitated and Ling Xiao responded accordingly by flicking his forehead.</p><br/><p>“What are you rushing for. Even if someone guessed it, it’s highly impossible to sneak passed the Sea Dragon to get in. The best time to take action is when the Azure Sea Dragon and Hei Tian are busy fighting it out. Judging by the time, they won’t be fighting that soon.”</p><br/><p>Before they set off, Ling Xiao got You XiaoMo to summon SheQiu and the rest. A single file of all the Qius assembled together, although not a neat row. This was the second time that You XiaoMo summoned all of them at once, the first time was to defeat Kong Wen.</p><br/><p>Even SheQiu was a little excited when he heard about the whole situation.</p><br/><p>Ever since they became You XiaoMo’s contract demon beasts, they were hardly given any orders or summoned to work. Being battle-thirsty was more or less part of a demon beast’s nature, even the cute ones like CatQiu who looked incapable of doing damage were jumping for joy.</p><br/><p>The six people were divided nicely into three groups. Taking into consideration the less powerful PiQiu and CatQiu, You XiaoMo paired them up respectively with SheQiu and LanQiu. Whereas Xiao Hei and MaoQiu formed a team on their own.</p><br/><p>“Master, I don’t need a team?” Lan Qiu had his hairs on his skin raised when he saw CatQiu looking at him all teary eyed and ready to burst into tears any moment. The corners of his mouth twitched, this little thing would only hold him back. He had no intention of becoming a nanny.</p><br/><p>You XiaoMo hesitated.</p><br/><p>“The Thousand Illusions Cat Qiu seems to have a decent special ability, why not put him together with Xiao Hei and MaoQiu.” Ling Xiao said.</p><br/><p>The Thousand Illusions Cat Qiu was a master of shapeshifting. He could change anyone into how he wished them to look. And as he got more powerful, his shapeshifting skills would also improve.</p><br/><p>Xiao Hei and Mao Qiu were already level eight demon beasts, however, it wasn’t enough for the Mirage Sand Sea. With Cat Qiu tagging along, it provided them with added safety.</p><br/><p>Seeing as it made sense, You XiaoMo agreed.</p><br/><p>Lan Qiu heaved a sigh of relief.</p><br/><p>Meanwhile, Hei Qiu stared at Cat Qiu with a look of despise. Cat Qiu pressed his lips together.</p><br/><p>I don’t like Xiao Hei, he always bullies me.</p><br/>\n</div>"}