{"title": "Chapter 355", "id": 355, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-355", "volume_title": "Volume 4", "body": "<h1>Chapter 355</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h4>Chapter 355: Each with Their Own Ulterior Motives</h4><br/><p>Translated by Jouissance of Exiled Rebel Scanlations</p><br/><p>By the time You XiaoMo and Ling Xiao arrived, the guards at the spring had been mostly wiped out by XiaoHei and the others. The remaining rather hardy ones were easily destroyed by Ling Xiao. The spring wasn’t very large, only a third of the size of the lake in You XiaoMo’s dimension. The bank was immediately visible, and several corpses floated within. After a while, the corpses sunk into the spring.</p><br/><p>“I interrogated a guard. He said Azure Sea Dragon used to often go down, but not to bathe in the hot springs, but to dive into the sea blue lake water, often only coming out after twenty something hours. Every time, he’d seem very excited about something,” XiaoHei reported methodically. You XiaoMo felt the corner of his lips twitching. Humph, try talking to Ling Xiao with that expression if you dare. Don’t bully weaker people.</p><br/><p>XiaoHei then said, “Master, are you doing down there with the boss?”</p><br/><p>Ling Xiao said, “Yeah, we’ll go down and look first. You guys can wait nearby for us or go and meet up with SheQiu. It’s your choice. If anything is wrong, leave the island immediately. I don’t want to have to rescue you later.” You XiaoMo had thought Ling Xiao would want to go down by himself, having been about to speak up.</p><br/><p>XiaoHei took out a pearl and handed it to them. “We found this Waterproofing Pearl on the guards. A Waterproofing Pearl lasts for four hours, but we only found one.” One was a good haul already. You XiaoMo took it at once. He wasn’t very good with water. After sending XiaoHei and the others off, he and Ling Xiao dived into the lake together.</p><br/><p>After entering the lake, it felt like they were much closer to the place where the two kinds of water overlapped, but as the fat old man said, it was rather deep. They only entered the ocean blue water after swimming down for about 500 meters. Here, they could see what was happening down there. You XiaoMo immediately took out the Waterproofing Pearl. The Waterproofing Pearl was a white, marble-like object. When used, it would create a sphere around a meter in diameter, keeping the water out. However, after four hours, the effects would disappear.</p><br/><p>At the same time, the others were arriving at the island one by one. However, some did fall for Azure Sea Dragon’s trick, thinking that the Elemental Essence was at Blaze Island, locked in an intense battle with the people at Blaze Island. When Fairy Fu Rong and the other two arrived, Azure Island’s hidden sentries had already left and Azure Island itself was wrecked. Azure Sea Dragon and Hei Tian had disappeared somewhere to fight. The three managed to get to their destination without hindrance.</p><br/><p>“Fairy Fu Rong, are you sure it’s in the spring?” They hadn’t seen anyone on their way over, but there were many corpses, so Fei Xie couldn’t help but voice his doubt.</p><br/><p>Azure Sea Dragon was extremely careful; would he really leave Azure Island without worry?</p><br/><p>Fairy Fu Rong said, “I’m certain. One of the guards of the spring is the lover of one of my disciples. Azure Sea Dragon values the spring immensely, so there’s a high chance it’s the entrance to the ley line.”</p><br/><p>“We’ll know if it’s the spring or not once we get there,” HeiYun Elder said in a low tone. Fei Xie knew, too, that it was the only way to confirm it and the three rushed towards it without pause. Though they had the source of this info, it was hard to be certain if anyone else knew about this, so they had to strike while the iron was hot. However, when they arrived at the spring, all they saw were fallen guards scattered everywhere. It was obvious that this wasn’t natural.</p><br/><p>Fairy Fu Rong found her disciple’s lover among these guards, but unfortunately, he had been dead for a while now. No wonder she couldn’t contact him before. Seeing this, Fairy Fu Rong’s pupils shrunk slightly, forgetting her composure and yelling, “Could there be someone who got here before us?”</p><br/><p>She always thought they would be the first to get to the spring. Even if the others were smart, they wouldn’t be able to immediately link things to the spring, unless they were like her and had sent people to scope out Azure Island long ago.</p><br/><p>Fei Xie said with displeasure, “Fairy Fu Rong, didn’t you say we would be the first to know the secret of the spring? Why is someone even faster than us?”</p><br/><p>Fairy Fu Rong harrumphed coldly. “How would I know? This sort of thing isn’t a guaranteed secret. Who knows? Maybe the Four Great Families and DaoXin Academy had already made plans, just like us.”</p><br/><p>“What we should prioritize now is getting down there, fast, to prevent the Elemental Essence from being taken by whoever is down there. We don’t know who it is, so if we miss this chance they’ll be hard find.” HeiYun Elder’s voice held a hint of impatience. He was unable to stay calm any longer. A flash of doubt appeared in Fairy Fu Rong and Fei Xie’s eyes. Their impression of HeiYun was someone mysterious and unreadable. No one ever knew what he was thinking, and he never lost his cool. This was the first time they had ever heard impatience in his voice. Though they were working together, when it came down to something that concerned their own gains, there was no such thing as wholehearted cooperation. Secretly, everyone would have their own ulterior motives.</p><br/><p>The three dived into the spring. They had long since gotten a grasp of the situation of the spring lake and had prepared sufficient Waterproofing Pearls. To catch up, they intentionally sped up as much as possible. Not two minutes after they dived in, a figure that had followed them here quietly slipped in as well, laughing sinisterly. “What an unexpected gain, god must be on my side today. Wait till I get the Elemental Essence, then I’ll get stronger and won’t be afraid of being defeated by that person anymore.”</p><br/><p>After a few seconds, a cautioning voice sounded in his ear. “Be careful, don’t get found out.”</p><br/><p>“I know.”</p><br/><p>※※※</p><br/><p>At the bottom of the ocean, You XiaoMo and Ling Xiao followed the currents of the ocean and dived to a sea level of negative twenty thousand meters. There was no sun, only complete darkness, and that was when they finally reached the bottom and managed to feel the presence of the Ley line. The pressure at twenty thousand meters down was enough to squeeze your organs from your body. It was a good thing that they had a Waterproofing Pearl. It prevented the water from submerging them and helped them take the pressure.</p><br/><p>Looking around at the dead, darkness of his surroundings, You XiaoMo couldn’t help but shudder, feeling goosebumps on his arms.</p><br/><p>“It seems really scary!” You XiaoMo buried himself further into Ling Xiao’s embrace. At this depth, they couldn’t even see any demon beasts of the sea anymore. Low level demon beasts couldn’t take the pressure and without sunlight, high level ones didn’t want to some either.</p><br/><p>“As expected, this ley line was really hidden quite deep. No wonder it went undiscovered. Digging out from twenty thousand meters under the sea isn’t an easy task,” Ling Xiao exclaimed. No wonder Azure Sea Dragon hadn’t been able to do anything despite his efforts. With just him, it would indeed be extremely hard to find the Elemental Essence hidden at the very bottom of the ocean.</p><br/><p>“What do we do now?” You XiaoMo asked.</p><br/><p>“Find the opening first,” Ling Xiao replied. The reason why the ley line was discovered was because there was an opening from which spiritual energy was escaping. If they could find the opening, they wouldn’t have to make another. You must know that ley lines were a whole. If you weren’t careful, you might accidentally cause the spiritual energy to drain from it rapidly and change the structure of the ley line. The worst-case scenario was that the entire ley line would die out, and the Elemental Essence would change as well. If it escaped into the Boundless Sea, it would be extremely hard to find it again.</p><br/><p>Ling Xiao said, “Try and push your Soul Force out in front of you and use it to sense what’s there.”</p><br/><p>You XiaoMo hesitated for a moment before nodding. “Ok.”</p><br/><p>Pushing your Soul Force out was much easier than layering it over your body, but trying it once told him that it wasn’t as easy as it seemed. The water pressure of twenty thousand meters of water put pressure on his Soul Force, too, as if a weight had been put onto his Soul Force. It was a good thing that the pressure wasn’t too big, so You XiaoMo quickly got used to it. This sensation wasn’t alien, because he had experienced it at Gravity Mountain already. The Soul Force of a level eight mage wasn’t something to laugh at. After becoming a level eight mage, he hadn’t had a chance to test the limits of his Soul Force, but now was a great chance.</p><br/><p>The thin Soul Force spread forwards like a spider web. He could feel the hair-raising silence of the ocean bottom, and almost snatched his Soul Force back several times. It was only until about two thousand meters ahead that something felt different; his Soul Force had contacted a small bump. His Soul Force had been lured over by an intense spiritual energy.</p><br/><p>“Found it!” You XiaoMo retracted his Soul Force immediately, exclaiming with pleasure. Two thousand meters wasn’t far, and there they found a stone hill, twenty meters tall and ten meters wide. Something green and hairy was growing all over it, and it looked a little disgusting at first.</p><br/><p>It was very dark around here, but with their ability, they could clearly see the environment within a few hundred meters. The stone hill was cracked and, approaching it, they could feel the leaking spiritual energy. It was more than twice as dense DaoXin Academy’s… Ling Xiao suddenly frowned. This spiritual energy seemed strange.</p><br/><p>You XiaoMo asked in excitement, “Now what are we going to do?”</p><br/><p>Ling Xiao said. “We can’t calculate the position of the Elemental Essence while at the bottom of the sea, so we can only strike here.”</p><br/><p>They were going to go in? No way! You XiaoMo looked to the crack that was about as large as his palm. Could they really squeeze in?</p><br/>\n</div>"}