{"title": "Chapter 362", "id": 362, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-362", "volume_title": "Volume 4", "body": "<h1>Chapter 362</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 362: So, There’s Still a Secret</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Actually it’s not that there was a chance, but it was that You XiaoMo would choose the spirit gems. After choosing the spirit gems, he would lament for a moment over the Elemental Essence that he had a brief encounter with. Then, immediately forget about this in a few seconds and hug a pile of spirit gems while grinning like a fool. This was something that You XiaoMo would do.</p><br/><p>SheQiu had indicated that he had already had a thorough understanding of his family’s master, so he did not feel the Boss Ling Xiao used Master as an excuse as this was simply the truth.</p><br/><p>You XiaoMo who had suffered a blow by SheQiu immediately ran to a corner to grow mushrooms.</p><br/><p>“Wait a minute!” Just at this moment, a person raised their objection. A lovely voice that was raised broke the silence. Shockingly, it was Fairy Fu Rong.</p><br/><p>Everyone’s attention moved onto her.</p><br/><p>Fairy Fu Rong somberly looked at Hei Tian, “Hei Tian, we had an agreement with DaoXin Academy at JingHua Island that we would get thirty percent. Now you’re promising to give them seventy percent. What do you mean by this? Are you cutting us out of our share?!”</p><br/><p>“Agreement? The ones who first broke the terms of the agreement were you guys.” Hei Tian’s hands were behind his back. His cold gaze indifferently swept over her and his voice was cold and detached enough to kill.</p><br/><p>Fairy Fu Rong’s expression slightly changed, “What nonsense are you sprouting? When did we break the agreement? I think you’re just trying to find an excuse for yourself!”</p><br/><p>“You guys are aware whether it’s an excuse or not.” Hei Tian said, “From the beginning, you all did not intend to cooperate with us, am I right? Since it’s like this, why should I abide by the agreement with you?”</p><br/><p>Hei Tian did not have more information than them. What he said was merely his inference from all the indications he had seen. Furthermore, they did not formalize their agreement, so it was easy to renegade on it.</p><br/><p>Fairy Fu Rong grinded her teeth in anger.</p><br/><p>She did not want to fight with DaoXin Academy and Ling Xiao. But since the man wanted seventy percent, they would certainly have no share in the reminding thirty percent. She was not willing to go home empty-handed.</p><br/><p>“Fei Xie, what do you say?”</p><br/><p>Fei Xie looked at Qiu Ran who was also unwilling to give up, “Naturally, I object too. But even if the Azure Sea Dragon agreed to cooperate with us, our chances of victory are not high.”</p><br/><p>Fairy Fu Rong’s expression twisted slightly. If not for a Divine Realm expert suddenly appearing here, their odds of winning would reach seventy percent. Everything was completely ruined because of him at this moment. They had never heard of his name before. What in the world was this man and the two strangers who had suddenly appeared and were killed by the man instead? Everything was a mystery.</p><br/><p>“I somehow feel…” Fei Xie suddenly injected.</p><br/><p>“What?” Fairy Fu Rong bitterly asked. She was now in a bad mood.</p><br/><p>“I feel that this man seemed to be helping DaoXin Academy. It’s like he knows them.” Fei Xie doubtfully commented, but the impression that they gave to him was indeed as such.</p><br/><p>Fairy Fu Rong was taken aback. However, she quickly calmed down and deduced, “It’s not ‘like’. He was basically helping DaoXin Academy. Otherwise it’s impossible for him to give up the Elemental Essence that he attained. Maybe he was sent over by Han Gong, or… …he’s Han Gong himself.”</p><br/><p>“That’s not possible.” Fei Xie immediately denied this conjecture, “If he was Han Gong, Hei Tian would have recognized him. There’s also no need for Han Gong to hide his identity.”</p><br/><p>“Then what do you say we do? Could it be that we have to give up both the Elemental Essence and the spirit gems?!” Fairy Fu Rong spat in fury.</p><br/><p>Fei Xie looked uncertain. After quite a while, he relaxed his taut muscles slightly, “I’ve decided to give up!”</p><br/><p>Fairy Fu Rong’s eyes bugged in shock, as she lividly shrieked, “Do you know what you’re saying?! Fei Xie, are you a man or not?!”</p><br/><p>Fei Xie was not angered, “If you guys can guarantee that the man would not make a move, I would naturally have no objections.” He still had many free and unfettered days ahead of him and did not want to die in the Boundless Sea.</p><br/><p>Fairy Fu Rong expression abruptly fell. She had no way to guarantee this.</p><br/><p>Fei Xie did not bother about the gazes of others as he turned and left.</p><br/><p>As he left, the scales suddenly tilted towards DaoXin Academy. The situation changed in a split second.</p><br/><p>Qiu Ran’s face was as black as a caldron’s bottom. He was still trying to persuade the Azure Sea Dragon. If he had known earlier that Fei Xie would give up, he would not have had a faint hope in him. Who would have thought that Fei Xin was such a cowardly person?</p><br/><p>“This old hand has had enough too!” After Fei Xie left, the Azure Sea Dragon suddenly roared out.</p><br/><p>He was not a person without any brains. Not only was there no benefit to cooperating with Qiu Ran, he would even be shooting his own leg by giving himself in as compensation. Speaking of retreating ten thousand steps, even if they were lucky enough to defeat DaoXin Academy, he would not able to defeat Qiu Ran and Hong Yun by himself. Why should he participate this sort of business transaction that was a loss?</p><br/><p>The scales of victory had already completely tipped toward Hei Tian’s side with one leaving after another.</p><br/><p>Qiu Ran did not dare to tally upon seeing that most of the people were gone. Taking advantage of the period where everyone’s attention was on the Azure Sea Dragon, he secretly relayed a message to Hong Yun and intended to quietly flee.</p><br/><p>But his actions did not escape Duan QiTian who had been keeping an eye to him. Seeing that he wanted to run away, Duan QiTian immediately bellowed, “Qiu Ran, don’t you dare run!”</p><br/><p>His voice immediately drew everyone’s attention back on Qiu Ran.</p><br/><p>Hei Tian’s actions were even quicker than Duan QiTian’s. A black shadow flashed, and he appeared in front of Hong Yun. At the same time, he lifted his leg and kicked at Hong Yun. A black gale that appeared to have ripped apart the very space flew towards Hong Yun.</p><br/><p>Hong Yun had no choice but to stop.</p><br/><p>On the other end, Duan QiTian and the Aberrant Blood Vine had already stopped Qiu Ran.</p><br/><p>“So handsome!” You XiaoMo’s eyes glittered as he looked at Hei Tian. Who would have thought that the actions of the Great Elder, who looked past his prime, were so much more handsome than the others? This easily caused one to overlook his outer appearance of being past his prime.</p><br/><p>“Who did you say was handsome?” A voice suddenly sounded beside his ear.</p><br/><p>“Of course it’s Great Elder Hei Tian. His kick just now was really cool!” You XiaoMo did not even stop to think before he answered.</p><br/><p>After he said that, he discovered the mood was so quiet that it was strange.</p><br/><p>He turned his head a little and saw SheQiu and LanQiu with a ‘you’re so dead’ expression.</p><br/><p>You XiaoMo gave an uneasy smile, “Just now, you guys are the ones who asked me right?” Hurry and say yes ah!</p><br/><p>SheQiu said, “Yes…my ass.”</p><br/><p>“Ouch!” You XiaoMo stood up. He was forced to as his ear was pinched by his ‘husband’. It hurt so much till he nearly squeezed out two crocodile tears.</p><br/><p>“My bad, I didn’t hear it clearly just now. Could the wife repeat it again for this husband?” Ling Xiao gave a human and animal-friendly smile and even graciously gave him a second chance.</p><br/><p>You XiaoMo was in pain, “It’s you…you are the most handsome in the universe.”</p><br/><p>Ling Xiao smiled, “Is this sentence by the wife genuine?”</p><br/><p>You XiaoMo, “It’s even more genuine than the Renminbi!”</p><br/><p>Ling Xiao asked, “My dear wife, what is this Renminbi?”</p><br/><p>You XiaoMo, “…A good thing that everyone wants and needs, just like things such as gold coins and crystal coins.”</p><br/><p>Ling Xiao broke the earthenware pot, “Why does the wife use Renminbi to describe this?”</p><br/><p><strong>t/n: break the earthenware pot and ask to the end means to get to the bottom of something.</strong>t/n 2: Renminbi, or Rmb, or CNY is china currency. And china is famous for its counterfeit stuff.</p><br/><p>You XiaoMo looked at him with grief laden eyes, “Will you believe me if I say it’s a slip of the tongue?”</p><br/><p>Ling Xiao gently smiled, “Naturally I’ll believe. But this husband has also confirmed one thing. It seems that the wife still has a secret that has not been told to this husband.”</p><br/><p>You XiaoMo, “…” Hey, hey, what kind of sensitive thinking is this?</p><br/><p>You XiaoMo once again completely lost in a single conversation!</p><br/><p>“Have you given the Elemental Essence to the Great Elder?” You XiaoMo rubbed his ears. He had been paying attention to other people just now and did not notice the transaction between Ling Xiao and the Great Elder.</p><br/><p>“I have. I’ve already discussed the details with him.” Ling Xiao raised his head and looked up at Qiu Ran who was being impeded by Hei Tian and the rest.</p><br/><p>You XiaoMo hesitated for a moment, “By the way, why did you only ask for seventy percent of the spirit gems?”</p><br/><p>Ling Xiao looked askance at him and asked in amusement, “You want everything?”</p><br/><p>You XiaoMo guiltily rubbed his nose, “No, I’m only curious.” Ling Xiao did not seem so good-hearted as to leave a little for others.</p><br/><p>As expected…</p><br/><p>“We can’t take everything. Although we can store it in our dimensions, but for such a large leyline that’s situated twenty thousand meters below sea level of the Boundless Sea, even if a year may not be enough to dig all up unless they increase their manpower.”</p><br/><p>“But didn’t we dig up quite a lot in the last hour?” You XiaoMo uncertainty asked.</p><br/><p>Ling Xiao looked at him in disdain, “Do you feel that DaoXin Academy’s principal will be like me and escort the person digging out the spirit gems?”</p><br/><p>You XiaoMo was choked by Ling Xiao’s words. Indeed, there was no powerhouse who would be like Ling Xiao and use a sledgehammer to crack a nut.</p><br/><p>“We’ve done all we came to do, let’s go.” Ling Xiao urged.</p><br/><p>“The old geezer, he …” You XiaoMo hesitated for a moment.</p><br/><p>“Don’t tell me that you still want to stay and watch?”</p><br/><p>“No…”</p><br/><p>“Don’t forget. We still have a lot of terrible messes to clean up. For example, how we can escape unscathed from the clutches of that uncanny fox. One wrong move and they will suspect us.”</p><br/><p>You XiaoMo’s head started to hurt once he brought this up. Ultimately, he had no choice but to leave with Ling Xiao. Although Qiu Ran and his contracted demon beast, Hong Yun were strong, no matter how strong they were, they were not stronger than Hei Tian and Duan QiTian’s combination.</p><br/><p>On their way to find Yan Fa, they rendezvoused with XiaoHei and the rest who had finally finished plundering the Azure Sea Dragon’s palace. The Azure Sea Dragon had many hidden treasures. You XiaoMo was so envious at their haul that he requested they share the booty on the spot and was despised a million times by XiaoHei. In the end, it was only PiQiu and CatQiu who ‘bestowed’ him with two treasured objects.</p><br/>\n</div>"}