{"title": "Chapter 366", "id": 366, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-366", "volume_title": "Volume 4", "body": "<h1>Chapter 366</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><b>Chapter 366: A Chicken</b><b></b></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>“Little eggy, what are you doing inside?” Just as they were talking, a crisp sound suddenly rang out from PiQiu.</p><br/><p>You XiaoMo followed the noise and looked in that direction, but only saw PiQiu and CatQiu standing not far before the pile of spirit gems. They seemed to be looking at something through the gaps. He informed MaoQiu before walking over.</p><br/><p>“PiQiu, what are you guys doing?”</p><br/><p>CatQiu immediately jumped in front of him, “Miaow miaow miaow~” Dashing to him, he miaow-ed for a long period of time, appearing to be explaining the reason to him.</p><br/><p>You XiaoMo mouth twitched. Truly sorry, but he doesn’t understand Cat.</p><br/><p>You XiaoMo immediately looked towards PiQiu, “PiQiu, you say it. Remember to speak human.”</p><br/><p>CatQiu curled up into a ball in grievance.</p><br/><p>PiQiu extended out his fleshy claws and pointed at a gap in the pile of spirit gems and answered, “The little eggy is inside but I don’t know what it’s doing in there!”</p><br/><p>You XiaoMo moved closer and curiously looked into the gap. It could be because he was in too much of a hurry in the beginning, so a small space was formed inside. That demon beast egg was lying in that space. The surface of the egg shell seemed to be even more smooth and shiny than before, and its colors were becoming more vivid. However, he kept feeling that there was something weird.</p><br/><p>“What is going on, why is it inside there?”</p><br/><p>“Don’t know.” PiQiu bit his fleshy finger, “But SheQiu said that the little eggy may be hatching soon. I wonder what does he look like after hatching?”</p><br/><p>You XiaoMo was stunned after hearing that, and suddenly shouted out loud without any warning. He had finally remembered what was weird, “When did it go in?! Didn’t I lock it in the beast cage?”</p><br/><p>“Miaow miaow~” CatQiu was not willing to be ignored, and worked hard to raise its presence.</p><br/><p>You XiaoMo finally understood this time. There were only two words after translating – it broke.</p><br/><p>Unfortunately that shitty egg actually broke the beast cage. You XiaoMo clenched his fist. With flames shooting from his eyes, he menacingly ordered PiQiu and CatQiu, “Dig it out.”</p><br/><p>Just as his tone dropped, a ‘ka-cha’ was heard from inside.</p><br/><p>One human and two beasts looked over simultaneously. The egg had cracked and several strong rays of light emitted from inside the egg. The spirit gems above had been knocked off, and they jingled and tinkled as they rolled down, nearly burying them beneath.</p><br/><p>This movement suddenly alarmed SheQiu and the rest.</p><br/><p>SheQiu walked over. Seeing the demon beast egg had cracked, he exclaimed, “Sure enough, an ordinary demon beast is not able to emit this radiance.”</p><br/><p>“It should be an Emperor Beast.” LanQiu felt the pressure that came off the egg while it was hatching. Although it was a little faint, there was definitely no mistake based on his experience. Who would have thought that there would be a descendent of an Emperor Beast hidden here?</p><br/><p>“What breed is it?” XiaoHei walked over.</p><br/><p>“It’s not clear yet.” LanQiu shook his head.</p><br/><p>Thus, the shell of the egg gradually fell off under the gazes of one human and six beasts, revealing the true identity of the little demon beast. The bald wings on both sides fluttered, and it appeared to gracefully land on the ground. Yet with a stagger, it fell down. The little demon beast climbed up, its body was still wobbling as it looked at them. The little demon beast spit out a spark, and gave a crisp cry.</p><br/><p>“Chirp~”</p><br/><p>Everyone, “… …” You XiaoMo swallowed his saliva, and took a long while to digest the facts before his eyes, “This is… …a chicken?” Though the feathers had not grown in yet, its appearance was extremely similar to a chicken. It was just like a chicken plucked bare, ready to steam and eat.</p><br/><p>LanQiu said, “No… ..I think that it possibly has some relation to the phoenixes.”</p><br/><p>You XiaoMo was astonished, “Do you mean to say that it could be an Ancient Demon Phoenix?”</p><br/><p>“It’s not certain. Don’t forget that Old Hei Yun is also an Emperor Beast. His original body is a Five-Colored Bird, and it’s also a demon beast of the phoenix class.” SheQiu said.</p><br/><p>“No wonder it was not frightened at all when I threatened to roast it with fire before.” Phoenixes were creatures of fire, and were born from fire. If even they were afraid of fire, then everyone in this world would be afraid of fire.</p><br/><p>At this time, MaoQiu held a spirit gem in her hand and walked over, “Master, I’m afraid that I have to inform you of an unfortunate event.”</p><br/><p>You XiaoMo’s gaze immediately moved to the spirit gem in her hand. The spirit gem had become somewhat transparent and it appeared that the energy inside had been sucked up. He looked at the other spirit gems. As expected, the situation was the same as the one in his hand.</p><br/><p>“Forget it.” You XiaoMo took a deep breath.</p><br/><p>Other than LanQiu and SheQiu, everyone was staring blanking upon hearing this.</p><br/><p>You XiaoMo took out the magic bag filled with spirit gems and took out another empty magic bag. He shifted a portion of the spirit gems inside, passed it to MaoQiu, and solemnly declared, “You take these. But by all means remember not to give a single gem to a certain chicken.”</p><br/><p>MaoQiu did not speak as she looked at the magic bag place in her hand.</p><br/><p>“Chirp~ Chirp~”</p><br/><p>A chicken was flying in mid-air and with incomparable precision, it landed on the top of You XiaoMo’s head while chirping lively.</p><br/><p>You XiaoMo pulled it down. The chick flapped extremely vigorously in his hand, and even pecked his hand. The pain on the back of his hand caused him to subconsciously throw the chick on the ground.</p><br/><p>The chick fluttered its wings and took advantage of his distraction to fly onto his head.</p><br/><p>You XiaoMo threw him down, the chick continued to fly up, he continued to throw, and it repeated in this manner… …</p><br/><p>“So he’s currently taking your head as its home?” Ling Xiao restrained his laughter as he looked at an impatient You XiaoMo with a chicken nesting on the top of his head.</p><br/><p>“I don’t feel that my head resembles its nest the slightest bit.” You XiaoMo gnashed his teeth. Who knew if the chick would defecate? If he shat on his head…he would definitely steam him.</p><br/><p>“Relax, he will not be able to nest on your head when he grows up.” Ling Xiao nonchalantly stated.</p><br/><p>“But the problem is, he will continue nesting on my head before that happens right?” You XiaoMo was not satisfied with this result. The top of his head was not a bird’s nest. For which reason should he let this chicken that sucked up half his spiritual lake and used so many spirit gems, make the top of his head its home? He still hadn’t gotten his payment for that out of his hide yet.</p><br/><p>“If you really dislike it, then throw him into your dimension.”</p><br/><p>“I also want to, but his claws keep holding onto my hair. That’s right. Do you know what breed he is?” The chick had clearly been going against him from the beginning, and even wanted to make a home on top of his head now? No way, buddy.</p><br/><p>“Him? Ah.” Ling Xiao looked at the chick, “He is probably an Ancient Demon Phoenix. This was also one of the reasons why he could survive for so long in the Paradise Realm. The vitality of Ancient Demon Phoenixes are very tenacious. Oh yes, Yin Ge is also a demon beast, but he only holds the bloodline of half a demon beast.”</p><br/><p>You XiaoMo was astonished, “Since when did Yin Ge have the bloodline of half a demon beast?” This was his first time hearing this.</p><br/><p>Ling Xiao calmly said, “From when he was born.”</p><br/><p>You XiaoMo embarrassedly smiled, “Then what kind of demon beast bloodline does he have?”</p><br/><p>Ling Xiao gave a smile that was yet not a smile and glanced at him, “I’ve heard it’s a snake, and his bloodline should be higher than SheQiu’s. Zhan YuXuan and he entered into the academy at the same time and it’s rumored that they were already good friends before this. Both their origins are unknown.”</p><br/><p>You XiaoMo rubbed his chin with a look of thought.</p><br/><p>Seeing that he had completely forgotten all about the chick, Ling Xiao did not bring it up again.</p><br/><p>Peaceful days continued one after another. The incident in the Boundless Sea had already faded from the memories of the forgetful. Replacing it was the fierce dispute in the north with the Four Big Clans, but the Teng Family and Chai Family were nevertheless retreating in defeat step by step.</p><br/><p>This continued till half a month later, as Qiu Ran who had a bounty abruptly emerged, and staged an extraordinarily beautiful counterattack. Not only did he injure sixty to seventy percent of the practitioners, he even brought two experts who wounded the BaiLi Family’s old ancestor. Finally, the BaiLi Family had to ask DaoXin Academy for help.</p><br/><p>When You XiaoMo saw Tang YuLin, it was a rare case of BaiLi TianYi not being with him.</p><br/><p>When he asked, he found out that BaiLi TianYi had taken a long leave to return to the BaiLi Family. BaiLi TianYi was already chosen as the BaiLi Family’s future head so he also needed to participate in and decide on the matters of the BaiLi Family.</p><br/><p>“Oh yes, did BaiLi TianYi tell you who the two experts that Qiu Ran invited were?” You XiaoMo remembered the words spoken by the Netherworld Siren before it died. It had been several months since that incident.</p><br/><p>“Nope. Those two experts are very strong and their origins are unknown.” Tang YuLin replied.</p><br/><p>Yet another one with unknown origins. After You XiaoMo bid farewell to Tang YuLin, he ran over to find Ling Xiao and told him of this matter. It was really too coincidental for these two to appear now.</p><br/><p>Ling Xiao thought over it for a while after hearing his news, “Seems like trouble has come knocking on our door.”</p><br/><p>The situation in the north deteriorated two days after Ling Xiao said this sentence.</p><br/><p>The cause of the incident was the leyline in the Boundless Sea. Not only did Qiu Ran and the two experts wound the Azure Sea Dragon, they also performed a hostile takeover of the remaining thirty percent of spirit gems.</p><br/><p>During this period of time, the other three families had already taken their share and it was only DaoXin Academy who had not finished mining. So Qiu Ran’s move was actually a provocation towards DaoXin Academy.</p><br/><p>Initially, Qiu Ran would not be able to shake up DaoXin Academy even if he had two extra helpers.</p><br/><p>But there were rumors that DaoXin Academy’s principal, Han Gong, had left for a Higher Level Realm due to a restriction on the Middle Level Realm. Therefore, for Divine Realm practitioners to have an opportunity to breakthrough, they had to leave the Long Xiang Continent to go to a Higher Level Realm. As for Duan QiTian, he was in secluded cultivation because of his soul. Thus, there were only the Five Elders left in the academy. Other than Hei Tian who was a peak seven star practitioner, the rest all had cultivation bases below seven stars.</p><br/><p>You XiaoMo was so anxious that he was running around in circles after hearing this news. Those spirit gems belonged to DaoXin Academy in name, but they were his in reality.</p><br/>\n</div>"}