{"title": "Chapter 360", "id": 360, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-360", "volume_title": "Volume 4", "body": "<h1>Chapter 360</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 360: My wife doesn’t like you</p><br/><p>Translated by Rara of Exiled Rebels Scanlations</p><br/><p>Hei Tian muttered the last sentence. In front of this familiar pressure of a Divine level practitioner, his composed expression was soon replaced with shock. Throughout the entire Long Xiang continent, he only knew one Divine level practitioner, the principal, Han Gong. Yet, this pressure was obviously not from Han Gong, but a stranger.</p><br/><p>He wasn’t the only one who was taken aback, Fairy FuRong and the others were also unable to move under such pressure. Their faces were overflowing with fear. A Divine level powerhouse had been beside them all this time they been fighting each other?</p><br/><p>You XiaoMo grabbed LanQiu’s arm tightly in excitement, his nails almost sank into flesh. This pressure was Ling Xiao’s, he finally made a move.</p><br/><p>LanQiu looked at his arm being wrecked and couldn’t help but roll his eyes. Boss Ling Xiao’s strength should be something you have long known, yet you still become this agitated. Even so, don’t take it out on him, although it didn’t hurt him even a little bit.</p><br/><p>Behind the clouds and mist, a figure vaguely appeared.</p><br/><p>Under everyone’s gaze, the black shadow came out from the mist and appeared.</p><br/><p>The man that stepped out was unexpectedly an outstanding, handsome man. Between his eyebrows was an embellished purple symbol of fire. It looked as if it was alive, blazing in between his eyebrows. The symbol added a touch of wickedness to his handsome face, a face no one would ever forget even with just one glance.</p><br/><p>In addition, on his right ear was a purple earring…</p><br/><p>The man wore a black brocaded robe while his demeanor gave out a cold and ruthless intent. No one would dare to make a pass on him just because of his handsome face. However, those black pupils of his were flashing with a hint of smile, yet not a smile. His overall temperament was somewhat harmonious yet left an odd feeling.</p><br/><p>This was a side of Ling Xiao You XiaoMo had never seen before.</p><br/><p>When he saw Ling Xiao appear, he quickly covered his mouth, his face was covered with astonishment.</p><br/><p>This was the first time he ever saw Ling Xiao wearing black clothes. Even the Fire symbol between his brows was a first. Compared to before, he looked even more charming. Seeing Ling Xiao like this made his heart thump and he blushed.</p><br/><p>“Boss…Was he always this…handsome?” LanQiu hesitantly asked with a bit of jealousy. He liked beautiful people, but his “inborn condition” wasn’t enough. And so, every time he saw a man more beautiful than him, he couldn’t help but feel jealous towards the person.</p><br/><p>Back at the time he lived in the mountains, he had killed plenty of handsome fellas who intruded into his territory.</p><br/><p>You XiaoMo’s lips twitched, he could roughly guess LanQiu’s thoughts. He lifted his head, “No, normally he wasn’t this slutty.”</p><br/><p>LanQiu, “…”</p><br/><p>SheQiu, “…” How can you say those words? If boss ever heard this, he will kill you.</p><br/><p>You XiaoMo paused then said, “I’m okay with you guys hearing those words, but remember never tell Ling Xiao.”</p><br/><p>The two, “…”</p><br/><p>For the Netherworld Siren that was being forced to reveal his appearance, after he felt the pressure aura of a Divine level powerhouse, his expression changed. But since Ling Xiao had slightly altered his aura, both him and Dong Shen only felt that it was a little familiar.</p><br/><p>The Netherworld Siren decided, he chose to give up on the Elemental Essence. However, Ling Xiao didn’t want to let them go so easily, he wanted to kill them.</p><br/><p>When the Netherworld Siren threw away the Elemental Essence, Ling Xiao didn’t chase after it. Instead, he went after them, as his body weirdly disappeared on the spot.</p><br/><p>This time, Ling Xiao directly locked them up and didn’t let them have a chance to escape like the first time.</p><br/><p>Both Netherworld Siren and Dong Shen felt a chill up their spines.</p><br/><p>They were horrified when they found out this man wanted to kill them, but why?</p><br/><p>They couldn’t figure out the reason. If it was because of the Elemental Essence, this action simply wasn’t necessary. Moreover, his strength was clearly far more superior than anyone at the place, taking them all on by himself shouldn’t be a big problem. However, he didn’t appear until the very last minute. Just why?</p><br/><p>Questions kept coming in his head, but — Dong Shen frowned and looked at the man. He always felt that he had met this man somewhere, but if he had seen him before, he would never forget his face. But then, his figure somehow looked like, like…</p><br/><p>As if he just thought of something, Dong Shen suddenly widened his eyes. Could he be that man?</p><br/><p>Ling Xiao squinted his eyes, judging from Dong Shen’s expression, seemed like he had been found out.</p><br/><p>Ling Xiao had no intention to let Dong Shen have a chance to open the mouth. Without any warning, he took a step forward, red flame immediately rose from beneath his feet. Within the next second, his appearance soon vanished like a ghost and appeared right next to Dong Shen. His fist carried the red flame as it slashed through the air, heading toward Dong Shen’s head.</p><br/><p>With such dreadful speed and power coming toward him, Dong Shen’s pupils suddenly shrank, but he was too late to make a move. Dodging was his only option. He leaned back his body, trying his best to avoid the fist, but he could only avoid half of it…</p><br/><p>The flame fist carried both strength and killing intent, leaving him no space to dodge and hit his head. The dizziness instantly stopped all his nerves for two seconds.</p><br/><p>It could be say that the head was everyone’s weak point. No matter how strong one could be, it was impossible for one to train their heads to become impenetrable.</p><br/><p>Ling Xiao coldly laughed. Like that old saying, ‘take the chance and kill the man when he is sick”, he wouldn’t let such an opportunity slip out. His next blow immediately broke through Dong Shen’s defense and once again went towards his head.</p><br/><p>His fist was wrapped in a blazing hot fire. The color of the fire was neither purple or red, more like a fusion of the purple flame and red flame. It was his strongest fire. Even though Dong Shen was an Emperor level powerhouse with an extraordinary defense power, his head was bashed in half…</p><br/><p>With an explosion, pieces of bright red brain matter burst into the air like firework sparks, as Dong Shen’s body powerlessly fell.</p><br/><p>“Ahhhh!! I will kill you!” The Netherworld Siren screamed in anger. His eyeballs almost bulged out. His flame of anger was scorching as if it could burn everything. Seeing his contractor being killed in front of his own eyes almost pushed him to madness. But the next second, he suddenly coughed out blood, his body was on the verge to collapse.</p><br/><p>Since they had a life bound contract relationship, their lives were linked together.</p><br/><p>As soon as Dong Shen died, he also got a backlash. Being bitten back by the life bound contract, his cultivation was forced back to level nine.</p><br/><p>“Kill me?” As if he just heard a funny story, Ling Xiao laughed, “With your current level, you still want to kill me?”</p><br/><p>Netherworld Siren’s eyes reddened, filled with murderous intent, “Don’t get too proud of yourself. Once this matter is reported back to our superiors, soon, they will send stronger people for you, and by that time, it will be your time of death!”</p><br/><p>By the time his sentence ended, his body suddenly swelled up. This was the prelude to a self-detonation.</p><br/><p>Everyone got frightened and quickly retreated. Although his cultivation was decreased, the power from a self-detonation was enough to injure those Emperor level powerhouses.</p><br/><p>Ling Xiao’s eyes were cold. He wrapped his fire around the Netherworld Siren’s body that was about to explode and let its inside his body. In the next few second, his self-detonation action was stopped as his body fell to the ocean along with Dong Shen.</p><br/><p>Two powerhouses were killed in a swift instant like that of the sudden appearance of a mysterious man.</p><br/><p>Everyone looked toward the man with fear.</p><br/><p>Ling Xiao didn’t pay attention to them. He sucked the Elemental Essence toward his hand, the Elemental Essence struggled a little bit before finally settling down on his palm.</p><br/><p>After finishing this matter, Ling Xiao moved his eyes toward the Chai clan’s ancestor.</p><br/><p>Aware of the sight laid on him, the Chai clan’s ancestor felt a tingling sensation along his scalp. He didn’t have any connection to this man, why was he looking at him?</p><br/><p>Ling Xiao squinted his eyes and showed a happy face, “You of Chai clan, I give you an opportunity, as long as you able to take on one move of mine, I will spare your life.”</p><br/><p>“Why? I seem to have no grudge against you, sir.” Chai Clan’s ancestor tried to suppress the anger. He hadn’t encountered such a thing for many years. If it wasn’t because of the opponent’s strength, he would kill him without a thought.</p><br/><p>Ling Xiao squeezed the Elemental Essence, indifferently glanced at him and laughed, “You and I have no grudge, but…my wife doesn’t like you.”</p><br/><p>The wife that was used as an excuse, “…”</p><br/><p>The Chai clan’s ancestor’s face sunk.</p><br/><p>Ling Xiao said, “One word, accept or not.”</p><br/><p>The Chai clan’s ancestor had no other choice, because if he didn’t accept, the man would certainly kill him on the spot. The ancestor directly used actions in replacement for answer. His power rose up immensely as his put up his defense.</p><br/><p>Ling Xiao moved the Elemental Essence to his left hand. He lifted his right hand up high. A sparking sound suddenly came out from his palm. A red flame gushed out like a volcano eruption. Within a moment, it formed into a big fireball.</p><br/><p>But it wasn’t over yet. The fireball suddenly whirled around, then, a sharp and loud hoot came out of the fireball. One second later, a pair of fiery wings suddenly spread out. A fire phoenix appeared in front of everyone, its aura made people’s hearts skip a beat.</p><br/><p>In front of this scene, Hong Yun’s pupils widened, “This…the aura of an Ancient Demon Phoenix?”</p><br/>\n</div>"}