{"title": "Chapter 377", "id": 377, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-377", "volume_title": "Volume 4", "body": "<h1>Chapter 377</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 377: Setting Off</p><br/><p>Translated by Rachel of Exiled Rebels Scanlations</p><br/><p>After spending two and a half months, Ling Xiao finally completed the Trans-Dimensional Tunnel. It was completed one and a half months earlier than expected, but in order for the spatial force to stabilize, they had to wait a few more days. Then, as Ling Xiao said, all they had to do was to pick an auspicious day to set off. But before that, they still had one more problem to solve.</p><br/><p>The Trans-Dimensional Tunnel had an infinitely strong spatial force field. If a normal person were to enter, say someone of You XiaoMo’s level, no doubt they would be shredded to pieces by the spatial force. You XiaoMo had Ling Xiao, so that wouldn’t be a problem. But that was a different story for Yin Ge and Zhan YuXuan.</p><br/><p>Luckily, Yin Ge and Zhan YuXuan had already taken this into consideration. Furthermore, they had also experienced it before. So when it was suggested to them to set off together for the High Realm, they had already taken this aspect into their consideration.</p><br/><p>True to his word, Ling Xiao picked out an auspicious day three days later.</p><br/><p>The auspicious day, which was also the eleventh day since the completion of the tunnel, was the time when the spatial force field reached an equilibrium point and was the safest to travel.</p><br/><p>Before they set off, all of You XiaoMo’s friends turned up … in his and Ling Xiao’s room to send him off. Reason being Ling Xiao had built one end of the tunnel there… The originally spacious room quickly became cramped as BaiLi,Tian Yi and a few others entered. Seeing that his house was stuffed full of people, You XiaoMo walked into the inner room and complained to Ling Xiao.</p><br/><p>“Couldn’t you have picked a larger place to work on the tunnel?”</p><br/><p>Ling Xiao lazily glanced at him before replying, “The fewer people that know about the Trans-Dimensional tunnel, the better. Even though it will automatically disappear after a while, it’ll still be troublesome if someone with ulterior motives were to get their hands on it. Ward A may have Hei Tian and the rest, but they can’t possibly handle everything.”</p><br/><p>You XiaoMo touched his nose. So there was an underlying reason for doing this.</p><br/><p>Previously he heard Ling Xiao talk about how the Trans-Dimensional tunnel the middle aged man tried to leave through vanished immediately. Apparently, this one wasn’t the same. He reckoned not many would even think of searching their room for the tunnel.</p><br/><p>“XiaoMo…” BaiLi XiaoYu’s voice drifted in airily.</p><br/><p>You XiaoMo walked out only to find that BaiLi XiaoYu was not alone, but with BaiLi TianYi and Tang YuLin.</p><br/><p>“What’s up with you guys?”</p><br/><p>“Are you guys… really going to the High Realm?” BaiLi XiaoYu asked hesitantly.</p><br/><p>“Of course, we’ve prepared everything already.” You XiaoMo nodded.</p><br/><p>Baili XiaoYu decided to try his luck. “Then, is it possible if…”</p><br/><p>“No.” Before he even got the chance to finish, BaiLi TianYi shot him down resolutely.</p><br/><p>“But second brother!” BaiLi XiaoYu glared at him unhappily.</p><br/><p>“It’s no use even if you call Mother. BaiLi XiaoYu, don’t think I don’t know what’s going on in your head. With your current level of power, do you even think you stand a chance in the High Realm? You’ll be dead. And also, they’re not there to have fun.” BaiLi TianYi said firmly.</p><br/><p>“XiaoYu, you want to come with us?” You XiaoMo asked, surprised.</p><br/><p>BaiLi XiaoYu’s lips pressed into a thin line, unwilling to speak.</p><br/><p>Taking his silence for a yes, You XiaoMo told him regretfully, “I understand how you feel, but I’m afraid you can’t come along this time. The conditions don’t permit it.”</p><br/><p>“Why?”</p><br/><p>“Because I cannot guarantee your safety.” Zhan YuXuan walked in with Yin Ge by his side. Clearly, the two of them had heard their conversation.</p><br/><p>This time, only Yin Ge and Zhan YuXuan were going with You XiaoMo to the High Realm. Not because they were the only ones who came from the High Realm, but because they possessed something called the Space Stone. The Space Stone was a very precious item produced only in the High Realm and they were extremely rare. They served an important purpose of protecting them from the destructive spatial force within the dimension tunnel.</p><br/><p>When Yin Ge and Zhan YuXuan initially came to the Middle Realm, they brought along four pieces of Space Stone, two of which they used along the way. Currently, they were only left with two, so they really couldn’t afford to bring anyone with them.</p><br/><p>BaiLi XiaoYu never thought it was so dangerous. Seeing You XiaoMo being very relaxed about the matter, he thought that traveling between two realms was going to be a piece of cake. Without having to be persuaded, he gave up on tagging along.</p><br/><p>Gao Yang had originally intended to send You XiaoMo off, but unfortunately, he was on duty that day. In addition, he was also the captain of the team, so he couldn’t take leave. He had no other choice but have BaiLi XiaoYu deliver his words to You XiaoMo.</p><br/><p>“Gao-Dage has always been a busy guy. When I leave, please give him my thanks.” You XiaoMo realized that ever since he entered Ward A, the times he saw GaoYang were few and far between, which was rather regretful. Gao Yang was already a brother figure that he looked up to even before he entered DaoXin Academy.</p><br/><p>“Ok, I’ll send him your message.” BaiLi TianYi replied.</p><br/><p>Fifteen minutes before they set off, Hei Tian and Duan Qi Tian finally showed up. Hei Tian got everybody to wait outside and made You XiaoMo bring them to see Ling Xiao in the inner room. However, Ling Xiao wasn’t going to entertain them easily.</p><br/><p>Ever since Ling Xiao’s identity was revealed, neither Hei Tian nor Duan QiTian brought up the matter of him lying about his age to enroll into the Academy. While rules were meant to be obeyed, it was the fist that made the rules in the real world.</p><br/><p>“We’ve come to speak to you about Principal Han Gong.” Hei Tian took the lead to speak. With his face as expressionless as ever, anyone could tell with one look that he was a man of strict self-discipline.</p><br/><p>Ling Xiao raised a brow. “Han Gong?”</p><br/><p>“That’s right.” Hei Tian nodded.</p><br/><p>“Principal Han Gong has gone to the High Realm and has not returned to the Long Xiang Continent for close to two thousand years. As for the reason, you probably know.”</p><br/><p>Ling Xiao thought about it before answering, “The Long Xiang Continent has restrictions on the levels one can attain due to the Realm it is in. Emperor level powerhouses who wish to have a breakthrough and reach the Divine level would face much greater difficulty than in the High Realm. Furthermore, for a Divine Level powerhouse to level up here would be equally hard. Is this why he left for the High Realm?”</p><br/><p>“Exactly.”</p><br/><p>“So? What’s the point of telling us this?”</p><br/><p>Hei Tian took out a normal looking jade slab. “This is Han Gong’s portrait. I want to ask a favor of you. If you ever meet Han Gong, tell him about DaoXin Academy’s situation.”</p><br/><p>Ever since the barrier was broken and dissolved, the situation did improve but it wasn’t a long term solution. The high level demon beasts in the Deep Mountain seemed to be on the move already so it was imperative that they erect a new one quickly.</p><br/><p>You XiaoMo didn’t expect Ling Xiao to agree, but to his surprise he did.</p><br/><p>“I will pass the message if I see him.” Ling Xiao said. Meaning, if he didn’t see Han Gong, he wouldn’t go out of his way to search for him.</p><br/><p>It was as Hei Tian expected.</p><br/><p>After they were done talking, Duan Qi Tian walked up to You XiaoMo and grabbed his hands emotionally.</p><br/><p>“My dear disciple…”</p><br/><p>You XiaoMo felt goosebumps all over his body.</p><br/><p>Duan QiTian didn’t seem to notice as he continued, “The High Realm is very different from the Long Xiang Continent. There are powerhouses everywhere and many stronger than Ling Xiao out there. You have to be careful there. If you feel something’s wrong, run immediately. Understand?”</p><br/><p>“I…I understand.”</p><br/><p>This must be the Old Geezer’s first personality, You XiaoMo thought to himself. Looks like the problem with his soul had been more or less fixed, but nothing had changed about his dual personality.</p><br/><p>“If Ling Xiao dares to bully you, tell me.” Duan Qi Tian said.</p><br/><p>“ShiFu, are you going to avenge me by bullying him back?” You XiaoMo was touched.</p><br/><p>“No, your ShiFu will help you curse him.”</p><br/><p>“…”</p><br/><p>“Dear disciple, you need to empathize with your ShiFu. I can’t defeat him.” Seeing as You XiaoMo showed no signs of speaking, he thought that he had utterly disappointed You XiaoMo.</p><br/><p>You XiaoMo couldn’t stand his Shifu’s gentle and mushy tone anymore. He reckoned he must be a masochist. Why else would he miss the Old Geezer’s second personality or the times he got a scolding?</p><br/><p>“Shifu, I know you can’t defeat him. But don’t worry, I won’t make you hit him for me.” You XiaoMo said understandingly, trying his best to ignore the goosebumps rising on his skin. Duan Qi Tian was so touched that his tears spilled forth.</p><br/><p>“My good disciple ahhh…”</p><br/><p>You XiaoMo continued, “I’m afraid that he’ll beat you into a pulp. That would be disgraceful for me.”</p><br/><p>“…” Duan Qi Tian was at a lost for words. The Shifu was an idiot, so was the disciple.</p><br/><p>Like Shifu, like disciple. Ling Xiao knew it would end like this, but it brought him great joy every time the idiot duo talked. From the crack in his stern demeanor, this must have been the first time Hei Tian saw Duan Qi Tian acting so dumb.</p><br/><p>After the master and disciple finished their talk, the time to set off had finally come. As they had to keep the Dimension Tunnel a secret, not many knew they were leaving the Long Xiang Continent apart from a few close friends.</p><br/><p>After Hei Tian and Duan QiTian left the room, Yin Ge and Zhan YuXuan came in.</p><br/><p>“Where are the rest?” You XiaoMo asked.</p><br/><p>“The Great Elder got them to leave.” Zhan YuXuan answered. Having too many people gathering outside would make it too conspicuous, so they were chased back reluctantly.</p><br/><p>Ling Xiao walked over and looked at all of them.</p><br/><p>“Since you’re ready, then let’s go.”</p><br/><p>In that moment, the mini whirlpool that was silently floating mid air suddenly had a gigantic outburst of power. It started to enlarge and spun faster and faster as a suction force sucked the tables and chairs in the room in.</p><br/><p>Ling Xiao grabbed You XiaoMo’s waist and turned back to give the other two a command, “Go!”</p><br/><p>A moment later, all four of them had disappeared. The whirlpool within the room returned to its normal size about half an hour later and silently spun around in the air.</p><br/>\n</div>"}