{"title": "Chapter 372", "id": 372, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-372", "volume_title": "Volume 4", "body": "<h1>Chapter 372</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 372: Sacrificial Blood Rite</p><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>The purple aura, which represented Ling Xiao, didn’t back down, not even one step, staying where the three had collided. The other two auras had instead been pushed back to twenty meters away.</p><br/><p>In the first round, the middle-aged man and Yu WenNan both lost, a highly surprising conclusion. Even they were shocked.</p><br/><p>Yu WenNan’s surprised look was the most apparent because the Netherworld Siren’s report had not included Ling Xiao’s level as Divine. Even though the rumors of the North’s Divine Leveled Practitioner were all over the place, he had not put the two together since there was no evidence for it.</p><br/><p>“Nan Shen, looks like its about time to bring out your contract demon beast. Don’t you think so?” The middle-aged man turned towards Yu WenNan, with an eerie expression.</p><br/><p>Yu WenNan glanced back coldly, “I don’t mind, I’m just afraid about your life-bounded contract demon beast.”</p><br/><p>The smile disappeared off the middle-aged man’s face as he said, “What are you implying?”</p><br/><p>Yu WenNan continues, “His abilities come from the Qilin, the leader of the four ancient beasts. If yours isn’t an Emperor demon beast, the moment it comes out, it will be suppressed. That will cause even more trouble.”</p><br/><p>The middle-aged man looked at Ling Xiao in shock, “Isn’t he part of the ancient race of Ancient Demon Phoenix? How did he become a Qilin?”</p><br/><p>Shocked as well, Yu WenNan questioned, “What did you say?”</p><br/><p>The expression on the middle-aged man’s face turned umbrageous, “That man called Qiu Ran told me Ling Xiao was an Ancient Demon Phoenix of the four ancient beasts because he had a five-colored bird who was highly attuned to Demon Phoenix’s aura. Not only that, they had fought before so there shouldn’t be any errors.”</p><br/><p>Although the Ancient Demon Phoenix race was one of the four ancient beasts, compared to Qilin, it was still lacking a bit. Because the Qilin were the leaders, its ability to suppress and pressure was slightly stronger than that of the other three.</p><br/><p>Now Yu WenNan finally came to realize what the red flame was.</p><br/><p>He wasn’t a pure breed Qilin, but a mix of Qilin and Ancient Demon Phoenix. If that was the case then there were only two options of mixed blood, one was mutation and the other was no mutation.</p><br/><p>With no mutation and with a tainted bloodline, the Emperor demon beast’s potential and power would be slightly worse than that of a pure breed.</p><br/><p>However, if there was a mutation, then that was something to be feared.</p><br/><p>Since the ancient times, mutated demon beasts were always stronger than the original. In other words, a complete revitalization. He couldn’t help but remember that ancient legend from the higher realms, but that should be impossible.</p><br/><p>“Be careful!” the middle-aged man’s distressed voice sounded abruptly.</p><br/><p>Yu WenNan immediately broke into cold sweat, he had made a grave sin of being distracted during a fight. Looking over, the man’s demon like pair of purple eyes stared down coldly at them. In his hand were two flames; one purple, one red. Even from meters away he could feel the heat of the flames.</p><br/><p>If what he speculated was correct, then it was likely that this man was a mutated Emperor demon beast.</p><br/><p>The situation just became much more complicated.</p><br/><p>“Since you took your time to come, it would have been better if you had just stayed.” Ling Xiao said as he lightly curved his lips upward. His pitch-black eyes had two dancing purple flames ignited within them. His perfect features were giving off a mysterious aura by the light and a sense of danger.</p><br/><p>As he finished his sentence, the two flames in his palms seemed to dance in anticipation, growing much larger. And under his control, slowly combined…</p><br/><p>Yu WenNan and the middle-aged man quickly shared a glance before separating in understanding, one towards Ling Xiao and the other towards the protected You XiaoMo.</p><br/><p>If they weren’t a match for the man, then he should start from somewhere else.</p><br/><p>Seeing the previous scene, Yu WenNan already knew that the one called You XiaoMo was his weakness.</p><br/><p>But his plan failed.</p><br/><p>Ling Xiao had intercepted Yu WenNan midway, his right flame turned to a roaring fire Qilin. The pressure from a Emperor beast spread out across the sky, that overwhelming weight made people’s soul tremor.</p><br/><p>Even humans became like this, much less the demon beasts. Even their movements were stalled.</p><br/><p>Hei Tian and the others took this opportunity to critically injure their opponents’ demon beasts, cutting their fighting power.</p><br/><p>But there was one who escaped that, like Qiu Ran’s life-bound contract demon beast, Red Cloud. Because Qiu Ran knew Red Cloud would be suppressed, he didn’t dare bring him out. Although that cut his fire power by a lot, it was now clearly the right choice.</p><br/><p>The middle-aged man and Yu WenNan, who planned to bring out their demon beasts, couldn’t help but stop that train of thought.</p><br/><p>Once he had summoned the fire Qilin, Ling Xiao suddenly cut open his finger and dripped a drop of life blood onto the center of the Qilin’s brow. A few seconds later, on his forehead appeared a similar fire pattern. The majestic Qilin, as if given life, suddenly opened its eyes, and those eyes shared a human like quality.</p><br/><p>Abruptly Yu WenNan’s faced changed, in horror he exclaimed, “This is the sacrificial blood rite?!”</p><br/><p>Sacrificial blood rite was a hidden ritual of the Qilin Clan. With one drop of life blood, it could summon a Qilin of the owner’s power level. It was a hidden ritual that defied nature.</p><br/><p>But there were two after effects, one was that the owner’s power level would be affected. For example, backlash and restrictions, but that wasn’t the most critical. The second effect was that it would reduce the cultivation level, maybe one star, but it might also be two stars. Even a gifted clan like the Qilin were unwilling to take that risk, making the people who used it less and less.</p><br/><p>However…</p><br/><p>What caused Yu WenNan’s horror wasn’t this.</p><br/><p>The Qilin Clan once had a super genius who didn’t like the consequences of the ritual and thus, using hundred of years, changed it.</p><br/><p>In the end, the Qilin who used the sacrificial blood rite would still drop in level, but the summoned Qilin had an extra ability and that was—devour.</p><br/><p>This was what he dreaded and was frightened of.</p><br/><p>The ones who were devoured by the fire Qilin, their strength and cultivation could be absorbed by the owner. A terrifying power.</p><br/><p>Later on, due to the fear of the other three ancient races, they forced the Qilin Race to seal away this rite.</p><br/><p>Ever since then, no one of the Qilin race had used this sacrificial blood rite. Now, even the ones who had heard of it were getting smaller and smaller.</p><br/><p>Although the man could very well be using the original sacrificial blood rite, Yu WenNan had a sinking suspicion that the fire Qilin in front of him was the devouring kind.</p><br/><p>“Okay then, let’s get the show on the road.” Ling Xiao said with a smile.</p><br/><p>The ones who felt his gaze, the middle-aged man and Yu WenNan, all felt a chill go down their spines.</p><br/><p>The man was already stronger then them, now with a similar leveled devouring Qilin the balance had tipped completely out of their favor.</p><br/><p>Yu WenNan and the middle-aged man both saw the resignation in each other’s eyes.</p><br/><p>“Go, my devouring Qilin.” Ling Xiao spoke in his even paced, clear and warm tone. Unless one saw with their own eyes, no one would believe that behind such a pretty voice laid such a gruesome scene.</p><br/><p>From the throat of the devouring Qilin came a dangerous roar. It inherited all of Ling Xiao’s strength and went straight to the enemy with unimaginable speed. The spot in which it disappeared was left with a small whirlwind.</p><br/><p>“AHHHHH!” The first sacrifice appeared.</p><br/><p>That was the Thousand Faces Purgatory Spider, being a demon beast, it was much suppressed by the devouring Qilin and being weaker, before it could move, it was eaten with a face of horror.</p><br/><p>With a scream, the Thousand Faces Purgatory Spider disappeared.</p><br/><p>Not far from here, Chen QingEr vomited out blood. Just like the Netherworld Siren, if the life-bounded contract demon beast dies, the owner would suffer a heart-wrenching pain. As if the soul was being torn apart.</p><br/><p>In a hurry, Chen QingEr took out a pill and swallowed it. Although it could not solve the problem, it relieved some of the pain. Her face, however, was still pale, as if she had just experienced a massive fight.</p><br/><p>Seeing what happened to Chen QingEr, those with a life-bounded contract demon beast immediately recalled them in fear. However, that didn’t solve the root of the problem, if the Qilin devoured the owner, then the contracted demon beast was still dead.</p><br/><p>With the instructions of Ling Xiao, the devouring QIlin turned its attention elsewhere.</p><br/><p>When You XiaoMo woke up, this was the image he saw.</p><br/><p>A Qilin whose whole body was on fire, chasing after people who were escaping in all directions. The sky was chaotic, filled with screams of terror, of anger, and of fear.</p><br/><p>What chaos!</p><br/><p>You XiaoMo straightened himself up and searched for Ling Xiao.</p><br/><p>Pretty quickly he was able to find Ling Xiao and Yu WenNan wrapped up in a battle next to the Devour Qilin.</p><br/><p>For some reason the middle-aged man and Yu WenNan really feared him.</p><br/><p>The first to realize that he was awake was Yin Dai. Although he was watching the sky, part of his attention was on him. When he realized he was awake, he didn’t say anything, after all he wasn’t good with his words.</p><br/><p>“Xiao Mo, you’re finally awake.” The second to realize was Tang YuLin. He didn’t care much for the battles and tilting up one’s head for a long time made it really sore. “How do you feel?”</p><br/><p>“I’m fine, what’s the situation right now?” You XiaoMo asked as he got up.</p><br/><p>“Your man is giving them a walk.” Tang YuLin said.</p><br/><p>You XiaoMo’s mouth twitched.</p><br/>\n</div>"}