{"title": "Chapter 387", "id": 387, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-387", "volume_title": "Volume 4", "body": "<h1>Chapter 387</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 387: Add One More Spirit Gem</p><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>“Seems like there won’t be that many people bidding this time.” Ling Xiao said, opening his half-closed eyes and sweeping his sharp gaze over the people in the box.</p><br/><p>“Why won’t there be many?” You XiaoMo asked in surprise. He had thought there would be a lot of people bidding for this, if the hungry wolf-like gazes that the majority were directing at the Heavenly Cauldron were any indication.</p><br/><p>Ling Xiao said mildly, “Look at this situation. That Hu Feng and Tang Hao definitely came for that Heavenly Cauldron. The people here all seem to know that they’re from a large power in the Southern Continent. The prestige and influence the forces of the Southern Continent possessed wasn’t anything to scoff at and their financial power was far greater than those of Bei Dong. If they can’t be beaten, then why compete at the risk of angering them?”</p><br/><p>That was very true.</p><br/><p>You XiaoMo glanced around the box. Though the people inside were looking at the Heavenly Cauldron with visible desire, their gazes also held a touch of defeat. Seems like they had long since decided to give up.</p><br/><p>Seeing everyone’s covetous gazes, Yue QianShan looked up at the boxes above. He could feel several intense gazes coming from the boxes. A bloody battle was soon to come. He nodded in satisfaction and said, smiling, “The Heavenly Cauldron starts from five hundred thousand spirit gems, please, begin.”</p><br/><p>“Five hundred thousand spirit gems?”</p><br/><p>The hopeful powers that heard this number were all shocked to the point of barely being able to breathe.</p><br/><p>The powers of BeiDong were truly lacking in financial power. Some groups didn’t even have five hundred thousand spirit gems when including their assets. Even if they did, they wouldn’t have anything more than a million spirit gems, so this starting price had already eliminated them.</p><br/><p>However, the Heavenly Cauldron was truly worth the price, or rather, this price was actually lower than the market price.</p><br/><p>It should be known that to mages, any cauldron that ranked in the top ten would be priceless.</p><br/><p>That the Cang Alliance would auction off the Heavenly Cauldron was truly something unexpected. The other forces that resided in far off places naturally wouldn’t expect this, so when Hu Feng and the others heard of the news, they had come over immediately.</p><br/><p>Hearing this price, Hu Feng and Tang Hao’s expressions didn’t waver at all.</p><br/><p>This wasn’t the first time they had attended an auction of one of the ranked cauldrons. They had been present for the auctioning of the fifth ranked cauldron, the Thunder God’s Cauldron. Back then, the Thunder Cauldron’s starting price was over five times the starting price of the Heavenly Cauldron, and the price had increased over tenfold over the progression of the auction, so five hundred thousand really didn’t mean anything.</p><br/><p>“A million spirit gems.” After a while of silence, Tang Hao was the first to bid a price, and added five hundred thousand spirit gems all at once. The entire room quietened.</p><br/><p>Many of the groups had their passion extinguished in that instant. As expected from someone from the Southern Continent. He let his wealth speak for him, and they wouldn’t even be able to catch up to that on horses.</p><br/><p>Hu Feng glanced at Tang Hao who was sitting in the next box over, coldly harrumphing. He didn’t blink as he said, “One million and five hundred thousand spirit gems.”</p><br/><p>He had also added a full five hundred thousand spirit gems. As expected, only these two would be left to compete.</p><br/><p>The groups in the other boxes all sighed in awe.</p><br/><p>That was when Duan MuQing looked over into the neighboring box and, seeing that You XiaoMo and Ling Xiao didn’t seem to intend to compete, couldn’t help but sigh softly. Seems like the starting price was beyond their expectations.</p><br/><p>Hearing Hu Feng’s voice, Tang Hao’s expression cooled, his eyes taunting. He knew that the person who would be competing with him would be Hu Feng, so he had fortunately prepared himself and brought plenty of spirit gems. There was no way that Hu Feng would win.</p><br/><p>“One million seven hundred thousand.”</p><br/><p>“One million eight hundred thousand.”</p><br/><p>“Two million.”</p><br/><p>……</p><br/><p>The entire place was dead silent. Everyone was struck speechless by these absurd prices.</p><br/><p>The two competing voices were neck and neck, neither willing to step down at all. With the continuous increases, the price had long since left the scope of BeiDong’s previous auctions, but neither seemed to have the intention of stopping.</p><br/><p>Though there were only two groups bidding, the situation was thrilling.</p><br/><p>“Five million spirit gems.” As Tang Hao gave this shocking price, the price of the Heavenly Cauldron finally reached tenfold its original price. Though the price had yet to go over their expectations, it was almost there.</p><br/><p>When Tang Hao gave this price, Hu Feng’s expression had already drawn tight. It was clear that he was almost at his limit. After a while of silence, he gritted out, “Five million and one hundred thousand spirit gems.”</p><br/><p>Tang Hao’s eyes flashed and, five seconds later, he said, “Hu Feng, I’ve brought six million spirit gems with me this time. If you can offer more than six million, I’ll be willing to let you have the Heavenly Cauldron.” Then, he turned to eye Hu Feng smugly.</p><br/><p>Hu Feng’s eye twitched, almost jumping up off his seat.</p><br/><p>Tang Hao’s words caused his eyes to go red, flashing with murderous green light. His expression was ugly, as if he had swallowed a fly. He had somehow been beaten by Tang Hao. All he had brought this time was six million as well, no more no less.</p><br/><p>What he hadn’t expected was that Tang Hao had the same as him. If he offered six million, then Hu Feng couldn’t also offer six million.</p><br/><p>Looking at Hu Feng’s expression, he knew that the other didn’t have it and couldn’t help but feel triumphant.</p><br/><p>His bet had paid off. Hu Feng had brought either the same or less than him. No matter which it was, he had won.</p><br/><p>Seeing how Hu Feng didn’t give a price, Tang Hao spoke with a smile to Yue QianShan down below them. “Lord Yue, I believe you can begin counting down, no?”</p><br/><p>Yue QianShan looked at the two of them and, seeing that it seemed to be over, raised his voice and yelled, “Six million going once!”</p><br/><p>“Going twice!</p><br/><p>“Going…”</p><br/><p>“Six million and one spirit gems!” That was when a clear and crisp voice interrupted.</p><br/><p>Tang Hao’s smile froze on his face.</p><br/><p>The voice came from inside the box. A commotion immediately rose from the audience that had been quietly watching the two compete. It had just been about to end when an outsider had suddenly cut in. What was going on?</p><br/><p>After a while, everyone’s gaze converged on the box the voice had come from. They were all curious about the person that dared to show up Tang Hao and Hu Feng from the Southern Continent.</p><br/><p>In the transparent box, the one that had raised his hand and called out a price was an unfamiliar young man. Some sharp-eyed people recognized him immediately though.</p><br/><p>“It’s him!”</p><br/><p>“Who is he?”</p><br/><p>“He’s the young man that started an argument with the people from the Southern Continent. It was because they were blocking the entrance, that young man asked them to move and offended them.”</p><br/><p>“Holy crap, he sure is daring. He went against people from the Southern Continent twice in a row; has he gotten tired of living or something? Though BeiDong isn’t their turf, it’d still be easy for them to kill him.”</p><br/><p>“Who knows? He might be someone with a background too. Why else would he still go against them despite knowing who they are? Not all people with backgrounds like that are high profile.”</p><br/><p>……</p><br/><p>Everyone talked amongst themselves and the entire place was filled with a cacophony of voices. The silent auction had finally returned to being alive with noise.</p><br/><p>The Heavenly Cauldron was at the precipice of falling into his hands, yet at the last moment, a person, bidding a measly one spirit gem higher than him, had bid for the cauldron. He had fallen from that feeling of delight to the very bottom in an instant. The immense contrast was terrible to bare; it felt like he had been lured into a trap.</p><br/><p>Tang Hao expression had twisted, his murderous gaze landing directly on You XiaoMo. Squeezing his hands into fists, his nails had sunk into his palms, causing them to bleed.</p><br/><p>“You again!”</p><br/><p>You XiaoMo stared back without fear.</p><br/><p>The auction didn’t have a rule for a minimum increase in a bid, so even increasing the price by a single spirit gem was allowed.</p><br/><p>Tang hao knew this, so he was even less willing to accept this, his hatred for You XiaoMo boiling over.</p><br/><p>However, there was one person who was delighted by this. That person was Hu Feng. The more frustrated Tang Hao was, the happier he was. Of course, it wasn’t because it was You XiaoMo, but because he didn’t want Tang Hao to have anything he couldn’t. So what was better than this?</p><br/><p>Plus, he had just been baited and trapped by Tang Hao, so that rage hadn’t calmed yet. Seeing this guy receiving a humiliating defeat was exactly what cheered him up as he reveled in Tang Hao’s misfortune.</p><br/><p>“Tang Hao! I never would’ve thought it would come to this for you! Congratulations!” Hu Feng couldn’t help but say, delighted at the other’s misfortune.</p><br/><p>“Hu Feng!” Tang Hao was enraged, with that insult, Hu Feng had added to his injury, his eyes seeming close to spewing fire as he roared out a warning.</p><br/><p>Hu Feng seemed to remember something and suddenly retracted his laughter, giving a cold huff and stopping himself from rubbing salt in the other’s wounds further.</p><br/><p>Tang Hao held back his rage the best he could, throwing the spear tip back to You XiaoMo and said, harshly, “Brat, listen carefully, if you piss us off in YinYang Valley, I’ll assure you that you won’t have a good time in the TongTian Continent.”</p><br/><p>This was a blatant threat, using his own identity to intimidate an opponent. This was something that happened quite often in auctions. Most people who were on the receiving side could only retreat and think themselves unfortunate. Since the auctions really didn’t have any rules against threatening other people, it was fine so long as one didn’t start a physical fight. That was why Tang Hao dared to say something like this in front of Yue QianShan.</p><br/><p>The audience looked towards Yue QianShan and saw that, as expected, he didn’t have any reaction. It seemed like, so long as Tang Hao didn’t actually attack anyone then he wouldn’t step in.</p><br/><p>After Tang Hao said this, the young man in the box fell silent. After a while, when the audience thought that You XiaoMo had been scared by those words, he spoke again.</p><br/><p>“Alright then, I’ll add one more spirit gem to my bid.”</p><br/>\n</div>"}