{"title": "Chapter 391", "id": 391, "volume": 4, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-391", "volume_title": "Volume 4", "body": "<h1>Chapter 391</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 391: Trouble Caused by Pimples</p><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>Half a month went by swiftly. On this calm day, the inside of the Dimensional Teleportation portal suddenly began to tremble softly.</p><br/><p>Ling Xiao noticed this abnormality and opened his eyes, seeing that the space around You XiaoMo, sitting opposite him, had changed. He was probably about to breakthrough, and when breaking through, he needed to absorb a lot of spiritual energy, thus the vibrations in the air.</p><br/><p>However, there was a huge problem with breaking through inside a teleportation portal.Dimensional Teleportation portals contained only infinite spatial force and almost no spiritual energy.</p><br/><p>It was a good thing that Ling Xiao has considered this beforehand and made You XiaoMo stash tens of bottles of spiritual water in his bag for emergencies.</p><br/><p>Ling Xiao took out five bottle of spiritual water and placed them next to him. He turned his palm up and five small flames sprung forth from his palm before flying into the bottles of spiritual water at his direction.</p><br/><p>Not long later, milky white spiritual energy floated out from the openings of the vials. As if sensing You XiaoMo’s need for it, the spiritual energy swerved towards and into You XiaoMo’s body as one.</p><br/><p>Half a day passed liked that.</p><br/><p>Seeing that the water in the bottles were almost used up, Ling Xiao took out another five bottles and used the same method to create more spiritual energy.</p><br/><p>After fourteen hours, You XiaoMo’s motionless body suddenly shuddered.</p><br/><p>In the next second, the spiritual energy that had been created from spiritual water whirled into You XiaoMo’s body even more intensely, like a small tornado, fighting to get there first.</p><br/><p>After about another two hours, the absorption of spiritual energy finally began to peter out before coming to a halt entirely.</p><br/><p>You XiaoMo opened his eyes and immediately saw the magnified view of Ling Xiao’s face, causing him to jump. “What are you doing so close?”</p><br/><p>Ling Xiao didn’t blink as he replied, “A red nub like thing appeared on your face.”</p><br/><p>You XiaoMo immediately grabbed his own face, calling out in shock, “Pimples?”</p><br/><p>Ling Xiao asked curiously, “What are pimples?”</p><br/><p>You XiaoMo answered, “Pimples are something that prove you’re young.”</p><br/><p>Lign Xiao rubbed his chin in thought, “So it’s like that. Then why don’t I have any?”</p><br/><p>You XiaoMo couldn’t help the sound of laughter that came from his mouth. His gaze rolled to the side in thought before he said, delighted at a chance to mess with Ling Xiao, “Because you’re very, very old already. You’re an old man, so of course you wouldn’t have any.”</p><br/><p>Ling Xiao narrowed his eyes, “You find me old?”</p><br/><p>You XiaoMo felt the hair on his arms stand up at this gaze and couldn’t help but backpedal in regret for his words. “Of course not, I’m just stating a fact.” He would never tell Ling Xiao that people with good skin wouldn’t get pimples, otherwise Ling Xiao’s head wouldn’t be able to fit through the door anymore.</p><br/><p>Ling Xiao suddenly smiled. “But… I was messing with you when I said you had a pimple. So that means you’re an old man, too.”</p><br/><p>You XiaoMo: “…”</p><br/><p>T-tricked again!</p><br/><p>After half an hour, Ling Xiao seemed to begin to delight in calling him old. Every time he addressed You XiaoMo, he had to add “old man” to it at the beginning. Like now.</p><br/><p>“Old man, we still have a day before we arrive at the Southern Continent. Why don’t you start preparing? The Southern Continent is in a more chaotic situation than Bei Dong and the population is ten times Bei Dong, too.”</p><br/><p>You XiaoMo: “…”</p><br/><p>After a while.</p><br/><p>“Old man, after getting to the Southern Continent, let your contract beasts out. Having fed and housed them for so long, it’s time that they work to pay us back.”</p><br/><p>You XiaoMo was now deeply experiencing the feeling of dropping a stone on his own foot. He regretted it.</p><br/><p>You XiaoMo gripped Ling Xiao’s arm, crying tears and snot as he said, “I was wrong. I’ll never try and mess with you again.”</p><br/><p>Being called old man all the time, even as a joke, felt way too weird. Plus, if he didn’t surrender, Ling Xiao would probably continue and might even call him that in front of other people. All he did was play one prank; did Ling Xiao really have to get his revenge in such a way?</p><br/><p>Ling Xiao cupped his face and said, smiling, “My dear wife, trying to change after knowing you’re wrong is one of the best things a person can do.”</p><br/><p>Best things, your ass!</p><br/><p>If it wasn’t for you messing with me first, then I would’ve never tried to mess with you.</p><br/><p>Of course, You XiaoMo didn’t dare say that aloud. Otherwise, Ling Xiao would keep dragging things out. It wasn’t like he wasn’t used it, anyways, surrendering first he meant.</p><br/><p>“My dear wife…”</p><br/><p>Hearing the other, You XiaoMo raised his head.</p><br/><p>Ling Xiao lowered his head and kissed him on the lips, “A kiss first…”</p><br/><p>The slow, soft, gentle kiss tickled at his heart like a feather. It was so gentle that it felt like you could squeeze water from it. You XiaoMo felt like he was getting drunk.</p><br/><p>After the kiss, You XiaoMo collapsed into Ling Xiao’s embrace, face flushed.</p><br/><p>“Heh…”</p><br/><p>“What are you laughing at?” You XiaoMo raised his head, looking at him in frustrated embarrassment.</p><br/><p>The corner of Ling Xiao’s lips curled upwards bewitchingly as he stroked You XiaoMo’s face with a hand. “My dear wife, you’re as pure as ever, even after having done it so many times.”</p><br/><p>You XiaoMo flushed again, slapping his hand away. “Do you think everyone is shameless like you?” Then he quickly switched the topic. “You said we’d get to the Southern Continent in a day right? Then let’s get into our disguises now.”</p><br/><p>You XiaoMo sat up straight, taking out their disguises from his bag.</p><br/><p>Ling Xiao had used an ugly mask in the DaoXin Academy, but the Vermillion Blood Clan knew about that already, so they couldn’t use that anymore. The silver mask had been used at the Boundless Sea, but Yu WenNan and the middle aged man had seen it so they couldn’t use it either.</p><br/><p>So…</p><br/><p>“How about you use Lin Xiao’s face like you did at the TianXin Sect?” You XiaoMo suggested, looking at Ling Xiao’s face.</p><br/><p>“No,” Ling Xiao rejected it, “All I have to do is make some small adjustments to my original appearance. It’s not like I can only transform to Lin Xiao’s face.”</p><br/><p>“Then transform for me to see.”</p><br/><p>Ling Xiao raised a hand over his face and his appearance suddenly changed.</p><br/><p>Seeing this face that wasn’t much different from his original appearance, You XiaoMo made a sincere suggestion, “Can you make yourself a little more average?”</p><br/><p>Ling Xiao glanced at him and continued to change his appearance.</p><br/><p>You XiaoMo continued to speak, “Just a little more average…”</p><br/><p>Ling Xiao accepted the suggestion with an open mind. He changed his appearance again. Afterwards, he looked at You XiaoMo with an unfathomable look. “Am I good to go now?”</p><br/><p>The corner of You XiaoMo’s mouth twitched, “…You’re good.”</p><br/><p>Then it came to clothing. Since not many people would look at one’s attire, Ling Xiao wore what he originally did. However, in the future, he couldn’t just wear that white robe. He had to wear the set of black clothing occasionally as well. Of course, this was just a personal suggestion of You XiaoMo’s, but You XiaoMo wouldn’t tell him that.</p><br/><p>You XiaoMo then took out a ribbon he had found in his bag. “Tie this ribbon around your head. That way, it can change your demeanor.”</p><br/><p>Ling Xiao tied the band around his head skeptically. Pairing the dark purple ribbon with the black clothing added a hint of solemnity and coldness to his demeanor. If he showed less emotion, he’s definitely be one of those abstinent cool types.</p><br/><p>“So handsome!” You XiaoMo praised his own sense of style.</p><br/><p>Ling Xiao’s eyes narrowed. “Who are you calling handsome?”</p><br/><p>Alarm bells rang in his head as You XiaoMo saw the expression Ling Xiao wore and hurriedly added, “Of course it’s you! No matter what you’re like, you’ll always be the most handsome to me!”</p><br/><p>Ling Xiao was only satisfied then.</p><br/><p>You XiaoMo packed away the rest of his stuff.</p><br/><p>Ling Xiao asked, “Aren’t you doing to go into disguise?”</p><br/><p>You XiaoMo shook his head. “I don’t need to. After getting to the Southern Continent, I just need to get CatQiu to change my appearance. His cultivational level has improved quite a lot. Very few people will be able to see through his illusions.”</p><br/><p>Ling Xiao said, “After you learn Beast Transfiguration, you can turn him into a mask.”</p><br/><p>You XiaoMo immediately thought of the Beast Transfiguration Chant that could turn LanQiu into a pair of wings. It was unfortunately that he only knew one chant. “Where can I learn Beast Transfiguration?”</p><br/><p>Ling Xiao said, “I’ll give you a basic rundown of TongTian Continent first. Apart from Bei Dong, the Southern Continent, Xi Jing and Dong Zhou, there’s also a Zhong Tian. Zhong Tian is the only place in the TongTian Continent that doesn’t have a dividing line. There are three great powers there: the Mage’s Guild, the Beast Transfiguration Guild and the TongTian Palace. Amongst them, the TongTian Palace is the religion that presides over all of the powers in the TongTian Continent. Even the Four Ancient Beasts Clans can’t touch them.”</p><br/><p>T/n: here’s is the gist of the TongTian’s map through location name.</p><br/><p>Bei Dong (): Northern Movement</p><br/><p>NanLu(): Southern Continent</p><br/><p>Xi Jing(): Western Border</p><br/><p>Dong Zhou(): Eastern Continent/Island</p><br/><p>Zhong Tian(): Sky Center, in this case it’s mean that TongTian’s center.</p><br/><p>You XiaoMo blinked. “Religion?”</p><br/><p>Ling Xiao nodded. “That’s right, but the one I want to talk with you about is the Beast Transfiguration Guild. If you want to learn Beast Transfiguration, you can only go there. They have the most comprehensive collection of Beast Transfiguration in all of the TongTian Continent.”</p><br/><p>You XiaoMo sighed softly. Seems like this would have to wait.</p><br/><p>Ling Xiao ruffled his hair. “After rescuing Feng ChiYun, we can go to Zhong Tian to have a look.”</p><br/><p>You XiaoMo frowned. “It’ll probably be very hard to rescue Feng ChiYun, right?”</p><br/><p>They were completely clueless about the Vermillion Blood Family right now and didn’t know where Feng ChiYun was either. If they wanted to rescue him, they’d have to first figure out where he was being kept.</p><br/><p>Ling Xiao said, “If we go around asking about it, we might alert the Vermillion Blood Family to our actions. It’s not just us who want to rescue Feng ChiYun. Let’s regroup with Yin Ge and the others before planning this out.”</p><br/><p>Yin Ge was half of a Nine Headed Serpent King, and they were the leaders of all serpents with hundred of thousands of snakes under their command. They would have a much easier time gathering intel about the Vermillion Blood Family.</p><br/>\n</div>"}