{"title": "Chapter 428", "id": 428, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-428", "volume_title": "Volume 5", "body": "<h1>Chapter 428</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 428: Small Gambles Are Fun</p><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>When the employee came back to their room, with a smile and no sign of surprise, it was as if he expected them to call him.</p><br/><p>Once someone had worked there long enough, they would know that any customer who came to stay, whether the first time or not, will not be able to resist the temptation of the gambling house. Even if it wasn’t for gambling, they would want to check it out, so he had already expected You XiaoMo to call him again.</p><br/><p>You XiaoMo looked at the employee who had an expression of ‘just as I expected’ to the point that it was a bit annoying.</p><br/><p>You are an employee, you don’t need to use your brain, just an ‘able-bodied’ person is enough.</p><br/><p>Before they walked out the door, You XiaoMo stopped the employee, first slowly walking past him and then casually throwing out the words, “You know what? I could just call another employee to guide me.”</p><br/><p>Employee, “…”</p><br/><p>Under the guidance of the employee they arrived at the entrance of the underground gambling house. It was a four to five meter wide entrance with a staircase extending downwards and even had a red carpet laid on top, giving the appearance of high-end luxury. Bustling noises kept appearing from below and from the entrance one could briefly see the shadows of gamblers walking around.</p><br/><p>As the employee brought them down, he explained, “If the two guests want to play, you can exchange for chips. The smallest amount is one spirit gem and the largest being one million.”</p><br/><p>Standing on the last step, the employee pointed towards a huge counter to the right of the exit and told them that was the place to exchange for chips. It was similar to 21st century Earth, since if the amount was large, putting a huge pile of spirits gems would be unsightly. It might also attract unwanted attention.</p><br/><p>The employee simply brought them to the gambling house and after taking You XiaoMo’s one spirit gem, he left.</p><br/><p>Before he left though, he told them that if they wanted to play but didn’t know how, they could ask one of the attendants and they would help them learn the basics.</p><br/><p>You XiaoMo didn’t find one and instead went to the counter to exchange for five one spirit gem chips. He then looked excitedly at Ling Xiao, “Do you know how to play?”</p><br/><p>With a straight face he answered, “No.”</p><br/><p>You XiaoMo’s mouth twitched, and here he thought he would say he knew. Since the gambling house looked famous, he thought Ling Xiao would have been here before.</p><br/><p>After pondering for a while, You XiaoMo decided to exchange for fifteen more chips, giving ten to Ling Xiao.</p><br/><p>“Don’t worry, we can learn together.”</p><br/><p>With an unchanging expression Ling Xiao held onto the chips and said, “You would have to keep up with me then.”</p><br/><p>You XiaoMo paused for a few seconds before realizing what he had said. As ‘disabled’ person who was used to being ‘hurt’, his tolerance was getting better and better. He would even say outright that he had low IQ, not wavering a bit, at most he would just spit on him a little in his heart.</p><br/><p>Since the beginning of time, the most prevalent game in a gambling house was dice.</p><br/><p>The Shuang Yu gambling house was no exception, not only that, there was different kinds of dice. Not only were there a six-sided dice but also eight-sided dice, different dice also had different games. After taking a look around, You XiaoMo felt that the high-low dice game was the easiest, with a 50% chance of winning, but luck was very important too.</p><br/><p>“Then, how about we play this?” You XiaoMo said with excitement as he dragged Ling Xiao to a table and watched them gamble. It made him itch for a shot too.</p><br/><p>After taking a look, Ling Xiao stated with distaste, “What’s there to play with high and low?”</p><br/><p>You XiaoMo stared at him unhappily.</p><br/><p>At this moment, a teasing voice cut in, “Then you would be wrong, any kind of a gamble has its exhilarating nature and riskiness. Most people are here for those kind of feelings, even if its something like high-low dice game, there are still people who enjoy it.”</p><br/><p>The two turned at the same time to find a cleanly dressed middle-aged man. Seeing that they were looking his direction, he walked over. “The two of you, it’s your first time here at a gambling house, correct?” The middle-aged said with a smile.</p><br/><p>“So?” Ling Xiao asked back.</p><br/><p>The middle-aged man smiled coolly and said, “I simply saw that you were troubled by what to play so I couldn’t help but give a suggestion, that’s all. If the two of you are playing for the first time then I would recommend high-low, to get a hang of things first, before playing others.”</p><br/><p>You XiaoMo took another look at him and smiled hearing this, “Thank you for your suggestion, uncle.”</p><br/><p>The middle-aged man nodded and opened his mouth as if to speak.</p><br/><p>You XiaoMo quickly pulled Ling Xiao away to another table, as if he hadn’t noticed the middle-aged man wanting to say something.</p><br/><p>The middle-aged man, who had been rude, looked at their backs and curled his lip before leaving.</p><br/><p>“One who is unaccountably solicitous must be hiding evil intentions!” You XiaoMo muttered as he looked around.</p><br/><p>Ling Xiao twisted his head properly to face the six o’clock position before saying, “There, a table without many people.”</p><br/><p>Much to You XiaoMo’s surprise, that table was playing high-low, and had exactly two spots left. Without courtesy he quickly took a spot and that’s when the dealer had a glint in his eyes. Behind them, those who saw this all gloated over the others misfortune.</p><br/><p>For those first-timers, if they weren’t accompanied by a familiar face, they were most likely going to be tricked.</p><br/><p>The dealer shook the dice cup intensely before placing it back onto the table, “Please place your bets.”</p><br/><p>You XiaoMo asked Ling Xiao, “Should we bet high or low?”</p><br/><p>Ling Xiao casually looked at the bets placed by two others on the same table and answered, “Then, bet small.”</p><br/><p>You XiaoMo placed on chip on the word ‘small’.</p><br/><p>The dealer stared at the chip, mouth slightly twitching, before lifting up the cup to see the number. With excitement he said, “One, one, three, small. Congratulations, such a great opening, lets keep up the good luck.”</p><br/><p>After that he threw a chip back at You XiaoMo.</p><br/><p>Even though it wasn’t much, You XiaoMo still showed it triumphally to Ling Xiao.</p><br/><p>On the second round You XiaoMo still asked Ling Xiao about what to bet and Ling Xiao told him to continue betting small.</p><br/><p>You XiaoMo continued betting one chip, it was still small, he won another chip…then the third round, the fourth…until the tenth round he was still winning by betting on small. Even the dealer’s hands started to shake.</p><br/><p>You XiaoMo was still betting one chip, no matter if he won or not he never changed his mind. However, slowly the dealer was getting impatient.</p><br/><p>“Our honorable guest, if you are so lucky today, why not bet a little more? Aren’t you here for the exhilarating feeling? If you only bet one chip at a time, over time you would still get bored, no?”</p><br/><p>“Don’t they say that small wagers are good fun, but large ones are dangerous?” You XiaoMo looked up at him, blinked and continued, “Also, I don’t find it boring, in fact I find a quite fun…” …looking at your colorful expressions.</p><br/><p>The dealer was taken back, something seemed off.</p><br/><p>“From what I can see, aren’t you just a pitifully poor person with no spirit gems?” From the crowd appeared a mocking laugh. Once You XiaoMo turned around to check, he couldn’t find the person and the person seemed to have no intention of revealing themselves.</p><br/><p>You XiaoMo turned back to the dealer asking, “Are we continuing?”</p><br/><p>The dealer’s whole face twitched slightly.</p><br/><p>The voice sounded again, “Poor people should just be kicked out of the gambling house. So, disgusting to look at.”</p><br/><p>You XiaoMo rowed his eyes and muttered to himself, “Then that’s perfect, I’ll stay here just to disgust you.”</p><br/><p>“…”</p><br/><p>He didn’t on’t know if it was because they were left with no words, but there wasn’t any response. You XiaoMo continued to bet small, but this time he had ten chips. Looking up at the dealer, in a ‘fine-I’ll-play-along’ voice said, “Now it’s fine right?”</p><br/><p>The dealer, “…”</p><br/><p>Feeling heavily tricked, the dealer decided not to throw the long line to catch the fish and instead opened the dice cup with three, four, five, big, eating away the ten chips from You XiaoMo.</p><br/><p>“See, see, the moment I add more I lose. If it’s like this how dare I add more.” With a sign You XiaoMo said looking at Ling Xiao, “You were right, it’s too boring betting on high-low dices. I don’t want to play anymore, let’s go.”</p><br/><p>The two stood up, ready to leave and that was when five people appeared out the crowd, blocking them. None of them appeared friendly and their auras were not weak either.</p><br/><p>Behind them, the dealer walked over without the fake smile that was to trick You XiaoMo to bet more and instead it was replaced with a sinister smile. Looking at the fearful expression of the others, one could tell he was behind this.</p><br/><p>“Since you’re already here, then don’t leave.”</p><br/><p>Perplexed, You XiaoMo asked, “DaGe, we don’t have a grudge, do we?”</p><br/><p>Pleased, the dealer laughed, “We don’t have one, but you do with my brother. If you mess with him, you mess with me. Consider yourselves unlucky, you could’ve messed with anymore, but you choose my brother. Since he wanted me to get back at you, if you don’t leave something behind tonight, where would my face as Wu Cheng go? But you know, I was going to look for you, didn’t think you’d arrive right at my doorstep.”</p><br/><p>Automatically, You XiaoMo’s head flashed over a certain someone’s silhouette, if they had a grudge against someone, then it could only be that extremely petty youngster. Didn’t think he would be on brotherly terms with someone of the gambling house.</p><br/><p>“Ling, this person here is at peak seven-star Emperor level, what do we do? I’m not a match for him at all, we are so dead.” You XiaoMo said with apocalyptic expression as he ran behind Ling Xiao.</p><br/><p>Without any grace, Ling Xiao narrowed his eyes.</p><br/><p>Seeing his cowardly gesture, the crowd started laughing, with the hitters who blocked their way, laughing the hardest.</p><br/><p>Just as Cheng Wu was about to speak with a face of disdain, a sudden cry of pain sounded.</p><br/>\n</div>"}