{"title": "Chapter 429", "id": 429, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-429", "volume_title": "Volume 5", "body": "<h1>Chapter 429</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 429: Bury the Hatchet</p><br/><p>Translated by Rachel of Exiled Rebels Scanlations</p><br/><p>The sudden anguished screams shook everyone. They then saw five of Wu Cheng’s fighters falling to the ground with pale expressions on their faces. Each one of them grabbed their heads and slammed them to the ground as if they had all been triggered by something. Soon, a puddle of blood appeared.</p><br/><p>Wu Cheng was stunned. When he recovered, his eyes landed on You XiaoMo who was leaning on Ling Xiao’s shoulder and cast him a murderous look. Was there any panic on the latter’s face? Nope. Instead, his grinning face was exceptionally an eyesore.</p><br/><p>“You did it!”</p><br/><p>“I don’t know.” You XiaoMo shrank his head back.</p><br/><p>Of course, Wu Cheng didn’t buy his words. In fact, his expression seemed to show otherwise, being even more angered.</p><br/><p>“You guys have guts. I don’t care if you’re students of XiaoYao Institute. You dared to toy with me, so don’t even think of leaving here tonight.”</p><br/><p>You XiaoMo was very curious. Where did he get all that confidence from? He was but a mere seven star Imperial practitioner and he was more haughty than him!</p><br/><p>In a tone that expressed his laziness to speak more, Ling Xiao’s voice rang in his ears, “This place has two Emperor level powerhouses. They may most likely be the people he’s relying on.”</p><br/><p>You XiaoMo scanned the surrounding but he didn’t find anyone suspicious.</p><br/><p>“So what do we do now? Looks like he really wants to leave us. If we don’t knock him down now, he definitely won’t just let the matter rest. But his men are also in the casino. If they attack…”</p><br/><p>“Then we’ll just kill them.”</p><br/><p>You XiaoMo immediately shut up. What a good idea. As if! This casino looked like it had quite some background. If they killed them, there might even be people knocking on their doors for revenge that night. And not to forget, they were staying upstairs.</p><br/><p>“How about we…” You XiaoMo contemplated before speaking.</p><br/><p>Boom!</p><br/><p>The sound of a heavy object hitting the ground and overturned tables cut him off.</p><br/><p>When he turned to look again, one of the main people involved had collapsed into a heap. His face was pale and he had vomited blood, completing the look that said ‘I’m dying’.</p><br/><p>Two figures flew out from the corners and swiftly appeared before Wu Cheng. They hurriedly helped him up and when they saw his injuries, their expressions slightly changed. Their eyes turned a lot darker.</p><br/><p>Although young master Wu brought this trouble upon himself, attacking him without a second word clearly meant that they didn’t even acknowledge them.</p><br/><p>“How are you, young master Wu?” The old man frowned as he looked at Wu Cheng’s face which was alternating between green and white.</p><br/><p>Wu Cheng was already on the verge of exploding from anger. He had never in his life experienced such humiliation. His father was one of the ones in-charge of ShuangYu casino and while it looked like an ordinary casino on the surface, it was in fact a large force in Central City. For as long as he remembered spending his days of gallivanting around the city and doing as he pleased, this was the first time someone dared to treat him like that.</p><br/><p>“I want them dead! Rip their corpses apart with five horses! Never mind about XiaoYao Institute. They haven’t officially become their students so it wouldn’t be a problem if we kill them.” Wu Cheng’s rage had already reached an extreme, so much so that he managed to calm down a bit.</p><br/><p>Seeing as how thing had played out, the old man slightly sucked in a breath then he focused his attention in You XiaoMo and Ling Xiao. He couldn’t help his surprised expression. He could tell the youth was a level nine Mage but not the man. He couldn’t see through him.</p><br/><p>Another elder also took notice of this point. He originally intended to take him down but now he dared not act rashly. In retrospect, the man moved so quickly they didn’t even have time to react. It was safe to conclude that his power was above theirs.</p><br/><p>“What are you guys staring at? Do something now!” Wu Cheng didn’t understand what they were thinking. Seeing as they just stood there and did nothing, he got mad.</p><br/><p>“Young master Wu, it’s not that we don’t want to attack. That guy’s power level is above us. Even if the both of us joined hands we may not exactly win.” The elder laughed bitterly.</p><br/><p>They wanted to reach a compromise and settle things peacefully, but young master Wu had already said publicly that he wanted to avenge his buddy.</p><br/><p>Wu Cheng’s face flashed green and white. A powerhouse stronger than the two elders… he could only be a high level Emperor or a Divine level powerhouse. If it was the former, than it was still alright since the ShuangYu casino had Divine level powerhouses to take care of him. However, if it was the latter, then it would be troublesome. They couldn’t afford to offend him.</p><br/><p>As the son of the casino manager, Wu Cheng had seen all kinds of people. He might be bossy and domineering but he wasn’t blind. Had AnQiao not told him that there were only two people who weren’t that strong, he wouldn’t have messed with random powerhouses for his sake. Seeing as he received the wrong information, he couldn’t help but be miffed and blamed him.</p><br/><p>“This seems like a misunderstanding. How about we stop here, what do the two of you think?” The elder noticed young master Wu’s attitude had softened and he knew that Wu Cheng had already let today’s event go. This was the part he admired about Wu Cheng. He knew when to let go.</p><br/><p>The surrounding started to buzz with whispers. This was the first time they saw Wu Cheng get beaten and instead of retaliating he offered the olive branch.</p><br/><p>Sure enough, the fist was the way to go!</p><br/><p>Thinking that they would have a ‘vicious battle’, You XiaoMo didn’t expect it would end like that. He wasn’t an unreasonable person. If they could have one less enemy, the better. Furthermore, there wasn’t any animosity between him and Wu Cheng. It was pointless and not worth it to become enemies because of the other man.</p><br/><p>“Then so be it.” Just as they were about to leave, You XiaoMo suddenly took out a jade bottle with a snow-white magic pill and threw it to Wu Cheng. “This is for internal injuries.”</p><br/><p>Wu Cheng accepted it dazedly and when he saw the magic pill rolling around in the bottle, his expression became weird.</p><br/><p>In his daze, You XiaoMo and Ling Xiao had already left.</p><br/><p>“Young master Wu, this is a level nine Mortal pill?” The elder spoke in a slightly excited voice.</p><br/><p>Wu Cheng acknowledged with a complicated look on his face.</p><br/><p>The Mortal Pill was evolved from the Bone Growth Pill, the latter being a level six magic pill which allowed one to grow out new limbs. The Mortal Pill worked on the same basis but at a more advanced level. It could heal both internal and external injuries. As long as the head of the person wasn’t blown off, he could recover from any injury no matter how serious it was. It also didn’t have any effect on one’s power, and if the opportunity could even have a breakthrough.</p><br/><p>This was good stuff! Not every level nine Mage could refine it and it was extremely demanding on the Mage.</p><br/><p>“Young master Wu, judging the quality of this magic pill, it seems like a high grade magic pill. Looks like that person really wants to bury the hatchet and reconcile.” The other elder sighed as he said this.</p><br/><p>At his mention, Wu Cheng only realised that point. The price of a high grade magic pill was not something that a middle grade or low grade could compare. Saving this thing for future use would definitely be his life saving straw.</p><br/><p>“Young master Wu, this Mortal Pill…” The elder looked like he wanted to say something but paused when he looked at the magic pill in his hand.</p><br/><p>Wu Cheng immediately brought it close to himself and glared, “What? It’s mine.”</p><br/><p>The elder choked. Wu Cheng had a conflicted expression on his face and now it changed so quickly. However, judging from Wu Cheng’s expression that he saw, after this incident he probably wouldn’t offend that brat anymore.</p><br/><p>Although they lost one contact that allowed them to establish connections with the Mage Guild, they couldn’t let that brat who was up to no good lead their young master astray. Their young master was still good in nature.</p><br/><p>The two elders exchanged looks with one another. They didn’t think they could benefit from their misfortunes. Maybe the youth You XiaoHa was really young master Wu’s lucky star, who knew.</p><br/><p>While they were feeling all sentimental, You XiaoMo was secretly laughing.</p><br/><p>He purposely gave him the Mortal Pill because he could tell that a person who was willing to immediately stand up for his bullied buddy probably wasn’t a heinous person. Furthermore, even though he came across as furious throughout the confrontation, there were still traces of reasonable thought in his eyes.</p><br/><p>This kind of person definitely wasn’t the idiot AnQiao was, so he used the magic pill to rattle his state of mind. The next time they met, he probably wouldn’t treat them with any hostility.</p><br/><p>And last but not least was AnQiao. If he discovered his best friend actually thought well of them, how would he be feeling?</p><br/><p>Ling Xiao found You XiaoMo laughing stupidly from time to time and he knew he was itching to get teased. He quickened his pace to return to their room and threw You XiaoMo on the bed.</p><br/><p>You XiaoMo rolled toward the inner side of the bed and climbed back up.</p><br/><p>“What are you do…” He raised his head to ask, only to see Ling Xiao stripping his clothes off. He then quickly crawled back to the inner side of the bed.</p><br/><p>While he didn’t finish his sentence, Ling Xiao still raised his eyes to look at him with his eyes dark.</p><br/><p>You XiaoMo understood the painful message behind that look that made his balls hurt— I want to sleep with you! That’s why knowing the other party too well wasn’t always a good thing. He honestly didn’t know which fragile nerve he hit. Please tell me, I’ll change alright?</p><br/><p>A shirtless Ling Xiao walked over towards him and dragged him out by the foot. He had You XiaoMo pressed under him and just as he was about to protest, Ling Xiao held his chin slightly forcefully in his hand and sealed his lips.</p><br/><p>The soft and tender You XiaoMo wanted to protest that it hurt.</p><br/><p>He could only moan into the kiss as he felt his body was touched all over. A pair of pervy hands roamed across his body and tore his clothes open, easily making him more naked than Ling Xiao. Before he could even react, both his legs were lifted onto Ling Xiao’s shoulders. Without even doing foreplay, You XiaoMo could feel his lower half being stretched open as a hot, stiff cock buried itself completely in him. You XiaoMo fumed and he kept slapping Ling Xiao’s shoulder. It was going to be the death of him!</p><br/><p>And so, the bed started to creak as it rocked… composing a melody that mourned for that person on the bed.</p><br/>\n</div>"}