{"title": "Chapter 426", "id": 426, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-426", "volume_title": "Volume 5", "body": "<h1>Chapter 426</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 426: Polished Skeleton</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Time passed second by second and in the blink of an eye, one hour had gone by.</p><br/><p>You XiaoMo sensed the information sent back by his brain and finally became aware of how big a mistake he had made. This assessment was testing his soul force. He was actually so stupid as to use his hand to manipulate it.</p><br/><p>The skeleton was not an actual human remain, so there were two rows of connection points in the shape of five small holes on the top of every cross section of the bone. Before, when Elder Qing said that one would have to use their soul force to assemble the skeleton in order to win, he was probably referring to these connection points.</p><br/><p>This could be considered as a technical matter.</p><br/><p>You XiaoMo picked up two bones and tested it out. The connection points were extremely small and the bones were also somewhat fragile, so he needed to control his soul force well. He tried to connect the two holes together, but failed, as the link of the two bones he had connected together broke apart when he released it. Those threads of soul force holding them together also subsequently dissipated.</p><br/><p>Could it be that he had to connect the three small holes on top simultaneously?</p><br/><p>You XiaoMo divided his soul force into three slender threads and very carefully threaded them into the bone. Then, he connected the three small holes on top at the same time. When he pulled out his soul force and released his hand, the two pieces of bones were indeed securely connected together.</p><br/><p>You XiaoMo sighed in relief. It turned out that it was so easy after finding for the correct method.</p><br/><p>You XiaoMo unscrupulously smiled. This sort of multi-purpose method to control the soul force was his expertise and there was completely no difficulty for him at all. It was just that he needed to be a little more careful when controlling his soul force, otherwise the bone would break.</p><br/><p>The him who was just plain happy was not aware that some people had already broken several of their bones. If it was not for the fact that they only needed to complete seventy percent of the skeleton to pass, they would already have been eliminated at this moment.</p><br/><p>Outside, the time was nearly up but there was still not a single person who came out.</p><br/><p>Tan Ze was somewhat surprised. He had thought that these few people, Jiu Ye and Qiao WuXing, would be out first. Just as he was thinking about this, the doors of one of the rooms suddenly opened inwards.</p><br/><p>You XiaoMo walked out from the room. As he had been busy for two consecutive hours, he could not help but stretch his body. Then he subconsciously looked for Ling Xiao’s silhouette, but discovered that Tan Ze was looking at him and the others were still not out.</p><br/><p>Tan Ze immediately walked over, “Fellow You, what about your skeleton?”</p><br/><p>You XiaoMo reacted by letting out a mischievous laughter, “Sorry, sorry, I forgot to bring it out.” With that, he returned to the room and carried out that skeleton that had already been completely assembled.</p><br/><p>“Look, this is my work, how is it?”</p><br/><p>Tan Ze looked at the skeleton in front of him in amazement. Though it had not been examined, this skeleton looked perfect to the naked eye and was akin to a person who had not been dismantled posthumously. The other examinees walked out one after another just as Tan Ze was about to exclaim in admiration.</p><br/><p>Jiu Ye and Qiao WuXing were neighbors to You XiaoMo. The former came out before the latter and both looked at You XiaoMo in slight startlement. Their line of slight shifted to the skeleton in his hand and a trace of astonishment flashed through their eyes. They had also brought out the skeleton that they had just assembled. It was only that the surface of their skeleton was not as clean and shining as You XiaoMo’s.</p><br/><p>That’s right, besides You XiaoMo’s skeleton being complete, the surface of it looked as if it had been polished and was shining brilliantly. This feeling was even more evident when all the skeletons of the examinees were lined-up together.</p><br/><p>Tan Ze wiped his sweat away and did not know whether to laugh or cry as he looked at You XiaoMo who was laughing a little sillily. After hesitating a while, he asked, “Fellow You, why does your skeleton look like that?”</p><br/><p>You XiaoMo touched his nose and laughed, “It was still early after I’d finished assembling it, and I was bored… …” Everyone was suddenly dumbfounded.</p><br/><p>Seeing Tan Ze’s strange expression, You XiaoMo nervously asked, “What happened? Could it be that I broke the rules?”</p><br/><p>The corners of Tan Ze’s mouth twitched, “No, the assessment has no rules that state that the skeleton cannot be polished.” You XiaoMo sighed in relief.</p><br/><p>Elder Qing soon begin his through audit of everyone’s skeleton. You XiaoMo was certain to pass. This guy was so free that he even had the time to do such things like polish his skeleton.</p><br/><p>Other than An Qiao who had already been eliminated, the reminding nine people all passed. The maiden in pink, Tian Xin, was one step away from danger. She broke almost thirty percent of the bones she had when assembling her skeleton. In the end, she blindly guessed and staked her all to piece together a skeleton that was missing one leg and one arm. Out of the nine people, only You XiaoMo and Jiu Ye assembled a complete skeleton. If the exterior appearance of the skeleton was scored, You XiaoMo would clearly be the winner. As for Qiao WuXing, he also had the chance to assemble a complete skeleton too, but he accidently stepped on a finger bone and crushed it during the assessment.</p><br/><p>“The skeleton that you’ve assembled looks really good.” Yan Hui leaned over and was looking at You XiaoMo’s skeleton in surprise. It did not resemble theirs, which were missing a piece of the leg or hand and simply looked just like a disabled person.</p><br/><p>“It’s okay.” You XiaoMo gave a dry laugh. He already regretted it. If he had known earlier, he would have come out early. Then he wouldn’t have been surrounded and watched like a rare animal by others and he even made Ling Xiao wait for so long.</p><br/><p>“You’re too modest.” Yan Hui smiled as he strongly clapped his shoulder.</p><br/><p>You XiaoMo staggered. This strength of the hand was really big.</p><br/><p>The assessment officially ended here. You XiaoMo declined the other’s invitations and directly left the XiaoYao Institute together with Ling Xiao. However, they did not return to their hotel. Instead they walked to a sparsely populated area and released LanQiu and the chick when no one was noticing. For this period of time, they were busy with the assessment and hurrying on their journey, so they did not have the time to arrange for LanQiu’s and the chick’s matters. After the assessment ended, they finally had the leisure time and decided to handle this matter.</p><br/><p>You XiaoMo took out a spare magic bag and put in enough spirit gems to cover the travel and living expenses before handing it over to LanQiu. At the same time he told him, “Remember to come back as soon as possible. If your relatives don’t want you guys, you guys can come back to me at any time. I won’t abandon you.”</p><br/><p>Black lines filled LanQiu’s face, I don’t mind if you abandon me.</p><br/><p>The chick chirped twice, but what it wanted to convey was not known.</p><br/><p>You XiaoMo stated clearly, I don’t understand Bird, please speak Human.</p><br/><p>Ling Xiao instructed, “Pass over some major news regarding Xi Jing every month after you reach your destination. In addition, pay more attention to news about the Four Divine Emperors, especially news about the Qilin Clan.”</p><br/><p>LanQiu, “Yes!”</p><br/><p>Ling Xiao turned to the chick again, “After you enter the Demon Phoenix Clan, do your utmost to ask around for inside information of the clan. The more secretive the better.”</p><br/><p>The chick dashed to him and called out, “Chirp!”</p><br/><p>You XiaoMo’s eyes brightened upon hearing this, “Ling Xiao, didn’t you say that your mum was imprisoned in the restricted area of the Demon Phoenix Clan? You can get the chick to help you make some inquiries.”</p><br/><p>Ling Xiao replied, “This is my intention. But there it’s likely that nothing can be done in such a short while. There’s nothing that those who just become a member of the Demon Phoenix Clan can do to immediately access the internal core and secrets.”</p><br/><p>The chick, “Chirp, chirp!” I will try to enter the internal core as soon as possible and become Boss’s most faithful mole.</p><br/><p>Ling Xiao calmly replied, “Very good!”</p><br/><p>The chick excitedly flapped its wings several times. This was the first time that Boss used an approving tone to speak to him.</p><br/><p>You XiaoMo looked at the interaction between the big and small beast and had a choked and speechless feeling. What is going on with this kind of profoundly happy feeling? Chick, you’re returning to the Demon Phoenix Clan not for the purpose of becoming a mole or spy, don’t look so excited.</p><br/><p>Before long, the chick that had been immersed in the pleasure of preparing to be a mole was grabbed and stuffed into LanQiu’s clothes and brought away. Although its feathers had not grown in and it looked just like a chicken with a skull and wings that were as bare as before, it was hard to guarantee that it would not be recognized by someone as most of the people in Zhong Tian were more knowledgeable.</p><br/><p>You XiaoMo and Ling Xiao wandered down the street. After quite a couple of busy days, this bit of quiet was a rare treat.</p><br/><p>You XiaoMo walked beside Ling Xiao. The corner of his mouth lifted in a delighted smile and his steps were lively.</p><br/><p>You XiaoMo’s steps stopped just as they passed a magic herb store. He pulled on Ling Xiao’s arm and backtracked to the entrance of the magic herb shop.</p><br/><p>Since Zhong Tian was the territory of the Mage Guild and Beast Transfiguration Guild, there ought to be many rare magic herbs or seeds inside.</p><br/><p>“Let’s go in to take a look.”</p><br/><p>Ling Xiao allowed You XiaoMo to pull him inside as he lazily glanced at the expansive interior of the magic herb store. Jade cabinets of all sizes displayed various kinds of magic herbs and seeds. Low-grade magic herbs were rare, on the contrary, middle-grade and high-grade herbs were more common seen.</p><br/><p>You XiaoMo was full of interest as he walked a full circle around the store. Sure enough, it was as he had expected. Within moments, he could see many seeds which he did not have in his dimension. As for magic herbs, every stalk of high-grade magic herb was particular expensive and they even had herbs costing tens of thousands and hundreds of thousands spirit gems.</p><br/><p>When they came out again, You XiaoMo’s waist purse lost weight yet again. He did not buy magic herbs. Instead he bought a pile of magic herb seeds, but the price for these seeds was not cheap.</p><br/><p>The most unexpected surprise was that, there were actually level eleven and twelve seeds sold in the inner section though there were not many. It was rumored that the seeds had been displayed in the inner section since a long time ago. The prices of the seeds were also expensive, so there had always been a lack of interest. Two days ago, the shopkeeper cut the price by half, so You XiaoMo bought the seeds without demur.</p><br/><p>Ling Xiao, who had been walking at a steady pace, stopped after a while.</p><br/><p>You XiaoMo followed his line of sight and looked over and discovered that he was looking at a magic pill store called Elixir.</p><br/><p>One look at this name and it was easy to tell that the store owner was daydreaming. Did he really believe that he was selling elixirs just by hanging a shop sign with ‘Elixir’ written on it? But there were really not many customers inside.</p><br/><p>“What is it?” You XiaoMo curiously asked.</p><br/><p>“Let’s go in for a look.”</p><br/>\n</div>"}