{"title": "Chapter 438", "id": 438, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-438", "volume_title": "Volume 5", "body": "<h1>Chapter 438</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 438: The Backwards Dong Zhou</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>With You XiaoMo this ‘cautionary tale’, Qiao WuXing and Jiu Ye’s matches were smooth to the extreme. However, You XiaoMo did not go as their matches were in the afternoon, so he had missed it.</p><br/><p>After the matches ended, You XiaoMo ran to the thirty-fifth floor to confirm his opponent for the third round and then he returned to the first floor with Ling Xiao. He did not need to worry that what had happened today would occur again now. It could not be helped but be said that luck could also shock the hearts of men and he believed that the people on the sixtieth floor would probably not be like Zhu Hong and play the same trick.</p><br/><p>In a crude and simple small room on the first floor.</p><br/><p>You XiaoMo was fussing over the magic herbs that Ling Xiao had washed yesterday.</p><br/><p>To be frank, it was washed clean. But in actual fact, he had just thrown the magic herbs into a bucket of water to let the soil automatically drop off, and then he just fished it up and placed it down and considered the job to be done.</p><br/><p>How clean could it be in the end? More or less, there was still a bit of soil left on the roots of the magic herbs. One needed to personally wash them off. Laziness of this extent really incurred the hatred of both God and man.</p><br/><p>You XiaoMo washed the magic herbs while complaining about a certain person.</p><br/><p>You XiaoMo originally intended to stay in his room all day as there were no matches on the second day. It just happened that he could use this time to tidy up the pile of magic herbs that he had dug out yesterday. He had to do it all over again because of Ling Xiao’s irresponsibleness.</p><br/><p>As for Ling Xiao, he left the XiaoYao Institution as he said that he had something to do.</p><br/><p>The XiaoYao Institution was not a faculty where entry was on lock-down. No matter whether there were matches or in normal times, one was able to enter and exit as one pleased as long as they had the mage emblem.</p><br/><p>Yan Hui dragged him out of his room after knowing that he was alone and said that he wanted to bring him to take a look at the sixtieth floor. Since it would not be long before they would enter the sixtieth floor, Yan Hui wanted to familiarize himself with it first.</p><br/><p>You XiaoMo had already been dragged out of his room while he was pondering on how high the odds of being able to successfully reject this invitation were. The rest of their year mates had gone their separate ways and only the uncle was coming together with them.</p><br/><p>“It’s just a place to stay, what’s there to see about it?” You XiaoMo helplessly injected.</p><br/><p>“Of course it’s different.” Yan Hui looked back, “I’ve heard that the rooms on the sixtieth are very big and beautiful, and there are two rooms – a bedroom and a living room. The bed is so big that three people would not even it disdain for being squeezy. Furthermore, I think that Tian Xin had mentioned that every floor would have a good thing on it.”</p><br/><p>You XiaoMo replied, “Even if there’s a good thing, we are currently not residents of the sixtieth floor. We still wouldn’t be able to see it even if we go ba.”</p><br/><p>“Could it be that you’ve forgot the incident with the Time Wall?” Yan Hui looked at him incredulously with an exaggerated expression.</p><br/><p>You XiaoMo paused for a moment, he had really forgotten about it.</p><br/><p>Yan Hui knew that he had guessed it correctly with a single look at his face and sighed, “The Time Wall is on the sixtieth floor. You can go to the Time Wall at any time as you got the Rainbowed Pill during the assessment.”</p><br/><p>“So you guys are preparing to bring me to the Time Wall now?”</p><br/><p>“We also want to know how the Time Wall looks like ma. It’s just as well since you also don’t know what it looks like, so…”</p><br/><p>So they dragged him over with them for a look.</p><br/><p>You XiaoMo had even thought that they really wanted to bring him out for a stroll around.</p><br/><p>Cheng XiangRong, who was at the side, very carefully eyed him, “Are you angry?”</p><br/><p>You XiaoMo, “No.” Uncle, don’t be so sensitive, these kind of matter is not worth being angry over. However, he had always been quite curious about what kind of place could produce such a character like uncle. Since he was thinking about this, he just asked, “Uncle, where are you from?”</p><br/><p>Cheng XiangRong did not expect that he would ask about this and was startled, “I come from Dong Zhou.”</p><br/><p>You XiaoMo raised his eyebrow in surprise, “Such a coincidence, Yan Hui is also from Dong Zhou.”</p><br/><p>Dong Zhou was a region in the Tong Tian Continent which had yet to be civilized. The people that resided in Dong Zhou were the Tong Tian Continent’s original inhabitants who had a very long history. They were considered to be a group blessed by the heavens, but they clung very strongly to their ideologies and with more and more people coming from other realms, it developed to the indigenous citizens migrating to Dong Zhou in the end. Thus, it was labeled as ‘uncivilized’.</p><br/><p>Yet, many experts had emerged from Dong Zhou even though their ideologies were different. For example, two people of the Ten Gods of the Tong Tian Rankings were from Dong Zhou.</p><br/><p>Cheng XiangRong brightened upon hearing that Yan Hui was also from Dong Zhou. He excitedly clasped Yan Hui’s hand, “Fellow townsman, I never thought that I would actually see another person like me who also came from Dong Zhou. I’m so happy.”</p><br/><p>Yan Hui was embarrassed and was a little uncomfortable with his staring, “Ah yes, I also did not expect this. It’s such a surprise.”</p><br/><p>“I’m from the Shuixi Tribe in Dong Zhou, how about you?” Cheng XiangRong met his fellow townsman and became a chatterbox. His entire person became much livelier.</p><br/><p>“Eh, I’m from the Guma Tribe.”</p><br/><p>Probably because Cheng XiangRong was too enthusiastic, Yan Hui was stunned into silence instead.</p><br/><p>Cheng XiangRong happily gushed, “The Guma Tribe is Dong Zhu’s most powerful tribe. I know that several brilliant and famous experts on the Tong Tian Rankings are from the Guma Tribe. Yan Hui, you will certainly be very strong later.”</p><br/><p>Yan Hui scratched his head and drily laughed, “I hope so.”</p><br/><p>“But this is really great. I didn’t expect that there would also be two mages with rainbow souls emerging from Dong Zhou at once. This had never happened in the past.” Cheng XiangRong suddenly sighed again.</p><br/><p>“What do you mean by that?” You XiaoMo, who was at the side, finally spoke. Though he had not been to Dong Zhou, he could image that Dong Zhou should be an extremely vast region. With such a long history, it ought to be unlikely that they would not even have one mage with a rainbow soul.</p><br/><p>Cheng XiangRong explained, “It’s because the mages in Dong Zhou are very rare. Majority of the physiques of our tribe members and other tribes are only suited for cultivation, and there are almost none who are suited for refining pills. Taking the Shuixi Tribe as an example, mages practically take up less than one in ten thousand and not all who are suitable for refining pills are able to become high level mages, leading to our tribe to be relatively backwards and weak.”</p><br/><p>You XiaoMo nodded even though he did not really understand and looked at Yan Hui, “Then Guma Tribe is also facing this type of situation?”</p><br/><p>Yan Hui paused for a moment before he said, “Not quite so, the situation in Guma Tribe is a little better than the Shuixi Tribe’s.”</p><br/><p>“Because there are more experts?”</p><br/><p>“This is only one of the reasons.” Cheng XiangRong continued, “The reason why Shuixi Tribe would fall behind actually has some relations to ideologies. You may not know much about the history of the Tong Tian Continent. Many tribes in Dong Zhou actually look down on the people who came from other realms, so they rarely have dealings with outsiders. But Guma Tribe was different. Although they did not have a lot of mages like us, they were willing to have dealings with outsiders.”</p><br/><p>You XiaoMo understood it now. It was because they were resting complacently on their laurels. This type of situation was a little similar to the Qing Dynasty’s circumstances. The Qing Dynasty was unwilling to keep up with the times and always abided by the same old practices. In the end, others progressed while and they regressed.t/n: Qing dynasty is the last imperial dynasty of China, ruling from 1944 to 1912.</p><br/><p>Cheng XiangRong admitted, “I came here because I’ve always wanted to change this sort of situation. I originally thought that only I would have this sort of thinking, never did I think that Yan Hui was also the same as me. Don’t you think it’s really great?”</p><br/><p>Yan Hui who had been arbitrarily defined could only give a hollow laugh. He really could not bear that bright and fervent expression that Cheng XiangRong was directing at him.</p><br/><p>You XiaoMo, “In that case, do your best. I’m sure that you’ll be able to accomplish your dream one day.”</p><br/><p>Cheng XiangRong happily nodded. He had a very favorable impression of You XiaoMo and hearing You XiaoMo’s encouragement made him even happier. It was really good that he had friends to share in this joyous feeling!</p><br/><p>When they had finished talking, the three had already walked to the sixtieth floor.</p><br/><p>Comparing the floors based on hygiene, the first floor was the territory of a group of chickens while the sixtieth floor was like a three star hotel.</p><br/><p>It was really quite good though it was not as exaggerated as what Yan Hui had said.</p><br/><p>“It is said that the Time Wall in on the Southwest side of the sixtieth floor, which is also where the teachers and elders live in. I’ve asked around about it yesterday. I’ll bring you guys over.” Yan Hui finished speaking and started walking in front of them to lead the way again.</p><br/><p>They had finally reached their destination after walking for about half an hour.</p><br/><p>The area that the teachers and elders were living in was the same as the sixtieth floor, being neither extravagant nor simple. It was only that both inside and out were imbued with a strict ambience.</p><br/><p>A teacher saw them and coldly instruced, “This is not a place where you guys can enter.”</p><br/><p>Yan Hui immediately smiled apologetically, “Teacher, we’re here to look for the Time Wall.”</p><br/><p>The teacher frowned, “The Time Wall is not open to unauthorized personnel.”</p><br/><p>“Oh no,” Yan Hui pointed at You XiaoMo and explained, “We are this year’s new students, he is called You XiaoHa.”</p><br/><p>The teacher’s gaze fell onto You XiaoMo. The alienation in his eyes changed to a measuring gaze. He had indeed heard of this name previously. The top brass had already informed them that You XiaoHa was this year’s lucky person before they had become students of XiaoYao Institution. He glanced at You XiaoMo, “You’ll come with me. The other two will wait here.”</p><br/><p>Yan Hui had originally wanted to follow, so he was promptly disappointed when he heard this.</p><br/><p>Cheng XiangRong said, “XiaoHa, we will wait for you here.”</p><br/><p>You XiaoMo’s figure lightly swayed for a moment. Be calm, you’ve already said that you want to acknowledge this name. Even if someone intimately calls you HaHa, you also have to accept it. He nodded at the two and followed after the teacher.</p><br/><p>After five minutes, they stopped in front of a pagoda-shaped building.</p><br/><p>The pagoda appeared to be about twenty meters tall, but the specific height could not be determined as the golden pagoda directly penetrated through the ceiling. It was golden-bright and dazzling, and was just like the pagoda held in the hand of the pagoda bearing god, Li Jing.</p><br/><p>The teacher pointed at the pagoda and said to him, “The Time Wall is inside, you can go in.”</p><br/><p>t/n: Li Jing, also known as Pagoda-Bearing Heavenly King Li is a figure in Chinese mythology and a god in Chinese folk religion. He carries a small pagoda that can capture any spirit, demon or god within its walls.</p><br/>\n</div>"}