{"title": "Chapter 442", "id": 442, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-442", "volume_title": "Volume 5", "body": "<h1>Chapter 442</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 442: You XiaoMo Comes Clean</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Ling Xiao walked to the only bed in the room that had seating space. Seeing You XiaoMo walking up and down excitedly, he said, “Just what did you encounter in the Time Wall?”</p><br/><p>You XiaoMo immediately rushed to him as if he had been waiting for him to say this, “I saw a lot of sculptures and cultivation soul and skill training manuals in the tower. However, I didn’t have the time to look at those stuff. Oh yes, on the seventh level there was a very strange sculpture. There were three words written on top of the sculpture – Tong Tian Emperor. Is this person from the Tong Tian Palace?”</p><br/><p>Tong Tian Emperor?</p><br/><p>Ling Xiao leaned back against the wall with one leg bent, “I’ve heard of this person before.”</p><br/><p>You XiaoMo nodded and hinted at him to continue talking.</p><br/><p>“Didn’t Qiao WuShuang say this before? One only had to have faith in the Tong Tian Palace to become a student of the XiaoYao Institution. Actually, the one they’re truly worshipping is the incumbent Tong Tian Emperor, a legendary figure in the Tong Tian Continent. A hundred thousand years ago, it was rumored that he was the only one whose strength was approaching the peak of the Sacred Realm and was anticipated to break through the shackles of the Sacred Realm. But his situation is not known now.”</p><br/><p>“How is this related to faith?”</p><br/><p>“Of course it is related, although the Tong Tian Continent is a Higher Level Realm, only one person has broken past the Sacred Realm from ancient times till now. That person is the Tong Tian Palace’s first Master.”</p><br/><p>“To think that there’s actually only one person. Why is that?”</p><br/><p>“If I say that the Divine Realm is separated from the Sacred Realm by a small river, then the difficulty of breaking through the Sacred Realm is like a vast sea. Do you think it’s hard or not?”</p><br/><p>You XiaoMo sucked in a breath. This metaphor was too exaggerated. No wonder there was only one person throughout the ages, but… “You still haven’t said what in the world it has to do with faith.”</p><br/><p>Ling Xiao looked at him and sighed, “Do you know what the first Tong Tian Emperor depended on to break through the Sacred Realm?”</p><br/><p>You XiaoMo painstakingly ignored the meaning conveyed by the expression in his eyes and mulled over it, “Don’t tell me that it’s related to faith?”</p><br/><p>Ling Xiao nodded, “I only know that faith was related to how the first Tong Tian Emperor broke through the Sacred Realm. However, I’m not too clear on how they utilized the faith. It is said that the usage of this faith is one that the Tong Tian Emperor researched himself. So this incumbent Tong Tian Emperor is only just continuing on the beaten track of the first Emperor. Otherwise, why do you think that the Tong Tian Palace would be so kind as to establish the XiaoYao Institution? It’s not as if they are so bored that their asses hurt.”</p><br/><p>“But, if faith can help the Sacred Realm practitioners break through, then why are there no activity from the other powers?” You XiaoMo felt that this faith was not very reliable.</p><br/><p>“It’s because only the Tong Tian Emperor knows how to use this faith. Did you think that he would declare this to the world and reveal that method? Furthermore, everyone has their own destiny. Just by using other people’s method for your cultivation doesn’t mean it will succeed.”</p><br/><p>You XiaoMo heard this and repeatedly nodded, “I understand now. You are also using your own method by collecting the five Elemental Essences. But since this method is passed down within the clan, why didn’t any experts above the Sacred Realm appear in the Qilin Clan?”</p><br/><p>Ling Xiao snorted, “Though the Qilin Clan receives the blessings of Heaven, but being too powerful will cause an imbalance in the heaven and earth. Thus, their progress of advancement is much more difficult than human practitioners. According to my inherited memory, the difficulty is at least several times harder than the human practitioners’ advancement even though there is no definite data.”</p><br/><p>You XiaoMo’s jaw dropped in surprise. After quite a while he continued, “Then, there’s still a chance for you to fail even if you’ve collected the five Elemental Essences?”</p><br/><p>“Of course, the greatest destiny is required if you want to succeed in one try.” Ling Xiao paused for a moment before he continued, “However, this kind of thing is really best done in one try, as the difficulty would increase with every failure.”</p><br/><p>You XiaoMo thought over it, “Wouldn’t the five Elemental Essences be gone if you fail?”</p><br/><p>Ling Xiao dropped down to lie on the stone bed and lazily said, “Naturally. So, since we have to do it, we have to pass in one try.”</p><br/><p>You XiaoMo immediately started worrying. Although Ling Xiao still had some time before he reached the peak of the Sacred Realm, You XiaoMo was already so worried that he was running around in circles at his original place, “What should we do? Do you have anything that can use my help?”</p><br/><p>Ling Xiao lifted his eyelid upon hearing this, “Speaking of which, there is something I could use your help with. But you can’t do it right now with your current strength. I’ve told you about it before.”</p><br/><p>You XiaoMo paused for a moment, “Does it have something to do with level eleven or twelve magic pills?”</p><br/><p>Ling Xiao propped his body up at once and looked at him with bright eyes that were full of expression, “If you can refine a seven-colored pill, coupled with the five Elemental Essences, the probability of success would improve greatly.”</p><br/><p>The seven-colored pill was a pill with the highest grade amongst all the colored pills. They were categorized from level one to seven and their distinguishing feature was the veined lines on the surface of the magic pill. The surface of the seven-colored pill needed to have seven colors of veined lines refined on it before it could be regarded as a success.</p><br/><p>Ling Xiao did not clearly explain to him before, as he was afraid that You XiaoMo would be pressured.</p><br/><p>It was written in the ancient records that there had once been a mage who also had a rainbowed soul like You XiaoMo in ancient times. But that mage had never once refined a seven-colored pill in his lifetime. Not only that, even his probability of success for refining a six-colored pill was less than one percent.</p><br/><p>From this, once could see how difficult it was to refine a seven-colored pill.</p><br/><p>Actually, this was the main reason why the First Master of the Tong Tian Palace took an alternative route. Rather than waiting an eternity for the seven-colored pill which may or may not be refined, it would be better to take another road.</p><br/><p>However…</p><br/><p>A trace a light flashed through Ling Xiao’s eyes. It was fine since there had not been any hope and expectations before, but now there was. It was hard to guarantee that other people would not harbor some other thoughts, so it was best for him to prepare for this eventuality in advance.</p><br/><p>You XiaoMo patted his chest and declared, “Leave this matter to me. I’ll definitely refine a seven-colored pill.”</p><br/><p>Ling Xiao pulled him into his embrace. He really liked this one-track minded confidence of his. If others had heard about this matter, they would probably be overcautious and indecisive by worrying about this and that. Every time You XiaoMo ran into a difficult situation, he was the only one whose words were equal to drinking plain water.</p><br/><p>T/n: Basically momo said so casually n confidently as if the matter is as easy as drinking water.</p><br/><p>“Then you’ll have to work hard, my future will be in your hands.”</p><br/><p>“Huh, to think one day you would be like this.”</p><br/><p>Ling Xiao suddenly patted his head, “What did you say?”</p><br/><p>You XiaoMo remained unflinching, “Nothing.”</p><br/><p>“Okay, the topic has dragged on for long enough. Shouldn’t you be telling me what you experienced inside the Time Wall now?” The atmosphere in the room was peaceful for a few seconds before Ling Xiao suddenly opened his mouth again.</p><br/><p>You XiaoMo’s body stiffened as he subconsciously thought of the dream he had of You Bo.</p><br/><p>Ling Xiao discovered this and narrowed his eyes, “Either you come clean of your own will and face leniency.”</p><br/><p>You XiaoMo calculated the odds in his heart for a moment. Other than not having told Ling Xiao that the core of his body had changed, he already did not have any more secrets. Though he had been concealing it from the beginning, but he felt that Ling Xiao would know about it sooner or later. Thus, rather than letting Ling Xiao double his ‘reparations’ in the future, perhaps it may be better for him to willingly come clean now?</p><br/><p>“Have you thought well on your wording yet?”</p><br/><p>You XiaoMo raised his head and drew near to his side as gently and cautiously probed, “Do you guarantee that you won’t be angry after I say it?”</p><br/><p>“Okay.” Ling Xiao agreed at lightning speed. He did not even have a second of hesitation in between.</p><br/><p>You XiaoMo paused for a second, “You’re agreeing too fast ba.”</p><br/><p>Ling Xiao fell silent for two seconds, “ …Okay.”</p><br/><p>You XiaoMo, “…”</p><br/><p>You XiaoMo decided not to quibble with him. If he quibbled too much, the one who would suffer losses would be still himself in the end. After boosting his own morale, he then explained, “Actually, this body is not mine. I was also originally called You XiaoMo. However, I am a person from a different time and space. Later, I accidentally died and my soul resurrected in this body.”</p><br/><p>When he finished speaking, he apprehensively looked at Ling Xiao.</p><br/><p>Ling Xiao was silent for a few seconds, “How did you die?”</p><br/><p>You XiaoMo stared blankly. This focus was rather out of left field.</p><br/><p>“How did you die?” Ling Xiao repeated it again.</p><br/><p>“I was implicated by my neighbor and killed in an explosion.”</p><br/><p>“Then your death was really an injustice.”</p><br/><p>“Precisely ah…”</p><br/><p>“If this matter is true, the resurrection that you’ve mentioned happened before you met me ba. You should have just resurrected not long ago at that time, right?</p><br/><p>“…How did you know?”</p><br/><p>“I guessed using the IQ that you don’t have.”</p><br/><p>“…”</p><br/><p>You XiaoMo took a deep breath and used a tone that aroused sympathy to say, “After I entered the golden tower, I dreamed about matters from my previous life. I was under the impression that I did not have any concerns about my previous life. However, only now did I discover that actually I have a few people I am unable to let go, particularly my grandfather. He would definitely be very sad when he finds out about my death.”</p><br/><p>“What type of place is your hometown?”</p><br/><p>“It’s a very beautiful place called Earth. However, all the people living on Earth are all ordinary people who have never heard of cultivators or mages before.”</p><br/><p>Ling Xiao propped his chin on You XiaoMo’s shoulder, “Your hometown should be a Lower Level Realm ba. Only people from Lower Level Realms would be incapable of cultivation. But this is not absolute as there are some Lower Level Realms which are relatively good.”</p><br/><p>You XiaoMo suddenly became excited. He turned around and grabbed the clothes on Ling Xiao’s chest, “Is what you’re saying true? Do you mean to say that I will have a chance to return to Earth in the future?”</p><br/><p>“Maybe.” Ling Xiao stared at the hand grabbing his clothes again.</p><br/><p>“What do you mean by maybe?”</p><br/><p>Ling Xiao looked at the ceiling, “Lower Level Realms are different from Middle Level Realms. The space is fragile and unstable, so the risk of establishing a spatial passageway is enormous. It’s impossible unless you wait for me to become a Sacred Realm or higher expert.”</p><br/><p>You XiaoMo’s gaze resolutely fixed on him, “You must work hard.”</p><br/><p>“Okay…”</p><br/><p>In the afternoon, everyone who had finished their matches came back one after another. As long as they put up with this for one more night, they would not need to live in this sort of place like the first level anymore.</p><br/><p>You XiaoMo was one of those who wanted to change rooms the most. Otherwise, he would have to squeeze on a small bed with Ling Xiao every night to sleep, and his waist and back would always be sore and aching the next day. He could not stand it anymore. Moreover, Ling Xiao was full of passion ever since he and You XiaoMo talked about everything.</p><br/>\n</div>"}