{"title": "Chapter 465", "id": 465, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-465", "volume_title": "Volume 5", "body": "<h1>Chapter 465</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 465: Ninth Young Lady</p><br/><p>Translated by Rachel of Exiled Rebels Scanlations</p><br/><p>Usually, the night sky of Vermillion Blood City would be adorned with numerous bright and dazzling stars but tonight, not one was visible from behind the dark clouds that hid them.</p><br/><p>After the old family head left Vermillion Blood City, there were now more guards in the city as compared to during the day. In particular, the great manor where his family lived had a patrol team passing by every five minutes.</p><br/><p>During the daytime, the old family head had brought a group of people along with him as he left Vermillion Blood City. As it was a covert operation, not many people knew about it. Ling Xiao even specially followed them for a while to ensure that they really left Vermillion Blood City.</p><br/><p>On that night, the four of them snuck into the great manor.</p><br/><p>Yin Ge and Zhan YuXuan hadn’t been idling around these past two days in Vermillion Blood City. They lurked around the great manor and used this time to record the timing of the guards’ change of shifts and their schedules. Even without the old family head overseeing the great manor, the four of them dared not let their guard down.</p><br/><p>However, the manor was too big so they decided to split into two groups after discussing.</p><br/><p>Yin Ge and Zhan YuXuan were one team. Ever since Yin Ge completely stimulated the Nine Headed Serpent King blood in him, his cultivation rose exponentially.</p><br/><p>Although half of him was human, his mother was also a capable person. Yin Ge more or less inherited her good traits. Furthermore, the Nine Headed Serpent King was the most receptive Emperor Beast to the Four Spirits. Their bloodline was so precious that once it was stimulated and unleashed, one’s cultivation would rise at rocket speed.</p><br/><p>Today, Yin Ge was already an Emperor level seven star peak powerhouse. He was only a small step away from becoming a Divine level powerhouse but he couldn’t wait anymore, so he ran out together with Zhan YuXuan before his breakthrough.</p><br/><p>As for Zhan YuXuan, his origin was more mysterious. Even his good friend Yin Ge wasn’t very clear about it. Although his cultivation was currently lower than Yin Ge, self preservation wasn’t an issue. If he really couldn’t handle it, he could just crush a dimension talisman and leave.</p><br/><p>The structure of the Vermillion Blood Clan’s great manor was somewhat unusual. It was divided into two levels. The lower one was almost set into the ground, becoming like an underground world. There were as many as ten entrances and while it wasn’t deliberately hidden, one could miss them if they weren’t careful enough.</p><br/><p>As there were many more guards on the lower level than the upper level, with more than five guards for every entrance, the lower level was left to Ling Xiao and You XiaoMo while Yin Ge and Zhan YuXuan took the upper level.</p><br/><p>The underground level of the great manor was enormous. On the surface it looked liked there were only ten entrances, but there were actually many places that were hard or impossible to guard which allowed them to enter. After all, it was impossible to not let sunshine in all year round. Otherwise, it could not be called a manor.</p><br/><p>You XiaoMo looked at the images reflected underwater. Although it was somewhat vague, he was certain that it was how the underground level looked. There seemed to be another pond on the other end, but how it was made, he didn’t know. The water there didn’t flow out.</p><br/><p>“Are we going down from here?”</p><br/><p>Ling Xiao calculated the time, “The guards on the underground level will pass by below every ten seconds. We must swim there within this period of time.”</p><br/><p>You XiaoMo’s eyes went wide and he spoke in a hushed voice, “Isn’t ten seconds too short? This pond’s depth looks like it’s over twenty metres deep. And also if we make the floor wet we’ll be discovered.”</p><br/><p>Ling Xiao didn’t answer his question. He just pulled him along and dove.</p><br/><p>You XiaoMo hurriedly covered his mouth.</p><br/><p>At the same time, just beside the pond above their heads, a patrol team passed right by the pond.</p><br/><p>The underground pond was built in the garden and in the pond there was only some algae that was totally unable to hide their bodies. After coming out of the pond, the two figures immediately blended into the darkness.</p><br/><p>……</p><br/><p>A brightly lit, exquisite pavilion stood in the middle of a flower garden in full bloom. It looked as if someone had scattered glitter over the colorful flowers, each and every one of the flowers exuded a beautiful glow. It was such a lovely scene, destroyed only by a sharp voice and the sound of porcelain falling to the ground.</p><br/><p>“You trash! You can’t even do such a simple thing! What’s the use of me keeping you lot! Get out of my sight!”</p><br/><p>Following that, two people ran out of the pavilion, only slowing down after they exited the garden.</p><br/><p>One of them sighed, “This Ninth Young Lady is really hard to please. Clearly it was her grandfather…”</p><br/><p>“Stop it.” The other person looked around cautiously. After he was sure no one was around, he spoke. “Do not casually talk about the people here. You may just lose your life. Ninth Young Lady is still a noble lady of the Vermillion Blood Clan no matter what. She’s not someone we can just talk about.”</p><br/><p>“Alright, I understand.”</p><br/><p>“Let’s hurry up and go.”</p><br/><p>At this moment, a black figure suddenly landed in front of them. The two of them were stunned and before they could even shout, a sudden sharp pain spread from the back of their necks. Their eyes closed and in the next second they vanished into thin air before they even fell to the ground.</p><br/><p>After putting the two people into Ling Xiao’s dimension, You XiaoMo and Ling Xiao hid in the rockery in the garden. You XiaoMo looked in the direction of the pavilion. This Ninth Young Lady’s status didn’t seem low. She was actually able to have her own beautiful pavilion to stay in. It was obvious that she most likely was a much doted on big missy.</p><br/><p>“Who is this Ninth Young Lady?” You XiaoMo asked out of curiosity.</p><br/><p>“She’s You ZhenTian’s granddaughter, You Yong. She’s the ninth grandchild. I heard that You ZhenTian was very fond of this granddaughter and pampered her a lot. As a result, it nurtured her condescending nature.” Ling Xiao answered. He did a lot of background checks. He knew everything about the main members of the You Family, You ZhenTian and the old family head.</p><br/><p>Pfft!</p><br/><p>You XiaoMo couldn’t keep his laughter in when he heard You Yong’s name. He couldn’t believe someone was actually named You Yong, and a woman to top it off.</p><br/><p>*You Yong’s name sounds the same as swimming.</p><br/><p>He laughed for a while before saying, “Since she’s his favorite granddaughter, she should know quite a lot of stuff right?”</p><br/><p>“Mmhmm.” The corners of Ling Xiao’s mouth curled upwards with a hint of a smile. “We’ll know after we ask her.”</p><br/><p>…….</p><br/><p>In the pavilion, You Yong was having a tantrum and throwing things around. The clean floor soon became littered with countless little fragments. Everything that she could throw in the room had been smashed.</p><br/><p>You Yong sat on a chair angrily and slapped the tabletop with her delicate hands.</p><br/><p>“This makes me so angry! Grandpa clearly dotes on me a lot, so why can’t he let me follow?”</p><br/><p>At this moment, a sound came from the door.</p><br/><p>“What is it?” You Yong was still irritated and when she heard the knock on the door, she yelled.</p><br/><p>“Ninth Young Lady, You Ping and You He came back again. They said they have something important to tell you.” The maid’s nervous and scared voice could be heard.</p><br/><p>“Very good. I was worried I wouldn’t have anything to vent my anger on. Let them in.” You Yong snorted coldly. She wanted to see what important matters they had for her. If it was the same as just now, she’d definitely pluck their heads off.</p><br/><p>Not long after, You Ping and You He walked in one after another.</p><br/><p>“If you have anything important then say it. Don’t try to test my patience.” You Yong’s questioning gaze swept over the both of them.</p><br/><p>You He took a step forward and hinted at the maid with a look, “Miss, this matter is of great importance. No one else but you should hear of it.”</p><br/><p>“It best be important. Otherwise you can be prepared to be skinned alive by me.” You Yong gave them a warning look before having the maid leave, ordering her not to let anybody disturb them if it wasn’t anything important.</p><br/><p>It was at this moment a white furball jumped from You He’s body onto the tabletop beside the Ninth Young Lady. The little furball instantly got bigger and started to roll around on the tabletop. The snowy white ball of fluff looked extremely cute.</p><br/><p>“This is?” You Yong was stunned for a moment.</p><br/><p>“Missy, please look at its eyes. Aren’t they pretty?” You He said.</p><br/><p>You Yong subconsciously did as she was told and looked at the furball’s eyes. It was a pair of magical purple cat eyes that looked like they held the world’s greatest mysteries in them. She was soon so entranced by them, her eyes started to lose focus and finally they became empty.</p><br/><p>Upon seeing this, You He gave a strange smile.</p><br/><p>The Ninth Young Lady now was completely absorbed in the illusion that the Thousand Illusions CatQiu had created. CatQiu’s illusions were tailor-made according to the person the illusion was casted on. The most convenient bit was that the illusions could tease out memories from the person’s brain and have her say it herself.</p><br/><p>Of course, You He was You XiaoMo, the master of the Thousand Illusions CatQiu.</p><br/><p>CatQiu’s stagnant cultivation level finally had a breakthrough ever since You XiaoMo gave his contract beasts magic pills to help them promote to a higher level. Controlling other people’s illusions became even easier and now he could create illusions for five people simultaneously.</p><br/><p>CatQiu drew the memory out of Ninth Young Lady’s mind and conveyed the information to his owner.</p><br/><p>You XiaoMo digested the information for a while but it was a pity that the Ninth Young Lady who was rumored to be You ZhenTian’s most doted on granddaughter didn’t actually know much. When it came to important information, there was hardly anything.</p><br/><p>Just as he was wondering why, an important piece of information suddenly flashed across his mind. It was the restricted area on the underground level, a place where even You Yong couldn’t enter.</p><br/><p>This You Yong was a domineering person. There was one time when she accidentally walked into the region of the restricted area and was stopped outside by the guards. She had a bad temper and the more they didn’t want to let her in, the more she wanted to enter. In the end, the matter blew up and You ZhenTian had to personally discipline her. It was only then that it stopped.</p><br/><p>However, this incident left a very deep impression on You Yong. The great manor was her home and there were actually places she couldn’t go to. That’s why she believed that the restricted area was most likely hiding some secrets that others shouldn’t know.</p><br/>\n</div>"}