{"title": "Chapter 497", "id": 497, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-497", "volume_title": "Volume 5", "body": "<h1>Chapter 497</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 497: The Artistic Executioner</p><br/><p>Translated by Yan of Exiled Rebel Scanlations</p><br/><p>You XiaoMo laid on his stomach in bed and sneakily shot Ling Xiao a glance. There was a question in his mind that was like an itch: at first it was only slightly itchy, but then the more you rolled the bigger it became.</p><br/><p>“My dear wife.”</p><br/><p>You XiaoMo heard Ling Xiao calling him, and he lifted his head to see him put down his cup of tea and look over with an expression that seemed to flash with playfulness.</p><br/><p>Ling Xiao curled the corners of his lips. “Seeing how conflicted you look, could it be you want to do it a few more times?” His smile was extremely wicked, but no matter what feeling it gave off it still made someone have the impulse to push him down.</p><br/><p>You XiaoMo silently turned his head away. His entire lower body was numb, and it wasn’t as if he wanted to court death. Originally he just needed to drink some spiritual water and he could recover, but after hearing this line, he quietly gave up on this idea. It was better if he had less behaviors that courted death.</p><br/><p>“You… how did you know I was in Xing Luo City, and that I went to the City Master’s mansion?” After hesitating for a while, You XiaoMo still couldn’t resist his curiosity and asked.</p><br/><p>Ling Xiao paused while pouring tea. He tilted his head and looked at him with a hint of a smile. “How would I know why someone would purposefully run to the City Master’s mansion looking for death in order to avoid me?”</p><br/><p>You XiaoMo was speechless.</p><br/><p>Could he just pretend he hadn’t said anything?</p><br/><p>Ling Xiao continued to calmly rebuke, “Wife, you seem to have grown a lot during those days I wasn’t here. You save people and seek revenge, and in the end you even sent yourself to a dog’s den, is there anything else you won’t do?”</p><br/><p>You XiaoMo buried his head into the pillow before suddenly raising his head after a few seconds. “How do you know all this?”</p><br/><p>Ling Xiao snorted. “Because of my wonderful foresight.”</p><br/><p>You XiaoMo followed up with flattery. “You’re so amazing!”</p><br/><p>In reality, he had already guessed how he knew. Only he and Weng Gong knew about the revenge, so there was only one possibility for how Ling Xiao also knew. He must have run into Weng Gong and happened to learn about it from Weng Gong himself, and that’s how he managed to find Xing Luo City.</p><br/><p>“First rest for four hours, after that we’ll leave Xing Luo City.” Ling Xiao said seriously.</p><br/><p>You XiaoMo carefully measured his expression and said, “Do we have to leave today? But I agreed to help Weng Gong get revenge.”</p><br/><p>Ling Xiao seemed to say something quietly, but You XiaoMo didn’t hear it.</p><br/><p>“Then let’s slaughter him first and leave after that.”</p><br/><p>The second day, probably the only two people who would swagger around Xing Luo City and not leave after night raiding the City master’s mansion and completely looting his property were You XiaoMo and Ling Xiao. However, at that moment the news of the mansion’s treasury being looted still hadn’t spread yet, and Xing Luo City’s Lord probably believed that they had already left, so he had only slightly increased the number of guards on patrol.</p><br/><p>The QingFeng Sect’s headquarters weren’t actually inside Xing Luo City.</p><br/><p>Xing Luo City’s city master had jurisdiction over the inside of Xing Luo City, so placing the headquarters inside the city would only be binding their own hands and feet. Therefore, many forces who were active inside the city all moved their strongholds out of Xing Luo City.</p><br/><p>But Gao MaYuan was only someone who had slight importance in the QingFeng Sect, and he didn’t even have the qualifications to enter the headquarters of the sect, so he stayed in a place called Dong Feng Building in Xing Luo City.</p><br/><p>You XiaoMo only had to ask around a little before he found that the Dong Feng Building was in Xing Luo City’s most famous ‘flower district.’</p><br/><p>This ‘flower district’ wasn’t referring to how people would sell items such as arranged flowers or fruits for auspicious occasions. Instead, it was for all sorts of romantic affairs, and both male and female brothels basically lined the entire street.t/n: Flower district is a metaphor for red-light district.</p><br/><p>Fortunately, You XiaoMo used to believe that this kind of place didn’t exist on TongTian Continent, so he hadn’t experienced it before.</p><br/><p>The brothels in the red-light district weren’t like the ones that You XiaoMo saw on television. The brothels here stayed open in all sorts of weather and were decorated very beautifully, but there were no pretty girls or handsome boys standing outside to solicit customers.</p><br/><p>You XiaoMo craned his neck to spy inside. Even though it was broad daylight, there were still quite a few customers in the brothels with young and beautiful concubines, and all sorts of obscene and lewd words flowed out from inside without missing a beat.</p><br/><p>Ling Xiao grasped the collar of his robe and walked in. “Want to look? Then just proudly go and look.”</p><br/><p>As soon as he finished the thought, everyone inside looked over.</p><br/><p>You XiaoMo was embarrassed. Although before, he had indeed wanted to come in and take a look at this kind of place which was filled to the brim with extravagance, but he felt that now wasn’t quite suitable.</p><br/><p>The person receiving them was a heavily made-up woman wearing rich, revealing clothing. The woman twisted her slender waist and watched them with an expression that carried a hint of veiled scrutiny.</p><br/><p>You XiaoMo let the woman inform Gao MaYuan while they waited in a room.</p><br/><p>After a minute, Gao MaYuan came over with several people. Up till now, he had still been investigating the incident at Hu Village since he had personally promised his concubine that he would help avenge his brother-in-law. But this entire time there had been no clues, making him feel very ashamed, so when he heard Hu Village’s name he hurried over immediately.</p><br/><p>“Who are you two?” Upon seeing two unfamiliar faces when entering the room, Gao MaYuan couldn’t help but be on guard.</p><br/><p>Ling Xiao picked up his cup and drank a mouthful of tea as a smile glimmered in his eyes. “I heard that Your Excellency was investigating the matter of your brother-in-law being killed, so I wanted to inform you of the murderer’s whereabouts.”</p><br/><p>You XiaoMo spat out his water.</p><br/><p>“Murderer? Who are you, and how do you know of this? What’s your purpose?” Gao MaYuan wasn’t suspicious about how he knew of this, since this wasn’t something he had taken pains to hide, but he didn’t dare to just randomly trust a stranger who had appeared out of nowhere.</p><br/><p>“In a moment you will know what my purpose is.” As Ling Xiao spoke, he pushed You XiaoMo forward and said, smiling, “I’ll first give you some welfare. This person is the murderer who killed your brother-in-law.”</p><br/><p>You XiaoMo laughed dryly. What kind of joke was this?</p><br/><p>Gao MaYuan’s scrutinizing gaze landed on You XiaoMo’s stiff face, and he pointed the scabbard in his hand towards him. “It was you who murdered my brother-in-law?”</p><br/><p>You XiaoMo shot a glance at Ling Xiao, whose expression remained unchanged. That bastard, since this was the case… “That’s right, I killed that brother-in-law of yours, but I only acted on someone else’s instigation.”</p><br/><p>“Who instigated you?” Gao MaYuan gripped the sword in his hand tightly, and a trace of anger flashed over his face.</p><br/><p>You XiaoMo coughed and pointed a finger at Ling Xiao. “He instigated me.”</p><br/><p>Gao MaYuan’s face grew gloomy. “Are you two playing with me?”</p><br/><p>Ling Xiao drank the rest of the tea in his cup and smiled at You XiaoMo, who had jumped aside. He curled his lips. “A scholar who has been away for three days must be looked at with new eyes. You’ve become smarter.”(t/n: ，, meaning “after even a short absence, people will change and should be judged anew”)</p><br/><p>You XiaoMo lifted his chin high, pleased with himself. “Only thanks to your lucky influence.”</p><br/><p>Gao MaYuan saw that the two of them had actually begun to chat as if nobody else was there. No matter if they were the ones who murdered his brother-in-law or not, he wouldn’t let them go, since they dared to play him like he was a monkey. He angrily drew out his sword and swung it downwards towards Ling Xiao, who was closest to him.</p><br/><p>Ling Xiao grabbed both of his arms and, with a light pinch, there came a cracking noise from the bones. Both arms were entirely broken and faced the opposite direction, and the tip of the sword slid into Gao MaYuan’s body with a puncturing noise. Fresh blood sprayed onto the table, and Gao MaYuan only took his final breath five seconds later. His face couldn’t even show a single sign of struggle, since the speed was too great.</p><br/><p>You XiaoMo swallowed heavily. Too ruthless.</p><br/><p>Ling Xiao pulled out the sword from Gao MaYuan’s body, and the blood sprayed out as he handed it to him. “Hold this.”</p><br/><p>You XiaoMo took the sword. “Why?”</p><br/><p>Ling Xiao said, “To cut off his head.”</p><br/><p>You XiaoMo’s hands shook, and he asked, not understanding, “Isn’t he already dead? Why do we still have to cut off his head?”</p><br/><p>“Didn’t you agree to help Weng Gong get revenge? How will you do it if you don’t bring him the head? Unless you want to carry the entire body away?” Ling Xiao asked disapprovingly in response.</p><br/><p>“But it’s very disgusting, I just ate yesterday.”</p><br/><p>“No problem, it’s already finished digesting.”</p><br/><p>“…can we change the location?”</p><br/><p>“Okay, top half of the body or bottom half, pick one.”</p><br/><p>“…let’s just go with the head then.”</p><br/><p>Cutting off the head was an executioner’s job, so who would’ve thought that he would end up stealing their work one day. Although he had seen many corpses who had died tragic deaths, this would still be the first time he personally cut off someone’s head. He couldn’t help but imagine the sight of blood flowing out and wanted to vomit…</p><br/><p>Ling Xiao gripped his hand, which was holding the sword, and gestured towards the corpse. He said quietly next to his ear, “Just pretend that you’re butchering a pig, don’t be afraid!”</p><br/><p>“Don’t say that, or else I won’t want to eat pork anymore.” You XiaoMo spat blood. What comforting, clearly he came just to disgust him.</p><br/><p>In reality, killing someone, er no, cutting off a corpse’s head was simpler than he imagined it to be. The hand rose and the sword fell, straight to the point. The head didn’t even roll off the table, still joined securely to Gao MaYuan’s neck, and although there was a sword stuck in between the two, there was still quite a feeling of artistry.</p><br/><p>You XiaoMo loosened the sword that had become stuck in the table and laughed evilly. “Done.”</p><br/><p>Ling Xiao clapped his hands, smiling, and he praised, “Your technique is not bad, you can’t tell that you have a natural gift for this. From now on, if there’s any more work like this it’ll be yours to do.”</p><br/><p>“……”</p><br/><p>Only when they left the brothel were the bodies of Gao MaYuan and his underlings discovered, although the underlings had died quite cleanly. The most brutal one was Gao MaYuan’s headless corpse.</p><br/><p>What nobody knew was that since the time You XiaoMo accidentally ran to the Vermillion Blood Clan’s territory, not a single peaceful day had gone by on the west side. In fact, this was the trouble created all because of that mistake.</p><br/>\n</div>"}