{"title": "Chapter 495", "id": 495, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-495", "volume_title": "Volume 5", "body": "<h1>Chapter 495</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 495: I Have an Accomplice</p><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>There was no way that the City Master of Xing Luo City was willing to let You XiaoMo go, and after realizing that it was two small demon beasts that had stolen from his vault, another idea arose.</p><br/><p>Not only was his vault created from the highest-quality metal, he had personally set seals there. However, not only did these two demon beasts manage to get past all the security in place, they had managed to get inside without anyone noticing. Just from this, it was clear that those two demon beasts weren‘t ordinary demon beasts.</p><br/><p>He didn’t know the Metal Swallowing Beast, after all, it was an ancient, mythical demon beast, but it was different for the Golden Winged Insects. They were very well known.</p><br/><p>Just one Golden Winged Insect was enough of a delight, but a second? No matter what, he had to obtain both.</p><br/><p>The City Master of Xing Luo City felt a deep aching pain in his finger. He had only been bitten once by the Golden Winged Insect but it felt like his blood and energy had been sucked out. Gazing in the direction You XiaoMo escaped in, rage burned in his eyes, as well as a heavy greed.</p><br/><p>This was a terrible day for You XiaoMo. He was completely surrounded by enemies. Next time, he’d have to teach the Metal Swallowing Beast and Xiao Pong what strategy was, what it meant to have a useless teammate, and when you should pretend to not know each other.</p><br/><p>Of course, that would all have to come after he got out of this mess.</p><br/><p>In the distance, Tang ZhongHua, who had stayed out of the fight, watched You XiaoMo run around with a shocked expression. His powerful eyesight allowed him a clear view of You XiaoMo’s face.</p><br/><p>It was the young man they had met in the hotel a few days ago. They had thought the other had left, but instead he was in the City Master’s home causing trouble.</p><br/><p>Then he heard the City Master of Xing Luo City yell ‘Golden Winged Insects’, a strange emotion appeared in Tang ZhongHua’s eyes. Xing Luo City’s City Master had recovered by then, and his wound had finally closed. His expression was terrifying and greedy, with eyes locked onto You XiaoMo like a hunter on its prey.</p><br/><p>Almost everyone was surveying the battle, but he crept silently behind You XiaoMo. All the background noise seemed to have suddenly been sealed away. This was the Domain of Xing Luo City’s City Master.</p><br/><p>Every Divine level expert could create their own Domain. Those with Domains would be slightly stronger than normal Divine level practitioners, and there was a very useful ability Domains possessed. The user could pull their target inside and isolate them from everyone else, those of which wouldn’t be able to see inside the Domain.</p><br/><p>You XiaoMo knew something was wrong when things went silent.</p><br/><p>As expected, when he looked back, he saw the figure of Xing Luo City’s City Master looking at him with disdain, as if there was no way You XiaoMo could escape.</p><br/><p>This time he knew it was probably over.</p><br/><p>“Well? Go on, run!” Xing Luo City’s City Master sneered. Now, he didn’t seem so anxious to act. Originally, he didn’t need to summon his Domain to deal with You XiaoMo, but he had ulterior motives and You XiaoMo really was too good at slipping away.</p><br/><p>You XiaoMo thought for a moment and suddenly said, “Actually, I have an accomplice.”</p><br/><p>The City Master narrowed his eyes.</p><br/><p>Seeing that he had no reply to that, You XiaoMo continued, “I split up with him. He took my contracted demon beasts to steal things from the treasury, and I went to your room. He should be out of here with what he has stolen from your treasury.”</p><br/><p>“And?”</p><br/><p>“If he doesn’t care about my life, refusing to help me, then don’t blame me for being cruel. I have a way to contact him, and can get him to meet up with me.”</p><br/><p>“I think you just want your accomplice to come and save you.” Xing Luo City’s City Master stared at him, easily seeing through his schemes.</p><br/><p>You XiaoMo blinked his eyes. “City Master, sir, even if I had him come to save me, with your strength, my friend won’t be able to defeat you. I’ve already fallen into your hands, so if you believe me, you might even get your treasures back.”</p><br/><p>The eyes of the City Master flashed. “Alright, I shall believe you this once.”</p><br/><p>You XiaoMo immediately took out his transmitter stone, almost tearing up. Dear god, let it work this time, otherwise he might actually die.</p><br/><p>After he got out of this, he would beg for Ling Xiao’s forgiveness.</p><br/><p>What the excited You XiaoMo didn’t realize was that the City Master was smiling coldly at him. He clearly didn’t believe what You XiaoMo had said, watching him as if he were like a clown.</p><br/><p>You XiaoMo turned so that his back was to the City Master, gazing at the flashing transmitter stone. As he was beginning to pray for this to work, the flashing died down into a layer of weak light.</p><br/><p>You XiaoMo almost started laughing wildly in delight, holding the transmission stone like a treasure. “My dear accomplice, where are you? I miss you. Every day we’re apart is like three years. I’ve missed you for days.”</p><br/><p>“Heh…” Five seconds later, a light laughter sounded.</p><br/><p>You XiaoMo did his best to ignore the chill that spread through him, smiling weakly. “Darling, don’t just laugh. I’m almost out of the City Master’s estate. Hurry and welcome me or else the today of next year will be my memorial.”</p><br/><p>Afraid that the City Master would hear their words, he couldn’t be too straightforward.</p><br/><p>The other seemed like he had just heard something funny. “City Master’s estate, huh? Where, when did you go, how come I don’t know? And what’s this about escaping?”</p><br/><p>Hearing this, You XiaoMo hurriedly covered the transmission stone stone, discretely glancing at the City Master. Seeing that the other’s expression hadn’t changed, he relaxed a little, coughing.</p><br/><p>“Don’t ask so much. I’m in Xing Luo City’s City Master estate, it’s an emergency!”</p><br/><p>“An emergency? From what I’ve seen, you seem to be having fun, running from the south wing to the west wing. You seemed to have been enjoying yourself, I’m almost jealous.”</p><br/><p>You XiaoMo began to stutter. “Th-then, I-I didn’t do it on purpose. Are you coming to rescue your wife or not?” He knew it; Ling Xiao would definitely bring up these old grudges.</p><br/><p>“Heh, so now you admit you’re my wife?” Ling Xiao gave a ambiguous laugh.</p><br/><p>You XiaoMo immediately withered. “Alright, I admit I was wrong. I’ll never do it again. If you say east, I won’t dare go west, so hurry and come over with the treasures to save me.”</p><br/><p>He raised his voice on purpose at the end.</p><br/><p>“Then hang on.”</p><br/><p>With that, the light from the transmitter stone faded.</p><br/><p>Without the other’s voice, You XiaoMo immediately felt insecure. His sort of empty feeling was really the worst.</p><br/><p>Composing himself, You XiaoMo turned with a smile, saying to the City Master, “City Master, sir, I’ve already talked with my friend. He said he’d get here soon and will return everything we took from the vault.”</p><br/><p>The City Master eyed him like a fox for a few seconds before suddenly beginning to laugh. His laughter wasn’t nice at all, but rather malicious.</p><br/><p>“What are you laughing at?” You XiaoMo frowned at this strange laughter.</p><br/><p>The City Master stopped laughing, coldly eyeing him and saying, “Did you really think that I would believe your lies?”</p><br/><p>“What do you mean? Didn’t I just say my accomplice will return what we stole to you? You heard me talk to him.” A question mark rose in You XiaoMo’s mind. Could it be that the other hadn’t heard his and Ling Xiao’s conversation? Though their conversation was strange, it could prove that he had an accomplice.</p><br/><p>The City Master sneered. “I don’t know how you did it, but you are quite daring to try and trick this City Master. In my Domain, transmitter stones wouldn’t possibly work. Your act wasn’t bad.”</p><br/><p>You XiaoMo was confused. “Wait, you mean to say that transmitter stones can’t be used in Domains? Then when can they be used? Could it only work if the other person was in the Domain, too?”</p><br/><p>“That’s right, but don’t think you can trick me. Don’t think I don’t know you did something to your transmitter stone, in reality you don’t have an accomplice!” The City Master laughed coldly.</p><br/><p>You XiaoMo’s jaw dropped. The answer to this mystery was at the recesses of his mind. After a moment, he swallowed thickly and asked, as if testing the waters, “Didn’t you hear me speak to my accomplice just now?”</p><br/><p>The City Master seemed irritated. “You think I don’t know that this was just an act you did? Foolish. In my Domain, I have a full grasp of your every movement.”</p><br/><p>With this, You XiaoMo was very certain of one thing.</p><br/><p>He was being toyed with!</p><br/><p>Ling Xiao had tricked him again. The other had known he was in the City Master’s estate from the beginning and had watched the entire thing play out. The reason the transmitter stone could connect was because the other was in the Domain right now, but this guy wasn’t using the transmitter stone to speak to him at all, but directly transmitting his voice over.</p><br/><p>No wonder the City Master of Xing Luo City would think he was lying!</p><br/><p>Dammit, this guy really had him fooled.</p><br/><p>However, You XiaoMo felt secure with Ling Xiao backing him, and he immediately gazed at the City Master with reckless courage and delight. “City Master, did you know that, in your Domain, there’s a… Ouch!”</p><br/><p>He hadn’t even finished speaking when an invisible hand cuffed him over the head.</p><br/><p>————————————</p><br/><p>(Ra: Daddy LX is here to spank some bad kiddo for running around)</p><br/>\n</div>"}