{"title": "Chapter 491", "id": 491, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-491", "volume_title": "Volume 5", "body": "<h1>Chapter 491</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 491: EyesTranslated by Jouissance of Exiled Rebels Scanlations</p><br/><p>Jiang Liu’s thoughts weren’t hard to guess. He had guessed that You XiaoMo had come to the TongTian Continent. Since Fang ChenYue was the other’s respected Da Shixiong, You XiaoMo definitely wouldn’t be able to sit by if he knew that Fang ChenYue had fallen into Jiang Liu’s hands.</p><br/><p>Jiang Liu couldn’t help but feel excited at the thought of capturing You XiaoMo so soon. He didn’t know why the Vermillion Blood Clan wanted You XiaoMo, but he was certain that You XiaoMo had something they needed.</p><br/><p>However, Tang ZhongHua and Tang He didn’t immediately understand what he was thinking of.</p><br/><p>Though YinYang Valley had forces in Xing Luo City, randomly capturing a stranger without knowing the other’s background wasn’t a wise choice of action.</p><br/><p>Plus, the selection trial was tomorrow. It might be affected.</p><br/><p>Seeing that they seemed unwilling to act, Jiang Liu realized the reason for their hesitation and said in a low, rushed voice, “I recognize this person. He’s someone from the Middle Level Realm. His identity is pretty special. Capturing him will only do you good.”</p><br/><p>If he was a person from the Middle Level Realm, then that meant he had no background.</p><br/><p>Though they didn’t know why Jiang Liu wanted to capture this person, he didn’t seem like he was lying. Tang ZhongHua walked up to Ling Xiao, half doubtfully.</p><br/><p>Ling Xiao swept his gaze over the three, smiling, before stopping at Jiang Liu.</p><br/><p>After some contemplation, he had managed to figure out what Jiang Liu wanted to do. He had a good idea, but luck was important.</p><br/><p>However, Jiang Liu’s cultivation level was rather surprising. It seemed that he had been given many opportunities these few years. It was just unfortunate that he seemed a little weird. Was this the aftereffect of forcibly increasing his cultivation level?</p><br/><p>Seeing that ‘Fang ChenYue’ seemed unfazed and was even smiling, an unsettled feeling rose in Jiang Liu’s chest. It was especially strong when those eyes looked at him. It felt like even his soul was being looked through.</p><br/><p>He hurriedly reassured himself. That was impossible.</p><br/><p>Fang ChenYue was just a Mage. No matter how strong he was, he wouldn’t be able to match up to them.</p><br/><p>In his delight, he had neglected something: Fang ChenYue’s temperament. Fang ChenYue was like the older brother you never had, and interacting with him would give you a warm feeling inside your heart. As for Ling Xiao, even if the entire Higher Realm collapsed, he wouldn’t be able to even fake that.</p><br/><p>Tang ZhongHua surveyed Ling Xiao, hands grasped behind his back. “Do you need me to force you, or will you come quietly?” He thought nothing of a person from the Middle Level Realm, his tone clearly superior.</p><br/><p>“Are all people in the YinYang Valley so unreasonable?” Ling Xiao asked, smiling. There was no hint of anxiety on his face at all.</p><br/><p>“Since you know we’re from the YinYang Valley, I advise you to come quietly. We won’t do anything to you, we just want you to come with us for a while, so don’t force us to use violence. Nothing good will come of it for you.” Tang ZhongHua really did hope the other would listen. That way, he wouldn’t have to go through the trouble of fighting.</p><br/><p>“Uncle Tang, why bother wasting so many words on him? Let’s just get him.” Tang He, tired of their talking, unsheathed a thin knife and said, bloodthirsty, “If you don’t want to, then I will. I didn’t get the chance to fully enjoy myself back in the hotel.”</p><br/><p>“No need, I’ll do it.” Tang ZhongHua rejected his offer, raising his hand and revealing his arm from under his sleeve. His hands had a silver, metal sleeve over them.</p><br/><p>Amusement appeared on Tang He’s face. He was going to use his ace immediately?</p><br/><p>He didn’t realize his Uncle Tang viewed this with such importance. It seemed like he wanted to get this over with as soon as possible. However… Tang He looked towards Ling Xiao. He couldn’t help but feel that there was something wrong with the whole situation, but he couldn’t grasp why.</p><br/><p>Tang ZhongHua’s metal hand was already darting towards Ling Xiao, yelling, “If you refuse to take the easy way out and insist on the hard way, then eat this: Ghost Claw! Take this as a lesson and remember it well.”</p><br/><p>Ling Xiao took one small step forward with his left foot. His fist, which looked completely normal without any metal sleeve, seemed to weigh tons, slamming directly against Tang ZhongHua’s Ghost Claw.</p><br/><p>The two forces met, creating a shockwave that spread out. A few of the passing people didn’t dodge in time and were blown off their feet.</p><br/><p>Two seconds later, a cracking noise sounded out.</p><br/><p>Before anyone realized what had happened, Tang ZhongHua was flying back, screaming, and slammed into the ground. His right arm was twisted at an unnatural angle, dangling to one side. His face was pale, eyes reflecting pain and shock.</p><br/><p>The area was silent…</p><br/><p>“No, you aren’t Fang ChenYue.” In this strange atmosphere, Jiang Liu’s high pitched voice rung out, piercing through everyone’s ears like a bewitchment, waking them all up.</p><br/><p>Ling Xiao side-eyed him, using a surprised tone to say, “Ah? Who’s Fang ChenYue?”</p><br/><p>Jiang Liu’s expression immediately twisted. He only just realized that, apart from the other’s face, he wasn’t like Fang ChenYue at all. Could it really be that he had gotten the wrong person?</p><br/><p>“This isn’t something that can be overlooked with just the excuse of getting the wrong person,” Ling Xiao said, timely. His voice was playful but clearly was unwilling to let the matter go.</p><br/><p>Jiang Liu soon calmed. He wasn’t inexperienced. Though he had gotten the wrong person, Xing Luo City was within the YinYang Valley’s control. He didn’t believe that this guy dared to do anything to them.</p><br/><p>“This was all a misunderstanding. I trust that you don’t want YinYang Valley as your enemy, sir.”</p><br/><p>Though he said this, addressing the other with respect, Jiang Liu still maintained a threatening tone.</p><br/><p>Ling Xiao narrowed his eyes. This Jiang Liu didn’t seem as weak and soft as he was before. Could it be that because he had the YinYang Valley’s support, he had gotten so confident?</p><br/><p>This feeling was like someone who used to be even lower than an ant suddenly changing into a person with backing, acting all superior and looking down at people. This was exceptionally unsatisfying.</p><br/><p>Ling Xiao didn’t like his expression, so he backhanded him, the sound of skin hitting skin extremely loud and clear.</p><br/><p>Jiang Liu might be a level nine mage, but he couldn’t take Ling Xiao’s slap, thrown to the ground by the force. When he raised his head again, half his face was swollen, and he wore an expression of disbelief.</p><br/><p>“You-you dare hit me?” Jiang Liu’s hands were trembling, his eyes red as he glared.</p><br/><p>Ling Xiao ignored Tang He and walked up to Jiang Liu, crouching. Staring into the other’s hateful eyes, Ling Xiao smiled softly. “I don’t like your eyes. How about I dig them out?”</p><br/><p>Jiang Liu felt a chill spread through his body, beginning to shake. He knew that this man wasn’t joking. He didn’t want to have his eyes dug out, yelling at Tang He in terror. “No, no… Tang-Tang He, Tang He! Save me! Hurry and save me!”</p><br/><p>Tang He was rooted in place. It wasn’t that he didn’t want to save Jiang Liu, but that he was helpless to act. This guy had an aura that could only belong to an emperor level practitioner. He wasn’t the other’s opponent at all. If he stayed, then he might be killed as well.</p><br/><p>Thinking of this, Tang He backed away, yelling, “Jiang Liu, hang on, I’ll go find people to save you!” After that, he ran in the other direction.</p><br/><p>Jiang Liu felt anger consume him. His only savior had abandoned him. Though he knew that neither Tang He or Tang ZhongHua were this man’s opponent, he couldn’t help the rage that rose in his heart.</p><br/><p>Realizing that if he kept stalling, all of Xing Luo City’s powerhouses might arrive soon, Ling Xiao decided to get this over with. It wasn’t that he was afraid of those people, but the idiot was still in Xing Luo City.</p><br/><p>He didn’t use his fingers, that was too dirty!</p><br/><p>Using fire, the other’s fragile eyes couldn’t stand the heat, melting bit by bit. It was far crueler than just digging them out. Jiang Liu screamed with all his might, veins bulging and nails tearing at his own face, creating lines of blood. He’d rather die right there.</p><br/><p>By the time Ling Xiao retracted the flames, Jiang Liu didn’t even have the energy left to scream, twitching as he lay on the ground. He seemed like he was on his last breath, as if he had lost half a life.</p><br/><p>The people around had all ran off. It was too terrifying. Just hearing Jiang Liu’s screams made them feel like it was their own eyes being burned away.</p><br/><p>Though it was a terrible fate, no one sympathized with Jiang Liu.</p><br/><p>If it wasn’t for the fact that he was dead set on attacking that man using his connections with the YinYang Valley, he wouldn’t have ended up like this.</p><br/><p>Seeing several figures approaching, Ling Xiao lowered his head and said to Jiang Liu with a delighted smile, “Aiya, looks like your saviors are here. Then let’s stop here. Next time, remember to chill out a little.”</p><br/><p>It wasn’t until he left that those people arrived.</p><br/><p>Amongst them was Tang He. Seeing Jiang Liu’s state, he couldn’t help but inhale sharply. Both of Jiang Liu’s eyes had become black holes. If they had been dug out, then there was a chance of healing them, but like this, it would be impossible.</p><br/><p>Shock flashed through the eyes of the city master of Xing Luo City, but it was drowned in rage. Someone dared to murder people in his city, and the victim was someone chosen by the Vermillion Blood Clan, too. Unforgivable.</p><br/><p>“On my orders, give everything we have to apprehend the perpetrator.”</p><br/>\n</div>"}