{"title": "Chapter 494", "id": 494, "volume": 5, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-494", "volume_title": "Volume 5", "body": "<h1>Chapter 494</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 494: A Pig-Like TeammateTranslated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Jiang Liu’s face has been treated and his eye sockets were covered with a damp cloth. It did not seem that bad from the You XiaoMo’s point of view. At most, his face was a little pale.</p><br/><p>You XiaoMo hesitated for a bit before he dismissed his intention of continuing to watch. If Tang ZhongHua suddenly came back and saw him, You XiaoMo would definitely be hounded by him since that old guy’s strength was about the same as his.</p><br/><p>Thinking of this, You XiaoMo put the tile back once again.</p><br/><p>Things like tiles had to be gently handled, otherwise it would make a sound with just a slight collision and the sound would be magnified several times in the silent night.</p><br/><p>You XiaoMo felt that he had taken all precautions, but when he placed his feet on a certain piece of tile, a ‘ka-cha’ instantly sounded and he couldn’t help but curse in his heart.</p><br/><p>What kind of broken tile was this? The quality obviously could not pass the quality check!</p><br/><p>“Who is it?”</p><br/><p>The people inside the house had been alarmed by the movement on the roof, including Tang ZhongHua who had just returned. His reaction was even faster than the guards and he flew onto the roof in less than a second.</p><br/><p>Seeing a shadow that was about to disappear into the night, Tang ZhongHua chased after it without demur.</p><br/><p>Though the guards did not chase them, they had already notified the City Master and informed him of the direction that You XiaoMo had escaped in. It would be difficult to escape unscathed from the City Master’s mansion without any fuss if You XiaoMo made himself an easy target.</p><br/><p>You XiaoMo fled as if his ass was on fire. This was the first time that he had such a rough start since he came to this world. Not only did he not find the dragon blood, he had also been discovered.</p><br/><p>He could only run towards a direction that was unpopulated. The map of the City Master’s mansion was already not of much use now. In order to catch them, every exit in Xing Luo City had long been patrolled by the guards.</p><br/><p>“Fuck, they’re chasing me too closely!”</p><br/><p>You Xiaomo swept past a branch and looked back at Tang ZhongHua who was hot on his track, like a debt collecting nuisance. You’re not even the City Master’s guard, why are you working yourself to the bone ah?!</p><br/><p>He did not know that Tang ZhongHua was under the impression that he had stolen the dragon blood. Since the dragon blood was his objective, he naturally could not let You XiaoMo take it away.</p><br/><p>You XiaoMo turned his head and looked at the dense forest ahead. The inky-black forest seemed to be sparsely populated, but he would truly become a fish in the barrel if he burst in. After hesitating for a moment, he turned into the direction of a building that had fewer signs of people.</p><br/><p>Taking advantage of the cover of the dark night, You XiaoMo put on a burst of speed and plunged in. His figure was gone in a instant.</p><br/><p>Tang ZhongHua landed in a courtyard and found that it was the West side of the City Master’s mansion. Apart from the side room, this was the place with the least guards and he could not help but frown.</p><br/><p>This thief seemed to be very familiar with the terrain of the City Master’s mansion. Could it be an inside job?</p><br/><p>Just as this thought flashed through his mind, a team of fifteen guards suddenly rushed into the courtyard. The captain of the team saw Tang ZhongHua and immediately walked over.</p><br/><p>“Sir Tang, may I known why are you here?”</p><br/><p>Tang ZhongHua replied, “I was chasing a thief and ended up here. Have you seen any suspicious figures?”</p><br/><p>The guard captain frowned as he thought about it before shaking his head, “This… this one has not seen any suspicious figures.”</p><br/><p>“He should still be here. Immediately dispatch people to look for him.” Tang ZhongHua was not too surprised with his answer. That person was quite fast and his strength seemed to be comparable to his. Furthermore, the thief was well prepared, so he would probably not be caught so easily.</p><br/><p>“Yes!” The captain of the guards immediately divided his team into three teams of five.</p><br/><p>Then he instructed them to head to different places to search before dismissing them. Tang ZhongHua himself also headed in the most probable direction that the figure had escaped in.</p><br/><p>No one noticed a man wearing the green armor of the City Master’s mansion guards suddenly walking out from a dark corner and quietly following the team.</p><br/><p>……</p><br/><p>On the other hand, the Metal Swallowing Beast and the Golden Winged Insect were also chased till they were leaping up and jumping down.</p><br/><p>They were chasing in direction their stupid Master had went in, but their stupid Master was also moving. As a result, they could only look on helplessly as the distance widened farther and farther. It was really saddening!</p><br/><p>Fortunately, they were small-sized and the people in the City Master’s mansion did not expect the thief to be two small demon beasts. Therefore, they were able to hide away and get through this daunting experience without mishap. This was indeed the case at the beginning, but their good fortune came to an end after the Xing Luo City Master personally set out.</p><br/><p>The City Master of Xing Luo City was a two-star Divine Realm expert who was able to manage an entire city. It was obvious that he was somewhat skilled and was not just an old man with a brain full of sperm.</p><br/><p>The Metal Swallowing Beast and the Golden Winged Insect were quickly discovered with him personally setting out. There would be guards chasing after them no matter where they ran. Fortunately, they had inborn advantages and were able to avoid the encirclement time and time again.</p><br/><p>The City Master of Xing Luo City frigidly stared in the direction that the Metal Swallowing Beast and Xiao Ping were escaping in. He had already taken a look at the treasury. Although the dragon blood had not been stolen, most of the items in the treasury had been taken away and many of them were priceless objects. The loss of these items to the city lord mansion would be inestimable if they were not found.</p><br/><p>“City Master, they ran to the West side.” One of the captains of the guard ran over to report.</p><br/><p>“The West side, is it? Notify the guards on the West side immediately. Pass the order for them outflank the thieves. They must be eliminated in fell one swoop.” The City Master of Xing Luo City darkly hissed.</p><br/><p>“Yes, City Master!”</p><br/><p>You XiaoMo knew that the Metal Swallowing Beast and Xiao Ping had been discovered once he heard this news.</p><br/><p>He had clearly let them escape from the City Master’s mansion immediately after they were discovered, but even until now, they had actually been running for their lives inside the City Master’s mansion. These children were unable to be taught ah!</p><br/><p>The guards displayed their thorough and intense searching spirit, but did not see any suspicious thieves. However, the searching range was getting smaller and smaller and it did not take long for You XiaoMo to see other guards coming over.</p><br/><p>There were two scenarios under these circumstances. Either the Metal Swallowing Beast and Xiao Ping had already fled, or they were still within the searching range. The first scenario would be delightful to see and hear, the second would definitely cause his chrysanthemum to hurt.</p><br/><p>“I’ve found them!”</p><br/><p>An excited holler suddenly sounded at this moment.</p><br/><p>You XiaoMo quivered. The guards had already began to move. Sure enough, there was a golden shadow running towards him under their pursuit. His speed was extremely fast and was akin to lightning. It was the Metal Swallowing Beast. Xiao Ping should be on his body.</p><br/><p>His ‘teammates’ had rushed out before You XiaoMo could react.</p><br/><p>The Metal Swallowing Beast changed directions several times in mid-air, nimbly avoiding salty pig hands of the guards before landing lightly on a stone. His sapphire blue eyes twinkled with magnificent brilliance. A figure was reflected in his eyes which had suddenly brightened. When the guards had thrown themselves over, he slammed his two legs in a powerful push and pounced towards a certain person.</p><br/><p>The Metal Swallowing Beast plunged into his arms under the watchful eyes of the crowd just as You XiaoMo was about to move. This seriously fulfilled the saying of ‘the most fearful person was a pig-like teammate’.</p><br/><p>The scene seemed to have frozen all at once.</p><br/><p>“Great job, quickly grab onto him!” One of the guard captains had not discovered that You XiaoMo was an impostor. Pleasant surprise immediately crossed his face and he even began to shout loudly, as if he was the one who had caught the Metal Swallowing Beast.</p><br/><p>You XiaoMo, “…”</p><br/><p>After a while, someone finally noticed that there was something wrong with You XiaoMo’s cover. One of the guards even quietly muttered a ‘Which team is this person from?’</p><br/><p>You XiaoMo tightly hugged the Metal Swallowing Beast as he scampered off.</p><br/><p>The guards were stunned, what was going on?</p><br/><p>“You want to run?” The cold and savage voice of the City Master of Xing Luo City suddenly rang out in the night sky and bore through the mind like a devilish tone. His figure simultaneously appeared in the air, coincidentally blocking You XiaoMo’s escape route. The anger on his face was extremely obvious as he made his move without any extraneous words.</p><br/><p>A fist harboring an astonishing force split the void and smashed directly towards You XiaoMo. The City Master of Xing Luo City deliberately released his aura of a Divine Realm powerhouse in an attempt to suppress You XiaoMo.</p><br/><p>However, You XiaoMo had already experienced the pressure from a Sacred Realm expert. How could he be afraid of the pressure from an insignificant Divine Realm powerhouse? Thus, he directly ignored it.</p><br/><p>You XiaoMo cut a sorry figure as he dodged the wind punch from the Xing Luo City Master.</p><br/><p>There was the Xing Luo City Master in the sky and all the guards available in the City Master’s mansion on the ground. It was honestly impossible to escape even if one had been given wings.</p><br/><p>The Xing Luo City Master clasped his hands behind his back as he condescendingly eyed You XiaoMo, “This old man can consider leaving you as an intact corpse if you hand over all the items from the treasury and the demon beast in your arms. Otherwise, I will make your life a living hell.”</p><br/><p>You XiaoMo rolled his eyes. He was already considering the merits of simply hiding in his dimension.</p><br/><p>Seeing that he was not answering, the expression of the Xing Luo City Master chilled a few degrees, “Since you’re insistent on courting death, this old man will fulfill your wish.” With that, his figure disappeared from its place.</p><br/><p>When it reappeared, the figure of the Xing Luo City Master was already in front of You XiaoMo in the blink of an eye. His speed was extremely fast and it was just like he had teleported. He raised his hand and reached towards You XiaoMo’s shoulder.</p><br/><p>You XiaoMo could not even react.</p><br/><p>Just at this moment, Xiao Pong, who had been quietly perching on his head suddenly flew up and bit down onto the Xing Luo City Master’s finger with a lightning-fast snap. The bite wound was very small, yet the Xing Luo City Lord released a miserable shriek as he pressed down on his finger which was bleeding non-stop and rapidly retreated.</p><br/><p>“This is…a Golden Winged Insect?!”The City Master of Xing Luo City looked at Xiao Pong, who had flown back onto You XiaoMo’s head, in shock. He saw it extremely clearly since he was very close. It was indeed a golden insect, it was just that its eyes were red.</p><br/><p>You XiaoMo had thought that Ping Pong were only able to bite Restriction barriers, he did not expect their bite to have such attack power. Taking advantage of the time where the City Master of Xing Luo City was so shocked that he was unable to react, he made a turn about and ran off.</p><br/>\n</div>"}