{"title": "Chapter 509", "id": 509, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-509", "volume_title": "Volume 6", "body": "<h1>Chapter 509</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 509: Special Rules</p><br/><p>Translated by Yan of Exiled Rebels Scanlations</p><br/><p>You XiaoMo remembered that when they had first arrived on the Tong Tian Continent, the old geezer had given them a Sealed Jade Drive. But because the seal on the jade drive was too powerful, and Ling Xiao couldn’t undo it even as a Divine Realm practitioner, the matter continued to be pushed back. By now, many months had already passed, and he had nearly forgotten about it entirely.</p><br/><p>Remembering this, he almost couldn’t control himself.</p><br/><p>However, Ling Xiao had recently finished absorbing the Dragon Clan’s inheritance. But in order to master a few of the Dragon Clan’s techniques, he had left XiaoYao Institution in search of a far away place with no people to practice his cultivation, and he wouldn’t be back before dusk.</p><br/><p>No matter how anxious You XiaoMo was, he still had to wait.</p><br/><p>In the afternoon, You XiaoMo didn’t wait until Ling Xiao came back, instead Qiao WuXing and Jiu Ye came to visit.</p><br/><p>It was rare that the two of them would come at the same time to find him, so You XiaoMo invited them into his room and poured them two cups of cold tea, acting as a host. The tea was only hot when Ling Xiao was there.</p><br/><p>“I only have cold tea here, no hot tea or wine. Make do with this for now.” The two of them looked at the cold tea in front of them and didn’t move.</p><br/><p>You XiaoMo didn’t feel that it was awkward. “Why did you come to find me?”</p><br/><p>“Oh, I heard that you and Ling Mo went to the ZhongTing Trade Fair a few days ago and met my master and Jiu Ye’s master.” Qiao WuXing said deliberately.</p><br/><p>“Yep!”</p><br/><p>There was nothing particularly worth hiding about this incident. The two of them had already said that those two were their masters, and it couldn’t be any more normal for their disciples to know. You XiaoMo was pretty curious as for what they wanted to say.</p><br/><p>If they had received their Master’s trust and come to be on friendly terms with him, there was absolutely no need for that, because their relationship right now was already pretty good. Although it wasn’t a friendship for life, they could still be considered friends nonetheless. It was also unlikely that they came to trick him into telling the truth. It wasn’t as if he was an idiot, so how could the matter about the Spiritual Water be casually tricked out of him.</p><br/><p>“Actually, it’s nothing much. I came to tell you about something. If you want to climb to a higher floor in the tower as soon as possible, you can try to go challenge XiaoYao Institute’s special rules.”</p><br/><p>“What are the special rules?” This was the first time You XiaoMo heard of this.</p><br/><p>Jiu Ye’s cool voice slowly said, “The so-called special rules are set up for powerful experts who cannot wait for three months. But it isn’t as if anyone who wishes to challenge the special rules can challenge them. You need a recommendation from a prestigious elder in order to enter the quota.”</p><br/><p>You XiaoMo nodded. “What do you have to do in the challenge?”</p><br/><p>Qiao WuXing said, “It’s actually very simple, you only have to compete against a teacher in the institute. If you beat him, then you can ascend.”</p><br/><p>“What kind of competition is it?”</p><br/><p>“Comparing pill-refining techniques.”</p><br/><p>You XiaoMo thought about it for a bit. “Let me ask, how powerful is this teacher?”</p><br/><p>Jiu Ye slowly spat out a few words. “At least of the first grade rainbow level.”</p><br/><p>You XiaoMo, “……”</p><br/><p>How could he compare to this? Right now, at the very most he could only refine level ten medium grade magic pills. If the opponent could refine a one-color pill then he would lose for sure. A one-color pill meant a first grade rainbow pill, since a first grade rainbow pill only had a thread of color, it was also addressed using a color.</p><br/><p>Qiao WuXing laughed and said, “If the teacher’s isn’t very powerful, then how can it be called special rules? After all, you’re challenging XiaoYao Institute’s rules, so it’s a little more difficult. Moreover, every person only has three chances to challenge the special rules. Once you’ve used them all up, you can only abide properly by the rules and climb up that way.”</p><br/><p>“Actually, you don’t need to worry too much.” Jiu Ye said, smiling.</p><br/><p>You XiaoMo used his eyes to indicate that he should keep talking.</p><br/><p>“Although the teacher you’ll be challenging will be at the first grade rainbow level, the success rate of refining and creating rainbow pills is definitely not high. They have requirements for their surroundings and for themselves, so every time someone challenges the special rules, the teacher won’t refine a rainbow pill then and there.”</p><br/><p>The magic herbs required for a rainbow pill were extremely expensive and hard to find. If it failed, finding all the magic herbs again would be difficult, so if there wasn’t above a 70-80% chance of success, there was absolutely no teacher who would dare to casually attempt it.</p><br/><p>“I will carefully consider this.” You XiaoMo said.</p><br/><p>“If you decide, you can notify us whenever.” Qiao WuXing stood up. There must be a certain amount of time to prepare before the special rules.</p><br/><p>After sending the two of them off, You XiaoMo closed the door.</p><br/><p>Returning to the table, You XiaoMo picked up the cups and drank the cold tea that the two of them hadn’t touched. Tsk tsk, cold tea actually tasted pretty good. Even though he was always very stupid in front of Ling Xiao, he actually hadn’t lost his IQ.</p><br/><p>For Qiao WuXing and Jiu Ye to suddenly run to come find him and say that it had nothing to do with their masters was something he definitely couldn’t trust. It was more likely than not that this was something their Masters suggested. As for the reason, if he thought about it carefully he would know.</p><br/><p>Last time at the ZhongTing Trade Fair, although he had told them to their face that he didn’t have any extra Spiritual Water, two old people who were that shrewd definitely wouldn’t trust him completely. So after that, they sent their own disciples to tell him of the existence of the special rules.</p><br/><p>Qiao WuXing had never told him about the existence of the special rules before this, most likely because he thought that You XiaoMo wouldn’t be able to beat a teacher of the rainbow mage level at that time, but if it was suggested by his master then that was a different matter.</p><br/><p>Under Old Lei and Old Shen’s judgement, it was likely that they had already discovered his cultivation level.</p><br/><p>If he really agreed to challenge the special rules and if he wanted to beat the teacher at his current cultivation level, he would have to use the Spiritual Water, unless the opponent played it easy on him. He would use the Spiritual Water to promote the magic pill to another grade.</p><br/><p>This would be able to confirm whether or not he still had Spiritual Water with him.</p><br/><p>He trusted that the two old men wouldn’t try to steal his things, but they would definitely wear him down to the point where he would sell them the Spiritual Water. They were truly two sinister old fellows. They knew he very much wanted to go to a higher floor, so they used the special rules to lure him in, ensuring that he wouldn’t relinquish this opportunity, wasn’t that right?</p><br/><p>You XiaoMo was very hesitant. He wanted to go up quite badly, but…</p><br/><p>When Ling Xiao entered the room, he saw You XiaoMo, who had his chin cupped in both of his hands and was dejectedly heaving deep sighs. This expression didn’t suit him at all, and the more he looked at him the more amusing it became.</p><br/><p>You XiaoMo seemed as if he was in a trance, and he didn’t notice that Ling Xiao had already returned.</p><br/><p>He only noticed when his chin was suddenly turned to the side by a hand and he was met with a handsome, heroic-looking face that was moving closer. His lips were covered by another pair of somewhat cold lips and his slightly open mouth was forcefully invaded, dazing him in a split second.</p><br/><p>It was a five minute long kiss, and You XiaoMo felt like he lost half of his life because of a lack of oxygen. His mouth was red and swollen from the kiss, and his melancholy atmosphere turned into a ravished one. Truly, it truly made his balls hurt!</p><br/><p>Ling Xiao scooped him up and placed him on his legs before sliding one of his hands inside his disheveled shirt in an erotic movement, as well as the ‘rod’ below which was preparing to lift its head.</p><br/><p>You XiaoMo hurriedly grabbed his hand. “Wait a second, I have something important to discuss with you.”</p><br/><p>“Mhm, I’m doing something important right now, let’s do it together.”</p><br/><p>“…”</p><br/><p>You XiaoMo sucked in a deep breath and decided go straight to the point, not giving Ling Xiao an opportunity. “A few hours ago, Qiao WuXing and Jiu Ye came over. Most likely their masters told them to come, and their purpose was to tell me about one of XiaoYao Institute’s special rules.”</p><br/><p>“One who is unaccountably solicitous is hiding evil intentions,” Ling Xiao assessed, finally stopping his hand movements, straightening the clothes in front of his chest with some regret. “It must have something to do with the Spiritual Water.”</p><br/><p>“Yes…” You XiaoMo was a little put out. He hadn’t even told him about the content of the special rules, yet Ling Xiao had actually guessed it. Wasn’t he just trying to deliberately infuriate him? After that he used an unhappy tone to generally describe the situation to him.</p><br/><p>Ling Xiao placed his chin on You XiaoMo’s shoulder. “Let’s not talk about their purpose, what are you hesitating over?”</p><br/><p>You XiaoMo said haltingly, “Didn’t you say before that if I went above the 70th floor, you couldn’t go up with me anymore?”</p><br/><p>Ling Xiao was staring fixedly at his collarbone. When he heard this, he answered, “Idiot, I can’t go up, but can you not come out to find me? It’s not as if XiaoYao Institute has rules saying that their students must live in Giganticus.”</p><br/><p>Two large words flashed in You XiaoMo’s mind: day school!</p><br/><p>Cold sweat involuntarily dripped down. He had almost forgotten that in his previous life, he had also gone to a high school with a day school system. His only regret had been that if he went up, Ling Xiao wouldn’t be able to live in Giganticus anymore, and without his student ID, Ling Xiao also wouldn’t be able to enter.</p><br/><p>“Then what should we do about the Spiritual Water thing?”</p><br/><p>The circumstances that Jiu Ye had talked about was only a possibility. There was no need for the teacher he challenged to actually not refine a one-color pill, so he also had to consider this kind of situation and come up with countermeasures before responding.</p><br/><p>“No matter how much you promote a level ten magic pill you still can’t turn it into a rainbow pill.” Ling Xiao pondered. “Whether a rainbow pill can be a rainbow pill mostly depends on its ingredients. Every magic herb has its restrictions. If you could change the level of a magic herb just by depending on an outside object, then people wouldn’t have to differentiate magic herbs by levels.”</p><br/><p>“I understand.” You XiaoMo suddenly slapped down his hand. “The reason that a level ten low grade magic pill can use Spiritual Water to be promoted to a level ten medium grade magic pill is because the ingredients that they use are all level ten magic herbs, so they’re on the same rank. A magic pill’s grade can be promoted, but it’s not possible if you want to surpass a magic pill’s level. For example, for a level ten high grade magic pill to be changed into a one-color pill, in theory this cannot be achieved by using an outside object, correct?”</p><br/><p>“Correct!” Ling Xiao bit his earlobe once as a reward.</p><br/><p>You XiaoMo hastily moved his head away. He didn’t want this kind of reward.</p><br/><p>Ling Xiao laughed. “Qiao WuXing and Jiu Ye’s master surely can also think of this scenario, or perhaps they’ve already tested it before. So if you accept the challenge, that teacher definitely won’t refine a one-color pill.”</p><br/><p>In reality, it wasn’t just this.</p><br/><p>If the teacher refined a one-color pill, then the special rules couldn’t be called special rules, but rather death rules. There was no need to establish special rules that didn’t give students a chance of success.</p><br/><p>At that moment, You XiaoMo had a feeling as if he had pushed apart the clouds and seen the blue sky.</p><br/><p>No wonder Jiu Ye said that the teacher usually wouldn’t refine a one-color pill. This was the real reason, and if this happened, then he had about a 70-80% chance of success, if he remembered back to when he refined a high grade magic pill even as a mage who could only make low grade pills during the assessment at DaoXin Academy.</p><br/><p>Although the levels of the magic pills were different now, and the degree of difficulty would also increase by a lot, he trusted that he could still leap over one grade.</p><br/><p>“Okay, the problem has been resolved. Let’s go to bed and do important things.” Ling Xiao scooped him up. The sun had just set, so now they could do things that were supposed to be done at night.</p><br/><p>It was only when he was placed on the bed that You XiaoMo remembered the matter that he had been repeating in his mind since the morning. This was more important. “I have some business that’s even more important.”</p><br/><p>“Is your business more important, or is my business more important?” Ling Xiao narrowed his eyes.</p><br/><p>You XiaoMo swallowed, and said, unafraid of death, “Mine is more important.”</p><br/><p>“Say it again.”</p><br/><p>“…yours is more important.”</p><br/><p>“Good.”</p><br/><p>The dusk rose high in the sky, and by the time Giganticus sank into an expanse of darkness, when the sound of the creaking bed and cries of ecstasy finally stopped in a certain room, it was already late at night.</p><br/><p>You XiaoMo laid on top of Ling Xiao’s body, completely naked, and his smooth, pale back was dotted with blue and purple spots, revealing the fierce situation that had just taken place. Underneath the blanket, the place where the two of them were joined still hadn’t separated yet.</p><br/><p>You XiaoMo shook his fingers and said, unwaveringly, “I have something important to ask you.”</p><br/><p>Ling Xiao had a face full of satisfaction, and he patted his head and smiled. “Go ahead.”</p><br/><p>You XiaoMo sniffled, this was too miserable!</p><br/><p>“That Sealed Jade Drive…”</p><br/><p>Ling Xiao was silent for a few seconds, as if he was remembering what the Sealed Jade Drive was, before he felt around for the Sealed Jade Drive he had dropped into his ring dimension. “Are you talking about this thing? I forgot to undo it.”</p><br/><p>Tears streamed down You XiaoMo’s cheeks. He just knew that Ling Xiao forgot.</p><br/><p>By now Ling Xiao was already a Sacred Realm expert, but the opponent was also clearly an expert with high-level cultivation. If they wanted to undo the seal that he made, it truly wouldn’t be easy. They would very likely attract the attention of experts hidden in XiaoYao Institute, so Ling Xiao held You XiaoMo and directly entered his dimension.</p><br/><p>(Ra: Boss’s priority: Make love &gt; everything. Poor MomoAddis: Legit feel sorry for Momo. No wonder he’s the wife. He doesn’t have any balls to stand up for himself.)</p><br/>\n</div>"}