{"title": "Chapter 527", "id": 527, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-527", "volume_title": "Volume 6", "body": "<h1>Chapter 527</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 527: Alleviation and MatingTranslated by Jouissance of Exiled Rebels Scanlations</p><br/><p>The air was heavy around them. Most of the men wore expressions of contemplation, a few looking like they had just eaten shit.</p><br/><p>For example, that Tian Hen guy looked like he had just been scammed, knowing that Ling Xiao left with that Uncle Gu. He suddenly harrumphed and set his feet on the table in s displeased manner.</p><br/><p>“I’ll admit that I’m not as strong as he is, but so what if he’s Sacred Level? It isn’t like TianGou has no Sacred level elites. Tian Gui is also level twelve. If he can beat Tian Gui, then that’s really something.” Tian Hen suddenly took on a very sloppy demeanor, like a street thug.</p><br/><p>You XiaoMo couldn’t help but stare. This guy gave him the same feeling the old man did, like he had multiple personalities.</p><br/><p>“Tian Hen, be careful of what you say,” Tian Yuan suddenly said, half admonishing.</p><br/><p>Tian Hen understood what Tian Yuan was trying to say. He glanced at You XiaoMo and suddenly took his feet off the table, staring at him with amusement. “Brat, do you think I’m right?”</p><br/><p>You XiaoMo didn’t expect the other would talk to him. He took a moment to process this before saying, “Oh, what you just said would usually be right.”</p><br/><p>“What do you mean usually?” Tian Hen scowled.</p><br/><p>You XiaoMo pouted, saying disapprovingly, “The situation you’re talking about might apply to most people, but not all. Some people are special.”</p><br/><p>Tian Hen smiled and said, “So you mean your man should be treated specially?”</p><br/><p>Hearing him say ‘your man’, You XiaoMo’s face flushed involuntarily. He composed himself and said, “Of course. Not everyone is alright with being treated as ordinary like you are.”</p><br/><p>Tian Hen’s expression chilled. “Brat, what did you say?” The intensity of his presence seemed to be about to explode with his rage,</p><br/><p>You XiaoMo stayed unfazed. Don’t forget, he was already a grade one rainbow level, though he wasn’t to the other’s level yet.</p><br/><p>“Tian Hen, stop messing around,” Tian Dao said lightly.</p><br/><p>Tian Hen huffed.</p><br/><p>You XiaoMo smiled in triumph. If you dared to diss Ling Xiao in front of him, then you had better prepare to be roasted. Plus, he wasn’t wrong, there was nothing amazing about a three star defeating a one star.</p><br/><p>“The one who stole stalks of magic herbs from my room was you, right?” The silent Tian Xiu suddenly spoke up, his deep, dark eyes calmly gazing at You XiaoMo. When he said this, he was completely expressionless, you couldn’t tell what he was thinking at all.</p><br/><p>“Yo, so you’re a thief.” Tian Hen finally found a way to turn the tides on You XiaoMo, mocking the other mercilessly upon hearing Tian Xiu’s words.</p><br/><p>You XiaoMo glanced at him like looking at a child throwing a tantrum before looking back at Tian Xiu and explaining, “I didn’t steal them. I exchanged them with other magic herbs. You aren’t worse off at all since I exchanged high-grade magic herbs for your mid-grade ones.”</p><br/><p>Tian Hen said with triumph, “Taking without asking is thieving.”</p><br/><p>You XiaoMo huffed, “I refuse to believe that you haven’t done the same.”</p><br/><p>Tian Hen was at a loss for words. He really couldn’t refute that. Tiangou’s members were all people who followed their whims. To be honest, the amount of times they had thieved would only be high.</p><br/><p>Tian Ming, spectating this from one side, almost burst into laughter. This was the first time he had seen Tian Hen in such a state of speechlessness. He had been verbally beaten twice.</p><br/><p>“I won’t pursue the act of exchanging magic herbs, but you broke my Restriction Barrier and touched my books…” Tian Xiu didn’t sympathize with Tian Hen, he only cared about Leisure Pavilion.</p><br/><p>You XiaoMo said, “How would I know that your Restriction Barrier would be so easily broken? You can’t blame us for this, only your own Restriction Barrier, for not being strong enough.”</p><br/><p>“He sure knows how to twist his words,” Tian Yuan said, unable to hold back laughter.</p><br/><p>“He wouldn’t be able to make Tian Hen so speechless otherwise.” Tian Ming started laughing, unable to hold back any longer.</p><br/><p>Tian Hen glared at him hatefully.</p><br/><p>Tian Xiu didn’t get angry, just said, emotionlessly, “If I’m not wrong, it was Golden Winged Insects that ate through the Restriction Barrier around Leisure Pavilion, right?”</p><br/><p>You XiaoMo looked at him in shock. This person could guess that it was the Golden Winged Insects just from a hole?</p><br/><p>Seeing his expression, Tian Xiu knew that he had hit the mark. “That clearly wasn’t something a person could do. Plus, the only creature that can bite through a Restriction Barrier without being detected is the legendary Golden Winged Insect.”</p><br/><p>Everyone looked at You XiaoMo in shock.</p><br/><p>Golden Winged Insects were beyond rare, even in Xi Jing. This was the kind of thing one could only see in ancient times.</p><br/><p>You XiaoMo didn’t bother hiding it now that the cat was out of the bag. The clothes near You XiaoMo’s chest moved suddenly and then two Golden Winged Insects flew out, circling for a while before landing on You XiaoMo’s head.</p><br/><p>“You have two?” Tian Ming exclaimed in shock. He had thought there was only one, because one was impressive enough.</p><br/><p>You XiaoMo smirked with delight. “They’re my contract beasts. The male is called Xiao Ping and the female is called Xiao Pong.” As he said his, he waved the two down and had them land on the table.</p><br/><p>Tian Men and Tian Yang, who were closest to You XiaoMo, stretched their necks to take a closer look at the two Golden Winged Insects, barely larger than their thumb. This sort of demon beast was only ever seen in books, not reality.</p><br/><p>“Golden Winged Insects, as expected, and they’re of very pure coloration.” Tian Men said.</p><br/><p>According to what he had read about the Golden Winged Insects, they were golden on the outside, but not all of them were pure gold. Some were tainted with other colors. Though these kinds of Golden Winged Insects cold also produce golden thread and eat through seals, they weren’t nearly as overpowered as the ones from the legends.</p><br/><p>This was because those tainted with other colors had a limit to their power. For example, their golden threat wasn’t unbreakable like in the the legends, and had an expiration date, so one had no way of knowing when it would stop working.</p><br/><p>As for seals, they cold only eat through weaker ones.</p><br/><p>Even so, there were still people who raised those impure Golden Winged Insects and sold their golden threads for an exorbitant price.</p><br/><p>Under these circumstances, it further emphasized how valuable the pure Golden Winged Insects were.</p><br/><p>“Have they produced silk yet?” Tian Xiu asked.</p><br/><p>You XiaoMo raised an eyebrow. “Not yet. Is there a problem?”</p><br/><p>Tian Hen suddenly cursed. “Fuck, that’s a true treasure!”</p><br/><p>You XiaoMo realized that everyone was staring at his Ping Pong like they were invaluable treasures, almost like they could shoot lasers from their eyes.</p><br/><p>Tian Xiu explained, “Most people know that just one Golden Winged Insect can produce golden silk, but they don’t know that the silk produced together by a male and a female is ten times as durable. It’s not unexpected though. Golden Winged Insects were extremely rare even in ancient times. Nowadays, never mind a male and a female, just getting one is extremely lucky.”</p><br/><p>You XiaoMo’s eyes shone. He really hadn’t known this, but… “What does that have to do with having produced golden silk before or not?”</p><br/><p>The had noticed what the man called Tian Xiu had specifically asked about.</p><br/><p>“Of course it does.” Tian Hen interrupted, sounding displeased. “Only Golden Winged Insects that have never produced golden silk before can produce golden silk ten times as durable. And they must be a pair, one male and one female.”</p><br/><p>No wonder he had called them a treasure just now.</p><br/><p>You XiaoMo hurriedly asked, “Then how do I let my Golden Winged Insects create silk ten times as strong?”</p><br/><p>“Mating,” Tian Ming drawled out the word slowly.</p><br/><p>Tian Hen glared at him, as if admonishing him for stealing his lines.</p><br/><p>Tian Ming calmly waved his fan.</p><br/><p>You XiaoMo was puzzled. He had only heard of animals mating to produce offspring. He had never of them mating to produce golden silk. Was golden silk sentient or something?</p><br/><p>“Uh, can they really produce golden silk from mating? Where does their offspring come from?” You XiaoMo couldn’t help but ask.</p><br/><p>Tian Hen mocked him, “You really are stupid.”</p><br/><p>Tian Ming chuckled. “You don’t have the right to say that. You asked this, too.”</p><br/><p>Tian Hen slammed the desk, yelling back, “Stop pushing this to me. It was you who egged me on to ask. If you really want to consider it, you’re involved as well.”</p><br/><p>“Unusual things really do happen every year, especially this one!” Tian Yuan suddenly laughed. “This is the first time I’ve seen someone so eager to admit they’re stupid.”</p><br/><p>Tian Hen and Tian Ming immediately stopped talking, looking towards Tian Yuan with smiles that weren’t quite smiles.</p><br/><p>Tian Yuan smiled, shutting up as well.</p><br/><p>“Golden Winged Insects don’t have offspring. They’re all metamorphosed from the Hidden Dipper Stink Bugs. Once they die, their population will decrease.” Tian Xiu said expressionlessly. Though he was stoic like Tian Dao, they had different personalities. He was used to maintaining a cold face, like he didn’t care about anything. Meanwhile, Tian Dao really was just calm and quiet, used to not giving away his thoughts. Thus why Tian Dao was their general.</p><br/><p>“I have a question,” You XiaoMo said.</p><br/><p>The tension that had thickened the air began to dissipate.</p><br/><p>Tian Xiu said, “Speak.”</p><br/><p>You XiaoMo cleared his throat, saying, “I just wanted to ask. After my Golden Winged Insects mate, can they immediately produce the golden silk or is it like pregnancy, and we won’t know when they’ll be hit?”</p><br/><p>If it’s the latter, how did he tell if Xiao Pong was pregnant?</p><br/><p>The room went silent for a few seconds.</p><br/><p>Tian Xiu deadpanned an explanation. “It has nothing to do with pregnancy. Every time Golden Winged Insects mate, they’ll be able to spit out golden silk. However, according to the data, they don’t have any sort of mating season, so no one knows when they’ll feel like mating.”</p><br/><p>You XiaoMo raised his hand. “Last question.”</p><br/><p>Tian Xiu motioned for him to speak.</p><br/><p>You XiaoMo rubbed his nose, saying, “Do Golden Winged Insects spit out their golden silk from their Chrysanthemum?”</p><br/><p>Tian Xiu stopped speaking and the others also fell silent. Two minutes later, Tian Hen couldn’t help but ask, “….What’s a Chrysanthemum?”</p><br/><p>You XiaoMo was shocked. “You guys don’t know?”</p><br/><p>Tian Hen replied, “Should we know?”</p><br/><p>You XiaoMo blurted out, “It’s your asshole!”</p><br/><p>BANG!</p><br/><p>!</p><br/><p>!</p><br/><p>What replied him was Tian Hen falling off his chair in a most ugly fashion, creating a huge noise. Apart from Tian Xiu and Tian Dao’s tense looks, everyone else looked like they had been struck by thunder, looking at You XiaoMo in utter disbelief.</p><br/><p>Or, it could be understood as, when You XiaoMo said this, everyone definitely clenched their butts.</p><br/><p>At this time, the man and Ling Xiao had finished their talk and were returning. Seeing this upon entering, the man looked shocked while Ling Xiao looked to You XiaoMo, having the feeling that it was was definitely his wife who had created such a scene.</p><br/><p>“What happened with you guys?” The man asked in surprise.</p><br/><p>“Nothing!” Everyone replied simultaneously.</p><br/><p>The man didn’t believe it. It was clear something was wrong. He looked to You XiaoMo, who was the only one with a normal expression. “Could you tell me what happened?”</p><br/><p>“Ah!” You XiaoMo nodded, agreeing, “It’s like this…”</p><br/><p>Tian Ming immediately ran out.</p><br/><p>With someone setting an example, the others naturally wouldn’t stay and be humiliated, all finding excuses to run off.</p><br/><p>In the end, only Tian Xiu and Tian Dao remained of the eight. The two stoics seemed calm, but no one knew what they were thinking inside.</p><br/><p>The more they were like this, the more the man felt that something was up. He looked to You XiaoMo, motioning for him to continue speaking.</p><br/><p>You XiaoMo felt that they were all making a big deal out of nothing. It was very normal that Chrysanthemum meant asshole, and it was far more civilized to say Chrysanthemum than asshole. He didn’t realize that the point wasn’t that Chrysanthemum meant asshole, but that he had said “your asshole”. With the first word, this sounded entirely different.</p><br/><p>However, You XiaoMo was rather impressed with Tian Xiu and Tian Dao who hadn’t fled. Seeing their tense expressions, he thought for a moment and said, smiling, “Nothing really. I was just asking them some questions about Golden Winged Insects.”</p><br/><p>He could almost see Tian Xiu and Tian Dao’s inner sighs of relief.</p><br/>\n</div>"}