{"title": "Chapter 524", "id": 524, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-524", "volume_title": "Volume 6", "body": "<h1>Chapter 524</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 524: Refining Pills and Communication</p><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>When Ling Xiao returned, he did not find You XiaoMo in the Pill Refining Room. Taking his time, he walked to the Study. Sure enough, laying on the table while staring intensely into a book was You XiaoMo. Ling Xiao walked behind him, but didn’t call out.</p><br/><p>Suddenly, You XiaoMo let out a yawn and his focus shifted from the books. He straightened his back and twisted his hip to relieve the tiredness he had gotten from reading too long.</p><br/><p>Ling Xiao stared at his hips, which were shaking.</p><br/><p>Then, You XiaoMo had another feeling of being stared at, but this time it was different from when they passed the Demon Beast Graveyard. He felt no ill intent but rather a burning sensation.</p><br/><p>You XiaoMo slowly turned his head and the sudden appearance of a certain someone scared the hell out of him as he fell onto the table. His heart was pounding so much that no words came out.</p><br/><p>Taking advantage of the situation, Ling Xiao laughed teasingly, “Wife, you really know your husband well.”</p><br/><p>Just as You XiaoMo had calmed down his freaking-out heart, someone’s unruly, but also passionate hands were already creeping up his shirt, agitating him and making his heart pound.</p><br/><p>“Don’t you dare try something funny!” Once You XiaoMo remembered that they were in someone else’s territory, he immediately shooed off any unwanted thoughts and pulled Ling Xiao’s hands off if him.</p><br/><p>Ling Xiao held a face of disappointment.</p><br/><p>You XiaoMo tidied himself up and proceeded to switch the topic, “Have you found Uncle Gu yet?”</p><br/><p>Ling Xiao replied, “No, it looks like he went out for something and won’t be back for a few days. He’s probably the only one who knows the answer to what I want to ask, so we can only wait here for a few days.”</p><br/><p>“Then what about PiQiu and the others?”</p><br/><p>“I didn’t see them either, they may not be at the Weeping Ghost Shore but instead cultivating somewhere else in the Ghost Tomb Mountain Range.”</p><br/><p>“Oh, then let’s wait for your Uncle Gu to come back and then ask him.”</p><br/><p>Luckily, the master of the Leisure Pavilion wasn’t going to be back for another month or so and the other members couldn’t get into the Forbidden zone. Also the Restriction Barrier prevented their presence from being sensed, thus this was currently the safest place for them.</p><br/><p>You XiaoMo returned to his seat and flipped through the book in front of him, hopelessly bored.</p><br/><p>From the book he was reading, he noticed a familiar last name. It seemed that the You Family had also participated in that great war during the ancient times and had a few epic powerhouses.</p><br/><p>However, the You Family was not called the Vermillion Blood Clan before and didn’t have that many side families. Regardless of their legitimacy, they were all considered as part of the You Family.</p><br/><p>Unfortunately, the You Family lost many powerhouses in that fight and went into decline. Not only that, those who had survived were almost all from the side families.</p><br/><p>The current You Family members were not nearly as ‘legitimate’ as those of the ancient past. Most of them were from side families of the ancient You Family and along with many later reasons, even the main branch of the Vermillion Blood Clan were not very ‘legitimate’.</p><br/><p>However, the exact reasons were not detailed in this book.</p><br/><p>What You XiaoMo saw was a few reminders given by their descendants.</p><br/><p>Ling Xiao seemed to be interested in the books on the shelves too and pulled one out at random. When You XiaoMo glanced over at it, he was rendered speechless, it was something akin to a joke book.</p><br/><p>His first reaction was that even in this dimension there was things like joke books?</p><br/><p>You XiaoMo observed Ling Xiao for five minutes straight only to discover that his expression had remained completely unchanged. After a while he got bored and returned the history book to its shelf then hurried to the Pill Refining Room.</p><br/><p>In the end, only the Pill Refining Room was his one true love!</p><br/><p>You XiaoMo was itching for the transcendent level magic herbs at the top of the magic herb cabinet. So, it wasn’t until his eyes became red did he quietly retracted his gaze to sit butt first onto the floor, pulling out that red jade drive.</p><br/><p>To prevent the jade drive from being lost, he had copied all of the pill recipes onto a different jade drive. Since the two jade drives had different storage capacities, he could only fit the high-grade and transcendent level pill recipes in the new one.</p><br/><p>After he finished that, You XiaoMo put back the red jade drive and began digesting all of the transcendent level recipes.</p><br/><p>Before refining pills, one must memorize the pill recipes to heart, otherwise, it could also cause the process to fail. Therefore, it was a critical step.</p><br/><p>Transcendent level recipes and high-grade recipes had one major difference.</p><br/><p>There weren’t many more magic herbs added but some recipes had forty to fifty more steps. That was because more of the magic herbs had to be split into parts before they were able to be mixed with the other herbs; some had unique handling methods and so on. Therefore, its difficulty was two or three times more than that of a level ten magic pill.</p><br/><p>You XiaoMo deeply believed that if this was to occur on Earth, if one didn’t have a photogenic memory, it was impossible. The failure rate was probably going to go straight up.</p><br/><p>You XiaoMo picked out a few first grade rainbow level recipes but his gaze, uncontrollably brushed over the jade cabinet. Although he had some transcendent level magic herbs in his dimension, it wasn’t enough for any of the recipes.</p><br/><p>He wondered if he could make a trade?</p><br/><p>You XiaoMo thought fancifully.</p><br/><p>The magic herbs he got from the cave behind the Hu Village had already dropped seeds. Once he had the seeds, he didn’t need to worry about not having stock anymore.</p><br/><p>In the end, You XiaoMo couldn’t resist the temptation and got a stool to step on it.</p><br/><p>All of the transcendent level magic herbs in the jade cabinet were of mid-grade quality, none of the high-grade ones. Those ones were probably on the person who owned this room.</p><br/><p>You XiaoMo got out a few high-grade magic herbs and one that wasn’t even in the cabinet, then he took a few stalks of magic herbs that he needed. Although he was taking without permission, but exchanging high-grade magic herbs with mid-grade ones, even if the owner knew, he wouldn’t have anything to say, right?</p><br/><p>Too bad there wasn’t any seeds though.</p><br/><p>Just as You XiaoMo finished sighing, from the corner of his vision he suddenly saw an opened cabinet. At the base of it was a few black seeds lying quietly, could it be magic herb seeds?</p><br/><p>One of his paws slowly crept over with a guilty conscience…</p><br/><p>“What are you doing?” Ling Xiao’s voice suddenly appeared by his ears.</p><br/><p>Taken by surprise, You XiaoMo almost fell off the chair and was pulled back by Ling Xiao quick reflexes. You XiaoMo said with reproach, “I’m the one who wants to ask you, what are you doing? Just how many times a day do you want to scare me before you’re satisfied.”</p><br/><p>Taking no mind of it, Ling Xiao asked, “If you weren’t feeling guilty, would still you get scared by me?”</p><br/><p>You XiaoMo replied with confidence, “I have no guilt whatsoever. I did exchange them with magic herbs, even high-grade ones. I’m the one who taking a loss here, even if I got a seed with it, it shouldn’t matter.”</p><br/><p>Ling Xiao sneered, “When I suggested it to you earlier, who was the one who rejected my proposal and now you changed your mind? Didn’t you say you already had someone help you find the magic herbs?”</p><br/><p>“Any, anyhow, I was bored okay? I thought might as well scrape together enough ingredients for a pill recipe and try to make a rainbow pill.” You XiaoMo averted his eyes, feeling guilty.</p><br/><p>“Then, did you scrape together one?” Ling Xiao lifted him off his chair.</p><br/><p>Quickly, You XiaoMo grabbed the seed and nodded stupidly while holding on to a few stalks of magic herbs, “Just enough for one.” There weren’t many magic herbs stored here by its owner, the most he could do was one recipe.</p><br/><p>Since the Pill Refining Room was closer to the outside, if someone came by accident, they would discover it, thus You XiaoMo carried the magic herbs and went with Ling Xiao to the study. The study had enough space so they just needed to be a bit careful.</p><br/><p>Although refine pills in other people’s territory was something unimaginable, You XiaoMo did it anyways.</p><br/><p>You XiaoMo took out all of the magic herbs as well as the Heavenly Cauldron.</p><br/><p>Other than the dozen of transcendent level magic herbs, the others were all level nine or ten herbs. The cost was actually quite high, but the good thing was that he had all of them in stock in his dimension.</p><br/><p>He then used the next two hours to organize his mental state, an hour and a half more than usual, before starting to refine pills. From that, you could tell he was serious.</p><br/><p>Then, he threw all of the level nine magic herbs into the cauldron. When he took out most of the impurities, he then followed the recipe to split the green magic herb liquid to sections. After that, he threw all of the level ten magic herbs in. Up till now, his movements were very smooth and fluid.</p><br/><p>Only when he finished extracting the essences from the herbs, other than the transcendent level ones, did he allow himself to relax a little. When he regained his composure, You XiaoMo got out the last eleven herbs and distilled them in three steps.</p><br/><p>Due to the different qualities of the magic herbs, the effects would greatly vary as well. Therefore, the difficulty level would be higher than normal, he would have to be more careful too.</p><br/><p>This time, just extracting four mid-grade magic herbs took him six hours and his Soul Power was depleting at an alarming rate too.</p><br/><p>Ling Xiao didn’t know anything about refining pills but he found that this time, You XiaoMo was sweating more than he ever had. Even his clothes was drenched in sweat.</p><br/><p>After a bit of hesitation, he decided against wiping it away since he didn’t want to take the blame if he failed.</p><br/><p>A day had gone by before You XiaoMo finished extracting all of the magic herbs.</p><br/><p>Staring at the magic herb liquid, which was quietly floating in the cauldron, You XiaoMo finally let out a sigh of relief and wiped his forehead from sweat.</p><br/><p>The mental and Soul power he needed for making a rainbow pill was more than he had expected. He had almost given up in the middle so it was a good thing that Ling Xiao didn’t help him wipe off the sweat or he might have actually been distracted.</p><br/><p>However, what was really painful was that before he even began refining the pill, he was already half dead.</p><br/><p>Refining pills really took a lot of willpower. He had painstakingly made it through the first day and now he really couldn’t fail, otherwise he would have not only wasted all of the magic herbs but also his efforts.</p><br/><p>You XiaoMo once again braced himself.</p><br/><p>The process for refining took longer than anticipated for the both of them. As it was the first time refining a rainbow pill, You XiaoMo didn’t dare multi-task like usual. He took it step-by-step and was very careful at each one. With intense concentration, even if the time increased, the success rate was secured.</p><br/><p>However, the situation outside wasn’t proceeding like they had planned, because Lin Gu had returned. Not only that, the owner of the pill room, Tian Xiu, also came back early.</p><br/><p>Pill recipes for rainbow pills were hard to find, especially higher grade ones, they were almost extinct. Not only that, even if they had it, they wouldn’t give it away and those people were usually one of power, so you couldn’t even take it by force. It did seem like Tian Xiu had those intentions.</p><br/><p>The members of TianGou once again gathered at the Smile Pavilion.</p><br/><p>Tian Dao stood up and said to the man at the seat of honor, “Leader, there is something I want to report, it about the ‘young master’, he still hadn’t arrived yet.”</p><br/><p>The man raised his eyebrows, “That’s weird, he said that at most it was going to take him ten days to find the Weeping Ghost Shore.” It was because of that did I hurry back today, just to see him. Afterall, he had something important to say.”</p><br/><p>“Leader, everyone can talk big, aren’t you thinking too highly of the ‘young master’?” Hearing the head, Tian Hen stopped cleaning his dagger and said jokingly.</p><br/><p>“He’s a man of his words, unless there was something that held him up.” The man wasn’t surprised at all by his comment. He had never thought that his subordinates would acknowledge someone they had even met before, but he also didn’t believe that someone he raised would break a promise without even a word.</p><br/><p>Tian Dao suggested, “Leader, maybe you can try contacting him again, afterall, we can’t all wait here at the Weeping Ghost Shore for one person.”</p><br/><p>“Alright.” The man accepted without hesitation because he wanted to know the reason too.</p><br/><p>Members of the Qilin Clan, especially those who were closely related, would have a special communication method between them. Although the man wasn’t of the Qilin Clan, Ling Xiao’s father was.</p><br/><p>By using the blood of a family member, and some Life Blood, they could set up a special communication device. As long as they were not of different planes of dimension, they could communicate. Also, the shorter the distance, the clearier the message.</p><br/><p>The man took out the Blood Jade. The Blood Jade was like a transmitter stone, but one couldn’t talk directly into it. What one had to do was hold the jade tightly with one hand and using one’s mind to communicate.</p><br/><p>As Ling Xiao was watching You XiaoMo refine pills, he suddenly felt the movements of the Blood Jade.</p><br/>\n</div>"}