{"title": "Chapter 522", "id": 522, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-522", "volume_title": "Volume 6", "body": "<h1>Chapter 522</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 522: Venturing into the Human Skull Peak</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>You XiaoMo let You JunQi out based on his words after that conversation. His real intention was to get him to scram as far as possible, but You JunQi was as sticky as a dogskin plaster and was unable to be torn off no matter what.</p><br/><p>You JunQi had actually long known that You XiaoMo was his son, yet he did not say it and still wanted to seize the opportunity to stick to him like a leech. Not a chance!</p><br/><p>Therefore, You JunQi, who had just been released not long ago, was shut back into the dimension by an extremely irritated You XiaoMo.</p><br/><p>However, it was a little different this time as You JunQi actions were entirely voluntary. The son was angry, so the father had to go face the wall.</p><br/><p>The Ghost Tomb Mountain Range was more spectacular in the day rather than at night. Bare reddish brown peaks and black brown peaks were criss crossing as far as the eye could sew, each tall enough to touch the sky.</p><br/><p>You XiaoMo and Ling Xiao stood at the foot of the mountain and the two looked particularly small against the backdrop.</p><br/><p>“So how are you going to call them out?” You XiaoMo excitedly looked at Ling Xiao. Ling Xiao had said last night that he could make the members of the Tiangou appear on their own even without looking for them.</p><br/><p>“You just watch.”</p><br/><p>Ling Xiao walked a few steps forward. The aura from his body did not have the slightest change. You XiaoMo only saw him turn his palm up and a wisp of flame that appeared to be purple red in color suddenly jumped from the hollow of his palm. It was the combination of the Qilin Sacredfire and Demon Phoenix Sacredfire. The flame slowly melted into a ball of fire, emitting a temperature that was even hotter than the sun.</p><br/><p>You XiaoMo looked at this scene in shock. Ling Xiao couldn’t be thinking of blasting the mountains ba?</p><br/><p>Ling Xiao’s next actions quickly informed him of whether his notion was true or false. The very first mountain peak to suffer a calamity was not the one closest to them, but the peak that was situated together with others to form a enormous mountain.</p><br/><p>The rolling heatwave was like a giant sickle as it chopped halfway up the mountain. The ground started rumbling as the earth split open in the wake of boulders tumbling down from the mountain. The mountain tilted towards the next peak as it collapsed and the clamour from the landslide and split earth was enough to attract the attention of the powerhouses.</p><br/><p>However, Ling Xiao did not stop there. A dragon roar akin to a shockwave resounded in the skies, rousing countless black crows that were perching on the mountain peak from their sleep, causing them to drop down the mountain while cawing in startlement.</p><br/><p>You XiaoMo’s ear drums nearly burst from the dragon roar even though he was standing behind Ling Xiao.</p><br/><p>After doing all this, Ling Xiao did not even pause as he immediately embraced You XiaoMo and the two disappeared together from their original place without leaving a single trace of aura.</p><br/><p>A moment later, without any interruption in their consciousness that was performing a search, the demon beast and human practitioners lurking in the Ghost Tomb Mountain Ranges emerged near the scene one after another. When they ‘saw’ what the scene that Ling Xiao had created, each and every one gasped.</p><br/><p>To avoid attracting trouble, a portion of the people who treasured their lives left the scene.</p><br/><p>They were under the impression that this was caused by the members of the Tiangou because the area was in the Tiangou’s territory, and they were the only ones who had the ability to do this.</p><br/><p>Moreover, it was a well-known fact in the Ghost Tomb Mountain Range that the members of the Tiangou were very fond of fighting.</p><br/><p>However, they did know that the members of the Tiangou also appeared on this piece of land eight minutes later.</p><br/><p>The white robed man they had met a few days ago alighted on the area that Ling Xiao had been standing at. He looked at the two collapsed mountain peaks and frowned as his hand gripped the shaft of the fan, and immediately commented with great interest, “This is strange. Everyone knows that this is the territory of Tiangou and they actually dared to make a move here. Is this a provocation?”</p><br/><p>It was no big deal if there were only two collapsed mountain peaks. The crucial point was that dragon roar because the other party seemed to be roaring straight in the direction of the Weeping Ghost Shore.</p><br/><p>The two of them happened to be some distance ahead and were intending to return to the Weeping Ghost Shore, but turned back upon hearing the roar.</p><br/><p>“It doesn’t matter whether it was the same person who did the provoking or not. It’s only just a guy who hid the head and showed the tail.” The black robed man impatiently grumbled, “Tian Dao asked us to go back as soon as possible. Are you coming or not?”</p><br/><p>The white robed man shrugged his shoulders, “All right, I’ll ask another question. What do you think Tian Dao called us back for?”</p><br/><p>The black robed man was clearly more interested in this question as he sneered, “What else can it be? It seems that young master of ours is coming back ba.”</p><br/><p>When he spoke those two words ‘young master’, the tone of the black robed man obviously contained traces of disdain.</p><br/><p>“I didn’t get to meet him last time, I’m rather looking forward to it this time.” The white robed man beamed. Although he did not directly express his unhappiness like the black robed man, his sentence of ‘looking forward’ was spoken very serenely, as if he was somewhat unconcerned.</p><br/><p>With that, the two set out back to the Weeping Ghost Shore.</p><br/><p>They did not return to the Weeping Ghost Shore immediately after leaving White Bone Town last night.</p><br/><p>The two people did not realise that the ‘young master’ they were speaking of in disdain was noiselessly following behind them.</p><br/><p>The Weeping Ghost Shore was situated at the highest peak in the Ghost Tomb Mountain Range, similar to an overlooking platform. One was practically able to take in a panoramic view of the Ghost Tomb Mountain Range all at once.</p><br/><p>However, the members of the Tiangou did not catch sight of Ling Xiao and You XiaoMo. No matter how skilled they were, it was impossible to look through the overlapping mountain peaks and see the two standing at the foot of the mountain.</p><br/><p>After fifteen minutes.</p><br/><p>The white robed man and the black robed man alighted on different mountain peaks. Not far from where they alighted was the Weeping Ghost Shore, but they did not go over immediately.</p><br/><p>The white robed man took out a small jade tablet, and hurled it at a mountain peak on his left. Two seconds later, the scenery in front of him suddenly changed.</p><br/><p>The mountain peak was still as bare as before. What changed was the position and the number of mountain peaks. A perspicacious person would be able to tell with one look that this was a integration of formation and restriction arrays. However, there was not the slightest change in the highest peak.</p><br/><p>The white robed man and black robed man rapidly dashed inside because it would only open for three seconds. If they did not enter in time, they would be shut outside. At that time, they could only ask for help from the people inside. For the members of the Tiangou, it was an extremely embarrassing matter.</p><br/><p>Three seconds was more than enough for Ling Xiao.</p><br/><p>There was still two seconds left after the white and black robed men entered.</p><br/><p>With one and a half a second to close the distance, the last half second was just enough to enter the restriction that was closing. As they were in a rush to gather, the two completely did not realise that two outsiders had already snuck into their territory.</p><br/><p>After entering the restriction, Ling Xiao did not immediately ascend to the Weeping Ghost Shore. From the conversation between the white and black robed men, none of the members of the Tiangou, besides Gu Lin, welcomed him, so it was not necessary to strut about in front of them at this time.</p><br/><p>You XiaoMo who had wanted to jump down from Ling Xiao’s hold, raised his head for a look and nearly cried out in surprise.</p><br/><p>With sharp eyes and agile hands, Ling Xiao covered his mouth, followed his line of sight, and immediately felt that he was making a fuss about nothing.</p><br/><p>You XiaoMo hinted for him to remove his hand.</p><br/><p>The mountain peak that the Weeping Ghost Shore was situated at had a name. The name was a little horrifying and it was called the Human Skull Peak. It was very famous in the Ghost Tomb Mountain Ranges. However, few knew the location of the Human Skull Peak and had only heard that there was a mountain peak which looked very much like a human skull.</p><br/><p>The Ghost Weeping Shore was at the head section of the human skull. The mouth, nose and eyes of the skull were all entrances. Looking from the outside, the buildings inside could be vaguely seen.</p><br/><p>Once You XiaoMo saw the exterior of the Ghost Weeping Shore, he could roughly guess the origin of its name. It was due to the entrances. Whenever the wind whistled through the caves in the Human Skull Peak, the sound created probably sounded like a ghost weeping, thus it was called the Weeping Ghost Shore.</p><br/><p>When he said as such to Ling Xiao, he got a knock on his head, “Now is not the time to display your knowledge.”</p><br/><p>You XiaoMo’s lips curled, I know that you’re actually jealous that I could guess it but you couldn’t. Since I really understand how you feel, I won’t bicker about it with you.</p><br/><p>“Then tell me, what should we do next? There’s still PiQiu and the rest but it looks like they’re not here.”</p><br/><p>Ling Xiao thought over it, “We’ll know if we take a look around. That white robed man said that they were going to gather. Everyone should be gathered at someplace now. Let’s go up and take a look first.”</p><br/><p>Ling Xiao was now at three star Sacred Realm practitioner. When he stimulated the Dragon Clan’s bloodline, it directly caused his cultivation to jump from one star to three stars. Two stars were a gap that many experts were unable to overcome in their lifetime of poverty.Yet he merely stimulated his latent bloodline and achieved this accomplishment, he himself was also very shocked.</p><br/><p>You XiaoMo held a little resentment for these things, as Ling Xiao was always running ahead of him every time.</p><br/><p>The Weeping Ghost Shore was much larger than they had imagined. Just the section of the nose was more than ten meters wide, let alone the mouth section. The mouth was one third the width of the Human Skull Peak. As the nose and eyes were too conspicuous, the two directly entered from a small crack at the mouth.</p><br/><p>……</p><br/><p>There were only five members inside when the white robed man and the black robed man hurried to the Smile Pavilion.</p><br/><p>Although they were at another area of the Ghost Tomb Mountain Range at that time they were to gather, it not considered late as the Tiangou had a total of twelve members, and there were still five members who had not arrived. However, this did not include Gu Lin.</p><br/><p>“Tian Ming, Tian Hen, you’re late.”</p><br/><p>The one who started speaking was Tian Dao. Tian Dao was a main member of the Tiangou who was in charge of gathering intelligence and distributing all sorts of information.</p><br/><p>Tian Ming, who was the white robed man, immediately beamed and opened his fan when he heard his words. Just like an outstanding and elegant young master, he rebutted while approaching, “Aren’t all the members not present too?”</p><br/><p>“The others are unable to return at this moment.” Tian Dao expressionessly replied.</p><br/><p>It looked like they were really the last to arrive. Tian Ming and Tian Hen soon took their seats.</p><br/><p>Tian Hen asked, “What about Leader?”</p><br/><p>Tian Dao indifferently replied, “Leader will only be back after a few days, but he asked me to pass on some information today. The Leader’s young master should be arriving at the Ghost Tomb Mountain Ranges within these two days and he asked us to receive the young master properly.”</p><br/><p>“Oh?” Tian Hen suddenly became interested as he stared straight at Tian Dao, “Can I interpret the meaning as what I believe?”</p><br/><p>“What you’re all thinking is of no concern to me, I’m only passing on the Leader’s words.”</p><br/><p>All of the remaining six people revealed an expression conveying a tacit mutual understanding.</p><br/>\n</div>"}