{"title": "Chapter 548", "id": 548, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-548", "volume_title": "Volume 6", "body": "<h1>Chapter 548</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 548: You’re Overthinking itTranslated by Crystal of Exiled Rebels ScanlationsFor being an evil force, there weren’t many that knew of the Black Spider’s headquarters. The three of them investigated the whole way there, but although many knew of the biggest black market auction held by the Black Spiders, nothing more was known.</p><br/><p>They didn’t need to hide or be sneaky since not many knew of their true faces. Not only that, most wouldn’t expect them to add an extra person in their party at such a critical time.</p><br/><p>Once they arrived at the Central City, they first and foremost went to the information hub of the Cang Alliance.</p><br/><p>The one in charge was Fu CangQiong’s fourth disciple Ye Nong. He knew of their deal with his Shifu and last time it was him who greeted them too, but even so, he was still surprised at their arrival.</p><br/><p>Following Ling Xiao’s order, You XiaoMo put everything they wanted to say in a jade drive, which contained information on the Samsara Pill and their conditions. He then handed it to Ye Nong, telling him to send it off quickly to the hands of Fu CangQiong.</p><br/><p>He accepted solemnly and told them to come back in three days to pick up the jade drive, as they will give a reply within three days.</p><br/><p>After that, they hurried over to the ShuangYu Hotel.</p><br/><p>The situation on the streets was the same as before, completely unfazed by the stuff that had happened recently, maybe just a few more things to gossip about.</p><br/><p>You XiaoMo hadn’t given a hundred percent of his trust to Wu Cheng yet, thus he never hinted at his return to him. Once he arrived to say he was You XiaoMo, Wu Cheng was utterly dumbfounded.</p><br/><p>After the shock wore off, he quickly told two elders to guard the entrance and not let anyone in, except for his dad, Wu Zheng.</p><br/><p>Although the situation in Zhong Tian looked peaceful, the Vermillion Blood Clan hadn’t given up yet. You ZhenTian planted many people everywhere so that if any trace of them was found, they would immediately be hunted down by all of the experts of the Vermillion Blood Clan.</p><br/><p>“Fellow You, you changed your appearance again?” Taking a good look at You XiaoMo, Wu Cheng could say that the him now was completely different from before.</p><br/><p>His face from before was very plain, the kind that if one threw it into a crowd, one would only be able to find it because of the charisma. Now, it looked much nicer and didn’t feel strange. As for Ling Xiao, he only dared to take a peek as it was so blinding he didn’t dare look at him straight up.</p><br/><p>“No, these are our real faces.” You XiaoMo had decided that from now on, he was going to use his real face, thus he generously admitted it out loud.</p><br/><p>Nodding, Wu Cheng took out a magic bag and pulled out all of the magic herbs he had collected. As the time frame was relatively short, he wasn’t able to collect much.</p><br/><p>Every stalk was placed in a jade box, with more mature herbs than saplings. Although there was only mid and low grade herbs, it was already pretty good.</p><br/><p>He spent a lot of spirit gems to buy these magic herbs and he did regret it a bit afterwards because the news about the Black Spider’s auction was only revealed afterwards, including the fact that they only took spirit gems. The ShuangYu Hotel was also given a invitation.</p><br/><p>Fortunately, he didn’t buy it all as some were traded.</p><br/><p>You XiaoMo didn’t have high hopes in the beginning, so didn’t think Wu Cheng would give him such a pleasant surprise. What he needed the most now was high tier mature magic herbs.</p><br/><p>From the twenty odd herbs, a third were mature whereas the rest were saplings, and not many seeds. The market for seeds and saplings was even worse in Zhong Tian than Xi Jing, so these took a while for Wu Cheng to find.</p><br/><p>You XiaoMo did some mental calculation and figured that the price of these herbs probably wasn’t cheap, but his stock of magic pills was running low. He had completely forgotten about this beforehand.</p><br/><p>“Umm…do you guys take spirit gems? I don’t have much pills on me right now so there isn’t much valuable ones I can give you.” You XiaoMo said hesitantly.</p><br/><p>Wu Cheng was dumbfounded.</p><br/><p>Hearing no reply, You XiaoMo assumed that he wasn’t going to take spirit gems and compromised, “Then how about this, you hold onto them for now…”</p><br/><p>“No no no…no need, spirit gems are fine.” Wu Cheng quickly regained his senses and hurriedly cut him off. Although the ShuangYu Hotel was operating as a casino, their fortune wasn’t comparable to the Vermillion Blood Clan or the Cang Alliance. Their total fortune combined was just around six hundred million, that wasn’t enough.</p><br/><p>From their special information source, they knew what items were going to be auctioned and their head wanted one of those things, so now he and his dad were trying to gather enough spirit gems for it.</p><br/><p>To be honest, some of these herbs he bought using the ShuangYu Hotel’s name. Not only could he get the discounts, the quality sold was better than normal.</p><br/><p>You XiaoMo got the vibe that it had something to do with the Black Spider’s auction and wasn’t surprised, “Okay, then calculate the total and tell me how much is it going to cost.”</p><br/><p>Wu Cheng had already calculated that beforehand. Since, even in a bartering system, one would still weigh the exchange by spirit gems.</p><br/><p>“The total comes to 131.5 (one hundred thirty-one million, five hundred thousand) million spirit gems. Rounding it out, I’ll just take one hundred thirty million.”</p><br/><p>This was his biggest transaction ever, although Wu Cheng questioned if You XiaoMo had this many spirit gems to offer, especially before the auction. After all, the Top Ten Divine Gods were invited too.</p><br/><p>Before You XiaoMo knew that his cheap dad was the richest man on the TongTian Continent, he wouldn’t be able to afford this, but after knowing that, and taking all of his fortune in his own pocket, he would say that one hundred thirty million was nothing.</p><br/><p>It took You XiaoMo two magic bags before he was able to reach one hundred thirty million spirit gems. By using his soul power, he was able to count it out in a few seconds.</p><br/><p>Handing it off to Wu Cheng, he said, “Here, make sure the number is right.”</p><br/><p>As if he was dreaming, Wu Cheng counted out the spirit gems. To think everything was paid upfront…By the time he looked at You XiaoMo again, all he saw was a chicken that laid golden eggs.</p><br/><p>“Is there anything else you want me to look out for you?”</p><br/><p>After thinking about it, You XiaoMo nodded. However, he didn’t tell Wu Cheng to buy every transcendent level magic herbs, instead, he recalled the ones used in rainbow pills and wrote a list of herbs by memory. Handing it over he said, “Then please be on a look out of the magic herbs on this list, I’ll buy it at the market price.”</p><br/><p>Given the earlier price, You XiaoMo figured that he bought those herbs at a lower rate than market price so, he was basically giving the difference as commission. As for how much discount he could buy them at, that was up to him.</p><br/><p>Wu Cheng also knew what he was getting at and promised that he would find these herbs.</p><br/><p>At that moment, Wu Cheng hadn’t realized that many magic herbs You XiaoMo listed were very hard to find, since most of them were very high grade magic herbs.</p><br/><p>Bidding farewell, Wu Cheng instantly ran to find his dad.</p><br/><p>On the other hand, You XiaoMo decided to return to the XiaoYao Institution to take another look at this ‘fated to be here and faraway’ institution. He wasn’t even sure himself if he could continue to stay at the institution.</p><br/><p>“Sonny, when you return to the XiaoYao Institution, You ZhenTian would know immediately.” In truth, You JunQi knew more about the XiaoYao Institution than even Ling Xiao. He understood, deeply, the true nature of the institution.</p><br/><p>On the surface it seemed to be growing talents, but in reality, they were to service the Tong Tian Palace. Every hundred years, the Tong Tian Palace would take a batch of talented students to the Tong Tian Temple but no one knew what they were doing there. It was also quite dangerous so he didn’t want his son to get involved.</p><br/><p>“Well, he was going to know sooner or later, right?” You XiaoMo said while looking at Ling Xiao. He didn’t quite believe that You ZhenTian would come find him immediately after knowing he was in the institution.</p><br/><p>Ling Xiao thought about it said, “On the surface, the Vermillion Blood Clan only has one Sacred Realm practitioner and that is You ZhenTian, the head. He can’t come personally for just a member of the clan, otherwise people would suspect that there was ulterior motives, so we’re safe for now.”</p><br/><p>You JunQi knew that his son listened to Ling Xiao, so no matter what he said, he wasn’t going to change his son’s mind. Although he was a bit unhappy, what Ling Xiao said wasn’t wrong.</p><br/><p>After they decided to return to the XiaoYao Institution, they left immediately.</p><br/><p>You JunQi’s identity was a bit special and not many people had seen him before so You XiaoMo made him wait in the hotel, after all, an unfamiliar face had it’s uses too.</p><br/><p>The familiar structure was right in front of them.</p><br/><p>You XiaoMo suddenly came to a halt.</p><br/><p>Walking over, Ling Xiao asked with a brow raised, “Scared after being away for so long?”</p><br/><p>You XiaoMo replied, “……The XiaoYao Institution was barely even a harbor for resting, how is it a ‘home’!”</p><br/><p>“Then why aren’t you moving?”</p><br/><p>“I’m bracing myself! Think about it, seeing how famous I am now, when I go in, a lot of them would be looking at me in idolization. I’m afraid the pressure would get to me so I’m preparing.”</p><br/><p>“You’re overthinking it.”</p><br/><p>“Leave me alone.”</p><br/><p>So, Ling Xiao stopped talking. Once they went in, they gave their names and just as You XiaoMo predicted, everyone who walked past had a look of idolization. However, they weren’t looking at You XiaoMo but Ling Xiao, only occasionally would one give You XiaoMo a look of sympathy.</p><br/><p>“See, I told you you were overthinking it.” Just as they were about to walk into the Giganticus, Ling Xiao suddenly turned to rub salt on You XiaoMo’s wounds.</p><br/><p>With a critical hit, You XiaoMo died vomiting blood (was K.O’ed) .</p><br/><p>The winner: Ling Xiao.</p><br/><p>Experience: +100.</p><br/><p>An easy victory.</p><br/><p>Before they entered the Giganticus, suddenly out came a few people and they were, of course, Qiao WuShuang and the others. It wasn’t even ten hours since Ling Xiao and You XiaoMo entered the XiaoYao Institution. For them to have heard the news, that was some speed.</p><br/><p>“Where, where are they, didn’t you say they’ve returned?” Tian Xin said as she pushed the crowd away and took at look of the ones standing by the gate. She couldn’t find You XiaoMo’s figure anywhere.</p><br/><p>You XiaoMo rubbed his face.</p><br/><p>Suddenly, Tian Xin turned to look at him, then retracted her gaze to continue her search, “Where are they?”</p><br/><p>Not knowing whether to laugh or cry, Qiao WuShuang turned her head around to where she was looking at before. Not far from her stood You XiaoMo and Ling Xiao with barely anyone around them. It was very obvious.</p><br/><p>“Fellow You, you’re finally back.” With delight, Yan Hui walked towards them, “So many things happened but with the Vermillion Blood Clan hunting you down, why aren’t you guys hiding? If they knew about your whereabouts, they’re sure to come catch you.”</p><br/><p>The uncle also walked over and greeted them with a warm smile, “Welcome back!”</p><br/><p>Tian Xin was displeased that the ‘first’ was taken by Yan Hui so she ran over, pushed Yan Hui aside and said in rapid fire mode, “You XiaoHa, ah no, I should call you You XiaoMo, you really surprised me, to think that you are a member of the Vermillion Blood Clan, you and Ling Xiao’s plentiful glorious records was also super thrilling, I want to go too, how about I just follow you guys from now on…”</p><br/><p>Before she could continue, Qiao WuShuang covered her mouth and said with resignation, “Sorry, her brain is a bit problematic these days. Just ignore everything she says.”</p><br/><p>You XiaoMo immediately nodded. He could tell that Tian Xin had probably hit her head on something.</p><br/><p>Soundlessly, Tian Xin rolled her eyes. You’re the ones who hit their heads!</p><br/><p>Qiao WuShuang took them to a secluded area and only asked when no one was around, “What are you guys planning to do from here on out?”</p><br/><p>With a smile You XiaoMo answered, “If we can stay at the XiaoYao Institution, of course we would be willing to, but if that’s not possible, then it can’t be helped.”</p><br/><p>“Rest assured, my Shifu said that the XiaoYao Institution is a place to study. No forces, big or small, can act wantonly here. You guys are safe for now.” Qiao WuShuang answered.</p><br/><p>It was almost the same thing Ling Xiao had said.</p><br/><p>In his heart, You XiaoMo reaffirmed his decision to follow Ling Xiao and stand firmly on the position of ‘listen to Ling Xiao on important things, and listen to himself on unimportant things’. Never changing for century.</p><br/><p>After he confirmed the position of the XiaoYao Institution, You XiaoMo and Ling Xiao returned to their hotel. They weren’t planning to stay in the institution yet, as who knew if someone of the Vermillion Blood Clan was in the Giganticus.</p><br/>\n</div>"}