{"title": "Chapter 558", "id": 558, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-558", "volume_title": "Volume 6", "body": "<h1>Chapter 558</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 558: Artificially Inflating the Price</p><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Three hundred million for a Level Twelve Life Crystal was still a great buy.</p><br/><p>Thus, the auctioneer thought that it would be fine as long as the sale of the items did not fail while he was the auctioneer. In any case, he was not the one who took this Life Crystal out for auction so it did not matter what the price was.</p><br/><p>You XiaoMo felt that he did not want to let others take it away since he knew this Life Crystal was LanQiu’s brother. This was especially so when his competitor for the Life Crystal was You ZhenTian. Anyway, they were already embroiled in an unceasing conflict with the Vermillion Blood Clan and offending them again made no difference, not like he could kill them right here right now.</p><br/><p>You XiaoMo looked at Ling Xiao resolutely and started speaking, “I…”</p><br/><p>Ling Xiao directly threw two words to him, “Bid.”</p><br/><p>You XiaoMo, “…”</p><br/><p>Here we go again. It was very annoying to for Ling Xiao to have some sort of telepathic connection in his heart to him. At least let him finish speaking.</p><br/><p>You XiaoMo entered the price under his own name. This action was a rare shot at heroism for him. He could admit that he wanted to see what the expression would be like on You ZhenTian’s face, after all they were still nephew and uncle by blood.</p><br/><p>When the auctioneer saw the price put forth by You XiaoMo, he finally smiled with satisfaction, “Number Fifteen’s bid is four hundred million.” Then he looked at You ZhenTian.</p><br/><p>You ZhenTian’s expression did not change, yet his gaze was extremely dark.</p><br/><p>Everyone was astonished when they heard this familiar Number Fifteen again, but soon after, they showed an expression conveying understanding. They had seen the light.</p><br/><p>This was maliciously bidding up the price to make the Vermillion Blood Clan bleed money!</p><br/><p>You ZhenTian expressionlessly increased his bid. The bid price of four hundred million then became four hundred and fifty million.</p><br/><p>This had developed to the point where no other forces wanted to join in this fight. It seemed that You ZhenTian determined to win this Life Crystal based on his attitude, but they did not have to worry that You ZhenTian would be able to easily win this Life Crystal.</p><br/><p>As a matter of fact, his foe was currently maliciously raising the price.</p><br/><p>You XiaoMo ignored You ZhenTian’s dark gaze and put his hand on the crystal slab again. He thought about it for a moment before adding a heavy bombshell.</p><br/><p>The auctioneer’s eyes grew brighter and brighter as he cried out, “Number Fifteen’s bid is six hundred million. Are there any higher bids?”</p><br/><p>You ZhenTian’s face turned black.</p><br/><p>The entire auction hall fell silent.</p><br/><p>They had profoundly experienced You XiaoMo’s maliciousness. It seemed that he hated the Vermillion Blood Clan a lot. Although most people did not really understand the resentment between him and the Vermillion Blood Clan, they knew that the real facts would definitely not be the same as what the Vermillion Blood Clan had disclosed.</p><br/><p>“They are seeking for death ah!”</p><br/><p>“This You XiaoMo is too bold! Is he not afraid that You ZhenTian would suddenly give the item up and entrap him instead?</p><br/><p>“I think he’s certain that You ZhenTian will not give up.”</p><br/><p>“That’s not necessarily true. If You ZhenTian is pushed too far, it is possible that he may give it up.”</p><br/><p>“Now let’s see who will give up first.”</p><br/><p>“When You ZhenTian backs off, You XiaoMo will definitely be skinned and flayed to the bone by the Black Spider.” A brother with a standard gloating expression stated. The majority had the same notion as him and did not believe that You XiaoMo would still have spirit gems on him.</p><br/><p>You ZhenTian’s face was livid as he entered his bid for the third time on the crystal slab. The price of six hundred million was too excessive. He could not limitlessly raise the price again and just entered a conservative price. Following which, he then glared viciously at You XiaoMo as if he was saying ‘increase your bid again if you have the guts’.</p><br/><p>You XiaoMo moved closer to Ling Xiao to share a portion of pressure before he continued to raise the price without the slightest hesitation from six hundred and twenty million to six hundred and fifty million.</p><br/><p>When the auctioneer shouted this amount out, You ZhenTian stood up as he let out a sound expressing surprise. The aura of a high star Sacred Realm expert bypassed the auctioneer in the middle and surged towards You XiaoMo and Ling Xiao with the intent to attack from mid-air. Its momentum was colossal and relentless.</p><br/><p>In the Black Spider’s auction, using one’s aura to oppress others was permissible as long as one did not physically come to blows, so they would not step in to stop it.</p><br/><p>Without waiting for Ling Xiao’s reaction, another aura which did not lose out to You ZhenTian burst out from beside them, intercepting the aura attack of You ZhenTian in mid-air. The pressure from two auras made the people at the auction feel an uncomfortable sense of oppression.</p><br/><p>The one who stepped in was Fu CangQiong.</p><br/><p>Everyone was stunned, then they immediately thought of the words that the Cang Alliance had released half a month ago. Sure enough, it was more than just hot air. It seemed that the Cang Alliance would defend You XiaoMo and Ling Xiao.</p><br/><p>“You ZhenTian, you are an elder. Yet you actually made a move on two juniors because you were shamed into anger. This is not the demeanor befitting an expert. Don’t tell me that you are a sore loser?” Fu CangQiong laughed brightly, yet he spared no effort to denunciate him.</p><br/><p>You ZhenTian was enraged, “Fu CangQiong, the Vermillion Blood Clan will take you as an enemy if you are determined to protect them. Are you sure you want to incite a war between the Vermillion Blood Clan and the Cang Alliance for the sake of both of them?”</p><br/><p>“You ZhenTian, I’ll declare my stance here today. I will definitely protect them even if this means becoming enemies with the Vermillion Blood Clan. You’ll have to get through me if you want to touch them.” Fu CangQiong’s voice was so calm that it did not seem like a declaration of sides, and was as if he was merely chatting.</p><br/><p>You ZhenTian’s expression was sinister as he lividly shouted ‘good’ three times in succession, “Fu CangQiong, I, You ZhenTian, will remember your words today!”</p><br/><p>With that, he then withdrew the pressure he released.</p><br/><p>Fu CangQiong did not take his words to heart. He had foreseen this scene long before he had agreed to You XiaoMo and Ling Xiao’s request. Although the struggle between the Cang Alliance and the Vermillion Blood Clan was brought forward much earlier than he had expected, he was willing to do so for the sake of his little apprentice!</p><br/><p>Everyone immediately felt relieved once the two pressures dispersed.</p><br/><p>The strength of a high star Sacred Realm expert was really frightening and they were nearly unable to bear that oppression.</p><br/><p>Soon after, You ZhenTian threw out a sky-high price of seven hundred million as if he was throwing his life away. Everyone could that that this was probably You ZhenTian’s final bid.</p><br/><p>Each and every one then turned to You XiaoMo. Would he pull the tiger’s fur or quit at this point?</p><br/><p>You XiaoMo did not keep everyone in suspense. He tactlessly added another twenty million spirit gems on top of the last bid of seven hundred million. Although every increase in the bid price must not be less than five million, he added twenty million as he did not want others to think he was maliciously raising the price.</p><br/><p>Then he had his wish fulfilled as he provoked You ZhenTian and the auctioneer.</p><br/><p>Neither the auctioneer nor the others thought that You XiaoMo still had seven hundred and twenty million spirit gems in his pocket. Not only did action of his make the Black Spider lose out on the sum of seven hundred million spirit gems, the sale of the Life Crystal of the Wolf of Gluttony could be considered as failed. Furthermore, they would inevitably come to cause trouble when news of the Life Crystal being sold spread to the ears of the Seven Sins Beasts.</p><br/><p>The Black Spider still could not reveal their strength at this moment.</p><br/><p>You XiaoMo’s face fell upon seeing that he had managed to win the bid for the Life Crystal. His expression was obscure and it was hard to tell what he was thinking about. Everyone thought that he had regretted his actions.</p><br/><p>After that, the auctioneer sold off several pieces of treasures, including transcendent level soul and skill training manuals and Rainbow Level magic pills and pill recipes. Practically every major force had a life-or-death struggle over the first two. The Four Divine Emperor Beasts mainly bidded for the latter items.</p><br/><p>Some were happy and some were worried.</p><br/><p>After all, there were only a limited number of items. It was impossible for all forces to be satisfied.</p><br/><p>You XiaoMo did not fan the flames again when You ZhenTian participated in the bidding for the items coming after. Many people assumed that he was afraid now.</p><br/><p>The tense moments came one after another, yet everybody did not slack off because it was finally time to bid for the last item. This was also the ancient object that You XiaoMo saw on the invitation, but the specific details on the item was not explained.</p><br/><p>“Next is the last treasure…” In the wake of the auctioneer speaking, a tray covered with red cloth rose from the auction platform. It looked flat and seemed to be empty.</p><br/><p>The auctioneer removed the red cloth, revealing a brown parchment placed on the tray. It looked like a pill recipe or such. Could this pill recipe that was intentionally placed as the last item be a high-grade Rainbow Level pill recipe?</p><br/><p>Everyone swallowed their saliva. If that was so, it was worth placing it at the end.</p><br/><p>The auctioneer explained, “I know that everyone is thinking that it’s a pill recipe. However, I’m sorry to say that though it’s not a pill recipe, I believe that everyone here would find this trip worthwhile when you know what it really is.”</p><br/><p>You XiaoMo already could not hear what he was saying. He could not possibly mistake what this item was when he had three identical pieces of the parchment. He was ninety percent certain that it was the last piece that he was missing to complete it and was determined to get this thing.</p><br/><p>You XiaoMo thought quietly, ‘You cheap dad, you’re really my lucky star. I will definitely treat you better after I manage to bid for this parchment.’</p><br/><p>Once he thought of this, he nervously tugged at Ling Xiao’s sleeve.</p><br/><p>Ling Xiao pulled his sleeve back, “I know.”</p><br/><p>You XiaoMo raised his head, “You know what I want to say?” He did not believe that Ling Xiao would be able to guess what he wanted to say this time when he had not even uttered a single word.</p><br/><p>Ling Xiao fell silent.</p><br/><p>You XiaoMo said, “I actually wanted to say, you should stay calm and not be too impulsive later. Leave it to me.”</p><br/><p>Ling Xiao, “…”</p><br/><p>In the end, it turned out that the impulsive one was You XiaoMo himself.</p><br/><p>On the auction platform, the auctioneer had already began an unceasing torrent of word to introduce the true value of he parchment. In fact, it was also just a sentence: This is a treasure map handed down from ancient times, generally ancient items are either exceptional treasures or a legendary abode and such.</p><br/><p>After an appraisal by the Black Spider, they could only uncover that the map drawn on this parchment was of a region in the southeast of Dong Zhou. The exact location could not be determined as they lacked the three other maps, so this could not be confirmed. However, one could roughly determine what the treasure map was possibly hiding based on the region being the southeast of Dong Zhou.</p><br/><p>In ancient times, the situation in Dong Zhou was different from today.</p><br/><p>At that time, the great war between the humans and demon beasts had not occurred and many powerhouses had not yet fallen. Moreover, Dong Zhou was a region in the TongTian Continent which was relatively rich in spiritual energy. It was said that a huge mountain range isolated Dong Zhou from the outside, so Dong Zhou was also the birthplace of many of the top powerhouses.</p><br/><p>After the great war, Dong Zhou lost its advantage. The spiritual energy energy also became sparser than the outside for some unknown reason. Not only that, the number of mages were also getting lesser and lesser.</p><br/><p>Nevertheless, this could not change the fact that Dong Zhou was once a world of strong experts. Therefore, if the treasure map was really marking out Dong Zhou, then there was a ninety percent chance that it was something good. Maybe it was a legendary adobe left behind by an strong predecessor in ancient times.</p><br/><p>Once they thought of this, everyone could not help their emotions surging.</p><br/><p>Treasure hunting had always been one of the most popular entertainment activities.</p><br/><p>Seeing that the atmosphere was finally starting to buzz, the auctioneer sighed in relief before he announced, “The starting price is two hundred million. Everyone can start bidding now.”</p><br/><p>Although the parchment was the last item, its starting price was lower than the previous items because its value was unable to be estimated. This also made the major forces feel that the price was reasonable.</p><br/><p>Just as everyone was roll up their sleeves for battle, someone had already raised the price at the speed of lightning to a height that many people could only look up to.</p><br/><p>“Number Fifteen has put in a bid for five hundred million. Are there any bids higher than his?”</p><br/><p>The auctioneer burst into an excited cry, yet a trace of the sound of gnashing teeth abruptly sounded during his cry.</p><br/><p>The entire hall fell silent once more.</p><br/><p>It’s Number Fifteen again!</p><br/><p>Everyone looked at You XiaoMo who had a none-of-my-business attitude, as if he was saying, ‘I’m just going to help you raise the price a little bit first. Anyway, it’ll go up sooner or later. There’s no need to thank me!’</p><br/><p>Flames were already shooting out of the eyes of several groups of people.</p><br/><p>The Qilin Clan and the Demon Phoenix Clan did not find any good treasures in the beginning portion of the auction. Now they were very interested in this map, yet the price was raised to five hundred million by You XiaoMo before they could even start bidding.</p><br/><p>“This brat must have deliberately done it.” Ji Rui gnashed her teeth as she hissed. She had just been preparing to throw in her bid when her attempt was prematurely aborted.</p><br/><p>Many others had the same experience as her.</p><br/><p>The atmosphere remained silent for a few seconds before it began to heat up again. However, nobody tried to bid for it immediately from beginning to end. There was definitely no one who was that generous to spend more than five hundred million to buy a map with unknown contents.</p><br/><p>For a moment, there was actually no one participating in the auction other than You XiaoMo’s bid which had artificially inflated the price.</p><br/><p>————————————————————————————————————————</p><br/><p>Ra: Daddy is Momo’s god of fortune, while Husband is Momo’s god of poverty.</p><br/>\n</div>"}