{"title": "Chapter 556", "id": 556, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-556", "volume_title": "Volume 6", "body": "<h1>Chapter 556</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 556: The Sommelier and Spirit WineTranslated by Crystal of Exiled Rebels Scanlations</p><br/><p>The Crystal Tablet was directly connected with the floor and then extended towards the auction block.</p><br/><p>Seeing through a tablet did in fact reduce the noise of a typical auction. You XiaoMo had always thought that this stuff was even more high tech then the high tech stuff in the modern world. However, he also heard that these kind of crystal tablets were not common in the TongTian Continent, not because it was rejected but because the limited quantity of these crystal stones.</p><br/><p>According to what he heard, there was only one place that had these crystal stones, and it was an extremely dangerous place. Only those who were truly strong had a way to mine them.</p><br/><p>After the auctioneer finished his introductions, he announced the start of the auction.</p><br/><p>Every item rose from below the auction stand, which reduced labor cost and showed off it’s convenience.</p><br/><p>Normally an auction would start off with some lesser valuable stuff, but since the auction items of the Black Spiders were known as quality goods, the opening was designed to not be too bad either.</p><br/><p>The first item was a cauldron known as the Red Eagle Cauldron. It was shaped like a red eagle taking flight, hence the name. Although it was only ranked ninety-nine, towards the bottom, there were still a lot of people fighting over it.</p><br/><p>If it could get into the top one hundred, then it was guaranteed to be something good.</p><br/><p>With the effective and persuasive introduction of the auctioneer, the crowd became excited too. There were a portion of mages amongst the attendees and thus there were a fair amount of people aiming for the Red Eagle Cauldron.</p><br/><p>Under the competitive bidding of the crowd, the Red Eagle Cauldron was finally sold at two million fifty-five thousand spirit gems.</p><br/><p>The price shook You XiaoMo.</p><br/><p>Back then, he bid eleven million spirit gems to get the Heavenly Cauldron. The difference between the two prices wasn’t much.</p><br/><p>However, the Heavenly Cauldron was ranked seventh on the rankings, it’s value wasn’t even comparable to the Red Eagle Cauldron. Seeing the situation now, he realized that he really got it for cheap.</p><br/><p>If it was his Heavenly Cauldron being auctioned instead, the highest bid would definitely go over tens of millions.</p><br/><p>After that, a few more items were sold and none were below a million spirit gems.</p><br/><p>The fifth item was a bit surprising as it was a bottle of wine.</p><br/><p>You XiaoMo widened his eyes and looked curiously at the wine on the auction table. Why would there be wine at an auction like this?</p><br/><p>One could really learn something new everyday.</p><br/><p>“This is spirit wine brewed by a sommelier.” Ling Xiao’s voice appeared lightly beside his ear.</p><br/><p>You XiaoMo turned towards him to ask, “Sommelier?”</p><br/><p>Ling Xiao explained dryly, “There’s actually another occupation in the TongTian Continent and that is sommeliers. Their spirit wine can help in the recovery of soul power, but it’s not a popular occupation and most sommeliers are also drunkards. A proportion of their wine would be sold but most of it would be left for themselves.”</p><br/><p>You XiaoMo nodded in understanding.</p><br/><p>Basically, the use of a sommelier was straightforward, to speed the recovery of soul power. But, if it was just that, then most people would probably prefer to eat magic pills instead.</p><br/><p>You XiaoMo suddenly thought of another question, “But if it’s like you said, then these kinds of spirit wine can’t be considered a unique item. Why would it appear in the auction?”</p><br/><p>“Even spirit wines have differences in quality.” Ling Xiao said bored, but continued, “This wine is probably a high quality one. Normally, the higher the quality, the faster the recovery speed, but since there aren’t many sommeliers to begin with, one of a kind spirit wines are rare.”</p><br/><p>As they were talking, the auctioneer had already opened the spirit wine.</p><br/><p>You XiaoMo took a sniff and without much surprise, he could smell a delightful fragrance of wine in the air that made him shiver.</p><br/><p>Although he rarely drank wine, most men wouldn’t reject the notion of drinking. Especially for drunkards, this spirit wine was just as attractive as a transcendent level soul training manual.</p><br/><p>“Then, do you know what ingredients are used in the brewing?” You XiaoMo asked with interest. If possible, being a sommelier was a pretty good option and he could gift the wine too.</p><br/><p>Ling Xiao glanced over and without thinking, he knew exactly what was going on in that head of his, “You do meet the requirements, if you want to be a sommelier. Supposedly, all of these wines are brewed from magic herbs, but that’s not enough, you need recipes too.”</p><br/><p>You XiaoMo was a little disappointed at that, he didn’t have an recipes. But just as he was pondering over it, he heard something very attractive coming out from the auctioneer’s mouth.</p><br/><p>“As you can probably smell, this is a top quality spirit wine and with one sip, one can quickly regain soul power. I believe that many wine lovers seated here today would be highly interested, so I’ll tell everyone another surprise. The owner of the spirit wine has decided to gift it’s recipe to the bidder.” As his words fell, many were pleasantly surprised.</p><br/><p>Some weren’t interested in the wine itself, but if they could have the recipe, then that would mean they could brew it regularly.</p><br/><p>Who doesn’t like a recovery item?</p><br/><p>However, for those who really liked to compare while shopping, they often believed that spirit wines weren’t as good as magic pills. It was also more expensive, thus comparatively, they were less interested.</p><br/><p>You XiaoMo was also pleasantly surprised and he rubbed his hands together in anticipation. After all, others would have to consider the cost of brewing wine but he didn’t.</p><br/><p>The base line price was two hundred thousand spirit gems.</p><br/><p>One could buy a lot of recovery magic pills with two hundred thousand spirit gems, but the competition was different now with the recipe included. The amount of bidders increased ten folds.</p><br/><p>“Little-shidi, you also want this spirit wine?”Wei Bai, who sat beside them, asked as he saw You XiaoMo looking at the spirit wine bright eyed. His body wasn’t suited for alcohol so he wasn’t interested.</p><br/><p>You XiaoMo laughed at that and said, “I’m more interested in the recipe.”</p><br/><p>Wei Bai thought about it and said, “If you want to bid for the last few items, then it’s better if you don’t spent so much on other things.”</p><br/><p>That was the reason those forces in the front row hadn’t made a move yet. It was to ensure that they were going to get what they really wanted and not waste spirit gems. After all, if they lost a bid because of that then they were really going to cough up blood.</p><br/><p>“Don’t worry, second-shixiong, I know.” You XiaoMo replied with confidence, he hadn’t told him yet that he had a whole leyline worth of spirit gems.</p><br/><p>Ling Xiao told him that the thing that happened on the wild plane must be kept a secret. If it was to get out, then those looking for them would expand from the Vermillion Blood Clan to all of the TongTian Continent.</p><br/><p>It had always been the case that, with the discovery at the wild plane, bloodshed ensued.</p><br/><p>After some bidding, ninety percent had given up and all that was left were fairly competent competitions. The price of the spirit wine had also gone from two hundred thousand to eight million, that was forty-fold.</p><br/><p>If there wasn’t a recipe then the price of the spirit wine itself wouldn’t have gone beyond one million spirit gems. It was a surprising result for many people.</p><br/><p>Seeing that the time was right, You XiaoMo typed his bid on the crystal stone tablet.</p><br/><p>A second later, the auctioneer announced his bid, “Number fifteen offers ten million spirit gems, will anyone go higher?”</p><br/><p>Number fifteen was You XiaoMo’s seat.</p><br/><p>Every chair had a noticeable number in front of it. Once one participated in the bid, the seat number and bid amount would be reflected on the auctioneer’s tablet.</p><br/><p>It was the first time that a front row powerhouse participated in a bid.</p><br/><p>With that, everyone’s gaze couldn’t help but be drawn over. Once they found out that it was You XiaoMo, they couldn’t but criticize internally. To spend ten million spirit gems just for a wine recipe, idiotic</p><br/><p>As the thought crossed their mind, some already eliminated them as competitors for the final goods.</p><br/><p>Since they were always alone, their identity had been found out and combined with their grudge against the Vermillion Blood Clan, no one expected them to be rich. At most they probably had around a hundred million.</p><br/><p>After the auctioneer called out a few more times with no response, he was about to finalize the deal when suddenly, a line of text appeared on his tablet.</p><br/><p>The auctioneer paused before reading, “Number thirty-one offers fifteen million spirit gems.”</p><br/><p>You XiaoMo was astonished, who was this generous with money that they just added five million?</p><br/><p>Once he looked over towards number thirty-one, what appeared was an annoying face, Lin HaoWu from the Qilin Clan.</p><br/><p>At first he thought that Lin HaoWu was also interested in the recipe until they looked over with a provoking gaze. Then he knew it was intentional.</p><br/><p>The Qilin Clan was different from the Vermillion Blood Clan and the Demon Phoenix Clan.</p><br/><p>They had never made enemies with the Qilin Clan, although judging from their attitude towards Ling Xiao, it was never going to be good. Now, however, was simply Lin HaoWu being disagreeable.</p><br/><p>Was he trying to pick on them or something?</p><br/><p>You XiaoMo took a look at his complacent expression and held back his desire to punch the shit out of him.</p><br/><p>Lin HaoWu, good for you, I didn’t even mess with you but you, on the other hand, decided to mess with me. From now on, you better not bid on anything else cause I’m going to make you cry like a baby.</p><br/><p>You XiaoMo added five million more spirit gems as he grinded his teeth. This number was a lot less to make Lin HaoWu think he was at his limit and thus not randomly add anymore more.</p><br/><p>Understandably, Lin HaoWu was pleased with his reaction, thinking that he had made You XiaoMo bleed a little, his whole expression lightened up. Also he stopped his price pushing.</p><br/><p>This kind of thing was very common in auctions, especially the non-official ones like the Black Spider auction. There was nothing preventing them from increasing the price, thus if there was a grudge, or if one just did not see eye to eye with someone, they could do it. However, if someone got the item and couldn’t pay, then they must be prepared to face the wrath of the Black Spider.</p><br/><p>In the end, both the recipe and the wine fell into You XiaoMo’s hands.</p><br/><p>The auction continued on and many quality items appeared. The major forces also started bidding and whenever that happened, everyone else would stop competing.</p><br/><p>After all, this amount of face should be given. Also, it was not like they could win in a financial battle either.</p><br/><p>As the sun started to set outside, the inside was still bright as daylight. With everyone’s attention on the continuous stream of treasures, almost no one realized the actual time. Above them, the white sparkling minerals shone brightly.</p><br/><p>It wasn’t the first time that You XiaoMo had attended one of these extended auctions. His focus was also on the treasures on the auction stand. As things progressed further, the auction was nearing the end with about one-fifth of the items left. Even if the items were not for the finale, they were all treasures amongst treasures.</p><br/><p>“Do you want that?” Ling Xiao said beside his ear.</p><br/><p>Currently on the table was a batch of magic herbs. This wasn’t a common occurrence and more importantly, two-thirds were transcendent level magic herbs. Not only that, as a gift, there was also a batch of high quality transcendent level magic seeds.</p><br/><p>You XiaoMo hesitated before saying, “I want it but also don’t.”</p><br/><p>Over the past half a month he had used up quite a lot of transcendent level magic herbs, so he no longer had many in stock. The rest were still growing in his magic herb field. If he knew beforehand, he would have stocked up transcendent level magic herbs earlier.</p><br/><p>Based on that, he should bid on these magic herbs but it just didn’t feel right, and he couldn’t explain why either, just a gut feeling.</p><br/><p>“So do you want it or not?”</p><br/><p>“…I want it.”</p><br/><p>Ling Xiao looked at him and started to input the price in tablet.</p><br/><p>You XiaoMo didn’t even have time to stop him. This bastard couldn’t have announced a sky high price, right?</p><br/><p>He knew very well what Ling Xiao was like when bidding.</p><br/><p>It wasn’t long before the auctioneer announced the price, “Number seventeen offers one hundred and twenty million, is there a higher bid?”</p><br/><p>Normally, if there was a lot of competition, the auctioneer would announce the highest bid. If he didn’t announce the others, then that meant their bid was lower.</p><br/><p>You XiaoMo looked at Ling Xiao as he had seen a ghost.</p><br/><p>He genetically mutated?</p><br/>\n</div>"}