{"title": "Chapter 550", "id": 550, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-550", "volume_title": "Volume 6", "body": "<h1>Chapter 550</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 550: Have No EyesTranslated by Kollumceti of Exiled Rebels ScanlationsIt was uncommon to convert to crystals in the Exchange Quarter.</p><br/><p>The one who asked for an exchange of spirit gems was a teacher surnamed Yang from the seventieth floor. He was considered to be the first person in the Exchange Quarter to engage such a pioneering work. He came regularly at set intervals and there would occasionally be some rich and imposing people who will exchange spirit gems with him, but there were not many.</p><br/><p>His behavior had always been weird and strange and was very novel for everyone. However, it did not go without a hitch every time, because three days had passed since he opened the shop this month and nobody had made a transaction with him.</p><br/><p>As everyone knew, though spirit gems were the currency in circulation in the TongTian Continent, its value was also very high. This was because it could be used as a trading currency and could also be used to raise one’s cultivation base by absorbing the energy from the spirit gems during cultivation.</p><br/><p>This Teacher Yang was a practitioner who liked to absorb the energy in the spirit gems to increase his cultivation. He thought of this method as he consumed the gems in an extravagant manner, resulting in him having few spirit gems.</p><br/><p>He would come by regularly at set intervals after becoming aware of the benefits.</p><br/><p>Jiu Ye had heard of this teacher’s deeds before.</p><br/><p>The students XiaoYao Institution were all mages. Besides being able to make money easily, mages also spent money very quickly. Most people do not have much spirit gems in their pockets apart from those who truly had some capability and family resources. Besides, this teacher’s price was quite high.</p><br/><p>Due to this, no one came to his shop despite him being open for three days.</p><br/><p>You XiaoMo walked straight to the shop. Jiu Ye was not the only one surprised. Those who saw this scene all expressed astonishment one after another. They probably did not expect that someone would voluntarily offer themselves to be ripped off.</p><br/><p>“Teacher, how many spirit gems can be exchanged for one point?”</p><br/><p>Teacher Yang raised his eyelids and stared blankly for a split second when he saw You XiaoMo. He had been sitting here for three days and was somewhat used to the situation with no one patronizing his shop. He really could not react when someone suddenly came over to ask.</p><br/><p>You XiaoMo could understand his reaction, so he asked again.</p><br/><p>Teacher Yang finally responded and he smiled sincerely, “I only have two points at the moment. I can give you a cheaper rate if you want both. One point for two hundred thousand spirit gems.”</p><br/><p>This price was high and most people may not even have ten thousand crystals in their pockets.</p><br/><p>Jiu Ye who was standing beside You XiaoMo frostily raised his eyebrows. He heard that the price was not two hundred thousand, but one hundred thousand instead. This time it actually doubled and it reminded him of the rumors he had heard.</p><br/><p>“Teacher, isn’t this price too high?” You XiaoMo asked with an unchanging expression. He did have a lot of spirit gems now, but it did not mean that he was indifferent to others ripping him off. It was not like his head had been kicked by a donkey.</p><br/><p>Teacher Yang leisurely replied, “Then what do you think is more important? The points or spirit gems?” The implication of this was that Teacher Yang was out to get him.</p><br/><p>You XiaoMo nonchalantly stated, “Points are more important to me now, but I have a lot of choices, don’t I? I can buy two to three stalks of level nine magic herbs with two hundred thousand spirit gems and then exchange it with the other teachers and I’ll be able to get two or three points in this manner. Doesn’t Teacher think so?”</p><br/><p>Teacher Yang almost could not show his face after being refuted by You XiaoMo, “Then how much do you say it should be?”</p><br/><p>He did view You XiaoMo as a fat sheep so that gave rise to the idea to rip him off. Those rich people generally did not care about this small amount of spirit gems. Furthermore, he was also a teacher from XiaoYao Institution. They should give him some face to say the least, isn’t that so?</p><br/><p>Perhaps because he had ripped people off excessively, he became known for marking up his prices, so no one came to his shop despite him being open for three days this month. Now that he had finally managed to catch a fat sheep, he repeatedly worried that he might not be so lucky next time and could not resist demanding an exorbitant price. How could he have expected that the other party would be one who refused to suffer losses and not even give him a little face?</p><br/><p>“One point for fifty thousand spirit gems.” You XiaoMo did not restrain himself after hearing his words.</p><br/><p>“What did you say?!” Teacher Yang suddenly raised his voice and his face was full of astonishment, as if he had misheard. His voice is a little loud causing people around all to look over.</p><br/><p>You XiaoMo repeated patiently, “One point for fifty thousand.”</p><br/><p>Seeing his calm expression, Jiu Ye knew You XiaoMo didn’t need his help.</p><br/><p>Teacher Yang suddenly sneered, “My opening price is two hundred thousand spirit gems, but you say you want it for fifty thousand, do you think that points fall from the sky?!”</p><br/><p>“Then does teacher think that spirit gems fall from the sky too?” You XiaoMo spread out his hands. He was one hundred percent certain that this teacher definitely saw him as a fat sheep after looking at his face. The exorbitant price of two hundred thousand spirit gems was absolutely too much.</p><br/><p>Teacher Yang was choked by his reply and his eyes roved around as he argued, “One hundred and eighty thousand is the lowest. I know you are student above the eightieth floor. For you, the significance of one point is definitely more than these spirit gems. Either exchange it for one hundred and eighty thousand, it’ll benefit the both of us.”</p><br/><p>You XiaoMo looked at him. Was he threatening him with that last sentence?</p><br/><p>Just like what Teacher Yang had said, the points held more significance to the students as the floor the students were on became higher. Some teachers took a fancy to this, so they would ask for different prices according to the floors the students were on.</p><br/><p>Other students just thought of the benefits that the points would bring them, so they were mostly willing to be ripped off. Many had long become inured to the unusual and the other party was an Elder Teacher. Disputing with him and not giving him any face would only offend him.</p><br/><p>This was the reason why Teacher Yang dared to ask for an exorbitant price. Unfortunately he was destined to run out of luck today.</p><br/><p>Although You XiaoMo entered XiaoYao Institution on the same day as Jiu Ye and the rest, he spent most of his time out of the Giganticus. Jiu Ye even had to tell him about the Exchange Quarter.</p><br/><p>It was impossible for Teacher Yang to take advantage of such a student that did not understand the ‘rules’.</p><br/><p>Jiu Ye knew about this, but he did not tell You XiaoMo about them.</p><br/><p>This was because very few knew that You XiaoMo was a student on the ninetieth floor. If the teachers and elders could not determine which student was from what floor, they would not normally ask for an exorbitant price.</p><br/><p>That was what he thought, yet a teacher that did not have eyes appeared in the end.</p><br/><p>“Fifty thousand at the most. If you don’t want it, I’ll just find another shop. You’re not the only shop in the Exchange Quarter.” You XiaoMo did not take any notice of his threats. This sort of person was the type that would ask for a mile after being given an inch.</p><br/><p>Teacher Yang sneered, “Boy, you have guts. We’ll wait and see!”</p><br/><p>You XiaoMo knew his choice after hearing this sentence, so he turned around and left. It just so happened that he too did not wish to engage in this transaction anymore. Interacting with this sort of person would only disgust himself.</p><br/><p>Jiu Ye only followed after he saw the mocking sneer on Teacher Yang’s face.</p><br/><p>After visiting three more shops and being rejected by two, You XiaoMo finally knew what the phrase of ‘wait and see’ meant. It turned out that all the teachers in Block One were in cahoots.</p><br/><p>He had intended to exchange with the last shop he picked, yet the other had an expression of ‘you offended Teacher Yang, I don’t want to exchange with you’. When he went back to see that Teacher Yang, the other party gave him a provocative stare.</p><br/><p>Childish!</p><br/><p>You XiaoMo could not help cursing in his mind.</p><br/><p>In actual fact, it was mainly because his luck was bad as he chose the people that had friendly relations with Teacher Yang. Teacher Yang could be considered as a popular person in Block One, but not all teachers followed his conduct.</p><br/><p>When the people around saw this, some could not help looking at him sympathetically.</p><br/><p>“Let’s go to Block Two. Block Two’s price is between three to five points. Making one transaction would be enough for to you to cope with the next month.” Jiu Ye calmly said.</p><br/><p>You XiaoMo shook his head, “Then wouldn’t Block Three’s price be between six to nine points?”</p><br/><p>Jiu Ye answered, “No, the price is above six points, but there’s no limit on the maximum.”</p><br/><p>“Well, let’s go to Block Three and take a look.” You XiaoMo immediately made a decision. He was quite curious about what the teachers and elders in Block Three would ask for. It would not be a big problem if they wanted magic herbs.</p><br/><p>The two people left Block One at once.</p><br/><p>However, the people around them could not help looking at each other after hearing their conversation.</p><br/><p>What kind of place was Block Three? That was where the students on the ninetieth floor would go. These students were the most promising in XiaoYao Institution. Sometimes even the teachers had to yield to them a little.</p><br/><p>Even though Teacher Yang had guessed that You XiaoMo was above the eightieth floor, he never thought You XiaoMo’s placement would be higher than ninety floors. At this moment, his heart could not help thumping loudly as he continuously comforted himself, he should not be so unlucky. Moreover, not everything was set in stone. Some of the students from the lower floors would also go to Block Three for a stroll.</p><br/><p>At this moment, the elder next to him let out a light laugh.</p><br/><p>Teacher Yang happened to hear it and could not refrain from asking, “Elder Gong, what are you laughing about?”</p><br/><p>“Teacher Yang, sometimes you shouldn’t behave too arrogantly. Though most of the students here have no powerful connections, there are some you can’t afford to offend.” Elder Gong looked at him in contempt. His status was higher than Teacher Yang so he naturally did not need to give Teacher Yang any face.</p><br/><p>“Elder Gong, what do you mean by this? Don’t tell me that young man has powerful connections?” Teacher Yang was resentful but he did not dare to show it.</p><br/><p>Elder Gong knew that he did not believe him, “I don’t know if he has any powerful connections, but you can’t afford to offend the person following him even if you have a hundred lives. Do you know what his name is?”</p><br/><p>You XiaoMo had changed to a new face and few people recognized him. This Elder Gong had never seen You XiaoMo, but he knew of Jiu Ye’s name and the Mage Association behind him.</p><br/><p>Jiu Ye had only been walking about in Block Two and Block Three despite having been the the Exchange Quarter a couple of times, so Teacher Yang had never seen him before.</p><br/><p>“What is he called?” Teacher Yang could not help the silver of anxiety rising in his heart.</p><br/><p>Each and everyone of the people around them pricked up their ears, especially those who had just helped Teacher Yang. When they heard the words of the Elder Gong, their hearts could not help thumping loudly.</p><br/><p>Elder Gong deliberately whet their appetite. After a while, he lifted the corner of his mouth and revealed, “He is called Jiu Ye.”</p><br/><p>Teacher Yang felt as if his brain had exploded.</p><br/><p>The name Jiu Ye was just like thunder piercing the ear, because everyone knew that the disciple Old Lei of the Mage Guild was most pleased with was called Jiu Ye. His name was quite special and most would not forget it after hearing it once. Furthermore, there were rumors that he would inherit the Mage Guild in the future.</p><br/><p>Although the person they had offended was not Jiu Ye himself, how could a person who was able to make friends with this kind of specially privileged person like Jiu Ye actually be an ordinary person?</p><br/><p>Sure enough, one cannot be too greedy!</p><br/><p>The two people who helped Teacher Yang regretted it so much that they wanted to die.</p><br/><p>On the other hand, You XiaoMo who was heading to Block Three did not know that someone indirectly helped to avenge him and that Teacher Yang would probably be feeling apprehensive for quite some time.</p><br/><p>Block Three only half the size of Block One, with dozens of shops randomly strewn about. The owners of the shops were all elders from the ninetieth floor and above. They would only open for the first five days of the month and leave at noon. One would have to wait till the next day or next month to find them.</p><br/><p>Several lines of sight swept across their figures as soon as two people walked in.</p><br/><p>The elderly man nearest to them suddenly opened his partially-closed eyes and smiled unperturbed, “So it’s Jiu Ye. Do you have something good thing to ‘give’ to us old fellows again this time?”</p><br/><p>Jiu Ye did indeed have a lot of good things with him and had already made three transactions after coming to Block Three. Jiu Ye and Qiao WuXing, these two specially privileged people were the ones most welcomed by these elders.</p><br/><p>“Jiu Ye greets Elder Gan. I came over this time not for me, but because I brought a friend over.” Jiu Ye cupped his hands and respectfully explained.</p><br/><p>Elder Gan’s gaze immediately moved to You XiaoMo. He could not help letting out a voice of doubt, “A Grade One Rainbow Level, and one that is on the verge of breaking through to Grade Two. What is your friend’s name, why does it seem that we have not seen him before?”</p><br/><p>Elder Gan revealed You XiaoMo’s cultivation with one sentence.</p><br/><p>A trace of surprise could be seen in Jiu Ye’s eyes. His current cultivation was at high-grade peak level ten, and he was half a foot into breaking through the next level. You XiaoMo actually broke through the Rainbow Level already?</p><br/><p>“Greetings Elder Gan, I am You XiaoMo.” Seeing Jiu Ye being so respectful, You XiaoMo guessed that his identify was sure to be remarkable.</p><br/><p>Elder Gan who always looked absent-minded suddenly straightened his back as soon as the words were uttered, and his and the inquiring eyes of the other elders swept over him again.</p><br/><p>They had heard the name You XiaoMo many times recently and they had long wanted to meet him after having heard news that Old Lei and Geezer Shen were very interested in him.</p><br/>\n</div>"}