{"title": "Chapter 563 - Xenophobic Dong Zhou", "id": 563, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-563-xenophobic-dong-zhou", "volume_title": "Volume 6", "body": "<h1>Chapter 563 - Xenophobic Dong Zhou</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 563: Xenophobic Dong Zhou</h3><h4>Translated by Jouissance of Exiled Rebels Scanlations</h4><br/><p>The sky was overcast, and the terrain was mountainous, covered in green. Even if the weather wasn’t great, it was clear that the scenery was beautiful. Not far off, two bull-horned demon beasts glowed with green light, glaring at each other predatorily, mooing threateningly. It seemed like they would snap at any moment.</p><br/><p>Then, lightning arced across the sky.</p><br/><p>Just as the two bull-horned demon beast tensed in preparation to lunge, the air around them began to distort. A pitch black gap tore open the air and spatial energy seeped out.</p><br/><p>Two figures appeared under the tear silently.</p><br/><p>The two bull-horned demon beasts immediately stopped attacking each other and turned to glare at the two that had suddenly appeared, baring their teeth like they were about to pounce.</p><br/><p>The clean-shaven and comely young man hurriedly helped his heavily injured companion to rest under a large tree, not having the effort to spare to check their surroundings. They probably wouldn’t be struck by the lightning that was flashing across the sky.</p><br/><p>The two bull-horned demon beasts tracked the young man’s movements, kicking at the ground even more harshly with their hooves. Their calls grew more threatening, especially when they saw the young man turn his back to them. The two demon beasts suddenly roared, leaping up, their hooves thudding against the ground as they charged at the young man.</p><br/><p>Just as they were three meters away from their target, the young man suddenly turned his head, eyes clearly filled with annoyance. He waved a hand at the two, and a massive wave of soul force poured out, raging towards the demon beasts.</p><br/><p>The two demon beasts’ eyes bulged in fear, hurriedly trying to break their momentum and wanting to turn and flee, but it was too late. They crashed into the wave of powerful soul force, instantly being thrown flying. Then fell somewhere into the forest, gone in the blink of an eye.</p><br/><p>Another flash of lightning arced through the sky.</p><br/><p>The young man thought for a moment before deciding to move his companion out from under the tree. It would be terrible if he had survived, only to get struck dead by lightning.</p><br/><p>Seeing how it was about to rain, the young man suddenly had an idea and said to the man using his shoulder for support, “How about I carry you to see if there are any villages or towns nearby?”</p><br/><p>The man glanced at him silently. The young man smiled guiltily.</p><br/><p>The man huffed lightly. “I’m not injured to the point where I can’t even walk on my own.” Then he took his arm away and started walking on his own.</p><br/><p>The young man pouted, hurrying after him. It was just a joke!</p><br/><p>Dong Zhou was the most backwater area in the TongTian Continent. Outsiders very rarely went there because, not only did the mountains separate the place from the rest of the TongTian Continent, the spiritual energy here was weak and Dong Zhou’s tribes didn’t welcome outsiders.</p><br/><p>Since most of those who lived in Dong Zhou were the most primitive races, they weren’t open to experience, causing the development to fall behind. For example, the practitioners in Dong Zhou segregated themselves strictly from normal people. It was very rare that practitioners and normal people would be found in the same town. Of course, there were some exceptions.</p><br/><p>In ancient times, the practitioners of the TongTian Continent thought themselves blessed, they competed amongst themselves and looked down on the frail mortals. The practitioners of Dong Zhou continued with this belief, so practitioners rarely ever set foot in the towns of normal people. The hierarchy amongst practitioners was very strict as well.</p><br/><p>JiJiu Town was a second grade town of Dong Zhou. The level of the town was only marginally stronger than the world of normal people. Practitioners lived here, though their strength was relatively low.</p><br/><p>In the early morning, two people appeared at the entrance of the town.</p><br/><p>Those who were preparing to enter and leave JiJiu Town all avoided them like the plague upon seeing them, pointing and whispering as they watched the two.</p><br/><p>You XiaoMo didn’t realize that the people of Dong Zhou were xenophobic, puzzled at their behavior.</p><br/><p>However, he had pretty good hearing, and he could hear the whispers clear as day. He got the gist of it: ‘they’re dressed so well, they must be outsiders’, ‘how come there’ve been so many outsiders recently’, ‘they’re coming one after the other’ and whatnot.</p><br/><p>You XiaoMo glanced at them strangely, realizing that their clothes were all very simple, made from coarse gunny cloth. There were few if any brightly colored clothing.</p><br/><p>They had heard Cheng XiangRong say before that Dong Zhou was very behind, but they hadn’t thought that they were so behind that they couldn’t even afford a good set of clothing. Of course, this was all just speculation on You XiaoMo’s part.</p><br/><p>Dong Zhou was behind, but not to the point where the people couldn’t afford clothing. After all, how much could a set of clothing cost? The reason why they wore coarse gunny cloth was because they preferred it, and it was simple way to recognize outsiders.</p><br/><p>Just as they were about to enter the town, a man stepped in front of them.</p><br/><p>You XiaoMo stopped in his tracks, scrutinizing the other. Were they not allowed to enter or something?</p><br/><p>The man spoke, “JiJiu Town has rules that outsiders must pay an entry fee, otherwise they will not be allowed in. This is the law of Dong Zhou.”</p><br/><p>He probably added that last thought because he was afraid they would make a fuss. Though Dong Zhou was behind, they had a fair few powerhouses. If the tribes came together, even the Mage Guild would have to be careful.</p><br/><p>“How much is the fee?” You XiaoMo wasn’t displeased or anything. He knew that each place had their own rules, and many of the cities would demand an entry fee, too. In his eyes, this was pretty normal.</p><br/><p>The man didn’t think he’d be so open about it. He raised a hand and said, “Ten spirit gems per person.”</p><br/><p>That was even more expensive than a city’s entry fee, but You XiaoMo still took out twenty spirit gems and handed it over. “We can enter now, right?”</p><br/><p>The man took the easily gotten spirit gems and stepped aside, letting them in.</p><br/><p>You XiaoMo helped Ling Xiao into the town.</p><br/><p>Watching their retreating figures, a young man who had been watching ran over the man’s side, whispering, “Zhang-dage, you sure it’s fine to just let them in like that?”</p><br/><p>A smirk appeared on the man’s face. “Don’t worry, they’ll be someone there to ‘welcome’ them.”</p><br/><p>Further ahead, You XiaoMo and Ling Xiao had barely walked for a hundred meters when a young man suddenly came over, all smiley.</p><br/><p>“You two gentlemen, it’s your first time in JiJiu Town, am I right?”</p><br/><p>You XiaoMo looked him up and down. “Do you want anything?”</p><br/><p>“I’m called A Chuan, a citizen of JiJiu Town. I saw what happened at the entrance. It’s normal for people who come here for the first time to not know our rules. If there’s anything you two gentlemen want to know, just ask me.” A Chuan chuckled, his gaze darting to Ling Xiao.</p><br/><p>Ling Xiao suddenly gave a cough, pretending to be ill.</p><br/><p>You XiaoMo had a basic understanding of this man’s job now, and they needed someone familiar with JiJiu Town. Usually, they could take it slow and explore, but now that Ling Xiao was hurt, they didn’t have such a luxury.</p><br/><p>“Then, I’ll have to trouble you to lead us to the nearest inn.”</p><br/><p>“Alright, then please come with me,” A Chuan immediately replied.</p><br/><p>As A Chuan led them through the town, he told them a little about JiJiu Town. Since many of the towns in Dong Zhou didn’t like outsiders, it was better for them to stay in their room and not wander about too much, lest some less accepting people try to cause them trouble.</p><br/><p>The inn A Chuan brought them to was called HaoLai Inn. The decor was simple and the interior was clean.</p><br/><p>“Gentlemen, this inn might not be the best in JiJiu Town, but they provide comprehensive service.”</p><br/><p>You XiaoMo nodded in satisfaction, casually handing over two spirit gems. “Here’s a thank you gift. That’ll be all we need for now.”</p><br/><p>A Chuan took the spirit gems, nodding rapidly. “Thank you, sirs, I’ll take my leave now.”</p><br/><p>The owner of the inn led them to the second floor and gave them the best room. The price was very expensive, ten spirit gems a night. Apparently, this was an outsider’s price. For Dong Zhou people, it was one spirit gem per night.</p><br/><p>You XiaoMo didn’t bother arguing with them, paying for one night first before telling the owner that they weren’t to be disturbed.</p><br/><p>The owner agreed hurriedly.</p><br/><p>You XiaoMo closed the door, wanting to help Ling Xiao to the bed, only to find that the other had already walked over, his steps light. He didn’t seem ill or weakened at all.</p><br/><p>“How do you feel now?” You XiaoMo didn’t think that Ling Xiao was healed. Without proper rest and recovery, internal injuries were very hard to recover from.</p><br/><p>Ling Xiao took a deep breath and shook his head.</p><br/><p>The Qilin Clan and Demon Phoenix Clan bloodlines had been awakened in him from birth. Each bloodline made up half of his power, maintaining a sort of balance, but then he had awakened his True Dragon Clan bloodline and Black Turtle Clan bloodline, and the two bloodlines were now fighting with the other two for territory inside him. If he couldn’t calm them, then his internal injuries would only worsen.</p><br/><p>“What do we do now?” You XiaoMo asked desperately.</p><br/><p>Ling Xiao replied, “I can only try and calm them down now and think of something later.”</p><br/><p>You XiaoMo rubbed his hands together. “Alright then, you go and rest, I’ll cover for you.” Then brought a chair over, sitting on it and watching the other.</p><br/>\n</div>"}