{"title": "Chapter 567 - Dealt With", "id": 567, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-567-dealt-with", "volume_title": "Volume 6", "body": "<h1>Chapter 567 - Dealt With</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 567:</h3><h3>Dealt With</h3><h4>Translated by Jouissance of Exiled Rebels Scanlations</h4><br/><p>In the end, You XiaoMo wasn’t able to win the argument.</p><br/><p>Getting another mage to refine pills truly was quite a risk. There was too much to consider, risks and exposure and whatnot. They might as well do it themselves.</p><br/><p>“Tell me what you were laughing about just now.” After discussing the pills, Ling Xiao brought up an old topic. He had a much clearer head than You XiaoMo, able to push the topic back on track after they had gone on a tangent.</p><br/><p>You XiaoMo gave him a basic summary of what had happened in these two days, including how the owner killed outsiders and cooked them into steamed buns, almost making him eat one.</p><br/><p>“Have you been to Dong Zhou before? I think the people of JiJiu Town are all pretty disgusting.”</p><br/><p>Ling Xiao replied, “I’ve been here once before, but didn’t stay long, and that was tens of thousands of years ago. Dong Zhou has changed from what it is in my memories, but their xenophobia has always rang true, especially the practitioner towns: most of them aren’t tribesmen.”</p><br/><p>“I don’t think the townspeople will let this be. Do you want to stay in my dimension for now?” You XiaoMo suggested. He, at least, really wanted to throw Ling Xiao in there to make things simpler.</p><br/><p>Yet Ling Xiao didn’t hesitate to reject his offer. “No need. I’m not so injured that I can’t even protect myself. They’re nothing but ants; what’s there to worry about. If they really try to attack, then we’ll just kill them. Plus, your intelligence is so lacking, I’d be worried!”</p><br/><p>That’s easy for you to say!</p><br/><p>You XiaoMo glared at him. If it was just a few people, then that wouldn’t be a problem. However, JiJiu Town had thousands. It wouldn’t be possible to silence them all for certain. He didn’t want to be hunted down by everyone upon arrival to Dong Zhou.</p><br/><p>Now he had the Reincarnation Pill added to his troubles. If he messed up and made more grudges, then he could banish all thought of going anywhere with many Dong Zhou people again, and then where would he go to find the two magic herbs he was missing?</p><br/><p>Lastly…</p><br/><p>You’re the one who’s lacking intelligence! Your entire family is lacking intelligence!</p><br/><p>“Let’s do this step by step. We’ll talk about this after dealing with the owner and employees of the inn tonight. So that’s decided then. You keep resting.” You XiaoMo decided by himself. As a man, he had to be able to take command of the family.</p><br/><p>Ling Xiao cuffed him over the head. “Decided your ass.”</p><br/><p>You XiaoMo clutched his head. Being in control was too hard, and too often met with domestic violence. He was going to complain to the Women’s Federation.</p><br/><p>t/n: Women’s Federation is a women’s rights organization of China. Protecting women from domestic violence is one of their task.</p><br/><p>(Ra: so you are a woman now, Momo?)</p><br/><p>Though he had caused quite a commotion earlier today, no one had dared to come and mess with them yet. Even the strongest man of JiJiu Town had cowered, even if they did cause trouble, they’d only be looking for a beating.</p><br/><p>However, this had hindered the other outsiders, because the locals started ostracizing them even more. Now, even if they had spirit gems, no one would be willing to sell anything. Some couldn’t bare this kind of atmosphere and left directly.</p><br/><p>That night, HaoLai Inn’s innkeeper had learned from the blunder last time. Afraid that they wouldn’t eat the midnight snacks, he drugged their dinner directly.</p><br/><p>The innkeeper had the cook make a table of food and then he delivered it directly to their room. More importantly, he had to make sure that both of them ate. Otherwise, if only the young man ate then their plan would fail and they’d be found out.</p><br/><p>When the innkeeper entered, he saw the young man’s companion sitting beside the desk and was delighted. It seemed that the heavens were helping him. He didn’t need to risk being found out and find a way to get the other over.</p><br/><p>“Sirs, here is the food you ordered!” The innkeeper set the dishes on the table energetically, his expression cheerful. Then, he placed a pot of tea on the table, too, bidding them a good meal before leaving with a skip in his step.</p><br/><p>Staring at the feast set out on the table, You XiaoMo felt disgusted, especially by the meat dishes. Who knew if they were made from human meat or not. The very thought made him want to puke.</p><br/><p>Ling Xiao sifted through the plates of meat, saying emotionlessly, “Judging by the smell, it’s probably human meat.”</p><br/><p>You XiaoMo retched.</p><br/><p>Ling Xiao poured a cup of tea and took a sniff. It had been drugged, too.</p><br/><p>A whole table of food, no matter vegetarian or meat dishes, it was all drugged. They were dead set on drugging them.</p><br/><p>If it wasn’t made from human flesh, You XiaoMo would still eat it even if it were drugged. It wasn’t like the drugs would have much of an effect. But now he had no appetite at all.</p><br/><p>On the first floor, the innkeeper felt that it was about time and took some people upstairs.</p><br/><p>To ensure that they would be able to get their prey today, they had knocked all the other customers unconscious to prevent anyone from messing up their plan.</p><br/><p>The cook held a kitchen knife. No matter cooking or killing, she only used this knife. The two employees each held a large swords.</p><br/><p>The four crept towards their target’s room. The owner had the highest cultivation base and sensed no movement from the room. She knocked on the door, and there was no answer. They must’ve fallen for it.</p><br/><p>After pushing open the door and entering, they saw You XiaoMo and Ling Xiao collapsed on the table as expected, half of the food eaten. The teapot had been knocked over, and the tea had spilled onto the floor, forming a large damp spot.</p><br/><p>“Innkeeper, they fell for it.” The first employee excitedly walked over, sword in hand, and realized that they really weren’t moving at all.</p><br/><p>The second employee was a mute, and simply swung his sword in the air to express his excitement.</p><br/><p>The cook sheathed the knife at her side and took out the rope they had prepared and asked, “Innkeeper, should we tie them up now?”</p><br/><p>“No need,” the innkeeper said. “The other customers have already been knocked out. No one will notice for a while. Let’s find their magic bags first.”</p><br/><p>The innkeeper then went to You XiaoMo and lifted his robes, looking around his belt. Yet there was so sign of any magic bags. He couldn’t help but feel confused. “Weird, where is it?”</p><br/><p>Originally it had been this young man that had paid. He had personally seen the other take out spirit gems, so that’s why he searched the young man first.</p><br/><p>The innkeeper then walked to Ling Xiao’s side and didn’t find a magic bag after searching him either. He then had an idea and pulled out their hands, but there was still nothing.</p><br/><p>“Boss, what’s going on?” The cook asked hurriedly.</p><br/><p>The innkeeper shook his head. “It’s really weird. There’s no magic bags, nor any dimension rings. Then where did they put their spirit gems?”</p><br/><p>“In a pocket dimension of course!”</p><br/><p>The four nodded in wide-eyed realization.</p><br/><p>The innkeeper paled, looking down and seeing the young man lying on the table, his eyes black and bright, watching them with a smile. The man next to him had also woken up, supporting his chin with one hand and watching them in boredom. His expressionless face was terrifying.</p><br/><p>“Run!” The owner roared, and turned to flee.</p><br/><p>What was a pocket dimension? Something that only the powerful would have!</p><br/><p>You XiaoMo was much faster than them. In the blink of an eye, he had appeared at the entrance to the room. The innkeeper was shocked and skidded to a halt, but the two employees weren’t able to stop in time and crashed into him, falling onto him.</p><br/><p>The cook was rather large, and not as fast, seeing You XiaoMo blocking the way, she immediately slashed at him viciously.</p><br/><p>You XiaoMo kicked the knife out of her hand, sending it flying into the door frame. The cook bellowed in fury, lunging for him in a body slam!</p><br/><p>You XiaoMo felt most disgusted about this cook because she was the one who made dishes out of human flesh. Who knew what the peanuts and sweet lotus roots he had eaten on the first night had been contaminated with. At this thought, he shuddered in disgust and didn’t show any mercy as he kicked out.</p><br/><p>The cook screamed as she was sent flying. Her momentum seemed to be about to send her crashing out onto the pavement. However, just as she reached the closed windows, her body slammed into a transparent barrier.</p><br/><p>The shopkeeper and two employees had just gotten up off the floor, but upon seeing this, they decided to silently lie back down.</p><br/><p>You XiaoMo walked over and kicked them. “Get up. Don’t play dead or I’ll send you to see Yama right now.”</p><br/><p>Who was Yama? The three didn’t know, but it definitely wasn’t someone good. They hurriedly got up and cowered in the corner.</p><br/><p>t/n: Yama, or the King of Hell, is a Hindu god and a part of Buddhism. They didn’t know about this god mainly because buddhism doesn’t exist here, as well as gods.</p><br/><p>“My good sirs, we were wrong, please let us go! We only rob people because we’re forced to. We promise to never do this again!” The innkeeper was scared witless by his viciousness. He dared to bet that You XiaoMo was the young man that had caused that commotion at the tailor shop earlier today.</p><br/><p>If it wasn’t for the fact that he knew they had killed people and cooked them to serve in dishes, You XiaoMo might’ve been somewhat moved. Robbery and killing was something many people did, but there was still a difference.</p><br/><p>You XiaoMo kicked the man harshly. “Yeah, you can promise to not lure people in and rob them. Then what about killing them and cooking their flesh? You take me for a fool?! Forced my ass. You think I can’t tell that you’ve been doing this for a fair few years?”</p><br/><p>That A Chuan clearly was an accomplice, and it wasn’t the first time he had done this. It was obvious from the exterior that HaoLai Inn had been here for at least ten years. They were swift and practiced at killing. Even the drugs were the kind that could knock a practitioner unconscious.</p><br/><p>Forced? Bullshit. Only twisted people could do something like this.</p><br/><p>“How should we deal with them?” You XiaoMo kicked them a few times to vent his frustrations before returning to Ling Xiao, still enraged.</p><br/><p>Ling Xiao said lightly, “How else? Kill them!”</p><br/><p>You XiaoMo scratched his head. “Alright.”</p><br/><p>This was the first time he unhesitatingly agreed with Ling Xiao’s murderous suggestions! Amazing!</p><br/><p>On the following morning, the neighbors woke up to find that HaoLai Inn had been burned to the ground and none of them had noticed. Apart from the missing innkeeper and employees, the customers at HaoLai Inn had all been thrown onto the streets unharmed.</p><hr/><h5>Ra: Sometimes I think Addis has this urge to chop me into human meat bun like this female chef, I wonder why.</h5><h5>Addis: ….Just give me your IP address then I can find out where you live. Ne~</h5><br/>\n</div>"}