{"title": "Chapter 566 - The Reincarnation Pill", "id": 566, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-566-the-reincarnation-pill", "volume_title": "Volume 6", "body": "<h1>Chapter 566 - The Reincarnation Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 566: The Reincarnation Pill</h3><h4>Translated by Kollumceti of Exiled Rebels Scanlations</h4><br/><p>The reason why the people of JiJiu Town dared to defraud outsiders was not that they had strength of their own, but that the outsiders who were strong would generally avoid such a remote town. Besides, Jijiu Town had a history of thousands of years and nothing unfortunate had ever happening in JiJiu Town ever since the people became xenophobic.</p><br/><p>As time passed, this phenomenon gradually branded a deep world-view in the hearts of the people of JiJiu Town. So what even if we defraud you? Do you dare to become enemies with all the residents of JiJiu Town?</p><br/><p>Everyone harbored such a foolish-to-the-extreme belief. It could also be said that they had never seen the outside world.</p><br/><p>In actual fact, any ordinary practitioners would not dare to resist them. Everyone maintained the notion of ‘it is better to avoid unnecessary trouble’. After all, this was the territory of others, and the real experts were not interested in arguing with a group of nobodies and would not normally stay in such a remote area. This was why the present situation was brought about.</p><br/><p>Therefore, everyone was struck dumb when they suddenly met a rebellious person.</p><br/><p>The people in the tailor shop were frightened by You XiaoMo’s aura and each and every one of them did not react. The people on the streets discovered the abnormality inside and crowded at the doorway to watch.</p><br/><p>The proprietress stared at You XiaoMo in shock. She should normally compromise when under such an aura, yet she did not and bellowed while pointing at You XiaoMo with her forefinger instead. “You’re just an outsider! Yet you dare to act wildly in this old woman’s territory! Do you think that just because you have some strength, you can make a move in JiJiu Town? Let this old woman tell you, this old woman’s husband is the strongest person in JiJiu Town. If you dare to start a fight with me, my husband will never let you off.”</p><br/><p>The proprietress was not lying. Her husband did have some strength. Otherwise, how could she own the only tailor shop in JiJiu Town when it was so big?</p><br/><p>This was the advantage of strength. Others were afraid to offend the husband of the proprietress, so they did not dare to open a tailor shop. Moreover, the proprietress was a very petty person. She did not allow others to open a tailor shop to compete for business with her. The only silver lining was that the prices of the clothes she sold were not too expensive.</p><br/><p>You XiaoMo rolled his eyes, “I would like to know how your husband would never let me off.”</p><br/><p>The proprietress was so furious that her face was ashen. A tall and study man suddenly walked through the doorway.</p><br/><p>“What high-sounding sentiments! Laozi has moved about unhindered in JiJiu Town for several decades. This is the first time I’ve ever met someone who dares to provoke Laozi. You have a lot of nerve!”</p><br/><p>T/n: Laozi = an arrogant way to prefer to oneself.</p><br/><p>The proprietress’s eyes lit up. She immediately threw herself into the man’s arms and put on a coquettish act, “Husband, he bullied me. You must help me get revenge.”</p><br/><p>The man was the husband of the proprietress. He came here today just to see how his wife’s business was going since he had nothing to do. As a result, he happened to come across this scene.</p><br/><p>You XiaoMo nearly got goose bumps with how quickly the proprietress’s tone changed. Just a moment ago, she was like a fierce old hen, but now she became a vixen that was like a willow branch trembling in the wind. Her expression changed extremely fast, and her acting skill was enough to make her a movie queen.</p><br/><p>You XiaoMo took out twenty spirit gems and put them on the counter before he said, “I’ve paid the spirit gems. I believe that you two should have no objections. Then may we never meet again.”</p><br/><p>The man saw that he wanted to walk away and snorted in contempt, “You dare to bully my wife? And you want to leave just like this? You’d better leave your life behind!”</p><br/><p>With that, he quickly pulled out the broadsword on his back and fired off a sharp sword light. The sword light quickly streaked through mid-air towards You XiaoMo, as if to split him in two.</p><br/><p>However, just before the sword light was about to split You XiaoMo’s back into two, a milky white radiance suddenly blocked it. The sword light seemed to have sunk into a sponge as paused for a second before it suddenly rebounded back. The man did not expect this and it was too late for him to evade so he could only hastily block it with his broadsword. The impact caused the man to retreat a few steps backward. The proprietress who was leaning on him was caught unprepared and fell onto the floor with a screech.</p><br/><p>You XiaoMo turned back and sent a fist smashing at the man. Although it was beneath him to argue with a weak man, such people must be taught a lesson. Otherwise, they would only go from bad to worse. The strongest man in JiJiu Town, right? It just so happened that he could now kill the chicken to warn the monkey.</p><br/><p>As a result, the man and his wife were the first to become the products of tragedy under You XiaoMo’s fist.</p><br/><p>Within a single movement, he had overthrown the strongest man in JiJiu Town. Moreover, the other party did not have the slightest resistance. What did this mean? It meant that he was much stronger than the man.</p><br/><p>The crowd of onlookers on the street ran away in a flash.</p><br/><p>“Don’t kill me! I won’t dare to do it again, don’t kill me!” The proprietress crawled on the ground with her head in her arms as she trembled. She was really scared. Her man was behind her and could hardly get up after being smashed by You XiaoMo’s fist once.</p><br/><p>The man, like his wife, bullied the weak and feared the strong. When he saw You XiaoMo’s fist was stronger than his, he immediately begged for mercy. Where was the demeanor of the strongest expert in JiJiu Town? It had been thrown into the cesspit.</p><br/><p>“Not every outsider can be bullied so easily. Some people don’t resist because they don’t want to argue with weak people like you. Don’t be too arrogant. If you provoke someone with a worse temper than mine one day, it will only bring disaster to JiJiu Town.” After saying these words, You XiaoMo walked out of the tailor store.</p><br/><p>As he did not want anyone to know that he stayed in the inn, he walked around the town a few times and threw off some tails before silently returning to the inn.</p><br/><p>The news of an outsider causing a disturbance in the tailor store spread quickly. By the time he came back, the innkeeper and his assistants had heard about it. They suspected that it might be You XiaoMo. The innkeeper came up to sound him out not long after he returned to his room.</p><br/><p>“Honored Guest, I’ve heard that something big had happened in the tailor store at Five Flowers Street. There was an outsider who stirred up trouble there, but I’m not sure what happened. Do you know of it?” The innkeeper heard that it was a young man who caused the incident and he was somewhat apprehensive.</p><br/><p>You XiaoMo raised his eyebrows in astonishment, “I seem to have heard of it, but I haven’t been to Five Flowers Street so I’m not very sure. After this happened, the people on the street were eying outsiders with hostile glares so I came back.”</p><br/><p>Hearing this, the innkeeper slightly relaxed.</p><br/><p>It’s good if it’s not him, otherwise they could only cancel their plan.</p><br/><p>“Honored Guest has not eaten anything after coming back. Do you want this servant to ask the chef to make something for Honored Guest to eat?” The innkeeper quickly changed the topic.</p><br/><p>You XiaoMo, “Not for the time being. There’s still another hour before it’s time for dinner. I’ll call you then.”</p><br/><p>“Then this servant will not disturb the Honored Guest any longer.”</p><br/><p>When the innkeeper left, You XiaoMo closed the door and let out a light laugh.</p><br/><p>“What are you laughing at?” Ling Xiao’s voice suddenly came from behind the screen. His voice contained a rare trace of hoarseness and deepness as if he had not spoken for a long time. It seemed particularly dignified and mature.</p><br/><p>You XiaoMo ran in delightedly. Sure enough, Ling Xiao’s eyes were open, “How do you feel? Is your internal injury much better now?”</p><br/><p>“It’s better, but to recover completely, I need magic pills to supplement it.” Ling Xiao covered his chest with his hand, it was very difficult for him to suppress the four rioting bloodlines once more. Unless he could harmonize the four bloodlines together, the bloodlines would riot if he used his killing move again in the future. However, he was unable to harmonize the four bloodlines at present.</p><br/><p>Pill refining was his special skill.</p><br/><p>You XiaoMo immediately asked, “What magic pill?”</p><br/><p>Ling Xiao replied, “A Grade Four Rainbow magic pill.”</p><br/><p>You XiaoMo, “…”</p><br/><p>You didn’t even say the name of the magic pill and just said the grade. Hey big bro, can we make a deal to lower your requirement? This one’s cultivation is currently only at Grade Two ah! !</p><br/><p>Ling Xiao gave his head a knock, “No!”</p><br/><p>You XiaoMo pouted, so stingy, “What’s the magic pill that you want called?”</p><br/><p>Ling Xiao replied, “The Reincarnation Pill. This pill should be among the pill recipes your ancestor left to you.”</p><br/><p>You DanQing was indeed the ancestor of You XiaoMo, but with the word ‘left’ was somewhat thick-skinned. He had obtained it purely by a coincidental chance. If not for Duan QiTian, You XiaoMo would ever have come into possession of the pill recipes his ancestor had ‘left’ behind for him in this lifetime.</p><br/><p>You XiaoMo took out the jade drive he had copied before and sure enough, he found the Reincarnation Pill inside.</p><br/><p>The Reincarnation Pill was a Grade Four Rainbow Level magic pill. If it’s quality was high, the effects would really be in defiance of the natural order. It was rumored that as long as a person with broken meridians took this pill, they could change from a waste back to their original state. If their luck was good, it was even possible for them to widen their meridians. They would be able to get twice the result with half the effort during cultivation. It was extremely rare and was tantamount to life taking a favorable turn, thus it was called the Reincarnation Pill.</p><br/><p>However, You XiaoMo shittyly found that although the main magic herbs needed for the Reincarnation Pill were not as rare as the Samsara Pill, they were still hard to come by. He did have them in his dimension, but there was not enough to refine one pill. There were also some that were still growing in the magic herb field and he was also missing two stalks of magic herbs which he needed.</p><br/><p>It couldn’t be helped if his cultivation was too low, but even the magic herbs were bullying him!</p><br/><p>You XiaoMo’s expression turned bitter. What year and what day would he be able to help Ling Xiao refine the Reincarnation Pill?</p><br/><p>“Why don’t we find someone to help you refine it?”</p><br/><p>“No!” Ling Xiao bluntly rejected.</p><br/><p>You XiaoMo was puzzled, “Why?”</p><br/><p>It would take who knows how long if they waited for him to become a Grade Four mage. This was the only method that would not delay the treatment of Ling Xiao’s internal injury.</p><br/><p>Ling Xiao answered with a straight face, “There is only one Grade Five Rainbow Level mage in Dong Zhou. That person is a member of the Guma Tribe. It’s almost impossible to ask him to lend us a hand. On the contrary, it will reveal our whereabouts instead. You must know that the Guma Tribe and the Vermillion Blood Clan have business dealings with each other. Furthermore, asking him to help would mean letting him see the pill recipe for the Reincarnation Pill. Would you be willing to do that? Lastly, I don’t like to eat magic pills refined by other people.”</p><br/><p>You XiaoMo’s mouth twitched. Having said so much, the last sentence was the main point right?</p><br/>\n</div>"}