{"title": "Chapter 572 - Inquiry", "id": 572, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-572-inquiry", "volume_title": "Volume 6", "body": "<h1>Chapter 572 - Inquiry</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 572: Inquiry</h3><h4>Translated by Crystal of Exiled Rebels Scanlations</h4><br/><p>The two, once again, hurried back to the cave before sunset.</p><br/><p>They had stayed in the cave for about two months. You XiaoMo felt that it was almost their second home, as he made sure it was cleaned from inside out.</p><br/><p>That night, he didn’t feel like cooking.</p><br/><p>It was good that they didn’t need to eat everyday so that without any objection from Ling Xiao, he just didn’t do anything.</p><br/><p>During the night, You XiaoMo laid on the bed, tossing and turning, unable to sleep. He couldn’t cultivate either, as he was so restless. His mind was preoccupied by the man in black who saved Su Lang in the afternoon.</p><br/><p>They were wearing masks, so the man in black probably didn’t know who they were. That was probably why he didn’t cover up his identity when he took away Su Lang. Even though it was for a split second, You XiaoMo knew he saw it correctly.</p><br/><p>With one leg on Ling Xiao’s body, You XiaoMo shifted half of his weight onto him, “Ling Xiao, are you asleep? If you aren’t, talk to me.”</p><br/><p>“I’m asleep.” Ling Xiao replied, eyes closed, after two seconds of silence.</p><br/><p>With one arm hooking his neck, You XiaoMo said with anger, “Liar, how are you answering me if you’re asleep?”</p><br/><p>Ling Xiao, “I’m sleep talking.”</p><br/><p>You XiaoMo flipped around so that his whole body was on top of him and reached out devilishly, lifting his right eyelid. Finding it incredibly humorous, he started laughing hysterically, “Are you still going to sleep talk?”</p><br/><p>Ling Xiao slapped his hand away, “Quit it.”</p><br/><p>“Then talk to me~ I held everything back, if I don’t talk now, I’m going to suffocate.” You XiaoMo said as he rubbed his arm, even though it wasn’t slapped away with much force, it still turned a bit red.</p><br/><p>Ling Xiao give him the cold-shoulder, “What is there is to say, isn’t it just that?”</p><br/><p>You XiaoMo continued on angrily, “Although he said he was from the Guma Tribe before, I still felt weird. The one I saw today was different from how he was. He used to fool around a lot, was careless of the things he said, and was just like a frivolous teen. But now, if they didn’t have the same face, I would’ve thought that they were completely different people!”</p><br/><p>Even though it was just a quick glance, the feeling he got was very clear.</p><br/><p>“The answer is obvious, he was pretending before.” Ling Xiao answered, completely bored and uninterested. He didn’t believe that it was something worth discussing, since the answer was obvious.</p><br/><p>“Then why did he pretend?” You XiaoMo asked.</p><br/><p>If he truly was from the Guma Tribe, then what he said before wasn’t wrong. Then why the disguise? Was it to defend against the evil of human nature?</p><br/><p>But the two didn’t appear to have a direct correlation.</p><br/><p>“How I’m I supposed to know!” Ling Xiao said.</p><br/><p>You XiaoMo laid on his chest and continued, “I just feel like he has some unspeakable secret or something. Also, he should be still at the XiaoYao Institution. He didn’t have a reason to be at Dong Zhou and now that two months had passed, it was soon to be another round of the challenge matches.If he didn’t go back soon, he’s not going to make it.</p><br/><p>“Maybe his objective wasn’t the XiaoYao Institution in the first place.” He drove away all sleepiness from Ling Xiao, so that all he could do was hold a serious conversation.</p><br/><p>Seeing that he was finally coming on board, You XiaoMo got even more excited, “Then what do you think his true intention is?”</p><br/><p>It was not that he wanted to suspect them, it was just that with their current predicament, all problematic people must be treated with caution.</p><br/><p>“Then let’s think about it. He told you before that he was all alone right?” Ling Xiao flipped around to look at him deep into the eyes.</p><br/><p>You XiaoMo nodded, “He did say that and if I recall, he didn’t state that he was from the Guma Tribe in the beginning. It was only after the uncle asked him, did he confirm it. Thinking back, his answer was a bit ambiguous.”</p><br/><p>Ling Xiao said, “If he made a move then that must mean that person’s closely related to him. Thinking back on the young man he saved, it was someone who could wait in WuShan Town for us and knew that we bought his magic herb. It’s likely that he is from the WuShan Town, if he was not from the town, then the chances of him buying for others, is low. It’s also unlikely for him to stay in the same place for such a long time.”</p><br/><p>“Right, right, right.” You XiaoMo kept nodding, they finally came to an understanding. “Not only that, it felt like he purposefully waiting for us to leave before making a move.”</p><br/><p>Ling Xiao wrapped his arms around You XiaoMo’s waist, with his head in in the other’s neck and said unconcerned, “He is probably like us, not wanting to make a scene in town. He probably needs to keep his identity a secret, if you’re truly curious, we can find a time to investigate.”</p><br/><p>You XiaoMo blinked, “No time like the present, should we go tomorrow?”</p><br/><p>Ling Xiao lifted his head to show the laziness in his eyes, “Can I say no?”</p><br/><p>“Nope.”</p><br/><p>“Then get rid of your question mark at the end.”</p><br/><p>“Haha…..” You XiaoMo started laughing, it was the first time he felt true resignation from Ling Xiao. It was very pleasant, after all, what comes around, goes around.</p><br/><p>Ling Xiao smiled eerily towards him, “You’re happy?”</p><br/><p>The light in the cave had changed to a dim one from the Night pearl. With the help of the background lighting, Ling Xiao’s eerie smile worked wonders. You XiaoMo instantly shut up and shook his head like no tomorrow.</p><br/><p>“No, I was just happy for tomorrow.”</p><br/><p>“Tomorrow hasn’t happened yet, what is there to be happy about? Since you can’t sleep and I was woken up because of you, then let’s do something to waste the night away. I’ll give you a second to consider it. Okay, looks like you agreed too. Then, what position do you like?” Ling Xiao said without stopping, making someone completely dumbfounded.</p><br/><p>It wasn’t until Ling Xiao had striped him down half way, posed him in a difficult position, did he make a weak reply, “Actually, I prefer to be the rider!”</p><br/><p>“Too late, I’d already given you a chance. You didn’t respond so the choice’s mine.” Ling Xiao said as he grabbed hold of You XiaoMo’s delicate part.</p><br/><p>You XiaoMo took a deep breath and said, with a trembling voice, “This is too hard, I won’t be able to get up tomorrow.”</p><br/><p>Ling Xiao’s delighted voice rose beside his ear, along with it, the heat of his breath, “I permit you to drink the spiritual water tomorrow.”</p><br/><p>You drink it! You XiaoMo was bright red from anger.</p><br/><p>He never let him drink it before, but now to satisfy his lust, he was actually allowing it! Such a pain!</p><br/><p>The next day, the sun rose and the light from the luminous pearl was covered. The morning light lit up every corner of the cave. In sourness and pain, You XiaoMo opened his eyes. Gaining consciousness, his first thought was to grab the spiritual water and drink it without an ounce of hesitation.</p><br/><p>After resting for a few minutes, the pain and sourness of his body finally dulled.</p><br/><p>You XiaoMo instantly jumped out of the bed. Crisp, clean, and handsome.</p><br/><p>“……” As Ling Xiao watched the whole process, he went into deep reflection. He really shouldn’t have agreed in letting him drink the spiritual water.</p><br/><p>After that, they headed out for Wushan Town. Since they didn’t chase after them the day before, they didn’t know where the other two lived. After some deliberation, they decided to check the Magic Herb Hall out.</p><br/><p>Due to the attention-grabbing-nature of the masks, when You XiaoMo entered the city, he bought two black cloaks. With just the hood, half of their face was covered.</p><br/><p>Manager Li, from the transcendent level section didn’t know much about Su Lang but knew that manager Zhang, from the high level section knew a bit more. Su Lang was a repeat customer of the high level section.</p><br/><p>Last time was his first time buying magic herbs from the transcendent level section. Manager Zhang was very caring of Su Lang and they were well antiquated since he even asked manager Li for a favor, giving Su Lang a twenty to thirty percent discount.</p><br/><p>That left a sour taste in manager Li’s mouth.</p><br/><p>The reason being that managers had to take care of more than the stuff in their section, so they were also given a cut of the transactions in their section as a reward. With the transcendent level magic herbs being sold at such a high price, every cut was a fortune.</p><br/><p>Asking for a twenty to thirty percent discount was at least cutting three to four million spirit gem off of every purchase. That wasn’t cheap and it was tied to his performance as well. He wasn’t even close to Su Lang, why should he give a discount?</p><br/><p>But manager Zhang was at least a manager of the high level section, he needed to give some face, but this thing had been bothering him. The moment You XiaoMo arrived, he figured it wasn’t for anything good, so he just revealed everything.</p><br/><p>Afraid of alerting the other by acting rashly, You XiaoMo gave the manger two hundred thousand spirit gems, asking him to find out more. If he came across anything, he would add an extra two hundred.</p><br/><p>Four hundred thousand was a lot, and manager Li only hesitated for a bit before agreeing. He promised that he would find out in a day, so this time You XiaoMo gave his contact information, as they were planning to stay in WuShan Town.</p><br/><p>You XiaoMo didn’t leave right after the transaction. He thought it through, he wasn’t going to collect magic herb seeds in secret anymore.</p><br/><p>He was going to openly search for transcendent level magic herb seeds. The first stop was this Magic Herb Hall. Manager Li just got a deal, so he was even more courteous with You XiaoMo and Ling Xiao. Thus, he took care of the seed problem.</p><br/><p>There were a lot of seeds collected over the years as no one bought them, so manager Li kept them stored. There were many for each kind, with a good variety too.</p><br/><p>You XiaoMo took it all and amongst them was the seed of both the Heart Flower Magic herb and Black Lotus herb. It made him want to cry but no tears came out. He felt ripped-off.</p><br/>\n</div>"}