{"title": "Chapter 583 - Ambusher", "id": 583, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-583-ambusher", "volume_title": "Volume 6", "body": "<h1>Chapter 583 - Ambusher</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 583: Ambusher</h3><h4>Translated by Jouissance of Exiled Rebels Scanlations</h4><br/><p>The two soon arrived at their destination.</p><br/><p>The geography of the White Tiger’s head was much less wholesome than You XiaoMo predicted. They couldn’t tell from the map. After all, it wasn’t possible that every little aspect would be drawn and recorded with perfect accuracy, so it wouldn’t be an easy task to find the right eye in such a horribly destroyed terrain.</p><br/><p>You XiaoMo decided to split the work up between him and Ling Xiao to find it faster.</p><br/><p>“You start looking from the left, I’ll start from the right. If we find anything suspicious, we call the other with the transmitter stone or record the location.”</p><br/><p>Ling Xiao didn’t object. “Be careful.’</p><br/><p>“Don’t worry!” You XiaoMo waved at him and ran to the right. At his cultivation level, he wouldn’t have much of a problem even if he did meet Dong Yu Bandits. Being a grade Three Rainbow Level mage was no joke.</p><br/><p>You XiaoMo flew around a kilometer, landing on a thick tree. The tree seemed over a thousand years old, but had long since lost any signs of life, leaving behind an empty shell.</p><br/><p>Comparing the two maps, he was certain that the right eye was nearby. However, when he had used his soul power to sweep the area, he hadn’t found anything like a cave dwelling, only ruins scattered about, capable of hiding only a few people.</p><br/><p>Several hundred meters away, there was also a massive canyon. It was so deep that you couldn’t see the bottom.</p><br/><p>According to the people in the town, spacial forces wreacked chaos at the bottom. Anyone who fell in wouldn’t have any hope of return. It was doubtlessly the single most dangerous place in Dong Yu.</p><br/><p>You XiaoMo stood on the tree, looking into the distance. He was able to see the vague outline of a black ribbon like thing. That was the Black Canyon.</p><br/><p>You XiaoMo couldn’t help but run over and take a look.</p><br/><p>Looking down from the steep wall he was standing on, a blast of wind coming from below attacked his face, the howling reminiscent of the screams of a female ghost.</p><br/><p>He had heard from the townspeople that this was the place that caused the most deaths.</p><br/><p>They said that some people thought there might be a legendary cave dwelling here. After all, it was very dangerous, and the more danger there was, the more likely that there was something valuable to be gained. So, there were often teams of people who didn’t fear death that came here. However, no matter what team came, they always returned with less than a fifth of their original number.</p><br/><p>No wonder he and Ling Xiao hadn’t seen a single person on their way over.</p><br/><p>There were plenty of people who were terrified of death, especially of a place like this that continuously had rumors of being a practitioner’s grave. So barely anyone came anymore.</p><br/><p>Thus, the Black Canyon became a death zone.</p><br/><p>“Huh?” You XiaoMo was about to look away when he seemed to glimpse a flash of something down below, like light reflected up by a mirror. If it was a natural phenomena, it was unlikely that it would flash away so quickly. Er, was someone down there?</p><br/><p>Just as this thought passed through his mind, a wave of killing intent rose behind him and killing energy locked onto him, darting forwards towards him and aiming to assassinate him.</p><br/><p>You XiaoMo jumped into the air, his toes pushing off of the sword that appeared where he had been standing mere moments ago. He used this momentum to flip 360 degrees in the air, his right foot sweeping towards the black robed man who was wielding the sword.</p><br/><p>The black robed person couldn’t retract his sword fast enough and so he blocked the attack with his other arm before using the power from You XiaoMo’s kick to retreat several tens of meters. His figure landed on a sharp crag, his killing intent not faltering at all. His empty eyes were fixed on You XiaoMo, not budging his gaze by even a fraction.</p><br/><p>You XiaoMo was pretty sure he didn’t know this person and had never had any entanglements with him, so there was little chance that he had offended this person. So why did this person ambush him?</p><br/><p>“Who are you? Why did you ambush me?”</p><br/><p>The only answer he received was the black robed man once again raising his sword, poised to strike. The energy around him swelled, like a sword being unsheathed, and then the man became a streak of black, swiftly charging at You XiaoMo.</p><br/><p>You XiaoMo admitted that this black robed man had a very high cultivation base, stronger than that bandit leader and Xie Jun, but that didn’t mean You XiaoMo would be afraid.</p><br/><p>Well, since this guy so stubbornly kept his mouth closed, then You XiaoMo would beat him until he spoke. He didn’t want to be hunted without reason – there had to be a source to this. If they had gotten the wrong person, then that would just be sad!</p><br/><p>You XiaoMo faced the black robed man bare-handed, not at all falling to a disadvantage.</p><br/><p>The battle between the two raged wildly, kicking up dust and rocks and cracking open the earth. The two were extremely fast. If someone else was here, they’d probably only be able to see afterimages of their forms.</p><br/><p>Yet soon enough, some spectators really did arrive.</p><br/><p>It was none other than Mo Xue, Xie Jun and company that You XiaoMo and Ling Xiao had left not half a day ago. Xie Jun’s original goal had been the Black Canyon, too, so it wasn’t unexpected that he’d appear.</p><br/><p>They could see the two fighting figures from quite a ways away. The powerful aura and killing intent from the two had them afraid to approach.</p><br/><p>“Xie Dage, didn’t you say that explorers very rarely come here. How come there are people fighting here? Will it affect us?” Mo Xue clung to Xie Jun, fragile like a little bird.</p><br/><p>Xie Jun’s arm went around her waist quite casually and, hearing of her question, replied confidently, “Some powerouses are interested in these dangerous places, and those that start fighting on a whim aren’t few. So long as we don’t go near them, they shouldn’t attack us.”</p><br/><p>“That’s good then.” Mo Xue looked at him with admiration.</p><br/><p>Though Xie Jun had ulterior motives for Mo Xue, seeing her look at him so worshipfully wasn’t bad.</p><br/><p>Behind them, Niu XuYang frowned as he watched this.</p><br/><p>“Xie Dage, are we really going to wait for them to finish before heading over. We have so many people, so can’t we just go over now?” Mo Fei liked Xie Jun, too and immediately squeezed herself against Xie Jun’s other side, looking up at him with innocence. Her gaze was filled with trust for Xie Jun, and she pretended to not notice the glare her older sister shot her.</p><br/><p>Xie Jun’s expression stiffened for a moment. Would he have to admit that all of them added together wouldn’t be a match for either of the two? He couldn’t say something that would damage his image so.</p><br/><p>Niu XuYang caught the flash of discomfort on his face and immediately said, “Mo Fei, your Xie Dage thinks we’re too weak and not a match for the two, so that’s why he’s planning on waiting for the two to finish fighting before heading over.”</p><br/><p>Xie Jun’s expression twisted.</p><br/><p>Mo Fei wasn’t looking at Xie Jun’s face and, hearing Niu XuYang demeaning her Xie Dage, immediately retorted, “Niu XuYang, don’t talk nonsense. You’re weak; don’t go around thinking everyone is weak like you.”</p><br/><p>Niu XuYang glanced at Xie Jun, whose expression was growing uglier by the second, and scoffed before shutting up.</p><br/><p>Mo Fei thought that she had struck Niu XuYang’s nerve and continued to mock him. She didn’t notice Xie Jun’s expression at all until Mo Xue spoke up and scolded her.</p><br/><p>“Mo Fei, shut up.”</p><br/><p>Mo Fei was about to retort, but she suddenly saw Xie Jun’s expression and seemed to understand something, going silent in fear, but not forgetting to shoot Niu XuYang a glare.</p><br/><p>As they spoke, You XiaoMo and the black robed man’s battle was coming to a close.</p><br/><p>Though the black robed man was experienced in combat, his cultivation base was lower than You XiaoMo’s, and as time went by, the gap between them became more obvious.</p><br/><p>You XiaoMo had put on a pair of golden gloves made from the silk of his golden winged insects. Though the craftsmanship was rough, and it looked ugly, but the effect was top notch. He had managed to break the black robed man’s sword with these gloves.</p><br/><p>And the broken sword was lodged in the chest of the black robed man.</p><br/><p>The black robed man’s empty gaze become more and more lifeless as his life drained away. His gaze was filled with despair, and the flash of incredulousness.</p><br/><p>You XiaoMo hadn’t shoved the sword into his heart, otherwise he would’ve been dead by now and not on his last breath. He wanted to know why the man had ambushed him and if it had something to do with the flash at the bottom of the canyon.</p><br/><p>Before he could ask anything, though, the black robed man slumped as he died.</p><br/><p>You XiaoMo approached him and realized that the other had completely died. Was the guy afraid of him interrogating him and thus committed suicide?</p><br/><p>Did he really look so evil?</p><br/><p>You XiaoMo retracted his gaze, turning his gaze towards Xie Jun and company. He had noticed them ages ago. He simply didn’t have the time to bother with them before.</p><br/><p>It was only when he properly looked at them that he realized that these people were familiar faces. Trouble really did always follow him, how come he bumped into them again?</p><br/><p>Mo Xue and company then realized that the person they were afraid of was a familiar face.</p><br/><p>At first they had only seen his back and weren’t able to recognize him, after all, they had only met each other twice. It wasn’t until he turned around that his face was revealed to them.</p><br/><p>Mo Xue and Mo Fei’s expressions were ugly like they had just eaten shit. Their eyes were wide, jaws dropped. Reality had played a cruel trick on them. The person they had looked down on was a true powerhouse?</p><br/><p>Unlike them, Xie Jun’s reaction was different. His gaze didn’t leave the golden gloves You XiaoMo was wearing. He had personally witnessed how You XiaoMo had snapped the sword with the gloves.</p><br/>\n</div>"}