{"title": "Chapter 590 - Dead", "id": 590, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-590-dead", "volume_title": "Volume 6", "body": "<h1>Chapter 590 - Dead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 590: Dead</h3><h4>Translated by Kollumceti of Exiled Rebels Scanlations</h4><br/><p>Perhaps one would assume that the most precious thing in the White Tiger Palace was the Water Elemental Essence. This was absolutely a treasure amongst treasures for the Qilin Clan, because there existed a method of breaking the shackles of the Sacred Realm by using five types of Elemental Essences in the Qilin Clan’s inheritance.</p><br/><p>But there had only been one person who truly gathered the five Elemental Essences from ancient times till now – this person was the progenitor of the Qilin Clan and was an expert belonging to the same period as the White Tiger. However, that person had not succeeded, because the chances of gathering the five Elemental Essences was only one percent.</p><br/><p>However, Ling Xiao did not think that the most precious thing here was the Water Elemental Essence. He had other ideas when they found an extremely well-preserved and completely intact body of Bai Hu on a soft bed in one of the side chambers.</p><br/><p>“No wonder Bai Hu had no descendants despite being one of the Five Great Spiritual Beasts. There are no other demon beasts who have the purebred bloodline of the White Tigers other than this one which is already dead. It is simply impossible for it to appear again.” You XiaoMo could not help murmuring. It seemed that it was not unreasonable why later generations mostly mentioned the Qilin, FengHuang, Real Dragon and Black Tortoise when talking about the Four Divine Emperor Beasts.</p><br/><p>“The first and only White Tiger in the TongTian Continent has fallen to such a state.” Ling Xiao was also quite regretful.</p><br/><p>You XiaoMo roughly measured the White Tiger. The White Tiger’s body was about ten meters long and approximately three meters wide. Using the same method, his bed was also that big. He now finally believed that the White Tiger was a individual who totally enjoyed his comforts and was unwilling to treat himself shabbily even when he was dead.</p><br/><p>“Let’s quickly see if the Water Elemental Essence is here.” You XiaoMo suddenly remembered the purpose of their trip and immediately pulled Ling Xiao’s hand as he ran over. Since the White Tiger was already dead, then they could justly and openly take away the Water Elemental Essence.</p><br/><p>“There’s no hurry.” Ling Xiao pressed on his shoulder.</p><br/><p>“Why is there no hurry? The Black Spider may already have found the tunnel at the bottom of the valley.” You XiaoMo was very anxious. He was more worried that Ling Xiao would be unable to deal with the forces that barged in, so he was very willing to just take the treasure away and stealthily leave.</p><br/><p>Ling Xiao hooked him by the neck and dragged him forward, “They would have long discovered it if they wanted to find it. Those people are not fools. They could find it in less than fifteen minutes even if several of them had died. I reckon that they are outside the wards now and are thinking about how to break it.”</p><br/><p>You XiaoMo even more agitated upon hearing this and he jumped up and down.</p><br/><p>The corpse of the White Tiger was already rigid. He could not tell how long it had been dead, but it was composed of treasures from head to toe.</p><br/><p>Ling Xiao lifted him by his collar and brought him to one side, “Go to the side and play.”</p><br/><p>You XiaoMo felt wronged. Who was playing ah? He was obviously very active in searching for Water Elemental Essence. However, he still obediently went to one side and stayed there. He knew what Ling Xiao’s next big move was upon seeing his behavior.</p><br/><p>The White Tiger had coarse fur and thick muscles and was also an expert belonging to the same period as the Qilin progenitor. The indomitable strength of its physical body could not be denied even after it had died.</p><br/><p>Ling Xiao directly released purple and red flames before fusing the two together, this was another variation of the Godfire. The temperature suddenly rose by tens of thousands of degrees as the flame instantly engulfed the body of the White Tiger. The jade bed beneath the body actually stubbornly withstood the heat of the flames for an hour before melting.</p><br/><p>You XiaoMo immediately let out an expression of lament.</p><br/><p>This jade bed was definitely not an ordinary item for it to withstand the flames for so long. It was really such a pity for it to just be destroyed like this.</p><br/><p>You XiaoMo could not help a little idea from surfacing. Maybe the other places would also have a jade bed like this. If he and Ling Xiao could find a place to settle down in the future, they could build a jade bed that belonged only to them.</p><br/><p>You XiaoMo sneaked out of the side chamber while Ling Xiao was concentrating on refining the corpse.</p><br/><p>Relying on the map of the palace, You XiaoMo was just like a fish in water as he came and went freely around the palace. Unfortunately, as they had guessed before, other than the palace of the White Tiger being beautiful to look at, the rest of the area had nothing but bare walls. Fortunately, the White Tiger did not disappoint him as he found another jade bed of the same size in a different side chamber.</p><br/><p>You XiaoMo seemed to have been injected with chicken blood. He released the Metal Swallowing Beast and the two Golden Winged Insects and instructed, “Xiao Jin, try to see if you can take out half of this jade bed.”</p><br/><p>The Metal Swallowing Beast complied. He immediately jumped on the jade bed and opened his mouth to reveal two rows of glittering and shining teeth. Just as he bit down, there was a ‘ka-cha’ sound. A small piece had been bitten off from the edge of the jade bed…</p><br/><p>You XiaoMo wanted to tell to him to continue persisting.</p><br/><p>The Metal Swallowing Beast ran back with eyes brimming with tears and flashed his two rows of teeth to his Master.</p><br/><p>You XiaoMo failed to understand, so he thoughtlessly said, “What are you doing? You want to compare whose teeth is whiter…Uh…” He found the problem before he finished his sentence.</p><br/><p>A gap of about zero-point-two centimeters appeared in the middle of the two rows of neatly arranged teeth.</p><br/><p>“Ha ha!” You XiaoMo gave a hollow laugh and touched his little head in consolation, “It doesn’t matter, it doesn’t matter. It’s just a small gap, and it won’t affect your eating. At the most, there’ll be just a little air coming through.”</p><br/><p>The Metal Swallowing Beast, “…”</p><br/><p>You XiaoMo was afraid that he would really gnaw away both rows of teeth and dared not order him to do it again. Originally, he also wanted Ping Pong Qiu to bite it together too, but now he was worried that they would also gnaw their teeth away, “Go to the side and play, I’ll do it myself.”</p><br/><p>The three of them ran away extremely cohesively without the slightest hint of hesitation.</p><br/><p>You XiaoMo, “…”</p><br/><p>This bunch of heartless fellows, at least hesitate for a second!</p><br/><p>The jade bed was too hard to be cut into two parts. You XiaoMo thought he might as well start from the bottom because the jade bed was fixed to the ground.</p><br/><p>At the same time, Dou PengRen, Xia Yin and Moqi XiYuan had reached an agreement. The three would cooperate to break the barrier and the items inside would be divided equally among them. As for the situation where there were not enough items to be divided among three people, the three shared a mutual understanding and did not bring it up. This was because any discussion of such matters would be getting nowhere and was just a waste of time.</p><br/><p>The barriers were personally put up by the White Tiger. At that time the White Tiger’s cultivation was still in its peak form. So it was not easy for the three people to break the wards despite them having existed for a long time.</p><br/><p>Three mighty spiritual energies simultaneously bombarded the wards. When all was said and done, the three were Sacred Realm powerhouses and their full-powered attack was not to be trifled with. The palace swayed violently as if the foundations had been shaken.</p><br/><p>You XiaoMo, who was lying on the jade bed watching the situation, was frightened by the sudden shaking. His entire person fell from the jade bed and rolled out three to four meters like a snowball. Finally he landed on his back in front of the Metal Swallowing Beast who had been happily playing.</p><br/><p>“Ao wu?” The Metal Swallowing Beast blinked. Even if you wanted to express your apology, you don’t need to be so courteous ba?</p><br/><p>You XiaoMo turned over and jumped up before he ran out with a low curse.</p><br/><p>He did not believe that Ling Xiao would have caused such a stir just by refining a corpse. There was a ninety percent chance that it was the Black Spider and that holy maiden from the Guma Tribe. He did not guess that the ShuiXi Tribe would also be involved for a period of time.</p><br/><p>He ran to the side chamber and saw that Ling Xiao was still refining the corpse of the White Tiger. He had only refined half of the corpse. Based off this progress, perhaps Ling Xiao would not be done by the time that group of people had broken the wards. Furthermore, they had not yet found the Water Elemental Essence.</p><br/><p>You XiaoMo was so panicky he started running around in circles.</p><br/><p>“You dumbass, what are you panicking for?!” Ling Xiao’s calm voice suddenly sounded. It did not affect him in the slightest even if the palace was shaking violently.</p><br/><p>You XiaoMo hastily replied, “But they’re about to burst in.”</p><br/><p>Ling Xiao explained, “It’s not possible for them to immediately find this place even if they broke the wards. They can only wander aimlessly around the palace without a map. The palace of the White Tiger is a large-scale labyrinth and they won’t be able to find this place in a short while.”</p><br/><p>“What about the Water Elemental Essence?” You XiaoMo asked.</p><br/><p>Ling Xiao muttered to himself irresolutely for quite some while, “Take out the map and try to connect the three colored lines to see if you can find anything. The Water Elemental Essence is probably hidden inside there.”</p><br/><p>You XiaoMo immediately complied. Before he felt that it was strange that some of the colored lines on the map were broken off after it reached an area. It was just like hide-and-seek, but he did not care too much at that time.</p><br/><p>He took out his pen that he used to draw the map and sketched on top of the map. He managed to connect the lines after about fifteen minutes. If he hadn’t drawn the topographic map of the White Tiger, he probably would not have been so fast. This was because he found when the lines on the map were connected, it formed a white tiger. However, the difference was that the three lines eventually converged at the position of the heart of the white tiger and the map showed that the heart of the white tiger was in the center of the palace.</p><br/><p>You XiaoMo told Ling Xiao about his discovery.</p><br/><p>Ling Xiao instructed, “You leave now and bring the Water Elemental Essence here. But remember to act within your means. If you meet those people, I will permit you to abandon the task and run for your life first.”</p><br/><p>What do you mean ‘I will permit you to run for your life first’.</p><br/><p>You XiaoMo was too lazy to argue with him, “Then what about you? If those people find this place, wouldn’t you be a sitting duck without me by your side?”</p><br/><p>“You’re mistaken about two facts.”</p><br/><p>“What?”</p><br/><p>“First, I am not a sitting duck. Second, well, don’t place too much importance on yourself.”</p><br/><p>“…”</p><br/><p>You XiaoMo deeply felt that his heart was pierced by ten thousand arrows. His kind intentions were beaten until there was no blood left. The most miserable thing in the world was when you cared about the other party, yet they just treated you like grass. You XiaoMo decided to deliver an intact Water Elemental Essence right to Ling Xiao’s face and prove to Ling Xiao.</p><br/><p>He was actually very important!</p><br/>\n</div>"}