{"title": "Chapter 592 - An Independent Dimension", "id": 592, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-592-an-independent-dimension", "volume_title": "Volume 6", "body": "<h1>Chapter 592 - An Independent Dimension</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 592: An Independent Dimension</h3><h4>Translated by Crystal of Exiled Rebels Scanlations</h4><br/><p>Before You XiaoMo could say anymore, Ling Xiao broke off contact.</p><br/><p>He knew it was an emergency so he didn’t bother contacting Ling Xiao again. Putting the transmission stone away, he stared malevolently at the Water Elemental Essence floating in the air.</p><br/><p>The Water Elemental Essence shook a bit, as if it felt his gaze.</p><br/><p>A second later, it suddenly swayed and quickly rushed towards the tunnel guarded by the Metal Swallowing Beast. At first, the Metal Swallowing Beast was jumping around but once he saw the Water Elemental Essence, he immediately landed dead center in the tunnel. As if a goalkeeper, he stared intensely at the Water Elemental Essence, with his cheeks puffed up as if to say, ‘come get me’.</p><br/><p>If it wasn’t the right time, You XiaoMo would have laughed out loud. To not have it’s efforts go to waste, he hurried over as well.</p><br/><p>At the same time, the Water Elemental Essence was also gaining speed. It headed straight for the Metal Swallowing Beast as if shooting a goal.</p><br/><p>Even though the Metal Swallowing Beast was pretty small, it was pretty dependable when it counted. When the Water Elemental Essence was about two meters away, he took a deep breath, expanding his body and let out a strong gust of air.</p><br/><p>The Water Elemental Essence had planned on going closer and tricking him, however he didn’t expect the Metal Swallowing Beast to pull something like this. Unexpected, it was blown back, rolling straight into You XiaoMo’s embrace.</p><br/><p>You XiaoMo was almost blown away by the impact. It was a good thing that he reacted quickly and before the Water Elemental Essence could escape, he threw it into his dimension. Then, he quickly recalled the Metal Swallowing Beast and the Golden Winged Insects, sending them back to the dimension to guard the Water Elemental Essence.</p><br/><p>There was a spiritual water pond in his dimension, which was likely loved by the Water Elemental Essence. As it was an emergency, he had no choice but to send it in and have his beasts guard it. If there was a single drop missing from his pond, he was going to cut their meal budgets!</p><br/><p>Thus, a stupid owner could only be stupid and bully his demon beasts. Words said straight from the Metal Swallowing Beast and Ping Pong’s heart.</p><br/><p>Finished dealing with the Water Elemental Essence, You XiaoMo headed out of the palace and along the way, he took out the transmission stone, inquiring about Ling Xiao’s situation. But, it was never answered, and Ling Xiao hadn’t reply.</p><br/><p>Thinking that something happened, You XiaoMo changed course.</p><br/><p>The side palace hall, of which the White Tiger deceased, the crystal room wasn’t far from the main hall and he remembered Ling Xiao melting the jade bed. Although he wasn’t able to see the situation below, if it was directly above the maze, then he could use it to decrease the distance and watch from afar.</p><br/><p>You XiaoMo was on the right train of thought but…</p><br/><p>Sadly, in place of the jade bed was a huge boulder Ling Xiao had dug up somewhere else and Ling Xiao was nowhere to be found. However, there were a few unfamiliar faces, which he just had a historical meeting with.</p><br/><p>A strange shaped boulder appearing in the middle of a fancy side hall was no doubt weird, so the man-in-hood told his men to remove it.</p><br/><p>You XiaoMo was dumbfounded.</p><br/><p>Although the other’s face was covered, but from their frozen movements, he could tell that they were surprised too.</p><br/><p>A tenth of a second was how long it took for You XiaoMo to react and run.</p><br/><p>“Follow him!” Seeing the familiar face, the cloaked man ordered without thinking. If this person was here, then the other man must be close as well. If he could catch them, then his master would undoubtedly reward him.</p><br/><p>But, before the men in black could jump down, something strange happened.</p><br/><p>So as to not activate the only trap in the palace, Ling Xiao purposefully placed a rock there in place of the bed. He knew that the people who come would definitely try to remove it so he specifically told You XiaoMo to run after accomplishing his mission. He didn’t think You XiaoMo would come back.</p><br/><p>The palace rooms, hallways, and tunnels, all became part of a moving mechanism, or rather, it was as if the organs of an animal suddenly gained life after many years of silence.</p><br/><p>Everyone became alarmed and rushed to escape, without a care of the treasures inside. Their instincts told them that if they didn’t go now, they would never be able to.</p><br/><p>The palace started to push out the sea water and some rode that wave and were washed out. Once everyone was out, the palace became something cubical, like the modern day magic cube.</p><br/><p>If it wasn’t for MoQi XiYuan and the others breaking the barrier, the palace wouldn’t have drained the sea water and they wouldn’t have been washed out. The barrier was likely to keep them locked in the palace forever, and a mini one at that.</p><br/><p>“An independent dimension?” Seeing the palace shrink in front of their eyes, Xia Yin cried out involuntarily. Only an independent dimension could do something like this.</p><br/><p>No wonder the palace was floating in water and not actually built in the sea.</p><br/><p>An independent dimension was much better than a pocket dimension created by a powerhouse. First of all, an independent dimension could grow along with its owner. Second, it had a strong defense, and could conceal itself. Most importantly, it could automatically protect its owner in times of need, similar to You XiaoMo’s dimension.</p><br/><p>With the White Tiger’s strength, if they were trapped inside, there was no way that they would get out in this lifetime.</p><br/><p>An independent dimension was something you could find but never buy. Even in the TongTian Continent, one could count with one hand the amount of people who owned one.</p><br/><p>Even without Xia Yin saying it, both the cloaked man and MoQi XiYuan noticed it as well.</p><br/><p>It wasn’t long before they entered the palace when the trap had been activated, so even though someone came before them, getting this independent dimension was more than enough to make up for it.</p><br/><p>Suddenly the atmosphere became tense.</p><br/><p>No matter who it was, they were very interested in the independent dimension, however, there was only one…</p><br/><p>The independent dimension was floating around, but once it returned to its original form, it slowly sunk into the ocean, in to the abyss, about to disappear.</p><br/><p>The three moved simultaneously.</p><br/><p>But, there was someone even faster than them.</p><br/><p>A black shadow charged over and took the mini independent dimension. In a split second, he escaped to the opposite direction.</p><br/><p>The three were furious. Although they noticed someone else in the palace before them, they didn’t think they would dare try to pull something right under their noses. And all three of theirs at that.</p><br/><p>The three became three different colored rays of light and quickly flew over to chase the one who stole the independent dimension.</p><br/><p>The cloaked man already knew who he was so he chased without hesitation.</p><br/><p>Xia Yin simply thought that this person’s back looked familiar, but she had no time to ponder over it. The independent dimension was much more important than thinking about useless things.</p><br/><p>However, once they chased for a while, they realized that the distance wasn’t getting shorter, rather, it was increasing. Xia Yin finally realized why the back looked familiar.</p><br/><p>If they could stretch out the distance even after them chasing at full power, they had to be a Sacred Realm practitioner as well. It was highly likely to be the man Xia Yin saw in the small town.</p><br/><p>As she thought of this, Xia Yin suddenly slowed down.</p><br/><p>With her Grade Six Rainbow Level, it was possible for her stand at the top along with other practitioners, since there was only a few Grade Six Rainbow Level mages. However, this was only for the ability to make pills.</p><br/><p>If it was about fighting prowess, Xia Yin was worse than her actual level. At most, she was on par with a four star Sacred Realm practitioner.</p><br/><p>It was the main reason for her backing off when she discovered Ling Xiao’s true level. She also wanted the independent dimension, but she’d rather be the last one standing. Even though she had thought of this, others may not have realized it.</p><br/><p>MoQi XiYuan was the oldest and he was the one who wanted this the most. The ShuiXi Tribe being last of the three major tribes was largely due to his strength. If he could obtain the independent dimension, his power would go up by two levels.</p><br/><p>By then, he would have the capital to negotiate with the Guma Tribe and they would have to think twice about attacking them.</p><br/><p>However, just because he wanted power, didn’t mean he was going to get carried away. He was immediately aware of Xia Yin’s actions and too bad, he also didn’t want to be the one who stood out.</p><br/><p>Realizing the two’s thought process, the cloaked man’s expression darkened drastically.</p><br/><p>He was under a lot of responsibility and couldn’t watch from the sidelines like the other two. If Ling Xiao disappeared with the independent dimension, he was the one who was going to have to face the wrath of his master.</p><br/><p>“The two bastards!” The cloaked man cursed under his breath.</p><br/><p>On the other hand, Ling Xiao hurried out towards the exit, but the three were clearly aware of his intentions and split into three, surrounding him. The direction of the exit was blocked by the cloaked man.</p><br/><p>Ling Xiao couldn’t help but change directions.</p><br/><p>It was the bottom of the ocean, there couldn’t be just one exit.</p><br/><p>Who knew how long the ocean stretched for, in the blink of an eye, they were very, very, far away from their original location. The cloaked man, who was expecting Ling Xiao to slow down due to his wounds, was becoming more impatient.</p><br/><p>“You two, if you don’t go all out now, once he leaves this place and enters the ocean, it’s going to be near impossible finding him again. Think about it.”</p><br/>\n</div>"}