{"title": "Chapter 591 - Broken Barrier", "id": 591, "volume": 6, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-591-broken-barrier", "volume_title": "Volume 6", "body": "<h1>Chapter 591 - Broken Barrier</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 591: Broken Barrier</h3><h4>Translated by Jouissance of Exiled Rebels Scanlations</h4><br/><p>The barrier shook, being blasted again and again. The tremors wracking the palace increased in frequency. After all, it wasn’t connected to the earth. Since the palace was held, floating in the water, by the barrier, when the barrier shook, so did the entire palace with it.</p><br/><p>Once the barrier was broken, the palace of the White Tiger would descend into the bottom of the ocean. No one would be able to predict what ruin that would bring it.</p><br/><p>Considering this, You XiaoMo immediately ran over to the center of the array.</p><br/><p>White Tiger was lazy, so the palace, apart from being beautiful labyrinth filled with lavish comfort, there weren’t any traps and the likes, though there were quite a few seals and barriers.</p><br/><p>This might be a problem for others, but You XiaoMo had seal-devouring golden winged insects. His journey over was smooth and swift. Not long after, he arrived at the center of the palace.</p><br/><p>There was a massive hall in the center of the palace, the ceiling was made of crystal and shone with a bright luster.</p><br/><p>On the two sides of the hall were two rows of pillars of immense size, leading from the main doors all the way to the throne. Different colored gems shining with glimmering light surrounded the throne. Thick furs lined the throne – it looked comfortable, truly like the throne of an emperor.</p><br/><p>You XiaoMo couldn’t help but run over.</p><br/><p>The Metal Swallowing Beast also rushed over, lunging onto the throne and trying to get there first with the Golden Winged Insects. The three were just a tad faster than You XiaoMo.</p><br/><p>That’s why it was said that contracted demon beasts took after their master. They were all the same.</p><br/><p>You XiaoMo shoved the Metal Swallowing Beast and Ping Pang to one side of the throne and down on it himself. He didn’t know what demon beast’s fur this was but it really was soft, and even had a somewhat cool feeling.</p><br/><p>“Aaaoooo~” The Metal Swallowing Beast jumped onto the hand that rested on the throne, objecting to You XiaoMo’s actions.</p><br/><p>You XiaoMo whacked him. “Though we have no idea what sort of beast you are, but you definitely aren’t a wolf. What are you howling for? No one’s going to give you a prize for it.”</p><br/><p>The Metal Swallowing Beast bared its teeth, “Gua gua gua~”</p><br/><p>“Fine, fine!” You XiaoMo jumped off the throne, starting the search for the Water elemental essence.</p><br/><p>The map had the water elemental essence marked in this hall, but the specific location wasn’t detailed so he had to find that tiny thing in this massive hall.</p><br/><p>You XiaoMo kicked the crystal like floor beneath him with all his strength. As expected, only a small dent about the size of his thumb appeared on the smooth surface of the crystal floor. With this speed, it’d probably take him a year to get a four to five meter deep hole.</p><br/><p>As he was thinking of a plan, the palace began to shake less and less frequently, but each tremor was like the coming of the apocalypse. He’d run out of time if he didn’t manage this soon.</p><br/><p>After who knows how long, a sharp noise suddenly screeched through the air. There was a pause before there was a loud pop, like a bubble being burst. Then, the ground quaked and the sea flooded in from all directions.</p><br/><p>One hall was filled with water before the water attacked another area. The ocean water was rapidly filling up the White Tiger’s palace from all directions.</p><br/><p>When the palace descended to the bottom of the ocean, the areas of the palace unprotected by barriers were completely filled with water, the turbid seawater flooding across the palace.</p><br/><p>“What a shame.” Xia Yin gazed at the ruined palace; this was truly unfortunate.</p><br/><p>“If the holy maiden, you, like this palace, then you could try and save it after becoming a grade seven rainbow mage.” The cloaked person laughed mockingly. A normal sacred realm elite wouldn’t even be able to support this palace with a barrier.</p><br/><p>If it wasn’t for the fact that they had to break the barrier to get inside, they honestly wouldn’t want to do this. The water might not be good for the treasures inside and trying to find anything would become extremely troublesome.</p><br/><p>Xia Yin smiled, not replying. Grade seven rainbow mages were extremely rare even in ancient times, never mind nowadays. Reaching the requirements for advancing was like trying to ascend to the heavens. In her soul’s current state, she didn’t even know if she had hope of reaching grade seven either.</p><br/><p>Plus, while the White Tiger’s palace was beautiful, there wasn’t any practical use for it. If she really did manage to advance to grade seven, then she didn’t need this palace. There would be people to build a better one for her.</p><br/><p>“You two keep chatting, I’m heading off first.” WanQi XiYuan’s voice rose and when they looked over, he was already leading the ShuiXi Tribe down towards the palace.</p><br/><p>The two didn’t dare waste any more time, immediately rushing down with their own subordinates. If WanQi XiYuan found the treasure, then he would be the one to get it. They hadn’t discussed how to split the spoils, so it was finders keepers.</p><br/><p>This was a primitive instinct of the strong. If they hid something, they couldn’t go and search the other’s body even if they suspected something.</p><br/><p>When the three groups all thought the entire palace was flooded, a few places didn’t have a drop of water inside, all the seawater kept out.</p><br/><p>Among these places was the room You XiaoMo was in. The floor, made of a milky white crystal, actually hid a massive maze under it.</p><br/><p>But, in reality, the entire palace’s floors were made of the same milky white crystal as the jade bed. It was just that in other places, the White Tiger and cleverly covered it up, so others would think that only the main hall had floors made of that material.</p><br/><p>As for the strange lines on the map, they actually led to the three openings to the maze.</p><br/><p>Though there were three entrances, people who weren’t familiar with the maze would get hopelessly lost inside and they might even startle the water elemental essence. If it fled into the sea, then they could give up on ever finding it again.</p><br/><p>You XiaoMo finally found his target using the map and, as expected, the water element around him grew denser.</p><br/><p>You XiaoMo solemnly spoke to his contracted demon beasts, “Xiao Jin, Xiao Ping, Xiao Pong, guard the exit carefully. If the water elemental essence wants to run, you have to stop it. If it manages to flee, I’ll deduct your food.”</p><br/><p>Metal Swallowing Beast and Ping Pang: “…” At the same time, Ling Xiao wasn’t having very good luck.</p><br/><p>Just as he was about to finish with the White Tiger’s body, someone entered his sensory range.</p><br/><p>Originally, he could throw the White Tiger’s body into his pocket dimension and refine it later, but then he realized that he couldn’t move it. Though the entire palace seemed to lack traps. There was actually a massive – the only – trap.</p><br/><p>Many people, after seeing the corpse of the White Tiger, would immediately try to take it for themselves, not knowing that this was exactly what was required to activate the trap. This was something he had found out after he had turned the jade bed into a pool of liquid, otherwise he wouldn’t have had You XiaoMo go and find the water elemental essence alone.</p><br/><p>Ling Xiao had no choice but to spare a part of his attention on contacting You XiaoMo and quickly asked, “Idiot, have you found the water elemental essence?”</p><br/><p>The idiot: “…”</p><br/><p>You XiaoMo noticed the hint of anxiety in Ling Xiao’s voice and didn’t bother retorting. He immediately reported his current situation. He had found the water elemental essence, but this elemental essence’s spiritual awareness exceeded any other he had seen before, and it was as slippery as an eel.</p><br/><p>If it wasn’t for the fact that he had the foresight to get the Metal Swallowing Beast and others to each guard one of the three exits, it’d have probably escaped by now. In order to not have their food deducted, they had given it their all.</p><br/><p>“Deal with it quickly. I think my position is soon to be found. After obtaining the water elemental essence, leave the palace at once. I’ll come and find you after,” Ling Xiao quickly informed the other of his plans.</p><br/>\n</div>"}