{"title": "Chapter 607 - Wish Fulfilled", "id": 607, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-607-wish-fulfilled", "volume_title": "Volume 7", "body": "<h1>Chapter 607 - Wish Fulfilled</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 607: Wish Fulfilled</h3><h4>Translated by Jouissance of Exiled Rebels Scanlations</h4><br/><p>“It’s you!?”</p><br/><p>A shocked cry broke through the heavy atmosphere and snapped everyone out of their stupor. Seeing the terrifying Water Demons, they felt cold sweat forming on their skin. Getting distracted at a crucial moment could be fatal.</p><br/><p>The crowd ignored this and focused on dealing with the Water Demons.</p><br/><p>The ones who had suddenly appeared and saved the True Dragon Clan disciple was none other than You XiaoMo and Ling Xiao. They had just been transported inside. Being transported directly to the Eight Mansions of the Spirit Mountains was a testament to their luck. They were probably the ‘luckiest’ of anyone here.</p><br/><p>You XiaoMo left his back to Ling Xiao, squatting down in front of the True Dragon Clan disciple and asking with a grin, “Do you recognize me? I traded a few Life Crystals with you at ZhongTian’s Zhong Ting Trade Fair. One of them was a level eleven one, do you remember?”</p><br/><p>The young man’s mouth twitched. How could be forget?</p><br/><p>Originally, You XiaoMo had told him to find the other at Xiao Yao Institution if he had any more Life Crystals to trade. After that, he had gone to look for You XiaoMo once, but the other wasn’t even there.</p><br/><p>It was only after asking around that he found out that You XiaoMo usually wasn’t at the Xiao Yao Institution. And yet the other had told him to find him there. What the hell?</p><br/><p>He wasn’t really holding a grudge, though. After all, he had come at the wrong time. Plus, after knowing of their identity, he understood their reasons.</p><br/><p>The young man nodded, “Of course I remember?”</p><br/><p>You XiaoMo smiled. “Then do you have anymore Life Crystals on you? Level eleven is preferred, but I’ll accept level tens.”</p><br/><p>Last time, he had bought a few Life Crystals from this young man, but he didn’t buy enough. His Qiu team had over ten demon beasts, so there weren’t enough to go around.</p><br/><p>He wasn’t someone who played favorites, and Life Crystals worked better for Demon Beasts than for humans, so he wanted to buy some more for his Qiu team, even the Weasel Beast who he had only just formed a contract with. Increasing the other’s combative power was a priority.</p><br/><p>“Are you sure you want to talk about this now?” The corner of the young man’s mouth twitched. Their current opponents were Water Demons, and level eleven and twelve ones, too. Talking business at a time like this, was he brave or just oblivious?</p><br/><p>You XiaoMo realized what he was trying to express and scratched his head, saying in embarrassment, “Let’s talk about this after we deal with the current situation.”</p><br/><p>As he said this, he got up and offered a hand.</p><br/><p>The young man didn’t bother putting on any fronts, grabbing his hand and pulling himself up, not forgetting to thank You XiaoMo. “Thank you for saving my life just now. If it weren’t for your sudden appearance, those Water Demons would’ve probably already killed me.”</p><br/><p>“It was nothing, don’t sweat over it,” You XiaoMo replied. He quite liked the people of the True Dragon Clan, and this was a familiar face, too. He was rather happy about it. “Plus, we only just got transported in and saved you. I suppose that’s fate.”</p><br/><p>The young man nodded, smiling. The other had saved his life and didn’t ask for anything, but he was determined to find a way to repay this.</p><br/><p>After Ling Xiao and burned one of the Water Demons to death, the level twelve Water Demon that was fighting the Mage Association suddenly screamed, as if it had seen something terrifying, before disengaging from the Mage Association’s elites and fleeing towards the cold lake.</p><br/><p>However, the elites of the Mage Association counterattacked and refuse to let it flee.</p><br/><p>They recognized Ling Xiao. Though the Mage Association didn’t really have any sort of relationship with him, they knew that Jiu Ye and You XiaoMo were friends, so Ling Xiao would probably lend them a hand.</p><br/><p>Plus, the level twelve Water Demon seemed terrified of Ling Xiao. He couldn’t let it go like that.</p><br/><p>It only took a glance for Ling Xiao to figure out what had happened here. Though he didn’t like the Qilin Clan, but this didn’t go against his goal of the magic herbs next to the cold lake. His wife would definitely love them.</p><br/><p>Purposefully ignoring the people of the Qilin clan, Ling Xiao joined the fray.</p><br/><p>His flames had the power of devouring, which was the weakness of Water Demons. This was why the level twelve Water Demon was so afraid. No matter how arrogant something was, they could only run when it came to their weakness.</p><br/><p>Not long later, the fourteen level eleven Water Demons had mostly been decimated. Only the level twelve Water Demon was still being stalled by the Mage Association and True Dragon Clan. Even if they couldn’t kill it for now, they could still stall its movements.</p><br/><p>You XiaoMo, seeing the fields of magic herbs next to the lake, was very interested in the patches of transcendent level herbs, wanting to go and take a look. However, he was stopped by the young man next to him.</p><br/><p>“Where are you going?” The young man asked.</p><br/><p>You XiaoMo pointed at the magic herbs. “I want to go and take a look.”</p><br/><p>The young man hesitated for a moment. “I’ll go with.”</p><br/><p>You XiaoMo didn’t refuse him.</p><br/><p>Circling around the one-sided, soon-to-be over battle, the two soon found themselves next to the lake. There wasn’t a large variation of magic herbs, probably because ones like these had very specific conditions in which they grew.</p><br/><p>You XiaoMo made a rough estimate. There were over ten different kinds and each kind had around ten to twelve stalks, not much, but these magic herbs were all used in rather obscure recipes.</p><br/><p>You XiaoMo had researched the recipes in his ancestor’s jade drive. Some transcendent level pills had rather strange effects. Though they gave the user powerful bonuses, they also had huge risks.</p><br/><p>。</p><br/><p>For example, the Fire Baptism Pill that used these herbs as ingredients. Humans and phoenixes were different; they couldn’t necessarily be reborn through fire; it was usually more risky than not.</p><br/><p>You XiaoMo hesitated for a moment but decided against digging up the stalks, instead picking up seeds from the field.</p><br/><p>The owner of this cave dwelling clearly hadn’t tended to these magic herbs in a while. The seeds were scattered on the ground. Though these seeds had very specific growth conditions, he wanted to try and cultivate a few in his dimension.</p><br/><p>The young man had thought he wanted to dig up magic herbs, not expecting that he would come to just pick up these mostly useless seeds. Though he was curious, he didn’t say anything, but instead walking to another field to help him pick up more seeds.</p><br/><p>The two didn’t notice the danger approaching from the seemingly peaceful lake.</p><br/><p>You XiaoMo was focused on picking up seeds, and as he gathered them, he arrived at the edge of the lake and saw a few seeds next to a magic herb. He bent down to gather them.</p><br/><p>Just in these two seconds, a splash came from nearby and a rather small and thin Water Demon suddenly jumped out of the lake. It’s body was translucent, but it was wearing clothes, clearly some misfortunate person who had been infected.</p><br/><p>The Water Demon lunged at him without hesitation, its face twisted into a intimidating look and hatred flashing in its eyes.</p><br/><p>You XiaoMo didn’t have the time to wonder why it hated him. The Water Demon had sneaked up on him and attacked him, and it was only two meters away, but he realized that this Water Demon wasn’t very strong at all. He didn’t even need to dodge.</p><br/><p>A powerful aura erupted from his body.</p><br/><p>The Water Demon didn’t cower from this threatening display, continuing its lunge.</p><br/><p>You XiaoMo flicked a Resonance Bullet at it. With the increase in his cultivation base,</p><br/><p>The Water Demon was struck in the shoulder. It had almost reached You XiaoMo, but it was sent flying by the attack, landing on another field of magic herbs and crushing a few under its body. It didn’t seem to notice the injury on his shoulder, dragging itself over the ground with its four limbs and glaring at You XiaoMo in hatred.</p><br/><p>“I can’t believe he turned into a Water Demon.” The young man ran over hurriedly and frowned when he saw the clothing on the Water Demon.</p><br/><p>You XiaoMo hadn’t expected that he would know this Water Demon. The Water Demon’s face had become unrecognizable, so he didn’t recognize it. The weirdest thing was that this Water Demon had no eyes. Hearing the other’s words, he asked, “You know him?”</p><br/><p>The young man replied, “He’s someone from the Vermillion Blood Clan. Not long ago, he was thrown into the lake by the level twelve Water Demon. He probably got infected by the Water Demon poison. If I recall correctly, his name was Jiang… Er, Jiang Liu I think.”</p><br/><p>“What?” You XiaoMo’s voice rose in pitch with surprise. He thought he had misheard at first.</p><br/><p>The young man didn’t understand his reaction and replied, “I said his name was Jiang Liu. You know him?”</p><br/><p>“Well, he were once disciples under the same master. Then he betrayed the sect and joined the Vermillion Blood Clan.” You XiaoMo looked at the glaring Water Demon with a conflicted gaze. This could probably be called karma. After his eyes had been gouged out by Ling Xiao, he knew that Jiang Liu wouldn’t be able to have a good life, but he didn’t think that this would be his eventual fate.</p><br/><p>“There’s no need to feel sad over this sort of person,” the young man said with a half smile. He hated traitors the most.</p><br/><p>“I’m not feeling sad over him. I just think its a bit of a shame,” You XiaoMo sighed. He wasn’t that sad, after all, the person Jiang Liu had really betrayed was him.</p><br/><p>The young man suddenly smiled, saying, “Now that he’s become a Water Demon, you might as well personally end his misery. I think he might be thankful that you did.”</p><br/><p>Perhaps it was because it had understood what the other meant, but the Water Demon suddenly seemed enraged, roaring and lunging at them again, like it wanted to tear them to shreds.</p><br/><p>You XiaoMo couldn’t read minds, and he hadn’t really interacted much with Jiang liu, so he didn’t know that Jiang Liu hated him to the point of wanting him dead.</p><br/><p>Hearing the young man’s words now, You XiaoMo thought it very reasonable. He didn’t know Jiang Liu would be willing to live like this, so he decided to fulfill this wish.</p><br/>\n</div>"}