{"title": "Chapter 618 - Captured", "id": 618, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-618-captured", "volume_title": "Volume 7", "body": "<h1>Chapter 618 - Captured</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 618: Captured</h3><h4>Translated by Kollumceti of Exiled Rebels Scanlations</h4><br/><p>You XiaoMo was now a Grade Four Rainbow Level mage. Although he had just advanced less than three months ago, his cultivation base was extremely stable after using this period to consolidate his level. Even though You QiBei was the leader of Four Battle Gods, he was completely no match for You XiaoMo as long as he had not advanced to the Sacred Realm.</p><br/><p>Regardless of whether You QiBei was naturally born with the physique of a Crow, he had still been injured.</p><br/><p>Underneath, Fu ZiLin stared at the scene. He had suffered several consecutive blows in the course of this day and was already somewhat overwhelmed.</p><br/><p>His little-shidi was fighting with a seven star Divine Realm expert, and it was obvious that he had the upper hand. The man called Crow was already injured when they first met and finally had no choice but to retreat from the battle ring.</p><br/><p>The Metal Swallowing Beast and Xiao Ping saw this scene. The eyes of the two beasts met without anyone noticing. Then, they suddenly rushed out of Fu ZiLin’s arms.</p><br/><p>Fu ZiLin thought they were going to enter the battle ring and assumed that they would only cause trouble to his little-shidi if they went over. He was about to call them back when he saw them stealthily running towards that man called Crow.</p><br/><p>Crow did not look heavily injured, but his internal injuries were quite serious.</p><br/><p>You XiaoMo’s style what quite different from Ling Xiao’s. He was not used to witnessing excessively bloody events, so he chose to directly disrupt the other party’s meridians. When the meridians were injured, that party’s combat effectiveness would drop dramatically.</p><br/><p>At present, the strength of Crow was only one tenth of that in his heyday and he was totally no match for the Metal Swallowing Beast and Xiao Ping.</p><br/><p>The Metal Swallowing Beast and Xiao Ping had this exact idea. He had chased them to the ends of the earth by all means in the past. Now, how could they let go of such a good opportunity to retaliate?</p><br/><p>Crow did not discover the approach of the Metal Swallowing Beast and Xiao Ping at all. All his attention was on You XiaoMo and You QiBei who were fighting in the sky. He was looking very anxious, because he could also see that You QiBei was not You XiaoMo’s opponent. If they let it go on like this, they would probably lose.</p><br/><p>Crow hesitated. He wanted to go look for reinforcements as only the Family Head could deal with You XiaoMo. But leaving Leader here alone would worsen Leader’s situation. People were selfish and he was the same too. However, You QiBei’s status was different.</p><br/><p>Ever since You AnTai’s death, Leader had become a major pillar of the Vermillion Blood Clan. The loss to the Vermillion Blood Clan would be great should he die. In the event that it was known that he left Leader here alone, his name would be blackened even if it was for the sake of getting reinforcements.</p><br/><p>Nevertheless, they would not be able to survive if they did not find any reinforcements.</p><br/><p>Crow was in an unsettled state of mind, and had not been able to make up his mind. In actual fact, he hoped that Leader would give him the order to go get reinforcements.</p><br/><p>But before he could come up with a conclusion, someone had already helped him make a decision.</p><br/><p>Crow, whose strength had greatly declined, naturally did not overlook You XiaoMo’s two contracted demon beast and Fu ZiLin, but the concealment technique of the Metal Swallowing Beast and Xiao Ping was too superior. He had only directed some degree of attention to Fu ZiLin, so he did not notice the Metal Swallowing Beast and Xiao Ping that had sneaked behind him.</p><br/><p>After a while, Crow’s body suddenly froze.</p><br/><p>Then, he looked down at his chest. Like a heavenly maiden scattering flowers, a spurt of blood gushed out from the position where his heart was. Then a golden shadow drilled out from the wound – this was the Golden Winged Insect he had hunted down before.</p><br/><p>Though had clearly sensed their approaching aura, Crow had no idea where the other party had emerged from. Eventually, he fell to the ground and died with a remaining grievance. As an ambitious man, he was full of reluctance to be cut off in his prime, because he had been expecting to take over the position of the Leader one day.</p><br/><p>Crow’s death did not escape the eyes of You QiBei. His whole face suddenly turned black.</p><br/><p>Crow was ambitious, but he was also his trusted subordinate. Otherwise, You QiBei would not bring him along intentionally. One must know that not everyone could enter the Peach Blossom Ruins. Even for the Vermillion Blood Clan, the quota allocated to them was quite small. With Crow dead, he lost a powerful subordinate.</p><br/><p>You XiaoMo saw that You QiBei wanted to rush over and was one step ahead as he blocked You QiBei’s way, “You might as well worry about yourself first if you have time to worry about others.”</p><br/><p>You QiBei quickly drew away from him. With chillingly cold eyes, he rebutted, “Don’t speak too early. Do you think you can leave the Spirit Mountain safely even if you are stronger than me? Let me tell you, this is impossible.”</p><br/><p>You XiaoMo frowned. He did not believe that You QiBei was putting up a last-ditch struggle as he appeared quite confident based off the look in his eyes. Don’t tell him that You QiBei really had a hidden move?</p><br/><p>It was not long before he knew why You QiBei was not worried about his safety. This was because You ZhenTian had arrived.</p><br/><p>You Qibei had a high status in the Vermillion Blood Clan. Although he was ordered to beat his eldest son by the Family Head, the truth was that he obeyed only the orders of the Family Head with regards to many things. It was impossible for such a person like him not to have a method to contact You ZhenTian.</p><br/><p>When he first found that his level was quite far off from You XiaoMo, You QiBei developed countermeasures and secretly notified the Family Head ahead of time in a special way. It was just that he did not expect Crow to die.</p><br/><p>Even though the loss to his battle squadron was not big enough to affect the overall strength of the team, the impact was also not small as it was difficult to nurture Divine Realm experts after all. Moreover, Crow was a four star expert, and with a little more nurturing, it would not be long before there would be another seven star expert.</p><br/><p>An all-powerful pressure spread rapidly through the air just like the last time You ZhenTian was hunting them down. The aura of a Sacred Realm expert was extremely terrifying and came with the sudden suppression of one’s strength. The fighting power of a person facing this would be reduced once they lost their confidence.</p><br/><p>You XiaoMo could feel some blockages of the soul power in his body before You ZhenTian had even neared. One could see how terrifying You ZhenTian was for him to be affected to this sort of extent. He had witnessed this the last time too.</p><br/><p>Ling Xiao’s most powerful attack only hurt him a little. Although his current strength was also not on par with his strength at that time, it was still like a small sorcerer in the presence of a great one for him to fight You ZhenTian.</p><br/><p>You XiaoMo did not dare to remain here any longer.</p><br/><p>To his surprise, You QiBei did not stop him, but looked on unfeelingly as he left. Maybe it was because he was convinced that You XiaoMo could not escape the pursuit of You ZhenTian.</p><br/><p>You ZhenTian had not changed his obsession of wanting to catch You XiaoMo and drag him back. They had escaped the last time, and he could not find a single trace of them no matter how he looked afterwards. This time, he would absolutely not let this opportunity slip by, otherwise, it would be difficult for him to find them again if they went into hiding.</p><br/><p>You XiaoMo speedily picked up the Metal Swallowing Beast and Xiao Ping and threw them into his dimension without saying a word. As for Fu ZiLin, he also did not hesitate to put him into his dimension.</p><br/><p>He believed that his second-shixiong would not spill the beans even if he knew his secret. If Fu ZiLin had some ideas which he should not have, their camaraderie between fellow disciples would have to come to an end. However, he still believed in the character of his second-shixiong.</p><br/><p>After doing all this, You XiaoMo immediately flew in the direction of where Ling Xiao was in secluded cultivation .</p><br/><p>Today was the last day and Ling Xiao should have already come out of seclusion, otherwise it would be very dangerous to be transported away when he was still in the midst of cultivation. You XiaoMo believed that Ling Xiao had a sense of propriety.</p><br/><p>“You can’t escape. If you allow yourself to be seized without putting up a fight, I can give you preferential treatment.”</p><br/><p>Just before he had escaped two kilometers away, You ZhenTian’s voice which seemed to have been magnified several hundred times suddenly came from behind him. His oppressive voice seemed to contain a hint of a sound-wave attack capable of penetrating through metal. This shocked You XiaoMo into a trance and he almost fell out of the air.</p><br/><p>The delay was enough for You ZhenTian to catch up.</p><br/><p>You ZhenTian’s familiar figure was approaching nearer and nearer, and he was accompanied by a huge fist which had taken a physical form. The fist rapidly shot over from behind You ZhenTian, and even the very space was pressured until it deformed. That feeling of being locked in made You XiaoMo’s blood freeze.</p><br/><p>You XiaoMo did not hesitate to form the Xu Seal, which was the second most powerful secret technique within the Sumeru Seal. It was not difficult for him to form the Xu Seal with his current cultivation, and the power had also risen with the increase in his cultivation. It was just the the soul power requirements for the Xu Seal were very high and it took away seventy percent of his soul power all at once.</p><br/><p>You XiaoMo did not remain to see the result after sending out the Xu Seal, instead he continued to flee for his life.</p><br/><p>The rumbling sound was loud enough to shake heaven and earth. The power of Xu Seal was definitely great, but it was only enough to block a causal blow from You ZhenTian. From this, one could see how huge the gap between their strength was.</p><br/><p>You XiaoMo was almost thrown out of the sky by the huge blast of air behind him. It was fortunate that he had immediately reacted and even borrowed the force of the blast to speed up and fly several thousand meters in an instant. Even he could not help giving himself an exclamation of admiration for his actions.</p><br/><p>“You can’t escape. Obediently be taken prisoner.”</p><br/><p>You ZhenTian’s voice suddenly sounded from beside his ear.</p><br/><p>You XiaoMo jumped in fright. He had clearly pulled away from You ZhenTian, yet when he looked back, You ZhenTian was less than five hundred meters away from him. His imposing face and black eyes stared fixedly at You XiaoMo as if he was already the same as an object in his pocket.</p><br/><p>You XiaoMo gaped, but the other party’s second move had already arrived.</p><br/><p>This time, the distance between them was too close. You XiaoMo was unable to dodge and could only defend. As a result, his qi and blood surged and he could not refrain from vomiting a mouthful of blood. Seeing that the distance between You ZhenTian and him was only a hundred meters, he could not endure it any longer and directly entered his dimension. As he had already disappeared, You XiaoMo did not see You ZhenTian’s expression of delight instead of the anger that should have crossed his face.</p><br/>\n</div>"}