{"title": "Chapter 621 - Finish", "id": 621, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-621-finish", "volume_title": "Volume 7", "body": "<h1>Chapter 621 - Finish</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 621:</h3><h3>Finish</h3><h4>Translated by Yan of Exiled Rebels Scanlations</h4><br/><p>After You XiaoMo was sent by Ling Xiao into the dimension, he didn’t complain. He was still at least a little self-aware that staying there would only hinder Ling Xiao, but when he thought of You ZhenTian’s strength, he couldn’t help but worry.</p><br/><p>He paced around the dimension. He could only hope that Ling Xiao could hang on until the transportation array activated. However, when You XiaoMo remembered that he would be of no use to anyone worrying here anyway, he entered his own dimension instead.</p><br/><p>When Fu ZiLin saw him appear, he thought he was seeing things at first. “Little-shidi, are you okay?” He was just stewing over how to explain things to ChenLe when You XiaoMo suddenly reappeared.</p><br/><p>You XiaoMo scratched his head awkwardly. “Um, he showed up…”</p><br/><p>Fu ZiLin instantly knew who ‘he’ was. Besides Ling Xiao, it could be nobody else, or else he most likely wouldn’t have appeared safe and sound in the dimension. The only thing was, it seemed like Ling Xiao’s strength couldn’t compare with You ZhenTian’s…</p><br/><p>Of course You XiaoMo knew that, but Ling Xiao was so smart, so he shouldn’t be in any danger.</p><br/><p>What he didn’t know was that, although Ling Xiao indeed wouldn’t let himself be in any danger, he was also someone who would seek revenge just for an angry look. Since he got hurt last time, he would demand repayment and interest back for it from You ZhenTian’s body this time.</p><br/><p>From You ZhenTian’s perspective, the place where Ling Xiao was standing was already swallowed up by the black snake.</p><br/><p>But inside, where he couldn’t see, a wall made up of several hundred transparent glass crystals surrounded Ling Xiao. Each glass crystal was in a hexagonal shape, and it looked very much like the shell of the Black Tortoise.</p><br/><p>This was the Psychic Black Turtle’s absolute defense.</p><br/><p>The Psychic Black Turtle’s defense was number one on TongTian Continent. As one’s cultivation base increased, their ability to defend would naturally grow stronger and stronger as well. With Ling Xiao’s current cultivation base, even though he couldn’t maintain it for very long, it was enough for him to steal a bit of time.</p><br/><p>You ZhenTian couldn’t see any of this, or else he would definitely be very surprised that Ling Xiao could use the Psychic Black Turtle’s absolute defense. If that came to be, the truth about the four bloodlines in Ling Xiao’s body would very likely be exposed, which wouldn’t be good for him at all, since there was an ancient legend concerning the Four Ancient Beast Clans’ bloodline.</p><br/><p>Tens upon thousands of illusory black snakes attacked the absolute defense madly, as if they didn’t care about living anymore. Each one seemed like it had gone insane.</p><br/><p>Ling Xiao sucked in a deep breath. During the past few months he was secluded, he wasn’t just nursing his wounds; if he had just been nursing his wounds, he wouldn’t have been shut away for two to three months. He could’ve recovered within five to six days. The only reason it took so long was because testing the strength of combining all four bloodlines.</p><br/><p>Last time, he had only managed to hurt You ZhenTian because he forcefully combined them all. However, because of that, he had received an internal injury himself. This time, he didn’t plan on making the same mistake.</p><br/><p>So while he was secluded, he had tested endlessly how to balance the four different bloodlines. Afterwards, his experiments succeeded, but he could only maintain it for a very short amount of time. The reason it had succeeded last time was most likely because of luck.</p><br/><p>There was no way four different forces that repelled each other could be balanced forever, unless a special trick was used. But sooner or later, there would be a day that kind of trick would collapse, so after that, he started to test how to extend the duration that the four different bloodlines balanced. He experimented for another month on this, and if You XiaoMo had gone back, he would’ve seen that the Immortal’s Cave was already destroyed by Ling Xiao.</p><br/><p>Four different colors, representing the four different forces, swirled in Ling Xiao’s hand. They didn’t disturb each other, and they were slowly condensed between his palms until it shrank into the size of a fist, as if there was a force sucking them in. They didn’t scatter like before anymore.</p><br/><p>At the same time, under the black snakes’ attack, a crack finally appeared in the transparent wall. The cracks spread swiftly, and when it couldn’t endure it any longer, the wall immediately split apart as the transparent glass crystals fell like snowflakes.</p><br/><p>Without a barrier in their way, the black snakes instantly hissed and threw themselves at Ling Xiao. In a moment of life or death, blazing flames erupted with a bang under Ling Xiao’s feet, and the purple flames rushed towards the black snakes that were roiling in the thick fog.</p><br/><p>Sunfire had always been the nemesis of evil spirits. Even though You ZhenTian was the Vermillion Blood Clan’s head and seemed to be honorable and righteous on the surface, some of the techniques that he cultivated were fairly similar to what the Eagle Guild had done back then. He had to draw support from some evil spirits in order to complete it, so in the end, he had still touched some evil energy.</p><br/><p>When two types of Godfire combined together, their power increased tenfold. After that thick fog had persisted for half an hour, it started to slowly retreat, and the thousands of black snakes screeched shrilly. They were so burnt by the fire that they couldn’t even maintain their shape anymore, and in the end, they transformed into black smoke and disappeared without a trace.</p><br/><p>When You ZhenTian saw this scene, his eyes grew cold. He had long since heard that Ling Xiao had two types of Godfire. Godfire clearly repelled each other, but Ling Xiao could somehow combine them together; this was something unheard of. At first, he didn’t believe it, but now he had no choice but to believe it.</p><br/><p>“There are indeed two types, but if you think you can just depend on these two kinds of Godfire to…” You ZhenTian’s gaze was contemptuous, but he suddenly halted halfway through his sentence, as if he had been forcibly choked by something. He stared rigidly at the ball of light in Ling Xiao’s hand, his expression extremely dark.</p><br/><p>He hadn’t forgotten that it was this trick that led to him being injured last time. By the time Fu CangQiong and the rest had caught up, they had laughed mockingly at him for a while upon seeing his injured state, and he had lost face in front of everyone else. He had vowed that he would make Ling Xiao meet a tragic end, or else it would be hard to eliminate the hatred in his heart.</p><br/><p>But it was undeniable that this trick indeed made him feel quite afraid. When one reached his rank, there were already very few things that could injure him, let alone someone who was weaker than him.</p><br/><p>You ZhenTian was always extremely wary of this hand.</p><br/><p>“Do you want to say that I’m not your opponent? Then why don’t you get a taste of this?” Ling Xiao glanced at him provokingly and lifted the ball of light in his hand high. Although the ball of light was small, it emitted a kind of world-destroying despairing aura. Its target had long since locked onto You ZhenTian.</p><br/><p>You ZhenTian’s eyes were so gloomy that it seemed like they were about to turn to ice, as if he wanted to pierce Ling Xiao’s body with them. Even up to now, he hadn’t forgotten the power of this trick.</p><br/><p>He didn’t dare to underestimate it, and with a flip of his large hand, an enormous black scythe appeared in his hand. The handle of the scythe was made of an iron chain, and one end of the chain was wrapped tightly around his wrist. This was the weapon that had made him famous in his youth. It had been many years since he last used it, because whenever he brought it out, that meant that he looked upon his opponent very highly, or that his opponent’s strength made him afraid, even though he didn’t want to acknowledge that point.</p><br/><p>Ling Xiao tapped on the ball of light, and it instantly surged up with a gust of wind before it shot explosively towards You ZhenTian.</p><br/><p>The enormous scythe in You ZhenTian’s hand immediately erupted with an intense black glow before it started to buzz and shake, as if it were very anxious. All the spiritual energy nearby started to be violently sucked over by it.</p><br/><p>“The scythe’s third technique — stealing the soul!”</p><br/><p>You ZhenTian shouted loudly, and the scythe in his hand sliced downwards forcefully. Immediately, a terrifying black aura of death burst out, and it was as if night had fallen as it sliced the sky apart into two halves.</p><br/><p>After a short while, the enormous black curtain collided with the ball of light, which was brimming with destructive power. The two forces attacked each other madly, and the ground quickly cracked apart, as a hurricane-like wind swept through the nearby plants and rocks. Everything within a thousand meters was completely destroyed in an instant, and the air changed shape with the pressure as crevices appeared one after another, the spacial energy tyrannical.</p><br/><p>Ling Xiao narrowed his eyes before a bottle of spiritual water suddenly appeared in his right hand. He flicked off the cap of the bottle and drank it all where You ZhenTian couldn’t see him. The spiritual energy in his body swiftly recovered, and two different types of flames appeared in his palm in a split second.</p><br/><p>The flames melded very nicely together.</p><br/><p>This time, he didn’t plan on creating the ball of light. He still couldn’t control that kind of extremely destructive ball of light very easily, and the two flames were what he was the most skilled at. He compressed the multicolored ball of fire very tightly until it couldn’t be any compressed any smaller.</p><br/><p>Just when the two forces were beginning to disappear, Ling Xiao quickly sent out the ball of fire. The tiny fireball collided with the ball of light, and it melted into it as if it had touched water.</p><br/><p>This was the move that Ling Xiao had wanted to pull off.</p><br/><p>Because he knew that it would be hard to inflict serious damage on You ZhenTian, who was already on guard, depending solely on the four-colored ball of light, unless he could completely and perfectly combine the four different bloodlines, increasing the true strength of the four-colored ball of light. But right now, that was impossible, so that’s why he thought of this strategy.</p><br/><p>Add in two energies anew, temporarily disrupting the balance of the four-colored ball of light. Violent waves swept outwards in all directions, and the black curtain retreated bit by bit under the pressure.</p><br/><p>As You ZhenTian watched in shock, the ball of light twisted fiercely before shooting straight towards him. After a moment, a deafening noise exploded like a clap of thunder. The rocks crumbled and collapsed, and the world changed colors…</p><br/><p>All the people nearby looked in the direction that the sound had come from. Some of the closer ones felt as if there was a rumbling sensation in their ears, before they saw a gigantic pillar of light shoot towards the sky. If somebody said that the people who were fighting and could generate such formidable destructive power weren’t Sacred Realm experts, most likely nobody would believe them.</p><br/><p>The experts from every powerhouse wanted to rush over and take a look. Nobody was slower than each other, but by the time they made it over, they all sucked in a breath of air. Everything within several thousand meters had been razed to the ground, leaving behind a huge hole so deep that they couldn’t see the bottom. However, this wasn’t what made them the most shocked. Above the hole, they saw someone standing, covered in blood, his expression already warped. They saw him raise both his hands before he roared furiously at the sky, “Ling Xiao, I definitely won’t let you get away with this!”</p><br/>\n</div>"}