{"title": "Chapter 637 - The Truth", "id": 637, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-637-the-truth", "volume_title": "Volume 7", "body": "<h1>Chapter 637 - The Truth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 637: The Truth</strong></h2><br/><p>Translated by Yan of Exiled Rebels Scanlations</p><br/><p>A ball of multi-colored light was suspended above the enormous stone stage. Seven different colors were intertwining within the light, and this ball of light seemed to be wrapped around something that looked like a magic pill.</p><br/><p>The four corners of the stone stage were carved with four stone dragons. Their mouths were opened, and it seemed like there were transparent tubes extending from the stone dragons’ mouths to the ball of light. There was a kind of white energy being transferred inside the tubes, and it was pouring endlessly in magic pill.</p><br/><p>But this wasn’t what shocked You XiaoMo the most.</p><br/><p>There was a transparent prison below the stone stage. There were many people imprisoned inside of it; precisely speaking, they should be souls. There were mages, as well as a few practitioners, and there were even demon beasts. These souls were currently howling in pain, their faces fierce, as if they wanted to end their lives then and there.</p><br/><p>You XiaoMo saw something peel away from behind them. It was the origin of their agony.</p><br/><p>“That is conviction and soul force.” At that exact moment, a hoarse voice suddenly sounded next to his ear.</p><br/><p>You XiaoMo turned to look and found that the white-robed person who had brought him over had already left. Now it was a middle-aged man wearing the clothes of a priest. He was staring with fascination at the thing above the stone stage, and if it weren’t for the fact that he was the only other person there, You XiaoMo might have thought that what he just heard was an illusion.</p><br/><p>Ever since he had been captured, he had never heard a white-robed person say a single thing in this place. Now that somebody spoke to him, he was not used to it.</p><br/><p>The middle-aged man slowly started to laugh. “You must want to know what’s happening here very badly. I can tell you.”</p><br/><p>You XiaoMo looked at him and didn’t speak.</p><br/><p>The middle-aged man didn’t care. He followed up with a shocking sentence: “I’m the same as you; we both came from another world, or should I say, another plane of existence.”</p><br/><p>“What are you going off about?” You XiaoMo furrowed his brows.</p><br/><p>The middle-aged man turned and glanced at him, and it felt like his eyes had a kind of ability to pierce through someone’s mind. The corners of his mouth slowly curved upwards. “In the world I’m in, one can advance by relying on the power of conviction. Even though it’s not as fast as cultivating, it is truly indispensable in our world. Moreover, the power of conviction can even help the practitioner to break through that realm.”</p><br/><p>When You XiaoMo heard him speaking about the the secrets that he shouldn’t know without any reservations whatsoever, he had more or less guessed what he wanted to do. On the contrary, his heart calmed down. “What does the power of conviction that you talked about have to do with this? What exactly is your goal?”</p><br/><p>“Rumor has it that the power of conviction can indeed break through and advance. But later, I discovered that it lacked the most important element.” The middle-aged man spoke out loud as if to himself.</p><br/><p>You XiaoMo asked, “What element?”</p><br/><p>The middle-aged man’s eyes suddenly revealed a hint of crazed happiness. He said, “The strength of the soul’s origin. The reason that realm is hard to break into is because of the restrictive nature of the world. It only recognizes one. Originally, cultivation is a path going against the natural order, and one is often unable to control their own destiny. However, once someone breaks into that realm, not only can they control their own destiny, they will become the master of the entire world. They can easily wipe away the rules the previous master left behind and establish new rules. Everyone will live under those rules.” The middle-aged man suddenly asked, changing the subject, “Oh, that’s right, do you know why this world’s rules aren’t obvious?”</p><br/><p>You XiaoMo was startled before he shook his head. How would he know this kind of thing? Ling Xiao had never talked about it with him, and he had never thought to inquire about it either.</p><br/><p>The middle-aged man chuckled and said, “That’s because the previous master is already no longer here. Even though the rules that he left behind are still here, it’s already no longer as obvious as before. This is extremely advantageous for the next generation. Without the previous master’s influence, the certainty of the TongTian Emperor breaking into that realm will increase greatly.”</p><br/><p>You XiaoMo felt like his worldviews had been refreshed tens of thousands of times today alone.</p><br/><p>Back then when he heard Ling Xiao mention breaking into the Sacred Realm seven star pinnacle level, he never imagined that this realm would be so awesome. In addition, someone could even establish new rules, wasn’t that the same thing as creating Heaven’s laws?</p><br/><p>“I already understand the realm you’re talking about, but what does it have to do with the strength of the soul’s origin?” He still didn’t understand why breaking into that realm would require using such a blood method?</p><br/><p>The middle-aged man simply didn’t bother hiding or concealing anything that he knew from You XiaoMo. He probably thought that after this You XiaoMo wouldn’t be able to tell anyone anyway, because he was going to die, so helped him resolve the misgivings in his mind all at once.</p><br/><p>The strength of the soul’s origin was actually the strength of the world’s origin. But the soul’s origin that the middle-aged man was talking about here was in reality referring to the middle- and low-level people. They needed 9999 people from different planes of existence, and afterwards, they would extract the origin energy from the soul.</p><br/><p>Extremely unfortunately, You XiaoMo was the very last one.</p><br/><p>The TongTian Emperor had already implemented this plan for many years. The reason why he hadn’t appeared in public for many years was because he was constantly running between different planes of existences with his subordinates.</p><br/><p>It was impossible to gather together over nine thousand different planes. What’s more, there already wasn’t very many middle-level planes, and it was fairly troublesome to pinpoint their locations. So he could only go to low-level planes to search. There were quite a few low-level planes, so it was easier to catch. But it was still something that wasted a considerable amount of time.</p><br/><p>However, under his persistence and patience, he finally only needed one more.</p><br/><p>But it was harder and harder to pinpoint the location of the planes. In order to capture the 9998th plane, the TongTian Emperor spent three or four hundred years, but this also meant that the difficulty level of finding the last plane would become even higher.</p><br/><p>Coincidentally, You XiaoMo just happened to run into them at this time. It was also an accident finding out that he was a soul that came from a different world.</p><br/><p>The Vermillion Blood Clan made a huge fuss about You XiaoMo. Even though they concealed their real objective, the TongTian Emperor knew the You Family’s secret.</p><br/><p>But he knew that the real You Family had already been wiped out in ancient times. What was left were just some side branches. Since You XiaoMo could open the Inheritance Jewel, that meant that he was from the real You Family. However, the TongTian Emperor didn’t find out he was from a different world because of this; instead, it was during the second exam.</p><br/><p>When You XiaoMo was being pursued by the black shadows, he had accidentally let it slip. Even though it was only him back then, that world was actually all in the grasp of TongTian’s Emperor. You XiaoMo’s every word and action couldn’t escape his surveillance.</p><br/><p>“Enough, I said so much. It’s also time for you to be on your way.” It was as if the middle-aged man had unburdened his heart after speaking, and he smiled as his gaze landed on You XiaoMo again.</p><br/><p>You XiaoMo looked at the guards around them. He couldn’t take on this many by himself, and he said hastily, “Wait a second, I still have another question.”</p><br/><p>“What is it?” the middle-aged man asked.</p><br/><p>You XiaoMo said, “Since you guys only need 9999 people from different planes, why did you have to capture so many experts from TongTian Continent?”</p><br/><p>The middle-aged man lifted his hands and arranged his sleeves and robe before glancing at him with a hint of a smile. “You’re going to die in any case, so there’s no harm in telling you. There’s only one Higher Level Realm, you must know that. But just because there’s only one, it needs an even larger amount of origin energy. Do you understand if I explain it like this?”</p><br/><p>“Oh, that’s right. There’s also another thing.” The middle-aged man suddenly remembered something, and he curved his lips slightly. “Even though you’re the last one, those people in the prison can’t escape either. It won’t be long before they’ll go down there and accompany you. You don’t know yet, do you? The Soul Disappearing Array down there isn’t a normal array. It also has another name — Absolute Death Array!</p><br/><p>“The Absolute Death Array is a kind of sacrificial array. It can transform all of the living people inside of the array into energy. The reason why TongTian Palace didn’t seal their cultivation bases is to ensure that they can smoothly transform into energy. Because the more violently they resist, the more effective the Absolute Death Array is. When the energy reaches a certain high point, an ancient barrier surrounding TongTian Palace will activate. When the time comes, none of those people who barged into will be able to escape.” A hint of sinister ruthlessness flashed through the middle-aged man’s eyes.</p><br/><p>You XiaoMo sucked in a breath of air. Completely inhuman.</p><br/><p>No wonder He Dong would say that. It was indeed not without basis.</p><br/><p>The middle-aged man said, “You know everything that you should know. You can go on your way now.” As he spoke, he reached out a hand towards You XiaoMo.</p><br/><p>Why would You XiaoMo wait to die obediently? A boundless wave of soul force shot towards the man with a roar the moment he moved.</p><br/><p>The middle-aged man laughed coldly. He had long since expected that he wouldn’t obediently submit. With a casual wave of his hand, an even more fierce wave of soul force welled up from inside him, colliding instantly with You XiaoMo’s soul force. A violent wind started emerged between them, creating a piercing exploding noise at once. By the time the power dispersed, You XiaoMo had already disappeared.</p><br/><p>The middle-aged looked sharply in the direction of the stone stage only to see that a human figure had suddenly appeared on the originally empty stone stage. It was You XiaoMo.</p><br/><p>Without waiting for him to shout, You XiaoMo smashed a fist onto one of the stone dragon’s heads. With a rumble, the stone dragon’s head tumbled down, and the force from the origin that was currently being transmitted sprayed out immediately, shapeless and colorless. It instantly disappeared in the air…</p><br/><p>The middle-aged man opened his eyes wide and roared in rage, “You bastard, I’m going to kill you!”</p><br/><p>You XiaoMo immediately booked it and ran.</p><br/>\n</div>"}