{"title": "Chapter 633 - The Unreturnable Prison", "id": 633, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-633-the-unreturnable-prison", "volume_title": "Volume 7", "body": "<h1>Chapter 633 - The Unreturnable Prison</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3><strong>Chapter 633: The Unreturnable Prison</strong></h3><h4>Translated by Yan of Exiled Rebels Scanlations</h4><br/><p>“They’re here again!”</p><br/><p>When the man saw them, he said those three words almost imperceptibly. Since You XiaoMo was close to him, he could hear him fairly clearly. The man’s voice was full of hatred and fury, as well as a bit of powerlessness.</p><br/><p>You XiaoMo’s gaze moved to the three white-robed people. Even though he couldn’t see their faces clearly, they were all extremely strong. Moreover, ever since they had come in, the prisoners’ mood had started to fluctuate excitedly.</p><br/><p>Even though it was faint, several strong, negative emotions were mixed in, which were all targeted at those three white-robed people, but there was more fear than anything else.</p><br/><p>The three white-robed people walked past the cell You XiaoMo was imprisoned in. One of their gazes seemed to sweep carelessly across him, and he could vaguely hear other people releasing a breath of relief when the white-robed people moved past their cells. The tense atmosphere also started to relax.</p><br/><p>After a while, the sound of iron chains clanking came from inside, followed closely by the sound of someone howling in fright.</p><br/><p>“I don’t want to go, I don’t want to die, let me go, let me go! You’re all devils, devils who don’t deserve to die properly. I curse you all to have an unpleasant death.”</p><br/><p>The person was being dragged along by two white-robed people, and his expression looked as if he were deranged. But even though he was struggling endlessly, he didn’t move them in the slightest. He was still dragged out, black shackles around his hands and feet. They created clanking sounds as he struggled, large echoes rippled through the expansive prison.</p><br/><p>You XiaoMo saw some people shake their heads helplessly, and the suspicion and unease in his heart grew stronger and stronger.</p><br/><p>“This person won’t be able to come back.” At that moment, the man who had just talked to You XiaoMo gave a helpless sigh. His voice seemed a little lonely, as well as a trace of hard to detect despair, as if he would also walk that path one day.</p><br/><p>“Why?” You XiaoMo continued the conversation.</p><br/><p>The man didn’t answer for a long time, and just when You XiaoMo thought he wasn’t going to reply at all, he said, “I don’t know the specifics of the situation, but I know that it seems like TongTian Palace is currently carrying out some kind of shocking experiment. They need many experts, and everyone who ‘walks’ out of this place never returns. So they always need more people to make up for it after a short amount of time, and it seems that TongTian Palace is using some sort of honest and open way to catch people. How did you get in here?”</p><br/><p>You XiaoMo told him briefly about how he was locked inside here.</p><br/><p>“So that’s how it was. To be the only one chosen out of a hundred people, you’re also pretty unlucky. This is one of TongTian Palace’s tricks: by using the competition, they can secretly kidnap a few of you from the hundred or so others. They probably announced to the outside world that you all already died. It’s really a good excuse. If you don’t have any strong experts supporting you, you probably won’t be able to get out of here for the rest of your life. But even if you do, there’s hardly anybody who is stronger than TongTian Palace. You should just prepare yourself in your mind.” The man sometimes laughed and sometimes sighed helplessly, his expressions abundant. It seemed like he had also experienced this before.</p><br/><p>You XiaoMo lifted an eyebrow. “Were you also once a student from XiaoYao Institution?”</p><br/><p>The man hadn’t expected him to be so sharp. There was nothing worth hiding about this either, and so he said, “I could be considered so. Speaking of which, I would be your senior.”</p><br/><p>When he thought of what happened before, the man’s expression fell quite a bit instantly. He remembered how high-spirited he used to be, but in the end, he had still fallen to this point. If he couldn’t get out, then he shouldn’t have any more hopes for this lifetime.</p><br/><p>You XiaoMo had just entered, so he wasn’t as emotionally stirred up. He also firmly believed that Ling Xiao would definitely rescue him. Moreover, Fu CangQiong also needed his help. Even though his cultivation base still wasn’t high enough to refine the Samsara Pill yet, but the Cang Alliance better not forget that they still owed him a big favor.</p><br/><p>“You’re not worried?” The man was paying attention to his expression, and when he saw that You XiaoMo had no change in expression after listening to him speak, he couldn’t help but ask that.</p><br/><p>You XiaoMo grinned. “What is there worth worrying about? Someone will definitely come to rescue me.”</p><br/><p>“You’re this confident?” The man still didn’t believe him. Ever since he was locked inside this prison, he had never seen a single person who had successfully escaped, nor had anyone ever come to rescue them. When the typical person heard of TongTian Palace, they would have long since run far, far away. Who would dare to challenge TongTian Palace?</p><br/><p>“Of course, my man is very powerful. Also, I have a lot of friends, and my clin… uh, my dad is also very strong. Just then, I heard that TongTian Emperor say that my man and my dad have been thinking of ways to rescue me during this past year.” You XiaoMo said honestly. He said the words ‘my man’ even more smoothly.</p><br/><p>The man looked at him with surprise. “You’ve seen the TongTian’s Emperor?”</p><br/><p>You XiaoMo nodded. “Of course, is there a problem?”</p><br/><p>The man’s eyes flashed. He only knew that the TongTian’s Emperor was an extremely mysterious person, and back then when he had been caught, he hadn’t seen the TongTian’s Emperor at all. When he connected it with You XiaoMo’s confident expression and words, he knew that maybe this person really did have the ability to get out.</p><br/><p>“You can’t be trying to trick me, right? If your supporters are really that formidable, why would you be dragged in here? The TongTian Palace usually only kidnaps those who don’t have powerful backers or supporters.” The man said, testing him out.</p><br/><p>You XiaoMo scratched his head. “I also can’t answer your question. If I knew why I was kidnapped, then I wouldn’t need to ask you.”</p><br/><p>After thinking about it, the man also felt that what he said was logical. “Then tell me, who will come to save you? If there’s only the two people you told me about, they probably won’t be able to deal with TongTian Palace relying on their ability alone. TongTian Palace has a strong and solid inside information network, and there are also quite a few generals underneath the TongTian’s Emperor.”</p><br/><p>“I can’t tell you that. But I can say with certainty that I know a lot of Sacred Realm experts, probably seven or eight if I estimate conservatively.” You XiaoMo said whatever came into his mind first, but he actually did know quite a few. He just wasn’t that close with some of them, that’s all.</p><br/><p>The man’s eyes lit up, but he didn’t directly trust his words. He thought a bit before asking again, “Give me an example. Such as, your man and your dad?”</p><br/><p>“My man is from the Qilin Clan, and he has a level twelve five star cultivation base. My dad is from the Vermillion Blood Clan. He’s a pretty low-profile person, but he’s also a Sacred Realm expert, with a three or four star cultivation base.” You XiaoMo looked proud.</p><br/><p>The man sucked in a breath of air. The Qilin Clan and Vermillion Blood Clan were two large powerhouses. Even though TongTian Palace was powerful, it wouldn’t be advantageous at all for them to provoke those two powerhouses at the same time, especially when they were doing something secretive. If they didn’t handle it appropriately, it would very likely be exposed because of this.</p><br/><p>He hadn’t imagined that TongTian Palace would have kidnapped a big problem this time. If they could take advantage of this wisely, they could probably escape from Sheng Tian. A thread of hope appeared in that man’s dead heart for the first time. After so many years, if he was going to die with or without fighting, then it would still be better to choose fighting.</p><br/><p>“Young fellow, if what you’re saying is true, there still might be a chance to escape from here. But if what you’re saying is a lie, then the only result will be that you’ll die even faster.”</p><br/><p>Radiance shone through the man’s eyes, and he looked at You XiaoMo intently and sharply. Even though he had been locked in here all along, so his cultivation base hadn’t improved, he wasn’t weaker than You XiaoMo. Moreover, his willpower was very resolute, or else his realm would have long since dropped.</p><br/><p>You XiaoMo nodded solemnly. “I promise that I’m not tricking you. Everything I said was true.” Indeed, between Ling Xiao and his clingy dad, one was from the Qilin Clan, and one was from the Vermillion Blood Clan. The only thing was that both of them had drawn a clear line between them and the two major powers, but he wasn’t lying.</p><br/><p>The man saw that it didn’t seem like he was lying, and he finally believed him. “For now, don’t make any movements, so you don’t attract TongTian Palace’s attention. If things are really as the TongTian’s Emperor has said, then TongTian Palace should be a little chaotic right now inside. When the opportunity strikes, I will tell you how to escape.”</p><br/><p>You XiaoMo nodded, nothing changing about his expression.</p><br/><p>Inwardly, he was actually already extremely overjoyed. Before, he had mentioned TongTian’s Emperor on purpose just so he could attract this man’s attention, so he could trust that You XiaoMo was valuable.</p><br/><p>This prison had probably existed for at least over a hundred million years. The people imprisoned here were all Divine Realm and up experts. When he was locked in here earlier, he had also seen quite a few Sacred Realm experts.</p><br/><p>He didn’t believe that they had all really resigned themselves to being locked in here for the rest of their lives until death. During that time, they had definitely looked for many different ways to escape, and their experience absolutely had to be more plentiful than his, since he just entered. Naturally, he had to utilize such a good resource well.</p><br/><p>Even though the man said there was no way out, You XiaoMo trusted that he definitely could think of a way. It was just because the chance of success was low, so he chose to bear it silently. That’s what his intuition told him, and in reality, he hadn’t gambled incorrectly. The man did indeed have a method.</p><br/><p>Afterwards, the person who was brought out indeed didn’t return. Another person entered his cell. You XiaoMo had seen his face before, and even though he didn’t have a deep impression of him, he was sure that the person was a rainbow level mage who had participated in the competition at the same time as him.</p><br/><p>The person looked like he was in despair, as if he had received some blow.</p><br/><p>After a while, You XiaoMo heard him howling and shouting loudly in his cell, as he only cursed out TongTian Palace’s people in rage. Perhaps he was someone who had once believed in TongTian Palace, but now, this belief was completely shattered. That blow had to be significant.</p><br/><p>He had an abundant amount of energy, and nobody nearby warned him either. The second day, You XiaoMo saw him be taken away, and he never came back again.</p><br/>\n</div>"}