{"title": "Chapter 638 - Destroy", "id": 638, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-638-destroy", "volume_title": "Volume 7", "body": "<h1>Chapter 638 - Destroy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 638: Destroy</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>The Origin Energy was equivalent to the vitality of the soul and it could also be considered as the life force of all living things. The weeds near the stone platform started growing crazily after it leaked out. A little leakage of life force was enough to make all living things grow. One could well imagine the consequences of an unending stream of life force.</p><br/><p>The middle aged man could not stop it in time. Driven by the Origin Energy, the growth of the weeds was extraordinarily crazy. In less than a dozen seconds, all the weeds had become more than ten meters high, looking like they were going to break through the sky.</p><br/><p>You XiaoMo was also surprised by the turn of events, but it also created an excellent cover for him. The white-robed man from the TongTian Palace immediately lost sight of him when he scurried into the weeds.</p><br/><p>“Pass on my orders. Catch him and execute him immediately on the spot. Then pull his soul out.” The middle aged man was burning with frenzied rage as he roared. He could not leave the stone platform in order to prevent the Origin Energy from continuing to leak out.</p><br/><p>This result was exactly what You XiaoMo wanted.</p><br/><p>If the middle aged man did not shoot his mouth off and tell him the truth, he would not have known that the stone platform had such a function.</p><br/><p>Since he attached so much importance to the Origin Energy, it should be enough to cause them to panic as long as he smashed one of them.</p><br/><p>The truth had proved this as the middle aged man was thrown into confusion by his move. They had planned for the Origin Energy before they had even started. If they fell one step short of success at this point, the many years of effort of the Tongtian Emperor would be destroyed in one day and he would not be able to bear the consequences.</p><br/><p>The middle aged man was regretting his previous actions. Why did he have to tell him so much? Unfortunately, there was no use crying over spilt milk, so he can only try to preserve the Origin Energy.</p><br/><p>The middle aged man was the only Sacred Realm cultivator on the stone platform because he was a Grade Six mage. Originally, this would be more than enough to catch You XiaoMo, but it was precisely because of his self-confidence that he fell to this extent.</p><br/><p>Though the TongTian Palace had a deep background, Ling Xiao had seriously injured and killed many of their experts in this year. Now that he was leading a large number of powerhouses consisting of several Sacred Realm experts to attack the TongTian Palace, almost all the experts in the TongTian Palace had gone out to meet the attack.</p><br/><p>All those that currently remained in the Palace had a Divine Realm cultivation base and it was really hard for them if they wanted to catch You XiaoMo!</p><br/><p>The middle aged man had also thought about this. He immediately ordered the people to carry the stone dragon’s broken head up and rebuild a basic transmission pipe. He instructed the others to keep an eye on the stone platform before heading out to catch You XiaoMo himself.</p><br/><p>If You XiaoMo was not the last one in their plan, the middle aged man would not care whether he escaped or not. Unfortunately, it just had to be him.</p><br/><p>If he escaped, not only would the plan would be delayed by several years or even several hundred years, the secret of the TongTian Palace would also be discovered by the world. At that time, the power of faith would also be somewhat affected.</p><br/><p>Although there was still some portion of the power of faith being passed on, the power of faith that the TongTian Palace received this year had been greatly reduced because of Ling Xiao. Fortunately, the other realms believed in the Tongtian Emperor, so they did not need to worry too much about this aspect.</p><br/><p>Just five minutes after the middle aged man left the stone platform, a speck of dust drifted almost purposefully towards the direction of the stone platform from the dust-filled sky.</p><br/><p>At this moment, the stone platform was surrounded by ten white-robed people, two of whom were even high star Divine Realm experts. The cultivation of the rest were varied, but their combat effectiveness was still quite high when they worked together. Yet none of them noticed the approaching danger.</p><br/><p>It was very quiet all around except for the crackling sound – similar to when a magic pill was burning – which occasionally came from the middle of the stone platform.</p><br/><p>“Boom–“</p><br/><p>The sound of an explosion which had come without warning suddenly sounded. The stone platform violently shook several times, and countless white souls darted out in a mad rush from below. The expressions of the ten white robed men immediately changed.</p><br/><p>Without the supply of Origin Energy from these souls, the four stone dragons immediately stopped transmitting the Origin Energy to the magic pill in the middle. The consequences was more severe than the destruction of one stone dragon’s head by You XiaoMo.</p><br/><p>“Immediately send someone to inform the High Priest. Four people will stay here to guard the stone platform, while the rest will follow me to catch the escaped souls.” A white robed man with a high star cultivation base quickly made a decision before leading four others in the direction that the souls had escaped in.</p><br/><p>The TongTian Palace was always too confident in itself. As they did not anticipate any mishaps, the number of people caught were all allocated in advance and there were no extras. Therefore, the plan would also ground to a halt if these souls managed to escape.</p><br/><p>“It’s going to be troublesome this time.” The other high star expert who had stayed behind to guard the stone platform had a gloomy expression.</p><br/><p>As a matter of fact, they were all once kidnapped by the TongTian Palace. However, they betrayed their companions in order to save their necks, and pledged their life and loyalty to the TongTian Emperor. As their lives were held in the hands of the TongTian Emperor, they dared not betray the TongTian Emperor even in a desperate situation. Yet, the current situation was different.</p><br/><p>If the TongTian Emperor knew that there was an issue with the stone platform while they were guarding it, he would certainly take his anger out on them and maybe he would take them as ingredients. No one knew better than them how important the stone platform was to the TongTian Emperor.</p><br/><p>“You guys wait here and watch over this place first. I’ll go check what’s happening.” The high star expert suddenly told the other three and prepared to walk out before they could respond.</p><br/><p>One of the white robed man abruptly grabbed his robe, “Don’t think we don’t know that you want to run away. You’re afraid of being killed by TongTian Emperor, but we cherish our lives too.”</p><br/><p>Since their opinions had all reached an accord, they naturally fled together.</p><br/><p>Additional people could help shoulder a portion of the danger. Even if the TongTian Emperor found out afterwards, they could also match their confessions and properly plan out countermeasures.</p><br/><p>Thus, the stone platform was deserted in no time.</p><br/><p>You XiaoMo revealed himself. He had completely overheard their conversation while in his dimension. He did not expect the situation to be like this inside the TongTian Palace. If so, it would be too easy to drive a wedge between them, but… He shifted his eyes to the magic pill that was wrapped in seven colors on the stone platform. Five sparkling and golden characters flashed in his mind – The Heavens Are Helping Me!</p><br/><p>Once he thought of this, You XiaoMo dared not tarry any longer. He rushed onto the stone platform without demur and reached out with the intention of taking the magic pill out.</p><br/><p>However, when his hand touched the outer layer which made up the seven colors, an electric shock spread over his body. The amount of electricity seemed to be quite large too. His limbs became paralyzed in an instant and a tremendous force threw him out before he could react.</p><br/><p>You XiaoMo stabilized his body in the air, and then he circulated the soul power in his body into his limbs to alleviate the paralysis before falling flat onto his back.</p><br/><p>You XiaoMo immediately stared at the seven-colored ball of light in surprise after landing steadily on the ground. This thing even had a defensive function, sure enough, it was not just for decoration.</p><br/><p>Thinking of this, You XiaoMo immediately took out that pair of ugly gloves from his dimension. Now that he was not in the Soul Disappearing Array, he could it enter and exit his dimension as and when he wanted without its interference. The TongTian Emperor probably did not tell the middle aged man that he had a dimension that could move at any time.</p><br/><p>After putting on the gloves, You XiaoMo continued to try taking the pill.</p><br/><p>This time, he did not feel that electric shock anymore when he reached in. In a spurt of energy, You XiaoMo grabbed the magic pill…</p><br/><p>At the same time, the expression of the Tongtian Emperor, who was fighting intensely with Ling Xiao in the sky, abruptly changed. He suddenly looked in a particular direction, which was where the stone platform was at. As this was a matter of great importance, the stone platform was placed in a secret area and the situation there could not be seen from their current location.</p><br/><p>This unusual expression was caught by Ling Xiao. When he saw that the TongTian Emperor wanted to extricate himself, he immediately obstructed him without a second thought. No matter what happened, Ling Xiao was certain that it must definitely be something detrimental to the TongTian Emperor.</p><br/><p>“Get out of my way!” The TongTian Emperor’s expression was malevolent and powerful spiritual energy was constantly bubbling out from his body. Crackling sounds echoed, as if lightning was gathering and winding around him. His aura was dreadfully terrifying.</p><br/><p>Unfortunately, the one in front of him was Ling Xiao, who was more arrogant than him. His gaze was like sharp arrows, chilly and bone-penetrating as they landed on the TongTian Emperor. The bitterly cold black robe was blown by the wind making a cold and raw noise. Ling Xiao’s handsome face revealed a cocky and tyrannical smile when he heard his words, “Thinking of getting past me? Then defeat me first!”</p><br/><p>As Ling Xiao’s physical constitution was that of the valiant Four Ancient Beast Clan’s, his fighting capacity was extremely indomitable. The TongTian Emperor seemed to be reserving his own strength because of something, so their battle was currently at a standstill and none could gain any advantage!</p><br/><p>After Ling Xiao finished speaking, a fireball created from the fusion of three forces appeared in his hands. He could now freely control three types of forces. Though the result was not as powerful as using the four forces, the might of the attack could not be underestimated.</p><br/><p>The TongTian Emperor’s expression darkened, “Since you want to die, I’ll grant your wish.”</p><br/><p>As soon as he finished speaking, the aura from his body suddenly increased explosively. This time, it appeared that he did not intend on concealing it anymore. Although it could not be seen from his expression, in actual fact, the TongTian Emperor was extremely worried because he had just felt that someone had moved something on the stone platform. It would be all right if it was the High Priest, but if it was someone else…</p><br/><p>Ling Xiao looked increasingly serious. Despite him being at six star, his realm was not stable enough because he has just advanced, so the actual gap with the TongTian Emperor was more than one star.</p><br/><p>At this moment, You XiaoMo had already gotten the semi-finished magic pill. He had also destroyed the stone platform while he was at it before leaving.</p><br/><p>Shortly after he left, the middle aged man who had not been able to find You XiaoMo all along returned to the stone platform. When he saw the destroyed stone platform, he immediately realized that he had fell for the ruse of luring the tiger out of the mountains. A furious roar resounded through the air in the TongTian Palace.</p><br/>\n</div>"}