{"title": "Chapter 646 - Ji SuXin", "id": 646, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-646-ji-suxin", "volume_title": "Volume 7", "body": "<h1>Chapter 646 - Ji SuXin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 646: Ji SuXin</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Once they heard this voice, the two clansmen could only secretly curse in their hearts. But that person had already walked out from the Forbidden zone before they could reply.</p><br/><p>His tall figure blocked half of the door of the Forbidden zone. He had a square face, but the combination of his overall facial features were not ugly. His features were extremely dignified and his eyes were not a pure black. Instead, it was brown in color upon closer inspection. His gaze carried a sense of vicissitudes accumulated by the years, however it contained a light pressure when directed at others.</p><br/><p>The two clansmen looked at each other in dismay and did not speak.</p><br/><p>The old man’s gaze swiftly shifted to the chick. His gaze was extremely cold, “This is Ji NingYu, the grandson of the Great Elder?”</p><br/><p>One clansman answered, “Yes, Fourth Elder. He is the Young Master of the Valley.”</p><br/><p>The status of the chick as the Young Master of the Valley had been confirmed for the most part, so all the Demon Phoenix Clan members addressed the chick as Young Master and they did not think there was anything wrong with it.</p><br/><p>The old man looked back at Ji NingYu once before he calmly told them, “Even if he is the Young Master, no one is allowed to enter the Forbidden zone without the consent of the Valley Master and the Great Elder. Bring him away.”</p><br/><p>After that, he turned and entered the Forbidden zone.</p><br/><p>The chick did not intend to leave the matter at that. He was already here. If he did to make another trip, he still had to lose the people who followed him all day long.</p><br/><p>Just as he was preparing to burst in forcefully, a pair of hands stretched out from behind him, grabbed him under his armpits and picked him up. A gentle voice that carried a hint of a smile drifted into his ears at the same time.</p><br/><p>“Young Master, don’t be mischievous. If the Great Elder knows about this, you’ll be punished by him again.”</p><br/><p>It was Ji Feng who had arrived. He was now equivalent to the nanny of the chick. Though Ji Feng had always been shaken off the moment he was distracted in the past, he knew that the chick would come to the Forbidden zone again. The Young Master was excellent in all aspects, it was just that he was too curious and loved to go where he was not allowed to.</p><br/><p>In the Forbidden zone, the old man walked along the passageway to the interior.</p><br/><p>The Forbidden zone of the Demon Phoenix Clan was not a damp and dark place like a dungeon. On the contrary, the interior of the Forbidden zone was beautifully furnished and whatever there was outside was also present here. Beautiful Night Pearls were everywhere, illuminating the Forbidden zone.</p><br/><p>The old man entered a gate, and what met the eyes was a scenery of exceptional charm. Airy pavilions and pagodas stood on the running water and a figure was sitting in a pavilion beside the structures. The running water flowed down from above, running along several corners of the pavilion to the pond below, looking vaguely like a prison.</p><br/><p>The old man went to the pond and looked at the person in the pavilion without saying a word.</p><br/><p>The two did not speak for quite a while until that person opened their eyes as their gaze leisurely landed on the old man. A beautiful voice akin to that of a singing oriole slowly drifted out from between her thin lips. “Father, is there something weighing on your mind?”</p><br/><p>Suddenly, the old man’s expression became obscure after hearing her words and he spoke after a long moment, “If that kind of matter had not occurred at that time, the Valley Master of the Demon Phoenix Clan would have been you.”</p><br/><p>The woman in the pavilion suddenly revealed a smile that could bedazzle the mind, “Father, it’s been so many years. Are you still thinking about that matter? Your daughter had said long ago that her actions were voluntary and has nothing to do with anyone.”</p><br/><p>The old man’s expression was still unhappy, “You would not have fallen to your current plight if it hadn’t been for him.”</p><br/><p>“Father, why are you so strongly attached to the past? Time will not turn back and I will never regret it.” The woman sighed softly. She had always known about the knot in her father’s heart, but she could not help him to undo it.</p><br/><p>“You don’t regret it?” The old man suddenly sneered, “SuXin, you may be able to deceive others, but you can’t deceive me. Why haven’t you asked about your child for so many years if you really don’t regret it?”</p><br/><p>Ji SuXin fell silent in an instant.</p><br/><p>The old man whispered, “SuXin, you’ve been in the Forbidden zone for decades and have never ventured out. You don’t know anything that has been happening outside. Do you know how your child is doing now? I can tell you if you want to know.”</p><br/><p>“Father, let bygones be bygones. Your daughter just wants to be alone now.” Ji SuXin’s eyelashes lowered with a serene expression on her face.</p><br/><p>However, the old man did not intend to give up. For many years, he had hoped that his daughter would admit her mistake so that she could come out. However, not once had he been able to understand his daughter’s thoughts. She said that she did not regret what happened, but he never heard her mention anything about that man and her child.</p><br/><p>“In recent years, your child has demonstrated extraordinary talents within the TongTian Continent. He successively made enemies of many great forces for the sake of one man, and has struggled on the edge of life and death. However, his talent is really outstanding. Some time ago, the TongTian Palace was destroyed in one go by the people he led. That long-established power has now hidden themselves, and he has become a person who can stand on equal footing with top powerhouses like You ZhenTian…”</p><br/><p>In the midst of the old man’s mild-mannered narration, Ji SuXin’s expression changed a little.</p><br/><p>“By the way, your child’s name is Ling Xiao.” The old man knew that she had never met the child again ever since he was born. Naturally, she did not know of the child’s name, so he told her without further thought. Unexpectedly, her expression suddenly changed.</p><br/><p>Ji SuXin raised her head and her expression was somewhat chilly, “Father, you’re sure he’s called Ling Xiao? And it’s the Ling from Ling Yun Zhuang Shi?”</p><br/><p>t/n: Ling Yun Zhuang Shi () means to have a strong resolution to reach the clouds or lofty aspirations. The Ling () – to rise high in this case – in this phrase has the same character as Ling Xiao ().</p><br/><p>“Yes it is. Almost everyone knows about it with his current fame.” The old man did not know why her expression suddenly changed and also did not know what was wrong with the name. All he knew was that her daughter’s heart that had been as calm as still water for so many years suddenly reacted to this name.</p><br/><p>Ji SuXin chuckled a few times, “Father, I’m tired. Please leave.”</p><br/><p>Anger flashed through the old man’s eyes, but eventually it was suppressed before he indignantly flicked his sleeves and left. From beginning to end, he could not understand why his daughter was so stubborn.</p><br/><p>She had always listened to him in the past, but everything changed since she met that man. For this reason, he had a lot of hatred for that man, and he did not like their child either.</p><br/><p>Ji SuXin’s affair was a taboo in the Demon Phoenix Clan</p><br/><p>The chick had tried asking people around him, but they remained silent and even took the initiative to change the subject every time. So he only knew that the Boss’s mother was probably imprisoned in the Forbidden zone and did not know anything about the rest.</p><br/><p>The chick was not furious after being taken back by Ji Feng.</p><br/><p>The Great Elder had once said that the most important requirement for a qualified leader was patience, and the thing he lacked the least in the past few years was patience.</p><br/><p>His chance soon came.</p><br/><p>It had been mentioned before that the Four Ancient Beast Clans were in the midst of a intense and violent war with the Black Spider.</p><br/><p>The Black Spider actually could not be considered as a new force that rose abruptly. Their strength gradually entered the public’s eyes when they appeared. There were many Sacred Realm experts and dozens of Divine Realm powerhouses. The number of experts were so large that the Four Ancient Beast Clans all felt apprehensive.</p><br/><p>It was only after investigating that everyone knew that the place where the Black Spider was the most active was in Xi Jing. The mysterious force that Tian Dao had vaguely perceived that year was the Black Spider. However, they did not claim to be members of the Black Spider in those days, so no one linked them with the Black Spider at that time.</p><br/><p>Nowadays, there was a fierce struggle in the Western Territory.</p><br/><p>The Black Spider had constantly expanded its territory and was already encroaching on the interests of the Four Ancient Beast Clans. At present, the Demon Phoenix Clan also had to dispatch their experts to defend their territory in order to deal with the Black Spider, so there were not many powerhouses left in the Hundred Birds Valley. Even Ji SuXin’s father was not present.</p><br/><p>The chick easily shook off the people that the Great Elder sent to accompany him. This time, he was smart enough not to make a move in person, instead he let Ji Feng step in to hinder those two.</p><br/><p>Although he was only a few years old, his IQ was not low. Ji Feng did not agree in the beginning, so he made some heart-stirring promises with Ji Feng, and finally managed to persuade him.</p><br/><p>In the glittering pavilion, Ji SuXin’s posture remained unchanged.</p><br/><p>The chick stood outside the pavilion, expressionlessly staring at Ji SuXin whose lashes were lowered. Was this the Boss’s mother?</p><br/><p>Ji SuXin was extremely beautiful. Her white and plain clothes made her look like a holy and pure fairy in a pavilion. Her five features were rather exquisite and alluring. At that time, she had even been praised as the most beautiful woman in the TongTian Continent. Everyone knew that the holy maiden of the Demon Phoenix Clan was elegant in appearance, but passionate in heart. Otherwise, such a situation would not have happened with Ling Xiao’s father.</p><br/><p>Half an hour later, Ji SuXin lifted her eyelids and looked at the chick who had remained silent. The chick had the appearance of the three-year-old baby, but his cultivation base was ridiculously high.</p><br/><p>“You are Ji NingYu?”</p><br/><p>Instead of answering her, Ji Ningyu asked, “Are you the holy maiden who mingled with a man from the Qilin Clan and gave birth to a son?”</p><br/><p>Ji SuXin’s expression changed slightly, but she neither admitted nor denied it.</p><br/><p>The chick laughed, “I know the answer even if you don’t say anything. Do you want to get out of here?”</p><br/><p>Ji SuXin’s lower lip slightly twitched up, “You want to let me out?”</p><br/><p>“I have a contract with your son’s wife. May I consider letting you go to your son if you want to escape. Do you want to get out?” The chick did not deliberately address them with deference. The members of the Demon Phoenix Clan were extremely proud, and did not permit themselves and their clansmen to be meek and subservient in front of others.</p><br/><p>Contrary to his expectations, Ji SuXin’s smile suddenly turned into a mocking one.</p><br/><p>He suddenly heard Ji SuXin coldly reply while he was having misgivings, “No, I don’t. You can leave now!”</p><br/>\n</div>"}