{"title": "Chapter 644 - Irresponsible", "id": 644, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-644-irresponsible", "volume_title": "Volume 7", "body": "<h1>Chapter 644 - Irresponsible</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 644: Irresponsible</strong></h2><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>Very few knew of the ancient battle, and as luck would have it, the You Family ancestor they met at the Demon Beast Graveyard of the Ghost Tomb Mountain Range was one of them. It was also him who told Ling Xiao about it, otherwise he had no way of knowing.</p><br/><p>He also told him about the fact that when the Four Ancient Beast bloodlines combined, it was strong as the Almighty. Back than, in an instance, the man in white knew all of the bloodlines in Ling Xiao, but if it wasn’t for he and You XiaoMo’s relationship, he might not have told Ling Xiao about it.</p><br/><p>What goes around comes around, probably something like that.</p><br/><p>As for why the first TongTian Emperor died, that has to do with the Four Ancient Beast Clan’s legend.</p><br/><p>The first TongTian Emperor was highly ambitious, not only did he want to destroy the Four Ancient Beast Clans, he also wanted to destroy some of the major families of the time. The You Family was amongst them. He wanted to then regroup the forces of the TongTian Continent and unify them.</p><br/><p>But his scheme was still discovered.</p><br/><p>Back in the ancient times, there was also someone like Ling Xiao who had all Four Ancient Beast Clan’s bloodline and was just as unappreciated. Back then, the Four Ancient Beast Clans didn’t know that a perfectly combined version of their bloodline would become as strong as the Almighty.</p><br/><p>Only when the first TongTian Emperor’s scheme was discovered did that person start to shine, but when the fight came near its end, that person still perished together with the Almighty.</p><br/><p>Due to the Almighty’s disappearance, although this world was complete, it’s rules weren’t fully set. What was left was what the first Almighty set as the rule, if there wasn’t a new one soon, it wouldn’t be long before their rules disappeared.</p><br/><p>But, even though the ancient battle was an evil scheme of the Almighty, the truth wasn’t known because the one who found out about it was the one who died together with the Almighty.</p><br/><p>Before he could say it, he died. As for why the You Family’s ancestor knew, that was because he was coincidentally there when it happened. Not only that, they weren’t stupid either, there were too many loopholes as to why the battle occurred, it’s just that most of them died in the battle.</p><br/><p>So up till now, no one knew of the dirty secret of the TongTian Palace and that it wasn’t worth worshiping at all. However, with the TongTian Palace destroyed as well as their reputation, there was no need to purposefully mention the truth behind the ancient battle.</p><br/><p>This TongTian Emperor spring up tens of thousands of years after the ancient battle. Many of those in the TongTian Palace had died in the ancient battle as well, not only that, very few knew of the scheme in the first place, thus the TongTian Emperor actually knew very little. But, he just needed to know that the first TongTian Emperor was the Almighty and that was enough.</p><br/><p>There was only one thought in You XiaoMo’s mind as he heard the story. There was nothing ‘absolute’ in this world, even someone as strong as the first TongTian Emperor stilled died, but that was completely his fault.</p><br/><p>He could have just comfortably stayed as the Almighty, but he just had to unify everyone, clearly unnecessary. And what happened? He successfully forced the true powerhouse out and died. Greed and power was truly death-inducing.</p><br/><p>“Then what are we doing about this magic pill?” You XiaoMo asked as he looked at the dark red magic pill silently resting on his palm.</p><br/><p>At first he thought that Ling Xiao might use it, but after some careful thinking, he thought against it. Ling Xiao already had the four bloodlines, he didn’t need to be like the TongTian Emperor and rise to the Almighty level. Not only that, this magic pill absorbed so many lives, it was sinister and this was probably an incomplete product.</p><br/><p>Without another word, Ling Xiao crushed it to dust and it flew away, taken by the wind. Clearly, Ling Xiao had no favorable impression of it either.</p><br/><p>“If they have time to make such an obscure thing, they might as well be cultivating the proper way.”</p><br/><p>Suddenly a thought flashed across You XiaoMo’s mind, “Say, do you think the first Almighty also used this method to become that level?”</p><br/><p>“Probably not.” Unexpectedly, Ling Xiao rejected his idea, “From what that middle-aged man told you, this method was probably thought of after he got together with the TongTian Emperor. The possible results are still unknown.”</p><br/><p>“Then what about you and the other person’s bet?” You XiaoMo stilled remembered the bet Ling Xiao made. Now that the TongTian Palace was destroyed, the Mage Assemblage was probably not going to be held either.</p><br/><p>Suddenly, Ling Xiao smiled, “What does it have to do with me? Since the beginning it was a one-sided bet, if something happens, it’s his problem.”</p><br/><p>You XiaoMo thought he was such a fraud.</p><br/><p>That person’s probably going to be fuming in anger. The TongTian Palace was destroyed by Ling Xiao but he had to clean up the mess.</p><br/><p>However, it was a highly welcomed situation!</p><br/><p>In the afternoon, Ling Xiao and You XiaoMo went to check up on Tian Gui. With Ling Xiao’s hint, he finally realized that Tian Gui was advancing and not unconscious.</p><br/><p>Tian Gui was a fighting maniac, very often he would advance from the experience he got from fighting. Although this time, from the life and death battle in the TongTian Palace, he suffered grave injuries, he also managed to go past the two star barrier. With a little more time, he would be at a three star level.</p><br/><p>For the past three months You XiaoMo had been back, he hadn’t received any information about his first and second-shixiong.</p><br/><p>After they knew that he was captured by the TongTian Palace, they were also very worried and repeatedly sent the Giant Roc to gather information. When they heard about Ling Xiao gathering powerhouses to invade the palace, they also wanted to help, but couldn’t leave Dong Zhou at all.</p><br/><p>From their letters, You XiaoMo learned that the situation in Dong Zhou was pretty bad.</p><br/><p>Although the ShuiXi Tribe and the WanSha Tribe combined forces to fight against the Guma Tribe, they were unable to get the upper hand as another force was secretly helping them.</p><br/><p>That force wasn’t the Vermillion Blood Clan since they couldn’t even fend for themselves, much less sent someone over to Dong Zhou.</p><br/><p>You XiaoMo however, knew of this force. From what he heard, Yan Hui and Su Lang’s Shifu was someone incredibly strong with a remarkable identity. Not only that, they had the previous holy maiden Zu Ma, who was even stronger than Xia Yin.</p><br/><p>Since you can only win a hundred percent of the time when you know your enemies, You XiaoMo later told them about this. Although their Shifu’s identity was still unknown, they could at least have a direction to search.</p><br/><p>One the second day, You XiaoMo heard that Ling Xiao was preparing to go to the Weeping Ghost Shore.</p><br/><p>Ever since he became the real young master of Tian Dao, even if he had Tian Dao’s help on most things and didn’t have to deal with them himself, it was still important to learn a bit more.</p><br/><p>You XiaoMo thought about what the Weasel Beast said and wanted to back out.</p><br/><p>“Ling Xiao, maybe you should go yourself. I just suddenly remembered that I had something else to do. For the past three months I was by your side and didn’t cultivate or refine pills.”</p><br/><p>In the past year or so, You XiaoMo was still stuck on grade four, mostly because he hadn’t been cultivating. But, he wasn’t completely without improvements either. In the year he stayed in that world, the spiritual energy was very thick, thus even if he was chased all over the place, the whole escape process could still be counted as cultivating.</p><br/><p>Without another word, Ling Xiao lifted him up by the collar and left the palace. They were just going to the Weeping Ghost Shore, it wasn’t even going to take that long. Did he think he couldn’t tell that it was all just a ruse?</p><br/><p>You XiaoMo’s head drooped low and hoped that all of the TianGou members were out.</p><br/><p>But, obviously that wasn’t going to happen.</p><br/><p>It didn’t even take half an hour before they arrived at the Weeping Ghost Shore. The reason was because in the year You XiaoMo was gone, TianGou created two teleportation circles, the ones commonly found in the Long Xiang Continent, between the Weeping Ghost Shore and their palace. It was perfect for short distance teleportation.</p><br/><p>At the Weeping Ghost Shore, ever since Hua Gu and You XiaoMo’s contracted demon beasts joined, the work was more clearly divided and everyone had a clear role to play. Everything was progressing smoothly.</p><br/><p>Since Ling Xiao told them ahead of time, by the time they arrived, most of the members were already waiting in the Smile Pavilion.</p><br/><p>Just as they walked in, everyone turned and stared at the them.</p><br/><p>As You XiaoMo was feeling guilty, his chest wasn’t puffed up as high and his eyes kept darting all over the place. Thus, he successfully saw Hua Gu who had made a transition to a classy woman (business women).</p><br/><p>When they first met, Hua Gu was an alpha lady and had the skills to back it up, however, she felt vulgar with a poor taste in clothing. Thus, even though she felt like an alpha, she never had the classy or professional feel to her.</p><br/><p>But now, Hua Gu was wearing bright, flaming red lipsticks, making her more gorgeous. A single belt formed her slender waist, emphasizing her chest and she also had a whip attached to her hip.</p><br/><p>Seeing that, You XiaoMo suddenly pictured a classy woman, swinging around a whip and laughing as she whipped a bunch of men. He shocked himself with the image.</p><br/><p>“Young Master.” Just as he was thinking, Hua Gu came up.</p><br/><p>Finally, You XiaoMo regained his senses and the moment he looked up, he saw Ling Xiao making this, half-smiling-but-not-really-face. He subconsciously rubbed his nose, feeling guilty.</p><br/><p>Hua Gu suddenly turned towards him and finally said after some hesitation, “Madame.”</p><br/><p>As if lightning struck You XiaoMo’s head, he was once again shocked by her. ‘Madame or Wife’ was Ling Xiao’s exclusively, when it was from him, there was always a feeling of softness and flirty-ness to it. At first he was embarrassed but over time he got used to it. But suddenly hearing that from a woman, he felt a peculiar feeling, as if saying he was a woman as well.</p><br/>\n</div>"}