{"title": "Chapter 649 - Collaboration", "id": 649, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-649-collaboration", "volume_title": "Volume 7", "body": "<h1>Chapter 649 - Collaboration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 649: Collaboration</strong></h2><br/><p>Translated by Yan of Exiled Rebels Scanlations</p><br/><p>You XiaoMo and Ling Xiao left Guma Tribe’s town and hurried to ShuiXi Tribe. As a result, they unexpectedly ran into Xia Yin, who had already betrayed the Guma Tribe.</p><br/><p>When Xia Yin saw them, she remembered shifting the blame onto them back then, as well as what happened in the cave city underground. If it weren’t for Ling Xiao not wanting to get involved with them, they most likely would have become enemies by now.</p><br/><p>MoQi XiYuan also wiped away a handful of cold sweat on the spot.</p><br/><p>Ever since he found out that You XiaoMo and Ling Xiao, who he had met at the bottom of the ocean, were friends with his son, he had worried for quite a while.</p><br/><p>After all, it couldn’t be said that there were no grudges between them; it’s only that the grudges weren’t very big. If Ling Xiao and You XiaoMo wanted to get revenge, they could absolutely exploit their relationship with his young son.</p><br/><p>However, after knowing their purpose in coming, MoQi XiYuan was neither startled nor happy. It seemed like they were preparing to abandon their former hatred and stop arguing about bygone matters. If things were like this, that would be extremely great, except…</p><br/><p>“Have the two of you confirmed that the powerhouse collaborating with the Guma Tribe is the Black Spider?”</p><br/><p>MoQi XiYuan had also heard of Xi Jing’s current situation. The Black Spider was extremely powerful, with all sorts of treacherous and murderous tricks. Before, they were always hidden in the darkness, but now that they had surfaced, nobody had been able to get a handle on them yet.</p><br/><p>“This person, Zu Ma, Chief MoQi should have heard of her before, right?” Ling Xiao said lightly.</p><br/><p>MoQi XiYuan suddenly frowned. “Of course I’ve heard of her before. She’s the former holy maiden in the Guma Tribe. She’s exceptionally strong, but she suddenly disappeared several thousand years ago for some unknown reason. Nobody knows where she went.”</p><br/><p>Ling Xiao’s fingers knocked against the table. He tapped lightly twice before saying, one word at a time, “She’s currently in the Black Spider right now. Furthermore, she’s also the Black Spider’s leader’s confidant.”</p><br/><p>MoQi XiYuan was startled. The magnificent holy maiden had actually joined the Black Spider?</p><br/><p>Regardless of whether that old fart Mo Ma knew about this or not, this was harmful for them. Zu Ma’s power to rally supporters was greater than Xia Yin’s, and the rumors said that she seemed to have broken into grade six. Even though they didn’t know whether it was true or not, but it was better to be safe than sorry.</p><br/><p>After quickly calculating, MoQi XiYuan instantly made a decision. He looked at Ling Xiao, who wore an unfathomable expression. “I imagine that the two of you, who rushed from distant lands to Dong Zhou, must not have come here purely to collaborate with us, right? What requirements do you have?”</p><br/><p>“Chief MoQi is indeed a frank and straightforward person. If I may speak bluntly, I heard that ShuiXi Tribe has a Five Blessing Spirit Eye. I want to borrow it for a while, I don’t know if that is possible or not?” Ling Xiao curled the corner of his lips and got straight to the point.</p><br/><p>MoQi XiYuan’s expression changed slightly. He hadn’t expected them to come because of the Five Blessing Spirit Eye.</p><br/><p>Ever since the ancient war, many of Dong Zhou’s Five Blessing Spirit Eyes had been destroyed. There weren’t many that had lasted until now, and there were some that had even been consumed completely.</p><br/><p>It wasn’t as if outsiders hadn’t considered the idea of the Five Blessing Spirit Eye. Who knew how many spies had been sent over over the past many years, but they had never succeeded. Outsiders were unable to imagine the degree of secrecy the three large tribes had for the Five Blessing Spirit Eye.</p><br/><p>Ling Xiao saw that he looked troubled, and his eyes narrowed slightly. “Chief MoQi is unwilling?”</p><br/><p>MoQi XiYuan shook his head and smiled bitterly. “Since Your Excellency actually mentioned the Five Blessing Spirit Eye, I expect that you must have already investigated it beforehand. To tell the truth, the ShuiXi Tribe does indeed have a Five Blessing Spirit Eye, but this Five Blessing Spirit Eye is nearly dried up. I’m afraid it cannot satisfy your needs.”</p><br/><p>“What do you mean?” Ling Xiao asked without batting an eyelash.</p><br/><p>MoQi XiYuan explained, “Even though the Five Blessing Spirit Eye that we are using right now wasn’t passed down from the ancient times, when we discovered it back then it was only a small, lower grade Spirit Eye. Because the tribe’s required amounts have increased in recent years, now there isn’t much left.”</p><br/><p>Ling Xiao said indifferently, “Chief MoQi, may you take us there so we can take a look ourselves?”</p><br/><p>MoQi XiYuan hesitated for a second before agreeing. He was telling the truth. Indeed, the less people that knew about the Five Blessing Spirit Eye, the better, but the value of a nearly dried-up Five Blessing Spirit Eye wasn’t very high. Even if they knew where it was, it didn’t matter much.</p><br/><p>MoQi XiYuan handed this trivial task to his younger son MoQi Rong. MoQi Rong was a mage, so he often went to the Five Blessing Spirit Eye when he was young. Furthermore, he could use this opportunity to deepen their relationship. Of course, right now he still didn’t know about Fang ChenLe and Fu ZiLin’s relationship with You XiaoMo.</p><br/><p>MoQi Rong was very happy when he saw You XiaoMo. After returning to the tribe, he was in secluded cultivation the entire time, and he wasn’t as free as he had been at XiaoYao Institution. He also used to have a group of friends by his side at that time, and the one who left the deepest impression was Yan Hui. It was only too bad that they had different interests.</p><br/><p>The location of the Five Blessing Spirit Eye was quite hidden. Even though it was almost dried-up, the tribe had still dispatched many guards to protect it, and it had set up layers and layers of traps. If someone wanted to get all the way in, the entrance was extremely hidden, and the inside was extremely complicated, so if they didn’t have an acquaintance to lead the way, it was very easy to get lost.</p><br/><p>“Be careful, there are quite a few traps in here. If you accidentally touch one, the location of the secret pathway will change, and we will be immediately sent to another place. Perhaps it’s still in the secret pathway, or perhaps we’ll be transported out…” MoQi Rong explained as he walked.</p><br/><p>You XiaoMo made a sound of admiration. This was an enormous project; the entire secret passageway was an enormous transport circle. It was an ingenious design, and it was a maze on top of that. With two layers of safeguards, people unfamiliar with the situation would definitely fall into the trap.</p><br/><p>After a while, they finally arrived at the Five Blessing Spirit Eye.</p><br/><p>It was a black cave, and they could occasionally see a flash of spiritual light flash across. A gust of extremely rich spiritual energy emitted from the cave, but there were four experts guarding the entrance who were all at the Divine Realm level.</p><br/><p>MoQi Rong showed the token that his dad gave him, and the four guards instantly let them pass.</p><br/><p>After the three of them walked inside, You XiaoMo immediately saw that there was something glowing on the floor of the cave. It was about two meters long, and five different rainbow-colored elements – Gold, Wood, Water, Fire, and Earth – tangled above the light. Rainbow colored spiritual energy continuously leaked outside in spurts.</p><br/><p>“This is the Five Blessing Spirit Eye. Since it’s about to dry up, that’s why there’s sometimes spiritual energy and sometimes not. The light is also pretty dim. If this was before, the rainbow-colored spiritual energy would be several times stronger than right now.” MoQi Rong explained.</p><br/><p>You XiaoMo nodded his head, not really understanding. “If it dries up, will it be useless? How many days longer do you think you can use what’s remaining?”</p><br/><p>“If it dries up, then we don’t need to send people to guard it anymore.” MoQi Rong nodded. “Based on my estimations, this place can only be used for another five days at the most. Once the five elements covering the top disappears, it can’t be used anymore.”</p><br/><p>“Only five days!” You XiaoMo was a little disappointed. He didn’t know whether he could break into grade four in five days.</p><br/><p>MoQi Rong said apologetically, “Fellow Brother You, many apologies for disappointing you.” Even though he didn’t know the exact situation, he could see that You XiaoMo urgently wanted to increase his power level.</p><br/><p>You XiaoMo waved his hand and told him not to overthink things. It was only their fault for coming at a bad time.</p><br/><p>At that moment, Ling Xiao suddenly said, “Let’s go back and tell your dad to give this Five Blessing Spirit Eye to us. It will be our requirement for exchanging. We will help ShuiXi Tribe deal with Guma Tribe.”</p><br/><p>You XiaoMo and MoQi Rong looked at him in surprise at the same time.</p><br/><p>This kind of deal wasn’t worth it at all. You didn’t know whether there would be any results in five days. ShuiXi Tribe would simply make a huge profit, and You XiaoMo didn’t believe that Ling Xiao didn’t know. However, he also knew that Ling Xiao wasn’t someone who would lose out. It was good enough if he didn’t make someone else at a loss. If he said this, he definitely had some other plans in mind.</p><br/><p>Finally, MoQi Rong still informed his dad.</p><br/><p>MoQi XiYuan also thought it was strange, but he couldn’t think of what Ling Xiao’s goal would be. It was impossible that there was something MoQi XiYuan didn’t know about the Five Blessing Spirit Eye.</p><br/><p>ShuiXi Tribe had already possessed the Five Blessing Spirit Eye for close to ten thousand years. In that time, they had observed and studied it who knew how many times. If there was some secret, they had long since discovered it.</p><br/><p>However, after his younger son told him about You XiaoMo’s relationship with Fu ZiLin and Fang ChenLe, MoQi XiYuan guessed that Ling Xiao was most likely doing this because of that relationship. If this was the case, their strange actions would have an explanation. Since he couldn’t think of a more reasonable explanation, MoQi XiYuan still agreed to this exchange in the end. Disregarding their goal, this matter would only be advantageous to ShuiXi Tribe, not disadvantageous. In addition, he didn’t need to worry about them betraying them at the last moment.</p><br/><p>After that, according to Ling Xiao’s request, MoQi XiYuan called the members guarding the Five Blessing Spirit Eye back in order to let them enter the secret pathway freely. He also told them about the layout of the secret pathways, but only one kind.</p><br/><p>The secret pathways had thousands of shapes, but as long as they didn’t touch any traps, nothing would happen. Since they still planned on using this secret pathway in the future, he could only tell them about one kind.</p><br/><p>After finishing up everything, You XiaoMo didn’t immediately go into the Five Blessing Spirit Eye to cultivate. He had another purpose for coming to Dong Zhou: to see Da-shixiong, who he hadn’t seen for a long time. Uncle should have already notified them by now.</p><br/><p>Sure enough, after Fang ChenLe knew that his Xiao-shidi had already arrived, he was extremely excited.</p><br/><p>He had always believed that several more years would pass before he would be able to see the other. He and Fu ZiLin had already been in TongTian Continent for many years, and they had come even earlier than You XiaoMo and Ling Xiao. They were already very clear about the situation there.</p><br/><p>During these years, he had often heard about them, and his emotions were just like riding a rollercoaster, rising and falling greatly. It really made him extremely afraid.</p><br/><p>Just as expected, even after going somewhere else, his xiao-shidi still didn’t let someone stop worrying.</p><br/>\n</div>"}