{"title": "Chapter 655 - Five Toned Spiritual Energy", "id": 655, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-655-five-toned-spiritual-energy", "volume_title": "Volume 7", "body": "<h1>Chapter 655 - Five Toned Spiritual Energy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 655: Five Toned Spiritual Energy</strong></h2><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>While everyone on the battlefield sweated over what Ling Xiao said, someone silently snuck into the ShuiXi Tribe.</p><br/><p>As You XiaoMo said, the ShuiXi Tribe had sent all their strongest out to meet the enemy. Those that were left to guard the tribe weren’t that powerful, apart from the still well-protected Ancestral Shrine.</p><br/><p>However, it seemed that the black robed person’s target was the Ancestral Shrine.</p><br/><p>In reality, that person wasn’t weak at all. No one noticed when he snuck into the shrine, not until he triggered the first trap in the Ancestral Shrine and panicked.</p><br/><p>The twenty to thirty guards at the Ancestral Shrine immediately went on guard, erupting with killing intent like soldiers. The elder that was overseeing things calmly took command, sending them to capture the black robed person. He originally wanted to send someone to inform MoQi XiYuan, but, considering the ongoing battle, he was worried that it might distract the other, so he had someone keep this hushed up.</p><br/><p>You XiaoMo didn’t know of these things. Seeing his target getting closer and closer, he grew more and more excited, his soul power flowing through him wildly. He didn’t feel any weariness, but his speed had doubled.</p><br/><p>The Metal Swallowing Beast’s sped up, claws digging as if unwilling to be beaten. In the end, he accidentally threw some mud at You XiaoMo’s face, causing him to eat mud. He threw a fist at the Metal Swallowing Beast’s head.</p><br/><p>With a bump on his head, the Metal Swallowing Beast whimpered a bit before starting again.</p><br/><p>XiaoPing, who was tasked with watching over the barrier, was bored on his own and ran over to dig with them halfway through.</p><br/><p>You XiaoMo originally wanted to send him out to keep watch again, but he refused, clinging onto You XiaoMo’s clothes and refusing to let go. So You XiaoMo had no choice but to let him be. Luckily, there were two layers of protection outside. Even if someone managed to get in, there was still Ling Xiao’s barrier.</p><br/><p>However, he hadn’t expected an intruder so soon.</p><br/><p>Just as they were about to reach the target, someone suddenly disturbed the barrier.</p><br/><p>Though they didn’t make much of a commotion, You XiaoMo still noticed them. He hesitated for a moment before sending XiaoPing alone to check. If it was a friend, then things would be easy to deal with, if not…</p><br/><p>It wasn’t long before XiaoPing returned and, as expected, it wasn’t a friend. The other wore dark, practical clothes with even their face wrapped up, exposing only their eyes. Doubtlessly, they were most likely after the Five Blessing Spirit Eye.</p><br/><p>You XiaoMo decided to ignore them for now. The barrier was there, after all, and even if that person was powerful enough to break through Ling Xiao’s barrier, they wouldn’t be able to to do it immediately. If they weren’t, then they could just leave them there and deal with them after they managed to dig up that transcendent grade spirit eye.</p><br/><p>Thus he and the two contract beasts continued to dig.</p><br/><p>Soon, it was close, just a little more time…</p><br/><p>You XiaoMo thought only about speed and time, his soul power working frantically and his speed reaching a limit he didn’t even know of. His once still sea of consciousness also began to move, at first slowly, then faster and faster.</p><br/><p>He didn’t notice the Five Blessing Spirit Eye flowing through the tunnel they were digging behind him was slowly sinking into his body. You XiaoMo only felt like he had infinite energy and his excitement rose.</p><br/><p>At the same time, the black robed person who was worrying over how to break through the barrier suddenly looked over, feeling something, and widened his eyes in surprise.</p><br/><p>The Five Blessing Spirit Eye had begun to change, the five colored elements flashing faster and faster, releasing five colored spiritual energy that drifted further inside, clearly with a target in mind.</p><br/><p>He had heard that someone was cultivating in here, but hadn’t expected it to be true. Since the interior of the cave was vast, it was impossible to see what was happening inside from the entrance, so the black robed person could only tell that someone was inside, but he couldn’t eliminate other possibilities.</p><br/><p>He wanted to inside to check the situation out, but the barrier was in his way. He attempted to attack the barrier, but realized that this barrier was extremely strong. The one who set it must be extremely powerful. With his current strength, it would take quite a while before he could break through.</p><br/><p>The black robed person glanced inside again before turning and leaving with disappointment.</p><br/><p>You XiaoMo had never felt so free, like a newborn being baptized. He had no worries or frustrations, like he was in his mother’s arms.</p><br/><p>The Metal Swallowing Beast and XiaoPing’s movements started to slow subconsciously. Two small pairs of eyes stared at their master. They saw wisps of five colored spiritual energy continuously seeping into their master’s back. This spiritual energy had a comfortable aroma which made them feel rather drowsy.</p><br/><p>It didn’t stop until there was a boom, like an explosion erupting with You XiaoMo at its center. The shockwaves slammed into the walls, causing mud to fall off and the tunnel to shake.</p><br/><p>You XiaoMo’s body swayed a little, absorbing the five colored spiritual energy even faster just like… like he was about to advance…</p><br/><p>The two demon beasts saw the worry in each others’ eyes. He was going to advance at an important time like this? This was the ShuiXi Tribe’s territory. If they were found out to have dug a tunnel here, then it was over!</p><br/><p>The two demon beasts were practically running in circles with panic. Their master had already sat down to advance.</p><br/><p>Advancement couldn’t be interrupted, and this time it came without warning. No one had been prepared for it, and You XiaoMo himself wasn’t even sure what happened.</p><br/><p>The good thing was that the low grade spirit eye could help supply the spiritual energy that You XiaoMo needed. They only hoped that others wouldn’t notice.</p><br/><p>However, the two little demon beasts needn’t worry. Usually, You XiaoMo would almost certainly be found if he advanced here, but today was different. Someone had snuck into the tribe and attacked the shrine. The tribesmen were busy stopping these people and didn’t have the energy to focus on other things.</p><br/><p>Due to You XiaoMo’s advancement, they had wasted quite a lot of time. He woke up three hours later and after figuring out the time, he was shocked. Not bothering to check his cultivation base, he hurriedly ran to the end of the tunnel and found the two demon beasts doing their best to dig.</p><br/><p>“I was scared for a moment!!” You XiaoMo let out a huge sigh of relief. Thankfully the Metal Swallowing Beast and XiaoPing were smart. Though they hadn’t made that much progress in three hours, it was pretty good.</p><br/><p>“Leave it to me, you guys go and rest.” You XiaoMo placed them to the side. The two demon beasts were dirty all over, especially the Metal Swallowing Beast. His golden fur looked like wet mud.</p><br/><p>This time, You XiaoMo noticed how much easier it was to use his soul power, and the mud that blocked his way was no longer like tofu, but foam. If it wasn’t for that others might notice them, You XiaoMo would do something bigger.</p><br/><p>Then, there was a ‘crack’.</p><br/><p>You XiaoMo retracted his hands with a pained expression and found that the nail on his middle finger had cracked open, exposing a little bit of flesh. It hurt so much, “Ooowww….”</p><br/><p>He cleared away the almost yellow colored mud and found a large chunk of metal. The metal was dark red in color, very hard. He struck it with his spade and only managed to make a five centimeter deep mark.</p><br/><p>“XiaoJin, go!” You XiaoMo threw the spade aside and immediately sent the Metal Swallowing Beast up.</p><br/><p>The Metal Swallowing Beast lunged forth with a howl. He had smelled this snack ages ago. The quality of the metal was high; it was exactly what he liked to eat most.</p><br/><p>The metal was about three meters wide, and it didn’t take long for the Metal Swallowing Beast to devour most of it. He wanted to eat more but You XiaoMo grabbed him.</p><br/><p>“Don’t eat too much. If there’s more later on, you might be too full to eat it.”</p><br/><p>Reality proved him right. The further they got, the better the quality of the metal. In the end, it got to the point where even You XiaoMo couldn’t do anything to affect it. He had never seen such strong metal before. The Metal Swallowing Beast lunged forwards with excitement, but was caught by You XiaoMo halfway.</p><br/><p>The Metal Swallowing Beast pouted with displeasure.</p><br/><p>You XiaoMo comforted him saying, “Patience. This is great metal. We can dig up some and store it in the dimension. You can eat whatever is left.”</p><br/><p>Thinking that his master was storing food for him, the Metal Swallowing Beast became even more excited. Contract beast and master dug up a large portion of this high quality metal. Two hours later, there was nothing left, only a sticky mud.You XiaoMo noticed that this mud held a dense water element and then fire element, as he found when it almost burned his hand off. Then, there was some nature element, life force seeping from the mud. As for earth element, it was everywhere.</p><br/><p>You XiaoMo excitedly realized that the transcendent grade spirit eye wasn’t far from here.</p><br/><p>The five blessing spirit eye wasn’t comprised of the five elements, but all five elements slowly seeped out from it, into the mud around it. As time went on, the elements settled in the mud.</p><br/><p>After they finished digging through the mud, a layer of ice appeared in front of You XiaoMo, the chill sinking into his skin. You XiaoMo shuddered. Then, when he broke through this final barrier, his world flashed white.</p><br/><p>It was a world of ice, but it wasn’t a large area, a mere room of around one hundred and twenty squared meters or so. He immediately saw the transcendent grade spirit eye in the middle. It was much smaller than the low grade spirit eye, only a meter wide.</p><br/><p>Dense five colored spiritual energy wafted from the spirit eye and the entire ice room was filled with this spiritual energy. Around ten puddles of five colored liquid pooled on the ground, multi colored light flowing through. You XiaoMo, having just advanced and not yet had the time to stabilize his cultivation base, felt nourished.</p><br/><p>So this was a transcendent grade five blessing spirit eye!</p><br/>\n</div>"}