{"title": "Chapter 663 - Registering for the Assemblage", "id": 663, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-663-registering-for-the-assemblage", "volume_title": "Volume 7", "body": "<h1>Chapter 663 - Registering for the Assemblage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 663: Registering for the Assemblage</strong></h2><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>During this time, You XiaoMo and Ling Xiao were keeping an eye on the situation in the South Continent, too.</p><br/><p>After Zuo Yan ascended to Sacred level, the Cang Alliance maintained an advantage in their battle against the Vermillion Blood Clan. Not even You ZhenTian’s wife, Lady Yin’s family could tip the scales.</p><br/><p>The True Dragon Clan was in You XiaoMo’s debt, and You XiaoMo was friends with the Cang Alliance, so when the Silver Dragon Clan asked for aid, the True Dragon Clan didn’t decide to help the Vermillion Blood Clan.</p><br/><p>Lady Yin was You ZhenTian’s wife, so it was understandable that the Silver Dragon Clan would lend a helping hand, but the True Dragon Clan had no reason to, unless they wanted to make enemies of the Cang Alliance for the Silver Dragon Clan. However, that was clearly impossible. The Cang Alliance was powerful and influential, their information network spanned across the entire TongTian Continent. Offending them meant nothing good.</p><br/><p>The True Dragon Clan refused to get involved, so the Vermillion Blood Clan and Silver Dragon Clan could only depend on themselves.</p><br/><p>You ZhenTian never gave up on the idea of adding another Sacred level practitioner to their ranks because if it weren’t for the Silver Dragon Clan’s help, then they would have to bow their heads to the Cang Alliance, unless, of course, they could kill Zuo Yan.</p><br/><p>However, that was clearly impossible. If You ZhenTian personally engaged, then so would Fu CangQiong. In the end, the situation would become like a twisted rope, strung tight and liable to break at any time. It would cost both sides a lot of manpower and money.</p><br/><p>In the end, under the Mage Association and Beast Transfiguration Guild’s mediation, the two sides agreed to a ceasefire. At least, they would wait until the Mage Assemblage was over.</p><br/><p>Thus, the TongTian Continent became peaceful once more.</p><br/><p>Everyone took this chance to rest and relax peacefully.</p><br/><p>You XiaoMo was very content with his life at the Ghost Tomb Mountain Range as well. After the Black Spider stopped their bullshit, Ling Xiao no longer needed to run over to the Weeping Ghost Shore all the time to discuss plans with Tian Dao. They knew that Lin ShaoYi was under house arrest in the QiLin Clan and no one knew when he was to be released.</p><br/><p>In the following months, You XiaoMo occasionally refined pills or went into his dimension to cultivate. He didn’t keep the transcendent grade Five Blessing Spirit Eye a secret either.</p><br/><p>This was a treasure, and just the two of them taking it for themselves wasn’t very realistic. For one, this transcendent grade spirit eye had been forming for countless years, and they had only just dug it up now. One couldn’t judge it based on it’s size. One meter cubed didn’t seem like much, but a low grade spirit eye could be used for millions of years, so despite how little of it there was, this transcendent grade spirit eye would at least last for a few thousand years.</p><br/><p>The transcendent grade spirit eye wasn’t a secret anymore anyways.</p><br/><p>Naturally, it was because of Lin ShaoYi. Knowing that they had the transcendent grade spirit eye, he wouldn’t let them live comfortably with it, and he knew that it was the Tian Gou that had been the source of the leaked information last time.</p><br/><p>An eye for an eye, a tooth for a tooth!</p><br/><p>Thus, he leaked the existence of the transcendent grade spirit eye and hinted that they had gotten it from DongZhou.</p><br/><p>There was no need for specifics. With MoQi XiYuan’s intellect, he could clearly tie this to the strange happenings in the Tribe and the two black robed people that had fled without a trace.</p><br/><p>No matter what, this definitely would plant a seed of suspicion in MoQi XiYuan’s heart. Only time would tell if this would lead to anything.</p><br/><p>You XiaoMo wasn’t too worried about it.</p><br/><p>His two shixiong were here with him now, so even if MoQi XiYuan really had suspicions about them, he wouldn’t run all the way to the Ghost Tomb Mountain Range just to question them.</p><br/><p>Plus, the ShuiXi Tribe had sustained heavy casualties during the war in DongZhou. They wouldn’t be able to recover properly so quickly, so You XiaoMo didn’t have to worry about the ShuiXi Tribe joining arms with others and coming after them for another hundred or so years yet.</p><br/><p>Since the transcendent spirit eye’s existence had been leaked already, You XiaoMo decided to take it out.</p><br/><p>His dimension was still a secret. Though several people already knew about it, they were trustworthy. Either way, the less people knew, the better. Even those he trusted might let something leak some day.</p><br/><p>After the Five Blessing Spirit Eye was released, You XiaoMo’s contract beasts were the first to benefit.</p><br/><p>With a mild-tempered master, SheQiu and company knew that they didn’t need to care about courtesy. They didn’t have any missions right now anyways, so they all ran over.</p><br/><p>The only ones who were courteous about it were the Giant Roc, the Weasel Beast and LanQiu, especially LanQiu. He probably wanted to have his brothers come and cultivate as well, so he was very well-behaved.</p><br/><p>You XiaoMo had predicted this. He told LanQiu that he’d let them cultivate near the transcendent grade spirit eye, but they had to join Tian Gou. This didn’t mean that they would be chained down, because apart from missions at crucial times, Tian Gou’s members generally did whatever they wanted.</p><br/><p>The next day, LanQiu came back with their reply.</p><br/><p>For their brother Wolf of Greed, of whom all that remained was a life crystal, if they could use the transcendent grade spirit eye to nurture him, then that could only bring them good. Plus, they were in You XiaoMo’s debt, so they were all willing to join the Tian Gou.</p><br/><p>Just like that, Tian Gou’s original thirteen members, including Lin Gu, became thirty something, and the weakest of them was only a level eleven one star.</p><br/><p>Time flew.</p><br/><p>The much anticipated Mage Assemblage finally arrived.</p><br/><p>In these few months, their strength had improved. With the Five Blessing Spirit Eye, which was practically a cheat code, it would be harder to not improve. However, the spirit eye had been overused, and the five colored liquid was rapidly depleting.</p><br/><p>During this time, the Black Spider had sent people into the Ghost Tomb Mountain Range to gather info on the transcendent grade spirit eye, but they couldn’t find anyone who was willing to say anything. The Ghost Tomb Mountain Range had pretty much become the Tian Gou’s territory, and the Weasel Beast had eyes and ears everywhere. They would know as soon as an unfamiliar face appeared, so all of Black Spider’s people either returned empty-handed or were made to stay in the Ghost Tomb Mountain Range for good.</p><br/><p>But if it wasn’t for the QiLin Clan putting Lin ShaoYi under house arrest, You XiaoMo and company might have to face Lin ShaoYi personally.</p><br/><p>For his plan to be executed smoothly, Lin ShaoYi had to get that Five Blessing Spirit Eye. Unfortunately for him, things happened the way they did. Not even Ling Xiao had expected this, because he was already waiting for Lin ShaoYi to come.</p><br/><p>The Mage Assemblage was being hosted in ZhongTian, but not at the XiaoYao Institution, but in the TongTian Palace.</p><br/><p>This wasn’t any new news. After the TongTian Palace was destroyed by Ling Xiao and company, the TongTian Emperor had vanished along with his minions, abandoning the TongTian Palace.</p><br/><p>The XiaoYao Institution cleared away the ruins of the TongTian Palace and then built a simple, wide and open structure. Since they didn’t know exactly how many mages would attend the Mage Assemblage, they had cleared away most of the remaining structures in the TongTian Palace and built a massive plaza.</p><br/><p>When You XiaoMo and Ling Xiao arrived, they were almost blinded by the sheer number of people crowded into the plaza.</p><br/><p>The chaos in the TongTian Continent had only persisted for a couple years, but the consequences were widespread. You XiaoMo had originally believed that there wouldn’t be many people attending the Mage Assemblage.</p><br/><p>However, he had forgotten one detail.</p><br/><p>The Mage Assemblage hosted by the TongTian Palace only allowed rainbow level mages to attend, but once the XiaoYao Institution took over hosting, they had lowered the requirements. That meant that level ten mages could attend as well.</p><br/><p>In addition, You XiaoMo had underestimated how tempting the Grade Water was to mages. He didn’t know this, but the grade water was better than the prize that the TongTian Palace would award to the winner, because most people didn’t like those illusory and empty rewards, they preferred practical and useful prizes.</p><br/><p>“Amazing!” You XiaoMo exclaimed. This was even more of a spectacular sight than the student recruitment at XiaoYao Institution.</p><br/><p>Ling Xiao patted his head. “Don’t underestimate the allure of grade water. Plus, this is the XiaoYao Institution’s first Mage Assemblage. There aren’t very strict requirements for the attending mages, so many of the mages here are veterans. They’re all after the grade water. You’ll have quite the battle to fight.”</p><br/><p>“That’s right, Zu Ma isn’t my only opponent.” You XiaoMo could sense many powerful presences in the plaza. Probably those veterans. He had thought there weren’t many grade five and six mages, but now it seemed that a lot of people were just hiding or otherwise keeping a low profile.</p><br/><p>“Go and register first.”</p><br/><p>“Right!”</p><br/><p>Today wasn’t the first day of the Mage Assemblage. Registration came first, and it was happening right here in the plaza. If it was happening in ZhongXin City, then the streets would probably be totally clogged up by now.</p><br/><p>Three days after registration, the Mage Assemblage would start.</p><br/><p>You XiaoMo didn’t inform Qiao WuXing and company, but he knew that they would definitely sign up and attend. They might not be able to beat those veterans, but the experience would be worth it.</p><br/><p>Since there were so many people, they waited for a full hour. After registering, the two followed the crowd, leaving the plaza and heading for ZhongXin City.</p><br/><p>The Mage Assemblage was great for ZhongXin City’s economic prosperity. By now, ZhongXin City’s inns and hotels and whatnot were practically filled to the brim.</p><br/><p>You XiaoMo and Ling Xiao were rather late to the party, and most inns didn’t have any rooms left. They wandered on the streets for around two hours, and it wasn’t until the sun had almost set that they found a free room in a large hotel on one of the most prosperous streets, the WuShuang Hotel.</p><br/><p>It was only after asking that they found out that the WuShuang Hotel had requirements to meet if one wanted to rent a room. Only grade three and above mages could live here.</p><br/><p>They had pulled a steady level of aggro with that!</p><br/>\n</div>"}