{"title": "Chapter 662 - Rumors", "id": 662, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-662-rumors", "volume_title": "Volume 7", "body": "<h1>Chapter 662 - Rumors</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 662: Rumors</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>In the next few months, You XiaoMo was practically living a life where he just went to and fro from two places.</p><br/><p>He spent half a month to consolidate his Grade Five realm, so that he could easily break through to Grade Six later. One could not be too impatient for this sort of matter like cultivation. Making incremental and steady progress was the key.</p><br/><p>You XiaoMo had asked someone to copy the information from the jade drives he had gotten from the ShuiXi Tribe into books. He used a lot of jade drives as he thought there would not be many opportunities at that time. Each of the jade drives recorded a large volume of information and included information before the ancient war.</p><br/><p>Fang ChenLe had heard from Fu ZiLin that You XiaoMo had planned a study for himself and needed many books to fill the bookshelves, so he had recorded a lot of information into the jade drive although he had only stayed on the second level for a short while.</p><br/><p>As some of the details could not be revealed, You XiaoMo specifically went to Tian Dao and asked him to introduce an acquaintance to him.</p><br/><p>Tian Dao actually knew of a suitable a person. He was obsessed with collecting books, had a huge library himself and would not easily show them to outsiders. However, he had a requirement for You XiaoMo to view his books.</p><br/><p>He could let You XiaoMo make a copy of the books for free, but You XiaoMo had to give him a copy of the contents in the jade drive. Apparently, it was because some of the contents inside were not available in his library.</p><br/><p>You XiaoMo gladly agreed as long as it was not spread out. He gave Tian Dao two jars of high quality spirit wine that he had brewed in thanks. This spirit wine was brewed with spiritual water and its preciousness could not be measured by spirit gems.</p><br/><p>You XiaoMo had tasted it and found that the spiritual wine brewed with spiritual water had an additional heaven-defying effect than that brewed without spiritual water – that was, nourishment and repair of the soul.</p><br/><p>The soul was fundamental whether one was a mage or a practitioner.</p><br/><p>The effect was later known by Tian Hen. He had injured his foundation in the battle with the TongTian Palace. The wound to his soul could not be healed immediately even though his soul escaped and he had a new body, so he thickened his face and asked for a bottle from You XiaoMo.</p><br/><p>As a result, the other members of TianGou came to know about this and each and everyone of them ran over to ask him for wine.</p><br/><p>You XiaoMo was very thankful that they went to the TongTian Palace to rescue him, but he could not give them one jar each as there were too many people. This was because he did not dare to casually waste spiritual water anymore ever since one third of his spiritual water lake had been absorbed by Ling Xiao.</p><br/><p>The remainder of the spiritual water still had to be used to water the magic herbs. So he was even still a little worried that he could not make ends meet.</p><br/><p>However, he had discovered by accident that the spiritual water produced daily was only half of the amount that was produced in the past for some unknown reason.</p><br/><p>You XiaoMo suspected that it was probably related to the Peach Blossom Ruins. He had hidden in his dimension to escape from You ZhenTian on that day and was attacked by him, resulting in a crack in his dimension. Later, he thought that it was all right since the crack disappeared and had thus ignored it.</p><br/><p>The spiritual water would run out of water one day if this trend continued. When came a time that he could only live on a few drops of spiritual water every day, that would definitely not be enough!</p><br/><p>You XiaoMo worried until he grew white hairs in order to solve this problem, but there was no solution at present. Therefore, he could only minimize the use of spiritual water and was not ready to brew spirit wine again until he found a solution.</p><br/><p>……</p><br/><p>Tian Dao moved very quickly. He let people secretly spread the news about the Black Spider in one short month. This matter itself was a bombshell that did not need to be embellished further by others as there would be people spreading it out due to how shocking it was.</p><br/><p>Soon, even the Four Ancient Beast Clans knew about this news.</p><br/><p>The first to react was the Qilin Clan. In the hearts of the Qilin Clan members, Lin ShaoYi was to be the next successor of the Qilin Clan. How could such an outstanding person with a bright future be the leader of the Black Spider?</p><br/><p>Many people already knew that the culprit for the disappearance and murder of the descendants of the Four Ancient Beast Clan was actually the Black Spider. Tian Dao had also ordered this news to be spread out.</p><br/><p>The way of Heaven was fair, and the guilty would not escape.</p><br/><p>After a thorough investigation, Tian Dao finally found some traces of Ji YunLang and determined that the disappearance of the Demon Phoenix Clan’s Ji YunLang was related to the Black Spider. Funnily enough, many knew that You XiaoMo and Ling Xiao had some enmity with Ji YunLang. Tian Dao had assigned people pay attention to Ji YunLang even though Ling Xiao was not the true master of the TianGou at that time. If not for this, it was still unknown when the truth could be revealed.</p><br/><p>The Demon Phoenix Clan immediately pointed their guns at the Black Spider as soon as the news came out. The culprit of the disappearances was apparently the same person, so the other three clans did not need to investigate any more.</p><br/><p>Since the Black Spider was the real murderer of a descendant of the Qilin Clan, why would Lin ShaoYi harm his own people if he was the leader of the Black Spider? Furthermore, what good would his actions bring to him if he did that?</p><br/><p>All kinds of doubts came out one after another. Everyone put their attention on the Qilin Clan and Lin ShaoYi’s every move was monitored. Zu Ma dared not meet him any longer and could only contact him secretly.</p><br/><p>Following the war in Dong Zhou, the Black Spider suffered tremendous losses once again.</p><br/><p>The Demon Phoenix Clan sent people to exterminate a Black Spider stronghold and slaughtered seventy-eight Level Eleven experts and one Level Twelve expert.</p><br/><p>Lin Shaoyi had not yet made a statement before the Qilin Lord, who was quite mysterious and was always appearing at one moment and disappearing at the next, had summoned him.</p><br/><p>The Qilin Lord’s cultivation base was the pinnacle of a seven star Level Twelve. As he was an Emperor Beast, he was much stronger than You ZhenTian. He once participated in the ancient war and was injured in that war. Thereafter, he had always been in secluded cultivation and the number of times he came out during that period was pitifully little. As a result, even Lin ShaoYi did not know whether he had been restored to his full strength.</p><br/><p>He was afraid that the summons this time would not be so simple!</p><br/><p>Lin ShaoYi did not have a hundred percent certainty, so he just hesitated for a moment before he went to meet the Qilin Lord.</p><br/><p>The Qilin Clan lived within the void. All the people of the Qilin Clan had always been living here and the Qilin Lord lived in the tallest building.</p><br/><p>Lin ShaoYi ascended the flight of steps with light footsteps and soon arrived at the gate of the building. Before he could knock on the door, the voice of the Qilin Lord that carried profound vicissitudes sounded from within and let him in.</p><br/><p>“Clan Head, may ShaoYi know what matter he has been called over to do?” Lin ShaoYi’s gaze skimmed over the water wall. The shape of a figure could be vaguely seen from behind the water wall and it was none other than the Qilin Lord. Although Lin ShaoYi could see that figure, he could not feel his aura. The reason why he could not confirm whether the injury of the Qilin Lord had recovered was because of this water wall blocking him.</p><br/><p>The figure behind the water wall moved a little. A moment later, the voice of the Qilin Lord drifted out with a trace of aloofness and venerableness.</p><br/><p>“During this period, you will stay within the clan land and not go anywhere!”</p><br/><p>Lin Shaoyi’s gaze chilled, “Clan Leader, I…”</p><br/><p>“There’s no need for further words. I already know what’s going on outside. If you’re innocent, the rumors will be discredited.” The Qilin Lord interrupted him with unquestionable strength.</p><br/><p>“… Yes. ” Lin ShaoYi slowly lidded his lids.</p><br/><p>After Lin ShaoYi left, the Qilin Lord walked to the bedroom and sat on a stone bed inside. The stone bed was engraved with an ancient array, which was simple and time-worn, who knew how many years it had existed for. A red light suddenly appeared and the Qilin Lord sitting on it disappeared.</p><br/><p>He reappeared in a place which was dark and damp, akin to a prison.</p><br/><p>But the further one went, the wider the space became. After several complicated steps, the Qilin Lord finally appeared on an ancient altar which was engraved with strange patterns all around, looking like an array and yet not.</p><br/><p>In the middle of the altar, there was a neatly assembled set of bones of a Qilin beast. The bones were golden in color and faintly emitted a crushing pressure. This pressure would probably break through the clouds if it was not suppressed by the altar.</p><br/><p>The Qilin Lord silently stood in front of the altar with his hands clasped behind his back for quite a while. His voice echoed slowly in front of the the altar, carrying a hint of imperceptible gloominess, “In the blink of an eye, it’s been so many years since you’ve passed away. I have kept this secret for a long time, but somehow, I have a hunch that it can’t be concealed any longer. This is all I can do for you…”</p><br/><p>……</p><br/><p>Lin ShaoYi was confined and unable come out in person to do many things. Therefore, Zu Ma could only personally step out. Besides, many people already knew her identity. The Guma Tribe had also fallen into Xia Yin’s hands and she had nothing to do with the Guma Tribe any longer.</p><br/><p>Fortunately, Lin ShaoYi seldom handled the affairs of the Black Spider personally. Instead, he left it to Zu Ma and others so it did not have much impact on the Black Spider.</p><br/><p>Yet, the anger of the Demon Phoenix Clan, True Dragon Clan and Black Turtle Clan was not that easy to pacify, particularly when it was discovered that Ji YunLang’s disappearance was related to the Black Spider. Ji He was not willing to take things lying down and had been inciting the True Dragon Clan and Black Turtle Clan to fight against the Black Spider. Currently, the Black Spider was no longer as wild and arrogant as before.</p><br/><p>Zu Ma asked Lin ShaoYi for instructions for the last time, and finally decided to temporarily cease all activities to let the Black Spider recover for a period of time. Coincidentally, the Mage Assemblage would be happening in a few months and Zu Ma would also attend at that time.</p><br/><p>As for the agreement with Ling Xiao, it went without saying that it would also be settled at the Mage Assemblage.</p><br/><p>The chaotic situation in Xi Jing was finally alleviated after the Black Spider went silent. The major forces had lost numerous experts over the years. However, the rumors did not extinguish together with the conflicts, but intensified instead. This was because the news that Lin ShaoYi had been confined had spread and many people speculated that the reason why the Black Spider withdrew was also due to this.</p><br/><p>With the peace in Xi Jing, it was not long before the South Continent tactfully became quiet too.</p><br/>\n</div>"}