{"title": "Chapter 668 - Lucky and Unlucky", "id": 668, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-668-lucky-and-unlucky", "volume_title": "Volume 7", "body": "<h1>Chapter 668 - Lucky and Unlucky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 668: Lucky and Unlucky</strong></h2><br/><p>Translated by Crystal of Exiled Rebels Scanlations</p><br/><p>In the huge plaza, the amount of heads packed in there were more than three days ago, when it was sign up day. If someone had trypophobia, they wouldn’t be able to stand it.</p><br/><p>Today was the official start date of the Mage Assemblage. Other than the participants, everywhere else was filled with crowds of onlookers. Those of the XiaoYao Institution were in a mess due to the lack of people in such a busy time, that they had to ask for the help of the two other associations.</p><br/><p>You XiaoMo and Ling Xiao split up by the entrance.</p><br/><p>The entrance had two tunnels, one headed towards the auditorium whereas the other was for the competition halls.</p><br/><p>Other than the referee and the participants, no one else was allowed in there. Even the judges were outside in their area.</p><br/><p>Speaking of judges, this time, there were five of them. There was the well known principal and head elder of the XiaoYao Institution, the other three were from the Mage Association and the Beast Transfiguration Guild. Both Jiu Ye and Qiao WuXing’s Shifu were amongst them.</p><br/><p>There was only fifteen minutes left before the competition started and the five judges were already seated.</p><br/><p>Once You XiaoMo got in, he immediately saw Jiu Ye and Qiao WuXing. The two arrived early and were waiting for him by the entrance. Although there was a lot of people passing, but when he came in, they immediately spotted him.</p><br/><p>“Brother XiaoMo, here!”</p><br/><p>You XiaoMo heard Qiao WuXing’s voice and looked over to see him waving. Beside him was the cool-handsome one, Jiu Ye. He instantly walked over.</p><br/><p>“You guys have been waiting here for a while, right?” You XiaoMo walked over and greeted them with a smile. He ignored the jealous stares from the other participants, after all, there was a big difference between forming a group and not.</p><br/><p>“It wasn’t that long. Anyways, there was still fifteen minutes till the competition, we’re going to be waiting either way!” Qiao WuXing said casually, it was the truth after all.</p><br/><p>You XiaoMo rubbed his nose.</p><br/><p>“The next competition is likely to be a mixed battle. Be careful, a lot of them is watching you.” Jiu Ye said with his calm handsome face.</p><br/><p>You XiaoMo knew who he was talking about. But speaking of which, he realized that he had quite a lot of enemies.</p><br/><p>There was Zu Ma from the Black Spider, she should know of their existence, after all, once the trade fair was over, they didn’t hide their appearances. Thus, at this point, she should know it was them. As for the Vermillion Blood Clan, he didn’t know who You ZhenTian was going to send, but he was certain that they were going to use this opportunity to deal with him.</p><br/><p>There were two more.</p><br/><p>You XiaoMo didn’t forget Su Lang and Yan Hui, who were both mages, as well as being part of the Black Spider. The two would probably also be participating, he should pay attention to that too.</p><br/><p>By the looks of things, there were only four people, but it’s hard to say if they bribed any more.</p><br/><p>You XiaoMo thought about it and said, “No worries, even if it’s a mixed battle, I don’t think I’ll be that unlucky to face against the Black Spider and the Vermillion Blood Clan at the same time. Even if that does happen, I’m not too weak myself.”</p><br/><p>“That’s true, your luck has always been good!” Qiao WuXing said laughing.</p><br/><p>Fifteen minutes quietly passed away as they were talking and with it a huge ringing sound spread through the plaza from a gong. The loud chatter slowly quieted down into silence.</p><br/><p>The one who came out to talk was the principal of the XiaoYao Institution. The principal was a senile looking old man, with a slightly arched back, white hair and black and white beard. He was always smiling, like a kind elder. His voice was deep, and almost reached everyone’s ears.</p><br/><p>The old principal said a few opening statements then headed straight for the main event. The main gist of it was some explanation of the rules, with one being very important.</p><br/><p>As the organizer, the XiaoYao Institution did not guarantee that the participants will come out in one piece. Which was saying that death was likely to occur. However, there was a humane rule involving the referee.</p><br/><p>If the referee judged that someone had lost, then that person must come off stage. If at that time, the opponent still attempted a killing below and ignored the referee, then he would be kicked out. If it was very serious, then he might not be invited for the next Mage Assemblage.</p><br/><p>Other than that, the rest of the rules were easy enough to guess.</p><br/><p>After that, the old principal announced the content of the first round of competition.</p><br/><p>Just as everyone expected, it was a mixed battle since there were way too many participants. There was more than a few thousand, so if they couldn’t eliminate most of them in the first round, the rest of the competition was going to be messy.</p><br/><p>You XiaoMo, Qiao WuXing and Jiu Ye walked over to the referee closest to them. In front of him was a table, on it was a box with a hole. From there, each participant was to pick out a number from one to thirty-three, with each corresponding to an arena.</p><br/><p>Every arena had fifty participants, except for the thirty-third one, since there was no way the total number of participants was a round number, thus the last arena had less people, only thirty-six of them.</p><br/><p>The first round of competition goes like this: Fifty people in the same arena and by using any means necessary, the last ten people will pass on to the next round, including the thirty-third arena. Since there was only thirty-six people, they only needed to eliminate twenty-six of them, thus all of those who got that arena was considered the lucky ones.</p><br/><p>Qiao WuXing got the first arena whereas Jiu Ye got the twenty-fifth. You XiaoMo walked in front of the referee and pulled out a number from the box. When he turned it around, impressively it said thirty-three.</p><br/><p>“You really are lucky!” Qiao WuXing couldn’t help but laugh. It was such a small chance but he still got it, his luck was truly jealousy inducing.</p><br/><p>You XiaoMo chuckled as well, he didn’t think he would get it either.</p><br/><p>Jiu Ye, who stood by the side, said, “Not exactly!”</p><br/><p>The two turned towards him only to see Jiu Ye looking at a direction expressionlessly. The two followed his gaze to see a women in white, with an exceedingly beautiful face. Even just quietly standing, she stole all the spotlights. Surrounding her was a few, young and handsome mages.</p><br/><p>The women held a number, she didn’t hid it so the two of them clearly saw a thirty-three written on it.</p><br/><p>“Who is she?” You XiaoMo asked confused. She could tell that this woman was very strong, maybe even stronger than him, also just as lucky.</p><br/><p>“You don’t know her?” Qiao WuXing asked with a weird expression.</p><br/><p>You XiaoMo was confused, “Should I know her?”</p><br/><p>Qiao WuXing didn’t know whether to laugh or cry at that as he replied, “A few days ago you just snatched the Dragon Ginseng Grass from her. How have you not seen her before?”</p><br/><p>You XiaoMo opened his mouth wide. It was her! You really couldn’t avoid your enemies.</p><br/><p>He turned towards that women again and coincidently their gazes met. Clearly they knew who he was, as she stared at him with eyes cold as the glaciers, with a hint of evil in between.</p><br/><p>You XiaoMo unconsciously gripped his number plate tighter. He had a feeling that it was going to be a tough fight later. At first he had thought that he was lucky to be one the thirty-third arena, but to think it was actually the start his unluckiness.</p><br/><p>Everyone started to get ready.</p><br/><p>You XiaoMo walked over to the thirty-third arena under everyone’s jealous gaze.</p><br/><p>Those who were in the same arena as him was also very excited. What they didn’t know was that this arena was going to get very chaotic due to certain people.</p><br/><p>You XiaoMo stood at the border of the arena with Zu Ma standing in opposite of him. Her gaze almost never left him. Such a strong love, he felt it, but too bad he couldn’t respond as he already had Ling Xiao and he didn’t like pretentious people either.</p><br/><p>Their arena, compared with the others appeared a lot emptier, with only thirty-six people. When it was about time, everyone’s expression change. Now they looked expressionless at those around them, standing guard.</p><br/><p>“Remember, once there is only ten people left, the first round is over. All those who continue to fight will be eliminated from the competition. Hopefully everyone can be diligent. Once the gong sounds three times, the match will officially begin.” The referee said with severity from the bottom of the arena. Although injures and death were unavoidable, it was important to keep them as minimal as possible.</p><br/><p>Once everyone got up the arena, from the judges stand, someone started hitting the gong.</p><br/><p>With three sounds from the gong, impressive waves of forces exploded one after another. Those in the audience were completely dazzled, not knowing where to look. The usually hard to find rainbow mages were now packed in the arenas as if it was nothing. Occasionally exclamatory sounds could be heard from the audience.</p><br/><p>Just as most of them believed that the thirty-third arena was the easiest, two incredible forces erupted towards the skies, as if two huge mountains reaching for the clouds. Rampaging soul force twisted in a frenzy, causing those unexpecting mages to almost go limp from fear. Everyone looked frighteningly at You XiaoMo and Zu Ma.</p><br/><p>Those who were feeling lucky about getting this arena now were all vexed by the situation. What luck, more like the ticket to hell, the difference in power was too much!</p><br/><p>The situation over there quickly gathered other’s attention. Once they saw the situation, they all took a breath in. Although there were only a few people there, but for two experts at the pinnacle appear, people instantly started to ask around for their identity.</p><br/>\n</div>"}