{"title": "Chapter 679 - Black-Bellied Qiao WuXing", "id": 679, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-679-black-bellied-qiao-wuxing", "volume_title": "Volume 7", "body": "<h1>Chapter 679 - Black-Bellied Qiao WuXing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 679: Black-Bellied Qiao WuXing</strong></h2><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>The spectator stands plummeted into silence.</p><br/><p>The two grade six mages You Quan and Zu Ma had somehow sustained injuries simultaneously. Though it didn’t seem severe, everyone was still shocked.</p><br/><p>They were two of the mages that people had the highest hopes for winning, countless people observing their progress and even betting on them.</p><br/><p>Since You XiaoMo was a newcomer, so there were fewer people betting on him, while more people bet on You Quan and Zu Ma. Seeing the two practically defeated, screams from those that bet too much on them rang out throughout the spectator stands.</p><br/><p>However, the match wasn’t over yet.</p><br/><p>You Quan and Zu Ma had only sustained minor injuries. They still had the ability to fight on; it was just that the likelihood of them winning had decreased. They hadn’t given up yet, those people who bet on them told themselves.</p><br/><p>You Quan wiped blood from the corner of his mouth. Luckily for him, he had left another thread of soul power in a different tunnel. So long as his soul power was inside the maze, he could continue.</p><br/><p>He absolutely loathed You XiaoMo now.</p><br/><p>After defeating You Quan, You XiaoMo finally found an exit, following the slight breeze. It was the seventh entrance. The others were still entrapped in combat, including the Cang Alliance’s master of shameless. None of them were willing to show mercy. Right now, if he had his soul power go through this exit, then he would be first.</p><br/><p>Just as everyone waited for him to go through, he stopped around five centimeters from the exit.</p><br/><p>What was this?</p><br/><p>Everyone was puzzled, and it took a while before they realized that You XiaoMo was smiling sweetly, but maliciously at Zu Ma. This is definitely Ling Xiao’s influence at work!</p><br/><p>It took them a while to notice that Zu Ma, too, was under the seventh exit.</p><br/><p>After being ganged up on and injured by mages from the two big guilds, she didn’t recklessly attack them, instead choosing to avoid them and heading in another direction, and that direction just so happened to be the path You XiaoMo was in.</p><br/><p>As soon as You XiaoMo went through the exit, Zu Ma would become second, following him.</p><br/><p>The runner up prize was very plentiful as well. Though it wasn’t first place, it was well worth it. Unfortunately, she had bumped into You XiaoMo. You XiaoMo was in the Mage Assemblage with the goal of causing trouble for Zu Ma, and now You Quan as well.</p><br/><p>Zu Ma was practically grinding down her teeth in anger, glaring at him venomously.</p><br/><p>The other mages were delighted. If You XiaoMo wasn’t aiming for first place, then they had a chance.</p><br/><p>On the other side, the mages from the two big guilds had been stalled by some others. This time, it was some old experts who usually spent their time hidden away. They wanted first place as well.</p><br/><p>Away from all the attention, Qiao WuXing and Jiu Ye steadily made their way through the maze. They had chosen a rather out of the way path because they weren’t a match for high grade mages, so they chose to keep away from the crowd. One of them was heading for the first exit, and the other the second exit.</p><br/><p>If nothing unexpected happened, then the winner would be one of them two.</p><br/><p>However, you couldn’t expect everything. There were two others that everyone forgot about as well, Su Lang and Yan Hui.</p><br/><p>Zu Ma was strong, true, but they couldn’t be certain that other mages wouldn’t go after her and stall her. Black Spider had anticipating such an occurrence, so they had the two do their best to avoid the commotion and win the match.</p><br/><p>The two were like Qiao WuXing and Jiu Ye, and had chosen similar paths, inevitably bumping into each other in the latter half of the match.</p><br/><p>“Shidi, leave Jiu Ye to me. You go and deal with Qiao WuXing.” Yan Hui said to Su Lang, face dark. He knew Qiao WuXing and Jiu Ye’s approximate strength. The two might’ve been outshone by You XiaoMo, but their strength couldn’t be underestimated, especially Jiu Ye. His cultivation level was even higher than Qiao WuXing’s.</p><br/><p>Su Lang was at the peak of grade two while Jiu Ye was already grade three. He didn’t have much of a chance.</p><br/><p>As expected, Su Lang neered. “You’re only grade two as well, just closer to advancing. Do you think you can beat him?”</p><br/><p>Yan Hui didn’t bother arguing, just saying calmly, “If you want, I’ll leave him to you.”</p><br/><p>Su Lang went silent.</p><br/><p>On the other side, Qiao WuXing shot Jiu Ye a look. Jiu Ye nodded, his mouth curving into a cruel smile.</p><br/><p>Their genius had merely been overlooked because there was someone even more of a genius. However, they were still geniuses, and they had plenty of battle experience. Though they resided in the peaceful ZhongXin City, they often went out with their masters. They might not have as much battle experience as practitioners, but Su Lang, who had grown up so well-protected, couldn’t compare at all.</p><br/><p>Qiao WuXing smiled helplessly. He knew that Jiu Ye had been holding back for a long time already.</p><br/><p>Yan Hui soon found himself facing Jiu Ye. As for Su Lang, he reluctantly arrived in front of Qiao WuXing. They were both grade two, so this would a test of their endurance.</p><br/><p>“I hear that you’re the number one genius in all of TongTian Continent?” Qiao WuXing gazed at Su Lang, giving a soft smile, yet his words struck like knives.</p><br/><p>Su Lang was stunned for a moment, but then when he processed what he was hearing, his face paled. The three words ‘number one genius’ had now become nothing more than humiliation, and he could no longer feel any joy from hearing them.</p><br/><p>“Grade two at such a young age. You truly are a genius, but unfortunately, you aren’t worthy of such a title yet. I know someone your age who’s even stronger than you, but he’s grade six already.” Qiao WuXing smiled even as he delivered blow after blow, revealing his black-bellied nature.</p><br/><p>He he he he!!!</p><br/><p>There was no way that Su Lang didn’t know that Qiao WuXing was talking about You XiaoMo. Though the two technically didn’t have any bad blood between them, his hate for You XiaoMo grew steadily. The veins on his head bulged in his anger, his eyes opened wide. Qiao WuXing could even see the red lines in his eyes.</p><br/><p>“Idiot! It’s a trick!” Yan Hui’s frustrated voice suddenly sounded in his head.</p><br/><p>Su Lang’s attention wavered and before he could even react, pain lanced through his head, almost like his soul had been torn asunder, his skin paperwhite from the pain. He could vaguely see the smile on Qiao WuXing’s face as the other looked at him.</p><br/><p>Su Lang supported himself against the exquisite jade stone, steadying his swaying form. When he managed to recover from the pain, his soul power had already dispersed in the maze. Just a few seconds and he was already defeated? His eyes widened in disbelief.</p><br/><p>“So what if you’re a genius? You’re still too green.” Qiao WuXing smiled, gentle and elegant. If this was all it took to ruffle his feathers, then he really wasn’t much. Even without You XiaoMo, he was far from the title of number one genius.</p><br/><p>Hearing his words, a murderous aura erupted from Su Lang. He was going to murder this person. But before he could do anything, the guards dragged him away. Those who lost had to leave immediately. However, they could still hear Su Lang’s cursing as he was dragged far.</p><br/><p>Qiao WuXing couldn’t hold back his laughter.</p><br/><p>A young man who couldn’t accept losses, seems like his master wasn’t very responsible.</p><br/><p>On the other side, Yan Hui was a little frustrated at seeing Su Lang defeated so easily, but he didn’t regret it at all. Su Lang really was useless, acting this way at the slightest loss. He really didn’t know what his master saw in this guy.</p><br/><p>He didn’t want to admit it but he felt a hint of delight upon seeing Su Lang defeated.</p><br/><p>That was when a cold voice spoke into his ear,“You seem rather happy?”</p><br/><p>Yan Hui whirled to face the other. The owner of the voice was the expressionless Jiu Ye, his cold eyes seeming to pierce through his thoughts. His face immediately became cold.</p><br/><p>Jiu Ye didn’t need a reply from him. Qiao WuXing’s battle had ended, so there was no need for him to keep dragging this out. He attacked furiously, blow after blow and Yan Hui was practically helpless against his assault.</p><br/><p>Yan Hui glanced at the motionless Qiao WuXing nearby. He couldn’t even hold up one on one, never mind one on two. After realizing this, he didn’t continue, retracting his soul power at the soonest opening. This time, it wasn’t his fault that they failed, so even if his master punished him when he got back, he wouldn’t have to bare the brunt of the blame.</p><br/><p>Jiu Ye didn’t bother chasing the other.</p><br/><p>Qiao WuXing smiled. “What should we do next?”</p><br/><p>Jiu Ye looked towards You XiaoMo. He was currently blocking the seventh exit and Zu Ma was practically hyperventilating in anger. If she went back, then she might not be so lucky as to find a different exit. This time it was pure coincidence that she got here, but she didn’t have much of a chance against You XiaoMo.</p><br/><p>“What do you want to do?” Jiu Ye asked.</p><br/><p>They both wanted the grade water, and with You XiaoMo there, they could obtain it, but there was only one portion of grade water. He was stronger than Qiao WuXing, and had a better chance, but after defeating Su Lang, Qiao WuXing didn’t leave. Otherwise, he would’ve gotten first place by now.</p><br/><p>A gentle smile spread across Qiao WuXing’s face. “I have an idea…”</p><br/><p>While the mages in the maze were still facing off, a resounding voice echoed through the plaza.</p><br/><p>“Qiao WuXing and Jiu Ye have tied for first place.”</p><br/><p>Zu Ma was about to spit blood. She had finally realized that You XiaoMo was actually here just to cause trouble for her, and prevent her from getting first place.</p><br/><p>You XiaoMo smirked maliciously, still remaining where he stood with no intention of moving.</p><br/><p>After first place was decided, second, third soon came after… The mages stopped fighting, so the places were taken one after the other. Even You Quan had managed an eighth place, but it was no use to him. He was so enraged that he could cough blood.</p><br/><p>In wasn’t until the ninth place was taken that You XiaoMo casually wandered into tenth place.</p><br/><p>The once holy maiden hadn’t even gotten into the top ten in this Mage Assemblage, never mind first place! Zu Ma’s rage boiled over, causing her to cough up blood.</p><br/><p>And thus, the Mage Assemblage came to a wonderful curtain call!</p><br/>\n</div>"}