{"title": "Chapter 670 - Lucky", "id": 670, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-670-lucky", "volume_title": "Volume 7", "body": "<h1>Chapter 670 - Lucky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 670: Lucky</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>Sparks collided within the thirty-three arenas with more than a thousand mages. The battle royal on each of the arenas were extremely intense. Violent fluctuations of soul force smashed into each other and mages were constantly being blasted off the arena.</p><br/><p>There were only five arenas left where the the final fifty contestants to qualify for the second round had not been decided when the first round at the tail end. Among those five was the arena where You XiaoMo was at. The attention of the spectators involuntarily shifted to the two as the outcome of the battle between them had yet to be finalized.</p><br/><p>However, the other mages on the arena were unlucky.</p><br/><p>You XiaoMo was not a fool and neither was Zu Ma. So after nearly an hour of crossing hands, they began to deliberately sweep the mages out of the arena and the weak ones were all blasted off.</p><br/><p>The more powerful mages seemed to have a sudden enlightenment when they discovered this situation They started to enter a competitive state, that was to say, they also began to clear up the other contestants.</p><br/><p>The referee had said at the beginning that the ten experts who remained on the arena would automatically advance to the next round. That meant that once the ten experts were decided, You XiaoMo and Zu Ma would have to stop fighting and they would be able to escape. They had just figured this out now but it was fortunate that it was not too late!</p><br/><p>You XiaoMo’s long legs decisively swept out with irresistible force.</p><br/><p>Zu Ma quickly lowered her body and avoided it. At the same time, she had to constantly suppress the agitation that was about to burst from her chest. The ribbon in her hand had never touched You XiaoMo from the start till now. The anger accumulating in her heart made her movements more and more unbalanced.</p><br/><p>Just at this moment, You XiaoMo suddenly threw away the silver shovel in his hand, and he rushed towards Zu Ma like lightning with an ominous glint in his eyes.</p><br/><p>Zu Ma was first delighted before she immediately put up her guard after discovering this situation.</p><br/><p>One would know that there was definitely a problem if he threw his powerful weapon away for no reason at all if they were not stupid. After having experienced You XiaoMo’s strength, Zu Ma dared not take it lightly.</p><br/><p>The ribbon in her hand quickly spread out into a huge net in front of her before it speedily enclosed You XiaoMo’s figure within like an inescapable net. The speed was so fast that the spectators in the auditorium could hardly see it. Only when the inescapable net enclosed one third of the arena did everyone see the situation clearly.</p><br/><p>You XiaoMo stood entangled in the middle of the inescapable net.</p><br/><p>The spectators could not help causing a loud commotion. He actually got captured at the most important moment! There were only eleven people left on the arena at this time. As long as one person was kicked off, the remaining ten people could advance.</p><br/><p>The agitation in Zu Ma’s heart was finally relieved and her thin lips showed a faint triumph. If it was not the last step before her victory, she would like to see what kind of expression Ling Xiao had right now. She could already imagine that it would be very interesting!</p><br/><p>Just when everyone thought You XiaoMo would lose, an anomaly happened.</p><br/><p>A bright ray of light suddenly burst out from the inescapable net. At first, it was just a tiny ray. Then the light became brighter and brighter, akin to the midday sun, and it was so glaring that everyone was unable to open their eyes.</p><br/><p>Zu Ma’s expression changed. It was too late when she wanted to retract the ribbon. She clearly felt that a tremendous force ferociously striking the inescapable net. The powerful energy was pounding on the net like an electric drill and the strong net suddenly deformed. If it went on like this, it might break.</p><br/><p>If the ribbon was retracted at this time, she would be hit by the backlash.</p><br/><p>Zu Ma’s expression was so horrendous that it was frightening. She decided to retract the ribbon after quickly considering the pros and cons. Just as the thought flashed through her mind, she felt a sharp burst of pain from her head. Her soul had suffered a severe attack. Her face was pale and bloodless and cold sweat continuously dripped from her forehead.</p><br/><p>Before she could look over, a humongous ‘boom’ was heard. A large hole was made in the inescapable net and the ribbon was torn into several sections that disappeared before they could land on the ground.</p><br/><p>Zu Ma vaguely saw the smile on You XiaoMo’s face. She finally understood that the reason why You XiaoMo had always been attacking her ribbon since the start. He had planned this and was whittling her soul power away. When her soul power slowly weakened, he made himself the bait. This was also why he threw away his silver shovel, to make her let her guard down.</p><br/><p>She still fell for his plan despite having raised her vigilance.</p><br/><p>She had fallen for You XiaoMo’s ploy the moment her ribbon divided to form an inescapable net. The larger the surface area of the ribbon, the more her soul power had dispersed. Once it had dispersed, the strength and durability of the ribbon would be reduced. No wonder her inescapable net could not even hold for twenty breaths. It was all part of You XiaoMo’s plan.</p><br/><p>Zu Ma took a few steps back with a pale face.</p><br/><p>You XiaoMo did not intend to let Zu Ma off like this. This woman was also his enemy. She should have a high position in the Black Spider with her strength. Killing her would definitely inflict heavy losses on the Black Spider. How could he waste such a good opportunity?</p><br/><p>Taking advantage of Zu Ma’s momentarily loss of consciousness, You XiaoMo’s raised his speed to the max. At the same time, a broadsword appeared in his hand and flashed with a sharp ray of light. As he arrived in front of Zu Ma, the broadsword chopped down from her head…</p><br/><p>Zu Ma opened her eyes and a powerful soul force erupted out from her body, forming a strong barrier. The barrier successfully blocked You XiaoMo’s action. However, it lasted for only for a moment before the broadsword pierced through the barrier. Just was it was about to penetrate into Zu Ma’s body, her soul force suddenly went on a rampage all around, with a large portion directed at You XiaoMo.</p><br/><p>You XiaoMo had to dodge aside in order to avoid the rampaging soul force. When he stabilized himself and was ready to rush to Zu Ma again to deal a fatal blow, the referee’s voice rang out.</p><br/><p>“The match is over!”</p><br/><p>You XiaoMo was stunned as he stabilized himself. It was over?</p><br/><p>He glanced all around the arena and found that there was certainly only ten people left, including him and the holy maiden. He clearly remembered that there were eleven people left. They probably thought it was not easy to get to this point, so they dared not move. How could someone be kicked off the arena in this situation?</p><br/><p>You XiaoMo had no choice but to stop while harboring suspicions.</p><br/><p>He really wanted to ignore the referee and kill Zu Ma. In any case, his purpose was to prevent Zu Ma from getting the Grade Water. But Zu Ma was very cunning and she jumped off the arena the second after the referee announced the result. The members of the Black Spider had already been standing at one side and immediately took up guard behind her.</p><br/><p>You XiaoMo had to regretfully give up this thought.</p><br/><p>Understandably, he had become the most dazzling presence in the Mage Assemblage. Many of the mages who were contestants regarded him as their strongest opponent, and were secretly on the alert.</p><br/><p>Off the arena, Zu Ma pushed Yao Sen and Yao Lin aside. It seemed that she was largely unhurt, but the expression on her face was extremely colorful and unsightly. Hatred flashed across her face. However, she soon calmed down before becoming extremely astonished.</p><br/><p>Although the ribbon broke, the shock to the soul was only temporary. She had already recovered by this time and was only slightly injured. The other things were minor, including the rampaging of her soul force that had saved her life. This was one of the life-saving methods she had and had not expected that You XiaoMo would force her to use it!</p><br/><p>Zu Ma was not very happy despite having successfully advanced to the second round. She only knew that after the encounter with Ling Xiao, she was once again ruthlessly given a slap. This slap in the face was extremely loud. The last time she had been severely humiliated by Ling Xiao in front of many experts in Dong Zhou, this time the number of people present was tens of thousands times more. Her reputation was completely gone without a shred.</p><br/><p>Zu Ma coldly glared at You XiaoMo for quite a while, before she left silently.</p><br/><p>This time she was too careless. The next time she would absolutely make You XiaoMo pay a painful price!</p><br/><p>You XiaoMo came back to Ling Xiao and the smile he had been patiently restraining finally appeared as he looked at Ling Xiao with an expression of begging for praise, like a little tsundere.</p><br/><p>“Good job!” Looking at his expression, Ling Xiao showed a faint smile on his handsome face. His smile could even be seen in his eyes as he generously praised You XiaoMo.</p><br/><p>You Xiao openly laughed. He actually had a big advantage, that was, his ability to adapt to changes was very strong. As long as the gap in strength was not too big, he could beat the other party till they cried uncle.</p><br/><p>Ling Xiao had long discovered this fact, so he has never passed on any fighting skills to his family’s wife. This kind of thing depended entirely on one’s personal understanding, there were no shortcuts!</p><br/><p>After You XiaoMo finished laughing, he suddenly remembered the strange events before the match ended. He still had no clear idea about what had happened and he was a little unhappy that Zu Ma had escaped. Therefore, he asked, “Oh yes, what happened at the end? Why was the eleventh man kicked off the arena?”</p><br/><p>Ling Xiao narrowed his eyes, “He wasn’t attacked by anyone. He chose to jump off.”</p><br/><p>You XiaoMo let out an ‘ah’, “What caused that?”</p><br/><p>“Don’t you understand yet?” Ling Xiao asked in reply before he immediately explained, “The eleventh person was either a person from the Black Spider or a mage that they had bribed. He probably saw that woman in danger, so he voluntarily quit.”</p><br/><p>You XiaoMo suddenly saw the light, “How treacherous!”</p><br/><p>Everyone left after the match ended. The second round would begin tomorrow at the same time.</p><br/>\n</div>"}