{"title": "Chapter 686 - A Passing Acquaintance", "id": 686, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-686-a-passing-acquaintance", "volume_title": "Volume 7", "body": "<h1>Chapter 686 - A Passing Acquaintance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 686: A Passing Acquaintance</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlations</p><br/><p>He remembered that not long after Ling Xiao became an up and coming star in the Ten Gods he and You XiaoMo arrived in the TongTian Continent, and this caused a great commotion at that time.</p><br/><p>Dao Yun’s master, the Thief God, was one of the Ten Gods and he was also rumored to be the number two expert. This old man always came and left without a trace for his whole life and was only interested in precious things. At that time, Ling Xiao wanted to use him to find the five types of Elemental Essences. Unfortunately, they were separated from Dao Yun and had never kept in contact again.</p><br/><p>Nowadays, the Thief God was no longer an expert belonging to the Ten Gods. Having broken through the pinnacle of the Divine Realm, he had risen above the top experts in the TongTian Continent. However, even being a one star Sacred Realm practitioner did not completely guarantee his safety in these turbulent times.</p><br/><p>Tian Dao had said before that there was a man clothed in black who was very interested in the Five Blessing Spirit Eye. That man was probably the Thief God.</p><br/><p>You XiaoMo also understood that the man in black they discovered in the ShuiXi Tribe was Dao Yun’s shifu. At that time, he had no chance to get the Five Blessing Spirit Eye, so he chased You XiaoMo to the Ghost Tomb Mountain Range in Xi Jing. But knowing sequence of events did not mean that he would let the Thief God off. He would surely ask the Thief God to pay with his life if something happened to the Giant Roc.</p><br/><p>“Your contracted demon beast is all right.” Dao Yun discovered the chillness in You XiaoMo’s eyes and hastened to explain.</p><br/><p>You XiaoMo turned back and looked at the youth from his former days. He recalled when he had just arrived at the TongTian Continent and when he saw Dao Yun at the Black Spider auction, and suddenly found that it was a thing that was from the distant past.</p><br/><p>“Where is the Giant Roc then?”</p><br/><p>Dao Yun’s feelings were more profound than his. He still remembered that You XiaoMo looked very young and tender when he met him for the first time, and his cultivation was low at that time. However, he was now a first-rate transcendent level mage in the TongTian Continent. He had heard all kinds of rumors over the years and Dao Yun’s feelings were very complicated.</p><br/><p>“He was saved by someone.” Dao Yun sorted out the complex thoughts in his mind a little before he explained, “We had planned to lock him up that day, but unexpectedly another man in black interrupted us midway. He saved your contracted demon beast and we never saw them again.”</p><br/><p>“Another man in black?” You XiaoMo frowned, why were there so many people in black?!</p><br/><p>Dao Yun nodded, “You should have a vague impression of him. He was also one of the men in black who had snuck into the ShuiXi Tribe. His goal is also the Five Blessing Spirit Eye.”</p><br/><p>You XiaoMo’s eyebrows creased into a ‘’ character.</p><br/><p>That was to say, that man in black may also threaten him with the Giant Roc?</p><br/><p>If he had known earlier, he would not have given them the first move at that time. In the end, each and every one of them all targeted his contracted demon beasts. The Five Blessing Spirit Eye would probably have been stolen a long time ago if there were a few more. However, he did not expect that the Giant Roc would be so careless. This definitely deserved punishment.</p><br/><p>Dao Yun looked at his expression and hesitantly asked, “Fellow Brother You, can you spare my shifu?”</p><br/><p>You XiaoMo raised his head and his eyes swept over the slightly unwilling expression on the Thief God’s face. He had returned to his original appearance, which was an aged face with slightly wrinkled skin, but with a rather sensual face. He would look just like a old rouge if it was not for the melancholy on his face.</p><br/><p>Seeing that he did not speak, Dao Yun quickly said, “I can assure you that as long as you spare my shifu, I will definitely persuade my shifu to stop aiming for the Five Blessing Spirit Eye.”</p><br/><p>“Persuade?” You XiaoMo raised an eyebrow.</p><br/><p>Dao Yun immediately looked at his shifu with a bitter smile, “Shifu, can you promise your disciple that you won’t go for the Five Blessing Spirit Eye again? All right? You’re my only relative. I don’t want to lose you.”</p><br/><p>The Thief God stared at his disciple for a moment. Then he suddenly gave a ‘humph!’ before he turned and walked away.</p><br/><p>Dao Yun was delighted. Although did not receive an answer, he knew that his shifu had agreed. He quickly thanked You XiaoMo, “Fellow Brother You, thank you for your generosity. My shifu and I will not bother you again in the future!”</p><br/><p>You XiaoMo looked at their figures fading out of view and shook his head as he laughed. He was really such a tsundere old rascal who refused to give up easily. However, he became distressed again when he thought of the missing Giant Roc. It seemed that he had to go discuss this with Ling Xiao.</p><br/><p>You XiaoMo turned back to return to the palace. Just at this moment, an agitated and familiar voice suddenly came from behind him. It sounded very much like the missing Giant Roc. “Master!”</p><br/><p>You XiaoMo abruptly looked back. The Giant Roc’s relatively handsome face instantly ran towards him. You XiaoMo was immediately anxious and doubtful. Could it be another fake Giant Roc?</p><br/><p>The Giant Roc came up to him and looked at him respectfully.</p><br/><p>You XiaoMo finally determined that he was the real Giant Roc. He could not help from asking curiously, “I heard you were captured by a man in black. How did you escape?”</p><br/><p>The Giant Roc replied, “That man let me go. He’s outside right now.”</p><br/><p>You XiaoMo looked behind him. Sure enough, he saw a figure outside the gate. He could vaguely see that he was a slighted hunchbacked old man who was a little fatter than Dao Yun’s shifu. He decided to meet this old man for a while and see what he wanted.</p><br/><p>The palace was located behind the Cartilage Mountain. As soon as one exited the barrier, they would be able to experience the distinctive aura of Cartilage Mountain. There was a slightly sour odor amidst the smell of decay and one could hear the wailing of the Cartilage Mountain.</p><br/><p>The old man with white hair and a ruddy complexion stood outside. He had a youthful looking face and looked very healthy, completely unlike a decrepit old man. Although he was fat, weighing at least more than one hundred and sixty kilograms, he did not give off the feeling of obesity, but a rather chubby and adorable feeling instead. His eyes also seemed to contain laughter at all times.</p><br/><p>“Thank you very much for saving the Giant Roc. What request do you have?” You XiaoMo got straight to the point despite having a good first impression of the old man.</p><br/><p>Embarrassment flashed across the old man’s face, “Though saving people is just a matter of lifting a finger, this old man does have something to beg of this little friend.”</p><br/><p>You XiaoMo smiled, “You want the Five Blessing Spirit Eye?”</p><br/><p>Unexpectedly, the old man shook his head, “My original goal was really the Five Blessing Spirit Eye because it could help me. But if Little Friend You is willing to help me, I would not need the Five Blessing Spirit Eye.”</p><br/><p>“Help with what?”</p><br/><p>The old man was ashamed as he said, “This old man traveled the continent in his early years, but later got poisoned when I was careless. This poison is the Five Decline Poison. If treatment is not provided in time, the victim would slowly die of old age. Little friend, don’t think that there’s nothing wrong with this old man now when you look at my appearance. In fact, I’ve been been suffering from the Five Decline Poison for nearly a hundred years. I would have died of old age by now if I hadn’t continuously raised my cultivation base.”</p><br/><p>He had acquired new knowledge. This was the first time that You XiaoMo had heard of the Five Decline Poison. Based off the old man’s complexion, he really did not look like he had been poisoned.</p><br/><p>The old man had a forlorn look on his face, “I’m sure this little friend also knows that it’s very difficult to raise one’s cultivation by a star for a Sacred Realm practitioner. It’s not easy for this old man to be able to achieve his current cultivation base. If I don’t get rid of this poison, I’m afraid I won’t live past another ten years. I have an unfulfilled wish and am not willing to die like this.”</p><br/><p>“How do you want me to help you?” You XiaoMo asked.</p><br/><p>The old man’s eyes lit up, “Does this little friend really want to help me?”</p><br/><p>You XiaoMo nodded. In any case, it could be considered since he had saved the Giant Roc. He could help him with this favor as long as the request was not too excessive, “But let me first declare that I’ll only help if it’s within my ability.”</p><br/><p>“Naturally!” The old man nodded repeatedly, “A Grade Six Rainbow pill called the God Return Pill is needed to neutralize the Five Decline Poison. Not only can it neutralize the poison, it can also let one regain their youthful appearance. Thus, some people also call it the Juvenescence Pill. I have collected two sets of materials for the God Return Pill, but it’s a little hard to get the pill recipe…”</p><br/><p>“I understand. Just give me the materials.” You XiaoMo interrupted him. The pill recipe had never been a problem for him. He had already went over all the Grade Six pill recipes once when he became Grade Six mage. As he did not have a purpose for the God Return Pill, he had just left in a corner.</p><br/><p>The old man thought You XiaoMo was going to help him find the pill recipe of the God Return Pill and felt a little embarrassed, “Just say so if you any need for help in the future. This old man will definitely honor his promise.”</p><br/><p>You XiaoMo did not tell him the truth. He would just let the old man feel guilty if the old man wanted to. He did not intend to lend a hand at no cost. Although the old man saved the Giant Roc, he had a purpose behind his actions.</p><br/><p>“By the way, how can I contact you?” You XiaoMo asked in passing after accepting the materials.</p><br/><p>The old man replied, “I’m usually wandering about and don’t have a fixed residence. If Little Friend You doesn’t mind, I will stay in White Bone Town until you contact me.”</p><br/><p>You XiaoMo had thought the old man would say that he wanted to stay in the palace and had already made plans to reject him, “All right. How do I address you?”</p><br/><p>“Everyone calls me Han Gong. You can just call me that. The old man won’t disturb you any longer. Goodbye!” Having said that, the old man left.</p><br/><p>You XiaoMo nodded his head and replied unconsciously, “Take care!”</p><br/><p>When the old man walked to the gate and stepped out with one foot, You XiaoMo finally reacted. He called out to the old man and stared at him with wide eyes, “Wait, what did you say your name was?”</p><br/><p>The old man turned around and looked at him strangely, “Han Gong is not my real name, but because other people call me so, I’ve gotten used to it. If Little Friend You wants to know my real name…”</p><br/><p>You XiaoMo interrupted him immediately and continued to stare at him, “I just think your name sounds kind of familiar…”</p><br/><p>He remembered something he had forgotten for a long time.</p><br/>\n</div>"}