{"title": "Chapter 687 - Dimension Evolution", "id": 687, "volume": 7, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-687-dimension-evolution", "volume_title": "Volume 7", "body": "<h1>Chapter 687 - Dimension Evolution</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 687: Dimension Evolution</strong></h2><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>Han Gong was that mysterious Academy head of DaoXin Academy.</p><br/><p>Originally when You XiaoMo promised Grand Elder HeiTian that he would tell Han Gong of DaoXin Academy’s situation and ask him to go back if he ever found him, too much had happened since then, and he had slowly forgotten all about it.</p><br/><p>The TongTian Continent was massive. Trying to find someone would be like searching for a needle in a haystack. However, if he hadn’t offended the Vermillion Blood Family so early on, then he might’ve been able to use the Cang Alliance’s rankings to find Han Gong. Unfortunately, with all that happened, he hadn’t thought of that.</p><br/><p>After confirming Han Gong’s identity, You XiaoMo relayed the words from Elder HeiTian.</p><br/><p>Han Gong didn’t expect it to be such a small world, meeting a student of DaoXin Academy here of all places. However, his attention was soon drawn by what You XiaoMo had to say. Even DaoXin Academy’s protective barrier had been destroyed. It was obvious how intense the battle had been!</p><br/><p>Han Gong couldn’t help but lament. It seemed like DaoXin Academy had gone through a lot while he had been absent. If it wasn’t for that fact that he had been poisoned with the Five Decline Poison that could only be cured in the TongTian Continent, he would’ve gone back to the DaoXin Academy ages ago.</p><br/><p>The TongTian Continent was massive, filled with experts of all kinds. Here, the world around you wouldn’t limit you and there were resources aplenty. It was more advantageous for both Mages and practitioners, but there wasn’t a single familiar face. It truly was rather lonely.</p><br/><p>“Thank you, friend You, once the Five Decline Poison is cured, I will go back to visit,” Han Gong said before leaving.</p><br/><p>You XiaoMo let out a sigh of relief. That was one thing finally resolved. Otherwise, if he and Ling Xiao returned to DaoXin Academy one day and hadn’t done as they had promised, then that would be so awkward!</p><br/><p>The Samsara pill and the God Return pill were rainbow grade six pills. After he had advanced to grade six, he had attempted to refine a rainbow grade six pill before. He hadn’t picked a very difficult pill to refine, but he had still failed the first time round, only succeeding on the second. A fifty percent chance was pretty good, but refining just one pill required seven to eight days.</p><br/><p>In the afternoon, Ling Xiao returned. The two went to their hidden room and You XiaoMo informed him of what had happened that morning. After discussing, they decided to temporarily close off access to the Five Blessing Spirit Eye. You XiaoMo would be in the Ghost Tomb Mountain Range for the following period of time, so if anyone wanted to enter the hidden room, then they could just come and find him. This way, they could avoid incidents like with the Giant Roc in the future.</p><br/><p>After they had opened the Five Blessing Spirit Eye to the others, everyone did their utmost to take the chance to improve their cultivation base, and there the five colored liquid inside was slowly being drained. Since it took time for the liquid to condense, the Five Blessing Spirit Eye wouldn’t replenish as it was used like the lake of spiritual water would, even with the rainbow stone.</p><br/><p>The multicolored five colored liquid lay silently, the rainbow stones barely visible. They couldn’t be seen unless one looked closely.</p><br/><p>You XiaoMo stared at the rainbow stones and couldn’t help but ask Ling Xiao, “What do you think about putting the rainbow stones into my dimension?”</p><br/><p>Ling Xiao had heard about what had happened to his dimension, and thought for a moment before figuring out what he meant. “You want to replace the eye of the lake using the rainbow stones?”</p><br/><p>You XiaoMo nodded. “I want to try, because of that tear, the spiritual water that the eye of the lake can produce has been decreasing. I think the foundations of the dimension are linked to the eye, and the tear is damaging the eye. I think the eye has a similar ability to the rainbow stones, so maybe it can be replaced.”</p><br/><p>“You sure?” Ling Xiao asked, raising an eyebrow.</p><br/><p>You XiaoMo nodded again. “Of course. Though the Five Blessing Spirit Eye is valuable, in the long-term, it’s not nearly as valuable as the spiritual water in the lake.”</p><br/><p>“Sure. Do as you wish.”</p><br/><p>With this agreement, You XiaoMo immediately started digging out the rainbow stones. Though they were visible to the naked eye, they were actually buried under a layer of ice. He was afraid of damaging the rainbow stones, so he could only use a small knife to carefully carve away layer after layer of ice.</p><br/><p>The small knife was created from the Metal Swallowing Beast’s metal and was razor sharp. Gentle pressure was enough to cut through the ice like a hot knife through butter. Not long later, he had managed to acquire the rainbow stones. The fist sized stones lay quietly on his palm, gleaming with a rainbow of colors. He had originally thought them a kind of stone, but it was more like a watery sort of jelly, bouncing and wobbling as he prodded it gently.</p><br/><p>“Ling Xiao, do you think this is edible?” You XiaoMo stared at the ‘jelly’ with a hint of hunger. He was reminded of the jelly in his past life. Cold jelly was delicious, one of his favorite foods.</p><br/><p>Ling Xiao stared at him, replying with all seriousness, “You can try.”</p><br/><p>You XiaoMo rubbed his chin in embarrassment. He was just joking around. He didn’t have to answer him with such seriousness.</p><br/><p>The two entered the dimension together. This was the first time Ling Xiao had seen the tear in the dimension. It was now fourteen or fifteen centimeters wide. Though it was rather small, it hadn’t been very long. It wouldn’t take many years for it to double in size. The current size of the tear was already decreasing the production rate of the spiritual water in the lake. If it continued to grow like this, then the dimension might stop producing spiritual water altogether.</p><br/><p>The two arrived at the bank of the lake. By now, there was less than a quarter left.</p><br/><p>Originally, Ling Xiao and XiaoJi had used up two thirds already, then he had used more to facilitate his magic herbs’ growth, so there was less and less. The eye at the bottom of the lake didn’t seem any different from usual.</p><br/><p>You XiaoMo jumped down into the lake and arrived over to the eye. The eye was separated from the spiritual water by a thin, transparent membrane. Since he had never touched the eye before, he wasn’t sure if the dimension would be affected by removing it. He hesitated for a moment, unable to decide.</p><br/><p>“Try it. Put the rainbow stone in.” Seeing him so indecisive, Ling Xiao made the decision for him.</p><br/><p>You XiaoMo nodded. After the rainbow stone sunk into the spiritual water, rings of rainbow light began to pulse out. They didn’t reach far but the two seemed to merge as one. After seeing this, he added another rainbow stone into the thin membrane, the dimension suddenly began to shake.</p><br/><p>You XiaoMo startled, when he looked down again, the eye had merged with the rainbow stone.</p><br/><p>Ling Xiao grabbed his arm and pulled him onto the bank. They were both soaked, but neither of them cared. They both looked up at the tear as one. It was almost as if something were squeezing the fourteen centimeter wide tear, sparks appearing in the darkness.</p><br/><p>After a while, these sparks slowly sew the tear together. Soon enough, there was only a few centimeters left of the fourteen centimeter gap, before it vanished completely. It was like the tear had never been there in the bright sky before. Instead, there was something else whose existence definitely shouldn’t be possible.</p><br/><p>You XiaoMo’s jaw dropped. The sun!</p><br/><p>His dimension didn’t have a sun, but the sky was always bright and clear. Since the dimension wasn’t a part of nature or anything, he had never thought much about it. Now, with the rainbow stone, a sun had appeared. Yet, it wasn’t just the sky that had changed, but the entire dimension.</p><br/><p>The inheritance jewel of the You Clan was like a practitioner’s pocket dimension. It was generally just a flat space. A piece of land, an expanse of sky, a narrow, limited space. Yet now, the dimension’s scenery flashed before his eyes like a field of flowers.</p><br/><p>The edges of the dimension expanded rapidly, mountains and waterfalls, a whole range of them in the distance, dense forestry, as if home to thousands of wild creatures. Even the air had a fresh taste to it.</p><br/><p>After he managed to recover from his shock, he immediately thought of his magic herb field. Since his spiritual water had been decreasing by the day, he rarely planted any high level magic herbs, unless they were transcendent grade or he had use for them. Though there weren’t many, they were extremely valuable. If they disappeared, that would be a blow to his heart.</p><br/><p>Eventually, You XiaoMo spotted a beautiful terraced field at the bottom of the mountains. Starting from midway up the green mountain, patches of greenery with multicolored magic herbs shimmered under the sun, some matured, others not, but all emitting a wonderful herbal aroma. Seeing all the changes his dimension had gone through, You XiaoMo’s eyes were filled with wonder.</p><br/><p>“It seems like your dimension has evolved.” Standing beside him, Ling Xiao couldn’t hide the surprise in his eyes. No wonder the You Family made this dimension their Inheritance Jewel ever since ancient times. It wasn’t unreasonable at all. He had never heard of a dimension that could evolve, but considering how the foundations of the dimension were linked to the eye, then the fact that the rainbow stone had facilitated the evolution of the dimension wasn’t so absurd in the end!</p><br/><p>Hearing his words, You XiaoMo immediately ran back to the lake.</p><br/><p>As expected, the lake had also gone through a metamorphosis.The spiritual water was no longer clear. Instead, there were the hints of a rainbow swirling through the waters, like a lake shimmering with rainbow colors, beautiful under the sun and reflecting an eye-catching gleam. Apart from that, the eye had disappeared as well.</p><br/><p>Since the evolution of the dimension had caught his attention, You XiaoMo hadn’t noticed how the eye had disappeared, along with that rainbow stone. Though he didn’t understand it, it seemed to be a good thing.</p><br/><p>Testing the production rate of the lake, You XiaoMo found out that it seemed that it took the lake ten minutes to produce a drop. This was much better than before.</p><br/><p>Staring at the delighted smile on You XiaoMo’s face, Ling Xiao’s own lips curved upwards, a stark contrast to the worry that had plagued his expression for the past few days.</p><br/>\n</div>"}