{"title": "Chapter 713 - Grand Finale", "id": 713, "volume": 8, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-713-grand-finale", "volume_title": "Volume 8", "body": "<h1>Chapter 713 - Grand Finale</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 713: Grand Finale</strong></h2><br/><p>Translated by Yan of Exiled Rebels Scanlations</p><br/><p>Time passed quickly, and three years flew by.</p><br/><p>As the battlefield, Xi Jing was nearly destroyed to the point that it was impossible to continue living there after that war. Many of the remaining demon beasts had no choice but to move to other locations, and to this day, that large hole still remained.</p><br/><p>As time went on, Xi Jing finally more or less recovered, and the turbulence from the past years calmed down at last. After the tragic battle concluded, Xi Jing’s major powerhouses all entered dormant modes to rest and reorganize. They all lost a few clan members and disciples on the battlefield, and even though it hurt, they couldn’t do anything about it either. Furthermore, if it weren’t for Ling Xiao and the rest, there would most likely be many times more casualties, so everyone was still very grateful towards Ling Xiao.</p><br/><p>The head of the Demon Phoenix Clan was the first one to extend an olive branch of kindness towards them. They released Ling Xiao’s mother, Ji XiuXin.</p><br/><p>Originally, after Ji XiuXin broke the clan rules, she was going to be imprisoned for life, but because they owed Ling Xiao, the head of the Demon Phoenix Clan released her after discussing it over with several elders. They promised that she would be free from now on, and the Demon Phoenix Clan would no longer tie her down.</p><br/><p>After leaving, Ji XiuXin didn’t go find Ling Xiao. Even though it was because of Ling Xiao that she ended up being forgiven and received her freedom, what happened between her and Ling Xiao could finally be considered balanced, and they had nothing more to do with each other.</p><br/><p>After that happened, the chick, who was loaded down with heavy responsibilities, secretly ran away from the clan. He lazed about in the palace, refusing to leave. Strangely enough, the Demon Phoenix Clan, who was supposed to bring him back, didn’t make any movements.</p><br/><p>The True Dragon Clan and Black Turtle Clan also sent them friendly messages. Long Yue would occasionally run over to the Ghost Tomb Mountain Range and visit You XiaoMo, coming and going quite frequently. Fortunately, there were many rooms in the palace.</p><br/><p>As for the Black Turtle Clan, the baby turtle pretty much hung out in the palace all the time. He was still in the shape of a turtle, and he enjoyed crouching on You XiaoMo’s shoulders or head the most. At night, he would even guard the head of You XiaoMo’s bed, but most of the time he ended up being thrown out by Ling Xiao. As a result, he stubbornly refused to give up.</p><br/><p>Finally, the Qilin Clan. Needless to say, the Qilin Clan’s elders were still very smart. Since they withdrew beforehand, they had lost the least among the Four Ancient Beast Clans. Of course, if it weren’t for them withdrawing at the most critical moment, they definitely would’ve dropped from the top of the Four Ancient Beast Clans to the bottom. Later, the Qilin Clan didn’t actually choose a new Qilin Lord. Some people said that the position of the Qilin Lord was left for Ling Xiao. Besides him, nobody was qualified.</p><br/><p>As for Lin Tian, he disappeared after that war happened. Not only was he no longer in the Qilin Clan, he didn’t appear anywhere else either. Rumor had it that he was exiled by the Qilin Clan and basically found himself completely alone. In the end, that old man finally paid the price for his behavior.</p><br/><p>Three years of reconstruction later, the Ghost Tomb Mountain Range was no longer a dangerous place that frightened people. Instead, it become the location that developed the fastest in Xi Jing. White Bone Town became White Bone City, as its area expanded several times over compared to its original foundation. Now, it had already become a big city. In a short amount of time, White Bone City had leaped to become the biggest city in Xi Jing, and it was almost about to catch up to Central City.</p><br/><p>The reason was naturally related to the two who lived in Ghost Tomb Mountain Range. It was the greatest blessing to be in ‘close range’ with the two strongest and most respected experts in TongTian Continent.</p><br/><p>The news of Ling Xiao becoming the Almighty had long since spread all over TongTian Continent three years ago. From the very start, he had been the focus of much attention, and during the whole journey, many people had watched him, but they had never thought that he would become the master of all the planes.</p><br/><p>After the new Almighty appeared, the rules of the planes started to materialize.</p><br/><p>Ling Xiao overturned the original rules and set new rules in place. For example, the rules concerning oaths; before, one couldn’t casually pledge anything, and now, it was even more impossible, because if someone didn’t abide by their oath, the rules would immediately punish them. As for what the punishment was, just try it and you’ll find out.</p><br/><p>The other expert was You XiaoMo, TongTian Continent’s very first grade seven mage. The respect associated with his status was second only to Ling Xiao’s. In order to learn from him, quite a few grade six mages hardened their skin and went up to ask him for advice, including Lei Gong, Old Man Shen, and Cang Alliance’s Master Lai, all transcendent level mages. They couldn’t even be chased away.</p><br/><p>The most shameless ones were Lei Gong and Old Man Shen. At first, they unabashedly used Jiu Ye and Qiao WuXing, sending them over to try and coax the secret out of You XiaoMo. You XiaoMo and Ling Xiao didn’t know whether to laugh or cry.</p><br/><p>Besides that, several friends that You XiaoMo missed quite a bit also came to find him.</p><br/><p>They were Feng ChiYun and Yin Ge, who had disappeared for a long while. They had long since heard of what was happening in Xi Jing. Originally, they wanted to rush over, but because they were too far away and didn’t have anything convenient like teleportation talismans, by the time they made it over the war was already over. Only later did the two of them find out that that was the work of Yin Ge’s father, the Nine-Headed Snake Emperor.</p><br/><p>In reality, the Nine-Headed Snake Emperor had been paying close attention to them the entire time. He knew that a war would break out in Xi Jing, and he also knew that Feng ChiYun and Yin Ge would rush over for sure after finding out. So he purposefully made them go somewhere extremely far away so that they wouldn’t be able to make it back, very sinister! This was also the real reason why the Nine-Headed Snake Emperor didn’t accept the invitation. He was too busy keeping an eye on his son and ‘daughter’-in-law, where would he find the time to go participate in some war!</p><br/><p>In the end, they all stayed temporarily at Ghost Tomb Mountain Range, helping You XiaoMo’s da-shixiong and second-shixiong rebuild White Bone City.</p><br/><p>Finally, the Black Spider. After Lin ShaoYi and Zu Ma died, the Black Spider immediately dissolved. Even though they had suffered many casualties, some of the remaining people were still placed on the wanted lists, including Su Lang and Yan Hui. Without the Black Spider binding them together, the two people who loathed each other parted ways, no longer caring what happened to the other.</p><br/><p>You XiaoMo occasionally heard some information about them. After all, both of them had extremely high cultivation bases, and it was impossible for them not to do anything. Furthermore, TianGou’s information net was becoming more and more perfected. It wasn’t hard to investigate what the two of them were up to. However, he didn’t tell anyone to do anything against them, as he didn’t harbor any grudges against them in the first place, so why bother making more trouble!</p><br/><p>But even though he didn’t want trouble, his dad came to make trouble for him anyway.</p><br/><p>After thinking for several years, You JunQi finally discovered that he had been screwed over by his own son. When protesting failed, he threw down the mess that was the Vermillion Blood Clan and ran away once more, only telling someone to send You XiaoMo one sentence — your dad quit!</p><br/><p>You XiaoMo couldn’t do anything about it, so he could only ask Tian Dao to help You XiaoMo find someone shrewd to help him take over the Vermillion Blood Clan for now. In any case, with his and Ling Xiao’s current positions, it would be impossible for anyone who was still unwilling in the Vermillion Blood Clan to have any devious thoughts.</p><br/><p>After three years of chaos, would their days finally calm down?</p><br/><p>In their dreams!</p><br/><p>The bright and pure moon hung over the tip of the mountain, since there were no trees, only the peak of the mountain. A furious howl came out of the magnificent palace once again, shocking the moon to the point that it seemed to shake a few times before secretly ducking behind the mountain.</p><br/><p>Upon hearing this, the people who lived in the palace only paused for a moment before continuing their business at hand as if nothing had happened. Every so often, this kind of thing would always happen to the couple who would often display PDA in front of them. Every time, the reason was different, and as time passed, they all grew numb to it.</p><br/><p>You XiaoMo kicked open the door before charging in, full of energy, making a beeline straight for the certain somebody lying sideways on the bed. Without even taking off his shoes, he jumped on the bed and hauled Ling Xiao up, accusation written all over his face. “How many times have you eaten my magic pills now? Even though you clearly knew that I prepared it for someone else. Do you know that I’ll have to make it all over again?”</p><br/><p>Ling Xiao calmly shot him a glance, allowing You XiaoMo to haul him up. After that, he asked easily, “Wife, is your friend more important, or your husband?”</p><br/><p>“Don’t change the subject. Those are two different things. Now that you ate them all, I have to spend even more time to make them. I’m very busy!” You XiaoMo almost blew his top. Every time he questioned Ling Xiao, the other always responded with the same thing.</p><br/><p>Ling Xiao’s expression didn’t change. “Wife, do you still remember what you once agreed to do for your husband? You said that you would refine pills for your husband every single day. Have you completely forgotten your promise from back then?”</p><br/><p>“What the hell! You still have the nerve to bring that up?” When You XiaoMo heard him bring up what happened back then, he knew that Ling Xiao was clearly just trying to bully him since You XiaoMo didn’t know anything and was screwed over back then because of it. If he allowed this to continue, he would definitely become stupid. Even though Ling Xiao never brought this up before, now he actually wanted him to hand over high level and transcendent level magic pills the same way he did with low level magic pills? How would You XiaoMo have that much time to refine pills for him?</p><br/><p>Ling Xiao’s hand had already moved to his waist. He didn’t refute his words; he only said, “Alright, even if the promise back then is invalid, you still have to attend to your husband’s needs.”</p><br/><p>“When did I ever not attend to your needs? Don’t slander me.” You XiaoMo glowered at him unhappily. During these past few years, he didn’t actually refine transcendent level magic pills all that often, but each and every time he did, wasn’t it for Ling Xiao? Was that not attending to his needs? Give him an inch, and he’ll want a mile!</p><br/><p>“Okay. In order to prove that it isn’t slander about my wife, then I ask that my wife attends to the husband’s needs right now.” As he spoke, Ling Xiao’s groping hand had already touched his butt.</p><br/><p>There were black lines on You XiaoMo’s face, and he immediately felt something both hard and hot beneath his butt, shamelessly poking him. It turned out that everything that happened before this was just a prelude for spreading the bed sheets. Ling Xiao’s real objective was to satisfy his lust. You XiaoMo immediately started to struggle, wanting to get up, but as a result, he was tossed aside by a certain person and pressed beneath his body.</p><br/><p>Ling Xiao took off his shoes very efficiently. But he forgot that his wife was still angry, and during a moment when he was caught off guard, he was kicked in the groin. His expression immediately changed.</p><br/><p>When You XiaoMo saw him hunch over, as if in a lot of pain, he hastily withdrew his leg. The one who was originally in the right was You XiaoMo, but now he felt guilty. After a while, he said, embarrassed, “Are… are you okay… ah…”</p><br/><p>His last word hadn’t left his mouth yet when one of his legs was suddenly lifted with explosive power. With a rip, his pants tore, and even worse, it tore straight in the middle, revealing both of his butt cheeks and the thing lying soft and asleep between his legs. When the cold air entered, it immediately trembled.</p><br/><p>You XiaoMo was given a huge fright. He was about to crawl up when there was suddenly a heavy slap on his pale butt cheeks. The sound of the slap was extremely sharp and crisp. Even without looking at it, he knew that there would definitely be the shape of five fingers imprinted on the skin. The guilt from before immediately vanished.</p><br/><p>He was about to curse when a hand suddenly gripped his jaw, and soft lips bit down on his. It was really a bite, and it was about to ache when a moist and hot tongue instantly slipped into his mouth. It wasn’t gentle; it could be considered plundering and overbearing. Next, he felt another hand slip over his butt and between the seam as a finger gently pressed a few times against his entrance before the tip slowly pierced inside…</p><br/><p>“Ah… get it out…” You XiaoMo sucked in a breath of air. He wanted to struggle, but he had no strength to do so, so he could only allow that finger to move in and out of him. After a short while, he went weak, and he could even feel the different joints in the man’s finger, making him blush.</p><br/><p>His expression changed very quickly.</p><br/><p>The man took off his pants, pressing his stiff rod against You XiaoMo’s entrance, both hot and hard. You XiaoMo didn’t have time to react before he felt himself being stretched open. The feeling of something foreign invading him couldn’t be described as wonderful, but it didn’t hurt very much either. His body immediately went soft, both of his legs like rubber.</p><br/><p>“Bastard, you tricked me!”</p><br/><p>A member so full of energy, how was it like something that had gotten injured!</p><br/><p>You XiaoMo was remorsefully fooled once again. He took back all of his guilt and sympathy. Liar!</p><br/><p>“That’s right, I’m a bastard. And you’re a bastard’s wife!” The man buried his face in You XiaoMo’s neck, letting out light laughter, exhaling the heat of his breath against You XiaoMo’s ear, which immediately flushed red.</p><br/><p>You XiaoMo tilted his head, so angry that he wanted to bite him. But when he opened his mouth, the man immediately thrust all the way in to his deepest parts, and You XiaoMo immediately lost the ability to speak. With the strength and speed of the man’s rough thrusting, fragmented moans poured out of his mouth. “Mm ah… slow down… too fast…”</p><br/><p>The man’s response was for his movements to grow even rougher. Every time he thrust in, it basically reached his deepest area, very quickly turning You XiaoMo into a puddle of water. The wet sound also grew louder and louder, as if the quiet night came with a loudspeaker. When the shameful noises arrived at You XiaoMo’s ears, he had long since forgotten who he was.</p><br/><p>The man picked him up, pulling him into his embrace.</p><br/><p>“Mo… you are mine!”</p><br/><p>【The End】</p><br/><p>And that concludes the main story of Boss and MoMo. Don’t worry though, their adventure continues for 18 more chapters. So make sure you’re ready for more smiles and laughter at the antics of these two clowns. </p><br/>\n</div>"}