{"title": "Chapter 722 - Yet Another Truth", "id": 722, "volume": 8, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-722-yet-another-truth", "volume_title": "Volume 8", "body": "<h1>Chapter 722 - Yet Another Truth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 722 (Extra 9) : Yet Another Truth</strong></h2><br/><p>Translated by Kollumceti of Exiled Rebels Scanlation</p><br/><p>“I also didn’t wish for it to happen like this. But when I see him, it’s just like I’m seeing XiaoMo. I feel so sad and remorseful once I think of him. It’s all my fault. I shouldn’t have neglected him all the time. As a result, it caused him to die so early. Wuwuwu…” Mother You began to cry as she spoke. The makeup she had just put on her beautiful face was ruined by her tears. A weeping beauty – this phrase totally described such a classical beauty like her.</p><br/><p>Father You wrapped his arm around her shoulder and sighed. It was not that he did not feel regretful, it was just that his son could not come back no matter how much he regretted it.</p><br/><p>Mother You suddenly broke away from his embrace and loudly condemned him, “It’s all because of you! I shouldn’t have listened to you at the beginning. What ‘doing this is the best method for our son’?! In the end?! His life ended just when it was supposed to start! It’s all your fault, give me back my son! Wuwuwu…”</p><br/><p>“Yes, yes, yes, it’s all my fault!” Father You did not hesitate to assume this blame. His tone even seemed to carry a little proficiency, as it was not the first time this was happening.</p><br/><p>Sure enough, it was not the first time. Mother You used to think of her late second son every few days and then she would cry and scream. The one who suffered from her outbursts every time was Father You. He would find himself in serious trouble if he dared to retort. So over these years, his lesson from these experiences was admit that it was his fault no matter whether he was in the right or wrong before speaking up.</p><br/><p>However, he never expected the actions of that young man surnamed Fang to resemble their second son so strikingly and evoke his wife’s sad memories. Originally, he had already coaxed her into calmness, but now it seemed that it was impossible for her outburst to end in a short time.</p><br/><p>Father You was a little upset. If he knew it would be like this, he wouldn’t have let those two people eat at the same table with them. He should have let the housekeeper prepare another table for them.</p><br/><p>Father You pulled his beautiful wife into his arms again and whispered, “My dear, I really didn’t want to do that too. But that was our only choice in the case of our son. Otherwise, could you bear to watch him slowly grow old and die in front of you in the future? That feeling would be extremely painful. You also don’t want your son to resent you in the future, do you?”</p><br/><p>Mother You’s tears fell again. Of course she didn’t want that. In fact, she also knew that she was not completely absolved of the blame in this matter.</p><br/><p>She was totally dumbstruck when they found out that XiaoMo had no talent for cultivation. An inability to cultivate meant that he would slowly grow old one day. A human’s lifespan was only a hundred years, but in their eyes, a hundred years was just a snap of the fingers.</p><br/><p>She could bear this blow and was unwilling to accept the fact that her son would slowly die of old age. So she focused all her energy on her youngest son after You Bo was born, and stopped paying attention to her second son, turning herself into a heartless mother.</p><br/><p>However, she said she would never have done this no matter what if she had known her second son would die so early. She had never given her second son a warm embrace in the eighteen years he had been alive. It was really such a negligence of her duty as a mother!</p><br/><p>The drama was continuing without end on this side.</p><br/><p>On the other side, You XiaoMo had a totally wooden expression. He was now only realizing that he had been living his whole life in a world his parents had spun for him on their own initiative. They never asked for his opinion about this so he died in such a mysterious manner.</p><br/><p>They kept on saying that it was for his own good, but how would they know if it was what he wanted when they weren’t him? It was because of this self-righteous way of thinking that such a tragedy occurred. Unfortunately, there were still many parents who still thought that their actions were for the good of their children.</p><br/><p>The information contained in their dialog was too much for You XiaoMo to process for a while. Based off their meaning, it seemed that they had arbitrarily decided on his fate because he did not have a spiritual root. However, the result of their decision was to deal with him coldly?</p><br/><p>You XiaoMo could not understand it at all.</p><br/><p>“If I’m not mistaken, your parents wanted to slowly use time to dull your feelings for them, so that it wouldn’t be so painful when you had to part in the future.” Ling Xiao analyzed.</p><br/><p>“Part?” You XiaoMo did not really understand.</p><br/><p>Ling Xiao explained, “Your lifespan would only be about a hundred years if you’re a mortal and you’d die sooner or later. Your parents and brothers would not grow old or die because of their cultivation. When you get old, how will you feel when you look at their youthful appearances?”</p><br/><p>“I’ll probably be very sad, and maybe even harbor a grudge against them.” You XiaoMo replied. If his family members did not need to experience birth, death, illness and old age, yet he was the only one who would, he would certainly think that he was abandoned by his family.</p><br/><p>“So, they only had two methods. One of them was to think of a way to experience birth, death, illness and old age together with you and let you live in peace and security till the end of your life. The other was to disappear in advance before your death. Since they dealt with you coldly, I think the latter is more likely. This way, you would not feel too sad even if they suddenly disappear in the future.”</p><br/><p>You XiaoMo’s eyes widened with incredulity. The thought of them disappearing was too frightening to bear. He could not imagine that scene. If so, he would rather die early than live a lonely life by himself.</p><br/><p>There was no need to answer the question as for why he had no talent for cultivation. Earth was a Lower Level Realm, so it was normal for their methods to be so backwards.</p><br/><p>“I really can’t accept their way of doing this.” You XiaoMo seriously stated.</p><br/><p>“As parents, their way of handling this was really not good enough. There are too many hidden dangers. If it were me, I would send the child away after birth and let him live an ordinary life as a mortal. I can only say that they were not smart enough.” Ling Xiao shrugged his shoulders.</p><br/><p>You XiaoMo looked askance at him, “I know, you have a high IQ. But I think it’s because you don’t have children, so you are unable to understand the feeling of sending your own flesh and blood away.”</p><br/><p>“So you’re speaking up for them now?” Ling Xiao raised an eyebrow.</p><br/><p>You XiaoMo, “…No.”</p><br/><p>Ling Xiao, “What do you intend to do next? Do you want to reunite with them?”</p><br/><p>You XiaoMo fell silent. It was a little difficult for him. He felt uncomfortable to reunite with them like this as he had not forgiven them completely. Especially so after knowing that his family had been hiding this secret from him. He had to say that his father and mother’s plan was really successful. He already could not get close to his parents like a normal person.</p><br/><p>“Let’s just… wait some more…”</p><br/><p>“Sleep then.” Ling Xiao picked him up and walked over to the double bed. Although the arrangement was only one person to a room, the guest rooms of the You Family were very large.</p><br/><p>You XiaoMo sighed, “I can’t sleep now.”</p><br/><p>Ling Xiao put him on bed and divested him of his clothes while saying, “It doesn’t matter if you can’t sleep. Let’s do something beneficial to your physical and mental health. I can guarantee with 100% effectiveness that you won’t have anything to be worried about.”</p><br/><p>You XiaoMo took a deep breath. Then he caught Ling Xiao off guard as he kicked him with one foot. Furthermore, it was also directed at his vital part. You XiaoMo’s kick was extremely fast. He did not have the slightest mercy at all.</p><br/><p>Ling Xiao immediately raised his hand and blocked it. He laughed, “Murdering your husband? If you break it with your kick, your future benefits will be gone.”</p><br/><p>“That’s alright. Even if you don’t have it, it’s alright as long as I have it.” You XiaoMo rubbed his nose, then dashed over with bared fangs and brandished claws.</p><br/><p>Ling Xiao quickly dodged and seized the opportunity to push the person onto the big bed. Then he speedily pressed him down and teased, “You want to use your cucumber? Can you get it to stand up, huh?”</p><br/><p>You XiaoMo was furious. This was just doubting his pride as a man! He immediately straightened his back, “Who says I can’t get it to stand up? Take a look at it yourself, it’s all hard.”</p><br/><p>Ling Xiao ‘oh’ed, and then grasped his little son in one hand and kneaded it several times. As expected, it had begun to harden, but it was still far from enough, “Wife, yours is only fit for decoration.”</p><br/><p>You XiaoMo sent a slap at him, but before it could fall onto Ling Xiao’s face, he suddenly moaned as his limbs went limp. When he saw his little son fall into the hands of the man, he found that he had done something stupid again. What else could this be but a lamb wandering into the tiger’s den? Fancy that he thought the opportunity for his counterattack had come.</p><br/><p>This night, he had his wish fulfilled and was tormented till midnight.</p><br/><p>You XiaoMo should rejoice that the soundproofing of the room was strong enough, otherwise the entire You family would know that two men were rolling naked between the sheets in the room.</p><br/><p>The next day, You Lu and You Bo were present at the table other than the two parents of the You family. Breakfast was delicious steamed buns and soybean milk made by Chef Lin. The spread smelled extremely fragrant.</p><br/><p>You XiaoMo glanced at You Lu and You Bo and only started to eat after seeing them begin. There was not just one type of filling for the steamed buns, but eight different flavors. It was difficult to ignore them even if he wanted to. He picked his favorites which were seafood and corn, and did not even touch the others. This was yet another mistake.</p><br/><p>After breakfast, the two brothers prepared to head out.</p><br/>\n</div>"}