{"title": "Chapter 731 (END) - The Qiu Team", "id": 731, "volume": 8, "url": "http://boxnovel.org/the-legendary-master%E2%80%99s-wife-chapter-731-end-the-qiu-team", "volume_title": "Volume 8", "body": "<h1>Chapter 731 (END) - The Qiu Team</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2><strong>Chapter 731 (Extra 18) : The Qiu Team</strong></h2><br/><p>Translated by Jouissance of Exiled Rebels Scanlations</p><br/><p>Though Earth was billions of times smaller than the TongTian Continent, You XiaoMo didn’t plan on leaving after just a month or two, so he bought a mansion in the city center to live in with Ling Xiao.</p><br/><p>Occasionally, You Bo and You Lu would come and visit. Mother You would drag Father You over every now and then as well. Even when all four of them came over, the mansion would still feel very empty, until one day, it suddenly became full of life.</p><br/><p>“PiQiu, didn’t I tell you to throw your trash in the bin?” You XiaoMo glared angrily at the seed shells all across the floor. He had taught the other how to eat the roasted seeds. At first, PiQiu had eaten them with the shell on, but soon learned to spit out the shell, but he was very messy with it.</p><br/><p>“Sorry!” PiQiu hung his head in guilt. He thought it was too troublesome to make sure he spat the shells onto the table, so he couldn’t help but spit them wherever he liked when his master wasn’t looking. He hadn’t thought that his master would come back early.</p><br/><p>“Dear son~” You JunQi sat on the couch eating watermelon and blinking at him innocently. “PiQiu is just feigning innocence to get your sympathy again. Don’t fall for it!”</p><br/><p>You XiaoMo replied irritably, “You’re no different.”</p><br/><p>You JunQi pouted.</p><br/><p>You XiaoMo ignored him. That was when the Metal Swallowing Beast suddenly jumped onto his head. After so long, he was still as small as ever. Though he couldn’t assume a human form, PingPongQiu were in the same situation, so he wasn’t lonely.</p><br/><p>“Awrooo….” The Metal Swallowing Beast cried out desperately before jumping down and tugging on his sleeve, heading for the stairs.</p><br/><p>You XiaoMo helplessly followed him to the second floor to see what he wanted. When he was dragged into the room, he saw PingPongQiu on top of a pile of clothing, rolling around. He had no idea what they were doing. It was only when he got closer that he realized it was their clothing and couldn’t help but laugh.</p><br/><p>Ever since his Qiu Team had come to Earth, they had all gone by the idea of “do as the Earthlings do”, wearing human clothing and all looking completely human, but that was for PiQiu and co. After all, they could assume a human form, but the Metal Swallowing Beast and PingPongQiu couldn’t, so they had no human clothing to wear either.</p><br/><p>The three refused to accept this. No matter what, they wanted to wear clothes as well!</p><br/><p>You XiaoMo could only get someone to tailor make them several sets of miniature clothes. The tailor had thought it was for a toy or a pet, laughingly commenting on his surprise at You XiaoMo’s hobbies.</p><br/><p>Today, the clothes had arrived, and they couldn’t wait to try them on.</p><br/><p>You XiaoMo first chose a dark blue outfit for the Metal Swallowing Beast. There was a zipper, and it was made of very elastic material. It covered him apart from his little head, limbs and hindquarters. It was pretty easy to put on. However, PingPongQiu’s clothes were more troublesome. They were too small. You XiaoMo had almost gone cross eyed, trying to help them into their clothes. It took him half an hour before he was done. Gazing at the three attired little demon beasts, he started chuckling.</p><br/><p>“You’re all looking rather fetching.”</p><br/><p>The three immediately went off to show off their new clothes. The sounds of mahjong could be heard from the living room. There were two mahjong tables, eight people in total, all solemnly staring at their tiles. Someone out of the loop would probably think a disaster was on the horizon, looking at their faces.</p><br/><p>You XiaoMo felt a sense of helplessness. Ever since he had taught them Mahjong, they had become addicted to the game. They were full of energy despite having already been playing for a full two days and one night, and still hadn’t had enough.</p><br/><p>SheQiu’s fingers closed on a one of characters tile, hesitating on if he should throw it or not. Quite a few character tiles had been played already, especially the one in his grasp right now. The other three one of characters had been exposed already. He had the last one in his hand. The risk was low. Then he tossed the characters tile. “One of characters.”</p><br/><p>“Mahjong!” XiaoHei pushed out his hand for all to see, expression cold.</p><br/><p>SheQiu sucked in a breath. This guy was just waiting for a pair, and it was a thirteen orphan hand, too. “What’s wrong with you. You really dared to bet on such a tiny chance for the characters tile?”</p><br/><p>XiaoHei glanced at him emotionlessly, his gaze saying, “So what if I dare. Bite me.”</p><br/><p>The Giant Roc and MaoQiu let out a breath of relief. Thank god it wasn’t them, otherwise it would be a lot of money to lose. XiaoHei really was ruthless and resolute. If SheQiu had kept the one of characters in hand, then there would be no way for XiaoHei to win.</p><br/><p>The other table was much less intense, the players being LanQiu, CatQiu, XiaoJi and the Weasel Beast.</p><br/><p>The four sat quietly, but their gazes were sharp, glancing warily at the others every now and then. They kept their tiles carefully concealed. Even the most docile of the three, the Weasel Beast, was influenced by them, also getting tense. It wasn’t until CatQiu prodded him that he realized it was his turn to draw.</p><br/><p>The Weasel Beast rubbed his hands together and then carefully drew his tile. He rubbed his fingers over the tile, but he couldn’t figure out what was carved there. After all, he had only just recently learned how to play. He shifted his thumb and took a look, his heart leaping and his gaze blurring. He shook his head to clear it, widening his eyes. It of a five of bamboos.</p><br/><p>The Weasel Beast looked down at his hand, feeling rather disappointed. He was about to call out Mahjong, but the tile he needed was six of bamboos, not five. So close! He had gotten excited for nothing.</p><br/><p>The other three carefully took note of his reaction.</p><br/><p>CatQiu squeezed his shoulders, eyes fixed on his hand and mumbling who knows what. None of the others could hear him, only he knew what he was saying.</p><br/><p>Across from him, XiaoJi’s childish face held a wicked smile, eyes looking around as if plotting something.</p><br/><p>Only LanQiu was frowning at his tiles, not seeming very satisfied. However, he might just be pretending. After gaining some experience, they were even more crafty than humans, suspicious and unwilling to be tricked. Now, it was all up to see who had better skill.</p><br/><p>Just as the Weasel Beast was about to throw out his ‘five of bamboos’, a cough sounded behind him.</p><br/><p>The Weasel Beast looked around, and saw his master looking at him with a smile. “QiQiu, you’ve got to look clearly before playing your tiles. Sometimes, what your eyes can see isn’t what’s really there. It might be an illusion.”</p><br/><p>With that, You XiaoMo’s sharp gaze looked towards CatQiu and XiaoJi.</p><br/><p>CatQiu’s gaze began to drift, not daring to meet his master’s gaze, while XiaoJi looked down at his own tiles.</p><br/><p>The Weasel Beast seemed to realize something. When he looked back down at the tile in hand, the five of bamboos had become a six of bamboos. Delighted surprise bloomed across his face and he didn’t even bother wondering about what had just happened, throwing out the tile and yelling, “Self-drawn Mahjong! Same suits!”</p><br/><p>CatQiu and XiaoJi glared balefully at You XiaoMo.</p><br/><p>You XiaoMo raised an eyebrow. If you’re going to play, then play fair. What can cheating prove?</p><br/><p>That was when soft footsteps came from behind. Not long later, the owner of these footsteps appeared in view. A shockingly beautiful aristocratic lady walked in, carrying a huge bunch of gifts. Upon seeing him, her eyes lit up. It was Mother You. She didn’t hesitate to run over, calling out, “Darling…”</p><br/><p>You XiaoMo startled and cursed in his heart right before a heavy weight jumped on him, hugging him tightly, territorially, before scowling and glaring at Mother You, yelling back, “Darling my ass. Stop being so intimate. He’s my son, not your darling!”</p><br/><p>Mother You’s expression froze on her face, glaring balefully. She had yet to receive a single word of forgiveness from her son, but she refused to give up. She believed that her sincerity would, one day, win her son’s favor.</p><br/><p>Yet this dream hadn’t even come true when, out of nowhere, appeared a man who fought with her over her son. Not only did he say that her son wasn’t hers, he was possessive, too, not even letting her touch You XiaoMo at all. You XiaoMo was her son! Though he had a different body now, he was still her son. That would never change!</p><br/><p>You XiaoMo stood there speechlessly. Every now and then, this scene would have to repeat itself. How troublesome!</p><br/><p>The gifts Mother You brought was quickly distributed between everyone. To try and gain her son’s favor, Mother You had gone and figured out everyone’s likes and dislikes and would bring a lot of stuff for them every time she came. Father You had become her mover.</p><br/><p>Half an hour later, the two were still facing off. To turn their attention away from him, he brought out a third Mahjong table and had his cheap dad and Mother You play against each other. He dragged in Father You and the gluttonous PiQiu as well, a perfect four for a game of Mahjong.</p><br/><p>Hearing that they were going to play Mahjong against each other, You JunQi and Mother You exchanged a look, sparks flying. They hadn’t even begun yet and they were already fighting with their glares, neither of them willing to back down.</p><br/><p>You XiaoMo ran for it. So long as they weren’t paying attention to him, he didn’t care. Let them tear each other to shred over the Mahjong table. Even if they blew a hole in the roof, he wouldn’t mind.</p><br/><p>Ling Xiao just happened to come down the stairs then and see him running, laughing at him unapologetically, “I told you. didn’t I? Your dad gets jealous very easily, but you didn’t believe me.”</p><br/><p>You XiaoMo wiped imaginary sweat off his brow. “And you don’t know to help me.”</p><br/><p>He obviously knew that Papa You got jealous easily. Since he had brought all of the Qiu Team over, he knew that if he left his cheap dad, then he’d be cursed to death before he even managed to leave. His dad was very powerful. However, there was one thing he was surprised at. His cheap dad should’ve figured out his identity by now, but the other never brought it up, as if he didn’t know. The only change was that he was acting more and more like a damn pedophile.</p><br/><p>You XiaoMo personally cooked dinner for everyone, but he didn’t make a full meal.</p><br/><p>His Qiu Team was full of carnivores. They had ate plenty of fruit while playing Mahjong today, and were all baying for meat. Because of this, You XiaoMo had to go to the market and buy a truckload of meat. An outsider would probably think he was planning on opening a butcher’s shop or something, but You XiaoMo wasn’t even sure if he had bought enough to feed them.</p><br/><p>Meat naturally had to have wine to accompany it. You XiaoMo took out over ten casks of high quality alcohol. Some were from the auction from before, the others he collected after. After all these years, the spiritual water in the dimension had recovered two thirds. He didn’t need to water his magic herbs with the spiritual water anymore, so he buried a lot of alcohol there.</p><br/><p>The aroma of alcohol had everyone’s mouth watering. They all wanted a cask to themselves, only abstaining when You XiaoMo hit them.</p><br/><p>High quality alcohol like this would hit hard. CatQiu, PiQiu and them couldn’t really drink. Just a few sips and they’d be blackout drunk. A whole cask? Were they trying to die?</p><br/><p>The huge barbecue lasted almost until nine in the evening, and it was only then that You Bo and You Lu arrived to join them. The two were extremely busy, so they were rarely seen. The only reason You XiaoMo could see them this often was because the two would squeeze time out of their busy schedules to visit.</p><br/><p>As soon as they entered, they could smell the fragrance of high quality alcohol.</p><br/><p>Following the scent, they saw people strewn all over the garden, most of them lightweights. Some were snoring loudly. You XiaoMo had no choice but to help them all back inside and then shut the door to make things quiet.</p><br/><p>You Lu paused for a moment before going over to help.</p><br/><p>You Bo didn’t join them, instead heading towards the table with the alcohol on it. He saw Ling Xiao when he approached, on a deckchair and sipping at his alcohol, relaxed. He acted as if he hadn’t noticed You Bo.</p><br/><p>You Bo frowned slightly. “Sitting here drinking instead of helping him, are you really his man?”</p><br/><p>Ling Xiao looked over, black eyes gazing at him. His gaze made the other frown and then he smirked mockingly. “If I’m not, then who is? You?”</p><br/><p>You Bo expression shifted.</p><br/><p>Ling Xiao side-eyed him, his smile malicious. “You will never have any chance.”</p><br/><p>You Bo’s expression crumpled, opening his mouth to retort when a hand suddenly came down on his shoulder. He turned to see that You Lu had come over without him noticing. The other looked at him and shook his head lightly before dragging him off despite his reluctance.</p><br/><p>After a while, You XiaoMo came over. “What did you say to You Bo?”</p><br/><p>Ling Xiao pulled him onto his lap, placing his chin on the other’s shoulder and nuzzling his nape, causing him to laugh at the ticklish feeling. “I didn’t say anything to him.”</p><br/><p>“Then how come he looks so tilted?” You XiaoMo didn’t believe him.</p><br/><p>Ling Xiao thought for a moment. “He probably stepped in shit.”</p><br/><p>You XiaoMo: “…”</p><br/><p>THE END</p><br/><p>Translator/Editor Notes:</p><br/><p>Thank you everyone for reading until the very last chapter. Although we picked up this novel at chapter 185, it has been a crazy time doing these last 547 chapters of LMW. We really appreciate all of the continued support from everyone until we made it this far. LMW will always have a special place in my heart as it is the first Chinese novel ExR ever decided to translate.</p><br/><p>Many of you probably do not know the backstory as to why we began translating LMW. Back in 2017, Rara was gushing about reading a long novel for the 5th time. She got YuanYulin interested in reading the novel and they both began spamming our group chat with conversations about each chapter. Sometimes it would just be the two of them talking about how  (LX aka Boss) was being mean to  (YXM asks MoMo) but it was mainly laughter at the antics that occurred in each chapter. They would spam hundreds, if not a thousand, comments by themselves over LMW.</p><br/><p>Feeling left out (lol), I asked them which novel it was, and to my surprise, found out it had a little over 180 translated chapters in English from S3ri. Taking a little under two weeks to finish the chapters, I was sad to see that the last update had been quite a while before. I begged Yuanyulin to translate 185 for me so I could continue reading and stay in the loop with the story. Once she finished 186, we saw that S3ri was looking for someone else to take up the series and decided, ‘hey, we’re translating it anyway for our own amusement, so why don’t we share it with the rest of the readers too?’ And then our site was born.</p><br/><p>We continued to grow from there, adding translators, adding series, adding memories. It’s been a long run with LMW, and now we have finally crossed the finish line. Although this was all started just so I could continue reading, I’m glad my decision got us this far and expanded the English reading Chinese BL novel fanbase. We hope you continue to support us as we begin new novels and share new laughs and romance. So once again, thank you from the bottom of my heart, without readers, none of us would be here.</p><br/><p>Addis</p><br/><p>I loved the novel when I was reading it but started to hate the grammar, vocab, and Chinese in general translating it…I also joined when we decided to do it daily, so I pushed through hell for this project. Thanks to Addis for making my shitty trans readable. I will never understand tenses. (Btw, by my hands, the Addis alarm was born – proud procrastinator)</p><br/><p>Crystal</p><br/><p>Let just say this was a tease gone wrong ._. Never play with karma, folks, never think you can escape from karma TT&gt;TT I never expect the whole “teasing with Addis” session would blow up to this scale tho and make Chinese side a thing…KARMAAAAAAA!Also +1 to the upper floor, will never understand tenses.</p><br/><p>Ra the undead fairy</p><br/><p>Even though I joined the project last, I’m really glad I got to work on LMW and meet everybody else ^0^/ I admit it was a lot more intense than I was expecting LOL but I enjoyed following our cute couple through their journey &lt;3 I hope that everyone will continue to follow us as we begin on our next novel hehe</p><br/><p>Yan</p><br/><p>Wow, looking back, it has been a really long journey. I started translating this when ExR had released around chapter 250. After much blood, sweat and tears (and a couple of holidays in between – I remember having to do 2 chapters in one day to make sure there’s enough coverage when I was away…T^T), this monstrosity (so long I nearly died) of a novel is finally over! Having said that, I have to admit that I am a little sad that the adventures of Momo and Boss are ending. The antics of this CP will be missed. Much thanks to Addis, Joui, Crystal and Yan (arranged in the order you joined, lol) for all your help. Thanks to all the readers who stuck with us too. Hope you’ll enjoy our next novel just as much as this.</p><br/><p>Kollumceti</p><br/><p>This novel was a great read, but a damn pain to translate lmao. The occasional absolutely fucked wording, the misuse of chengyu, the unnecessary sentences, the strange as fuck metaphors, the typos, the cultivation terms… all the things you don’t pay much attention to while reading just stabs you in the eyes when you translate it. On one hand, it was a pain, on another, it’s basically the foundation of my time with ExR. I have to say I’m glad it’s over, but it holds a special place in my heart and honestly, all that work was definitely worth it. . It’s not the longest novel I’ve worked on, but it’s the first one of this size I’ve stuck with until the end, as well as the second novel I’ve ever worked on. Thanks for sticking with us throughout this novel and I’m glad to have the chance to have joined the team and helped out~</p><br/><p>Jouissance</p><ul class=\"wp-block-gallery columns-3 is-cropped\" data-carousel-extra='{\"blog_id\":1,\"permalink\":\"https://exiledrebelsscanlations.com/lmw-chapter-731/\"}'><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li><li class=\"blocks-gallery-item\"></li></ul><figure class=\"wp-block-image\"></figure><br/><p>First chapter of our new novel, I am a Chef in the Modern Era (CME) will be posted April 1st, 2019.</p><br/><p>Lin ShuYi was sentenced to death by the traitorous Emperor for a treasonous crime he didn’t commit. Before drinking the poisonous wine on the execution ground, he stared up at the snow falling from the sky and said to himself, “This is for the best, I will be a cook in my next life! I miss roast chicken…”</p><br/><p>Then he woke up inside a body of a teenager in an era completely different from his past life. After that, he mets a nice old man who owns a small restaurant. Completely lost in this new modern world, he found that the only thing that would never change, no matter where one lived, was cooking.</p><br/><p>Thus he picked up the promise he made to himself, to be a chef in this life.</p><br/>\n</div>"}