{"title": "Chapter 1 - My Friend, You Are Dead", "id": 1, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-1-my-friend-you-are-dead", "volume_title": "Volume 1", "body": "<h1>Chapter 1 - My Friend, You Are Dead</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yao Si felt that there was something wrong with her recently. She used to sleep like a brick, so even roaring thunder couldn’t affect her slumber. But oddly enough, she couldn’t seem to fall asleep for the last couple days, and what was even more strange was that she felt energetic and in good spirits despite the sleepless nights.</p><br/><p>Her back was no longer sore, her legs weren’t weak, and even menstruation which had been bothering her for years ceased to visit her. She could climb ten flights of stairs effortlessly in one breath.</p><br/><p>Her diet was even more magical. She used to love chili pepper all her life, but now her stomach got cramps at the sight of their bright red color.</p><br/><p>Initially, she thought it was just weakness in the stomach and spleen induced by her insomnia, but as time passed, she realized it wasn’t that simple. It wasn’t only pepper that she no longer could stomach. She had lost her appetite for food as if she had anorexia. Food tasted as dry as dust in her mouth, retaining of its original flavor. There was, however, an exception. It was something which she wouldn’t have even spared a look for before, let alone consume it – duck blood curd.</p><br/><p>“Hey girl, you’ve been staring at my duck blood for half an hour already, are you going to buy it or not?”</p><br/><p>“Huh?!” Sisi was stupefied. Her eyes were glued to the red substance on the stall, and she was unable to come to her senses. “Buy it… or not?”</p><br/><p>“What’s there to hesitate about? If you want to eat it, then buy it.” The owner pounced at every possible hint of business and began to promote his products with a burning passion. “Sister, I must say you have a good taste. My duck blood is the best in the entire market, just look at this color, you can’t buy this elsewhere. It’s delicious when you make it into a curd.”</p><br/><p>“Really?”</p><br/><p>“Of course, all the blood is freshly collected from the ducks butchered today.”</p><br/><p>“That’s… quite fresh, hahaha…” Plus, it smelled so delicious.</p><br/><p>“Two dollars for half a kilo, cheap and affordable.”</p><br/><p>“Yes.” It smelled so good, so good, so good.</p><br/><p>“This opportunity comes and goes, my duck blood crud is in quite great demand. If you had come in the afternoon, there wouldn’t have been any left.” The owner lifted a piece of duck blood curd and weighed it in his hands while saying, “I promise you, once you taste it, you will come back for more.”</p><br/><p>“Really?”</p><br/><p>“How about a kilogram, sister?”</p><br/><p>“But…” Sisi’s lip corners went down. “I am allergic to duck blood!”</p><br/><p>“… Huh?” The owner was dumbfound. The duck blood curd in his hand slipped off and landed into the water with a thud, splashing onto Yao Si’s face.</p><br/><p>“Girl, are you playing around with me? If you’re allergic to duck blood then why are you standing over here for so long?” Unable to sell anything, the owner was choked with anger.</p><br/><p>“I don’t want to either!” Just the thought of it filled Yao Si with grievance. “I haven’t eaten or slept for dozens of days, I can’t hold anything down, and I only desire this.”</p><br/><p>“Are you fooling with me, girl?” The owner was clearly not pleased. “You don’t look like you haven’t slept for a dozen days.” Obviously not. She looked like she was bursting with energy. Besides, how could she have the strength to stand here after not eating anything for that long. “How about you check out something else?”</p><br/><p>“I’m serious.” Yao Si still couldn’t control herself, and her eyes were stuck to the duck blood in the water. “I smelled its fragrance from three blocks away.”</p><br/><p>“How’s that possible if it’s so far away. That aside, you’re not even a…” The owner’s voice suddenly dropped as if he had recalled something. His eyes went wide when he scanned her from head to toe. Something flashed in his eyes and he immediately changed his words. “Sister, I have something even more fresh inside the room. Maybe you won’t be allergic to that once you have a taste. Why don’t you follow me inside?”</p><br/><p>“Really?” There was duck blood that could combat allergies?</p><br/><p>“Come along,” the owner said and walked into the backroom. There, he turned around and gestured for her to come over.</p><br/><p>Yao Si followed him inside. Just as she entered the room, the owner drew the curtains closed, forming a closed-off space. The initial bright room darkened in a split second, shielding off the noise from the market outside.</p><br/><p>Yao Si’s heart made a thump, and she timidly looked at the owner who had become so warm to her. “Brother, you don’t happen to have a side-job as a human trafficker, do you?” This couldn’t be another mini “Rujia” incident.</p><br/><p>The happiness on the owner’s face cracked, and his lips twitched. “What nonsense is running up your head, sister? I’m not a bad person.” He glared at her with slight discontent, unable to understand her suspicions. He walked over to the right of the room, picked a cup, and poured in the remnants of what was inside an intricate container nearby. He then passed the cup to her. “Here, sister, try this.”</p><br/><p>“What is it?” Yao Si extended her hand and held the cup. It was half-full, containing a bright-red liquid that hadn’t solidified yet. It was dazzling and brilliant like a ruby, and a strong whiff of blood-like fragrance greeted her, recovering her stagnant senses. Saliva pooled in her mouth, and even her stomach began to resonate with waves of rumbling.</p><br/><p>It smelled so good…</p><br/><p>Yao Si couldn’t resist it and wolfed down the entire cup. The odorous liquid felt silky as it rolled against her tongue, appeasing her taste buds. She was stolen away by the brilliant aftertaste. It was more enjoyable than a feast of Malatang, and even her teeth started to itch as something went down the corn of her lips.</p><br/><p>“Just as I thought…” The owner let out a heavy breath.</p><br/><p>This finally snapped Yao Si from the heavenly aftertaste, and she realized that she had drank a whole cup of raw blood and even wanted another cup. Eerily, she didn’t even feel disgusted, which was more than just confusing.</p><br/><p>Seeing the shocked expression on the owner’s face, she set down the cup, gave a dry cough, and asked, “Hey boss, this anti-allergy duck blood ain’t too shabby. How much for a kilogram? Give me five kilos.”</p><br/><p>“Sister…” The owner didn’t move an inch, his eyes suddenly turning sympathetic as if he didn’t know how to begin. “I heard that you haven’t slept or eaten for weeks?”</p><br/><p>“Yep!” Yao Si nodded. Did this have anything to do with her buying duck blood?</p><br/><p>“Don’t you feel like there’s something wrong with your body?”</p><br/><p>“A little.”</p><br/><p>To be honest, she had already went to the hospital for a comprehensive check-up. She did it three times, but everything seemed to be fine. Even the doctors couldn’t believe that she had really not slept or eaten for such a long period of time and had silently passed her business card to some psychiatrist.</p><br/><p>“Do you know why you’re like this?”</p><br/><p>“No.” Yao Si shook her head, then gave a look to the mysterious person. “Boss, even if the anti-allergy duck blood costs four dollars for half a kilo, I will still buy it.”</p><br/><p>“I’m not raising the price.” The owner gawked at her snappishly. “Don’t you want to know what’s happening to you?”</p><br/><p>“Of course!” But even the hospital couldn’t diagnose it. “You mean you know?” she casually said.</p><br/><p>“Hold on.” The owner looked around sneakily, then walked over and drew the curtain even tighter before returning with a stern face. “Sister, I want to ask you, have you encountered anything out of the ordinary in the past few weeks? ” he inquired.</p><br/><p>“What do you mean anything out of the ordinary…”</p><br/><p>“Like being bitten or getting injured?”</p><br/><p>Yao Si shook her head vigorously. It would be difficult for a homebody like her to be injured.</p><br/><p>“Did any stranger come to look for you?”</p><br/><p>“Only takeout service and delivery.”</p><br/><p>“Then how about dreams? Have you had any strange dreams? Or something that you can’t remember?”</p><br/><p>“I dreamed of winning a five million lottery, does that count?”</p><br/><p>“…” The owner was speechless. In the end, he let out a long sigh, mumbling beneath his breath, “Who cares, it’s probably an accident. It’s not a surprise in a troubled time like this…”</p><br/><p>His expression filled with even more pity. If the look that he gave her before could be compared to a person looking at a lost child, then this would be the look for an orphaned child.</p><br/><p>Yao Si felt panicky under his eyes, even though she was indeed an orphan. “Boss, just spit it out, would you? What’s wrong with me?”</p><br/><p>The owner composed himself. He pulled over two stools from the side, signaling for her to take a seat. Then, with his brows knit into a frown, he told her the truth.</p><br/><p>“Sister, you’re dead.”</p><br/><p>“…”</p><br/><p><em>F*ck!</em></p>\n</div>"}