{"title": "Chapter 9 - The Foodies' History of the Galaxy", "id": 9, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-9-the-foodies-history-of-the-galaxy", "volume_title": "Volume 1", "body": "<h1>Chapter 9 - The Foodies' History of the Galaxy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yao Si spent a period of a few hours learning the crash course of bloodling history from Yan Xuan.</p><br/><p>Just as she had thought, the current bloodlings in the galaxy indeed came from the same ancestry as the bloodlings on Earth. Other than a self-sought death or fratricide, they were basically an eternal species with an infinite lifespan.</p><br/><p>However, everything in this world is fair. Although the bloodlings were strong, they could never produce natural offspring. The only way to pass on their genetics was through their first bite, turning other species into bloodlings, but there was no species in the galaxy which could actually bear the blood of bloodlings and successfully convert.</p><br/><p>No, to be accurate, only the “people of the Blue Planet” which were born in the same planet as bloodlings could successfully convert. Based on the breeding speed of the people of the Blue Planet, the bloodlings would never need to worry about population issues. Despite the Blue Planet’s people knowing nothing of the bloodlings, the two species kept a strange balance. This was the Julian calender era which Yao Si had once lived in, or the prehistoric times as the galaxy now commonly referred to them..</p><br/><p>To continue the lifeline of their species, even when the internal brawls constantly waged on, the bloodlings tactically agreed to never expose themselves in front of the fragile Blue Planet’s people, intentionally protecting them during their fights.</p><br/><p>But no matter how well-conceived their protection was, it still couldn’t prevent the Blue Planet’s people from courting death!</p><br/><p>Because doomsday was near.</p><br/><p>Similar to how it played out in the movies, the humans invented a special virus which had extremely fast reproduction speed and had a very wide impact. Almost overnight, over fifty percent of the entire planet’s population had been infected.</p><br/><p>What was different from the movie’s, however, was that the people who got infected didn’t turn into zombies. They would die in a very short span of time and become the breeding ground for the virus. And it infected not only the people, the plants and animals all died too, even the water sources had been contaminated.</p><br/><p>At that point of time, this virus had spread all over the Blue Planet, and only the immortal bloodlings were immune to it. To salvage the remaining people of the Blue Planet, the chief of the bloodlings at the time decided to stop concealing their identities. After the negotiations, the Blue Planet’s people were willing to accept the first bite and convert to bloodlings.</p><br/><p>From that moment onwards, there were long any pure Blue Planet’s people on Earth anymore.</p><br/><p>However, the problems were not over. Before the Blue Planet’s people who were all converted to bloodlings recovered from this shock, they faced the invasion of extraterrestrials. A fleet form “zergs”, the cancer of the galaxy, most likely due to the pilot being on something and getting lost, had suddenly landed on Earth and claimed that they wanted to colonize this place.</p><br/><p>Earth was already full of holes and heavily damaged, and could not supply anymore duck blood. When the bloodlings heard the zergs’ proclamation when they were about to be forced into going into hibernation, they had only one thought.</p><br/><p>Hell, who would have thought of this thing, it was too good to be true! This was like a meal delivered straight to their door!</p><br/><p>What was wrong with zergs? They had blood too! Although the taste was a little weird, but most of the bloodling population were races from the east. This gave them a chance to research hundreds of ways to cook the Zerg blood.</p><br/><p>So the bloodlings who were so hungry that their eyes began to see stars, with an excited mood and saliva drooling from the corner’s of their mouths, fought against the invaders.</p><br/><p>The zergs at the time were the highest ranked, level SSS, in combat ability species in the galaxy. With their fast breeding rate, they hogged half the galaxy like locusts. That’s why there were no zergs who took heed of the weak looking and pitifully small species at the beginning. This is until the zergs that were sent out never returned, and even their bodies were nowhere to be found…</p><br/><p>When the zergs realized the danger, they struck back with full force only to realize a number of things to their horror.</p><br/><p>Shit, these people can’t die!</p><br/><p>Shit, these people only want to capture us alive!</p><br/><p>Shit, these people even want to cook our corpses!</p><br/><p>Too violent, too bloody, too terrible, too horrifying!</p><br/><p>The bugs were trembling with fear. After losing nine tenths of their military force, they abandoned their starships and dejectedly fled back to their own planet in escape pods.</p><br/><p>The bloodlings, who were now well-fed, sent a message after them. “Come more often and play with us!”</p><br/><p>The leaving of the zergs was not a “happy ever after” though, because they had contracted the virus, yes, that doomsday virus. But unlike to the people of the Blue Planet, this virus was beneficial to the zergs.</p><br/><p>They evolved! Their already bulky bodies had suddenly enlarged, and they became numerous times bigger. Their shells had become even harder, and they were now much more brave. They had directly leveled up from triple S to triple S+.</p><br/><p>The bugs and their pals were amazed, and decided on the spot to form a group and head to Earth to evolve more.</p><br/><p>Initially, the zergs planned that no matter what, they needed to conquer Earth. However, they soon realized that even after they had evolved to triple S+, they were still small potatoes when facing the miraculous self-healing and extravagant special abilities. They just had no chance of winning. The zergs that were sent out either died or were severely injured, while the opponent had zero casualties; every one of them still hopped around like normal.</p><br/><p>This wasn’t war, this was one-sided slaughter!</p><br/><p>The approach to invade Earth wasn’t working out, so the bugs immediately ceased this pointless suicidal invasion. Yet they didn’t want to give up this opportunity to evolve that they had finally obtained. That’s why they decided to sneak into Earth in batches. When they finished contracting the virus and evolving, they would leave.</p><br/><p>Despite them being occasionally discovered, their casualty rates decreased greatly at last.</p><br/><p>The zergs began to evolve in masses…</p><br/><p>However, because of this, the other species in the galaxy suffered an unfortunate fate. The evolution of the zergs gave no time for many species to react, and they were caught off-guard. All of a sudden, everyone was in peril, living in fear. The entire galaxy was under the bugs’ shadow, and it had almost entered the dark era.</p><br/><p>That was when…</p><br/><p>The bloodlings became tired of eating zerg blood in the hundred and eight ways of cooking they had come up with.</p><br/><p>After the bloodlings filled their stomachs, they suddenly realized.</p><br/><p>Ha?</p><br/><p>We’ve captured so many bugs’ spaceships. (⊙v⊙)</p><br/><p>Huh?</p><br/><p>This spaceship doesn’t look so difficult to control. (⊙ o ⊙)</p><br/><p>Hum?</p><br/><p>Wonder if there’s anything else other than bugs in the galaxy. O(∩_∩)O</p><br/><p>Ummm?</p><br/><p>Are those others tasty? （+﹃+）</p><br/><p>So…</p><br/><p>The bloodlings officially entered the foodie… I mean, the galactic era, embarking on their foreign planet (food foraging) exploration journey.</p><br/><p>With this exploration however, they realized that almost every planet in the galaxy had intelligent beings, and signs of zerg existences. Maybe they had gotten used to catching bugs on Earth, but the first reaction the bloodlings had had upon seeing zergs was… to catch and eat them!</p><br/><p>After all, in an unfamiliar environment, familiar food gave them a warm feeling.</p><br/><p>And just like that, the bloodlings sought new types of food while catching the bugs. In less than a hundred years’ time, they had swept through and exterminated the zergs from half the galaxy. While they were at it, they also took out the mother planet of the zergs with no difficulties. Without anyone’s help, only fighting by themselves, they had comically ended the galaxy’s dark era.</p><br/><p>As for the zergs… You can only see them now in museums.</p><br/><p>╮(╯▽╰)╭</p><br/><p>“To be honest, a long time ago, I had spoken to an elderly bloodling who had participated in the great war. He said that when they had went to the mother planet of the zergs, they had originally never planned to exterminate the entire species.</p><br/><p>“They had only wanted to look around and see if there were any other species on it other than the zergs. Little did they expect…”—Yan Xuan closed the electronic book in the optical computer on his hand and exhaled—”there really weren’t any!”</p><br/><p>The corner of Yao Si’s mouth twitched. They had already suffered genocide, so couldn’t you leave them with some dignity? You wouldn’t die if you didn’t smear their name!</p><br/><p>This was a virtually a galactic massacre triggered by a bunch of foodies.</p><br/><p>“My little baby, how was it?” Yan Xuan had an amiable smile. “Was uncle’s story pleasant to hear?”</p><br/><p>If you stop calling me baby, we can still consider being friends!</p>\n</div>"}