{"title": "Chapter 3 - Say Your Last Words", "id": 3, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-3-say-your-last-words", "volume_title": "Volume 1", "body": "<h1>Chapter 3 - Say Your Last Words</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“You haven’t seen the notices yet?” Li Zheng was even more shocked than she was.</p><br/><p>“Notices?”</p><br/><p>“My bad, I forgot that you don’t have a sire, so you don’t know how to use it yet.” He smacked his forehead, then cursed with an angry expression, “Who would commit such a sin? It’s all that person’s fault. Turned you then washed his hands of you, leaving a little youngster like you here unattended. He deserves to be killed with a thousand knives and damned with eternal solitude.”</p><br/><p>He cursed as he took the ID card from her hands. In some mysterious way, the bat-shaped card suddenly turned blinding red, and the number ‘5’ on it transformed into an exclamation mark.</p><br/><p><em>Wow, who would have guessed that this ID card was so high-tech!</em></p><br/><p>“See this? It is the warning sign for the great war. If you see the card turn this color in the future, don’t wander outside during that time.” He flashed the card around. “It’s chaotic out there, so my store will also close for the oncoming days. It won’t be operating anymore.”</p><br/><p>“Hold up!” Yao Si was still a little muddled. “That great war you mentioned, what is it? Who are you fighting against?”</p><br/><p>“With those Western jerks of course.” Li Zheng tapped the chair beside him, gesturing for her to sit down as well, and then began to fill her in.</p><br/><p>The current internal structure among the vampires was not that harmonious, still possessing some conflicts. To sum it all up, the top brass were divided into two factions, the Western and the Eastern. Each side had their own politics and management system.</p><br/><p>Occasionally, both sides would break out into bloody clashes. The principal conflict of it all was their attitude toward humans. The Western side promoted peace and harmony, advocating to live without inferring with each other, minding their own business. The Eastern side, on the other hand, concentrated on integration, suggesting that they should reveal themselves to the humans and promote mutual development. And it was because of this that the two factions were in loggerheads and countless battles were fought.</p><br/><p>“Us bloodlings are already an exotic species, so what’s wrong with converting some humans?” Li Zheng’s face was filled with anguish. “Those Westerners even called themselves the conservatives, but in my opinion they are all reactionaries!”</p><br/><p><em>Ummm… Why do I feel like we’re more like the reactionaries. </em>“Turning all the humans into bloodlings, only the big antagonistic boss in movies would do such a thing.”</p><br/><p>“Nonsense… You must have been watching too many western movies to think like that. Humans are so vulnerable, easily diagnosed with incurable diseases. What’s wrong with being a bloodling when it’s just a change in the diet at most? At least they won’t get sick again.”</p><br/><p>It did make some sense.</p><br/><p>“Anyhow, us bloodlings can only convert one offspring in our lifetime, so to be correct, we’re the ones that suffer from the greatest disadvantage.”</p><br/><p>There was such a setting! However, now that Yao Si thought of that, without the human-blood drinking requirement so often seen in the movies, it wasn’t too shabby being a bloodling. Although they had less options for food, the intelligence of foodies in the great celestial empire was unlimited. If there came a day when all humans were converted, they would probably invent over a hundred ways to cook duck blood alone.</p><br/><p>“Sisi, you’re still young, but you can’t learn the way of the Westerners.” He held her hands and said earnestly, “Those western vampire movies and novels are all lying. They’re definitely the tricks of the Western faction; it’s a conspiracy. They’re playing with the public’s opinion. It’s clearly a way to prevent the cultural invasion of the opponent. You must keep a clear mind and be aware!”</p><br/><p>It was hard to tell from first glance that Brother Li had such profound political awareness that even she was being persuaded. Yao Si’s hands ached in his hold. To prevent him from becoming even more agitated, she could only nod her head and agree, expressing her unshakable decision to stay with the Eastern Faction. “I know, my brother, I belong to the Eastern side.”</p><br/><p>“Good girl.” He patted her shoulder in joy, then pondered for a second and began to explain again, “By the way, I heard that this great war isn’t that simple. Old vamps from first, second, and third generation are all mobilized. We lost a lot of our kind over at City A. Even though that battle was far from here, you shouldn’t leave the house for a few days to be safe.”</p><br/><p>“All right, Brother Li, I understand.”</p><br/><p>“Ah, newborns like you ought to have your fathers next to you to be safe. And now that you’re also a fifth generation, absolutely no… Wait!” He turned to look at her. “Have you awakened your ability yet?”</p><br/><p>“Not yet.”</p><br/><p>“Not even one?” Li Zheng was somewhat surprised. It had been four months already.</p><br/><p>Every newborn bloodling would awaken some, stronger or weaker, special abilities. The most basic were speed, power, and five elemental powers, metal, earth, plants, fire, and water. Others had special powers like control of time or dimensions, but those were rather rare. The strength of the abilities was also connected to the generation, the first generation being the strongest and those below it descending in power.</p><br/><p>“I really haven’t.” Yao Si shook her head. She really didn’t feel anything strange in her body. “Maybe it’s because I’m a fifth-generation. Too weak, that’s why…”</p><br/><p>“That’s not possible. I have seen a sixth-generation bloodling with the ability of super speed.” Despite not being very strong, there was no reason why a fifth-generation bloodlings couldn’t awaken their ability. “Ah, if only the person that converted you was here. They could then feel your ability through the blood connection.</p><br/><p>“It’s all that jerk’s fault. Who leaves their only descendant behind, and now you can’t even… Argh.” He was halfway through his curses when he suddenly slapped his thigh and said with excitement, “I remember there’s a way that you can test your abilities.”</p><br/><p>“Really!” Yao Si bounced to her feet. Even though she was a weakling among the bloodlings, having a special ability was better than nothing. “What way?”</p><br/><p>“Wait here.” Brother Li turned toward a small compartment behind him and began to fumble through the drawers. It took him a while before he found a long rectangular thing. He passed it over to her with a face full of excitement. “Here it is.”</p><br/><p>Yao Si stared at the object, dumbfounded and unable to snap back to reality. It was…</p><br/><p>She felt the blue veins on her forehead bulge.</p><br/><p>“Brother, I am not married.”</p><br/><p>“I know.”</p><br/><p>“I haven’t been in a relationship either.”</p><br/><p>“Huh?”</p><br/><p>“Neither have I had any indecent affairs with anyone.”</p><br/><p>“Oh.”</p><br/><p>“I’m even a homebody.”</p><br/><p>“So?”</p><br/><p>“So…” The corner of her mouth twitched. “Why did you give me a pregnancy test kit!”</p><br/><p>–</p><br/><p>When Yao Si returned from Li Zheng’s place, the moon had already risen high in the sky.</p><br/><p>To her surprise, the pregnancy test that Li Zheng had given her was actually had the ability to test for special abilities, but it could only identify the abilities from the five elements. By dropping the blood onto the test paper, a strip of color assigned to the ability would appear.</p><br/><p>Unfortunately, her blood didn’t reveal any mark at all. She could remember Li Zheng’s teary eyes after there was no result. He then used “The Three Character Classics” is a piece of ancient Chinese literature written in the 13th century and still taught to young children at primary school. Each line has three characters and each sentence has six which teach a moral principle. The five central themes of “The Three Character Classics” are benevolence, righteousness, honesty, respect, and filial piety. So what Li Zheng did there is basically cursing that man’s ancestors in a polite manner. Three Character Classics <sup>1</sup> to greet the bloodling who had turned her for a full half an hour.</p><br/><p>Yao Si would be lying if she said that she wasn’t disappointed. She was recently converted, had no sire, and now even couldn’t awaken a single special ability. If that wasn’t enough, she was also a fifth-generation bloodling.</p><br/><p>What did fifth-generation mean? Let’s just say that if Brother Li who was a fourth-generation wasn’t qualified to participate in the fight between the western and eastern sides, then she was a weakling without any worth and who would just be a burden during battle.</p><br/><p>Her ears still echoed with the sympathetic tone Li Zheng had used when she left.</p><br/><p>“Hahaha, Sisi, maybe your ability is a one in ten million special ability. Don’t look so down.”</p><br/><p>Hell, that was even more tragic!</p><br/><p>Rubbing her nose, she gave up. Who cares, she may as well hurry home and eat a bowl of blood curd to calm herself.</p><br/><p>Squeezing the identity card in her hand that had turned red, she felt nothing toward the war that Brother Li had mentioned, that quarrel between the Western and Eastern factions. Not to mention that not that long ago she was still a good girl who was born under the red flag of socialism, raised in the glorious spring wind, and living in a peaceful era, she had only seen the word war in television and movies.</p><br/><p>Besides, City A in which the violent conflict had occurred was tens of thousands of miles away from City F in which she lived. She was just a fifth-generation weakling who was in no position to enlist, so the flames of the civil war would never affect her.</p><br/><p>Bang!</p><br/><p>A loud sound pierced through the night, and a black silhouette flashed past her. A large, light box suddenly fell from above, landing right before her, and shattered into pieces. Sharp glass scattered across the floor, leaving only a step’s distance between her and the box’s remains.</p><br/><p>“Humph, is your whole Eastern Faction filled with this kind of weaklings?” A disdainful humph sounded from above her head.</p><br/><p><em>Oh shit!</em></p><br/><p>As the words Yao Si had thought moments ago echoed in her head, her confidence went crashing down.</p>\n</div>"}