{"title": "Chapter 12 - The Enlightenment School", "id": 12, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-12-the-enlightenment-school", "volume_title": "Volume 1", "body": "<h1>Chapter 12 - The Enlightenment School</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yao Si had arrived at the Red Planet a number of days ago, but the only time when she had seen Yan Xuan was when he’d brought a doctor-looking bloodling to take a sample and test her bloodline. The next time he appeared before her was on her fifth day on the Red Planet.</p><br/><p>“My baby, do you want to learn things?” Yan Xuan patted her on the shoulder. “How about uncle takes you to school so you can make some new friends?”</p><br/><p>School! Yao Si’s eyes suddenly brightened.</p><br/><p>She didn’t expect that there would be compulsory education in the galactic era. ‘ <em>As an illiterate, this baby expresses that new knowledge is a must, it is indeed time to go to school and get some common sense!’ </em></p><br/><p>“Thanks, Uncle Yan.”</p><br/><p>Yan Xuan had a pleased smile on his face, showing acknowledgment for her studious attitude. He didn’t delay, leading her straight out the door. Compared to when they arrived at the Red Planet, that cool sword wielding flight, this time Yan Xuan chose a more likely high-tech instrument.</p><br/><p>He led her straight to the side of what appeared to be a street and stood with her on a white cross sign. As soon as they stood still, the cross on the ground lit up and a faint operating noise could be heard. The ground shook and the floor in a quadrangle that was two meters around them suddenly rose up, resembling an elevator. It moved forward at a much faster speed though, and it looked like the floor was rushing ahead on it’s own.</p><br/><p>This was really high-tech from the future.</p><br/><p>Before Yao Si had the opportunity to exclaim, they turned into a street block. Only now did she discover that there were many people that were on the side of the road but traveling in a different direction than they.</p><br/><p>On top of that, everyone else was moving at lightning speed, compared to their tortoise like movement. It was hard to say if this type of traveling was meant to let her know this planet better, maybe, since Yan Xuan introduced her to different things at the same time.</p><br/><p>That’s the town hall, that’s the Inspection and Quarantine Institute, on the other end was the Galactic Port. He introduced everything that they saw on the way to her clearly.</p><br/><p>The more Yao Si listened, the more amazed she felt, until she finally formed a blurry prototype in her mind of this galactic world that was completely different from the sci-fi movies. Looking at rows and rows of buildings that surpassed her imagination as they flashed past, she moved on from her initial astonishment to being amazed, and being amazed even more, and eventually… She got used to it!</p><br/><p>Since she didn’t understand anything anyways. ╮(╯﹏╰）╭</p><br/><p>That was until a giant green castle floating in mid-air turned up in her line of sight. It was different from all the other strangely shaped buildings. This castle was covered in green plants on the outside, and the building was in a small, rigid high-rise building style from Earth that she was familiar with.</p><br/><p>“What’s that place?”</p><br/><p>Whether it was because of the familiar style or something else, she felt an odd intimacy with that place from first sight. It made her unable to resist the urge to go over and take a look</p><br/><p>Yan Xuan’s eyes shifted to the direction she was pointing. “That’s the Majestic Palace, the place where his imperial highness hibernates.”</p><br/><p>His imperial highness?</p><br/><p>Yao Si was confused, didn’t the bloodlings enter the liberal democratic galactic era long ago? Maybe they had kept the constitutional monarchy! Just as she wanted to gain some comprehensive knowledge, the flying floor suddenly stopped.</p><br/><p>“Here we are!” Yan Xuan took a stride with his long legs and walked off the raised ground.</p><br/><p>Yao Si had no choice but to push her questions back inside her heart. May as well let it pass, since she will definitely learn such things in school; she had to start from the beginning regarding all the galactic stuff anyways. Hence she followed him out and stopped before a large gate.</p><br/><p>She subconsciously raised her head to take a look at the name of the school, and went stiff on the spot.</p><br/><p>The corner of her mouth twitched, and she felt as if ten thousand alpacas <sup>1</sup> had trampled across her heart forming one phrase “f*ck you”.</p><br/><p>There were three big, bright red words that were visible at the top.</p><br/><p>“Bloodling Royal Kindergarten!”</p><br/><p>Yao Si suddenly had an impulse to throw her university certificate of graduation at Yan Xuan’s face. This starting from the beginning was way too back in the beginning! Even if she was a pure illiterate, she at least qualified to be sent to year one, what the hell was sending her straight to kindergarten for?</p><br/><p>“Minister Yan, welcome.”</p><br/><p>A forty to fifty years old looking woman walked out from inside the door and moved towards them to greet them very politely. She turned and took a look at Yao Si, and a smile that looked as gentle as water immediately bloomed on her face. She tilted her body slightly. “This is the baby that will be enrolling today?”</p><br/><p>“Yes, principal Yu.” Yan Xuan moved to the side and let her come closer. “It’s the one we just picked up from No. 333 space station.”</p><br/><p>“Hello, my baby.” Principal Yu’s expressions became even more tender. She moved closer again, extending her hand and caressing Yao Si’s head. Using a pitch that was clearly a few notes higher than before, she introduced herself, “My last name is Yu, my baby, you can call me Mrs. Yu.”</p><br/><p>Yao Si was speechless from this strangely awkward, used-on-infants tone…</p><br/><p>She immediately gripped the hand that the person was about to reach out to the top of her head and shook it. “Hello principal Yu, nice to meet you, my name is Yao Si.” She must correct her, otherwise she will really be treated like a baby.</p><br/><p>Yu Jing was stupefied. As if surprised by her reaction, she turned and looked with confusion at Yan Xuan.</p><br/><p>“Maybe it’s because she woke up too early, a part of the genetic memory which she retained still hasn’t faded away yet,” Yan Xuan explained.</p><br/><p>Light dawned upon principal Yu, and the eyes which looked at Yao Si were suddenly filled with sympathy, as if they were about to tear up the next moment. “What an unfortunate child. Minister, you must ask the space station thoroughly and make them give us an explanation.”</p><br/><p>“Don’t worry, it’s been taken care of.” Yan Xuan’s smile made his eyes narrow into a thin line.</p><br/><p>Yao Si couldn’t help but to silently light a candle inside her heart.</p><br/><p><em>‘Brother Lu, I tried!’ </em></p><br/><p>“Her bloodline test results aren’t out yet,” Yan Xuan continued to explain the situation to principal Yu. “We’ve searched all the files of hibernating bloodling members, especially those who sired newborns that were in hibernation. We haven’t found who her sire is as of yet, it might still need some days, until then we will have to trouble you.”</p><br/><p>“Don’t worry, minister.” Principal Yu nodded and took a look at Yao Si. “We will take good care of her.”</p><br/><p>Yan Xuan finished talking then turned and looked at her again. He instructed with slight worry, “My baby, you must be good, you can make a lot of friends in here. Uncle will come and pick you up when holidays come, how’s that?”</p><br/><p><em>‘Is this foreshadowing for a boarding school?’ </em>Yao Si allowed her mind one second to wonder back to the entirely pink room that she had been living in for the last five days, and nodded her head firmly.</p><br/><p>“Good girl!”</p><br/><p>Yan Xuan still wasn’t satisfied. He glanced her up and down with the expression of a reluctant and loving father. After some time, he took a bangle-like object from his pocket. He took her hand and explained while putting the object around her wrist, “This is the newest model of optical computer, my contact number has been saved in there already. If you miss Uncle Yan, promise to use this to find me, alright?”</p><br/><p>Yao Si was shocked, ever since she was at the space station she had been a little curious about this advance optical computer bangle which almost everyone had. However, she would have never thought that Yan Xuan would just give her one.</p><br/><p>She couldn’t help but feel warm at heart. Looking at Yan Xuan’s gentle eyes she suddenly felt her nose grow sore as she held back the tears. Although Yan Xuan had treated her like a baby all this time, he was truly good to her. Without him being neither a kith nor kin, nothing could be said about him, a high-rank bloodling official picking her up and organizing everything for her on political grounds.</p><br/><p>Nevertheless, him doing everything by himself was far beyond where his duties lay, let alone giving her this optical computer, since one has to know by now that she was poor and knew nothing. According to her knowledge, this thing wasn’t cheap. No matter how good the bloodling welfare was, it was not in the position of gifting optical computers randomly.</p>\n</div>"}