{"title": "Chapter 23 - Let Me Deceive the Ancestor First", "id": 23, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-23-let-me-deceive-the-ancestor-first", "volume_title": "Volume 1", "body": "<h1>Chapter 23 - Let Me Deceive the Ancestor First</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Quick! Notify Yao Qian,” Yao Si shouted, gripping Qu Ze’s collar with one hand. Her patience had completely evaporated and she didn’t want to stay with this troublemaker any longer.</p><br/><p>“I’m afraid I can’t.” Qu Ze waved the hand that was covered in flower mucus innocently. “Other than the ability to digest, this flower’s juice also probably has the function of blocking out signals.” Besides, he didn’t have that man’s contact number anyways.</p><br/><p>“Then what should we do?” Surely that wasn’t to stay here and be digested by the flower.</p><br/><p>“Set your heart at ease, your highness,” he replied carelessly. “The Gluttony can’t digest bloodlings, soon it will realize we’re not delicious and will spit us out.”</p><br/><p>“…” Next time say such things earlier!</p><br/><p>Oh, the tired heart! Ever since Yao Si got involved in the civil war of the bloodlings as an innocent bystander, she had never been this tired. Yellow haired people were certainly no good folks.</p><br/><p>This time Qu Ze hadn’t lied to her. After two hours being trapped inside the bud, Gluttony, as expected, opened up with a “wah”, vomiting the two people covered in mucus out. A root even extended from the ground to push them away in disgust.</p><br/><p>After being released, Yao Si turned on the optical computer on her hand at the first opportunity, wanting to get in contact with either Yao Qian or Yan Xuan. However, no matter how many times she clicked on their contact number, there was no response.</p><br/><p><em>What’s happening? Did the optical computer break?</em></p><br/><p>“Oh, so the messages were not blocked by the flower juice!” Qu Ze face was full of amusement, his energy showing no signs of him being anxious, on the contrary, he seemed to be slightly excited. “It looks like the magnetic field of this forest is quite special.”</p><br/><p>“What about your particle transmitter?” Yao Si asked. “Transport us again.” A shower when they got back would be good, she really couldn’t stand this body-full of mucus.</p><br/><p>“Huh, didn’t I tell you?” The bloodling was alarmed. He took out the box, which he had previously showed her, and chucked it away randomly. “Particle transmitters are single use.”</p><br/><p>“…”</p><br/><p><em>Hell!</em></p><br/><p>Yao Si took a deep breath, she really wanted to have a cow <sup>1</sup> now.</p><br/><p>“Then what should we do?” They didn’t know their own location and they couldn’t get in contact with anyone.</p><br/><p>“It seems we can only wait on the spot! Or…”</p><br/><p>“Or what?” Maybe he has an idea?</p><br/><p>“According to the designated distance of the particle transmitter, the transported distance wouldn’t exceed two hundred thousand kilometers. So we could try to…” He paused, then said each word out with a rare seriousness, “Walking. Back!”</p><br/><p>“…Goodbye!” Yao Si turned and left. If she ever believed in this lunatic again, then she was an idiot, two hundred thousand kilometers! That was enough to freaking travel through half of the Earth, all right?</p><br/><p>“Eh, ancestor where are you… Ancestor, your highness!”</p><br/><p>Yao Si honestly hadn’t thought that there would be such an odd man among the bloodlings. Other people would only cheat their father, yet he would deceive his ancestor. What was even worse was that once he got stuck onto you, you couldn’t get rid of him, being unlucky to this level was quite impressive.</p><br/><p>However, soon Yao Si realized what it really meant to dig a hole for your ancestor to fall in. It was hard to say if Qu Ze had his luck set to negative when he was born, but he was either eaten by a flower, grabbed by a tree, or captured by an unknown bird all the time.</p><br/><p>Anyhow, it was like all the unfortunate things were waiting in line for him to patronize. Yao Si spent all her time not walking out of this forest but just saving another person.</p><br/><p>Result?</p><br/><p>Qu Ze had not a scratch on him, whereas Yao Si got swallowed by a flower, whipped by a tree, and pecked at by a bird. She was tired to death from saving their two little lives.</p><br/><p>She had generated an unshakable doubt about her race’s mental capabilities. Who would freaking keep these kind of dangerous flora and fauna on their own mother planet, allowing them to grow everywhere? What kind of imbecilic taste is that? Is there still time for her to make the request to be turned back into the blue planet person?</p><br/><p>“Ancestor, why are we hiding here.” Qu Ze poked Yao Si who was lying on her belly under a bush.</p><br/><p>“Can’t you see the flowers ahead?” She pulled him down with no hesitation and pointed forward.</p><br/><p>“Flowers?” Qu Ze followed her pointing finger and looked, his eyes suddenly brightening up. “Huh, isn’t that Gluttony? Why are there so many?”</p><br/><p>“How should I know?” Yao Si rolled her eyes, even the name ‘Gluttony’ she had learned from him. Though unlike the single flower they saw before, there were dozens them here. At first glance, it looked like a white pond.</p><br/><p>Yao Si was in an difficult situation. It was clear that if they got across the field of the giant flowers, they would reach the end of this forest. However, if they did take such a path, they would definitely be swallowed a time or two. Or if being truthful, N number of times.</p><br/><p>“I wonder what these flowers are gathering here for?”</p><br/><p>She could clearly recall that Qu Ze had said they weren’t gregarious. Taking a closer look, she realized that the flowers were gathering in a circle in an orderly manner. Compared to the motionless, waiting for prey to knock on it’s door Gluttony they’d met first, these were all slowly moving, as if passing something to the center before retreating, and in the center of them all…</p><br/><p>“Eh, it looks like there’s a purple orb inside?”</p><br/><p>It was only the size of a fist, and if its color didn’t contrast so much to the flowers’, Yao Si wouldn’t have even noticed it.</p><br/><p>The two bloodlings could see that each flower moved to the spot of the orb, then lowered their flower buds and dripped something on the orb before backing away again. Right after, another flower would come up, doing the same. It was like some kind of a holy ritual.</p><br/><p>“They’re probably feeding that orb.” It could only be food that they spat out of the flower buds. “Judging by the looks of it, that orb is either the king of the flowers or their young offspring. Let’s take a detour, we must not touch… Huh, where did the he go?”</p><br/><p>Wasn’t Qu Ze standing right beside her a second ago?</p><br/><p>Yao Si’s heart sank, and she instantly had an ominous feeling about it.</p><br/><p>Like she expected, the next moment she heard the person’s confused yet excited voice. “Your highness, is this the orb that you were talking about?”</p><br/><p>Someone was standing in the middle of the sea of flowers, smiling brightly while holding the purple orb.</p><br/><p>Yao Si could feel the dull thud of her heart.</p><br/><p><em>Oh shoot!</em></p><br/><p>Suddenly, as if a light switch had been flicked on, each flower turned bloody red. The flower buds cracked open and uniformly turned to Qu Ze who had trespassed into their circle. Inside the Gluttony’s something shone with a white shimmering light.</p><br/><p>“Run!”</p><br/><p>Yao Si didn’t know where that burst of energy came from, but she ran into the cluster of flowers, caught a particularly thick-headed person, dug her heels, and bolted madly away.</p><br/><p>The next moment, the sky was filled with ice, ‘clack clack clack’ firing at them like machine guns. Each blade of ice was as thick as a human arm, and when they were fired at a force that they even damaged the surrounding woods upon shattering on hit.</p><br/><p>Yao Si had an extremely tough time running, for she had to dodge the ice blades while also avoiding being smashed by the falling trees as well. What was even more critical was that in her hand she was still holding an idiot. If it weren’t for the experience she’d gained over the last few days from being tricked by Qu Ze, there would have been no way she could’ve ducked so skillfully.</p><br/><p>For a heartbeat, she had the illusion that she had been transported into the game of Plants vs. Zombies, behind them were the field of plants and they were the zombies.</p><br/><p>In a moment like this, she only wanted to scream a sentence: “Qu Ze, I want to eat your brain!”</p><br/><p>Hell, this fool’s brain was clearly not for thinking, it was probably for water storage!</p><br/><p>–</p><br/><p>Yao Si dashed feverishly for half an hour until finally leaving the range of the flower attacks. Rolling her eyes at a certain culprit for her misery, she rested her hands on her knees for support. She didn’t even have the energy to curse at him. Luckily those flowers were slow moving, otherwise they would have been stabbed until they looked like sieves.</p><br/><p>“Wow wow wow, I would have never guessed that those flowers other than eating people can also attack like that. So scary!” Qu Ze’s mouth pronounced words of fright, yet his expression was filled with enthusiasm. It was probably because he’d gotten used to digging holes for her over the past few days, so there was no shame of having done anything wrong on his face.</p><br/><p>“Scary and you go and bother them! Are you insa…” Wait, she’d already decided he’s insane.</p><br/><p>“Your highness…” He looked sideways at her as if he had suffered from an injustice. “I thought that your highness liked it, that’s why I wanted to get the orb and show it to you.”</p><br/><p>“Who would like such a thing!” It was obvious that it was him looking for trouble without saying a single word!</p><br/><p>“Really… Don’t like it?” His eyes softened, and injured expressions took shape on his face.</p><br/><p>This again. Every time he did something wrong he would have this ‘little poor puppy’ look, making her boiling anger stop at her throat, and she wouldn’t be able to stay anymore. It was fine once or twice, but when he did it every single time, she grew immune to it.</p><br/><p>“Don’t. Like. It!” Her words were resolute and decisive.</p><br/><p>“Oh… I think this orb is quite pretty.” He flew the purple orb up and caught it again “But if your highness doesn’t like it, then never mind.”</p><br/><p>“Why do you even still have it?” Yao Si’s heart tightened, how carefree was this person’s heart? If they still had it in their possession and those flowers caught up, what would happen then? “Throw it away, quickly!” She moved directly towards him, planning to grab and throw the orb away.</p><br/><p>However, Qu Ze’s hand suddenly pulled back, ducking away. Maybe because he didn’t have a firm foothold, he took a step back and a cube fell from his body. Yao Si could faintly hear the long tone of ‘beeeep’.</p><br/><p>“This fell from…” She instinctively bent and picked the cube up.</p><br/><p>Qu Ze’s expression changed, and he suddenly yelled out, “Don’t touch it!”</p><br/><p>But she had already picked it up. Immediately a line of black letters projected from the cube and took form of words in her eyes.</p><br/><p>–Stimulation setting shutdown!</p><br/><p><em>What?</em></p><br/><p>“Humph, I’d have never thought that you would find out so soon!” said a familiar yet much colder than usual voice.</p>\n</div>"}