{"title": "Chapter 25 - Can I Beat Him Up Again", "id": 25, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-25-can-i-beat-him-up-again", "volume_title": "Volume 1", "body": "<h1>Chapter 25 - Can I Beat Him Up Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Ah! Ah?” Qu Ze was dumbstruck, his expression that was aflame with indignation suddenly stiffened on his face, as if he couldn’t instantly grasp what he’d heard.</p><br/><p>“Qu Ze, are you treating me like an idiot?” Yao Si sneered. “The Union, the Zergs, and the catastrophes that the bloodlings endured, did I cause any of them? What has it got to do with me? Even this ‘Your Highness’ and the thing of summoning you back to the Red Planet, did I do any of them? I’ve never forced you to do anything, so don’t even freaking think about pretending to have the moral ground on me! You’re not living comfortably so you think the whole world is to blame. You think everyone is your mom!”</p><br/><p>“…” He was speechless.</p><br/><p>“I don’t care what intentions you have, but the things that happened the last few days, even if you did have absolutely justifiable reasons, they have nothing to do with me!”</p><br/><p>“You…” He seemed to want to say something else, but rumbling sounds suddenly began to ring above them.</p><br/><p>Qu Ze blanked out, then chuckled and corrected himself. “They arrived so quick… Not bad!” He clicked something on his palm and immediately the surrounding white walls receded like a light curtain, exposing the outside world.</p><br/><p>Only then did Yao Si realize that the place they were at was a patch of red-grass lawn. One she also knew since it was close to her current residence; she had taken a stroll through here before.</p><br/><p>In the sky overhead hovered dozens of air crafts filled with bloodlings who looked worried sick.</p><br/><p>“Your Highness!” Yao Qian was the first to hop down and stride next to her. “Are you alright?” He took a look at her, then immediately held up a detector like device to check her condition. “You have suffered and it’s all my fault, only realizing now that you’re here.” He looked as if he was about to break into tears.</p><br/><p>“I’m fine,” Yao Si could only reply to him with a smile.</p><br/><p>“How can you be fine, you’ve been missing for so long, and was with…” It looked as if he suddenly remembered something and turned and yelled at Qu Ze, “Great elder, you’ve gone too far! How could you take her highness away like that, and intentionally blocking out all the signals as well. What have you done to her highness?”</p><br/><p>“Hahaha, little thirteen, isn’t she alright?” <em>Isn’t it clear that I’m the one in a worse situation?</em></p><br/><p>“You call this alright!” Yao Qian pointed at Yao Si who was covered in dust and mud, and wanted to cry even more. He turned back and looked towards Qu Ze as if he had just realized his strange state. “Great elder, what’s wrong with you, why are you bowing?”</p><br/><p>“Eh… There’s been a small accident.” Qu Ze raised his hand and indicated just how small with the gap between his thumb and index finger. Recalling the beating which he just took, he felt that his crotch was in even more distress. No wonder she was their race’s ancestor, even when beating people up she was so… professional!</p><br/><p>Yao Qian was still a little confused, but Yao Si lifted Qu Ze up straight away and shoved him over. “I’m handing him to you, deal with him however you like, just inform me when you do.”</p><br/><p>Yao Qian promptly caught him and handed him over to the other elders who had followed behind.</p><br/><p>“Your Highness, it’s a relief that you’re fine,” one of those elders said after taking a look at her. He then exhaled a long breath and turned to glare at Qu Ze. “Great elder, in view of your self-appointed task, and its consequences, you’ve greatly displeased all our kind. You will have to take full responsibility for this incident.”</p><br/><p>“Okay, okay, okay!” Qu Ze raised both of his hands and made a surrendering motion. “I’ll follow you guys back and you can deal with me however you wish,” he said right after, and then, covering his crotch with one hand, struggled up some elder’s aircraft. While he did that he didn’t forget to turn and wave at Yao Si, saying “Goodbye, Little highness.”</p><br/><p>Once the elders saw that he had the look of a ‘dead pig not fearing the heat of boiling water’, their faces darkened. They greeted Yao Si in a hurry, then after repeatedly instructing Yao Qian, they boarded their own aircraft and flew in the direction of the Elders’ Committee.</p><br/><p>Right then, there were only Yao Qian and Yao Si left on the lawn.</p><br/><p>“How will you people punish him?” Yao Si couldn’t help but ask. Judging by the serious looks of the elders, it appeared that taking her away for so many days was actually a grave matter. “It couldn’t be eternal sleep, right?”</p><br/><p>“Your Highness…” Yao Qian looked at her strangely. “Why would you ask?”</p><br/><p>She told him the words that Qu Ze had just said. “He said he kidnapped me because he was dissatisfied that I hadn’t protected the bloodlings yet still have such a high status.”</p><br/><p>After hearing all this, Yao Qian’s expression changed. It became even more odd, and it almost looked as if he had constipation.</p><br/><p>Some time passed before he said, “Your Highness, do you think… with our kind’s special traits, do we need people to protect us?”</p><br/><p>Yao Si was stupefied, and her whole person suddenly became stiff.</p><br/><p><em>Shit! Shit! Shit! Shit! So all those words filled with indignation were all just nonsense like I guessed?</em></p><br/><p>“From my understanding of him, the great elder was probably… just purely manipulating you for an experiment.”</p><br/><p>“…Is there still time for me to catch up and beat him up again?”</p>\n</div>"}