{"title": "Chapter 28 - Damn Single for Billions of Years", "id": 28, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-28-damn-single-for-billions-of-years", "volume_title": "Volume 1", "body": "<h1>Chapter 28 - Damn Single for Billions of Years</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Mu Xuan was awakened by the draw of the bloodline. The moment he woke up, even he could hardly believe that he could sense his own bloodline from somebody else. It was an odd feeling, like despite your body being over here your heart beat in the other person. That beat felt sturdy and vigorous, and suddenly he recalled how someone had once described to him seeing their descendant—it was a feeling as if… you were alive!</p><br/><p>He felt the unusual beating in his chest, and wondered about how this was what having descendant felt like.</p><br/><p>It wasn’t like he hadn’t thought about what would happen if he was to have a descendant in the past. Initially, though, he didn’t want want one, while later he couldn’t have!</p><br/><p>When he saw the person before his eyes, he suddenly gained some understanding toward those of his kind who had lost their descendants and then did everything in their power to drag their enemies down to hell with them. If his descendant met with a mishap… He believed that he wouldn’t mind burying the entire galaxy with her.</p><br/><p>He couldn’t resist waking the person before him.</p><br/><p>Then he realized that this descendant of his was… a little different from what others had said.</p><br/><p>Her abilities were unbelievably weak. By reason, this was already the galactic ages, so a fifth generation bloodling like her shouldn’t be as weak as she was no matter how moronic they were. However, she couldn’t even stand just a slight activation of the bloodline in her. The bloodlings’ powers came from their bloodlines, so was his really that weak?</p><br/><p>For the first time in his life, Mu Xuan began to have doubts about his ability.</p><br/><p>Based on her questions, he realized that she actually came from the same era as he, born on the Blue Planet billions of years ago! Then a question surfaced in his mind, how did such a weak descendant manage to survive?</p><br/><p>“What’s your special ability?” he couldn’t help but ask.</p><br/><p>“Eh…” Yao Si froze. “I want to know the answer to this question as well!”</p><br/><p>“You haven’t awakened your ability?” Mu Xuan was shocked.</p><br/><p>“The reason is very complicated.” Yao Si cleared her throat and explained how she had slept through the entire lifespan of a planet.</p><br/><p>“You mean… Not long after you were converted, you were forced into hibernation?” The more Mu Xuan heard, the tighter his brows locked together.</p><br/><p>“Yes, I only woke up recently.”</p><br/><p>“This means that the actual time you spent being a bloodling is less than half a year?”</p><br/><p>“You could say it like that.”</p><br/><p>Mu Xuan’s eyes darkened, yet they were still indistinctly shining with some unknown brilliance that appeared to be both pleased and sympathetic. He suddenly reached out and caressed her head, and then in a tone that was clearly a few degrees lower he said, “So… still a newborn.”</p><br/><p>“Ha?”</p><br/><p><em>Hey hey hey! </em>How did she become a newborn again? She had finally shaken off that label, don’t put that hat back on her! She didn’t want to return to the kindergarten ever again.</p><br/><p>“Follow me back first.”</p><br/><p>Mu Xuan turned to leave, but then looked as if he had suddenly remembered something. He pulled her in and rose into mid-air before she could react.</p><br/><p>“Wait…” <em>Where are you taking me, hey!</em></p><br/><p>In a flash, he was already flying with her before she could stop him.</p><br/><p>Yao Si peeped at the mess behind them. Were all bloodling fathers this unreliable? The front gate was clearly on the side, so why did he have to jump to the third level while carrying her and then jump out the window!</p><br/><p>–</p><br/><p>Mu Xuan was a little concerned. Due to the connection of bloodlines, newborns were comparably weaker, because of which all descendants were always at their sire’s side from the moment of conversion. They would guide them through learning everything about the bloodlings and accompany them in successfully awakening their special ability. It could be said that the person that accompanied the newborns during the most dangerous and difficult stages of their life were their sires. That’s why there was more than just the draw of the bloodline between the descendant and their sire. Each of them was a very important existence in the other’s life.</p><br/><p>But… there happened such an accident, where Mu Xuan himself didn’t know that he had a descendant.</p><br/><p>Originally, he thought that he had unfortunately missed her entire life. Despite her not saying anything openly, she would still have had to have some resentment deep down. That’s why he had made preparations if she was to reject him, or even resist him for a long time.</p><br/><p>Yet she had not only accepted his identity straightaway, she was still just a newborn, knowing little to nothing about the bloodlings. She didn’t even know about the most basic bloodline awakening. There was still time for everything—he could slowly raise her normally. Time was not a problem, and weak abilities were far from being an issue. He was here, and the last thing that bloodlings lacked was time.</p><br/><p>That left him with only one problem—how does one raise a newborn?</p><br/><p>(⊙_⊙)</p><br/><p>Despite having lived for so many years, Mu Xuan really didn’t have any experience in raising newborns. Still, he wouldn’t go wrong by taking her back to stay where he could see her.</p><br/><p>When he thought about what he had just heard—her being involved in the Bloodling civil war and being forced to hibernate for so many years—an unknown flame of rage suddenly ignited at the bottom of his heart. His cub had suffered so much in places he didn’t know. If the second and third generations weren’t history, he’d go to them right now to have a word or two. His impression of all blonde-haired species in the entire galaxy also dropped by a hundred points.</p><br/><p>Come to think of it, to prevent anymore simpletons from coming up, it would be best to greet the oldest members of his race.</p><br/><p>Thus, after a night of meetings, the deeply troubled elders found out that their majesty, who had been missing for the entire night and was nowhere to be seen on the planet, suddenly appeared in front of them voluntarily.</p><br/><p>“Your… Your majesty!”</p><br/><p>Thank goodness he was really awake! With excitement, everyone knelt down on one knee in unison. It was as if their entire night of tiredness was suddenly swept away. It was such an emotional scene. No wonder he was their king, always appearing so timely.</p><br/><p>They were about to approach him and renew their close relations, but Mu Xuan remained serious. Although, there were some slight signs of showing off in his demeanor. After instructing some things in a hurry, he disappeared, leaving everyone at the scene dumbstruck.</p><br/><p>First thing: Her Highness Yao Si’s house collapsed, so he took her back to the Majestic Palace.</p><br/><p>Broken house naturally cannot be lived in. Yes, that could be understood.</p><br/><p>(ˇ_ˇ)</p><br/><p>Number two: Her Highness Yao Si had been converted less than four months before hibernation, so technically she was still just a newborn.</p><br/><p>That’s why Her Highness’ lack of common sense was a bit serious. Yes, that could be understood as well.</p><br/><p>(ˇ_ˇ)</p><br/><p>Number three: He will personally instruct Yao Si.</p><br/><p>The fourth and fifth generations were closest in bloodline, so His Majesty was showing his care for his own kind. Yes, that could obviously be understood.</p><br/><p>(ˇ_ˇ)</p><br/><p>Number four: Yao Si is his descendant.</p><br/><p>Who didn’t have a descendant, that could be understood…Your ass!</p><br/><p>(╯‵□′)╯︵┴─┴</p><br/><p>His Majesty had a descendant, who did it… Plah… His Majesty could have a descendant… Well… Her Highness Yao Si was His Majesty’s descendant! They did hear it correctly, right! How could that be possible?</p><br/><p>Who in the entire galaxy didn’t know that the strongest among the bloodlings, His Majesty, was damn single for billions of years!</p><br/><p>Although the Blue Planet people were extinct, resulting in obtaining descendant becoming difficult, but no matter how difficult it was, it wasn’t impossible. As the ruler of the bloodlings, their sole king, it was nothing too troublesome if he wanted a descendant. However, what was troublesome was that His Majesty’s genes had changed in that Doomsday Battle billions of years ago. His bloodline was very special and way too concentrated, so there was basically no one that could bear it. That being said, anyone could have descendant but not His Majesty!</p><br/><p>That’s why, after all these years, their lonely king would go into constant hibernation. However, this time when he woke up, he suddenly told them that he already has a descendant… Already has… Has… S…</p><br/><p>(⊙_⊙)</p><br/><p>“Second Elder, do you think that…” The third elder opened his mouth hesitantly.</p><br/><p>“You mean…” The second elder’s face turned pale. He made eye contact with every other elder present, and immediately, an idea rose in everyone’s mind.</p><br/><p>God forbid, His Majesty had gone crazy thinking about descendants. He had pulled a random fifth generation off the street and now claimed she was his descendant. Single people were so scary!</p><br/><p>Everyone silently lit a candle for their new highness!</p><br/><p>“Do you guys think that… we should go and tip off His Majesty?”</p><br/><p>“Who’s going?”</p><br/><p>“…”</p><br/><p>In a split of a moment, the entire conference room fell silent.</p>\n</div>"}