{"title": "Chapter 39 - An Outbreak of Bad Luck", "id": 39, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-39-an-outbreak-of-bad-luck", "volume_title": "Volume 1", "body": "<h1>Chapter 39 - An Outbreak of Bad Luck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yao Si was unconscious for a total of three days. When she woke up, she felt as though she had just finished a marathon. She felt fatigued and restless, but none of it mattered.</p><br/><p>She had an ability!</p><br/><p>Ha ha ha ha ha ha…</p><br/><p>She was no longer a weakling among the bloodlings. Even though the water series was one of the weaker ones, it was better than not having any ability. Besides, even though the bloodlings were immortal, it sucked to only be able to get beaten without having an ability to fight back.</p><br/><p>Yao Si decided to hone her skills and recalled all the books Mu Xuan had arranged for her regarding abilities. Afterwards, she started to recap the initial feeling, trying to feel the energy within her.</p><br/><p>But…</p><br/><p>After an hour…</p><br/><p><em>Mmh, since it just awakened, I’m not very familiar with the technique.</em></p><br/><p>After two hours…</p><br/><p><em>Mmh, maybe I’m not doing it right, time to change the technique.</em></p><br/><p>After three hours…</p><br/><p><em>Mmh, maybe I haven’t read enough, time to study more.</em></p><br/><p>After five hours…</p><br/><p><em>Fu*ck, why can’t I feel anything? Hadn’t my ability awakened!</em></p><br/><p>“Sisi.” Mu Xuan couldn’t bear to look any longer. He pulled her up onto a chair with disagreement on his face. “Have your meal first!” She had been sitting there motionless for the entire day. Even if it was urgent, she needed to eat.</p><br/><p>“Dad…” Yao Si felt a strong urge to cry.</p><br/><p>“Not dad.” Mu Xuan frowned, hating the term. “Use my name.” Blood relations didn’t exist among bloodlings. Father was just a respectful term for a child to call their mentor, but somehow his child had misunderstood, imagining him as her real father.</p><br/><p>In the beginning, he didn’t seem to mind, but right now, he couldn’t seem to accept it.</p><br/><p>“Mu Xuan…” Yao Si tugged on his clothes, sobbing sadly. “Was I dreaming? My ability awakened, right? Back when we were at Eternal Brightness, you saw me summon water… Is my ability the water series?”</p><br/><p>“Mmh.” When her ability had erupted, it almost drowned the entire city.</p><br/><p>“Then why can’t I feel anything?” Her method wasn’t wrong. She had already confirmed multiple times, but somehow her body felt empty, bearing no resemblance to the information in the books describing how it should feel. “I’ve been trying the entire day!”</p><br/><p>Mu Xuan brought her a bowl of blood nourishing soup, then glanced at her face. She was on the verge of breaking down, and so he moved to pass the bowl over. “Don’t worry, it was just the first time you summoned your ability. Since you’ve exhausted yourself so thoroughly, it must have not returned to its normal state.”</p><br/><p>“You mean the energy released was too great and I haven’t recovered?”</p><br/><p>“Mmh.” He nodded, then noticed that she remained motionless and rushed her. “Hurry and eat, you’re still recovering.”</p><br/><p>“Alright.” <em>So abilities need to rest as well </em>. Yao Si hurriedly downed the entire blood nourishing soup at a go, passing the empty bowl back. “I want seconds!” She wanted everything that could recuperate her strength.</p><br/><p>Wasn’t it just taking a break? It would recover in a while.</p><br/><p>But it never dawned on her that the wait might go on for three whole months. The entire time, regardless of what method she tested, she still wasn’t able to feel any change within herself.</p><br/><p>Yao Si started to sink into despair, was there something wrong with her blood? Like maybe her genes had degenerated? But Elders were strongly against her assumption. They often repeated to her that gene degeneration could only be found in the lastests generations, how could it happen to a fifth generation bloodling like herself! This was a few hundred generation gap after all!</p><br/><p>It made so much sense she couldn’t refute anything.</p><br/><p>Yao Qian suggested that she sought Mu Xuan’s advise, but Mu Xuan seemed to be busy the whole time. Even if she wanted to discuss it with him, he wasn’t around.</p><br/><p>When she thought back to the first time he had tested her ability, he seemed to have mentioned that she had a unique one, but she was convinced that it belonged to the water series. How then could it be special? Or had he been trying to hint at how it was a one time thing?</p><br/><p>o(&gt;﹏&lt;)o</p><br/><p>This was worrying indeed.</p><br/><p>Yao Si tossed and turned a few rounds, but still wasn’t able to process the problem, so she lay wide awake. But just as she was about to revisit her books, she heard the door creaking open.</p><br/><p><em>Mu Xuan is back?</em></p><br/><p>Yao Si hurried to the door in excitement, but just as she was about to call out, she heard an unfamiliar voice.</p><br/><p>“Lao Er, do we just enter through the main door, what if someone finds out?”</p><br/><p>“What’s there to be afraid of?” another person scoffed. “Lao San, you have no guts. We’ve entered so many houses the past few days, there was not a soul in any of them.”</p><br/><p>“Yea… But this is the Red Planet,” Lao San said with obvious hesitation.</p><br/><p>“What’s the deal with the Red planet?” Lao San retorted. “Didn’t we receive news that the bloodlings are dealing with the galactic pirates and won’t be back so soon? There can’t be many of them left here, so it’s the best time for us. For our trade, isn’t any location the same.”</p><br/><p>“But they are the bloodlings!”</p><br/><p>“Why shouldn’t we take what belongs to bloodlings?”</p><br/><p>“If you hadn’t drank so much, your senses wouldn’t have gone out of control and that wouldn’t have affected Lao Da’s ability, causing us to return to the Red Planet.”</p><br/><p>“It wasn’t on purpose, besides, it’s not like you didn’t get any benefits. If you’re so scared, return me your share and scram.”</p><br/><p>“You…”</p><br/><p>“Enough!” Just before a fight broke up, the third figure interrupted them in a hostile voice. “What are you two arguing about now? Lao Er is right, the most dangerous place is the safest. These bloodling demons have been living for such a long time, I’m sure they accumulated countless fortunes they they can no longer keep track of. Just a tiny amount will be enough for us to set ourselves up for the rest of our lives. As long as you guys learn to restrain yourselves and ensure that we leave no obvious tracks, they won’t notice.”</p><br/><p>“No worries, I’ve been monitoring this house for the entire day, there hasn’t been any activity so far. I’m sure everything will be fine.”</p><br/><p>“We can never be too sure,” the third person continued to instruct coldly. “Lao Er, check the security code once more, see if there has been any automatic police alarm. Hack into the owner’s Alliance bank account while you’re at it as well. Lao San, take a look around to ensure there aren’t any traps. Nothing can go wrong tonight.”</p><br/><p>“You’re so thoughtful, Lao Da.” Lao Er laughed cheekily.</p><br/><p>“Stop your boot-licking and hurry up.”</p><br/><p>“Yes, Lao Da!” the two replied in unison, heading off in two different directions.</p><br/><p>Yao Si who was listening in silent the entire time.</p><br/><p><em>Am I really encountering burglars right after I faced a kidnapper? </em> Her insane bad luck sparked a burst of laughter within her.</p><br/><p>“Lao Da! An- An antique! Hurry, everything inside here are antiques from the ancient Blue Planet!” Lao San exclaimed, hugging a flower vase. “Wow, which tycoon stays here? He actually uses…”</p><br/><p>“I stay here!” After sending out an mail to Yao Qian, Yao Si switched on all the lights.</p><br/><p>The house lit up instantly.</p><br/><p>The three burglars turned around instinctively, freezing in their positions.</p><br/><p>The house sank into silence!</p>\n</div>"}