{"title": "Chapter 36 - VIP Customers", "id": 36, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-36-vip-customers", "volume_title": "Volume 1", "body": "<h1>Chapter 36 - VIP Customers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>At that moment, Mu Xuan recalled that the Alliance account would be frozen if there hasn’t been a transaction within the past hundred years. When he woke up from his hundredth year of hibernation, he had been preoccupied with teaching his cub, tossing the entire matter to the back of his mind. The moment the transaction didn’t go through, he was startled, taking a while to process the matter.</p><br/><p>Hence, the machine continually rejected his payment.</p><br/><p>[Your account is frozen!]</p><br/><p>[Your account is frozen!]</p><br/><p>There was an awkward silence…</p><br/><p>._.</p><br/><p>Yao Si reached for his arm, smiling forcefully. “Er… I’ll do it.”</p><br/><p>She mimicked his moves, sending her optical computer over, hoping that the sum from Thunder Sylvani would be enough, else things were going to get even more embarrassing…</p><br/><p>There was a buzzing sound, and a new pop up appeared.</p><br/><p>[VIP customer.]</p><br/><p>Wow! What does that mean?</p><br/><p>Before Yao Si could react, the shop assistant’s face changed swiftly, her perfect commercial smile cracking as though she had just witnessed a shocking affair. With anxiety and fear, she bowed deeply out of a sudden. “I’m sorry! I’ll notify the manager this instant.”</p><br/><p>“Uh? Wait!” Before Yao Si could stop her, she had already disappeared behind the pond.</p><br/><p>That woman should have explained herself… Did it mean I have enough money?</p><br/><p>“Mu Xuan…” She couldn’t help poking a certain someone. “Do you think she’s getting the security to chase us out?” Is there enough time to run?</p><br/><p>Mu Xuan turned to look at her, his stone cold face impassive, without any signs of emotion. Yet when his eyes focused on her, his face held a seriousness he’d never once shown her.</p><br/><p>“What… what’s wrong?” Did she get it right?</p><br/><p>“Sisi.”</p><br/><p>“Ah?”</p><br/><p>“We have money.”</p><br/><p>“Uh?” What was he saying that for?</p><br/><p>Without explanation, he reached out to caress her hair, his expression visibly displeased.</p><br/><p>Yao Si had no idea what was going on, but the next moment, she heard something opening near the lake. A stumpy man clothed in black headed towards them hurriedly, with the previous shop assistant following behind.</p><br/><p>The stumpy man was clearly in a rush, his head soaked in sweat. Reaching them in large, unsteady steps, he greeted, “Forgive me for the poor service!”. After steadying himself, he smiled brightly. “I didn’t know you were coming to inspect the branch today, take your time, take your time.”</p><br/><p>He took a glance at the two of them, but his gaze soon came to rest on her alone. “You must be the young mistress. It’s a pleasure to meet you, I’m the manager of the Eternal Brightness branch. My first name is Zhou, and it’s an honor to serve Miss Lu on your inspection here.”</p><br/><p>Yao Si was the picture of confusion, what situation was this?</p><br/><p>“Er… My first name is Yao.”</p><br/><p>The manager stilled, even more confused than her. “You’re not the young daughter from the Lu family?”</p><br/><p>“No!” She was clearly from the Yao family. And at most she could be considered to be part of the Mu family.</p><br/><p>“You’re not here to inspect the branch?”</p><br/><p>Yao Si shook her head.</p><br/><p>“…”</p><br/><p>The manager’s lips trembled slightly, his perfect smile cracking as he continued, “Hahaha, it’s the same. It’s definitely an honor to be able to serve such a prestigious customer as you.”</p><br/><p>Back when Yao Si was paying, the system had hinted that she was a VIP, and that revelation seemed to have garnered her special treatment.</p><br/><p>“Are VIPs very special?”</p><br/><p>“Miss Yao must be kidding.” The manager regained his conciliatory smile. “VIPs are the highest ranking customers in the Lu Enterprise list, which can only be arranged by the higher ups in the boards, and there are no more than ten people in it in the entire Galaxy. It usually consists of Lu family members.”</p><br/><p>Ten might be an exaggeration, but according to his limited knowledge, this kind of authority was only given to members of the board with more than twenty percent shares. Hence, the only ones that qualified were Mr. Lu himself, the young master from the Lu family, the young mistress. Even Mrs. Lu didn’t have such benefits. Hence, when the manager heard the revelation, he anxiously hurried over.</p><br/><p>“Lu family?” Yao Si recalled something. “You can’t be referring to… Lu Ren?”</p><br/><p>“So you are acquainted with Mr. Lu.”The manager exclaimed in obvious joy. “He’s the next head of the household.”</p><br/><p>“…”</p><br/><p>She finally understood! Initially, when she had just woken up, Yan Xuan seemed to have cheated Lu Ren out of a large sum of money, which included some sort of card. So that dude Lu Ren had opened his own shop?</p><br/><p>“Err… manager, I have an important question for you.”</p><br/><p>“Miss Yao, please ask.”</p><br/><p>“This very important customer…”</p><br/><p>“Mmh?”</p><br/><p>“Can I get a discount?”</p><br/><p>“…”</p><br/><p>The manager froze, his entire being fossilizing for a couple seconds. Are you freaking kidding me? This is the way to prove that you’re the boss!</p><br/><p>“Hehe… Miss Yao, you are a VIP, everything is free.”</p><br/><p>Had that been really such a good deal?</p><br/><p>(⊙_⊙)</p><br/><p>“I want just the storage compartment for now.”</p><br/><p>“Sure… Sure!” The manager wiped off the sweat on his forehead, taking a step to the side. ” Miss Yao, please come this way. I’ll bring you to the operation room and arrange for a master to help you with the installation.”</p><br/><p>Was he bringing her to a professional? Yao Si turned back to look at Mu Xuan instinctively.</p><br/><p>He nodded. “You can go, I’ll wait here.”</p><br/><p>Yao Si followed the manager to the other room.</p><br/><p>Mu Xuan and the shop assistant were left alone.</p><br/><p>“Sir, do you want to rest in the lounge?”</p><br/><p>“No,” Mu Xuan replied, as he glanced in the direction of his cub. When she was finally out of sight, he opened his optical computer and entered the Galaxy’s website to… unlock his account!</p><br/><p>–</p><br/><p>Yao Si just wanted to upgrade her storage, hopefully with interesting advanced technology. In the end, the manager brought her to an empty room which was a stark contrast to the bright jungle-like environment previously. Here, there was just a chair, and on it sat an old man. He had a head full of white hair, his long locks falling onto the ground. He wore a cloak and held onto a cup of tea, looking every bit like a celestial being.</p><br/><p>When he saw her enter, he was startled for a heartbeat. When he finally got back to his senses, he hurriedly stood up, shouting, “Good day!” His tone was polite and formal, his celestial facade ruined in an instant.</p><br/><p>“Old Liu!” The manager led her in. “Miss Yao is an important customer, help her install the optical space, and remember to add the operations seriously.”</p><br/><p>“Sure, boss.” The old man nodded with vigor, totally rid off his celestial facade.</p><br/><p>“Miss Yao, please hand the optical computer to Old Liu.”</p><br/><p>Yao Si did as asked.</p><br/><p>“Miss Yao, please reach out your right hand.” Old Liu instructed when he received the computer.</p><br/><p>Yao Si was confused but still reached out her hand, without a clue what he was going to do. He extended his own hand as well and lightly tapped her arm. After a short while, a drop of blood flew up from between her fingers, but somehow, there was no wound.</p><br/><p>That drop of blood seemed to be alive, floating to Old Liu’s palm by itself.</p><br/><p> </p>\n</div>"}