{"title": "Chapter 48 - Galactic Academy's Entrance Exam", "id": 48, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-48-galactic-academys-entrance-exam", "volume_title": "Volume 1", "body": "<h1>Chapter 48 - Galactic Academy's Entrance Exam</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The experience with the galactic beast had helped Yao Si with her ability’s control. She could now vaguely sense its trajectory. As for the reasons her water ability kept targeting Huo Qi’s flame…</p><br/><p>Mu Xuan’s speculated that since her ability was passive and could only be activated after being triggered by someone else’s ability, the moment it was released, it would instinctively target the one it was the opposite of. After all, once she extinguished Huo Qi’s fire, her water ability disappeared as well.</p><br/><p>The solution wasn’t complex, she just had to master the trajectory. But it wasn’t a skill that could be mastered easily as her ability had a mind of its own. Who knew when she would end up tossing a planet again…</p><br/><p>Mu Xuan decided to expose her to the five different abilities. Fortunately, the bloodlings that had gone to eradicate the galactic pirates were starting to return. This time, she didn’t have to fight some… gigantic beasts. Yao Qiao found a few five-hundred generation bloodlings to practice with her.</p><br/><p>Mu Xuan, in the meantime, insisted on remaining at home to ensure that his ability did not affect her.</p><br/><p>Yao Si immersed herself into training. Every morning, the first thing she did was head to the training ground to have a match with bloodlings of each of the five nature abilities. When it was time for her meal, Mu Xuan would head over to get her.</p><br/><p>Was it characteristic of all dads to be so insistent on having meals on time? Every time it hit meal time, Mu Xuan would arrive punctually, subjecting everyone in the training field to his frosty demeanor. The first time she had forgotten to eat because of practice, Mu Xuan seemed to have made a huge fuss at the Elder Council, after which at least two elders would be stationed at the training field to monitor the time, reporting when it was meal time.</p><br/><p>“Your Highness, it’s lunch time.”</p><br/><p>“Your Highness, it’s dinner time.”</p><br/><p>“Your Highness, His Majesty wants you to return for your meal.”</p><br/><p>“…”</p><br/><p>There was no doubt that actual combat was the best way to improve one’s skill. After being attacked by the little bloodlings’ abilities for a few months, Yao Si finally had an idea of how to aim properly and was able to control the five different abilities. She also realized that the duration of her ability didn’t always match with the opponent’s. Sometimes when her opponent was exhausted, she could still feel a surge of energy within her, although the moment the opponent’s ability stopped operating, hers would disappear as well. She vaguely guessed that it had something to do with the fact that she was a fifth generation bloodling.</p><br/><p>After five months, Yao Si was finally able to control her passive ability. When she was confident that she’ll never accidentally throw a planet again, she ended this training that required her to punctually head back for meals.</p><br/><p>When she was back home, she turned on her optical computer to log into her Alliance account. Right then, several messages from an unknown sender popped up, startling her. She had a small social circle consisting of only a handful of bloodlings, and this was the first time someone else had sent her a message.</p><br/><p>Her curiosity got the better of her, prompting her to open the messages.</p><br/><p>A short chime played, like coins falling on the ground, and the next moment a string of numbers appeared.</p><br/><p>[Received bank transfer of Galactic currency: 126 852. Please ensure it is deposited!]</p><br/><p>What’s this? Was some tycoon giving money away?</p><br/><p>She took a closer look, spotting who it was from: Huo Qi.</p><br/><p>Mu Xuan’s fanboy? Why did he suddenly send her so much money? Fan club membership bonus?</p><br/><p>Just as she was wondering about it, a voice call request popped up. It was from Huo Qi! She hurriedly accepted the call.</p><br/><p>“Sis, you’re finally online.” A screen suddenly took form before her, and Huo Qi’s face appeared on it. “Did you receive the money? It’s from the day we fought the Galactic beast. The Alliance sent out the bonus and I transferred both you and Mu Xuan’s share.”</p><br/><p>It took Yao Si a moment to remember that event. She had never expected him to really send it over. “I received it, thank you.”</p><br/><p>“Spare me the formalities, all of us fans are one family!” Huo Qi replied with imperiously, proud to be a fan of Mu Xuan. “Oh, right, where’s the brother with the same name as God Mu?”</p><br/><p>Yao Si turned to glance at the kitchen. “He’s cooking, want me to get him?” So that you could catch a glimpse of your idol.</p><br/><p>“It’s okay!” Huo Qi shook his head. With a face of regret, he continued, “The Red Planet recently strengthened their customs, so all the tour licenses were rejected and I’m unable to head there. Ech, since we’re both fans, I think we should keep this devastating news from him for the time being.”</p><br/><p>“…” God Mu won’t be upset, really!</p><br/><p>Huo Qi chatted randomly for a time, then someone called him from behind. He turned to reply before continuing, “Sis, I can’t talk anymore. Since we’re both fans that fought the same galactic beast, you can visit me at the Galactic Academy.”</p><br/><p>“Galactic Academy?” Yao Si stilled, this was the first time she’d heard that name.</p><br/><p>“You never expected this bro to be a student, huh.” Huo Qi smiled brightly, adding with glory, “With galactic beast hunting experience, I’ll definitely be the valedictorian of the year. I’ll go now, I have to board the last ship. I’ll call you again another time.”</p><br/><p>He then hung up.</p><br/><p>Yao Si thought for a moment before typing “Galactic Academy” on the web. Information gushed out, and she took a closer look. Galactic Academy was also called The First Academy and was the most famous school in the Galaxy. It was equivalent to Harvard or Oxford in the Blue Planet. All the elite members of the different races were enrolled in this school. Galactic Academy wasn’t like a pure university either, but also had elementary, middle, and high programs as well as college degrees.</p><br/><p>The academy separated its students based on levels, abilities, and one’s biological structure. There was also no age limit for entrance. As long as one could pass the entry requirements, they could enter any of the levels. After completing their studies, the students could either graduate or proceed to a higher level. The elementary level could move to the middle level and the middle level could move to the high level.</p><br/><p>Simply put, as long as one was able to pass the exam, they could enter the school with disregard to one’s age and race. There wasn’t a need to complete a certain stage, either.</p><br/><p>In general, all the famous people in the Galaxy came from the Galactic Academy.</p><br/><p>Yao Si thought about her situation carefully. With Mu Xuan’s around, she wasn’t able to summon her ability, but that wasn’t something to really worry about. However, her lack of basic knowledge needed to be worked on, so entering a school would certainly be a smart move.</p><br/><p>She made up her mind. She wanted to study!</p><br/><p>–</p><br/><p>Father Mu was extremely displeased with his cub’s sudden idea. He was able to answer her every question, so why did she need to go to school? Why couldn’t she just ask him?</p><br/><p>The thought of his cub leaving to join an unknown group of wild children left him in a fluster. If they were all bloodlings, it might be okay, but once other races were involved, he couldn’t be sure of what kind of people she’d encounter. What if they bullied her or led her astray?</p><br/><p>Besides, his cub’s ability… was a little complicated. Even though the Galactic Academy wasn’t considered a dangerous place and other bloodlings would enter it at a certain age, it should be something in the future when his cub was independent.</p><br/><p>It wasn’t that long since he found his cub, barely two years, and she already planned to leave… Who could bear that!</p><br/><p>However, when faced with his cub’s anticipation, he didn’t have the heart to reject her. After almost half a day of hesitation, he finally agreed.</p><br/><p>“Remember to come back for your meals!” Even if his cub knelt down, he had to pamper her.</p><br/><p>○|￣|_</p><br/><p>“Yes, Your Majesty! No problem, Your Majesty!” Completely oblivious to someone’s perturbed emotions, Yao Si tapped her chest in reassurance. “No worries, dad! I will definitely study hard, I won’t embarrass you.”</p><br/><p>After this, Yao Si ambitiously applied for the middle school entrance exam in three months time before swiftly completing the exam.</p><br/><p>Then…</p><br/><p>She failed gloriously.</p><br/><p>○|￣|_</p>\n</div>"}