{"title": "Chapter 43 - The Galactic Beast", "id": 43, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-43-the-galactic-beast", "volume_title": "Volume 1", "body": "<h1>Chapter 43 - The Galactic Beast</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Mu Xuan had mentioned to Yao Si that she still wasn’t familiar with her ability and that’s why she was unable to control it. It meant that she needed more practice, but she had never expected that opportunity to arrive so quickly.</p><br/><p>Yao Si glanced at the sky full of ships, not able to process the situation. All she did was got to sleep, and the next moment she was in outer space, her surroundings filled with ships of every size.</p><br/><p>“Where is this?” <em>Am I sleepwalking?</em></p><br/><p>“The end of the Galaxy, an abyss.”</p><br/><p>“What?” <em>What do you mean?</em></p><br/><p>“This is the Galaxy’s border,” Mu Xuan added. “Any farther and we’d enter a bottomless pit.”</p><br/><p>“Why are we here?”</p><br/><p>Mu Xuan turned to glance at her, reaching out to caress her head. “Your ability is unique and you haven’t mastered it yet, so I brought you here to practice.”</p><br/><p>What did he mean?</p><br/><p>“The best way to improve is through real combat.”</p><br/><p>“Real… combat?” Yao Si asked, startled. She swiftly turned to scan her surroundings which were filled with ships. Her heart sank. “Are you trying to tell me… that all those ships are going to start flying?”</p><br/><p>“Not at the moment.” Mu Xuan didn’t seem the least bit worried. After glancing at the ship in front of them, he seemed to have a sudden thought. He pulled out an object that looked like a drink, and said in a stern tone, “You didn’t have time to grab a bite this morning! Have something to fill your tummy.”</p><br/><p><em>Wait a minute, could you clarify first what you meant by not at the moment? Does that mean they’re really going into combat mode?</em></p><br/><p>“You don’t like it?” When she didn’t reach over for it, Mu Xuan dug into his storage for a few more items and brought out an assortment of hot and cold drinks. As he pulled more items out, he hurried her with a stern expression of a parent who didn’t like picky eaters.</p><br/><p>(._.”) <em>This is, after all, a battlefield, can’t you be a little more serious? We aren’t here on vacation!</em></p><br/><p>“Duck blood curd here, want some?”</p><br/><p>“… Yes!” Yao Si reached for the bowl and downed it in two mouthfuls.</p><br/><p>Even if she was going into combat, she still needed to fill her stomach. She had absolutely no issue with that. It was definitely not because she succumbed to the enticement.</p><br/><p>╮(╯﹏╰）╭</p><br/><p>Yao Si hurriedly finished the soup, drank a can, and ate some snacks. Just as she was wiping her lips, she realized that the ships hadn’t moved an inch. It was as though they had fallen asleep and weren’t ready for any kind of battle.</p><br/><p>There were many ships, and on a closer look she could identify three groups: gigantic transport ships, smaller ships, and machines. There was also a small crowd floating in mid-air, just like her and Mu Xuan, who weren’t in any ship. At a glance, there were over ten of them. Some of them stood on swords, so they were probably from the celestial clan.</p><br/><p>“If they start fighting, which side will we be on?” Yao Si couldn’t help asking. If they were going to practice, then they at least should get their targets right.</p><br/><p>“Which side?” Mu Xuan stilled. He took a glance at her, then finally seemed to process what she had meant and began to explain, “They aren’t—”</p><br/><p>Before he could finish his sentence, a loud noise filled the originally silent space. Mid-air, not far from where they were, a black hole suddenly appeared. It was gigantic, larger than an entire planet, and with a pulling force that sucked everything inside.</p><br/><p>Was this… space summoning?</p><br/><p>Why was it so big!</p><br/><p>Just as Yao Si was still contemplating it, the ships in the vicinity started their operation, positioning their weapons toward the black hole. She could only see red and blue rays shining from the ships, and the next moment they shot at the black hole in unison. A few thousand blinding rays headed inside, like shooting stars.</p><br/><p>A deafening eruption pierced the air, shattering the hole into a blinding whiteness.</p><br/><p>Suddenly…</p><br/><p>A loud howl came from inside, distorting the black hole. A shadow seemed to be ripping it from the inside, struggling to squeeze itself out.</p><br/><p>Yao Si’s eyes went wide with horror.</p><br/><p><em>Cat-Caterpillar! A gigantic caterpillar!</em></p><br/><p>(⊙ o ⊙)</p><br/><p>In less than half a minute, a gigantic caterpillar came squeezing out of the black hole. It was so white it was almost blinding! Its gigantic white body was almost transparent, and an unknown liquid could be seen flowing within it. The caterpillar also had two dense rows of tiny feet.</p><br/><p>“What… what is that?” Yao Si was in a daze. What did that thing eat to grow so large?</p><br/><p>“A galactic beast,” Mu Xuan replied.</p><br/><p>Galactic beast? Wait a moment, why did the name sound so familiar? It seemed… seemed… like perhaps… back when she was drinking the duck blood curd, she had heard that name!</p><br/><p>The galactic beast… was actually a bug?!</p><br/><p>She felt her guts turning inside out.</p><br/><p>“Too bad it’s a bug,” Mu Xuan lamented with regret. “Bugs don’t have blood.” A certain someone was a little disappointed since he had been hoping to find some fresh ingredients…</p><br/><p>Yao Si heaved a sigh of relief and grabbed his hand. “Thanks for saving my gut.”</p><br/><p>“…”</p><br/><p>The caterpillar was finally out of the hole. Since it was injured by the previous attacks, there were black wounds on its white skin. It wriggled out, then crawled around and howled in anger.</p><br/><p>The next moment, a massive gust of wind blew, sending a few smaller ships flying.</p><br/><p>A few of the ships still in place started to take action once more. The celestial race men threw something out, and six invisible light walls appeared, trapping the caterpillar in something akin to a box.</p><br/><p>The other people started to activate their abilities as well. Gold, wood, water, fire, and thunder—all sorts of abilities were summoned, and all of them were directed at the caterpillar. A number of the ships in the surroundings started to flee.</p><br/><p>It was then that Yao Si finally understood the situation. These people had gathered here not to fight but to catch the caterpillar… No, the galactic beast.</p><br/><p>“Go on, don’t be scared, I’ll be right behind you.” Mu Xuan pointed in the direction of the caterpillar.</p><br/><p>“Mmh.” Yao Si nodded. She placed the flying equipment she had prepared in advance on her hand and headed in the direction of the fighting.</p><br/><p>She finally understood why Mu Xuan had brought her here. Her ability would only grow when she met a worthy opponent. Even though all bloodlings had abilities, everyone naturally had a Triple-S nature, making it hard for her to find a suitable training partner. Previously, after Yao Qian had casually triggered her ability, she almost destroyed the entire practice ground. If they actually fought with both parties using their full strength, the entire Red Planet might go down with them.</p><br/><p>In contrast, there were many abilities available here, which could aid her in unleashing her new ability. Besides, the galactic beast was huge, and with visibly thick skin. Even if she couldn’t control her power and accidentally used too much strength, it wouldn’t pose too much of a problem.</p><br/><p>Judging from the color and model of the ships here, they were probably not from a regulated place but were ruthless hunters that followed no law. Even if she and Mu Xuan joined in, no one would catch on.</p><br/><p>This was indeed the best place for her to practice her ability.</p>\n</div>"}