{"title": "Chapter 46 - Goodbye Caterpillar", "id": 46, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-46-goodbye-caterpillar", "volume_title": "Volume 1", "body": "<h1>Chapter 46 - Goodbye Caterpillar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>After undergoing Huo Qi’s ‘lecture’, Yao Si found out that galactic beasts would appear about three to four times each year near the border. So far, the origins of these bizarre and massive beasts remained unknown, but since they were both useful and a delicacy, these were highly sought after. And since they always appeared far from most of the races, they hadn’t garnered a deep hatred, and some were even welcoming to them.</p><br/><p>A galactic beast’s size and impact had ten stages in total. Stages one to three were the smaller ones, stages four to five were capable of swallowing planets, six to eight had abilities, and the ones above eight were rare species that almost never appeared. The ones that required the Alliance army’s intervention to eradicate, like the massive caterpillar they had met earlier, was only a stage four galactic beast.</p><br/><p>Since the border of Galaxy was too far off, it was too expensive for the Alliance to send their troops every year, so the hunting of these galactic beasts was often voluntary. Regardless of whether it was a group or just one individual, as long as they weren’t afraid of death, they could come forth to fight the beasts, and as long as they managed to kill it, they would qualify for a reward.</p><br/><p>In order to increase efficiency, the Alliance would predict the location of the beasts and employed Celestial clan’s members who were well versed in trapping enchantments or members that had trapping capabilities. They would then place a spell on the galactic beasts so as to restrain their movements.</p><br/><p>Anyone could join in the fight, and when the Galactic beast died, all the participants would be rewarded based on the calculated ratio. The Alliance would always take 10% of the profits for the predictions and employment of the celestial clan.</p><br/><p>That was one of the reasons that there were so many different ships, which Yao Si had originally seen as noble superheroes that came forth to kill the beast. The Celestial clan was the only truly official representative. They usually used an enchantment to trap the beasts and that’s it, since their duty was not to kill the beast but to keep everyone safe.</p><br/><p>However, they weren’t impenetrable and couldn’t always hold the galactic beasts with their abilities. Once in a while, there would be news of them being eaten.</p><br/><p>“It’s hard to earn money nowadays.” Huo Qi shook his head. He glanced at them, then added with a voice that was full of complicated emotions, “Ech, I can’t decide whether you guys are fortunate or not. Even thought your first encounter was with a stage four beast, it ended up escaping. And no one knows when…”</p><br/><p>Before he could finish his sentence, red lights started flickering in the skies, and an emergency announcement filled the space station.</p><br/><p>[Warning, warning! The space station will be attacked by a galactic beast in thirty seconds]</p><br/><p>“F*ck, the beast is here!” Huo Qi bolted up abruptly. “What a friendly creature it is, sending itself up here,” he exclaimed with excitement. Without bothering to waste anymore time, he turned and headed out. “Guys! I’ll be off now, any later and we won’t get anything.”</p><br/><p>Yao Si scanned the room, the rest of the crowd were rushing out in the direction Huo Qi had left in.</p><br/><p>“Mu Xuan?”</p><br/><p>“Let’s go!” He nodded.</p><br/><p>Yao Si followed hurriedly after the crowd. When they were out, their surroundings were almost empty. The stationary ships had already risen up into the air. She lifted her head, and directly in front of the space station saw a distorted portal. It looked as though someone was going to dash out any moment, just as the caterpillar had done before.</p><br/><p>With her flying gear on, Yao Si headed in the direction of the crowd, but since she had lagged behind and there was originally a huge number of people in the space station, there was no longer a spot in the skies when she arrived. The skies were packed with people and ships, and she could only situate herself at the very back.</p><br/><p>Judging by the huge crowd, there was no way she was going to squeeze through, and so she silently said a prayer for the beast… How did it choose its location, ending up right outside the enemy’s camp. Even if it was hungry, it shouldn’t seek death like that…</p><br/><p>Wait! A planet.</p><br/><p>She turned, her eyes widening as she stared at the yellow planet. While everyone’s attention was up ahead, no one noticed the sudden appearance of a jagged white gleam above and below the planet, and the space between the two lights was starting to shrink…</p><br/><p>No! It wasn’t just some light, those were teeth!</p><br/><p>“The Galactic beast is behind!” Yao Si couldn’t help shouting out.</p><br/><p>Turning swiftly, she flew towards the planet behind, but it was already too late. The gigantic mouth had already closed shut, and the originally yellow planet had now disappeared. Only then did Yao Si spot the massive snowy white figure that floated behind the planet.</p><br/><p>This was… the caterpillar from previously! It was back again.</p><br/><p>(⊙_⊙)</p><br/><p>“It’s the galactic beast that disappeared just now!” someone exclaimed.</p><br/><p>“Planet 14… has been eaten!”</p><br/><p>“This galactic beast was able to attack so silently?”</p><br/><p>“Is it really just stage four?”</p><br/><p>When everyone finally processed the situation, they turned, flying over. The Celestial clan was the first to arrive, and once again they placed an invisible enchantment onto the caterpillar.</p><br/><p>The surroundings were quickly filled with people with abilities.</p><br/><p>The caterpillar that had just ingested a planet no longer struggled like before. It instead howled in anger, and a few thousand shots of the sticky substances broke past the enchantment, heading towards the crowd.</p><br/><p>A thousand horses trampled over Yao Si’s heart. Even though she had been the farthest away, it had suddenly turned into the most dangerous spot. She could only dodge from side to side, barely able to avoid the green shots. Fortunately, a familiar sense of energy surged within her.</p><br/><p>She scanned her surroundings. There were many people around with every possible ability, so this time, she wasn’t sure whose ability she would end up tagging onto.</p><br/><p>Just as she was about to reach out and test it, a ship behind erupted with a blue light.</p><br/><p>The next moment, just like a shooting star, something flew past her, directly into the caterpillar. But just as it was about to hit the beast, a whirling dark hole appeared around it, and the blue light instantly disappeared upon contact. It was as though it had fallen into a bottomless pit, gone without a trace.</p><br/><p>The caterpillar howled once more, and several more dark holes appeared. It seemed as if the entire galactic was rotting. The holes kept on growing larger, turning everything into a layer of darkness before disappearing.</p><br/><p>“This is… devouring!”</p><br/><p>“Good heavens, it’s a galactic beast with an ability!”</p><br/><p>“Ability… it’s a stage seven beast!”</p><br/><p>“And it actually has a devouring ability!”</p><br/><p>Horror clouded everyone’s face. Those that were still inching forward froze, but it was all too late, several of the ships had already started corroding from the contact with one or the other black hole. There was even a hole at the tip of the space station. The entire place shook, disappearing bit by bit.</p><br/><p><em>Mu Xuan!</em></p><br/><p>Yao Si’s heart sank, and she flew in his direction.</p>\n</div>"}