{"title": "Chapter 53 - Student Union's First Meeting", "id": 53, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-53-student-unions-first-meeting", "volume_title": "Volume 1", "body": "<h1>Chapter 53 - Student Union's First Meeting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p><em>Knock, knock, knock…</em></p><br/><p>Just as Yao Si was worrying about whether someone else would come to touch her head, someone knocked on the door, interrupting the room full of crazy fans.</p><br/><p>“President Yao!” A blonde-haired boy stood at the door, scanning the room impatiently. He had both hands in his pockets as he glanced at her in a relaxed manner.</p><br/><p>He seemed familiar. Wasn’t he the person on stage yesterday, the bloodling with the name….</p><br/><p>“Yi… Yi…” Didn’t it go along the lines of Yi?</p><br/><p>“Bai Yi!” He glared at her disapprovingly. “How could you be late for the first weekly meeting?”</p><br/><p>“Weekly meeting?” <em>What’s that? </em> She had no idea since she had left early the day before. “But…” She shifted her eyes toward Chu Jing who had just fainted. She should really send her to the nurse…</p><br/><p>“She’s from the Heba tribe,” Bai Yi interrupted her hesitation. “Whenever they get agitated, they would enter a pretend death mode. They can faint up to ten times a day.”</p><br/><p><em>Heh… Pretend death is normal? What a world… </em></p><br/><p>“All right, all right, let’s hurry! Everyone’s waiting.” He took hold of her arms and dragged her out of the room. “Heh, something must be up with Shu Cheng to have elected you as the president.” Once they started walking together, he continued to criticize her.</p><br/><p>“You must have done some amazing things in your last life to have such luck. Ever since the academy was built, there hasn’t been a president that wasn’t a bloodling.</p><br/><p>“Shucheng didn’t even think it through. Is everyone actually eligible to be the president? Others aside, how many of us bloodlings are honest?</p><br/><p>“The bloodlings in the academy would never listen to him if his ancestor wasn’t the Thirteen Elder. As an outsider, how are you going to manage the academy? Any other race will easily rip your hands off .</p><br/><p>“But you’re f*cking lucky to have bumped into His Majesty the very first time he visited the academy. With his one word, everything should be fine.</p><br/><p>“Your life improved just like that. It was the first time I saw His Majesty, If…”</p><br/><p>Yao Si walked quietly, speechless.</p><br/><p><em>This dude… is so naggy…</em></p><br/><p>“Mmh? Why aren’t you replying?” He turned around abruptly.</p><br/><p>“I…”</p><br/><p>“Oh, I understand, you must be nervous, right?” Before she could respond, he continued, “I guess it’s understandable, since you became a member out of nowhere. You must feel like everything’s a dream now. How could someone that isn’t a bloodling be able to speak to His Royal Majesty? But you don’t have to worry, even though you aren’t a bloodling, our race has its values, since Shucheng chose you, we won’t make this difficult.”</p><br/><p>“Actually…”</p><br/><p>“There isn’t much to the student union, especially for the president. The other members are just a few elders. For matters that we can settle, we will make the decision. Today’s meeting is just a formality. Since Gu Shucheng is the new vice president, he’ll take care of the matters while you aren’t familiar with the system . That guy is really putting in a whole lot of effort for you. Yesterday, he mentioned that he was going to get you for the meeting, but since I was curious, I decided to get you myself instead. Oh right, what’s the relationship between you guys?”</p><br/><p>“That’s because…”</p><br/><p>“Forget it, what could it be? That guy is such a bore, after half a day, I still wasn’t able to get anything out of him, he’s so rigid… Besides, he wouldn’t be interested in a new biological series student. Let me tell you… <em>Blahblahblah.. </em>.”</p><br/><p>Yao Si was denied any opportunity to speak.</p><br/><p><em>Forget it, you can talk by yourself if it makes you happy. </em></p><br/><p>–</p><br/><p>Naggy Bai Yi was right, there wasn’t much to do in the student union. Or rather, it was she who didn’t have much to do. The student union was had at least a hundred committee members. The day before, due to Mu Xuan’s sudden arrival, the election for the various departments couldn’t be held, so the previous committee members were re-elected, with only a few changes in their positions. Even so, they seemed familiar with their tasks.</p><br/><p>Yao Si sat in the office for a few hours, signing, stamping, and writing the words “Completed” on a few documents. Other than the minor uproar she caused when she arrived, the members seemed to have accepted this unknown president, without an ounce of judgment. Occasionally, Yao Si could feel their glances, as if they were trying to work up the courage to speak to her, but all of them were stopped by Gu Shucheng.</p><br/><p>Yao Si witnessed the workings of the student union, and learned about the differences between the academies in the Blue Planet and the Galaxy. The Galactic Academy was actually operated by the student union. They took care of every detail from the employment of the teachers and setting of class schedules to administering school rules. Without any leading figure, the student union held all the authority. Thus, the student union had a lot on its plate.</p><br/><p>After working the entire afternoon, Yao Si could only finish half of her workload. Fortunately, she had no lessons in the afternoon or she would have been exhausted.</p><br/><p>“We’ll stop here!” Gu Shucheng ended the meeting after glancing at the time.</p><br/><p>Yao Si sighed, but just as she was about to leave, a department head stood up. “President! There’s an urgent matter, Zhuo Feng Academy requested a friendly battle, I think…”</p><br/><p>“We can discuss this tomorrow,” Gu Shucheng interrupted after taking a couple more glances at the time. “It’s lunch time, everyone is dismissed.” He turned to look at Yao Si seriously, reminding her, “Your Hi- President, it’s time for lunch, I’ll send you back!”</p><br/><p>“Er, I don’t think its necessary… right?” She could go back by herself.</p><br/><p>Gu Shucheng paled and shook his head vigorously, “No, no, no! It’s my duty.” <em>If you’re even a minute late, the Elder Council will kill me, so I need to keep a close eye on you!</em></p><br/><p>Yao Si stared in disbelief, then stood up as he wished. Just then, Bai Yi interrupted, “Why bother, we can just order delivery.” He tapped his optical computer, and a menu popped up. “I heard that there’s a new chef and homemade duck blood curd. President, I’m sure you haven’t tried it, why not—”</p><br/><p>“No!” Before he could finish his sentence, Gu Shucheng had already denied him flatly. It was the Elder Council’s highest order. He had to ensure its success at any cost. “The! President! Has! To! Be! At! Home! For! Her! Meals!” How could the chef compare to His Majesty!</p><br/><p>Bai Yi stilled, glancing at them suspiciously. “What’s with this tense mood? What’s wrong with the canteen’s food? You…” Then, a preposterous thought struck him. His eyes went wide, and his eyes jumped from one of them to the other in shock. “F*ck, Shucheng… You can’t possibly have fallen for her… Are you bringing her out on a date?”</p><br/><p>The crowd turned over in a single motion, one long-legged sister from the opposite side of the room sweeping Yao Si up and down several times in particular.</p><br/><p>“What are you saying?” Gu Shucheng’s face darkened. How would he dare! “I’ve reminded you so many times to mind your language. Enough, let’s all have our meals.”</p><br/><p>Without caring for others, he led Yao Si out, while continuously checking the time .</p><br/><p>When they were finally alone, he gravely said, “Your Highness, I hope you won’t take it to heart. Bai Yi is still young and has always been playful.”</p><br/><p>“It’s okay.” Wasn’t it just a casual remark?</p><br/><p>“Don’t worry, You Highness, I will definitely keep your identity under wraps. No one will know about it.”</p><br/><p>Yao Si stilled. “Who told you I wanted to keep it a secret?”</p><br/><p>“I understand, even though it can be difficult since His Majesty is so remarkable, what— Huh? What did you just say?” He turned abruptly toward her, almost hitting a wall. “You-you-you had no intentions to hide your identity?”</p><br/><p>“Yea!” She was totally fine with everyone knowing she was a bloodling.</p><br/><p>“Then… Then why didn’t you enter high school directly but instead joined the elementary school?” he asked with wide eyes. “Wasn’t it to experience life?”</p><br/><p>“Er…” She coughed awkwardly. “… Let’s leave my identity a secret!” She was never going to admit applying for the exam.</p><br/><p>“Yes, Your Highness!”</p>\n</div>"}