{"title": "Chapter 54 - Nephew Gu Missing", "id": 54, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-54-nephew-gu-missing", "volume_title": "Volume 1", "body": "<h1>Chapter 54 - Nephew Gu Missing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Being an academy’s lucky charm is an experience.</p><br/><p>Even when Yao Si was in the toilet, she could hear people flaunting. “Do you know the student union’s president? God Mu actually touched her head!”</p><br/><p>“…”</p><br/><p>Yao Si felt her heart clench. Ever since she became the president, she hadn’t once felt the pressure or difficulties that she had imagined herself about to face. The entire academy remained civil and respectful toward how things turned out, and even members of the student union were blindly obliging toward her demands. The president’s words were basically an ultimatum. Even if someone disapproved occasionally, it didn’t matter. They would have to change their views!</p><br/><p>What? What if something went wrong?</p><br/><p>Rubbish! How could the person chosen by God Mu be wrong! There was one basic value every God Mu fan had to have, and that was blind trust in him. Questioning the president was akin to questioning God Mu!</p><br/><p>President is a newcomer?</p><br/><p>What’s wrong with being a newcomer? Aren’t newcomers allowed to be popular? She had been chosen with votes from the entire school! Besides, which academy in the Galaxy had a student union president that had been personally chosen by God Mu?</p><br/><p>Mu Xuan’s diehard fans were spread far and wide, and their ability to brainwash themselves to suit his wishes was undeniably remarkable. Yao Si had originally planned on quitting the committee using her lack of capability as an excuse, but that was no longer an option now. The very thought of it… was so frustrating!</p><br/><p>“President, president…” The department head at the side tapped onto her arm.</p><br/><p>“Ah?” Yao Si had been in a trance while working. She now stopped her hands and lifted her head from the pile of documents, then glanced at the crowd in front of her that was having a meeting. “What’s wrong?”</p><br/><p>“It’s regarding the Zhuo Feng Academy. They would like to have a friendly competition with us,” the department head said seriously. “The proposal is ready, we just have to confirm the location and date.”</p><br/><p>“Friendly competition…” It sounded familiar. Out of habit, Yao Si turned to the side. “Isn’t Nephew Gu… <em>Cough. </em> Vice President Gu in charge of that… Eh?” The seat next to her was empty. “Bai Yi, why isn’t Shucheng here?”</p><br/><p>“How would I know?” Bai Yi stopped playing with his pen. “Hey, President, even though me and Shu Cheng are from the same generation and we’ve been playing together since we were young, I’m not psychic, I can’t read his thoughts. Besides…”</p><br/><p>“Enough. Luo Ying, what do you know?” Yao Si interrupted, no longer able to withstand his chatter… If it continued, even the readers might misunderstand and think the author was trying to increase the word count.</p><br/><p>“I’m not sure either.” Luo Ying was the long-legged female from before. She was the head of the entertainment department. After Bai Yi, she was the closest to the vice president. “He hasn’t been home for the past few days and hasn’t informed me about his whereabouts, but… he returned to the Red Planet a while back, I’m sure it has something to do with that! President, you don’t have to worry, it’s normal for a bloodling to disappear once in a while.”</p><br/><p>“…” Was there really such a tradition?</p><br/><p>“Our race has always been withdrawn and aloof, we rarely stay in one place for a long period of time,” she explained. “Even sinking into hibernation for a couple of years os considered a norm, much less skipping a few days of school.”</p><br/><p>“I think…” Bai Yi interrupted. “Shucheng must have…”</p><br/><p>“Alright, we’ll it end here!” Yao Si stood up. “We’ll discuss the friendly battle when Vice President Gu is back.”</p><br/><p>“Ey, I’m not done yet…” Bai Yi was still planning to continue. “President… President…”</p><br/><p>Yao Si was already at the door. Fortunately, she left swiftly, for just after a few days, she could no longer withstand Bai Yi’s incessant chatter.</p><br/><p>She lowered her head to glance at the pile of documents in her optical computer. With a deep sigh, she reminisced on how it used to be taken care of by Nephew Gu.</p><br/><p>A wave of worry stirred, and an ominous vibe ate at her. According to Luo Ying, the bloodlings were always a carefree bunch, sinking into a hundred-year hibernation at random, because of which disappearing for a few days was considered a norm. Yet even though this might be normal for others, it was definitely not so for Nephew Gu!</p><br/><p>Especially not when he was still in charge of her safety in the academy! Based on Yao Si’s observations during the last couple months, his responsible and serious nature would never allow him to do such a thing. Previously, regardless of the matter they had at hand or the weather conditions, he would punctually escort her back home for her meals. If she was late for even a second, her optical computer would be flooded with his messages. It was as though he was monitoring the time all throughout the day.</p><br/><p>Thus, would someone who held the Elders’ words with such importance skip out on the weekly meeting?</p><br/><p>Was there an emergency?</p><br/><p>Yao Si frowned and sent Gu Shucheng several messages before diving into her large pile of documents.</p><br/><p>At the next weekly meeting, he was still missing!</p><br/><p>Her message to him had been sent half a month ago, but it seemed to have drowned in the sea, getting lost before anyone could reply to it.</p><br/><p>There were so many unread documents in her optical computer that she was about to collapse. Yao Si made a decision. Regardless of whether Nephew Gu was in trouble or not, she was going to get him back.</p><br/><p>Now, this very instant!</p><br/><p>“Why did you pull me out?” Bai Yi asked as he was being dragged outside against his will.</p><br/><p>“That’s cause I have no idea where he stays!” Why else would I bring such a chatterbox along! “Luo Ying hasn’t been around as well, so you’re the only one I can use.”</p><br/><p>“You were going to get Luo Ying?” Bai Yi’s eyes went wide, and his eyes roamed up and down her, an unknown emotion clouding them. “You-you’re so brave!” He shook his head. “Let me warn you, though, you better stay away from her, or… <em>Tsk tsk tsk! </em>”</p><br/><p>“Why?” Yao Si stilled. She didn’t seem to have offended her? Besides, that woman seemed like an easy going person.</p><br/><p>Bai Yi glanced at her sideways. “Let me put it this way, Shucheng is Luo Ying’s mentor.”</p><br/><p>“Mentor!” Yao Si’s eyes went instantly wide. “Gu Shucheng is Luo Ying’s father?!” <em>F*ck! Both father and daughter are in the same school and on the same level?!</em></p><br/><p>“Yea.” He nodded. “Even though Luo Ying is still a cub, she has already awakened her ability, so you better be careful.”</p><br/><p>What did that mean? Even though it was weird that he would have a daughter at such a young age, but…</p><br/><p>“What has that got to do with me?”</p><br/><p>Bai Yi was left speechless. He turned and glared at her. “Are you dumb? Do you think his cub would be happy that you’re getting so close to him?”</p><br/><p>“Why would she be upset?” All he did was remind her to go back for dinner, and it wasn’t even held at his home.</p><br/><p>“You…” Bai Yi almost choked on anger. After a moment, he scoffed, “Forget it, didn’t you want to go his house? Hurry!” In large strides, he left the academy.</p><br/><p>Yao Si had on an incredulous expression as she followed behind. <em>Why is he so temperamental… Is he perhaps on his period? </em></p><br/><p>Gu Shucheng didn’t live on the Red Planet. He instead stayed in a tranquil area near the school. Galaxy’s advanced transportation allowed them to reach their destination in less than five minutes. The area there was indeed a prime spot. The lush greenery was well attended to, and the surroundings were peaceful. There was barely anyone on the roads, with just three well built men passing by them.</p><br/><p>Maybe due to the peaceful surroundings, they could smell a faint floral scent.</p><br/><p>Just as Yao Si was staring at the signboard, Bai Yi stopped abruptly.</p><br/><p>Yao Si almost bumped into him. “What’s wrong?”</p><br/><p>Bai Yi focused on a corner, seemingly in deep thought. Gradually, a hint of worry clouded his relaxed expression. The knot on his temples deepened, and after a moment of hesitation, he said, “You can’t… have hit the jackpot, right?”</p><br/><p>“What?” Yao Si stilled. Without explaining anything, Bai Yi ran fir the house in front of them.</p><br/><p>Yao Si hurriedly followed after.</p><br/><p>When they reached it, the door opened with just a light push. In the Galaxy with highly advanced security, this was definitely a red flag. What even worse was that the interior was pitch black. It looked as though it had been burnt by a humongous flame.</p><br/><p>“The three men were the ones that caught Shucheng!” Bai Yi stated suddenly. “My ability is mind reading! I heard their thoughts when they passed by us. Let’s go!”</p>\n</div>"}