{"title": "Chapter 69 - A Low Profile Life", "id": 69, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-69-a-low-profile-life", "volume_title": "Volume 1", "body": "<h1>Chapter 69 - A Low Profile Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Just as Yao Si was about to escape, she bumped straight into a familiar figure. He raised his hand and opened his mouth to greet her. “Your Hi—”</p><br/><p>Yao Si covered his mouth at lighting speed, dragging him into a deserted corner.</p><br/><p>“Shh, low profile, low profile!” She swept a glance at him. “Nephew Gu, why are you here? Have your injuries healed?”</p><br/><p>Gu Shucheng stilled, then replied dismissively, “I predicted that Your Highness would be here, so I came over. My injuries fully healed a while back.”</p><br/><p>“That’s good.” Yao Si nodded, remembering how Disgusting Lu had mentioned that he was the only who could predict the future. “Is your ability really to predict the future?”</p><br/><p>“I can only see some of it,” he explained. “After interacting with a specific person, I will be able to see some images, but it won’t be complete and some of it might not even happen.”</p><br/><p>“What does it mean?” Didn’t prediction mean that you’ll know things beforehand? Or could you perhaps predict fake information as well?</p><br/><p>“The future isn’t fixed,” he answered patiently. “I can only predict the current outcome, but once the person learns of it, he will obviously make a different choice, resulting in the prediction being different from reality.”</p><br/><p>“Oh.” <em>I understand, isn’t it similar to the butterfly effect with you being the wings, but…</em></p><br/><p>“If you can predict the future, why would you have been caught?” This wasn’t logical.</p><br/><p>He scratched his head in embarrassment. “I was complacent. I had noticed them a month before I was caught. At that time, I foresaw the situation at the research base and realized the seriousness of it, but since I wasn’t entirely sure, I deliberately fell into their trap to investigate further. In the end…”</p><br/><p>“In the end you couldn’t come back?” Curiosity killed the cat, indeed. “What if you died there?”</p><br/><p>“I wouldn’t have!” He shook his head with assertion. “If I foresaw myself in danger, I naturally also saw myself escaping. This is due to Your Highness, you’re indeed the queen of our race.”</p><br/><p><em>Heh, stop praising me, I’m not really that happy with this. Hehe, hahahhaha…</em></p><br/><p>╮(╯▽╰)╭</p><br/><p>“Wait a minute!” She was suddenly reminded of something. “Did Yao Qian instruct you to monitor me in the academy because of your ability….” He would be able to foresee the possibility of her not making it in time for her meals and make sure that doesn’t come to pass.</p><br/><p>Gu Shucheng froze, a shadow passing his face. He straightened his back and switched on his optical computer, then spoke up in forced seriousness, “Your Highness, I came today mainly to report about the workload for this semester. Even though the semester is packed with events, you don’t need to worry, I’ll make sure to finish my report before your meal time.”</p><br/><p>“…” <em>Ahem! Isn’t your change of topic a bit too forced? Yao Qian definitely had that intention!</em></p><br/><p>–</p><br/><p>Since Yao Si’s previous optical computer had broken, she bought a new one but hadn’t yet had the chance to add Nephew Gu into her contacts (mainly because she wasn’t sure how it worked.) Hence, Nephew Gu had to personally add himself.</p><br/><p>Gu Shucheng sent her a large pile of documents, numerous finalized reports of the semester. Yao Si’s heart sank. After struggling to enter the academy, the semester had flown past without even a full month of learning. The rest of the semester had been spent lazying about at home… This wasn’t what she’d had in mind when she decided to learn more about this Galaxy and expand her social circle.</p><br/><p>“Oh, for your safety, from next semester, Your Highness will advance to the high school level,” Nephew Gu said hesitantly.</p>\n</div>"}