{"title": "Chapter 65 - Human Transport Machine", "id": 65, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-65-human-transport-machine", "volume_title": "Volume 1", "body": "<h1>Chapter 65 - Human Transport Machine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yao Si switched off the screen in front of her, not regretting in the least to have exposed her identity. The bloodlings’ pride was at stake.</p><br/><p>She took deep breath and, suppressing her tumultuous emotions, turned to face an unexpectedly silent room.</p><br/><p>She scanned the crowd, taking in the dazed expressions. “Wha-what’s wrong?” Did her ability fail her?</p><br/><p>“Fif-fifth generation…” Finally, one of the bloodlings snapped back to his senses, blurting out what was on his mind. The next second, the entire crowd grew became agitated.</p><br/><p>“Your Highness! It’s Her Highness!”</p><br/><p>“Two years ago when I dropped by the Red Planet, I heard that Her Highness of the fifth generation had returned, but I never took it seriously.”</p><br/><p>“Your Highness… Your Highness personally came down to save us.”</p><br/><p>“Ahahah! This is amazing, I actually got to meet Her Highness!”</p><br/><p>“I wouldn’t mind getting caught again.”</p><br/><p>“Me too, me too!”</p><br/><p>“Me three!”</p><br/><p>“Count me in!”</p><br/><p>Yao Si was speechless. <em>You guys had followed me in without even knowing who I was? Does the bloodline power really have such immense influence? Is it the inheritance of every generation? </em></p><br/><p>But…</p><br/><p><em>I’m glad my ability didn’t fail! </em></p><br/><p>╮(╯▽╰)╭</p><br/><p>After a series of commotions, all of the bloodlings went down on one knee in unison, saluting with the bloodling greeting. Their eyes were bright with an impossible to extinguish glow as they looked up to stare at her, a stark contrast to the dead stares they had not long before. Yao Si started to feel uncomfortable and naked under their intense gazes.</p><br/><p>Gu Shucheng seized this opportunity to squeeze through the crowd. With a slightly superior look that indicated his prior knowledge, he swept the crowd. “Your Highness, together with Luo Ying, I’ve investigated the base.The ships have already left the terminals and there seems to be a field surrounding this base, preventing communication with the outside.”</p><br/><p>“You mean, we can’t get out?”</p><br/><p>Nephew Gu nodded. They were indeed trapped on this deserted tiny planet. And on top of that, it was a planet that no one visited and where the transport was all one-sided, and one sent by the enemies… Even if they received their call for help, they would probably only come to kill them off.</p><br/><p>“Don’t worry, everything will be fine, we’ll find a way!” Yao Si wasn’t the least bit worried, and to prove it she patted his shoulder in reassurance. She glanced down to look at the time, but then realized that her optical computer had been destroyed by the force of her ability. Instinctively, she turned to Nephew Gu. “Oh right, what time is it?”</p><br/><p>Nephew Gu’s optical computer was removed, so he lifted his head towards the screen at the back. “6.47 pm.”</p><br/><p>“Oh, then it’ll be fast.”</p><br/><p>“Fast?” Nephew Gu stilled slightly, then quickly understood her words. “You mean…”</p><br/><p>“He’s here!”</p><br/><p>Yao Si sighed and lifted her head. From out of nowhere, there was a tear in the sky. It seemingly ripped itself open, and a familiar figure walked out of the portal.</p><br/><p>He headed straight towards Yao Si, with his face cold and taunt, his brows deeply knotted. He said only one sentence to her, “You’re late by seventeen minutes and thirty-two seconds!” He was wearing an extremely displeased expression.</p><br/><p>Yao Si punched Nephew Gu lightly with a slightly shaky hand. “Didn’t I tell you I’ve a plan?” She then pounced on Mu Xuan. “Dad!”</p><br/><p><em>Hurry, transform into a human transport machine and send me back. </em></p>\n</div>"}