{"title": "Chapter 62 - Euphoria", "id": 62, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-62-euphoria", "volume_title": "Volume 1", "body": "<h1>Chapter 62 - Euphoria</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Wait…” Lu Hangyi struggled to sit up. “You can’t take him, he’s… the only… one with precognition as an ability, you have no idea… what a valuable specimen he is!”</p><br/><p>“F*ck your research!” Bai Yi exploded. “Who would be willing to let you experiment on them?”</p><br/><p>“What do you know?” With a murderous glint in his eyes, them man shouted out, “There have to be sacrifices before success can be obtained, you bloodlings have ruled over the Galaxy for long enough. Who gave your race the right to be immortal while the other races die from old age and sickness? My research will benefit all the races! Once we unlock the secrets behind your immortality, all the races will be able to live forever.”</p><br/><p>“This was the reason behind your kidnappings?” Bai Yi asked, his eyes wide.</p><br/><p>“What’s wrong with that? If all the races become immortal, there won’t be anymore sacrifices in the Galaxy.” He grew increasingly more agitated and seemed to be even forgetting his injuries. “Without sacrifices, there won’t be any quarrels, and the Galaxy would enter a state of euphoria. It’s our vision and ultimate aim.”</p><br/><p>“You’re using my people as specimens to reach euphoria, you must be joking,” Bai Yi spat out. “Aren’t you worried about the consequences once the red planet finds out?”</p><br/><p>“What can they do?” He humphed, his gaze steady and unrepentant. “For the sake of the entire Galaxy, for the sake of all the races’ future, I’m prepared to sacrifice everything I have, including my life. You bloodlings have always been a selfish race. Despite having immortality, you refuse to share its secret with the other races. Even if you have the ability to prevent conflicts in the Galaxy, you choose to stay on the sidelines without offering any help. After so many years of war between the various races, after the Alliance being rebuilt so many times, how many have perished? Haven’t you thought about interfering? All you did was stand by nonchalantly! Why can’t I use you as specimens, this is what your race owes us, owes to the entire Galaxy!”</p><br/><p>“F*ck you!” Yao Si swung her leg at him. “Stop trying to sugarcoat your disgusting motives. At the end of the day, you’re just jealous and afraid of death!” She smirked/ “What has the death of other races got to do with us bloodlings? The races fight due to their own greed, why push the blame on us? Are bloodlings your parents? Why must we worry and look out for you? What has your race done for the bloodlings? Lu Hangyi, keep your reasons to yourself and don’t drag the other races down with you.</p><br/><p>“You’re right, the bloodlings are immortal. It’s a strength of our kind, but that doesn’t mean it’s for everyone. Who are you to blame us for not sharing it? You’re speaking as though you’re a selfless sacrificial monk. If you’re really as loving as you make yourself out to be, why did you build such a big research base, why didn’t you just donate your money to save the other races who are worse off?</p><br/><p>“According to your logic, there are many races that have yet to enter the Galaxy, so is it their fault? Look-look at how selfish you are, not sharing your abilities and resources.”</p><br/><p>“Shut up, shut up!” Lu Hangyi shouted out, his face a mask of fury once his real reasons had been laid out for all to see. “It isn’t like this, it isn’t like this!”</p><br/><p>“Enough, you’re just jealous and unhappy at other people’s success,” Yao Si continued ruthlessly. “You’re just like a child that was denied a candy. Lu Hangyi, you aren’t a hero. What hero could sacrifice the researchers he personally employs? In the end, you’re just seeking immortality at the cost of others for your own selfish and disgusting desires!”</p><br/><p>“Rubbish!” The man went out of control, wanting to pounce on her but seemingly being too paralyzed to do so. “Lies, it’s all a pack of lies! Who exactly are you? How dare you criticize my actions.”</p><br/><p>“Who am I?” Yao Si stared straight at him. “You bully my people and you dare to ask who I am? You listen up.” She took a deep breath, then clearly spit out each word. “I am a fifth generation bloodling from the Red Planet, the cub of the His Majesty, Yao Si! The bloodlings will purge everything that has happened here! Regardless of whether it’s you or your race!”</p><br/><p>“Fi-fifth generation! It-it’s impossible, how can there still be a fifth generation blooding around?” His eyes went wide, and his actions became frantic, to the point he resembled a maniac. “No… You can’t do this! I’m doing this for all the races, I’m doing this for the entire Galaxy! One day, the Galaxy will enter a state of euphoria, that is its future . The organization’s plans are never wrong!”</p><br/><p>“Organization?” Yao Si stilled, then grabbed his collar. “What do you mean? What organization?”</p><br/><p>His expression grew increasingly hysterical. He soon looked deranged, and then, he burst into laughter. “Hahhahahahaha… Do you think the research base is everything? I’m not the only one eyeing the bloodlings.”</p><br/><p>“Who are they, what is this organization you speak of?”</p><br/><p>“Euphoria has finally settled, the Galaxy shall be reborn! Hahaha…”</p><br/><p>“Bai Yi, ability!”</p><br/><p>If he wasn’t willing to say anything, she would see it for herself.</p><br/><p>“Ah… oh,” Bai Yi replied in a daze. Bust as he was about to summon his ability, his pupils shrank, and he pulled Yao Si backwards. “Be careful!”</p><br/><p>With a loud thud, Lu Hangyi activated a self-destruct bomb tied to his body, exploding himself into tiny pieces.</p><br/><p>Before his death, the word [Euphoria] formed above him.</p><br/><p><em>Euphoria… Is that the name of the organisation? </em></p><br/><p>Yao Si’s heart sank, and an ominous feeling settled in within her.</p><br/><p> </p>\n</div>"}