{"title": "Chapter 84 - Four Dummies", "id": 84, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-84-four-dummies", "volume_title": "Volume 1", "body": "<h1>Chapter 84 - Four Dummies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“I’m here on behalf of my friend, Zan Zichen. There seems to be a misunderstanding and I wish to seek clarification from the sect.” Yao Si then turned to glance at Zan Zichen.</p><br/><p>He took a step forward, greeting the sect leader and various elders. “Grand Elders, Master, the combat transformation pill wasn’t stolen by me. That day when I was at the Hidden Pill Pavilion, I saw Elder Senior eating the pill, that’s how we got into a conflict. I never—”</p><br/><p>“Shut up!” Before Zan Zichen could finish his sentence, he was interrupted by an infuriated sect leader. “You’re full of rubbish, I personally witnessed what happened! You injured Yao Er and stole the pill, how dare you try to lie about the truth.”</p><br/><p>“Master Yu, you should be clear whether I stole the pill or someone had used it!”</p><br/><p>“How audacious, there is both eye witnesses and hard evidence, don’t you dare deny it.” The sect leader swung his sleeve violently, his anger concealing his embarrassment. He turned to the service crew person. “Grand Elder, for such an audacious disciple, I’ll personally deal with him elsewhere to not disrupt you.”</p><br/><p>He headed forward anxiously, intending to drag Zan Zichen elsewhere. His anxiousness seemed suspicious, as though he was afraid the matter would drag on.</p><br/><p>“Wait a minute.” Yao Si stood in front of Zan Zichen, blocking him. “Shouldn’t we clarify the matter before you punish him?”</p><br/><p>The sect leader frowned, glancing at her with obvious displeasure. “This is the business of Shi Fang Sect, so I would prefer if you didn’t interfere.”</p><br/><p>“Why? Is the business of Shi Fang sect so shameful?” she retorted.</p><br/><p>He froze, his face turning green. Taking a deep breath to calm down, he continued, “Dear Miss, you must not know, there are signs that this disciple is turning demonic. Previously, he stole the sect’s precious combat transformation pill, for which he was banished to the demonic realm, and now he must have used some trick to escape that place. In order to ensure he doesn’t bring more harm, it would be…’</p><br/><p>“I brought him out!” Yao Si replied.</p><br/><p>“What!” The sect leader’s face paled. “How could you escape the demonic realm, are you perhaps…”</p><br/><p>“Master Yu.” Before he could finish his sentence, the service crew elderly spoke with a hint of warning. “Mind your words!”</p><br/><p><em>How dare you offend a valuable customer? </em></p><br/><p>The sect leader swallowed the rest of his sentence.</p><br/><p>“Lets not discuss whether he is demonic or not. You mentioned that he stole the pill, but other than you, is there anyone else who saw it. Just your words should not be used as evidence, for I can also just say that you were the one who stole it.”</p><br/><p>“Yao Er saw it too,” Sect Leader Yu added anxiously. “Besides, he was harmed by Zan Zichen, those wounds are the physical evidence.”</p><br/><p>“Yao Er? What’s the relationship between the two of you?”</p><br/><p>“He’s my son.”</p><br/><p>Now she knew, they were father and son. There was definitely something fishy going on.</p><br/><p>“Don’t you know that family’s testimonials cannot be used as evidence?” They were obviously in cahoots. “It isn’t impossible that you guys were speaking wrongly about him.”</p><br/><p>“Rubbish! I’m the sect leader, how could I do such a thing!”</p><br/><p>“I don’t even know you well, how could I know.”</p><br/><p>“You…”</p><br/><p>“For this matter, no amount of explaining would be sufficient. We can’t just deal with it this way, besides, even if what you said was true, he was already punished. After struggling to escape the demonic realm, is there a need to punish him again?” Even death sentences could be pardoned, why not this then. “Why don’t we just forget the matter?”</p><br/><p>“No!”</p><br/><p>“Grand Elder?” She directed her question to someone else of authority.</p><br/><p>“Ah?!” <em>What’s that got to do with me? </em></p><br/><p>“What do you think?”</p><br/><p>“Er…” The service crew person froze. He was here just to help the newbies, so why did he have to meet such a meddlesome customer! But the customer is always right, so he was about to nod in agreement. However, before he could do that, another person spoke up.</p><br/><p>“Let me say a few words.” This was one of the other people beside the service crew member. “About this matter, I feel that…”</p><br/><p>Yao Si’s heart sank. <em>Will he side with the sect leader? </em></p><br/><p>“You’re absolutely right!” the person stated resolutely.</p><br/><p><em>Ah?!</em></p><br/><p>“That’s right, your words now made so much sense.”</p><br/><p>“Reasonable indeed! He should be released.”</p><br/><p>“Hurry! Didn’t you hear this senior telling you to release him?”</p><br/><p>“Reasonable, indeed! I’m thoroughly convinced by this senior!”</p><br/><p>“Clap for the senior’s words!”</p><br/><p><em>Clap! Clap!</em></p><br/><p>A clapping resonated awkwardly within the hall and… it wasn’t stopping!</p><br/><p>The service crew member, Sect Leader Yu, Zan Zichen, all the disciples, and Yao Si stared at them speechlessly.</p><br/><p>Where did these four dummies come from?</p>\n</div>"}