{"title": "Chapter 95 - Meeting the Parent", "id": 95, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-95-meeting-the-parent", "volume_title": "Volume 1", "body": "<h1>Chapter 95 - Meeting the Parent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“I dragged you into this, senior.” Zan Zichen was a face of guilt as he scratched his head. “Ever since I was young… my luck hasn’t been very good.”</p><br/><p>That was putting it lightly! It was definitely on another level, right?</p><br/><p>“Why don’t… we take a break in the forest nearby?” he suggested.</p><br/><p>“No!” Chatterbox Qin was the first to object. “With your luck, we would probably run into a demonic beast’s nest.”</p><br/><p>Yao Si nodded. The experiences of the past month told her that it really might happen. Even though it might not be anything of high level and could be easily dealt with by his sword, another beast would probably appear in just a matter of minutes.</p><br/><p>“Lets head to the river side instead!” She pointed in the opposite direction, playing close attention to his jinx nature.</p><br/><p>Zan Zichen turned his head without any objection and started making a fire for cooking. Even though he was a jinx, his culinary skills weren’t bad at all. The duck blood curd he prepared with readily available ingredients was comparable to that of her nanny dad.</p><br/><p>He was responsible for the meals throughout the trip and was a travel must have.</p><br/><p>Yao Si finished three full bowls with satisfaction, feeling pleased and energized. Just as she was planning to get a forth bowl, her optical computer buzzed, and a sentence popped out.</p><br/><p>[There is ten minutes left for the training you have registered!]</p><br/><p><em>F*ck!</em></p><br/><p>Yao Si’s hand trembled, and she almost dropped the bowl in her hands. Why was it ending so fast? Hasn’t it only been a little over a month? Wasn’t it supposed to be two months? She whipped out the timer in the optical computer.</p><br/><p>As expected, it stated—59 days and 14 hours.</p><br/><p>The reminder on the optical computer wasn’t wrong. This meant that it was probably due to her being sent to Region 4 which had a different time flow from the the planet of Shadow which caused the difference of some time.</p><br/><p>“Senior, what’s wrong?” Zan Zichen asked, glancing over at her.</p><br/><p>“Did you perhaps ingest some worms?” Qin Changle suggested.</p><br/><p>Yao Si placed her bowl down. “I think… I think I have to go.”</p><br/><p>“Go?” Qin Changle bolted upright. “Where do you want to go? Our contract hasn’t been resolved yet. Are you going to forsake me?”</p><br/><p>“…” <em>What the f*ck do you mean by forsake? Do you not know what it means?</em>“Don’t worry, the contract will be broken once I leave.” She had intended to seek help from the service staff, but there wasn’t enough time.</p><br/><p>“Are you sure?”</p><br/><p>“I’m… sure?” Everything related to the indigenous tribes was prohibited from leaving the planet of Shadow, so once she reached the celestial realm, the f*cking contract would automatically be resolved… Right?</p><br/><p>As opposed to Qin Changle’s agitation, Zan Zichen was much calmer after his initial shock. “Are you going to leave this world?”</p><br/><p>“Yes.” Yao Si nodded. “There isn’t enough time.”</p><br/><p>“Then… are you coming back?”</p><br/><p>“I might not…” <em>Dad doesn’t approve of my leaves! But wait a minute… </em> “You know about it?”</p><br/><p>Zan Zichen nodded. “I could vaguely tell that senior is from the higher lands and will eventually head back.” But he never expected it to come so soon. Zan Zichen clenched his fists, bowing to her in respect. “Thank you senior for your guidance. I wish you eternal happiness, luck, and peace.”</p><br/><p>“Thank you!” Yao Si nodded. Even though the child was a jinx, he was honest and sincere. After spending a month together, she was a little reluctant to leave… the duck blood curd he cooked.</p><br/><p>“Jinx… Zan Zichen! Practice diligently and we will meet again.” <em>Once you become a member of the Celestial Clan, you can head over to the Red Planet. </em></p><br/><p>“Alright!” He nodded vigorously. “I will work hard to ascend!”</p><br/><p>“Great!” Yao Si tapped open the space within her optical computer and started to rummage about it. Soon after, she pulled out a circular egg along with nine soul-calling pills, which she stuffed into his arms. “With your physique, you should keep these pills with you at all times.</p><br/><p>“I have been holding onto this egg for an extremely long time. It was gifted by a friend and is most likely a part of your world, but I have no idea what it is. Anyways, I’m giving it to you.” <em>After eating your duck blood curd for so many days, it is only right for me to return the favor. </em></p><br/><p>Zan Zichen didn’t stand on ceremony. He took the egg and started to study it, but he couldn’t seem to figure out what it was, so he dumped it into his sack. “Thank you, senior.”</p><br/><p>“You’re welcome.” Yao Si waved her hand as the optical computer sent out a notification alarm.</p><br/><p>[There is less than one minutes left of your training package. Please hold onto all of your personal belongings. Preparing to take off: 5…4…]</p><br/><p>“I’ll head off first, remember to look for me after you ascend. I’ll be in the Red Planet!” Yao Si reminded hastily. The next second, the scenery changed from a vast greenland into the misty and cloud-filled celestial realm.</p><br/><p>The training time on her optical computer dropped to zero.</p><br/><p>The celestials were indeed business minded, unwilling to waste even a minute. Yao Si inhaled, glancing at the cloud and mist that surrounded the simple and imposing pier. After two months trying to survive in the wild, she seemed to have ventured into a new generation. As opposed to the two months of wildlife, this environment was clearly…</p><br/><p>“A feast for the eyes!”</p><br/><p>“…” <em>A feast for the eyes? Who came up with that description?</em></p><br/><p><em>Eh?</em></p><br/><p>“F*ck! Chatterbox Qin!” Weren’t the indigenous tribe members prohibited from leaving Shadow?! This had to be a joke. “What are you doing here?”</p><br/><p>“How can I know?” he asked innocently. “I just felt a yank, and the next moment I was here.”</p><br/><p>Yank? That was not possible, the celestial clan would not transport the indigenous tribe members so readily. Besides, even if they had been forcefully brought over, they would be blasted back by the lighting if their physique wasn’t level SSS.</p><br/><p><em>Wait a minute!</em></p><br/><p>Before she had transported, there seemed to have been a reminder to hold onto all personal belongings! Since Qin Changle was tied to her by the mental strength marking and was also considered her contracted beast…</p><br/><p>Did the transportation system treat him as her belonging?</p><br/><p>Could it be so negligent?!</p><br/><p>The eldest disciple of the top sect—contracted beast—personal belonging…</p><br/><p>Chatterbox Qin’s social status had just went down the drain!</p><br/><p>However, a certain someone was completely oblivious and was instead glancing about with curiosity and interest. “Hey, hey, hey, demonic girl! Where is this? Is this the celestial realm? Are you really a celestial from above? Then… did I ascend to a celestial?”</p><br/><p>“No! You are at most considered a delivery.”</p><br/><p>What exactly was happening?</p><br/><p>“Welcome back to the Celestial Planet’s returning pier.” A female celestial was already flying toward them with a polite smile. “Your training has been tough, but please follow the orders… Indigenous tribe member!” She froze, pointing toward Qin Changle with a face of horror.</p><br/><p>After half a second, she turned and drew something in the air. Seconds later, a ray of light came shooting over.</p><br/><p>Yao Si’s heart sank. She was a goner.</p><br/><p>As expected, in less than a minute, a huge group of celestials dressed in white flew over. They arrived with an ethereal air. As opposed to the service crew from before, they all held long swords in their hands and had hostile expressions.</p><br/><p>Were they… security guards?</p><br/><p>“What happened?” a solemn voice asked. The man didn’t come on a flying sword but was instead walking in the air. A lotus bloomed with every step he took, his entire being emitting a holy and pure white glow.</p><br/><p>Yao Si felt her mouth twitch. What was with the entrance? Such effort was deserving full 100 marks! But… why did he seem a little girly?</p><br/><p>“Number 233, why did you activate the highest level alarm?” The man that was putting on a front turned toward the female celestial who still flying nearby.</p><br/><p>She seemed immune to his superfluous entrance and took several steps forward to perform a greeting. She then pointed toward Yao Si and started to explain.</p><br/><p>“What? She smuggled out an indigenous tribe member?” The man finally turned to glance at Yao Si, taking hurried steps over. In a displeased tone, he started, “Customer, don’t you know the training rules? Everything from the primitive planet is prohibited from leaving, even the local specialties!”</p><br/><p>Qin Changle transformed from a personal belonging to a local specialty.</p><br/><p>“…”</p><br/><p>“That’s not it, it’s a misunderstanding, let me explain…”</p><br/><p>“Your actions have severely breached the galactic convention! This indigenous tribe member is not ready to ascend. He has to be detained and sent back.”</p><br/><p><em>Hey! What’s with your accusatory expression?</em></p><br/><p>“This… Master, he really wasn’t brought over by me. Your system is responsible for sending him over!” <em>Shouldn’t you guys be the ones giving me an explanation?</em></p><br/><p>“The transportation spell was cast by the master himself, so there is no way it would go wrong.” The celestial completely dismissed Yao Si’s explanation and was instead looking at her with a reproachful expression. “Even though you are a customer, you are obliged to follow our rules. Whether you admit it or not, in view of your violation, you are prohibited from entering the celestial realm within the next ten years. Please show your ship details, and we will arrange for you to leave immediately.”</p><br/><p><em>Enough! </em> There was no way to clear her name, but Yao Si could finally heave a sigh of relief, knowing they would send Chatterbox Qin back. She reached out to flash her optical computer.</p><br/><p>The celestial used a rectangular detection device to scan her optical computer, and her ship details popped out on it. “Miss Siyao, ship number F233 will take off in ten minutes toward…”</p><br/><p>He paused mid-sentence, opening his eyes wide as though he had come across unbelievable information. His face of reproach paled instantly, and even his hands began to tremble.</p><br/><p><em>What’s wrong?</em></p><br/><p>“Re-re-red Planet,” he stuttered, barely able to continue. He started to tremble even more, then he clenched his teeth. It was a stark contrast to the solemn celestial from before that couldn’t be thrown off-center.</p><br/><p>The next moment, he broke into a radiant smile. “I see… You’re our valued bloodling customer. It’s a misunderstanding… misunderstanding! Was your journey enjoyable? Do you have any valuable feedback to give us? Is this local specialty up to your standards? Don’t worry, we celestials promise only the best quality. If you aren’t satisfied, you can return, exchange, of have it fixed.”</p><br/><p><em>Wasn’t this drastic change a little too fast?! </em></p><br/><p>“Your ship is about to head off. Other than him, did you bring along any other local specialties? Do you need delivery service?”</p><br/><p>“…”</p><br/><p>Chatterbox Qin had somehow become a local specialty which was allowed to be brought out of the primitive planet. Regardless of Yao Si’s explanation on how she had no intentions of bringing him out of Shadow and that it was due to the blasted contract, the managing celestials remained persistent and refused to believe her. They explained their inability to send him back to the planet, that if they were to forcefully bring him over, he might be killed by the lighting surrounding the planet.</p><br/><p>Yao Si was left with no choice, and the group of celestials politely yet cautiously and excitedly sent her up to the ship. When she regained her senses, she was already back home with the local specialty.</p><br/><p>She sat on the coach uneasily, sneaking glances at a certain nanny dad that wore a dark expression. Yao Si had no clue where to begin. It might be an illusion, but ever since she had brought Chatterbox Qin through the door, the temperature indoors seemed to have plunged by a few degrees. She glanced over at the thermostat. Was it really not faulty?!</p><br/><p>With a deep breath, she cautiously sneaked a glance at the person in front of her. “Dad!”</p><br/><p>Mu Xuan remained silent, but his emotionless expression grew even more freezing. An eerie cold aura surrounded him.</p><br/><p><em>It’s getting bad! </em> He wasn’t even correcting the way she addressed him, which had to mean that he was really angry.</p><br/><p>“I can explain!” Yao Si removed the necklace that contained her nanny dad’s mental strength and raised her paw, prepared to take the initiative.</p><br/><p>Mu Xuan remained motionless, but his gaze slowly moved from her toward Qin Changle, the local specialty. The temperature seemed to plunge further, icy cold air shooting in all directions.</p><br/><p>He hadn’t seen his cub in two months, she had ditched the people he had assigned to take care of her and headed out all on her own, and had even brought a stranger back home.</p><br/><p>A man! A living one! The kind that was still breathing.</p><br/><p>Mu Xuan wanted to kill someone!</p>\n</div>"}