{"title": "Chapter 90 - The Little Group of Balls", "id": 90, "volume": 1, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-90-the-little-group-of-balls", "volume_title": "Volume 1", "body": "<h1>Chapter 90 - The Little Group of Balls</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Ayy sis, this must be the first time your awareness left your body.” A green ball of mist squeezed out from the fog. “You’re currently in the state of lost awareness, so be happy you at least still have a ball of mist. Don’t worry about it, when the time is up, you’ll be back to normal.”</p><br/><p>“What do you mean?” Yao Si stilled, suppressing her inner shock.</p><br/><p>“You’re also a training customer of the celestials, right?” the green ball asked.</p><br/><p>Yao Si nodded, remembering her ball status. She then swiftly asked, “I’m one, are you guys too?!”</p><br/><p>“Of course.” The green ball bounced. “We were here before you to get the gift!”</p><br/><p>Gift? That word sounded like toothache to her now!</p><br/><p>“Is the Soul Eating Flag really the gift they mentioned?”</p><br/><p>“Yea!”</p><br/><p>“Where are we now?”</p><br/><p>“Inside the Soul Eating Flag!” The green ball replied somewhat arrogantly while bouncing about. “When you first came in, didn’t you realize that my awareness is much greater than that of others? It’s best to train your mental strength here!”</p><br/><p>She could indeed feel her awareness getting livelier, and the ability to exert it seemed much smoother as well, but…</p><br/><p>“What about our bodies?” With their awareness gone, weren’t the empty shells of their bodies left outside?</p><br/><p>“You don’t have to worry about that.” The green ball floated to the side, allowing a blue ball to take shape. “Come come, blue ball, you’re one of the celestials, you can explain it to this sister.”</p><br/><p><em>Achem… </em> The blue ball first cleared his throat. “Sis, you don’t have to worry, we celestials always ensure the best customer service. Inside the beginner guide, there is an automated protective function. Once your awareness leaves your body, the optical computer will provide a temporary storage space for your body,” he explained in a service-like manner. After a moment, he added, “Of course… the storage will be charged on an hourly basis, and it is linked to your bank account. If you would like to leave or if the account balance isn’t enough, the awareness will automatically return to your body.”</p><br/><p>“…” <em>You’re going to charge for this?!</em></p><br/><p>The level up gift suddenly seemed like another of their money making schemes.</p><br/><p>“All right, all right, there’s officially four of us now, let’s start!” the white ball rushed them impatiently.</p><br/><p>“What?” Yao Si was an image of confusion. “What are we starting?”</p><br/><p>The three balls took a corner each, with the green ball looking exceptionally excited. “Sis, since there is so much free time, why don’t… we all play some mahjong? We were lacking one player!”</p><br/><p>“…” <em> Excuse me?</em></p><br/><p>“Sis, you have no idea how long we’ve been waiting for you.”</p><br/><p>“Yes, yes, I’ve been in this horrid place for seven days,” the blue ball replied.</p><br/><p>“What is seven days? I’ve been waiting for a month!” the white ball stated acidly. “After an entire month, you’re finally here.”</p><br/><p>They cornered her so enthusiastically just to play mahjong? She face-palmed internally. <em>Can’t you be more ambitious!</em></p><br/><p>“What about the training?” <em>Can you really be so lax?</em></p><br/><p>“When the awareness leaves the body, you just have to get used to the feeling, there isn’t much you can do in that state,” the blue ball explained, his face mysterious. “Sis, you must not have heard of the game ‘mahjong’, right?”</p><br/><p>“…” <em>No, I know of it, and I’m quite well-versed in it as well </em>!</p><br/><p>“Let me tell you, in the past, this was the most popular form of entertainment on Earth. A friend of a friend of my friend went through great lengths just to catch a glimpse of it in the bloodling museum. He heard from the keeper there that mahjong had a few million years worth of history!”</p><br/><p>“…” What great sentiments for mahjong!</p><br/><p>“Shut your trap, you’ve been flaunting it for the past half a moment. Hurry, let us take a look at it,” the white ball ordered impatiently.</p><br/><p>“All right, take a good look!” The fog separated, and the originally basketball-sized fog shrank into a small knuckle, then formed a weird arrangement of white-based blue… bamboos, dots and characters.</p><br/><p>-_-|||</p><br/><p>The blue ball started to introduce every tile, and as he did so, he elaborated on the rules of the game while he fog beneath him continuously morphed into the different tiles. “Let’s start with a trial run, I’ll explain again when we meet with any difficulties. Mahjong can get a little complex, since there are one hundred forty-for tiles in total…”Suddenly, he stopped, cursing softly. “F*ck, I don’t have enough awareness, I can only form one hundred forty tiles. Hey! Green ball, help me form the others.”</p><br/><p>“Me?” The green ball stilled. “How can I form them if I’ve never even seen them before?</p><br/><p>“Then what do we do, we won’t be able to play like that.”</p><br/><p>“You don’t need that many.” Yao Si couldn’t help interrupting. “We can play Chang Sha mahjong, it only needs one hundred and eight tiles.”</p><br/><p>The three balls stilled, looking over at her in shock.</p><br/><p>“Sis, you know about this?” The blue ball bounced over excitedly.</p><br/><p>“Er… a little.” She floated aside while explaining the rules of the game.</p><br/><p>“You’re an expert, sis!” The blue ball formed a thumbs up with his fog. “Lets play it that way then!”</p><br/><p>“Err…” <em>Wait a moment, why did I tell them all this? </em></p><br/><p>“Come, come, let’s open a table.”</p><br/><p>They were really going to play? Could she reject the offer?</p><br/><p>Yao Si looked around, trying to change the topic, only to realize that they were in an endless space without any light. The entire space place was in darkness, and there wasn’t any greenery or plants here, making it seem empty and hollow-like.</p><br/><p>However, they were surrounded by zombie-like gray balls of energy that were floating about aimlessly. Even though they looked similar to them, they didn’t seem to be able to talk or move freely.</p><br/><p>“What are those?” she asked.</p><br/><p>The blue ball moved a bit, as though considering how to answer. After a moment, he replied in a low voice, “Oh, those are the other awareness that had been sucked in by the Soul Eating Flag.”</p><br/><p>“The other awareness!” Yao Si exclaimed. “Then why…”</p><br/><p>“The Soul Devouring Flag can indeed be used to devours souls. If a soul is unable to withstand the force, it would be sucked in by the Flag , becoming gray and lifeless which is similar to death,” he replied lightly. “But don’t worry, these Soul Devouring Flags can only suck in the souls of those from the indigenous race in the Shadow Planet; it has no effect on celestials or other races. We won’t be put under any form of danger.”</p><br/><p>Yao Si frowned, glancing at the countless number of gray balls around them. Her heart sank as she wondered how many souls the Soul Devouring Flag had taken.</p><br/><p>“These are all part of their experience.” The blue ball seemed to have understood her thoughts, for he added. “The process of becoming a celestial is indeed cruel. Those who are capable will succeed, becoming celestials in the future, but those who aren’t strong enough will end up as nourishment for the flag. It’s not just the celestial lands that are like that, evolution is the same for every race.”</p><br/><p>Yao Si recalled the bloodling history that Mu Xuan had once told her. It was true that the progression of every race would definitely be accompanied by sacrifices, even the might bloodlings couldn’t prevent the extinction of earthlings, which resulted in their reproduction difficulty today.</p><br/><p>“Five bamboo!”</p><br/><p>“Pong!” Yao Si took the tile, tossing her thoughts away as she focused her attention back onto the mahjong table. As a pure quintessence of national culture, how could she lose in mahjong, such a wide-ranging and profound art that was part of her culture’s heritage.</p><br/><p>“Hu!”</p><br/><p>“Touch!”</p><br/><p>“Hu!”</p><br/><p>“Touch!”</p><br/><p>“All in one!”</p><br/><p>“Pong, pong, hu!”</p><br/><p>The entire time, only her winning cheers could be heard.</p><br/><p>The three balls could only stare.</p><br/><p>“Sis, you real job is actually the study of the history of Earth, isn’t it?”</p><br/><p>“Haha, I studied a little!”</p><br/><p>How could an ignorant alien compare with the quintessence of a culture such as herself? It would be an offence if she lost. Haha.</p><br/><p>Ah? Wait a moment!</p><br/><p>Wasn’t she here to train her mental strength? Why did she actually end up playing mahjong with them? And she had played for more than an hour!</p><br/><p>When she regained her senses, the three balls were already soaked in defeat!</p><br/><p>○|￣|_</p><br/><p>The quintessence of the national culture was indeed skillful…</p><br/><p>“Hu!”</p><br/><p>The white ball pushed his tile downwards enthusiastically as he bounced on the spot, taking several turns. “I win, I win, I finally win for the first time! When we leave, remember to send me Galactic currency, Galactic currency!”</p><br/><p>“…” Was there a need to be so happy about just one win?</p><br/><p>“Wait a minute!” Yao Si took a closer look at the tiles, pulling three of them out. “356? This isn’t a win! You’ll have to pay the other three players for this false alarm.”</p><br/><p>The white and green balls became gleeful at their friend’s misfortune. “Hahaha! White ball, hurry and pay up.”</p><br/><p>The white ball froze, his entire ball darkening, as though he had turned into a dark rainy cloud. After freezing for a moment, the entire space shook, and the originally dark space turned bright red.</p><br/><p>All of the balls turned red.</p><br/><p>“Lets go, let’s go!” The three balls threw the tiles away before flying at the sky excitedly.</p><br/><p>What are they doing?</p><br/><p>Yao Si stilled, following behind them. When she reached the top, she realized they had reached the area that was the brightest.</p><br/><p>“Wah, it’s been three days, that silly kid is finally out of the cave.”</p><br/><p>“I wonder who he will meet this time.”</p><br/><p>“Someone seductive? Someone pure? Or someone cunning?”</p><br/><p>The three balls started their heated discussion, while Yao Si looked at them in confusion. What did they mean?</p><br/><p>Before they could clarify the matter, a faint shadow appeared near the red glow. The shadow started to focus, turning clearer as though there was a layer that was unveiling. In a moment, a familiar… pig head appeared.</p><br/><p>Wasn’t he the one who had attacked her in the cave, the one who had called himself the best demonic cultivator?</p><br/><p>They could actually see what was happening outside…</p><br/><p>“He’s here, he’s here, how will the next person look like?”</p><br/><p>“I liked the previous one with the big chest.”</p><br/><p>“I’d prefer the cold one from before her! The visuals were amazing, everything was just right!”</p><br/><p>“I really envy that dumb kid out there. There’s a new girl every few days, where else in the Galaxy can you find such treatment?”</p><br/><p>“Right, right! He kills everyone he finds, such a heartless person. It really is a waste of such precious creatures.”</p><br/><p>“What do you know, the skill he is learning requires him to gather the Yin energy to supplement Yang. If he didn’t engage in such activity, how would he be able to advance! Ay, I should have gone the demonic path!”</p><br/><p>“How long do you think it’ll be this time, half an hour?”</p><br/><p>“I guess twenty minutes, how can this silly guy go on for so long.”</p><br/><p>“I guess ten minutes!”</p><br/><p>Yao Si stilled, vaguely sensing something perverted about to happen.</p><br/><p>“…”</p><br/><p><em>F*ck! </em> They had rushed over just to watch such things… <em>Where are your morals? Were they eaten by the mahjong tiles? </em> The group seemed to be very familiar with the process, so there must have been many opportunities during this past month for them to have enjoyed all sorts of performances!</p><br/><p>The man outside suddenly lit a candle, seemingly having no clue that he had a large audience. He must also have no idea that ever since he had obtained the Soul Devouring Flag, which was probably be a while ago, many customers must have come for training… which meant that he was probably famous across all the celestials’ lands. Wait, no, probably the whole Galaxy!</p><br/><p>He lit the candle once more!</p><br/><p>Yao Si covered her face and began floating away as a ball of mist as though she hadn’t heard anything.</p><br/><p><em>Mmh, my thoughts are still pure!</em></p><br/><p>“You’re a demonic cultivator!” An infuriated voice that seemed vaguely familiar sounded, and Yao Si turned her head violently to see familiar face!</p><br/><p><em>Zan Zichen! Why is it you?! </em></p><br/><p>This unlucky child, how many more misfortunes was he going to be met with?! How could he have bumped into this demonic cultivator?</p><br/><p>“Eh, why is it a male?” The blue ball sighed in disappointment, and the three balls started to lament.</p><br/><p>“Heh, after three days of wait, its actually a guy, I didn’t know he swings both ways.”</p><br/><p>“Yea, return me my hot babe!”</p><br/><p>“What a waste of my three days!”</p><br/><p>“Ay, let’s leave, there isn’t much to look at.”</p><br/><p>“What’s wrong with a guy?” Their criticism and displeasure seemed to have angered the protective Yao Si, for she even added, “Who said a guy can’t do it?</p><br/><p>All three balls turned around to stare at her.</p><br/><p><em>Err… Did I say something revolutionary just now?</em></p>\n</div>"}