{"title": "Chapter 102 - Revoked Qualification", "id": 102, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-102-revoked-qualification", "volume_title": "Volume 2", "body": "<h1>Chapter 102 - Revoked Qualification</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Hahahaha… Vice President Gu, I’m afraid Zhuo Feng Academy is going to win this competition.” President of Zhuo Feng stood up first, directing a radiant smile at Nephew Gu. Even though his words seemed humble, they carried a haughty undertone.</p><br/><p>“This is just a friendly competition, what’s important is the participation,” Gu Shucheng replied nonchalantly.</p><br/><p>It was after all a friendly competition between the academies, so there was no need to be focused on the results. Alas, the president’s words invoked displeasure within him, prompting a rebuttal. “Your academy has been participating for all these years, but our The First Academy has always come in first. Now that your academy is finally victorious, it’s definitely worth celebrating.”</p><br/><p>President of Zhuo Feng paled instantly, his embarrassment apparent. Since bloodlings would only enter the First Academy, his academy was automatically referred to as the second academy. Regardless of whether it was machinery or the students’ quality, they were nowhere near the level of The First Academy.</p><br/><p>Their academy had been set up by the Alliance and so was linked to the military who was naturally more competitive in nature. Every year, they would hold several competitions to challenge the First Academy only to be defeated every single time. This year, however, they were finally able to emerge victorious in the new machine competition they had come up with, so they were naturally a little disorientated.</p><br/><p>“Hehehe…” President of Zhuo Feng laughed dryly and diverted the topic unwillingly. “Oh right, Vice President Gu, I forgot to inform you that our participant Yuan Han is a freshman for whom we didn’t harbor any hope. I never expected him to win the competition. I heard that Student Yu from your academy is a fifth year student studying mechanics?”</p><br/><p>“Oh, so student Yuan Han is a freshman in your academy.” Nephew Gu was slightly enraged by his words. “I never expected Zhuo Feng Academy to classify their participants according to their academic years. We only look at one’s talents, so everyone is given equal opportunity regardless of the time they’ve spent in the academy. Just look at Her Highness, she is our academy’s president despite only being a freshman. It is all based on ability!”</p><br/><p>“…”</p><br/><p>President of Zhuo Feng was clearly at a loss for words. The moment he tried to mock the First Academy’s top student for losing to a freshman from his academy, he ended up being accused of discrimination and engaging in under-the-table manipulations. The other even used their president as comparison… but who wasn’t aware that she was a fifth-generation blooding! No one in the whole Galaxy would dare to challenge her!</p><br/><p>The president didn’t dare to retort, fearing it would blow out of proportion. Based on the bloodling’s unpredictable nature, it would definitely escalate into a problem between the races.</p><br/><p>President of Zhuo Feng could only swallow his grievances and turn to smile brightly at Yao Si who was seated next to them. “President Yao, the competition has ended, so please announce the results.”</p><br/><p>Yao Si wasn’t the least bit bothered by their banter. She stood up and took two steps forward toward the centre of the stage. She had been invited to announce the competition’s results due to her unique status and as a form of respect to the bloodlings.</p><br/><p>The moment she was in her place, the light’s intensity went up to brighten the arena. The originally agitated crowd went silent instantly, and Yao Si’s figure appeared on all the screens in the arena. Even though the results were clear, everyone still waited patiently for her announcement.</p><br/><p>Yao Si glanced at the battlegrounds; the battle was over and both contestants were exiting their machines. Yu Xiang climbed out from a wrecked machine while Yuan Han walked out from his machine imposingly, with his head held high.</p><br/><p>“I announce that”—she took a deep breath before shouting loudly the rest of her words—”Yuan Han from Zhuo Feng Academy is disqualified from the competition. Hence, the results are invalid.”</p><br/><p>“…”</p><br/><p>The crowd waiting to cheer fell into a daze, and the entire arena fell into a momentary silence, unable to process the situation. Soon after, a storm of protests and disbelief spread through the audience.</p><br/><p>The crowd rose in an uproar.</p><br/><p>“P-President Yao,” President of Zhuo Feng stammered out with a bewildered expression. “What do you mean…”</p><br/><p>Even though bloodlings were known to be overbearing, protective, and unreasonable, they were dealing with just a competition involving academies and not bloodlings. So what was she up to?!</p><br/><p>“Why?” Before she could explain herself, Yuan Han shouted at her impatiently. He glared straight at her with eyes blazing with fury. “I clearly won this competition, so what gives you the right to disqualify me?”</p><br/><p>His words silenced the crowd, and everyone, especially the students from Zhuo Feng Academy glanced at Yao Si with suspicion and displeasure.</p><br/><p>“Why you are disqualified? I’m sure you know why!” <em>Can’t you feel your conscience being pricked from committing such wrong? </em></p><br/><p>“All I know is that I won.” There wasn’t a hint of guilt on Yuan Han’s face. He even smirked. “Heh, are you blaming me from winning so perfectly when it’s simply because your academy’s mechanics department isn’t on par? Even though you’re a bloodling, you can’t be so unreasonable.”</p><br/><p>His words further aggravated the displeased crowd who had kept silent due to Yao Si’s identity. Everyone started discussing her actions aloud, dragging their displeasure with the bloodlings into the conversation. Their words were clear even on the stage, and Yao Si’s ears filled with dissing against bloodlings with words like ‘whats the big deal about being a bloodling?’</p><br/><p><em>Enough, you’re not worthy of mercy. </em></p><br/><p>“According to the competition’s rules, contestants are only permitted to use robots of B rank and below, but the robot you are using is above B rank. You don’t think that’s a breach of the rules?”</p><br/><p>“Above B rank!” The audience looked over at the black robot with disbelief.</p><br/><p>With everyone was focused on his robot, Yuan Han froze. He retorted on instinct, “That’s impossible!”</p><br/><p>Before Yao Si could reply, Nephew Gu flashed the statistics collected from the competition on a large screen. “This is real-time data collected from the competition just now. It’ll be able to show us to which grade the robot belongs.”</p><br/><p>Two simplified robot diagrams appeared in the air. One of them belonged to Yu Xiang who lost while the other was the black robot of Yuan Han. There wasn’t anything out of ordinary with the data for Yu Xiang’s robot, but Yuan Han’s robot’s data shot up the moment he pulled out his curved blade. Two words that clearly marked his grade were shown below: Rank S!</p><br/><p>“Wow, rank S, it’s actually a rank S robot. That explains how he managed to turn the tide.”</p><br/><p>“A rank S robot is definitely able to surpass rank B robots. That’s too much, the competition clearly restricts robots to rank B and below.”</p><br/><p>“But… didn’t he say that the robot was created by him? Isn’t it less than a year since he started school? Isn’t it too fast? As expected of a master’s disciple.”</p><br/><p>“Even the masters weren’t able to create such high level robots while they were studying right? But his personality…”</p><br/><p>Yuan Han was at a loss for words, but he remained composed, without a hint of guilt showing, but his gaze wavered slightly before he continued with gusto. “That’s right, my robot is indeed not of rank B, but I still made it myself. How can you blame Zhuo Feng Academy for their superior skills just because your academy isn’t able to produce robots of such standard?”</p><br/><p><em>F*ck! I’ve never seen anyone cheat with such audacity! </em></p><br/><p>“How dare you try to claim glory from a competition you won by cheating!” Luo Ying who was seated respectfully at the side burst out in frustration. “It doesn’t matter if your machine is grade A, S, or even SSS, since you cheated, the results will not be accepted.”</p><br/><p>“Heh, you’re just trying to throw your weight around, but you have no right,” Yuan Han declared as though the whole world was against him, and the hatred in his eyes thickened. “In all the past competitions, bloodlings have been exploiting their naturally superior traits to gain an edge and win. Why then is your victory considered a victory, but when I win using a robot made by myself I end up being disqualified?”</p><br/><p>“You…” Luo Ying fumed, her face flushed from suppressed anger. “The two are different so how can you even use them as comparison!”</p><br/><p>“Why can’t they be compared?” He humphed coldly, sweeping the bloodlings a glance filled with disdain. “A loss is a loss. How can you blame it on a breach of the rules? You bloodlings are just a lowly bunch that rely on force to bully others.”</p><br/><p>His words didn’t just infuriate Luo Ying. Even the president of Zhuo Feng was taken aback.</p><br/><p>“Yuan Han!”</p><br/><p><em>Do you have a death wish?! Running your mouth is one thing since students from a military-backed academy are bound to have a temper, but you shouldn’t drag a whole race into this. Grab another academy if you’re seeking death! </em></p><br/><p>“Did I say something wrong?” Yuan Han retorted firmly, grief clearly written on his face. “The entire Galaxy knows of the bloodlings’ overbearing and unreasonable ways. They are a virus of the Galaxy!”</p><br/><p>The moment his sentence dropped, everyone drew in a breath in unison. There was even a frown on Mu Xuan’s indifferent face.</p><br/><p>“Yuan Han, don’t sprout rubbish!” President of Zhuo Feng was so startled he started to tremble from fear as he sneaked peaks at Yao Si’s expression.</p><br/><p>“Contestant Yuan Han!” Yao Si found it amusing. This was the first time she had seen such an illogical person. “Are you trying to say that just because you created with your machine that you can get away with cheating?”</p><br/><p>“Justice lies in one’s heart. Regardless of what you do, the results of the competition are obvious.” He continued to act as though he was the only righteous person is a tainted world.</p><br/><p>“According to your words, as long as you win with you own capability, the process can be overlooked”</p><br/><p>“That’s right!”</p><br/><p>Yao Si chuckled at his audacity. “Then… if we were to use our abilities to win, it would be counted?”</p><br/><p>“…” His face paled.</p><br/><p>Luo Ying burst into laughter. Without any care, she directed a lighting at his machine, sending it to its knees.</p><br/><p>“You…” Pain smeared over Yuan Han’s face as he stared at the crippled machine. “That’s… that’s too much! I definitely, definitely won’t acknowledge you guys!”</p>\n</div>"}