{"title": "Chapter 109 - Traces of Yuan Han", "id": 109, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-109-traces-of-yuan-han", "volume_title": "Volume 2", "body": "<h1>Chapter 109 - Traces of Yuan Han</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 109: Traces of Yuan Han</h3><br/><p>“Then… what did it feel like when you first saw me?”</p><br/><p>Mu Xuan stilled, his muscles tightening slightly, and he retreated as though scorched by flames.</p><br/><p>“Why are you asking this?”</p><br/><p>“I just want to know.” Yao Si couldn’t understand this. What exactly was the bloodline bond? She had never felt it before. “Can you tell me?”</p><br/><p>She tugged onto his hands, her face filled with solemn sincerity. At that moment, a certain someone’s entire neck flushed.</p><br/><p>“This…”</p><br/><p>Did his young cub have any idea what she was asking? Bloodlings’ emotions were closely linked to their bloodline, and this question to a bloodling was akin to asking… asking if he loved her. As a ‘dog’ that had been single for millions of years and no dating background, Mu Xuan was momentarily flustered. He had no clue how to handle such a suggestive and intimate question… hence… he escaped.</p><br/><p>“Cough. You’ll know when you’re no longer a young cub.” He stood up abruptly, and ignoring the thoroughly flushed neck area, he maintained his usual cold demeanor. “I’m a little tired, I’ll go rest now.”</p><br/><p>“Eh?” Yao Si stilled. “Mu Xuan…”</p><br/><p>“We can talk tomorrow.” He turned, taking steady steps, not once exposing his inner feelings, except that… the direction was wrong.</p><br/><p>“That’s to the toilet…” Wasn’t he going to rest?</p><br/><p>“…” He stopped, immediately changing his direction.</p><br/><p>“That’s my room.”</p><br/><p>“…” He changed the direction once more.</p><br/><p>“That’s the living room…”</p><br/><p>“…” He changed once more.</p><br/><p>“Why are you heading toward the main door?”</p><br/><p>“…” He turned once again.</p><br/><p>After trying all the directions possible, he finally found the correct door.</p><br/><p>“Wait a minute, Mu Xuan, you haven’t…”</p><br/><p>Mu Xuan shut his door in a hurry.</p><br/><p>Yao Si was left speechless. You haven’t made lunch yet!</p><br/><p>(⊙_⊙)</p><br/><p>Was she… going to go hungry today? I want my daughter treatment back!</p><br/><p>–</p><br/><p>Yao Si was confused. She wasn’t sure how she was going to face Mu Xuan again sine she wasn’t clear of her own emotions. Even though she didn’t feel a strong repulsion, she couldn’t just accept it with ease and just walk out of the daughter role. Her mind was in a mess, and for the first time, she wasn’t sure how to face the situation.</p><br/><p>Furthermore, this was the first time in two years she had gone hungry. She flipped back and forth as she wrecked her brain, but in the end, all she felt was hunger!</p><br/><p>o(&gt;﹏&lt;&gt;</p><br/><p>How she wished she could go back to being a baby… Back then, she at could still have duck blood curd.</p><br/><p>After prepping herself for a few days, she was prepared to have a good talk with a certain someone. But that could wait till after her meal! At that moment, she realized something amiss with Mu Xuan—he suddenly seemed extremely busy, leaving before she woke up and only coming back late into the night. Even though he would bump into her once in a while, he would only leave a few quick words before rushing off.</p><br/><p>Even when she forcefully held onto him, he would find an excuse to leave. At Luo Ying’s wedding day, he remained emotionless the entire time. In the past, he would always have his eyes on her, but now, he looked everywhere except at her.</p><br/><p>Even though he never forgot to feed her again and there wasn’t much difference in his tone and expressions, there still seemed to be something amiss. His neck would often flush a deep shade of red.</p><br/><p>What was wrong?</p><br/><p>Initially, she thought that he had eaten something he was allergic to, but then she noticed that the flush only came when he spoke to her.</p><br/><p>Did… it mean that he was only allergic to her? She thought through their meals for the past few days, and there didn’t seem to be anything out of the ordinary there.</p><br/><p>“Mu—”</p><br/><p>Just as she was about to clarify, Mu Xuan took a step back, pushing the hands that had made their way to his neck. He gripped his hands into tight fists before heading to the door in a hurry. “I have to go.”</p><br/><p>Before he could reach the door, though, someone came running in.</p><br/><p>“Your Highness, I found…” Bai Yi rushed in anxiously, but just as he was about to continue, he raised his head and saw Mu Xuan. He stilled, so startled he almost fell forward. Trembling, he greeted, “Yo-yo-your Majesty.”</p><br/><p>Yao Si was at a loss. Since Nephew Gu was a newlywed, she could only investigate the Yuan Han matter with Bai Yi. He would drop by often to update her on the investigation progress. In the past, Mu Xuan would leave the house very early thus he had never bumped into him.</p><br/><p>“Mmh.” Mu Xuan nodded, his brows furrowed and his displeasure apparent. Not rushing off anymore, he blocked the door. “Why are you here?”</p><br/><p>“Wh-why am I here?” The most respected royalty of his race had just asked Bai Yi a question, and he couldn’t wrap his head around it. His mind went blank!</p><br/><p>“Bai Yi, is there any progress?” Yao Si remembered the matter at hand and headed to the door.</p><br/><p>“Ah?!” Bai Yi frozen, then snapped back to his senses. “Yes, yes, yes, Your Highness, I chanced upon something, at-at-at…” His expression turned panicky, as though he had trouble explaining himself. “Anyways, Your Highness, come along and you’ll understand.”</p><br/><p>Yao Si’s heart clenched. “Alright, let’s—”</p><br/><p>Just as she was about to leave, Mu Xuan pulled her back violently. “We’ll go together.”</p><br/><p>“Ah?” Yao Si was confused. “Weren’t you on your way out?” Aren’t you going to continue hiding from me?</p><br/><p>“Your matters are more important!” he justified righteously. What a joke! How could he allow his cub to go out with another man by herself. All the times something bad had happened, it was because of this youth’s bad influence. He turned to Bai Yi. “Let’s go.”</p><br/><p>“Yes, yes!” Bai Yi straightened, leading the way enthusiastically as though he was the general of an army.</p><br/><p>Mu Xuan took large steps after him. When they reached the road side, a thought struck him. He gingerly bumped Yao Si’s hand before taking it into his own. Of course I have to hold my cub’s tiny hand, mmh, this is normal.</p><br/><p>Yao Si glanced at the person beside her who had grabbed onto her hand and was walking at the speed of light. Just one look, and she could see the red patch inching up his neck toward his face.</p><br/><p>Was he… showing allergies again?</p><br/><p>What exactly did he eat?</p><br/><p>–</p><br/><p>Bai Yi lived on the Red Planet, and in less than twenty minutes, they reached his place. In impatience, he lost his manners, bringing both of them to the basement.</p><br/><p>The moment they entered it, Yao Si jumped at the array of different electronics. The entire room was lit up with multiple screens, and even the ground was brightly lit. There wasn’t a single dark area anywhere.</p><br/><p>The place seemed like a mini Galactic net, misleading Yao Si into believing that she had entered it.</p><br/><p>“I never knew you were such a tech savvy person,” Yao Si marveled as she glanced around the room, taking in the sea of numbers.</p><br/><p>“I got into it recently.” Bai Yi laughed bashfully. “Your Highness, you must know that my ability… Doesn’t hold much power, so I spent a lot of my time in the Galactic net, investing various data.</p><br/><p>This was a nice way of saying he was a hacker. It was unexpected indeed! He actually possessed other abilities aside from being a nag.</p><br/><p>“Oh right, Your Highness, Your Highness!” Bai Yi suddenly remembered the matter at hand. He walked to the middle of the room and began working, his hands flying about as if they were dancing. Moments after, all the data disappeared, leaving only a gigantic screen with endless columns of red figures. “It’s like this… a few days ago, I chanced upon this space data and discovered an anomaly.”</p><br/><p>“Space data?” Yao Si stilled. Space could actually be represented by data? She glanced at the jumping numbers in curiosity. Eh… she was clueless.</p><br/><p>╮(╯﹏╰）╭</p><br/><p>“Yes, when I saw him, he was just a data that inflated abruptly before quickly deflating.” Bai Yi’s expression took on an unfamiliar seriousness. “I thought that someone nearby was using space storage facilities, but then I realized that the change in figures was just a ploy, it was actually due to the appearance of a space distortion.”</p><br/><p>“Oh…” Yao Si nodded. “What do you mean?” She couldn’t understand such technical terms.</p><br/><p>“I mean,”—Bai Yi grew increasingly more agitated—”an ordinary space storage is not able to cause such a scenario. The appearance of a space distortion could only be due to…”</p><br/><p>“Teleportation!” Mu Xuan said.</p><br/><p>“That right!” Bai Yi’s eyes lit up, filled with excitement of being understood. “That isn’t all, though, I also found that the data wasn’t nearby, but from planet T33!”</p><br/><p>“T33?” Clueless Yao Si leaned over in confusion.</p><br/><p>“It’s a planet near our academy,” Bai Yi supplemented.</p><br/><p>“Oh!” I see. “Go on.”</p><br/><p>” Planet T33 is an advanced planet, so the whole planet envelops a Galactic doorway, which means there is no need to utilize teleportation.” Bai Yi’s face turned increasingly more grim while keeping the hint of agitation. “I chased after the signal and realized that the position was within the vicinity of our academy. For a period of time, there was only one person utilizing this teleportation.”</p><br/><p>Yao Si stilled, then her eyes widened, and the answer slipped out. “Yuan Han!”</p><br/><p>Alright Bai Yi, even though you look clueless normally, you can do big things with just a little hard work. “You found that b*tch!”</p><br/><p>“Mmh, you can say that!”</p><br/><p>“Where, where? Which planet is he on? Is it far?”</p><br/><p>He stilled, his face frozen, and even Mu Xuan sighed.</p><br/><p>“What?” Did she ask a stupid question?</p><br/><p>“Sisi.” Mu Xuan tightened his grip on her hand and explained, “Since he found the data with the source originating from T33 here, the end point would…”</p><br/><p>Yao Si fell into a short daze before processing what he said!</p><br/><p>“You mean to say… that he’s on the red planet?!”</p><br/><p>F*ck, how can that be? He voluntarily came into the lion’s den. Wasn’t that too bold?</p><br/><p>“Does he really think that the most dangerous place is actually the safest?” But for the past few days, bloodlings and the Alliance were indeed not able to find him.</p><br/><p>“The exact position?” With such a terror on the Red Planet, it was indeed worrying. Besides, that guy wasn’t sane and seemed to be carrying a special virus. “Bai Yi, did you find it?”</p><br/><p>He stilled slightly, awkwardness flashing onto his face. “This… I went to get you the moment I tracked the source, so I didn’t have the time to trace the trail. I’ll do it this instance!”</p><br/><p>He turned back to the screen, and the room flashed with light and data points.</p><br/>\n</div>"}