{"title": "Chapter 101 - The Robot Competition", "id": 101, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-101-the-robot-competition", "volume_title": "Volume 2", "body": "<h1>Chapter 101 - The Robot Competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The immensity of the competition only dawned on Yao Si when she reached the tournament planet, which was equivalent to international competitions back on the Blue Planet. Zhuo Feng Academy had generously reserved an entire city for the competition.</p><br/><p>Besides students from the various academies, there were many other spectators who came to watch the competition. There were even large cheering squads for each of the respective participating academies.</p><br/><p>The galactic competition created a stark contrast to the complex opening ceremonies of the past which consisted of speeches and performances; it was simple and straightforward. The moment everyone arrived, they received information of the preliminary battles.</p><br/><p>After a short meeting with the committee members from the other academies, the competition commenced. Probably due to Yao Si’s identity, the other presidents didn’t take the initiative to talk to her. Instead, they glanced at her with both apprehension and curiosity, but never allocated her any tasks. Even the regulation preparation was arranged by Gu Shucheng, which allowed Yao Si to enjoy then event as part of the audience.</p><br/><p>She understood what it meant to control a robot after sitting through the entire robot competition. The elegant skills and ostentatious positioning was impressive even with her lack of knowledge regarding the finer points.</p><br/><p>The metallic battlegrounds stirred the vigor and excitement of the audience. At the start, Yao Si was a little confused, but toward the end, she was so immersed in the fight that she had started to cheer with the crowd. Moreover, Mu Xuan sat beside her providing a detailed commentary explaining every single action that took place. It momentarily brought Yao Si back to the past when she had been cooped up at home while watching the world cup.</p><br/><p>There were many participants and battlegrounds, allowing the top three robots to face each other after just three days and a hundred battles.</p><br/><p>Yao Si glanced at the three people in the middle of the grounds. Two of them seemed familiar since she had seen them a couple of times in the past few days, and they were two of the representatives from The First Academy.</p><br/><p>According to Nephew Gu, they were the top students of the high school branch mechanics department. As expected of The First Academy’s representatives, they had managed to reach Top 3.</p><br/><p>Yao Si, however, couldn’t recognize the last man who had a detached expression and was dressed entirely in black.</p><br/><p>“He belongs to Zhuo Feng Academy,” Nephew Gu said as he tapped open his optical computer to check something. “His name should be Yuan Han, a freshman who enrolled this year. He used to have mediocre grades, but was suddenly accepted by the robot master ‘Chi Quankun’ as his only disciple.</p><br/><p>“He seems to have a talent in this aspect. Regardless of what robot he created, it would always posses outstanding capabilities.” Nephew Gu frowned then. “This secret weapon explains why Zhuo Feng Academy chose to hold a robot competition.”</p><br/><p>“Robot master?” Yao Si grasped onto the keyword.</p><br/><p>“‘Chi Quankun is one of the top mechanics in the galaxy,” Nephew Gu explained. “It is said that the lowest level robots he designs are of S level. The strongest robot in the Alliance, the SSS robot Storm was actually built by him.”</p><br/><p>“Oh.” Yao Si nodded while taking another look at the lofty, self-centred youth below. A famous mentor explained his behavior.</p><br/><p><em>Eh, am I seeing things? Why does it seem like he’s looking in our direction?</em></p><br/><p>“It’s starting!” Nephew Gu reminded.</p><br/><p>Yao Si straightened instantly and focused on the match. The battles were determined by drawing lots, and the first one was between Yuan Han from Zhuo Feng Academy and Quan Sheng from The First Academy.</p><br/><p>“Dad!” Yao Si nudged the person beside her, prompting him for updates. “Who do you think will win?”</p><br/><p>Mu Xuan glanced back at her. Due to his use of mental strength , she was the only one who could see him clearly. Regardless of how much she pestered him the entire time, no one else would notice it.</p><br/><p>“Zhuo Feng Academy will win this round.” Mu Xuan then glanced down at the battleground.</p><br/><p>“Eh, is Yuan Han that good?” Yao Si felt slightly discouraged. For the past few days, Mu Xuan’s judgment had always been accurate, but as a student of The First Academy, she was still rooting for her own academy.</p><br/><p>“He will definitely win this round. but it won’t be easy. For the next match…” Mu Xuan glanced at the other contestant in the waiting area before replying firmly. “If nothing goes wrong, The First Academy will take the championship home.”</p><br/><p>Yao Si heaved a sigh of relief, reassured about their victory.</p><br/><p>As expected, the fight wasn’t easy. A fight that would normally take about ten minutes was ongoing even after half an hour. At the second to last minute, Yuan Han managed to grasp onto an opportunity, putting the difficult battle to an end. With that, he took a first step into gaining at least second place.</p><br/><p>The next match was between the two participants from the First Academy. It ended quickly, and just as Mu Xuan had predicted, the candidate that was going to face against Yuan Han was Yu Xiang from the robotics department.</p><br/><p>When it was finally the finals, Yao Si’s heart lifted as she focused all her attention on the two participants entering the battleground.</p><br/><p>“I request to switch my robot,” participant Yuan Han suddenly declared after raising his hands. “I request to switch to a robot I created.”</p><br/><p>Yao Si stilled. His words came as a surprise. The regulations allowed all robots below rank B to be used, and since most robotics students chose to specialize in robot creation, a large portion of them had their own robots. But this was after all a competition and robots created by students themselves would definitely be weaker than those in the market that had gone through countless tests by professionals.</p><br/><p>To switch to his robot at such a critical moment was definitely a brave move. The crowd instantly rose in volume, with many malicious comments about his intelligence being thrown loudly.</p><br/><p>In response, Yuan Han smirked coldly. He swept a cold glance across the audience, and Yao Si could swear he paused while going past her. After after a second though, he flippantly put away his original robot and pressed a space button.</p><br/><p>With a loud thud, a robot that was significantly smaller but more exquisite landed behind him. That robot spotted a smooth and fluid silhouette with pure black design that resembled the night. Its material and composition was unknown.</p><br/><p><em>Eh? This robot… looks familiar! </em></p><br/><p>“It’s Black Lighting, Black Lighting from the web!” someone exclaimed.</p><br/><p>Yao Si grimaced when she processed the situation.</p><br/><p>Wasn’t that robot the one she had destroyed a few days ago? Was he the pilot back then too? She hadn’t known that he owned the robot in reality as well.</p><br/><p><em>Er… It’s really a small world.</em></p><br/><p>“Have you seen it before?” Mu Xuan turned toward her.</p><br/><p>“You… can say that!” The image of the heavily distorted black robot embedded into the wall came to her mind. Er, how did he manage to pluck himself out of that wall?</p><br/><p>The moment the black robot appeared, there seemed to be a change in the atmosphere. There was no longer any criticism to Yuan Han’s sudden change; instead, the crowd filled with agitation and excitement of seeing their galactic web idol materializing before them. Even the lone Zhuo Feng Aademy committee member who was with them on the stage seemed confident and puffed up his chest.</p><br/><p>“I never would have expected a student from Zhuo Feng Academy to be Black Lighting. Isn’t Black Lighting a robot master?”</p><br/><p>“That’s right, a student who yields such experience in robot operating… I guess Zhuo Feng is in luck.”</p><br/><p>“But I heard that the undefeated champion recently had his record broken by someone by the name ‘Ancestor’. Wow, since Black Lighting is here, do you think ‘Ancestor’ will appear as well?”</p><br/><p>“I heard about that one-hit KO match. I wonder who ‘Ancestor’ is. Could she be a student as well?”</p><br/><p>“I can’t wait for them to have a match in reality!”</p><br/><p>As the crowd grew more heated, a certain ‘Ancestor’ lowered her head discreetly. <em>Mmh, I don’t know anything. Focus on the competition, yes, focus on the competition. </em></p><br/><p>Even though Yuan Han was famous within the galactic web robot battles and had even unleashed his own specialized robot, his opponent wasn’t someone to be taken lightly. Both of them rushed into the battle in an instant, moving so swiftly their afterimages almost blended into one.</p><br/><p>If it wasn’t for the slow motion camera and explanations being flashed on the screen, Yao Si would have been barely able to see them. She could only make out two vague shiny objects that seemed attached to each other with her own eyes.</p><br/><p>The match lasted longer than the semi-finals. Even after forty-five minutes, there still wasn’t a victor. Just then, the match went into the critical phase as both participants appeared exhausted and on the verge of collapsing.</p><br/><p>Suddenly, Yu Xiang activated a heat weapon, and hundreds of light rays covered the ground like a light web. Yuan Han couldn’t land and was forced to stay afloat. In a flash, Yu Xiang flew up as well, and the same light web appeared in the skies too, speeding against Yuan Han from the opposite direction.</p><br/><p>Yu Xiang went all out, forcing the opponent that was clearly more agile and more experienced in ground battle into the air. He activated all the power within the robot for his last attack, betting all on dealing with his opponent in one go.</p><br/><p>When the light web locked Yuan Han’s movements, Yao Si sighed in relief. It was as Mu Xuan had said—they would win.</p><br/><p>Suddenly, a black light shone in the black robot’s hand. It expanded rapidly, turning into a long weapon that was unlike the long sword he had yielded in the galactic web. Instead, it was a sickle longer than the robot itself.</p><br/><p>“Eh?” Mu Xuan said aloud, his brows knotting.</p><br/><p>“What’s wrong?” Yao Si asked.</p><br/><p>“That isn’t a rank B robot.”</p><br/><p>“What?” Mu Xuan turned to her and said in a soft voice, “That robot is of super S rank.”</p><br/><p>“…”</p><br/><p>The moment he commented on it, the black robot waved his sickle. The glowing web that was rushing toward him shattered like glass before disappearing. Yuan Han then moved swiftly, changing from defence to offence and raised his arm like a death god to take a life.</p><br/><p>Yu Xiang’s robot fell in pieces from his attack, without any ability to move. With a loud bang, it crashed onto the ground, its energy lamp extinguishing instantly.</p><br/><p>In a fraction of a second, the black robot was the only thing left standing.</p><br/><p><em>We… lost?!</em></p>\n</div>"}