{"title": "Chapter 106 - Doomsday Virus", "id": 106, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-106-doomsday-virus", "volume_title": "Volume 2", "body": "<h1>Chapter 106 - Doomsday Virus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 106: Doomsday Virus</h3><br/><p>“Dad, let’s not concern ourselves with that at this moment. Hurry up and help Luo Ying!” Yao Si tugged onto his hand. “I promise I’ll be home on time, not stray outside, and eat at least five bowls of duck blood curd every day! No, ten bowls!”</p><br/><p>“What nonsense!” Mu Xuan tapped her head, amusement brightening his eyes. “What if you get a tummy ache?”</p><br/><p>“Dad… No, Mu Xuan, you treat me the best, you’re the best father in the whole world!” she hurriedly complimented. “Then… Luo Ying?”</p><br/><p>“You wish to save her?”</p><br/><p>“En, en, en!” Very much, without a doubt!</p><br/><p>“Then I’ll save her!” Mu Xuan sighed. Yes, I have to be the one to pamper my cub. He walked towards Luo Ying and inspected her.</p><br/><p>After that, he turned around and commanded, “Knife.”</p><br/><p>The three of them froze, turning over to the shelves in unison before turning back with a surgical knife in each of their hands.</p><br/><p>Mu Xuan’s face darkened when he saw the three surgical knives that were being offered to him. Frowning, he sighed once more before grabbing the knife from Yao Si’s hands. Focusing back on Luo Ying, he held out the arm that had been injured by Yuan Han.</p><br/><p>Yao Si held her breath, staring intently at his every move. The surgery is going to start just like that? What about cleaning and sterilizing the equipment or wearing the surgical gown?</p><br/><p>Mu Xuan decisively lifted the surgical knife, but instead of directing it at Luo Ying’s arm, he made a cut in his own arm, and blood oozed out.</p><br/><p>“Mu Xuan!”</p><br/><p>“Your Majesty!”</p><br/><p>“Your Majesty!”</p><br/><p>The three of them were in shock when Mu Xuan lifted his arm to pour some blood over the wound on Luo Ying’s arm. In a few seconds, the blue glow surrounding her started to diminish rapidly, as though being forcefully suppressed. In less than two minutes, it was completely gone.</p><br/><p>“Oww, I…” Luo Ying started to shift in her bed, her eyes slowly opening.</p><br/><p>“Ying!” Gu Shucheng hugged her tightly, as though she might fall at any moment. “That’s great, that’s great!” The tears he had suppressed all along finally gushed out.</p><br/><p>“Father?” Luo Ying was in a daze, her face full of confusion. “I— What happened?”</p><br/><p>“You were infected by a virus,” Gu Shucheng explained, “but you’re fine now. It’s all thanks to His Majesty…”</p><br/><p>He turned to his side to express his gratitude, but Mu Xuan was already at the door with his cub as though he couldn’t bear to stay here any longer. “We’re going home for dinner.”</p><br/><p>–</p><br/><p>Yao Si was dragged all the way back to Xuan Ying palace, which had been newly built! Initially, she had wanted to ask Mu Xuan about the virus, but his displeased look put her off. Obediently, she finished two bowls of duck blood curd.</p><br/><p>Now that Luo Ying was cured, a weight seemed to have been lifted off Yao Si’s shoulders. Even her food seemed tastier than usual as she downed an extra bowl of rice.</p><br/><p>“I’m full!” She placed the bowl down, turning toward a certain someone who was monitoring her, only to realise that he wasn’t even looking in her direction. Mu Xuan was leaning back against the sofa. He seemed to be asleep, with an exhaustion she had never seen present in his features.</p><br/><p>Her heart sank when she remembered how he had used his blood to cure Luo Ying. Bloodlings were dependent on bloodline inheritance, so would there be any side effects?</p><br/><p>“Dad… Mu Xuan!” She ran over, grabbing onto his hand anxiously. “You… What’s wrong with you? Is it because I asked for you to cure Luo Ying’s virus? Is that why—”</p><br/><p>“I’m fine!” Mu Xuan lifted his palm to caress her head. “I’m just a little tired.”</p><br/><p>“Really?” She grew increasingly more worried. If it was really her request that had endangered him, she would feel like hell. “Don’t scare me, are you really alright? I’ve never seen you like this.”</p><br/><p>He lifted his eyelids to glance at her, and she thought she saw amusement in his eyes. In a deep voice, he said, “I’m fine, blood is indeed important to bloodlings, but it isn’t that impactful. I’m just exhausted from searching for you, I’ll be fine after a short rest.”</p><br/><p>“Really?” She inspected him, glancing around and poking him randomly, since his words didn’t reassure her that much. His breathing seemed fine, his pulse seemed normal, and his heartbeat seemed all right as well. Was it really fine then? “Is… is there anything I can do to help you? I’ll remain fretful if I don’t do something to alleviate this.”</p><br/><p>Mu Xuan pondered for a moment before nodding. “There’s something.”</p><br/><p>“What is it?”</p><br/><p>He abruptly reached his hand out and pulled her into his embrace before collapsing onto the sofa. Pressing close to her ear, he said warmly, “Be good and accompany me for a while, I’ll be fine tomorrow.”</p><br/><p>Yao Si froze, unsure if her burning face was due to his slightly warm body or something else. After taking a look at his exhausted self, she decided to stay motionless, curling tightly into a ball so that he could have more space.</p><br/><p>Ever since she was young, she had never slept beside a male. Originally, she believed that she would not be able to fall asleep, but that was not the case. It might have been because she was worn out from the day’s events, or maybe because she was too comfortable in Mu Xuan’s arms, or maybe even because the heartbeat beside her ear sounded like a lullaby.</p><br/><p>In less than two minutes, her eyelids started to droop, and she swiftly sunk into a deep sleep. When she woke up, she was clinging onto a certain someone like an octopus with its tentacles!</p><br/><p>Ehhhh…</p><br/><p>Her lips twitched. Even though her sleeping posture had never been exemplary, this was the very first time it had gone so overboard.</p><br/><p>“Mu… Xuan?” She glanced over at him awkwardly.</p><br/><p>“Mmh,” he replied calmly. Clearly, he had been awake for quite some time, but hadn’t woken her up or pushed her elsewhere.</p><br/><p>Guiltily, Yao Si glanced at how her limbs trapped him. Mmh, it was possible that he couldn’t put her elsewhere.</p><br/><p>“Awake?”</p><br/><p>“En!” She nodded violently, retracting her paws in embarrassment. She had been sleeping like a log yesterday!</p><br/><p>Mu Xuan’s face was calm, and he didn’t seem to have any intention to blame her. He tugged at his badly wrinkled top. Near his collar, there were two barely visible red marks.</p><br/><p>What’s that? Did I bite him? At such an intimate area?!</p><br/><p>She felt her cheeks burning. Even though she hadn’t dated back on Earth and was considered to be single for a million years, was she really that desperate?</p><br/><p>This was her dad! Even though they weren’t blood-related, he was still her dad! Besides, he was under the weather. Was she really a beast deep inside?</p><br/><p>No, no! I must be hallucinating. She should stop her wild thoughts. They had a pure and innocent relationship, that of father and daughter.</p><br/><p>That’s right!</p><br/><p>She inhaled deeply, counting upto a thousand internally: Rich and powerful, democratic, fair, harmonious…</p><br/><p>“Are you hungry?” After arranging his top, Mu Xuan caressed her hair out of habit before pushing a stray hair behind her ear. The warmth from his finger brushed past her face, and as if a pebble had been tossed into calm waters, an unknown emotion was born within her.</p><br/><p>She trembled and took two steps back.</p><br/><p>“What’s wrong?” His expression sunk, and he frowned instinctively.</p><br/><p>Yao Si stilled. Oh right, what’s wrong with me? Isn’t it a very normal action? It wasn’t the first time he did it, so why was her heart racing like that… Why was there so much rubbish in her head?</p><br/><p>Yao Si gave up when she couldn’t seem to figure things out. She inhaled deeply, tossed the pile of rubbish out of her mind, and calmed her racing heart. “Nothing’s wrong, nothing’s wrong. Dad, are you okay?”</p><br/><p>“Mmh.” He nodded, then repeated the correction, “Mu Xuan!”</p><br/><p>“Mu Xuan, I’m really hungry. What are we having today?” she asked smoothly.</p><br/><p>He stood up and went straight for the kitchen. “It’ll be ready in a bit.”</p><br/><p>–</p><br/><p>Yao Si finished her breakfast while making sure again and again that Mu Xuan was all right. When she was reassured that he was just exhausted the night before, she started to ask about the virus.</p><br/><p>“It’s called doomsday virus.” Mu Xuan frowned when a seemingly upsetting thought occurred to him. After a moment, he added, “This virus originated in the Blue Planet about a billion years ago.”</p><br/><p>“Earth!” Yao Si’s eyes went wide as she remembered the introduction given by Yan Xuan a while ago. “Doomsday virus… You mean the virus that killed off all the earthlings?”</p><br/><p>“Mmh.” He nodded.</p><br/><p>“That’s not right!” Yao Si stated. “Aren’t bloodlings immune to the virus?”</p><br/><p>If they weren’t, bloodlings would have perished with the earthlings many years ago. Besides, at the later stage, the virus had taken over all of the Earth, so there was no way that bloodlings could have survived and entered the Galaxy with the invasion of the bug race.</p><br/><p>“Bloodlings are indeed immune to the doomsday virus,” Mu Xuan told her, “but not against the doomsday seed virus.”</p><br/><p>“Doomsday seed virus?” Yao Si stilled.</p><br/><p>Mu Xuan sighed, a thought seeming to have entered his mind. After a moment, he said, “Sisi, do you know how the first thirty generations of bloodlings, particularly the first ten, disappeared?”</p><br/><p>“Wasn’t it… because of an internal war?” Back when she was about to enter her hibernation, all the bloodlings seemed to be busy preparing for a war.</p><br/><p>“Internal war?” Mu Xuan stilled, pondering slightly before seeming to recall something. “The bloodline suppression of the first ten generations wasn’t as severe. Before doomsday, there were indeed several internal wars, but the results weren’t very impactful. At that time, even I wasn’t qualified to battle.”</p><br/><p>“Then what happened?” When she had confirmed her bloodling status, there had been an order preventing all bloodlings below the fourth generation from participating in the war.</p><br/><p>“It was because of the doomsday seed virus.” Mu Xuan’s face darkened. “Initially, bloodlings were immune to the virus, so no one expected the virus to drive the bloodlings into extinction, and conversions had been rare. This was so until the day the doomsday seed virus appeared.”</p><br/>\n</div>"}