{"title": "Chapter 118 - Origins of the Virus", "id": 118, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-118-origins-of-the-virus", "volume_title": "Volume 2", "body": "<h1>Chapter 118 - Origins of the Virus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Flower!</p><br/><p>It’s a… giant flower!</p><br/><p>(⊙ o ⊙)</p><br/><p>Behind the small building was an empty field with a giant crystal like a blue flower. It was almost as tall as the building. And there wasn’t just one flower like that, for an entire field was littered with them. They were completely blue and without any leaves, more like standing artwork than works of nature.</p><br/><p>What kind of fertilizer was used for them to grow to such a size?</p><br/><p>Besides, was it just an illusion or did they look familiar?</p><br/><p>She reached out to touch the floor, but just then, Qu Ze smacked her hand in mid-air.</p><br/><p>“Don’t touch it!” he shouted out.</p><br/><p>Her arm numbed from the force he exerted. <em>What’s the big deal, is there any need to get so worked up?</em></p><br/><p>Yao Si glanced at Qu Ze indignantly. Perhaps his default smiley persona had become a norm to her, so once his true colors were revealed, she couldn’t help feeling frightened.</p><br/><p>What had happened?</p><br/><p>“Do you know this flower?”</p><br/><p>Just then, there was movement in the bushes ahead, producing a rustling sound. On a closer inspection, it was actually a person!</p><br/><p>There was actually someone there! Was it the monster that had hidden the map?</p><br/><p>After half a second, the person seemed to have detected them and dashed in their direction. When Yao Si finally caught a clear glimpse of the noise maker, she inhaled sharply, her heart chilling.</p><br/><p>Instead of a single person, there was a large group. From the looks of it, there seemed to be about a hundred of them shouting indecipherable commands. They seemed to be players, but their skin was all blue, as if they were from Avatar! Not one of them had all their limbs intact, missing arms and legs, their bodies stained with blood. There were even some that had their organs exposed, their intestines spilling onto the ground. Even then, they continued to dash toward Yao Si and her group maniacally, filling the air with a horrible stench of rotting meat.</p><br/><p>She finally remembered where she had seen the flower; it was on the day of the machine competition. When Yuan Han was escaping, the flower had been the last strike to the competition grounds.</p><br/><p>And in his hands had been… the doomsday virus!</p><br/><p>Which meant that the people in front of them were… zombies?</p><br/><p>Why were there such things on a game planet?! Was this part of their program? Or…</p><br/><p>Yao Si dared not venture down that thought as the zombies bolting out from the bushes increased in number. There seemed to be enough of a crowd to surround the whole building. Yao Si’s grip around the sword in her hands tightened. Her situation was starting to turn into something more than a game.</p><br/><p><em>What are we going to do?</em></p><br/><p>With no room for escape, Qu Ze’s face fell, and he muttered, “Just let them succeed.”</p><br/><p>Yao Si stilled. What did he mean?</p><br/><p>He turned to grab her hand and shouted, “Leave! Let’s go into the house first!” Before she could react, he bolted toward the house, dragging her along.</p><br/><p>In just a few seconds, he managed to crack the code on the door. The moment the doors closed behind them, a loud thud banged against it, followed by a chilling low howl. There was no doubt that they had been surrounded by zombies.</p><br/><p>“Your Highness, the people outside… Could they…” Bai Yi glanced at her in fear, his eyes wide. The sight outside had to have frightened him.</p><br/><p>Yao Si nodded. “You’re right, they should have been infected by the doomsday virus…” If Luo Ying wasn’t cured, she probably would have ended up like them.</p><br/><p>“But… isn’t that an ancient virus from the blue planet? Isn’t this Nirvana planet? How are they infected?”</p><br/><p>The zombies outside seemed to be people of different races.</p><br/><p>“This… you have to ask him.” Yao Si turned to glance at Qu Ze.</p><br/><p>From the moment they had entered the house, he had never stopped hustling around. He had switched on the internal control system and was searching for something at that moment. When Yao Si directed the question at him, he turned to glance at them. But instead of clearing their doubts, he pointed to the area in front.</p><br/><p>“This door won’t be able to hold for much longer. There’s a door at the back that leads to an underground research lab. We’ll probably be able to stay there for a while.”</p><br/><p>Turning, he dashed in the direction he just mentioned.</p><br/><p>Yao Si exchanged glances with Bai Yi. The noise outside was starting to intensify; there was even the sound of electricity which was probably the defensive mechanism on the door exploding.</p><br/><p>“Let’s go!” She followed behind with Bai Yi. Regardless of what Qu Ze discovered, they should first leave this place. After all, those zombies were infected by the deadly doomsday virus.</p><br/><p>Qu Ze had been right, there was indeed an underground research lab below. And it was a stark contrast to the small house above. The area below was huge. They turned several corners, but everywhere looked similar. The rooms were filled with unknown weapons, and there was even a room dedicated to samples.</p><br/><p>It was starting to feel familiar.</p><br/><p>Other than the lack of people and the mess that indicated a haphazard exit, the place was exactly the same as the research base Yao Si had visited before. She suddenly understood where the doomsday virus that had infected Luo Ying had come from.</p><br/><p>This was Euphoria’s virus research base!</p><br/><p>Her heart sank, and even Bai Yi was glancing around with a complex expression on his face. Qu Ze’s smile that was constantly plastered on his face went away as well, turning him into a completely different person.</p><br/><p>They headed straight to the place that seemed like the control room.</p><br/><p>The moment they entered, Qu Ze buried his head into the main control table, his back rod straight. His fingers flew across the buttons rapidly, and screens lit up one after another, all of them filled with code she couldn’t decipher.</p><br/><p>In less than a minute, with a beep, all the screens filled with the same red row of numbers. They were going down, counting down the time.</p><br/><p>“I managed to activate it.” Qu Ze’s shoulders slumped in relief. He looked like a deflated balloon as he plopped down onto the chair. “But I was too late.”</p><br/><p>The ominous premonition rose within Yao Si. “Qu Ze, what is going on here? From the start you knew that this wasn’t a hidden area, but a research base… Euphoria’s research base!” she said with agitation.</p><br/><p>Qu Ze stilled and lifted his head to glance at her. The corners of his lips lifted into a forced smile. “You’re no doubt our royal highness. Yes, your guess is correct.”</p><br/><p>“You kidnapped me just to see this?” Yao Si couldn’t figure out his motives.</p><br/><p>“You could say that.” He exhaled a long breath. “I discovered this place a year ago, but I only managed to confirm that it was a research base recently. I never expected them… to really succeed! I had wanted to enter for a while now, but was trapped outside by the mental barrier. Its strength… is special!”</p><br/><p>He frowned at an unpleasant memory, before continuing, “Later, I discovered the weakening of the mental barrier, but I still wasn’t able to enter. Thus, I decided to invite you over to share in the misery.”</p><br/><p>Yao Si’s lips twitched. <em>Share the misery?!</em></p><br/><p>“Why didn’t you report this to the Elder Council?” As an elder, he should have been aware of the internal investigations against Euphoria. If he was able to find the place, he could have simply resolved the issue through the bloodlings. So why did he go through all the trouble of kidnapping her and even with such a hateful method?</p><br/><p>“Elder Council?” He gave a chilling laugh, shaking his head. “If only it was that simple, Your Highness…”</p><br/><p>He seemed to have something to tell her? Suddenly, a loud thud came from outside. The door was smashed open, and a black shadow charged toward her at lightning speed.</p><br/><p>“Your Highness!” Bai Yi exclaimed.</p><br/><p>But it was too late, the black figure had already pounced on her. Pain erupted on her waist as she flew to the side. Without a chance to get her footing, she smashed head first into the control table. Her head was safe, but a huge dent was made among the controls.</p><br/><p><em>It hurts!</em></p><br/><p>“Qu Ze! What are you…”</p><br/><p>Yao Si suppressed her anger. When she was about to scold him, she realized that there was a hole in his waist. Fresh blood was oozing out of it, staining more than half of his body. What was even worse, a blue glow was spreading from the wound.</p><br/><p>“What happened?” Yao Si headed over to him in a hurry.</p><br/><p>Suddenly, there was a squeak from below. Lowering her head, she saw a creature that was about the size of a bunny. Its skin had been peeled off, but its sharp paws were drenched in blood. The creature had blue glowing eyes which glared at Qu Ze.</p><br/><p>Rat! The creature that had headed toward them was an infected rat!</p><br/><p>The rat jumped up, aiming for them once more.</p><br/><p>Yao Si felt her mind blank out. Yet a sudden impulse forced her into tossing the chair beside her at the rat, sending it crashing into the wall like a baseball ball.</p><br/><p>It created a dent from the impact, then slid down to the ground. But even then, it was still alive. With just a two second pause, the rat pounced forward once more.</p><br/><p>Qu Ze activated his ability. With a wave of his hand, a black slit suddenly appeared, heading straight for the rat’s back. It was slashed in back when the portal passed by it.</p><br/><p>His ability was… space splitting.</p><br/><p>Qu Ze’s ability belonged to the space series!</p><br/><p>He seemed to have exhausted all his strength from that attack, for he slumped onto the ground, his wound bleeding profusely.</p><br/><p>“Elder!” Bai Yi supported him without any hesitation. He tried to stop the bleeding, but nothing seemed to help.</p><br/><p>“It’s useless!” Qu Ze smiled out of habit. “I’m infected.”</p><br/><p>“You… Why?” Yao Si was confused. After getting tricked by him so many times, her first thought upon entering this horrid place had been about what could be his ulterior motive. But he had instead come forward to save her by placing his life on the line. She couldn’t explain her emotions.</p><br/><p>“You are our royal highness, aren’t you?” His face was pale, devoid of all color, but he still struggled to keep that ugly smile of his as he replied to her nonchalantly.</p><br/><p>Yao Si felt her heart clench. Just as she was about to speak, the familiar squeak came from behind, getting closer.</p><br/><p><em>F*ck, just how many infected rats are there? </em>It explained the lack of people, though.</p><br/><p>Everyone’s faces paled.</p><br/><p>“Hurry, block the door!” Yao Si turned, preparing to move the heavy machines toward the door for a temporary solution.</p><br/><p>“It’s useless!” Qu Ze grabbed onto her suddenly. “I’ll use my ability to send you guys out!”</p><br/><p>He activated his ability to open a portal. After pushing Bai Yi inside, he turned toward Yao Si.</p><br/><p>“Your Highness!” He removed the optical computer from his hand, stuffing it into her hands. “I just copied all the information from the research base inside it. Bring it back to the Red Planet and hand it to His Highness. Remember! You can only give it to His Highness!”</p><br/><p>“What do you mean?” Yao Si stared at him with wide eyes.</p><br/><p>“Once you’re out, head west. My optical computer can bring you out of the mystical barrier. Hurry! I’ll block the rats!”</p><br/><p>“You’re crazy!” Yao Si was infuriated. “What about you?” <em>If you can open a portal, why not come with us?</em></p><br/><p>“I won’t live long since I’m infected, in case… Besides, we can’t leave this research base.” He smiled, but it was no longer his usual flippant one. It was sincere. “Apologies, I never intended to drag Your Highness into such a dangerous situation.”</p><br/><p>“Wait a minute, Qu Ze!” <em>Who am I talking to now? This is so unlike you! Even if you intended to redeem yourself, you shouldn’t use such methods! </em> “What exactly happened?”</p><br/><p>“I don’t think I’ll be able to explain certain matters, but regardless…” He suddenly reached out to grab her. “Please, Your Highness, you must protect yourself! And… other than His Majesty, do not believe in anyone else!”</p><br/><p>“Listen to me—” The virus isn’t incurable!</p><br/><p>Before she could finish her sentence, he released her and gave her a strong push. Before she could get a hold of the situation, the world went black. The next instant, she was back on the grass field.</p><br/><p><em>F*ck! Can’t you wait for me to finish my sentence?!</em></p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p>“Your Highness!” Bai Yi glanced at the portal entrance. “Where’s the elder?”</p><br/><p>Yao Si felt a flame alight within her.</p><br/><p>“Give me a moment!” she told him.</p><br/><p>She stood up, forcing out the leftover energy within her.</p><br/><p><em>Do you think you’re the only one with a space ability?! You think everyone can be the hero to the damsel in distress?</em></p></div>\n</div>"}