{"title": "Chapter 122 - The Jarring Sight of Heavenly Demon", "id": 122, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-122-the-jarring-sight-of-heavenly-demon", "volume_title": "Volume 2", "body": "<h1>Chapter 122 - The Jarring Sight of Heavenly Demon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Are you sure Heavenly Demon Xing Chong is on this planet?” Yao Si asked, pointing toward the planet in front of them.</p><br/><p>“Don’t worry, everything will be alright!” Li Yue slammed his chest in assurance. After going through the immigration records of all celestials, he had managed to narrow the search to that planet.</p><br/><p>“That’s right, Master.” Number 27 floated over after bouncing up and down on Qu Ze’s shoulders. “I hacked into every celestial’s optical computer. Even though this Heavenly Demon is a country bumpkin that doesn’t have an optical computer, I managed to find photos of him in the neighboring planet. There is a 99% chance that he is on this planet.”</p><br/><p>Country bumpkin…</p><br/><p>Yao Si was speechless and unconvinced, thanks to Qu Ze’s previous bad record. Even though he had proven himself, she still couldn’t help turning toward the only person with insight. “Maiden Yue, what do you think?”</p><br/><p>Li Yue felt his face stiffen. Maiden Yue??</p><br/><p>Even since the day he had been dragged to the Red Planet in the middle of his bath, everyone, including Yan Xuan, had started to see him in a different light. He felt that there was a need to justify himself. With a cough, he turned to Yao Si with a serious expression. “Your Highness, I think you might have a slight misconception about me. As a celestial of the Nine Heavens, I am a man. Please do not doubt my preferences. Could you change the way you address me?”</p><br/><p>“Ah, don’t sweat the small things.” Yao Si waved her hand dismissively. <em>Aren’t you just a guy who likes pink? </em>“Then let’s go with Pink Yue. Do you really think Xing Chong is here?” She smoothly changed the way she addressed him.</p><br/><p>“…” <em>What’s wrong with liking pink? Does it make you less of a celestial?</em></p><br/><p>Besides, wasn’t it a bloodling matter? Why did they have to drag him along to the demonic realm?</p><br/><p>Li Yue, who had always been cold and elegant, started to feel frustrated. Yet… he had to maintain his graceful smile!</p><br/><p>o(&gt;﹏&lt;)o</p><br/><p>“According to the environment here, it is indeed suitable for demonic cultivation. It is highly likely that he will be here.”</p><br/><p>“Let’s go!” Mu Xuan instructed, pulling onto his cub’s hands as he led the pack.</p><br/><p>Little Ball brought them to an uninhabited planet which had barely a soul in sight. It was littered with volcanos; the temperature horrifyingly high. Yao Si couldn’t understand why anyone would come there for cultivation.</p><br/><p>But to Little Ball, who could hack into anything, tracing a demon that didn’t even try to conceal himself was a piece of cake. In order to maintain an element of surprise, they decided not to walk the official road but opt to visit him personally. Together with Mu Xuan, Li Yue, and Qu Ze, she reached the planet to thoroughly investigate what had happened in Nirvana.</p><br/><p>“The demonic powers seem to congregate at the front. Heavenly Demon Xing Chong should be right ahead.” Li Yue pointed toward the tall volcano ahead. He then seemed to think of something as he explained awkwardly, “Xing Chong is currently in cultivation. Besides, we have a private score that is unsettled. I’m worried he won’t meet us…”</p><br/><p>“Let’s head in first then!” Before he could finish his sentence, he felt an overwhelming mental strength enveloping all of them, and the scenery started to change. The spell was broken, and a small pathway showed up, leading into the volcano.</p><br/><p>“…” Li Yue.</p><br/><p>All right, he seemed to have forgotten the presence of the bloodling king whose mental strength was one of the greatest in the Galaxy. It instantly boosted Li Yue’s confidence.</p><br/><p>Xing Chong was positioned in the middle of the volcano that was surrounded by lava. The moment they entered, the scenery changed, creating a stark contrast to the exterior. Even the overwhelming temperature vanished.</p><br/><p>Celestials were indeed a progressive race. If the activation of mental strength was considered a trait, the high technology inside was the trait of the Galaxy—lasers, poison gas, both cold and hot weapons, without any one missing.</p><br/><p>However, with Mu Xuan around, no trap was strong enough. The four of them walked without any obstruction holding them back. Even when occasional spells ambushed them, all of them were deflected away. The technologically advanced weapons could have become a hassle, but with Nr. 27 Little Ball and Qu Ze’s coordination, they weren’t an issue either.</p><br/><p>The smooth journey bored Yao Si, and she suddenly felt like she was wasting her time. Why did she have to come along anyway?</p><br/><p>“We’re here!” They finally reached the deepest part of the volcano.</p><br/><p>Yao Si inhaled deeply, tightening her grip around Mu Xuan’s hand before they entered. The last barrier was a waterfall. With just one strike from Mu Xuan, it fell apart, but Yao Si couldn’t help worrying. With such a tight security, she started to feel cautious of the Heavenly Demon. He might even be in cahoots with Euphoria, doing despicable business here…</p><br/><p>“Mmh… Ah… Hurry, give me… Harder!”</p><br/><p>“Heavenly Demon, don’t rush, I… will pleasure you!”</p><br/><p>“No… there, don’t…”</p><br/><p>“Heavenly Demon, don’t what?”</p><br/><p>“Hateful…”</p><br/><p>R21 voices started to drown their senses. The room had a massive bed upon which two naked bodies lay—one on top of the other… both male.</p><br/><p>(⊙ o ⊙)</p><br/><p>“…” Yao Si. <em>Is it too late to retreat?</em></p><br/><p>“…” Qu Ze, +1!</p><br/><p>“…” Little Ball, +2!</p><br/><p>“…” Li Yue. <em>We need to break off ties with them!</em></p><br/><p>“…” Mu Xuan. <em>There’s always someone who wants to taint my cub’s mind!</em></p><br/><p><em>Eyes hurt! I’m going to go blind!</em></p><br/><p>Yao Si stiffened and turned to the person beside her. “Maiden Yue, do all celestials have such… unique preferences?”</p><br/><p>Li Yue froze. <em>What’s with your insinuating gaze?!</em></p><br/><p>He felt a serious need to justify himself. He immediately said resolutely, “He belongs to the demonic clan. We aren’t the same! Besides, my disciple is a female!”</p><br/><p><em>Eh… I never asked about the gender of your disciple? Did you just expose yourself?</em></p><br/><p>(⊙_⊙)</p><br/><p>“What?” Before Yao Si could clarify the situation, Li Yue howled and successfully managed to divert everyone’s attention.</p><br/><p>The person at the bottom hurriedly shoved the person on top away. With a wave, a long red sword appeared in his hands and he glared at the intruders. When he saw Li Yue, he froze before smirking. “Li Yue! Heh, I never thought you’ll come all the way here!”</p><br/><p>Yao Si was speechless. So he was the one at the bottom? <em>You have indeed shamed the Heavenly Demon’s name!</em></p><br/><p>Such strong tastes! No, no, no, she needed to get the image out! She needed to maintain her composure.</p><br/><p>“Xing Chong, I haven’t yet gotten an explanation from you for hurting my disciple.”</p><br/><p><em>Wow! </em>Li Yue really had something against him? Yao Si took a glance at the man hiding behind Xing Chong, and the jarring scene from a moment ago filled her mind again… She could feel a heartbreak coming.</p><br/><p>“Heh! So what if I had even killed her?” Xing Chong was so preoccupied by the sudden appearance of an enemy that he simply disregarded the three others on the side.</p><br/><p>With an arrogant smile, he released a dark aura. It was in stark contrast to the flirtatious bantering from before. “That b*tch is just an earth celestial with poor skills. It wouldn’t have been a waste even if she had died.”</p><br/><p>“Shut up!” Li Yue fumed. “Even though Yu Er is just an earth celestial, she’s my only disciple!”</p><br/><p>“Disciple? Don’t try to sugarcoat it!” Xing Chong fumed, bolting up in agitation. The half covered body came in full view as the blanket slipped off. As the HD figure appeared, Mu Xuan hurriedly covered his cub’s eyes.</p><br/><p><em>Mmh, I’m definitely going to go blind!</em></p><br/><p>But f*ck, the lights had dimmed at the crucial moment! She shouldn’t have brought her guardian along. Yet even though the graphics had been removed, the sound still managed to reach her ears.</p><br/><p>“What disciple?! If that b*tch hadn’t seduced you, how could you have decided to break up with me so heartlessly!”</p><br/><p>Eh? This was starting to feel weird! The three in the audience stilled; there seemed to be more to the story than they thought!</p><br/><p>“Yu Er is my one and only true love. I love her! What does that got to do with you?” Li Yue shouted out, deciding to come clean.</p><br/><p>“True love… Y-y-you…” Xing Chong started to tremble in fury. “If she is your true love, then what about me? Have you forgotten about the friendship we forged after the thousand years we spent in cultivation?”</p><br/><p><em>Cultivation? What cultivation? What kind of cultivation? Please clarify!</em></p><br/><p>“Your persistence is too extreme and may cause you to fall in too deep.”</p><br/><p>“I don’t believe that after so many years, you still haven’t fallen for me!” He walked forward with aggressiveness.</p><br/><p>Li Yue’s face twisted. “All this while we have only been friends.”</p><br/><p>“Who the f*ck wants to be your friend?”</p><br/><p>“Yu er is…”</p><br/><p>“Shut up, shut up!”</p><br/><p>The audience stayed speechless. What should they do? The scene before them seemed to belong to the ridiculous soap dramas.</p><br/><p>Celestials sure were wild.</p><br/><p>The plot was starting to turn into a poorly written drama as Xing Chong ran over with a devastated expression. It would have been a sad scene if… he wasn’t completely naked.</p><br/><p>Mu Xuan’s face darkened, the last string of control snapping as his mental strength came exploding out. In an instant, other than a certain someone who had her eyes covered, everyone else fell on the ground with a thud.</p><br/><p>“Put on clothes before you quarrel!”</p><br/><p><em>Can’t you see that there are children here? What if my cub grows astray?</em></p><br/><p>“…” Xing Chong, who noticed the presence of others.</p><br/><p>“…” Li Yue who had gone overboard.</p><br/><p>“…” Young Cub Yao Si.</p><br/><p>“…” Qu Ze and Little Ball. Even though they had no idea why they were being punished as well, they couldn’t help feeling impressed.</p></div>\n</div>"}