{"title": "Chapter 129 - Second-Time Inheritor", "id": 129, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-129-second-time-inheritor", "volume_title": "Volume 2", "body": "<h1>Chapter 129 - Second-Time Inheritor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Yao Si was at a loss for words. Even though she was the victim of the incident, she couldn’t seem to hate Li Zheng. She was constantly reminded of his radiant smile and the him from before who would often sneak a few extra pieces of duck blood into her basket.</p><br/><p>If only they could turn back the time…</p><br/><p>While she was contemplating the past events, Mu Xuan’s optical computer suddenly rang.</p><br/><p>He turned it on, and Yao Qian’s image popped out. He seemed perplexed and worried. “Your Majesty, that person… is awake!”</p><br/><p><em>That person?</em></p><br/><p>Yao Si stilled, understanding who he meant almost instantly. “Li Zheng is awake?”</p><br/><p>“Yes, Your Highness!” Yao Qian nodded. “He just woke up.”</p><br/><p>“I understand, I’ll be right there.” Mu Xuan stood up. Even though his mental strength surrounded the building, there were other people keeping guard as well. They were mainly bloodlings below the thirtieth generation, so there was no guarantee that they would be safe from his bloodline suppression.</p><br/><p>“Wait a minute, Your Highness!” Yao Qian exclaimed anxiously. “There’s one more problem I need to report.”</p><br/><p>“What?” Both Yao Si and Mu Xuan froze, staring at him.</p><br/><p>“He seems… to be suffering from amnesia.”</p><br/><p>“…”</p><br/><p>What?!</p><br/><p>—</p><br/><p>In a flash, Yao Si was at the research center in front of Yao Qian.</p><br/><p>“What do you mean by amnesia?” she asked. “Does he remember who he is?”</p><br/><p>“It’s not like that!” Yao Qian seemed perplexed, as though he had no idea where to begin. Instead, he brought her and Mu Xuan over to Li Zheng’s room.</p><br/><p>It was a specially made transparent room that could prevent the person inside from using their mental strength. The room was rather empty, with just one bed on which lay Li Zheng. He was indeed awake and sitting upright. He seemed like a changed person, the negative aura from before nowhere to be seen.</p><br/><p>The Li Zheng at that moment was different, his expression dazed as he looked around blankly. His gaze was filled with unease and curiosity. The dark aura’s disappearance had left behind a clean and empty soul.</p><br/><p>“Your Majesty, Your Highness!” Yao Qian pointed to the person in the room. “He has been like this ever since he woke up. His memory seems to date only to the years still on the Blue Planet. He also doesn’t seem to have any common knowledge about the Galaxy.”</p><br/><p>“You mean…” Yao Si’s heart sank. “He only has memories from the days on Blue Planet?”</p><br/><p>“It seems like it!”Yao Qian nodded.</p><br/><p>“Which year?”</p><br/><p>“From what he said, it was… 2017AD.”</p><br/><p>“2017!” It was around the time Yao Si had met him, which meant that he not only forgot about everything that had happened in the Galaxy, but also everything about the doomsday period. “Mu Xuan…” She grabbed his hand. If it was real, maybe he wouldn’t have the same extremist views anymore.</p><br/><p>“Are you sure?” Mu Xuan caressed her head reassuringly before turning toward Yao Qian. “He is a fourth generation bloodling. It would be easy for him to trick you guys.”</p><br/><p>“It should be true!” Yao Qian presented a stack of data in several screens which appeared in front of them. With a glance at it, he said, “We found that in the big fight, he suffered a tremendous trauma which led to permanent damage to his mental strength. It has disappeared entirely.”</p><br/><p>This meant that he didn’t have any mental strength to conceal his current state. Besides, he had been extremely accommodating throughout the tests, and he even treated them… politely?</p><br/><p>Mu Xuan studied the data carefully. Suddenly he stopped on the most recent page, even maximizing it on the screen. His expression changed slightly. “Is this the DNA result?”</p><br/><p>“Your Majesty, you see the problem?” Yao Qian took a step forward, filled with surprise and a hint of excitement. “I was so shocked by the results I started to doubt myself. But after multiple tries, the result remained the same. Besides, all the newest test results have come in today once more.”</p><br/><p>“What does that mean?” Yao Si was confused. <em>Please take care of this illiterate person here, thanks!</em></p><br/><p>“Your Highness!” Yao Qian turned to glance at her with glowing eyes. He looked like he had turned into a crazy science professor. “No one in the entire Galaxy is able to change their DNA. The only exception is during a conversion into a bloodling, when one changes their race.”</p><br/><p>“I know that!” <em>Isn’t it just conversion?</em></p><br/><p>“But Li Zheng…” Yao Qian pointed to the data in front of him. “In just a short few days, his DNA has changed.”</p><br/><p>“Ah, him?” What did that mean? Did he turn into a superman?</p><br/><p>“He was converted.”</p><br/><p>“Ah? Wait a minute!” Yao Si felt her brain begin to buzz, starting to get confused by the influx of information. “He was converted? Wasn’t he already a bloodling?”</p><br/><p>Or had he been in the same situation as her and lived as a fake bloodling all those years? It was only through death that the whole process could be finalized.</p><br/><p>“He had indeed been a pure fourth-generation bloodling. He wasn’t in the same situation as you,” Mu Xuan explained after sensing her doubt. But then his face fell, his brows scrunching together. “What Yao Qian means is… that he has been converted a second time.”</p><br/><p>“A second… conversion?”</p><br/><p><em>What the f*ck? There is such a thing as second conversion? Why had no one told her…</em></p><br/><p>“This is the first time I have encountered such an event,” Yao Qian continued in obvious excitement. “But from the data I’ve gathered, his changes match the effects of conversion. All of his past memories have been erased, leaving only the convertor’s memories intact.”</p><br/><p>“You mean…” Yao Si frowned, “He didn’t just convert… He’s an inheritor?”</p><br/><p>“That’s right!”</p><br/><p><em>What do you mean by that! How did such an illogical thing happen? Who converted him this time?</em></p><br/><p>Wait a minute!</p><br/><p>Since Li Zheng was a fourth-generation bloodling, there was no way other bloodlings would be able to suppress him. The only one who was stronger was… Mu Xuan!</p><br/><p>(⊙_⊙)</p><br/><p>She jerked her head back to look at Mu Xuan, finding his face as dark as the skies outside, his brows so scrunched up they could kill a fly. He had caught on? He had a new inheritor!</p><br/><p>Yao Si’s heart clenched.</p><br/><p>“Let’s go in and take a look.” Mu Xuan pushed open the door and headed inside.</p><br/><p>Li Zheng who had been in a daze turned to them, his eyes brightening, and a wide smile spread across his face in greeting. He looked just like the young man from the past who had sold Yao Si duck blood.</p><br/><p>“Dad!”</p><br/><p>It was as expected!</p><br/><p>Yao Si’s heart sank. Even though it was an accident, the bitterness couldn’t be held back. It gushing out, engulfing her. She now understood why bloodlings had such differing opinions toward cub and inheritors. She didn’t like inheritors either; she was no longer the only baby.</p><br/><p>“With just one look, I can tell who my dad is.” Li Zheng was a stark contrast to his previous self. He ran barefooted toward them in excitement. “Hello, dad, call me Yao Si.”</p><br/><p>As he spoke… he grabbed Yao Si’s hand.</p><br/><p>“…”</p><br/><p>Σ(°△°|||)︴</p><br/><p>What????</p></div>\n</div>"}