{"title": "Chapter 124 - The War to Save the Red Planet", "id": 124, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-124-the-war-to-save-the-red-planet", "volume_title": "Volume 2", "body": "<h1>Chapter 124 - The War to Save the Red Planet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“It’s really you.” Mu Xuan frowned. “You woke up after all.”</p><br/><p>“Woke up?” The man smirked. “I have never gone into hibernation. Mu Xuan, I’m not you. I wasn’t given that luxury. For the past million years, I have never been at peace. So how could I have slept?”</p><br/><p>“After all these years… you still haven’t put it behind you?”</p><br/><p>“No!” He shook his head. “As you mentioned, a million years have passed, so how could I have not put it behind me?” He lowered his head to glance at the Red Planet, his gaze cold and unfeeling. “I just understood that immortality is a curse, and because of it, I have been in pain for a million years. Soon, all of them will walk down my path.”</p><br/><p>“You want to wipe out the entire race?”</p><br/><p>“I just want to free them from this endless life.” The man’s gaze turned colder as he looked at Mu Xuan while articulating his words clearly. “Besides, they will feel the same way soon, just like… the me from before.”</p><br/><p>“They are not you.”</p><br/><p>“They will soon be.”</p><br/><p>“I told you…” Mu Xuan’s face fell. “I don’t care what you want to do, but you cannot harm our kinsman!”</p><br/><p>“Heh…” He smirked. “It’ll depend on whether you can stop me like the last time.”</p><br/><p>He raised his arm, summoning multiple fire dragons to charge at Mu Xuan who used a transparent barrier to shield himself from the attack. The next second, their figures flashed, disappearing into the fields and leaving only the sound of fighting in their wake.</p><br/><p>The camera could no longer catch their figures, showing only flashes of light in the skies. Yao Si grew more anxious with each passing moment. Even though she had utmost confidence in her ex-dad, it wasn’t a fair match. Mu Xuan had to look out for the other bloodlings while engaging in mind control, and if that wasn’t enough, the enemy wasn’t weak either.</p><br/><p>Yao Si could already conclude that his opponent was most likely Euphoria’s leader. She had assumed that his motives for forming Euphoria were to rob the bloodlings of their immortality, but it was only then that she realized that he wanted to wipe out the entire race. Based on their conversation, the BOSS against them was also a bloodling, and probably one that was within the first five generations.</p><br/><p>Yao Si was full of worry as she looked at a few screens at once, afraid to miss out on anything. Mu Xuan and the BOSS were gone, but the sounds of the fight were growing more and more intense, even affecting the people below. Many houses had started to tremble as though an earthquake was about to occur. The cities and the mountainous areas were all crumbling, rock and building fragments flying everywhere.</p><br/><p><em>Mu Xuan…</em></p><br/><p>“Don’t worry, Your Highness!” Qu Ze had to have seen her anxiety, for he reassured her with a pat on her shoulder. “Even though I can’t tell his identity, but His Majesty is the only one that managed to awaken the ancestor’s bloodline. Even a first generation bloodling wouldn’t be his match.”</p><br/><p>Yao Si nodded. She was obviously aware of that, but… how could she not worry? Who knew if the maniac that created the doomsday virus and wanted to eliminate all the bloodlings had any other tricks up his sleeve?</p><br/><p>But she was helpless and could only focus on the camera’s feed.</p><br/><p>Qu Ze was right. The BOSS was indeed no match against Mu Xuan. Even if Mu Xuan had spread his mental strength to prevent the other bloodlings from being embroiled in the mess, he wasn’t in any sort of a disadvantage. Besides, the sounds of the fight started to fade away as they rose higher into the air and no longer caused a problem on the ground.</p><br/><p>The two figures started to grow smaller until they could no longer be seen. Fortunately, there was still Little Ball. It switched on the feed from outer space.</p><br/><p>As expected, the screen once again filled with various abilities. Even though the other planets weren’t affected, the spaceships that were circling around them faced a disaster from which they couldn’t escape alive.</p><br/><p>Yao Si sighed. Mu Xuan was indeed her ex-dad! She gave him a big thumbs up internally. From the looks of it, the Red Planet would be free of danger in no time.</p><br/><p>The fighting went on for about ten minutes before finally stopping. Mu Xuan and the Boss reappeared on the screen once more. Yao Si hurriedly inspected Mu Xuan through the feed. <em>Phew… He seems fine. Besides his messy hair, there doesn’t seem to be anything wrong with him.</em></p><br/><p>The other person, on the other hand, was covered in wounds and blood. His right arm was angled oddly at the side.</p><br/><p>“As expected, I still can’t defeat you!” The Boss remained unfazed though; instead, he gave a mysterious smile. “It’s better this way! But… do you really think I came all this way just to have a fight with you?”</p><br/><p>Mu Xuan stilled, his frown deepening. What else did he want?</p><br/><p>“Mu Xuan, I once told you that I’ll let you feel the same pain I felt.” A wide smile spread across his face. It seemed to be hiding something, like an unaccomplished wish or a promise to go all out. It was full of satisfaction yet chilling to the bone, and Yao Si’s heart sank.</p><br/><p>She thought of something then and said, “Little Ball, return the image back to the Red Planet!”</p><br/><p>With a flash, the screens once again showed the Red Planet. Explosions could be heard from the spots in which the meteorites had fallen, and a blue fog was rising from them.</p><br/><p>Was that… the virus?</p><br/><p>“Qu Ze, hurry up! Inform the Elders Council! Get everyone to evacuate the Red Planet.” Even though the meteorite situation had been settled, the virus filled fog still rose from within them. No one could fathom the consequences of it.</p><br/><p><em>F*ck, that bastard truly had another plan up his sleeves! Did he deliberately lure Mu Xuan out of the Red Planet?</em></p><br/><p>Mu Xuan had to have suspected the precarious situation as he turned toward the Red Planet. What was weird was that no one followed him. Instead, Li Zheng’s smile deepened. The instant Mu Xuan turned his back to him, he made a slit in the air. Yao Si’s heart sank as she thought that he was going to ambush Mu Xuan. But instead, the air beside him started to split open, and a black portal took shape.</p><br/><p><em>Is this space teleportation? What is he going to do?</em></p><br/><p>Before she could come to a conclusion, she felt a chill on her back as an overwhelming eerie force came rushing towards her. The big BOSS on the screen was suddenly beside her, his low voice ringing in her ears. “I caught her!”</p><br/><p><em>F*ck! His plan wasn’t about the virus but her!</em></p><br/><p>She felt her vision darken. The last thing she saw was the opening of a portal and Mu Xuan running towards her maniacally.</p><br/><p>“Sisi!”</p></div>\n</div>"}