{"title": "Chapter 131 - The Loathsome Inheritor", "id": 131, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-131-the-loathsome-inheritor", "volume_title": "Volume 2", "body": "<h1>Chapter 131 - The Loathsome Inheritor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>As a fresh learner of the Galactic language and an ex-fake blooding, Yao Si wasn’t well versed about the Galaxy and was almost an illiterate. For an inheritor to only receive 80% of such memory…</p><br/><p>Yao Si felt her heart tremble. She shielded her eyes with a hand in pity.</p><br/><p>The other inheritors started off from nothing to gaining half a life worth of knowledge. But for Li Zheng, he started with all the knowledge, but ended with limited one… What a tragedy.</p><br/><p>In conclusion, the person which obtained her information would probably be the most pitiful inheritor out there!</p><br/><p>“There isn’t any precedence I can refer to, so I’m not sure how to deal with it…” Yao Qian appeared at a loss.</p><br/><p>The ‘new’ Li Zheng wasn’t able to communicate effectively without the translator, which was exactly how Yao Si had been after she had awakened. However, back then, Yao Si had His Majesty with her, so she was able to pick up the language fairly quickly. But Li Zheng was just an inheritor…</p><br/><p>Yao Qian shivered, not willing to continue the thought.</p><br/><p>“Send him over!” Yao Si instructed.</p><br/><p>“Ah! Ah?” Yao Qian stilled, his eyes going wide in disbelief.</p><br/><p>“Isn’t he my inheritor?” If she had caused it, she had to deal with it. “Even though I’m not too confident in my skills in Galactic language, I’m sure I’ll be able to help him out. Besides, Mu Xuan will be around to aid me as well!”</p><br/><p>“Hi-his Majesty?” Yao Qian was clearly taken aback. <em>Are you sure His Majesty will teach him and not strangle him? Does Your Highness not know how bloodlings feel toward their cubs’ inheritors?</em></p><br/><p>“Okay, it’s decided. Besides, I don’t trust… the others.”</p><br/><p>Li Zheng had indeed gone overboard. But no one else other than Yao Si and Mu Xuan knew about his invasion, so even Yao Qian was mostly in the dark.</p><br/><p>Now that Li Zheng had become a completely different person, they just wished for him to have a fresh start. If they buried the matter. It would be the best for both the bloodlings and Li Zheng.</p><br/><p>“As for his schooling, I’ll deal with it myself.” Yao Si was the committee president of the school, afterall, even if she didn’t do much.</p><br/><p>“Come have your meal.” Mu Xuan walked out of the kitchen and waved her over.</p><br/><p>Yao Si immediately sat down, since she had already started to feel hungry. With all the things that had happened, she had missed out on a few days’ worth of school and had been trying desperately to catch up.</p><br/><p><em>Eh, being a good student is hard indeed. </em></p><br/><p>In the mid of their meal, the doorbell rang.</p><br/><p>Just as Yao Si was about to stand up, Mu Xuan went to the door. Yao Si had an idea who it might be, so she followed behind with her bowl.</p><br/><p>As expected, Li Zheng stood outside with a radiant smile on his face.</p><br/><p>Maybe due to his inheritor background, he greeted them in order. “Hi dad, I’m here!” He then turned toward Mu Xuan to greet him solemnly. “Grandfather!”</p><br/><p>“…” Yao Si.</p><br/><p>With a loud thud, Mu Xuan smashed the door shut.</p><br/><p>–</p><br/><p>After exerting her entire life’s worth of brainpower, Yao Si in the end managed to gain Mu Xuan’s approval for Li Zheng to learn the Galactic language from her for a short while.</p><br/><p>But ever since he entered the house, the aggressive aura around Mu Xuan had intensified, and he glared at Li Zheng threateningly. Yao Si had assumed that Li Zheng’s second conversion would have resolved any ill feelings but… it seemed to have made the situation worse?</p><br/><p>Even the oblivious Li Zheng seemed to sense Mu Xuan’s displeasure. He struggled to reduce his presence, to minimize his 1.89 m height. As he rubbed the goosebumps on his arms, he lightly tapped Yao Si’s arm and asked in a low voice, “Dad, does grandfather hate me?”</p><br/><p>Yao Si face muscles twitched. ” He will hate you more if you continue to call him grandfather.” For a middle-aged to call someone grandfather… How could that feel all right! “Anyways, who taught you to address him like that?”</p><br/><p>“The old Chinese physician from the hospital!” He pointed in the direction of the research facility.</p><br/><p><em>Old Chinese physician…</em></p><br/><p>Yao Si was left at a loss for words. After some thought, she asked, “You mean Yao Qian?”</p><br/><p>“Yes!” Li Zheng nodded, turning to glance at Mu Xuan weakly only to receive a cold glare. With a shiver, he lowered his head and averted his gaze before saying,”All bloodlings call their mentors dad, so isn’t your mentor my grandfather?”</p><br/><p>“…”</p><br/><p><em>Alright, seems logical, nothing wrong here. </em> “But I’m not your mentor.”</p><br/><p>“Huh? No?” He stilled.</p><br/><p>“You’re an inheritor, not my cub, which means you don’t have a mentor…” Yao Si made sure to emphasize that point. “You should call me by my name instead, Yao Si.”</p><br/><p>“Oh, I see. That’s great!” Li Zheng wasn’t the least bit disappointed. He instead heaved a sigh of relief. ” Sis, you should have told me earlier! Addressing you as my dad seemed a little awkward, but I was afraid that you would be offended if I didn’t address you properly! Oh, Yao Si, that’s the name in my memory!”</p><br/><p>He broke into laughter, his entire being relaxing. He seemed to have transported back to the days when he sold duck blood curd. Out of habit, he even raised his arm to pat Yao Si’s shoulder.</p><br/><p>Before he could touch her though… he was stopped by Mu Xuan!</p><br/><p>With his sharp reflexes, he grabbed Li Zheng’s hand. With his eyes darkening, he looked almost like a reaper.</p><br/><p>“Ouch,ouch,ouch…” Li Zheng’s face twisted as he struggled to pull his hand back.</p><br/><p>“After you finished with transferring the information?” <em>Take your paws away from my cub! </em> Mu Xuan tossed his hand away with disgust before turning toward Yao Si who was on her optical computer.</p><br/><p>She was confused, but nodded. “I’m… done.”</p><br/><p>She had transferred Li Zheng the information that Mu Xuan had prepared for her. It consisted of the Galactic language with Chinese words to learn, and it was probably the only copy in the whole Galaxy. It was perfectly suitable for Li Zheng’s use.</p><br/><p>“You can leave now.” Mu Xuan tapped onto the room’s automatic control. A door opened, which was a clear sign for the other to get lost.</p><br/><p>“Bu-but I don’t have anywhere to go!” Li Zheng was full of confusion as turned to look pleadingly at Yao Si.</p><br/><p>“Mu Xuan…” she started. <em>He’s someone familiar, so you can’t just cast him into the streets. </em> “Can we—”</p><br/><p>“No!”</p><br/><p>“…” <em>I haven’t even finished asking!</em></p><br/><p>Mu Xuan frowned, then switched on his optical computer to send a few messages. “Someone will come pick him up.”</p><br/><p>Indeed, a person came after a short while. When they opened the door, Bai Yi stood there.</p><br/><p>“Your Highness, Your Majesty, you wanted me to get someone?” Bai Yi smiled enthusiastically. “Don’t worry, I will take good care of him.”</p><br/><p>Mu Xuan nodded and pushed the confused Li Zheng onto the aircraft.</p><br/><p>After half a minute, Li Zheng asked, “Hey.. bro, do bloodlings have something against inheritors?”</p><br/><p>“It depends on who is it, but you just have to get used to it.” Bai Yi patted his shoulders. “Oh right, who are you? Why did His Majesty emphasize that you’re an inheritor? Who converted you?”</p><br/><p>“Yao Si.”</p><br/><p>“What?” Bai Yi stumbled, almost falling off the aircraft. “Yao-Yao Si, Her Highness!”</p><br/><p>“Mmh, what’s wrong?”</p><br/><p>Bai Yi inhaled deeply before taking a closer look at him and exclaiming in disbelief, “You’re still alive?!”</p><br/><p>“…”</p></div>\n</div>"}