{"title": "Chapter 138 - Intergalactic Tour", "id": 138, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-138-intergalactic-tour", "volume_title": "Volume 2", "body": "<h1>Chapter 138 - Intergalactic Tour</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ever since their game accounts were frozen, they had thoroughly exposed themselves.</p><br/><p>Yao Si realized that Mu Xuan had certain intentions toward her. She had never had any real relatives and wasn’t sure she would have felt around them However, she was sure that they would never make her heart race, and she would never harbor any thoughts of kissing them or other… <em> cough… </em> not appropriate ideas.</p><br/><p>She readily accepted the changes in their relationship since… she liked him!</p><br/><p>Yet she would have never expected the troubled and awkward person to be Mu Xuan!</p><br/><p>“Mu Xuan, I—”</p><br/><p>“Mmh, eat your food!” Mu Xuan snatched her bowl and filled it back up with duck blood curd.</p><br/><p>Yao Si froze. <em>I haven’t even finished the previous serving? </em>It was the Nth time that he had diverted the topic that day. Ever since they left the game, he was left in this state, refusing to even look her in the eyes. He would look at the sky or the bowl of duck blood curd, but never at her. His ‘allergic reaction’ on the neck was also turning into a common occurrence.</p><br/><p>Was he embarrassed by… having a reaction?</p><br/><p>But wasn’t his adaption period too long? They have been out of the game for two days, and she had already gotten used to it, so why was he…</p><br/><p><em>Wait a minute! </em></p><br/><p>A strange thought emerged in her mind.</p><br/><p>“Mu Xuan, was that your first kiss?” she blurted out.</p><br/><p>A certain someone trembled, and the full bowl of duck blood curd spilled onto the table. The flush rushed up from his neck straight to his face, turning it a deep shade of red.</p><br/><p>“I-I have something to attend to; you can eat first.” He dropped the bowl of duck blood curd as though it was burning hot pancakes and bolted out of the room without even cleaning his hands. The speed and anxiety were like those of an escapee.</p><br/><p>“…”</p><br/><p>No way! If they ignored their first forced kiss, then this… was their first kiss!</p><br/><p>(⊙ o ⊙)</p><br/><p>Mu Xuan had been living as a bloodling for a few million years so how could he have preserved his first kiss? Did he not even have a partner for which he had ambiguous feelings?</p><br/><p>Why did it seem as though she had just hit the jackpot?</p><br/><p>His alarmed state in the last two days had been because he was panicking on the inside due to… lack of experience!</p><br/><p>Yao Si finally understood what the Elders meant by calling him a million year old single dog. Wasn’t he too pure?</p><br/><p>But… she could feel a budding excitement spread though her as she planned on how to tease him!</p><br/><p>If she wanted to do it, she couldn’t back out. <em>Lets go! </em>She turned and chased after him. “Mu Xuan, lets have a talk!” While shouting at him, she suddenly had a deja vu moment.</p><br/><p>O(∩_∩)O</p><br/><p>However, when she saw Mu Xuan’s awkward manner, she couldn’t continue. The next day, he seemed to have sorted himself out and was back to being solemn and formal, with occasional flushes, but he remained rooted and didn’t try to escape again.</p><br/><p>“What’s this?” Yao Si pointed toward a large stack of documents that Mu Xuan had sent her.</p><br/><p>“It has all sorts of travel information,” he explained as he tapped open the documents. “Aren’t you still unfamiliar with the Galaxy? You won’t be able to experience it if you just learn through the academy. It would be better if I brought around it so I booked flights to a few different places.”</p><br/><p>“You mean we are going to travel the Galaxy!” Yao Si’s eyes brightened. She had always wanted to do that, but restrained herself due to his strict parenting. Yet now he was the one who volunteered the idea! “But… isn’t there still a lot to do in the Red Planet? Can you really leave?” <em>Won’t the Elders go crazy? </em></p><br/><p>“Mmh.” He nodded nonchalantly. “They were fine back when I was in hibernation.” <em>They will do fine. </em></p><br/><p>“There is a hierarchy to everything.” Only through experience would his Sisi learn everything that she needed to know, and it couldn’t be taught by the academy alone. It was best to let her witness things first hand. Besides, she had been caught up in so such much trouble within the two years of her study that he was determined not to allow his cub to remain there. “You are more important.”</p><br/><p>Yao Si’s heart rose as she nodded enthusiastically, “Alright, when do we leave? I’ll need to pack.”</p><br/><p>“It’s not necessary. I have already packed everything you need into your optical computer’s storage.” He caressed her head, his solemn expression softening. “Lets head over to the pier. The first stop will be to the water region since it’s closest. You can read about it a little.”</p><br/><p>“Alright.” Yao Si took a quick glance at the information while appreciating how well prepared Mu Xuan was. “Is this considered our honeymoon?” They had went through the wedding ceremony after all.</p><br/><p>Mu Xuan who was about to open the door froze. After a moment, he bumped into the door with a thud before anxiously saying, “Si…si, stop playing around! It’s getting late, and the aircraft is about to leave.” Without a second glance, he pulled her out the door.</p><br/><p>“…” What did she just say? Was there a need to run at such a speed?</p><br/><p><em>Besides, you got the wrong person? Where are you bringing the house’s main control? </em></p><br/><p>(⊙_⊙)</p><br/><p>–</p><br/><p>“Where did His Majesty go? Why can’t we get a hold of him? Bai Yi, did you find him at his home?” someone asked in Elders Council two hours later.</p><br/><p>“There wasn’t anyone there, not even Her Highness.”</p><br/><p>“I found it! I just received a notification stating that they left the planet, but registered in many different planets so we can’t find their exact location at the moment.”</p><br/><p>“What!They left the planet?! How could His Majesty leave at such a crucial period when there is so much to be done? What should we do?”</p><br/><p>“Who knows what important matter His Majesty could be attending to that would involve Her Highness?”</p><br/><p>“…” All the elders.</p><br/><p>“…” Li Zheng and Bai Yi.</p><br/><p>The two were suddenly reminded of a notification in the game…</p><br/><p>In order to stay alive, they remained silent, feigning ignorance.</p><br/><p>╮(╯_╰)╭</p><br/><p>–</p><br/><p>Yao Si would have never expected Mu Xuan, the ultimate homebody, to leave on a holiday in such a carefree manner. He was right though in that it would be best for her to fill up the gaps in her knowledge through experience rather than just schooling.</p><br/><p>They were now heading over to the water region which was closest to the Red Planet. In the notes that Mu Xuan had prepared for her, both the aquatic folk and celestials had been around since before the Alliance era. They were both races that valued harmony, didn’t posses advanced technology, and were mainly people without ability.</p><br/><p>However, the mermen lived primarily in water. Even though they could move on land, it was difficult for them to venture up to shore. Due to that, they were people that rarely left their mother planet and were considered rather conservative.</p><br/><p>Yao Si stilled, remembering a scene from the fairy tale which spent most of its time underwater. “Are they mermaids?”</p></div>\n</div>"}