{"title": "Chapter 139 - The Merman's Seduction", "id": 139, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-139-the-mermans-seduction", "volume_title": "Volume 2", "body": "<h1>Chapter 139 - The Merman's Seduction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“A portion of their body is indeed similar to that of the fish from the ancient Blue Planet. ” Mu Xuan nodded before adding, “But a large part of their body is human-like.”</p><br/><p>“They really are mermaids!” Yao Si exclaimed.</p><br/><p>Different variations of mermaids came flooding into her mind. She would have never imagined such a race to be part of the Galaxy. Would they be as gorgeous as in the fairy tales? Would they be singing by the rocks every night?</p><br/><p>Instinctively, she had the urge to search their image online to compare with the image in her mind.</p><br/><p>The arrival announcement was broadcast throughout the aircraft.</p><br/><p>“We’re here!” Mu Xuan caressed her head. ” There’ll be a native crew working at the pier, so you can head down and take a look if you’re really curious about their appearance.”</p><br/><p><em>Yes! </em> The real experience would definitely be better than anything seen on the optical computer. Yao Si immediately switched it off and followed Mu Xuan out of the aircraft.</p><br/><p>The minute they alighted, they were welcomed by the sight of the azure ocean and a faint salty breeze that rushed into their nostrils. As expected for aquatic people, water was everywhere.</p><br/><p>Yao Si looked around, trying to locate those legendarily beautiful mermaids. However, the pier was overcrowded with people from other races.</p><br/><p>It was only when they reached the entrance to the pier that Mu Xuan tugged at her hand. “Those are the mermen of the aquatic people.”</p><br/><p>Yao Si’s heart clenched she turned in excitement, but when she finally caught sight of the legendary mermaids…</p><br/><p>(⊙_⊙)</p><br/><p><em>What the f*ck?</em></p><br/><p>*Glass shatters*</p><br/><p>She could hear millions of young hearts breaking.</p><br/><p><em>F*CK! </em>No one had warned her that mermaids could also be fish on the top half and human at the lower half!</p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p>How could the real mermaids look like this? <em>I want my fairy tale! </em></p><br/><p>“Please show your identification!” One merman pointed toward a sensor as his two soulless fish eyes stared at them.</p><br/><p>Mu Xuan placed his optical computer on the sensor and both their identifications showed up.</p><br/><p>“Welcome to the aquatic people’s mother planet!” The merman nodded, allowing them to pass. His expression didn’t change once throughout it all.</p><br/><p>“…” Yao Si</p><br/><p>Rather than feeling insulted, she just wanted to cry!</p><br/><p>(╥╯^╰╥)</p><br/><p>“Wait for me here,” Mu Xuan instructed.</p><br/><p>“Ah?” Yao Si stilled, still trying to get over the initial shock.</p><br/><p>“The aquatic people live underwater, so it would be inconvenient to be without a protective ball against water.” Mu Xuan pointed toward the vast ocean. “Wait here while I get the balls.”</p><br/><p>“Oh, alright.” Yao Si nodded. When she turned around, she was met with a long queue in front of the ‘Service Counter’. It was filled with people from all sorts of races, each holding onto a blue bead.</p><br/><p>Yao Si sat down in the resting area as she tried to piece back her shattered heart—fairy tales were indeed a lie.</p><br/><p>Pui…</p><br/><p>She turned instinctively when a chill hit her back. Behind her, a little fish head had appeared out of nowhere and was staring straight at her.</p><br/><p>It was a merman, one that was visibly smaller than the ones at the pier. He wasn’t clothed in a tuxedo either and only wore shorts.</p><br/><p>It was… a child of the aquatic people.</p><br/><p>Pui!</p><br/><p>The little merman spat at her. A bubble formed, trembling slightly in the air before landing onto her face lightly. It have her a fleeting sensation before it burst.</p><br/><p>She then realized what had hit her before.</p><br/><p>Yao Si smiled. Children were all likable despite their state, even if they were half fish and half human. The youth was visibly better looking than the person she’d faced before. A layer of golden scales circled the top of his head, “Hi, little boy!”</p><br/><p>She raised her hands in greeting.</p><br/><p>The tiny merman stilled, not expecting her response. His eyes widened as he trembled in the water. A thought seemed to have struck him for he dived deep underwater and disappeared from her sight.</p><br/><p>Was he… frightened away?</p><br/><p>He seemed rather vigilant, similar to the children of other races. Yao Si didn’t mind as she continued to wait patiently for Mu Xuan.</p><br/><p>After ten minutes, a trumpet sounded beside her before something glided down her back.</p><br/><p>She lowered her head. It was a colourful shell, its interior shiny and smooth as though it had been polished.</p><br/><p>When she looked toward the water, the little merman was back. He glanced at her in anticipation before shifting his gaze to the shell.</p><br/><p>“Is it for me?” She stilled. Were the little children from other races all so friendly?</p><br/><p>The little merman kicked his feet in the water, producing mini splashes as he nodded his head violently, pointing toward the shell.</p><br/><p>“It’s alright!” Yao Si picked up the shell, but passed it back to him. She couldn’t resist patting his head in encouragement. “Thank you, but you should keep such a beautiful shell. Good boy!”</p><br/><p>He stilled, turning his head to feel her palm, the golden scales on his neck turning red. He couldn’t seem to understand the reason behind her refusal and stuffed the shell back into her palm, giving it a small push.</p><br/><p>“I really don’t need it.” <em>What a nice child. </em></p><br/><p>He took back the shell, his head lowered in disappointment before he hid it under the surface of the water.</p><br/><p>“…”</p><br/><p>Was he… angry?</p><br/><p>It should be expected of a child. But how could an adult accept a gift from a child? That seem a little shameless!</p><br/><p>Yao Si turned around to her original position, convinced that the child would not be back, but in less than five minutes, there was a sound again, and a black bead rolling over. Was it… a pearl?</p><br/><p>When Yao Si turned, the little boy was once again at his spot, staring at her in anticipation.</p><br/><p>“Eh…” Was gifting strangers a custom of the aquatic people?</p><br/><p>“Little boy, auntie really doesn’t need these.” She sighed.</p><br/><p>This time, before she could return the pearl, he dived back into the water.</p><br/><p>In less than a minute, he emerged once more with a doll made from seaweed. The doll had a fish’s head and human’s body, just like the little merman.</p><br/><p>It wasn’t over…</p><br/><p>○|￣|_</p><br/><p>The little boy was persistent. As long as Yao Si wasn’t willing to accept his gift, he would dive back and get something else. In a short while, her surroundings were filled with an assortment of pearls, toys, and even shells.</p><br/><p>“Alright, alright…” before the little merman dived back into the water, she hurriedly picked up the pearl. “I’ll take this. Thank you little boy.”</p><br/><p>The little merman stilled momentarily before jumping in joy, splashing around in the water.</p><br/><p>“That’s great, that’s great!” the silent little boy exclaimed in a childlike voice.</p><br/><p>He wasn’t a mute! Yao Si broke into a smile.</p><br/><p>The littler merman spat a bubble toward her abruptly, but it wasn’t the tiny bubble from before which he had used to attract her attention. This bubble was massive and covered her completely.</p><br/><p>“You promised.” He reached over toward her abruptly.” Let’s register our marriage!”</p><br/><p>“What?!”</p><br/><p>(⊙ o ⊙)</p><br/><p>Before Yao Si could react, the little merman tugged onto her forcefully, pulling both her and the bubble into the water.</p><br/><p>F*ck, were those her betrothal gifts?!</p></div>\n</div>"}