{"title": "Chapter 155 - What's Your Family Name?", "id": 155, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-155-whats-your-family-name", "volume_title": "Volume 2", "body": "<h1>Chapter 155 - What's Your Family Name?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>From afar, Yao Si could vaguely spot a shadow emerging into the skies. It kept increasing in size, occupying up to half the sky in less than a second. Only when the foliage started to peak through did she manage to make out the image—it was a tree, a gigantic one.</p><br/><p>Besides, it seemed to be growing in all directions, even the grounds started to shake from it’s growth.</p><br/><p>Yao Si inhaled deeply. “Run!” She grabbed onto Lian Yu and dashed away frantically.</p><br/><p>Maybe due to the appearance of the tree, they found a way out of the originally closed off road. The ancient-looking yard had turned into a barren land, with nothing but the tree’s roots.</p><br/><p>“What exactly happened? What’s wrong with the tree?” Yao Si asked through her pants.</p><br/><p>“It’s the heavenly sylvian king tree!” Lian Yu turned back toward the tree that was still growing rapidly. “I had placed the heart of the tree in the Rainbow Pond to release the restriction, but I never expected that the tree would grow so suddenly after.”</p><br/><p>“What king tree?” Yao Si stilled. Wasn’t the heart of the tree in her aircraft? When did it become the king tree?</p><br/><p>“The king tree is the king of the trees, and it grows into the heavenly sylvian king’s tree.” Lian Yu was a face of worry as she pointed to the tree. “That… was originally my brother.”</p><br/><p>“What? <em>” F*ck, aren’t you an aves? How did you get a brother from the heavenly sylvian race? </em> “What’s your… mother’s family name?”</p><br/><p>“It’s complicated.” The queen grew increasingly more frantic. “My brother is the twin son of heavenly sylvian king, but when he was born, he was just a seed that hadn’t awakened. Even after many years, he could only grow into the flower of the heavenly tree. That’s why I never expected… him to grow so rapidly because of the Rainbow Pond.”</p><br/><p>Lian Yu’s resistance to the fog was due to the heavenly sylvian genes within her.</p><br/><p>“What do we do now?” They couldn’t just let it grow on forever?</p><br/><p>“Sisi, don’t worry.” The queen patted her own chest, her face full of confidence. “Even though he hasn’t awakened, he is still my brother. Even though he wasn’t able to recognize me previously, he won’t hurt me as soon as I return to my original form.”</p><br/><p>She took a firm step forward before starting to enlarge, the massive wings emerging from her back. In a blink of an eye, she was back to how she looked the first time Yao Si had laid her eyes on her. Her massive wings flapped, sweeping gushes of torrential winds around the barren Rainbow Pond. Gradually, the tree that had been growing maniacally stopped.</p><br/><p>Lian Yu took the opportunity to shout at him, “Xi Mu, I’m your sister. Be good…”</p><br/><p>Piak! With a loud sound, the tree directed a huge branch over toward them. With a tremble, Lian Yu shrank back down and was sent flying.</p><br/><p>“…” Yao Si.</p><br/><p>-_-|||</p><br/><p><em>F*ck! Weren’t you confident that it would be fine? </em></p><br/><p>Before Yao Si could process the situation, another branch came flying over towards Lian Yu who had shrank down to normal size.</p><br/><p><em>F*ck, f*ck, f*ck!</em></p><br/><p>Yao Si’s heart sank. She dashed forward to embrace Lian Yu and bring her out of harm’s way.</p><br/><p>With a loud eruption, a hole about a metre deep formed at the spot where Lian Yu had been. Yao Si felt her blood go cold. She bolted while dragging a certain queen who had been knocked out senseless toward shelter.</p><br/><p>Only when they were finally out of the tree’s attack range did they heave a sigh of relief, cold sweat dripping out their backs uncontrollably. If they had been even a second slower, they would have definitely become minced meat.</p><br/><p>“Sisi…” Lian Yu glanced at her in a daze, either too startled or frightened of the situation.</p><br/><p>Yao Si took a deep breath as fear still lingered in her heart. “Are you biological siblings?” <em>The tree doesn’t seem to treat you as a sister. </em></p><br/><p>Lian Yu remained motionless, but something flashed past her eyes. Sniffing, she muttered pitifully, “He-he used to be obedient, really!”</p><br/><p>“Enough, enough.” Yao Si pointed toward the tree that had grown another couple meters. “Your idea isn’t effective; he can’t recognize your right now. We can only head in secretly to the heart of the tree. Now that the entire Rainbow Pond is covered b it, is there any other route we can use?”</p><br/><p>“There is…” The queen hesitated before nodding. “But it will be dangerous.”</p><br/><p>“Let’s not bother too much about that and head over first.” If the queen’s brother was going to grow as big as the heavenly sylvian king, the entire planet was going to end up in ruins, and Yao Si had to think about Mu Xuan who was still trapped in the fog…</p><br/><p>She didn’t dare to go down that train of thought and followed Lian Yu to the back of the house. Probably due to the tree’s massive size, they were no longer chased by the branches.</p><br/><p>Lian Yu brought them toward a huge green gate that was the height of at least two people and whose top was filled with green roots. They were unlike those from Lian Yu’s brother that was newly formed with the scent of soil, but were deeply rooted and seemed to have been here for many years.</p><br/><p>“This is part of the restricted region, and the Rainbow Pond is inside there. But… this is the heavenly sylvian king’s root system, and it will require a strong blazing weapon to break through. It is also immune to all wood abilities.” She seemed troubled. “We won’t be able to enter even with my wood ability.”</p><br/><p>“You have a wood ability?” Yao Si asked.</p><br/><p>“Of course! Besides that of aves, there is heavenly sylvian blood running through me as well.” She lifted her hands, a seedling starting to form on her palms. “So we need to find weapons—”</p><br/><p>“There isn’t a need!” Yao Si interrupted her. With her hands directed at the door, she sent out the burst of energy that was surging within her. A torrential flame appeared, morphing into a fire dragon that burnt the root system into a pile of ashes.</p><br/><p>Lian Yu stared at her with wide eyes, glancing at the pile of ashes that covered the ground. Her whole being was in shock. “You-you have a fire ability… Aren’t you…”</p><br/><p><em>Hey, hey, hey! What’s with your expression?</em></p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p><em>My little contradictory ability can be quite reliable, okay! </em></p><br/><p>“Lets go in first!” Yao Si stepped through the pile of ashes, entering. There was a path inside that led underground. Probably due to her fire ability, the surroundings were all black and dark.</p><br/><p>Surprisingly, the interior wasn’t dark and was instead brighter the farther they ventured. There was even a faint blue glow straight ahead.</p><br/><p>“The surrounding restriction seems to have lost effect…” Lian Yu caressed the black stone wall before pointing ahead. “The Rainbow Pond is right here.”</p><br/><p>Yao Si hurried forward, to where an endless blue stream came into sight. Even though there wasn’t any barrier between the pathway and the stream, the water didn’t pour over toward them and had simply risen upwards instead.</p></div>\n</div>"}