{"title": "Chapter 179 - Hide and Seek", "id": 179, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-179-hide-and-seek", "volume_title": "Volume 2", "body": "<h1>Chapter 179 - Hide and Seek</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“The royal tree must have gone invisible!” Before Yao Si could ask, the lighting sylvani king had already pointed ahead while explaining. “I can feel its presence there, and invisibility is a the royal tree’s special ability. You won’t be able to find it unless it is attacked…”</p><br/><p>Before he could finish his sentence, Mu Xuan had already turned and slammed the attack button on the control table. Almost instantly, flashes of light lit up on the screen, and with a thundering roar, the night skies exploded with a blinding spark.</p><br/><p>Soon, a massive lotus floated up as predicted; Lian Yu was really there!</p><br/><p>[Ding, enemy communicating!]</p><br/><p>A warning popped up, and the next moment, an enraged Lian Yu appeared on the screen. Beside her, Lin Ergou held onto her face. He didn’t seem as frustrated as expected; instead… he seemed unusually calm. Was that an illusion? Why did he look like he was blushing?</p><br/><p>“Xiao Yu…” The lighting sylvani king brightened up, prepared to advise her, but Lian Yu didn’t give him the time.</p><br/><p>“F*ck! It’s really this bastard!” Lian Yu glared at Mu Xuan vehemently, prepared to take down everyone that dared to stop her. “You’re pretty fast, but it’s too late, Sisi has already agreed. Don’t you dare try to separate us; we are two willing parties! Even if the Galaxy perishes, we will still be together! Heh!”</p><br/><p>Without waiting for a reply, she switched off the communication. The entire time, she never once glanced at the lighting sylvani king.</p><br/><p>“…” Yao Si.</p><br/><p>“…” Mu Xuan.</p><br/><p>“…” Heavenly sylvani king.</p><br/><p><em>B*tch! </em> Yao Si could vaguely see the throbbing veins on Mu Xuan’s temples.</p><br/><p>“Wait a minute, Mu Xuan!” <em>There are other planets here! </em></p><br/><p>It was too late though. With a wave of his hand, a white glow sped straight for the Flower of the Heavenly Tree. Any second now and it would be severed into half.</p><br/><p>Suddenly, a protective barrier covered it. With a loud thud, it protected the ship from Mu Xuan’s attack. When the massive force crashed onto the barrier, it was sent a few meters back.</p><br/><p>Yao Si wobbled slightly, almost falling over, but Mu Xuan was fortunately there to stabilize her. When she finally gained her footing, the Flower of the Heavenly Tree was inching backward into a space portal behind it.</p><br/><p>“Mu Xuan!” Yao Si exclaimed, pointing toward the screen anxiously. But it was too late. The Flower of the Heavenly Tree was gone.</p><br/><p>“It can’t be!” The heavenly sylvani king was full of disbelief as he checked the data. “Even though Xiao Yu’s brother is a jade tree, it can’t even be considered a seedling. Even if it’s a jade tree, there’s no way it would be able to summon a space portal so quickly.”</p><br/><p>“Check their new location!” Mu Xuan commanded.</p><br/><p>The heavenly sylvani king started the investigation, and after a short while, he said, “They’re in Galaxy G, area 67. They’ve actually passed the nearest three galaxies in such a short while.”</p><br/><p>Mu Xuan opened a portal immediately, but they could not catch their target. Lian Yu seemed to be playing hide and seek with them as the moment they reached the ship’s location, she would immediately send it elsewhere. Just like that, they traveled through over ten different galaxies while catching only a quick glimpse of their target before the ship would disappear.</p><br/><p>Yao Si’s frustration grew with the continued chase until even her blood began to boil.</p><br/><p>After three hours…</p><br/><p>“It’s… gone…” the heavenly sylvani king remarked with a blank expression.</p><br/><p>“What do you mean gone?”</p><br/><p>“The Flower of the Heavenly Tree can’t be found anywhere! They disappeared from the Galaxy!”</p><br/><p><em>F*ck!</em></p><br/><p>The frustration that had accumulated throughout the day in Yao Si finally exploded!</p><br/><p>“F*ck, I give up!”</p><br/><p>“Sisi,” Mu Xuan said in a comforting voice. “Persevere a bit more and we’ll find them.”</p><br/><p>“We have been chasing for the entire day. I don’t care, I don’t want to wait anymore.”</p><br/><p>“Sisi, be obedient!”</p><br/><p>“F*ck obedience!” Yao Si could feel her insides burning with rage, and she exploded. “You said that four hours ago! Keep it in, keep it in, keep it in! What do you take me for?! If you continue to stop me, I’m going to hate you! Let me repeat once more…” She inhaled deeply, gritted her teeth, and made sure to articulate each word very clearly. “I want to visit the washroom!”</p><br/><p>F*CK! She had held it in the entire day, ever since they were on the space station. Mu Xuan and the others had been using all sorts of ways to stop her from visiting the washroom, insisting that she had to hold it in till she returned to her own body.</p><br/><p>Wasn’t the heavenly sylvani king the root to capturing them? F*ck the galactic safety, f*ck galactic peace, f*ck the peace between the two races!</p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p>Even a galactic destruction couldn’t stop someone from a nature’s call!</p><br/><p>“I need the washroom, now, this instant!”</p><br/><p>“Si…”</p><br/><p>“Shut up! If you dare to object, I’ll severe all ties with you this instant!”</p><br/><p>Mu Xuan stilled, his face sinking. After half a minute, he seemed to have come to a conclusion. In a serious tone, he declared, “I’ll accompany you!”</p><br/><p>“Get lost!”</p><br/><p>“…”</p><br/><p>“…” A stunned crowd and the heavenly sylvani king.</p><br/><p>All of them had a pressing question: what did chasing after the Flower of the Heavenly Tree have to do with going to the washroom? No one, however, had the courage to ask. It seemed far too scary.</p><br/><p>–</p><br/><p>The heavenly sylvani king insisted that the Flower of the Heavenly Tree has disappeared from the Galaxy since he couldn’t sense its presence. Initially, he had assumed it was because the royal tree’s data had been changed, so the lighting sylvani king would be unable to find it, but Mu Xuan rejected that hypothesis since the Flower of the Heavenly Tree wasn’t even a real ship. The data couldn’t just be altered so easily. Besides, due its connection to the lighting sylvani and the bloodling’s bloodline suppression, it was impossible for the lighting sylvani king to not have contact of it.</p><br/><p>Since the heavenly sylvani king said that he couldn’t sense the Flower of the Heavenly Tree, it just meant that it really wasn’t in the Galaxy anymore. If it was true, it meant…</p><br/><p>“They are in the abyss,” Yao Si blurted out. As expected, during such a critical timing, her thoughts were much clearer.</p><br/><p>Mu Xuan nodded, the thought having occurred to him as well. He opened a space portal, “We’re heading to the Blue Planet!”</p><br/><p>After passing through the portal, a familiar looking blue planet came into sight.</p><br/><p>Lin Long hadn’t been lying previously; he was almost done with the reconstruction of the Blue Planet. It was back to the familiar sight Yao Si knew well. But there was still a small portion missing at the bottom right corner with several tiny fragments floating at the top. The thing was about 95% completed.</p><br/><p>“Flower of the Heavenly Tree!” The heavenly sylvani king caught sight of the gigantic lotus straight away.</p><br/><p>Unlike before, it wasn’t invisible and didn’t require to be attacked to show up. This time, it floated openly, not the least bit afraid of being discovered.</p><br/><p>“Let’s go in!” Mu Xuan pulled at Yao Si’s hand, and in a flash, they entered the Flower of the Heavenly Tree.</p><br/><p>It was an endless sea of flowers, but this time, there wasn’t a stunning beauty in the middle.</p><br/><p>“Where are they?!”</p><br/><p>After scouring the place, they realized that the Flower of the Heavenly Tree was empty, both Lin Long and Lian Yu weren’t in sight.</p><br/><p>Where had they gone?</p></div>\n</div>"}