{"title": "Chapter 178 - Your Family Will Bring Trouble", "id": 178, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-178-your-family-will-bring-trouble", "volume_title": "Volume 2", "body": "<h1>Chapter 178 - Your Family Will Bring Trouble</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After much difficulty, they had found a method to swap the bodies back, but the moment they were about to do it, Yao Si’s body was kidnapped. Lian Yu’s actions infuriated her immensely.</p><br/><p>“This-this was?” Bai Yi asked in confusion. He hurriedly switched open his optical computer to search for traces of the ship that had disappeared, but soon after, he looked back at them. “Your Highness, I can’t find… That ship seems to have a unique movement system, and our system isn’t able to locate it. What should we do?”</p><br/><p>The corners of Yao Si’s lips twitched as frustration at at her. The Flower of the Heavenly Tree wasn’t a ship at all, but Lian Yu’s younger brother, a royal member of the lighting sylvani. Because of that, it couldn’t be traced.</p><br/><p>“She can’t hide forever!” Mu Xuan glanced over at Yao Si before turning to Bai Yi. “Instruct all the bloodlings in the Galaxy to look for signs of the Flower of the Heavenly Tree.” He reached out to caress his cub’s head. “She couldn’t have gone far, so we’ll definitely be able to find her.”</p><br/><p>“Mmh.” Yao Si suppressed the frustration within her. It would be just a slight hindrance, nothing more. Bai Yi nodded and opened the messenger on his optical computer.</p><br/><p>“I guess we can only wait. Bai Yi, inform me immediately when there is news, i’ll head to the washroom first!” Yao Si said.</p><br/><p>“No!”</p><br/><p>“No!”</p><br/><p>“No!”</p><br/><p>The three men rejected in unison!</p><br/><p>“…” <em>F*ck, what do those gazes even mean? I really need to pee; it isn’t an excuse to pull open my pants!</em></p><br/><p>–</p><br/><p>The lighting sylvani king was experiencing a bad year with an endless stream of misfortunes. Nothing seemed to be progressing smoothly, which prompted his logical mind into believing the ‘destiny’ that celestials believe in. He had even consulted a senior celestial to read his fortune.</p><br/><p>It had showed poor family affinity and for him to beware of those close to him, specifically those that are related by blood. The only solution was for him to follow a solitary path and to not meddle in the affairs of the younger generation.</p><br/><p>He had exploded in fury then—the celestials were indeed all liars. The royal tree was the reproduction core of the entire lighting sylvani race, so in theory, the entire race was considered his relatives.</p><br/><p>By advising him to avoid his relatives, wasn’t that asking the impossible?</p><br/><p>He concluded that the celestial had to have heard about the incident on the Red Planet a few years ago when he had gone to seek an explanation about the royal seed. After that, his planet was split into half.</p><br/><p>The celestial hadn’t been the least bit sensitive, bringing up a past that the entire Galaxy knew about. Besides, he had already called a truce with the Red Planet, got his planet mended, and even his royal seed had sprouted into a seedling, so what else could happen?</p><br/><p>The lighting sylvani king had a strong intuition that the celestials were just a bunch of conmen who sprouted rubbish just to earn money. He expressed his utter disbelief for such superstition, but the celestial had stated that he would understand one day.</p><br/><p>The lightning sylvani king hadn’t expected for that day to arrive so quickly.</p><br/><p>On that day, his left leaf had trembled continuously the entire afternoon. He interpreted it as a hungry royal seed and proceeded to water the little seedling. However, as he was doing it, a white ray of light flashed past, slicing a leaf off the royal seed.</p><br/><p>The lighting sylvani king was enraged, but just as he was about to seek out the culprit, the planet he took much pains to piece together was split into half once again.</p><br/><p><em>Again?! Who was it this time?</em></p><br/><p>Ｏ(≧≦)Ｏ</p><br/><p>Before he could react, five words formed in the sky: Hey you, come over for a moment.</p><br/><p>The culprit came into view, and coincidentally, it was the same perpetrator as before. The lightning sylvani king’s anger that was about to build deflated instantly.</p><br/><p>“Bloo-bloodling king!” He wanted to weep as a cold shiver ran down his back. Were the bloodlings starting to enjoy the background music of planets being sliced apart?</p><br/><p>He struggled to recall what wrong he had committed this time. What could have caused the bloodling king to act personally?</p><br/><p>While he was considering it, the other person blurted out something unexpected.</p><br/><p>“Where’s the Aves queen’s Flower of the Heavenly Tree?”</p><br/><p><em>What? Aves?</em></p><br/><p>“Xiao Yu?” He stilled and raised his head to glance at Mu Xuan and the unfamiliar man beside him. An inauspicious feeling filled him, and he decided to test the waters. “Is there a reason… you’re looking for Xiao Yu?”</p><br/><p>Mu Xuan’s face darkened, and the unfamiliar man’s face seemed to have fallen as well. “He took my cub’s… body.”</p><br/><p><em>What? What does cub’s body mean?</em></p><br/><p>The lighting sylvani king was utterly confused. But before he could ask anything, the unfamiliar man gave him an explanation. “Lian Yu appeared in the Flower of the Heavenly Tree through a space portal and left after securing the body. We tried tracing her movements, but could not do it.. As the lighting sylvani king, you should know best about the royal tree, hence I would like for you to help us locate the royal tree.”</p><br/><p>The lighting sylvani king shook, finally understanding what was happening. Xiao Yu had actually dared to snatch a bloodling’s cub! And on that venture, she had even brought along her little brother!</p><br/><p>His niece has stirred a lot of trouble!</p><br/><p>But why were the lighting sylvani paying for her misdeeds? Who did they offend? Besides, wasn’t Xiao Yu’s brother still recuperating from his injuries? When did he recover enough to help his sister snatch a partner?!</p><br/><p>The lighting sylvani king started to curse internally!</p><br/><p>“This… even though the royal tree is part of the lighting sylvani race, it isn’t considered part of my people. The exact location…” His expression grew perplexed. Everything could be negotiated, but this was indeed a question he didn’t have an answer to.</p><br/><p>Mu Xuan’s face darkened, and he spat out each of his next words. “You can’t find it?”</p><br/><p>An eerie chill was emitted from his body…</p><br/><p>The lighting sylvani king shivered from fear while nodding aggressively. “I can find it! The lighting sylvani are all connected, and we’re even talking about the king tree. As long as we’re in the same Galaxy, I’ll be able—”</p><br/><p>“Find it!” Mu Xuan commanded, his gaze never leaving him. Chilly air went off him in waves.</p><br/><p>The lighting sylvani king shivered, cold sweat pouring out, and he didn’t dare to probe anymore. He switched open the optical computer and entered the data for the Flower of the Heavenly Tree, then started to scour the entire Galaxy for traces of similar data.</p><br/><p>After ten minutes, the lighting sylvani king lit up with joy. “I found it!” He opened a galactic map. “Galaxy N’s area 57 has signs of the Flower of the Heavenly Tree, but this galaxy is very far. Even if you use space leaping, it’ll take a few days—”</p><br/><p>“There’s no need for that!” Mu Xuan interrupted, his ability springing to action right away. In less than a minute, a gigantic portal opened up in front of the ship. It flew right in, and the next moment, they arrived in the galactic the lighting sylvani king had mentioned.</p><br/><p>Yao Si frowned, most worried about Lian Yu. Lin Long was after all an ancestor, and he didn’t have a particularly nice personality. She was worried that he might be infuriated after being kidnapped so abruptly and under such a peculiar situation.</p><br/><p>“Over here!” Once they left the portal, the lighting sylvani king could immediately detect the Flower of the Heavenly Tree’s location. He thus pointed toward a nearby area in Galaxy N .</p><br/><p>Mu Xuan sent the entire ship toward the destination without any hesitation. However, there were only a few planets in sight, and no Flower of the Heavenly Tree.</p></div>\n</div>"}