{"title": "Chapter 183 - Let’s Have a Talk", "id": 183, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-183-let%E2%80%99s-have-a-talk", "volume_title": "Volume 2", "body": "<h1>Chapter 183 - Let’s Have a Talk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Even after multiple failed kidnapping attempts, Lian Yu still didn’t give up and instead got even more aggressive, using all sorts of methods to enter Yao Si’s bedroom. Some of them included the dining table, galactic web, the toilet…</p><br/><p>It would always catch Yao Si off guard. With such a persistent pursuer, both her and Mu Xuan were starting to feel mentally lethargic. The one hit the worst would be Lin Long though. He was the one who did not voice any objection, but had instead supported Lian Yu throughout. Even if he was bashed up by Mu Xuan every single time, he remained conscientious without any complaints.</p><br/><p>Yao Si had only heard about people being cuckolded by others, not about people getting themselves cuckolded!</p><br/><p>Was he dumb?!</p><br/><p>However, Lin Long had a logical response. “Once you have found someone you spent such a long time trying to find, would you bear to reject their requests? Would you? I definitely have to indulge her in all ways!”</p><br/><p>He seemed to make sense, which left Yao Si at a loss for words. She started to recall her interactions with Mu Xuan. Even though he hadn’t pampered her to the same extreme as Lin Long his contractor, he never rejected her anything she desired, even if it had been life-threatening.</p><br/><p>Lin Long’s problem could only be resolved from the root.</p><br/><p>“Dearest, do you have thoughts of marrying me today?” Lian Yu smiled radiantly as she left the space portal.</p><br/><p>“No.”</p><br/><p>“It’s alright, I’ll ask again next time. Why don’t we spend five minutes on a date? Maybe that would change your mind.”</p><br/><p>“… Okay.”</p><br/><p>“Lin Long can still last for awhile, so how about five— What! What?” Lian Yu’s eyes went wide, disbelief clouding her face. “Sisi, you… you agreed!”</p><br/><p>“I have something to tell you. If you have time, wait for me in the living room. I’ll be there shortly.”</p><br/><p>“For you, I’ll always have time,” she exclaimed joyously. “Sisi, you can tell me everything. I’ll listen to anything you say…”</p><br/><p>“That…” Yao Si could feel a vein bulging on her forehead, on the verge of erupting. “Could you let me use the washroom in f*cking peace!”</p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p><em>Can’t you see that I’m still using the toilet?</em></p><br/><p>Why did she always have such unconventional entrances? She was either climbing through the window, drilling through a wall, or crawling in from underground. That wasn’t a way to get girls, but a terrifying attack…</p><br/><p>If you weren’t a woman, I would definitely beat you up!</p><br/><p>“But…” Lian Yu hesitated, taking several glances at the toilet door.</p><br/><p>“Hurry up and get out! Don’t worry, I’ve spoken to Mu Xuan, and he won’t be back so soon.” <em>That is if you don’t drag me away forcefully. </em></p><br/><p>“Alright, I’ll be waiting.” Reassured, the queen opened the door to head out. At the last moment though, she turned back bashfully and gave her a coquettish glance.</p><br/><p>“…” Yao Si suddenly felt constipated.</p><br/><p>After settling her personal issues with much difficulty, she found a certain someone sitting on the sofa, waiting for her return obediently. In front of her was a screen, and on closer inspection, Yao Si found a marriage registration and another screen with articles like top ten things to do when dating, guide to a honeymoon trip, adoption guide for aves, interactions of old couples, etc.</p><br/><p>The corners of Yao Si’s lips twitched uncontrollably. Should she praise the queen for thinking so far?</p><br/><p>-_-|||</p><br/><p>“Sisi…” Lian Yu’s eyes gleamed when she reappeared. “Hurry over and help me choose! There are so many guides on the web that I’m spoilt with choice. If we start now, we’ll be blissful in the future.”</p><br/><p>She pulled onto Yao Si’s hand and inched over. Yao Si felt a weight hanging against her, two lumps pressed against her non-existential chest.</p><br/><p>A wave of emotion surging within her. F*ck, was Lian Yu teasing her lack of substance?</p><br/><p>“Lian Yu.” She pushed the other aside, then sucking in a deep breath before channeling her most serious expression. “We need to talk.”</p><br/><p>“Mmh, I’m all ears.”</p><br/><p>“Are you sure the one you like… is really me?”</p><br/><p>“Of course!” She nodded without a second’s thought.</p><br/><p>“What do you like about me?”</p><br/><p>“Why do you need a reason? I just like you,” she said, giving a political response. “Love needs no reasons.”</p><br/><p>“Who says there isn’t a reason for love?” Yao Si retorted before enunciating her next words carefully. “I like Mu Xuan because he is handsome, strong, and most importantly, his care for me is genuine. He pampers me, protects me, and provides me with something reliable in this foreign world.</p><br/><p>“I have been an orphan since young, so I don’t have an understanding of family, but now my home is wherever Mu Xuan is. I finally have a place I can return to. That is something he has given to me, and that’s why I like him. I’m the only one in his heart, and I would like for him to be the only one in mine. Do you understand?”</p><br/><p>“But-but I like you too.” Lian Yu rushed to explain herself. “I want to be with you and stay by your side. I feel happy when I see you and feel sad when I leave you. If that isn’t liking someone, then what is it?”</p><br/><p>“Lian Yu, I have explained this before, but my ability is the reason behind your feelings for me. I’m sorry but I don’t have a solution to reverse this, but if you were to think it through, other than the feelings forced upon you by the ability, are you really that bent on being with me? In the past few months, we have met quite frequently, but do you know me? Let me ask a simple question, do you even know what I like to eat?”</p><br/><p>“I-I.” She was stumped for words.</p><br/><p>“Look, you never even thought about trying to know me!”</p><br/><p>“No, this question doesn’t count since we haven’t even eaten together before!” Lian Yu retorted. “Why don’t you tell me? I’ll remember it once we get married I’ll-I’ll know you better with time, I definitely will!”</p><br/><p>“I like spicy food and this is something the entire bloodling race knows.” Yao Si sighed. “Lian Yu, your understanding of me is worse than of any bloodling out there. It really isn’t as you persistently assume, that I’m the only one for you.”</p><br/><p>“That’s not true.” She shook her head firmly. “Your ability aside, Sisi, you are such a nice person and have helped me out in the Heavenly Planet. So how could I not fall for you?”</p><br/><p>“Lin Long has helped you before!” Yao Si stated. “And not just once! Besides, he has been helping you to this very moment. So do you like him too?”</p><br/><p>“That… he did it willingly!” Her eyes flashed as she shunned the question aside. “I didn’t force him.”</p><br/><p>“Are you sure you don’t like Lin Long at all?”</p><br/><p>“Of course! Who would like such a burly man?!”</p><br/><p>“…” <em>Back then, who was the one who cheered when I had become a man? </em></p><br/><p>“He is hateful, always sticking to me to the point that I can’t seem to chase him away. Moreover, he giggles like a retard every day while hovering around me. Every time I instruct him to divert Mu Xuan’s attention, he returns with a body full of injuries which I then have to tend. What a useless person!”</p><br/><p>She grew increasingly agitated as she scolded him, listing a whole list of his shortcomings. “Also, he’s a clean freak. He needs to change his clothes several times a day and can’t seem to tolerate even the least bit of dust, cleaning my entire home repeatedly. It’s so irritating! Even though he’s a grown man, he loves small animals, gifting them to me and boosting about his ability to create every species in existence.</p><br/><p>“Heh, such arrogance! Who cares about that? I’m the queen of the aves, so how could such trickery amuse me? After I prohibited him from the royal planet of the aves, he created a planet nearby to become my neighbor. But who wants to be his neighbor?! Sisi, you don’t know…”</p><br/><p>Yao Si realized that she had unknowingly unleashed a chatterbox. She covered all grounds for about half an hour before stopping. It was only then that she noticed Yao Si’s smile and froze, sinking into a daze. She couldn’t quite comprehend her vast understanding of Lin Long.</p><br/><p>“See, you know Lin Long much better than you know me.” <em>And you say there’s nothing going on!</em></p></div>\n</div>"}