{"title": "Chapter 197 - The Bloodling Migration", "id": 197, "volume": 2, "url": "http://boxnovel.org/my-dad-is-the-galaxy%E2%80%99s-prince-charming-chapter-197-the-bloodling-migration", "volume_title": "Volume 2", "body": "<h1>Chapter 197 - The Bloodling Migration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Yao Si was utterly confused, but she saw the logic in their reasoning. So were they perhaps right? But everything seemed so unreal. After being a weakling for such a long time, she couldn’t get used to the sudden change in her identity. Besides, she couldn’t remember anything from before she was an earthling.</p><br/><p>She couldn’t seem to fill up the gaps, so she decided to temporarily toss the problem aside.</p><br/><p>“Enough, enough, enough!” She raised her palms to stop Lin Long and Qu Zhe from continuing. She pointed toward the black mess outside/ “Let’s put this queen discussion aside for the time being. How are we going to deal with that bunch out there? We can’t just leave them in this universe!”</p><br/><p>They were a huge crowd of madmen that resorted to violence at the slightest disagreement. Even though most of them had their abilities obliterated by her, who knew what they could come up with. After all, they had traveled through their universe just to find their contractors and were high-risk individuals. If she left them to their means, there was a possibility they would destroy the whole Galaxy.</p><br/><p>“They won’t go back.” Qu Zhe shook his head firmly. “Your Majesty, we’ve been looking for you for such a long time. Now that we have found you, you are no longer just a queen, but also the only option when seeking death for all those without a contractor.”</p><br/><p>“F*ck that!” <em>F*ck you, maniacs! Are you really in such a rush to die? Even if you were, couldn’t you seek it elsewhere? </em>“Didn’t you say it was a legend? I might not be able to grant them death!”</p><br/><p>“Previously I assumed it was a legend as well…” Qu Zhe paused, then glanced at Li Zheng intensely.</p><br/><p>In response, Li Zheng started to tremble in fear, covering his mouth firmly while trying to force the bile down his throat as he dashed behind Yao Si for shelter. He crouched low behind her, struggling to shrink behind her 156cm height. Qu Zhe appeared wounded by his actions. “But now… I’m sure that you can grant us with an end.”</p><br/><p>“I’m sure as well!” Lin Long added enthusiastically.</p><br/><p>“Hehe…” <em>Hey, how could you guys have been affected by those madmen?</em></p><br/><p>“It’s true, Your Majesty!” Lin Long explained seriously. “Your Majesty, haven’t you realized? All the pure breeds around you have found their contractors.”</p><br/><p><em>Eh?!</em></p><br/><p>The pure breeds around her, weren’t they Lin Long and Qu…</p><br/><p>F*ck! Could it be true? Was that what granting death meant?</p><br/><p>She finally understood the gaze exchanged by Li Zheng and Qu Zhe.</p><br/><p>“Is the queen perhaps Yue Lao <sup>1</sup> ?!”</p><br/><p>(╯‵□′)╯︵┻━┻</p><br/><p><em>Whoever wants this throne can have it! </em></p><br/><p>–</p><br/><p>A full-fledged war was prevented and instead a bunch of overaged singles came to the Red Planet. Yao Si who was forced into the Yue Lao role only had one response: F*ck! Why did she have to bother with that bunch of crazy single dogs?</p><br/><p>In order to deal with the large crowd of ‘single dogs’ that stayed around her house, the Red Planet held an emergency meeting. Fortunately, the Galaxy was filled with a diverse mix of different races, providing the elders with tons of experience on how to manage disputes among races. However, due to the unique nature of these ancestors, the elders spent almost a whole week before coming up with a preliminary proposal.</p><br/><p>After both Yao Si and Mu Xuan read through it, the ‘Leaving Singlehood Pact’ was finalized.</p><br/><p>Yes, that was what it was called! The motive of the pure breeds was only one, and it was to find their contractor. If it wasn’t for the violent and maddening declaration of war against their universe, they wouldn’t have had to waste so much effort in resisting.</p><br/><p>Couldn’t they have been like Lin Long, coming and leaving silently?! Was there a need to stir up such a big fuss? Since they went so far, they deserved to be punished.</p><br/><p>The pact consisted of only three conditions:</p><br/><p>First, all pure breeds from the other universe (also known as: pure breeds) are allowed to apply for access to the Red Planet through legal channels. Once the application has been approved, the immigration permit pass can be obtained.</p><br/><p>A temporary bloodling identity card can be applied simultaneously for them to become Red Planet’s bloodlings. In order to prevent chaos within the Red Planet, their generation number would follow the current generation and be 765th.</p><br/><p>Second, pure breeds were to have their abilities sealed by the respected queen of the bloodlings: Yao Si (also, queen of the pure breeds) before they pass through immigration. After it happens, pure breeds are prohibited from participating in activities that may provoke other races.</p><br/><p>They are not allowed to expose their pure breed identity unless in critical situation. Pure breeds are to abide by all the laws of the Red Planet and are prohibited from any activities that would disrupt the harmony among races or the Galaxy’s peace. Anyone caught breaking the rules would be restricted entry permanently.</p><br/><p>Third, the immigration application lasts for ten years. Once expired, extension is allowed in the Red Planet.</p><br/><p>These three conditions were the best solution to the current situation, providing the pure breeds with an opportunity to search for their contractors while controlling their maniacal mentality. The gist of the rules was: Don’t cause trouble, don’t cause trouble, don’t cause trouble!</p><br/><p>But the sealing of their abilities was a little hard. They were a bunch in love with violence, so for them to lose their ability and be relegated to normal beings seemed… like an almost impossible task!</p><br/><p>○|￣|_</p><br/><p>Unexpectedly, once the three conditions came out, the crowd which previously insisted on taking over the whole universe agreed without any objections. Everyone nodded obligingly, not one having a second opinion. They even asked when the queen was going to seal their abilities.</p><br/><p>“Your Majesty, what should we do? We will listen to all your demands.”</p><br/><p>“Your Majesty, when you make your attack, would you prefer if I fall on my side, my back, or on my stomach? I’ll be prepared.”</p><br/><p>“Your Majesty, do those who seal their abilities first have a priority in finding their contractor? Why don’t you seal mine first?”</p><br/><p>“Your Majesty, I love peace, really! Look at my… muscles, they are small than those of the others, so could you introduce me to a contractor first?”</p><br/><p>“Your Majesty…”</p><br/><p><em>Get lost! I’m not Yue Lao! </em></p><br/><p>(#‵′)</p><br/><p>Yao Si spent a whole week sealing the pure breeds’ abilities to the normal bloodling level. Ever since the battle, she could control that power and her mental strength with ease.</p><br/><p>Her ability was still really odd though. At times it could be everything while at other times it wasn’t anything, like…</p><br/><p>“A mixture of energy,” Mu Xuan blurted out.</p><br/><p>“How do you know?”</p><br/><p>“I’m not sure.” He shook his head. “I just found the term rather fitting.”</p><br/><p>Yao Si didn’t pay much attention as she continued to seal the pure breeds’ abilities. While doing so, she realized that those pure breeds who had their abilities obliterated weren’t completely without any power, it was just recovering extremely slowly and would probably take a few hundred years to return to normal. Still, she used the bloodling suppression as an additional seal.</p><br/><p>After all their abilities had been sealed, Yao Si left the follow up things to Elders Council since they were more proficient in such tasks.</p><br/><p>For a time, the crammed mess in front of the Majestic Palace was gone. Yao Si could feel her energy being on the low, and together with Mu Xuan, she lay on the sofa motionlessly, trying to recuperate.</p><br/><p>“I’m tired…” She finally understood the pains of racial issues.</p><br/><p>“Yaoyao.” Mu Xuan pulled her into his embrace before passing her a piping hot bowl from out of nowhere. “Come on, have some blood curd for nourishment.”</p><br/><p>Yao Si downed the entire bowl instantly, and as expected, Mu Xuan had the best culinary skills. She licked her lips and placed the bowl down before turning to hug him. She lifted her head to glance at Mu Xuan who had been much busier than her, and a warm, fuzzy feeling spread through her. It was a serenity she had never experienced before.</p><br/><p>“Mu Xuan…”</p><br/><p>“Mmh?” He reached his hand out to wipe soup from the corner of her lips, and his face filled her vision.</p><br/><p>“Did I… really convert you?”</p><br/><p>Mu Xuan stilled before bending down to place a light kiss on her lips. “Why do you say so?”</p><br/><p>“Because I had a dream…”</p></div>\n</div>"}