{"title": "Chapter 03-05 - The Light Knights", "id": 3, "volume": 1, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-03-05-the-light-knights", "volume_title": "Volume 1", "body": "<h1>Chapter 03-05 - The Light Knights</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 03-05: The Light Knights</h4></header></p><div class=\"entry-content\"><ul><li><strong>03: The Light Knights</strong></li></ul><br/><p>“Gubah?!” “Ogeh?!” “Uboo?!” The armored knights fly through the air one after the other. There’s no point in adding hits to opponents that are wearing something like armor, so if you simply use their own momentum to throw them, they will fall to the ground with the weight of the armor added, which will make them face hell. Depending on the way they fall, they might even snap their neck and die instantly, but I have added some discretion in order to avoid that from happening. “Father! I leave mother in your care!” (Haine) “Understood! But you…” I leave mother to father, and just like that, I rush forward. Normally, this is a situation where we should be hiding and checking the situation, but since we have already left our hiding, we have no choice but to confront them. Even with just a slight glance, I can tell that there’s around 50 knights. If I fight them all at once, I will just be crushed by their numbers. In that case, what’s most important is to crush their leader. The important-looking armored knight that seems to be one peck higher than the other knights and was giving orders a few moments ago. Aiming for that guy, I ran straight at him. “Captain! Be careful!” “?!!! What?! What’s going on?!” The other side seems to have begun noticing the abnormality, and the one who was acting all high-and-mighty suddenly got flustered. “What are you idiots doing?! Crush this insolent one that’s coming here! In the name of the Light Goddess!!” Abiding to the order, a number of knights tried to obstruct me, but I avoid them, and at times I punch them back, favourably closing the distance to the knight that was called as the captain. “Uwaaa!!! Don’t come any closer!!” The captain was visibly flustered. He hurriedly threw away the sword in his hand, and in place of that, unsheathed a dagger that was at his waist. (?! What is he intending to do?) If you are going to clash with the enemy, you would normally have more of an advantage with the long sword. And yet, he threw that away and changed to a dagger that’s clearly lacking in effectivity as a weapon. This mysterious action of his was soon made clear. At the same time as he points the dagger at me, the blade shines brightly. “[Holy Light Bullet]!!” “What?!” (Haine) A light arrow was shot from the dagger. Is that how I should describe it? At any rate, it was a light that flew fast like an arrow. If this hits, it would be bad. “Guh!” My swung arm comes into contact with the light arrow, and I deflect it. As expected, I had to stop running and temporarily stay in place. “Wa?!! You deflected the [Holy Light Bullet]? That’s impossible…” The captain, who shot the light arrow, had his eyes wide open in shock. “The power of the Light Goddess that was granted to us, the Aurora Knight corps…this [Holy Light Bullet] that had holy power packed in it was…repelled by a countryside bum like him. There’s no way that’s possible!” “Why is a human utilizing the power of light? I don’t understand, but…” (Haine) I was so surprised, I ended up utilizing a bit of my power of darkness. “Don’t just go talking down about the countryside when you just come invading our village!!” (Haine) The charge resumes. I close the distance to the knight captain that was completely bent back now. “Hiiih!! Don’t get closer!! [Holy Light Bullet]! [Holy Light Bullet]! [Holy Light Bullet]! [Holy Light Bullet]! [Holy Light Bullet]! [Holy Light Bullet]!” Falling into panic, he shot light arrows like crazy, but that’s exactly why they didn’t hit. There was already no need to deflect them, I simply had to dodge them, and was easily able to enter into fighting range. “This is the end.” (Haine) And then, as I was about to punch the fully shaken face of this man— Something stopped my fist. It wasn’t the leader that was simply panicked all around. “H-Hero-dono?!” Is what the captain said. The one that suddenly appeared and entered in between me and the captain was a person wearing an equally white shining armor, however, its presence was completely different. It gave out majesty. A beautiful girl.</p><ul><li><strong>04: Hero’s Arrival</strong></li></ul><br/><p>“Hero-dono?! Hero-dono!” The captain that was weak on his knees and agitated, stood back up suddenly. “This villager was opposing us! He went against the Light Church! Please give him swift divine punishment!” The fist that was supposed to be dug on his face, was stopped by the shield of the girl that had suddenly appeared. From the impression the armor she wears is giving, I can tell that she is in the same organization as these knights that are invading our village.  “Captain Vesage…” The girl turns back to the captain. “Why did you depart on your own volition? I told you that I was going to check the state of the seventh recruitment corp, and that you were to stay in standby until I returned.” “That’s…uhm, that’s…!” It looks like they are quarreling. “Also, what’s with this atmosphere? It is as if you are capturing the place. Captain Vesage, what in the world are you trying to do here?” “That’s, uhm…we, the Aurora knight corp, for the sake of gathering new members…” (Vesage) The Captain-san speaks with a fading voice like that of a child being scolded after a prank. It seems the girl got tired of listening to what he had to say, this time, she turns to my direction. “You are someone from this village, right?” “Eh? Y-Yeah…” (Haine) Since she was being well-mannered, I reflexively respond in the same way. The knights around, and the villagers that were gathered outside by those knights, had their attention on that girl and were not moving. “I am truly sorry.” Is what she said as she lowered her head deeply. Looks like she is apologizing, or more like, there’s no doubt she is. “I apologize from the bottom of my heart for the trouble that our people of the Church have caused to your village. I strictly ordered them not to disturb the livelihood of the villagers, but it ended up in this. It is all because of my own negligence.” “Eh, uhm…” “I will have the knights put away their weapons immediately. On my name, I assure the safety and freedom of the villagers. On top of that, can you please hear what I have to say?” In that space of time, she lowers her head even deeper to the point that I could only see the back of her head. ‘What beautiful hair’, is what I thought, but this is not the time to be thinking about that. Looking at my surroundings, it seems the knights sheathed their swords with the words of the girl, placed aside their spears, and lower their heads in apology. Should I consider this as the danger being gone for the time being? But it looks like they don’t have any intentions of leaving. It was as if they were saying they won’t be moving an inch until we hear out what they have to say. “Haine.” “Haine?!” Mother was accompanied by father and were coming to where we are. I let out one heavy sigh. In the end, I decided to listen. “We came from a place a lot further away from here, the Light capital. We are the Light Church.” “Light Church?” (Haine) “Yes. One of the five Gods of creation, the church that follows the Light Goddess Inflation-sama.” The five Gods of creation. It refers to the five Gods that created this world. The Light Goddess Inflation, the Fire God, Wind God, Water God, Mother Earth God. For me who was a Dark God, they are the hateful people that sealed me. However, it seems they are targets of religious faith for the people here. Well, it is obvious huh. They are Gods after all. “And I am the light hero that represents the Light Church, Kourin Karen.” (Karen) The word hero is not a word I am familiar with. Even in my memories as a Dark God, I don’t know about such a title. “And so, what is this Light Church and the hero-sama doing in such a remote place like this?” (Haine) From how the talk has gone, it seems I have no choice but to be the representative of this village, so I ask that of the hero Karen-san. “We are currently looking for new knights.” (Karen) “Knights?” (Haine) “Yes, one of the organizations of the Light Church, the Aurora Knight corps. We are being troubled by a lack of personnel. In order to protect the innocent people that follow the Light Goddess, the number of knights is still not enough.” (Karen) Hearing that, the words the high-and-mighty Captain said about gathering all villagers, especially the young ones between 10 to 20 years old made sense. “But it is a honest-to-word recruitment! In order to accept people that want to become members of the knight corps, we moved around the towns and villages in the area.” (Karen) “But the knights that came here are clearly different, right? Not only did they try to recruit, it felt like they were going to kidnap the young ones of this village. The one who was leading this was…” (Haine) The gaze of me and Karen-san were directed at the same place. If I remember correctly, his name is Vesage. “I-I had no choice!” (Vesage) At this late of the game, captain Vesage spat out excuses. “Since I have the chance, I will say it. Hero-dono is way too easygoing! There’s no need to do something as lukewarm as recruiting, we should gather all the people here that can fight, and strengthen the Aurora knight corps as much as possible!” (Vesage) “In order to do that, you tried to levy the youngsters of this village?” (Haine) “That’s right. Not ‘recruiting’ but ‘levying’!” (Vesage) Captain Vesage bites back at the retort I made. “Haine-san.” (Karen) Karen-san also enters the talk. “I also admit that the methods of captain Vesage were forceful, however, the grace of the five Gods has begun thinning in this world. The monsters are running rampant, and in order to fight against it, we have to gather people.” (Karen) Even Karen-san. “Of course, we are not forcing anyone. However, I want to fight together with everyone in order to protect this world, and in order to do that, I have to ask of you…please!” (Karen) Karen-san once again lowers her head to the point I see her back of the head. This time it wasn’t an apology but a request. And it wasn’t only for me, but to all the villagers. But the only thing that was returned was agitation. Can’t be helped. The sincerity of Karen-san was clear as day, but the villagers also have their own life. 10 to 20 years old, in other words, they would be taking our strongest workforce, which is totally troublesome for the village. There will probably be no one wanting to join, but Karen-san’s side is giving airs that they won’t be budging an inch unless someone raises their hand. If handled poorly, the knights might once again burst and resume hunting people. “……Understood.” (Haine) Heaving a sigh, I step forward. A voice called out ‘Haine!’. It was the voice of mother, and that voice pierced my chest for an instant. “I will go. That’s why, please be satisfied with only me. Don’t try to persuade the other villagers, and of course, don’t harm them. Those are my conditions for joining.” (Haine)</p><ul><li><strong>05: I obtained a homeland</strong></li></ul><br/><p>This is how it was decided that I, Kuromiya Haine, will be joining the Light Church. I received the praise from the surroundings in the sense that I sacrificed myself for the village, but it is not like I myself didn’t have other reasons. That’s…to see the world. In the battle with the Gods that occurred 1,600 years ago, I -the Dark God- was sealed by the victors, the other five Gods, and they should have recreated the world in the way they wanted. And in truth, it seems the Light Goddess, Inflation, has created a church that follows her, and there’s a high chance the others are doing the same thing. In the time I was absent, just how much did they intervene with the humans? In order to investigate that, I will be going. If there’s something that surpasses the boundaries of acceptable, it is my role as a God myself to correct it. In truth, this is something I should have done sooner. This was one of the reasons why I reincarnated as a human after all. And yet, there was a reason why I let it drag until I turned 18 years. The reason for that was… * * * “Haine, are you really…really going?” The moment of my departure, mother grabbed my hand with reluctance and was not showing any signs of releasing it. I…was also unable to shake away that hand of hers and stayed just like that. “It is fine already, let Haine go.” “But dear, Haine has not left this village even once, you know? Even when he goes hunting, he would come back in less than 3 days without fail, and yet, if he were to go to the city, who knows when he will come back…” I was also worried about not being able to attend to mother who has a weak constitution. Actually, there’s times when mother worried about me and ended up worsening her physical condition because of it. If possible, I don’t want to leave either. I was prepared for it, but this is a more painful farewell than expected. And then, the linked hand of mother and I was gently separated by father. “Haine is a man. The time will come when he has to leave to the outside world in order to ascertain his own worth. And today is the day. If you are his mother, congratulate Haine for the start of his new life…… Haine.” “Yes, father.” (Haine) “You probably don’t remember, but when you were 1 year old, there was a time when you disappeared from the house. Your mom and I were searching desperately for you, but we were unable to find you even when it reached the night, and we thought it was already too late.” “…” “However, the moment night came, you came back all of a sudden. You came back to the house on your own. It was as if you had finished your stroll and was coming back from it. Since then, mom became an incredible worrywart, but I, on the contrary, was impressed. ‘Being able to do such a big adventure when you are only 1 year old, just how big of an adventure will you be able to achieve when you are an adult?’ Is what I thought.” Father places both hands on my shoulders. “If it’s about me and mom, don’t worry. You are not the kind of man who should live your whole life in a small village. Go see the world. Think of this event as a good chance to do that.” Saying this, father hugged me with both arms. For the soul of the Dark God, this was only a body that was coincidentally chosen in order to descend to the surface world, however, for the current me, these people are without doubt…my parents. These 18 years until now, I have been poured with love, taught a lot of things, and was raised by them. There’s no way I would think this connection with them was just a fictitious one. “Mother, father…I love you.” (Haine) I hug mother and father, and for the first time in my life, I depart to the world where these people are not there. At that moment, I once again learned…I was a result from inheriting the soul of the God of Darkness, but before that, I am a human…I am Kuromiya Haine.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-01-02-filial-piety\" id=\"prev_chap\" title=\"Chapter 01-02 - Filial piety\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-06-07-crucible-of-humans\" id=\"next_chap\" title=\"Chapter 06-07 - Crucible of humans\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236247\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}