{"title": "Chapter 18-19 - Young day’s farewell", "id": 18, "volume": 1, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-18-19-young-day%E2%80%99s-farewell", "volume_title": "Volume 1", "body": "<h1>Chapter 18-19 - Young day’s farewell</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 18-19: Young day’s farewell</h4></header></p><div class=\"entry-content\"><ul><li>18: Young day’s farewell.</li></ul><br/><p>“The Mirack-chan in those days was completely opposite of me, an energetic girl that was seen as a boy by her surroundings.” (Karen)</p><br/><p>So she isn’t that much different from now.</p><br/><p>Anyways, it seems their houses were next to each other, and their age and gender were the same, it took no time for them to get along with each other.</p><br/><p>“Mirack-chan was considerate towards the weak me. Like a knight protecting me. And I got spoiled by it. We were always together. She was truly a friend I loved.” (Karen)</p><br/><p>The turning point came.</p><br/><p>It all began with the doctor that came to do a medical examination on Karen-san, and with that process, that person noticed the overwhelming light element she had.</p><br/><p>The doctor recommended her to train her control of the light divine power as a method of medical treatment. And so, Karen-san began her training just as suggested.</p><br/><p>Then, the excessively inclined element of hers that had been eating onto her until now, turned into a talent.</p><br/><p>She was able to master her light element, the controlled divine power was no longer eating onto her, and she finally achieved a healthy body.</p><br/><p>Her talent caught the eye of the light church, and she was enlisted to the Aurora Knights with fanfares.</p><br/><p>It is said that there was practically no stumbling as she climbed her way to being the light hero.</p><br/><p>And so, in that time, her neighboring friend had been completely estranged from her life.</p><br/><p>“It is not like I forgot about Mirack-chan. But with my everyday training, I didn’t have the time to meet her—no, that’s not it. I had fun training to control my light divine power. I had so much fun, I placed Mirack-chan as secondary. That’s why…!” (Karen)</p><br/><p>When they met after several years later, Katack Mirack had become a hero as well. And she was no longer Karen-san’s friend.</p><br/><p>The clear words of Mirack towards Karen-san: ‘You are not a friend. You are an enemy’.</p><br/><p>The light hero and the fire hero; the representatives of their respective churches that are fighting with each other to obtain honor -the very definition of enemies.</p><br/><p>Until today, there were several times where she had the chance to meet face-to-face with Mirack, but her attitude never softened.</p><br/><p>That had cut the heart of Karen-san into pieces.</p><br/><p>“…It is my fault. I was the one who abandoned Mirack-chan first after all. That’s why, no matter how much she hates me, it is my fault. Mirack-chan has done nothing wrong!” (Karen)</p><br/><p>Karen-san tried to say it firmly, but her tears had already drenched almost half of my shirt.</p><br/><p>If someone were to find this scene and witnessed the hero crying her eyes out, it would probably spread through the whole grand church by tomorrow, and there would be blood raining.</p><br/><p>“I am truly a hopeless hero. Just how many times do I have to thank Haine-san today?” (Karen)</p><br/><p>Crying as much as she needed, saying as much as she needed, she was slowly recovering her usual liveliness.</p><br/><p>Even so, she was unable to get rid of that nasal voice.</p><br/><p>“It might be a bit inappropriate to say this at this moment but, today, incredibly good things happened to me.” (Haine)</p><br/><p>“Eh?”</p><br/><p>“I learned about these things called ethereal machines, and I was able to confirm that humans have properly developed with the long passing of time. As expected, humans are incredible, humans are strong! No matter how harsh and painful their environment is, they are able to climb over it!” (Haine)</p><br/><p>That’s why…</p><br/><p>“Karen-san can climb over it as well! Right this instant! Let’s go!” (Haine)</p><br/><p>I straddle on the flying machine that recently finished maintenance. I somewhat learned about how to ride it by seeing Karen-san before.</p><br/><p>“Karen-san, ride on my back!” (Haine)</p><br/><p>“Eh? Ride? Where are we going?! Or more like, can you drive this, Haine-san?!” (Karen)</p><br/><p>“The Founder-sama said this at the meeting, right? That the city, where the Fire Church’s main headquarters are, is pretty close.” (Haine)</p><br/><p>“Eh?! EEEEEEH?!!” (Karen)</p><br/><p>Placing Karen-san at my back, the small flying machine flew into the sky.</p><br/><p>“No way!! You are really driving it?!!! Moreover, flying at night?!!!” (Karen)</p><br/><p>* * *</p><br/><p>After around one hour, we arrive at the objective.</p><br/><p>The Fire Church located at the fire capital, Muspelheim. The inner sanctuary of fire.</p><br/><p>That building trembled.</p><br/><p>“What?! What was that shock?!” “An enemy attack! An enemy attack!!” “An enemy attack?! Are you saying monsters have invaded?!” “No, that’s not it! That’s a human!!” “Wa?!!” “Those guys of the Light Church have invaded!!”</p><br/><p>The people of the Fire Church were in chaos.</p><br/><p>And so, after randomly going around the Fire Church, the person we were searching for arrived herself.</p><br/><p>“What’s this?! What are the Ignis Militant corps flustered about?!”</p><br/><p>The Fire Hero, Katack Mirack.</p><br/><p>Finding us, the color of her face changes.</p><br/><p>“Yooou!!! W-What’s your business? Did you come here to get back at us for what happened this morning?!” (Mirack)</p><br/><p>“Fire Hero, Katack Mirack, I have come here with a proposition.” (Haine)</p><br/><p>While hovering with the flying machine, I say this.</p><br/><p>By the way, Karen-san was still clinging to my back and was all stiffened.</p><br/><p>“Proposition, you say?!” (Mirack)</p><br/><p>“We want to make an official collaborative relationship with the Fire Hero and the Light Hero. Unite the power of two heroes to fight against monsters.” (Haine)</p><br/><p> </p><ul><li><b>19: Two heroes, two girls</b></li></ul><br/><p>“Cooperation, you say?!”</p><br/><p>Mirack frowned heavily at my proposal.</p><br/><p>“You, you are the guy that was together with the light hero this morning, right? Didn’t you hear what I said? All heroes aside from me are my enemies!” (Mirack)</p><br/><p>“That’s not true. The enemy of the heroes are the monsters.” (Haine)</p><br/><p>Maybe because I refuted so firmly, Mirack looked daunted for a second.</p><br/><p>I see this as a chance and attack at once.</p><br/><p>“Protecting humans from the danger of monsters. Isn’t that the most important duty of heroes? And yet, not cooperating as heroes and fighting each other is only inefficient and an insult to your position.” (Haine)</p><br/><p>“What did you say?!” (Mirack)</p><br/><p>“Hero-sama! Please leave this to us!”</p><br/><p>Saying this, from the side of Mirack and I, a group of muscular men came out.</p><br/><p>“The Ignis Militant corps have arrived! You rioter of the light church, we are not gonna let you do as you wish in our territory!”</p><br/><p>It is probably an organization that serves the same purpose as the Aurora Knight corps of the Light Church.</p><br/><p>“Don’t go exaggerating, we were only having a reasonable discussion here.” (Haine)</p><br/><p>“Don’t joke around! Would a person looking for a reasonable discussion invade with a flying machine with no appointment at all?!”</p><br/><p>“The atmosphere asked for it, so it can’t be helped.” (Haine)</p><br/><p>“No way it couldn’t be helped!!”</p><br/><p>They do have a point.</p><br/><p>“No way around then. In that case, just take it as me being the only one who came here to pick a fight with you guys. Can you let those girls have a talk?” (Haine)</p><br/><p>“Haine-san?!” (Karen)</p><br/><p>Ignoring the worried voice of Karen-san, I jump down from the flying machine.</p><br/><p>“In the time I am fighting you guys, our hero will have an audience with yours.” (Haine)</p><br/><p>“You are going to be fighting us on your own?! We will be crushing you in less than a second!”</p><br/><p>The number of militants here are more than a hundred even when I just check at a glance. Taking into account that this is their main headquarters, the numbers will most likely increase more.</p><br/><p>“[Heat Knuckle]!!!”</p><br/><p>“Uwa.”</p><br/><p>I catch the slow punch of the militant-san that rushed towards me, and his fist was incredibly hot.</p><br/><p>“Hot!!” (Haine)</p><br/><p>I let off in surprise, but as expected, it is an attack with fire divine power added to it. Compared to the ‘Flame Burst’ of Mirack, it is a lot weaker, but it is definitely similar to the difference of the light hero Karen-san and the Aurora Knight corps.</p><br/><p>And then, the militants came to attack me in the same way one after the other, and at the side of this situation that had turned into a brawl, there’s Karen-san and Mirack. The two girls were facing each other.</p><br/><p>“Mirack-chan…” (Karen)</p><br/><p>“To think you would resort to such a reckless action. Well then, let’s go at it as well.” (Mirack)</p><br/><p>Saying this, Mirack takes a fighting pose.</p><br/><p>I watch over this situation as I handle the the muscular attacks that came right and left.</p><br/><p>“That’s not it, Mirack-chan! I—!” (Karen)</p><br/><p>“Like hell it is not! After doing something that’s practically a night raid, there should be no other reason but to want to settle things! We have to clearly settle who is the better hero sooner or later after all! I will make this the first act. Light hero, you are my first prey!” (Mirack)</p><br/><p>“…It is true that what Haine-san is doing is absurd, and I can’t keep with his pace at all. But I understand what he is trying to have me do.” (Karen)</p><br/><p>Karen-san unsheathes the holy sword Saint-George from her waist…and places it on the ground.</p><br/><p>“You!!”</p><br/><p>“The light hero, Kourin Karen, once again asks of the fire hero, Katack Mirack; please, let us join forces to fight against monsters. Please fight together with me in order to protect the people from the threat that is scattered around the world.” (Karen)</p><br/><p>Saying this, Karen-san lowers her head deeply.</p><br/><p>If there were a high-ranked member of the light church here witnessing this scene, that person might have gone mad in anger.</p><br/><p>The representative of the church -their hero- was lowering her head towards a hero of a different church. With only that one point, it might be taken as the light church standing below the other churches after all.</p><br/><p>“Karen, you…” (Mirack)</p><br/><p>Mirack also understood the meaning of it and her body had stiffened.</p><br/><p>“Also, sorry. Since the time I entered the light church, I couldn’t meet Mirack-chan at all. Now that I think about it, I didn’t give my farewells either. You might be angry at someone like me. Mirack-chan has her own objective, and that objective might have nothing to do with me. But I… I want to become a proper friend of Mirack-chan!!” (Karen)</p><br/><p>At some point in time, the Ignis Militant corps had stopped their attacks and were looking at the talk of the two girls.</p><br/><p>And there was one of them who had stiffened into a grappling stance with me. That person said this.</p><br/><p>“…Hey you.”</p><br/><p>“What is it?” (Haine)</p><br/><p>“Did you bring that girl here for this?”</p><br/><p>“That’s right.” (Haine)</p><br/><p>“You are a nice guy.”</p><br/><p>That’s not true.</p><br/><p>Was Karen-san able to hit Mirack with all her feelings?</p><br/><p>In regards to that, Mirack…</p><br/><p>“…This is stupid!” (Mirack)</p><br/><p>Said this with deep wrinkles between the bridge of her nose.</p><br/><p>“I was wondering what you were going to say, and you come with this! I am a hero. I am different from my child self that didn’t know anything at all! There’s no way I would go playing friends!” (Mirack)</p><br/><p>(Eh?!) (Wa?!) (Hero-sama, that’s too much!!) &lt;probably whispers&gt;</p><br/><p>I mix in with the people of the Ignis Militant corps and watch over the girls with sweat in my hands.</p><br/><p>Karen-san was incredibly dejected by this answer.</p><br/><p>“…….But…” (Mirack)</p><br/><p>“Eh?”</p><br/><p>“It is true that there are a lot of monsters. It is troublesome to defeat them all myself, and it would be nice to have others helping out. However, even with that…” (Mirack)</p><br/><p>The eyes of Mirack shine sharply.</p><br/><p>“If it’s you who showed such unsightly fight like the one this morning, I can’t entrust you with helping either. That’s why, I will be confirming your ability again. If you show skills that convince me, I don’t mind accepting this talk about joining forces!” (Mirack)</p><br/><p>The surroundings went ‘Ooooh!’ and clapped.</p><br/><p>“Hmph, but this kind of proposal is nothing but a disgrace to a hero. If you don’t want to, you can refuse, you know?” (Mirack)</p><br/><p>“I will do it! I am going to! Let me!!” (Karen)</p><br/><p>“O-Okay…” (Mirack)</p><br/><p>The vehement acceptance of Karen-san made Mirack grow timid as she responded.</p><br/><p>“And so, what should I do?! Defeat 300 Ignis Militants?” (Karen)</p><br/><p>“”“Please no!!!”””</p><br/><p>The militants cry out.</p><br/><p>This already feels like a live stage.</p><br/><p>“I wouldn’t have you do something like that. There’s something better, a mountain.” (Mirack)</p><br/><p>“A mountain?!”</p><br/><p>The militant, who was still in a grappling stance with me, showed clear agitation at those words.</p><br/><p>“Eh? What? Do you know something about this?” (Haine)</p><br/><p>“…Walking one whole day from this Fire Church headquarters, there’s the Radonna mountainous district. Just 1 year ago, it was a place that had a picturesque natural scenery, but now, it is a wasteland with not a single blade of grass growing on it.”</p><br/><p>“Why is that?” (Haine)</p><br/><p>“Because an atrocious monster is now living in it. It is robust and grand. Us Fire Church contemplated on subjugating it, but we didn’t manage to succeed even once. Hence, it is still alive, and still there. It has become the ruler of the mountain.”</p><br/><p>The militant spits out the name of that monster with bitterness.</p><br/><p>“The fire cow, Phalaris. A gigantic cow-shaped fire element monster.”</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-16-17-true-reflection-time\" id=\"prev_chap\" title=\"Chapter 16-17 - True reflection time\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-20-22-joint-subjugation\" id=\"next_chap\" title=\"Chapter 20-22 - Joint Subjugation\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236253\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}