{"title": "Chapter 20-22 - Joint Subjugation", "id": 20, "volume": 1, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-20-22-joint-subjugation", "volume_title": "Volume 1", "body": "<h1>Chapter 20-22 - Joint Subjugation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 20-22: Joint Subjugation</h4></header></p><div class=\"entry-content\"><ul><li>20: Joint Subjugation</li></ul><br/><p>The next day arrived and we headed to the Radona mountain district.</p><br/><p>The members are Karen-san, Mirack, and I.</p><br/><p>“Why me as well…” (Haine)</p><br/><p>While walking in this mountain trail, I think of how out-of-place I am here.</p><br/><p>“Isn’t that obvious?! The one who proposed this first was Haine-san, so I will have you tag along till the end!” (Karen)</p><br/><p>Karen-san who is walking ahead, had a somewhat strict tone.</p><br/><p>Could it be…she is angry?</p><br/><p>“Ah, Haine-san, just now you thought I was angry, right? Isn’t that obvious? I was brought to the Fire Church without being given a single notice beforehand, and with no preparation at all, I was made to face Mirack-chan. Can you imagine just how much of my mental strength was chipped away with that?” (Karen)</p><br/><p>Not only did she see through what I was thinking, she even placed incredible pressure onto me.</p><br/><p>“…It is true that that was a bit too quick tempered. Sorry.” (Haine)</p><br/><p>“Seriously. Sure, I scouted Haine-san in order to have someone protect the people freely without being bound by regulations, but I didn’t think you were a person that acted in such a free manner!” (Karen)</p><br/><p>I only heard about that from the Vice-captain Grades though.</p><br/><p>“I didn’t think you would even try to save me as well!” (Karen)</p><br/><p>“Am I really that free of a person?” (Haine)</p><br/><p>“You are. To the point that you touched the boobs of a hero in the heat of the moment and acted as if nothing happened.” (Karen)</p><br/><p>Ah, something like that did happen.</p><br/><p>I remember that we completely let that wash by. This is bad. Karen-san is unexpectedly the type that holds grudges.</p><br/><p>“…I…didn’t have any intentions of having anyone touch my boobs aside from my future husband.” (Karen)</p><br/><p>“Eh?”</p><br/><p>“That’s why, don’t go acting kind and make me misunderstand things, okay?!” (Karen)</p><br/><p>Karen-san one-sidedly cuts off the conversation and runs ahead.</p><br/><p>And then, I was punched from behind.</p><br/><p>“Ouch! …Why did you punch me, Fire Hero?!” (Haine)</p><br/><p>“How should I know, pervert man.” (Mirack)</p><br/><p>Katack Mirack normally had an ill humoured expression, but it was even more ill humoured than normal.</p><br/><p>“Is the light church composed only of fools? We are not climbing the mountain in order to have a picnic. How about you guys have a bit more tension?” (Mirack)</p><br/><p>“Do we really look that foolish?” (Haine)</p><br/><p>“Don’t tell me you have even forgotten the reason why we are climbing this mountain. Now go ahead, say it.” (Mirack)</p><br/><p>“It is to defeat the monster that is using this mountains as a nest~” (Haine)</p><br/><p>Since around one year ago, a monster has been living in this mountain district.</p><br/><p>The name that was given to it by the humans was the fire cow, Phalaris.</p><br/><p>This monsters was so gigantic, that even the subjugation force that the Fire Church sent was turned the tables on, and because of it, entrance to the Radona mountain district was forbidden for the normal populace and deemed as a dangerous zone.</p><br/><p>“I didn’t know there was such a monster. Even though the Light Church’s headquarters neighbour the Fire Church’s headquarters.” (Karen)</p><br/><p>Karen-san once again joins the conversation.</p><br/><p>“Looking at it from the Light capital, Apollon City, this Raguna mountain range is just at the shadow of the Fire capital, Muspelheim. It seems like the Fire Church used that geographical relation to hide this. If the other churches know that there’s a monster they couldn’t defeat and are ignoring, it would be a disgrace after all.” (Haine)</p><br/><p>“Wait a moment! Why do you know even that?!” (Mirack)</p><br/><p>Mirack was shock-struck and I casually continue.</p><br/><p>“The people of the Ignis Militant corps gave me as much information as they had before heading here. They have a muscular look, but they are quite the kind people.” (Haine)</p><br/><p>“Those guuuuys!!!” (Mirack)</p><br/><p>And the Ignis Militant corps also wanted to accompany us, but Mirack rejected it.</p><br/><p>The monster we are about to fight is dangerous enough to reject anyone with half-baked skills.</p><br/><p>“From what I have heard, the previous fire hero was defeated by this fire cow, Phalaris, and ended up having to retire. If the successor, Mirack-san, were to succeed in the subjugation of this Phalaris, there’s no doubt your fame in the church will rise sky high.” (Haine)</p><br/><p>This is also information I received from the Ignis Militant corps.</p><br/><p>“Could it be…you used the ‘skill testing’ as a pretext in order to have Karen-san cooperate in that objective of yours…?” (Haine)</p><br/><p>“No way! I just…!” (Mirack)</p><br/><p>“Even if that’s true, I am fine with it.” (Karen)</p><br/><p>Just when it was about to become a quarrel, Karen-san’s statement stopped it.</p><br/><p>“I am fine with letting all the honor of defeating the monster go to Mirack-chan. If with that I am able to become friends with Mirack-chan, I am fine with it. I am also asking for the unreasonable here, so Mirack-chan has to get equal merit for it as well.” (Karen)</p><br/><p>“Karen…” (Mirack)</p><br/><p>“Also, if we defeat a strong monster, we can give peace of mind to the people in the area. That’s without doubt the job of a hero. Let’s do our best, Mirack-chan! Let’s defeat the monster together!” (Karen)</p><br/><p>Saying this, Karen-san once again takes the front.</p><br/><p>Mirack and I get left behind.</p><br/><p>“…You once again acted on unnecessary consideration, right?” (Mirack)</p><br/><p>“Hah?” (Haine)</p><br/><p>“Wiping away any misgivings before the fight. By bringing out a hard to say topic yourself, you avoided any awkwardness between Karen and I. If the same question had been brought out from the mouth of Karen, no matter how I answered, it would still have left some lingering discomfort. Karen also properly wrapped it up. Without giving me a chance to say a single thing.” (Mirack)</p><br/><p>“Now now, aren’t you just overthinking?” (Haine)</p><br/><p>“On that basis, I will answer you. I have no intentions of taking the honor of this at all. It is actually the contrary.” (Mirack)</p><br/><p>“Eh?”</p><br/><p>“This subjugation will fail big time. By asking for an impossible task, I am planning on turning down your proposal. You still don’t understand how fearsome that thing is. Look.” (Mirack)</p><br/><p>Saying this, Mirack points at the place we are headed to.</p><br/><p>There, the mountain trail still continues and there’s no monsters in sight. That’s how it is supposed to be, but…</p><br/><p>“Have a good look. That guy is already within vision.” (Mirack)</p><br/><p>However, the only thing we could see was a splendorous mountain range.</p><br/><p>No, wait. One of the mountains that compose this mountain range…was slowly moving.</p><br/><p>That wasn’t a mountain, but the back of a giant cow…</p><br/><p>“That’s right. That is the fire cow, Phalaris. The largest monster in the history of the five churches that has been sighted.” (Mirack)</p><ul><li>21: Gigantic Monster</li></ul><br/><p>The Radona mountain district was originally an area filled with green and warm temperature. And it was also a fertile land that had beautiful flowers blooming where tourists would come to sightsee.</p><br/><p>However, now it is a barren land with ashen earth.</p><br/><p>“It is the fault of that guy.”</p><br/><p>Hidden in the shadows of the rocks, Mirack, Karen, and I observe the monster that had the same ashen color as that of the earth’s surface.</p><br/><p>Seriously, looking at it closely like this, you can really tell how gigantic it is. The more you have to look up at it the more it felt as if I am looking at a real mountain.</p><br/><p>“It is the heat that that fire element monster is scattering about. All the plants in the mountains have dried, and the living beings there have all died. Thanks to that, the current Radona mountain district doesn’t have a single shadow of its former self; they are now naked mountains.” (Mirack)</p><br/><p>“Fire element huh. From the looks of it, it seems more of an earth type though.” (Karen)</p><br/><p>Seeing the figure of the gigantic monster, Karen-san spills out her impression.</p><br/><p>But even so, it must be a fire element. As if proving the explanation of Mirack about it ‘scattering heat’, even in this far away distance where we can observe it, the air was filled with heat and it felt like we were inside a furnace.</p><br/><p>For a while now, Karen-san, Mirack, and I have been sweating nonstop.</p><br/><p>“Or more like, even monsters have elements huh.” (Haine)</p><br/><p>“Hah? What are you saying? That’s obvious.” (Mirack)</p><br/><p>Mirack looks at me as if looking at an idiot.</p><br/><p>“It is because monsters have elements that us humans have to use our heads in order to fight them with that in mind.” (Mirack)</p><br/><p>“There’s element affinities after all.” (Karen)</p><br/><p>Affinity?</p><br/><p>“Fire drives away wind, wind dries and crumbles earth, earth absorbs water, and water extinguishes fire. Those are the affinities of the elements. For example; the Pythonflies that appeared at the forest the other day were wind element monsters, hence, they were weak against fire. Being able to wipe them out with my ‘Flame Burst’ was also because of that reason.” (Mirack)</p><br/><p>“But this time, the fire cow Phalaris is a fire element. With Mirack-chan who has the same fire element as that, it would turn into a pure battle of strength. So, how is it?” (Haine)</p><br/><p>“Do you think something can be done against it? Against that gigantic thing?” (Mirack)</p><br/><p>Those words were incredibly convincing.</p><br/><p>For a woman, Mirack’s height is pretty good, even so, when standing against that gigantic monster the size of a mountain, she is the size of an ant in comparison.</p><br/><p>“However, only the light element has no weak elemental affinity, and is a special element that is a little bit stronger against all elements. If you were to fight it, there might be a bit of hope?” (Mirack)</p><br/><p>Mirack asks this of Karen-san in a slightly teasing manner.</p><br/><p>Just a few moments ago, Mirack said that she was giving an impossible task to turn down the proposal, which was bothering me.</p><br/><p>If we were to defeat that monster, Mirack promised to form a cooperative relationship.</p><br/><p>But she thinks there’s no way Karen-san can defeat the fire cow Phalaris.</p><br/><p>“Understood.” (Karen)</p><br/><p>Without hesitating, Karen-san unsheathes the holy sword Saint-George.</p><br/><p>“Please stay hidden, Haine-san. From here on, this is the job of us heroes. Mirack-chan and I will definitely defeat that thing.” (Karen)</p><br/><p>On top of that, Karen-san jumps out of the shadows.</p><br/><p>“[Holy Light Blade]!” (Karen)</p><br/><p>The light sword wave was released from her holy sword.</p><br/><p>Since the target was real big, it was a hit. But that’s where the problem comes.</p><br/><p>The ashen skin of the gigantic monster repelled the light sword wave.</p><br/><p>The light disperses futilely. There wasn’t a single wound at the surface of the monster.</p><br/><p>“The fire cow Phalaris’ skin is as hard as steel. In the past, it faced the joint attack of the Ignis Militant corps, but not only did it not receive any damage, it didn’t even move. Steel skin and a gigantic mass; with those two combined, it is impossible to wound that guy.” (Mirack)</p><br/><p>“Mirack! This is not the time to be calmly analyzing this, right?!” (Karen)</p><br/><p>Karen-san’s attack didn’t amount to a wound, but it was enough to make the gigantic monster notice our presence.</p><br/><p>It slowly turned to our direction.</p><br/><p>“Bumooooo!!”</p><br/><p>With a bellow, crimson fire spewed out from the surface of the monster.</p><br/><p>The real reason why it was called the fire cow, we would learn it at this moment.</p><ul><li>22: Genuine heroes</li></ul><br/><p>“Kyaaaa!!”</p><br/><p>Karen-san was exposed to the crimson flames that surged forth like a tsunami.</p><br/><p>“Karen-san!!” (Haine)</p><br/><p>“Don’t come!” (Karen)</p><br/><p>I was about to reflexively jump out, but that person stopped me.</p><br/><p>“[Holy Light Wall]!” (Karen)</p><br/><p>Light flutters like a lace curtain and becomes a boundary line between Karen-san and the assailing flames.</p><br/><p>“So she was able to properly defend against it.” (Mirack)</p><br/><p>In the time Mirack was commenting about it, Karen-san attacked once again.</p><br/><p>“[Holy Light Blade]!” (Karen)</p><br/><p>But the light sword wave was repelled by the iron skin again and disperses. It wasn’t any different from before.</p><br/><p>“The skin of the fire cow is steel itself, moreover, it is a lot harder than it and sturdier as well. In the past, I tried attacking it several times with ‘Flame Burst’, but it didn’t work at all. No one can defeat that guy.” (Mirack)</p><br/><p>“You! You knew that and still challenged Karen to do it?!” (Haine)</p><br/><p>“Calm down. There’s one good thing.” (Mirack)</p><br/><p>“?”</p><br/><p>“The general monsters only attack humans. If there’s no humans in their sight, they move until they find their prey. Just like the Pythonflies the other day.” (Mirack)</p><br/><p>“What about that? Why did you bring that topic now?” (Haine)</p><br/><p>“But, only that fire cow Phalaris hasn’t shown that type of behaviour. No matter if there’s humans or not, it stays in this Radona mountain district without moving at all. It is normally only when we are the ones attacking. That’s why a monster as big as this can be managed with just observing and we are able to leave it alone.” (Mirack)</p><br/><p>“In other words, this is what you mean?” (Haine)</p><br/><p>That even if Karen-san were to lose, it wouldn’t matter at all?</p><br/><p>Even if she were to lose, nothing will change?</p><br/><p>“Why?! Karen-san truly wants to fix the relationship she had with you, and yet, why are you throwing such an impossible task to her in order to push her apart?!” (Haine)</p><br/><p>“What do you understand about me?!” (Mirack)</p><br/><p>Mirack slaps away my arm that was grabbing her collar.</p><br/><p>“You see, when I was a kid, I was always aiming to become a hero. I wanted to become the strongest human! That’s why I did my best, and trained my element number. But it took me several years after I began training before I discovered that I didn’t have much talent!!” (Mirack)</p><br/><p>In other words, she is referring to Karen-san.</p><br/><p>The pitiful sickly girl that lived in the neighboring house. For Mirack who was aiming for absolute strength, that friend of hers had become her target for protection in order to confirm her own strength.</p><br/><p>But one day, her weak friend that was supposed to be protected by her climbed high up.</p><br/><p>That rarely seen light element number ended up with her being welcomed to the Aurora Knight corps with fanfares.</p><br/><p>“I heard about her becoming a light hero, just in the time when I failed my first entrance exam to the Ignis Militant corps. Do you understand? Do you understand how vexed I felt at that time?! I was a lot more straightforward, aimed directly to become a hero, and became a hero! Entering the Ignis Militant corps after my third try, I gained strength under the gruelling training of my superiors, obtained achievements from a great number of battles, was acknowledged by everyone, and finally became a hero! That’s the fire hero, Katack Mirack!” (Mirack)</p><br/><p>“What does that have to do with why you can’t get along with Karen-san?” (Haine)</p><br/><p>“It does. I am a real hero that climbed with effort. She is a fake hero that was given her position carefreely only because of her talent! There’s no way a fake hero and a real hero can get along!” (Mirack)</p><br/><p>The sound of a slap resounded in the place.</p><br/><p>Mirack who was slapped in the cheek looked back at me dumbfounded, the person who slapped her.</p><br/><p>“Mirack, it is wonderful that you worked hard to reach your objective and managed to show results. The growth of humans is exactly the repeat of this. You did your best and became a hero, that’s of course something amazing.” (Haine)</p><br/><p>But…</p><br/><p>“Excessive effort will always bring forth strain somewhere. At the very least, there’s definitely no way that a real hero and a fake hero can be decided by the amount of effort they put in. Then, what’s the real line that decides whether you are a real or a fake? As long as you don’t understand that, Mirack, you are the fake hero.” (Haine)</p><br/><p>Saying what I had to say, I run off.</p><br/><p>At the front, the fight still continues. But well, it is a situation where the light protective wall of Karen-san is somehow managing to stop the sweltering heat that the monster is releasing.</p><br/><p>In this time when attacks don’t work at all, there’s no way to turn the situation.</p><br/><p>And so, I stick to the back of Karen-san.</p><br/><p>“Haine-san?! You can’t come. This place is dangerous!!” (Karen)</p><br/><p>“Let’s retreat, Karen-san! Mirack-san had us fight it knowing full well from the beginning that you wouldn’t be able to defeat it! It seems like there won’t be any damage even if we leave it alone so, there’s no point in fighting it!” (Haine)</p><br/><p>“No, there is!!” (Karen)</p><br/><p>She said it so firmly that I couldn’t say anything back.</p><br/><p>“Such a giant monster, just its mere existence is an incredible threat! It might not be attacking people right now, but what about tomorrow? The day after, after years later?! In order to prevent damage before it happens, this is our chance!” (Karen)</p><br/><p>“Chance?! Right now?!” (Haine)</p><br/><p>“That’s right. The fire and light heroes fighting together, that has never happened before! Right now she is stepping back in order to gauge my strength, but she will definitely come to my rescue!” (Karen)</p><br/><p>Karen-san still believes in Mirack.</p><br/><p>And she has no intentions of stepping back. Because in the place where she would retreat, there’s the weak people that she had resolved to protect after all.</p><br/><p>“…Karen-san, please listen.” (Haine)</p><br/><p>“Eh?”</p><br/><p>“They say that that monster’s skin is steel itself, but there’s no way that’s true. If all its body were hard as steel, it wouldn’t be able to move its body. The joint areas like the legs and the neck will definitely have some sort of opening for mobility, which must be softer.” (Haine)</p><br/><p>“…Then, if we aim at those places!” (Karen)</p><br/><p>Karen-san acted fast. She ran around the big monster in an instant.</p><br/><p>“I found it! There really was!” (Karen)</p><br/><p>The space that connects the legs with the body. A deep wrinkle that is between the steel hardened skin. It is like an opening similar to that of helmets.</p><br/><p>There’s no doubt it is an opening that exists in order to move the hardened skin.</p><br/><p>“Okay. Aiming at that opening…!” (Karen)</p><br/><p>The moment Karen-san took her stance.</p><br/><p>The skin of the monster once again leaks out sweltering heat, and that heat attacks Karen-san and I.</p><br/><p>“Kyaa!! This can also attack?!” (Karen)</p><br/><p>“[Dark Matter, Set]!” (Haine)</p><br/><p>The dark matter that comes out from both of my hands. Fine particles come out in numbers of millions to form a black current and it receives the heat, perfectly shutting it out.</p><br/><p>The dark matter that can absorb all elements and negate them was able to serve as a defensive wall plenty well, and the wave created was less compared to the time it was blocked with the light wall.</p><br/><p>“Haine-san?! What was that power?!” (Karen)</p><br/><p>“Don’t mind it right now! Just attack that thing aiming at the opening!” (Haine)</p><br/><p>Of course, it would be easy to counter with my dark matter. But that won’t do.</p><br/><p>In this world, defeating the monsters and bringing hope to the people is the role of the chosen heroes.</p><br/><p>That’s what a real hero is.</p><br/><p>“…Yes!” (Karen)</p><br/><p>Accepting it, Karen-san once again concentrates light divine power into her holy sword.</p><br/><p>“This small opening…a ‘Holy Light Blade’ won’t be able to get it. I have to make it smaller, and concentrate the power even more!!” (Karen)</p><br/><p>Thrusting the tip of the sword to the front, she positions it as if she were aiming with a bow.</p><br/><p>“Now! Haine-san, undo the black wall!” (Karen)</p><br/><p>Following the words of Karen-san, I stop the emission of my dark matter, and in that instant when the heat was about to reach Karen-san…</p><br/><p>“[Holy Light Blade]!” (Karen)</p><br/><p>The holy sword stretched, accurately speaking, the light divine power stretched from its tip, and it slipped right inside the opening of the fire cow’s joint.</p><br/><p>“Pierce a soft spot!” (Karen)</p><br/><p>“Bumooooooo!!”</p><br/><p>For the first time, the pained cry of the fire cow was heard.</p><br/><p>At the same time, a massive amount of heat was released.</p><br/><p>I once again emit dark matter from one hand, and with the other, I hold Karen-san and take shelter.</p><br/><p>“Incredible! Haine-san, it worked!” (Karen)</p><br/><p>“It finally did. Then, this time, let’s search for more opening and—?!” (Haine)</p><br/><p><i>(…What are you doing, damn humans.)</i></p><br/><p>“?!”</p><br/><p>Suddenly, a voice rings inside my head.</p><br/><p>There’s no reaction from Karen-san who is right by my side. Then, I am the only one who hears it?</p><br/><p>(But, it looks like there’s one mixed in that’s not a human. It has been long since I have seen dark matter. 1,600 years long, that is.)</p><br/><p>Where?! Who is talking?!</p><br/><p>Aside from the people I know, there’s no presence of anyone else around. Because of that fire cow, this is a naked mountain without a single blade of grass. There’s no way there’s someone hidden.</p><br/><p>No, there’s one.</p><br/><p>Another one aside from Karen-san, Mirack, and I that is in this place.</p><br/><p>The bright red eyes of that fire cow that are staring right at me by turning its gigantic neck.</p><br/><p>(I will never forget it. Even when you are in the same position as a God like us, you went against the very meaning of it; the traitor. Emitting dark matter, moreover, being able to freely control it; there’s only one who can do that.)</p><br/><p>That voice…is it coming from the fire cow Phalaris?</p><br/><p>The thought waves that were directly resonating in my body. On top of that, this voice sounds familiar. The tone, its sound; it overlaps with one of the five Gods that I separated from 1,600 years ago.</p><br/><p>(That’s right. Long time no see, Dark God, Entropy.)</p><br/><p>Then, you really are…this monster is…</p><br/><p>……One of the five Gods of creation, the Fire God, Nova.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-18-19-young-day%E2%80%99s-farewell\" id=\"prev_chap\" title=\"Chapter 18-19 - Young day’s farewell\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-23-24-fire-god\" id=\"next_chap\" title=\"Chapter 23-24 - Fire God\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236254\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}