{"title": "Chapter 73-75 - Underworld down-slope", "id": 73, "volume": 1, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-73-75-underworld-down-slope", "volume_title": "Volume 1", "body": "<h1>Chapter 73-75 - Underworld down-slope</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 73-75: Underworld down-slope</h4></header></p><div class=\"entry-content\"><br/><p>And then, night came.</p><br/><p>“Now that it has become a lot easier to act here, let’s move!” (Karen)</p><br/><p>Karen-san stands up filled with energy.</p><br/><p>She is fully charged after sleeping.</p><br/><p>Compared to that, Yorishiro and I were in a questionable state.</p><br/><p>“…What’s wrong, you two?” (Karen)</p><br/><p>“No…” “It’s nothing.”</p><br/><p>It is because Yorishiro said something like that.</p><br/><p><i>‘When you learn about the evils I have done in the time you weren’t there, you would definitely end up hating me.’</i></p><br/><p>Since the time she said that, the atmosphere between Yorishiro and I has become somewhat complicated.</p><br/><p>It is true that I don’t know anything about the things that happened in the 1,600 years I was sealed.</p><br/><p>It is way too long of a time to call it a blank.</p><br/><p>In that time, several millions of humans must have died and more must have been born.</p><br/><p>In this period of time where I was not there, she has been living on. As a God that transcends humans.</p><br/><p>“…It is here.” (Yorishiro)</p><br/><p>Even within this complicated atmosphere, Yorishiro properly does what has to be done.</p><br/><p>The place where the light needle points at, is precisely the place where we are standing.</p><br/><p>“But…” (Haine)</p><br/><p>“There’s nothing here.” (Karen)</p><br/><p>Karen-san and I look at our surroundings, but it is all sand.</p><br/><p>Not only a city, there’s not even a single sign of anything around.</p><br/><p>“It is okay…… Haine-san.” (Yorishiro)</p><br/><p>“Hm?”</p><br/><p>“Go ahead.” (Yorishiro)</p><br/><p>It is sad that I can understand what I have to do from just those few words.</p><br/><p>“[Dark Matter, Set]” (Haine)</p><br/><p>Along with my voice, dark matter coils around my hands.</p><br/><p>Reversing the gravity of it, I make it so it creates a repulsive force…and release it.</p><br/><p>With that repulsive force between materials, the light sand was blown away and scatters.</p><br/><p>And then, what appeared below that was…</p><br/><p>“Oh?!”</p><br/><p>No matter how you see it, it can only be seen as something manmade.</p><br/><p>“Amazing! What’s this?” (Karen)</p><br/><p>“A stone…slab? Gate? Lid?” (Haine)</p><br/><p>At any rate, it is incredibly flat and big. It is no doubt made of stone, but the detailed carvings at the surface were eloquently indicating that this is made by humans.</p><br/><p>“To think something like this was buried under the sand!!” (Karen)</p><br/><p>But we still don’t know what in the world it is.</p><br/><p>This beautifully carved stone slab is big enough that all three of us could easily lie down on it with space to spare, moreover, the part that bothers me the most is that there’s a gap right in the middle of it that runs all the way from bottom to top.</p><br/><p>There’s no doubt it can open.</p><br/><p>As I thought, this really is a gate.</p><br/><p>A gate that divides the surface and the underground.</p><br/><p>The problem is how to open it…is what I was thinking when…Yorishiro approaches the gate, places her hand on it, and pours light divine power into it.</p><br/><p>The carvings that were engraved on the surface had light divine power pass freely through them.</p><br/><p>And then…</p><br/><p>*Rumble rumble rumble*, the gate opens on its own.</p><br/><p>“?!!”</p><br/><p>“This is…?!” (Karen)</p><br/><p>Karen-san and I were so awestruck that we couldn’t say anything.</p><br/><p>What was after the opened stone gate were stairs. Moreover, stairs leading underground.</p><br/><p>“Now then, let’s go.” (Yorishiro)</p><br/><p>Yorishiro advances.</p><br/><p>We also hurriedly follow behind her.</p><br/><p>I wonder how far below these stairs lead to.</p><br/><p>We were already underground, and adding that it is night, it was so dark that I couldn’t even see my own hands.</p><br/><p>“Karen-san, make a light.” (Yorishiro)</p><br/><p>“Y-Yes!” (Karen)</p><br/><p>Karen-san gets startled, and from her waist, a clattering sound is made. So she unsheathed her holy sword, Saint-George.</p><br/><p>“Pour a bit of light divine power and…” (Karen)</p><br/><p>By doing that, the holy sword lightens up dazzlingly, and the stairs are light up as if it were broad daylight.</p><br/><p>The light divine power is convenient.</p><br/><p>“Hey! Hey, Yorishiro!” (Haine)</p><br/><p>I also take out my ethereal flashlight and chase after Yorishiro who continued going down.</p><br/><p>“You…haven’t you been weird for a while now?” (Haine)</p><br/><p>“What is?” (Yorishiro)</p><br/><p>“What, you ask. After all the events that are occurring, you are not getting fazed at all.” (Haine)</p><br/><p>We removed the sand, found the gate, opened the gate, and continued on; every single one of them was brought by Yorishiro, but there wasn’t a single sign of hesitation as she did those.</p><br/><p>That was as if…</p><br/><p>“It is as if I knew everything from the beginning?” (Yorishiro)</p><br/><p>“As I have said before, don’t read my mind.” (Haine)</p><br/><p>“That might be the case-desu wa. The location of the Underworld country, where to enter, how to open the door; if I knew everything from the beginning, it would be a given that I would know about those things, wouldn’t I?…And what will be happening after as well.” (Yorishiro)</p><br/><p>“?!”</p><br/><p>At some point in time, there were no more stairs.</p><br/><p>And then, the place we arrived at was a big space like that of a hall.</p><br/><p>Moreover, at that place…</p><br/><p>“There’s someone?” (Haine)</p><br/><p>A black shadow is standing right at the center of the hall.</p><br/><p>It wasn’t some sort of metaphor, it really was black, and its outline was so blurred that I could only call it a shadow. It was barely maintaining the shape of a human.</p><br/><p>But it was by no means human.</p><br/><p>“Monster?!” (Karen)</p><br/><p>Karen-san also noticed the abnormality and takes a battle stance.</p><br/><p>But that’s not right. That’s not a monster.</p><br/><p>Monsters are pseudo-living beings that were created by hardening divine power. You can’t sense the oscillation of the soul inside a hollow existence like them.</p><br/><p>But that shadow…I can certainly feel it.</p><br/><p>It is travelling through the space here and reaching clearly to me…the cadence of a soul.</p><br/><p>“I-I am…”</p><br/><p>The shadow speaks.</p><br/><p>With only that part alone you can tell that it differs from monsters.</p><br/><p>But the thing that truly surprised me was not there, it is what it said next.</p><br/><p>“I am the Dark God…Entropy…”</p><ul><li>74: Shadow</li></ul><br/><p>“I am the Dark God…Entropy…”</p><br/><p>The shadow repeats the same thing.</p><br/><p>But, what’s the meaning of this?</p><br/><p>There’s no way that thing is the Dark God Entropy. The real Dark God Entropy is right here after all.</p><br/><p>“Dark God… Is it saying that this one is the Dark God Entropy-sama?!” (Karen)</p><br/><p>Karen-san had also fallen into confusion.</p><br/><p>The objective of this journey…moreover, the target that we shouldn’t have been able to find…has appeared right in front of our eyes after all.</p><br/><p>“I…have never seen a God with my own eyes though. But it is certainly not a human, and now that I look carefully, it is different from a monster as well. Then, is it really a God?!” (Karen)</p><br/><p>No, it isn’t. Karen-san’s judgement is wrong.</p><br/><p>It is true that this isn’t a human or a monster. But even so, it is rash to call it a God.</p><br/><p>Specially the Dark God Entropy, there’s no way.</p><br/><p>The reincarnation of the Dark God is right here after all.</p><br/><p>As long as I am the Dark God, there’s no way that this one is the real one.</p><br/><p>Then, what is this thing that’s calling itself with my name?</p><br/><p>At the very least, it knows the name Entropy. With only that, it turns into a hard to ignore mystery.</p><br/><p>I am supposed to be a hidden God that was sealed 1,600 years ago and no one knows of.</p><br/><p>“…”</p><br/><p>Karen-san and I were confused, but when I take a sidelong glance at Yorishiro, I could see that only she was calm.</p><br/><p>What should we do in this situation?</p><br/><p>Unable to read the situation, we couldn’t make a careless move.</p><br/><p>The one who moved the situation was that…the dark shadow.</p><br/><p>“I am…the Dark God…Entropy.”</p><br/><p>“Eh?!”</p><br/><p>The figure, that was barely maintaining the human silhouette, crumbled, and moves quickly in a form like that of a thick line.</p><br/><p>And the place that it was moving to was…</p><br/><p>“Karen-san! Watch out!” (Haine)</p><br/><p>“Eh?!”</p><br/><p>Right before it was about to hit her, the holy sword repels the lunging shadow.</p><br/><p>Good, she properly guarded from that. But…</p><br/><p>“As I thought, it really is an enemy!” (Haine)</p><br/><p>That’s what it must mean if that thing attacked us.</p><br/><p>It still is an existence that’s filled of enigma, but there’s no choice but to fight back.</p><br/><p>“[Dark Matter, Set]!” (Haine)</p><br/><p>Several thousands, several millions of jet black particles spring forth from both of my arms, become a mass, and create a black swirl.</p><br/><p>This is a brutal swirl formed of dark matter that erases earth, water, fire, and wind the moment it makes contact with them.</p><br/><p>Moreover, it also possesses a second property that is gravity control. Even against things that are not composed of divine power, it still possesses strong suppression power.</p><br/><p>“Eat this!!” (Haine)</p><br/><p>I release the black swirl towards the black shadow.</p><br/><p>Now, what will you do? Even if it’s a lie, you are calling yourself the Dark God. Show me how you are going to deal with the dark matter!</p><br/><p>But the shadow didn’t confront the dark matter directly, it turned long and narrow and jumped away.</p><br/><p>“Damn it, escaping?!” (Haine)</p><br/><p>Moreover, those movements are a lot more agile than I expected.</p><br/><p>If it leaves the range of the light that Karen-san’s holy sword is creating, the human eye is unable to keep up with its speed.</p><br/><p>“I will assist you, Haine-san! I will add a bit more light divine power, and…!” (Karen)</p><br/><p>Karen-san increases the amount of light divine power she is pouring in the holy sword.</p><br/><p>When she does that, the blade releases even more light, and lights up an even larger sphere.</p><br/><p>Okay, with this, even if the shadow escapes far away, we will still be able to see it without losing sight of it.</p><br/><p>“You can’t! Karen-san!”</p><br/><p>At that moment, a strained scream resounds. The one who let out that voice was…</p><br/><p>“Yorishiro?!”</p><br/><p>Yorishiro, who has been acting calm all this time as if she knew everything, was suddenly agitated.</p><br/><p>But I didn’t have the time to think about this.</p><br/><p>That shadow had turned into a line as it springs around, and attacks Karen-san.</p><br/><p>“Ei!”</p><br/><p>Karen-san once again deflects it with her holy sword and avoids a direct hit.</p><br/><p>But, why did the shadow suddenly change its target to Karen-san?!</p><br/><p>“What’s this all of a sudden?! ………But as a hero, I just have to shake off the sparks that come flying.” (Karen)</p><br/><p>“Karen-san!” (Haine)</p><br/><p>“Haine-san, please leave this to me, you protect Yorishiro-sama! In this narrow underground, I can’t utilize the wide-ranged ‘Holy Light Sword’. In that case, I will concentrate the light divine power into one spot and…!” (Karen)</p><br/><p>She adjusts the aim with the tip of her holy sword, and…shoots.</p><br/><p>“[Holy Light Line]!!” (Karen)</p><br/><p>The blade of the holy sword turns into light and stretches.</p><br/><p>Accurately speaking, it is a line shaped divine power that was shot out from the holy sword, and it looked as if the blade itself had stretched.</p><br/><p>That light thorn pierces through the shadow that was moving around at high speed.</p><br/><p>“Yay! I hit it!” (Karen)</p><br/><p>To think she would be able to hit it in one go against a target that was making such crazy movements, as expected of a hero.</p><br/><p>But…</p><br/><p>“You can’t! This is not good!” (Yorishiro)</p><br/><p>Yorishiro screams once again.</p><br/><p>“It is not that the attack hit the target, that child went itself to be hit! You can’t give light divine power to that child!” (Yorishiro)</p><br/><p>By the time we noticed something was wrong, it was already too late.</p><br/><p>After receiving a direct hit from the attack of Karen-san, we thought that it would get injured and weaken, but those expectations were betrayed.</p><br/><p>It was the complete contrary.</p><br/><p>“I am…the Dark God…Entropy.”</p><br/><p>The shadow…consumed Karen-san’s attack and became bigger!</p><ul><li>75: Underground Battle</li></ul><br/><p>“What…is this?!” (Karen)</p><br/><p>Karen-san who was the very person that attacked was surprised by the unexpected situation.</p><br/><p>This attack that she released intending to damage or kill it, actually made it even livelier. Of course she would be surprised.</p><br/><p>Is it correct to call it livelier?</p><br/><p>At any rate, that shadow devoured the light divine power of Karen-san and was rapidly growing bigger.</p><br/><p>It is already three times bigger than before.</p><br/><p>It may be my imagination but, it looks like that jet black color covering its body had grown even thicker as well.</p><br/><p>“Karen-san! Stop your attack! It will become bigger and bigger!” (Haine)</p><br/><p>“Eh?! Okay!” (Karen)</p><br/><p>With all that surprise, Karen-san had forgotten to stop her ‘Holy Light Line’, but after being shouted by me, she stops pouring divine power.</p><br/><p>But by the time she did that, the shadow had already grown big enough to look down on us.</p><br/><p>“It ate the light divine power… is how I should take this sight as, right?” (Haine)</p><br/><p>I infer this from the occurrence in front of me.</p><br/><p>With the light divine power attack that Karen-san released as the trigger, it grew in such a splendid manner, so I don’t think there’s any other reason…</p><br/><p>But, is that even possible?</p><br/><p>“Light…making the darkness bigger? That normally would never happen.” (Haine)</p><br/><p>“I-Is that so?!” (Karen)</p><br/><p>Preparing ourselves for the attack of the shadow that would be resuming, we gather at one location.</p><br/><p>Karen-san probably thinks that her mistake worsened the situation, she looks like she is sorry. I answer that question of hers with the intention of lessening that feeling of hers as well.</p><br/><p>“The Dark element…the dark matter is a substance that can erase any element unconditionally. Earth, water, fire, wind; in the face of the Dark element, they are all powerless. But, there’s an exception.” (Haine)</p><br/><p>“The light divine power.” (Yorishiro)</p><br/><p>Yorishiro takes over and speaks.</p><br/><p>“Haine-san looks like he is invincible at a glance, but the only weakness of the dark matter is the light divine power. The only element that the dark matter can’t erase is light, and on the contrary, the darkness is the one that gets erased.” (Yorishiro)</p><br/><p>Yorishiro sends me a gaze, and I understood what she was trying to say. I let out a small amount of dark matter.</p><br/><p>When Yorishiro hits this dark matter with her own light divine power, the dark swirl scatters and disappears like bubbles. There was not a single sign of resistance.</p><br/><p>“Waa?!”</p><br/><p>Seeing this, Karen-san was honestly surprised.</p><br/><p>“The four base elements have a rotation of weak points within their own group. Darkness is the natural enemy of all of them, and Darkness can’t win against Light. Moreover, Light is slightly stronger than all the four base elements which is an unreliable advantage.” (Yorishiro)</p><br/><p>“In other words, it creates a bigger cycle of affinities.” (Haine)</p><br/><p>Since I have not been fighting against light, I had completely forgotten about it.</p><br/><p>If it’s the ‘Holy Light Bullet’ of Captain Vesage that’s on the level of a small grain, I can still manage, but when it comes to a certain level of skill, darkness absolutely can’t defeat light.</p><br/><p>This is the biggest reason as to why I lost in the battle of Gods 1,600 years ago.</p><br/><p>“But that’s exactly the reason why that shadow is abnormal.” (Haine)</p><br/><p>The shadow was courteously waiting as we were in the middle of explaining.</p><br/><p>It looks like it is adapting to its sudden gigantification and it is taking its time to do it.</p><br/><p>“I am…the Dark God…Entropy.”</p><br/><p>While at it, it repeated the same thing.</p><br/><p>Does it like introducing itself that much?</p><br/><p>“The light divine power is supposed to be a deadly poison, and yet, it instead got bigger. It is the very definition of an existence outside of common sense! Ah, but, if that shadow is truly a God, common sense wouldn’t apply in the first pl—” (Karen)</p><br/><p>“No, that can’t be.” (Haine)</p><br/><p>I am the actual Dark God, and yet, common sense still applies to me.</p><br/><p>In the first place, that guy is not a God. Probably.</p><br/><p>“At any rate, as long as light doesn’t work on it, Karen-san, please step back.” (Haine)</p><br/><p>And then, I step forward.</p><br/><p>“If it’s the same element, the one with the stronger power wins. This is the natural rule. I wonder if it will see my dark matter as delicious food as well. Let’s have it relish plenty.” (Haine)</p><br/><p>Dark Matter, Set.</p><br/><p>With a fist clad with dark matter, I try hitting the giant shadow but…</p><br/><p>“It ran away again!” (Haine)</p><br/><p>Does that thing not have any intentions of fighting me?</p><br/><p>Even when it has become bigger, it is still agile. While evading my attacks, it circumvents me and yet, not even giving me an eye, it rushes forward.</p><br/><p>Its destination was…</p><br/><p>“Karen-san! Yorishiro!” (Haine)</p><br/><p>That bastard, just how much does it aim for women?!</p><br/><p>No, that’s not it. Its objective is the light divine power that Karen-san and Yorishiro release.</p><br/><p>Now that I think about it, that thing has been aiming for Karen-san persistently from the very beginning. Karen-san, who has been lighting up the pitch black underground with her holy sword.</p><br/><p>That thing probably aims for the light users in order to eat their divine power and make itself bigger.</p><br/><p>“Run, you two!” (Haine)</p><br/><p>I hurriedly tried to chase after it, but I can’t make it in time.</p><br/><p>“Kugh!”</p><br/><p>Karen-san also takes a stance with her holy sword, but she can’t do anymore than that.</p><br/><p>If she attacks with her light divine power, she already knows that it will only make it livelier, and she has no other method of attacking.</p><br/><p>Even if she runs away with Yorishiro, it wouldn’t go as she wants.</p><br/><p>“…As I thought, it would be better to get away once-desu wa ne.” (Yorishiro)</p><br/><p>Is what Yorishiro says.</p><br/><p>‘What is she going to do?’, the moment I thought this…</p><br/><p>“[Holy Light Destruction Formation]” (Yorishiro)</p><br/><p>The floor at the foot of Yorishiro had several cracks appearing, and from those cracks, light leaked out.</p><br/><p>The next moment, the floor crumbled along with a thunderous sound and turned into small pieces.</p><br/><p>“Uwaaa?!!!”</p><br/><p>“Kyaaaaa!!!”</p><br/><p>In other words, our footing had been lost suddenly, and while Karen-san and I raised screams, we had no choice but to continue falling.</p><br/><p>It looks like this hall had a lower level, and there, a deep space was spread around.</p><br/><p>I feel like we will be falling for a while.</p><br/><p>I could utilize the gravity reversal of the dark matter to float, but there was something I had to prioritize.</p><br/><p>“Like hell I will let you!” (Haine)</p><br/><p>In order to restrain the shadow that was still persistently aiming at both Karen-san and Yorishiro, I jostle with it and choose to fall together with it.</p><br/><p>“I am…the Dark God…Entropy.”</p><br/><p>“So annoying! Is that all you can say?!” (Haine)</p><br/><p>On the other hand, the presence of Karen-san and Yorishiro steadily grew further away.</p><br/><p>That’s fine. That’s exactly what you were planning on doing right, Yorishiro?</p><br/><p>In the time you are away, I will defeat this guy!</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-70-72-to-the-desert\" id=\"prev_chap\" title=\"Chapter 70-72 - To the desert\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-76-77-country-at-the-depths-of-the-earth\" id=\"next_chap\" title=\"Chapter 76-77 - Country at the depths of the earth\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236274\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}