{"title": "Chapter 98-99 - Divine Virtue of Mother Earth", "id": 98, "volume": 1, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-98-99-divine-virtue-of-mother-earth", "volume_title": "Volume 1", "body": "<h1>Chapter 98-99 - Divine Virtue of Mother Earth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 98-99: Divine Virtue of Mother Earth</h4></header></p><div class=\"entry-content\"><br/><p>Translator: Hey guys, as you can see, the release schedule is beginning to turn really weird. So I have decided on placing a clear indicator in the website that will be stating which story the next scheduled chapter will be of.</p><br/><p>Hope this alleviates a bit of the confusion in my whimsical releases.</p><br/><p>I will also be posting this announcement in the future chapter of Tsuki so everyone is on the know about this.</p><br/><p>At any rate, enjoy the chapters </p><hr/><br/><p>“I am not really concerned with what happened 1,600 years ago. I told that to the other guys as well though.” (Haine)</p><br/><p>Like hell I will remember all the resentments I had in the past.</p><br/><p>“B-But Nova-san and Coacervate-san…” (Mantle)</p><br/><p>“Those guys pissed me off at present, so I beat them up. The problem was in the present. Or could it be that you are currently doing something in the present progressive sense that would piss me off?” (Haine)</p><br/><p>“Ah eh…oboboboboboboo~~!!” (Mantle)</p><br/><p>She got extremely suspicious.</p><br/><p>Her shaken state is not simply at the level of easy to read.</p><br/><p>“Ah, is it that? The issue about monsters?” (Haine)</p><br/><p>“T-T-That was something I was told by the others to do, I had no choice! I couldn’t do anything about it! I was also lacking in prayer energy and was drying up, so there was the need of a method to break through… And if I were to oppose by myself, I might get estranged. And Inflation-sama withdrew by herself without telling me anything~~!!” (Mantle)</p><br/><p>“That’s why you agreed with Coacervate and created monsters?” (Haine)</p><br/><p>“Yes…but…” (Mantle)</p><br/><p>Mantle does a cute gesture of placing both of her right and left index fingers together and moving them slightly up and down.</p><br/><p>“I actually…hate disputes. I honestly didn’t want to fight in the battle 1,600 years ago. I didn’t want to destroy the Underworld Country either. But, if I opposed it, it might have turned Nova-san, Coacervate-san, and Quasar-san against me, so…I did it against my will…” (Mantle)</p><br/><p>“So going against me was okay?” (Haine)</p><br/><p>“Because you know, Entropy-san is kind so…you might forgive me if we were to talk it out…” (Mantle)</p><br/><p>Uwa…</p><br/><p>Don’t peek at me with that upward glance of yours. If you do an upward glance with such a big body, you will naturally end up bend down incredibly low.</p><br/><p>“That’s why I decided on opposing this time. I did agree on creating monsters, but as I thought, I don’t want any strife.” (Mantle)</p><br/><p>That statement of Mantle made a number of pieces fall in place.</p><br/><p>“Hence, the Golems huh.” (Haine)</p><br/><p>Even when they are monsters, they don’t attack humans.</p><br/><p>Not only that, they follow the orders of humans, help out on the work of humans, and are cohabiting with humans.</p><br/><p>That reason was directly related to the main principle of the Mother Earth God.</p><br/><p>“No, wait. Let’s arrange the information.” (Haine)</p><br/><p>I only came all the way to the giant tree to investigate since I thought there was something strange about it, but the one that came out was the one who held all the answers, Mother Earth Mantle.</p><br/><p>Moreover, she keeps talking on and on about information that sounds truthful.</p><br/><p>If I stay spaced-out, I feel like I might get buried in this avalanche of info.</p><br/><p>“Even I was troubled, you know?” (Mantle)</p><br/><p>Like I said, don’t go talking so much when I haven’t asked anything yet.</p><br/><p>Moreover, I feel like she is just complaining here.</p><br/><p>“Inflation-sama told me about the prayer energy, and when I tried a taste of it, it was sweet, it was delicious, it was wonderful. I soon ended up captivated by it. I wanted more of it, so I made the Earth Church. A lot of people gathered at the church, a lot of prayers were gathered; it was true bliss. I drunk prayers everyday as if drowning in it. But…before I noticed, the prayers had lessened and…” (Mantle)</p><br/><p>The voice of Mantle was shrivelling up.</p><br/><p>“When I heard from Inflation-sama that: ‘Humans don’t need Gods anymore’, everything went pitch-black. And at the same time, I understood that Inflation-sama had not forgiven us at all for the destruction of the Underworld Country. Nova-san just yelled around, Coacervate-san was grumpy, and when I thought Quasar-san had returned after several centuries, he once again disappeared…” (Mantle)</p><br/><p>Gods that were pushed into despair huh.</p><br/><p>But, if we think about the feelings of Inflation, you can call it an eye for an eye. The grudge she has on them for destroying the Underworld Country she lovingly raised must have been something that seeped all the way down to her bone marrow.</p><br/><p>She even entrapped Mantle, who was reluctant about participating and had helped her in sealing the Underworld Country, without showing any mercy or pity.</p><br/><p>“We had to do something. Right now, we can’t maintain ourselves properly without prayers after all.” (Mantle)</p><br/><p>Hence, the monsters.</p><br/><p>The villains that were made to create the necessity of a God in humans.</p><br/><p>By having those monsters and the warriors of the Church fight, they get the humans to feel grateful for the Gods, and they offer prayers to them. But there was one God that didn’t do that; the one right here.</p><br/><p>“…I hate fights after all…” (Mantle)</p><br/><p>Mantle says this dejected.</p><br/><p>“That’s why you created monsters and did the opposite huh. Rather than having monsters attack humans, you earned their faith by helping them. It is clearly transmitted to the humans that the Golems and Grandma Wood were dispatched by a God after all.” (Haine)</p><br/><p>“That’s right! This went unexpectedly well, you know!” (Mantle)</p><br/><p>Not only did she stop crying, she actually made a complete 180° and approaches me.</p><br/><p>Drastic mood-swings is also one of the traits this God has.</p><br/><p>“‘Golems are the blessing of God’, ‘Thank you for your divine protection’, they say. A lot of people gave me their gratitude! I was deeply moved! Thanks to that, a lot of prayers gathered. And most importantly…it makes me happy to receive the gratitude of someone. It reaaaally makes it worth doing! So this is how it is to work as a God!!” (Mantle)</p><br/><p>“I understand! I understand, so calm down!!” (Haine)</p><br/><p>What should I do? I am beginning to think that Mantle is saying something very reasonable.</p><br/><p>In order to maintain her own existence, she requires the prayers of humans, and for that sake, she provided the divine protection in the form of Golems to humans.</p><br/><p>The humans understand that this is the blessing of a God, and in order to return the favor, they offer prayers of gratitude.</p><br/><p>A give-and-take relationship is properly formed, moreover, Mantle is genuinely joyful that she receives the gratitude of humans.</p><br/><p>Is there a more healthy relationship between humans and God?</p><br/><p>This crooked existences called monsters…to think that depending on the way they are implemented, they can actually provide good influence.</p><br/><p>The ethereal, which is the main cause of the prayers decreasing, has not permeated that deeply in Ishtar Blaze because it is filled with the working force that are Golems.</p><br/><p>…Eh?</p><br/><p>I feel like there’s no gaps?</p><ul><li>99: Decision</li></ul><br/><p>“And so, uhm…”</p><br/><p>I was on top of the big tree, continuing the conversation with Mother Earth Mantle.</p><br/><p>“Didn’t the other Gods say anything about your way of doing things? Like Nova and Coacervate maybe?” (Haine)</p><br/><p>“They did. They said things like ‘your method is dirty’ and ‘don’t you have pride as a God?’, Being told those things really hurt me; it made me want to cry. But surprisingly, they didn’t go further than that. And there was no forcing from their part either.” (Mantle)</p><br/><p>Within the five Gods of Creation, the ones against the monster plan wasn’t only Mantle; the Light Goddess Inflation rejected the very idea of creating them.</p><br/><p>If they were to criticise Mantle heavily, it would naturally force them to direct this criticism at Inflation as well, and if that were to happen, they wouldn’t be able to control the situation.</p><br/><p>The only one from the five Gods that didn’t enter in the machinations of the four Base Elements, the Light Goddess Inflation. The two poles are by nature on a different level from the four Base Elements, so in order to defeat Inflation, they would have to gang up on her with all four Base Elements.</p><br/><p>If going against Inflation meant they would have to go against Mantle as well, the ones going against Inflation wouldn’t have a one in a million chance to defeat her.</p><br/><p>If Mantle calculated all this and showed the first signs of opposition based on this, it would mean that, despite her looks, she is a schemer, but…</p><br/><p>“Fuh…”</p><br/><p>There’s no way she thought that far -definitely.</p><br/><p>“…..”</p><br/><p>After thinking for a bit, I decided on saying it.</p><br/><p>“Hey, Mantle.” (Haine)</p><br/><p>“Fueh?”</p><br/><p>“The reason I came here was to…destroy Grandma Wood.” (Haine)</p><br/><p>“Fuuueeeeeeeeee?!” (Mantle) &lt;she is actually saying ‘Fuh?’ but if I prolong it, it will sound as ‘FUUUUUUUU—!’, and that’s not cute at all in english context, so I went for the ‘Fue’ that fits her character&gt;</p><br/><p>As expected, Mantle reacted with a scream.</p><br/><p>“The influence of Gods shouldn’t be left in this world anymore. That’s why I decided on destroying the very materialization of the Gods’ influence, the monsters. For that sake, what has to be done is to defeat all of the Mother Monsters that serve as the origin of them all.” (Haine)</p><br/><p>“Fue…”</p><br/><p>For a while now, Mantle has only been saying ‘fue’.</p><br/><p>“And so, I decided on dealing with the Earth Mother Monster -Grandma Wood- which I knew of its exact whereabouts. That’s why I am currently here.” (Haine)</p><br/><p>“T-Then, you will be…” (Mantle)</p><br/><p>I will be hitting Grandma Wood with the dark matter.</p><br/><p>In reality, most attacks would be rended useless against this giant tree of humongous mass, but if it’s my dark matter, it should be able to manage somehow.</p><br/><p>“Uhm…what about mercy? Is there no room for mercy?” (Mantle)</p><br/><p>A God is begging for mercy from a God.</p><br/><p>“Well…” (Haine)</p><br/><p>And I was troubled by how to respond.</p><br/><p>I already understand.</p><br/><p>I decided on defeating the Mother Monsters in order to remove this existence that only harms humans…but once I arrived at the place and took a look at the Mother Monster, I ended up thinking ‘taking this away will actually harm the humans’.</p><br/><p>I don’t know about the other three, but at the very least, that’s how I think with this Grandma Wood.</p><br/><p>A giant tree that brought a symbiosis between humans and monsters and is called with respect by the people as ‘Great Pillar-sama’.</p><br/><p>Just how much would it hurt the people of Ishtar Blaze if this were to be lost, in a physical and mental sense.</p><br/><p>Is what I am doing…truly the correct thing?</p><br/><p>“……………………I give up.” (Haine)</p><br/><p>After a long silence, I said this.</p><br/><p>“Eh? Eeeeh?!”</p><br/><p>“I will put it on hold! I will leave Grandma Wood for later and prioritize the destruction of the other Mother Monsters!” (Haine)</p><br/><p>I had no other option than to say this.</p><br/><p>What I am doing is all for the sake of humans. If it ends up hurting the humans instead, wouldn’t I be having my priorities backwards?</p><br/><p>“Eh? Seriously? Like, seriously?” (Mantle)</p><br/><p>It looks like Mantle was still dubious about my decision.</p><br/><p>“Seriously. I -Kuromiya Haine- don’t go back on my words.” (Haine)</p><br/><p>“Really, really, really? Yay!! I am so happy!! Thanks, Entropy-san, I like you so much! Want to fondle my breasts? You will, right?! This is the least I can do! Fondle them!!” (Mantle)</p><br/><p>“As I said already, I won’t! Why are you so persistent about it?!” (Haine)</p><br/><p>The happiness of Mantle was overwhelming. She must have been quite happy.</p><br/><p>“No, but you see, Mantle, my impression of you has been shaken.” (Haine)</p><br/><p>“Eh?”</p><br/><p>“I thought you were a Goddess that couldn’t state your own opinion and would get oppressed by the atmosphere at the time. But this Ishtar Blaze that you have made is an Utopia of cohabitation between humans and monsters that I simply can’t find fault in.” (Haine)</p><br/><p>I looked down from the branch of Grandma Wood I am currently standing on.</p><br/><p>I was blocked by the leaves and it can’t be called a clear view, but I could see the big city and farm.</p><br/><p>“This is how humans and Gods should have lived like. Gods would help humans, and humans will be grateful to the Gods; both will seek for each other. This is probably…the world I wanted to make in the Genesis Era.” (Haine)</p><br/><p>“Eh? Uhm…” (Mantle)</p><br/><p>The whole ‘fairy’ body of Mantle is dyed in a light vivid pink color, and that color suddenly turned into a deep vivid one. Like a flower blooming.</p><br/><p>“What?! What’s wrong all of a sudden!” (Haine)</p><br/><p>“That’s…that’s not true. Someone like me…someone like me is just…” (Mantle)</p><br/><p>Her mouth may be denying it, but the expression of Mantle was unable to suppress the smile in her face. She is probably incredibly happy.</p><br/><p>Happy that she has been praised.</p><br/><p>“Someone like me is always being called clumsy and unreliable within the five Gods, and I am always made a fool of… Please don’t flatter me, Entropy-san. I am…an idiot, so I will end up taking those words seriously! Want to fondle my boobs?” (Mantle)</p><br/><p>“I just stated the truth. You are a God that’s sincere and is able to do what has to be done. It may look stupid from the perspective of an underhanded God like Coacervate, but that crooked view of his is a fault of that low-life God anyways. Don’t mind what a guy like that says.” (Haine)</p><br/><p>“! Coacervate-san…” (Mantle)</p><br/><p>Hearing that name, the face of Mantle that was intoxicated by happiness was immediately clouded.</p><br/><p>“Hm? What’s wrong?” (Haine)</p><br/><p>“No! It is nothing! But, this is the first time I was told I am sincere and straightforward. Fufufufu~~” (Mantle)</p><br/><p>But she soon returned to her intoxicated state.</p><br/><p>Getting so happy about it…she most likely doesn’t get praised much.</p><br/><p>“Have more confidence. You are the mother of all the ones that stand on land, the Mother Earth God. What you have achieved in this land is worthy of praise; this Dark God Entropy admits to it. From now on, please continue pouring your affection in this land as the Mother Earth God without changing.” (Haine)</p><br/><p>“Yes! I like you very much, Entropy-san. Being acknowledge this much by someone…this is my first time since the Genesis Era! It made me feel like I have to do something incredible!” (Mantle)</p><br/><p>The motivation of Mantle had increased to the point that it wouldn’t be able to get any higher than this.</p><br/><p>On the other hand, I who decided on ‘defeating the Mother Monsters’ had stumbled right at the very beginning, and I felt pretty shriveled up from that.</p><br/><p>Now then, what should I do from now on…</p><br/><p>Maybe I should return to Apollon City and revise my plan?</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-95-97-sage\" id=\"prev_chap\" title=\"Chapter 95-97 - Sage\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-100-102-heroes-assemble\" id=\"next_chap\" title=\"Chapter 100-102 - Heroes assemble\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236286\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}