{"title": "Chapter 114-115 - Shadow Skill", "id": 114, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-114-115-shadow-skill", "volume_title": "Volume 2", "body": "<h1>Chapter 114-115 - Shadow Skill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 114-115: Shadow Skill</h4></header></p><div class=\"entry-content\"><br/><p>“No way~~! To think the Golem Boy bit the dust sooner than his parents-dasu!” (Sasae)</p><br/><p>Please don’t say it in that way. It pains my heart.</p><br/><p>“The small and weak ones die first. It follows the natural order.” (Doraha)</p><br/><p>And Doraha-san, please stop saying such dry things!</p><br/><p>“…Unforgivable-dasu! Also, this black and evil-looking fighting style, I know now-dasu yo! Yer Kuromiya Haine-dasu na?!” (Sasae)</p><br/><p>Saying this, she points at Doraha-san.</p><br/><p>“…What are you saying?” (Doraha)</p><br/><p>“No need to say more-dasu yo! Evil personification of the Dark God Entropy, yer downfall was you meeting me-dasu! Now that I be here, I will do my best to fulfill the mission Mother Earth God-sama has given to me-dasu yo!!” (Sasae)</p><br/><p>Sasae-chan takes a stance with the earth scythe, Seeta.</p><br/><p>Reacting to the golden light from the blade, the chain that was attached to the end of it separated, and turns human shaped.</p><br/><p>That chain was originally the middle-sized one out of the three Golem.</p><br/><p>“!! The two arms that I cut off have also regenerated!” (Karen)</p><br/><p>Looks like it is true that as long as the core is safe, they can reconstruct themselves as many times as they want.</p><br/><p>“Golem Father, Golem Mother! Parents, Combine!!” (Sasae) &lt;Pick your Power Ranger theme of preference…or a more adult theme, if you know what I mean&gt;</p><br/><p>I feel like you said some incredibly troubling words there, Sasae-chan.</p><br/><p>Obeying that order, the Golem parents overlapped their body, turned into earth, and mix together. They gather more earth from their feet. They become even bigger than when they mixed together, and become big enough to the point that they might even be grabbing the clouds.</p><br/><p>“Mixing two Golems together make it this much bigger?!” (Mirack)</p><br/><p>Mirack-chan looks up in surprise.</p><br/><p>“Huff, huff~~! H-How’s that-dasu ka?! By injecting earth divine power to dah Golems, it becomes a lot buffer than normal-dasu! Requires a lot of juice-dasu ga… Personification of the evil Dark God, Kuromiya Haine! Give up-dasu yo!” (Sasae)</p><br/><p>As I have been saying, that person is Doraha-san, not Haine-san!!</p><br/><p>I didn’t even have the leeway to point that out. That supergiant combined Golem, just by stumbling and falling, it feels as if it would destroy the Light Grand Church.</p><br/><p>“Personification of darkness…” (Doraha)</p><br/><p>“Eh?”</p><br/><p>“…I wonder why. Being told that makes me feel slightly nostalgic.” (Doraha)</p><br/><p>Even when facing that giant, Doraha-san was not showing a single bit of panic.</p><br/><p>That air of composure she has was already turning into a personality trait itself.</p><br/><p>“My heart has nothing, it has no past either, the only thing that fulfills me is the benevolence of Yorishiro-sama who picked me up. But even with that, there’s a number of words that stimulate something that I should have lost already.” (Doraha)</p><br/><p>…Eh? What?</p><br/><p>For some reason, the surroundings have suddenly turned dark. I thought that the sun had been covered by the clouds so I looked up to confirm, but there’s good weather today with no clouds in sight…and yet, it had become dark.</p><br/><p>As if changing drastically from fine weather, to cloudy, cloudy to evening; the surroundings were steadily getting darker.</p><br/><p>“The <i>filthy </i>four Base Element Gods…those guys are the prime things that stimulate me. Every time I hear their names, inexplicable rage wells up inside of me. If they are going to go against me, I will happily become the Dark God Entropy, and just as you wish, cut you into a thousand pieces.” (Doraha)</p><br/><p>“This is bad!” (Yorishiro)</p><br/><p>“Eh?! —–Uwa?!” (Karen)</p><br/><p>The shout of Yorishiro-sama surprised me as well.</p><br/><p>The ground at our feet had been dyed completely black.</p><br/><p>The shadow had expanded to the point that it covered the whole ground.</p><br/><p>The reason why the surroundings had turned dark was because Doraha-san was absorbing the light from the surroundings.</p><br/><p>She was absorbing the light and turning it into the shadow.</p><br/><p>“What is this-dasu? Why you so serious—– Gyoeeeee?!” (Sasae)</p><br/><p>The shadow expanded without limits, and swallowed the giant Golem.</p><br/><p>The opponent didn’t have any time to resist. It sunk in one fell swoop from the legs to the chest, and just like that, it was being swallowed.</p><br/><p>“Hiiiih?! Mah ultimate move Golem is—! In just an instant?!” (Sasae)</p><br/><p>The core didn’t matter anymore at this point. It all disappeared entirely without leaving even dust behind.</p><br/><p>With this, Sasae-chan is now completely helpless.</p><br/><p>“I am…the Dark God Entropy…” (Doraha)</p><br/><p>While chanting that phrase, Doraha-san approaches Sasae-chan.</p><br/><p>“Save me~~!! *Oba-chaaa~n*!!” (Sasae) &lt;Grandma&gt;</p><br/><p>The heart of Sasae-chan broke completely.</p><br/><p>This is already at a stage where we can’t just stay as spectators.</p><br/><p>“Doraha-san, wait!” (Karen)</p><br/><p>I ran and entered in between Doraha-san and Sasae-chan.</p><br/><p>My back facing Sasae-chan and my face towards Doraha-san, in a stance of blocking her way.</p><br/><p>“Fue?!” (Sasae)</p><br/><p>“Doraha-san, the fight has been settled already. Sasae-chan already has no strength to fight back and has no will to oppose anymore!” (Karen)</p><br/><p>Or more like, it has already reached the level of definitely being a trauma for her.</p><br/><p>“Please forgive her already! Fighting more than it is necessary is not something a hero should do!” (Karen)</p><br/><p>But it looks like my voice didn’t reach Doraha-san.</p><br/><p>Her face turned even more jet black, and was about to turn into that shadow.</p><br/><p>“I am…Dark God Entropy…”</p><br/><p>“Okay, that’s as far as you go.” (Yorishiro)</p><br/><p>From behind Doraha-san, Yorishiro-sama hugs her.</p><br/><p>Her plentiful bosom buries the head of Doraha-san.</p><br/><p>“Aw?”</p><br/><p>“I have told you before, right? You are still unstable. If you get too stimulated, you can easily get swallowed by the shadow. It looks like I will have to prepare some countermeasures fast.” (Yorishiro)</p><br/><p>Being hugged by Yorishiro-sama, the rampage of Doraha-san was stopped surprisingly easily.</p><br/><p>Her dangerous expression melted quickly, and the shadow that was covering the ground was also receding.</p><br/><p>“Fufu~, as expected of my hero-desu wa ne.” (Yorishiro)</p><br/><p>“Eh?”</p><br/><p>Being told this, I couldn’t help but get confused.</p><br/><p>I think the one that is impressive is Yorishiro-sama though. Being able to stop the rampage of Doraha-san so easily.</p><br/><p>“It is as expected of you, being able to jump in an instant to save that small hero-san there in her time of need with no hesitation. You already know that your powers don’t work against Doraha at all, and yet, even with that, you didn’t stop.” (Yorishiro)</p><br/><p>“No, well…” (Karen)</p><br/><p>“That action itself is the very proof of your courage. And courage is exactly what makes a hero, that’s what makes others call you a hero.” (Yorishiro)</p><br/><p>Being told that…makes me embarrassed.</p><br/><p>“Courage is the purity that is acknowledged by most. It looks like that heart of yours has already reached a single child.” (Yorishiro)</p><br/><p>“Eh?”</p><br/><p>At that time, I suddenly felt a weight at my waist.</p><br/><p>When I look down, I saw the figure of Sasae-chan hugging me from behind.</p><br/><p>“Ueeee~~!! I was scared-dasu~~!!!” (Sasae)</p><br/><p>Wrapping both of her arms around my waist, she firmly clung onto me. She must have been pretty scared there.</p><br/><p>And like this, the Golem turmoil that occurred at Apollon City had been wrapped up.</p><ul><li>Chapter 115: Consent to depart</li></ul><br/><p>And then…</p><br/><p>“I feel as if I just saw a bad dream…” (Mirack)</p><br/><p>“Damn right. A hero controlling monsters, that monster being overwhelmed by an unknown girl that is not even a hero; I could hear my common sense falling into pieces.” (Celestis)</p><br/><p>Mirack-chan and Celestis-chan; these girls that had completely become spectators in the middle of the battle had also received a shock by that fight.</p><br/><p>And then, the other one was…</p><br/><p>“Uhm…mah feet are already getting numb-dasu~~!”</p><br/><p>The culprit of this time’s incident, the earth hero, Sasae-chan.</p><br/><p>And with that as the reason, to show her will to reflect, she is currently doing a seiza on the floor of the parlor room.</p><br/><p>“S-Sorry-dasu. Can’t ye please forgive me already-dasu ka?” (Sasae)</p><br/><p>“Huh? Of course not, you rampaging hero. For a country bumpkin like you, I have to beat into you that understanding the others is a necessary skill in surviving the city.” (Mirack)</p><br/><p>“That’s right. What we are expecting from you is a reflection that is deeper than the sea. Understand that and fix that attitude of yours.” (Celestis)</p><br/><p>The two are unrestrainedly strict with Sasae-chan.</p><br/><p>“Just saying but, even with this, we are being kind, you know? Or maybe you want to experience the ‘Burning Fall Dogeza’ of the Fire Church to reflect even deeper?” (Mirack)</p><br/><p>“The ‘Boiling Water Dogeza’ of the Water Church might also be a good idea. By the time she cries ‘the water is hot, I can’t breathe’, she definitely will have reflected on her actions.” (Celestis)</p><br/><p>They are whispering dangerous things to each other?!</p><br/><p>“Uhm, you two! Can’t you just leave it at that? It looks like Sasae-chan has already reflected plenty enough!” (Karen)</p><br/><p>“Ueeee~~! Onee-chan, yer kind-dasu!” (Sasae)</p><br/><p>Saying this, Sasae-chan hugged me.</p><br/><p>“This girl, looks like she has completely become attached to Karen-chi after she covered for her in that fight. Being all clingy on her.” (Celestis)</p><br/><p>“As I thought, let’s go for the ‘Burning Fall Dogeza’. Let’s bake her.” (Mirack)</p><br/><p>“Your jealousy is unsightly, fire hero.” (Celestis)</p><br/><p>At any rate, it is great that the incident was resolved.</p><br/><p>We have also reconciled with Sasae-chan, and it feels as if we have safely returned to a stable state?</p><br/><p>“More importantly, what bothers me is…”, is the opinion one other person voices out.</p><br/><p>It was the Light Founder, Yorishiro-sama. At her bosom, she is still holding Doraha-san in the between her arms.</p><br/><p>It looks like the breasts of Yorishiro-sama have a calming effect on Doraha-san. Even when Doraha-san had rampaged so scarily just a while ago, she is now peacefully sleeping.</p><br/><p>“…The movements of the Earth Church. They ordered a subjugation specifically of Haine-san. Just what is Mother Earth Mantle thinking? Karen-san.” (Yorishiro)</p><br/><p>“Yes?” (Karen)</p><br/><p>“Depending on the details, we might have to attack the Earth capital, Ishtar Blaze, so be prepared.” (Yorishiro)</p><br/><p>“A war?! No! Never!!” (Karen)</p><br/><p>Why is it that Yorishiro-sama, who at times says some slightly scary things, would clearly say scary things when Haine-san is involved?</p><br/><p>Well, that’s fine. Right now, there’s other things I want to ask Yorishiro-sama.</p><br/><p>“Uhm, Yorishiro-sama…could it be that Haine-san is currently at Ishtar Blaze?” (Karen)</p><br/><p>“Why do you think that?” (Yorishiro)</p><br/><p>“The objective of Haine-san this time was the Mother Monsters. To destroy the monsters that give birth to monsters. And the Golems, these existences that are earth monsters, are born from a giant tree in Ishtar Blaze…” (Karen)</p><br/><p>Yorishiro-sama said this in the middle of the battle.</p><br/><p>“Isn’t that tree itself a Mother Monster? Haine-san went there to defeat it. The reason why Mother Earth Mantle-sama gave out an oracle to defeat Haine-san might be related to that…” (Karen)</p><br/><p>“Eeeh?!”</p><br/><p>The one who screamed in surprised was Sasae-chan.</p><br/><p>“Then, Kuromiya Haine and I had missed each other-dasu ka?! What was the point of mah one month journey?!” (Sasae)</p><br/><p>“That is of no importance right now.” (Mirack)</p><br/><p>“For now, just shut up.” (Celestis)</p><br/><p>The water and fire team pinned down Sasae-chan.</p><br/><p>“If that’s the case, what will you do, Karen-san?” (Yorishiro)</p><br/><p>Yorishiro-sama asks calmly.</p><br/><p>“Haine-san has gone to Ishtar Blaze for the sake of defeating the Mother Monster, and because of that, something unknown is moving. And so, what are you going to do about that?” (Yorishiro)</p><br/><p>“I want to go to Ishtar Blaze too.” (Karen)</p><br/><p>I answered clearly.</p><br/><p>I love Haine-san. Even if I don’t know what to do for the sake of the person I love, I definitely don’t want to do nothing at all.</p><br/><p>If by being at the side of Haine-san I can be of use to him, I don’t want to let that chance go away.</p><br/><p>“…Fine.” (Yorishiro)</p><br/><p>Yorishiro-sama answered clearly as well.</p><br/><p>“Just as you have guessed, Haine-san has journeyed to Ishtar Blaze. He didn’t want to drag you into this, so he had me keep silent about it. Sorry about that.” (Yorishiro)</p><br/><p>“No well…I did infer that was the case.” (Karen)</p><br/><p>“But, it is true that the moves of the Mother Earth God are strange. Karen-san, not only will you be moving as the light hero, I will have you move to Ishtar Blaze under the name of the Light Founder as well. With that much authority in your pockets, the Earth Church shouldn’t be able to act rashly.” (Yorishiro)</p><br/><p>“Thank you very much! Ah, but what about the defense of Apollon City?” (Karen)</p><br/><p>The first time I gave the proposal of going to Ishtar Blaze, I was rejected because I can’t leave my base.</p><br/><p>“Don’t worry. In your absence, we will have this girl do her best.” (Yorishiro)</p><br/><p>Saying this, Yorishiro-sama patted the head of the still sleeping Doraha-san.</p><br/><p>It is true that I have learned of Doraha-san’s ability to the point that it is indisputable. With Doraha-san, even if I am not here, she would be able to protect Apollon City plenty enough.</p><br/><p>That makes me sad as a hero on its own sense though.</p><br/><p>“You are the official hero here, so this is a hand I didn’t want to play much, but taking into account the feelings of a maiden in love, I will allow this rule break just this once. Karen-san, please save Haine-san for my sake as well.” (Yorishiro)</p><br/><p>Even if there’s a replacement for me, there’s no replacement for Yorishiro-sama.</p><br/><p>Yorishiro-sama can’t leave Apollon City.</p><br/><p>“Understood. I will properly send Yorishiro-sama’s feelings to Haine-san!”</p><br/><p>Yorishiro-sama and I are companions that love Haine-san, we can understand our feelings.</p><br/><p>Then, let’s do this immediately.</p><br/><p>“Let’s go, Sasae-chan!” (Karen)</p><br/><p>“Eh? Me too?!” (Sasae)</p><br/><p>Of course. We are going to Sasae-chan’s homeland, so why wouldn’t Sasae-chan go as well?</p><br/><p>There were a lot of complications, but I am finally going, to the Earth capital, Ishtar Blaze, where Haine-san is.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-111-113-slaying-giants\" id=\"prev_chap\" title=\"Chapter 111-113 - Slaying Giants\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-116-117-hero-party\" id=\"next_chap\" title=\"Chapter 116-117 - Hero party\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236292\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}