{"title": "Chapter 142-144 - Plan of the Fortune Princess", "id": 142, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-142-144-plan-of-the-fortune-princess", "volume_title": "Volume 2", "body": "<h1>Chapter 142-144 - Plan of the Fortune Princess</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 142-144: Plan of the Fortune Princess</h4></header></p><div class=\"entry-content\"><br/><p>Sponsored Chapters</p><br/><p>TLN: Hey guys, Reigokai here. It’s been so long since an actual sponsored chapter. I’ve added a extra one for time’s sake, and am thinking about doing some free chapters next Sunday as well!</p><br/><p>Look forward to it! </p><hr/><br/><p>At first, we tried to find the Mother Monsters.</p><br/><p>But the information was so little that we couldn’t even find a starting point for our search.</p><br/><p>There, with the desire of finding new clues regarding the Mother Monsters and increasing our fighting force, we decided on making contact with the wind hero.</p><br/><p>But it seems like we didn’t even have information regarding the wind hero.</p><br/><p>The one who came out at that moment was Yorishiro. Using a secret technique called Five Founders Conference, she succeeded in summoning the Wind Church.</p><br/><p>But with the call of a conference, there’s the need for a topic of discussion. And it has to be one big enough to make all five churches that essentially rule the world to gather.</p><br/><p>The topic Yorishiro used was the Mother Monsters.</p><br/><p>At first, I was like ‘Hm?’.</p><br/><p>The plan of finding the Mother Monsters has once again resurfaced and with a chance of actually being possible.</p><br/><p>This Mother Monster subjugation that I had planned on dealing with on my own at first, has begun to involve the whole world.</p><br/><p>My mouth can’t say anything towards the sturdy determination of Yorishiro in eradicating the monsters from the surface world, but I couldn’t do anything but be surprised by the political power of Yorishiro who is able to make all of it possible.</p><br/><p>She is already not in the realm of simply being the incarnation of the Light Goddess, hasn’t she already climbed to being the strongest existence?</p><br/><p>But even so…</p><br/><p>***</p><br/><p>(…Are you still angry?)</p><br/><p>We had already entered the Wind capital, Rudras Metropolis, and we were in the middle of moving through the city with an ethereal-powered car.</p><br/><p>It was a limousine type of car and possesses enough space for even us two who have been added to the group, the inside is also luxurious, and it was plenty good for the nation-level guests of honor to ride.</p><br/><p>But the real intention of the Wind Church for preparing such a car for us, rather than it being to welcome the guests, it is more like they wanted to properly keep in check the people in order to not have them do whatever they wanted inside their territory.</p><br/><p>(Hey, Haine-san. Answer me please.)</p><br/><p>Inside that car, there was a voice repeatedly calling to me inside my mind.</p><br/><p>Without the need to use air as the intermediary, it is something that rides the waves of the soul, a voice that can only be heard by the people that possess the soul of a God.</p><br/><p>(Haine-san…you already don’t want to talk to me, right? It is so sad. I feel like crying.) (Yorishiro)</p><br/><p>(No no no no! I was just thinking about something!) (Haine)</p><br/><p>I quickly follow up on Yorishiro who was eagerly talking to me in the mind channel.</p><br/><p>The reason why she is not talking to me in the flesh was because she was considering the many people inside the car. This woman has a lot of secrets after all.</p><br/><p>“Karen-neechan, Karen-neechan! Look outside the window-dasu! There be a lot of super long chimneys lined up-dasu!!” (Sasae)</p><br/><p>“They are not chimneys…but smelting furnaces. But this is the first time I have seen it in such a large scale!” (Karen)</p><br/><p>“Uhyaaaa, I thought that we were the ones who were the most forbearing in regards to ethereal, but it looks like I will have to rethink that.” (Celestis)</p><br/><p>“There’s always a top to the top. Keep that in mind, water idol woman.” (Mirack)</p><br/><p>“Why are you talking so high-and-mighty, fire she-male?” (Celestis)</p><br/><p>While warmly watching over the conversation of the heroes, I continue the secret talk with Yorishiro.</p><br/><p>(…Well, it is true that I am angry though. Why did you do such a reckless twist like that?) (Haine)</p><br/><p>(Twist, you say?) (Yorishiro)</p><br/><p>(About having me participate in the Five Founders Conference. Even if it was to have me accompany, that’s way too conspicuous, don’t you think? You even publicized my dark powers.) (Haine)</p><br/><p>If I wanted to infiltrate the Wind capital, there’s plenty of methods I could have used.</p><br/><p>But to think that of all things, I would be participating at an equal standing to that of a Founder, no matter how I think about it, it gives me the shivers.</p><br/><p>(Ara, that’s not good. Making a big appeal of your existence is what will fulfill my objective after all.) (Yorishiro)</p><br/><p>You are still plotting something after all this?!</p><br/><p>What? What is it she is trying to stir up by revealing my existence?</p><br/><p>(It is to meet that person once again.) (Yorishiro)</p><br/><p>(That person?) (Haine)</p><br/><p>(The Wind God, Quasar.) (Yorishiro)</p><br/><p>…</p><br/><p>The ruler of this Rudras Metropolis is the Wind Church; and the ruler of that Wind Church is the Wind God.</p><br/><p>As of now, it is someone that I haven’t seen a shadow of its figure since the time I was unsealed. It was truly like air.</p><br/><p>(The original objective of Haine-san and the others to meet the wind people was because you had the faint hopes of obtaining information regarding the Wind Mother Monster, but…) (Yorishiro)</p><br/><p>Well, yeah, that’s right.</p><br/><p>(If it’s Quasar-san, it definitely knows about it.) (Yorishiro)</p><br/><p>Well, yeah, that’s right.</p><br/><p>It is one of the very culprits that created Mother Monsters after all. Even if it doesn’t know the specific location like with Nova, it should at least know its form and what traits it has.</p><br/><p>(But that person is one that has the most lack of presence within the six Gods of Creation. Even if you try to search for it normally, you wouldn’t be able to find it.) (Yorishiro)</p><br/><p>I feel like this time everything is like that.</p><br/><p>…Ah, no, wait. Maybe that’s why?</p><br/><p>Is that the reason why she went so far to even set up the Five Founders Conference to infiltrate the Wind capital?</p><br/><p>(For us five Gods -including me- the base, where the church that worships us is in, is a special place. If we were to enter its territory, we should be able to grab some sort of clue.) (Yorishiro)</p><br/><p>It is true. Now that I think back about it, the Gods until now: Nova, Coacervate, and Mantle have all appeared when we arrived at their base cities.</p><br/><p>(But that’s not enough.) (Yorishiro)</p><br/><p>(Eh?)</p><br/><p>(The other party not only possesses an incredibly light presence within the four Base Elements, even within the six Gods of Creation, it is on a whole level of its own. Even if we were to go to a place where it is likely to be, it is naive to think that it would come out!) (Yorishiro)</p><br/><p>…Aren’t you wording it pretty harshly there?</p><br/><p>(In order to search for something that we can’t find even when searching, the best way is to have the other side come to us. To do that, spreading bait is the most effective way!) (Yorishiro)</p><br/><p>(…Are you talking about me?) (Haine)</p><br/><p>Bait, you say.</p><br/><p>Is that why you made such a big show of my dark powers in front of so many people?</p><br/><p>In order to have a God that is like air, who can be anywhere, and can’t be seen or touched, to hear it.</p><br/><p>(It looks like you yourself haven’t noticed it, but for the four Base Elements, you are an existence they can’t ignore, Dark God Entropy.) (Yorishiro)</p><br/><p>She calls me by my God name.</p><br/><p>(The dark power has the absolute ability of erasing earth, water, wind, and fire elements. In reality, the four Base Elements should have been completely under your power. Them beating you at the battle of Gods is serving as the core of their shallow pride.) (Yorishiro)</p><br/><p>(In essence, the one who defeated me was only you though, Light Goddess Inflation.) (Haine)</p><br/><p>To tease her, I also spoke her God name, but the response didn’t come.</p><br/><p>What?</p><br/><p>(…Uwu.) (Yorishiro)</p><br/><p>(Uwaa, that’s not it, that’s not it! It is not like I am holding a grudge for that time! Don’t cry!) (Haine)</p><br/><p>But in order to find the Mother Monsters, we have to unify the power of the humans and lure out the last Basic Element God.</p><br/><p>To be able to bring out many results from one action is the very definition of a tactician.</p><br/><p>In the time I was sleeping, the one who was the most influenced by humans might have been her.</p><br/><p>This God to God conversation we are having right now, there might be someone else listening into it.</p><br/><p>Is that also her aim?</p><ul><li>143: Meeting begins</li></ul><br/><p>In the time we were doing all that, the limousine had led us to the assembly hall for the Five Founders Conference.</p><br/><p>…Uhm, I am also here so, is it more accurate to say Six Founders Conference?</p><br/><p>It is complicated, so I will leave it at five. At any rate, the place where we were led to was the headquarters of the Wind Church, the Grand Wind Workshop.</p><br/><p>Until we were led there, we did have the chance of moving through the inside, but mysteriously, there was not a single instance where we encountered anyone passing by.</p><br/><p>There was indeed the presence of people, but they didn’t enter our field of vision even once.</p><br/><p>I felt like I was being reminded of how thorough the Wind Church is with their secrecy policy.</p><br/><p>***</p><br/><p>In the round table prepared, one unknown man sits down where the five Founders sit.</p><br/><p>How pressuring!</p><br/><p>The heroes also stood at the back of each of their Founders to protect them, and the conference took form.</p><br/><p>“Well then, first of all, I want to give my thanks to the Founders that have responded to my call and have gathered.” (Yorishiro)</p><br/><p>Is what Yorishiro opened with.</p><br/><p>An ellipsis.</p><br/><p>While giving a basic explanation of the Mother Monsters, the Five Founder Conference continues.</p><br/><p>“…In short, as long as we defeat those Mother Monsters, monsters will be eradicated from this world, right?” (Azul)</p><br/><p>The Water Founder was showing a merchant-like gaze that didn’t allow a single oversight.</p><br/><p>“Quite the splendid thing. Because of those things, the ships get sunk along with their cargo, and there’s also the danger for the ones on board. They are truly a bunch that are only detrimental with just appearing.” (Azul)</p><br/><p>He is saying the same thing as my father.</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“Eh?”</p><br/><p>My interest was piqued at what the Fire Founder said.</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“…Yeah, that’s right but, with all the Fire Church?” (Mirack)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“Are you saying you are going to go that far for us?” (Mirack)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“No way! We truly appreciate it!!” (Mirack)</p><br/><p>According to what the Fire Founder said through Mirack, he will be spreading an exclusive search network with the Fire Church that has obtained the information of the Immortal Phoenix.</p><br/><p>Hereafter, the moment a Phoenix-like bird is seen, it will be immediately reported to all stations through the nation, and when the report arrives, they will have a system that will allow them to move promptly to the scene, or so he says.</p><br/><p>“In our Earth capital, there was a tree named ‘Great Pillar-sama’. It gave birth to convenient things called Golems, and it be respected by the people. But one day, they suddenly attacked the people. We learned it be a Mother Monster after we fought and defeated it-sa ne.”</p><br/><p>“That means the Earth Mother Monster has already fallen, and the remaining ones are the water, wind, and fire. If we were to defeat them, we can bid farewell to monsters for eternity.” (Yorishiro)</p><br/><p>Yorishiro breathes in and stands up from her seat. She then slams both of her hands onto the round table.</p><br/><p>“There’s a variety of areas we can see it from. Just like how the Water Founder-sama said just now, the economic losses we face because of the monsters, who knows how much it would be? Putting it in other words, they are the very blight that festers humanity’s growth.” (Yorishiro)</p><br/><p>The other Founders kept silent and listen.</p><br/><p>“Just how much unnecessary energy have we expended in fighting with monsters? If we had directed that energy in something constructive, how much could we have developed? There’s also no need to say that there have been many precious lives lost because of monsters. For us, monsters are…” (Yorishiro)</p><br/><p>Yorishiro temporarily pauses her words here.</p><br/><p>“…A big threat with no benefits. There should be no one who would lose anything in their eradication. This is the time when we five churches should link hands to change the world greatly!” (Yorishiro)</p><br/><p>“Let there be hot-bloodedness!!” (Enou)</p><br/><p>“Yeah, that be exactly right.”</p><br/><p>“If there’s profit, boarding it is what makes one a merchant.” (Azul)</p><br/><p>It was slightly unexpected how easy it was for the Founders to approve of what Yorishiro said.</p><br/><p>Because just like how the monsters are only tools for the Gods to get fame, I thought that monsters were necessary for the church.</p><br/><p>The monsters that are a threat to humans are subjugated by the church.</p><br/><p>And due to this, humans are grateful to the church. Their worth is acknowledged.</p><br/><p>For them, that’s a grace that should be hard to let go of…but it looks like that wasn’t the case.</p><br/><p>“Honestly speaking, every single human in this world is already fed up with those monsters. Even if the church protects the people from monsters -leaving aside a century ago- in the present day, it has already lost all novelty, and it has become something ‘natural to be protected’. And yet, monsters are still the same threatening existence since those hundred years. So, the cost to profit ratio has long since surpassed its worth.” (Azul)</p><br/><p>It looks like the circumstances vary from humans and Gods.</p><br/><p>And this had been explained by the Water Founder in the lenses of a businessman.</p><br/><p>“Hence, I am totally in favor of eradicating the monsters! I have already heard about the Water Mother Monster from my daughter—oops, I mean, our hero. The lack of information is a straining factor, but we intend to investigate little by little.” (Azul)</p><br/><p>“As you see fit.” (Yorishiro)</p><br/><p>Yorishiro who has become the speaker of this conference gave her words to him.</p><br/><p>Looks like the meeting is going well for now.</p><br/><p>“Well then…” (Yorishiro)</p><br/><p>Yorishiro’s gaze is directed at the place where she hasn’t faced to until now.</p><br/><p>Being sit on the seat of a Founder, yet, has not said a single word since the beginning of the conference; a man that was like air.</p><br/><p>“Wind Founder-sama, I want to hear you opinion in this.” (Yorishiro)</p><br/><p>“…”</p><br/><p>The silence continues.</p><br/><p>“As a Founder, it wouldn’t be strange to be in possession of a lot of beneficial information. If it’s you, don’t you have any information regarding the Wind Mother Monster of your same element? Even if it’s only a clue regarding it…” (Yorishiro)</p><br/><p>Yorishiro was pressing him tenaciously, and Shiva stopped it with his hand.</p><br/><p>The wind that had been covered with a veil of mysteries.</p><br/><p>The God, the church, the city, the Founder, and the hero as well; all the things that were as if transparent, were beginning to show themselves…</p><br/><p>“First of all, I want to ask something.” (Shiva)</p><ul><li>144: The Wind Controversialist</li></ul><br/><p>“…Go ahead.” (Yorishiro)</p><br/><p>Yorishiro readily consents, but it was impossible to erase the cautiousness in her voice.</p><br/><p>“First of all, regarding these Mother Monster things you have been talking about. Is there proof that they are really out there?” (Shiva)</p><br/><p>“?!”</p><br/><p>“Earth, Water, and Fire as well, it pains me to see how easily you are to get swayed by such delusions. There’s no evidence in what this girl is saying. There’s nothing to put my trust into.” (Shiva)</p><br/><p>“There be evidence-sa ne.”</p><br/><p>The one who objected was the Earth Founder Obaa-san.</p><br/><p>“There be no doubt the Great Pillar-sama that appeared in our city was givin’ birth to monsters. On top of that, cuz of its super size and power, it be fitting to be called the boss of the monsters.”</p><br/><p>“But there’s nothing to corroborate the theory of Mother Monsters. In the first place, who was the one who brought out this theory of yours? How did you obtain this information?” (Shiva)</p><br/><p>Because of that question, sounds disappeared from the place.</p><br/><p>No one could answer.</p><br/><p>The painful silence continued.</p><br/><p>“…It was me.” (Haine)</p><br/><p>I had no choice but to speak.</p><br/><p>“I was the one who obtained the information regarding the Mother Monsters. I told the Light Founder and the heroes.” (Haine)</p><br/><p>Shiva’s gaze is directed at me.</p><br/><p>Those eyes were not showing any friendly color in it.</p><br/><p>“…So it was you. From the moment I saw you, I thought you were a shady man, but that shadiness has increased by one shade more. There’s a lot of things I want to ask, but let’s start with where you heard about such a fairy tale like that of Mother Monsters?” (Shiva)</p><br/><p>“I can’t say.” (Haine)</p><br/><p>There’s no way I would be able to tell a human that I heard about this from Water God Coacervate and the Fire God Nova, not even by mistake.</p><br/><p>“I was told about it with that kind of promise between us after all.” (Haine)</p><br/><p>I had no choice but to cover it in such a way.</p><br/><p>In the first place, I was thinking about dealing with the Mother Monsters on my own, so I didn’t prepare a single thing for situations where I had to explain myself.</p><br/><p>That Yorishiro…she involved me in such a development without even telling me beforehand after all.</p><br/><p>“Reeks of suspicious. Well then, another question.” (Shiva)</p><br/><p>“Is there still more?” (Haine)</p><br/><p>“Of course. Just what kind of authority do you have to sit there? At that seat where only the five Founders of the five churches are allowed to sit on.” (Shiva)</p><br/><p>He does have a point.</p><br/><p>I myself want to ask that too.</p><br/><p>“What the Light Founder said before was also weird. Being on the same seat as us Founders just because of a reason like that is way too abnormal. But what was more surprising was that the only one who is pointing this out is me. Are the eyes of the Earth, Water, and Fire hollow?” (Shiva)</p><br/><p>No really, I totally agree with you.</p><br/><p>As I thought, isn’t Yorishiro acting without thinking about the consequences?</p><br/><p>“If ya keep saying those stupid things, I be cutting both your hands and legs off.”</p><br/><p>“Wa?!” (Haine)</p><br/><p>I get surprised by the razor-sharp voice.</p><br/><p>The Earth Founder Obaa-san had her eyes shining with a dangerous light, as if showing us a glimpse of her past as a hero.</p><br/><p>“Brat, careful with what ya say.”</p><br/><p>“…Are you talking about me?” (Shiva)</p><br/><p>No need to even ask, the Obaa-san was glaring daggers at Shiva!</p><br/><p>“Our Earth Church ya see, has been saved by that Nii-chan there. A crisis never seen before. After doing so much for us, there be any other reason needed to believe?”</p><br/><p>At the fight with the giant Grandma Wood at Ishtar Blaze, a large amount of people were assimilated, and it was trying to trap the people into an infinite sleep; I participated in that fight as well.</p><br/><p>In the first place, the reason why that tree rampaged was because of my praise to the Mother Earth God Mantle which escalated things.</p><br/><p>To take responsibility for that, I had no choice but to stop it.</p><br/><p>That fight was showing its effect here as well.</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>Is what the Fire Founder said.</p><br/><p>In the past, there was the Fire Cow Phalaris settled at the vicinity of Muspelheim. The ones who defeated that giant monster were Karen-san and Mirack who had fixed their broken friendship.</p><br/><p>And with that friendship fixed, there’s a person that has taken that fixed friendship to heart as well.</p><br/><p>“This one…has not seen Haine-kun fight.” (Azul)</p><br/><p>Even the Water Founder joins.</p><br/><p>“But there was a small incident in our city as well, you see. In that incident, this one’s prided girl and the kind ladies that were there by chance managed to deal with it, but after that, he was the one who dealt with the other messy stuff.” (Azul)</p><br/><p>The Great Sea Dragon turmoil that was set up by the underhanded God Coacervate at Hydra Ville.</p><br/><p>After having Coacervate himself retire, I did a big cleaning of the Water Church in order to sweep out the wiles he had created.</p><br/><p>That was the time when I first met the Water Founder.</p><br/><p>“And so, this one has decided on ‘trusting’ him. For a merchant, trust is the most important of all. There are times when the substantial wealth is infinitely formed from the formless trust. That’s why merchants can’t be crude on trust. Once there’s trust, you can’t betray them by no means, and once you have given trust, you can’t just pull it back at a moment’s notice.” (Azul)</p><br/><p>Why is it that such advocacies are coming one after the other?</p><br/><p>Founders are supposed to be politicians of sorts, that’s why, there’s the need to make dry decisions as well.</p><br/><p>“This is the boon of Haine-san’s natural virtue-desu wa.” (Yorishiro)</p><br/><p>I am not taking advantage of something like that, Yorishiro.</p><br/><p>I feel like Karen-san and her friends are pumping their fists like crazy in victory. Really, all sides are boisterous.</p><br/><p>“I see. What it means is that you bastards have fallen for this man’s strength, and because of that, you believe in the utterances of this man.” (Shiva)</p><br/><p>The Founder Shiva stands up from his seat.</p><br/><p>“Then, I will be relying on him too, on that man’s strength. Whether it is worthy of trust, that is.” (Shiva)</p><br/><p>“Could it be…you are planning on having a match? Haine-san against you?” (Yorishiro)</p><br/><p>Yorishiro asks in surprise, and Shiva answers smoothly.</p><br/><p>“There’s no better way to measure someone than in fighting. Once they both face a battle with their lives at stake, you can understand everything about the other party. It doesn’t only measure strength, it measures the very depths of the heart too.” (Shiva)</p><br/><p>“Fine.” (Haine)</p><br/><p>I immediately reply and stand up at the same time.</p><br/><p>In the first place, it is not in my character to be sitting in such a flamboyant seat like this.</p><br/><p>“I will be accepting that bout. But there’s a problem in the opponent being you. In the event that the Founder is heavily injured, it would be terrible. Isn’t it at times like this where the strongest fighter of the Church -the hero- should be standing on the stage?” (Haine)</p><br/><p>This is consideration and, at the same time, a gamble.</p><br/><p>With a sound reason, I will pull out the wind hero that has not shown its figure yet.</p><br/><p>The Mother Monster and Quasar are a problem as well, but the very existence of the Wind Church is ominous.</p><br/><p>It makes me want to drag out as much information as possible.</p><br/><p>“Hero huh. Hmph, then there’s no problem. The wind hero is already right in front of you.” (Shiva)</p><br/><p>“What?” (Haine)</p><br/><p>“It is I, Shiva.” (Shiva) &lt;Lol, I had to.&gt;</p><br/><p>The Founder Shiva made a daring smile as he once again spoke.</p><br/><p>“Wind hero, Toreido Shiva. I am the Wind Founder as well as the wind hero.” (Shiva)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-140-141-gathering-of-founders\" id=\"prev_chap\" title=\"Chapter 140-141 - Gathering of Founders\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-145-146-a-king-and-hero\" id=\"next_chap\" title=\"Chapter 145-146 - A king and hero\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236304\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}