{"title": "Chapter 147-149 - As a king and as a hero", "id": 147, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-147-149-as-a-king-and-as-a-hero", "volume_title": "Volume 2", "body": "<h1>Chapter 147-149 - As a king and as a hero</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 147-149: As a king and as a hero</h4></header></p><div class=\"entry-content\"><br/><p>FGWind God, Quasar.</p><br/><p>Shiva in front of me certainly did say this. From a completely normal-looking human, the name of a God was said.</p><br/><p>Normally, it would be something hard to believe, but there’s no way a normal human would know my name as the Dark God and even know about the dark matter.</p><br/><p>Then, that means, that man is one of the four Basic Element Gods.</p><br/><p>The Wind God Quasar.</p><br/><p>And a God having the form of a human means…</p><br/><p>(You also incarnated as a human, Quasar?) (Haine)</p><br/><p>“What? You are going through the trouble of saying that through the soul wave transmission? Well fine, I will play along.” (Shiva)</p><br/><p>The place where we are facing off and the place where Karen-san and the others are spectating is quite a few ways away, but this is just to be safe.</p><br/><p>Him calling himself Quasar was also in a low voice, so I think they didn’t hear that though.</p><br/><p>(Now that I think about it, I heard the transmission a while ago too. Your talk partner was the Light Founder, right? That means she is the incarnation of the Light Goddess Inflation huh. For the two poles to hold hands, that’s a fearsome situation for us four Basic Elements.) (Quasar)</p><br/><p>The objective of that soul transmission was to lure out Quasar who we didn’t know where he was, but to think he was hiding so close to us.</p><br/><p>So he was silently watching while in the same car as us huh.</p><br/><p>(With that transmission, I learned about the identity of both of you, but I am a wary one you see. In order to gain a more certain belief of it, I set up this fight. And just as planned, you used dark matter. With this, it is certain. You are the Dark God Entropy.) (Quasar)</p><br/><p>(The one and only.) (Entropy)</p><br/><p>There’s no point in playing dumb here.</p><br/><p>I revealed my name; the name of the soul inside of me.</p><br/><p>(Hmph, so you finally woke up. How did it feel waking up from a 1,600 year sleep? I am truly exalted, you know! This is the moment I have always been waiting for after all!) (Quasar)</p><br/><p>(I don’t know what’s making you excited, but I am not in that good of a mood. The more I learned about you four Base Elements, the worse my mood got.) (Entropy)</p><br/><p>Fire God Nova, Water God Coacervate, Mother Earth God Mantle, Wind God Quasar; the four Gods that were categorized as four Base Elements were originally Gods that were supposed to help out the two pole Gods, who are their superiors, in their work of creation.</p><br/><p>But because of the Battle of Gods that occurred at the Genesis era, the Dark God that was supposed to be the top had been defeated and sealed, and due to this, they grew impudent.</p><br/><p>Misunderstanding that they themselves are the rulers of the world, they acted as they pleased.</p><br/><p>In the time I as the Dark God Entropy came back, I learned about the sins that they had committed.</p><br/><p>And so, I decided. I won’t let the four Base Elements get involved in this world anymore.</p><br/><p>Since the time I incarnated as a human and met the Base Element Gods, I have crushed each of their acts.</p><br/><p>At first, I had no such intentions, but I have done it three times in a row already.</p><br/><p>And now, the last Base Element God has appeared.</p><br/><p>Is this guy also going to walk the same path as his brethrens?</p><br/><p>(…But you are slightly different from the others, Quasar. You are the first one of the four Base Elements to incarnate as a human.) (Entropy)</p><br/><p>There’s still the possibility that he is cloaking himself with the ability of a monster though, like the time with Coacervate.</p><br/><p>(…Nova, Coacervate, Mantle; those three huh. Those guys are idiots.) (Quasar)</p><br/><p>Is what Quasar spits out about his brethrens.</p><br/><p>(In the battle at the Genesis era, we defeated you, Dark God Entropy. The King of Gods, you who are supposed to be the absolute God. But that was simply because the Light Goddess who held an advantage was at our side. And most importantly, you gave us the win. That is exactly the origin of the madness in this world.) (Quasar)</p><br/><p>(…What are you talking about?) (Entropy)</p><br/><p>(Don’t play dumb. Because of you backing off, Nova and Coacervate got on a high horse. They misunderstood that they themselves are the summit of the world, and they didn’t even try to hide how stupid they were. It was like watching a dog running wild.) (Quasar)</p><br/><p>(You aren’t mincing any words there. They are supposed to be your Base Element brethrens, right?) (Entropy)</p><br/><p>(Entropy, let me put this out first. That is the biggest insult for me. In the future, don’t lump me in the same category as those pieces of shit.) (Quasar)</p><br/><p>Judging from his tone, I could tell the disdain he had from the bottom of his heart towards Nova and Coacervate.</p><br/><p>It is transmitted from the soul waves without passing through the body, so it is even harder to hide how one really feels.</p><br/><p>(Then, let’s hear it, Wind God Quasar. What is it that’s different from you and them?) (Entropy)</p><br/><p>I ask.</p><br/><p>Because of the discovery of a new truth, the fight had been enveloped in a completely different veil.</p><br/><p>A Wind Founder, a wind hero, and a Wind God; seriously, what a greedy man. This is the first time I have met a person that monopolizes so many positions to this extent. However, him incarnating into a human must mean that…he is planning on doing something that needs him to go this far.</p><br/><p>(Can you please tell me? The reason why you incarnated as a human. To the point that you would even go and become the Wind Church’s top which worships you. There’s no way there’s nothing, right?) (Entropy)</p><br/><p>(Isn’t there something you should be asking before that? You want to know, right? The location of the Mother Monster. You were talking about that with Inflation, right?” (Shiva)</p><br/><p>(That’s right. But in order to ask that, I need to know first just what is direction you are facing at. Quasar, are you an ally of humans, or are you an enemy?) (Entropy)</p><br/><p>‘Kukukukuku’, a laugh that felt as if he couldn’t hold it in was reverberating in the soul wave transmission -the voice of Quasar.</p><br/><p>(In the end, that’s all you are, Entropy. You only understand me to that extend. It is a matter of course. For an absolute God like you, I am just a low class God that has no worth in your eyes. I am not even in your consideration.) (Shiva)</p><br/><p>(Why are you suddenly going into self-loathing?) (Entropy)</p><br/><p>(Well then, let me tell you. I am the ally of no one. Not human, or God. Whether it be in the battle of Gods, or in the time when I destroyed the first nation that the humans had formed, I was simply going along with it because it was a pain. For me, Gods and humans have no worth.) (Shiva)</p><br/><p>And here I was wondering what he would say.</p><br/><p>Isn’t that absolute isolated way of yours the very reason why you don’t last long in anyone’s memories?</p><br/><p>Not trying to get involved with anyone, and not holding any connections with anyone.</p><br/><p>That’s why you had an air-like presence, and Yorishiro and I didn’t remember the impression we had of you.</p><br/><p>(But for me…there’s only one enemy that I have decided I must absolutely defeat.) (Quasar)</p><br/><p>(Heh~) (Entropy)</p><br/><p>(It is you.) (Quasar)</p><br/><p>Eh?</p><br/><p>(It is you, Dark God Entropy. In order to defeat you, I incarnated as a human. The 1,600 years you were sleeping, were a preparation time for me in order to defeat you!) (Quasar)</p><ul><li>148: At the grandstand</li></ul><br/><p>Wind Church’s headquarters, the Wind Grand Workshop.</p><br/><p>In that combat training space, a one-to-one fight is unfolding, and we were spectating this while gulping our breaths.</p><br/><p>I -the Light Founder, Yorishiro- was seating together with the heroes and Founders that gathered from every part of the world.</p><br/><p>But…</p><br/><p>“What? The two suddenly stopped moving.” (Mirack)</p><br/><p>The battle that was intense from the get-go had suddenly stopped, and the ones at the battle ring: Haine-san and the Wind Founder, Toreido Shiva, were now glaring at each other without moving an inch.</p><br/><p>It was silent to the point of being eerie.</p><br/><p>“What happened? The two were moving so wildly just a while ago.” (Karen)</p><br/><p>My hero, Karen-san, was doubting this mysterious development.</p><br/><p>“Ah, could it be that?! The one like in old stories that say: ‘the first one that moves is the one that falls’?! In a fight between two experts that have read the hand of their opponent, a move can prove fatal!” (Celestis)</p><br/><p>“What’s that? So cool-dasu! I wanna try havin’ such a high level match-dasu!” (Sasae)</p><br/><p>“Ara, Sasae-chi, then, want to try it with me? The one that moves first loses, kuchukuchukuchu~” (Celestis)</p><br/><p>“Gyahahahahahaha! Wait, Celestis-neechan, that just be a staring contest-dasu! It be different from the point of moving first-dasu yo!!” (Sasae)</p><br/><p>*Pong! Pong!*</p><br/><p>“Can’t watch in silence?”</p><br/><p>“Sorry.” “-Dasu.” (Celestis+Sasae)</p><br/><p>The peanut gallery was noisy, so I am glad that the Earth Founder-sama gave them a good hit on their head.</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>…But I know the real reason why the two suddenly stopped moving.</p><br/><p>I myself have the soul of the Light Goddess Inflation after all. As an incarnation of a God as them, I was able to listen to the soul wave conversation they were having.</p><br/><p>To think that Shiva was actually the incarnation of the Wind God Quasar…</p><br/><p>It was so straightforward that it in turn caught me off guard.</p><br/><p>Right now, Haine-san was being careful by having a conversation with Shiva in a voice that people can’t hear, and was trying to dig out what plans he has.</p><br/><p>I can’t mess up and make the situation more chaotic, so I simply watch over the situation.</p><br/><p>“Even so…this is the first time this one has seen this. Is that the Dark Power that Haine-kun uses?” (Azul)</p><br/><p>In this situation where there’s no visible way of knowing when the next move will be made, the Water Founder begins to talk as if trying to divert the tension.</p><br/><p>“This one has heard about it before, but once looking at it in person, this one can tell that there’s not a single resemblance from any of the five known elements.” (Azul)</p><br/><p>“Isn’t that right, Papa? On top of that, it is crazy strong. It erased the fierce attack of the Wind Founder in a single swing.” (Celestis)</p><br/><p>Is what the water hero continues by saying.</p><br/><p>Listening to this conversation, I can tell that the rumours of the Water Founder doting on his daughter are real.</p><br/><p>“The sixth element, darkness huh. No matter how many times I see it, it is a baffling power. Even though I have been saved by that power a lot of times.” (Mirack)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“The one who dealt the finishing blow to Great Pillar-sama be in actuality that lads power, ya know. It be practically him that defeated it on his own.”</p><br/><p>The Earth Founder says this seriously. The earth hero that is praised as the strongest in history made the words of this Obaba-sama heavier.</p><br/><p>“Just recently, the man that be working as the Founder before me had received an oracle from Mantle-sama. Telling him to: ‘Defeat the personification of the Dark God Entropy’. Because of the incident with Great Pillar-sama that occurred not long after, it be wrapped up as a fake oracle, but ya see, it be bothering me, ya know.”</p><br/><p>“About the Dark God? That there’s a sixth one in the Gods of Creation?” (Karen)</p><br/><p>An unrestful atmosphere flowed between the Founders.</p><br/><p>“That’s not something too welcomed. Right now in this world, the balance has been formed with five churches. If a new factor is driven into it, that balance might crumble.” (Azul)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“No matter what it is, adding something to something that’s already completed is incredibly difficult. If a Dark God really does exist…” (Azul)</p><br/><p>“It does exist.” (Yorishiro)</p><br/><p>Unable to hold it, I ended up speaking.</p><br/><p>Everyone’s gaze gathered onto me, so I couldn’t just stop in the middle anymore.</p><br/><p>“The Dark God Entropy exists.” (Yorishiro)</p><br/><p>“Ya say that with quite the confidence-sa ne. What did the Light Goddess-sama tell ya?”</p><br/><p>“The secret of the world.” (Yorishiro)</p><br/><p>There’s no way I can tell them I myself am the Light Goddess, so I adjust a few details.</p><br/><p>“This is not the time to say everything. But there’s one thing I can say clearly. This world is trying to change. In this changing world, we can’t continue utilizing the same system.” (Yorishiro)</p><br/><p>“Ya talkin’ about the Mother Monsters?”</p><br/><p>The Earth Founder says.</p><br/><p>“It be true that our place has no choice but to change. The Great Pillar-sama we been relying on is gone, so we gotta grow independent. There be talk about trading the crops and meat for ethereal tools. In this conference, I wanted to talk about that too.”</p><br/><p>“That’s good-desu wa ne. I have heard of the production ability of Ishtar Blaze. If a trade is established, my worries at the annual rainfalls will lower-desu wa.” (Yorishiro)</p><br/><p>“At that time, please do come to us. This one will provide use of our Water Church’s maritime transportation.” (Azul)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>I managed to properly make the matter with Entropy hazy.</p><br/><p>The Founders never forget the benefits to their own churches, and are always walking in a way so that they won’t damage it.</p><br/><p>The world might be changing at a speed that I didn’t expect.</p><br/><p>The era when humans fought against each other; the era when humans fight against monsters; what will be waiting beyond that?</p><br/><p>But in order to reach that, there’s the need to overcome several obstructions.</p><br/><p>The Wind Church that still doesn’t have a settled position is the closest problem right now.</p><br/><p>Whether we overcome it or not falls upon you, Haine-san.</p><br/><p>Please make it so that it is either untangling the heart of the Wind God Quasar…or kill him.</p><ul><li>149: A God’s utmost limits</li></ul><br/><p>(Defeat…me…) (Entropy)</p><br/><p>In this conversation that shakes the soul, I -Kuromiya Haine and also the Dark God Entropy- continued speaking with the Wind God Quasar incarnated as Toreido Shiva.</p><br/><p>(Are you saying that’s your objective? What are you saying? Are you stupid? You already defeated me 1,600 years ago.) (Entropy)</p><br/><p>(You are saying something like that was a victory? Even if you can fool the idiots Nova and Coacervate, you can’t fool my eyes.) (Quasar)</p><br/><p>Quasar paused for a bit, and said this as if emphasizing it.</p><br/><p>(You lost on purpose.) (Quasar)</p><br/><p>In the battle of Gods 1,600 years ago…</p><br/><p>(You possess enough power to repel all five of us even if we were to gang up on you. No matter if the Light Goddess Inflation were there. If you got serious, you should be able to defeat her as well.) (Quasar)</p><br/><p>(Why do you think that?) (Entropy)</p><br/><p>(Because in the fight 1,600 years ago, the only one who seriously fought you was me.) (Quasar)</p><br/><p>Looking back on it, in the battle of Gods that unfolded when this world had just been created, the scale defied all imagination. The sky split, the earth broke; even so, the Gods didn’t fight seriously at all.</p><br/><p>Obviously Mantle who hates fighting is one of them. Nova and Coacervate also thought that it should be fine to just leave it to Inflation that holds an advantage against me, so they were visibly slacking.</p><br/><p>Even the important Inflation was holding back her attacks because she actually didn’t wanted to be my enemy, so the fight itself was a mess.</p><br/><p>Within that, only this guy fought me seriously, and was seriously trying to win against me. Because all his wind attacks were blocked by my dark matter, it was hard to tell though. In the middle of that offensive and defensive battle, I feel like only the eyes of this guy were shining in seriousness.</p><br/><p>(For an absolute power like you, the serious me, and Coacervate and the others who were slacking, it must have looked like it wasn’t even worth your eyes. That’s why you said you didn’t remember me at all even when I fought seriously.) (Quasar)</p><br/><p>(Uwa…) (Entropy)</p><br/><p>What should I do? I can’t say anything back at that.</p><br/><p>Could it be that I have hurt him severely without noticing?</p><br/><p>(I don’t care about humans at all. Whether we give them freedom or enslave them, I don’t care. But the battle itself made my heart dance. The Dark God Entropy that stands at the summit of Gods, and is the very personification of the ultimate state of a God. By defeating and surpassing you, I thought I would be able to stand at that summit.) (Quasar)</p><br/><p>(No, I don’t really—!) (Entropy)</p><br/><p>(But you bastard didn’t even fight properly, and fell on your own to our attacks! And then, falling prisoner to the seal, you ended up taking a 1,600 year sleep. Do you understand the dejection I felt that time?! The ultimate ruler of Gods showing such a pathetic sight!) (Quasar)</p><br/><p>…..</p><br/><p>It is true that I do have a way to defeat my natural enemy, the Light Goddess Inflation.</p><br/><p>The Black Hole.</p><br/><p>Black Hole, which is my strongest attack, increases the gravity of my dark matter to its very limits. The gravity that has been brought to such limits can catch even light.</p><br/><p>Even if Inflation were to shoot light divine power at the Black Hole, before it reaches the ultra-compressed dark matter that serves as its core, the light would be crooked by the gravity, and be trapped eternally in the schwartzshield radius.</p><br/><p>But in order to achieve that, a half-assed Black Hole is not enough.</p><br/><p>At the very least, it would need several times more mass than the Black Hole that erased Mantle, and if I were to create something like that, it would at the very least destroy the world partially.</p><br/><p>(…It is just as you say, in the fight 1,600 years ago, I had a way to win. But that path would at the same time lead to the destruction of the world. I, who chose to protect the humans, being the one who destroys the humans would be getting my priorities backwards, don’t you think?) (Entropy)</p><br/><p>(Weakling!!) (Quasar)</p><br/><p>Quasar lashed with a single word.</p><br/><p>(Weakling, weakling!! That’s called being a weakling!! A God is the world’s summit, and the summit of those Gods is you! You are the one who stands on top of all things, and yet, why do you have to be considerate of the ones below you?! The lower ones should be the ones doing things for the top!! You who are the top of the top has broken this order, so this world got distorted. It became a world where trash like Nova and Coacervate treated it as if it were their own.) (Quasar)</p><br/><p>(Quasar, you—!) (Entropy)</p><br/><p>You were thinking in that way?</p><br/><p>(I am also a God. I stand at the top of the world, and as a God that exists to rule the world, it is obvious that I would push through in that duty of mine. And whether it be lucky or unlucky, the most clearest objective to become the ultimate God has been prepared for me. It is you, Dark God Entropy.) (Quasar)</p><br/><p>(Me huh.) (Entropy)</p><br/><p>(1,600 years ago, seeing how you showed such uncouth sight and was sealed, I swore this. ‘You will one day come back, at that time, I will gain strength and I will defeat you with my own strength. I will become the ultimate God’.) (Quasar)</p><br/><p>(So that’s why?) (Entropy)</p><br/><p>…</p><br/><p>(That’s why you incarnated as a human? In order to obtain the power to defeat me?) (Entropy)</p><br/><p>(…The other thing that was unpleasant was that I was unable to undo the seal that imprisoned you.) (Quasar)</p><br/><p>It looks like he plans on ignoring my question.</p><br/><p>(Even if it had been weakened by the passing of time, accomplishing a feat like undoing the seal on your own can only be done by the Light Goddess Inflation. If you are the King of Gods, she herself is the Queen of Gods. I can’t even match her.) (Quasar)</p><br/><p>I felt a jumpy glittery presence from afar.</p><br/><p>…Did she get happy being called queen?</p><br/><p>(I had no choice but to wait…for you to appear before me. And finally, that has become reality! Do you understand, Entropy?! Just how long I have been waiting for this day! My devotion, my tenacity! The time has come to tie everything up into action!) (Quasar)</p><br/><p>(Oi, Quasar—!) (Entropy)</p><br/><p>But without listening to my words, Quasar’s soul inside the human’s body was highly excited.</p><br/><p>(Fuhahahahahaha!! Well then, let’s resume our fight! But don’t think of it as the probing just a while ago. The combination of the Wind God’s divine tool, body techniques, and the ethereal research that the Wind God Quasar and the Wind Church have spent a millennium to form! That is what has led to the answer on how to defeat the ultimate!) (Quasar)</p><br/><p>This has already surpassed the dimension of being a fight between Toreido Shiva and Kuromiya Haine in order to gauge skills.</p><br/><p>It became a fight where the Wind God Quasar and the Dark God Entropy would bet their all on it.</p><br/><p>The wind grows rampant.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-145-146-a-king-and-hero\" id=\"prev_chap\" title=\"Chapter 145-146 - A king and hero\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-150-152-a-wrath-of-a-hundred-million-days\" id=\"next_chap\" title=\"Chapter 150-152 - A wrath of a hundred million days\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236306\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}