{"title": "Chapter 140-141 - Gathering of Founders", "id": 140, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-140-141-gathering-of-founders", "volume_title": "Volume 2", "body": "<h1>Chapter 140-141 - Gathering of Founders</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 140-141: Gathering of Founders</h4></header></p><div class=\"entry-content\"><br/><p>“This is—?!”</p><br/><p>The Wind Founder Shiva falters.</p><br/><p>The ones surrounding him are the equally notorious Founders of the five Churches.</p><br/><p>Earth Founder, *Nekosogi Shakaruma* &lt;Her alias in japanese&gt;; Water Founder, Ru Azul; Fire Founder, Saruo Enou; and the Light Founder, Yorishiro.</p><br/><p>“Yaho~, Karen-chi.” (Celestis)</p><br/><p>“Were you lonely, Karen?!” (Mirack)</p><br/><p>The water hero, Celestis, and the fire hero, Mirack, had also come.</p><br/><p>“Ah, Mirack-chan, Celestis-chan! So you were the ones who brought the Founder-sans, right?!” (Karen)</p><br/><p>Karen-san was also happy and held hands with her friends.</p><br/><p>Yorishiro looks at them with her eyes narrowed.</p><br/><p>“You heard about it beforehand, right? The hero alliance can show its effectiveness in this kind of way.” (Yorishiro)</p><br/><p>I see, so she used the heroes that chatter habitually in Apollon City as envoys huh.</p><br/><p>“The Earth, Water, and Fire Founders have already been notified of my claim via the heroes. Along with a message telling them that if they agree, they were to gather in this place. I can take our meeting here today in that way, right?” (Yorishiro)</p><br/><p>Yorishiro, who is without doubt the youngest one within the Founders, looked around the people of her same position that were a lot older than her.</p><br/><p>“…Well, I have a big debt with ya guys because of that incident before. With that also taken into consideration, I be riding on this talk-sa ne.”</p><br/><p>“Whether it is a Founder or a merchant, there’s the need to discern the benefits of the future. The claim of Yorishiro-dono, I felt it was a business opportunity.” (Azul)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>Positive words from the Earth, Water, and Fire Founders.</p><br/><p>Hearing this, Shiva made a bitter expression.</p><br/><p>“Now then, what will you do, Wind Founder? Four of the five agree; even if you cry alone, it will only sound like a spoiled brat, you know?” (Yorishiro)</p><br/><p>“…Hmph, fine.” (Shiva)</p><br/><p>Shiva says this as if spitting it out.</p><br/><p>“It is not like I am not interested in the claim of the Light Founder. Let’s see in detail if that’s not just nonsensical talk.” (Shiva)</p><br/><p>“Thank you very much. Well then, let’s leave it at having an unanimous vote in opening the Five Founders Conference. Uhm, is the assembly hall really okay to be where you wish it to be?” (Yorishiro)</p><br/><p>Assembly hall?</p><br/><p>While I was confused, the Wind Founder says in an exaggerated manner.</p><br/><p>“Very well. This time’s Founder Conference will be in our headquarters, Rudras Metropolis. That’s why we have come here along with our land.” (Shiva)</p><br/><p>Eh?</p><br/><p>In other words, we will be entering that moving city?</p><br/><p>Karen-san and Yorishiro were whispering at my side.</p><br/><p>“This is…it has become quite the event, don’t you think? To think we would be able to check out the Wind capital!” (Karen)</p><br/><p>“Yeah, to think the Wind capital that has been denying outsiders has invited us, moreover, we didn’t even ask for it. That’s exactly what you would call, ‘what kind of wind is blowing here’?” (Yorishiro)</p><br/><p>It seems like it really is a big deal.</p><br/><p>In the time I was sensing an incredible atmosphere here, the talk between the tops was steadily progressing.</p><br/><p>“Wind Founder, Shiva-sama, we appreciate your kindness, but your people have been in secrecy for a long time, and for your people, the Wind capital is supposed to be the very definition of a sacred land that no one can step into. Can you please tell us the reason why you have decided to accept us in it?” (Yorishiro)</p><br/><p>“Let’s just say this was on the discretion of the Wind God.” (Shiva)</p><br/><p>Quasar’s discretion huh.</p><br/><p>That air-like God, what is it thinking?</p><br/><p>“BUT…” (Shiva)</p><br/><p>Shiva resolutely said this.</p><br/><p>“Of course, I will be placing restrictions on the people entering. First of all, the only ones that can enter are the Founders. I will allow one bodyguard per church. Is there any objections?” (Shiva)</p><br/><p>One bodyguard max.</p><br/><p>That means the role will naturally fall onto the heroes.</p><br/><p>“Oya oya, how cold. Since it was a rare chance, I brought a lot of people in order to deepen each other’s understanding.” (Azul)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>Looks like the Founders are also dissatisfied with it.</p><br/><p>But even so, this is a visit from the Founders.</p><br/><p>All churches have come with a unit of at least a hundred soldiers, and now that it has been allowed to take only one from that group, it would certainly be stingy.</p><br/><p>“I will have the remaining people camp at the outskirts of the moving city. We will provide the facilities and food for that. There should be no complains with that.” (Shiva)</p><br/><p>“This just be a hypothetical scenario but…”</p><br/><p>Is what the Earth Founder Obaa-san said.</p><br/><p>The volume of her voice was low, but it was a voice that was so sharp it felt as if a scythe was thrust at your neck.</p><br/><p>“If an unexpected situation occurs inside the city, what shall be done? The only ones who can enter the city will be the Founders and the heroes. They are existences that be irreplaceable for the church. The time something happens, can ya take responsibility?”</p><br/><p>“At that time…” (Shiva)</p><br/><p>A faint smile appeared in the face of Shiva.</p><br/><p>“You can attack Rudras Metropolis with all the soldiers that are at standby outside. Even if they are not as strong as heroes, if it’s with several hundreds of combatants that can control divine power, they should be able to at least destroy the tires of the moving city easily. That way, we will be sitting ducks.” (Shiva)</p><br/><p>The conversation of these two had the scent of implied danger in it.</p><br/><p>There’s not many unexpected situations that can occur inside Rudras Metropolis.</p><br/><p>If there is, it would be one thing.</p><br/><p>The Wind Church is using this opportunity to capture the Founders and heroes that have entered their bosom.</p><br/><p>With the matter of them being secretive and then suddenly saying they will be receiving the Founders inside their base, it reeks of suspicious.</p><br/><p>It can’t be helped to think that there’s some sort of hidden agenda here.</p><br/><p>The Obaa-san, who was a past hero, pointed out this possibility and warned them to ‘not do anything weird’, and the Wind Founder answered in response with ‘if you think it is weird, just attack’ as he faced her.</p><br/><p>It was as if sparks were flying.</p><br/><p>“It is embarrassing saying it myself but, within the five major cities, Rudras Metropolis is the smallest. The population is also the lowest. If we fight straight on, the ones falling first would definitely be us.” (Shiva)</p><br/><p>“That’s why ya were thorough with that secrecy, and were progressing with the ethereal research the most compared ta anywhere. There be no doubt that ye guys be the weakest if we were to fight head on, but there be no way ye thinkin’ about fighting head on. Yer not someone we can lower our guards on-sa ne.”</p><br/><p>I feel like the sparks might create fires already!</p><br/><p>“Now now, isn’t it fine already?” (Azul)</p><br/><p>Unable to endure the atmosphere, the Water Founder, that looked like the one with the weakest marrow, interjected.</p><br/><p>“No matter what we will be talking about and what we decide on, what’s necessary is trust between churches, right? If there’s no trust, there’s no point no matter what’s decided on.” (Azul)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>And the Fire Founder accompanies his words.</p><br/><p>“Fuh, well fine. It be just as the Water guy said. For now, I be ‘trusting’ ya Wind guy. If ya betray me, killin’ ya would be a justified cause after all.”</p><br/><p>“Hmph, fine.” (Shiva)</p><br/><p>Looks like things have wrapped up for now.</p><br/><p>“Sasae, how about coming together with me? Seeing a foreign city can be a learning experience for the future.”</p><br/><p>“Understood, *Sobo-chan*!” (Sasae) &lt;You will be learning all ways of saying Grandma with this Earth Founder! &gt;:D&gt;</p><br/><p>“This one will of course be asking Celestis to be my bodyguard. If you are with me, this one will feel as if this one is on board of a cruiser after all.” (Azul)</p><br/><p>“Oka~y! Leave it to me, Papa!” (Celestis)</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“At your command.” (Mirack)</p><br/><p>The other churches were steadily deciding on their bodyguards.</p><br/><p>As expected, the ones chosen as bodyguards are all without exception heroes.</p><br/><p>And so, the problem falls onto the Light Church.</p><br/><p>The one who will be personally selected as the bodyguard of Yorishiro would normally be the hero Karen-san, but Yorishiro also has an exclusive bodyguard called Doraha.</p><br/><p>On top of that, well, I am probably counted.</p><br/><p>Who is Yorishiro going to choose from us three?</p><br/><p>141: The chosen ones</p><br/><p>“As expected, the one who should be going here is Karen-san. The Light Founder should be protected by the light hero.” (Haine)</p><br/><p>When I bring out a sound and proper argument, Karen went against it.</p><br/><p>“No, I think it is better for Haine-san to go. Thinking about the things that will be talking about at the conference, it is definitely necessary for Haine-san to be there.” (Karen)</p><br/><p>In order to form this Five Founders Conference, Yorishiro submitted the Mother Monsters as a topic of discussion.</p><br/><p>There’s no doubt that the talk about these existences will be discussed in the conference.</p><br/><p>“Now that the attendance is restricted to only Founders, there’s no other choice but for the other people to accompany the Founders as bodyguards. Haine-san, please take that seat!” (Karen)</p><br/><p>“Wait please. This is just…” (Haine)</p><br/><p>My gaze went to the other problem -to the dark skin girl, Doraha.</p><br/><p>“…What is it?” (Doraha)</p><br/><p>Karen-san and I look silently at her.</p><br/><p>She has been attached deeply to Yorishiro since the time she left the Underworld Country, and she doesn’t leave her side.</p><br/><p>To pull apart Doraha from Yorishiro…</p><br/><p>And to leave her at the outskirts of the city…</p><br/><p>“It feels terrible, as if I was taking away the mother of a small girl and abandoning her outside!” (Haine)</p><br/><p>“…”</p><br/><p>It looks like Karen-san felt the same. She had a serious expression all around.</p><br/><p>Now then, what should we do really?</p><br/><p>As expected, separating Doraha from Yorishiro would definitely hit my conscience, so let’s decide on Doraha going then?</p><br/><p>According to Karen-san, she has fighting ability that is plenty satisfying to act as the bodyguard.</p><br/><p>“Please wait.”</p><br/><p>At that moment, the very person that has to decide a bodyguard appeared -Yorishiro.</p><br/><p>“Before beginning the Five Founders Conference, there’s one proposition I want to make.” (Yorishiro)</p><br/><p>“A proposition, you say?” (Shiva)</p><br/><p>Moreover, the one who spoke was not us, but Shiva.</p><br/><p>“What’s that about a proposition? We have consented on the Five Founders Conference and we are even providing our city as the assembly hall; don’t you understand how unprecedentedly gracious we are being here? You probably want to talk about increasing the number of bodyguards, but I absolutely will not accept more than one. It is most likely just a plan to have a spy slip in to dig out the details of our city though—” (Shiva)</p><br/><p>“No, the thing I want to increase is not bodyguards.” (Yorishiro)</p><br/><p>Interrupting the repetitive talk of Shiva, Yorishiro said this.</p><br/><p>“What I want to increase is the number of participants in this conference. In other words, a Founder.” (Yorishiro)</p><br/><p>“Hah?”</p><br/><p>“In this time’s conference, I want it not to be a Five Founders Conference, but a Six Founders Conference.” (Yorishiro)</p><br/><p>“”””””Eeeeeeeeeeeeeeeeeeh?!!!”””””””</p><br/><p>“Let there be hot-bloodedness!” (Enou)</p><br/><p>The sudden utterance of Yorishiro made the many people there raise their voice in surprise.</p><br/><p>“The person here, Kuromiya Haine, is…” (Yorishiro)</p><br/><p>Is what Yorishiro says as she places both hands on my shoulders, and then, she presses her boobs stealthily on my back in a way that the people around wouldn’t notice.</p><br/><p>“Is a person that can control the rare dark divine power. What I am saying is that I want to have him participate in the conference with the same speech right as a Founder.” (Yorishiro)</p><br/><p>“Darkness, you say?!” (Shiva)</p><br/><p>No no no no no no!</p><br/><p>What are you doing throwing explosive statements one after the other, Yorishiro-san?</p><br/><p>“Karen-san.” (Yorishiro)</p><br/><p>“Y-Yes?!” (Karen)</p><br/><p>Ignoring the confusion of everyone, Yorishiro continues speaking.</p><br/><p>“You will accompany Haine-san as his bodyguard. I will have Doraha protect me.” (Yorishiro)</p><br/><p>“Yes, but is that okay?” (Karen)</p><br/><p>“It is okay. ︎” (Yorishiro)</p><br/><p>Even if you say that cutely…</p><br/><p>At any rate, the problem about not being able to decide between Karen-san, Doraha, and I, has been resolved by having all of us participate…right?</p><br/><p>“I don’t mind.”</p><br/><p>At this moment, we received support fire from the Earth Founder-sama.</p><br/><p>“We have a crazy big debt with that Nii-chan there, ya see. That’s why, I know about how big of a vessel this Nii-chan has. If he be in the conference, it would give me peace of mind-sa ne.”</p><br/><p>“Let there be hot-bloodedness.” (Enou)</p><br/><p>“Looks like the Earth and Fire are okay with it, in that case, this one also okay with it.” (Azul)</p><br/><p>It looks like the Founders are steadily accepting?!</p><br/><p>I thought that the Wind Founder would be vehemently against it in response, but…</p><br/><p>“Do as you please.” (Shiva)</p><br/><p>He unexpectedly stepped back easily.</p><br/><p>“Well then, the Founders and bodyguards, I will be welcoming you to our land. The elevator will be a tight fit, but I won’t have you complain, got it? We have two unforeseen guests after all.” (Shiva)</p><br/><p>We finally take a step into the last of the five major cities, the Wind capital, Rudras Metropolis.</p><br/><p>But why is it we were trying to get here?</p><br/><p>The reason why I couldn’t remember it at this moment was because it was all taken away by the show displayed by Yorishiro.</p><br/><p>It wouldn’t be an exaggeration to say that the flow of the situation was completely in her control.</p><br/><p>As expected of the rumored strongest Light Founder and the Light Goddess that has been constantly putting pressure on the four Base Elements for 1,600 years.</p><br/><p>Thanks to that, it could be said that all events in this occasion have been utilized by Yorishiro.</p><br/><p>With this conference, she is trying to use all the five churches to find the Mother Monsters, and connect that to their subjugation.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-138-139-wandering-city\" id=\"prev_chap\" title=\"Chapter 138-139 - Wandering City\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-142-144-plan-of-the-fortune-princess\" id=\"next_chap\" title=\"Chapter 142-144 - Plan of the Fortune Princess\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236303\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}