{"title": "Chapter 161-162 - At the summit", "id": 161, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-161-162-at-the-summit", "volume_title": "Volume 2", "body": "<h1>Chapter 161-162 - At the summit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 161-162: At the summit</h4></header></p><div class=\"entry-content\"><br/><p>I continued cutting the black cloud that was covering the sky, and when the remaining left was less than a half, I -Kuromiya Haine- lowered to the ground.</p><br/><p>Wind capital’s headquarters, the Wind Grand Workshop. At the roof that was the highest part of it.</p><br/><p>“You have finally appeared.” (Haine)</p><br/><p>There’s only one reason why I lowered myself from the sky.</p><br/><p>Because I found the objective I was searching for.</p><br/><p>The Wind Church’s Founder and hero, Toreido Shiva, and also the incarnation of the Wind God Quasar.</p><br/><p>“I can take it as the ‘hide and seek’ is over, right?” (Haine)</p><br/><p>The reason why he hid himself was because he himself is the control tower of the Wind Mother Monster, Beelzebub.</p><br/><p>If the very culprit that created the demonic flies were to order them to stop, they should.</p><br/><p>Knowing this, he disappeared from our sight in order to not be caught.</p><br/><p>And yet, the reason why he appeared in front of me is…</p><br/><p>“To think that you would be able to partially destroy my Beelzebub in less than half a day.” (Shiva)</p><br/><p>Shiva looks at the sky as he said this.</p><br/><p>I could tell a sense of abandonment from those words.</p><br/><p>“But Beelzebub and the Kazama Shinobis have done their job plenty well. They managed to stall the troops outside and the heroes that were the closest to you, and separated you from them. With this, we can truly have a one vs one.” (Shiva)</p><br/><p>“You…still want to fight?” (Haine)</p><br/><p>“Of course. With just that superficial fight just now, don’t think that you have seen the whole of my 1,600 years of studies. I haven’t shown you everything yet. All the power of a God and a human.” (Shiva)</p><br/><p>Shiva takes a stance with his pair of guns.</p><br/><p>“Releasing divine power as the Wind God Quasar to a point that it would damage the flesh, I will smash you with all the abilities that this body has learned. The power of a God and the techniques of a human; at the time when it surpasses the limit, even I don’t know what will occur! There’s no opponent as fitting as you, Dark God Entropy, in smashing them with this!” (Shiva)</p><br/><p>“That’s why you went as far as using the Mother Monster to pull me away from the others? In order to have a true one vs one fight?” (Haine)</p><br/><p>“Who knows. It is just that this fight between Gods that will be occurring now, it would be a waste to show it to humans.” (Shiva)</p><br/><p>I wonder how serious are those words?</p><br/><p>It is true that a fight that will be utilizing the very depths of a God’s power is something that can’t be shown to humans.</p><br/><p>It would reveal our identities, and the effects it would have on the human society would not be normal.</p><br/><p>Also…</p><br/><p>If a human were to get close to a clash between Gods, they would get dragged into it and won’t leave a trace behind.</p><br/><p>Could it be that Shiva was…</p><br/><p>“Now! Take off that human body and come at me! A battle where the Wind God Quasar bets his all! I will take you on, summit of Gods!” (Shiva)</p><br/><p>And in response to the enthusiastic Shiva, I…</p><br/><p>“Don’t wanna.” (Haine)</p><br/><p>I give out an immediate answer.</p><br/><p>“What?!” (Shiva)</p><br/><p>“I don’t want to fight you. It is fine as long as you call off the flies that are clinging onto the humans.” (Haine)</p><br/><p>“Hmph, I knew you would say that. That’s why I had Beelzebub take control of the humans beforehand. What it means is that, if you want to save them, you have to fight me and defeat me!” (Shiva)</p><br/><p>“Shiva!!” (Haine)</p><br/><p>“I have prepared such a setup. If you pulverize this human body, Beelzebub will automatically fall, and the people who are controlled will be saved….. The objective of you guys at first was to subjugate the Mother Monsters, right? Isn’t that nice then? All your objectives have overlapped!” (Shiva)</p><br/><p>So he calculated that far when he had the Mother Monster rampage?</p><br/><p>All in order to have a serious fight with me?</p><br/><p>“Even so, I don’t want that. I can’t fight you.” (Haine)</p><br/><p>“You are still hesitating?!” (Shiva)</p><br/><p>“Because you have already won against me.” (Haine)</p><br/><p>“What?!” (Shiva)</p><br/><p>He has already won.</p><br/><p>Those words caught him by surprise.</p><br/><p>“The proof of that is this city.” (Haine)</p><br/><p>From the roof we are standing on, I was able to take a look at the cityscape of Rudras Metropolis.</p><br/><p>I, who was high in the sky a while ago, was able to see it in a much bigger picture.</p><br/><p>Giant constructions; they were all systematically sorted in divisions. The people there have come out to see what the uproar is all about, but even so, they are not panicking around.</p><br/><p>It is proof of their utmost trust towards the rulers of this city, the Wind Church.</p><br/><p>“You were the one that made this city, right? You gave birth to this city as a God, and raised this city as a Founder. That’s is something I couldn’t do in the 1,600 years I was sleeping.” (Haine)</p><br/><p>“…You love humans from the bottom of your heart after all. You love humans, and tried to guide them, but because of the seal, you couldn’t do that…… This Rudras Metropolis is exactly what you wanted to make!” (Shiva)</p><br/><p>So you get it.</p><br/><p>“‘What you wanted to do but couldn’t, I was able to. That’s why it is my win’, is that what you are saying?! …….What about it?!” (Shiva)</p><br/><p>Shiva said this with a face as if scoffing.</p><br/><p>“I created this city in order to defeat you. In terms of pure God power, there’s no one who can stand up against you. Resisting the shame, I tried to device a new power to defeat you. This city is my laboratory for experimentation. For several centuries, I have been polishing my power to defeat you. But I couldn’t reach it.” (Shiva)</p><br/><p>“That shouldn’t be the only thing that you obtained from this city!” (Haine)</p><br/><p>The several centuries he lived at the Wind Church. Just how many humans were born and how many died? The Wind God Quasar should have been living together with them all this time.</p><br/><p>“Shiva, this is not the only time that you have incarnated as a human, right?” (Haine)</p><br/><p>“……The moment I died, I would soon incarnate into a baby in this city again. I have been living in this Wind Church practically without pause. I don’t remember accurately how many times I have incarnated anymore.” (Shiva)</p><br/><p>“No wonder the Gods weren’t able to catch your whereabouts.” (Haine)</p><br/><p>“And what about it?! How many times do I have to say it before you understand?! For me, this place is only a laboratory to experiment ways to obtain the power to defeat you! The humans that live here are just assistants in my research, and are more like guinea pigs. Stop it with your naive way of thinking as if everything is a flower field!” (Shiva)</p><br/><p>“I saw this city from the sky. The city is ordered methodically like a Go board. It is a bit of a suffocating place, but that’s just how you are. Even so, there’s hospitals, schools, and facilities for recreation like parks.” (Haine)</p><br/><p>Wind Founder Shiva… Wind God Quasar…</p><br/><p>“If you really thought of the people here as guinea pigs, you wouldn’t made such buildings. I can tell. The humans, you actually—” (Haine)</p><br/><p>“Aniue-sama!!”</p><br/><p>The words I was about to continue had been interrupted by someone.</p><br/><p>When I turn around, someone shows up from the stairs to the roof. Probably a woman I have met for the first time.</p><br/><p>And there’s also Karen-san following right behind.</p><br/><p>“Haine-san!!” (Karen)</p><br/><p>“Karen?! Why are you here by yourself?!” (Haine)</p><br/><p>Karen-san runs to me.</p><br/><p>On the other hand, the woman I have seen for the first time runs towards Shiva.</p><br/><p>“Haine-san! The Founder-samas have all escaped Rudras Metropolis, and are heading towards the troops of their respective faction to regroup with them. Mirack-chan, Celestis-chan, and Sasae-chan are together with them as bodyguards!” (Karen)</p><br/><p>Are you fine being here then, Karen-san?</p><br/><p>“Yorishiro-sama is together with Doraha-san. They have headed to where the Aurora Knight corps are. Yorishiro-sama actually wanted to come here as well, but she said she can’t abandon her comrades…” (Karen)</p><br/><p>I am relieved that her common sense as a Founder is still working!</p><br/><p>“And so…I have a message from Yorishiro-sama to Haine-san.” (Karen)</p><br/><p>“Yes?” (Haine)</p><br/><p>“The key to open the heart of the Wind Founder Shiva-sama is that person there, she said!” (Karen)</p><br/><p>I follow the gaze of Karen-san, and there, there’s the mysterious woman that appeared suddenly.</p><br/><p>Is it my imagination that her appearance resembles that of Shiva?</p><br/><p>“She is the little sister of the Founder Shiva-san, Hyue-san.” (Karen)</p><br/><p>“Little sister?!” (Haine)</p><br/><p>Well, yeah, even if he is the incarnation of a God, that doesn’t mean he was born from the ground. He has parents, so obviously, there’s the possibility of having siblings.</p><br/><p>Even if they are siblings of an incarnator, the other side will be actual proper humans. They will have the soul of a human, and in a spiritual sense, they have no connections to a God at all.</p><br/><p>But humans don’t connect with others simply spiritually.</p><br/><p>A blood connection is also a splendid connection between hearts.</p><br/><p>“…Haine-san, there’s something I want you to hear.” (Karen)</p><br/><p>“Yeah?” (Haine)</p><br/><p>“This is something I heard from Hyue-san just a few moments ago but…Yorishiro-sama wanted me to tell Haine-san just how the current Wind capital, Rudras Metropolis, was created and how they have continued existing until now. She said it was really important.” (Karen)</p><br/><p>The birth of the Wind capital, and its development.</p><br/><p>That in itself is the personal history of the 1,600 years of the Wind God Quasar.</p><ul><li>162: Next path of the Wind</li></ul><br/><p>This is the story that has been passed down in the Wind scriptures; the story of the beginnings of the Wind Church.</p><br/><p>The person that was the founder of the Wind Church, was said to be a person that had no place to call a homeland and lived a nomadic life, moving from one settlement to other.</p><br/><p>Leading a group of people that had no place as well, they had a long journey in search of a land where they can live peaceably.</p><br/><p>But they were not accepted anywhere, and their journey with no destination continued.</p><br/><p>By the time he was beginning to think that he would become a corpse on the roadside…a God appeared.</p><br/><p>The God introduced itself.</p><br/><p>‘I am the Wind God Quasar’.</p><br/><p>The God that governs over wind can’t give them a land for them to live peacefully. But blowing a tailwind on them on their journey, it could protect the travellers.</p><br/><p>‘If you revere me as your God, I will blow wind that protects you wanderers. I will provide you with a place at the other side of the wind’.</p><br/><p>And so, the founder of the Wind accepted that proposal, and the nomads there had become the Wind Church.</p><br/><p>A miracle happened soon after.</p><br/><p>Right after they received the oracle, the wife of the founder that was unable to have a child for a long time had conceived a child, and a healthy boy was born.</p><br/><p>The treasured son of the founder was smart and wise since very young, and when he became an adult, he was the strongest and smartest in the church; he became an excelling leader.</p><br/><p>The Wind Church began to develop and grow to be the true Wind Church in essence when this man had become the Founder.</p><br/><p>By that time, the Earth, Water, Fire, and Light Churches had begun to take form as well. They pressed forward in seeking for new believers, and increased their influence followed by their military power.</p><br/><p>From within those, the Wind Church, which was the weakest and smallest of them, took advantage of not having a set base to appear and disappear, making sport of the churches that tried to oppose them.</p><br/><p>Even when time passed, the Wind Church continued having excellent Founders, and in the state where the five Churches competed with each other, they continued holding a peculiar spot for themselves.</p><br/><p>In time, ethereal was discovered, and with the decision of the Founders at that time, the research began as soon as possible.</p><br/><p>Following the orders of the successive Founders and utilizing the know-hows of the varied fields as time went on, they finally completed the moving city, Rudras Metropolis.</p><br/><p>At that time, the wind people finally obtained a land to live in.</p><br/><p>The Wind had reached their goal.</p><br/><p>***</p><br/><p>“…Apparently, Shiva-san is the first Founder since the time this moving city was completed.” (Karen)</p><br/><p>Karen-san tells me the story just as she was told probably from the girl called Hyue.</p><br/><p>“He took the initiative to lead the Church that was completely new in all aspects, and kept in order the Wind Church that had stopped being nomadic, and yet, still continue being wanderers. For the people of Rudras Metropolis, Shiva-san is an incredibly popular Founder-san, they say!” (Karen)</p><br/><p>On the other side, Shiva was being clung onto by her little sister Hyue.</p><br/><p>“Aniue-sama! Please tell them the truth!” (Hyue)</p><br/><p>The sudden appearance of his little sister had made Shiva silent.</p><br/><p>“Lately, you have been gathering information from the Kazama Shinobis that you have spread around various places, and I could tell that the more information you gathered, the grimmer your expression got. And then, when the call from the Founder came this time around, it was if you had been waiting for it!” (Hyue)</p><br/><p>There was something that bothered me from what those two were talking about.</p><br/><p>“Kazama?” (Haine)</p><br/><p>“It is apparently the official name of the Wind Church’s military power, the Whirlwind Raid corps. Kazama means spies of the Wind. They fight as well, but more than that, they infiltrate the other churches, and their main duty is to steal information. Thanks to that, we don’t know anything about the Wind Church, and yet, the Wind Church knows a variety of things about us, it seems.” (Karen)</p><br/><p>They had such a system…</p><br/><p>In that case, could it be that the battles with the Fire Cow Phalaris, the Hydra Serpent, and Grandma Wood had reached the ears of Shiva as well?</p><br/><p>If that really is true…if in that, he had information of a man that controlled a black substance…</p><br/><p>“I don’t understand why Aniue-sama is so concerned with that man called Kuromiya Haine. But Aniue-sama has never said anything wrong until now. That’s why this time as well, in order to create a one vs one, we have taken the role of stalling the Founders and heroes of the other churches. But…!!” (Hyue)</p><br/><p>Hyue’s expression changes into one of pain.</p><br/><p>It was as if she had resolved herself as she continued her words.</p><br/><p>“The people of the outside said this! The identity of the ‘Wind Barrier’ is…a fiendish monster! They said that Aniue-sama is using it to destroy the world! I don’t want to believe that. But…But—!!” (Hyue)</p><br/><p>“Hyue!!” (Shiva)</p><br/><p>Shiva stopped his sister who was trying to say more.</p><br/><p>The tone of voice that he followed with was as if saying that he wouldn’t allow her to get in the way, and at the same time, it felt as if he was being considerate of not hurting the other party.</p><br/><p>“I…am trying to finish a duty of mine.A duty that I have been continuing for a long time. Entr—I mean, Kuromiya Haine, what you want to know is the way to stop Beelzebub, right?” (Shiva)</p><br/><p>“Yeah.” (Haine)</p><br/><p>Since the words had changed direction towards me, I answer.</p><br/><p>“Stopping it is easy. As long as I order them, they will obey. But with just that, the situation won’t be resolved.” (Shiva)</p><br/><p>“What?!” (Haine)</p><br/><p>“Beelzebub is an army of billions, and yet, it is one monster. It is not that each one of them has a will of its own. They possess a joint will shared through an element wave. They are an army, yet, the reason why they are able to obey my orders all at once is because of this.” (Shiva)</p><br/><p>“And what of it? Don’t beat around the bush!” (Haine)</p><br/><p>“That joint will through elemental wave isn’t perfect. When it separates from the swarm, and goes out of the effective range of the joint will, that individual will lose its will as Beelzebub. If they are caught in something and are cut off from the elemental wave, they will end up in that same state as well.” (Shiva)</p><br/><p>“Wa?! Then, could it be…!!” (Haine)</p><br/><p>The flies that have invaded the bodies of the humans and are currently the most pressing issue right now are…!!</p><br/><p>“Just as you have concluded, the ones that have usurped the body of the humans, due to being inside the body, they have separated from the will of Beelzebub. And so, those ones will faithfully follow the last order they received.” (Shiva)</p><br/><p>“The order of filling the usurped humans with eggs?!” (Haine)</p><br/><p>“That’s right. The time they leave the body of the humans is when they have executed their order. In other words, when the eggs hatch, they will come out together with the monsters that eat their way out of the host.” (Shiva)</p><br/><p>Then there’s no point!</p><br/><p>Most of the troops outside Rudras Metropolis must have been usurped by Beelzebub already.</p><br/><p>Are you saying that those people have no choice but to be the seedbed of the flies and die?!</p><br/><p>“There’s only one way though. It is not to control Beelzebub, but to kill it.” (Shiva)</p><br/><p>“Kill it?! Is it possible?!” (Haine)</p><br/><p>“Beelzebub is one and many. Each one of the billions of flies have their own body, but they are just one; there’s one individual that stands on top of all the flies. It can be considered the Lord of Flies.” (Shiva)</p><br/><p>“As long as I defeat that, all of Beelzebub will die. Is that what you are saying? The humans outside that have been usurped by flies as well without exception? Then let’s find that Lord of Flies and defeat it! As fast as possible!” (Haine)</p><br/><p>Karen-san who was listening to the talk also joined on the plan. Well then, the next problem is where this Lord of Flies is…</p><br/><p>“There’s no need to look for it.” (Shiva)</p><br/><p>Shiva says.</p><br/><p>“The Lord of Flies is here. Inside of me; inside my heart.” (Shiva)</p><br/><p>Saying this, Shiva points at the left side of his chest.</p><br/><p>“Kuromiya Haine, if you want to get rid of Beelzebub and save the people outside, pierce my heart, and erase the Lord of Flies. With that, everything will end. Everything.” (Shiva)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-157-160-sniper\" id=\"prev_chap\" title=\"Chapter 157-160 - Sniper\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-163-164-an-attack-to-end-it-all\" id=\"next_chap\" title=\"Chapter 163-164 - An attack to end it all\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236311\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}