{"title": "Chapter 196-198 - Second Match", "id": 196, "volume": 2, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-196-198-second-match", "volume_title": "Volume 2", "body": "<h1>Chapter 196-198 - Second Match</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 196-198: Second Match</h4></header></p><div class=\"entry-content\"><br/><p>“…Sis…Sis Kyouka. Are you okay?” (Mirack)</p><br/><p>The winner Mirack walks towards the fallen Kyouka.</p><br/><p>It looks like Kyouka was temporarily out of commission, but she soon regained consciousness and borrowed the hand of Mirack to stand up.</p><br/><p>“…I lost huh. This time for sure. It was great, Mirack.” (Kyouka)</p><br/><p>Kyouka was sportsmanlike to the result.</p><br/><p>Her original nature must have been her straightforwardness as well.</p><br/><p>“But ‘Fire Blade’ huh. To think you would instead concentrate the fire divine power that has the highest spread out power. I am surprised you thought of it. Well, it was exactly because of it that you were able to break through my ‘Flame Burst’.” (Kyouka)</p><br/><p>“The Mother Monsters that we are going to be fighting in the future are of a size that is out of the norms. An area of effect attack from a single human would make scant a difference against them. In that case, we should instead concentrate it all in one place and become bees that attack all at once.” (Mirack)</p><br/><p>“I see. Your fighting style just now has already reached a point that is far from our common sense huh.” (Kyouka)</p><br/><p>Saying until that point, the expression of Kyouka clouded.</p><br/><p>“…I didn’t notice at all. I didn’t know that you hated me.” (Kyouka)</p><br/><p>“I am truly sorry.” (Mirack)</p><br/><p>“I was always keeping you in mind when I acted. That’s how much I respected that straightforward effort of yours…… But when I ask myself ‘was there no sense of superiority there?’ I myself can’t answer.” (Kyouka)</p><br/><p>“I think that no matter the person, they can’t move with just a single pure emotion in mind. I was jealous of Sis Kyouka’s strength and felt an inferiority complex towards it. But at the same time, I admired it. I tried to become stronger with you as my goal. But the me that was simply trying to move while only facing forward had ended up seeing nothing aside from what was in front of me. Even though there were a lot of things that I should have been looking back to.” (Mirack)</p><br/><p>“Are you saying…they are the ones who have made it possible for you to see it?” (Kyouka)</p><br/><p>The comrades in the audience seats that were happy at the victory of Mirack.</p><br/><p>Karen-san who had finished her examination was waving both hands vigorously. Mirack answers this by raising her fist high in the sky.</p><br/><p>“Sis Kyouka called it being domesticated, but it was exactly because of it that I ended up thinking about getting further strength. There’s a limit to how strong a person can become on their own. The Mother Monsters are opponents that make you understand this. Moreover, there are existences even stronger than that that might be born…” (Mirack)</p><br/><p>“It is fine. No need to say anymore. I lost. There’s no words to say to the loser!” (Kyouka)</p><br/><p>Kyouka patted the cheek of Mirack.</p><br/><p>“Do it properly, fire hero.” (Kyouka)</p><br/><p>This is of no importance, but when I looked at the noble area of the audience seats, the Fire Founder was wailing in manly weeping.</p><br/><p>For him, the two of them are his cute disciples after all.</p><br/><p>***</p><br/><p>Just like this, the first match of the old and new heroes had ended with the victory of Mirack.</p><br/><p>So we are leading by one point.</p><br/><p>A bitter voice greeted Kyouka who had lost and was about to leave the place.</p><br/><p>“How pathetic. Displaying such an unrefined match like that and still losing. As I thought, the heroes of other churches can’t be relied on.”</p><br/><p>Words close to abuse.</p><br/><p>Passing by the owner of that voice, Kyouka silently says this.</p><br/><p>“Then show it to me, this so called refined fighting style of the water hero that you boast of.” (Kyouka)</p><br/><p>“Of course. I will show you the difference between a true hero and a fake hero.” (Sarasa)</p><br/><p>The second match is the water hero battle.</p><br/><p>The previous hero that stood on the battle stage replacing Kyouka was Ra Sarasa.</p><br/><p>Facing her was of course…</p><br/><p>“…Good job on the opening. Thanks to you winning, I am now in a good mood to sing.” (Celestis)</p><br/><p>“The song will obviously be a victory song, I hope. If that’s not the case, I will drag you out of the stage, you got it?” (Mirack)</p><br/><p>Exchanging a high five with good momentum, the one who substituted Mirack and went on the stage was the water hero Celestis that had a big smile and shining eyes, dazzling everyone in the audience seats.</p><br/><p>“Oooh!! It is Celes-tan!!” “I have been waiting!” “Celes-tan, kyuuuutttt!!” “Hoh! Hoh! Hoh! Hoh!!” “C-C-C-Celes-tan!!!”</p><br/><p>Incredible cheers were coming from the audience seats.</p><br/><p>The person that even when she is a hero, she is also working as an idol.</p><br/><p>This match where there’s many spectators actually felt like the live performances she habitually holds. Just for this moment, the dome had become the sole stage of Celestis.</p><br/><p>With practiced movements, Celestis makes a smooth turn as she waves at all directions.</p><br/><p>Even bigger cheers burst.</p><br/><p>In this venue that was being covered with a sense of unity, there was a single person that lwas scowling at this.</p><br/><p>“…What a vulgar voice. I am surprised at how those adults can let out such strange voices. It is way too embarrassing.” (Sarasa)</p><br/><p>Sarasa covered her face with her opened folding fan and hides her mouth that was frowning.</p><br/><p>“Ara, could it be that it is tough to keep up with your granny stamina? But too bad. I still haven’t considered how to give live performances to people of age, you see.” (Celestis)</p><br/><p>“Keep barking.” (Sarasa)</p><br/><p>Sarasa said in a strict voice.</p><br/><p>“Since I have the chance, I will put it clearly here. I definitely won’t forgive you. You are the shame of us Water Church. Today in this place, I will be handling judgment upon you. Prepare yourself!!” (Sarasa)</p><br/><p>That’s right.</p><br/><p>The emotions that Sarasa was directing at Celestis had clear hostility.</p><br/><p>Just why does she hate Celestis so much?</p><br/><p>“…Well, I don’t understand things like the formalities and traditions of the other churches. But why is it that you can talk so unfavorably about others with just that reason alone?” (Celestis)</p><br/><p>The Miki-Moses covers the body of Celestis.</p><br/><p>That divine tool was being clad in water divine power.</p><br/><p>“Of course, I am an idol, but I am also a hero. I will buy that fight you are selling me. Especially the fight you are picking, not only on me but also on my important friends. I will be returning it all ten-fold!!” (Celestis)</p><br/><p>Second match.</p><br/><p>Current hero Re Celestis vs previous hero Ra Sarasa.</p><br/><p>“Match, begin!”</p><ul><li>197: Mixing without being mixed</li></ul><br/><p>“[Water Rage]!” (Celestis)</p><br/><p>“[Water Blade]!” (Sarasa)</p><br/><p>The water bullet shot from the Miki-Moses of Celestis, and the high pressure water blade released from the water folding fan, Dahyu, of Sarasa.</p><br/><p>Both of them clash in the air and, no matter the times, the high-pressure blade won and would cut the water bullet in half.</p><br/><p>Celestis had to avoid the water blades that continued on with its original speed.</p><br/><p>And I was busy erasing them with dark matter to make sure the water blades didn’t attack the audience.</p><br/><p>“Hohohohoho~~, how is the sharpness of the ‘Water Blade’ released from the water folding fan? That childish water play of yours doesn’t even serve to delay them.” (Sarasa)</p><br/><p>“The water folding fan, Dahyu, was made from the same cloth as my robe, Miki-Moses. The biggest trait of the folding fan is that it is firmly serving as the bone for the cloth which makes the water bullet take that blade-like form.” (Celestis)</p><br/><p>“The water bullet that has been made thin due to the paper and cloth can already be called a water blade. It will cut everything. In my active days, several hundreds of monsters have become rust to this blade.” (Sarasa)</p><br/><p>“Rust in a water blade, can you make a less coherent sentence?!” (Celestis)</p><br/><p>The retort of Celestis only felt like her distracting herself from her pain.</p><br/><p>“The biggest strength of the water divine power is its wideness in practical use. At times, it can wet your thirst; at others, it can create raging streams; and at other times, it can rot something by stagnating it. Just like how water itself has innumerable faces, the water divine power can be divided with just a single change. My water folding fan is one of those faces.” (Sarasa)</p><br/><p>The robe of Celestis and the water folding fan of Sarasa; even within the divine tools of the new and old heroes, the divine tools of these two are the ones that are the most different in form.</p><br/><p>The reason for it has been revealed.</p><br/><p>“Compared to that, Celestis-san, that robe of yours feels like it is a representation of the wavering character of its user. The cloth that one would normally adjust to their own individual traits, you have utilized it just as it is; that’s unheard of. I am shocked by your blatant negligence.” (Sarasa)</p><br/><p>“Is that so? I myself think that I have drawn a jackpot though.” (Celestis)</p><br/><p>“That’s just because your brain is lacking!” (Sarasa)</p><br/><p>A water blade was released again.</p><br/><p>Celestis already didn’t try to stop it with a water bullet and concentrated on avoiding.</p><br/><p>“You were always like that! No matter when, you would never be serious. You didn’t care about troubling others! Have you thought about how much trouble your arbitrariness causes to others?!” (Sarasa)</p><br/><p>“At the very least, I don’t remember causing you trouble though?” (Celestis)</p><br/><p>“Silence!” (Sarasa)</p><br/><p>A slightly bigger water blade was going straight at Celestis.</p><br/><p>Celestis, who had her posture crumbled due to the constant evasion, was unable to cope with it. She spread her robe and used it as a shield, somehow managing to deflect it that way.</p><br/><p>But it doesn’t change the fact that this was one-sided.</p><br/><p>“Celestis-san, a self-centered girl like you becoming a hero, wasn’t that a mistake in itself? Saying stupid things like being an idol, you are truly odious. I will correct that mistake of yours!” (Sarasa)</p><br/><p>Is there nothing that can be done anymore?</p><br/><p>Just when I thought this…</p><br/><p>“I also think a little, you know.” (Celestis)</p><br/><p>“Hah?”</p><br/><p>“Especially since the time I began fighting together with Karen-chi and the others. ‘Just what can I do inside that team?’, I thought of it deeply. And the conclusion that came out was…to bring the best out of the water’s wide amount of uses.” (Celestis)</p><br/><p>“What are you blabbering about?! I don’t care anymore. I am finishing you here!!” (Sarasa)</p><br/><p>Just as she declared, Sarasa released her last water blade.</p><br/><p>But…</p><br/><p>*splash!*</p><br/><p>“Kya?!”</p><br/><p>The moment the water blade was released from Sarasa’s folding fan, it broke and dispersed. While making a big splashing sound.</p><br/><p>“Look below you.” (Celestis)</p><br/><p>Following her words, I noticed that the surroundings are in an abnormal state.</p><br/><p>It was flooded.</p><br/><p>The floor of the battle stage that they were standing on was drenched as if a downpour had passed.</p><br/><p>“It is the water I created. You were shooting so many water blades, cutting down all my water bullets. You were a great help in camouflaging. This water here has my divine power in it, so it moves on my whim. Just like this…” (Celestis)</p><br/><p>Celestis waves her robe.</p><br/><p>As if in concert, the pool of water covering the floor shot a water bullet and grazed Sarasa.</p><br/><p>“Hiih?!”</p><br/><p>“The water blade that you shoot is basically a water bullet that has been thinned. That’s why, even if it’s strong against attacks from the front, it is weak against attacks from below. In rock-paper-scissors, the paper wins against the rock because the paper covers it, but you see, in reality, the rocks penetrates the paper!!” (Celestis)</p><br/><p>“Are you saying you shot down my water blade the moment I released it?! Were you in the defensive until now to create this water domain?!” (Sarasa)</p><br/><p>“Let’s return to the talk a few moments ago. The strength of the water divine power is in their wide ways of use. My Miki-Moses can be said to be the divine tool that brings out this strong point to its highest.” (Celestis)</p><br/><p>A simple cloth; the Miki-Moses that could even be described as that, would at times undulate, and at other times, it can become tough like a rock.</p><br/><p>“The cloth is soft and can change its shape to anything. That’s why it can become a sword, spear, shield, and even an armor. When injured, it can become a bandage, a curtain that blocks the sunlight, an overcoat to endure cold; it can become anything.” (Celestis)</p><br/><p>And in reality, at the fights with the giant monsters, we have been saved countless times by the handyness of Celestis.</p><br/><p>Karen-san had been treated by her ‘Water Heal’ just a few moments ago too.</p><br/><p>“Compared to that, Sarasa, what about you? Placing a bone to your cloth, you are now able to bring out a water blade from it. But because of that, you have lost all other uses. By specializing in attack, you have forgotten the important wideness of use. Is that really the correct form of the water hero?!” (Celestis)</p><br/><p>“Shut up! [Water Blade]! [Water Blade]!!” (Sarasa)</p><br/><p>Sarasa has been releasing water blades several times while Celestis was talking, but they were all shot down by the water bullets that came from below.</p><br/><p>The flow of the battle had turned completely into Celestis’ side.</p><br/><p>“Well then, I will now be showing you the water hero’s true way of fighting. [Water Blessing]!” (Celestis)</p><br/><p>Celestis clads the surface of her body in water divine power and slides on the water drenched floor with overwhelming speed.</p><br/><p>The ‘Water Blessing’ that’s originally used to walk on top of water, to think that it could be used in this kind of way.</p><br/><p>And with that, she instantly closed the distance between her and Sarasa.</p><br/><p>“[Water Rage]!” (Celestis)</p><br/><p>“Ugyaaaa!!” (Sarasa)</p><br/><p>A water bullet released at close range, with that, Sarasa can’t intercept it with a water blade.</p><br/><p>Aiming at that instant of an opening…</p><br/><p>“On top of that, [Water Bag]!” (Celestis)</p><br/><p>The water current that was released from her robe had imprisoned Sarasa in the blink of an eye.</p><br/><p>A mobility technique, an offensive technique, and a restraining technique; it is certainly true that the variety in the water divine power is a lot.</p><br/><p>“Damn you! Let me out! Let me OUT!” (Sarasa)</p><br/><p>“Can’t. You can’t escape from the ‘Water Bag’. You don’t have the stamina remaining for that.” (Celestis)</p><br/><p>Hm?</p><br/><p>“The ‘Water Blade’ is certainly a powerful offensive attack, but it utilizes as much divine power. You are making high enough water pressure to cut through even iron after all. Who knows how much divine power you would need to create such pressure.” (Celestis)</p><br/><p>Maybe she hit the bullseye, the beautiful face of Sarasa warped in mortification.</p><br/><p>“Also, I will be correcting one misunderstanding you had. It seems you are thinking that you are the only one who can shoot those water blades with that water folding fan, but too bad, my robe can also shoot them.” (Celestis)</p><br/><p>Celestis spreads her Miki-Moses wide and, just like that, she began to spin rapidly.</p><br/><p>The cloth that’s endowed with water is heavier than what anyone could imagine and becomes hard.</p><br/><p>By utilizing this, the Miki-Moses that had a large amount of water divine power poured into it, took advantage of the centrifugal force of the turns and…!</p><br/><p>“Revolving Style, [Water Blade]!” &lt;Jutsu!&gt; (Celestis)</p><br/><p>A water blade that revolved like a boomerang was released from the Miki-Moses.</p><br/><p>The water blade had sliced apart both the water prison and the captured Sarasa—or so I thought, but the water folding fan blocked it.</p><br/><p>“Kyaaaaa!!” (Sarasa)</p><br/><p>But the impact of it had destroyed the water folding fan, and, unable to kill all of the force, Sarasa herself was also send flying.</p><br/><p>“Well, it is tiring so I normally don’t do it though. Cutting techniques are the specialty of Sasae-chi anyways.” (Celestis)</p><ul><li>198: Hated person</li></ul><br/><p>This is…should I take it as end of the match?</p><br/><p>The blown away Sarasa somehow managed to stand up, but she is totally exhausted and doesn’t look like she can move at all.</p><br/><p>Her divine tool that served as her weapon has been destroyed, and no matter how I see it, there’s no way to turnaround this situation.</p><br/><p>“…Eh…Match ends, winner is Celes—” (Haine)</p><br/><p>“Wait!!” (Sarasa)</p><br/><p>“Woah!!” (Haine)</p><br/><p>I was shouted at in an incredibly loud tone and was stopped.</p><br/><p>Are you telling me you still have more to do, Sarasa?</p><br/><p>“I still haven’t…lost! Celestis-san, I will defeat you…!” (Celestis)</p><br/><p>“…”</p><br/><p>Celestis was watching this ghastly Sarasa with the calmness of a lake surface.</p><br/><p>When I look at this, I end up wondering who is the older one here.</p><br/><p>“…You, why is it that you hate me so much?” (Celestis)</p><br/><p>“!!”</p><br/><p>“It might be rude for me to say this but, you and I don’t have any connection. Until the day you retired and I was chosen as the successor, we didn’t even have any conversations. At the very least, I don’t remember doing anything to make you hate me.” (Celestis)</p><br/><p>“Even if you don’t…! I do!” (Sarasa)</p><br/><p>‘So I really was being hated!’, is the kind of mentally fatigued sigh that Celestis let out.</p><br/><p>“…I didn’t want to say this, but I heard about this from Papa before the match began.” (Celestis)</p><br/><p>When she talks about Papa, she must mean the Water Founder, Ru Azul.</p><br/><p>It is not officially approved, but they are both father and daughter.</p><br/><p>“I heard that you participated in today’s match without telling the family you were married in.” (Celestis)</p><br/><p>Eh?</p><br/><p>What’s the meaning of this?</p><br/><p>“The Ra household that you married into after retiring as a hero is a famous mercantile house in Hydra Ville. They are in a position where they can aim for the Water Founder spot if they wanted to. We thought the reason why you picked a fight with us this time was because there was that going on in the back, but early this morning, we received an urgent message from their head.” (Celestis)</p><br/><p>The head of the Ra household, in the eyes of Sarasa, it would be the father of her marriage partner –her father-in-law.</p><br/><p>“<i>[I am truly sorry for the arbitrary actions of my son’s wife. Our household has no intentions of going against the Water Founder; this has all been done on his wife’s own volition. If need be, I will have my son divorce his wife in order to prove the innocence of our household</i>].” (Celestis)</p><br/><p>Period.</p><br/><p>“For you, the place you are married into is the place that you finally managed to gold-dig with that hero title you worked so hard for, right? What’s the reason to hate me so much to the point that you would throw away your dreamed celebrity life?” (Celestis)</p><br/><p>“…”</p><br/><p>Sarasa didn’t answer.</p><br/><p>“……Could it be…you are hating me because I was born from the womb of the Founder’s mistress?” (Celestis)</p><br/><p>“That’s not it! I don’t care about that!!” (Sarasa)</p><br/><p>“Then what?” (Celestis)</p><br/><p>“It is because you are an idol! Even though you are a hero, you show zeal in such a show off game like being an idol! I really can’t forgive that!” (Sarasa)</p><br/><p>Hearing the declaration of Sarasa, Celestis went ‘eh?’ as she made a bitter expression.</p><br/><p>“Isn’t that something that shouldn’t be troubling you at all? No, well, I have my own thoughts regarding that, you see.” (Celestis)</p><br/><p>“No! You <i>are </i>troubling me! You are truly troubling me!” (Sarasa)</p><br/><p>“Hm?”</p><br/><p>“The good match that I finally found after harsh tribulations as a hero…! The third son of the wealthy Ra household; a handsome man with excelling physical ability and high academic achievements…!” (Sarasa)</p><br/><p>The more I hear, the more I think it is a find of superior quality.</p><br/><p>“I was truly happy being able to marry such a person, and yet…! Out of everyone, that person had to……….become a big fan of yours!!” (Sarasa)</p><br/><p>……..</p><br/><p>………….Hm?</p><br/><p>“Eh? Fan? In other words, a fan of mine as an idol?” (Celestis)</p><br/><p>“That’s right! He made a room for that exclusive use and, in there, it is filled to the brim with your idol goods! It is truly disgusting! He also doesn’t miss a single live performance of yours and boasts about it! In front of me,<i> his wife</i>! Do you know how I feel at those times?!! Can you imagine it?!” (Sarasa)</p><br/><p>Uwaaa…that’s harsh.</p><br/><p>“Uwaa~, well, thanks for the support.” (Celestis)</p><br/><p>“Rather than thanking me, please apologize! Lately, he has been requesting craftsmen to make a life-sized doll of you!! I did stop him in tears though!” (Sarasa)</p><br/><p>Is that what a rich person should be doing?! &lt;or a person in general?! —not judging taste though <b>( ͡° ͜ʖ ͡°)</b> &gt;</p><br/><p>“My woman pride is already in tatters! I have thought many times of throwing away all the idol goods while he is away! But when I think about him losing his affection towards me if I were to do that! Aside from that one point, he is a truly rich, good-looking, and kind husband! This is horrible. So harsh!” (Sarasa)</p><br/><p>Sarasa finally prostrated and began crying.</p><br/><p>Her husband is infatuated with an idol —in other words, Celestis. And due to the jealousy of it, or more like, a personal grudge, the previous water hero Sarasa had participated in this battle.</p><br/><p>I suddenly pity her.</p><br/><p>“Hm, to think that I had stolen the heart of my Senpai’s husband without knowing. I am truly a sinful woman.” (Celestis)</p><br/><p>Celestis-san, this is not the time to be pulling out jokes.</p><br/><p>I won’t be held accounted the time you are stabbed in the back by an unknown woman, okay?</p><br/><p>“It has begun to feel pitiful. I am not a woman with such a crooked personality that would want to destroy the family of someone else. Is there a way to calm the situation down smoothly?” (Celestis)</p><br/><p>“Are you going to give her the win this time?” (Haine)</p><br/><p>Is what I put out on the table and…</p><br/><p>“I definitely won’t be doing that.” (Celestis)</p><br/><p>Of course you won’t.</p><br/><p>That’s the Celestis we know and love.</p><br/><p>For now, she ignores her crying Senpai for the moment and speaks to the audience.</p><br/><p>“Everyone~! I am happy that you support me, but treasure your family as well, okay?!” (Celestis)</p><br/><p>‘Yeeeaahh!!’, was the fervent response from the audience.</p><br/><p>Second match; water hero match.</p><br/><p>The match between the current hero Celestis and the previous hero Sarasa ended with the victory of Celestis.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-193-195-match-resumes\" id=\"prev_chap\" title=\"Chapter 193-195 - Match resumes\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-199-201-third-match\" id=\"next_chap\" title=\"Chapter 199-201 - Third Match\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236327\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}