{"title": "Chapter 218-220 - One unnecessary person", "id": 218, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-218-220-one-unnecessary-person", "volume_title": "Volume 3", "body": "<h1>Chapter 218-220 - One unnecessary person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 218-220: One unnecessary person</h4></header></p><div class=\"entry-content\"><br/><p>The reformation of the Light Church was proceeding at full peak.</p><br/><p>This was possible because we managed to take all the decaying cliques out.</p><br/><p>With the dismissal of Zeberphon Dobbe as the first one, the Light Church has been cleansed from the old factions that obtained unjust profits.</p><br/><p>Bribing, embezzlement, fund reflux, profit forging, tax evasion, and many others.</p><br/><p>The people that earned a huge fortune using the old system would obviously object at changing that system. It is basically saying that they won’t be able to get the money they could have gotten after all.</p><br/><p>That’s why the Founder Yorishiro was so aggressive in the new and old heroes match. The Founders had taken a confrontational stance.</p><br/><p>The objective was simple. Make a list of the people that are against the Hero Alliance. At the very least, that was the objective of Yorishiro in that new and old heroes match.</p><br/><p>And so, that objective was accomplished with flying colors, and the faction that was against the Hero Alliance were brought out to light one after the other, and were exiled from their post.</p><br/><p>The purification of the Light Church was proceeding smoothly, and it looked as if it would continue without any problems.</p><br/><p>But there was still one big problem remaining…</p><br/><p>***</p><br/><p>“I am back~.”</p><br/><p>After I finished checking out the state of my friends, I had returned to the Light Church’s parlor room.</p><br/><p>This is a place that only a handful of people are allowed to enter. The true definition of a sacred precinct.</p><br/><p>I sat at one of the seats in the parlor room, and in there, there were four dazzling beauties lined up.</p><br/><p>The first one is the Light Founder, Yorishiro; the second one is the light hero, Karen-san; the third one is the personal bodyguard of Yorishiro and the shadow hero, Doraha.</p><br/><p>That line up is still fine.</p><br/><p>The problem is the fourth one; well, you could say it is a problem.</p><br/><p>“Welcome back, Haine-san.”</p><br/><p>The one who welcomed me was the previous light hero, Sunnysol Ates.</p><br/><p>What is this woman doing together with Karen-san and Yorishiro, and nonchalantly enjoying tea?</p><br/><p>“How was it? Do you think the lower-class people, that have risen to new positions, will be able to be of help to Yorishiro-sama?” (Ates)</p><br/><p>“Uhm, well…” (Haine)</p><br/><p>Ates who could be said to be in the opposite faction of Yorishiro is now here. Why is that?</p><br/><p>The reason itself is the very representation of why this woman is so scary.</p><br/><p>If I had to put it in words, it would be that she betrayed them. She betrayed the contra-reconciliation side that were aiming for the same objective as her.</p><br/><p>The contra-reconciliation side heavily relied on this woman, and in terms of fame, she would be able to go against Karen-san and Yorishiro.</p><br/><p>But in the new and old hero match, Ates threw them away into the fire the moment the victory of the current heroes was certain. And so, the information of the contra-reconciliation side that were her comrades had been given to Yorishiro.</p><br/><p>She was apprehended at that time, but she was soon released.</p><br/><p>That’s because the list that Ates had provided was completely accurate.</p><br/><p>The reason why the cleaning of Yorishiro is proceeding at surprising speed is mostly because the information that Ates gave had helped out.</p><br/><p>In other words, the contra-reconciliation side was sold out completely.</p><br/><p>“…Knight General Grades and Captain Vesage were more energetic than expected at the prospect of the new Light Church that will come to fruition after the reformation. It looks like they have found their own role.” (Haine)</p><br/><p>“That’s great. In order to make the new Light Church flourish, there’s the need for the lower-classes to step it up. Let’s use them to their best.” (Ates)</p><br/><p>Ates was talking as if she were the helmsman of the Light Church.</p><br/><p>Karen-san and Yorishiro haven’t spoken a single word yet.</p><br/><p>“Now now, Haine-san, you must have been tired from walking all around the place, right? As a show of appreciation, how about some tea I made?” (Ates)</p><br/><p>“No thanks, I already ate ramen with Grades-san…” (Haine)</p><br/><p>Also, the gaze that was nailed at me was silently telling me ‘don’t get deceived by someone like Ates’ as it puts pressure on me.</p><br/><p>…Ates was acting as if she were the leader of this Light Church since long ago —completely disregarding the actual leader, Yorishiro.</p><br/><p>“Please give it a break already!” (Karen)</p><br/><p>And finally, unable to bear it with only a gaze, Karen-san raises her voice.</p><br/><p>“I have endured it until now, but I can’t stay silent anymore! What is with you?! Why are you here as if it were natural?!” (Karen)</p><br/><p>Karen-san was giving such sound questions that I couldn’t even speak. It seems I was the only one in that state though.</p><br/><p>“You appeared saying that you were against the Hero Alliance. You even created a battle in order to push your ideology! And yet, you still staying here after that matter is over is way too unsightly!” (Karen)</p><br/><p>“The situation has changed.” (Ates)</p><br/><p>In contrast to Karen-san’s anger and heat, Ates had a cool expression as she sipped on her tea.</p><br/><p>“Right now, the world is in a situation that hasn’t been seen before. The Demon Lords, that wouldn’t be an exaggeration to call as the strongest monsters to ever be encountered, have declared that they will be eradicating humans, and the humans can’t avoid that full-on confrontation.” (Ates)</p><br/><p>Ates pours more tea into her finished cup.</p><br/><p>Seeing her taking her sweet time to pour it as if trying to make the taste as deep as possible was annoying to watch.</p><br/><p>“That’s why the humans have to concentrate their whole fighting force. I -Sunnysol Ates- may not amount to much, but as the previous light hero, I plan on providing my strength to the Light Church.” (Ates)</p><br/><p>“We don’t need your strength.” (Karen)</p><br/><p>Karen-san flatly refuses her.</p><br/><p>“I am the current light hero. I will repel the Demon Lords with my strength. There’s no need for your help.” (Karen)</p><br/><p>“Ara ara, what a stubborn little kitty.” (Ates)</p><br/><p>Ates giggles and stands up from her seat.</p><br/><p>“In that case, I will be taking my leave for now. This is a joint struggle, so if we don’t have our hearts as one, it won’t show any effect.” (Ates)</p><br/><p>“Eh?!”</p><br/><p>“In the time I am not here, please teach this selfish girl how reality works, Yorishiro-sama. That in order to obtain results, there are times when you need to join hands even with your most hated nemesis.” (Ates)</p><br/><p>She takes one sip of the tea she had poured just now, and then, presents it to the Founder.</p><br/><p>“No matter how cornered in distress we are, I think that we shouldn’t lose our character though.” (Yorishiro)</p><br/><p>The words of Yorishiro seemed like they were completely rejecting Ates.</p><br/><p>Ates didn’t answer to that and simply leaves with a faint smile.</p><br/><p>While leaving a bitterness in the parlor room that is normally used for friendly chats.</p><ul><li>219: A specter that can’t be exorcised</li></ul><br/><p>“Yorishiro-sama!!” (Karen)</p><br/><p>The moment Sunnysol Ates left, the parlor room grows stormy.</p><br/><p>“Why?! Why did you invite such a person into the Light Grand Church?! If a person like that roams around, I can’t even calm down to have tea!” (Karen)</p><br/><p>The hostility Karen-san had towards Ates was way too bare. To a point that it is hard to think of considering how she normally is.</p><br/><p>Karen-san is the type that doesn’t hate people at all -but Ates is an exception.</p><br/><p>Why does she have such raw hate for her? I can’t even imagine it.</p><br/><p>“The situation has changed.” (Yorishiro)</p><br/><p>From the mouth of Yorishiro, the same words as Ates came out.</p><br/><p>“I am displeased by it, but there’s no other choice but to accept it.” (Yorishiro)</p><br/><p>“Are you saying that person is necessary in our fighting force? In order to defeat the Demon Lords? There’s no need! I will defeat the Demon Lords!” (Karen)</p><br/><p>Changing the target to Yorishiro, the exact same conversation from before is repeated.</p><br/><p>“…Also, in our Light Church, there’s Doraha-san. The other churches are looking towards a stance of using the previous heroes and current ones in order to make a formation of attack and defense, but we can allot those roles with Doraha-san and I. There’s no need for the help of such a person!” (Karen)</p><br/><p>The one who is always silently following Yorishiro like a shadow, Doraha.</p><br/><p>She was the shadow hero of the past Dark Underworld Country. And that ability of hers doesn’t fall to any present hero.</p><br/><p>In reality, there was a case when Karen-san was able to travel faraway by having Doraha protect Apollon City after all. She is a reliable ally.</p><br/><p>“It is better to have as many allies as possible. Is that the kind of logic that is at work here?” (Haine)</p><br/><p>Is what I add in a mutter.</p><br/><p>“In that case, we also have Haine-san on our side! The Light Church has plenty enough military power!” (Karen)</p><br/><p>Is what she answered back sharply.</p><br/><p>“That’s not the problem here.” (Yorishiro)</p><br/><p>Without faltering at the behavior of the hero, Yorishiro sips her tea –the tea that Ates had poured for her.</p><br/><p>“Sunnysol Ates; she is, as expected, a fearsome person. She meticulously created a scenario where we can’t reject her staying at our side.” (Yorishiro)</p><br/><p>“That is?” (Karen)</p><br/><p>“You already know about what she presented to us in order to fall onto us, right?” (Yorishiro)</p><br/><p>At the end of the new and old heroes match, that wicked woman pointed out one thing as she admitted her own defeat. That thing was the member list of the contra-reconciliation side that was confronting Yorishiro and the others.</p><br/><p>It could be said to be the very objective they wanted to achieve with the new and old heroes match.</p><br/><p>“Not only was the list of Ates the real deal, they were quite the excellent documents. It didn’t only have the contra-reconciliation side members of the Light Church, there were also even people from other churches in it without leaving a single one out. There was even material listed there to charge the person in question.” (Yorishiro)</p><br/><p>“Then, the reason why the purging of the contra-reconciliation side is going at speeds that are higher than expected is because…” (Karen)</p><br/><p>“It is all due to the list Ates-san provided. She must have obtained that list from the contra-reconciliation side thinking that they would be able to utilize the previous heroes more efficiently this way, but in the end, it turned into tightening their noose.” (Yorishiro)</p><br/><p>Truly reaping what they sow.</p><br/><p>“But that doesn’t mean it is okay to accept her!” (Karen)</p><br/><p>Karen-san still continues protesting.</p><br/><p>“The moment she changed sides, our victory had been decided. Even without her information, the fall of the contra-reconciliation side was settled. There’s no need to lower ourselves to aim for a perfect victory—” (Karen)</p><br/><p>“On top of that, Ates-san is the previous hero.” (Yorishiro)</p><br/><p>Interrupting Karen-san, Yorishiro continues.</p><br/><p>“Please don’t forget, Karen-san. The trust that you heroes create is immense. The achievements of you people nowadays has made that image even bigger and more heated up. And the previous hero Ates-san has served in the amplification of it.” (Yorishiro)</p><br/><p>The previous light hero, Ates.</p><br/><p>In the point of heroes, Karen-san and Ates are the same.</p><br/><p>The efforts of Karen-san have made it so that popularity of the heroes increases more and more within the common populace. And from the perspective of the people that don’t know anything, Ates is also a previous hero and in the same spot as Karen-san and the others.</p><br/><p>She is in a territory of popularity.</p><br/><p>“No way, I am not the same as that person!” (Karen)</p><br/><p>“In the eyes of the uninformed public, you are the same. As long as you hold the title of hero, the gossips that come out from that title will become our greatest weapon.” (Yorishiro)</p><br/><p>It is exactly because Karen-san and the others held the title of heroes as they defeated monsters that the image of heroes has been strengthened even more and it was possible to have the populace side with us.</p><br/><p>It is a reality that this has provided propulsion to the reconciliation of the churches and the Hero Alliance.</p><br/><p>That popularity had also fallen onto Ates who holds the title of ‘previous light hero’ which make them view her as a symbol of trust and hope.</p><br/><p>The contra-reconciliation side might have been played by that mask of popularity as well.</p><br/><p>“Let’s put it this way. What do you think would happen if Ates-san were to be judged in front of the populace? ‘Even if they are heroes, in the end, they are still humans. They make mistakes and will also do evil’, is what they will begin thinking. Karen-san, the trust to heroes that you so desperately fostered might be destroyed.” (Yorishiro)</p><br/><p>“That’s…” (Karen)</p><br/><p>“Also, most of all, if we are to judge Ates-san, we can’t just not do anything to the other previous heroes. ‘They went against the present order’, this point is something that all previous heroes share after all. Even if we don’t give out punishment on the same level as Ates-san on the same grounds, it will be impossible to avoid giving punishment to the others.” (Yorishiro)</p><br/><p>Kyouka, Sarasa, Yoneko-san, and Juo; the other previous heroes.</p><br/><p>After the battle, we reached an understanding, and now, they are powerful allies that we can’t not have.</p><br/><p>In order to eliminate Ates, we would have to bring down all those girls as well?</p><br/><p>There’s no way we could do that.</p><br/><p>“You understand now, right Karen-san? That woman gathered several merits and demerits in order to have us accept it. Of course, there’s not a single reason why I would like her to be our ally. However, leaving aside the like and dislikes, she has already sealed the path to refuse.” (Yorishiro)</p><br/><p>“…”</p><br/><p>Karen-san finally was unable to say anything back.</p><br/><p>“In other words, we have been thoroughly caught in that woman’s scheme.” (Karen)</p><br/><p>“Yes, we have been.” (Yorishiro)</p><br/><p>Yorishiro unexpectedly admitted it easily.</p><br/><p>“She made it so we had no choice but to accept her as an ally. In that point, I will obediently accept defeat. If not, I wouldn’t be able to see the truly important things after all.” (Yorishiro)</p><br/><p>“The truly…important things?” (Karen)</p><br/><p>“Just like Ates-san said, we are in a stage where a battle against the Demon Lords with our existence at stake has grown unavoidable. Compared to the disasters called Demon Lords, Ates-san is simply one more of the people that think of political power. The extent of damage she can do is limited.” (Yorishiro)</p><br/><p>Meaning that compared to the survival of humanity, this is a small evil that we have to close our eyes to huh.</p><br/><p>Rather, if there’s merits in utilizing this small evil, it would be better to use it to its best in order to prepare for that big evil.</p><br/><p>“Is that really the case?”</p><br/><p>That voice made Karen-san, Yorishiro, and I gather our eyes in the direction of it.</p><br/><p>The one who spoke was Doraha.</p><br/><p>She didn’t speak much, just like a shadow, and there’s practically no instances she has spoken herself.</p><br/><p>While being crushed by agitation, Yorishiro asks back.</p><br/><p>“What’s the matter, Doraha? What’s this about ‘really the case’?” (Yorishiro)</p><br/><p>“No, I was just wondering if that Ates-sama person is truly that much of a dismissable person.” (Doraha)</p><br/><p>And it was rare for her to evaluate other people in that way.</p><br/><p>Yorishiro lovingly hugs Doraha.</p><br/><p>“It is okay. There’s no need for you to think of such complicated things. I will continue protecting your place to be. You don’t need to worry about anything and just enjoy your time as much as you want.” (Yorishiro)</p><br/><p>The reason why Yorishiro doesn’t want to burden Doraha is due to their special relationship.</p><br/><p>But at a later time, I began thinking that at this point, it wasn’t only Doraha who had seen through the core of Ates.</p><ul><li>220: Everyday encroachment</li></ul><br/><p>We might have actually been too easygoing.</p><br/><p>Even if roundabout, we were underestimating the fearsomeness of the woman that was surely eating onto our lifestyle and melting it into destruction.</p><br/><p>***</p><br/><p>This place is the Aurora Knight corps training location.</p><br/><p>She was surrounded by many knight, moreover, they were having a friendly chat.</p><br/><p>There was even the new Knight General Grades-san.</p><br/><p>“Oh Haine, you came at a good time! Come here too!” (Grades)</p><br/><p>The bald Grades-san calls for me.</p><br/><p>Even when he became the General, he didn’t just relax in his extravagant room and is always going around.</p><br/><p>The reason why he is currently looking after the training of the newcomers is because he has been talking with the higher-ups of the knights corps about the reformation plan, negotiating with the outside, and he is presently having a rest in his busy time.</p><br/><p>And then, there’s one other beautiful lady joining the instruction of the newcomers.</p><br/><p>“The two most important points when utilizing light divine power is the release and convergence.”</p><br/><p>She swings around her light spear, Kain, as if acting it out while saying that.</p><br/><p>The light knights were enthusiastically listening to her teaching.</p><br/><p>“Unleashing your power at once ‘release’; properly directing that power to the direction you thought of ‘convergence’. The light divine power makes it possible for these two types to be controlled. If you just release leaving it all to power, that can be done by the thoughtless fire element. If you give that release a set direction and make it as thin as a needle…” (Ates)</p><br/><p>The light spear is directed at a certain direction as if adjusting the aim, and then, the pointy blade part begins to shine dazzlingly.</p><br/><p>“[Holy Light Line]!” (Ates)</p><br/><p>The thing that felt as if the tip of the spear had extended was actually a line shaped light divine power.</p><br/><p>This beam that was unleashed from the spear felt as if it had extended as it hit the target that is far at the distance and pierces through it.</p><br/><p>A small hole is made into the target made of wood. It was practically as if the spear itself had pierced through it.</p><br/><p>There’s no way someone would be able to manage such sharp penetration power unless their convergence ability is quite high.</p><br/><p>“““OOOOhhhh!!“”””””</p><br/><p>The light knights that were spectating this began to cheer and applaud.</p><br/><p>“The trick to controlling release and convergence is to adjust your breathing. And then, at the same time as you breathe out, you release. Think of your divine tool as a part of your body, and control it with your whole body.” (Ates)</p><br/><p>I see, I see.</p><br/><p>This wasn’t only limited to light, it also applied to all the divine power control, so there were parts that I can understand since I am a dark matter user.</p><br/><p>“She is quite skilled. Not only are her explanations good, she also properly shows example. Even within the people I have seen, she is one of the best instructors.” (Grades)</p><br/><p>Since before he was appointed as the Knight General, in his times when he was a vice-captain, he has been supporting the Aurora Knight corps for close to 20 years already.</p><br/><p>And she is being praised by the General Grades, so she must be quite the big deal.</p><br/><p>“Ates-sama returning to us is, as expected, something worth celebrating. Simply having two hero class powers would be a great help, but even without counting that, Ates-sama is a really well-rounded person.” (Grades)</p><br/><p>“R-Really?” (Haine)</p><br/><p>“She was able to do anything without any problem since her active days, and her attention to the people below her was meticulous. It was quite regrettable that she had to retire after being involved in the previous coup. Well, I was an underling at that time, so there was nothing I could have done though.” (Grades)</p><br/><p>Grades hadn’t been told anything about the circumstances behind the reason why Ates was made to retire as a hero.</p><br/><p>Well, that’s a matter of course. I also don’t know much about it, but the troubles that revolve around the retirement of Ates as a hero were on the level of scandal for the Light Church.</p><br/><p>In that case, they should have wanted to reduce the turmoil to its most. The fewer people knowing the truth of it, the better.</p><br/><p>Grades-san most likely wasn’t able to do anything but spectate, just like many others.</p><br/><p>“Uhm…” (Haine)</p><br/><p>“Hm? What is it, Haine?” (Grades)</p><br/><p>“I wasn’t at that time, so I don’t know but, what was the reaction of the public when Ates-san retired?” (Haine)</p><br/><p>Is what I try asking about the state of those times, and he answered.</p><br/><p>“They were all sympathetic. Ates-sama had to retire because of that damn former Founder after all.” (Grades)</p><br/><p>“Is that so…” (Haine)</p><br/><p>“Yorishiro-sama who was simply the daughter of the Founder at that time exposed the illegal actions of her father, and an uproar big enough to turnaround Apollon City occurred. It was a big mayhem everyday with strikes after strikes.” (Grades)</p><br/><p>Even when the matter wasn’t fully disclosed, it still dealt this much damage.</p><br/><p>“It is because the previous Founder was a piece of shit idiot, but even when he was like that, he still stayed being the Founder, but that came to bite him back at that time, and he ended up being apprehended. If he had pulled back earlier, he could have maintained a bit of his freedom. Truly an idiot.” (Grades)</p><br/><p>And there was also a smart one.</p><br/><p>It is of course, Ates.</p><br/><p>“At that time, Ates-sama had retired on her own will. ‘I can’t escape from the sin of not being able to stop the rampage of the Founder even when I stood as the hero’, she said. Yorishiro-sama tried to stop her, but she apparently didn’t accept.” (Grades)</p><br/><p>“…”</p><br/><p>This is the darkness of the political world.</p><br/><p>In other words, for the many light citizens, the previous light hero Ates was the heroine of a tragedy where she was dragged into political injustice.</p><br/><p>And now, with the new and old heroes match before, her long time in retirement has finished and she has now come back.</p><br/><p>For the normal populace of the Light nation, the return of Ates was exactly that.</p><br/><p>They had their arms high up in welcome.</p><br/><p>The cleaning of corruption is also shrouded in haziness, so aside from the current ones at high positions, most of the people don’t know the truth of things.</p><br/><p>Ironically, this is working as tailwind for the current Ates.</p><br/><p>Sunnysol Ates had become quite the popular person in the Light Church.</p><br/><p>“Ah, Karen-sama!”</p><br/><p>At that moment, the current light hero walks by.</p><br/><p>Seeing her, the light knights went to speak with her resolutely.</p><br/><p>“Karen-sama! Right now we are having a group lesson with Ates-sama as the instructor!”</p><br/><p>“If possible, can Karen-sama please instruct us as well?!”</p><br/><p>But the expression of Karen-san wasn’t that of sparkles.</p><br/><p>“…Sorry. I have to attend to my own training, so I will have to refrain.” (Karen)</p><br/><p>“Eh?”</p><br/><p>And just like that, Karen-san disappears into the inside of the training field.</p><br/><p>The young light knights were bewildered by this.</p><br/><p>“What happened to Karen-sama?”</p><br/><p>“Was Karen-sama that kind of person? I feel like in the past she was a lot more kind and easy to mingle with…”</p><br/><p>The unrest was spreading around the newcomers.</p><br/><p>At that time…</p><br/><p>“Calm down.”</p><br/><p>The one who spoke in order to pacify them was Ates.</p><br/><p>“Don’t blame Karen-san. She is a person of bountiful talent. Her inborn light element is one that someone like me wouldn’t be able to even come close to her toes.” (Ates)</p><br/><p>“Ates-sama…”</p><br/><p>“That person is using that talent of hers in order to stand as the vanguard of the Light Church and fulfill an important duty. The duty of you people is to support Karen-san from below. For that sake, you need to grow stronger.” (Ates)</p><br/><p>““““Yes!””””</p><br/><p>The young light knights respond filled with energy.</p><br/><p>I thought ‘this is bad’ at the exchange they were having.</p><br/><p>“Wait.” (Haine)</p><br/><p>Unable to endure it, I stand on the stage.</p><br/><p>“That way of saying it would bring about misunderstandings. It is as if Karen-san became strong just because of her talent.” (Haine)</p><br/><p>“Oh my.” (Ates)</p><br/><p>“That person as well has put in suitable amounts of effort in order to become strong. Negating that truth is not worth of praise at all.” (Haine)</p><br/><p>Ates protected Karen-san…is how it looked like, but that wasn’t the case.</p><br/><p>She had created the impression that Karen-san is a person filled with talent, and was trying to separate Karen-san from the common knights.</p><br/><p>Geniuses get avoided by the commoners.</p><br/><p>By inducing into the knights that Karen-san is a genius that can’t be understood, it will create an isolation on Karen-san, and she will manage to obtain a higher position within the knight corps.</p><br/><p>The silent invasion of Ates still continued on even now.</p><br/><p>As I thought, this woman is dangerous.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-216-217-knight-general\" id=\"prev_chap\" title=\"Chapter 216-217 - Knight General\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-221-224-hero%E2%80%99s-torment\" id=\"next_chap\" title=\"Chapter 221-224 - Hero’s torment\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236336\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}