{"title": "Chapter 225-226 - A pleasant talk that happens only once", "id": 225, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-225-226-a-pleasant-talk-that-happens-only-once", "volume_title": "Volume 3", "body": "<h1>Chapter 225-226 - A pleasant talk that happens only once</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 225-226: A pleasant talk that happens only once</h4></header></p><div class=\"entry-content\"><br/><p>“Leaving that aside.” (Yorishiro)</p><br/><p>The tone of Yorishiro suddenly changed.</p><br/><p>“Let’s have a more fun talk for now. The reason, we have stepped into unknown land.” (Yorishiro)</p><br/><p>Ah, this is bad.</p><br/><p>“We have arrived at Haine-san’s room!” (Yorishiro)</p><br/><p>“Don’t go doing whatever you want, okay?!” (Haine)</p><br/><p>Is what I warn, but I don’t think it will show any result. After all, the women here are: Yorishiro, Karen-san, and Ates.</p><br/><p>“Haine-san’s room!!” (Karen)</p><br/><p>It looks like she just noticed that reality, Karen-san’s expression implodes.</p><br/><p>“Uhm uhm uhm, is that the place where when you arrive, all your wishes will come true?!” (Karen)</p><br/><p>“That’s right. The world beyond the horizon that everyone wants to go to, that is Haine’s room!” (Yorishiro)</p><br/><p>That’s not true.</p><br/><p>Why are you classifying my room as an Utopia all on your own?</p><br/><p>“…I didn’t take notice because I was concentrated on my hate towards Ates-san, but once I am conscious of it, I can tell that I am being touched by the smell of Haine-san from inside my lungs and it is preading through my whole body!” (Karen)</p><br/><p>“Don’t go saying such scary things!!” (Haine)</p><br/><p>Karen-san was slowly entering a dangerous state.</p><br/><p>“Now that we are here, there’s only one thing to do-desu wa, Karen-san! This is a journey! Like the adventurers that found the Golden City!” (Yorishiro)</p><br/><p>“That means it is pillaging time, right?! Like the bandits attacking the city!” (Karen)</p><br/><p>Stop it!</p><br/><p>A man also has its privacy, so don’t go searching here and there!</p><br/><p>“Don’t worry, Haine-san.” (Ates)</p><br/><p>Ates tries to calm me down.</p><br/><p>“I am the first one that invaded this room. Everything that would trouble Haine-san if seen, has all been secured by me!” (Ates)</p><br/><p>“Is that something you say with a straight face?!” (Haine)</p><br/><p>This group of damn trespassers!</p><br/><p>Just as I was thinking about throwing them all out the window, a smooth voice resonated.</p><br/><p>“Uhm…”</p><br/><p>A girl nervously appears from the kitchen –it is Doraha.</p><br/><p>“So you also came here…” (Haine)</p><br/><p>Well, that’s obvious. Doraha has been following Yorishiro like a shadow lately after all.</p><br/><p>“I am truly sorry. I thought I would pour tea for everyone…” (Doraha)</p><br/><p>This girl is also a special cookie of her own.</p><br/><p>“Now that I think about it, I raised my voice and my throat has dried now.” (Yorishiro)</p><br/><p>“Sorry to have you do that. Allow me to do the tea pouring.” (Karen)</p><br/><p>Is what Karen-san says as she approaches, but Doraha as expected had a troubled expression.</p><br/><p>“…There’s none.” (Doraha)</p><br/><p>“None?” (Karen)</p><br/><p>“There’s no tea leaves. Instead, there’s something like this…” (Doraha)</p><br/><p>What Doraha places out was a single pot.</p><br/><p>Since it was made of transparent glass, it was easy to see what was inside. The black beans that were completely filling up the inside.</p><br/><p>“This…!” (Yorishiro)</p><br/><p>“This is…..!” (Karen)</p><br/><p>Coffee beans.</p><br/><p>Why are Yorishiro and Karen-san making such a bitter expression?</p><br/><p>“…Haine-san, you can drink something like coffee?” (Karen)</p><br/><p>‘Something like’?!</p><br/><p>Did she say ‘something like’?!</p><br/><p>“Because you know, it is bitter. How to say it, it is like it leaves an earth-like feeling in your mouth.” (Karen)</p><br/><p>“That bitterness is the good part of it. It clears your mind, and it is great to wake you up.” (Haine)</p><br/><p>Well, it is also to enjoy the deep taste that comes after the bitterness though.</p><br/><p>But even with that, Karen-san was looking at me as if I had come from another world as she said…</p><br/><p>“But…tea is definitely the better tasting one. Coffee is just bitter.” (Karen)</p><br/><p>“No, Karen-san.” (Yorishiro)</p><br/><p>Yorishiro joins in.</p><br/><p>“Tonight, let’s try delighting on coffee.” (Yorishiro)</p><br/><p>“Yorishiro-sama?!” (Karen)</p><br/><p>No, just leave already.</p><br/><p>“Think about it thoroughly Karen-san. Not sharing the same likes in food as the person you love has a risk of them looking at you with bad eyes. Difference in values. It might become a reason for divorce!” (Yorishiro)</p><br/><p>Worrying about those things before marrying.</p><br/><p>“R-Right! There’s nothing bad in challenging it right now while I can! …Haine-san!!” (Karen)</p><br/><p>“Yes?!” (Haine)</p><br/><p>“One cup-full of coffee please! And make it a real deep one!” (Karen)</p><br/><p>Even if you order it in such a specially energetic manner…hah, can’t be helped.</p><br/><p>I decided on making coffee at once.</p><br/><p>The coffee beans are already roasted, so I crush them with the mill and turn them into powder. After that, I just have to drip it, but in that part, I take out the espresso machine.</p><br/><p>““““?!””””</p><br/><p>For some reason, the gaze of the girls gather all at once.</p><br/><p>“What is that?! That kettle-like thing!” (Karen)</p><br/><p>“I don’t know! Is that a tool of an ancient civilization?! Haine-san, don’t tell me you are bringing out forbidden knowledge?!” (Yorishiro)</p><br/><p>What are these people talking about.</p><br/><p>This espresso machine is an actual present from Hydra Ville.</p><br/><p>With this, I can use the deep coffee beans of Ishtar Blaze that I was given a lot of by Sasae-chan’s Oba-san, extract them quickly, and make a deep espresso.</p><br/><p>“Umu, today was made nicely as well.” (Haine)</p><br/><p>It looks like there’s some nice stickiness to it.</p><br/><p>From the spout of the espresso machine, a dark liquid is poured into the cup.</p><br/><p>“Uhm, Haine-san, isn’t this cup pretty small?” (Yorishiro)</p><br/><p>“That’s because it is an espresso.” (Haine)</p><br/><p>As if saying ‘here you go, drink’, I slide the cups to the two.</p><br/><p>“Karen-san, go ahead!” (Yorishiro)</p><br/><p>“No no! Yorishiro-sama, you first!” (Karen)</p><br/><p>Since coming here, it has been an outbreak of calamities.</p><br/><p>I don’t care, so just drink it or it will get cold.</p><br/><p>“Fufu, you two are such children.”</p><br/><p>The one coming out at this moment was the wicked woman who had stayed in silence until now.</p><br/><p>““Ates-san!””</p><br/><p>“Coffee can’t be enjoyed by the tongue of children; it is the drink of the chosen ones.” (Ates)</p><br/><p>No, it isn’t that big of a deal.</p><br/><p>“I will accept the coffee that Haine-san has put his heart and soul in pouring. The two of you should get start getting used to it by first training with the sourness of the strawberries on cakes.” (Ates)</p><br/><p>“Gunununu!” (Yorishiro)</p><br/><p>“Again saying whatever you want!” (Karen)</p><br/><p>The reason they can’t fight back at the offensive of the enemy must be because of the bitterness of the coffee.</p><br/><p>With the bitter gazes at the sides, Ates takes the cup into her hand and, hesitantly, places her lips on it.</p><br/><p>“…Bitter.” (Ates)</p><br/><p>Oi.</p><br/><p>“Ah! You now just said it was bitter! It is bitter huh! It is bitter for Ates-sama too huh!” (Karen)</p><br/><p>“As I thought, you can’t handle it either. You false-bravado woman! If you keep being such a vain person, you will get your legs caught up someday! And in reality, you have failed once already, so learn some restrain!!” (Yorishiro)</p><br/><p>As if the cover had been torn up, the women begin to go all ‘gya gya’. As they say: one is company, two is group, three is a crowd.</p><br/><p>I had no way of stopping that noisy fight, so I just watch over it.</p><br/><p>“…Haine-sama, I tried doing it as you taught me.” (Doraha)</p><br/><p>“Nice, good job.” (Haine)</p><br/><p>I drink the coffee that Doraha had newly made.</p><br/><p>Bitter.</p><br/><p>But that’s what makes it tasty.</p><br/><p>Why do these girls not understand the greatness of this?</p><ul><li>226: A pleasant talk that happens only once – Second part</li></ul><br/><p>“By the way, can you please leave already?” (Haine)</p><br/><p>I say this towards these three holy women that still remain in my room.</p><br/><p>“Isn’t it fine? How about we just stay in Haine-san’s room for today?” (Yorishiro)</p><br/><p>“…My room only has one bed though.” (Haine)</p><br/><p>“Is there a problem in that?” (Yorishiro)</p><br/><p>There’s only problems here.</p><br/><p>This Light Founder, does she want to tie the deal with me so much?</p><br/><p>“Haine-san, right now this room is like the inside of a box. As long as you don’t open it, no one will know what’s inside.” (Yorishiro)</p><br/><p>“?”</p><br/><p>“In other words, as long as the doors and windows are not opened and it is not possible to peek inside, the fact that we did perverted things with Haine-san will be mixed with a reality where we haven’t done perverted things. And so, even if we were to actually do perverted things, there’s no problem at all!” (Yorishiro)</p><br/><p>That doesn’t even work as sophistry.</p><br/><p>Regardless of what the people outside the box thing, I would be settling my own reality.</p><br/><p>“Then, Haine-san is trying to say this, right?” (Ates)</p><br/><p>Ates joins the fray.</p><br/><p>I don’t want this woman to say one more word, and yet, for some reason, she joins Yorishiro in attacking me like crazy.</p><br/><p>“What you are saying is that you will be ravishing Yorishiro-sama, Karen-san, and I, so the argument of the box is not necessary!” (Ates)</p><br/><p>“Heck no!” (Haine)</p><br/><p>A straight ball!</p><br/><p>After the sophistry of Yorishiro, there comes the straight ball of Ates.</p><br/><p>Aren’t you two actually pretty in sync?!</p><br/><p>Or more like, just go! I want to enjoy the solace of my room at the very least!</p><br/><p>“That’s right! Yorishiro-sama and Ates-sama, staying in Haine-san’s room like this would be improper!” (Karen)</p><br/><p>Karen-san reproaches the two wicked women that have a messed up conception of chastity.</p><br/><p>As expected, she is the actual holy woman!</p><br/><p>“Cause…! I haven’t brought my pajama over! If I knew, I would have brought the cutest one I have! The super cute one I bought at Hydra Ville that has laces!” (Karen)</p><br/><p>The gist of it was slightly deviated!</p><br/><p>“Ara ara, what a cute hero. Even though a pajama would soon be stripped off.” (Ates)</p><br/><p>Ates once again comes out with her blunt words, but in response, Karen-san…</p><br/><p>“…?” (Karen)</p><br/><p>“Eh?” (Ates)</p><br/><p>Karen-san was confused, unable to understand the words of Ates, and that led to Ates being the one bewildered.</p><br/><p>“L-Looks like you are a tougher opponent than I thought, Karen-san! Is this the power of an airhead?” (Ates)</p><br/><p>“More importantly! Sleeping with my casual clothes would be improper and I won’t condone that! It would make wrinkles in my skirt!” (Karen)</p><br/><p>“As I am saying, you should just go nake—-Gnnhhh!” (Ates)</p><br/><p>It was reaching a territory that couldn’t be ignored, so Yorishiro poked Ates’ side.</p><br/><p>“…*Cough*. Then, how about we do this? Bring the pajama over.” (Yorishiro)</p><br/><p>“Bring it over? Who will?” (Karen)</p><br/><p>“Well, just watch. Doraha, send a command to that person.” (Yorishiro)</p><br/><p>The silent as a shadow Doraha gave a short response of ‘yes’, and takes out the mass produced ethereal communication device and made a call somewhere.</p><br/><p>“…Parent bird to chick; ‘the falcon has descended’. I repeat ‘the falcon has flown’.” (Doraha)</p><br/><p>Which one is it. There’s no repeating there.</p><br/><p>After finishing what seemed to be a coded transmission of sorts, the sound of knocking could be heard from the door of my room.</p><br/><p>“Who is it?” (Haine)</p><br/><p>When I open to see who it is, there was a single maid standing at the front of the door.</p><br/><p>“Why a maid?!” (Haine)</p><br/><p>But wait…this girl wearing maid clothes…I feel like I have seen her before? Moreover, recently.</p><br/><p>“…Ah, Mina!” (Haine)</p><br/><p>“Yes, it is Platina Mina. Thanks for last time.” (Mina)</p><br/><p>Isn’t this the woman that was acting as the referee in the previous new and old heroes match.</p><br/><p>It is the girl that brought out a bomb the moment the victory of the current heroes was set and made things a mess.</p><br/><p>After that, it was confirmed that this was the deed of the contra-reconciliation side, so it became one of the ingredients in increasing their blame.</p><br/><p>“Why are you in maid clothes?” (Haine)</p><br/><p>“Fufufu, Haine-san, to think that you would order a prostitute to cosplay as a maid; you have quite the nice hobbies—Guhoo!!” (Ates)</p><br/><p>Ates said something lacking manners, so I poked her side.</p><br/><p>And so, about the matter of Mina being a maid…</p><br/><p>“Uhm…I was originally working as a grunt in the Light Church. How to say it, being a maid is more of my main job…” (Mina)</p><br/><p>Ah, so that’s what it was.</p><br/><p>“Just as Yorishiro-sama ordered, I have brought one sleepwear and a stay-over set.” (Mina)</p><br/><p>“Good work. We might still have need for you, so be on standby.” (Yorishiro)</p><br/><p>“Uhm…! I am already outside my work-time period though!” (Mina)</p><br/><p>So she was the one that was called just now huh.</p><br/><p>If I remember correctly, after the bomb incident she made herself, I had some business so I left her with Yorishiro, but I don’t know what happened after.</p><br/><p>“Even if Mina-san caused the explosion, she was simply a throw-away pawn used by the contra-reconciliation side. Due to Yorishiro-sama’s bountiful consideration, she was pardoned.” (Doraha)</p><br/><p>The shadow Doraha explains it to me.</p><br/><p>She is already beginning to become the lubricant in this group.</p><br/><p>“Her original job was that of a pawn—I mean, maid. So she was assigned as the direct maid of Yorishiro-sama. The reason why she appeared tonight is due to those kind of circumstances.” (Doraha)</p><br/><p>Direct control of the Founder, she says.</p><br/><p>That’s a big promotion for a maid.</p><br/><p>“Is it okay? Even if she was used, to give such treatment to a person that actually stood against the current order? Won’t it give a bad example?” (Haine)</p><br/><p>“She is in the direct command of Yorishiro-sama, you know?” (Doraha)</p><br/><p>“…”</p><br/><p>“Do you really think she will get treated well?” (Doraha)</p><br/><p>Right. My thought pattern was incorrect.</p><br/><p>“I feel like you people are saying something incredibly rude about me, but this is something that I thought deeply about, you know?” (Yorishiro)</p><br/><p>While saying this, Yorishiro hugs Mina who was standing at her side.</p><br/><p>“Hywawawa!” (Mina)</p><br/><p>“Ates-san is holding the depths of this girl after all. There’s the need for me to keep supervision on her at my side.” (Yorishiro)</p><br/><p>Now that she mentions it! After the incident with the explosion, when we tried to have Mina spit out the details about the person behind it, Ates had suddenly appeared and, with a single glare, she was silenced.</p><br/><p>This without doubt means that Ates has grasped something important of Ates!</p><br/><p>Maybe she has her parents held hostage? Or it might be that Ates holds an important secret of her.</p><br/><p>“…Fufufu.” (Ates)</p><br/><p>“…”</p><br/><p>And Ates who was here made another suggestive gaze. As if a predator was glaring at its prey. And that prey that is Mina was sweating bullets.</p><br/><p>“A-A-Ates-sama!” (Mina)</p><br/><p>“What, little kitten?” (Ates)</p><br/><p>“Ah, as I thought, I can’t!! I am sorry, Yorishiro-sama! I can’t live without Ates-sama!!!” (Mina)</p><br/><p>Is what she said as the maid Mina rubs her face onto the legs of Ates while crying.</p><br/><p>What is this?</p><br/><p>“Mina-san had been under the command of Ates-sama for a brief period of time.” (Doraha)</p><br/><p>Even if you tell me that…</p><br/><p>I got an explanation from Doraha, and yet, I can’t understand the situation at all.</p><br/><p>“Well, Ates-sama brought their relationship to that in order to utilize Mina-san, but now, Mina-san is the slave of Ates-sama. If she doesn’t receive the love of Ates-sama, she will fall into withdrawal symptoms.” (Doraha)</p><br/><p>Uwa!</p><br/><p>Because of that, she closed her mouth completely for the sake of Ates?!</p><br/><p>Uwa…Ueeeeh…</p><br/><p>“That’s why I will do my best for her sake!” (Yorishiro)</p><br/><p>Yorishiro once again hugs Mina tightly.</p><br/><p>“Mina-san has been enslaved by Ates-san, in that case, by having me enslave her, I will have her break free of her withdrawal symptoms. The reason why I had her be my personal maid is also because of that.” (Yorishiro)</p><br/><p>“Use poison to deal with poison?!” (Haine)</p><br/><p>I couldn’t find any more befitting words to describe this situation.</p><br/><p>“I won’t let you do that, Yorishiro-sama. She is my little kitten after all. I won’t let you unpoison her.” (Ates)</p><br/><p>“Then try stealing her away from me. Let’s see which enslaving power is the strongest; yours or mine. This is a match to determine which one has the strongest poison.” (Yorishiro)</p><br/><p>The people themselves called it poison.</p><br/><p>Ates was hugging her from the front, and Yorishiro was hugging her from behind, ending with Mina-san in the middle of that sandwich.</p><br/><p>“Gyaaaa!! Yorishiro-sama! Ates-sama! This is bad, this is dangerous! This is heaven!! Yorishiro-sama’s softness and Ates-sama’s softness are attacking me from both sides!! My blood is being nourished by both nutrients!!” (Mina)</p><br/><p>…When humans get way too happy, they begin to scream huh.</p><br/><p>I do have my share of experiences as well though.</p><br/><p>“What Mina-san did can be considered unforgivable, but if we think of that as a punishment, well, I would say it is fitting.” (Doraha)</p><br/><p>…Right, I also concur with Doraha’s opinion.</p><br/><p>“Uhm…”</p><br/><p>Let’s not watch those three wild cats in their silly ruckus anymore.</p><br/><p>Thanks to these, Karen-san, who had been silent all this time, had finally spoken.</p><br/><p>“Uhm, I don’t understand well, but…what in the world is going on?” (Karen)</p><br/><p>“It is fine for you to not understand.” (Haine)</p><br/><p>There’s no need to understand the taste of this woman called Mina at all.</p><br/><p>If that concept were to be digested in Karen-san’s head, the Hero Alliance would fall. There’s one member in the group that would wish for this kind of development after all.</p><br/><p>“Hah…”</p><br/><p>On the other hand, Mina had escaped from the strange situation of being sandwiched by the Light Founder and the previous hero while having faint breath.</p><br/><p>“Hah…Hah…! Why am I being put through this?!” (Mina)</p><br/><p>That’s what I want to ask.</p><br/><p>“Well, your throat must be dry after all that mess. Drink this coffee.” (Haine)</p><br/><p>“Ah, thank you very much!” (Mina)</p><br/><p>Mina drank the espresso I gave her in one gulp.</p><br/><p>“Ooh, you got a nice way of drinking there.” (Haine)</p><br/><p>“There’s nothing nice about it though. Espresso is supposed to be drunk that way, right? It went smoothly down my throat, it was pretty well made. I like more the style of putting sugar before drinking though! Hm?” (Mina)</p><br/><p>Right after, Mina noticed the gazes that were being poured at her by the girls who can’t drink coffee.</p><br/><p>“Ah, what’s the matter? Yorishiro-sama? Ates-sama? Even Karen-sama?! Please stop it. Did I do something wrong?! I didn’t do anything! Ah, stop it! Don’t sandwich me again! If you do that again, this time for sure I will—! Aaaaahh!!” (Mina)</p><br/><p>Or more like, can’t you leave already, Mina? And while at it, everyone else…</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-221-224-hero%E2%80%99s-torment\" id=\"prev_chap\" title=\"Chapter 221-224 - Hero’s torment\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-227-229-incident\" id=\"next_chap\" title=\"Chapter 227-229 - Incident\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236338\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}