{"title": "Chapter 256-257 - The plot of the end", "id": 256, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-256-257-the-plot-of-the-end", "volume_title": "Volume 3", "body": "<h1>Chapter 256-257 - The plot of the end</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 256-257: The plot of the end</h4></header></p><div class=\"entry-content\"><br/><p>TLN: Hey guys, Reigokai here!</p><br/><p>Some people may have noticed already that there are sponsored chapters in the queue (Thanks!) and that no sponsored chapters came out in Sunday.</p><br/><p>It is actually because I had to celebrate Lunar Year with my family the whole past week. But fret not! I will be tackling those chapters this week!</p><hr/><br/><p>Now then, from here on, I will take on the part of narrating —the fragment of the evil Light Goddess, Sunnysol Ates.</p><br/><p>It has been several days since the battle in the Light Grand Church against my other half, Yorishiro, and the unexpectedly tough Kourin Karen-san.</p><br/><p>Having escaped from Apollon City, I was hiding myself at a place far away from human civilization.</p><br/><p>At a ‘certain place’ that is separate from the world of humans.</p><br/><p>Now that I have revealed my identity to my other half, Yorishiro, I don’t plan on living my life with this human body anymore.</p><br/><p>I will not be acting as Sunnysol Ates or the evil half of the Light Goddess Inflation, but on my duty as a God.</p><br/><p>But in order to not make things complicated, let’s leave my name as being Ates for now.</p><br/><p>About the ‘certain place’ that I am using as my home, it is at a place that is far away from the five nations and among the mountains, and it is impossible to approach by human means.</p><br/><p>Among those mountains, I made a giant castle with my powers as a God and was making base there for the destruction of humanity…no, if I had to put it more accurately, it is not a castle but a cocoon. A cocoon that stores my precious Light Demon Lord, Lucifer.</p><br/><p>This whole castle was made specially as an organic outer shell to form the Light Demon Lord.</p><br/><p>“It still needs more time it seems.” (Ates)</p><br/><p>I was checking the state of this cute child that was sleeping inside the castle.</p><br/><p>Now that I have obtained the final piece that was the shadow spear Abel, my Lucifer is on its way to completion.</p><br/><p>But there’s no need to hurry. All the pieces of the puzzle are within my hands after all.</p><br/><p>“What’s left is to piece them together one by one.” (Ates)</p><br/><p>I bid farewell to the sleeping child for now and go down the stairs -in order to tame the problematic wild dogs that are there.</p><br/><p>***</p><br/><p>When I arrive at the room, a problem soon happened.</p><br/><p>The group that was supposed to be four only has three now.</p><br/><p>“…Where is the Water Demon Lord Gabriel?” (Ates)</p><br/><p>I look at the remaining three and point out the only missing one.</p><br/><p>They are quite peculiar compared to humans, so there’s no way I would mistake their names and faces.</p><br/><p>“Who knows. He said ‘I thought of something amusing’ and left. Don’t know where he went though.” (Uriel)</p><br/><p>“He must have been thinking about a plan to destroy the humans. He is the scheming type after all. He probably has prepared a hell that will make us go ‘wow’.” (Raphael)</p><br/><p>The Earth Demon Lord Uriel and the Wind Demon Lord Raphael speak casually.</p><br/><p>These idiots! I couldn’t help but shout this inside my head.</p><br/><p>In order to eradicate the humans that stole the eyes of my beloved Entropy, there’s necessary steps to take. They don’t understand this at all.</p><br/><p>In the end, even if they have obtained intelligence, monsters are still monsters.</p><br/><p>To make these wild beasts move along my scenario, I will need to do quite the work.</p><br/><p>“You people, I will be saying this again but, I am the envoy of the Great Demon Lord Lucifer-sama.” (Ates)</p><br/><p>That is the setting I made in order to call the Demon Lords to this castle.</p><br/><p>Currently, this is the only way to have them obey me in this human body.</p><br/><p>“I am the servant of Lucifer-sama who rules over light. He is still in his sleep towards perfection, and since Lucifer-sama can’t speak and act at his current state, I am serving as his messenger. I am the person that receives the will of Lucifer-sama. You can consider me the priestess of Lucifer-sama.” (Ates)</p><br/><p>Of course, this is all made-up.</p><br/><p>But if I don’t say all this, the Demon Lords wouldn’t even hear me out in my present outward appearance of a human.</p><br/><p>“Please take my words as if they were from Lucifer-sama himself. If you go against my words, Lucifer-sama himself will be judging you when he awakens. Is that okay?” (Ates)</p><br/><p>When I approach them with a slightly strong tone, the Demon Lords were unexpectedly obedient.</p><br/><p>“Tch, I know. The words of Lucifer-sama are absolute.” (Uriel)</p><br/><p>“This place that you guided us to is pretty comfortable after all. I don’t mind thinking of your words as Lucifer-sama’s for now.” (Raphael)</p><br/><p>It was mixed with a click of the tongue, but fine. As long as they move obediently as my pawns, it is fine.</p><br/><p>“Then, I will be telling you the order of Lucifer-sama. The time to fight has come.” (Ates)</p><br/><p>The moment I said that, I certainly felt the exaltation that ran between the Demon Lords.</p><br/><p>“The battle between the monsters and humans to decide the new rulers of the of the world is finally starting. The wish of Lucifer-sama is destruction and eradication. In order to make this surface world into a paradise for monsters, every single one of the lowly human race has to be removed —by your hands.” (Ates)</p><br/><p>“This feast of death…is the wish of Lucifer-sama, right?”</p><br/><p>“Interesting. It is finally time to slaughter those haughty humans huh.”</p><br/><p>The Demon Lords were showing more naked will than I thought.</p><br/><p>Even without ordering them to eradicate the humans, that is their desire. And their instinct as Demon Lords enhances this.</p><br/><p>Looks like this will turn into a good flow.</p><br/><p>I decided on telling them the plan immediately.</p><br/><p>“I know plenty well the strength of you all. In order to eradicate the humans, a single one of you would be plenty enough, but there’s a single problem, and just that single thing is making it difficult.” (Ates)</p><br/><p>“Kuromiya Haine.” (Raphael)</p><br/><p>“The darkness user huh. It is true that he is not simply on the level of troublesome.” (Uriel)</p><br/><p>Unexpectedly, the Demon Lords were composed and could analyze the strength of others.</p><br/><p>I thought that with people like them who possess absolute power, they would have their own pride for that power and wouldn’t admit that there’s other people stronger than them, bringing them to their own demise, but…it looks like this makes them even more worth using.</p><br/><p>“And so, Lucifer-sama has provided you with a plan.” (Ates)</p><br/><p>“A plan, you say?”</p><br/><p>“That’s right. An attack on all five nations by you four Demon Lords!!” (Ates)</p><br/><p>Apollon City, Muspelheim, Hydra Ville, Ishtar Blaze, and Rudras Metropolis; these five nations are in separate locations, and it is impossible for Haine-san to protect them by himself.</p><br/><p>In the end, if we exclude Haine-san, everyone is small fry.</p><br/><p>If we think of Haine-san as being their only fighting force, it would be a 4:1 with the Demon Lords.</p><br/><p>“Haine-san is using Apollon City as his base, so I will have you people attack the other four nations. Haine-san will hurriedly head to assist, but he will only be able to save one capital. The other three capitals will be disappearing from the map in the same day.” (Ates)</p><br/><p>Along with the heroes that protect those nations.</p><br/><p>“Putting it in another way, it would mean that one nation will receive the help of Kuromiya Haine, right?” (Raphael)</p><br/><p>“What will the Demon Lord that gets faced with that do?” (Uriel)</p><br/><p>Looks like this people ask proper questions. It makes them easy to deal with, but at the same time hard to deal with.</p><br/><p>“I will leave that to the jurisdiction of the person in question. You can challenge the darkness with your pride as Demon Lord on the line, or you can also quickly retreat. The most important part of this plan is to disturb Haine-san after all.” (Ates)</p><br/><p>No matter the case, the simultaneous attack of the Demon Lords will bring destruction and chaos to the world like never before.</p><br/><p>Haine-san won’t be able to stop that.</p><br/><p>In the end, he is only one person.</p><br/><p>It is not like I am not bothered by a few things, but I can simply stop Yorishiro by moving myself, and the incarnation of Quasar that is the Wind Founder is in tatters and unable to fight.</p><br/><p>They are all people that are not worth attention.</p><br/><p>I repeat, Haine-san alone won’t be able to stop the Demon Lords!</p><br/><p>“Now go, Demon Lords! Go to the nations that the humans have raised and make the humans shed blood! To the thousands or millions! In order to wet the throat of Lucifer-sama by the time he awakens!” (Ates)</p><br/><p>And in concert, the Demon Lords raised their voice.</p><br/><p>““Nah, not now.””</p><br/><p>Eeeeeh?!</p><ul><li>257: Demon Lord’s invitation to death</li></ul><br/><p>“W-What did you say?!” (Ates)</p><br/><p>I -Sunnysol Ates- have provided you with such a perfect plan, and yet, you Demon Lords rejected it?</p><br/><p>Uriel and Raphael; as if these guys had not been listening to me talk since the beginning, they resume their lazing about.</p><br/><p>“Y-You people…are you going against Lucifer-sama?!” (Ates)</p><br/><p>I bring out all the dignity I could as I said this, and the first one to answer was Raphael with an awkward expression.</p><br/><p>“We didn’t say we were rejecting it. We are saying it is fine if it isn’t now.” (Raphael)</p><br/><p>What’s with that way of speaking as if you were children leaving your homework for later?</p><br/><p>“Within the Demon Lords, I was the one who encountered Kuromiya Haine immediately and fought a grand battle with him. Because of that, I ended up losing most of my body.” (Raphael)</p><br/><p>Raphael was wearing an armor that covered his whole body and even within the Demon Lords he stood out with that appearance.</p><br/><p>The role of that armor was to support the body inside that was regenerating, in other words, it was being used as a plaster.</p><br/><p>“There’s the need for time to completely regenerate the many cells that I lost. If you wait for a bit more, I will show you that I can destroy all of the humans myself.” (Raphael)</p><br/><p>“I also have a similar reason to that.” (Uriel)</p><br/><p>Uriel is the next one to speak.</p><br/><p>“I took an attack from Kuromiya Haine and ended up receiving a wound, though it is not on the same level as Raphael’s. My bark was peeled off cleanly. Walking outside like this is embarrassing.” (Uriel)</p><br/><p>What is this guy saying.</p><br/><p>Since Uriel is the Earth Demon Lord, his body has an appearance like that of a tree. The surface of it is tree itself, but because of the battle with Haine before, the bark part was peeled off and the white grains are visible.</p><br/><p>If we had to put it in human terms, it would be as if he were naked, maybe?</p><br/><p>“I want to avoid leaving until I am covered by a black-lustre bark. A grand slaughter requires a grand appearance. Don’t you think?” (Raphael)</p><br/><p>“…”</p><br/><p>These damn monsters!</p><br/><p>As I thought, they are all idiots!</p><br/><p>Now that my other half Yorishiro has a card called God Heroes, there’s nothing to lose in being quick, and yet…! The Wind and Earth Demon Lord are throwing a tantrum, and the Water Demon Lord is not even here.</p><br/><p>At this rate, the simultaneous Demon Lord attack I made will end up collapsing!</p><br/><p>“I will go.”</p><br/><p>At that moment, an austere voice that made the earth tremble resounded in the place.</p><br/><p>It was low and yet it travelled well.</p><br/><p>“Oh!”</p><br/><p>“Michael huh!”</p><br/><p>The Fire Demon Lord that had been here all the time but maintained silent.</p><br/><p>A giant muscular man with burning crimson wings.</p><br/><p>Because of the dignified aura he lets out, the other two Demon Lords raise their voices.</p><br/><p>“Uriel and Raphael should prioritize healing their wounds. Gabriel must have his own thoughts as well. But if we were to not make any achievements by the time Lucifer-sama awakens, we wouldn’t be able to welcome him as comrades of his.” (Michael)</p><br/><p>The big frame of Michael made my body as Ates have no choice but to look up at him. If I didn’t, I wouldn’t even be able to see his face.</p><br/><p>“I will go. I will destroy a single human settlement and make that the beacon of war.” (Michael)</p><br/><p>“W-Wait there!!” (Ates)</p><br/><p>I hurriedly chase after Michael who was about to leave the castle.</p><br/><p>“Weren’t you listening to my plan either?! The attack to the nations has meaning when it is a simultaneous attack!” (Ates)</p><br/><p>Four Demon Lords attack four nations; it is when that scenario takes place that we can make Haine-san fall into confusion.</p><br/><p>“If you leave on your own, it is basically telling Haine-san to go there! Are you planning on making a foolish attack?!” (Ates)</p><br/><p>“That person is not almighty. By the time he receives notice of the attack, he will take time to arrive.” (Michael)</p><br/><p>The analysis of Michael was sound.</p><br/><p>“I just have to finish my task by the time he arrives, and then leave. Kuromiya Haine is an opponent that we must defeat in time, but this will be a decent fire starter for the time when Lucifer-sama awakens.” (Michael)</p><br/><p>“T-Then at the very least make your target Rudras Metropolis!” (Ates)</p><br/><p>“…Why?” (Michael)</p><br/><p>The blazing eyes of Michael look down at me.</p><br/><p>…How conceited.</p><br/><p>“Don’t you know the elemental affinities? The four base elements have their respective weaknesses. The opponent you as the Fire Demon Lord are advantageous against is wind. If you attack Rudras Metropolis that has the most wind users, the easy wipe out will be even easier.” (Ates)</p><br/><p>If you are going to act, taking the most efficient way is the most intelligent way.</p><br/><p>I will teach that to you coarse monsters.</p><br/><p>“…Those are not the words of Lucifer-sama.” (Michael)</p><br/><p>“Eh?”</p><br/><p>“That’s a way of thinking similar to those lowly humans. Scheming is in the first place something that the weak utilize. A way for the weak to oppose the strong.” (Michael)</p><br/><p>What is this giant man saying?</p><br/><p>“That’s why, against that Kuromiya Haine, I won’t mind using scheming. I know that he is stronger than us. In order to obtain victory, for the sake of a future with us as the superior race, doing all that’s needed to be done will not hurt our pride.” (Michael) to</p><br/><p>“That’s right! That’s why you should attack Rudras Metropolis!” (Ates)</p><br/><p>I desperately tried to chase after Michael whose strides reach a lot further than mine.</p><br/><p>“But what about the other humans aside from Kuromiya Haine?” (Michael)</p><br/><p>“?!”</p><br/><p>“They are weak. On the level of worms. To use scheming against enemies like that, it would be like the strong fearing the weak. Do you think our pride will maintain if we were to do that? Is there any meaning in a victory you can’t take pride in?” (Michael)</p><br/><p>What stupid things are you saying!</p><br/><p>Monsters talking about pride? Are you a true idiot?!</p><br/><p>“I won’t use schemes against anyone but Kuromiya Haine. I will destroy them straight on. That’s my pride, and it is also etiquette of the strong against the weak. The weak have their path and the strong have their path to follow.” (Michael)</p><br/><p>“Then you…” (Ates)</p><br/><p>I can’t keep this up anymore.</p><br/><p>Just let these idiots do as they wish.</p><br/><p>“Where are you planning on attacking?” (Ates)</p><br/><p>“The nation that is related to fire just as me —the Fire capital, Muspelheim.” (Michael)</p><br/><p>Muspelheim.</p><br/><p>So tragedy will befall them huh.</p><br/><p>Oh well, whatever. Just go around slaughtering as you wish and get killed for all I care.</p><br/><p>——</p><br/><p>Now then, from here on, someone else will take the role of narrating.</p><br/><p>There’s a more fitting person to talk about the blood feast that will be beginning from now on, after all.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-253-255-to-the-depths-of-darkness\" id=\"prev_chap\" title=\"Chapter 253-255 - To the depths of Darkness\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-258-260-the-night-before-the-fierce-battle\" id=\"next_chap\" title=\"Chapter 258-260 - The night before the fierce battle\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236350\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}