{"title": "Chapter 250-252 - Is it a leaf or a legume?", "id": 250, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-250-252-is-it-a-leaf-or-a-legume", "volume_title": "Volume 3", "body": "<h1>Chapter 250-252 - Is it a leaf or a legume?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 250-252: Is it a leaf or a legume?</h4></header></p><div class=\"entry-content\"><br/><p>TLN: Hey guys, happy chinese new year!</p><br/><p>Wanted to notify you guys that the previous chapters were a bit misleading about the God Hero. Looks like Yorishiro can’t Godify the other heroes, only their respective elemental Gods can.</p><br/><p>Also, chapter 250 is safe to skip.</p><br/><p>Enjoy! </p><hr/><ul><li>250: Is it a leaf or a legume?</li></ul><br/><p>At that day, a guest came to Apollon City; the Wind Founder, Toreido Shiva.</p><br/><p>He wanted a secret meeting with the Founders and was currently inside the Grand Church together with the Light Founder Yorishiro —and for some reason, I -Kuromiya Haine- was also together with them.</p><br/><p>In other words, this is…</p><br/><p>“A God conference again huh.” (Shiva)</p><br/><p>Shiva sits on the seat that was prepared and says this.</p><br/><p>The people here are humans, but our souls aren’t.</p><br/><p>Wind God Quasar as Shiva; Yorishiro as Light Goddess Inflation; and me as the Dark God Entropy.</p><br/><p>The three Gods of Creation that had incarnated into humans.</p><br/><p>Because of this, a meeting to decide the direction of the world will be taking place now.</p><br/><p>“Is Nova not coming?” (Shiva)</p><br/><p>Shiva asks about the remaining incarnator Nova that isn’t here.</p><br/><p>“That guy is currently a cow, you know. He is not in a position that allows him to move freely.” (Haine)</p><br/><p>“Even if he could, do you think he would wish to come here? That muscle-brain Fire God that only thinks about himself.” (Yorishiro)</p><br/><p>With what Yorishiro and I pointed out, Shiva goes ‘that’s true’ and easily accepts it.</p><br/><p>That’s why this conference that has the fate of the world involved in it will be starting with only us three.</p><br/><p>“…But before that…” (Shiva)</p><br/><p>Shiva says with an irritated tone.</p><br/><p>“What is this?” (Shiva)</p><br/><p>What does he mean by ‘what is this’?</p><br/><p>I follow the gaze of Shiva and look down the table.</p><br/><p>There’s several things decorating the top of the table, but is he saying there’s something weird within those things? I don’t think there’s anything specially weird there though.</p><br/><p>The most there is is tea and snacks to accompany it.</p><br/><p>“Why tea?” (Shiva)</p><br/><p>Huh?</p><br/><p>“In this kind of talks, coffee is the template, isn’t it?! And yet, why tea?! I didn’t come here for a tea party, you know!” (Shiva)</p><br/><p>Uwa…What’s with this anger?</p><br/><p>While Shiva-san was imploding from a taste of him that we didn’t understand that well, Yorishiro-san answered in a low tone.</p><br/><p>“…Tea is the drink of the noble ones.” (Yorishiro)</p><br/><p>Oi.</p><br/><p>“It is truly the drink that is worthy of being poured in this day’s meeting. Coffee, that’s a common place beverage whose only trait is being bitter, would only serve to obstruct the necessary thoughts in this talk.” (Yorishiro)</p><br/><p>“That’s why childish women… It is exactly the bitterness of the coffee that brushes away that unnecessary noise in the brain. Tea is just rotten leaves. Having Coacervate being the rotten one is plenty enough!” (Shiva)</p><br/><p>“Putting that decaying thing on the same level as tea is an insult!! What’s with you! People that drink that pitch-black liquid without milk and sugar only do that because they think they look cool!” (Yorishiro)</p><br/><p>“This damn woman went and said it! You drink tea only because you think that it is a luxury!! Or more like, what era are you even in?! In this era, it is already being mass-produced, and tea is now the one that’s the common place drink, you idiot!” (Shiva)</p><br/><p>“Who are you calling idiot, you deaf protagonist! Tea is not only important because it is a luxury! The complexity when making tea and the pouring, all those small things that make the taste change each time, that difficulty in use, by perfecting the correct way to make and pour that tea, that’s when the true refiness of tea can be exerted, and that’s what makes it noble! Don’t compare it to coffee that’s simply bitter!!” (Yorishiro)</p><br/><p>“What did you say?! How can you talk about noble when you don’t even understand the thick depth in the clash between bitterness and sourness in coffee?! If we talk about the complexity of the making, there’s roasting, blend, mixing, and pouring. Coffee has a lot more process! Tea simply needs to put those leaves inside a small teapot and pour warm water inside!!” (Shiva)</p><br/><p>“That’s not true! In order to perfectly bring out the taste inside the tea leaves, there’s a technique passed down that would surprise anyone. Steaming, filtering, keeping the uniformity of the concentration; to do all these, you need the technique of an expert!” (Yorishiro)</p><br/><p>“Even though it is just second-grade drink made of rotten leaves that people had no choice but to drink!” (Shiva)</p><br/><p>“That’s just a common saying! Looks like you finally showed the shallowness of your knowledge!!” (Yorishiro)</p><br/><p>‘Uwaaaaaa…’ is the groan I let out inside of my head.</p><br/><p>These people are having a heated debate about something that’s not related at all with the main topic of the meeting.</p><br/><p>Why do these two hate each other so much?</p><br/><p>Right, I remember now.</p><br/><p>Gods don’t get along with each other. The ones who incarnated as humans were normally peaceful, so I thought it would be okay, but that wasn’t the case.</p><br/><p>The Gods don’t get along well!</p><br/><p>“Haine-san!!” (Yorishiro)</p><br/><p>“Haine!!” (Shiva)</p><br/><p>Uwaaa…</p><br/><p>These Gods are now pointing their spears at me!!</p><br/><p>“What do you think, Haine-san?! You also think that tea tastes a lot better than coffee, right?” (Yorishiro)</p><br/><p>“Ha, you mistook the ally to rely on, Light Goddess. My comrade Haine is on the coffee side. He even has an espresso machine in his apartment. He won’t be taking the side of a woman like you!” (Shiva)</p><br/><p>I drink both coffee and tea though…</p><br/><p>In the times when Karen-san and the others hold tea parties in the Light Grand Church, I would drink tea all the time without any resistance after all.</p><br/><p>Not only that, I can drink green tea and barley tea.</p><br/><p>No, before that, isn’t it weird in itself to be limiting yourself to only one drink?</p><br/><p>“Comrade Haine! Go ahead and tell that fairy-tale woman there! That coffee is the drink that us adult hard-boiled men drink!!” (Shiva)</p><br/><p>“That’s not true, right Haine-san?! Haine-san understands the fluffy and gentle sensation after drinking tea, right? You understand how nice it is when we enjoy a tea with Karen-san and the others after a day of work, right?!” (Yorishiro)</p><br/><p>Why am I being faced with an ultimatum in such a place?!</p><br/><p>No matter which I choose, it is settled that it would roughen the place.</p><br/><p>If I were to take sides, it is obvious that I would be making the other side an enemy.</p><br/><p>What should I do?!</p><br/><p>“Go ahead!”</p><br/><p>““Go ahead!!””</p><br/><p>“Alcohol! Alcoholic drinks are the ones that taste the best!” (Haine)</p><br/><p>I throw in an even more troublesome topic.</p><br/><p>I decided on covering myself in the smokes by throwing oil into it.</p><br/><p>The two idiots used this as a trigger to begin an argument about another pointless topic; this time, ‘which one is better, wine or whisky?’.</p><ul><li>251: The trump card against the Demons</li></ul><br/><p>After that pointless talk, the main topic finally began.</p><br/><p>…Or more like, can’t we even have a normal conversation without doing such pointless things in the beginning?</p><br/><p>“…God Hero huh.” (Shiva)</p><br/><p>Shiva, who had already regained his calmness as the Wind Founder and Wind God, begins to ponder.</p><br/><p>Looking at him in this way, I always think this. Why can’t they get serious from the beginning?!</p><br/><p>“You thought of quite the aggressive move, Yorishiro. No, in this setting, maybe it would be better to call you Light Goddess Inflation.” (Shiva)</p><br/><p>A God Hero is the power-up method that the Light Founder and incarnator Yorishiro had planned.</p><br/><p>By giving a part of the God soul to Karen-san and the heroes who are at the front of battle, they can show divine power that surpasses that of humans.</p><br/><p>To the point that they can fight on even grounds against the Demon Lords.</p><br/><p>Truly a trump card for victory.</p><br/><p>“…A few days ago, knowing that it was not a good move, I still activated the God Hero form with Karen-san and I. The Light God Hero. The result could be said to have been great. If it’s that power, it isn’t impossible for the humans to defeat the Demon Lords.” (Yorishiro)</p><br/><p>Ignoring the full confidence of Yorishiro, Shiva pointed this out.</p><br/><p>“I heard that that opponent was the previous light hero.” (Shiva)</p><br/><p>Being pointed out this, the fluent words of Yorishiro stop.</p><br/><p>“So you were forced to use the trump card that is supposed to be used to defeat the Demon Lords…against a human. To think that you would get cornered to such extent. If I remember correctly, your previous light hero was…Ates, right? Moreover, even when you used that power, you still weren’t able to finish her and she ended up escaping.” (Shiva)</p><br/><p>“Regarding the whereabouts of Ates, we are putting all our effort in the search. No matter the case, it is better to think of her as a threat on the level of Demon Lords. The fact that we don’t know what she might pull makes her even more eerie than the Demon Lords.” (Yorishiro)</p><br/><p>Yorishiro honestly admitted that Ates is a fearsome existence.</p><br/><p>We will have to rely on Shiva as an ally from now on.</p><br/><p>Yorishiro understands that uselessly playing tough will only make trust decrease.</p><br/><p>“Today’s topic is the God Heroes.” (Haine)</p><br/><p>Without any choice, I decide on bringing out a lifeboat.</p><br/><p>“It is true that Ates’ existence is unpleasant, but the direct threat to humanity is the Demon Lords. And the method to defeat the Demon Lords will be the God Heroes.” (Haine)</p><br/><p>Just a few days ago, Karen-san and Yorishiro joined hearts to create the Light God Hero, but…Michael, Gabriel, Uriel, Raphael; in order to defeat these four Demon Lords, just the Light God Hero Karen-san would not be enough at all.</p><br/><p>“Everyone is necessary. The Earth, Water, Fire, Wind, and Light God Heroes.” (Haine)</p><br/><p>Mirack, Celestis, Sasae-chan, and Hyue; by having those girls become God Heroes, we will have the ability to fight against the Demon Lords.</p><br/><p>“…I see. The reason why you called me here not only as the Wind Founder but as the Wind God Quasar as well was because of this huh.” (Shiva)</p><br/><p>As expected of Shiva, he understands fast.</p><br/><p>“In other words, if I were to join hearts with Hyue and give her part of my God soul, Hyue can become a Wind God Hero. By doing this, it would be possible for her to defeat Raphael.” (Shiva)</p><br/><p>“That’s how it is.” (Haine)</p><br/><p>But that method won’t work unless the Wind God Quasar himself consents though.</p><br/><p>“I have a few questions.” (Shiva)</p><br/><p>He is the man that manages the Wind Church as the top. Obviously he wouldn’t be nodding or shaking his head easily.</p><br/><p>“We give a part of us to the heroes, but…you said it was the ability to change the prayer energy into power, right? Are you seriously saying that? Or more like, are you sane?” (Shiva)</p><br/><p>It couldn’t be helped that Shiva would be showing disapproval to that.</p><br/><p>The prayer energy is, in a sense, the source of the chaos in this world.</p><br/><p>The prayers that come from the humans to the Gods are strong and dense emotional energy. By taking in this, they become stronger than before and would increase their ego.</p><br/><p>I was sealed at that time, so I wasn’t involved in anything of that though.</p><br/><p>But by basking in the prayer energy for long, the Gods changed and in return became existences that can’t keep existing without being supplied continuously by prayer energy.</p><br/><p>On the other hand, due to the advance in human civilization, the need for Gods decreased, and with it, the prayers grew less.</p><br/><p>The four Base Element Gods that received the biggest hit because of the decrease in prayers had weakened to a point that you wouldn’t be able to see a shadow of their peak era.</p><br/><p>Shiva in front of us is also one of those four Base Element Gods.</p><br/><p>“The power of prayers is overwhelming. It is true that if they could absorb that power, the heroes would be able to increase their strength to a hundred times what it is. It apparently not only makes it possible to absorb the prayers directed at the God, but also the prayers that are directed at the hero herself?” (Shiva)</p><br/><p>“The popularity and the trust they have for them would be a more appropriate way to put it. It wouldn’t be a stretch to say that the popularity of Karen-san and the others is the highest than any hero has achieved before. That’s why becoming a God Hero would be effective.” (Yorishiro)</p><br/><p>“…”</p><br/><p>Shiva didn’t say anything.</p><br/><p>There’s no other who would understand as much the fearsomeness of the prayer power.</p><br/><p>Prayers are a drug for the Gods. First it will provide heaven, and then, it will drag you to hell.</p><br/><p>I only know its fearsomeness from theory, but Shiva is experiencing it himself.</p><br/><p>“The corrosion that the prayer power brings about is made in a way so that the Gods are the ones that will be taking the brunt. We won’t be making Karen-san and Hyue-san suffer a burden that can’t be taken back.” (Yorishiro)</p><br/><p>If we put it in another way, it would mean that all the bad things would be shouldered by the God, so you can’t simply say ‘yes’ with a half-baked resolve.</p><br/><p>I may be repeating myself here but, Shiva understands the harshness of it with his own body.</p><br/><p>“…I will ask one more question. Aren’t we Gods going to resolve the matter of the Demon Lords ourselves?” (Shiva)</p><br/><p>“That’s…” (Yorishiro)</p><br/><p>“I will talk about that.” (Haine)</p><br/><p>It is true that I as the Dark God would be able to defeat the Demon Lords by myself.</p><br/><p>Even if they were to come at me all four at the same time, I have the confidence that I would win 10 times out of 10.</p><br/><p>“But this danger is one that has fallen onto the humans themselves. I think that the humans have to resolve their own problems.” (Haine)</p><br/><p>“…”</p><br/><p>“If they didn’t do that and were simply saved by the Gods, the humans would lose their own ability to save themselves. Wouldn’t that be the worst tragedy to humans?” (Haine)</p><br/><p>It is exactly because humans overcome their own difficulties that they have advanced this much.</p><br/><p>From now on, humans will be putting their very existence at stake to fight against monsters. And the position of the highest will only be allowed to be theirs once they have won it themselves.</p><br/><p>I wouldn’t like it if humans were to become beings that feel that being saved is a given and are unable to stand up on their own feet.</p><br/><p>“Of course, I am right now the human, Kuromiya Haine. When the time comes, I will also be fighting as another human being. But—!” (Haine)</p><br/><p>“No need to say more. You want to bet everything on the possibility of humans, right?” (Shiva)</p><br/><p>Shiva raised his hand and stopped me.</p><br/><p>And then, he said what I wanted to say.</p><br/><p>“On top of that, the Demon Lords are sly. As long as they think that they can’t win, they won’t be facing Haine-san head on. They would instead run around and destroy the settlements that had become short handed and make it a guerrilla warfare.” (Yorishiro)</p><br/><p>The opinion of Yorishiro is sound.</p><br/><p>If that happens, it would be muddy. Even if the Demon Lords were to be defeated after, more than half of the human population will be gone and the civilization will regress heavily.</p><br/><p>“As expected, there’s the need for more fighting force. At the very least, a number that equals that of the Demon Lords; a fighting force that rivals that of Demon Lords.” (Yorishiro)</p><br/><p>“For that sake, God Heroes are…” (Shiva)</p><br/><p>Shiva says this as if he had decided.</p><br/><p>Or maybe he had already decided from the very beginning.</p><br/><p>“Understood. I will also aim to have Hyue become a God Hero.” (Shiva)</p><br/><p>Consent.</p><br/><p>“This body is already on the point of crumbling and it is unable to fight anymore. If I can still be of use to humans, the most I would be able to do would be to share the burden with Hyue.” (Shiva)</p><br/><p>After 1,600 years, the Wind God had completely come to the side of loving humans and his heart grew strong as well.</p><br/><p>“In order to obtain power that surpasses the Dark God, the Wind nation grew along with me. Like hell I would let monsters destroy us now. We will be walking further ahead together from now and in the future.” (Shiva)</p><br/><p>With this, one more God Hero will be born.</p><br/><p>But the problem comes from now on.</p><br/><p>Because there’s no possibility for any other God Hero to be born.</p><br/><p>252: No clue</p><br/><p>“…So, what should we do from now on?” (Shiva)</p><br/><p>That’s right.</p><br/><p>Yorishiro had made Karen-san a light God Hero and Shiva will be making Hyue a Wind God Hero.</p><br/><p>With the momentum created, you would normally go ‘now, what’s next!’, but…that’s all there is.</p><br/><p>There’s nothing more.</p><br/><p>We can’t find a way to make the other heroes into God Heroes!</p><br/><p>“…”</p><br/><p>“…”</p><br/><p>Yorishiro and Shiva must have noticed that point as well.</p><br/><p>We three were silent.</p><br/><p>“…Well, first, let’s arrange the information.” (Haine)</p><br/><p>The light Karen-san and the wind Hyue; after clearing these two, there’s three remaining heroes.</p><br/><p>The fire Mirack, water Celestis, and the earth Sasae-chan; in order to make these three into God Heroes, there’s the need for the help of their respective Gods, but…</p><br/><p>“All those other Gods are of no use…” (Haine)</p><br/><p>“Right…” (Shiva)</p><br/><p>“True…” (Yorishiro)</p><br/><p>Yorishiro, Shiva, and I were sharing the grief.</p><br/><p>The three Gods necessary to make the other heroes into God Heroes: the Fire God Nova, the Water God Coacervate, Mother Earth Mantle.</p><br/><p>All of them can’t be relied on and we have hit a wall!!</p><br/><p>And so, the reason why they can’t be relied on…</p><br/><p>First, there’s the Fire God Nova. He has incarnated just like us and is living in the surface world. But he didn’t incarnate in a human, but into a monster. The fire element monster, Phalaris.</p><br/><p>He was defeated by me and is now living a lazy life in Muspelheim.</p><br/><p>Even now we meet every now and then, but he was completely a simple pet.</p><br/><p>About that Fire God Nova…</p><br/><p>“This God Hero plan…do you think he will accept joining in as well?” (Haine)</p><br/><p>“Of course it is impossible. That muscle-brained idiotic God.” (Shiva)</p><br/><p>Even when Shiva is a Base Element God like him, he was merciless in his way of speaking about Nova.</p><br/><p>It is true that Nova is currently only a cow and looks completely harmless, but in the past, he was in the side that hated the humans the most.</p><br/><p>The reason he incarnated as the fire cow Phalaris was to use the high firepower of a monster to burn the humans after all.</p><br/><p>“Do you think a guy like that would go as far as facing a painful experience to assist in the making of a God Hero? He would simply ruminate over it and then reject it.” (Shiva)</p><br/><p>I also thought the same, so I didn’t say anything.</p><br/><p>It is clear that it would be quite difficult to convince Nova and have him make the hero Mirack of the same element into a God Hero. But what’s even more despairing is that Nova is actually easier to deal with than the remaining two.</p><br/><p>From the remaining Gods, the only one that’s actually possible to convince is Nova.</p><br/><p>“…That Coacervate guy, what in the world is he doing?” (Haine)</p><br/><p>“Don’t know. I haven’t seen him at all lately.” (Shiva)</p><br/><p>The Water God Coacervate is the most ingenious (self-proclaimed) God out of the six Gods of Creation .</p><br/><p>Because of some trouble, I destroyed his surface world body. Even so, because he is a God, his soul didn’t suffer anything, but since then, I haven’t seen him once.</p><br/><p>“I have met him-desu wa yo.” (Yorishiro)</p><br/><p>““Eh?””</p><br/><p>Shiva and I were both surprised at the statement of Yorishiro.</p><br/><p>She met him? That guy?</p><br/><p>“It was right after Haine-san erased Mantle. Realizing that a God had been erased, he planned on creating another siege against Haine-san.” (Yorishiro)</p><br/><p>“And so, he approached you first since you are the natural weakness of Haine huh. As underhanded as always.” (Shiva)</p><br/><p>I also agreed with the opinion of Shiva.</p><br/><p>“And then, what happened after?” (Haine)</p><br/><p>“I immediately refused, and after insulting him for a good while, I destroyed the monster body that he was residing in. But if I knew things would turn out like this, I would have captured him and stuffed him inside an insect box or something.” (Yorishiro)</p><br/><p>As always, the grudge Yorishiro has towards the four Base Elements runs deep.</p><br/><p>But even if Coacervate were to appear here, he would be even more difficult to convince than Nova. After all, in terms of being harmful towards humans, he would surpass Nova. He is trash that treats humans as toys and plays around with them.</p><br/><p>And so, the conversation about Coacervate had ended.</p><br/><p>“And then, about Mantle…” (Haine)</p><br/><p>Mother Earth Mantle.</p><br/><p>This one there’s nothing we can do.</p><br/><p>It has already been mentioned in the conversation just now, but she has been erased and is not in this world anymore.</p><br/><p>There’s no way we would be able to convince or have her cooperate if she is not even here to begin with.</p><br/><p>“So we are at a stalemate huh.” (Haine)</p><br/><p>“Desu wa ne.” (Yorishiro)</p><br/><p>The more we talk, the more grim the mood turns.</p><br/><p>We are about to fight the Demon Lords face on, and yet, we can only secure two God Heroes which is disheartening.</p><br/><p>Now that it has come to this…</p><br/><p>“Can’t be helped.” (Haine)</p><br/><p>I stand up.</p><br/><p>“No point brooding here. No choice but to act. If there’s at least 1% possibility, let’s try acting to achieve it.” (Haine)</p><br/><p>“What do you mean by that? Are you saying you will be going to search and defeat the Demon Lords yourself?” (Shiva)</p><br/><p>No, that will be the last choice.</p><br/><p>Before doing that, I would like to do everything we can.</p><br/><p>“Then, are you going to go convince Nova? He is the one with the most chances within the remaining Gods, but…” (Yorishiro)</p><br/><p>That’s not it either.</p><br/><p>It is true that within the Gods, the one who we clearly know where he is and there’s a possibility of convincing is Nova. That’s why I will leave him for later. It is exactly because we can go convince him anytime we want that there’s no need to hurry and do it.</p><br/><p>“Then…what are you going to do?” (Yorishiro)</p><br/><p>Yorishiro looked like she didn’t understand at all, so I said the answer.</p><br/><p>“I will be reviving Mother Earth Mantle.” (Haine)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-249-evil-light\" id=\"prev_chap\" title=\"Chapter 249 - Evil Light\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-253-255-to-the-depths-of-darkness\" id=\"next_chap\" title=\"Chapter 253-255 - To the depths of Darkness\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236348\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}