{"title": "Chapter 264-265 - Ferocious endurance", "id": 264, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-264-265-ferocious-endurance", "volume_title": "Volume 3", "body": "<h1>Chapter 264-265 - Ferocious endurance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 264-265: Ferocious endurance</h4></header></p><div class=\"entry-content\"><br/><p>With a single attack, Sis Kyouka had been defeated.</p><br/><p>She is barely alive, but if not treated as soon as possible, her life might burn out at any moment.</p><br/><p>“Medic! MEDIC—!!!” (Mirack)</p><br/><p>I called out for a medic, but I soon gulped my breath.</p><br/><p>This is still within the pressure field of Michael. Even if regular folks were to run here, they will simply end up bound.</p><br/><p>Treating an injured is more impossible than a dream.</p><br/><p>“Sis! You can’t die! Please keep breathing! You can’t close your eyes!!” (Mirack)</p><br/><p>I desperately tried to keep the consciousness of Sis Kyouka that felt as if it were about to go away.</p><br/><p>“……………..Mirack…YOU IDIOT!!!” (Kyouka)</p><br/><p>Sis Kyouka used all her strength to glare back at me.</p><br/><p>“Wa?!”</p><br/><p>“Did you forget where you are right now?! The direction you should be facing is to the front!” (Kyouka)</p><br/><p>!!</p><br/><p>When I turn my head as Sis Kyouka reprimanded, a giant man big like a mountain was standing there.</p><br/><p>“Michael…!!” (Mirack)</p><br/><p>He was already the very representation of despair.</p><br/><p>He looked down at us without saying anything. The moment I noticed that, I knew I messed up.</p><br/><p>What an idiot I was. It was a given that I would be scolded by Sis Kyouka that’s on the verge of death.</p><br/><p>I had my enemy so close, and yet, I was showing my back full of openings.</p><br/><p>If he had swung his fist down at that time, it would have been the end of everything.</p><br/><p>“…Why aren’t you doing anything?” (Mirack)</p><br/><p>While covering for Sis Kyouka who was down, I face Michael.</p><br/><p>Even if it turned into a fight, I don’t have the confidence that I would be able to last a second though.</p><br/><p>“I told you already. You have the qualification to be my opponent.” (Michael)</p><br/><p>The giant lets out a voice that felt as if it could create a tremor.</p><br/><p>“Monsters are the race that should be the rulers of all things. The summit has to show pride. Getting a victory by taking advantage of the weakness of your opponent in an underhanded manner would make you lower than an insect. It isn’t an action you can take pride in.” (Michael)</p><br/><p>“?!”</p><br/><p>“Now, my opponent, fight me. In order to judge the fate of our existence, the ones that are my opponents shouldn’t die groveling on the ground but standing. Or will you curl up crying and once again lose the qualification to be my opponent?” (Michael)</p><br/><p>“…If I lose it, what will happen?” (Mirack)</p><br/><p>“Of course, I will simply step on you as I would with an insect.” (Michael)</p><br/><p>How egoistic!</p><br/><p>It is humiliating, but I managed to stay alive because of his own sense of self-satisfaction huh.</p><br/><p>I decide to provide quick treatment to Sis Kyouka, at least to reduce the bleeding, and then…</p><br/><p>“Ignis Militant corps!!” (Mirack)</p><br/><p>Without minding, I call to my allies at the back.</p><br/><p>“Retreat! Retreat!! Move back to a distance where the pressure of the Demon Lord can’t reach, and confront the other monsters from there! The Demon Lord…” (Mirack)</p><br/><p>…The Demon Lord…</p><br/><p>I lost my words for a moment there.</p><br/><p>Don’t cower here! Let it all out!! In one breath!!</p><br/><p>“I will hold back the Demon Lord!! This fire hero Mirack will!!” (Mirack)</p><br/><p>Even if those words were a bluff, they served as encouragement to the hearts of the fire militants.</p><br/><p>They dragged their bodies back, and orderly get out of the pressure area of the Demon Lord.</p><br/><p>“You are prioritizing the fight of the army rather than this one huh. Is that the style of you heroes?” (Michael)</p><br/><p>“…A hero exists to protect the powerless people from the monsters. If the Demon Lords are the strongest monsters, there’s no other than a hero to defeat them!!” (Mirack)</p><br/><p>I take a battle stance and face this giant.</p><br/><p>His pressure continued to attack me, and if I were to let my guard down for a second, I feel like all my joints might break and I would collapse.</p><br/><p>But even so, I will stand with the intention of scraping away my lifespan.</p><br/><p>If I get out of this alive, after this fight ends, I think I will end up with a head full of gray hair, but that’s still the better case.</p><br/><p>Because in this fight, the possibility of surviving is a lot lower after all.</p><br/><p>“…You managed to resist my pressure and made the frontline pull back; that was good judgement. But it doesn’t provide an actual solution.” (Michael)</p><br/><p>The tone of Michael didn’t show any ridicule or contempt, but there was an overwhelming animosity.</p><br/><p>“It is true that if they fall back, they will be able to escape my pressure. Then, if I do one step forward…” (Michael)</p><br/><p>And in reality, he did take one step forward.</p><br/><p>*Doshin!*</p><br/><p>When his feet touched the ground, a heavy sound was let out and it felt as if the ground trembled.</p><br/><p>I unconsciously take one step back at that.</p><br/><p>“That’s right. You people will have to take a step back. If you continue doing that, what will happen? In this direction, this so called homeland you should protect is supposed to be there.” (Michael)</p><br/><p>It was just as Michael said.</p><br/><p>At our back, there’s thousands of people living in Muspelheim.</p><br/><p>We have to absolutely stop them from reaching there.</p><br/><p>That’s why, in actuality, we shouldn’t be allowed to even take a step back.</p><br/><p>In the first place, at my back, there’s something that’s closer than Muspelheim; Sis Kyouka lays there.</p><br/><p>It took the fire militants their all to get away from the territory of Michael and they didn’t have the leeway to bring Sis along with them.</p><br/><p>I can’t blame them.</p><br/><p>That’s how powerful the pressure of this guy is.</p><br/><p>In other words, I have no choice but to defeat Michael without making one more step back.</p><br/><p>There’s no choice but that!</p><br/><p>“Hah…!”</p><br/><p>I am the only one here.</p><br/><p>The comrades I am always fighting together with are not here today.</p><br/><p>Their lands are far away from here. There’s no convenient development like them coming to my help.</p><br/><p>……</p><br/><p>Karen, Celestis, Sasae, Hyue; even if we are separated, you give me strength.</p><br/><p>Right.</p><br/><p>“Fire hero, Katack Mirack! Onwards!!” (Mirack)</p><br/><p>There’s only one thing I can do against the Demon Lord that is leaps and bounds superior to me.</p><br/><p>Hit him with my strongest attack —using all of my strength.</p><br/><p>“Fire fist, Barbarossa! Change my divine power into fire!! A flash that burns stronger than fire!!” (Mirack)</p><br/><p>I bend down and pull back my left fist plenty, as if my the fist clad in the fire knuckle was pulling a bow.</p><br/><p>After placing plenty enough divine power, I push out my fist at full speed.</p><br/><p>The technique I gained from training with Karen and the others.</p><br/><p>“[Fire Fist Line]!!” (Mirack)</p><br/><p>The beam that was released from my fist was the Fire Fist Line!</p><br/><p>The fire divine power that originally holds the strongest area of effect power, instead concentrates the power in a set range and a high temperature attack is possible.</p><br/><p>Fire Fist, pierce through the Demon Lord with this!!</p><br/><p>“Gugh!”</p><br/><p>The Fire Fist that stretched from my fist had struck the chest of the Demon Lord directly.</p><br/><p>That much was a given.</p><br/><p>Now all that’s left is whether my Fire Fist will pierce or not through his chest that looked as if it were sturdier than a castle wall!!</p><ul><li>265: Heat of burning blood</li></ul><br/><p>The new technique, Fire Fist Line.</p><br/><p>A technique I created using Karen’s ‘Holy Light Line’ as reference.</p><br/><p>Rather than taking advantage of the fire’s trait of increasing the range as far as the output gives, you concentrate it at one point and increase its piercing power.</p><br/><p>If we can’t burn it all, pierce a vital point.</p><br/><p>Pierce.</p><br/><p>“PIERCEEEE!!” (Mirack)</p><br/><p>The Demon Lord Michael who had received that ‘Fire Fist Line’ with his chest had lowered his waist and was resisting it; receiving my strongest attack.</p><br/><p>“Gunuuu!!” (Michael)</p><br/><p>Stop it.</p><br/><p>Don’t resist it. Quickly get pierced by it.</p><br/><p>From within the techniques I have, this is the technique that holds the strongest offensive power while sacrificing the area of effect.</p><br/><p>If this Fire Fist Line is defeated, there’s essentially no way for me to defeat Michael.</p><br/><p>That’s why, don’t be reserved and just get pierced already!</p><br/><p>“Haah!” (Michael)</p><br/><p>My desire was mercilessly broken.</p><br/><p>Michael simply pushed his chest out and repelled my divine power, and the fire fist was turned into small sparks.</p><br/><p>“It was a pretty good attack.” (Michael)</p><br/><p>Michael’s chest only had a slight burn mark on it, moreover, that burn soon regenerated and was gone.</p><br/><p>I lost…!</p><br/><p>My brain was filled with that single word.</p><br/><p>There’s already no method for me to defeat Michael.</p><br/><p>“E…Even if humans are eradicated…!” (Mirack)</p><br/><p>I say this with a trembling voice.</p><br/><p>“Monsters won’t be able to rule the world. The Mother Monsters are gone! In exchange for giving birth to you Demon Lords!!” (Mirack)</p><br/><p>“Hoh…” (Michael)</p><br/><p>“A living form that can’t procreate can’t become the ruler of nature! The monsters…and you Demon Lords will be the last of your species!” (Mirack)</p><br/><p>It was completely the bark of a losing dog.</p><br/><p>Now that I have lost the way to defeat him, what came out from my mouth were the barks of a sore loser that couldn’t think before speaking. What a pathetic feeling.</p><br/><p>“Do you really think that?” (Michael)</p><br/><p>Michael spreads out the fire wings that were basically his symbol and fanned them once.</p><br/><p>“Guh!”</p><br/><p>The hot wind that was created from that single flap made me cover my face to protect it. Moreover, from inside that hot wind there was something inside. Small specs of dust… ashes?</p><br/><p>“My mother, the Fire Mother Monster, the immortal bird Phoenix used her own body covered in flames to burn herself and was giving birth to monsters from those ashes.” (Michael)</p><br/><p>Don’t tell me…!</p><br/><p>The ashes that were send flying from the flap of Michael…every ash became bigger, and in time, take the shape of a living being, and begin to operate.</p><br/><p>From each one of the ashes, one fire element monster was born?!</p><br/><p>“We Demon Lords have inherited the trait of our now deceased Mother Monsters, therefore, we Demon Lords will be the source of monster prosperity.” (Michael)</p><br/><p>Then…the reason for the bothering mystery of the monsters appearing from nowhere in this battle was because Michael was making them right as they went?!</p><br/><p>The army of monsters that the Ignis militant corps are desperately trying to stop as well.</p><br/><p>Then, this Demon Lord Michael is truly the source of our crisis.</p><br/><p>No matter how many monsters we defeat, as long as we don’t defeat Michael, this won’t make a turn at all!</p><br/><p>“I see that you are out of hands. I as well have taken too much time, and if that Kuromiya Haine were to appear, it would trouble me. Let’s hurry with my job.” (Michael)</p><br/><p>At that moment, I noticed another despairing thing.</p><br/><p>The fire element monsters that Michael gave birth to show me were mostly fire bird types.</p><br/><p>It is not on the level of the Phoenix that gave birth to Michael himself, but they were falcon and crow types.</p><br/><p>Meaning that they are going to use flying!</p><br/><p>“W-Wait!” (Mirack)</p><br/><p>It was just as I imagined.</p><br/><p>They spread their wings and flew high into the sky towards Muspelheim.</p><br/><p>This means…they are going to fly over the defense line that the Ignis militant corps set up!</p><br/><p>“There’s no need for the winged ones to play along with the people stuck on the ground. I will give a quick sky burial to this so called Muspelheim.” (Michael)</p><br/><p>“Stop it!!” (Mirack)</p><br/><p>I immediately released a [Flame Burst] and try to burn down all the birds that were about to fly away.</p><br/><p>But the number of birds that Michael created were many and it wasn’t something that only my flames could burn down.</p><br/><p>Moreover…</p><br/><p>“Uwaaa?!” (Mirack)</p><br/><p>“Worrying about something else when you are facing me. Should I call that boldness?” (Michael)</p><br/><p>That was close!</p><br/><p>I instinctively evaded the fist of Michael.</p><br/><p>If it had hit, it would have ended right that instant.</p><br/><p>While dealing with this Michael that was impossible to defeat, I had to eliminate all the hundreds of small fire birds!</p><br/><p>…No good.</p><br/><p>A decent amount were already outside my range and were heading to Muspelheim.</p><br/><p>I already have no means to stop them.</p><br/><p>At this rate, the people of Muspelheim will be eaten by them.</p><br/><p>Did I fail in my duty as a hero?!</p><br/><p>But at that moment…!</p><br/><p>*Gooooon!!*</p><br/><p>“Let there be hot-bloodedness!!”</p><br/><p>A fire dragon bursted far at the back. The fire birds were burned down without leaving a single one behind.</p><br/><p>That technique! And that phrase!!</p><br/><p>“Master?!” (Mirack)</p><br/><p>My Master and the Fire Founder; that big frame that doesn’t lose to even the Demon Lord Michael was standing straight with pride.</p><br/><p>…No, it is not only Master. At his surroundings, there’s uncountable amount of people.</p><br/><p>Could that be…! The whole force of the Ignis Militant corps?!</p><br/><p>“Mirack-oneesama!”</p><br/><p>“We have come to save you. Are you okay?!”</p><br/><p>“…Arrived like a flash, resolve everything in a flash.”</p><br/><p>Even Braidley, Glassfin, and Firey were there.</p><br/><p>The people that I ordered to standby at the back, the people that were at the surroundings of Muspelheim and couldn’t make it in time for the gathering; are you telling me they have all gathered in this battlefield?!</p><br/><p>A concentration of all the power?!</p><br/><p>“…That high temperature attack just now was the strongest technique passed down in the Ignis Militant corps, ‘Grand Melt’…”</p><br/><p>From my feet, I heard a weak voice.</p><br/><p>The voice of the heavily injured Sis Kyouka?!</p><br/><p>“It is a joint attack between many fire militants releasing fire divine power together. The more fire militants join, the higher the power.” (Kyouka)</p><br/><p>That attack just now was a ‘Grand Melt’ that utilized the whole of Muspelheim’s Ignis militant corps?</p><br/><p>No wonder it had crazy firepower! It can easily wipe out a flock of birds!</p><br/><p>“…It is obvious, and yet, when I actually see it with my own eyes, it is aweing. With the joint power of the whole fire militants, they can easily surpass the power of a single hero. Why didn’t we notice such a simple thing?” (Mirack)</p><br/><p>On top of that, to think that Master who had left the battlefield to become a Founder had joined the fray as well.</p><br/><p>Leaving the current Militant General at his side, Master says his usual words.</p><br/><p>“Let there be hot-bloodedness!!” (Enou)</p><br/><p>That’s right. What am I as a fire hero doing letting my blood freeze in front of a crisis?</p><br/><p>My body has hot burning blood circulating.</p><br/><p>That burning blood creates fire divine power!!</p><br/><p>That’s what our Master had taught us in the end to Sis Kyouka and I.</p><br/><p>That’s why, that person always says this…</p><br/><p>“Let there be hot-bloodedness!!” (Enou)</p><br/><p>“Ignis Militant corps! Begin battle!” “Hero-sama! We will also fight!” “What’s the point of an army if they don’t protect their homeland!!” “Let your blood boil! Heat up your heart!!” “Don’t get cocky, monsters!!” “Watch the stubbornness of humans!!”</p><br/><p>The fire militants were plenty hot-blooded as well.</p><br/><p>That heat began to infect the blood in my body as well.</p><br/><p>“…The monsters that I send ahead have been wiped out huh. What an agile bunch.” (Michael)</p><br/><p>And within all this, Michael was indifferent.</p><br/><p>You won’t understand.</p><br/><p>This heat that resides within us humans.</p><br/><p>Let there be hot-bloodedness!</p><br/><p>The fight is still not over!</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-261-263-suffering-of-the-fire-capital\" id=\"prev_chap\" title=\"Chapter 261-263 - Suffering of the Fire capital\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-266-267-all-out-battle\" id=\"next_chap\" title=\"Chapter 266-267 - All-out battle\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236353\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}