{"title": "Chapter 273-275 - Hellfire", "id": 273, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-273-275-hellfire", "volume_title": "Volume 3", "body": "<h1>Chapter 273-275 - Hellfire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 273-275: Hellfire</h4></header></p><div class=\"entry-content\"><ul><li>273: Hellfire</li></ul><br/><p>The ultimate technique of the Fire Demon Lord, Phoenix Hammer; the Pleiades Burst that has my everything.</p><br/><p>The whole power of a demon and human had become fire and mixed.</p><br/><p>It became a fire that could burn down the whole world and exploded.</p><br/><p>“Kyaaaaa!!”</p><br/><p>“Mirack-oneesama!!”</p><br/><p>“…Incredible explosion!”</p><br/><p>From the outside of the explosion, the fire militants rise their voice that were practically screams.</p><br/><p>Even if it were just the waves of the explosion, they probably hold a power similar to that of a regular Flame Burst.</p><br/><p>I don’t think they are completely okay after that, but I can only pray they are.</p><br/><p>I truly had no leeway to mind that.</p><br/><p>I was basically in the center of the explosion and had done a direct clash with Michael after all.</p><br/><p>“Kunuuuuu!! Haaaah!!” (Mirack)</p><br/><p>I was within this high temperature that felt as if I would evaporate by simply standing there. I am able to stay alive in here thanks to the unbelievable power of the God Hero power-up.</p><br/><p>Even with that, I felt like my consciousness would fly by sheer heat.</p><br/><p>And in reality, I was about to lose my consciousness for a moment there unable to resist the heat, and at that instant, I would have lost my God Hero form and be cinders by now.</p><br/><p>I release divine power to the point that my head is going crazy.</p><br/><p>I had no other choice but to do it.</p><br/><p>My most fearsome enemy, Michael, was glaring at me as if he were an evil spirit.</p><br/><p>We both are using all the divine power we have remaining to change it into fire and clash it with each other.</p><br/><p>What’s scattering to the surroundings was the heat that had lost its direction and was spilling. It was truly to the word waves. Yet, with only those waves, the earth turned into magma, and the heated air rose up an atmospheric current on the level of a tornado, and while burning dry grass and insects, it increases in speed. On top of that, it wasn’t only for a moment, the explosions continued as long as Michael and I continue to output divine power.</p><br/><p>We were both desperate.</p><br/><p>No matter how hellish of a problem we bring to the surroundings, the moment the power tilts to one side, the outpushed side will receive all the heat and be burned into cinders.</p><br/><p>That’s why Michael and I had no choice but to push at our highest output.</p><br/><p>The wing of the immortal bird and the horns of the cow; a clash between human and demon with their existence at stake.</p><br/><p>Possessing the same fire element and strangely having the same stance as they clash their ultimate techniques.</p><br/><p>We completely different races were for some reason fighting in such a similar way right now.</p><br/><p>“…I understand now.” (Mirack)</p><br/><p>“Huh?” (Michael)</p><br/><p>I speak while I was releasing my divine power at full strength.</p><br/><p>I was impressed by how my voice travelled well even within this high temperature, but maybe it is because we are clashing our fists and it is travelling through there.</p><br/><p>At any rate, Michael reacted.</p><br/><p>“The biggest difference between you and me! I am fighting together with everyone. You are alone.” (Mirack)</p><br/><p>“Did you go crazy in the face of death? What nonsense are you saying in such an extreme situation!” (Michael)</p><br/><p>Michael answers back with that stupidly straightforward personality of his. But there’s no way he would understand what I am trying to say.</p><br/><p>“I as well thought I had understood it, but thanks to fighting with you, I have once again actually felt it; that’s what I am trying to say. I too was alone in the past. I thought I had become stronger by myself and tried to stand at the summit where it is not possible to stand on your own…” (Mirack)</p><br/><p>The me at that time couldn’t notice that such a thing had no point at all —until the day I reunited with Karen and met Haine, that is.</p><br/><p>“That’s because humans are weak. The strength of a single human is limited. Even if that human is the strongest alone, what’s the point of it? Michael, when I met an existence like yours that was practically on a different realm from us, I thought that we would simply be crushed.” (Mirack)</p><br/><p>“That’s right. We monsters are a race that’s even tougher than <span class=\"skimlinks-unlinked\">humans.That’s</span> why the rulers of the surface world will be changed into being the monsters—!” (Michael)</p><br/><p>“Wrong!!” (Mirack)</p><br/><p>I cut off the words of Michael.</p><br/><p>I am not trying to say that. It is exactly because he can only see my words like that that monsters are not worth of being the rulers.</p><br/><p>“For us humans, what’s most important is not to get stronger ourselves, but to get stronger with everyone. I thought I understood it. That’s why I have been fighting together with my comrades Karen, Celestis, Sasae, and Hyue. But it looks like I was still lacking in understanding.” (Mirack)</p><br/><p>Today I was made to realize that.</p><br/><p>That’s because, at this moment, I have become stronger by obtaining the strength of the whole Muspelheim after all.</p><br/><p>That’s what a God Hero means.</p><br/><p>If humans intended to, it wouldn’t be only together with your acquaintances and comrades, you can become stronger together with every living being in this world!</p><br/><p>That’s why I -the fire hero, Katack Mirack…</p><br/><p>“I won’t lose to you! Michael, no matter how strong you are, against you who is alone, there’s no way the miracle created from the connections of humans will lose!!!!!” (Mirack)</p><br/><p>“Stop the barking, you lowly human!!!” (Michael)</p><br/><p>We both released our maximum output fire, and yet, both still increased radically in firepower at the same time.</p><br/><p>Michael and I were enveloped inside the hellfire we released that was on the level you would wonder if it would burn down the whole world…and we both disappeared into it.</p><br/><p>******</p><br/><p>The hellfire had dispersed.</p><br/><p>The plains outside of Muspelheim, that had become a battlefield, right now had turned into scorched earth that didn’t have a single shadow of its past self.</p><br/><p>What’s at the ground was only gray earth still letting out smoke.</p><br/><p>Far at the outside, there were still the Ignis Militant corps flabbergasted at the battle they witnessed.</p><br/><p>They retreated quite a few ways back from their original position.</p><br/><p>They had to get at least that faraway from the battle of the God Hero and Demon Lord or they would be dragged into it.</p><br/><p>And then…</p><br/><p>“Hah… Hah…!”</p><br/><p>“….!”</p><br/><p>We were alive.</p><br/><p>I was alive…and the Demon Lord Michael as well.</p><br/><p>We were right in the middle of such a vicious hell, and yet, it was surprising that both sides didn’t just turn into ashes.</p><br/><p>But there’s no way we wouldn’t be injured from that.</p><br/><p>My whole body was battered and my divine power has burned out. Soot was covering my whole face, and the tips of my hair are letting out burning sounds.</p><br/><p>Phalaris had collapsed at the far back and his legs were twitching.</p><br/><p>The burden of God Hero must have pushed him to his limits.</p><br/><p>Looks like it will be difficult to continue the God Hero form any further.</p><br/><p>And Michael was in the same state.</p><br/><p>His dignified figure was nowhere to be seen anymore, and his prided fire wings felt like they would burn out at any moment.</p><br/><p>His breathing that moved his shoulder and chest heavily were proof of his exhaustion.</p><br/><p>He has no strength left to fight. Just like me.</p><br/><p>“………………….This is as far as it goes it seems.” (Michael)</p><br/><p>Michael spoke his opinion while breathing roughly.</p><br/><p>“Being exhausted to this extent, even if I were to defeat you, I wouldn’t have the strength to destroy the human city. I also took way too much time. It wouldn’t be strange for Kuromiya Haine to come at any time now.” (Michael)</p><br/><p>Now that he mentions it, did the wireless transmission that we sent to Apollon City properly arrive?</p><br/><p>If they went on their flying machine, they should be here anytime now.</p><br/><p>“I will be leaving. I thought you people were weaklings that were not worth attention, but to think I was left in this state. It is my defeat today. Very well done.” (Michael)</p><br/><p>…Even when he is that beaten up, he still talks all high and mighty.</p><br/><p>If you have been cornered, at least get a bit agitated, damn it.</p><br/><p>It makes it even harder for me to get confidence in defeating you.</p><br/><p>“But Katack Mirack -an opponent of mine without doubt- I will advise you. I have to deny only one thing you said no matter what. I can’t leave this place without doing that.” (Michael)</p><br/><p>“…What is it?” (Mirack)</p><br/><p>“I am alone…is what you said, right? And that you have many comrades, thus, humans are the better ones……. That’s wrong. I won’t forgive humans looking down at monsters with such a reason! That’s because I…!” (Michael)</p><br/><p>The Demon Lord Michael howls.</p><br/><p>“I am not alone!!” (Michael)</p><ul><li>274: Looking up the ground</li></ul><br/><p>“I am not alone.” (Michael)</p><br/><p>Saying this, I felt as if I saw the emotions of Michael fluctuating on his face.</p><br/><p>Michael and I were both in tatters as we glare at each other in this wasteland.</p><br/><p>“We monsters originated a hundred years ago. At that time, my mother Phoenix didn’t even have her own will and was simply a device to single-mindedly make monsters.” (Michael)</p><br/><p>“The so called Fire Mother Monster huh.” (Mirack)</p><br/><p>“That’s right. Thousands to millions of monsters were born in that span of a hundred years and then disappeared. And the one who was born in this endless cycle of repetition was me.” (Michael)</p><br/><p>Be born and die; die and be born.</p><br/><p>At a glance, it looks pointless, but it provides development to the race.</p><br/><p>That’s something humans have experienced as well.</p><br/><p>Monsters also obtained self-awareness in what was thought to be an endless cycle, and as a result of questioning their own existence, the existences called Demon Lords were born.</p><br/><p>…That’s right, Haine said this.</p><br/><p>“Over a million repetitions of the life and death of demons, at the end of that void path, there’s me, the Demon Lord. You can’t speak of me without the ones of the past. Therefore, I am not alone!” (Michael)</p><br/><p>“Are you saying you are the very personification of the monsters that have been born and died until now?” (Mirack)</p><br/><p>“That’s right! Thus, I am the one to stand at the top of monsters. I have inherited the ability to make monsters from my mother! I can make new comrades from now on as much as I want! Therefore, I am not alone!” (Michael)</p><br/><p>The Demon Lord roars.</p><br/><p>“We are by no means inferior to humans!” (Michael)</p><br/><p>“…”</p><br/><p>It is just as Michael says.</p><br/><p>The past that the predecessors have paved; for us humans, that’s a priceless treasure.</p><br/><p>History, knowledge, morals; that’s something you can only obtain thanks to the efforts of the past. The great people of the past. What they have left behind is what created the ethereal civilization and the five Grand Churches after all.</p><br/><p>As a human, I couldn’t deny the past paving that Michael talks about.</p><br/><p>“But even with that, I still reject you. No matter where you go, you are alone.” (Mirack)</p><br/><p>“You want to mock me no matter what?!” (Michael)</p><br/><p>I could hear even from here the grinding of his teeth.</p><br/><p>I continue speaking without minding.</p><br/><p>“That’s because monsters are still missing something. Something that humans have and monsters don’t. As long as you monsters don’t get that, no matter how many you prosper in, no matter how much past you accumulate, you won’t be able to obtain connections.” (Mirack)</p><br/><p>“And what is that? What is it that you say we are missing? Go ahead and say it!!” (Michael)</p><br/><p>Michael already didn’t have any of his previous composure.</p><br/><p>Even though he didn’t lose his dignity even when he was cornered to the very limits.</p><br/><p>“…A heart.” (Mirack)</p><br/><p>I answered.</p><br/><p>“Living beings will recognize people aside from themselves and worry about them, for that, there’s the need of a heart. It is true that you Michael have obtained self-awareness. But you have to evolve that self-awareness into a heart. Without a heart, you won’t be able to take over humans!” (Mirack)</p><br/><p>“Heart, you say?!” (Michael)</p><br/><p>Michael was heavily confused.</p><br/><p>“What’s a heart? What’s so different from having self-awareness? We monsters have already reached the point where we can mass-produce ourselves and act on our own. Isn’t that a true to the word living being?!” (Michael)</p><br/><p>“Then, I will show you what a heart is!!” (Mirack)</p><br/><p>I slowly approached Michael.</p><br/><p>He was flustered by this and was cautious in whether he should be on guard to counterattack.</p><br/><p>Because of that, he allowed me to approach to a point where my fists could reach him.</p><br/><p>(…Oi, cow. Lend me your power once more.) (Mirack)</p><br/><p>(…Eh? Well, uhm, please let me rest for a bit more!)</p><br/><p>(I can’t afford that right now.) (Mirack)</p><br/><p>God Hero mode, activate!</p><br/><p>(Guugh?!)</p><br/><p>*Bam!*</p><br/><p>My fist hits Michael.</p><br/><p>With an uppercut, his guard was thrown up and Michael as well was blown up.</p><br/><p>Right as the hit connected, I deactivate the God Hero mode to cut off the burden on Phalaris.</p><br/><p>“““Eeeeeeeh?!”””</p><br/><p>Looks like the Ignis Militant corps in the surroundings were surprised by my violence.</p><br/><p>Everyone was looking at Michael who was soaring high in the sky.</p><br/><p>Michael continues going up.</p><br/><p>As expected of a punch in God Hero mode.</p><br/><p>He flies to a point that it might even reach the clouds.</p><br/><p>The speed he was flying at was quite high as well, so I could even hear the air being cut as he went up.</p><br/><p>Everyone must have noticed the Demon Lord that was going through the sky and beyond.</p><br/><p>After a while, Michael falls dragged down by the gravity. It made a big sound, but he managed to make a clean landing down on his knees.</p><br/><p>As expected, even when tattered, he is still a Demon Lord.</p><br/><p>“…How’s that? Did you see the heart?” (Mirack)</p><br/><p>“……Don’t mess around.” (Michael)</p><br/><p>His voice trembled even more in anger.</p><br/><p>“You suddenly punched me. What are you talking about heart in that? As I thought, you really are mocking me. Mocking this Demon Lord, you better be prepared to be crushed to pieces!” (Michael)</p><br/><p>“Fine, just try saying it. What did you see at the top of the sky?” (Mirack)</p><br/><p>With that question, the battle aura of Michael, that was about to explode, reduced slightly, and he answered.</p><br/><p>“What I saw when I was punched up into the sky was the human city that’s close by. The thing you people call Muspelheim……. I was able to take a peek at it from above. The humans living there, and even their faces.” (Michael)</p><br/><p>Looks like the Demon Lords have good eyes as well.</p><br/><p>“Everyone was looking up. The people in that city probably already know about my march. There were people pale blue in fear, there were people bright red in anger towards me, people that were confused at what was happening, and people who simply felt curiosity at this novelness. Everyone was looking at me soar high in the sky, but their faces were many. Their expressions as well.” (Michael)</p><br/><p>“That’s the heart.” (Mirack)</p><br/><p>I said.</p><br/><p>“Even when they were looking at the same direction, what they felt was different for each person. That’s why the expressions in their faces become different as well. It is because they live their own life and accumulate their own experiences that the heart they hold is different for each person as well. That’s a human!” (Mirack)</p><br/><p>It is because they hold a different heart that they are able to understand each other at times and there are times when they will enter disputes. But when they overcome that, it provides a firm connection and strength surpassing that of cooperation.</p><br/><p>Just like how it was for Karen’s group and me.</p><br/><p>“Demon Lord Michael, what about you guys?” (Mirack)</p><br/><p>“…Kugh.” (Michael)</p><br/><p>“The fire monsters you made may be facing the same direction, but are they able to feel and think different things? No, they can’t. The expression of monsters is always the same. It is the proof of a heartless demonic beast.” (Mirack)</p><br/><p>Monsters are still beasts pushed by their natural instinct that is to ‘attack humans’.</p><br/><p>Even if they have the ability to decide on things, they can’t put emotions to those decisions.</p><br/><p>Feelings and logic; with a lot of factors affecting actions, it puts color, meaning, and draws a raw story. That’s where you find the heart of humans.</p><br/><p>Everyone thinks different, but even with that, they must all live together…or there wouldn’t be civilization, culture, and history!</p><br/><p>Monsters are still far from that realm!!</p><br/><p>“…Shut up.” (Michael)</p><br/><p>*Bam!*</p><br/><p>This time, my body was the one that shook.</p><br/><p>It was practically a surprise attack. I was unable to avoid it and was send flying.</p><br/><p>In my case, different from Michael, I was send flying parallel to the ground.</p><br/><p>For a normal body, that punch would have destroyed it immediately, but right before it hit me, the God Hero mode had been activated on its own.</p><br/><p>(Don’t space out, you idiot!)</p><br/><p>That cow saved me?</p><br/><p>That guy should have been an enemy in the past, but he is saving me quite a lot today.</p><br/><p>And…the Demon Lord looked like the representation of anger.</p><br/><p>It looks as if he can’t control the anger that’s welling up inside him.</p><br/><p>“Shut up, shut up, shut up, shut up!!” (Michael)</p><br/><p>He should be in tatters, and yet, his divine power was increasing.</p><br/><p>I can’t lose either. I once again activate God Hero mode. If I don’t do that, we are definitely going to die here.</p><br/><p>Michael came punching at me pushed by his raging emotions.</p><br/><p>Throwing away all tactics and technique.</p><br/><p>“SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP!!” (Michael)</p><br/><p>I answered that shout from his heart.</p><br/><p>“I will shut up. There’s already no need for words anymore, as you already understand.” (Mirack)</p><ul><li>275: The heat is transmitted</li></ul><br/><p>We were punching each other.</p><br/><p>Michael and I; fire hero and fire Demon Lord.</p><br/><p>Leaving aside all those titles, right now we were simply being moved by the raging emotions inside of us and clashing them —using our fists.</p><br/><p>We didn’t defend and purely hit the opponent’s stomach, chest, face, as we wanted.</p><br/><p>Defending would be rude.</p><br/><p>Because there were emotions gathered in those fists.</p><br/><p>Evading them instead of receiving them would be a lack of decorum.</p><br/><p>And then, after maybe a hundred exchange of punches…two hundred…three hundred…five hundred…a thousand……</p><br/><p>…</p><br/><p>*****</p><br/><p>“Mirack-chan!”</p><br/><p>I felt light-headed.</p><br/><p>I don’t know how much time has passed.</p><br/><p>At any rate, I think I heard the voice of someone calling me.</p><br/><p>I felt as if the voice came from somewhere incredibly far, but it had called me back to consciousness, and I quickly open my eyes.</p><br/><p>When I did, I noticed Karen was standing right at my side.</p><br/><p>The light hero and my friend.</p><br/><p>“Karen?! Why are you here?!” (Mirack)</p><br/><p>Shouldn’t you be at Apollon City protecting it as the light hero?</p><br/><p>Even if it is close, why is she in Muspelheim?!</p><br/><p>Looking around, we were still at the burned outskirts of Muspelheim.</p><br/><p>“What are you saying?! We received an emergency call from the Fire Church and I came as soon as possible to assist in the notice of a Demon Lord raid!!” (Karen)</p><br/><p>…I see.</p><br/><p>That’s right. She wouldn’t hesitate for a second in rushing to help her comrades.</p><br/><p>That’s exactly how my friend Karen should be.</p><br/><p>…Yeah, I might even fall for her.</p><br/><p>“Sorry, Karen. As a friend and as the hero representing the Fire Church, I appreciate the support of the Light nation.” (Mirack)</p><br/><p>“This is not the time to be saying something like that!!” (Karen)</p><br/><p>Eh?</p><br/><p>I was thinking of increasing my points with Karen by doing a heartfelt thanks, and yet, she wrapped it up with ‘something like that’.</p><br/><p>Isn’t the Karen of today a bit heartless?</p><br/><p>“Don’t you understand in what kind of state you are in right now, Mirack-chan?! Here, look!” (Karen)</p><br/><p>Saying this, Karen takes out a pocket-mirror from out of the armor she is wearing and gives it to me.</p><br/><p>To think she would have a pocket-mirror even in her battle garment, as expected of Karen, her feminine qualities are high. But the moment I saw what was reflected in the mirror, I was blown away.</p><br/><p>“Hiih?! Monster!” (Mirack)</p><br/><p>“That’s how you look right now, Mirack-chan!” (Karen)</p><br/><p>The one that’s making a surprised expression inside the mirror had her whole face swelled up; a mysterious lifeform.</p><br/><p>Her whole face is so swollen that it was basically elliptic-shaped, and looked like some sort of bad tasting fruit.</p><br/><p>I don’t want to believe it, but Karen is saying so as well, and taking into consideration that I am the one who is looking straight at the monster in the mirror…</p><br/><p>“This thing is me?” (Mirack)</p><br/><p>Is my face all swollen up because of being punched too much?</p><br/><p>Now that I think about it, my whole body stings, and my legs were losing strength and swaying.</p><br/><p>Karen supported me right as I was about to fall, so I somehow managed to stay up.</p><br/><p>“Sorry, Karen!” (Mirack)</p><br/><p>“It is fine already. More importantly, what happened? What happened to make Mirack-chan look like a meatbun?” (Karen)</p><br/><p>A meatbun, you say!</p><br/><p>I exchanged punches with that Demon Lord Michael! And punched, punched, punched…</p><br/><p>Right, what about him!</p><br/><p>My memory was cut off while I was exchanging punches with Michael. What happened to him? I have no clue at all.</p><br/><p>I hurriedly look at my surroundings.</p><br/><p>When I did so, I saw the members of the Ignis Militant corps watching over us from afar.</p><br/><p>That there’s Aurora Knights mixed in with the group must be because they came together with Karen.</p><br/><p>But why are those guys watching over from afar?</p><br/><p>To think that the only one who would come to me when I am this beaten up was Karen…could it be that I am not popular? The moment I felt hurt by it, I understood the reason why they couldn’t approach.</p><br/><p>I finally direct my gaze to the front.</p><br/><p>“Michael. Oi, Michael.”</p><br/><p>“How troublesome. What a shameful look were you turned into by a mere human.”</p><br/><p>There, Michael was in the same state as me -all beaten up.</p><br/><p>On top of that, at his side, there was a tree human and a full-armored guy; or so to speak, two more Demon Lords.</p><br/><p>“Those guys, if I remember correctly…!” (Mirack)</p><br/><p>“The Earth Demon Lord, Uriel, and the Wind Demon Lord, Raphael…” (Karen)</p><br/><p>Leaving aside Michael who has exhausted all of his power, the only one who can resist and approach all the way here under the pressure of the newly arrived Demon Lords was Karen.</p><br/><p>Michael was reactionless at the call of those two for a while.</p><br/><p>“…?! Uriel, Raphael?! You guys, why are you here?!” (Michael)</p><br/><p>“That priestess of Lucifer-sama said ‘hurry and retrieve Michael’, so we hurriedly did.” (Raphael)</p><br/><p>“And now that we are here, what’s with that look of yours? You who is supposed to be the leader of the Demon Lords, to think that you would have so much trouble against a human.” (Uriel)</p><br/><p>The expressions of the two Demon Lords was that of scorn towards their brethren.</p><br/><p>As I thought. These guys are not people worthy of respect.</p><br/><p>“Well, we are both equally on the path of human eradication. Since we are already here, I don’t mind helping you out.” (Uriel)</p><br/><p>“Right. It looks like that scary Kuromiya Haine is not here. How about we three slaughter all the humans here at least?” (Raphael)</p><br/><p>?!</p><br/><p>What Uriel and Raphael said nonchalantly made our sense of danger rise.</p><br/><p>I confirm the state of the cow at my back.</p><br/><p>(P-Please spare me already!)</p><br/><p>No good.</p><br/><p>The God Hero mode has been used over his limits and the breathing of the cow is already feeble.</p><br/><p>It is visible that anymore God Hero transformations will be impossible.</p><br/><p>Are you telling me we have to fight two unhurt Demon Lords in this kind of state?</p><br/><p>“STOP IT!!!” (Michael)</p><br/><p>But Michael’s roar flew towards those two Demon Lords.</p><br/><p>As if the Earth and Wind were rabbits being roared at by a carnivore, they both falter.</p><br/><p>“I won’t allow you to put a hand on them!! They are my opponents! If you are going to kill them without my permission, I will crush you guys first!!” (Michael)</p><br/><p>“Oh, scary~!” (Uriel)</p><br/><p>“What’s with you? We are offering you help here. No need to shout that loudly, you know.” (Raphael)</p><br/><p>Uriel and Raphael were confused by the unexpected rage of Michael.</p><br/><p>Or more like, I am surprised as well.</p><br/><p>“There’s one thing I understood from today’s battle. In order for us monsters to take the spot as rulers, I thought that it was fine to simply defeat the humans. But that wasn’t the case.” (Michael)</p><br/><p>““?””</p><br/><p>“In order for monsters to become the new rulers of the surface world, there’s still one thing we are lacking. I don’t understand what that is, but we have to obtain it. That’s something that was made clear today…in today’s fight with my opponent, Katack Mirack.” (Michael)</p><br/><p>Michael’s gaze was directed at me.</p><br/><p>The Fire Demon Lord had his whole face swollen just like me.</p><br/><p>I can’t lack in decorum.</p><br/><p>For some reason, I felt that way and glared back straight at him.</p><br/><p>“I won’t take back my previous statement. I will be departing for today.” (Michael)</p><br/><p>“…”</p><br/><p>“But I will return for sure. Katack Mirack, for me, you are a great opponent. The more I fight you, the more I can learn. In order for monsters to stand as rulers, what is it we have to obtain? I feel like I will get that answer as I continue to fight you.” (Michael)</p><br/><p>“Fine. I will fight you as many times as you want.” (Mirack)</p><br/><p>I answered.</p><br/><p>“…But, if you are going to come again, at least obtain the ability to get jokes. As a Demon Lord, your majesticness would increase with a catch-phrase of some sort. When it comes to that way of using your intelligence, you are still far from reaching humans.” (Mirack)</p><br/><p>“…………..”</p><br/><p>When I said that to make fun of him, Michael went silent for a while and straightforwardly said this.</p><br/><p>“…Let there be hot-bloodedness.” (Michael)</p><br/><p>Saying this, Michael turns back as if he was satisfied and leaves.</p><br/><p>Karen, the people there, and me dumbfoundedly saw off that back, and even the Demon Lords were the same.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-270-272-the-decision-of-mirack\" id=\"prev_chap\" title=\"Chapter 270-272 - The decision of Mirack\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-276-277-after-burning-out\" id=\"next_chap\" title=\"Chapter 276-277 - After burning out\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236357\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}