{"title": "Chapter 296-297 - Evil God appears", "id": 296, "volume": 3, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-296-297-evil-god-appears", "volume_title": "Volume 3", "body": "<h1>Chapter 296-297 - Evil God appears</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 296-297: Evil God appears</h4></header></p><div class=\"entry-content\"><br/><p>*Splash!*</p><br/><p>Making a noisy splashing sound, what jumped out from the undiluted lifeforce was one lizard.</p><br/><p>“Gyaaaaa!!” (Celestis)</p><br/><p>“L-L-Lizard?! Noo, don’t come over here!” (Karen)</p><br/><p>All girls hate slimy reptiles!!</p><br/><p>And so, Celestis-chan and I were incredibly agitated.</p><br/><p>At that time, *Gush!* the burning leg of Mirack-chan steps on the lizard-san.</p><br/><p>Did she go through the trouble of stopping her fight with Gabriel?</p><br/><p>“…What are you two doing?” (Mirack)</p><br/><p>““I am sorry.””</p><br/><p>Mirack-chan is manly as always!</p><br/><p>“Look closely. This guy is not a real lizard. It is a monster.” (Mirack)</p><br/><p>Mirack-chan lifts her leg, and there was nothing left of the lizard.</p><br/><p>Once monsters die, they return to being pure divine power and don’t even leave a corpse.</p><br/><p>(Good grief, what a rustic woman. Might be fitting for the hero of the muscle-headed Nova-san though.)</p><br/><p>““Waaaa?!””</p><br/><p>The lizard again! A lizard jumped out from the undiluted lifeforce?!</p><br/><p>(I am not a lizard. This Crawling Devil is a newt water element monster. Well, girls like you that are filled with cotton inside their head wouldn’t be able to tell the difference between a newt and a lizard anyways.)</p><br/><p>…What did it just say?</p><br/><p>What’s with this monster? It is as if it can naturally piss off people.</p><br/><p>In the first place, why is it that a monster other than the Demon Lords can speak human words? It is like Phalaris-san.</p><br/><p>(Crawling Devil is a weak small monster, but its manufacturing cost is low, and it is perfect for a temporary body. Even if I get crushed like just now, I can soon come back.)</p><br/><p>Is what the lizard says, or rather, the newt as it inflated and deflated around the chin. Is that the newt breathing or something?</p><br/><p>“Geez, what’s with this?! Let’s ignore this little monster and continue the rescue! Each second is valuable!!” (Celestis)</p><br/><p>(And I said I wouldn’t allow you, right?)</p><br/><p>At the feet of Celestis-chan who was trying to head to the pool of undiluted lifeforce, the newt stood in her way.</p><br/><p>(Celestis-san, since before, I have been tired of you not listening to me, but now I don’t even plan on playing along with you. You are already of no use to me after all.)</p><br/><p>“What are you saying, you mere lizard monster! I don’t know about you!!” (Celestis)</p><br/><p>Uhm…it is a newt.</p><br/><p>(It is a matter of course that you wouldn’t notice. But I know you well. You broke the rules of the Church, and entered a frivolous act like being an idol, lowering the authority of a hero. A dirty girl that was born from the womb of a prostitute planted by the current Water Founder. In reality, you shouldn’t be worthy of shouldering the honour of being the water hero.)</p><br/><p>*Bam!* a feet strongly stepped on it.</p><br/><p>Celestis-chan trampled on the newt monster like Mirack-chan.</p><br/><p>There was darkness I had never seen before in that expression.</p><br/><p>(Fuhahahaha!! Did you get angry at being hit on the nail?! As expected of a brat, your emotional control is lacking!!)</p><br/><p>The newt once again comes out from the pool.</p><br/><p>What’s with this thing?! Unlimited newt works?!</p><br/><p>(Let’s return to the main topic. It is my bad habit to derail. When I find the weakness of someone, I can’t just not praise it, you see.)</p><br/><p>“You…!” (Celestis)</p><br/><p>“Wait, Celestis-chan! Don’t get caught in his provocation!” (Karen)</p><br/><p>If you go along with this lizard, we won’t be able to move forward at all!</p><br/><p>(I said it before but, I can’t let you destroy this Ekhidna Spring. This is an important contract between her and I after all.)</p><br/><p>““?!””</p><br/><p>What does that mean?</p><br/><p>There’s no doubt this Ekhidna Spring that this liza–newt is talking about is referring to the undiluted lifeforce pool.</p><br/><p>I thought it was a matter of course that a monster would be protecting the undiluted lifeforce that the Lord of monsters has created, but the way this lizard acts, makes me feel like it is different.</p><br/><p>This monster is the same as the others, but it has something that’s completely different from them.</p><br/><p>“Celestis! Karen!! What are you two doing?! Is this the time to be distracted by such a small fry?!” (Mirack)</p><br/><p>Mirack-chan reprimands us from the back.</p><br/><p>(Seriously, it is as she says. To deal with me and forget about what you should be doing, a careless act fitting of a hero. Hohoho!)</p><br/><p>The lizard mocks us.</p><br/><p>The pressure that attacks us from our back made Celestis-chan and I turn back our heads.</p><br/><p>There, a crisis was occurring.</p><br/><p>“…Ara ara, so you have stopped those intruding girls. What a good boy, Lizard-san.” (Gabriel)</p><br/><p>Gabriel had broken through the shadow beak of Doraha-san.</p><br/><p>“Kugh!” (Doraha)</p><br/><p>And Doraha-san, having her own attack broken, was hit with the recoil.</p><br/><p>“The cooperation of many, using the power of nature; looks like you were lacking in energy to stop this Demon Lord.” (Gabriel)</p><br/><p>“Not yet! [Flame Knuckle]!” (Mirack)</p><br/><p>In order to stop this degrading situation, Mirack-chan released a Flame Knuckle.</p><br/><p>It wasn’t a regular Flame Knuckle, it is a super high temperature Flame Knuckle powered up by the God Hero form.</p><br/><p>However, Gabriel covered herself with the transparent wings growing from her back, and blocked that fire punch with it.</p><br/><p>A fire attack of a God Hero was completely stopped.</p><br/><p>“D—Damn it!!” (Mirack)</p><br/><p>“Even between the Demon Lords and God Heroes, the elemental affinities apply. Water extinguishing fire still applies between you and me, you know?” (Gabriel)</p><br/><p>The elemental affinities affected the battle!</p><br/><p>“Too bad. If Raphael was the one here, you would have an overwhelming advantage.” (Gabriel)</p><br/><p>(Being in ecstasy to the power of the God Hero, you ended up forgetting the basic principle of elemental affinity. As expected, humans are foolish. Humans holding the power of Gods is a waste of a treasure.)</p><br/><p>At some point in time, the lizard monster had crawled up to the shoulder of Gabriel.</p><br/><p>This may be obvious but, are they actually comrades?</p><br/><p>(That’s why Gods abandon you people and the Gods decide to side with monsters. As the seed that will prosper the most in the surface world. You humans are already not needed. Please disappear obediently.)</p><br/><p>“What are you saying?!” (Celestis)</p><br/><p>Celestis-chan bites at the words of the lizard.</p><br/><p>“You are a mere small monster, and yet, you are talking about the will of the Gods?! How disrespectful! There’s no way you would understand the thoughts of the Gods!!” (Celestis)</p><br/><p>(No, I do.)</p><br/><p>The lizard says.</p><br/><p>(That’s because I am a God after all.)</p><br/><p>“““Hah?”””</p><br/><p>That statement took us three off guard.</p><br/><p>What did that lizard say just now? Did our ears go crazy?</p><br/><p>But that lizard said something hard to accept in a clear voice.</p><br/><p>(I am the Water God, Coacervate.)</p><ul><li>297: The worst disclosure</li></ul><br/><p>The Water God Coacervate; one of the five bigs that created this world and the God that is worshipped by the Water Church.</p><br/><p>It is the highest religious belief of Celestis-chan and the people of the Water nation, and the target to offer prayers.</p><br/><p>That name has come out from such a small monster.</p><br/><p>“…Don’t joke around.” (Celestis)</p><br/><p>And of course, the water hero Celestis-chan’s voice trembled in anger.</p><br/><p>She normally looks frivolous, but Celestis-chan is the water hero, the representative of the Water Church. Her devotion should also be higher than regular.</p><br/><p>“Being an idol, I have heard many a joke from a lot of people, but this is the first time I hear such a bad joke. It was so bad that you would be dragged down in the middle of your performance and be forever forbidden to go air again.” (Celestis)</p><br/><p>(Hohoh~, is that so.)</p><br/><p>“The Water God Coacervate-sama is the holiest of existences for us Water Church! And yet, for you to insult it in this way! You are prepared to be shred to pieces, right?!” (Celestis)</p><br/><p>Celestis-chan was serious.</p><br/><p>She even forgot about the existence of Gabriel that had the lizard on her shoulder and takes a stance with her Miki-Moses.</p><br/><p>“You are a God, you say?! You mere small lizard. If you are going to make stupid lies, make them when you have become a lot more majestic!!” (Celestis)</p><br/><p>(And as I said, I am a newt… But you do have a point there. In order for us Gods to go to the surface world, there’s the need for us to use a temporary body. Just like that Nova-san over there.)</p><br/><p>“WA?!” (Mirack)</p><br/><p>The one who reacted to that was Mirack-chan.</p><br/><p>She followed the gaze of the lizard and turns back to Phalaris-san who was behind us.</p><br/><p>(…!)</p><br/><p>“Then, he really is…?!” (Mirack)</p><br/><p>Mirack-chan seems to have an inkling of what he said.</p><br/><p>(I also wanted to prepare a more fitting body as a God, but lately, I have been involved with many bad people, you see. If I am going to have my body destroyed by them, it would be better to have a body that I wouldn’t mind it being destroyed.)</p><br/><p>“Ara, I think it is a great body. It is small and cute.” (Gabriel)</p><br/><p>Gabriel moves the lizard from her shoulder to her hands and plays around with it.</p><br/><p>It looks like they have a good relationship.</p><br/><p>“No matter what you say, I won’t believe it! There’s no way Coacervate-sama would be such a small lizard!” (Celestis)</p><br/><p>Celestis-chan’s hostility was becoming obstinacy.</p><br/><p>I at first was also adverse to this and couldn’t accept this talk at all, but little by little, I felt something that made me have no choice but to accept it coming from that lizard.</p><br/><p>On top of that, as if reinforcing the statement of that lizard…</p><br/><p>(Coacervate.) (Phalaris)</p><br/><p>Phalaris-san faced the lizard and speaks.</p><br/><p>(What is the meaning of this? Being so blunt about your existence towards the humans, isn’t that an action that breaks the rules of us Gods?) (Phalaris)</p><br/><p>In response to that, the lizard answers with an attitude as if mocking it.</p><br/><p>(Fuhohoho. The rules of Gods huh. You have become quite the good boy after living for a bit with the humans, Nova. If Entropy saw this, he would be moved to tears.)</p><br/><p>(The Dark God has nothing to do with this. Gods revealing themselves to humans should be an inviolable rule, a taboo.) (Phalaris)</p><br/><p>…!</p><br/><p>Entropy, the Dark God?!</p><br/><p>(When Gods reveal themselves to humans, the God and the humans will get too close that humans won’t be able to send prayers anymore. For the side of Entropy that protects the humans, the Gods being close to humans would mean that the humans would lose the strong spirit of trying to overcome problems by themselves. Thus, no matter what position you are in, the conclusion that we should ‘hide our existence’ was reached.) (Phalaris)</p><br/><p>(Yeah, that’s exactly right. But that kind of consideration is already unneeded. That’s because the humans themselves are not needed anymore.)</p><br/><p>The lizard says as if nothing; as if he were throwing a tool that he can’t use anymore.</p><br/><p>(Nova, aren’t you the same? For what reason did you take that monster body?)</p><br/><p>(……)</p><br/><p>Maybe it hit a place where it hurt, the cow-san freezes.</p><br/><p>His body trembles.</p><br/><p>(Because civilization was developing, humans were forgetting their prayers towards Gods, and in order to punish them for that, you became the Fire Cow Phalaris, right? In order to bring divine punishment through the violence that a monster would bring about. Aren’t you one of the Gods that was already tired of the foolishness of humans?)</p><br/><p>(That’s…true but…!!) (Phalaris)</p><br/><p>Phalaris-san was searching for words to refute that, but as if saying he couldn’t, he lowered his head.</p><br/><p>Phalaris-san was actually a monster that lived at the mountain range close to Muspelheim.</p><br/><p>It controlled the place and should have moved in order to attack the monster, and yet, it didn’t; a mysterious monster.</p><br/><p>At a moment in time, it moved straight to the city in order to destroy it.</p><br/><p>If Haine-san hadn’t stopped him, Muspelheim would have been burned down without leaving even ashes.</p><br/><p>What the lizard says fitted these points.</p><br/><p>(And yet, you were defeated and are now basically a pet taken care of by humans. The heroic Fire God Nova has fallen so much.)</p><br/><p>(W-Who is a pet?!) (Phalaris)</p><br/><p>(Not only that, you even changed your own hero into a God Hero and are trying to save them from demise. Since when did the Fire God fall down to being a betrayer of his own beliefs? Being treated as a pet, was even your heart domesticated into a pet?)</p><br/><p>Phalaris-san shouts.</p><br/><p>(Are you insulting this Fire God?! Gods are the summit of this world! They don’t curry the favour of no one, and kneel to no one!! If humans are to pull a slight on me, my anger will become divine punishment, and I will burn those fools down!! …Ah.) (Phalaris)</p><br/><p>As if Phalaris-san were saying ‘oh crap’, he looks at his surroundings.</p><br/><p>There were three heroes here counting me who were dumbstruck by hearing the conversation of Phalaris-san.</p><br/><p>(Now that I think about it, you people can hear my voice now……. No well, you see…!!) (Phalaris)</p><br/><p>(Isn’t it fine? That testimony just now was the reality of the will between us Gods.)</p><br/><p>The lizard laughed with its lizard face.</p><br/><p>(You understand now, heroes? The Gods are already fed up with you humans. Being all high up with the ethereal, you stopped worshipping Gods and abandoned us. And so, the ones that were chosen as the replacement of humans by us Gods are…!)</p><br/><p>The lizard crawls up the thin arm; the thin arm of the summit of Water monsters, Gabriel.</p><br/><p>(The monsters. That’s why I am cooperating with her in destroying the humans.)</p><br/><p>“Oh geez, I have received the seal of approval from a God.” (Gabriel)</p><br/><p>Gabriel once again plays around with the lizard.</p><br/><p>“That’s how it is, humans. You have already been abandoned by your Gods. Now that humanity has no use for the Gods, you have no choice but to disappear as an olden race. I will keep alive the culture you people have build up, so at least disappear uprightly at the end.” (Gabriel)</p><br/><p>Is what the Demon Lord said as she held up a God.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-293-295-affected-by-demise\" id=\"prev_chap\" title=\"Chapter 293-295 - Affected by demise\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-298-299-we-have-been-abandoned\" id=\"next_chap\" title=\"Chapter 298-299 - We have been abandoned\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236366\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}