{"title": "Chapter 304-306 - Fire vs Water", "id": 304, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-304-306-fire-vs-water", "volume_title": "Volume 4", "body": "<h1>Chapter 304-306 - Fire vs Water</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 304-306: Fire vs Water</h4></header></p><div class=\"entry-content\"><ul><li>304: Fire vs Water</li></ul><br/><p>“Kyaaaa!!” (Karen)</p><br/><p>Being hit by super high heat, I fell into hallucinating as if I was thrown into the fire.</p><br/><p>The Fire God Hero Mirack-chan and Fire Demon Lord Michael; divine power output by these two powerhouses.</p><br/><p>I was behind those two, in a safe place where I would definitely not be hit by their attacks, and yet, it felt as if I would be burned with just the heat waves.</p><br/><p>Then, what happened to Coacervate who got hit directly by it?!</p><br/><p>“Hohohoho! Hohohohohoho!!”</p><br/><p>This disgusting laugh, could it be…?!</p><br/><p>Coacervate was completely fine.</p><br/><p>He is releasing a massive amount of water with both hands placed at the front.</p><br/><p>That giant surge of water was extinguishing all the fire that Mirack-chan and Michael released?!</p><br/><p>“This is the reason why! This is the reason why I say that the fire people are all stupid!! There’s no way fire can win against water!!” (Coacervate)</p><br/><p>The Fire God Hero and the Fire Demon Lord, in terms of fire, these two are without doubt the best, and yet, they can’t even injure the Water Demon Lord.</p><br/><p>Are affinities really absolute?!</p><br/><p>“If you want to win against me, you should retreat once, and bring Mother Earth or the Earth Demon Lord! Or maybe Entropy! That’s how resourcefulness works! It is exactly because you ignore that and think something can be done through spirit and courage that you fire elements are all idiots!!” (Coacervate)</p><br/><p>I had no words to return at what Coacervate said.</p><br/><p>“Surrendering immediately just because you can’t match is not hot-blooded at all! Isn’t that right, Mirack?!” (Michael)</p><br/><p>“Exactly! Resourcefulness is the word cowards use to run away! The Fire God Hero and the Fire Demon Lord; with the two summits here, running away would be an insult to the Fire God Nova!!” (Mirack)</p><br/><p>Mirack-chan and Michael don’t pull back……or more like, why are those two so in sync?</p><br/><p>“Aah! You idiots that can’t accept reality! In that case, I will finish you all at once! The Demon Lord will die as a useless tool! And the human heroes will become true trash that can’t even be recycled!!” (Coacervate)</p><br/><p>The amount of water Coacervate released increased even more.</p><br/><p>““Gnnngghh!!””</p><br/><p>Mirack-chan and Michael wrung out their all in releasing fire, and with that, they evaporate the water current that attacked them, and somehow managed to bring it into a back and forth.</p><br/><p>*Psssst!* the steam created from that evaporation had covered the surroundings, and even when it is an open place, it felt as if it were a sauna.</p><br/><p>“Hohohoho! Even if a Demon Lord and God Hero come at me, I am currently the combination of those two, a God Demon Lord!! Even if you come at me together, there’s no chance to win!!” (Coacervate)</p><br/><p>Coacervate had a lot of leisure, as if saying he could break this stalemate anytime he wanted.</p><br/><p>“While at it, let me tell you something nice. I can receive infinite energy from that Ekhidna Spring over there. It is undiluted lifeforce made of several thousands of humans after all.” (Coacervate)</p><br/><p>It is true. I can somewhat tell there’s some sort of energy drifting from that red-purplish pool and heading towards Coacervate!</p><br/><p>“The power of a God Demon Lord and infinite energy, on top of that, the elemental affinity. There’s these many factors in my favor. And yet, you are ignoring all that and fighting me; what other word to describe that but idiotic?” (Coacervate)</p><br/><p>*Fsssst!!* the water steam rises violently. To the point that we couldn’t see their fighting figure from where we were.</p><br/><p>“Damn it! The energy flowing into that Water God, it is the same as the one in the battle at Muspelheim! In other words, the thing that strengthened the cow, the power of human emotions!” (Mirack)</p><br/><p>Mirack-chan also sees that energy.</p><br/><p>But, ah geez! Because the water steam is getting thicker and thicker, I see less and less!</p><br/><p>My vision is all white!</p><br/><p>“Now then, this is the end. Curse your own stupidity as you die!!” (Coacervate)</p><br/><p>“The idiot is you~!!”</p><br/><p>Eh?!</p><br/><p>That voice is Celestis-chan?!</p><br/><p>Where are you? I can’t see at all because of the steam!</p><br/><p>“Here! I am here!” (Celestis)</p><br/><p>When I strain my eyes, Celestis-chan was crouched at the corner of the reserve pond and had both her arms inside the undiluted lifeforce.</p><br/><p>…No, wait a moment…</p><br/><p>Celestis-chan is missing both arms?!</p><br/><p>“You bastard! You changed both your arms into undiluted lifeforce on your own will?!” (Coacervate)</p><br/><p>“I am the water hero, the best divine power user of the Church! Melting my body into liquid seems to be easier than turning it back!” (Celestis)</p><br/><p>But why are you doing that, Celestis-chan?!</p><br/><p>“By mixing a part of my body into the undiluted lifeforce, you plan on linking with the Ekhidna Spring, right?! And with that, interfere with my energy recharge!” (Coacervate)</p><br/><p>Coacervate had seen through the aim of Celestis-chan and was agitated by it.</p><br/><p>I see. At any rate, if we manage to cut off the endless supply of energy, Mirack-chan and Michael will have a better chance.</p><br/><p>“Too bad, you are wrong! It is the contrary!!” (Celestis)</p><br/><p>““Eh?!””</p><br/><p>I ended up raising a voice of surprise together with Coacervate.</p><br/><p>What does that mean, Celestis-chan?!</p><br/><p>“Didn’t I say?! I would love you! That is the same for the tens of thousands living in Hydra Ville! The people that are currently melted into liquid, the pure religious faith they have towards you, their love! I will bring them all out and hit them right at you!!” (Celestis)</p><br/><p>Celestis-chan linked up with the undiluted lifeforce for that sake?!</p><br/><p>Utilizing the energy supply he absorbs in such a way!</p><br/><p>“Now then, I wonder if the filthy you can endure the most beautiful parts of the human heart! Don’t you want to try it too?!” (Celestis)</p><br/><p>“How stupid! No matter what part you kidnap of the human heart, it is all dirty!! What you are trying to do is fruitless effort!” (Coacervate)</p><br/><p>“In that case, let’s put that fruitless effort to practice!!” (Celestis)</p><br/><p>Celestis-chan shouts with spirit as the red-purplish undiluted lifeforce shone brightly.</p><br/><p>The same time as this happened, a massive amount of energy gushed forth.</p><br/><p>All of this pure energy gathered went directly at Coacervate…!</p><br/><p>……</p><br/><p>…or not.</p><br/><p>“Heh?” “Eh?” “Huh?” “Wa?!” “Na?!” “Oh?” (What the?!)</p><br/><p>Everyone raised a dumbstruck voice as they watch over this unexpected situation.</p><br/><p>The beautiful emotion energy, that Celestis-chan released, stopped in mid-air and becomes a sphere of firm shape.</p><br/><p>The strange happenings continued.</p><br/><p>The steam that was created from the clash between Mirack-chan and Michael against Coacervate; this steam was filling up the place, but that steam went towards the sphere and gathers at one point.</p><br/><p>“What?! What is happening?!” (Celestis)</p><br/><p>No one could understand what was happening and can’t explain it.</p><br/><p>In time, the abnormality entered the last stage.</p><br/><p>The gathered steam was absorbed by the sphere of human energy and took form.</p><br/><p>It was like the silhouette of a person.</p><br/><p>The steam shaped like a human was floating in the air?!</p><br/><p>This steam human was formed from the beautiful parts of the human heart as its core…</p><br/><p>“…What? What are you?!” (Celestis)</p><br/><p>The question must have been because it was shaped as a human.</p><br/><p>There’s no way it would respond; that’s what I thought, but the steam human unexpectedly answered.</p><br/><p>(I am…a God.)</p><br/><p>Eh?!</p><br/><p>(I am…the Water God, Coacervate.)</p><ul><li>305: Distillation</li></ul><br/><p>(I am…the Water God, Coacervate.)</p><br/><p>The steam human that called itself that had surprised everyone.</p><br/><p>““““Haaah?!”””””</p><br/><p>The one who got surprised the most was the wicked one.</p><br/><p>“W-What are you saying?! There’s only one of each God of Creation, and within those, the most intelligent one is I, the Water God Coacervate! You that speaks of my name, who are you actually?!” (Coacervate)</p><br/><p>(I am the Water God, Coacervate. And you are also without doubt the Water God Coacervate as well.) (Coacervate)</p><br/><p>“What nonsense are you saying?!” (Coacervate)</p><br/><p>It truly makes no sense.</p><br/><p>There’s two existences that call themselves Water God? In the first place, the fact that Gods are present in front of us is already a hard to swallow thing.</p><br/><p>If there’s two, it must mean that one of them is a fake Coacervate?!</p><br/><p>“In that case, the one that took over the body of that soused mackerel woman should be the fake Coacervate! Damn it, fooling around with us. You lied to us, didn’t you?!” (Celestis)</p><br/><p>(No, my hero Celestis, he is also -without doubt- the true Coacervate.) (Coacervate)</p><br/><p>“Eeeh?” (Celestis)</p><br/><p>The steam human Coacervate says.</p><br/><p>(If we were to differentiate by authenticity, him and I are the real one. In the first place, the existence of Gods are heavily different from that of humans. It is not settled that there’s only one God named Coacervate.) (Coacervate)</p><br/><p>What does that mean?!</p><br/><p>The more I hear, the more confusing it gets!!</p><br/><p>(There are times when the Water God gets divided. Water acts in different ways and changes accordingly. Water that always stays liquid; cool it and it turns into ice; heat it and it becomes steam. There’s no other than water who can be so many things.) (Coacervate)</p><br/><p>(N-Now that he mentions it…!!) (Nova)</p><br/><p>Wa?!</p><br/><p>Nova-sama seems to have reacted to that?!</p><br/><p>(I remember now! Something like this happened before once! Coacervate increasing by two!!) (Nova)</p><br/><p>“R-Really?!” (Karen)</p><br/><p>(…That was not long when the five Grand Churches were made. Stealing each other’s believers, we Gods were fighting fiercely as well. Within all that, Quasar and I were pissed off at how dirty Coacervate’s way of doing things was, so we tagged forces and beat him up) (Nova)</p><br/><p>Eh…</p><br/><p>Gods had such a bad relationship?!</p><br/><p>(Quasar has the ability to strengthen fire. Using this, my fire burst had boiled down that damn Coacervate, but from the water steam that was made, a new Coacervate was born, just like now.) (Nova)</p><br/><p>“No way.” (Karen)</p><br/><p>(The new Coacervate and the originally existing Coacervate fought each other, and in the end, the previous one killed the new one. It was apparently possible because they are of the same cloth though. Moreover, the new Coacervate was such a good guy to the point that you would think ‘are you actually Coacervate?’ and provided things like protection, support, and instructions to his own church!) (Nova)</p><br/><p>Nova-sama ended it with ‘now that I think about it, this served as a big reformation to the Water Church’.</p><br/><p>He is a good guy?</p><br/><p>That Coacervate is?!</p><br/><p>(We Coacervates are the Water God. The symbol of water is purity. All filth is washed by water. But if you change the way of seeing it, it could also be said that all filth gets accumulated in the water. I, who rule over water, am the God that gets affected the most from the filth that’s created by humans and nature.) (Coacervate)</p><br/><p>Is what the steam Coacervate says.</p><br/><p>(That’s why, having accumulated filth, he ended up in that wicked way. That Coacervate over there is the accumulation of more than several hundred years of pollution.) (Coacervate)</p><br/><p>“What are you saying as you wish?! What are you then?!” (Coacervate)</p><br/><p>(There’s two ways to take out the impurities of water. Filtration or distillation. One of those that is distillation; by boiling the water once, it is divided into impurity and steam, and by having the steam return to liquid, it goes back to being pure. This is what happened to me.) (Coacervate)</p><br/><p>“Then, could it be…?!” (Karen)</p><br/><p>I was reminded about the simultaneous attack of Mirack-chan and Michael not that long ago.</p><br/><p>The water attack of Coacervate was evaporated on and on and became steam.</p><br/><p>With the strong fires of these two powerhouses, a massive amount of steam was made, and this wasn’t simple water steam, it was water divine power released from the very Water God. You could even say that it is part of Coacervate’s body.</p><br/><p>That gathered and took form into a new Coacervate —leaving the Coacervate that is purely filth.</p><br/><p>(In a sense, I am the distilled Coacervate. And the one over there is…!) (Coacervate)</p><br/><p>The steam finger points at the possessed Gabriel.</p><br/><p>(Polluted Coacervate.) (Coacervate)</p><br/><p>“Polluted! Polluted, you say?! Are you saying that about me?!” (Coacervate)</p><br/><p>(You must have had a time in the past where you were pure. But after several hundreds of years absorbing filth, that filth reached your heart. It looks like even your memories of the past were contaminated. You even forgot that a new you is born when you are distilled. What a pitiful one.) (Coacervate)</p><br/><p>“W-What are you speaking all high and mighty for?!” (Coacervate)</p><br/><p>(But simply by separating filthy water and steam wouldn’t be enough to make me appear —without the power of human emotions which serves as my foundation, or so to say, prayer energy.) (Coacervate)</p><br/><p>Ignoring the polluted Coacervate, the distilled Coacervate-sama looks at the side. At that place, there’s Celestis-chan.</p><br/><p>(My hero Celestis, it is thanks to you extracting the pure feelings of the people of Hydra Ville and giving it to me. It is because you continued loving me that I was able to exist.) (Coacervate)</p><br/><p>“N-No well…! I didn’t expect even in my dreams that something like this would happen!” (Celestis)</p><br/><p>(I thought that you were a genius of being loved, but that wasn’t the only thing. Even if you were missing that, you are a strong hearted girl.) (Coacervate)</p><br/><p>What to do. The distilled Coacervate-sama is overflowing with divinity.</p><br/><p>If this continues, I might end up joining the Water Church.</p><br/><p>(But hero, this is not the end. In order to save my children, the Water people, and overcome this crisis, we have to defeat the pitiful Demon Lord that has been taken over by the filthy me. Will you please lend me your strength?) (Coacervate)</p><br/><p>“O-Of course! It is the duty of a hero to fight for the sake of the Water God and the Water Church!!” (Celestis)</p><br/><p>Maybe Celestis-chan is feeling something from that steam Coacervate-sama like me, or it might be even stronger than that, she showed eyes of complete trust towards him.</p><br/><p>Celestis-chan restores her arms and takes it out from the undiluted lifeforce.</p><br/><p>(Then, Celestis, you understand what needs to be done in order to do that, right? This is the moment where you have to shoulder my power!) (Coacervate)</p><br/><p>“Eh? Does that mean…!” (Celestis)</p><br/><p>It looks like Celestis-chan couldn’t digest completely what he said, so the distilled Coacervate-sama declares loudly.</p><br/><p>(You are going to become one! The Water God Hero!!) (Coacervate)</p><ul><li>306: A battle of four sides</li></ul><br/><p>At that moment, Celestis-chan changed.</p><br/><p>An incredible amount of water divine power release. Her very body had turned transparent like water, as if she had become a Water Goddess.</p><br/><p>It is not an intense transformation like that of my God Hero mode or the one of Mirack-chan; but the tranquility it lets out is overwhelming!</p><br/><p>“This is…a God Hero!!” (Celestis)</p><br/><p>Celestis-chan had obtained a new power.</p><br/><p>As if confirming her own state, she looked at herself for a while, but…she suddenly disappeared.</p><br/><p>“Guuaaaah?!” (Coacervate)</p><br/><p>Is what I thought when, suddenly, he was blown away?!</p><br/><p>The punch that was nailed at his stomach was without doubt the fist of the Water God Hero, Celestis-chan.</p><br/><p>Celestis-chan had approached Coacervate at a speed that couldn’t be caught with the eyes and had connected an attack?!</p><br/><p>“Incredible! My whole body feels as if it has become running water and I can move like a flow!! Moreover, these overflowing emotions!!” (Celestis)</p><br/><p>You can’t stop flowing water, you can’t catch it either.</p><br/><p>“Looks like the current is now flowing in our favor. The God-sama that is filled with filth, I will have you leave the stage.” (Celestis)</p><br/><p>“How conceited!” (Coacervate)</p><br/><p>“Now that the new Coacervate-sama has come to the stage, I have no obligation to love you. Sorry, but the love of Celestis-chan is expensive. I can’t sell it cheap to two Gods!!” (Celestis)</p><br/><p>Celestis-chan continues her pursue.</p><br/><p>A barrage of punches hit Coacervate without missing a single one.</p><br/><p>The Fire Cow and the steam person watch over this.</p><br/><p>(Oi, are you okay, Coacervate?) (Nova)</p><br/><p>The distilled Coacervate-sama answers this.</p><br/><p>(Yeah, Nova. I knew it beforehand, but the burden the God takes when using God Hero mode is quite big. In this state where my body has just been formed, it is tough…!) (Coacervate)</p><br/><p>The God Hero mode was something that placed a burden to the God?!</p><br/><p>Nova-sama and Coacervate-sama are also fighting with us in order to make Mirack-chan and Celestis-chan into God Heroes!</p><br/><p>(I am grateful for your worry, Nova. Looks like you have changed quite a lot after interacting with humans.) (Coacervate)</p><br/><p>(Y-Yeah…) (Nova)</p><br/><p>Phalaris-san is getting flustered.</p><br/><p>And while that happened, the other side continued.</p><br/><p>“This is a chance!! Let’s beat it down at once!!” (Mirack)</p><br/><p>“If we make the enemy into steam, I have judged that this will make the new Water God stronger! We will burn it down with our firepower!!” (Michael)</p><br/><p>Mirack-chan and Michael attack the polluted Coacervate with an unexpected combination as well.</p><br/><p>“Hiyaaaa!!” (Coacervate)</p><br/><p>The polluted Coacervate falls back out of fear and Michael draws closer.</p><br/><p>“Wicked God, I will have you return Gabriel!!” (Michael)</p><br/><p>“What are you barking about, you mere tool! You bastards are existences solely for the sake of being used by us Gods! No soul! No self-consciousness! Kuhahahaha!!” (Coacervate)</p><br/><p>While fighting Michael through fists and words, polluted Coacervate laughs in a repulsive manner.</p><br/><p>“…That’s right. Even if you liberate this body, I have already crushed the self-conscious of Gabriel to pieces before taking over her body.” (Coacervate)</p><br/><p>“What?!” (Michael)</p><br/><p>“If she were a human, it would be possible to reform it by utilizing the storage of the soul that humans have, but for monsters, that’s impossible. That’s because they are pseudo-lifeforms with no soul after all! The moment she lost her body, this body has died, and has become just a skin of divine power!!” (Coacervate)</p><br/><p>“Don’t mess around!!” (Michael)</p><br/><p>The Phoenix Hammer that was released from both arms of Michael blows away the polluted Coacervate as it boils him.</p><br/><p>But to think that he could fight against the water element he is weak against to this extent; as expected of a Demon Lord, he is powerful.</p><br/><p>(Looks like your power is decreasing! The filthy one!) (Nova)</p><br/><p>(His power has been divided into him and me after all. The control rights of the Ekhidna Spring’s energy has also been completely stolen away from him, so his supply is zero. Right now, his divine power is most likely on the level of a normal Demon Lord.) (Coacervate)</p><br/><p>No wait, a normal Demon Lord is still on a whole different plane of strength though.</p><br/><p>Is this what they call power creep? Is this power creeping?</p><br/><p>“[Pleiades Burst]!!” (Mirack)</p><br/><p>“Gaaah!!” (Coacervate)</p><br/><p>Being burned by Mirack-chan as well, Coacervate lets out steam from his whole body.</p><br/><p>“Further mercilessness!! See and learn; the God Hero mode’s [Water Beheading Blade – Dragon Dance]!!” (Celestis)</p><br/><p>“Aaah!!” (Coacervate)</p><br/><p>Celestis-chan also joins in the follow-up, swiftly dancing into the battlefield and conjuring storm of water blades.</p><br/><p>Coacervate tried to stop this similar to how Gabriel did last time with Sarasa-san, but this time, the water blade storm easily cuts down on Coacervates barrier and assaults him.</p><br/><p>The polluted Coacervate was already crawling.</p><br/><p>“T-This is unfair! Ganging up on me alone with so many numbers!! I won’t play along with you people anymore. When in disadvantage, retreat at once. The speed in decision is a trait of the cunning!” (Coacervate)</p><br/><p>(You plan on running away?!) (Nova)</p><br/><p>Polluted Coacervate shows signs of retreating.</p><br/><p>We all were agitated by this.</p><br/><p>“You think I will let you escape so easily? You still haven’t returned the body of Gabriel!” (Michael)</p><br/><p>“If we were to let a rotten guy like you escape, who knows what kind of evil plan you will cook up later!! I will definitely put an end to this right here!” (Celestis)</p><br/><p>Michael and Celestis-chan were also completely in the mode of the enemy of my enemy is my ally.</p><br/><p>It would be difficult to escape from these two.</p><br/><p>“Ooh, scary scary. In that case, I will be using a card of my own.” (Coacervate)</p><br/><p>The eyes of the lizard that is adhered to the body of Gabriel were shining.</p><br/><p>At the same time as this happened, some sort of metallic sound reverberated?!</p><br/><p>“This sound…”</p><br/><p>“Could it be…?!”</p><br/><p>We direct our gaze faraway. At a part of the reserve pond that is filled with undiluted lifeforce, at that big metallic watergate!</p><br/><p>“The watergate is opening!!” (Karen)</p><br/><p>This is bad! If the watergate opens, the undiluted lifeforce will pour into the ocean!</p><br/><p>If it mixes with the ocean water, we can’t return them to humans!!</p><br/><p>“Hohohoho!! Oh no, this is terrible! What will the hero of humans do?! Don’t mind me and do your honorable job!” (Coacervate)</p><br/><p>“You…! Just how dirty can you get!” (Celestis)</p><br/><p>“I am also pained in losing this Ekhidna Spring I took so much trouble to get, but…well, there’s still a lot of humans. A new Ekhidna Spring can be made! Let’s just consider it fruitful that I have obtained this body!!” (Coacervate)</p><br/><p>The polluted Coacervate was channeling his divine power and preparing his escape.</p><br/><p>No good! At this rate, the polluted Coacervate will escape!</p><br/><p>But if we were to chase after him, the people that have been made into undiluted lifeforce…!</p><br/><p>But that problem was resolved in an unexpected manner.</p><br/><p>“…Karen-sama!!”</p><br/><p>The watergate was opening, and yet…the undiluted lifeforce is not pouring out?</p><br/><p>From the opened space of the gate, a new black wall was stopping the purplish red water.</p><br/><p>A black wall?! A shadow wall!!</p><br/><p>“Doraha-san!!” (Karen)</p><br/><p>Doraha-san, who had been defeated and thrown into the reserve pond, has created a wall of shadow!</p><br/><p>“I will take care of this! Defeat the enemy!!” (Doraha)</p><br/><p>She should be heavily injured, and yet…she is enduring that as she fights her own battle!</p><br/><p>“Damn you!! You ancient resident that doesn’t know when to die!!” (Coacervate)</p><br/><p>“I won’t forgive you! You jellied fish Water God!!” (Celestis)</p><br/><p>Polluted Coacervate had been distracted by Doraha-san for a moment, and in that opening, Celestis-chan had approached him!!</p><br/><p>“[Water Beheading Blade – Dragon Dance]!!” (Celestis)</p><br/><p>With the strongest technique of her senior that she has completely mastered now, she attacks her hated enemy.</p><br/><p>“GAAAHHH!!” (Coacervate)</p><br/><p>Coacervate quickly made a temporary water shield as he immediately retreats. He runs about trying to escape with the body of Gabriel.</p><br/><p>At that escape path, the Demon Lord Michael awaited.</p><br/><p>“Wa?!” (Coacervate)</p><br/><p>Changing directions, there was now Mirack-chan waiting.</p><br/><p>“Hiiih!” (Coacervate)</p><br/><p>Everytime he tried to change directions, no matter where he tried to escape…</p><br/><p>“No! I don’t want a conclusion like this! I won’t lose! The intelligent me, a cunning God like me, there’s no way a pathetic defeat like this could be possible!” (Coacervate)</p><br/><p>At any rate, his strong desire of escaping doesn’t seem like it will be fulfilled.</p><br/><p>That’s why he arrived at this point in the end.</p><br/><p>“I am the Water God, Coacervate!” (Coacervate)</p><br/><p>“No, you have lost that position already.” (Karen)</p><br/><p>“Eh?”</p><br/><p>And he has arrived under me -Kourin Karen.</p><br/><p>It is true that I am the weakest one here, but it is a mistake to think that I will be easily letting you escape!</p><br/><p>“A God that has lost its respect from humans is not a God. You who have denied your connection has lost your right as a God.” (Karen)</p><br/><p>In other words, a kind of demonic spirit.</p><br/><p>“That’s why, I will defeat you. As a hero under a God.” (Karen)</p><br/><p>I can’t just stay a bystander in this battle.</p><br/><p>*Slash*, my holy sword cuts off the lizard that was adhered to the forehead of Gabriel.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-302-303-arrival-of-the-saviour\" id=\"prev_chap\" title=\"Chapter 302-303 - Arrival of the saviour\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-307-308-water-saint\" id=\"next_chap\" title=\"Chapter 307-308 - Water Saint\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236370\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}