{"title": "Chapter 327-328 - Denying a God", "id": 327, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-327-328-denying-a-god", "volume_title": "Volume 4", "body": "<h1>Chapter 327-328 - Denying a God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 327-328: Denying a God</h4></header></p><div class=\"entry-content\"><ul><li>327: Denying a God</li></ul><br/><p>“God! God of the earth!!”</p><br/><p>A different voice enters the discussion of the God and heroes.</p><br/><p>The serious voice of the Demon Lord Michael that sounded as if he was shouldering the world.</p><br/><p>“Are you saying the Gods don’t forgive the existence of Demon Lords? Are you saying monsters are living beings that shouldn’t hold hearts?” (Michael)</p><br/><p>“No. Monsters are not even living beings. They are tools.” (Mantle)</p><br/><p>The so clear response of Mantle made Michael gulp his breath audibly.</p><br/><p>“Tools created by the Gods for the sake of the Gods. The Gods that were flustered by how the humans stopped praying after civilization developed created monsters so that they would pray again. If monsters threaten the humans, they would look for help by praying.” (Mantle)</p><br/><p>“Oi, wasn’t an unbelievable reality revealed just now?” (Mirack)</p><br/><p>“Meaning that they were pumps the Gods set up? The Gods are unexpectedly sly.” (Celestis)</p><br/><p>The humans were showing agitation at one of the world’s secrets that was revealed by Mantle as if it were a passing thought.</p><br/><p>“You are the tools used in order for humans to pray, so there’s no need for tools to have hearts. That’s why we created monsters out of pure divine power and didn’t place a soul in them. It isn’t possible for things like that to have a heart.” (Mantle)</p><br/><p>“…Kugh!” (Michael)</p><br/><p>Michael silently tightened his fists.</p><br/><p>“You monsters have deviated from the duty that us Gods have set for you. That’s why you must be destroyed. Monsters were created for the sake of humans, and yet, if those monsters were to destroy those humans, it would go against their purpose.” (Mantle)</p><br/><p>Everything about Mantle is simple and straight, and that made it hard to refute.</p><br/><p>And yet, this feeling of wanting to refute it with all they had…everyone in this place felt that way.</p><br/><p>An argument that has no place where to hit -this might be what you would call the weight of a God’s words.</p><br/><p>“I also ask! Earth God!” (Uriel)</p><br/><p>Uriel speaks now.</p><br/><p>He was utterly in fear due to the blade hell of Sasae-chan but, right now, his body was overflowing with strength.</p><br/><p>His cut off leg had already been regenerated, even if it was a hasty job.</p><br/><p>“I…was born from the earth mother that you had created.” (Uriel)</p><br/><p>Earth Mother Monster, Grandma Wood.</p><br/><p>“Those memories may be hazy, but I have inherited them. You say that monsters were originally made to do evil to the humans that had forgotten their prayers, but I think that only us earth monsters are different.” (Uriel)</p><br/><p>It is exactly right.</p><br/><p>The only type of monster that Grandma Wood gave birth to were Golems. Different from the other monsters, they obeyed the orders of humans and lived together with humans.</p><br/><p>That’s why the people of Ishtar Blaze that worship Mantle had grown fond of the Golems and respected Grandma Wood as they called it ‘Great Pillar-sama’.</p><br/><p>Until the great fall that Mantle created, that is.</p><br/><p>“I was against the other Gods. Even if humans didn’t pray to me, I wanted to be of use to them. That’s why I created monsters that would help humans rather than ones that attacked them.” (Mantle)</p><br/><p>“The birth of Golems had that kind of reason behind it…” (Karen)</p><br/><p>“But Earth Demon Lord-san, I didn’t think that an existence like you would be born under this feeling of ‘wanting to help humans’ that I placed when creating Golems. Same as the other Demon Lord-sans, to try and destroy the human-sans… It is completely contrary to the wishes of your creator. Truly bad kids.” (Mantle)</p><br/><p>Mantle announces.</p><br/><p>“I will be destroying you for the sake of the human-sans.” (Mantle)</p><br/><p>“Don’t joke around!” (Uriel)</p><br/><p>Uriel’s voice was filled with anger.</p><br/><p>What was overflowing from his body was resentment.</p><br/><p>“We were born for the sake of humans…for the sake of Gods? Where is our own reason for living?! Are you saying that it is wrong to live for our own sake?!” (Uriel)</p><br/><p>“It is exactly as Uriel-san says!” (Karen)</p><br/><p>Karen-san agrees to the words of the demon.</p><br/><p>“No matter the living being, even if it doesn’t have a soul, it should still have the right to live for their own sake! No one can deny that!!” (Karen)</p><br/><p>“No matter if you are a God, there’s no way it is okay for you to arbitrarily decide the fate of the ones living on the surface world! Humans might end up getting that treatment as well, so I can’t say that this is someone else’s problem!” (Celestis)</p><br/><p>“As I thought, we will be completely in opposition to this! Also, return Sasae’s body! Her body is not something that a God can do whatever they want with it!” (Mirack)</p><br/><p>The human team was obviously against the words of Mantle.</p><br/><p>“It goes without saying that we will also be fighting.” (Michael)</p><br/><p>“The Water God has already given us his blessing, so I will be going against it with confidence.” (Gabriel)</p><br/><p>Michael and Gabriel were obviously in fighting stance.</p><br/><p>There was not a single one in favor of Mantle.</p><br/><p>“Eh? Eh? Uhm…uhm…!” (Mantle)</p><br/><p>Seeing this situation, the usual habit of hers appears.</p><br/><p>“But…I am doing this for the sake of the human-sans. I was thinking of being useful to the human-sans!” (Mantle)</p><br/><p>“And we are saying that’s unneeded consideration! We humans don’t need your help!!” (Celestis)</p><br/><p>Celestis gave the final blow with her sharp tongue.</p><br/><p>“Mantle.” (Haine)</p><br/><p>I couldn’t just stay silent either.</p><br/><p>Bringing her back might have really been a mistake.</p><br/><p>Her way too simplistic way of acting, no matter how much you think for the sake of humans, it doesn’t end up being good for the humans.</p><br/><p>Before an irreversible catastrophe occurs, I might have to erase her once again into the deep depths of the Black Hole.</p><br/><p>“In the end, it looks like no matter what we say, we won’t reach an understanding.” (Haine)</p><br/><p>Even the Dark God Entropy, that is considered as the ultimate God, can’t change her.</p><br/><p>To try and connect this Mother Earth God to the other existences.</p><br/><p>“That’s not true-dasu!!”</p><br/><p>“““““““”?!!!!!””””””</p><br/><p>Eh?!</p><br/><p>That voice just now…?!</p><br/><p>The voice that only had the words of Mantle coming out…this time around, the words of someone else came out.</p><br/><p>The real owner of that voice.</p><br/><p>“This Earth Hero, Gonbee Sasae! If it be the words of the Mother Earth, Mantle-sama, I be following ‘em no matter what they be-dasu! That be the way of the Earth nation-dasu!!” (Sasae)</p><ul><li>328: Foolish God</li></ul><br/><p>“Sasae-chan?!” “Sasae?!” “Sasae-chi?!”</p><br/><p>The ones who were agitated by the sudden mention of this name were her very friends, Karen-san, Mirack, and Celestis.</p><br/><p>“As I thought, is that really Sasae-chan?! It is hard to believe but, is it really Sasae-chan?!” (Karen)</p><br/><p>“Yes, I am-dasu! The incompetent, Gonbee Sasae! Even if mah boobs got bigger, I still be everyone’s friend-dasu!!” (Sasae)</p><br/><p>Sasae-chan says with strength.</p><br/><p>It looks like her body wasn’t taken over even when Mantle was residing in it.</p><br/><p>“More importantly, what be this-dasu ka?! Everyone ganging up on us. Don’t go bullying our God Mantle-sama-dasu! I be stepping in and say no-dasu!!” (Sasae)</p><br/><p>Is what Sasae-chan says with a bad temper.</p><br/><p>What is the meaning of this?!</p><br/><p>“Uhm…but you see, Sasae-chan, we can’t agree to what Mantle-sama said. Monsters are already not the same as before—!” (Karen)</p><br/><p>“I don’t care about that-dasu!!” (Sasae)</p><br/><p>“““Eeeeh?!”””</p><br/><p>Her statements were completely absurd and, everytime she enforces her words, her boobs shake, which overwhelmed the three young ladies.</p><br/><p>It also overwhelmed me.</p><br/><p>“The important thing be whether I believe in mah God or not-dasu! In the face of the words of mah God, everything else be a trifling matter-dasu!!” (Sasae)</p><br/><p>“Eeh?! I don’t think it is such a trifling matter though!” (Karen)</p><br/><p>“Karen-neechan, Mirack-neechan, and Celestis-neechan; each one of ya have yer own God ye believe in-dasu. And fer me, that be Mantle-sama-dasu. It be because we believe in our God that those words be priceless, ain’t it-dasu ka?!” (Sasae)</p><br/><p>“B-But…” (Karen)</p><br/><p>“That be why, if it be the words of Mantle-sama, I will follow ‘em-dasu! No need for context-dasu! I will cut the Demon Lord-sans, stick ‘em up, and cut ‘em up again-dasu!!” (Sasae)</p><br/><p>“Torture?!” (Haine)</p><br/><p>To think Sasae-chan would agree with Mantle!</p><br/><p>“Doesn’t this feel like deja vu?” (Celestis)</p><br/><p>“You think so too, Celestis? Actually, I also do!” (Mirack)</p><br/><p>Is what Mirack and Celestis say.</p><br/><p>“The first time we met Sasae-chan, she had received an oracle from the Mother Earth God, and when we showed opposition to those words, Sasae-chan got angry and it even ended up in a fight!” (Karen)</p><br/><p>“And now, Mantle is speaking personally and, when we went against it, Sasae-chi got angry!” (Celestis)</p><br/><p>“It will definitely fall into the same pattern!” (Mirack)</p><br/><p>For the five Grand Churches, the Gods they worship are absolute existences.</p><br/><p>Denying them can even end up in killing.</p><br/><p>Sasae-chan is faithfully applying this, and she is about to apply it now.</p><br/><p>“Mantle-sama created the earth we stand, sit, and sleep in, and she also nurtures the food that we eat everyday-dasu! She even sent Golems that were the friends of humans. Not believing in the Mother Earth God-sama after all this would be ungrateful-dasu!!” (Sasae)</p><br/><p>“Sasae-chan!!” (Karen)</p><br/><p>“The people of the Earth nation believe in Mother Earth-sama in anything and everything-dasu! Someone that doesn’t believe ain’t religious-dasu! Oi, the Demon Lord there!” (Sasae)</p><br/><p>“Yes?!” (Uriel)</p><br/><p>Being pointed the scythe at him, Uriel was greatly scared.</p><br/><p>“What ya gonna do-dasu? By the will of Mantle-sama, I will be destroying ya-dasu. If ye don’t want that, ya better fight back-dasu!” (Sasae)</p><br/><p>“Eh?”</p><br/><p>“In mah Ishtar Blaze, when we don’t know whose side be the correct one, there be only one thing the Earth people do-dasu! Kill each other-dasu! The one that dies be the one in the wrong-dasu! Got that-dasu ka?!” (Sasae)</p><br/><p>“Eeeeeeh?!”</p><br/><p>It was quite the messed up statement.</p><br/><p>But…</p><br/><p>“Oh my! Oh my! My hero-san will believe in me?!” (Mantle)</p><br/><p>“Obviously course-dasu! Someone that doesn’t believe saying they be followers would be the lie-dasu!!” (Sasae)</p><br/><p>“This is…the first time I have been told that… I am so happy!” (Mantle)</p><br/><p>Before coming here, the grandma of Sasae-chan told me this: ‘Sasae-chan resembles herself’.</p><br/><p>When she was young, she looked absent-minded and as if she lacked the ability to think, but that’s exactly why she was able to push through with a clear mind and head straight towards what she believed in.</p><br/><p>What was born from this was the legend that would make even crying children silent, the ‘Taker by the roots’.</p><br/><p>Sasae-chan had inherited that trait almost completely and possesses the ability to believe in something blindly like her grandma.</p><br/><p>A domain that half-baked sagaciousness wouldn’t be able to reach; a foolishness that knows no bounds.</p><br/><p>“…Let’s try leaving it in Sasae-chan’s hands.” (Haine)</p><br/><p>“Haine-san?!” (Karen)</p><br/><p>My decision created confusion in my surroundings, but I felt like betting on it.</p><br/><p>At times, the foolishness of Sasae-chan would be the source of trouble and would irritate the short-fused ones. But that foolishness also, at times, can change the impossible to possible.</p><br/><p>It is not some plain foolishness, it is an extra-large foolishness inherited from the blood of a legend.</p><br/><p>It might be able to achieve big things that the regular intelligent ones wouldn’t be able to achieve!</p><br/><p>Achieve things that even I, the Dark God Entropy, gave up on…</p><br/><p>“The way too simplistic heart of Mantle; trying to connect it to others is impossible, but she might be able to make that impossible into reality.” (Haine)</p><br/><p>In this battle with the Demon Lords, the humans have even managed to change the hearts of the Demon Lords.</p><br/><p>In that case, she should be able to change the heart of a God too —with that trusting heart of hers that’s on the level of being foolish.</p><br/><p>“Stand up and accept the challenge, Uriel.” (Michael)</p><br/><p>“Eh?!” (Uriel)</p><br/><p>“You will fight alone.” (Michael)</p><br/><p>Michael spoke to him from the back and the tree human Demon Lord trembled heavily at those words.</p><br/><p>“It looks like each of us Demon Lords have to be tested -in what we are and what we should do. We have to fight our own battles and reach those answers.” (Michael)</p><br/><p>“No, what are you saying, Michael?” (Uriel)</p><br/><p>“In this stage where the earth hero and Earth God are standing, Uriel, this is no doubt your stage as well. Gabriel and I have done our fight too and we got a vague view of the path we should advance on. Uriel, you must take that step as well!” (Michael)</p><br/><p>The Fire Demon Lord says this with burning passion.</p><br/><p>“Even if you currently don’t have a decision, one should appear after battle! Clash to your heart’s content! Clash, break, mix those broken pieces, to the point that you can’t even tell what was its previous form, and find an answer that you haven’t found until now!! …In other words, let there be hot-bloodedness!!” (Michael)</p><br/><p>Ah.</p><br/><p>Now that those words have come out, he has no choice but to accept.</p><br/><p>“Ah geez! I get it!!” (Uriel)</p><br/><p>Uriel shouts annoyed.</p><br/><p>“That was my intention in the first place anyways!! Earth hero, if I fight you and win, that means I should be the one to keep on living! I will bring judgement. Monsters are the ones who should keep on living in this surface world!” (Uriel)</p><br/><p>“That’s the spirit-dasu! Makes it worth cutting-dasu yo!!” (Sasae)</p><br/><p>Sasae-chan was her charming self as always as she takes a stance with her all-cutting scythe.</p><br/><p>“Well then, let’s begin-dasu! A battle where I will believe thoroughly in Mantle-sama and will decide the way of living of the Demon Lord-sans-dasu!! No grudges no matter who dies-dasu yo!!” (Sasae)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-325-326-progress\" id=\"prev_chap\" title=\"Chapter 325-326 - Progress\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-329-331-like-a-maelstrom\" id=\"next_chap\" title=\"Chapter 329-331 - Like a maelstrom\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236379\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}