{"title": "Chapter 378-379 - Wicked Snake Fiend", "id": 378, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-378-379-wicked-snake-fiend", "volume_title": "Volume 4", "body": "<h1>Chapter 378-379 - Wicked Snake Fiend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 378-379: Wicked Snake Fiend</h4></header></p><div class=\"entry-content\"><br/><p>Sponsored Chapters</p><hr/><br/><p>And so, in this way, the exchange between Demon Lords and humans deepened gradually to the point that made me question ‘what the hell is this?’, and finally, we faced a big change.</p><br/><p>There were few things we could do to approach the matter.</p><br/><p>The most direct way to solve the problem would be to find Ates and capture her, but we don’t know where she is at all.</p><br/><p>We could make her a world wanted person, but if we are going against a God incarnation, it definitely won’t be easy to find her location.</p><br/><p>It was the same when the Demon Lords hid to avoid me after all.</p><br/><p>What we can do would be to harden our defenses with our respective heroes, and make it so we are not hit in any opening.</p><br/><p>*****</p><br/><p>“Hero-sama!! Assistant!!”</p><br/><p>We were thinking about passing the day hanging out with the Demon Lords, but a Light Knight came flying to report to us.</p><br/><p>“Emergency call!”</p><br/><p>Emergency call?</p><br/><p>In this era, we can exchange information with other nations in an instant thanks to the ethereal wireless technology.</p><br/><p>Even if one of our places gets attacked, we can immediately fly to their aid, and we will be able to provide fast assistance with the use of the flying machines.</p><br/><p>“Emergency call from Rudras Metropolis!”</p><br/><p>“Rudras Metropolis… That’s pretty close.” (Haine)</p><br/><p>The moving city of Rudras Metropolis is currently at standby in a place close by to Apollon City in case of any unexpected events.</p><br/><p>Karen-san and I ran to the communication room and faced the mic.</p><br/><p>“This is Kuromiya Haine speaking! Wind Church member, can you hear me?!” (Haine)</p><br/><p>{Haine… Is that Haine?!}</p><br/><p>This voice.</p><br/><p>Isn’t it Shiva?!</p><br/><p>For the Founder himself to make a call, moreover, from how he is speaking, I can tell he is in pain.</p><br/><p>“What’s the matter?! What happened?! Explain the situation!” (Haine)</p><br/><p>{That monster…! We weren’t even in its sight…..! It treated us as pebbles at the roadside…! A whole city…!}</p><br/><p>The speaker was relaying the voice of Shiva that was faraway, and it was reproducing the pained voice of his.</p><br/><p>“Oi! Oi! Is Rudras Metropolis okay?! What about the damage?!” (Haine)</p><br/><p>{Don’t worry. There’s not much damage on our side….. It didn’t give us any attention, so the damage was kept at a minimum….. How laughable.} (Shiva)</p><br/><p>His voice was filled with regret and self-derision.</p><br/><p>{It was so sudden that we didn’t have the time to bring out the hero or the Kazama Shinobis. That guy only shot one divine power attack. However, that one attack blew away Rudras Metropolis and made it bounce three times.} (Shiva)</p><br/><p>Bounce?!</p><br/><p>The whole Rudras Metropolis?!</p><br/><p>It may be the smallest out of the five Great Cities, but the city is basically a moving fortress, and yet, with one attack?!</p><br/><p>{The reason we didn’t flip upside down was thanks to the balancer that Juo invented. But because of that, Rudras Metropolis’ moving engine has completely stopped. Many buildings inside have been destroyed. We can’t head out to provide assistance. We have our hands full in the rescuing inside the city.} (Shiva)</p><br/><p>What?</p><br/><p>“What are you talking about? We are the ones who should be going to help. We will send Aurora Knight corps with relief goods, so—!!” (Haine)</p><br/><p>{DON’T!!} (Shiva)</p><br/><p>“?!”</p><br/><p>The agitated shout of Shiva made me gulp my breath.</p><br/><p>To think Shiva would lose his wits to this extent.</p><br/><p>{There’s no need to send help to us! You guys should strengthen the defenses of the city! That’s why we called you!!} (Shiva)</p><br/><p>“?!”</p><br/><p>{That thing’s objective is you guys! The place where you guys are, Apollon City!! Our Rudras Metropolis was only coincidentally in the way, so it pushed us to the side!!} (Shiva)</p><br/><p>Just what in the world…!</p><br/><p>{I will be the one sending reinforcements! When the situation has stabilized, I will immediately send Hyue as well! That’s why, resist until then, please!! Listen well, survive!!} (Shiva)</p><br/><p>*****</p><br/><p>With the call of Shiva that left no opening to speak back ending, I immediately left from the Light Grand Church. And then, I look at the direction where Rudras Metropolis is.</p><br/><p>“What is happening, Haine-san?” (Karen)</p><br/><p>Karen-san seemed to be uneasy as well.</p><br/><p>I don’t know either. I don’t know, but I can clearly tell it is something incredibly bad.</p><br/><p>“…? A mountain range…?” (Haine)</p><br/><p>Was there a mountain range at that direction.</p><br/><p>No, there’s no way.</p><br/><p>The moving city of Rudras Metropolis cannot traverse properly through mountainous terrain, so it would always choose flat ground.</p><br/><p>That’s why, there’s no way there would be a mountain range at the direction of Rudras Metropolis!</p><br/><p>“?!”</p><br/><p>Another mystery occurs.</p><br/><p>That mountain range began to swerve.</p><br/><p>“The mountain is…moving?!” (Haine)</p><br/><p>“That’s not it, Haine-san! That’s not a mountain!!” (Karen)</p><br/><p>The other members of the Light Church began to come out after hearing the uproar and were equally flustered.</p><br/><p>“It is not a mountain, but a snake! An incredibly big snake is slithering!!” (Karen)</p><br/><p>It is exactly as Karen-san says.</p><br/><p>A giant snake that can be mistaken for a mountain was slithering towards us!</p><br/><p>“That’s…what blew away Rudras Metropolis?!” (Haine)</p><br/><p>Where is the head and tail end of that snake?</p><br/><p>The body of the snake is so big that it was impossible to find it.</p><br/><p>—No, I found it.</p><br/><p>The giant upper body of the beast that was slithering its way towards us.</p><br/><p>“The head of the snake…is actually a human body?!” (Haine)</p><br/><p>Upper body is human, lower half is snake; moreover, its whole body is as big as a mountain.</p><br/><p>Could it be, this is…the strongest and last Demon Lord?</p><br/><p>The Demon Lord that reigns over light, the Great Demon Lord Lucifer?!</p><ul><li>379: Leader Inauguration</li></ul><br/><p>This is…the Great Demon Lord Lucifer?</p><br/><p>A giant beast that one could mistake for a mountain, and instead of a snake head, it has a human upper half.</p><br/><p>Truly strange-looking.</p><br/><p>To the point that would make me have goosebumps.</p><br/><p>Its rough reptilian skin brought about a feeling of disgust in a physiological level.</p><br/><p>I don’t know the reason, but it is probably an instinctive ability that snakes scatter through species that are several times smaller than it.</p><br/><p>Moreover, a part of it looks exactly like a human.</p><br/><p>That upper half of a robust man combined what a human is used to seeing with that of a beast, making the picture even more grotesque.</p><br/><p>“Akakakakakakakakaka!!”</p><br/><p>The roar that pierced the air and cut apart the eardrums further increased the disgustingness.</p><br/><p>It is a mass of repulsiveness.</p><br/><p>That’s the last threat of the Demon Lord battle.</p><br/><p>Lucifer.</p><br/><p>“What in the world is going on?!”</p><br/><p>People came out one after the other from the Light Grand Church where one can see the abnormality that is the new Demon Lord.</p><br/><p>And within that group, there’s Michael, Gabriel, and Uriel.</p><br/><p>They were holding a philosophy book, idol poster, and an alcohol bottle respectively. I could tell that they were fully enjoying the human culture in Apollon City.</p><br/><p>“Hiiih?! What’s with that disgusting thing?!” (Gabriel)</p><br/><p>Even Gabriel had gotten scared by Lucifer’s atypical appearance.</p><br/><p>“Could it be that’s…!” (Uriel)</p><br/><p>“Great Demon Lord, Lucifer…sama?” (Michael)</p><br/><p>Uriel and Michael were dumbstruck by what seems to be the first time they see their ruler Great Demon Lord.</p><br/><p>“This is the first time I see him in action! Is that really Lucifer-sama?! I only saw his cocoon so…” (Uriel)</p><br/><p>“I couldn’t see him directly when he was sleeping in the castle, but to think he would be this big! Isn’t he a lot bigger than the castle that served as his cocoon?!” (Gabriel)</p><br/><p>“No, that’s not it! That castle itself was Lucifer-sama! So we were using the inside of Lucifer-sama as our base?!” (Michael)</p><br/><p>Voices of agitation were leaking out from the Demon Lords.</p><br/><p>And within them, there was one who had his fists tightly gripped and trembling.</p><br/><p>No, his whole body was trembling. The one who was trembling as if trying to hold back his raging stream of emotions was Michael.</p><br/><p>“…What ‘Great Demon Lord’…!!” (Michael)</p><br/><p>Wa?</p><br/><p>“That thing is not a Demon Lord. It is just a giant monster. It is true that it is gigantic, but I can’t feel intelligence or a soul! It is just a giant monster that brings about destruction by the orders of its God!” (Michael)</p><br/><p>“N-Now that you mention it…!” (Uriel)</p><br/><p>Monsters repeated a cycle of life and death for a century long, and at the end of that accumulated experience, is what brought about the Demon Lords who have a will and soul.</p><br/><p>They are truly worthy of being the rulers of monsters. In order to get the best out of the intelligence they have gotten, a trait of them is that they possess a physique similar to that of humans.</p><br/><p>But the Great Demon Lord that’s supposed to stand at the summit of Demon Lords doesn’t fit any of those traits.</p><br/><p>A size that far surpasses that of humans, an abnormal lower half that can take up the whole vision of someone, and that way of acting, that roar didn’t have a single shred of intelligence from it. It is basically a beast.</p><br/><p>It is just like the Hydra Serpent we fought before; a puppet with no will controlled by a God.</p><br/><p>“We were worshipping that thing as our summit?! We called that the Lord of Monsters?! Don’t joke around!!” (Michael)</p><br/><p>The roar of Michael echoed powerfully within the whole structure of this Light Grand Church.</p><br/><p>“This made it clear! As I thought, that woman…Sunnysol Ates, she was deceiving us Demon Lords!! Lucifer already isn’t worth respect!!” (Michael)</p><br/><p>And then, as if showing the anger in his heart, the Fire Demon Lord spreads out his fire wings.</p><br/><p>“From now on, I -Michael- will take command of us Demon Lords. Gabriel, Uriel! Entrust your lives to me!!” (Michael)</p><br/><p>Michael shouts loudly.</p><br/><p>“I maintained equality because we were under Lucifer, and because I neglected giving order to the Demon Lords, we lost Raphael! I won’t let the same mistake happen! From today on, I -Michael- will lead you guys as the leader of the Demon Lords!!” (Michael)</p><br/><p>“Good grief, finally the leader is going to act as the leader huh.” (Uriel)</p><br/><p>“I don’t really mind. There’s no other than Michael who would take a troublesome role like that anyways.” (Gabriel)</p><br/><p>Uriel and Gabriel accepted the resolve of their comrade lightheartedly.</p><br/><p>“……Kuromiya Haine.” (Michael)</p><br/><p>“Ah, yes?!” (Haine)</p><br/><p>I was surprised by the sudden mention of my name.</p><br/><p>“Leave the job of dealing with that Lucifer to us Demon Lords.” (Michael)</p><br/><p>“Eh?!” (Haine)</p><br/><p>“The trouble that us monsters have created, will be put to an end by us monsters. That is the true order of this world.” (Michael)</p><br/><p>“”We gotta pay you guys back for putting up with us after all.” (Uriel)</p><br/><p>“You guys help out that Wind capital that seems to have received damage. I want to learn the culture of that nation one of these days.” (Gabriel)</p><br/><p>And then, the three Demon Lords spread out their symbolic divine power wings and fly into the sky.</p><br/><p>“Wa?! Wait! Do you mean that…!” (Haine)</p><br/><p>Karen-san and I had no choice but to absentmindedly see off the Demon Lords that were leaving.</p><br/><p>Could it be that what is about to begin now is…a direct battle between the three Demon Lords led by Michael against Lucifer?!</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-376-377-whereabouts-of-goddess\" id=\"prev_chap\" title=\"Chapter 376-377 - Whereabouts of Goddess\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-380-381-demon-lords-frontline\" id=\"next_chap\" title=\"Chapter 380-381 - Demon Lords frontline\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236398\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}