{"title": "Chapter 380-381 - Demon Lords frontline", "id": 380, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-380-381-demon-lords-frontline", "volume_title": "Volume 4", "body": "<h1>Chapter 380-381 - Demon Lords frontline</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 380-381: Demon Lords frontline</h4></header></p><div class=\"entry-content\"><br/><p>But we can’t just let them go like this on their own. That’s what I thought for some reason.</p><br/><p>And whether I want it or not, I have already moved to action.</p><br/><p>“Hyaa!” (Haine)</p><br/><p>I make a big jump.</p><br/><p>I somehow managed to jump onto the Demon Lords that were still not that far from the ground yet.</p><br/><p>“Kyaaaaa?!”</p><br/><p>But…it looks like I coincidentally jumped onto the only female Demon Lord, Gabriel.</p><br/><p>…It really was a coincidence, okay?</p><br/><p>I jumped on the spur of the moment and ended up latching on her, but from an outsider’s perspective, I am without doubt a degenerate?!</p><br/><p>“Kyaa! What’s with this guy?! Hugging a lady out of nowhere without permission! That’s not culture!” (Gabriel)</p><br/><p>Give me a break!</p><br/><p>You have been getting completely dyed in the color of Celestis lately! At first, the only difference you had from the other Demon Lords was your appearance, but now, your personality has been completely changed!</p><br/><p>“Haine-san?! What are you doing?!” (Karen)</p><br/><p>Karen-san calls me in a reproachful and agitated tone from the ground.</p><br/><p>I am grabbing onto a Demon Lord that is thinking of heading to where Lucifer is, so Karen-san is steadily getting further and further away.</p><br/><p>“Sorry, Karen-san! I will be accompanying the Demon Lords!!” (Haine)</p><br/><p>““““?!””””</p><br/><p>This declaration surprised not only Karen-san but the Demon Lords as well.</p><br/><p>What is the meaning of this, Kuromiya Haine? I told you that the problem of monsters must be put to an end by us monsters.” (Michael)</p><br/><p>Michael also comes out with a reproachful tone.</p><br/><p>“There’s the need for a witness to the battle between Demon Lords, right? I will take that role. Bring me along!” (Haine)</p><br/><p>“…..”</p><br/><p>The real reason might be something else though.</p><br/><p>I heard about the real identity of Sunnysol Ates, and now that I know about it, I have to meet her again once more no matter what. That’s how I felt.</p><br/><p>“…Fine. Even so, there’s no need for you to get involved.” (Michael)</p><br/><p>“Thanks. I will by no means throw cold water at the resolve of you Demon Lords.” (Haine)</p><br/><p>And in this way, I ended up being a spectator to the battle of Demon Lords.</p><br/><p>“H-Haine-saaaan?!” (Karen)</p><br/><p>And Karen-san had no choice but to see us off in a flustered manner.</p><br/><p>I raise my voice towards the girl down.</p><br/><p>“Karen-san! Please command the Aurora Knights and harden the defenses of the city!! And also make sure to refuse the aid of Rudras Metropolis!!” (Haine)</p><br/><p>Leaving those words behind, I left towards the sky with the Demon Lords.</p><br/><p>By the way, it was only after a while later that I remembered I could fly with my dark matter.</p><br/><p>The heat of the moment is a truly fearsome thing.</p><br/><p>****</p><br/><p>And then…</p><br/><p>We finally made it.</p><br/><p>To where the monster that makes the earth tremble is; the Great Demon Lord Lucifer.</p><br/><p>“This is…!” (Haine)</p><br/><p>What Michael, Gabriel, Uriel, and I were witnessing down from the sky was truly like a picture of hell.</p><br/><p>There’s a fiend covering the ground.</p><br/><p>The long long snake tail of Lucifer was wriggling, slithering, and coiling around as it covered the whole ground.</p><br/><p>It is not only long but also gigantic, so the trees and small hills were mowed down and there was boundless destruction and cruelty spread around.</p><br/><p>And then, there’s also the snake’s scales that can be seen everywhere.</p><br/><p>“This truly…looks like hell…” (Gabriel)</p><br/><p>Even Gabriel faltered at the tragedy below.</p><br/><p>“What are you guys gonna do? This thing covers the whole vision, so even with eyes closed, you could hit the target.” (Haine)</p><br/><p>I gave out my opinion as a spectator.</p><br/><p>“Silence, you degenerate.” (Gabriel)</p><br/><p>“No mercy?!” (Haine)</p><br/><p>Gabriel is completely on guard of me now.</p><br/><p>I have already left her side and used my own dark matter to float.</p><br/><p>“Let’s search for what’s…supposed to be its head. We saw it from afar after all.” (Michael)</p><br/><p>That upper half that looks like a human huh.</p><br/><p>“Even if we were to blindly attack a big body like this, we wouldn’t get much results. More so when the size made us believe it was a mountain range and can cover the whole ground. If we were to shoot divine power without any thoughts, even us Demon Lords might run out of energy before we can deal a fatal wound.” (Michael)</p><br/><p>An accurate decision from the now official leader Michael.</p><br/><p>“When talking about a weak point of living beings, it would be the head. Fine then. Let’s find the tip of that guy.” (Uriel)</p><br/><p>“But shouldn’t we attack with a plan in mind first? It is this long after all. Even if we were to randomly trace it, we might even take several years if we don’t do it well enough.” (Gabriel)</p><br/><p>Gabriel does have a point. This fiend is long to an unbelievable extent, moreover, its slithery body is akin to a labyrinth. Tracing it and finding the head would be one hell of a job.</p><br/><p>But…</p><br/><p>“Welcome, useless trash.”</p><br/><p>The person we were looking for appeared before us.</p><br/><p>We were only looking down, and a voice came to us from up.</p><br/><p>“That voice…!” (Haine)</p><br/><p>At some point in time, at a place even higher than us, a monsters with a crooked head was there.</p><br/><p>It was like a cobra aiming for its prey.</p><br/><p>So high up that it might reach the clouds.</p><br/><p>“Lucifer!” (Michael)</p><br/><p>“Looking down on us all high-and-mighty!!” (Urie)</p><br/><p>The giant looking down at us, now that I have a better look, that upper human half had an heteromorphous look.</p><br/><p>Reptilian eyes and mouth split all the way to the ears. The teeth that peek out from that mouth were all sharp like saws. The thin tongue flickers in and out of the mouth rapidly.</p><br/><p>And most of all, a single woman stands at the top of Lucifer’s head.</p><br/><p>A charming woman.</p><br/><p>There’s no way of mistaking that figure.</p><br/><p>“So you really came out! Sunnysol Ates!” (Haine)</p><br/><p>The evil Light Goddess has appeared in front of me in her true mask for the first time.</p><ul><li>381: Reunion with the Goddess</li></ul><br/><p>“I am impressed you all had the gall to appear in front of me without any shame.” (Ates)</p><br/><p>A voice filled with heartfelt disdain poured out from Ates’ mouth.</p><br/><p>“Even when you were holding up the standard of human eradication, you betrayed your own convictions and ended up flattering your enemy on the other side of the fence!” (Ates)</p><br/><p>“Shut up, deceiver! Your trickery has long been exposed!” (Michael)</p><br/><p>Michael refutes without faltering a single step.</p><br/><p>“Light Goddess, Inflation!!” (Michael)</p><br/><p>The finger was pointing straight at Ates without doubt.</p><br/><p>“So you learned of my identity huh….. How did you notice?” (Ates)</p><br/><p>“The Light Founder Yorishiro saw through you!!” (Michael)</p><br/><p>“That woman…… Fufufu, she is unexpectedly loose mouthed.” (Ates)</p><br/><p>Even when the true essence of her soul has been seen through, Ates didn’t get flustered and simply laughed as if nothing.</p><br/><p>“You are a God, and yet, you plotted on destroying the humans! For that sake, you utilized us Demon Lords!!” (Michael)</p><br/><p>“Even though you are a God, you planned on destroying the very humans you created; you must be quite crazy! All the Gods we have met until now were all weird, but the only truly evil one was you!!” (Uriel)</p><br/><p>“Really, I feel bad for the humans that worship a wicked God like you! It is an insult to culture!!” (Gabriel)</p><br/><p>The Demon Lords hurl out abuse towards Ates.</p><br/><p>Since they understood that they had been deceived by Ates, their way of speaking naturally turned severe as well.</p><br/><p>“Goddess… Before being born, we heard this from inside our mothers: ‘Destroy the humans and stand at the summit of the world’.” (Michael)</p><br/><p>“What about it?” (Ates)</p><br/><p>“We believed that that voice was from the ruler of all monsters, the Great Demon Lord Lucifer. But now, after seeing the true Lucifer with these eyes of mine, that thought was blown away.” (Michael)</p><br/><p>The reptilian eyes of the giant Lucifer that one can’t feel any intelligence within.</p><br/><p>“This beast…there is no way it would have the wisdom to guide us monsters. Those words were spoken by you, the Goddess, right?! And you set it up so that we would fight the humans!!” (Michael)</p><br/><p>“Fufufufufu!!” (Ates)</p><br/><p>A scorning laugh.</p><br/><p>“Even if that’s the case, you were the ones who decided on destroying the humans. Not being able to push through your own decisions, what feeble resolve. In the end, the title of supreme race was too heavy for a bunch of animals huh.” (Ates)</p><br/><p>Ates didn’t refute the accusations of her being the one deceiving the Demon Lords under the name of Lucifer.</p><br/><p>“Like hell I care!!” (Michael)</p><br/><p>Michael says as he pushes his fist forward.</p><br/><p>“Straying from your original intentions is certainly unsightly. But not fixing it up after realizing it was a mistake is even more unsightly! Within actual battle, we realized the greatness of humans, and we found a better path!” (Michael)</p><br/><p>“Whatever the case, a thought that was induced into us before we were even born, in a stage where we didn’t have any ability to decide for ourselves. When we gained that ability to think for ourselves, for the first time, we noticed that it was a mistake.” (Uriel)</p><br/><p>“Culture and love are indivisible; love and humans are indivisible; thus, in order for monsters to obtain culture, the humans have to continue existing. Also, I want to talk a lot more with Celestis.” (Gabriel)</p><br/><p>Not only Michael; Uriel and Gabriel were showing their opposition towards Ates.</p><br/><p>The Demon Lords that were feared as the strongest existence and the humans felt their survival threatened, moreover, those three are all facing her.</p><br/><p>However, the scorning smile on Ates’ face didn’t go away.</p><br/><p>“…Seriously, you mere parts, don’t go talking like you are some big deal.” (Ates)</p><br/><p>Even when she was smiling, her face was overflowing with disgust.</p><br/><p>“Well, fine. I will teach you pitiful puppets. It is exactly as you guys say.” (Ates)</p><br/><p>“?!”</p><br/><p>“I spoke to you guys when you were about to be born from the inside of the Mother Monsters, and I indeed induced you guys to massacre the humans. For I -the Light Goddess- it was of no difficulty.” (Ates)</p><br/><p>“Then you…!!” (Michael)</p><br/><p>So it has been confirmed that the wire puller of this Demon Lord conflict was Ates.</p><br/><p>“I was thinking of making you people into the limbs of the Lucifer I created and have you guys help out in the eradication of humans, but… you all ended up being unbelievably useless. Looks like the thought of the four Base Elements about how monsters shouldn’t have a will was the correct one.” (Ates)</p><br/><p>“Don’t talk anymore!!” (Michael)</p><br/><p>Michael shouts with a voice filled with rage that could make even the earth tremble.</p><br/><p>“No matter our origins, we are now moving with our own wills. The same as humans and Gods; as members of this world, we will bring judgment to the ones that bring harm to the world!” (Michael)</p><br/><p>“If I don’t protect peace, that scary earth hero might scold me after all. Let’s act the role of a good Demon Lord trying to protect the world.” (Uriel)</p><br/><p>“I won’t let you destroy culture!!” (Gabriel)</p><br/><p>Declarations of war were being made one after the other.</p><br/><p>The Demon Lords were already a part of the comrades that protect this world.</p><br/><p>“Haine-san, what about you?” (Ates)</p><br/><p>But Ates ignores the high-moraled Demon Lords and speaks to me.</p><br/><p>“I am happy to meet you again, Haine-san. You left that Yorishiro and that hero brat, and prioritized me, right?” (Ates)</p><br/><p>Ates is an incarnation of the Light Goddess Inflation, just like Yorishiro.</p><br/><p>The spirit of a Goddess that should have originally been one had been divided into two by the love and hate of humans.</p><br/><p>If she is Inflation as well, she must know of my identity.</p><br/><p>“Haine-san, what do you think? Do you think humans should perish?” (Ates)</p><br/><p>“Are you really asking me this?” (Haine)</p><br/><p>If I were someone who would say ‘yes’ here, I wouldn’t have caused the battle of Gods in the Genesis era.</p><br/><p>But this is a story that only the ones involved know of.</p><br/><p>“…Right, you are that kind of person.” (Ates)</p><br/><p>Ates smiled in a lonely manner.</p><br/><p>“Ates…! So you are really…!” (Haine)</p><br/><p>“Then, at the very least, spectate until everything is over please. I will present you with an ideal world where there’s no worries and pain.” (Ates)</p><br/><p>The same time she says this, there was a change in the giant snake.</p><br/><p>From its back, shining wings sprouted out.</p><br/><p>“Light wings?!” (Haine)</p><br/><p>“Wings are the symbol of Demon Lords! For a giant monster to have them, how presumptuous!” (Michael)</p><br/><p>Those wings were quite different from the wings of a normal bird, and stretched out like thin lines. And then, they draw a big curve up, and before long, the ends of the wings of each side connect at the top.</p><br/><p>Both wings had drawn an arc and had connected at the top, drawing a big circle.</p><br/><p>The big shining circle that Lucifer carried on his back was like…!</p><br/><p>“A sun?!” (Haine)</p><br/><p>From that sun, a dazzling light was released.</p><br/><p>To the point of making me cover my face.</p><br/><p>“This is light divine power! Not good!” (Haine)</p><br/><p>My dark matter is…!</p><br/><p>“Uwaaaa?!” (Haine)</p><br/><p>In due time, the dark matter that I was using to maintain myself in the sky had been dispersed by the light divine power.</p><br/><p>And with that gone, I had no way of going against the natural gravity and was dragged down to the earth.</p><br/><p>“Please stay outside the mosquito net for a while, okay? Until the time when the preparations for the destruction of humanity are finished.” (Ates)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-378-379-wicked-snake-fiend\" id=\"prev_chap\" title=\"Chapter 378-379 - Wicked Snake Fiend\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-382-384-battle-of-the-demon-summit\" id=\"next_chap\" title=\"Chapter 382-384 - Battle of the Demon summit\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236399\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}