{"title": "Chapter 382-384 - Battle of the Demon summit", "id": 382, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-382-384-battle-of-the-demon-summit", "volume_title": "Volume 4", "body": "<h1>Chapter 382-384 - Battle of the Demon summit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 382-384: Battle of the Demon summit</h4></header></p><div class=\"entry-content\"><br/><p>Hiyururururu…</p><br/><p>“Gue?!” (Haine)</p><br/><p>Having lost the repulsion effect of the dark matter, I fall upside down.</p><br/><p>The place I fell on is the giant snake in question. Its scales are unexpectedly soft, so my fall was safe.</p><br/><p>“But it hurts a bit. Ouch ouch ouch…” (Haine)</p><br/><p>Damn it.</p><br/><p>The advantage light has over darkness really is absolute.</p><br/><p>An enemy with light element has not appeared until now, but one has finally appeared at this time, the light element monster, Lucifer.</p><br/><p>…..</p><br/><p>If Michael and the others don’t do something, it might actually be bad.</p><br/><p>After I had fallen straight down, I was able to confirm that Michael and the others stayed in the air as if natural.</p><br/><p>“Oi… Kuromiya Haine has fallen. What should we do?” (Uriel)</p><br/><p>“Doesn’t matter. In the first place, he came here as a spectator. Just think about it as the spectator taking its rightful seat.” (Michael)</p><br/><p>“Then that means it is finally the sole stage for us Demon Lords, right?” (Gabriel)</p><br/><p>Michael’s fire wings, Gabriel’s transparent wings, Uriel’s branch wings; each of them is filled with thick and ferocious divine power.</p><br/><p>Even if they have become easier to get along with after mingling with humans, each one of them has enough power to wipe out all humans, so a Demon Lord battle won’t be a simple matter.</p><br/><p>“Then…” (Haine)</p><br/><p>The Great Demon Lord Lucifer is certainly different from the other Demon Lords -it is just a giant monster.</p><br/><p>As proof, with just the gesture of its creator, Ates, it immediately acts on the order -as if stressing the fact that it has no will of its own.</p><br/><p>“Now, go ahead. The strongest of the strongest monsters, the Demon Lord of Demon Lords; Great Demon Lord, Lucifer, show the half-baked ones who can’t do their job how perfect you are.” (Ates)</p><br/><p>“Makes my stomach churn!!” (Michael)</p><br/><p>The three Demon Lords charge as if saying the first to move wins.</p><br/><p>…But that rush was repelled by dazzling light waves.</p><br/><p>“Unuuu?!”</p><br/><p>“Gueee!”</p><br/><p>“Kyaaaa!!”</p><br/><p>Michael, Uriel, and Gabriel had been hit by that light torrent and were pushed away.</p><br/><p>“That’s…!” (Haine)</p><br/><p>That’s something that was released from the shining sun on Lucifer’s back -from the light wings.</p><br/><p>“‘Grand Descent’! The light element is slightly stronger than the four base elements. It is not as absolute as the dark element, but light has absolute advantage against darkness.In that sense, the most stable power is the light.” (Ates)</p><br/><p>Ates says this while controlling Lucifer like her arm and legs.</p><br/><p>“That’s why the light element Lucifer is the lord of all monsters. Children of the four Base Elements that can only be the slaves of the two Poles, I will allow you the chance to repent and obey Lucifer.” (Ates)</p><br/><p>“Kuh, foolish!!” (Michael)</p><br/><p>Even when they were blown away by the ‘Grand Descent’, Michael and the others didn’t falter.</p><br/><p>“Like we will obey anyone! We will be the ones to decide that! The ability to decide, that will itself is what monsters took a century to attain!!” (Michael)</p><br/><p>Michael once again heads straight towards Lucifer.</p><br/><p>But this is way too straight of a confrontation.</p><br/><p>“Hmph, truly stupid. —[Grand Descent]” (Ates)</p><br/><p>As expected, the stream of light attacked Michael just like before!</p><br/><p>I thought that he would be pushed away like before, but…</p><br/><p>“Uooooo!!” (Michael)</p><br/><p>He is resisting!!</p><br/><p>Michael is releasing an even higher amount of fire divine power, and as if showing this physically, the fire wings had increased several times in size.</p><br/><p>With that vigor, he is rivalling the ‘Grand Descent’ of Lucifer!</p><br/><p>“…Soft.” (Michael)</p><br/><p>“Eh?”</p><br/><p>“It is true that this light divine power is slightly advantageous against my fire divine power, but it is only a bit. In the end, just a bit. There’s nothing that I Michael can’t push away when serious!!” (Michael)</p><br/><p>Michael at full power had broken through the light stream!</p><br/><p>“[Phoenix Hammer]!!” (Michael)</p><br/><p>And then, with both arms clad in fire that were akin to a hammer, he smashes them onto Lucifer!</p><br/><p>“Akaaaaa?!” (Lucifer)</p><br/><p>Lucifer itself raised a voice of pain as it retreated.</p><br/><p>“Is that all you have, Great Demon Lord?! Kuromiya Haine’s darkness power is leaps and bounds scarier than that light of yours!!” (Michael)</p><br/><p>Michael pushes out his fist and acts as a lord.</p><br/><p>From his sides, new elements attack at almost the same time.</p><br/><p>“I will be using a new technique I learned!” (Gabriel)</p><br/><p>Gabriel had appeared with a graceful spin.</p><br/><p>“[Water Beheading – Dance of the Dragon]!!” (Gabriel)</p><br/><p>From both arms of Gabriel, a high pressure blade flowed out.</p><br/><p>And by spinning with those in her arms, it covers her whole body and a water current drill is created.</p><br/><p>This blade that can cut anything it touches had hit Lucifer without any hesitation.</p><br/><p>“Atogikikakakakaka!!” (Lucifer)</p><br/><p>Lucifer raised a repulsive scream seemingly in pain.</p><br/><p>On top of that, Uriel…!</p><br/><p>“[Forbidden Dry Dhyana]!” (Uriel)</p><br/><p>He stretches his arms like those of a tree’s roots, and pierces the body of Lucifer.</p><br/><p>“Kaikaikaikaikai!!” (Lucifer)</p><br/><p>Uriel was basically a tree taking human form, so those arms were spreading inside the body of Lucifer.</p><br/><p>“‘Forbidden Dry Dhyana’ uses my root arms to crawl into the body of my opponent and cut them from the inside. On top of that, with the absorbing property of my roots, it can steal away moisture! Fall into pieces as you dry up!” (Uriel)</p><br/><p>The same time he says this, Uriel had spread the roots plenty enough and takes out his own hands.</p><br/><p>The roots that had spread heavily inside of Lucifer’s body had surfaced even to the outside.</p><br/><p>“Ha! This guy is not a big deal at all! You are totally weak, honestly speaking, a small fry!” (Uriel)</p><br/><p>“For us who were planning to fight against Kuromiya Haine, this opponent is just a disappointment. The pressure that I felt from that darkness power, I can’t even feel half of that from this guy!” (Gabriel)</p><br/><p>Yikes!</p><br/><p>Why are you guys comparing it with me so much?!</p><br/><p>“That’s all for the advantage the light power has.” (Michael)</p><br/><p>Michael, Gabriel, Uriel; the three lined up were glaring at the plenty hurt half-snake giant.</p><br/><p>“Let’s hit them all at once, Uriel, Gabriel! Let’s give them the retribution for deceiving us!” (Michael)</p><br/><p>“Okay, Leader!!” (Uriel)</p><br/><p>“It means that this is the victory brought by the cooperation of us three Demon Lords!!” (Gabriel)</p><br/><p>Fire, Water, and Earth divine power were rising to critical levels.</p><br/><p>They are planning on hitting Lucifer with that and corner it to defeat!</p><br/><p>“Goodbye, fake Demon Lord! Disappear from this world together with the wicked plan of your creator!!” (Michael)</p><br/><p>The three charge at exactly the same time.</p><br/><p>Fire’s red, Water’s blue, Earth’s golden were flying like arrows.</p><br/><p>If it were to get hit by that, the slight advantage of the light element won’t be of help.</p><br/><p>Lucifer would no doubt perish.</p><br/><p>It can’t avoid it and it won’t be able to guard against it with the light element.</p><br/><p>We won.</p><br/><p>The moment I was sure of that…</p><br/><p>“Uwaaaaaa?!” (Uriel)</p><br/><p>““Uriel?!””</p><br/><p>One of the three arrows was easily blown away?!</p><br/><p>Uriel was knocked down by the counter of Lucifer, and the other two comrades of his made a U turn to save him.</p><br/><p>What was shot at Uriel wasn’t light divine power.</p><br/><p>Wind divine power?!</p><br/><p>“Why?! Lucifer is a light monster, isn’t it?! And yet, it can use the wind element?!” (Gabriel)</p><br/><p>“It is impossible for a monster to use an element other than the one it has! Just what in the world…!” (Michael)</p><br/><p>Lucifer used wind divine power.</p><br/><p>No one could hide their agitation at this unbelievable situation.</p><br/><p>Except for one, the master of Lucifer, Ates.</p><br/><p>“Fufufufu, this is what it means.” (Ates)</p><br/><p>Ates laughs as if she were a spider who is spinning the web on its prey.</p><br/><p>Reacting to the signal of hers, Lucifer’s giant body trembles and something spreads out.</p><br/><p>“Wa?!”</p><br/><p>“That’s…!”</p><br/><p>Wings spread out from Lucifer’s back again.</p><br/><p>Even though he already has its light wings, at the back of the Great Demon Lord, there’s another pair of wings…</p><br/><p>Those wings…</p><br/><p>Were like colorful butterfly wings…</p><br/><p>“Those are…the wings of Raphael?!” (Haine)</p><ul><li>383: Stolen Wings</li></ul><br/><p>“Wa?! Impossible!”</p><br/><p>“That’s…!”</p><br/><p>“Raphael’s…Raphael’s…!!”</p><br/><p>Another pair of wings grew out from the Great Demon Lord Lucifer.</p><br/><p>On top of those sun wings it already had, it now also had colorful butterfly wings.</p><br/><p>We have seen them before.</p><br/><p>That’s because those are wings that one of the Demon Lords, the Wind Demon Lord Raphael had!</p><br/><p>“But…”</p><br/><p>Raphael should have died after the fight he had with Hyue.</p><br/><p>Why does Lucifer have his wings?!</p><br/><p>“Ufufu…” (Ates)</p><br/><p>Ates as always has her spider expression of playing with her prey as she charmingly waved her hand.</p><br/><p>As if in concert, Lucifer waves those butterfly wings.</p><br/><p>“Nuguuuaaaa!!” (Michael)</p><br/><p>“Kyaaaa!!” (Gabriel)</p><br/><p>“Gueeee!!” (Uriel)</p><br/><p>A gale was created from its flap, and the Demon Lords in the sky were blown away.</p><br/><p>“T-This really is a wind divine power attack! By using Raphael’s wings!” (Michael)</p><br/><p>“What in the world is going on?! Why does he have the wings of Raphael?! Why can he use the power of Raphael?!” (Gabriel)</p><br/><p>“Raphael! Raphael!!” (Uriel)</p><br/><p>The Demon Lords were falling into big confusion with the sudden situation.</p><br/><p>The loss of their comrade Raphael was a hard to accept reality for the Demon Lords.</p><br/><p>By moving to Apollon City and mingling with the humans, they finally overcame their sadness, but…if they are hit with such a thing, it wouldn’t be strange for the wound in their heart to open.</p><br/><p>“Fufufu… Lining up such amusing stupid faces. Fine. I will explain to you fools since I pity you.” (Ates)</p><br/><p>Ates says with a 100% scoffing.</p><br/><p>“I said it before but, Lucifer is still not in a complete state. That there will be a moment when Lucifer will be completed.” (Ates)</p><br/><p>“You meant the time it was sleeping until when it awakened, right?! That guy is already up and acting!” (Gabriel)</p><br/><p>“No.” (Ates)</p><br/><p>Ates easily pushes away the biting response of Gabriel.</p><br/><p>“Lucifer is still incomplete. The Great Demon Lord Lucifer I created is the ultimate existence that will surpass all monsters and also Gods as well. The current Lucifer is far from its perfect form.” (Ates)</p><br/><p>“W-What?!” (Michael)</p><br/><p>“In reality, I wanted to awaken it when it was in its complete form though. But the tools for the sake of that were so crude that I had to move this child personally.” (Ates)</p><br/><p>‘Seriously…’, is what Ates adds with scorn in her eyes.</p><br/><p>“Useless tools.” (Ates)</p><br/><p>“…Kh!” (Michael)</p><br/><p>Could it be that…what she refers to as the complete form of Lucifer is…!</p><br/><p>“Lucifer is the ultimate and perfect Great Demon Lord. That’s why it must be a perfect being that has all elements. Not only light, but fire, water, earth, wind, and…!” (Ates)</p><br/><p>“Could it be that’s the reason why Raphael…!!” (Michael)</p><br/><p>“That’s right.” (Ates)</p><br/><p>Ates looks down at the Demon Lords.</p><br/><p>“It is not only Raphael. You Demon Lords are parts to perfect Lucifer, you know.” (Ates)</p><br/><p>“?!”</p><br/><p>“Parts, you say?!” (Gabriel)</p><br/><p>The words of unknown meaning that she was repeating until now had finally gained meaning.</p><br/><p>“You Demon Lords are the condensation of the four Base Element’s divine power, by being purified for several hundreds of generations, you were expanded. Then, taking in this, Lucifer, who will then have the four ultimate four base elements, will truly become the perfect Great Demon Lord of all elements!!” (Ates)</p><br/><p>On top of the light, it would also have all four base elements; the ultimate monster?!</p><br/><p>“When at its back there are six pairs of wings, the Great Demon Lord Lucifer will be completed. And there’s the need of 3 parts for the sake of this!” (Ates)</p><br/><p>Ates moves her gaze towards Michael, Gabriel, and Uriel respectively.</p><br/><p>“Now, this is the time for you guys to fulfill your raison d’etre. Offer your body for the sake of the Great Demon Lord Lucifer’s completion.” (Ates)</p><br/><p>“Don’t joke around!!” (Michael)</p><br/><p>Michael lets out a roar like never before.</p><br/><p>“Our reason for existing is to become an offering to that beast?! This is the first time I have heard such a displeasing joke!! We are the ones to decide our reason for existing!!” (Michael)</p><br/><p>“You are getting too prideful, you mere parts.” (Ates)</p><br/><p>Ates wasn’t affected at all by the pressure Michael was releasing.</p><br/><p>“You being parts was decided before you were even born. Accept your fate obediently.” (Ates)</p><br/><p>The butterfly wings had become a part of the half-snake giant.</p><br/><p>The symbol of the Wind Demon Lord’s power had become only his wings and turned into the power of Lucifer.</p><br/><p>…Even when dead, his dignity had been trampled on.</p><br/><p>“…Kh!!”</p><br/><p>Something snapped somewhere.</p><br/><p>“Uwaaaaaaaaa! Raphaeeeeeel!!” (Uriel)</p><br/><p>“?!”</p><br/><p>“Uriel?! What’s the matter?!” (Gabriel)</p><br/><p>Suddenly, Uriel screamed in madness and rushed towards Lucifer.</p><br/><p>“Return them! Return the wings of Raphael!! He died with pride! Don’t dirty that! Don’t dirty thaaaaaat!!!” (Uriel)</p><br/><p>Blood had rushed to the head of Uriel for the desecration of his friend’s life.</p><br/><p>But Uriel, with your earth divine power…!!</p><br/><p>“Wait, Uriel!!” (Gabriel)</p><br/><p>“No good, stop Uriel!!” (Michael)</p><br/><p>The other Demon Lords chase after their comrade.</p><br/><p>Everything was within the plans of that accursed spider.</p><br/><p>“That’s right. Come here. This child here is hungry.” (Ates)</p><ul><li>384: Insatiable</li></ul><br/><p>“Uwaaaaa! [Forbidden Dry Dhyana]!!” (Uriel)</p><br/><p>Uriel once again stretches his roots and makes it crawl into the inside of Lucifer.</p><br/><p>“With this, I can tear up your body from the inside! I will go all out this time around! I will spread around my roots inexhaustibly until that big body of yours crumbles!” (Uriel)</p><br/><p>“Too slow.” (Ates)</p><br/><p>Lucifer once again flaps its new butterfly wings.</p><br/><p>Not only did it blow away Uriel, it also dried up and crushed the roots that Uriel was trying to stretch.</p><br/><p>“The four Base Elements have their respective weaknesses. Wind dries up earth and weathers it. In other words, Earth Demon Lord-san, you cannot defeat Lucifer anymore.” (Ates)</p><br/><p>“Shut up!!” (Uriel)</p><br/><p>Element affinities.</p><br/><p>This rule that controlled a lot the flow of the battles until now is once again standing in our way.</p><br/><p>Fire wins against wind, wind against earth, earth against water, and water against fire; that’s the relationship between the four base elements.</p><br/><p>That’s why for Uriel, wind is a big weakness.</p><br/><p>“Uwaaaaaa!!” (Uriel)</p><br/><p>Even with that, Uriel didn’t stop his charge.</p><br/><p>I thought he was a coward, and yet, to think he would fight against them in such a bold manner.</p><br/><p>Was his attachment towards his comrade Raphael so strong to bring such a reaction?</p><br/><p>But this will only make the current situation worse.</p><br/><p>“Wait, Uriel! Calm down first! Regain composure!!” (Michael)</p><br/><p>“Geez! You are a coward, so don’t go getting all emotional for your friends!!” (Gabriel)</p><br/><p>Michael and Gabriel were desperately trying to calm him down, but the effect was low.</p><br/><p>“Ufufu… Well then, let’s smash you with a technique of that important friend of yours.” (Ates)</p><br/><p>Understanding what Ates wanted, Lucifer spreads out its colorful butterfly wings.</p><br/><p>And then, that split apart mouth that resembled a snake had let out clear human words.</p><br/><p>“[Four Calamity Whirls]” (Lucifer)</p><br/><p>At the same time as it flapped its butterfly wings, four tornadoes attacked Uriel.</p><br/><p>“Gugyaaaaaa!!” (Uriel)</p><br/><p>““Uriel!!””</p><br/><p>Michael and Gabriel were pushed slightly back at the dreadful gales this attack created. And yet, it was as if only Uriel was being sucked in by them.</p><br/><p>Uriel couldn’t do anything against the maximum wind divine power that he has the worst affinity against.</p><br/><p>Receiving the concentrated attack of the four tornadoes, he was being beaten up.</p><br/><p>“Gugh!!” (Uriel)</p><br/><p>That beaten up Uriel was caught by the giant hand of Lucifer.</p><br/><p>“…Hmm, you didn’t die huh. Looks like the output was lower than expected.” (Ates)</p><br/><p>Seeing his state, Ates pits out those words.</p><br/><p>“As expected, it must be because his death was brought by through the erasure of most of his divine power with the dark matter of Haine-san. The divine power amount that Lucifer managed to absorb was low.” (Ates)</p><br/><p>“Guuugh…” (Uriel)</p><br/><p>“Well, the wings of you guys serves the purpose of converting divine power, so as long as Lucifer has unlimited light divine power, it should work out some way or another though. But it would be better to have than not.” (Ates)</p><br/><p>What?</p><br/><p>What is she thinking!</p><br/><p>“In other words, if we do this, it can engulf your divine power whole.” (Ates)</p><br/><p>“…What? Wa? Could it be…?!” (Uriel)</p><br/><p>Uriel was inside Lucifer’s hand.</p><br/><p>He was shocked and panicking.</p><br/><p>Because the hand he was in was slowly being brought to the mouth of Lucifer.</p><br/><p>“Stooooop!!” (Michael)</p><br/><p>“Urieeeel!!” (Gabriel)</p><br/><p>Michael and Gabriel seemed to have caught on in what they were intending to do.</p><br/><p>They hurriedly released divine power attacks, but…</p><br/><p>“Stop! Wait! Don’t tell me you are going to eat—! No, no! No—–Gyaaaaaa!” (Uriel)</p><br/><p>*Gulp*</p><br/><p>It didn’t make it in time.</p><br/><p>Uriel disappeared along with that sound.</p><br/><p>Inside of Lucifer’s mouth.</p><br/><p>“Uriel!!” (Michael)</p><br/><p>“Uriel was eaten?! By that beast?!” (Gabriel)</p><br/><p>Michael and Gabriel couldn’t stop it.</p><br/><p>That action had no opening or pause, and that unnatural happening had frozen everyone in place.</p><br/><p>“If you take them in alive in this way, all the excessive divine power you guys have can be turned into Lucifer’s power.” (Ates)</p><br/><p>Ates says with a triumphant face.</p><br/><p>“I was originally thinking about only taking in your wings, but you could say this is a blessing in injury. Thanks to you guys being useless pieces of trash that won’t fight, I found a way to evolve Lucifer even better.” (Ates)</p><br/><p>“You…!!” (Michael)</p><br/><p>“You must have noticed already, right? The reason why I went to such lengths to lower myself and have you guys fight the humans.” (Ates)</p><br/><p>To have the humans kill the Demon Lords…</p><br/><p>At first, the Demon Lords sought the seat of the supreme race and fought the humans.</p><br/><p>If that conflict had continued, it would have led to the fall of the Demon Lords or the humans. But it would have without doubt caused heavy damage to both sides.</p><br/><p>“In the human side there’s Haine-san and Yorishiro. The four Base Elements would take some action as well. The humans would wipe you guys out even if they had to sacrifice a lot. And then, Lucifer would collect the remaining wings and become complete.” (Ates)</p><br/><p>She planned all that…</p><br/><p>“And yet, you guys cowardly fell into flattering the humans, and stopped fighting. No sacrifices from the humans and Demon Lords is the worst development. You mere parts derailed my plan and I had to activate Lucifer before completion. That sin of yours, I will have you pay for it now.” (Ates)</p><br/><p>“Don’t make me repeat myself!” (Michael)</p><br/><p>Michael shouts as if grinding his teeth.</p><br/><p>“We are not your puppets! We will find our own reason for existing!!” (Michael)</p><br/><p>“That’s right! If it is engulfing them alive, it must mean that Uriel is still alive, right?! I will cut open that beast and bring him out of its stomach!” (Gabriel)</p><br/><p>The remaining Demon Lords didn’t lose their fighting spirit.</p><br/><p>But…</p><br/><p>“Can you? <i>Water</i> Demon Lord, Gabriel.” (Ates)</p><br/><p>A new change appeared in Lucifer.</p><br/><p>A single tree sprouted from its back like wings.</p><br/><p>“Uriel’s wings have…!” (Gabriel)</p><br/><p>“So even the engulfed Uriel’s power has been taken in?!” (Michael)</p><br/><p>Lucifer now had three pairs of wings.</p><br/><p>“The earth wings that possess overwhelming advantage against the water element. Gabriel, this time, it is your turn to be engulfed.” (Ates)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-380-381-demon-lords-frontline\" id=\"prev_chap\" title=\"Chapter 380-381 - Demon Lords frontline\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-385-387-proof-of-existence\" id=\"next_chap\" title=\"Chapter 385-387 - Proof of existence\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236400\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}