{"title": "Chapter 390-391 - Five Colored Gloss Fountain", "id": 390, "volume": 4, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-390-391-five-colored-gloss-fountain", "volume_title": "Volume 4", "body": "<h1>Chapter 390-391 - Five Colored Gloss Fountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><header class=\"entry-header\"><h4 class=\"entry-title\">WR – Chapter 390-391: Five Colored Gloss Fountain</h4></header><div class=\"entry-content\"><br/><p>Dark Underworld Country.</p><br/><p>I do know that name, but I don’t know at all for what reason that name came out at this moment.</p><br/><p>That place is the nation that worshipped the Dark God Entropy.</p><br/><p>A nation that has already fallen.</p><br/><p>They appeared in the daybreak of human history, developed greatly, grew in scale, and became the firsts to form culture.</p><br/><p>At present, not even that nation’s existence is retained in the memories of the people, and rediscovering this location would affect humanity heavily.</p><br/><p>But in this situation where we don’t know what will happen to the world due to Lucifer…honestly, I feel like it would be best to push aside academic problems temporarily though.</p><br/><p>“Head to the Underworld Country.” (Yorishiro)</p><br/><p>Yorishiro-sama said this unsparingly.</p><br/><p>“Deep in that city, the key to defeat Lucifer should be sleeping there. You five should search for it and find it.” (Yorishiro)</p><br/><p>“Uhm…Yorishiro-sama…why do you—” (Karen)</p><br/><p>‘Know something like that’, is what I was going to continue with, but…</p><br/><p>“I received contact from Shiva-san saying that the Wind Church will do their all to analyze Lucifer. The other Churches are also preparing for battle, and the previous heroes are also going to be standing in battle. Our Light Church’s defense will be hardened by Doraha.” (Yorishiro)</p><br/><p>There was no space for me to say anything.</p><br/><p>“You heroes will head to the Underworld Country and find what is absolutely necessary to fight against Lucifer. The fate of the world is resting in you people’s hands!” (Yorishiro)</p><br/><p>And so, we were practically pushed into a journey.</p><br/><p>A journey to once again step into the Underworld Country.</p><br/><p>*********</p><br/><p>But this journey had a big difference from before.</p><br/><p>The liveliness of the company. Before, when we were in the journey of searching for the Underworld Country, Yorishiro-sama, Haine-san, and I -Karen- were travelling together.</p><br/><p>Because Haine-san, a male, was in the group, Yorishiro-sama and I were pretty meek.</p><br/><p>Compared to that…</p><br/><p>There’s Mirack-chan, Celestis-chan, Sasae-chan, Hyue-chan, and I; a total of five.</p><br/><p>People say that three girls is noisy, so it wouldn’t be an exaggeration to say that a group of five girls would be boisterous.</p><br/><p>The journey was lively to the point that no one would think this is a journey with the fate of the world at stake.</p><br/><p>“Wait!! Wait wait, I didn’t hear anything about this! This Underworld Country is in this Nameless Desert?! It is crazy hot here!” (Celestis)</p><br/><p>“This be the Land of Death-dasu yo?! If ye step in it, ya ain’t gonna come out alive-dasu! I forgot to write a will-dasu yo!” (Sasae)</p><br/><p>“Aaaahh… Aaaaaahhh…” (Mirack)</p><br/><p>“Mirack-dono is on the verge of death-de gozaru?! This person is supposed to be the fire hero, and yet, she is weak to heat-de gozaru yo?!” (Hyue)</p><br/><p>“Leaving aside the heat…! What are your opinions?!” (Karen)</p><br/><p>Ah…so noisy.</p><br/><p>At this rate, I can’t concentrate in finding the Underworld Country, so I decided on taking a small pause.</p><br/><p>This place is the most prominent danger zone in this world, the Nameless Desert.</p><br/><p>This sight of solely sand that stretches all the way to the horizon and has no landmark would confuse the people that enter it, and with the heat and dryness, it will dehydrate people to death.</p><br/><p>In the past, several hundreds of people have lost their way in this desert and haven’t returned.</p><br/><p>That’s why people feared this place as a cursed land, and there’s no one who would come in here because they want to.</p><br/><p>That’s why it wouldn’t be a surprise if there’s a giant forgotten ruin in this desert…</p><br/><p>But before going there! Let’s take a break!</p><br/><p>**************</p><br/><p>“Aaah! I am back to life!” (Mirack)</p><br/><p>We came to the oasis that we used before as a place to take a break.</p><br/><p>The moment we arrived, Mirack-chan, Celestis-chan, Sasae-chan, and Hyue-chan took off their clothes and practically dove into the lake.</p><br/><p>“!!!”</p><br/><p>As they ran there, everything including their underwear was being scattered.</p><br/><p>“E-Everyone’s lacking way too much shame! Even if this place is a remote region, even if the chances of someone passing by is extremely close to zero…!!” (Karen)</p><br/><p>We are in a group here, so even if you are going to take off all of your clothes, show a bit of shame at least!</p><br/><p>“Eeh? What are you trying to act all elegant for, Karen-chi?” (Celestis)</p><br/><p>Is what Celestis-chan says as she surfaces slightly from the water while making bubbles.</p><br/><p>“In the first place, we all have shown our everything several times already. There’s no need to get embarrassed after so long, right?” (Celestis)</p><br/><p>Well, there was indeed the hot spring of Ishtar Blaze, and the high-class spa of Rudras Metropolis; now that I think back, there were many moments where we have shown our naked bodies.</p><br/><p>“Isn’t this what they call skinship, Karen?” (Mirack)</p><br/><p>Mirack-chan had half her face sunk in the water, and was replenishing moisture.</p><br/><p>…Like a hippopotamus.</p><br/><p>“By showing ourselves to each other and with nothing to hide, our connection will strengthen. It wouldn’t be an exaggeration to say that every time we show our naked bodies to each other, the link that ties us grows stronger.” (Mirack)</p><br/><p>“Even if that’s truly the case, I feel wicked emotions from the gaze of Mirack-chi though?!” (Celestis)</p><br/><p>“I feel as if I am being looked at thoroughly by an old man-de gozaru?!” (Hyue)</p><br/><p>Celestis-chan and Hyue-chan were getting flustered by the gaze of Mirack-chan that was not fitting that of someone from the same gender.</p><br/><p>Mirack-chan! As I thought, the people of the Fire Church prefer people from the same gender rather than the opposite?!</p><br/><p>“At any rate…when I look at the naked body of Sasae, it really makes me think.” (Mirack)</p><br/><p>“Hm? What-dasu?” (Sasae)</p><br/><p>Without noticing the wavering that was being created in our hearts, Mirack-chan was beginning to extend her hands to even the youngest one here, Sasae-chan.</p><br/><p>“Right now, Sasae doesn’t have a mountain or a valley yet with that little body of hers, but when I remember the plumpness of when she became a God Hero… the difference is just…!!” (Mirack)</p><br/><p>Ah, now that she mentions it…!</p><br/><p>The super power-up we get when we receive a part of a God, the God Hero mode; thanks to that, we were able to fight against the Demon Lord-sans, but within them, the time when Mother Earth-sama combined with Sasae-chan, the change of hers was a special one even among us.</p><br/><p>“…The little girl Sasae-chi had become a voluptuous dynamite body woman after all. It was my first time seeing boobs that are like watermelons.” (Celestis)</p><br/><p>“Eh? What happened-de gozaru ka?” (Hyue)</p><br/><p>Only Hyue-chan who wasn’t there was unable to follow the conversation.</p><br/><p>“I thought it might have been because of the high synchro rate between you and Mother Earth, or maybe that you wouldn’t be able to return to your former state, but it looks like you properly returned to normal!” (Mirack)</p><br/><p>“Yes-dasu! The power of Mother Earth-sama ain’t something I can monopolize after all-dasu no de!” (Sasae)</p><br/><p>Is what Sasae-chan while puffing out her smooth plank chest.</p><br/><p>“Of course, I can turn into God Hero mode whenever it be necessary-dasu! As Mother Earth-sama says, the earth hero’s main trait be physical combat, so it apparently be best for the body to be in their grown state-dasu!!” (Sasae)</p><br/><p>“And thus that crazy voluptuous body?!” (Karen)</p><br/><p>Just remembering makes even a member of the same gender as me have a nosebleed.</p><br/><p>“Meaning that there’s a high chance that when Sasae-chan grows, she will turn out that way?” (Mirack)</p><br/><p>“I don’t know-dasu ga! But it probably be the case-dasu!!” (Sasae)</p><br/><p>Don’t affirm something with a ‘I don’t know’ and ‘probably’…</p><br/><p>“……”</p><br/><p>Mirack-chan made a bitter expression for a moment, and then, hugged the body of Sasae-chan silently.</p><br/><p>“Eh? Eh? What-dasu? Why are ye suddenly hugging me-dasu?!” (Sasae)</p><br/><p>“Well, if you are going to be growing into a Sasae-chan filled with meat, I was thinking I might as well enjoy this small Sasae while I have the chance.” (Mirack)</p><br/><p>Mirack-chan is already at a level where we can call the police on her!</p><br/><p>“Ah, then I as well~!” (Celestis)</p><br/><p>“Celestis-chan?!” (Karen)</p><br/><p>“T-Then me as well. I will treat myself to the cute Sasae-dono while I can!” (Hyue)</p><br/><p>“Even Hyue-chan?!” (Karen)</p><br/><p>The three naked girls were squashing Sasae-chan all at once?!</p><br/><p>“Uwa?! What be this-dasu ka?! What be going on-dasu ka?! Mah pretty aura has mesmerized everyone-dasu ka?! But I want ya to have a bit of composure-dasu!” (Sasae)</p><br/><p>Sasae-chan was being petted while the water was being splashed around.</p><br/><p>After a few years, even without the God Hero mode, Sasae-chan will have that voluptuous body. It would instead turn into us being the ones being seen as cute…</p><br/><p>……</p><br/><p>“Wait wait! I will also pet Sasae-chan!” (Karen)</p><br/><p>I also take off everything along with my underwear and jump into the lake. We are all going to enjoy Sasae-chan that will be going away soon in the future.</p><br/><p>This journey that has the world’s fate at stake…within this journey, the tie between us heroes has strengthened once again…maybe?</p><ul><li>391: Exposing ourselves</li></ul><br/><p>And in this way, after enjoying a bath in the oasis, we five were drying ourselves at the vicinity of the lake.</p><br/><p>“Hngh~, that felt great~!” (Mirack)</p><br/><p>“It is nice that the water temperature was good, but on top of that, it felt great to be able to bath naked outside without the need to worry. It might end up being a habit.” (Celestis)</p><br/><p>Celestis-chan, please don’t awaken to weird fetishes.</p><br/><p>We five had taken off everything including our underwear, but it was a pain to wear our clothes even after getting out of the water, so in the end, we were lying down while still being naked.</p><br/><p>This is something we can do because we are deep in the Nameless Desert. There’s no way we would lower our guards this much if there were a chance for people to pass by.</p><br/><p>“This be heaven-dasu~. Can’t get enough of this feeling of the sun burning my skin slowly-dasu yo~.” (Sasae)</p><br/><p>“If you like tanning in the sun so much, how about coming in the outing season to the Radona mountain range that our Fire Church manages? We can’t go full blown naked like here, but going in a swimsuit and tanning your skin in the cool air of the mountain range feels nice, you know?” (Mirack)</p><br/><p>Is what Mirack-chan says like a tour guide.</p><br/><p>Right. I would like to enjoy an outing with everyone.</p><br/><p>“Well, it would all be the end if Lucifer destroys the world though-de gozaru.” (Hyue)</p><br/><p>““““……””””</p><br/><p>“Eh? What-de gozaru ka?” (Hyue)</p><br/><p>Hyue-chan…even though you are the wind hero…</p><br/><p>“You are the wind hero, and yet, you can’t read the mood.” (Karen)</p><br/><p>“Why-de gozaru ka?!” (Hyue)</p><br/><p>Maybe because we were not wearing any clothes at all, we are showing less restraint than normal.</p><br/><p>Right now, there was nothing shutting out our bodies and hearts.</p><br/><p>“Then, since we all have nothing to hide, I will be speaking my heart out!” (Celestis)</p><br/><p>Celestis-chan rose up from her lying down position, and her breasts that were not big but definitely not small shook.</p><br/><p>“Is this really the time for us to be doing this?” (Celestis)</p><br/><p>“Uh?!” (Karen)</p><br/><p>This is probably something that all five of us were thinking.</p><br/><p>“The Great Demon Lord Lucifer is an enemy on a level we haven’t faced before, and the Demon Lords that we finally had gotten along with were all defeated. On top of that, Haine-chi was also defeated and he used his all to buy time. And in the important time that Haine-chi has created, we are…” (Celestis)</p><br/><p>“‘Is it okay for us to be pointlessly wasting it here?’, is what you are trying to say?” (Mirack)</p><br/><p>Mirack-chan takes over her words.</p><br/><p>Meaning that she also has the same opinion as Celestis-chan.</p><br/><p>“No way! To call it pointless…!” (Karen)</p><br/><p>“I also feel the same-de gozaru.” (Hyue)</p><br/><p>Hyue-chan bends that slender body of hers that flowed beautifully.</p><br/><p>“It is a given that we want to find a way to defeat Lucifer, but I feel like it is a bit too far-fetched to think that we will find that way in the ruins of an ancient civilization. And how did the Light Founder-dono reach to that revelation-de gozaru?” (Hyue)</p><br/><p>“Since the moment I met her, she has been shrouded in mystery, that Light Founder. But this time around, it is so unfounded that I can’t just accept it.” (Celestis)</p><br/><p>“That ‘go to the Underworld Country’ gave the impression that she didn’t even have the leeway to feign a natural act. We were pushed by the pressure of that Light Founder and came all the way here, but with this break, I ended up regaining my composure.” (Mirack)</p><br/><p>“I don’t understand well-dasu ga, but is that so-dasu!!” (Sasae)</p><br/><p>Everyone’s doubts, questions, are erupting suddenly after coming here?!</p><br/><p>Maybe these are the effects of having time to arrange our thoughts and everyone being naked, diminishing our restraints.</p><br/><p>…It is true that Yorishiro-sama is a person that one can’t read what’s hidden deep inside of her. If I were to put it bluntly, she was suspicious.</p><br/><p>I can’t tell what she is thinking deep inside her heart.</p><br/><p>That’s why there’s the need for the ones who believe her to have courage in believing.</p><br/><p>“I believe in Yorishiro-sama.” (Karen)</p><br/><p>I decisively stood up.</p><br/><p>I won’t falter right now. I will stand upright even if I am not wearing any underwear!</p><br/><p>“It can’t be helped that everyone is uneasy. But within this group, I am the one that knows Yorishiro-sama the most. And I was able to believe that the decision of Yorishiro-sama this time was the correct one.” (Karen)</p><br/><p>That’s why…</p><br/><p>“Can everyone please believe in that decision of mine? All five of us have overcome many things by cooperating with each other. I think that the trust between us five won’t lose to anyone. That’s why, please believe in the me that believes in Yorishiro!” (Karen)</p><br/><p></p><br/><p>““““……”””””</p><br/><p>Hearing this, Mirack-chan, Celestis-chan, Sasae-chan, and Hyue-chan stood up one after the other.</p><br/><p>All five of us were facing each other naked and created a circle.</p><br/><p>“If Karen-san goes so far as saying this much, it can’t be helped. I already swore to never go against you ever again after all.” (Mirack)</p><br/><p>“Riding in the waves of the trends is one of the traits an idol has to have in order to survive long. I have won big with the eccentric actions of Karen-chi and the others, so I will be riding on this winning horse as well.” (Celestis)</p><br/><p>“Believing in simple honesty through the very end be the height of us Earth devotees! I will trust in Karen-neechan till death-dasu!!” (Sasae)</p><br/><p>“I would be delighted to join you as a comrade…!” (Hyue)</p><br/><p>By exposing our bodies, and exposing even the depths of our hearts, we were able to unite once again.</p><br/><p>It is a journey we are in a hurry with, but there was definitely big meaning in this break.</p><br/><p>“Okay! Then, let’s keep the break up to here and head to the Underworld Country!!” (Karen)</p><br/><p>“Eh?”</p><br/><p>“Wait Karen, aren’t you hurrying too much? Shouldn’t we rest for a bit more?” (Mirack)</p><br/><p>No no! Lucifer won’t wait for us, so we have to arrive at the Underworld Country before it comes back, and find a way to defeat it!</p><br/><p>Being urged forward by me, everyone hurriedly puts on their clothes.</p><br/><p>Now that I think about it, it might have been bad to hurriedly put on our clothes like this.</p><br/><p>We only noticed this fatal mistake after we finished putting our clothes on.</p><br/><p>*****************</p><br/><p>“““““……”””””</p><br/><p>The five heroes finished dressing.</p><br/><p>There was a strange sense of incongruity in everyone.</p><br/><p>Because we hurriedly put our clothes on…</p><br/><p>“Wa…we…?!” (Mirack)</p><br/><p>“We mistook our panties!” (Celestis)</p><br/><p>That’s right! The incongruity came heavily from our nether region!</p><br/><p>Because we were so hurried, we put on the panties of a different person.</p><br/><p>“The ones I put on are…from Celestis?! Why didn’t I notice I put on such a crazy flashy one like this?!” (Mirack)</p><br/><p>“Mine is Hyue-chi’s! Or more like, why are your panties mesh cloths as well?! Is ventilation in your crotch important too?!” (Celestis)</p><br/><p>“Hiiih?! The panties of Mirack-neechan be baggy-dasu yo!” (Sasae)</p><br/><p>“Mine’s from Karen-dono-de gozaru ka… There’s a good amount of space left. Is the butt of Karen-dono unexpectedly big-de gozaru?” (Hyue)</p><br/><p>There’s the fact that we hurriedly dressed, but this tragedy happened because we also threw around our clothes randomly, you know!</p><br/><p>If we all had taken off our clothes properly and folded them…!</p><br/><p>At any rate, I didn’t want to waste the time of undressing again to change panties, so we decided on heading to the Underworld Country like this.</p><br/><p>Because the clothes of girls takes quite a good amount of time to take off and put back on after all.</p><br/><p>But I…the ones that I mistakenly put on were the ones of the youngest in the group, Sasae-chan!</p><br/><p>Small small small!!</p><br/><p>It is wedging in, it is wedging in!!</p></div></header><br/>\n</p></div>"}