{"title": "Chapter 406-407 - Four Gods at the side", "id": 406, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-406-407-four-gods-at-the-side", "volume_title": "Volume 5", "body": "<h1>Chapter 406-407 - Four Gods at the side</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 406-407: Four Gods at the side</p><br/><p>“This is your lost.” (Karen)</p><br/><p>I said this to the already wrecked Lucifer and Ates who is sticking to it.</p><br/><p>Around her, there’s my comrade God Heroes and the Demon Lord-sans; a total of eight.</p><br/><p>We were surrounding her so that we won’t let any weird movement escape.</p><br/><p>“Now that Lucifer has lost most of its wings and it is in a beaten up state, you don’t have a method to go against us all. Please give up obediently and free Haine-san.” (Karen)</p><br/><p>“Fufufufu! How foolish can humans be? Thinking that with just this you have won.” (Ates)</p><br/><p>Could it be that we will never be able to reach an understanding with this person?</p><br/><p>“It is true that Lucifer has lost four pairs of its wings. And what of it?! The power of the wings is more about quality than quantity. What you guys regained were basically trash of wings!” (Ates)</p><br/><p>“What did you say?!” (Michael)</p><br/><p>“What’s with that after forcefully stealing them from us?!” (Gabriel)</p><br/><p>The Demon Lord-sans that were direct victims of it were angered to the extreme.</p><br/><p>“The strength of the four Base Elements is trash compared to the two Poles that are light and darkness. Lucifer still has light and darkness remaining! As long as I have those, you people are basically rubbish!!” (Ates)</p><br/><p>Lucifer slowly gets up, and spreads out its dark wings.</p><br/><p>The dark power that swallows everything and erases it.</p><br/><p>“Now, Lucifer! Use your invincible dark power to crush the foolish! And after that, absorbs the parts again and become completed once more!” (Ates)</p><br/><p>!!</p><br/><p>So she really wants to continue fighting!</p><br/><p>Tension began to run through the whole place, but then…!</p><br/><p>“Guuh!” (Lucifer)</p><br/><p>Lucifer suddenly stopped moving.</p><br/><p>“?! What’s the matter, Lucifer?! Move! Move and kill them all right this instant! Are you going to mess up my plans as well?! You incompetent tool!!” (Ates)</p><br/><p>Even though Lucifer was receiving abuse from its creator, it didn’t move.</p><br/><p>Rather, it trembled as if in pain, and then, finally, a clear movement occurred.</p><br/><p>A large number of pitch black somethings were coming out from the mouth of Lucifer.</p><br/><p>“Wa?!”</p><br/><p>I could tell at a glance that this was abnormal.</p><br/><p>It isn’t just from its mouth. Its eyes, nose, ears; not only that, even from the wounds that were made from our many attacks were spewing out those black things.</p><br/><p>“What’s the matter, Lucifer?! Stand! Stand and fight!!” (Ates)</p><br/><p>There’s no way it can do that.</p><br/><p>In time, Lucifer didn’t just gush them out, but also began to shine from its whole body.</p><br/><p>“What’s going on?! Why does every single one of you not move as I wish?! That’s why I say all the people born in this world are trash! No one is of use!!” (Ates)</p><br/><p>Ates was raising a shrilling voice as she grieves her own misfortune.</p><br/><p>We didn’t know what to do and could only watch over this.</p><br/><p>“The reason nothing goes the way you want is because…”</p><br/><p>“?!”</p><br/><p>There, a majestic and dignified voice pitches in.</p><br/><p>“You don’t love anyone, Ates-san.”</p><br/><p>“Yorishiro?!” (Ates)</p><br/><p>Yorishiro-sama?!</p><br/><p>Why is she here?!</p><br/><p>“You don’t love anyone. That’s why no one can love you. Sadly, there’s no one who would want to do anything for someone they don’t like.” (Yorishiro)</p><br/><p>“What are you coming all nonchalantly at this point of the battle? Did you come here after knowing that you are riding a winning horse?!” (Ates)</p><br/><p>“Yeah. You are already done for.” (Yorishiro)</p><br/><p>Yorishiro-sama calmly said this.</p><br/><p>It was calm, but the pressure that came from that voice silenced not only us heroes, but even the Demon Lords.</p><br/><p>“I was always wondering this. Why is it that darkness can’t win against light?” (Yorishiro)</p><br/><p>“?!”</p><br/><p>“Darkness is the origin of this world and the strongest of powers. Is it possible for it to hold a weakness? Is it possible to have a supremacy that has a weakness?” (Yorishiro)</p><br/><p>“What is it you are trying to say?!” (Ates)</p><br/><p>“The law of ‘darkness can’t win against light’ was something that the Dark God himself created.” (Yorishiro)</p><br/><p>What does that mean?</p><br/><p>Meaning that the Dark God made a rule that would harm his own invincibility?</p><br/><p>“There’s no one who loves this world more than the Dark God Entropy. It is exactly because he is like that that an absolute existence wasn’t allowed to exist in this world. Not even himself. Because an absolute existence would surely break the balance of the world and would hinder progress.” (Yorishiro)</p><br/><p>“?! That’s why he…?!” (Ates)</p><br/><p>That’s why he created the light that counteracted him?</p><br/><p>By deliberately creating an element that can get the better of him, he formed a balance in the name of the two Poles, and in that space, he was able to create the colors that were the four Base Elements.</p><br/><p>“Light… That’s the very kindness that the darkness created. And yet, you didn’t understand that kindness and absorbed that darkness along with that personage himself. At that moment, the darkness lost its God’s love.” (Yorishiro)</p><br/><p>“?!”</p><br/><p>“Your selfish heart has been projected into the darkness.” (Yorishiro)</p><br/><p>A darkness that has lost its God’s love would not forgive the existence of an antithesis like light.</p><br/><p>A rivalry between light and darkness was occurring inside Lucifer’s body.</p><br/><p>Unable to endure that clash, Lucifer is beginning to collapse internally?!</p><br/><p>“It might have managed somehow if the absorbed four Base Elements served as interims, but now that you have lost the Demon Lords, it has lost anything to block its way and the collapse increased in speed at once.” (Yorishiro)</p><br/><p>“What?!” (Ates)</p><br/><p>“Lucifer will most likely be erased completely beforelong. Your plans have collapsed completely, Ates-san.” (Yorishiro)</p><br/><p>At the side of Yorishiro-sama and Ates glaring at each other, Lucifer was writhing in pain even now.</p><br/><p>She didn’t even show pity at the Lucifer she herself created and simply clicked her tongue.</p><br/><p>“Fine. I will admit defeat this time.” (Ates)</p><br/><p>Ates declared.</p><br/><p>“But this is not a definite lost. Even if I have been defeated today, I as a God have basically close to eternal time. I will form a plan from zero, and will someday come back again. And then, at that time, I will make reality a perfect world where only him and I exist!” (Ates)</p><br/><p>?!</p><br/><p>Ates’ body is being enveloped in light?!</p><br/><p>Don’t tell me she is planning on escaping!</p><br/><p>“That won’t happen.” (Yorishiro)</p><br/><p>“Wa?!”</p><br/><p>Ates seemed like she was about to disappear inside the light, but she was caught by something and pulled back?!</p><br/><p>She failed in escaping.</p><br/><p>“You asked why I nonchalantly came at this point of the battle, right? You made a question, and yet, you were going to leave without hearing the answer. What a rude person.” (Yorishiro)</p><br/><p>“What’s this?!” (Ates)</p><br/><p>“Let me answer. I came because preparations were completed. Preparations to make it so you definitely can’t escape.” (Yorishiro)</p><br/><p>Yorishiro-sama clearly spoke.</p><br/><p>“Right now, this whole area has the four Base Elements making a barrier. You, as the incarnation of the Light Goddess, won’t be able to break through that barrier. Light can’t win against the four Base Elements when they join forces. That is also a rule set in this world by the King of Gods.” (Yorishiro)</p><ul><li>407: Darkness suicide</li></ul><br/><p>(Good grief, that Goddess gives rough treatment to us Gods!) (Nova)</p><br/><p>(Isn’t that fine? This is a fight that will decide the fate of the world. I instead feel as if just this much help doesn’t feel like enough.) (Coacervate)</p><br/><p>(I can’t disobey the orders of Inflation-san~.) (Mantle)</p><br/><p>(…)</p><br/><p>Nova, Coacervate, Mantle, and Quasar; the Gods that rule over the four Base Elements were divided in every direction, and were forming a barrier.</p><br/><p>In order to not let the main culprit of this incident, the evil Light Goddess, escape. Their role is incredibly important.</p><br/><p>(This battle is a battle to show the growth of humans.) (Quasar)</p><br/><p>The Wind God, who is the sole one that has incarnated as a human in this group, says this.</p><br/><p>(The humans have already escaped from the control of the Gods and have become living beings that can overcome any difficulties on their own. This is also a battle to show this. That’s why we Gods intrude in it. This much support is plenty enough.) (Quasar)</p><br/><p>(But Quasar-san, is it okay for you to be using that much power?) (Coacervate)</p><br/><p>The Water God asks.</p><br/><p>(Your human body was partially destroyed because of the battle with a Demon Lord, and shouldn’t be able to endure heavy outputs of divine power. To deploy a big barrier in that state is just…) (Coacervate)</p><br/><p>(You are really thoughtful there. Your distilled state really throws me off.) (Quasar)</p><br/><p>The Water God wasn’t given the due respect even when he was being considerate.</p><br/><p>(…There’s no problem. Juo tinkered with my body. So that using my power as a God won’t put a burden to my human body.) (Quasar) &lt;Please nerf Juo.&gt;</p><br/><p>(Is that possible?!) (Coacervate)</p><br/><p>(It was apparently a byproduct of when she was researching to revive Raphael though. She truly is a genius.) (Quasar)</p><br/><p>(But…that means…) (Coacervate)</p><br/><p>Coacervate notices the implication.</p><br/><p>(Quasar, did you tell your identity to your wife?) (Coacervate)</p><br/><p>(Yeah, before leaving to this battle.) (Quasar)</p><br/><p>Not only to his wife, but also to his little sister.</p><br/><p>(I didn’t feel like keeping anymore secrets to my family, you see.) (Quasar)</p><br/><p>The trigger to reveal his identity as a God to his important people was the death of Raphael.</p><br/><p>Shiva, who holds two identities as a God and a human, didn’t want to neglect one side by putting a label of which one was more important.</p><br/><p>(I was anxious thinking that maybe they would see me as a guy with problems in his head, but the two of them accepted me. Looks like the trouble that you people have been causing lately has served as my groundwork.) (Quasar)</p><br/><p>Thanks to that, he was able to cooperate with Juo in order to revive Raphael. And Hyue was also able to easily accept turning into a God Hero.</p><br/><p>(From now on, I will be living seriously as both the Wind God Quasar as well as the human Toreido Shiva. For the sake of that, I have to pull out the calamity here.) (Quasar)</p><br/><p>(Meaning that you have completely graduated from causing trouble to people on the whim of a God huh. I deeply agree with it!) (Coacervate)</p><br/><p>(When you say it, it is incredibly hard to accept though!) (Quasar)</p><br/><p>(I think it is fine~.) (Mantle)</p><br/><p>The Gods poured more and more divine power and strengthened the barrier.</p><br/><p>In the past, they belittled the humans, and even sealed the Dark God, but after 1,600 years, each of them have respectively settled their connections with the humans.</p><br/><p>Now, the only ones left who haven’t settled that connection are…the Light and the Darkness.</p><br/><p>*****</p><br/><p>“Uguah!!” (Ates)</p><br/><p>Ates was about to disappear into the light but was pushed back by something?!</p><br/><p>We heroes and Demon Lords couldn’t do anything but watch over it.</p><br/><p>“You can’t even escape anymore. Evil Light Goddess. The calamity that you tried to bring upon this world, I will put an end to it.” (Yorishiro)</p><br/><p>Yorishiro-sama says as if bringing down the judgment.</p><br/><p>Lucifer was already tattered and unable to move. I don’t think Ates has any way of winning anymore.</p><br/><p>The madness of the wicked Goddess has come to an end here.</p><br/><p>“Ates, I will seal you.” (Yorishiro)</p><br/><p>She says cold-heartedly.</p><br/><p>“Just like how the Dark God was sealed in the past. We are talking about you who has a weaker divine power compared to him, so even if the seal is going to be destroyed with time, it will most likely take several thousands of years. Be isolated for a close to an eternity.” (Yorishiro)</p><br/><p>“What’s…with those eyes?!” (Ates)</p><br/><p>The voice filled with hatred from Ates reverberated.</p><br/><p>That was a voice I wouldn’t believe is coming from a Goddess. It was already to a point I would only think of it as a vengeful ghost.</p><br/><p>“Are you looking down on me?! Even though you are me, you are planning on pushing all the ugly parts of you on me and leave yourself as the clean part?! You hypocrite!” (Ates)</p><br/><p>“…?”</p><br/><p>We heroes and Demon Lords that were cautious for any movement slightly further back were tilting their heads.</p><br/><p>“Are you saying you are the only one who has the rights of being loved by that person?! No! The only one that’s allowed to be loved by him is me! Me who would go as far as destroying the world for his sake! I am the only one!!” (Ates)</p><br/><p>“‘You are me’?!”</p><br/><p>“Could it be…!”</p><br/><p>The agitation that was spreading in the surroundings was taken advantage of by Ates.</p><br/><p>“Fine. Now that it has come to this, I won’t be able to achieve my objective. I admit it! …But!” (Ates)</p><br/><p>Ates runs off.</p><br/><p>Even though we were plenty on guard, we were unable to take immediate action.</p><br/><p>Because the direction Ates was running to was the direction we thought she would definitely not be running away from.</p><br/><p>To the one that is squirming in its light and spewing out darkness -to where Lucifer is!</p><br/><p>“Impossible! If she runs off there…!” (Karen)</p><br/><p>“She would be bathed by the darkness that Lucifer is gushing out!!” (Mirack)</p><br/><p>If what Lucifer is spewing out is dark matter itself…!</p><br/><p>There’s no way a living being would be able to resist something like that if it were to touch them!</p><br/><p>“Kyaaaaaaa!!” (Ates)</p><br/><p>And that’s what happened.</p><br/><p>Ates had run inside the darkness that had spread like a pond, and it was basically like jumping inside an ocean of acid.</p><br/><p>The smell of burning flesh was wafting along with the smoke it was making.</p><br/><p>Right now, that dark matter had no restraint. It is a different kind of dark matter from what Haine-san usually uses.</p><br/><p>It is hard to describe, but it felt as if it lacked emotions. As if it were just mindlessly devouring without a care of what it is.</p><br/><p>“Gyaaaaaaaaa!!! Aaaaaaahh!!” (Ates)</p><br/><p>“What a stupid thing to do! I will save you right this—!” (Karen)</p><br/><p>“Wait, Karen-san!!” (Yorishiro)</p><br/><p>Yorishiro-sama grabbed my arm as I was about to run to her.</p><br/><p>“It is already too late! If you go now, even you would be swallowed by that darkness!!” (Yorishiro)</p><br/><p>No way…</p><br/><p>What was Ates trying to do by jumping into something like that?!</p><br/><p>After seeing that her wish wouldn’t be granted…!</p><br/><p>Suicide?!</p><br/><p>“I won’t die by myself!!” (Ates)</p><br/><p>“?!”</p><br/><p>“This world…! This world that robbed me from my love, I will bring it down with me!! I will make this world pay for the sins it has perpetrated!! Even if my wish of being together forever with my beloved has been severed…!! This world alone, I will…!!” (Ates)</p><br/><p>…?!!</p><br/><p>A sound like that of an earthquake…!</p><br/><p>From Lucifer?!</p><br/><p>“Ates…you…!!” (Yorishiro)</p><br/><p>Yorishiro-sama seemed to be flustered.</p><br/><p>“She used her last authority as the creator of Lucifer to make the light of that monster go into a rampage. If it is the darkness that has lost its love and is clashing with the light, it will definitely try to match the rampaging light as well!!” (Yorishiro)</p><br/><p>“What in the world have you done?!” (Karen)</p><br/><p>“I don’t know if this is enough to destroy the world, but it should cause severe damage to it! At least, it should wipe out the present humans! Please fulfill my last wish! Lucifer!!” (Ates)</p><br/><p>Ates grins…in the embrace of a darkness that isn’t seeing her at all.</p><br/>\n</div>"}