{"title": "Chapter 408-409 - Joining forces", "id": 408, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-408-409-joining-forces", "volume_title": "Volume 5", "body": "<h1>Chapter 408-409 - Joining forces</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"></header></p><div class=\"entry-content\"><br/><p>“Kyahahahahahahahaha! Disappear world!! A world that brings me and him apart should just disappear!! Kyahahahahaha!!” (Ates)</p><br/><p>Ates was the one to be swallowed first by the darkness and disappeared from sight as she spread out a maddened laugh.</p><br/><p>Not even a single strand of hair was left. Sunnysol Ates was completely erased.</p><br/><p>“……”</p><br/><p>But we didn’t have the leisure of offering our condolences to her.</p><br/><p>Because we all might be following after her if we don’t do something.</p><br/><p>“Wait, the black thing that big guy is gushing out! It doesn’t show any signs of stopping! Rather, it is increasing in speed!!” (Celestis)</p><br/><p>“Don’t even try to touch it! That dark matter is like a super fiendish version of itself that doesn’t only erase divine power but also matter!!” (Mirack)</p><br/><p>“If something like that be gushed out without limit, the world would perish-dasu!!” (Sasae)</p><br/><p>The partially destroyed Lucifer has already turned into a sprinkler that spouts out dark matter.</p><br/><p>Divine power and matter were being swallowed widely and erased.</p><br/><p>Mirack-chan and the others in the surroundings were on guard as they witnessed that dark matter and were astonished.</p><br/><p>The end of the world.</p><br/><p>Since coming here, finally, we were feeling that danger in our skins.</p><br/><p>“[Holy Light Line]!” (Karen)</p><br/><p>I released light divine power to the dark matter.</p><br/><p>Normal dark divine power can’t defeat light, so this should erase the darkness, but…</p><br/><p>*Bakin!*</p><br/><p>The light was repelled by the darkness.</p><br/><p>“Don’t, Karen-san!!” (Yorishiro)</p><br/><p>Yorishiro got angry at me.</p><br/><p>“The dark divine power that is being gushed out via Lucifer is darkness that has lost the love of Entropy! It has lost the tolerance of ‘losing against light’ and has turned into the ultimate malice!!” (Yorishiro)</p><br/><p>And the light that served as its antithesis is now acting as a fuel that increases their force by clashing with each other.</p><br/><p>Until now, light had been like water that extinguishes fire for the darkness. But now, it has turned into oil.</p><br/><p>“And most of all, what’s worse is that…!” (Yorishiro)</p><br/><p>If light doesn’t work, just what in the world can we do to stop this darkness?!</p><br/><p>“What do we do?! At this rate, the world will really be swallowed by a darkness that no one can stop!!” (Mirack)</p><br/><p>“Lucifer itself is also being burned by that loveless darkness. When it reaches its limit, Lucifer will disintegrate and the darkness should naturally stop!” (Yorishiro)</p><br/><p>If we wait for that…!</p><br/><p>“We can’t!” (Michael)</p><br/><p>Michael joins the emergency meeting.</p><br/><p>“Even if that guy is different, it is still the strongest class of monster that holds the title of Demon Lord. On top of that, it has a humongous body. Leaving aside maintaining its life, if it is just maintaining its body, it should be able to endure for quite a long time the clash of light and darkness!” (Michael)</p><br/><p>“To the point that it would turn into a competition of whether the world or Lucifer will be dying first.” (Raphael)</p><br/><p>Raphael joins in.</p><br/><p>Everyone was trying to go against what is literally a threat to the world.</p><br/><p>“In that case, we have to act right this instant and stop that gushing of darkness as fast as possible!” (Yorishiro)</p><br/><p>“But how?!” (Karen)</p><br/><p>“That’s obvious!” (Yorishiro)</p><br/><p>Yorishiro-sama raises a voice filled with resolve.</p><br/><p>“There’s no doubt that the source of that darkness is Haine-san who is trapped deep inside Lucifer. We will break into the body of Lucifer and save Haine-san.” (Yorishiro)</p><br/><p>“?!”</p><br/><p>“If we sever the link Lucifer has with Haine-san, it should stop the gushing of darkness.” (Yorishiro)</p><br/><p>“But Yorishiro-sama…!” (Karen)</p><br/><p>Who would do something like that?!</p><br/><p>Jumping into the inside of Lucifer and digging out Haine-san would be the act of a daredevil!!</p><br/><p>“Right now, Lucifer is a literal mass of fiendish darkness! Entering Lucifer would mean that you would have to touch that darkness. That person would be erased without even reaching the count of ten!!” (Karen)</p><br/><p>“I will go.” (Yorishiro)</p><br/><p>Yorishiro-sama stepped forward.</p><br/><p>“I will save Haine-san even if at the cost of my life. I will stop that loveless darkness.” (Yorishiro)</p><br/><p>“Yorishiro-sama?!” (Karen)</p><br/><p>Could it be that she is looking for death?!</p><br/><p>“Karen-san, I leave the rest to you. The Light Church, Haine-san, and Doraha as well. If they are in your hands, I would have nothing to worry about.” (Yorishiro)</p><br/><p>I desperately tried to stop Yorishiro-sama.</p><br/><p>The darkness was already spreading close to our feet, but even with this hurry, I can’t let this person go!</p><br/><p>“Yorishiro-sama, don’t treat your life lightly! Haine-san wouldn’t want Yorishiro-sama to sacrifice herself!!” (Karen)</p><br/><p>“This is not only for the sake of Haine-san. The fate of this whole world is at stake. If that’s the case, Haine-san will definitely understand.” (Yorishiro)</p><br/><p>“But—!!” (Karen)</p><br/><p>“Karen-san!” (Yorishiro)</p><br/><p>Yorishiro-sama looked straight at me.</p><br/><p>Yorishiro-sama should be young and beautiful, and yet, for some reason, her expression looked like that of an old lady that had expended her whole life.</p><br/><p>“I have to take responsibility. The sins I have done in the long long path I have walked on, I have to atone for all of them right now.” (Yorishiro)</p><br/><p>“……What do you mean by that?” (Karen)</p><br/><p>I could feel a prickle inside my heart when I heard that voice of hers. Even without hearing those sins she speaks of, the pain of it was already reaching my heart.</p><br/><p>“It is okay for you to not know. It is something that you shouldn’t know. Please let me go without asking anything.” (Yorishiro)</p><br/><p>“No, I already know.” (Karen)</p><br/><p>I finally was unable to hold it in and spoke out.</p><br/><p>“Yorishiro-sama! You are the Light Goddess Inflation! You are also Inflation-sama!” (Karen)</p><br/><p>My words stirred the surroundings.</p><br/><p>“In the Underworld Country, we saw that the Light Goddess was split into good and evil.” (Celestis)</p><br/><p>“If Ates is the evil Inflation…!” (Mirack)</p><br/><p>“Yorishiro-sama should be the good Inflation-dasu!” (Sasae)</p><br/><p>Yorishiro-sama kept silent when I said that, but she soon spoke again.</p><br/><p>“…As I thought. But, since when?” (Yorishiro)</p><br/><p>“I had my suspicions before that, but it turned into certainty when I heard it -the conversation Yorishiro-sama had with Haine-san!” (Karen)</p><br/><p>It was right after Apollon City had welcomed the Demon Lords.</p><br/><p>I ended up eavesdropping from the door at the conversation of Haine-san and Yorishiro-sama.</p><br/><p>And there, I certainly did hear it.</p><br/><p>Yorishiro-sama is the incarnation of the Light Goddess.</p><br/><p>And that Haine-san is the incarnation of the Dark God Entropy.</p><br/><p>“Because Yorishiro-sama was cautious of anyone eavesdropping, you were speaking in soul transmission. But for some reason, I was able to hear it!” (Karen)</p><br/><p>“…Is that so. For the sake of turning you people into God Heroes, we opened up the channel between us Gods. Because of its influence, you were able to pick up the soul waves coming from us Gods huh.” (Yorishiro)</p><br/><p>Yorishiro-sama lets out a sigh as if in resignation.</p><br/><p>“Then you should understand, right? Ates is me. Ates’ sins are my sins. To atone for those sins as well as my own ones, I have to save Haine-san.” (Yorishiro)</p><br/><p>“Wrong! Ates was the bad one! Yorishiro-sama did nothing wrong!” (Karen)</p><br/><p>Yorishiro-sama treasured the humans as the Light Goddess.</p><br/><p>She provided humans with culture as the queen Izanami, punished the other Gods that obstructed this, and by creating ethereal, she pushed the progress of humans.</p><br/><p>Even when she became Yorishiro-sama, she helped out the humans from a variety of dangers!</p><br/><p>And yet…</p><br/><p>“I like Yorishiro-sama! That’s why, please don’t just leave like that! I don’t want Yorishiro-sama or Haine-san to disappear from my side!!” (Karen)</p><br/><p>“Karen-san…” (Yorishiro)</p><br/><p>Yorishiro-sama stands there absentminded.</p><br/><p>Even so, I understand.</p><br/><p>The cruel reality that, even if I were to stop Yorishiro-sama here, the situation will only continue to worsen.</p><br/><p>Is it too idealistic to want to save the world without the need to sacrifice anyone?!</p><br/><p>(Well said!!)</p><br/><p>Eh?</p><br/><p>What was that voice just now?!</p><br/><p>(Not sacrificing anyone! No matter how precarious the situation, you will try to overcome everything without paying a price!!)</p><br/><p>“Oi, this voice…!” (Mirack)</p><br/><p>“Lucifer?!” (Karen)</p><br/><p>“Lucifer spoke?!” (Celestis)</p><br/><p>That voice certainly came from Lucifer who was already at the point where his shape was warping.</p><br/><p>Different from the other Demon Lord-sans, Lucifer should just be a giant monster with no intelligence.</p><br/><p>Even though it hasn’t spoken a single thing until now that could be described as words…</p><br/><p>“No, could it be that this voice is…!” (Yorishiro)</p><br/><p>“Yorishiro-sama, did you notice something?!” (Karen)</p><br/><p>“This tone, this way of speaking; even if it is being spoken from a different mouth, there’s no way to mistake it!” (Yorishiro)</p><br/><p>?!</p><br/><p>No way, this is…!</p><br/><p>“Haine-san?!” (Karen)</p><br/><p>Haine-san is using Lucifer to speak with us?!</p><ul><li>409: The love of the darkness</li></ul><br/><p>(Thanks to you all cornering Lucifer, the path was finally connected.) (Haine)</p><br/><p>Is what Haine-san said through the mouth of Lucifer.</p><br/><p>“Haine-san! You were alright then!” (Karen)</p><br/><p>(Yeah, somehow! That voice must be from Karen-san, right? Great, looks like the sense of hearing also connected!) (Haine)</p><br/><p>What a relief! Haine-san is okay!!</p><br/><p>“Eh? Then Haine-dono is the Dark God Entropy-sama?!” (Hyue)</p><br/><p>“Read the mood.” (Celestis)</p><br/><p>Everyone is getting flustered, but at any rate, this is great!</p><br/><p>“Haine-san!” (Yorishiro)</p><br/><p>(Yorishiro, huh?) (Haine)</p><br/><p>Within us, Yorishiro-sama was the one who regained her calm the fastest.</p><br/><p>“If you are using Lucifer to speak, it must mean that you are controlling the nervous system of Lucifer with your dark matter, right?” (Yorishiro)</p><br/><p>(Yeah, just recently. Thanks to the damage dealt to Lucifer, the restraint loosened. But I can’t escape. The light divine power in the surroundings is eliminating the dark matter!) (Haine)</p><br/><p>I see…!</p><br/><p>Lucifer is in nature the Light Demon Lord.</p><br/><p>The darkness of Haine-san is different from the darkness that is rampaging via Lucifer.</p><br/><p>The darkness that Haine-san has proper control of is darkness that has the restriction of ‘losing against light’ that came from his love to the world.</p><br/><p>“Haine-san, right now, Lucifer is making the darkness it absorbed from you go berserk and spreading it to its surroundings! At this rate, the whole world will be covered with the loveless darkness!” (Yorishiro)</p><br/><p>(Loveless darkness, you say?! What is that?!) (Haine)</p><br/><p>“Can’t you sever the connection it has with the darkness from your side?! Right now, you are the very source of the world’s danger, you know?!” (Yorishiro)</p><br/><p>(…Even if you tell me that… No good. That Ates, it looks like she paid special attention in creating the area I am in. No matter what I try, I can’t get out. I can’t stop the extraction of darkness either. The most I can do is connecting with its senses!) (Haine)</p><br/><p>For Ates, the most important part was the cell of Haine-san.</p><br/><p>It would be obvious that she would do her very best so that he doesn’t escape!</p><br/><p>(Sorry everyone but, please lend me a hand!) (Haine)</p><br/><p>“As in?!” (Yorishiro)</p><br/><p>(Lucifer is not only making the darkness go berserk, it is doing the same to the light as well!) (Haine)</p><br/><p>Well, it is the Light Demon Lord after all!</p><br/><p>Right now, inside of Lucifer, the light and darkness are making a chaos as they rampage.</p><br/><p>And the light part inside of it is conveniently sealing Haine-san.</p><br/><p>(Please remove that light divine power by attacking it from the outside!) (Haine)</p><br/><p>“How can we do that…?” (Karen)</p><br/><p>“It is possible.” (Yorishiro)</p><br/><p>Yorishiro-sama moved on.</p><br/><p>“It is impossible to eliminate dark divine power with other elements, but if it is to eliminate light divine power, it is possible to do so by hitting it with other elements. Even if light does have an advantage against all elements, it is far inferior to that of darkness!” (Yorishiro)</p><br/><p>So if we were to hit the light with all the elements here, we have plenty enough chance to break it?!</p><br/><p>But right now, the area where Haine-san is, is covered with darkness. It is pretty easy to spot as the light pushing out the darkness is especially strong there.</p><br/><p>“But we have to do something about the darkness around first!” (Karen)</p><br/><p>“I will do it! The darkness might be reacting adversely to the contact of light, but it doesn’t mean it is completely immune to it. I will use all my light divine power to open up a path! In that moment, shoot in everything you got and break Haine-san free!” (Yorishiro)</p><br/><p>Yorishiro-sama’s eyes were shining with resolve. I could tell that she is planning on using her everything to assist us.</p><br/><p>I nod at Yorishiro-sama and return a strong gaze.</p><br/><p>(If the light that is hindering me disappears, I can get out of here and deal with the darkness. In the end, only darkness can control darkness after all!!) (Haine)</p><br/><p>“Understood!” (Karen)</p><br/><p>I am brimming with energy!</p><br/><p>“Everyone! This will be the last all out attack! Let’s destroy the light of Lucifer and save Haine-san!!” (Karen)</p><br/><p>““““““Yeaaaaah!!””””””” “-Dasu!!”</p><br/><p>The Demon Lords and the God Heroes raised a roar without caring about their their standings and race as they rush forward.</p><br/><p>This is the time to overcome everything and have everyone’s heart as one.</p><br/><p>Let’s regain the treasured peace in the world!!</p><br/><p>“Be ready!!” (Yorishiro)</p><br/><p>Yorishiro-sama began to channel her divine power into her hands. A massive amount of dazzling light shines, and then, begins to take form.</p><br/><p>“[Sacred Light Palms]!!” (Yorishiro)</p><br/><p>Two gigantic light hands appear and grab an area of the darkness. The fingers tried to pry open the darkness, but the darkness seemed to be showing much more resistance than expected.</p><br/><p>“Please open!!” (Yorishiro)</p><br/><p>Yorishiro-sama shouted as if pleading.</p><br/><p>The hands began to shine an even stronger light and the darkness began to give way.</p><br/><p>Before long, a small opening was made, and from it, light began to gush out of it. It was like a path of light.</p><br/><p>That small opening steadily became bigger and bigger, and…</p><br/><p>“Now!!” (Yorishiro)</p><br/><p>With that one shout, everyone immediately jumped into action with their already prepared attacks.</p><br/><p>First, me!</p><br/><p>“[Holy Light Blade]!!” (Karen)</p><br/><p>Next, the fire pair of Mirack-chan and Michael.</p><br/><p>“[Pleiades Burst]!!” (Mirack)</p><br/><p>“[Phoenix Hammer]!!” (Michael)</p><br/><p>Celestis-chan and Gabriel came in like a stream.</p><br/><p>““Double [Water Beheading Technique – Dragon Dance]!!”” (Celestis+Gabriel)</p><br/><p>Sasae-chan and Uriel with matching breaths.</p><br/><p>“[Slaughter Severing Slash]-dasu!” (Sasae)</p><br/><p>“Gyaa! Don’t go cutting my arm as well!! [Forbidden Dry Dhyana]!!” (Uriel)</p><br/><p>Hyue-chan and Raphael were literally one.</p><br/><p>“[Raphael Cannon]! We are going for another shot!” (Raphael)</p><br/><p>“Understood! Wind Gun Technique, [Tipping the Scales]!!” (Hyue)</p><br/><p>Light, fire, water, earth, and wind weaved into the opening of the darkness Yorishiro-sama created and exploded first in the gushing out light and quickly destroying the light divine power deeper in it.</p><br/><p>The more light divine power goes away, the more Haine-san can do.</p><br/><p>“The ones who will save this world from danger are the humans and monsters huh.” (Yorishiro)</p><br/><p>Yorishiro-sama spoke a little back from where we are.</p><br/><p>“That’s how it should be. This world is already for them both. I will just act as one of the people living in this world!” (Yorishiro)</p><br/><p>Yorishiro-sama shouts as the hands increase in strength.</p><br/><p>With this many Demon Lord and God Hero level attacks, most of the light divine power of Lucifer must have been eliminated.</p><br/><p>And yet, it is way too scary that the dark divine power around isn’t showing any signs of appeasing.</p><br/><p>“Or more like, it is flying around! The impact of the attacks is making the darkness scatter around!!” (Karen)</p><br/><p>“A bit can’t be helped! We have to solve this before the darkness covers the whole world!!” (Michael)</p><br/><p>We continue the barrage of attacks, scraping away on the light divine power, and finally, managed to reach all the way to the skin.</p><br/><p>In all that time, Yorishiro-sama’s light palms were receiving the shockwaves of those heavily powered attacks, but they were enduring steadfast as if saying they won’t budge.</p><br/><p>Soon, the attacks stopped and the light hands were already gone.</p><br/><p>With this, Haine-san should have been freed of his bindings!</p><br/><p>Even if we have blown away the light divine power, there’s still a massive amount of darkness remaining, so we can’t go save him directly.</p><br/><p>Please escape quickly, Haine-san.</p><br/><p>(………….)</p><br/><p>The darkness suddenly stopped gushing out.</p><br/><p>Not only that… The dark matter that was already out was returning to Lucifer? It is being absorbed?!</p><br/><p>“Warmth…returned to the darkness.” (Yorishiro)</p><br/><p>“Eh? What do you mean by that, Yorishiro-sama?” (Karen)</p><br/><p>Because the darkness was being used by Lucifer -or more like, Ates- the love of the darkness was gone, and even the weakness that’s supposed to be ‘weak against light’ was gone, and turned into a mindless danger that threatened to destroy the world.</p><br/><p>“The darkness right now is different. I can feel the same kindness of Haine-san from the darkness that Lucifer is releasing…” (Yorishiro)</p><br/><p>(Because I remade it.) (Haine)</p><br/><p>Lucifer spoke again —well, more like, Haine-san did.</p><br/><p>(Using the opening created from the partially destroyed body, and the reduction of light divine power, I took over its body by synchronizing with the dark matter coursing in its body. Right now, this guy is not the Light Demon Lord anymore.) (Haine)</p><br/><p>To put it in other words…</p><br/><p>(It is the Dark Demon Lord, Satan.) (Haine)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-406-407-four-gods-at-the-side\" id=\"prev_chap\" title=\"Chapter 406-407 - Four Gods at the side\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-410-411-dark-demon-lord\" id=\"next_chap\" title=\"Chapter 410-411 - Dark Demon Lord\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236411\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}