{"title": "Chapter 416-418 - The Earth since then", "id": 416, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-416-418-the-earth-since-then", "volume_title": "Volume 5", "body": "<h1>Chapter 416-418 - The Earth since then</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 416-418: The Earth since then</h4></header></p><div class=\"entry-content\"><br/><p>After being overwhelmed by the deep sides of Hydra Ville, Karen-san and I were heavily exhausted mentally.</p><br/><p>But we are expecting another heavy exhaustion ratio from the next place we are going to visit.</p><br/><p>Because we are planning on going to the Earth Church’s base that is Ishtar Blaze, the people that are specially crazy even within the Five Grand Churches.</p><br/><p>****</p><br/><p>“It has been a while, Earth Founder-sama.” (Haine)</p><br/><p>“Huh? Whatcha say?” (Oba-san)</p><br/><p>When we arrived at Ishtar Blaze, the first thing we did was give our greetings to the Founder.</p><br/><p>The Founder-sama of this place had a past record of being a hero which came with a certain sharpness with her, but…</p><br/><p>“IT HAS BEEN A WHILE! <span class=\"skimlinks-unlinked\">IT.HAS.BEEN.A.WHILE</span>~~!!” (Haine)</p><br/><p>“Aah. Ah ah, Nii-chan, it has been a while. Mah ears have completely gone bad, it been a pain.” (Oba-san)</p><br/><p>With the passing of four years, the past powerhouse has completely turned frail.</p><br/><p>When I met her for the first time, she was already a granny, but she was still plenty vigorous, and yet…when you think humans are plenty aged already, they can still get even more aged huh.</p><br/><p>“It has been tiresome lately ta sit in the Founder seat all day, ya see. I been telling ‘em to let me stop already, but the talk doesn’t seem to advance-ssa…” (Oba-san)</p><br/><p>“There’s no one who can take your place as Founder yet after all.”</p><br/><p>The one who entered our audience with the Founder was a tree person.</p><br/><p>The Earth Demon Lord, Uriel.</p><br/><p>“Uriel-san! It has been a while!” (Karen)</p><br/><p>Karen-san greets Uriel politely.</p><br/><p>“Yeah, it has been a while, Light hero-dono….. No, you are not a hero anymore, right.” (Uriel)</p><br/><p>“Yeah. As commemoration of graduating as a hero, I am going around the nations greeting everyone. Haine-san is coming with me.” (Karen)</p><br/><p>Uriel’s manners have already been polished so well that I could even tell just from normal conversation.</p><br/><p>This guy has already changed in these four years huh.</p><br/><p>“I been leaving everything troublesome of our Church ta Uriel-san-sa ne. That be why a senile granny like me can still manage as decoration.” (Oba-san)</p><br/><p>The eyes of the Oba-san were so narrow now that I can’t even tell if they are open or closed.</p><br/><p>They were a lot more open in the past…</p><br/><p>“A decoration can be done by anyone, and yet, they ain’t letting me quit. It be truly troublesome-sa ne.” (Oba-san)</p><br/><p>“It is because a person like you, who has both dignity and achievements, is standing at the top that everyone is able to leave a variety of things in the hands of a monster like me without any worries. What’s important is not intelligence and ability, but trust. You were the one who taught me that.” (Uriel)</p><br/><p>Saying this, Uriel places a shawl he made himself onto the Oba-san.</p><br/><p>“We need you to be in good health or we would be troubled. For the sake of the humans living in this nation, and for the sake of the monsters.” (Uriel)</p><br/><p>“I feel sleepy-sa ne.” (Oba-san)</p><br/><p>After that, the Oba-san didn’t say anything more, as if she had truly fallen asleep.</p><br/><p>******</p><br/><p>“According to the doctor, her heart has weakened.” (Uriel)</p><br/><p>While advancing through the Earth Church, Uriel speaks of the recent state of things.</p><br/><p>“She aged drastically last year, you see. She has been repeating words like ‘If I leave it ta everyone, I can be at peace’, ‘I be fine with dying anytime’. I can’t help feeling pained hearing that.” (Uriel)</p><br/><p>Uriel is a monster, but I could tell he was worrying about the aged Oba-san from the bottom of his heart.</p><br/><p>“We Demon Lords don’t actually have a lifespan. That’s exactly why I am scared of watching people dying and leaving them behind. I can’t help but feel respect towards the humans that live to their best and have achieved great things with the limited time they have.” (Uriel)</p><br/><p>From within the four Demon Lords that have separated and are working at their respective churches, Uriel is the one that is the most connected in the work of the Church.</p><br/><p>There was a reason for that…</p><br/><p>“I am the Earth Demon Lord, so I can make earth element monsters after all. And the Golems are closely tied to the livelihood of this nation.” (Uriel)</p><br/><p>That was the first reason why Uriel was brought to this nation after all. Moreover, it was practically forced.</p><br/><p>We passed by many people while we were walking, but every single one of them had bowed to Uriel.</p><br/><p>“Demon Lord-sama, Demon Lord-sama~!”</p><br/><p>“My gratitude, my gratitude~!”</p><br/><p>Is how it normally went.</p><br/><p>Their way of praising the Demon Lord was as if they were worshipping a God.</p><br/><p>“You are incredibly popular. Aren’t you even more popular than Mother Earth Mantle herself?” (Haine)</p><br/><p>“Please don’t say that. Who knows from where she is listening.” (Uriel)</p><br/><p>Is what Uriel says with a dry laugh.</p><br/><p>“Because of that Mother Earth Goddess, the humans here have been living together with Golems since long ago. Everyone already knows, but this nation is the one that has the longest history in humans and monsters helping each other out.” (Uriel)</p><br/><p>From within the monsters, the only ones who heard out the words of humans and worked were the Golems.</p><br/><p>Those Golems have been united by Uriel, and the people respect him deeply.</p><br/><p>“The subject at hand now is seeing how the harmony of humans and monsters will nurture. We are currently cooperating with the Wind Church to research ways to add an ethereal engine to the Golems.” (Uriel)</p><br/><p>“Why do something like that?!” (Haine)</p><br/><p>“The weakness of Golems is their natural speed and their inability to do precise work, so I thought about changing them as much as possible. Golems are just a mass of earth, so it is plenty possible to add a mechanical structure within it.” (Uriel)</p><br/><p>Golems that can fly in the sky like flying machines; Golems that can run through the land as if they were ethereal cars.</p><br/><p>“But most of all, as long as Golems are present, there would be no need for the ethereal mechanization that the humans have developed; that’s the thing I want to avoid. I considered the plan of having the humans lose the Golems for a brief period of time to introduce ethereal machinery, but they know that I can make Golems, so that plan was at an impasse.” (Uriel)</p><br/><p>To continue relying on Golems, or develop their civilization into that of the other nations; the Earth Church was heatedly discussing this.</p><br/><p>“It is no good to develop just one or the other. Monsters and humans; they have to grow together…” (Uriel)</p><br/><p>Uriel stops his feet.</p><br/><p>“That’s what she continues to claim…… Oi, Sasae!” (Uriel)</p><br/><p>The place Uriel had guided us to was a plaza.</p><br/><p>There, a voluptuous woman shouldering a big scythe was being surrounded by many boys and girls.</p><br/><p>“…Oya, the ones there, ain’t they Haine-niichan and Karen-neechan-dasu ka?!” (Sasae)</p><br/><p>That’s right. She is the earth hero Sasae-chan that has grown greatly in the span of four years.</p><br/><p>Her breasts and ass are all plump, and her height has also increased.</p><br/><p>There’s not a single shadow of her little girl figure of four years ago.</p><br/><p>“It has been a while, Sasae-chan.” (Karen)</p><br/><p>“It been just a short while-dasu yo! We met at the Light capital not that long ago-dasu ka!!” (Sasae)</p><br/><p>“True! I have been saying ‘it has been a while’ so many times that it ended up being a habit!!” (Karen)</p><br/><p>Is what the hero companions say as they hug each other.</p><br/><p>Sasae-chan was the youngest by a lot within the Legendary generation, so even after four years, she is still an active hero.</p><br/><p>Karen-san has retired just the other day, so she is the last active hero.</p><br/><p>In the light hero ceremony just the other day, Sasae-chan participated as a representative of the Earth Church.</p><br/><p>In the time we were going through Muspelheim and Hydra Ville, she had returned straight to Ishtar Blaze.</p><br/><p>“But really…no matter how many times I see you, you have really grown, Sasae-chan!” (Karen)</p><br/><p>Is what Karen-san says as she stares at Sasae-chan’s body intently.</p><br/><p>The first time we met Sasae-chan, she was around 12 years old, I think. She was at an age where a growth spurt was natural, but even with that, she grew more than anyone.</p><br/><p>Even the size of her boobs are in the high ranked side from the ones I have seen.</p><br/><p>In the past, when she fused with Mantle, she changed into a voluptuous woman of unbelievable proportions, but Sasae-chan managed to obtain a body similar to that one with time.</p><br/><p>“This is truly the nurturing ability of Ishtar Blaze.” (Haine)</p><br/><p>“But in my opinion, these be too big, and it be uncomfortable-dasu yo. And every time I meet Mirack-neechan, Celestis-neechan, and Hyue-neechan, they all fondle mah boobs-dasu. Also, Karen-neechan be fondling them in present tense-dasu.” (Sasae)</p><br/><p>“Eeh~? Because you know, with them being so splendid, wouldn’t you feel like touching them?” (Karen)</p><br/><p>Is what Karen-san says as she fondles those boobs that still had plenty to spare even when spreading her hand as wide as possible.</p><br/><p>I feel like the atmosphere will turn pink by just this alone.</p><br/><p>“If we are talking about the size of the boobs only, it doesn’t reach Yoneko-san’s yet. This is on a level where it would actually be rude not to fondle them. Isn’t that right, Haine-san?” (Karen)</p><br/><p>“If I say ‘yes’ here, will I be allowed to fondle them too?” (Haine)</p><br/><p>“I will have the Scorched Earth Annihilation corps arrest you.” (Karen)</p><br/><p>It was a trap!!</p><br/><p>Why does Karen-san always try to test me?!</p><br/><p>Is it because of love?</p><br/><p>I really don’t get it.</p><br/><p>“Or more like, Uriel is gone?!” (Haine)</p><br/><p>“That personage be really busy making Golems-dasu. We have ta let him have his time-dasu yo!” (Sasae)</p><br/><p>I think he simply ran away though…</p><br/><p>A trauma was edged into Uriel the very moment he met Sasae-chan, so he must still be afraid of her even now.</p><br/><p>“And so, Sasae-chan, what were you doing?” (Karen)</p><br/><p>“I was in the middle of teaching a variety of things to the children of the village-dasu yo! The way to use the scythe and Golems! They have ta learn properly both of these things-dasu!” (Sasae)</p><br/><p>So that’s why she is hanging out with the children in this plaza huh.</p><br/><p>“They all be the children of mah cousins, so they be blood related-dasu yo. Today be a babysitting day-dasu!” (Sasae)</p><br/><p>…..</p><br/><p>…Just a glance and I can tell that there’s more than a hundred here though…</p><br/><p>So this is the fertility of Ishtar Blaze huh.</p><br/><p>The earth hero family with the Founder Oba-san at the helm truly has a lot of children, but her grandchild Sasae-chan is the third generation. So if they are the children of her cousins, that would make this children the fourth generation.</p><br/><p>And they surpass the hundreds huh.</p><br/><p>It gets scarier and scarier!</p><br/><p>“Nii-chan~!”</p><br/><p>“It has been a while, Haine-niichan~!!”</p><br/><p>From within the children, there’s the twin daughters of Yoneko-san I have met before mixed in the group.</p><br/><p>Yoneko-san is also a grandchild of the Earth Founder-san, and would fall into the cousin category for Sasae-chan, so well, it wouldn’t be weird for these pair of twins to be here.</p><br/><p>“Yoneko-neechan be having an outing with the other mothers, so I be looking after ‘em-dasu. The next earth hero who will succeed me might be within them, so I have ta guide ‘em properly-dasu!!” (Sasae)</p><br/><p>“Sasae-chan…you have grown.” (Haine)</p><br/><p>In the past, Sasae-chan would rush forward on assumptions.</p><br/><p>Now, everyone has retired and she has become the oldest of the heroes, and her career as a hero has also grown.</p><br/><p>In the eyes of the heroes from the other churches, she must look like a reliable big sister.</p><br/><p>There’s the ones that grow old, the ones that mature, and the ones that are newly born.</p><br/><p>That’s the cycle of human life that has been repeated for more than a thousand years. And that’s really visible in this Earth nation.</p><br/><p>“When I come to this nation, I feel like I am being shown the reality of living.” (Karen)</p><br/><p>That was the honest opinion of Karen-san.</p><br/><p>It is true that, in this nation, no matter what kind of evolution the humans have done, you can feel that the roots of humanity still remain here.</p><br/><p>“We can’t lose! In order to live our best as humans, let’s marry as soon as possible and give birth to the next generation!” (Karen)</p><br/><p>“And obviously it turned into that kind of talk!” (Haine)</p><br/><p>Since the time her retirement was decided, Karen-san has been more frequent in those kind of topics!</p><br/><p>“Don’t be careless, Sasae-chan! Time passes by quicker than you can notice, so don’t let your chance to fall in love escape, okay?! Obtain both achievements as a hero and happiness as a woman!” (Karen)</p><br/><p>Karen-san was about to raise her fist with a ‘Yeaah!’, but Sasae-chan was dumbfounded.</p><br/><p>“Eh? Ya still haven’t been told-dasu ka? I thought that I had already told this to someone-dasu.” (Sasae)</p><br/><p>“Eh?” (Karen)</p><br/><p>“I will be marrying next month-dasu yo.” (Sasae)</p><br/><p>……</p><br/><p>……………………Eh?!</p><br/><p>“EEEEEEEEEHHH?!” (Karen)</p><br/><p>Karen-san was obviously shocked as well.</p><br/><p>“At the place I was doing my rounds at, I found a good hardworking husband, so I confessed immediately and got an ok-dasu! Life is short and I be a lady-dasu kara!!” (Sasae)</p><br/><p>Sasae-chan says with her chest puffed out.</p><br/><p>“I be told that we are both young and it be too soon, but looking at the customs of Ishtar Blaze, I would say it be close to a suitable age-dasu! Ah, even if I say I be marrying, there be no problems in continuing as hero-dasu! Sobo-chan be a precedent after all-dasu!” (Sasae)</p><br/><p>The current Earth Founder was a famous hero with the nickname of ‘Taker by the roots’.</p><br/><p>She was so strong that, even when it should be the norm to retire after marrying, she had continued as a hero until her daughters grew enough to be her successor.</p><br/><p>And so, Sasae-chan, who had fought through the biggest danger of the world that was the Demon Lord battle, had become a new legend that was said to surpass that Taker by the roots.</p><br/><p>It is exactly because it is Sasae-chan that they will probably not only allow her to continue as a hero after marriage, but maybe even after giving birth!</p><br/><p>“Well, there’s a lot of things I want to retort about though!” (Haine)</p><br/><p>Even when humans have reconciled with monsters, the hero system still serves as a big role for the church as their face.</p><br/><p>It looks like, within that hero system, the long long legacy of Sasae-chan was about to begin.</p><ul><li>417: The Wind since then</li></ul><br/><p>A few days more after the shocking happenings at Ishtar Blaze.</p><br/><p>We were heading to the next place, the Wind capital, Rudras Metropolis.</p><br/><p>When talking about Rudras Metropolis, the first thing that comes to mind is the Wind Church that’s the most advanced ethereal technology research, and thanks to that advancement, the city itself is on top of a gigantic mobilization device.</p><br/><p>They don’t stay in one place, and if need be, they can move their whole city together with them.</p><br/><p>Of course, there’s terrain limitations in that they can’t cross deserts or seas.</p><br/><p>……It has been four years since then.</p><br/><p>*********</p><br/><p>“…It is floating.” (Karen)</p><br/><p>“…..It is indeed floating.” (Haine)</p><br/><p>We were dumbstruck by the panoramic view we had of Rudras Metropolis.</p><br/><p>Dumbstruck by the full portrait of Rudras Metropolis that has changed to a point that our understanding can’t catch up.</p><br/><p>The moving city that was the amalgamation of their ethereal technology was now floating in the sky.</p><br/><p>I don’t know what’s the deal with that, but it is flying in the sky.</p><br/><p>A whole city was floating at a pretty high altitude.</p><br/><p>The moving city of Rudras Metropolis had now become the flying city of Rudras Metropolis.</p><br/><p>*****</p><br/><p>“Haine! And also Karen-dono! It is an honor to see you here!!”</p><br/><p>Since we are riding flying machines, we could easily enter the place.</p><br/><p>When we lower at a place that seems to be a space specially for takeoffs and landings of flying devices, the Wind Founder, Toreido Shiva was waiting for us.</p><br/><p>“Why is it flying?!” (Haine)</p><br/><p>It had been a while since we met again, but the first thing that came out flying from my mouth was that.</p><br/><p>Because there’s no way not to.</p><br/><p>Why is a city flying?</p><br/><p>“……Well, to tell you the truth, we had plans of remodeling Rudras Metropolis since a good while ago, but…” (Shiva)</p><br/><p>It is impossible to cross mountains and seas after all.</p><br/><p>Everything they pass through would be mowed down by the city after all.</p><br/><p>That’s why, I can understand that, rather than using tires to move, it would be more convenient to fly in the sky.</p><br/><p>But…!</p><br/><p>“Didn’t you say that it would take at least a decade to actually make it come true?! Why did the estimated time get reduced by more than half?!” (Haine)</p><br/><p>“Hahahaha. You could say this is the true power of our Wind Church.” (Shiva)</p><br/><p>Even when I was shaking him by the collar, Shiva was filled with composure.</p><br/><p>“Ethereal technology is always in constant progress. It is not strange for it to be possible to do what we couldn’t do yesterday. That progress at times can advance time of other things even more.” (Shiva)</p><br/><p>Advance time.</p><br/><p>“Well, this flying city still has many issues we have to solve. The biggest of them is the energy issue. Its continuous flying time is limited. A practical flying city is still a thing of the future.” (Shiva)</p><br/><p>Also, it seems to be weak to bad weather.</p><br/><p>That’s a problem that one can easily arrive to if they were to think a bit though.</p><br/><p>“In the first place, the reason why we made Rudras Metropolis into a moving city was because we wanted to make our location unknown by constantly moving, so that we could hide from the other churches. We could get a strategic advantage against the opposing churches in the past after all.” (Shiva)</p><br/><p>“But there’s no need for that anymore. The Five Grand Churches have gotten along incredibly well after all!” (Karen)</p><br/><p>Shiva nodded at the remark of Karen-san.</p><br/><p>“That’s right. That’s why this flying city is not for past grudges, but for friendship.” (Shiva)</p><br/><p>“Meaning?” (Haine)</p><br/><p>“In the future, we will have the floating Rudras Metropolis be connected to the other four capitals by something like a wire, and with that, we can make a ropeway of sorts to come and go. We will make Rudras Metropolis into a communication center that connects the whole world together!” (Shiva)</p><br/><p>What a big dream.</p><br/><p>That edge of Shiva that was so sharp it would cut anyone close to him had reduced as time went on.</p><br/><p>It is as if his fangs have been trimmed.</p><br/><p>Is this also because of time?</p><br/><p>“Aniue-sama, you were still here-de gozaru ka?”</p><br/><p>The moment I felt the conversation would lengthen, a reproachful voice rang at my back.</p><br/><p>“Hyue-chan!!” (Karen)</p><br/><p>The little sister of Shiva and previous wind hero, Hyue, had appeared.</p><br/><p>As a comrade of hers that went through harsh battles together, Karen-san hugs Hyue without any restraints.</p><br/><p>“I came here worried because you weren’t coming back no matter how long I waited, and what I find here… Aniue-sama, what’s your idea of having guests standing here in the open? We of the Wind Church will be known as people who don’t know how to receive our guests, you know?” (Hyue)</p><br/><p>“Ah, sorry. I got excited talking about this flying city. I ended up rambling on.” (Shiva)</p><br/><p>“I also wanted to welcome Karen-dono properly. It is incredibly inconvenient that someone has to watch over the flying engine at all times-de gozaru.” (Hyue)</p><br/><p>“Right! Why is Hyue here?! Why did you leave the flying engine alone while it is still activated and came here?! The flying engine is still incomplete, and the floating limit is 30 minutes, you know?!” (Shiva)</p><br/><p>It can only last that long? That’s short.</p><br/><p>“I know. That’s why…” (Hyue)</p><br/><p>Our footing seemed to be shaking.</p><br/><p>“We are preparing to land-de gozaru.” (Hyue)</p><br/><p>From the speakers of the deck, a noisy announcement resounded.</p><br/><p>{Prepare to land! Prepare to land!}</p><br/><p>{We will be cutting off the energy of the flying engine and landing on the ground.}</p><br/><p>{Residents, please brace yourself for landing! Hold onto the security handrails at your vicinity, and please secure safety!!}</p><br/><p>{10 more minutes! 5 more minutes for landing! 3 minutes!!}</p><br/><p>What an incredible ruckus!!</p><br/><p>Looks like there still the need for more time before humanity can take the skies.</p><br/><p>*****</p><br/><p>While making a big *zushiiiiin!* noise, Rudras Metropolis landed.</p><br/><p>Because of that, a big ruckus like that of a toy box being flipped over was made, and we who were at the outer edge of the city were on the brink of being thrown out.</p><br/><p>“Don’t fly again until you make proper improvements in your facilities!!” (Haine)</p><br/><p>“It is not as if we fly regularly. We did a special exception today in order to welcome you guys.” (Shiva)</p><br/><p>So you made it fly when we came?!</p><br/><p>That’s troublesome for us, but more than that, it makes me feel as if we were causing trouble to the populace of Rudras Metropolis, so please don’t do that again!</p><br/><p>“It has been a while, Hyue-chan. What have you been doing after retiring from being the wind hero?” (Karen)</p><br/><p>Karen-san was going at her own pace, or more like, even after that messed up event, she was prioritizing her own curiosity.</p><br/><p>Karen-san and Hyue had a tight connection as fellow heroes.</p><br/><p>Hyue was the one who was the latest in joining the ranks of hero within the Legendary generation, but she was older than Sasae-chan in terms of age, so she has retired as a hero recently.</p><br/><p>Really, I wonder what she has been doing lately.</p><br/><p>“I have been appointed as the boss of the Kazama Shinobis.” (Hyue)</p><br/><p>“Eh?”</p><br/><p>Aren’t the Kazama Shinobis the organization that serves as the military force of the Wind Church? Like the Aurora Knights of the Light Church.</p><br/><p>Heroes serve as the fighting strength of the church as well as their standard bearer, so their roles were basically to keep order of the military forces in their respective nation.</p><br/><p>“Does that mean Hyue has retired as a hero and is now in a behind-the-scenes position?” (Haine)</p><br/><p>“No, that’s not it.” (Shiva)</p><br/><p>Shiva joined in the explanation.</p><br/><p>“It has been decided that the Kazama Shinobis will be dividing in two. The division that will be specializing in armed might, and the other that will be specialized in information gathering.” (Shiva)</p><br/><p>“These two were originally one. The Kazama Shinobis were heavily different from groups like the Aurora Knight corps to begin with, but now that the wars are over, and being friendly with other churches is prioritized nowadays, there were opinions here and there that said they didn’t want to show a dirty image-de gozaru.” (Hyue)</p><br/><p>“In this era where disputes are gone, you could say that the importance for information has increased even more. And so, by separating those areas from the Kazama Shinobis, the newly remade information gathering of the Kazama Shinobis was born.” (Shiva)</p><br/><p>Hyue and Shiva explain alternately.</p><br/><p>“The remaining military force of the Kazama Shinobis has taken the name of Whirlwind Raid corps it originally had from the Church. We left the command of them to the newly appointed wind hero. In that sense, you could say that the information division Hyue is taking charge of is the real Kazama Shinobis though.” (Shiva)</p><br/><p>“Ooh! That’s impressive, Hyue-chan! It is like the boss of a spy division?!” (Karen)</p><br/><p>Where did Karen-san learn that word?</p><br/><p>“My objective is to be of help to Aniue-sama so, no matter what form it changes to, it is a blessing to be of use to the people of the Wind nation as well.” (Hyue)</p><br/><p>Hyue says in an admirable manner.</p><br/><p>“Ah, now that I think about it, there’s something I remembered in regards to the information gathering. Haine-dono…” (Hyue)</p><br/><p>“Yes?” (Haine)</p><br/><p>“There’s this Frost guy that entered the Light Church at the same period as Haine-dono, right-de gozaru?” (Hyue) &lt;Wow, I thought author forgot about him.&gt;</p><br/><p>Ah, now that she mentions it…</p><br/><p>Entering the Light Church at the same period as me, and stationed at the cafeteria because of a weird exam. My post was changed soon after, so I haven’t spoken much with Frost after that.</p><br/><p>I thought he was still doing his best in the cafeteria though.</p><br/><p>“He was a member of the Kazama Shinobis-de gozaru.” (Hyue)</p><br/><p>“Eeeeeh?!” (Haine)</p><br/><p>I didn’t know at all!</p><br/><p>“At those times, the churches had friction with each other, so in order to grasp the inside state of the other side, we forged the identity of many and had them infiltrate the church as commoners-de gozaru. But now that times have changed and there’s no need for spies anymore, many have been released and have returned-de gozaru. But…” (Hyue)</p><br/><p>-De gozaru, but…?</p><br/><p>“Only Frost refused returning, and stayed in the Light Church-de gozaru. He said he got a wife there and can’t leave the place.” (Hyue)</p><br/><p>A wife? Wait, don’t tell me…the amazon of the Light cafeteria…Regine-san?</p><br/><p>“The current Kazama Shinobis may be an intelligence gathering division, but it is not as if we steal information from opposing forces now. We simply gather information legally, and analyze it. Because of that, I want to inform you guys as members of the Light Church-de gozaru.” (Hyue)</p><br/><p>“I see. Thanks…” (Haine)</p><br/><p>“If you meet Frost there, please give him my regards-de gozaru. Tell him that there’s no need to think of his former home and protect his own family.” (Hyue)</p><br/><p>I feel like she said an incredibly big secret as if nothing at this late of a time.</p><br/><p>Rather than the secret that only a few people know, I was more shocked by the fact that Frost managed to conquer Regine-san.</p><br/><p>Looks like a lot happened since then.</p><br/><p>(…Oi.)</p><br/><p>With those short words, I was brought back to reality. It looks like several armor parts were flying around in my sight.</p><br/><p>Those parts combined in mid-air and made a human shape…</p><br/><p>“Raphael! You are still rocking that style?” (Haine)</p><br/><p>By using his special ability of changing his cells into insects, he can divide and combine as many times as he wants, so by entering an armor set, he can freely fly around.</p><br/><p>For a period of time, he had no choice but to rely on the armor as a shell, but he has regained his strength now, and there’s no need for the armor to serve as shell…</p><br/><p>“Isn’t that fine? And also, don’t call it a style! You may not know, but I am pretty popular among the children. I got a big cheering not that long ago.” (Raphael)</p><br/><p>Popular with the kids?</p><br/><p>“More importantly…I was wondering why you guys haven’t come at the stipulated time, so I came to check, and here I see this pitiful sight. Shiva and Hyue, you guys haven’t finished the work you have today, right?” (Raphael)</p><br/><p>“Tch. These few years, you have become a demon that stresses the schedule times…” (Hyue)</p><br/><p>“Huh? Who do you think has made the technology progress drastically in the Wind Church? It is because I am using all of my separated insect cells for parallel thinking, and am able to simulate several scenarios in an instant, right?” (Raphael)</p><br/><p>Eh?</p><br/><p>Raphael has been doing that?</p><br/><p>“Raphael is basically a living nano computer of this Rudras Metropolis now, and is respected by everyone-de gozaru yo.” (Hyue)</p><br/><p>I really don’t understand what she is saying.</p><br/><p>“And such an important person like I is being used as an errand boy, you know? ……Kuromiya Haine, and also Karen.” (Raphael)</p><br/><p>““Y-Yes?!””</p><br/><p>I got surprised by the sudden call of my name.</p><br/><p>“There’s still someone who wants to meet you guys. I will guide you to that person.” (Raphael)</p><br/><p>““W-What?””</p><br/><p>A person that wants to meet us?</p><br/><p>Who is that?</p><br/><p>“…Well then, I will be returning to work-de gozaru.” (Hyue)</p><br/><p>Hyue immediately ran away for some reason?!</p><br/><p>“I will go as well.” (Shiva)</p><br/><p>“Wait-de gozaru. Aniue-sama has even more work piled up than me-de gozaro. You activated the flying engine just to welcome Haine-dono and Karen-dono, so there should be plenty complaints from the pertinent areas regarding that-de gozaru.” (Hyue)</p><br/><p>“Wait, Hyue! I will go with Haine and the others! Because my cute treasure is there~~!!” (Shiva)</p><br/><p>Even though Shiva was desperately pleading, he was powerlessly dragged away by Hyue.</p><br/><p>Really, who are we meeting?</p><br/><p>“Ah, damn it…… Haine!” (Shiva)</p><br/><p>“Hm?” (Haine)</p><br/><p>“For now, let’s meet at that place.” (Shiva)</p><br/><p>“Yeah, at that place.” (Haine)</p><br/><p>And so, in this way, Shiva was dragged by his little sister, and led to his working place.</p><ul><li>418: Future heroes</li></ul><br/><p>Continuing our stay at Rudras Metropolis.</p><br/><p>After finishing our greetings to Shiva and Hyue, we were being guided to another place.</p><br/><p>The one guiding us is none other than Raphael.</p><br/><p>“……”</p><br/><p>“…..”</p><br/><p>“Uhm…” (Karen)</p><br/><p>The silence while we were moving was painful.</p><br/><p>Karen-san valiantly tried to make conversation, but she was unable to find a topic, and silence fell back.</p><br/><p>Within the Demon Lords, Raphael was the Demon Lord that we fought the most fiercely with.</p><br/><p>We tried to erase him one-sidedly before even giving him any chance to see what path he would be taking, and with that as the trigger, a battle of hatred was created.</p><br/><p>The one who received that hatred and solved it was Hyue.</p><br/><p>That’s why, after Raphael came back to life, he was able to take residence in Rudras Metropolis with not much issue in living together with humans just like the other Demon Lords.</p><br/><p>Humans and Demon Lords; even if the ill feelings between races is gone now, I personally still feel awkward when with Raphael.</p><br/><p>“Uhm…”</p><br/><p>“Don’t try to be considerate.” (Raphael)</p><br/><p>Raphael said straight.</p><br/><p>“Even if the reconciliations of humans and Demon Lords is progressing well, it doesn’t mean we have to force ourselves to get along. Kuromiya Haine, our first meeting was the very definition of a battle to the death. Being able to have friendly chats with memories like those would be pushing it.” (Raphael)</p><br/><p>It was a cold attitude.</p><br/><p>“B-But…” (Karen)</p><br/><p>Because of her personality, Karen-san tried to push on, but Raphael stops it with his hand.</p><br/><p>“What’s important is not the past, but the future. Seeing that child, I learned that, in order to create a path to the future, there’s the need for the new generation that doesn’t know of the past grudges.” (Raphael)</p><br/><p>“That child?” (Karen)</p><br/><p>“When you see for yourself, you will understand.” (Raphael)</p><br/><p>Looks like we arrived at the destination.</p><br/><p>We even used a car in the middle of it, and after entering a big house, we crossed a corridor, and entered a room.</p><br/><p>The place we arrived at was an incredibly noisy space.</p><br/><p>“Ooh, you are finally here!”</p><br/><p>“To make us wait, you guys have grown cocky huh.”</p><br/><p>“Well, they are actually a big deal, you know. They are the legends that saved the world after all.”</p><br/><p>“Fuhihi… Truly normies.”</p><br/><p>These people…!</p><br/><p>“Previous heroes?!” (Haine)</p><br/><p>“Mirack and the others retired, so we can’t be considered previous heroes anymore though.” (Kyouka)</p><br/><p>Mirack’s predecessor, Abi Kyouka-san; Celestis’ predecessor, Ra Sarasa-san; Sasae-chan’s predecessor, Iemon Yoneko-san; and the problematic wind hero that came before Hyue, Brastor Juo.</p><br/><p>Excluding the Light Church, we are in the presence of all the heroes of two generations ago.</p><br/><p>…It is a pain to call them in a new way, so let’s just call them previous heroes collectively.</p><br/><p>“Now that I think about it, it was strange that, no matter what nation we were in, we didn’t meet any of the previous heroes. So you were all gathered here?” (Haine)</p><br/><p>Is what I said with confusion and surprise.</p><br/><p>“Yeah. Since the heroes battle, we have gathered here regularly to have chats.” (Kyouka)</p><br/><p>“This time, it coincidentally overlapped with your visits.” (Sarasa)</p><br/><p>“Saying it be a coincidence be dishonest~.” (Yoneko)</p><br/><p>And everyone began to speak their piece.</p><br/><p>“Actually…we arranged this meeting beforehand. We all wanted to meet you at the same time, you see…” (Juo)</p><br/><p>The bride of the Wind Founder, Juo-san, said.</p><br/><p>Looks like she is taking care of her skin lately, her attire and hair look refreshing, making her outward appearance beautiful.</p><br/><p>“That’s a gesture that makes me incredibly happy.” (Karen)</p><br/><p>Karen-san walks forward before me.</p><br/><p>“When I see everyone gathered, it reminds me of the heroes battle. That was the trigger for the five Churches and the heroes to completely unite.” (Karen)</p><br/><p>‘Harmony between the churches is an unreachable dream’, that’s how badly the previous heroes of that time got along.</p><br/><p>It is true that this event served as an opener for the new era. It may not have been on the level of changing the whole world, but it was a moment that changed society heavily.</p><br/><p>And after that, the previous heroes were the biggest help to the current ones in the battle against the Demon Lords.</p><br/><p>“In the past, we acted as if looking down on the heroes of other churches proved our own worth.” (Kyouka)</p><br/><p>“To think we would be getting along so well now. Remembering the past actually makes me feel embarrassed.” (Sarasa)</p><br/><p>“It would be great if, not only us, but our husbands were ta get along with each other as well~. It would influence the economy of the churches after all.” (Yoneko)</p><br/><p>“The hotel chain that Kyouka’s husband manages; the mercantile enterprise of the family Sarasa married into; Yoneko’s husband, because of his connection with the Earth Church, is the most influential member of the congress. Thanks to everyone working as middlemen, my husband has been helped out a lot…” (Juo)</p><br/><p>“What are you saying, Juo?” (Kyouka)</p><br/><p>“Your husband is the biggest fish out of all of them.” (Sarasa)</p><br/><p>“He be the Wind Founder after all~. Yer the biggest gold digger here~.” (Yoneko)</p><br/><p>Everyone laughs with a cheerful ‘Ahahahaha!’.</p><br/><p>These people have changed so much it is shocking.</p><br/><p>“Now that they mention it, this is Shiva’s house huh. No surprise it is extravagant, being the house of a Founder and all.” (Haine)</p><br/><p>And it is a suitable place for Juo-san and her friends to gather.</p><br/><p>I feel really constricted being the only man here invading a home party of housewives!</p><br/><p>“…Light hero, Karen. Congratulations on your retirement as a hero.” (Kyouka)</p><br/><p>“We called you here today because we wanted to tell you that. You have been a truly great help to us after all.” (Sarasa)</p><br/><p>Inviting Karen-san and I to take a seat around the table, the previous heroes offer us tea.</p><br/><p>With four years passing by, the young beauties of before are now completely giving off the presence of wives.</p><br/><p>“N-No really… I wasn’t that big of a help…!!” (Karen)</p><br/><p>Karen-san quickly grew modest.</p><br/><p>“You really were, you know. You were the one who stood at the foremost in the battles.” (Sarasa)</p><br/><p>“The reason why we can be here together be because of yer hard work.” (Yoneko)</p><br/><p>“There’s someone we want to introduce you to.” (Kyouka)</p><br/><p>Someone they want to introduce?</p><br/><p>“…It is okay now, Raphael. Bring them all here.” (Juo)</p><br/><p>Juo-san says, and the door of the room opened up with a bang, and right after, critters began to pour in.</p><br/><p>—Is what I thought, but that wasn’t the case.</p><br/><p>What I thought were small critters were actually normal humans.</p><br/><p>But they were incredibly small and young. Four children that are around 2-3 years old.</p><br/><p>Following them was Raphael who was making metallic noises as he entered the room.</p><br/><p>And here I was wondering where he had gone to.</p><br/><p>“You people…make it so we can enter quicker. I know it was to give them a surprise, but…” (Raphael)</p><br/><p>What’s with these children?</p><br/><p>They were going ‘wai~’ ‘kya~’ as they head towards the feet of a respective previous hero.</p><br/><p>There’s four previous heroes; four children in total appeared.</p><br/><p>Could it be…</p><br/><p>“Raphael-san, thanks for looking after these children.” (Sarasa)</p><br/><p>“If you are going to learn of humans, try properly learning how to babysit. It was a nice experience, right?” (Kyouka)</p><br/><p>Is what Kyouka-san says as she holds up one of the children.</p><br/><p>That child had similar skin color and hair color to that of Kyouka-san. The other children that the other previous heroes held up had similar resemblances.</p><br/><p>There no doubt about it.</p><br/><p>“No, impossible impossible impossible. Human children feel like they would break just by touching them a bit. That just makes it too scary to deal with them. More so when the children themselves do dangerous things on their own. I just can’t get a rest. It is too much for me.” (Raphael)</p><br/><p>“All children be like that. Human women be pushed around by those kids and manage to raise them, so it should serve as nice experience for Raphael-san~.” (Yoneko)</p><br/><p>Karen-san and I were beginning to feel left out, so I decided on asking.</p><br/><p>“Uhm…sorry but, who are these children?” (Haine)</p><br/><p>“You can tell just by looking, right? They are our children.” (Kyouka)</p><br/><p>Right.</p><br/><p>They are the children that each of those four had raised inside themselves and gave birth to.</p><br/><p>Yoneko-san was already the mother of three four years ago, so this one must be her fourth.</p><br/><p>She must have matched her friends and gave birth to more.</p><br/><p>“We were made to fight in the Demon Lord battle even when we had retired heroes already after all.” (Sarasa)</p><br/><p>“We were not allowed to have a child until the Demon Lord battle calmed down.” (Kyouka)</p><br/><p>“The reason why we could give birth to these children and raise ‘em be because Karen-san and the others managed to put an end to the battle~.” (Yoneko)</p><br/><p>“That’s why…we are truly grateful.” (Juo)</p><br/><p>The children look to be around three years old, and the Demon Lord battle finished four years ago, so…just calculating it feels embarrassing…</p><br/><p>“Ah, also, Shiva said he wanted to come with us…” (Haine)</p><br/><p>“Papa is enamored with our child after all…” (Juo)</p><br/><p>Juo-san held up the obedient child that resembled her.</p><br/><p>I see…so Shiva tried to use us as a chance to meet her child.</p><br/><p>“Uhm…everyone’s children? Then…” (Karen)</p><br/><p>Karen-san asks shyly, and the mothers respond in order.</p><br/><p>“As you can tell, they are all girls.” (Kyouka)</p><br/><p>“Kyouka-san’s child is so much of a tomboy that I wonder at times if she is actually a boy though.” (Sarasa)</p><br/><p>“Being energetic be a good thing~. But with such a coincidence in genders, I feel fate at work here~.” (Yoneko)</p><br/><p>“They were born at the same exact year…and they are all girls. With these much matching, in time, they will most likely…” (Juo)</p><br/><p>““““All become heroes together.””””</p><br/><p>“…Such a thing might actually happen.” (Kyouka)</p><br/><p>“That would be a dream-like situation.” (Sarasa)</p><br/><p>“Would be around 10 years from now. By that time, I’m sure Sasae-chan should have retired~.” (Yoneko)</p><br/><p>“Friendly heroes.” (Juo)</p><br/><p>Hearing this, Karen-san’s expression brightened more than anyone else.</p><br/><p>“Waah! That sounds great!!” (Karen)</p><br/><p>With the Demon Lord battle reaching an end, monsters are not enemies of humanity anymore.</p><br/><p>That’s why there’s no enemies for the churches to fight anymore, and the heroes have remained as simply the face of the church.</p><br/><p>As long as the five Churches remain, heroes will continue to exist.</p><br/><p>With many more successors to come.</p><br/><p>“Well, if I were to mention a problem, it would be that we would be missing the Light one from the five Grand Churches.” (Kyouka)</p><br/><p>“That’s why, isn’t that where Karen-san has to do her best in?” (Sarasa)</p><br/><p>“Ye have retired already, so yer duty now be the same as us~.” (Yoneko)</p><br/><p>“Give birth to the next generation and raise them. The birth of a new light hero depends on you.” (Juo)</p><br/><p>What are you people inducing to the recently retired hero?!</p><br/><p>“To think that everyone was having so much expectations in me…! Understood! For the sake of a bright future, I myself will give birth and raise the person that will carry on the next generation!! Isn’t that right, Haine-san?!” (Karen)</p><br/><p>“And we go full circle!” (Haine)</p><br/><p>I was expecting it already, geez.</p><br/><p>“W-Well…that’s how humans have passed on their will in the more than thousands of years. Seeing the sight of you all like this, I can truly experience the reality of that.” (Haine)</p><br/><p>It took my all to say this as I drank tea, so that I could at least dilute the situation a bit.</p><br/><p>“That’s right. Humans have loved each other, gave birth to the next generation, and in that way, we have continued existing for thousands of years.” (Kyouka)</p><br/><p>“Haine-san, you can’t slack on that duty. Men think of no one else other than themselves unless they are expressly told by someone else after all.” (Sarasa)</p><br/><p>And yet, they are now ganging up on me!</p><br/><p>This is hella embarrassing! This calls for a strategic retreat!! I must escape from the premises!!</p><br/><p>“N-Now that I think about it, that was unexpected! To think Raphael would act as a babysitter!” (Haine)</p><br/><p>“Don’t go trying to change the topic so blatantly.” (Raphael)</p><br/><p>Raphael completely saw through my intention.</p><br/><p>“But…didn’t I tell you before? That my technique can grasp the heart of the children.” (Raphael)</p><br/><p>“Grasp the heart of the children?” (Haine)</p><br/><p>“Watch and marvel.” (Raphael)</p><br/><p>As soon as he said this, he separated the armor parts that constitute himself, and begins to fly around the room.</p><br/><p>And then, he once again combines, and makes a pose!!</p><br/><p>“Waai~~!!”</p><br/><p>“Rafa-chan, so cool~!!”</p><br/><p>“One more time! Do it one more time~!!”</p><br/><p>“Do it again holding a rifle and a sword~~!!”</p><br/><p>Cheers from the children were flowing out?!</p><br/><p>“How’s that?” (Raphael)</p><br/><p>“Well, it was indeed decently cool even in my eyes, so…” (Haine)</p><br/><p>It must have been quite shocking for the children.</p><br/><p>“But I thought those kind of things would make boys happier than they do for girls though.” (Karen)</p><br/><p>The opinion of Karen-san is valid.</p><br/><p>The little girls that have inherited the blood and talent of the previous heroes; being able to cope with something like this must mean that they really do have the aptitude to become heroes in the future.</p><br/><p>The kind of girls that like sword fights more than playing with dolls.</p><br/><p>“By the way, Raphael…” (Juo)</p><br/><p>The lady head of this household, Juo, speaks.</p><br/><p>“Dividing and combining indoors is dangerous, so from here on, do so outside.” (Juo)</p><br/><p>“Yes, sorry.” (Raphael)</p><br/><p>And in this way, the life of humans is passed on.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-414-415-the-fire-since-then\" id=\"prev_chap\" title=\"Chapter 414-415 - The Fire since then\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-419-420-the-light-since-then\" id=\"next_chap\" title=\"Chapter 419-420 - The Light since then\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236415\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}