{"title": "Chapter 419-420 - The Light since then", "id": 419, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-419-420-the-light-since-then", "volume_title": "Volume 5", "body": "<h1>Chapter 419-420 - The Light since then</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><h4 class=\"entry-title\">Chapter 419-420: The Light since then</h4></header></p><div class=\"entry-content\"><br/><p>After going through all the other nations, our journey was still not over.</p><br/><p>There’s still one more destination we have left.</p><br/><p>We are heading there now.</p><br/><p>The Underworld Country.</p><br/><p>*****</p><br/><p>“Uwa~! It has gotten lively~!!” (Karen)</p><br/><p>True.</p><br/><p>This is the first thing Karen-san said after going down to where the Underworld Country is.</p><br/><p>I followed after her and was surprised by the prosperity of the area.</p><br/><p>The Underworld Country that had fallen a long time ago and should not have any people living in it has now become a boisterous place with many people.</p><br/><p>“This is the Underworld Country investigation team that the five Grand Churches sent cooperatively huh.” (Haine)</p><br/><p>In the four years after the Demon Lord battle, the existence of the Underworld Country had been made clear, and the five churches decided on making a combined front in investigating it.</p><br/><p>As of now, we can see several ethereal lights set up here and there in the Underworld Country, the sand that was piled in this old ruined city has been carefully swept with brushes, and the carvings that have come out to light from this are being sketched or photographed by the people around.</p><br/><p>Everyone is currently investigating the uncovered Underworld Country and trying to recover that lost history.</p><br/><p>No, not only the existence of the Underworld Country was uncovered, the existence of the Dark God Entropy they worshipped has also come to light.</p><br/><p>The other heroes also came to this Underworld Country, brought back the dark power, and thanks to that, they managed to defeat Lucifer.</p><br/><p>This is so well-known that there’s no one in the world that doesn’t know about it. The Dark God Entropy has gathered a lot of attention as the sixth God that brought the power to save the world.</p><br/><p>“I wouldn’t have minded my existence staying a secret though…” (Haine)</p><br/><p>I was talking to myself there, but Karen-san who was by my side heard me clearly.</p><br/><p>“No way! Haine-san…no, Entropy-sama is the God that thought all the time about us since the moment the world was born! It should be fine for humans to be grateful for that!!” (Karen)</p><br/><p>“Is that so…!” (Haine)</p><br/><p>This is a conversation we can have only because Karen-san knows of my identity.</p><br/><p>I was sealed for 1,600 years since the world was born, so I don’t have much experience of people worshipping me, and once it actually does happen, it is embarrassing.</p><br/><p>“It is okay! As the study of the Underworld Country progresses, we will learn about how the Dark God was worshipped here. And then, in time, everyone will worship Entropy just like the other Gods! When that happens, I am sure it will be wonderful!!” (Karen)</p><br/><p>“I’m feeling itchy just hearing it…” (Haine)</p><br/><p>At the very least, in the current state, the Underworld Country is simply being investigated as a historical location, so a lot of people of the Light nation who are the most specialized in that area were sent to study the place.</p><br/><p>To tell the truth, Karen-san and I…</p><br/><p>“We will be working here as part of the investigation team from today on, right?” (Haine)</p><br/><p>“That’s right.” (Karen)</p><br/><p>So that’s how it is.</p><br/><p>Karen-san was a hero, so she could have had a better post than this if she wanted. But she didn’t wish for that, and instead, was given the job to join in the investigation of the Underworld Country.</p><br/><p>“I want to be of use to society in this place.” (Karen)</p><br/><p>“…”</p><br/><p>“If the study of the Underworld Country progresses, the era that was gone from the history of humanity will come to light, and we will learn about where we came from, and what we have done. With just the simple fact of knowing or not knowing, perception can change.” (Karen)</p><br/><p>“Karen-san, you have already saved the world, and yet, you are still trying to be of use to humans?” (Haine)</p><br/><p>“Of course! I am one of the Gods now after all!!” (Karen)</p><br/><p>Karen-san says with pride.</p><br/><p>She has fused with the divine power of Ates and turned into a Human God.</p><br/><p>At that time, I thought that this eternity as a God would become a curse to her, but Karen-san is not the kind of weakling who would falter over such small things.</p><br/><p>No matter if she is a human or God, she doesn’t hesitate to act for the sake of others.</p><br/><p>That’s the kind of person; the kind of God; the kind of soul she is.</p><br/><p>“…Now then, let’s leave the sentimentalism till there.” (Haine)</p><br/><p>“Right. Let’s greet the collective leader of the investigation team that we will be under the care of from today on.” (Karen)</p><br/><p>An investigation team comprised of members of all five Grand Churches were dispatched to this Underworld Country, so there’s a leader to command and put in order this team that would definitely create friction with such a diverse group of people.</p><br/><p>And that person is…</p><br/><p>*****</p><br/><p>“Haine-sama! Karen-sama! It has been a while!!”</p><br/><p>“Doraha-chan!” (Karen)</p><br/><p>At the headquarters of the investigation team, we arrived at the tent of the leader, and the one who welcomed us was the shadow user, Doraha.</p><br/><p>It is the girl that had been living with us in Apollon City just recently.</p><br/><p>After four years, she has grown into a strong and beautiful figure, but for us, Doraha will always be Doraha.</p><br/><p>“Sorry, Doraha-chan. Having you come here before us. It must have been lonely being in a place where there’s only people you don’t know, right?” (Karen)</p><br/><p>“Karen-sama had her important hero retirement ceremony after all. It can’t be helped that you had to stay in Apollon City. Also, you managed to meet with your friends you haven’t met after a long time, right?” (Doraha)</p><br/><p>“Yeah! They are all doing really well!” (Karen)</p><br/><p>“If it is to make time for the sake of that, it is a matter of fact that I would go first to the location.” (Doraha)</p><br/><p>At first, she was intensely unsociable and made it hard for us to even send her to errands, but now, Doraha has grown greatly.</p><br/><p>Now that I think about it, we first met Doraha at this Underworld Country.</p><br/><p>Doraha crossed time and has returned once again to her birthplace to bring it back to life.</p><br/><p>“Let’s not just stand here talking. Please enter the tent. The investigation team leader is waiting for the arrival of you two.” (Doraha)</p><br/><p>“Ah, right.” (Haine)</p><br/><p>Doraha guided us and we entered the tent.</p><br/><p>The one waiting for us there sitting was the beauty that we had seen when we left Apollon City.</p><br/><p>“You two have finally arrived.”</p><br/><p>“Yorishiro-sama! Light hero —I mean, Underworld Country investigation team member, Karen, has arrived!!” (Karen)</p><br/><p>“Me too.” (Haine)</p><br/><p>Yorishiro.</p><br/><p>She is the highest position in this investigation team.</p><br/><p>Doraha is her assistant.</p><br/><p>“So Yorishiro-sama really did arrive faster than us huh.” (Karen)</p><br/><p>“You guys went around the nations while I just had to head straight here after all….. Karen-san…” (Yorishiro)</p><br/><p>“Yes?” (Karen)</p><br/><p>“Can you stop with the -sama? I am not the Light Founder anymore after all.” (Yorishiro)</p><br/><p>Right, since she is now the investigation team leader, she can’t concurrently be the Light Founder as well.</p><br/><p>Almost at the same time as Karen-san retired, Yorishiro had passed the Light Founder position to her successor and quitted.</p><br/><p>Compared to the grand ceremony made for Karen-san to pass on her position, hers was done without much of an audience.</p><br/><p>More so when she is one of the Founders that managed to fight through in the most problematic times of humanity.</p><br/><p>“The ones who fought upfront were the heroes. It is obvious that Karen-san would be the most acclaimed since she was one of those heroes.” (Yorishiro)</p><br/><p>“But it was wrapped up by simply passing down the position, right? With the hero just recently being changed as well, would that be okay?” (Haine)</p><br/><p>“No problem. The next Light Founder is that Grades-san after all.” (Yorishiro)</p><br/><p>Light General, Grades.</p><br/><p>Even though he was simply a vice-captain when I met him, he has climbed up quite a whole lot.</p><br/><p>He is probably the one who has been promoted the most within my acquaintances.</p><br/><p>“He is the most suited for the Light Founder position of this era.” (Yorishiro)</p><br/><p>The already former Founder Yorishiro said this while the wooden seat she was sitting on made a creaking sound.</p><br/><p>“With the five Grand Churches being peaceful, the monsters and humans coexisting, we shouldn’t bring old traditions into matters. Like the pedigree doctrine that spread like a disease in the Light Church, and the pointless hereditary system.” (Yorishiro)</p><br/><p>The other churches didn’t have as much of a problem with this, but the Founder of the Light Church was always set to being hereditary.</p><br/><p>The important posts aside from the Founder one were also mostly the same, and in the time when I first arrived at the Light Church, it was on the level where it was clear how much it was decaying.</p><br/><p>There, Yorishiro stood up, and with Karen-san and my help, we managed to better this little by little, and the past misdeeds of the Light Church have been mostly eliminated.</p><br/><p>And even Yorishiro herself gave up her seat as Founder to completely cut off past traditions. The new Founder is Grades-san who doesn’t hold any pedigree or connections.</p><br/><p>“There’s no better person than Grades-san as Light Founder to prove the new standpoint of the Light Church.” (Yorishiro)</p><br/><p>He entered the Aurora Knights without any connections, and rose all the way to vice-captain with ability alone.</p><br/><p>After that, it may have been with the assistance of the coup, but he managed to rise to General, and showed leadership that surpassed his position at the time of the Demon Lord battles.</p><br/><p>That’s why more people than expected had accepted him as the new Founder.</p><br/><p>“But even if that’s the case, wasn’t it too fast? Yorishiro, you yourself are still young as well, so you could have made several reformations and—” (Haine)</p><br/><p>“Haine-san, we have already had this conversation many times before I was going to quit as Founder.” (Yorishiro)</p><br/><p>“Well, yeah.” (Haine)</p><br/><p>“Rather, it is exactly because I am still young that I wanted to retire. Passing down the Founder seat to Grades-san is the best and last reformation I can do.” (Yorishiro)</p><br/><p>It is because I heard about it and felt like she was in the right that I couldn’t stop the resignation of Yorishiro.</p><br/><p>“By resigning in the time when she still had influential power, Yorishiro-sama wanted to be of help to Grades-san as the new Founder, right?” (Karen)</p><br/><p>Karen-san says with a face as if she is on the know.</p><br/><p>Assigned as the Founder without any connections or pedigree; Grades is an unprecedented new Founder.</p><br/><p>In anything that has no precedent, there will always be winds trying to push it back. There’s no guarantee that Grades-san will not fall on his knees at that opposing wind.</p><br/><p>“That’s why, by using all my influence as previous Founder, I got rid of the forces that would try to go against Grades-san.” (Yorishiro)</p><br/><p>“By doing that and then putting Grades-san in the Founder position, the custom of the Light Founder being assigned not by connections but by ability will be settled. It would wipe out the hereditary system that was corroding the church in the past…” (Haine)</p><br/><p>That’s the objective of Yorishiro, but…Grades-san, who was chosen to be that tailwind, wasn’t elated of being the new Founder.</p><br/><p>Before leaving from Apollon City, I went to where he was with the intentions of celebrating him assuming the Founder position.</p><br/><p>‘There’s no way I would be able to manage such an important duty~~~~!!’, is what he said while crying.</p><br/><p>It is a mission impossible on the level that would bring a bald old man to tears.</p><br/><p>If he had hair, by the time he finished serving his time as a Founder, he probably would have had a full head of gray.</p><br/><p>“Also, if I am to use my youth effectively, I would like to use it in another way.” (Yorishiro)</p><br/><p>“?”</p><br/><p>Yorishiro stood up from her seat, and…swiftly draws close to me.</p><br/><p>“Burning in passion together with my loved one. That’s something that can only be done when still young. Throwing away my position as Founder, a new life in the Underworld Country together with Haine-san. I have to enjoy it to the fullest.” (Yorishiro)</p><br/><p>I knew your real reason to quit was that!!</p><br/><p>“That’s not good, Yorishiro-sama! It would trouble me if you don’t let in the mix!!” (Karen)</p><br/><p>Is what Karen-san says as she joins in and worsens the mess!</p><br/><p>“Of course, Karen-san. You and I are the same existence now, so let’s be loved by Haine-san together, and live our lives here in this Underworld Country!!” (Yorishiro)</p><br/><p>“So the Underworld Country will become the love nest of us three!! That’s way too lovely!!” (Karen)</p><br/><p>…No.</p><br/><p>The Underworld Country also has many researchers gathered here burning with inquisitiveness, so let’s properly do our job here as well!</p><br/><p>“Ufufu, in time, this Underworld Country will have people coming here. I would like to make it a great city with science and tourism in mind-desu wa ne.” (Yorishiro)</p><br/><p>“Mantle-sama has stopped the desertification, so the ‘Nameless Desert’ is slowly but surely growing more green. This land could turn into a residential area overflowing with people!” (Karen)</p><br/><p>“It really makes one look forward to the future-desu wa ne. Ufufufu.” (Yorishiro)</p><br/><p>And so, the Light Goddesses were making the future look brighter and brighter by themselves.</p><br/><p>Because Karen-san has become one with Ates and turned into the new Light Goddess, as a result, Yorishiro and Karen-san have ended up turning into the same existence.</p><br/><p>Thanks to this, their relationship has gotten even better lately.</p><br/><p>The triangle relationship we had didn’t create any sparks, instead, they are teaming up and spearheading me.</p><br/><p>Well, you could argue that was how it was from the very beginning though.</p><br/><p>“Haine-san is the incarnation of the world’s strongest, the Dark God, so making two girls happy should be a piece of cake, right?” (Yorishiro)</p><br/><p>“Also, we are one existence, so it is a matter of course that we should be loved together, right?” (Karen)</p><br/><p>That synched offensive of theirs made me want to pass out.</p><br/><p>And in that way, I was also included in the investigation team of the Underworld Country, and the place I would be residing till the end of times seemed to be on the verge of being decided here.</p><br/><p>The life of Kuromiya Haine from now on.</p><br/><p>Being in between two loving women, I will be putting my energy in this historic ruins huh.</p><br/><p>“Well, doesn’t sound bad.” (Haine)</p><br/><p>“Right-desu wa ne?” (Yorishiro)</p><br/><p>“Isn’t that right?” (Karen)</p><br/><p>The important two also seem to be having fun so, at any rate, this has become our new home.</p><ul><li>420: At the center of this world’s border</li></ul><br/><p>“Since we have the chance, how about calling Haine-san’s parents here as well?” (Yorishiro)</p><br/><p>“Hm…but my mother and father are…” (Haine)</p><br/><p>My mother has had a weak body since birth, so it would be tough to leave the mountains that she has already gotten used to living in.</p><br/><p>I have been going back there three times a year, so I was thinking about continuing that habit though.</p><br/><p>“Then, the next time you are to return, bring Karen-san and I too!” (Yorishiro)</p><br/><p>“We want to greet our soon to be mother and father in law!!” (Karen)</p><br/><p>Please don’t.</p><br/><p>My parents have been living quite the regular life, so please don’t go overturning their common sense with a shocking development at this point.</p><br/><p>I want to slowly take my time to tell them about the outrageous conduct of their son.</p><br/><p>Right now, let’s take care of one other problem.</p><br/><p>“Doraha.” (Haine)</p><br/><p>“Yes?” (Doraha)</p><br/><p>“Have they arrived already?” (Haine)</p><br/><p>“Yeah. Since they would pull attention if they were to come here, I had them wait at a place far from here. If it is okay with you, I can guide you there.” (Doraha)</p><br/><p>“Okay, let’s go.” (Haine)</p><br/><p>I don’t care about the bunch, but making guests wait would be a lack of manners.</p><br/><p>Before beginning my job as a member of the investigation team, I have to fulfill my duty as the Dark God.</p><br/><p>“There’s no need for Doraha to guide him.” (Yorishiro)</p><br/><p>Saying this, Yorishiro stands up.</p><br/><p>“I will carry that out. Whichever the case, I will have to participate as the Light Goddess as well.” (Yorishiro)</p><br/><p>“Me too! I will go as well!!” (Karen)</p><br/><p>Karen-san too is already a Light Goddess as well, and has her own duty as a God to fulfill.</p><br/><p>“And so, Doraha, I will once again be leaving things in your hands while I am absent.” (Yorishiro)</p><br/><p>“Understood, Yorishiro-sama.” (Doraha)</p><br/><p>Doraha accepts without saying a single complaint.</p><br/><p>Yorishiro hugs her.</p><br/><p>“I will not be making you wait as long as last time. I will return as soon as possible. And then, let’s make the Underworld Country great again, together.” (Yorishiro)</p><br/><p>****</p><br/><p>And in this way, we went out to the surface, and flew with our flying machines in the Nameless Desert that has the burning sunlight shining strongly.</p><br/><p>The desertification has already been stopped, and the green is slowly returning to it, but natural change will always be a slow one.</p><br/><p>This place will turn into an area with plentiful green with time, but it will most likely not be in the time where I can see it with the eyes of Kuromiya Haine.</p><br/><p>“That’s why this desert still works as a place to hide things from others.” (Haine)</p><br/><p>“It is a harsh environment to begin with after all. Without our searching abilities as Gods, we would get lost and dry to death before being able to find that child in this Nameless Desert.” (Yorishiro)</p><br/><p>And so, with the searching ability of Yorishiro, we managed to find that someone.</p><br/><p>Dark Demon Lord, Satan.</p><br/><p>The relic that was created by the Demon Lord battle.</p><br/><p>“It has been a while~. Have you been doing well?” (Haine)</p><br/><p>Satan is different from the other Demon Lords in the fact that it didn’t have generations compiled within him, thus, doesn’t have a will and heart.</p><br/><p>It is simply a monster that is especially big.</p><br/><p>The Light Demon Lord that Ates created to destroy humanity had been changed into a Dark Demon Lord with me stealing its control rights.</p><br/><p>Ates has already disappeared inside Karen-san, so Satan has no reason to rampage anymore, and since it was too pitiful to kill him, we are leaving him like this.</p><br/><p>No, Satan now has an important task, important enough that we wouldn’t be able to kill him now.</p><br/><p>“He is releasing it at an incredible pace today as well huh.” (Yorishiro)</p><br/><p>The dark wings that spread from the back of Satan were mixing with his light wings, and the pure power that was created in the middle of those wings moved to the sky and dispersed.</p><br/><p>That’s ethereal.</p><br/><p>“To think ethereal was created from the friction of the darkness and light.” (Haine)</p><br/><p>The light power of when he was Lucifer stayed even when he changed, and Satan is currently an incredibly abnormal existence that can use both light and darkness.</p><br/><p>“…In the past, I created ethereal to eliminate the influence of the Gods.” (Yorishiro)</p><br/><p>The creation of shadow that formed by changing light into an artificial darkness; as a byproduct of this process, ethereal was born.</p><br/><p>This became a great energy source for human civilization, and served as a foundation for big developments, creating an industrial revolution.</p><br/><p>“With the fall of the Underworld Country, which was the source of ethereal, gone, if this were to be left as it is, ethereal would disappear from this world in time.” (Yorishiro)</p><br/><p>If that were to happen, the human civilization would most likely regress heavily.</p><br/><p>That important duty is now being undertaken by Satan.</p><br/><p>“Even without a will and heart like that of Michael and the others, Satan is currently a splendid Demon Lord.” (Haine)</p><br/><p>When I pat that scarily big body of his, Satan shook as if ticklish.</p><br/><p>I arbitrarily thought that this was his way of expressing his happiness.</p><br/><p>…And so…</p><br/><p>“Satan is supposed to be the meeting point but, I don’t see those guys anywhere. Are they not here yet?” (Haine)</p><br/><p>“Doraha-san said they were already here though…” (Karen)</p><br/><p>We moved our attention to the surroundings and then…</p><br/><p>…Something came out.</p><br/><p>Four different types of divine power.</p><br/><p>(Took your sweet time to come, you idiots!)</p><br/><p>A cow comes out from the ground as it shook off the sand on him.</p><br/><p>It is the cow that we met at Muspelheim, Phalaris. And also the incarnation of the Fire God, Nova.</p><br/><p>“…Why are you coming from underground?” (Haine)</p><br/><p>Did he finally change jobs from cow to mole?</p><br/><p>(Like hell I would wait like an idiot in this crazy hot place! I dug underground and was avoiding the light of the sun!!) (Nova)</p><br/><p>“Right now, I am a human, so I can’t do something beast-like like that.”</p><br/><p>When I moved my gaze to where another voice came from, I saw Shiva.</p><br/><p>The incarnation of the Wind God Quasar.</p><br/><p>“I was taking a rest at the oasis that’s close to here while I waited. I can just have her tell me when you guys will be coming after all.” (Shiva)</p><br/><p>Shiva was holding a pot.</p><br/><p>From within that pot, a single plant was growing from it. At the top of it, a flower bloomed, and from within that flower…</p><br/><p>“I am sorry~.” (Mantle)</p><br/><p>The temporary body ‘Fairy’ that Mantle uses to appear in the surface world showed up.</p><br/><p>“…..What are you apologizing for?” (Haine)</p><br/><p>This Mother Earth is truly unchanging.</p><br/><p>“…..With this, all six Gods of Creation are gathered.”</p><br/><p>And the last one, appearing from mist that came out of nowhere, a monster that has a similar silhouette from that of humans.</p><br/><p>“So everyone is here now then?” (Coacervate)</p><br/><p>The Water God, Coacervate.</p><br/><p>Residing in the body of the Water Saint, Mephistopheles.</p><br/><p>Earth, Water, Fire, Wind, Light, and Darkness.</p><br/><p>The six Gods that created the world by gathering six elements.</p><br/><p>Residing in the body of humans, the body of monsters; each of us were enjoying life in this world we created in the way we wanted.</p><br/><p>And now, we are all gathered in one place.</p><br/><p>Just that…</p><br/><p>“To think you guys would be the ones calling us. Color me surprised.” (Haine)</p><br/><p>“No no, we are comrades that helped each other out in creating the world. Isn’t it fine to gather together like this? ….Keh.” (Coacervate)</p><br/><p>Coacervate, who is probably the one who organized this, said.</p><br/><p>He is clever in his own way after all.</p><br/><p>“But well, today, we actually have something important to propose to you people. That’s why we asked you to come all the way here. Please lend us an ear here. It would be great if you were to consider this in a serious manner……keh.” (Coacervate)</p><br/><p>……</p><br/><p>Uhm, Coacervate-san?</p><br/><p>What’s that ‘keh’ you have been doing for a while now with your throat?</p><br/><p>“You…has your personality grown a bit wilder?” (Haine)</p><br/><p>“Not really. Thanks to everyone, my heart is clean like a mirror…..keh.” (Coacervate)</p><br/><p>As I thought, he is beginning to pollute.</p><br/><p>The Water God, due to his element, easily gets polluted by the impurities of the world, and if left alone, he will end up turning into a contaminated bastard.</p><br/><p>We distilled him by burning him with fire like crazy, and yet…</p><br/><p>“He is beginning to get contaminated again?” (Haine)</p><br/><p>Oi oi, he was distilled only four years ago, you know?</p><br/><p>According to the testimonies of the other Gods, it took at least a hundred years for him to return to being contaminated after his distillation.</p><br/><p>“The amount of impurities in the past and now are different after all.” (Yorishiro)</p><br/><p>Yorishiro says with a tone as if saying ‘what a pain’.</p><br/><p>“This looks like we have to purify him again soon. It would be a pain if you were to turn back to a polluted bastard and cause problems to humanity again.” (Haine)</p><br/><p>“The reason why we called you guys here is also related to this.” (Shiva)</p><br/><p>Having the polluting Coacervate step back, Shiva takes his place.</p><br/><p>From within the Four Base Elements, this guy really is the one that’s the easiest to talk to.</p><br/><p>“What’s with all the formality? If you wanted to talk about something, wouldn’t it have been fine to talk about it when we visited Rudras Metropolis?” (Haine)</p><br/><p>“Can’t do that. This is a consensus from all of us four Base Elements. We want the permission of you two as the two Poles of the Gods of Creation.” (Shiva)</p><br/><p>Shiva leaves a pause.</p><br/><p>The other three Base Element Gods lineup, and after a glance at them, Shiva speaks with a grave tone.</p><br/><p>“We plan on leaving this world.” (Shiva)</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-416-418-the-earth-since-then\" id=\"prev_chap\" title=\"Chapter 416-418 - The Earth since then\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-421-422-wonderful-world\" id=\"next_chap\" title=\"Chapter 421-422 - Wonderful World\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"236416\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}