{"title": "Chapter 421-422 - Wonderful World", "id": 421, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-421-422-wonderful-world", "volume_title": "Volume 5", "body": "<h1>Chapter 421-422 - Wonderful World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><header class=\"entry-header\"></header><div class=\"entry-content\"><br/><p>“You are going to leave this world?” (Haine)</p><br/><p>The sudden declaration of the four Base Elements had surprised me so much, I had to say it again.</p><br/><p>“Why so suddenly? Why are you saying that?” (Haine)</p><br/><p>“That’s right!” (Karen)</p><br/><p>The newbie as a God -Karen- also raised her tone with a trembling voice.</p><br/><p>“Every one of you guys have a variety of grudges towards each other. I am also aware of this. But after overcoming the trials and tribulations until now, humans and Gods should have been able to reconcile, right?!” (Karen)</p><br/><p>At the far past, at the beginning of the world, Gods could only see humans as slaves that should obey them.</p><br/><p>Aside from me.</p><br/><p>But after a long long passing of time, humans have grown, developed, and that greatness has begun to be acknowledged by even the Gods.</p><br/><p>The Gods that had looked down on the humans all the time are now accepting the humans.</p><br/><p>“From now on, humans and Gods can finally advance together in a normal relationship. And yet, Gods are disappearing and leaving humans?!” (Karen)</p><br/><p>“It is the contrary, new Light Goddess.” (Quasar)</p><br/><p>Shiva…no, the Wind God Quasar spoke.</p><br/><p>“Humans have grown in a strong and splendid manner. That’s why humans don’t need Gods anymore.” (Quasar)</p><br/><p>“In reality, we should have done this sooner. The role of us Gods is to create a world, and the moment we did that, our role was over……keh.” (Coacervate)</p><br/><p>(Slovenly living our time in a world where we have nothing to do; we Gods are simply troublemakers for the true protagonists of this world, the humans.) (Nova)</p><br/><p>“I think so as well~” (Mantle)</p><br/><p>The four Base Elements were all giving their own opinions.</p><br/><p>“The humans already have enough strength to stand on their own two feet. The Demon Lord battle was the best example of it.” (Quasar)</p><br/><p>“Humans bursted right through it and managed to overcome that battle splendidly. There was no need for us Gods to protect you, or save you……keh.” (Coacervate)</p><br/><p>As if Karen-san couldn’t take it anymore, she intervened.</p><br/><p>“But that was because you Gods provided us with the strength of a God Hero—!” (Karen)</p><br/><p>(It doesn’t change the fact that you guys were the ones who personally fought.) (Nova)</p><br/><p>That’s right. That was clearly the victory of humans.</p><br/><p>For us Gods who created humans and believed in them, there’s no better pride.</p><br/><p>“That’s why we are going to stop any extra interference, and decided on leaving the world. Before I incarnated to this body of Shiva, I have been living as a human many times, and each time I did, I was able to experience something new that I didn’t experience before.” (Quasar)</p><br/><p>Quasar smiles.</p><br/><p>“But it is time to put an end to it. I will be separating from always being in the care of a linked body and also the people of the Wind nation. They have to continue forward on their own strength. Looking at the child I had with Juo, I think about this more and more.” (Quasar)</p><br/><p>“After leaving this world…” (Yorishiro)</p><br/><p>Yorishiro joins.</p><br/><p>As one of the highest within the Gods, she is in a standing that allows her to decide.</p><br/><p>“What do you plan on doing?” (Yorishiro)</p><br/><p>(Right, that’s what it is.) (Nova)</p><br/><p>Nova says with rough breathing from his cow body.</p><br/><p>(How about creating a new world?) (Nova)</p><br/><p>A new world?</p><br/><p>“The role of us Gods is to create worlds to begin with. You could say the people here have developed and this world is a great success. With that success in mind, how about challenging for the next one? Is what we are thinking…keh.” (Coacervate)</p><br/><p>“I also think that~.” (Mantle)</p><br/><p>Mantle is adding agreement here and there as it goes.</p><br/><p>“But in the end, we four Base Elements can’t create worlds with just us. The foundation of the world -time and space- can only be created by the Light and Darkness Gods.” (Quasar)</p><br/><p>(And so, how about leaving this world together with us and creating a new world?) (Nova)</p><br/><p>“We have a lot of past grudges between us, but how about letting it be water under the bridge?…Keh.” (Coacervate)</p><br/><p>“I think so too~.” (Mantle)</p><br/><p>I was bewildered by this, and so, I looked at Yorishiro and Karen-san.</p><br/><p>Their eyes had no hesitation.</p><br/><p>“…Right. We are not the ones who have the answer.” (Haine)</p><br/><p>The one who has the answer is this world itself.</p><br/><p>This world has developed and evolved. If this world has arrived to the answer of not needing the protection of us Gods anymore…</p><br/><p>—We Gods have to accept that.</p><br/><p>“Humans believe in Gods; but more than that, Gods believe in humans. That’s what I felt the most in the passing of 1,600 years.” (Haine)</p><br/><p>“…But, Haine-san…” (Yorishiro)</p><br/><p>Yorishiro pulled my sleeve.</p><br/><p>“We are currently not only Gods, but also humans.” (Yorishiro)</p><br/><p>“That’s right. Right now, we are Haine-san, Yorishiro-sama, and Karen. We won’t leave this world until we fulfill that role as humans, right?” (Karen)</p><br/><p>The two beauties are looking at me with uneasiness in their eyes.</p><br/><p>…Of course.</p><br/><p>“I will enjoy my life as Kuromiya Haine to the fullest. For us Gods, the whole life of a human is like the blink of an eye. Let’s live it to the utmost!” (Haine)</p><br/><p>“Well, yeah. I have no intentions of leaving this world until I watch over Hyue marrying, my child splendidly growing up, and growing old together with Juo!” (Shiva)</p><br/><p>(I gotta look after the pro-wrestling enterprise of Mirack for a little bit more.) (Phalaris)</p><br/><p>“After we leave, I am thinking of leaving the supervision of things to the Demon Lord-sans. I am sure they will become splendid guardians of the world…keh.” (Coacervate)</p><br/><p>“I think so too~.” (Mantle)</p><br/><p>Mantle, at least try to say something for yourself at the end.</p><br/><p>“Well then, it has been decided.” (Haine)</p><br/><p>After living through our life to the fullest, we will aim for the next world.</p><br/><p>Just like in this world.</p><br/><p>Let’s make another wonderful world.</p><br/><p>Karen-san, Mirack, Celestis, Sasae-chan, Hyue; and also the many people we have met until now…</p><br/><p>This world is…truly a wonderful world.</p><ul><li>422: An endless story</li></ul><br/><p>After that, even more time passed on.</p><br/><p>There’s not a single one left in that world that knows about that gathering.</p><br/><p>Some had their soul leave their dying bodies, some were given new duties from the Gods as they left the world.</p><br/><p>Even with that, the world continues uninterrupted.</p><br/><p>The miracle that they had made possible in the past has now turned into a legend and has been passed down by many people.</p><br/><p>As Kuromiya Haine, Yorishiro, and Kourin Karen; we who have finished our roles and had come out from our bodies, had now returned to being Gods, and were leaving on a journey to look for a new role.</p><br/><p>Now then, next will be…</p><br/><p>What kind of world shall we make?</p><br/><p>—World Reformation activities of the Dark God, The End</p></div></header><br/>\n</p></div>"}