{"title": "Chapter 423 (END) - Afterword", "id": 423, "volume": 5, "url": "http://boxnovel.org/world-reformation-activities-of-the-dark-god-%E2%80%94-loving-humans-so-much-i-reincarnated-in-one-chapter-423-end-afterword", "volume_title": "Volume 5", "body": "<h1>Chapter 423 (END) - Afterword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><header class=\"entry-header\"><header class=\"entry-header\"></header><div class=\"entry-content\"><br/><p>Author Afterword:</p><br/><p>World Reformation activities of the Dark God.</p><br/><p>With this, we have reached to the end.</p><br/><p>Thank you very much everyone who has been accompanying me till this point. I am truly thankful for your reading this story.</p><br/><p>This story that had begun in 2016, I have managed to finish writing it in the short period of one year.</p><br/><p>This was my first attempt at publishing a story in ‘shousetsuka ni narou’ &lt;webnovel page&gt;. There were a lot of things I was worried about, but I think it was an important experience.</p><br/><p>Gods incarnating as humans, Gods and humans, and also, resolving problems with monsters.</p><br/><p>I think I was able to portray the different senses of value that occur between each other that was at times serious and at times funny.</p><br/><p>The characters appearing there as well. The protagonist Haine, and of course, the heroines Karen, Yorishiro, Mirack, Celestis, Sasae-chan, and Hyue; many went moving about on their own, and I myself as an author was able to enjoy it as well.</p><br/><p>The story of Haine and his group is now over, but I am thinking of putting out a new story in the future.</p><br/><p>Well then, to the people that have read this together with me.</p><br/><p>Thank you very much!</p><br/><p>Let’s meet at a new story!</p><br/><p>************</p><br/><p>Translator Afterword:</p><br/><p>Hey guys, Reigokai here!</p><br/><p>Oh boy, so we have finally managed to finish one journey. I am not really sure how to express my feelings right now, but I do have one thing I can say: it was truly fun.</p><br/><p>First, I would like to talk about my opinions on this story. I will be blunt here, this was by no means a masterpiece. There was a definite lack of body language descriptions in this story, the political implications that could occur between the many nations, the common populace had low to almost no participation focusing heavily on the main cast, and I could go on for a good while, but you get the idea.</p><br/><p>So I say it again, a masterpiece? No. But, an enjoyable story? Heck yeah!</p><br/><p>It may not have the most deep political structure, but it sure in hell nailed the main cast and things that surrounded them. The nations had some really defined traits between each other which you could easily tell; the Gods, humans, and even the Demon Lords were filled with personality; how the author handled the Demon Lords was probably my favorite part of the story itself.</p><br/><p>Now, I said my favorite part of the story was the Demon Lords. The story in itself was pretty normal to me before they appeared. The characters were quirky and fun, but I felt like the author was going to continue the formula of beat up big monsters for each nation; and then, with the Mother Monsters, he would repeat that formula. But I was pleasantly surprised that he took that and turned it around before they battled them out —they were basically a meal for the Demon Lords. Then, he went a step above and spinned it around. He sanctified the Demon Lords in ways, I am pleased to say, I actually enjoyed how they all changed. Sorry heroes, I like all Demon Lords more (except for Celestis).</p><br/><p>Okay okay, I said my favorite part of the story itself is when the Demon Lords appeared. But that’s in the narrative view. In terms of the story as a whole, what truly shone the best was definitely the characters. Their personalities were truly defined to a T. There were times where the author didn’t properly specify who it is that was speaking, but I could tell clearly who it was. That’s how defined it was. I could probably line out a situation, and easily imagine how every character would react differently from that one situation.</p><br/><p>As I said, the character I liked the most is Celestis. She is the one who takes the cake, and she would probably eat it in front of me with a wide grin. She reminds me of Aqua from Konosuba, but with a bigger brain. Her witty funny comments poking fun at tropes is what I loved the most, and also the quirkiness of the water nation she showed was simply the best.A close second would definitely be Michael. His battle was most likely the battle that heated me up the most in this story. It was a true show of humans working together to defeat one big threat. And it ended with one of the things I like the most: a raw fist fight. And the end was the cherry on the top, when he said: ‘Let there be hot-bloodedness’, as he left. I have to admit, that one hit me greatly in both awesomeness and how much he had grown from that battle. At that moment, we all knew how the author would handle the Demon Lords, and I had a good smile when I learned that. ——-My only gripe with Michael is that I was totally shipping him with Mirack. Come on author! This was supposed to be humans and demons coexisting! Make babies! I don’t care what anyone says, I believe that in that blank space of time, they both married and lived happily ever after with their pet cow!</p><br/><p>*Cough*</p><br/><p>Anyways, let me address the true driving force that pushed me to continue this story when it was clearly not popular for many who were most likely coming from a heavy political and moral conflicting story like Tsuki.The readers that actually stayed with me through the whole journey.</p><br/><p>Just reading how you guys reacted to the story as it went on and knowing that you were all staying for reasons similar to mine truly made me happy.</p><br/><p>Let’s be honest, we all knew the faults of the story, but I am sure you all managed to overlook those flaws and say ‘hell, this is a story, and I enjoy it for what it is!’. No nitpicking there.</p><br/><p>I have to say, I am truly thankful for that.</p><br/><p>It let me enjoy the story fully knowing there were others who enjoyed the journey together with me.</p><br/><p>As you guys can already tell, it was a joy to translate this story and share it.</p><br/><p>This story may have ended already, and with Tsuki only having a few extras remaining, it is obvious what comes next.</p><br/><p>This is an end and also a beginning, but I digress. This is a World Reformation afterword after all.</p><br/><p>I would like to say one last thanks to everyone who stuck to this journey together with me and shared their joys and displeasures in it.</p><br/><p>Thank you very much!</p><br/><p>Let’s meet at the next world!</p></div></header><br/>\n</p></div>"}