{"title": "Chapter 2: Marrying Mr Right (2)", "id": 2, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-2-marrying-mr-right-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2: Marrying Mr Right (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2: Marrying Mr Right (2)</p><br/><p>Chu Lian was about to take off her phoenix crown when she was held back by Xiyan. “Sixth Miss, the bridal attendant left instructions for you just now. You have to wait for Third Young Master to personally take off the phoenix crown.”</p><br/><p>Chu Lian helplessly put down her hands and stretched her aching neck instead; she could only leave it like this.</p><br/><p>Xiyan felt that Sixth Miss’ actions were a little funny. “Don’t worry, Sixth Miss. They won’t delay Young Master for too long with Matriarch He in attendance. Young Master will be back soon.”</p><br/><p>Xiyan’s teasing made Chu Lian blush.</p><br/><p>“Why do you have so much to say today when you’re usually so silent?”</p><br/><p>Chu Lian glared at her in rebuke and calmed down. She stood up and ordered the maidservants to put away the things she had brought with her. Before an hour had passed, a maidservant announced from outside that Young Master had returned.</p><br/><p>Some dried foods, including peanuts and dried longans, were scattered over the red covers of the conjugal bed. 1 Right after Chu Lian got Senior Servant Gui to clear those away, He Changdi stepped into the outer chamber.</p><br/><p>No one was following by He Changdi’s side this time, only a bridal attendant who had come to pass down some customs.</p><br/><p>After He Changdi stepped into the inner chamber, the bridal attendant smiled as she indicated for a maidservant to bring in the nuptial wine that had been prepared earlier.</p><br/><p>“Third Young Master, Third Young Madam, after drinking this nuptial wine, you’ll become a couple who will go through thick and thin together!” The bridal attendant was full of smiles as she handed the nuptial wine over.</p><br/><p>He Changdi stood tall and straight like an unfellable, sturdy pine. Had there been an audience, his poise would’ve garnered the admiration of many.</p><br/><p>He took his cup but continued to stand in front of the bed without moving. The bridal attendant suddenly felt as if the atmosphere in the bridal chamber had turned cold. She secretly wiped away the cold sweat from her forehead before smiling brightly and handing the other cup of nuptial wine to Chu Lian.</p><br/><p>“After Third Young Master and Third Young Madam have drunk the nuptial wine, Third Young Master has to personally remove the phoenix crown on Third Young Madam’s head, so that your days will be full of peace and harmony.”</p><br/><p>Right after the bridal attendant finished blessing them with auspicious words, He Changdi spoke, his tone frigid. “Alright, you can leave now.”</p><br/><p>Hah? The bridal attendant was still a little stunned when she subconsciously replied, “Third Young Master, you haven’t drunk the…”</p><br/><p>“Did you not hear what I said?” He Changdi’s voice abruptly turned grave, chilling the previously warm air of the chamber.</p><br/><p>The bridal attendant was simply a servant, so she didn’t dare to argue with the He Family’s third young master. With extreme reverence and fear, she answered in agreement and left a few more auspicious words before leaving with the maidservant in a hurry.</p><br/><p>She racked her brains but couldn’t tell what fit this young master was pulling, so she could only lament that she was probably the first bridal attendant to have been chased out of a bridal chamber.</p><br/><p>Chu Lian had been waiting to drink the nuptial wine with her head lowered. She blanked out for a moment, not understanding what He Changdi was doing.</p><br/><p>Why was this sequence of events a little different from the novel?</p><br/><p>While she was still confused, He Changdi ordered Senior Servant Gui, Xiyan, and the rest of the servants out.</p><br/><p>Chu Lian raised her head to look at the third son of the He Family. His brows were nicely shaped and his features were well-defined. Upon seeing his actual person, his face seemed to have been made of fine jade. Chu Lian thought that he was even more handsome than how the novel had described him. But what was with that unrestrained frosty look in his eyes? Why was he looking at her with such a cold and mocking gaze?</p><br/><p>For a moment, Chu Lian was stumped for words because she was stunned by his cold and arrogant countenance.</p><br/><p>Based on the progression of events in the novel, He Changdi had not consummated their marriage because the female lead had refused to, but He Changdi had still treated the female lead with tenderness and consideration in the bridal chamber.</p><br/><p>The way things had just unfolded gave her a sinking feeling.</p><br/><p>Seemingly having noticed the confusion in Chu Lian’s shiny, black eyes, He Changdi stepped forward and bent down slightly. His eyes were like a frozen lake, without a shred of warmth or joy, and the ice seemed to extend for immeasurable depths below the surface. He watched the pretty girl before him closely, as if he were looking for something within her gaze.</p><br/><p>After seeing the girl panic, the corners of He Changdi’s lips suddenly lifted, revealing a smile that could send chills down anyone’s back. He was clearly a handsome and extraordinary man with an awe-inspiring righteous aura. However, when he smiled like that, it added on a hint of devilish charm.</p><br/><p>Chu Lian was so entranced by He Changdi’s looks, she couldn’t react fast enough.</p><br/><p>So, when He Changdi raised his hand and slowly poured the nuptial wine all onto the floor…</p><br/><p>Chu Lian could only watch his actions in disbelief as that small cup of nuptial wine left a dark, wet stain on the bright red Persian carpet.</p><br/><p>She subconsciously mumbled, “What are you doing?”</p><br/><p>Without waiting for Chu Lian to react, the cup of nuptial wine in her hands was also sent flying. The wine scattered all over her red wedding dress. In the next second, her wrists had been captured in a bruising grip and a voice so cold it could freeze bone rang in her ears. “Can’t you tell what I’m doing? My dear bride!”</p><br/><p>What the heck!? What was going on? Why weren’t they going by the book anymore? Chu Lian was inwardly wailing amidst her shock and anger. However, before she could speak, He Changdi roughly pulled off her phoenix crown and threw it to the ground. Some of the strands of her black hair were yanked out along with the headdress, leaving an aching pain in their wake.</p><br/><p>He Changdi kept his voice low as he roared in anger, “You’re not fit to wear this phoenix crown!”</p><br/><p>Chu Lian tried to push away the man before her, but unfortunately, she wasn’t strong enough. Her hands were just like kitten paws in the face of a male’s strength, lacking any bit of might.</p><br/><p>When He Changdi saw that she was trying to fight back, his eyes bled with anger and he wrapped his hands around Chu Lian’s tiny, snow-white neck. Even the veins on his slender hands were popping out; his hate for her was clearly reflected in his eyes!</p><br/><p>Chu Lian could feel every bit of that murderous intent!</p><br/><p>However, Chu Lian had never experienced anything like this before. She only felt the unyielding grip on her neck, squeezing like a noose, forcing her to cry from the pain. She couldn’t breathe; it felt like she was going to die in the next moment!</p><br/><p>Her fair face had already turned blue from suffocation. He Changdi thought he only had to exert a little more strength before he could finally be free from this ‘wicked woman’ forever!</p><br/><p>However, the thought of his grandmother and his brothers, who he knew wished only the best for him, popped into his mind. He Changdi didn’t think he could bear watching as their hopes were dashed. The reputations of both the Houses of Duke Ying and Count Jing’an were also at stake if he were to kill this woman. Thus, he could only dejectedly let go of her neck and glare instead, his hatred thick and cloying like miasma. He would leave this ‘bitch’ alive for now!</p><br/><p>After the grip around her neck loosened, Chu Lian touched the bruises left on her neck, her face pale as a sheet. Air was finally free to flow into her throat, causing her to cough uncontrollably.</p><br/><p>If she had really been killed by her new husband just now, she would have become the most tragic transmigrator ever.</p><br/><p>Chu Lian’s throat was unbearably dry, and she couldn’t even speak. All she could do was hold her chest and pant for breath.</p><br/><p>He Changdi’s expression turned even more overcast and ugly. He sneered and said, “Sixth Miss of the Chu Family, don’t assume that everyone else is stupid!”</p><br/><p>1. This is part of Chinese wedding customs and symbolises fertility. Read more about it here: https://en.wikipedia.org/wiki/Chinese_pre-wedding_customs#Installation_of_the_bridal_bed</p><br/>\n</div>"}