{"title": "Chapter 7: Tea Ceremony (1)", "id": 7, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-7-tea-ceremony-1", "volume_title": "Volume 1", "body": "<h1>Chapter 7: Tea Ceremony (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 7: Tea Ceremony (1)</p><br/><p>The House of Count Jing’an was a military family, and the grandfather of the current Count Jing’an was one of the country’s founding fathers. Although the title had already been passed down for three generations and their rank had dropped from duke to count, the power of the House Jing’an could not be underestimated.</p><br/><p>The House of Count Jing’an was not a normal military family. It was also not one of the powerless military families that the Emperor kept in Shenyang, corralling them like livestock.</p><br/><p>The current Count Jing’an defended the most important border in Mingzhou, possessing the title of Defender General.</p><br/><p>Within the House of Count Jing’an, the first son, He Changqi, managed the household. The second son, He Changjue, served in the military as one of the Left Military Guards, a particular division of guards in the palace.</p><br/><p>Meanwhile, He Sanlang had learned martial arts from his father and brother at a young age. He visited the army often and had already made a name for himself.</p><br/><p>Countess Jing’an had given the He Family three sons. However, while giving birth to the third son, He Sanlang, she had suffered serious complications and remained bedridden even now.</p><br/><p>Count Jing’an guarded the border far away, and was only able to return home once every few years. The He Family also had a special rule: the sons of the He Family could only marry a single wife. They were only allowed to wed a concubine if, by the time they reached thirty years of age, their wife had not borne them a son.</p><br/><p>Although Countess Jing’an was now in poor health, she had given the He Family three sons, so Matriarch He treated her daughter-in-law rather well.</p><br/><p>However, perhaps Count Jing’an had used up all of the He Family’s luck in producing heirs. When it came to the youngest generation, not a single heir had been born yet.</p><br/><p>The heir of Count Jing’an, He Changqi, had married the granddaughter of Marquis Dingyuan, Madam Zou.</p><br/><p>Madam Zou had only gotten pregnant a year and a half after marrying into the He Family. However, her first child was a girl. After two more years, she had gotten pregnant again, but the resulting child had been yet another girl.</p><br/><p>It wasn’t clear if it was a problem with her or He Dalang 1, but for the following four whole years, she hadn’t gotten pregnant again.</p><br/><p>He Erlang 2was a strange one. He had entered the military at an early age and was now twenty-four. However, he still refused to marry; his stubbornness had gotten to the point where it was even causing a ruckus within the family. Due to this, he would simply stay in the Left Military Guards’ barracks without returning to the estate, unless there was an important event going on.</p><br/><p>Whenever He Dalang saw this little brother of his, he felt the urge to slap him.</p><br/><p>Now the handsome He Sanlang had finally married. The bride was even a lady of the Chu Family, just as Matriarch He had specially requested from the imperial palace.</p><br/><p>Matriarch He had thought that she would soon be able to hold a fair and chubby great-grandson in her arms, but unfortunately, this He Sanlang had somehow been reincarnated. It would be strange if he were willing to consummate his marriage with the wife who had cheated on him in his previous life!</p><br/><p>Ah… Matriarch He would have a long time to wait!</p><br/><p>Of course, Matriarch He didn’t know any of this at all.</p><br/><p>As for Chu Lian, who was following behind He Sanlang with her back ramrod straight… even though she didn’t know what was going on with the sudden change in He Sanlang’s personality, she knew all about the rest of the events that would take place. She had become the female lead in the novel she had been reading after all!</p><br/><p>When she had first seen the book, the actions of the female lead who shared her name had made Chu Lian speechless.</p><br/><p>He Sanlang had looks, talent, and a good family background. His family was also simple and free from the inner conflicts common in other households. Wasn’t it good to be a young madam in a noble family such as this? Why did she have to stir up so much trouble with that damned Xiao Bojian?</p><br/><p>The female lead had even destroyed her own reputation. Geez. Back then, Chu Lian had wondered whether the author had a grudge against this female lead or something, making her make the most horrible decisions possible…</p><br/><p>Perhaps her resentment had been too strong, because when Chu Lian woke up, she had become that damned female lead herself! If she had known that this would happen earlier, she would have read a little faster and finished the book. However, that hadn’t happened, and now she was in a situation where she didn’t know what developments would occur in the later half of the novel. She didn’t know who the female lead would end up with, or what would happen to He Sanlang in the end.</p><br/><p>Add He Sanlang’s mysterious changes into the mix, and Chu Lian was about to go crazy.</p><br/><p>She was a little too distracted while walking, so she stumbled upon the cobblestone path, almost spraining her ankle. Luckily, Xiyan caught her just in time.</p><br/><p>He Sanlang heard the commotion going on behind him and cast a cold glare over his shoulder. The look in his eyes gave her a merciless warning, telling her without the use of words, ‘You had better watch it!’</p><br/><p>For an aristocratic family, the family tree of the House of Count Jing’an was extremely simple.</p><br/><p>Matriarch He occupied the highest position, while He Dalang’s daughters were the lowest in the family tree. There were no concubines or illegitimate children around, a huge difference from the complicated family of the House of Duke Ying.</p><br/><p>They had arranged for the newlyweds to pay their respects to their elders at Matriarch He’s Qingxi Hall 3.</p><br/><p>When the pair of newlyweds reached the arched doorway, they immediately spotted Senior Servant Liu, one of the servants highly regarded by Matriarch He, walking over to welcome them.</p><br/><p>“This old servant pays respects to Third Young Master and Third Young Madam.”</p><br/><p>Chu Lian hurriedly moved forward to lift Senior Servant Liu up. “How could we let Senior Servant Liu pay respects to us?” 4</p><br/><p>This Senior Servant Liu was one of the senior servants who managed the household and held actual authority. She also had a rather good personality and was someone worth making friends with.</p><br/><p>Chu Lian secretly made note of all this information in her heart.</p><br/><p>When He Changdi saw that she was being so eagerly attentive towards a senior servant on her first visit to the He Estate, he felt even more strongly that her pleasant disposition was nothing more than a facade.</p><br/><p>Following the saying ‘out of sight, out of mind’, He Changdi entered Qingxi Hall first.</p><br/><p>Senior Servant Liu frowned when she saw He Sanlang’s actions. She turned to Chu Lian with a smile and took her hand, personally leading her into the courtyard.</p><br/><p>1. ‘Dalang’ means ‘first son’, and is used in the same way as ‘Sanlang’.</p><br/><p>2. ‘Erlang’ means ‘second son’, and is also an affectionate address like Dalang and Sanlang!</p><br/><p>3. ‘Qingxi’ means ‘celebration’~ While I could have translated it as Celebration Hall, I decided to keep names in pinyin, as the names sometimes don’t have meaning to them. This will keep all the names consistent.</p><br/><p>4. It’s quite normal for servants to pay respects to their masters. However, Chu Lian stopped Senior Servant Liu because of her age and position as a trusted servant of Matriarch He, who is two generations above Chu Lian. This gives Senior Servant Liu a good impression of her.</p><br/>\n</div>"}