{"title": "Chapter 11: Secret Recipe (1)", "id": 11, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-11-secret-recipe-1", "volume_title": "Volume 1", "body": "<h1>Chapter 11: Secret Recipe (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11: Secret Recipe (1)</p><br/><p>Mingyan and Jingyan were second-tier maidservants. How could they have ever had the chance to taste such fine cuisine before? These delicacies were reserved solely for the nobility!</p><br/><p>The four personal maidservants each took a single pastry and carefully placed it in their mouths. They looked like they couldn’t bear to eat it all at once, so instead, they took small, careful bites to savor the pastry like it was some priceless treasure.</p><br/><p>Mingyan and Jingyan even displayed blissful expressions without any restraint.</p><br/><p>Chu Lian watched them curiously. If she hadn’t tasted that pumpkin pastry just now, she would have suspected that there was something wrong with her tastebuds.</p><br/><p>“How is it?” Chu Lian asked quietly. She didn’t want to disturb their enjoyment of the food.</p><br/><p>Mingyan continuously nodded while she licked the sugar left behind on her fingers. “Third Young Madam, it’s delicious!” After saying so, her eyes drifted towards the two pastries left on the dish. She clearly had something else she wanted to say.</p><br/><p>Chu Lian: …</p><br/><p>After listening to all their replies and confirming that the pumpkin pastry was indeed delicious to them, Chu Lian began to despair…</p><br/><p>Surely not! A pumpkin pastry sweet enough to kill someone was delicious to them?</p><br/><p>These four maidservants had come from the House of Duke Ying. Even if their meals weren’t as fine as that of the young masters and ladies, it was still comparable to the meals of a rich commoner’s family. If these were the maidservants’ tastes, and the maidservants’ tastes were the standards of the rich here in the Great Wu Dynasty… Could it be that this was the level of fine dining here? Wasn’t that too poor?</p><br/><p>When Xiyan saw that her mistress’ expression had collapsed, her brows drew together. She thought that Chu Lian was unhappy, so she hurriedly said, “Third Young Madam, do you think that we caused you to lose face?”</p><br/><p>A simple plate of sweets from a noble family’s household had been all that it took to reduce them to such a state. As she recalled their loosened expressions from just moments prior, Xiyan felt that she had done something bad.</p><br/><p>Chu Lian shook her head. This Xiyan was good at everything and put her whole heart into her work. However, she had the habit of overthinking things.</p><br/><p>“How could that be? It’s just a plate of pastries. Don’t tell me that your mistress is such a stingy person in your hearts?”</p><br/><p>They shook their heads, afraid that Chu Lian would misunderstand.</p><br/><p>“Then there’s nothing wrong. Why do you have such troubled expressions? If you like to eat them, then take these pastries and split it between all of you,” Chu Lian said as she smiled.</p><br/><p>Jingyan’s eyes widened. She had a pair of canines peeking out, so she looked especially cute as she smiled and said, “Third Young Madam, if you give them all to us, then… what are you going to eat?!”</p><br/><p>Xiyan had specially gone to the kitchen to bring back these exquisite pastries for Chu Lian. Third Young Madam was one of their masters; they couldn’t let her go hungry.</p><br/><p>Chu Lian rested her chin on her slender hand and replied with an equally carefree manner, “I don’t like to eat these. They don’t suit my tastes.”</p><br/><p>“But Third Young Madam, didn’t you like eating these sort of sweets back at the Ying estate?” Xiyan asked, finding it strange.</p><br/><p>Chu Lian’s expression froze stiff for a moment. Damn it, she had forgotten that Xiyan and Fuyan had been the female lead’s personal maidservants, and as such, they knew everything there was to know about the female lead.</p><br/><p>“It’s not that I don’t like to eat sweet stuff. These pastries just aren’t that tasty.” Chu Lian could only be honest with them.</p><br/><p>Fuyan inwardly snorted with laughter, but didn’t show any of her disdain on her face.</p><br/><p>As the Sixth Miss’ personal maidservant, Fuyan knew exactly how Sixth Miss had passed her days at the Ying Estate. It was considered a good day if the kitchen gave them a few pastries at all. When did they ever get the chance to be this picky?</p><br/><p>Now that she had married into a noble family and had become the Third Young Madam, she immediately started being picky with her food?</p><br/><p>Who was she putting on airs for!</p><br/><p>Xiyan and the other two maidservants stared at Chu Lian in wide-eyed surprise. They couldn’t quite believe what she had said.</p><br/><p>Goodness! Their mistress must have turned silly once she had gotten married. She actually thought that the pastries of the House of Count Jing’an weren’t that tasty?</p><br/><p>Even the empress wouldn’t say something like that.</p><br/><p>The chef who made pastries in House Jing’an was famous throughout high society in the entire capital. On special occasions, the noble families who were on intimate terms with the House of Count Jing’an were proud to receive gift boxes of assorted sweets from the Jing’an Household. Normally, the Jing’an Household wouldn’t hand them out as gifts; if anyone wanted to have the chance to eat such delicacies, they would have to come to the Jing’an Estate as a guest.</p><br/><p>Of course, Chu Lian didn’t know any of this. Although this was the fictional universe of the novel, there was a limit to what had been described. The novel couldn’t possibly explain every single little detail. Thus, something like a famous sweets maker hadn’t been mentioned at all.</p><br/><p>“Third Young Madam, could you possibly be joking?” Mingyan softly asked.</p><br/><p>Chu Lian helplessly shook her head and stood up. She looked around the room. Seeing that there were still some kumquats displayed on the table from the wedding, she walked over and picked one up, thoughts rolling about in her head.</p><br/><p>“Xiyan, come here.”</p><br/><p>Xiyan walked briskly to Chu Lian’s side.</p><br/><p>Chu Lian waved the little kumquat in front of Xiyan. “Do you see this kumquat?”</p><br/><p>Xiyan didn’t know what Third Young Madam wanted, so she simply nodded.</p><br/><p>“Take all of these and wash them, then take some salt and scrub the skin for a while before rinsing it again. Use a small knife to make four cuts in each kumquat and take out all the seeds. Then place the kumquats in a sugar water bath to cook until they turn translucent. After that, take them out and pickle them in honey for two hours.” As Chu Lian spoke, she pointed out where the cuts should be made and taught Xiyan how to remove the little seeds. 1</p><br/><p>The maidservants were flabbergasted. It was only when Chu Lian had finished her instructions that they recovered their senses. However, Xiyan didn’t immediately take the kumquats out to make them into sweets. Instead, she knelt down, knees hitting the floor with a thump.</p><br/><p>Chu Lian was shocked. “What happened? Why are you kneeling down?” She had come from the modern world after all. She really couldn’t get used to how the people in the Great Wu Dynasty liked to kneel down for the slightest cause.</p><br/><p>The other three maidservants looked at Xiyan with envy.</p><br/><p>Xiyan raised her head, the corners of her eyes slightly reddened already. “Xiyan thanks Third Young Madam for teaching this servant a secret recipe! Xiyan will keep it absolutely secret from now on! My lips are sealed!”</p><br/><p>Chu Lian: …</p><br/><p>Chu Lian didn’t know what to say anymore. All she wanted was to eat some candied kumquats. She was too lazy to do it herself, so she had taught Xiyan how to make them. The recipe for these candied kumquats was so easy that anyone could do it after seeing it once. However, these maidservants were treating it like some secret recipe. She was a little embarrassed.</p><br/><p>1. Here’s a recipe I found online for candied kumquats: http://saltandwind.com/recipes/63-make-your-own-candied-kumquats-recipe If you try it out, let me know how it went! :3</p><br/>\n</div>"}