{"title": "Chapter 26: He Sanlang Saves the Day (2)", "id": 26, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-26-he-sanlang-saves-the-day-2", "volume_title": "Volume 1", "body": "<h1>Chapter 26: He Sanlang Saves the Day (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 26: He Sanlang Saves the Day (2)</p><br/><p>Chu Lian had only wanted to make things clear with Xiao Bojian. No matter how much the past ‘Chu Lian’ had liked him, that had nothing to do with her now. She hadn’t expected that Xiao Bojian would lose control after she had made her intentions completely clear.</p><br/><p>This didn’t look good.</p><br/><p>Chu Lian felt helpless. Why was everything exactly the same as in the novel, except for Xiao Bojian and He Sanlang?</p><br/><p>He Sanlang had become bipolar and Xiao Bojian couldn’t handle the slightest bit of emotion. Her dream of living a peaceful life was flying further and further away…</p><br/><p>Her demands weren’t too outrageous, right? All she wanted to do was to live happily and peacefully as a layabout. She didn’t want to attract any trouble at all.</p><br/><p>“Xiao Bojian, we should all calm down. Some things can’t be forced.”</p><br/><p>Chu Lian really had her hands tied. This place was so remote and quiet, and it was also the day of her visit. All the maidservants in the inner court had gone to the outer court to help out, leaving not a single person to be found around here.</p><br/><p>If Xiao Bojian lost control of his emotions and tried to do something, she would definitely be the one on the losing end!</p><br/><p>Xiyan was just a young girl; she couldn’t hold a full grown man back.</p><br/><p>The scorching gaze that had been fixed onto Chu Lian cooled down instantly. It seemed like Xiao Bojian couldn’t bear with it any longer; he pulled Xiyan away and reached out to grab Chu Lian. Since Chu Lian was no longer the ‘Chu Lian’ of the past, her guard had already been up against Xiao Bojian. The moment he had reached for Xiyan, she had already begun to dodge to the other side.</p><br/><p>Chu Lian quickly took a few steps away from him, increasing the distance between her and Xiao Bojian.</p><br/><p>The two of them stood facing each other in the pavilion.</p><br/><p>Not far away, behind a flowering tree, He Changdi had seen everything that had happened from the start. From here, although he could see their every action, he couldn’t hear what they were saying at all.</p><br/><p>However, in his eyes, it was Chu Lian who had found an excuse to rest here in this pavilion in He Court. Madam Rong had then left with her servants. Not long after Madam Rong had left, Xiao Bojian had walked out from wherever he was hiding to meet with this wicked woman.</p><br/><p>This was what that wicked woman had told him herself before he had died in his past life. He thought that she had made it up just to spite him; who knew that it was all true!</p><br/><p>Chu Lian! You’ve got guts! You’re actually using this visit to meet your lover! Although they were merely husband and wife in name, this was an insult to House Jing’an!</p><br/><p>He Sanlang felt like his head was likely shining a bright green.1 Following that, when he saw Xiao Bojian slowly forcing his way closer to Chu Lian and pulling Xiyan away, He Changdi couldn’t wait any longer. He came out from where he was hiding in the greenery with a dark expression, striding with large steps towards the ‘paramours’. He was going to expose them today!</p><br/><p>He Sanlang’s footsteps were heavy and rushed. Chu Lian spotted He Changdi hurrying towards them just by turning her head a little. The worry she had been holding in her heart finally settled down.</p><br/><p>It was good that He Changdi had come. She no longer needed to worry about getting bullied by Xiao Bojian and the consequences of being mistakenly seen by passersby.</p><br/><p>Since she had relaxed, the worry that had been on Chu Lian’s face disappeared. She turned around, lifted the hem of her skirts, and ran towards He Sanlang.</p><br/><p>He Sanlang’s gloomy face unexpectedly met with Chu Lian’s. The girl running towards him was wearing a resplendent pink dress with layers upon layers of skirts. As she ran towards him, the layers of skirts were lifted by the wind, creating the pretty picture of a butterfly. The carefree smile on her face made it seem as if she only had him in her eyes.</p><br/><p>He Sanlang froze.</p><br/><p>Without waiting for him to react, Chu Lian had already reached his side. She picked up his arm in an intimate manner and called out in a coquettish voice that would give even herself goosebumps, “Husband!”</p><br/><p>He Sanlang’s entire body had stiffened thanks to Chu Lian’s touch.</p><br/><p>Wait a minute, wasn’t there something wrong with this picture?</p><br/><p>H-Hadn’t he come here to catch a pair of adulterers? How did it turn into this?</p><br/><p>1. In Chinese culture, ‘wearing a green hat’ means that you’re being cuckolded by your wife. When He Sanlang saw Chu Lian meeting with her ‘lover’, he thought that he had been cuckolded, and thus felt like there was a green aura shining from his head, aka the green hat!</p><br/>\n</div>"}