{"title": "Chapter 28: Explanations (2)", "id": 28, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-28-explanations-2", "volume_title": "Volume 1", "body": "<h1>Chapter 28: Explanations (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 28: Explanations (2)</p><br/><p>Xiyan received the snow cream from Qin’er and pulled up Chu Lian’s slightly long sleeves. She then gently applied the milky, translucent cream onto the slight swell of the blister on the back of Chu Lian’s hand.</p><br/><p>It hurt a little when Xiyan touched it, so Chu Lian jerked out of reflex. Her brows started to furrow.</p><br/><p>Xiyan’s heart ached for her mistress. “Sixth Miss, please bear with it for a moment. It will be done soon.”</p><br/><p>He Sanlang was standing next to Chu Lian, so he could see that burn on her hand out of the corner of his eyes. His brows also unconsciously began to draw together.</p><br/><p>After Xiyan applied a thin layer of the snow cream to the blister, Chu Lian carelessly used her sleeve to hide it. He Sanlang turned away like he had been caught staring at something he shouldn’t have.</p><br/><p>Xiao Bojian was still standing in the pavilion, refusing to leave. He Changdi’s expression changed and he instantly became a polite, elegant gentleman. “Mister Xiao, what a coincidence this is, meeting you here!”</p><br/><p>This was the inner court of the Ying Estate. Men unrelated to the family were generally not allowed into the inner court. Thus, He Changdi’s tone was full of undisguised mockery.</p><br/><p>Xiao Bojian didn’t give a reply. His gaze rested on Chu Lian for a moment, darkness swirling in the depths of his eyes, pressuring Chu Lian. Xiao Bojian made a cupped fist greeting1 to He Changdi, the corners of his lips curled up at a strange angle. It looked like a mix of mocking in return, as well as determination to obtain the object of his desires. He then turned and vanished into one of the gardens of the Ying Estate.</p><br/><p>Qin’er stared in a daze from the side. Although she wanted to report this to Madam Rong, she had felt Xiao Bojian’s icy gaze linger on her before he had left, so she subconsciously decided to keep whatever she had seen to herself.</p><br/><p>Xiyan could sense that the air between Sixth Miss and Young Master wasn’t right, so she tried to interrupt. “It’s almost time for lunch at the outer court.”</p><br/><p>Xiao Bojian had finally left. Although the last look he had cast at her before leaving made Chu Lian feel extremely uncomfortable, she was going to live in the Jing’an Estate from now on. They were probably never going to meet again, so she didn’t need to worry about it for the time being.</p><br/><p>The hold she had around He Sanlang’s arm loosened. He Sanlang felt the change and tossed away Chu Lian’s arms forcefully, coldly harrumphing once. Following that, he bent down and whispered to her in a voice that only the two of them could hear. “My dear wife, I would love to hear your grand explanation for today when we get back home!”</p><br/><p>Then he pulled away, letting the threat linger with her.</p><br/><p>Chu Lian inwardly wailed in anguish. Xiao Bojian had come to find her of his own accord; how was she supposed to explain that…?</p><br/><p>She had even been trying to avoid him!</p><br/><p>After that, it was time to eat lunch with the various senior family members in the Ying Estate. The men and women sat in separate areas. Old Duke Ying personally accompanied He Sanlang to drink over at the men’s side, while it was much more casual for Chu Lian.</p><br/><p>In the beginning, Madam Rong led a toast for Chu Lian. Then, they simply had lunch in quiet.</p><br/><p>Chu Lian wasn’t familiar with the madams and ladies of House Ying at all, so she naturally didn’t have anything to say.</p><br/><p>It wasn’t until close to dusk that He Sanlang and Chu Lian were escorted to the estate’s entrance by the people of House Ying.</p><br/><p>Perhaps He Sanlang had drunk too much due to his anger at Xiao Bojian in the afternoon. Even now, the smell of alcohol still clung to him.</p><br/><p>Chu Lian was worried that he would fall off his horse if he tried to ride it now, so she got Laiyue to support He Sanlang up the carriage.</p><br/><p>It was only after seeing Laiyue set her husband down properly in the carriage that Chu Lian got on.</p><br/><p>They slowly began to move on the wide stone road.</p><br/><p>Chu Lian stared at He Changdi, who was resting against the side of the carriage. He had the strong stench of alcohol around him, making Chu Lian’s eyes water. She couldn’t resist pinching her nose and trying to fan away the smell. Who knew that He Sanlang would pick this moment to open his black eyes? However, he looked sober and not at all drunk.</p><br/><p>His good-looking thin lips parted, but all that came out were words of ridicule. “What, are you disgusted with me just because of a small thing like that? Do you want to throw me out onto the streets and let Xiao Bojian get on this carriage?”</p><br/><p>Chu Lian frowned. She took a long look at He Changdi’s handsome yet cold face, and couldn’t resist bursting out in laughter. Then she reached over with a fair hand and patted He Sanlang’s stiffened face. “My dear husband, you have some really strong paranoia going on there! It makes you so fun to tease.”</p><br/>\n</div>"}