{"title": "Chapter 27: Explanations (1)", "id": 27, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-27-explanations-1", "volume_title": "Volume 1", "body": "<h1>Chapter 27: Explanations (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 27: Explanations (1)</p><br/><p>Of course, Xiao Bojian was watching all of that happen. He stared at the scene with undisguised shock.</p><br/><p>He had never imagined that Chu Lian would do such a thing. She had promised the rest of her life to him in secret before her marriage, yet she was now hugging another man’s arm and acting like a spoiled child, completely dependent on her husband of only a few days. This huge change caused his expression to turn extremely ugly.</p><br/><p>He Changdi had finally regained his senses by now. He was distressingly uncomfortable with Chu Lian’s soft body pressing against his arm. All he wanted to do was get her off of him, and if that meant physically pushing this damned woman away, then he was all for it. However, Chu Lian clung to him like a leech. He couldn’t move her at all.</p><br/><p>With the distance of ten or so steps between them, the two men met gazes; sparks were almost visible in the air between them. In the end, it was He Sanlang who shifted his eyes away first.</p><br/><p>He had already lost the initial panic of having Chu Lian stuck to his arm like a limpet, and had recovered his icy cold expression. He turned his head towards Chu Lian and lowered his eyes, taunting her with the hard edge of his stare. It was the same as asking her, ‘Care to explain?’</p><br/><p>Chu Lian was also finally able to react. She noticed the amazing timing of He Sanlang’s appearance and the contempt in his eyes, and her head started to ache. So he had been watching when Xiao Bojian had suddenly appeared and started to bother her.</p><br/><p>However, Chu Lian was totally innocent. Since she hadn’t done anything to be guilty about, she could raise her head with confidence.</p><br/><p>Chu Lian daringly met his gaze. There wasn’t a single trace of guilt, worry, or fear in her bright eyes. Instead, there were hints of rebuke and coquettish flirting.</p><br/><p>Poor He Sanlang was beginning to feel a little guilty after getting stared at by her big, innocent eyes. He should’ve jumped out earlier to save her from Xiao Bojian the second he noticed him disturbing her…</p><br/><p>Making use of the standstill, Xiyan ran back to her mistress.</p><br/><p>Although he had initially been a little flustered by Chu Lian’s gaze, He Changdi’s expression turned grave the moment he realized the change of his thoughts.</p><br/><p>This… This wicked woman was turning matters upside down!</p><br/><p>She had completely reversed the situation!</p><br/><p>He Sanlang was bursting with frustration. He wanted to expose this wicked woman, but she was clinging onto his arm and acting as if they were a couple madly in love. Anyone who saw this wouldn’t believe that she was an adulterer at all.</p><br/><p>Madam Rong’s maidservant, Qin’er, who had gone to the east compound to get the burn salve, finally returned.</p><br/><p>When Qin’er spotted Xiao Bojian standing in a pavilion in the inner court, she almost leapt in fright. She immediately looked for Chu Lian’s figure. After seeing Chu Lian standing a distance away with He Changdi standing next to her, Qin’er let out a sight of relief. It was fine as long as Sixth Miss’ husband, Sixth Young Master, was here.</p><br/><p>What would they do if rumours came out about the newly wed Sixth Miss and Mister Xiao!</p><br/><p>Qin’er didn’t dare to tarry and hurriedly walked towards Chu Lian. “Greetings to Sixth Miss and Sixth Young Master. This is the snow cream from Eldest Young Madam. Sixth Miss, please apply it as soon as possible.”</p><br/>\n</div>"}