{"title": "Chapter 24: Xiao Bojian (2)", "id": 24, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-24-xiao-bojian-2", "volume_title": "Volume 1", "body": "<h1>Chapter 24: Xiao Bojian (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 24: Xiao Bojian (2)</p><br/><p>Within a short while, they had already reached the pavilion outside He Court. Madam Rong’s servants had already prepared some sweets for them.</p><br/><p>“Sixth Sister, wait here for a moment. Qin’er walks fast, so she’ll be back shortly.”</p><br/><p>“Eldest Sister-in-Law, please rest easy. It’s just a small red patch. It doesn’t even hurt anymore.”</p><br/><p>Although it really didn’t hurt anymore, Chu Lian had been born naturally fair. Her hands were white and smooth, and especially pretty. Now that there was this small patch of redness on the back of her hand, it was extremely noticeable.</p><br/><p>Perhaps due to the burn, the outer layer of skin had started to swell. It looked like a blister.</p><br/><p>However, this small burn wasn’t much to Chu Lian. Now that she had finally left the bamboo forest, she no longer felt like she had a ticking time bomb strapped to her body. Chu Lian heaved a long sigh of relief.</p><br/><p>Some people were just too dangerous to mix with. It was better to get as far away from them as possible.</p><br/><p>However, Chu Lian had really underestimated how strongly the novel wanted the original events to play out along their predetermined path.</p><br/><p>He Sanlang had his gaze fixed on her in secret, an unreadable expression on his face. Her every action had fallen into the depths of his eyes.</p><br/><p>It was at this moment that a maidservant rushed in from afar and whispered something in Madam Rong’s ears. Madam Rong’s expression changed instantly. She hesitated for a moment before apologetically turning to Chu Lian and saying, “Sixth Sister, I have some urgent matters to attend to and I need to leave. It’ll be lunch time in one more hour. Sixth Sister, why don’t you head to the outer court and take a rest first?”</p><br/><p>Chu Lian saw the anxiety in her face and agreed, letting Madam Rong off to attend to her urgent matters.</p><br/><p>Right now, the only two left in the entire pavilion were Chu Lian and Xiyan.</p><br/><p>Just as Chu Lian picked up the teacup before her and was about to take a sip, she heard a pair of light footsteps coming from behind her, and a man’s low, magnetic voice followed. “Lian’er.”</p><br/><p>Chu Lian froze on the spot. When she turned her head and saw the new arrival’s appearance and dressing, she cursed fiercely in her heart. The novel wasn’t going to let her off!</p><br/><p>Wasn’t this protagonist aura1 way too strong!? She had already come all the way here just to hide, but Xiao Bojian had still found her!</p><br/><p>If you’re questioning how Chu Lian could identify the young man before her with just one look, it was because the author had described his appearance in great detail.</p><br/><p>Xiao Bojian was born with good looks. However, in Chu Lian’s heart, He Sanlang was just that little bit more handsome than Xiao Bojian. Though, she couldn’t deny that Xiao Bojian really was an outstanding specimen of a man.</p><br/><p>How should she put it? He looked more metrosexual and had a slight hint of femininity to him; the kind of guy that was popular in the modern world. He Sanlang was more of a dignified and heroic kind of guy.</p><br/><p>Xiao Bojian had a black tear-shaped mole under his left eye, which gave him a trace of captivating charm that was rarely seen on a man.</p><br/><p>With this kind of appearance, if he had been born in the Wei or Jin dynasties, he would have definitely been seen as a homosexual…</p><br/><p>Although the novel had described his appearance vividly, it couldn’t be compared to seeing it with your own eyes.</p><br/><p>Chu Lian felt a headache coming on. She hurriedly stood up to make her escape, but Xiao Bojian quickly strode over and blocked her retreat with his arms spread wide.</p><br/><p>“Lian’er… You… You don’t want to see me anymore?”</p><br/><p>Chu Lian inwardly cursed, hating that she couldn’t just dump him on the spot. However, when she remembered the power this guy had in the future, Chu Lian bore with it patiently. She cast her gaze downwards and didn’t speak. If this guy noticed that she wasn’t the original ‘Chu Lian’ anymore, she would be in huge trouble.</p><br/><p>Xiao Bojian was a man with great ambition who used sneaky, underhanded methods; he was far from the traditional meaning of a ‘good man’.</p><br/><p>Xiyan seemed to have realised how much her mistress didn’t want to interact with the man before her, so she hurriedly blocked Xiao Bojian. “Mister Xiao, men should keep their distance from women. Furthermore, our mistress is already married, please conduct yourself with dignity!”</p><br/><p>Xiao Bojian showed a pained expression as he clenched his fists. His upturned eyes looked upon Chu Lian with deep passion. No one would be able to doubt the depth of his feelings if they saw the look in his eyes.</p><br/><p>He pressed his lips together, his face full of suppressed emotions. “Lian’er, it’s all my fault, I’m useless. Do you hate me so much that you won’t even look at me now?”</p><br/><p>Unseen behind Xiyan, Chu Lian nearly lost her calm to her inner turmoil.</p><br/><p>What the heck! What kind of line was that?! Did he have to act like a Mary Sue? She hadn’t given his lines much thought when she was reading the novel, and at the time, she had even thought he had come across as a little cool, like he wasn’t a very affectionate person. But now that she had to experience this all firsthand, she could feel her brain cells dying by the minute.</p><br/><p>Young man, you’re so handsome that any woman would be ashamed of their own looks in front of you. Isn’t it a little inappropriate to use those lines on a woman?!</p><br/><p>TL Note: My editor and I both choked on the way Chu Lian described Xiao Bojian… *dies laughing*</p><br/><p>1. Protagonist aura – Refers to the way protagonists always attract special events to them XD</p><br/>\n</div>"}