{"title": "Chapter 35: Petty (1)", "id": 35, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-35-petty-1", "volume_title": "Volume 1", "body": "<h1>Chapter 35: Petty (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Matriarch He saw that her grandson was still in a daze, she urged him, “Return to your courtyard quickly. It’s almost dark, and your wife suffered a shock. Reassure her a little.”</p><br/><p>Madam Zou urged him along in the same vein.</p><br/><p>He Changdi absentmindedly returned to his own courtyard, his thick and sharp eyebrows furrowed together, like a pair of wicked swords.</p><br/><p>Back at Qingxi Hall, Madam Zou said in a helpless sort of tone, “Grandmother, it’s going to take a while to repair the main kitchen after this fire. Granddaughter-in-Law will instruct each branch of the family to take care of their own meals in their own courtyards for the time being.”</p><br/><p>Matriarch He nodded. “That’s all we can do for now. Anyway, they do have stoves in their own courtyards. When Erlang comes back, he’ll just have to eat with me.”</p><br/><p>Madam Zou nodded in agreement. “Then Granddaughter-in-Law will go now to prepare.”</p><br/><p>If each courtyard was to cook their own meals, she had to arrange for some servants to send them fresh ingredients everyday. This just added on to the list of tasks she had to manage.</p><br/><p>“Go quickly. I’ll go take a look at your mother and see how her health is like today.”</p><br/><p>Thus, Madam Zou supported Matriarch He and they left Qingxi Hall together.</p><br/><p>Chu Lian was lying down on a wooden chair, reading a comedy that Fuyan had found for her in the study.</p><br/><p>The book was written in traditional Chinese, and the story was old-fashioned, so Chu Lian found it tough to keep reading. The words before her eyes slowly turned into a lullaby, and in just one moment, she was fast asleep.</p><br/><p>The fair hands that were holding onto the book were resting on the armrest of the chair. Because the position was a little awkward, her white sleeves were rolled up, revealing her white and small forearms. Under the orange light of the room, that fair white skin looked like warm jade, giving people the urge to touch it.</p><br/><p>Senior Servant Gui was waiting outside. After she didn’t hear the sound of pages turning for a long time, she put down her embroidery work in her hands and took up a blanket from the side and was about to enter to put it on Chu Lian.</p><br/><p>However, she didn’t expect to see He Changdi walking in with a stiff expression.</p><br/><p>He Sanlang cast a sideways glance at Senior Servant Gui and walked right into the bedchamber.</p><br/><p>He Changdi’s cold look sent chills down Senior Servant Gui’s spine. She was about to follow in to take a look, but she was worried that he would be angry, so she could only bear with her anxiety and wait outside. She kept listening for movement on the inside. The moment anything didn’t seem right, she would walk right in and protect her Third Young Madam.</p><br/><p>He Changdi walked into the bedchamber with his hands behind his back. He swept the surroundings with a cold gaze, and it was only then that he noticed the small lump on the chair by the window.</p><br/><p>The depths of his eyes were really dark. His cool, handsome face carried an icy aura. He looked exactly like a walking ice mountain. He was a completely different person from the nice, loyal husband that the novel had described.</p><br/><p>If anyone tried to describe He Sanlang as a handsome, gentle, and sweet husband, Chu Lian would’ve been the first one to leap up in protest.</p><br/><p>With a long stride, he made it to the chair in just a few steps. His cold gaze slowly shifted downwards and landed on Chu Lian.</p><br/><p>Waves rippled across the surface of the frozen lake in his eyes unconsciously the moment that he saw the scene before him.</p><br/><p>A burst of emotion that shouldn’t have existed suddenly rose up and coiled around him.</p><br/><p>The young girl who had just come of age was petite and soft-looking. Her head was pillowed on one arm. After sleeping on the chair, her black hair had already come loose; a few strands were lying on her slender, rounded shoulders.</p><br/><p>Her eyelashes were long and dark, like two little fans casting shadows over her eyes, setting off a pretty picture. Her skin was practically flawless, smooth and white to match her petal-plush lips. They moved in a pattern along with her shallow, long breaths. She looked exactly like a sleeping kitten, giving watchers the urge to pull her into their arms, pet her little head gently, and coo to her in a soft voice.</p><br/><p>Upon seeing such a defenseless Chu Lian, the showering scene that he had saw that day popped into He Changdi’s mind.</p><br/><p>He had to admit that she was indeed beautiful. Because she was young, even if she didn’t put one bit of makeup on, her face still looked like a beautiful painting. Perhaps this was one of the perks of being a main character!</p><br/><p>He Sanlang blanked out for a good two seconds. Then, his face contorted.</p><br/><p>He berated himself fiercely, scolding himself for fantasising about that wicked woman. How could he be so silly as to think that she was good and harmless?</p><br/><p>He Changdi took a deep breath in, letting the cool night air wake him up. He reached out to push Chu Lian with force, saying in a cold voice, “Get up!”</p><br/><p>Chu Lian was in the middle of a beautiful dream of eating a huge feast in the modern era. After getting pushed by He Sanlang, the book in her hands fell to the ground with a loud plop. She rubbed the sleep from her eyes as she woke up. Without looking properly at the person by her side, she asked, “Momo, is it time to eat? I’m hungry…”</p><br/><p>He Changdi’s face was reflecting his inner turmoil. Upon hearing Chu Lian’s words, it immediately turned as black as a pot.</p><br/><p>Eat, eat, eat! All she knew was how to eat all day! Had this wicked woman suddenly became a foodie in this lifetime?</p><br/><p>“You’re still thinking of food? The kitchen’s already burned down! Don’t think you’ll get anything to eat tonight!” He Sanlang couldn’t hold back his anger as he shouted at her.</p><br/><p>The moment Chu Lian heard his voice, any dregs of sleep were immediately shaken off by her fright.</p><br/><p>With a pair of watery, big eyes, Chu Lian glared up at the man standing tall beside her.</p><br/><p>Her almond-shaped eyes were moist because she had just woken up. There was a faint blush on her cheeks. She looked completely like a harmless, tender young woman. Even if someone listed off all the wicked deeds that she would come to do in the future, there would probably be a grand total of zero who would believe them.</p><br/><p>Her eyebrows furrowed when she looked clearly at the frosty look on He Sanlang’s face. She looked listless as she turned her head and leaned back against the chair once again. “Husband, how are the servants in the main kitchen now? Are there any who were hurt badly?”</p><br/><p>Her voice was soft and pleasant to the ear, however, when He Sanlang heard it, his temper rose for no reason.</p><br/><p>“Heh! Don’t you know perfectly well whether anyone was hurt or not?”</p><br/><p>This wicked woman was probably the one who had ordered someone to set off the fire in the first place! Didn’t she feel that she was being very fake by asking about it?</p><br/><p>Chu Lian found it weird. She puffed up her cheeks like a squirrel. “Well, I wasn’t the one who set the fire off. How would I know?”</p><br/><p>Conversely, He Changdi sneered in response. Her words had clearly angered him. He felt that he couldn’t continue living with this wicked woman for a second longer. His chest was about to explode from the amount of rage bottled up inside. He really just wanted to strangle her to death right now!</p><br/>\n</div>"}