{"title": "Chapter 31: Fire in the Kitchen (1)", "id": 31, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-31-fire-in-the-kitchen-1", "volume_title": "Volume 1", "body": "<h1>Chapter 31: Fire in the Kitchen (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian finally realised what happened. Eldest Sister-in-Law and Senior Servant Liu had made their own conclusions about what had gone on during the ride back to the estate. She had just woken up from a deep sleep, and since she had been eager to get off the carriage, she hadn’t noticed her appearance. And then when He Sanlang had jumped off the carriage looking like that… What else were they supposed to think?</p><br/><p>She secretly glanced at He Changdi. When Chu Lian saw the stormy expression on his face, she hunkered down a little. She really hadn’t done it on purpose. She hoped that He Sanlang could forgive her.</p><br/><p>Senior Servant Liu personally escorted them back to their courtyard. Before she left, she even took care to give He Changdi some indiscreet advice. “I know the two of you are newlyweds, but Third Young Madam is still young. Third Young Master, please restrain yourself a little.”</p><br/><p>He Changdi had almost forgotten about the matter after he had changed into a fresh set of clothes. After getting this kind reminder from Senior Servant Liu, his rage returned.</p><br/><p>He waited for Senior Servant Liu to leave before glaring at Chu Lian and retreating to the study.</p><br/><p>After He Sanlang left, Chu Lian wailed in distress and sat on the window seat.</p><br/><p>Xiyan hid her smile. Senior Servant Gui had already found out what happened. She walked over to Chu Lian and passed her a cup of warm water. After coughing once, she asked Chu Lian lightly, “Third Young Madam, did you and Third Young Master…”</p><br/><p>Before Xiyan could finish her sentence, Chu Lian had already turned to look up at Senior Servant Gui, greatly aggrieved. She then explained everything that had happened inside the carriage, having no other choice but to fight her embarrassment in order to clear the misunderstanding.</p><br/><p>It was only then that Xiyan found out the truth. She couldn’t hold back anymore and let out her laughter.</p><br/><p>Chu Lian rested her chin on her arms and looked out the window. She intended to admire as much of the fading spring scenery as she could, studiously ignoring Senior Servant Gui and Xiyan’s ceaseless laughter.</p><br/><p>So there had been such a huge misunderstanding. No wonder Third Young Master was wearing such an ugly expression, Senior Servant Gui thought to herself.</p><br/><p>Senior Servant Gui was used to Chu Lian’s personality and knew that she didn’t like others laughing at her, so she tried to regain control of herself by asking, “Third Young Madam, what would you like to eat? This old servant will be heading to the main kitchen in a bit, and will fetch anything Third Young Madam fancies.”</p><br/><p>Chu Lian had been daydreaming when she suddenly heard Senior Servant Gui mention a trip to the main kitchen. It was only then that she remembered a certain event in the novel: there would be a fire in the Jing’an Estate’s main kitchen today. Eldest Sister-in-Law, Madam Zou, had been injured in that fire.</p><br/><p>Chu Lian thought for a bit before hurriedly getting up. “Momo, I haven’t seen what the main kitchen in our estate looks like. I’ll go with you!”</p><br/><p>Senior Servant Gui hesitated for a moment. “Third Young Madam, you’ve just come back from the Ying Estate. Why don’t you have a good rest?”</p><br/><p>Chu Lian saw that Senior Servant Gui didn’t seem too willing to let her follow along, so she quickly shook Senior Servant Gui’s arm like a spoiled child. Senior Servant Gui couldn’t withstand her pleading when she acted like this, so she could only shake her head and give in.</p><br/><p>“Alright, let’s go, let’s go. Xiyan, come with us as well. Third Young Madam can take a walk in the gardens outside the kitchen. When it’s this close to mealtimes, there’ll be too many servants coming in and out, so please don’t enter the kitchen, Third Young Madam.”</p><br/><p>Chu Lian nodded and agreed before following Senior Servant Gui and Xiyan out to the main kitchen of the Jing’an Estate.</p><br/><p>The main kitchen was located in a second-tier building in the west part of the estate.</p><br/><p>It took about seven minutes to even walk there. Chu Lian was a little anxious, so she walked faster. It wasn’t until they were close to the main kitchen and there was no sign of any thick smoke that Chu Lian heaved a huge sigh of relief.</p><br/><p>Senior Servant Gui was wondering why Third Young Madam seemed to be acting a little oddly. Since Chu Lian settled down when they were about to reach their destination, she didn’t ask about her weird behaviour.</p><br/><p>“Third Young Madam, please wait in the garden. This old servant will come back to report to you after I take a look over there,” Senior Servant Gui said, smiling as she spoke.</p><br/><p>Chu Lian nodded, and didn’t forget to give her a reminder at the same time. “Momo, go quickly. It’s getting late.”</p><br/><p>Senior Servant Gui patted Chu Lian’s hand to reassure her. She then headed for the main kitchen, using large strides to hasten her pace.</p><br/>\n</div>"}