{"title": "Chapter 48: Bloated From Eating (2)", "id": 48, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-48-bloated-from-eating-2", "volume_title": "Volume 1", "body": "<h1>Chapter 48: Bloated From Eating (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In the time it had taken to change her clothes, the wontons had cooled down significantly, and it was just the right temperature to eat now.</p><br/><p>The scallion pancakes were as big as her two palms, so Mingyan came over to help her tear them into smaller pieces. However, Chu Lian stopped her.</p><br/><p>It was Third Young Madam who had taught her how to make the pancakes, so of course, there was no one who understood them better. Mingyan quietly retreated behind Third Young Madam.</p><br/><p>There was a small dish filled with an unknown sauce and shredded radish on the table. Chu Lian took a small spoon and poured half a spoon of the sauce onto the golden pancakes. Then, she picked up some shredded radish and placed them on top. It was only then that she folded up the pancake and took a bite.</p><br/><p>The couple sitting at the table didn’t speak to each other; they simply ate their own dishes in peace… or so it appeared. Actually, He Changdi was watching Chu Lian’s actions out of the corner of his eye.</p><br/><p>He was baffled by her pancake-eating technique, which he had never seen before in his entire life. He Changdi turned his gaze back to the original serving plate, but unfortunately, it was empty.</p><br/><p>The look in his eyes was deep and carried traces of disappointment.</p><br/><p>Chu Lian was so focused on eating the pancake on her plate that she didn’t notice He Sanlang’s expression.</p><br/><p>She hadn’t been able to find a proper vegetable oil, and the quality of the flour here wasn’t as good as back in the modern era, so the scallion pancakes weren’t as tasty as she remembered. Chu Lian didn’t like to eat oily foods, so she couldn’t help wrinkling her brows as she ate.</p><br/><p>He Sanlang, who was watching her every move, noticed the change in her expression.</p><br/><p>Indignation on behalf of the pancake filled him to the brim.</p><br/><p>With jade chopsticks in hand, He Changdi turned his attention back to the remaining pieces on his personal serving dish. After a moment of pause, he picked one up and reached out to dip it in the small dish of sauce, placing the piece of pancake in his mouth directly after.</p><br/><p>Mmm… It was much tastier than eating the pancake by itself. Although the sauce was a little salty, it also tasted fresh somehow. He had no idea what the sauce was made of.</p><br/><p>After learning the merits of this new technique, He Sanlang ate a few more pieces all in one go. When he ran out of pancake on his plate, he sent Mingyan, who was awaiting orders at the side, a meaningful look.</p><br/><p>Mingyan trembled under his gaze. She hurriedly lowered her head and tried to erase her presence; even her breathing became lighter.</p><br/><p>Chu Lian was focused on polishing off the wontons in her bowl and hadn’t noticed his little actions.</p><br/><p>However, she wasn’t able to finish off the last piece of scallion pancake. After eating half of it, she placed it back onto her plate.</p><br/><p>Seeing that Chu Lian had pushed her bowl away and was looking like she was full, Mingyan quickly brought her a warm handkerchief to clean her hands.</p><br/><p>Without waiting for Chu Lian to take the handkerchief from Mingyan, He Changdi tapped on the surface in front of her and uttered a low command. “Finish it.”</p><br/><p>Chu Lian: ……</p><br/><p>She looked down at the last piece of pancake on her plate. It was a little cold by now, and it definitely wouldn’t taste as good as when it had been freshly made. Chu Lian thought it looked utterly unappetising and wasn’t willing to eat it at all.</p><br/><p>What was up with this He Sanlang? It was bad enough that he wasn’t willing to talk to her, but at least whenever he did, she could just act like she hadn’t heard anything. However, now he was even trying to control her meals. She hadn’t forgotten that he had purposely taken away her dinner yesterday.</p><br/><p>“I’m not eating that, I’m already full.”</p><br/><p>Actually, He Changdi wasn’t trying to stop her from wasting food. It was just that leaving such a delicacy uneaten was equivalent to a grave crime in his eyes, so he refused to sit by and watch Chu Lian commit such a ‘sin’.</p><br/><p>“Finish it. There are many people who don’t even have the chance to eat such good food.”</p><br/><p>Chu Lian furrowed her brows, starting to feel annoyed. It was just a single piece of scallion pancake. What did it matter if she couldn’t finish it? Did she absolutely need to force herself past her limits and make herself uncomfortable just to finish that one piece?</p><br/><p>“I said I’m not eating it! If you want to finish it, finish it yourself!”</p><br/><p>By now, Senior Servant Gui and the other maidservants were already wearing a set of strange expressions. Before they could properly recover, an even stranger scene began to play out before their very eyes.</p><br/><p>He Sanlang didn’t continue forcing Chu Lian to eat the remaining pancake. Instead, after giving her an unreadable glance, he reached over to the porcelain plate in front of Chu Lian and picked up the pancake with his jade chopsticks, placing the piece directly into his mouth.</p><br/><p>The pancake was a little cold and wasn’t as delicious as the rest he had eaten earlier. However, the taste of the sauce and the shredded radish on the pancake was even stronger.</p><br/><p>He Changdi finished Chu Lian’s leftover half in just a few bites…</p><br/><p>His sudden action caused Chu Lian and everyone else in the room to freeze and stare.</p><br/><p>Chu Lian looked at him with a weird expression. Wasn’t this guy disdainful of her? How could he just eat her leftover food without any care at all? She must be seeing things!</p><br/><p>It was only after he had swallowed the last bite of pancake that He Sanlang finally realised what he had done. His originally cold expression stiffened. With one glance toward the wide-eyed Chu Lian, He Sanlang quickly stood up and tossed out, “I’m going to the outer court,” before striding out of the room.</p><br/><p>Chu Lian turned to watch him as he left. For some reason, he seemed like he was running away…</p><br/><p>He Sanlang quickly stepped out of his courtyard and only slowed down when he finally reached his study in the outer court. There, he took the time to rub his stomach gingerly.</p><br/><p>He Sanlang froze.</p><br/><p>It began to dawn on him that he had somehow lost his usual restraint on his appetite, and had actually eaten too much…</p><br/>\n</div>"}