{"title": "Chapter 51: Mother-in-law (1)", "id": 51, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-51-mother-in-law-1", "volume_title": "Volume 1", "body": "<h1>Chapter 51: Mother-in-law (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When Prince Jin met He Changdi’s gaze, he could see faint grief reflected in his unreadable depths.</p><br/><p>“Your Highness, there are some things I can’t tell you now, but I can promise you this: there’s a reason behind why I absolutely have to go to the northern border!”</p><br/><p>By the time He Sanlang left Yuehong Restaurant, it was already past 1pm.</p><br/><p>Prince Jin stood by the window and watched as his best friend’s carriage disappeared around the corner of the street. He then turned away, appearing to be in deep thought.</p><br/><p>……</p><br/><p>When Chu Lian finished her breakfast, she immediately headed to Matriarch He’s courtyard to give her daily greetings.</p><br/><p>All the ladies of the Jing’an Estate were gathered in Qingxi Hall, except the bedridden Countess Jing’an.</p><br/><p>The moment Chu Lian entered the hall, Matriarch He immediately turned to look at her. When she saw her dressed in light blue, she recalled that He Sanlang had also been wearing the same colour when he had dropped by Qingxi Hall on his way out this morning. Matriarch He smiled.</p><br/><p>Excluding her two nieces, Chu Lian was the youngest in the family. After she greeted the matriarch, she was pulled up to Matriarch He’s side.</p><br/><p>“Lian’er, have you gotten used to living here in the estate these past few days?” Matriarch He spoke in a warm, friendly tone, tinged with that special kindness the older generation always seemed to have. It was the kind of tone that made others want to draw closer to an elder.</p><br/><p>Chu Lian nodded and looked at the matriarch, her eyes crystal-clear and moist. “Yes, I have. Granddaughter-in-Law thanks Grandmother for her concern.”</p><br/><p>“Sanlang went out so early today, I’m afraid he won’t be back until evening. Why don’t you and your eldest sister-in-law come over to eat with Grandmother for the midday meal?”</p><br/><p>Chu Lian nodded and agreed.</p><br/><p>After sitting at Qingxi Hall for about an hour, she went to visit Countess Jing’an’s courtyard together with Madam Zou.</p><br/><p>Even before they entered, they could hear Countess Jing’an coughing terribly.</p><br/><p>Madam Zou frowned; it was at this moment that Countess Jing’an’s personal maidservant, Miaozhen, stepped out to retrieve some medicine.</p><br/><p>When Miaozhen spotted the two mistresses standing at the entrance, she greeted them. “Eldest Young Madam, Third Young Madam, good morning.”</p><br/><p>“What happened to Mother? Why does it seem like her condition has worsened since yesterday?” Madam Zou asked Miaozhen with her brows drawn together.</p><br/><p>Grimacing, Miaozhen replied, “This servant doesn’t know either. The medicine appeared effective at first. During the past few weeks, Madam could even get out of bed and occasionally walk about. However, these days, the medicine seems to have stopped working completely. Even though Madam has been drinking it regularly, there’s been no change to her condition.”</p><br/><p>While standing next to Madam Zou, Chu Lian dipped into her memories and tried to recall what she had read in the novel. There had been no mention of Countess Jing’an’s exact illness. However, looking at the symptoms, if it wasn’t pneumonia, then it was most likely tuberculosis. In this era, there was almost no chance of treating illnesses like those; they could only extend their lives for a bit with medicine.</p><br/><p>“Go ahead and brew the medicine. I’ll go in to look at Mother with my sister-in-law.”</p><br/><p>By the time they finished visiting their mother-in-law, Madam Liu had already gone to sleep from exhaustion. Her face was extremely pale. Even while sleeping, she still looked haggard from her extended illness.</p><br/><p>They heard from Miaozhen that Madam Liu hadn’t had a proper meal in days. She couldn’t keep anything down due to her sickness.</p><br/><p>She had been able to eat those pastries that Cook Zhou had made previously, but now that Cook Zhou had passed on, Countess Jing’an wasn’t able to stomach eating anything else.</p><br/>\n</div>"}