{"title": "Chapter 56: A Heart-to-heart Talk (1)", "id": 56, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-56-a-heart-to-heart-talk-1", "volume_title": "Volume 1", "body": "<h1>Chapter 56: A Heart-to-heart Talk (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>She folded the dowry list back up and began to play with it, tapping it against her other palm.</p><br/><p>Chu Lian abruptly asked, “Momo, I can’t really remember… Was there any money in my dowry?”</p><br/><p>Senior Servant Gui cast a careful glance at her. Afraid some misunderstanding would arise in Chu Lian’s heart, she said in a measured tone, “Of course there’s money! Why wouldn’t there be?”</p><br/><p>Due to Sixth Miss’s unhappiness over the match, on the day of her marriage, Senior Servant Gui had kept the banknotes that the presiding lady of the house, the wife of House Ying’s heir, had sent over. After Chu Lian had married over, she had been frightened by the way her mistress and her new husband were interacting, so she had completely forgotten about the money in her care.</p><br/><p>Finally, something that wouldn’t disappoint her. Chu Lian’s eyes instantly lit up and, with a degree of urgency, she asked, “How much?”</p><br/><p>Senior Servant Gui looked a little put on the spot. She awkwardly chuckled and held up five fingers.</p><br/><p>Chu Lian returned the smile. “Five hundred taels?”</p><br/><p>Senior Servant Gui’s eyes widened in shock. She hadn’t expected Chu Lian to get the figure right. Wouldn’t most noble ladies guess five thousand taels instead?</p><br/><p>Seeing Chu Lian smiling happily, Xiyan’s heart felt like it was being crushed. Conversely, Chu Lian’s seeming happiness and contentment with that sum made her heart ache even more for her mistress.</p><br/><p>Although the House of Duke Ying had no qualified successors and was slowly becoming a shell of its former self, a starving camel was still bigger than a horse. When the main branch’s illegitimate fourth miss had gotten married, due to the favour of the main branch’s legitimate wife, she had been sent out from the house with a thousand taels of silver as dowry!</p><br/><p>Their young miss was a legitimate daughter of House Ying, yet she had to suffer this kind of treatment.</p><br/><p>“Sixth Miss…” Xiyan called out in a low voice.</p><br/><p>Every time this girl called out to her with a voice that sounded as if she was about to cry, Chu Lian knew that Xiyan had probably gotten sad over her circumstances, without being able to see it from a lighter perspective.</p><br/><p>So, when Chu Lian spoke again, it was with a clear, calm voice. “What’s there to be sad about? Five hundred taels isn’t a small sum either. A family of three can live for a year with ten taels! Furthermore, my mother died when I was young. Are you really expecting a motherless child to be treated the same as a child with a mother? Although my dowry’s a little small, I’ve married a good husband, haven’t I? The family elders here are all easy to get along with, too. What is there to be unhappy about? I’ve already accepted all this, so can’t you guys accept it too? Anyway, who cares if there’s less money? We just have to earn more ourselves! In this world, there’s nothing easier to solve than a lack of money!”</p><br/><p>Buried in Chu Lian’s words were her incredible self-confidence and willpower. She had been able to stand strong and unyielding in order to survive in that technologically advanced world, where humans had become even more twisted. How could the simple civilisation of this Great Wu Dynasty pose a problem to her?</p><br/><p>To enjoy life, you have to be able to bear with its stresses. This was something a smart woman should know.</p><br/><p>Senior Servant Gui and Xiyan were shaken by Chu Lian’s words. Since Senior Servant Gui was older and more experienced than Xiyan, she recovered a little more quickly. She nodded, gratified that the tender, young flower she had raised had finally broken free from its bindings and blossomed into a beautifully fragrant bud. Chu Lian was no longer a single, lone sprout that was struggling to grow in a swamp.</p><br/><p>However, Xiyan was still in a daze. Chu Lian’s sweet, clear voice was still ringing in her ears: “In this world, there’s nothing easier to solve than a lack of money!”</p><br/><p>What an arrogant, yet confident phrase that was. How many humans in this world would toil their lives away — maybe even to the point of throwing away their lives — for the sake of a few dirty, copper coins? The saying, ‘everyone works for money’, didn’t spring up from nothing.</p><br/><p>Xiyan could almost see a faint, white glow around Chu Lian; it was almost like she was a god who should be revered by all men. She realised that her mistress was looking at her with a gentle gaze. Suddenly, immense relief flooded through her. The unfair treatment at the Ying Estate and the old grievances buried inside her instantly turned into tiny golden specks and disappeared.</p><br/><p>“Yes, as Mistress commands it. This servant will always obey Sixth Miss.”</p><br/><p>Chu Lian tilted her head. Upon seeing that Xiyan had burst into a bright smile, exposing her two cute little canines, Chu Lian also felt happy for her.</p><br/><p>This girl had complex issues hidden in her heart. If she could let go of all her mental burdens just like today, then maybe she wouldn’t die in vain like ‘Chu Lian’ had.</p><br/>\n</div>"}