{"title": "Chapter 55: Dowry (3)", "id": 55, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-55-dowry-3", "volume_title": "Volume 1", "body": "<h1>Chapter 55: Dowry (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xiyan led the way and Senior Servant Gui followed by Chu Lian’s side. However, both of them had their heads lowered with strange expressions on their faces. Their gazes drifted frequently to Chu Lian, who was clearly in a good mood with a smile on her lips.</p><br/><p>Songtao Court was not far from the couple’s storeroom. They were able to reach their destination in just five minutes.</p><br/><p>Xiyan instructed the maidservant watching the door to leave. Then, she personally opened one of the rooms with a key. “Third Young Madam, most of your dowry was placed here.”</p><br/><p>Although the room wasn’t very well-lit, it was still daytime, so the light streaming in from the window allowed Chu Lian to clearly see everything inside.</p><br/><p>It was a large room with a few rows of antique shelves. The shelves were completely empty, as were the few quality open cabinets scattered around. Right at the back of the room, there were a few red painted wooden boxes placed in a corner. Thanks to the significant empty space, the red boxes were extremely eye-catching.</p><br/><p>The moment she entered, Chu Lian couldn’t keep up the slight upward tilt of her lips. She looked around the room with widened eyes before turning to look at Senior Servant Gui.</p><br/><p>Senior Servant Gui shot Xiyan a look and Xiyan hurriedly stepped forward, holding onto Chu Lian’s arm. “Third Young Madam, why don’t you take a seat over there? This servant will bring over the boxes with momo to let Third Young Madam look over everything.”</p><br/><p>Chu Lian looked suspiciously at Xiyan, who avoided her gaze. She let herself be led to the table without a word.</p><br/><p>Following that, Senior Servant Gui and Xiyan set down four or five boxes in front of her. Although they were wooden and about as tall as a person’s waist, the two women alone could carry them. It was clear that there wasn’t much in them.</p><br/><p>Senior Servant Gui pulled out a list wrapped in red leather and passed it to Chu Lian. She carefully picked her words as she said, “Third Young Madam, this is the list of all the items in your dowry. Take a look and see if there’s anything wrong.”</p><br/><p>When Chu Lian had instructed Xiyan to retrieve the key to the storeroom, Senior Servant Gui had been thinking over why Chu Lian wanted to see her dowry. In the end, she decided that it was most likely because Chu Lian was afraid that something was missing from it and wanted to go through every item once again.</p><br/><p>Chu Lian was smiling as she took the list and opened it. Her almond-shaped eyes swept down the list once and mentally tallied them up. Upon seeing that there was a total of 99 items, she inwardly nodded, satisfied with the amount.</p><br/><p>Thus, she started reading out the list with some excitement, beginning from the very first item. She even got Senior Servant Gui and Xiyan to bring over the item to let her see.</p><br/><p>“Exquisite Four Season Screens,” Chu Lian read.</p><br/><p>Senior Servant Gui and Xiyan exchanged glances before pulling out a screen frame and several embroidered screens, placing them on the table in front of Chu Lian.</p><br/><p>Xiyan spoke up timidly. “Third Young Madam, if we set up this screen and take it apart again, the embroidery might get damaged. If you don’t need to use it right now, it would be better not to set it up.”</p><br/><p>Chu Lian was completely stunned. First, she looked at the description in the dowry again before looking up at the item before her eyes. She didn’t know whether to laugh or cry. The elegantly named ‘Exquisite Four Season Screens’ was clearly just a few embroidered screens with some pieces of wood painted over… Although she wasn’t an expert at appraising the value of things, she could still tell just by looking at it that these screens weren’t worth much at all. They were probably barely worth ten taels or less.</p><br/><p>After looking at a few more items, they were all about the same as the screens. They seemed extravagant, but weren’t of any actual value at all. While a little pretty, they were nothing compared to real treasures.</p><br/><p>Finally, Chu Lian got too lazy to look at the rest of them. She waved her hand and got Senior Servant Gui to close all the boxes and put them back. Then, she held the dowry list in her hands and blanked out.</p><br/><p>She had looked through the list carefully. There were almost 100 items in her dowry, but none of them were really worth anything. Judging by Senior Servant Gui’s attitude, the only thing of value was a small yellow jade seal. She had already taken it out and personally put it into the pouch she carried with her at all times.</p><br/><p>Other than the hundred items here, there was nothing else. There were no shops, no holdings, or even any farmland. Not a single one!</p><br/><p>Chu Lian laughed bitterly to herself in her heart. So she wasn’t really all that lucky after all.</p><br/><p>Compared to Madam Liu’s dowry, her dowry was way too shabby.</p><br/>\n</div>"}