{"title": "Chapter 59: Returning Home Late (2)", "id": 59, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-59-returning-home-late-2", "volume_title": "Volume 1", "body": "<h1>Chapter 59: Returning Home Late (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This afternoon, He Sanlang had specially gone looking for his second brother before his patrol, and then had followed him into the palace. After waiting under a lush apricot tree in the outer palace, he had caught a little girl falling from the apricot tree.</p><br/><p>This little girl was ten-year-old Princess Leyao, the child of the Emperor and Imperial Concubine Wei. Imperial Concubine Wei was in favour with the Emperor, and thus, Princess Leyao also became one of the Emperor’s beloved children.</p><br/><p>Imperial Concubine Wei didn’t have any other children, let alone any princes, so her only daughter was extremely important to her.</p><br/><p>In his previous life, Princess Leyao had climbed the apricot tree out of mischief and had fallen off one of the courtyard walls, hitting the back of her head and dying later on. The Emperor and Imperial Concubine Wei had flown into a rage and punished the Dragon Guards who had been on patrol that day.</p><br/><p>In this life, He Sanlang had saved Princess Leyao, so naturally, the Dragon Guards were spared from punishment.</p><br/><p>A heroic deed like this should have been announced publicly with great reward. However, Princess Leyao was already ten. If this were to be announced, the princess’s reputation might be damaged. Thus, He Sanlang requested that the Emperor hide this matter.</p><br/><p>Seeing that He Sanlang was smart and sensible, the Emperor had a good impression of him and asked what kind of reward he would like. He Sanlang refused to mention any reward, but made a small request of the Emperor. He also politely rejected Imperial Concubine Wei’s offer of rewards.</p><br/><p>The moment he left the palace, he was taken by his second brother to a restaurant, where all the Dragon Guards on patrol had thanked him.</p><br/><p>There, he couldn’t avoid drinking a round of wine with them.</p><br/><p>He Changjue drank a little too much and leaned against his younger brother, asking him whether he would use this opportunity to enter the imperial court. He Sanlang looked at his oblivious older brother and could only shake his head.</p><br/><p>As sons of a military house, the imperial court and the capital weren’t places they could easily step into.</p><br/><p>Unfortunately, it was no longer the era of the previous emperor. The current emperor favoured civil officials over the military. The sons of the military families couldn’t possibly join the imperial examinations; they could only reach a high position through military achievements. They might not have any inkling of it now, but if they couldn’t stabilise their power base in three to five years’ time, then it would be hard for them to gain any traction in the capital as a military official. This wasn’t an exception even for families like theirs, with generals serving out at the borders.</p><br/><p>After returning to the estate with heavy thoughts weighing on his mind, He Sanlang was met with a cold, dark courtyard. Naturally, he wasn’t too happy.</p><br/><p>He thought back to how he had listened to his grandmother’s stories back when he was a young child. She had spoken of her shared love with his grandfather, and how they had overcome all manner of disasters together. He could only find it laughable that he had dreamed of marrying someone like that himself.</p><br/><p>When he remembered his previous life, he felt that the creatures he couldn’t trust the most in this world were women. Underneath those beautiful exteriors laid the hearts of snakes and scorpions.</p><br/><p>After shutting his eyes for a moment, he heard a set of light footsteps from outside and Laiyue entered the study soon after.</p><br/><p>“Young Master, here’s the sobriety soup. Please drink it quickly while it’s hot.”</p><br/><p>He Changdi scanned the table and could only see a bowl of soup and nothing else. He turned his gaze onto Laiyue, who instantly began to fidget awkwardly, stammering as he reported, “There’s nothing already cooked in the kitchen. All the meals were prepared by Third Young Madam and her maidservants these two days, so the temporary cooks were sent back and there’s only a senior servant left to watch the kitchen. This… this servant doesn’t know how to cook.”</p><br/><p>In other words, while there were fresh ingredients in the kitchen, there wouldn’t be any supper without a cook.</p><br/><p>It was in the middle of summer, so to prevent any food from spoiling, they only cooked meals when needed. Furthermore, the food made from Chu Lian’s secret recipes was so delicious that no one would leave any leftovers.</p><br/><p>Laiyue looked anxious as he carefully watched his master’s face.</p><br/><p>Seeing He Changdi’s sinister expression, Laiyue’s pupils flickered as he tried to think of a way to resolve the situation. “Young… Young Master, this servant saw that there was still something to eat in the kitchen.”</p><br/><p>“Hm?”</p><br/><p>Laiyue could only soldier on. “The watch servant said that Third Young Madam made some snow fungus and lotus seed porridge. It’s sitting on a small fire now and it’s meant for breakfast tomorrow. And… and she said that it’ll only be good once it’s brewed long enough.”</p><br/><p>Something that Chu Lian made? That she was keeping to eat all for herself?</p><br/><p>He Sanlang coldly harrumphed and said, “Bring it here.”</p><br/><p>Even if that wicked woman had made it for herself, it would be perfectly reasonable for him to try some of it.</p><br/><p>“Ah?” Laiyue had a conflicted expression. This… This wouldn’t be good. What was wrong with Third Young Master? Why did he keep trying to steal Third Young Madam’s food? He was like a young child racking his brains, trying everything he could to provoke the person he liked even as she kept ignoring him.</p><br/><p>Of course, he didn’t dare to say something like that out loud.</p><br/>\n</div>"}