{"title": "Chapter 52: Mother-in-law (2)", "id": 52, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-52-mother-in-law-2", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Mother-in-law (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When the two sisters-in-law stepped out of Madam Liu’s courtyard, they made a turn into one of the estate’s small gardens. They each had a crimson jade bangle in hand. The vibrancy of the bangles’ colour made it obvious how priceless it was. Madam Liu had come from a great noble family. Her dowry back then had been extremely rich and filled with extravagant treasures. This was something that Madam Zou told Chu Lian much later on.</p><br/><p>Chu Lian looked at the bangle in her hands awkwardly. These two red jade bangles were a pair; she and Madam Zou had each gotten one. Chu Lian had never seen such a valuable accessory in her life before, and although she had received quite a few treasures from the tea ceremony that day, they paled in comparison to this red jade bangle.</p><br/><p>Madam Zou caught sight of her uneasy expression and smiled reassuringly. “Since Mother decided to give these to us, just keep it. Mother won’t be happy if you reject her gift.”</p><br/><p>Chu Lian could only nod. Since she had already accepted it back in Madam Liu’s room, she couldn’t possibly go back to return it at this point.</p><br/><p>Madam Zou passed her own bangle to one of her maidservants, instructing her to wrap it up and keep it carefully. She then pulled Chu Lian to a winding corridor covered in purple wisterias. As they walked slowly along the corridor, Madam Zou suddenly sighed. “Actually, Mother probably doesn’t have much left in her dowry. These two bangles are probably the last of the more valuable ones.”</p><br/><p>Noticing the perplexed expression on Chu Lian’s face and wanting to tell her more, Madam Zou waved away the personal maidservants following behind them. The maidservants hurriedly stopped where they stood, allowing Madam Zou to pull Chu Lian further away from the extra listening ears.</p><br/><p>Once there weren’t any outsiders around to listen in, Madam Zou began to open up. “Third Sister, I’m sure you must have heard the details of Mother’s illness.”</p><br/><p>Although He Sanlang had never told her about it before, Chu Lian knew how serious Countess Jing’an’s illness was. The book had also mentioned that Countess Jing’an was frequently bedridden.</p><br/><p>Chu Lian nodded.</p><br/><p>“You might know a few bits and pieces… The imperial physicians don’t have any way to treat Mother’s illness. They can only delay its progression with specially made medicine. But the medicine requires various types of expensive herbs, and quite a few of them cost over a thousand gold taels. Although House Jing’an is quite influential, Father isn’t around to manage the household, and he’s not the best at generating income for the family, either. If not for the fewer mouths to feed and our simple expenses, as well as the matriarch occasionally adding some income from her personal businesses, the household would be living in a much poorer state. Mother’s medicine costs a lot, and in the beginning, the money came from the household accounts.” Madam Zou raised a single finger.</p><br/><p>“A thousand taels. It costs a thousand taels just to buy the herbs to make her medicine every month. Father earns a thousand strings of coins annually as a general. If you put together all the earnings from all the holdings and stores under our family, that’s only about a thousand more strings of coins…”</p><br/><p>House Jing’an paid Countess Jing’an’s medicine fees for two years. Afterwards, Countess Jing’an told Madam Zou to remove that expense from the household accounts. Countess Jing’an then paid for her medicine out of her own dowry.</p><br/><p>In the next few years, Countess Jing’an’s dowry was close to spent. There wasn’t much left to her name now.</p><br/><p>Furthermore, the Liu family had broken one of the emperor’s taboos a few years back, so they had been demoted. The entire clan had left and settled down in the countryside, near Luoyang. Thus, Madam Liu was left all alone in the capital, and without any financial support from her maiden family, her dowry dwindled down even faster.</p><br/><p>Chu Lian was shocked by the revelations. Although she had just arrived in this era, after listening to Xiyan and the other maidservants chatting over the past few days, she had started to learn the approximate value of money in this Great Wu Dynasty.</p><br/><p>The copper coins used in the current era were ‘Kaiyuan’ coins. 1000 coins could be exchanged for one silver tael. There were 1000 coins in a string of coins. Without taking into account the fluctuation of bronze and silver prices, and going by a common family’s standard of living in the Great Wu Dynasty, 10 silver taels was enough to support a family of three for a year.</p><br/><p>Even the minor stewards in the Jing’an Estate weren’t given more than a single silver tael as their monthly salary.</p><br/><p>Meanwhile, Countess Jing’an required over 10,000 strings of coins every year for medicine alone; this was an extremely shocking amount!</p><br/><p>No wonder Madam Zou had said that Countess Jing’an had barely anything left in her dowry by now.</p><br/><p>Count Jing’an’s annual salary was only enough to cover a month of medicine costs for Madam Liu.</p><br/><p>Seeing the surprise and shock in Chu Lian’s eyes, Madam Zou patted her hand. “I’m not telling you all this to put any pressure on you. I only wanted to let you realise how well Mother treats us, despite how poor she is. I hope you continue to treat her well in the future.”</p><br/><p>TL Note: 1000 bronze coins = 1 string of bronze coins = 1 tael of silver.</p><br/><p>Count Jing’an earns 1000 taels a year, but Countess Jing’an spends 1000 taels a month on medicine. Poor Countess…</p><br/>\n</div>"}