{"title": "Chapter 74: He Finally Did Something Right (1)", "id": 74, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-74-he-finally-did-something-right-1", "volume_title": "Volume 1", "body": "<h1>Chapter 74: He Finally Did Something Right (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>On the day that He Changdi had abandoned his wife to join the army, Chu Lian had been sound asleep in her nice, warm bed, without any dreams to disturb her slumber.</p><br/><p>On the other hand, He Sanlang was bringing Laiyue along his hasty journey down the roads at Zhangzhou, a city near the capital.</p><br/><p>Although no one back in the estate knew of the path he was going to take to the northern border of Liangzhou, to avoid getting chased, he travelled at double the usual speed, day and night.</p><br/><p>It was still in the middle of summer, so even though the skies turned dark during the night, there were no cooling breezes to lighten the heat. Not only that, it was so stuffy and hot that their tolerance wore thin.</p><br/><p>The two horses flew down the highway with their riders both laden with cloth packs. Although the breeze created by their horses’ movement was a little cooling, after getting jolted around on horseback for an entire day, even the sturdy He Sanlang was nearing the ends of his endurance.</p><br/><p>While bearing with the burning pain coming from their inner thighs, the two of them clocked another ten miles on their journey.</p><br/><p>Under the faint moonlight, Laiyue spotted a grass shack up ahead at the fork in the road.</p><br/><p>His joy showed on his face. “Third Young Master, there’s a grass shack ahead. Why don’t we rest here for tonight?”</p><br/><p>There were still forty to fifty miles to go before the next city. If they traveled throughout the night, they would probably only reach it by the next day, so why not camp for a night by the roadside? Anyway, the horses needed some rest too.</p><br/><p>He Sanlang nodded and got off his horse. Laiyue took the reins from He Changdi’s hands and tied the horses to a tree nearby, letting out just enough of the rope so that the horses could graze on the sweet grass surrounding them.</p><br/><p>This crude little shack had once been a simple tea house; it was now in ruins. The single set of table and chairs was already a little rotten, and there was a layer of dust covering everything. It was clear that it hadn’t been in business for a long time.</p><br/><p>The grass shack was open on all four sides and the foundation didn’t seem too stable. It looked like it was on the verge of collapse, while the grass roofing was almost all gone. It could only serve as the most basic shelter from the elements.</p><br/><p>Although the conditions were a little harsh, as travellers, they weren’t too picky. Having some form of a roof over their heads and even some old furniture was much better than having to camp out by the side of the road.</p><br/><p>Laiyue took out a thin blanket from his travel pack and placed it on the chair. He then took out some steamed buns and rolls, as well as a waterskin.</p><br/><p>“Young Master, have some water!”</p><br/><p>He Changdi had been sitting at the table, eyes closed as he rested for a bit. He took the waterskin that was passed over and drank a few mouthfuls.</p><br/><p>Then, he picked up a steamed roll and stuffed it into his mouth.</p><br/><p>He had some jerky in his pack, so he held a steamed roll in one hand and jerky in the other as he mechanically shoved each into his mouth.</p><br/><p>In his past life, after he had been betrayed by ‘Chu Lian’, he had suffered a lot while wandering in the wilderness. He had even eaten grass, bark, and tree roots before. Having steamed rolls and jerky to eat wasn’t too bad in comparison. There was nothing to complain about, and he wasn’t someone unreasonable.</p><br/><p>Although he used to think that meals were just a means to fill his stomach, for some reason, eating jerky and dry steamed rolls out in this desolate place made him feel upset. As he chewed on his rations like a robot, he shut his eyes and the memory of that delicious snow fungus and lotus seed porridge came to mind… Wontons with steam rising off them… and those scallion pancakes attacking his senses with the aroma of spring onions…</p><br/><p>He Changdi swallowed hard and forced the dry steamed roll down his throat. He opened his eyes in irritation, forcing himself to stop thinking of the delicacies made by that wicked woman.</p><br/><p>He bit off a piece of jerky, but the thought of what that wicked woman Chu Lian was making for her dinner tonight came unbidden to his mind. The more he ate, the more upset he got.</p><br/><p>After enduring a few more bites of food to stave off the hunger gnawing at his belly, He Sanlang threw the rest of the steamed rolls and jerky back into his pack in a restless fit. He drank more water before moving the blanket to the ground and forcing himself to sleep.</p><br/><p>The two of them were so tired after a whole day of travel that they didn’t want to move anymore. Laiyue leaned against the corner of the table with a steamed roll in his hand. He sighed as he ate, looking up at the moon hidden behind the floating clouds. Gulping down a mouthful of steamed roll, he sighed and said, “I really miss that braised pork that Third Young Madam made. It was so tasty… What a pity I’ll never be able to eat it again.”</p><br/><p>He had just finished speaking when he felt chills run down his back. Turning his head, he met with He Changdi’s cold, fiery glare. When he thought of the way that Third Young Master had been eating his meal unhappily, he quickly shut his mouth.</p><br/><p>When He Changdi saw that the noise beside him had ceased, he shut his eyes with a stiff expression.</p><br/><p>Hmph. Just because he was gone didn’t mean he would let that wicked woman off the hook. He had sent some of his people to her side, people who he knew would watch her at all times.</p><br/><p>Let’s see if she still dared to fool around with Xiao Wujing now!</p><br/><p>If they dared to have even the slightest bit of dalliance, he would definitely divorce her right away, without any mercy. He would completely destroy her good name and ensure she would never be able to hold her head up high in the capital ever again!</p><br/><p>When he imagined what Chu Lian’s expression would look like when she received his letter from Senior Servant Zhong, the silly He Sanlang felt vindicated. That thought dispersed his previous dissatisfaction from the terrible meal, and his dark expression lightened.</p><br/><p>Tucking his hands under his head, he slowly slipped into slumber.</p><br/><p>However, in the middle of the night, a sudden bout of heavy rain and wild winds flipped their little grass shelter over. Accompanied by the roaring of thunder, raindrops as large as beans fell, instantly soaking the two men sleeping on the ground.</p><br/><p>He Changdi cut a sorry figure as he rolled up his blanket, grabbed his travel pack, and ducked under the table with Laiyue…</p><br/><p>The whole situation completely embodied the idiom, ‘When it rains, it pours’. The next day, the two of them had to take to the road in wet clothes after eating a meal of rain-soaked steamed rolls and jerky. He Sanlang’s face mirrored the dark clouds of the storm last night.</p><br/><p>Laiyue followed behind him with an awkward smile. “Young Master, please bear with this for now. When we reach the next city, we’ll be able to have a hot meal. Although it won’t be as delicious as Third Young Madam’s cooking, it’ll be much better than the wet steamed rolls and jerky we just had.”</p><br/><p>Laiyue’s ‘comforting’ words were like adding oil to the fire. He Sanlang almost exploded in a fit of temper.</p><br/><p>“Shut up! If you mention Chu Lian one more time, I’ll make sure you won’t get a single hot meal.”</p><br/><p>With his ultimatum made loud and clear, He Changdi fiercely whipped his horse, his originally handsome face now twisted into a terrible expression. He took off on the highway before Laiyue could follow.</p><br/><p>Laiyue didn’t know which part of his words had offended Third Young Master. He scratched his head in confusion, and could only try to keep up with his master.</p><br/><p>“Ah, Young Master! Please don’t move so quickly! Wait for this servant!”</p><br/>\n</div>"}