{"title": "Chapter 84: Gambling (3)", "id": 84, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-84-gambling-3", "volume_title": "Volume 1", "body": "<h1>Chapter 84: Gambling (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The crowd sucked in their breaths. If the Third Young Madam from House Jing’an really went to the banquet hall and asked for forgiveness from Old Marquis Dingyuan in front of all the distinguished male guests, House Jing’an would never be able to hold their heads high in the capital again.</p><br/><p>Without waiting for the crowd to pity her, Chu Lian said with a clear voice, “However, I’m willing to compensate Madam Huang with more longevity peach buns.”</p><br/><p>Chu Lian’s sparkling eyes, straight back, and complete lack of any cowardice drew everyone’s gazes.</p><br/><p>“Oh? How are you going to make up for them? These longevity peach buns were made by De’an Restaurant’s Mr Wang. Can you make the exact same ones?” The one speaking was Feudal Princess Anmin. She raised her chin slightly, showing off her clear disdain for a lowly person like Chu Lian.</p><br/><p>Chu Lian smiled; coming from someone already pretty and innocent — and on her way to becoming a great beauty — her smile was like a refreshing spring breeze.</p><br/><p>“I don’t dare to claim that I can make the exact same ones, but I can definitely make something even better.”</p><br/><p>“Nonsense! De’an Restaurant’s Mr Wang makes the best longevity peach buns in the entire capital. How could you possibly make something better?!” Zou Yuanqin hadn’t expected Chu Lian to say something like that. She refuted her on the spot.</p><br/><p>“Fifth Miss Zou, how could you know that without seeing it for yourself? I’m in the wrong for knocking over Madam Huang’s longevity peach buns today, but since Madam Huang is a magnanimous person, please grant me a chance to make up for it.” Chu Lian’s first sentence was meant for Zou Yuanqin, but her next sentence was aimed towards Madam Huang.</p><br/><p>Chu Lian had already gotten some goodwill from the crowd thanks to her performance. Now that she was making such a sincere request to Madam Huang, it showed that she knew when to push and when to retreat. This action earned even more positive assessments from the crowd. Anyway, everything had happened so quickly; who knew if it was even Chu Lian who bumped into that maidservant just now?</p><br/><p>At this point, many of the madams were leaning towards Chu Lian’s side.</p><br/><p>Zou Yuanqin’s neck was starting to turn red from all her anger. She refused to let Chu Lian off and said, “So what if you can make longevity peach buns? Don’t tell me that they’ll be able to match up to Mr Wang’s? Mr Wang only makes one order of longevity peach buns per person!”</p><br/><p>Chu Lian’s expression turned solemn. “Fifth Miss Zou. If we’re talking about food, we should judge by sincerity and taste. As long as the longevity peach buns I make are more delicious than Mr Wang’s, don’t you think that’s better than any of those false tricks?”</p><br/><p>That’s right, that was just a silly trick!</p><br/><p>Suddenly, the crowd was awakened by Chu Lian’s words.</p><br/><p>No matter how expensive they were, it was just a plate of longevity peach buns and De’an Restaurant was out to make money. If the Emperor wanted to eat two plates of longevity peach buns, that Mr Wang couldn’t possibly defy an imperial edict for the sake of this principle.</p><br/><p>Furthermore, how could a noble young madam from House Jing’an be compared to a lowly cook from De’an Restaurant?</p><br/><p>Chu Lian’s words were like a slap to the face.</p><br/><p>Fifth Miss Zou was so angry that her face and neck were flushed red, but she couldn’t say a word in retort.</p><br/><p>Madam Huang glared at her daughter. With the situation as it was now, she could only agree to Chu Lian’s request.</p><br/><p>If she didn’t give her this chance, then it would be Madam Huang and her daughter who were the discourteous ones.</p><br/><p>“Alright, House Jing’an’s Third Young Madam. I’ll give you this chance today. However, if you don’t manage to make longevity peach buns that taste better than Mr Wang’s, even if Matriarch He is here, I won’t show you any mercy.”</p><br/><p>Madam Huang was the madam in charge of the Dingyuan estate now, and she was used to dealing with the high echelons of society. Thus, she had a powerful aura about her. Any normal young lady would probably be shocked stiff by her threatening words.</p><br/><p>However, Chu Lian was the one facing her!</p><br/><p>The business dealings in the modern world were much more sly and craftier than this, and she had met all sorts of bosses before. How could she be afraid of someone like Madam Huang?</p><br/><p>“Of course, Madam.” Chu Lian respectfully bobbed towards Madam Huang.</p><br/><p>Her actions were completely in line with etiquette, and there was nothing to pick on.</p><br/><p>Although Madam Huang was inwardly raging, on the outside, she maintained her elegant demeanour.</p><br/><p>Her sharp eyes watched Chu Lian as she secretly harrumphed.</p><br/><p>Inside the privacy of her mind, she thought, don’t think longevity peach buns are that easy to make! There must be something behind Mr Wang’s peach buns since his business has been doing so well! At least, up until now, all the nobles who ate Mr Wang’s longevity peach buns have had nothing but praise for them.</p><br/><p>Child, be careful. It won’t be easy to clean up your mess if you’ve boasted beyond your abilities!</p><br/><p>You might think it’s easy just by watching others, but when you’re really put on the spot, you’ll find that it isn’t as easy as you thought!</p><br/><p>House Jing’an had managed to become popular amongst the nobles in the capital just by having a pastry chef who could make tasty snacks. That was how valuable secret recipes were. If House Ying had some secret recipe for longevity peach buns that was better than Mr Wang’s, they would have used it to gain popularity a lot earlier!</p><br/><p>After thinking it through, Madam Huang was even more certain that Chu Lian was being too overconfident. She didn’t believe that Chu Lian could make anything close to Mr Wang’s longevity peach buns, never mind something better than them.</p><br/><p>When Madam Rong, who was still standing in the crowd, heard that Chu Lian was going to suddenly make longevity peach buns of her own, she almost fainted out of shock. She had eaten Mr Wang’s longevity peach buns only once before. They were much tastier than House Jing’an’s pastries. Then there was Chu Lian, who hadn’t even entered the Ying Estate’s kitchen before her marriage. How could she possibly know how to make longevity peach buns?!</p><br/>\n</div>"}