{"title": "Chapter 88: Fresh Peaches (2)", "id": 88, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-88-fresh-peaches-2", "volume_title": "Volume 1", "body": "<h1>Chapter 88: Fresh Peaches (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xiao Bojian was still standing in the same spot. Within just three steps, Heir Zheng made it to his side and tried to strike up a conversation. “Senior Xiao, guess what’s happening across the pond? Haha, it’s really lively! I didn’t think something so interesting would happen at Old Marquis Dingyuan’s longevity feast. I haven’t made this trip in vain!”</p><br/><p>If it weren’t for the fact that the crowd over there was entirely female and that Heir Zheng wasn’t engaged yet, he would probably have gone over to take a look himself, thanks to his busybody nature.</p><br/><p>Xiao Bojian glanced calmly at Heir Zheng. His features were already finer than a woman’s, but now that he was pressing his already thin lips together, the combination of his expression and beauty made him look as if he was holding back his desire. Even as a straight man himself, Heir Zheng was almost dazzled by that scene.</p><br/><p>“Heir Zheng, please get straight to the point. I dislike beating around the bush.”</p><br/><p>Heir Zheng wasn’t put off by Xiao Bojian’s cold attitude. He was used to his senior’s icy chill and seeming disinterest in everything, so he thought there was no point in teasing him anyway. He explained everything that had happened to Xiao Bojian immediately.</p><br/><p>When he began to speak of the more exciting parts, Heir Zheng would even tsk in admiration.</p><br/><p>“That’s right, speaking of this Third Young Madam from House Jing’an, wasn’t she the one who made those raindrop mochis that Grandmother brought back for us a few days ago? Since she could make desserts like those, these longevity peach buns must be nothing to her. Haha! Madam Huang’s going to lose terribly today. I really can’t wait to see the annoyed expression on her face!”</p><br/><p>A huge wave of emotion rose within Xiao Bojian’s chest, even as he appeared calm while listening to Heir Zheng’s words.</p><br/><p>His thin lips pressed together again, almost forming a straight line. His slender fingers grasping the railing of the veranda also tightened.</p><br/><p>Even more thoughts were swirling inside his head.</p><br/><p>How on earth had Lian’er provoked Imperial Princess Leyao? It was clear that the whole incident was a trap. Zou Yuanqin, Imperial Princess Leyao, and Madam Huang were all on the same side.</p><br/><p>What was that Lady Yang plotting to push Lian’er into the thick of things like that?</p><br/><p>And that He Changdi!</p><br/><p>Since he had already married her, why had he treated her that way? That kind of man didn’t deserve to have Lian’er!</p><br/><p>A storm was brewing in Xiao Bojian’s almond-shaped eyes as his heart clenched tightly. He hated himself a little for not having any power. He couldn’t even help Chu Lian when she was in need of help, and he could only let her face those troubles on her own.</p><br/><p>Since He Sanlang wasn’t worthy of her, then don’t blame him for stealing her back!</p><br/><p>All these people who were making trouble for Lian’er today… he would pay them back in the future!</p><br/><p>……</p><br/><p>Meanwhile, Chu Lian was busy teaching her two maidservants how to knead the dough in the kitchen. If she were able to hear Xiao Bojian’s current thoughts, she would surely roll her eyes at him.</p><br/><p>She would even offer him a reply: “Shoo, go stand somewhere else. Don’t interfere with my moneymaking.”</p><br/><p>Does your mum know how warped your thinking is?</p><br/><p>Unfortunately, Chu Lian didn’t know of what was going on in Xiao Bojian’s mind. She was busy as a bee in the kitchen.</p><br/><p>The four senior servants who had followed her here were Madam Huang and Lady Yang’s people. None of them could help in making the buns.</p><br/><p>Since De’an Restaurant’s Mr Wang had made the longevity peach buns in this exact kitchen a while ago, she didn’t lack any of the necessary ingredients.</p><br/><p>With Xiyan and Wenqing helping her, Chu Lian could speed up her cooking.</p><br/><p>At first, the four senior servants had kept a close eye on the proceedings from the side. Madam Huang’s senior servants had even seemed to have grown eyes on the top of their head from all their staring. However, as time passed, the senior servants’ eyes all widened; Madam Huang’s servants were so anxious that cold sweat started appearing on their bodies.</p><br/><p>However, they couldn’t leave at all due to Lady Yang’s servants watching them.</p><br/>\n</div>"}