{"title": "Chapter 90: Jackpot (1)", "id": 90, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-90-jackpot-1", "volume_title": "Volume 1", "body": "<h1>Chapter 90: Jackpot (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian motioned Xiyan and Wenqing to pass the two plates of longevity peach buns around for the madams and young ladies present to taste.</p><br/><p>The buns weren’t very big; each one was about the size of an infant’s fist. They were cute and finely made, too — just about enough for two or three bites, so people wouldn’t get sick of the taste.</p><br/><p>Xiyan first brought some buns over to Imperial Princess Leyao before serving them to Madam Huang and the other madams behind her. As for Wenqing, she served them to Royal Princess Duanjia first, then Lady Yang and so on.</p><br/><p>Once everyone had a peach bun in their hands, they could instantly tell that these were actually buns and not peaches.</p><br/><p>Royal Princess Duanjia pinched the soft peach bun in her hand and examined it seriously, just as if it was a novelty to her. When she sniffed it, she was surprised to find that it not only looked like the real thing, but even carried the clean, fresh aroma of real peaches.</p><br/><p>The ladies holding the adorable longevity peach buns couldn’t bear to take a bite; instead, they wanted to keep them like souvenirs and put them on display to admire how realistic they were everyday!</p><br/><p>Royal Princess Duanjia blinked and parted her red, tender lips. She lightly bit into the bun, enjoying the soft, sweet texture of the skin. After biting into it, there was an unexpected flavour.</p><br/><p>Before Royal Princess Duanjia could think of what flavour it was, a young madam exclaimed in surprised joy, “Ah! There’s a filling in this bun! It’s soft, sticky and sweet, and it’s not too heavy on your tongue either.”</p><br/><p>When Royal Princess Duanjia looked closely at it, she noted that the stuffing was indeed smooth and silky. It had the same colour as red beans, so perhaps the stuffing was made of that?</p><br/><p>The women who had tasted Chu Lian’s peach buns were all quiet. Even those who had been picking on Chu Lian had forgotten to speak. Why? Her peach buns were simply too delicious!</p><br/><p>Imperial Princess Leyao and Madam Huang each took one bite. Their expressions simultaneously turned serious.</p><br/><p>Despite the frustration in their hearts, both of them still finished every bit of the little longevity peach bun in their hands.</p><br/><p>They couldn’t help it. No matter how angry they were, their taste buds were begging for more!</p><br/><p>It only took one bite to make Lady Yang’s eyes light up. She also had a sweet tooth. Upon seeing two buns left on the plate before her, she didn’t wait for anyone else to react and swiped both of them for herself. Then, she swiftly finished them off with a few elegant movements.</p><br/><p>None of the ladies standing around Madam Rong were ranked highly enough to be part of the crowd that was tasting the buns. Madam Rong anxiously stared at the madams in the center. When she saw that Lady Yang had eaten three in one go, she finally relaxed. However, a pool of mixed feelings quickly replaced her previous anxiety.</p><br/><p>She regretted it a little now. If… If she had been decisive enough to stand by Chu Lian, she would be able to boast right now.</p><br/><p>Miss Su inwardly sighed in relief and smiled at Chu Lian. She had thought that this Sixth Sister of hers was too ambitious and arrogant in the past, and was too reckless in trying to make a name for herself. However, after this wild turn of events today, her opinion of Chu Lian changed a lot.</p><br/><p>She hadn’t thought that Sixth Sister had such hidden talent.</p><br/><p>Miss Yuan had a death grip on the handkerchief in her hands. Her eyes were still locked on the accessories on the silver tray. Upon thinking that those were all Chu Lian’s now, her heart was filled with jealousy!</p><br/><p>She was the daughter of a second wife, so when it came to status, she was actually ranked a little lower than Chu Lian. Thus, ever since she was little, she had always tried to compete with Chu Lian in anything and everything, and in every competition, she was the one who won. But now, Chu Lian was on the brink of winning an entire tray of treasures that none of her accessories could ever hope to compare to. How could she possibly bear to see that happen?</p><br/><p>Wei Fengzi finished eating the longevity peach bun in her hands. There was a spark of interest in the glance she tossed at Chu Lian. Her eyebrows raised as she said, “House Jing’an’s Third Young Madam has indeed made longevity peach buns that are more delicious than the ones made by De’an Restaurant’s Mr Wang.”</p><br/><p>Although the madams present already knew what the results would be, no one expected Wei Fengzi to be the one to announce it.</p><br/><p>When Imperial Princess Leyao heard Wei Fengzi’s words, she pouted unhappily. “Aunt! How could you side with outsiders?!”</p><br/><p>Wei Fengzi looked at Imperial Princess Leyao affectionately and sat next to the princess. She stroked the princess’ hair. “Princess, I’m just stating the facts. Don’t you think that these longevity peach buns are delicious?”</p><br/><p>Imperial Princess Leyao couldn’t lie in front of the aunt who had always pampered her. Furthermore, Chu Lian had indeed made peach buns that had surpassed Mr Wang’s in both look and taste.</p><br/><p>“They are.” Imperial Princess Leyao was just an eleven year old child after all. She replied truthfully, as unwilling as she was.</p><br/><p>Wei Fengzi smiled and turned to Madam Huang.</p><br/><p>Chu Lian took a second look at Wei Fengzi. Although she had only said two sentences, that was enough to extract Imperial Princess Leyao out from the whole awkward fiasco.</p><br/><p>She was trying to show that Imperial Princess Leyao was just a eleven-year-old girl, despite her unruly behaviour at the start. Now that she had admitted that Chu Lian’s peach buns were delicious, her image had turned into an obedient child who knew how to change for the better. The arrogantly wilful image of her from before would then fade away.</p><br/><p>Now that the situation was like this, the greatest blame now lied with Madam Huang.</p><br/><p>Chu Lian had to admit that Wei Fengzi was crafty.</p><br/><p>Those two sentences had fulfilled her promise to Madam Zou to take care of Chu Lian, and they had protected the princess’ image. It wasn’t easy to please everyone, but Wei Fengzi had succeeded.</p><br/><p>However, Chu Lian didn’t take any of it to heart.</p><br/>\n</div>"}