{"title": "Chapter 99: Restaurant (2)", "id": 99, "volume": 1, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-99-restaurant-2", "volume_title": "Volume 1", "body": "<h1>Chapter 99: Restaurant (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The two of them were getting along well when Senior Servant Liu came in with a smile, reporting that Eldest Young Madam had brought the two young ladies over with her.</p><br/><p>Chu Lian looked at the account book before looking up at Matriarch He again, her eyes shining with expectation.</p><br/><p>Matriarch He smiled. “You silly child. Alright, I’ll inform your sister-in-law myself when she comes in.”</p><br/><p>After getting the matriarch’s reassurance, Chu Lian stopped worrying.</p><br/><p>She couldn’t tell what Madam Zou would think about this, since the novel hadn’t mentioned much of her personality. However, she was Wei Fengzi’s close friend after all, and Wei Fengzi was someone to watch out for.</p><br/><p>In the novel, Madam Zou had gotten seriously injured from ‘Chu Lian’s’ ploy early on. She couldn’t even get out of bed. However, now Madam Zou was perfectly healthy and managing the entire estate. They were wives of different branches of the family and their interests weren’t in conflict.</p><br/><p>But no matter what kind of personality Madam Zou had, Chu Lian didn’t want Matriarch He’s gift to give rise to any resentment between them and affect the peace they had now.</p><br/><p>Her husband wasn’t by her side to shelter her, and she didn’t want to create an enemy for herself within the estate. That would just make her days harder for herself!</p><br/><p>As expected, when Madam Zou entered Qingxi Hall and heard that Chu Lian had already been there for some time, her eyebrows knitted together.</p><br/><p>She brought her daughters into the parlour with a smooth expression. When Madam Zou performed her greetings, Chu Lian stood up and returned it.</p><br/><p>Following that, Matriarch He started to explain how Chu Lian would be taking over the management of Guilin Restaurant. The slight tension in Madam Zou’s heart went away upon hearing the matriarch explaining everything to her so clearly. </p><br/><p>She knew a little about the private properties that the matriarch held.</p><br/><p>The most profitable one was a sencha shop. Its monthly earnings were roughly two to three hundred taels. The worst property was Guilin Restaurant. It had been a losing business for years. Madam Zou still couldn’t understand why Matriarch He kept it with her even though it wasn’t earning money at all. She could have sold it off to buy another store in a more bustling location.</p><br/><p>It was just a restaurant in the red, and Matriarch He had explained it to her straightaway, so Madam Zou didn’t mind that only Chu Lian was given a property. Her impression of Chu Lian also improved by a lot.</p><br/><p>“Dalang’s wife, you’ve managed the estate for so many years and you’ve done well in managing the businesses in your hands. When you’re free, do give a few pointers to Sanlang’s wife.”</p><br/><p>Madam Zou gave a genuine smile this time. “If Third Sister-in-Law doesn’t mind, then come to my courtyard at any time.”</p><br/><p>“Then I’ll have to thank Eldest Sister-in-Law in advance!”</p><br/><p>Matriarch He’s heart was soothed as she watched her granddaughters-in-law interacting peacefully. Her gaze fell upon her great-granddaughters and she opened her arms wide. “Little An, Little Lin, come over to Great-Grandmother’s side and let Great-Grandmother have a look at you two.”</p><br/><p>Matriarch He tenderly stroked their heads. However, seeing them, she did have some regrets. Little An was already six, but there were no great-grandsons for her to pamper yet. As she thought so, her eyes turned to Chu Lian’s flat belly.</p><br/><p>Ever since her arrival to the Great Wu Dynasty, Chu Lian had become rather sensitive towards other people’s gazes and the meanings hidden inside them.</p><br/><p>When she noticed the matriarch eyeing her belly, she stiffened and her mood worsened.</p><br/><p>She had forgotten that she had submitted that blood-stained white handkerchief to Matriarch He’s servants. In Matriarch He’s eyes, she and He Sanlang had already consummated their marriage on their wedding night.</p><br/><p>Furthermore, the Chu Family’s misses had the reputation of being particularly fertile. Perhaps Matriarch He thought that she had ‘hit the bullseye with one shot’.</p><br/><p>Chu Lian’s mouth twitched in her embarrassment. She was still a virgin, so it was impossible for her to be pregnant.</p><br/><p>It would be scarier if she actually got pregnant in this condition!</p><br/>\n</div>"}