{"title": "Chapter 107: The Power of Snacks (3)", "id": 107, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-107-the-power-of-snacks-3", "volume_title": "Volume 2", "body": "<h1>Chapter 107: The Power of Snacks (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian remembered seeing Royal Princess Duanjia’s mysterious goodwill towards her in the Dingyuan Estate. She frowned; the novel had only mentioned Royal Princess Duanjia a few times, and she hadn’t even properly made an entrance in the scenes that Chu Lian had read. She didn’t know much about Royal Princess Duanjia’s personality or Prince Wei’s estate.</p><br/><p>However, since it was a royal princess who had sent her a proper invite, it wouldn’t be good if she rejected it.</p><br/><p>There were many noble ladies in the capital who would love to get connected to Royal Princess Duanjia, but weren’t able to. Besides, Chu Lian didn’t hold any ill will towards her.</p><br/><p>After accepting Royal Princess Duanjia’s invite, Senior Servant Gui and Senior Servant Zhong were happy as well.</p><br/><p>Royal Princess Duanjia was famed for being detached from the social circles of the nobility. At most, she would occasionally mix with some of the ladies from the imperial family, but she didn’t have any known close friends amongst the nobility. Prince Wei was someone that even the most favoured courtiers would have to pay respects to, so if Chu Lian could form a connection with Royal Princess Duanjia, even House Jing’an’s prestige would rise a level.</p><br/><p>Dinner was at Qingxi Hall tonight. When Chu Lian arrived at the entrance, she could hear laughter coming from within.</p><br/><p>Chu Lian walked in curiously, and Matriarch He waved her over. “Sanlang’s wife, come over, we were just talking about you!”</p><br/><p>With the exception of Madam Zou’s two daughters, Chu Lian was the youngest amongst them. She obediently greeted all her seniors before she was pulled by Matriarch He to sit on a soft chair just one step below hers.</p><br/><p>“Grandmother, what were you talking about me?” Her inquisitive wide eyes made the matriarch smile again.</p><br/><p>“Your eldest brother was just talking about those longevity peach buns you made at the Dingyuan Estate! Grandmother tried them today as well; they’re really tasty!”</p><br/><p>Chu Lian smiled back and replied, “It’s good that Grandmother likes them! I’ll make more interesting ones for Grandmother’s birthday!”</p><br/><p>“Look at this, so those longevity peach buns weren’t even the best ones. There are more interesting ones to be had!”</p><br/><p>Everyone in the parlour laughed together. Chu Lian’s sharp gaze swept over each member and picked out some unhappiness in Madam Zou’s eyes, so she quickly changed the topic. “Second Brother has come back early today. I heard that we’re having venison for the banquet! Granddaughter-in-Law can’t wait!”</p><br/><p>After Chu Lian changed the topic, she glanced at Madam Zou again and noticed the lightening of her expression.</p><br/><p>However, He Changqi just had to add fuel to the fire at this moment. “Third Sister-in-Law, since you know how to make those fine pastries, do you know how to cook a better dish of venison?”</p><br/><p>Chu Lian cried out in her heart. Madam Zou was already starting to dislike her, but her eldest brother just had to add that line.</p><br/><p>“Venison’s quite rare, so Sister-in-Law doesn’t have any secret recipes for venison.”</p><br/><p>When Chu Lian finished speaking, He Changqi’s face practically radiated disappointment.</p><br/><p>Following that, the family ate their dinner together. Chu Lian didn’t want her eldest sister-in-law to feel like she was taking the spotlight, so she didn’t speak much during the meal, except to reply the matriarch.</p><br/><p>When she returned to Songtao Court afterwards, Chu Lian patted her chest in relief without minding her image one bit.</p><br/><p>She had been scared to bits! She hadn’t thought that just making some desserts would be enough to draw her eldest sister-in-law’s jealousy. It looked like her journey to become a peaceful layabout in the inner court wouldn’t be that easy.</p><br/><p>Chu Lian hadn’t even mentioned Lady Yang’s gift of a coral bracelet and Royal Princess Duanjia’s invite to her estate in front of the family. She wondered if Madam Zou might misunderstand if she had spoken of it just now.</p><br/><p>After she had thought it through, Chu Lian decided to tell the matriarch alone when she made her morning greetings at Qingxi Hall the next day.</p><br/><p>Royal Princess Duanjia had invited her to meet at her estate on the twenty-sixth of the month; there were still two days left to prepare, so it wasn’t too urgent.</p><br/>\n</div>"}