{"title": "Chapter 102: Fighting for Peaches (1)", "id": 102, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-102-fighting-for-peaches-1", "volume_title": "Volume 2", "body": "<h1>Chapter 102: Fighting for Peaches (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Countess Jing’an smiled and patted Miaozhen’s slender hand. “You’re the only one around here who I can count on to plan so perfectly. Miaozhen, you’re already seventeen this year. Do you have any plans for the future? You can’t possibly stay by my side forever.”</p><br/><p>When she heard Countess Jing’an’s words, Miaozhen froze. She bit her lip and said, “Madam, Miaozhen wants to serve you forever.”</p><br/><p>“What nonsense! As a lady, you’ll have to marry someday. How could you labour by my side for your whole life? If you really do that, wouldn’t your mother be hurt?”</p><br/><p>Miaozhen was the daughter of Countess Jing’an’s nursemaid. When she was ten, her mother sent her to serve serve at Countess Jing’an’s side. Unfortunately, Countess Jing’an’s nursemaid had passed away from sickness sometime in the past few years. Before she died, she had begged Countess Jing’an to look after Miaozhen for her.</p><br/><p>Since Miaozhen had always been smart and considerate, Countess Jing’an was happy to look after her.</p><br/><p>Miaozhen’s eyes immediately turned watery. She looked up and cast a shy glance at the countess before mumbling quietly, “Madam, Miaozhen really doesn’t have any requests at all. Miaozhen would just like to marry someone in this estate so Miaozhen can continue to serve Madam even after marriage.”</p><br/><p>Countess Jing’an stared at the girl she had watched grow up. As she thought, the images of suitable candidates popped up in her mind one after another, but in the end, she still crossed them all out.</p><br/><p>The main steward of the outer court had a second son that might be suitable, and that child was also pretty clever. Unfortunately, that second son already took a wife last year. Otherwise, it would have been good for Miaozhen to become the wife of one of the estate’s stewards.</p><br/><p>As she was distracted by her thoughts, a senior servant announced from outside that the heir of the family had arrived.</p><br/><p>Just as the voice of the announcer faded away, Heir Jing’an entered the room.</p><br/><p>“Mother, how has your health been lately?”</p><br/><p>The heir of House Jing’an, He Changqi, had the body of a martial artist. He also looked the most similar to Count Jing’an. Although he wasn’t even thirty years old yet, his buff body, tan skin, and full beard made him look much older.</p><br/><p>He was as tall as He Changdi, but if they stood together, no one would be able to tell that they were brothers.</p><br/><p>Countess Jing’an hadn’t expected Dalang to charge right in just like that. She rolled her eyes helplessly at him. “How old are you by now? How is it that you haven’t learned any manners?”</p><br/><p>He Changqi wasn’t bothered by his mother’s complaint at all. He wasn’t someone who was bothered by trifling details. At a young age, he had usually kept to his father’s side as he learned martial arts, so he had never been very conscious of the rules that bound the womenfolk of the inner court. Besides, this was just his mother’s room.</p><br/><p>He Changqi looked down and noticed a few leftover desserts on the table next to the bed. With a refreshing smile, he said, “Mother, are the confections that Third Sister-in-Law made to your liking?”</p><br/><p>Countess Jing’an waved He Changqi over to sit by her bed side.</p><br/><p>Since the eldest young master had arrived, Miaozhen didn’t dare to dispense with etiquette. She kept her head lowered, and was already standing respectfully next to Countess Jing’an. When He Changqi had entered, she had immediately bobbed in greeting. Countess Jing’an’s gaze inadvertently passed over Miaozhen, and she noticed that the little maidservant’s face was flushed red. The countess was taken aback; she looked her eldest son up and down and found that the brat was standing with his back straight and hands behind his back, a broad smile on his face.</p><br/><p>“They suit my tastes very well! Mother has never eaten such exquisite, interesting desserts before!”</p><br/><p>After the Eight Confections had been finished, Chu Lian had sent a set to each branch of the family. Since there were two children in Dalang’s branch, she naturally sent a few more to his courtyard. He Changqi had tried two of them and found them delicious.</p><br/><p>“I didn’t expect that Third Sister-in-Law would have secret recipes with her. Mother, I’m sure you haven’t heard this yet. At Old Marquis Dingyuan’s longevity feast, everyone was fighting over a small plate of longevity peach buns!”</p><br/><p>Ah?</p><br/><p>Countess Jing’an was dumbfounded; what had happened?</p><br/><p>A bunch of noblemen had been fighting over longevity peach buns?</p><br/><p>Were those longevity peach buns… possibly made by Chu Lian?</p><br/>\n</div>"}