{"title": "Chapter 105: The Power of Snacks (1)", "id": 105, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-105-the-power-of-snacks-1", "volume_title": "Volume 2", "body": "<h1>Chapter 105: The Power of Snacks (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lord Yang grew even grumpier when he thought of how even the shameless censor who had submitted a petition against him had gotten to eat a longevity peach bun, while on the other hand, he could only imagine what it might’ve tasted like.</p><br/><p>Nothing had gone his way today; was it because he had skipped out on eating one of those lucky buns?</p><br/><p>Lord Yang coughed lightly and said, “Send them to the parlour. I’ll bring them to the missus later when I visit her in the inner court.”</p><br/><p>Lord Yang didn’t like sencha either, so he had his manservant pour him a cup of warm water instead as he took a seat in the parlour to rest. When his line of sight fell upon the brocade box innocently positioned next to him, Lord Yang reached out and opened it.</p><br/><p>The vision inside made his half-shut eyes fly wide open.</p><br/><p>Eight pastries were arranged inside the small, exquisite green bamboo basket. They each had different shapes, and the blooming red peony nestled to the side made them extremely eye-catching.</p><br/><p>When Lord Yang breathed in, he could smell a faint fragrance of flowers mixed in with the buttery aroma of the pastries.</p><br/><p>Lord Yang couldn’t resist. He gulped and picked up a bat-shaped pastry, looking it over curiously before he bit off a mouthful. Mm, there was even stuffing inside. Were those raisins? Refreshing, crisp, and sweet without being too greasy… Delicious!</p><br/><p>Lord Yang took out a second piece shaped like a peach. Oh? This one tasted like chestnuts. A novel, sweet taste, with the aroma of chestnuts lingering in the mouth long after the pastry was eaten.</p><br/><p>The third piece was shaped like a hand and had the aroma of roses. Despite eating so many already, he wasn’t sick of them yet. This one had an elegant, light flavour, which was very much suited to his tastes.</p><br/><p>……</p><br/><p>By the time Lord Yang came back to his senses, he found that there were only two pieces left in the entire box of confections. The hand he had extended towards the leftovers awkwardly retreated.</p><br/><p>The manservant next to him had been watching the whole time with his eyes twitching. Inwardly, he was thinking, ‘My lord, those were meant to be a return gift for the mistress! How could you eat so many of them, just like that?’</p><br/><p>“Bring these along, we’re going to the inner court to visit your mistress.” Lord Yang coughed to hide his embarrassment as he relayed his order to the manservant.</p><br/><p>On the way to the inner court, Lord Yang kept a constant inner monologue of complaints running.</p><br/><p>That House Jing’an was being way too petty. How could they send such a small box — only eight pastries! — as a return gift? There was only one of each flavour, too! So when he finished one pastry in two bites, that meant he couldn’t have another of the same flavour.</p><br/><p>They arrived at the inner court’s main courtyard to the sight of Lady Yang speaking to her daughter-in-law.</p><br/><p>Lady Yang turned her head and immediately spotted her husband. She stood up and welcomed him with a smile. “Dear, why are you back so early today?” she asked. When she noticed the brocade box that the manservant was carrying, the smile on her face grew even more pronounced. “Why, you even brought me a present today?”</p><br/><p>Lord Yang’s face stiffened a little in his embarrassment. “This is a return gift from House Jing’an.”</p><br/><p>The manservant set the brocade box on the table before retreating.</p><br/><p>Lady Yang raised an eyebrow in inquiry. Upon remembering the girl she had met at Marquis Dingyuan’s longevity feast, she walked to the table without bothering to give a second thought about Lord Yang’s expression.</p><br/><p>“House Jing’an’s return gift? What could it be? I’ll have to show it to my daughter-in-law too.” Lady Yang’s eldest daughter-in-law hadn’t been able to make it to Marquis Dingyuan’s longevity feast that day, so upon hearing her mother-in-law’s words, she stepped forward.</p><br/><p>Lord Yang couldn’t possibly stop her, so he pretended as if nothing was wrong and sat to one side.</p><br/><p>The moment Lady Yang opened the box, she was greeted with the two lonely pieces left in the strangely empty box.</p><br/><p>She turned to Lord Yang in surprise, “This…”</p><br/><p>“I was a little hungry just now, so I ate two pieces.” Lord Yang stiffly explained.</p><br/><p>There was such a huge empty space in the box; are you sure you only ate two pieces?</p><br/><p>The corner of Lady Yang’s mouth twitched. She closed the lid of the box.</p><br/>\n</div>"}