{"title": "Chapter 139: Reply (1)", "id": 139, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-139-reply-1", "volume_title": "Volume 2", "body": "<h1>Chapter 139: Reply (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>There were a few boldly written words on the front of the letter: ‘To my dear wife, Madam Chu’.</p><br/><p>A corner of Chu Lian’s lips lifted in amusement. She wondered if he felt any guilt at all while writing that down. Calling her his ‘dear wife’ — yeah, right. He hadn’t even been willing to consummate their marriage! Did he have a conscience somewhere in that head of his or not?</p><br/><p>Chu Lian tore open the letter and pulled out a few pieces of paper. Now that she could see the contents, he really had written a whole stack of letters to her. Each page was packed with tiny little words. She had to get as close as possible to decipher them. But the moment she tried, her face instantly turned dark.</p><br/><p>What the heck was this! The handwriting on these letters were so bad that they looked like exorcism amulets! She couldn’t understand a single one!</p><br/><p>No, wait. She was able to understand two words. The big, bold words at the start of the letter: Chu Lian.</p><br/><p>After that warm ‘my dear wife’ on the front of the envelope, He Sanlang still ended up addressing her by her full name ‘Chu Lian’ in the letter itself.</p><br/><p>Even though she couldn’t really make out what the letter was about, just based on those two words alone, Chu Lian could understand that He Sanlang hadn’t written anything good about her in that letter.</p><br/><p>She pursed her lips. Luckily, He Changdi’s handwriting was so terrible that she couldn’t read the letter. Otherwise, she would have probably gotten angry and expired from the force of her rage.</p><br/><p>She carefully folded up the letter and placed it back into the envelope, then tucked it away in a fragrant rosewood box. Then, Chu Lian prepared some ink and picked up her brush to start writing a reply.</p><br/><p>He Changdi had written out three whole pages while full of anger, all to warn the wicked woman Chu Lian against trying any of her tricks while he was gone. If he were to find out that she hadn’t even read a single word of it, perhaps he might even spew out a mouthful of blood. If he were to also find out that it was all because of his flowery handwriting, perhaps he might also regret trying his best to show off his calligraphy skills.</p><br/><p>After thinking for a long time, Chu Lian still didn’t know what to write as a reply to He Changdi. She wrote a few words, before staring at the remaining blank space on the paper. Her eyebrows furrowed together and she quickly scrunched the paper up into a ball and threw it into the fire.</p><br/><p>No way, it was impossible! Although her handwriting had improved, it was still miles apart from someone who should be used to writing with a brush. It wouldn’t be good to expose her lack of skills to He Changdi by writing a letter. What if he started getting suspicious? That husband of hers was already crazy enough; she couldn’t risk provoking him any more.</p><br/><p>Since she couldn’t write, how was she supposed to reply He Sanlang’s letter?</p><br/><p>Chu Lian scratched her head in frustration. Somehow, her gaze landed on the set of goose feather pens and charcoal that she usually used for practising.</p><br/><p>Her eyes instantly lit up. Oh yes! Although she couldn’t write, she could draw!</p><br/><p>For an art enthusiast like her, those simple little comics with four boxes were easy as pie!</p><br/><p>Now that she had a plan, Chu Lian immediately started putting it into action. She took up her brush and with a few strokes, a lively… interesting drawing started to take shape on the paper.</p><br/><p>The little person wearing a dress with a lopsided hairstyle was herself.</p><br/><p>With a few simple, quick lines and some nice brush strokes, the paper was filled with quite the animated scene.</p><br/><p>In less than an hour, Chu Lian had already drawn twenty comics. She couldn’t even fit the whole stack into the envelope.</p><br/><p>Finally, Chu Lian called Xiyan into the study.</p><br/><p>“Xiyan, help me find a larger envelope!”</p><br/><p>Xiyan was still dazed by the request. She was wondering what Chu Lian needed such a thing for. If she wanted to mail something larger, she could just use a package!</p><br/><p>Chu Lian waved the stack of paper at Xiyan, and the maidservant immediately understood.</p><br/>\n</div>"}