{"title": "Chapter 149: Poached Fish Slices (3)", "id": 149, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-149-poached-fish-slices-3", "volume_title": "Volume 2", "body": "<h1>Chapter 149: Poached Fish Slices (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>For the evening meal, Chu Lian personally cooked up some poached fish slices and a pot of sour and spicy soup. The rest of the dishes were what they normally had here in Songtao Court.</p><br/><p>The snow white poached fish slices were placed on top of a fresh pile of beansprouts, with bright red chillis scattered on top. When the slices were served, it was a feast for the eyes. The fish meat was soft and tender. Although there was a layer of chillis on it, it wasn’t too spicy. Once that thin slice of fish entered her mouth, Chu Lian shut her eyes in pleasure as the corners of her lips lifted up.</p><br/><p>It was just a pity she was eating alone. A dish like this felt more magnificent when it was served up in a huge plate. However, since it was just her, she told Xiyan to put the fish in a small bowl.</p><br/><p>For the remainder of it, Chu Lian ordered Xiyan to split it into two portions and send them to Qingxi Hall and the main branch’s courtyard.</p><br/><p>Senior Servant Gui personally delivered the portion for Qingxi Hall and was received by Senior Servant Liu.</p><br/><p>“This is a new dish that Third Young Madam made today. This old servant was sent under Third Young Madam’s orders to bring some over for the matriarch to have a taste. However, Third Young Madam also has a reminder. These poached fish slices are a little spicy, so if the spiciness is too much for the matriarch, a small taste will do.”</p><br/><p>Senior Servant Liu smiled and acknowledged the message. She received the dish and passed it to the maidservant behind her to send to Matriarch He. Next, Senior Servant Liu personally escorted Senior Servant Gui out of the courtyard.</p><br/><p>Over at Dalang’s courtyard, they also received their share of the poached fish slices. It just so happened that He Changqi was present.</p><br/><p>He Changqi opened the lid of the container, only to see a layer of red chillis on top. He exclaimed in surprise, “Is this made from those chillis I brought back this afternoon?”</p><br/><p>“Replying to Heir Jing’an, it is! Our Third Young Madam personally cooked this dish, and has a message. If these poached fish slices are too spicy, please don’t eat too much of it.”</p><br/><p>“Since it’s made from those chillis, I have to taste this properly.”</p><br/><p>Before Xiyan had even left, He Changqi had already ordered the senior servants in his courtyard to start serving the evening meal.</p><br/><p>He clearly couldn’t wait to taste what a dish made from these chillis would be like.</p><br/><p>The next day, when Chu Lian arrived at Qingxi Hall for her usual morning greetings, she bumped into her eldest brother-in-law, He Changqi.</p><br/><p>The matriarch smiled and let Chu Lian sit by her side, joking, “Your eldest brother specially waited for twenty minutes more for you to come over.”</p><br/><p>Chu Lian found it strange, so she asked, “Eldest Brother-in-Law, is anything the matter?”</p><br/><p>He Changqi’s broad, tan face seemed to flush a little as he pressed his lips together, too embarrassed to speak up. He could only turn to Matriarch He for help.</p><br/><p>“Look at you, it’s just a small matter and it’s gotten you so flustered you can’t even speak. Sanlang’s wife married into our family, so you’re her older brother now!” Matriarch He pretended to scold He Changqi before taking Chu Lian’s hand into her own and smiling. “Your eldest brother has some friends coming over as guests in two more days. After eating those poached fish slices you sent over last night, he thought that your cooking was delicious. Thus, he wanted to ask if you could help cook a meal to impress them.”</p><br/><p>When inviting guests over, the host always had to have either fine food or fine wine prepared. Since secret recipes were regarded so preciously in this time, each estate always had at most one or two signature dishes to bring out for their guests.</p><br/><p>Previously, House Jing’an had Cook Zhou’s confections as their specialty. Now that Cook Zhou had passed, He Dalang felt that he didn’t have any good food to impress his friends with, so he continued to delay the meal he owed them time after time.</p><br/><p>Now that he had this chance, he couldn’t let it go.</p><br/><p>Chu Lian had thought that it would be something hard for her. If it was just adding one or two dishes for her eldest brother-in-law’s guests, then that would be extremely easy. Chu Lian immediately nodded and agreed to the request.</p><br/><p>Dalang had finally gotten rid of the one thing weighing on his mind and was about to leave when Senior Servant Liu rushed in from outside.</p><br/><p>“Matriarch, the outer court’s steward just sent over some news! There’s someone from the palace requesting an audience!”</p><br/>\n</div>"}