{"title": "Chapter 159: Reading Letters From Home (4)", "id": 159, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-159-reading-letters-from-home-4", "volume_title": "Volume 2", "body": "<h1>Chapter 159: Reading Letters From Home (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He Changdi wouldn’t have known about all these military secrets had it not been for the fact that he’d lived it once already.</p><br/><p>If he threw his lot in with a leader like that and boosted Captain Guo’s bravery with his own resourcefulness, General Qian would definitely notice the improvement in Captain Guo. Using that as a chance, he could then make himself known to the Duke of Lu and earn the opportunity to get into his graces!</p><br/><p>This was He Changdi’s current plan for himself. During the past few days, he had kept himself busy coming and going in order to build connections with the northern border troops, all in the hopes of getting posted under Captain Guo.</p><br/><p>He hadn’t mentioned a single word of these secrets to anyone, not even Prince Jin. However, that wicked woman had somehow had the same thoughts as him!</p><br/><p>He Sanlang had already confirmed that Chu Lian hadn’t experienced the same past life that he had, so he was certain that Chu Lian didn’t know how events would progress from now on. So why had she sent him a hint like that in such an obscure way?</p><br/><p>Wasn’t her ‘true love’ Xiao Wujing?</p><br/><p>Meanwhile, the sleeping Chu Lian back in Songtao Court didn’t know that her small gesture of kindness had caused the paranoid He Changdi to nearly pull his hair out over the various possibilities.</p><br/><p>Since she couldn’t possibly be clairvoyant, and she hadn’t been reincarnated, then He Changdi could only say that that wicked woman Chu Lian was sharper than he had initially thought.</p><br/><p>He hadn’t expected that there was another layer of depth to her intelligence that she had kept secret, even throughout her previous life. All this mystery had erased any shred of gratitude he had ever felt towards her. On the contrary his caution against her had increased by another level.</p><br/><p>If Chu Lian found out what chaos her drawings had caused, she would have definitely sprawled out on her bed and beat the mattress a few times with her fists.</p><br/><p>Please, my dear husband, how does your brain work? If a normal wife were to do such a helpful thing, shouldn’t you be heaping praises on her and showering her with your love? How about a compliment or two about being smart and virtuous? Why are you doing the opposite?!</p><br/><p>He Changdi folded up the letter and put it back into the huge leather envelope. Following that, he took it and walked up to the fire burning in the brazier.</p><br/><p>With a wave of his hand, the envelope landed inside the brazier and was completely surrounded by flames. When he saw that the letter had caught fire, He Sanlang’s eyes suddenly dimmed; he reached out at lightning-fast speed and pulled the envelope out of the fire.</p><br/><p>There was a flurry of activity as he put out the burning envelope. When He Sanlang saw the singed corner, the only evidence to his rash action, there was a strange feeling in his heart.</p><br/><p>The set of drawings tucked inside appeared in his mind.</p><br/><p>Had that wicked woman really just been trying to give him a hint? Perhaps the truth wasn’t as dark as he thought?</p><br/><p>Thoughts as messy as the scattered grass of the plains ran through his head. Eventually, he tossed the singed envelope into a wooden box. Out of sight, out of mind.</p><br/><p>Chu Lian had practised two pages of calligraphy in her little study. After destroying the evidence, she had gone to try on her new court dresses. Senior Servant Gui recorded down any parts that hadn’t fit in order to alter the dresses herself later.</p><br/><p>During her daily greetings, Chu Lian made a request to Matriarch He to pay a visit to Guilin Restaurant. She wanted to see for herself what state it was in.</p><br/><p>After finishing all the small tasks, Chu Lian changed into a plain blue dress and brought Wenlan and Wenqing along with her. She boarded the carriage that the estate had already prepared for her and left for Guilin Restaurant, accompanied only by a few manservants and guards.</p><br/><p>Guilin Restaurant was located in the old west market, which was rather far away from the Jing’an Estate. The alleys were small and twisty, so it took an hour before they arrived.</p><br/>\n</div>"}