{"title": "Chapter 169: Disbelief (3)", "id": 169, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-169-disbelief-3", "volume_title": "Volume 2", "body": "<h1>Chapter 169: Disbelief (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bookkeeper Wang and the middle-aged woman who did chores escorted Chu Lian all the way to the entrance of the alley. The white-haired Bookkeeper Wang kept watching the carriage as it left and entered the bustling main street. He finally heaved a sigh of relief, but his clouded old eyes didn’t seem to hold much hope.</p><br/><p>He turned around and used a cane for support as he hobbled back to Guilin Restaurant. The middle-aged woman who was supporting him on his other side heard a soft, unmistakable sigh from him.</p><br/><p>She didn’t understand why he was sighing and asked, “Mr Wang, the estate has sent Third Young Madam here to fix the restaurant. Shouldn’t you be happy?”</p><br/><p>The old bookkeeper paused and looked around them. He gave a bitter smile. “In a place like this, how could we possibly regain our former glory?”</p><br/><p>Actually, the old bookkeeper didn’t believe that Guilin Restaurant could return to its glory days. He was experienced enough to determine this after living so many years and working as a bookkeeper in Guilin Restaurant for twenty years. He had lived through the ups and downs of this restaurant’s life as well. The world was ever-changing. It wasn’t as if the Wang family was the only reason that the restaurant hadn’t been doing well.</p><br/><p>All of the famous tea houses, restaurants, silversmiths, and goldsmiths in the capital were located in bustling, lively districts. There was an old saying that fit this situation: “A dead district is a dead business.” Restaurants needed a constant flow of people to survive.</p><br/><p>The middle-aged woman couldn’t quite understand the bookkeeper’s meaning. She thought rather simply. In her eyes, as long as their master had money, anything could be done! Was there anything that couldn’t be done with money?</p><br/><p>“Old sir, aren’t you thinking too negatively? See, since Third Young Madam came today, she already threw out the Wang family. That was a delight!” It was clear that this middle-aged servant had also suffered torment under the Wang family.</p><br/><p>“Mrs Li, how could you possibly understand? Just wait and see! Ah…” The old bookkeeper didn’t bother trying to explain further. He slowly walked back to Guilin Restaurant.</p><br/><p>Honestly speaking, Third Young Madam was just a young girl who had just come of age. Even if she had been raised well with the bearing and talents of a noble lady, it wasn’t an easy task to revive a failing restaurant, especially in a residential district like this one.</p><br/><p>Even if she had a noble title backing her, reviving this old restaurant still wasn’t going to be easy!</p><br/><p>—</p><br/><p>Back in the carriage, Chu Lian didn’t know that the old bookkeeper didn’t have a shred of confidence in her. She was peeking out from the curtains of the carriage to look outside from time to time.</p><br/><p>It hadn’t been easy for her to come out alone today. Wouldn’t it be such a waste if she didn’t go out for some shopping before returning home?</p><br/><p>Wenqing and Wenlan had also noticed Chu Lian’s interest. They exchanged smiles.</p><br/><p>Wenqing said, “Third Young Madam, this servant can act as your guide, if you wish.”</p><br/><p>Chu Lian turned to look at Wenqing, her eyes wide with surprise. “You’re familiar with this place?”</p><br/><p>Wenlan pressed her lips together to hide her smile. She was a little more introverted than Wenqing and usually spoke less. If she could avoid it, she would rather not speak. Whenever she was with Wenqing, it was always Wenqing who would speak for them.</p><br/><p>“Third Young Madam, this servant and Wenqing both grew up in the streets of the capital. It was only in the past two years that we lived with Senior Servant Zhong on an estate. However, we came out to buy things quite often, so we’re very familiar with the capital.”</p><br/><p>Chu Lian blinked. Her eyes lit up in pleasant surprise. Wow! So they were like living maps!</p><br/><p>“Tell me about the capital, quickly!”</p><br/><p>Although the original ‘Chu Lian’ had also lived in the capital since birth, she was the legitimate daughter of a noble house, so she rarely left her estate. How could she be familiar with the common roads and markets like Wenqing?</p><br/><p>In the gentle shaking of the carriage, Wenqing smiled as she explained the lay of the land to Chu Lian.</p><br/><p>“Third Young Madam, we’re about to leave the boundaries of Changping Lane. After we pass this small street, Pingkang Lane will be in front of us…”</p><br/><p>To the left of Pingkang Lane was the east market, while Xuanyang Lane was to its south. To the north was Chunming Avenue, where most of the important officials stayed. This included the visiting officials normally stationed in other parts of the country, as well as some of the up-and-coming scholar candidates.</p><br/><p>For example, Lord Yang’s official residence was located in Pingkang Lane.</p><br/><p>Chu Lian lifted the curtain and curiously peeked outside. Suddenly, a figure cut into her line of sight.</p><br/>\n</div>"}