{"title": "Chapter 162: Incognito Visit to Guilin Restaurant (3)", "id": 162, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-162-incognito-visit-to-guilin-restaurant-3", "volume_title": "Volume 2", "body": "<h1>Chapter 162: Incognito Visit to Guilin Restaurant (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian followed the woman to a table in the main hall. When she looked down at the table, she realised that there was a layer of dust on it. Wenqing quickly used a handkerchief to wipe away the dust before supporting Chu Lian as she sat down.</p><br/><p>Ah Cai had followed behind the middle-aged woman, and was currently sporting an extremely unwilling expression on that ordinary face of his. If the woman hadn’t tugged his arm once, he probably would have thrown another tantrum.</p><br/><p>Wenqing noticed that there was dust on the teacups on the table as well. Seeing as there was dust everywhere, she didn’t bother spending the effort to clean any more. She stood behind Chu Lian and asked, “I’ve heard that your restaurant has been open for quite a number of years. Our madam loves to eat good food. What signature dishes does your restaurant have to offer?”</p><br/><p>The middle-aged woman choked on the answer. Guilin Restaurant hadn’t been doing business for quite a few months already. The cooks here had quit long ago, how could they possibly have any signature dishes to serve? The woman thought for a bit before replying, “This young lady must be very knowledgeable. Our restaurant has indeed been open for many years. We have a few signature dishes, of course. Otherwise, how else could we have remained here for so long?”</p><br/><p>Wenqing inwardly snorted, but didn’t show a speck of her disdain on her face. She still remembered Chu Lian’s orders back in the carriage.</p><br/><p>“Oh? Since you have some signature dishes, then list out their names for our madam. Our madam has eaten dishes from all over this country, and she’s had her fair share of delicacies.”</p><br/><p>The woman hadn’t expected Wenqing to be so thorough with her questioning. Her expression instantly stiffened. There weren’t any cooks at all in Guilin Restaurant right now. How could they possibly know the names of the commonly served special dishes?</p><br/><p>Seeing that Ah Cai wanted to step up and throw the guests out, the woman grabbed his arm and tried to discreetly hold him back. Her eyes darted about the room as she tried to come up with a solution, but upon seeing none, she quickly tossed out another smile and said, “Young madam, I’m afraid I’m too uneducated and don’t know the proper names for all those fancy dishes. Why don’t I go back to the kitchen, get one of the cooks, and have them make some for you to see instead?”</p><br/><p>What kind of restaurant wouldn’t know the names of their signature dishes? Was this woman taking them for fools?</p><br/><p>Wenqing harrumphed. She was about to expose the trickery of this sly woman when Chu Lian sent her a reassuring look.</p><br/><p>The maidservant bit her lip and waved her hand at the woman. “Then hurry up and get the cooks to make the meal then. Our madam wants one portion of every signature dish you have. Remember to make it quick.”</p><br/><p>“Certainly. Please wait for a moment, madam!” After saying so, the woman turned and glared at Ah Cai. She lowered her voice and said, “Ah Cai, come with me to the back to prepare some tea for our guests.”</p><br/><p>Finally, she dragged away the unwilling Ah Cai.</p><br/><p>It was only after Wenqing had confirmed that the woman and the waiter were no longer within hearing range that she asked, “Third Young Madam, Guilin Restaurant is clearly no longer doing business. Why did you have me place an order for food anyway?”</p><br/><p>Chu Lian winked mischievously at Wenqing. “I want to see what kind of tricks they’ll try to pull.”</p><br/><p>Wenqing scratched her head speechlessly.</p><br/>\n</div>"}