{"title": "Chapter 176: Fishing for a Gift (2)", "id": 176, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-176-fishing-for-a-gift-2", "volume_title": "Volume 2", "body": "<h1>Chapter 176: Fishing for a Gift (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Yuan held back the jealousy in her heart and forced herself to show a smile. “I didn’t expect Sixth Sister to have become so rich! No wonder you’ve come to Jinshi Pavilion. I took a liking to an accessory just now, it’s only a hundred or so taels of silver. That must be nothing to Sixth Sister. Perhaps Sixth Sister could buy it for your little sister?”</p><br/><p>Chu Yuan wanted all of Chu Lian’s gold to be hers. However, she couldn’t just snatch all of it in one go; she could only resort to these small tricks to make away with it bit by bit.</p><br/><p>When Chu Yuan finished speaking, she shot a glance at the manager. The manager knew that these ladies were fighting, so she didn’t say much. She simply brought out the accessory that Miss Yuan wanted earlier and placed it on the table in front of the ladies. She smiled as she introduced it to Chu Lian. “Madam, this young miss in yellow took a liking to this jade bangle earlier, fifty taels. This golden hairpin with emerald inlays is the one that the lady next to you chose, one hundred and fifty taels. As for the youngest miss here, she picked this pearl and gold bracelet, sixty taels.”</p><br/><p>Not a single one of them was cheap!</p><br/><p>When the manager secretly glanced at the humbly dressed Chu Lian, she was surprised. Dressed like that, who could have recognised her as the subject of the latest gossip in the capital, Honoured Lady Jinyi?</p><br/><p>The manager only took a quick look and didn’t dare to stare too openly. She was trying to guess if Honoured Lady Jinyi was really that poor, or if she had purposely dressed like this for a reason.</p><br/><p>Chu Lian reached out with her slender fingers and looked over each of the three accessories carefully. She kept nodding, seemingly satisfied. However, when she put the last item back into the brocade box, her brows drew together and she seemed a little put on the spot.</p><br/><p>“As expected of accessories made by Jinshi Pavilion, they’re made quite finely.” As she said so, Chu Lian showed a slight trace of embarrassment on her face.</p><br/><p>Miss Fu and the others had been closely observing Chu Lian, so when Miss Fu spotted that minute change of expression, she inwardly snorted. She had guessed it right. So what if she was House Jing’an’s Third Young Madam? Or Honoured Lady Jinyi? Judging by her shabby appearance today, she probably wasn’t passing her days very well in the Jing’an Estate. She probably wouldn’t even be able to take out a hundred taels of silver, going by her expression!</p><br/><p>“We’re still young, so we chose simpler accessories. These three ornaments don’t even add to three hundred taels. It’s not a small sum for us, but it must be barely anything to Sixth Sister. Sixth Sister is an Honoured Lady that the Emperor personally named!” Miss Fu added on evilly.</p><br/><p>Chu Lian rolled her eyes in her mind.</p><br/><p>If three hundred taels isn’t much, why don’t you just rob me directly?!</p><br/><p>Three hundred taels would be enough for a commoner’s family to live out their whole lives!</p><br/><p>Chu Lian put on a troubled smile. “Ninth Sister, what are you saying?”</p><br/><p>Miss Su had also detected Chu Lian’s floundering, so she reprimanded Miss Fu. “Ninth Sister, how could we possibly ask Sixth Sister to pay for our shopping? Don’t make trouble for her!”</p><br/><p>“Fifth Sister, that’s an unjust accusation. How could Sixth Sister be troubled by a mere three hundred taels?”</p><br/><p>Chu Lian could have claimed not to have any money in the past, because that was the truth! However, thanks to that Honoured Lady title, she couldn’t just claim to be poor now.</p><br/><p>Her noble title meant that her actions affected the reputation of the imperial family. With the personal name, she could be counted as half an imperial family member. If she claimed to be poor, then it would be the same as claiming that the imperial family was poor, disgracing the imperial family.</p><br/><p>Chu Lian looked more carefully at this Ninth Sister of hers. She hadn’t expected a thirteen year old child to be trying such plots already.</p><br/><p>How was Miss Fu so confident that she would just take this lying down?</p><br/><p>Miss Yuan’s gaze was fixed on that golden hairpin. It was made with fine detail, and the three similarly sized emeralds at the top of the hairpin were pretty. Under the lamp light, it would probably shine even more. When she thought of how this beautiful hairpin would soon be hers without having to spend a single coin, and how angry Chu Lian would be in the process of paying for it, her heart was filled with joy.</p><br/><p>Thus, Miss Yuan helped to further the ploy. “Fifth Sister, don’t forget. It’s not the same as before. Sixth Sister is the Honoured Lady Jinyi now!”</p><br/><p>Although Miss Su wanted to protect Chu Lian, the two younger sisters were collaborating against them so she couldn’t even think of a rebuttal. Finally, she could only look at Chu Lian apologetically.</p><br/><p>Chu Lian returned a troubled smile to her. Without saying whether she could afford to buy these accessories, she turned to the manager standing by the side to ask, “Manager, are there other designs? Take them out to show me.”</p><br/><p>Miss Fu was delighted by Chu Lian’s increasingly troubled expression. She didn’t care whether Chu Lian would buy that bracelet for her or not. All she wanted was to make Chu Lian lose face and fall in disgrace. She wanted her to know that it wasn’t easy to keep that noble title of hers. Once the news that Chu Lian had disgraced the imperial family’s name spread out, someone would definitely pass it on to the Emperor or Empress. By then, before she could even settling down with her noble title, it would probably be taken back. Chu Lian would become the joke of the capital then!</p><br/>\n</div>"}