{"title": "Chapter 195: Get It For Me (1)", "id": 195, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-195-get-it-for-me-1", "volume_title": "Volume 2", "body": "<h1>Chapter 195: Get It For Me (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Upon hearing that her mother was pardoned, Imperial Princess Leyao smiled even more sweetly as she clung onto the Chengping Emperor’s arm and giggled.</p><br/><p>The Chengping Emperor looked at this young daughter of his who he had spoiled since the day she was born. In the blink of an eye, she had already turned ten and was starting to bloom into a young lady’s figure. Looking upon her now, he could only lament as his heart was filled with sadness.</p><br/><p>When Imperial Princess Leyao had been a little younger, he would even carry her in his arms. However, as she grew older, the most affectionate gesture he could give her was simply petting her soft head of hair.</p><br/><p>Imperial Princess Leyao was the Chengping Emperor’s youngest daughter. Daughters were meant to be spoiled, while sons were to be raised strictly. Furthermore, there were some other hidden matters that most people wouldn’t know about, so the Chengping Emperor didn’t mind pampering this youngest daughter of his a little more than usual.</p><br/><p>Imperial Princess Leyao’s almond-shaped eyes, a little similar to Chu Lian’s own pair, flitted about Tingyu Pavilion once before finally settling on Chu Lian.</p><br/><p>Hidden by the Emperor’s broad sleeves, Imperial Princess Leyao’s eyes narrowed before returning to their normal, lovable expression. “Father, Father, is she the new Honoured Lady Jinyi that you blessed with a title?”</p><br/><p>The Chengping Emperor smiled. He wasn’t a fool- he knew that his daughter was a little narrow-minded and liked to play some tricks on people she didn’t like. For example, he knew that Imperial Princess Leyao had definitely met Chu Lian at the Dingyuan Estate, and he also knew that that particular encounter hadn’t ended well for his daughter. Despite this fact, she was now acting as if today was the first time she was meeting Chu Lian.</p><br/><p>The Emperor was too lazy to expose her, so he played along. “Yes, she is. Why are you asking, Leyao?”</p><br/><p>Chu Lian stood where she was and gave an appropriate greeting to Imperial Princess Leyao from afar. Her heart sunk a little when she heard Imperial Princess Leyao mentioning her on purpose. A grudge had been born between them during their first meeting, and it wasn’t going to go away anytime soon.</p><br/><p>Imperial Princess Leyao looked up at the tall and handsome Emperor with wide eyes filled with admiration. Using a childish voice, she said, “Father, Yao’er heard that Honoured Lady Jinyi makes some tasty longevity peach buns! Why don’t you let her make some for Yao’er in Yao’er’s palace? Yao’er is really craving them!”</p><br/><p>The moment Imperial Princess Leyao finished speaking, the gentle expression on the Emperor’s face immediately turned into stormy clouds. Imperial Concubine Wei’s heart leaped in fright and she tugged Princess Leyao towards her, scolding her in a quiet voice. “Yao’er, the palace has everything you could ever want to eat. Those longevity peach buns are only meant to be eaten during longevity feasts. You’re not allowed to eat them otherwise.”</p><br/><p>Imperial Princess Leyao had only heard that the Emperor was meeting Chu Lian in Tingyu Pavilion. She hadn’t paid attention to anything else before rushing straight over, intending to cause some trouble for Chu Lian. Thus, she didn’t know anything about what had just occurred here.</p><br/><p>Those longevity peach buns had been the cause of the Emperor’s earlier ire. Now that he was reminded of the matter, how could the Emperor be in a good mood?</p><br/><p>Princess Leyao had only wanted to cause trouble for Chu Lian somehow. How could she bother to listen to Imperial Concubine Wei’s reprimand? She pushed her way out of Imperial Concubine Wei’s arms and hugged the Emperor’s arm again. “Father, didn’t you say you love Yao’er? Why won’t you agree to such a small request for Yao’er? Yao’er just wants to eat Honoured Lady Jinyi’s longevity peach buns!”</p><br/><p>Chu Lian fought hard to keep the calm in her expression. This Imperial Princess Leyao had really been spoiled beyond hope. The Emperor’s mood was clearly sinking lower and lower, but the princess still wasn’t giving up.</p><br/><p>Empress Shen looked at Imperial Concubine Wei and her daughter with cold eyes. Her gloom from earlier had completely disappeared; instead, she now looked down upon Imperial Princess Leyao full of disdain. What a narrow-minded girl!</p><br/><p>Imperial Princess Leyao was already used to being spoiled. What she wanted was what she would get. Inside the palace, she was pampered by the Emperor and spoiled by the Imperial Concubine. Even Consort De would give in to her demands. There wasn’t a single time when she hadn’t gotten her way. When she saw that the Emperor remained silent, tears of frustration rolled down her cheeks in an effort to seek his attention.</p><br/><p>“Father doesn’t love Yao’er anymore… sob sob…”</p><br/><p>The Chengping Emperor’s mood had been dismal from the very beginning. It had only been alleviated slightly with the entrance of his daughter. But now, that very same daughter was crying, and her incessant cries were like needles piercing his brain. He was the great and mighty sovereign of this country- even if he was inclined to spoil his children, there needed to be a limit in accordance with his stature.</p><br/><p>He looked down at his daughter, who seemed to have grown much taller since the last time he had seen her. She was already ten years old. He had thought that that was still too young, so he had given in to her time and time again. However, now that her personality had been warped to this degree, he could no longer give in to everything she wanted.</p><br/><p>The Chengping Emperor abruptly tossed his sleeves, shaking away the little hands that were clutching onto it. In a low voice, he rebuffed her and said, “Leyao, are you finished with this nonsense?”</p><br/><p>He had never ever reprimanded the princess before, but now he was scolding her in such a cold tone of voice! Leyao was shocked by the first scolding she had ever received from the Emperor. She stared up at him with wide, disbelieving eyes, as if she couldn’t believe that those words had come out of his mouth.</p><br/><p>After what seemed like an eternity, she asked with a trembling voice, “Father… You’re… scolding Yao’er?”</p><br/><p>Just as Imperial Princess Leyao was about to say something else, Imperial Concubine Wei covered her mouth in fright.</p><br/>\n</div>"}