{"title": "Chapter 198: A Purse of Snacks (1)", "id": 198, "volume": 2, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-198-a-purse-of-snacks-1", "volume_title": "Volume 2", "body": "<h1>Chapter 198: A Purse of Snacks (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When the Emperor saw that Eunuch Wei hadn’t moved, he shot an icy glare at him. Eunuch Wei didn’t dare to disobey orders, so he obediently went on his way, despite his troubled expression.</p><br/><p>Chu Lian was in the middle of eating her second mini mooncake when she heard Eunuch Sun greeting someone.</p><br/><p>Curious, Chu Lian turned around, only to see that there was now another middle-aged eunuch standing behind her, holding a horsetail whisk in his arms.</p><br/><p>Eunuch Sun smiled as he introduced the newly arrived eunuch to Chu Lian. “Honoured Lady, this is the chief steward of the imperial palace, Eunuch Wei. He serves by the Emperor’s side.”</p><br/><p>Chu Lian smiled and nodded, greeting him cheerfully with a ‘Chief Steward Wei’.</p><br/><p>Chief Steward Wei bowed towards Chu Lian respectfully. His eyes swept over the purse she was holding in her hands, and upon seeing its quickly depleting state, he couldn’t help but inwardly beg: ‘My dear ancestor, please eat a little slower- the Emperor’s still waiting for those snacks!’</p><br/><p>“Honoured Lady really knows how to enjoy life. This Mixiang Pavilion is the best place to admire flowers in the entire imperial gardens. Just a few days ago, the Empress Dowager even mentioned that the best thing to do during the middle of autumn is admire the chrysanthemums while enjoying some round cakes.”</p><br/><p>Chu Lian found this whole meeting rather strange. This Eunuch Wei should be a very busy person, judging from his job title. How could he have the spare time to stand here and make small talk with her?</p><br/><p>When she saw that Eunuch Wei seemed to want to continue chatting, Chu Lian could only play along. “Chief Steward Wei, you’re overestimating me. I just happened to be passing by and stopped to eat a few snacks since I was feeling hungry.” Chu Lian looked down at the snack purse she was holding and continued, “These aren’t round cakes, by the way. They’re just some snacks I made for myself.”</p><br/><p>“Oh? This servant has long heard that Honoured Lady’s heart is as good and pure as an orchid. This servant didn’t think that Honoured Lady would also know how to make her own confections. This servant wonders if there might be a chance to taste Honoured Lady’s cooking.”</p><br/><p>When those words left Eunuch Wei’s mouth, even he couldn’t hold back the slight, embarrassed flush on his cheeks. But no matter how awkward this was, he couldn’t disobey the Emperor’s orders!</p><br/><p>Chu Lian was stunned. What? A high-ranked eunuch she had never met before- the chief steward of the palace, at that- was asking her for… her snacks?</p><br/><p>With Chu Lian’s baffled gaze focused on him, Eunuch Wei awkwardly received the snack purse. Following that, he gave her a deep, low bow, and then… he ran off… at lightspeed…</p><br/><p>Only Chu Lian was left standing in the pavilion, her hands still outstretched as she said to thin air, “Eunuch Wei… My purse…”</p><br/><p>Unfortunately, Eunuch Wei was already long gone by now.</p><br/><p>Chu Lian’s expression was cloudy. She turned to ask the frozen Eunuch Sun, “Eunuch Sun, is the food in the palace that bad?” Otherwise, why would the chief steward have stolen her snacks and run away?!</p><br/><p>The corners of Eunuch Sun’s lips twitched. In the end, he could only let Honoured Lady Jinyi continue believing her own conclusions. After all, he worked under Eunuch Wei. How could he dare to cast suspicion on Eunuch Wei’s conduct? Though, within the privacy of his mind, he was also severely perplexed by this series of events. Eunuch Wei was one of the Emperor’s trusted servants: he could eat the best birds’ nest and the best abalone every day if he wanted to. How could he have come to covet a young girl’s snacks, and then just steal them away like that? Had the sun risen from the west today?</p><br/><p>But Eunuch Wei was already long gone, and it was just one small purse with a couple snacks in it. There was nothing special about it, so Chu Lian didn’t pursue the matter further.</p><br/><p>She was about to rest for a moment longer before going over to the Empress Dowager’s palace to look for Matriarch He, but Royal Princess Duanjia suddenly came striding over from not too far away.</p><br/><p>When Royal Princess Duanjia reached Chu Lian’s side, she pulled her up without waiting for Chu Lian to give her a bow in greeting. “I heard from the Empress Dowager that you were over here in the imperial gardens when I entered the palace, so I came over to find you. I didn’t think I would bump into you at Mixiang Pavilion!”</p><br/>\n</div>"}