{"title": "Chapter 210: An Old Matriarch’s Worries (2)", "id": 210, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-210-an-old-matriarch%E2%80%99s-worries-2", "volume_title": "Volume 3", "body": "<h1>Chapter 210: An Old Matriarch’s Worries (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Although the matriarch had been absorbed in all her thoughts, not too much time had passed. When Chu Lian saw that the matriarch was in deep thought, she didn’t disturb her.</p><br/><p>Suddenly, Matriarch He’s eyes caught sight of a brocade box placed to the side. This was the sapphire headdress that the Empress Dowager had awarded them for winning the round cake competition.</p><br/><p>Her expression changed slightly and she turned to look at Chu Lian. Her young granddaughter-in-law’s eyes were fluttering as she fought the urge to sleep. Her head was shaking as she was close to nodding off.</p><br/><p>The worry in Matriarch He’s heart eased away for a moment. This child was just a carefree one, never taking anything to heart. Something that would draw most people’s attention seemed to be like some background scenery to her. She really wondered how House Ying had managed to bring her up with this kind of personality.</p><br/><p>“Sanlang’s wife! Wake up!”</p><br/><p>After calling once and not receiving any reply, and seeing that her head was about to hit the wall of the carriage, Matriarch He found it funny. She could only reach out to push Chu Lian a little.</p><br/><p>Chu Lian was jolted awake. It had been a tiring day for her after all. Her nerves had been tightly wound up all day, and she had finally gotten a chance to relax. Her eyelids were struggling to stay apart from each other.</p><br/><p>“Ah? Grandmother, what’s wrong? Are we home yet?”</p><br/><p>Matriarch He purposely put on a strict expression, “What do you mean, are we home yet? There’s still a long way to go!”</p><br/><p>Chu Lian’s shoulders drooped down. “It’s too tiring to enter the palace… Grandmother, please please please don’t bring Granddaughter-in-Law there next time. Granddaughter-in-Law prefers to sleep at home and cook.”</p><br/><p>Matriarch He patted Chu Lian’s slender shoulders a little helplessly. “You’re really a lazy little imp. Alright, drink some tea to help your mind stay awake. We don’t even have a blanket in this carriage, so you can’t sleep. It won’t be good if you catch a cold. We’re almost home, hang in there for a while longer.”</p><br/><p>Chu Lian slapped her own cheeks and managed to chase away some of her sleepiness. When she turned and saw that Matriarch He was still looking at her with humour in her eyes, she tilted her head to the side and asked, “Does Grandmother have something else to say?”</p><br/><p>When Matriarch He’s eyes met with the bright and clear eyes of Sanlang’s wife, she felt a mysterious soothing comfort in her heart. She nodded and pointed at the brocade box in the corner. “Lian’er, who do you think this headdress should belong to?”</p><br/><p>Chu Lian cast a sideways glance at the brocade box before remembering that this was the sapphire headdress that the Empress Dowager had awarded to them. She wasn’t all that interested in accessories. She would simply wear some normal ones usually, and she wasn’t very picky with them. Furthermore, she had managed to peek at the headdress when the Empress Dowager had awarded it to them. It was indeed an exquisite and expensive-looking ornament. However, perhaps due to the passing of time, the style it was made in was a little old, and it didn’t suit a young girl like her.</p><br/><p>Matriarch He was watching Chu Lian. When her eyes drifted to the brocade box, her expression had remained unchanged as if the contents didn’t attract her one bit. The matriarch was satisfied with this reaction.</p><br/><p>“Granddaughter-in-Law feels that this headdress should be given to Eldest Sister-in-law. Eldest Sister-in-law has also suffered no small amount of fright today.” Chu Lian said with a smile.</p><br/><p>As much as she had already lost all interest in making friends with Madam Zou, since Matriarch He was clearly expecting her to say something along those lines, then she would go along with her wishes. Anyway, Matriarch He was still going to be the one in charge of determining the recipient of the headdress. She knew that Matriarch He would still give it to Madam Zou in the end, no matter what she said. Since the stage was already set like this, why go against the flow?</p><br/><p>Actually, Chu Lian didn’t really care. Anyway, it wouldn’t end up in her hands anyway, so it didn’t matter who got it. Since it was a gift from the Empress Dowager, they couldn’t sell it for money anyway. It was the same as keeping it as a pretty decoration to look at.</p><br/><p>As expected, Matriarch He’s smile turned softer. “Good child, you’re starting to think along the same lines as Grandmother now.”</p><br/><p>Chu Lian was as thick-skinned as they came. After receiving Matriarch He’s praise, she didn’t blush at all. She even smiled from ear to ear, showing off her pearly white teeth.</p><br/><p>When they returned to the Jing’an Estate, Matriarch He instructed her to return to her courtyard to rest. She wa still in the middle of growing after all!</p><br/><p>Chu Lian didn’t stand on courtesy and refuse the offer. She declined to send Matriarch He back to her own courtyard, and let Xiyan help her back to Songtao Court.</p><br/><p>She had gone out in the morning and only come back when it was dark. She had used up all her energy on this tiring day. Wenqing even had to be on standby to help her while she was bathing.</p><br/><p>When she climbed onto the bed and burrowed under her blankets, it wasn’t long before she fell asleep.</p><br/><p>Senior Servant Gui was both gratified and sympathetic to her plight. She pulled the covers over Chu Lian before ordering Jingyan to keep watch over her in the night. It was only then that she returned to her own room to rest.</p><br/>\n</div>"}