{"title": "Chapter 224: Old Gourmet (3)", "id": 224, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-224-old-gourmet-3", "volume_title": "Volume 3", "body": "<h1>Chapter 224: Old Gourmet (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The servant who had brought the ingredients didn’t dare to stay in the kitchen and watch. She lowered her head and led the other maidservants out and took her post by the kitchen entrance again.</p><br/><p>Xiyan washed the oranges before passing them to Chu Lian. In order to make them look more appetising, Chu Lian carefully carved out some simple patterns on the skins of the fruits. After that, she cut them open. When it came to the third orange, as she slid the knife into the orange, it was suddenly blocked by something within. Chu Lian frowned and pulled the orange apart. Somehow, there was a thin iron capsule within!</p><br/><p>Xiyan’s eyes widened and her face was filled with shock.</p><br/><p>Conversely, Chu Lian had only paused for a moment before calming down. She shot a glance at Xiyan before looking at Mingyan, who was busy cooking porridge at the stove, indicating that Xiyan had to stay quiet.</p><br/><p>Chu Lian quickly pulled out that thin iron capsule with her nimble fingers. She found the mechanism that kept it closed and activated it, opening the capsule with a quiet click. Inside was a small roll of paper. </p><br/><p>As for why Chu Lian was so familiar with the capsule’s mechanism, she had read it in the original novel before. Xiao Bojian liked to send messages to ‘Chu Lian’ in this manner. He had used these kinds of iron capsules previously.</p><br/><p>Before she even opened the paper roll, Chu Lian noticed a small ‘Xiao’ written on the outside.</p><br/><p>As expected, this was a message from Xiao Bojian!</p><br/><p>That Xiao Bojian was still this delusional! He still thought that she liked him and refused to go away. Rage surfaced in Chu Lian’s heart.</p><br/><p>She immediately lost all interest in the note’s contents. In front of Xiyan, she threw the unopened note and capsule into the fire of the stove. Sparks flew from the roaring fire, turning the note into ashes.</p><br/><p>When Xiyan saw Chu Lian’s actions with her own eyes, a sense of relief came over her heart. She knew that her master didn’t have any feelings for Mister Xiao at all. Her master’s decision was right.</p><br/><p>She was House Jing’an’s Third Young Madam now. Even though she wasn’t the lady-in-charge of the main branch, she was still the mistress of the third branch. She also had the title of Honoured Lady Jinyi now. Even if she didn’t want to fight for more status and power, she still had to uphold her responsibility and reputation.</p><br/><p>Furthermore, other than leaving for the northern border, Young Master hadn’t let down Third Young Madam in any other way. Even without including Third Young Master’s handsome looks, just based on the He Family’s rules, it was a House worthy of Third Young Madam’s efforts to protect it. For a noble lady who married into a distinguished house, it was quite rare that they didn’t have to face an inner court full of their husband’s concubines.</p><br/><p>Just based on that alone, it was worth the effort for Third Young Madam to keep her reputation clean.</p><br/><p>Furthermore, He Sanlang had a good family background and was so much better than Mister Xiao.</p><br/><p>It was all that Mister Xiao’s fault! Their young miss had already married someone else. Why was he still latching on to her like a leech and refusing to let go?</p><br/><p>Xiyan vented her hatred on Xiao Bojian in her heart. The originally kind and gentle handmaid was now questioning Xiao Bojian’s ancestors in her mind about the wretch their family had given birth to.</p><br/><p>Chu Lian glanced at Xiyan and instructed her in a calm tone. “You never saw that.”</p><br/><p>Xiyan nodded in acknowledgement.</p><br/><p>After that, Chu Lian continued preparing the oranges as if nothing had happened.</p><br/><p>Two hours later, the warming and nourishing ginseng porridge as well as the fragrant stuffed orange with crab meat were both done. Chu Lian then specially cooked up two side dishes with her own hands.</p><br/><p>Old Duke Zheng had been bedridden for a long time and had stopped eating for quite a few days. He couldn’t eat anything hard. Thus, she had picked out some foods with softer textures for him.</p><br/><p>Chu Lian cleaned up a little before having her maidservants carry the food in some food containers. They then rushed back to Old Duke Zheng’s bedroom .</p><br/><p>Back in the Zheng Estate’s outer court, Xiao Bojian was left alone in the study. Heir Zheng had already rushed off to the inner court.</p><br/><p>There was a vast collection of books in the Zheng Estate’s study, so Xiao Bojian came over regularly to borrow books. At this moment, the secret guard One was whispering into Xiao Bojian’s ear while disguised as a manservant.</p><br/><p>Xiao Bojian frowned. His tone carried a trace of anger as he spoke, “What? She threw the note into the fire without looking at it?”</p><br/><p>One stood respectfully at one side and nodded.</p><br/><p>Rage rose like a wave in Xiao Bojian’s chest. He leaned against the boxwood chair with his eyes shut for a long moment before managing to calm himself down again.</p><br/><p>Lian’er! How could you be so silly? Why don’t you trust me? Do you know what I wrote in that note?!</p><br/><p>Bitterness and helplessness were mixed in Xiao Bojian’s thoughts. He really wanted to grab that annoying woman and bully her a little to vent his frustrations.</p><br/>\n</div>"}