{"title": "Chapter 243: Becoming Famous (4)", "id": 243, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-243-becoming-famous-4", "volume_title": "Volume 3", "body": "<h1>Chapter 243: Becoming Famous (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The sound of drums rang out from the stage. Manager Qin stood in the center, carrying himself with grace as he read out the numbers of the winning lots.</p><br/><p>With every number he read out, an excited cheer would cry out from below. Obviously, the person who held the lot with that number was the one cheering.</p><br/><p>In the end, De’an Restaurant’s Mr Wang wasn’t so lucky. However, he wasn’t about to admit defeat. He spent ten whole taels of silver to buy a winning lot from one of the lucky winners.</p><br/><p>He was going to Guilin Restaurant’s feast today, no matter what!</p><br/><p>The waiter following behind Mr Wang developed an eye twitch as he watched his manager give away those big silver taels. That was ten whole taels right there! A whole year of living expenses for his family!</p><br/><p>Guilin Restaurant had been renovated according to the blueprints that Chu Lian had drawn. Later on, she had also gotten Manager Qin to buy the two residences on either side of the restaurant.</p><br/><p>Although Guilin Restaurant’s entrance was still the same size, its insides had been changed completely.</p><br/><p>The rear court had been changed into a two-part courtyard, complete with its own decorative mountain and long corridors. Although it couldn’t be compared to the noble estates of the capital, it still had a certain air of delicate elegance, like the watery regions of Jiangnan.</p><br/><p>The original two-part main courtyard had been changed into several small little courts. Each court had its own style of furnishing. Some of them were simple and traditional-looking, others were homely and elegant, and there were even some modelled after the Japanese restaurants of the modern world. Basically, each court had its own unique flair.</p><br/><p>For their customers’ convenience, the inner courtyard was reserved for females, while the outer courtyard was used for males.</p><br/><p>These little courts were made for those with higher status, while the common folk who came here just to eat would be served in the main hall and on the second floor of the main building.</p><br/><p>Guilin Restaurant had two entrances. There was even a hidden entrance in the back after rounding the corner, made for those with special status.</p><br/><p>The waiters and maidservants serving in the two-part courtyard at the back were all carefully picked out by Manager Qin. They were on a different level from the servers who had been shouting and serving out the free samples on the stage.</p><br/><p>Seeing as it was almost noon, Chu Lian entered Guilin Restaurant from the back entrance, accompanied by her maidservants.</p><br/><p>Once she entered the courtyard, Manager Qin came over to welcome her. “Third Young Madam, Lady Yang and Royal Princess Duanjia have already arrived. They’re waiting for you in Earth 1 Court!”</p><br/><p>Chu Lian nodded in acknowledgement. She hadn’t expected her two guests to have come so early.</p><br/><p>“What about the male guests?”</p><br/><p>When he heard Chu Lian’s question, Manager Qin smiled. “Heir Jing’an has already arrived. He’s helping to attend to the male guests right now! Old Duke Zheng has also come.”</p><br/><p>Chu Lian raised an eyebrow. She had sent Heir Zheng two invites. However, she hadn’t expected him to give one to Old Duke Zheng.</p><br/><p>When Manager Qin saw that Chu Lian’s expression had changed slightly, he paused before adding on, “Miss Mingyan has also come over with Old Duke Zheng.”</p><br/><p>Chu Lian glanced at Manager Qin, but didn’t reply to him outright. She only said, “Have someone keep an eye on the situation. Make sure that the people who won the lucky draw are treated well, too. We can’t have anything going wrong today.</p><br/><p>“Third Young Madam, please rest assured. This subordinate will send some people to keep an eye on everything.”</p><br/><p>After she finished instructing Manager Qin, she led Wenqing and Wenlan with her to meet Royal Princess Duanjia and Lady Yang.</p><br/><p>At this time, two carriages arrived at the entrance of the alley of the old west market, accompanied by a few retainers following alongside them. Even from afar, there were already commoners gawking at this expensive-looking carriage.</p><br/><p>Some ignorant children were even following the carriage from behind and running along with it. After getting shouted at by two burly-looking retainers on horseback, the children ran off in fright.</p><br/><p>The curtains at the front of the carriage were pulled aside from the inside. Miss Yuan rolled her eyes after taking a peek. “What kind of terrible place is this? Sixth Sister must have gone mad, opening a restaurant in a place like like this.”</p><br/><p>The lady sitting opposite her, Miss Su, glared at her. “If you have nothing good to say, then don’t speak at all.”</p><br/><p>Miss Yuan harrumphed in contempt, “You’re just saying so for appearances. I bet you’re feeling the same way in your heart, maybe even more than I am. What are you playing the good guy for?”</p><br/><p>Miss Fu smiled as she watched from the side.</p><br/><p>Miss Su’s face flushed red. However, she didn’t have anything to say as a retort.</p><br/><p>She was indeed thinking the same thing inwardly. Opening a restaurant out here in this desolate residential area… would any customers really come all the way out here?</p><br/><p>Even she, as a young miss who didn’t know much about business, understood this logic. Could Chu Lian really be that stupid?</p><br/><p>When Miss Yuan saw that Miss Su was tongue-tied and red from frustration, she felt completely refreshed.</p><br/><p>Miss Yuan was filled with disdain. It was just a small restaurant- that bitch Chu Lian even sent an invite over. She hadn’t wanted to come at first, but after thinking it over, she sent someone to hear more about the situation, only to find that the restaurant was actually located in such an out-of-the-way area. Of course, she suddenly found the interest to come after that.</p><br/><p>She wanted to see how Sixth Sister was going to lose face!</p><br/><p>She still carried the grudge from that incident with the hairpin!</p><br/>\n</div>"}