{"title": "Chapter 241: Becoming Famous (2)", "id": 241, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-241-becoming-famous-2", "volume_title": "Volume 3", "body": "<h1>Chapter 241: Becoming Famous (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 241: Becoming Famous (2)</p><br/><p>This chapter has been stolen from volarenovels. Please read from the original source!</p><br/><p>The poor Manager Qin was about to be universally condemned by these people.</p><br/><p>However, Manager Qin still stood up straight on the stage with his hands behind his back. He even carried a faint smile on his face, as if those scoldings couldn’t even shake him one bit. He quietly waited for the crowd to release their emotions for a moment before continuing calmly, “As the saying goes, if you don’t have glue, don’t try to fix a broken bowl. You won’t know what I can do until you see for yourself. If you don’t believe me, why not come up and have a taste? My master and I will be satisfied, no matter your judgement, if you try it at the very least.”</p><br/><p>Oh ho, that young manager was putting out wild boasts again!</p><br/><p>Fine, I’ll make sure this conceited man returns in defeat!</p><br/><p>The spectators below hadn’t thought that Manager Qin would challenge them to judge like this, earning their ire and determination. They all clamoured to go up for a taste, wanting to make sure that this lousy Guilin Restaurant would have no choice but to admit their loss. They wanted to make this restaurant that hadn’t even opened officially turn into the joke of the capital.</p><br/><p>Manager Qin shot a look at the server behind him. The server brought out six strong men, who then moved a pile of crude porcelain dishes to the sides of the stage.</p><br/><p>Next, the crowd watched as big fat jars as tall as their calves were moved to the center of the stage.</p><br/><p>Looking at the three crudely made jars, someone below started laughing. “Hey, Mr Manager, your master can’t possibly be treating us to some ‘delicacy’ in those jars, right? Let me guess, don’t tell me that it’s pickled vegetables in those jars?”</p><br/><p>“Oh my, so Guilin Restaurant’s specialty is pickled vegetables! They must be as old as Guilin Restaurant itself!”</p><br/><p>Manager Qin wasn’t bothered by the taunts from the crowd below. He simply looked at the three jars and waved his hand at the server.</p><br/><p>The three servers standing behind the jars lifted their hands and took off the leather lids from the jars all at once.</p><br/><p>The autumn wind blew past from behind the stage, causing the fragrant aroma from the jars to drift all around the area.</p><br/><p>The noses of the people closest to the stage twitched.</p><br/><p>“What is that smell? Why does it smell so good?”</p><br/><p>“I smelled it too! Heavens, what is that?!”</p><br/><p>Steam was rising from the three crude jars, shrouding the stage in mist.</p><br/><p>Suddenly, someone pointed at the three ordinary-looking crude earthenware jars. “The smell is coming from those jars!”</p><br/><p>After that person pointed it out, quite a few people started moving closer to the stage, causing the crowd to thicken.</p><br/><p>“It’s really coming from those jars. What is it!”</p><br/><p>When someone finally asked the question, Manager Qin’s smile slowly widened. He patiently explained to the watching crowd, “This is my master’s secret recipe of braised pork in pot. It’s one of our Guilin Restaurant’s specialties. We used top-quality pork belly and cooked it in our own secret way. All of you here have good luck! This is the first time this dish is making an appearance in this world. If you want to taste it, you’ll have to be quick!”</p><br/><p>Meat! Heavens! So it was actually meat in those jars!</p><br/><p>It was the first time they had seen someone using jars to cook. Furthermore, this delicious aroma was so rich and appetising. Was it really just pork in there?</p><br/><p>How could that base pork smell so heavenly? Impossible!</p><br/><p>In the current age, very few of the nobles would use pork in their cooking. Most of the meat they ate was comprised of venison or mutton. Pork was meant for the poor commoners who couldn’t afford to buy mutton.</p><br/><p>TL Note: Here we go, the long-awaited food porn!</p><br/><p>One of my favourite foods~ braised pork!</p><br/>\n</div>"}