{"title": "Chapter 254: My Dear Wife Madam Chu, Treat This Letter Like My Person (1)", "id": 254, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-254-my-dear-wife-madam-chu-treat-this-letter-like-my-person-1", "volume_title": "Volume 3", "body": "<h1>Chapter 254: My Dear Wife Madam Chu, Treat This Letter Like My Person (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After noticing Senior Servant Liu’s expectant expression, Chu Lian could only tear open the letter on the spot.</p><br/><p>As expected, there was a thick stack of paper within. Chu Lian didn’t know what to expect. She had never received a reply from He Sanlang before. Remembering those ghastly brushstrokes of his the last time, it would be a miracle if she could make out what he was writing.</p><br/><p>Chu Lian took out the papers from the envelope and prepared herself for some major squinting and headaches to make out He Sanlang’s terrible writing. However, when she looked at the letters, it seemed like he had actually put effort into his writing this time. The brushstrokes on the paper looked beautiful and refined, yet bold and powerful at the same time.</p><br/><p>“To my dear wife Madam Chu, treat this letter like my person.”</p><br/><p>Chu Lian’s eyes widened slightly in surprise, but she calmed down her emotions and continued reading.</p><br/><p>There were actually eight whole sheets of paper in this very thick letter. Although Senior Servant Liu couldn’t see what was written on the papers, she could see that each sheet was covered in writing. Her eyes curved upwards in a smile; it looked like Third Young Master had a lot to say to Third Young Madam!</p><br/><p>Those servants outside were all blind. How dare they say that Third Young Master and his wife weren’t on good terms with each other? How could they say that Third Young Master had gone to join the army at the northern border because he wasn’t happy with this marriage that the old matriarch had gotten for him? Look at this thick stack of papers! If those people dared to continue speaking nonsense like that, she was going to smack them in the face with this letter!</p><br/><p>He Sanlang had written a lot in this letter. It took Chu Lian fifteen whole minutes to finish reading it all.</p><br/><p>When she lifted her gaze from the paper, she was met with Senior Servant Liu’s bright, sparkling eyes. The old servant practically had the words ‘tell me what’s in the letter’ written on her forehead.</p><br/><p>Chu Lian felt a little embarrassed and was very put on the spot. She didn’t know what to tell Senior Servant Liu.</p><br/><p>Did she really have to tell Senior Servant Liu that He Sanlang had questioned why she had sent him an envelope full of blank papers? That he had said she didn’t deserve to be his wife since she hadn’t put in full care and consideration for him?</p><br/><p>He had also complained that she hadn’t sent anything for him in the previous package. Her husband was fighting hard in the far off northern border, yet she hadn’t even sent him proper clothes and shoes or socks. Furthermore, she hadn’t sent any of the beef jerky and grape wine that she had sent the last time!</p><br/><p>He Sanlang even added on that she shouldn’t think too highly of herself even though she was already an Honoured Lady personally named by the Emperor. An Honoured Lady was just a fifth-ranked title. If she wanted a greater noble rank in the future, she would still have to depend on him, her ‘useless’ husband!</p><br/><p>When Chu Lian had started reading the letter, she did get a little angry at his words. However, as she continued reading on, she couldn’t help but find it funny instead.</p><br/><p>When she looked carefully at the words again, why did it seem like these bold brushstrokes carried the traces of sourness?</p><br/><p>Chu Lian rolled her eyes. This crazy husband of hers, He Sanlang, was being a hypocrite.</p><br/><p>Right after they had gotten married, he had completely changed into a different person and left her all alone in the estate without any warning at all. However, now he suddenly turned around and was trying to dictate her life; what gave him that right?!</p><br/><p>Just look at what this guy had written at the end of his letter:</p><br/><p>“Madam Chu, as my wife, what are you doing cooking for other people all day! Remember what a wife is supposed to do!”</p><br/><p>Could she just translate these words into: ‘You’re not allowed to cook for anyone else but me! Otherwise I’m going to get mad!’</p><br/><p>Chu Lian rolled her eyes and didn’t take He Changdi’s words to heart at all. He Sanlang was far off at the northern border, how was he going to do anything to her from that distance?</p><br/><p>However, she hadn’t expected that He Sanlang would get promoted to captain this quickly. She actually admired him for his ability due to this. It wasn’t easy to rise through the ranks in the army, especially during peacetime and in such a short amount of time. Great General Qian was known to be a strict commander as well.</p><br/><p>It looked like the hints she had drawn for He Sanlang the last time had come into play.</p><br/><p>Chu Lian was still in the dark about her unintentional involvement in He Changdi’s promotion.</p><br/><p>Chu Lian coughed awkwardly before reporting to Senior Servant Liu, “My husband wrote that he’s already a captain of the infantry in the northern border army. He has a sixth-ranked military title now.</p><br/><p>“Aiyah, that’s great news! This old servant has to report this to the matriarch immediately!”</p><br/><p>After saying so, Senior Servant Liu quickly got up and rushed all the way back to Qingxi Hall with the people she had brought with her.</p><br/><p>Chu Lian helplessly wiped away some sweat. At least she had somehow gotten Senior Servant Liu out of here. Otherwise, she really didn’t know how she was going to explain the rest of the letter to the wise senior servant.</p><br/><p>However, it seemed like Senior Servant Liu hadn’t been acting in her reaction just now. Hadn’t He Sanlang reported his promotion in his letter to Grandmother?</p><br/><p>But why? Could it be that he was aiming much higher and thought that a small captain rank wasn’t worth mentioning?</p><br/><p>Then why had he talked about it in his letter to her? Furthermore, he had even emphasised his newly gotten rank to her.</p><br/><p>Chu Lian thought hard and finally arrived at a possible conclusion.</p><br/><p>Could her Honoured Lady title have aggravated him somehow? Was He Sanlang trying to show off to her that he had a bright future ahead as well? That any future noble titles of hers would be up to him to bestow on her?</p><br/><p>Chu Lian shook her head and smiled. This sudden thought was just too silly.</p><br/><p>He Sanlang clearly didn’t like her at all, judging by how he had treated her after marriage. If he could divorce her without any reason at all, he probably wouldn’t even take a minute to make a decision. How could a man who treated her like that suddenly think of her in that way?</p><br/><p>The corners of her lips tugged downwards. She wasn’t supposed to think about all this. It was better to just be a layabout who didn’t need to care about annoying things like this!</p><br/><p>Xiyan was watching her master’s expression change from the side with an uneasy heart. She didn’t know what Third Young Madam was thinking about.</p><br/>\n</div>"}