{"title": "Chapter 257: Targeting Guilin Restaurant (2)", "id": 257, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-257-targeting-guilin-restaurant-2", "volume_title": "Volume 3", "body": "<h1>Chapter 257: Targeting Guilin Restaurant (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 257: Targeting Guilin Restaurant (2)</p><br/><p>This chapter has been stolen from volarenovels. Please read from the original source!</p><br/><p>Chu Lian wasn’t in charge of managing the estate and had no desire to take up the responsibility, either. She had just been drinking her water and doing her best to become one with the background. Why had this eldest sister-in-law of hers suddenly shifted the topic to her instead?</p><br/><p>Chu Lian’s hands froze while in the midst of holding up her cup. However, she knew it wasn’t a good time to speak and remained silent.</p><br/><p>Matriarch He’s brows furrowed together. How could the estate’s income have shrunken so fast?</p><br/><p>When given the rights to manage the properties of their noble estates, the madams of other estates would likely develop the properties in their hands further and bring in more income. However, look at Dalang’s wife. Not only had their businesses stagnated, but their income had even shrunk by half. How was she managing the estate’s properties?</p><br/><p>After Madam Zou spoke, she did feel a little guilty. She had appropriated some funds to plump up her dowry and House Dingyuan’s second branch after becoming the lady-in-charge of the estate. Otherwise, the estate’s income couldn’t have declined so fast.</p><br/><p>In the beginning, Guilin Restaurant hadn’t been Chu Lian’s property; rather, it had been part of the matriarch’s dowry.</p><br/><p>Madam Zou only saw the vast profits that Guilin Restaurant was bringing in now, but had never thought of the reason, or person, behind Guilin Restaurant’s success.</p><br/><p>If not for Chu Lian, then Guilin Restaurant would still be hidden away in the old west market and making a loss!</p><br/><p>After hearing Madam Zou’s words, Matriarch He was stunned for a moment. When she recovered from her daze, she said, “Dalang’s wife, what are you thinking about now?”</p><br/><p>Madam Zou took a deep breath and pinched herself under her sleeves. She gathered up her courage to say, “After all this time, Granddaughter-in-Law has finally seen that Third Sister-in-Law has a good hand at managing businesses! We’re all House Jing’an’s granddaughters-in-law, so Third Sister-in-Law should put some responsibility on her shoulders, too. Since Third Sister-in-Law has the capability, why don’t we move Guilin Restaurant into our estate’s public accounts? If Grandmother thinks that this is doing a disservice to Third Sister-in-Law, I can move out some other properties from the public accounts as compensation. Since Third Sister-in-Law is so skilled, I’m sure those properties can become the next Guilin Restaurant in less than two months.”</p><br/><p>Once Madam Zou finished speaking, it was not only Chu Lian, but even Matriarch He and Senior Servant Liu who were shocked.</p><br/><p>A glint flashed through Chu Lian’s wide almond-shaped eyes. Chu Lian inwardly sneered. She hadn’t expected that Madam Zou would try to pull such a trick on her here.</p><br/><p>It seemed like she had set her sights on Guilin Restaurant and was already green-eyed with envy.</p><br/><p>What a pity that Matriarch He had already handed over the deeds and documents for Guilin Restaurant to her a few days ago. Guilin Restaurant was now completely hers. It was useless for Madam Zou to ask for it from Matriarch He. If she wanted Guilin Restaurant, Madam Zou should be pleading her for it instead.</p><br/><p>Chu Lian lowered her gaze and continued her silence with a calm expression, as if Madam Zou’s words had nothing to do with her, as if Madam Zou wasn’t trying to steal the property in her hands right in front of Matriarch He.</p><br/><p>Matriarch He and Senior Servant Liu turned to look at Chu Lian at the same time.</p><br/><p>The furrow between Matriarch He’s brows grew even deeper. “Dalang’s wife, what are you saying? I’ve already told you that I’ve given Guilin Restaurant to Lian’er. You were present then and you didn’t say anything. Why are you trying to ask for it back now? This isn’t appropriate. Furthermore, I’ve already given Lian’er the deed to Guilin Restaurant.”</p><br/><p>Madam Zou’s expression changed abruptly. “Grandmother, if we have this Guilin Restaurant in the estate’s public accounts, we won’t have to worry about Mother’s medicine fees any longer. What’s more, Third Sister-in-Law is capable in this respect, she…”</p><br/><p>“Alright, you don’t have to say any more. I’ve already made my decision. Since you said that the public funds can no longer accommodate your mother’s monthly medical expenses, then I’ll pay for half of it from my own private funds. The remaining half will be paid for with the public funds.”</p><br/><p>This wasn’t the result that Madam Zou wanted. What she wanted was Chu Lian’s Guilin Restaurant! That was the real golden goose!</p><br/><p>If she managed to get it in hand, that meant that she would own all of Guilin Restaurant’s secret recipes. By then, she could even open up ten restaurants like Guilin if she wanted to. Wouldn’t she be rolling in riches then?!</p><br/><p>Just as Madam Zou was getting antsy and trying to come up with her next plan, Chu Lian suddenly spoke up. “I didn’t know that Eldest Sister-in-Law and Grandmother were worried over this matter. Grandmother, let Granddaughter-in-Law pay for Mother’s medicine expenses instead. Granddaughter-in-Law’s Guilin Restaurant has indeed earned quite a sum last month. Since Granddaughter-in-Law has the ability to do so, Granddaughter-in-Law should support the estate in this manner. It’s also Mother’s medicine expenses we’re talking about here. Since Sanlang isn’t around, this is all Granddaughter-in-Law can do for the estate. Granddaughter-in-Law hopes that Grandmother and Eldest Sister-in-Law will accept this small effort.”</p><br/><p>Chu Lian had been intending to act as a silent prop in the background and drink her favourite honey water while listening to Grandmother and Eldest Sister-in-law chat about family matters. However, since Madam Zou was trying to plot against her, she wouldn’t simply lie back and take it. She wasn’t someone to be bullied!</p><br/><p>She hadn’t really wanted to say something like this at first, but the situation had forced her hand.</p><br/><p>Bringing up the matter of Countess Jing’an’s medicine fees in front of Matriarch He was already reflecting rather badly upon Madam Zou. However, later on, without offering to pay for her mother-in-law’s medicine herself, she had even tried to snatch away Guilin Restaurant, her sister-in-law’s only property. Those high-sounding words she had used to pave the way beforehand were just that, grand yet empty. How could Matriarch He not detect the selfish motives in Madam Zou’s words?</p><br/><p>Despite that, Chu Lian had readily agreed to this when Madam Zou was completely unwilling to do so.</p><br/><p>She was even going to pay for her mother-in-law’s expenses.</p><br/><p>With this comparison, it was easy to tell who was the better person. Madam Zou had been left completely in the dust.</p><br/><p>Besides that, Chu Lian was originally a poor miss without much in her dowry, so this comparison stood out even more.</p><br/><p>Madam Zou’s face turned a different colour and shifted through all sorts of expressions.</p><br/>\n</div>"}