{"title": "Chapter 267: Found Him (2)", "id": 267, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-267-found-him-2", "volume_title": "Volume 3", "body": "<h1>Chapter 267: Found Him (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 267: Found Him (2)</p><br/><p>This chapter has been stolen from volarenovels. Please read from the original source!</p><br/><p>Chu Lian watched over Senior Servant Liu in the side room while waiting for movement from the parlour. Luckily, Senior Servant Liu’s body was still rather robust so she had only broken a bone from this fall. She would be completely fine after lying in bed and resting for three to four months.</p><br/><p>It was only about an hour later that someone came over from the parlour to report. When Chu Lian finished listening to the report, she quickly got up to return to the parlour.</p><br/><p>As she held onto Matriarch He’s arm to support her as they left the main branch’s courtyard, Chu Lian turned back to look through the parlour’s open doors. The master and mistress of the main branch were still kneeling in the center of the parlour, their backs ramrod-straight. However, husband and wife were now like strangers, ignoring each other.</p><br/><p>After sending Matriarch He back to Qingxi Hall, it was clear that the matriarch was worn out. Before she left, the matriarch didn’t forget to remind her not to speak of the matter, and especially not to let Countess Jing’an find out.</p><br/><p>Chu Lian nodded in agreement. She sent the matriarch all the way to her bedroom before returning to Songtao Court.</p><br/><p>The next day, Madam Zou had been grounded by Matriarch He. She heard that He Changqi had already consummated his relationship with Miaozhen last night and that Miaozhen had settled into He Changqi’s study.</p><br/><p>Due to various reasons and circumstances, He Dalang had still taken a concubine before he had hit thirty years of age. However, when the servants talked about it in private, they would say that the heir had merely accepted a bed servant. A bed servant couldn’t be counted as a concubine, so he hadn’t broken the He Family’s rules. After all, it was his wife who hadn’t been able to give birth to a male heir after ten years!</p><br/><p>Since Madam Zou had been grounded by Matriarch He for half a month, the management of the estate fell to Matriarch He instead. In the past few days, whenever Chu Lian made her morning visits to Qingxi Hall, she would be held back by the matriarch for quite some time, either getting forced to go over some of the estate’s account books or to watch the matriarch handle various matters of the estate.</p><br/><p>If not for Chu Lian being a bag of lazy bones who didn’t want to take over the management of the estate, Matriarch He would have probably let her temporarily replace Madam Zou as the lady-in-charge.</p><br/><p>In the blink of an eye, it was already mid-October. These days, Chu Lian didn’t leave the estate at all in order to avoid the inescapable pest, Xiao Bojian.</p><br/><p>During this time, Royal Princess Duanjia only visited her once to pass on some gifts from Princess Wei.</p><br/><p>Before she left, Chu Lian accompanied Royal Princess Duanjia on a walk around her own courtyard. They had even gone to the study in the outer court, but Royal Princess Duanjia’s expression still remained unhappy for some reason.</p><br/><p>Chu Lian had too many things on her plate, so she didn’t delve deeper into the matter.</p><br/><p>She and Royal Princess Duanjia also discussed opening a jewellery store together. This time, with Prince Wei’s Estate taking the lead, she wouldn’t have to worry about much. Everything would be left up to Princess Wei’s people to arrange. All she had to do was contribute her part to it: designing some new accessories every month.</p><br/><p>Currently, Chu Lian was lying on the wooden lounge chair by the window in her room. She had a book in one hand, but she had been stuck on the same page for quite a while.</p><br/><p>If they went by the novel’s original plot, then the final imperial examination would be held in the upcoming days. Xiao Bojian’s name would most likely spread throughout the whole capital by then, because he would become the top scholar of the year. It would also signify the start of the war; the Tuhuns were going to gather up an army to invade Liangzhou after years of peace in the north.</p><br/><p>The novel had simply given this event a small mention in the story. Chu Lian didn’t know what the exact details were like. She only knew that it was a hard-won war and that there had been many casualties in the northern border troops.</p><br/><p>Now that her crazy husband He Sanlang was there in the north, was he going to be safe…?</p><br/><p>Chu Lian sighed. Even though her aim had always been to be a happy layabout, she didn’t know why she was actually feeling a little worried.</p><br/><p>While Chu Lian’s thoughts were a mess, Xiyan’s joyful voice rang out from the outer room.</p><br/><p>“Third Young Madam, some news came from Guilin Restaurant!”</p><br/><p>Chu Lian set down the book in her heads and turned to look. Xiyan was usually very calm and steady. Why was she suddenly getting so excited? Had something good happened?</p><br/><p>When she heard Xiyan mention Guilin Restaurant, a single thought appeared in Chu Lian’s mind.</p><br/><p>Had they found that person?</p><br/><p>Without waiting for Xiyan to come over to her, Chu Lian pushed herself up using the armrests and cried out in surprise, “Have they found the person who can answer all three questions?”</p><br/><p>Xiyan was smiling so widely that her eyes had turned to crescents. “Indeed they have, Third Young Madam! Right after they found him, Manager Qin sent someone over to the estate to report it. He said that that person’s currently eating in one of Guilin Restaurant’s private rooms together with an elderly man.”</p><br/><p>Chu Lian hurriedly got up, not even caring that one of the embroidered shoes on her feet had dropped off. She ran to her closet with one foot clad in only silken socks. “Quick, help me change! Tell Wenlan to prepare the carriage in the outer court first. I have to go to Guilin Restaurant right now! Oh, right, get Senior Servant Zhong to bring out one of the jars of grape wine I brewed recently. And, and don’t forget to send someone to notify Grandmother that I’m going out!”</p><br/><p>Chu Lian was completely flustered. That person was Great Doctor Miao! She had actually found him!</p><br/>\n</div>"}