{"title": "Chapter 271: War at the Northern Border (2)", "id": 271, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-271-war-at-the-northern-border-2", "volume_title": "Volume 3", "body": "<h1>Chapter 271: War at the Northern Border (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Great Doctor Miao had been invited to stay longer in the Jing’an Estate, and his daily meals were now the responsibility of the kitchen in Chu Lian’s courtyard.</p><br/><p>Great Doctor Miao was an amiable guest as long as he had some delicious food before him, so he settled in rather peacefully.</p><br/><p>Three days later, House Ying sent Matriarch He an invite for Xiao Bojian’s thank-you banquet for his mentor.</p><br/><p>They specially invited both the matriarch and Honoured Lady Jinyi.</p><br/><p>As Matriarch He held the invitation in her hands and wondered how she should reply, Chu Lian’s father, Chu Qizheng, had also sent an invite over. It was delivered straight to Chu Lian.</p><br/><p>Chu Lian didn’t know that Matriarch He had been invited as well. Her brows furrowed when she received the invitation from her father.</p><br/><p>Xiao Bojian seemed to have anticipated her reluctance to attend the banquet and had purposely gotten her father to send her an invite.</p><br/><p>What was he trying to do?!</p><br/><p>Chu Lian’s mood remained agitated until late afternoon, when she brought the invite to Qingxi Hall to discuss the matter with Matriarch He.</p><br/><p>Just as grandmother and granddaughter had settled down in the parlour of Qingxi Hall, they could hear some noise coming from outside.</p><br/><p>Matriarch He hadn’t been in a good mood in the first place. When she heard the disturbance, her expression turned grave. “Muxiang, go outside and find out what’s going on.”</p><br/><p>In a short moment, Muxiang returned.</p><br/><p>Her face was full of anxiety as she ran back in without minding her usual etiquette. She hurriedly reported, “Matriarch, the person causing the disturbance outside is a guard from Prince Jin’s Estate. He said that there’s something urgent to report to Matriarch. This servant accidentally overheard a part of it- war has broken out at the northern border!”</p><br/><p>“What?!” Matriarch He abruptly stood up in shock.</p><br/><p>Chu Lian’s almond-shaped eyes had also widened in surprise. However, she had already been mentally prepared for this piece of news, so her reaction was much calmer than Matriarch He’s.</p><br/><p>The news was too much for Matriarch He. Her body wavered before she completely lost her strength and almost fell forward. Luckily, Chu Lian spotted this in time and quickly caught hold of Matriarch He. The maidservants nearby also hurriedly stepped forward to support the matriarch.</p><br/><p>“Grandmother! Are you alright? Are you feeling unwell anywhere?”</p><br/><p>Matriarch He leaned on Chu Lian’s shoulder as she massaged the bridge of her nose.</p><br/><p>After a long moment, she seemed to have finally recovered some of her spirit. She slowly opened her eyes. “I’m alright now. Quick, let the messenger in!”</p><br/><p>Muxiang rushed out to call the messenger.</p><br/><p>Chu Lian helped Matriarch He to her seat once again. Scared for the matriarch’s health, she told Wenlan to request Great Doctor Miao’s presence.</p><br/><p>The worn-looking man was escorted in by the main steward of the outer court. It was only after the messenger showed his token that Matriarch He finally believed that this man was from Prince Jin’s Estate.</p><br/><p>“Tell me, what’s happening at the northern border?” Matriarch He’s voice was hoarse and carried a heavy sense of fatigue.</p><br/><p>The messenger bowed before he started his report. “The Tuhun army has gathered outside Liangzhou. The northern border troops have already skirmished with them a few times. Great General Qian is currently leading the northern border troops and doing his best to defend against the Tuhuns. However, the weather is getting worse over there and Liangzhou City is seeing heavy snowfall. The only worry is that the heavy snow might close up the mountain pass and block the supply line…”</p><br/><p>When two armies are at war, their biggest worry is running out of supplies. The Tuhuns had bided their time for over a decade. It was likely that they had already sussed out the supply times of the northern border troops and had specially chosen this period to mount a surprise attack…</p><br/><p>Matriarch He and Chu Lian both gasped upon hearing this news.</p><br/><p>Once their supplies ran out, the whole army would likely starve to death before the Tuhuns took action. This wasn’t a warm spring day they were facing; the winter over there could even kill the hardy, frost-resistant yaks.</p><br/><p>Matriarch He felt her body turn to jelly. She turned an affectionate yet pitiful gaze upon the young granddaughter-in-law next to her. The words she wanted to say refused to come out of her throat.</p><br/><p>After a short moment, Matriarch He seemed to have rediscovered her voice. “Alright, I’ve received your report. You can go back now. If there’s any news, please ask Prince Jin to inform us.”</p><br/><p>The guard who had played messenger bowed once again before quickly departing.</p><br/><p>The atmosphere inside the parlour was heavy.</p><br/><p>It was only after a long period of time had passed that Matriarch He finally spoke up again. “Lian’er, it’s been hard on you!”</p><br/><p>Chu Lian paused for a moment in surprise before reaching out to grasp Matriarch He’s wrinkled hand. She shook her head gently and said, “Grandmother, please don’t say that. When Husband went off to the northern border, no one could have expected those Tuhuns to start acting again after so many years of peace. As the saying goes, danger opens the door of opportunity. Maybe this Tuhun attack might be a good chance for Husband. It’s useless for us to keep worrying here in the estate. Why don’t we invite Eldest Brother here to discuss this matter? Eldest Brother has many connections, so he might be able to look for more news.”</p><br/><p>Matriarch He was getting old after all. Even though she was still wise, her mind wasn’t as quick as it had been. Upon hearing Chu Lian’s reminder, it was like a light went off in her head. She quickly ordered someone to summon He Dalang back to the estate.</p><br/><p>He Changqi’s many connections did come to use. He quickly gathered some news using various channels.</p><br/><p>War had indeed broken out at the northern border. Furthermore, it was snowing heavily in Liangzhou City now. Although the court wanted to send in relief, they were held up by the snows at the foot of the Qin Mountains. The reinforcements and supplies weren’t able to pass.</p><br/><p>The alternate path was to go through Chongzhou Prefecture and go down the Li River to reach Su City. Beyond Su City was Lake Qianshan. However, by this time, the lake had already frozen over and they couldn’t sail across at all.</p><br/><p>With all the roads to the northern border closed, the officials at court were at a loss for what to do! They could only watch the situation get increasingly worse.</p><br/><p>Right at this time, the news of a major case of embezzlement in the neighbouring city of Zhangzhou spread throughout the capital. As part of the Dragon Guards, He Erlang was assisting with the case, so he probably wouldn’t be able to return for another month.</p><br/><p>Prince Jin sent news about Liangzhou every day. Meanwhile, Matriarch He was looking more and more frail as the days passed. Countess Jing’an, whose health had just taken a turn for the better, inadvertently overheard the servants talking about the war in Liangzhou and immediately fainted right over, becoming bedridden once more.</p><br/><p>This winter, the whole of House Jing’an seemed to be on the verge of collapse, as if it would just vanish to the whims of time on the next tick of a second.</p><br/>\n</div>"}