{"title": "Chapter 278: The Passing of A Woman (1)", "id": 278, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-278-the-passing-of-a-woman-1", "volume_title": "Volume 3", "body": "<h1>Chapter 278: The Passing of A Woman (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>That stubborn and loyal Xiyan had still ended up with a better fate than hers, heh!</p><br/><p>Mingyan felt like she was immersed in the middle of an ice-covered lake. Although there was still a tiny bit of warmth left in her chest, it felt like a flickering candle flame, slowly shrinking and fading away.</p><br/><p>She leaned against the cold wall behind her, the memories from the Zheng Estate swirling in her mind.</p><br/><p>Old Duke Zheng’s visits to Guilin Restaurant had become more and more frequent. A month after Guilin Restaurant had opened, the old duke was having all his meals at the restaurant apart from breakfast.</p><br/><p>Chu Lian had specially reserved a small court in Guilin Restaurant for Old Duke Zheng. As long as he went over there at meal times, he didn’t need to queue at all and he would be able to eat any of the dishes in Guilin Restaurant.</p><br/><p>Ever so slowly, Old Duke Zheng started to feel that Mingyan’s dishes weren’t as appetising as before.</p><br/><p>One day, after Old Duke Zheng had come back to the estate, Old Duchess Zheng asked her husband what he would like to eat at night. Old Duke Zheng had just casually replied with ‘Top Grade Hotpot’. He had eaten that dish at Guilin Restaurant in the afternoon and it was one of the restaurant’s new dishes for the month. He had only eaten it once before, so he hadn’t had enough; the answer he gave his wife came entirely from his subconscious.</p><br/><p>The old cooks in the Zheng Estate were pretty much useless by now. It was mostly Mingyan who was in charge of Old Duke Zheng’s kitchen. Since Old Duke Zheng had made a request, the responsibility of actually making the dish fell onto Mingyan’s shoulders.</p><br/><p>Due to the fact that she would chase everyone out whenever she cooked in the kitchen, the servants in the kitchen were already biased against her.</p><br/><p>After Old Duke Zheng had requested this completely foreign dish, no one was willing to speak up for her.</p><br/><p>Mingyan was almost dancing on the spot from her anxiety. She didn’t know how to make this ‘Top Grade Hotpot’ at all!</p><br/><p>Back then, she had started hating Chu Lian. Why hadn’t Chu Lian taught her a few more secret recipes? If she had, then she wouldn’t be in this desperate state right now.</p><br/><p>Of course, she wasn’t able to make the ‘Top Grade Hotpot’. Mingyan was summoned by Old Duchess Zheng and suffered a harsh scolding.</p><br/><p>It wasn’t until she was kneeling before the old duchess that Mingyan finally realised she was at the end of her path.</p><br/><p>Thus, she started thinking up a scheme for her own survival.</p><br/><p>Heir Zheng would come over to Old Duke Zheng’s courtyard every morning for breakfast. She used that chance to slip some drugs into his food. However, before Heir Zheng had even touched the drug-laced food, a maidservant had already reported Mingyan’s actions to the younger Duchess Zheng.</p><br/><p>The Zheng Estate only had this one heir, so he was absolutely precious to them. Duchess Zheng kept watch over him tightly. When she found out that her son had almost been drugged by a maidservant, she exploded.</p><br/><p>Thus, Duchess Zheng personally took over the punishment and had Mingyan beaten until she was half-dead. After that, she ordered the servants to buy some drugs that could make her hands lame so she would never cook again.</p><br/><p>There was no shortage of skeletons in the closet behind the tall walls of the inner court. While the matriarchs of noble families were elegant and poised on the outside, their hands were likely stained with the blood of countless people.</p><br/><p>Duchess Zheng was not a soft-hearted matriarch. Furthermore, Mingyan was just a servant. As favoured as she was, she was still just a servant who could cook a little. In the eyes of most masters, she was no different than a dog.</p><br/><p>While Mingyan was being punished, Old Duke Zheng didn’t even try to plead for mercy for her. In the end, Mingyan used all her savings to bribe the maidservant guarding the entrance so she could escape from the Zheng Estate.</p><br/><p>The first person she had thought to seek help from was Chu Lian.</p><br/><p>Unfortunately, she was never going to be able to meet her again.</p><br/><p>As the last vestiges of warmth faded from Mingyan’s heart, the soft glow of the afternoon sun shone upon her head.</p><br/><p>The next day, Xiyan led a few maidservants out from the side entrance on an errand to Guilin Restaurant. The moment she stepped out, she noticed the broken body lying in a corner outside the estate.</p><br/><p>The menial servant guarding the door noticed Xiyan’s frown and quickly tried smiling in a placating manner. “Miss Xiyan, that’s just a lunatic! She kept fussing and trying to enter the estate yesterday, claiming that she’s one of Third Young Madam’s handmaids. In the end, the guards at the entrance beat her up and threw her out. She crawled into that corner herself. Maybe she’s already lost the little bit of life left in her!” </p><br/><p>Handmaid?</p><br/><p>A bad premonition surfaced in Xiyan’s heart.</p><br/><p>She quickly ordered for two manservants to come. By the time they checked the body, the woman was no longer breathing. When the manservant pulled aside the messy hair covering the woman’s face, Xiyan sucked in a gasp of cold air. It really was Mingyan!</p><br/><p>Standing before a sister who had served together with her in the past, Xiyan’s heart was filled with mixed emotions. She stood in silence for a long moment until the manservant next to her carefully asked, “Miss Xiyan, what… what should we do?”</p><br/><p>Xiyan took in a deep breath and suppressed the burgeoning emotions threatening to burst out of her. She took out a silver ingot from her sleeve and passed it to the manservant. “Buy a coffin and bury her!”</p><br/><p>Mingyan had been part of the dowry when Chu Lian had married into the Jing’an Estate. Before that, she had just been a newly bought servant who had no parents or relatives.</p><br/><p>Xiyan cast one last look at that cold, stiff body before leading her party away without another look back.</p><br/><p>Mingyan had chosen her own path. The only person she could blame for her end was herself.</p><br/>\n</div>"}