{"title": "Chapter 276: Retribution (1)", "id": 276, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-276-retribution-1", "volume_title": "Volume 3", "body": "<h1>Chapter 276: Retribution (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>To travel from the capital to the northern border, most common folk and merchants would choose to use the government-built highway. The highway passed through many important towns and cities and it was very convenient for doing business or taking a break on the road.</p><br/><p>However, because Chu Lian and her party were rushing to the northern border, they couldn’t take any detours on the road. Furthermore, they were travelling light. Other than the few carriages of cotton clothes and blankets, they didn’t have to take any heavy loads into consideration.</p><br/><p>Thus, after Matriarch He and He Changqi had a discussion with the private soldiers serving their family, they chose a small road that led to Liangzhou.</p><br/><p>The small road cut straight into the hinterland of the northern border from the outskirts of the capital. There weren’t any small villages they could rest in along the way, and there might even be stretches of days where there wouldn’t be any water sources nearby. For the most part, they would be travelling through mountain forests, but that meant they would have to have enough supplies or some skilled hunters as part of their entourage. Otherwise, it would be hard to reach the northern border.</p><br/><p>However, they could save a lot of time travelling on a small road like this as long as they had a good horse under them. It would only take around ten to twenty days to reach Liangzhou from the capital, and it would cut their travel time by two-thirds as compared to the highway.</p><br/><p>As the day of her departure grew closer and closer, Chu Lian didn’t dare to waste a single second of her time. She continued waking up before the sun was up to practise. She was now extremely familiar with the few moves that Wenqing and Wenlan had taught her for self-defence.</p><br/><p>She also went over to Great Doctor Miao’s to ask for some preventives and also for medicines that could cure the most common wounds.</p><br/><p>Great Doctor Miao was very generous towards Chu Lian and packed up a bundle for her that included a bottle each of poison antidotes, bug repellent, and even frostbite and burn salves.</p><br/><p>Chu Lian also passed Manager Qin a list of things and had him prepare everything on the list for her.</p><br/><p>The day before departure, two guards came from Prince Wei’s Estate, saying that they were sent by Princess Wei to protect Chu Lian’s safety on the trip.</p><br/><p>The guards were a pair of siblings: an older brother and a younger sister. The man was called Li Xing while the woman was called Li Yue.</p><br/><p>The two siblings looked similar, both dressed in a guard’s uniform from the Prince’s Estate with their heads lowered respectfully. It was the first time Chu Lian had met them, so she didn’t know what their personalities were like.</p><br/><p>Since Princess Wei had sent them specially for her, Chu Lian couldn’t reject them. She told Xiyan to bring the two guards to a room so they could rest.</p><br/><p>When it was finally the day of departure, Chu Lian had already finished packing all of her luggage. Prince Jin sent a small team of men and horses, about twenty people in all. The leader was a young man called Tang Yan.</p><br/><p>Tang Yan had already seen Chu Lian before, but this was the first time that Chu Lian had seen him.</p><br/><p>Tang Yan walked up to Chu Lian. When he saw the things piled up inside the carriage, his jaw almost dropped from shock…</p><br/><p>He first bowed towards Chu Lian and gave a simple self-introduction before gaping as he asked, “Is… is this all of Honoured Lady’s luggage?”</p><br/><p>Chu Lian nodded while standing next to the carriage, a calm expression on her face. “It is! Is there any problem, Sir Tang?”</p><br/><p>Tang Yan opened his mouth as if wanting to speak. In the end, he couldn’t resist giving her a reminder. “Actually, Honoured Lady, you don’t have to bring so many things. Your estate has already informed His Highness that we’re going to be using a small road, so this subordinate has already ordered the men to prepare enough food and supplies. We’ve also brought a doctor and a cook along.”</p><br/><p>Chu Lian looked at him and then tilted her head. “Then could Sir Tang tell us how many carriages of goods we’re bringing on this trip?”</p><br/><p>“At least nine to ten.”</p><br/><p>Chu Lian nodded, “Since that’s so, it won’t be much to bring along one more carriage! Furthermore, these are just some day-to-day items that I’m used to using. They’re just a few items, not worth a mention.”</p><br/><p>Tang Yan didn’t know how to reply to this statement. He cast a glance at the full carriage next to her. Wasn’t that a small metal pot sticking out from the corner?!</p><br/><p>He sweated and inwardly complained, ‘How is that not worth a mention? She’s even brought pots and pans along… This is going to be a harsh journey with very little food. Is she going to cook up some delicacies with that pot?’</p><br/><p>When Chu Lian was about to leave, everyone in the estate except the grounded Madam Zou and the bedridden Countess Jing’an came out to send her off.</p><br/><p>For this trip to the north, Chu Lian was going to bring Wenqing and Wenlan with her, as well as Manager Qin. The other people in the party were all arranged by Matriarch He. She heard that Matriarch He had also sent two secret bodyguards. However, they were to remain hidden and wouldn’t appear except when needed.</p><br/><p>Other than that, there were also the two guards that Princess Wei had sent, Li Xing and Li Yue.</p><br/><p>In front of the estate’s entrance, He Dalang was talking to Tang Yan while Matriarch He took Chu Lian’s hands in hers, unwilling to part.</p><br/><p>“Lian’er, it’ll be hard on you for this trip to the north. You must take care of your own safety first and foremost.”</p><br/><p>“Grandmother, don’t worry. I can take care of myself. I’m also bringing Wenqing and Wenlan! It’s Grandmother who should take better care of your health. When Granddaughter-in-Law returns home with Husband, I want to see a bright and healthy Grandmother!”</p><br/><p>Matriarch He nodded, her eyes slightly moist. She patted Chu Lian’s hand and tucked away some stray strands of hair for her before urging her to get onto the carriage.</p><br/>\n</div>"}