{"title": "Chapter 281: Rabbit Hotpot (2)", "id": 281, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-281-rabbit-hotpot-2", "volume_title": "Volume 3", "body": "<h1>Chapter 281: Rabbit Hotpot (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian was protective and generous towards her own people. Whatever she ate each day was exactly what Wenqing and Wenlan could eat each day.</p><br/><p>Thus, Chu Lian, Wenqing, Wenlan, Manager Qin, Li Xing and Li Yue would prepare their own meal together every night. As for the rest, House Jing’an’s private soldiers were grouped together under Mo Chenggui’s lead while Tang Yan and Prince Jin’s guards shared their meal.</p><br/><p>The rabbits that Li Xing had hunted today were big and fat, so Chu Lian told Wenqing to take some to Mo Chenggui and Tang Yan.</p><br/><p>After eating the warm rabbit hotpot, Chu Lian had already entered her tent to rest under the care of Wenlan and Li Yue.</p><br/><p>Wenqing reached Mo Chenggui and Tang Yan’s tent with a box of food in hand.</p><br/><p>When she entered the tent, she saw that Mo Chenggui and Tang Yan seemed to be in the middle of discussing something. The two men stopped talking after she entered, and they seemed to be in equally bad moods. It was clear that their discussion wasn’t going well.</p><br/><p>However, that wasn’t any of Wenqing’s business. She bobbed in greeting to them before saying, “Third Young Madam has specially sent this servant with some food after seeing how Sirs have worked so hard all day.”</p><br/><p>Mo Chenggui cast a disdainful glance at Wenlan without bothering to reply her. Contempt filled his heart. What did that Third Young Madam know how to do besides enjoying life all day?</p><br/><p>What a burden!</p><br/><p>If they didn’t need to use her name as an excuse to go to the northern border, he wouldn’t have agreed to let such a spoiled young madam join their journey!</p><br/><p>Tang Yan was more smooth and slick. When he saw that Mo Chenggui had simply remained silent with a dark expression and that the air was turning awkward, he quickly spoke up. “Miss Wenqing, please put down the food here. It’s getting late, so please thank Honoured Lady for us when you return.”</p><br/><p>Wenqing wasn’t stupid. She could see how dissatisfied Mo Chenggui and Tang Yan were towards her master. Thus, she dropped all sense of decorum towards them and set the food down. Without another word, Wenqing turned to leave the tent as if she couldn’t bear to stay in their presence for even a second more.</p><br/><p>After Wenqing disappeared from their sight, Mo Chenggui harrumphed. “This subordinate is too lowly to enjoy the rewards that Third Young Madam has bestowed. Brother Tang, this lowly one will leave it to you!”</p><br/><p>After saying so, he tossed his sleeves and left.</p><br/><p>Tang Yan watched Mo Chenggui’s tall, burly back disappear before shifting his gaze to the box of food that Wenqing had left behind. Although he didn’t show it on his face, his heart was filled with unhappiness.</p><br/><p>How could Honoured Lady Jinyi only be thinking of food at a time like this?</p><br/><p>He coughed to clear his painfully dry throat and shook his head. She was still too young after all. She had probably saved Prince Jin and Royal Princess Duanjia out of luck back then in Defeng Teahouse.</p><br/><p>Tang Yan waved his hand towards the two guards standing behind him and said, “I’ll leave Honoured Lady’s rewards to you guys. Don’t waste it!”</p><br/><p>The two guards had similar expressions of excitement and happiness as their eyes widened. They almost failed to hold back their drool.</p><br/><p>They had just switched shifts with the guards in the tent. Previously, they had been standing not too far from where Honoured Lady was cooking. When the wind had blown past, it had carried an absolutely delicious smell along with it. The guards were well-accustomed to eating dry wheat pancakes while out on duty, but after smelling that aroma, the dried rations in their hands seemed hard to swallow compared to that rabbit meat.</p><br/><p>However, the guards were very disciplined. There was a huge difference in status between them and Honoured Lady Jinyi, so they would never dare to try and ask for food from her. Thus, their only option was to bear with the tantalising scent of the hotpot and stuff their dry rations into their mouths, forcing it down even as they almost choked on it.</p><br/><p>But now? Sir Tang was actually bestowing Honoured Lady’s food upon them! Who could have expected such a miraculous gift would fall right into their laps?</p><br/><p>The two guards immediately shouted their thanks and started discussing whether they should eat it in Sir Tang’s tent, so that they wouldn’t get robbed of their delicious food by the pack of ‘hungry ghosts’ outside.</p><br/><p>One of the guards turned to Tang Yan with a bright smile. “Sir, we’re on duty now so it’s not convenient for us to leave the tent. Sir, please grant us permission to eat here!”</p><br/><p>Tang Yan glared at the two guards. “Don’t think that I can’t tell what you’re trying to do. Fine, just eat here then. Send the box back to Honoured Lady when you’re done. Remember, don’t let her know that you gluttons were the ones who ate it.”</p><br/><p>“Yes, yes, yes. Many thanks to Sir for granting us this boon!”</p><br/><p>The two men immediately took the box of food and set it on a short table in the corner.</p><br/><p>Upon opening it, the two guards’ eyes alighted with joy. They both took in a deep breath.</p><br/><p>It was this exact aroma! This was what Honoured Lady’s servants had made today!</p><br/><p>He had heard Brother Li Xing say that this was called ‘rabbit hotpot’, and that it was delicious!</p><br/><p>The two guards couldn’t stay still any longer. They grabbed their chopsticks and quickly began gulping down the food.</p><br/><p>Tang Yan had gotten a cold sometime during the past two days. Luckily, it wasn’t too severe. He just lost his sense of taste and had his nose blocked some of the time. Due to his sickness, he hadn’t had much appetite recently. He would just drink a bowl or two of gruel to fill up his stomach.</p><br/><p>However… As the spicy, fragrant smell of rabbit hotpot filled the tent and invaded his nostrils, Tang Yan’s nose twitched.</p><br/><p>He turned towards that smell and sniffed the air again before realising that it was coming from the table where the two guards were eating.</p><br/><p>When he looked at how the two guards had practically buried their faces into their bowls, Tang Yan couldn’t resist gulping.</p><br/><p>What kind of dish was that? It was a deep red, and some sort of heavenly smell was drifting up from it… It looked really tasty…</p><br/>\n</div>"}