{"title": "Chapter 285: Beardy (1)", "id": 285, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-285-beardy-1", "volume_title": "Volume 3", "body": "<h1>Chapter 285: Beardy (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 285: Beardy (1)</p><br/><p>He Sanlang’s heart shook. He could no longer care about the escaping Tuhun, instead turning his gaze in Chu Lian’s direction.</p><br/><p>His heart almost jumped out of his chest as he processed the sight that met his eyes.</p><br/><p>Under the faint, bleak moonlight, he could see that there was an endless cliff in front of Chu Lian!</p><br/><p>Chu Lian was about to cry. What was going on with her luck today?</p><br/><p>Just now, Chu Lian had put her full concentration on hugging the horse’s neck and sticking onto its back without moving. She was so scared that she just shut her eyes tightly. When she actually heard some fighting and screams behind her, she wanted to open her eyes and turn around to look, but she wasn’t able to!</p><br/><p>Even though she knew that help had come, the horse under her was still locked in its mindless craze. It charged towards the chasm in front without pause. Perhaps due to the stab she had given it earlier, the horse wasn’t listening to any commands now.</p><br/><p>When she saw that the chasm was just mere metres ahead of her by now, Chu Lian chose to scream as loud as she could, hoping that the rescuer behind her who had stopped the Tuhuns would find her and help her stop the horse.</p><br/><p>He Changdi’s expression was as dark as it could get. He ground his molars together and whipped his horse yet again, urging it towards Chu Lian’s direction. However, as fast as his horse was, it was already too late to pull back the mad horse rushing over the cliff.</p><br/><p>He Sanlang gripped the reins and pushed himself up to stand on the horse’s back nimbly. He and Chu Lian were just two metres apart by now.</p><br/><p>He Changdi used all the strength he could summon from his body and jumped towards Chu Lian with his arms open.</p><br/><p>A sudden force from behind pushed Chu Lian off the horse, and she landed in a strong and muscled embrace.</p><br/><p>Even though Chu Lian was still out of her wits in fear, when those arms appeared out of nowhere and hugged her, her wildly beating heart seemed to calm down.</p><br/><p>Although the two of them had managed to avoid the mad horse, the force He Sanlang had used to push Chu Lian off still caused them to tumble down the steep hillside that looked like a chasm.</p><br/><p>A pair of strong arms held her tight, and one of the man’s large hands pressed her head against his chest to act as a cushion at the same time.</p><br/><p>While in the man’s embrace, Chu Lian felt her body getting jolted about before there was a dizzying sense of falling.</p><br/><p>Everything happened so fast that Chu Lian didn’t even have the time to think about anything. She heard a few grunts of pain from the man above her and all she knew was that they had tumbled down the steep hillside.</p><br/><p>When they finally came to a stop, both of them lost consciousness…</p><br/><p>A piercing ray of sunlight filtered through the dense canopy of the forest, causing Chu Lian to wake up.</p><br/><p>The moment she opened her eyes, she felt sore all over. Chu Lian tried to move her arms, but she quickly realised that she was being held in someone’s embrace. The strong arms around her clearly belonged to a man, and one of them was even wrapped around her waist. This pose of his seemed distinctly possessive.</p><br/><p>Chu Lian stiffened as last night’s memories came rushing into her mind like a flood.</p><br/><p>The ambush, the pursuit, the Tuhuns, and finally, her rescue!</p><br/><p>She shifted her body, causing her to bare her teeth in reaction. She could feel that she wasn’t severely injured anywhere, even though there was some soreness and a few pricks of pain from some minor scratches.</p><br/><p>Chu Lian reached out and tried to push away the man’s arm, but no matter how she tried pushing and pulling, his arm didn’t budge. It remained tightly fixed around her waist.</p><br/><p>Chu Lian had no other choice but to wiggle as far away from the man as she could and put some distance between them. Then, she sat up, still ensconced in his embrace.</p><br/><p>She could finally see what her saviour looked like.</p><br/><p>When she noticed the giant beard covering half of the man’s face, Chu Lian was flooded with shock!</p><br/><p>She continued staring at his bearded face for half a minute before recovering her wits.</p><br/>\n</div>"}