{"title": "Chapter 294: Don’t Move (2)", "id": 294, "volume": 3, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-294-don%E2%80%99t-move-2", "volume_title": "Volume 3", "body": "<h1>Chapter 294: Don’t Move (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian had already been feeling both ashamed and aggrieved at the same time, a mix of feelings that made her feel like she might implode at any moment. Without her noticing, even her ears had flushed red with embarrassment. However, when she heard his mocking reprimand, she just couldn’t muster up any energy to retort.</p><br/><p>That… It’s not like she wanted to step on this trap… It’s not her fault… Okay…</p><br/><p>Dejected, Chu Lian defended herself… in her mind.</p><br/><p>In actual fact, her external appearance and internal thoughts were completely opposite.</p><br/><p>Her head was lowered, her long eyelashes trembling as they covered her eyes like little fans. She looked extremely pitiful, like she was afraid of getting scolded.</p><br/><p>However, He Sanlang’s determination to reprimand her hadn’t decreased one bit despite the guilt and self-blame she was demonstrating.</p><br/><p>He harrumphed inwardly. This wicked woman was too used to acting pitiful.</p><br/><p>Chu Lian snatched the hem of her skirt from his hands and covered up her legs.</p><br/><p>“You… How could you do that!”</p><br/><p>He Changdi’s gloom and doom hadn’t dissipated at all. His voice turned harder and colder as he disregarded Chu Lian’s retort and warned, “Move your hands away!”</p><br/><p>A fire had been stoked in Chu Lian’s heart thanks to this man’s icy, forceful attitude. Her cheeks puffed up and she met his eyes directly in a spurt of courage. “Mister, men and women should keep their distance! I can do it myself.”</p><br/><p>After saying so, Chu Lian pulled down her skirt tightly before glaring up at the bearded man, her eyes full of stubborn determination.</p><br/><p>He Sanlang was instantly filled with anger.</p><br/><p>Heh! Men and women should keep their distance!</p><br/><p>She was trying to use that silly rule on her own husband!</p><br/><p>Very well!</p><br/><p>Then he was going to see how capable this wicked woman was today!</p><br/><p>He Changdi released her ankle and stood up. He walked off to one side and even turned his back towards her a little, as if just the distance wasn’t enough- he also had to avert his gaze.</p><br/><p>Without that beardy staring at her, Chu Lian was much more relaxed since she no longer felt so on edge. She sneaked a peek in the beardy’s direction, only to see that his tall back was ramrod straight. After making sure that he really wasn’t looking this way anymore, she reached out to pull aside the cloth covering her trapped ankle.</p><br/><p>Just that slight movement of her body pained her enough that she sucked in her breath.</p><br/><p>Her attention had been drawn away by that beardy earlier. It was only now when she looked at her wound that the pain returned with double or triple the force.</p><br/><p>She slowly shifted into a more comfortable position before she tried to pry the animal trap apart using her hands.</p><br/><p>However, she quickly realised that this animal trap wasn’t as easy to open as it first seemed to be. Since her ankle was trapped, she couldn’t really use all of her strength. Furthermore, the animal trap was clamped on too tightly. She tried a few more times, but the trap was unmovable. Conversely, she had become fatigued from her exertions and the pain she was suffering.</p><br/><p>She kept sucking in her breath due to the pain. Her gaze hesitantly turned to the bearded man not too far away. She wanted to ask for his help, but when she thought back to how she had refused his help earlier, she just couldn’t set down her pride to do so.</p><br/><p>Chu Lian scolded herself in her mind in her frustration.</p><br/><p>Although He Sanlang was standing to one side and pretending not to care, he had been watching Chu Lian from the corner of his eyes.</p><br/><p>He watched as that tiny yet stubborn figure gritted her teeth while trying to pry off the animal trap, her eyelashes already wet with tears from her struggles.</p><br/><p>Those little hands, reddened from the cold, were gripping the two sides of the animal trap so fiercely that her knuckles had turned white. However, that steel trap remained clamped onto her leg without budging. In the end, she weakly let go of the trap. Her leg was still caught in it, and all she had to show for her efforts was more blood seeping out from her wound.</p><br/><p>The knot in He Changdi’s heart tightened and he could no longer continue standing still. He berated himself for striking a compromise with her and forgetting his original purpose.</p><br/><p>He ignored all of the wicked woman’s protests and grabbed hold of Chu Lian’s hands with one of his arms. He stuck so close to her that he could feel her breath ghosting over his face. When he spoke, his slightly husky voice carried an undertone of restraint as he warned her and said, “Don’t move, or you’ll never use this leg of yours again!”</p><br/>\n</div>"}