{"title": "Chapter 303: The Beardy is He Sanlang (1)", "id": 303, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-303-the-beardy-is-he-sanlang-1", "volume_title": "Volume 4", "body": "<h1>Chapter 303: The Beardy is He Sanlang (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Just as the two men were bickering, the sound of footsteps came from the cave entrance.</p><br/><p>When Xiao Yuhong noticed that He Changdi’s eyes were turning grave, he quickly hit his own head as if he had just remembered something. “That’s right, Brother He, I forgot to tell you! Your family’s private soldiers came with us. That should be them arriving now.”</p><br/><p>Right after he finished speaking, a group of men entered the cave. In the lead was Mo Chenggui.</p><br/><p>Once Mo Chenggui caught sight of He Sanlang, he ran up to his young master excitedly. He stood in front of the other private soldiers and bowed to He Changdi. “Third Young Master, this old servant is relieved that you’re well.”</p><br/><p>Perhaps due to the difference in their status, there was no trace of the haughtiness and disdain that Mo Chenggui had shown in front of Chu Lian when he stood before He Changdi. These old soldiers who had followed Old Count Jing’an into battle were truly loyal and concerned for the male masters of the He Family.</p><br/><p>Standing behind the rest, just a few metres away, Chu Lian was immersed in shock.</p><br/><p>Her almond-shaped eyes were wide open while her slightly pink lips were parted. A single sentence resonated in her mind, ‘The beardy is He Sanlang!’</p><br/><p>How could that be!</p><br/><p>Her eyes unconsciously fixed on He Changdi. Her heart pounded quickly in her chest. She didn’t know whether it was due to the flurry of emotions that had risen, or due to the tension and nervousness within her heart…</p><br/><p>The moment she remembered all the stupid things she had done in front of He Sanlang while taking him for a stranger, she really wanted to just bury herself.</p><br/><p>As her thoughts ran wildly in her mind, she couldn’t hold back a glare at He Sanlang. That… that fellow had known all along and had actually teased her on purpose, just to watch her make a joke of herself. How… how utterly shameless!</p><br/><p>Chu Lian’s face flushed red as her chest heaved with every breath. However, she couldn’t reveal the truth in front of these people, so she could only bear with the frustration.</p><br/><p>He Changdi nodded and replied calmly, “I’m fine, but the war in Liangzhou continues. We have to return quickly.”</p><br/><p>Xiao Yuhong had also turned serious. He smiled and nodded at Chu Lian before leading the men out of the cave and ordering someone to bring He Changdi a horse.</p><br/><p>It was only then that He Sanlang turned to look at Chu Lian and noticed her frustrated expression.</p><br/><p>Chu Lian knew that she was the one at fault for being face blind and not recognising him, so she felt too embarrassed to be the one to speak first.</p><br/><p>When she met with his cold gaze, she shifted her eyes away guiltily. He Sanlang stood ramrod straight with his hands behind his back and continued staring at her until Chu Lian could feel goosebumps rising on her skin. Finally, he walked over to her slowly.</p><br/><p>“How impressive, my wife. You didn’t even manage to recognise your own husband? Then you should open your eyes a little more and take a good look. Otherwise, you might even take a stranger for your husband next time and put a green hat on my head!”</p><br/><p>After he finished saying all of this in an icy tone, he didn’t wait for Chu Lian’s fiery gaze to turn to him before sweeping her up into a princess carry and bringing her out of the cave.</p><br/><p>Chu Lian was extremely angry, but she couldn’t quarrel with her husband in front of so many people. It would be bad for both of their reputations.</p><br/><p>Thus, the most she could do was to glare at He Sanlang while in his embrace.</p><br/><p>Of course, He Changdi could feel the grudge and killer intent in Chu Lian’s eyes.</p><br/><p>He looked down coldly at Chu Lian, “If you like to look at me so much, I’ll let you have your fill when we get back to Liangzhou!”</p><br/><p>Chu Lian gritted her teeth and complained to herself inwardly. Who’s trying to look at him? It’s only that crazy He Sanlang who can say something like that without any expression on his face!</p><br/><p>When Xiao Yuhong saw that He Changdi was carrying Chu Lian out of the cave, a mischievious look lit up in his eyes. “Brother He, take good care of Sister-in-Law!” He pointed at a handsome horse nearby which was all black except for its white tail and hooves and explained, “Brother He, we found your horse for you, but it has quite a few wounds on its body. The wounds were probably made by those damned Tuhuns. You can’t ride on this horse for now, so you and Sister-in-Law can take my horse instead. I’ll ride with Zhao Liang.”</p><br/><p>He Sanlang looked at his beloved steed and nodded.</p><br/><p>Chu Lian turned her gaze curiously towards that handsome black horse. The horse seemed to be rather intelligent. When it noticed its owner, He Changdi, looking at it, it even whickered at He Sanlang and blinked its big eyes coquettishly.</p><br/><p>When Chu Lian’s eyes followed the curve of the horse’s smooth back, she noticed that there were some wounds on the horse’s rump and back which had already started to scab over. A small suspicion surfaced in her mind. If she didn’t guess wrongly, these wounds weren’t made by the Tuhuns- instead, they were likely made by He Changdi himself to drive his steed on when chasing after her mad horse…</p><br/><p>Thus, Chu Lian sent an apologetic look to the horse.</p><br/><p>He Sanlang personally helped Chu Lian onto Xiao Yuhong’s horse, before leaping up and sitting behind her. When Zhao Liang saw that the captain was only wearing his armour and that the cloak on the captain’s wife was dirtied, he took off his own cloak and passed it to He Sanlang.</p><br/><p>He Sanlang gave pause before receiving the cloak. He looked down at the fragile woman before him. He hesitated for a moment, but finally, he wrapped the dark coloured cloak around Chu Lian and made sure she was completely covered.</p><br/><p>When Chu Lian felt the warmth coming back to her body and noticed the thick cloak on her body, she was about to speak up to thank him. However, He Sanlang spoke first at a low volume, “You don’t have to thank me. I just don’t want you to catch a cold and become a burden for me!”</p><br/><p>That one sentence made the gratitude in Chu Lian’s heart vanish into thin air.</p><br/><p>Chu Lian decided to shut her mouth and stop bothering with that crazy husband of hers!</p><br/>\n</div>"}