{"title": "Chapter 316: Shaving His Beard (1)", "id": 316, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-316-shaving-his-beard-1", "volume_title": "Volume 4", "body": "<h1>Chapter 316: Shaving His Beard (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian felt that He Changdi’s mind was just too complicated for her to understand. She had just been asking if he wanted to take a bath, how had the topic switched to buying servants?</p><br/><p>She rolled her eyes speechlessly. However, Manager Qin had discussed this matter with her two days ago, too. When she recalled their conversation, Chu Lian nodded. She was going to stay in Liangzhou for an indefinite amount of time. Just having Wenqing and Wenlan by her side wasn’t enough.</p><br/><p>Thus, Chu Lian didn’t think much of it and agreed.</p><br/><p>“Have Manager Qin go out with some men to search for some suitable people tomorrow,” Chu Lian added.</p><br/><p>Perhaps Chu Lian’s quick agreement had helped lessen the frustrations in He Changdi’s heart. He sat in the room for a while before leaving to take a bath in the wing that Chu Lian had arranged for him.</p><br/><p>He Changdi didn’t need any attendants for bathing. In his past life, after the He Family had fallen into ruin, he had suffered through all sorts of hardships. Even in this life, while living in the northern border camp, he had gotten used to doing everything himself.</p><br/><p>He removed his dirty clothing, revealing his slender yet muscular upper body. His eight-pack abs were well-defined; a striking V-line at his hips pointed downwards to a bulge in the center. Further down were his long and powerful legs…</p><br/><p>His long legs carried him into the bathtub in just one stride. The temperature of the water was just right. As his tired body soaked in the warmth of the water, He Sanlang let out a comfortable sigh.</p><br/><p>He leaned against the side of the tub, his sturdy arms hanging over the edge. Steam rose in front of his face, softening the normally sharp impact of his gaze.</p><br/><p>He Sanlang’s thin lips pressed together as his mind brought up the image of Tang Yan and his guards again. For some reason, he was getting upset.</p><br/><p>At the time, the smile on that wicked woman’s face had been just too dazzling!</p><br/><p>The hands that He Changdi had slung over the edge of the bathtub were starting to tense up again.</p><br/><p>He suddenly shouted, “Servants! Bring me a razor!”</p><br/><p>This was the wing that Chu Lian lived in, and Chu Lian was in the room right next door. Even she heard He Changdi’s shout.</p><br/><p>She looked up from her book, a little puzzled, before turning to glance at Wenlan, who had just stood up.</p><br/><p>Wenlan covered up her smile. “Third Young Madam, this servant will bring the razor to Third Young Master!”</p><br/><p>Hearing so, Chu Lian waved her hand.</p><br/><p>Wenqing had been in the middle of taking inventory of their things, together with a few other servants. When she noticed a grinning Wenlan walking over to her, she found it strange and asked, “What are you smiling like that for? Did something good happen?”</p><br/><p>Wenlan waved the razor in her hands, eyes alight as she said, “Third Young Master wanted this!”</p><br/><p>Wenqing was stunned for a moment, but she immediately realised what the razor was for. She couldn’t resist remarking, “I saw that Sir Tang and Prince Jin’s guards all shaved this morning.”</p><br/><p>The sisters shared a secret smile before Wenqing pushed Wenlan. “Alright, alright, don’t keep Third Young Master waiting. Hurry up and send it to him!”</p><br/><p>Wenlan quickly left.</p><br/><p>As Chu Lian was staring at the county’s annual records and pondering over a particularly tricky part, a razor suddenly appeared in front of her.</p><br/><p>Without thinking too much about it, she said, “Wenlan, just send it directly to my husband.”</p><br/><p>However, how could Wenlan possibly dare to do so? She stayed steadfast at Chu Lian’s side and said, “Third Young Madam, it might be better if you send it instead. Third Young Master has never liked having maidservants serve him ever since childhood.”</p><br/><p>Chu Lian had no choice but to set down the county records in her hands. She thought back to her time in the Jing’an Estate. Actually, she really hadn’t seen a personal maidservant at Songtao Court before, excluding her own. He Sanlang’s personal grooming and other trivial chores had always been handled by manservants instead.</p><br/><p>Thus, she could only take the razor and head to He Sanlang’s room herself.</p><br/><p>The side room wasn’t very big. At this moment, steam was billowing up from behind the screen. Chu Lian hesitated as she walked up to it. She could feel a mysterious trace of tension in her heart. She gave her cheeks a light pat before walking in.</p><br/><p>When she ducked behind the screen, the first thing that Chu Lian saw in the swirling clouds of steam was He Sanlang standing in the bathtub with his back to her, rinsing his body with the warm water in the tub.</p><br/><p>His long, black hair was let loose across his back and half of it was drifting in the water like strands of seaweed. His back was muscled, yet his skin was white. The alluring line of his body that led up from the lowest part of his back to his waist was half-hidden amidst the length of his hair.</p><br/><p>She almost stopped breathing from the sight; disregarding everything else about him, He Changdi’s figure was perfect.</p><br/><p>He wasn’t so skinny that he looked weak, yet he wasn’t overly buff. You could sense a certain aura of solid strength emanating from his body.</p><br/><p>His nickname of He Sanlang the Fair wasn’t undeserved.</p><br/>\n</div>"}