{"title": "Chapter 313: Too Few Servants (1)", "id": 313, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-313-too-few-servants-1", "volume_title": "Volume 4", "body": "<h1>Chapter 313: Too Few Servants (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian usually didn’t eat much, so she quickly set down her bowl and chopsticks. However, He Changdi ate three whole bowls of porridge.</p><br/><p>After Tang Yan left, Wenqing ushered out all the other people from the room and even kindly shut the door on her way out, giving the couple some room.</p><br/><p>When Chu Lian saw that He Changdi had finally set down his chopsticks, she awkwardly tried to make conversation.</p><br/><p>“How’s your wounds?” As she said so, Chu Lian’s gaze darted towards He Changdi’s lower half.</p><br/><p>He Sanlang’s body froze and immediately realised what Chu Lian was asking. The back of his ears flushed red out of sight underneath his hair, even as his visible expression remained as cold and stiff as ever. When he parted his lips, it took him a moment before he was finally able to spit out, “What do you mean by that? I wasn’t wounded at all. The poison from last time has already been flushed out as well. You don’t have to worry about me.”</p><br/><p>After spending a few days together, Chu Lian had already figured out a little of He Changdi’s personality. When she heard his reply, the corners of her mouth twitched. This lunatic He Sanlang really preferred suffering to losing face. She had already gotten confirmation from Mo Chenggui that He Sanlang would definitely get smacks of the rod as punishment; there was no need for him to hide it from her.</p><br/><p>However, Chu Lian didn’t expose He Sanlang’s lies. She simply turned around and retrieved a thin white porcelain bottle, placing it in front of He Changdi. “This is some wound salve that I brought from the capital. Grandmother has used it before and says it’s even better than the medicines from the palace.”</p><br/><p>He Changdi could feel the burning in his ears spread down to his neck. He couldn’t meet Chu Lian’s eyes as he said, somewhat stiff, “My body’s just fine, what are giving me medicine for? Are you trying to curse me into getting injured?”</p><br/><p>Chu Lian was amazed yet again by He Changdi’s special brand of lunacy. She was clearly being nice and giving He Changdi some of the medicine that Great Doctor Miao had specially prepared for her. It was fine if he didn’t want it, but he even accused her of cursing him!</p><br/><p>Chu Lian’s expression turned dark. “If you don’t want it, then at least bring it back to camp and give it to one of your brothers there. There’ll surely be need of this kind of ointment in an army camp.”</p><br/><p>After hearing Chu Lian say so, He Changdi had nothing to retort. He took the bottle of ointment and stuffed it into his shirt. Although his expression remained as cool and calm as ever, a small trace of sweetness suffused throughout his heart.</p><br/><p>How could Chu Lian have expected He Sanlang to be such an awkward, outwardly cold yet inwardly passionate man? The guilt she had been carrying all this time finally dissipated after giving him the ointment.</p><br/><p>She turned their conversation back to business. “He Sanlang, my trip here was a little hurried, so I didn’t have the chance to explain everything to you beforehand. I personally made the trip to the northern border not just because our family is worried about you, but because there’s another important task at hand: to search for the missing ingredient to cure Mother’s illness.”</p><br/><p>He Changdi’s heart had been thumping a little harder before, thanks to Chu Lian’s actions. Now that he had heard the truth of the matter straight from Chu Lian’s mouth, his heart abruptly froze. As good as he was at concealing his emotions, this was a matter concerning his beloved parents. He couldn’t restrain the astonishment and shock he felt. Chu Lian just happened to catch sight of his exposed emotions and inwardly relaxed. So the He Changdi who had always appeared cool and uncaring wasn’t actually a heartless person. He also had people he cared about. With those emotions in his eyes, he finally seemed like a living person.</p><br/><p>He Sanlang met Chu Lian’s gaze straight on- he looked like he was trying to stare into her soul. He didn’t dare miss a single trace of emotion in her own pair of eyes, as if he could discern whether Chu Lian was telling the truth just by what he saw.</p><br/><p>Although He Changdi had only allowed his emotions to surface for a very short period of time, that was enough to show how uneasy he was. However, he calmed down quickly.</p><br/><p>“So what you’re saying is that… you’ve found a doctor who can cure Mother’s illness?”</p><br/><p>As far as he knew, there was only one doctor who could cure his mother’s illness: Great Doctor Miao. Had Prince Jin already found Great Doctor Miao?</p><br/><p>He had only told Prince Jin about this matter, no one else. Furthermore, due to the ongoing war in the north, he hadn’t received any letters from Prince Jin for some time… The depths of He Sanlang’s eyes seemed steeped in darkness as he glanced at Chu Lian in doubt.</p><br/>\n</div>"}