{"title": "Chapter 321: Barred from Entering Camp (2)", "id": 321, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-321-barred-from-entering-camp-2", "volume_title": "Volume 4", "body": "<h1>Chapter 321: Barred from Entering Camp (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It was dusk, the camp’s most chaotic time. As soldiers bustled about around them, Gao Zhangwei kept trying to start up a conversation with Sima Hui.</p><br/><p>Sima Hui’s lips were tightly pressed together, though her face remained calm. She would reply to Captain Gao once in a while. Suddenly, there was a hubbub of noise from somewhere in front. A foot soldier ran by, headed in the direction of the Right Wing Army’s tents. However, due to his urgency, he tripped in front of Sima Hui and Sima Hui quickly reached out to steady him.</p><br/><p>When the foot soldier saw that the person who had helped him was the newly arrived female general, he looked overwhelmed by her favour.</p><br/><p>Sima Hui’s brows knitted as she asked, “What happened? Why are you in such a rush?”</p><br/><p>When the foot soldier saw that the female general was questioning him, he didn’t dare to hide any details. “General, some men are trying to barge into the camp at the main entrance. This humble one is going to look for Captain Guo.”</p><br/><p>Sima Hui was astonished and she urged the soldier onwards. After thinking for a bit, she started striding towards the main entrance of the camp.</p><br/><p>Before Gao Zhangwei had the chance to speak, he saw that Sima Hui had already left. He gritted his teeth and quickly rushed to catch up to her.</p><br/><p>When they reached the entrance, Sima Hui swept a gaze over the scene before her. A tall man in a black cloak holding a handsome horse in hand was being blocked from entering the camp. He was standing right outside the barricades.</p><br/><p>His back was to the camp entrance. From behind, his upright posture brought to mind a tall and straight bamboo tree.</p><br/><p>One of the soldiers nearby recognised the female general and called out a greeting. Perhaps drawn by the shouts behind him, He Changdi turned around.</p><br/><p>When that handsome face entered Sima Hui’s sight, she forgot to breathe for a moment.</p><br/><p>Her eyes widened and her mind unconsciously sighed. How could there be such a handsome man on earth?</p><br/><p>His facial features seemed to have been carved by angels; there wasn’t a single blemish on his whole face.</p><br/><p>Gao Zhangwei was also stunned by the man’s looks. When he finally recovered his senses, his first reaction was jealousy.</p><br/><p>His fists clenched. Where had this man come from? There was absolutely no one like him in the whole entire camp!</p><br/><p>All those traits that he had thought were the best parts of himself… had been instantly beaten by this man.</p><br/><p>When he noticed that Sima Hui’s gaze carried a trace of infatuation as she stared at that man, Gao Zhangwei was quick to anger. “What are all of you standing around for? Don’t you know that the first military law is to kill all who trespass into an army camp?!”</p><br/><p>He Changdi’s gaze landed on Gao Zhangwei and then drifted away just as quickly, as if disgusted by the sight.</p><br/><p>Before He Changdi could speak, his subordinate’s temper had already flared up. “Captain Gao, don’t you dare push us too hard! Our commanding officer is Captain He of the Right Wing Army! Don’t make slanderous accusations without proof!”</p><br/><p>What! Captain He? That beardy He Changdi?</p><br/><p>What a joke! If this man was trying to impersonate He Changdi, he should have covered his whole face with a beard first!</p><br/><p>Gao Zhangwei didn’t believe them at all. He mocked them instead. “What? A pretty boy like this is trying to impersonate Captain He? If he’s Captain He, then I’m the Great General himself!”</p><br/><p>“You…”</p><br/><p>“Alright, stop fighting. We’ll know whether he’s Captain He or not once the men from the Right Wing Army arrive,” Sima Hui suddenly said.</p><br/><p>Her words carried some weight around here, so the men stopped quarrelling. In a moment, the soldier who had run off to the Right Wing Army returned with Captain Guo, Zhang Mai, and Xiao Hongyu in tow.</p><br/><p>Captain Guo stared at He Changdi as if he were a ghost. He quickly walked up to him and patted He Changdi’s shoulder forcefully. Then he asked, “Are you really Zixiang?”</p><br/><p>The corners of He Sanlang’s mouth twitched. He lowered his voice and said, “Brother Guo, you have some obscene drawings hidden under your pillow. There was this night when…”</p><br/><p>Captain Guo’s expression turned stiff. He quickly gripped He Sanlang’s shoulder and squeezed. “You brat! Why do you keep acting beyond your years? See, now that you shaved away that beard of yours, no one recognises you!”</p><br/><p>Xiao Hongyu ran closer and stood in front of He Sanlang, staring right into his eyes. “Wait, what the heck? It’s really Brother He! Why did you shave your beard?!”</p><br/><p>Zhang Mai couldn’t hold back his laughter as he watched He Changdi’s expression getting darker and darker.</p><br/><p>“Alright, alright. It was just a misunderstanding. This person really is Captain He. Move along, everybody. It’s almost time for dinner.” Zhang Mai showed his pass to the soldiers guarding the entrance.</p><br/><p>The foot soldier held up the pass with reverence and awe as he returned it with both hands. He even rubbed the back of his head sheepishly as he apologised to He Changdi.</p><br/><p>He Sanlang waved his hand. The soldier was just doing his job.</p><br/><p>As the band of brothers were about to leave, Sima Hui suddenly called out to them. “Excuse me, Captain He!”</p><br/><p>He Changdi turned slightly and bowed to Sima Hui. He asked in his usual low tone of voice, “Do you have any orders for me, General Sima?”</p><br/><p>Sima Hui’s face was flushed, but it wasn’t obvious under the fading light of day. However, her slightly rushed words betrayed how nervous she was.</p><br/><p>“May I ask if Captain He is the son of the border general at Mingzhou, Great General He?”</p><br/><p>He Changdi’s brows drew together. After a moment of hesitation, he nodded. Although his identity wasn’t well known here at the northern border, he didn’t intend to hide it. Captain Guo and the rest knew exactly who he was, so there was nothing he couldn’t admit to.</p><br/><p>“I’ve long admired Great General He. May I ask if Uncle and Aunt He are doing well? Is the matriarch still sound of health?” Sima Hui turned to He Changdi with eyes full of expectation, face slightly flushed with color.</p><br/><p>He Sanlang’s expression didn’t budge at all, but his tone turned frosty. “General Sima, I haven’t returned home in a long time, so I’m not too sure about the situation at home. I have some pressing matters at hand, so please excuse me.”</p><br/><p>After saying so, He Sanlang turned and left. Sima Hui watched in a daze as He Sanlang’s figure slowly disappeared into the falling night, her heart full of unvoiced disappointment.</p><br/>\n</div>"}