{"title": "Chapter 326: Rumours (5)", "id": 326, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-326-rumours-5", "volume_title": "Volume 4", "body": "<h1>Chapter 326: Rumours (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>What General Sima normally drinks?</p><br/><p>The quality of Zhengshan tea was only slightly lower than that of the imperial tribute teas. The amount of Zhengshan tea produced was even less than that of the North Fujian loose-leaf tea.</p><br/><p>Every year, before it was time for the spring harvest of tea, the nobles would fill up all the reservations for Zhengshan tea cakes. It wasn’t something that could be bought with money alone.</p><br/><p>Back then, Miss Yuan had tried to use some Zhengshan tea stolen from her grandfather to provoke Chu Lian.</p><br/><p>Chu Lian looked at the adjutant and almost burst out laughing. Were General Sima’s thoughts the same as this adjutant’s, or was it just this female adjutant who was stupid?</p><br/><p>Chu Lian had thought about declining the tea outright, but instead, she chose a more subtle route and hoped the female adjutant would get the message. Honestly, this kind of ploy was just too clumsy and silly. She had also seen it done before by Miss Yuan.</p><br/><p>However, before Chu Lian could speak, Wenlan could no longer hold back her desire to protect her master. “Excuse me, Madam. You might not know this, but our master doesn’t like to drink sencha because it tastes weird.”</p><br/><p>After getting such a reply, the female adjutant’s face flushed red and her lips started trembling.</p><br/><p>Chu Lian turned to look at Wenlan disapprovingly. Wenlan stopped talking.</p><br/><p>The female adjutant’s disrespect had been written all over her face. Chu Lian didn’t intend on admonishing her own maidservants in front of strangers. She turned back around, keeping her face warm and friendly as she kept her silence.</p><br/><p>After some time, the female adjutant finally got over the dissatisfaction in her heart.</p><br/><p>She took in a deep breath and forced a smile. “It was this subordinate’s fault for not checking about Honoured Lady Chu’s likes in advance.”</p><br/><p>Chu Lian replied with a courteous, “It’s fine.”</p><br/><p>The adjutant Xiaoyan wanted to continue saying something else, but before she could, a soldier announced from outside the tent that Great General Qian had sent an escort for Honoured Lady Jinyi, and they were to head to the commander’s tent immediately.</p><br/><p>Chu Lian stood up and led her party out of the warm tent.</p><br/><p>Xiaoyan sent them off at the entrance. As she stared at Chu Lian’s disappearing back, the smile on her face finally faded away and her long face contorted.</p><br/><p>The handmaid next to her complained in a low voice, “Hmph, that Honoured Lady Jinyi can’t even tell good from bad. She even dislikes sencha! This servant thinks that she probably hasn’t ever had sencha before and just doesn’t dare to admit it!”</p><br/><p>Xiaoyan’s lips curved up in a mocking smile. That was probably the case!</p><br/><p>She was just a poor noble from a declining house. How could she possibly compare to their female general?!</p><br/><p>The female adjutant Xiaoyan hadn’t lied on one point. Sima Hui did drink sencha often. Her favourite was Zhengshan tea. Although she wasn’t part of the main branch of the Sima Family, she had Old General Sima’s connections. While the current Sima Family had become rather short of male heirs, they still lived in luxury and had much better lives than most of the second-rate noble families in the capital.</p><br/><p>Otherwise, the handmaid Xiaoyan, who had been raised like an adopted daughter, wouldn’t have become so arrogant.</p><br/><p>Xiaoyan sneered. “Make sure you follow the orders I gave you last night.”</p><br/><p>“Yes, Sister Xiaoyan. This servant will go and make the preparations now.”</p><br/><p>General Qian personally escorted Chu Lian out of the commander’s tent. With the war at hand, he didn’t have much time to accompany Tang Yan and Chu Lian’s party. He had taken time to meet them personally out of respect for the Empress Dowager’s decree and the supplies they had brought.</p><br/><p>Due to the relationship between Captain Guo and He Changdi, once Chu Lian left the commander’s tent, General Qian handed them over to Captain Guo.</p><br/><p>It was already past 1pm by now. Since it was Chu Lian’s first time in the army camp and He Sanlang wasn’t around, Captain Guo took the initiative to invite Chu Lian, Tang Yan, and the rest to stay for lunch.</p><br/><p>Captain Guo smiled and said, “Sister-in-Law, although the meals in our camp are just some simple fare, it might be an interesting experience for you, just once in your life.”</p><br/><p>Chu Lian didn’t reject him. Since she had already come over to the border camp, she wanted to take a good look around; a chance like this didn’t come along every day.</p><br/><p>Tang Yan’s thoughts were along the same line as Chu Lian’s. However, the only difference was that he was a man, so it was much more convenient for him to move around in the army camp. In recent years, he had been working for Prince Jin so he hadn’t left the capital in quite a few years. He wanted to take this chance to observe how things were structured in the army, as well as their daily training and other general affairs.</p><br/>\n</div>"}