{"title": "Chapter 324: Rumours (3)", "id": 324, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-324-rumours-3", "volume_title": "Volume 4", "body": "<h1>Chapter 324: Rumours (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From afar, it looked as if the endless grasslands had melded into one.</p><br/><p>Tang Yan and Chu Lian were at a loss of what to do. They heard that it had also started snowing over at Tianjiang Harbour. If the snows continued like this, in just two days, the roads that led to Liangzhou, whether on land or by water, would be completely covered in ice and snow. By then, Liangzhou City would become an isolated city. Without any supplies, the Tuhuns probably didn’t even need to fight them; given three months, the northern border troops would simply starve to death without any external interference.</p><br/><p>Tang Yan had already sent some men out to Su City to check out the situation. They could no longer use the route traveling through the Yueqin Mountains, either. The snowstorm had already cut off all paths. Neither the supplies nor the reinforcements could pass.</p><br/><p>By the last day of November, Chu Lian’s injury was already mostly healed over. With the accompaniment of Tang Yan and the rest, she brought a small portion of supplies from the capital over to the northern border camp.</p><br/><p>She had already agreed on the time with He Sanlang, so Chu Lian set out early in the morning in her carriage.</p><br/><p>Chu Lian wasn’t going to the frontlines. She was just going to the camp of the reserve forces, so there wasn’t any danger.</p><br/><p>When she reached the camp before 11am, it was still snowing. Thanks to the Empress Dowager’s decree that Chu Lian had in her hands, it was Great General Qian himself who would receive her.</p><br/><p>Since most of the soldiers in camp were all rough men, Great General Qian had specially borrowed a team of female soldiers from Sima Hui to welcome Chu Lian.</p><br/><p>The northern border was currently in the middle of an extremely cold winter. As Chu Lian was helped off the carriage by Wenlan, she was completely wrapped up like a round ball.</p><br/><p>She wore a large grey squirrel fur coat, the fluffy fur-lined sleeves of which nearly enveloped the entirety of her hands. She was also holding a hand-warmer for additional protection. More than half of her face was covered up by her hood, so that only her wide almond-shaped eyes could be seen. Since her leg had just healed recently, she walked much slower than most people and her awkward gait looked a little amusing.</p><br/><p>When Sima Hui’s female adjutant, Xiaoyan, finally met with the He Family’s Third Young Madam, she had to suppress her snort of laughter.</p><br/><p>Her heart was filled with disdain. How clumsy-looking. No wonder the handsome He Sanlang didn’t like her.</p><br/><p>She heard that this Third Young Madam had even been given the title of Honoured Lady?</p><br/><p>Xiaoyan wondered which noble she had begged for that title, all in hopes of giving herself a little more status. The He Family’s matriarch had really racked her brains out to help this Sixth Miss.</p><br/><p>The female adjutant shot a look at the handmaids nearby, dressed in battle attire like she was. The leader of the handmaids nodded and quickly followed Chu Lian’s small party.</p><br/><p>When they entered the camp, the first one to welcome them was Captain Guo.</p><br/><p>With Tang Yan by her side to introduce her, Chu Lian bobbed slightly in greeting to Captain Guo.</p><br/><p>Captain Guo cast a measuring gaze over Chu Lian before chuckling. “Zixiang should have been the one to welcome you today, but he went to the frontlines yesterday, so he’s not in camp right now. Thus, the duty of welcoming you has fallen on this old brother’s shoulders. I hpoe you can understand the circumstances, Sir Tang, Sister-in-Law.”</p><br/><p>Chu Lian shook her head and smiled. “Brother Guo, there’s no need to stand on ceremony like this. It’s the first time my husband has joined the army, we’ll have to rely on Brother Guo’s care in the days ahead!”</p><br/><p>After saying so, she signalled for Wenlan to offer a blue pouch up to Captain Guo.</p><br/><p>“These are just some small snacks, I hope Brother Guo will accept this small token of my gratitude.”</p><br/><p>Captain Guo had taken a liking to this bright-eyed and generous newly met sister-in-law of his. He took Chu Lian’s gift respectfully with both hands and accepted the gift with a smile.</p><br/><p>“Sir Tang, Honoured Lady, please rest in these two tents for a moment. I’ll go ahead and report your arrival to the general.”</p><br/><p>Tang Yan bowed to Captain Guo. “Sorry for the trouble, Captain Guo.”</p><br/><p>Chu Lian was led into the tent on the left by the female soldiers. Since Tang Yan was a man, he was led to the tent on the other side.</p><br/>\n</div>"}