{"title": "Chapter 335: Naughty Book (4)", "id": 335, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-335-naughty-book-4", "volume_title": "Volume 4", "body": "<h1>Chapter 335: Naughty Book (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As expected, when He Changdi finally led his troops back into camp, a messenger came over to report that Chu Lian was currently in his tent!</p><br/><p>He Changdi shot a severe glare at Xiao Hongyu. Xiao Hongyu rubbed his nose awkwardly from behind him.</p><br/><p>He decided to run off with the other troops to have their midday meal and leave He Changdi and Chu Lian alone in the tent.</p><br/><p>When He Changdi reached his tent, he noticed three female soldiers squatting in front, washing clothes. He Changdi furrowed his brows together.</p><br/><p>He barked, “What are all of you doing here?!”</p><br/><p>His gaze landed on the wash basin and he realised that the garments inside were his clothes.</p><br/><p>Xiaoyan and the others hadn’t expected He Changdi to have returned so early. Their faces were full of surprise. However, Xiaoyan was experienced with dealing with unexpected situations after serving Sima Hui for so long, and she managed to quickly recover.</p><br/><p>Xiaoyan acted as if she had been wronged and placed her hands, which had turned an ugly purplish red from the cold, on top of the wet clothes in the basin to make them more obvious.</p><br/><p>She intentionally made her voice soft and weak to draw their pity. “Captain He, we escorted Honoured Lady here. Our general ordered us to serve Honoured Lady, so we had to follow Honoured Lady’s orders when she told us to wash these clothes. Although this subordinate was born a lowly servant, this subordinate is still General Sima’s personal handmaid.”</p><br/><p>Xiaoyan was right. Chu Lian had indeed been the one to order Wenlan to bring these clothes out for them to wash. However, she had purposely phrased her words to imply that it was an unfair order.</p><br/><p>As Xiaoyan spoke, she kept sneaking glances at He Changdi’s expression.</p><br/><p>Unfortunately, she couldn’t discern any bit of emotion from He Changdi’s cool and handsome face, so she couldn’t tell if her ploy was working.</p><br/><p>She gritted her teeth and continued. “This subordinate ventures to say that Honoured Lady has taken things too far. Our general has never held any dishonest intentions, yet Honoured Lady has already tried to nip things in the bud. This subordinate has never seen such a thing!”</p><br/><p>Xiaoyan kept her back straight and her head high.</p><br/><p>She was even a little pleased inside. With this, Captain He should know how unbearable his wife was!</p><br/><p>Nothing had even happened yet, and Sima Hui wasn’t even a threat to their marriage. However, his wife had already tried to discipline Sima Hui’s personal handmaid. He Changdi would surely hate such a petty and jealous wife.</p><br/><p>Wenqing and Wenlan had heard everything from within the tent. Their faces were flushed red with anger. Wenlan wanted to run right out of the tent to scold Xiaoyan, but Chu Lian held her back.</p><br/><p>Chu Lian shook her head soundlessly. Wenlan stomped her foot in frustration and walked further away from the tent entrance. Out of sight, out of mind. If she couldn’t hear any of the conversation outside, her frustration would surely dissipate.</p><br/><p>However, Chu Lian stood by the tent flap without moving. There wasn’t much of an expression on her face, but her clenched fists hidden by her wide sleeves betrayed her nervousness.</p><br/><p>He Changdi was a tall man. Even though Xiaoyan wasn’t short, he could still look down upon her.</p><br/><p>He swept the three female soldiers with an icy glare. Next, his lips moved and his low, magnetic voice resounded in a frighteningly cold tone. He only had one word to say.</p><br/><p>“Scram!”</p><br/><p>That short syllable was enough to make Xiaoyan and the others shudder.</p><br/><p>Their eyes widened in disbelief. They couldn’t believe He Changdi could act like that.</p><br/><p>A storm seemed to be brewing in the dark pools that served as He Sanlang’s eyes. He focused his gaze on Xiaoyan, who struggled to breathe when faced with eyes as icy as those.</p><br/><p>“What? Didn’t you hear me? I told you all to scram!”</p><br/><p>It was as if a basin of cold water had been dunked over the three female soldiers’ heads. Their bodies started trembling.</p><br/><p>They ran off helter-skelter after a moment’s pause, even stumbling in their efforts to leave as quickly as possible.</p><br/><p>The soldier standing on guard nearby was filled to the brim with admiration for his captain. He stood up even straighter, looking just like a sharp spear.</p><br/><p>He Sanlang’s gaze turned to the wooden basin by his feet next. When he thought of how his clothes had been handled by those female soldiers, his brows drew together in disdain. He then ordered, “Throw out all the clothes in this basin.”</p><br/>\n</div>"}