{"title": "Chapter 338: The First Kiss (1)", "id": 338, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-338-the-first-kiss-1", "volume_title": "Volume 4", "body": "<h1>Chapter 338: The First Kiss (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Although the changes in He Sanlang’s expression weren’t obvious, Chu Lian had been watching him all this time, so she noticed how the glint in his eyes had changed. When she followed He Sanlang’s line of sight, the crude naughty book that she had casually thrown onto the side table came into view.</p><br/><p>Chu Lian blinked as curiosity welled up inside her.</p><br/><p>He Changdi normally seemed like a cool and aloof type of guy. She had never seen him smiling openly even in front of Matriarch He. Would a man as icy and reserved as He Sanlang really read that kind of book?</p><br/><p>Of course, Chu Lian didn’t intend to judge him. He was a man after all and it was pretty common for them to watch a few ‘movies’ here and there. In the modern world, they might even have an entire hard disk’s worth of ‘movies’ featuring their idols!</p><br/><p>She was simply curious. Chu Lian was definitely not going to admit that this was one of her stranger interests.</p><br/><p>He Changdi’s body stiffened slightly. He shifted his gaze away from that blue leather-bound book forcefully. He then stood up abruptly and walked over to Chu Lian’s other side before sitting down again.</p><br/><p>With his height and the armour he was wearing, as long as he bent his body forward slightly, he could block Chu Lian’s view of that blue book on the table.</p><br/><p>Chu Lian looked at him strangely, “Why did you shift to the other side so suddenly?”</p><br/><p>He Changdi cast a quick glance over and met Chu Lian’s perplexed gaze. It was only then that he pretended to be calm and collected as he replied, “I’m more used to sitting on this side.”</p><br/><p>Chu Lian muttered to herself, “What a weird habit. Aren’t you still sitting on the same bed?”</p><br/><p>When He Sanlang saw that Chu Lian hadn’t mentioned the little blue book at all, he heaved a sigh of relief inwardly. However, since he was leaning his body a little sideways, his current pose seemed rather strange.</p><br/><p>Chu Lian hadn’t realised why He Sanlang had moved at first. It was only when she turned her gaze in the direction of the side table that she realised what had happened.</p><br/><p>Her first reaction was to burst out into laughter within her mind. This lunatic husband of hers was trying to bury his head in the sand and ignore the book?</p><br/><p>He Sanlang hadn’t even fully relaxed when Chu Lian’s uniquely soft tone rang out, “So you like looking at lewd drawings?”</p><br/><p>He Changdi’s cool and handsome face instantly exploded into a furious blush that covered his entire face. His skin was the type that tended towards lighter tones, so the flush of red was extremely obvious.</p><br/><p>Chu Lian watched the changes on He Sanlang’s face in surprise. She finally understood what the phrase ‘ripe as a peach’ meant.</p><br/><p>He Changdi’s deep and serious eyes were now filled with embarrassment.</p><br/><p>His lips were pressed so tightly together that they formed a thin line. His face got redder and redder. After a moment of struggle, he managed to spit out a single sentence, “That book’s not mine.”</p><br/><p>Chu Lian was already rolling on the floor in laughter within her mind. She was holding on to the last vestiges of her calm facade with all her might. She hadn’t expected He Changdi to be so cute when embarrassed, so she hadn’t been able to hold back her impulse to tease him just now.</p><br/><p>“I found that book under your bed, so who else could it belong to? Who would put a book like that under someone else’s bed?”</p><br/><p>He just knew that this would happen! It was in this wicked woman’s nature to be utterly infuriating!</p><br/><p>He had clearly been telling the truth, yet she refused to believe a single word of it.</p><br/><p>Frustration built up within He Sanlang’s chest. However, there was no way for him to let it out. His current expression was extremely entertaining.</p><br/><p>Chu Lian just couldn’t resist throwing in another jab, “There aren’t any women in most military camps, so it’s normal to look at these kinds of books. But there’s nothing much to this one.”</p><br/><p>There were just some normal positions shown in that book. They didn’t even change the backgrounds of the drawings; it was too primitive.</p><br/><p>Upon hearing Chu Lian’s statement, a dangerous glint started shining in He Changdi’s eyes.</p><br/><p>“So you looked inside?” He abruptly cut in with a sinister-sounding tone.</p><br/>\n</div>"}