{"title": "Chapter 341: Having a Meal Together (2)", "id": 341, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-341-having-a-meal-together-2", "volume_title": "Volume 4", "body": "<h1>Chapter 341: Having a Meal Together (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He Sanlang looked at the crude porcelain bowl in front of her. He took her bowl and put it in front of himself before replying in his usual magnetic tone, “I’ll eat these. Wait for Wenqing and Wenlan to make you something else.”</p><br/><p>After saying so, He Changdi took up the bowl of charred mystery food and started gulping it down furiously.</p><br/><p>Chu Lian saw that he had put the less perishable wheat pancakes and salted meat to one side and had only put the two bowls of mystery food in front of himself. She could guess at what he was intending to do. He Sanlang was going to finish the two bowls of charred stuff by himself in order not to waste food.</p><br/><p>Her chest felt heavy for some reason and she started to feel pity for He Changdi.</p><br/><p>Chu Lian suddenly called out and stopped the maidservants who were about to go out to look for a place to cook.</p><br/><p>Wenqing and Wenlan looked at Chu Lian strangely, “Do you have any other orders, Third Young Madam?”</p><br/><p>Chu Lian shook her head, “There’s no need to go to the trouble. I’ll eat these.”</p><br/><p>It wasn’t as if she was a spoiled princess who couldn’t bear the slightest bit of suffering. Since thousands of men in the army were eating these every day and even He Changdi was eating this kind of food, then why couldn’t she do the same?</p><br/><p>Wenqing and Wenlan’s eyes widened. They couldn’t believe that their Third Young Madam, who would rather starve than eat something terrible, would actually choose to eat such unappetising food. However, since their master had given the order, they couldn’t disobey her. They retreated outside the tent so as not to disturb the young couple.</p><br/><p>He Changdi clearly hadn’t expected Chu Lian to actually eat this poor fare.</p><br/><p>He remained stunned for a second before recovering his sense. Thinking that Chu Lian was only interested in the food because he was gulping it down quickly, he gave her a kind reminder, “Chu Lian, don’t look at how quickly I’m eating this. Actually, it doesn’t really taste that good. It’s like heaven and earth compared to your cooking.”</p><br/><p>Chu Lian looked at him before pointing at the bowl he had taken from her, “Pass it to me.”</p><br/><p>He Sanlang had no other choice but to follow her order. He knew that he wouldn’t be able to convince her at this point. He thought for a moment before pouring half of the mystery food from her bowl into his own. He then told Wenqing to pour a bowl of warm water for them.</p><br/><p>He placed the bowl in front of Chu Lian before speaking up in a light and casual tone, as if he wasn’t concerned at all. However, anyone would be able to sense the care in his words.</p><br/><p>“This bean paste doesn’t taste good and you’re probably not used to this kind of taste. Just have a little taste of it. The wheat pancakes are too hard, so tear them up and soak them in the warm water before you eat them. You can have some of the salted meat as well.”</p><br/><p>Chu Lian nodded and took her bowl from him. She looked at the black substance that she now knew was ‘bean paste’ and gulped. Following that, she used her spoon to scoop up some bean paste and placed it gingerly into her mouth. Almost immediately, that weird taste overwhelmed her tongue and she almost spit out the paste in her mouth. In the end, she forced herself to swallow it. After managing that feat, she quickly drank some warm water to wash away the lingering taste in her mouth.</p><br/><p>She was absolutely shocked at the taste of this strange bean paste. She had no idea how it was made either. The taste of it was almost at the level of Surströmming, one of the worst foods in the world.</p><br/><p>As much as Chu Lian had tried to mentally prepare herself, she just couldn’t summon the courage to take a second bite out of the small bowl of bean paste in front of her.</p><br/><p>The hint of a smile could be seen in the crease of He Sanlang’s eyes, a rarity for the normally icy-faced man. He took Chu Lian’s bowl back and pushed the bowl of wheat pancakes to Chu Lian. “Eat this instead!”</p><br/><p>He took out a fine-looking dagger from his waist band and cut off a few pieces from the salted meat with practiced movements before putting them in her bowl.</p><br/><p>“If it’s tasteless to you, then take a bite of salted meat.”</p><br/><p>Chu Lian nibbled at a wheat pancake and heaved a sigh of relief upon finding that it tasted pretty normal. Although it couldn’t be considered delicious, it was like gourmet food compared to the bean paste.</p><br/><p>While taking small bites from the pancake, she glanced at He Changdi from time to time. She watched as he expressionlessly finished off the two bowls of bean paste and cut off a small piece of salted meat. He chewed on the salted meat for a while before setting down his chopsticks.</p><br/>\n</div>"}