{"title": "Chapter 349: Green Jade Thumb Ring (2)", "id": 349, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-349-green-jade-thumb-ring-2", "volume_title": "Volume 4", "body": "<h1>Chapter 349: Green Jade Thumb Ring (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He Changdi suddenly spoke up. “Brother Guo, the Tuhun army hasn’t been attacking in full force for the past few days.”</p><br/><p>This seemed like a good thing on the surface, almost like the Tuhuns had been scared off by them. While he had been battling on the frontlines during the past few days, He Changdi could clearly feel that the Tuhuns were no longer fighting as furiously. They only sent out small waves of soldiers to mount surprise attacks or harass them, as if they were trying to play for time.</p><br/><p>Captain Guo and the rest frowned.</p><br/><p>Captain Guo rapped the surface of the side table with his knuckles as he mused, “Zixiang, what do you think they’re trying to do?”</p><br/><p>Although He Changdi’s features were handsome, his current expression was somber and grave. “They’re trying to drag out the war. I’m afraid they already know about our lack of supplies.”</p><br/><p>Captain Guo gave a huge start.</p><br/><p>Their supply routes were completely blocked, and none of the essential supplies they needed could be sent in. Once the enemies realised the border troops’ situation, they would become sitting ducks here, with only death awaiting them.</p><br/><p>By then, the Tuhuns wouldn’t need to use a single soldier or arrow to capture all fifty thousand border troops without resistance.</p><br/><p>After all, not everyone would be able to keep thinking of serving the country when faced with extreme hunger.</p><br/><p>Captain Guo abruptly stood up. He paced the tent with his hands behind his back in an impulsive mood.</p><br/><p>In a flash, he looked up and swept his gaze across the entire tent. “Continue chatting. I’m going to look for the great general. Remember to watch what you say!”</p><br/><p>Actually, Captain Guo wasn’t worried about any loose lips within this group. They were sworn brothers, after all. However, he had to give reminders when he could.</p><br/><p>Captain Guo took his cloak and rushed over to the entrance of the tent. He suddenly turned back and told He Changdi, “Zixiang, General Sima sent over two soldiers for you to punish at night. Take a look at the tent next to this.”</p><br/><p>After saying so, he lifted the tent flap and left in a flurry of wind.</p><br/><p>Since the atmosphere had turned so grave suddenly, the brothers no longer had any desire to chat. Zhang Mai bid them goodnight and took the bedding back to his own tent.</p><br/><p>He Changdi called one of the soldiers on duty outside and questioned him about what had happened for a moment. Following that, he ordered someone to send the two female soldiers back. He didn’t want to think about what was going on with Sima Hui at this point, nor did he want to have any association with her at all.</p><br/><p>When he returned to camp, Xiao Hongyu came over with a face expecting some gossip. “Brother He, how was it? How did you deal with those two female soldiers? I peeked a bit earlier and one of them is quite pretty.”</p><br/><p>He Sanlang sent a cool glance towards him. “I sent them back.”</p><br/><p>“What! Brother He, you let such a tasty morsel slip through your fingers!”</p><br/><p>“Did you have something in mind?”</p><br/><p>Xiao Hongyu rubbed the back of his round head sheepishly. “Brother He, you have a wife, but I haven’t married one yet!”</p><br/><p>He Changdi snorted. “If you want them, go ask General Sima for them yourself.”</p><br/><p>Xiao Hongyu stiffened up. “What, you want me to beg that tomboy for them? Forget it, it’s better for me to be single!”</p><br/><p>“Good that you realise that!”</p><br/><p>Xiao Hongyu was instantly beaten into the dust by those words. He collapsed in his bed lifelessly.</p><br/><p>It was only now that He Changdi finally had the time to open up the package that Wenqing had given him.</p><br/><p>Xiao Hongyu secretly watched as He Sanlang opened up the package, prepared to snatch away anything tasty within.</p><br/><p>Unfortunately, he was left with disappointment. It was just some ordinary clothes within and an exquisite-looking wooden box.</p><br/><p>Xiao Hongyu rarely saw such fine-looking fragrant rosewood boxes, so driven by his curiosity, he came over to see. “Brother He, open it! I want to see what’s inside!”</p><br/><p>He Changdi lifted up the wooden box and examined it. The fragrant rosewood box was decorated with fine details. Its surface had been painted over in black and some auspicious patterns to draw luck for a prosperous career were carved onto it. If the box already looked this exquisite, then what about its contents?</p><br/><p>He Sanlang was a little fazed. His deep gaze was fixed on the wooden box as if he were trying to see through it.</p><br/><p>He had seen this in his past life before. It was something that he was very familiar with.</p><br/><p>He already knew what was inside without opening it.</p><br/><p>A green Hetian jade thumb ring. The one that Xiao Bojian had carried on his thumb, a perfect match with the one that Chu Lian had frequently worn.</p><br/><p>But now, it had landed in his hands!</p><br/>\n</div>"}