{"title": "Chapter 344: Lacking Supplies (1)", "id": 344, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-344-lacking-supplies-1", "volume_title": "Volume 4", "body": "<h1>Chapter 344: Lacking Supplies (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As He Sanlang exited his tent, he happened to bump into Sima Hui. When Sima Hui noticed He Sanlang, she pulled her horse along and quickly strode over with a smile on her lips. She was about to greet him when He Sanlang simply moved right past her.</p><br/><p>Sima Hui’s hand hung frozen in the air. An awkward expression appeared on her face.</p><br/><p>Sima Hui could only return to the main camp in a gloomy mood, disappointed. After giving her report in the commander’s tent, she met her adjutant Xiaoyan and two other female soldiers who had been waiting outside.</p><br/><p>Her adjutant’s expression wasn’t very good. Her hands were red from frostbite and her eyes were both reddened and swollen from tears. When Sima Hui saw the state that Xiaoyan was in, her expression changed immediately. “What happened?”</p><br/><p>Xiaoyan simply looked down and bit her lip without speaking, which only emphasised her pitiful appearance.</p><br/><p>In the end, the female soldiers behind her were the first to lose their patience. They immediately began to spill their complaints. “General, you have to mete out justice for Sister Xiaoyan and your subordinates.”</p><br/><p>Sima Hui took a deep breath to control her anger. Then, she ordered, “Follow me back to camp and explain everything there.”</p><br/><p>The three women obediently agreed and followed behind Sima Hui as they made their way back to their own tent.</p><br/><p>When her subordinates finally finished reporting the entire chain of events, Sima Hui looked up at Xiaoyan, who was standing before her. She hesitated for a moment before asking, “Xiaoyan, tell me if what they said was true.”</p><br/><p>The adjutant Xiaoyan didn’t know what was going on. Although the general’s voice was as gentle as usual, she could feel her heart tightening with apprehension.</p><br/><p>She sent a careful glance at Sima Hui before gritting her teeth and nodding. “Miss, everything they said is true. Honoured Lady Jinyi didn’t show you a single ounce of respect. She even made trouble for this servant on purpose. She might have something against you because of Captain He.”</p><br/><p>Her young miss had always protected her; she couldn’t even count the number of times she had done so. Xiaoyan believed that this time would be no exception. As long as her young miss wanted to fight for the man, with her around to plot for her young miss, Captain He was practically in the bag already.</p><br/><p>Xiaoyan was brimming with self-confidence. However, this time, she might really have overestimated her own value.</p><br/><p>Disappointment flashed through Sima Hui’s eyes. She briefly hesitated before finally saying, “Xiaoyan, you know what your punishment should be. Go and mete it out yourself. I won’t need you to serve by my side any longer; let Xiaoju take your place.”</p><br/><p>Sima Hui wasn’t a stupid person. There was a reason why she had managed to earn the position of general at such a young age.</p><br/><p>While Old General Sima had been alive, he had personally taught her everything he knew. Later on, she had also spent almost five years in the army, starting from the lowest rank. Xiaoyan had grown up together with her and had served her as her personal handmaid for all that time. Although she had already gotten used to spoiling Xiaoyan, Sima Hui still stood by her own principles. Xiaoyan had crossed the line and Sima Hui had no mercy for offenders.</p><br/><p>Xiaoyan had thought to borrow her general’s power to intimidate Chu Lian. She assumed that her long years of service would lessen any consequences. Even if her mistress found out the truth, the worst punishment she would receive would only amount to a light reprimand. Xiaoyan never expected her mistress to dismiss her directly from her personal service. That punishment was even worse than sentencing her to fifty strikes of the rod.</p><br/><p>Xiaoyan’s previous calm instantly turned into panic and fear. “Miss, if this servant has done something to displease you, please punish this servant directly! Please don’t send this servant away! The old general has already gone; this servant only has one master left!”</p><br/><p>This time, Sima Hui remained unmoved by her pleas. With a wave of her hand, her two female guards stuffed Xiaoyan’s mouth with cloth and took her away.</p><br/><p>As for the two remaining female soldiers, when they saw how Xiaoyan had ended up, they lost all the courage to speak. They knelt down and lowered their heads, trembling with fear. Without any prompting from Sima Hui, they began to beg for mercy as they cried, “General, it was Sister Xiaoyan who ordered us to do everything. It wasn’t our idea at all! General, please have mercy on us!”</p><br/><p>Sima Hui’s handsome face was all cold. Her brows were drawn together and her eyes were filled with fatigue and disappointment.</p><br/><p>With another wave of her hand, the two remaining female soldiers were also taken away. To their dismissal, Sima Hui included an additional order. “Take these two to Captain He’s tent and let him decide their punishment.”</p><br/>\n</div>"}