{"title": "Chapter 355: Dissatisfaction (2)", "id": 355, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-355-dissatisfaction-2", "volume_title": "Volume 4", "body": "<h1>Chapter 355: Dissatisfaction (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian looked carefully at the old carpenter. Although his face was already wrinkled, his eyes weren’t hazy or unfocused in the slightest. On the contrary, they were bright and filled with intelligence.</p><br/><p>She laughed in response. “Old Master has indeed lived much longer than I have. I can agree to your conditions, but I have a condition of my own. If this design were to leak out without my express permission, then we won’t be standing here having a nice discussion like we are today.”</p><br/><p>The old carpenter’s eyes lit up. He clutched the blueprints in his hands and immediately knelt down before Chu Lian, kowtowing twice to her. The sound of his forehead meeting the floor made resounding thuds echo throughout the room. “If this old man were to act against Esteemed Madam’s wishes, then this old man will die without any heirs!”</p><br/><p>The ancients placed a lot of importance on passing on their legacies. They were also rather superstitious and revered the gods. Chu Lian wasn’t too worried now that the old carpenter had made such a solemn vow.</p><br/><p>“Old Master, I’m entrusting this to you. You can bring any number of helpers you want. I’m only giving you three days. In three days’ time, I want to see that design built!”</p><br/><p>“This old man won’t betray Esteemed Madam’s expectations.”</p><br/><p>Chu Lian turned now to instruct Manager Qin. “Manager Qin, you are to arrange for anything that Old Master needs as soon as possible.”</p><br/><p>Manager Qin was very efficient with his work, so he immediately pulled the old carpenter over to one of the side rooms to discuss what was needed.</p><br/><p>Thus, before it was even midday, the old carpenter had already started work.</p><br/><p>Manager Qin sent someone to bring the old carpenter’s three sons and eldest grandson into the estate. Chu Lian’s courtyard wasn’t very big in the first place, so the sudden increase in the number of people coming to and fro was very eye-catching.</p><br/><p>Due to the absolute secrecy of the blueprints, Chu Lian had arranged for the old carpenter and his family to work in one of the empty storehouses on the side of the courtyard. She also had the Li siblings take turns standing guard.</p><br/><p>The entire He Estate was startled by how serious Chu Lian was treating her little project. Even Tang Yan sent someone over to inquire about what she was doing, only to be sent back with some excuse.</p><br/><p>All of this made Mo Chenggui very unhappy.</p><br/><p>While Chu Lian had been able to deflect Tang Yan, Mo Chenggui wasn’t one to back down so easily.</p><br/><p>It snowed heavily the next few days. The streets of Liangzhou City were practically buried by the snowfall, so it became even harder to travel out of the estate.</p><br/><p>Mo Chenggui sent some men to check on the situation at the border camp early in the morning. When his men returned and reported on what they had found, Mo Chenggui frowned and shook his head silently. They were all old and grizzled soldiers who had fought on countless battlefields, so they knew that the situation was taking a turn for the worse.</p><br/><p>Mo Chenggui had gotten a good overview of the border troops’ situation from He Changdi, but he couldn’t do anything but sit and wait anxiously. These few days, due to his worries and stress, he had even gotten two large blisters at the corner of his mouth.</p><br/><p>Since he was biased against Chu Lian, he had never eaten the meals that she sent over. Even though the food was fragrant and looked extremely delicious, he never took a single bite. He would order his men to send all the meals back unopened. Not only that, he never allowed his soldiers to eat those meals either.</p><br/><p>Chu Lian had only sent meals over out of basic courtesy in the first place. After getting rejected by Mo Chenggui, she got the hint and stopped sending food over.</p><br/><p>Up till now, Chu Lian’s party had been eating dishes made out of dried vegetables for at least a few days every week. Thanks to the good nutritional balance of their meals, their faces were glowing pink with health.</p><br/><p>However, it was a whole other story for the private soldiers under Mo Chenggui’s command. Since they weren’t eating the meals cooked by Chu Lian’s party, all they ate every day was the dry and hard wheat pancakes made by the border camp’s cooks. Occasionally, they would be able to have a bowl of thin gruel and a piece of salted meat. As more time passed, their faces became more and more sallow and their health declined.</p><br/><p>Whenever the private soldiers went out of the estate with Chu Lian’s subordinates, they looked like they had come from completely different places.</p><br/><p>By this time, the men that Mo Chenggui had sent to spy on Chu Lian had also returned.</p><br/><p>Mo Chenggui sat at the head of the room. To the old soldier who had gone to check on Chu Lian, he asked, “What is Third Young Madam doing now?”</p><br/>\n</div>"}