{"title": "Chapter 365: Immediate Needs (2)", "id": 365, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-365-immediate-needs-2", "volume_title": "Volume 4", "body": "<h1>Chapter 365: Immediate Needs (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When He Changdi brought Laiyue back to camp and dismounted from his horse at the entrance, he realised that Great General Qian was already waiting at the entrance with the other officers in tow.</p><br/><p>Great General Qian was smiling from ear to ear and eyeing He Changdi as if he was carrying a whole store of grain. Some of the soldiers had likely run ahead of him and reported the good news to Great General Qian first.</p><br/><p>He Sanlang kept his face cool and calm as usual, but General Qian didn’t show any hint of dislike this time. He came forward and slapped He Changdi’s shoulder forcefully and stopped He Changdi before he could make a salute, “You brat! So you were still keeping this ace up your sleeve! Come, let’s go to my tent and have a talk!”</p><br/><p>He Changdi shot a look at Laiyue to indicate that he should follow.</p><br/><p>It was only after two whole hours that General Qian finally let He Sanlang and Laiyue go.</p><br/><p>Laiyue’s face was full of happiness. He followed behind his young master like an annoying duckling, “Third Young Master, did you hear that? The general said that you’ve made a huge contribution this time, so you’ll be able to return to the capital once the war is over! Hehehe, too bad the roads are all blocked by this snowstorm now, otherwise this servant would definitely write back to the estate with this piece of good news! If Third Young Madam were to find out, wouldn’t she be over the moon?”</p><br/><p>He Changdi had calmed down by now. He didn’t share Laiyue’s joy, as the biggest cause of the problem hadn’t been solved yet. The food that Laiyue had sent over was only enough to solve their immediate needs and they were merely delaying the ticking time bomb about to explode in their faces.</p><br/><p>He just couldn’t cheer up at all.</p><br/><p>While his worries still dominated his heart, it was easy for his mood to shift. However, Laiyue still had to mention Chu Lian.</p><br/><p>He Changdi’s eyes narrowed into slits. That wicked woman Chu Lian!</p><br/><p>If not for her, he wouldn’t have met such a terrible fate. He wouldn’t have reincarnated and come running out to this dratted border to fight for a slim chance of survival!</p><br/><p>He Changdi snorted, “So you were bought over by just a single bowl of Third Young Madam’s braised pork? How cheap!”</p><br/><p>Laiyue shrunk back. He had instantly realised that his master was angry from that mocking tone of his. However, hadn’t he been perfectly fine moments ago? Why was he so unhappy now?</p><br/><p>Laiyue scratched his head in confusion. He just couldn’t understand the complicated nuances of his young master’s moods.</p><br/><p>“Then this servant won’t write any letters to Third Young Madam. This servant will only write to the matriarch and Madam, they’ll be extremely delighted for sure!”</p><br/><p>He Changdi sneered. Could his manservant get any more stupid? If he wrote back to the estate, wouldn’t his doting grandmother tell that wicked woman everything anyway?</p><br/><p>When He Sanlang abruptly realised that his mind was drifting to meaningless possibilities, he blanked out for a moment before pressing his lips together.</p><br/><p>He said, “You don’t have to think about writing back. Your Third Young Madam is right here in Liangzhou City.”</p><br/><p>He Changdi’s tone was emotionless, but Laiyue jumped in surprise after hearing his words. His eyes opened wide as he asked in disbelief, “Third Young Master, what did you say?! Third Young Madam is here in Liangzhou!?”</p><br/><p>The only reply that Laiyue got from He Sanlang was a cold sneer frosty enough to freeze his nose off.</p><br/><p>This time, Laiyue finally believed that Third Young Madam had really come to Liangzhou.</p><br/><p>He quickly spoke up, “Then this servant will rest for two days and go to visit Third Young Madam after this servant’s body has warmed up. It’s not easy for Third Young Madam to come all the way to Liangzhou as a young lady…”</p><br/><p>As Laiyue mumbled by his ear about how it wasn’t easy for a woman to travel this far out, the ice block that was He Changdi’s face slowly started to melt.</p><br/><p>His imagination brought forth an image to his mind. He thought of how Chu Lian must have trudged through the snow while holding up her thin skirt, showing how her pretty embroidered shoes had been soaked through. Her cheeks had most likely been flushed red from the cold winds while her wide eyes had been filled with unshed tears as she soldiered on.</p><br/><p>A strong breeze almost pushed the Chu Lian of his imagination into the snow. That wicked woman abruptly looked up towards him with two watery and aggrieved eyes. He Changdi’s body froze and he was filled with the urge to reach out to pull her into his arms and wrap her entire person with his warm cloak and embrace.</p><br/><p>However, the reality was vastly different from He Sanlang’s imagination. On her way here, Chu Lian had simply sat in a brazier-warmed carriage with handwarmers. She had been wrapped in a fur coat coupled with fur-lined boots.She hadn’t even gotten a single chilblain from the cold. How could she possibly have come to the north by walking through the snow?</p><br/><p>If the overly imaginative He Sanlang were to find out the truth, who knows if he would be angry with himself or the wicked woman Chu Lian?</p><br/><p>This time, He Changdi kept his calm and didn’t speak a word of agreement or disapproval. However, Laiyue had been serving his master for a long time, so of course he understood his master’s thoughts.</p><br/><p>Actually, their Third Young Master was a really kind person. He was just held back by his pride sometimes.</p><br/><p>Laiyue chuckled and took He Sanlang’s silence as approval.</p><br/><p>After he finished chatting about happier matters, the smile on Laiyue’s face slowly vanished.</p><br/><p>He spoke in a grave tone, “Third Young Master, while this servant was in the Yueqin Mountains, this servant wanted to buy more food, but this servant didn’t have enough silver on hand. This servant used up all the silver and traded away the jade amulets and accessories you gave, but this servant was only able to bring back this much.”</p><br/>\n</div>"}