{"title": "Chapter 382: Clashing Head-on (1)", "id": 382, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-382-clashing-head-on-1", "volume_title": "Volume 4", "body": "<h1>Chapter 382: Clashing Head-on (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xiao Bojian gazed out at the dark expanse of Lake Qianshan, his eyes clouded over with thought.</p><br/><p>“Have you gotten any news?” Due to his cold, his voice came out a little hoarse.</p><br/><p>One had no other choice but to accompany his master on this gate tower, suffering the lashing of the winter winds.</p><br/><p>“Master, I just got the news that Honoured Lady Jinyi is perfectly safe. She was only hurt on her ankle. It took some time for the news to travel here, so she has most likely recovered by now. She should be in Liangzhou City now.”</p><br/><p>Xiao Bojian’s cold and sinister features finally softened a little. However, his expression remained grim. Although he had a beautiful face, that expression would strike fear into anyone.</p><br/><p>“Pass down my order. No matter what situation the northern border troops are in, Lian’er must be kept safe.”</p><br/><p>One carried a troubled expression and his lips parted to speak. However, in the end, he swallowed his objection and replied with, “Yes, Master.”</p><br/><p>Xiao Bojian covered his coughing with one hand while reaching into the pouch he carried on his waist with the other. He groped around inside the pouch before pulling out the fine lucky jade amulet that Chu Lian had ‘gifted’ to him.</p><br/><p>The lucky jade amulet shone with a warm glow under the light of the torches around him. It was clear that it was regularly held in a person’s hand and worn.</p><br/><p>Xiao Bojian’s lips stretched into a sinister smile. He Changdi had better watch out! Chu Lian was going to be his someday. Anyone who wanted to take his woman would have to do it over his dead body!</p><br/><p>At this point of time, neither of the two adversaries knew that they would soon face each other in the ancient Su City…</p><br/><p>When dawn finally broke, the soldiers standing on the city walls spotted a group of men and horses travelling over the frozen Lake Qianshan.</p><br/><p>All of them were extremely alarmed and quickly sent out scouts to investigate the situation while reporting everything to their superiors.</p><br/><p>Half a day later, He Changdi and his group were invited into the camp of the reinforcement army, who had set up base within Su City.</p><br/><p>The reinforcement army consisted of the northwest army and twenty thousand soldiers from the Hunan Army.</p><br/><p>The commander of this army was the great general of the northwest army, Yuan Zhong. He had originally been one of Great General Qian’s subordinates. If He Changdi were to use this connection to request for aid, the result would likely be favourable for the northern border troops.</p><br/><p>He Sanlang had arrived at the Su City camp right in the middle of mealtime. The subordinates who had joined He Sanlang on this mission noticed that the northwest army even had rice to eat and their eyes nearly popped out of their sockets in envy as their mouths filled with drool.</p><br/><p>Although they envied the northwest army, the border troops were still happy.</p><br/><p>Since the northwest army was eating rice, that meant that the northwest army didn’t lack for supplies. Their request should go along much smoother then.</p><br/><p>One of the officers of the northwest army led He Changdi and his party to a tent.</p><br/><p>This tent was clearly much more luxurious than the others, so it was most likely the commander’s tent.</p><br/><p>He Changdi, Xiao Hongyu and Zhang Mai waited outside the tent. It had been a harsh six day journey to reach Su City using the snowboat. All of them looked quite haggard right now. Even Zhang Mai, who was usually more concerned with keeping up his neat appearance, sported some messy stubble. There were even some ash marks on his face here and there. His hands and feet were covered in chilblains from exposure to the elements.</p><br/><p>After fifteen minutes, He Changdi and his party were ushered into the tent.</p><br/><p>Yuan Zhong and a few officers of the northwest army welcomed He Sanlang and the rest.</p><br/><p>Once He Changdi entered the tent, he followed protocol and bowed in greeting to the great general of the northwest army, Yuan Zhong.</p><br/><p>When Yuan Zhong saw that the three men had all knelt down on one knee while keeping their backs straight, he hesitated before bursting out into laughter. He stepped forward and personally helped the three men up.</p><br/><p>“I didn’t expect Great General Qian to have sent such young officers out here! The younger generation is truly to be reckoned with!”</p><br/><p>Xiao Bojian was seated beside Yuan Zhong. His gaze abruptly sharpened as he noticed the young man who was the leader of the party.</p><br/><p>His grip tightened around the teacup he was holding in one hand. He Changdi! He had come here!</p><br/><p>So it was true that enemies were always destined to meet!</p><br/><p>He Changdi’s senses were finely honed, so he immediately realised that there was a cold gaze levelled on him. He shifted his eyes upwards and caught sight of Xiao Bojian seated above him; his thin lips pressed together in response.</p><br/><p>In an instant, the originally amiable atmosphere in the tent turned so tense that there should have been sparks flying in the air.</p><br/><p>Yuan Zhong was the first to notice that the atmosphere didn’t seem right. He glanced at the two men strangely, “Do you know each other?”</p><br/><p>The two men replied at the same time with similar cold tones, “Not at all!”</p><br/><p>Yuan Zhong had no choice but to cough awkwardly. In a quick turn of wit, he swallowed the question ‘Then is there a grudge between you two?’ he had been about to bring up.</p><br/><p>If He Sanlang were to give an answer to that unsaid question, he would surely have said: ‘The grudge of stealing my wife and ruining my family.’</p><br/><p>Thus, the discussion within the tent continued with the strange atmosphere in the air.</p><br/><p>Yuan Zhong made sleeping arrangements for He Changdi’s group. As for the supplies, they were in charge of gathering them themselves.</p><br/><p>The general also kept He Changdi and his party behind for a meal. After the meal, perhaps due to some inner sadist tendencies, he actually ordered Xiao Bojian to escort He Changdi out of the commander’s tent.</p><br/>\n</div>"}