{"title": "Chapter 383: Clashing Head-on (2)", "id": 383, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-383-clashing-head-on-2", "volume_title": "Volume 4", "body": "<h1>Chapter 383: Clashing Head-on (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When they left the tent, the faces of the two men who absolutely hated each other were icier than the frozen lake beyond the city walls.</p><br/><p>Xiao Bojian announced coldly, “Goodbye!”</p><br/><p>He Changdi had not even an iota of interest in talking to him, so he was about to turn around and leave when his eyes swept over Xiao Bojian’s body.</p><br/><p>A single item immediately caught his attention.</p><br/><p>There was a pure white piece of jade hanging from Xiao Bojian’s waistband. He Changdi couldn’t be more familiar with the carvings on that jade.</p><br/><p>That was the lucky jade amulet that Grandmother had given Chu Lian on the second day of their marriage at the tea ceremony. His grandfather had worn it often while he had still been alive.</p><br/><p>Why was that jade amulet hanging off Xiao Bojian’s waist?!</p><br/><p>The darkness in He Sanlang’s eyes gathered into a thick fog. The hands resting at his sides clenched into fists, and his knuckles creaked as if he might break his own fingers.</p><br/><p>However, a thread of reason still remained within him, keeping him from losing control and grabbing Xiao Bojian by the collar to interrogate him.</p><br/><p>Just that tiny ripple of emotion in He Changdi was enough for Xiao Bojian to sense that something wasn’t right.</p><br/><p>When Xiao Bojian noticed that his expression had turned into one of restraint, he looked at He Changdi with a faint smile. “Oh? Are you perhaps feeling well, He Sanlang? Should I send one of the doctors over to look you over?”</p><br/><p>As Xiao Bojian spoke, he couldn’t help stroking the warm jade at his waist.</p><br/><p>He Sanlang’s expression sunk and he turned and left the commander’s tent.</p><br/><p>Xiao Bojian looked at He Changdi’s hastily retreating back and let out a bark of laughter out of the blue.</p><br/><p>The guard following closely behind him nearly shivered as goosebumps rose all over his body. One knew that it was never a good thing whenever his master laughed.</p><br/><p>Xiao Bojian turned around and spoke as he played with the jade in his hand, “Let’s return to our tent. It seems like things are getting more interesting…”</p><br/><p>All the anger he had felt from Chu Lian leaving for the north so abruptly without a word had been instantly calmed by the sight of He Changdi’s expression just now. Xiao Bojian knew exactly why He Changdi had been unhappy.</p><br/><p>Although he didn’t know where this jade amulet had come from, it was likely something precious, judging from the shade of red that He Changdi’s face had turned into.</p><br/><p>Since Lian’er had given such a precious jade amulet to him, that clearly meant that he was the one in Lian’er’s heart. He Sanlang was probably nothing compared to him.</p><br/><p>On the way back to his tent, Xiao Bojian’s exquisite features were contorted into a ruthless expression. “One, report on the matters that I ordered you to investigate. The mountain paths have been blocked for days and the snow is up to our knees. How did they make it over with a carriage to ask for aid?”</p><br/><p>Ever since Xiao Bojian had earned the top rank in the imperial examinations, One had been ever more careful with his moody and unpredictable master.</p><br/><p>He replied, “He Sanlang didn’t use a carriage. He used something called a snowboat. From what this subordinate heard, it can glide over snow and ice and its speed doesn’t lose out to that of carriages.”</p><br/><p>“What?!” A flash of alarm flitted across Xiao Bojian’s face. How had he never heard of something like that before?</p><br/><p>“That is all this subordinate has been able to find out so far. The snowboat that they brought here is being closely guarded by his men. Even our spies won’t be able to get close to it so soon.” One added with his head lowered.</p><br/><p>“Continue investigating!” Xiao Bojian’s voice turned a little hoarse from his displeasure.</p><br/><p>What kind of weapon was that? He Changdi couldn’t have had it from the start, or the northern border troops wouldn’t have waited until now!</p><br/><p>There must be someone helping them from the shadows.</p><br/><p>Xiao Bojian clenched his fists. His plans had been completely disrupted by He Changdi’s arrival.</p><br/><p>He Changdi and his group were brought to the tent they had been assigned.</p><br/><p>On the way there, Xiao Hongyu and Zhang Mai could sense that He Changdi’s mood wasn’t very good.</p><br/><p>Zhang Mai knew that He Sanlang was a quiet one. Even if he had something weighing on his heart, he would only keep it in and stew on it by himself. He would never talk to someone to help release the burdens he carried within.</p><br/><p>He patted He Changdi on the shoulder, “After being on the road for so long, let’s take a hot bath and rest for a bit. No matter what it is, perhaps you’ll be able to think through it once you have a good night’s sleep.”</p><br/><p>After saying so, he pulled Xiao Hongyu with him and left the tent.</p><br/><p>Once Zhang Mai and Xiao Hongyu had left, He Changdi could no longer hold back the frustration in his heart. He turned to the table in the tent and flipped it over.</p><br/><p>He was feeling very conflicted right now.</p><br/><p>Although he had finally cleared up the feelings in his heart, he had suddenly been dealt a sound slap in the face!</p><br/><p>What did that wicked woman Chu Lian want?</p><br/><p>He had started trusting in her, but he had just seen grandfather’s jade amulet on Xiao Bojian!</p><br/><p>He Sanlang felt torn apart by his pain. He didn’t know how to face his budding feelings for Chu Lian now. It was impossible for him to ignore what had just happened too!</p><br/><p>He wanted so badly to fly back to Chu Lian’s side right now and ask her about everything once and for all.</p><br/><p>Thuds sounded in the tent as the table flew to the floor and the tea set that had been on top shattered.</p><br/><p>The ear-piercing sharp sounds calmed down the raging tsunami within He Changdi’s heart. He laid down on the bed, completely worn out. His chest rose and fell with his breathing as he covered his eyes with one arm. Snippets of his past and current lives flashed through his mind. The current He Changdi was very, very lost.</p><br/><p>Two days later, Xiao Bojian finally got news of the snowboat.</p><br/><p>One handed a tiny metal tube to Xiao Bojian, “Master, this is what our spy in the northern border sent over.”</p><br/><p>Xiao Bojian tapped the trigger on the surface of the tube, causing the tube to spring open, revealing a slender roll of paper within. There was only a single line of words on the note, but that was enough to make Xiao Bojian start trembling with emotion.</p><br/><p>Lian’er! So it was Lian’er! He just knew it. How could the bunch of old men in the north have come up with the snowboat? Such an innovative and novel idea could only have come from his brilliant Lian’er!</p><br/><p>Xiao Bojian trembled with excitement. He wanted to be right in front of Chu Lian right now. He wanted to trap her in his embrace and plant a kiss on those petal-like lips of hers.</p><br/><p>However, before he even finished getting over his excitement, an icy aura started creeping back over his body.</p><br/><p>He had suddenly realised that Chu Lian hadn’t made that marvellous snowboat for him… she had made it for that He Changdi!</p><br/><p>His hands turned into tightly clenched fists. Due to the abrupt change in his emotions, he started coughing intensely.</p><br/>\n</div>"}