{"title": "Chapter 399: Hanging on to Life (2)", "id": 399, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-399-hanging-on-to-life-2", "volume_title": "Volume 4", "body": "<h1>Chapter 399: Hanging on to Life (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Even with the thick fox fur cloak around her, the icy northern winds battered her body with snow and stole away whatever warmth she originally had. Her face and hands were already numb from the cold.</p><br/><p>Chu Lian looked up at the darkening sky, face worn with worry. Although they were able to bear with the low temperatures during the day, if they didn’t find a place to rest for the night soon, they would surely freeze to death out here in the open.</p><br/><p>She couldn’t determine any sense of direction in the middle of this white plain. Furthermore, she didn’t know if there were any pursuers on their tail.</p><br/><p>Chu Lian panted for breath as she turned to Myeryen. “Myeryen, could you ask your Ah-ma if she can find a place to sleep for the night? If we continue like this, we’ll freeze to death.”</p><br/><p>The teen nodded and turned to Urihan. Chu Lian listened as he spoke to her in the barbarian language.</p><br/><p>Myeryen nodded at his mother before turning back to Chu Lian and reporting what he had found out with a frown. “Sister Chu, Ah-ma said that there’s no place suitable to rest nearby. We have to walk for another five kilometres before we can find a place to rest.”</p><br/><p>Chu Lian sucked in a gasp of air upon getting such an answer.</p><br/><p>Five kilometres!</p><br/><p>In the army, when soldiers were forced to march at their fastest on a normal road surface, they would cover about five hundred kilometres or so in a day. For a normal person, they would be able to walk twenty five to thirty kilometres at the most.</p><br/><p>Although they had horses right now, they were in the middle of the icy north in knee deep snow. Their horses could go fifteen or twenty kilometres in a day without food or water.</p><br/><p>Now that the sky was already starting to turn dark, the closest place they could make camp at was still five kilometres away!</p><br/><p>It was impossible to reach there before night fell and the temperatures dropped.</p><br/><p>Chu Lian turned to look at the middle-aged Urihan and discovered that she had a similar expression of anxiety.</p><br/><p>However, they had no other choice but to try their best to survive out on the grasslands.</p><br/><p>They didn’t have any fire, and the ground was covered in a thick layer of snow. Any firewood they might be able to find was likely already damp and moldy. The white horizon spread out before them without an end. There wasn’t even an outcrop where they could take shelter, so the experienced Urihan was also helpless in the face of the cruel reality of nature.</p><br/><p>Their whole group seemed to have understood the danger they were in. Death was like a silent shadow slowly creeping over them.</p><br/><p>The atmosphere between the four of them turned dead and tense. Urihan was starting to regret bringing Chu Lian out.</p><br/><p>She hadn’t expected the snow-covered grasslands to be this hard to traverse. A place they could normally reach in a day of travel now took twice as long. This was under the assumption that they didn’t lose their way.</p><br/><p>Chu Lian’s wide eyes stared out into the falling snow around them. Her dry lips pressed together as a spark of resolution lit up in her eyes. She didn’t realise that this subtle action she took in the face of emergency was actually rather similar to He Changdi’s.</p><br/><p>The sky darkened abruptly, and the limited warmth of the day went along with the light.</p><br/><p>Chu Lian could now feel that her body was slowly trembling.</p><br/><p>She suddenly patted Urihan’s shoulder and said, “Ah-ma, we can’t continue going on like this. Even if we keep going for the whole night, we won’t be able to reach a place where we can safely pass the night.”</p><br/><p>Chu Lian’s simple words had obviously gotten through to Urihan.</p><br/><p>Urihan lowered her head and started sobbing lowly. She spoke in the barbarian language with a tone full of regret.</p><br/><p>Myeryen was also upset. He hugged his brother’s thin frame tightly and translated his Ah-ma’s words. “Sister Chu, Ah-ma says that she has let you down. She shouldn’t have been so reckless.”</p><br/><p>Chu Lian focused her gaze on the mother and sons before her, the gears in her head turning.</p><br/><p>She had learned all sorts of survival knowledge in the modern world. Surely there was something that could help get them through this emergency. There must be something! She just hadn’t remembered it yet!</p><br/><p>Chu Lian gripped the reins in her hands tightly and sunk into deep thought.</p><br/><p>When Myeryen didn’t hear any reply from her and noticed the blank expression on her face, he thought that she was blaming Ah-ma. He lowered his head in guilt.</p><br/><p>The northern wind howled in her ears, accompanied by the steady beat of the horses’ hooves landing on the snow. The horse under her suddenly snorted. It wavered, as if it could no longer endure the burden on its back.</p><br/><p>Chu Lian’s attention was drawn by the horse- an idea flashed in her mind.</p><br/><p>She had a way for them to survive the night!</p><br/><p>Chu Lian’s eyes lit up like the glittering stars in the expanse of night sky above them.</p><br/><p>“Ah-ma, Myeryen, I know how we can survive the night!”</p><br/><p>Myeryen had already accepted his fate. When he heard Chu Lian’s words, his eyes widened in shock. “Sister Chu, are… are you serious?”</p><br/><p>Even Urihan turned to Chu Lian with eyes full of hope.</p><br/><p>As long as there was a way to survive, who would really let themselves die? Urihan was no exception. Furthermore, she had two young sons. If there really was hope for survival, she would even sacrifice her own life in exchange for a fighting chance for her sons.</p><br/><p>Chu Lian nodded with certainty. Although her voice was soft and pleasant, the composure she held was able to calm the others and left no room for doubt or mistrust.</p><br/><p>“We can’t go on any further. It’s about to turn even darker and the temperature is only going to drop further. Let’s stop here first and use the horses as a shield against the winds. We have to eat something and recover our strength.”</p><br/><p>Her solution for their survival was going to require a lot of their energy. They had to rest and conserve their energy now. The horses had been carrying the weight of two people each for some time, and they likely wouldn’t be able to last much longer.</p><br/>\n</div>"}