{"title": "Chapter 390: Quick-witted (1)", "id": 390, "volume": 4, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-390-quick-witted-1", "volume_title": "Volume 4", "body": "<h1>Chapter 390: Quick-witted (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The woman hesitated for a while, as if considering whether there was a trick in Chu Lian’s suggestion.</p><br/><p>Chu Lian used the most childish and demanding voice she could muster, “I don’t know martial arts and you have four people on your side. I’m trapped on this horse so how could I possibly run away?”</p><br/><p>The woman seemed to think that Chu Lian’s words made sense. She spoke in a low voice, “Then hold on tight to me.”</p><br/><p>She reached out with her right arm and lifted Chu Lian up so that she could sit upright on the horse’s back.</p><br/><p>Chu Lian was still trapped because she was seated in front of the woman on the horse and the woman’s arms acted as a cage around her. Although she felt uneasy, it was much more comfortable than lying horizontally on the horse.</p><br/><p>The party of five, including Chu Lian, travelled at a brisk pace for almost an hour. During this hour, no matter what Chu Lian asked, no one answered her.</p><br/><p>In the end, Chu Lian gave up. It was clear that this group of people had undergone special training. They might even be some special agents trained to kill themselves before revealing their backers.</p><br/><p>The skies turned darker and the winds started up again, throwing snow in their faces. It was as if the snowstorm had engulfed them. No matter where she looked, she couldn’t see anything around her other than the weak glow from the lanterns they carried.</p><br/><p>Chu Lian didn’t understand how these people were navigating when she couldn’t even see anything than snow and darkness.</p><br/><p>Just as Chu Lian’s face was about to turn numb from the cold, the party finally stopped.</p><br/><p>Chu Lian trembled as she rubbed her hands together for warmth, trying to bring some heat back into her frozen appendages.</p><br/><p>The woman she was riding with helped her off the horse and towards a small hill. The four horses were gathered up by one of the men and led on a rope.</p><br/><p>Chu Lian pulled her fox fur cloak tightly around her body and hobbled through the knee-deep snow.</p><br/><p>It was only when she got closer that there was a hollow carved into the hillside and that there were people in there.</p><br/><p>Thanks to the snow covering everything and the darkness of the night, the visibility here was extremely low. If she looked up from the bottom of the hill, she wouldn’t be able to see the hollow at the middle of the hill. It was only visible from a close distance.</p><br/><p>Halfway up the hill, there was a natural hollow that spread inside the hill. The slope of the hill acted like a roof that blocked the wind. In the cold winter, this was the perfect location to make a small base.</p><br/><p>Once Chu Lian reached the hollow, she could see two tents set up. The areas outside the entrances of the tents had been cleared of snow. Even though it was already late, there was still a barbarian woman with her hair tied up in braids busying herself outside the tent. She was trying to cook something using the little bit of lamp light spilling out from one of the tents.</p><br/><p>After hearing the noise made by the new arrivals, the barbarian woman turned around and glanced at them. Chu Lian took the chance to take a good look at her; she was a middle-aged woman with a face full of wrinkles. Her expression seemed indifferent. After a single apathetic glance at them, she turned her attention back to the jar she was heating over the fire.</p><br/><p>The tallest man amongst the four people who had brought Chu Lian here stepped forward first. He walked towards the tents and shouted something before speaking a string of words. Chu Lian couldn’t understand what he was saying because he used the barbarian language.</p><br/><p>In a short moment, the tent flap was lifted and a head peeked out. The person within reached out to the man, and the man handed over the bag in his hands.</p><br/><p>The tent flap dropped back down. The person inside seemed to be satisfied with whatever he had been given, because he lifted up the tent flap once again and welcomed them in.</p><br/><p>Chu Lian was forced inside by the female rider. When they passed by the barbarian woman, she could smell something medicinal. She shot a glance at the jar heating over the fire and guessed that the barbarian woman was trying to brew some medicine. As expected, right before she entered the tent, she heard some coughing from the other tent.</p><br/><p>The tent that Chu Lian entered was much bigger than the other one. There were also some furs and blankets stacked up against the edge of the tent, so it seemed to be a sleeping area.</p><br/><p>There was a brazier placed in the center of the tent for warmth.</p><br/><p>In the harsh winter of the north, it would be impossible to sleep in a tent unless there was a brazier warming the tent from within.</p><br/><p>There was a terrible odour in the tent, most likely due to not airing it out for some time.</p><br/><p>The barbarian man who had welcomed them in spoke to the leader of her kidnappers in a fawning manner before retreating. It was clear that he had gone to the other tent to sleep.</p><br/><p>Chu Lian heard the barbarian man scolding someone outside, most likely the woman who was brewing medicine. Unfortunately, Chu Lian couldn’t understand what they were saying.</p><br/><p>She waited for her four kidnappers to take off their cloaks before using the light of the fire in the tent to get a close look at them.</p><br/><p>There was only one woman, and the rest were men. The tall man who acted as the leader kept a thin moustache on his lip. It seemed like he was the oldest one of the group. The other two men were skinny and didn’t have any special characteristics to them. The woman was taller than average and had thick lips.</p><br/><p>Basically, the four people had very ordinary appearances, the kind that you wouldn’t be able to identify in a crowd.</p><br/><p>People with such appearances were most suited for spying and secret missions.</p><br/><p>Once the four kidnappers had taken off their cloaks, they each found a place to sit and shut their eyes in rest.</p><br/><p>The woman remained right next to Chu Lian. She bent down and shook out the fur blanket at the side and set it out nicely on the ground. She then turned to Chu Lian and spoke in monotone, “It’s late. Honoured Lady should rest.”</p><br/><p>Chu Lian didn’t reject her offer and quickly curled up in the blanket. She then wrapped her own fox fur cloak around herself. Since the woman had initiated a conversation with her, she took the chance to ask, “Who sent you here to kidnap me?”</p><br/><p>The woman looked at her with lifeless eyes. There wasn’t any change of emotion on her face at all. She pressed her thick lips together, clearly not willing to speak any longer.</p><br/><p>Chu Lian refused to give up and continued asking while staring at the woman, “Was it Prince Jin? The Wei family? Don’t tell me it’s Xiao Bojian!”</p><br/>\n</div>"}