{"title": "Chapter 409: Take Good Care of Your Wife (2)", "id": 409, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-409-take-good-care-of-your-wife-2", "volume_title": "Volume 5", "body": "<h1>Chapter 409: Take Good Care of Your Wife (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When she opened up the bag, there was just some jerky and preserved food. Chu Lian didn’t mind the poor offerings and simply started eating.</p><br/><p>In a situation like this, Chu Lian knew better than to complain about the food. No matter what, she couldn’t let herself go hungry.</p><br/><p>He Sanlang sat at one corner and watched her eat. When he didn’t catch any trace of disdain or unhappiness in her expression, a part of his heart relaxed and warmed up at the same time.</p><br/><p>Actually, Chu Lian was a very caring and considerate lady. She had never been difficult on purpose and everyone got along well with her, no matter their position. She wasn’t at all like the spoiled and aloof noble ladies of the capital.</p><br/><p>When he thought back to the reports he had received from Prince Jin regarding Chu Lian, his brows suddenly drew together and his chest tightened.</p><br/><p>Although Chu Lian was the Sixth Miss of the Ying Estate, her mother had died when she was young and Chu Qizheng had remarried. As the saying went, once there was a stepmother, there would be a stepfather. She hadn’t been favoured in her estate. Since there were too many children in the Ying Estate, Duke Ying and Duchess Ying had never taken notice of her. She hadn’t had a good life in the Ying Estate.</p><br/><p>Her quality of living was sometimes even worse than some of the concubine-born daughters in the estate.</p><br/><p>He had never given much thought to Chu Lian’s past before. However, when he thought of it now, his heart felt a little heavy.</p><br/><p>Chu Lian was currently focused on the jerky, so she hadn’t noticed any of He Sanlang’s little changes in mood.</p><br/><p>Even if she knew what he was thinking now, she would only roll her eyes at him.</p><br/><p>Anyway, the person he was lamenting for wasn’t her. She wasn’t the original ‘Chu Lian’. She couldn’t even recognise all the people in the Ying Estate!</p><br/><p>However, He Sanlang had gotten something right. Although Chu Lian was picky with her food and loved eating good food, she wasn’t someone who would be difficult on purpose.</p><br/><p>She would consider the circumstances she was in before thinking of making good food. If she still fussed about food while in dire situations, wasn’t that the quickest way to die?</p><br/><p>Once her stomach was full, Chu Lian sat by the brazier in the warm pen and kept herself warm.</p><br/><p>The glowing embers cast a red glow over Chu Lian’s fair face. It was rare for the couple to get a chance to sit together for a chat like this.</p><br/><p>Actually, when He Sanlang wasn’t in one of his fits of lunacy, he was still a pretty handsome man, albeit rather stone-faced. Chu Lian couldn’t get enough of his looks.</p><br/><p>Under Chu Lian’s forceful questioning, He Changdi reported every detail of how he had come to find her. However, he hid the details about the murders of the four kidnappers.</p><br/><p>He Changdi didn’t know why he had done so subconsciously. When he looked into Chu Lian’s wide and trusting eyes, he just felt the urge to protect the innocence shining within them.</p><br/><p>Chu Lian stared into the embers in the brazier, her eyes sparkling. Her head was lowered, so no one could see the upwards curve of her lips she hadn’t been able to hold back.</p><br/><p>She hadn’t made the wrong choice to stay with this husband of hers now, hadn’t she?</p><br/><p>When evening came, before the last traces of the sun fell below the horizon, He Changdi and the rest of the search party managed to reach the border camp on time.</p><br/><p>Captain Guo, Sima Hui, Zhang Mai, Tang Yan and the others had already gotten the news and were waiting at the main camp entrance to welcome them back.</p><br/><p>Chu Lian was still wearing He Changdi’s clothes, so it wasn’t appropriate for her to make an appearance.</p><br/><p>He Changdi jumped out of the warm pen with his usual cold expression and exchanged a few words with the welcome party before personally escorting Chu Lian to her tent.</p><br/><p>Once Chu Lian had changed into a proper set of clothes and become presentable again, she came out to personally greet all of the friends who had been worried for her.</p><br/><p>Since Chu Lian was still living in the female camp, it wasn’t good for He Changdi to stay there, so he returned to his own camp and tent after giving Wenqing and Wenlan some instructions.</p><br/><p>Once he entered his tent, he could hear Xiao Hongyu and the others talking.</p><br/><p>Captain Guo and Zhang Mai hurried over after seeing He Sanlang enter the tent.</p><br/><p>Captain Guo patted his shoulders, “It’s good that Sister-in-Law is safe. Don’t think too much about all of this.”</p><br/><p>Zhang Mai chipped in with his own words of comfort.</p><br/><p>The two of them were much older than He Changdi and Xiao Hongyu, so they thought more than the others.</p><br/><p>Chu Lian was a woman after all. After getting kidnapped like that, even if she had her identity as an Honoured Lady to keep some from talking, there was plenty that other people could say about a woman taken out to the wilds by a pack of rogues…</p><br/><p>If rumours like those affected her reputation, it wouldn’t be good for the young couple.</p><br/><p>Captain Guo was afraid that He Sanlang would overthink things.</p><br/><p>He Sanlang was a little dumbfounded, which showed in his expression as he looked at his two older brothers. He replied helplessly, “What are you thinking about? Why would I even think like that?”</p><br/><p>When Captain Guo heard his response and saw that he seemed open-minded, he finally set down his worries. “You brat. I’m not worrying for you. Alright, it’s good as long as you understand. Sister-in-Law is a good lady, you had better not mistreat her.”</p><br/><p>During these years of peace, what kind of noble lady would come all the way out here to this desolate north and suffer through so much for the sake of her husband?</p><br/><p>Although Honoured Lady Jinyi’s words and actions showed maturity beyond her years, she was still a young lady who hadn’t even reached the age of sixteen.</p><br/><p>“Thank you for your concern, brothers. But you’ve worried too much for this matter. Rest assured, I’ve already ordered my men to seal their lips shut. Not many people know about what happened other than my trusted subordinates.” He Changdi was usually meticulous with his actions. Before leaving the main camp to look for Chu Lian, he had already settled the matters at hand in the army.</p><br/><p>Since he had the responsibility of being Chu Lian’s husband, he couldn’t let allow her reputation to be besmirched.</p><br/><p>Captain Guo nodded in admiration. He was also someone who would protect his wife with his life, so he understood why He Sanlang had done so.</p><br/><p>“Relax, I’ll take care of everything else in the army. I won’t let anyone spread the news.”</p><br/><p>When He Sanlang heard this, he made the rare gesture of bowing deeply to Captain Guo.</p><br/><p>The corners of Zhang Mai’s lips lifted up. “What are you being so formal for between us brothers?”</p><br/><p>Captain Guo burst out into laughter, “Let him bow, we deserve this gesture! Damn brat, take good care of your wife from now on.”</p><br/>\n</div>"}