{"title": "Chapter 420: Treatment (1)", "id": 420, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-420-treatment-1", "volume_title": "Volume 5", "body": "<h1>Chapter 420: Treatment (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian’s expression abruptly changed. She hadn’t expected He Changdi to get hurt.</p><br/><p>Before Manager Qin could say any more, she leaped from the hearth bed, even forgetting to put on her shoes in her haste.</p><br/><p>“Quick, lead me there!”</p><br/><p>Manager Qin had only given the situation in the outer court a cursory glance before rushing over to report to Chu Lian. The only thing he knew was that Third Young Master was badly injured.</p><br/><p>When He Changdi had been brought in by the guards, he was already in a coma.</p><br/><p>Without knowing more about his condition, Manager Qin didn’t dare to say anything else to Chu Lian. Thus, on the journey to the outer court, the atmosphere remained sombre and tense.</p><br/><p>Once they reached the central room of the outer court, they were met with the sight of a group of guards surrounding the soft bed in the center of the room. Amongst them was a sorry-looking Mo Chenggui, who stood to one side with an expression full of self-blame and guilt.</p><br/><p>When Chu Lian saw the slender figure lying in the center, her mind went completely blank. She hurried over to check on He Changdi’s injuries.</p><br/><p>The usual humour in her almond-shaped eyes was gone, replaced with anger and worry.</p><br/><p>The guards surrounding He Changdi shifted away upon seeing that it was their young madam who had come.</p><br/><p>Before Mo Chenggui could explain, Chu Lian was already throwing out questions in a cold tone. “Where is he injured? Hurry up and call for a physician!”</p><br/><p>Mo Chenggui moved his mouth without speaking at first, looking close to sobbing. When Chu Lian shot him a fierce glare, he gritted his teeth and replied, “Third Young Master fell from the mountain. The worst injury is on his right thigh and there are a few smaller injuries all over his body. We’ve already called a physician, he’ll be here soon.”</p><br/><p>Chu Lian cast a cold look at him before shifting away. Right now, she wasn’t in the mood to ask what exactly had happened on Mount Ah-Ming and how He Sanlang had gotten into this state.</p><br/><p>She ignored the customary reserve between men and women and reached out to take off He Changdi’s clothes.</p><br/><p>When Manager Qin noticed her movements, he knew that Third Young Madam wanted to inspect the wounds herself.</p><br/><p>Manager Qin was one of the calmer ones present. He quickly ushered the guards out and called Wenqing and Wenlan in to help.</p><br/><p>Mo Chenggui rushed over to stop Chu Lian when he realised that she wanted to check on He Changdi’s wounds herself. She wasn’t a doctor, and Third Young Master was injured all over. If she made his injuries worse by accident, he could die from it!</p><br/><p>However, before Mo Chenggui could reach Chu Lian, he was held back by Manager Qin.</p><br/><p>The space between Manager Qin’s brows was tightly furrowed as he stated coldly, “Leader Mo, Third Young Madam knows what she’s doing. The physician hasn’t arrived yet, but Third Young Master’s wounds can’t wait!”</p><br/><p>“But…”</p><br/><p>“But what? Are you going to tell me that you know what to do?”</p><br/><p>Mo Chenggui finally sunk into silence. How could he possibly know what to do in this case? The extent of his medical knowledge was to cover up any areas that were bleeding with bandages… If he were a physician, would he have waited until now to take action?</p><br/><p>Once Manager Qin saw that he had been placated, he ushered him off to one side and said, “Rest here, Leader Mo. When the doctor comes, Third Young Madam will definitely have some questions for you.”</p><br/><p>Although there weren’t any deadly wounds on Mo Chenggui’s body, he cut a sorry figure. He likely had some hidden wounds underneath his rumpled clothing. The thick fur cloak on him had traces of dried blood all over.</p><br/><p>With Wenqing and Wenlan as her helping hands, Chu Lian worked fast.</p><br/><p>He Changdi was covered in bloodstains, and there were cuts all over his body. Some of the wounds had been left exposed to the elements and were frostbitten, exacerbating his condition.</p><br/><p>However, Chu Lian simply couldn’t bring herself to think about the smaller wounds now. She took a deep breath to keep calm.</p><br/><p>Taking a pair of scissors from Wenqing, she began carefully cutting his right pants leg while making sure to avoid contact with his wounds.</p><br/>\n</div>"}