{"title": "Chapter 431: The Horrible He Sanlang (2)", "id": 431, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-431-the-horrible-he-sanlang-2", "volume_title": "Volume 5", "body": "<h1>Chapter 431: The Horrible He Sanlang (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chu Lian’s fingers were nimble and she quickly but carefully took off the bandages covering He Sanlang’s leg.</p><br/><p>She looked at the wound on his knee first and found that the wound had already scabbed over. The surrounding skin was also clean and dry, so there was nothing wrong with it.</p><br/><p>Chu Lian frowned and traced the wound upwards. She started checking on the injuries on He Sanlang’s inner thigh.</p><br/><p>Since He Sanlang couldn’t move his leg right now, Chu Lian had no choice but to move into another position and climb onto the bed. She kneeled on the inner side of the bed while bending over to take a good look at the wound.</p><br/><p>He Changdi hadn’t thought much of her inspection at first, but her unintentional pose made his thoughts run wild. His gaze flitted downwards, only to see her fair little face near a very important part of his body…</p><br/><p>He had already fallen for Chu Lian, and desperately wanted to be closer to her physically, so it was even harder to restrain his reaction.</p><br/><p>Chu Lian hadn’t noticed her lunatic husband’s response at all. She finished inspecting that wound on his right thigh and found that it was actually healing pretty well and that there was no problem with it.</p><br/><p>The realisation that he had been lying, coupled with how he had tried to stop her earlier, hit her like a ton of bricks. She instantly puffed up with anger.</p><br/><p>Due to her fury, her face flushed red and even her almond-shaped eyes were lit up with the fire of her rage.</p><br/><p>Chu Lian harrumphed. She looked up, about to vent her temper on He Changdi, when her gaze accidentally fell upon a part of his body that was a little abnormal right now.</p><br/><p>What could a thin pair of shorts hide?</p><br/><p>The excited Little Brother He stood out clearly.</p><br/><p>Chu Lian’s eyes widened in disbelief as all of the blood in her body rushed into her cheeks. Her blush even extended all the way down to her neck.</p><br/><p>It took Chu Lian a dazed two seconds before she quickly moved away. Following that, her limpid eyes directed towards He Sanlang in complaint.</p><br/><p>She gaped for a while as she tried to recover her lost wits. Finally, she spat out, “He Changdi, you pervert!!”</p><br/><p>In the whole of the Great Wu Dynasty, iHe Sanlang was like the only one who had ever been branded a pervert by his own wife.</p><br/><p>He Changdi was also both ashamed and frustrated at his own reaction. The roots of his ears were also completely red. However, he still managed to keep his aloof expression on his face as he stared at Chu Lian’s lobster-red face in a daze.</p><br/><p>After a while, he tried to explain in a raspy voice, “I didn’t do it on purpose, I couldn’t hold it back…”</p><br/><p>Chu Lian’s response was to shoot a fierce glare at him. The meaning behind it was clear: could you be any more shameless?</p><br/><p>He Changdi: …</p><br/><p>Chu Lian’s heart was thumping rapidly in her chest. Even though she had lived in the modern era for over twenty years, she had never experienced anything like this before. Her face was so red that it felt like it was on fire. She wanted to escape from this awkward situation as fast as she could.</p><br/><p>Chu Lian scrambled off the bed in a panic, intending to pull on her shoes and run away. However, the more panicked she was, the clumsier she became. As she was getting off the bed, she accidentally tripped over her own skirt and almost tumbled right off the bed.</p><br/><p>Luckily, He Sanlang had been watching her the whole time and was able to catch her at the right time. With a tug of his strong arms, Chu Lian landed in his embrace.</p><br/><p>Chu Lian had already gone through the whole spectrum of emotions by now. The fright from the near-fall shocked her into a dazed state. Bewilderment filled her eyes, softening her usual sharp wit and adding an extra trace of cuteness.</p><br/><p>Urged on by that lovely sight, He Changdi’s pupils dilated before he bent over to capture those rosy red lips. The soft and slightly cool feeling that met his lips sent a wave of enjoyment crashing through his whole body.</p><br/><p>Ever since they had shared their first kiss in the tent, the memory of it would pop up in his mind from time to time. Each time he reminisced about it, he would feel even more drunk on the feeling of love.</p><br/><p>Chu Lian hadn’t expected this sudden attack from He Sanlang at all. Her almond-shaped eyes widened as far as they could go and she struggled in his grasp. Her muffled grunts didn’t do anything to move him and she didn’t have any strength to push him away. She wanted to try kicking instead, but when she remembered that his leg was still heavily injured, she stuck to using only her hands to push against his chest.</p><br/><p>However, Chu Lian’s weak arms were like ants trying to push down a tree. Once He Changdi had tasted enough of the sweetness of her lips, he gently pushed past her teeth to brush against her tongue.</p><br/><p>He Sanlang had become even more familiar with this after the first time.</p><br/><p>The all-consuming kisses made Chu Lian short of breath. Although the force of her arms against his chest slowly weakened, He Changdi wasn’t willing to let her off so easily.</p><br/><p>The hands he had placed on her back started wandering and caressing her. Although she was dressed in layers of clothing due to the cold weather, he was still able to hold on to her slender waist easily. With a slight pull of his hand, she was now flush against his body.</p><br/><p>It was only when Chu Lian’s face had flushed completely red again that He Sanlang finally let her go. Even then, he wasn’t willing to part with her. He showered kisses lovingly on her fluttering eyelids, the bridge of her nose, the fine corners of her lips and her dainty little chin.</p><br/><p>Chu Lian had almost fainted over from the lack of air during their kiss. Her mind was a complete blank while her body felt like a wet noodle. All she could do was gasp for air right now, so she didn’t have the spare energy to mind the light kisses that he was dropping on her face.</p><br/><p>However, it didn’t take long for her to recover. When she finally realised that there was something hard jabbing her in the waist, Chu Lian’s soul instantly returned to her body.</p><br/><p>Right as He Changdi’s trail of kisses had reached Chu Lian’s slender neck, she shot out a hand to cover his face.</p><br/><p>“He Sanlang, why are you so horrible!”</p><br/>\n</div>"}