{"title": "Chapter 453: A Little Fatter (2)", "id": 453, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-453-a-little-fatter-2", "volume_title": "Volume 5", "body": "<h1>Chapter 453: A Little Fatter (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He Changdi shared a carriage with Prince Jin.</p><br/><p>They hadn’t met in a long time but they still got along like they hadn’t parted.</p><br/><p>Prince Jin seemed much more haggard than before. There was now a gloomy cast to his abnormal azure eyes. He had also become thinner.</p><br/><p>He Changdi glanced at his close friend and personally filled his cup.</p><br/><p>The alcohol warming up over the brazier today was milk wine, a local specialty of the north. Its alcohol content was low and it was nourishing for the body. They wouldn’t get drunk on it either, so it fit this occasion very well.</p><br/><p>“Your Highness, did you find anything while investigating the corruption in Zhangzhou?”</p><br/><p>The gentle and refined Prince Jin kept his silence for a while, before raising the small cup and downing the alcohol like it was a form of release. He then picked up the pot of wine and downed another three cups before he managed to calm his emotions.</p><br/><p>“Ah-di, I found something.”</p><br/><p>He Sanlang’s eyes were as dark as the boundless night sky when he looked towards his friend. Nothing changed in his expression, as if he had already expected the answer.</p><br/><p>Prince Jin’s brows drew together and he tightened his grip on the cup, “Ah-di, you knew this would happen a long time ago, didn’t you?”</p><br/><p>He Sanlang also downed his cup of milk wine in one go. His silence was as good as an answer.</p><br/><p>“Back then, before you left for Liangzhou. You suggested that I should investigate this case because you already guessed what was happening.”</p><br/><p>Bitterness surfaced at the bottom of He Sanlang’s heart. He hadn’t guessed it at all. He had experienced it all himself once! That agony was something he didn’t want his friend to experience again. Since he had reincarnated, he had to let his good friend see for himself the true nature of that pair of mother and son!</p><br/><p>“Even though I’m a close friend of Your Highness, there are some things that you wouldn’t believe even if I said it outright.” He Sanlang finally spoke up.</p><br/><p>The light in Prince Jin’s azure eyes faded even more. He stared into thin air blankly for a while, before letting out a chuckle, “You’re right. If I hadn’t seen it for myself… If It hadn’t investigated it myself… I wouldn’t have believed it even if you said it right to my face.”</p><br/><p>However, now the ugly truth had been presented right in front of him. He had no other choice but to believe it!</p><br/><p>What a joke!</p><br/><p>So the people he had cared for the most had always thought of him as a chess piece that could be sacrificed at any time.</p><br/><p>He was merely a shield for the Crown Prince.</p><br/><p>In He Sanlang’s past life, Prince Jin had been framed and sentenced to death because he had blindly trusted the ones he cared about so much.</p><br/><p>Back then, even though He Sanlang had warned him, Prince Jin hadn’t taken what he had said seriously.</p><br/><p>Much later when the matter had been brought to light, it had been revealed that Prince Jin had been framed. By that time, despite wanting to save his best friend, He Sanlang had his hands tied because House Jing’an itself had been in imminent danger.</p><br/><p>The two men fell into silence within the carriage.</p><br/><p>After a long period, Prince Jin finally spoke, “Ah-di, I feel terrible. Drink with me.”</p><br/><p>He Sanlang didn’t speak a word. His only action was to pour out wine for Prince Jin personally.</p><br/><p>Prince Jin finally recovered a little of his spirit after taking a nap in the carriage. He tidied up his hair, got off the carriage and switched to horseback together with He Changdi.</p><br/><p>The two handsome men, one dressed in black and the other in navy, riding side by side under the warm sun, formed an extremely eye-catching scene.</p><br/><p>One of them had a warm and elegant aura, while the other was more cool and stern.</p><br/><p>Prince Jin’s smile evoked thoughts of spring, while He Sanlang’s handsome features were cloaked in a cold yet remarkable air.</p><br/><p>They were in the outskirts of the city where the roads were wide and the weather was sunny today. Chu Lian couldn’t take being stuck in the carriage any longer, so she asked Sima Hui to teach her how to ride a horse.</p><br/><p>Sima Hui specially ordered her female adjutant to prepare a gentle chestnut mare for Chu Lian, as well as a proper saddle, before she began teaching Chu Lian the basics.</p><br/><p>Chu Lian had always been both intelligent and daring. In less than thirty minutes, she was already able to use the reins to control the horse and was trotting down the highway.</p><br/><p>Right at this time, they heard the sounds of fast hoofbeats from behind, so the two ladies turned around in confusion.</p><br/><p>It was Prince Jin and He Changdi who were coming their way.</p><br/><p>Although it wasn’t Sima Hui’s first time going to the capital, she had never met the Fourth Prince before.</p><br/><p>The man who was riding his mount over from a distance had eyes that were of a strange colour. Although there was nothing reflected in those light-coloured eyes, Sima Hui felt as if she saw a shadow of herself in them.</p><br/><p>Afraid that Sima Hui might not comport herself with the proper manners towards Prince Jin, Chu Lian hurriedly mouthed the words ‘Fourth Prince’ at her.</p><br/><p>With the help of Chu Lian’s hint, a trace of realisation dawned upon Sima Hui and she recalled the little that she had heard about him.</p><br/><p>She had previously heard that the fourth prince was different from most people, but she hadn’t thought that it referred to his eyes.</p><br/><p>In the imperial family, different-coloured eyes weren’t considered auspicious. Considering the fact that his birth mother, Concubine Xian, had passed away when he was still a child, one could imagine that his days growing up in the palace weren’t easy.</p><br/><p>Sima Hui had also lost her parents when she was a child, so she sympathised with Prince Jin’s plight. A hint of kindness and tenderness showed in the gaze she directed at him.</p><br/><p>Prince Jin’s abnormal eyes aside, his looks were on par with He Changdi’s. They were both extraordinarily handsome men that were hard to come by.</p><br/><p>When He Sanlang and Prince Jin approached them, Chu Lian greeted the prince with a smile, “Greetings, Your Highness.”</p><br/><p>“Jinyi, we haven’t met for a few months, but you’ve somehow gotten a little fatter instead in the north.”</p><br/>\n</div>"}