{"title": "Chapter 461: Reunion at Qingxi Hall (2)", "id": 461, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-461-reunion-at-qingxi-hall-2", "volume_title": "Volume 5", "body": "<h1>Chapter 461: Reunion at Qingxi Hall (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Her action caused He Changdi’s entire body to tense up. In a low voice, he berated her, “Chu Lian, behave yourself.”</p><br/><p>Chu Lian let go of him with a grunt. She flashed her little fist in his face, before she threatened with a whisper into his ear, “You’re not allowed to say that I’m fat.”</p><br/><p>He Changdi didn’t know know whether to laugh or cry. His wife was really ‘stupid’ sometimes. She couldn’t even tell when he was joking.</p><br/><p>Also, what she should be worrying about now wasn’t her weight, but whether there were any marks left on his neck…</p><br/><p>This heartless woman.</p><br/><p>He Changdi still had a sense of propriety. When they reached the entrance of Songtao Court, he let Chu Lian down and switched to holding her small, soft hand.</p><br/><p>A young couple acting sweet in their own courtyard was one thing. If they did the same outside, then it would be inappropriate. Others would look down on Chu Lian as the lady-in-charge of the third branch and deem her undignified. </p><br/><p>He Ying and her daughter were living in Qingxi Hall now, so they arrived very early.</p><br/><p>They had already been seated next to Matriarch He for half an hour.</p><br/><p>Today was a rare reunion for House Jing’an. It wasn’t just the young couple from the third branch who had returned, but the second son, He Changjue, had also returned to the estate.</p><br/><p>Even the grounded Madam Zou and the bedridden Countess Jing’an had also come.</p><br/><p>Pan Nianzhen sat beside her mother, wringing the handkerchief in her hands. Her heart was in turmoil.</p><br/><p>She was preoccupied with thinking about what her mother had told her earlier in their room. </p><br/><p>Her second cousin would be coming for the reunion dinner tonight. The current head of the family had three sons and Second Cousin was the only one who was still single. He was working as one of the Left Military Guards now. Recently, he had gone to Zhangzhou with Prince Jin to investigate a major case. Although he hadn’t gotten as much merit as her third cousin, his future wasn’t looking too bad. </p><br/><p>Each year, the Emperor would pick out around ten people from the Left Military Guards to become imperial guards. Anyone would die for the position of accompanying and protecting the Emperor. </p><br/><p>Furthermore, Second Cousin was already considered rather old for a bachelor. He had turned twenty-five this year. At his age, it would be hard to find a suitable noble lady in the capital for marriage. Therefore, a young girl of marriageable age like her with a clear family background and suitable social status would be the most ideal partner.</p><br/><p>If she married him, then she would be able to stay in Grandmother’s house. Under Grandmother’s care, her future wouldn’t be too bad.</p><br/><p>Although He Ying had a lot of shortcomings, it was undeniable that she genuinely cared about her daughter’s future.</p><br/><p>She was right. Marrying into House Jing’an would be the best outcome for Pan Nianzhen.</p><br/><p>Pan Nianzhen’s mood was uneasy. Although she was timid, she wasn’t stupid. At times, she was able to see things even more clearly than her mother. </p><br/><p>It was true that it would be the best if she could marry her second cousin. However, young girls at her age tended to have fantasies about love and be a little rebellious. </p><br/><p>Her heart beat uncontrollably when she thought back to that day at Plum Pavilion in Prince Wei’s Estate and that unexpected glimpse.</p><br/><p>She had grown up in a small town in Siyang and she had never seen such a perfect man before. Furthermore, he had purposely turned towards her with a gentle smile. At that moment, it was as if all the plum blossoms around her had bloomed at once. The elegant fragrance of plum blossoms had filled her head.</p><br/><p>It was hard for her to forget. How could there be such a good-looking man in this world?</p><br/><p>Later on, she had asked around and discovered that he was the top scholar from last year and Old Duke Ying’s prized disciple. The Emperor had placed him in an important position despite his young age. Furthermore, he wasn’t engaged yet. She had heard that his parents died early and his family had been poor. The only reason he had been able to participate in the Imperial Examination was due to the support of Old Duke Ying.</p><br/><p>Since he wasn’t from a noble house, there was nothing standing in the way of her becoming his wife.</p><br/><p>No matter what, she was currently a legitimate-born young miss of House Jing’an and Marquis Anyuan’s cousin!</p><br/><p>As long as her mother was willing to bring it up with Grandmother and as long as her third cousin-in-law was willing to put in a good word for her when she visited her maiden home, then it wasn’t impossible for her to marry Xiao Bojian.</p><br/><p>While her second cousin was good, she still preferred the dangerously handsome top scholar, Xiao Bojian. </p><br/><p>If she could marry him, her uncle could also provide him some guidance and support. She would also be able to stand proudly in front of Xiao Bojian.</p><br/><p>Pan Nianzhen was one-sidedly making her own plans right now, as if all the good men in the world had to stand in line for her to pick as she chose. As if they would marry her just because she decided on them. Who knew where her confidence came from?</p><br/><p>There was a commotion at the entrance of Qingxi Hall. Senior Servant Liu’s joyful voice filtered in from the entrance, shocking Pan Nianzhen back to reality.</p><br/><p>Senior Servant Liu spoke from the bottom of her heart, “You’ve finally returned! The matriarch has been missing you dearly! She has been asking this old servant about you at least once a day. Hurry, come in, all of you!”</p><br/><p>A steady and captivating voice sounded in response, “I’ve caused momo to worry.”</p><br/><p>It was such a pleasant voice, like the poignant sound of a zither tapping on one’s heartstrings, causing a person’s body to turn numb.</p><br/><p>Pan Nianzhen quickly shifted her gaze towards the entrance of the parlour. There, she saw a man as handsome as the bright moon walking in with his hands clasped behind his back.</p><br/><p>His features seemed to be carefully sculpted. There was a cold air around him while his eyes were like frozen lakes with impenetrable depths. His thin lips were slightly pursed together, making him look fickle, yet irresistible. </p><br/><p>He looked handsome, tall and heroic. Dressed in an ordinary set of clothing as he was, he still gave off a noble aura.</p><br/><p>Compared to Xiao Bojian, this person in front of her seemed more cool, reserved and imposing. Her heart beat incessantly in her chest.</p><br/><p>Pan Nianzhen broke out into a blush and stammered out shyly, “Second… Second Cousin…”</p><br/>\n</div>"}