{"title": "Chapter 463: He Erlang Grows Up (2)", "id": 463, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-463-he-erlang-grows-up-2", "volume_title": "Volume 5", "body": "<h1>Chapter 463: He Erlang Grows Up (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Matriarch He was full of smiles, “Stop kneeling and get up. Look at you two. Both of you have lost weight. Do eat more later.”</p><br/><p>While Matriarch He was happily asking all sorts of questions and showing great concern towards He Changdi, it had become awkward for Pan Nianzhen who was at one side.</p><br/><p>When Pan Nianzhen had called out ‘Second Cousin,’ she had drawn a glare from He Ying in response. She had also made a joke of herself in front of the maidservant that served her in Qingxi Hall.</p><br/><p>Luckily, the maidservant had managed to avoid laughing out loud by covering her mouth. She bent over slightly and whispered into Pan Nianzhen’s ear, “Miss Pan, that was Third Young Master, not the Second Young Master of our estate.”</p><br/><p>Pan Nianzhen’s entire body stiffened up and her face turned ashen.</p><br/><p>What?</p><br/><p>This… this was Third Cousin?</p><br/><p>So he was really Third Cousin, who was already married!</p><br/><p>Actually, Pan Nianzhen had already started questioning He Changdi’s identity when Chu Lian had followed behind him and he had held her hand disregarding other people’s eyes.</p><br/><p>It was just that her heart was reluctant to believe in it.</p><br/><p>By the time the maidservant had explained his identity to her, it was already too late to make herself numb.</p><br/><p>So that remarkable gentleman who had just walked past her was really the married Third Cousin…</p><br/><p>While staying in the Jing’an Estate, she had heard the servants gossip about Third Cousin’s appearance. However, it was even more astonishing seeing him in person today.</p><br/><p>His looks could be compared to that top scholar she had seen at the Plum Pavilion in Prince Wei’s Estate!</p><br/><p>Moreover, the Emperor bestowed had bestowed the title of Marquis Anyuan to Third Cousin after his great achievements at the northern border!</p><br/><p>Right now, the peerage of House Jing’an was merely that of a count! Third Cousin’s title was even one rank higher than her grandfather’s.</p><br/><p>Pan Nianzhen couldn’t contain the glow in her eyes. She didn’t dare to lift her head, but out of the corner of her eyes, she looked at Chu Lian with much more envy and resentment.</p><br/><p>Soon after He Changdi and Chu Lian had settled down into their seats, the maidservant waiting at the entrance of the parlour announced the arrival of Second Young Master.</p><br/><p>The curtains wavered slightly at first before they were lifted by someone on the outside with great force. At the same time, a tall and burly young man walked in gallantly. </p><br/><p>He Erlang was dressed in a black official’s robe. He had a sturdy figure and a dark complexion. He looked very similar to He Dalang, but his facial features were more refined and prominent. He gave off the impression of a very masculine young man.</p><br/><p>He Erlang’s appearance didn’t really fit the current aesthetics of the Great Wu Dynasty. However, if he had lived in modern times, he would have been quite popular among girls. He looked exactly like a typical manly man.</p><br/><p>That was Chu Lian’s opinion of He Erlang, but it didn’t mean that Pan Nianzhen had the same thoughts.</p><br/><p>She was shocked stiff once He Changjue entered the parlour. In an instant, Pan Nianzhen’s face turned deadly pale and she lowered her head in fright.</p><br/><p>She really hated ‘boorish’ men like He Erlang. He looked no different than the shirtless labourers working on the docks. He Erlang looked like a classic example of a simple-minded person with all brawn and no brains.</p><br/><p>She lowered her head, pursed her lips pursed, and remained silent.</p><br/><p>Yet, He Erlang didn’t even notice the sudden addition of a new cousin.</p><br/><p>He smiled and went up to pay respects to his grandmother, “May Grandmother remain healthy as always. Grandson gives a belated New Year greeting to Grandmother.”</p><br/><p>Matriarch He gave He Erlang a glare, “A belated New Year? Don’t you know what date it is? It’s already ten days into February.”</p><br/><p>He Erlang rubbed the back of his head and laughed sheepishly as he was helped up by Matriarch He.</p><br/><p>Anger rose up in Matriarch He while looking at the cause of the thorn in her heart, “You’re not allowed to run off this year! I’ve heard that the Emperor intends to let you join the Imperial Guards. You had better seize this opportunity. Since you’re in the capital now, let’s also take care of your marriage as well this year. Just take a look around you! In this entire capital, are there any young masters around your age that are still single?! Are you trying to make this old lady and your parents die of frustration?!” </p><br/><p>He Erlang normally hated it when the elders in the family mentioned marriage. Whenever the topic came up, he would lose his temper and patience. His next course of action was usually to avoid returning to the estate after that. However, his attitude had been completely reversed this time .</p><br/><p>He smiled and bent over at the waist to hold on to Matriarch He’s arm. He looked like a big circus bear nodding and bowing to please people.</p><br/><p>“Grandmother, I’ve made you worry in the past. This year, I’ll listen to you and bring back a Granddaughter-in-law for you.”</p><br/>\n</div>"}