{"title": "Chapter 472: Conjugal Love (1)", "id": 472, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-472-conjugal-love-1", "volume_title": "Volume 5", "body": "<h1>Chapter 472: Conjugal Love (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Once all of the wine had slid down her throat, he twined their tongues together in a dance until Chu Lian was gasping for breath. It was only when her hands tightened around the lapels of He Changdi’s sleep robe that he finally let her go.</p><br/><p>Chu Lian’s face was completely red and she didn’t even know whether it was from the heat of the alcohol or He Changdi’s passionate kiss.</p><br/><p>She gulped air down into her burning lungs and glared at her husband in complaint.</p><br/><p>However, her almond-shaped eyes were misted over with tears now, shining with the reflection of the lantern light and looking especially innocent. That lovely sight was pushing the last remnants of He Changdi’s control.</p><br/><p>He took in a deep breath himself, as if trying to calm the rising tides in his body.</p><br/><p>He Changdi’s gaze fixed upon the woman before him as his pupils dilated. He shifted his body, preparing to start another passionate kiss.</p><br/><p>Chu Lian’s heart was about to leap out of her chest from how nervous she was. She quickly raised her hands to stop him.</p><br/><p>She complained pitifully, “He Changdi, it’s all your fault! My mouth is filled with the taste of alcohol now. I don’t like it… Can you let me up to rinse it out?”</p><br/><p>When He Sanlang’s only response was to continue staring at her with sealed lips, Chu Lian couldn’t help the twitch at the corner of her mouth.</p><br/><p>Her watery eyes darted from side to side in thought before she moved her body back. She tried putting on an eagerly attentive tone, “Husband, I saw that you didn’t eat much earlier. Why don’t we order some supper? Xiyan mentioned that she made some red date and bird’s nest porridge and she’s keeping it warm on the stove. I’m a little hungry now too.”</p><br/><p>He Changdi finally spoke up in a husky voice, the tail end of his sentence rising with implication, “Lian’er, are you worried that I won’t have enough strength later tonight?”</p><br/><p>Chu Lian stiffened up in surprise. It took her a second before she realised what he meant.</p><br/><p>Her face exploded into a furious blush once again. She hadn’t expected that this gloomy fellow would turn into such a perverted scoundrel in front of her!</p><br/><p>Chu Lian stammered, not even daring to look at him now.</p><br/><p>“N… Not at all…”</p><br/><p>“Is there anything else you’d like to say now, Lian’er? Just say it all at once. You probably won’t be able to speak later.” He Changdi purposely emphasised his words again to hint at what was coming up, causing the blush on Chu Lian’s cheeks to glow even brighter.</p><br/><p>Chu Lian was looking everywhere except at He Changdi right now.</p><br/><p>Since they had both drunk the nuptial wine, there was a light scent of alcohol on their breaths.</p><br/><p>An idea sparked in Chu Lian’s mind and she quickly said, “We just ate at Grandmother’s place and we just drank some wine. You probably haven’t taken a bath yet, right? I’ll go and ask Wenqing and the rest to prepare the bath!”</p><br/><p>After blurting all of that out, she tried to climb off the bed. However, He Sanlang’s leg was in her way. Of course he wouldn’t be letting her off so easily.</p><br/><p>Chu Lian huffed as she shoved his leg away with all her might. She had just managed to take a step forward on the soft carpet at the bottom of the bed when He Changdi grabbed hold of her slender waist yet again without any effort.</p><br/><p>The nightclothes Chu Lian was wearing were simply too see-through. Her curves were completely visible under the mint-coloured robe that fell down to their ankles. He could see the loose pink pants and light green top she had underneath; even the shiny strap of her halter top underwear was visible in the dim light.</p><br/><p>He Changdi’s pupils dilated. With a slight pull of his arm, Chu Lian was already back in bed.</p><br/><p>He leaned over her as his wandering palm caressed the soft skin around her waist.</p><br/><p>Squished under her husband, Chu Lian didn’t have the energy to think about her seductive nightwear any longer. She stared up at him innocently with her wide, watery eyes, looking exactly like a little rabbit waiting to be eaten.</p><br/><p>“You really aren’t going to bathe?”</p><br/><p>The soft and gentle tones of Chu Lian’s voice made He Changdi stiffen up even more.</p><br/><p>He reached out with one hand to stroke her smooth, porcelain cheeks. With a puff of breath by her ear, he spoke huskily, “I bathed when I came back to the estate earlier. There’s no need to waste any more time.”</p><br/>\n</div>"}