{"title": "Chapter 477: Early Morning (2)", "id": 477, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-477-early-morning-2", "volume_title": "Volume 5", "body": "<h1>Chapter 477: Early Morning (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Xiyan looked at Fuyan from the corner of her eyes as she changed her clothes. She felt that Fuyan was acting rather strange tonight, but she hadn’t been able to find out anything after questioning her. In the end, she decided to let it go.</p><br/><p>The light in the room was quickly snuffed out. Fuyan reached for the letter under her pillow in the dark, her eyes wavering. Finally, she gritted her teeth and made her decision.</p><br/><p>Chu Lian slowly opened her eyes. Her mind was still in a haze since she had just woken up. However, once she moved, her whole body began to ache and she almost cried out loud.</p><br/><p>Memories from last night suddenly rushed into her mind like a tidal wave. Chu Lian was stunned by her recollections for a moment before annoyance and anger overtook her mind.</p><br/><p>That He Sanlang! Last night, he had actually ignored her wishes and tortured her like that!</p><br/><p>Chu Lian turned over and noticed that He Changdi wasn’t there. She reached out to touch the bedsheets beside her and realised that the area where he had been lying was already cold.</p><br/><p>She wrinkled her brows and prepared to call for a servant to come in.</p><br/><p>Wenqing heard the slight movement from outside and quietly entered the bedroom. She stood beside the bed, where the curtains had been let down, shielding Chu Lian from her gaze. She asked in a soft tone, “Third Young Madam, do you need this servant’s assistance?”</p><br/><p>Chu Lian hadn’t expected Wenqing to be waiting outside. Blood instantly rushed into her cheeks.</p><br/><p>She gave an awkward cough before asking in her slightly hoarse voice, “What time is it? Where’s Third Young Master?”</p><br/><p>Although He Changdi had been bestowed the title of Marquis Anyuan and an official position, he hadn’t split off from the family yet. Their elders, Matriarch He, Countess Jing’an, and Eldest Young Madam, were also present in the estate, so everyone in the Jing’an Estate still called him Third Young Master. Thus, Chu Lian was still Third Young Madam.</p><br/><p>Wenqing smiled and replied, “Third Young Madam, please don’t worry. It’s only around seven in the morning. Third Young Master went to the martial arts arena an hour ago. “</p><br/><p>It was February right now, so it was still chilly in the capital. Although the bedroom was heated, it was much more comfortable to stay in bed.</p><br/><p>Since it was still early, Chu Lian couldn’t be bothered to wake up. She hadn’t gotten a good rest anyways. She spoke to Wenqing briefly before turning right around and going back to sleep.</p><br/><p>Wenqing smiled and tiptoed back out of the room.</p><br/><p>Third Young Madam had probably been tired out last night. Before Third Young Master had gone to the martial arts arena, he had instructed her to let Third Young Madam sleep more. Even if Third Young Madam wanted to get up, she would have had to persuade her otherwise.</p><br/><p>He Changdi came back about half an hour later.</p><br/><p>Wenqing and Wenlan, who were now on duty in the outer room, handed him a wet towel.</p><br/><p>He Sanlang’s gaze swept over them, “Is your young madam awake?”</p><br/><p>The corners of Wenqing’s lips were still tilted upwards with humour, “She woke up once half an hour ago and asked after Third Young Master. Then she went back to sleep.”</p><br/><p>He Changdi’s stern and icy face softened a little. He handed back the towel in his hand before striding into the bedroom with his hands clasped behind him.</p><br/><p>It was just a little over an hour since he had last seen her, but he was already starting to miss her terribly. He wanted to see that lovely, sweet face of hers immediately.</p><br/><p>Chu Lian was still deep in slumber when she felt something ticklish on her nose. She impatiently reached out with one hand, wanting to brush it off.</p><br/><p>Her slender wrist emerged from the loose sleeve of her nightgown. The little strength that she used was nothing to He Sanlang.</p><br/><p>There were a few obvious red spots on her pale wrist, which looked strangely similar to the marks on her neck.</p><br/><p>The light in He Changdi’s deep eyes darkened. He held her fair arm and started dropping light kisses over the marks on her arm.</p><br/><p>Next, he gently tucked her arm back into the warm blankets.</p><br/><p>He took off his shoes and shifted closer to Chu Lian before pulling her into his embrace, blanket and all.</p><br/><p>That action finally woke Chu Lian up. She opened up her almond-shaped eyes, looking slightly dazed with a lovely blush on her face.</p><br/>\n</div>"}