{"title": "Chapter 486: Roast Duck (1)", "id": 486, "volume": 5, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-486-roast-duck-1", "volume_title": "Volume 5", "body": "<h1>Chapter 486: Roast Duck (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It was hard to hold back his emotions, so he was about to catch Chu Lian for a round of intimate snuggling when she abruptly rejected him.</p><br/><p>Chu Lian’s fair hands covered his thin lips, “You can’t! I have to meet Princess Wei in a short moment.”</p><br/><p>He Changdi did his best to restrain himself and simply groped her chest a little. He whispered something softly into her ear.</p><br/><p>Whatever he said made Chu Lian flush bright red. She pressed her lips together, struggling to find a response.</p><br/><p>He Changdi watched her with his black pupils as his hands started misbehaving again. Chu Lian knew that he had a domineering personality, so she quickly pleaded for mercy and agreed to his request.</p><br/><p>He Sanlang finally broke out into a smile.</p><br/><p>“If only it was already night time.”</p><br/><p>Chu Lian’s reaction to his words was a harsh pinch to his arm.</p><br/><p>Unfortunately, He Changdi’s biceps were rather tough, so it was Chu Lian’s fingers that hurt instead.</p><br/><p>After a few minutes, Chu Lian asked, “What happened to your aunt?”</p><br/><p>She had been curious about Eldest Madam’s past since yesterday. However, He Sanlang had turned into a pervert the moment he had returned, so she hadn’t been able to find a chance to ask.</p><br/><p>Luckily, they had some time now.</p><br/><p>The only ones who knew about matters in the estate from two decades ago were the matriarch’s old servants. They were also likely to be the matriarch’s closest aides, so she couldn’t just ask them about it. The original novel hadn’t mentioned anything about He Ying and her daughter either, so if she wanted to know more, the quickest way would be to ask He Changdi.</p><br/><p>He had plenty of useful subordinates around and he could even ask his mother, Countess Jing’an, so he probably knew most of it.</p><br/><p>He Sanlang poked Chu Lian’s forehead with a finger, “You’re only thinking to ask your husband now? I thought you weren’t interested in that matter anymore!”</p><br/><p>The trust and reliance his wife had for him had satisfied He Sanlang’s male ego.</p><br/><p>A soothing warmth suffused his heart.</p><br/><p>Chu Lian glared at him. She had been wanting to ask for a while, but this great pervert hadn’t given her the chance!</p><br/><p>When He Changdi had been born, Eldest Madam He Ying had already married off to Siyang, so he didn’t have any impression of this aunt of his. It was Countess Jing’an who actually had more of an impression of He Ying in the past.</p><br/><p>The majority of what He Sanlang knew of his aunt had come from his mother.</p><br/><p>He Ying was Matriarch He’s only daughter and the Eldest Miss of the He Estate back then.</p><br/><p>When Count Jing’an and He Ying had still been young, Matriarch He had followed the old Count to the battlefields. The foundations of the He Family hadn’t been very stable back then and they had a pitiful number of family members.</p><br/><p>Count Jing’an, He Yanwen, was seven years older than this little sister, He Ying. When the old Count had gone to battle, He Yanwen had been old enough to follow his parents in the army. However, He Ying had only been two or three then, so Matriarch He had no choice but to leave He Ying behind in the care of her mother-in-law. She also left some trusted maidservants in the old He residence to watch over her daughter.</p><br/><p>The couple had then taken their son with them to the army, leaving only He Ying and her grandmother behind in the family residence.</p><br/><p>Matriarch He’s mother-in-law was already old then and she spoiled her granddaughter. She had been the one to raise He Ying alone until she turned seven. In all that time, Matriarch He and the old Count had only returned three times.</p><br/><p>It wasn’t until the old Count had made a significant achievement and gotten his noble title that the He family finally established their foothold in the capital.</p><br/><p>The couple was finally able to take their young daughter back to live with them.</p><br/><p>Unfortunately, the young He Ying had already been groomed into a pampered and unruly brat by her grandmother.</p><br/><p>Following that, when the He Family finally settled down in the capital and Matriarch He wanted to correct He Ying’s upbringing, she had her mother-in-law obstructing her on one hand, while He Ying’s personality had already been formed on the other. She wasn’t able to achieve her goal. Later on, although her mother-in-law had already passed away, He Ying had already grown into a young lady.</p><br/><p>Matriarch He knew that her daughter was too obstinate to change, so she tried her best to restrain her daughter so that she wouldn’t cause any trouble.</p><br/><p>When it finally came to He Ying’s coming-of-age, Matriarch He looked all over the capital for a good husband for her.</p><br/><p>However, on the day before her coming-of-age, thanks to her abrupt fever, the doctor actually found out that He Ying was pregnant!</p><br/><p>Matriarch He fainted from anger on the spot.</p><br/><p>After some investigation, they found out that the child in her belly belonged to a handsome young manservant in their estate… Matriarch He almost fainted once again.</p><br/><p>She had finally found a good husband for He Ying, yet their unmarried young miss had actually gotten pregnant! How could she marry her to a good noble family then?</p><br/><p>Thus, all she could do was to cancel the engagement.</p><br/><p>In order to conceal the whole matter, she and Senior Servant Liu personally forced the abortion medicine into her very own daughter. The manservant that had gotten the young miss pregnant was beaten to death.</p><br/><p>To keep this scandal from affecting the standing of their family, Matriarch He and the old Count hardened their hearts and married He Ying off to faraway Siyang…</p><br/><p>In contrast to He Changdi’s calm narration of the events, Chu Lian’s eyes were wide with shock.</p><br/><p>The corners of her mouth twitched. She really wanted to say that Eldest Madam was too stupid… but she kept it to herself considering He Ying was still He Changdi’s aunt.</p><br/><p>However, He Sanlang seemed to know what she was thinking anyway. He snorted, “Lian’er, you don’t have to keep your thoughts to yourself. Aunt is an idiot to me. Although her lover was a childhood sweetheart of hers, it was absolutely shameless of her to have done something like this as a legitimate miss of a noble house.”</p><br/><p>From the way He Ying had acted in the past few days, they could tell that she had been spoiled rotten by the old Count’s mother. Furthermore, no matter how much the matriarch had tried to hide it, the circumstances made it nearly impossible. A legitimate young miss sent off to a small city faraway in Siyang to marry, especially in such a rushed manner, as well as her usual unruly reputation amongst the noble circles, would set tongues wagging. Anyone with half a mind would be able to guess at what had happened.</p><br/><p>No wonder she had been excluded from society even after returning as a widow after so many years.</p><br/>\n</div>"}