{"title": "Chapter 505 - Who Said The Child is Beyond Saving? (2)", "id": 505, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-505-who-said-the-child-is-beyond-saving-2", "volume_title": "Volume 6", "body": "<h1>Chapter 505 - Who Said The Child is Beyond Saving? (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 505: Who Said The Child is Beyond Saving? (2)</strong></p><br/><p>Even Chu Lian was feeling some sympathy for Miaozhen by this point, so He Changqi had it even worse.</p><br/><p>Madam Zou caught sight of the heartache and guilt that flashed across his expression. Even as she showed a frown on her face, a perverted sense of enjoyment rose in her heart.</p><br/><p>Miaozhen’s tragic wails could be heard in the parlour from time to time, causing everyone’s expressions to sink.</p><br/><p>Even though Chu Lian had ways to absolve herself from suspicion, this wasn’t a good time to speak.</p><br/><p>It was right at this time that Great Doctor Miao, who had been acting as a bystander, picked up his medicine box and walked to the middle of the parlour.</p><br/><p>He stroked his white beard and said with a wide smile, “What’s wrong, why are you all fretting so? Matriarch, so much worrying isn’t good for your health! Isn’t it just a child? Who said the child is beyond saving?”</p><br/><p>His casual words downplayed the situation and shocked everyone to the core!</p><br/><p>Matriarch He and Countess Jing’an were so surprised that they leapt out of their seats.</p><br/><p>They stared at him with disbelief, as if he had just spoken in gibberish.</p><br/><p>“What did you just say? The child can still be saved?” Countess Jing’an asked in a soft voice.</p><br/><p>Before Great Doctor Miao could nod, Doctor Qian retorted aggressively, “You old fogey, what kind of nonsense are you spouting? I took Miss Miaozhen’s pulse myself, her child is already dead in her womb!”</p><br/><p>“Exactly! How is that even possible? Miaozhen bled so much!” Madam Zou couldn’t bear it any longer. Fear and alarm warred within her heart; if Miaozhen’s child could actually be saved, wouldn’t all her efforts go to waste?</p><br/><p>As she spoke, she kept shooting signals at Doctor Qian with her eyes.</p><br/><p>The smirk on Great Doctor Miao’s eyes deepened as he took in the expressions of every person in the parlour.</p><br/><p>“You wouldn’t let me take a look earlier. Well, now that you’ve all determined that the child has perished, what harm is there in letting me do it now? It’s not like things can get any worse.”</p><br/><p>Great Doctor Miao’s words couldn’t get any more blunt, but everything he had said was true!</p><br/><p>They had already accepted the worst possible outcome. If he managed to save the baby, wouldn’t it be an unexpected surprise?</p><br/><p>They weren’t stupid, so He Changqi immediately said, “Lead Great Doctor Miao in.”</p><br/><p>A senior servant immediately led Great Doctor Miao into the inner room.</p><br/><p>Chu Lian hadn’t thought that Great Doctor Miao still had something up his sleeves at such a crucial time.</p><br/><p>As Great Doctor Miao entered the room, Madam Zou and Doctor Qian’s expressions turned a little strange.</p><br/><p>Everyone had abruptly lost the mood to interrogate their suspect. Madam Zou herself was feeling guilty, so she couldn’t be bothered with Chu Lian at this moment . It would also be hard for He Ying to go up against Chu Lian alone, so as much as she wanted to, she couldn’t act right now.</p><br/><p>Chu Lian was helped over to a seat at the side of the parlour by Xiyan. He Changdi casually took a seat right beside her. No one noticed as husband and wife exchanged gazes.</p><br/><p>There was a profound look in He Changdi’s eyes. He was getting overwhelmed by his emotions, and the desire to take her away from this place was growing. He reached his hand out to take hold of the small hand that Chu Lian had rested on the side table.</p><br/><p>Chu Lian immediately noticed his intentions and quickly drew her hand away.</p><br/><p>She subtly shook her head at him.</p><br/><p>Since she had made it this far, she couldn’t squander all of their efforts! There were still some people who hadn’t shown themselves!</p><br/><p>She also wanted to make He Changdi understand that she would be able to resolve this matter without a scratch even without him. She wanted to show him that she wasn’t a woman who had to rely on a man for everything!</p><br/><p>Similarly, she had the same expectations for her man!</p><br/><p>They were husband and wife, not master and dependent. They had to stand shoulder to shoulder as equals!</p><br/><p>He Changdi was feeling a little depressed and empty inside. In this moment, he could somehow sense that Chu Lian would be able to live happily even on her own, if he ever messed up his relationship with her.</p><br/><p>When his thoughts veered in that direction, it felt as if his heart had been pierced by a million needles. He withdrew his hand and formed it into a fist.</p><br/><p>Impossible! As long as he willed it, even if he had to tie her down to keep her with him, he wouldn’t give her any chance to escape!</p><br/><p>Everyone in the parlour was thinking of different things, while most of them were absent-mindedly awaiting news from the inner room.</p><br/><p>Fifteen minutes later, when they could no longer hear the anguished wails of Miaozhen, the inner room gradually quietened down.</p><br/><p>In another fifteen minutes, everyone was starting to become impatient.</p><br/><p>Having spent so much time in silence, He Changqi was now icily calm.</p><br/><p>As the eldest son of the family, he was more thoughtful than most. After some consideration, he broke the silence by saying, “It seems like Great Doctor Miao can’t provide us any answers anytime soon. Grandmother, Mother, Third Brother, Third Sister-in-Law, it’s getting late. You should all go and take a rest, I’ll stay here to keep watch.”</p><br/><p>Countess Jing’an found her son’s words reasonable. When she saw how exhausted the matriarch looked, she realised that it was indeed better if they didn’t continue waiting here and voiced out her agreement.</p><br/><p>In the end, everyone returned to their courtyards to rest.</p><br/><p>When Chu Lian and He Changdi left, they left with him in the lead and her lagging behind, so that those who were attentive would see that there was a problem between them.</p><br/><p>While supporting Matriarch He out of the parlour, Muxiang glared at Chu Lian’s figure with hatred. Her red lips parted in a malicious sneer, giving her the appearance of a monster looking at its prey.</p><br/><p>Back at Qingxi Hall, Muxiang helped the matriarch freshen up before taking her leave and entering a small study. She beckoned a maidservant over and whispered into the maidservant’s ear. The green-clothed servant nodded and left Qingxi Hall, disappearing into the darkness of the night.</p><br/>\n</div>"}