{"title": "Chapter 517 - An Invitation from House Ying (2)", "id": 517, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-517-an-invitation-from-house-ying-2", "volume_title": "Volume 6", "body": "<h1>Chapter 517 - An Invitation from House Ying (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 517: An Invitation from House Ying (2)</strong></p><br/><p>Senior Servant Zhong couldn’t tell what Chu Lian wanted to do, so she could only try asking, “Third Young Madam, are you really going to hand over Guilin Restaurant?”</p><br/><p>Chu Lian returned to reality and showed a faint smile. She was still young. Her features were more mature as compared to the previous year. Now that she had lost some baby fat and gained a little more elegance and womanly grace, she seemed even more beautiful than before.</p><br/><p>When she smiled like this, in a mischievous and charming manner, no one could keep their eyes away from her.</p><br/><p>“I’m not going to hand it over to them! I’m not that kind!”</p><br/><p>The unexpectedly childish tone startled Senior Servant Zhong into a smile. Her unrest and unease washed away with her master’s reply.</p><br/><p>“So Third Young Madam has a plan already? Then this old servant can stop worrying blindly.”</p><br/><p>Although Third Young Madam was young, everyone in Songtao Court respected her, even an old servant like Senior Servant Zhong who was already halfway into her grave.</p><br/><p>Senior Servant Zhong smiled once again, “Since that’s so, this old servant won’t disturb Third Young Madam any longer. This old servant will take her leave.”</p><br/><p>Chu Lian waved in acknowledgement of Senior Servant Zhong’s dismissal. When the old servant stood up, she seemed to have thought of something else as she spoke up again, “This old servant heard from Wenqing and Wenlan just now. Third Young Madam was injured in the north. Please do take care of nourishing your body and recovering from your old wound now that you’re back. This old servant does not have many talents, but this old servant has studied fertility treatments for women before. Yesterday, this old servant also consulted with Great Doctor Miao on this matter. From today onwards, this old servant will help Third Young Madam with nourishing the body for fertility.”</p><br/><p>Senior Servant Zhong was one of He Sanlang’s servants, so there was nothing she had to be cautious about. Chu Lian nodded in agreement.</p><br/><p>Senior Servant Zhong was happy to receive her agreement and quickly left the study, preparing to make some soup for Chu Lian.</p><br/><p>Actually, Wenlan had told her about Third Young Master and Third Young Madam’s nightly activities the past two nights. Third Young Master was brimming with vigour at his age, but Third Young Madam was much younger. Her body seemed so slender and fragile, it couldn’t possibly bear the full force of Third Young Master’s affections. She had to help Third Young Madam nourish her body so that the couple would be able to have a child as soon as possible.</p><br/><p>Chu Lian wouldn’t have expected Senior Servant Zhong’s motives to be so complex. Once the old servant had left, Chu Lian had dived right back into her work. By the time dusk had fallen, she finally walked out of the little study and sent couriers off with letters and the designs for jewellery.</p><br/><p>Xiyan came over to her with an invitation in hand and a troubled expression.</p><br/><p>Chu Lian was seated at the desk with Wenqing gently kneading her shoulders. She had holed herself up in the study for an entire afternoon, so her shoulders had gotten a little sore. Wenqing’s massage was helping to relax them again.</p><br/><p>“Who sent that invite?” Chu Lian glanced over at Xiyan as she asked.</p><br/><p>Xiyan presented the invitation respectfully to Chu Lian with both hands, “Third Young Madam, it’s from House Ying.”</p><br/><p>Chu Lian was startled for a moment. After the whole incident with Miaozhen’s miscarriage, she had almost forgotten that they had bumped into Chu Qizheng on the way back from the Wei Estate and what Chu Qizheng had said to them.</p><br/><p>She flipped open the invite and scanned through its contents.</p><br/><p>Heh, so it was for Chu Yuan’s coming-of-age ceremony.</p><br/><p>She was about a year older than Chu Yuan, so it was indeed time for Eighth Miss Yuan to come of age.</p><br/><p>Although she wasn’t the original ‘Chu Lian’ and she didn’t know much about what ‘Chu Lian’ had faced in the Ying Estate, her servants would mention the past from time to time, especially Xiyan and Senior Servant Gui who had been with her the longest.</p><br/><p>She recalled what Senior Servant Gui had told her.</p><br/><p>At the coming-of-age for this body of hers, no guests had been invited at all. It had been a simple dinner with family where her elders had taken care of all the ceremonial steps. Although she hadn’t thought much of it since she hadn’t experienced it personally, the corners of Senior Servant Gui’s eyes would turn red whenever she spoke of it.</p><br/><p>Now looking at the gold-embossed invite for Chu Yuan’s ceremony, it was clear that the difference of treatment for both of Chu Qizheng’s daughters was like heaven and earth.</p><br/><p>Xiyan was standing right next to Chu Lian, so she could see the contents of the invite as well. When Third Young Madam remained silent, she assumed that her master was thinking of past memories and her eyes slowly filled up with hot tears.</p><br/><p>She wanted to tell Third Young Madam not to go, but this was Eight Miss Yuan’s coming-of-age ceremony. As terrible as the days at the Ying Estate had been for Sixth Miss, she was still Eighth Miss’s older sister. She couldn’t choose not to go after receiving an invite.</p><br/><p>“Third Young Madam…” Xiyan called out to Chu Lian worriedly.</p><br/><p>Chu Lian returned to her senses and set the invite down on the table. When she turned to look and saw that her silly handmaid was already close to tears, she found it a little funny. She teased Xiyan, “What’s wrong? Who bullied you? Tell me who it was and I’ll serve justice for you!”</p><br/><p>The mischievous grin on Chu Lian showed how little she had been affected by the invite.</p><br/><p>Xiyan hurriedly shook her head and squeezed out an awkward smile, “No, no, this servant is fine. No one dares to bully this servant.”</p><br/><p>Chu Lian shot a mock glare at her, “Then why are you crying? Go wash it off with some warm water. You’re already an adult, why are you still such a crybaby?”</p><br/><p>When Xiyan left, Senior Servant Gui piped up, “Third Young Madam, it’s fine if you don’t want to go.”</p><br/><p>Based on Chu Lian’s current status, it really was as Senior Servant Gui said. No one would hold her to it or gossip about her if she didn’t go. However, it was her maiden house that had sent the invite. If she refused to socialise with them at all, others might not mention it to her face, but they would still look down on her behind her back.</p><br/><p>Chu Lian blinked innocently, “Of course I’m going. I’m doing so well for myself, why wouldn’t I go?”</p><br/><p>After saying so, she winked playfully at Senior Servant Gui.</p><br/><p>When Senior Servant Gui got over her startlement, she broke out into a smile as well.</p><br/><p>That’s right. There was no reason for Third Young Madam not to go. Out of all the misses in House Ying, the house she had married into was the most highly ranked. Furthermore, Third Young Master was completely devoted to Third Young Madam. He had even received the title of marquis recently, together with an important position at court. With these conditions, what did Third Young Madam have to fear when returning to the Ying Estate?</p><br/>\n</div>"}