{"title": "Chapter 519 - Lack of Table Manners (2)", "id": 519, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-519-lack-of-table-manners-2", "volume_title": "Volume 6", "body": "<h1>Chapter 519 - Lack of Table Manners (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 519: Lack of Table Manners (2)</strong></p><br/><p>Chu Lian was astonished; it was obvious that she hadn’t expected such words to come from her mother-in-law at all.</p><br/><p>It seemed like even a ‘naive’ person like her mother-in-law could tell that there was something wrong with the matriarch’s attitude.</p><br/><p>Countess Jing’an’s description was extremely tactful. The way she had put it was that the matriarch was dissatisfied with their branch of the family? How could the matriarch be dissatisfied with the third branch? He Sanlang was her most accomplished grandson, and she was probably more fond of him than his brothers! There was no way she’d be dissatisfied with him, so Matriarch He was obviously only dissatisfied with just her alone.</p><br/><p>People often said that it was hard to be a wife and marry into someone else’s family. Chu Lian hadn’t felt that way at all in House Jing’an previously, but now she was experiencing exactly what the saying meant for herself.</p><br/><p>Chu Lian grinned. She was very grateful that her mother-in-law cared about her enough to give her such advice.</p><br/><p>“Don’t worry, Mother, I’m aware of that.”</p><br/><p>Countess Jing’an spoke a few more lines of advice before letting Chu Lian go off.</p><br/><p>Fifteen minutes later, Chu Lian arrived at Qingxi Hall.</p><br/><p>While walking down a corridor, she bumped into Senior Servant Liu who had just came out of the warm parlour.</p><br/><p>When Senior Servant Liu noticed Chu Lian, she hastily stepped forward to welcome her.</p><br/><p>“Third Young Madam,” Senior Servant Liu had already greeted her although she was still some distance away.</p><br/><p>While Senior Servant Liu had a smile on her face, it didn’t reach her eyes.</p><br/><p>Chu Lian suddenly figured out that there was something else going on.</p><br/><p>“<i>Momo</i>, where are you heading to?</p><br/><p>While Chu Lian was speaking, Senior Servant Liu took the chance to raise her hand and make a gesture while everyone else was focusing on Chu Lian.</p><br/><p>Chu Lian’s expression froze before turning into a smile, “Since <i>momo</i> is busy, don’t let me hold you back. I’ll go pay my respects to Grandmother now.”</p><br/><p>Senior Servant knew that Chu Lian had understood from the look in her eyes. She nodded, curtseyed towards Chu Lian, and quickly walked out of the bounds of Qingxi Hall.</p><br/><p>Chu Lian paused in her tracks for a moment. Senior Servant Liu had made a gesture indicating the act of ‘drinking wine’. This obviously referred to a place where wine was served– a restaurant. The only restaurant that could be related to her was Guilin Restaurant.</p><br/><p>Just as Senior Servant Zhong had said, the matriarch had probably set her heart on taking Guilin Restaurant back.</p><br/><p>The signal from Senior Servant Liu was likely a warning that the matriarch was going to mention this matter to her today.</p><br/><p>This was out of Chu Lian’s expectations; she hadn’t thought that they would become so impatient as to actually snatch ‘food’ right off her plate. What a complete lack of table manners.</p><br/><p>Before Chu Lian even entered the heated room, a servant had already scurried in to report her arrival.</p><br/><p>Her aunt-in-law, He Ying, was in the room. She gave a little cough, glanced at Matriarch He, and smiled.</p><br/><p>“Mother, it won’t be too good if you speak later. Let me take the burden off your hands and be the bad person.”</p><br/><p>The matriarch thought about it for a moment before nodding.</p><br/><p>Chu Lian was led into the warm room by a maidservant.</p><br/><p>She then greeted them both as a junior family member.</p><br/><p>Matriarch He was seated in the middle with Muxiang behind her, earnestly massaging the matriarch’s shoulders.</p><br/><p>“Sanlang’s wife, there are no strangers here. Have a seat.”</p><br/><p>The edges of Chu Lian’s mouth curved upwards. After thanking the matriarch for her kindness, she took an empty seat on the matriarch’s right side.</p><br/><p>“Has Sanlang come back yet?”</p><br/><p>“My husband mentioned that he would be having dinner outside and that he’ll be home late tonight.”</p><br/><p>……</p><br/><p>Matriarch He asked a few more superficial questions, clearly trying to make some small talk, before falling silent.</p><br/><p>Eldest Madam He Ying was getting a little impatient. She gauged the matriarch’s mood from her expression first, before her eyes darted from side to side. She interrupted the conversation as if she had just thought of something, “Mother, if I remember correctly, your birthday is coming soon. Are we going to hold a large celebration this year?”</p><br/><p>Chu Lian glanced at her aunt-in-law with her eyebrows raised slightly. While her lips were obviously raised into a smile, He Ying had a weird feeling as if Chu Lian had already seen through her motives long before she had even mentioned it.</p><br/><p>The matriarch showed a bitter smile in response to the question, “Dalang’s recent divorce hasn’t reflected well on our house. Let’s forget about celebrating my birthday this year, it’s not a major milestone anyway. When the time comes, we can just have a nice reunion dinner with family. Besides, our estate is lacking in funds now, it’s better if we save more.”</p><br/><p>He Ying let out a startled expression, “Mother, how can that do? Even if we’re low on funds, we’d rather save more from our daily spending than just let your birthday pass without a proper celebration! Don’t you agree, Sanlang’s wife!?”</p><br/><p>A faint smile hung on Chu Lian’s face, but she didn’t answer her aunt-in-law’s question.</p><br/><p>Chu Lian’s indifference and refusal to take the bait made He Ying extremely vexed.</p><br/><p>A new idea sparked in He Ying’s mind and she changed strategies, “Mother, how about this? Tell me how much our estate needs. If the amount is within my capabilities, I’ll help to make up for it, alright? No matter what, you must be able to have a proper birthday celebration.”</p><br/><p>He Ying shot Muxiang a look while speaking.</p><br/><p>Muxiang looked at the matriarch awkwardly, and the matriarch helplessly glared at He Ying.</p><br/><p>“Miss Ying, do you really think your mother is that useless? To actually need your contributions? Let me tell you frankly, our estate is indeed severely lacking in funds. A large part of it is due to Madam Zou, but we’re not in as dire a state as you think. Besides, we still have Sanlang’s wife’s Guilin Restaurant helping to keep us afloat. Once Guilin Restaurant reopens, we’ll be able to survive this period of hardship just fine.”</p><br/><p>Chu Lian was laughing inside. After the many twists and turns, they had finally moved on to the main topic. It had truly been tough on this mother-daughter pair.</p><br/>\n</div>"}