{"title": "Chapter 527 - How Couples Should Communicate (2)", "id": 527, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-527-how-couples-should-communicate-2", "volume_title": "Volume 6", "body": "<h1>Chapter 527 - How Couples Should Communicate (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 527: How Couples Should Communicate (2)</strong><span class=\"hidden-text\">This story is completely free to read on volarenovels~ Please support my translations on the original source!</span></p><br/><p>Chu Lian had actually been taking a chance. She had been betting on He Changdi’s feelings for her. If he truly loved her with all his heart and treated her as his wife, then he would definitely speak up. However, if he had given up and left, their relationship as husband and wife would have ended right there.</p><br/><p>It seemed like He Changdi couldn’t bear waiting any longer. Before Chu Lian could reply, he had already stepped forward, picking up the petite woman seated behind the desk and carrying her with ease over to the chaise at the side.</p><br/><p>He gently set her down on the inside of the chaise before settling down on the outside. The chaise wasn’t very wide, so Chu Lian was pushed close to the wall. The limited amount of space meant that she was pressed against He Changdi’s solid chest and that they were facing each other eye-to-eye in close proximity.</p><br/><p>The space between Chu Lian’s brows crinkled up. She didn’t like being trapped this way, it felt more like an interrogation than anything. She reached out her arms, intending to crawl over to the other side of the chaise and escape He Changdi’s control.</p><br/><p>He Sanlang seemed to have seen through her intentions, as he retracted one of his outstretched legs and crossed it over his other knee instead. The position of his raised leg just happened to block off Chu Lian’s escape route.</p><br/><p>“Let’s clear up everything today, like this.” He Changdi fixed his eagle-eyed gaze on her, destroying her chances of escape.</p><br/><p>With a wall behind her, He Changdi’s hard chest in front, as well as having her entire body within his reach, Chu Lian was like a little bunny who had fallen into a trap. No matter how much she struggled now, she wouldn’t be able to get free.</p><br/><p>He Changdi wrapped one arm around her waist and pulled her closer towards him so she wouldn’t have to lean against the cold wall. He then set his other palm on the wall next to the side of her face so he loomed over her in a textbook ‘kabedon’ pose. Chu Lian’s heart was about to leap out of her chest from the tension.</p><br/><p>He Sanlang was just way too imposing in this position. Chu Lian felt that she couldn’t summon up any courage like this, so she lowered her eyes, unwilling to meet with He Changdi’s shadowed gaze.</p><br/><p>When she dipped her head, quivering golden wings drew He Sanlang’s gaze to her dark hair, where two brilliant, life-like butterfly ornaments were dancing with her sudden movement.</p><br/><p>His heart clenched as he held his breath unconsciously. The rage burning in his heart faded a little.</p><br/><p>He remembered these golden butterflies clearly. He had chosen them himself. When he had picked them out, he had been imagining how lovely they would look on her. His imagination hadn’t been too far from reality now that he was looking at the real thing.</p><br/><p>The ice in He Changdi’s gaze melted away, forming into pools of affection instead. He stroked Chu Lian’s smooth hair and touched the two golden butterflies gently, setting off their quivering wings once more. His magnetic voice was as soft as it had ever been, “Beautiful. They suit you very well.”</p><br/><p>Chu Lian had been busy thinking of how she should navigate the conversation ahead. When the compliment hit her out of the blue, she looked up with a confused expression, meeting He Sanlang’s tender gaze straight on. As he quickly lowered his hand, she realised that he had been referring to the accessories she was wearing.</p><br/><p>A hint of sweetness blossomed within her heart. Who wouldn’t be touched by a compliment from their loved one?</p><br/><p>However, Chu Lian’s mind remained clear as glass. She wouldn’t be led astray by a simple sentence from He Changdi.</p><br/><p>Her brows formed into a frown, “He Sanlang, since you want to have a proper discussion, don’t change the topic.”</p><br/><p>While He Changdi’s features remained unchanged, the emotions in his eyes were completely different now.</p><br/><p>Chu Lian had worn a simple and elegant azure dress today, made up of a long skirt and a long-sleeved blouse. Since the little study was heated, she hadn’t put on a cloak or vest.</p><br/><p>While the winter dress was made with thick fabric, there was only a single layer of cloth. The skirt started at her chest, and there was a crape myrtle flower embroidered right there. The light yellow flower rose and fell along with her breathing, making for a mesmerising sight.</p><br/><p>He Changdi felt his throat dry up instantly. His Adam’s apple wobbled as he gulped hard and pulled his gaze away with difficulty. Finally, he spoke.</p><br/>\n</div>"}