{"title": "Chapter 521 - I’ll Let You Have It (2)", "id": 521, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-521-i%E2%80%99ll-let-you-have-it-2", "volume_title": "Volume 6", "body": "<h1>Chapter 521 - I’ll Let You Have It (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 521: I’ll Let You Have It (2)</strong></p><br/><p>Both Matriarch He and He Ying hadn’t expected Chu Lian to let go of Guilin Restaurant so easily.</p><br/><p>To them, this was truly an unexpected surprise, as they had prepared many more ways to convince her that they hadn’t even used.</p><br/><p>They were overjoyed right now. Despite the slight sarcasm contained in Chu Lian’s speech, they couldn’t care less about that.</p><br/><p>Would a wolf that had just stolen a large juicy steak mind a few barely visible shards of bone on the meat?</p><br/><p>Matriarch He was ecstatic. As long as she had Guilin Restaurant, she wouldn’t have to worry about providing funds for her daughter or dowry for her granddaughter.</p><br/><p>“Sanlang’s wife, I know that this matter is unfair to you. Don’t worry, I’ll definitely make it up to you.” Matriarch He spoke with passionate sincerity, as if she would actually make it up to Chu Lian.</p><br/><p>Chu Lian got up and curtseyed towards the matriarch.</p><br/><p>“It’s getting late, I shall not bother Grandmother and Aunt any further. I’ll take my leave now.”</p><br/><p>With Guilin Restaurant in hand, the matriarch and He Ying had no need for Chu Lian any longer, so the matriarch waved her hand to dismiss Chu Lian.</p><br/><p>Once Chu Lian and her maidservants had left the parlour, He Ying hurriedly opened the wooden box and took out a stack of deeds.</p><br/><p>She carefully examined the official seal on the deeds under the light of a lantern for a long moment before bursting into an excited grin, “Mother, these deeds are all real!”</p><br/><p>Matriarch He glared at her daughter, “Of course they are. She wouldn’t dare to fool me with fake deeds!”</p><br/><p>In actual fact, there were even extra pages tacked on to the original Guilin Restaurant deed that Chu Lian had just returned her. These were the deeds of the neighbouring properties that had been bought when extending Guilin Restaurant’s rear court.</p><br/><p>He Ying’s eyes were glimmering as she stared at the deeds in her hands, as if she was looking at chests of gold.</p><br/><p>She asked eagerly, “Mother, since Sanlang’s wife has returned the deed for Guilin Restaurant, how about I go over in person tomorrow and tell the the managers to hurry up with the reopening?”</p><br/><p>Before the matriarch even had the time to consider it, He Ying had already grabbed onto the matriarch’s elbow as she pleaded like a spoilt child, “Mother, I’m your own flesh and blood, won’t you rest easy if I’m the one doing things? I can bring Miss Pan out and buy her some jewellery too. It’s been a while since she has come to the capital, but she doesn’t have any decent sets of accessories! She’s young, so she can’t be wearing our old accessories. Ah, I heard that the jewellery sets of Treasure Pavillion are the best in the capital, I want to check out that place tomorrow.”</p><br/><p>The matriarch turned to look at her obedient granddaughter who had been silent the whole time, and finally nodded.</p><br/><p>“Alright, alright, go ahead. She’s at the age where she’s blossoming and she should dress up more.”</p><br/><p>The ladies connected through three generations were all in high spirits tonight.</p><br/><p>Having seen everything that had happened, there was some doubt on Muxiang’s face.</p><br/><p>She didn’t understand why had Chu Lian had agreed to their demands and let go of Guilin Restaurant so easily.</p><br/><p>The earnings of Guilin Restaurant were nothing to scoff at. If it were anybody else, they’d probably be lamenting inside.</p><br/><p>At this point, she felt that she couldn’t make sense of House Jing’an’s Third Young Madam at all.</p><br/><p>When Chu Lian returned to Songtao Court, Senior Servant Zhong and the others had already prepared dinner for her.</p><br/><p>When Chu Lian had her meals, she didn’t like having servants standing around, so she usually only kept one person by her side.</p><br/><p>Xiyan stayed in the parlour to serve the food, while Wenqing was called over by Senior Servant Zhong and Senior Servant Gui.</p><br/><p>When Chu Lian had returned from Qingxi Hall just now, the two had learned that Third Young Madam had been bullied in Qingxi Hall from Xiyan’s offhand comment.</p><br/><p>Thus, the two senior servants had been searching for a chance to grab hold of Wenqing for the full story.</p><br/><p>Wenqing had a bitter expression as she grudgingly said, “The matriarch asked for Guilin Restaurant back.”</p><br/><p>Senior Servang Zhong was utterly shocked. Although she had heard the news from servants in Qingxi Hall, the fact that this had happened so quickly was out of her expectations.</p><br/><p>“The matriarch personally asked for it?”</p><br/><p>Wenqing nodded. The profits from the restaurant were such a huge sum, of course the matriarch had to ask for it personally.</p><br/><p>“Then…” Senior Servant Gui asked hesitantly.</p><br/><p>“Third Young Madam agreed to it. Third Young Madam had me bring the deed beforehand, and she handed it over to the matriarch just like that.”</p><br/><p>Senior Servants Zhong and Gui were both stunned silent. It took them quite a while to recover.</p><br/><p>Wenqing sighed, “Third Young Madam had no choice in the matter. After all, Guilin Restaurant originally belonged to the matriarch. When the matriarch personally requested for it back, our Third Young Madam couldn’t possibly reject her.”</p><br/><p>The two senior servants nodded. That was indeed the case, but the matriarch was also too unreasonable.</p><br/><p>How could an elder act like that?</p><br/><p>The three sighed in frustration. They wanted to complain on behalf of Chu Lian, but in the end they were just servants, and they weren’t in any position to speak.</p><br/><p>However, Senior Servant Zhong thought that there was something strange about the whole matter.</p><br/><p>Third Young Madam had said to her that she wouldn’t let the matriarch and the others have their way, yet she had returned Guilin Restaurant to the matriarch so easily, just why…</p><br/><p>Senior Servant Zhong shook her head with a bitter smile.. She couldn’t understand Third Young Madam’s actions at all.</p><br/><p>Wenqing was right. Third Young Madam had no choice but to hand over Guilin Restaurant, or she would have started a fight with the matriarch.</p><br/><p>If Chu Lian and the matriarch turned against each other, the one that would suffer the most would be their Third Young Master.</p><br/><p>In the end, Third Young Madam had borne with the matriarch’s unreasonable demands for Third Young Master’s sake.</p><br/><p>Senior Servant Zhong inwardly decided that she would have to inform Third Young Master of this matter when he returned.</p><br/><p>As for He Changdi, he wasn’t out busy on official business like Chu Lian had thought. He was actually in a private residence right now, interrogating someone.</p><br/>\n</div>"}