{"title": "Chapter 534 - Health is Important (1)", "id": 534, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-534-health-is-important-1", "volume_title": "Volume 6", "body": "<h1>Chapter 534 - Health is Important (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 534: Health is Important (1)</strong></p><br/><p>He Sanlang’s face instantly turned black. He first swept his icy gaze over to Xiyan, who was standing beside Chu Lian. Xiyan’s whole body froze as a troubled expression appeared on her face. Following that, He Sanlang strode towards Countess Jing’an and bowed in greeting.</p><br/><p>“Sanlang, you’ve come too! Come, come sit beside Mother.”</p><br/><p>Countess Jing’an was clearly happy that her youngest son had come to visit her. He Changdi quickly sat down beside his mother. Once seated, he extended his long arm and took away the plate of pear slices on the table beside Chu Lian.</p><br/><p>When the toothpick that Chu Lian was holding landed on thin air, she looked at him in astonishment.</p><br/><p>What was wrong with He Changdi? She couldn’t even eat a few pieces of pear now?</p><br/><p>Countess Jing’an was also finding it strange, “What’s wrong? Since Lian’er likes to eat pears, why not let her have a few more pieces? I haven’t been eating them much so it’s a waste to leave them lying around here anyway. Have the maidservants take some back with you later. Mother has too many pears to finish!”</p><br/><p>The first half of her words was directed at He Sanlang and the latter half was directed towards Chu Lian.</p><br/><p>Before Chu Lian could happily agree and thank her mother-in-law, He Changdi had already rejected the offer, “No need. Mother, you should keep the pears and eat them yourself. If you can’t finish them all, then give them to the servants.”</p><br/><p>Chu Lian hadn’t been expecting He Sanlang to say that, so she secretly gave him a glare. However, He Changdi was seemingly ignorant of the complaint in her eyes. He continued to speak to his mother, “Pears are cold by nature. Lian’er is susceptible to the cold, so it wouldn’t be good for her health if she eats too much.”</p><br/><p>Countess Jing’an initially wanted to put in a good word or two for Chu Lian, but she held her tongue when she saw that her son was doing it for the sake of his wife’s health. Instead, she turned to comfort Chu Lian.</p><br/><p>“Lian’er, Sanlang is right. We have to take good care of our own health. It’s better to eat fewer of these ‘cold’ fruits. It’s still chilly outside now, so you should make sure to keep your body warm…”</p><br/><p>Countess Jing’an had been bedridden for many years and had been drinking different medicines during that whole time. She had become half a doctor after going through a prolonged period of illness. During the long suffering, she had also learned plenty of methods to maintain good health. Once she started on the topic, she couldn’t stop talking.</p><br/><p>Chu Lian couldn’t interrupt her since the countess was her elder. All she could do was to listen earnestly and put on an enlightened expression, while suffering in her heart.</p><br/><p>Now that the root of Countess Jing’an’s illness was gone, her health had improved by leaps and bounds. She had also become more livelier than before. With her new-found energy, she actually managed to talk about the subject of health for an hour.</p><br/><p>When the countess finally realised what she had done, she felt embarrassed for a moment.</p><br/><p>However, since it was only her son and daughter-in-law before her, the moment of embarrassment faded away quickly.</p><br/><p>She was happy for the young couple instead, as she saw the genuine concern in the gaze that her son directed at his wife.</p><br/><p>“Alright, I hope you don’t find me too naggy. But you must pay attention to your health no matter how busy you are. Lian’er, as a woman, it’s especially important for you to take good care of your body. That’s all from me today. It’s getting late now. I won’t keep you two for dinner, so go back to eat by yourselves.” Countess Jing’an could also see the suffering expressions on the young couple’s faces from her long lecture, so she waved her hand to dismiss them.</p><br/><p>Even He Sanlang hadn’t been able to withstand his mother’s endless nagging. He breathed a sigh of relief after leaving the courtyard while holding Chu Lian’s hand.</p><br/>\n</div>"}