{"title": "Chapter 535 - Health is Important (2)", "id": 535, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-535-health-is-important-2", "volume_title": "Volume 6", "body": "<h1>Chapter 535 - Health is Important (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 535: Health is Important (2)</strong></p><br/><p>Chu Lian had only managed to eat half a plate of snow pears at her mother-in-law’s. Her craving hadn’t been satisfied and she wanted to eat more!</p><br/><p>She didn’t think that He Changdi would start minding what she ate, so she wasn’t very happy.</p><br/><p>“He Changdi, I want to eat pears.”</p><br/><p>Chu Lian complained to him directly. They had made an agreement today that they would tell each other everything and that they wouldn’t have cold wars or sulk by themselves.</p><br/><p>He Sanlang wanted to laugh when he heard the rare childish tone from Chu Lian.</p><br/><p>He whispered, “Do you think I’m just playing with you? You can’t eat cold-natured fruit right now. I’ll explain it to you when we get back.”</p><br/><p>“Ah?” Chu Lian was slightly baffled. What was going on? Why were fruits suddenly forbidden?</p><br/><p>She had even ate ice cream during winter back in modern times and nothing had happened to her health.</p><br/><p>When he finished speaking, He Changdi quickly dragged Chu Lian back to Songtao Court.</p><br/><p>It was already dinner time. Senior Servant Zhong had already received the report that the young couple was on their way back, so she began to instruct the maidservants to prepare dinner.</p><br/><p>By the time Chu Lian and He Changdi arrived, there was already a table full of food in the parlour.</p><br/><p>When Chu Lian looked over all the foods on the table, she couldn’t drum up any of her appetite.</p><br/><p>She was feeling stuffy and uncomfortable since He Changdi had pulled her into a brisk walk back from Countess Jing’an’s courtyard. She wanted to eat something cold right now, but everything on the table was steaming with heat. She really didn’t have any appetite.</p><br/><p>However, He Changdi had pulled her down to sit at the table.</p><br/><p>Chu Lian sighed, then turned her head to instruct Baicha, “Bring me a cup of tea first!”</p><br/><p>Baicha was surprised, “Third Young Madam, do you mean sencha?”</p><br/><p>Chu Lian nodded in affirmation.</p><br/><p>Baicha thought it was strange and glanced in askance at Xiyan. Didn’t Third Young Madam dislike sencha? Didn’t she normally only drink honey water or honeydew juice?</p><br/><p>Baicha was stopped by He Changdi’s icy gaze right when she was about to go prepare the sencha.</p><br/><p>Chu Lian noticed that Baicha wasn’t moving. When she traced the cause back to He Changdi, she exclaimed in astonishment, “He Changdi, do you have a problem? You’re not even going to let me drink some tea!”</p><br/><p>He Sanlang’s face darkened after being reprimanded by his wife. He waved his hand to order the attending servants to leave.</p><br/><p>A moment later, they were the only ones left in the parlour.</p><br/><p>He Changdi sat beside Chu Lian in the quiet and empty parlour. Since there wasn’t anyone else in the parlour, he tugged Chu Lian onto his lap with an easy wave of his arm.</p><br/><p>With Chu Lian’s petite figure, trying to resist He Sanlang was like an ant trying to move a tree. She struggled a little to no avail, so she gave up.</p><br/><p>Seeing that she was still trying to resist at this time, He Sanlang reached towards the softness of her chest and squeezed it. He lowered his voice and scolded her, “Are you going to behave?”</p><br/><p>She didn’t know if it was something to do with the tonic that she had drunk, but Chu Lian’s whole body felt like it was on fire when he casually teased her. She stiffened up, not daring to move again.</p><br/><p>She gritted her teeth and smacked He Sanlang’s hand away. She replied with rising anger, “He Changdi, if you don’t give me an explanation now, then don’t expect to stop me from eating pears!”</p><br/><p>He Changdi didn’t know how he should react. She usually acted so clever, but she was actually just a glutton. She couldn’t be kept from any of her cravings at all.</p><br/><p>He Sanlang put some strength into his arms and cuddled Chu Lian. He let out a light sigh and asked, “I believe the maidservants have already told you about the situation with your body, right?”</p><br/><p>“My body’s slightly cold?”</p><br/><p>He Changdi nodded.</p><br/><p>“The nourishing tonic that you’re drinking twice a day was decided upon after much deliberation from Great Doctor Miao and Senior Servant Zhong. It contains some special medicinal herbs that will help to supplement the warmth of your body, but you have to avoid cold-natured foods. While you’re drinking this tonic, you’re not allowed to eat anything cold.” He Sanlang patiently explained to her.</p><br/><p>Chu Lian instantly wailed when she heard his words. She knew that it was difficult to balance the inner systems of a body. Great Doctor Miao was already being nice by not prescribing her those really bitter medicines. But drinking this nourishing soup was also suffering for her!</p><br/><p>The corners of Chu Lian’s mouth twitched, “How long do I have to drink this tonic for?”</p><br/>\n</div>"}