{"title": "Chapter 541 - Sixth Sister, Be Careful (2)", "id": 541, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-541-sixth-sister-be-careful-2", "volume_title": "Volume 6", "body": "<h1>Chapter 541 - Sixth Sister, Be Careful (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 541: Sixth Sister, Be Careful (2)</strong></p><br/><p>Halfway through the meal, Chu Lian turned around to ask Wenqing, “Has Third Young Master arrived yet?”</p><br/><p>Wenqing whispered into Chu Lian’s ears, “Replying to Third Young Madam, the driver of our carriage, Uncle Liu, sent someone to relay a message. He said that Third Young Master is being delayed by some matters, so he’ll come by a little later.”</p><br/><p>Chu Lian nodded and turned back around without asking more.</p><br/><p>The older cousin beside her had been trying to eavesdrop with her ears pricked, so her whispers to Wenqing had been overheard. The round-faced and slightly chubby cousin raised one brow, “Sixth Sister, you’re already missing Marquis Anyuan when you’ve only just come back to your maiden home? What a loving couple, you really make us all envious.”</p><br/><p>A furrow developed between Chu Lian’s brows. There was an obvious trace of jealousy and dissatisfaction within this unfamiliar cousin’s words.</p><br/><p>Even Wenqing and Wenlan couldn’t help but frown when they heard her words.</p><br/><p>Right when Chu Lian was being distracted by this older cousin, someone bumped into her, causing her to lose her balance. Almost at the same time, she felt something hot on her shoulder.</p><br/><p>Teacups fell to the floor with a clatter, accompanied by a brief cry an instant later.</p><br/><p>When she turned around with a frown, she was met with the sight of a trembling maidservant prone on the ground and wailing constant apologies to her.</p><br/><p>Wenlan’s face was full of fury as she set her eyes on the maidservant kneeling on the ground before them. She was using all of her willpower to refrain from shouting at the maidservant.</p><br/><p>Wenqing’s brow furrowed as she held up Chu Lian’s sleeve, “Third Young Madam, your dress.”</p><br/><p>Chu Lian turned to look at her shoulder. A weird stain was spreading over the exquisite bamboo green fabric, which made it appear rather disconcerting.</p><br/><p>It was a cup of sencha that had been spilled on Chu Lian just now. The sencha of the Great Wu Dynasty consisted of various spices. The strange mixture was much more difficult to clean, compared to most stains. Furthermore, there was a strange odour that was unbearable to the senses.</p><br/><p>Chu Lian stared at her stained sleeve for a few seconds. The maidservant who had bumped into her with the sencha earlier continued to kowtow and apologise. Chu Lian waved her hand to dismiss the maidservant. Even though she had already tried her best to be as low-key as possible, the commotion at their table had still attracted the attention of others.</p><br/><p>Chu Lian’s stepmother, Second Madam, rushed over.</p><br/><p>Her expression didn’t look too good. She immediately berated the troublemaking maidservant the moment she arrived and ordered two senior servants to drag the culprit away.</p><br/><p>Once that was taken care of, she finally walked up to Chu Lian. When she saw the stain on her sleeve, she exclaimed, “Miss Lian, you can’t wear this dress anymore. Mother will arrange for you to change in a room nearby.”</p><br/><p>Although Chu Lian didn’t like this stepmother of hers, she couldn’t reject Second Madam under the watchful eyes of the crowd around her.</p><br/><p>She apologised to her cousins and excused herself from the table. She followed behind Second Madam with Wenlan and Wenqing in tow and left the banquet hall to change in another room.</p><br/><p>On the way there, Second Madam was all smiles, “Miss Lian, your figure is similar to Miss Yuan’s. I’ll take you to the room first and send someone to bring over a set of Miss Yuan’s clothes. Is that alright?”</p><br/><p>Chu Lian didn’t want to spend any more time with Second Madam than she absolutely had to. Miss Su had given her a warning earlier, so she was already inwardly taking precautions against the second branch of House Ying.</p><br/><p>Chu Lian nodded her head. Second Madam smiled when she saw that she hadn’t rejected the offer.</p><br/><p>Second Madam was certainly good at acting. Those not in the know would surely believe that she was Chu Lian’s birth mother!</p><br/><p>She led Chu Lian to a quiet room nearby, then turned around to order the handmaid behind her to fetch the change of clothes. She immediately put on an apologetic expression while saying, “Miss Lian, I can’t leave the outer court for too long. I’ll have to leave you here by yourself.”</p><br/><p>Chu Lian showed a light smile, “Mother, go ahead. I’ll have my maidservants here with me, so there won’t be any problems.”</p><br/><p>Second Madam kindly patted Chu Lian’s hand before turning around to leave.</p><br/><p>After confirming that Second Madam had really left, Chu Lian immediately stood up.</p><br/><p>Wenqing was puzzled by her sudden action, “Third Young Madam, what’s wrong?”</p><br/><p>Resolution shone in Chu Lian’s gaze, “We’re leaving right now and returning to the estate!”</p><br/>\n</div>"}