{"title": "Chapter 546 - Drama (1)", "id": 546, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-546-drama-1", "volume_title": "Volume 6", "body": "<h1>Chapter 546 - Drama (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 546: Drama (1)</strong></p><br/><p>Miss Yuan’s face was flushed red from neither anxiety nor shyness, but from her excitement.</p><br/><p>Whenever she thought of the time Chu Lian had ‘humiliated’ her in Jinshi Pavilion, she would choke on all the anger that surfaced in her heart. Now it was her turn to enjoy Chu Lian’s humiliation! Chu Lian had been toyed with by another man and she was going to lose her reputation and integrity. To put the cherry on top, there were so many witnesses here to watch it all happen. Even though her marriage with He Changdi had been decreed by the Empress Dowager and she possessed the title of Honoured Lady Jinyi, she would still become the laughing-stock of the whole capital.</p><br/><p>She wanted Chu Lian to lose her standing in the capital and get stomped into the ground!</p><br/><p>To be frank, Chu Yuan wasn’t just a vengeful person; she was also dumb as hell.</p><br/><p>She hadn’t considered how this would affect her at all. She and Chu Lian were both ladies from House Ying and they were close siblings from the same father in the eyes of others. Thus, if Chu Lian’s reputation became tarnished, hers would be as well. The first thing implicated by these events would be her marriage prospects.</p><br/><p>However, jealousy had already taken over all her wits and rationality, so she couldn’t care less about the consequences.</p><br/><p>She didn’t even notice the sinister and furious gaze that Xiao Bojian was directing at her.</p><br/><p>At this point, the courtyard was buzzing with whispers. Everyone seemed to be sure that there was a show worth watching and they weren’t willing to leave.</p><br/><p>Many of them were waiting to see Chu Lian make a joke of herself.</p><br/><p>Laiyue committed the face of each and every one of them to memory as he continued standing guard.</p><br/><p>Xiao Bojian’s hands curled into tight fists. He regretted everything now.</p><br/><p>He had planned everything perfectly, but he hadn’t expected the second branch to pull a fast one on him!</p><br/><p>Those who had come to join in the fun were desperate to enter the room so they could see what was going on inside. Unfortunately, Laiyue was guarding the door with his sword drawn. The fierce expression his face made it so that no one dared to enter.</p><br/><p>Amongst these ladies, there were still some of them who were clear-headed. They quickly ordered their personal servants to inform Madam Rong, the lady-in-charge of the estate.</p><br/><p>While everyone was itching to see what was going on inside, the sound of firm and steady footsteps could be heard from within the room.</p><br/><p>He Changdi appeared at the doorless frame of the room’s entrance in his bamboo green official’s robe.</p><br/><p>He Sanlang had a tall figure and a narrow waist. When he stood in the entrance, he was practically blocking half of the space with his broad shoulders. His grim gaze swept over everyone in the courtyard, pausing on Miss Yuan for a moment, before staring right at Xiao Bojian.</p><br/><p>With his hands behind his back, he possessed a chilly aura, like an unwavering blood-soaked general on a battlefield.</p><br/><p>He Changdi emitted a cold tone as he said, “Sir Xiao, if I recall correctly, this is the ladies’ quarters. Why would you be here at this moment?”</p><br/><p>Everyone’s attention had been occupied by the trampled door and the lovemaking sounds emanating from the room, so they hadn’t considered why Xiao Bojian was here. Now that He Changdi brought this up, doubts started popping up in their minds.</p><br/><p>He Sanlang had an appropriate reason, as he had come here to look for his wife and he was a son-in-law of the family. However, it was rather inappropriate for Xiao Bojian, a young man unrelated to the family, to be here in the Ying Estate’s inner court.</p><br/><p>After He Changdi finished speaking, Laiyue whispered something into his ear.</p><br/><p>Xiao Bojian didn’t know how to react to He Changdi’s question. His complexion had already turned a little pale from his anger earlier, and now a storm was starting to brew on his face. He glared right back at He Changdi with his feminine features contorted into a sinister grimace.</p><br/><p>Since it was getting dangerous for him, he endured his anger and sarcastically replied, “This is my teacher’s home. I’m usually in the estate and I pay visits to his wife, Matriarch Ying, often. It’s nothing out of the ordinary for me to be here.”</p><br/>\n</div>"}