{"title": "Chapter 549 - Drama (4)", "id": 549, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-549-drama-4", "volume_title": "Volume 6", "body": "<h1>Chapter 549 - Drama (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 549: Drama (4)</strong></p><br/><p>As the saying went, good deeds don’t go very far, while bad deeds can spread a thousand miles. Before the coming-of-age banquet in House Ying had even ended, the news had already spread to the ears of every noble madam present.</p><br/><p>One of the noble madams who had good relations with House Zheng softly commented, “It’s no wonder that Marchioness Anyuan left in such a hurry. If my maiden family was like this, I’d sever all ties with them.”</p><br/><p>“Precisely! With a stepmother and sister like that, Marchioness Anyuan certainly led a hard life.” Another madam added.</p><br/><p>……</p><br/><p>With the news spreading like this, most of the guests had already left before the banquet even ended.</p><br/><p>Miss Yuan watched as the guests who had come to congratulate her left the Ying Estate in droves. Her polite facade was on the verge of breaking as fury shook her being.</p><br/><p>She stood at one corner with a deathly pale and malevolent expression, staring at the screen behind House Ying’s main gates.</p><br/><p>Her handmaid, Xiaoqin, quickly went to Miss Yuan’s side, “Eighth Miss, the matriarch has summoned you.”</p><br/><p>Chu Yuan held back the rage that was about to explode within her, and turned to leave in the direction of Old Duchess Ying’s residence.</p><br/><p>Since all of the guests had already left, there were no outsiders around in the Old Duchess’s courtyard. Second Master Chu Qizheng and his wife were kneeling before the old duke and duchess, who were seated above them with thunderous faces.</p><br/><p>Chu Yuan had never experienced anything like this before, so she walked into the parlour in a shocked daze.</p><br/><p>Before she even had the chance to speak a word, Old Duke Ying had already ordered her to kneel down.</p><br/><p>“You utterly useless fools!” The old duke cursed.</p><br/><p>Miss Yuan had never received such a merciless scolding from her grandfather before. Her eyes immediately reddened and her tears fell freely. However, since both of her parents were keeping their heads down, she didn’t dare to open her mouth recklessly.</p><br/><p>The old duke had already ruthlessly reprimanded his son before Chu Yuan had arrived, so he was already tired of speaking. An encompassing silence fell over the parlour as it became so quiet it seemed like time had stopped.</p><br/><p>After the long bout of silence, Old Duke Ying declared, “I have decided to pair Miss Su off to Wujing, so the two of you can settle Miss Yuan’s marriage on your own!”</p><br/><p>This sentence made the kneeling family of three raise their heads in disbelief.</p><br/><p>“That won’t do! Father, didn’t you agree to let Miss Yuan marry Xiao Bojian?” Second Madam quickly implored.</p><br/><p>Without giving Second Master the chance to speak, the Old Duke harshly shot her down, “My mind is set! You can go back and reflect on your mistakes over the next few days!”</p><br/><p>Old Duke Ying got up and left the parlour without further ado. He didn’t respond no matter how the second branch begged. The old duchess glared at them as well, before leaving with the help of her handmaids.</p><br/><p>Not a single ounce of strength was left in Miss Yuan. She immediately collapsed to the floor as her limbs turned weak. Her eyes became unresponsive and empty.</p><br/><p>When He Sanlang left the estate on horseback, he learned that Chu Lian had already made it out of the Ying Estate in one piece.</p><br/><p>It was only at this point that his heart finally settled back down into his chest. He turned back for one final stare at House Ying’s main entrance, a grim and icy look in his eyes.</p><br/><p>He whipped his horse and headed straight back to the Jing’an Estate, his entire visit to the Ying Estate completed without even having a single bite of food from the banquet.</p><br/><p>Only fifteen minutes had passed since Chu Lian returned to Songtao Court before He Changdi returned as well.</p><br/><p>The moment he entered Songtao Court, his first reaction was to ask, “Where’s Third Young Madam?”</p><br/><p>Senior Servant Gui shivered from the chilly aura he was emanating and replied out of reflex, “Third Young Madam is changing her clothes in the bedroom.”</p><br/><p>He Sanlang impatiently entered the inner room on long strides. When he walked up to the screen in front of the bathroom, he spotted Xiyan standing by the entrance and caught the sounds of running water with his sharp ears. He waved at Xiyan to dismiss her.</p><br/><p>Xiyan threw one glance at the bathroom, before leaving obediently with her head lowered.</p><br/><p>He Sanlang paused for a second. After taking a deep breath, he moved past the screen and entered the bathroom.</p><br/>\n</div>"}