{"title": "Chapter 551 - Mutton Soup (2)", "id": 551, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-551-mutton-soup-2", "volume_title": "Volume 6", "body": "<h1>Chapter 551 - Mutton Soup (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 551: Mutton Soup (2)</strong></p><br/><p>Chu Lian changed into a set of casual home wear: a cherry blossom coloured jacket and a pleated skirt embroidered with golden flower patterns.</p><br/><p>When Chu Lian came out of the bathroom holding her slightly damp long hair, she looked up only to see He Changdi sitting on the chaise beside the window. There was a cup of tea on the table beside him and he was holding the storybook that she usually read in his hand. His brows were furrowed slightly. It seemed like he had clearly seen something he didn’t like.</p><br/><p>He must have heard Chu Lian’s footsteps, as he set down the storybook and lifted his piercing gaze. He beckoned Chu Lian over and spoke in his husky voice, “Come over here.”</p><br/><p>Chu Lian blinked once and went over without any hesitation.</p><br/><p>He Changdi sat up and moved back into the chaise, leaving the outer part for Chu Lian to sit on. He took the towel from Chu Lian’s hand and started, with gentle movements, to help her dry the ends of her hair which had gotten wet while she was bathing.</p><br/><p>Chu Lian sat on the chaise with her legs crossed. When she glanced over the table, she noticed that there was only plain hot water inside the teacup so she asked curiously, “Why don’t you drink sencha anymore?”</p><br/><p>He could drink honey water even if he didn’t feel like drinking sencha. When did He Sanlang start drinking only plain water?</p><br/><p>Xiyan had already served Chu Lian a cup of warm honey water in the time it took for her to speak. After gauging the moods of Third Young Master and Madam, Xiyan tactfully waved over the other two maidservants on duty and they retreated in unison.</p><br/><p>The movement of He Changdi’s hands hadn’t stopped once during all this. When he heard her question, he looked up slightly and met with his wife’s eyes.</p><br/><p>“Tastes terrible. Sickening.”</p><br/><p>Chu Lian was dumbfounded by his answer. He Sanlang was really a miser with words. If not for the fact that she had spent enough time with him to understand his personality, then she really wouldn’t have understood his words.</p><br/><p>The first half of his answer was to say that sencha tasted disgusting, while the latter half was to express that honey water was too sweet…</p><br/><p>He Changdi had been accustomed to drinking sencha at first. After all, it was the general preference within the capital. Even the royal family drank sencha.</p><br/><p>It was some time after he had gotten married with Chu Lian that he had inadvertently heard the reason why she didn’t drink sencha from a maidservant. From that point onwards, He Changdi suddenly felt that the sencha that had been palatable to him had suddenly become hard to swallow.</p><br/><p>Perhaps this was part of the inevitable sharing of preferences between couples.</p><br/><p>However, He Sanlang couldn’t get used to drinking the honey water that Chu Lian usually drank either. Thus, plain water was his only remaining option…</p><br/><p>With that reminder, Chu Lian thought back to the tea leaves that she had drunk during modern times.</p><br/><p>Back when she had still been in the modern world, she had enjoyed traveling in her free time. The largest tea-picking plantation she had visited was Longjing Village in Hangzhou. She had even watched an old tea-making master pan-frying tea in person. Later, she had purposely researched the whole process of making Longjing tea online. Even though it had happened a long time ago, Chu Lian still remembered it very clearly.</p><br/><p>Her eyes lit up after she realised what date it was. It was almost the end of February, so it would be the best time to pick spring tea in a little over ten days.</p><br/><p>“Wait a few more days, I’ll pan-fry some tea for you to drink.”</p><br/><p>He Changdi didn’t actually take Chu Lian’s words to heart. Even the most valuable Zhengshan tea doesn’t pique his interest. What kind of tea could his wife produce that would beat that?</p><br/><p>Thus, He Sanlang just gave her a half-hearted grunt of acknowledgement.</p><br/><p>When Chu Lian turned around and noticed his rigid and cold expression, she asked in a displeased tone, “He Sanlang, don’t you believe me?”</p><br/><p>“Of course I believe you.”</p><br/><p>“Your reply was too half-hearted!” Chu Lian rolled her eyes and shifted to an upright sitting position, “I’ll have to make you eat your words when the time comes!”</p><br/><p>He Sanlang smiled slightly. His wife really possessed an abnormally stubborn attitude towards anything to do with food.</p><br/><p>After he was done drying her hair, He Changdi casually tossed the towel to the side and pulled Chu Lian into his embrace with one long arm. He buried his head into the side of her neck and took a deep breath. He asked, “What exactly happened today?”</p><br/><p>Chu Lian knew that he would have asked sooner or later, so she told him all the details without holding back.</p><br/><p>He Changdi’s thick brows drew together into a frown and his expression became increasingly grim as he listened intently to her. It seemed like Xiao Bojian wasn’t going to give up that easily. However, he wasn’t going to give that bastard any opportunities either!</p><br/><p>Setting the matter of Xiao Bojian’s participation aside, he had the same question as Chu Lian. Why would Chu Qizheng plot against his own daughter?</p><br/><p>He Changdi was afraid that Chu Lian would be hurt by her father’s actions, so he didn’t bring up his suspicions with her.</p><br/><p>“Lian’er, you probably don’t know this yet, but your Fifth Sister’s marriage prospects aren’t going very well.”</p><br/><p>Miss Su was older than Chu Lian and she had already turned seventeen after the New Year. However, there still wasn’t any news regarding her marriage.</p><br/><p>Since Chu Lian had married well, it should have been easier to find a groom for Miss Su. However, it was precisely due to the comparison with Chu Lian’s marriage that the eldest madam of the main branch became pickier. There had originally been several suitable families asking after Miss Su, but Eldest Madam had rejected all of them in secret.</p><br/><p>Thus, her engagement had been delayed till the New Year had passed and was still undecided even now. Miss Su had already turned a year older after the New Year, so her choices had also narrowed down… At this rate, it wasn’t looking good for her marriage.</p><br/><p>Chu Lian recalled her encounter with Miss Su at the Ying Estate earlier today. Her figure looked thin and weak, and her complexion was ashen. Compared to the last time they had met, Fifth Sister had become a whole size thinner.</p><br/><p>Was Eldest Aunt-in-law the one behind Miss Su’s strange actions…?</p><br/><p>She was deep in her thoughts when the feeling of something moist and soft on her neck jolted her back to reality. Chu Lian immediately came back to her senses and leaned away in an attempt to avoid He Changdi’s affectionate actions.</p><br/>\n</div>"}