{"title": "Chapter 562 - He Ying’s Confidence (1)", "id": 562, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-562-he-ying%E2%80%99s-confidence-1", "volume_title": "Volume 6", "body": "<h1>Chapter 562 - He Ying’s Confidence (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 562: He Ying’s Confidence (1)</strong></p><br/><p>Pan Nianzhen bowed her head without saying anything, as if she had suffered a major grievance.</p><br/><p>Matriarch He felt a little guilty in her heart. She sighed, “It was all my fault for agreeing with your father’s decision to marry you off to Siyang that year.”</p><br/><p>He Ying hastily shook her head, “Mother, what are you saying? It’s already been so many years. I’ve already moved on from what happened. At that time, I was the one in the wrong, causing Mother to lose face.”</p><br/><p>After spending time together these past few days, He Ying had already noticed that her mother wasn’t as sharp as before. She has become more muddle-headed and soft-hearted as she got older. Every time she acknowledged her mistakes and acted pitiful, her mother would be especially affectionate to her.</p><br/><p>She had tried this trick many times and it had worked every time so far.</p><br/><p>As expected, Matriarch He’s face was filled with remorse. Her heart ached as she patted her daughter’s hand, “Don’t worry, Miss Ying. Mother will find a good husband for Nianzhen.”</p><br/><p>Pan Nianzhen was her daughter’s only child, so she couldn’t bear letting her suffer.</p><br/><p>A corner of He Ying’s lips lifted up in celebration of her success, hidden by the shadows falling over her face.</p><br/><p>Her eyes darted about. She felt that this was a good chance to mention her suggestion to her mother.</p><br/><p>She organised her thoughts and moved closer to Matriarch He. She hugged Matriarch He’s arm and swayed it lightly, “Mother, Miss Pan is my only daughter. I can’t bear to let her marry somewhere far away. I’m also worried that her husband’s family will mistreat her. After all, I experienced that misery myself in the past. If possible, I would rather keep Miss Pan right here with me forever.”</p><br/><p>The matriarch’s gaze was unfocused. A bitter and remorseful expression emerged on her face. It was hard to tell if she was thinking of the year that her daughter had been sent off far away.</p><br/><p>He Ying continued, “Mother, Erlang is already twenty-five this year. The sons of other families around his age already have several children by now. Since he’s still single, there are unpleasant rumours spreading outside. Miss Pan is Erlang’s younger cousin and she’s also at a suitable age. Since Erlang doesn’t want to marry a woman that he doesn’t know, why don’t we pair them up? Elder Sister-in-law has a good personality, so I’ll be at ease with her taking care of Miss Zhen.”</p><br/><p>Matriarch He was baffled by her daughter’s words.</p><br/><p>Although she wanted to help her granddaughter find a good husband, she had never considered letting her granddaughter marry into her own household.</p><br/><p>Erlang was an old bachelor and she had been continuously searching for a suitable bride for him. However, Erlang was stubborn and he had never agreed to any of her suggestions before.</p><br/><p>Although He Erlang seemed careless, he actually had his way of doing things. Even his mother couldn’t convince him otherwise, let alone his grandmother!</p><br/><p>If it wasn’t so, she wouldn’t be waiting for a grandson still.</p><br/><p>Matriarch He didn’t agree blindly with her daughter’s suggestion this time. Her expression became stern for a moment, but she instantly felt that she was being too harsh on her daughter. Thus, she relaxed her expression and tried persuading her daughter, “Miss Ying, it’s not that I don’t want to help Miss Zhen, but it’s really not appropriate to have Erlang marry Miss Zhen.”</p><br/><p>He Ying didn’t think that her normally agreeable mother would reject her immediately. Her eyes reddened in grievance. She pulled her arm back and complained, “Mother, you don’t say it out loud, but you actually hold contempt for us, right? Scorning us for potentially staining my nephew’s reputation.”</p><br/><p>The matriarch was heartbroken when she saw her daughter weeping, “There’s no such thing. Miss Ying, why would I scorn you? I gave birth to you! You’re my very own daughter!”</p><br/><p>“Then why won’t you Mother agree to Miss Pan and Erlang’s marriage? Erlang isn’t getting any younger. Don’t you know the rumours that other people are spreading about Erlang? Miss Pan is as beautiful as a flower and of a suitable age. Apart from her family background, which part of her isn’t worthy to match Erlang?!”</p><br/>\n</div>"}