{"title": "Chapter 571 - Don’t Seduce Me (2)", "id": 571, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-571-don%E2%80%99t-seduce-me-2", "volume_title": "Volume 6", "body": "<h1>Chapter 571 - Don’t Seduce Me (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 571: Don’t Seduce Me (2)</strong></p><br/><p>“Do you like it?” He Changdi didn’t answer Chu Lian’s question. He just wanted to know whether she liked it or not.</p><br/><p>Chu Lian gaped a little. She didn’t know what to say; her husband was just too mysterious.</p><br/><p>She answered honestly, “Who wouldn’t like a great store like this?”</p><br/><p>Although she implied that she liked it, her face didn’t show much excitement at all.</p><br/><p>“I’ve already sent someone to the authorities to transfer this deed into your name. It’s good as long as you like it. Don’t you like cooking? You can do whatever you like with this shopfront.” He Changdi’s icy gaze softened when he looked at her.</p><br/><p>Chu Lian gripped the deeds tightly. She raised her head to look into her husband’s fathomless eyes.</p><br/><p>“Hubby, tell me now. Where did you get the money for these?”</p><br/><p>She had asked this question back when he had bought jewellery for her, but He Changdi hadn’t given her an answer. After obtaining this storefront for her, he must have already spent at least ten thousand taels altogether.</p><br/><p>All he had done recently was join the northern army. He had never done any business on the side, so how did he obtain so much money? Could it be through bribery?</p><br/><p>However, in her subconscious mind, Chu Lian didn’t want him to have obtained his money through those means.</p><br/><p>Seeing her tightly knit brows, He Changdi knew that his wife’s thoughts had veered away from legal means.</p><br/><p>A dry laugh came out of him, and he couldn’t help but pinch her cheeks. “Lian’er, what is going through your head? It’s not what you think it is.”</p><br/><p>Chu Lian rolled her eyes at him. “Your way of earning money is just too profitable! Even my businesses don’t bring in nearly as much as you!”</p><br/><p>He Changdi knew that it wasn’t good for him to keep Chu Lian in the dark. If he didn’t explain himself to her, she would likely let her imagination run wild. Therefore, rather than letting her listen to wild rumours or gossip, he might as well tell it to her straight.</p><br/><p>He beckoned Chu Lian over with his long fingers. Chu Lian hesitated for a moment, but still chose to lean into his embrace, putting her ear close to his lips.</p><br/><p>He Sanlang’s deep voice whispered something into her ears. A few moments later, Chu Lian sat up straight with her eyes wide open, staring at him in disbelief.</p><br/><p>She was completely flabbergasted. “Is… is this true?”</p><br/><p>He Sanlang smiled. “Has your husband ever lied to you?”</p><br/><p>“You guys are really too brazen!”</p><br/><p>He Changdi shook his head. “Any noble would have done the exact same thing in this case. I’ve already held myself back.”</p><br/><p>Chu Lian stopped asking about the origin of his money. She only warned He Changdi to handle the hot potato in his hands carefully.</p><br/><p>He Sanlang didn’t want her to worry, so he quickly changed topics. “Now that you have this storefront, what do you plan to do?”</p><br/><p>Chu Lian knew his motivations very well in her heart. He Sanlang had probably heard of the matriarch taking back Guilin Restaurant, so he had spent his money to make it up to her.</p><br/><p>Although his expressions were as cold and stiff as the King of Hell and he disliked speaking, his actions spoke volumes.</p><br/><p>“I’ll open a restaurant.”</p><br/><p>When she had lost Guilin Restaurant, she had already been planning on opening another, but it wasn’t easy to find a good location. Furthermore, she didn’t have that much money on hand, as she had invested heavily in the market at the northern border. Thus, her plans had been delayed.</p><br/><p>With He Sanlang’s present, she could put her plans into action earlier than she had expected.</p><br/><p>He Changdi raised one sharp brow. As he had expected, Chu Lian would open a restaurant again.</p><br/><p>The couple hadn’t snuggled and chatted intimately like this for a long time, so He Sanlang, the man of few words, was in the mood to speak more.</p><br/><p>When he recalled how Chu Lian had set up Guilin Restaurant by herself, He Changdi felt admiration towards his little woman.</p><br/><p>Just what was her brain made of? How could it produce so many wondrous thoughts? She even had ideas that he would never be able to think of.</p><br/><p>When he had been chatting with his sworn brother Prince Jin one day, even Prince Jin had spoken highly of Chu Lian’s innovative ideas.</p><br/>\n</div>"}