{"title": "Chapter 580 - Mishap (3)", "id": 580, "volume": 6, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-580-mishap-3", "volume_title": "Volume 6", "body": "<h1>Chapter 580 - Mishap (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 580: Mishap (3)</strong></p><br/><p>Chu Lian immediately shut up and buried her head into his chest after she heard that.</p><br/><p>He Changdi stroked her back soothingly. His palm slid down to her waist and massaged it gently.</p><br/><p>They soaked in the tub together for a calm moment until Chu Lian felt the aches in her body easing.</p><br/><p>She looked up at He Changdi with her cheek still on his chest, “Where did you go to drink tonight? Why did you come back so late? Are Eldest Brother and Second Brother resting in the outer court?”</p><br/><p>He Changdi leaned against the tub with one arm around Chu Lian. His other arm was still massaging her slender willowy waist. He shut his eyes as he replied in his husky, magnetic voice, “Mu’ai Restaurant. Eldest Brother and Second Brother drank even more than I did. They were already resting when I left the outer court.”</p><br/><p>Chu Lian’s eyes widened in surprise.</p><br/><p>Mu’ai Restaurant?</p><br/><p>Since He Sanlang had given her that storefront on Zhuque Avenue, she had specially gone to Zhou Wen for more details on the area. If she remembered correctly, Mu’ai Restaurant was right opposite the most famous brothel in the capital…</p><br/><p>Chu Lian stared at He Changdi’s handsome face while biting her lip.</p><br/><p>He Sanlang’s eyes slid open a tiny bit. He peeked at Chu Lian before shutting them again in a suspiciously calm manner.</p><br/><p>“If I did anything outside, would you have begged for mercy like that just now?” He Changdi drew closer and whispered the rest right into Chu Lian’s sensitive ear, “Your voice even turned hoarse from all your screaming…”</p><br/><p>Chu Lian’s face exploded into a furious blush.</p><br/><p>She stared with wide almond-shaped eyes. She hadn’t thought that He Sanlang would be able to act so… so lewd!</p><br/><p>Hadn’t he always been the restrained gentlemanly type?</p><br/><p>“Why are your eyes opened so wide? Did I say something wrong?”</p><br/><p>He Sanlang was getting into it!</p><br/><p>Chu Lian didn’t want to acknowledge his sudden lunatic fit. Her husband had never been normal anyway.</p><br/><p>After a short moment, Chu Lian felt that there was something wrong.</p><br/><p>She looked up and asked, “Wait, didn’t you return around 11pm? Why did you come over to Songtao Court so late?”</p><br/><p>“I sent someone to check when I came back, and the servants said that you were already sleeping, so I was planning to rest in the main study with my brothers.”</p><br/><p>Thoughts flew around in Chu Lian’s head. So her husband hadn’t been able to fall asleep in the outer court and had come back secretly in the middle of the night?</p><br/><p>However, he had been brimming with desire when he had returned. The way he had acted, all forceful and ferocious, was very different from how he normally acted as well…</p><br/><p>Over the past few days, whenever they had battled it out in the bedroom, he would keep her feelings in mind even if he wanted more.</p><br/><p>Chu Lian hadn’t replied for some time, so He Sanlang opened his eyes. He let out a simple, “Hmm?” to prompt her.</p><br/><p>His wife seemed to be thinking of how to phrase her words. She eventually asked, “Did you feel any discomfort when you came back?”</p><br/><p>He Sanlang frowned as he thought.</p><br/><p>Chu Lian continued speaking before he could reply, “I slept late last night because there was something I wanted to discuss with you. I was looking at the account books in my study and I only slept when it was past 11.”</p><br/><p>It all became clear to He Changdi after Chu Lian’s explanation. Someone must have tried to trick him last night.</p><br/><p>His wife hadn’t gone to sleep yet, but the senior servant he had sent to check on her had told him that his wife was already asleep. This must have been arranged in advance by someone. As for why they would do so, it was obvious that they wanted him to sleep in the outer court.</p><br/><p>Ever since he had returned from the northern border, he had added some of his soldiers to the guard at the Jing’an Estate. Coupled with the existing family soldiers, the estate had become like a steel bucket. Even flies wouldn’t be able to enter. Since strangers wouldn’t be able to enter the estate, then it could only have been someone from the inside.</p><br/>\n</div>"}