{"title": "Chapter 626 - Spring Hunt (2)", "id": 626, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-626-spring-hunt-2", "volume_title": "Volume 7", "body": "<h1>Chapter 626 - Spring Hunt (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 626: Spring Hunt (2)</strong></p><br/><p>The next day, Chu Lian was naturally unable to get up at her usual time. However, He Changdi got up early to attend morning court.</p><br/><p>The crown prince had been grounded. The emperor had even sent officials from the supreme court to investigate the incident regarding the fake phoenix.</p><br/><p>During morning court, He Changdi was simply standing amongst all the officials, but he had a strange feeling that there was a sharp gaze looking down on him from time to time.</p><br/><p>Only the Chengping Emperor would possess such an oppressive gaze.</p><br/><p>Although the Chengping Emperor had a good impression of He Changdi, he usually didn’t pay all that much attention to him.</p><br/><p>A sense of caution immediately emerged within He Sanlang’s heart.</p><br/><p>The emperor unexpectedly ordered He Changdi to stay after the court was adjourned.</p><br/><p>When He Sanlang came out of Qinzheng Hall, he was holding an official document within his hand. It was an official document that he and his father, Count Jing’an, had presented to the emperor to request permission to leave House Jing’an and establish his own noble estate.</p><br/><p>According to the usual procedures, if things went smoothly, then it would have taken at least half a month to obtain the approval. However, all the procedures had somehow been completed within a few days.</p><br/><p>Moreover, the Chengping Emperor had personally handed the official document to him. It inevitably caused He Changdi to think deeper into this situation.</p><br/><p>Furthermore, the emperor had even rewarded him with a plot of land within the capital to use as the Anyuan Estate…</p><br/><p>Real estate was very expensive within the capital. Even for noble families who had lived in the capital for several generations, it would be difficult for them to purchase properties here. Originally, He Changdi and Chu Lian had already decided on the estate that they were going to move into. Although it wasn’t considered a luxurious manor, the estate had four courtyards, which was enough for the young couple to live in. If they chose an estate that was too big, then it would feel rather empty.</p><br/><p>He Changdi took a look at the property that the emperor had bestowed upon them. It was a five-courtyard estate that was located in a good area of the capital. The mansion had originally been the residence of a prince during the era of the first emperor… Later on, the mansion had become vacant after that prince had left for his own assigned lands out of the capital. Following the changing of generations, the prince had eventually passed away. However, the estate had remained vacant ever since.</p><br/><p>Many high-ranking officials and noblemen had had their eyes set on this estate for a long time, but the Chengping Emperor owned the property. Thus, no one had dared to take the initiative to obtain that mansion. However, it had so easily fallen into He Changdi’s hands now…</p><br/><p>Even He Changdi was perplexed.</p><br/><p>He Changdi immediately reported this matter to Chu Lian when he returned to the estate. Chu Lian also thought that there was something weird about it.</p><br/><p>Although they didn’t understand why the Emperor was suddenly being so considerate to He Changdi, they had obtained a good residence for themselves.</p><br/><p>It was a holiday the next day, so He Sanlang and Chu Lian headed over to to Kangping Lane to take a look at the estate.</p><br/><p>Since the emperor had personally approved the official documents and specially gifted them with a new estate, Chu Lian and He Changdi completed their move out of the Jing’an Estate a month later.</p><br/><p>Matriarch He found out only on the day they were moving. She almost fainted after finding out.</p><br/><p>Muxiang, who was standing behind Matriarch He, was also in disbelief that He Changdi was really moving out!</p><br/><p>In the past, she had been able to get a clear understanding of the situation within Songtao Court since she worked close by as the matriarch’s handmaid. Now that He Changdi and Chu Lian were moving out of the estate, she wouldn’t even have the chance to get close to He Changdi anymore!</p><br/><p>Muxiang was completely stunned. Senior Servant Liu noticed her soulless expression, which made Senior Servant Liu even more cautious of her.</p><br/><p>Within the entire Jing’an Estate, only Matriarch He and Muxiang were against He Changdi moving out.</p><br/><p>Countess Jing’an had more of He Changdi’s interests at heart.</p><br/><p>If He Changdi hadn’t been bestowed the title of marquis, then he should have continued living in the Jing’an Estate. However, her son had become a marquis now. Even if they were able to live together, the position of Count Jing’an would be passed down to Dalang in the future and her youngest son would still have to move out later.</p><br/><p>Dalang would definitely get married again by then. It would be troublesome if there was an uneven distribution between the two branches.</p><br/><p>Moreover, the capable young couple of the third branch had the ability to survive on their own. It would also be more comfortable for them.</p><br/><p>Count and Countess Jing’an had also noticed that the matriarch was dissatisfied with Chu Lian.</p><br/><p>The matriarch had reflected on her behavior after Chu Lian had honestly reprimanded her at Qingxi Hall back then, but there was still a gap between the two.</p><br/><p>Once enmity sprung up between two people, it would be difficult to clear up misunderstandings and revert back to their previous relationship.</p><br/><p>Chu Lian was also Marchioness Anyuan, so she would definitely have to take up the mantle of lady-in-charge of her own household in the future. It was better to let the young couple gain some experience outside while they were still young. If they made any mistakes at this point, Countess Jing’an still had the ability to help them out right now.</p><br/><p>Count Jing’an had the same opinion as his wife. However, his perspective was not only limited to He Changdi. Once He Changjue finally settled down, he would also allow his second son to move out with his wife.</p><br/>\n</div>"}