{"title": "Chapter 628 - Spring Hunt (4)", "id": 628, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-628-spring-hunt-4", "volume_title": "Volume 7", "body": "<h1>Chapter 628 - Spring Hunt (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 628: Spring Hunt (4)</strong></p><br/><p>The tall He Changdi was also wearing a set of riding attire today. A long bow and a quiver of arrows hung on the back of his horse, Leaping Clouds. He was standing beside his horse in his black riding attire, which was embroidered with complex patterns. His entire body emitted a chilly and sharp aura, as if he was a handsome god of war about to step onto the battlefield.</p><br/><p>He Sanlang rarely dressed up like this on normal occasions. Since he worked in the Ministry of War now, he usually wore court outfits. While in the estate, he would often wear a casual robe with a cloak. Even when he was practising martial arts, he would just wear a simple practice outfit. Thus, even Chu Lian had rarely seen him wear such formal attire.</p><br/><p>He Changdi was truly worthy of the nickname, ‘He Sanlang the Fair’. When he dressed up like this, he would definitely charm numerous hearts by just casually walking around Zhuque Avenue.</p><br/><p>Chu Lian walked up to He Changdi’s side. She couldn’t resist looking him over a couple more times before slightly pouting, “If I knew you were going to look this good in riding attire, I wouldn’t have let you change.”</p><br/><p>He Sanlang had never cared about his appearance, so he didn’t understand the meaning behind Chu Lian’s remark. He just responded with a curious ‘hmm?’.</p><br/><p>Chu Lian gave him a glare, then announced in a domineering manner, “I’ll let it go this time, but I’m the only one allowed to see you wearing these kinds of outfits in the future!”</p><br/><p>He Changdi immediately understood her meaning. The icy expression on his handsome face seemed to melt instantly. He reached out to caress Chu Lian’s hair. He bent down slightly and spoke at a volume that only Chu Lian could hear, “Alright, I’ll only wear it for you to see. I’ll go change into another outfit. There’s still enough time.”</p><br/><p>After he finished speaking, he straightened his back, seemingly really intending to return to their room to change.</p><br/><p>Chu Lian hastily grabbed on to his sleeve and said speechlessly, “I can’t believe you’re actually going back to change! You’re not allowed to go. Everyone is going to be dressed in riding outfits later. If you don’t wear this, then the others will start gossiping.”</p><br/><p>A corner of He Changdi’s mouth lifted irresistibly. He reached out his hand to stroke the buttons on the front of Chu Lian’s riding attire, then he moved closer to her like earlier, “I share the same thoughts.”</p><br/><p>Chu Lian gaped a little in shock.</p><br/><p>He Sanlang was already helping Chu Lian up onto his horse, Leaping Clouds.</p><br/><p>After Chu Lian sat down, He Changdi immediately followed up by mounting his horse.</p><br/><p>Chu Lian could feel He Changdi’s sturdy chest behind her. She clasped the reins in a daze, turned around with a stiff face, and asked awkwardly, “You… We’re riding on the same horse? This doesn’t seem appropriate…”</p><br/><p>They were going to be in front of a big crowd. Although they were a married couple, it didn’t seem proper for them to be blatantly riding together in such close proximity out on the public streets…</p><br/><p>Wouldn’t they be drawing enmity by flaunting their relationship like this?</p><br/><p>He Changdi sent a signal with his eyes to the servants behind them. After that, he reached around Chu Lian to grab the reins. Leaping Clouds promptly broke out into a trot after he shook the reins.</p><br/><p>Chu Lian was surprised by the sudden movement and quickly grabbed onto his arm to balance herself.</p><br/><p>A moment later, Chu Lian heard He Changdi speaking beside her ear, “With your level of horsemanship, are you trying to make us late?”</p><br/><p>It would take thirty minutes to travel to the palace from the Anyuan Estate.</p><br/><p>If Chu Lian really rode the horse by herself, it would probably take her at least forty-five minutes to arrive.</p><br/><p>While Chu Lian did know how to ride a horse, her skills were only average.</p><br/><p>There were many people on the streets of the capital, so something could easily go wrong if one didn’t have enough control over their mount.</p><br/><p>Chu Lian didn’t have any choice, she could only silently accept He Changdi’s decision.</p><br/><p>She puffed up her cheeks, “Since we’re already running late, why did you want to go back to change your clothes earlier?”</p><br/><p>He Changdi chuckled. He gave out a command with his voice. At his signal, Leaping Clouds broke out into a gallop. Chu Lian was unprepared, so she jerked backwards and bumped against He Changdi’s chest.</p><br/><p>“I said that because I can make Leaping Clouds run even faster.”</p><br/><p>Chu Lian was frightened. Leaping Clouds had probably been locked up for too long. Now that he was finally free, he was sprinting all out. In the end, Chu Lian was only able to somewhat steady herself after He Changdi held onto her waist with his free arm.</p><br/><p>Chu Lian was shocked by the speed of Leaping Clouds, so she wasn’t in the mood to debate with He Changdi about the previous topic of whether he should change his clothing.</p><br/><p>Since they were riding on He Changdi’s horse, they arrived at the plaza in less than thirty minutes.</p><br/><p>There were already many people waiting when Chu Lian and He Changdi arrived. All of them were accompanied by a servant holding a horse beside them.</p><br/><p>He Changdi and Chu Lian were the only ones to arrive together like this…</p><br/><p>When Leaping Clouds came to a stop and stomped his hooves, everyone’s attention fell upon Chu Lian and He Changdi.</p><br/><p>There were various expressions in their eyes. Most of the men had envious gazes.</p><br/><p>Marquis Anyuan really knew how to have fun. He was still being all lovey-dovey with his wife while on the way to the spring hunt. Why hadn’t they thought of doing the same? What a shame.</p><br/><p>Most of the women felt jealous.</p><br/><p>They turned furious glares at their own inconsiderate husbands. The reproach and resentment within their gazes was intense.</p><br/><p><i>Look at how Marquis Anyuan pampers his wife, then take a look at yourself!</i></p><br/><p>There were a few fiery gazes among the crowd which were hard to ignore.</p><br/><p>Xiao Bojian was standing at the edges of the crowd. He watched as He Changdi and Chu Lian arrived together, riding closely on the same horse. After that, he saw He Changdi helping Chu Lian off the horse in a half-embrace. He clenched his fists so tightly that his knuckles had already turned white.</p><br/><p>The other resentful gaze belonged to Imperial Princess Leyao.</p><br/><p>She was the emperor’s daughter, so she was naturally qualified to participate in the spring hunt this time. She had already turned eleven after the new year.</p><br/><p>Ever since she had gotten into a conflict with Chu Lian and gotten grounded by the emperor, she seemed to have lost favour with her father.</p><br/><p>The emperor stopped pampering her like before, and had instead ordered Imperial Concubine Wei to discipline her strictly.</p><br/>\n</div>"}