{"title": "Chapter 638 - Falling Off Her Horse (2)", "id": 638, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-638-falling-off-her-horse-2", "volume_title": "Volume 7", "body": "<h1>Chapter 638 - Falling Off Her Horse (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 638: Falling Off Her Horse (2)</strong></p><br/><p>As Princess Leyao had been heavily favoured by the emperor during her childhood, the horse-loving emperor had often brought her to the ranch to relax. Therefore, Princess Leyao wasn’t the typical sheltered princess. She had learned to ride at a very young age, and having been trained by the emperor, she was in fact pretty skilled, and was in a different league from a newbie like Chu Lian.</p><br/><p>However, even if she possessed exceptional riding ability, that wasn’t enough to gloss over the fact that her body was still that of a child.</p><br/><p>When she rode horses, she had always been given a very tame and gentle mare, but she had gotten on a horse meant for hunting, an unruly stallion. Due to her frame, she couldn’t control such a spirited adult stallion no matter how skillful she was, so it only made sense that the emperor would worry.</p><br/><p>The emperor’s brows were immediately pressed against each other, “Yuanzhou, take two men with you and find Leyao. Send her back to be confined to Imperial Concubine Wei’s side!”</p><br/><p>Yuanzhou was the name of the guard who reported this matter. After accepting the order, he was about to turn around, but he suddenly heard Princess Leyao’s young voice.</p><br/><p>“Yaaaa!”</p><br/><p>The emperor lifted one hand to stop the guard who was about to leave. He waited on the spot with everyone for Princess Leyao’s arrival, a thunderous expression on his face. Sure enough, Princess Leyao appeared moments later.</p><br/><p>The way she rode the hunting stallion over made everyone sweat buckets from worry.</p><br/><p>Princess Leyao had obviously noticed them as well. She smiled and waved at the emperor, “Father!”</p><br/><p>The emperor now had a headache.</p><br/><p>Princess Leyao was still some distance away, but the emperor couldn’t help reprimanding her, “Preposterous! Who let you come? You’re looking nothing like a lady!”</p><br/><p>Princess Leyao seemed to have predicted such words from the emperor, so she raised her chin at Sima Hui’s direction, “Father, General Sima is a lady as well, yet she’s allowed to be here. You’re being sexist!”</p><br/><p>The emperor hadn’t expected Princess Leyao to refute him like this, and it made his rage swell up even more.</p><br/><p>Right as Princess Leyao’s horse was about to reach the emperor’s side, her horse suddenly reared up. It then started to flail around randomly like it had gone mad…</p><br/><p>The emperor’s eyes widened, “Protect the princess!”</p><br/><p>Amongst the people that were in the vicinity, the closest ones were He Changdi and Royal Prince Lu Tai.</p><br/><p>They couldn’t see what had happened, but it was obvious that Princess Leyao had lost control of her horse.</p><br/><p>Due to this abrupt development, Princess Leyao herself started screaming in fright.</p><br/><p>She had only ever ridden gentle mares, so she had never encountered a situation where she completely lost control of her horse. In the end, she showed that she was still a child when her face paled and she subconsciously screamed.</p><br/><p>Even He Changdi, a reincarnated person, didn’t have the time to decide whether to save her or not.</p><br/><p>At a crucial time like this, there was simply no time for them to weigh their gains and losses.</p><br/><p>He Changdi and Lu Tai both urged their horses towards Princess Leyao.</p><br/><p>Everyone watched the dangerous scene nervously, and there was so much tension in the air that their hearts skipped a beat.</p><br/><p>The emperor’s eyes remained wide, and he held his breath.</p><br/><p>Unfortunately, He Changdi, Lu Tai, and the other guards were still too slow…</p><br/><p>After all, they were too far away and distant waters couldn’t put out a nearby fire.</p><br/><p>Before He Changdi and Lu Tai could get to her, Princess Leyao had already been flung off the horse.</p><br/><p>The stallion was strong and spirited, while Princess Leyao was merely an eleven-year-old child. Getting flung off a horse like that, even if she survived, she would probably be crippled…</p><br/><p>A high-pitched neigh came from the stallion right before it fell to the ground, stirring up a small cloud of dust.</p><br/><p>The horse had been slaughtered by He Changdi with a single stroke. It had already gone mad. If he hadn’t beheaded it, it might have ended up trampling on Princess Leyao who had fallen to the side.</p><br/><p>Everyone hastily rushed over.</p><br/><p>Lu Tai carefully held Princess Leyao up. He didn’t make any sudden moves, for fear that it might worsen any injury that she had sustained.</p><br/><p>The emperor anxiously rushed to Lu Tai’s side, “Yao’er!”</p><br/><p>Even if Princess Leyao’s character had become more displeasing to him, she was still the daughter the emperor doted on the most. Right now, his daughter had gotten hurt before his eyes, so there was no way he could keep his cool.</p><br/><p>Hearing the emperor’s shout, Princess Leyao seemed to have returned to her senses from her shock of getting thrown off the horse. She looked towards the emperor’s direction, and began to cry loudly, “Father, Father! I’m scared! It hurts!”</p><br/><p>The emperor felt the pain of his heart being wrenched. The smart and wise ruler was at a loss for what to do when faced with the cries of his youngest daughter.</p><br/><p>He could only come up with an awkward attempt at consolation, “Don’t be afraid, Yao’er, I’m here with you!”</p><br/><p>After saying that, he roared at the top of his lungs for the imperial physicians.</p><br/><p>The imperial physicians were always brought along for the spring hunt, as minor injuries were commonplace during the hunts. However, the imperial physicians never followed them out on hunts in the forest, and they were currently still at the campsite.</p><br/>\n</div>"}