{"title": "Chapter 631 - Stinky Tofu (3)", "id": 631, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-631-stinky-tofu-3", "volume_title": "Volume 7", "body": "<h1>Chapter 631 - Stinky Tofu (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 631: Stinky Tofu (3)</strong></p><br/><p>“Your Majesty is wise. It was this humble official who didn’t see clearly in the past.”</p><br/><p>The expression on the Chengping Emperor’s face turned even more sour upon receiving such a vague answer from He Changdi.</p><br/><p>He cast a cold glance over the young man behind him, obvious disappointment in his gaze.</p><br/><p>“Do you think that Jinyi isn’t good enough for you?”</p><br/><p>Alarm spiked in He Changdi. He didn’t understand why the emperor would have such thoughts.</p><br/><p>He Sanlang shook his head resolutely and said, “This humble official has never thought so.”</p><br/><p>The emperor didn’t continue his line of questioning, but he had already completed his evaluation of He Changdi as a man of ability.</p><br/><p>From the day of He Changdi and Chu Lian’s wedding, to He Changdi’s time in the northern border army, to the great victory over the Tuhuns, the emperor had sent out his spies to dig out all the details of their lives these past few days.</p><br/><p>There was no way to hide anything from the fearsome spy corps if they were determined to dig out all details.</p><br/><p>The letters Chu Lian had sent to He Changdi, the hint to join under Captain Guo’s banner, the beef jerky and snacks, as well as the grape wine that Chu Lian had passed on to He Changdi via courier…</p><br/><p>As well as the grape wine being the reason he had caught Great General Qian’s eyes.</p><br/><p>Following that, the spy corps had also reported about how Chu Lian had opened Guilin Restaurant and how she had found Great Doctor Miao in order to treat Countess Jing’an’s illness.</p><br/><p>In the most critical period, when there was no one available in the Jing’an Estate, how Chu Lian had volunteered to go to the northern border herself to help He Changdi find the last important ingredient needed for the medicine: the Snow Mountain Mists flower.</p><br/><p>All the way down to the design of the snowboats and their making…</p><br/><p>Listing down all of the incidents like this, Chu Lian had done many things behind the scenes for He Changdi. She had also somehow saved Royal Princess Duanjia and made friends with Prince Wei’s Estate.</p><br/><p>Behind every part of He Changdi’s success was Chu Lian’s shadow.</p><br/><p>Perhaps He Changdi had only seen her value after Chu Lian had done so much, and finally acknowledged her position as his legitimate wife and consummated their marriage upon returning to the capital.</p><br/><p>That was how the emperor thought in his mind.</p><br/><p>It was also precisely because of all this information that the spy corps discovered the emperor’s impression of He Changdi’s person was… extremely bad.</p><br/><p>In the emperor’s heart, He Changdi wasn’t fit to be the husband of his and Ye Xun’s precious daughter.</p><br/><p>The gaze he directed into the distance grew icier.</p><br/><p>“Did you think up the snowboats by yourself?” He Sanlang heard the emperor ask coldly.</p><br/><p>He frowned and replied without any hesitation, “Replying to Your Majesty, this humble official did not. It was this humble official’s wife who came up with the snowboat’s blueprints and the actual snowboats.”</p><br/><p>Great General Qian had credited He Changdi as the creator of the snowboat in order to give him extra merits in his military report.</p><br/><p>Other than He Changdi, Chu Lian, and a few of her trusted subordinates, no one else knew that the snowboat had any relation to Chu Lian.</p><br/><p>Later on, Chu Lian had told He Changdi to take the snowboats to the northern border camp.</p><br/><p>Chu Lian had wanted to keep a low profile, so she herself requested to keep the matter a secret.</p><br/><p>Thus, when Great General Qian reported the matter, all credit naturally fell onto He Changdi.</p><br/><p>Chu Lian didn’t care much about such minor details, and their relationship had already changed after that, so she didn’t mind it at all.</p><br/><p>Unfortunately, this minor matter was completely different in the eyes of a doting and remorseful father.</p><br/><p>From the emperor’s point of view, he thought that He Changdi had stolen Chu Lian’s credit. He had even suspected that He Changdi had earned his title mostly through Chu Lian’s own efforts.</p><br/><p>He had assumed that He Changdi wouldn’t admit to the theft, but He Changdi had surprised him by admitting so readily that it had been Chu Lian who had come up with the snowboat.</p><br/><p>The emperor’s feelings were now slightly complicated.</p><br/><p>He didn’t ask He Changdi anything else as they waited for the rest of the hunting party to catch up with them. Other than the sound of their horses’ hoofbeats, silence surrounded them, making the atmosphere heavy.</p><br/><p>He Changdi was starting to realise that the emperor wasn’t happy with him because of Chu Lian, but he couldn’t guess at what the relation between the two of them was.</p><br/><p>They had set off so happily in the morning, but now that they were close to the imperial hunting grounds, everyone could sense the emperor’s gloomy mood, especially the emperor’s attendants and bodyguards. They didn’t dare to make a sound, even when they were retrieving items from their saddlebags.</p><br/><p>They finally arrived at the hunting grounds, where tents had been set up for the hunting party.</p><br/><p>Since they were to spend the night on the grounds itself, there were already tents erected all over the area. Of course, the emperor’s tent was the most eye-catching and luxurious.</p><br/><p>The princes’ tents were placed around the emperor’s tent.</p><br/><p>Only Imperial Concubine Wei had been invited, out of the entire inner palace, so Imperial Concubine Wei and the princesses were situated behind the emperor’s tent.</p><br/><p>The next ring of tents belonged to the more influential officials, nobles, and military officials.</p><br/><p>House Anyuan’s tent wasn’t too far away from the center, nor too close to the edges. It had a good position somewhere in the middle of the entire party. There was also a natural pool not too far away.</p><br/><p>The water in the pool was crystal-clear and pure. They could drink straight out of the pool.</p><br/><p>Sima Hui’s tent was right next to Chu Lian’s, just twenty or so metres away.</p><br/><p>Since it was already 12 in the afternoon, when the emperor entered the hunting grounds, he headed straight to his tent to rest. The imperial cooks had already prepared a luxurious meal for the emperor.</p><br/><p>The rest of the hunting party dispersed to their own tents for some rest.</p><br/><p>The emperor would only bring everyone out to hunt later, closer to evening.</p><br/><p>There were still 4 hours until that time.</p><br/>\n</div>"}