{"title": "Chapter 645 - She Must be Crazy to Have Fallen for Him (1)", "id": 645, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-645-she-must-be-crazy-to-have-fallen-for-him-1", "volume_title": "Volume 7", "body": "<h1>Chapter 645 - She Must be Crazy to Have Fallen for Him (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 645: She Must be Crazy to Have Fallen for Him (1)</strong></p><br/><p>The emperor seemed to be deep in his thoughts. A moment later, he turned to look at He Changdi and said, “Marquis Anyuan, bring Yao’er to the imperial physician’s tent first.”</p><br/><p>He Changdi couldn’t reject an order from the emperor, but he still couldn’t help but turn his gaze back to Chu Lian again. However, his wife had already lowered her head and was no longer looking at him. He Changdi felt as if something was crushing his heart and breaking it to pieces.</p><br/><p>He somehow managed to make a strained noise of affirmation. After giving a reply, he turned around with Imperial Princess Leyao in his arms and left with the imperial guards.</p><br/><p>With that taken care of, the emperor strode towards the direction of the polo field as he ordered He Lin to seek the imperial physician.</p><br/><p>At this time, Imperial Concubine Wei also arrived with everyone.</p><br/><p>Royal Princess Duanjia quickly rushed over, held Chu Lian’s hand, and asked about her condition worriedly.</p><br/><p>Chu Lian’s complexion was as white as a piece of paper. She forced a smile and said, “Royal Princess, I’m fine. It’s only a minor injury.”</p><br/><p>Upon hearing such a reply, Royal Princess Duanjia sternly shook her head. “No, we can’t be certain until the imperial physician comes over to check. Chu Liu, you shouldn’t move right now.”</p><br/><p>She personally helped Chu Lian up as she spoke. Then, she told Jinxiu to bring a cushioned stool over and carefully supported Chu Lian to sit down.</p><br/><p>The image of He Changdi’s back as he carried Princess Leyao away without even giving a second look was still lingering in Chu Lian’s mind. She felt perplexed and dazed as Royal Princess Duanjia helped her sit down. Her originally pale face had instantly turned even more haggard.</p><br/><p>The emperor and Imperial Concubine Wei came over at this time.</p><br/><p>Chu Lian wanted to stand up to greet the emperor and Imperial Concubine Wei, but the emperor immediately stopped her.</p><br/><p>A rare trace of concern emerged within the emperor’s dignified voice as he said, “Since you’re injured, the usual courtesies can be excused. You should get some proper rest!”</p><br/><p>After observing the situation, Imperial Concubine Wei also treated Chu Lian in a friendly manner.</p><br/><p>“His Majesty is right. You should take a rest. The imperial physician should arrive soon. It was such an unfortunate coincidence. I didn’t think such an accident would happen, but we should thank Sir Xiao for his help this time.”</p><br/><p>Imperial Concubine Wei wanted to continue speaking, but the emperor suddenly gave her an icy look. She was stunned and immediately swallowed her next few words back down.</p><br/><p>She had almost forgotten that the Marchioness Anyuan in front of her was no longer just Honoured Lady Jinyi, who she could casually abuse as she liked. Now that she was the child the emperor had with that bitch, she could be considered a legitimate descendant of the imperial family.</p><br/><p>After receiving leniency, Chu Lian bowed her head towards the emperor, offering a greeting as much as she was able to.</p><br/><p>The emperor looked at Chu Lian in a seemingly nonchalant manner, but he noticed that Chu Lian was in a trance and appeared dispirited.</p><br/><p>He looked towards Xiao Bojian and Imperial Concubine Wei again, then slightly narrowed his eyes.</p><br/><p>“Xiao Bojian, you have accomplished a commendable deed for rescuing someone this time. We’ll keep this in mind for the time being and grant you a reward when We return to the palace. If there’s nothing wrong after the imperial physician’s examination, then the both of you can go back to your tents for an early rest.”</p><br/><p>Both Chu Lian and Xiao Bojian replied in agreement.</p><br/><p>However, the expressions of the people beside them had all subtly changed.</p><br/><p>What was going on? Why was the emperor suddenly favouring Xiao Bojian right now?</p><br/><p>What great merit had he achieved? He had merely saved Honoured Lady Jinyi, who also happened to be Marchioness Anyuan. Moreover, he did it voluntarily. Why was he being rewarded for a commendable deed? Although Honoured Lady Jinyi had been conferred a title, she wasn’t really a descendant of the imperial family. The emperor didn’t need to grant a reward since this matter had nothing to do with him…</p><br/><p>Everyone was confused about this situation.</p><br/><p>However, they looked at Xiao Bojian and Chu Lian with even more complicated emotions in their eyes.</p><br/><p>Imperial Concubine Wei promptly dismissed the audience of ladies.</p><br/><p>The imperial physician came to take Chu Lian and Xiao Bojian’s pulses respectively. As Chu Lian had insisted, she hadn’t sustained any major injuries. She only had some minor scratches and bruises, and she had also suffered some fright. However, Xiao Bojian was heavily injured. He had not only sprained his ankle, but also sustained some internal injuries. It would probably take at least two to three months for him to recover.</p><br/><p>Wenqing and Wenlan helped Chu Lian to walk forward. She turned towards Xiao Bojian and bobbed in gratitude.</p><br/><p>Xiao Bojian noticed the cold and desolate look within her eyes. A corner of his lips tugged downwards and he whispered, “When did you become so distant from me, Lian’er? Didn’t I just risk my life to save you? That was what I promised you earlier.”</p><br/><p>Chu Lian frowned and gave him a complicated look. She didn’t say anything else, then turned around and left.</p><br/><p>Xiao Bojian stared after Chu Lian’s slender, delicate back until his line of vision was blocked by some tents. His formerly gentle and handsome face instantly turned gloomy and vicious.</p><br/><p>He clenched his fists and kicked the cushioned stool that Chu Lian had been sitting on earlier.</p><br/><p>Xiao Bojian couldn’t control the rage within his heart. It was as if his entire body had been set alight with fire.</p><br/><p>“Preposterous! She didn’t believe me!”</p><br/><p>The imperial physician was shocked by his abrupt actions and lost the ability to respond for a moment.</p><br/><p>He couldn’t believe that that handsome man, who had appeared so gentle in front of the emperor and Honoured Lady Jinyi earlier, had suddenly morphed into a devil from hell.</p><br/><p>He couldn’t help but shudder when he saw the infuriated expression on Sir Xiao’s face.</p><br/><p>Imperial physicians were just low-ranking officials working in a high-risk profession. They had already trained themselves to become sturdy and resistant to shock. Thus, he was only stunned for a few seconds when he saw this unexpected side of Xiao Bojian. After that, he continued to treat Xiao Bojian’s injuries like a puppet.</p><br/><p>One glanced at the imperial physician beside him, who was treating the wounds while half-kneeling. He whispered to Xiao Bojian, “Sir, you’re already injured. Anger won’t help your wounds to heal.”</p><br/><p>It seemed like Xiao Bojian had just wanted to vent out the resentment within his heart. He closed his eyes and suppressed his anger after hearing One’s advice.</p><br/>\n</div>"}