{"title": "Chapter 654 - Hot Springs (2)", "id": 654, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-654-hot-springs-2", "volume_title": "Volume 7", "body": "<h1>Chapter 654 - Hot Springs (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 654: Hot Springs (2)</strong></p><br/><p>As expected, the imperial residence in Shangjing wasn’t far at all. They had departed in the morning, and they arrived in the middle of the afternoon.</p><br/><p>The attendants of the imperial residence had already received notification some time ago. They were aware that the emperor would bring the rest of the imperial family and officials from the spring hunt over to rest, so they had already arranged rooms for everyone on the list.</p><br/><p>Their dwellings were distributed according to their ranks.</p><br/><p>Marquis Anyuan was a second-ranked title, so the temporary courtyard they were assigned to would obviously be fitting of that title.</p><br/><p>The neighbouring courtyards were for Lord Yang and Marquis Dingyuan.</p><br/><p>Once Chu Lian had settled down, Wenqing immediately set off to get the imperial physician.</p><br/><p>Chu Lian laid down on the bed, leaving only her left wrist free and uncovered. Physician Li gently grabbed her wrist and put two fingers on her pulse, spending quite some time to measure it.</p><br/><p>Physician Li thought for a bit, then took the pulse on Chu Lian’s right wrist as well.</p><br/><p>Physician Li’s brows drew together as she finally put down Chu Lian’s wrist and sunk into deep thought.</p><br/><p>Wenqing became impatient from looking at the physician’s expression. She asked, “Physician Li, how is our young madam?”</p><br/><p>After much deliberation, Physician Li found the pulse too light to make a decisive diagnosis, so she gave a safer answer instead. “Honoured Lady has been overly anxious over the past two days, and along with the shock she’s received, she has a lack of both qi and blood now. There isn’t any sickness in her body; all she needs is more nutrition to recover.”</p><br/><p>Chu Lian felt silly now. So she was only feeling weak because of low blood sugar…</p><br/><p>Relief washed over Wenqing and Wenlan as they heard Physician Li’s words.</p><br/><p>A sliver of a smile finally appeared on Wenqing’s face. “Sorry for troubling you, Physician Li.”</p><br/><p>Physician Li waved her hand in protest. “This is part of my duty. Honoured Lady, since you’ve come to Shangjing, perhaps you could consider going for a soak in the imperial residence’s hot springs?”</p><br/><p>Chu Lian nodded with a smile, then had Wenqing see Physician Li out.</p><br/><p>The fact that Chu Lian had sent for the imperial physician naturally couldn’t be kept away from He Changdi. He Changdi once again strove to get some time away from his duties with the emperor, and rushed to the courtyard Chu Lian was at.</p><br/><p>Physician Li had already returned to the area where the other imperial physicians were resting.</p><br/><p>The physician who had come along for the spring hunt this time was the Imperial Physician Institute’s Imperial Physician Sun.</p><br/><p>Imperial Physician Sun was in his fifties, and his family had all come from medical backgrounds. Currently, other than the director of the institute, he possessed the highest official position and status in the Imperial Physician Institute.</p><br/><p>He had great medical expertise and had ample experience. Although he wasn’t a match for the legendary Great Doctor Miao, he was still a well-known physician.</p><br/><p>The field that Imperial Physician Sun specialised in wasn’t pediatrics, nor external or internal injuries. It was gynecology.</p><br/><p>He possessed the lauded title of the Godly Gynecologist.</p><br/><p>Physician Li was a female physician of great skill in the palace. She had also received pointers from Imperial Physician Sun.</p><br/><p>Once she met up with Imperial Physician Sun, she described Chu Lian’s pulse in detail to him.</p><br/><p>“Uncle Sun, Honoured Lady Jinyi seems to have a slippery pulse. Do you think Honoured Lady Jinyi is pregnant?” Physician Li couldn’t confirm if this was the case, so she had chosen not to mention this to them earlier.</p><br/><p>Imperial Physician Sun stopped what he was doing and stroked his white beard.</p><br/><p>“From what you described, there’s a seventy percent chance that she’s actually pregnant, but it could also be a symptom of her weakened body. You made the right choice with your diagnosis. As physicians of the Imperial Physician Institute, we shouldn’t make rash claims without certainty. Even if Honoured Lady Jinyi is pregnant, this isn’t a good time to diagnose her condition. Just wait a few days, and we’ll be able to confirm it.”</p><br/><p>Physician Li nodded, she very much agreed with Imperial Physician Sun’s view.</p><br/><p>It was better to speak cautiously when treating royalty. If she claimed that Chu Lian was pregnant, everyone might become overjoyed, but if it turned out to be a mistake, the consequences would be terrible for her. It was always better to take the safe route for an imperial physician.</p><br/><p>Marquis Anyuan wasn’t someone she could provoke, with his lofty position.</p><br/><p>Furthermore, Honoured Lady Jinyi was on good terms with a personage like Princess Wei.</p><br/><p>Thus, due to a combination of many factors, Chu Lian’s pregnancy was temporarily kept a secret.</p><br/><p>When He Changdi hurried over, Physician Li was already long gone.</p><br/><p>There were only a couple of unfamiliar servants outside the room, who were maids of the imperial residence.</p><br/><p>Wenqing and Wenlan were both inside the room.</p><br/><p>Laiyue stayed outside as He Changdi walked in. His sharp eyes swept around the room, but all he saw was Wenqing and Wenlan who were cleaning up.</p><br/><p>“Where’s your young madam?”</p><br/><p>He Changdi frowned and asked.</p><br/><p>Wenqing and Wenlan were feeling rather unhappy with He Changdi, but they didn’t dare to show any disrespect to him.</p><br/><p>The two sisters bowed their heads and answered, “Third Young Madam has gone to the back to soak in the hot springs.”</p><br/><p>HeChangdi paused, then took off his cloak and handed it to Wenqing. He walked two steps over to a table and sat down.</p><br/><p>His voice was akin to frosty winds in their ears as he asked, “What happened? Why did you call for the female physician?”</p><br/><p>Wenqing reported every detail of the matter of Chu Lian feeling unwell to He Changdi.</p><br/><p>“And what did Physician Li say?”</p><br/><p>“Her diagnosis was that Third Young Madam has suffered from too much worry and lacks qi and blood. Third Young Madam requires more nutrition to recover.”</p><br/><p>With his memories of his previous life, He Changdi had no faith in the physicians from the palace, be they imperial or lady. He was worried about Chu Lian’s well-being, so he had already concluded that he would have Great Doctor Miao give her a check-up once they returned.</p><br/><p>“When did Lian’er go in?”</p><br/><p>Wenqing estimated the time. “It has been a while, approximately thirty minutes.”</p><br/><p>He Changdi was worried that Chu Lian had lost consciousness from staying too long in the hot springs, so he took off his robe and entered the adjoining bathing hall where the hot springs were.</p><br/>\n</div>"}