{"title": "Chapter 663 - Suspicion (1)", "id": 663, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-663-suspicion-1", "volume_title": "Volume 7", "body": "<h1>Chapter 663 - Suspicion (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Transmigrator Meets Reincarnator</strong><strong>Chapter 663: Suspicion (1)</strong></p><br/><p>Chu Lian seemed rather confused. She couldn’t understand what Senior Servant Zhong meant by her words.</p><br/><p>She turned towards Senior Servant Zhong with a dazed expression. Since they were getting along well now, why did they have to sleep separately?</p><br/><p>Senior Servant Zhong coughed and tried to explain patiently, “Third Young Madam, since you’re pregnant now, you have to take care of your body. You and Third Young Master are both young, so it might be hard to… control yourselves at night. If your activities were to harm the child, then it wouldn’t be good, wouldn’t it?”</p><br/><p>Senior Servant Zhong had already phrased it as directly as she could. If Chu Lian couldn’t understand it even now, then she would be an idiot.</p><br/><p>Chu Lian’s face immediately flushed red. That… she had never thought of the problem of sleeping arrangements after getting pregnant.</p><br/><p>While Chu Lian wasn’t very willing to sleep separately, she had come from the modern world and she didn’t know what the customs were here. She didn’t know what He Changdi’s opinion was either.</p><br/><p>Thus, she decided not to blindly make a decision now.</p><br/><p>Chu Lian acted as if she was too shy to speak and refused to reply.</p><br/><p>Senior Servant Zhong got a little antsy upon seeing that she wasn’t replying, “Third Young Madam, please listen to this old servant. The first three months of pregnancy are crucial, and it’s easy for accidents to happen at this stage. Furthermore, all noble families follow this rule.”</p><br/><p>The old servant was about to try persuading her further, when a low and menacing man’s voice sounded behind her, “No need. Just bring in a chaise for me next to the bed.”</p><br/><p>Hearing that it was He Changdi behind her, Senior Servant Zhong turned around in stunned surprise. Chu Lian looked up, clearly pleasantly surprised to see him.</p><br/><p>The joy shining in Chu Lian’s sparkling eyes couldn’t be hidden at all, they shone like two bright stars.</p><br/><p>Facing her elated expression, He Changdi knew that his decision had earned his wife’s favour.</p><br/><p>Senior Servant Zhong gaped a little before replying reluctantly, “Wouldn’t that be too hard on Third Young Master?”</p><br/><p>“There’s no need to say anymore. I’ve already decided.” He Changdi’s tone was resolute, leaving no room for anyone to change his mind.</p><br/><p>Senior Servant Zhong shut her mouth and sighed inwardly. She was also happy for Third Young Madam, Third Young Master seemed to care for Third Young Madam more than she thought.</p><br/><p>“Understood, this old servant will make the arrangements now.”</p><br/><p>He Changdi waved his hand, “If there’s nothing else, you’re dismissed.”</p><br/><p>Senior Servant Zhong bobbed in respect and was about to leave when He Changdi called out to her, “<i>Momo</i>, keep the servants under control. Don’t let the news of Lian’er’s pregnancy out for the time being.”</p><br/><p>Senior Servant Zhong seemed to hesitate, “Then the old residence…”</p><br/><p>Ever since they had moved out from the Jing’an Estate, for He Changdi and Chu Lian, the Jing’an Estate had become the old residence.</p><br/><p>He Changdi paused before shaking his head slightly, “Keep it a secret from the old residence too. We’ll wait until Lian’er hits two months and her pregnancy is stable, then I’ll take Lian’er personally to the old residence to announce the good news.”</p><br/><p>Senior Servant Zhong was thinking of persuading him otherwise, but when she thought back to Great Doctor Miao’s diagnosis, she swallowed her words back down. Great Doctor Miao had said that they had almost lost the child in Chu Lian’s belly. If anything happened, and they told the old residence too early, wouldn’t it just turn out to be false hope? The senior family members in the old residence might even blame Third Young Master and Madam for it.</p><br/><p>Waiting until the pregnancy was stable before announcing it would be the best course of action.</p><br/><p>Senior Servant nodded upon understanding the circumstances. She bobbed once again towards Chu Lian and He Changdi, before quietly retreating out of the room to manage the other maidservants.</p><br/><p>Once Senior Servant Zhong left, He Changdi strode over to Chu Lian’s side.</p><br/><p>He reached out with his powerful arms and slid them under her knees and back. He lifted her from the chaise in a princess carry, then settled onto the chaise with her on top.</p><br/><p>He Changdi placed one hand on Chu Lian’s shoulders, while the other was placed gently on her belly.</p><br/><p>His tone was filled with a soft warmth.</p><br/><p>“Lian’er, we’re going to have a child.”</p><br/><p>Chu Lian was equally happy. She had been waiting for this little bean’s arrival for a few months!</p><br/><p>“Hubby, would you like a boy or a girl?”</p><br/><p>Chu Lian raised her head to stare into He Changdi’s soft gaze.</p><br/><p>He Changdi bent his body over slightly to place a kiss on her smooth forehead, “A daughter. It would be best if she looks like you, she’ll definitely be very cute.”</p><br/><p>Chu Lian puffed up her cheeks and glared at him, “You’re just saying that to make me happy, right? Eldest Brother only has Little An and Little Lin, and Second Brother hasn’t gotten married yet. It’s not just Grandmother, but even Father and Mother are probably waiting for me to give birth to a boy!”</p><br/><p>He Changdi stiffened up, he hadn’t expected Chu Lian to respond this way.</p><br/><p>He thought back to what Great Doctor Miao had told him in private. The doctor had mentioned that pregnant women were more susceptible to changes in mood as well as emotions, and that he had to be more understanding and forgiving of his wife.</p><br/><p>His brows relaxed and he stroked Chu Lian’s silky hair with one hand.</p><br/><p>Actually, He Changdi had truly been speaking his mind. He did want a daughter for his first child.</p><br/><p>When he thought of having a mini Chu Lian running around, his heart immediately melted into a puddle of mush.</p><br/><p>“Whether it’s a boy or a girl, they’ll be our child, I’ll treat them the same.”</p><br/><p>If the future little bun were to find out what his father had said today, he would definitely burst into tears and question his father.</p><br/><p>A satisfied smile surfaced on Chu Lian’s face after getting He Changdi’s answer.</p><br/><p>She was a modern person at heart and she didn’t favour any gender in particular. No matter which gender their child belonged to, she would still guide and protect them the same.</p><br/><p>Furthermore, it wasn’t up to her whether she gave birth to a boy or a girl. If it didn’t turn out to be a boy, then it was He Changdi’s problem.</p><br/>\n</div>"}