{"title": "Chapter 660 - Let Me Lean on You (2)", "id": 660, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-660-let-me-lean-on-you-2", "volume_title": "Volume 7", "body": "<h1>Chapter 660 - Let Me Lean on You (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 660: Let Me Lean on You (2)</strong></p><br/><p>Finally, Laiyue broke under the weight of her gaze and spoke the truth, “Third Young Madam, this servant deserves death for lying to you. However, Third Young Master already gave me an order… Last… last night, this servant and Third Young Master went into the forest to pick medicinal herbs. It wasn’t until midnight that we finally found all the ingredients that Imperial Concubine Wei needed.”</p><br/><p>What!</p><br/><p>Chu Lian stared at Laiyue in shock, her almond-shaped eyes even wider than usual.</p><br/><p>Laiyue thought that Chu Lian didn’t believe his words. He pleaded with a sincere and put-out tone, “Third Young Madam, this servant is speaking the truth this time. If this servant lies, then this servant will never…”</p><br/><p>“Alright, alright, I heard you. I believe you,” Chu Lian cut off his vow and let down the curtain covering the carriage entrance. She settled back into her seat in the carriage.</p><br/><p>Imperial Concubine Wei!</p><br/><p>Chu Lian was all puffed up with anger. That woman actually dared to bully her man!</p><br/><p>That lunatic He Changdi… He was clearly just a fool! He was so stupid to actually agree to such a ridiculous demand too! Oooh, she was so angry!</p><br/><p>Although Laiyue could sense that Third Young Madam was angry, the carriage remained stationary outside of the palace gates.</p><br/><p>Did this mean that Third Young Madam was going to wait for Third Young Master to be done?</p><br/><p>Laiye perked up. While Third Young Master and Madam had been fighting, he had been the one who suffered the most.</p><br/><p>Even he thought himself pitiful.</p><br/><p>He Changdi stood with his back ramrod-straight as he strode quickly down the white jade steps of the palace.</p><br/><p>His face was ashen. His healthy pink lips were now white and peeling. He would also let out a low cough from time to time, it was clear that he had fallen sick.</p><br/><p>However, his icy aura and cold demeanour leant a hint of beauty even to his ill pallor.</p><br/><p>While walking along the path to Xuanwu Gate, he kept his gaze lowered. It wasn’t until he reached the gates that he looked up.</p><br/><p>Only to see a familiar carriage stopped right outside the palace gates, with Laiyue and the estate’s guards standing next to it.</p><br/><p>He Changdi’s eyes lit up; two sparks of light shining steadfastly in the depths of the darkness.</p><br/><p>The heart he had encased in ice suddenly melted, as if wrapped in a cocoon of warmth, giving him the urge to sigh from the comfort.</p><br/><p>Unknowingly, his steps underneath him quickened.</p><br/><p>Laiyue seemed to have spotted him from afar. Since Laiyue couldn’t pass through the palace gates at this time, he stood where he was and waved at He Changdi.</p><br/><p>For He Changdi, it was as if the clouds had parted, letting the sun shine brightly in his heart once again. He didn’t mind Laiyue’s silly grin for once and walked over to his manservant in a rare good mood.</p><br/><p>Once he stepped out of the palace gates, Laiyue grinned at him and said, “Third Young Master, you’ve finally come out of the palace! Third Young Madam has been waiting for you for close to two hours!”</p><br/><p>The spark in He Changdi’s eyes was still resplendent. His expression was as cool as ever, like an icy mountain, and his tone was calm as he instructed Laiyue, “After I board the carriage, tell them to return to the estate.”</p><br/><p>Laiyue complied with a smile.</p><br/><p>He Changdi immediately turned and got onto the carriage after that order.</p><br/><p>There was only Chu Lian left in the carriage now. Wenqing and Wenlan seemed to have guessed that he would sit in the carriage with Chu Lian on the way back, so they had gone out and would be returning on horses instead.</p><br/><p>Chu Lian was lying on her side on the long bench of the carriage. The bench had been covered in a thick and fluffy fleece carpet. An exquisite coral fleece blanket had been draped over her body. Even in her sleep, her brow was furrowed, showing how badly she slept.</p><br/><p>He Changdi made it to her side in two steps and sat down beside her. He reached out and hugged her tightly, pulling her to sit on his lap with her head resting on his broad shoulders.</p><br/><p>Chu Lian hadn’t been sleeping too deeply, so she was woken by his movements.</p><br/><p>For some reason, waking up in this position in his embrace and seeing his pale face closeup brought a pang of heartache. Tears gathered in Chu Lian’s eyes and started falling.</p><br/><p>Chu Lian returned his embrace with arms around his neck as she wiped at her tears with one hand.</p><br/><p>She was a little frustrated with herself. What was going on with her mood? Why was she crying for no reason? She had never been a crybaby!</p><br/><p>He Changdi’s heart had already been aching for his wife ever since the day he had seen her with tear tracks on her face. Now that she was crying right in front of him, his heart ached even more.</p><br/><p>He lifted her chin with one hand and bent down to kiss the teardrops off her face. He followed the flow of her tears up to the wet corners of her eyes.</p><br/><p>“Lian’er, don’t cry, it’s all my fault.” He didn’t know how to comfort others. All he could do was to repeat those two lines.</p><br/><p>However, the emotion in his voice held a miraculous power that somehow helped to calm Chu Lian down.</p><br/><p>Under his gentle reassurance, her tears quickly stopped flowing.</p><br/><p>Chu Lian sniffled pitifully and tightened her hold around He Changdi’s neck, pressing her face into his chest.</p><br/><p>He Changdi called out gently, “Lian’er?”</p><br/><p>“He Changdi, let me lean on you for a while. I don’t want to talk right now…” Chu Lian’s voice was all muffled, while she was buried in his chest.</p><br/><p>Thus, He Sanlang pressed his lips together and kept his right arm around her waist, while he used his other hand to stroke her soothingly on her back. He looked as if he were comforting a child who was feeling wronged.</p><br/><p>The carriage started moving slowly.</p><br/><p>He Changdi didn’t speak and simply kissed the top of Chu Lian’s head from time to time, enjoying the familiar sensation of his wife in his arms and her enchanting scent.</p><br/><p>Chu Lian hid in the safety of his chest for a long while before finally lifting up her head and looking at He Changdi.</p><br/><p>She could tell that he hadn’t been very well for the past two days. Stubble was growing on his chin and his lips were peeling. There were also dark eye circles under his eyes now.</p><br/><p>Chu Lian couldn’t resist the urge to kiss him, so she reached up a little and kissed his coarse chin. His stubble was all prickly under her soft lips, but it wasn’t uncomfortable. It was just… special.</p><br/><p>He Changdi started for a bit from Chu Lian’s sudden action, and his body froze up for two seconds. Slowly after that, life started returning to his eyes and he met her gaze steadily without blinking, as if he were scared that she would disappear if he blinked.</p><br/>\n</div>"}