{"title": "Chapter 669 - Dejufeng Restaurant (1)", "id": 669, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-669-dejufeng-restaurant-1", "volume_title": "Volume 7", "body": "<h1>Chapter 669 - Dejufeng Restaurant (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 669: Dejufeng Restaurant (1)</strong></p><br/><p>Chu Lian wasn’t the only one who was stunned by the sudden decree from the emperor. He Changdi was incredibly surprised as well.</p><br/><p>At this moment, He Changdi was seated in Prince Jin’s study.</p><br/><p>The two stared at each other in bewilderment. They just couldn’t understand the emperor’s intentions. Could it be that the emperor wanted to raise House Ying up again?</p><br/><p>That wouldn’t be right, a mere bestowal didn’t mean anything. Besides, House Ying didn’t even have any children with talent. Earlier, there had even been a rumour that Chu Lian’s father, House Ying’s Second Master, had been dismissed from office.</p><br/><p>Prince Jin’s azure eyes were filled with doubt. Could it be that his extremely wise father was just having fun causing drama?</p><br/><p>Perhaps he was simply toying with House Ying’s second branch for amusement? Giving them a slap and then handing out some candy? But these candies weren’t even sweet…</p><br/><p>Even the reincarnated He Changdi couldn’t figure out why the emperor had done this.</p><br/><p>After a period of silence, Prince Jin finally spoke, “Ah-di, our earnings aren’t enough to cover our expenses anymore.”</p><br/><p>They now had assistance from House Sima, but they still had to increase their forces, and they had to compete with Sixth Prince in secret. There were too many avenues where funds were needed, so Prince Jin and He Changdi couldn’t even manage to break even.</p><br/><p>Actually, it was easy for them to acquire funds publicly. With their statuses, there would definitely be rich people who would lend a helping hand.</p><br/><p>However, the situation right now was peculiar. Everything had to be done in secret, and for some matters, it was also better for fewer people to be in the know.</p><br/><p>He Changdi’s cool face became increasingly grim.</p><br/><p>“Ah-yi, I’ll find a solution.”</p><br/><p>He Changdi’s eyes deepened. Going by his original plan, it should have been smooth sailing once they secured the silver mine, but there was unexpectedly a slip-up with acquiring the mine!</p><br/><p>“I will send more people to investigate.” As he spoke, Prince Jin handed a letter over to He Changdi.</p><br/><p>“The Heiyu Army sent this.”</p><br/><p>It was no big deal for him to read Prince Jin’s letters, so He Changdi quickly opened the letter and read its contents. What he saw put a slight smile on his face, “Xiao Wujing is truly unscrupulous! He even managed to put a person like Wei Fengzi under his control!”</p><br/><p>“Ah-di, I think we should warn Father about this. I’m afraid Xiao Bojian is plotting something.” Prince Jin was slightly worried.</p><br/><p>Wei Fengzi was Imperial Concubine Wei’s younger sister. They had been born from the same mother and she was Minister Kong’s wife.</p><br/><p>This was something that had they had to think through carefully.</p><br/><p>He Changdi looked out of the window as the skies slowly darkened. It was getting late.</p><br/><p>“Ah-yi, it’s late now, I have to go home.”</p><br/><p>With that said, He Changdi had already stood up and was walking towards the exit.</p><br/><p>Prince Jin scoffed, and sourly replied, “Look at how smug you’ve gotten since Jinyi got pregnant. You’ve probably been staying by her side twenty-four hours a day, right? Even if you don’t mind, Jinyi would be annoyed.”</p><br/><p>He Sanlang’s normally frozen face had changed to something more gentle. There was a warm smile on his face. He hadn’t hid the news of Chu Lian’s pregnancy from his best friend.</p><br/><p>“What? Are you jealous, Ah-yi? Just get General Sima to make a child for you then.”</p><br/><p>After getting teased right back by his friend, the aloof and proud Prince Jin actually blushed.</p><br/><p>Miss Yuan and Royal Prince Shou’s wedding was to be held in two months.</p><br/><p>After the marriage had been bestowed by imperial decree, House Ying started talks with Prince Yongkang over the details of the marriage.</p><br/><p>After the initial buzz of gossip, it was as if the whole capital had gone into absolute silence. In the following month, everything went as smooth as silk. Chu Lian’s restaurant on Zhuque Avenue had already opened.</p><br/><p>Chu Lian had thought of the new restaurant’s name herself, ‘Dejufeng’. Just like the old Guilin Restaurant, this place was separated into inner and outer courts. However, there was now an extra floor of private rooms added on the third floor of the building in the front.</p><br/><p>A small stage had been built to the side of the main hall on the ground floor. Dejufeng had a collaboration with Pear Garden to have their actors come over to perform a show every day at noon and three o’clock.</p><br/><p>As for what the actors would perform, the manager would either set the songs in advance, or allow guests who were having their meal there to pay for a song they wanted.</p><br/><p>This time, there wasn’t as much fanfare to Dejufeng’s opening as when Guilin Restaurant had opened.</p><br/><p>On the opening day, all they had done was to light up two strings of firecrackers and send gifts to the neighbouring shops, and that was it! They were open for business.</p><br/><p>When they opened in such a subdued manner, everyone around them was wondering how this mysterious Dejufeng Restaurant was going to end up. However, moments later, carriage after carriage stopped in front of Dejufeng’s entrance, causing the eyes of those who had been secretly paying attention to open wide.</p><br/><p>Amongst the people who were watching was De’an Restaurant’s Manager Wang.</p><br/><p>Manager Wang stood in the private room on the second floor of his restaurant, with the old bookkeeper who had worked with him for many years by his side.</p><br/><p>Manager Wang had his hands clasped behind his back as he squinted past the half-open window, “Just who is backing Dejufeng? I’ve long heard that Old Lin’s store was bought over by a noble, but when I asked him, the old fogey refused to reveal their identity.”</p><br/><p>The bookkeeper’s gaze landed on Dejufeng’s entrance.</p><br/><p>The newly opened restaurant didn’t look any different from before, it seemed like all that changed was its sign board and nothing else.</p><br/>\n</div>"}