{"title": "Chapter 673 - Jingyan (1)", "id": 673, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-673-jingyan-1", "volume_title": "Volume 7", "body": "<h1>Chapter 673 - Jingyan (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 673: Jingyan (1)</strong></p><br/><p>No way!</p><br/><p>That was what Chu Lian wanted to say, but He Changdi didn’t even give her the time to reject his plea. He took her soft little hand and started moving it…</p><br/><p>After a long time, while waiting for him to finish, Chu Lian was starting to feel that the hand was no longer her own…</p><br/><p>Chu Lian laid in his embrace, panting, her clothes in disarray. Her belt had already been taken off long ago, and the light yellow halter top that was her underwear had been thrown under the chaise by He Sanlang.</p><br/><p>Although Sanlang still wasn’t completely satisfied, for the sake of his wife’s body, he hadn’t gone any further than that.</p><br/><p>Of course, the sounds made by the couple had already been overheard by Senior Servant Zhong, was on duty outside the room.</p><br/><p>Just as He Sanlang was about to carry Chu Lian off to the bathroom, Senior Servant Zhong purposely coughed loudly from outside.</p><br/><p>Chu Lian made an embarrassed and awkward expression. The flush that had receded from her cheeks came back in full force. She secretly pinched He Changdi’s arm, hard.</p><br/><p>He Changdi bent down to kiss her on her forehead, speaking in a low tone to reassure her, “Go ahead and take a bath first. I’ll go talk to <i>momo</i>.”</p><br/><p>Chu Lian wasn’t opposed to this suggestion. Senior Servant Zhong was He Changdi’s servant after all. If he wanted to explain, he could do it by himself. She was too embarrassed to face the old servant.</p><br/><p>He Changdi gently lowered Chu Lian into the bathtub and called Xiyan over to serve her, before vanishing outside to talk to Senior Servant Zhong.</p><br/><p>When Senior Servant Zhong saw that He Changdi had walked out of the bedroom, she hesitated to speak.</p><br/><p>He Changdi coolly spoke up before she could gather her courage, “<i>Momo</i>, you don’t have to worry, I know the limits. Uncle Miao has already informed me of what not to do.”</p><br/><p>Senior Servant Zhong showed an awkward smile, “It’s alright as long as Master knows what to do. This old servant shall not overstep her bounds.”</p><br/><p>Once Senior Servant Zhong was done speaking, He Changdi immediately turned back to the bedroom.</p><br/><p>Jingyan had been standing behind Senior Servant Zhong, so she had heard the sounds from the bedroom just the same.</p><br/><p>She waited until He Changdi had turned his back to them before raising her head.</p><br/><p>As her gaze landed upon that straight back and slender figure, a mesmerised look appeared on her face.</p><br/><p>Although He Changdi had always kept an unfriendly and cold expression on his face, his looks were top-notch regardless. He wouldn’t lose any of his outstanding aura even if he stood next to Xiao Bojian.</p><br/><p>Especially those dark, deep eyes of his which looked like they could pierce right into the heart of anyone and see through all their secrets.</p><br/><p>Jingyan continued daydreaming about how the icy facade on He Changdi’s face might break during moments of passion. She got so excited that her entire body shivered in anticipation.</p><br/><p>She knew that He Changdi hadn’t gone to bed with Chu Lian for close to two months. Just now, in the bedroom, he had likely only done a quick release. As a normal and healthy young man, how could that be enough to satisfy him?</p><br/><p>Marquis Anyuan treated the marchioness very well. However, how many men were there in this world who could keep their hands to themselves and not stray from their wives? Even if they somehow kept their hearts set on that one person, they still had to work off the excess desire in their bodies somehow.</p><br/><p>Men and women were different. Furthermore, most nobles had a whole harem of wives and concubines in their inner courts. Even when it came to the prince consorts, none of them truly stayed loyal to their princesses.</p><br/><p>Jingyan felt as if she had finally found a chance.</p><br/><p>She had been waiting for so long, but her time had finally come!</p><br/><p>When she thought back to how Mingyan had ended up, she felt that Mingyan had been too stupid!</p><br/><p>Once she had stabilised her position and status in the household, she would definitely find some time to burn some incense for Mingyan.</p><br/><p>Since Chu Lian’s pregnancy had already passed three months, it was about time to announce the news to the old residence.</p><br/><p>She and He Changdi had a discussion and decided to make a trip to the old residence the next day.</p><br/><p>He Changdi accompanied Chu Lian for dinner, but right after they were done, there was a messenger from Prince Jin.</p><br/><p>He Sanlang changed out of his home clothes and took Laiyue and the guards out with him. It was midnight by the time he returned to the estate.</p><br/><p>He Changdi was still worried about Chu Lian, so he immediately went to the bedroom to take a look at Chu Lian once he was back.</p><br/><p>Chu Lian had already fallen asleep. For the past few weeks, Chu Lian had become more and more sleepy. If not for Great Doctor Miao explaining that this was normal behaviour for pregnant women, He Changdi would definitely have kidnapped all the physicians in the Imperial Physician Institute over.</p><br/><p>He Sanlang touched Chu Lian’s flushed cheeks before reluctantly pulling apart from her.</p><br/><p>It was Jingyan’s turn to take the night shift, so He Changdi called her and asked her about Chu Lian’s condition.</p><br/><p>Jingyan followed behind He Changdi obediently and whispered her reply, “Madam was going to wait for Master to return before sleeping, but she started nodding off while reading a book against the headboard. This servant suggested that Madam should sleep first.”</p><br/><p>He Changdi glanced at Jingyan from the corner of his eyes before ordering, “Take good care of your madam.”</p><br/><p>Jingyan watched as He Changdi strode off to the study in the outer court. She bit her lip in frustration. However, her eyes turned in thought for a moment and the corner of her lips curled up in a smirk.</p><br/><p>Xiyan and Jingyan shared a room, so the sound of Jingyan pouring water woke Xiyan up.</p><br/><p>She rubbed her eyes sleepily, still only half-awake. She asked in a complaining manner, “What are you doing in the middle of the night? Why aren’t you by Third Young Madam’s side?”</p><br/><p>Jingyan jumped in fright and quickly hid the thin nightgown she had already prepared. Her voice was rather tense as she replied, “Third Young Madam is asleep. I was all sweaty and I couldn’t sleep, so I came back to wipe of the sweat first. I’ll go right back once I’m done, and I’ll be done quick. Don’t worry.”</p><br/><p>Xiyan didn’t think too much of it. Jingyan was normally very quiet and kept her focus on her task. Although she didn’t do her tasks very well, it wasn’t too bad either. Her work was just average, but Chu Lian had never said anything about it. Xiyan turned around and continued sleeping, not thinking to bother with Jingyan.</p><br/>\n</div>"}