{"title": "Chapter 670 - Dejufeng Restaurant (2)", "id": 670, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-670-dejufeng-restaurant-2", "volume_title": "Volume 7", "body": "<h1>Chapter 670 - Dejufeng Restaurant (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 670: Dejufeng Restaurant (2)</strong></p><br/><p>Thanks to the trend Guilin Restaurant had set on its opening day, any new shop with a noble backer and some money would at least put on a lion dance performance to liven things up.</p><br/><p>If they attracted the attention of the civilians around, the name of the shop would be spread around by word of mouth.</p><br/><p>However, Dejufeng was different. They hadn’t even bothered sounding a gong or beating a drum for their opening. Instead, they were ridiculously low-profile.</p><br/><p>Manager Wang had experienced many ups and downs at his old age, so this put him deep in thought, “Such an abnormality is a sign that something is amiss. Old Zhao, your eyesight is better than mine, can you make out which families those carriages are from?”</p><br/><p>Actually, Manager Wang had just been asking rather casually. Although his eyes were old and his vision was blurry, he was still able to make out the shape of the carriages. Those were just ordinary green carriages. There wouldn’t be anyone of high status in those, so he was just asking offhand.</p><br/><p>The old bookkeeper was probably thinking that way as well, but when he saw a particular person being helped off the carriage, he was so shocked that he nearly fainted.</p><br/><p>He quickly gripped the table beside him with his other hand covering his chest. He had an expression of excitement, yet of dread.</p><br/><p>Manager Wang was startled by his sudden movement, and quickly helped him up. With creased brows, he asked, “Old Zhao, what’s going on with you? Weren’t you completely fine a moment ago? Why do you have such an ugly expression on your face?”</p><br/><p>The bookkeeper waved his hand. Bookkeeper Zhao was expert at his work, but he had another skill, which was a photographic memory.</p><br/><p>He was practically able to remember the faces of anybody that he had met once.</p><br/><p>Once, when he had been walking out of De’an Restaurant’s accounts room, he happened to overhear the emperor having a conversation within a private room. He had been so frightened by it that he ran off immediately. Later on, curiosity got the better of him as he peeked at the reigning emperor’s face from afar. With that one glance, the face of the emperor remained in his memory up till now.</p><br/><p>De’an Restaurant’s dimsum was considered top-notch in the capital, so it wasn’t strange for the emperor to come down to have a taste incognito.</p><br/><p>Once he caught his breath, he looked at Manager Wang while appearing choked-up but smiling. Moments later, he whispered into Manager Wang’s ear, “Manager, the one who just alighted the carriage was…”</p><br/><p>The old bookkeeper first pointed at the skies with his forefinger, then raised his thumb. He nervously gulped down his saliva.</p><br/><p>Manager Wang froze up in shock, then widened his eyes in uncertainty. He gripped the bookkeeper’s shoulder and asked, “Are you sure… that you didn’t make a mistake?”</p><br/><p>The old bookkeeper shook his head with a bitter smile, “Manager, you know my ability very well, when have I ever made a mistake in identifying someone?”</p><br/><p>Hearing the certainty in the old bookkeeper’s voice, the two old men shrank back, and were even more in awe of Dejufeng now.</p><br/><p>That’s right! On the opening day of Dejufeng, the emperor himself had secretly come to support them!</p><br/><p>As Chu Lian was still confined in the estate due to her pregnancy, she didn’t learn of this on the day itself, but He Changdi did inform her of this later on.</p><br/><p>She didn’t know how to react. The emperor had given her too much of an honour. The emperor had personally gone to support the restaurant that she secretly opened!</p><br/><p>Since the ultimate boss had already gone, the other officials of the court would also go down to the restaurant, even if it were just to flatter the emperor. Therefore, there was no need to fear that there would be a lack of customers.</p><br/><p>The emperor was practically a living signboard.</p><br/><p>Besides, Dejufeng’s food could only be better and never worse than Guilin Restaurant before its closure. Anyone who had eaten at Guilin Restaurant before would definitely realise what was going on.</p><br/><p>There was simply no need to guess who the actual boss of Dejufeng was, as it was definitely Marchioness Anyuan.</p><br/><p>Chu Lian left Dejufeng in the care of Zhou Wen, who had come recommended by He Changdi, while the northern border’s market was left to Manager Qin.</p><br/><p>The northern market had already expanded to over ten times its original size according to Myeryen and his brother, who had come back from the northern border. Even Chu Lian found this hard to believe.</p><br/><p>Myeryen and Narisong were now incredibly fluent in Mandarin. If one heard their voice without seeing their faces, they definitely wouldn’t be able to guess that they were ‘barbarians’.</p><br/><p>Myeryen and Narisong now worked under Manager Qin, and were responsible for supervising the northern market. Currently, Liangzhou was no longer just a place for the Great Wu Dynasty and the barbarians to trade, it had become a place that attracted merchants from the surrounding countries. This meant that there was now a new trade route between Su City and Liangzhou that came out of nowhere!</p><br/><p>Liangzhou City was no longer the desolate city that Chu Lian had left four months ago.</p><br/><p>While it was still a simple and crude border city in appearance, the amount of traffic and business it was getting could be compared to Su City’s.</p><br/><p>Originally, Urihan had wanted to stay by Chu Lian’s side, but Chu Lian hadn’t agreed.</p><br/><p>She knew that Urihan loved her sons very much, and that she wouldn’t actually want to leave her sons at all. Therefore, she had Urihan stay with her sons, and had her take care of their everyday needs.</p><br/><p>In the beginning of June, summer arrived in the capital.</p><br/><p>Myeryen and his younger brother Narisong once again came to the capital from Liangzhou.</p><br/><p>They were numerous matters regarding the business that the two needed to report to Chu Lian.</p><br/><p>The scrawny and weak brothers that Chu Lian had met a long time ago now looked completely different.</p><br/><p>Especially Myeryen.</p><br/><p>The bone structure of the barbarians was different from the people of the Great Wu.</p><br/><p>Their features were more pronounced than the people of the Great Wu. They had higher nose bridges, deeper eye sockets and sharper angles over all. The colours of their eyes were also slightly different. If one looked closely, they would find that their eyes were light brown, unlike the amber and brown-coloured eyes that the citizens of the Great Wu Dynasty had.</p><br/><p>After eating well for a few months and learning martial arts training from He Changdi’s personal guards, as well as getting a good education from Manager Qin, nineteen-year-old Myeryen had broken free from the constant torment of his illness, and had grown into a full-fledged, handsome and well-built young man.</p><br/>\n</div>"}