{"title": "Chapter 686 - Baby Moving (2)", "id": 686, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-686-baby-moving-2", "volume_title": "Volume 7", "body": "<h1>Chapter 686 - Baby Moving (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 686: Baby Moving (2)</strong></p><br/><p>In the first three months, He Changdi had still obediently slept on the chaise beside the bed. However, now he refused to let her sleep alone in bed.</p><br/><p>Ignoring the protests of the two senior servants, He Changdi had removed the chaise by the bed and was now hugging her to sleep every night. He would even help her turn around at times. Sometimes, when it came to midnight, Chu Lian would suffer cramping in her legs. Since she slept in his arms, the moment she moved, he would wake immediately and help her with the cramps.</p><br/><p>As time passed and he became used to his ‘work’, Chu Lian was starting to feel that her husband had become even better than Xiyan at taking care of her.</p><br/><p>Chu Lian was still in the midst of a daze. She turned to look up at He Changdi with blank eyes.</p><br/><p>When He Changdi noticed that there wasn’t any pain in her expression, he first heaved a sigh of relief before placing a kiss on her cheek. He lowered his voice and whispered gently into her ear, “What happened?”</p><br/><p>Something moved within her bloated belly again. This time, Chu Lian was completely sure of what was going on. She came back to her senses and burst into a wide smile. She replied He Changdi with an equally soft voice, “Hubby, he’s moving!”</p><br/><p>Ah?”</p><br/><p>The novice dad was completely confused.</p><br/><p>The smile on Chu Lian’s face widened into a grin until her eyes were sparkling.</p><br/><p>She pulled He Changdi’s hand over and set it down on her belly.</p><br/><p>The little bun then helpfully gave another tiny kick.</p><br/><p>He Changdi was trained in martial arts, so his five senses were stronger than most. He could clearly feel a bump suddenly appearing on the smooth skin he was touching, before subsiding back down.</p><br/><p>He reacted just like Chu Lian had and froze up entirely.</p><br/><p>Cracks started appearing in his frozen expression as he processed what was going on. The weird look on his face made Chu Lian burst out into peals of bell-like laughter.</p><br/><p>She covered He Changdi’s hand with her own and wrapped her other arm around his neck. She looked up at him, full of smiles, as she continued watching his expression change.</p><br/><p>This was the first time she had felt the baby move in her whole pregnancy. Being able to share in this moment with her loved one was a different sort of bliss.</p><br/><p>He Changdi gulped hard. His normally clear eyes were now clouded over in bewilderment. He asked stupidly, “This is our child moving?”</p><br/><p>Chu Lian nodded with a smile, “The little fellow is saying his to his dad!”</p><br/><p>As she was talking, He Changdi could feel another bump under his hands.</p><br/><p>This time, the baby kicked much harder than before. Perhaps he had sensed his dear dad on the other side, so he wasn’t holding back in the last. The force of this kick made Chu Lian gasp a little.</p><br/><p>He Changdi’s expression immediately turned into a frown upon seeing this. His face turned somewhat overcast as he asked, “Does it hurt?”</p><br/><p>Chu Lian shook her head, “I’m fine.”</p><br/><p>He Changdi rubbed a circle around his wife’s belly, “Why is this rascal so disobedient?”</p><br/><p>The smile dropped from Chu Lian’s face and she rolled her eyes at her husband, “He’s only a few months old, it’s just a subconscious reaction from our little fellow.”</p><br/><p>He Changdi let out a cold chuckle, which sent a chill down Chu Lian’s spine.</p><br/><p>“He doesn’t know how to take care of you even while in your belly. Well, let’s see how I’ll take care of him when he’s out!”</p><br/><p>A twitch developed in the corner of Chu Lian’s mouth, “Are there any dads like you? He hasn’t even been born yet and you’re already thinking of how to discipline him…”</p><br/><p>“He should be glad he’s not out yet, or it won’t just be a verbal threat.”</p><br/><p>Chu Lian had no words to reply to that…</p><br/><p>However, perhaps the little fellow had realised that he was being threatened by his dear old dad. Later on, whenever He Changdi was by Chu Lian’s side, he refused to move at all.</p><br/><p>Standing far off behind the corner of a wall, Muxiang stared at the happy couple hugging in the pavilion with dead eyes. Her lip was already red from how hard she was biting it.</p><br/><p>There was a poisonous look in her eyes. She wanted Chu Lian to just fall right into the lotus pond.</p><br/><p>Her fists were already clenched so tight that her nails were digging into the flesh of her palm, while her expression was contorted into an ugly mask.</p><br/><p>She had been enduring for all this time, but it was finally time to take action. In this lifetime, anyone who stole away her ‘husband’ would die a gruesome death! Even if it was someone in her previous body!</p><br/>\n</div>"}