{"title": "Chapter 695 - We Are The Same (1)", "id": 695, "volume": 7, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-695-we-are-the-same-1", "volume_title": "Volume 7", "body": "<h1>Chapter 695 - We Are The Same (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 695: We Are The Same (1)</strong></p><br/><p>One of the guards following behind He Changdi moved forward to open the iron cell door before stepping aside respectfully.</p><br/><p>The expressionless He Changdi strode into the jail cell, where only a single lantern was lighting the dark interior.</p><br/><p>His line of sight landed in the corner of that narrow and damp cell, where a human figure was cowering.</p><br/><p>That arrow He Changdi had shot hadn’t taken Muxiang’s life. It had only pierced through her right shoulder blade and crippled one of her arms.</p><br/><p>He still had plenty of questions for her. How could he let her die such an easy death?!</p><br/><p>Perhaps the prisoner had heard the screeching of the cell doors as they opened. The trembling Muxiang lifted up her head, showing her wretched appearance.</p><br/><p>Her gaze went out of focus for a moment, but she could slowly make out the tall figure standing in front of the cell doors. That familiar face looked exactly the same as in her memories.</p><br/><p>However, his expression had changed.</p><br/><p>The high fever that had set in from the wound made her mind a little fuzzy. Muxiang thought that she was hallucinating, so she shook her head and turned to look again, only to realise that He Changdi hadn’t disappeared.</p><br/><p>The sudden and pleasant surprise gave her the urge to jump up and run over to hug him.</p><br/><p>This man before her was her husband, the one who had always treated her warmly and kindly, and had always forgiven her actions. She regretted so much that she had betrayed him and chosen to be with that venomous man instead. Had he finally come back to look for her?</p><br/><p>However, even before she could attempt to hug him, a twinge of pain came from her right shoulder and arm, and a stream of memories ruthlessly doused her burgeoning hopes.</p><br/><p>The intense pain of the arrow piercing through her bones and flesh, as well as that hateful, cold look in his eyes as he had shot her.</p><br/><p>The hope in Muxiang’s eyes shifted to fear and despair. She shrunk back into her body and paddled backwards, as if trying to hide in the corner of the cell.</p><br/><p>Muxiang’s fearful reaction triggered a change in He Changdi’s expression; he smiled.</p><br/><p>However, that smile didn’t even reach his eyes. He strode a few steps closer towards Muxiang.</p><br/><p>Muxiang abruptly covered her head and shouted in alarm, “Don’t… don’t come near me!”</p><br/><p>He Changdi sneered, “Why would I listen to you? Your life is in my hands now.”</p><br/><p>Muxiang stared with wide eyes at the man before as her fear washed over her entire body. Overwhelmed by the feelings, she grew ever calmer instead.</p><br/><p>She continued watching He Changdi with frightened eyes. This person before had the same as he had in her past life, but she just couldn’t put the image of their faces together.</p><br/><p>It wasn’t until now that she wholeheartedly felt how foolish she had been since reincarnating into this life.</p><br/><p>After reincarnating once again, why had she continued chasing after a man? Wasn’t her lesson from the past life enough warning?</p><br/><p>The only person she could count on was herself! Anyone who blocked her way should be slaughtered!</p><br/><p>Muxiang became colder and calmer. The gears in her head turned swiftly. She seemed to have woken up from the haze obscuring her mind, and she finally saw a way through the darkness.</p><br/><p>The look in her eyes became sharper. As she faced the cold man before her, she quickly tried to think of a solution.</p><br/><p>She clutched her own clothes with her uninjured hand and pretended to beg for mercy, “Master, this servant was threatened by someone else! Master, please, on account for my long years of service for the matriarch, please spare this servant’s life!”</p><br/><p>As long as she could escape from He Changdi’s hands, she could leave the capital and leave a life of freedom, unfettered by anyone!</p><br/><p>Whatever Xiao Bojian and He Changdi owed her, she would take it back somehow in spades!</p><br/><p>He Changdi snorted contemptuously, “Did you think I was blind?”</p><br/><p>Muxiang’s pupils dilated. She now knew that feigning weakness wasn’t going to work with He Changdi.</p><br/><p>Yet again, she was filled with regrets. Why hadn’t she realised earlier that he had already changed from the cheerful and optimistic He Changdi of her past life? That he had become someone dark and cunning instead?</p><br/><p>Muxiang lowered her head, wracking her mind to think of a way out. However, she didn’t expect that He Changdi’s next words would cause her to fall into despair.</p><br/><p>“Give it up. You’re destined to die to day here in this jail. I’ll end you personally with these hands.”</p><br/><p>He Changdi’s voice was abnormally calm, yet it carried a sense of cold with them, piercing into her bones and making her shake.</p><br/><p>Muxiang raised her head to look at him in disbelief. The rage and defiance she had managed to suppress came roaring back like an inferno.</p><br/><p>She wasn’t willing to call it quits yet, and she tried and tried again to think of an idea. However, she soon came to realise that she really had no way to escape from here.</p><br/><p>Muxiang let go of her last hopes and turned into a trapped animal, desperate to harm He Changdi by any means possible since she was going to die.</p><br/><p>Suddenly, Muxiang laughed neurotically.</p><br/><p>She bowed her head, her hair falling messily around her, making her look like a lunatic who had lost her mind.</p><br/><p>“He Changdi, since you won’t let me live, don’t think that I’ll let you continue living happily alone! Do you know who I am? Do you know who the person who shares your bed is?”</p><br/><p>He Changdi looked down coolly at Muxiang with his full height. That icy expression made it clear that he thought he was simply watching a joke.</p><br/><p>That disdainful gaze provoked Muxiang into exploding with fury. Her sharp screech echoed in that dark and damp jail cell, like a demon who had crawled up from the depths of hell.</p><br/><p>“He Changdi! Let me tell you, I’m the real Sixth Miss of House Ying! That woman you call your wife is just a freak! A monster!”</p><br/><p>If Muxiang hadn’t personally experienced reincarnation, she wouldn’t have believed in the supernatural or mystical.</p><br/><p>The Great Wu viewed supernatural beings like ghosts or the gods with a mix of reverence and fear. Once He Changdi confirmed that her words were true, then the relationship between He Changdi and Chu Lian would be broken up at the very least. In the worse case scenario, the freak might even be dragged out to be burned to death.</p><br/>\n</div>"}