{"title": "Chapter 701 - Labour (1)", "id": 701, "volume": 8, "url": "http://boxnovel.org/transmigrator-meets-reincarnator-chapter-701-labour-1", "volume_title": "Volume 8", "body": "<h1>Chapter 701 - Labour (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 701: Labour (1)</strong></p><br/><p>Chu Lian suddenly felt a chill down her spine, as if someone was watching her in secret. She frowned slightly and turned back to look, only to see that there were two villager girls carrying baskets and scurrying away from them on the little lane not too far away.</p><br/><p>When Wenqing noticed that the smile on her face had slipped, she asked in concern, “Madam, what’s wrong? Are you feeling any discomfort?”</p><br/><p>Chu Lian stared after the leaving backs of the villager girls for a moment longer before shaking her head, “It’s about time, let’s head back.”</p><br/><p>That evening, as Chu Lian was standing up from the table after her dinner, there was a sharp spike of pain from her abdomen. The expression on her face put the servants in attendance on high alert.</p><br/><p>Senior Servant Zhong ordered Wenqing and Wenlan to help Chu Lian to the bed with a grave expression, while she herself went to the room next door to look for Great Doctor Miao, Physician Li, the midwife and the other servants.</p><br/><p>Great Doctor Miao checked Chu Lian’s pulse before nodding at the two experienced senior servants.</p><br/><p>The time had come!</p><br/><p>Everyone had been waiting eagerly and preparing for this day, so they weren’t very panicked. The birthing room had already been prepared in advance, so Senior Servant Zhong instructed Wenqing and Wenlan, “Hurry, help Madam to the birthing room!”</p><br/><p>Chu Lian’s labour pains had just started, so there was still time before the actual birth.</p><br/><p>While the pain came in waves, she was still able to walk somewhat with the help of the maidservants.</p><br/><p>Senior Servant Gui led two strong menial servants away to boil hot water in the kitchen.</p><br/><p>Senior Servant Zhong called over the guards that He Changdi had arranged to protect the estate, telling one of them to quickly send the news that the madam’s labour had started to the marquis.</p><br/><p>Chu Lian had never experienced pain like this before. Throbbing waves of pain came from her belly. Her legs had turned to jelly, and she could barely stand up. If not for Great Doctor Miao and Physician Li encouraging her to walk before the delivery, she would rather have just laid in bed.</p><br/><p>Despite only wearing a thin layer of home clothes in the warm birthing room, Chu Lian was sweating buckets. By the time night fell and Physician Li told her she could lie down on the bed, Chu Lian let out a long sigh of relief.</p><br/><p>After the maidservants force fed her a full meal, the real torture started.</p><br/><p>It wasn’t convenient for Great Doctor Miao to stay in the birthing room at this time, so he could only sit in the room outside. Physician Li would come out from time to time to report Chu Lian’s situation to him.</p><br/><p>Senior Servants Gui and Zhong were both experienced old women. They stayed in the birthing room with the midwife to help.</p><br/><p>Now Chu Lian was experiencing for herself how noble mothers were. She felt as if her lower half was being split open, along with the most extreme pain she could imagine. She gritted her teeth hard, to the point that her teeth creaked. Her hair was in a mess and sticking to her sweaty face and cheeks, making her feel even more uncomfortable.</p><br/><p>“AH!”</p><br/><p>Finally, with one particularly painful contraction, Chu Lian couldn’t hold back her shout of pain.</p><br/><p>The maidservants waiting outside had their hearts in their throats as they listened.</p><br/><p>The midwife was also sweating profusely. The baby wasn’t even ready yet, but this young madam seemed to have lost her strength already. This put the midwife in a tizzy state.</p><br/><p>“Madam, Madam, you have to hang on! Bear with it! Your water has already broken, we have to get the baby out as soon as possible!”</p><br/><p>The midwife reminded her urgently.</p><br/><p>Chu Lian’s mind was already going fuzzy. Hang on… She wanted to hang on, but she didn’t have any strength left. She couldn’t even keep her eyes open.</p><br/><p>All of her strength seemed to have been sapped out of her, she really couldn’t keep going on…</p><br/><p>As she thought so, Chu Lian’s head slumped to the side as she fell into a dead faint.</p><br/><p>The servants and midwife were all frightened out of their minds and there was a flurry of commotion in the birthing room.</p><br/><p>Luckily, Physician Li managed to calm down her emotions and took out some silver needles. She pushed them into some of Chu Lian’s acupoints, making Chu Lian wake back up.</p><br/><p>“Hurry, the ginseng soup!”</p><br/><p>Wenlan hurriedly brought over the ginseng soup that they had prepared. Physician Li used a teapot with a long spout to make Chu Lian drink it down.</p><br/><p>After getting forced to drink that bowl of ginseng soup, Chu Lian recovered a bit of energy. Her vision was still fuzzy and her mind was also in a daze. After Physician Li called out to her a few times, she frowned as her unfocused eyes stared into thin air.</p><br/><p>Even Physician Li had never seen a situation like this before. She frantically shouted by Chu Lian’s ear, “Madam, Madam! Wake up, Madam! You have to endure! The baby isn’t out yet!”</p><br/><p>Hearing the commotion inside, even Great Doctor Miao could no longer sit still. He stood up to pace around the outer room.</p><br/><p>Suddenly, there was the sound of hoofbeats from outside. Before everyone had the time to be surprised, He Changdi had already swept into the outer room of the birthing area like the wind.</p><br/><p>Although he couldn’t hear any cries from Chu Lian, the terrible expressions on everyone and the grave atmosphere made He Changdi tense up.</p><br/><p>His handsome face went cold, like an ancient lake locked up with frost.</p><br/><p>He strode towards Great Doctor Miao, his tone full of impatience and worry, “Uncle Miao, how is Lian’er?”</p><br/><p>Great Doctor Miao hadn’t gone into the birthing room, so he didn’t know the details. He could only speak in general.</p><br/><p>“The baby is too big, so the situation isn’t looking good.”</p><br/><p>With Great Doctor Miao’s medical skill, he could naturally save Chu Lian and the child in her belly, but he couldn’t guarantee that there would be no side effects to Chu Lian’s health. He was also rather worried at this point.</p><br/><p>The news hit He Changdi like a bolt from the blue.</p><br/><p>He had received the message while he was at Prince Jin’s Estate, so he had rushed back without stopping. He hadn’t expected to receive this news when he returned to the estate.</p><br/><p>Thinking of the possibilities of what could happen to Chu Lian, his heart twisted in pain as if someone had taken away a chunk of it.</p><br/><p>At this time, Chu Lian’s pained scream rang out from the birthing room.</p><br/><p>He Changdi immediately returned to his senses. He turned, intending to barge right into the birthing room.</p><br/><p>Xiyan was guarding the door of the birthing room with a heart full of anxiety. When she saw that the marquis was about to rush in without a care, she quickly stopped him.</p><br/><p>“Master, the senior servants said that men can’t enter the birthing room!”</p><br/><p>There was no rationality left in He Changdi’s mind at this point, all he knew was that Chu Lian had screamed out in pain.</p><br/><p>Xiyan didn’t have any martial arts skill at all, so how could she possibly block He Changdi? She was pushed aside forcefully.</p><br/><p>By the time she climbed back up from the ground, He Changdi had already entered the birthing room…</p><br/>\n</div>"}