{"title": "Chapter 18: Hoping for a Daughter-in-Law", "id": 18, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-18-hoping-for-a-daughter-in-law", "volume_title": "Volume 1", "body": "<h1>Chapter 18: Hoping for a Daughter-in-Law</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 18: Hoping for a Daughter-in-Law</p><br/><p>Support the translator by reading Hidden Marriage on volaretranslations.</p><br/><p>Looking at the stiff pair of father and son, Madam Lu was so worried her heart was breaking, “Tingxiao, do you even hear what I’m saying? Also, what’s wrong with Little Treasure? He hasn’t eaten a bite of food all night and he’s holding that phone like it’s a priceless treasure!”</p><br/><p>Lu Jingli was chewing on some sweet-and-sour ribs, so his voice was unclear, “Little Treasure is waiting for the pretty lady’s call!”</p><br/><p>Madam Lu was completely confused, “What pretty lady?”</p><br/><p>Lu Jingli waved his hands, “Mum, dad, don’t worry so much. Brother already has someone he likes!”</p><br/><p>Madam Lu was surprised but uncertain, “You’re telling the truth? Jingli, don’t trick us!”</p><br/><p>At this time Master Lu also solemnly put down his chopsticks, eyeing Jingli suspiciously.</p><br/><p>“Why would I try to trick you, this is absolutely true. If you don’t believe me, you can ask him!” Lu Jingli looked towards his brother as he said so.</p><br/><p>“Tingxiao, is what Jingli said real?” Master Lu asked in a low voice.</p><br/><p>“Tingxiao, say something!” Madam Lu prompted him.</p><br/><p>Lu Tingxiao: “En.”</p><br/><p>Madam Lu was extremely anxious. After waiting for half the day she had only heard the sound “En”. Immediately her gut was full of fire, “You horrible child, can’t you add even a single word? Why is talking to you always so difficult!”</p><br/><p>Lu Tingxiao: “True.”</p><br/><p>Lu Elders: “……”</p><br/><p>So he really only said one word.</p><br/><p>Madam Lu still couldn’t keep from worrying. She hesitantly asked, “Tingxiao, the person you like……is it a girl or a boy?”</p><br/><p>Lu Tingxiao’s expression turned slightly dark, almost gritting his teeth as he said three words, “It’s a girl.”</p><br/><p>Lu Jingli laughed so hard he almost rolled off his chair, “Of course it’s a girl. What’s more, it’s a very pretty young lady. Our Little Treasure also especially likes her, the phone call Little Treasure is waiting for is from her!”</p><br/><p>Madam Lu almost cried from joy after hearing this, “Our ancestors have blessed and protected us, ancestors have blessed and protected us! Tingxiao, which family is she from? How old is she? Where does she come from? What does she do? What kind of people are in her family? Why didn’t you notify us of anything……”</p><br/><p>Lu Jingli hurriedly stopped her, “Mom, calm down! A lot of things haven’t been set in stone yet. We didn’t tell you because we were afraid you would interfere and mess everything up!”</p><br/><p>Things would probably go sour if they knew Ning Xi’s identity. Ning Xi’s reputation was bad, and she was also in the entertainment industry.</p><br/><p>At this time, Master Lu also opened his mouth, “It’s someone that Tingxiao approves. We won’t have any problems, don’t blindly worry.”</p><br/><p>“What do you mean I’m worrying? Do you not worry? Who is it that’s so distressed that they can’t fall asleep in the middle of the night? Who ends up going on the porch to smoke?” Madam Lu mercilessly exposed her husband.</p><br/><p>However, she felt much more at ease after hearing her husband’s words, “Tingxiao’s opinion of others is very strict, so the girl he picks definitely wouldn’t be subpar. What’s even more rare is that Little Treasure likes her too!”</p><br/><p>As soon as he finished speaking, the phone Little Treasure had been carrying for the whole evening suddenly rang.</p><br/><p>This phone was Lu Tingxiao’s personal phone number, very few people knew it.</p><br/><p>Lu Jingli went over to see, it really was Ning Xi’s number.</p><br/><p>“Is it that girl calling?” Madam Lu asked excited, as if she was immediately going to see her daughter-in-law.</p><br/><p>Lu Jingli nodded his head repeatedly and helped Little Treasure receive the call. Little Treasure didn’t really know how to use the cell phone. Lu Tingxiao had bought one for him before, but he didn’t like to use it and threw it somewhere.</p><br/><p>Immediately, the whole table focused on the phone in Little Treasure’s hand.</p><br/><p>Lu Jingli had the thickest skin and directly went next to the phone to eavesdrop.</p><br/>\n</div>"}