{"title": "Chapter 13: It’s Not Easy to Raise a Child", "id": 13, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-13-it%E2%80%99s-not-easy-to-raise-a-child", "volume_title": "Volume 1", "body": "<h1>Chapter 13: It’s Not Easy to Raise a Child</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 13: It’s Not Easy to Raise a Child</p><br/><p>Support the translator by reading Hidden Marriage on volaretranslations.</p><br/><p>She found a set of child-sized pajamas shaped like a Pikachu that Little Treasure could wear. She had gotten them when she was working part-time and had just casually tossed them in the closet.</p><br/><p>It was easier to settle the change of clothes for Lu Tingxiao since her little brother had left a few sets of clothes with her.</p><br/><p>Ning Xi had felt that she had let down her adoptive parents after reuniting with her biological parents, so did not have the face to meet them. She rarely contacted them and only kept in touch with her little brother Tang Nuo.</p><br/><p>Ning Xi returned to the room to grab a set of new bed sheets and pillow covers after having found the clothes.</p><br/><p>The sofa in the living room was not big enough for Lu Tingxiao to stretch his long legs. She could only move a stool over to add length to the makeshift bed.</p><br/><p>She didn’t have to worry at all for Little Treasure. He washed himself in the bath and put on the cute pajamas by himself, then instinctively headed for the bed to lay down.</p><br/><p>Ning Xi finished bathing and changed into a more conservative pair of pajamas. She walked out after checking that she looked decent.</p><br/><p>“That… Mr Lu, I’m going to sleep first. Call me if you need anything.”</p><br/><p>“Yes.” Lu Tingxiao’s gaze lost focus as he looked at the freshly bathed Ning Xi. The depths of his eyes darkened overwhelmingly.</p><br/><p>The girl was wearing the most ordinary pair of pajamas and had her hair tied into a bun. She had a fresh face and her smooth skin held a natural flush from the steam of the shower.</p><br/><p>He could tell that Ning Xi had dressed conservatively. There was nothing inappropriate with her image.</p><br/><p>However, the situation inside Lu Tingxiao’s heart was a little hard to describe. He had discovered that a certain part of his lower body was faintly raising its head……</p><br/><p>Ning Xi entered her bedroom and suddenly saw that her bedroom had an additional cute little creature. She was put into a wonderful mood.</p><br/><p>A lot of things had developed beyond her expectations since last night.</p><br/><p>“Sleep soon.” She switched off the ceiling light and left the lamp by her bedside switched on. She laid down next to little bun.</p><br/><p>Little Bun blinked, seemingly not having the slightest urge to sleep.</p><br/><p>Ning Xi started to have a headache.</p><br/><p>It seemed like kids needed stories read out to them before they would go to sleep……</p><br/><p>Ning Xi shrugged helplessly, “I don’t know how to tell stories. What if I sing a song for you?”</p><br/><p>Little Bun became filled with anticipation as he nodded.</p><br/><p>Thus Ning Xi gently patted Little Bun’s back as she started to sing softly:</p><br/><p>In the warm and cold autumn days,</p><br/><p>Staying close by your side,</p><br/><p>Quietly watching time fly by.</p><br/><p>Those red leaves amongst the wind</p><br/><p>Caused my heart to be at peace.</p><br/><p>Between wakefulness and drunkenness,</p><br/><p>Resisting the urge to smile.</p><br/><p>Let me be like the snow in the clouds,</p><br/><p>Raining cold gentle kisses on faces</p><br/><p>With endless feelings of lingering,</p><br/><p>Flows endless love in humanity.</p><br/><p>Welcoming the thousand changes of life……</p><br/><p>Ning Xi suddenly paused in her singing since the next line was “Having sex with a lover”……</p><br/><p>Yikes! Weren’t these lyrics a bit inappropriate for the young?</p><br/><p>She should switch to another song……</p><br/><p>Ning Xi coughed once, “Auntie will sing another song for you since auntie forgot the next line!”</p><br/><p>Little Bun nodded obediently.</p><br/><p>Ning Xi wracked her brains to think of a more child-friendly song:</p><br/><p>Jack and Jill went up the hill</p><br/><p>To fetch a pail of water.</p><br/><p>Jack fell down and broke his crown,</p><br/><p>And Jill came tumbling after.</p><br/><p>Up Jack got, and home did trot,</p><br/><p>As fast as he could caper,</p><br/><p>He went to bed to mend his head,</p><br/><p>With vinegar and brown paper.</p><br/><p>It was only after singing three times that she heard sweet snoring start from her side.</p><br/><p>It wasn’t easy to raise children!</p><br/><p>She suddenly felt admiration for Lu Tingxiao as a single dad.</p><br/><p>She wondered who little bun’s mother was. Why did she give birth to little bun and leave Lu Tingxiao?</p><br/><p>Was it because her status was too low for the Lu family to accept?</p><br/><p>Was it because Lu Tingxiao had some unseen complications?</p><br/><p>Ning Xi slowly fell asleep while going off into wild flights of fancy……</p><br/><p>At midnight, Ning Xi was shocked awake by a sudden muffled sound from the living room.</p><br/>\n</div>"}