{"title": "Chapter 11: Big Bun Plus Little Bun", "id": 11, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-11-big-bun-plus-little-bun", "volume_title": "Volume 1", "body": "<h1>Chapter 11: Big Bun Plus Little Bun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 11: Big Bun Plus Little Bun</p><br/><p>Original and most updated translations are from volaretranslations.</p><br/><p>The first thing Ning Xi did after returning home was taking a nap to restore her lost sleep.</p><br/><p>After she woke up, she went to the supermarket. She bought the ingredients and side dishes, including beer, for a hot pot.</p><br/><p>With her first battle won, she was going to have a hot pot celebration at home!</p><br/><p>Eating hotpot alone, it was as lonely as one could get…</p><br/><p>At least she was already used to it after being more of a loner all this time.</p><br/><p>There was a knock on the door right as she was about to start cooking.</p><br/><p>Who was visiting at this time?</p><br/><p>Ning Xi became stunned as pulled the door open suspiciously.</p><br/><p>Lu Tingxiao was standing outside the door dressed in a snappy western suit, with a dark outer coat.</p><br/><p>Little bun was being carried in his arms while he was holding a colourful fruit basket.</p><br/><p>This… What kind of strange combination is this?</p><br/><p>“Mr Lu?” Ning Xi swallowed in fright, “Why the surprise at this hour? Is there something the matter?”</p><br/><p>Lu Tingxiao’s thin lips let out two words, “Sick visit.”</p><br/><p>Sick visit?</p><br/><p>He personally came to visit this late at night, even bringing little bun along?</p><br/><p>It was only a small injury, she’s still alive and jumping……</p><br/><p>“Er, you’re being too polite, Mr Lu. Sorry about the mess, please come in” Ning Xi didn’t have time to react. She simply invited them in, flattered yet stunned. She speedily tidied up the whole room as she removed the junk from the couch and shoved the piles of clothing under the bed….</p><br/><p>“Sit anywhere you’d like, do you want to have something to drink? Is green tea or milk okay?” While keeping busy, Ning Xi was wracking her brains trying to guess why Lu Tingxiao had come. Unfortunately, she wasn’t able to guess the reason no matter how much she tried since Lu Tingxiao’s train of thought was too deep</p><br/><p>“Sure.” Lu Tingxiao nodded with the expression of a commander replying to a soldier who had just reported on a military situation.</p><br/><p>Ning Xi could only remain confused as she brewed a cup of tea for Lu Tingxiao and poured a cup of milk for little bun.</p><br/><p>Lu Tingxiao was cramped awkwardly on the narrow sofa in the living room with little bun sitting by his side.</p><br/><p>The father and son pair not only looked alike, but their expressions were also exactly the same.</p><br/><p>They were expressionless.</p><br/><p>Silent.</p><br/><p>The scene turned awkward.</p><br/><p>Ning Xi was close to tears while seated opposite them.</p><br/><p>Geez, what were these two here for?</p><br/><p>At this moment, gurgling sounds came from the pot. The air began to fill with an enticing spicy aroma.</p><br/><p>For the sake of breaking the silence, Ning Xi casually asked, “So, have you guys had dinner yet? I was about to have a hotpot, do you want to eat together?”</p><br/><p>Lu Tingxiao: “Okay.”</p><br/><p>Little bun nodded.</p><br/><p>Ning Xi: “…….”</p><br/><p>She was only asking out of courtesy, were they trying to pick a fight by agreeing just like that?</p><br/><p>One is a CEO, while the other is a little young master. They had probably tasted all sorts of delicacies before. Why did they run here to have a small shabby household hot pot with commoners like her?</p><br/><p>Ning Xi felt a little embarrassed at the poor offerings.</p><br/><p>However, she had already spoken. So she could only bite the bullet and invite them to the dining table, adding two more pairs of chopsticks.</p><br/><p>“The soup base I bought is quite spicy, can you take spicy foods?” Ning Xi asked worriedly.</p><br/><p>Lu Tingxiao: “Yes.”</p><br/><p>Little bun nodded.</p><br/><p>Okay then……</p><br/><p>Ning Xi brought the freshly washed ingredients over.</p><br/><p>Lu Tingxiao did not eat much, he was cooking for them most of the time. On the other hand, little bun loved spicy food as much as she did. He still kept eating despite sticking out his tongue due to the spiciness.</p><br/><p>Ning Xi finally got a little worried, “Is it bad for children to eat too much spice?”</p><br/><p>She could not afford the consequences if anything happened to this little prince.</p><br/><p>“Not that delicate.” Lu Tingxiao thought her worries were unfounded.</p><br/><p>With that, Ning Xi kept any other opinions to herself.</p><br/><p>The silent cool-headed Lu Tingxiao suddenly took the initiative to speak up, “How was the audition?”</p><br/><p>Ning Xi froze for a moment before reacting.</p><br/><p>She replied, “It was fairly smooth, so I made a hotpot as a celebration today!”</p><br/><p>Lu Tingxiao raised his glass, “Congratulations.”</p><br/><p>She hadn’t really expected that Lu Tingxiao would be the first person to congratulate her…….</p><br/>\n</div>"}