{"title": "Chapter 26: Ning Xi, We Have Long Days Ahead of Us", "id": 26, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-26-ning-xi-we-have-long-days-ahead-of-us", "volume_title": "Volume 1", "body": "<h1>Chapter 26: Ning Xi, We Have Long Days Ahead of Us</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 26: Ning Xi, We Have Long Days Ahead of Us</p><br/><p>Support the translator by reading Hidden Marriage on volaretranslations.</p><br/><p>Ning Xi coughed a few times. She had been completely defeated by Lu Tingxiao. She hurriedly tried to explain, “I was only joking… it was just a joke…”</p><br/><p>Lu Tingxiao seemed to have gotten hooked on giving away keys. He casually tossed her another, “It’s not easy to call a cab from here. It’s inconvenient for you to travel to work. Take this car to use.”</p><br/><p>Ning Xi: “…”</p><br/><p>Why…</p><br/><p>Why was it that she had a feeling of being kept even though she was only staying for a short period of time?</p><br/><p>Uh, no, if she were being kept, then she should be kept hidden outside. What kind of sugar daddy would entrust all the keys of the main residence, and their son to her…</p><br/><p>Um, this was clearly the feeling of being a newlywed couple…</p><br/><p>She suddenly thought of how Lu Tingxiao had abruptly proposed to her the first time they had met…</p><br/><p>She was confident enough to claim that she understood men, but the man in front of her was like a computer system with the highest grade firewall. She could not see through him at all.</p><br/><p>She didn’t know if agreeing to stay due to one moment of weakness was going to be fortune or disaster…</p><br/><p>Little Treasure was in a bad state tonight. Ning Xi accompanied Little Treasure to sleep on his small bed just in case.</p><br/><p>In the late night.</p><br/><p>The room door was pushed open silently.</p><br/><p>A man walked in with light footsteps and sat down at the foot of the bed.</p><br/><p>Under the warm glow of the bedside lamp, a woman was sleeping. She had stopped in the middle of patting Little Treasure, her breathing shallow, expression warm. Her soft lips were like cherry blossoms blooming in summer, slightly open like an unspoken invitation…</p><br/><p>After a moment, a dark shadow abruptly fell over the warm patch of light as the man’s silhouette drew closer and closer to those pink…</p><br/><p>He was close enough to feel her breathing. As he could reach out to take his prize with just the slightest movement, he suddenly forced himself to stop. A cool kiss landed on the woman’s forehead.</p><br/><p>Ning Xi, we have long days ahead of us.</p><br/><p>……</p><br/><p>The next morning.</p><br/><p>Ning Xi had thought that she wouldn’t sleep well on a strange bed, but she had an unexpectedly good night. She had continued sleeping until she woke up naturally, without even a dream to break the peace.</p><br/><p>She found that Little Treasure was already awake when she woke up.</p><br/><p>The little guy was currently sitting next to her, earnestly reading a book without making a sound.</p><br/><p>He was clearly this well-behaved, yet you really couldn’t imagine how the little bun was when he exploded…</p><br/><p>“Good morning darling~” Ning Xi sat up with the blanket and greeted him warmly.</p><br/><p>Little Treasure immediately raised his head in surprise. Although he didn’t say anything and his expression didn’t change, Ning Xi could tell that he was in a good mood from his expressive eyes.</p><br/><p>Finding it funny, Ning Xi flicked away a stray hair from little bun’s forehead, “Auntie doesn’t have work today. I can accompany you at home for the whole day!”</p><br/><p>Hearing so, the little guy clearly became even happier. He even slightly raised the corner of his mouth.</p><br/><p>Ning Xi’s heart almost bled out of cuteness. She couldn’t resist grabbing his little cheeks and rubbing, “Darling, smile more, you’re too cute when you smile!”</p><br/><p>After washing up, they headed downstairs to find breakfast already prepared.</p><br/><p>Ning Xi didn’t see Lu Tingxiao. The steward and servants did not mention needing to wait for him to eat, so Ning Xi deduced that he had already headed to work.</p><br/><p>After breakfast, Ning Xi had been a little worried on how to take care of a child. What would she do if she didn’t take care of him properly…</p><br/><p>However, all her worries came to nothing.</p><br/><p>In the morning, she read a script while camped on the sofa. Little Treasure was sprawled out on the table at the side, either reading or drawing. The two of them did not bother each other and got along harmoniously.</p><br/><p>The servants only appeared once to deliver snacks and fruits with extremely light movements, as if afraid of disturbing him.</p><br/><p>It seemed that Little Treasure normally preferred silence.</p><br/>\n</div>"}