{"title": "Chapter 29: Soon-to-be Lady Boss", "id": 29, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-29-soon-to-be-lady-boss", "volume_title": "Volume 1", "body": "<h1>Chapter 29: Soon-to-be Lady Boss</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 29: Soon-to-be Lady Boss</p><br/><p>So what?!</p><br/><p>Ning Xi choked, feeling speechless, “Big Boss Lu, do your employees know that you’re using your company’s people to help artistes from other companies?”</p><br/><p>They evidently did not; this famous makeup artist had definitely never heard of her considering how unknown she was.</p><br/><p>She really wanted to kneel to Lu Tingxiao.</p><br/><p>Golden Age Entertainment was one of the subsidiaries of the Lu Corporation at the very least!</p><br/><p>Although Lu Jingli was managing Golden Age now, the boss behind the scenes was the Lu Corporation’s Lu Tingxiao.</p><br/><p>The Lu Corporation began to get involved with the entertainment industry five years ago and bought over Golden Age Entertainment, creating an entertainment empire. They were even able to compete directly with the oldest, leading company in the industry, Starlight Entertainment.</p><br/><p>From this, you could see how fierce the competition was between the two companies, their employees- from artistes to managers to assistants, makeup artists and stylists- could never mix. If there were artistes from both companies present on the same set, there would definitely be some sparks flying.</p><br/><p>Lu Tingxiao looked at his watch, “The minivan is at the door, you can do your makeup and styling on the way there and you’ll make it in time. It’s up to you whether you want to go or not.”</p><br/><p>Ning Xi was so conflicted that her intestines started to hurt, but she still gritted her teeth, “I’m going!”</p><br/><p>Since Lu Tingxiao wasn’t bothered about it, then she wouldn’t care about it either!</p><br/><p>Seeing that Lu Tingxiao had followed along, she was surprised, “You’re going too?”</p><br/><p>“Who else is going to drive? Little Treasure wants to stay a little longer with you as well.” He was using that matter-of-fact tone again, as if whatever he said was truth and she was only asking silly questions.</p><br/><p>Little Treasure nodded vigorously.</p><br/><p>“Okay…”</p><br/><p>In the end, all four of them got on the minivan, together with the stylist Arthur.</p><br/><p>Lu Tingxiao didn’t even change out of his clothes, he continued driving in his casual homewear while Ning Xi and Arthur sat in the back, with Little Treasure watching them curiously as he sprawled over his seat.</p><br/><p>Arthur carefully looked over Ning Xi once, his gaze showing great appreciation, “This lady has perfect features and amazing skin, I don’t need to do much. I’ll just put on some light makeup. What occasion are you going to today, miss? I need to choose the right clothes for you.”</p><br/><p>“Uh, it’s just an opening ceremony for a movie…”</p><br/><p>Ning Xi was deathly afraid that she would get beaten up if he found out that she was from Starlight. Luckily, Arthur didn’t ask much, he only nodded to show that he understood and continued to do her makeup.</p><br/><p>When they were close to the location of the opening ceremony, Ning Xi had been fully made up from top to toe, they had grasped the timing very well.</p><br/><p>Lu Tingxiao stopped the car, then turned to look at the woman behind, with his arm on the back of his seat.</p><br/><p>“How is it?” Ning Xi asked, a little nervous.</p><br/><p>“Not bad.”</p><br/><p>It wasn’t easy to get such a compliment from someone as taciturn as Lu Tingxiao. Furthermore, Little Treasure was tilting his head and looking at her with an awestruck expression.</p><br/><p>Ning Xi was suddenly brimming with confidence and she hugged Little Treasure apologetically, “Darling, I’m so sorry I couldn’t keep my word, but auntie promises you that I’ll quickly return to accompany you after work!”</p><br/><p>Little Treasure hugged her for a moment before reluctantly letting go and waving goodbye, knowing that she was rushing for time.</p><br/><p>Looking at the pair of father and son behind her, Ning Xi’s heart was filled with warmth…</p><br/><p>After battling like a lone soldier for so long, it was the first time she had had such a warm feeling.</p><br/><p>Since Ning Xi had left, the driver’s position was naturally left to Arthur.</p><br/><p>Arthur could no longer hold back his nosiness and carefully asked as he drove, “Boss, who was that lady just now? Is she one of the new recruits of our company? How come I haven’t seen her before?”</p><br/><p>Damn! Their big boss actually had a woman at his side, this was mind blowing news!</p><br/><p>Lu Tingxiao supported his chin, answering leisurely: “An artiste from Starlight.”</p><br/><p>Arthur: “…”</p><br/><p>In an instant, Arthur looked as sour as if he had eaten a lemon.</p><br/><p>Big boss! You actually let me style an artiste from Starlight!</p><br/><p>Why is our boss working for the other side!</p><br/><p>Even our second young master doesn’t date anyone from Starlight, okay?</p><br/><p>If the person sitting here had been the second young master, he would have let loose a string of ranting.</p><br/><p>However, this was the great evil king Lu Tingxiao…</p><br/><p>He could only hold it in, not even daring to let out a single peep of complaint even if it killed him.</p><br/><p>Something else that he couldn’t say out was, that unknown Starlight artiste wasn’t going to become their soon-to-be lady boss, right?</p><br/><p>After all, this woman was even able to win over the little prince.</p><br/><p>She definitely wasn’t simple…</p><br/>\n</div>"}