{"title": "Chapter 39: It’s Not Big Enough", "id": 39, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-39-it%E2%80%99s-not-big-enough", "volume_title": "Volume 1", "body": "<h1>Chapter 39: It’s Not Big Enough</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 39: It’s Not Big Enough</p><br/><p>“Their mothers! Who do they think they are, every single one of them!” Ning Xi suddenly raised a fist agitatedly. If Lu Tingxiao had not reacted quickly, his jaw would have been dislocated by this punch.</p><br/><p>“Girls shouldn’t cuss.” Lu Tingxiao knitted his brows.</p><br/><p>Although she looked cute when she was swearing.</p><br/><p>While Ning Xi was very drunk, her subconscious mind could feel that the person embracing her at the moment was very warm, and had no bad intentions. She slowly relaxed into his arms and slurred drunkenly as she sat in his lap, “It’s only because I feel it’s beneath me… Otherwise… Otherwise with this face… I could find a… a big leg to hug… You think you can suppress me… I’ll go find one now… right now…”</p><br/><p>Lu Tingxiao raised his eyebrow slightly. He picked up the woman’s hand gently with his coarse palm and placed it on his thigh, “The biggest leg in the capital is right here, where else are you going to find a better one?”</p><br/><p>Ning Xi touched that toned thigh all over, then abruptly raged, “It’s not big enough! It’s not big at all!”</p><br/><p>Lu Tingxiao: “…”</p><br/><p>He had been deemed ‘not big enough’.</p><br/><p>This was something no man could accept.</p><br/><p>What was worse, her hand moved about until it touched a place that should not be touched, and she even patted it, “Ooh, what’s this… Annoying… it poked my hand…”</p><br/><p>Her tone was full of disdain.</p><br/><p>Lu Tingxiao’s expression was dark.</p><br/><p>If he let her continue like this, then he was afraid he would do something he would regret.</p><br/><p>The person outside had already left, so Lu Tingxiao quickly opened the door, carrying Ning Xi as he walked out.</p><br/><p>At the underground carpark.</p><br/><p>The one who eagerly ran over to open the door for him was Lu Jingli.</p><br/><p>“You’re here?” Lu Tingxiao frowned.</p><br/><p>“I went to look for you at home, but both you and Little Treasure weren’t there so I came over to look for you! Bro, what happened to the bro code? When did you buy this car? It’s even more impressive than the one you gave to me, and I didn’t even know you had this!” Lu Jingli’s expression was full of resentment.</p><br/><p>Lu Tingxiao ignored him and carried Ning Xi to the backseat without leave.</p><br/><p>Lu Jingli sat in the front passenger seat and turned around to stare at them. His shining gaze took in Lu Tingxiao and Ning Xi’s disheveled clothing. Expecting some gossip, he asked, “Where did you pick her up from? Why did you take so long? See how our Little Treasure is about to turn into a statue!”</p><br/><p>The moment he saw Ning Xi, Little Treasure stopped pressing his face against the car window and stuck to her instead.</p><br/><p>Lu Tingxiao had initially been worried that Ning Xi would have some sort of agitated reaction to Little Treasure’s presence in her drunken state. He hadn’t thought that she would only draw the little guy into her embrace and hug him comfortably like a bolster.</p><br/><p>Of course Lu Tingxiao would not satisfy a certain person’s desire for gossip. He methodically removed his tie, and removed his sweaty coat, “What happened today?”</p><br/><p>Happy at being called to action for his information-gathering skills, Lu Jingli immediately replied excitedly, “From what I heard, everything was going smoothly. You even called Arthur over, so of course little Xixi succeeded in stealing the show. She was received well by the media too!”</p><br/><p>“Who did she meet tonight?” Lu Tingxiao asked again.</p><br/><p>Lu Jingli tried to recall, “Other than the cast and crew, there was only Ning Yaohua. Other than that…”</p><br/><p>Lu Jingli glanced at his brother’s expression, then deliberately considered his words before speaking up, “Su Yan… I’m guessing that she was upset that her old flame became her rival’s man, so she got drunk…”</p><br/><p>Although Lu Jingli had already picked his words carefully, Lu Tingxiao’s face still turned black in an instant.</p><br/><p>It was so scary.</p><br/><p>TL Note: In Chinese, ‘a big leg to hug’ means a backer with a lot of influence. In Ning Xi’s case, she was implying that she can find a sugar daddy at any time, but that she found it beneath her. Lu Tingxiao used the phrase ‘big leg to hug’ literally to make a joke… and got taken advantage of instead. 😛</p><br/>\n</div>"}