{"title": "Chapter 30: Opening Ceremony", "id": 30, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-30-opening-ceremony", "volume_title": "Volume 1", "body": "<h1>Chapter 30: Opening Ceremony</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 30: Opening Ceremony</p><br/><p>At the opening ceremony of ?Land Under Heaven?.</p><br/><p>The cast and crew members were all assembled, lights were flashing one after another, and there were numerous media outlets there. There was even a huge group of fans in the outer ring who had come after hearing the news.</p><br/><p>Most of the media outlets were surrounding the female lead, Ning Xueluo, and the male lead, Zhao Sizhou.</p><br/><p>One of them was the shining star of Starlight Entertainment while the other was the famous star who had won an Oscar. The pairing of a suave man with a beauty naturally drew the attention of everyone.</p><br/><p>“Xueluo, we all know that this is your second time acting as a couple with Sizhou on screen, would you also give your heart to a man like Sizhou in real life?”</p><br/><p>“Haha, Sizhou is indeed attractive, but that won’t happen! I don’t have any space left in my heart for him!”</p><br/><p>The media was clamouring after hearing so.</p><br/><p>Ning Xueluo had publicly announced that she had a boyfriend a year ago. Various people had gone digging for insider news and found out that her boyfriend was actually the son of the Yifeng Corporation’s CEO, Su Hongguang. He had both status and money, and even had good looks to boot- everyone had been filled with envy.</p><br/><p>Although the fans had been upset, fans were not as averse to marriage these days as compared to the past. Most fans even hoped that their idol would find someone good to marry.</p><br/><p>Ning Xueluo’s popularity had not declined in the slightest after revealing that she had a lover. Conversely, she had maintained her popularity with topics like ‘Handsome and rich boyfriend’ and ‘Winner at life’.</p><br/><p>Zhao Sizhou, who was at her side, was good at following up. He immediately held his chest as if his heart hurt, “Miss Shangguan, how heartless of you, this king has already given you everything along with my heart!”</p><br/><p>The female lead that Ning Xueluo was acting as this time was a girl called Shangguan Yingrong, while Zhao Sizhou was acting as a prince.</p><br/><p>Hearing so, the reporters laughed along and teased Zhao Sizhou with a warm air.</p><br/><p>Other than the actors for the male and female leads, the actress for the supporting female lead was the one that everyone had their eyes on. A crowd was surrounding Guo Qisheng.</p><br/><p>“Director Guo, where’s the actress for Meng Changge? Will she be here today?”</p><br/><p>“Of course.”</p><br/><p>“Is it true that you rejected Jia Qingqing because she wasn’t beautiful enough when she came to audition for this role?”</p><br/><p>They were clearly out to cause trouble by asking such questions.</p><br/><p>However, Director Guo was an old hand, he spoke smoothly, “We do have a high standard regarding looks for a role like Meng Changge, but appearance is only one of the criteria we use to judge suitability for the role. There was no problem with Jia Qingqing’s appearance, but she did not match what we were looking for in terms of feeling!”</p><br/><p>“We’ve heard that the one playing Meng Changge is a rookie? Since Meng Changge is such a demanding role, suddenly choosing to use a rookie for this, will she be able to completely fulfill the expectations?”</p><br/><p>What was wrong with the reporters today, had they not given enough ‘bonuses’ to them? Their questions were clearly out to attack them, and were even focused on the supporting female lead.</p><br/><p>“For that question, please wait until our movie is out, just wait and see!”</p><br/><p>The reporters were still unwilling to let go of the question and asked aggressively, “Director Guo, is the actress for Meng Changge prettier than Jia Qingqing?”</p><br/><p>Haven’t they said enough!</p><br/><p>Yes! She’s more beautiful than Jia Qingqing!</p><br/><p>So what if she’s a beauty of a hundred years? Wait till all of you see Ning Xi, let’s see if you still dare to praise Jia Qingqing’s looks!</p><br/><p>“About this, they all have their own merits… you’ll know once she’s here…”</p><br/><p>Guo Qisheng was starting to get annoyed by all these questions. At this moment, glancing over the heads of all the reporters, he spotted someone appearing at the start of the red carpet. He was stunned for at least three seconds before he regained his senses, and he smiled as he said, “Well, look at this, speak of the devil!”</p><br/>\n</div>"}