{"title": "Chapter 33: Trying to Make Me Fall? Not a Chance in Hell", "id": 33, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-33-trying-to-make-me-fall-not-a-chance-in-hell", "volume_title": "Volume 1", "body": "<h1>Chapter 33: Trying to Make Me Fall? Not a Chance in Hell</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 33: Trying to Make Me Fall? Not a Chance in Hell</p><br/><p>“Xueluo, Ning Xi is your junior, do you have anything to say about her acting a role like Meng Changge?” At this time, a reporter who was trying to trip Ning Xi tossed a question at Ning Xueluo.</p><br/><p>Ning Xueluo instantly recovered her calm and elegant expression and sincerely said, “Ning Xi has the skills to pull it off, and I believe she won’t let everyone down…”</p><br/><p>Towards all questions concerning Ning Xi, Ning Xueluo would always praise her generously.</p><br/><p>Those who weren’t in the know would think that she was trying to support her junior, but Ning Xi saw through Ning Xueluo’s scheming.</p><br/><p>This wasn’t helping her, but rather trying to lift her higher so she could fall harder.</p><br/><p>She would praise her to high heaven and raise everyone’s expectations before filming started, so that any little mistake later on would become huge disappointments.</p><br/><p>Too bad, she wasn’t going to let Ning Xueluo’s schemes come to fruition.</p><br/><p>She had piled up her arsenal for five whole years, and she had the confidence to satisfy everyone’s expectations.</p><br/><p>You want to make me fall? Let’s wait and see!</p><br/><p>When the media interview segment had finally ended, Ning Xi had been preparing to take a short break, but was held back by Chang Li.</p><br/><p>“Ning Xi, where did all these come from? Don’t think that the company will help you pick up the bill for this outfit! As a supporting female lead, don’t you know the rules? Who allowed you to steal the limelight?” Chang Li scolded her from the start.</p><br/><p>Ning Xi twirled her natural slight curls and spoke lazily, “I didn’t want to do that either, but who knew that Chang-jie would try to make me late for the ceremony?”</p><br/><p>“You…” Knowing that there were people around right now, Chang Li suppressed her temper, “You had better behave yourself later during the meal, and don’t say something that will shame the company! Xueluo doesn’t have a good tolerance for alcohol, so remember to receive the toasts in her stead! Do you understand?”</p><br/><p>Ning Xi couldn’t help but laugh, “You want me to receive the toasts on her behalf? Miss Chang, are you still dreaming? It’ll be good enough if I don’t toss wine on her!”</p><br/><p>Chang Li and Ning Xueluo were in cahoots, so there wouldn’t be any use even if she groveled before her. She completely refused to buy it. On the other hand, if she blatantly refused to bend to their whims, Chang Li wouldn’t dare to go overboard.</p><br/><p>Chang Li was struggling to hold back her temper, “Ning Xi, you’ve finally grown some backbone. You only got a small supporting role and you’ve already forgotten your surname?”</p><br/><p>Ning Xi had no patience to deal with her and immediately turned to leave.</p><br/><p>Chang Li watched Ning Xi’s back as she left- even though it was just her back, it was enough to entrance people.</p><br/><p>Panic mysteriously rose in her heart.</p><br/><p>She already had a premonition that she wouldn’t be able to hold back Ning Xi anymore.</p><br/><p>This woman was born to act.</p><br/><p>Once she started rising, Ning Xueluo wouldn’t even be able to hold a candle to her.</p><br/><p>However, things had already come to this point. She could only suppress her as much as she could and block any chance of her rising from the ashes.</p><br/><p>There was a banquet dinner after the opening ceremony ended.</p><br/><p>The crew and anyone else related to the movie were gathered together, drinking and eating as they got to know each other. The atmosphere was friendly and relaxed.</p><br/><p>Seeing that Ning Xi had arrived, the screenwriter Ye Linglong was the first to stand up and pull her over to her side, you could tell how satisfied he was with her.</p><br/><p>“Speaking of which, isn’t it such a coincidence that the two beauties of our cast both come from the same company and they even have the same surname Ning!” The assistant director Zhang Rui exclaimed.</p><br/><p>Ning Xi sneered in her heart.</p><br/><p>Hehe, what a coincidence.</p><br/><p>They were in the same company, and even under the same manager. However, their circumstances were vastly different.</p><br/><p>One was already the star of Starlight, while the other was still buried deep in the lowest layers of the entertainment circle. </p><br/><p>As they were talking, the producers and directors suddenly all stood up to welcome someone who was walking in from the entrance. It was the biggest sponsor of the movie, the Chairman of the Board of Directors of the Ning Corporation, Ning Yaohua.</p><br/>\n</div>"}