{"title": "Chapter 47: Red Roses Everywhere", "id": 47, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-47-red-roses-everywhere", "volume_title": "Volume 1", "body": "<h1>Chapter 47: Red Roses Everywhere</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 47: Red Roses Everywhere</p><br/><p>It was the first day of filming today at the studios on the outskirts of the capital.</p><br/><p>The first scene was a court banquet where the emperor was going to receive some foreign emissaries. The seventh prince Chu Beichen and his consort Shanggong Yingrong would use their quick wits to counter the challenges from the emissaries. As the Consort De, Ning Xi did not need to do much. She only needed to act as a bewitching and graceful ornament by the emperor’s side.</p><br/><p>However, even so, wearing so many layers of ancient style clothing on such a hot day was bad enough.</p><br/><p>Especially since Ning Xi’s costumes were the most complicated. Not only were the clothes thick, even the accessories on her head weighed a few kilograms.</p><br/><p>After filming one scene, while no one could tell from the outside, she was sweating completely on the inside.</p><br/><p>As soon as the director shouted “Cut!”, Ning Xueluo’s two assistants immediately rushed over, eager to attend to her. One of them fanned her while the other passed water to her, and the chair was already equipped with a cooling mat.</p><br/><p>There wasn’t a single assistant by Ning Xi’s side. After filming, she wasn’t able to have even a single sip of water. As she still had scenes to film, she couldn’t even remove the clothes on her, and could only unbutton the collar for some air.</p><br/><p>Everyone was praising Ning Xueluo’s performance, and the director added a few compliments as well. However, when he turned back to the screens, he kept rewatching a few screens where Ning Xi had appeared.</p><br/><p>Although she had no lines and the camera had focused on her only a few times, her expression was simply too perfect. Looking alluring and indolent even while bored stiff, her expression also carried a few traces of contempt for the people beneath her, because she was preparing to destroy this entire kingdom with her own hands.</p><br/><p>Good, he could finally rest easy.</p><br/><p>At this time, the errand boy Xiao Li shouted excitedly, “Teacher Ning, your boyfriend is here to visit you!”</p><br/><p>Of course, he meant Ning Xueluo with ‘Teacher Ning’.</p><br/><p>Su Yan walked over in refreshing casualwear. Two servants were following behind him and carrying a large box, and they started distributing ice cream to everyone.</p><br/><p>“Wow! It’s Haagen-Daazs! Thanks for treating us, Mr Su!”</p><br/><p>“Teacher Ning is too fortunate, it’s only the first time, and her boyfriend is already here to visit!”</p><br/><p>“God! What about us single dogs!”</p><br/><p>……</p><br/><p>“Geez, even giving you something to eat won’t hold your tongues!” Ning Xueluo protested coquettishly, then brought a box of ice cream to Ning Xi.</p><br/><p>“Junior Ning, you should eat too!”</p><br/><p>“Thanks.” Ning Xi received it politely.</p><br/><p>This woman would always act like an angel in front of others, especially in front of Su Yan. Even if Ning Xueluo wasn’t tired of it, she had already had enough of watching her act. Luckily Ning Xi was an actress by profession, and didn’t mind acting along with her.</p><br/><p>After returning to her seat, Ning Xueluo looked at Su Yan as if she had something to say, but found it difficult to talk. In the end, she still spoke up hesitantly, “Yan-gege, I’m a little worried about Xiao Xi…”</p><br/><p>“Hm? What happened to Xiao Xi?” Su Yan immediately asked.</p><br/><p>“It was the opening party last night, right? My dad came, and he met Xiao Xi. I’m not sure what Xiao Xi said to dad, but he flew into a terrible rage and wanted to kick her out from her role…”</p><br/><p>“How did this happen?” Su Yan frowned.</p><br/><p>“I don’t know either, by the time I got there, dad was already furious!”</p><br/><p>“What happened afterwards? It looks like Xiao Xi hasn’t been switched out?” Su Yan looked towards Ning Xi’s direction, only to see that she was reading the script earnestly despite sweating profusely under the sun. Although she cut a sorry figure, her face was dazzlingly brilliant under the sunlight.</p><br/><p>Speaking in a hesitant manner, Ning Xueluo continued, “My dad called the production team last night, and they agreed to the switch over the phone. However, the next morning, someone anonymously invested 50 million into this movie, and their only request was that Ning Xi had to be the supporting female lead… I’m afraid…”</p><br/><p>Su Yan’s expression turned uglier and uglier as he listened. Finally, he said in a low voice, “I know Xiao Xi. She would never do something like that!”</p><br/><p>“Yan-gege, you’re too naive. What kind of place is the entertainment circle? Were there any people who didn’t change upon entering this circle? For me, I’m lucky because I have daddy and you to support me, but Ning Xi has such a bad relationship with our family and she refused to accept our help. Don’t tell me that you don’t know what can happen to a beautiful girl with no power and backing?”</p><br/><p>“Ning Xi, there’s someone looking for you!” At this moment, the errand boy shouted again, but with a weird tone.</p><br/><p>Within an instant, everyone turned their gazes over.</p><br/><p>Because it was too eye-catching.</p><br/><p>Red roses…</p><br/><p>Enough red roses to cover the entire set were slowly being brought in by people…</p><br/>\n</div>"}