{"title": "Chapter 59: The Super Handsome Second Male Lead Who’s A Huge Star", "id": 59, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-59-the-super-handsome-second-male-lead-who%E2%80%99s-a-huge-star", "volume_title": "Volume 1", "body": "<h1>Chapter 59: The Super Handsome Second Male Lead Who’s A Huge Star</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 59: The Super Handsome Second Male Lead Who’s A Huge Star</p><br/><p>Although Ning Xi had proven her acting skills this time, she still hadn’t salvaged her reputation. On the contrary, because she’d done too well, people actually believed even more that she was a bewitching vixen. They didn’t even think this was acting, but just an unveiling of her true personality.</p><br/><p>The director was worried that her emotional state would be unstable and ran over to comfort her before she left. “Ning Xi, don’t worry, your male lead will be joining the cast next month. The good scenes are yet to come!”</p><br/><p>Ning Xi smiled wryly, “Director, just who is my male lead? You’ve kept a tight lid on it since the start of filming and won’t drop a hint at all. It’s one thing not to tell the media in order to build up some suspense, but why won’t you tell us either?”</p><br/><p>“I can’t say it, what if you guys let it leak? All I can say that the second male lead is a huge star!” Guo Qisheng had a mysterious expression on his face.</p><br/><p>Jia Qingqing was passing by when she caught wind of this and muttered disdainfully, “For a second male lead, what kind of big star could he be? Could he possibly be as famous as screen king Zhao Sizhou? Wouldn’t you say so Xueluo-jie?”</p><br/><p>Ning Xueluo smiled and didn’t say anything, obviously also thinking that the director was exaggerating.</p><br/><p>Ning Xi ignored Jia Qingqing’s sarcasm as she stuck herself firmly behind Guo Qisheng. “Then is he handsome? You can tell me that at least, right? The second male lead in the script is so handsome that all the heiresses in the city are willing to feign sickness for him!”</p><br/><p>She had many intimate scenes with the second male lead. Not only did she have to flirt with and tease him, but there were many bed scenes as well. Hugs and kisses were par for the course, so she couldn’t help but be more concerned about this.</p><br/><p>“Of course he’s good looking! I’m sure you’ll be satisfied! Just don’t faint with emotion when you see him!”</p><br/><p>“Seriously? Don’t lie to me Director Guo! I’d believe it!”</p><br/><p>…..</p><br/><p>The days passed swiftly, and it was August in the blink of an eye. It’d been two weeks since she’d taken up residence in the Lu residence. Her relations with Little Treasure were becoming better and better, and filming progress was satisfactory.</p><br/><p>Ning Xueluo and Jia Qingqing had formed an alliance. They would get up to some tricks every now and then. Although Ning Xi saw through them all, it was still too tiring to be on her guard all the time. She was preparing to find the right timing to put things right once and for all.</p><br/><p>It was also a bit odd, she felt like someone seemed to be helping her from the shadows. She received very subtle hints the few times she had overlooked one of the alliance’s tricks. Was it likely that there was someone who couldn’t abide Qia Jingjing’s tyrannical attitude? Ning Xi thought nothing more of it.</p><br/><p>Her biggest headache was needing to pick up a certain irritating fellow at the airport tonight.</p><br/><p>That guy had called her around a dozen times in a row while she was on set today.</p><br/><p>Ning Xi returned to the Lu manor after she wrapped up work for the day. She needed to pick up some gear.</p><br/><p>“You’re back. A nice hotpot place just opened up recently. Let’s go there tonight with Little Treasure?” Lu Tingxiao was reading a newspaper on the couch. He called out to her in a completely natural voice when he saw her return, as if he was talking to his wife.</p><br/><p>Ning Xi was a bit shocked by her thoughts. It’d only been half a month, but she was already used to interacting like this with Lu Tingxiao!</p><br/><p>The two of them and Little Treasure, they really did seem like a family of three.</p><br/><p>Ning Xi shook her head and dispelled her strange thoughts. She said a bit awkwardly, “I’m afraid I can’t go tonight. I need to pick someone up at the airport and I won’t be back until late. If Little Treasure wants to eat hotpot, then why don’t you take him?”</p><br/><p>“He won’t leave the house if you’re not here.”</p><br/><p>“Eh… alright, then let’s go together next time!”</p><br/><p>Lu Tingxiao put down the newspaper and looked at her with a fathomless expression, “Picking up a friend?”</p><br/><p>“Eh, you could say that…” Ning Xi nodded her head with difficulty.</p><br/><p>“Is it a man or a woman?”</p><br/><p>“Eh…” Wasn’t this question a little out of bounds?!</p><br/>\n</div>"}