{"title": "Chapter 52: Healing Kisses", "id": 52, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-52-healing-kisses", "volume_title": "Volume 1", "body": "<h1>Chapter 52: Healing Kisses</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 52: Healing Kisses</p><br/><p>“How do you think I got this role?” Ning Xi crossed her arms and leaned back in the chair, indifferently returning his question with another question.</p><br/><p>Su Yan looked like he was on the last of his patience, he slammed his hand on the table, “Ning Xi! You should know better than I do about the kind of trouble a girl like you could meet in the entertainment circle! Why are you so intent on stepping into murky waters like that!”</p><br/><p>“Heh, a girl like me…” Ning Xi smiled, “Young Master Su, I wonder what kind of relationship we have, for you to be lecturing me like this?”</p><br/><p>If it had been Ning Xi from back in those days, she would have become hysterical upon hearing such words.</p><br/><p>Back then, Su Yan had kept saying that he hoped his future wife would not enter the entertainment industry. However, when it came to Ning Xueluo, he was fully supporting her. Even so, he was actually sitting here and trying to dictate her life.</p><br/><p>“Xiao Xi, even though we’ve already broken up, I still treat you as a little sister. I’m only trying to help you, could you stop being so stubborn? Take this money, break the contract with Starlight and leave the entertainment industry!” Su Yan persuaded her earnestly.</p><br/><p>“Heh, is this trying to help me?” Ning Xi’s indolent gaze suddenly turned bone-piercingly cold, “Speaking of which, I do have a favour that Young Master Su could help me out with! I hope Young Master Su could help me tell the Ning family the truth, and testify in court that Ning Xueluo paid off two men to rape me. Would you help me with this favour?”</p><br/><p>“Xiao Xi, I…” Su Yan’s face turned deathly white, “If I do so, then Xueluo’s life will be over… and back then, Xueluo can only be charged with the attempt. You entered the wrong room, and the one you had relations with was someone else…”</p><br/><p>Even though she had expected his answer, Ning Xi’s heart still throbbed in pain. She spoke with a taunting expression, “So what you mean is, any wrong you committed back then has been erased? Getting raped after getting drugged was my fault, and getting pregnant with a bastard and giving birth to a dead baby was also my fault!”</p><br/><p>Su Yan frowned, “Xiao Xi, that’s not what I meant! Xueluo and I have already apologised to you for this incident, and we’ve been trying our best to make amends for this many years. Why can’t you forgive and forget?”</p><br/><p>Ning Xi grabbed her bag and stood up, “Heh, you actually want me to forgive and forget all of that? Come back and plead with me again when you can happily shake hands with and smile at someone who rapes and impregnates your Xueluo with his spawn!”</p><br/><p>Su Yan’s expression suddenly changed, “Ning Xi! How could you say something like that!”</p><br/><p>“Oh! I was only talking about a hypothetical situation and you’re already feeling this sorry for her? So when it doesn’t happen to you, you can’t feel the pain, right? You’re still hoping for me to forgive you? I’m not a saint!” Ning Xi tossed out a sentence and then strode away.</p><br/><p>That was really unlucky!</p><br/><p>She shouldn’t have talked so much with Su Yan. It was so disgusting that she lost her appetite for dinner tonight.</p><br/><p>She needed to return home quickly and hug her little bun to recover.</p><br/><p>Ning Xi had just walked to the door of the Lu residence, when she saw a cute, white, little bun running towards her.</p><br/><p>It looked like he had been sprawled at the window seat and waiting for her for quite a while.</p><br/><p>Ning Xi was immediately healed, and she gave a super big kiss on the cheek to little bun as usual.</p><br/><p>“Darling, have you eaten yet? I sent a message to tell you not to wait for me and eat your dinner, did you listen to me?”</p><br/><p>Little bun nodded twice.</p><br/><p>“Good boy!” Ning Xi kissed little bun again as a reward.</p><br/><p>“Play by yourself first, auntie’s going to shower and change out of these clothes!”</p><br/><p>Little bun nodded.</p><br/><p>The two of them held hands and walked towards the main door.</p><br/><p>At the second story window, watching the scene outside, Lu Tingxiao’s face showed quite a bit of depression. He had never known that he was someone who got jealous easily.</p><br/><p>He was even starting to get jealous of his own son.</p><br/><p>Ning Xi had kissed his son the moment she had come back, and she had even kissed him twice.</p><br/><p>While he could only watch from afar.</p><br/><p>After returning to her own room, the first thing Ning Xi did was to. Take. Off. Her. Bra!</p><br/><p>On such a hot summer day, wearing something like that was practically torture, okay?</p><br/><p>She reached behind her to undo the clasp and was about to pull out her bra. Halfway through pulling it out, the door behind her was pushed open with a creak.</p><br/><p>“Ning…” Lu Tingxiao had only said one word when he was stunned to the point of staring blankly. His hand was still in the midst of pushing open the door, and he looked at the scene in the room with astonishment.</p><br/><p>TL Note: Adding ‘Xiao’, which means ‘little’, in front of any part of a name turns it into an affectionate nickname. So ‘Xiao Xi’ or ‘Auntie Xiao Xi’ refer to Ning Xi~ :3</p><br/>\n</div>"}