{"title": "Chapter 56: Like a Punch on Cotton", "id": 56, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-56-like-a-punch-on-cotton", "volume_title": "Volume 1", "body": "<h1>Chapter 56: Like a Punch on Cotton</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56: Like a Punch on Cotton</p><br/><p>Ning Xi was going to film a dancing scene today. Unlike the heavy formal court clothing from yesterday, the costume for today was much lighter, so she could finally breathe.</p><br/><p>After entering her dressing room, Ning Xi stared blankly for a moment. She hadn’t expected to see Jia Qinging.</p><br/><p>She thought Jia Qingqing wouldn’t be coming.</p><br/><p>Since Jia Qingqing had not made the cut for the second female lead, the director had invited her to act the third female lead, Consort Xian.</p><br/><p>The third female lead was also a disaster for the country, but had lesser screen time compared to Ning Xi. Furthermore, she was tortured quite badly by Ning Xi in the movie.</p><br/><p>Although the manager had accepted the invite on Jia Qingqing’s behalf, she was still extremely unhappy. She hadn’t even appeared at the opening ceremony, and had spread out news that she was going to quit the role.</p><br/><p>Ning Xi guessed that she had most likely heard of the rumours that the project had gotten a huge sum of investment, and had come obediently today.</p><br/><p>It was a billion dollar production after all.</p><br/><p>Jia Qingqing was getting her makeup done. Upon spotting Ning Xi behind her through the mirror, she immediately scowled, completely not hiding her loathing towards Ning Xi.</p><br/><p>Like Ning Xueluo, she had a rich father to support her, so she had always acted arrogantly on set. It gave her a bad reputation, but thanks to the netizens in her camp, all the rumours had been twisted to paint her as someone who was straightforward and genuine. They even made up the title of ‘Entertainment Circle’s #1 Beauty’ for her.</p><br/><p>Therefore, Jia Qingqing hated Ning Xi to the bone, not just for stealing her role but also her title.</p><br/><p>“Oh, isn’t this the number one beauty in the entertainment circle? With so many sponsors supporting you, why are you coming to squeeze with us little artistes in this dressing room?” Jia Qingqing said mockingly with a malicious expression.</p><br/><p>Ning Xi stayed calm and found a chair to sit on without a care. She started reading the script, completely unaffected.</p><br/><p>She had a little quirk. Once she reached the set, she would concentrate fully on work and wouldn’t let anyone affect her mental state.</p><br/><p>“Ning Xi, what’s the meaning of this? Are you ignoring me?” Jia Qingqing slammed the comb in her hands down.</p><br/><p>Ning Xi continued reading her script, and it seemed like she hadn’t even heard her.</p><br/><p>At this moment, the makeup artist at the side could no longer keep watching. She coughed lightly and said, “Ning Xi’s wearing earphones, so I’m guessing she can’t hear you!”</p><br/><p>It was only then that Jia Qingqing saw the two little white earbuds in Ning Xi’s ears. She suddenly felt like she had punched cotton.</p><br/><p>This bitch, who knew if she had really heard, or if she had been acting!</p><br/><p>Ning Xi had done it on purpose, of course.</p><br/><p>When she had first spotted Jia Qingqing, she had immediately put on her earphones and pretended not to hear.</p><br/><p>Because in this kind of situation, if there were any conflicts, it would only be detrimental to her no matter who was in the wrong. She had to avoid trouble where she could!</p><br/><p>“Miss Jia, I’m done with the makeup, could you see if you’re satisfied with it?” The makeup artist spoke in a careful tone, clearly knowing that she was serving a difficult master.</p><br/><p>“I’m not satisfied with this! Do it again!” Jia Qingqing didn’t even look at the makeup before saying so.</p><br/><p>“May I ask which parts you’re dissatisfied with?” The makeup artist asked.</p><br/><p>“Everything!”</p><br/><p>The makeup artist’s expression was frozen stiff, but she could only obediently redo her makeup.</p><br/><p>Jia Qingqing was raging inside after seeing Ning Xi completely ignoring her, so she kept taking it out on the makeup artist.</p><br/><p>The makeup artist didn’t dare to show any sort of negative expressions to Jia Qingqing, so she could only stare resentfully at Ning Xi in the corner.</p><br/><p>She knew that Jia Qingqing was trying to make things difficult for Ning Xi, and she had only been dragged into it.</p><br/><p>Only the male and female leads had their own personal dressing rooms. Everyone else shared a dressing room, so as long as Jia Qingqing wasn’t done, Ning Xi could only sit there and wait.</p><br/><p>In the end, it was only when Jia Qingqing’s manager had come in to rush her that Jia Qingqing left reluctantly. She didn’t forget to glare fiercely at Ning Xi even on her way out.</p><br/>\n</div>"}