{"title": "Chapter 71: The Tyrant Stealing Away The Innocent Flower", "id": 71, "volume": 1, "url": "http://boxnovel.org/hidden-marriage-chapter-71-the-tyrant-stealing-away-the-innocent-flower", "volume_title": "Volume 1", "body": "<h1>Chapter 71: The Tyrant Stealing Away The Innocent Flower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 71: The Tyrant Stealing Away The Innocent Flower</p><br/><p>“Don’t get anxious, let me see which scene would be good!” Guo Qisheng flipped through the screenplay excitedly.</p><br/><p>Ning Xi was shouting anxiously in her heart as she thought: Director, Director, just pick Scene 46! If you let me act that scene now, I’ll definitely do it well!</p><br/><p>That scene was of Sun Huanqing saving a lady while in the army camp, and getting seduced by that lady. Meng Changge had an explosive temper, and after misunderstanding that he was cheating, she beat him up…</p><br/><p>As if he had seen through her thoughts, Jiang Muye slightly bent his waist and whispered by her ear, “My dear, are you thinking of acting out the scene where you beat me up?”</p><br/><p>Ning Xi moved away like she had gotten electrocuted, “Bastard, get away from me!”</p><br/><p>Thanks to this guy, the hate on her was now so high that even ten bulls wouldn’t be able to pull it away.</p><br/><p>She could already imagine the crazy tricks awaiting her from Jia Qingqing and Ning Xueluo, especially from Jia Qinging.</p><br/><p>It was already hard enough for her to pass her days, this was practically piling more snow on her in a snowstorm.</p><br/><p>Ning Xi was destined to be disappointed. The director couldn’t possibly let Jiang Muye get pummelled on his first day, so after thinking for a bit, he spoke up, “Let’s go with Scene 37!”</p><br/><p>She had already memorised the screenplay, so when Ning Xi recalled exactly what kind of scene No. 37 was, her expression darkened.</p><br/><p>Although it wasn’t a bed scene or a kissing scene, it wasn’t any better.</p><br/><p>It was a scene where Meng Changge teased Sun Huanqing…</p><br/><p>The director called the two of them over and started to explain the scene to them.</p><br/><p>“The Meng family had always served as generals, and had accumulated impressive results on the battlefield. However, their rising influence had caused their ruler to fear them and threw the general’s household into imminent danger. The emperor turned muddleheaded from rumours and slander, causing Meng Changge’s father to die in battle. Luckily, Meng Changge’s elder brother, Meng Changfeng, was already able to stand on his own and took his father’s place, allowing little Changge to live a life without worries. She would carouse about the city all day, and was a little ruffian on the streets of Chang An…”</p><br/><p>When the director mentioned ‘little tyrant’, Jiang Muye’s lips curled up and he cast a glance at Ning Xi. He mouthed the words: ‘That sounds like you.’</p><br/><p>Ning Xi ignored him and continued listening to the director earnestly.</p><br/><p>“This little ruffian would dress up in men’s clothing all day, and looked completely unlike a young lady. It was only when she was sixteen and met Sun Huanqing on the streets, that she fell in love with him at first sight, and started pestering him daily…”</p><br/><p>Jiang Muye raised his hand and spoke, “Director, isn’t this the female version of a tyrant stealing away an innocent flower?”</p><br/><p>Ning Xi: “…” You’re the tyrant!</p><br/><p>Guo Qisheng coughed lightly and praised, “Muye, you’ve understood it well, it’s pretty much like that. So the main point I was trying to say is, your roles have always tended towards stronger and more active dispositions. However, this time, it’s the total opposite of that, so you’ll have to take note of the change…”</p><br/><p>Listening up to here, Ning Xi was starting to worry a little. This guy had always been acting roles like overbearing CEOs, overbearing seniors, overbearing princes and the like. Would he be able to act out Meng Changge’s intellectual and delicate doctor?</p><br/><p>Jiang Muye acted as if he was taking things very earnestly and nodded to indicate his understanding, “I got it, Director. I’m the one who’s weak and getting forced!”</p><br/><p>Guo Qisheng looked at the two of them with worry. Actually, he was more worried for Ning Xi than for Jiang Muye. He was worried that Ning Xi was too womanly to act out the ruffian ways of Meng Changge.</p><br/><p>“I chose this scene because it will test the chemistry between the two of you. Most of the time, one of you will be acting as an improper scoundrel, while the other will be acting gentle and bearing with that scoundrel. If you’re able to play this scene well, then there won’t be any problems with the rest of the scenes. Alright, that’s all I’ll say for now. We’ll see what happens when you put it into practice. Both of you, go get your makeup applied and change into your costumes!”</p><br/>\n</div>"}