{"title": "Chapter 108: Don’t Put On Your Clothes", "id": 108, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-108-don%E2%80%99t-put-on-your-clothes", "volume_title": "Volume 2", "body": "<h1>Chapter 108: Don’t Put On Your Clothes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: Don’t Put On Your Clothes</p><br/><p>In the evening, Ning Xi brought her loot back to the Lu residence.</p><br/><p>Seeing the old butler watering the flowers by the entrance, Ning Xi hurriedly greeted him, “Grandpa Butler, where’s Darling Little Treasure?”</p><br/><p>The old butler was dressed in a swallow-tailed coat with a neat bowtie. Upon seeing Ning Xi, he said with a respectful expression: “Miss Xi, you’ve returned. Little Young Master is drawing in the garden.”</p><br/><p>“Oh, he’s drawing? Then I won’t disturb him for now. Where’s Mr Lu then?”</p><br/><p>“Eldest Young Master is upstairs.”</p><br/><p>“Alright, thanks!” Ning Xi happily headed upstairs.</p><br/><p>The old butler looked at the girl’s lively figure with a complicated heart. In the time they had spent together, no matter how guarded he had been, he couldn’t resist having a favourable impression of this young lady.</p><br/><p>She was beautiful and had a sweet tongue. It was easy for her to get into everyone’s good graces. What was hard to come by was her understanding of proper behaviour. She had never shown any attempts to step over the lines with Eldest Young Master. Actually, she didn’t really care much about her image at most times.</p><br/><p>It was easy to tell when a woman had intentions towards a man. They might be able to hide it for a day or two, but with enough time, it would eventually be revealed.</p><br/><p>Similarly, it was easy to tell when a man had intentions towards a woman.</p><br/><p>Others might not know it, but he had seen everything from start to finish, so he was clear about it. Eldest Young Master had clearly taken a liking to this lady. The guest room she was staying had been personally designed by Eldest Young Master. Even the bedsheets, curtains and the closet full of clothes and accessories had all been personally picked by him. Not only that, on the first day she had arrived, he had already passed the list of her preferred foods to the kitchen. Every time she returned late, they had to leave some food for her. There were countless other details that he couldn’t even finish mentioning…</p><br/><p>Even if she was Little Young Master’s saviour, Eldest Young Master’s meticulous actions were a little too much.</p><br/><p>As long as the little lady came from a good family and could get along with Eldest Young Master, it wouldn’t necessarily be a bad thing. Ever since the lady had moved in, Eldest Young Master had become more lively, and even Little Young Master was becoming more cheerful. Since he had watched Eldest Young Master and Little Young Master grow up, he was naturally happy about these developments.</p><br/><p>Right now, he wasn’t worrying about Ning Xi harbouring bad intentions; he was actually more worried that Ning Xi didn’t harbour any intentions at all.</p><br/><p>After heading upstairs, Ning Xi was impatient to share her spoils of war, so she directly opened the door to Lu Tingxiao’s bedroom.</p><br/><p>“Mr…”</p><br/><p>The moment she opened the door, her vision was filled with bared skin. Lu Tingxiao’s hair was wet and he wasn’t wearing anything on the upper half of his body. A white towel was wrapped around his waist, and water droplets slowly travelled down his tight abs, dripping down…</p><br/><p>This scene was hard to turn your eyes away from, so Ning Xi’s first reaction wasn’t to close her eyes, but to widen them.</p><br/><p>Although she had some trauma towards men, it didn’t mean she couldn’t appreciate beauty.</p><br/><p>It was most likely because she had suffered a huge shock after getting betrayed back then. She didn’t know when she had started turning bent. Five years ago, she had been so conservative that she would blush upon seeing a man in a tank top and underwear. She didn’t talk much with other men apart from Su Yan, and didn’t even bat an eye no matter how handsome the man was…</p><br/><p>A whole five seconds passed before Ning Xi regained her senses. She turned around with a whoosh and covered her eyes with her hands full of paper bags, “Sorry sorry, I forgot to knock!”</p><br/><p>Lu Tingxiao chuckled lowly, his voice somewhat hoarse, “It’s my bad, I forgot to lock the door.”</p><br/><p>Actually he hadn’t forgotten to lock it, but ever since she had moved in, he had never locked his door again.</p><br/><p>“Were you looking for me? Wait a moment, I’ll put on some clothes.”</p><br/><p>That short yet long look from the girl had lighted up his skin inch by inch. Luckily she had turned around in time, or his facade might have cracked thanks to the reaction he couldn’t control from a certain part of his body.</p><br/><p>Lu Tingxiao was about to open the closet to get some clothes when Ning Xi shouted from behind him, “Ah, no! Don’t put on your clothes!”</p><br/>\n</div>"}