{"title": "Chapter 103: Whose Fault Is It When a Mad Dog Bites You?", "id": 103, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-103-whose-fault-is-it-when-a-mad-dog-bites-you", "volume_title": "Volume 2", "body": "<h1>Chapter 103: Whose Fault Is It When a Mad Dog Bites You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 103: Whose Fault Is It When a Mad Dog Bites You?</p><br/><p>Following that, Ning Xueluo quickly persuaded, “Junior Ning, I know you don’t feel comfortable about it, but you’re still in the wrong for this matter. You can’t let the grudge between the two of you affect the company! The only thing we can do now is to minimise the damage!”</p><br/><p>Ning Xi looked calmly at Ning Xueluo, who appeared to be trying to protect the company, and said, “Senior, if I remember correctly, it was Jia Qingqing who was always against me and she was the one who kept trying to slander me. I always kept Chang-jie’s teachings in mind and tried not to embarrass the company, putting the company before myself. I endured it and remained silent. Even when I was slandered, I didn’t dare to trouble the company and I was only able to clear my reputation when some kind-hearted netizens and colleagues stepped out for me.”</p><br/><p>“The only matter that the netizens and fans are protesting about now is regarding Jia Qingqing being kept as a mistress. Wasn’t it clearly Jia Qingqing who acted for her own interests without thinking about the company? She even framed an artiste in the same company and ruined the company’s image as a result. Don’t tell me that Senior means to say that if a mad dog falls into a ditch and dies while chasing you, then it’s your fault?”</p><br/><p>If she tweeted about forgiving Jia Qingqing, then the reputation she had spent so much effort to clean would take a turn for the dumps again.</p><br/><p>Forgiving someone like Jia Qingqing when the crowd was out for her blood; did she seriously take her for a fool?</p><br/><p>Ning Xueluo almost choked to death on Ning Xi’s words. What kind-hearted netizens? She was clearly the one who had leaked that video. She had some nerve to be able to say that so calmly and innocently.</p><br/><p>Jia Qingqing, who had just settled down not too long ago, immediately got agitated again, “Ning Xi, who are you calling a mad dog! Say it clearly! You…”</p><br/><p>Seeing that Jia Qingqing was about to make a ruckus again, Feng Haoyang interrupted her: “There’s no need to post an apology anymore.”</p><br/><p>“Really?” Jia Qingqing’s expression immediately turned to joy, but Feng Haoyang continued: “Qingqing, just write a letter explaining that you are going to retire!”</p><br/><p>Jia Qingqing screamed, “Why? You’re making me retire from the entertainment circle? Why must I be the one retiring! I’m not going to write that letter!”</p><br/><p>Feng Haoyang’s expression showed impatience, “By letting you write it yourself, I’m already giving you some dignity! Don’t throw this favour back in my face!”</p><br/><p>“What’s wrong with being kept! In the entertainment industry, so many female stars have sponsors behind them, and so many of them are mistresses. Why do I have to retire!” Jia Qingqing couldn’t accept it.</p><br/><p>“Only you were stupid enough to let it spread to the public!”</p><br/><p>“That had nothing to do with me, it was all because that bitch Han Ying betrayed me! Why don’t you go and investigate her!”</p><br/><p>“How am I supposed to investigate her when she has already resigned? Han Ying was the most even-tempered manager in this whole company. Ask yourself, other than her, who else could bear with your temper? It’s fine if you keep shouting at her and making a big fuss, but when her son had a high fever and she needed to go to the hospital, you refused to let her go. Eventually, by the time she rushed to the hospital at midnight, her son had to go into the ICU because he took a turn for the worse. He is still in critical condition right now!” Feng Yaohang listed her shortcomings one after another. It wasn’t just Han Ying, but even he was sick of cleaning up after Jia Qingqing’s reckless actions.</p><br/><p>After hearing this, Jia Qingqing still didn’t feel like she had done anything wrong. Conversely, she said indifferently, “It’s not like he died in the end! There are doctors there for that kind of situation, what difference would it have made even if she had gone! Is it really worth pushing me into this hole?”</p><br/><p>Even up to now, Jia Qingqing still didn’t understand why the normally weak Han Ying would suddenly do something like this. She had divorced with her husband and her son was sickly. He needed a large amount of medical fees every month. Without this job, how was she going to pay for all that?</p><br/><p>She would never have guessed that someone like Liang Feixing would personally take action against such a small fry like her.</p><br/>\n</div>"}