{"title": "Chapter 105: Shopping for Little Bun!", "id": 105, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-105-shopping-for-little-bun", "volume_title": "Volume 2", "body": "<h1>Chapter 105: Shopping for Little Bun!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 105: Shopping for Little Bun!</p><br/><p>This time, Ning Xueluo’s expression had completely changed. She was close to screaming, “Ning Xi, you mad woman!”</p><br/><p>She wasn’t afraid of Ning Xi trying to compete for her position and her man, but she was afraid that Ning Xi would reveal everything in a desperate bid to drag her down.</p><br/><p>‘Hehe…” Seeing that Ning Xueluo’s face had turned pale from fright, Ning Xi couldn’t resist chuckling. With a relaxed expression, she patted her shoulder, “Miss Ning, don’t worry~ I’m just joking. It’s not worth the sacrifice to take down trash like you.”</p><br/><p>Speaking up to here, Ning Xi’s indifferent gaze turned extremely cold and she lowered her tone. As if she was a ghost that had crawled out of hell, she spoke by Ning Xueluo’s ear, “However, if you ever use that incident to threaten me again, I can’t guarantee what I’ll do if I lose control. If you try to use that pig of a teammate, even if I die, I’ll drag you down with me! Jia Qingqing is a pushover who only looks strong; but I’m not the same as her!”</p><br/><p>Having said so, Ning Xi let go of Ning Xueluo’s shoulder and left.</p><br/><p>Ning Xueluo had not managed to threaten her at all, and had even been threatened herself. Once Ning Xi had left, she immediately collapsed on the floor. With a dark expression, she kicked the door heavily.</p><br/><p>Damn it! She had to think of a way to get rid of Ning Xi!</p><br/><p>As long as Ning Xi lived, everything that she had could disappear in a second. She absolutely could not let that happen!</p><br/><p>……</p><br/><p>After leaving the company, seeing that she had nothing else to do for the afternoon, Ning Xi prepared to go to the mall. She had promised that she would help Little Treasure buy some clothes.</p><br/><p>Upon thinking of Little Treasure, the dark clouds in her mind instantly dissipated and she happily went shopping.</p><br/><p>Ning Xi headed straight for the children’s section upon arriving.</p><br/><p>There were all sorts of kids’ clothing around. All pumped up, Ning Xi buried her head into shopping, she was even more crazy than when she shopped for herself.</p><br/><p>Since she had met Little Treasure, her way of living had turned a complete 180. She used to make detours around any shops that sold children’s products or clothes. However, it wasn’t those suffocating memories she thought about when she saw those now. Instead, she thought of the cute little bun.</p><br/><p>The feeling of wanting to buy something cute and fun back for him; it was practically like falling in love!</p><br/><p>This mall only carried branded products, so everything was rather expensive. It was the same for children’s clothing, but since they were meant for Little Treasure, she was willing to spend the money. She just had to buy fewer cosmetic products to save the money back up.</p><br/><p>Today, Ning Xi was wearing a dress from a designer that she liked, but wasn’t very famous. Although it looked good, it didn’t have a branded logo on it.</p><br/><p>The shop assistants would only serve those who looked rich, so they didn’t bother with her. They followed eagerly behind another woman dressed in Chanel from head to toe instead.</p><br/><p>Ning Xi happily shopped here and there. Finally, she spotted an outfit that piqued her interest in the corner.</p><br/><p>It was a little sapphire blue suit. Not only was the colour extremely eye-catching, the pocket square even carried a little Superman logo. Most importantly, she had lots of clothes with Superman motifs. She could wear matching mother-child outfits with Little Treasure at any time.</p><br/><p>The words ‘mother-child outfits’ made Ning Xi’s heart thump. She realised with a start that while this felt like she was in love, where she would want to give the best to her lover, it also felt like how she would treat her own child.</p><br/><p>With a complicated expression on her face, Ning Xi sunk into silence for a while before finally recovering her senses. She approached a shop assistant, “Miss, I want this outfit, could you help me pack it up?”</p><br/><p>The shop assistant didn’t reply immediately, but reminded her coldly, “This costs twelve thousand yuan.”</p><br/><p>“I know, I saw the tag. Help me pack it up.”</p><br/><p>The shop assistant’s expression warmed up a little and she even smiled, saying gently, “Do you need it to be wrapped as a present?”</p><br/><p>Before Ning Xi could reply, a hand with a jade bracelet suddenly came from the side and snatched away the outfit, “Oh, this outfit looks good! I’m taking this!”</p><br/>\n</div>"}