{"title": "Chapter 116: Wouldn’t Things Go to Hell If They Really Kissed?", "id": 116, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-116-wouldn%E2%80%99t-things-go-to-hell-if-they-really-kissed", "volume_title": "Volume 2", "body": "<h1>Chapter 116: Wouldn’t Things Go to Hell If They Really Kissed?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 116: Wouldn’t Things Go to Hell If They Really Kissed?</p><br/><p>The filming began.</p><br/><p>Peddlers selling coloured lanterns and lantern riddles lined both sides of the street. The commoners bustled about holding lanterns in their hands, and the surroundings were full of laughter and cheer.</p><br/><p>Meng Changge had just dragged Sun Huanqing out of the hospital where he had been shut indoors tending to patients.</p><br/><p>The camera chased after the two as they pushed forward. The shot captured a young man and young girl running swiftly along the brightly lit streets of Chang’an. The scene was beautiful beyond words…</p><br/><p>This scene didn’t have many spoken lines. Instead, the focus was on the scenery and changes in the facial expressions of the lead actors.</p><br/><p>Meng Changge was full of excitement. Sun Huanqing had been reluctant at first, but later, he was infected by the young girl’s excitement and they weaved through the crowd of people together.</p><br/><p>After walking for some time, Sun Huanqing suddenly realised that the girl was still holding onto his hand, so he hastily began to struggle. On the contrary, Meng Changge stubbornly held onto his hand even more tightly and refused to let go. Her expression clearly said: ‘this hand is mine’.</p><br/><p>Sun Huanqing spoke anxiously, “Miss Meng, please conduct yourself with dignity! Men and women should keep their distance!</p><br/><p>Meng Changge frowned as she stared at him, “You’re such a silly bookworm. What if we get separated after I let go of your hand?”</p><br/><p>“If we get separated, then so be it!” Sun Huanqing resentfully blurted out.</p><br/><p>“Sun Huanqing! You….” Meng Changge angrily flung his hand away and dove into the crowd.</p><br/><p>As he watched her red figure slowly disappear amidst the crowd, Sun Huanqing’s expression gradually became anxious. Recently, there had been a rumor in the capital that a rapist had been roaming about. Young women from quite a few households had gone missing. The streets were so chaotic today and she was just a girl. What if something happened to her?!</p><br/><p>Sun Huanqing was only worried for Meng Changge now. He had completely forgotten that she was a street-smart little demon. Even if she did bump into the rapist, it would still be the rapist’s unlucky day.</p><br/><p>The camera lens began to follow Sun Huanqing as he relentlessly searched through the crowd for Meng Changge. Just as he was about to collapse from frustration, someone suddenly patted his shoulder.</p><br/><p>When he turned around, a person wearing a devil mask was standing in front of him. She spoke in a rather pleased tone, “Doctor Sun, were you looking for me?”</p><br/><p>When he heard that girl’s familiar voice, Sun Huanqing couldn’t control his joy and pulled her into his embrace.</p><br/><p>Meng Changge clearly had not expected that the usually conservative Sun Huanqing would act like this and immediately froze…</p><br/><p>In the next scene, Meng Chengge was going to take the initiative to kiss Sun Huanqing. The fans who were watching from afar were so excited that they held their breaths as they fixed their gazes on the scene, not daring to breathe. Just from their imaginations alone, they knew that the first kiss between those two would be absolutely beautiful!</p><br/><p>At the same time, there was someone else who was holding his breath. That person was Lu Jingli, who was sitting in a black car.</p><br/><p>Lu Jingli cringed and plastered himself against the window to stay as far as he could from his brother. He was so scared that he even closed his eyes because he couldn’t bear to keep watching.</p><br/><p>He absolutely didn’t believe that his brother would watch without doing anything. The temperature in the car had almost dropped below freezing when Ning Xi had only held Jiang Muye’s hand and when the two had embraced as well! Wouldn’t things go to hell if they really kissed?</p><br/><p>Was there going to be a bloodbath in the next moment?</p><br/><p>As much as he wracked his brains, Lu Jingli still couldn’t figure out how his brother would be able to prevent this scene without making Ning Xi angry…</p><br/><p>Lu Jingli cautiously peeked at the screen through the cracks of his fingers, only to see Ning Xi slowly take off her mask, gaze at Jiang Muye lovingly, and then wrap a hand around Jiang Muye’s neck to pull him closer…</p><br/><p>It was over now! Someone was going to die!</p><br/><p>Right as Lu Jingli was mentally wailing in anguish, all the coloured lanterns in the backdrop were suddenly extinguished. It was as if his brother’s silently raging anger had put them out. It was terrifying beyond compare.</p><br/>\n</div>"}