{"title": "Chapter 110: You Look Like You’re Ready for Marriage", "id": 110, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-110-you-look-like-you%E2%80%99re-ready-for-marriage", "volume_title": "Volume 2", "body": "<h1>Chapter 110: You Look Like You’re Ready for Marriage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Ning Xi scowled miserably, “Lu Tingxiao, are you sure you want to continue talking to me in this state? Can we talk after you put on some clothes?”</p><br/><p>Otherwise it would be really difficult for her to focus, really!</p><br/><p>“Sure.” Lu Tingxiao’s voice sounded from behind her.</p><br/><p>Like a pardoned convict, Ning Xi hurriedly dashed out of the room.</p><br/><p>Ah, Lu Tingxiao was a natural-born speaker. Just a few sentences was enough to poke her in her soft spots, especially those words concerning Little Treasure.</p><br/><p>However, if she continued staying on like that, and for three months at that, she really felt that it wouldn’t be appropriate…</p><br/><p>As she was conflicted over this matter, something soft landed on her legs. Lowering her head, she saw that Little Treasure had run over at some point and hugged her leg as usual. He was even holding a drawing in his hands.</p><br/><p>Ning Xi squatted down to hug the little fellow, “Darling, did you finish your drawing?”</p><br/><p>Little Treasure nodded.</p><br/><p>“What did you draw? Can Auntie look at it?”</p><br/><p>Little Treasure immediately passed the drawing to her.</p><br/><p>The moment she saw it, her eyes teared up.</p><br/><p>As usual, she was the subject of the drawing.</p><br/><p>The colours used in the painting were vibrant and dream-like. She was lying on a small bed, holding a storybook in hand. However, Little Treasure had drawn it from his perspective, when he was lying by her side and watching her from below.</p><br/><p>In the entire drawing, you could feel the happiness and contentment Little Treasure felt every time he stuck to her side, raising his head and listening to her telling him a story.</p><br/><p>“Darling, you drew so well!” The balance in Ning Xi’s heart had been completely skewed to one side.</p><br/><p>She had to take a deep breath before she could recover her composure. She kissed the little fellow’s forehead, then said happily, “Auntie bought some new clothes for you, do you want to try them?”</p><br/><p>Little Treasure’s eyes lit up and he nodded.</p><br/><p>When Ning Xi had finished helping Little Treasure change his clothes and was preparing to look for Lu Tingxiao, Lu Tingxiao walked out of his room in the new outfit.</p><br/><p>Ning Xi had been pretty confident when buying the outfit for Little Treasure, but she wasn’t as sure about buying the outfit for Lu Tingxiao, since she had never seen him wearing any colours other than black, white or gray. Furthermore, sapphire blue was pretty eye-catching.</p><br/><p>However, upon seeing Lu Tingxiao, Ning Xi stared blankly.</p><br/><p>This… Wasn’t this too fitting…</p><br/><p>She had thought that it might not fit well at first, or that the style wouldn’t look good on him. She hadn’t expected that it would work so well on his body. It completely showed off his wide shoulders, narrow hips and long legs. Most importantly, his usual solemn and heavy air had instantly become lighter and brighter. His whole person looked younger.</p><br/><p>Lu Tingxiao was pleased by the completely undisguised stunned look in the girl’s eyes, “How is it?”</p><br/><p>Ning Xi nodded fervently, “You look too cool! It feels like all you need is a bright red flower at your breast pocket and you’ll be all ready for marriage!”</p><br/><p>Lu Tingxiao: “…” This girl’s way of complimenting people was rather unique.</p><br/><p>“Little Treasure, don’t you think so? Is Daddy cool or not?” Ning Xi looked down to ask the little bun, who looked like the mini version of Lu Tingxiao.</p><br/><p>Although Little Treasure didn’t like his dad too much, he couldn’t help but admit that his dad looked much better like this compared to his usual black outfits. Thus, he nodded.</p><br/><p>Ning Xi immediately gave a thumbs-up, “I didn’t think that my fashion sense was that good! Of course, CEO Lu, you look good in anything! However, I think you should wear these kinds of bright colours more often. The employees will feel better when they see you, and they’ll be more efficient at work!”</p><br/><p>Hearing that ‘you look good in anything’, Lu Tingxiao couldn’t help but curl his lips in a smile, “Sure, as long as you see something suitable, buy it for me.”</p><br/>\n</div>"}