{"title": "Chapter 133: I Choose My Own Way", "id": 133, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-133-i-choose-my-own-way", "volume_title": "Volume 2", "body": "<h1>Chapter 133: I Choose My Own Way</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 133: I Choose My Own Way</p><br/><p>“You vile creature! What kind of look is that!” Ning Yaohua flew into a rage.</p><br/><p>Just as he was about to vent his temper, the door to the ward was opened from the inside.</p><br/><p>Ning Yaohua and Zhuang Linyu immediately tossed Ning Xi to the back of their minds and hurriedly went up to the door, “Su Yan, how’s Xueluo doing now?”</p><br/><p>“She’s fine for now, you can go in to see her.” Su Yan replied, looking tired. After that, he turned to look at Ning Xi, whose cheek was slightly swollen and red, with a heavy gaze.</p><br/><p>Zhuang Lingyu immediately threw herself by Ning Xueluo’s bedside and looked her up and down, “Mummy’s darling! How are you feeling? Does it hurt? Do you feel bad anywhere?”</p><br/><p>Ning Xueluo smiled weakly, “Mum, I’m fine now. The doctor said that it’s just a superficial wound.”</p><br/><p>Zhuang Lingyu stroked her hair tenderly, “You’re a girl, and this wound is going to leave such a big scar. You’re still saying that you’ll be fine! If the sword had gone in just a little deeper, you wouldn’t be alive now! That damn girl, how could she be so vicious! You even treat her as your older sister!”</p><br/><p>“Jiejie, she…” Ning Xueluo’s expression dimmed down, but she bore with it and continued speaking, “Dad, Mum, don’t blame jiejie. It’s not her fault, something went wrong with the prop.”</p><br/><p>Ning Yaohua snorted coldly upon hearing so, “Silly child, how could you be so silly! That prop was perfectly fine; how could something have gone wrong with it?”</p><br/><p>After he finished speaking, he turned to the door and shouted at Ning Xi, who was standing there, “Bastard, what are you still standing there for? Get in here and apologise to Xueluo right now!”</p><br/><p>Ning Xi’s face held an indifferent expression like an impenetrable mask, “There’s nothing I have to apologise to her for. If you want to make me apologise, sure, show me the evidence. If you have evidence, then I can even give her my life as compensation.”</p><br/><p>Ning Yaohua’s finger shook as he pointed at her, “You’re still refusing to admit your mistake even now. I’m leaving you some dignity by not investigating this matter. You’re not going to repent until you see your end is near, are you? Do you just have to embarrass me thoroughly before you’re satisfied?”</p><br/><p>Heh, so in Ning Yaohua’s eyes, it was his image that was the most important.</p><br/><p>Ning Xi sneered, “If I really wanted to take revenge on her, you’d be seeing her corpse now. How would you still have the chance to act out a family drama here?”</p><br/><p>Ning Yaohua slammed the table with force, “Stop running your mouth at me! Ning Xi, are you going to apologise or not? If you admit your wrongs and apologise, then retire from the entertainment industry, I can take it as if all of this never happened. If you want to have your way….”</p><br/><p>“Thank you, but I choose to have my own way!” Ning Xi burst out into laughter and waved them goodbye, before turning to leave without looking back.</p><br/><p>Zhuang Lingyu’s face was filled with disbelief, “Look at how she’s acting! I can’t believe I gave birth to such a shameful thing!”</p><br/><p>Ning Yaohua was so angry he had to pace, “What a vile creature! She’s really angered me now!”</p><br/><p>Ning Xueluo anxiously persuaded, “Dad, forget about it. I’m fine now, don’t get angry at Jiejie, you’ll hurt your body!”</p><br/><p>“I’ve already let her off once last time, and she actually did such a thing. She tried to harm you this time, who knows if she might try to kill you the next time. I can’t just forget about this matter!”</p><br/><p>“But, Dad…”</p><br/><p>“Alright, don’t think about this matter anymore. I’ll take care of it.”</p><br/><p>“That’s right, let your dad handle it. Just focus on recovering. Your dad will give you a satisfactory result!”</p><br/><p>Ning Xueluo’s eyes reddened and she looked as if she was holding back her resentment from being bullied. With a grateful expression, she said, “Thanks Dad, thanks Mum. You don’t have to do that, I’m fine…”</p><br/><p>Su Yan, who had been silent since just now, patted her shoulder, “Xueluo, you’re just too kind! Ning Xi went overboard this time. Uncle’s right. We can’t let her continue acting so freely!”</p><br/>\n</div>"}