{"title": "Chapter 152: Switching on Shadow Mode", "id": 152, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-152-switching-on-shadow-mode", "volume_title": "Volume 2", "body": "<h1>Chapter 152: Switching on Shadow Mode</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 152: Switching on Shadow Mode</p><br/><p>Ever since Ning Xi had come back, the little bun seemed to have switched on his shadow mode. He would follow her wherever she walked, not willing to let even an inch of distance separate them.</p><br/><p>In the living room downstairs.</p><br/><p>Lu Jingli had also switched on his shadow mode; he was following wherever Lu Tingxiao walked.</p><br/><p>“Bro, Brother, dear Bro… You guys… What did the two of you do the whole night?”</p><br/><p>Lu Tingxiao hugged a cup of freshly brewed coffee and sat on the sofa: “We chatted.”</p><br/><p>Lu Jingli choked and looked like a disappointed puppy who hadn’t gotten a bone, “Alright, just take it as if I never asked.”</p><br/><p>“How is the task I entrusted to you progressing?” Lu Tingxiao asked.</p><br/><p>Lu Jingli immediately switched back to his proper mode and spoke grimly, “It’s already in progress. Within a month, Zhu Xiangcheng’s Crown Real Estate will definitely be erased from this capital.”</p><br/><p>“What about Ning Xi’s matter?”</p><br/><p>Lu Jingli tidied his hair before speaking up: “Because the production crew stopped the news from spreading, I wasn’t able to get the news in time. As for now, the one who set this whole ploy up definitely wouldn’t let the news be stifled, so it’s starting to spread on the Internet. What’s worse is that the prop director personally testified in his interview that it was Ning Xi who had bribed him to change the prop. This isn’t just a matter of public opinion now. If Ning Xueluo files a case, Ning Xi might even be taken by the police for investigation!”</p><br/><p>An endless vicious aura rose on Lu Tingxiao’s face. It suddenly seemed like he was sitting on a great demon king’s throne made of bones instead of a plain ordinary sofa. Enunciating each word clearly in an icy tone, “I’d like to see who would dare to do so.”</p><br/><p>“No no no… Sister-in-law has you to support her, who would even dare to touch a single hair on her head!” Lu Jingli hurriedly tried to calm his rage before stating positively, “Bro, just rest assured. I’ve already gotten someone to install wiretaps and spy cameras in that prop director’s home. He’ll definitely try to contact the person behind this in this period of time. There’s no need to worry that we won’t be able to get any evidence. We’ll see who gets arrested in the end!”</p><br/><p>Dissatisfaction showed on Lu Tingxiao’s expression and he tapped the side table with his finger: “Inefficient.”</p><br/><p>Lu Jingli couldn’t accept that and grumbled: “This method is so good, how is it inefficient!”</p><br/><p>Lu Tingxiao brought out a gun from under the television stand, then threw it in front of him.</p><br/><p>The corner of Lu Jingli’s mouth twitched, “Damn! Isn’t this too simple and violent! There’s no skill in this method!”</p><br/><p>As the two were speaking, footsteps sounded from above them.</p><br/><p>Without a change in expression, Lu Tingxiao placed the gun back and looked up with a gentle gaze at the newcomer, “Did Little Treasure fall asleep?”</p><br/><p>“Yes, I finally got him to sleep!” After replying, Ning Xi hurriedly said with an anxious expression, “Uh, Lu Tingxiao, I have some urgent business and I need to go out for a while. I’ve already left a note for Little Treasure and I charged my phone. You can contact me at any time. I’ll come back in three hours at the max! Alright, I won’t say anymore, bye!”</p><br/><p>After saying so, she flew like the breeze and left.</p><br/><p>Lu Jingli rubbed his chin, “Bro, where’s Sister-in-law going in such a rush?”</p><br/><p>Lu Tingxiao stared in the direction the girl had left with an inscrutable gaze before urging Lu Jingli, “Find someone to follow her.”</p><br/><p>There was definitely something complicated behind this, since Ning Xi had left at this kind of time. If it wasn’t good for Little Treasure to be left alone at home, he would definitely have gone himself.</p><br/><p>“There’s no need to find someone else, I’ll go myself!” Lu Jingli cheerfully accepted the mission on the spot.</p><br/><p>Lu Jingli returned home to pick out a more low-key black car, then followed closely behind Ning Xi, who was driving on the roads like a hurricane on her motorbike.</p><br/><p>After twenty minutes, he stopped at the small apartment that Ning Xi used to live in. While monitoring the movements in the area, he reported the situation to Lu Tingxiao in real-time.</p><br/>\n</div>"}