{"title": "Chapter 150: The Most Romantic Birthday", "id": 150, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-150-the-most-romantic-birthday", "volume_title": "Volume 2", "body": "<h1>Chapter 150: The Most Romantic Birthday</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 150: The Most Romantic Birthday</p><br/><p>“Let’s go.” Lu Tingxiao held her hand as he walked inside.</p><br/><p>His movements were extremely natural.</p><br/><p>Ning Xi glanced at their linked hands. Although she knew that Lu Tingxiao was just worried that there would be another mishap, her mood changed slightly.</p><br/><p>The lighting in the control room was very dim. There were only about ten or so computers operating, emitting a cold glow.</p><br/><p>Ning Xi followed Lu Tingxiao as they made their way around. In the end, they found Little Treasure in front of the largest machine.</p><br/><p>Little Treasure looked very small as he sat on his little custom-made chair in front of that monstrous machine covered in countless wires. He stared expressionlessly at the flickering screen displaying endless lines of text from computer programs. A smaller robot that closely resembled his own body shape stood by his side. The gun barrel in its hand was pointed perfectly straight in their direction.</p><br/><p>When she saw the aloof and lifeless expression on Little Treasure’s face, Ning Xi felt as though her heart had been squeezed tightly by iron claws. It hurt so much she could barely breathe.</p><br/><p>“Little Treasure…” She trembled as she called out softly.</p><br/><p>The little guy stared at the screen without the slightest reaction.</p><br/><p>Ning Xi was really frightened now. She had heard Lu Tingxiao and the others mention this before, but she had never personally seen what Little Treasure was like when his sickness acted up.</p><br/><p>“What do we do… This is all my fault…”</p><br/><p>“Ning Xi, don’t blame yourself. It’s not a big deal. It’s quite common for him to be in this state. He’ll be fine if you call out to him a couple more times.” Lu Tingxiao reassured her.</p><br/><p>In actual fact, Lu Tingxiao only said that because he was talking to Ning Xi. If it was someone else standing in her position, things wouldn’t be this simple.</p><br/><p>After forcing herself to calm down, Ning Xi carefully approached him one step at a time.</p><br/><p>While the little robot’s head followed her as she moved, Little Treasure remained just as unresponsive as before.</p><br/><p>Ning Xi walked up to Little Treasure and then slowly squatted down. She cautiously took up his small hand, “Little Treasure… Auntie is back now… Sorry… Something happened to Auntie last night so Auntie couldn’t make it back…”</p><br/><p>Since Ning Xi couldn’t explain the details to him, she could only lower her head sadly.</p><br/><p>After some time, a tiny little fist suddenly appeared in her line of sight.</p><br/><p>Following that, the little fist slowly opened to reveal a pink hair clip sitting in the middle of a soft palm. More than a hundred small, pink diamonds lined up to form a heart on the hair clip. They glittered under the cold glow of the machines around them.</p><br/><p>“This is…” Ning Xi looked up immediately in surprise and happiness. However, not a single trace of emotion showed on the little guy’s face.</p><br/><p>At the side, Lu Tingxiao glanced at the hair clip in the palm of his son’s hand and spoke, “This is the birthday present Little Treasure made for you.”</p><br/><p>“So this is for me….” The present really contained diamonds!</p><br/><p>Ning Xi felt rather embarrassed.</p><br/><p>Lu Tingxiao saw through her thoughts and explained immediately, “They’re just some common rhinestones so it’s not very expensive. However, Little Treasure personally glued on each of the 99 crystals one at a time.”</p><br/><p>When Ning Xi heard this, she was moved to tears in an instant. Instead of taking the hair clip directly, she asked Little Treasure, “Could you help Auntie put it on?”</p><br/><p>Little Treasure’s vision slowly focused on the hair clip, before he extended his little hand and clumsily placed the hair clip on her hair, close to her ear.</p><br/><p>Ning Xi touched the clip and smiled happily, “Does it look nice?”</p><br/><p>Little Treasure nodded.</p><br/><p>After finally getting a response from Little Treasure, Ning Xi couldn’t endure it any longer, so she pulled the little guy into her arms.</p><br/><p>At the same moment, with a ‘bang’, the little robot on the side shot out a burst of colorful confetti and even began to play the Happy Birthday song.</p><br/><p>Ning Xi’s eyes watered up as she looked up at the confetti-filled air, “Thank you, Darling. This is the most romantic birthday I’ve ever had in my life!”</p><br/>\n</div>"}