{"title": "Chapter 157: Her Flattery Failed", "id": 157, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-157-her-flattery-failed", "volume_title": "Volume 2", "body": "<h1>Chapter 157: Her Flattery Failed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 157: Her Flattery Failed</p><br/><p>The air was dead silent.</p><br/><p>After a long moment, Ning Xi swallowed with great difficulty and tried to change the topic by running her mouth off, “Haha… Big Boss, your shooting skills are amazing! Impressive, impressive! You’re just a little too wasteful! That vase must have been pretty expensive, right?”</p><br/><p>Lu Tingxiao’s eyes were cold: “If you don’t want to speak of it, you don’t have to.”</p><br/><p>Ning Xi’s head drooped downwards in a disheartened manner, “But you look like you’re going to break off all ties with me if I don’t confess everything, you’re not being honest at all…”</p><br/><p>Other than confessing everything, was there a second option for her?</p><br/><p>Ning Xi sighed and could only choose to explain the sequence of events to him, “Didn’t I tell you before that something went wrong with the prop and I accidentally hurt Ning Xueluo? Right now, the prop master is insisting on saying that I bribed him to switch the props. Isn’t that forcing me into a dead end? If he sticks to his confession, it won’t just be my career that will be ruined, I’ll even have to go to jail!”</p><br/><p>Lu Tingxiao looked at her calmly, “So?”</p><br/><p>Ning Xi coughed lightly and stalled, “So I went to force that guy to speak the truth!”</p><br/><p>Seeing her nonchalant attitude, storm clouds were gathering on Lu Tingxiao’s face, “Ning Xi, do you know how dangerous it was for you to do that? As a girl…”</p><br/><p>Ning Xi covered her head and said, “I know, I know! But wasn’t I forced into it? You don’t know what that Zhang Qiang is like, he’s a scoundrel! I can only use simple violence to deal with that kind of person!”</p><br/><p>“I’ve said before that you can look for me if you need any help. You chose to use such a dangerous method, before even coming to ask me for help?” Lu Tingxiao’s eyes were filled with grave disappointment.</p><br/><p>That gaze unexpectedly made her heart clench in pain.</p><br/><p>This was the first time Lu Tingxiao had gotten so angry with her. Ning Xi’s face was full of anxiety, “No, it’s not like that! I…”</p><br/><p>Finally, feeling like she was going to have a headache, she sighed, “I’m just used to it…”</p><br/><p>Used to solving everything by herself. Used to not relying on others.</p><br/><p>The two of them sunk into silence again.</p><br/><p>“Um, but, how did you know that I had a gun on me?” Ning Xi abruptly recalled this matter and asked suspiciously.</p><br/><p>“The smell.” Lu Tingxiao answered coldly.</p><br/><p>“Uh, so that’s how! Was it the smell of gunpowder? I didn’t realise that even your sense of smell is so strong, Big Boss! Hehehe…”</p><br/><p>Lu Tingxiao’s expression remained as cold as ice, the kind that had been frozen for a thousand years.</p><br/><p>Her flattery had failed.</p><br/><p>Ning Xi had an expression of complete helplessness, “Lu Tingxiao, it’s not that I didn’t want to ask you for help. There’s just no need for you to personally take action for small matters like these. Isn’t it like using a sledgehammer to kill a fly? However, right now, I do have something that I really, really need your help with! You really have to help me this time, please please please! I kept thinking about it, and you’re the only one I can turn to for this! So even if you’re not willing to help me, I’ll definitely keep disturbing you!”</p><br/><p>This time, although his expression remained frosty, he finally looked her in the eye, “Speak.”</p><br/><p>Ning Xi heaved a sigh of relief and hurriedly spoke up, “It’s like this! Although I finally got Zhang Qiang’s confession, and the emails and bank transfer details from the mastermind, all this evidence can only clear my innocence, but I won’t be able to find the mastermind.”</p><br/><p>“It wouldn’t be very gentlemanly of me if I didn’t take revenge for this grudge. Letting the mastermind off so easily would be such a waste! So I was thinking, is there any way that you could decode the mastermind’s account details and IP address?”</p><br/><p>“Big boss, it must have been thanks to your genes that Darling Little Treasure is already so clever at such a young age! So Big Boss must be even more impressive at computers and such. I’m sure you have some way to do that, right?”</p><br/>\n</div>"}