{"title": "Chapter 167: Our Feelings Are Mutual", "id": 167, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-167-our-feelings-are-mutual", "volume_title": "Volume 2", "body": "<h1>Chapter 167: Our Feelings Are Mutual</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 167: Our Feelings Are Mutual</p><br/><p>“Eh, our partnership has been settled just like that?” Ning Xi was still somewhat dazed.</p><br/><p>“I’ve taken an interest in you and you’re also interested in Golden Age. Our feelings are mutual, are there any problems?” Lu Tingxiao replied her question with one of his own.</p><br/><p>“…” Our feelings are mutual. The way he used that phrase…</p><br/><p>Lu Tingxiao was the last person in the world that Ning Xi would want to cause trouble for. Therefore, she asked very solemnly, “Are you sure that you don’t need to think it over some more? I think that I can be quite the troublemaker. What if I cause trouble for you in the future…”</p><br/><p>“Why would you need a management company if you could handle everything yourself? That’s exactly why I exist.”</p><br/><p>“Oh…” Ning Xi rubbed her nose.</p><br/><p>In any case, she had discovered that even though the great demon king was a man of few words, every word he spoke carried a great deal of weight. She couldn’t win him in a battle of words.</p><br/><p>Ning Xi thought carefully for a moment. Since Starlight had wronged her so many times while she was under their management, it was only natural for her to ask for the termination of their contract and no one would use the topic to malign her. Now that the penalty fee was settled and clearing her name was just a matter of time, it was unlikely that she would bring Lu Tingxiao any trouble.</p><br/><p>After reflecting for a bit, she was finally able to rest at ease.</p><br/><p>“Big Boss, I’ll definitely work hard to earn you money to repay your kindness in hiring me. You won’t be disappointed!” Ning Xi immediately expressed her sincerity to her boss.</p><br/><p>She was still confident in her abilities!</p><br/><p>Lu Tingxiao smiled slightly, “Okay, I’m looking forward to that.”</p><br/><p>At that moment, Ning Xi’s cell phone suddenly rang.</p><br/><p>The caller ID showed ‘Corrupted Devil King’.</p><br/><p>Jiang Muye had called many times previously, but she had been too busy and then she had suddenly fallen ill. There simply hadn’t been any time to call him back.</p><br/><p>Ning Xi didn’t try to hide anything from Lu Tingxiao. She went ahead and accepted the call, “Hello? Jiang…”</p><br/><p>Before she had a chance to speak, a roar that almost shattered her eardrums came from the phone——</p><br/><p>“Ning Xiao Xi, where the hell are you?! Why are you playing around at a time like this?! Do you know how badly people have been shitting on you?!”</p><br/><p>He had gone to the Lu Residence once to find her, only to be told by the butler that she wasn’t there, and neither was Lu Tingxiao. That day just happened to be her birthday and the two of them had disappeared at the same time. What else could he imagine?!</p><br/><p>Ning Xi speechlessly rubbed her ear, “Who’s been playing around?! I’m at the freaking hospital!”</p><br/><p>Jiang Muye was stunned for a moment before his tone immediately turned anxious, “What? You’re in the hospital? What happened to you? Did you get beaten up by someone?”</p><br/><p>Ning Xi frowned slightly, “You’re the one who got beaten up! I just had a fever, that’s all!”</p><br/><p>“Which hospital are you at? I’ll come over to see you right away!”</p><br/><p>“There’s no need for that. You’re so busy, just focus on your family matters first. My fever has already gone down and Lu Tingxiao is here with me. Little Treasure will be coming over later too.”</p><br/><p>The person on the other end suddenly went silent for a couple of seconds. Then, she heard Jiang Muye speak gloomily, “Ning Xi, have you looked at the email I sent you yet?”</p><br/><p>“Not yet. I haven’t had the time. I’ve been dealing with one problem after the other ever since two days ago and I haven’t had a single moment of rest! It’s a long story, but I’ll tell you about it later when I have the time.</p><br/><p>Jiang Muye took a deep breath, “Remember to look at it as soon as possible. Also, I need to ask you, what are you planning to do about the situation with Ning Xueluo? I was going to help you find that bastard Zhang Qiang, but when I sent someone to deal with him, his place was already completely empty. You’re part of Starlight so I can’t use my company’s PR department, but I consulted with Ming-ge and I’ve contacted a reliable public relations team for you…”</p><br/><p>Ning Xi responded gratefully, “Thanks for that, Jiang Muye, but that won’t be necessary. I’ve already gotten some evidence that will prove my innocence.”</p><br/><p>Jiang Muye ground his teeth together, “Was it Lu Tingxiao again?”</p><br/>\n</div>"}