{"title": "Chapter 174: A Midnight Scare", "id": 174, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-174-a-midnight-scare", "volume_title": "Volume 2", "body": "<h1>Chapter 174: A Midnight Scare</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 174: A Midnight Scare</p><br/><p>The First People’s Hospital.</p><br/><p>Ning Xueluo laid in her hospital bed contentedly with red wine in one hand and her phone with the other. She was in absolute delight as she scrolled through Weibo, reading online comments flaming Ning Xi.</p><br/><p>Cui Caijing massaged her calves while speaking in a flattering tone, “Xueluo-jie, your legs are so shapely. They’re so long and so straight!”</p><br/><p>Actually, they were only slightly better looking than the legs of most people. The amount she spent on maintaining her shape every year ran into a few hundred thousand yuan, how could her legs not look good?</p><br/><p>However, Ning Xueluo clearly enjoyed the praise. Pleased with herself, she said, “I was born like this.”</p><br/><p>For some reason, Chang Li felt uneasy and spoke up with concern, “Xueluo, Ning Xi hasn’t appeared for so long. She couldn’t possibly be scheming against us, right?”</p><br/><p>Hearing that, Ning Xueluo replied with undisguised ridicule and disdain in her voice, “You’re overestimating her. Even if she sells her body to a hundred men, she won’t be able to turn the tables on this matter!”</p><br/><p>“That’s true. In the entertainment circle, artistes with a bad track record like this usually end up in a situation worse than Jia Qingqing’s! It’ll be useless even if anyone tries to help her clear the air!” Chang Li’s heart calmed down a little, “Right, I just sent Ning Xi an email. I gave her an ultimatum: she has to come down to the office tomorrow before 6pm or we’ll crush her public image. I believe she’ll come out of hiding tomorrow!”</p><br/><p>“Remember to arrange for some reporters to wait for her!” Ning Xueluo was all smiles.</p><br/><p>As she was replying the concerned comments of her fans, a new email notification suddenly popped up on her screen.</p><br/><p>Who would send her an email this late at night? It was her personal email as well…</p><br/><p>Ning Xueluo didn’t think much of it and casually opened the email. However, with one glance, she immediately froze in shock and spilled red wine all over herself.</p><br/><p>“Oh no, Xueluo-jie, what happened to you?” Cui Caijing hurriedly brought over paper towels for her to wipe away the spilled wine.</p><br/><p>“Xueluo, what happened?” Chang Li asked with suspicion upon seeing the frightened expression on Ning Xueluo’s face.</p><br/><p>“See for yourself!” Ning Xueluo threw her phone at Cui Caijing’s head with hands trembling in rage. “How did you handle everything? You left such a huge trace behind! Why did you send that email from my apartment? And didn’t I tell you a million times to use an anonymous account to send the money?”</p><br/><p>Dazed, Cui Caijing took a long while to recover from getting hit in the head. She held onto her forehead as she read the email, before freezing in shock. With a panicked expression, she exclaimed, “Xueluo-jie, this isn’t my fault! I used an anonymous account! As for the email… You were there when I sent the email and you didn’t say anything then!”</p><br/><p>Ning Xueluo threw the wine glass to the floor. Immediately after that, the sound of shattered glass echoed in the ward, accompanying her shouts, “Even if I didn’t mention it, couldn’t you have thought of it yourself? If you need me to tell you everything, then what’s the use of having you around?”</p><br/><p>When Chang Li finished reading the email, her expression turned grave. “My biggest worries came true! I was afraid that someone would discover some traces of evidence… Who sent that email? Could it be Zhang Qiang?”</p><br/><p>Ning Xueluo’s face seemed dark and sinister as she replied confidently, “That’s impossible! Zhang Qiang is just some hoodlum with barely any education. He wouldn’t know anything about IP addresses and anonymous accounts!”</p><br/><p>“Then this is rather strange… No matter what, Zhang Qiang is the only one who knows about this, excluding us. He must have been the one to leak the news! Could he have conspired with someone else? But Zhang Qiang already ran off ages ago, we can’t contact him to ask!” Chang Li said anxiously.</p><br/><p>Ning Xueluo violently paced back and forth in the ward, “What’s the use of saying so much? Most importantly, how should we solve this problem?!”</p><br/>\n</div>"}