{"title": "Chapter 178: Ning Xi’s Backer?", "id": 178, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-178-ning-xi%E2%80%99s-backer", "volume_title": "Volume 2", "body": "<h1>Chapter 178: Ning Xi’s Backer?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178: Ning Xi’s Backer?</p><br/><p>In the end, the results were: the other party was willing to settle the dispute in private and didn’t dare to mention bringing it to the courts anymore.</p><br/><p>Ning Xi looked on with a stupefied expression. So Lawyer Chen had only been saving his strength to bring out his finishing move?</p><br/><p>Chang Li was even more flabbergasted.</p><br/><p>The three lawyers facing them were in a similar state too.</p><br/><p>Just as Ning Xi and Lawyer Chen were preparing to leave, the lawyer from the Ning family, Cai Yingyong abruptly stood up in excitement. With an expression that was equal parts shock and suspicion, he asked Lawyer Chen, “Please wait a moment! If I may be so bold, I’d like to ask you a question! Are you… Are you, by any chance, the great Lawyer Chen, Chen Jing?</p><br/><p>The other two lawyers standing at his side displayed their shock on their faces upon hearing that, “What… Chen Jing? Which Chen Jing? It… It couldn’t possibly be that Lawyer Chen, could it?!”</p><br/><p>They had completely looked down upon the mystery lawyer that Ning Xi had brought in just now, so they hadn’t asked for his identity. However, the more they thought about it now, the more it seemed like something wasn’t quite right.</p><br/><p>Although they had never seen Chen Jing with their own eyes before, they had long heard of the way he worked.</p><br/><p>He was a man of few words to the point that people would think he was mute, but once he started working, it was as if he had flipped the crazy switch; rapid-fire speech, irrefutable logic, words straight to the points, explosive fighting power…</p><br/><p>Lawyer Chen completely ignored Cai Yingyong and walked out of the meeting room without a single pause in his stride.</p><br/><p>Left behind in the room, Chang Li collapsed onto a chair, all the blood drained out of her face.</p><br/><p>They were done for!</p><br/><p>Ning Xueluo had repeatedly told them not to let Ning Xi break her contract, but now, their plans were all spoiled.</p><br/><p>The lawyer that Ning Xi had hired turned out to be the number one lawyer in the capital, the great Lawyer Chen?</p><br/><p>Why would the great Lawyer Chen come all the way here just to help Ning Xi negotiate a matter as small as terminating a contract?</p><br/><p>This lawyer charged by the minute, and it cost an arm and a leg to hire him!</p><br/><p>Could it be… that Ning Xi’s backer was this lawyer?</p><br/><p>……</p><br/><p>Even until she had walked out of Starlight’s building, Ning Xi was still a little dazed. She hadn’t expected that this stuffy and stiff-looking lawyer could actually be that fierce.</p><br/><p>Were all the lawyers in Golden Age’s legal department so epic?</p><br/><p>While lost in her lamentations, a large group of reporters suddenly swarmed around her at the entrance to the building——</p><br/><p>“Ning Xi! Ning Xi! Have you come to give yourself up?”</p><br/><p>“Do you have anything to say about how you attempted to kill Ning Xueluo?”</p><br/><p>“Ning Xueluo has generously announced that she’ll give you a chance to turn over a new leaf as long as you apologise. Do you feel ashamed for your actions?”</p><br/><p>“May I ask if you were also the one behind the previous matter with Jia Qingqing?”</p><br/><p>“I heard that Starlight Entertainment is going to terminate your contract and blacklist you, is that true?”</p><br/><p>……</p><br/><p>The reporters kept pushing forward in a craze, squeezing Ning Xi in. She only had two arms to defend herself against the swarm and it wouldn’t be very good for her image if she started beating up the reporters, so her hands were tied. Just as she was trying to think of a way to extract herself from the crowd, five well-trained bodyguards in black suits came out of nowhere and controlled the crowd in no more than ten seconds. They protected Ning Xi in the center without letting anyone through.</p><br/><p>The reporters exchanged glances.</p><br/><p>What was happening?</p><br/><p>Where had these people come from?</p><br/><p>How could a little actress like Ning Xi, without any power, money or background and in dire straits, hire bodyguards like these guys? There were even five of them all at once!</p><br/><p>In order to avoid causing a scandal and unwanted rumours for Ning Xi, the bodyguards didn’t carry any emblems identifying that they worked for the Lu family. However, it was enough to scare off those reporters.</p><br/><p>Ning Xi stood within the bodyguards’ protective circle and faced all the reporters with a cool and calm expression. She pitched her voice so they could all hear: “Firstly, I’m innocent, so I don’t have to give myself up. There’s also no reason for me to feel ashamed.”</p><br/><p>“Secondly, the truth for Jia Qingqing’s incident has already been made clear, please don’t try to obscure the facts and mislead the public, otherwise that’s slander!”</p><br/><p>“Thirdly, I have terminated my contract with Starlight, just a few minutes ago. However, I was the one to initiate the termination and they weren’t the ones to cancel my contract.”</p><br/><p>“Lastly, if they want to blacklist me, then I’d like to see them try!”</p><br/>\n</div>"}