{"title": "Chapter 173: A Quick Lesson", "id": 173, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-173-a-quick-lesson", "volume_title": "Volume 2", "body": "<h1>Chapter 173: A Quick Lesson</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 173: A Quick Lesson</p><br/><p>Late night, in the Lu residence.</p><br/><p>After catching up with some entertainment news online, Ning Xi was preparing to sleep when a bunch of messages popped up on MSN.</p><br/><p>The messages were from Su Yan.</p><br/><p>Su Yan: [Xiao Xi, where are you right now? I saw someone at Xueluo’s hospital today, was it you?]</p><br/><p>Su Yan: [You really went overboard with this matter. You can’t keep using the guilt that we feel towards you to act without any restraint. Our tolerance is wearing thin!]</p><br/><p>Su Yan: [Escaping from your problems doesn’t solve anything, you owe Xueluo an apology!]</p><br/><p>……</p><br/><p>Ning Xi scoffed lightly before mashing out a reply: [I bought a watch last year!]</p><br/><p>At that moment, three knocks sounded from the door.</p><br/><p>“Come in~”</p><br/><p>Lu Tingxiao pushed the door open and walked in holding a mug of warm milk. Seeing that she was still sprawled out and using her laptop, he immediately frowned, “Why are you still surfing the web? You need to rest.”</p><br/><p>“I was about to sleep, but I got disgusted with something right before bed.” Ning Xi complained.</p><br/><p>Lu Tingxiao walked over and passed the mug to her, “What happened?”</p><br/><p>Ning Xi received the mug of milk with thanks. Without any thought of hiding what had happened, she then moved the laptop over to show him the chat logs on screen.</p><br/><p>Lu Tingxiao’s expression turned slightly darker after he glanced at the screen. He showed a doubtful expression, “I bought a watch last year, what does that mean?”</p><br/><p>“Pfft…” After hearing Lu Tingxiao read out that phrase in such an upright manner, Ning Xi almost spat the milk out. She explained awkwardly while coughing, “Uh, it’s some internet slang, it’s a… it’s a classic phrase used to openly scold someone else!”</p><br/><p>“Is it? What does it mean?” Lu Tingxiao modestly requested her explanation.</p><br/><p>Ning Xi had no other choice but to start teaching him earnestly: “The abbreviation for ‘I bought a watch last year’ is ‘WQNMLGB’… Uh, do you understand?”</p><br/><p>Lu Tingxiao nodded after understanding the meaning in just seconds.</p><br/><p>Ning Xi heaved a sigh of relief. Luckily the great demon king had a high IQ. Otherwise, she would really have been a little embarrassed if she had to say a curse like ‘**** your mum’ out loud.</p><br/><p>Over at Su Yan’s side, upon seeing Ning Xi’s reply, he immediately sent over another wave of messages, mostly along the lines of ‘it’s not too late to repent’. Without even bothering with the messages, Ning Xi signed out of MSN and turned off her laptop.</p><br/><p>Seeing how Ning Xi had neatly ignored the messages, Lu Tingxiao’s mood seemed to lift, “I’ve already contacted Ning Xueluo for you.”</p><br/><p>“Really? What did you say?” Ning Xi immediately asked.</p><br/><p>Lu Tingxiao pulled out his phone, opened an email and showed it to her.</p><br/><p>Ning Xi hurriedly moved closer to him to look at it. When she finished reading it, she turned completely speechless, “…”</p><br/><p>In Lu Tingxiao’s email to Ning Xueluo, other than the evidence and an account number, there were only a few words and there wasn’t even any punctuation: 8 million yuan in 24 hours.</p><br/><p>It was extremely like Lu Tingxiao’s way of doing things.</p><br/><p>“Not bad, not bad. The simpler it is, the easier it is to cause panic. This is pretty good.” Ning Xi made a show of taking things seriously, nodding as she praised him.</p><br/><p>“You can terminate your contract with Starlight when the money comes in. I’ll send a lawyer to accompany you there when the time comes, so they can’t cause any trouble for you.”</p><br/><p>“I’ve already gotten Jingli to prepare your contract with Golden Age and I’ll show it to you tomorrow morning. If there’s anything you want to change, we can discuss it later. After signing with Golden Age, the company will arrange for a press conference at an appropriate time and reveal the evidence. From there, we’ll start on the legal proceedings…” Lu Tingxiao’s low voice resounded like a cello as he spoke calmly of the upcoming plans and arrangements.</p><br/><p>Ning Xi was in a daze while listening to him. She could only nod and nod, before finally asking, “Is there anything you need me to do?”</p><br/><p>“Eat, sleep and rest.”</p><br/><p>“Okay…”</p><br/><p>TL’s Note:</p><br/><p>‘I bought a watch last year’ is Chinese Internet slang for… ahem, ‘**** your mum’.</p><br/><p>The original Chinese words for ‘**** your mum’ sound almost the same as ‘I bought a watch last year’ in Chinese, so ‘I bought a watch last year’ ended up becoming an alternate form for this curse. The pinyin is ‘Wǒ qù nián mǎi le gè biǎo’, so the abbreviation for this phrase is: WQNMLGB.</p><br/><p>Also, as a side note, 8 million yuan = USD ~1.16 million (as of today’s rate).</p><br/>\n</div>"}