{"title": "Chapter 186: A Sweet Nickname", "id": 186, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-186-a-sweet-nickname", "volume_title": "Volume 2", "body": "<h1>Chapter 186: A Sweet Nickname</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lu Ting Xiao’s hands twist a lot, and then I saw the person who was thrown sideways in a circle fly out and fall to the ground like broken sacks, motionless…….</p><br/><p>Probably because Lu Ting Xiao’s shot was too brutal, the other three all looked at each other and subconsciously take a step back.</p><br/><p>“Are you okay?” Turning to Ning Xi, Lu Ting Xiao’s eye still had a little hostility</p><br/><p>Ning Xi nodded, “I’m fine……” She had never even seen Lu Ting Xiao’s hits, most of the time she even thought that Lu Ting Xiao was elegant, she did not think his physical skill was so…..amazing.</p><br/><p>At this time, a black Ferrari slowly stops over, and from the car comes down one person.</p><br/><p>Out steps Ning Yaohua in a Giorgio Armani suit.</p><br/><p>Ning Yaohua looks as if he is staring at garbage while looking at the man next to Ning Xi, but also contemptuously looking at the car parked in front of the apartment.</p><br/><p>“Ning Xi, this is what you hang out with these days, a man who couldn’t take you home? Spending hundreds of thousands for a broken car?”</p><br/><p>Ning Xi heard this and almost laughed, “For you, you judge a man’s standard by how much money he spends on a car?”</p><br/><p>According to him, he doesn’t care about her being kept but cares about her backers not being powerful enough.</p><br/><p>If she had a Bentley, is it more noble?</p><br/><p>“Disregarding the car, do you not see the face? I thought that you had found a strong backer behind you! You actually found a small, half-baked(kept man/a bitch) man! You’re really regressing!” Ning Yaohua shouted more abuse.</p><br/><p>Although the man looks good, but to show this car, he is at most just a small company owner.</p><br/><p>“…………..” He actually said Lu Ting Xiao is a small, half-baked(kept/a bitch) man……</p><br/><p>Ning Yaohua continues scolding Ning Xi and turns to see Lu Ting Xiao, “Who are you! Do you know who she is? She’s my Ning Yaohuas’ daughter and you dare to play?! Believe it or not, I’ll let you in if I fail to make you meet god/emperor! (not sure about this translation )</p><br/><p>Ning Xi: “………..”</p><br/><p>Lu Ting Xiao in front of outsiders cherishes his words like gold, now facing Ning Yaohuas’ condescending arrogance, even he has a glare.</p><br/><p>Ning Yaohua wants to continue to humiliate him, but he doesn’t know why his hear felt a chill and he suddenly couldn’t speak.</p><br/><p>Why does such a small boss have such an imposing manner….</p><br/><p>Well, he’s not this daughter that is allowing herself to be fooled by his looks.</p><br/><p>“Ning Xi, what I said last night is still valid, you can choose now to go back with me!” Ning Yaohua said with a charitable tone.</p><br/><p>Ning Xi’s lips smirk while she hooks intimate arms around the side of the arm of Lu Ting Xiao, “I am sorry, I choose my family’s half-baked man! You go back where you came from!”</p><br/><p>“Ning Xi! You’ll be sorry!” Looking at the two people hold hands sets Ning Yaohua in a rage, then with a gloomy face he told the bodyguard, “to keep up with them!”</p><br/><p>Today let him experience too many unexpected things, one is Ning Xi’s skill, the impression that his daughter is physically weak is nothing but a lie. (originally said tied to the power of chicken)</p><br/><p>In addition, what is the identity of this man? He always felt that something is wrong</p><br/><p>……..back to the car Ning Xi scratched her head while apologizing to Lu Ting Xiao, “I am sorry ah! I involved you inexplicably and got you scolded…..”</p><br/><p>“It’s nothing.” Although scolded, Lu Ting Xiao is not angry at all. The reason why is naturally because of Ning Xi’s last hug, and even the small half-baked man because she added in front the words ‘my family’, this attribute turning it into a sweet nickname.</p><br/>\n</div>"}