{"title": "Chapter 197: The Fans Favorite Is Clearly You", "id": 197, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-197-the-fans-favorite-is-clearly-you", "volume_title": "Volume 2", "body": "<h1>Chapter 197: The Fans Favorite Is Clearly You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I’m going to be batch posting the chapters at once now.</p><br/><p>There’s an unexpected Announcement later today once I get more information.</p><br/><p>———————————————————————————————————–</p><br/><p>Online public opinion is a moment of magic reversal:</p><br/><p>[God! What did I see? I need to go to the toilet for talking three pounds of s**t!]</p><br/><p>[One may be hacking but now that even Lu Ting Xiao has reposted it, can it be false? Golden Age Entertainment really signed Ning Xi! Even Lu Ting Xiao was stirred up! I can’t understand the world!]</p><br/><p>[Since Lu Ting Xiao reposted this, he must know and even agreed to Golden Entertainment’s decision. Lu Jingli may get carried away by the crowd, but it is absolutely impossible with Lu Ting Xiao! So this situation is very strange!]</p><br/><p>[Yes, there must be something wrong with the situation! Starlight may have the next big move! Just wait for the reversal!]</p><br/><p>[I won’t say anything, I will wait for the reversal! I firmly support my male gods!]</p><br/><p>[Waiting for the truth! I believe in fairness!]</p><br/><p>………</p><br/><p>In short, after Lu Ting Xiao’s reblogged post, the original one-sided public opinion was instantly pulled back. All the users are beginning to remain neutral and some gradually returned to reason.</p><br/><p>Ning Xi just brushed the microblogging incident away, the series of changes were just too amazing.</p><br/><p>Big Boss Lu is too amazing ah!</p><br/><p>The reason was because Lu Ting Xiao’s image was really perfect. After taking over the Lu Group, he had never made the wrong decision. Five years ago, due to the economic crisis, a number of companies went bankrupt.</p><br/><p>The Lu Group were the only ones who not only survived but thrived instead. People say that he is like an oracle, and everyone believes it.</p><br/><p>At the same time in the Lu home’s downstairs living room,</p><br/><p>Lu Jingli was holding his mobile phone while lying on the sofa, cursing. “What! These bastards are nothing! What do you mean I’m liable to get carried away by the fans, but you can’t! They are simply wrong about me! This is an injustice! It is clear that you are the fans favorite. You! You! You! This is injustice!”</p><br/><p>As he continued howling, Ning Xi arrived at the house.</p><br/><p>“It was too quiet, I didn’t quite hear what you were complaining about?” Lu Ting Xiao asked.</p><br/><p>“Nothing!” Lu Jingli immediately sat up. Some abuse was clearly unspeakable.</p><br/><p>Pacing a few hundred steps at a time around the room he refused to look at Lu Ting Xiao.</p><br/><p>Ignoring him, Lu Ting Xiao looked up from his book at Ning Xi: “Welcome back. Did you meet Lin Zhizhi?”</p><br/><p>Ning Xi nodded repeatedly, “Yes, I saw elder sister Lin. It was quite a good meeting. She is completely my favorite type of person; a cold face that looks strict but makes you feel safe.”</p><br/><p>Lu Ting Xiao “………” It seems like there was no problem, but the way she worded it left him feeling a bit insecure.</p><br/><p>Ning Xi immediately turned to stare at Lu Jingli. “You! Why are you so impatient? Why did you announce my signing onto Golden Age this early, hmm?”</p><br/><p>Lu Jingli gave her a brilliant expression and began: “Of course it is to add some flames for you to increase your popularity! You see, the more buzz, the more people will continue talking about you!”</p><br/><p>“Huh” Ning Xi cried, “If Lu Ting Xiao didn’t save the day, we were almost accused of being adulterers together you know?”</p><br/><p>When Lu Jingli heard this, he finally had a guilty expression and muttered: ”Scolded. Always being scolded.”</p><br/><p>“Anyways,” he continued “Tomorrow is the reveal!” He expected that the fans would curse, but didn’t think that it would become so ugly from people’s jealousy.</p><br/><p>“Be sure you send microblog notices to different correspondents to convene at the conference tomorrow.” Lu Ting Xiao reminded Ning Xi.</p><br/><p>“Of course, I’ll send it now.” Not long after, Ning Xi released it. Lu Jingli reblogged it and Lin Zhizhi followed soon after.</p><br/><p>At this time, Ning Xi’s phone screen flashed and a phone call came in. The caller ID – Jiang Muye</p><br/><p>Chapter 197 – The Fans Favorite Is Clearly You Teaser</p><br/><p>At the same time in the Lu home’s downstairs living room,</p><br/><p>Lu Jingli was holding his mobile phone while lying on the sofa, cursing. “What! These bastards know nothing! What do you mean I’m liable to get carried away by the fans, but you can’t! They are simply wrong about me! This is an injustice! It is clear that you are the fans favorite. You! You! You! This is injustice!”</p><br/><p>As he continued howling, Ning Xi arrived at the house.</p><br/><p>“It was too quiet, I didn’t quite hear what you were complaining about?” Lu Ting Xiao asked quietly</p><br/><p>“Nothing!” Lu Jingli immediately sat up. Some abuse was clearly unspeakable.</p><br/><p>Pacing a few hundred steps at around the room he refused to look at Lu Ting Xiao.</p><br/><p>Lu Ting Xiao turns and looks at the Bat Translation team, “Get Him”</p><br/><p>We quickly chase Lu Jingli around the house for bad mouthing our evil overlord Lu Ting Xiao…..</p><br/><p>Did….did we say that aloud? The translators turn and high tail it out of there in fear</p><br/>\n</div>"}