{"title": "Chapter 198: He Kissed You In Front Of Me", "id": 198, "volume": 2, "url": "http://boxnovel.org/hidden-marriage-chapter-198-he-kissed-you-in-front-of-me", "volume_title": "Volume 2", "body": "<h1>Chapter 198: He Kissed You In Front Of Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Batch Releasing the chapters. Last one (Maybe for today). Announcement later this evening once I get back from work and have more information.</p><br/><p>——————————————————————————————————-</p><br/><p>“Hello, Jiang……”</p><br/><p>“Ning Xiao Xing! You actually signed with Golden Age!” Why didn’t you talk to me about it?! Don’t tell me you still haven’t checked your email?!” Jiang Muye roared</p><br/><p>“Oh? Weren’t you supposed to be busy? I didn’t want to bother you. Besides, what does my signing have to do with the email you sent me?”</p><br/><p>Because Jiang Muye’s voice was too loud, Nin Xi gave Lu Ting Xiao an embarrassed smile, then held her cell phone closely and headed to her room.</p><br/><p>Behind, Lu Jingli touched his chin thoughtfully and glanced at his brother with meaningful eyes, “Brother, it seems someone is trying give you a road block. It sucks that you guys like the same woman! Fortunately, I don’t think Ning Xi likes this type of tch……”</p><br/><p>Muye! Your rival is too terrible!</p><br/><p>……</p><br/><p>On the other end of Ning Xi’s phone, Muye was flaming mad, “You still haven’t checked your email till now?”</p><br/><p>“Sorry, I forgot about it! What is so important about that thing? I thought it was just some spam video…..”</p><br/><p>Jiang Muye took a deep breath, stressing each syllable, “You, open it immediately, this second, right now, open your email to see what I sent you. Don’t hang up on me, just open it now!”</p><br/><p>“Make sure you stay on the line. You need to see this!”</p><br/><p>Ning Xi reluctantly opened her computer, and logged into her email, rushing to find Jiang Muye’s email and download the attachments.</p><br/><p>It was a picture and an audio.</p><br/><p>She first opened the picture, it was a screenshot from a WeChat record.</p><br/><p>[Oh my, my grandson is so cute . Oh my, my son is so handsome! Ting Xiao, who selected your and Little Treasure’s clothes? Is it that girl you like?]</p><br/><p>[Yes]</p><br/><p>[I knew it! You can’t possibly choose this style of clothing. Look at how bright the colors are, it’s so nice! It’s not like the boring clothes you wear all day. And you also made Little Treasure wear those clothes too! This is why your home really needs a woman!]</p><br/><p>[Did she take the photos?]</p><br/><p>[Yes]</p><br/><p>[My future sister-in-law is great! She actually has the ability to get you to wear clothes of this color and have you pose obediently for pictures. I remember I gave you a suit that was almost identical to this color and your expression was so disdainful. You even criticized my aesthetic/style!]</p><br/><p>……</p><br/><p>This was a conversation with Lu Ting Xiao, the two elder Lu’s, and Lu Jingli.</p><br/><p>“Did you look at it?” Jiang Muye urged</p><br/><p>“Yes” Ning Xi replied, a complicated expression and her face. She then proceeded to open the audio.</p><br/><p>After the sounds of rustling, then came the voice of Jiang Muye.</p><br/><p>“Uncle, what do you plan on doing to Ning Xi?”</p><br/><p>Then came the sound of Lu Ting Xiao: “Towards Ning Xi…….”</p><br/><p>“Yes! Don’t you think your attitude towards Ning Xi is too ambiguous?” Jiang Muye asked.</p><br/><p>Lu Ting Xiao replied in a lazy and dangerous tone: “I think my actions have been quite obvious, if you still don’t understand…”</p><br/><p>Hearing this, Ning Xi’s heart suddenly jumped to her throat, as if she was at the scene waiting with Jiang Muye to hear the rest of Lu Ting Xiao’s words.</p><br/><p>What will he say? Waiting for the three seconds, was like waiting for three centuries, and finally sound came from Lu Ting Xiao.</p><br/><p>He said, “Do you understand?”</p><br/><p>Ning Xi was ignorant to the situation. Understand? Understand what?</p><br/><p>Just as Ning Xi thought she missed something and was clicking the replay button, she heard Muye’s voice over the phone.</p><br/><p>“You’re not deaf, he really only said those three words. However, before he said those words, he kissed you in front of my face.”</p><br/><p>Chapter 198 – He Kissed You In Front Of Me Teaser</p><br/><p>“Hello, Jiang……”</p><br/><p>“Ning Xiao Xi! You actually signed with Golden Age!” Why didn’t you talk to me about it?! Don’t tell me you still haven’t checked your email?!” Jiang Muye roared</p><br/><p>“Oh? Weren’t you supposed to be busy? I didn’t want to bother you. Besides, what does my signing have to do with the email you sent me?”</p><br/><p>Because Jiang Muye’s voice was too loud, Ning Xi gave Lu Ting Xiao an embarrassed smile, then held her cell phone closely and headed to her room.</p><br/><p>Behind, Lu Jingli touched his chin thoughtfully and glanced at his brother with meaningful eyes, “Brother, it seems someone is trying give you a road block. It sucks that you guys like the same woman! Fortunately, I don’t think Ning Xi likes this type of tch……”</p><br/><p>Muye! Your rival is too terrible!</p><br/><p>The Bat translation team watches Lu Ting Xiao’s silent but deadly hit towards his own brother, glad they escaped the last time without getting caught.</p><br/><p>Lu Ting Xiao turns to the translation team, “I need you to go get me Jiang Muye”</p><br/><p>“He’s out of the country sir” We reply as respectfully as possible. Blazaria hiding behind her three editors.</p><br/><p>Lu Ting Xiao raises one eyebrow as if to say did I stutter. We quickly depart so we won’t be next</p><br/>\n</div>"}