{"title": "Chapter 204: Of Course We Have A Special Relationship", "id": 204, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-204-of-course-we-have-a-special-relationship", "volume_title": "Volume 3", "body": "<h1>Chapter 204: Of Course We Have A Special Relationship</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Compared to Lu Jingli who liked to leave people guessing (with the information), Chen Jing’s fast and efficient moves took over the place in three minutes. His tactics of dropping bomb after bomb left people confused and disoriented.</p><br/><p>Liang Feixing realised that he need not say anything, held the microphone and said, “Okay, we are now opening up the panel for a Q &amp; A session. Feel free to ask anything.”</p><br/><p>Reporters:”…………………………..”</p><br/><p>Their, their thoughts were like a ball of yarn!</p><br/><p>The plot had reversed too fast, like a tornado. They simply did not know what to ask!</p><br/><p>But no one thought that the person to bribe Zhang Qiang was Ning Xuelo herself. That this was all plotted by her, directed and acted by her.</p><br/><p>These days, these self proclaimed justice journalists who were so enthusiastically denouncing Ning Xi’s friends, were just toys Ning Xuelo’s used to play around with?</p><br/><p>It was extremely difficult to accept this fact, but with the evidence right in front of them, how could they refuse to believe it?</p><br/><p>After a long time, a weak hand finally lifted in the crowd.</p><br/><p>Liang Feixing signaled that he could speak.</p><br/><p>The reporter who raised his hand stood up looking at Chen Jing: “I would like to ask Mr. Lawyer, through what channels did you get the evidence. Can you legally prove the authenticity of the evidence?”</p><br/><p>Chen Jing’s gaze quietly swept through the reporters, then he replied: “I am here. That is sufficient enough to prove the authenticity.”</p><br/><p>“Uh……..” the reporter was rendered speechless, unable to refute.</p><br/><p>After all, Chen Jing’s authority and professionalism put him here, yet the reporter asked such a disgraceful question.</p><br/><p>“In addition,” Chen Jing continued “We received the evidence through a legal channel, and the police have already been secretly involved.” Chen Jing’s face didn’t change color. Looking at this fair and unselfish face, the reporters nodded, not doubting the legitimacy and authenticity of the evidence.</p><br/><p>On the side, Ning Xi embarrassedly played with her hair. She really admired Lawyer Chen, but she could hear her own guilty conscience you know?</p><br/><p>What legal means? The confessions were extracted under torture and Lu Ting Xiao went hacking…..</p><br/><p>No wonder when she first saw Chen Jing, she felt a sense of déjà vu. Now she finally understood, Chen Jing and Lu Ting Xiao’s style of doing things were exactly the same.</p><br/><p>Sure enough, birds of the same feather really flock together. The reporters began to recover from the shock and began to fire off questions.</p><br/><p>Reporter: “I would like to ask General Manager Lu, why did you spend so much time and energy to help Ning Xi? Are the rumors true? Did you have any special relationship with Ning Xi privately?”</p><br/><p>Lu Jingli touched his chin thinking, of course there is a special relationship! Ning Xi is his future sister-in-law!</p><br/><p>“The reason we spent so much time and energy is of course because I believe in my own eyes to scout potential and believe that she is worth it. Today, I’ll put this sentence here. In the future, you will know that what I have done is the best for the business. Rather, Starlight will be sorry for the loss of Ning Xi!”</p><br/>\n</div>"}