{"title": "Chapter 205: Help The Boss Make More Money", "id": 205, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-205-help-the-boss-make-more-money", "volume_title": "Volume 3", "body": "<h1>Chapter 205: Help The Boss Make More Money</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After Lu Jingli’s perfect answer, people couldn’t find the trace of any flaws.</p><br/><p>The reporters could not understand Lu Jingli’s words, and finally began to look at Ning Xi.</p><br/><p>While she was today’s hero, with Golden Age Entertainment watertight protection, she almost did not need to come forward and speak.</p><br/><p>Reporter: “Ning Xi, as far as I know your and Ning Xuelo’s relationship is very good, what is the motivation for her to do this? Is there a problem between you two?</p><br/><p>Ning Xi: “This question, why don’t you ask her? ”</p><br/><p>Reporter: “In the apartment that you live in, the staff said that from a few months ago you don’t live there. Don’t you need to explain?”</p><br/><p>Ning Xi: “No. Where I want to live is my choice. ”</p><br/><p>Reporter:” Where you are living right now, can you reveal it?”</p><br/><p>Ning Xi: “With friends.”</p><br/><p>Reporter: “You joining the company, does Jiang Muye know? I heard from the cast that you guys had a good relationship. Is this something he set up?”</p><br/><p>Ning Xi: “Pretty good relationship and no.”</p><br/><p>Reporter:” …… ”</p><br/><p>This Ning Xi, it was too tricky, and wanting to get some gossip from her was simply impossible … …</p><br/><p>The reporter was helpless, he could only give up on the too sensitive questions, and asked another question: “This blessing to join Golden Age, what are your plans?”</p><br/><p>Ning Xi: “I want to work, to help the boss make more money. Since he helped me with my career, I will prove people wrong and that he didn’t make the wrong decision.”</p><br/><p>The reporter automatically thought she was referring to the boss Lu Jingli, only</p><br/><p>Lu Jingli knew that she meant his brother!</p><br/><p>Gee, if his brother heard this, his heart must have died.</p><br/><p>“Okay, today’s press conference ends here. If you have any questions, there will be private interviews. All matters relating to Ning Xi will be handled in the future by her agent Miss Lin Zhizhi.” Liang Feixing got up, ending the press conference.</p><br/><p>All the reporters were full of all types of expressions. Yesterday, Starlight held a press conference for a full three hours! Through it, all kinds of condemnation was thrown at Ning Xi, but here at Golden Age Entertainment held theirs only for a short, half hour. This showed the level, who was high and who was low, it was quite obvious.</p><br/><p>When the reporters were about to finish and leave, Lu Jingli suddenly announced,</p><br/><p>“Stop.”</p><br/><p>What happened? Was there more news? The reporters looked around with a face full of excitement.</p><br/><p>Lu Jingli, his face full of a smile as always, kindly reminded them: “Don’t tell me you forgot?”</p><br/><p>Uh? Forgot what? The reporters glanced at each other, at a loss. Lu Jingli started laughing, but there’s not a trace of amusement in his eyes.</p><br/><p>“Ning Xi was so vainly scolded by you all for so many days. You guys repeated unwarranted charges and you still have nothing to say? Are you saying it’s all in the past?”</p><br/><p>When the reporters heard this, they had a look of embarrassment. Suddenly they started competing to apologize to Ning Xi while hating Ning Xuelo in their hearts.</p><br/><p>At that moment, Ning Xi raised her eyebrows in surprise. I thought he was funny, but this little prince could get quite serious and was very good at intimidating people.</p><br/><p>However, Lu Jingli immediately reverted back to his prototype, his face in an excited expression.</p><br/><p>“Little XiXi, my darling, my sweet, how about you cook dinner at home? I’ll wash my vegetables and buy the groceries but you are responsible for cooking!”</p><br/><p>……….</p><br/><p>Ning Xi completely recovered, and thought that she really wanted to kick him and send him to heaven. In the end doesn’t he understand how his words could lead to a misunderstanding?</p><br/>\n</div>"}