{"title": "Chapter 209: So-Called Sexual Favors (unedited )", "id": 209, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-209-so-called-sexual-favors-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 209: So-Called Sexual Favors (unedited )</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Jiang Muye seeing her look like this, awkwardly asked, “How come you’re so tired? Wasn’t today’s press conference very smooth?”</p><br/><p>Every little detail had been taken care of…..</p><br/><p>“Isn’t it your fault!” Ning Xi replied irritably, then sat up staring him in the eyes: “I want to ask you…on that day did Lu Ting Xiao…..really……kiss me?”</p><br/><p>Jiang Muye took a drink from his cup of wine: “If I lie to you, I will burn all my game systems. After this night, I will no longer play video games!”</p><br/><p>Ning Xi nodded: “Okay, I believe you.” This was a serious oath.</p><br/><p>Jiang Muye couldn’t help but curse: “You have my number! How many times did I remind you to open your mail! You didn’t listen! He is simply playing you! How long have you known Lu Ting Xiao and how long have you known me? Yet you didn’t believe me!”</p><br/><p>Jiang Muye has the appearance of being injured,</p><br/><p>Ning Xi sighed, “In fact, from the first time I met with Lu Ting Xiao, he told me something.”</p><br/><p>“What? Jiang Muye asked, his expression tight</p><br/><p>Ning Xi replied “He asked to marry me.”</p><br/><p>“Puff……….cough cough cough…….what did you say?” Jiang Muye almost choked to death on his wine.</p><br/><p>Ning Xi vigorously patted his back, “I was even more shocked than you were!”</p><br/><p>“And then?” Jiang Muye hastily asked</p><br/><p>“Then I naturally asked him why he wanted to marry me! It was simply too unscientific!”</p><br/><p>“What did he say?”</p><br/><p>“He said that since I saved Little Treasure, he would pay me with his body!”</p><br/><p>“You’re lying! What was your answer?”</p><br/><p>“I said that even though I saved Little Treasure, he also saved me so it’s an even draw. There was no need to report or repay, then I ran away.”</p><br/><p>Jiang Muye stood up, pacing back and forth a dozen times: “I really want to strangle you. You knew of Lu Ting Xiao’s intentions since the beginning and you still haven’t hidden away?”</p><br/><p>Ning Xi only raised an eyebrow: “Come on, with Little Treasure depending on me as a favor? Besides, I always thought that it was because of Little Treasure that Lu Ting Xiao wanted to marry me. When I refused, he didn’t continue to press the matter so what is the problem?”</p><br/><p>“Who cares about Little Treasure! That’s simply hypocrisy! And you, you’re a pig!” Jiang Muye finally stopped pacing and stared at her. “Let’s just say under special circumstances a hero were to save the girl. If the girl is boring, she would certainly thank the hero for rescuing her and is willing to do favors to repay him but he wouldn’t be interested. If the girl is interesting, what would she say? Seriously Ning Xi what is the answer?!”</p><br/><p>Ning Xi touched her chin thoughtfully: “Well…..maybe she will say that she’s willing to pay him back with her body?</p><br/><p>“So now you know what ‘favors’ mean now no?! To you you’re doing labor, but he finds you fancy and interesting!” Jiang Muye shouted in her ear</p><br/><p>Ning Xi, her ears numbed by the shout replied quietly: ”When you put it that way, it kind of makes sense…..”</p><br/><p>Jiang Muye: “It’s the truth!”</p><br/><p>Ning Xi quickly stood up and grabbed Jiang Muye’s shoulder, forcing him to sit calmly on the sofa. “Since you asked me, I also have a question for you”</p><br/><p>Jiang Muye, looked at her vigilantly and said “What do you want to ask?”</p><br/><p>“If you walked into a room, and you see the girl you like on an aphrodisiac, wearing transparent lingerie, lying on a king size bed covered in red rose petals what would you do?</p><br/>\n</div>"}