{"title": "Chapter 211: Are you going to be with him (unedited)", "id": 211, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-211-are-you-going-to-be-with-him-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 211: Are you going to be with him (unedited)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Jiang Muye with his face slumped, quietly asked “Do you want to be with him?”</p><br/><p>“How could I!” Ning Xi give him a look, “I am aware of the difference between he and I .”</p><br/><p>Jiang Muye frowned, “That’s not what I mean. I’m not saying that you’re not good but rather Lu Ting Xiao is too dangerous. The Lu family environment is not good for you……”</p><br/><p>“Muye, thank you for looking out for me. But my own heart is clear.” Ning Xi interrupted him, her look completely back to normal. “Rest assured, I’m not being irrational just because of my heart. I know what I am doing, and what I should be focused on.”</p><br/><p>When Jiang Muye heard her say this, he was not the slightest bit happy. Instead, his chest felt like a soaked sponge, holes leaking with no plug in sight. “What do you look like? You are earnest in your efforts to progress, you know when to love and when to hate. You are only worthy of the best of the best!”</p><br/><p>Ning Xi was stunned for a moment, then gave him a surprised look. “I did not expect such golden, kind words from you. You’re not in love with me right?”</p><br/><p>Jiang Muye stiffened immediately, “You brat!”</p><br/><p>“Ha ha ha…” Ning Xi clutched her belly laughing, then turned and looked at him. “Jiang Muye, before you say anything. You and I know each other a lot right? I can only show you this side since we are such good friends and have known each other for a while.”</p><br/><p>When Ning Xi looked at him at that moment, Jiang Muye almost thought that she saw through his heart and specifically said those words to make him remind him to give up on her……</p><br/><p>………</p><br/><p>Lu House.</p><br/><p>Lu Ting Xiao is sitting on the living room couch, focused completely on the German book in his hand.</p><br/><p>In contrast, Lu Jingli was wandering around the house, ignoring the atmosphere.</p><br/><p>“Don’t you want to know what they talked about? I have a hunch! The content will certainly be the best! The relationship between you and a certain lady.”</p><br/><p>Lu Ting Xiao turned the page, note even sparing him a glance.</p><br/><p>“Hey brother, I blame you anyway. You’re too old fashioned, that’s why I wanted people to secretly bug them but you won’t let me! Now you can only stay at home and be anxious!” Lu Jingli complained</p><br/><p>Although from the current situation, the only one anxious is him.</p><br/><p>Finally, even Lu Ting Xiao’s patience cannot stand his noisiness: “Be quiet or go back.”</p><br/><p>“I won’t! I won’t go back!”</p><br/><p>He also wants to wait for the evenings gossip. Otherwise how can he sleep tonight!</p><br/><p>“It’s almost eleven o’clock, how come she’s not back?” Lu Jingli anxiously scratched his cheek. Just then, his cell phone rang displaying a strange number.</p><br/><p>So late, I wonder who’s calling me?” Lu Jingli grabbed his phone and went to the yard to answer it.</p><br/><p>Ten minutes later, Lu Jingli came flying into the living room, “You really just dozed off, should I get you a pillow! Brother, you won’t guess what I just got! Actually, this evening, somebody bugged Ning Xi and Jiang Muye’s booth. Some little puppy tried to send out the recording but fortunately, their boss had a filter that immediately stopped it, but also sent it to me as an offer to make amends.”</p><br/>\n</div>"}