{"title": "Chapter 219: I Feel Faint (unedited)", "id": 219, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-219-i-feel-faint-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 219: I Feel Faint (unedited)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Subsequently, Ning Xi slowly leaned forward until she was only a centimeter from Lu Ting Xiao’s lips then stopped.</p><br/><p>Well……</p><br/><p>To do it or not to do it……</p><br/><p>That is the problem</p><br/><p>“But when people come to my bed, can you blame me?”</p><br/><p>“Besides, the last time you bit me!”</p><br/><p>“I’m going. I’m really going to do this. I’m going to faint! I feel dizzy!”</p><br/><p>………</p><br/><p>Ning Xi argued with herself for a long time before laying back down.</p><br/><p>On the other hand, the stiff body beside her finally relaxed. At the same time, his heart is full of loss.</p><br/><p>This was basically a tease….</p><br/><p>However, in the next second, he had to release his arms as he was caught off guard. The girl next to him had moved suddenly, followed by two warm lips forcing themselves on his…..</p><br/><p>The terribly slippery tongue licking his lips , her teeth biting his lips, and even trying to pry his mouth open.</p><br/><p>The usually calm Lu Ting Xiao came close drowning in drool.</p><br/><p>The is not the feeling of a kiss but a poor reminder! He can only lay there and take it!</p><br/><p>This girl’s kiss is really poor, it’s a chaotic mashup of biting and licking, but it still set his belly on fire.</p><br/><p>Finally finished, Ning Xi wiped her mouth and lay back down satisfied.</p><br/><p>Whispering, “I didn’t faint! I didn’t faint! Such a good opportunity and I didn’t waste it! I can now leave this life with no regrets!”</p><br/><p>Hearing this, Lu Ting Xiao didn’t know whether to laugh or cry.</p><br/><p>Just a kiss and she could leave this life with no regrets? Your life goals are really too low! I want to give you more…….</p><br/><p>After kissing Lu Ting Xiao, Ning Xi couldn’t sleep even more so she grabbed her phone and browsed for entertainment news.</p><br/><p>As expected, Ning Xuelo had already issued a statement, putting all the responsibility on her assistant Cui Caijing, playing the role of a victim.</p><br/><p>But Golden Age Entertainment is not a vegetarian company. Especially in regard to manipulating the publics opinion, Ling Feixing runs a good show.</p><br/><p>With Ling Feixing handling matters, Ning Xuelo’s statement had little effect. Most people thought that Ning Xuelo is attempting to pass on the responsibility. For your assistant to plan such a fierce revenge plan just because you scolded her doesn’t really make any sense.</p><br/><p>Some people thought this happened because Ning Xuelo’s relationship with Jia Qingqing.</p><br/><p>Some people thought that since Ning Xi is prettier than her, she couldn’t take it.</p><br/><p>Some even guessed that the reason Su Yan visited the crew so much wasn’t to see Ning Xuelo, but to see Ning Xi instead! Ning Xuelo then had to take action and get rid of Ning Xi!……</p><br/><p>In short, Ning Xuelo’s carefully crafted image of being gently and generous was given a big blow. In addition, what the fans are most concerned about is the filming of “The World” drama and how Ning Xi’s issue would affect it.</p><br/><p>Golden Age had been dealing directly with the other side, so even Ning Xi didn’t know the exact answer. She would have to call and ask Lin Zhizhi tomorrow!</p><br/><p>After reading all the entertainment news, Ning Xi landed on her microblog and accidently found out that her fans had increased. Also, there were a lot of comments encouraging and comforting her.</p><br/><p>Ning Xi thought for a moment, then created a post.</p><br/>\n</div>"}