{"title": "Chapter 210: I Am Tempted By Him (unedited)", "id": 210, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-210-i-am-tempted-by-him-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 210: I Am Tempted By Him (unedited)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Jiang Muye was quiet for 3 seconds, then his face burning like a child shoved her “Ning Xi, why is your mind so dirty!”</p><br/><p>“You! Pretending to be innocent! Give my aging mother/I your father an answer!”</p><br/><p>“Why did you ask me this question?” Jiang Muye asked avoiding her eyes. He did not dare to say that he is imagining Ning Xi in the moment she described……</p><br/><p>“You answer me first!” Ning Xi urged</p><br/><p>Jiang Muye stared blankly for a long time, then hesitatingly answered, “When,…of course I’ll do her. Am I not a man? Or is it that I don’t like that woman!”</p><br/><p>Hearing the expected answer, Ning Xi smiled faintly at him</p><br/><p>“Don’t look at me like that. Was I wrong?” Jiang Muye looked frightened at her expression</p><br/><p>“You are right”</p><br/><p>“Now, can you tell me why you asked me this question?”</p><br/><p>Ning Xi, her chin in hand looked down as if in a trance and began, “You know this situation happened to Lu Ting Xiao”</p><br/><p>Jiang Muye’s expression is suddenly downcast “Lu Ting Xiao experience this situation? What do you mean by that!”</p><br/><p>Ning Xi began the explanation of what happened during his welcome party, “….and then later Zhu Xiangcheng grabbed me and tied me to a bed as Lu Ting Xiao’s present!”</p><br/><p>“……What did Lu Ting Xiao do?” Jiang Muye asked nervously</p><br/><p>“He didn’t do anything” Ning Xi recalled that night. “He comforted me when I was afraid, and chatted with me to distract my attention. From start to finish without making any disturbing moves, he quietly helped me deal with his life most helplessly tough night.</p><br/><p>Jiang Muye listening, bit his lips but couldn’t say a word.</p><br/><p>Ning Xi decided to look at him, “So you think Lu Ting Xiao is what kind of person. Can it be that he’s not a man or that he doesn’t like me?”</p><br/><p>Jiang Muye tightly clenched his fist, “I’m sure he likes you!” And for Lu Ting Xiao to do so, he not only feels like a man, but can act like a true one too…If he’s like this then he (Jiang Muye) absolutely can’t…</p><br/><p>“I wasn’t sure before, but now that I’ve determined that he likes he, there is a third possibility.”</p><br/><p>Jiang Muye immediately looked at her: “What?”</p><br/><p>“It’s not because I’m stupid, but his grade is too high. In fact, unsurprisingly, I’m tempted by him……” Ning Xi finished, her brows furrowed.</p><br/><p>Jiang Muye, in a trembling voice, barely able to complete the sentence: “You’re…….tempted by him?”</p><br/><p>Ning Xi simply smiled: “Although I don’t want to admit it, it’s true.”</p><br/><p>Jiang Muye thought bitterly, how much do you really know about him?</p><br/><p>You only see what he lets you see and everything else is disguised! You really think that Lu Ting Xiao is completely a gentleman? Do you know that Jia Qingqing died in the wilderness? ? Do you know that Zhu Xiangcheng, that pigs fate? Do you know just to destroy him for harming you, he dispatched aircrafts to cause artificial rain, which caused an accident? Even my families suddenly accident … ”</p><br/><p>Ning Xi was quiet for a long time, then spoke up “Jiang Muye, he has never done a thing to hurt me. If I fear him because of those who fear him or wronged him, that’s not fair to him. You can say that I’m right or I’m wrong I don’t know about life and death. I only know that he’s good to me. No one like him has been very good to me.”</p><br/>\n</div>"}