{"title": "Chapter 214: Feels Finished (unedited)", "id": 214, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-214-feels-finished-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 214: Feels Finished (unedited)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Finally, they arrived at ward 307.</p><br/><p>Ning Xi, panting heavily was just about to push open the door when Lu Jingli who couldn’t wait anymore shoved it open.</p><br/><p>A second later, Ning Xi who hadn’t seen who was inside was suddenly grabbed by the shoulders, was turned around and pushed out by Lu Jingli.</p><br/><p>“Ning Xi, let’s leave…….I can’t believe that the person I was looking forward to seeing is that good for nothing trash! Let him die! ”</p><br/><p>“In the end, who is it that cause you to have this type of reaction? ”</p><br/><p>“Ignore it. You will definitely not regret it!”</p><br/><p>“Is it Su Yan?” Ning Xi asked, eyebrows raised</p><br/><p>Lu Jingli agreed with a blank face, “Yes. Now you can go!”</p><br/><p>“I’m not leaving!” Ning Xi removed Lu Jingli’s hand, turned and walked back toward the ward.</p><br/><p>Lu Jingli anxiously stomped, “Little XiXi, don’t fall into his trap! You you you … … Do you still love him?”</p><br/><p>Ning Xi didn’t pay attention to him, and went directly into the ward.</p><br/><p>Inside, it really is Su Yan, his head is wrapped around with gauze, his hands by his side as he lays quietly on the bed.</p><br/><p>Ning Xi gently sits down on the bed, hand bushing his messy hair, looking gentle, her tone even gentler, “Yan brother … …”</p><br/><p>Lu Jing Li: “… …”</p><br/><p>What is he seeing! What is he hearing!</p><br/><p>Ning Xi can’t still be hung up on this scum, right?</p><br/><p>Fortunately, his brother did not come up, or he would be driven mad!</p><br/><p>As soon as Lu Jingli thought that, he suddenly felt a burst of chill behind him. He then turned to see … …</p><br/><p>His brother actually stood behind him!!</p><br/><p>“Brother … … brother … … how come you’re here?”</p><br/><p>All three people had arrived; Little Treasure was in his arms, while Jiang Muye was behind him.</p><br/><p>With his brains, Lu Jingli was able to immediately guess that Little Treasure wanted to come up, and him brother immediately brought him. Jiang Muye naturally can’t bear to lose, so he came up as well.</p><br/><p>This……this is bad!Top of Form</p><br/><p>On the bed, Su Yan’s pale face frowned, then his eyes slowly opened.</p><br/><p>“Ning Xi………”</p><br/><p>“How do you feel?” Ning Xi asked</p><br/><p>Su Yan looked nervously at the girl in front of him, “Am I dreaming?”</p><br/><p>Each time he met with her, it always ended with some type of cynical argument. He couldn’t remember the last time she looked so agreeable while speaking to him.</p><br/><p>Just as he woke up, he could still catch the hint of worry and concern in her eyes, and had even heard her call him Yan brother……</p><br/><p>Ning Xi now stood by the bed, her demeanor back to being cold. “You just finished surgery, the doctors said that there is no serious issue, but you have a concussion. They also need to observe you for some time. If there’s nothing else, then I’ll leave first… …”</p><br/><p>Finished with what she had to say, she turned to leave but her wrist was grabbed.</p><br/><p>“Ning Xi, don’t go……”</p><br/><p>“Is there something I can do for you?”</p><br/><p>“I……” Su Yan took a deep breath and looked at her, “I know that you don’t care, but I’s sorry……I still want you to know that I’m sorry. I misunderstood you! Do you know? When I thought I would die, I thought of nothing else but you! My only regret was that I didn’t get a chance to apologize to you……”</p><br/><p>Outside the door, Lu Jingli who is watching Ning Xi like a hawk saw Su Yan grab her wrist. Trembling, he swallowed and turned to look at Lu Ting Xiao’s expression. Surprisingly, it’s really not terrible……</p><br/><p>Ning Xi, what is going on?</p><br/>\n</div>"}