{"title": "Chapter 213: I Choose Lu Jingli! (Unedited)", "id": 213, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-213-i-choose-lu-jingli-unedited", "volume_title": "Volume 3", "body": "<h1>Chapter 213: I Choose Lu Jingli! (Unedited)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lu Jingli too, since he volunteered to drive them.</p><br/><p>Jiang Muye looked at all these people who shamelessly decided to come along, then shoved himself in the car to go too.</p><br/><p>The end result is that everyone ended up going………</p><br/><p>Ning Xi is silent.</p><br/><p>At the hospital, they saw several ambulances parked by the door, and many doctors and nurses were busily rushing back and forth with stretchers full of badly injured patients; it seems that there was a major traffic accident.</p><br/><p>Ning Xi covered Little Treasure’s eyes so he wouldn’t see these bloody things, and softly coaxed him, “Darling, this time the hospital is chaos, wait obediently for me in the car, okay?”</p><br/><p>Little Treasure still holding her waist, who was abandoned gave her a pitiful expression, he was obviously sleepy and had dozed off, and still insisted on not wanting to sleep.</p><br/><p>Ning Xi leaned over and kissed his little face, “Little Treasure is so good, so well-behaved and obedient ah! I’ll be right back!” This kiss restored Little Treasure and he nodded his head.</p><br/><p>“Then I’ll leave first!” Ning XI said heading out</p><br/><p>Lu Ting Xiao: “I’ll accompany you.”</p><br/><p>Jiang Muye: “”I’m coming along!”</p><br/><p>They both said it at the same time</p><br/><p>Ning Xi “………”</p><br/><p>“You’re a dangerous person to be with.” Lu Ting Xiao said with a frown</p><br/><p>Jiang Muye grunted confidently, “I was curious to see who is more dangerous in the end”</p><br/><p>Ning Xi just felt her headache growing looking at Lu Ting Xiao and Jiang Muye. Finally her eyes landed upon Lu Jingli.</p><br/><p>Lu Jingli blinked back innocently, wondering what his sister-in-law wanted.</p><br/><p>Finally, Ning Xi began “I don’t know what the situation in there is. It’s definitely less trouble if the two of you don’t accompany me. Lu Ting Xiao, you…stay with Little Treasure!” Lu Ting Xiao’s eyes narrowed slightly.</p><br/><p>“As for you Jiang Muye, youre giving me a headache! Don’t you know your face can stir up a lot of trouble? Showing up to the hospital at night! You want to create a troublesome news story? ”</p><br/><p>Jiang Makino looked at her angrily. Why was she so hard on him, but so gentle with Lu Ting Xiao!</p><br/><p>“Lets go, lets go. Ning Xi, I’ll go with you!” Lu Jingli said excitedly, about to leap into the streets. He was quite happy. This was really when two dogs fight, the third gets the bone kind of situation.</p><br/><p>………</p><br/><p>Hospital emergency room.</p><br/><p>The inside of the hospital was a crowded mess. It took a long time before Ning Xi finally found the doctor that called her.</p><br/><p>“Hello, I’m Ning Xi. Where did you say my friend is?”</p><br/><p>“You are Ning Xi? He just finished surgeru and is on the 12th floor in ward 307. If you could go recognize his body, as he doesn’t have any proof of identity on him!”</p><br/><p>“Yes, thank you!</p><br/><p>So Ning Xi and Lu Jingli rushed upstairs. The elevators were crowded so they had to take the full 12 flights of stairs. The pain!</p><br/><p>Ning Xi is tired, but Lu Jingli is still very excited like a child. She finally understood why Lu Jingli can be so successful in the entertainment business. His lust for gossip is really second to none!</p><br/>\n</div>"}