{"title": "Chapter 227: I Miss You So Much", "id": 227, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-227-i-miss-you-so-much", "volume_title": "Volume 3", "body": "<h1>Chapter 227: I Miss You So Much</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Shout out to Eleanor Woodall and Park TaeJoon for their donations!</p><br/><p>Now for a skit</p><br/><p>LTX: I’ve gathered you all here to tell you the plan of seducing my wife</p><br/><p>Lu family servants and the BAT Team staring attentively.</p><br/><p>LTX: to the drivers and bodyguards. Make sure to always swerve the car so she falls on me!</p><br/><p>LTX: Servants, let me know when she wants food I shall personally deliver it! Use Little Treasure to bribe her!</p><br/><p>LTX turns and glares towards the BAT Team.</p><br/><p>LTX: I could have sworn I told you guys to get rid of Jiang Muye, yet he took my future wife on a picnic with my son and tried to brag? Death!</p><br/><p>BAT team members scream from the torture. Akari(our new translator) watches from the sidelines wondering if she made the right decision.</p><br/><p>Enjoy the chapter!</p><br/><p>——————————————————————————–</p><br/><p>After returning home that night, Ning Xi continued to use the excuse of trying to lose weight to avoid dinner.</p><br/><p>These days, she’s really grateful that the little bun is gaining weight, so it is a valid reason!</p><br/><p>After a long time, someone knocked on her door and from the footsteps, she knows its not Lu Ting Xiao.</p><br/><p>Ning Xi fresh out of the bath, opened the door while wiping her hair.</p><br/><p>The servant was standing respectfully outside her door carrying a food tray. When she saw Ning Xi’s appearance after showering, she was stunned momentarily.</p><br/><p>In front of her is a girl so beautiful, with her skin rosy after the shower. She looks very attractive, and even a woman couldn’t help but feel her heart throb. It was no wonder the young master……</p><br/><p>The servant quickly recovered and shook his head saying, “Miss Ning Xi, the young master told me to send up some food. Although the body’s image is important, you cannot go hungry. Here are some low calorie food. Eating a little won’t matter!”</p><br/><p>“Yes, thank you!” Looking at the cute little maid, Ning Xi nervousness eased a lot and she said, “Wan Wan, your hairstyle is really cute. It really suits you!”</p><br/><p>“Thank you very much Miss Xi!” The servant happily touched her hair, then hesitantly began, “Miss Xi, you are a really good person! In fact, I think you are especially good with the young master. If you become his mother, we will support you. Otherwise, if we end up with some other scheming woman, we will become miserable!”</p><br/><p>Ning Xi: “Uh……”</p><br/><p>Why are even the maids beginning to assist?</p><br/><p>Leave me alone!</p><br/><p>There came another knock on the door and it was Wan Wan who gave her a cup of milk.</p><br/><p>A knock sounded for the third time. Ning Xi was sitting on the balcony drying her hair and thought it was Wan Wan so she just invited her in.</p><br/><p>As a result, the footsteps are getting closer and Ning Xi senses something is wrong.</p><br/><p>As she turned, sure enough it was Lu Ting Xiao standing close to her face……</p><br/><p>Ning Xi subconsciously clenched the railing, “Is something wrong?</p><br/><p>Lu Ting Xiao did not answer, but quietly stood in front of her while staring.</p><br/><p>The girl in front of him is wearing an ankle length skirt and pajama that is tight in the right places. Her hair is slightly damp, fluttering gently in the night breeze, and he cheeks are slightly flushed and damp. Her smart eyes flash with a trance of fear and preparedness……</p><br/><p>Ning Xi was staring at him numb until Lu Ting Xiao finally spoke, “Ning Xi … …”</p><br/><p>Ning Xi: “Yes … … ”</p><br/><p>Lu Ting Xiao:” I miss you. ”</p><br/><p>Ning Xi suddenly staring at him, almost believing that she was having an auditory hallucination,</p><br/><p>“Haha … … … … what … … ”</p><br/><p>Lu Ting Xiao’s hand gently picked up a strand of her and tucked it behind her ear.</p><br/><p>In a cold tone, he answered, “It’s been a long time since I’ve seen you……”</p><br/><p>It’s obviously only been two days okay?</p><br/><p>Ah, this is not the time for that! Focus!</p><br/><p>The focus is that Lu Ting Xiao has been thinking about her? He then said it directly to her? This isn’t the right development of ah!</p><br/><p>She must definitely be dreaming, right? She definitely is!</p><br/><p>However, instead of listening to the excuses for her behavior, Lu Ting Xiao stepped forward, one hand circling her waist. At the same time, his other hand also rose and hugged her. He leaned, with a very tired and loving gesture, and gently buried his face in her neck.</p><br/><p>Ning Xi: “!!!”</p><br/>\n</div>"}