{"title": "Chapter 238: She Is Very Good", "id": 238, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-238-she-is-very-good", "volume_title": "Volume 3", "body": "<h1>Chapter 238: She Is Very Good</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 238 – She Is Very Good</p><br/><p>Posted at 7:27 am by blazaria, on June 28, 2017</p><br/><p>Thanks to everyone who took the poll!</p><br/><p>HM – daily releases Mon-Fri with sponsored chapters on Saturday and Sunday</p><br/><p>Sonata – released once a week until we get more chapters stock piled or get another translator on board.</p><br/><p>Third Novel: TBA</p><br/><p>Have a lovely Wednesday/Thursday everyone!</p><br/><p>P.S. Come by our discord *shameless plug*, We are pretty cool, non-weird 🙂 people</p><br/><p>The Lu family house is located halfway up the hill, occupying a huge plot of mountain. From the main entrance to the house requires about a 20 minutes walk. Both sides are covered with lush trees, and the scenery is very beautiful.</p><br/><p>This place is said to contain a dragon vessel, the city’s most valuable feng shui place.</p><br/><p>All thanks to Little Treasure’s blessing, she gets to be exposed to this!</p><br/><p>Looking through the car’s window, Ning Xi sees the Lu elders are already standing at the door, faces full of anticipation, just like normal family elders that dote a lot on their grandson.</p><br/><p>Ning Xi pats the Little Bun that is in her arms, “Go on! Don’t forget what Aunty told you, good luck-o!”</p><br/><p>Looking at Ning Xi’s eyes full of encouragement and anticipation, the Little Bun firmly nodded. His hands were held by Lu Ting Xiao down the driveway and he keeps turning back every step he takes.</p><br/><p>After seeing their treasured grandson, the Lu elders face are full of surprise as they hurriedly welcome him.</p><br/><p>Madam Lu is so excited that her eyes start tearing up, with a frown , she grumbled at her oldest son standing beside her, “You brat, all because of you, we have to endure not seeing our Little Treasure! You still haven’t wooed our daughter-in-law!”</p><br/><p>Lu Ting Xiao cleared his throat, signalling to them that the car behind has someone inside, and at this distance, it is possible that Ning Xi can hear……</p><br/><p>In fact, Ning Xi is indeed able to hear.</p><br/><p>Taking advantage of the fact that those standing outside the car are unable to see the people inside the car, Ning Xi pressed her ears against the windows to eavesdrop what they are talking about. Right then she heard what Madam Lu has just said……</p><br/><p>Madam Lu immediately become excited, “Ai-ya! My Daughter-in-law has come? Let her out of the car for us to see!”</p><br/><p>“Mom……” Lu Ting Xiao helplessly said, “She is shy, don’t scare her.”</p><br/><p>Ning Xi nod her head continues, yes yes yes, I am shy, please do not ask me to come out!</p><br/><p>Fortunately, Master Lu said a sentence that diverted everyone’s attention.</p><br/><p>“What is Little Treasure writing?” Master Lu ask questioningly.</p><br/><p>After hearing what her husband said, Madam Lu also notices Little Treasure currently burying his head writing something.</p><br/><p>A short moment later, Little Treasure raised his whiteboard, and look at his grandpa and grandma with his big sparkling black eyes.</p><br/><p>As for what was written on the whiteboard—-</p><br/><p>[Grandpa, grandma, Little Treasure misses you two a lot!]</p><br/><p>Master Lu and Madam Lu looked at each other after looking clearly at the words on the whiteboard, both of their faces full of surprise, subsequently both of their eyes start turning red.</p><br/><p>Madam Lu in disbelief look at her husband, “D-did I see wrongly? Little Treasure called me grandma!”</p><br/><p>Even though this is not really considered ‘called’, but at least this is the first time Little Treasure is addressing her as grandma!</p><br/><p>He who once ignored them and even rejected them……</p><br/><p>“And also grandpa!” Master Lu added seriously, yet pridefully.</p><br/><p>“He also said that he misses us a lot……” Madam Lu could not bear it anymore, she hugged Little Treasure and started crying, “Grandma’s darling! Do you know how happy grandma is?”</p><br/><p>Master Lu sighed, then look at his eldest son, face full of seriousness and said: “Ting Xiao, the person you like, is very good. She teaches Little Treasure well.”</p><br/><p>He knows that Little Treasure has become more open, more willing to go out, but little did he know that Little Treasure has improved this much!”</p><br/><p>This is indeed shocking!</p><br/><p>“Tell me about it! His appetite has also become better, look at my grandson, he’s fatter now! He is fatter than he was in the photo previously!” Madam Lu is simply delighted.</p><br/><p>“En, she is very good.”</p><br/><p>Master Lu pat his shoulders, earnestly said: “Boy, good luck! The best naturally requires the most effort, we will support you unconditionally!”</p><br/>\n</div>"}