{"title": "Chapter 237: Sending Little Treasure Over", "id": 237, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-237-sending-little-treasure-over", "volume_title": "Volume 3", "body": "<h1>Chapter 237: Sending Little Treasure Over</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 237 – Sending Little Treasure Over</p><br/><p>Posted at 10:06 am by blazaria, on June 27, 2017</p><br/><p>We have caught up to the summaries yay! We are now switching to daily chapter releases for HM with 2 sponsored chapters for every $20 patreon we receive. You’ve already earned sponsored chapters for this week.</p><br/><p>Thanks to this weeks donators: Yvonne Tan, Serieri, Agnieszka Kosiba, Heidi Wilde, Park TaeJoon, Eleanor woodall, ETia, Cia, Simone Blackwood, Beadgirl, and VioletKunoichi!</p><br/><p>Enjoy!</p><br/><p>One morning, Ning Xi heads downstairs and sees a moment that has not been seen for a long time.</p><br/><p>Little Bun and Big Bun were sitting at the dining table, facing each other; one iceberg face, and one little iceberg face, making the atmosphere full of tension.</p><br/><p>What is this situation?</p><br/><p>It has been a long time since this pair of father-son quarrelled.</p><br/><p>“What’s the matter with both of you?” Ning Xi asked doubtfully.</p><br/><p>Hearing Ning Xi’s voice, Little Bun looked as if he was seeing his saviour and immediately hugged her leg with an expression as if Lu Ting Xiao was about to sell him away……</p><br/><p>Ning Xi comforts Little Treasure for a while, then turn towards Lu Ting Xiao, “Lu Ting Xiao, what happened?”</p><br/><p>Lu Ting Xiao lifted his eyes and said: “I was getting ready to send him to my parents’ house to stay for a few days. The elders have not seen him for very long. They missed him a lot.”</p><br/><p>“So it was like this!” Ning Xi nodded her head as she knew.</p><br/><p>Seeing this, the little bun starts to panic, his big eyes quickly becoming watery.</p><br/><p>Thus, Ning Xi’s heart instantly softens. she rubs her head as she looks at Lu Ting Xiao, “This… isn’t there any other way?”</p><br/><p>Lu Ting Xiao gave her a glance, “Yes, let my parents come over for a few days.”</p><br/><p>“Uh, let’s just send Little Treasure over instead!” Ning Xi determinedly said.</p><br/><p>Sorry Little Bun, it’s against Aunty’s will too……</p><br/><p>The Little Bun instantly suffered a blow, with an expression of ‘dad doesn’t dote on me, mom doesn’t love me’ on his small face, he toddled up the stairs into his room……”</p><br/><p>“Uh……” Ning Xiao dryly laughed, “That…, I’ll go and persuade him!”</p><br/><p>“En.”</p><br/><p>Upstairs, Ning Xi knocked Little Bun’s room door.</p><br/><p>“Little Treasure, open the door for Aunty ok?”</p><br/><p>There is no response from the room.</p><br/><p>“Are you really going to ignore me?”</p><br/><p>There is still no response from the room.</p><br/><p>Looks like he is really angry!</p><br/><p>Ning Xi sighed. Left without a choice, she could only go back downstairs and head outside.</p><br/><p>Seeing as such, Lu Ting Xiao said without lifting his head up, “Don’t climb up with bare-hands. Ask the butler to prepare a ladder for you.”</p><br/><p>When Ning Xi heard what he said, she staggered and almost fell. Is this fellow a worm that resides in her stomach? How did he know that she was about to climb the window to go inside?</p><br/><p>How hateful……</p><br/><p>These days, she found that Lu Ting Xiao understands her more and more. Many times with just a little movement or expression, he will know what she is thinking about and would do in the next second.</p><br/><p>Five minutes later, Ning Xi has climbed the ladder and smoothly got into Little Treasure’s room.</p><br/><p>Once the little guy sees her, with watery eyes, he threw himself into her arms, his small face full of grievance.</p><br/><p>Just now when there was no longer any response from outside his room, he thought that Ning Xi really did not want him anymore.</p><br/><p>Ning Xi felt her heartache as she hugs the Little Bun, “Baby, Aunty will always be standing at your side, but just this time, Aunty really feel that you should go. Think about it, your grandpa and grandma have only one treasured grandson which is you, they clearly like you a lot, yet to accommodate you, they do not even dare to visit you……”</p><br/><p>Little Treasure dropped his head, a moment later, he took up his whiteboard and wrote: Together.</p><br/><p>What he meant was for Ning Xi to go together with him.</p><br/><p>Ning Xi awkwardly coughed, “This is not possible……”</p><br/><p>How can she possibly meet Lu Ting Xiao’s parents at this time!</p><br/><p>“Aunty is about to start working soon, so I will not have time to do so!” Ning Xi found a good excuse, then hurriedly pacify him, “But Aunty can accompany you and your dad to send you over! Be well-behaved! Little Treasure is already a 5 year old big boy. The progress made in this period is very huge. You’re becoming more and more clever and smart, this little thing you are surely able to do it, right?</p><br/><p>Ning Xi held Little Bun, gave him kisses, coaxing him with a gentle voice for half an hour, before the little guy finally gave in.</p><br/>\n</div>"}