{"title": "Chapter 249: Beauty Is Dangerous", "id": 249, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-249-beauty-is-dangerous", "volume_title": "Volume 3", "body": "<h1>Chapter 249: Beauty Is Dangerous</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 249 – Beauty Is Dangerous (Sponsored)</p><br/><p>Posted at 9:54 am by blazaria, on July 9, 2017</p><br/><p>It is our 1 month anniversary yay!!</p><br/><p>I can’t believe that I’ve only been doing this for a month.</p><br/><p>Thanks to the awesome teammates that I’ve found Akari and cfadmode! You guys are awesome! Thanks for your hard work!</p><br/><p>Translator: Akari, Blaze</p><br/><p>Editor: cfadmode</p><br/><p>Ning Xi shook her head, and quickly ended this dangerous yet ambiguous topic of ‘teacher’ and ‘student’. She then switched to her employee mode, raised one of her hands and said–––</p><br/><p>“Boss, I would like to apply for a period of time to think without interference!”</p><br/><p>Lu Ting Xiao paused to think for a moment then agreed: “It can be approved, but how many days?”</p><br/><p>Ning Xi weakly asked: “Uh, can it be in years?”</p><br/><p>“I’ll give you seven days.” Lu Ting Xiao ignored her unreasonable demands, and made the decision.</p><br/><p>“Alright……seven days! After I get discharged tomorrow, can I stay in my own apartment for this period of time? You just agreed no interference! Little Treasure is not at home recently too, and I have to go to the office the day after, it is closer from my apartment!” Ning Xi tried her best to elaborate her reasons.</p><br/><p>“You can.” Lu Ting Xiao nodded without hesitation.</p><br/><p>“……” Ah, so easy? She was not used to it, the fact that he suddenly stop taking advantage of her.</p><br/><p>Ning Xi squinted her eyes, and had a little fox’s expression. Seemed like she had found an effective method to use against the big devil! Gain the upperhand by enduring bodily suffering?</p><br/><p>Wasn’t the reason why he let her off because the doctor said not to let her feel too much stress?</p><br/><p>Sigh, but it was also because he cared? That is why this method was so effective.</p><br/><p>When her thoughts reached here, the numerical value in her heart rapidly increased to eighty percent!!!</p><br/><p>……</p><br/><p>The second day.</p><br/><p>Luckily Ning Xi’s situation was not serious, hence she was smoothly discharged that morning.</p><br/><p>In accordance to the agreement, Lu Ting Xiao sent her to her apartment. On the way there, he went to supermarket and helped her fill up her refrigerator. He also ordered takeaways for her daily three meals, and repeatedly told her to take it easy and be careful about her diet.</p><br/><p>Ning Xi sat on the sofa and watched Lu Ting Xiao being busy. After checking the refrigerator, he was still standing there thinking of what he had missed out, so she could not withstand it anymore and coughed, “Lu Ting Xiao, you don’t have to busy yourself anymore. I can take care of myself.”</p><br/><p>Lu Ting Xiao turned and walk towards her, “I’ll be going then.”</p><br/><p>Even though he said that, but his face was still full of worries. It was as if she was a three year old kid who does not have the ability to take care of herself.</p><br/><p>Ning Xi tried her best to stabilize the numerical value in her heart: “En.”</p><br/><p>“Is your body really fully recovered?”</p><br/><p>“Yes yes, my stomach does not hurt anymore! My body has fast recovering abilities!”</p><br/><p>“En, this is a good trait.” Lu Ting Xiao nodded his head in satisfaction.</p><br/><p>Ning Xi: “……” even though his words have nothing wrong, but why does she feel that she had been flirted with?</p><br/><p>Right when she was in a dazed state, Lu Ting Xiao leaned towards her. But before he was near her, he stood up and retreated, then pat her head, “No interference.”</p><br/><p>Ning Xi: “……”</p><br/><p>You! Have! Already! Interfered!!!</p><br/><p>She at last understood, that even if this guy does not do anything, just his presence is a kind of interference.</p><br/><p>After sending Lu Ting Xiao away, Ning Xi finally became relaxed. She hugged a pillow and dazed out on her sofa, thought back on the things that had happened these few days……</p><br/><p>In the end, she had still walked into this stage. Even though she long had a hunch, and had prepared early, but when it really happened, her mind went blank. She was completely thrown into confusion.</p><br/><p>This performance, she gives herself zero points!</p><br/><p>In fact, she intended to deliberately say some harsh words to make Lu Ting Xiao give up, but when she was facing him, she could not say a word. Instead, her originally firm heart became more and more shaken. She was currently slowly considering changing it; the thing that she had originally believed will never</p><br/><p>ever happen.</p><br/><p>No wonder there were so many fatuous and self-indulgent ruler in the past!</p><br/><p>Beauty is dangerous ah!</p><br/><p>(T/N Akari: previously, honey trap [] was used, which directly translates to ‘beauty trap’, and the last sentence of this chapter which is also the title, in chinese is [] which directly means ‘beauty is dangerous’–––now you get why NX said that?)</p><br/>\n</div>"}