{"title": "Chapter 250: Initial Confrontation", "id": 250, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-250-initial-confrontation", "volume_title": "Volume 3", "body": "<h1>Chapter 250: Initial Confrontation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 250 – Initial Confrontation</p><br/><p>Posted at 8:09 am by blazaria, on July 10, 2017</p><br/><p>Translator: Akari, Blaze</p><br/><p>Editor: cfadmode</p><br/><p>The next morning, at Golden Age Entertainment inside Lin Zhizhi’s office.</p><br/><p>“Sister Zhizhi, I’m not late, right?” Ning Xi rested the entire day in her apartment yesterday, so her body was almost fully recovered. However, her face still looked slightly haggard, thus she wore a dress that had contrasting colours which were boldly matched to brighten up the tone of her skin and made her look youthful, full of vitality and fashionable.</p><br/><p>In front of the office desk, Lin Zhizhi was the same as usual. Her hair was meticulously tied into a neat bun. She wore a cool coloured blazer and pencil skirt, and was currently dealing with some documents. Seeing that Ning Xi had came, she first glanced up and studied her, then lifted her head and said, “You don’t have to be nervous, the reason I asked you to be here today is nothing important. I just wanted to show you around the company before you officially start work tomorrow. Even though the amount of time you will spend here isn’t much, you should at least get to know the basic structure of the company’s departments.”</p><br/><p>“Alright, thank you Sister Zhizhi!”</p><br/><p>“Let’s go.”</p><br/><p>Ning Xi nodded and followed her.Lin Zhizhi gave her a thorough tour. They went to the different departments, and was introduced to her new colleagues.</p><br/><p>No matter what everyone have in their minds, on the surface, they were really polite.</p><br/><p>Everyone understood in their hearts that this was just a gamble between the two companies; Golden Age and Starlight, and that Ning Xi was just a pawn used by the company to affect Starlight. But it was an indisputable fact that the company was ready to use their resources to make Ning Xi famous, thus no one would look for trouble with Ning Xi, who was in the limelight.</p><br/><p>“Tsk, this Ning Xi looks better than in photographs. No wonder Second Young Master settled on her at first sight!”</p><br/><p>“I have a hunch, that as long as her EQ is not too low, she will definitely become famous!”</p><br/><p>“That might not be true! It was not easy for Leng Manyun to live, you think there’ll be people who’ll allow her to become famous? Is she even compatible with Lin Zhizhi? Doesn’t Lin Zhizhi hates those female artists who dress seductively and rely on showing off their beauty to climb up?”</p><br/><p>……</p><br/><p>Since the company was quite big, Ning Xi followed Lin Zhizhi around for more than an hour before the tour finally finished.</p><br/><p>When the two of them were preparing to go view some of the company’s shooting venues and recording studios, they unexpectedly ran into a person at the corridor.</p><br/><p>“Oh! Isn’t this our big-shot Agent Lin? You finally came back? I thought you were so devastated that you were ready to retire!” The woman who was speaking looked to be in her thirties wearing provocative clothing. She had long wavy hair, striking makeup, and was dressed glamorously more than any star.</p><br/><p>Because she had often appear in newspapers and magazines, and she had seen her at filming locations a few times, Ning Xi recognized her, she was Su Yi Mo’s agent, Zhao Meixin.</p><br/><p>Even with Zhao Meixin’s goading words, Lin Zhizhi’s brows did not wrinkle any bit. In a bland tone, she said “With Sister Meixin still hard at work, us young people can naturally not fall behind.” (get her some ice for that burn XD)</p><br/><p>“You……” Zhao Meixin’s expression was tumultuous.</p><br/><p>At the side, Ning Xi was fighting to hold back her laughter. In her heart she thought, that although Lin Zhizhi looked stern and old fashioned, she would have never expected that she had such a poisonous tongue ah!</p><br/><p>Zhao Meixin gritted her teeth, and sneered, “Lin Zhizhi, although there was once that I did not think highly of you, and afterwards I have to admit that you did have a bit of skill, seeing that you could bring the pretty mediocre Leng Manyun to such heights. But now……”</p><br/><p>Zhao Meixin deliberately paused and gave Ning Xi a condescending look––– “After Leng Manyun left, you went to find such a good for nothing who is only good for gossip and her appearance? I remember that you used to hate these type of artists who only use their faces. What? Have you fallen that low now?”</p><br/>\n</div>"}