{"title": "Chapter 256: I Am Your Man", "id": 256, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-256-i-am-your-man", "volume_title": "Volume 3", "body": "<h1>Chapter 256: I Am Your Man</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 256 – I Am Your Man (Sponsored)</p><br/><p>Posted by blazaria</p><br/><p>So I’ve been trying to fix the way the links are and after various hours, plug ins, and tutorials it is still not done. I gave in and emailed WP to help out so hopefully they reply within a couple of days and get it done. Until then please bear with me.</p><br/><p>Jiang Muye slept all the way till filming started. Even when his makeup was being applied, his eyes were closed.</p><br/><p>He was still sleeping, when Director Guo told everyone to take their positions. Ning Xi could not withstand it anymore and kicked his chair.</p><br/><p>Jiang Muye then slowly sobered up.</p><br/><p>Today, they are going to film a fighting scene on the battlefield.</p><br/><p>After Meng Changge’s brother was forced to death by the emperor and Consort Xian, little overlord Meng Changge matured overnight. She put on her armour, went onto the battlefield, and began her endless military career.</p><br/><p>The general’s mansion undergone a big change, Chang’an City no longer had a little overlord.</p><br/><p>After Meng Changge left, Sun Huanqing finally realized his feelings. He followed Meng Changge onto the battlefield, and became a military doctor.</p><br/><p>The filming sequence is usually according to the location of the scenes, rather than the storyline. Thus in today’s shoot, the story fast forwarded to seven years later. Meng Changge attained numerous battle achievements, and did even better than her father and brother.</p><br/><p>Because of the treacherous court officials and Consort Xian’s incitation, the foolish emperor started to fear Meng Changge. And in order to control her, he asked her to hand over her military authorities, and marry the useless twelfth prince.</p><br/><p>Meng Changge naturally refused to submit even to death.</p><br/><p>Thus, during one of the wars, she encountered the same misfortune as her brother. She did not get defeated by the enemies, but by herself.</p><br/><p>The enemies were near, yet they did not have enough food and forage, and reinforcements were not coming. They were suddenly left in a hopeless situation……</p><br/><p>Finally, at the last battle of life and death.</p><br/><p>Inside the studio, all of the workers were at their positions, and the journalists arrived one after another.</p><br/><p>No one was more nervous than the director, Guo Qisheng. This time, if they encounter any problem again, he would really want to bang his head to death!</p><br/><p>Of course, he was not worried for Ning Xi. However, when filming was about to start just now, Jiang Muye was still sleeping. His condition did not look too good, which made him really worried ah! Sigh!</p><br/><p>“Okay! Get ready everybody! Action–––”</p><br/><p>A few seconds ago, Ning Xi was still discussing with Xiao Tao on what to have for lunch. But right at the moment Guo Qisheng shouted action, her expression immediately changed.</p><br/><p>The battlefield was filled with corpses, and her allies was only left with less than a hundred. Meng Changge’s body was covered with blood, and her eyes red with bloodshot. She had a murderous look, and was like a walking lethal weapon, killing anyone who was in her way.</p><br/><p>Right when she had no physical strength left and was about to be stabbed in the back, a man in green clothing, who had a frail and thin physique, rushed towards her, and shouted loudly–––</p><br/><p>“Changge! Be careful–––”</p><br/><p>With the man’s warning, Meng Changge barely avoided the sneak attack. But when she saw who the man was, she instantly got angry, her bloodstained hand grabbed the man’s collar, “F***, who allowed you here? Scram!!!”</p><br/><p>Sun Huanqing had a face full of determination, “I will not leave! If you want to die, let us die together!”</p><br/><p>Meng Changge pushed him away forcefully, her tone full of disdain and sarcasm, “Just scram! You are just a pretty boy, who don’t even have the strength to truss up a chicken, why should you die together with me!”</p><br/><p>Sun Huanqing was covered in dust as he stood up. His silver needle flashed and it pierced a person’s throat. Blood splashed his clear handsome white face. At that moment, there was no longer a doctor’s compassion in his eyes, it only had murderous intent.</p><br/><p>“What about now?” He asked. He had a stubborn and resolute expression.</p><br/><p>Meng Changge turned her head away, struggling to keep her face stern.</p><br/><p>At this instant, there were many complex feelings expressed on Ning Xi’s face. Finally, she let out a heavy sigh, “You……forget it, if you want to come along, just come then……but, don’t expect me to protect you!”</p><br/><p>Jiang Muye reached out his hand, and wiped off a bloodstain on Ning Xi’s face. His face was full of affection and gentleness. On this battlefield, which was filled with blood and smoke, she was like a fully bloomed white lotus. “Changge, I am your man, I should be the one protecting you.”</p><br/>\n</div>"}