{"title": "Chapter 253: I Am Your Exclusive Backer", "id": 253, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-253-i-am-your-exclusive-backer", "volume_title": "Volume 3", "body": "<h1>Chapter 253: I Am Your Exclusive Backer</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 253 – I Am Your Exclusive Backer</p><br/><p>Posted at 7:46 am by blazaria, on July 13, 2017</p><br/><p>Morning all~ I am working on making the posts link numerically and by category, and it is much harder than I thought😅.</p><br/><p>Translator: Akari, Blaze</p><br/><p>Editor: cfadmode</p><br/><p>Thank you to Eugenie Lobitana for their donation!</p><br/><p>“The meeting is suspended.”</p><br/><p>Leaving those four words, Lu Ting Xiao took his phone and exited the conference room.</p><br/><p>Ning Xi was originally waiting for Lu Ting Xiao’s text reply. She did not expect that he would be directly calling her back, which startled her.</p><br/><p>So Ning Xi told Xiao Tao to excuse her and quickly found an empty corner and answered the phone.</p><br/><p>“Hey……”</p><br/><p>“I saw your message.” Lu Ting Xiao’s tone was calm, as if he was in a good mood.</p><br/><p>Ning Xi dug her nails in the wall tiles distractedly and replied, “Oh.”</p><br/><p>When she had sent that message, she felt nothing, but at the moment why does she feels that something was off?</p><br/><p>“Are you jealous?” Lu Ting Xiao’s low and husky voice came over the phone.</p><br/><p>“Cough cough cough……” When Ning Xi heard these three words, a stunned cough burst out of her, and she angrily replied, “Who is jealous! I think it is necessary to find out the company’s relationships so I casually asked! It’s nothing more than that!”</p><br/><p>F***! No wonder she felt something was off! Sure enough, that question make other people feel as if she was jealous ah!</p><br/><p>“Since it was casually asked, then I refuse to answer,” Lu Ting Xiao said.</p><br/><p>“Ha……?” Ning Xi was astonished. She never would have thought that Lu Ting Xiao would be so childish. “What do I have to do for you to tell me?”</p><br/><p>Lu Ting Xiao: “Remember the question.”</p><br/><p>Which question? Am I jealous?</p><br/><p>In fact……</p><br/><p>Hearing Xiao Tao’s ambiguous guesses about Lu Ting Xiao being together with another woman really made her heart a bit uncomfortable……</p><br/><p>But how could she admit it ah?</p><br/><p>Thus Ning Xi indifferently said, “Forget it if you don’t want to answer. Since you’ve had a relationship with Su Yi Mo, with just this reason, I’ll minus your points and it will directly drop back to zero points!”</p><br/><p>Lu Ting Xiao sighed, could not help but compromise, “Rest assured that there is no relationship. You do not have to be cautious about her in the company.”</p><br/><p>“Why do some people say that Su Yi Mo’s backer is you? All the resources that was given to her before, wasn’t that your order?” Ning Xi asked puzzledly.</p><br/><p>“I am your personal backer.” Lu Ting Xiao answered.</p><br/><p>Ning Xi’s face turned hot immediately, and she said in a serious tone, “Speak properly! You’re not allowed to tease me!”</p><br/><p>Lu Ting Xiao chuckled, “Heh……”</p><br/><p>“You’re not allowed to laugh!”</p><br/><p>Lu Ting Xiao finally decided not to tease her, lightly coughed and replied, “Indeed it was my order, but I’m innocent. The reason why i gave that order was because she saved Little Treasure’s life.”</p><br/><p>“What? What happened to Little Treasure?” Ning Xi immediately asked nervously.</p><br/><p>“In order to allow Little Treasure to have contact with more people, I tried to send him to school. The result was that his emotions went wild and he ran out to the street. He was almost hit by a car but fortunately another car suddenly rushed out and hit that car, saving Little Treasure’s life. It was later revealed that the person in the car was Su Yi Mo. Because she was driving under the influence of alcohol, she lost control, but against all odds it saved Little Treasure……”</p><br/><p>When Ning Xi heard this, she was stupefied, “What! I don’t know what to say! That was it Su Yi Mo who had good luck or Little Treasure who had good luck? So in order to repay her, you gave that order?”</p><br/><p>But she was able to understand Lu Ting Xiao’s method of repayment. Since Su Yi Mo had saved Little Treasure, even if it wasn’t intentional but an accident, in the end, she had still saved Little Treasure.</p><br/><p>“Yes.” Lu Ting Xiao replied.</p><br/><p>“Tsk, but people have really saved Little Treasure’s life! Why didn’t you offer your body for marriage?”</p><br/><p>Lu Ting Xiao replied in a deadly tone, his words basically killing her: “Do you think I offer my body for marriage to just anyone?”</p><br/>\n</div>"}