{"title": "Chapter 261: Countdown To The Explosion Of Big Devil’s Rage", "id": 261, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-261-countdown-to-the-explosion-of-big-devil%E2%80%99s-rage", "volume_title": "Volume 3", "body": "<h1>Chapter 261: Countdown To The Explosion Of Big Devil’s Rage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>At night, Platinum Palace #8.</p><br/><p>There were only Lu Ting Xiao and Lu Jingli sitting at the huge dining table.</p><br/><p>“Sigh, Little Treasure isn’t here. Sister-in-law isn’t here too, you are all alone in the house. See how caring I am, I even came here to eat with you!” Lu Jingli sighed. Disliking the quietness of the house, he ran to switch on the television.</p><br/><p>Of course, the channel he switched to was definitely about the entertainment industry’s gossips.</p><br/><p>The television was currently broadcasting the press briefing for Su Yi Mo’s latest movie “Starry Sea”. There were many celebrities who attended, and it was very grand.</p><br/><p>Su Yi Mo was wearing WECOUTURE’s haute couture, an ice blue yarn evening dress. She was overflowing with a magical aura, like a goddess. She is worthy for the title of the “Nation’s Goddess”.</p><br/><p>Lu Jingli, being Golden Age’s boss, instead furrowed his brows, “What a waste of resources. So many scripts for her to choose from, yet she chose this kind of plaything ah? Other than goddess, it’s still goddess. Soon, she’ll become a professional in being a goddess. Can she have something different……ah, oh right, quite a few people believe that you and Su Yi Mo have that kind of relationship. Sister-in-law may have heard about it, have you explain it to her? Don’t create any bloodshed misunderstandings ah!”</p><br/><p>Lu Ting Xiao had a calm expression, “I’ve explained.”</p><br/><p>“Eh, so efficient?” Lu Jingli was wondering whether that phone call from yesterday was about this matter. Suddenly, the scene changed, and Ning Xi’s face appeared on the television……</p><br/><p>“Wah! There’s sister-in-law! Come and see it quickly!” Lu Jingli immediately focussed on her.</p><br/><p>Lu Ting Xiao put down his chopsticks, and looked towards the television’s screen, with a serious and focussed expression.</p><br/><p>“Earlier today, our reporter dropped by a film set that is filming the movie and is recently very popular among the crowd, Land Under Heaven. And he took some wonderful behind the scenes……”</p><br/><p>After the host introduced it, the scene changed to the big screen behind her.</p><br/><p>Ning Xi was holding a rifle and wearing bloodstained armor. She was looking at the green clothed Jiang Muye with an intense expression. “Don’t expect me to protect you!”</p><br/><p>Jiang Muye smiled, out his hand, and wiped off a bloodstain on Ning Xi’s face. His face was full of affection and gentleness, “Changge, I am your man, I should be the one protecting you.”</p><br/><p>“Eh, cough cough cough……” Lu Jingli did not expected it to start of with such an exploding scene. He quickly appease his brother, “Brother, it is just an act, it is definitely not real, it cannot afford to be real ah!”</p><br/><p>But, this was not the end.</p><br/><p>The screen quickly changed to other scene, Ning Xi was hugging Jiang Muye whose body was filled with arrows. Her torn apart expression and that look of despair made people feel experienced what she felt……</p><br/><p>Lu Jingli secretly glanced at his biological brother’s secretive face, and dryly emphasized, “Uh, sister-in-law’s acting skills is really good ah! Her acting skills is really good!”</p><br/><p>In the end, it was as if the television had a grudge with him. Just as he finished that sentence, the television start broadcasting the clip of the interview with Ning Xi.</p><br/><p>“Ning Xi, what type of man do you like? Or rather, what criteria are you looking for in a spouse? Can we talk about it?”</p><br/><p>“My spouse selection criterias are that he should be about my age, have similar interests as me, and that we are like-minded people.”</p><br/><p>……</p><br/><p>Lu Jingli quietly used his fingers and counted.</p><br/><p>Should be about her age, his brother is older than Ning Xi by eight years. It was nearly three generation gap, it should not be counted as about her age, right?</p><br/><p>Similar interests as her, the difference in their interests is about a hundred and eight thousand miles away……</p><br/><p>Like-minded people, back then when Ning Xi rejected his brother, one of the biggest reason was that they had different opinions……</p><br/><p>Whereas Jiang Muye, he fulfills all three of Ning Xi’s spouse standards……</p><br/>\n</div>"}