{"title": "Chapter 275: Little Treasure Is Unhappy", "id": 275, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-275-little-treasure-is-unhappy", "volume_title": "Volume 3", "body": "<h1>Chapter 275: Little Treasure Is Unhappy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 275: Little Treasure Is Unhappy</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ever since Little Treasure accidentally overheard Lu Jingli’s words, the Lu parents were uneasy, but they breathed a sigh of relief at lunch time.</p><br/><p>Little Treasure opened the door to let himself out and obediently finished his rice, drank his soup, and even ate some fruits after his meal.</p><br/><p>Everything seemed normal but in the past, the little guy’s every move was filled with energy, and now he just seemed like a robot who was just following instructions.</p><br/><p>After the meal, Little Treasure took his drawing book and went to the garden.</p><br/><p>The Lu parents spied on him from afar, trying very hard to see what the little guy was drawing in an attempt to figure out his thoughts.</p><br/><p>But the little guy just sat there and stared blankly into the distance without drawing a single thing.</p><br/><p>\"I knew it the moment that I saw him - our Little Treasure is unhappy!\" said Mother Lu mournfully.</p><br/><p>Father Lu walked in a few circles, his arms behind his back, finally concluding, \"Completely breaking this off is a good thing. If only Tingxiao was just getting a wife, that’s fine, but because of Little Treasure, we can’t be hasty about this! Will you be at ease leaving Little Treasure in the hands of that girl?\"</p><br/><p>\"But what Jingli said today makes sense too. That girl might not be as bad as we imagined her to be. Besides, she did teach Little Treasure quite well! Didn’t you yourself say she was doing a good job too?\"</p><br/><p>\"That was because I was fooled by those two punks!\" Father Lu started to become incensed again talking about this. He warned his other half with a stare, \"Don’t you be nice about this, no more further discussions about this! The most important thing you have to do now is to hurry up and choose a suitable wife for Tingxiao. Make him give up on the girl.\"</p><br/><p>\"If you want to choose, you go ahead! My dear grandson is already like this, I’m not in the mood to deal with such nonsense now!\"</p><br/><p>\"What would it look like if I did the choosing?!\"</p><br/><p>\"Whatever it is, I’m not going! I want to accompany my grandson!\"</p><br/><p>\"You…\"</p><br/><p>…</p><br/><p>Late at night at Dragon Bay</p><br/><p>A group of avant garde fashionable youths gathered together.</p><br/><p>One of them was a black short-haired youth that particularly stood out. His entire face was covered with an exaggerated skull, with a tattoo sleeve on his arm. He had a black coloured earring on his left ear and chewing gum in his mouth, he said to the white haired youth beside him, \"Ah Ka, is my car ready?\"</p><br/><p>Ah Ka tapped the car that was shined to sparkle beside him and said, \"It’s ready, here’s the car! Have a look see if you like it!\"</p><br/><p>The skull-faced youth looked critically at the car, and said stiffly, \"It’s not bad I guess, but it doesn’t have my blackie’s cool factor.\"</p><br/><p>Ah Ka rolled his eyes, \"Please, I can make your car look like this is considered not too shabby in just one day, alright? Right, Xi Zi, where’s your car? Where’s your blackie?\"</p><br/><p>\"I sent it for maintenance, it’s still not done yet,\" slurred the youth lazily. Her car was still with Lu Tingxiao. It was not too convenient to get it now in their current situation, so she had to borrow another one.</p><br/><p>Ah Ka nodded and clapped his hands to get everyone’s attention. \"Everyone’s here, right? Let me reiterate the competition rules! We’ll start here from Dragon Bay, and the destination will be Death Valley. First place gets to have our princess Xiang Xiang for one night of fun!</p><br/><p>The crowd started to cheer loudly.</p><br/><p>A sexy lady with a devilish body stepped out of the crowd to slap the back of Ah Ka’s head. \"Pfft, please! You hooligan! One night of fun, in your dreams!\"</p><br/><p>Despite getting hit, Ah Ka grinned as if he had just swallowed honey. He laughed and said, \"Haha, I was just joking! Let’s start again! The grand prize will be a kiss from our princess! Additionally, there’s a prize money of five million dollars!\"</p><br/>\n</div>"}