{"title": "Chapter 273: Another One Down", "id": 273, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-273-another-one-down", "volume_title": "Volume 3", "body": "<h1>Chapter 273: Another One Down</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 273: Another One Down</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli adjusted his collar before standing up and said, \"Firstly, occupation. Being an actress is a decent job, there’s nothing shameful about that. Yes, the entertainment circle is a little messy, but you can’t just generalise and discriminate everyone in it. Even I’m the boss of Glory World Entertainment! Since you have investigated, then you should also know that Ning Xi has been nothing but decent since she entered the industry. If not, with a face like hers, she would have been famous beyond comparison by now, and not just a B-list newbie.</p><br/><p>\"Secondly, education. Before Ning Xi went abroad, she managed to get into Imperial University with excellent grades. Later, it was only due to disagreements with her family that she was forced to further her studies abroad. Within those four years, she didn’t receive any financial assistance from her family, and relied on herself to get into the Southern Film Academy. Her grades were stellar and she received scholarships every year — why did you selectively ignore this point?</p><br/><p>\"Thirdly, private life. Every one of Ning Xi’s ex-boyfriends were relationships of open and decent nature. She was neither a third party in any of them, nor was she being taken care of by a sugar daddy, so which part of this is messy? If you guys can accept the fact that I, your son, have had 800 ex-girlfriends, can’t you accept that Ning Xi had eight ex-boyfriends? Don’t you think you’re imposing a double standard here? Let me remind the both of you that we’re in the 21st century; men and women are equal!</p><br/><p>\"Fourthly, family background. Indeed the Ning family has become increasingly outrageous in recent years. They ignore the real treasure of their family and instead side her unruly sister.\" But don’t forget, Ning Xi’s maternal grandfather is Zhuang Zongren. Years ago, they only disowned Zhuang Lingyu because she insisted on marrying Ning Yaohua. Though Ning Xi is still considered their granddaughter, this is a fact that can’t be denied. Zhuang Zongren’s granddaughter is more than enough to match us Lu family, isn’t she?\"</p><br/><p>Father Lu and Mother Lu were both still angry, and initially they were not prepared to listen to Lu Jingli’s defense. However, now that he said his piece, their expressions started to change…</p><br/><p>At this point, Lu Jingli added, \"Fifthly, I forgot to mention the most important thing.\"</p><br/><p>\"What is it?\" both parents eagerly asked.</p><br/><p>Lu Jingli told them, \"The both of you are worrying too much for no reason! Just yesterday, Ning Xi has already rejected big bro. So, stop worrying because Ning Xi is not becoming your daughter-in-laws, nor your grandchildren’s mother. From hereon, she won’t have anything to do with us Lu family.\"</p><br/><p>All of a sudden, a piercing sound came from behind —</p><br/><p>Lu Jingli and his parents both turned towards the direction of the sound, only to find Little Treasure’s small figure standing there with broken glass pieces on the floor…</p><br/><p>\"Little Treasure…\"</p><br/><p>Without waiting for the Lu parents to console him, Little Treasure ran into the house and slammed the door shut.</p><br/><p>Lu Jingli sighed, \"Great, another one down! After big bro got rejected, he’s been locking himself inside the house and hasn’t left since last night till now!\"</p><br/><p>Mother Lu who was worried for her son and her grandson was now even more anxious and scolded Lu Jingli, \"Bad son! Can’t you watch what you say? Now that Little Treasure has heard us, what do we do now? Little Treasure likes that woman so much!\"</p><br/><p>Lu Jingli looked innocently and replied, \"The day was going to come anyway! Ning Xi only promised big bro that she would accompany Little Treasure for three months, and three months is about to be up. Even if Ning Xi hadn’t set things straight with him, she would eventually have to leave!\"</p><br/>\n</div>"}