{"title": "Chapter 280: A Motherless Child Is A Sad One", "id": 280, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-280-a-motherless-child-is-a-sad-one", "volume_title": "Volume 3", "body": "<h1>Chapter 280: A Motherless Child Is A Sad One</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 280: A Motherless Child Is A Sad One</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli suddenly lost all color in his face. My God…brother is not going to mess with the Jiang family, is he? Is he really going to forfeit all kinships?! Even if they are not related to the Jiang family by blood, they are still connected to Jiang Muye’s mother’s generation and their parents really care about this relationship!</p><br/><p>After some thought, Lu Jingli knew something was not right.</p><br/><p>Based on his brother’s personality, if he was going to do anything to the Jiang family and Jiang Muye, he could have done that much earlier. There was no way he would have kept quiet for the past three days…</p><br/><p>What was up then?</p><br/><p>\"Is there something you want to say?\"</p><br/><p>The air around suddenly filled with an icy voice, causing Lu Jingli to shudder and return to his senses. He quickly explained, \"Yes, mom and dad called earlier and they said that Little Treasure is not feeling too well, so they want you to quickly go home!\"</p><br/><p>Lu Tingxiao stubbed out his cigarette butt and then lit another one again, \"Get the car ready.\"</p><br/><p>\"Okay!\"</p><br/><p>Lu Jingli quickly sneaked out, secretly grateful.</p><br/><p>It was a good thing that his brother had not forgotten all kinship to point of neglecting his son…</p><br/><p>Lu Family Old Residence.</p><br/><p>Mother Lu was anxiously pacing about outside the door. As as soon as she saw Lu Tingxiao, she immediately went up to greet him and said, \"Tingxiao, you’ve finally come home! Quickly go and see Little Treasure!\"</p><br/><p>Father Lu was obviously unhappy and scolded him, \"Oh you finally know your way back home do you? Little Treasure is ill and yet you couldn’t even be contacted! How are you suitable enough to be his dad?\"</p><br/><p>Lu Tingxiao’s pale face was devoid of any expression as he replied calmly without fighting back, \"Weren’t the both of you going to get me a wife? You can go let those women take care of him.\"</p><br/><p>Father Li's eyes flew wide and he shouted at his son, \"You bastard! How could you say something like this? Little Treasure is your son! You don’t take care of him yourself and yet you expect strangers to do it for you?\"</p><br/><p>Lu Jingli scoffed. He could not help himself and said, \"Dad, please, can you be more sensible? It was the both of you who were in a hurry to find strangers to take care of Little Treasure! Brother did find Little Treasure an extremely reliable lady to take care of him, but it was the both of you who didn’t trust his judgement! Now he’s agreeing to let the both of you choose for him, yet you’re still unsatisfied. What do you want him to do?\"</p><br/><p>\"You…\" Father Lu was so angry that he was speechless. Then his expression changed and he said, \"You punk, I almost fell for your trap! It was he himself who didn’t have the ability to get her, don’t blame it on me.\"</p><br/><p>Uhh, exposed…</p><br/><p>Lu Jingli rubbed his nose and then said again, \"But...this means...that if he manages to get her then you wouldn’t be against it anymore?\"</p><br/><p>Father Lu grumbled, \"Don’t try to be smart with me. Quickly go see Little Treasure!\"</p><br/><p>\"Little Treasure, what’s wrong? Where are you not feeling well?\" Lu Jingli asked the boy.</p><br/><p>Mother Lu wiped her tears as she said, \"It’s probably because that girl had previously taught him to be obedient, so these few days he has been a very good boy, always eating and resting normally without rebelling. Until today, not too long after dinner, Little Treasure suddenly vomited everything he ate and he even fainted…\"</p><br/><p>Mother Lu took out a drawing and cried even harder as she told him, \"Later on, after I saw these words on Little Treasure’s drawing, only did I realize that he wasn’t fine at all, that he has been suppressing everything…\"</p><br/><p>Lu Jingli took over the drawing, looked at it, and started sobbing within seconds. \"My goodness, poor Little Treasure...a child without their mother is a sad one…\"</p><br/><p>\"Exactly, I am so heartbroken by this!\"</p><br/><p>Both mother and son cried in each other’s embrace.</p><br/>\n</div>"}