{"title": "Chapter 286: Always Been This Quick-Witted", "id": 286, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-286-always-been-this-quick-witted", "volume_title": "Volume 3", "body": "<h1>Chapter 286: Always Been This Quick-Witted</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 286: Always Been This Quick-Witted</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Dr. Qin says he has slight depression,\" said Lu Jingli with a heavy tone.</p><br/><p>\"Depression? Why does he suddenly have depression? How is he now?\"</p><br/><p>For\nthe past few days since she hadn’t heard any news from the Lu family,\nshe thought that the best news was no news. She thought Little Treasure\nhad entirely healed under her care. Based on what she knew about his\nreactions, he could really have kicked up a fuss. Had Lu Jingli and the\nrest sought her earlier, it might not have been like this…</p><br/><p>\"Now\nhis condition is getting worse, even when we’ve had many doctors over.\nIt’s all not working, Xiao Xi Xi, you have to come visit Little Treasure\nquickly!\"</p><br/><p>\"Where is Little Treasure now?\"</p><br/><p>\"At the old residence, where my parents live!\"</p><br/><p>Ning\nXi’s end of the line was silent for a few seconds, and then there was a\nslight shift in her tone, \"Lu Jingli, you’re hiding something from me.\"</p><br/><p>\"What? No...No, I’m not! What would I hide from you?\"</p><br/><p>\"Little\nTreasure has already been ill for a few days now, logically you would\nhave called for me earlier, at the very least, a call, but you didn’t.\nNot until now, when it’s already so late at night, that you’re rushing\nfor me to come over. Plus, Little Treasure is still at the old\nresidence…\" Ning Xi paused, before she continued, \"Father and Mother Lu,\nthey found out about my identity, didn’t they? They’re against me and\nLu Tingxiao getting together, and they don’t let me go near Little\nTreasure anymore, right?\"</p><br/><p>\"Uhh…well…\" Lu Jingli was used to being\nthe one who guessed everything correctly. This was his first time being\nexposed with no way to hide. He suddenly turned sour and grumbled, \"Xiao\nXi Xi, since when did you become this quick-witted?\"</p><br/><p>\"Hey! I’ve\nalways been this quick-witted!\" Ning Xi rolled her eyes, frowned and\nasked with a tired tone, \"Second master, you know how Lu Tingxiao and I\nare like now. If I go over it wouldn’t be appropriate, what more with\nyour parents' opinion of me now.</p><br/><p>\"I promised Lu Tingxiao I would\ntake care of Little Treasure, and actually...tomorrow will be the final\nday of the contract. I would have to leave eventually.</p><br/><p>\"Even if I went right now, what about next time, and the next time?</p><br/><p>\"Little\nTreasure has the best doctors, his grandfather and his grandmother, and\nyou guys to take care of him. I believe that as the days go by, he will\nsoon forget all about me…\"</p><br/><p>Ning Xi said all of this in a single breath, not knowing whether she said those for Lu Jingli or for herself.</p><br/><p>Of\ncourse she was worried about Little Treasure, but if she visited him\nnow, she was almost sure that she would give in the moment she saw\nLittle Treasure, to the point that she might even agree to all of his\nrequests…</p><br/><p>She had already persevered for so many days, she could not just give up now.</p><br/><p>\"But,\nsister-in-law, a heart’s troubles can only be cured by resolving it.\nLittle Treasure’s illness happened because he misses you too much. Every\nday, he looks forward for your return, do you really have the heart\nto...hello...hello…\"</p><br/><p>The line went dead, and Lu Jingli was suddenly at a loss.</p><br/><p>Damn it, I have actually failed!</p><br/><p>Seems like Xiao Xi Xi had really hardened her resolve this time.</p><br/><p>What do I do now? My poor baby!</p><br/><p>Lu Jingli had no choice but to report the situation to his brother.</p><br/><p>After searching everywhere, he finally found him in Little Treasure’s room.</p><br/><p>Lu\nTingxiao sat at the bedside while Little Treasure laid on his bed with\nhis eyes close, unsure if he was asleep as the little guy had been\nhaving trouble sleeping lately.</p><br/><p>Lu Tingxiao only needed to see Lu\nJingli’s expression to know the outcome. He replied in an expectant\ntone, \"She rejected, didn’t she?\"</p><br/>\n</div>"}