{"title": "Chapter 292: My Baby", "id": 292, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-292-my-baby", "volume_title": "Volume 3", "body": "<h1>Chapter 292: My Baby</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 292: My Baby\n</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation\n</p><br/><p>\"Tang Xi, I hate you so much!\" Xiang Xiang cried as she ran out.\n</p><br/><p>Ning Xi nudged Ah Ka's shoulder and said, \"Why are you still standing here? Quickly go chase after her!\"\n</p><br/><p>Ah Ka was stunned for a moment, before he gave Ning Xi a fist bump and then running after Xiang Xiang.\n</p><br/><p>After\nchatting with everyone, Ning Xi put the helmet onto Little Treasure\nagain and said, \"My fellow bros, I brought my son today and it's getting\nlate so I shall make a move first. Next time, grilled meat and beers on\nme!\"\n</p><br/><p>\"Xi, I'll take your word for it!\"\n</p><br/><p>\"Exactly! You're not allowed to ditch us! Oh yeah, remember to bring your beautiful wife for us to meet!\"\n</p><br/><p>\"Haha, yes, bring her along!\"\n</p><br/><p>Ning\nXi shot those guys a look and replied, \"Please! I already said she's a\nbeauty, do you think I'd bring her for you pack of hungry wolves to\ndrool over?\"\n</p><br/><p>\"Jeez—\" The crowd booed.\n</p><br/><p>The night started to fade away as the sky turned to light.\n</p><br/><p>Ning Xi drove along the road and reached a quiet alley.\n</p><br/><p>From afar, one could smell the tempting aroma of food.\n</p><br/><p>She stopped her motorcycle and carried Little Treasure down. \"Hungry, are you? Aunty will bring you for some good food!\"\n</p><br/><p>Ning\nXi held Little Treasure's hand and walked into an old but refreshing\nbreakfast diner. She ordered a bamboo steamer of small steamed buns and\ntwo bowls of dumplings.\n</p><br/><p>The steamed buns had thin skin and were\nfilled with lots of juicy meat, while the dumplings were thick with\nfillings. With a drip of special sesame oil and a sprinkle of chives,\nNing Xi gobbled it all up within seconds and asked for a second bowl.\n</p><br/><p>Looking up, she saw the little bun too had scarfed down a big bowl of food and licked his lips in a way to show he wanted more.\n</p><br/><p>Ning\nXi laughed, \"Your little stomach is only so big. Even if it's that\ngood, you can't eat too much at a go, so one bowl is enough! Try this\nsmall steamed bun, it's really good as well!\"\n</p><br/><p>She picked up a bun, dipped it in vinegar and put it into his little bowl.\n</p><br/><p>This time, the little bun ate it slowly, as if he did not want to the bun to end so quickly.\n</p><br/><p>Ning\nXi leaned her head on her hand and looked at the little bun. The longer\nshe looked, the more her heart hurt. She had to take a breath before\nshe took her eyes off him.\n</p><br/><p>The little bun finished his small steamed bun and looked like he was at a loss.\n</p><br/><p>\"Next...\" Ning Xi was about to say, \"Next time, I'll bring you here again\" but she had to stop herself.\n</p><br/><p>Once they were done with breakfast, Ning Xi took a look at the time on her phone. It was almost six o'clock.\n</p><br/><p>She still had two more hours before she had to send the little bun home, and start work...\n</p><br/><p>Regal\nRiveria Hotel was not too far away, so Ning Xi first brought Little\nTreasure to her condominium and cleaned him up, so as to not frighten\nthe Lu parents later.\n</p><br/><p>From the way those two were careful and\nworried about Little Treasure, they definitely could not accept what\nNing Xi had been doing with Little Treasure last night...\n</p><br/><p>Little Treasure suddenly sobered up when he saw that his face was restored to normal.\n</p><br/><p>Ning\nXi picked up a pink brush from her dressing table and dressed him up\nwith a pink nose and beard, making him look like a cute little kitten.\n</p><br/><p>Then, she drew the same thing on her face. \"Meow! It's cute, eh?\"\n</p><br/><p>Little Treasure touched the cat whiskers on his cheeks and he seemed to be cheered up again.\n</p><br/><p>Ning Xi carried the moody little bun to sit on her and asked, \"Baby, are you sleepy? Want to sleep for a while?\"\n</p><br/><p>Little bun immediately shook his head and widened his eyes.\n</p><br/><p>\"Mmm, then what should we do? Let me think...\"\n</p><br/><p>Ning\nXi thought hard as she only had an hour left. What else could she do\nwith the little bun, or what else could they do that would make him\nextra happy?\n</p><br/><p>As she was thinking, she did not know why, but\nsuddenly her mood changed and she felt like she was about to break down.\nThe tears that she had suppressed for so long could no longer be kept\nin...\n</p><br/>\n</div>"}