{"title": "Chapter 297: Holding Her Hand Under The Table", "id": 297, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-297-holding-her-hand-under-the-table", "volume_title": "Volume 3", "body": "<h1>Chapter 297: Holding Her Hand Under The Table</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: EndlessFantasy Translation </p><br/><p>Editor: EndlessFantasy Translation</p><br/><p>\"Brother! You had better tell me honestly - did you teach Little Treasure this trick? Did you plan this right from the start, just waiting for this moment? Jeez! Since you've planned this from the outset, you could have let me in on it! I was scared to death earlier!\" Lu Jingli said as he wiped the sweat from his brow, calming down.</p><br/><p>Lu Tingxiao looked at his brother who was terrified out of his mind, and explained, \"Your face would have given it away. If Father could see that Little Treasure was instructed to do that, it would only have increased their dislike for Ning Xi.\"</p><br/><p>\"Uhh...my face...is it that expressive?\" Lu Jingli said in surprise.</p><br/><p>His brother made sense, he had no room for defense...</p><br/><p>However, once the crisis had been averted, Lu Jingli returned to normal again. He laughed excitedly, \"Bro, did you our parents' faces earlier? It was too funny! The old man was clearly overjoyed, yet he tried to pretend that he was calm. Our mother just straightforwardly pulled Ning Xi into the house. Xiao Xixi was so stunned!\"</p><br/><p>Lu Jingli recalled Ning Xi's expression and felt a sense of consolation that at least there was someone on the same boat as him.</p><br/><p>In the Chinese retro style living room, the long dining table was full of various dishes. It was only breakfast, but the spread was even grander than a banquet.</p><br/><p>With nowhere to escape, Ning Xi just went with the flow and sat at the table. Seated opposite her was Mother Lu, Little Treasure, and Father Lu. Flanking Ning Xi was Lu Jingli, her, and Lu Tingxiao.</p><br/><p>To dissipate the awkward situation, Ning Xi initiated the conversation, \"Thank you so much, madam, for your warm welcome, but I've already had breakfast .\"</p><br/><p>In other words, she was trying to convey, \"I've eaten! Please let me go!\"</p><br/><p>With the devil himself so closely on her left and the devil's parents opposite her, she felt immensely pressured!</p><br/><p>\"Have you eaten? What about Little Treasure? Has he eaten too?\" Mother Lu immediately questioned.</p><br/><p>\"Yes,\" Ning Xi answered carefully, not wanting to speak too much.</p><br/><p>\"What did Little Treasure eat this morning?\"</p><br/><p>\"He ate a big bowl of dumplings and a few small steamed buns.\"</p><br/><p>\"Ohh, then he's eaten quite a lot!\" Mother Lu nodded, before she asked with concern, \"Did he vomit or feel sick?\"</p><br/><p>Lu Chongshan looked at Ning Xi curiously.</p><br/><p>Ning Xi shook her head, assuring, \"That didn't happen.\"</p><br/><p>Both parents were relieved.</p><br/><p>\"Then see if there's anything you like to eat, and dig in!\" Mother Lu said as she personally served Ning Xi a small plate of lemon fish cutlets.</p><br/><p>Unable to reject her kind hospitality, Ning Xi thanked her gracefully.</p><br/><p>Lu Chongshan then cleared his throat and gave his wife a look. Mother Lu instantly understood, and proceeded to ask, \"Miss Ning, I heard you brought our Little Treasure out to play last night?\"</p><br/><p>Finally, the question she was waiting for...</p><br/><p>Ning Xi's expression immediately tightened, \"I'm sorry, I...\"</p><br/><p>She was about to admit that she had taken Little Treasure away without their permission...</p><br/><p>All of sudden, her left hand which was resting on her knee was covered by a warm palm lightly, as if there was some hidden message trying to be conveyed to her.</p><br/><p>The unexpected warmth shocked Ning Xi akin to a cat who's tail was stepped on, and she almost jumped up from her seat. She even choked slightly on her food and started coughing profusely.</p><br/><p>Lu Tingxiao acted nonchalantly and poured her a cup of water, even lifting it up to her lips as if it was the most natural thing to do.</p><br/>\n</div>"}