{"title": "Chapter 296: Kissing Both", "id": 296, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-296-kissing-both", "volume_title": "Volume 3", "body": "<h1>Chapter 296: Kissing Both</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 296: Kissing Both</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Chongshan's eyes immediately fell on his beloved grandson beside Ning Xi. After making sure that he was fine, his sharp gaze focused on Ning Xi.</p><br/><p>Even though Lu Chongshan had been retired for a quite awhile, he did rule Imperial for so many years and he could be really intimidating if he wanted to be.</p><br/><p>Because Ning Xi had to directly go to the drama team later, she had put on her typical casual outfit and tied her hair up into a simple ponytail. Overall, she was quite well dressed.</p><br/><p>Nevertheless, Lu Chongshan did not notice these things, as he was only filled with the idea that this girl before him had foul intentions by colluding with both his sons to let her take away his beloved grandson for a night!</p><br/><p>Such nerves she had to challenge his authority!</p><br/><p>Lu Chongshan stomped furiously towards Ning Xi, and the closer he got, the more tensed the atmosphere became...</p><br/><p>But something unexpected happened out of the blue.</p><br/><p>The little bun who was initially standing beside Ning Xi unmoving, suddenly let go of her hand and stumbled forward with his short little legs. He slowly ran towards his grandparents...</p><br/><p>The two Lu grandparents felt their heart strings tugged at the side of their grandson running towards them, and they subconsciously thought Little Treasure must have been wronged. Both of them squatted down and were ready to console the little guy.</p><br/><p>Alas, baby Little Treasure who usually had on a straight expression, ran to them and broke into the biggest smile!</p><br/><p>Both grandparents were stunned as Little Treasure went over to plant a kiss on his grandmother's cheek, then very fairly, his grandfather's too.</p><br/><p>At this moment, Father Lu and Mother Lu were speechless.</p><br/><p>Lu Jingli's jaw dropped.</p><br/><p>All the maids too had on an astonished expression, and even Ning Xi was shocked by this scene.</p><br/><p>The only person who was calm through it all was probably Lu Tingxiao who already had everything under control.</p><br/><p>Moments passed and both grandparents still did not know how to react.</p><br/><p>Mother Lu's had on a dreamy expression and disbelief, \"I...Am I dreaming? Did our baby just...just kiss me...?\"</p><br/><p>\"He kissed me too.\" Lu Chongshan said in shock.</p><br/><p>At this moment, his rage had entirely left him.</p><br/><p>To maintain his composure, he first suppressed his emotional expression and then slowly stood up. He looked at Ning Xi again, cleared his throat and said,</p><br/><p>\"Mmm, you must be Miss Ning Xi right? Thank you for sending our Little Treasure home. If you don't mind, come in and sit down for a while!\"</p><br/><p>Mother Lu immediately echoed, \"Yes! Since you're here anyway, you should come in for a while! I've just made breakfast, let's eat together!\"</p><br/><p>\"Uhh...I have already eaten...\"</p><br/><p>Before Ning Xi could finish her sentence, Mother Lu was already reaching out to her hand gently as she guided her into the house.</p><br/><p>Ning Xi was speechless.</p><br/><p>From the moment Little Treasure had run towards them, Lu Jingli was dumbfounded. What had just happened?</p><br/><p>As Ning Xi was practically dragged in, she wanted to pull away but there was no way to do so, so she just shot a look at Lu Tingxiao whom she had been avoiding to ask for help.</p><br/><p>Big boss, help! She desperately sent the message through her expressive eyes.</p><br/><p>Lu Tingxiao looked at the reluctant girl who was silently pleading to him for help and he smiled a little. The coldness in his eyes melted...</p><br/><p>Ning Xi wasn't sure why either, but Lu Tingxiao's brief look was enough to calm her inner frantic storm into a lazy river in spring, instantly granting her a sense of serenity.</p><br/>\n</div>"}