{"title": "Chapter 301: Nothing A Kiss Can't Fix", "id": 301, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-301-nothing-a-kiss-cant-fix", "volume_title": "Volume 4", "body": "<h1>Chapter 301: Nothing A Kiss Can't Fix</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 301: Nothing A Kiss Can't Fix</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Ning Xi was about to leave, Mother Lu noticed that Father Lu was silent with a cold expression on his face.</p><br/><p>Lu Tingxiao stood up and walked towards Little Treasure, then carried him to Ning Xi, \"Go send Aunty Xiao Xi off.\"</p><br/><p>Little Treasure nodded and held Ning Xi’s hand.</p><br/><p>Ning Xi looked at Lu Tingxiao gratefully, then walked off with her little bun to the courtyard.</p><br/><p>Lu Chongshan was about to get up, but was stopped by Mother Lu. She shook her head and said, \"Let them be, he’s just sending her off.\"</p><br/><p>Lu Chongshan’s expression was still unhappy, but he gave in anyway.</p><br/><p>Ning Xi and Little Treasure walked along a short green pebbled path. It would take them 10 minutes to reach the courtyard gate.</p><br/><p>Along the path, Ning Xi kept thinking about words to comfort the little bun, but she was unable to come up with anything.</p><br/><p>The little bun looked down, refusing to lift his head up.</p><br/><p>After a while, he took out his writing board, and started writing.</p><br/><p>The little bun showed Ning Xi the board after he was done with it, on the board it was written—</p><br/><p>[Tagore once said: If you love her, let your love surround her like sunlight, and set her free.]</p><br/><p>Ning Xi's sadness vanished after she saw what Little Treasure wrote, \"Baby, you even know about Tagore! Where did you learn this from?\"</p><br/><p>Ning Xi squatted down and hugged the little bun tightly and with a heart full of warmth, she told him, \"Thank you...I’m really thankful for you…\"</p><br/><p>She really did not expect Little Treasure to show her something as heart-touching as this. As she was hugging Little Treasure, she saw a familiar shadow closing in.</p><br/><p>She quickly kissed the little bun and told him that she would find a chance to visit him again, then she ran away...</p><br/><p>Lu Tingxiao felt forlorn when he saw the girl running away swiftly.</p><br/><p>Lu Jingli laughed out loud, \"Bro, Xiao Xi runs faster than a mutant rabbit when she sees you!\"</p><br/><p>He then looked at the little bun and said, \"It’s really unfair! I understand now that no matter what I say it can never be on par with a kiss from Little Treasure. If there’s something a kiss cannot solve, then two kisses!</p><br/><p>\"So, bro, why don't you let Little Treasure do his thing and change our parents' mind. Won't it solve the huge issue between you and Xiao Xi?\"</p><br/><p>\"This isn’t the biggest problem between us\", Lu Tingxiao replied coldly.</p><br/><p>He knew clearly that the suggestion to have Ning Xi resign and become Little Treasure’s tutor was the best compromise the old man could make.</p><br/><p>However, his ultimate goal was accomplished, when he saw how much influence Ning Xi had over Little Treasure. He knew that Father Lu would not try to do anything to her.</p><br/><p>After Ning Xi left, Lu Chongshan called both sons into his study room.</p><br/><p>\"Seeing that it’s all for Little Treasure, I will not pursue what happened last night further, but there will be no next time!\"</p><br/><p>\"Father, why are you so troublesome! Just let brother marry her already, then everything will be solved. How awesome would that be?\"</p><br/><p>Surprisingly, Lu Chongshan did not get angry at Lu Jingli, instead he sighed, \"Jingli, if it had been you, I would have agreed to the marriage.\"</p><br/><p>Lu Jingli shivered, \"Father, can you stop making such terrifying statements?\"</p><br/><p>This was just causing him more trouble!</p><br/>\n</div>"}