{"title": "Chapter 300: Godly Fire Extinguisher", "id": 300, "volume": 3, "url": "http://boxnovel.org/hidden-marriage-chapter-300-godly-fire-extinguisher", "volume_title": "Volume 3", "body": "<h1>Chapter 300: Godly Fire Extinguisher</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: EndlessFantasy Translation </p><br/><p>Editor: EndlessFantasy Translation</p><br/><p>\"Mr. Lu, I didn’t mean it that way. If your intention was for me to spend more time with Little Treasure, I can come over more often, as a friend.\" Ning Xi said.</p><br/><p>\"Are you rejecting me?\" Lu Chongshan’s face darkened.</p><br/><p>Not knowing if it was because of Lu Tingxiao's presence beside her, even under Father Lu’s terrifying pressure, she was still brave enough to say, \"Yes\".</p><br/><p>\"You’re being ridiculous!\"</p><br/><p>Lu Chongshan was always above everyone else and he was used to everyone obeying him, which explained why he could not handle a little artiste rejecting his offer. He exploded right there and then.</p><br/><p>Lu Tingxiao kept silent and put his hand on Ning Xi’s chair. While he did not say anything, his assumed a protective pose.</p><br/><p>When Lu Tingxiao came closer to her, Ning Xi relaxed.</p><br/><p>The talk came to a stalemate. The smooth talking Lu Jingli could not wait anymore and said, \"Father, where’s your logic? Xiao Xi just had to say \"Yes, I do\" to brother and she would have the whole Lu family to herself, but if she doesn’t even want to become my sister-in-law, do you think she’d care about the money?\"</p><br/><p>Lu Chongshan was infuriated as he slammed the table loudly, \"You bastard, are you forcing me to use the family punishment!?\"</p><br/><p>\"You always threaten us with the family punishment every time you lose an argument…\" Lu Jingli mumbled softly.</p><br/><p>With both of his sons not on his side, he became increasingly angry that point. As he was going to start yelling again, he felt a soft pat on his back.</p><br/><p>He turned around and saw Little Treasure patting his back with his tiny hands. It seemed like he was comforting him to not be angry as it was unhealthy.</p><br/><p>Such a godly fire extinguisher, what kind of flame of anger would still survive?</p><br/><p>Lu Chongshan was relieved instantly by the child's gesture, which worked better than any heavenly medicine. He said kindly, \"My sweet child, you’re worried about grandpa, aren’t you?\"</p><br/><p>Lu Jingli saw his father’s gentle attitude towards Little Treasure and felt jealous, as he said, \"Wow, why haven’t I seen you treat me this kindly before? What a huge difference! Why am I the lowest ranking person in this family? Am I really your biological son?!\"</p><br/><p>Annoyed, Lu Chongshan replied, \"Wait till you get married and bear me some grandchildren, then we’ll talk about your place in the family!\"</p><br/><p>Lu Jingli cheekily replied, \"Bye bye! I guess I’ll just stay here at the lowest level!\" The price to pay for getting a higher status in the family was just too high for him.</p><br/><p>Suddenly, the sound of a phone ringing interrupted the conversation.</p><br/><p>Ning Xi quickly took out her phone to see that it was Xiao Tao. Only then did she realize that she was already half an hour late.</p><br/><p>Ning Xi answered the call in a low voice, \"Hey Xiao Tao…\"</p><br/><p>\"Hello, Sister Xi, why aren’t you here yet? We’ve started shooting and the director is urging everyone to gather! I went to your room but no one answered the door! Where are you?\"</p><br/><p>\"Ugh, I had something urgent to handle, I’m still currently on the east coast, and the soonest I can get there would take about an hour. Please help me explain and apologize to the director!\"</p><br/><p>After ending the call, Ning Xi stood up and prepared to leave.</p><br/><p>\"Thank you for having me here, but I still have some work to do, I need to leave first.\"</p><br/><p>She looked at at her little bun and reluctantly left.</p><br/>\n</div>"}