{"title": "Chapter 303: She Was Tricked", "id": 303, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-303-she-was-tricked", "volume_title": "Volume 4", "body": "<h1>Chapter 303: She Was Tricked</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 303: She Was Tricked</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At the same time, at Platinum Palace.</p><br/><p>Ning Xi was talking to the maid, Wan Wan at the door.</p><br/><p>\"My dearest and cutest Wan Wan, please, just let me in! I guarantee that I'll leave as soon as I've taken my luggage!\" Ning Xi begged with her palms pressed together.</p><br/><p>When she left the old residence earlier, she thought that she might as well apply for half a day off from the drama team and collect the luggage she had left at the bungalow.</p><br/><p>Even though three months was not too long a time, she realized that she had unknowingly moved most of her things here. That was why during this period of time, when she needed to use something urgently but could not come over to get it, it was very inconvenient.</p><br/><p>Of course, the most important thing was that she knew that the devil would be at the old residence, and definitely not at the bungalow. That was why she quickly used the opportunity to rush here.</p><br/><p>Frustratingly, the situation did not progress as smoothly as she had imagined it would have.</p><br/><p>The gentle little maid would not let her in, no matter what.</p><br/><p>\"Miss Xiao Xi, please don't make this harder for me. It's not that I'm intentionally not letting you in, but I really don't have the authority to open this door!\"</p><br/><p>Ning Xi had no choice but to beg butler Yuan.</p><br/><p>Butler Yuan was on the phone with someone, but he quickly hung up when he saw her coming his way. Then he cleared his throat and nonchalantly turned to her to say, \"Miss Xiao Xi, you're back!\"</p><br/><p>\"Mmm, I came back to get some things. Dear butler, would you help me open the door?\" Ning Xi anxiously asked for help.</p><br/><p>Butler Yuan's face immediately revealed an expression of helplessness and softly sighed, \"Miss Xiao Xi, even though as a servant, I should not say much about master, this time I can't help but tell you. Previously, I don't know what happened but a while back, the master returned and he made all of us leave the residence. Then, he locked himself up inside for a whole day. After that, the residence's enter and exit security has been tightened and until now, no one else but him can enter.\"</p><br/><p>Butler Yuan paused at this part, and then continued to say, \"So, if you need to go in, you can only contact the master to come over and open the door for you.\"</p><br/><p>When she heard butler Yuan say this, Ning Xi recalled that Lu Jingli did mention this to her before. She had been intentionally avoiding and not paying attention to all news related to Lu Tingxiao...</p><br/><p>Ning Xi was shocked for a moment, but she quickly said, \"Thank you, then it's fine, I'll leave! Dear butler, goodbye!\"</p><br/><p>She felt slightly unsettled about the phone call she saw butler Yuan on. Since she still could not get her luggage today, it was best she left soon!</p><br/><p>When butler Yuan saw that Ning Xi was going to leave, he suddenly became anxious as the master was still on his way!</p><br/><p>He had seen his master depressed for many days, and finally he waited for Ning Xi to be back. He was not going to let her go easily.</p><br/><p>Thus, butler Yuan quickly called out to stop her, \"Miss Xiao Xi, wait!\"</p><br/><p>\"Dear butler, is there anything else?\" Ning Xi stopped in her footsteps.</p><br/><p>Butler Yuan pretended as if he suddenly thought of something and said, \"Miss Xiao Xi, I suddenly thought of a way of opening the door for you.\"</p><br/><p>\"Really?\" Ning Xi's face immediately lit up.</p><br/><p>\"Yes, Miss Xiao Xi, please wait here for a while.\"</p><br/><p>\"Okay, no problem! I'm so sorry for troubling you!\"</p><br/><p>At this moment, Ning Xi's heart was filled with grateful thoughts that there was humanity in this world without suspecting that the friendly looking old butler would have tricked her.</p><br/><p>Thus, Ning Xi stood there, full of hope. Alas, she waited for more than 20 minutes...</p><br/>\n</div>"}