{"title": "Chapter 306: Better Suited For Kissing", "id": 306, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-306-better-suited-for-kissing", "volume_title": "Volume 4", "body": "<h1>Chapter 306: Better Suited For Kissing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 306: Better Suited For Kissing</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi was so scared that her knees almost gave way. Whoever said she had guts?</p><br/><p>Even when she entered the house earlier, it was because she had been too afraid to ignore his instructions!</p><br/><p>Ning Xi stood still, one foot in front of the other, and a hand dragging her box. She dared not make another move.</p><br/><p>She carefully observed Lu Tingxiao’s expression. Too bad the devil was so highly skilled, she had no idea if he was just joking or he was being serious.</p><br/><p>Ning Xi kept thinking, then an idea popped into her head and she quickly said, \"Who was that again…Ah, Tagore! Tagore said before, if you love someone, you should let your love surround them like sunlight, and set them free!\"</p><br/><p>Lu Tingxiao grinned.</p><br/><p>Ning Xi did not understand the reason behind his weird grin, so she continued, \"Tagore also said before, liking is presumptuous, but love is an act of restraint! And he even said that, love is not temporary restraint without considering the consequences, but it’s to help them live on freely!\"</p><br/><p>\"Tagore said all of these?\" Lu Tingxiao asked coolly.</p><br/><p>\"Uhh, I think so…\"</p><br/><p>Ning Xi let out a hollow laugh. Her mind was actually in a mess, she did not know who said all of these quotes…</p><br/><p>\"Are there more?\" Lu TIngxiao continued asking.</p><br/><p>Ning Xi nodded her head eagerly, like a tiny chick pecking on rice grains, \"Yes, yes, Tagore also said that, imprisoning others is illegal…\"</p><br/><p>Lu Tingxiao’s little grin spread into a wide smile, his cold fingers holding onto her chin, \"Then…did Tagore mention that your mouth is not suitable for talking nonsense, but better suited for kissing?\"</p><br/><p>Right after he finished his sentence, their lips met.</p><br/><p>Ning Xi was flabbergasted.</p><br/><p>\"You’re the one who’s talking nonsense! Tagore wouldn’t say something like this!\"</p><br/><p>In shock, the box fell off Ning Xi’s hands, followed by a loud \"bam\" sound of the heavy door closing shut.</p><br/><p>Ning Xi fell behind onto the soft bed.</p><br/><p>Lu Tingxiao just stood in front of the bed, slowly, and elegantly… taking off his coat…</p><br/><p>Impure thoughts of how her boss was undressing himself passed through her mind.</p><br/><p>She shook her head and tried to pull herself together, quickly saying, \"CEO Lu, you…you have to calm down! Committing a crime for someone like me really isn’t worth it…I can teach you some meditation…it works like a charm…\"</p><br/><p>As she was blabbering, Lu Tingxiao had already taken off his coat and he started to close in on her.</p><br/><p>Seeing how close the man’s breath was getting to her, she felt cornered and she shouted, \"Lu Tingxiao! Don’t you dare cross the line! Don’t force me to use violence on you!\"</p><br/><p>Instead of retreating upon her defensive reaction of calling him out, the man showed a satisfied expression.</p><br/><p>He totally ignored the girl’s warning and continued to close in…</p><br/><p>Dang it! Just because I don’t show what I can do doesn’t mean I can be taken advantage of!</p><br/><p>Ning Xi shoved her knee forward and tried to create an opening for herself. In the end, before she could do anything further, she felt a cold sensation on her wrist and heard a \"clacking\" - she was handcuffed!</p><br/>\n</div>"}