{"title": "Chapter 326: A Date With The Little Bun", "id": 326, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-326-a-date-with-the-little-bun", "volume_title": "Volume 4", "body": "<h1>Chapter 326: A Date With The Little Bun</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 326: A Date With The Little Bun</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Yan Ruyi hesitated at first, but she agreed in the end for Little Treasure's sake, \"Don't let Tingxiao know, or else he's going to get angry again!\"</p><br/><p>\"I think he's been the victim of a spell by that woman! Wait till we choose the candidates. We'll let him go on a blind date immediately! I don't believe that with so many brilliant girls out there, none can compare to her!\"</p><br/><p>...</p><br/><p>After she left the company, Ning Xi went straight home to her apartment. As she was laying on her bed browsing entertainment news, she got an unknown call.</p><br/><p>She picked it up suspiciously, \"Hello?\"</p><br/><p>An uptight male voice was heard from the other end of the phone, \"Hello, how do you do? Is this Miss Ning Xi?\"</p><br/><p>\"Yes, and you are?\" Ning Xi asked.</p><br/><p>\"I'm Mr. Lu's butler, Xing Wu. Today, Master and Madam are out on errands, the little Master is alone at home. I wonder if Miss Ning Xi would be free to come over?\"</p><br/><p>Ning Xi sat up immediately and replied, \"Yes! I'm free! I'll be there right away!\"</p><br/><p>After she hung up, Ning Xi quickly ransacked her wardrobe and almost tossed out all of her clothes, not knowing which one to wear...</p><br/><p>The way she acted was even more exaggerated than going to meet a boyfriend.</p><br/><p>Alas, she still chose a set of outfit style that she and Little Treasure liked. A fashionable one with the right vintage touch. Even though the designer was not someone famous, Ning Xi continued to be a loyal fan of his.</p><br/><p>She usually wore clothes as such, not expensive luxury pieces, unless it was for certain occasions. No matter the brand, she wore what she liked.</p><br/><p>When she reached the old residence, a 30 odd years old butler led her into the main residence. Just as Ning Xi walked in, a little tornado rushed towards her immediately and went straight to softly embrace her...</p><br/><p>\"Baby...\" Ning Xi immediately bent over to hug the little bun. She wanted to kiss him as she always did but since there were others around, she held herself back.</p><br/><p>When he did not received Aunty Xiao Xi's kiss, the little bun immediately looked down, disappointed.</p><br/><p>Aunty Xiao Xi did not kiss him this time. Was it because he had not done well? Was it because she did not like him anymore? Was it because there were other kids whom she preferred now?</p><br/><p>\"Miss Ning Xi, I shall make a move first. If you need anything, please ring the bell for me.\"</p><br/><p>Ning Xi nodded, \"Alright, thank you, Butler Xing!\"</p><br/><p>Xing Wu took a bow, and then left.</p><br/><p>After Xing Wu left, Ning Xi very quickly noticed the little guy's unhappiness. She laughed and brushed the little bun's nose, then kissed on both of his cheeks, \"My baby Little Treasure, Aunty misses you so much!\"</p><br/><p>The little bun immediately lightened up, with pursed lips and his face slightly reddish. It was as if a flower had bloomed from his face. Aunty Xiao Xi still liked me!</p><br/><p>The little bun thought for a while, then started to seriously composed a very complete reply to Ning Xi. [Little Treasure misses Aunty Xiao Xi too!]</p><br/><p>Ning Xi was touched, then she saw Little Treasure quickly added on another sentence: [Father too]</p><br/><p>\"Uhh...\" Ning Xi did not expect Little Treasure to write that at all. She could not help but be stunned and felt her cheeks heat up.</p><br/><p>Little Treasure actually wrote this himself. Something weird was going on.</p><br/><p>Before this, Little Treasure would never mention others when he talked to her...</p><br/><p>\"Good boy!\" Even though Ning Xi was slightly suspicious, she did not give it much thought. She touched the little bun's head and led him to sit on the sofa.</p><br/><p>At the same time, in the courtyard's surveillance room, Lu Chongshan and Yan Ruyi watched the surveillance footage with full focus.</p><br/>\n</div>"}