{"title": "Chapter 323: Bite Her To Death", "id": 323, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-323-bite-her-to-death", "volume_title": "Volume 4", "body": "<h1>Chapter 323: Bite Her To Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 323: Bite Her To Death</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Jiang Muye pulled an annoyed face and simply replied her, \"Mmm.\"</p><br/><p>The entertainment circle was a place where qualification mattered a lot, and since she was a senior, Ning Xi as her junior had to greet her.</p><br/><p>\"Hello, senior!\"</p><br/><p>Su Yimo acted like she did not notice anything, and kept on talking to Jiang Muye without even glancing at her.</p><br/><p>\"Xiao Ye, I heard that you took on a game endorsement?\"</p><br/><p>Ning Xi did what she should, and since Su Yimo chose to ignore her, there was no reason to continue pestering.</p><br/><p>\"What about it?\"</p><br/><p>Su Yimo raised her eyebrows, \"Why are you suddenly interested in endorsing a game?\"</p><br/><p>\"Just helping out my junior over here.\"</p><br/><p>Su Yimo suddenly put on a serious face after hearing what he said, \"Xiao Ye, I don’t know what your manager is thinking, but in your current position, taking an endorsement like this and working with people of that level will really affect your image. I hope that you can reconsider your decision!\"</p><br/><p>Jiang Muye could not stand it anymore, and faked a laugh, \"Haha, Miss Su, you’re a bit too controlling, aren’t you? And next time please call me Jiang Mu Ye, not Xiao Ye!\"</p><br/><p>Su Yimo did not look very happy, \"Xiao Ye, I know you don’t like people controlling you, but it's for your own good.\"</p><br/><p>Seeing how awkward the atmosphere was getting, Zhao Meixin spoke up, \"Yimo is the person to go to regarding endorsements! She has just sealed herself the main endorsement of Chanel in the central region, and the Lu corporation is looking to continue her contract as well… Ah, she’s been real busy!\"</p><br/><p>\"Xiao Ye, I’ve been through this before and I think you really should listen to me. I’ll take my leave first for now, talk to you again sometime.\"</p><br/><p>She continued to ignore Ning Xi as she just nodded coldly at Jiang Muye and left.</p><br/><p>Once they left, Jiang Muye exploded on the spot, \"What the heck! Who’s Xiao Ye?! Xiao Ye is not for her to use! She's even daring enough to meddle with my business! She really thinks that she’s my aunt now! If it weren't for her saving Little Treasure before, I'd have fallen out with her already! Ning Xiao Xi, go and bite her to death!\"</p><br/><p>Ning Xi was speechless, \"Can you please not make it sound like I’m a dog?\"</p><br/><p>Jiang Muye started prattling on, \"Ning Xi, you don't know the least of it. Uncle has never mentioned to Su Yimo that she saved Little Treasure. He just casually ordered people to give her a boost in her career.</p><br/><p>\"She just thought so highly of herself, always assuming that my uncle was head over heels for her and hence backed her up. She almost self-declared herself as Mrs. Lu! The tone that she uses to talk to me every time is disgusting!\"</p><br/><p>Ning Xi looked at the direction Su Yimo walked towards, \"As long as she didn’t do any harm to me, I won’t do anything either. But seeing her attitude, it’s near impossible to keep peace with her, and we are bound to clash heads one day.\"</p><br/><p>Jiang Muye quickly replied, \"Don’t back down! Fight for it! I’m your strongest backup shield! I’d rather you become my aunt than her!\"</p><br/><p>\"...Thanks?\"\"</p><br/><p>In the car.</p><br/><p>Zhao Meixin carefully took out an exquisite gift from the back seat, \"Yimo, this was sent by Ning Xueluo’s manager this morning. Ning Xueluo is against Ning Xi now because of that incident previously. Now that they are suddenly trying to get on our good side, I suppose they probably want to collaborate.\"</p><br/>\n</div>"}