{"title": "Chapter 321: I Have Good News", "id": 321, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-321-i-have-good-news", "volume_title": "Volume 4", "body": "<h1>Chapter 321: I Have Good News</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 321: I Have Good News</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The next morning.</p><br/><p>With such a deep sleep, Ning Xi slept until she woke up naturally.</p><br/><p>She absentmindedly recalled last night's incident and almost thought she had dreamt it up.</p><br/><p>That was, until she dragged her feet in her slippers and walked to the closet...</p><br/><p>She had not closed the hidden room last night, leaving it opened just like that, entering her view with no reservations.</p><br/><p>Ning Xi was speechless.</p><br/><p>Turns out that it had not been a dream after all...</p><br/><p>Initially, she really thought it was worthless, hence she accepted it. But what should she do now?</p><br/><p>And this closet...</p><br/><p>Ning Xi's head was still hurting when suddenly her phone rang, it was Ling Zhizhi.</p><br/><p>\"Hello, Sister Zhizhi?\"</p><br/><p>\"You're on holiday today, right? Are you free now? If you have nothing on, come drop by the company for a while.\"</p><br/><p>\"Nothing much on. I'll be there right away!\"</p><br/><p>Ning Xi got ready and rushed to the office.</p><br/><p>At the same time, at Glory World Entertainment, Ling Zhizhi's office.</p><br/><p>\"Jeez! Why do I keep losing at everything I play?\" Jiang Muye lay on the sofa opposite the desk and irritatedly tossed the game console in his hand. \"Where's Ning Xi? What time is she actually coming?\"</p><br/><p>In the midst of processing documents, Ling Zhizhi replied without even lifting her head up, \"Already on the way.\"</p><br/><p>Jiang Muye sat up and squinted his eyes thoughtfully at the calm woman at her desk. He was not sure why but suddenly his heart was filled with dissatisfaction, \"Ling Zhizhi! There's no one else here, stop pretending to be so distant.\"</p><br/><p>Ling Zhizhi shot him a brief look and ignored him.</p><br/><p>Annoyed by her attitude, Jiang Muye became even angrier, then he suddenly laughed sarcastically, \"Pfft, what was it you told Ning Xi again the last time? That you and I are innocently just artiste and ex-manager? You're really good at acting, why don't you just be an actor?\"</p><br/><p>Ling Zhizhi finally looked up and stared straight at him, replying him with three words, \"Was I wrong?\"</p><br/><p>Jiang Muye was just about to say something when Ling Zhizhi replied with a question, \"Or, do you prefer that I tell Ning Xi a different truth?\"</p><br/><p>He suddenly reddened and stood up instantly, \"You...\"</p><br/><p>Outside the door, someone knocked.</p><br/><p>Jiang Muye clammed up and went to open the door. He irritatedly complained to the person outside the door, \"You're so damn slow! I've already died a few times in the game!\"</p><br/><p>Ning Xi looked at him scornfully and replied, \"Are you sure your dying a few times has anything to do with my speed of reaching here?\"</p><br/><p>\"Enough with the nonsense, let's get down to business. When we're done talking, I still need to go get my latest equipment!\"</p><br/><p>\"You only know how to play games. I think you should just get married to your game console in the future!\" Ning Xi rolled her eyes at him, then walked in and sweetly greeted Ling Zhizhi, \"Sister Zhizhi, I'm here.\"</p><br/><p>As always, she changed her expressions so quickly, that Jiang Muye was dumbfounded.</p><br/><p>When she saw Ning Xi, Ling Zhizhi's face softened, \"Sit. Today, I've called you over to tell you some good news.\"</p><br/><p>\"Good news? What good news?\" Ning Xi immediately perked up.</p><br/><p>\"I've just accepted a job on your behalf to be a spokesperson.\"</p><br/><p>Ning Xi was giddy with excitement, \"Really?! I can be a spokesperson? But I still have a drama not released yet!\"</p><br/><p>Ling Zhizhi explained, \"You are popular enough. It's just that most companies like to wait and see, so this opportunity is considered a lucky coincidence. After the news of you and Jiang Muye's all-night gaming was photographed by a netizen, the gaming company which owns the game that you guys played got in touch with me. We have been negotiating and we have just sealed the deal yesterday!\"</p><br/>\n</div>"}