{"title": "Chapter 338: She Seemed More Attractive", "id": 338, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-338-she-seemed-more-attractive", "volume_title": "Volume 4", "body": "<h1>Chapter 338: She Seemed More Attractive</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 338: She Seemed More Attractive</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Hey girl, Mister Li is asking you to come over, didn't you hear us?\"</p><br/><p>When Ning Xi did not respond at all, the young men in front of Mister Li became unhappy and their tones instantly turned unfriendly.</p><br/><p>They completely did not expect the woman not to move an inch despite several invitations and she continued with her drink, as if she did not hear them at all.</p><br/><p>\"You bitc-\"</p><br/><p>Before he could finish cursing her, Mister Li reached out to tap his shoulder and laughed, \"This is not the way to flirt with girls. The process of conquering is to be enjoyed, understood?\"</p><br/><p>When he heard what Mister Li had to say, the youth laughed, \"Mister Li, you're telling me that I'm too rushed. We can't deal with girls like these. We will need Mister Li to personally do this himself. We bros will just watch and learn from the side. Next time, we'll definitely not embarrass you!\"</p><br/><p>Mister Li nodded his head with a satisfied expression, and said with a tone of seniority, \"To pick up girls like this one, you can't rush it, you have to take it slow!\"</p><br/><p>After he said that, he evaluated Ning Xi with a look, then walked back to his VIP seat with the guys.</p><br/><p>Ning Xi saw that the men did not continue to flirt with her, so she did not pay anymore attention. She continued to enjoy her drink and listened to relaxing music.</p><br/><p>She depicted a sort of couldn't-be-bothered attitude in such a relaxed situation, and that seemed to make her appear more attractive...</p><br/><p>...</p><br/><p>While she was waiting for her bill, Ning Xi logged on to her Weibo.</p><br/><p>She noticed that she had not updated her Weibo for a long time. Since the drama would be launched soon, it would be good to stir up her popularity a little. She thought for a while, then wrote a post and uploaded it:</p><br/><p>[As I listen to wind and rain against my window at night, the dreams start to come! Counting down to the launch!]</p><br/><p>Very soon, comments and 'likes' started coming in and many of the drama team members shared it too.</p><br/><p>Jiang Muye shared it and added on: [Through thick and thin over ten years, as they worry less and forget themselves], which very accurately reflected Meng Changge and Sun Huanqing's tragically touching relationship.</p><br/><p>As soon as Jiang Muye posted, all the fans online immediately exploded and started to discuss Meng Changge and Sun Huanqing, the ultimately popular couple shipped by many.</p><br/><p>At the same time, at Carlos bar's highest floor VIP room.</p><br/><p>Lu Tingxiao was just drinking when the phone on the table buzzed with a notification sound. He clicked on it to see a new Weibo notification. It was the status that Ning Xi had just posted.</p><br/><p>He had set Ning Xi's profile to be a favourite and even set a program in his phone so that whenever Ning Xi updated, it would automatically buzz with a notification to remind him.</p><br/><p>Lu Jingli who saw this was quite amazed, \"Wow, brother, you really are too much! You even have a special setting to watch her every move. I really can't understand you logical men's idea of romance...\"</p><br/><p>Lu Tingxiao ignored his brother and focused on Ning Xi's Weibo status.</p><br/><p>\"It's only such a short sentence, you wouldn't be able to decipher anything...\" Lu Jingli mumbled softly.</p><br/><p>Then, he watched his brother's long slim fingers type a message to send to Ning Xi.</p><br/><p>Lu Jingli daringly took a peek to see what was written, then closed his eyes and rolled over on his seat, \"Ahh, damn it!!! My eyes!!! My precious eyes!!! I shouldn't have peeked!\"</p><br/><p>He was really looking for it. He thought that his brother was currently in an heartbroken situation, so reading it would not be a torture, but who knew that it was way worse!</p><br/>\n</div>"}