{"title": "Chapter 348: “The World” Ended", "id": 348, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-348-the-world-ended", "volume_title": "Volume 4", "body": "<h1>Chapter 348: “The World” Ended</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 348: “The World” Ended</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I didn’t hear it wrong, did I? You said you were going to be the sous chef, so who is the head chef? Who is qualified enough for you to become his or her assistant?\"</p><br/><p>\"To be able to become this person’s assistant is my honor,\" Alain spoke with respect.</p><br/><p>The other chefs were in disbelief. To be able to make Alain voluntarily become the sous chef, they could stab a guess at who this master was. But to be able to invite this master was another ball game altogether, so who was hosting this dinner?</p><br/><p>Out of curiosity, one of the chefs asked, \"I wonder whose dinner are you preparing for this time?\"</p><br/><p>Alain was not sure, \"I didn’t ask much, I only know that one of them is a lady called Ning Xi.\"</p><br/><p>\"Ning Xi? Who is that?\" Everyone looked at each other in confusion. Suddenly, one of them remembered something and asked, \"Your student, William Fee, is from Country C as well. Maybe he might know who this honorable lady is. Will he be joining her for dinner?\"</p><br/><p>\"William?\" Alain asked, then shook his head, \"If I've been appointed as just the sous chef, he wouldn’t be qualified.\"</p><br/><p>\"Ohh…\" Everyone's respect for Alain swelled.</p><br/><p>…</p><br/><p>Ning Xi had no idea about this change in the Michelin-starred kitchen. She was focused on discussing her scene with Guo Qisheng and the screenwriter Ye Linglong.</p><br/><p>After some time preparing, Ning Xi gathered her confidence, took a deep breath and told Guo Qisheng, \"Director, I can do it now!\"</p><br/><p>\"Good!\" Guo Qisheng patted her shoulder and said, \"Let’s begin!\"</p><br/><p>Guo Qisheng informed all the departments to set up, then used the loudspeaker to shout, \"Three, two, one! Action!\"</p><br/><p>Everyone went silent when the shooting started.</p><br/><p>It was finally the last scene, the ending for \"The World\". All three of them were dead: the spy, Princess Xian and the corrupted emperor…</p><br/><p>Meng Changge finally got her revenge.</p><br/><p>Her next target for revenge was the world that had abandoned and betrayed the brave souls in her Meng family. Yet, at the last moment, with the blood of historical generals in her lineage, she could not bring herself to do it.</p><br/><p>In the end, she chose to jump off the cliff, and in doing so, granted the male protagonist’s wish…</p><br/><p>Ning Xi struggled a lot with this scene as she could not decide what feelings to portray when Meng Changge committed suicide.</p><br/><p>Was Meng Changge feeling angry, was she unwilling, or was she in despair?</p><br/><p>Ning Xi almost went crazy thinking about this.</p><br/><p>Nevertheless, Ning Xi performed the scene perfectly.</p><br/><p>Meng Changge was dressed in a bright red bride outfit, as she held Sun Huanqing’s memorial tablet to her chest. She was devoid of any anger and reluctance, and neither was there any despair nor nostalgia. She just had the apprehension of a little girl on her face, as if she was reliving her first meeting with Sun Huanqing. She closed her eyes, put on a contented smile, and jumped down…</p><br/><p>The way Ning Xi chose to portray the character was to perform as her original true self. She turned Meng Changge into the carefree little girl she once was in her final moments.</p><br/><p>The scene of jumping off the cliff was extremely poignant. There was not an obvious element of sadness, but almost everyone at the set teared up, feeling empty, and felt like they had lost something important...</p><br/><p>The original ending was to have Meng Changge die in the hands of the male and female protagonist. Yet, after this rearrangement, while it only seemed like a difference between suicide and homicide, it set a completely different tone to the ending.</p><br/><p>The last scene was finished.</p><br/><p>\"The World\" had ended.</p><br/>\n</div>"}