{"title": "Chapter 340: Morons Full Of Themselves", "id": 340, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-340-morons-full-of-themselves", "volume_title": "Volume 4", "body": "<h1>Chapter 340: Morons Full Of Themselves</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 340: Morons Full Of Themselves</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"That won’t work, even if we promised you, Sis Lan wouldn't, right, Sis Lan?\" one of the girls said, looking at the lady beside her.</p><br/><p>The lady came forward and stared at Ning Xi, then said coldly, \"It must be hard for you, coming to Carlos bar this late, and dressing up like this, you must have spent quite some money. I can’t let you go back empty handed, this is a reward…no, a compensation for you!\"</p><br/><p>As the lady finished talking, she opened her Hermes purse and took out a stack of cash, then threw it beside Ning Xi’s foot, \"Five thousand, is that enough?\"</p><br/><p>\"Sis Lan, you’re so generous! Even if it hit her just now, five thousand would have been enough!\"</p><br/><p>\"Right, our Sis Lan is really generous. Even if she was a whore, it would be enough for one go!\"</p><br/><p>The few girls were full of sarcasm as they laughed coldly at her.</p><br/><p>In the bar, the scene was getting more and more heated up, as more people surrounded them. Mister Li smiled, continuing to enjoy his alcohol nonchalantly, waiting for the best time to step up.</p><br/><p>Ning Xi frowned slightly, these women were not here to apologize. They were obviously only there for trouble.</p><br/><p>\"What, is it not enough? For prostitutes like you, your price of sleeping with those old men would at most be around this price, wouldn't it?\" The lady stared at Ning Xi in disgust.</p><br/><p>Without waiting for Ning Xi’s reply, \"Bam!\", another stack of cash was thrown beside her leg again.</p><br/><p>\"Here’s ten thousand, plus the five thousand earlier, that makes it fifteen thousand, is it enough now?\" the lady laughed coldly again.</p><br/><p>\"Eh, Sis Lan, this is too much. I think three thousand would be enough. Women like her who see how rich you are will surely try to get more from you!\"</p><br/><p>\"Sis Lan is just too kind, why not add another ten thousand, make it 25 thousand!\"</p><br/><p>\"25 thousand? I like this number.\" The lady continued smiling coldly, while she took out another stack of cash and threw it at Ning Xi again.</p><br/><p>Ning Xi evaluated the woman in front of her, like she was looking at an idiot. People like her had too much money lying around; what they wanted was just attention.</p><br/><p>Too bad, she did not care about her. Too bad, they were too much of a moron, she did not even have the interest to insult them, because it would not feel good to insult morons.</p><br/><p>\"Pretty girl, just accept the money. 25 thousand isn’t much, but it’s better than suffering throughout the night!\" A muscular, blonde haired, blue-eyed man squatted down and collected all the money on the floor. He was prepared to give it to Ning Xi, and even gave her an ambiguous glance.</p><br/><p>\"Thank you, but I don’t think I need this compensation,\" Ning Xi replied coldly.</p><br/><p>\"Witch!\" the lady started scolding angrily and was clearly infuriated, \"I’m just pitying you so I’m compensating you kindly, and now you’re even seducing my Chengyun!?\"</p><br/><p>She was ticked off earlier because her male partner kept on looking at this woman’s direction, and now this woman was seducing Chengyun right in front of her. Who did she think she was?</p><br/><p>Ning Xi really did not want to talk to them anymore, but they kept on pestering her and her patience had reached its limit. She sneered and looked at the Caucasian guy like she was looking at a cheap slab of pork, \"Me, seducing him?\"</p><br/><p>\"Cut the crap! Of course it was you who seduced him, not the other way around!\"</p><br/><p>\"You're still looking! Have you never seen a handsome guy before in your life? Do you really need to salivate like this?\"</p><br/><p>\"Tsk! She must have slept with so many old men that she has yet to see someone this handsome before.\"</p><br/>\n</div>"}