{"title": "Chapter 353: The Most Tempting Gift", "id": 353, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-353-the-most-tempting-gift", "volume_title": "Volume 4", "body": "<h1>Chapter 353: The Most Tempting Gift</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 353: The Most Tempting Gift</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After the proposal, the next highlight would be the dishes of the night.</p><br/><p>There was no shortage of food aficionados tonight, including some food columnists and famous food bloggers, all of them excitedly anticipating the main chef William Fee.</p><br/><p>Just the banquet itself was already stellar enough for the headline.</p><br/><p>Unexpectedly, among the crowd, Fang Ya yelled, \"Ah, I suddenly remembered something!\"</p><br/><p>Fang Ya's loud voice drew the attention of almost everyone.</p><br/><p>As she had everyone’s attention, she faked curiosity and looked at Ning Xi who was in the corner, \"Ning Xi, didn’t the romantic admirer who wrote you the love letter yesterday mention that he was going to give you a surprise? Why haven’t we seen anything yet?\"</p><br/><p>Upon this reminder, the crowd got excited and the hall was filled with chatter.</p><br/><p>\"Right, the love letter even mentioned that he would prepare something that was most honorable, most tempting, and make one wouldn’t able to resist it!\"</p><br/><p>\"He's got all of us curious, how exciting!\"</p><br/><p>…</p><br/><p>\"What surprise? Is there going to be another surprise?\" some confused media reporters asked.</p><br/><p>\"Well, it’s our other lead actress, Ning Xi. Yesterday, she received a passionate love letter!\" explained Fang Ya, taking out a pink letter.</p><br/><p>When she saw the letter, Xiao Tao turned pale and exclaimed, \"How in the world...? I’ve already thrown the letter away! How did she get it?!\"</p><br/><p>Ning Xi frowned.</p><br/><p>\"Sis Xi, it was my fault. I shouldn’t have just thrown it away, I should have destroyed it! How...what should I do now…\" Xiao Tao anxiously stammered.</p><br/><p>Ning Xi patted her back and comforted her, \"It’s okay, it was just a love letter. Fang Ya publicly violated my privacy and the media won't take too kindly to that. We can fight back later on!\"</p><br/><p>Xiao Tao was about to cry, \"But you’ve already lost face...there are so many people today...it’s all my fault…\"</p><br/><p>Fang Ya recited the contents of the letter all over again to the public, and even passed the love letter around. Almost everyone read through it, and there was even a reporter taking pictures of it while laughing hard…</p><br/><p>Su Yan raised his brows, \"Does Xiao Xi’s admirer have some sort of mental problem? Will she be okay?\"</p><br/><p>Ning Xueluo hid her evil grin, \"From the tone of the letter, it’s a little odd, most probably from a poor pleb that found mental support by worshipping celebrities. There are actually a lot of people like that, it's just Ning Xi's luck that that guy chose her…\"</p><br/><p>When Fang Ya finished reading, she walked up to Ning Xi, \"How was it, Ning Xi? Why don’t you say anything? Where’s your surprise? Everyone’s waiting!\"</p><br/><p>\"Yeah, yeah! Urge him for the surprise! We’re really looking forward to it!\"</p><br/><p>\"Speaking of which, that pleb wouldn’t really send a truck of cornbread, would he?\"</p><br/><p>\"I’ve never really eaten cornbread before! Looks like I'll get to try something new tonight…\"</p><br/><p>…</p><br/><p>A lot of people were taking pictures, and some even took live videos. Everyone waited to watch what was going to happen.</p><br/><p>In the corner, Xiao Tao was really embarrassed and blamed herself, crying profusely. Ning Xi could not stand girls crying, so she tried really hard to comfort her. Then, there happened to be an annoying reporter who saw Xiao Tao and rudely pointed his camera in front of Xiao Tao’s face…</p><br/><p>As Ning Xi was going to tell the reporter off, \"Bam!\", the door to the banquet hall opened from outside.</p><br/><p>Everyone looked over to see the owner of the hotel himself standing at the doorstep, followed by a tall and heavy-built male Caucasian...</p><br/>\n</div>"}