{"title": "Chapter 378: A Sleepless Night", "id": 378, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-378-a-sleepless-night", "volume_title": "Volume 4", "body": "<h1>Chapter 378: A Sleepless Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 378: A Sleepless Night</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli’s eyes were sharp. When he went into gossip mode, his eyes transformed into the all-seeing eagle's eyes. He actually already saw what the contents of the messages and he touched his chin contemplatively.</p><br/><p>YS…</p><br/><p>As expected it was that fellow!</p><br/><p>Tsk! Good, tonight’s mission was accomplished!</p><br/><p>Of course, it could have been done better!</p><br/><p>Li Jingli started his questioning again, \"Xiao Xi Xi, which dishes from the two masters did you think tasted better?\"</p><br/><p>Ning Xi was going to collapse in frustration; it was her third time facing this question in a short span of time!</p><br/><p>Do not ask these trap questions again, please!</p><br/><p>This was not a compulsory question, it was more of a question with a dead end…</p><br/><p>Ning Xi stared at him harshly, \"Shut up! No more questions! It’s late now! You’ve eaten your fill, and you've got your gossip! Go back quickly! If not, I’m going to complain to your brother that you’re still troubling me in the middle of the night!\"</p><br/><p>Lu Jingli backed off with fear, \"How could you do this to me, Xiao Xi Xi? You’ve changed!\"</p><br/><p>\"So are you leaving or not? I’m going to call him right now!\" Ning Xi threatened him by holding up her phone.</p><br/><p>Lu Jingli’s eyes went teary but for his own personal safety, he ran away quickly!</p><br/><p>When she saw that Lu Jingli had finally left, Ning Xi was relieved.</p><br/><p>She was still sleepy earlier, but after Lu Jingli’s visit and the few messages she received, it seemed like tonight would be a sleepless night…</p><br/><p>But it would not just be Ning Xi having a sleepless night alone…</p><br/><p>---</p><br/><p>Platinum Palace.</p><br/><p>Lu Jingli opened the door to the study room and panted while leaning on the door frame, \"Bro! I’m back! I risked my life to get you some information!\"</p><br/><p>Lu Tingxiao looked up from a pile of documents, raising his eyebrow at the sight of the traces of dessert on Lu Jingli’s face.</p><br/><p>\"Uhh…\" Lu Jingli quickly cleaned it up with his sleeves, \"Ah, it was sister-in-law, she’s just too nice and brought back a box of desserts for me. I didn’t want to eat it actually, but she insisted!\"</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>\"Hehehe, bro! I’ve got some really important information here! Do you want to hear about it?\" Lu Jingli gave a cheeky expression, \"If you invite Elder Cai to make a meal for me, I’ll tell you immediately!\"</p><br/><p>Lu Tingxiao ignored him and continued to work.</p><br/><p>\"What! Bro, you really don’t want to know? Really? Then I won't talk!\"</p><br/><p>One second…</p><br/><p>Two seconds…</p><br/><p>Three seconds passed…</p><br/><p>\"Fine! Since we’re brothers, I’ll tell you!\" Actually, he just could not contain himself, not even for three seconds…</p><br/><p>Lu Jingli quickly said, \"Bro, I'll tell you, the person who wrote the embarrassing love letter, prepared the surprise for Xiao Xi Xi and invited Danial over was as expected, the coward alphabet man YS! Oh, right, you sent Xiao Xi Xi a message just now, didn't you? That fellow sent her a message at the same time as well, and the content was the same! Both of your hearts sure resonate together…\"</p><br/><p>Lu Jingli sighed and mumbled, \"That guy is already starting to take action, and I am sure he will continue courting her. This time he invited a chef, the next time he might be reviving a person! Bro, your future of getting yourself a wife doesn’t seem too bright!\"</p><br/>\n</div>"}