{"title": "Chapter 372: Battle Of The Century", "id": 372, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-372-battle-of-the-century", "volume_title": "Volume 4", "body": "<h1>Chapter 372: Battle Of The Century</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 372: Battle Of The Century</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Cai Fengxian let out a long sigh, he recalled the old times, \"It has indeed been a long time, our last meeting was 10 years ago at Country F!\"</p><br/><p>\"Yes, that's right.\"</p><br/><p>\"At our age, I’m afraid that we might not have another 10 years. Since it’s a rare occasion that you come to China, do you want to pick up where we left off 10 years ago in the battle which ended in a tie?\" Cai Fengxian’s eyes shined.</p><br/><p>\"Of course!\" Danial agreed instantly.</p><br/><p>…</p><br/><p>The hotel owner was very excited when he heard their conversation.</p><br/><p>At first, he was planning to boost the hotel’s popularity using Su Yan’s proposal to Ning Xueluo, and the development of the events that night was way unexpected, benefiting him.</p><br/><p>A proposal gimmick would be no comparison to \"The Battle of the Century between the Masters of Western and Chinese Cuisines at the Royal Jazz Hotel\".</p><br/><p>What a great deal!</p><br/><p>He would really like to thank Ms. Ning Xi in person. Although she was quiet, she was not stingy at all!</p><br/><p>Suddenly, a big crowd of journalists came rushing in, trying to get into the banquet hall.</p><br/><p>The hotel’s security team and the waiters helped to block them, \"Where are all of you from? This is a private banquet, you can’t enter without invitation!\"</p><br/><p>\"I’m XX food channel’s reporter!\"</p><br/><p>\"I’m a photographer from XX newspaper!\"</p><br/><p>\"I’m an editor from XX magazine!\"</p><br/><p>\"I heard that both Mr. Danial and Elder Cai are here tonight and I purposely made my way here! Let us in!\"</p><br/><p>…</p><br/><p>The journalists begged tirelessly.</p><br/><p>The security team and waiters were troubled, \"Well, we can’t! It’s our rule!\"</p><br/><p>\"Rules are set by people, be more lenient!\"</p><br/><p>\"Yeah! We’re all experienced journalists, not just your random news reporter! You could go on and ask your manager, he would definitely agree!\"</p><br/><p>\"This...uh, please wait for a while, I’ll go ask.\"</p><br/><p>The number of journalists was extraordinary and even with the additional security, they could not fend off the journalists’ passion.</p><br/><p>One of the waiters went to quickly consult the manager.</p><br/><p>\"This is good publicity for the hotel! But the two masters tonight are too important, we simply can’t decide!\"</p><br/><p>The manager was not able to make a decision, he then proceeded to talk to the owner.</p><br/><p>\"There are a lot of journalists outside now wanting to come in. Boss, what do you think?\"</p><br/><p>The hotel owner was delighted but he could not make this decision himself as well, so he then went to look for the organizers from the crew.</p><br/><p>Knowing the owner’s intention, Wang Tai and Guo Qisheng had a short discussion with the team. They all thought that it would be a good opportunity to promote their movie, so they agreed on the spot.</p><br/><p>And now, what was left were the opinions of the two involved party.</p><br/><p>The hotel owner rubbed his hands and walked towards the two masters, explaining the situation to them, and he asked nervously, \"These journalists are here for the both of you. I was wondering if you’d welcome their attendance here.\"</p><br/><p>Danial and Cai Fengxian looked at each other, then looked at Ning Xi together.</p><br/><p>Danial spoke first, \"I’m here for the beautiful Ms. Ning Xi and her honorable guests. If they are her guests, then I have no objections!\"</p><br/><p>Which meant that unless the journalists were invited by Ning Xi as her guests, Danial would reject their presence.</p><br/><p>\"This…\" The hotel owner looked troubled, he then looked at Cai Fengxian, \"Elder Cai, what about you?\"</p><br/>\n</div>"}