{"title": "Chapter 388: An Initiated Hug!", "id": 388, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-388-an-initiated-hug", "volume_title": "Volume 4", "body": "<h1>Chapter 388: An Initiated Hug!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 388: An Initiated Hug!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Lu Tingxiao continued to talk, his tone became serious, \"So, Ning Xi, don’t overestimate my vulnerability. Don’t avoid me because of that. I’ll guarantee that no one can hurt me and that no one can use this to threaten you to make you stay away from me!\"</p><br/><p>When she heard this, Ning Xi finally understood what he meant and felt her heart sink a little.</p><br/><p>Lu Tingxiao slowly let her go and held her shoulders to make her look into his eyes. He then said intensely, as if to carve his words onto her heart, \"Ning Xi, I’ve said so much just to tell you that no one and nothing can affect your decision. The only thing you need to decide on is me, and the only one thing to ascertain is if you like me.</p><br/><p>\"If it’s because you can’t love me, then I’ll accept it and this reason is the only reason I can accept.</p><br/><p>\"One more thing, and most importantly, Ning Xi, I am an adult, I can take responsibility for all my actions. No matter what I do, it comes from my heart and it’s all voluntary.</p><br/><p>\"Even though the person I like is you, in a way, my feelings for you have nothing to do with you. So you don’t have to feel pressured at all. I will wait for you, wait for the day that you fall in love with me. Understand?\"</p><br/><p>Ning Xi smiled bitterly as she buried her face in her hands. Whoever said Lu Tingxiao was not good with his words? He could practically participate in the national debate competition, since he was always saying things that hit her right in her soft spot.</p><br/><p>In her heart, a voice replied softly, \"Lu Tingxiao...You don’t have to wait actually…I’ve already fallen in love with you!\"</p><br/><p>Only, she didn’t have the strength to defeat all that had happened years ago.</p><br/><p>To tell him the truth, to reveal the fact that she had been raped and had given birth to a stillborn was but only one easy sentence.</p><br/><p>But what she could not handle was how he would react to the news.</p><br/><p>Even if she believed that Lu Tingxiao would have a heart big enough that he would be okay with this, who would be willing to unashamedly reveal their own tarnished past in front of the person they loved the most?</p><br/><p>She could not even handle the thought of it…</p><br/><p>She would much rather be the best version of herself in his eyes…</p><br/><p>The man in front of her was too good, simply too good. He deserved to have the best, for the best woman to be his wife…</p><br/><p>Yet, when she thought about this, in the deepest corner of Ning Xi’s heart, she felt a wave of thought and impulse that she had never experienced before!</p><br/><p>Yes, the man in front of her should have the best!</p><br/><p>Why couldn’t she become the best then?</p><br/><p>She could be so good that one day, she could defeat her past, defeat the low self-esteem within her and stand tall beside him!</p><br/><p>She would not be his Achilles’ heel but she would be his armor instead!</p><br/><p>\"Ning Xi...Ning Xi?\" Lu Tingxiao was a little worried when she did not reply him for a long time.</p><br/><p>The gentle voice beside Ning Xi’s ear made her return to her senses from the turbulent chaos within her heart. Her eyes glowed like never before, \"Yes, Lu Tingxiao, I understand now!\"</p><br/><p>Lu Tingxiao was slightly stunned as he watched this girl glow fiercely, and his heart was moved. Even though he did not know what she was thinking about at this moment, he was still affected by her emotions. \"Okay.\"</p><br/><p>When she had thought things out, Ning Xi felt like she was given a new life. Apart from her dreams, she now had another wonderful thing that was worth her hard work in life!</p><br/><p>Before her brain could react, Ning Xi’s body had already moved in to initiate a hug with Lu Tingxiao. Though it was quick and it was only a light one within half a second, it was still a hug.</p><br/>\n</div>"}