{"title": "Chapter 385: Daddy Is So Mean", "id": 385, "volume": 4, "url": "http://boxnovel.org/hidden-marriage-chapter-385-daddy-is-so-mean", "volume_title": "Volume 4", "body": "<h1>Chapter 385: Daddy Is So Mean</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 385: Daddy Is So Mean</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi panted as she rushed over and squatted down to hug the little bun. Then, she stuffed something into his hands and said, \"I'm so tired, it's a good thing I made it! Baby, take this, I was just learning from some masters last night, so I woke up early this morning to make you a love-filled bento box. It's your first day of school, good food can motivate you!\"</p><br/><p>When in reality...</p><br/><p>She had initially decided not to come when she sent that message last night, but her body seemed adamant not to be controlled by her brain. She automatically woke up early this morning and started to busy around in the kitchen.</p><br/><p>When she finally realized what she was doing, she had already finished making the cutest little bento box!</p><br/><p>Sigh, her heart was filled with love for the little bun, there was no way she could control herself!</p><br/><p>Especially when she thought about how the little bun would be waiting for her, and his disappointed little face when she would not appear, her soul left her.</p><br/><p>Alas, her exhausted body had to follow her soul to rush over here...</p><br/><p>\"I'm sorry, baby! Did you wait very long?\" Ning Xi apologized.</p><br/><p>The little bun hugged the love-filled bento box tightly and immediately shook his head to indicate that he was not angry at all.</p><br/><p>Ning Xi was instantly relieved. She touched the little bun's head and said, \"Study well, and listen to what your teachers say!\"</p><br/><p>The little bun nodded hard.</p><br/><p>Mmm, it's so nice to go to school!</p><br/><p>He wanted to go to school!</p><br/><p>Lu Tingxiao could not help but feel himself smiling as he watched his son's emotions change faster than the flip of a page. He intentionally tried to expose him and said, \"I thought you said you didn't want to go school anymore?\"</p><br/><p>When Little Treasure heard, he immediately tensed up and shot his father a deadly look.</p><br/><p>Daddy is so mean! How could he expose him to Aunty Xiao Xi!?</p><br/><p>Exposing was the path of petty people!</p><br/><p>When Ning Xi heard, she blinked and quickly asked, \"Ah? Why not? Why don't you want to go to school anymore?\"</p><br/><p>Lu Tingxiao never liked to tolerate with his son's tempers, so he directly said in front of his anxious son, \"He's too temperamental.\"</p><br/><p>The little bun looked like he was struck by lightning. He was not going to talk to his father anymore!</p><br/><p>The little bun nervously looked at Ning Xi and was so anxious that he was about to cry because he was afraid that Aunty Xiao Xi would be angry and not like him anymore.</p><br/><p>When Ning Xi heard the explanation, she just nodded then nonchalantly said, \"So what? Little Treasure is still little! Being temperamental is part of growing up. It's okay, baby, you can continue to be temperamental as much as you want!\"</p><br/><p>Little Treasure's face glowed, then he delightedly looked at his father by his side.</p><br/><p>Indeed, Aunty Xiao Xi loves me the most!</p><br/><p>Lu Tingxiao looked at his son, then at Ning Xi and laughed softly looking down, \"Mmm, you're right.\" He had a look that seemed to say, \"Whatever my wife says is right! I am okay even if I am being teased by my son!\"</p><br/><p>Lu Tingxiao's smile was so striking that Ning Xi had to clear her throat and avoid that charming face. She quickly rushed Little Treasure, \"It's time to go for class, isn't it? Go on in quickly, baby! Don't be late now!\"</p><br/><p>Little Treasure looked at the school, then squeezed Ning Xi's hand tightly, clearly reluctant to leave her.</p><br/><p>At this moment, at the entrance of the school, there were still several reluctant children and their parents. They were all in shock...</p><br/><p>They watched in awe as the man who had frightened the children to tears earlier, seemed to soften when that girl appeared. His icy presence seemed to have melted and he seemed...not as scary anymore...and he even oozed a sort of warmth...</p><br/>\n</div>"}