{"title": "Chapter 406: Getting A Date", "id": 406, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-406-getting-a-date", "volume_title": "Volume 5", "body": "<h1>Chapter 406: Getting A Date</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 406: Getting A Date</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I’m sure, just follow my instructions. Also, be more welcoming to the guest,\" Cheng Feng reminded.</p><br/><p>\"Alright, noted!\" replied the secretary.</p><br/><p>As Cheng Feng finished his phone call, he saw his boss glanced at the factory head and said, \"Make it short, I’ll give you three minutes.\"</p><br/><p>The factory head was shocked.</p><br/><p>Three...three minutes?</p><br/><p>He held back his novel-long report and started to think really hard about how to compress his 30-minute speech into a three-minute report...</p><br/><p>Cheng Feng went back to Lu Tingxiao and saw the factory head’s painful expression, sighing.</p><br/><p>Be grateful that you were given three minutes!</p><br/><p>The boss had just made a date and it was a miracle that he did not give you just 30 seconds!</p><br/><p>In the end, the factory head quickly skimmed through the important parts like their cost and profit. Due to the sudden decrease in time and the boss’ scary expression, he stuttered a lot. When he was finished, he looked like he had failed everything in life…</p><br/><p>He had such a rare chance to present in front of the big boss, yet he had screwed it up…</p><br/><p>Lu Tingxiao looked at his watch, \"Mmm.\"</p><br/><p>Another \"Mmm\"?</p><br/><p>Did it mean that...he passed? Was it this easy?</p><br/><p>\"Let’s return to the office.\"</p><br/><p>The managers were surprised and they all followed Lu Tingxiao out like a team of cheerleaders…</p><br/><p>At the Lu Corporation company lobby.</p><br/><p>Ning Xi walked up to the counter, \"Hello, I’m here to find CEO Lu.\"</p><br/><p>To avoid being recognized, Ning Xi wore a white mask.</p><br/><p>\"Do you have any booking?\" the secretary asked without even lifting her head.</p><br/><p>\"No, but I…\"</p><br/><p>The secretary interrupted her before she finished her sentence, \"I’m sorry, if there isn’t any booking, you’d need to make one first! But you won’t be able to see him immediately, CEO Lu’s schedule is packed up for the three months.\"</p><br/><p>There were too many people with different excuses to see CEO Lu every day. There were even people who waited at the main door for a few days in a row. The secretary had seen too much of these already, which was why she always rejected people without any booking.</p><br/><p>\"But I’ve spoken to CEO Lu already.\"</p><br/><p>'Haha, spoken to him? Who are you! Do you think you can speak with him directly?\" thought the secretary to herself.</p><br/><p>As the secretary was about to reply her, she suddenly remembered Cheng Feng’s call, \"Wait...Miss, what is your surname?\"</p><br/><p>\"I’m Ms. Ning.\"</p><br/><p>The secretary instantly shifted to a welcoming attitude and put on a big smile, \"Ah! It’s Ms. Ning! Assistant Cheng has already informed me, follow me, I’ll lead the way!\"</p><br/><p>Ning Xi was speechless at the secretary’s shift in attitude, \"Thank you!\"</p><br/><p>The secretary was looking at this woman while she led the way.</p><br/><p>She wore a mask...how secretive…</p><br/><p>When she remembered Assistant Cheng’s tone on the phone, it seemed like this woman had a special relationship with CEO Lu…</p><br/><p>This was in addition to the rumors before about how the boss had finally found himself a woman…</p><br/><p>The rumors also said that the woman was the current popular artiste Su Yimo…</p><br/><p>Could it be her?</p><br/><p>But looking at her outfit, it did not seem like Su Yimo’s style.</p><br/><p>\"Ms. Ning, it’s here, please enter, I’ll get you a cup of tea!\"</p><br/><p>\"Thank you!\" Ning Xi thanked her before she walked into Lu Tingxiao’s office.</p><br/>\n</div>"}