{"title": "Chapter 405: The Boss’ Voice Could Be This Gentle", "id": 405, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-405-the-boss%E2%80%99-voice-could-be-this-gentle", "volume_title": "Volume 5", "body": "<h1>Chapter 405: The Boss’ Voice Could Be This Gentle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 405: The Boss’ Voice Could Be This Gentle</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi left the company cheerfully, texting Lu Tingxiao as she walked.</p><br/><p>[Tang Xiao Xi: Boss, are you available now? I have a favor to ask of you…]</p><br/><p>At the same time, in a car factory under Lu Corporation.</p><br/><p>A group of top managers surrounded the big boss with a cold face in a black suit. The factory head was blabbering non-stop to introduce the high-tech equipment in the factory, and he was bragging about his accomplishments…</p><br/><p>Halfway through, a phone rang, it sounded like a text message tone.</p><br/><p>Lu Tingxiao looked at the message, then he held up his hands to indicate he wanted some silence.</p><br/><p>The factory head was still talking until the deputy reminded him to stop.</p><br/><p>When they saw that their boss immediately made a call after receiving a text message, they looked at each other, could it be some emergency?</p><br/><p>On the other side, Ning Xi was anxious, unsure if Lu Tingxiao was busy or if she was troubling him…</p><br/><p>A few seconds later, Lu Tingxiao called.</p><br/><p>Ning Xi quickly picked up, \"Boss!\"</p><br/><p>\"Mmm, what’s up?\"</p><br/><p>The managers standing beside Lu Tingxiao were shocked when he started to talk. Who did he call? Had his voice always been this gentle?</p><br/><p>\"Well, there’s something I want to ask. Are you free to talk right now?\" Ning Xi asked.</p><br/><p>\"Yeap, sure.\"</p><br/><p>Everyone near Lu Tingxiao was speechless…</p><br/><p>\"Oh, I actually picked the script I want for my next project, but there wasn’t anyone to verify for me. Second Master went on a holiday and we can’t contact him at all, and I heard that he’ll only be back only after three months…\"</p><br/><p>Lu Tingxiao instantly understood, \"I’m currently inspecting one of my car companies and I'm finishing up. You can wait for me at the company, I’ll be back soon.\"</p><br/><p>Everyone was shocked again, the boss actually uttered so many words today…</p><br/><p>The factory head was especially dumbfounded. He thought about how he had talked so much earlier and only received a monosyllable reply!</p><br/><p>Which was \"Mmm\".</p><br/><p>What did he mean by \"finishing up\"? He had a lot more yet to be reported!</p><br/><p>\"Ah...you’re inspecting…\"</p><br/><p>Yet you said that you were free?</p><br/><p>Ning Xi quickly said, \"Okay then, I’ll wait for you at the company!\"</p><br/><p>\"Mmm,\" murmured Lu Tingxiao, he then looked at his personal assistant Cheng Feng and said, \"Make the arrangements for Xiao Fang to bring her directly into my office.\"</p><br/><p>\"Okay, I’ll do it right now!\" Cheng Feng had been by Lu Tingxiao’s side for a long time, and he knew that the boss was speaking to Ms. Ning Xi when he used that tone. He quickly complied and made a phone call.</p><br/><p>\"Hey, Secretary Fang, it's Cheng Feng!\"</p><br/><p>\"Assistant Cheng, anything I can help with?\"</p><br/><p>\"Later, Ms. Ning will go over to meet CEO Lu. Please bring her directly into his office.\"</p><br/><p>\"Uh, is it appropriate to bring her directly into the office? Assistant Cheng, are you sure it’s not the meeting room?\" Secretary Fang wondered if Cheng Feng was mistaken since CEO Lu’s office had a lot of classified documents. How could she just bring someone in without the master’s presence?</p><br/>\n</div>"}