{"title": "Chapter 409: The Place Where The Devil Slept?", "id": 409, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-409-the-place-where-the-devil-slept", "volume_title": "Volume 5", "body": "<h1>Chapter 409: The Place Where The Devil Slept?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 409: The Place Where The Devil Slept?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After he took off his coat, Lu Tingxiao rolled his sleeves up, \"It might take a while. You can go and rest in the next room. You don’t look very well, didn’t get enough sleep?\"</p><br/><p>Ning Xi touched her eye bags consciously, \"I was too excited last night, I spent all night reading the scripts…\"</p><br/><p>\"Go and take a short nap. I’ll wake you up when I’m done.\"</p><br/><p>\"The boss works while I take a nap, that wouldn't look too good, would it?\" Ning Xi felt that doing so would be inappropriate.</p><br/><p>Lu Tingxiao glanced at her, \"You couldn’t help me even if you weren’t sleeping, so I’d feel better if you go and sleep for a while.\"</p><br/><p>\"Okay! I’ll go now!\" She quickly stepped away from the devil’s desk...the devil had lost control of his flirting aura…</p><br/><p>Ning Xi went into the resting area swiftly…</p><br/><p>Even though the resting room had a simple and cold design, it felt a little warmer, probably because the devil had slept here before…</p><br/><p>Eh? Wait! The place where the devil slept?</p><br/><p>She was to sleep right here?</p><br/><p>As she was contemplating, her phone rang, a new message came through: [Cabbage Lu: The bed sheets are newly changed.]</p><br/><p>Did the devil have God’s eyes?</p><br/><p>Scary…</p><br/><p>Outside the resting room, Lu Tingxiao was smiling while imagining Ning Xi’s face when she saw his message.</p><br/><p>Later, he focused on reading the script, and since Ning Xi did not sleep at all last night, she was fast asleep after a while…</p><br/><p>It was nice and peaceful inside the office, but a storm was brewing outside.</p><br/><p>As people saw Lu Tingxiao come running back, everyone panicked…</p><br/><p>\"Crap, things must be really serious this time!\"</p><br/><p>\"What’s our boss like? He’s usually calm and collected, but he didn’t care about his image this time and just blazed through the building!\"</p><br/><p>\"According to the receptionist, he was really scary back in the lobby! Secretary Fang cried in fear!\"</p><br/><p>…</p><br/><p>Suddenly everyone turned to Cheng Feng…</p><br/><p>\"Assistant Cheng, if you know anything, don’t hide from us! I’m about to get a heart attack!\"</p><br/><p>\"Right! Tell us the truth! Is the company in an emergency? Are we going to lose our jobs?\"</p><br/><p>\"Please tell us, at least we can mentally prepare ourselves.\"</p><br/><p>\"There was a woman just now holding some documents into CEO Lu’s office. Is she here to report the bad news?\"</p><br/><p>…</p><br/><p>Cheng Feng was surrounded by people and the situation was chaotic, \"Please everyone, stop asking, I really don’t know anything! Just wait patiently!\"</p><br/><p>Actually, he was quite sure that the company had no issues.</p><br/><p>But he was still worried even if it was not about the company.</p><br/><p>Especially since it involved Ms. Ning, it was, in fact, more worrying!</p><br/><p>As time passed, the sun went down and the work day came to an end. No one dared to leave and most workers just waited by their desks.</p><br/><p>In the CEO’s office.</p><br/><p>Lu Tingxiao looked over the resting room’s direction, it seemed like he had stared at it for quite some time. After a while, he looked at the time and then put the script he had long finished reading down.</p><br/><p>He stood up and went towards the resting room, then knocked on the door.</p><br/><p>It was quiet inside, not a sound was heard.</p><br/><p>Lu Tingxiao opened the door gently and went inside.</p><br/>\n</div>"}