{"title": "Chapter 410: The Kiss In Her Sleep", "id": 410, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-410-the-kiss-in-her-sleep", "volume_title": "Volume 5", "body": "<h1>Chapter 410: The Kiss In Her Sleep</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 410: The Kiss In Her Sleep</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>On the huge, soft bed, the girl was sleeping soundly with her flushed cheeks and jet black hair strewn across the white pillow under her head...</p><br/><p>Lu Tingxiao's heart automatically became calm, as he sat lightly on the bedside with an urge to not do anything and just continue watching her like this...</p><br/><p>Mmm, not do anything?</p><br/><p>At this moment, with this view...</p><br/><p>It seemed quite impossible...</p><br/><p>Ever since she had left the Platinum Palace, it had been very, very long...too long since he could watch her from such a close distance...</p><br/><p>It had been very long since he had gotten close to her...</p><br/><p>Even though he knew he shouldn't, all rationality and self-restraint went out of the window as temptation was king of the moment.</p><br/><p>Lu Tingxiao picked up a lock of the girl's hair and kissed it lightly. He then slowly lowered his lips to cover her soft, cherry-colored lips...</p><br/><p>He initially only wanted to give her a slight peck, but obviously, this was a wild wish of his. After the touch, those soft and sweet lips made him sigh, and he could not help but slowly caress her face, then he used his finger to lightly hold her jaw and greedily invaded deeper to receive even more sweetness...</p><br/><p>\"Mmm...\" The girl had trouble breathing and whimpered uncomfortably.</p><br/><p>Lu Tingxiao's back stiffened and he knew he should move away, yet his body did not listen to him. Instead, it became even more excited feeling her resistance as he held her lips and kissed her even deeper...</p><br/><p>\"Lu...\"</p><br/><p>When he heard her mumble his name, Lu Tingxiao became even more aroused as he held her waist, wanting to mold her body into his...</p><br/><p>Feeling the soreness on her lips, Ning Xi frowned and unhappily waved at him, \"Cabbage Lu...\"</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>When he heard those words, Lu Tingxiao was stunned. When he returned to his senses, his head was buried in the warmth of her neck. He then started to laugh softly, even the enchanting atmosphere was disrupted by her.</p><br/><p>Cabbage Lu?</p><br/><p>This nickname...</p><br/><p>Fine, actually it didn't sound too bad.</p><br/><p>Very unique.</p><br/><p>Only exclusive to her.</p><br/><p>When he saw that the night had dawned upon them, Lu Tingxiao finally called out the girl's name with a heavy heart, \"Ning Xi...wake up...\"</p><br/><p>Ning Xi opened her eyes in a daze. The moment she had clarity, she saw a perfect face and eyes as gentle as the stars in front of her.</p><br/><p>\"Mmm...\" Was she dreaming?</p><br/><p>No, wait! She was resting in the devil's restroom in his office!</p><br/><p>Ning Xi quickly got up, \"Big boss! Have I slept for very long? What time is it now?\"</p><br/><p>\"Not too long, only two hours, just nice.\"</p><br/><p>\"Pfft! Am I a pig? How did I sleep for two whole hours?\" Ning Xi quickly rolled off the bed and then folded the blanket.</p><br/><p>\"Don't bother, someone will tidy that up later.\"</p><br/><p>\"Oh...\"</p><br/><p>\"Let's go, it's really late, it's time to eat.\"</p><br/><p>When Ning Xi had gathered herself, she first got down to business, \"Right, boss, have you finished reading the script? How is it? Can I act in it?\"</p><br/><p>Actually, she was very worried that the topic in the script might not be accepted by Lu Tingxiao who was such a serious and conservative man...</p><br/><p>\"I've read half of it,\" Lu Tingxiao answered.</p><br/><p>\"Half of it?\" The speed of this devil's reading...was not too fast, wasn't it? This was not science! It was probably because he was going through it carefully, so he was more detailed about it, she supposed.</p><br/><p>Haih, this is sad, did she have to wait for another day? How anxious!</p><br/><p>Ning Xi was an impatient girl and she could not wait for another minute, what more another day, so she bitterly asked, \"What else can I do then? I'll wait for you to finish reading it and look for you again tomorrow.\"</p><br/>\n</div>"}