{"title": "Chapter 420: Special Task", "id": 420, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-420-special-task", "volume_title": "Volume 5", "body": "<h1>Chapter 420: Special Task</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 420: Special Task</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The next morning at Platinum Palace Residence Entrance.</p><br/><p>A black Mercedes Maybach appeared, with Cheng Feng and four bodyguards waiting outside the entrance.</p><br/><p>The tallest bodyguard who looked honest and naive could not help but ask Cheng Feng, \"Assistant Cheng, why does the boss want to go to America this time around? In fact, why is he going to such a chaotic place like Philadelphia for observation? Can't he delegate the task to someone else to go? Is that processing plant really so important?\"</p><br/><p>When he thought about the objective for the visit, something flashed in Cheng Feng eyes. Then, he shot the guy a look, \"If you don't have a brain, then don't think about nonsense all day. Do you even have the capability to guess what the boss is thinking? Just follow the orders.\"</p><br/><p>The big guy scratched his head and felt that what Cheng Feng said made sense, \"Oh, understood, thank you, Assistant Cheng!\"</p><br/><p>As the both of them were talking, a skinny bodyguard in front of the car suddenly cursed under his breath, then walked to Cheng Feng impatiently, \"I can't! I can't hold it in anymore! I have to look for the boss and get him to take back his orders!\"</p><br/><p>Cheng Feng frowned as he looked at the youth who spoke up, \"What orders?\"</p><br/><p>The youth was called Shi Xiao, and he had the best combat skills among the bodyguards, making him the highest status of them. One could say that he was one of the staff Lu Tingxiao trusted the most.</p><br/><p>If it was an order to him, then it must be something of utmost importance.</p><br/><p>Shi Xiao had always followed all of Lu Tingxiao's orders, but what was it this time that actually made him want to disobey?</p><br/><p>Shi Xiao lit a cigarette and continued, \"In the middle of the night yesterday, I suddenly received a phone call from the boss and thought it was something important. Who knew, he was telling me to go over to the drama team for a period of time and be in charge of a woman's safety!? Pfft! I have had many near death experiences and am specially trained for more than 10 years. How could all of that boil down to protecting some random woman?\"</p><br/><p>\"Shi Xiao! Shut up, do you want to die?\" Cheng Feng looked at the door's direction nervously, \"If you let the boss hear you say this, be prepared to die!\"</p><br/><p>Shi Xiao was unhappy with the unfairness of the situation and he expressed, \"I really don't understand. Apart from having a bit of beauty, I don't see what's so special about that woman that made the boss so charmed!\"</p><br/><p>Cheng Feng knew that these people were used to messing around with guns and knives, and intelligence wasn't their forte, so he could only be patient and explain, \"Shi Xiao, listen to my word of advice: don't say these words ever again and just obey the orders!\"</p><br/><p>Shi Xiao looked insulted and waved impatiently, \"I'm okay with other orders, but not this! I don't care! No matter what, I definitely won't protect some actress who only knows how to flirt around!\"</p><br/><p>By sheer coincidence, Lu Tingxiao slowly walked out of his residence, clad in black, just as Shi Xiao made his declaration.</p><br/><p>Shi Xiao immediately ran up and said, \"Boss, I have something I need to consult you about!\"</p><br/><p>Cheng Feng could not stop him in time, so he could only bury his face in his hands and wish the rookie the best of luck.</p><br/><p>Lu Tingxiao coldly shot him a look and said, \"Speak.\"</p><br/><p>In that instance, Lu Tingxiao's icy eyes made Shi Xiao back off a little, but the insult he felt so deeply in his heart still made him blurt out, \"The order you made last night...there is no way I can obey it!\"</p><br/><p>Everyone broke into a cold sweat on behalf of Shi Xiao.</p><br/><p>Just when they thought the boss was about to break into a fit of rage, Lu Tingxiao unexpectedly did not say anything. All he did was look at the big guy behind Shi Xiao and said, \"Xiong Shi, you'll replace Shi Xiao.\"</p><br/><p>Xiong Zhi was taken aback, but he just scratched his head and followed the orders, \"Yes, boss!\"</p><br/><p>Seeing that the issue had been resolved, Cheng Feng quickly walked over to open the car door for Lu Tingxiao.</p><br/><p>Once Lu Tingxiao got into the car, Cheng Feng patted the big bodyguard's shoulder and could not help but lament, \"Haih, fortune certainly shone on the fool!\"</p><br/><p>That Shi Xiao, if one day he found out that the boss had given him a task as important as protecting the lady boss which he had rejected, he would regret to the point of puking blood...</p><br/>\n</div>"}