{"title": "Chapter 439: Careful Conduct", "id": 439, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-439-careful-conduct", "volume_title": "Volume 5", "body": "<h1>Chapter 439: Careful Conduct</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 439: Careful Conduct</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In Philadelphia, America.</p><br/><p>Xiong Zhi took out his .22 semi-automatic pistol. While the gun was small, it was destructive and had a lot of power. This pistol had saved Xiong Zhi from numerous dangerous situations.</p><br/><p>From all the experience from his previous dangerous missions, Xiong Zhi had a bad feeling about this. Like a beast, he could smell it in the air.</p><br/><p>Ning Xi hid in a corner and she could sense something was wrong too…</p><br/><p>Watched carefully by the girl, Xiong Zhi took a deep breath and went into the deserted pitch-black arsenal...</p><br/><p>…</p><br/><p>\"Weird, why would the boss ask us to gather here?\"</p><br/><p>A while after Xiong Zhi had entered, a small car zoomed by and came to a halt. The passenger doro opened after the car was parked, and out came one of Lu Tingxiao’s most trusted henchmen, Shi Xiao.</p><br/><p>Soon, two other thugs got down and followed Shi Xiao behind.</p><br/><p>\"Leader, why do you think boss gathered us here? This place looks like an abandoned arsenal!\"</p><br/><p>\"Mmm...I remember this arsenal. It should be an Italian mafia gang’s site. Does boss have any relationship to the Italian mafia gangs?\"</p><br/><p>They looked doubtfully at each other.</p><br/><p>\"Italian mafia gangs?\"</p><br/><p>Shi Xiao looked a little confused. These two men of his were pretty influential in Philadelphia. Otherwise, Shi Xiao wouldn’t have kept them as his henchmen. Of all people, they would be knowledgeable about the distribution of power in the area.</p><br/><p>\"Mmm, Italian mafia...but the arsenal has already been abandoned and it shouldn’t be of any use now.\" One of the men nodded at this statement.</p><br/><p>\"Boss gathered us at an Italian mafia gang’s abandoned arsenal…\" Shi Xiao mumbled, his expression tight. Worried, he then told them, \"Be careful, act accordingly!\"</p><br/><p>His instincts were telling him to be on high guard.</p><br/><p>Shi Xiao then went into the arsenal with his two men.</p><br/><p>At the corner, Ning Xi sneaked up behind them and went in as well…</p><br/><p>The arsenal was dark, full of the stench of stale ale. No light from the outside could not get inside, so both Ning Xi and Shi Xiao’s group of men could not see clearly.</p><br/><p>\"Be careful!\" Shi Xiao said in a low gravelly voice to his men.</p><br/><p>They heard the click-clack of a gun reloading, and the two men became uneasy. Could it be that it was not the boss who had gathered Shi Xiao here?</p><br/><p>\"Take out your phone for light! See what’s happening!\" instructed Shi Xiao.</p><br/><p>\"Yes, boss!\" one of the men said, taking out his phone and turning on the torchlight mode.</p><br/><p>As the light pierced through the dark spots of the arsenal, Shi Xiao’s eyes flew wide open. Xiong Zhi was lying on the floor, bruised and bloody.</p><br/><p>\"Xiong Zhi!\"</p><br/><p>Instinctively, Shi Xiao went forward to help Xiong Zhi get up.</p><br/><p>\"Da...damn it...there’s a...a spy!\" yelled Xiong Zhi, recognizing Shi Xiao.</p><br/><p>\"Spy?!\" Shi Xiao got even more nervous, his grip on his gun increasingly firm in his sweaty palms.</p><br/>\n</div>"}