{"title": "Chapter 440: You’re Going Down With Me", "id": 440, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-440-you%E2%80%99re-going-down-with-me", "volume_title": "Volume 5", "body": "<h1>Chapter 440: You’re Going Down With Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 440: You’re Going Down With Me</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>He should have trusted his instincts that doubted the reason his boss would gather them at a place like this…</p><br/><p>\"Shi Xiao, run! Quickly, it’s a trap! Boss isn’t here!\" Xiong Zhi howled like a beast, his veins bulging out of his forehead, and his eyes bloodshot.</p><br/><p>Before Shi Xiao could say anything, a blinding light was turned on and the pitch dark arsenal suddenly became bright as day.</p><br/><p>Shi Xiao and Xiong Zhi’s group squinted in the light as they heard the sound of the arsenal doors being closed.</p><br/><p>After Shi Xiao's eyes adjusted to the strong light, he saw the metal door was already locked, sealing them in.</p><br/><p>\"Hahaha, you bunch of idiots!\"</p><br/><p>From inside of the arsenal, they heard footsteps and voices speaking Mandarin.</p><br/><p>Four foreign men showed up in tight t-shirts with their muscles bulging through the fabric of their shirts, followed by a long-haired foreign woman in a black outfit.</p><br/><p>One of the bald men had tattoos all over his shoulder, neck, and even on his head. He looked at Shi Xiao and Xiong Zhi with a snarl and despise clearly written on his face.</p><br/><p>Shi Xiao finally understood that their boss Lu Tingxiao was not here. More specifically, he had not gathered them here. It was that damned Hong Zhenhao who had tricked them here!</p><br/><p>\"Hong Zhenhao, you son of a witch! Damn you!\" Shi Xiao cursed with a red face.</p><br/><p>Shi Xiao and Xiong Zhi now had no doubt that it was Hong Zhenhao at all. When they had received the message that Lu Tingxiao was waiting here for them, they suspected nothing. Who knew, in the end, they both got trapped here. Hong Zhenhao was the spy!</p><br/><p>\"Hahaha, you bunch of stupid pigs!\" the tattooed bald man guffawed loudly.</p><br/><p>On the side, the foreign lady kept silent while she toyed around with her black pistol.</p><br/><p>\"You guys...who are you? Do you know who Lu Tingxiao is?! We’re Lu Tingxiao’s men. We dare you to even touch a strand of hair on us!\" yelled one of Shi Xiao’s men, sweating profusely.</p><br/><p>Shi Xiao stared at him helplessly. It was far too late already. What else was there to say? No matter who they were, spending all the effort to trick them to come here was a blatant enough hint that they would be killing them!</p><br/><p>\"I’ll have all of you die here today, and roast you guys like pigs!\" roared the bald man, staring at them fiercely.</p><br/><p>The man who had threatened the bald men and his gang suddenly yelled angrily, whipping out his pistol and aiming it at the bald man, \"You’re going down with us!\"</p><br/><p>\"Alice, finish off that pig!\" the bald man ordered coldly.</p><br/><p>As soon as the order was given, the lady held up her gun. Bam! The bullet accurately ricocheted off the man’s gun.</p><br/><p>\"Ah…!\" The man’s right palm felt numb and he could not feel any sensation in it anymore. The impact of the gunshot was too strong, causing him to release his gun. He then backed away a few steps and stumbled onto the floor.</p><br/><p>Shi Xiao and Xiong Zhi had a really bad feeling about this. The lady’s shooting...was extraordinarily accurate! And her reflexes were lightning fast; she did not let anyone have the chance to even move an inch.</p><br/><p>\"Oh, Alice baby, why didn’t you just kill the pig!?\" the bald man looked at her questionably.</p><br/><p>\"I don't need a gun to kill him, I’ll use my bare hands,\" she replied in a matter-of-fact tone, calmly walking towards the man.</p><br/>\n</div>"}