{"title": "Chapter 451: Just For A Woman", "id": 451, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-451-just-for-a-woman", "volume_title": "Volume 5", "body": "<h1>Chapter 451: Just For A Woman</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 451: Just For A Woman</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The Italian man said innocently with both his hands wide open, \"My dear buddy, you can’t blame me for this! My target was Lu Tingxiao. She went there on her own and then killed everyone and even captured Alice. She destroyed my plans!\"</p><br/><p>The Italian man had a steely look. Even the hot girls who were dancing around him earlier were now afraid of him.</p><br/><p>The black-haired man seemed not to notice and continued to speak without any expression, \"Mr. Augustine, you’ve breached our agreement.\"</p><br/><p>The Italian man staggered up as he smiled and wanted to pat his shoulder, \"Hey buddy, relax! I’m just trying help since I saw that Satan wasn’t doing anything yet!\"</p><br/><p>The black-haired man dodged Augustine’s pat before he could touch him. With a poker face, he said, \"Mr. Augustine, I regret to tell you this but due to your unauthorized actions, I’m afraid that our alliance ends today.\"</p><br/><p>The Italian man was shocked and his expression darkened. In a deep tone, he said, \"Do you know what are you talking about? Who gave you such instructions to end our alliance?!\"</p><br/><p>\"Satan.\"</p><br/><p>The Italian man pushed away a pretty lady and stormed in front of the Asian man with a spooky face, \"Have him talk to me personally! Who are you to tell me this anyway?\"</p><br/><p>The next second, the black-haired man turned the laptop screen towards the Italian man’s direction.</p><br/><p>On the screen was the silhouette of a man sitting on a wide couch in a dimly lit house, his face and his pair of long legs barely made out in the dark…</p><br/><p>\"Satan, are you really ending our alliance?! Just for a woman?\" the Italian man released all his rage towards the screen, like an enraged lion.</p><br/><p>In contrast with the angry Italian man, the man on the screen sounded as if he had just woken up. He spoke lazily, \"Just for a woman...\"</p><br/><p>\"You’re messing with me!\" The Italian man kicked a table nearby, his handsome face turning ferocious, \"You better think about the consequences of ending our alliance!\"</p><br/><p>The man on the screen smiled lightly, \"Consequences? Tang Ye, tell Augustine the consequences.\"</p><br/><p>\"Yes.\" The black-haired man nodded and then turned towards the Italian man, declaring in his cold, robotic-like tone, \"From this moment onwards, all the trading between us will be stopped immediately.\"</p><br/><p>Augustine immediately sobered up after hearing what Tang Ye said. His eyes turned red and he looked terrifying.</p><br/><p>If their trade ended now, it meant that they would lose 90% of their source of firearms…</p><br/><p>\"Fine, I’ll let you know what the consequences of betraying an ally are!\"</p><br/><p>The music suddenly stopped and a big group of muscular men surrounded them. Each man had guns on them, and numerous guns were pointed at Tang Ye. With just one signal from Augustine, Tang Ye would become their shooting practice target.</p><br/><p>Tang Ye calmly took off his gold-framed glasses and stood up to adjust his sleeve. The moment his eyes met with Augustine’s, his calm sight turned into a scary blazing pair of eyes as he said coldly, \"Mr. Augustine, I’m afraid that you’re mistaken about something.\"</p><br/>\n</div>"}