{"title": "Chapter 464: Been Very Attracted", "id": 464, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-464-been-very-attracted", "volume_title": "Volume 5", "body": "<h1>Chapter 464: Been Very Attracted</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 464: Been Very Attracted</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Outside the audition hall.</p><br/><p>At first, all the artistes who were waiting outside heard Cook's angry scoldings, then it suddenly quieted down, and what ensued was an emotional playing of the Guqin...</p><br/><p>One of the artistes scoffed, \"And here I was thinking what killer trick Ling Zhizhi has prepared! Turns out that she also played the Guqin just like Li Yueling! With Li Yueling having gone in before her, isn't she just asking to be insulted? Ling Zhizhi's professional standards are indeed increasingly unworthy. Now even if it was a small assistant role, I would be worried to let her take it up!\"</p><br/><p>Some of those who knew a little more about music frowned and said, \"This song seems to be a harder tune than the one Li Yueling played earlier...but I think even if this was so, there wouldn't be much use...\"</p><br/><p>Li Yueling was better versed with the Guqin, so when she heard the smooth and skillful playing of the difficult song, she was nervous for a second. However, she very quickly recovered her arrogance again, \"Sis Ling, even if your village girl rookie didn't know better, surely you would? For such an elegant instrument like the Guqin, in the olden days, they had to clean their hands with incense and wear suitable apparel out of respect before even touching the Guqin. Based on what she wore, she is practically insulting Chinese history...hah, just wait for her to be scolded by Cook!\"</p><br/><p>Everyone else heard what Li Yueling had said and agreed with her.</p><br/><p>Ling Zhizhi remained unbothered and focused on waiting for Ning Xi's results.</p><br/><p>When Ning Xi did not get chased out by Cook the moment she started playing, it indicated to those present that she had already made the first step to success.</p><br/><p>Only...Ning Xi's idea was still a little too risky...</p><br/><p>She still did not have complete confidence about how the final outcome would pan out...</p><br/><p>Several moments later, when the song had finished, there was no thunderous scolding from Cook heard at all. In fact, it was pin-drop silent.</p><br/><p>Everyone looked at one another; they could only continue to wait. Time ticked by even longer than when they had waited for Li Yueling to come out of the hall...</p><br/><p>Some people started to be impatient and anxiously walked back and forth venting, \"What are they doing inside? Why isn't she out yet?\"</p><br/><p>\"Who knows? It's probably because the director is too cross with her that one or two sentences aren't enough to express his hatred!\"</p><br/><p>\"Cook is one of the top ten advertisement directors globally and he is known for his temper. I think this time, even Glory World will be dragged down!\"</p><br/><p>...</p><br/><p>At the same time, inside the audition hall.</p><br/><p>After Ning Xi had finished explaining her interpretation of nobility, Cook approved of her and finally decided to dig more about Ning Xi's identity.</p><br/><p>He took the candidate details from his assistant and saw a familiar name that made him gasp in pleasant surprise, \"Ning Xi...oh my God! You're Meng Changge!\"</p><br/><p>\"Meng Changge...Yes, that's a character for one of the films that I was involved in,\" she acknowledged. Ling Zhizhi mentioned that she had sent in her clip of 'The World', so Ning Xi was not too shocked by his reaction towards her name but she wondered if Cook's expression was a little over the top.</p><br/><p>\"Dearest Miss Ning, the first time I saw Meng Changge, I was very drawn to the character and could not wait to watch this movie. Could you please tell me when it will be out in the theatres?\"</p><br/><p>Cook looked slightly guilty for having even thought of her as a nuisance at the start. She looked vastly different when dressed in olden day outfits and more contemporary clothing. He could not recognize her immediately and had almost chased her out at the start.</p><br/><p>For an actor, the happiest moment would definitely be when their movie character receives recognition, so Ning Xi politely answered, \"The movie is currently still in post-production editing, so I'm not too sure of the actual date of release either. Probably in another month's time! Director Cook, thank you very much for your love for the character!\"</p><br/>\n</div>"}