{"title": "Chapter 467: To Visit Someone", "id": 467, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-467-to-visit-someone", "volume_title": "Volume 5", "body": "<h1>Chapter 467: To Visit Someone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 467: To Visit Someone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Due to the upcoming perfume advertisement shoot, Ning Xi needed to stay for a while in Los Angeles.</p><br/><p>Riding on this opportunity, she had something very important to do...</p><br/><p>She wanted to visit someone.</p><br/><p>Ning Xi traveled to St. Bernard City, nearby Los Angeles.</p><br/><p>No one would recognize her in such an area so she did not bother to disguise herself or even put on any makeup. She simply changed into a plain and comfortable white t-shirt and jeans.</p><br/><p>St. Bernard City had been named the most dangerous city of Country M for five years in a row now, where low-income groups gathered and the city was the main path of smugglers; it was deemed the most violent area in the entire country.</p><br/><p>Ning Xi had to pay double the usual fare before the driver was willing to go there. In fact, he only drove till the border of both cities and dared not continue forward. He waited for Ning Xi to get down from the car, then immediately sped off.</p><br/><p>Abandoned ruins proliferated the city, where most of the place was filled with short, dilapidated buildings and abandoned landfills. In the dim alleyways, black market dealings were a common sight...</p><br/><p>However, the entertainment industry there was booming. Even though it was already late at night, it was still very lively, and everywhere were the sights and sounds of drinking, games, and gambling.</p><br/><p>The pedestrians on the pavements were mostly muscled men with ferocious-looking tattoos, and they looked viciously at anyone who walked past them. The women, on the other hand, wore as little as possible to display their lithe, sexy bodies, their faces heavily lined with smoky gothic makeup.</p><br/><p>When Ning Xi walked into St. Bernard's late at night dressed as innocently as a schoolgirl, she was practically a little white bunny walking among a pack of bloodthirsty wolves.</p><br/><p>By the road side, a pair of watchful eyes evaluated this stranger who had suddenly walked into their territory.</p><br/><p>In Ning Xi's mouth was a lollipop and she had her earphones on. She walked through the alleys nonchalantly as if she was walking on a normal, safe pavement.</p><br/><p>Because of how carefree she looked, she looked like she belonged to the neighbourhood. The eyes that watched her were merely evaluating and no one actually went up to her to find fault.</p><br/><p>After all, if she dared appear so late at night like this in St. Bernard, even if she was really just a child, she would definitely not be someone normal. She probably had a lot of strength behind her, and the tiniest of conflicts would turn deadly for whoever took her on.</p><br/><p>She walked through a maze of complicated slums, then her view of the area surrounding her started to expand. She was not far from the town center, and the nearer she approached the central region, the more modern it was.</p><br/><p>That was where St. Bernard's most respected figure lived.</p><br/><p>With only a year apart since she last went there, the changes were not terribly significant. Based on her memory, Ning Xi soon reached a building that stood independently of the others.</p><br/><p>This building was surrounded by a thickset jungle, it looks dark, as if it was the witch's palace in a fairytale world.</p><br/><p>The building was dark with no lights turned on. Could they be sleeping? Or was the owner not around?</p><br/><p>Ning Xi pushed the courtyard gate open to reach the building door and she rang the doorbell. The ringing in the still night was extremely abrupt.</p><br/><p>She waited for a while but there was no response at all.</p><br/><p>She rang another two times but it was quiet inside and no one opened the door.</p><br/><p>Ning Xi scratched her head, then looked at the flower pots under the windows and counted the third pot. Then, she felt for the keys from beneath the third pot.</p><br/><p>Haih...this standard of hiding the keys...really never changed...</p><br/><p>When she retrieved the keys, Ning Xi unlocked the door to enter.</p><br/><p>She found the house lights to switch them on, then walked up and down the entire house to look; indeed, he was not home.</p><br/><p>Ning Xi looked at the time on her phone, then sat down on the sofa in the living room. She decided to just wait there until the owner returned.</p><br/>\n</div>"}