{"title": "Chapter 474: Silly Leader", "id": 474, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-474-silly-leader", "volume_title": "Volume 5", "body": "<h1>Chapter 474: Silly Leader</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 474: Silly Leader</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi was a little surprised by the man’s words. So he was Jeffrey’s younger brother…</p><br/><p>In the blink of an eye, the woman elbowed his face and he was scowled unhappily.</p><br/><p>\"What did you say earlier? I didn’t hear it clearly,\" Ning Xi asked Lou who was moaning in pain.</p><br/><p>\"You...you witch, you dare to hit me?!\" Lou covered his swollen face and glared at Ning Xi. He then yelled at the people behind him, \"Kill her! She's mine to bed tonight!\"</p><br/><p>Everyone sprung into action with Lou’s roar, after being momentarily mesmerized by how swiftly Ning Xi’s perfect elbow attack had taken the tough Lou down.</p><br/><p>\"Lou, so do you want to kill her, or do you want to sleep with her? Can you still sleep with her if she’s dead?\" one of the bald men asked in confusion.</p><br/><p>\"Damn you, Bardy! Get on it now!\" Lou yelled angrily.</p><br/><p>Bardy and his men surrounded Ning Xi.</p><br/><p>\"Wait.\" Ning Xi shook her head.</p><br/><p>\"Little Miss, are you trying to beg for forgiveness?\" Bardy yelled at her.</p><br/><p>Ning Xi went to the side and picked up a few steel bars to give them to the people in front of her.</p><br/><p>Ning Xi left them dumbfounded and confused.</p><br/><p>\"Ok, come at me,\" Ning Xi clapped her hands and nodded with satisfaction.</p><br/><p>How boring if the opponents were too weak compared to her, much better now!</p><br/><p>\"Damn it, you’re going to die!\"</p><br/><p>\"You witch, are you looking down on us?!\"</p><br/><p>Ning Xi was obviously provoking them, especially since they were elite members from the Solomon group. They would not let her get away with this!</p><br/><p>Of course, the title of \"elite member\" was self-appointed.</p><br/><p>Under the leadership of the bald man, they started attacking Ning Xi with the steel bars.</p><br/><p>\"Don’t hit her too hard. I’m still going to sleep with her later and I don't want her performance to be affected! And don’t hit her face!\" Lou yelled at them while looking after the middle-aged man.</p><br/><p>Right after he yelled at them, Ning Xi gave Bardy a powerful kick and he fell beside Lou, moaning in agony.</p><br/><p>Like lined-up dominoes, they all went down one by one, defeated by Ning Xi. The steel bars were all lying haphazardly on the floor.</p><br/><p>\"Da...damn it, who is this woman? She’s powerful!\" the bald man gasped in fear.</p><br/><p>\"Shoot her! Bardy, kill her with your gun!\" Lou noticed something was wrong and instructed Bardy to take out the threat.</p><br/><p>Only Bardy had a gun. Although Lou was Jeffrey’s brother, he still did not have any say in this matter.</p><br/><p>Bardy quickly took out his gun and aimed it at Ning Xi.</p><br/><p>Ning Xi was calm despite having a gun pointing at her. In her pocket, her hand was already grasped around her gun. She was confident that she could kill the bald man first if he did fire at her.</p><br/><p>\"Shoot her, Bardy, you idiot!\" Lou yelled at him for not firing at her.</p><br/><p>The bald man was embarrassed and answered him, \"We’re done for...I’ve always been afraid that I might lose the gun in a fight...so I never loaded bullets in them…</p><br/><p>Lou’s men were all dumbfounded by this statement and Ning Xi almost laughed out loud.</p><br/>\n</div>"}