{"title": "Chapter 475: Useless Boss", "id": 475, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-475-useless-boss", "volume_title": "Volume 5", "body": "<h1>Chapter 475: Useless Boss</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 475: Useless Boss</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>An unloaded gun?! Lou launched into a tirade and cursed Baldy endlessly.</p><br/><p>\"Lou, I’m still the leader for our team and I have my pride as leader. How can I expect any respect from my team if you are always scolding me!\" Bardy stared at Lough, his mouth curled downwards.</p><br/><p>\"Screw your pride!\" Lou kicked Bardy.</p><br/><p>Bardy backed off and fell into a punching stance. Before Lou could react, he threw a punch and hit Lou's jaw, \"I cannot stand you anymore, Lou! Now see for yourself what I can do!\"</p><br/><p>Seeing Bardy’s counterattack, the middle-aged man quickly got up from the floor and started hitting Lou as well.</p><br/><p>The others wanted to help Lou but Ning Xi knocked them out with her a strike of her knife-armed hand.</p><br/><p>\"Hey, Lou! Check out my combo punches!\" Bardy threw his punches swiftly like rain droplets splattering onto Lou’s face.</p><br/><p>A while later, Lou’s face was swollen and badly bruised.</p><br/><p>\"Ha!\" Bardy shouted and unleashed his final attack, gesturing like a boxing champion. He held both his hands up high and did a victory dance, pumping both hands up and down while chanting, \"Oh, yeah! Oh, yeah!\"</p><br/><p>Ning Xi snatched his gun away while he was celebrating his victory against Lou.</p><br/><p>Bardy looked at Ning Xi and his triumphant look soon faded.</p><br/><p>\"It’s really not loaded…\" Ning Xi laughed awkwardly, finding the bald Bardy very interesting.</p><br/><p>\"My dear savior! I’m Zeus. Thank you for saving me!\" the middle-aged man said in excitement, \"I’m the boss of Solomon and I was betrayed by my second-in-command, Jeffrey. If it hadn’t been for you, I wouldn’t live to see tomorrow!\"</p><br/><p>\"Hey, to the most useless boss in history, midnight has just passed. You wouldn't have lived till today without her,\" Bardy told him seriously.</p><br/><p>Ning Xi was speechless as she did not expect that she would accidentally save a gang leader…</p><br/><p>It was probably because the boss and his henchmen were so useless that she had thought that this unheard gang was just a group of people fooling around. She only found out some time later how big of an influence the Solomon had, and that the middle-aged Zeus in front of her was one of the weakest leaders amongst all of the previous bosses.</p><br/><p>However, currently Ning Xi was focused on the safety of a particular person, so she quickly told them, \"You guys, bring me to Jeffrey!\"</p><br/><p>\"Jeffrey is ruthless. Going to him now is like looking for your own death!\" Bardy shook his head.</p><br/><p>Ning Xi shot him a threatening stare and he quickly said, \"I think you’ll be fine though. I’ll bring you there!\"</p><br/><p>Zeus thought for a while and said, \"I know of a shortcut that can reach directly into the heart of his base, follow me!\"</p><br/><p>They reached a manor in the outskirts half an hour later. Apparently, Jeffrey was here.</p><br/><p>\"That's weird, no one’s guarding the area. Could it be a trap?\" Zeus doubted.</p><br/><p>Ning Xi did not give it much thought and she went straight inside the manor.</p><br/><p>She was not sure if the person that Jeffrey sent assassins to kill was safe, and where that person was…</p><br/><p>Inside the big manor, there were 13 armed muscular men patrolling around.</p><br/><p>As Ning Xi was coming up with a plan, an odd sound came from above.</p><br/><p>A helicopter appeared on top of the manor.</p><br/><p>All the armed men in the manor were on alert.</p><br/><p>As she looked from afar, Ning Xi saw a voluptuous woman with brown-colored hair in a tight black suit. The woman used a rope to disembark the helicopter.</p><br/><p>Ning Xi was surprised to see the woman as she did not expect that the person she had been waiting for all night long would make her entry in such a grand way.</p><br/>\n</div>"}