{"title": "Chapter 481: Totally Charmed By Her", "id": 481, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-481-totally-charmed-by-her", "volume_title": "Volume 5", "body": "<h1>Chapter 481: Totally Charmed By Her</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 481: Totally Charmed By Her</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi tried on ten different outfits and loved every one of them.</p><br/><p>In the end, she generously bought all of them.</p><br/><p>As expected, the best solution when faced with a dilemma with too many choices was to be rich! By being decisive and buying them all, then one need not be burdened by having to just choose one.</p><br/><p>There was a retro-themed dress with Chinese elements that Ning Xi loved it the most. She had the salesperson pack up her clothes and she immediately wore that outfit.</p><br/><p>The salesperson was glad that she got herself a big deal, so with a big smile she said, \"Thank you for your patronage, please come again!\"</p><br/><p>Ning Xi held onto all her bags and was stepping out when she saw a big group of celebrities entering the shop with Li Yueling as the lead. The woman in a long mint green dress beside Li Yueling was Ning Xueluo…</p><br/><p>She did not see Ning Xueluo at the Noble audition the other day, so why was she here?</p><br/><p>Suddenly, every salesperson in the shop and the manager went up to them, bowing to Ning Xueluo, \"Welcome back, Mistress!\"</p><br/><p>Ning Xi frowned a little. Mistress?</p><br/><p>Because Ning Xi was on her way out, all of them saw her at the entrance.</p><br/><p>Li Yueling saw Ning Xi holding all the bags and said, \"I didn’t expect that you'd like History too.\"</p><br/><p>Ning Xueluo went up to Ning Xi, \"Ning Xi, I didn’t know that you’ll be here. You could’ve let me know beforehand so that I could have them give you a discount!\"</p><br/><p>Ning Xi’s brows frowned even more. Was it Ning Xueluo who bought over Neon?</p><br/><p>As far as she knew, Ning Xueluo usually liked European styles and had always thought that brands with Chinese element like Neon were too tacky, so why would she suddenly invest in Neon?</p><br/><p>Ning Xi just mumbled something and left the shop.</p><br/><p>Li Yueling sneered with despise, \"Even if she wore a dragon robe, it can’t cover up her countryside stink!!\"</p><br/><p>\"Why do you say so?\" one of the artistes asked.</p><br/><p>Li Yueling raised her brows, \"Didn’t you guys know that just like Fang Xiaowen, she came from a fairly remote village where people reared cows, goats, and poultry!\"</p><br/><p>All the artistes were surprised. \"I can’t believe this. Has Director Cook gone crazy? Having someone like her to endorse the renowned Noble famous for its elegance?! If consumers knew that the ambassador was a countryside girl, who’d still buy their products?\"</p><br/><p>\"Hehe, I don’t think Cook is crazy. He was just totally charmed by her!\"</p><br/><p>Ning Xueluo tried to settle them down. \"Okay, we’re here to shop, let’s stop talking about business!\"</p><br/><p>\"Right, Xueluo, is it really true that we can get the designer to design a dress for each and every one of us?\" an artiste asked with excitement.</p><br/><p>Li Yueling answered happily, \"Of course, Xueluo owns History, so it’s no big deal!\"</p><br/><p>Most people there were fairly influential and no matter how popular History was, it was nothing more than a wardrobe addition. Ning Xueluo opened up again, \"I’m really glad that all of you pretty ladies here are willing to wear dresses from History. It’s our honor and it’ll surely save me tons of advertising fees!\"</p><br/><p>The artistes were in a much better mood now and one of the popular ones replied, \"You’re too generous, Xueluo, it’s true that you've got a genuinely fantastic brand!\"</p><br/><p>…</p><br/>\n</div>"}