{"title": "Chapter 480: Getting Rich Overnight", "id": 480, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-480-getting-rich-overnight", "volume_title": "Volume 5", "body": "<h1>Chapter 480: Getting Rich Overnight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 480: Getting Rich Overnight</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Li Yueling did not notice anything odd about Ning Xueluo, so she continued to complain, \"I knew that she must have used some dirty tricks, I almost thought that I really lost to her! What should I do now Xueluo? I’m too embarrassed to go back!\"</p><br/><p>Ning Xueluo gave it some thought and said, \"Noble has already announced the results and it’s impossible to change that now but we can minimize the spread of the news.</p><br/><p>This audition happened in a foreign country so not many people know about it. If we pull some strings, they might not tell the whole world. And it wasn’t just you who are embarrassed. In fact, all of them are far more experienced than Ning Xi and yet they still lost to her!\"</p><br/><p>Li Yueling had a moment of realization. \"You’re right…\"</p><br/><p>\"So just relax, you’re on the same side as them. Coincidentally, History has just opened a headquarters in Los Angeles. We’ll invite all of them over tomorrow and buy them some dresses there. After some bonding and hints, they’d surely understand!\"</p><br/><p>The manager spoke up as well, \"That’s a good idea. History is quite popular among the entertainment circle recently and many celebrities will be proud to own a dress designed by the lead designer David!\"</p><br/><p>Li Yueling held Ning Xueluo’s arms intimately and flattered, \"Of course, Xueluo, you have great taste and you picked that designer to set up a brand for him and make him popular!\"</p><br/><p>\"I was just lucky,\" Ning Xueluo said humbly.</p><br/><p>…</p><br/><p>On the third day since Ning Xi came to Los Angeles.</p><br/><p>Noble’s advertisement shoot ended without a hitch and she was going home tomorrow.</p><br/><p>Her endorsement fees amounted to three million dollars, 10 times more than what she had received the last time.</p><br/><p>It felt awesome to get rich overnight!</p><br/><p>Finally, she could buy whatever she wanted.</p><br/><p>A not lesser known brand that Ning Xi liked, \"Neon\", had been bought over recently and changed their name to \"History\". It seemed that its popularity was rising and it had gotten a lot of attention in the entertainment field with many celebrities and socialites loving it.</p><br/><p>She felt a little sad that suddenly everyone knew about the treasure that used to be only known by a few, but of course, she felt happy for the brand itself.</p><br/><p>As the brand had progressed, more classic designs were made.</p><br/><p>She heard that History had opened a shop in Los Angeles and had a lot of pieces that were not available back home, so she wanted to take a look.</p><br/><p>Ning Xi felt refreshed stepping into the store.</p><br/><p>There were a lot of designs that were not available back home and all of them piqued her interest.</p><br/><p>What was regrettable was that the prices were almost tenfold to how much it had cost before.</p><br/><p>\"Miss, see anything that you like? Try them on! You can only see how it really looks when you try it on yourself!\" the salesperson told Ning Xi.</p><br/><p>\"Mmm, I’ll look around for a while. All of them look gorgeous!\"</p><br/><p>The salesperson smiled, \"Miss, are you from China?\"</p><br/><p>\"Yes.\"</p><br/><p>\"I think that although our brand is popular in Western countries, only a Chinese can bring out the real potential of the designs. After all, it was made by a Chinese designer. You look really pretty and you have a unique aura, most of our garments would suit you very well!\"</p><br/><p>\"I’ve always been a fan of this brand even before it was named History!\"</p><br/><p>…</p><br/>\n</div>"}