{"title": "Chapter 482: Why Do You Keep Staring At Me?", "id": 482, "volume": 5, "url": "http://boxnovel.org/hidden-marriage-chapter-482-why-do-you-keep-staring-at-me", "volume_title": "Volume 5", "body": "<h1>Chapter 482: Why Do You Keep Staring At Me?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 482: Why Do You Keep Staring At Me?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi walked around after leaving History, intending to buy some souvenirs.</p><br/><p>She was tired halfway through, so she bought herself some snacks and sat down on one of the long chairs.</p><br/><p>Suddenly, she felt someone looking at her.</p><br/><p>Ning Xi looked up and saw an untidy beggar staring at her…</p><br/><p>It felt really odd to be eating while being stared at, so she then took out a sandwich from the paper bag and gave it to the beggar.</p><br/><p>The beggar looked at her, took the sandwich and gobbled it down quickly.</p><br/><p>Ning Xi sensed the gaze again, so she looked up and still saw the beggar there…</p><br/><p>Ning Xi then realized that he was not staring at her food, but it was more like a judgmental stare assessing her…</p><br/><p>Ning Xi was confused. What was she supposed to do? She had even given him something to eat, so what was he trying to do?</p><br/><p>Ning Xi stopped eating and walked over to him, \"Hey, why do you keep staring at me?\"</p><br/><p>\"I’m not staring at you.\" Ning Xi was surprised that he replied in Chinese. She did not expect him to be a Chinese…</p><br/><p>Ning Xi responded in Chinese as well, \"You’ve been staring at me since just now! Even at this moment!\"</p><br/><p>The beggar scanned her then replied, \"I’m looking at your outfit.\"</p><br/><p>Ning Xi looked at her dress and asked, \"What about my outfit?\"</p><br/><p>The beggar did not even hesitate. \"It’s ugly.\"</p><br/><p>Ning Xi was speechless. Even people who had zero fashion sense would never consider this dress as ugly.</p><br/><p>\"Why don't you tell me which part of this dress is ugly?\"</p><br/><p>Ning Xi was not expecting anything constructive but his reply was out of her expectations, \"The embroidery on your dress is a flower-bird themed which comes from the drawing called \"Rest\" by Lin Fengmian. It’s a good drawing but the background color is too dark. It’d be better if turquoise blue was used. They shouldn't have used silk as well; a softer fabric would have worked better. The worst part is the design around the waist. It’s a misconception that the tighter the waist area, the more can one flaunt their curves. Actually, if it’s a little bit looser, it would have made an enormous difference…\"</p><br/><p>Ning Xi saw that the beggar commented excitedly about her outfit.</p><br/><p>She looked at her outfit again and armed with the knowledge from his comments, she thought that his words made sense.</p><br/><p>She listened patiently and prompted, \"Tell me more!\"</p><br/><p>The beggar continued with a cold tone, \"Most importantly, this outfit you’re wearing is a half-made draft! They are deceiving the consumers by putting this on for sale!</p><br/><p>Ning Xi looked at the beggar again. \"How do you know all these?\"</p><br/><p>The beggar had really messy hair that covered most of his face but from his voice, Ning Xi was determined that he should be around 20 odd years of age.</p><br/><p>Ning Xi felt something was off, this man was young and did not seem to be disabled either, so how did he end up as a beggar on the streets of this foreign country?</p><br/>\n</div>"}