{"title": "Chapter 501: The Devil's Skill Is Really Good", "id": 501, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-501-the-devils-skill-is-really-good", "volume_title": "Volume 6", "body": "<h1>Chapter 501: The Devil's Skill Is Really Good</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 501: The Devil's Skill Is Really Good</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>All the doctors and servants were speechless.</p><br/><p>My God!</p><br/><p>This man who had just rolled up his sleeves to massage a woman's legs...was this really the unfriendly Big Master they knew, the scary CEO of the Lu Corporation, Lu Tingxiao?</p><br/><p>Since last night, their perception and image of Lu Tingxiao were refreshed numerous times in their hearts.</p><br/><p>Even Lu Chongshan and Yan Ruyi were in disbelief; they could not believe that this man in front of them was really their biological son.</p><br/><p>Before this, they only knew that their son was charmed by this woman and they had never personally witnessed any concrete actions that demonstrated his sentiments towards her.</p><br/><p>Now that they had, they were shocked. It was definitely a hundred times more prominent than what the others said or what they could imagine!</p><br/><p>This was their own son, yet they almost could not recognize him anymore...</p><br/><p>Actually, the person who was even more shocked than the surrounding onlookers was Ning Xi herself.</p><br/><p>At that very moment, Ning Xi's heart felt as if it was keeping up with a stampede...</p><br/><p>Devil, could you please keep it down a notch?</p><br/><p>Everyone is watching here!!!!</p><br/><p>Unfortunately, Lu Tingxiao picked up neither the complaints from her heart, nor the countless gazes staring at him. He continued to focus on massaging her numb legs, which was a result of not moving for a long time in fear of waking Little Treasure up.</p><br/><p>As he massaged, Ning Xi practically gave up and became numb to the gazes surrounding her...</p><br/><p>In fact, hmm, the devil's skill...was really good...the massage was really putting her at ease...</p><br/><p>\"Is it better now?\" Lu Tingxiao looked up to ask gently after a while.</p><br/><p>Ning Xi quickly nodded. \"Much better!\"</p><br/><p>She thought silently, \"Your father is looking at me as if I'm the concubine who toyed with a warrior's heart and brought calamity to a country and its people!\"</p><br/><p>Lu Tingxiao then covered her with the blanket again and gently arranged her slightly messy hair, continuing to publicly display his love for the girl.</p><br/><p>At this moment, all the servants in the old residence had come to a clear conclusion - they definitely could not offend this woman in front of him!!!</p><br/><p>Since he currently did need a favor, despite Lu Chongshan being very angry, he could only hold it in for Little Treasure's sake. He scoffed and angrily walked off, telling himself that it was best not to see anything more.</p><br/><p>As soon as he stormed off, Lu Chongshan could not keep it in any longer and started to complain to Yan Ruyi, \"How dare he! Look at how he was behaving, a big old man actually doing something like this for a woman, and using such a soft voice. Plus, he did it in front of everyone, how inappropriate! Does he even remember his own identity at all?\"</p><br/><p>As a mother, even though Yan Ruyi was not too happy either, from a woman's perspective, she didn't really find anything wrong with Lu Tingxiao's actions.</p><br/><p>If you really liked someone, you would naturally be extra caring...</p><br/><p>While Yan Ruyi thought about this, she nonchalantly looked over at Lu Chongshan. Her marriage to Lu Chongshan was a result of good timing. They looked good together and were said to be a perfect match, yet she knew clearly that this man had only married her because she was the most suitable candidate and that in fact, he had never truly loved her...</p><br/><p>On the second day.</p><br/><p>The doctor checked on Little Treasure during the noon and in the evening again. At night, Little Treasure's fever had finally subsided and his condition was finally stable again.</p><br/><p>After a whole day and night of fussing, everyone could finally breathe a sigh of relief.</p><br/><p>Since Little Treasure was already okay, Lu Chongshan who had long been impatiently maintaining his composure finally could not hold himself back any longer.</p><br/><p>He walked into Little Treasure's room and said to Ning Xi, \"Miss Ning, thank you for all your care for Little Treasure this time. Later, I will get a driver to send you home.\"</p><br/>\n</div>"}