{"title": "Chapter 541: Stealing Man From Bro Xiao", "id": 541, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-541-stealing-man-from-bro-xiao", "volume_title": "Volume 6", "body": "<h1>Chapter 541: Stealing Man From Bro Xiao</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 541: Stealing Man From Bro Xiao</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Her chin was held firmly by his callused fingers, her lips starting to feel numb, Ning Xi was terrified.</p><br/><p>She would not have flirted had she known that this would happen. The frightening devil did not care about her feelings at all!</p><br/><p>She did not expect the devil would actually be jealous of a girl, and such intensely jealous too!</p><br/><p>Lu Tingxiao took his own sweet time and tasted her lips as if he was carefully enjoying the nectar of the gods, but of course, he stopped right before Ning Xi was about to explode.</p><br/><p>Ning Xi’s heart was racing quickly as she clenched her teeth together and raised her arms...she wanted to rip her wig off her head…</p><br/><p>Things had finally unraveled to that point and she could not let people misunderstood that he was gay, could she?</p><br/><p>Lu Tingxiao knew exactly what she wanted to do, so he grabbed her hands and stopped her.</p><br/><p>His eyes were focused on the person in front of him as if only she existed in this world. He told her quietly, \"You don’t have to. Isn’t it better this way? No other woman will come near me the next time.\"</p><br/><p>Ning Xi was astounded, her heartbeat almost at a roar now…</p><br/><p>Damn it! The devil was being too much! That ultimate move of his! She almost wanted to kiss him back!</p><br/><p>\"I...I’ll go to the washroom!\" In the end, Ning Xi broke off the kiss, freeing herself of Lu Tingxiao’s hands and went to the toilet hastily.</p><br/><p>Lu Tingxiao’s eyes shone, watching the girl’s back as she fled the scene. He then looked at everyone present, his gentle gaze quickly freezing into an ice-cold stare…</p><br/><p>Small Qiao was holding on to Big Qiao in extreme terror. \"Ah! Sis! What have I done?! What have I done?! Bro Xiao is going to kill me! I just tried to steal his man!\"</p><br/><p>Big Qiao was in deep shock as well but she tried to comfort her, \"Keep calm, nothing bad will happen to you. You didn’t know anything, plus they didn't say anything, we're innocent!\"</p><br/><p>\"No wonder he’s so close to Bro Xiao and Bro Jingli. Even Little Treasure! I’m so stupid, why didn’t I think of their relationship earlier?!\"</p><br/><p>The twins hid in the corner and tried to be invisible to the people around them. The fujoshis [1] among the crowd were practically having a nosebleed and everyone was raving about what had just happened…</p><br/><p>\"It has been a rumor for so many years that CEO Lu liked guys. It's just that no one went public with it, so it isn’t really a surprise, is it?\"</p><br/><p>\"Right...but to see it with my own eyes…\" The impact was too difficult to put into words!</p><br/><p>Many others nodded in agreement, the impact was powerful!</p><br/><p>Some people shrugged it off, \"Our society is way ahead now. This is completely normal. I’m not discriminating against the two of them. Plus, they actually looked really good together! That Tang guy looked even prettier than some of the ladies here tonight and they don’t look weird together!\"</p><br/><p>Many of them agreed, \"That kid is so arrogant that no woman could possibly hold him down! He definitely needs someone like Bro Xiao to tame him!\"</p><br/><p>\"Heh, that might not be the case. Bro Xiao was here just now and he was already flirting with everyone! First, it was the top socialite of Beijing, and then there were the twin sisters! In the end, Bro Xiao had to step in and publicize their relationship! Bro Xiao was totally under control!\"</p><br/><p>\"Tsk, no wonder Bro Xiao likes him so much!\"</p><br/><p>…</p><br/>\n</div>"}