{"title": "Chapter 564: Little Treasure’s Crying For You", "id": 564, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-564-little-treasure%E2%80%99s-crying-for-you", "volume_title": "Volume 6", "body": "<h1>Chapter 564: Little Treasure’s Crying For You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 564: Little Treasure’s Crying For You</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The banquet hall was getting crowded as more guests arrived and Ning Xi recognized some of them.</p><br/><p>The lady who was chatting with Ning Xueluo intimately at that moment was Li Yueling whom Ning Xi met at the audition in Las Vegas. The one beside her should be her mother, the president of Ling Horizon Fashion, Guo Hui. Ning Yaohua and Zhuang Lingyu were welcoming her warmly.</p><br/><p>Despite the constant flow of guests, Ning Xueluo was able to chat up with almost all of them. The guests looked at Ning Xueluo in a different light, awed by her.</p><br/><p>\"This girl is really something, she has a such a wide connection despite her young age!\"</p><br/><p>\"Sigh, it’s really frustrating when I compare my kid at home with her. She always dreamt about being a star but after spending so much money, there isn’t even a shadow of her on screen! Unlike Ning Xueluo with her own business and her own company!\"</p><br/><p>…</p><br/><p>A servant who was serving guests outside suddenly came rushing in and panted, \"Master...outside...outside…\"</p><br/><p>Ning Yaohua asked sternly, \"What's happened outside? Do you know how inappropriate it is for you to freak out in front of the guests?!\"</p><br/><p>The servant continued worriedly, \"No, Master! There’re...there’re important guests! Very important guests!\"</p><br/><p>Ning Yaohua was still unhappy. \"Who is it that made you freak out?\"</p><br/><p>With the Ning family’s position, the servant did not need to freak out even if the guests were from a renowned family.</p><br/><p>In the corner, Ning Xi was curious of the servant’s expression. Who did Ning Xueluo involve herself with this time?</p><br/><p>The servant explained, \"Just now...there was a car stopped in front of the entrance...but no one came out of the car. It was just parked there, so I paid it no mind but the car looked really prestigious. Then, I checked the number plate and it seems like...it’s a car from the Lu family!\"</p><br/><p>Upon hearing the servant, Ning Yaohua and Zhuang Lingyu were concerned. \"What? Lu family? Which Lu family?\"</p><br/><p>The servant trembled, \"Lu...Lu Corporation…\"</p><br/><p>Ning Xi spurted out her fruit juice.</p><br/><p>What?!</p><br/><p>Lu Corporation?</p><br/><p>Could it be...Lu Tingxiao?</p><br/><p>It could not be! Why would the devil be here?</p><br/><p>\"Uhm...Sis Xin, I’ll excuse myself to make a phone call first!\"</p><br/><p>Ning Xi was still worried as she went outside to give Lu Tingxiao a call.</p><br/><p>The phone call was picked up after ringing only once and a man’s deep voice came through, \"Hey.\"</p><br/><p>It was quiet on the other side of the phone and she could not determine where he was.</p><br/><p>Ning Xi gulped and asked, \"Hey...Lu Tingxiao, where are you right now?\"</p><br/><p>\"At the entrance of the Ning residence.\"</p><br/><p>Ning Xi was annoyed. \"What are you doing? Why are you here?\"</p><br/><p>\"Because you didn’t come back. Little Treasure was crying for you.\"</p><br/><p>Her hard features softened when she heard about her baby Little Treasure. \"Ah, I’m really sorry, I didn’t expect to stay here for so long either but I’m going to be done soon and I’ll be back as quick as I can!\"</p><br/><p>\"Mmm, we’ll wait for you.\"</p><br/><p>Ning Xi was speechless.</p><br/><p>She actually meant for him to go back with Little Treasure first...what if something happened and she had to stay longer?</p><br/><p>As she was thinking of how to persuade them to leave first, there was a noise from the other end of the line, like the phone was being passed and a weak voice came through this time, \"Sister-in-law, I was almost frozen to icicles by this two cold people while waiting for you! When will you be done? Please come back soon.\"</p><br/>\n</div>"}