{"title": "Chapter 574: Do You Like My Brother?", "id": 574, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-574-do-you-like-my-brother", "volume_title": "Volume 6", "body": "<h1>Chapter 574: Do You Like My Brother?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 574: Do You Like My Brother?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi brought Little Treasure to sleep in the room after she entered her house, then she opened the fridge and looked for cooking ingredients for the soup base she was going to cook.</p><br/><p>Thanks to Little Treasure, she had stocked up on a lot of food. All sorts of ingredients were available in her fridge. In fact, it was enough to prepare a steamboat feast anytime.</p><br/><p>Lu Tingxiao naturally took over the vegetables from her and helped to wash them. Ning Xi looked at him and helped to roll his sleeves up for him.</p><br/><p>Lu Jingli felt like he was the largest third wheel in the world at that moment, so he stayed in the living room and watched television alone.</p><br/><p>The ingredients were soon prepared, the steamboat soup base emitting an aromatic smell which was extremely tempting.</p><br/><p>Lu Jingli could not wait anymore, so he rushed to the table and saw that the pot was separated into two sections - one contained clear soup base and the other was a piquant spicy soup. Lu Jingli was confused. \"Xiao Xi Xi, why did you make two soup bases?\"</p><br/><p>\"Your brother doesn’t eat spicy food,\" she replied while setting up the table.</p><br/><p>\"Oh!\" Lu Jingli bit on the chopsticks, then asked again, \"Xiao Xi Xi! Do you like my brother?\"</p><br/><p>Ning Xi choked as she was drinking some water, almost biting her own tongue. She then nervously looked at Lu Tingxiao. \"What are you talking about!\"</p><br/><p>\"Well, you’ve been treating my brother exceptionally well!\" Lu Jingli mumbled.</p><br/><p>\"Would there be any subordinate who doesn’t want to please their boss? Don’t think too much about it, alright? If you’re accusing me again, I’m going to give you a good beating!\" Ning Xi handed Lu Tingxiao a pair of chopsticks after she clarified herself, \"Boss, don’t listen to him! I’m always loyal to you and will never have weird thoughts about you.\"</p><br/><p>Lu Tingxiao took the chopsticks from her and looked at her, \"I don’t mind.\"</p><br/><p>Lu Jingli and Ning Xi were speechless.</p><br/><p>After some munching, Lu Jingli patted his stomach in satisfaction, having gained his strength to start gossiping again. \"Xiao Xi Xi, can I ask you a question?\"</p><br/><p>\"What?\"</p><br/><p>\"How do you feel...about Su Yan?\"</p><br/><p>Lu Tingxiao’s hand twitched a little as he was serving Ning Xi some vegetables.</p><br/><p>\"How do I feel?\"</p><br/><p>\"Well, I’m asking if you still can’t get over him! Why must you make me say it so clearly?!\"</p><br/><p>Ning Xi rolled her eyes. \"Do you think it’s possible?\"</p><br/><p>Lu Jingli bit his chopsticks again. \"Why not? First love...is usually the most unforgettable one isn’t it?\"</p><br/><p>He then glanced at his brother. Ning Xi was his brother’s first love!</p><br/><p>Why did everyone think she still could not get over Su Yan? First , it was Ning Tianxin and now Lu Jingli!</p><br/><p>Ning Xi munched on a roasted potato and said in dissatisfaction, \"The world is so huge that it contains so many hot guys out there. I’m not the shy little girl I was back then. There’s no point staying on a tree when a jungle is waiting for me, alright? I already have someone I like in mind!\"</p><br/><p>Both Lu Jingli and Lu Tingxiao straightened their backs at full attention.</p><br/><p>Lu Jingli would never let this chance pass, so he quickly followed up. \"I’ve heard about it before, then who is it? What does he look like? Is he more handsome than I am? What kind of man could steal Bro Xi’s heart away? Quickly tell me!\"</p><br/><p>Ning Xi was annoyed by Lu Jingli’s excitement, \"Let me think…\"</p><br/><p>\"Quickly!\"</p><br/><p>Lu Tingxiao sat there in silence, not wanting to continue listening, but he could not leave, even though he knew that the answer was going to hurt him.</p><br/>\n</div>"}