{"title": "Chapter 579: Aunty Xiao Xi is On A Date?", "id": 579, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-579-aunty-xiao-xi-is-on-a-date", "volume_title": "Volume 6", "body": "<h1>Chapter 579: Aunty Xiao Xi is On A Date?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 579: Aunty Xiao Xi is On A Date?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli shut up, not daring to say anything further.</p><br/><p>In such a situation, everything he said felt like a risk...</p><br/><p>At the other table, Ning Xi and Xi Shiqing had started to go deeper into conversation. Even though the table was quite a distance away from the Lu brothers, the restaurant was quite quiet, so if they listened closely, they could hear the conversation.</p><br/><p>Because he was late, Xi Shiqing felt that he should explain himself out of basic courtesy to his date, thus he started, \"I'm really sorry. I actually saw an elderly woman fall on the way here, so I sent him to the hospital and that took quite some time.\"</p><br/><p>Ning Xi blurted, \"Pfft!\" and could not help but say, \"Mmm...if another man said such things to me, I would definitely doubt their IQ level for not being able to find a more sincere excuse. However, since it's you, Mr. Xi, then I would believe you because you do look like the kind of person who would help an elder woman cross the road and send a lost child home!\"</p><br/><p>Xi Shiqing laughed out loud when he heard this. \"Ms. Ning, are you trying to say I look like a kind person?\"</p><br/><p>Ning Xi nodded. \"Not just that! Not only are you kind, you're practically at the level of Kim Tsai Zi the monk!\"</p><br/><p>Xi Shiqing laughed at her cute description and he lowered his chin slightly. \"Miss Ning, you're very interesting.\"</p><br/><p>Ning Xi paused. Damn it, it was her first time meeting someone this special and she could not hold herself back, ending up spurting out such sentences.</p><br/><p>She cleared her throat and quickly got to the point, \"Mr. Xi, I'll just be honest here. Actually, I'm not all up for this blind date but unfortunately, my grandfather already helped me to arrange a date with you, so I had to come and explain the situation to you. I hope you will forgive me for this.\"</p><br/><p>Xi Shiqing did not seem angry or change his expressions when he heard this. However, somewhere deep in his eyes, something seemed to have dulled...</p><br/><p>Behind her, Lu Jingli heard Ning Xi's words and quickly perked up his ears, regaining some spirit. \"Nice one, Xiao Xi Xi, immediately knock him out!\"</p><br/><p>After Xi Shiqing heard what Ning Xi said, he expressed instantly, \"I understand, even though I am slightly disappointed, I respect your wishes.\"</p><br/><p>Ning Xi brows raised slightly at his diplomatic answer. Slightly disappointed? Did he mean to say that he was interested in her?</p><br/><p>No way! Nothing she wore today should have fitted this man's aesthetic taste. He was just saying it to be charming, wasn’t he? Mmm, it was a possibility with this type of men!</p><br/><p>\"So, you don't need to feel pressured. Let's just treat today's meal as one between normal friends, okay?\" Xi Shiqing said.</p><br/><p>Ning Xi suddenly realized that this man did not look extremely handsome but he had a voice that was alluring and especially easy on the ears!</p><br/><p>Since he had said it that way and he was so accommodating without needing her to explain further, Ning Xi naturally felt it would be cruel to reject him. \"Of course!\"</p><br/><p>Lu Jingli bit sharply into a slice of salmon. \"Damn it! I misjudged! I thought it was a saint who wouldn't get close to women yet, he was clearly tempted by seduction! In such a situation, if he was not interested in her, he would have immediately called for the bill and left, no need for further contact. But he actually asked her to enjoy a meal together ‘in the name of friendship’. Clearly, this guy has underlying motives!\"</p><br/><p>Lu Jingli continued to insult Xi Shiqing while Lu Tingxiao looked miserable and Little Treasure, who was admiring Aunty Xiao Xi's back, finally realized that something was odd...</p><br/><p>Mmm, why is Aunty Xiao Xi eating with another strange uncle?</p><br/><p>Little Treasure pursed his lips, thought about it, then wrote on the board: [Date?]</p><br/>\n</div>"}