{"title": "Chapter 589: This Is My Reward For Helping You Today", "id": 589, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-589-this-is-my-reward-for-helping-you-today", "volume_title": "Volume 6", "body": "<h1>Chapter 589: This Is My Reward For Helping You Today</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 589: This Is My Reward For Helping You Today</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli wanted to run around in joy!</p><br/><p>Oh! I'm so jealous! How nice was it to have a son! It was as though God had sent assistance Himself!</p><br/><p>Lu Tingxiao actually took a while to react to Ning Xi's out-of-the-blue invitation.</p><br/><p>Even though Little Treasure had always been his trump card, this was the first time the little bun had genuinely taken the initiative to help him.</p><br/><p>Was it because of what had happened tonight? Then, this was a rare case of getting luck out of a misfortune!</p><br/><p>Finally, Lu Tingxiao stayed while Lu Jingli the bachelor went home tearfully.</p><br/><p>In the bedroom.</p><br/><p>Ning Xi accompanied Little Treasure to lie on the bed and sang him to sleep. Lu Tingxiao sat on the other side of the bed, his sleeve still being held on tightly by the little guy.</p><br/><p>After Little Treasure had been coaxed to sleep, Ning Xi asked, \"Why don't you sleep with Little Treasure tonight? I'll sleep in the guest room.\"</p><br/><p>\"We can sleep together,\" said Lu Tingxiao without a hitch.</p><br/><p>Ning Xi was shocked to hear his proposition and felt slightly awkward. She scratched her head and said, \"Ah? That would not be too appropriate, would it?\"</p><br/><p>Lu Tingxiao replied, \"No, I don't mind.\"</p><br/><p>Ning Xi was speechless. The devil...was getting naughty!</p><br/><p>The Big Boss already said he didn't mind being taken advantage of but could she say that she did?</p><br/><p>It was a good thing that the bed was huge, so even with the little bun in the middle, each of them had their own personal space.</p><br/><p>When Ning Xi entered the room after finishing her shower, Lu Tingxiao was already lying on the bed. His hair was wet and messy post-shower, while he wore pajamas and was looking at Little Treasure with a gentle gaze, like an ordinary father. Ning Xi felt her heart beat faster at the sight of them together.</p><br/><p>When he heard her footsteps, Lu Tingxiao looked up and ordered her, \"Finish the milk before going to bed.\"</p><br/><p>\"Oh...\" Why did it feel like Lu Tingxiao had two children to look after?</p><br/><p>After Ning Xi finished the milk, she lay on the other side of Little Treasure.</p><br/><p>Lu Tingxiao turned off the light and only left a dim night light on. He lay on his side and kissed his son's forehead.</p><br/><p>Seeing Ning Xi watch him, Lu Tingxiao raised his brows. \"You want a goodnight kiss too?\"</p><br/><p>Ning Xi widened her eyes and shook her head quickly. She was just thinking to herself that the way the devil took such gentle care of Little Treasure was so charming that she could not help but to continue looking a little longer. There was no way that she would have such inappropriate motives!</p><br/><p>Lu Tingxiao eyes shone teasingly, then he suddenly leaned over Little Treasure. With Ning Xi's eyes still in its bewildered state, he kissed her on the lips.</p><br/><p>Ning Xi was shocked.</p><br/><p>Damn it! Devil, what are you doing? Didn't we already say we were just accompanying Little Treasure to sleep?</p><br/><p>Lu Tingxiao squinted his eyes and told her, \"This is my reward for helping you take that bullet today.\"</p><br/><p>Ning Xi was speechless. She had nothing to reply to him...</p><br/><p>The next morning.</p><br/><p>Ning Xi woke up in a daze and felt like she had never slept that well before. She had no dreams the entire night and her whole body felt warm, so warm that she did not want to wake up.</p><br/><p>No, she still had to wake up to make a healthy breakfast for the little bun!</p><br/><p>Ning Xi finally opened up her eyes.</p><br/><p>The moment she did, what she saw was a bare chest...</p><br/><p>What?!!!</p><br/><p>Damn it! What was going on? Why...why would she sleep so carelessly?!</p><br/><p>She didn't know how ended up on Lu Tingxiao's side. In fact, her entire body was sprawled on him until his pajamas had been messed up by her, revealing his peach-colored skin. As for her hand, it was casually lying on his naked belly and chest.</p><br/><p>Ning Xi quickly got up and initially wanted to move back to her own side but in her panic, she accidentally touched Lu Tingxiao...in a place she shouldn't have...</p><br/>\n</div>"}