{"title": "Chapter 597: Damn It, He Was Toppled!", "id": 597, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-597-damn-it-he-was-toppled", "volume_title": "Volume 6", "body": "<h1>Chapter 597: Damn It, He Was Toppled!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 597: Damn It, He Was Toppled!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Outside the room, Lu Jingli was just peeking in from the window when he saw this earth-shattering scene. Sister-in-law had actually flopped onto Xi Shiqing and made him topple over!</p><br/><p>In that moment, Lu Jingli was so intimidated that his heart almost leaped out of him.</p><br/><p>What to do, what to do? Should he go in to stop them?</p><br/><p>Oh, what a classic combination: the monk devoid of worldly desires and the wild and unruly but alluring woman! He suddenly felt that they made an oddly good match.</p><br/><p>Damn it! If his brother ever found out that he had such a thought, he would definitely be a corpse!</p><br/><p>Not only did Ning Xi topple Xi Shiqing over, she also dragged her warm and slim fingers across his brow all the way to his lips and even inched closer towards him in a deliciously slow, torturous way...</p><br/><p>At this moment, Xi Shiqing was akin to a lake of stagnant water that suddenly met a storm. His entire body was rigid like a bow pulled to its maximum tension. His long fingers were balled tightly into a fist and even his breath was out of rhythm, bordering on raggedy inhalations. As he watched Ning Xi's lips about to plant on him, he shut his eyes tightly as if in denial and tried to turn his head away slightly as blood rushed to his ears...</p><br/><p>Just as his entire being was being shaken to the core, he heard a cold voice beside his ear saying, \"The bonds of the world are still there! Your six roots of sensations aren't pure and clean! Xi Shiqing, how can you become a monk? What kind of religious life are you trying to take refuge in? What kind of monk will you be? Aren't you afraid of contaminating Buddhist sacred grounds?\"</p><br/><p>Upon hearing her bold statement, Xi Shiqing's boiling blood instantly cooled down, his face as pale as a ghost.</p><br/><p>Outside the window, Lu Jingli watched, starstruck. Wow! My sister-in-law is way too cool! He would never have thought of such an ingenious trick! Thank goodness he had not rushed in on impulse, or else he would have ruined her plans...</p><br/><p>Xi Shiqing opened up his mouth as if he wanted to say something, but he did not utter a single word. He just opened and closed his mouth like a goldfish. Even when he had debated with Master Xuan Jing about Buddhism teachings, he had never lost...yet, at this very moment, he was utterly speechless.</p><br/><p>Because he could not control his own heart, he could not control his feelings and his desire...</p><br/><p>As she watched Xi Shiqing trying to come to terms with his failure, Ning Xi squinted and prodded at him. \"What is it? Still in denial? Do you want me to continue?\"</p><br/><p>\"No...there's no need...\" Panic flashed across Xi Shiqing's eyes and he looked miserable. \"You're right, my six roots of sensations are impure and corrupted.\"</p><br/><p>Ning Xi then got up and walked towards Xi Shiqing to offer her hand to help him up. Even though she was aware that her trick was cruel in nature, she knew that she had to be harsh to defeat Xi Shiqing in such a stubborn situation.</p><br/><p>At that moment, all serenity vanished from Xi Shiqing's face. He did not know how to describe his current feelings at all. No one, including Ning Xi, could understand why he would make such a rash decision. He had waited for five whole years before such an opportunity was unexpectedly presented before him. However, before he could properly appreciate it, the window of opportunity turned into a slab of concrete.</p><br/><p>If he had never had hope in the first place, maybe he would not feel such a dark cloud of despair.</p><br/><p>Even now he could still reminisce the moment he watched them hug and kiss each other, the kind of ache that tore his heart apart bubbling from within again.</p><br/><p>Then, he remembered that the man was the CEO of the Lu Corporation, Lu Tingxiao.</p><br/><p>Even though he had only met him once at the ribbon cutting ceremony at Jade Treasury for its inaugural opening, he definitely recognized him.</p><br/><p>Had it been someone else, he might still stand a chance to compete for Ning Xi's affections, but it was Lu Tingxiao. Of all people, it had to be him!</p><br/><p>Before he could even do anything, he had already lost the battle miserably.</p><br/>\n</div>"}