{"title": "Chapter 596: Nearly Point-Blank", "id": 596, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-596-nearly-point-blank", "volume_title": "Volume 6", "body": "<h1>Chapter 596: Nearly Point-Blank</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 596: Nearly Point-Blank</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Father Xi was on the line now, saying, \"Just come back here, Xiao Xi. You don’t understand Shiqing. While he may look soft on the outside, he won’t compromise once he has decided on something. He really is that adamant.\"</p><br/><p>\"He’s right, Xiao Xi. Don’t push yourself too hard, we’re not blaming you. It really isn't your fault,\" Mother Xi echoed, afraid that Ning Xi was putting all the blame on herself.</p><br/><p>\"Uncle, Aunty, I understand but I won’t back off until I’ve tried everything I can. Let me give it one more shot!\"</p><br/><p>…</p><br/><p>Ning Xi’s expression changed swiftly after she ended the call.</p><br/><p>Knocking him out and taking him back by force would not be the best solution. If Xi Shiqing was not going to change his mind, he would just leave after he waking up anyway.</p><br/><p>What should she do?</p><br/><p>At the same time, a black car was parked under a big tree near the temple.</p><br/><p>Lu Tingxiao frowned as he checked the time on his phone.</p><br/><p>\"What’s taking her so long?\" Lu Jingli had already arrived to meet his brother.</p><br/><p>Lu Tingxiao got out of the car to light a cigarette, looking impatient.</p><br/><p>Lu Jingli scratched his head and tailed his brother. \"We can’t just sit here and wait. Should we go in and see what’s happening?\"</p><br/><p>\"I can’t.\"</p><br/><p>\"Ugh, okay...you're not the best person to go...you might make him go crazy again…\" Lu Jingli mumbled. He then said, \"I’ll go then! I’ll just go and check on what’s happening! It’d be really terrible if the Xi's pressured Ning Xi and she’s forced to tell them what actually happened last night. They might even force her to try and get together with Xi Shiqing for a little while!\"</p><br/><p>This was what Lu Tingxiao had been worrying about.</p><br/><p>With Ning Xi’s personality, if people from the Ning family went soft on her, she would definitely try everything she could to bring Xi Shiqing back.</p><br/><p>\"Bro, I’ll go now, I’ll let you know immediately if anything happens! I’ll stop Sister-in-law if she’s going to try something risky!\" Lu Jingli went in as Lu Tingxiao kept silent.</p><br/><p>Little Treasure poked his little head out from the car and held up his writing board: [Father, is there anything that I can help with?]</p><br/><p>The little guy was actually going to cooperate after what happened last night.</p><br/><p>Lu Tingxiao looked at his son with a loving gaze. \"Thank you but you can’t help me this time.\"</p><br/><p>The little bun looked down disappointedly.</p><br/><p>Ning Xi went back into the room once again.</p><br/><p>After asking around, Lu Jingli quickly went to the zen room.</p><br/><p>Xi Shiqing saw Ning Xi return but he remained expressionless as if his world only consisted of him and the scripture book he was holding. There was only the Buddha in his heart and he was completely determined to ascend towards the true meaning of Buddhism.</p><br/><p>Ning Xi stepped right in front of him and snatched his book of scripture out of his hands.</p><br/><p>As expected, Xi Shiqing was not angry and stayed calm in his seated position.</p><br/><p>Ning Xi tossed the book away and closed in on Xi Shiqing swiftly, one of her knee positioned beside his torso, an arm crossing over him and her face a millimeter-close to his, nearly at point-blank...</p><br/><p>Xi Shiqing’s eyebrows twitched ever so slightly.</p><br/><p>As he was about to say something, Ning Xi stole his chance as she pressed on his shoulder and held him down, using her body to envelope his at the same time…</p><br/>\n</div>"}