{"title": "Chapter 594: Changed Totally", "id": 594, "volume": 6, "url": "http://boxnovel.org/hidden-marriage-chapter-594-changed-totally", "volume_title": "Volume 6", "body": "<h1>Chapter 594: Changed Totally</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 594: Changed Totally</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Elder Xi was going to lecture his son about his inappropriate words about Buddhism, he stopped when he thought of his grandson’s current situation.</p><br/><p>Albeit being a religious Buddhist, he still could not accept his grandson becoming a monk…</p><br/><p>From the conversation between his parents and his grandfather, Ning Xi found out why Xi Shiqing was such a nice person.</p><br/><p>They were all kind people, comforting her instead of blaming her or scolding her right away, which was what she had expected.</p><br/><p>This made Ning Xi felt even guiltier.</p><br/><p>It would not sit well with her if she was the actual reason Xi Shiqing decided to become a monk!</p><br/><p>She was doubtful earlier but from their conversation earlier and how they could not think of any other reason for his sudden decision, then it might just boil down to last night's incident.</p><br/><p>\"Well, since I’m already here...I don’t have much confidence but I’ll try my best, alright?\" Ning Xi told them.</p><br/><p>Mother Xi was very grateful and she squeezed Ning Xi's hands. \"That’s great, Xiao Xi! Thank you!\"</p><br/><p>Father Xi’s expression softened. \"You don’t have to pressure yourself too much. His decision isn’t related to you anyway but just give it a try!\"</p><br/><p>They tried to conceal their intense worry when comforting Ning Xi since she was now their only hope left.</p><br/><p>Ning Xi took a deep breath and walked towards the room Xi Shiqing was in.</p><br/><p>Ning Zhiyuan mumbled, \"Let’s hope that Xiao Xi can really persuade Shiqing…\"</p><br/><p>He was actually not confident at all. Shiqing looked really determined and probably nothing could deter him even if his reason for becoming a monk was related to Ning Xi.</p><br/><p>Ning Xi finally reached the room.</p><br/><p>Following a path of mossy green pebbles, there was a quiet yard where flowers bloomed amongst lush bamboo plants and zen seemed to be gentle dynamic energy flowing around.</p><br/><p>The door to the room was opened and a curtain billowed in the wind. The air was silent but not stifling still as if it was a different world compared to the outside.</p><br/><p>Ning Xi went up to the entrance and hesitated a little, then she lifted the curtain up.</p><br/><p>Through the window, Xi Shiqing sat quietly behind a screen full of Buddhist scriptures with a scripture in his hands. He was obviously very focused on going through it.</p><br/><p>Despite wearing a suit, he already imbued the character of a monk’s.</p><br/><p>Ning Xi realized that she actually felt frightened of this version of Xi Shiqing.</p><br/><p>It had just been one night. How did he suddenly change into such a different person?</p><br/><p>He was a clean-cut man before but a worldly one. The Xi Shiqing before Ning Xi now seemed as if he had lost all his earthly desires.</p><br/><p>Ning Xi had a splitting headache throbbing. Xi Shiqing’s situation was much direr than she had thought!</p><br/><p>She could not back out now. She had to take responsibility for what she had done and the people outside were waiting for her.</p><br/>\n</div>"}