{"title": "Chapter 616: I Switched It Off, Any Complaints?", "id": 616, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-616-i-switched-it-off-any-complaints", "volume_title": "Volume 7", "body": "<h1>Chapter 616: I Switched It Off, Any Complaints?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 616: I Switched It Off, Any Complaints?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi looked at the man and gently caressed his face. She ran her slender fingers along his high nose, his cold eyes, his thin lips…</p><br/><p>She wanted to remember his face, every inch of it, every angular surface, every stubble…</p><br/><p>\"Okay?\"</p><br/><p>She wanted him to accompany her even for just a little while longer.</p><br/><p>Even though he knew that she was not sober, he could not refuse her request. \"Okay.\"</p><br/><p>Ning Xi gave him a satisfied smile and closed her eyes in peace.</p><br/><p>But after a while, she peeked at him and whispered, \"I still can’t fall asleep. Can you pretty please kiss me?\"</p><br/><p>\"Sleep!\" With a piercing look, Lu Tingxiao pulled the sheets higher, covering her.</p><br/><p>\"Oh…\" Ning Xi was disappointed.</p><br/><p>Lu Tingxiao softened when he saw Ning Xi’s mournful eyes and he kissed her on the forehead. As he was preparing to leave, the girl threw her arms around his neck and kissed him on the lips, molding her lithe body as close as she could to his…</p><br/><p>It was not his first time kissing her; he had tried many methods to get closer to her before but this was the first time she kissed him on her own accord…</p><br/><p>Lu Tingxiao felt her sweet, gentle lips undulating against his as an indescribable feeling rose in him…</p><br/><p>His emotions ushered him to indulge in this sweetness while his rationale practically yelled at him. Who did she think was she kissing and who did she take him for?</p><br/><p>His rationale was straying further and further away, drowned out by the lust. At last, he hugged her and was going to take the lead but she fell on his chest…</p><br/><p>Lu Tingxiao panicked and quickly helped her up, then he saw her fast asleep…</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>This girl acted all drunk and crazy, turned him on and now she was asleep?!</p><br/><p>Ning Xi was exhausted after a long flight. Even on the plane, she had been busy settling matters related to her studio to the point that she could even fall asleep while seducing the devil. Even she did not expect this herself…</p><br/><p>While she was in her slumberland, she faintly felt a feather-like sensation on her forehead which brushed downwards to her lips. At first, it hurt slightly, then it became gentler…</p><br/><p>Ning Xi slept soundly and by the time she woke up, the sky was already dark.</p><br/><p>Ning Xi quickly sat up and turned on the table lamp. She checked the clock on the table - she had been sleeping for two hours! What the heck did Lu Jingli give her? Just one gulp of that wine and down she went!</p><br/><p>\"How did I sleep for so long…\" She thought she would just take 10 minutes. She had a lot of things to work on and she wondered if the studio tried calling her…</p><br/><p>Ning Xi quickly looked at her phone, then she realized it was switched off. \"Damn! Who switched off my phone?!\" She had charged her phone fully not too long ago. It was impossible for it to run out of battery so soon.</p><br/><p>\"I switched it off. Any complaints?\" A cold voice suddenly came from the sofa opposite her.</p><br/><p>Ning Xi trembled at the voice. She slowly turned her head towards the man. \"No...nothing...as you wish…\"</p><br/><p>\"Are you sober now?\" Lu Tingxiao looked at her while closing his file.</p><br/><p>\"Yes, very sober…\" She knew he was going to get back at her now.</p><br/><p>\"Then, let's talk about your issues at work.\"</p><br/><p>As expected.</p><br/><p>Ning Xi remembered the last few moments before she had fallen asleep just now. Was it too late to continue seducing the devil now?</p><br/>\n</div>"}