{"title": "Chapter 614: Boss, Can I Bribe You?", "id": 614, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-614-boss-can-i-bribe-you", "volume_title": "Volume 7", "body": "<h1>Chapter 614: Boss, Can I Bribe You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 614: Boss, Can I Bribe You?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Bro Xi, what are you doing?\" Lu Jingli asked weakly.</p><br/><p>Ning Xi had a terrifying expression on her face. She only uttered, \"Your brother.\"</p><br/><p>She then walked towards the CEO's office.</p><br/><p>Lu Jingli was speechless by the situation that had just unfolded.</p><br/><p>Brother? What was happening?</p><br/><p>Lu Jingli could only watch as Ning Xi went into the CEO's office and he waited outside anxiously.</p><br/><p>The moment she got in, Little Treasure went up to her. She had not seen Little Treasure for a few days as she had been traveling for the past one week.</p><br/><p>She kissed him and did not want to let go but she remembered what she had to do, so she told him gently, \"Baby, can you go to your Second Uncle for a while? Spare me 10 minutes here.\"</p><br/><p>Little Treasure nodded obediently and went out to look for Lu Jingli.</p><br/><p>Lu Jingli was nervously wringing his hands and pacing up and down nervously outside.</p><br/><p>10 minutes, she said? Would that be enough?</p><br/><p>After Little Treasure went out, Lu Tingxiao looked at the girl with his stormy eyes, his real emotions barely showing through. \"You’re back.\"</p><br/><p>The girl looked slimmer and her aura was slightly different as well. It seemed colder than before, conflict flashing momentarily in her eyes.</p><br/><p>What did not change was his impulse to hug her right away…</p><br/><p>During that period of time, he thought about flying over to her place to see her even for a single glance but he did not dare not to.</p><br/><p>He could not face her with the knowledge of what he had done behind her back. He knew that she was the love of his life but he had still done something that might hurt her…</p><br/><p>\"Mmm.\" Ning Xi put down her luggage and handbag, then took off her coat and walked towards Lu Tingxiao.</p><br/><p>As Ning Xi came closer, Lu Tingxiao’s eyebrows furrowed and he interrogated in a slightly unhappy tone, \"Did you drink?\"</p><br/><p>\"Yeah.\"</p><br/><p>\"You promised Little Treasure you’d cut down on alcohol.\" With such a thick cloying stench of alcohol on her, she seemed to have drunk a lot.</p><br/><p>Ning Xi rested her palms on his table and grinned at him. \"Are you going to tell on me?\"</p><br/><p>The notches between his eyebrows deepened even more as Ning Xi displayed her indifference. \"If you don’t take care of yourself, I might consider putting your current work on a halt.\"</p><br/><p>Ning Xi felt bitter about this man’s unique way of showing his concern. She was probably going to die soon, so what was the point of taking care of herself? What was there left to ponder so much about? She should just let herself go and not bother concealing anything anymore...</p><br/><p>Lu Tingxiao seemed very upset. He picked up the phone and was about to call Ling Zhizhi.</p><br/><p>\"Hello…\"</p><br/><p>Before Lu Tingxiao could continue any further, Ning Xi pressed down on the hang up button and cut off the line. Then, much to his shock, she suddenly closed in and pressed her lips against his…</p><br/><p>Lu Tingxiao’s hand froze with the dead dial tone still beeping on the phone. His expression was indescribable and he was rigid as a statue.</p><br/><p>Ning Xi slowly backed away after a few seconds. She looked at him seductively with a blush creeping to the apples of her cheeks and in an innocent tone, she said, \"Boss, can I bribe you?\"</p><br/>\n</div>"}