{"title": "Chapter 625: Full Score Ten Points!", "id": 625, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-625-full-score-ten-points", "volume_title": "Volume 7", "body": "<h1>Chapter 625: Full Score Ten Points!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 625: Full Score Ten Points!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Shortly after the prologue, the music suddenly turned into a high and the venue started to turn dark.</p><br/><p>The first model then stepped out.</p><br/><p>The classic red gown was elegant and bedazzling as if what was worn on her was not a dress but a blood-red sun setting on the horizon. The details were a result of Gong Shangze's expertise with Chinese elements such as traditional embroidery and cloud motifs.</p><br/><p>Even though it was very attractive, when compared to David's luxurious design earlier, it was practically a wallflower, even making the crowd tired of evaluating the aesthetics.</p><br/><p>Everyone present just skimmed a look at it before scoffing. However, when the dress came into the brighter area and its entire look was revealed, everyone's gaze was fixed onto it!</p><br/><p>Even Ning Xi was shocked herself. \"How!?\"</p><br/><p>Gong Shangze's designs that he had submitted were still his originals. They were Sunset, Aurora, Cherry Blossom, Waves, Snowy Forest, and Starry Night Sky. Six types of dresses carrying elements of nature as the color palette, supplemented by Chinese traditional techniques.</p><br/><p>However, what was special was that every dress had different degrees of burns...</p><br/><p>The trace of burns did not look like flaws. In fact, it unexpectedly displayed an unusually special decadent elegance, instantly stealing everyone's attention!</p><br/><p>After a while, everyone finally regained their senses and started clapping. The awed photographers used their keen skills and quickly aimed their cameras towards the stage.</p><br/><p>\"Oh, wow. Burn marks! The ones on that red dress are so beautiful! It gives me the feeling of a princess who is lonely but remains elegant!\"</p><br/><p>\"That sea blue mermaid dress is so gorgeous too! The tail has been burnt to almost nothing, but it's tragically beautiful! Makes me think of the tale of the little mermaid princess!\"</p><br/><p>\"So unique! But how did they think of this?\"</p><br/><p>...</p><br/><p>More and more people started looking towards the stage, every one of them astonished.</p><br/><p>After a while, the screen flickered with the theme of the participating work: Nirvana.</p><br/><p>\"Brilliant! Too brilliant!\" One of the judges immediately stood up emotionally, holding his hand to his chest and tears welling up in his eyes.</p><br/><p>\"It is indeed a wonderful idea. It's been so long since we've seen such spirited work!\"</p><br/><p>\"Haha, this newbie's got guts! But I like it!\"</p><br/><p>...</p><br/><p>Because of the way it was presented, everyone's attention was focused on how brilliant the theme was and no one noticed the Chinese elements.</p><br/><p>Ning Xi was moved beyond words. No wonder Gong Shangze's hand was burnt, he had actually...</p><br/><p>How much determination did he need to personally burn his hard work of more than half a month?</p><br/><p>Giving it life after death was deserving of the meaning of the designs and its new theme: Nirvana Reincarnated.</p><br/><p>The host of the award ceremony came from a fashion design background. He stared at the last design for a long time before regaining his senses and remembering he had a job to do. He lightly coughed and said, \"Up next, let's see the scores from our judges!\"</p><br/><p>One after another, the judges raised their scoreboards.</p><br/><p>The first judge: 10 points!</p><br/><p>The second judge: 10 points!</p><br/><p>The third judge: 10 points!</p><br/><p>...</p><br/><p>There were five 10 points in a row!</p><br/><p>Finally, it came to the last judge, Qu Guanyang, who had the reputation of being a picky Chinese designer.</p><br/><p>Earlier for David's work, he had given the lowest score. He had been a judge for the past eight events and was famous for being stringent. He had never once given a full score!</p><br/><p>At that moment, everyone's gaze was fixed on Qu Guanyang's hand.</p><br/><p>After a torturous wait, he slowly revealed his scoreboard: 10 points!!!</p><br/>\n</div>"}