{"title": "Chapter 623: Do Your Designs Have To Be So Good?", "id": 623, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-623-do-your-designs-have-to-be-so-good", "volume_title": "Volume 7", "body": "<h1>Chapter 623: Do Your Designs Have To Be So Good?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 623: Do Your Designs Have To Be So Good?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The trio watched the other participating designs patiently and soon, it was finally their turn to display their pride and joy on stage.</p><br/><p>However, to their utter confusion, the next girl that strutted on stage was not their model but another participant's!</p><br/><p>\"What's happening?\" Ning Xi stared incredulously.</p><br/><p>Han Momo quickly said, getting to her feet, \"I'll go backstage to ask!\"</p><br/><p>Very soon, Han Momo returned with tears welling up and said between pants, \"The organizers said that we have been rearranged to be the last to go on. When I asked them why, they actually dared to tell me that going last will be even better since we can be the finale. But, the second from the last to be on stage is David. Our design is already very similar to theirs and now they have intentionally put us right after them. Forget about winning any award; we will definitely be criticized to ashes!\"</p><br/><p>They had no doubt that this move was probably executed by that model, Angie. That woman was notorious in the industry for being rude and unreasonable. One wrong move and she would stir trouble up for you.</p><br/><p>At last, it was Gong Shangze who consoled them nonchalantly, \"No problem, if my designs are really considered to be the work of plagiarism, the arrangement doesn't really matter anyway.\"</p><br/><p>The competition was based on points system on the spot. The six judges would total up an average score assigned to the design. Thus far, out of all the designs that had been presented, five of them had already received scores above nine. The competition was very tight among all of them and tension was high.</p><br/><p>Unfortunately for Yagyu, even though he had put in a lot of thought to his work, he only received seven points. It was apparent that the judges did not really like his mere following of the trend.</p><br/><p>At that moment, the venue suddenly burst into a frenzy of whoops of admiration and the rapid clicking of cameras.</p><br/><p>It was David's turn to shine.</p><br/><p>Even Ning Xi, Han Momo and Gong Shangze himself were very fascinated by the models on stage. Of course, the most dazzling piece was worn by Angie. The long dress was loaded with flowers like the coming of spring, instantly giving the onlookers an energetic vibe. The vintage embroidery combined with modern dimensional tailoring worked to fuse the old and the new as well as the East and the West, successfully showing off the perfect merging of traditional culture and modern fashion. It also fully corresponded with the theme of \"Life\".</p><br/><p>With such an internationally acclaimed model as Angie, high-quality brocade material, and one of the finest silks in the world, the star piece stood out and dulled everything else. Ning Corporation sponsored the jewelry worn by the models and the bling on them only served to highlight how avant-garde the line was. David's entire line could only be described with one word: perfect!</p><br/><p>Every dress made the crowd have the urge to buy it on the spot. The female celebrities and socialites already started to get their connections to order the clothing from the series.</p><br/><p>Even though it was Gong Shangze's design, Ning Xi was aware that the more the designs were praised, the worse Gong Shangze felt.</p><br/><p>Just as she was about to console him, she saw a huge and frightening burn mark on his hand. She asked sternly, \"What's wrong with your hand?\"</p><br/><p>Gong Shangze instantly shrunk. \"Nothing, I was just not careful...\"</p><br/><p>\"You were just checking the pieces. How could you carelessly burn your hand like this? Momo, what happened?\" Ning Xi turned to ask Momo with a threatening glare.</p><br/><p>Momo looked lost. She rambled, \"Uhh, I don't know either! Just now, Director Gong said he had a little more to wrap up, so I came over to look for you first. I don't know what happened either...\"</p><br/><p>\"Boss, it's really nothing!\"</p><br/><p>As they were talking, David's score was revealed.</p><br/><p>Han Momo looked at the score and was instantly filled with hopelessness. \"Nine...nine point nine! Director Gong, should I praise you? Do your designs have to be so good? There's been so many designs out already but there has never been such a high score. The highest score was only nine point six! You...you're just too much!\"</p><br/>\n</div>"}