{"title": "Chapter 624: The Last Participant", "id": 624, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-624-the-last-participant", "volume_title": "Volume 7", "body": "<h1>Chapter 624: The Last Participant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 624: The Last Participant</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi did not know whether to laugh or cry. It seemed like being too talented was also a frustration!</p><br/><p>Gong Shangze's work not only had a solid theme, it even included the appreciation of culture, making it perfect for a huge award like this. With such the team's strength and the best resources, it was no wonder the judges loved it.</p><br/><p>The applause in the venue was becoming increasingly thunderous and half of the people offered David and Ning Xueluo a standing ovation in between congratulations. All the reporters had also turned their cameras towards him, ready to shoot the scene of him going up the stage to accept the coveted award.</p><br/><p>David looked delighted as he stood up and thanked everyone, launching into humble courtesy words, \"You all have held me in too high of a regard, this is the outcome of the entire team's efforts! Especially my boss, Miss Ning Xueluo. If not for her, there would not be the David you see today!\"</p><br/><p>Ning Xueluo smiled. \"Don't be so humble, you are the soul and core of our studio.\"</p><br/><p>Now that David had snagged such a huge award, Ning Xueluo would naturally be kinder in order to make him stay and be loyal to her.</p><br/><p>Just as David rearranged his outfit and was ready to step out to receive his award, the host suddenly announced, \"Everyone, please don't rush, we still have one last participant!\"</p><br/><p>\"What? There's one more? What's happening?\"</p><br/><p>\"Just give out the award already! Isn't this a waste of time?\"</p><br/><p>\"There's no choice. That's how competitions are. We're too impatient, let's just wait for the entire show to finish! The results are set after all and I could use this time to prepare the content for the interview later!\"</p><br/><p>...</p><br/><p>When he heard the host, David stopped mid-step to the stage and he looked slightly awkward. Then, he suddenly remembered that Angie had secretly told him that she moved the copycat to be the last. When he recalled this, he regained his good-natured expression and sat down again.</p><br/><p>When that participant's work appeared on stage, not only would it be a good opportunity to make him look better, he could also use the opportunity to shut down the other crazies who kept copying his trends, thus killing two birds with one stone.</p><br/><p>Ning Xueluo also did not seem rushed at all. After all, the award was already in the bag. The few participants who could be deemed any competition had already finished earlier, so what was left would just be a sideshow to elevate their performance.</p><br/><p>All the female celebrities and socialites present were cozying up to Ning Xueluo while the designers surrounded David and the cameras were solely focused on David. Even the judges had already started packing up and were preparing to leave.</p><br/><p>When the final participant's work came on stage, almost nobody paid it any attention...</p><br/><p>Gong Shangze did not seem very well; his fever had worsened while his breath began to come in ragged pants. The burn mark on his hand had not been treated either, probably because he kept hiding his pain.</p><br/><p>Ning Xi held him up as he was shaking unstably. \"Hold on for a little while more, we can go home very soon!\"</p><br/><p>She had wanted Momo to bring him home immediately, but she knew very well that he would definitely want to see the final outcome.</p><br/><p>She had seen Gong Shangze's participating design and was blown away by it. If \"Life\" had not been presented, he definitely would win the first place. But with \"Life\" going up before them, not only would they not bag any awards, they would even fail horribly...</p><br/><p>With a loud zap, the bright lights that were meant to complement the theme of \"Life\" previously suddenly dimmed down. The music also changed into a low and deep tune, which was almost depressing, making those who listened to it feel uncomfortable.</p><br/>\n</div>"}