{"title": "Chapter 639: Come To Us On Your Own", "id": 639, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-639-come-to-us-on-your-own", "volume_title": "Volume 7", "body": "<h1>Chapter 639: Come To Us On Your Own</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 639: Come To Us On Your Own</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>She missed Little Treasure and Boss as well…</p><br/><p>Ning Xi took a deep breath and hugged herself.</p><br/><p>It was a chilly winter night in Philadelphia. Ning Xi looked helpless and lonely, but she still had a determined expression on her face.</p><br/><p>That man acted as the ruler of Philadelphia, thinking that nothing could escape him. He viewed her as a scared rat while he was the cat, even letting her go on purpose…</p><br/><p>She knew that even though she had escaped for now, her life was still on the line. She could not stop and rest on her laurels just yet.</p><br/><p>Ning Xi endured her fatigue and gnawing hunger and forced herself to keep moving forward.</p><br/><p>She thought about reporting the incident to the police, but that man apparently had ties with the Philadelphia police department, so she had to act carefully.</p><br/><p>No matter whether she was a rat or not, she had to hang on as long as she could. After all, no one would ever know if a miracle would happen at any moment.</p><br/><p>The night was quiet and there was no one on the streets. Only some cars passed by occasionally. It might be a coincidence, but every time Ning Xi tried to go up to them for help, the cars would speed up and then vanish quickly.</p><br/><p>Ning Xi walked around aimlessly, then suddenly she saw a light in the distance. She intuitively walked towards the brighter area…</p><br/><p>She found herself in a vast square.</p><br/><p>Ning Xi stopped. In the middle of the square were that man and his people.</p><br/><p>The man was surprised to see Ning Xi as well. He chuckled, \"Little girl, I was thinking of letting you experience more despair, but you couldn’t wait anymore and came to us on your own! I was just about to send my people to look for you.\"</p><br/><p>This man would never let Ning Xi escape. He had already set up armed men around the area to find her eventually but here she was now.</p><br/><p>Ning Xi was calm at the moment as if she was surrendering herself to them.</p><br/><p>The earless man walked up to her and grabbed her hair to lead her outside of the square.</p><br/><p>It was dead silent in the Philadelphian midnight; there was no one else aside from this man and his people.</p><br/><p>\"Little girl, don’t be impatient. I’ll have sex with you right here and now, in front of them. Isn’t that exciting?\" the man stressed, his eyes judging her like an evil serpent's.</p><br/><p>His men all shot her dirty looks and they snickered cruelly together.</p><br/><p>\"Baby, I’ll give you a chance. If you actually make me feel good, maybe, just maybe, I’ll let you live. What do you think?\" The man licked his dry lips and started to close into Ning Xi…</p><br/><p>Before Ning Xi could say anything, the sounds of roaring motors came closer.</p><br/><p>A row of black cars appeared in front of them, revving loudly.</p><br/><p>\"Boss, those are not our people,\" warned one of the armed men.</p><br/><p>The man nodded indifferently as he did not really deem a few cars as a threat to him.</p><br/>\n</div>"}