{"title": "Chapter 658: Sorry, I’m Late!", "id": 658, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-658-sorry-i%E2%80%99m-late", "volume_title": "Volume 7", "body": "<h1>Chapter 658: Sorry, I’m Late!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 658: Sorry, I’m Late!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A military-grade SUV closed in quickly. The door opened and Minister Naka got down with a few of his subordinates in tow.</p><br/><p>The Captain had had to inform his superior of the uncontrollable situation.</p><br/><p>Minister Naka went up to Lu Tingxiao nervously and urged, \"Mr. Lu, you promised to solve this peacefully!\"</p><br/><p>\"I said I’ll try,\" Lu Tingxiao replied.</p><br/><p>\"Mr. Lu, I know you’re deeply concerned about your wife, but there are many other ways to rescue her! It isn’t too late to take action after they set sail! There's no point to clash here, is there?\" Minister Naka tried his best to convince him.</p><br/><p>Lu Tingxiao’s expression appeared to waver.</p><br/><p>The minister continued with his persuasion.</p><br/><p>After a long while, Lu Tingxiao decided with a darkened expression, \"Retreat.\"</p><br/><p>The silver-haired man sneered at him. \"Ah...retreating already? Did I even allow such a thing?\"</p><br/><p>He already guessed based on Lu Tingxiao’s personality that he would never do something so irrational just for a woman and hence, the fight would not happen.</p><br/><p>But Feng Jin was clueless, so he had quickly gone up to ask him to stop provoking them and ordered his people to retreat at the same time.</p><br/><p>The man yawned and went back to his armored car cheerfully.</p><br/><p>The girl was already with him and he wanted to get her back? In his dreams!</p><br/><p>The sea was his turf!</p><br/><p>Watching the crowd disperse, Minister Naka was relieved but some new worries loomed on the horizon.</p><br/><p>Lu Tingxiao would never let them get away for abducting his beloved wife!</p><br/><p>The worst part was that he had no idea what plans to propose to rescue Madam Lu. He had just been trying to calm Lu Tingxiao down and lied. If Satan took to the seas, it would be even more impossible to save anyone from him!</p><br/><p>Minister Naka’s plan was to send as many people as he could, but he still would not know if the rescue mission would end up successful or otherwise.</p><br/><p>\"Mr. Lu, let’s go back to D.C. and devise an elaborate plan…\"</p><br/><p>Minister Naka was trying to comfort Lu Tingxiao, but the man suddenly urgently ordered, \"Go back to the outskirts of Philadelphia!\"</p><br/><p>Minister Naka was confused and had no idea why he wanted to go there, but he felt guilty so he ordered his men to follow Lu Tingxiao’s orders.</p><br/><p>A few hundred meters away from the meeting point, Lu Tingxiao jumped off the tank and hurried by foot.</p><br/><p>\"Hey! Boss! We’re here!\"</p><br/><p>Somewhere not too far away, someone was yelling.</p><br/><p>A brown-haired man was holding a slender girl with long hair. That girl seemed like…</p><br/><p>Lu Tingxiao ran towards them.</p><br/><p>Beside the brown-haired man was the profusely injured girl. With so much that happened to her, she was barely conscious now. She only saw a familiar shadow block out the light and she mumbled, \"Lu...Tingxiao…\"</p><br/><p>Before she lost consciousness, she felt a warm embrace and heard a whisper by her ear, \"It’s me! Sorry, I’m late!\"</p><br/>\n</div>"}