{"title": "Chapter 656: Don’t Ask A Man If He Can Do It", "id": 656, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-656-don%E2%80%99t-ask-a-man-if-he-can-do-it", "volume_title": "Volume 7", "body": "<h1>Chapter 656: Don’t Ask A Man If He Can Do It</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 656: Don’t Ask A Man If He Can Do It</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Looking at his opponent’s indifferent attitude, Tang Ye held his fist tight, to the point his finger joints cracked. Hidden behind his glasses were his rage and pain, \"You…\"</p><br/><p>Looking at Tang Ye’s hurtful eyes, Tang Lang avoided eye contact and closed his eyes, \"Senior Brother, let’s have a match, the one who wins will take Little Junior Sister away, how does that sound?\"</p><br/><p>After a short moment of silence, Tang Ye replied coolly, \"Sure.\"</p><br/><p>Ning Xi was totally confused about the current situation.</p><br/><p>What...what was happening?</p><br/><p>Did Second Senior Brother betray the organization? Who was he working for now?</p><br/><p>It seemed like he was trying to knock out First Senior Brother to save her…</p><br/><p>Could he possibly be working for the devil now?</p><br/><p>Impossible!</p><br/><p>This did not make sense! How could Second Senior Brother be related to the devil?</p><br/><p>But currently, this was the only explanation. Otherwise, Second Senior Brother would not have appeared here and dared to oppose Satan to try to rescue her.</p><br/><p>While Ning Xi was still figuring things out, both of them were at each other's throats. Unfortunately, Tang Lang could not go on the offensive; there was no opening.</p><br/><p>The small ray of hope in Ning Xi’s heart suddenly diminished and she yelled at him, \"Second Senior Brother, can you or can't you do it?!\"</p><br/><p>Tang Lang clenched his teeth while trying to fend off Tang Ye’s crazy attacks, \"Never ask a man if he can do it!\"</p><br/><p>The situation changed after his reply. Ning Xi’s eyes shone brightly again. Tang Lang had gotten serious and his ferocity intensified.</p><br/><p>He began his counter, but he was still relaxed enough to keep on talking. \"Yo, the old man was really biased. He sure taught you a lot of new stuff!\"</p><br/><p>Ning Xi was annoyed. He had been missing for half a year. Of course, the Master only had First Senior Brother to teach.</p><br/><p>There was something even worse!</p><br/><p>Tang Lang’s talent was out of the world; he could actually observe and learn Tang Ye’s new skills on the spot and he rebounded the attack back at him.</p><br/><p>Ning Xi was impressed. Too bad, there was no popcorn for her to enjoy the show!</p><br/><p>Upon seeing his skills being easily copied on the spot, something went off within Tang Ye. He suddenly stepped back and took on a resting stance. He stared at Tang Lang, then he raised his hand to take off his glasses.</p><br/><p>Ning Xi’s heart sank to the pits of her stomach. This was bad!</p><br/><p>She did not realize that First Senior Brother had not taken off his glasses for the whole fight, meaning that he had not utilized his full power yet!</p><br/><p>Even Tang Lang was being wary and anxious at that moment.</p><br/><p>Ning Xi’s worry had materialized…</p><br/><p>Tang Ye without his glasses was like an unrestrained beast; his attack powers rose sharply when that happened!</p><br/><p>Ning Xi could tell that Second Senior Brother had no other choice but to use his full power this time. It was a tough fight between the both of them.</p><br/><p>Tang Lang cursed to himself countless times. He had thought that Tang Ye had reached the bottleneck and could not possibly reach new heights in a mere half a year. He thought he could win, but apparently, he had underestimated Tang Ye.</p><br/>\n</div>"}