{"title": "Chapter 662: My Dear, What Kind Of Wife Do You Like?", "id": 662, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-662-my-dear-what-kind-of-wife-do-you-like", "volume_title": "Volume 7", "body": "<h1>Chapter 662: My Dear, What Kind Of Wife Do You Like?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 662: My Dear, What Kind Of Wife Do You Like?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A dead silence hung across the banquet hall.</p><br/><p>However, the phrase \"my dear\" was deafening enough to Lu Tingxiao.</p><br/><p>\"This is…Madam Lu?\" someone finally asked after a while.</p><br/><p>Lu Tingxiao stood up and walked towards the girl, his cold eyes staring right at the girl’s injured legs. \"Why aren’t you wearing any shoes?\"</p><br/><p>Ning Xi avoided his sharp gaze. \"I did...but it broke…\"</p><br/><p>Lu Tingxiao held her in his arms quietly.</p><br/><p>Ning Xi put her hands around his neck naturally, then she glanced at the people in the banquet hall and asked softly, \"Did I do something wrong? My dear, why aren’t you saying anything?\"</p><br/><p>She was scared! She had just woken up from her sleep and had not done this on purpose!</p><br/><p>Ning Xi’s adaptation to the situation was so quick that she was already comfortable addressing Lu Tingxiao as \"my dear\". She did know how much of an impact her casual words brought to Lu Tingxiao.</p><br/><p>Lu Tingxiao straightened his back and turned to everyone. \"I’m sorry, my wife isn’t feeling well. Please excuse us.\"</p><br/><p>Everyone smiled. \"It’s alright, CEO Lu! Don’t mind us!\"</p><br/><p>\"Of course! Your wife is certainly more important!\"</p><br/><p>\"I see now it’s true that men who love and care for their wife are the most reliable ones!\"</p><br/><p>…</p><br/><p>Everyone broke into excited chatter after Lu Tingxiao went away with Ning Xi in his arms.</p><br/><p>\"I would never expect Lu Tingxiao to make such a big deal just for a woman, but it seems that he really loves her! Thank God that nothing happened to her. Otherwise…\"</p><br/><p>\"That’s weird, isn’t Lu Tingxiao single? Where did his wife come from? I’ve been wanting to ask since just now!\"</p><br/><p>\"It’s not unusual for people to get married in secret. It's even more common for people like Lu Tingxiao…\"</p><br/><p>\"Ah, my daughter has been missing Mr. Lu since the last time she saw him. I didn’t expect him to be married already!\"</p><br/><p>\"There probably wasn’t any chance for your daughter anyway!\"</p><br/><p>…</p><br/><p>In the bedroom.</p><br/><p>\"Ah! Madam Lu! Where did you go? I was so scared!\" The nurse had just gone out for a while and Ning Xi was already gone when she returned to the room, so she panicked.</p><br/><p>\"It’s alright, let me do it,\" assured Lu Tingxiao.</p><br/><p>\"Oh, alright!\" The nurse glanced at Lu Tingxiao shyly and left the room.</p><br/><p>Lu Tingxiao lifted the sheets and lay Ning Xi on the bed gently.</p><br/><p>Ning Xi asked, \"Boss, was I smart enough just now to catch on to you?\"</p><br/><p>Lu Tingxiao squinted his eyes at her. \"Not smart enough to cover your mistake.\"</p><br/><p>Ning Xi looked down at the sheets. \"I really barge in on purpose…\"</p><br/><p>\"Why did you get up when you’re still feeling unwell?\" Lu Tingxiao vented. How could she still run around with injuries on her legs?</p><br/><p>\"Ugh, I had a nightmare…\"</p><br/><p>Lu Tingxiao sighed, then he explained, \"To be able to rescue you this time, I had to lie and say that you’re my wife. So, during our stay here, you might have to act as one. But it won’t last long. We’ll go back as soon as you feel better.\"</p><br/><p>\"No problem! Acting is my profession after all!\" Ning Xi reassured him, \"I can act as any kind of wife you like!\"</p><br/>\n</div>"}