{"title": "Chapter 689: Pregnant", "id": 689, "volume": 7, "url": "http://boxnovel.org/hidden-marriage-chapter-689-pregnant", "volume_title": "Volume 7", "body": "<h1>Chapter 689: Pregnant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 689: Pregnant</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I got it. Hu Hongda did not just do that to frame you. He really did cheat and he wanted to protect the real mistress. Coincidentally, he was rumored to be involved in a scandal with you, so he decided to make you the scapegoat and tell Ming Fangfang that you were his mistress,\" Ling Zhizhi explained.</p><br/><p>\"Then, who's the real mistress?\" Ning Xi quickly asked.</p><br/><p>\"You know her too. It's Fang Ya.\"</p><br/><p>\"Fang Ya?\" Ning Xi frowned in disbelief. \"Not only do I know her...we have many grudges against each other too...\"</p><br/><p>If it had been someone else, she would just accept her bad luck. However, if it was Fang Ya, she had little doubt that this whole issue could be something Ning Xueluo had decided to cook up.</p><br/><p>\"In fact, Fang Ya is pregnant,\" Ling Zhizhi said.</p><br/><p>\"My gosh! Is this true? No wonder that asshole Hu Hongda is so protective of her!\"</p><br/><p>Still on the phone, Ning Xi scoured online for news of Hu Hongda and Ming Fangfang in the recent period of time. She saw tabloid reports on how Ming Fangfang did not get pregnant since they got married seven years ago. It seemed like she might have an infertility issue.</p><br/><p>If this was true, it was no wonder that Hu Hongda would be so worried about Fang Ya. Or else, a man like him would not even care about someone else's life or death. Even if it was a woman he had slept with, he would have just kicked them out after being found out and he would not have done so much to help her escape.</p><br/><p>Based on Ming Fangfang's fierce personality and solid family background, if Fang Ya was found out, he knew that his child would definitely not survive.</p><br/><p>\"Hu Hongda is careful, but thankfully, we still found out about this in the end. Wait till I finish writing the statement to be released, then I'll tell you what to say.\"</p><br/><p>\"Okay.\"</p><br/><p>...</p><br/><p>At the same time, in the private room of a certain Western restaurant, Ning Xueluo and Fang Ya were having a meal together.</p><br/><p>Ning Xueluo scrolled through all the horrible curses towards Ning Xi online on her phone. Even that previous incident about her falsely blaming Ning Xi was brought up and the netizens were siding her; she had never felt this smug.</p><br/><p>However, she naturally did not reveal how satisfied she felt. Instead, she looked guilty and unassured. \"What we did...was it too much?\"</p><br/><p>Opposite her, Fang Ya, who was initially a nervous wreck, had relaxed too, now that the danger was resolved. She was enjoying her perfectly cooked steak.</p><br/><p>When she heard what Ning Xueluo said, she looked up nonchalantly and said, \"No way! That woman is a witch. Even if she didn't hook up with Hu Hongda, she's definitely hooked up with other people! I'm weeding out the witches for the people here! She deserves this!</p><br/><p>\"Besides, this woman keeps troubling you over and over again. At last, I managed to help you take revenge! Xueluo, don't go soft now! To be kind to your enemy is to be cruel to yourself!\"</p><br/><p>Fang Ya was afraid that Ning Xueluo would change her mind midway.</p><br/><p>Ning Xueluo sighed, \"Since it's already turned out like this, I naturally wouldn't soften, or else I'd be bringing harm to you instead.\"</p><br/><p>Fang Ya sighed a breath of relief as she touched her belly happily. \"Hmm, I'm not the same as other mistresses. What Hongda and I share is true love. Now, we even have this as proof of our love! I must give birth to this child! He already promised me that if I give birth to a son for him, he will divorce his wife!\"</p><br/><p>Ning Xueluo laughed in her heart. Fool, you actually believe such lies?</p><br/><p>She was sure that Hu Hongda was only planning to have her give birth to the child, then run home and let Ming Fangfang raise it. Since the baby would have been already born, Ming Fangfang and her family would have to compromise. He would then ditch Fang Ya and not allow her to contact the child. Then, he would keep the child and not lose Ming Fangfang's family background support at the same time. Everything would be perfect for him.</p><br/>\n</div>"}