{"title": "Chapter 708: Let's Fight! If You Win, I'll Give It To You!", "id": 708, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-708-lets-fight-if-you-win-ill-give-it-to-you", "volume_title": "Volume 8", "body": "<h1>Chapter 708: Let's Fight! If You Win, I'll Give It To You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 708: Let's Fight! If You Win, I'll Give It To You!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Instantly, the entire line of shelves started to wobble. When she saw the shelves were about to topple, Ning Xi went pale and quickly picked Little Treasure and hid. At the same time, she used the big mother bear to block the books that were falling all around and so, did not get harmed by a close shave...</p><br/><p>In the next second, a loud crash was heard and the bookshelves came falling down.</p><br/><p>Everyone gasped in fright.</p><br/><p>\"Oh my...\" God!</p><br/><p>Ning Xi hugged Little Treasure and suppressed herself very hard to not blurt out curses in this holy ground called \"school\". Her sharp gaze found the child dressed in the bear costume and the woman.</p><br/><p>When she saw Ning Xi glaring so antagonistically, the woman quickly put her child behind her and demanded, \"What are you doing? You want to hit a child!? Everyone, come look! This evil woman won't even let go of a mere child!\"</p><br/><p>With all the commotion going on, all of the parents crowded around and looked on with resentment.</p><br/><p>\"Why is it this family again?! How unruly!\"</p><br/><p>\"Exactly, the last time Sun Zhuangzhuang borrowed the Transformers toy my husband had bought for our child, it was never returned. I looked for her to discuss the issue, but she just said it was lost. She did not even offer to compensate and said I was overreacting!\"</p><br/><p>\"If that woman had not moved so quickly, those huge shelves would have toppled onto her and caused severe injuries! In fact, there was a child with her too! That bear child is already acting like that at such a young age, I'm afraid he would grow up to kill someone or something!\"</p><br/><p>\"He's too unruly now! Can't the school manage him a little?\"</p><br/><p>\"How can they manage him? If you manage a child, people would say that he's just a kid and that it's normal to be slightly naughty. The school can't chase people away for such a small matter, can they?\"</p><br/><p>...</p><br/><p>Facing all the parents' and teachers' condemnations, Sun Zhuangzhuang's mother was not remorseful at all.</p><br/><p>\"How strong can my son be? He only pushed her lightly. She herself wasn't stable and so, bumped into those shelves! Besides, they aren't injured. What are you people mumbling about?! Trying to bully us mother and son, now, are you?\"</p><br/><p>As she spoke, the father in the bear suit who had left earlier returned. When he saw the crowd around his family, he immediately roared, \"What are all of you doing?\"</p><br/><p>\"Husband, you're finally here! These people are bullying me and our son! That woman is holding onto a grudge because of something small. She fell by herself yet she blames it on our son! These people are all on her side!\" the mother in the bear suit turned the facts upside down, causing everyone to look at her in disgust.</p><br/><p>\"Father! Bear! I want the bear! I want!\" When Sun Zhuangzhuang saw his father arrive, he became even more overbearing and immediately wanted to snatch the prize from Little Treasure and Ning Xi.</p><br/><p>Ning Xi instantly smacked the little boy's hand that had reached over to claw the bear. She had not used much force, but the boy started to cry at the top of his lungs as if he had been tortured by her.</p><br/><p>Sun Zhuangzhuang's mother started to coax her baby boy and talked about going to the hospital.</p><br/><p>The child's father immediately took on a violent stance and said, \"You witch! How dare you hit my son?! Are you looking to die?\"</p><br/><p>Everyone present was worried for Ning Xi. The teacher had run to get the security guards.</p><br/><p>\"Mother! I want! I want! I just want that bear!\" Sun Zhuangzhuang continued to shout throughout, and it was so noisy that everyone's head was about to explode.</p><br/><p>\"You can let my son have this bear and I'll forget about this!\" the woman said with an expression that indicated that she was at a disadvantage.</p><br/><p>All the parents on the sidelines were advising Ning Xi kindly, \"Forget it. How about you just give them the bear? You won't be able to fight your way out of this. Don't be at a disadvantage in the end...\"</p><br/><p>Ning Xi looked at the parents gratefully, then looked at the child's father who was staring at her furiously. She said with a calm gaze, \"You want this bear? Sure, let's fight. If you win, I'll give it to you.\"</p><br/>\n</div>"}