{"title": "Chapter 712: There's No Way My Brother Can Be This Cute!", "id": 712, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-712-theres-no-way-my-brother-can-be-this-cute", "volume_title": "Volume 8", "body": "<h1>Chapter 712: There's No Way My Brother Can Be This Cute!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 712: There's No Way My Brother Can Be This Cute!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>However, hiring a master for Little Treasure was not a small matter. She wanted to give it some more thought before deciding.</p><br/><p>Since Second Senior Brother was in Imperial now, she could ask him out for a chat anytime. Aside from Little Treasure’s matter, she had so much more to ask…</p><br/><p>At the entrance of her apartment.</p><br/><p>As the three of them got down from the car, Ning Xi saw a familiar face walking towards the apartment and she yelled, \"Hey! Lu Jingli!\"</p><br/><p>Lu Jingli was humming to himself and was about to enter. He stopped and turned around when he heard his name being called.</p><br/><p>Lu Jingli’s car keys fell on the floor and he quickly covered his eyes, \"Oh my God! What am I seeing?! My eyes are going blind!\"</p><br/><p>A cute Little Red Riding Hood was waving at him, along with two wolves beside her.</p><br/><p>Upon closer inspection, he saw that Little Red Riding Hood was Xiao Xi Xi, the small wolf was Little Treasure, and the big wolf...was his brother!</p><br/><p>And there was a huge bear tied on top of the car behind them…</p><br/><p>What he saw was indescribable!</p><br/><p>\"Are you guys crazy?\" Lu Jingli still could not believe his eyes, especially when he saw his brother with fluffy hair, long ears, and a long tail on his back.</p><br/><p>Ning Xi took off her red hood and rolled her eyes. \"Stop overreacting. Little Treasure’s school was having a masquerade party, alright?\"</p><br/><p>\"Huh…? Party? Is this the parent-child event my brother mentioned? Even if it was a masquerade party, aren’t you overdoing it? Can’t you just draw some beard on your face?\"</p><br/><p>Ning Xi threw him a look of disgust. \"What do you know!? It’s Little Treasure’s first parent-child event. How can I not put in any effort?\"</p><br/><p>Lu Jingli looked at his brother with an incredulous expression. \"I’m impressed. You agreed to wear this? What if she went crazy and made you wear a maid's outfit?\"</p><br/><p>Ning Xi’s eyes shone as she began to imagine. Hmm...the devil in a maid's outfit? Interesting!</p><br/><p>\"What's up with the huge bear?\"</p><br/><p>Ning Xi patted his head. \"We were awarded with the most popular award. This is the prize! Cool, isn't it?\"</p><br/><p>Lu Jingli cried, \"Please stop acting lovey-dovey in front of me...you guys are cruel! Please, no more!\"</p><br/><p>\"You just happened to be here! Why are you here anyway?\" Ning Xi asked.</p><br/><p>Lu Jingli handed some documents to Lu Tingxiao and explained, \"I’m here for my brother. There're some documents that need his signature urgently. I knew that he’d be at your place, and since I couldn’t reach him through the phone just now, here I am.\"</p><br/><p>Unable to reach through the phone?</p><br/><p>Must be because the teacher was crazily calling Lu Tingxiao just now...</p><br/><p>Lu Tingxiao opened his paws and signaled Lu Jingli to give him a pen to sign.</p><br/><p>Lu Jingli looked at the fluffy paws, and then at his brother’s cute ears and tail. Without warning, he suddenly hugged him. \"Oh! You’re so cute! There's no way my brother can be this cute! This is like a dream!\"</p><br/><p>Lu Tingxiao’s expression darkened. He was planning to change the moment he reached home but who'd have known that Lu Jingli would be here…</p><br/>\n</div>"}