{"title": "Chapter 720: Jiang Muye Has Gone Missing", "id": 720, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-720-jiang-muye-has-gone-missing", "volume_title": "Volume 8", "body": "<h1>Chapter 720: Jiang Muye Has Gone Missing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 720: Jiang Muye Has Gone Missing</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ling Zhizhi told her, \"Not everything needs evidence. Netizens aren’t fools. They just need some guidance and they’ll know what happened. For incidents like these, happening once might be a coincidence. The second time might be an accident, but what do you think the netizens would think about the third time?</p><br/><p>\"No matter how well she handled it, she's surely got a hand in this. Ning Xueluo’s kind and gentle public image will fade away slowly. If something similar happens in the future, the netizens will have our back.\"</p><br/><p>Ning Xi squinted her eyes and set her mouth in a determined line. \"Karma! She deserves it!\"</p><br/><p>As Ling Zhizhi spoke, she opened her drawer. \"Right, there’s something for you.\"</p><br/><p>\"What is this?\" Ning Xi took a look at it and was surprised. \"A car key?\"</p><br/><p>\"Mmm, the company just gave you one. The movie is airing soon and you’ll be needing a car in this period of time.\"</p><br/><p>\"Wow! They gave me a BMW?\"</p><br/><p>And it was one of the high-end models, worth at least a few million dollars.</p><br/><p>\"This is a celebrity’s reputation at stake. We can't have you looking too badly. Plus, you’ve been performing well and you got yourself two endorsements aside from your casting in 'The World'.\"</p><br/><p>\"Thank you, Sis Zhizhi and Starlight Entertainment!, I’ll continue to work hard!\" Ning Xi was over the moon about this unexpected news. \"Sis Zhizhi, the promotion for the movie is finished now. Is there any more work?\"</p><br/><p>\"I was about to tell you. At 8pm tomorrow night, Noble will be having their new perfume conference at Imperial Knight Hotel. Remember to be there on time!\"</p><br/><p>\"Alright!\"</p><br/><p>\"Also, there’s another matter…\"</p><br/><p>\"What is it?\"</p><br/><p>\"I’m thinking if I should let Xiao Tao stay with you, it’s easier for her to take care of you that way.\"</p><br/><p>Ning Xi’s heart was throbbing with anxiety. It would be all over if Xiao Tao saw her and Lu Tingxiao together.</p><br/><p>\"Uh, I think...it’s fine! I’ll be able to take care of myself! I’m actually used to staying alone and it might be inconvenient if another person stayed with me…\"</p><br/><p>\"Alright then.\" Ling Zhizhi did not push further.</p><br/><p>Ning Xi sighed in relief in her heart.</p><br/><p>As they were talking, someone knocked urgently on the door.</p><br/><p>Lei Ming came in hurriedly. \"Zhizhi...oh, Ning Xi’s here as well! Great! Have any of you seen Jiang Muye?\"</p><br/><p>Ning Xi shook her head. \"Nope! Why?\"</p><br/><p>Ling Zhizhi replied, \"I haven't seen him.\"</p><br/><p>Lei Ming looked like doomsday had arrived for him. \"Muye's gone missing since yesterday! I can’t contact him at all!\"</p><br/><p>\"Did he just hide somewhere and play his video games?\" Ning Xi said.</p><br/><p>Lei Ming glanced at his watch. \"At first, that's what I thought, but today he’s having a signing ceremony for an endorsement. A ten million endorsement! I’ve been liaising with them for over three months, but I can’t even contact him now! I’m going to die…\"</p><br/><p>Ning Xi’s mouth twitched. \"Ten million...that brat…\"</p><br/><p>\"How long until the ceremony?\" Ling Zhizhi asked.</p><br/><p>\"Only two hours left! Please! Help me! Where could he be? I’ve gone to the places he usually hangs out at! He wasn’t there!\"</p><br/><p>Ning Xi shrugged. \"Bro Ming, I’m afraid that I can’t be of much help here. Surely you know all the places that I know!\"</p><br/><p>She got to know Jiang Muye overseas, so she did not know where he would usually be back here in China.</p><br/><p>\"Zhizhi, I know you’re busy! Please! Help me! If this endorsement gets canceled, then I better go and jump off the building!\" pleaded the big-sized Lei Ming with the most pitiful face.</p><br/>\n</div>"}