{"title": "Chapter 735: Tables Turned", "id": 735, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-735-tables-turned", "volume_title": "Volume 8", "body": "<h1>Chapter 735: Tables Turned</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 735: Tables Turned</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The assistant nodded, then walked towards Cook who was on stage. At that moment, Cook looked miserable when he heard what the assistant whispered to him. He hesitated, then looked at Ning Xi and suddenly set his mouth in a determined line.</p><br/><p>He nodded at his assistant and solemnly skimmed the crowd before contemplating on his reply to the reporter. \"Originally, the auditions, including the process of our shoot, is confidential but since everyone has such suspicions...\"</p><br/><p>Then, he signaled to the assistant who understood and immediately put the USB into the computer. Everyone thought that Cook had just been forced to disclose the audition process, so they instantly looked at the screen in excitement.</p><br/><p>The room on the screen was obviously the audition room and that girl seen in it was actually Li Yueling! Li Yueling wore an elegant vintage Chinese cheongsam, while she sat there playing the Guqin. Her entire person exuded a noble elegance; it was so perfect without any flaw to pick on. When they saw this, the public felt that the reporter's words rang true.</p><br/><p>\"Li Yueling's performance is spectacular! That was practically unsurpassable!\"</p><br/><p>\"Exactly! There's obviously some inside job going on here!\"</p><br/><p>...</p><br/><p>Then, before the discussions stopped, Ning Xi who donned a grey and dull dress walked in on the screen. The scene started with Cook's loud insults towards Ning Xi, scolding her for her dressing which seemed disrespectful to them.</p><br/><p>\"Indeed! The original ambassador was supposed to be Li Yueling!\"</p><br/><p>\"Direction Cook hated Ning Xi right from the start! How did he decide that she would be the ambassador later on?\"</p><br/><p>\"This is so obvious now! Definitely using some scandalous methods!\"</p><br/><p>The crowd looked at each other, thinking the same thoughts without explicitly voicing them out.</p><br/><p>However, the next scene shocked everyone speechless, just as it did to Cook in the audition room.</p><br/><p>Ning Xi sat at ease in front of the Guqin and unexpectedly played an extremely difficult, Guang Lin San.</p><br/><p>\"I believe that true elegance and nobility is not just by donning the name of luxurious brands. It is neither to show off the expensive accessories on hand nor to boast about your own beauty and educational qualifications. True nobility is, even if dressed in ragged clothes and messy hair, not being able to conceal the aristocratic charisma within...\"</p><br/><p>Until Ning Xi's definition of true nobility was spoken out loud, everyone off-stage had yet to return to their senses.</p><br/><p>Simply amazing!!! Noble's advertisement's spectacular creativity had unexpectedly originated from Ning Xi's audition! Still, the screenplay had not yet ended!</p><br/><p>The screen continued to play the highlights from the advertisement shoot. Everyone could see that the pictures the reporter had shown them had been intentionally shot from an ambiguous angle. In reality, the two of them were interacting normally without any hanky-panky. The behind-the-scenes video proved that there were no ambiguities.</p><br/><p>Finally, an audition form was zoomed in on the final scene. On the sheet, all those who had signed up to participate had their names on it and beside it was the list for those who were shortlisted.</p><br/><p>The list had both Liang Biqin and Ning Xueluo's names...</p><br/><p>Liang Biqin was initially only slightly disappointed that she did not ruin Ning Xi. To her utmost shock, she saw her name on the list.</p><br/><p>At the same time, the female artistes next to Liang Biqin looked at her in surprise. She had signed up after all but had been eliminated. However, for the sake of saving her face, she had said she did not even audition...</p><br/><p>Of course, there was another person who looked worse off compared to Liang Biqin.</p><br/><p>Li Yueling never would have thought that Ning Xi had done such extensive preparations to counter any scandals and that Cook would expose the audition process for her sake. Just as she was almost stomping her feet in frustration about this, she saw the name list at the end.</p><br/><p>On the name list was Ning Xueluo...</p><br/>\n</div>"}