{"title": "Chapter 731: A Mysterious Ambassador", "id": 731, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-731-a-mysterious-ambassador", "volume_title": "Volume 8", "body": "<h1>Chapter 731: A Mysterious Ambassador</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 731: A Mysterious Ambassador</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Cook’s words made the situation slightly awkward. The journalist was sweating with frayed nerves. This foreigner was too straightforward…</p><br/><p>Although he meant those words genuinely, it was not very appropriate, especially in front of Su Yimo.</p><br/><p>Su Yimo smiled at him. \"To be able to impress Director Cook...this must be a marvelous artiste.\"</p><br/><p>Director Cook nodded confidently. \"Indeed, she is.\"</p><br/><p>Su Yimo’s generosity placated any awkwardness. The crowd became even more interested in this new ambassador that they were going to announce.</p><br/><p>Was Cook exaggerating it for the brand or was the ambassador was really that amazing? The latter might be true since Noble was such a high-class brand; their ambassador could actually be as extraordinary as Cook claimed.</p><br/><p>The launch continued with the staff distributing their latest perfume sample to the guests.</p><br/><p>\"Noble Perfume originated 200 years ago and was inherited through the generations. With our very own unique formula, we adopted the ancient technique of perfume distillation and have selected the best ingredients under strict quality checks. Our new perfume this time uses roses from the Rose Valley in Bulgaria, jasmines from Florence, tuberoses from India, vetivers from Haiti, ylang-ylang from Madagascar…\"</p><br/><p>Everyone took a sniff of the deep and aromatic sample strips, instantly being teleported into an old, luxurious palace, exhibiting elegance.</p><br/><p>As if spurred on by the presentation and everyone’s praises, the large screen at the front of everyone lit up.</p><br/><p>The screen displayed a gloomy sky, dark with stormy clouds, then the view cut through the clouds and the ancient Chang An Street in China appeared. There was a young girl in soiled clothes and messy hair, her face smudged with dirt beyond recognition…</p><br/><p>At that point, the guests and journalists were all surprised.</p><br/><p>\"Uh, am I seeing something wrong? Is this really the advertisement Noble’s renowned director produced?\"</p><br/><p>\"Isn’t Noble’s main theme supposed to be classy?\"</p><br/><p>\"That’s right. Why is the main character playing a beggar?\"</p><br/><p>A pair of toll palace guards passed by swiftly on their horses, not noticing the young girl on the street.</p><br/><p>The crowds were confused; they had no idea what was going to happen next.</p><br/><p>\"The ambassador didn't even appear…\"</p><br/><p>\"Her face was all covered up. How can we identify her?\"</p><br/><p>\"Wouldn’t the ambassador have a hard time shooting this?\"</p><br/><p>\"Could the beggar be just a supporting character? Maybe the main character hasn’t appeared yet!\"</p><br/><p>…</p><br/><p>As everyone voiced their suspicions and theories, the screen panned out to the trees by the road and the sound effects of the wind blowing whooshed through the room. Leaves fell from the trees, rustling in the wind. The clip-clops of the horses came closer as the guards who had left earlier returned and stopped right in front of the young girl.</p><br/><p>The leading general jumped off his horse, kneeling on one knee to the young girl. Quickly, all the other soldiers got off their horses and bowed...</p><br/>\n</div>"}