{"title": "Chapter 744: Lu Tingxiao Has A Girlfriend?", "id": 744, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-744-lu-tingxiao-has-a-girlfriend", "volume_title": "Volume 8", "body": "<h1>Chapter 744: Lu Tingxiao Has A Girlfriend?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 744: Lu Tingxiao Has A Girlfriend?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As he saw the man and the bunch of people, Lu Tingxiao was put in an awkward position. He did not expect Mo Lingtian to organize their gathering here of all places…</p><br/><p>\"What? Mo Lingtian, who did you just mention?\"</p><br/><p>\"Lu Tingxiao? Where is he? Isn’t he not coming today?\"</p><br/><p>\"Ah! It really is Lu Tingxiao!\"</p><br/><p>Mo Lingtian’s yell was followed by the gaze of the bunch of people, all turning to look at Lu Tingxiao and Ning Xi. Then, they saw the cool and composed Lu Tingxiao in his black suit with a girl in a fluffy pink dress.</p><br/><p>What...what was that…?</p><br/><p>What was happening? The girl was clinging onto Lu Tingxiao’s arms like a little bunny! Everyone was dumbfounded by what they saw!</p><br/><p>Ning Xi was confused by the sudden attention from so many people. She blinked her eyes and pulled herself even closer into the devil’s arms.</p><br/><p>Lu Tingxiao ran his fingers through the girl’s hair.</p><br/><p>Mo Lingtian’s mouth twitched, then he turned around and told his friends, \"Didn’t you guys ask me why Lu Tingxiao wasn’t coming today? Here we have it, this is the reason. The bastard betrayed us! He has a girlfriend!\"</p><br/><p>\"What!? What did you just said Mo Lingtian? Lu Tingxiao has a girlfriend?\"</p><br/><p>\"How is this possible?!\"</p><br/><p>\"Are you sure she’s not his sister or something?\"</p><br/><p>…</p><br/><p>\"Sister? I don’t ever recall my cousin having a sister!\"</p><br/><p>A girl quickly went up to Lu Tingxiao, studying Ning Xi carefully. \"Cousin, this is…?\"</p><br/><p>\"Your future cousin-in-law,\" Lu Tingxiao casually announced. He then introduced the girl to Ning Xi, \"This is my cousin, Lu Xinyan.\"</p><br/><p>\"Hello!\" Ning Xi greeted.</p><br/><p>However, Lu Xinyan did not seem very friendly, so Ning Xi did not bother to be very welcoming either.</p><br/><p>Lu Xinyan stammered in surprise, \"My...my future cousin-in-law? She’s really your girlfriend?\"</p><br/><p>Why would he have some weak girlish bunny as his girlfriend? She could not understand Lu Tingxiao’s taste.How could he actually like this kind of woman!?</p><br/><p>At that moment, a girl came up behind Lu Xinyan. She was dressed in a black riding suit with a whip on her hips. With a pair of sleek boots, her cool outlook matched the fine black horse right beside her.</p><br/><p>She stood in front of Lu Tingxiao and Ning Xi, staring at Ning Xi, then looking at Lu Tingxiao. \"Long time no see, Tingxiao.\"</p><br/><p>Ning Xi stared back at this woman, her tingling sixth sense instantly ringing warning bells in her head that this woman was bad news!</p><br/><p>Lu Tingxiao had no change in expression as he replied calmly, \"Welcome back.\"</p><br/><p>The woman looked at Ning Xi with a pressuring gaze, \"Why don’t you introduce us?\"</p><br/><p>\"My girlfriend, Ning Xi.\" He looked at Ning Xi and inclined his head slightly. \"Guan Ziyao.\"</p><br/><p>Only a name, no other introduction.</p><br/><p>Ning Xi put up on an innocent expression and greeted Guan Ziyao. \"Hello.\"</p><br/><p>She just stuck to Lu Tingxiao and spoke as little as possible. Together with her dressing, her personality had also totally changed into a little bunny.</p><br/><p>Although Lu Tingxiao knew the girl’s obedience was part of her act, his heart melted and his gaze at her was much more gentle than usual.</p><br/>\n</div>"}