{"title": "Chapter 741: Good News Indeed", "id": 741, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-741-good-news-indeed", "volume_title": "Volume 8", "body": "<h1>Chapter 741: Good News Indeed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 741: Good News Indeed</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Oh, okay…\"</p><br/><p>Ning Xi had been feeling alright just now but she was a little nervous now, unsure of where to put her hands. \"Um, Boss...can you wait for me a while?\"</p><br/><p>Lu Tingxiao stayed silent.</p><br/><p>She looked into Lu Tingxiao’s fiery eyes. \"I just wanted to check on how this works…\"</p><br/><p>How embarrassing! She acted like she was a know-it-all just now. She intended to get away with it now but her mind went blank. She needed to be recharged!</p><br/><p>The next moment, there was a metal clanking sound. It was the sound of Lu Tingxiao’s metal belt as he was taking it off. In that narrow space, it worked as a catalyst, warning her of what was about to unfold.</p><br/><p>Lu Tingxiao felt like he would never let her go. He pressed her hand on his bulge, his sweat becoming hot on Ning Xi’s tender fingers. The heat coming from him could almost melt her skin and his voice sounded deeper than usual. \"You don’t have to check, I’ll teach you…\"</p><br/><p>With her palms directly touching his manhood, Ning Xi felt like her hands were on fire. In the end, she was rooted to the spot and barely made any movement of her own will, the devil initiating the whole process by moving her hands in the way he had so longed for them to…</p><br/><p>After some time…</p><br/><p>Lu Tingxiao used a hot towel and carefully wiped the girl’s hands. \"Are you alright?\"</p><br/><p>Ning Xi found her tongue and said in a troubled voice, \"My hands are tired!\"</p><br/><p>Her legs were already injured and now her hands were almost out of commission as well…</p><br/><p>Well, she did offer to help! She had underestimated the devil’s power.</p><br/><p>How naive of her!</p><br/><p>She was suddenly afraid of what would happen when she actually got round to doing it…</p><br/><p>\"I’m sorry.\" Lu Tingxiao kissed her forehead gently.</p><br/><p>He looked lazily at her like a beast that had just finished his delicious meal. Despite his outward coldness, there was a slight sense of sensuality about him and he was much more seductive than usual. Ning Xi was dumbfounded…</p><br/><p>Damn! The devil was just too beautiful! This was the upgraded version of him!</p><br/><p>She suddenly felt that it might not have been so bad to sacrifice a hand for this after all! It would be a pleasure for anyone to die in the arms of such a beauty...</p><br/><p>Lu Tingxiao held Ning Xi in his arms and moved her to the bed as he lay down right next to her and spoke to her, not letting go of her. \"Why did Ling Zhizhi come?\"</p><br/><p>Ning Xi’s expression darkened a little. \"It was some bad news for me but might be good to you. Do you remember the script that I liked a lot and spent quite some time to convince you to let me cast in?\"</p><br/><p>\"I remember.\"</p><br/><p>\"I didn’t get it. You didn’t want me to act in it, did you?\"</p><br/><p>Lu Tingxiao nodded slightly. \"Mmm.\"</p><br/><p>Good news indeed.</p><br/><p>There were too many dangerous scenes in the script. Although stunt doubles could be used, Ning Xi was sure to volunteer to perform them personally.</p><br/><p>Ning Xi glared at the man. She felt that the devil must really possess magical powers.</p><br/><p>She remembered Lu Tingxiao telling her, \"You’ve only convinced me now. If you failed the audition, I won't help you, understood?\"</p><br/><p>What happened was way worse. She did not even get to audition.</p><br/>\n</div>"}