{"title": "Chapter 756: This Was Practically A Witch!", "id": 756, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-756-this-was-practically-a-witch", "volume_title": "Volume 8", "body": "<h1>Chapter 756: This Was Practically A Witch!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 756: This Was Practically A Witch!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"That girl?\" The Chief asked thoughtfully, then said, \"How old is she? What does she do? Is she still in school? What does her family do?\"</p><br/><p>Mo Lingtian's mouth twitched at his questions. \"Uhh, cough...Uncle Zhuang, what are you trying to do, huh? Even though you have a son, isn't he only 18 years old? Isn't it too early to look for a daughter-in-law now? Most importantly, this girl is already taken. She's Lu Tingxiao's girlfriend!\"</p><br/><p>\"Lu Tingxiao has a girlfriend?\" the man asked with a serious expression, hiding his thoughts.</p><br/><p>\"Yeah, they just started dating not too long ago,\" answered Mo Lingtian truthfully as he nodded.</p><br/><p>The man revealed a thoughtful expression and then said, \"Lingtian, help me ask that girl if she is interested to enlist.\"</p><br/><p>Mo Lingtian almost spat at this proposition.</p><br/><p>Turns out he was thinking of such an idea! But this idea was even more impossible!</p><br/><p>Mo Lingtian immediately said, \"Uncle Zhuang, I suggest you forget it. Lu Tingxiao pampers her like a treasure. He even carried her in fear that she got tired of walking and he even accompanied her to ride a horse in case she fell off. When he went off for a phone call, he even needed to make sure I took care of her well...</p><br/><p>\"To let her enlist is impossible! In fact, she looks much younger because of her dressing today. She has actually already graduated from university and is currently a professional actress! So...the possibility of enlisting...is basically zero!\"</p><br/><p>The Chief looked regretful when he heard this. \"That's such a pity...\"</p><br/><p>Mo Lingtian was sweating profusely. Before this, he had heard his father talking about how Zhuang Liaoyuan would not let go of talents with excellent marksmanship. It seemed like this was true; he even wanted to cross Lu Tingxiao's boundaries!</p><br/><p>While Mo Lingtian was conversing with Zhuang Liaoyuan, Ning Xi picked up the gun once again.</p><br/><p>Zhuang Lingyuan instantly focused his gaze on the girl.</p><br/><p>Bam! Six points.</p><br/><p>Bam! Three points.</p><br/><p>Bam! Three points.</p><br/><p>Bam! Two points.</p><br/><p>...</p><br/><p>\"Uhh...\" Mo Lingtian's eyeballs were about to fall off as he watched Ning Xi hit all those crazy targets. \"That's not right! Uncle Zhuang, I'm not lying to you, those six perfect scores in a row previously were shot by her! Maybe...maybe she's not consistent in execution? Before this, she also scored a six-pointer...\"</p><br/><p>My God! Was this brat messing with him? What was with these shots?</p><br/><p>He was about to get a heart attack!</p><br/><p>Zhuang Liaoyuan seemed not to notice at all. His eyes followed Ning Xi's aim, one shot after another, then they started to widen. After the last shot, Zhuang Liaoyuan could not help but laugh gleefully. \"How interesting! This little girl is really interesting!\"</p><br/><p>Mo Lingtian was confused. Huh? What was so interesting? Why couldn't he see it?</p><br/><p>After the little bun was done with shooting, she shyly walked towards Lu Tingxiao's side and tried to please him by signing a heart with her hands. She then said to Lu Tingxiao, \"I know my mistake now. Saranghaeyo, Big Boss!\"</p><br/><p>\"My God! It's a heart!\" Those who were watching Ning Xi shoot gasped when they saw her target sheet from earlier.</p><br/><p>Mo Lingtian looked at the target sheet too and instantly shouted, \"My God!\". The bullets Ning Xi had shot earlier had really created traces of a heart shape!</p><br/><p>My Lord! How was this a little bunny?! This was practically a witch!</p><br/><p>No wonder Lu Tingxiao had been charmed silly by her!</p><br/>\n</div>"}