{"title": "Chapter 764: Your Son Isn't Blind", "id": 764, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-764-your-son-isnt-blind", "volume_title": "Volume 8", "body": "<h1>Chapter 764: Your Son Isn't Blind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 764: Your Son Isn't Blind</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>During the whole time they were apart from the little bun, Yan Ruyi had restrained herself from seeing Little Treasure out of guilt while Lu Chongshan was waiting with an attitude of \"I don't care, I want to see what you will turn Little Treasure into\".</p><br/><p>At last, they never expected that Little Treasure would turn out much better than they had imagined. They could obviously see that the Little Treasure had regained some chubbiness and his energy had returned. They were most worried about whether he would not fit in or would be bullied by other kids in school for not speaking as that would cause him to even more withdrawn. However, that turned out to be fine.</p><br/><p>The both of them were so immersed in the joy of Little Treasure fitting into school life, thus they had forgotten all about the serious business with Lu Tingxiao.</p><br/><p>After the father and son had left, Yan Ruyi could not help but exclaim, \"The two of them have already progressed to such a stage. What can we do now? How about I just look for Ning Xi directly?\"</p><br/><p>\"That is a weak plan. You know your own son's personality. To mess with that girl is the last resort. The best plan is to get your son to change his own mind!\"</p><br/><p>\"Then, do we just watch and do nothing? Initially, I thought this girl would understand! Who'd have known I still judged her wrongly!? If she wasn't really going after anything...why would she still progress with Tingxiao to this stage?\"</p><br/><p>\"What are you panicking about? It's just a dating relationship. How secure do you think such a relationship would be? Maybe after they've gotten together, the honeymoon stage will pass and they will break up by themselves. Besides, Ziyao is back and your son isn't blind. Would he not know how to choose?\" Lu Chongshan revealed a rare smile and looked relaxed.</p><br/><p>\"Right...Ziyao! There's still Ziyao! Look how silly I am being!\"</p><br/><p>Yan Ruyi felt instantly calmer and she rejoiced. \"It's a good thing Ziyao is back in time! That child, I have watched her grown up. There were so many little girls in the circle, but she was still the more excellent one, compatible with our Tingxiao in every sense. If it wasn't because her family had suddenly moved away seven years ago, the two of them could have been together by now and I wouldn't have to worry so much! Whatever it is, after all the birth chart and fate evaluations, organizing blind dates cannot compare to those we know through and through!\"</p><br/><p>\"This is the rationale. Besides, they're both not married, so it is still not too late now. We don't have to do anything as long as we just help the two of them create some opportunities...\"</p><br/><p>\"Let's invite the Guans for a dinner on Sunday night! As the man's family, we should take more initiative. At the same time, we could ask if their family is interested!\" Yan Ruyi immediately suggested.</p><br/><p>\"No need to ask, Guan already called me much earlier. Based on his tone, he definitely has the same thought as we do,\" Lu Chongshan sounded delighted.</p><br/><p>Yan Ruyi beamed with satisfaction. \"That's great! Then, I will call Tingxiao now!\"</p><br/><p>\"Mmm.\"</p><br/><p>Yan Ruyi swiftly made a call to her son. \"Hello, Tingxiao!\"</p><br/><p>\"Mother, did something happen?\"</p><br/><p>\"I forgot to tell you today, your Uncle Guan and his family has returned, did you know?\"</p><br/><p>\"Mmm.\"</p><br/><p>\"Go make reservations at a suitable restaurant and find a suitable time to invite them to dinner to welcome them home,\" Yan Ruyi tried her best to speak levelly.</p><br/><p>\"Okay.\"</p><br/><p>Yan Ruyi hung up and Lu Chongshan quickly asked her nervously, \"How did it go?\"</p><br/><p>\"Our son said okay! He agreed!\" Yan Ruyi was very excited.</p><br/><p>Lu Chongshan looked smugly at her as if he had predicted this. \"See? I told you!\"</p><br/><p>\"Haih, if this is successful, then it will take a huge load off of my mind...\"</p><br/>\n</div>"}