{"title": "Chapter 762: Little Treasure's Inexplicability", "id": 762, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-762-little-treasures-inexplicability", "volume_title": "Volume 8", "body": "<h1>Chapter 762: Little Treasure's Inexplicability</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 762: Little Treasure's Inexplicability</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Today was a Saturday, so there was no school.</p><br/><p>The little bun had woken up very early and turned his wardrobe upside down to rummage through all his clothes. Just looking at the clothes had taken him more than two hours.</p><br/><p>Lu Jingli, who had came over, leaned on the little bun's door and yawned. \"My dear, why are you slower than girls when it comes to changing clothes? Also, what does the Post-Its on your clothes mean?\"</p><br/><p>For every set of clothes the little bun had rummaged out, he had stuck a Post-It with numbers written on them.</p><br/><p>He was confused and could not understand the little guy’s thought process at all...</p><br/><p>The little bun naturally ignored his second uncle and continued to rummage through his clothes, stick on a Post-It, and repeat.</p><br/><p>After half an hour, the little guy finally picked the set of clothes with the largest number among the pile.</p><br/><p>As he watched Little Treasure change into a handsome sapphire blue tuxedo with satisfaction all over his face, Lu Jingli's mouth twitched. He turned to his brother and said, \"Bro, they say a women's heart is inexplicable...but your Little Treasure's heart...is even more inexplicable than Mariana's Trench...\"</p><br/><p>Lu Tingxiao briefly skimmed the numbers on the clothes, then plainly said, \"Those numbers represent the amount of times Ning Xi kissed him when he wore those clothes to meet her.\"</p><br/><p>Lu Jingli was speechless.</p><br/><p>Very good...this is very like Little Treasure...</p><br/><p>He probably would not have thought of this even if he cracked his head! What made him even more speechless was the fact that Lu Tingxiao had actually understood this...</p><br/><p>Indeed, it was his biological offspring...</p><br/><p>After the little bun had changed into his clothes, he instantly ran to his father and looked up with sparkling eyes, indicating, \"Father, I am all prepared. We can go look for Aunty Xiao Xi now!\"</p><br/><p>Lu Tingxiao looked down at his son and replied, \"I'm bringing you to your grandparents’ today. Aunty Xiao Xi is busy today.\"</p><br/><p>The little bun's face immediately stiffened.</p><br/><p>Horrible news! It was as simple as that...</p><br/><p>\"Pfft...\" Lu Jingli could not help but laugh at the little guy's expression. \"Bro, you're too mean to your son! He changed his clothes for two and a half hours before you cared to tell him that you weren't going to see his beloved Aunty Xiao Xi? What difference is this from happily opening up a thick Chinese New Year red packet to find that it was test papers instead?\"</p><br/><p>The little bun indicated that his fragile soul had been traumatized, then he turned around to run inside his room.</p><br/><p>This was when Lu Tingxiao said again, \"Tomorrow is a Sunday. Aunty Xiao Xi will come here with your teacher.\"</p><br/><p>When he heard this, the little bun who had on an expression of \"I won't believe this world anymore\", instantly regained vigor.</p><br/><p>With that, Lu Tingxiao managed to lead Little Treasure out the door with ease.</p><br/><p>Before leaving, just as the three of them were about to get into the car, Lu Tingxiao suddenly paused and said to the butler behind him, \"Uncle Yuan.\"</p><br/><p>\"Big Master, what orders do you have?\"</p><br/><p>\"Please bring Little Treasure's bear over.\"</p><br/><p>\"Bear...?\" The old butler thought that Lu Tingxiao had some important orders, so he was confused by what he heard.</p><br/><p>At last, following Lu Tingxiao's orders, the old butler and two maids carefully brought the big bear prize from the parent-child event and tied it onto the car.</p><br/><p>\"My God! Bro, what are you trying to do now? Why do you want to carry this darn bear back to the old residence?\" Lu Jingli buried his forehead in his hands. He really felt like whenever he was with his brother, his intelligence was challenged.</p><br/>\n</div>"}