{"title": "Chapter 773: The Process Of Making Is Corrupt!", "id": 773, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-773-the-process-of-making-is-corrupt", "volume_title": "Volume 8", "body": "<h1>Chapter 773: The Process Of Making Is Corrupt!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 773: The Process Of Making Is Corrupt!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Of course, take IM and CN for instance, even though they both have the same deep form of defence, they have sufficient cash flow and a history of long-term profit. That year, you used USD 300,000 to buy 7% of IM's stock at USD 3.56 per unit. Three years later, IM changed their business strategy and started to withdraw their funds and invest in the production of smartphones. Now, the stock unit price has risen to USD 32.80, increasing by ten-fold. You're still amazing, daring to play in any field...\"</p><br/><p>\"Just my luck.\"</p><br/><p>\"You can be humble with others but you don't have to pretend with me!\"</p><br/><p>...</p><br/><p>Both family's parents watched their children interact in delight.</p><br/><p>\"Look how chatty the kids are! Sigh, you don't know that usually at home, we would talk until our mouths fell out and he would still reply us a grunt. It's very hard to get him to talk!\"</p><br/><p>\"Don't mention it, my daughter's the same! I remember that these two have always been very compatible since they were children...\"</p><br/><p>Guan Rui initially had something to say about the fact that Lu Tingxiao had a son and was currently dating someone. However, once he thought of Lu Chongshan's promise and saw that the huge Lu family's business had grown quite a bit in the past seven years after Lu Tingxiao had taken over, he suddenly felt like those were just petty matters.</p><br/><p>Most importantly, this potential marriage could bring the Guan family unmeasurable profits. In reality, Lu Chongshan was still not satisfied with Guan Ziyao as a candidate to be his future daughter-in-law.</p><br/><p>The one he was most satisfied with would still be Zhuang Keer from the Zhuang family. Now, that girl would really hit the spot.</p><br/><p>Guan Ziyao had grown up in a family of business; she was too smart and snobbish. Sadly, recently the Zhuang family had suddenly turned cold towards them, making Lu Chongshan feel somewhat regretful.</p><br/><p>After all, the Zhuang family was a family of public officials. Generations of Zhuangs had been married to families of similar backgrounds, much less with families of business. Such a tradition could not be forced.</p><br/><p>At last, the dinner was considered a happy occasion for both hosts and guests. Lu Chongshan and Yan Ruyi could finally relax and wait for Lu Tingxiao to change his mind, yet they did not know that their own son was like an unbreakable reed, an unmovable rock...</p><br/><p>At Regal Riveria Hotel.</p><br/><p>After she returned to the apartment, Ning Xi showered and was prepared to sleep when the doorbell rang.</p><br/><p>When she saw Lu Tingxiao outside her door, Ning Xi was slightly surprised. \"Lu Tingxiao, it's already so late. Why are you here? Come in!\"</p><br/><p>After he entered, Ning Xi was about to get him a pair of slippers when he pulled her into an embrace.</p><br/><p>\"What's wrong?\"</p><br/><p>\"Sorry, because of some reasons, I can't change their attitude in a short amount of time. But it doesn't matter if we're dating or getting married, it is still between us. You don't have to worry or please anyone else. No matter what happens, don't settle things alone without telling me. Just leave it to me. Do you understand what I'm saying?\"</p><br/><p>\"Mmm, I understand.\" Ning Xi nodded.</p><br/><p>Initially, he was worried she would mind, so he had rushed over that late at night to soothe her.</p><br/><p>\"Actually, if you want to resolve the other side, it's very easy to,\" Lu Tingxiao said.</p><br/><p>\"You have a plan?\" Ning Xi immediately asked suspiciously. Since he had a plan, why didn't he say so earlier?</p><br/><p>Lu Tingxiao nodded. \"There's a most effective way to do this. In fact, it is very easy. We just haven't achieved it yet.\"</p><br/><p>\"Really? What is it?\" Ning Xi was increasingly curious.</p><br/><p>\"Make a human.\"</p><br/><p>Ning Xi scratched her head, unsure of what he was implying. \"Ah? Make...make what?\"</p><br/><p>Lu Tingxiao looked towards her stomach meaningfully.</p><br/><p>When she noticed Lu Tingxiao's line of sight, Ning Xi's face instantly reddened. \"Hey! Lu Tingxiao, why are you starting to be corrupt again?!\"</p><br/><p>\"How am I corrupt?\" Wasn't this a very sacred thing?</p><br/><p>\"The process of making this human is corrupt!\"</p><br/>\n</div>"}