{"title": "Chapter 784: Gave Me A Person", "id": 784, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-784-gave-me-a-person", "volume_title": "Volume 8", "body": "<h1>Chapter 784: Gave Me A Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 784: Gave Me A Person</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi knew that Qin Shengyue had left the international fashion scene to stay in Imperial for Yan Junhao. From a certain perspective, Qin Shengyue was quite similar to her when she had given up on her acting dreams for Su Yan. This was probably also the reason why she could not help but want to help her!</p><br/><p>However, as compared to Qin Shengyue, the road she had chosen was the complete opposite. Even though it was very difficult to rediscover those precious things and rediscover herself, she never once regretted her decision.</p><br/><p>...</p><br/><p>At the Lu family's old residence.</p><br/><p>\"Sigh, little girl, you are usually so busy with studies and work. We never expected that you could cook too!\" Yan Ruyi was pleasantly surprised at the dishes Guan Ziyao had cooked up and laid on the table.</p><br/><p>No one was at home today, so she used the opportunity to invite Guan Ziyao over and have a one-on-one chat with her personally to get to know how her life away from home had been like for the past few years.</p><br/><p>In the end, not only was the girl elegant and poised in the way she carried herself; her range of knowledge was broad and she had also cooked a few of her best dishes. Even though it was just common home-cooked dishes, such a combination of talents was still quite rare.</p><br/><p>Guan Ziyao blushed when she heard the praises. \"I practiced while I was living alone during my studies abroad. Aunty, you are too kind to eat it even if my cooking skills aren't at a professional level.\"</p><br/><p>\"Look at you, you've already done so well! Most of the girls these days haven't even tried cooking but you had the heart despite being so busy. My ideas might be a little traditional, but I still think that even though families like us don't need to personally cook every day, the meaning of a personal home-cooked meal is definitely different.\"</p><br/><p>\"You're right, Aunty.\"</p><br/><p>Yan Ruyi herself was good at cooking, so she held a certain standard for her daughter-in-law. She still found culinary an important skill to have even in this day and age. She had initially thought that a well-pampered, young girl such as Guan Ziyao would definitely not know how to cook. Plus, she was always so busy yet she excelled in her work and studies. Who'd have thought that she also knew how to cook? This was indeed a pleasant surprise.</p><br/><p>\"Right, Ziyao, your herbal pork rib soup is not bad. I'll send some over to the elder later...or how about you go over with me?\" Yan Ruyi took the chance to suggest.</p><br/><p>When Guan Ziyao heard her invitation, she looked troubled. \"I'm sorry, Aunty, I still have a proposal to finish tonight. I don't think I'll be able to make it.\"</p><br/><p>If she followed Yan Ruyi over, she would have the chance to get close to Lu Tingxiao. However, he might be unhappy that she was using her mother and she obviously knew how to balance things well so as to not do anything that could annoy Lu Tingxiao.</p><br/><p>Besides, Lu Tingxiao had a girlfriend now. If she acted too desperately, it would reflect badly on her. To come over and accompany Yan Ruyi was sufficient.</p><br/><p>Yan Ruyi was even more satisfied when saw that she was not rash and had acted accordingly. \"That's okay then. Find another day to come to our house again.\"</p><br/><p>\"Okay, Aunty,\" answered Guan Ziyao politely.</p><br/><p>At Platinum Palace.</p><br/><p>In the restaurant, Lu Jingli's eyes practically bulged out of their sockets while his saliva leaked as he stared at the table full of dishes.</p><br/><p>\"Oh my God! Xiao Xi Xi! Are you crazy? You really know how to cook a full course meal!\"</p><br/><p>Ning Xi put her hands on her hips and said happily, \"Why can't I? I'm in a really good mood today! It's my pleasure!\"</p><br/><p>Lu Jingli looked pleased as he reached out for a piece of his favorite sweet and sour pork ribs. \"Looks like the issue went smoothly? Did Qin Shengyue agree to it?\"</p><br/><p>\"Not only did she agree, she is even willing to wear three whole sets of our outfits! Morning, noon, and evening outfits...all of it will not be repeated! And she even gave me a person, it's someone under her...\"</p><br/><p>Before she could finish, Lu Jingli wolf-whistled.</p><br/>\n</div>"}