{"title": "Chapter 781: If You're Satisfied, Please Give Five Stars", "id": 781, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-781-if-youre-satisfied-please-give-five-stars", "volume_title": "Volume 8", "body": "<h1>Chapter 781: If You're Satisfied, Please Give Five Stars</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 781: If You're Satisfied, Please Give Five Stars</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Late at night in a certain bungalow in the north of the city.</p><br/><p>An assistant carefully carried an elegant dress into the bedroom. \"Sis Yue, the dress for fashion week has been chosen. Would you like to take a look? It's a dress from History...I saw that you were praising their designer's style previously, so...\"</p><br/><p>Qin Shengyue was absentmindedly sitting in front of her dressing table, not even looking at the dress before saying, \"Just put it down.\"</p><br/><p>\"Oh...\" Seeing that Qin Shengyue did not reject the dress, the assistant was relieved and quickly put the dress down.</p><br/><p>After she left, the assistant immediately sent a message to the person who had asked for her favor: [No problem, I've passed it to Sis Yue.]</p><br/><p>In the room, Qin Shengyue stared listlessly at the dress, then pulled out a document from her drawer. The divorce papers.</p><br/><p>These few days, Yan Junhao's attitude towards her had become increasingly indifferent and he was increasingly anxious, urging her to sign her agreement to the divorce. He did not even care about their reputation anymore and immediately brought the matter to court.</p><br/><p>She stood up and slowly opened her wardrobe. Hanging inside was a beautiful dress for the runway. It was the dress she wore the first time she walked onto an international stage.</p><br/><p>While she was a slightly fitful and cranky woman, lacking the thoughtfulness of that woman, it did not mean she had put in any less effort into the relationship.</p><br/><p>Initially, she had a change in careers to become a top model and she even climbed to the peak of the fashion pyramid. However, for this man, she had given up on her dreams...</p><br/><p>At last, what had she gotten in the end?</p><br/><p>Compared to a girl who busked in the bar...</p><br/><p>Divorce? She had made such a sacrifice and clipped her own wings, and now he wanted a divorce while she watched the two of them take flight. How could she be willing to sign the papers!? Sadly, they had already reached this stage. Did she have any other options apart from divorce?</p><br/><p>She looked up at the time on the wall and saw that it was a few minutes till dawn.</p><br/><p>At that moment, she suddenly thought about that girl she had met in the carpark and her promise. She could not help but smile wryly...</p><br/><p>She slowly pulled open her drawer and took out the divorce papers with a trembling hand...</p><br/><p>At that moment, the room door burst open. Yan Junhao, who had not been home for half a month, was now standing at the door, staring at her with bloodshot eyes.</p><br/><p>That gaze of his made Qin Shengyue's heart wrench in agony. \"Didn't I say I would give you an answer tomorrow? You can't even wait another night?\"</p><br/><p>In the next second, Yan Junhao fell to his knees in front of her, and slapped himself, before hugging her legs. \"Dear! I've been wrong! Please forgive me! Please...\"</p><br/><p>Qin Shengyue was speechless.</p><br/><p>That very moment, a voice flashed in her mind, \"I can guarantee that your husband will be crying his way back to you while hitting his mouth to beg for your forgiveness!\"</p><br/><p>Then, her phone suddenly rang. She had received a message: [Ms. Qing, if you're satisfied, please give five stars! Spirit Studio]</p><br/><p>The next night, in a private room at Imperial Knight Hotel.</p><br/><p>Qin Shengyue finally evaluated the girl in front of her. \"How...how did you...how did you do it? I've asked Junhao the reason, but he wouldn't say anything. He only kept saying that he was wrong and he begged me to forgive him...\"</p><br/><p>This was within Ning Xi's expectations. As a man, how could Yan Junhao tell his wife that he had been cheated on by a third party?</p><br/><p>\"It's nothing special. I just hired a man to hook up with Yang Shirou and let your husband catch them red-handed!\" Ning Xi simply explained.</p><br/>\n</div>"}