{"title": "Chapter 786: Little Treasure Fed Her", "id": 786, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-786-little-treasure-fed-her", "volume_title": "Volume 8", "body": "<h1>Chapter 786: Little Treasure Fed Her</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 786: Little Treasure Fed Her</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Beside Butler Yuan was a graceful woman donned in a cheongsam. Lu Jingli swallowed the mouthful of food he was chewing on with a gulp before asking, \"Eh? Mom, why are you here?\"</p><br/><p>\"Grandmother!\" Jiang Muye greeted with a full mouth.</p><br/><p>\"Mother,\" Lu Tingxiao greeted her, then got the servant to get another set of cutlery for her.</p><br/><p>Ning Xi was in the middle of peeling a prawn for Little Treasure when she saw who had entered, so she stood up as well. \"Madam Lu.\"</p><br/><p>When Yan Ruyi saw Ning Xi at the dining table as well, she paused. \"I'm here to send you some soup...what are you doing? Is it a special day today? Why have you made so much food? Even Muye is here too!\"</p><br/><p>\"Oh, it's nothing, I just helped Sister-in-law with a small favor, so she made me some dishes to thank me!\"</p><br/><p>When she heard Lu Jingli call Ning Xi \"sister-in-law\", Yan Ruyi was naturally not too happy about it, but for Little Treasure's sake, she did not act out. She looked doubtfully at Ning Xi. \"She knows how to cook?\"</p><br/><p>\"You try for yourself!\" Lu Jingli used his chopsticks to pick up a braised eggplant for Yan Ruyi.</p><br/><p>After Yan Ruyi put it into her mouth, she frowned as she finished chewing and said, \"You punk, this is obviously ordered from the restaurant, isn't it?\"</p><br/><p>Lu Jingli's mouth twitched in amusement. \"Oh, please, Mother. I planted these eggplants in the garden myself. Little Treasure washed them, Brother cut them, then Sister-in-law cooked it! Oh, right, that Jiang Muye didn't do anything at all! He's here to leech on our meal!\"</p><br/><p>Yan Ruyi watched Little Treasure eat like a little squirrel with his chubby cheeks. He did not lift up his head and she felt her heart fill with warmth.</p><br/><p>Elders liked watching the younger ones eat more and Yan Ruyi was no exception. She did not want to move her gaze away from the little bun.</p><br/><p>The little guy had always counted his rice before eating them. Even when he had changed, she had never seen him eat this happily before. No wonder Little Treasure had fattened up once he was sent back. It seems like this girl was not entirely useless.</p><br/><p>At least, her culinary skills would have seen a few years of practice and training. Even though it was just an eggplant dish, the simpler a dish was, the more it tested one's skills in actual fact. She had only tried a bite earlier but it was actually as delicious as the one from the restaurants.</p><br/><p>\"Mother, want to join us?\" Lu Jingli asked.</p><br/><p>\"I've eaten, you guys go ahead!\" Yan Ruyi patted her little grandson's head as he focused on his food. \"Little Treasure, eat slowly! Be careful not to choke!\"</p><br/><p>Little Treasure thought that his grandmother wanted to eat too because he saw that she was watching him eat. So, he looked at the huge prawn Aunty Xiao Xi had peeled for him and struggled very hard with himself before his used his little chopsticks and delivered it to Yan Ruyi's mouth.</p><br/><p>Eat, Grandmother.</p><br/><p>Yan Ruyi was shocked by his affection. She quickly opened up her mouth and accepted it. \"Hey, thank you, my good little grandson, it's so delicious...\"</p><br/><p>\"Grandmother, what are you holding?\" Jiang Muye casually asked.</p><br/><p>Yan Ruyi's expression stiffened. \"It's nothing, the kitchen made some herbal pork rib soup today and I brought some over for you guys but I think you're probably too full to drink this now, so just leave it be!\"</p><br/><p>Yan Ruyi looked at Little Treasure for a while more before he fed her a few mouthfuls of food again, then she left happily.</p><br/><p>She'll tell the old one that Little Treasure had fed her later. He would definitely be so jealous!</p><br/><p>On the way home, Yan Ruyi was a little distracted. Tonight, she saw that Tingxiao, Jingli, Little Treasure, and even Jiang Muye all sitting at one table and eating happily. It really was such a nice family atmosphere. Little Treasure completely seemed like a normal, happy child as well.</p><br/><p>This was far from how it was like when she used to visit. It was cold and quiet without any life at all.</p><br/><p>And all of these changes have seemed to happen because of that woman...</p><br/><p>To be honest, if it was not because of Little Treasure's incident back then that left a scar in her, based on the way she took care of Little Treasure so well, she might have just...</p><br/>\n</div>"}