{"title": "Chapter 790: She Really Wasn't Messing Around", "id": 790, "volume": 8, "url": "http://boxnovel.org/hidden-marriage-chapter-790-she-really-wasnt-messing-around", "volume_title": "Volume 8", "body": "<h1>Chapter 790: She Really Wasn't Messing Around</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 790: She Really Wasn't Messing Around</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The two-hour long movie finally ended although the audience wished it would never end; they were hooked on the story.</p><br/><p>Even though she did not know how the box office did, after Ning Xi sat in the cinema and personally observed the audience's reactions and attitude, she instantly felt much calmer. No matter how the ticket sales fared, she had already reached her own standards on what she wanted to deliver on-screen.</p><br/><p>When they walked out, they saw that there were reporters interviewing the cinema-goers outside the theater.</p><br/><p>\"Hello, Miss, did you just finish watching 'The World'?\"</p><br/><p>\"Yes.\"</p><br/><p>\"How did you find the movie?\"</p><br/><p>\"Too awesome! Even better than I'd expected! Especially Xueluo's character, Superior Yingrong, she's so strong, she's practically my goddess! Her scenes with Zhao Sizhou were especially lovely too! At last, I almost cried because she had gone through so much with Chu Beichen yet they could not end up together!\"</p><br/><p>...</p><br/><p>\"Hi, Sir, whose acting in 'The World' left the most impression on you?\"</p><br/><p>\"Definitely the female lead! She's just too charismatic! Right, will this be broadcasted on television?\"</p><br/><p>\"Yes!\"</p><br/><p>\"That's great, I want to confess to my goddess, Xueluo, I love you!\"</p><br/><p>...</p><br/><p>As he watched the interviews going on, Jiang Muye's handsome was full of disdain behind his mask. \"Please! Do you think everyone's stupid? That theater opposite was entirely booked by Su Yan for Ning Xueluo's fans to watch for free, so everyone walking out of there are her diehard fans! If you interview them, they would obviously only praise Ning Xueluo!\"</p><br/><p>Gong Shangze looked at Ning Xi, confident of his boss. \"The audience has eyes. Word of mouth is something that cannot be faked.\"</p><br/><p>\"Talking about Su Yan...I previously saw online gossip that Su Yan had booked theaters for Ning Xueluo's fans in every city, supporting her new movie in full force! These two people are so loving. They are considered a stream of purity within the entertainment industry, aren't they?\" Han Momo's expression clearly envious.</p><br/><p>Jiang Muye shot her a disgusted look. \"Huh, purity? Little girl, don't easily believe things you've only seen the surface of!\"</p><br/><p>Jiang Muye looked a little worriedly at Ning Xi. Thankfully, Ning Xi's expression was very calm. It seemed like she had really entirely let go of Su Yan. But that was not a surprise. The saying was that one only failed to forget past loves because the new ones are not good enough.</p><br/><p>She was so loving with his uncle now, so why would she still care about Su Yan...</p><br/><p>\"Shangze, how's the preparation for Qin Shengyue's three set of outfits coming along?\" Ning Xi asked on the way back.</p><br/><p>\"I'm done preparing them. One of the sets will be the Nirvana-themed red dress from the Golden Awards and the other two are my latest works,\" Gong Shangze said confidently.</p><br/><p>It seems like his inspiration-driven works were going pretty smoothly lately.</p><br/><p>\"Good, then I'll bring them over for Qin Shengyue to look at. Miss Qin agreed that she will transfer a sales expert over to us, so she should be reporting to us soon. The two of you should get ready to welcome our new member, okay?\"</p><br/><p>\"Really? That's great!\" Han Momo was excited.</p><br/><p>Gong Shangze sighed a breath of relief too as he looked at Ning Xi with full admiration.</p><br/><p>Every time he felt like he had reached a dead end, she would always find a way, completing things he felt were impossible.</p><br/><p>On the side, Jiang Muye watched Ning Xi's hustler demeanor and suddenly thought of the words Ning Xi had said...</p><br/><p>This girl said that she wanted to provide for Lu Tingxiao...she really wasn't messing around, was she?</p><br/>\n</div>"}