{"title": "Chapter 803: Not Her Type", "id": 803, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-803-not-her-type", "volume_title": "Volume 9", "body": "<h1>Chapter 803: Not Her Type</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 803: Not Her Type</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After Fashion Week, Spirit Studio had proven themselves worthy of the Golden Award. In addition to Qin Shengyue’s influence, they were quite well known now and this helped to open up new opportunities for them. Various parties contacted them and expressed their intention to work with them on their new project.</p><br/><p>However, there were simply too many of them from a diverse range of backgrounds and it was hard to judge; if they picked a wrong company to work with, then it might just spell the end of them.</p><br/><p>Ning Xi’s workload suddenly increased significantly. While she needed to research on a party to collaborate with, Gong Shangze and Han Momo were working on the samples.</p><br/><p>As she was occupied with her work, the assistant from Qin Shengyue finally arrived.</p><br/><p>Han Momo stood up and stretched as she heard the doorbell ring. \"Is it the Marketing Director? I’ll go get it!\"</p><br/><p>Moments later, Han Momo led a lady in. She was wearing a crisp champagne dress with her hair tied into a bun and not much emotion expressed on her face. She exuded an incredible aura.</p><br/><p>\"I’m Qiao Weilan. CEO Qin asked me to offer my assistance here,\" Qiao Weilan spoke straightforwardly in a formal tone.</p><br/><p>\"Hello, I’m Ning Xi, the person behind Spirit Studio. Please have a sit.\" Ning Xi brought her into the office.</p><br/><p>\"I was late because I had a few tasks to hand over and it took several days,\" Qiao Weilan explained.</p><br/><p>\"It’s alright, I understand.\"</p><br/><p>After some small talk, Ning Xi went straight to the point. \"I’m not sure if CEO Qin mentioned this to you before. We’re a fairly new and small studio, so surely we are incomparable to your workplace before. Although CEO Qin lent you to me, if you don’t like it here, I’d be glad to help you talk to CEO Qin.\"</p><br/><p>\"No problem, I have no objections to CEO Qin’s arrangement,\" Qiao Weilan replied expressionlessly.</p><br/><p>Ning Xi assessed Qiao Weilan’s attitude. While she was not very friendly, she did not look unsatisfied either; she was just obeying orders.</p><br/><p>This was much better than what she expected. She had been assigned here on such short notice, so Ning Xi did not expect her to fit in so quickly.</p><br/><p>Ning Xi continued with her introduction, \"Our studio is really simple, there’s not much explaining. Here are your two colleagues, our Design Director Gong Shengze and his assistant Han Momo.\"</p><br/><p>They introduced themselves and Ning Xi noticed that Qiao Weilan's gaze was transfixed on Gong Shangze for a little while before she returned to her usual robot-like self.</p><br/><p>Afterwards, Ning Xi gave her a tour around the studio and arranged a workspace for her. \"Our aim is now mainly focused on high-class bespoke and retail shops. The target audience is the high-end market, so we must pick our client groups carefully…\"</p><br/><p>Qiao Weilan spoke up, \"I’ll filter through the suitable clients in three days, and I’ll deal with them after you look through the list. I’ll discuss further collaboration details with the other party.\"</p><br/><p>\"Alright.\"</p><br/><p>Although she looked cold, her level of professionalism was top notch, and her willingness to be so involved solved Ning Xi’s worries.</p><br/><p>Ning Xi would just see if Qiao Weilan would keep working obediently or would fit with them well…</p><br/><p>Most importantly, this beauty was not Ning Xi’s type, so her chastity was defended!</p><br/>\n</div>"}