{"title": "Chapter 811: Setting A New Sail", "id": 811, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-811-setting-a-new-sail", "volume_title": "Volume 9", "body": "<h1>Chapter 811: Setting A New Sail</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 811: Setting A New Sail</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When Ning Xi heard this, she smiled and stood up to hurl her hand towards Chen Mian, her eyes clear. \"Director Chen, you're betting your 10-year directing career on this while I've only got 'The World', so I'm still profiting either way. In fact, to be honest, I've waited very long for such a script, so there's no need for me to consider further, Director Chen. I'm happy to embark on this collaboration.\"</p><br/><p>Chen Mian was stunned, then he stretched out his hand to shake hers. \"It's my pleasure!\"</p><br/><p>Because this dream that had never extinguished from the depths of his heart, he cared so much about this script, and would not allow there to be any flaws.</p><br/><p>His ambitions made him want to find an actress like the Oscar-winning Hillary Swank in \"Boys Don't Cry\", to really be able to act to the extent where it was hard to differentiate between male and female. But to let all those small, Internet female celebrities put on a male disguise? That shoot would end up as a horror movie! He would much rather let this script rot a lifetime in his drawer than touch it.</p><br/><p>However, just as he had thoroughly compromised with reality, and had taken loads of investors' money to shoot commercial films that did not move him, he met Ning Xi and saw that his passion had yet to be extinguished...</p><br/><p>Chen Mian muttered to himself for a while, then he said with a serious expression, \"Maybe I should treat Jiang Muye to a meal. If it was not for him being so hard to serve, I wouldn't have met you.\"</p><br/><p>\"Uhh, well...there really is no denying that...\" Ning Xi laughed, \"Looks like I should treat him too!\"</p><br/><p>\"Do you usually dress like this?\" Chen Mian asked, evaluating Ning Xi again. Her body was clearly exquisite, yet no matter if it was her demeanor or posture, there was not a tinge of submissive femininity.</p><br/><p>\"Not too often, I guess, only when I need to.\"</p><br/><p>When she was abroad back then, she would often be in a male disguise. She had done less of that upon returning. However, she was used to it, and the longing to do so lingered.</p><br/><p>\"You're very natural, even making me think that you were originally like this. Even acting skills are useless,\" Chen Mian probed as he examined her, \"Initially, I was prepared to have the female lead prepare a month before, and within this month, she would live entirely in a male disguise so as to completely immerse herself into the role. It seems like you won't need it. I've observed that your speed of immersing into a role is pretty good.\"</p><br/><p>Ning Xi actually wanted to say that she had not really used much acting because when she was in a male outfit, it came naturally to her...</p><br/><p>However, in this movie, she would have to act as two characters; not only the female lead, she also had to act as the female lead's twin brother too, so the pressure was pretty high. She did indeed need to prepare and study the characters.</p><br/><p>\"I still have a few more days till I'm done with the show on my hand. Wait till it's finalized, and I will start to plan the shoot and choose the cast. You can use this period of time to prepare. If there's anything you don't know or need help with, look for me anytime. Have your phone on standby. When everything is in place, I will contact you to join the team.\"</p><br/><p>\"Okay, I understand, thank you, Director Chen!\"</p><br/><p>\"One last thing, to avoid any disturbances, this time I plan to keep the entire shoot a secret and not do any promotions. Are you okay with this?\"</p><br/><p>\"No problem!\"</p><br/><p>...</p><br/><p>When Chen Mian left, Ning Xi was impatient to convey the news to Ling Zhizhi. Ling Zhizhi was very happy for her, and said that she would support her fully. She also said that she would discuss the concrete details with the other side soon.</p><br/><p>Ning Xi's new film was finally, officially decided upon.</p><br/>\n</div>"}