{"title": "Chapter 826: Not Jealous?", "id": 826, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-826-not-jealous", "volume_title": "Volume 9", "body": "<h1>Chapter 826: Not Jealous?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 826: Not Jealous?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Right in the centre of Beijing, in Ning Xueluo’s newly bought villa, Ning Xueluo held a glass of wine in her hands. Upon gulping the contents down, she threw the glass to Chang Li, angrily saying, \"You go and tell Su Yimo about what happened tonight!\"</p><br/><p>\"Understood!\" Chang Li carefully took the glass, then she said cautiously, \"Actually, it was just one outing. You don’t have to be so riled up...Lu Tingxiao was probably giving his brother some respect!\"</p><br/><p>Ning Xueluo glared at her. \"Rubbish! Of course, I know that! Or are you trying to say that Lu Tingxiao actually likes Ning Xi?\"</p><br/><p>Chang Li kept quiet.</p><br/><p>\"Get lost! I’m frustrated just by looking at you! Useless!\"</p><br/><p>Chang Li quickly fled. Ning Xueluo was too easily triggered tonight, and she did not want to get scolded again.</p><br/><p>She was scolded when she did nothing, scolded when she did something. For some reason, nothing good had been happening to her recently…</p><br/><p>After Chang Li left, Ning Xueluo finished all the wine left in the bottle, then she went into the bathroom and took a warm bath. She changed into a thin nightgown. She proceeded to lie down on the big soft bed in the bedroom, and made a phone call.</p><br/><p>\"Hey, Xueluo.\" The gentle voice of a man came through.</p><br/><p>\"Bro Yan…\"</p><br/><p>\"You’re not asleep yet? It’s late already.\"</p><br/><p>\"Bro Yan...Bro Yan...I’m not feeling well…\"</p><br/><p>\"Not well? What’s wrong?\"</p><br/><p>\"I’m not good...what should I do...I feel like dying…\"</p><br/><p>\"Stop saying that! Where are you? Is there anyone with you?\"</p><br/><p>\"I’m at...the villa…\"</p><br/><p>\"Stay there, I’ll be right there!\"</p><br/><p>…</p><br/><p>After the call ended, she threw her phone on the bed and took out a neat little glass container, then she poured some essential oil on her hands and rubbed it all over herself…</p><br/><p>Soon, an engine sound stopped outside the villa, then there were running footsteps.</p><br/><p>\"Xueluo…\"</p><br/><p>A soft, slender body hugged Su Yan the moment he opened the room to Xueluo’s bedroom.</p><br/><p>\"Bro Yan…\" Ning Xueluo hugged him tightly with a terrified expression on her face as if her life depended on it. \"Bro Yan, do you not love me anymore?\"</p><br/><p>Su Yan frowned and he put her on the bed. \"Why did you drink so much?\"</p><br/><p>\"Is it true? Do you not love me anymore?\" Ning Xi looked at him and asked persistently.</p><br/><p>Su Yan was helpless against her. \"How could it be!? Who would I love aside from you?\"</p><br/><p>Ning Xueluo looked sadly at him \"Ning Xi...do you still love Ning Xi?\"</p><br/><p>Su Yan’s face froze. \"Nonsense! We’ve already talked about this! Why are you thinking about it again?\"</p><br/><p>\"Tonight, you’ve been looking at her...constantly…\" Ning Xueluo’s expression was full of melancholy.</p><br/><p>\"Xueluo, you’re overthinking this. I was just afraid that Ning Xi would be taken advantage of,\" Su Yan explained.</p><br/><p>\"Taken advantage of? How could she be taken advantage of when it comes to Lu Tingxiao? Su Yan, look at me, do you just feel guilt towards her? Is it just worry you feel...and not jealousy?\"</p><br/>\n</div>"}