{"title": "Chapter 824: How Shameless!", "id": 824, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-824-how-shameless", "volume_title": "Volume 9", "body": "<h1>Chapter 824: How Shameless!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 824: How Shameless!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Tingxiao refused to sing a normal song with Ning Xueluo just now, so logically, he would not agree this time. Everyone did not take them seriously.</p><br/><p>Speaking of which, the two brothers really seemed to have such a good relationship, to the point that Lu Jingli would pull this on his brother!</p><br/><p>Lu Jingli quickly selected the song \"Swirl\", and urged Lu Tingxiao, \"Quick! Drink it if you don’t want to sing! Three of it, no lesser!\"</p><br/><p>The intro to the song had already started…</p><br/><p>Lu Tingxiao stood up and went towards the table. It seemed like he was ready to take the alcohol.</p><br/><p>However, Lu Tingxiao avoided the glasses and picked up the microphones…</p><br/><p>Wow! What was Lu Tingxiao trying to do?</p><br/><p>Everyone was surprised as Lu Tingxiao gently put the other mic into Ning Xi’s hands.</p><br/><p>Ning Xi was confused. What just happened? What did he mean by this? Had the devil gone crazy? He was really going to sing? And he picked her?</p><br/><p>The crowd almost went crazy as well!</p><br/><p>Ning Xi!?</p><br/><p>What did Lu Tingxiao mean by this?</p><br/><p>He was going to sing, and he chose Ning Xi to sing with him?</p><br/><p>Everyone’s jaws dropped, then Lu Tingxiao casually leaned back on the sofa, raised his mic and started singing, \"Following your designs, those curves, I spun round and round, everything in the world spun around me. Be with me, I’ll stay for you…\"</p><br/><p>A cello-like voice spread through the whole room…</p><br/><p>\"Wow! Is this...Mr. Lu’s voice? My ears are getting pregnant!\"</p><br/><p>\"This is way too good! Did they forgot to mute the artist’s voice?\"</p><br/><p>\"Nope! It’s really Mr. Lu! Oh my gosh, Mr. Lu’s voice is so sexy! I’m passing out!\"</p><br/><p>\"Oh my God! Didn’t he say he doesn’t know how to sing? This is too good! I thought with his cold personality, he would be bad at singing! But I'm proven wrong now!\"</p><br/><p>…</p><br/><p>The female part came in soon, Ning Xi missed a few beats as she was confused, she then quickly followed up, \"Crossing through logic, surpassing nature, hiding from God to be with you...even if I’m just left with pieces, I’ll still love you to the end of the world, if you shattered, I would not want to be whole again...sink into my deepest part…\"</p><br/><p>The crowd was screaming as Ning Xi sang.</p><br/><p>Ning Xi looked calm but her cheeks were burning!</p><br/><p>What was this \"sink into my deepest part\"!?</p><br/><p>The lyrics of this song were so shameless!</p><br/><p>Damn that Lu Jingli!</p><br/><p>If one did not think too much into it, the lyrics meant nothing much, but no one present here was pure at heart, not after so many drinks!</p><br/><p>Then came the duet. Lu Tingxiao and Ning Xi sang together, \"Come and hug me, let’s form a swirl, our kiss will cause huge waves…\"</p><br/><p>Ning Xi sang, \"Drowning you with the whole world…\"</p><br/><p>Lu Tingxiao joined in, \"I love you as much…\"</p><br/><p>…</p><br/>\n</div>"}