{"title": "Chapter 823: Lost Of Principle", "id": 823, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-823-lost-of-principle", "volume_title": "Volume 9", "body": "<h1>Chapter 823: Lost Of Principle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 823: Lost Of Principle</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xueluo did not expect for Lu Tingxiao to kiss Ning Xi, a new and nameless actress, and decline singing a song with her…</p><br/><p>Chang Li felt like she had done something right for once at first, but Lu Tingxiao’s reply made her take a few steps back…</p><br/><p>\"Well...then...I’ll take the punishment!\" Ning Xueluo went to get her glasses.</p><br/><p>She still had a small ray of hope that Lu Tingxiao would change his mind, but he just sat there quietly without any change in expression.</p><br/><p>\"Xueluo can’t handle alcohol well, I’ll help her!\" Su Yan stood up and took the glass from Ning Xueluo, drinking all three glasses for her.</p><br/><p>The atmosphere softened a little and Ning Xueluo felt less awkward as well. After all with Lu Tingxiao’s identity, it was normal for him to decline. Lu Tingxiao silently stared at Su Yan coldly.</p><br/><p>Lu Jingli understood Lu Tingxiao well and he could tell what he wanted to do in one glance. He had a plan.</p><br/><p>Obviously, his brother was jealous of Su Yan’s past relationship with Ning Xi, and he wanted to avenge her…</p><br/><p>After a few rounds, Lu Jingli was it, so he looked at his brother. \"Bro, truth or dare?\"</p><br/><p>Lu Tingxiao stared at him. \"Dare.\"</p><br/><p>Lu Jingli’s eyes shone. How cooperative!</p><br/><p>Could he know about his plan already?</p><br/><p>Everyone looked at them interestingly, Lu Jingli was a playful person. Who knew what plans he had for his brother? But would he be daring enough to fool Lu Tingxiao?</p><br/><p>Lu Jingli smilingly looked at Lu Tingxiao. \"Bro, my request is simple, you’ll be singing a song with someone! You can pick anyone you want!\"</p><br/><p>Everyone felt that his request was weird. Lu Tingxiao already said that he did not know how to sing and was unwilling to sing, yet Lu Jingli now wanted him to sing with someone else. Was he deliberately trying to make him lose?</p><br/><p>But it was not the end, Lu Jingli continued, \"And I’ll be choosing the song! Heh...I want you and another person to sing 'Swirl'!\"</p><br/><p>Everyone went silent…</p><br/><p>Jiang Muye was annoyed. \"'Swirl', huh…\" He felt that his second uncle had lost all his principles!</p><br/><p>Ning Xi dared not to look at them.</p><br/><p>Actually, this song was just a little ambiguous. It was nothing much to her, but if it was with Lu Tingxiao…</p><br/><p>No way! No! No more thinking about it!</p><br/><p>She almost could not stand just imagining Lu Tingxiao sing this song.</p><br/><p>Everyone remembered the lyrics of \"Swirl\", realizing Second Master was being very playful! He was trying to make Lu Tingxiao sing something so suggestive with someone!</p><br/><p>Most importantly, it would be really weird to sing with another guy, so he would only pick a girl, wouldn't he?</p><br/>\n</div>"}