{"title": "Chapter 833: The Only Grandson", "id": 833, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-833-the-only-grandson", "volume_title": "Volume 9", "body": "<h1>Chapter 833: The Only Grandson</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 833: The Only Grandson</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Night soon fell. The gates opened and the invited guests trickled in. All the guests were to pass through a metal detector and aside from the jewelry on the ladies, all dangerous items were strictly prohibited. More and more people arrived and numerous luxury cars filled the driveway.</p><br/><p>As an event hosted by one of the most prestigious families in Imperial, journalists were preying on it, but the Lu family had been low profile as usual. Furthermore, the banquet was not open to the public, so no one dared to approach them.</p><br/><p>\"Bro Lu, happy birthday!\" Guan Rui greeted happily. Aside from Guan Ziyao, there was another teenager following after him.</p><br/><p>\"Thank you, come in! This is…?\" Lu Chongshan and Yan Ruyi looked at the teenager beside Guan Rui. He was about thirteen or fourteen years old, handsome and carried a slight aura of arrogance.</p><br/><p>\"This is my grandson, Guan Zhichen!\" Guan Rui introduced.</p><br/><p>Yan Ruyi gushed, \"Oh, Zhichen! He was still so small when I last saw him, but he’s all grown up now! I almost couldn’t recognize him! He should be in middle school now?\"</p><br/><p>\"Aunty Lu, he’s in his third year of high school now, he skipped a few grades,\" Guan Ziyao replied meekly.</p><br/><p>\"Wow, impressive! He must be even better than his father next time!\"</p><br/><p>Guan Rui was really proud of his grandson, but he carried himself humbly. \"He still has a long way to go!\"</p><br/><p>…</p><br/><p>As they entered the hall, Guan Ziyao looked around then asked, \"Aunty Lu, isn't Little Treasure around?\"</p><br/><p>\"Oh, Little Treasure is in the room now., I’m afraid that he might not get used to so many people around, but we’ll have him come out later.\" Yan Ruyi sounded extra kind and loving the moment she was talked about her grandson.</p><br/><p>Guan Ziyao then clung onto Yan Ruyi’s arms and asked, \"Aunty, I...heard a little about Little Treasure’s condition. I had a minor in psychology when I was studying abroad, and I’ve been in contact with numerous special kids. Maybe...I could help and take a look at him?\"</p><br/><p>\"Well…\" Yan Ruyi was hesitant.</p><br/><p>\"Things cannot remain this way! When Zhichen was five years old, he was already following my brother to the company to attend meetings. He was not afraid at all…\" Guan Ziyao continued.</p><br/><p>She knew the key person in the Lu family was neither Yan Ruyi nor Lu Chongshan; it was Lu Tingxiao’s son, Little Treasure…</p><br/><p>He was Lu Tingxiao’s only son, and Lu Chongshan and Yan Ruyi’s only grandson. Because they only had this sole grandson, they were really concerned about this child more than anything else. Because of this, she had purposely minored in psychology and specialized in autism.</p><br/><p>When Yan Ruyi heard her suggestion, she felt uneasy for some reason. Real autism cases would see a child totally cut off from the outside world, but Little Treasure was shocking and acting more extroverted than other kids, so how could he be autistic? Even Qin Mufeng mentioned that Little Treasure did not score highly on the autism spectrum. He surmised that it was more of a post-traumatic disorder.</p><br/><p>Moreover, ever since Ning Xi had appeared, Little Treasure’s condition had improved significantly. He started to smile and laugh, even talking…</p><br/>\n</div>"}