{"title": "Chapter 831: The Little Bun’s Extraordinary Genes", "id": 831, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-831-the-little-bun%E2%80%99s-extraordinary-genes", "volume_title": "Volume 9", "body": "<h1>Chapter 831: The Little Bun’s Extraordinary Genes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 831: The Little Bun’s Extraordinary Genes</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the office, Teacher Wang poured Ning Xi a cup of tea and spoke hesitantly, \"Mrs. Lu, we have had a few tests before. I wonder if you saw Lu Qingyu’s results?\"</p><br/><p>\"Yes.\" Ning Xi nodded.</p><br/><p>Teacher Wang was a little stunned at Ning Xi’s calmness, but she continued, \"All his scores were zero…\"</p><br/><p>\"Yes, I’m aware of it.\"</p><br/><p>\"The main point is that he did not make any mistakes; he simply didn’t attempt the test at all and submitted blank papers for all of them. Even if he was unsure how to do, it’s impossible that he didn’t know all of them!\" Teacher Wang sighed, \"I just want to know what is the child thinking? You also know what’s happening with your child. We as teachers can’t communicate with him well.\"</p><br/><p>Ning Xi let out a sigh of relief. So, Little Treasure was not bullied at school after all!</p><br/><p>Ning Xi chose her words carefully. \"Teacher Wang, I’m grateful for your concern for our child, but please understand that his situation is special. Our purpose of sending him here is to let him interact with kids of his own age, hoping that he would be happier. We do not expect anything further than that. We don’t demand that he gets good grades, so you don’t have to feel pressured.\"</p><br/><p>Teacher Wang was unsure what to reply. It was the first time she had ever heard of a parent being indifferent about their child’s grades. Most parents now were focused on their children’s achievements, afraid that they might lose out from the start, and began sending them to various classes at very young age…</p><br/><p>But since the boy's mother herself had already mentioned that grades did not matter, what else could she say?</p><br/><p>In addition to Little Treasure’s special condition, Teacher Wang felt she should not be prying more. \"Alright then...I understand!\"</p><br/><p>\"I really appreciate your concern about Qingyu! Thank you! If it weren’t for you, he wouldn’t have adapted to school life this quickly!\" Ning Xi acknowledged her.</p><br/><p>If she did not understand Little Treasure, she might have worried about him as well. However, she knew him for such a long time, and the little bun’s extraordinary genes had surpassed her expectations countless times. His intelligence was way off the charts, and he was talented in many things as well.</p><br/><p>The only problem was his motivation.</p><br/><p>Ning Xi felt it was humiliating to let the little bun even attempt a kindergarten level test. Every child was unique in their own way, and they deserved their own way of learning, so why should they force an adult’s pride onto them and make them get full marks in tests?</p><br/><p>\"You’re welcome, Mrs. Lu, this is my job! Although Lu Qingyu is an introvert, he’s very cute and lovable. I hope that he’ll do well!\" Ning Xi’s respectful attitude prompted Teacher Wang to continue providing her best for the boy.</p><br/><p>A few days later, in the evening, the banquet for Elder Lu’s 60th birthday was about to start and the servants were busy with the preparations.</p><br/><p>Yan Ruyi wore an elegant red cheongsam. As she was giving instructions to the servants, she kept on looking outside nervously. Lu Chongshan was pacing around anxiously.</p><br/>\n</div>"}