{"title": "Chapter 845: I’m Not Worthy Of Xiao Xi", "id": 845, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-845-i%E2%80%99m-not-worthy-of-xiao-xi", "volume_title": "Volume 9", "body": "<h1>Chapter 845: I’m Not Worthy Of Xiao Xi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 845: I’m Not Worthy Of Xiao Xi</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At a quiet table inside the banquet hall.</p><br/><p>\"What did you say? That little maid is Tingxiao’s girlfriend?\"</p><br/><p>\"Yes, but...I don’t understand why she's dressed that way!\" Guan Ziyao could not help feeling that that woman was hiding something.</p><br/><p>Guan Rui replied in a tone of contempt, \"Lu Chongshan and Yan Ruyi aren’t acknowledging her, so she does not dare to appear beside Lu Tingxiao in public and has to act as a servant! Ziyao, you don’t have to waste your time on a person like her, spend your effort…\"</p><br/><p>As Guan Rui was still lecturing his daughter, Lu Tingxiao suddenly came over, \"Uncle Guan, thank you for coming to my father’s birthday dinner tonight.\"</p><br/><p>Guan Rui was flattered as Lu Tingxiao had come to greet him personally. He smiled at the man. \"You’re much welcome, Tingxiao, I’m good friends with your father!\"</p><br/><p>After some small talk, Lu Tingxiao raised his hand to signal someone.</p><br/><p>While Ning Xi was eating with Little Treasure, she suddenly saw Lu Tingxiao summoning her, so she let Little Treasure know, then she ran over, \"First Master, is there anything I can help you with?\"</p><br/><p>Guan Rui and Guan Ziyao looked at Lu Tingxiao in confusion, unsure of why he had asked this woman to come over.</p><br/><p>Maybe he wanted to ask her to get some wine...</p><br/><p>Lu Tingxiao looked at the girl gently, then looked at Guan Rui and introduced them, \"Uncle Guan, this is my girlfriend, Ning Xi. Xiao Xi, this is Uncle Guan, a good friend of my father's. You don’t have to put up an act in front of him.\"</p><br/><p>Ah...what was the devil trying to do, introducing her to Guan Rui?</p><br/><p>Was he trying to irritate Guan Rui and Guan Ziyao?</p><br/><p>Fine…</p><br/><p>It might be intentional…</p><br/><p>Ning Xi was surprised, but she went along with Lu Tingxiao and greeted, \"Hello, Uncle Guan.\"</p><br/><p>\"Hel...hello…\" Guan Rui looked very displeased all of a sudden.</p><br/><p>What did Lu Tingxiao mean by this!?</p><br/><p>He knew that their families had the intention for him and Guan Ziyao marry, yet he had introduced this woman to him on purpose!</p><br/><p>However, he did not say anything more. After all, Lu Tingxiao had not done anything wrong and was just being polite by introducing her to him.</p><br/><p>\"You can go and take care of Little Treasure now.\" Lu Tingxiao gestured to Ning Xi to go back after she had greeted them.</p><br/><p>Then, as if he did not notice Guan Rui and Guan Ziyao’s change in expressions, Lu Tingxiao continued, \"That was inappropriate of me, I actually wanted to introduce her to everyone, but Xiao Xi really prioritizes her career. Because of her job, we can’t publicly announce our relationship just yet. I just have to put up with it.\"</p><br/><p>\"Right...it was inevitable!\" Guan Rui was so offended that he almost snapped the stem of his wine glass by holding it tightly, but he still had to maintain his integrity as Lu Tingxiao’s elder. On the other hand, Guan Ziyao was weaker and she already looked pale.</p><br/><p>Guan Rui took a deep breath and returned to a calm state as he faked a smile. \"Tingxiao, as your elder, I have to remind you that the girl does not come from a prestigious family and that she’s not worthy of you! I’m afraid that your parents would not acknowledge her as well, yes? You have to understand that girls from that industry are mostly into it for money, but it’s alright if you’re just playing around. If you’re being serious, that’s really inappropriate then…\"</p><br/><p>Lu Tingxiao looked at Guan Rui and replied expressionlessly, \"Thank you for your concern. In terms of statuses and all that, it’s sure unworthy...I’m not worthy of Xiao Xi.\"</p><br/>\n</div>"}