{"title": "Chapter 848: Little Bunny! It’s You!", "id": 848, "volume": 9, "url": "http://boxnovel.org/hidden-marriage-chapter-848-little-bunny-it%E2%80%99s-you", "volume_title": "Volume 9", "body": "<h1>Chapter 848: Little Bunny! It’s You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 848: Little Bunny! It’s You!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The crowd was impressed by the education method of the Guans.</p><br/><p>\"This is what I call real elite education!\"</p><br/><p>\"They are this strict to their sole male grandchild, no wonder he’s this amazing!\"</p><br/><p>\"Hey, Elder Guan, what’s the secret to educating kids? Give us some tips!\"</p><br/><p>…</p><br/><p>As the guests were discussing children's education with Guan Rui, a girl’s clear voice came through, \"Master Mo, I heard you’re looking for First Master. Was there something you need? He is greeting some guests outside! I can help you to send a message if it’s something urgent!\"</p><br/><p>\"Oh, it’s nothing urgent, just a mathematics question...ugh...you...little bunny...how’re you here?\" his voice faded off to a lower tone. Mo Lingtian was shocked when he realized who the maid he was talking to was. He almost could not recognize her disguise…</p><br/><p>Ning Xi ignored his question and continued her act, scanning the questions Mo Lingtian had in his hands. \"This looks easy, we shouldn’t need First Master. Is it alright if I get Little Master to help?\"</p><br/><p>\"What?\" Mo Lingtian thought he heard her wrong. \"Who did you say? Little Treasure?\"</p><br/><p>Ning Xi nodded. \"Yes, our Master Qingyu.\"</p><br/><p>Mo Lingtian ignored Ning Xi’s outfit, he reminded her, \"Little girl, look at this properly, but you probably don’t understand it as well...anyways, this is not some kindergarten mathematics, it’s advanced mathematics, and these are competitive-leveled questions!\"</p><br/><p>\"Oh, no problem, Master Mo, Little Master is really good!\" Ning Xi blinked her eyes and asked Little Treasure in a coy voice, \"Little Master, this little brother here needs some help with a question, can you help him?\"</p><br/><p>Little Treasure nodded in enthusiasm.</p><br/><p>Lu Chongshan was already frowning when Ning Xi had appeared and now he felt it was ridiculous when he realized what she was trying to do. He suppressed his anger and stopped her. \"There’s nothing for you to do here, stop bothering the guests and bring the Little Master somewhere else!\"</p><br/><p>Seeing how this maid was acting so foolishly, some guests pitied Lu Chongshan but most of them were laughing inside.</p><br/><p>Why did the Lu family get someone so stupid to take care of the Little Master? Could it be easier for them to communicate with their low IQ?</p><br/><p>Guan Rui and Guan Ziyao looked at each other in amusement. Before, they were cautious about this woman’s presence, but now they thought she could be ignored.</p><br/><p>Seeing the maid from the Lu family asking a little kid to help him, and even bragging that he could surely solve it, Guan Zhichen felt humiliated. Flaring his nostrils haughtily, he handed over his workbook. \"You said that he can help me? Sure, let him try!\"</p><br/><p>Guan Ziyao tried to stop him. \"Zhichen, stop being unreasonable, Qingyu is only five years old!\"</p><br/><p>\"I’m sorry for the fuss!\" Lu Chongshan had never felt this embarrassed.</p><br/><p>\"It’s alright...she just didn’t get to look at the questions properly!\" Guan Rui acted generously.</p><br/><p>The woman was probably trying to get on Lu Chongshan’s good side, but she could not even understand the standards of these questions. How foolish!</p><br/><p>Suddenly, the crowd was cheering…</p><br/>\n</div>"}