{"title": "Chapter 906: Softened", "id": 906, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-906-softened", "volume_title": "Volume 10", "body": "<h1>Chapter 906: Softened</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 906: Softened</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi smiled, her eyes curving like crab apples in its first bloom. \"Of course not, I trust your evaluation, Director Chen. If he can't even handle this, that won't really hold up well for your name!\"</p><br/><p>She was acting normally this time, not even putting in any extra effort and being lenient. That year when she had overshadowed Jiang Muye, she was cruel...</p><br/><p>Chen Mian was almost bedazzled by that smile and he helplessly said, \"That's enough, won't you have mercy on me!?\"</p><br/><p>\"I'm sorry, I haven't managed to adjust myself in time.\"</p><br/><p>Chen Mian was speechless.</p><br/><p>As the two were speaking, Chen Mian caught Ke Mingyu from the corner of his eye. He seemed to be waiting for them to finish.</p><br/><p>\"Mingyu, do you need anything?\"</p><br/><p>\"I'm here to talk to Senior Ning Xi.\" Ke Mingyu's usual poker face was unusually tense.</p><br/><p>Ning Xi looked over curiously, unsure what she was needed for.</p><br/><p>Among all of the newbies, she found Ke Mingyu the hardest to read. However, she felt an odd sense of familiarity with him.</p><br/><p>Sadly, she did not get the chance to shoot with him today. They would only meet the next day...</p><br/><p>\"Could I have your signature? I'm your fan,\" Ke Mingyu said without any expression.</p><br/><p>\"My fan?\" Ning Xi raised her brows in surprise. \"Of course.\"</p><br/><p>Then, Ning Xi picked up the notebook and pen in his hand to give him her autograph and she added on some words of encouragement too.</p><br/><p>\"Thank you, Senior.\" Ke Mingyu pursed his lips, bowed, then walked off without making any small talk.</p><br/><p>Chen Mian looked at Ning Xi, then suddenly asked profoundly, \"Do you know how I discovered him?\"</p><br/><p>\"How?\" Ning Xi asked.</p><br/><p>\"He is not from the academy, he came up to me by himself. At that time, I had searched for a long time to no avail to find a suitable secondary male lead, so I let him try out. However, he rejected my offer.\"</p><br/><p>\"Huh? Didn't he come up to you himself? Why did he reject you?\" Ning Xi could not understand.</p><br/><p>\"He wanted to be the male lead.\"</p><br/><p>\"Uhh...\" To be frank, his image was definitely not suitable for the male lead in this movie. \"Did you manage to persuade him after?\"</p><br/><p>Chen Mian nodded. \"I let him try a part of the male lead's scenes first, but his image just couldn't fit, so I advised him to try for the secondary lead. He didn't agree, so later I had to invite him personally.\"</p><br/><p>Ning Xi was a little surprised. \"Hmm, to let Director Chen personally invite him...it must not be as simple as getting through with just acting skills.\"</p><br/><p>Chen Mian smiled mysteriously. \"You'll find out later on!\"</p><br/><p>Since Chen Mian had put it that way, Ning Xi did not ask further, but she suddenly thought of something. \"Oh, Director Chen, are visits allowed? I have a friend who wants to come over and watch me work. I'll make sure the shoot definitely won't be affected!\"</p><br/><p>\"Sure, if it's your friend, then there definitely won't be a problem!\" Chen Mian agreed rather easily.</p><br/><p>As the two spoke, Chen Mian saw another silhouette peeking from not too far away; it turned out that there were more who had stayed back.</p><br/><p>Chen Mian looked helplessly at Ji Yumeng's direction and asked, \"Here for Ning Xi too?\"</p><br/><p>Ji Yumeng nodded.</p><br/><p>\"Sigh, go on! I won't disturb you lot!\" Usually, actors would look for the director to chat after work, but this time, they were all here for the female lead...</p><br/><p>\"Yumeng, work's over, aren't you leaving yet?\" Ning Xi's tone obviously softened significantly when she spoke to Ji Yumeng.</p><br/><p>That lowered tone...</p><br/><p>Ji Yumeng subconsciously pinched her softened ears, \"Senior, may I have your phone number?\"</p><br/>\n</div>"}