{"title": "Chapter 911: I'm Going To Steal A Wife!", "id": 911, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-911-im-going-to-steal-a-wife", "volume_title": "Volume 10", "body": "<h1>Chapter 911: I'm Going To Steal A Wife!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 911: I'm Going To Steal A Wife!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the game, [Piercing Wind: Requesting for Glory of Light's coordinates.]</p><br/><p>Ning Xi clicked on the keyboard and released this message to the world.</p><br/><p>The world: [Oh! The Master has actually appeared! It's a group photo of the forces! Master, Master, I want to give birth to monkeys for you!]</p><br/><p>[Hey, do you want to die? Piercing Wind has a wife!]</p><br/><p>[So what? Can't I be the Master's concubine?]</p><br/><p>[Haha, you should see who Piercing Wind's wife is. How dare you touch Fallen Bloom's husband?]</p><br/><p>[What wife? The Master didn't marry her!]</p><br/><p>...</p><br/><p>That was right. Ning Xi's game account username was a man's profile. Because her attack score was top of the game and she led the leaderboard all year round, she was publicly known as all the female players' number one marriage choice.</p><br/><p>The \"wife\" they were talking about was Jiang Muye. Jiang Muye had been tricked by Ning Xi back then and had played using a female profile with the ID Fallen Bloom.</p><br/><p>Because the two always appeared together and bevause Jiang Muye was Ning Xi's only good friend in the game, the outside world had always thought of them as a pair.</p><br/><p>When someone sent Ning Xi Zhuang Rongguang's coordinates, Ning Xi immediately rushed to her destination.</p><br/><p>At that moment, some good friends in the game had offered a voice note invitation.</p><br/><p>Ning Xi looked at the pop-up box and clicked to listen.</p><br/><p>Then, Jiang Muye's voice could be heard. \"Yo! You punk, you're finally online! What are you going to the matchmaker's shrine for? Quick, let's battle!\"</p><br/><p>\"Don't disturb me, I have serious matters to settle!\"</p><br/><p>\"What serious matters would you have at the matchmaker's shrine?\"</p><br/><p>\"Huh...?\" On the other end of the phone, Ning Xi laughed sinisterly, then replied, \"I'm going to steal a wife!\"</p><br/><p>\"What...???\" Jiang Muye almost choked on his saliva. \"What did you just say?\"</p><br/><p>She had not been online in forever and the first thing she wanted to do was snatch a woman?</p><br/><p>Pfft...was this not cheating on him?</p><br/><p>After all, everyone in the game thought that he was a pair with Ning Xi...</p><br/><p>When she thought about how Zhuang Keer was still waiting at the Internet cafè late at night, Ning Xi did not spend anymore time talking to Jiang Muye. She immediately summoned her flying horse and rode to the matchmaker's shrine, making it in time with Zhuang Rongguang's group.</p><br/><p>This game had been made quite realistically. The wedding set was red all around with streaks of blooms, and it looked aesthetically pleasing to the eye.</p><br/><p>A male player riding on a high horse with the ID \"Glory of Light\" above his head led the bride escort troop. Behind him was a sedan with the pride and the people on the side were high profile players; they were all famous people on the leaderboard, if not faction leaders themselves.</p><br/><p>The troop was walking when sudden, the reverberating sound of a dragon's groan was heard from the sky. That was the cry of hatred from the only dragon-style flying mount in the game.</p><br/><p>When they heard the dragon's cry, all the players knew that the number one master of the game, Piercing Wind, had arrived!</p><br/><p>At that moment, Zhuag Rongguang, who was sitting before the computer in the Internet cafè, immediately stared at the man who had arrived from the sky with his shining eyes, looking very delighted.</p><br/><p>Pfft, I'm so cool! I'm just getting married and even Piercing Wind is here to attend the wedding!</p><br/><p>Beside him, Zhuang Rongguang's scoundrel friends exclaimed in admiration too, \"Whoa! This is the dragon! I'm seeing it for the first time! Way cool!\"</p><br/><p>\"I heard that you have to win a hundred battles in a row before you can redeem it! Only Piercing Wind has achieved this in the entire country!\"</p><br/><p>\"But why did he suddenly come?\"</p><br/><p>\"What's so weird about that? I am, after all, the leader of the number one faction!\"</p><br/><p>The moment Zhuang Rongguang said this, his friends suddenly stared at the screen and then turned pale before crying out in alarm, \"Jesus! Rongguang! Quickly run!\"</p><br/><p>\"What is it? What's the big fuss about?\" Zhuang Ronggguang looked over at the screen, then found himself dumbfounded.</p><br/><p>The entire screen was blood red.</p><br/><p>Piercing Wind had unexpectedly turned his massacre mode on him...</p><br/>\n</div>"}