{"title": "Chapter 945: Cute Little Expression", "id": 945, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-945-cute-little-expression", "volume_title": "Volume 10", "body": "<h1>Chapter 945: Cute Little Expression</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 945: Cute Little Expression</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What kidnapping? This is my godson!\" Ning Xi insisted.</p><br/><p>Chen Mian looked at little bun again and again, his eyes burning brighter by the second. \"This kid looks great! Is he interested in joining our industry?\"</p><br/><p>Ning Xi’s mouth twitched irritatedly. \"He’s only five years old, alright?\"</p><br/><p>\"So what if he’s five!? You've got to start them early! Let me handle him and I’ll make sure that he gets famous!\" Chen Mian sounded really excited. \"His aura, his eyes, and even his nose...I can confirm that he’ll definitely be handsome when he's all grown up as well!\"</p><br/><p>\"No, thank you!\" Of course, he was going to be handsome! Just look at his father.</p><br/><p>\"Are you sure? Do you have his parents' contact? I’ll talk to them!\" Chen Mian was persistent.</p><br/><p>\"You don’t have to, I’m making the calls for him. He still needs to study! Director, stop trying to interfere in his life,\"</p><br/><p>\"You little brat, you have no idea how many kids I’ve rejected…\"</p><br/><p>…</p><br/><p>Chen Mian left regretfully after being rejected by Ning Xi.</p><br/><p>The moment he left, a crowd gathered around them. \"Wow! This kid is so cute!\"</p><br/><p>\"Right! Isn't he?\" Ning Xi was proud of the little bun.</p><br/><p>\"Terribly! No wonder the director was so interested!\"</p><br/><p>\"I’d love to hug him!\"</p><br/><p>Little Treasure was looking around but the moment he heard that he was going to be hugged like a soft toy, he clung onto his mother and buried his face in her neck just like a mole rat.</p><br/><p>Ning Xi patted his back and smiled. \"I’m sorry, he’s a little shy and doesn’t like to talk.\"</p><br/><p>\"Oh, he’s cute being shy as well. Look at his expression! I’ve actually decided not to have kids in the future but if my kid is this cute, I’d be willing to have one!\" Ji Yumeng’s heart melted.</p><br/><p>Qi Fang was frustrated as more people surrounded Ning Xi…</p><br/><p>First, there was Jiang Muye, then came Zhuang Keer, and today there was this super cute little kid. Just who was she?</p><br/><p>\"Oh, God! Why does she get all the good things in life?\"</p><br/><p>\"Showoff!\" Chen Hanchen sneered.</p><br/><p>Qi Fang went along, \"I know, right!?\"</p><br/><p>Qi Fang glanced at Ke Mingyu and was hoping that he could join their fray but ever since he had helped Ning Xi once, Qi Fang decided to expel him out of the three musketeers; well, it was not like he was truly ever in it…</p><br/><p>Although Ning Xi would have liked to stay with the little bun for a while longer, her next scene was starting soon, so she quickly kissed the little bun. \"I’m going to prepare for work, Wait for me here, alright?\"</p><br/><p>The little bun was holding a big bunch of snacks that the crew had given him and he nodded.</p><br/><p>\"Xiao Tao, please help me look after him.\"</p><br/><p>\"Alright, Bro Xi, go now!\" Xiao Tao happily accepted her newly assigned mission.</p><br/><p>It felt like Bro Xi was really gentle with the little kid as if she was his real mother…</p><br/><p>A while after Ning Xi had gone into the dressing room, the little bun who was sitting on the chair suddenly focused on one direction.</p><br/><p>He was looking at...Ke Mingyu.</p><br/><p>The little bun stared at him for some time, looked down, then continued staring at him like he was confused. He tilted his head to the side and frowned.</p><br/><p>\"Little Treasure, what’s wrong?\" Xiao Tao’s heart melted looking at his cute expression.</p><br/><p>The little bun blinked and suddenly jumped down from the chair, running towards Ke Mingyu…</p><br/>\n</div>"}