{"title": "Chapter 950: When Will You Marry Me?", "id": 950, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-950-when-will-you-marry-me", "volume_title": "Volume 10", "body": "<h1>Chapter 950: When Will You Marry Me?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 950: When Will You Marry Me?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The storm had passed…</p><br/><p>As Lu Tingxiao was kissing the girl, his nervous, floating heart came back to him.</p><br/><p>Ning Xi tilted her head and looked at him impressively. \"Lu Tingxiao, I never knew that you could act so well. I almost lost my job to you!\"</p><br/><p>\"I’ve got a great teacher to thank,\" Lu Tingxiao replied.</p><br/><p>\"You even have a teacher!? Who is it? How do I not know about it?\" Ning Xi asked curiously.</p><br/><p>\"You.\"</p><br/><p>\"Me?\"</p><br/><p>\"I read through all the books and notes that you left with me,\" Lu Tingxiao said.</p><br/><p>Ning Xi was utterly speechless at this point.</p><br/><p>From learning about acting techniques to preparing the mask he donned every day, there were so many things to be done. It would take at least a few months to do all of that…</p><br/><p>Lu Tingxiao had probably started working on it the moment he got back from Philadelphia.</p><br/><p>She fully understood how busy he was. Almost every case he worked on was worth more than a few hundred million of dollars, yet he had allocated so much time for this just to have some time to be with her. He even had to be afraid of getting her angry, so he hid what he was up to.</p><br/><p>Her career was despised by the upper-class society, yet he was willing to be with her, to understand her better and to protect her.</p><br/><p>\"No one...no one has ever treated me this well before…\" Ning Xi hugged the man. \"Mmm...I almost want to marry you right away!\"</p><br/><p>\"The Civil Administration Bureau has probably closed at this time already but I can call them to come back or maybe have them bring the necessary documents to my house,\" the man replied quickly.</p><br/><p>\"Haha, stop messing around!\" Ning Xi laughed.</p><br/><p>Lu Tingxiao sighed, then he rested his head on the girl’s shoulder. \"Ning Xi, we just got into a relationship not too long ago and this might be too sudden but I’ve always been thinking about this every single second of the day...When will you...marry me?\"</p><br/><p>Ning Xi looked at him quietly, then with a serious tone she replied, \"When I can stand by your side.\"</p><br/><p>…</p><br/><p>In the car, Ning Xi was driving and at the back was Lu Tingxiao and Little Treasure.</p><br/><p>Lu Tingxiao had not removed his mask and he still had Ke Mingyu’s face on, so the little guy kept on staring at him and he extended his hand to the face again.</p><br/><p>Lu Tingxiao went closer to him and let him touch it.</p><br/><p>The little bun touched and felt his face, curious about new things.</p><br/><p>As Ning Xi observed the both of them from the rearview mirror, she said, \"Lu Tingxiao, do you think Little Treasure has some special abilities? He could recognize us no matter how we change our looks!\"</p><br/><p>Lu Tingxiao thought about it but was not surprised. He realized long ago that his son possessed such ability. Some people had their own unique way of observing. Often times, they could see little things that were overlooked by others.</p><br/><p>\"I’m not sure how to explain this but it's probably something like a dog’s sense of smell. He can detect something others can’t.\"</p><br/><p>\"How could you compare our son to a dog?! Oh...I have another question, why don’t you make a better looking mask? I heard from the director that you’re supposed to be the male lead, but your image didn’t fit what he had in mind so you became the secondary lead!\" </p><br/><p>Lu Tingxiao replied, \"I’m too good-looking already.\"</p><br/><p>Ning Xi was speechless.</p><br/>\n</div>"}