{"title": "Chapter 957: Thank Little Treasure For Me", "id": 957, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-957-thank-little-treasure-for-me", "volume_title": "Volume 10", "body": "<h1>Chapter 957: Thank Little Treasure For Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 957: Thank Little Treasure For Me</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Annie...Annie? What are you thinking?\" Ning Xi waved in front of Annie's eyes.</p><br/><p>\"Bro Xi, is that really Lu Tingxiao? Why does he look human!? I mean, he actually looks gentle!\"</p><br/><p>Human?</p><br/><p>Ning Xi laughed. \"Of course he is! What else do you think he would be?\"</p><br/><p>\"I...I thought he's really scary!\"</p><br/><p>Ning Xi gave it some thought. \"Hmm, technically, he does have a scary side of him but he's usually very gentle towards me and Little Treasure. I also thought he was scary when I first knew him and I even gave him a nickname called 'The Devil'!\"</p><br/><p>Annie suddenly understood why Ning Xi would be in a relationship with Lu Tingxiao.</p><br/><p>A man like him who gave all his love to her…</p><br/><p>She thought that maybe Bro Xi was treating Lu Tingxiao like how she treated all her exes but now she was sure that it was not that simple. It seemed that she was serious about it this time.</p><br/><p>Suddenly, Ning Xi's phone rang.</p><br/><p>\"Sorry, I'll answer this phone call first!\"</p><br/><p>\"Mmm, it's alright!\" Annie replied.</p><br/><p>It was a phone call from Qiao Weilan, so it should be the studio. Ning Xi picked up quickly, \"Hello, Director Qiao?\"</p><br/><p>\"The nine sets of outfits have been delivered and I've sent the name list to your email. Please take a look at them.\" As usual, Qiao Weilan kept her message short and professional.</p><br/><p>\"Alright, I'll check in a little while. Thank you for your hard work!\"</p><br/><p>\"The effect of this campaign should take place the soonest in around half a month. We just have to wait. During this period of time, I wonder if we could touch up our studio a little since it's not just our workplace but also our meeting place with the clients.\"</p><br/><p>\"Thank you for reminding me. I'll talk to Momo about it later. It should be no problem leaving the designs to Shangze, I'll take care of the funding…\"</p><br/><p>…</p><br/><p>Annie looked on silently as Ning Xi was talking on the phone. Aside from the Bro Xi at home, she was seeing another side of Bro Xi, the working Bro Xi.</p><br/><p>Each side came as a surprise to her.</p><br/><p>The Tang Xi she knew was wild but had an aura of loneliness around her as if she did not care about anything anymore, not even her own life. However, now she was shining…</p><br/><p>Soon, Ning Xi finished her phone call and Lu Tingxiao came out of the room after Little Treasure had fallen asleep. He held a small brown teddy bear in his hand.</p><br/><p>\"Has Little Treasure slept?\" Ning Xi asked.</p><br/><p>\"Mmm.\"</p><br/><p>Lu Tingxiao nodded and went up to Annie, then he gave her the teddy bear. \"Ms. Annie, this is Little Treasure's gift to you.\"</p><br/><p>\"Wow! A gift! How cute!\" Annie was surprised and hugged it to her chest. \"Thank you, help me to thank Little Treasure!\"</p><br/><p>Her impression towards Lu Tingxiao had definitely changed. Someone who had raised such a cute Little Treasure must be really great as well…</p><br/><p>\"Are you studying herbs and medicine, Ms. Annie?\" Lu Tingxiao suddenly asked.</p><br/><p>\"How do you know?\" Annie was shocked.</p><br/><p>\"I saw the pill you gave Little Treasure just now,\" Lu Tingxiao said.</p><br/>\n</div>"}