{"title": "Chapter 956: A Totally Different Lu Tingxiao", "id": 956, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-956-a-totally-different-lu-tingxiao", "volume_title": "Volume 10", "body": "<h1>Chapter 956: A Totally Different Lu Tingxiao</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 956: A Totally Different Lu Tingxiao</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Annie was enraged. \"He…\"</p><br/><p>\"This man’s private life is so complicated! He doesn’t even know who’s the real mother of his own child…?!\" Annie lowered her voice out of consideration for Little Treasure.</p><br/><p>Ning Xi knew what she wanted to say. \"It’s not what you think. He’s actually a victim in this matter.\"</p><br/><p>Annie did not believe it. She thought that Ning Xi had been lied to…</p><br/><p>How could such a cute child have such a monstrous father?</p><br/><p>She could not imagine how Little Treasure and Bro Xi could live under Lu Tingxiao’s tyranny and how much suffering they were going to endure.</p><br/><p>Ning Xi sighed at Annie’s worried expression. What was this girl thinking about again?</p><br/><p>Maybe that guy made her drink something weird. Otherwise , wh y would she always be this worrisome?</p><br/><p>As both of them were chatting, the door to the study room opened and Lu Tingxiao came out of the room.</p><br/><p>Ning Xi turned around. \"Lu Tingxiao, are you done with your stuff? Are we bothering you?\"</p><br/><p>Who? Who?! Lu Tingxiao!?</p><br/><p>Annie looked at the study room as well. She then saw a tall man who was dressed in the same pajamas style as Ning Xi. The man wore a pair of glasses and had a mug of coffee in his hand, looking relaxed and very family-oriented. There was no sign of any violence or tyranny as the rumor went. He looked just like a typical husband, not like a demon. Just a normal man who looked a little above average.</p><br/><p>\"And this is?\" Lu Tingxiao looked at Annie questioningly.</p><br/><p>Ning Xi went over and clung on Lu Tingxiao’s arms as she introduced, \"This is my good friend from America, Annie. Annie, this is my boyfriend, Lu Tingxiao.\"</p><br/><p>\"Hello.\" Lu Tingxiao nodded. He did not look very welcoming but he was polite.</p><br/><p>\"H-hello…\" In Annie’s impression, Lu Tingxiao was a violent tyrant, even a monster, so she could not relate humanity to him.</p><br/><p>Lu Tingxiao looked at his sleepy son, then he went over and carried him. \"Little Treasure looks sleepy, I’ll put him to bed first.\"</p><br/><p>He knew that both of them must have a lot to talk about, so he was being considerate of them.</p><br/><p>The little bun did not seem very happy and he extended his hand to Ning Xi while resting his head on Lu Tingxiao’s shoulder. He did not want to sleep yet.</p><br/><p>Lu Tingxiao patted his son’s head. \"It’s late already, don’t be naughty now. Your mother hasn’t seen Aunty Annie for a long time and they must have a lot to talk about.\"</p><br/><p>The little bun nodded and yawned.</p><br/><p>Your mother and Aunty Annie...he said it so naturally. What a kind and loving attitude this guy had towards his son!</p><br/><p>Annie was dumbfounded. This was very different from the Lu Tingxiao she heard of!</p><br/><p>What had gone wrong?</p><br/>\n</div>"}