{"title": "Chapter 955: He Is Lu Tingxiao's and Yours?", "id": 955, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-955-he-is-lu-tingxiaos-and-yours", "volume_title": "Volume 10", "body": "<h1>Chapter 955: He Is Lu Tingxiao's and Yours?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 955: He Is Lu Tingxiao's and Yours?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Feeling the cotton-candy-like hands hugging her, Annie’s heart melted as she looked into the little guy’s beautiful eyes which seemed like the stars in the sky.</p><br/><p>She could not believe it. \"Bro Xi...are you lying to me? Is...this really Lu Tingxiao’s son? Are you sure?\"</p><br/><p>Ning Xi nodded proudly. \"A hundred percent! He’s definitely Lu Tingxiao’s son and he’s called Little Treasure. What do you think? I’ve not been lying, he’s really cute, isn't he?\"</p><br/><p>Annie nodded her head vigorously. \"Way too cute! What should I do!? I didn’t prepare any gifts for you!\"</p><br/><p>Annie was looking around at herself and in her bag. Then, she took out some candy, a chocolate bar, a pill, and even her necklace and gave them all to the little bun.</p><br/><p>Her attitude…had changed entirely.</p><br/><p>Just a minute ago, she was still saying how miserable being a stepmother could be and how terrible a stepson might turn out.</p><br/><p>Ning Xi put aside the candy and chocolate bar for the little bun, then gently returned the necklace and the pill. \"These are too valuable. Take it back, he doesn’t have any use for them anyway.\"</p><br/><p>\"You’re right...Lu Tingxiao’s so rich…\" Annie carefully took back her necklace, then she gave Ning Xi the red pill. \"Keep this, it’s my latest invention. The contents can cure almost any poison! I’ve tested it personally.\"</p><br/><p>Ning Xi smiled. \"Then, I thank you on behalf on Little Treasure!\"</p><br/><p>\"Next time...if there’s a next time, I’ll prepare something better! I was in a haste this time, so I didn’t expect to see Little Treasure as well!\" Annie said.</p><br/><p>Annie had totally forgotten about her rambling about being a miserable stepmother now. She could never mention it in front of such a cute creature!</p><br/><p>Such a cute child...no wonder Bro Xi liked him!</p><br/><p>Ning Xi and Annie sat back on the sofa with the little bun in between them. He was curiously studying the pill.</p><br/><p>\"This is unbelievable. How could Lu Tingxiao’s son be this cute?\" Annie still could not get over it. \"Although he does look a little like him, this is so illogical…\"</p><br/><p>Annie suddenly looked at Ning Xi. \"Bro Xi! Is this kid Lu Tingxiao's and yours?\"</p><br/><p>Ning Xi’s mouth twitched in amusement. \"My dear, you’re overthinking this!\"</p><br/><p>Hmm? Father and Mother?</p><br/><p>The little bun had a wide smile on his face when he heard their conversation.</p><br/><p>\"Well…\" Annie saw the little bun’s smile and was suspicious. \"Actually, looking carefully, the both of you look very similar!\"</p><br/><p>\"Really? Which part?\" Ning Xi raised her eyebrows.</p><br/><p>Annie nodded. \"Yes, you do! Maybe you haven’t noticed but when he smiled just now, he really looks like you! Especially the eyes!\"</p><br/><p>Annie suddenly thought of a key question. \"Um...who’s the mother of this child?\"</p><br/><p>Ning Xi shrugged. \"I’m not sure because Lu Tingxiao himself doesn’t know either.</p><br/>\n</div>"}