{"title": "Chapter 966: We Meet Again", "id": 966, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-966-we-meet-again", "volume_title": "Volume 10", "body": "<h1>Chapter 966: We Meet Again</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 966: We Meet Again</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Qiao Weilan was worried that Ning Xi was overconfident about Lu Xinyan's identity, so she explained to her why she did not prioritize her as a candidate.</p><br/><p>Ning Xi smiled mysteriously. \"What a coincidence, I didn't want to work with this person before too.\"</p><br/><p>\"Boss, Boss! The branch is running dry. We need to reallocate some stock from the main store!\" Han Momo ran to her, panting with one hand holding her phone.</p><br/><p>\"How many do we roughly need?\" Ning Xi asked.</p><br/><p>Han Momo handed over the form in her hand and said, \"52 in total!\"</p><br/><p>In comparison to Spirit's bespoke line's vintage magnificence and outstanding design, Spirit's ready-made line was not that far off in terms of quality. From the design to the materials, they had all gone through tight quality checks and they had strictly limited the number of garments in the same design to avoid their clothes being too common, hence their sales numbers were pretty good.</p><br/><p>\"So many...\" Ning Xi looked at the form and noticed that most of them were the more expensive designs which came up to a considerable amount. Most of the current employees were newly hired but she could not simply let anyone do it. \"I got it, coincidentally I'm free now, I'll personally reallocate the main store's stock!\"</p><br/><p>...</p><br/><p>Spirit's main store had opened in central Imperial's largest premium outlet.</p><br/><p>Not too long ago, Ning Xi had met up with Zhuang Keer to shop here the last time. She had even sighed in sorrow when she dropped by History's flagship store.</p><br/><p>Who would have thought that today, her own shop too could sit in this golden triangle?</p><br/><p>Ning Xi had called the main store first, informing them that she would be over to transfer the stock personally and had them get the stock ready beforehand. Then, she got her chauffeur and made her way to the premium outlet.</p><br/><p>When she reached the premium outlet, Ning Xi was walking towards the store when she unexpectedly bumped into some familiar faces in the elevator.</p><br/><p>Inside the lift, Guan Ziyao was intimately holding onto the arm of a noble and elegant woman. She was smiling as she spoke to her. An adorable and lovable girl beside the woman was also chatting away happily.</p><br/><p>It was Guan Ziyao, Yan Ruyi, and Lu Xinyan...</p><br/><p>Upon realizing who it was in the elevator, Ning Xi had already stepped in and the door automatically closed behind her.</p><br/><p>At the same time, when all three of them saw Ning Xi in the lift, they were stunned and it became awkward.</p><br/><p>\"Miss Ning, what a coincidence, we meet again!\" The first person to speak was Guan Ziyao.</p><br/><p>Guan Ziyao wore a composed champagne Prada dress, which was one of their latest designs. Her outfit was easily worth a few hundred thousand dollars; a Louis Vuitton bag hung on her arm and flawless pearls decorated her neck and wrist while her posture was calm and graceful as if she did not bear any hostility and grudges against the person before her.</p><br/><p>After Yan Ruyi's temporary shock, she evaluated Ning Xi and did not say anything.</p><br/><p>\"Miss Guan, Miss Lu, Madam Lu.\" Ning Xi only nodded slightly and considered her greetings courteous enough, then she stood quietly aside without any intention of making small talk.</p><br/><p>\"How unlucky! We were shopping so happily. How did we bump into this woman...?\" Lu Xinyan gently took Yan Ruyi's arm and looked clearly upset.</p><br/><p>When she heard Lu Xinyan mumbling, Ning Xi subconsciously took a second look at her. When she had a clear look of the outfit on her, a slight surprise flashed across her eyes.</p><br/><p>The floral and bird patterned dress in the style of calligraphy ink on Lu Xinyan was clearly from Spirit's bespoke line. Ning Xi had seen it in Gong Shangze's design drafts and she had a memorable impression of it.</p><br/><p>However, this naturally was not one of those that Qiao Weilan had given out because Lu Xinyan was not on the name list. She had probably pre-ordered it when the studio released the news of being out of stock.</p><br/>\n</div>"}