{"title": "Chapter 964: One Step Closer To Making Big Boss My Wife", "id": 964, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-964-one-step-closer-to-making-big-boss-my-wife", "volume_title": "Volume 10", "body": "<h1>Chapter 964: One Step Closer To Making Big Boss My Wife</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 964: One Step Closer To Making Big Boss My Wife</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After dinner, Ning Xi suddenly remembered something very important and quickly looked at her baby Little Treasure. \"Oh, Little Treasure, there's something I need your help with! Can you help Mommy write some calligraphy?\"</p><br/><p>He could certainly help Mommy, so Little Treasure nodded happily.</p><br/><p>In the study room, Ning Xi had prepared a calligraphy brush, some ink, and paper, then she started to grind the block of ink.</p><br/><p>Because Little Treasure could not reach the top of the desk, Lu Tingxiao had lifted him atop a stool.</p><br/><p>Little Treasure tilted his head, asking his Mommy what she wanted him to write.</p><br/><p>Ning Xi thought about it, then said, \"Help me write...'How can the goldfish be a person of no particular talent? It transforms into a dragon with trials and hardships; the dragon can cry to the ninth heavens and call for change, and the tables will turn and opportunities will abound!\"</p><br/><p>Little Treasure nodded, then picked up the brush and started to write.</p><br/><p>Throughout this period of time, Little Treasure had not fallen behind in his training. The healthier he was, the more stable and energetically he could control the brush. It glided through the paper like a swimming dragon, complemented by these words that were penetratingly powerful...</p><br/><p>\"My baby is becoming more and more amazing!\" praised Ning Xi.</p><br/><p>Lu Tingxiao looked at her and asked, \"Are you presenting this to someone?\"</p><br/><p>Ning Xi was suddenly shocked. \"Big Boss, how did you know?\"</p><br/><p>\"To who?\" Lu Tingxiao asked.</p><br/><p>\"Mmm, I want to give it to Gong Shangze. What do you think? Don't these words suit him very well?\" Ning Xi beamed with happiness but she did not get Lu Tingxiao's answer. She turned to look and indeed, someone was jealous again.</p><br/><p>\"Pfft, you jealous?\" Ning Xi propped up her arms and leaned her head over to peer at him.</p><br/><p>Lu Tingxiao looked at her with a poker face. \"Where's mine?\"</p><br/><p>When she saw Lu Tingxiao's child-like manner of asking for a present, Ning Xi found him extremely adorable and could not help but lean over and kiss him. \"Will this do?\"</p><br/><p>He gave a dissatisfied look, showing that it was barely satisfactory but just as he was about to continue, a public service announcement suddenly slid in between them.</p><br/><p>Little Treasure held up a piece of paper with the announcement with a serious face. On the paper, he had written a few words in huge fonts: [Baby is angry!]</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>Ning Xi was dying of laughter. She quickly kissed the little bun on his cheek to compensate. \"I'm sorry! Baby, please don't be angry!\"</p><br/><p>The little bun was satisfied, then he picked up his personal stamp and continued to work.</p><br/><p>...</p><br/><p>Late at night, the moon was clear and bright while the night was cold.</p><br/><p>Because Ning Xi had had a few drinks, she stayed over at his bungalow.</p><br/><p>In the dead of the night, Lu Tingxiao felt something amiss, so he pulled away from his blanket and got up.</p><br/><p>He pushed through the door to Ning Xi's room lightly and found no one inside; neither was she in Little Treasure's room.</p><br/><p>As he anxiously wondered where she could be, the moonlight shone through the window and he saw a shadow in the garden.</p><br/><p>Lu Tingxiao reflexively took the blanket from his bed and rushed downstairs.</p><br/><p>The night breeze caressed his skin while the leaves on the trees rustled gently. Under the moon light, Lu Tingxiao saw from afar that the girl sat on a swing with a can of beer in her hand.</p><br/><p>\"It's late. Why aren't you asleep?\" Lu Tingxiao rushed over and put the blanket over her, then touched her hands to see if they were cold.</p><br/><p>\"Big Boss!\" When she saw who it was, Ning Xi immediately clung to him like a koala, her head nuzzled in the space of his neck. \"I'm happy! So happy that I can't sleep!\"</p><br/><p>\"Are you that happy?\" Lu Tingxiao stroked the girl's head.</p><br/><p>Ning Xi nodded, then said with a serious expression, \"Of course I'm happy! I'm one step closer to the day that I can take the Big Boss as my wife!\"</p><br/><p>Lu Tingxiao was obviously stunned when he heard this. He cleared his throat and said with a calm demeanor, \"Mmm, you should be happy about it.\"</p><br/>\n</div>"}