{"title": "Chapter 973: Their Boss Is Ning Xi?!", "id": 973, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-973-their-boss-is-ning-xi", "volume_title": "Volume 10", "body": "<h1>Chapter 973: Their Boss Is Ning Xi?!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 973: Their Boss Is Ning Xi?!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When the manager heard that, he quickly skimmed the store but did not immediately see her. \"The boss said she's already here. Let me make a call to ask...ah! Boss! You're here!\"</p><br/><p>The manager, who was about to make a call, put down his phone and looked at Ning Xi who walking towards their direction from the rest corner. She quickly said, \"Boss, all the stock you need has been moved out. Please check it. Oh, and Miss Lu here seems to have something to discuss with you!\"</p><br/><p>The manager then introduced Lu Xinyan, \"Miss Lu, this is our boss. If you have anything, you may speak to her directly.\"</p><br/><p>What?!</p><br/><p>The moment the manager said that, not only Lu Xinyan but Guan Ziyao and Yan Ruyi were all taken aback.</p><br/><p>What did the manager mean?</p><br/><p>Their boss was...Ning Xi?</p><br/><p>\"No...wait...manager, what did you say? You mean this woman is your boss?\"</p><br/><p>\"Yes...\" When the manager saw Lu Xinyan's shocked expression, he thought that it was because she was shocked that Ning Xi was so young and beautiful.</p><br/><p>To be honest, the first time she had met her female boss, she was blown away by her age and beauty too!</p><br/><p>The manager smiled and explained, \"Our boss is usually very low key, plus she's quite a busy woman, so very few people have seen her. Miss Lu, you've come at a good time. Coincidentally, our boss came over to the flagship store to reallocate some stock, or else, we usually don't see the boss herself either!\"</p><br/><p>Ning Xi was Spirit's owner!</p><br/><p>The reason why she had walked into the store and sat there without leaving was because she was waiting for the stock to be prepared...</p><br/><p>When she heard the manager's words, Lu Xinyan's face turned a pale green hue.</p><br/><p>Initially, Yan Ruyi had thought that Ning Xi was here for her. Now, she looked incredibly awkward but she was more surprised.</p><br/><p>Who'd expect that this shop I thought was not bad would actually be owned by this woman?</p><br/><p>Guan Ziyao frowned, suddenly thinking of a minor detail. Earlier, she had heard Ning Xi mention \"Mister Mo\" on the phone. Could she have been on the phone with Mo Lingtian earlier?</p><br/><p>No wonder even Mo Lingtian could not get the other party to turn a blind eye to the rules. Spirit's owner was this woman...</p><br/><p>She was alert but she would never have thought that this would be the outcome!</p><br/><p>\"Who would've thought? Miss Ning is actually Spirit's boss. Young and promising indeed!\" Guan Ziyao exclaimed.</p><br/><p>\"Miss Guan, you're very kind. Please continue to take your time to browse. As for Miss Lu's request, I believe Director Qiao has already made it very clear to her,\" concluded Ning Xi.</p><br/><p>Ning Xi then left to continue her work. All of a sudden, from behind her, she heard Lu Xinyan scream, \"Ning Xi, stop right there! It was you! You intentionally stopped me from that retail opportunity, didn't you?! This is obviously your way of public payback for our private matters!\"</p><br/><p>Ning Xi did not want to say anything at first, but since so many employees were present, she had to say something.</p><br/><p>Thus, she turned around and said to Lu Xinyan, \"Miss Lu, I would like to ask you a question. If you didn't have the name Lu Tingxiao backing you, would anyone willingly work with you based on your highly unsuccessful career?\"</p><br/><p>If she did not have Lu Tingxiao's name backing her or the Lu family's background...</p><br/><p>\"I...\" Lu Xinyan was surprisingly at a loss for words to answer Ning Xi.</p><br/><p>\"Spirit has just only gotten on track. I'm sorry that I really can't leave it at your expense, Miss Lu.\"</p><br/>\n</div>"}