{"title": "Chapter 972: Our Boss Is Here To Reallocate The Stock", "id": 972, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-972-our-boss-is-here-to-reallocate-the-stock", "volume_title": "Volume 10", "body": "<h1>Chapter 972: Our Boss Is Here To Reallocate The Stock</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 972: Our Boss Is Here To Reallocate The Stock</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Because the storeroom was messy with a lot of boxes and stock around, the shop assistant that had gone to get outfits from the storeroom had gone for quite a while and not yet returned.</p><br/><p>Ning Xi continued to sit in the quiet rest area and she did not look like she was leaving.</p><br/><p>Lu Xinyan looked towards Ning Xi and instantly shifted the anger from her failure to get the retail opportunity onto her. She said unhappily, \"Sis Ziyao, Aunty, now do you believe that she's followed us here intentionally? Would anyone wait for this long someone else? Besides, there are so many other places...there's the milk tea shop, the coffee shop, the restaurant, yet of all places, why did she choose to sit here and wait?\"</p><br/><p>This time, even Guan Ziyao did not say anything.</p><br/><p>Her instincts told her that there was no way Ning Xi would use such a forceful way to get close to them but when she thought again, she felt that it could be possible.</p><br/><p>After all, for a woman of Ning Xi's level, any opportunity to ask for a favor or even wanting to get close the two elders of the Lu family was impossible. This time, she had unexpectedly bumped into them, so to seek for an opportunity to look good in front of Yan Ruyi was still quite understandable...</p><br/><p>However, Guan Ziyao did not know what she wanted to do next now that she had followed them here. After the lessons learned from previous encounters, Guan Ziyao tensed up and did not dare to take things easy.</p><br/><p>Lu Xinyan had a hot temper and at that moment, her patience threshold had reached its limit. She walked quickly to Ning Xi and said, \"You there, are you done? Are you addicted to following us? Does my cousin know how thick-skinned you are? You come to this store and not buy any clothes, yet you rightfully sit here and sleep, treating this place like your home! Can your skin not be so thick?!\"</p><br/><p>Ning Xi felt her head hurt by the surge in the noise level and she looked up coldly, \"Are you done talking?\"</p><br/><p>When she saw Ning Xi's arrogance, Lu Xinyan exploded and was ready to ditch her courteousness to scold her when suddenly a series of footsteps were heard from behind her...</p><br/><p>The first person to approach them was the shop assistant who had gone to get the clothes earlier. \"I'm sorry, I'm sorry. The storeroom was a little messy. Sorry I've made you wait for so long! Miss Lu, I've brought over all the outfits you wanted!\"</p><br/><p>Distracted, Lu Xinyan rushed off to look at the clothes.</p><br/><p>Behind the shop assistant was the flagship store manager that Lu Xinyan recognized. There were also several other male employees and every one of them was moving stacks of garments.</p><br/><p>\"Miss Lu, you're here! I'm really sorry as I'm really quite busy today. Our boss is here in-store to reallocate some stock, so I can't personally assist you. If there's anything you need, please just let Xiao Zhao know!\" greeted the manager courteously to indicate his regret.</p><br/><p>When Lu Xinyan heard him, she looked suspiciously at him.</p><br/><p>Spirit's boss?</p><br/><p>She had been in the store for quite a long time. How come she had not seen anyone who looked like the boss? There were only a few of customers who came in and went out, and all the shop assistants who were busy running around...</p><br/><p>The owner of Spirit seemed to be quite mysterious. When she was informed that she had not passed the retail audit process, she wanted to propose to meet up with the boss for a chat. In fact, she had continuously made a few calls, but the reply every time was that the boss was very busy, so she had not managed to meet up with the person until now.</p><br/><p>So, when she heard the manager's words, Lu Xinyan was quite curious and was quite interested to meet this owner.</p><br/><p>\"Manager, is the boss already in the store? Why didn't I see him or her? Coincidentally, there are some collaborations that I would like to discuss with your boss!\" Lu Xinyan told the manager.</p><br/>\n</div>"}