{"title": "Chapter 983: The Third Wheel", "id": 983, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-983-the-third-wheel", "volume_title": "Volume 10", "body": "<h1>Chapter 983: The Third Wheel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 983: The Third Wheel</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>On the other end of the phone, Mo Lingtian was silent for a while., \"Alright...I'll help you to ask him…\"</p><br/><p>\"Thank you, good night!\"</p><br/><p>\"Good night…\"</p><br/><p>After ending the call, Mo Lingtian flung his phone away and lit a cigarette. He lay on the sofa and smoked quietly.</p><br/><p>The atmosphere in the room was cold and silent.</p><br/><p>After some time, the man suddenly kicked the table in front of him. There was a loud crash. The living room turned into a mess and sparks flew out of the huge screen of the TV.</p><br/><p>Mo Lingtian's anger faded away sometime later. He took a deep breath and picked up his phone to call Lu Tingxiao.</p><br/><p>\"Hey, Lu Tingxiao, we're going camping tomorrow. Don't you dare tell me that you're unavailable! If not, I'll fight you right now!\" Mo Lingtian's voice sounded agitated.</p><br/><p>\"What's wrong?\" Lu Tingxiao asked in his usual flat tone.</p><br/><p>\"Nothing! Just come! If not, our friendship ends right here! That's all, bye!\" Mo Lingtian ended the call.</p><br/><p>The phone fell onto the floor and Mo Lingtian looked miserably at it. He slapped himself hard in the face. \"Mo Lingtian, just how long do you want to torture yourself…\"</p><br/><p>Nevertheless, he had no choice. There was no way that he could give up loving her.</p><br/><p>…</p><br/><p>Lu Tingxiao looked at his phone awkwardly.</p><br/><p>In the meantime, Ning Xi was busy emptying the pot of soup. Now she knew how dangerous this soup was! She had to quickly dispose of it!</p><br/><p>Suddenly, someone gave her a warm hug from behind.</p><br/><p>\"What?\" Ning Xi said in an annoyed tone.</p><br/><p>\"I'll bring you somewhere tomorrow to release your anger, alright?\" Lu Tingxiao asked.</p><br/><p>\"Huh? Release my anger? What do you mean?\" Ning Xi asked back.</p><br/><p>\"I just promised Mo Lingtian to go hiking tomorrow,\" Lu Tingxiao replied.</p><br/><p>\"Hiking?\" Was this related to her anger?</p><br/><p>Unless...Guan Ziyao was going as well…</p><br/><p>So, what Lu Tingxiao meant was that...he wanted to crush Guan Ziyao's hope once and for all with this opportunity?</p><br/><p>Ning Xi felt indifferent about it and she shrugged. \"Sure! Since we're taking a break from acting tomorrow, it's a good time to relax as well!\"</p><br/><p>Ning Xi excitedly suggested, \"Can we bring Little Treasure along too?\"</p><br/><p>Lu Tingxiao replied instantly, \"No.\"</p><br/><p>\"Why? Why not!?\" Ning Xi asked unhappily.</p><br/><p>\"He'll be the third wheel,\" Lu Tingxiao said.</p><br/><p>Ning Xi was speechless.</p><br/><p>Did he just call his son the third wheel?</p><br/><p>As they were talking, footsteps came from behind them.</p><br/><p>The little bun stared at his father unhappily, making it obvious that he had overheard their conversation.</p><br/><p>Ning Xi quickly picked up the little bun. \"Hey, little guy, why are you awake? Don't listen to your father's nonsense! He's the third wheel! The most annoying kind of third wheel! We're not bringing you because it's going to be tiring! I'll sleep with you tonight. Don't be angry, we'll ignore him.\"</p><br/><p>Ning Xi glared at Lu Tingxiao, then went upstairs with the little bun.</p><br/><p>Lu Tingxiao had no words.</p><br/><p>Third wheel indeed…</p><br/>\n</div>"}