{"title": "Chapter 988: Doting On Her To This Extent", "id": 988, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-988-doting-on-her-to-this-extent", "volume_title": "Volume 10", "body": "<h1>Chapter 988: Doting On Her To This Extent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 988: Doting On Her To This Extent</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I'm only telling you this because I still think of you as a friend. This is my final reminder. No matter if it's you or your father, please stop what you shouldn't be doing. Otherwise, I'll let you know what real cruelty is. That's all I want to say.\" Lu Tingxiao then walked away.</p><br/><p>Guan Ziyao felt her legs give way as exhaustion overcame her. She slumped onto the ground, her outfit soaked wet with her cold sweat…</p><br/><p>Yes, she knew! How could she not notice!? She just did not want to believe or accept it until Lu Tingxiao pointed out the obvious truth to her.</p><br/><p>\"Lu Tingxiao...Lu Tingxiao...how could you do this to me!?\" Guan Ziyao cried uncontrollably.</p><br/><p>There was a large tree just a few steps behind Guan Ziyao and Mo Lingtian was leaning against it in silence. He restrained himself even though he really wanted to comfort her. If he showed up now, it would only make her feel embarrassed. While he knew that he should not be eavesdropping, he could not help but follow when he saw Lu Tingxiao and Guan Ziyao talking to each other.</p><br/><p>Who would have known that things would have progressed this way?</p><br/><p>From their conversation, it was Ziyao or her father who had investigated Ning Xi, then took evidence of her cheating.</p><br/><p>So that was how Ziyao was so sure that both of them would break up…</p><br/><p>But in the end, even he was shocked.</p><br/><p>Lu Tingxiao was just...indescribable! He was doting on that woman to this extent!</p><br/><p>As for Lu Tingxiao's hurtful words, he looked at Guan Ziyao's painful expression. While he felt sorry for her, he understood that Lu Tingxiao had done it for her own good. He also understood that Lu Tingxiao was willing to let this matter off because of him as a friend.</p><br/><p>If Ziyao still did not learn her lesson…</p><br/><p>But would she really? She was such a smart and proud woman. Now that Lu Tingxiao had revealed everything to her, would she be willing to let him go?</p><br/><p>Mo Lingtian's uneasy heart had a selfish spark of hope within it…</p><br/><p>If Ziyao could give up on Lu Tingxiao, then maybe he would have a chance...</p><br/><p>…</p><br/><p>Ning Xi finished setting up the tent, then she saw Lu Tingxiao return. \"You're back!\"</p><br/><p>\"Mmm.\"</p><br/><p>\"Look at the tent I set up! Isn't it great? It's really solid!\" Ning Xi patted her tent proudly.</p><br/><p>Lu Tingxiao's expression darkened a little when he saw the girl's carefree attitude. \"Aren't you worried at all?\"</p><br/><p>\"You're really difficult, aren't you? Are you going to be angry at me for trusting you?\" Ning Xi said.</p><br/><p>Lu Tingxiao sighed. He knew that he could not beat her in an argument.</p><br/><p>\"I've explained everything to her already,\" Lu Tingxiao reported to his wife.</p><br/><p>Looking at Lu Tingxiao's expressionless face, Ning Xi almost giggled. She tiptoed and kissed him on the lips. \"Good boy, I'll give you a kiss!\"</p><br/><p>When they were assigning tents, it was only natural for Lu Tingxiao and Ning Xi to share one. Lu Xinyan was tentmates with Guan Ziyao, the newlyweds would share one, and the others split amongst themselves.</p><br/><p>Mo Lingtian was the only unfortunate one. Because they had odd numbers, one person would definitely be left out. Mo Lingtian never had a good temper to start with. In addition to his extra bad mood that day, no one wanted to share a tent with him, so he would be sleeping alone.</p><br/><p>It was going to be a sleepless night for many of them.</p><br/>\n</div>"}