{"title": "Chapter 994: You're A Monster!", "id": 994, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-994-youre-a-monster", "volume_title": "Volume 10", "body": "<h1>Chapter 994: You're A Monster!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 994: You're A Monster!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Ahhhhh, ghost!\"</p><br/><p>Instantly, all the girls' shrieks rose. Lu Xinyan even almost fainted as the blood drained from her face from fright. It was chaos.</p><br/><p>\"Hey...what ghost...?\" At that moment, there was another hand on the rock of the edge of the cliff. What followed next was a swoosh as a dark figure rolled over from the edge and fell on the ground before them...</p><br/><p>\"Wh-what is this?!\"</p><br/><p>\"What just crawled up? Ahhhhh!\"</p><br/><p>\"Jesus!\"</p><br/><p>\"It's...Ning Xi! It looks like Ning Xi! Aah!!!\"</p><br/><p>...</p><br/><p>Oh my God! What did they just see? Argh!</p><br/><p>Ning Xi!?</p><br/><p>It was really Ning Xi!</p><br/><p>What was happening?</p><br/><p>Could she have climbed back up by herself???</p><br/><p>Ning Xi's hair was in a mess and her white sports outfit was dirty beyond recognition. Underneath her fingers were a gritty mix of mud and moss. She was bending down and gasping for air. After she crawled up and caught her breath, the first thing she nervously asked them was, \"Hey...you didn't tell Lu Tingxiao, did you?\"</p><br/><p>As they watched this scene unfold, everyone looked as if they had seen a ghost.</p><br/><p>Lu Xinyan had forgotten about crying as she stood there, stunned, while Mo Lingtian had fallen to the ground looking dumbfounded...</p><br/><p>\"Hey, I'm asking you guys! Why are all of you looking so shocked?\" Ning Xi asked again.</p><br/><p>\"No! I haven't had the chance to tell him!\" Mo Lingtian answered blankly.</p><br/><p>\"Good...don't ever let him know about this...\" Ning Xi breathed a sigh of relief and sat back down.</p><br/><p>Jesus! She was really crazy!</p><br/><p>The first thing she said after crawling back from the brink of death was not \"Thank God I didn't die\" or crying and wailing; instead, she pleaded them not to tell Lu Tingxiao about this incident! Was she alright?</p><br/><p>Was Lu Tingxiao scarier than falling off a cliff?</p><br/><p>Mo Lingtian looked like he was having an anxiety attack. \"How did you get back up here?\"</p><br/><p>\"Duh, I climbed back up!\" Ning Xi answered sarcastically.</p><br/><p>Mo Lingtian questioned again, \"Climb? How did you do that?\"</p><br/><p>\"With my hands.\"</p><br/><p>Mo Lingtian painfully swallowed his saliva and said, \"Li-little bunny...no...heroine! How is your body even structured? Didn't you die?\"</p><br/><p>Ning Xi wiped off the sweat on her brow and rolled her eyes at Mo Lingtian. \"Have you never heard of the cliff-diving law of survival?\"</p><br/><p>Mo Lingtian's mouth twitched. \"I have, but this is my first time hearing of anyone climbing back up with bare hands. You're a monster!\"</p><br/><p>After everyone had regained their senses from their nervousness and shock, they started to ask Ning Xi one question after another.</p><br/><p>\"What actually happened? Xiao Xi, did you really climb back up by yourself? That's crazy magical!\"</p><br/><p>\"This doesn't make any scientific sense. Do you know lightweight kungfu?\"</p><br/><p>\"The last time I met you at the shooting range, I knew you weren't normal! You wouldn't have any special abilities, would you?\"</p><br/><p>\"I told you that Master Xiao has unique taste! Miss Ning is definitely not a normal person!\"</p><br/><p>...</p><br/><p>Pfft! You lot are the abnormal ones!</p><br/><p>When she heard them start to exaggerate beyond comprehension, Ning Xi started to get annoyed. \"You guys think too much. I'm a normal person and I don't know lightweight kungfu. In fact, I didn't even fall off. If I really did, how could I climb back up unless I had wing?!\"</p><br/><p>\"Then, what happened? Heroine, stop keeping us in suspense! Quickly tell us!\" Zhao Haisheng wanted to get to the heart of the matter and the others nodded in agreement too. The way they stared at Ning Xi was as if she was the most popular storyteller in ancient teahouses.</p><br/>\n</div>"}