{"title": "Chapter 995: Show Me How You Fell!", "id": 995, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-995-show-me-how-you-fell", "volume_title": "Volume 10", "body": "<h1>Chapter 995: Show Me How You Fell!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 995: Show Me How You Fell!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi slowed down her breath and simply explained, \"When I couldn't control my body, I did my best to roll down with the help of shrubs to slow me down and the fact that this cliff isn't entirely flat; there was about a 70-degree slope. I did my best to slide down the cliff while maximising my body surface area that rolled on the slope. Thankfully, I only slid for a while before I finally got a grip on a rock that was sticking out.</p><br/><p>\"Unfortunately, I was stuck in an awkward position and you guys couldn't hear me when I shouted for you. My phone fell off, so all I could do was to climb up! I'm dead tired. I shouldn't have been lazy and let Lu Tingxiao piggyback me. Life sure comes back at you quickly...\"</p><br/><p>When they heard Ning Xi's explanation, everyone was even more speechless.</p><br/><p>Jeez, she actually had the time to adjust the angle and her way of rolling down when falling off the cliff?</p><br/><p>This was insane! Indeed, she was no normal person!</p><br/><p>\"Couldn't you just have stayed put and wait for us to save you? What if you missed a footing and really fell down? What do we do then?\" Mo Lingtian asked anxiously.</p><br/><p>When Ning Xi heard this, she did not say anything. She just looked indistinctly at Lu Xinyan's direction.</p><br/><p>What Lu Xinyan decided to cover up after her fall?</p><br/><p>It was not that she was being pessimistic. She just had to consider such a possibility since, after all, Lu Xinyan and her were at loggerheads. In that situation, if Lu Xinyan did not say anything, she would not even know how she died.</p><br/><p>Plus, she was not sure how long the rock beneath her feet could hold up, so she quickly climbed back up by herself. There was no way that she would leave her life in the hands of others.</p><br/><p>Lu Xinyan felt ashamed under Ning Xi's gaze. Her lower lip trembled and she was tongue-tied.</p><br/><p>In that instant, because of panic and fear of suffering the consequences, she had really thought of not letting anyone know or just say that Ning Xi had fallen off herself...</p><br/><p>\"Okay, okay! All that you wanted to know has been answered. Now, stop surrounding this place. If Lu Tingxiao notices, I'll be dead! I've to quickly rush back to change my clothes and destroy the evidence. Bye-bye everyone...\" Ning Xi said as she got to her feet.</p><br/><p>Seeing that she did not mention saving Lu Xinyan and had even wanted to hide this incident from Lu Tingxiao, everyone looked at each other in astonishment...</p><br/><p>\"Hey, wait up, Miss Ning Xi, don't move! We don't know if you're seriously hurt. You should go and get checked at the hospital!\"</p><br/><p>\"Exactly! Just to be safe, you must get checked!\"</p><br/><p>\"In fact, it's such a huge thing. We shouldn't hide this from Bro Xiao.\"</p><br/><p>...</p><br/><p>Just as the crowd was getting in Ning Xi's way and throwing her advice, a man's cold voice cut through from the back, \"What are you lot doing?\"</p><br/><p>When she heard the voice, Ning Xi jumped and in a panic, she almost snatched someone else's clothes to wear.</p><br/><p>Unfortunately Lu Tingxiao's eagle eyes had already acurrately pinpointed Ning Xi who was hidden in the crowd and he walked right up to her. \"What's happening?\"</p><br/><p>Ning Xi scratched her head and pretended to be calm. \"I....tripped over...\"</p><br/><p>\"Would tripping look like this? Show me how you fell!\" Lu Tingxiao's eyes skimmed Ning Xi's grimy body like an X-ray and he saw the collapsed cliff behind her, including Lu Xinyan's guilty expression that was becoming increasingly miserable.</p><br/><p>Show him?</p><br/><p>\"Th-that wouldn't be nice...\"</p><br/><p>The devil was so mean!</p><br/>\n</div>"}