{"title": "Chapter 998: Very Exciting", "id": 998, "volume": 10, "url": "http://boxnovel.org/hidden-marriage-chapter-998-very-exciting", "volume_title": "Volume 10", "body": "<h1>Chapter 998: Very Exciting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 998: Very Exciting</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A moment of awkward silence passed.</p><br/><p>Lu Xinyan gritted her teeth, closed her eyes and just mustered the courage to say in front of Lu Tingxiao, \"Miss Ning, thank you for saving me! Also, I'm sorry! Before this, on the mountain, I didn't mean to push you off me. I really didn't know that you were trying to save me! Sorry! I'm so sorry...\"</p><br/><p>Even Lu Tingxiao knew that things had not been that simple. With Ning Xi's agility, she was only helping Lu Xinyan, so she would not have fallen off and after he heard this, his expression was instantly chilled to the core.</p><br/><p>Lu Xinyan was just a young lady who could not handle Lu Tingxiao's pressure. Her body was shaking all over. She was so frightened that she could pass out any minute.</p><br/><p>Ning Xi indicated to Lu Tingxiao that she would resolve the matter herself, then she touched her bandage-bound wrist and looked at Lu Xian, laughing grimly, \"Hehe, lil girl, you almost cost me my life. Just saying that you didn't mean to and that you're sorry, do you really think that's enough? If your apology was useful, what are the police for?\"</p><br/><p>Lu Xinyan bit down hard on her lower lip nervously and looked miserable. \"I'm willing to accept all the consequences!\"</p><br/><p>Ning Xi stroked her chin in contemplation. \"Hmm, willing to accept all consequences? You said it yourself...\"</p><br/><p>\"Yes...I-I did...to kill me or to scrape my flesh as you wish!\" Even though Lu Xinyan stiffened and showed that she was reluctantly offering herself to be hit or killed, her trembling body clearly exposed her panic.</p><br/><p>At that moment, numerous scary imaginations had already crossed Lu Xinyan's mind.</p><br/><p>This woman definitely won't let me off the hook easily...</p><br/><p>As she shook with hopelessness, Lu Xinyan looked to her cousin to beg, yet she was met with sinister eyes even scarier than Ning Xi's!</p><br/><p>Fine! I shall just submit to death! To die in this woman's hand would be better than in Cousin's hands!</p><br/><p>\"Just...just say it! What do you want me to do?\" Lu Xinyan tightened her hands into a fists and asked.</p><br/><p>Ning Xi pretended to hem and haw, contemplating it for a while before she eyed Lu Xinyan and said faintly, \"Call me 'Cousin-in-law'!\"</p><br/><p>\"W-what...?\" Lu Xinyan's face went blank as she stood there bewildered by what she heard. She was stupefied for a while before it dawned on her.</p><br/><p>Was...was Ning Xi's request...just that?</p><br/><p>Ning Xi's brows raised as she urged, \"Didn't you say I could kill or cut off your flesh as I please? What's wrong? Regretting it now?\"</p><br/><p>After putting her emotions through such a rollercoaster ride, Lu Xinyan's entire body shook even more and her tears could not help but roll down as she drooped her head low. She cried as she said in a shaky voice, \"Cousin-in-law...\"</p><br/><p>When she heard this, Ning Xi finally nodded in satisfaction. \"Okay, this issue will come to an end. Thanks to you, I had an exciting day and it was quite fun!\"</p><br/><p>Ning Xi then dragged the scary-looking Lu Tingxiao away.</p><br/><p>Exciting? Quite fun?</p><br/><p>Lu Xinyan and Lu Tingxiao were both speechless.</p><br/><p>...</p><br/><p>After they entered the living room, Ning Xi decided to take the lead and she pushed Lu Tingxiao onto the sofa for a kiss.</p><br/><p>Lu Tingxiao naturally guessed her naughty little thoughts, so he held on to her slim waist and kissed her hard...</p><br/><p>A long while later, Lu Tingxiao pressed his lips to the girl's slightly swollen lips. \"Very exciting? Very fun? Hmm?\"</p><br/><p>Ning Xi suddenly looked like she was about to cry. \"You're still bringing that up?\"</p><br/><p>She thought that her actions could temporarily resolve the danger!</p><br/>\n</div>"}