{"title": "Chapter 1009: Too Late To Turn Back", "id": 1009, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1009-too-late-to-turn-back", "volume_title": "Volume 11", "body": "<h1>Chapter 1009: Too Late To Turn Back</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1009: Too Late To Turn Back</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What did you say? Rongguang is at the shooting range?\" Zhuang Liaoyuan was very surprised.</p><br/><p>\"Yes, Ms. Zhuang is here as well with a handsome young man,\" the young soldier replied.</p><br/><p>\"Noted, you go and look after them.\" Zhuang Liaoyuan was afraid that his son might make a mess.</p><br/><p>\"Yes, Sir!\"</p><br/><p>…</p><br/><p>The news about Chief Zhuang's kids being present with another man spread to the whole of the shooting range quickly.</p><br/><p>Most of the shooting enthusiasts especially Zhuang Liaoyuan's subordinates, went to the no. 1 shooting range to check them out.</p><br/><p>Zhuang Liaoyuan reached there quickly as well and the crowd opened up a path for him when he arrived. They greeted respectfully, \"Hi, Sir\". </p><br/><p>He saw two familiar silhouettes. One of them was Rongguang, the other one was Keer and there was also a young man with them.</p><br/><p>\"What the heck?! Why did he have to come…?\" Zhuang Rongguang mumbled to himself, but it was too late to turn back now.</p><br/><p>Whatever, he had to beat this bastard first!</p><br/><p>Zhuang Keer went up to greet her father when she saw Zhuang Liaoyuan, \"Father, you're here!\"</p><br/><p>\"Mmm, what happened?\" Zhuang Liaoyuan asked as he looked at Zhuang Rongguang and the unfamiliar young man.</p><br/><p>Zhuang Keer pulled him aside and then explained, \"Things are a little complicated...but basically, that man beside Rongguang is actually Xiao Xi. You know, that celebrity, and she usually disguises herself this way…\"</p><br/><p>\"What? That's Ning Xi?\" Zhuang Liaoyuan was shocked. He stole a few more glances and did not feel uneasy about this girl wearing a male outfit. Especially when she held a gun, she had the aura of a strong sharpshooter.</p><br/><p>She had worn a maid's outfit last time and a male outfit this time. As expected of an actress, she took on the character of whatever role she acted as…</p><br/><p>\"Then, what about Rongguang? Why is he with Xiao Xi?\" Zhuang Liaoyuan asked again.</p><br/><p>Zhuang Keer sighed and explained hesitantly, \"Actually, Rongguang has been sneaking out late at night to play games at the internet cafe and to drink at bars. I just casually mentioned it to Xiao Xi and she felt bad for me, so she punished him a little…\"</p><br/><p>\"Oh? How did Xiao Xi do that?\" Zhuang Liaoyuan sounded interested.</p><br/><p>\"Well...it seemed like she once killed Rongguang in a computer game and forced him to quit. She also beat him up last night and she focused on his face. You know Rongguang cares a lot about his image, so he probably won't go out for quite some time…\" Zhuang Keer replied anxiously.</p><br/><p>\"Not bad.\" Zhuang Liaoyuan nodded.</p><br/><p>Zhuang Keer let out a sigh of relief. She thought her father would be angry at Xiao Xi but fortunately, her father thought the same way as her.</p><br/><p>\"So, when Xiao Xi came to visit me this morning, they both met and got into a fight...Rongguang misunderstood our relationship and thought Xiao Xi was getting close to me for revenge! In order to make Xiao Xi leave me, Rongguang was challenged by Xiao Xi to defeat her in anything, then she won't bother me again…\"</p><br/><p>\"So, Rongguang chose shooting?\" Zhuang Liaoyuan finally understood what had happened. At the same time, he felt an indescribable feeling bubbling inside of him.</p><br/>\n</div>"}