{"title": "Chapter 1010: This Bastard Will Lose For Sure", "id": 1010, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1010-this-bastard-will-lose-for-sure", "volume_title": "Volume 11", "body": "<h1>Chapter 1010: This Bastard Will Lose For Sure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1010: This Bastard Will Lose For Sure</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Actually, Zhuang Guangrong was really talented but he was also very lazy and he was afraid that he would be forced to train every day if he were to develop his talent.</p><br/><p>Zhuang Liaoyuan actually did put him up for training every day, but in the end, the child did not even want to touch a gun anymore, no matter what he tried.</p><br/><p>However, today, Zhuang Rongguang suggested to competing in shooting. He had taken up a gun again because of Ning Xi…</p><br/><p>Zhuang Keer looked at the both of them unhappily as she mumbled, \"I don't want Xiao Xi to lose. Rongguang will be really cheeky if he won…\"</p><br/><p>Zhuang Liaoyuan smiled. \"That brat is unlucky today, but it's good for him to learn a lesson. Then, he'll know what real talent is!\"</p><br/><p>Zhuang Keer was surprised and confused. What did her father mean?</p><br/><p>Zhuang Rongguang and Ning Xi picked their guns, not bothering to put on the protective gear.</p><br/><p>While Zhuang Rongguang felt that those equipment were not cool, Ning Xi was used to real fights whereby the equipment might be an obstacle to her instead.</p><br/><p>\"So, how do you want to do this!?\" Zhuang Rongguang felt confident this time after being humiliated by Ning Xi so many times.</p><br/><p>Ning Xi leaned against the wall. \"You decide the rules, I'll follow.\"</p><br/><p>Zhuang Rongguang thought about it. \"Okay, ten shots for the both of us. We'll see who gets the highest score!\"</p><br/><p>\"Sure.\"</p><br/><p>\"That's set then, I'll go first!\" Zhuang Rongguang was looking forward to seeing Ning Xi's dumbfounded face. Maybe she would even give up after he was done!</p><br/><p>Ning Xi stepped back and signaled that he could start anytime.</p><br/><p>Zhuang Rongguang took a deep breath, focused and picked up the gun, then aimed at the target. At that moment, he felt like he was one with the gun.</p><br/><p>He had always favored guns since he was a little kid. He just hated being controlled by his father and he was lazy, so he had denied his father's and grandfather's expectations…</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>…</p><br/><p>Shots were fired one after one. After ten shots were done, the score counter displayed the total score: 100 points!</p><br/><p>Ten consecutive perfect shots! 100 points in total!</p><br/><p>His perfect score shocked the audience!</p><br/><p>Zhuang Rongguang put down the gun and turned to Ning Xi, saying coldly, \"No matter how much you hate me, I hope you stick to our promise and stay away from my sister!\"</p><br/><p>Ning Xi almost laughed out loud seeing this young man trying to act tough. \"Amazing! I'm really impressed! But I'm not the kind to go down without a fight. I'll try for Keer!\"</p><br/><p>\"Whatever!\" Zhuang Rongguang replied.</p><br/><p>I've got a perfect score. This bastard will lose for sure!</p><br/><p>Actually, he himself was also surprised by his score today. It seemed like he was really a genius, the kind that could release an enormous amount of potential at important moments. What a talented genius!</p><br/><p>Zhuang Rongguang gave his father a glance, trying to silently brag about his achievement.</p><br/><p>On the other side, Ning Xi did not start right away. She went up to Zhuang Keer. \"Keer, may I borrow something from you?\"</p><br/>\n</div>"}