{"title": "Chapter 1026: It Should Belong To My Stomach", "id": 1026, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1026-it-should-belong-to-my-stomach", "volume_title": "Volume 11", "body": "<h1>Chapter 1026: It Should Belong To My Stomach</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1026: It Should Belong To My Stomach</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The little bun was seeing a real-life rabbit for the first time, so he hesitated before offering his small hand to touch its body.</p><br/><p>When he was done, the little bun's eyes widened.</p><br/><p>Soft! Furry!</p><br/><p>Ning Xi could not help but laugh at the little bun's rare animated expression. \"Haha! Fun, isn't it?\"</p><br/><p>The little bun nodded and kept stroking it lovingly.</p><br/><p>The rabbit was initially still wiggling around in Ning Xi's hand, but it quieted down after the little bun stroked it.</p><br/><p>\"Whoa! Such a fat rabbit! Quick, let's grill it!\" Lu Jingli said excitedly.</p><br/><p>When the little bun heard what his uncle said, he instantly gave a death stare to Lu Jingli and then hugged the rabbit tightly.</p><br/><p>\"Grill, your head! You only know how to eat!\" Ning Xi said annoyedly.</p><br/><p>\"Hey, wasn't it you...who said to catch it as an addition to our meal?\" Lu Jingli felt wronged to be scolded.</p><br/><p>Ning Xi replied, \"Little Treasure likes it, so we're not allowed to eat it now!\"</p><br/><p>Little Treasure nodded vigorously too. Not allowed to eat my bunny!</p><br/><p>Lu Jingli was speechless. It should have belonged to my stomach!</p><br/><p>\"Did you bring the first aid kit?\" Ning Xi asked.</p><br/><p>Jiang Muye immediately frowned. \"Are you hurt? I told you not to catch the rabbit!\"</p><br/><p>\"It's the rabbit that's hurt, alright?\"</p><br/><p>Jiang Muye had no reply.</p><br/><p>Ning Xi took out the first aid kit and started to bandage the rabbit.</p><br/><p>Wild rabbits run as quick as lighting and they are highly alert too. How could she have caught it easily? She had only managed to catch it because one of the hind legs was hurt.</p><br/><p>The little bun felt sorry for the rabbit and stroked its head lovingly, looking like he was the one in pain.</p><br/><p>After bandaging it up, Ning Xi carefully put the rabbit back into the little bun's arms for him to hold. This rabbit was quite naive and it was very obedient in the little bun's arms.</p><br/><p>\"Why go through so much trouble? It would've been better if we just ate it..\" Lu Jingli looked bitter and hateful.</p><br/><p>Thankfully, he had forgotten about the rabbit very soon because Ning Xi started the grill. In the forest, the fragrance of peach blossoms and the tempting smell of food mixed together, whetting one's appetite!</p><br/><p>As the four of them ate, there were sounds of footsteps behind them. Ning Xi turned around to look and saw Song Jin leading a cow with a basket in his hand, walking towards the forest.</p><br/><p>Ah! She had too much fun and had almost forgotten about her official business!</p><br/><p>The reason she had chosen this place for barbeque was because she noticed that Song Jin would usually come here to eat lunch after finishing work on the farm!</p><br/><p>\"Elder Song, are you done being busy? Want to come over and have some food?\" Ning Xi asked eagerly.</p><br/><p>She had been rejected three times, so Ning Xi considered herself quite familiar with him now. Furthermore, this time she had not held too much hope, so her attitude was much more relaxed.</p><br/><p>Elder Song Jin looked at them and when his gaze fell on Little Treasure, he paused for a moment, then said, \"Thank you, but this old man has brought his lunch!\"</p><br/><p>He then sat at a spot ten steps away from them as he ate his lunch under a tree. In the basket were a simple loaf of bread and some salted vegetable.</p><br/><p>\"He's Song Jin?\" Jiang Muye asked.</p><br/><p>Earlier on the way, Ning Xi had already chatted a little about Song Jin with Jiang Muye and Lu Jingli.</p><br/><p>\"Yeah! Doesn't he seem so detached from worldly things!?\" Ning Xi said.</p><br/><p>On the side, Lu Jingli tried to speak with his mouth full, \"No matter how detached a person is, they'll have their weakness, I'm telling you! Such as how my brother's weak point is you, and my weak point is food...\"</p><br/><p>\"Haha, you can use your brother as an example, but you...forget it!\"</p><br/><p>\"Whatever, that's what I mean! There's definitely something that he wants. You just haven't found out what yet!\"</p><br/>\n</div>"}