{"title": "Chapter 1024: My Hands Are Itchy! I Want To Beat Someone Up!", "id": 1024, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1024-my-hands-are-itchy-i-want-to-beat-someone-up", "volume_title": "Volume 11", "body": "<h1>Chapter 1024: My Hands Are Itchy! I Want To Beat Someone Up!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1024: My Hands Are Itchy! I Want To Beat Someone Up!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The moment Ning Xi said that, a soft little bun ran down from upstairs and jumped into her embrace, his face full of glowing expectations.</p><br/><p>When she saw that Little Treasure was so excited at the sound of a trip, Ning Xi could not help but feel guilty. \"Mmm, sorry, my little bun, Mommy hasn't brought you out for fun in a long time! We'll be going tomorrow! And it'll just be the two of us!\"</p><br/><p>With Mommy only? And not bringing Father?! The little bun's eyes instantly lit up even more when he heard this. The rays of light from him almost bedazzled Ning Xi's eyes till they turned glassy.</p><br/><p>Ning Xi replied, \"Yes! We're not bringing the huge lightbulb!\"</p><br/><p>Lu Tingxiao was speechless. Had karma had come too quickly?</p><br/><p>\"What's wrong? Do you have anything to say?\" Ning Xi looked at Lu Tingxiao and raised her brows.</p><br/><p>Lu Tingxiao was helpless. \"No.\"</p><br/><p>The girl actually knew that he was going to be outstation for work tomorrow and definitely would not be able to go.</p><br/><p>\"Good, then it's gladly decided!\"</p><br/><p>...</p><br/><p>Because he had a date with Mommy for a trip, Little Treasure was so excited that he almost could not sleep for the entire night. This was his first time on an outing with Mommy.</p><br/><p>The next morning, Little Treasure had woken up early to prepare for the outing. The family of three packed up before going separate ways.</p><br/><p>At that moment, a person suddenly ran over from the opposite bungalow. \"Wait! There's me too! Me too!\"</p><br/><p>\"Lu Jingli? Why are you here?\" Ning Xi was surprised to see him.</p><br/><p>\"My brother said that you guys are going for a spring outing! Spring outings are definitely going to involve barbeque! I want to go too!\" Lu Jingli looked like he was about to salivate.</p><br/><p>Ning Xi was taken aback. \"Are you coming for the spring outing or for food?\"</p><br/><p>\"Of course, for food! Sister-in-law, the grilled meat you made the last time was really yummy! I won't eat for free. I'll help you guys carry the bags and I'll do the hard work, okay?\" Lu Jingli tried to grovel.</p><br/><p>\"It's the desolate countryside, after all. Let Jingli go with you two,\" said Lu Tingxiao.</p><br/><p>\"Okay then!\" Ning Xi thought that having someone carry their bags was a good idea since she did bring quite a lot today.</p><br/><p>\"Then...do you mind bringing one more person...?\" Behind them was Jiang Muye's voice.</p><br/><p>When he saw that Jiang Muye had appeared from nowhere, Lu Jingli looked upset because it meant that there was someone else to fight for food with him. \"Hey, Jiang Muye! Why are you everywhere?! It's fine if you want to leech on supper, but you want to leech on the outing too!?\"</p><br/><p>\"Didn't you mention going to a desolate countryside? There'll definitely be no one there. I've recently gotten crowd syndrome. I get a headache when I see too many people. Coincidentally, I need to go to such a place to relax!\" Jiang Muye said in a weak and troubled tone.</p><br/><p>Ning Xi's mouth twitched. \"What the hell is 'crowd syndrome'?\"</p><br/><p>\"This is a problem for those of us who are too popular. I won't blame you for not understanding!\" Jiang Muye sighed.</p><br/><p>Ning Xi was speechless. Her hands were itchy and she really wanted to beat someone up!</p><br/><p>At last, Ning Xi and Little Treasure's duo had become a trio and now, a quadruplet.</p><br/><p>Fine, one can help carry the bags and the other can carry Little Treasure when he gets tired from walking. This is the rhythm of Pigsy [1] and the white dragon!</p><br/><p>Quite good!</p><br/><p>After they had decided, Ning Xi walked to Lu Tingxiao to say goodbye. \"My dear, we're leaving now!\"</p><br/><p>When they heard Ning Xi use such a gentle and sweet tone to speak to Lu Tingxiao, Lu Jingli and Jiang Muye knew it was time for public display of affection, so they quickly ran off in tandem. What remains unseen is deemed to be clean!</p><br/><p>Translator's Thoughts</p><br/><p>Daoist7 Daoist7</p><br/><p>[1] Pigsy -  (Zhu Bajie). A character in the Chinese folklore \"Journey to the West\" (|) with pig-like characteristics and armed with a muck-rake; Pigsy in Arthur Waley's translation</p><br/>\n</div>"}