{"title": "Chapter 1034: Just Getting Soy Sauce", "id": 1034, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1034-just-getting-soy-sauce", "volume_title": "Volume 11", "body": "<h1>Chapter 1034: Just Getting Soy Sauce</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1034: Just Getting Soy Sauce</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When Yan Ruyi said this, she paused and looked at her husband. \"Could all of this just be a coincidence? For the past five years, Tingxiao's and Little Treasure's situation did not have any signs of changes, yet it all began to shift when this woman appeared!\"</p><br/><p>Lu Chongshan pinched the space between his brows when he heard this. \"What are you trying to say?\"</p><br/><p>\"I thought about the calculation that Master Xuan Jing had done for Ning Xi's date of birth! Good fortune beyond comparison, a prospering husband, and a flourishing family, a future with many children and plenty of luck! Now, it is really coming true as predicted!\" Yan Ruyi was slightly emotional as she said this.</p><br/><p>Lu Chongshan was stunned. \"I told you not to believe in these things anymore!\"</p><br/><p>Even though he said that, Lu Chongshan remained deep in thought...</p><br/><p>...</p><br/><p>At night, Ning Xi invited Gong Shangze, Han Momo, and Qiao Weilan for dinner to celebrate.</p><br/><p>When she returned to the apartment, Ning Xi first showered, then dug up a set of velvet bunny pajamas to wear in accordance to her good mood before crossing her legs to sit on the bed and do some accounting.</p><br/><p>The studio's profits had been looking positive recently, the numbers having passed tens of millions. Compared to regular people, she was now considered a mini wealthy woman herself!</p><br/><p>Ning Xi planned it out in her mind. She could probably buy a small bungalow soon...</p><br/><p>Even though the place she stayed at right now had very good privacy and protection, it was still a place that the company had arranged for her. Quite a lot of people knew where she stayed, so it was not convenient for Lu Tingxiao to come by usually, so it was best for her to get her own house.</p><br/><p>It would also be considered...a nest of her own...</p><br/><p>Before this, whether it was Starlight Entertainment's tattered house or Glory World Entertainment's high-class apartment arrangement, it was still not her own place.</p><br/><p>Of course, more importantly, it should be convenient for her to keep her \"mistress\" in her house!</p><br/><p>After planning in detail, Ning Xi had basically brought her timeline of buying a house in advance. She was ready to ask for Lu Tingxiao's opinion about which location he liked, and of course, Little Treasure's too...</p><br/><p>Seeing that it was still early, Ning Xi was prepared to make a loving bento for the little bun. When she reached the kitchen, she remembered that she had run out of soy sauce, so she put down the apron and went to buy some. Because the convenience store was not too far away, Ning Xi did not bother getting changed and just took some change and her keys downstairs.</p><br/><p>\"Boss! Please give me a bottle of soy sauce!\" Ning Xi leaned over the cashier countertop and gave the cashier some small change.</p><br/><p>\"Hey, sure!\" In the convenience store, the lady boss, who looked like she was in her fifties, passed Ning Xi a bottle of soy sauce. At the same time, she evaluated her and frowned. \"It's so late, why did your mother let you go out to buy soy sauce alone?\"</p><br/><p>\"Uhh...\" Ning Xi broke out in a light sweat. \"No worries, Boss, my house is close by!\"</p><br/><p>Ning Xi's hair was tied up in two ponytails while she wore a cartoon onesie, making her look just like an underaged 17 or 18-year-old girl. No wonder the shopkeeper misunderstood.</p><br/><p>\"It's not okay even if it's close by. You're a young lady so full of life. What if you meet a bad guy!? Next time, don't come out alone this late at night!\" The lady boss reminded.</p><br/><p>Ning Xi nodded. \"Okay, I know, thank you, sis!\"</p><br/><p>The lady boss grinned from ear to ear when Ning Xi called her \"sis\" and she stuffed another colorful lollipop in her hands. \"Here you go!\"</p><br/><p>Ning Xi held the soy sauce bottle in one hand as she sucked on the lollipop the lady boss had given her in the other, happily hopping her way home...</p><br/><p>Just as she was thinking about what yummy food to cook for the little bun, someone appeared before her without any warning.</p><br/>\n</div>"}