{"title": "Chapter 1045: There’s A Woman In Boss’ House!", "id": 1045, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1045-there%E2%80%99s-a-woman-in-boss%E2%80%99-house", "volume_title": "Volume 11", "body": "<h1>Chapter 1045: There’s A Woman In Boss’ House!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1045: There’s A Woman In Boss’ House!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Okay, stop messing around. Get down there to your man! They're going to fight soon! We're in China and right in the middle of Imperial, so there's no advantage for either of them to fight here!\" Feng Xiaoxiao reminded her.</p><br/><p>\"Oh...then I'll leave now, Third Senior Sister! Let's have a drink next time…\" Ning Xi climbed out of the window.</p><br/><p>Feng Xiaoxiao was worried. \"Are you going to be alright? Why don't you just take the stairs?\"</p><br/><p>\"That's troublesome...stop looking down on me, alright? It's just the third floor!\" Ning Xi then climbed down along the water pipe.</p><br/><p>Feng Xiaoxiao remained silent.</p><br/><p>You've become a real little bunny now! How could I be not worried!?</p><br/><p>But actually, as a woman, Feng Xiaoxiao was still a little jealous!</p><br/><p>After all, she was way more experienced than Ning Xi in the field and she had gone through a lot of traumatic experiences. Nevertheless, she was also less trustful compared to Ning Xi…</p><br/><p>Men...she would never fall in love with those creatures!</p><br/><p>…</p><br/><p>On the other hand, Ning Xi realized that she should have listened to Third Senior Sister. When Ning Xi was halfway down the pipe, her legs were trembling and she fell to the ground.</p><br/><p>Suddenly, everyone's attention turned to her corner…</p><br/><p>They then saw a cute little girl getting to her feet clumsily as she seemed to be mumbling something…</p><br/><p>\"Where did this little bunny come from?\" Someone from Yun Shen's side asked.</p><br/><p>\"Big news! There's a woman in the Boss' house!\"</p><br/><p>\"A fresh underaged girl at that!\"</p><br/><p>\"Oh my gosh! Boss has that kind of fetish!?\"</p><br/><p>…</p><br/><p>People were making a scene as they looked at Yun Shen more and more suspiciously as well until a clear, cold voice cut through their doubts, \"That's Tang Xi.\"</p><br/><p>Everyone was speechless when they heard 16's declaration.</p><br/><p>Was that a joke?!</p><br/><p>Lu Tingxiao's expression changed when he saw Ning Xi. Despite the crowd around, he could only see his own wife right now.</p><br/><p>Yun Shen's razor-sharp eyes glared at Feng Xiaoxiao who stood by the broken window, then he looked at Ning Xi and said in a cold tone, \"Come over.\"</p><br/><p>Ning Xi's mouth twitched in irritation. She tried to brush off the leaves and dirt on her. While she did not say anything, her expression made it obvious that she would only go over to his side if she was crazy.</p><br/><p>Ah! The devil!!!</p><br/><p>Ning Xi looked at Lu Tingxiao's direction happily.</p><br/><p>The difference in her attitude towards the two men was obvious.</p><br/><p>The three of them formed a triangle; Lu Tingxiao and Yun Shen were about ten steps away from each other, and Ning Xi was right between them near the corner of a wall.</p><br/><p>As Ning Xi stepped out towards Lu Tingxiao's direction, there was a creepy, demonic voice that rang out, \"I'll give you one last chance. Think properly before you move!\"</p><br/><p>Decide which side to move towards to!</p><br/><p>That creepy voice halted Ning Xi mid-step. She remained stationary and looked up to see the stony-faced Lu Tingxiao and the dark-faced Yun Shen.</p><br/><p>What should she do…?</p><br/><p>She was not troubled by the choice of which side she was going to pick. It was not even a question! Her only concern was what would Yun Shen do if she walked towards Lu Tingxiao's side?</p><br/>\n</div>"}