{"title": "Chapter 1058: Too Inhumane", "id": 1058, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1058-too-inhumane", "volume_title": "Volume 11", "body": "<h1>Chapter 1058: Too Inhumane</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1058: Too Inhumane</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Several days later, after being done with house hunting, she made sure that her health was fully recovered. She gave Ling Zhizhi a call to confirm that the programme would start the next day in the afternoon.</p><br/><p>Jiang Muye wanted to join when he found out that Ning Xi was going to be on the show, but Lu Jingli stopped him with his authority as his boss.</p><br/><p>\"If I don't get to eat, neither do you!\" </p><br/><p>In the end, the male guest remain unchanged.</p><br/><p>It was a male celebrity who was not very famous. He was a little chubby and usually took on comedic roles.</p><br/><p>\"Beauty's Specialties\" was pretty popular when it had been newly released. Although many female celebrities made really disgusting food, that was exactly why it was popular. The scene where they showed the male guest eating the unidentifiable food was the highlight of the show. Clearly, the viewers enjoyed it.</p><br/><p>Nevertheless, at the end of the day, it was still a cooking show. The production team went too far in order to get higher ratings that the viewers became bored with the gimmick of having pretty celebrities prepare bad food.</p><br/><p>Many viewers criticized the production team and questioned the show's intentions. It became more of a prank show. The way they forced the male guests to eat the disgusting dishes was inhumane.</p><br/><p>Fans of the male guests especially complained about the show a lot. The worst case was Jiang Muye's episode. His fans almost made the programme shut down, flooding the show's official Weibo with criticism.</p><br/><p>Because of these complaints, they could hardly invite any more male guests to join them. The production team was forced to make adjustments and invite female guests who could actually cook.</p><br/><p>Unfortunately, most of the time their looks and cooking skills did not match. It was very rare to find guests who were both pretty and good at cooking.</p><br/><p>Even if one knew how to cook, the food was mediocre at best. For an entertainment show, if the food was mediocre, it might rate better if it was terrible!</p><br/><p>However, if they sacrificed looks for better cooking, the rating would fall even further as it defeated the purpose of the show's name, \"Beauty's Specialties\".</p><br/><p>In the end, the production team thought of an idea -- to use chef doubles!</p><br/><p>This meant that they would pay for a chef to come and cook. In the cooking scenes, they would just show the chef's hands, but other times, they would show the female guest, creating the false impression that the female guest was cooking.</p><br/><p>It was actually a perfect plan if it was not found out. Unfortunately, some viewers with sharp eyes realized it. There was an episode where the female guest's ring had disappeared when the screen changed to the cooking view!</p><br/><p>The viewers criticized the production team once again, and even the female guest was attacked harshly as well.</p><br/><p>In the end, the production team went back to their old ways of having pretty guests cooking bad food. While they might not be able to make the old viewers stay, they might be able to attract more new ones.</p><br/><p>Cooking shows always had lower ratings compared to other entertainment shows, but within its category, this show was the most popular one…</p><br/><p>The next afternoon, Ning Xi brought Xiao Tao along and arrived at the studio on time.</p><br/><p>Ning Xi wore Spirit Studio's latest dress with a floral design so she could move and cook more easily. With her hair in a ponytail, she gave off positive sunshine vibes, looking very lively and youthful.</p><br/>\n</div>"}