{"title": "Chapter 1051: Extremely Jealous", "id": 1051, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1051-extremely-jealous", "volume_title": "Volume 11", "body": "<h1>Chapter 1051: Extremely Jealous</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1051: Extremely Jealous</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I'm alright. I've been sleeping. How do you feel?\" Lu Tingxiao asked.</p><br/><p>Ning Xi shook her head, then looked into his eyes. \"Lu Tingxiao, do you have something you're not telling me?\"</p><br/><p>Actually, she realized that Lu Tingxiao had been hiding something from her ever since they had returned. She could tell that something was not right from his reaction earlier even though he hid it very well.</p><br/><p>Lu Tingxiao remained silent.</p><br/><p>Ever since their return, he could not ignore what the silver-haired man said no matter how hard he tried.</p><br/><p>\"At a time when she felt the most dejected, sorry, hopeless and painful, I took her in and taught her the skills necessary for her to survive…</p><br/><p>\"She belongs to the same world as me…</p><br/><p>\"The world is vast, but in the end, she will realize where she belongs…\"</p><br/><p>Was it truly where she belonged?</p><br/><p>He tried his best to convince himself but he could not.</p><br/><p>He was jealous!</p><br/><p>Jealous of that man!</p><br/><p>Extremely jealous!</p><br/><p>He was jealous of their past, of their extraordinary relationship…</p><br/><p>…</p><br/><p>Lu Tingxiao looked thoroughly uncomfortable. Although he was under the sunlight right now, it was obvious that he was rapidly freezing up. The thought of losing Ning Xi wrapped him up in layers of icy chill…</p><br/><p>\"Ning Xi...will you ever leave me?\" Lu Tingxiao finally asked the girl in front of him, his eyes full of sorrow. He was afraid that she would leave him anytime.</p><br/><p>What he received as a reply was a huge, warm hug. The girl's warm, slender body wrapped him tightly, melting the ice…</p><br/><p>Ning Xi thought that it was something really severe and was speechless when she heard him.</p><br/><p>But she felt heartache for him as well, so she hugged him even tighter. \"Why do you think I've been working so hard? It's all to be with you, so I can marry you with pride, alright?\"</p><br/><p>It was all done so I can stay in your world…</p><br/><p>Being with Lu Tingxiao was her life's biggest blessing, yet also her biggest gamble…</p><br/><p>She knew that she should not have, but she fell. She fell deeper and deeper into him…</p><br/><p>The next moment, Ning Xi pushed Lu Tingxiao down. With ferocious eyes, she said, \"Lu Tingxiao, why are you asking me this? I'm warning you! You're the one who seduced me, you're the one who charmed me! If one day you dare to betray me…\"</p><br/><p>While Ning Xi was threatening him, her heart was smiling. Even if one day he really did betray her, she probably could not bring herself to hurt him!</p><br/><p>Without realizing it, she had found herself being entirely consumed by him…</p><br/><p>The man stared at her. In his eyes was his world. \"I would never betray my life.\"</p><br/><p>The girl's eyes were full of determination as well. \"Me too! Lu Tingxiao, I have two lives. One was when I was born, the other one was when I met you.\"</p><br/><p>Lu Tingxiao's hand on her arm suddenly tightened.</p><br/><p>The thunderstorm above them faded away and the sky cleared up...</p><br/>\n</div>"}