{"title": "Chapter 1066: Fulfilling Promise", "id": 1066, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1066-fulfilling-promise", "volume_title": "Volume 11", "body": "<h1>Chapter 1066: Fulfilling Promise</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1066: Fulfilling Promise</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Woohoo!!!\" After a short silence, there was a roaring cheer.</p><br/><p>Many of them witnessed how hard Zhuang Rongguang had trained, so they were really happy to see him win.</p><br/><p>All of his old and new friends went up to congratulate him. They patted his shoulder and rubbed his head.</p><br/><p>\"That's my boy! Good job!\"</p><br/><p>\"10 shots with 10 points each while blindfolded! So amazing for such a short period of training!\"</p><br/><p>\"Hahaha...Xiao Guang! I knew you could do it! Now, you can make that bastard suffer!\"</p><br/><p>\"You brat, I've underestimated you! Superb shooting!\"</p><br/><p>…</p><br/><p>Zhuang Rongguang looked around. As he heard all the praises from everyone, there was a strange, warm, and cozy feeling bubbling inside him. It was something he had never experienced before…</p><br/><p>That passion, excitement, and pride filled him with power…</p><br/><p>When he saw the comforting eyes from his father and grandfather, he felt like tearing up. How weird!</p><br/><p>How could he be this emotional?! He hated hard work so much and he also hated shooting…</p><br/><p>Was that...really hate…?</p><br/><p>\"Hey! Kid, Xiao Guang did it, you lose. Time to fulfill your promise!\"</p><br/><p>\"That's right! Change! Let everyone see! Remember to go three rounds!\"</p><br/><p>\"Hahaha...if Ms. Zhuang saw how embarrassing he looks in a girl's outfit, she'd surely despise him!\"</p><br/><p>\"Right…\"</p><br/><p>…</p><br/><p>Until the crowd reminded him, Zhuang Rongguang returned to his senses, looking excited and refreshed. He went up to Ning Xi. \"Bastard! I told you, I just wasn't serious enough before. I even surprised myself when I got serious! How's that?\"</p><br/><p>\"Impressive! I admit defeat. Is there a changing room here?\" Ning Xi asked.</p><br/><p>Someone replied, \"It's just over there! Just pick any one that's vacant!\"</p><br/><p>\"Don't go back on your word if you're a man! We're all watching, don't you dare run away!\"</p><br/><p>\"Hahaha, he must look like a sissy in a girl's outfit with that face of his!\"</p><br/><p>…</p><br/><p>Ning Xi took her clothes and walked slowly into the changing room.</p><br/><p>Zhuang Rongguang felt that all his effort was worth it. He looked at Zhuang Keer haughtily. \"Sis, now you can finally give up on him! That bastard can't even beat me! And he's the worst kind of person out there! But I really don't understand... When did I even start a feud with him?!\"</p><br/><p>Zhuang Keer tried to suppress her emotions and did not say anything.</p><br/><p>Zhuang Rongguang thought that she was disappointed with Ning Xi, so he was really glad and took out his phone, ready to take a video.</p><br/><p>He was going to threaten this bastard the next time he came close to his sister!</p><br/><p>A while later, the door of the changing room Ning Xi had entered earlier was pushed open from the inside.</p><br/><p>Everyone looked at the direction of the changing room with excitement.</p><br/>\n</div>"}