{"title": "Chapter 1061: Charm of A Professional", "id": 1061, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1061-charm-of-a-professional", "volume_title": "Volume 11", "body": "<h1>Chapter 1061: Charm of A Professional</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1061: Charm of A Professional</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Within five seconds of chopping, Ning Xi seemed to be done with the radish.</p><br/><p>The crowd still saw a whole radish on the chopping board, then Ning Xi gave it a little nudge and everyone could see that the radish was sliced up finely.</p><br/><p>The emcee and Feng Rui were shocked. Even the director was taken aback as well.</p><br/><p>\"These...these cutting skills! Could we finally have a real deal on our show? Xiao Wang, did you get that angle just now?!\" The director asked the cameraman.</p><br/><p>The cameraman looked innocently at him. \"The camera was focused on the female guest's face just now. She finished slicing the radish before I had the time to switch camera angles…\"</p><br/><p>\"How could you not take such an important shot?! Where's your professionalism?!\" The director yelled at him.</p><br/><p>\"Please... She only took about 5 seconds to slice up the radish! I didn't have enough time!\"</p><br/><p>The director glared at the cameraman, then went up to Ning Xi. \"Ning Xi, we didn't expect you to have such awesome cutting skills! We want to have a close up because you were too fast just now, so our cameraman didn't have enough time to switch camera angles! Can you slice another one up again? Wait, make that two, we need one close up and one wide shot angle! We want to avoid the audience saying that we used a double for you!\"</p><br/><p>\"Alright,\" Ning Xi replied.</p><br/><p>Then, Ning Xi sliced up two other radishes.</p><br/><p>The live audience could see it clearly this time and they discussed her skills. The emcee even picked up a slice and put it in front of the camera. It was as thin as a cicada's wing. \"This sort of cutting skill... You probably can't do it without seven or eight years of experience, right?\"</p><br/><p>Ning Xi then started cooking the roast pork.</p><br/><p>Thick soy sauce, thin soy sauce, cooking wine, rock sugar, star anise, ginger, onion, chilli, basil leaves…</p><br/><p>In just few minutes, Ning Xi prepared all the ingredients and lined them up nicely on the side, then she put in a piece of pork belly into the frying pan. Along with cold water, star anise, ginger, basil leaves, and chilli, she started frying it and left it to braise.</p><br/><p>After the sauce came to a boil, Ning Xi scooped up the meat and carefully removed any extra hair on the surface, then cut it up into cubes of three centimeters wide…</p><br/><p>The whole process was as smooth as silk with no obstacle at all.</p><br/><p>\"Ning Xi, I see that you brought this grass here. What's it for?\"</p><br/><p>\"Malian grass, also known as Malan, is usually used for wrapping rice dumplings or cooked meat. Using it to tie up the roast pork can keep it together.\"</p><br/><p>\"What about this claypot?\"</p><br/><p>\"Actually, you can replace it with an electrical pot. While the claypot might take a longer time to cook, I think it makes it tastier.\"</p><br/><p>…</p><br/><p>Ning Xi had a serious expression on her face when she cooked as if she was focused on creating an important piece of art, so the emcee stopped bothering her after a few more questions.</p><br/><p>Ning Xi did not try to show of. She was just cooking seriously, but people could not take their eyes off her. No one expected that without any pranks or any interaction between the male and female guests, it could be this enthralling to just watch a person cook. It was truly an enjoyment, the charm of such a professional…</p><br/><p>Finally, the pot of roast pork was completed and it was time to dig in!</p><br/>\n</div>"}