{"title": "Chapter 1074: Interesting News", "id": 1074, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1074-interesting-news", "volume_title": "Volume 11", "body": "<h1>Chapter 1074: Interesting News</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1074: Interesting News</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi quickly moved the phone away from her ear and put it back on after the screaming ended. \"My dear, did you just call me just to boast about the capacity of your lungs?\"</p><br/><p>\"Just now...just now, Director Qiao from your company called me. She said my proposal went through! I can open a shop with Spirit Studio now, hahahaha…\"</p><br/><p>Lu Xinyan’s voice was pretty loud, even Qiao Weilan could hear her.</p><br/><p>\"Congratulations!\" Ning Xi smiled.</p><br/><p>There was a short silence, then came Lu Xinyan’s awkward voice, \"Well...thank you!\"</p><br/><p>\"For?\"</p><br/><p>\"Thank you for helping me! I’m a fair person! You helped me, so of course, I’m going to thank you!\" Lu Xinyan said.</p><br/><p>Ning Xi humbly replied, \"Thank you for your fairness, Ms. Lu, but you don’t have to thank me. I didn’t do anything. When Director Qiao came to me earlier, they had already decided to accept your proposal.\"</p><br/><p>\"Does it mean I passed with my own abilities?\" Lu Xinyan’s tone was full of excitement.</p><br/><p>\"You can say so.\" Ning Xi nodded.</p><br/><p>There was another short scream again. Lu Xinyan then cleared her throat, \"Well, then thank you for being fair and not hindering my proposal submission!\"</p><br/><p>\"You’re welcome.\"</p><br/><p>\"Just wait and see, my shop will definitely score the top sales among the six!\"</p><br/><p>\"Okay, I’m looking forward to it!\"</p><br/><p>…</p><br/><p>After Ning Xi finished the call, Qiao Weilan asked, \"Boss, you know Lu Xinyan?\"</p><br/><p>From their conversation, they seemed pretty close.</p><br/><p>\"Sort of! We had some complicated matters between us before and she thought I'd purposely obstruct her proposal...but the misunderstanding is probably cleared by now!\" Ning Xi explained.</p><br/><p>Qiao Weilan nodded, then took another look at the woman in front of her again.</p><br/><p>The more she knew, the more she felt like this woman was like a mystery with many secrets dwelling within her…</p><br/><p>——————————</p><br/><p>After she left the studio, she went to the garage with her car key. As she got into the car, her phone rang again.</p><br/><p>The screen showed it was Tang Lang.</p><br/><p>Ning Xi picked up the call. \"Hello, Second Senior Brother? What’s up?\"</p><br/><p>\"Little Junior Sister, I just received interesting news! Come to the usual place!\" Tang Lang’s oddly excited voice came over from the phone.</p><br/><p>\"Interesting news? What interesting news?\"</p><br/><p>\"Come and you’ll know! Quick! Remember to bring some money with you! I don’t have any! It’ll be on your tab!\"</p><br/><p>…</p><br/><p>Ning Xi was about to go home but after the call from the mysterious Tang Lang, she drove towards bar Number 8.</p><br/><p>\"Did you bring enough money?\" Tang Lang asked her urgently when she reached.</p><br/><p>\"Yes I did, what’s the matter?\" Ning Xi asked impatiently.</p><br/><p>\"Water! Get me another bottle of Remy Martin Club Brandy!\" Tang Lang yelled generously after his human ATM arrived.</p><br/><p>Ning Xi slammed her hand on the table hard. \"Hey! Did you lie just to get me here to pay for your alcohol?\"</p><br/><p>Tang Lang was stuffing popcorn into his mouth greedily and dropped the whole bowl when Ning Xi slammed the table. He then put on a mature expression and haughtily said, \"Rude! How can you talk to your master like this?!\"</p><br/><p>Ning Xi clenched her teeth, then put on a sickly sweet, honeyed smile. \"If guns weren’t banned in China, do you think I’d need you?!\"</p><br/>\n</div>"}