{"title": "Chapter 1075: How Should I Feel?", "id": 1075, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1075-how-should-i-feel", "volume_title": "Volume 11", "body": "<h1>Chapter 1075: How Should I Feel?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1075: How Should I Feel?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Everyone in the organization had a specialized skill of their own. Tang Lang had his fighting prowess. As for Tang Ye, aside from fighting, he had extraordinary business management skills. Feng Xiaoxiao specialized in assassination while Annie was the medical expert. Feng Jin was all about strategy and Ning Xi was the sharpshooter.</p><br/><p>When they were abroad, as long as she had a gun in her hand, to say that no one could get near her was not an exaggeration.</p><br/><p>However, things were different here. Guns were strictly prohibited in China.</p><br/><p>In addition to her career as an actress, if she was found out carrying a gun with her at all times, it would gravely affect her acting career, which was why she had to train her fighting prowess and expand her capabilities in some things that were not her forte.</p><br/><p>It was quite difficult for her.</p><br/><p>\"That’s why I said that the best, the most perfect weapon in the world is your body!\" Tang Lang acted like a professional.</p><br/><p>\"Fine. Stop it. Are you done being so secretive? If you’re not going to tell me, I’m leaving!\"</p><br/><p>Tang Lang quickly replied as his human ATM was going to leave, \"Why are you in such a rush!? You can’t get anything done without patience, okay? But...this news isn’t really a secret anyway. It’s been known throughout the organization!\"</p><br/><p>\"You mean it's related to them?\" Ning Xi’s expression darkened.</p><br/><p>Tang Lang waved when he saw Ning Xi’s serious expression. \"Relax, it’s good news! Do you know Satan actually ordered that no one is to lay their hands on you?! What he said was 'if anyone hurts her, I'll crush all their bones…'\"</p><br/><p>Ning Xi was surprised. \"Are you sure? Didn't he say the opposite? Maybe he put up a bounty for people to crush my bones!\"</p><br/><p>Tang Lang rolled his eyes at her. \"Not just the organization, the entire black market, including The Sins and the other mercenary groups were warned. No one dares to take any orders that might be involve you because of what happened the other day!</p><br/><p>\"And do you think it was just a normal gun shot to Feng Jin’s hand? That shot was aimed at his veins on purpose. His hand is long gone. If it wasn’t for Annie, he might even have problems coping with his daily life. He might not even able to hold a gun ever again!\"</p><br/><p>Ning Xi pinched the bridge of her nose. \"That’s his personality alright, never allowing anyone to disobey his orders…\"</p><br/><p>Was that all…?</p><br/><p>Tang Lang put on the face of a curious paparazzi and shoved his fist like an imaginary mic into her face. \"Hey, Little Junior Sister, don’t you feel anything after hearing what I’ve just said?\"</p><br/><p>\"How should I feel?\"</p><br/><p>\"Touched! Not only did you leave the organization and broke up with him, you even get together with the big boss of the enemy, yet Satan didn’t kill you! He’s even protecting you. This is what I call true love!\" Tang Lang said in a exaggerated tone.</p><br/><p>Ning Xi’s mouth twitched. \"You’re thinking too much!\"</p><br/><p>Maybe he did not want others to lay their hands on her because he wanted to kill her personally. Moreover, what did he mean about \"breaking up\" with him!?</p><br/><p>Back then, after the guy had saved her, she had made a four-year promise that she would work for him for four years. As payback, she would do anything for him during the four years.</p><br/><p>After four years, she was promised that she could leave as she wished.</p><br/><p>In the end, on the last day, that man broke his promise and did not let her leave, driving her frustrated.</p><br/><p>Ning Xi could not do anything, so she asked him what he wanted.</p><br/><p>That man had the gall to ask her to be his girlfriend!</p><br/>\n</div>"}