{"title": "Chapter 1087: Not Recognize The Real Master", "id": 1087, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1087-not-recognize-the-real-master", "volume_title": "Volume 11", "body": "<h1>Chapter 1087: Not Recognize The Real Master</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1087: Not Recognize The Real Master</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Tsk, how shameless! She came to take their assets from them as a foster daughter…\"</p><br/><p>\"Right! Shameless indeed!\"</p><br/><p>\"This girl is different now. Did you see her outfit? That's a very popular brand recently and it's pretty expensive too. Plus, she drives a BMW! With her seductive face, who knows which old man kept her as his mistress?!\"</p><br/><p>\"What is the Old Master thinking? He already has Miss Xueluo, yet he wanted to adopt another girl from the countryside!\"</p><br/><p>…</p><br/><p>\"Chatting very happily, aren’t we?! Who’s the girl? Hmm?\"</p><br/><p>As the big bunch of servants was gossiping happily, a cold voice came from behind. Everyone was shocked and they turned around.</p><br/><p>\"A bunch of servants biting your master’s tail, eh? Is this the standard of the Ning family’s servants?\" A woman in her thirties reprimanded them. She had short hair and wore a champagne-colored dress, looking very much like the epitome of a strong woman.</p><br/><p>Ning Qiutong was the cousin of Ning Yaohua and Ning Yaobang. Her parents had passed away early, so she left home and ventured overseas. Rumor was that her business was going really well and that she had married into a good family. It had been many years since she last came back. Her name was sometimes brought up in conversations because of how well she was doing overseas and some of the older servants in the Ning family knew about her.</p><br/><p>Even after so many years, the intimidating aura she gave off was still the same.</p><br/><p>\"W-we’re talking about Ms. Xi, not Ms. Xueluo…\"</p><br/><p>\"That’s right! We’re talking about the countryside girl!\"</p><br/><p>Ning Qiutong was not someone to pick fights with, so they quickly explained to her.</p><br/><p>Ning Qiutong glared at all of them, her tone going even colder. \"Why would I have to scold you all if you guys were talking about Ning Xueluo!?\"</p><br/><p>Ridiculous! The servants could not even recognize their real master now! If it was not for her uncle’s call, she really did not want to come back.</p><br/><p>\"Miss... She... What does she mean? What does she mean she wouldn’t have scolded us if we were talking about Ms. Xueluo?\"</p><br/><p>\"Who knows!?\"</p><br/><p>\"Actually, I realized that Ning Qiutong did not like Ms. Xueluo many years ago. I don’t understand what went wrong between them…\"</p><br/><p>They started gossiping again, discussing the capable Ning Qiutong’s legendary life.</p><br/><p>…</p><br/><p>When Ning Xi stepped into the study room, she saw that everyone else had arrived. Ning Yaohua, Zhuang Lingyu, Ning Xueluo, Ning Yaobang, and Ning Tianxin were there. Even Su Yan attended the session.</p><br/><p>\"Xiao Xi, you’re here! Come to Grandfather!\" The elder’s serious expression broke into a smile the moment he saw Ning Xi.</p><br/><p>Ning Xi had put on peach-themed makeup today, matching her youthful outfit. The elder was pleased that she looked healthy and happy.</p><br/><p>Ignoring the cold glares from multiple directions, Ning Xi went up to her grandfather smilingly. \"Grandfather, are you alright? How was the herbal medicine prescription I gave you the last time? Was it effective?\"</p><br/><p>The elder was excited to update her. \"Ah, I was just about to tell you! The prescription you gave me worked like a charm! My headache stopped and I stopped having sweat when I sleep. I can even walk more now! Look at me walk!\"</p><br/>\n</div>"}