{"title": "Chapter 1099: Give The Most Perfect Life", "id": 1099, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1099-give-the-most-perfect-life", "volume_title": "Volume 11", "body": "<h1>Chapter 1099: Give The Most Perfect Life</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1099: Give The Most Perfect Life</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Moments later, Ning Xi changed into the gown Gong Shangze had taken out for her before putting up some light make up and flat ironing her hair.</p><br/><p>The evening dress that Gong Shangze had found for her was indeed a very understated design. It was a traditional classic qipao which was in a simple yet elegant color. The black orchids printed on it were outlined subtly and she looked very much like the chaste daughter of a noble household from the Republic of China era.</p><br/><p>Ning Xi stood before the full-length mirror to look at herself and was satisfied. \"Not bad, it's splendid! This one, then! Thank you, Shangze! I'll make a move first, bye bye!\"</p><br/><p>\"Okay...\"</p><br/><p>Gong Shangze watched his boss leaving and hesitated to say something.</p><br/><p>This dress was relatively low-profile...but once she donned it, it was not inconspicuous at all...</p><br/><p>Ning Xi was the muse of his inspiration, the source for many of his designs, and was even the model in his head when he designed his pieces. You could say that she was the real owner of all of Spirit's apparel. When she had worn the dress herself, she brought his designs to life perfectly...</p><br/><p>...</p><br/><p>At the Mo residence, Mo Jianzhang's birthday banquet was organized in the outdoor garden today and the current atmosphere was extremely lively.</p><br/><p>Lu Tingxiao had reached earlier, knowing that Ning Xi was busy in the studio, so he did not rush her.</p><br/><p>Mo Lingtian held a goblet in his hand and worriedly asked Lu Tingxiao, \"Hey, Lu Tingxiao, your bunny will turn up, won't she? Is she still angry at me? Is she okay from the last time that she almost fell off the cliff? Was she traumatized?\"</p><br/><p>When Lu Tingxiao heard this, he cast a sidelong glance at his best friend without a word.</p><br/><p>Frightened? That little girl had said that she had a lot of fun and that it was quite exciting!</p><br/><p>He really hoped that she could be frightened a little. That way, she would be more careful.</p><br/><p>Mo Lingtian did not know what Lu Tingxiao's glance meant. Just as he spoke to him, a familiar outline appeared at the door.</p><br/><p>Ning Xi handed over her invitation to the guard at the gate before walking in leisurely. Under the gorgeous and dazzling chandelier at the doorway, the girl looked as if she had stepped into the world of mortals from thin air with her simple gown and her wooden hairpin in her loosely-tied hair. She walked with her back to the light and the view behind her gradually faded away like an ink-washed painting...</p><br/><p>The dress did not just fit her well; it was Ning Xi's unique talent of being able to change her own spirit that made the air around her shift with the gown she wore. It was for that reason that both person and dress complemented each other well.</p><br/><p>Ning Xi's appearance made the banquet room fall into a hush for a while, then came the lowered voices of discussion.</p><br/><p>When they suddenly saw such a breathtaking new face, people would obviously be curious. While the girls were curious about Ning Xi's identity, they were most interested in timeless topics such as clothes and accessories, thus many people took notice of Ning Xi's qipao very quickly.</p><br/><p>\"Who's the girl that just walked in? She looks like a certain female celebrity... That gown is amazingly beautiful! She looks very charismatic!\"</p><br/><p>\"Ah! I know that gown... That's a Spirit piece. I've seen it in the boutique before but I didn't buy it because I thought it seemed too ordinary. Who knew that it would be so stunning when you put it on? I really regret not buying it then!\"</p><br/><p>\"Spirit's pieces are not bad. I really like it too, but most importantly is who wears it! The more understated these dresses look, the more it chooses who wears it!\"</p><br/><p>\"You're right!\"</p><br/><p>...</p><br/><p>After Ning Xi walked in and caught Lu Tingxiao's eye, she found a corner to sit down.</p><br/>\n</div>"}