{"title": "Chapter 1092: Didn't Even Get Half A Share", "id": 1092, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1092-didnt-even-get-half-a-share", "volume_title": "Volume 11", "body": "<h1>Chapter 1092: Didn't Even Get Half A Share</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1092: Didn't Even Get Half A Share</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhuang Lingyu scoffed as she consoled Ning Xueluo by patting the back of her hand, \"Don't worry, Mother is here. No one can bully you!\"</p><br/><p>\"Mother, thank you...\" Ning Xueluo teared up as she lay in Zhuang Lingyu's embrace. Her eyes caught Ning Xi's and there was an undoubted sneer in her eyes.</p><br/><p>After the momentary dispute, the will announcement resumed.</p><br/><p>The remaining funds and property had been evenly divided among a few people. Ning Xi had received a property in City C too. City C was where her foster parents lived and where she had grown up for the past 18 years. The elder had really put thought into this arrangement.</p><br/><p>After that was done, the most important part remained -- the company shares!</p><br/><p>This was also the reason why Ning Yaobang had refrained from causing a ruckus. The shares were the most important portion.</p><br/><p>At that moment, Ning Xueluo looked slightly nervous. She had observed the elder's attitude towards her earlier. In terms of shares, he would not treat her unfairly, would he?</p><br/><p>The lawyer flipped the page then continued to read aloud, \"Ning International Private Limited Company. With a total of 51% in shares, the distribution is as follows: Ning Yaohua 15%, Ning Yaobang 6%, Ning Qiutong 10%, Ning Tianxin 10%, Ning Xi 10%! End of announcement.\"</p><br/><p>The instant the lawyer finished, the study room was pin-drop silent.</p><br/><p>The end?</p><br/><p>The sharing of the will had ended?!</p><br/><p>After the distribution of shares had been announced, Ning Yaobang breathed a sigh of relief. Even though Ning Yaohua had 15%, on his side, he and Tianxin would have a total of up to 16%, which was exceeded Ning Yaohua's portion by 1%, so how could he not be happy?</p><br/><p>Even though Ning Xi had received 10% as well, based on her bad relationship with the other side, she would definitely not give up her shares to Ning Yaohua!</p><br/><p>However, he did not expect that Ning Qiutong would get as much as 10% too. As the elder's biological son, he himself had only gotten a mere 6%, so it made him a little sulky.</p><br/><p>On Ning Yaohua's face was a complicated expression as he looked towards Ning Xi. Even he could not help but affirm that experience counted. The way it was distributed was really...</p><br/><p>It had completely tied everyone to each other. No one could influence anyone.</p><br/><p>The first person to say something was Zhuang Lingyu. \"You're done reading? What about Xueluo?\"</p><br/><p>As much as Ning Xueluo had been holding it in, she could not help but turn pale at that moment. She never would have thought that the elder had not left any shares for her!</p><br/><p>Was this a way of him slapping her before the entire Ning family? Even with Su Yan present!</p><br/><p>How could she remain honorable when she married into the Su family?</p><br/><p>Earlier, he had even pretentiously said some things about values and family ties...</p><br/><p>This goddamn old man! How cunning of him!</p><br/><p>Ning Yaobang scoffed, \"Hasn't all that should be given been given? What more do you still want? Sister-in-law, let me advise you that as a person, you shouldn't be too greedy!\"</p><br/><p>\"Well, you can't just leave Xueluo out. Not even a percent of the shares! What is this supposed to mean? Isn't Xueluo part of the Ning family? Even you said so yourself, Father. Humans are living beings and we cannot be merciless. Xueluo has, at least, been your granddaughter for so many years. You make us disillusioned by treating her this way!\" Zhuang Lingyu said this in outrage.</p><br/><p>\"Huh...\" Just as Zhuang Lingyu was expressing the injustice of the situation, a soft peal of laughter was suddenly heard from a corner.</p><br/><p>Zhuang Lingyu immediately looked crossly at Ning Qiutong. \"Qiutong, just be upfront if you have anything to say. There's no need to be peculiar!\"</p><br/><p>\"Since you said so yourself, then let me be straightforward.\"</p><br/>\n</div>"}