{"title": "Chapter 1100: Don't Even Have A Girlfriend", "id": 1100, "volume": 11, "url": "http://boxnovel.org/hidden-marriage-chapter-1100-dont-even-have-a-girlfriend", "volume_title": "Volume 11", "body": "<h1>Chapter 1100: Don't Even Have A Girlfriend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1100: Don't Even Have A Girlfriend</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Mo Lingtian hung his arm over Lu Tingxiao shoulders and could not help but started listing, \"Two-faced fox, cute little bunny, shooting expert, adorable maid, warrior, daughter of nobility...hey! How many faces does your little bunny have? I finally know why you're so charmed by this woman. She becomes a different person every time she dresses up. Do you feel like you're changing girlfriends every day?\"</p><br/><p>Lu Tingxiao responded, \"I like her no matter how she looks.\"</p><br/><p>Mo Lingtian's joke suddenly became an emotional moment when Lu Tingxiao said that.</p><br/><p>Mo Lingtian felt like he had just been shot with an arrow to his chest. \"Bro, I noticed that after you started dating, you've practically become a love guru! I would never have known before this! I thought you had low EQ! Speaking of which, the strategy you gave me earlier was too general, can't you teach me a few more tricks in detail compared to that cringy affectionate words you just uttered?\"</p><br/><p>\"How's Ziyao?\" Lu Tingxiao suddenly asked.</p><br/><p>Mo Lingtian sighed, \"You've already made it so clear the last time. Based on Ziyao's personality, she definitely will give up, I guess. She's not the kind of woman who would cling on and pester.\"</p><br/><p>Mo Lingtian chatted with Lu Tingxiao for a while more, then greeted Ning Xi before entertaining other guests.</p><br/><p>In the end, many people at the banquet asked him about Ning Xi, even his old man was looking at her.</p><br/><p>\"Lingtian, is that girl your friend?\" Mo Jianzhang asked.</p><br/><p>\"Yeah, why?\"</p><br/><p>\"I didn't think that you'd have this kind of friend!\" Mo Jianzhang looked at his son lamentably.</p><br/><p>\"Huh? Father, how can you talk about your own son like this?!\"</p><br/><p>\"When are you going to progress and make her your girlfriend?\" Mo Jianzhang suddenly asked.</p><br/><p>Mo Lingtian spat his drink into his glass and started coughing furiously. He was almost startled to death by his father's words. \"Father! Don't scare me!\"</p><br/><p>Mo Jianzhang frowned at him. \"Don't make a fuss about nothing. How did I scare you? The old saying goes that you can see one's values through their looks. I can see that this girl is not bad. She's composed and well-mannered. Since the two of you are friends and were chatting happily earlier, why can't you just take it further? You're about to reach your thirties. Even Lu Tingxiao has a girlfriend, so how much longer do you plan to fool around?\"</p><br/><p>Mo Lingtian looked like he would rather die. \"Father... I have something to say! Today is your birthday. Can't you just talk about something happier?\"</p><br/><p>\"Then, can you do something that can make me happier? Which family is that girl from? If you're not going to say anything, I can help you propose a marriage! If you get married this year, she should be able to give birth to a bouncy little baby by next year!\" Mo Jianzhang was obviously fixated on the thought of having grandchildren.</p><br/><p>\"Father! My dear father! Don't joke around anymore! She is Lu Tingxiao's other half!\" Mo Lingtian finally could not hold it in any longer and blurted out.</p><br/><p>Mo Jianzhang was stunned. \"What? That's...that's Lu Tingxiao's girlfriend?\"</p><br/><p>Mo Lingtian pinched the space between his brows. \"Yes! So, can I please ask you to stop right there?! Besides, I already have someone in my heart!\"</p><br/><p>Mo Jianzhang scoffed, \"Huh, the person in your heart has high standards. Would she ever like you?\"</p><br/><p>\"Father, am I actually your child?! She has high standards but I'm not that shabby, okay?\" He had already been working hard recently to court his love interest.</p><br/><p>Mo Jianzhang looked at Ning Xi's direction and sighed with regret, \"You useless thing! You don't even have a girlfriend till now!\"</p><br/><p>Mo Lingtian was speechless.</p><br/>\n</div>"}