{"title": "Chapter 1101: She’s My Future Wife", "id": 1101, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1101-she%E2%80%99s-my-future-wife", "volume_title": "Volume 12", "body": "<h1>Chapter 1101: She’s My Future Wife</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1101: She’s My Future Wife</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Awkward…</p><br/><p>He would not have been treated this badly if Lu Tingxiao had not gotten a girlfriend so soon. </p><br/><p>He still had a friend in him before and could still use Lu Tingxiao as his shield! But not anymore!</p><br/><p>He really had to speed up his game to get closer to Ziyao…</p><br/><p>As he was about to go and look for Guan Ziyao, a guy suddenly dragged him aside and asked excitedly, \"Master Mok, is that girl in the corner your friend? What’s her name? Where's she from?\"</p><br/><p>\"What do you want?\" Mo Lingtian glanced at him suspiciously.</p><br/><p>This guy was an infamous Casanova in Imperial and changed girlfriends as often as he changed his clothes. Worst of all, he loved to mess with other people’s girlfriends.</p><br/><p>Wang Shengzhe raised his eyebrows. \"Of course, I’m interested! You know I like that type of chick!\"</p><br/><p>Mo Lingtian sipped some wine to contain his annoyance. \"You don’t have to know who she is. All I'll say is don’t mess with trouble.\"</p><br/><p>Wang Shengzhe exclaimed, \"Hey, don’t jinx me! It’s normal for a guy to be attracted to such a beautiful lady!\"</p><br/><p>Mo Lingtian said without any expression, \"She’s taken.\"</p><br/><p>\"So what? There’s no girl in Imperial that I wouldn't dare to flirt with!\" Wang Shengzhe then courageously walked towards Ning Xi’s direction.</p><br/><p>Somewhere nearby, Guan Ziyao was talking to Lu Tingxiao. She wore a black Chanel gown in her usual simple and elegant style, but her expression looked tired.</p><br/><p>Guan Ziyao looked at the man in front of her and spoke slowly, \"Tingxiao, I’m sorry for what happened last time. I lost control of my emotions. I should’ve said something before I left.</p><br/><p>\"I understand what you’re trying to say. You’re the most compatible man I’ve ever met and I once thought that we could spend the rest of our lives together. But there is still a long way to go and too many things are simply unpredictable... It’s regrettable but I respect your decision.\"</p><br/><p>Guan Ziyao then smiled with poise. \"So, we’re still friends right?\"</p><br/><p>Without a doubt, this was the best way for her to move forward right now. She had forced herself not to look for him during this period of time. She thought that if she stepped back, Lu Tingxiao would not reject her this time.</p><br/><p>Lu Tingxiao glanced at her, then said with his usual cold expression, \"I’m sorry, to avoid any further misunderstandings with my girlfriend, we really shouldn’t contact each other anymore.\"</p><br/><p>Guan Ziyao’s face froze. She did not expect Lu Tingxiao’s reply. His words had completely disregarded her!</p><br/><p>Guan Ziyao looked hurt and her voice trembled, \"Tingxiao...we’ve known each other for about 20 years, I understand that you have someone you love, but I already declared that I will leave you. Are you going to give up our friendship for a woman you haven't known for very long?\"</p><br/><p>\"She’s not just a woman I haven't known for long. She’s my future wife.\" Lu Tingxiao then coldly looked at her with a warning glare and Guan Ziyao felt a chill run down her spine…</p><br/>\n</div>"}