{"title": "Chapter 1116: My Baby Is So Smart", "id": 1116, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1116-my-baby-is-so-smart", "volume_title": "Volume 12", "body": "<h1>Chapter 1116: My Baby Is So Smart</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1116: My Baby Is So Smart</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi looked at Yan Ruyi and Lu Chongshan. She knew that they cared about Little Treasure's condition too, so she pointed towards the vase beside her bed and asked gently, \"Little Treasure, what's this?\"</p><br/><p>Little Treasure looked at the direction Ning Xi pointed at, then said with perfect diction, \"Flower.\"</p><br/><p>\"What about this?\" Ning Xi suppressed her excitement and held up an apple.</p><br/><p>\"Apple.\"</p><br/><p>\"This?\" Ning Xi picked up the air-conditioner remote control.</p><br/><p>\"Remote control.\"</p><br/><p>...</p><br/><p>Ning Xi continued to point at quite a few things and the little guy answered them all. Even though he had not spoken for a long time, his pronunciation was flawless.</p><br/><p>\"My baby is so smart!\" Ning Xi praised him emotionally.</p><br/><p>The little bun shyly pursed his lips as he was praised by his mother, indicating that he was very happy. He then brought his bento over and said \"Mommy, eat.\"</p><br/><p>\"Okay...thank you, baby! Mommy will finish it all!\"</p><br/><p>Yan Ruyi cried out in joy on the spot, \"This is wonderful! Too wonderful!\"</p><br/><p>This time, Little Treasure could really open up and speak!</p><br/><p>Initially, she had been worried that even if Little Treasure opened up, he might have speaking difficulties as he had not spoken for a long time. Before this, Ziyao had mentioned introducing a teacher to help with Little Treasure's language recovery, but by the looks of it now, there was no issue with his communication skills.</p><br/><p>Lu Chongshan looked at his dear grandson, feeling gratified. He seemed not to care even if his grandson had called Ning Xi his mother.</p><br/><p>\"Well, something good had come out of this accident...\" Lu Chongshan lamented.</p><br/><p>Yan Ruyi shot him a look and lowered her voice to say, \"What are you saying? I've told you long ago that this girl is a lucky star! Look what happened this time. Not only did she turn a misfortune into a blessing, she's even added blessings for our Little Treasure! If it was not for the provocation of this incident, would Little Treasure have properly opened up and spoken?\"</p><br/><p>Lu Chongshan looked at his wife. Because he was in a good mood, it was rare that he did not argue back.</p><br/><p>Little Treasure accompanied Ning Xi for a little while more, but because he still had school, he had to go off with his grandparents and Second Uncle first. Lu Tingxiao stayed back to watch after Ning Xi.</p><br/><p>When there was only Ning Xi and Lu Tingxiao left in the ward, Ning Xi finally could not control her excitement any longer. She instantly jumped up and down the bed and into Lu Tingxiao's lap. \"Lu Tingxiao, did you hear that!? Little Treasure called me Mommy!\"</p><br/><p>\"So, you were so excited that you didn't sleep for the whole night?\" The man asked unhappily as he carried her back onto the bed.</p><br/><p>Ning Xi did not care that she was being reprimanded. She continued to be in her own world of excitement. \"Little Treasure called me Mommy, called me Mommy! Hahahaha, I'm so happy...\"</p><br/><p>As he watched Ning Xi go on like that, Lu Tingxiao had no doubts that she could be ecstatic for the whole day and not sleep. \"I know, he called you Mommy. I've already helped you record his voice earlier. Can you sleep soundly now?\"</p><br/><p>\"Ah! Really? My dear, you're so considerate! Quick, play it for me! Quickly!\" Ning Xi rushed.</p><br/><p>Lu Tingxiao could only obey and open his phone's recorder to play the earlier recording.</p><br/><p>The moment he clicked play, the phone played Little Treasure's baby voice. \"Mommy\".</p><br/><p>Ning Xi immediately cradled Lu Tingxiao's phone in her arms like a baby. She played it over and over again, then she suddenly thought of something and mumbled, \"Well, this time I'd really have to thank Guan Rui and Guan Ziyao... Oh yes, what happened to Cao Lirong?\"</p><br/>\n</div>"}