{"title": "Chapter 1113: No Use Looking For Anyone", "id": 1113, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1113-no-use-looking-for-anyone", "volume_title": "Volume 12", "body": "<h1>Chapter 1113: No Use Looking For Anyone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1113: No Use Looking For Anyone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Guan Ziyao's expression faltered, but she calmed down very quickly. \"I'm in a bad mood these past few days. Rong Rong has been accompanying me all this while. Maybe I had a bit too much to drink and told her some things about Lu Tingxiao and me. She found out about Ning Xi's existence and so she was probably taking it out on her as she felt that it was unfair to me. All of this was just an accident! Now, are you suspecting me? Suspecting that all of this was my instruction?\"</p><br/><p>Mo Lingtian watched Guan Ziyao's hurt eyes blaze and he balled his hands into fists. \"I'm sorry... Today, Ning Xi had almost...you know, I gave you that invitation... If Ning Xi had really...you know, well, I'd have to bear the blame too...\"</p><br/><p>Guan Ziyao's expression softened and she walked to Mo Lingtian to pull on his hand. \"Lingtian, I'm sorry, I've involved you in all this...but all of this is my fault. It has nothing to do with you! You don't have to blame yourself!\"</p><br/><p>Mo Lingtian watched the girl tug on his hand and looked down with struggle evident in his eyes...</p><br/><p>Ziyao, can I really still trust you?</p><br/><p>\"Lingtian, what happened was really an accident, but Lu Tingxiao had called it intentional murder in the heat of the moment. That's too severe of an accusation! Lingtian, can you think of a solution for me? After all, Rong Rong only came to accompany me, and because of me, this misunderstanding happened. She's still so young. If she has a criminal record because of this, then her entire life will be ruined!\" Guan Ziyao said worriedly.</p><br/><p>Now, the most important thing was to quickly get her out before Cao Lirong ratted them out!</p><br/><p>However, the fate of her entire family was in their hands and they believed that she would not do such a stupid thing either, but still, just in case.</p><br/><p>When he saw Guan Ziyao's worried expression, Mo Lingtian did not obey as he used to. Before this, as long as it was her, he would help without hesitation. This time, he pinched the space between his brows and said instead, \"I'm really sorry, I can't help you this time. You know how Tingxiao is too, Ning Xi almost died this time, so he won't let go of her easily. Now, even if it was me, on the police's end, I wouldn't be able to intervene.\"</p><br/><p>\"Then, what do we do? Rong Rong was just here for a holiday and this happened! What do I tell her family?\" Guan Ziyao buried her face in her hands and her body faltered.</p><br/><p>Everything that happened had been out of her control. Her emotional burden had long reached its limit...</p><br/><p>Mo Lingtian quickly held her and consoled, \"Ziyao, don't be too worried! Thankfully, Ning Xi is fine now. Plus, as you said, Rong Rong and Ning Xi were just quarreling. She didn't have intentions to murder her. With the truth, the police won't make things hard for her after their investigation. Even if Tingxiao has a strong influence, they can only sentence her to intentionally injuring someone...\"</p><br/><p>Guan Ziyao held her forehead, her eyes aloof. Mo Lingtian was right. There was no way Lu Tingxiao would let this go this time, so there was no use looking for anyone...</p><br/><p>There was only one other option...</p><br/><p>...</p><br/><p>Late at night, at the guardhouse, Guan Rui had used all of his tricks, yet he could not bail Cao Lirong out. He only managed to get a few minutes of time to speak to her.</p><br/><p>\"What actually happened? Tell me everything clearly!\" Guan Rui demanded with a gloomy expression.</p><br/><p>When he had replayed the CCTV footage many times, the footage clearly showed that she did push Ning Xi into the water. There was no way of getting off the hook.</p><br/>\n</div>"}