{"title": "Chapter 1110: Mommy! I Want Mommy!", "id": 1110, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1110-mommy-i-want-mommy", "volume_title": "Volume 12", "body": "<h1>Chapter 1110: Mommy! I Want Mommy!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1110: Mommy! I Want Mommy!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What's happening?! How's Sister-in-law? She was just attending a banquet. How did she fall into the water?\" Lu Jingli carried Little Treasure and panted as he asked loudly.</p><br/><p>When Yan Ruyi saw that Lu Jingli had brought Little Treasure over as well, her expression changed instantly. \"Why're you here? And you even brought Little Treasure to such a place!\"</p><br/><p>Lu Chongshan asserted, \"This is nonsense! Quickly take Little Treasure home! The hospital is filled with bad vibes and viruses!\"</p><br/><p>Lu Jingli wiped off the sweat from his brow. \"I was just taking care of the child obediently at home. But I suddenly received the news that Sister-in-law had been pushed into the water, so I rushed over. Little Treasure heard my call and said that he had to come with me. I didn't have a choice! I could only bring him with me!\"</p><br/><p>As he said this, Little Treasure's eyes stayed fixated in the direction of the emergency ward. He started to struggle violently in Lu Jingli's arms, shouting unintelligibly in a raspy voice.</p><br/><p>Lu Jingli could only put down the little guy.</p><br/><p>The moment Little Treasure was put on the ground, he sprinted towards the emergency ward.</p><br/><p>As he stared at the huge, white doors that were shut tight and at the striking red light above his head, the little bun's face turned pale and his little body shook hard. Then, he suddenly started to shout piercingly, \"Ah!!! Ah!!! Ah!!!\"</p><br/><p>As he shouted, he pounded hard on the operating theatre doors.</p><br/><p>This child's emotional actions frightened everyone. Yan Ruyi quickly ran over and hugged her dear grandchild in her arms, trying to soothe him, \"Little Treasure, don't worry! It's okay! The doctor is inside! Your Aunty Xiao Xi will come out soon! Don't be scared!\"</p><br/><p>Lu Chongshan quickly consoled him too, \"Little Treasure, don't be scared, Grandfather is here. I'll definitely have doctors heal your Aunty Xiao Xi! Let's go home first, okay? You'll disturb the doctors at work here.\"</p><br/><p>However, Little Treasure could not hear the voices around him anymore, sinking deeper into his own bubble. He continued to lose control yet, he did not stop even when his voice was hoarse. He shouted and used his little hands to hammer on the door with all his strength. His eyes were filled with fear and worry. Everyone could not help but be moved...</p><br/><p>Mo Jianzhang was already blaming himself profusely. Ning Xi had met with trouble at his place, after all, so he had to bear the blame.</p><br/><p>Mo Lingtian's body shook as he almost could not stand upright anymore...</p><br/><p>The second time, this was the second time...</p><br/><p>He had given that woman's invitation to Guan Ziyao! He was the one who had extended it to her!</p><br/><p>\"How could this be!? Sister-in-law was still sending me messages earlier about cute koi fishes! How could she suddenly be dying so soon?\" Lu Jingli's shoulders shook as he almost started sobbing with Little Treasure too.</p><br/><p>The situation was chaotic...</p><br/><p>As Lu Tingxiao's watched this uncontrollable scene from the side, he felt a headache coming. He never would have thought that Lu Jingli would bring Little Treasure over.</p><br/><p>The soundproofing of the emergency ward was so good that Ning Xi did not know what was happening outside at all.</p><br/><p>However, Ning Xi would never let Little Treasure be sad for a single second even if she had to stop her plan midway...</p><br/><p>Lu Tingxiao thought about it and was prepared to carry his son elsewhere, then secretly tell him the truth...</p><br/><p>It was all they could do.</p><br/><p>Lu Tingxiao decided to do so, then walked over to his son. \"Little Treasure, calm down. Listen to me, your...\"</p><br/><p>But before Lu Tingxiao could continue to speak, Little Treasure had bitten the back of his hand and pushed him away hard. He shot his father a dirty look with his pair of fearful and angry eyes, akin to a little beast that was hurt. He stared at him and then glared at everyone else as he shouted at the top of his lungs, \"Mommy! I want Mommy! I want Mommy!!!\"</p><br/>\n</div>"}