{"title": "Chapter 1122: Little Treasure’s The Most Important", "id": 1122, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1122-little-treasure%E2%80%99s-the-most-important", "volume_title": "Volume 12", "body": "<h1>Chapter 1122: Little Treasure’s The Most Important</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1122: Little Treasure’s The Most Important</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Guan Rui was really frustrated, but he also understood that there was no use arguing with Lu Chongshan now. He said in a low voice, \"Bro Lu, I know that my family is responsible in this matter, but Tingxiao really hurt our relationship. Anyway, we’ll be a family soon in the future.</p><br/><p>\"Ziyao’s already suffered a lot because of that woman. First, he had a woman outside before Ziyao came back, and now he’s attacking us for that woman’s sake. Is this really the right thing to do?\"</p><br/><p>Lu Chongshan’s expression turned serious. After putting some thought into it, he sighed, \"Bro Guan, in regards to Ziyao, Ruyi and I have both really liked her since she was small. We view her like half our own daughter. If possible, of course, I hope we can become a family.</p><br/><p>\"But we Lus aren't so selfish as to ask Ziyao to wait endlessly for Tingxiao. After all, you know what’s happening to Tingxiao now. Ruyi and I can’t do anything, so I really don’t want to waste Ziyao’s time. I suppose we should leave relationship matters in their hands!\"</p><br/><p>Lu Chongshan genuinely hoped that they could become a family with the Guans, but with the current situation, not only Tingxiao, even Little Treasure was getting closer and closer to the woman. They could not make the Guan family wait forever!</p><br/><p>They might not be friends anymore and might even become enemies, so Lu Chongshan decided to be straightforward with Guan Rui.</p><br/><p>Guan Rui’s expression changed.</p><br/><p>He had no rebuttal to Lu Chongshan’s words since they had just promised each other privately. There was not even a marriage contract, so the Guan family had no say in this.</p><br/><p>He was too impatient this time!</p><br/><p>Lu Chongshan took the risk into consideration and backed off…</p><br/><p>Guan Rui clenched his teeth. \"Bro Lu, I believe the both of them still have feelings for each other. It's just a small misunderstanding. It’s alright if the project won’t be carried out with us. Just take it as an apology for what happened the last time. It’s my fault, I shouldn’t have brought a distant relative to an event like that…\"</p><br/><p>\"Bro Guan, since it’s a misunderstanding, it’ll be fine after some clear explaining! Our relationship won’t be affected by our children’s drama!\"</p><br/><p>As Lu Chongshan spoke, he felt his sleeve being pulled at from behind. He looked around and saw his own grandson tugging on his sleeve. In his other hand was a painting.</p><br/><p>Lu Chongshan’s expression turned gentle. \"Are you done? Do you want to show Grandfather?\"</p><br/><p>Little Treasure nodded and looked at Guan Rui. He probably remembered that he had seen this man at the dinner the last time and that he was the grandfather of Guan Zhichen, so Little Treasure tensed up.</p><br/><p>Lu Chongshan realized his grandson’s unease, so he quickly sent Guan Rui away. After Guan Rui left, Lu Chongshan returned to the living room.</p><br/><p>There was nothing more important than getting his dear grandson to call him \"Grandfather\"!</p><br/><p>Lu Chongshan looked at Little Treasure’s painting and praised him with a loving smile.</p><br/><p>As he saw Little Treasure’s lively expression and beautiful eyes, Lu Chongshan sank into deep thought…</p><br/><p>He was not against Lu Tingxiao being with that woman because he hated her. It was because his past experience had traumatized him…</p><br/>\n</div>"}