{"title": "Chapter 1125: To Become Mother’s Leg Accessory", "id": 1125, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1125-to-become-mother%E2%80%99s-leg-accessory", "volume_title": "Volume 12", "body": "<h1>Chapter 1125: To Become Mother’s Leg Accessory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1125: To Become Mother’s Leg Accessory</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Chongshan’s opened his mouth wide as he turned around in disbelief. His body trembled slightly while looking at the little guy, not believing his own ears…</p><br/><p>Did Little Treasure...just say...something?</p><br/><p>\"Grandfather, dinner’s ready!\" Little Treasure repeated, then turned to Yan Ruyi, \"Grandmother, time to eat!\"</p><br/><p>It was so sudden that Yan Ruyi lost control of her tears. She turned around and wiped her tears, then replied, \"Okay...we heard you, we’ll be there soon!\"</p><br/><p>Little Treasure then left happily.</p><br/><p>Lu Chongshan and Yan Ruyi both looked at each other, their eyes tearing up.</p><br/><p>Yan Ruyi wiped her tears away and said to Lu Chongshan, \"Little Treasure called you first, happy now aren’t you!\"</p><br/><p>\"Look at you. He just called both of us together, stop being so petty! How childish!\" While Lu Chongshan said that, he could not hide the satisfaction and excitement on his face.</p><br/><p>Yan Ruyi mumbled to herself when she saw Lu Chongshan’s face. Although he said it did not matter, he was actually ecstatic on the inside! Who was childish now!?</p><br/><p>During dinner, the atmosphere was warm and everyone was happy at the table.</p><br/><p>Yan Ruyi and Lu Chongshan were smiling all the while. Their attitude towards Ning Xi had improved as well.</p><br/><p>After dinner, as Ning Xi was about to leave, Yan Ruyi said to her, \"It’s very late already, why don't you stay here for tonight?\"</p><br/><p>Ning Xi was really surprised by Lu Chongshan and Yan Ruyi’s attitude tonight. She rejected carefully, \"Thank you, Madam Lu, for your concern, but I have to go to Qingdao tomorrow for a business trip. I have to go back and prepare the materials I need for tomorrow.\"</p><br/><p>\"I see…\" Yan Ruyi nodded. \"Is it for your apparel company?\"</p><br/><p>Ning Xi affirmed, \"Yes.\"</p><br/><p>\"I heard Xinyan’s retail store housing your brand is doing pretty well.\"</p><br/><p>Ning Xi put on a bitter smile. \"She had a great start. Account-wise, her store had the highest sales, but who knew that she was running multiple discount campaigns and tried to pump up her numbers with more sathat? She even changed the professional salespeople I arranged for her…\"</p><br/><p>Although Yan Ruyi was not a professional, after being around Lu Chongshan for so many years, even she understood the problem. \"This child! How could she do that?! Then, what happened?\"</p><br/><p>\"I talked to her and made sure she followed the rules and regulations. Her discounts have made her a great loss and it'll take some time for her to recover, but as long as she doesn’t do anything reckless, it’ll surely get better…\"</p><br/><p>Yan Ruyi patiently listened to Ning Xi’s market analysis of several brands and she nodded, continuing to chat with her.</p><br/><p>Lu Chongshan had actually investigated Ning Xi’s company and found out that she not only started it up by herself, she also did most of the things on her own. Despite being a small company to develop to the state it was today, Tingxiao had never involved himself in any of the process…</p><br/><p>Yan Ruyi chatted with Ning Xi for quite a while. It was only after Lu Tingxiao urged her to leave so she would not be too tired that Ning Xi was sent to the door.</p><br/><p>\"Mommy!\" The little bun clung onto Ning Xi’s trousers and looked up as if he wished to become his mother’s leg accessory and follow her back.</p><br/>\n</div>"}