{"title": "Chapter 1133: Come Over To Support A Friend", "id": 1133, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1133-come-over-to-support-a-friend", "volume_title": "Volume 12", "body": "<h1>Chapter 1133: Come Over To Support A Friend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1133: Come Over To Support A Friend</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi dumbfoundedly exclaimed, \"Wow? Is he really...not fertile?\"</p><br/><p>Ming Fangfang touched her lower belly bashfully and said, \"I'm pregnant, what do you think?\"</p><br/><p>Ning Xi immediately looked overjoyed. \"Whoa! Really?! You're pregnant? Congratulations!\"</p><br/><p>There was no need to ask any further. That man had obviously lied to her.</p><br/><p>When Ming Fangfang saw the girl's genuine joy for her, she felt touched. \"Thank you!\"</p><br/><p>When she talked about this, Ming Fangfang still had some remnants of alarm. \"When I had first found out I was pregnant, I was frightened. I thought it was Hu Hongda's and I was ready to get an abortion. Halfway through, he found out and told me the truth, then he brought me to the hospital for a detailed check up. From the timeline, it showed that it was indeed his child, so then his parents agreed to us too...\"</p><br/><p>Ning Xi listened to this, her hair raised. Thankfully, Fate would not treat the kind-hearted unfairly. She had finally waited for the arrival of a life and it was coming to fruition.</p><br/><p>\"As for that Fang Ya, I'm too lazy to actually find out how she's doing, but someone did end up telling me that they heard she was being shut out because of her bad reputation, so now she's off to shoot those kind of films...\" When she mentioned Fang Ya again, Ming Fangfang's expression had calmed down much more, as if she had just spoken about a stranger.</p><br/><p>\"I'm very sorry that I misunderstood you then and said all those things to you. Now, I can't drink, so I'll use tea to replace booze and drink to you!\" Ming Fangfang apologized to her with a solemn expression.</p><br/><p>Apart from apologizing, she had even more gratitude. If it were not for Ning Xi who had exposed Hu Hongda's lies back then, she would not have the life she did today...</p><br/><p>Ning Xi quickly returned the toast and said, \"No worries, you weren't aware back then.\"</p><br/><p>Ming Fangfang looked at her a little worriedly as though she wanted to say something, but at last she simply said, \"I wish that you and that person...can get through everything smoothly too.\"</p><br/><p>\"Thank you.\" Ning Xi was a little surprised and she raised her brows. \"I thought you would advise me not to fall for that fatal attraction.\"</p><br/><p>Ming Fangfang laughed, \"If it was me, I probably wouldn't have resisted a man like Lu Tingxiao either. Furthermore, you're a young girl! Besides, I can see that Lu Tingxiao does quite like you. Ever since I've gotten pregnant, I just feel like...anything is possible in this world, isn't it?\"</p><br/><p>\"Of course, I've always thought so!\"</p><br/><p>After hearing a story so full of positive energy, Ning Xi's mood lightened up quite a bit.</p><br/><p>...</p><br/><p>After parting ways with Ming Fangfang, Ning Xi returned to the hotel and prepared for the second day of the business launch. Unexpectedly, she met her at the launching ceremony again.</p><br/><p>\"Miss Ming...no, Mrs. Zhao?\"</p><br/><p>\"I've just come over to take a look, am I not welcomed?\" When she saw Ning Xi's shocked expression, Ming Fangfang teased.</p><br/><p>\"Of course, you're welcome, I'm just a little surprised! You're pregnant. Are you sure it's okay?\" When she chatted with Ming Fangfang yesterday, Ning Xi had just casually mentioned the reason she was in Qingdao and had briefly talked about the launch today, but she did not think that she would come to support her personally.</p><br/><p>\"It's just a little walking. What problems can there be? Don't treat me like I'm made of glass!\" Ming Fangfang was probably nagged by her husband often at home, so she quickly rebuked.</p><br/><p>But how would Ning Xi dare be careless? She quickly held the pregnant lady to support her.</p><br/><p>\"Mrs. Zhao! You're here! Excuse me for not going out to meet you!\" Even the person in-charge of Allstar was humbled and overwhelmed at the sight of Ming Fangfang, so they quickly rushed up to greet her.</p><br/><p>\"I've come to support a friend!\" Ming Fangfang's tone was casual.</p><br/>\n</div>"}