{"title": "Chapter 1130: An Eye For An Eye", "id": 1130, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1130-an-eye-for-an-eye", "volume_title": "Volume 12", "body": "<h1>Chapter 1130: An Eye For An Eye</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1130: An Eye For An Eye</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Actually, I’ve been talking to people from Allstar. They're interested in working with us as well,\" Qiao Weilan said.</p><br/><p>\"Then, why did you ask me to look for Deng Kuan in New Era?\" Ning Xi realized that she did not understand this woman at all.</p><br/><p>\"Boss, if you and Han Momo went to Allstar first, wouldn’t it mean we'd have to give up Allstar and go to New Era instead?\" Qiao Weilan replied.</p><br/><p>Han Momo and Ning Xi were shocked. What Qiao Weilan meant was that she already had a conclusion to put Spirit in Allstar, and not New Era all along! She and Han Momo had been deceived and used by Qiao Weilan!</p><br/><p>Ning Xi was speechless. She had deceived her own boss. The gall of it! She would surely reduce her salary!</p><br/><p>Qiao Weilan realized Ning Xi’s thoughts and laughed, \"Boss, it’s not what you think. The best case scenario is to place our brand in both Allstar and New Era, but since History is interested, we’ll just give them New Era. It’s not a big deal.\"</p><br/><p>Ning Xi’s eyes glowed. She was really touched that Qiao Weilan was fully focused on fighting for Spirit!</p><br/><p>\"Director Qiao, you’re really awesome. If we had gone to Allstar first and History started the price war, we could only hand it over to them. But now that History has chosen New Era, to defeat us, they offered a near zero-profit proposal! This means that the moment History stepped into Hubei province, they've already lost!\" Han Momo was really impressed by Qiao Weilan, totally forgetting about her earlier dissatisfaction towards her.</p><br/><p>History had snatched New Era away with a near zero-profit offer and was probably grinning ear-to-ear happily now, not knowing they had already lost.</p><br/><p>Had it not been for Qiao Weilan, even if History planned to place a store in New Era, they would not have such a healthier profit margin. They would have had to spend a lot and offer a hefty discount to Deng Kuan too!</p><br/><p>\"Director Qiao, how did you know that History would surely come and compete with us?\" Han Momo was still a little confused. Maybe Qiao Weilan could predict the future!</p><br/><p>Qiao Weilan replied, \"History’s current Marketing Director is Qin Zifan and he worked in SF before. During his time there, he used similar tactics to defeat many strong opponents for SF. Since we’re now History’s most threatening opponent, he'll surely do something about us.\"</p><br/><p>\"What if Qin Zifan didn’t go over?\" Han Momo asked.</p><br/><p>Qiao Weilan looked at Han Momo like she was a silly girl. \"If he didn’t, then both New Era and Allstar will be ours.\"</p><br/><p>\"Awesome! Really impressive! Now, I know what a real tactic is!\"</p><br/><p>\"I think I have to treat Owner Qin to another meal…\" Ning Xi smiled.</p><br/><p>An eye for an eye. Qiao Weilan had thought a step further than Qin Zifan.</p><br/><p>Qiao Weilan was not really keen on New Era anyway. Most of the clothing brands there were proposed by Deng Kuan, which meant that New Era never really had a luxury clothing store before, so the market potential there was low.</p><br/><p>As for Allstar, they started taking in luxury clothing brands many years ago and were probably the earliest in the Hubei province to do so, which made Allstar popular with high-spending potential customers.</p><br/>\n</div>"}