{"title": "Chapter 1145: No One Leaves Tonight", "id": 1145, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1145-no-one-leaves-tonight", "volume_title": "Volume 12", "body": "<h1>Chapter 1145: No One Leaves Tonight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1145: No One Leaves Tonight</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi reacted as if she had heard a joke. Her lips curled. \"So? Should I help you call the police?\"</p><br/><p>\"You...\" The few men looked at each other and were so pale. They found themselves tongue-tied.</p><br/><p>When the three men had been drunk, they had bragged that they were the number one criminal gang on the police's red files and had even boasted about how many policemen they had killed in pursuits. For this level of fugitives, even if they were caught, they would immediately be executed by a firing squad. How would they dare to call the police!?</p><br/><p>Underground casinos, kidnap and extortion, rape attempts, and sheltering fugitives! All of them would be behind bars!</p><br/><p>The few of them looked at each other and came up with a conclusion. The woman before them was even more terrifying than the three rogues, so their best plan was to run away!</p><br/><p>Thus, they started to flee...</p><br/><p>Before they could run out, a woman's cold voice was heard from behind them.</p><br/><p>\"Stop right there.\"</p><br/><p>All of them froze.</p><br/><p>\"Did I allow you people to leave?\" The woman's tone was like a call from hell. They were so frightened that they shuddered.</p><br/><p>Ning Xi lowered her gaze. Her eyes were filled with an animalistic darkness and blood-thirsty excitement before a hunt. She had intentionally not called the police and came here alone. There was no way she would allow them to leave so easily...</p><br/><p>No one was allowed to leave tonight!</p><br/><p>Ning Xi's deadly gaze swept across those people. \"Earlier, who else touched her?\"</p><br/><p>\"No! No! I didn't!\"</p><br/><p>\"I didn't either!\"</p><br/><p>\"I swear I didn't touch a single hair of hers! Earlier, it was all of them who caught her and her brother!\"</p><br/><p>...</p><br/><p>In that instant, everyone started to panic and swear that they were not involved, almost swearing on all 18 generations of their ancestors.</p><br/><p>Ning Xi's gaze slowly fell on the rat-faced man hiding behind several people and trying to sneak off. Earlier, when that tattooed man was tearing apart Keer's clothes, it was he who had helped hold Keer down...</p><br/><p>When the man noticed Ning Xi's attention on him, he knew things were about to take a bad turn, yet before he even had the time to escape, there was a loud thud on his face.</p><br/><p>In the next second, a loud wail followed and the man's wrist turned into a bloody mess as he rolled on the floor from pain.</p><br/><p>\"Damn it, you witch! I will kill you!\"</p><br/><p>That man's evil bellow came from his guts. He suddenly cursed loudly and then took out his handgun, yet the instant he held it up, it was smacked down by the butt of Ning Xi's gun and he covered his hand as he rolled on the floor and wailed again.</p><br/><p>The speed of her gun was inhumanely fast!</p><br/><p>\"Beautiful, spare our lives!\"</p><br/><p>\"Big Sis, spare our lives! We didn't even touch your friend at all!\"</p><br/><p>\"Really, trust us!\"</p><br/><p>....</p><br/><p>Those with guns had been crippled. Forget about those unarmed, now all of them did not even bother to resist. The remaining few just fell to the ground, kneeling one after another.</p><br/><p>Unfortunately for them, Ning Xi did not look like she was planning to let them off the hook. The murderous air around her had grown stronger as the gun in her hand pointed straight at the rat-faced man's head.</p><br/><p>Now that the two of his hands were crippled, he had no means of resisting. It was like slaughtering a sheep.</p><br/>\n</div>"}