{"title": "Chapter 1146: Xiao Xi, Calm Down!", "id": 1146, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1146-xiao-xi-calm-down", "volume_title": "Volume 12", "body": "<h1>Chapter 1146: Xiao Xi, Calm Down!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1146: Xiao Xi, Calm Down!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Big Sis! I'm wrong! I'm really wrong! I don't know anything! I'm just a nobody that runs errands for others. I will do whatever the boss says! When settling disputes, you shouldn't involve third parties. All of this is unrelated to me...\" That rat-faced man was engulfed by fear at this point and he started to beg for his life as he saw the gun pointed at him.</p><br/><p>\"You touched her.\" The woman's expression did not falter.</p><br/><p>That gaze! She really wanted to kill him!</p><br/><p>\"I didn't! I didn't! I just held down the girl's hands...no, no, no...I didn't mean to...please spare me my life...please...\" The man's legs were shaking so badly at this point. There was stinky, yellow liquid dripping from the crotch of his trousers. He was so scared that he had actually peed his pants.</p><br/><p>Ning Xi did not have the patience to listen to his nonsense. Instead, the viciousness in her eyes was losing control from his clamor. Her head kept replaying that image of Zhuang Keer being pushed down by that man to be violated. That image...it was slowly melding with that scene from five years ago...</p><br/><p>Her headache felt like it would split her skull. At the same time, it was getting harder for her to hold back...</p><br/><p>Ning Xi left her finger on the trigger. She slowly increased its pressure, about to pull the trigger in the next second...</p><br/><p>At that moment, a pair of soft and warm arms hugged her from the back, breaking through her foggy mind. \"Xiao Xi! Enough! Enough! Calm down! I'm alright! I'm alright! Look at me! Xiao Xi! Calm down okay? Xiao Xi, Xiao Xi...\"</p><br/><p>The girl's anxious and worried voice rang in her ear.</p><br/><p>Ning Xi's rigid spine gradually softened and the bloodlust in her eyes had slowly extinguished as well, returning to a dim calmness.</p><br/><p>Just as Ning Xi put down her gun, the gangsters quickly grabbed the opportunity and ran out.</p><br/><p>From the corner of her eye, Ning Xi caught a glance of them and she raised a hand to fire near one of the guy's foot as he held a box in his arms. The man cried out and was so frightened that his soul almost left him. He respectfully delivered the box to the monster, then stumbled off...</p><br/><p>He thought to himself, \"Damn it! That was five million! Never mind! It was more important to stay alive.\"</p><br/><p>That box was the five million that Zhuang Keer had spent the night gathering.</p><br/><p>\"We've got the money back. Xiao Xi, let's leave this place quickly!\" Zhuang Keer was afraid that something else would happen, so she quickly urged.</p><br/><p>\"You guys leave first, I need to clean up the place,\" said Ning Xi.</p><br/><p>\"But you...\" Zhuang Keer was obviously worried about leaving her alone.</p><br/><p>\"Go.\" Ning Xi's gaze was gentle but resolute as she patted Zhuang Keer's shoulder, then her eyes shot to Zhuang Rongguang. \"Come here, hold your sister!\"</p><br/><p>\"Oh...\" Zhuang Rongguang got up in a flurry, and because he walked too hastily, he was tripped by the body of the man with the gold chain and almost fell. He made his way to Zhuang Keer and carefully helped her out of the store.</p><br/><p>Ning Xi cleaned up all traces of her at the scene before calling the police.</p><br/><p>Usually, in such a situation, the police would just think that there had been a gang fight and a deadly brawl. Besides, when she fought with them, she noticed that the three leaders were not common rogues. They had an accent from the drug paradise, Golden Triangle, and were most likely deadly fugitives...</p><br/><p>How had Zhuang Rongguang provoked these sort of people?</p><br/><p>Ning Xi did not think further. She quickly left the scene and disappeared into the night...</p><br/><p>...</p><br/>\n</div>"}