{"title": "Chapter 1158: I Deserve It", "id": 1158, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1158-i-deserve-it", "volume_title": "Volume 12", "body": "<h1>Chapter 1158: I Deserve It</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1158: I Deserve It</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Yes!\" The young man replied in a determined tone. His expression did not look like he was joking.</p><br/><p>\"Why do you suddenly have this thought? How can I believe that you’re not just acting at the spur of the moment or...is this just a bad joke?\" Zhuang Liaoyuan’s expression looked serious.</p><br/><p>The young man clenched his teeth. \"Father, I’m serious about it. As for why, you know that I've never really had any huge ambitions. I just don’t want people around me to worry about me. I also hope that I can protect the people I love if anything happens. I want to be someone you can rely on, and not just someone to be protected.\"</p><br/><p>Zhuang Liaoyuan was truly surprised by his son’s words.</p><br/><p>If Zhuang Rongguang said something like \"I want to protect my country and make my family proud\", he would never believe it.</p><br/><p>But yet he had uttered these.</p><br/><p>As Zhuang Liaoyuan was thinking it through, Zhuang Rongguang took out a scary long whip and gave it to his father. \"Father, I actually wanted to follow sister’s advice and hide it from you, but I can’t just let it be.\"</p><br/><p>The young man’s body trembled as he remembered what happened last night. \"Last night, I tried to get money on my own to leave the house, so I listened to Sun Bin and Liang Haoqiang. I went to the casino and was cheated. I lost five million dollars.\"</p><br/><p>\"What did you say!?\" Zhuang Liaoyuan smacked the table furiously as his expression changed.</p><br/><p>Zhuang Rongguang put the whip on the table and continued, \"They aren’t local and there were a lot of them. I was actually expecting Sun Bin and Liang Haoqiang to come back with the money to save me but in the end, they abandoned me…\"</p><br/><p>\"Expecting the two of them to save you…\" Zhuang Liaoyuan’s expression darkened. \"How can my son be so stupid?\"</p><br/><p>\"I did something even more stupid afterwards.\" Zhuang Rongguang’s voice went hoarse. \"I dared not call home. Without any more ideas, I called Sis…\"</p><br/><p>\"You bastard!\" Zhuang Liaoyuan threw his teacup away as uneasy thoughts suddenly floated in his mind. He freaked out. \"What happened to your sister last night?! Tell me!\"</p><br/><p>If something had not happened to Keer, there was no way he would change so drastically all of a sudden!</p><br/><p>With his experience, he could easily imagine what had happened last night. The moment he thought about what Keer might have gone through, his mind went haywire…</p><br/><p>\"Sis brought the money over but they did not fulfill their promise. They wanted her...to stay with them for the night…\"</p><br/><p>In the next moment, Zhuang Liaoyuan whipped the young man harshly. Zhuang Rongguang fell to the floor.</p><br/><p>The door was opened from outside. Zhuang Keer rushed in and stopped her father from hitting Zhuang Rongguang. \"Rongguang! Didn’t I tell you not to tell Father!? What happened to you!?\"</p><br/><p>Zhuang Rongguang’s face went pale from the pain. \"Sis...I don’t want to hide behind you anymore...I’ll be responsible...I deserve it…\"</p><br/>\n</div>"}