{"title": "Chapter 1169: Have To Trouble You", "id": 1169, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1169-have-to-trouble-you", "volume_title": "Volume 12", "body": "<h1>Chapter 1169: Have To Trouble You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1169: Have To Trouble You</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Meng Linlang replied unhappily, \"We have a guest, so of course, I must cook a few dishes to show my sincerity!\"</p><br/><p>\"Yes, we have a guest. At least, she knows that you want to thank her, or else, she'd think you want to repay with revenge!\" Zhuang Rongguang mumbled.</p><br/><p>Meng Linlang immediately shot him a look. Even though she was angry, there was still love in her eyes. \"You brat!\"</p><br/><p>Keer leaned into Ning Xi's ears and laughed as she explained, \"My mother's not great at cooking...\"</p><br/><p>\"Ahh...\" There was indistinct envy in Ning Xi's eyes as she watched at the interaction between Madam Zhuang and her children.</p><br/><p>\"Xiao Xi, have fun with Keer and Rongguang for a while. Dinner will be ready soon!\"</p><br/><p>\"Okay, don't worry about me!\"</p><br/><p>...</p><br/><p>Moments later, dinner was ready.</p><br/><p>On the roundtable, the Zhuang family was gathered at an unusual occasion.</p><br/><p>Zhuang Liaoyuan picked up his wine glass and stood up first. \"Xiao Xi, a toast to you!\"</p><br/><p>Ning Xi was overwhelmed by this and quickly stood up with her glass too.</p><br/><p>\"Sis Xi, I want to drink to you too. Bottoms up for me but you can do as you wish! You're a girl, don't drink too much!\" Then, Zhuang Rongguang downed his drink.</p><br/><p>Ning Xi laughed as she shook her head. He finally remembered that she was a girl.</p><br/><p>Then, Zhuang Keer and Meng Linlang all offered her a toast too.</p><br/><p>Finally, it was Elder Chief Zhuang's turn. Before he got up, Ning Xi quickly stood up and said, \"Elder, if you do that, I really don't deserve this!\"</p><br/><p>The entire meal was very cheerful, probably because the woman of the house was back, so the entire atmosphere was much warmer.</p><br/><p>During dinner, Men Linglang liked Ning Xi the more she talked to her. She even pushed her own children away and forced Ning Xi to take home all the gifts she had brought home. She almost gave her the jade bangle on her wrist too, but it was turned down gracefully by Ning Xi. She only took home gifts like local specialties which impressed her enough.</p><br/><p>It was already very late. At last, Zhuang Liaoyuan delegated his security guards to send her home.</p><br/><p>After Ning Xi left, in the master bedroom, Meng Linlang looked to her husband and muttered, \"Is Xiao Xi really Lingyu's daughter?\"</p><br/><p>\"Mmm, I've investigated it thoroughly. I can't be wrong,\" Zhuang Liaoyuan lit a cigarette and said confidently.</p><br/><p>Meng Linlang's gaze was cold. \"Who would have thought that that isolated sister could give birth to such a wonderful daughter!? Thankfully, because she grew up in the village, she's so obedient! If she had been left beside her to be raised, I'm not sure how she would've turned out!\"</p><br/><p>\"It's best to speak less about it!\" Zhuang Liaoyuan sighed.</p><br/><p>\"I still think there's something fishy about Ning Xi being shunned out of the Ning family. In fact, it might be related to that adopted daughter...\" Meng Linlang muttered, then she asked, \"What's the elder planning to do? Are we going to accept her as kin? Then, the Ning family made a poor judgment and can't differentiate good from the bad. It's fine if we don't know, but we can't just sit back and not care even we do!\"</p><br/><p>\"The elder said that he's still not over the incident from years before, but he loves Ning Xi and told me to take good care of her!\" Zhuang Liaoyuan said.</p><br/><p>\"Of course, we must! The Zhuang family isn't watching Ning Xi because she was born from her womb, but because we really like this child, there are no qualms about it!\"</p><br/><p>Once his wife put it like that, Zhuang Liaoyuan felt light-hearted and everything became clear at once. \"You're right.\"</p><br/><p>Meng Linlang was still worried. \"You old man, what do you know about taking care of people? You even wanted to recruit such a delicate girl into the military! The report I submitted should be done soon. Wait for me to return, then I'll handle this!\"</p><br/><p>Zhuang Liaoyuan laughed, \"I'll have to trouble you then, my wife!\"</p><br/>\n</div>"}