{"title": "Chapter 1174: Nothing, On Abstinence. Training", "id": 1174, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1174-nothing-on-abstinence-training", "volume_title": "Volume 12", "body": "<h1>Chapter 1174: Nothing, On Abstinence. Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1174: Nothing, On Abstinence. Training</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Moreover, this design was specifically made to counter us by using one extreme concept to counter another... Who could it be?\" Gong Shangze clenched his fists in frustration.</p><br/><p>Ning Xi did not know much about fashion design but as a woman, she knew when she saw a good one. Truthfully, she really loved Black Religion. If it was not from History themselves, she would have laid her hands on one.</p><br/><p>\"Boss, give me some time.\" Gong Shangze looked serious.</p><br/><p>\"I believe in you.\" Ning Xi smiled. It seemed like Gong Shangze had met his opponent. After all, it was not really a bad thing since competition drove the best to the maximum potential.</p><br/><p>Still, Ning Xi was curious as well. Which expert had History hired to go up against Spirit? Like Gong Shangze said, Black Religion was specifically made to counter Spirit, by attacking Spirit's extreme design style…</p><br/><p>…</p><br/><p>After she left the company, Ning Xi was feeling annoyed and wanted to release her stress. Black Religion probably reminded her of someone else. A person she had met before had the aura that matched the black gothic elements perfectly.</p><br/><p>She then made a phone call.</p><br/><p>\"What's up?\" A lazy voice came through the phone.</p><br/><p>\"God, what are you doing?\" Ning Xi smiled amusedly.</p><br/><p>\"Nothing, on abstinence. Training.\"</p><br/><p>Ning Xi was speechless.</p><br/><p>\"Han Xiao, please talk properly. If not, I'm going to slap you hard,\" Ning Xi scolded him.</p><br/><p>\"How much do you hate your hand? Aren't you afraid that it might break after slapping me?\"</p><br/><p>\"Stop trash talking. God, please teach me a few skills,\" Ning Xi said.</p><br/><p>\"Does this count as returning you the favor the last time?\"</p><br/><p>\"Nope…\" It was really difficult for him to owe her a favor, so she was not going to let him off so easily.</p><br/><p>\"Oh, I'm not going then.\"</p><br/><p>\"God, don't be like this. I'll treat you to a meal at KFC!\"</p><br/><p>\"Where are you? I'll be there!\"</p><br/><p>Ning Xi was speechless again.</p><br/><p>…</p><br/><p>If someone were to offer him a meal, Han Xiao would surely be there. He would not even be late for half a second. KFC was his favorite!</p><br/><p>Looking at the way Han Xiao ate and his enormous appetite, Ning Xi shook her head. He wasted the beautiful face he was born with.</p><br/><p>\"5 more Orleans baked chicken wings!\" Han Xiao called out.</p><br/><p>\"Stop eating. I'll bring you to a nice place.\"</p><br/><p>Before he could finish, Ning Xi dragged Han Xiao away and into her car.</p><br/><p>A while later, at a Taekwondo center, Han Xiao looked around in confusion. \"This is the nice place you mentioned?\"</p><br/><p>\"Come on, God, teach me a few skills!\"</p><br/><p>Ning Xi looked at him admiringly. Although this guy was mad, he was a powerful fighter.</p><br/><p>Every time she trained with Second Senior Brother, she was criticized again and again. She wanted to learn something new to counter him!</p><br/><p>\"I'm not interested in fighting in front of these trash.\" Han Xiao flopped down on the floor lazily.</p><br/><p>\"Kid, who did you just call trash?\"</p><br/><p>The next moment, a few big guys went up to him. The one who had spoken was a fat guy. Judging by his body size, he probably weighed about 120 kilograms.</p><br/><p>\"I'm sorry... My friend is just kidding,\" Ning Xi explained.</p><br/><p>\"It's none of your business!\" The fat man pushed Ning Xi away roughly.</p><br/><p>\"Kid, I'm talking to you. Who did you call trash?</p><br/><p>They surrounded Han Xiao menacingly. Han Xiao looked perplexed as he scanned around and looked at the fat man. \"I'm not targeting anyone. I'm just saying that everyone here is trash. I'm not just talking about you, don't be angry.\"</p><br/>\n</div>"}