{"title": "Chapter 1177: Compete", "id": 1177, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1177-compete", "volume_title": "Volume 12", "body": "<h1>Chapter 1177: Compete</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1177: Compete</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At Spirit's Headquarters, when Ning Xi rushed back, Gong Shangze and the national artist, Song Jin, were having an intense discussion. Since Song Jin had agreed to collaborate, he had been experimenting new things with Gong Shangze, but because of Black Religion's sudden appearance, the two had to make some changes to the initial design.</p><br/><p>\"Elder Song! You're here!\" When she saw Song Jin, Ning Xi quickly greeted him respectfully.</p><br/><p>Song Jin nodded. \"I already know about Black Religion.\"</p><br/><p>\"What do you think, Elder Song?\" Ning Xi asked for Song Jin's opinion.</p><br/><p>\"Mmm...not bad, it has a very strong artistic feel to it, but since we are competing on style, it's not like we're at a dead end.\" Song Jin smiled and looked confident.</p><br/><p>Gong Shangze looked emotional as well as he led Ning Xi to the sample room. \"Boss, take a look at this!\"</p><br/><p>The sample room had numerous clothes in various designs that could dazzle a person, but the instant Ning Xi stepped into it, there was only one dress in her line of sight.</p><br/><p>As she gawked at the white gown that seemed like clouds of immortality lingered around it, Ning Xi was stunned for a few seconds before she reacted. There was an exclamation of admiration and excitement that she could not hide in her voice. \"This is...\"</p><br/><p>Song Jin touched the beard on his chin and said meaningfully, \"This is Luoshen [1].\"</p><br/><p>\"Luoshen?\" Ning Xi's eyes lit up. \"Is that the name of this dress? It's very fitting!\"</p><br/><p>Ning Xi's head instantly recalled the phrase in \"Luoshen Fu\".</p><br/><p>\"Light as a frightened goose, graceful as a swimming dragon with the glory of the autumn chrysanthemum, dense with spring pines; like the soft clouds shielding the moon, floating like the snow returning to the wind; looking from afar, bright as the break of dawn; running swiftly to see it, luminous like lotus emerging from clear waters...\"</p><br/><p>It was perfectly suitable!</p><br/><p>This gown named Luoshen used the phoenix as its main motif and complemented it with mystical clouds, exhibiting the beauty of China's classic mythologies and expressing the aura of \"immortality\" and mystery, creating a striking comparison to Black Religion.</p><br/><p>In fact, it gave people the yearning for bountiful goodness...</p><br/><p>A flower in a world, a leaf in pursuit. A song and a sigh, a life for the one.</p><br/><p>The point was from the style to the meaning behind it, Luoshen was entirely created to go against Black Religion.</p><br/><p>\"Way awesome! If it's this piece we're talking about, it can definitely compete with Black Religion!\" Ning Xi said excitedly.</p><br/><p>Gong Shangze did not relax. He continued, \"'I'm just worried that the other designer hasn't even expressed their full potential...so, I can't be careless! The other side will probably have even more amazing work coming up.\"</p><br/><p>He had never met someone who could make him feel such distress. It was not sure whether that person was only temporarily putting out the fire at History or had they been taken in.</p><br/><p>If it was the latter, then that would make the situation stickier...</p><br/><p>...</p><br/><p>On the other end, at History's headquarters, after Han Xiao returned, he did not sit around and had taken the initiative to create new designs, which was a pleasant surprise to Ning Xueluo.</p><br/><p>In the design department, Han Xiao called David over and said with fire in his eyes, \"David, I need a large amount of cloud-pattern brocade!\" </p><br/><p>\"Cloud-pattern brocade?\" David was stunned.</p><br/><p>As a designer himself, he obviously knew that cloud-pattern brocade was a traditional Chinese woven handicraft and held the title of \"every inch is gold\". It was said to have close to 1,700 years of history.</p><br/><p>During the ancient times, the brocade represented the highest form of textile. Many generations of emperors' daily clothing were made of it, so it was highly rare and treasured.</p><br/><p>Translator's Thoughts</p><br/><p>Daoist7 Daoist7</p><br/><p>[1] Luoshen - the name of \"Goddess of the River Luo\", who was a deity in ancient China</p><br/>\n</div>"}