{"title": "Chapter 1200: Spend Money Like Nothing!", "id": 1200, "volume": 12, "url": "http://boxnovel.org/hidden-marriage-chapter-1200-spend-money-like-nothing", "volume_title": "Volume 12", "body": "<h1>Chapter 1200: Spend Money Like Nothing!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1200: Spend Money Like Nothing!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>One...one hundred million dollars?!</p><br/><p>The auctioneer almost mistakenly flung his hammer in sheer shock. After he calmed himself down, he took a deep breath. \"Eight...number eight just offered $ 100 million! Mr. Eight offered $ 100 million! Gosh!\"</p><br/><p>Many people who attended the auction were anonymous, and number eight was one of them, so the auctioneer only knew that the bidder was a man. He did not know anything else about him, hence the auctioneer merely addressed him by his number.</p><br/><p>There was a dead silence across the room. After a while, the crowd returned to their senses. Some people even stood up and strained to look back at the quiet corner, but they could only see a dark figure sitting there alone. The light was too dim to see his face, so they could only see his elegant pale white hand…</p><br/><p>\"Wow! Did I hear wrongly? $ 100 million? Did someone just offer $ 100 million? Is he crazy? Who exactly in Imperial has this amount of wealth to waste? Moreover, is this how you're supposed to bid? This is like throwing money away!\"</p><br/><p>\"It's as though money is nothing to him! $ 100 million, just for an accessory!\"</p><br/><p>\"Wait! This isn't right... If I'm not wrong, number eight is the one who raised the offer? Wasn't number eight with the new artiste called Ning Xi just now?\"</p><br/><p>\"Right! I remember as well! He was raising the price dollar by dollar for an earlier item, then suddenly his bid has now jumped to $ 100 million! What's happening!?\"</p><br/><p>…</p><br/><p>Not just the crowd, the auctioneer himself was startled. After being an auctioneer for so many years, it was his first time seeing an auction like this. The price had leaped from $ 60 million to $ 100 million as if money meant nothing to him!</p><br/><p>In the end, the host wiped the sweat off his forehead while he went up to remind the auctioneer to continue his job. He took a deep breath.</p><br/><p>\"Everyone, please settle down, settle down. The auction is still in progress! Just now, Mr. Su offered $ 60 million before the third call, but it's not validated yet, and now guest number eight has offered the crazy high price of $ 100 million for the crown ew know as 'Queen'! Yes! $ 100 million! Anyone else going to challenge this bid?\" The auctioneer rattled this off in a single breath out of excitement.</p><br/><p>He actually bid for an item at a price that was ridiculously higher than the original price. This would definitely be one of the proudest moments of his career!</p><br/><p>The crowd returned to pin-drop silence after the auctioneer's short speech.</p><br/><p>The auctioneer glanced at Su Yan. Because he thought the crown was already his, his expression darkened. Having his item being snatched away all of a sudden and at such a high price, anyone would feel unhappy about it…</p><br/><p>Ning Xueluo felt embarrassed, then she turned to Chang Li. \"What happened? Isn't number eight one of your men?\"</p><br/><p>Chang Li was really confused but she had to be honest with her right now. \"N-no... Actually, I've been meaning to tell you just now. Number eight isn't one of ours... I don't know who he is as well…\"</p><br/>\n</div>"}