{"title": "Chapter 1209: Didn't You Want To Do Business In Bed? I'll Satisfy Your Wish!", "id": 1209, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1209-didnt-you-want-to-do-business-in-bed-ill-satisfy-your-wish", "volume_title": "Volume 13", "body": "<h1>Chapter 1209: Didn't You Want To Do Business In Bed? I'll Satisfy Your Wish!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1209: Didn't You Want To Do Business In Bed? I'll Satisfy Your Wish!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The movie had not even been released yet, but Lu Tingxiao had already gotten a copy of it. Clearly, he had done it all for her.</p><br/><p>Ning Xi was moved as she sighed, \"Such a lovely person beside me, yet here we are, watching Liang Biqin's movie... This is too much of a waste...\"</p><br/><p>\"Then, what would you like to watch?\"</p><br/><p>Ning Xi suddenly thought of something and smiled sneakily as she stroked her chin.\"We should watch some romantic action movie or something like that... Wouldn't that be better for the mood?\"</p><br/><p>The man looked down at her and said, \"Do you really think that with you by my side, I'd still need to watch such movies?\"</p><br/><p>Ning Xi was speechless.</p><br/><p>Devil, your pick-up lines are increasing in depth...</p><br/><p>She realized that every time she teased him now, the favor would be returned.</p><br/><p>She coughed, \"Let's just watch the movie!\"</p><br/><p>After close to two hours into the movie, Ning Xi had finished it without fast-forwarding any parts. To be honest, Ning Xi thought that it was not as bad as she had imagined.</p><br/><p>Even though this movie Liang Biqin had acted in did not have a script as epic as Chen Mian's, the storyline was still quite strong and it had quite an original theme too. Otherwise, Ning Xi would not have taken interest in it back then.</p><br/><p>After all, with the script and all that money thrown in, the effects were commendable. Apart from noticing the obvious traces of the stunt doubles and Liang Biqin's slightly awkward acting through her professional lens, there was not too much damage done.</p><br/><p>Supported by the huge amount of money used for promoting the movie, and with all the big shots involved in it, they would definitely profit at the box office! Then again, that was inferred based on the perspective of the mass audience. Of course, if she were to honestly speak her personal perspective and standards, this was trash. The actors' acting was not mindful throughout; even the experienced actors were obviously not in the zone. They were practically fooling around, and it made her mad to see their quality of acting.</p><br/><p>However, movies were shot like that nowadays. Even if there was poor quality, it would still rack up ticket sales based on marketing and the celebrity effect. This also created the phenomenon whereby directors and investors cared more about the popularity of actors rather than their talent.</p><br/><p>\"Boss, what do you think about Liang Biqin's movie?\" Ning Xi asked Lu Tingxiao's opinion, cocking her head sideways.</p><br/><p>However, when she heard no reply, she looked up and met his eyes...</p><br/><p>Uhh, had he been not watching the movie all this while and been staring at her instead?</p><br/><p>Okay, the devil's reaction seemed to have summed up his views about this movie. It was not interesting at all to him...</p><br/><p>\"Mmm, Big Boss, when Chen Mian called me yesterday, he even asked if you and I have been... Um, by you, I mean Ke Mingyu... He asked me if I've been in contact with you! It sounded like he wanted to introduce an agent to you!\" Ning Xi muttered.</p><br/><p>\"I'll arrange it later on,\" said Lu Tingxiao.</p><br/><p>When Ning Xi heard his reply, her eyes instantly lit up. \"You...you want to get an agent? Does this mean that you won't disappear right after finishing this movie and that I'll still have a chance to act with you in the future?\"</p><br/><p>Lu Tingxiao looked at her glassy-eyed. \"Didn't you want to do business in bed? Your wish is my command.\"</p><br/><p>Damn it! The devil's taunting is so dirty!</p><br/><p>Ning Xi threw herself on him and wailed, \"My God! Previously, when I told Jiang Muye that I wanted to keep you as a mistress, he mocked me by saying that I would need to wait for my next life! Who would have thought that I'd get this chance in this lifetime?! My darling, I love you so much!\"</p><br/>\n</div>"}