{"title": "Chapter 1206: Preparing A Gift", "id": 1206, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1206-preparing-a-gift", "volume_title": "Volume 13", "body": "<h1>Chapter 1206: Preparing A Gift</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1206: Preparing A Gift</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"What?!\" Lu Jingli's eyes flew wide open. \"Ex...ex-boyfriend? This guy is Xiao Xi Xi's ex-boyfriend? How do you know?\"</p><br/><p>Lu Tingxiao did not say anything and just returned to his documents.</p><br/><p>For him to use $ 100 million this easily and to display that erratic behavior…</p><br/><p>He did not even need to investigate to know who it was.</p><br/><p>Ning Xi had once said that that man had only been in a relationship with her for a day.</p><br/><p>Even if Ning Xi once liked him or was even in love with him, it was all in the past...</p><br/><p>Lu Jingli was impressed at how calm his brother was. \"Right, both number eight and Su Yan are just her exes. No matter what they do, you're still the current one! Hehehe…\"</p><br/><p>After he looked through the last document, Lu Tingxiao picked up his coat and was about to leave.</p><br/><p>\"Er, Bro, where are you going?\" Lu Jingli asked.</p><br/><p>\"To prepare a gift.\"</p><br/><p>\"Huh? You're going to give Xiao Xi Xi a gift? What are you giving? You don't need me to pick for you?\" Lu Jingli was a little disappointed, but at the same time he was also curious, could his brother have something better for Xiao Xi Xi?</p><br/><p>…</p><br/><p>On the other hand, after the dinner ended, Ning Xi let Xiao Tao go home first, then she sent Annie a text message and asked her out for a meeting.</p><br/><p>Although $ 70 million for the crown went to charity, $ 30 million was not a measly amount either. It was a gift from someone, so it would be inappropriate for her to donate it right away on stage, hence she had taken it with her. Now, she could only ask Annie to return it back.</p><br/><p>She knew this money was worth near to nothing to a certain someone. She also knew he would never take back something he gave, but she had her own principles. She already had the devil, so of course, she would not take anything given by another man.</p><br/><p>Although that person was not considered a man or even a human by her…</p><br/><p>Before she met Annie, she purposely went back and took the huge diamond with her as well as the gift for Annie she had prepared beforehand.</p><br/><p>...</p><br/><p>Inside a guest room within a restaurant.</p><br/><p>\"Bro Xi!\" Annie was really thrilled to see Ning Xi.</p><br/><p>\"This is for you.\" Ning Xi gave her a pink plastic bag.</p><br/><p>Annie saw the cute cartoon-shaped biscuits inside the bag and her eyes brightened. \"Wow! How cute! Are these for me? Where did you get them?\"</p><br/><p>\"I made them myself. I hope you'll like it.\"</p><br/><p>\"What? Bro Xi, you made them yourself? I really like them! Thank you so much!\" Annie hugged them protectively. She did not expect Bro Xi to be able to make something this cute, so she was pleasantly surprised.</p><br/><p>\"I should be thanking you. Your prescription for my grandfather the last time was really effective,\" Ning Xi said.</p><br/><p>\"It's nothing, really. Bro Xi, you came looking for me... Is there something else you wanted to see me about?\" Annie asked.</p><br/><p>Ning Xi glanced at her. \"Do you know what happened today?\"</p><br/><p>Annie was hesitant to speak up but did anyway, \"Actually, I'm not too sure myself. I just know that Boss, Bro Ye, and Sis Xiao Xiao went out together. They seemed like they were going to look for you... Did you guys meet?\"</p><br/><p>Ning Xi's mouth twitched. Even First Senior Brother and Third Senior Sister had been there? What were they trying to do?</p><br/><p>Ning Xi scowled. \"Actually, I have a favor to ask of you. There are two things I'd like to return to Satan! Knowing him, he probably wouldn't want it, so just put them back in his room quietly for me. I wanted to go in person, but well, I really don't feel like going to where you guys are staying at again…\"</p><br/>\n</div>"}