{"title": "Chapter 1211: Over This Time", "id": 1211, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1211-over-this-time", "volume_title": "Volume 13", "body": "<h1>Chapter 1211: Over This Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1211: Over This Time</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Cui Zhihao suddenly thought of something and revealed a questioning look. \"Wait, Director Zheng, there's something I don't quite understand. Wasn't the initial release date decided to be next month? Why did you suddenly move it forward to this month?\"</p><br/><p>\"Haha, I'm not sure if you've heard that Chen Mian has released a new movie recently?\" Zheng Kangde asked meaningfully.</p><br/><p>Cui Zhihao recalled for a moment before replying, \"Director Chen, aye. Obviously, I know about it. I was shocked earlier because I haven't heard anything for a while, then he suddenly came out with a new movie and I especially noticed that he had used an entire cast of newbies!\"</p><br/><p>Zheng Kangde chuckled, \"Director Chen's movie coincides with ours. The theme is also youth comedy and it's also about a woman in man's clothing. Director Chen's fame really intimidates me!\"</p><br/><p>The audience always had the impression of the first mover being the stronger, so with two movies with the same theme, they would be more inclined towards watching the first movie.</p><br/><p>Even though Zheng Kangde put it that way, he was actually saying it with a tone of mockery and nonchalance.</p><br/><p>Cui Zhihao instantly understood Zheng Kangde's intentions. All these years, he had been overpowered by Chen Mian, but now it looked like he was ready to overthrow him with this great opportunity!</p><br/><p>Despite the concept of the first mover advantage, he could space out more time in between so that he could release his movie before Chen Mian because similar themes would cause a contest for the audience.</p><br/><p>However, Zheng Kangde had intentionally planned for it to be released only two days before Chen Mian's movie. Now, they were releasing it at almost the same time, so clearly, he was ready to steal Chen Mian's entire target market and crush him!</p><br/><p>Chen Mian's movie had neither big shots nor huge supporters behind it, so how could it fight with Zheng Kangde's?</p><br/><p>This would practically result in a stalemate...</p><br/><p>Cui Zhihao shook his head and said, \"Hah, Chen Mian is indeed great, but his performance at the box office for the past few years has been going downhill and that's the truth! It's almost impossible for him to return to his glory days! Now, he's even independently produced this movie with such a small capital. Did he really think that he's still the Chen Mian from ten years ago? Is the movie market still the same one from ten years ago? Director Chen is really confused silly this time. All the fame he's accumulated for all these years will be ruined by this movie...\"</p><br/><p>\"I wonder how you're preparing to arrange Director Chen's screening frequency?\" Zheng Kangde served Cui Zhihao another drink and pretended to ask casually.</p><br/><p>Cui Zhihao gave him a knowing look. \"Naturally, I'll make arrangements as it should be. Our cinema is not a charity organization. Everyone's here to make money for a movie that obviously won't hold up in the box office. At most, it'll only get 10% of screen time even if it had Chen Mian's reputation on it...\"</p><br/><p>...</p><br/><p>When they finished discussions, the two continued to drink and chit chat, at last both sides had left satisfied.</p><br/><p>Liang Biqin said excitedly, \"Director Zheng, you're amazing! With such a high screening frequency, our box office would definitely be great!\"</p><br/><p>When the trailer had been released, because of the actors' popularity, there were many praises and anticipating fans, but there were also many who criticized it for being stupid and melodramatic, she was initially a little worried...</p><br/><p>\"Haha, of course! Don't overestimate the audience's taste nowadays. The age of cinema-goers is getting younger, so they won't know what's great or not. They just watch movies for the hype and they'll watch whatever is available to them!\" Zheng Kangde said with a confident expression.</p><br/><p>Liang Biqin nodded trustfully at Director Zheng's words. Of course, what made her feel most satisfied was that Chen Mian's wonder years were up!</p><br/>\n</div>"}