{"title": "Chapter 1222: Beyond Imagination", "id": 1222, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1222-beyond-imagination", "volume_title": "Volume 13", "body": "<h1>Chapter 1222: Beyond Imagination</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1222: Beyond Imagination</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the past, during a period when the Internet had yet to be common, the public could only receive messages through newspapers, television, and radio stations, and these sort of media could easily be controlled by organizations and individuals.</p><br/><p>However, now in the age of the Internet, the scope of China's netizen base reached up to eight billion. All sorts of new media had emerged and the power of the Internet was beyond anyone's imagination. More importantly, it was hard to control.</p><br/><p>Within just one night of brewing on the Internet, huge groups of audiences entered the cinema for \"Dream Chaser\", a movie that was built on little capital and marketing, which led to zero attention on it at all. Once the effects of word-of-mouth took place, it would be worth much more than hundreds of millions in terms of marketing and publicity.</p><br/><p>Late at night, at a certain cinema in central Imperial, it was currently past nine. Usually, around this time, after the prime time movie had ended, the entire cinema would be quite empty without many customers.</p><br/><p>However, it was an abnormal night today. Despite being so late and despite neither being a holiday nor were there any special activities, the flow of customers into the cinema had increased instead.</p><br/><p>Inside the cinema, a group of young men and women were gathered together, discussing enthusiastically.</p><br/><p>\"There's usually not a shadow in sight at this hour. Why're there so many people tonight for the late night show? I thought it would be just us two!\" A girl had said to her partner.</p><br/><p>Her partner was also a young girl. She looked around and said, \"There're probably a lot of people who are here to watch \"'Dream Chaser' like us. Earlier, I heard a lot of people discussing it!\"</p><br/><p>\"The trailer does look quite good, I hope the actual movie won't be disappointing! It's just that there are too little showtimes for this movie. Apart from the one early in the morning, there's just this midnight show, so we had to rush over in the middle of the night!\"</p><br/><p>\"Exactly, it will already be past midnight when we finish. I still have to work tomorrow! I especially rushed over for the movie. If it's not good, then it's really not worth it!\"</p><br/><p>...</p><br/><p>Not too far away, a middle-aged man clad in a tuxedo had walked to the cashier with his hands behind his back.</p><br/><p>\"Manager Zhou!\"</p><br/><p>\"Good evening, Manager Zhou!\"</p><br/><p>....</p><br/><p>Because there were a lot of customers, the two cashiers were flustered as they tried coping with the crowd. When they saw the middle-aged man, they quickly made time to greet him.</p><br/><p>Manager Zhou just waved to indicate that they need not care about her and told them to continue with their work.</p><br/><p>The two cashiers only finished at 11 p.m. when the movie was about to start.</p><br/><p>At that moment, the manager walked up to ask with a delighted expression, \"The customer flow tonight isn't bad, eh? Has the cinema been doing any promotions recently?\"</p><br/><p>The two cashiers shook their heads, then one of them said, \"Manager, there hasn't been any promotions recently!\"</p><br/><p>\"Then, what's up?\" asked Zhou Zhihe, as he lifted his chin in question.</p><br/><p>\"I was looking through the ticket sales and over 90% of the customers tonight are here to watch 'Dream Chaser'!\" The other cashier answered.</p><br/><p>Zhou Zhihe paid full attention to them now. \"Dream Chaser? The one that people have been discussing online?\"</p><br/><p>\"Yep, the first two days when the movie was just released, there were a few people watching it, but it seems to have viral overnight!\" The cashier explained.</p><br/><p>\"Manager, it's not just the night show. Even the earlier one was almost sold out. Usually, each hall will only have a few seats taken up, but today's was half-filled!\" Another cashier exclaimed excitedly.</p><br/><p>Zhou Zhihe had obviously seen some of the discussion going on online with regards to this movie, and she looked pensive at the sound of this.</p><br/>\n</div>"}