{"title": "Chapter 1237: Prince Charming to Goddess in One Second", "id": 1237, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1237-prince-charming-to-goddess-in-one-second", "volume_title": "Volume 13", "body": "<h1>Chapter 1237: Prince Charming to Goddess in One Second</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1237: Prince Charming to Goddess in One Second</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As she listened to Han Momo's overly excited reaction, Ning Xi was quite speechless. \"My dear, it's not like you're a fan who can't see me in person. Why are you so excited as well?\"</p><br/><p>\"But, Boss, I've never seen you in a male outfit! Boss, you're really incredibly handsome in it! Could you be so kind as to provide me some employee welfare? I really want to see how you look like in a male outfit, aaaaaah...\"</p><br/><p>\"Forget it!\" Ning Xi laughed.</p><br/><p>\"Why!?\" Han Momo was instantly disappointed.</p><br/><p>Ning Xi smirked, \"I'm afraid that one glance will doom your love life.\"</p><br/><p>The moment she said, Han Momo replied with a whiny, unbearable tone, \"Bro Xi, don't talk to me like that...my heart can't take it! Oh my God! If all of your crazy fans know that you're on the phone with me right now, and know that I'm your employee, they'd definitely be horribly jealous of me!\"</p><br/><p>\"Okay, I won't tease you anymore. Let's get back to business. Momo, quickly explain to the factory team to prepare for an increase in production for ready-made wear anytime. The recent sales might increase slightly,\" Ning Xi told.</p><br/><p>\"Ah? Why?\"</p><br/><p>\"Look at my latest Weibo post.\"</p><br/><p>\"Oh, oh, let me get to it,\" said Han Momo as she opened Weibo on her computer.</p><br/><p>Moments later, Han Mom excitedly shrieked from the other end of the phone. \"Ah, ah, ah, ah, ah, ah, ah! Boss! You're too humble! It won't just increase a lot! I'm guessing the warehouse is going to just explode! These are just the normal ready-made wear. It's not very expensive, but why does the effect on you look like it's a branded bespoke piece worth millions?! There are already people commenting below...\"</p><br/><p>Han Momo was trembling emotionally as she typed to answer the fans' questions on Weibo.</p><br/><p>[Oh, Bro Xi is so beautiful, my God! I thought that I was just charmed by Bro Xi in a male outfit, but it looks like I'm really turning gay this time! These photos show that Bro Xi is really gentle. I feel healed just by the look of this! P.S. May I ask what's the brand of the dress on Bro Xi?! I like this style way too much!]</p><br/><p>[I like it too, but it's obviously very expensive. It will cost millions, to say the least, and it's probably a limited edition. We definitely can't afford it!]</p><br/><p>Han Momo quickly typed away: [I know! The brand Bro Xi is wearing is called Spirit. In fact, it's not even that expensive! You could buy it with just a few thousand dollars. Spirit's custom-made pieces are indeed very expensive, but these outfits are just from the off-the-shelf line. It's not that hard to get them. All of Spirit's boutique stores will sell them. There're currently six Spirit franchises in Imperial. The addresses are...City Q's boutique's address is...for more information, you can log on to Spirit's official website...]</p><br/><p>Very quickly, Han Momo had answered with a detailed comment and it had been liked by fellow netizens who soon made it a top comment.</p><br/><p>Previously, Ning Xi's Weibo already had some pictures of her in a female outfit, but she was different from the female celebrities who always posted selfie and portraits with lots of makeup. Most of Ning Xi's Weibo were pictures of the set or fun cosplay pictures. There were very few ones of herself, and not even one selfie, so she was quite exotic compared to the crowd of female celebrities.</p><br/><p>That was why this time, she had posted nine pictures at a go, allowing the fans a feast for their eyes.</p><br/><p>It was simply magical how her previous Weibo were pictures of her as a Prince Charming, and the next Weibo exuded a goddess's vibe!</p><br/><p>Whether it was the male fans or the female fans, all of them professed their astonishment for her.</p><br/><p>Apart from having their breath taken away by Ning Xi, many male fans also asked about her outfit. They all said that they wanted to buy it for their wives and girlfriends. The effects of this subsequent promotion of Spirit was even better than what Ning Xi could have ever imagined. They would just need to observe the sales the next few days...</p><br/>\n</div>"}