{"title": "Chapter 1231: Everyone’s Victory", "id": 1231, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1231-everyone%E2%80%99s-victory", "volume_title": "Volume 13", "body": "<h1>Chapter 1231: Everyone’s Victory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1231: Everyone’s Victory</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Ning Xi's movie became more and more popular, Shi Xiao and Xiong Zhi were probably the happiest. Not only did they join the \"Dream Chaser\" discussion forum, they even bought tickets with their own money and distributed it to people around them for free. They were even the VIP members of Ning Xi's international fan club.</p><br/><p>With their lady boss getting more and more popular, they would soon be back at work!</p><br/><p>As the cinemas increased the showtimes frequency, the number of tickets sold for \"Dream Chaser\" became higher and higher…</p><br/><p>$ 600 million, $ 700 million, $ 800 million, $ 900 million…</p><br/><p>On the tenth day, \"Dream Chaser\" reached $ 1 billion at the box office!</p><br/><p>As for \"I Only Like You\", it stopped around $ 500 million and its online ratings dropped to a wretched 3.5!</p><br/><p>All the netizens celebrated! This was not just a movie's victory, it was everyone's victory. To a certain extent, it was a monumental moment for the movie industry in China!</p><br/><p>...</p><br/><p>Inside a high-class villa in Imperial, Liang Biqin cried in front of Su Yimo, \"Cousin! That woman is really wicked, she's just pushing me into a corner! If it wasn't for her, my movie would surely be a big hit, but now, everyone is criticizing me... How can I still survive in the industry?!\"</p><br/><p>Su Yimo flipped through the magazines and newspapers beside her. All of them sang praises for Ning Xi and she did not look very happy.</p><br/><p>They had ignored Ning Xi when they found out she was involved in Chen Mian's small production movie, but who would have known that this movie would become such a big hit?</p><br/><p>\"Cousin, this woman is really calculative. First, she took care of me. I'm afraid she'll be dealing with you next!\" Liang Biqin wept.</p><br/><p>Su Yimo smiled coldly. \"She'll have to be up to my standards first.\"</p><br/><p>Liang Biqin knew something was up, so she asked, \"How can she be up to your standards? You simply didn't do anything against her before, but if you really wanted to, she wouldn't stand a chance against you!\"</p><br/><p>\"She's at her peak right now. We would be troubling the company if we go against her now. Let's give it some time. Moreover, it's at the peak for her movie to reach a billion.\" Su Yimo sounded calm.</p><br/><p>\"Cousin, you're too kind, you're thinking about the company even now!\" Liang Biqin mumbled, \"It's just one billion. Of course, it's nothing to you, your best movie reached $ 1.8 billion! Almost double of hers!\"</p><br/><p>…</p><br/><p>Most people had the same judgment about \"Dream Chaser\" as Su Yimo. They predicted that it would be difficult for it to rise anymore after hitting a billion in sales.</p><br/><p>Usually, the peak period for a movie was the first week after its release. Afterward, it would not budge much.</p><br/><p>On the day the movie reached $ 1 billion, Ning Xi followed Chen Mian's instructions and posted a set of photos of her in a male outfit.</p><br/><p>However, because the photos Lu Tingxiao took were so perfect, Ning Xi did not want them to go to waste, so she posted all of them in a photo grid.</p><br/><p>The netizens had already been asking for her photos for several days. After Ning Xi uploaded the photos, it was shared for over a hundred thousand times within just two hours.</p><br/><p>Her attraction was similar to the influential power of a first-class actress!</p><br/>\n</div>"}