{"title": "Chapter 1242: Blessing From The Heaven", "id": 1242, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1242-blessing-from-the-heaven", "volume_title": "Volume 13", "body": "<h1>Chapter 1242: Blessing From The Heaven</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1242: Blessing From The Heaven</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Wang Shaoyuan really did not understand why Ning Xi insisted on having Ke Mingyu on the show instead. Maybe they were trying to bring Ke Mingyu up. That was quite possible…</p><br/><p>After Wang Shaoyuan promised her, Ning Xi did not press on the matter further. \"Thank you, Director Wang. As for your viewers, you don't have to worry. I'll be on your show in a male outfit.\"</p><br/><p>Wang Shaoyuan was shocked by this sudden blessing from heaven. \"You... What did you say? Ms. Ning, are you saying that you're willing to attend our show in a male outfit?\"</p><br/><p>Wang Shaoyuan could not believe his ears. So many popular programs had invited Ning Xi to go on air in a male outfit, and she had rejected most of them, so he had not even dared to think about it because he thought it was impossible.</p><br/><p>In the end, Ning Xi suggested it herself. He was elated! He would agree to whatever requirements she had now, not just the male guest!</p><br/><p>\"Ms. Ning, please rest assured. I'll make sure the show will be great. If there's anything else you need, please let me know! I'll explain the situation to Chen Hanchen's side and make sure that there are no issues for you!\" Wang Shaoyuan then ended the phone call and told the good news to his crew.</p><br/><p>Ling Zhizhi looked at Ning Xi. She actually did not have to say that she would attend the show in a male outfit, but she still did.</p><br/><p>She really was doing a lot for Ke Mingyu…</p><br/><p>It was normal for Ning Xi to fall for a man at her age. As long as it was within boundaries, there was nothing wrong with it, but Ling Zhizhi was just curious. Why Ke Mingyu?</p><br/><p>…</p><br/><p>Soon, Chen Hanchen's manager, Cheng Yanan, received a call from \"Beauty's Specialties\".</p><br/><p>After the call ended, Cheng Yanan went to the theatre room and looked for Chen Hanchen.</p><br/><p>On the screen, \"Dream Chaser\" was playing. He had watched it several hundred times already and he still had not gotten bored of it…</p><br/><p>Cheng Yanan shook his head. \"Hanchen, \"Beauty's Specialties\" just gave me a call. Because of some miscommunication, the male guest will be changed.\"</p><br/><p>\"Change? Who to?\" Chen Hanchen looked away from the screen when Ning Xi appeared on-screen in a female outfit. He looked at his manager curiously.</p><br/><p>\"Ke Mingyu,\" Cheng Yanan replied.</p><br/><p>Chen Hanchen's expression changed. \"What? Why the sudden change?\"</p><br/><p>\"According to them, Ning Xi will only attend the show if the male guest is Ke Mingyu. Glory World probably wants to promote Ke Mingyu more,\" Cheng Yanan explained.</p><br/><p>Chen Hanchen's expression darkened and he kicked the seat in front of him roughly. \"So, you're just going to let someone else snatch the show away from me?\"</p><br/><p>Cheng Yanan felt a little odd at Chen Hanchen's anger. \"It's just a cooking show. There're so many more shows that are better than this. There's no point making a fuss about this and it's also not necessary to have a bad relationship with Glory World. Ning Xi even promised that if Ke Mingyu could go, she would attend the show in a male outfit. They would surely agree to whatever conditions she has!\"</p><br/><p>Chen Hanchen seemed even more upset and Cheng Yanan looked at his own artiste with a confused expression.</p><br/><p>…</p><br/>\n</div>"}