{"title": "Chapter 1265: Amazing, My Brother!", "id": 1265, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1265-amazing-my-brother", "volume_title": "Volume 13", "body": "<h1>Chapter 1265: Amazing, My Brother!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1265: Amazing, My Brother!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Everyone looked dismally at the unfairness of the situation!</p><br/><p>Anyone was better than Su Yimo!</p><br/><p>\"How shameless! Now that she's unsuccessful in bragging and swindling, she's turned to straight up seducing now?\"</p><br/><p>\"The Boss dislikes her! Please don't dance with her! Anyone is better than Su Yimo!\"</p><br/><p>\"But it's such an important occasion today. Many reporters are watching too. Second Master has already explained the rules. Even if Su Yimo rigged it, they probably can't change anything...\"</p><br/><p>...</p><br/><p>\"Yimo, don't give up! With your beauty, no man would be unmoved. It's just a girlfriend. They're not married, so you still have a chance!\" Zhao Meixin spoke to Su Yimo as she shot a mean look at the host.</p><br/><p>The host was in Su Yimo's gang of supporters, and he was afraid that there would be changes, so he quickly continued, \"Congratulations, Yimo! Could we please invite her...\"</p><br/><p>However, before he could finish, a cold voice was heard beside him, \"Change it to someone else.\"</p><br/><p>The host was stunned. He had been frightened by Lu Tingxiao's presence that his entire body shook.</p><br/><p>Change to someone else?</p><br/><p>Lu Tingxiao had actually ordered him to change just like that. He was not subtle about his hatred for Su Yimo at all!</p><br/><p>\"Oh! Long live the Boss!\"</p><br/><p>\"Too cool!\"</p><br/><p>\"This is how you need to treat people like her!\"</p><br/><p>...</p><br/><p>\"You pick,\" Lu Tingxiao looked to the host and said.</p><br/><p>The host dared not disagree. He swiftly picked out another number and after he looked at the number, the host almost fell to the ground as his knees gave way...</p><br/><p>At the same time, the suspended high-definition camera had been guided to zoom in on the strip of paper...</p><br/><p>On the huge screen behind him, a two-digit number was clearly shown on the strip of paper. It was 29!</p><br/><p>29 again!</p><br/><p>\"Hey! How could there be two 29's?\"</p><br/><p>\"Is this even a question? That box is definitely filled with number 29's!\"</p><br/><p>\"Hahaha...Su Yimo is being humiliated big time tonight!\"</p><br/><p>\"Could she be any more embarrassed tonight?\"</p><br/><p>...</p><br/><p>The Vice President Yi Xudong staggered up onto the stage and was terrified as he said, \"I\"m really sorry, CEO Lu. There's been a slight mistake!\"</p><br/><p>Then, he shot an angry look at the host. \"What are you doing? How could you have gotten two of the same numbers?\"</p><br/><p>The host looked guilty, yet he could not defend himself.</p><br/><p>Offstage, Zhao Meixin fell to the ground...</p><br/><p>Over...</p><br/><p>It was all over...</p><br/><p>They had thought that this could be their chance to turn the tables, but who would have thought that it was the last straw to topple them instead?</p><br/><p>She dared not think about how crushed Su Yimo's carefully crafted image of an elegant star would be after tonight.</p><br/><p>After a short obstacle, Lu Jingli chucked as he brought another box on stage, and to indicate fairness, he had even picked out multiple numbers to prove that they were all different, then he replaced the host's spot...</p><br/><p>This time, everyone agreed on the fairness of the situation, and they watched with excitement as Lu Tingxiao reached into the box again...</p><br/><p>\"Oh, oh, oh, who could it be!? This time, it's really completely based on luck!\" Xiao Tao held onto Ning Xi's arm excitedly.</p><br/><p>On stage, Lu Jingli smiled sneakily as he took the strip of paper from his brother. He slowly opened it up and was ready to rig it to become Xiao Xi Xi, yet his eyes widened at this point...</p><br/><p>Whoa!</p><br/><p>Number 166!</p><br/><p>My amazing brother! He actually managed to pick Xiao Xi Xi?</p><br/>\n</div>"}