{"title": "Chapter 1264: Who Could It Be?", "id": 1264, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1264-who-could-it-be", "volume_title": "Volume 13", "body": "<h1>Chapter 1264: Who Could It Be?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1264: Who Could It Be?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When they heard Lu Tingxiao's reply, the crowd all agreed with what Second Master had said, even they had been attacked by the sudden display of affection!</p><br/><p>So much of the revealed information had been learned within only a few sentences of interviewing him!</p><br/><p>As the No. 1 person on the leaderboard for the man that women wanted to marry the most, he had finally announced his unavailable status today!</p><br/><p>Lu Tingxiao had a girlfriend! It turned out Lu Tingxiao liked women. In fact, the two had been dating for quite a while!</p><br/><p>In that case, if it was someone in the entertainment industry, to have a boyfriend like Lu Tingxiao, that woman must be a powerful somebody in the industry by now!</p><br/><p>After all, if Su Yimo could do as she wished in the entertainment circle just by borrowing Lu Tingxiao's name, what more Lu Tingxiao's actual girlfriend!</p><br/><p>Who could it be?</p><br/><p>Was it Leng Manyun who had previously retired?</p><br/><p>That was not right. Leng Manyun was not young. In fact, she had retired to marry someone, and CEO Lu had not yet married his girlfriend...</p><br/><p>Could it be that super popular singer from Polystar Records, Qu Jing, that skyrocketed to fame?</p><br/><p>Or Meng Shiyi, the movie star who debuted with great opportunities, and was even rumored to have a strong support?</p><br/><p>...</p><br/><p>All those who had risen to fame and had strong support behind them in the entertainment circle was speculated by everyone. Of course, most people still leaned towards hazarding the girlfriend being a socialite.</p><br/><p>\"Okay, since everyone is here, let's officially begin our celebration! That's right, next up is the segment you're all most excited for. We'll see who's the lucky one that'll get the chance for this dance!\" Lu Jingli said this with enthusiasm.</p><br/><p>Finally, it was time for the lucky draw. All the girls present were very excited. Someone in the crowd then said, \"Wouldn't the lady boss be jealous if the Boss dances with another woman?\"</p><br/><p>Lu Jingli's gaze turned to a corner and said with a smirk, \"How could it be!? This is work! My sis-in-law is still quite understanding!\"</p><br/><p>Yet, the truth was...how could his brother dance with another woman? Hehehe...</p><br/><p>Lu Tingxiao walked to the middle of the stage, then two ladies carried a big red box onto the stage.</p><br/><p>Vice President Yi Xudong turned pale with fright when he saw it. He wanted to stop them but it was too late. On stage, the man's long fingers had unhurriedly picked out a strip of paper with a number on it...</p><br/><p>The host carefully took the paper from the Big Boss, then he excitedly looked to the crowd and said, \"Who will our lucky lady be? I will immediately announce this for all...\"</p><br/><p>\"Stop with the suspense, quickly announce it!\"</p><br/><p>\"What number!? What number!?\"</p><br/><p>\"Number 7, number 7. Please be number 7, aaaah!\"</p><br/><p>...</p><br/><p>Under all the tense faces, the host slowly opened up the strip of paper, then said, \"The lucky lady is...number 29! Who's number 29?\"</p><br/><p>The crowd buzzed and everyone looked at each other. Sadly, none of them were number 29...</p><br/><p>\"Yimo! It's you! You're number 29!\" Zhao Meixin who had been gloomy, suddenly excitedly pulled at Su Yimo's arm.</p><br/><p>Su Yimo then returned to her senses and looked pleasantly surprised at her number. \"Is it...me?\"</p><br/><p>\"Yes, Yimo!\" Zhao Meixin did not care about everything else. She was afraid of losing this chance to turn the tables, so she quickly said aloud.</p><br/><p>When Zhao Meixin spoke, there was a momentary silence across the crowd...</p><br/><p>Su Yimo? How annoying!</p><br/>\n</div>"}