{"title": "Chapter 1270: Fell From Pedestal", "id": 1270, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1270-fell-from-pedestal", "volume_title": "Volume 13", "body": "<h1>Chapter 1270: Fell From Pedestal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1270: Fell From Pedestal</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Hello, Director Ye?\"</p><br/><p>\"Ms. Zhao, you're calling pretty early. Is there anything you need ?\"</p><br/><p>\"Well, I just wanted to ask when our Yimo should sign the renewal of her contract. Also, Biqin's commercial! It's been many days. Logically, it should be time to sign the contract,\"</p><br/><p>When Ye Ying heard this, she sneered. This Zhao Meixi! How dare she mention this!?</p><br/><p>She was the Creative Director of the Lu Corporation headquarters. Everyone in the circle were courteous her, except for Zhao Meixin who used her position to bully others, even going overboard with requests in their time of collaboration. Now that she knew Su Yimo was not even the Big Boss's woman, she did not need to care to be courteous.</p><br/><p>\"Huh, Ms. Zhao, I'm very sorry. The double endorsement fees previously requested was really just too outrageous, and Ms. Su's influence for our products during her endorsement hasn't been that fantastic, so we've already decided to use other artistes. As for Liang Biqin...Ms. Zhao, you know well enough about the online reviews Liang Biqin received for her movie. How could we let a rat's feces ruin the pot of porridge if we've made huge investments in this ad? It's best to have some self-awareness!\"</p><br/><p>After she kept it in for so long, she could finally release it all in one breath. Ye Ying had really not given any face to Zhao Meixin.</p><br/><p>\"You...\" On the other end of the phone, Zhao Meixin was about to explode, but she probably remembered that times were different now, so she surpressed her anger and said, \"Director Ye, what do you mean? Haven't we already discussed these things earlier? Yet, now you want to go back on your words?\"</p><br/><p>It was best if she did not mention it, but now that she did, Ye Ying was more offended. \"Without my Boss's name, you fully know yourself how much your artiste is worth! Our Lu Corporation is not a rubbish hub!\" Ye Ying finished and hung up.</p><br/><p>At a certain high-end villa in Imperial, for the entire night, Su Yimo, Zhao Meixin, and Liang Biqin did not sleep a wink. Since the night before, they had been coming up with plans and making calls, but the situation had still progressed to such a dire stage.</p><br/><p>Zhao Meixin was worried that any delay would bring trouble. The moment it was working hours, she called Ye Ying to talk about the contract, but she never expected this response...</p><br/><p>She thought that only Biqin's commercial gig would not hold up at most, but it never occurred to her that even Su Yimo's contract renewal was a lost cause.</p><br/><p>\"How's it?\" Su Yimo asked.</p><br/><p>Zhao Meixin looked gloomy as she responded, \"That god damned Ye Ying! She's taking advantage of the situation. Not only did we lose Biqin's commercial, even your contract won't be signed...\"</p><br/><p>\"How could this be!? Those people are too much!\" Liang Biqin was exasperated.</p><br/><p>Su Yimo clenched her fists hard. In just one night, her everything had turned upside down. All those who used to fawn over her were beginning to avoid her.</p><br/><p>Ever since she had risen to fame, she was carefully treated everywhere no matter where she went, but now that she had fallen from her pedestal, how could she bear this grief?</p><br/><p>Then again, she had forgotten that all of this was never hers to begin with.</p><br/><p>When she saw that Su Yimo looked increasingly upset, Zhao Meixin pinched the space between her brows and said, \"Yimo, don't be too sad. Even without Lu Tingxiao, you're still Glory World Entertainment's A-lister...\"</p><br/><p>\"Huh, A-lister...\" Su Yimo sneered.</p><br/><p>What A-lister? Now, she was just a joke in Glory World Entertainment and the entire entertainment industry!</p><br/><p>Zhao Meixin knew that without Lu Tingxiao's halo, their loss was huge. The entertainment industry had strong competition, and Su Yimo was not young. Without any backup, she could be replaced if she was not careful.</p><br/><p>No! She had made it to her position with hard work and she would not allow everything to be over just like that!</p><br/><p>Zhao Meixin cleared her throat and softened her tone as she leaned closer to Su Yimo and advised, \"Yimo, we must move on. The situation's already like this. The most important thing is to quickly think of a resolution. I've just helped you set a dinner appointment. It's with Rong Xin Real Estate's boss...\"</p><br/>\n</div>"}