{"title": "Chapter 1278: Aren’t You Going To Apologize To My Girlfriend?", "id": 1278, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1278-aren%E2%80%99t-you-going-to-apologize-to-my-girlfriend", "volume_title": "Volume 13", "body": "<h1>Chapter 1278: Aren’t You Going To Apologize To My Girlfriend?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1278: Aren’t You Going To Apologize To My Girlfriend?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Su Yimo's shoulder was trembling and even the waitress beside her felt pained to see her like this.</p><br/><p>Zhao Meixin nodded to herself. Yimo's acting tonight was in top-notch!</p><br/><p>Zhao Meixin and Su Yimo were not expecting Lu Tingxiao to listen to them, but he actually stood there patiently and listened to everything they had to say.</p><br/><p>The man then looked at Su Yimo coldly. \"So, you want to apologize to my girlfriend?\"</p><br/><p>Su Yimo raised her face hopefully. \"Yes, as long as you can forgive me, I'll do anything!\"</p><br/><p>Seeing what was unfolding, Zhao Meixin was overjoyed. Something was going to happen tonight!</p><br/><p>No man could get past a girl who looked vulnerable and pitiful…</p><br/><p>In the bedroom, Ning Xi was focused on reading her script for the new movie. It was already too late, so Ning Xi was going to stay there for the night with Lu Tingxiao.</p><br/><p>She realized Lu Tingxiao had not come back for some time, so she turned her head and called out, \"My dear?\"</p><br/><p>There was no reaction. Ning Xi scratched her head and walked towards the door.</p><br/><p>At the door, Zhao Meixin and Su Yimo heard the voice of a woman from inside the room. Su Yimo's face turned pale. Lu Tingxiao was with his girlfriend tonight?</p><br/><p>She thought Lu Tingxiao would be the cold type and would be very restrictive in his love life as well. She envisioned the woman he liked to be similar. Such a sweet nickname was very unexpected…</p><br/><p>Lu Tingxiao's expression turned from a cold, ignoring face into a warm one like the ice had just melted right away.</p><br/><p>For Lu Tingxiao to be so protective of her... Who was this woman?</p><br/><p>Not just Su Yimo, even Zhao Meixin was really curious as well. The waitress wanted to take a peek but Zhao Meixin chased her away.</p><br/><p>The soft patter of feet stepping on the carpet came closer. Su Yimo held her breath and controlled her mixed emotions as she gawked into the room…</p><br/><p>It was just a few seconds, but it felt like an eternity to Su Yimo.</p><br/><p>Finally, someone appeared from the corner of her eye.</p><br/><p>The girl seemed to have just finished showering, so her face was still a little flushed. She wore a pink bathrobe and her hair fell on her shoulders. She was also holding a script marked with many colorful Post-Its while she walked towards the door.</p><br/><p>When they saw who the woman inside was, Su Yimo felt like an aerolith had just crashed into her…</p><br/><p>\"Ning...Xi…\" Su Yimo's lips were trembling. She felt like she was going crazy.</p><br/><p>Ning Xi was surprised to see the shocked Su Yimo and Zhao Meixin.</p><br/><p>Nonetheless, since her cover was already blown, there was no helping it. Ning Xi was quickly attracted by something else. She went up to Lu Tingxiao and covered up his low-cut pajamas…</p><br/><p>Lu Tingxiao smiled at the girl's childish behavior as he held onto Ning Xi's hands and turned to the two women outside the door. He returned to his usual cold tone, \"Aren't you going to apologize to my girlfriend?\"</p><br/>\n</div>"}