{"title": "Chapter 1281: Let's Meet Up", "id": 1281, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1281-lets-meet-up", "volume_title": "Volume 13", "body": "<h1>Chapter 1281: Let's Meet Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1281: Let's Meet Up</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>All the media coverage was filled with headlines such as the \"Liang Biqin Sex Scandal\" and \"Liang Biqin's Passionate XX\". There were even pictures and videos attached.</p><br/><p>News such as \"Su Yimo Banished After Unsuccessfully Seducing Lu Tingxiao\" and \"Su Yimo Banned\" dominated the headlines too. The Internet was in chaos.</p><br/><p>Everyone was still discussing Su Yimo's drama from days before. Who would have expected such a shocking development?</p><br/><p>The entire morning, Glory World Entertainment's Public Relations department phones were ringing off the hook. Once such a scandal was exposed, Glory World instantly suffered huge losses. Yi Xundong was overwrought, but the employees and female artistes who had once been repressed by Su Yimo were so delighted that they almost wanted to publicly celebrate.</p><br/><p>The happiest one in the industry was clearly Starlight Entertainment.</p><br/><p>Starlight Entertainment, which had been suppressed by Glory World Entertainment when it had once been the leader in the industry, was now rejoicing at its rival's misfortune.</p><br/><p>Of course, not everyone in Starlight Entertainment was equally joyful...</p><br/><p>Ning Xueluo slammed the newspaper in her hands onto the table and looked utterly upset.</p><br/><p>\"What's this Su Yimo doing!?\"</p><br/><p>She had been hoping for Su Yimo to make a move. That way, she would not have to do anything to get rid of Ning Xi since someone else would do the dirty work, yet here she was watching Su Yimo ruin her own quality brand bit by bit!</p><br/><p>When Lu Tingxiao had publicly clarified, rejected, and humiliated Su Yimo before this, she was not at all worried that Su Yimo had no support. Instead, she was surer that Su Yimo would not hesitate to get rid of her arch-enemy, Ning Xi.</p><br/><p>When she thought about this, Ning Xueluo had been in a pretty good mood. However, who would have anticipated that the news would be about Su Yimo, Liang Biqin, and Zhao Meixin's complete defeat!</p><br/><p>Chang Li frowned as she said, \"Logically, Zhao Meixin shouldn't make such a mistake! How did she let someone get a handle on something that could be used against them? She even let the reporters get their pictures!\"</p><br/><p>\"The three of them couldn't defeat that witch, Ning Xi. What a bunch of morons!\" Ning Xueluo was furious.</p><br/><p>\"Sigh, this is tricky! Without Su Yimo, wouldn't Ning Xi be even smugger?! She's directly under Lu Jingli and has recently become very popular. I'm afraid all of the opportunities from the Lu Corporation that were meant for Su Yimo will now be hers.\" Chang Li looked worried.</p><br/><p>Who would have thought that the inflexible Ning Xi would now swim like a fish in the water within the entertainment industry? Even Su Yimo had fallen by her hand.</p><br/><p>Analyzing Ning Xi's steps in the industry closely, she had really been advancing gracefully and climbing up the popularity ladder at a speed that was worth fearing.</p><br/><p>Chang Li dared not to think anymore. Otherwise, she might drown in her regrets again...</p><br/><p>Now that the situation had reached such a point, there was no turning back. Ning Xueluo gritted her teeth and called Ning Xi.</p><br/><p>\"Hello, Sister, congratulations! Didn't think you'd be this amazing!\"</p><br/><p>When she received Ning Xueluo's call, Ning Xi was not surprised at all. \"What's up?\"</p><br/><p>\"Let's meet up.\"</p><br/><p>\"Sure!\"</p><br/><p>She could guess the reason Ning Xueluo wanted to meet up with her. Since she was free anyway, it would be fun to play around with her!</p><br/><p>...</p><br/><p>An hour later, in a certain cafè.</p><br/><p>Ning Xueluo was frank. \"I won't beat around the bush. I'm sure you know very well why I've asked to meet up. I can give you a price 3% higher than the market rate to purchase that 10% in shares that you hold! Of course, that's quite a lot of money, so I won't be able to give them all at a go. For whatever outstanding amount, I can use History's shares as mortgage!\"</p><br/>\n</div>"}