{"title": "Chapter 1286: Ning Xiao Xi! You're Too Cruel!", "id": 1286, "volume": 13, "url": "http://boxnovel.org/hidden-marriage-chapter-1286-ning-xiao-xi-youre-too-cruel", "volume_title": "Volume 13", "body": "<h1>Chapter 1286: Ning Xiao Xi! You're Too Cruel!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1286: Ning Xiao Xi! You're Too Cruel!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the advertising department, Jiang Muye kept urging her, but Ning Xi still did not want to share anything. She smiled and continued to relish his agitated demeanor.</p><br/><p>Not too far away, because he was bored from waiting alone, the gum-chewing Li Lekai had walked over to Luo Fan. He looked at Jiang Muye and Ning Xi and said, \"Hey Luo Fan, what do you think their relationship is?\"</p><br/><p>Luo Fan put down the book in his hand. He looked over and replied, \"Probably best friends. They're from the same company after all, and they're both apprentices.\"</p><br/><p>Luo Fan did not have much of a strong background. The fact that he could get to where he was today relied primarily on his high EQ and his skills in handling people. He behaved carefully, so for such a question, he naturally gave a diplomatic answer.</p><br/><p>Li Lekai pouted. He thought that Luo Fan was too pretentious and boring, so he went to look for Qin Ran instead.</p><br/><p>Time passed by and Mo Yuxiu had yet to arrive. Many of them in the room started to look impatient. Only others waited for them; they were never the ones waiting. Was this Mo Yuxiu doing this because he felt that he was superior to them?</p><br/><p>\"He just won some lame award in Spain and now one of the four prestigious movie awards. What's he so arrogant about!? As popular as he may be, it'll be ruined by that horrible private life of his!\" Li Lekai was furious now as he started to mock him without restraint.</p><br/><p>Qin Ran and Han Yucheng were also tired of waiting. If it had not been the Lu Corporation that had invited them this time, they would have pulled a long face and left a long time ago.</p><br/><p>Apart from Jiang Muye who had been busy trying to get Ning Xi to talk, the only person who remained calm in the room throughout was Luo Fan.</p><br/><p>\"I'm very sorry. Please wait for a moment longer. Yuxiu is probably delayed by some issue. Let me call to ask!\"</p><br/><p>Ye Ying had also been periodically consoling everyone and speaking on behalf of Mo Yuxiu with a warm and courteous attitude.</p><br/><p>That was right. Ye Ying herself was a loyal fan of Mo Yuxiu...</p><br/><p>\"Even though I don't want to admit it, but this Mo Yuxiu is quite a few ranks higher than I am. How did you get him?\"</p><br/><p>At this moment, the curious Jiang Muye suddenly thought of this. \"That's not right. Based on that guy's personality of taking revenge and all, he hasn't caused trouble to you even though you've been in the industry for so long. He probably can't even recognize you!\"</p><br/><p>\"It's true that he can't recognize me in a female outfit,\" answered Ning Xi.</p><br/><p>\"Then, what are you worried about?!\" Jiang Muye was frustrated.</p><br/><p>Ning Xi looked at him like he was an idiot. \"But he knows me in my male outfit!\"</p><br/><p>Jiang Muye was stunned now. In confusion, he asked, \"Ah? What do you mean?\"</p><br/><p>Ning Xi was done teasing him, so she finally said, \"Are you an idiot? I mean that I was with him in my male outfit!\"</p><br/><p>\"I...what!!!\" Jiang Muye exclaimed aloud, only lowering his voice when the others looked over. \"Bloody hell! You turned him gay in your male outfit?\"</p><br/><p>Ning Xi shrugged. \"Looked like it.\"</p><br/><p>Jiang Muye looked like he was in solidarity with the guy. \"Too...too cruel! You're too cruel...\"</p><br/><p>It turned out that Ning Xi had gone easy on him. There were worst things than his situation!</p><br/><p>Jiang Muye had felt sullen for so many years, but at this moment, he felt redeemed.</p><br/><p>\"Then, aren't you going to die tragically?!\" Jiang Muye suddenly said.</p><br/><p>This hatred she attracted was coming by the buckets!</p><br/><p>\"Duh, why do you think I'm worried now?\" Ning Xi gave him a look that said, \"Obviously, it's a sticky situation if it's worth my worry\".</p><br/>\n</div>"}