{"title": "Chapter 1304: Only To People I Like", "id": 1304, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1304-only-to-people-i-like", "volume_title": "Volume 14", "body": "<h1>Chapter 1304: Only To People I Like</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1304: Only To People I Like</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>A while later, Ning Xi came out in her changed outfit.</p><br/><p>It was a glacier blue dress with matching tassel earrings and a pair of silver high heels.</p><br/><p>Anyone who was slightly familiar with fashion would know that everything on Ning Xi was valuable limited-edition items.</p><br/><p>The dress was a special item from the renowned ES, and the high heels were from the Eden series of Ralph Lauren. As for the earrings, they were designed by one of the top designers in the country, Fang Yi.</p><br/><p>Ning Qiutong's eyes lit up. \"Great! You look marvelous!\"</p><br/><p>\"Thank you! You have really great taste!\" Ning Xi smiled.</p><br/><p>\"Such a sweet-talker you are, but why do you have such a terrible relationship with your family?\" Ning Qiutong sighed.</p><br/><p>\"I'm only a sweet-talker with people whom I like!\"</p><br/><p>Ning Qiutong beamed happily. \"Come here. I'll do your hair for you.\"</p><br/><p>\"Mmm.\" Ning Xi sat in front of the dressing table.</p><br/><p>Ning Xiutong used a comb and brushed her hair gently. \"Let me think what kind of hairstyle to do for you, but you look so great already. I don't think I have much to do here…\"</p><br/><p>Ning Xi looked at Ning Qiutong's loving expression through the mirror. She had an indescribable feeling when her hair was being caressed by Ning Qiutong's gentle fingers…</p><br/><p>Ning Qiutong realized that Ning Xi's eyes were a little red, so she asked nervously, \"Xiao Xi, what's wrong?\"</p><br/><p>Ning Xi shook her head. \"It's alright, I just slept too late last night, so my eyes are a little irritated.\"</p><br/><p>…</p><br/><p>At the same time, in the banquet hall, everyone was chatting, drinking, bonding, and talking about business. Some people even tried to look for a partner for their children. All in all, the atmosphere was very lively.</p><br/><p>Zhuang Lingyu was bringing Ning Xueluo around with pride. No matter where she went, everyone had nothing but praises for them.</p><br/><p>\"Madam Ning, when are we going to get invited to your daughter's wedding?\"</p><br/><p>\"Sadly, my useless son is late!\"</p><br/><p>\"You're so blessed, Madam Ning. You have an understanding husband and such a capable daughter. Now there's even an excellent son-in-law!\"</p><br/><p>…</p><br/><p>Zhuang Lingyu looked at her daughter in her elegant white dress, and she patted her shoulder. \"My biggest achievement in my life is to have Xueluo as my daughter!\"</p><br/><p>Ning Xueluo acted bashfully. \"It's my blessing to be your daughter!\"</p><br/><p>Everyone was really jealous of how close they were. Most of the higher-class families did not have good relationships with their children, who were usually rebellious and arrogant. None of them would be as obedient as Ning Xueluo was!</p><br/><p>\"Lingyu, I heard that your sister-in-law who stayed overseas has returned recently?\" A lady went up to Zhuang Lingyu and asked.</p><br/><p>\"Mmm, yes, she's back.\" Zhuang Lingyu did not look very happy when her sister-in-law was mentioned.</p><br/><p>\"Coincidentally, my husband was looking for people to collaborate on his project. Would you mind introducing us?\" The lady made a request.</p><br/><p>Zhuang Lingyu frowned, but as she was about to reply, the hush fell over the hall.</p><br/><p>Everyone stared towards the entrance.</p><br/><p>There was a lady in a golden dress along with a stunning girl behind her. They both entered the hall regally.</p><br/>\n</div>"}