{"title": "Chapter 1314: Almost Passed Out", "id": 1314, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1314-almost-passed-out", "volume_title": "Volume 14", "body": "<h1>Chapter 1314: Almost Passed Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1314: Almost Passed Out</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As Qian Caijun almost passed out of anger, Yun Shen turned around and said, \"Ah, I have limited resources, $ 1 billion is impossible, but something lesser is doable.\"</p><br/><p>Qian Caijun was revived as he heard Yun Shen. \"Of course, I understand! It's alright for you to invest any amount!\"</p><br/><p>From his tone, he would probably give $ 300, or even $ 500 million!</p><br/><p>Yun Shen then gave a word to the stern bodyguard beside him, and the latter left afterwards.</p><br/><p>It seemed like he had gone to prepare the money!</p><br/><p>Soon, the bodyguard came back. Qian Caijun was full of expectations as the bodyguard extended his hand out without any expression on his face.</p><br/><p>Qian Caijun opened his palm, practically hyperventilating in excitement.</p><br/><p>The next moment, a silver coin dropped onto Qian Caijun's palm.</p><br/><p>Everyone was taken aback!</p><br/><p>One...one dollar!</p><br/><p>Did their eyes fail them?</p><br/><p>\"Uh, $ 1? Is that a single dollar? Or am I mistaken!\"</p><br/><p>\"That's...right, it is!\"</p><br/><p>\"CEO Yun is so cruel! You'll never guess what he's going to do next!\"</p><br/><p>\"Is there some vengeance going on between CEO Yun and Qian Caijun?\"</p><br/><p>\"Who knows!? But seems like it!\"</p><br/><p>\"Qian Caijun deserved it. It's not the first time he looked for trouble with this girl. He tried to insult her by offering a $ 1 bid at the charity auction last time. This is karma!\"</p><br/><p>\"Now that you mentioned it, why does it seem like CEO Yun has something going on with this girl?\"</p><br/><p>…</p><br/><p>Thud! Qian Caijun had fallen backwards. This time, he had really passed out.</p><br/><p>Ning Xueluo was hopping mad!</p><br/><p>The hotel manager quickly had several waiters send him out, then he carefully apologized to Yun Shen, \"I'm sorry to let you experience this! Really sorry!\"</p><br/><p>As the drama garnered more attention and everyone was stealing glances at her and Yun Shen, Ning Xi was having a headache with all the sprouted discussions and suspicions. She took the opportunity to flee when Qian Caijun passed out.</p><br/><p>Ning Yaohua could not wait any longer. He went up to Yun Shen excitedly and said, \"Thank you for helping my daughter, CEO Yun!\"</p><br/><p>Ning Yaohua then handed his name card. \"CEO Yun, I'm the president of Ning International, Ning Yaohua. I've submitted a project proposal to your company before. I wonder if you remember anything about it?\"</p><br/><p>Who cared why Yun Shen helped Ning Xi? This was a hard-earned chance for him.</p><br/><p>There were so many people around him just now, so Ning Yaohua did not have the chance to even speak.</p><br/><p>Ning Xi's expression darkened when she saw Ning Yaohua swiftly go up to Yun Shen at this point but had ignored her when she needed help just now.</p><br/><p>Yun Shen glanced at the girl, then he took the name card. \"Ning International, I remember.\"</p><br/><p>Ning Yaohua looked overjoyed. He then described the proposal details, \"I didn't expect you to remember! Although we might not be the best in the country, we're one of the oldest in the industry, plus we have very close ties with the Su family…\"</p><br/>\n</div>"}