{"title": "Chapter 1319: Share Transfer Agreement", "id": 1319, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1319-share-transfer-agreement", "volume_title": "Volume 14", "body": "<h1>Chapter 1319: Share Transfer Agreement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1319: Share Transfer Agreement</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Everyone, stop! Look at you!\" The elder cried out in anger.</p><br/><p>Ning Yaohua stared at Ning Xi as if he was staring at an enemy. \"Unfilial child, don't think I don't know your motives. You've gotten close to your aunt by every possible means just for that bit of shares, haven't you? You thought that if you could deceive your aunt for those shares, you can inherit the company! You think that those old guys in the company are easy to deal with? Without my protection, you'd be swallowed whole!\"</p><br/><p>Zhuang Lingyu looked on mockingly, \"You keep on saying that you don't want Ning assets, and you don't want to acknowledge us as your parents. What're you doing now then?\"</p><br/><p>\"The two of you, shut up! Even if Xiao Xi inherits the company, it's right and proper!\" The elder had rage written all over his face.</p><br/><p>Amid the arguments, Ning Xi suddenly spoke up, \"Regarding the shares, I was intending to invite everyone out to clarify it once and for all. Since the two of you are now so impatient, let's just settle it now. Plus, it's good that Grandfather is here too.\"</p><br/><p>The elder frowned. \"Xiao Xi, you're...\"</p><br/><p>Ning Xi gave her grandfather a consoling glance, then she took out a stack of documents from her bag.</p><br/><p>In that instance, Ning Yaohua, Zhuang Lingyu, Ning Xueluo, and Ning Yaobang turned their attention to the documents in her hands.</p><br/><p>On the first page of that document, it was clearly stated in black, bold words: Share Transfer Agreement!</p><br/><p>Suddenly, everyone's eyes widened, especially Ning Yaohua and Ning Yaobang's.</p><br/><p>\"The share transfer agreement!\" Ning Yaobang exclaimed. Was Ning Xi planning to transfer her shares?</p><br/><p>Ning Xueluo looked nervous. Could Ning Xi have been persuaded by her offer from before?</p><br/><p>That was not right... This witch had never wanted anything beneficial to her. There was no way she would sell the shares to her!</p><br/><p>Bam! Ning Xi just flipped open the share transfer agreement and slammed it onto the table.</p><br/><p>The contents were instantly presented before everyone.</p><br/><p>...</p><br/><p>Ning International Private Limited Company Share Transfer Agreement</p><br/><p>Transferor: Ning Xi (Party A)</p><br/><p>Assignee: Ning Qiutong (Party B)</p><br/><p>...</p><br/><p>Ning Qiutong!</p><br/><p>When they saw that name, Ning Yaohua and the rest were stupefied.</p><br/><p>Yet, there was more that shocked them after that.</p><br/><p>The agreement stated that Party A would be transferring 10% of Ning International's shares to Party B at no cost.</p><br/><p>At no cost!</p><br/><p>\"Ning Xi! You're crazy!\" Ning Yaohua could not take this.</p><br/><p>Zhuang Lingyu was in disbelief too. She did not think that Ning Xi would transfer all of her shares to Ning Qiutong for free!</p><br/><p>She would rather give it for free to Ning Qiutong and not sell it to them?</p><br/><p>Ning Qiutong looked at the share transfer agreement and felt a mix of emotions. Clearly, she did not expect for Ning Xi to do that either. They had only met a few times, yet she had trusted her so much and just transferred all of her shares to her.</p><br/><p>Ning Yaobang looked on in pain. \"Sigh, my niece, even if you're not interested in the company and don't want to sell it to my brother, you could sell it to me! It's just too stupid to give it to someone else not even for a single cent!\"</p><br/><p>\"Father, are you just going to let Ning Xi mess with the shares like that?\" Ning Yaohua anxiously pleaded.</p><br/><p>Ning Zhiyuan looked at Ning Xi, and when he saw her determined demeanor, he took a deep breath and said, \"Since I've already given the shares to Xiao Xi, they are hers. Whatever she wants to do with them is up to her.\"</p><br/><p>Zhuang Lingyu hated Ning Qiutong the most. There was no way she would allow Ning Qiutong to take up 20% of Ning International's shares and immediately step over Ning Yaohua. She immediately roared angrily.</p><br/>\n</div>"}