{"title": "Chapter 1326: Beat Him Up", "id": 1326, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1326-beat-him-up", "volume_title": "Volume 14", "body": "<h1>Chapter 1326: Beat Him Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1326: Beat Him Up</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>This silly child…</p><br/><p>Ning Xi did not know what to say.</p><br/><p>She was afraid that the guy would suffer, but she never thought about herself, or about the fear of facing single motherhood and the pain of going through an abortion.</p><br/><p>Then again, she was not the right person to tell her off since Ning Xi had a similar foolish experience before as well.</p><br/><p>No one would be able to help her. Ning Tianxin could only struggle through it herself.</p><br/><p>Ning Xi was actually relieved that Ning Tianxin decided to abort the child. It would be really difficult if she were to become a single mother.</p><br/><p>Although she did not know who the man was, from Ning Tianxin's description, he did not sound like a reliable person.</p><br/><p>\"You've decided?\" Ning Xi asked.</p><br/><p>Ning Tianxin took a deep breath and nodded. \"Mmm.\"</p><br/><p>Ning Xi opened her arms wide and hugged Ning Tianxin. \"Alright, I'll support whatever decision you make. The pregnancy tests aren't always 100% accurate, so the first thing to do tomorrow is to do a checkup at the hospital. I'll accompany you tomorrow!\"</p><br/><p>\"Thank you, Xiao Xi.\"</p><br/><p>\"Don't mention it! If you really want to thank me, tell me who that man is. I'm so angry right now, I wish I could beat him up!\" Ning Xi started rolling up her sleeves.</p><br/><p>Ning Tianxin smiled. \"Xiao Xi, stop messing around. That man...he's pretty powerful in Imperial. I didn't want to tell you because I know you'd surely do something. And you don't have to. It was I who loved him for so many years. It was an accident that night after all…\"</p><br/><p>Ning Xi looked disappointed, \"Alright, if someday you change your mind and want him beaten up, you must tell me!\"</p><br/><p>…</p><br/><p>Ning Xi was worried about leaving Ning Tianxin alone, so she stayed there for the night.</p><br/><p>At midnight, her phone suddenly rang.</p><br/><p>She saw it was Lu Tingxiao's name, Ning Xi quickly got up. \"Hello?\"</p><br/><p>\"Where are you?\" Lu Tingxiao asked.</p><br/><p>\"I'm over at my cousin's place! Are you done with work?\"</p><br/><p>\"Just finished. Are you alright?\"</p><br/><p>Ning Xi was a little taken aback. \"Uh...you knew about it…\"</p><br/><p>She did not want to tell him about what had happened because he had been so busy, but he still found out somehow.</p><br/><p>\"You don't have to worry about me. It's not really a big deal. I transferred my shares over to my aunt and settled the matter once and for all. I'm here with my cousin because...something's happened to her. I might have to stay with her for a while!\"</p><br/><p>Ning Xi frowned. \"Do you also know...about the appearance of him at the party?\"</p><br/><p>\"Mmm,\" Lu Tingxiao grunted.</p><br/><p>\"I've been trying to ask..things seem to be hectic for you. Is it because…\" Ning Xi was worried that that guy would do anything to Lu Tingxiao because of her.</p><br/><p>\"Open the door,\" Lu Tingxiao said suddenly.</p><br/><p>\"Huh?\" Ning Xi was confused. \"You...you're at my cousin's place?\"</p><br/><p>\"Mmm.\"</p><br/><p>Ning Xi carefully walked out of the room and when she saw Ning Tianxin already sound asleep, she then quietly walked downstairs.</p><br/>\n</div>"}