{"title": "Chapter 1325: Pregnant", "id": 1325, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1325-pregnant", "volume_title": "Volume 14", "body": "<h1>Chapter 1325: Pregnant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1325: Pregnant</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The sound of the knocking door rang through the house.</p><br/><p>The house was dark without any lights on, so she did not know if anyone was even inside.</p><br/><p>However, it was already so late, and Ning Tianxin did not have anywhere to go either. Logically, the only place she could be at was here!</p><br/><p>Could something have happened inside?</p><br/><p>Ning Xi kept ringing the doorbell, but no one opened it. She was prepared to break down the door.</p><br/><p>At that moment, the door was opened from the inside.</p><br/><p>Ning Tianxin stood there looking pale. Her expression was stunned, and when she saw Ning Xi, she looked like she could not bear to hold on any longer as she broke down in Ning Xi's arms. \"Xiao Xi, Xiao Xi...what should I do?\"</p><br/><p>Ning Xi instantly understood her. \"You're...pregnant?\"</p><br/><p>When she heard the words, Ning Tianxin's body trembled hard and she nodded slightly. Her tone was emotional as she admitted, \"Yes, I'm pregnant. I've tried quite a few different types of pregnancy tests...and tested many times. All of them said positive...all of them!\"</p><br/><p>\"Okay, okay, don't worry. Let's go in and talk!\" Ning Xi suppressed her murderous rage and carefully guided Ning Tianxin inside.</p><br/><p>She switched on the lights and when she saw the pregnancy tests strewn on the table, Ning Xi felt a wave of headache coming on.</p><br/><p>\"How many months has it roughly been?\" Ning Xi asked.</p><br/><p>\"About three months...\"</p><br/><p>\"Do you have any symptoms?\"</p><br/><p>\"I'm just sleepier, have a bad appetite, and a slight urge to puke...but when I was sick previously, I had similar symptoms. My period would also be irregular when I'm stressed, so I didn't even think it could be this at all,\" said Ning Tianxin as she buried her head in her hands out of frustration.</p><br/><p>Ning Xi pinched the space between her brows and asked the key question, \"What are you doing to do now? Do you want this child or not?\"</p><br/><p>\"No...I don't want it.\" Ning Tianxin immediately shook her head.</p><br/><p>Ning Xi thought Ning Tianxin would not be able to let it go. After all, it was the child that she conceived with the man she had liked for many years. She did not think Ning Tianxin would be so firm in saying \"no\", so she could not help but be shocked. \"You sure?\"</p><br/><p>Ning Tianxin nodded in certainty. \"Xiao Xi, I will miss this child, but I can't have it. I don't want my tragedy to reenact on this child.\"</p><br/><p>When she heard this, Ning Xi came to a realization.</p><br/><p>Ning Tianxin's parents had always had a bad relationship. As a victim of it, she naturally did not wish for her future child to suffer the same fate.</p><br/><p>Ning Tianxin slowly said, \"That person...he already has someone he likes. He really, really likes her the same way I like him. He's liked her for many years, so I understand very well that there's no way he'd give up on that woman! I don't want to reach the point of using a child to tie him down. That'd be too lowly. I can't keep this child!\"</p><br/><p>When she heard Ning Tianxin's words, Ning Xi could not help but feel admiration. Her cousin looked weak, yet she was quite opinionated on something like this.</p><br/><p>However, based on Ning Tianxin's suffering demeanor, she did not need to ask to know that she had struggled hard to come up with such a cruel decision.</p><br/><p>Ning Xi still did not have the heart to let it be. She tried to ask, \"Sis Tianxin, how about you decide after asking that guy? Maybe the two of you could still work things out?\"</p><br/><p>Ning Tianxin shook her head. \"No need. I've already confirmed how he feels based on the last time. I know that the night after he was with me, he felt horrible. Horrible for betraying the person he likes, so why should I make life hard for him again?\"</p><br/>\n</div>"}