{"title": "Chapter 1339: Lu Tingxiao Come!", "id": 1339, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1339-lu-tingxiao-come", "volume_title": "Volume 14", "body": "<h1>Chapter 1339: Lu Tingxiao Come!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1339: Lu Tingxiao Come!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Damn it! Warn me before you go crazy, alright?\"</p><br/><p>Ning Xi nodded and replied, \"Oh…\"</p><br/><p>\"Let's go now! What are you looking about for?\" Tang Lang realized that Ning Xi was not following him. He looked over at what Ning Xi was staring at. It was a bunch of guys with motorcycles surrounding a pretty girl.</p><br/><p>\"Hey, girl, hang out with me!\"</p><br/><p>\"I...I can't, my friends are inside waiting for me…\"</p><br/><p>\"Just to look at that male singer? What's so good about him?! Let's go! I'll make sure you'll feel very good tonight…\"</p><br/><p>\"Hey, let go of me!\"</p><br/><p>…</p><br/><p>\"Please, I'll ask the guards to take care of this, alright? Can you not get involved again? I just only got you out! The reporters are going to be here anytime soon!\" Tang Lang was really exhausted.</p><br/><p>Ning Xi started counting, \"Three...two…\"</p><br/><p>\"Huh? What are you counting?\" Tang Lang was confused.</p><br/><p>\"One!\" Ning Xi suddenly sprinted forward and kicked the man who was on the motorcycle down. She then rode the bike and escaped.</p><br/><p>Tang Lang was speechless.</p><br/><p>Was that countdown meant to be a warning to him?</p><br/><p>Thank you very much!</p><br/><p>The man who was harassing the girl just a minute ago was enraged. \"Damn it! That bastard! He dared to take my bike!\"</p><br/><p>\"Get him!\"</p><br/><p>\"Go!\"</p><br/><p>…</p><br/><p>Ning Xi was really a skilled troublemaker. There were about a dozen of people chasing after her. They all looked ferocious and were chasing her on their expensive, heavy-duty bikes.</p><br/><p>Tang Lang could only continue to follow them. He grabbed one of their bikes and rushed towards Ning Xi.</p><br/><p>He was still taking the salary of a bodyguard after all!</p><br/><p>What an inhumane job!</p><br/><p>Soon, the group dispersed, and only the pretty girl was left there alone.</p><br/><p>Was she mistaken? Why did the person just now look like Bro Xi?</p><br/><p>…</p><br/><p>Tang Lang's sixth sense told him that he would not be able to handle Ning Xi alone tonight, so he decisively made a call to Lu Tingxiao while chasing Ning Xi. \"Hey! Boss, your Ning Xi has gone crazy! She's like a wild dog now! If you don't come and hold her back, I really can't take it anymore!\"</p><br/><p>\"Where are you?\" Lu Tingxiao did not say much, going straight to the point.</p><br/><p>\"I'm... I only know where I am now, but I can't be sure about later! I'm moving at a really high speed! I'm on the highway connecting Sky Dragon Bay and Death Valley... I'm losing her! Please come here quickly!\" Tang Lang ended the call and quickly caught up.</p><br/><p>As Tang Lang caught up with them, the dozen people were already beaten up by Ning Xi.</p><br/><p>And she was not letting them go.</p><br/><p>Ning Xi squatted down in front of them. \"I'll ask you guys a question. The person who gets it right can leave…\"</p><br/>\n</div>"}