{"title": "Chapter 1345: Only One Way Left", "id": 1345, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1345-only-one-way-left", "volume_title": "Volume 14", "body": "<h1>Chapter 1345: Only One Way Left</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1345: Only One Way Left</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Everyone guessed that the announcement was about the marriage between the Ning and the Su family.</p><br/><p>Were Ning Xueluo and Su Yan finally going to get married?</p><br/><p>If they really got married, to a certain extent, it would crush the rumor of Ning Xueluo being an adopted daughter because there would be no way the Su family would agree to Su Yan marrying a foster daughter from some unknown rural village.</p><br/><p>The sun rose slowly. It was getting brighter and brighter outside.</p><br/><p>In the study room of the Ning residence, Ning Yaohua had stayed up the whole night.</p><br/><p>There was a knock on the door. Zhuang Lingyu came in with a bowl of tonic. \"Yaohua, have something to eat!\"</p><br/><p>Ning Yaohua looked at his wife and sighed, \"Lingyu, what do you think...if I transfer the 15% share I have to Xueluo?\"</p><br/><p>Zhuang Lingyu's eyes brightened. \"Yaohua, you finally thought this through?\"</p><br/><p>Ning Yaohua did not say a word. He did not even have to think about it. There was only one option left.</p><br/><p>He had originally planned to get the 10% of shares from Ning Xi, then he would become the biggest shareholder in the company. In addition to the strong support of Su family, Ning Yaobang and Ning Qiutong would then have nothing to be afraid of. Only if that night, Ning Xi would have just helped him out a little, then he would have gotten billions of dollars of investment funds…</p><br/><p>But now, it was all ruined.</p><br/><p>That damned brat Ning Xi! Was she really born to go against him?</p><br/><p>Ever since she came back, he had been on a streak of bad luck!</p><br/><p>Zhuang Lingyu quickly said, \"There's nothing much to think about anyway. Everything will be solved if you transfer your share to Xueluo! Can't you trust Xueluo enough? Yaohua, make your decision quickly. I saw Xueluo's already packed up her things. Are you going to regret after she leaves?\"</p><br/><p>After some time of silence, Ning Yaohua finally spoke up, \"Call Xueluo over.\"</p><br/><p>\"Okay, I'll go now!\"</p><br/><p>Zhuang Lingyu went to get Ning Xueluo immediately as she was afraid of any sudden changes.</p><br/><p>Ning Xueluo saw Ning Yaohua's exhausted expression and she looked down. \"Father, did you not sleep for the whole night? I'm sorry... It's all my fault…\"</p><br/><p>Zhuang Lingyu felt her heart ache looking at her daughter. \"How can this be your fault? It's all caused by that brat! We're glad that you're still with us! If not, your father and I really wouldn't know what to do!\"</p><br/><p>Ning Yaohua looked at his daughter and sighed, \"Xueluo, I'm going to gamble everything on you. You have to make us proud, alright?\"</p><br/><p>Ning Yaohua then took out a share transfer agreement from his drawer. \"Xueluo, sign this, then the 15% share I have will be yours.\"</p><br/><p>Ning Xueluo stared at the contract in shock as she suppressed the light of joy in her eyes. She looked in bewilderment. \"Father, what are you doing?\"</p><br/><p>Zhuang Lingyu patted her shoulder. \"Xueluo, sign it.\"</p><br/><p>Ning Xueluo cast her eyes down. \"I'm not going to sign it! Father, Mother, who do you take me as?\"</p><br/><p>Ning Xueluo almost cried, \"I don't care how others see me, but I don't want you both to see me as a greedy woman! Father! Please take it back! I'd never take anything else from the Ning family!\"</p><br/>\n</div>"}