{"title": "Chapter 1362: Making The Ladyboss Happy", "id": 1362, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1362-making-the-ladyboss-happy", "volume_title": "Volume 14", "body": "<h1>Chapter 1362: Making The Ladyboss Happy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1362: Making The Ladyboss Happy</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The next day, the whole of the Lu Corporation once again felt the fear of the devil's dictatorship.</p><br/><p>Lu Jingli was surrounded by a large group of people.</p><br/><p>\"Second Master! What happened? Why is CEO Lu a little scary-looking today?\"</p><br/><p>\"A little? He's freaking scary! I don't even dare to take another look! When our eyes met, I thought I was going straight to hell!\"</p><br/><p>\"Second Master, did Boss get into a fight with the Lady Boss? You have to help them!\"</p><br/><p>\"Aren't they on good terms? Why did they get into a fight?! If Boss isn't doing anything about it, Second Master, you really have to do something!\"</p><br/><p>\"Right, you have to make our Lady Boss happy!\"</p><br/><p>\"If our Lady Boss is happy, our Boss will be happy. We will only get better days if our Boss is happy…\"</p><br/><p>…</p><br/><p>All the people in the company now understood the key to their Boss' emotional shift.</p><br/><p>It must be related to the Lady Boss.</p><br/><p>However, now that everyone knew Su Yimo was not the Lady Boss anymore, they did not know who it was, so they could not help even if they wanted to.</p><br/><p>They could only go to Lu Jingli.</p><br/><p>With everyone talking to him, he was really troubled. He was still single, so why did he have to be concerned with the lovebirds? It was really tiring!</p><br/><p>But the situation was pretty grave. The weekend was just the day after tomorrow.</p><br/><p>He had to find a way to find out what Xiao Xi Xi was trying to say…</p><br/><p>After work, Lu Jingli took Ning Xi's schedule for the day and went to the Royal Jazz Hotel.</p><br/><p>Ning Xi had a dinner function tonight.</p><br/><p>Lu Jingli executed his plan, staying in a dark corner of the hotel lobby and covering his face with a newspaper.</p><br/><p>Time passed by.</p><br/><p>Ning Xi did not appear for a very long time and Lu Jingli accidentally fell asleep. When he woke up, it was already midnight. He quickly asked a nearby waiter, then found out that the people in the room had already left.</p><br/><p>The miserable Lu Jingli could only go straight to her place.</p><br/><p>When he was about to leave, he heard a familiar voice. It sounded like Ning Xueluo, and he heard Ning Xi's name being mentioned…</p><br/><p>Lu Jingli stepped back and hid in an empty room.</p><br/><p>\"Xueluo, are you alright?! You drank too much!\"</p><br/><p>\"Haha.. .I'm okay... I'm going to get married... I'm just happy…\"</p><br/><p>\"Xueluo, be careful!\"</p><br/><p>\"Sis Chang, be honest with me. Are you regretting the decision of letting Ning Xi go?\"</p><br/><p>\"I'm not…\"</p><br/><p>\"Let me tell you... Ning... Ning Xi, that witch... She's never going to beat me... No matter how high she reaches... I can always bring her down... Do you believe me?\"</p><br/><p>\"Yes, yes, yes, I believe you!\" It was clear from Chang Li's tone that she replied for the sake of replying.</p><br/><p>Ning Xueluo was unhappy with her attitude. \"You don't believe me? Let me tell you... Ning Xi... At 18... She was pregnant at 18... and she even delivered the child... Did you know that? Hahaha…\"</p><br/><p>\"W-What?!\" Chang Li was shocked. \"Then... What happened to the child?\"</p><br/><p>\"Died... That child died when it was born... What a waste... If that child was still alive... How wonderful it would be…\"</p><br/><p>…</p><br/>\n</div>"}