{"title": "Chapter 1363: Xiao Xi Xi, You Traitor!", "id": 1363, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1363-xiao-xi-xi-you-traitor", "volume_title": "Volume 14", "body": "<h1>Chapter 1363: Xiao Xi Xi, You Traitor!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1363: Xiao Xi Xi, You Traitor!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After Ning Xueluo and Chang Li left, Lu Jingli came out of the room with a shocked expression.</p><br/><p>He did not go to Ning Xi's place anymore. Instead, he headed right back to the Platinum Palace.</p><br/><p>\"Bro! Bro! I overheard big news!\" Lu Jingli found Lu Tingxiao in the study room, panting as he burst in.</p><br/><p>There was only a dim light turned on. Lu Tingxiao was looking out at the night view.</p><br/><p>Although his face was not revealed, Lu Jingli felt like he was about to be suffocated by the depressed atmosphere when he stepped into the room. The room was extremely dangerous…</p><br/><p>His brother's condition was much worse than he imagined…</p><br/><p>Lu Jingli continued with his report anyway, \"Bro, I was about to look for Xiao Xi Xi just now, but I coincidentally overheard the conversation between Ning Xueluo and her assistant. She said that... Xiao Xi Xi was pregnant when she was 18... And gave birth to a dead child... I noticed that she was really drunk when she said it... So, I'm not sure if she's telling the truth...\"</p><br/><p>After he finished, the room remained dead silent.</p><br/><p>After some time, Lu TIngxiao replied, \"So what if it's real? So what if it's fake?\"</p><br/><p>For any other men who heard news like this regarding their girlfriends, they would have freaked out, but Lu Tingxiao did not react at all.</p><br/><p>\"Ugh…\" Lu Jingli was at a loss.</p><br/><p>Well, truth or not, it would not matter to his brother anyway.</p><br/><p>\"I mean, no matter it's the truth or not, I'm afraid that Ning Xueluo might be scheming something against Xiao Xi Xi again. Do you want me to come up with something to prevent this?\" Lu Jingli suggested.</p><br/><p>Lu Tingxiao was slightly more alert when he heard it was about his wife's safety. He raised his hand and indicated his agreement.</p><br/><p>\"Oh, okay, then I'll investigate it later!\" He looked at his brother worriedly. \"Bro, you don't have to worry so much. It's all my fault. Xiao Xi Xi would never break up with you…\"</p><br/><p>\"What if...she's going to?\" Lu Tingxiao looked back uncertainly at Lu Jingli.</p><br/><p>If she really wanted to leave, what should he do to keep her here?</p><br/><p>He had to admit that Lu Jingli's prediction might actually be accurate. Ning Xi's recent behavior was rather aligned with the prediction...</p><br/><p>It did not matter why she wanted to do this. What mattered was that she wanted to…</p><br/><p>Lu Jingli was anxious but his eyes brightened. \"Even you're not confident in yourself. Have some faith in Little Treasure! Just bring him along on your date! Xiao Xi Xi would never be able to say that she wants to break up with you!\"</p><br/><p>Lu Tingxiao looked lost. \"She's mentioned that it has to be just the two of us.\"</p><br/><p>Lu Jingli remained silent.</p><br/><p>She had explicitly mentioned to not bring Little Treasure?</p><br/><p>Damn it... Things are getting serious…</p><br/><p>Xiao Xi Xi, you traitor!</p><br/>\n</div>"}