{"title": "Chapter 1360: Seen As A Romantic Rival", "id": 1360, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1360-seen-as-a-romantic-rival", "volume_title": "Volume 14", "body": "<h1>Chapter 1360: Seen As A Romantic Rival</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1360: Seen As A Romantic Rival</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>With Ning Xi's grave warning, Mo Yuxiu finally decided to stop. The crowd first gathered for a meeting at the advertising department, then they proceeded to Emerald Villa together and had a press conference for the commercial \"Seven Days\".</p><br/><p>Ye Ying had specially chosen a remote and secluded location to organize the press conference, yet when they arrived, the venue was already crowded with people. Even if the hotel had done preparations in advance, they still could not hold back the enthusiasm of the fans. At last, even the police force had to be there.</p><br/><p>Among these seven people, just a group of their fans would be enough to overwhelm. What more when it was all seven of them together! The crowd almost got into a fight.</p><br/><p>The funniest thing was that many fans had even change sides at the event, switching to be another person's fan. As for those fujoshis that liked to matchmake, with the seven Prince Charmings before them, they had already silently thought of all sorts of ships. They were in heaven!</p><br/><p>Ning Xi was already in bad condition. When she reached such a chaotic venue, she felt her head hurt even more, but she forced a smile and greeted the fans.</p><br/><p>As they walked in, being confused and disoriented, Ning Xi did not notice the staircase in front of her. When she walked up, she accidentally tripped.</p><br/><p>In the next second, before her body lost control, two hands unexpectedly reached out from her left and her right.</p><br/><p>Jiang Muye's expression darkened. He looked like a worried mother hen. \"What are you thinking about?! Can you watch where you're going? Do you want to perform kissing the floor for your fans?\"</p><br/><p>Mo Yuxiu did not expect to hurl out his arm too. He immediately withdrew it back when he realized what had happened, then he remained expressionless.</p><br/><p>It was just a brief interlude, yet the crowd had already burst into shrieks that could pierce through the roof.</p><br/><p>\"Ah, ah, ah, ah, ah! Muye pampers Bro Xi so much!\"</p><br/><p>\"XiYe, sugoi [1]!\"</p><br/><p>\"XiYe is canon [2], happiness!\"</p><br/><p>...</p><br/><p>Amid the shrieks, a few of Mo Yuxiu fans had also emotionally said, \"But Bro Xi is quite fitting with our Xiu Xiu too! Xiu Xiu is so tsundere [3] in front of Bro Xi! How cute!\"</p><br/><p>However, the moment they started, they were rebutted by Muye and Ning Xi's shippers [4], \"Huh! Bro Xi and Mo Yuxiu? What's this evil cult!? Drag them out! Our Muye and Ning Xi is the true canon, okay? From 'The World' to 'Our 18-Year Old Youth', no matter in a male or a female outfit...\"</p><br/><p>...</p><br/><p>As Mo Yuxiu listened to the fans' discussions, he could not help but take a second look at Jiang Muye's direction.</p><br/><p>Even though they were in the same company and had collaborated many times, it was not unusual for them to be close, yet he still felt their relationship was not merely platonic.</p><br/><p>Could Ning Xi's boyfriend really be Jiang Muye?</p><br/><p>Were the two of them secretly dating?</p><br/><p>\"Huh, Tang Xi... I thought how high your standards were, but they're just so low!\"</p><br/><p>\"Ah-choo!\" Up front, Jiang Muye who did not realize he had been perceived as a romantic rival, suddenly sneezed. He scratched his head and mumbled, \"Who's talking bad about me?\"</p><br/><p>...</p><br/><p>The commercial received the popular response that they had predicted and the press conference ended smoothly.</p><br/><p>A day very quickly passed by amid the bustle. Ning Xi had just reached home when her phone rang. Lu Jingli was calling.</p><br/><p>\"Hey, what's up?\" Ning Xi's tone was lazy, revealing a dispirited energy.</p><br/><p>\"Bro Xi, I'm at my brother's. A friend just gave me an Australian lobster and a king crab. I've moved it here. Come over and cook it! It's too wasteful to leave it to my chefs!\"</p><br/><p>When she heard that Lu Jingli wanted her to go over to Lu Tingxiao's place, Ning Xi immediately felt her back tense u. \"I can't today. I have to look through my script.\"</p><br/><p>\"Then, I'll just let my chefs cook it. Just come over to eat!\"</p><br/><p>\"I'm not free to eat either!\"</p><br/><p>...</p><br/><p>[1] Sugoi - Japanese for \"awesome\", \"amazing\", \"great\"</p><br/><p>[2] Canon - It's a term to describe pairings in fiction that are claimed to be obvious or a couple that is heavily promoted or suggested.</p><br/><p>[3] Tsundere - a Japanese term for character development that describes a person who is initially cold (and sometimes even hostile) before gradually showing a warmer, friendlier side over time.</p><br/><p>[4] Shippers - As mentioned in a previous chapter, \"ship\" is when a pairing is heavily supported by fans, and \"shippers\" are thus the fans of a certain pairing.</p><br/>\n</div>"}