{"title": "Chapter 1379: Loved For So Many Years", "id": 1379, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1379-loved-for-so-many-years", "volume_title": "Volume 14", "body": "<h1>Chapter 1379: Loved For So Many Years</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1379: Loved For So Many Years</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>That person was shocked to hear that. \"What?! No way! No wonder Master Mo looks so tragic... His parents have long wanted a grandchild. Now, they'll really drive him crazy! This is clearly going down the path of an arranged marriage due to a pregnancy!\"</p><br/><p>\"Sigh, our loyal one here finally waited for his goddess to return, and his hugest romantic rival Lu Tingxiao is now taken. When the time and tide were right, such a thing had to happen...\"</p><br/><p>\"Who's the woman? She must be quite high-ranking! That she could even get through our Master Mo!\"</p><br/><p>\"That I don't know...\"</p><br/><p>...</p><br/><p>\"Master Mo! Master Mo, stop drinking now!\"</p><br/><p>When they saw that Mo Lingtian had really drunk too much tonight, everyone started to advise him to stop as they were afraid there would be a mishap.</p><br/><p>Unfortunately, no matter who tried to tell him to stop, Mo Lingtian just continued to guzzle the booze like he was drinking water as if he really wanted to die from drinking. He kept muttering, \"Ziyao... Ziyao...\"</p><br/><p>\"Got it! Whoever hung the bell on the tiger's neck must untie it. I think we should just call Miss Guan over! Otherwise, something might really happen if we continue to let him drink on like this.\"</p><br/><p>A few people gathered around to discuss, then one of them called Guan Ziyao.</p><br/><p>About one hour later, Guan Ziyao finally arrived.</p><br/><p>Everyone else had very tactfully walked out, leaving the two of them some space.</p><br/><p>\"Why did you drink so much?\" Guan Ziyao frowned and took the glass away from him.</p><br/><p>When he saw who it was before him, Mo Lingtian instantly hugged her tightly as he looked hopeless. \"Ziyao... You found out, didn't you? I'm sorry, I'm really sorry... It wasn't intentional... That was just an accident... I was drunk. I thought she was you. I don't even like that woman...</p><br/><p>\"You know... I only have you in my heart... I like you... Ever since we first met when we were six years old, I have already liked you! I have liked you for more than 20 years!</p><br/><p>\"I've been waiting for you... Waiting for you to come back...No one can replace... Apart from you... I won't like anyone else anymore...\"</p><br/><p>Guan Ziyao watched the man's devoted manner and something flashed in her eyes.</p><br/><p>She was well aware of Mo Lingtian's feelings towards her, and she knew this a long time ago. To say that she was not moved at all would be lying. Sadly to her, the only person who was her match was Lu Tingxiao.</p><br/><p>How could she be willing to lose to that cheap woman as a failure, and settle for Mo Lingtian as the next best thing?</p><br/><p>Her dignity would definitely not allow that!</p><br/><p>\"How did your family find out about that woman's pregnancy? Did she tell them?\" Guan Ziyao frowned.</p><br/><p>Even though she never thought about being with Mo Lingtian, she still felt a little uncomfortable at the sound of such news.</p><br/><p>Mo Lingtian's face turned pale. \"When she went to the hospital for a checkup, the doctor was coincidentally my aunt. My aunt had found out the child was mine through her conversation with her cousin, then she told my parents...\"</p><br/><p>\"What a coincidence!\" Guan Ziyao asked.</p><br/><p>Mo Lingtian's thoughts were a mess, he held onto Guan Ziyao's hand, \"All of this is not important, no matter what, unless it's you... I won't marry anyone else...\"</p><br/><p>Guan Ziyao slowly pulled her hand away. \"Lingtian, I'm sorry, there's no way we'll get together. I really don't want to lose you as a friend. Didn't we say that we were going to be friends forever? The way you are behaving now is making things difficult for me...\"</p><br/>\n</div>"}