{"title": "Chapter 1377: Drag That Beast!", "id": 1377, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1377-drag-that-beast", "volume_title": "Volume 14", "body": "<h1>Chapter 1377: Drag That Beast!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1377: Drag That Beast!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After he tucked her into bed, Lu Tingxiao kissed her lightly on the lips.</p><br/><p>Ning Xi had not been sleeping well for the past few nights. After she had explained everything to Lu Tingxiao and all the stress had been relieved, she could not hold on any longer and fell asleep on the way home.</p><br/><p>Now, the girl opened her eyes in a daze and saw the gentleman before her. \"Mmm... Home?\"</p><br/><p>\"Mm-hmm.\" Lu Tingxiao nodded. \"Home.\"</p><br/><p>Ning Xi reached out with her arms and held onto his neck. \"I'm sleepy... I want to sleep...\"</p><br/><p>\"You can continue to sleep.\"</p><br/><p>She instantly frowned. \"Aren't you going to sleep with me?\"</p><br/><p>Lu Tingxiao almost said he would, then he caught hold of himself and said,\"I have some things to handle. I'll let Little Treasure accompany you, alright?\"</p><br/><p>Ning Xi nodded obediently. \"Mmm.\"</p><br/><p>\"Little Treasure, sleep with Mommy,\" Lu Tingxiao turned to his son and ordered.</p><br/><p>Obviously, the little bun did not need Lu Tingxiao's orders. He had long taken off his shoes and soon climbed on the bed to sleep with Mommy. \"Mommy, can Little Treasure sleep with you!\"</p><br/><p>Ning Xi hugged the soft and nice-smelling little bun before giving him a kiss, feeling incredibly contented.</p><br/><p>Lu Tingxiao kissed both his son and wife's forehead before getting up to leave.</p><br/><p>Lu Jingli was completely frustrated from the sidelines. \"Hey, I'm still here... All of you... Can you care about me first?\"</p><br/><p>Also, what did this familiar display of affection mean?</p><br/><p>They even had to display it with all three of them together!</p><br/><p>It was not what he had imagined at all...</p><br/><p>...</p><br/><p>After he settled Ning Xi, Lu Tingxiao indicated for Lu Jingli to follow him to the study room. Lu Jingli obviously followed after like an excited child.</p><br/><p>\"Bro, what happened? Did you and Xiao Xi Xi break up?\"</p><br/><p>Lu Tingxiao shot him a sharp and cold look, and Lu Jingli immediately weakly gulped, \"I usually have accurate foresight. Could I have actually guessed wrongly this time?\"</p><br/><p>From the situation, it seemed quite obviously that he was indeed not as accurate as he thought...</p><br/><p>\"Did you investigate the thing from before?\" Lu Tingxiao asked.</p><br/><p>Lu Jingli did not immediately understand what Lu Tingxiao meant. \"Huh? What thing?\"</p><br/><p>\"The thing you heard from Ning Xueluo.\"</p><br/><p>Lu Jingli instantly looked unwell when he heard his brother. \"The initial investigations show that it's true. Xiao Xi Xi did indeed give birth to a dead child. As for the concrete situation, because I've been worried about you and Xiao Xi Xi's thing, I haven't done a detailed investigation...\"</p><br/><p>\"Investigate this. The more detailed, the better.\"</p><br/><p>Lu Jingli was a little shocked when he heard him. His brother was clearly not interested in this at all previously, yet after returning from Chang Chun City, he suddenly ordered him to investigate it thoroughly?</p><br/><p>Lu Jingli's thought process churned, then suddenly his IQ was on point. \"Uhh, Bro... Don't tell me that... The thing Xiao Xi Xi wanted to tell you this time... Was actually this...?\"</p><br/><p>Lu Tingxiao did not say anything, so it was considered a silent agreement.</p><br/><p>Lu Jingli was about to cry. \"What the hell? Just this?\"</p><br/><p>That meant he had just scared himself for so long!</p><br/><p>After being nerve-wrecked for half a day, Lu Jingli could finally relax. Okay, as long as they were not breaking up, it was fine if he had inaccurate foresight!</p><br/><p>Speaking of which, he suddenly really admired Little Treasure. Bloody hell! He was practically the pillar of the house with his calm manner!</p><br/><p>Next up, Lu Tingxiao and Lu Jingli exchanged some information with each other.</p><br/><p>When Lu Jingli finished listening, he was immediately furious. \"What?! What kind of shameless person is this!? A beast! Bro, don't worry, I'll help you drag this beast out!\"</p><br/>\n</div>"}