{"title": "Chapter 1371: Lu Tingxiao, Her Light", "id": 1371, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1371-lu-tingxiao-her-light", "volume_title": "Volume 14", "body": "<h1>Chapter 1371: Lu Tingxiao, Her Light</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1371: Lu Tingxiao, Her Light</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Sis, you're... You're so amazing! Where did you learn all of that from?! Oh, oh, oh, I almost forgot that in one of the interviews, you said that you were a stunt double when you had just entered the industry overseas. I thought it was just superficial! I didn't think it was this amazing! Sis, teach me if you have time! That way, I won't have to worry about people bullying us anymore!\" Tang Nuo spoke with an excitement as if he was admiring a superstar. It made Ning Xi's heavy heart relax a lot.</p><br/><p>She rubbed his head of hair and said, \"Okay, when there's a chance.\"</p><br/><p>When he saw that the atmosphere was a little odd in the house, Tang Nuo quickly reminded his parents, \"Father, Mother... Say something! Sis is finally home!\"</p><br/><p>As if the two of them had just woken up from a dream, Tang Shan seemed a little unsure of how to face this \"daughter\" that they had not seen for five years and had experienced such a huge change. He said awkwardly, \"Xiao Xi, thank you so much for this time... If it wasn't for you... Sigh...\"</p><br/><p>\"Look, now you've met such an incident the moment you returned! Have you eaten? I'll go cook for you lot!\"</p><br/><p>...</p><br/><p>As she watched what was once her close family now treat her with awkwardness and a cautious attitude, Ning Xi felt an indescribable feeling. She quickly said, \"Don't bother. I still have something to do tonight, so I have to rush back! Next time, when I'm free, I'll come back to meet you all!\"</p><br/><p>\"Oh, okay... Xiao Nuo, send her off.\"</p><br/><p>\"It's okay, Xiao Nuo, Father and Mother are just shocked. Accompany them, quickly get Father to the hospital to treat that wound.\" Ning Xi tried her hardest to ignore the expression on Sun Lan's and Tang Shan's faces that seemed relieved of a huge burden when she said she had to leave. She turned around and left very quickly.</p><br/><p>Behind her, when Sun Lan and Tang Shan heard Ning Xi address them as \"Father\" and \"Mother\", they were stunned, then both their eyes welled up.</p><br/><p>That was Xiao Xi...</p><br/><p>That was their daughter...</p><br/><p>It had been five years and she had finally come home, yet they were going to let her leave just like that...</p><br/><p>...</p><br/><p>Ning Xi did not know how she left the Tang residence. She felt as if her entire being was drowned in the salty ocean. It felt heavy and sticky, making her every step drain her of all her energy...</p><br/><p>The darkest part of her soul and her negative emotions all engulfed her like demons right at this moment.</p><br/><p>She was such an unlucky person; ever since she was born, she had been on the losing end.</p><br/><p>Losing all her most important things...</p><br/><p>The harder she tried to catch it, the quicker they disappeared.</p><br/><p>Only when she did not want anything anymore, would she stop losing...</p><br/><p>It was as if the road ahead had been sheathed by a layer of blurred mist. Across that mist, she seemed to see a silhouette...</p><br/><p>Under the glow of the blazing sunset, there was a familiar black Maybach and that lean figure that she knew so well.</p><br/><p>Every time, that figure seemed to pierce through the mist and light up her world with bedazzling sun rays...</p><br/><p>Yet, at this moment, her expression changed as if her death toll had just rung.</p><br/><p>\"Lu Tingxiao...\"</p><br/><p>\"Done with your thing?\" She was not sure how long Lu Tingxiao had waited there. There was a bunch of cigarette butts beside his feet and the light odor of tobacco on him.</p><br/><p>Ning Xi stood there, stunned. The instant she saw Lu Tingxiao, all the determination she had mustered for the past few days was instantly crushed to powder.</p><br/><p>She did not want to...</p><br/><p>Did not want to lose the person in front of her...</p><br/>\n</div>"}