{"title": "Chapter 1386: Security Camera Footage", "id": 1386, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1386-security-camera-footage", "volume_title": "Volume 14", "body": "<h1>Chapter 1386: Security Camera Footage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1386: Security Camera Footage</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At Ren Ai Hospital, when Mo Lingtian reached, Ning Tianxin was being wheeled out from the operation room.</p><br/><p>The girl's lips were dry and her face was pale white. Her skin was pale to the point it looked almost papery and transparent.</p><br/><p>\"Doctor, how's my cousin?\" Ning Xi went up to ask.</p><br/><p>There was a lot of sweat on the doctor's forehead. He looked tired and sighed, \"Fortunately, she got here on time. We managed to save her uterus, but…\"</p><br/><p>The doctor sounded like he was giving a lecture. \"Didn't her doctor tell her that getting an abortion would really hurt her body, and might even cause her to be unable to get pregnant again? And she even went to an unauthorized clinic for an abortion! I'm afraid she won't be able to get pregnant in the future.\"</p><br/><p>\"My fault... It's all our fault... If we didn't stop her from doing the abortion in the hospitals, she wouldn't have been forced to go to an unauthorized clinic.\" Kang Shuhui was crying as she saw the girl on the bed.</p><br/><p>Mo Lingtian stood nearby, he stared at the pale girl blankly.</p><br/><p>Ning Xi saw Mo Lingtian. Without considering that Mo Jianzhang and Kang Shuhui were there, she wanted to go up to him, but Lu Tingxiao stopped her. \"Hey, go and be with your cousin. Let me handle this, alright?\"</p><br/><p>Ning Xi looked at Ning Tianxin. She obeyed and went to look after her.</p><br/><p>Kang Shuhui and Mo Jianzhang did not even look at Mo Lingtian. They carefully followed Ning Tianxin into the room.</p><br/><p>Only Lu Tingxiao and Mo Lingtian were left at the corridor.</p><br/><p>Lu Tingxiao went up to Mo Lingtian, not saying anything. He clicked on a video on his phone and handed over to Mo Lingtian.</p><br/><p>Mo Lingtian stared blankly at him, then took his phone.</p><br/><p>Lu Tingxiao patted his shoulder then walked into the room.</p><br/><p>Mo Lingtian looked like his soul left him. He held the phone in his hand and sat down on a bench nearby.</p><br/><p>The video seemed to be a security camera footage.</p><br/><p>In the video, it looked like it was a small clinic.</p><br/><p>Suddenly, Mo Lingtian's expression changed. As expected, Ning Tianxin appeared.</p><br/><p>Mo Lingtian straightened his back and stared at the lonely girl.</p><br/><p>Ning Tianxin looked lost. She went in alone, asked the nurse some questions, paid, did a checkup, and waited on the bench.</p><br/><p>The girl looked calm the whole time.</p><br/><p>Until... Until the doctor told her it was ten more minutes before the operation…</p><br/><p>The girl was holding the sonogram image, and she broke down.</p><br/><p>From his view, he could only see the girl with her head hanging down and her whole body shaking. She did not make any sound, but his heart was akin to being squeezed by a metal fist. It was suffocating.</p><br/><p>In the video, there was sound of the girl sobbing…</p><br/><p>\"Baby... I'm sorry... I'm sorry…</p><br/><p>\"Sorry... Mother can't keep you…</p><br/><p>\"Sorry... Mother loves you…\"</p><br/><p>…</p><br/><p>\"Ning Tianxin, you can come in for the operation now!\" The doctor announced to her in the video.</p><br/><p>The girl looked up. There were fear and tears on her face.</p><br/><p>The next moment, she quickly took out her phone and typed on it. She was texting someone and looked like she was asking for help.</p><br/><p>Nevertheless, in the end, her expression hardened. She deleted that long message she had just typed.</p><br/><p>Mo Lingtian unlocked his phone and looked at the last message the girl sent him. \"Lingtian\". Two lonely words. He looked at the unfinished message, then balled his fists tightly and cried uncontrollably.</p><br/>\n</div>"}