{"title": "Chapter 1387: My Wife's Hands Might Be Injured", "id": 1387, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1387-my-wifes-hands-might-be-injured", "volume_title": "Volume 14", "body": "<h1>Chapter 1387: My Wife's Hands Might Be Injured</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1387: My Wife's Hands Might Be Injured</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>People were walking by the corridor, cautiously looking at the man in his slippers and pajamas sitting on the bench and sobbing like a little child.</p><br/><p>After some time, the door of the room opened and a tall man came out. He stood in front of Mo Lingtian. \"You finished?\"</p><br/><p>Mo Lingtian raised his head slowly, looking utterly miserable. \"Lu Tingxiao, you're so cruel.\"</p><br/><p>Lu Tingxiao replied, \"I'm just worried that my wife's hands might get injured if she hits you.\"</p><br/><p>Ning Xi had just walked out of her painful past and had not recovered fully yet. How could he allow her to worry about something else?</p><br/><p>Mo Lingtian was speechless.</p><br/><p>Was this how bros were supposed to act?</p><br/><p>Sometimes, a man knew how to make another man feel pain better than a woman did.</p><br/><p>Even if Ning Xi beat him to death, the pain could not compare to when he watchedTianxin getting the abortion all alone.</p><br/><p>When he remembered her expression of despair before she went into the operation room... That incomplete message... His heart shrunk…</p><br/><p>Three days ago, when she told him she would abort the child, she had seemed so relaxed, so indifferent.</p><br/><p>And he had actually believed it.</p><br/><p>Until the very end, he suspected her and even misunderstood her.</p><br/><p>Mo Lingtian sat there looking lost. \"Lu Tingxiao, that last moment, Tianxin was about to send me a message. What do you think she was going to say?\"</p><br/><p>Lu Tingxiao glanced at him, then said calmly, \"At that last moment, Ning Tianxin was not acting as the woman who loves you. She was acting as a mother. From her maternal instincts, she probably wanted to endure all the accusations, just so she could save her child.\"</p><br/><p>Mo Lingtian, who had calmed down, started to tear up again.</p><br/><p>Lu Tingxiao continued, \"But, she knew you didn't want it. So despite her despair, she went into the operation room and killed her own child, just to grant you your wish. She knew the risk of the abortion, which was that she might never get pregnant again, but she was willing to trade her life for yours.\"</p><br/><p>\"Stop talking!\" Mo Lingtian pulled at his hair as he howled.</p><br/><p>When Ning Xi walked out of the room, she heard what Lu Tingxiao said. she also saw Mo Lingtian's trembling body, curling himself up into a ball and yelling painfully.</p><br/><p>Lu Tingxiao went up to her, between bros and wife, it was obvious who he was with, \"Are you still angry?\"</p><br/><p>Ning Xi pinched the space between her eyebrows as she saw Mo Lingtian. \"Whatever. I won't hit him even if I was still angry. Beating him up would just help purge his guilt.\"</p><br/><p>Ning Xi noticed that Lu Tingxiao's phone kept ringing, so she huffed, \"Lu Tingxiao, Sis Tianxin is alright now. You can go and work on your stuff now!\"</p><br/><p>\"Alright, give me a call if you need anything.\"</p><br/><p>\"Mmm.\" Ning Xi nodded, then she tiptoed and kissed the man in appreciation. \"Lu Tingxiao, thank you.\"</p><br/><p>Everything had happened too suddenly. She had freaked out last night but almost everything had been settled by Lu Tingxiao. He even lectured Mo Lingtian for her.</p><br/><p>Lu Tingxiao patted her head. \"Don't exhaust yourself.\"</p><br/>\n</div>"}