{"title": "Chapter 1384: Who Is Stupid Now?", "id": 1384, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1384-who-is-stupid-now", "volume_title": "Volume 14", "body": "<h1>Chapter 1384: Who Is Stupid Now?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1384: Who Is Stupid Now?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi's mind was filled with the image of the girl lying lifelessly on the operating theatre. Her body shook and her legs were weak.</p><br/><p>Why? Why did it turn out like this?</p><br/><p>\"It's all my fault... My fault... I should've always been by her side,\" Ning Xi's entire being was engulfed with blame towards herself.</p><br/><p>Lu Tingxiao felt his heart ache as she held the girl by her shoulders. \"Don't think too much. It's got nothing to do with you. Something probably happened on Mo Lingtian's end.\"</p><br/><p>Otherwise, Ning Tianxin would not have suddenly gone to a small clinic for abortion alone late at night.</p><br/><p>\"Mo Lingtian!\" Ning Xi gritted her teeth and there was fire in her eyes. She took out her phone and chaotically found Mo Lingtian's number.</p><br/><p>After she called him, the other end beeped to say his phone was switched off. Ning Xi was so enraged that she wanted to rush over to him, but she could not leave the hospital now.</p><br/><p>\"Don't rush,\" consoled Lu Tingxiao as he rubbed her head, then he called Mo Jianzhang.</p><br/><p>...</p><br/><p>It was dawn at the Mo residence.</p><br/><p>The sun had just risen when Mo Lingtian was pulled out of bed by the servants as instructed by Mo Jianzhang.</p><br/><p>In the living room downstairs, Mo Jianzhang and Kang Shuhui were discussing a suitable gift for the first meeting.</p><br/><p>On the sofa, Mo Lingtian's hair was a mess. He was still wearing his pajamas from last night and his expression was apathetic.</p><br/><p>When she saw Mo Lingtian's indifferent manner, Kang Shuhui said lamentably, \"Lingtian, we're going to the Ning residence to propose a marriage today. How long more do you want to dillydally? Do you want them to think that we Mos don't even have the most basic etiquettes? Or do you want to regret again?! Last night, you agreed!\"</p><br/><p>Mo Lingtian leaned on the sofa and smirked, \"What's the difference whether I agree or not? This is the wedding you guys want anyway... You two can just go...\"</p><br/><p>Hah, he once swore that he would never get married in this lifetime unless it was her. Even when his opponent was Lu Tingxiao, he had never given up. He lasted till today and finally saw a sliver of hope, but now, he was actually going to get married...</p><br/><p>He and Ziyao had to thoroughly end like this...</p><br/><p>He would be imprisoned and shackled forever now without any more hope...</p><br/><p>Mo Jianzhang was in a towering rage. \"You fool, you can't differentiate the good from the bad. Tianxin is such a wonderful girl. You will regret it one day!\"</p><br/><p>When Mo Lingtian heard his father's words, there was a larger cloud and feeling of rejection in his heart.</p><br/><p>He had also thought that Ning Tianxin was different from the other women. Even when Ziyao said that it was all too coincidental, he had not suspected her. However, now, she did not fulfill her promise of aborting the child. Instead, she had managed to bribe his parents in just a few days...</p><br/><p>When he thought about this, Mo Lingtian's long-suppressed anger exploded at this moment. \"If she is really as wonderful as you say, could she push me to this point? If she is as innocent as you think, could it be such a coincidence that Aunty found out her child's father is me? Am I the stupid one or are you two? Huh, or maybe, you don't even care what kind of person she is! You only care about the child who can continue the bloodline! I regret! I regret it the most that I've judged her wrongly!\"</p><br/><p>\"You...\" Mo Jianzhang was about to erupt when his phone suddenly rang.</p><br/><p>It showed that the caller was Lu Tingxiao.</p><br/><p>Why would Lu Tingxiao call him this early in the morning?</p><br/><p>There was a trace of doubt on Mo Jianzhang's face as he picked up. \"Hello? Tingxiao! It's quite early, what is it?\"</p><br/><p>\"Uncle Mo, is Lingtian beside you?\"</p><br/><p>\"Yes, yes, you're looking for Lingtian?\"</p><br/><p>\"Uncle Mo, please turn on your loudspeaker,\" said Lu Tingxiao from the other end of the phone.</p><br/>\n</div>"}