{"title": "Chapter 1389: The Only Thing You Can Do", "id": 1389, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1389-the-only-thing-you-can-do", "volume_title": "Volume 14", "body": "<h1>Chapter 1389: The Only Thing You Can Do</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1389: The Only Thing You Can Do</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Amidst the dead silence, there was the sound of a phone ringing. Mo Lingtian reflexively reached for his phone. When he saw whose name flickered on the screen, he turned pale in an instant.</p><br/><p>It was Ziyao.</p><br/><p>The child he once thought was threatening was now gone. Ning Tianxin did not entangle herself with him. His parents were no longer forcing him to get married, and Ziyao herself was even calling him...</p><br/><p>When the day turned to dawn, it was not the endless darkness that waited for him. Instead, his life had returned completely to the right track.</p><br/><p>Still, why did he feel that all of this was meaningless? The only thought in his head was that he wanted to see her... He desperately needed to see her...</p><br/><p>Mo Lingtian hung up on Guan Ziyao's call. He looked to Ning Xi with an ashen face and continued to repeat determinedly, \"I just want to have a look.\"</p><br/><p>Ning Xi's gaze was cold towards the man before her. \"Mo Lingtian, if you genuinely have even the slightest guilt towards Sis Tianxin, then please never appear before her ever again. This is the only thing you can do for her.\"</p><br/><p>Mo Lingtian's back stiffened. He stood at the same step for a long, long time...</p><br/><p>It was probably more than ten minutes when he finally made a move, turning around, and walking step by step away...</p><br/><p>Mo Lingtian finally left. Ning Xi massaged her temples and sighed before she took out her phone to make a call.</p><br/><p>The other end rang for a short while before being picked up. Then, there was the sound of a girl's pleasantly surprised voice. \"Hello? Bro Xi!\"</p><br/><p>\"Annie, are you free now? Can you do me a favor...\"</p><br/><p>Before Ning Xi could finish, the girl's anguished weeping was heard. \"Bro Xi...\"</p><br/><p>Ning Xi's worry spiked. She quickly asked, \"Annie, what's wrong?\"</p><br/><p>\"Bro Xi, I've been grounded by the Big Boss!\"</p><br/><p>Ning Xi frowned. \"Grounded? What did you do? Why is he grounding you?\"</p><br/><p>\"I think the Boss might be jealous of me,\" answered Annie in between sobs and sniffles.</p><br/><p>\"Uh... What?\" Ning Xi was confused, not understanding Annie.</p><br/><p>\"Bro Xi, ever since that day you called me to meet up, the Boss has been asking people to watch me. They won't allow me to leave the house. Most importantly, he even snatched the little biscuits you made for me! All of them!\" Annie explained as she started to snivel heart-wrenchingly again.</p><br/><p>Bloody hell! That guy actually snatched away the biscuits I gave Annie? What the hell?</p><br/><p>Ning Xi's mouth twitched. She was so done! She quickly consoled the girl, \"Be good, Annie. Don't cry, don't cry. They're just some handmade biscuits. I'll just make them again for you the next time! I'll make as many as you want! Don't be sad!\"</p><br/><p>Annie continued to sob, then she anxiously asked, \"Uh, Bro Xi, why do you need my help? Are you injured?\"</p><br/><p>Ning Xi pinched her glabella. \"It's not me. It's a friend of mine... Is Satan at home or is he at the company now?\"</p><br/><p>\"At this time, he should be in the office,\" answered Annie.</p><br/><p>\"Then, who's looking after you at home? Is First Senior Brother there?\" Ning Xi asked again.</p><br/><p>\"It's Sis 16, I don't know whether First Senior Brother is here or not...\"</p><br/><p>\"Okay, got it, wait for me. I'll go to you.\"</p><br/><p>\"Mmm,\" the little girl responded obediently.</p><br/><p>After hanging up on Annie, Ning Xi made another call.</p><br/><p>The phone rang more than ten times before the phone owner finally picked it up slowly. Then, came the sound of the man's lazy and sleepy drawl, \"Hello?\"</p><br/><p>\"Hey, Second Senior Brother! Come with me to the haunted villa!\" Ning Xi spoke quickly.</p><br/>\n</div>"}