{"title": "Chapter 1397: Could Only Rely On Herself", "id": 1397, "volume": 14, "url": "http://boxnovel.org/hidden-marriage-chapter-1397-could-only-rely-on-herself", "volume_title": "Volume 14", "body": "<h1>Chapter 1397: Could Only Rely On Herself</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1397: Could Only Rely On Herself</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After the ceremony ended, Ning Xi apologetically rejected the upcoming social with the reason that her family member was ill, then she rushed right back to the hospital to observe Ning Tianxin.</p><br/><p>Ning Xi had just reached the hospital entrance when she saw someone running towards her.</p><br/><p>\"Tang Xi, you bastard!\"</p><br/><p>\"Oh, Second Senior Brother, you're back!\" Ning Xi skimmed the man before her through her sunglasses.</p><br/><p>Tang Lang's hair was messy and his clothes were a dirty grey. He had even rolled through tree leaves, the bits making him look even more disheveled. One look and it was clear that the tumble had been pretty vigorous...</p><br/><p>\"Punk, I went to help you, but at last, you ditched me and left me alone!\"</p><br/><p>\"I just didn't want to disturb you and First Senior Brother's love for one another! I haven't even asked you yet. What did you do to trigger First Senior Brother like this?\" Ning Xi looked curious and closed in to ask.</p><br/><p>Tang Lang's expression changed slightly and he said unhappily, \"Go away! Children shouldn't be so bothered about adult matters!\"</p><br/><p>Then, he ran off.</p><br/><p>Ning Xi looked towards the direction that Tang Lang left and worry floated onto her face.</p><br/><p>It was probably related to Tang Lang betraying the faction and the reason he left the organization. Previously, she had wanted to ask Lu Tingxiao about it, but with Tang Lang's secretive attitude that clearly did not want anyone to know, she felt it would not be good to randomly ask such a question...</p><br/><p>She walked to the ward and saw that Xiong Zhi was guarding the door diligently like a statue.</p><br/><p>\"Miss Xiao Xi!\"</p><br/><p>\"Did anyone come while I was away?\" Ning Xi asked.</p><br/><p>\"No.\"</p><br/><p>Ning Xi nodded. At least, that guy was tactful.</p><br/><p>Ning Xi pushed open the door and saw that Annie was talking to Ning Tianxin who was lying on the sick bed.</p><br/><p>\"Sis Tianxin, you're awake!\" Ning Xi quickly walked over.</p><br/><p>\"Bro Xi, you're back. Sis Tianxin just woke up!\" Annie said.</p><br/><p>Ning Tianxin's gaze skimmed the drip on the back of her hand. Then, she looked around the white ward, her face at a loss. \"Xiao Xi... How did I get here?\"</p><br/><p>\"There was a problem when you did the abortion at the clinic. You were bleeding non-stop. We transferred you here at dawn.\"</p><br/><p>When Ning Tianxin heard this, she sub-consciously ran her hands over her flat stomach and there was a distance in her eyes. Last night's memories were slowly coming back to her...</p><br/><p>When Ning Xi saw Ning Tianxin's sub-conscious action and the hollow expression on her face, her heart tightened. \"Sis Tianxin, how do you feel now? Are you unwell anywhere?\"</p><br/><p>Ning Tianxin was slow to shake her head, she looked to Ning Xi, \"I'm sorry for worrying you, Xiao Xi.\"</p><br/><p>Ning Xi sighed, \"I was frightened to death by you...\"</p><br/><p>\"Does the family know?\" Ning Tianxin asked first.</p><br/><p>\"Don't worry. I didn't tell them. I'm helping you keep this a secret! But the Mo family already knows. In the morning, Mo Lingtian's parents and aunty were here to see you, I was worried that you would be agitated, so I had them leave, and Mo Lingtian... That guy said something about wanting to take a look at you. I chased him away too.</p><br/><p>\"You still need a few days of observation before you can check out of the hospital. After that, you can go to my place for a while. I really am not okay with leaving you alone. Oh, and this is my friend, Annie. Her medical expertise is especially awesome. With her helping you heal, your body can definitely recover!\"</p><br/><p>\"Thank you, Xiao Xi.\"</p><br/><p>Ning Xi noticed that Ning Tianxin's expression had been unenthusiastic since she woke up. There was neither sadness nor happiness, much less any vigorous reaction. This made Ning Xi even more worried instead.</p><br/><p>However, she knew that worrying would not help such situations. She could only rely on herself, and on time to help her out of this rut...</p><br/>\n</div>"}