{"title": "Chapter 1401: Seven To Summon The Dragon", "id": 1401, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1401-seven-to-summon-the-dragon", "volume_title": "Volume 15", "body": "<h1>Chapter 1401: Seven To Summon The Dragon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1401: Seven To Summon The Dragon</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At Movie City, the crew of Nine Realms was working.</p><br/><p>Amidst the wide emerald green sea of bamboo, two green and red figures were aggressively exchanging blows. The two were compatible and well coordinated, their moves as natural as billowing clouds and flowing water, dazzling spectators. However, if one went up-close, one would notice that the girl's expression was a little fleeting.</p><br/><p>A few minutes later.</p><br/><p>\"Cut! Ning Xi, that was pretty good, but based on your standards, you can do better! Let's rest for ten minutes, then we'll go again one more time!\" Guo Qisheng said.</p><br/><p>\"Okay.\" Ning Xi nodded, wiped her sweat and returned to the resting area.</p><br/><p>Jiang Muye passed the sword prop in his hand to his assistant and sat beside Ning Xi on the long sofa. He shot her a look unhappily, \"Ning Xiao Xi, what do you mean, aye? Are you looking down on me or something? Can you be more attentive? Your mind is wandering all the way out of Sixth Ring Road! What are you thinking about?\"</p><br/><p>Ning Xi accepted the mineral water that Xiao Tao passed to her and tilted her head back to drink. \"I'm just thinking about whether there's still time for me to quit acting...\"</p><br/><p>Jiang Muye's expression turned dark instantly. \"What crazy meds are you on?\"</p><br/><p>Ning Xi flipped open the script and went through the scene arrangements. Her eyes fell on the last scene.</p><br/><p>Scene: Great Poison Hall</p><br/><p>Characters: Yun Huang, Yun Haotian</p><br/><p>\"I keep feeling like I'll die in this show,\" Ning Xi sighed.</p><br/><p>\"You will die in this show in the end!\" Jiang Muye was confused.</p><br/><p>\"Don't talk to me, please and thank you. I need some quiet time...\"</p><br/><p>Jiang Muye followed her gaze and looked at the script in her hands. \"Is your last scene for today with that investor who wants to come for the cameo?\"</p><br/><p>When he asked that question, she was not sure what Jiang Muye was thinking about, but he suddenly stared at her speechlessly and said, \"Wait, this investor... Wouldn't have some kind of relationship with you, would he?\"</p><br/><p>Ning Xi's face was as black as the bottom of a pot. \"Young man! Didn't I tell you not to talk to me anymore?\"</p><br/><p>Jiang Muye responded, \"What the hell!? There's really some kind of relationship? Bloody hell...\"</p><br/><p>Jiang Muye was shocked for practically half a day before he could finally react. The veins on his forehead were popping and he was having a breakdown. \"Ning Xiao Xi! I really give it to you! I let you go wild! Great! Now, you've finally played yourself dead!\"</p><br/><p>Jiang Muye held out his fingers to count, \"One, two, three, four... Whoa! One full table of mahjong players! Another three more and you can summon dragons!\"</p><br/><p>Ning Xi's expression darkened as she held her chin in thought. \"Summon, your butt! I didn't want this either, okay?\"</p><br/><p>Who would have thought that one day, all these people would actually be gathered together in one show?! She was about to have a heart attack!</p><br/><p>The worst thing was...</p><br/><p>Bloody hell! Her wife was also going to come for a cameo! There were still a lot of scenes later that saw everyone coming together...</p><br/><p>She had always wanted to shoot an especially exciting show. Well, fantastic, it really is exciting now!</p><br/><p>Jiang Muye glared at her in speechlessness. \"What's the situation with this one? Was he also tortured by you and then dumped? Don't blame me for not reminding you that this Yun Shen's background ain't simple! You're practically courting death!\"</p><br/><p>Ning Xi rolled her eyes at him. \"Do you think I have the guts? His situation is different from yours and Mo Yuxiu's...\"</p><br/><p>When he heard this, Jiang Muye's expression suddenly changed. He looked meaningfully at her. \"His situation is different from ours? Did you actually turn out to be sincere?\"</p><br/><p>Ning Xi fidgeted as she pulled at her hair. \"It's hard to explain with a few words. The point is that this is the thorniest one...\"</p><br/><p>\"Everyone, get ready. We'll go one more time!\" Guo Qisheng shouted for them to begin, so Jiang Muye could only restrain his questions with a heart full of doubts.</p><br/>\n</div>"}