{"title": "Chapter 1439: Overseas", "id": 1439, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1439-overseas", "volume_title": "Volume 15", "body": "<h1>Chapter 1439: Overseas</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1439: Overseas</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I was already expecting this. It just came sooner than I expect,\" Ning Tianxin sighed, \"I'm graduating next month. I'm planning... to go overseas.\"</p><br/><p>\"Ah…\" Ning Xi looked bitterly at her. \"Sis Tianxin, are you going to work overseas?\"</p><br/><p>Ning Tianxin nodded. \"I've already applied to several companies in Los Angeles.\"</p><br/><p>Ning Xi was missing her already, but she knew that it was the best for Ning Tianxin. \"Okay, as long as you're happy! Going overseas is a pretty exciting adventure too! I'm quite familiar with Los Angeles and I have a few friends there as well. If you need any help, remember to let me know!\"</p><br/><p>\"Mmm, thank you, Xiao Xi.\" Ning Tianxin was really grateful. \"If it wasn't for you…\"</p><br/><p>Ning Xi quickly interrupted her as Ning Tianxin was about to start thanking her again, \"We're family. It's alright!\"</p><br/><p>\"Eh? Sis Tianxin is going overseas?\" Annie felt a little down just thinking about it.</p><br/><p>\"Yes! Annie, thank you for your care during this period of time!\" After spending these few days with her, Ning Tianxin really liked this friend of Ning Xi's as well.</p><br/><p>\"You're welcome. Bro Xi's sister is my sister as well! Let me know when you're leaving. I'll prepare some medicine for your treatment as well as a prescription for your health care!\"</p><br/><p>\"Thank you!\"</p><br/><p>…</p><br/><p>In a Western restaurant in Imperial.</p><br/><p>\"Lingtian... Lingtian?\" Guan Ziyao waved her hand in front of the man.</p><br/><p>\"What?\" The daydreaming Mo Lingtian came back to his senses.</p><br/><p>\"Lingtian, what's up with you? You don't seem to be yourself lately. Isn't the issue with that woman resolved?\" Guan Ziyao asked worriedly.</p><br/><p>Mo Lingtian's eyes darkened. He rubbed his forehead and forced a smile. \"It's alright. I probably just didn't rest well.\"</p><br/><p>Guan Ziyao frowned. \"Stop staying up so late already. Go easier on the alcohol as well. Your body won't be able to last long if you don't take care of yourself.\"</p><br/><p>\"Mmm, got it.\" Mo Lingtian managed a feeble smile again. \"Haven't you been busy lately? What's with the sudden invitation?\"</p><br/><p>Guan Ziyao took out a file and handed it over to him. \"Lingtian, I looked for you today because I need some help. This person... Can you help me look for him?\"</p><br/><p>Mo Lingtian scanned through the documents. \"Who's this?\"</p><br/><p>\"I'm sorry. It's a private matter of mine.\" Guan Ziyao did not seem willing to say more, and she knew that Mo Lingtian would not push her.</p><br/><p>Mo Lingtian closed the file. He took a deep breath and tried to remove that image of his worthlessness inside of him. He also tried to forget the entire incident. Despite his best efforts, he was not able to focus in front of Guan Ziyao. \"I'll try my best.\"</p><br/><p>Guan Ziyao gave him a grateful smile. \"Thank you, Lingtian, for always helping me!\"</p><br/><p>\"Oh, I promised you to ask Tingxiao out, but he's been so busy lately and probably won't be available anytime soon.\"</p><br/><p>Guan Ziyao did not seem to mind. \"It's okay. The Lus have been pretty busy lately after all. About Tingxiao... It's fine... Let it be…\"</p><br/><p>Mo Lingtian was a little surprised by Guan Ziyao's reaction.</p><br/><p>Had Ziyao... moved on?</p><br/><p>He did not know how long he had been waiting for this day. He had imagined this countless times. If his obstacle in the form of Lu Tingxiao did not exist, he would have done everything he could to be with her, yet at this moment, probably because of his guilt towards Tianxin, he felt no joy or victory. The passion and excitement he imagined were nowhere to be felt…</p><br/>\n</div>"}