{"title": "Chapter 1432: Feeling of Being Protected By The Wife", "id": 1432, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1432-feeling-of-being-protected-by-the-wife", "volume_title": "Volume 15", "body": "<h1>Chapter 1432: Feeling of Being Protected By The Wife</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1432: Feeling of Being Protected By The Wife</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"My dear, I'm here, don't worry!\" Ning Xi looked like an overbearing guardian protecting her lover. She was quite dedicated to adhering to their illegal relationship.</p><br/><p>Lu Tingxiao coughed lightly and held back his laughter. \"Mmm.\"</p><br/><p>As he observed the girl's protective look, Lu Tingxiao could not help but recall the girl's words from the series, \"If anyone dares to touch a single strand of hair of his... I will have his head... If anyone dares to hurt him, I will kill his entire faction...\"</p><br/><p>Lu Tingxiao's heart instantly turned to a pile of mush. He instinctively leaned towards her lips...</p><br/><p>However, before Lu Tingxiao could get closer, accompanied by a gust of wind, a palm swept directly towards his face.</p><br/><p>Ning Xi instantly reacted and immediately pushed Lu Tingxiao behind her to protect him, then she raised a palm against the person who had ambushed him.</p><br/><p>To her surprise, Ning Xi's palm met nothing. When the other person saw that it was her they were striking, they immediately retrieved the attack.</p><br/><p>\"Who is it?!\" When Ning Xi looked up and clearly saw who the attacker was. She was dumbfounded. \"Shi Xiao?\"</p><br/><p>At that moment, Shi Xiao was staring straight at Lu Tingxiao with a murderous expression at whom she protected behind her.</p><br/><p>Hmm, this was a rather familiar situation...</p><br/><p>This was the exact same reaction Lu Jingli had when he first saw Ke Mingyu.</p><br/><p>Ning Xi put her hand to her forehead helplessly.</p><br/><p>Now, she finally remembered Shi Xiao, and at the same time, she remembered that it was probably in the morning when Shi Xiao had first seen her intimate contact with Ke Mingyu. With Shi Xiao's restless and impulsive personality, he had probably held back and only made a move now. She could imagine the kind of brutal struggle his heart must have experienced the entire day.</p><br/><p>Shi Xiao's gaze looked like he wanted to pummel someone as he walked past Ning Xi without a word and moved to attack Ke Mingyu behind her again.</p><br/><p>However, with Ning Xi there, Shi Xiao was destined to not be able to touch a single hair of Ke Mingyu's.</p><br/><p>Shi Xiao's continuous attacks were all stopped by Ning Xi's tight defense. Do not even mention beating up that pretty boy; he could not even touch him. His frustration almost drove him to his own death. </p><br/><p>Bloody hell! He knew that running here to become the Lady Boss's bodyguard was just bringing contempt upon himself. Now, he could not even handle one little pretty boy...</p><br/><p>What was the point of the Boss wanting him to do this job? How could he still face the Boss!?</p><br/><p>Whilst facing his subordinate that was on the verge of breaking down, a certain devil had no reaction at all. Hmm, being protected by the wife was not a bad feeling at all.</p><br/><p>After the last failed attempt, Shi Xiao felt really defeated. He looked with bloodshot eyes towards Ning Xi and the pretty boy beside her and complained, \"Miss Xiao Xi, how can you do such things behind the Boss's back? Even though... Even though the Boss is serious, stubborn, unromantic and doesn't know how to make girls happy, when he's angry, he's no different from the King of Hell...\"</p><br/><p>When she heard this, Ning Xi could not hold it in anymore and buried her face into Lu Tingxiao's chest to explode in laughter. \"Hahaha... My dear, now that you've heard your subordinate's honest evaluation of you, how do you feel?\"</p><br/><p>Shi Xiao was ranting halfway when he suddenly looked up in disbelief at Ke Mingyu again.</p><br/><p>The Lady Boss's words... What did she mean?</p><br/><p>Lu Tingxiao looked helplessly towards the girl who was laughing in his embrace, then he looked up towards Shi Xiao and said expressionlessly, \"It's me.\"</p><br/><p>This time, Lu Tingxiao used his real voice.</p><br/><p>When that familiar voice rang in his ears, Shi Xiao's entire face looked like it had been rocked by a major disaster. \"Boss?!\"</p><br/>\n</div>"}