{"title": "Chapter 1448: How Dare You Ruin My Happy Occasion?", "id": 1448, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1448-how-dare-you-ruin-my-happy-occasion", "volume_title": "Volume 15", "body": "<h1>Chapter 1448: How Dare You Ruin My Happy Occasion?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1448: How Dare You Ruin My Happy Occasion?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>On the side, when Jiang Muye heard this, he instantly cursed!</p><br/><p>Bloody hell! This Mo Yuxiu was terribly sinister! He actually wanted to seize the opportunity to immediately make the female lead and the second male lead a couple!</p><br/><p>I have yet to even speak as the male lead!</p><br/><p>Guo Qisheng could understand why Mo Yuxiu would make such a suggestion. Such an alteration would also be very beneficial to him. Then, the number of scenes and his status would not be very different from the male lead's.</p><br/><p>The content would actually be rather enriching if he adapted the series to have two pairs of couples. It was not as if he had not thought about this before. However, when he considered the needs of the original work, he tried not to make too many changes to the storyline, plus one more very important reason which was...</p><br/><p>Before Guo Qisheng could speak, Ning Xi had slowly strolled over. Her gaze indistinctly skimmed over Mo Yuxiu. \"Teacher Mo, your words are wrong. Where there is controversy, there'll be attraction and a hot topic of conversation. When this storyline started a huge war in the book review forums when the novel was first made into a series, the degree of people talking about it was off the charts. It was also exposed to become a television series. It is a highly anticipated part of the plot by the many readers who were unhappy with the male lead. As long as it is handled well, this part of the storyline will be carefree and uninhibited.</p><br/><p>\"Besides, Yun Huang's character is free and unruly. Forget about worldly etiquettes! Even the heavenly law is a load of crap to her. Would she care about things like chastity? I think you've viewed the female lead's make up a little too narrowly!</p><br/><p>\"The intial ending of this series is that Yun Huang will experience much sorrow until she comes to accept everything, then she lets go of the love that restricts her, regaining herself in the process. She and the male lead will forget each other in this world, and she travels to ends of the world with her sword. That's Yun Huang! When she is dead set on loving you, she can even sacrifice her life, and when she doesn't love you, you're nothing! Yet, now you want to change her into becoming someone who falls in love with the second male lead between fighting and having sparks fly. Such a change to Yun Huang's character would be the real reason it crumbles! Teacher Mo, don't you think so?\"</p><br/><p>Once Ning Xi expressed all of this, with every word sounding justified and sensible, she practically stifled Mo Yuxiu's face with frustration as he could not say a single word. He could only grit his teeth and glare at her. \"You...\"</p><br/><p>Ning Xi returned his glare unhurriedly instead.</p><br/><p>Hehehe! How dare you try to ruin my happy occassion?! I am so going to kill you!</p><br/><p>As he watched the gunpowder between the two main actors' become increasingly dense, and they looked like they were about to start arguing, Guo Qisheng quickly tried to smooth things over. \"Okay, okay, I'm very glad that you guys can seriously discuss the plot like this, but for this part of the storyline, let's still follow the original work! I forgot to tell you guys that for our script, it's okay to change the small details, but we can't change any of the central themes at all...\"</p><br/><p>\"Why not?\" Mo Yuxiu frowned.</p><br/><p>...</p><br/><p>Not too far away, one of the cool-looking bodyguards nervously walked to the white-haired man and leaned into his ear to say something.</p><br/><p>Yun Shen's expression instantly turned cold.</p><br/><p>There was a drop of cold sweat across the bodyguard's forehead. \"I'm sorry, Boss. I've checked. The ones who bought the copyright to this series is actually the Lu Corporation, and they have requested the crew not to change any of the central theme's storyline, or else, they will revoke the rights to the script...\"</p><br/><p>...</p><br/><p>\"Lu Corporation?\" At this moment, Mo Yuxiu also heard about the same thing from Guo Qisheng and he instantly frowned.</p><br/><p>He could not figure out why the Lu Corporation would buy this script out of the blue.</p><br/><p>He had only heard of them investing, but not about paying to buy the script, then letting others shoot it. There were no benefits at all!</p><br/><p>Could it be that someone from the top management was a loyal reader of this novel and wanted to satisfy their feelings or something?</p><br/><p>Ning Xi blinked. She looked in shock towards Ke Mingyu's direction.</p><br/><p>Jiang Muye was completely speechless too...</p><br/><p>Bloody hell! I consider you savage!</p><br/><p>His uncle actually controlled the script from its source! Others had done a little harm, yet he had retaliated all the way.</p><br/><p>...</p><br/>\n</div>"}