{"title": "Chapter 1449: You’re The Cure", "id": 1449, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1449-you%E2%80%99re-the-cure", "volume_title": "Volume 15", "body": "<h1>Chapter 1449: You’re The Cure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1449: You’re The Cure</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After the minor incident, the shooting finally started.</p><br/><p>All the scenes today would be shot in the indoor studio, which was decorated as an ancient forest with a strong magical aura. Of course, it was just an initial set up; the special effects would be added post-production.</p><br/><p>\"3, 2, 1! Lighting, rainwater, be prepared... Action!\"</p><br/><p>As the clapperboard announced that they were rolling, Ning Xi who was standing in the forest went into her acting mode instantly.</p><br/><p>A drizzle started falling. It was late autumn now, and the cold rainwater fell like little daggers, but none of that could compare to the pain she felt from witnessing what had happened a while ago.</p><br/><p>She had been a little devil back then, and she had grown up to be a big devil. She only did things on her own accord and was never ever concerned about anyone. However, she had never felt this way before, her mind faltering all because of one person.</p><br/><p>Ning Xi's crimson outfit was all wet and it stuck onto her body with her hair pasted on her face. She was covering her agonizing torso and walked aimlessly without knowing where she was going.</p><br/><p>The rain fell on her like icicles, but her insides were burning from the charm poison.</p><br/><p>At last, she could not hang on any longer and started to lurch forward.</p><br/><p>Just before she landed, a dark shadow blitzed through the trees and held her up. \"Master!\"</p><br/><p>The girl's body was burning up and she was unconscious.</p><br/><p>Liu Yan did not have time to think. He just brought her to a cave nearby to take shelter from the rain.</p><br/><p>There were no split angles in this scene as it was a single-view scene. The videographer followed them into the cave while wheeling the camera on a trolley.</p><br/><p>Liu Yan put Yun Huang on a pile of dry grass. He checked her pulse, then his usually calm eyes started to waver after a while.</p><br/><p>Charm poison was incurable…</p><br/><p>The only way to curb the effects was to have... sex…</p><br/><p>If not, she would lose herself and be destroyed!</p><br/><p>However, out of respect towards Yun Huang, he would never be able to do something like that.</p><br/><p>Ke Mingyu was nodding his head, performing very well. All his character's struggles were expressed with just his eyes.</p><br/><p>At that moment, Yun Huang woke up.</p><br/><p>Ning Xi opened her eyes, her blur vision preventing her from seeing who was in front of her.</p><br/><p>Liu Yan asked, \"Master, how do you feel?\"</p><br/><p>Liu Yan quickly stood up when he realized Yun Huang was not replying.</p><br/><p>The moment he was leaving the vicinity, there was a cold voice behind him. \"Where are you going?\"</p><br/><p>\"To find a cure for you.\"</p><br/><p>The so-called \"cure\" was to find a man.</p><br/><p>With a deep, rumbling laugh, she hooked Liu Yan's belt with a wet finger, pulling him back. Liu Yan fell to the ground carelessly.</p><br/><p>Ning Xi held one of her arms in front of the man. Her expression was very different from her numb coldness just now. She was overflowing with seductiveness, and even her voice sounded alluring. \"Heh, a cure? Aren't you here now?\"</p><br/><p>The three people who were watching this scene were speechless.</p><br/><p>Every crew in the studio felt the sudden drop in temperature around them…</p><br/><p>\"Cut!\" Guo Qisheng suddenly yelled out at this moment.</p><br/><p>Jiang Muye felt like his heart was on a rollercoaster. This was extremely exciting.</p><br/><p>After the director said \"cut\", Ning Xi and Ke Mingyu stood up and stopped their acting.</p><br/>\n</div>"}