{"title": "Chapter 1457: Third Daughter", "id": 1457, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1457-third-daughter", "volume_title": "Volume 15", "body": "<h1>Chapter 1457: Third Daughter</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1457: Third Daughter</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"The one beside my father?\" Zhuang Keer instantly revealed a shocked expression.</p><br/><p>\"Yes.\"</p><br/><p>\"How could this be?!\"</p><br/><p>When they got to this juncture, the two had gone with the flow and sat down to begin talking.</p><br/><p>Ning Xueluo looked at the picture and sighed, \"My mother's name is Zhuang Lingyu.\"</p><br/><p>When she heard Ning Xueluo say her mother's surname was \"Zhuang\", Zhuang Keer instantly reacted, \"She also has the surname Zhuang... Could it be...?\"</p><br/><p>\"Yes, my mother is the youngest daughter of the Zhuang family,\" said Ning Xueluo.</p><br/><p>\"Why have I never heard of this before?\" Zhuang Keer frowned.</p><br/><p>Grandfather had a third daughter? She had never heard anyone in the family mention this before!</p><br/><p>Ning Xueluo chose her words carefully, then she said, \"Actually, I didn't know about it from the start either. I only discovered this when I grew up. Obviously, I didn't know any specifics either. I only roughly heard that back then, my mother and my father loved each other. However, because their families did not match in terms of statuses, Grandfather wouldn't agree no matter what. In order to be together with my father, my mother fought multiple times with Grandfather. Misunderstandings and conflict deepened. At last, it reached the stage of severing father-daughter ties. They had not been in contact for more than 20 years... So, now almost no one knows about this incident from back then!\"</p><br/><p>After she had shared so much, Ning Xueluo's face was full of gloom. \"Actually, I know that my mother especially regretted hurting Grandfather then, and she missed her family too. Sadly, my mother is too stubborn, so she wasn't willing to give in all this while...\"</p><br/><p>When Ning Xueluo reached this part, she looked at Zhuang Keer with a slightly pained expression. \"I'm actually sad that my mother's like this, so I tried to resolve the misunderstanding between my mother and Grandfather... But it's too hard for me to contact and meet Grandfather, so in that period of time, I tried to contact you, Ms. Zhuang. Unfortunately, I didn't think that because of some small misunderstanding, I would've missed the opportunity to speak to you...\"</p><br/><p>Ning Xueluo's words were no doubt hinting at the incident of Zhuang Keer standing up for Ning Xi previously in History's store, even implying that Ning Xi had been obstructing her from speaking to her from the start.</p><br/><p>Zhuang Keer looked at Ning Xueluo again, and asked suspiciously, \"Why would you bring this photo around with you?\"</p><br/><p>\"I found this photo at my mother's bedside. Probably because of long-term fingering, the wear and tear have already been pretty severe, then I secretly brought it to be restored at a shop. Today, I just collected it... Actually, I've come to the beauty parlor today also with a mentality of trying out my luck, thinking about whether I would meet you, Cousin. Who would have thought that God has finally helped me out?\" Ning Xueluo did not deny it at all. She just admitted her purpose and intention, even pretending that she had unconsciously changed her address towards Zhuang Keer as \"Cousin\".</p><br/><p>Indeed, when she heard Ning Xueluo speak like that, Zhuang Keer's expression softened quite a bit. She had already begun to believe Ning Xueluo's words.</p><br/><p>After all, Ning Xueluo did not need to lie to her. For such a matter, she just needed to go home and ask to find out whether it was real or not.</p><br/><p>She did not expect that she would have three aunts and that one of them had run away from home and severed ties with her family for so many years...</p><br/><p>Now that she recalled it, Grandfather always had a worried expression on his face. She thought that it was only because he missed Grandmother. Could it have also been because of this youngest daughter who had left home for many years?</p><br/><p>\"It's not good for us younger generation to interfere with the older generation's matters, yet I can't bear to see my mother continue to look so haggard every day. That's why I presumptuously rambled on so much to you,\" Ning Xueluo said apologetically.</p><br/>\n</div>"}