{"title": "Chapter 1450: Real Kiss or Fake Kiss?", "id": 1450, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1450-real-kiss-or-fake-kiss", "volume_title": "Volume 15", "body": "<h1>Chapter 1450: Real Kiss or Fake Kiss?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1450: Real Kiss or Fake Kiss?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Guo Qisheng frowned and went up to them. He thoroughly thought about what to say. \"Ning Xi, your expression isn't right. The person you like just confessed to another woman and wants to avoid you. You're in despair... Although you're seducing Liu Yan while being controlled by the charm poison, you're behaving as clear as sky inside. Your eyes should show more despair... but weren't you acting too naturally just now?\"</p><br/><p>Ning Xi coughed lightly and touched her nose. \"My bad. I'll be more careful.\"</p><br/><p>Guo Qisheng then went up to Ke Mingyu after he was done with Ning Xi.</p><br/><p>She mumbled out of Guo Qisheng's earshot, \"Damn it, I was too excited and wasn't able to contain myself…\"</p><br/><p>Although Guo Qisheng missed it, the three people who were resting nearby heard her!</p><br/><p>Yun Shen remained silent.</p><br/><p>Jiang Muye was speechless.</p><br/><p>Mo Yuxiu was shocked!</p><br/><p>What did he just hear? He had just found out something interesting!</p><br/><p>He had received zero results after so many days of thorough observation. Could Ning Xi's man... be Ke Mingyu?!</p><br/><p>\"Mingyu, for now, your part is fine, but the scenes later on are the main feature, so stay focused…\"</p><br/><p>As Guo Qisheng was speaking to Ke Mingyu, Ning Xi suddenly thought of a question. She went back and asked, \"Director Guo, for the kissing scene later, are we kissing for real?\"</p><br/><p>When she asked this question, the three guys nearby were once again taken aback.</p><br/><p>Guo Qisheng thought about it, \"Well, I guess…\"</p><br/><p>He was about to suggest manipulating the angle like how they did it in \"The World\", but Ning Xi interrupted him as if she was showing off her professionalism as an actor, \"Director Guo, I think we should do it for real! Yun Huang and Meng Changge have different personalities. If it's a fake one, I won't be able to exhibit Yun Huang's personality fully and that will dampen the effect we intend to show the viewers!\"</p><br/><p>Since Ning Xi offered this solution herself, Guo Qisheng could not wish for anything better. He was really touched by Ning Xi's professionalism and patted her on the shoulder. \"Alright, thanks for the hard work!\"</p><br/><p>Somewhere nearby, Jiang Muye almost crushed his sunglasses in his hand. You bastard, how shameless! So shameless!</p><br/><p>They always used an odd angle to avoid actually touching when she was acting with him, but when it came to his uncle, she requested to do it for real on her own!</p><br/><p>Director, please wake up. Wake up! This bastard is doing it for her own self-interest!</p><br/><p>\"Okay, if there's no problem, then we'll continue! The front part is fine. Let's continue from inside the cave!\" Guo Qisheng told every department to get ready again.</p><br/><p>\"3! 2! 1! Start!\"</p><br/><p>\"Where are you going?\" Yun Huang asked.</p><br/><p>\"To find a cure for you.\"</p><br/><p>\"Heh, a cure? Aren't you here now?\"</p><br/><p>The water droplets on Yun Huang's finger dripped onto Liu Yan's collarbone. Her finger reached for his collar and she unbuttoned it…</p><br/><p>\"Master, no.\" Liu Yan's expressionless eyes seem to be full of panic.</p><br/><p>Yun Huang felt a sharp pain and her expression changed. Her eyes were full of bloodlust now. She choked the man and demanded, \"What now? Even you dare to defy me?\"</p><br/><p>She released all her anger on the person in front of him because she knew that no matter how she treated him, he would never leave her.</p><br/>\n</div>"}