{"title": "Chapter 1481: Play Mahjong", "id": 1481, "volume": 15, "url": "http://boxnovel.org/hidden-marriage-chapter-1481-play-mahjong", "volume_title": "Volume 15", "body": "<h1>Chapter 1481: Play Mahjong</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1481: Play Mahjong</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>To make it easier for everyone, the karaoke center was pretty near. It was just right opposite the building, so Ning Xi walked over after she came out of the exhibition center.</p><br/><p>Hmm... If she could predict the future, if she had known Jiang Muye would make her life so miserable, she would never have gone…</p><br/><p>When she reached, Ning Xi gave Jiang Muye a call as she walked upstairs. \"Blondie, I found it. Which room are you guys at?\"</p><br/><p>\"Uh, well... About that…\" Jiang Muye stuttered.</p><br/><p>\"Which one? You don't even know which room you're at?\" Ning Xi was exasperated.</p><br/><p>Jiang Muye coughed lightly. \"No, that's not it... Ning Xiao Xi, I think... You'd better not come…\"</p><br/><p>Her annoyance flared. \"Blondie, are you messing with me?! I'm already here!\"</p><br/><p>\"That's not my name though,\" Jiang Muye said weakly.</p><br/><p>\"Stop changing the topic! Which room is it? Are you drinking a little too much?\" Ning Xi frowned, sensing that Jiang Muye's tone was odd.</p><br/><p>Someone had probably overheard that Ning Xi was on the phone, so the person yelled towards Jiang Muye's phone, \"Is it Bro Xi? We're in room VVIP 888. Come quickly!\"</p><br/><p>Ning Xi did not think much about it. She hung up after hearing the room number. She looked around and saw room 888 was just nearby. Ning Xi walked over and opened the door…</p><br/><p>It felt like a thunderbolt struck her the moment she opened the door…</p><br/><p>One second…</p><br/><p>Two seconds…</p><br/><p>Three seconds…</p><br/><p>Ning Xi instantly slammed the door shut again, then she screamed in her mind.</p><br/><p>Ahhhhhh!</p><br/><p>What the heck did she just see!?</p><br/><p>Even if it was just for a split second, with the room full of people inside, it was impossible to miss any of the few people that stood out!</p><br/><p>Jiang Muye…</p><br/><p>Mo Yuxiu…</p><br/><p>Yun Shen…</p><br/><p>Lu Tingxiao…</p><br/><p>…</p><br/><p>Damn you, Jiang Muye! What happened to having fun?! How do I have fun here?! How about the four of you go and play mahjong?!</p><br/><p>Forget about Mo Yuxiu! Why were Yun Shen and Lu Tingxiao here too?</p><br/><p>As Ning Xi was contemplating about what she had just seen outside, the door was opened from the inside, and two ladies excitedly dragged her inside.</p><br/><p>\"Bro Xi, what are you doing outsid?! Come in!\"</p><br/><p>\"Quickly come, Bro Xi! The big boss is here today, and so is CEO Yun…\"</p><br/><p>…</p><br/><p>Before Ning Xi could say anything, she was pulled into the room.</p><br/><p>Because they knew she was on good terms with Jiang Muye, they had left an empty spot beside him.</p><br/><p>Ning Xi avoided the eyes of the other three as she glared at Jiang Muye. \"Jiang Muye! Do you want to die?! You tricked me!\"</p><br/><p>She had a tough time struggling through the charity event, and just when she thought she could breathe a sigh of relief, the four of them were gathered once again!</p><br/><p>Jiang Muye looked innocent and backed off. \"I didn't call for them, alright? I didn't know they would come! I also warned you just now and asked you to not come…\"</p><br/><p>Ning Xi pinched her glabella and clenched her teeth. \"Thank you so much! Thanks to you and your whole family!\"</p><br/><p>Because of these few guys, she had no energy left to think about the other ex again…</p><br/><p>Was this fighting poison with poison?</p><br/>\n</div>"}