{"title": "Chapter 1518: Play Until She Dies", "id": 1518, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1518-play-until-she-dies", "volume_title": "Volume 16", "body": "<h1>Chapter 1518: Play Until She Dies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1518: Play Until She Dies</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The car door opened and Ning Xi was shoved out of the car.</p><br/><p>What greeted her eyes was a building that looked like a martial arts center. There was a pole with a huge flag propped up in front of the door, and the sign on the flag showed the word \"Qing\".</p><br/><p>Ning Xi's brows raised slightly. Tsk, the Qing Xuan Gang?</p><br/><p>So, it turns out that... Meng Shiyi's supported by the Qing Xuan Gang...</p><br/><p>Earlier, she overheard that blonde address her as \"Miss\". Could she be Qing Xuan Gang's leader, Meng Zhenhuan's daughter?</p><br/><p>No wonder she was absolutely unrestrained, daring to order people to use guns and kidnap in places like Imperial in broad daylight. Oh, yes, and she was even about to kill her...</p><br/><p>There were many big and small underground gangs in China. Apart from Province D's Black Tiger Fang, the most prestigious and influential one was the Qing Xuan gang. While they did not have the most members, they were the most influential. After all, they controlled the underground world of Beijing and its surrounding provinces...</p><br/><p>Ning Xi was thinking about all this to herself as she followed them past a Taoist rites area and walked deeper in.</p><br/><p>Probably because they had reached their base camp, they had clearly relaxed significantly. They must have thought that since she was here in their grounds, she would not be able to run even if she had wings.</p><br/><p>Ning Xi observed her surroundings for a while. The place was not considered huge, and the members were rather scattered too although it should only be a small part of them. Of course, to Meng Shiyi, if she wanted to kill someone, mobilizing a small subsection gang leader was more than enough.</p><br/><p>\"Boss, we've brought the person Miss wants!\" The big-sized guy yanked Ning Xi hard in front of someone.</p><br/><p>In the middle of the hall was a wide, red, wooden seat. There was a lavish tiger fur spread out on the seat, and on it sat a man of tough and stocky build, with tattoos all the exposed areas of his skin. He sat cockily on the seat with women flanking his left and his right.</p><br/><p>When he saw Ning Xi, the man pushed the two sexy and skimpy-clothed beauties beside him away and sauntered to Ning Xi with interest. \"So, you're the young lady that wants to kill yourself by daring to provoke our Miss?\"</p><br/><p>Ning Xi kept quiet and cowered appropriately, showing a fearful and frightened expression. In reality, her eyes were evaluating her surroundings rapidly.</p><br/><p>When her gaze fell on an object in an open iron trunk not too far away, Ning Xi's eyes lit up slightly. Ah, she seemed to have spotted something fun to play with...</p><br/><p>\"I'm asking you a question! Wasn't it reported that you're quite capable? Why are you mute now?\" When the subsection leader saw the girl shivering and weak, his eyes were filled with lust. He forced himself to have some self-control and asked his subordinate beside him, \"What did the Miss say to do?\"</p><br/><p>The big-sized guy walked up and sneered, \"The Miss asked us to shoot a few astonishing videos, then we're free to play... Play with her until she dies!\"</p><br/><p>\"Hahahaha... Right in line with what I want!\" That leader instantly cackled heartily. He was probably used to doing such things because very soon, someone had brought video equipment.</p><br/><p>\"Boss, you first! You first! We'll all learn from your majesticness!\" The blonde eagerly licked his boss's boots.</p><br/><p>Because Ning Xi looked like she was completely submissive, no one was guarding her securely. The leader started to remove his shirt as he impatiently made his way towards her...</p><br/><p>Right at this moment! When everyone was not vigilant...</p><br/><p>How dare you break the hair clip that Little Treasure gave me?! Do you want to play? I will bloody play tricks with you!</p><br/><p>The instance the man had advanced for her, Ning Xi's hand reached behind his waist and grabbed his gun. Then, she swiftly aimed it at the man's forehead. Before everyone could react, Ning Xi had dragged him to the iron trunk she had noticed earlier and took out a tiny instrument from the trunk, stuffing it into his mouth and forcing him to swallow it...</p><br/>\n</div>"}