{"title": "Chapter 1513: I'm Not Interested In Men", "id": 1513, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1513-im-not-interested-in-men", "volume_title": "Volume 16", "body": "<h1>Chapter 1513: I'm Not Interested In Men</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1513: I'm Not Interested In Men</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Bloody hell! This dude doesn't abstain from men or women! He had better not have taken a liking to my darling!</p><br/><p>Actually, there had been a long period of time when she had suspected that he liked men. After all, before she returned to the country, she had appeared in male outfits before this guy. When she dressed up as a man for long, she herself had almost forgotten her own gender. She remembered that when Yun Shen had suggested that they start dating, she was so shocked that she was at a complete loss and had immediately insisted, \"I'm not gay!\".</p><br/><p>Later on, she and Third Senior Sister Feng Xiaoxiao had privately discussed their niggling suspicion about whether he actually liked men many times.</p><br/><p>When he saw Ning Xi's expression, the man on the sick bed gently laughed, \"Don't worry, I'm not interested in men.\"</p><br/><p>Ning Xi remained alert. \"Do you think your words are trustworthy? Also, even though you helped me this time, because you kept bleeding like you were on your menses and almost died, it was Lu Tingxiao's blood transfusion that saved you. We're considered even now!\"</p><br/><p>The man revealed a contemplative expression as thoughts raced through his head. He said indifferently, \"As the head of the Lu family and as the Lu Corporation's helmsman, just in case of anything, do you think the entire Lu family wouldn't store such a rare blood type? Yet, he had personally transfused blood to me...</p><br/><p>\"Huh, my dear, you can't even recognize such a shallow trick of injuring oneself to gain the enemy's confidence! Has your IQ been fed to the dogs?\"</p><br/><p>The moment he said that, Lu Tingxiao's eyes dimmed. He looked icily at the man on the sick bed who kept provoking him. At the same time, there was an indistinct worry in them.</p><br/><p>After Ning Xi heard Yun Shen's words, she was stunned, then she looked blankly at Lu Tingxiao beside her. In the next second, she threw herself into the man's embrace and looked up with a touched expression. \"Darling, thank you...\"</p><br/><p>The words that Lu Tingxiao had said to her at the start, \"I just wanted to let you know, no one, and nothing can affect your decision, you only need to consider me, and one thing, that is whether you like me or not\" suddenly flashed in Ning Xi's mind.</p><br/><p>And he had really done just that just so she would not be burdened. He did not hesitate to transfuse blood for Yun Shen personally just to help her return this favor to Yun Shen.</p><br/><p>Lu Tingxiao breathed a sigh of relief as he looked at the girl with an incredibly gentle gaze.</p><br/><p>There had never been a need for words of explanations between them.</p><br/><p>Yun Shen, who watched them hug and was almost so bitter that he was about to bleed again, was speechless.</p><br/><p>\"Ahem...\" At the room entrance, Tang Ye had spoken up in time and saved his boss who was about to die from anger. \"Little Junior Sister, you guys can go back now. I'll be here to watch him.\"</p><br/><p>Ning Xi scratched her head. \"Ah, that wouldn't be too nice. I think I'll stay to help. After all, it was because of me...\"</p><br/><p>Tang Ye only sighed and tactfully said, \"With you two here, it'll stir the patient's emotions.\"</p><br/><p>Ning Xi just realized she seemed to have accidentally displayed her affection publicly. Yun Shen's gaze looked murderous, so she pulled Lu Tingxiao and ran off immediately. \"Ahem, okay... First Senior Brother, if there's anything you need me for, contact me again. Bye bye...\"</p><br/><p>...</p><br/><p>After Ning Xi and Lu Tingxiao left, the man on the sick bed looked wretched. \"Busybody.\"</p><br/><p>Tang Ye adjusted his spectacles and did not respond. \"The master is on his way here.\"</p><br/><p>Yun Shen frowned and looked even worse now. \"Troublesome...\"</p><br/><p>Soon after, there was the sound of many footsteps outside the room, then the door was pushed opened. A middle-aged man in a traditional Chinese outfit walked in.</p><br/>\n</div>"}