{"title": "Chapter 1520: We Try Switching To Woman?", "id": 1520, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1520-we-try-switching-to-woman", "volume_title": "Volume 16", "body": "<h1>Chapter 1520: We Try Switching To Woman?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1520: We Try Switching To Woman?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Who said I wanted to leave?\"</p><br/><p>\"Uhh...\" The man was dumbfounded and everyone else exchanged glances too.</p><br/><p>\"Then... Then, what do you want?\"</p><br/><p>\"Wait till I'm done having fun!\" Ning Xi looked smug and had an expression that said she wanted to stay and settle down. Everyone's faces darkened at this sight. They were speechless.</p><br/><p>Not only that, Ning Xi had even used her finger to poke at the armrest of the red wooden seat. She then said, \"All of you, everyone eat one of the microbombs!\"</p><br/><p>Then, she added on, \"Women don't need to.\"</p><br/><p>\"What?!\" Suddenly, everyone was afraid. The two girls, who had been serving the leader earlier, sighed in relief.</p><br/><p>\"This... We don't need to do this, do we?\" The tall, skinny one started to back away.</p><br/><p>The big-sized guy cleared his throat too. \"This is our leader. His life is in her grasp! How dare we say no?\"</p><br/><p>Ning Xi pouted. \"What if anyone of you wants him to die and seize the throne for yourselves?\"</p><br/><p>The leader instantly jumped up and slapped all of them. \"Swallow it! All of you! I've already swallowed it! Can't you? Huh? Quick! Are you trying to revolt?\"</p><br/><p>The big-sized guy looked miserable. \"If we all eat it, you won't be able to different whose number is which!\"</p><br/><p>All the bombs had corresponding numbers and the fuse in Ning Xi's hand allowed her to select the bomb number to defuse, but if everyone swallowed it, she definitely would not be able to differentiate which number was whose.</p><br/><p>Ning Xi pretended to ponder. With everyone anticipating their bomb being let off anytime, Ning Xi blinked and then said, \"I'll just click on the main switch and bomb everyone!\"</p><br/><p>Everyone was speechless.</p><br/><p>Bloody hell! Monster! A female monster!</p><br/><p>They were practically meat on her chopping board. Because their leader's life was hanging so precariously in Ning Xi's hands, everyone was forced to swallow one bomb.</p><br/><p>\"Great aunt, are you happy now?\" The leader rubbed his hands and asked even more carefully.</p><br/><p>Ning Xi turned the fuse in her hand and looked bored stiff. \"Boring...\"</p><br/><p>These words were like a voodoo that hastened their death, frightening the souls out of everyone.</p><br/><p>The leader quickly followed up to ask, \"What do you like then? What do you want to play? I'll get it for you! Are you willing to leave once you're happy with the fun you're having?\"</p><br/><p>The priority was to quickly coax this little devil well. Otherwise, their bodies might be dismembered on the spot if they were not careful!</p><br/><p>\"We'll see...\"</p><br/><p>The blonde submissively walked up to the leader who was discussing and said, \"I-I... I have an idea!\"</p><br/><p>\"What idea?\" The leader looked lamentably at him.</p><br/><p>The blonde leaned into his ear and said softly, \"Boss, call Sis Hua Hua to send over some obedient, pretty boys...\"</p><br/><p>\"Would this really work?\" The leader and big-sized guy looked at him, full of doubt.</p><br/><p>The blonde quickly said, \"Maybe it'll work! All woman are all interested in those...\"</p><br/><p>The leader contemplated. As he was desperate, he quickly walked to a corner and made a call.</p><br/><p>Moments later, a long line of more than ten handsome, attractive, and trained to be respectful boys stood before Ning Xi.</p><br/><p>The leader rubbed his hands and asked nervously, \"Great aunt, take a look and see if you like these? You can have fun as you wish! They've all been trained well! They're especially good at serving people!\"</p><br/><p>Ning Xi sat on the tiger fur seat just like the king of a mountain as her eyes skimmed the men below. She immediately frowned.</p><br/><p>Her eyes were used to Lu Tingxiao's type. How could she be interested in these?</p><br/><p>When he saw Ning Xi frown, the leader felt sweat drip down his face as he quickly chased them all away. He kicked the blonde again. \"Look at the rotten idea you came up with!\"</p><br/><p>The blonde cried out and scowled miserably, \"This doesn't make sense! Even this can't do... This was the best stock already... Hmm, could it be... Could it be that this great aunt's appetite doesn't swing this way? How about... We try switching to women?\"</p><br/>\n</div>"}