{"title": "Chapter 1532: Spoiling", "id": 1532, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1532-spoiling", "volume_title": "Volume 16", "body": "<h1>Chapter 1532: Spoiling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1532: Spoiling</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At Platinum Palace.</p><br/><p>Ning Xi was reflecting on her actions, about how she worried Lu Tingxiao by not informing him in time, and also... about the girls almost sitting on her lap.</p><br/><p>What had happened during the day bothered her as well.</p><br/><p>She glanced through the people Yun Shen had brought over. It was a terrifying force as they were the core elites among the organization. Usually, they were scattered all around the world, but currently, all of them had gathered in Imperial.</p><br/><p>That guy had made all the elites come back. What was he trying to do?</p><br/><p>She had a feeling that the guy was trying to pull off something, which was related to Lu Tingxiao!</p><br/><p>Fortunately, she knew that although Lu Tingxiao was just a businessman, he had immense power in the dark as well. Furthermore, they were on Lu Tingxiao's turf now, so they could not really do anything at the moment.</p><br/><p>…</p><br/><p>The next day, the little bun was focusing on sticking crystals onto a custom-made hairpin one by one using glue. He looked so adorable when he was focused.</p><br/><p>Only the plastic portion of the hairpin that was stepped on before was broken. The crystal decoration was fine, so they just needed to remove the crystals and stick it back onto another hairpin.</p><br/><p>It was often said that focused men were the charming ones, but she felt her little bun was the most charming one of all.</p><br/><p>As expected of her son, he looked so cute even when he was just fixing her hairpin.</p><br/><p>Ning Xi looked at him brightly. \"I'm sorry, baby. I'll be extra careful next time. I'll never break it again!\"</p><br/><p>The little bun was done with the last piece of crystal. He blew at it a little to make it dry. \"It's alright, Mommy. I'll fix it for you again if that happens.\"</p><br/><p>\"Oh!\" Her baby was spoiling her too much!</p><br/><p>After the glue dried off, the pink heart-shaped hairpin looked anew. The little bun put it on Ning Xi's head and beamed. \"Mommy, you look great!\"</p><br/><p>Lu Tingxiao's expression turned gentle when he saw this heartwarming scene as he was walking downstairs.</p><br/><p>\"Sister-in-law, good news! Good news! Super good news!\" Lu Jingli suddenly ran into the house.</p><br/><p>\"What's the good news?\" Ning Xi turned around and asked.</p><br/><p>Lu Jingli held a large stack of documents in his hand and said in excitement, \"Sister-in-law, you…\"</p><br/><p>\"You've been nominated as the Best Female Lead for the Golden Film Awards,\" Lu Tingxiao finished.</p><br/><p>Lu Jingli was upset. \"Hey! How can you do that?! I found out about it quick enough already. How come you knew about it earlier than I did?! Can't you let me show off for once?\"</p><br/><p>Ning Xi was taken aback. \"What…?\"</p><br/><p>Lu Jingli seized the hesitation as his chance to talk. He handed the documents to Ning Xi. \"Your role in 'Dream Chaser' has been nominated as the Best Female Lead. This is first-hand insider news! It's all written here! They'll probably announce this list to the public in three days!\"</p><br/><p>Ning Xi scanned through the document, then she saw that \"Dream Chaser\" had been nominated for two awards: Best Director and Best Female Lead!</p><br/><p>She also saw another familiar name. \"The World\".</p><br/><p>\"'The World' has been nominated as well?\" Ning Xi asked.</p><br/><p>Lu Jingli took a glance. \"Seems like it! 'The World' couldn't make it last year, so it's been included in this year's awards instead! You're nominated in 'The World' as well for the Best Female Secondary Lead! I only noticed your Best Female Lead just now and missed out on this one!\"</p><br/>\n</div>"}