{"title": "Chapter 1531: Why Don’t You Try Something Else?", "id": 1531, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1531-why-don%E2%80%99t-you-try-something-else", "volume_title": "Volume 16", "body": "<h1>Chapter 1531: Why Don’t You Try Something Else?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1531: Why Don’t You Try Something Else?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Shut up! You're talking nonsense!\" Meng Shiyi scolded.</p><br/><p>Yun Shen and Lu Tingxiao had gone to rescue Ning Xi together?</p><br/><p>Not just Meng Shiyi, even Meng Zhenhuan and the other core members of the gang found this outrageous.</p><br/><p>Yun Shen's relationship with the Lu Corporation was extremely complicated. They had been competing with each other aggressively in every manner possible. If they were to meet each other with fully armed forces, there would surely be an epic fight! How was it possible for them to work together to rescue Tang Xi?</p><br/><p>Even though Tang Xi had left the organization, she was still from Yun Shen's side. It was impossible that Lu Tingxiao did not know this. He might have even questioned Tang Xi's motivation to enter Glory World Entertainment.</p><br/><p>Meng Zhenhuan looked at the branch leader with a stern face. \"Are you sure that you're not mistaken?\"</p><br/><p>After being scolded by Meng Shiyi, and with so many people being suspicious about his words now, he replied timidly, \"Well, I'm not really sure…\"</p><br/><p>Meng Shiyi thought she had it all figured out. She took out her phone. \"This idiot must've been mistaken! There must be a misunderstanding! I'll give Lu Jingli a call right now!\"</p><br/><p>Meng Shiyi worked in the entertainment industry, so it was normal for her to have Lu Jingli's number, and Lu Jingli was crystal clear about who Meng Shiyi was.</p><br/><p>Meng Zhenhuan did not stop his daughter. This whole situation was really odd. Even if he had to die, he needed to know the reason why!</p><br/><p>As she called Lu Jingli, Meng Shiyi turned on the loudspeaker.</p><br/><p>After a long wait of ringing, everyone became really high-strung. Finally, a sleepy voice came from the phone.</p><br/><p>\"Hello, Second Master! I'm Meng Shiyi! Sorry for bothering you this late at night! I'll get straight to the point because of the urgency of the matter. Our gang was raided by Yun Shen tonight. We wanted to request help from CEO Lu. I hope Second Master can help us to pass him the message.</p><br/><p>\"In the past few years, the Meng family has been on good terms with the Lu Corporation. I believe CEO Lu won't abandon us! If there's any misunderstanding, we can explain…\" Meng Shiyi swiftly clarified the situation.</p><br/><p>There was a short silence. He was probably trying to digest Meng Shiyi's words as he had just woken up.</p><br/><p>Time ticked by slowly. Everyone was holding their breaths…</p><br/><p>After a short while, Lu Jingli's dumbfounded voice came through the phone. \"Are you guys idiots? You sent people to kidnap my sister-in-law, and you expect my brother to help you? Why don't you try something else?\"</p><br/><p>Meng Shiyi, Meng Zhenhuan, and all the other gang members were inarticulate.</p><br/><p>\"Second... Second Master! What do you mean?\" Meng Shiyi was shocked.</p><br/><p>\"I mean exactly what I said! Xiao Xi Xi is my brother's woman, my future sister-in-law. Do you understand? My brother didn't take action because of the connection we've built through the years. There won't be any chance for others to do anything…\" Lu Jingli mumbled in an annoyed tone before he hung up.</p><br/><p>There was a dead silence in the study room.</p><br/><p>Lu Jingli's words echoed in everyone's mind. Ning Xi was his future sister-in-law. She was Lu Tingxiao's woman.</p><br/><p>Although it was hard to believe, if it was true, everything now made sense…</p><br/><p>It also meant that because of Meng Shiyi's rashness, the Qing Xuan Gang was doomed. They were done for!</p><br/>\n</div>"}