{"title": "Chapter 1538: A Big Cut Above The Rest", "id": 1538, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1538-a-big-cut-above-the-rest", "volume_title": "Volume 16", "body": "<h1>Chapter 1538: A Big Cut Above The Rest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1538: A Big Cut Above The Rest</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>However, the number of men who would have loved to walk with Ning Xi would be enough to form a long queue.</p><br/><p>He did not mind. In fact, as a normal man, he was pretty happy to do so…</p><br/><p>His assistant was getting smarter. She knew to look for him in case of an emergency!</p><br/><p>On the stage.</p><br/><p>\"Ms. Ning and Mr. Su are really the perfect couple. What more can you expect from our role model married couple? All of us here wish you a happy marriage and that you'll hopefully get a baby soon! We also wish that Xueluo will be able to win the award tonight, making achievements in both your love life and career. Alright, let's welcome them in!\"</p><br/><p>Although it was just Ning Xueluo and Su Yan, they took quite some time on the red carpet. After all, she was one of the popular candidates. In addition to being a popular ship with a powerful background, the hosts spared nothing, raining praises over them before they then turned towards the following people entering.</p><br/><p>The two hosts had been informed that Ning Xi and Ye Zixuan were going to come in separately, but they did not know if it was Ning Xi who had rejected to do so, or Ye Zixuan who had requested it…</p><br/><p>Under everyone's gaze, a black car slowly stopped at the end of the red carpet. A pair of glittering high heels full of diamontes stepped out. Then came a long, fair leg…</p><br/><p>As the door fully opened and Ning Xi came out of the car, the whole arena hushed and all chatter stopped.</p><br/><p>After a few seconds, the cameramen started taking pictures one after another. Flashes exploded everywhere as the fans on both sides of the red carpet screamed their lungs out.</p><br/><p>\"Ah! Bro Xi, Bro Xi, Bro Xi!\"</p><br/><p>\"Goddess, please marry me!\"</p><br/><p>\"Marry me, Bro Xi! I want to bear your kids!\"</p><br/><p>…</p><br/><p>The girl's perfect facial features seemed as if God had created her personall. Her skin was glowing even under the dark sky. Her dark hair was like seaweed and she was wearing a red dress tonight. The dress looked like it had been intentionally burnt. There were a lot of golden caramel burn marks on the dress, presenting an irregular shape.</p><br/><p>A lot of people recognized it. Ning Xi's dress tonight was designed by the legendary designer who had won the Golden Top Awards at his inaugural attempt. This piece of work was called \"Nirvana Reincarnation\".</p><br/><p>This red dress was one of the classics in the line and many female stars, including Qin Shengyue, had worn it before, but none of them were able to pull off the impact like Ning Xi did.</p><br/><p>Ning Xi's aura was like a reborn phoenix, giving people a strong visual impact and perfectly matching the theme of this dress.</p><br/><p>All of them knew that Ning Xi could dress in female outfits as impressively as she did in male outfits. They also knew that Ning Xi's outlook was always marvelous, but they did not expect her to be this breathtaking. Everything else besides her paled in comparison.</p><br/><p>Everyone was thinking about the same thing at the moment: what a big cut above the rest!</p><br/><p>…</p><br/><p>At the same time, in a high-class apartment.</p><br/><p>Gong Shangze, Qiao Weilan, and Han Momo were watching the live stream of the awards ceremony that night.</p><br/><p>When Ning Xi appeared, Gong Shangze's eyes lit up, then he teared.</p><br/><p>He had actually suggested that Ning Xi pick one of the two brand treasures, so he had assumed she would have them as her first choices.</p><br/><p>Then again, unexpectedly, Ning Xi had selected this dress without a doubt.</p><br/><p>She selected this piece that was a complete original. The very same piece that helped him to get back on track to pursue his dreams, Nirvana Reincarnation…</p><br/>\n</div>"}