{"title": "Chapter 1545: Gave It Her All", "id": 1545, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1545-gave-it-her-all", "volume_title": "Volume 16", "body": "<h1>Chapter 1545: Gave It Her All</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1545: Gave It Her All</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>It was really a difficult question, yet the hostess always loved to ask this sort of question. Because of the unique situation, it was a tough one to answer.</p><br/><p>Was his \"The World\" better, or was Qi Feng's \"Mountain\" better?</p><br/><p>How was he supposed to answer this?</p><br/><p>Guo Qisheng smiled and pushed the question back skillfully to the hostess by bringing up another topic...</p><br/><p>…</p><br/><p>After the Best Director award, there was only one last award left. It was the Best Female Lead, the award that received the most attention this time around!</p><br/><p>It was pretty obvious because the attendees, who were tired after the long ceremony, suddenly looked refreshed and focused.</p><br/><p>\"Thank you to our guest, and congratulations to the winner! Next up, we have our guests, Jiang Xingzhou, Song Lin!\"</p><br/><p>The guests themselves were exciting enough to the audience!</p><br/><p>One was a respectable international director while the other one, Song Lin, was a record keeper!</p><br/><p>Jiang Xingzhou greeted, \"Good evening.\"</p><br/><p>Jiang Xingzhou wore a black suit tonight. He looked courteous and friendly, but anyone who had worked with him before knew that he was a totally different person when filming. He was so strict that some artistes required counseling after they worked with him and many people had experienced it before.</p><br/><p>However, there were still a lot of people who wanted to work with him because almost every one of his films received an award. Still, his auditions were extremely tough and most people failed at the very first stage.</p><br/><p>Song Lin greeted, \"Good evening, everyone! I'd like to thank the organizers for inviting me to present this award…\"</p><br/><p>Song Lin wore a white dress tonight and looked resplendent. At just the age of 35, she gathered the three best awards an actress could have ever received in the Chinese film community: the Golden Film Awards, Golden Phoenix Awards, and the Golden Deer Awards. Including awards from the Asian region, she had 12 awards in total at the moment. She was also the youngest award holder in the country and had even been nominated in the Golden Ball Awards, which was known to be a great predictor of Oscar winners. She was definitely one of the notable icons of China.</p><br/><p>After the greetings and some small talk, the big screen started playing the videos.</p><br/><p>Xu Jiaojiao in \"Canoe\".</p><br/><p>Luo Qi in \"Alice's Mirror\".</p><br/><p>Ning Xueluo in \"The World\".</p><br/><p>The scene they took from \"The World\" was when Ning Xueluo looked back at the male lead and smiled under that pear tree.</p><br/><p>The next one was Ning Xi in \"Dream Chaser\".</p><br/><p>The opening sequence of \"Dream Chaser\" played. It was the scene of the banquet where Ning Xi was in a male outfit and she smiled as she whispered to Chen Hanchen. A loud cheer rose from the crowd.</p><br/><p>Finally, they reached the last nominated film. Ning Xueluo's name appeared on the big screen once again together with \"Mountain\".</p><br/><p>The video of \"Mountain\" formed a great contrast with the beautiful and luxurious environment of \"Dream Chaser\". In the background, there were miles of desolated ground with short houses. Ning Xueluo played a rural lady, who was speaking with a rarely used dialect. Even she was nearly unrecognizable to herself. She had given it her all in order to win the award this time. If it were back then, Ning Xueluo would have never agreed to take on a role like this.</p><br/><p>The crowd gave them another round of applause after the video ended.</p><br/><p>Ning Xueluo put up a humble smile for the camera aiming at her.</p><br/>\n</div>"}