{"title": "Chapter 1548: For The Person I Love", "id": 1548, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1548-for-the-person-i-love", "volume_title": "Volume 16", "body": "<h1>Chapter 1548: For The Person I Love</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1548: For The Person I Love</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"For me to be able to receive this award, I need to thank a lot more people. Thanks to my crew, thanks to the director, thanks to my manager, and every fan that has supported me. I also want to thank the person who supported me in my darkest, toughest time, and times when I almost wanted to give up.</p><br/><p>\"If Meng Changge was the start of my dream, then Ji Feibai is the first station that I reached successfully. I still have a long way to go, a very long way. I'll never forget my aspirations and will give it my all to continue on this path!\"</p><br/><p>Ning Xi paused for a bit, then she looked somewhere in the crowd with her passionate gaze. She continued, \"For my dreams and for the person I love!\"</p><br/><p>The crowd gave her a big round of applause as she ended her speech.</p><br/><p>With the song \"Stubbornness\" playing in the background, the Golden Film Awards officially ended.</p><br/><p>\"When I'm different from the world, then let me be different.</p><br/><p>I'm my own God in the place I lived;</p><br/><p>Me and my proud stubbornness, I sing out loud amidst the wind.</p><br/><p>I'm going crazy for myself this time.</p><br/><p>Yes, those who love me. don't be nervous; my stubbornness is kind</p><br/><p>You didn't care about my past and saw my wings.</p><br/><p>You said that only after being burnt, then only a phoenix could be born</p><br/><p>A headwind is more suited to soar.\"</p><br/><p>…</p><br/><p>At this moment, the entrance was flooded with journalists. People surrounded the artistes the moment they left the hall.</p><br/><p>\"Director Feng, 'Mountain' received eight nominations this time but only managed to win the Best Screenplay award. What do you think?\"</p><br/><p>\"Director Feng, do you feel regret that you missed out on the Best Director award?\"</p><br/><p>Qi Feng went forward in silence without any intentions of answering any questions.</p><br/><p>The journalist would not let him get away this easily. \"Director Feng, what do you think about the Best Female Lead winner this time?\"</p><br/><p>\"Director Feng, please don't go yet!\"</p><br/><p>\"Director Feng, say something, please!\"</p><br/><p>…</p><br/><p>Amidst the chaotic crowd, Qi Feng suddenly stopped. He looked at the journalists quietly, then he said, \"She deserved it.\"</p><br/><p>Everyone and the journalists were taken aback. After that, they were in an uproar.</p><br/><p>Qi Feng had actually said Ning Xi deserved the award?</p><br/><p>It was apparent that no one expected the other director candidate to regard her this highly. Everyone was also impressed by Director Feng's generosity. He was able to reply them with this feedback under such high pressure.</p><br/><p>When Ning Xueluo heard what he said, her face turned green.</p><br/><p>Before she could recover from her emotions, the journalists surrounded her when they saw her. She had nowhere to go.</p><br/><p>Of course, it was not because she stood out tonight. It was because... She had become such an embarrassment!</p><br/><p>Ning Xueluo was the top favorite this time, yet in the end, she received nothing and disappointed a lot of people. It was already embarrassing enough and her director had just stepped on her further by indirectly saying that Ning Xi's acting was better than hers.</p><br/><p>What did it signify when \"Mountain\" was nominated for eight awards but only managed to win one?</p><br/><p>\"The World\" received four nominations: Best Action, Best Director, Best Female Secondary Lead, and only the Best Female Lead did not manage to win. Again, what did this say about the situation?</p><br/><p>Even a blind amateur could tell…</p><br/><p>\"Xueluo, you had the best chance this time around, but you've lost. Just now, Director Feng said Ning Xi deserved the award. Can you tell us what you think?\"</p><br/><p>\"'Mountain' only managed to win the Best Screenplay award. Does it mean that you weren't able to bring out the best of it?\"</p><br/><p>\"As everyone knows, you were trying to change your style with this film. Now that you've failed, what are your future plans?\"</p><br/>\n</div>"}