{"title": "Chapter 1541: Stars of The Night", "id": 1541, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1541-stars-of-the-night", "volume_title": "Volume 16", "body": "<h1>Chapter 1541: Stars of The Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1541: Stars of The Night</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After two hours, the red carpet appearance ended.</p><br/><p>The exciting award ceremony had finally begun!</p><br/><p>The Golden Film Awards was regarded as the Oscars of the Chinese film community. Anyone who was into films would know that it was the highest honor for Chinese films to be nominated for the award. This award was a huge accomplishment and attestation to the production of films and the capabilities of actors. Song Lin, Leng Manyun, Zhao Sizhou, Fang Xiaowen, Meng Shiyi... All the big shots had received this award before.</p><br/><p>Frankly, the Golden Film Awards also indicated one's status.</p><br/><p>The Golden Film Awards was regarded highly all because of its fairness. The whole judging process was done in secret. All the nominated artistes were nervous.</p><br/><p>Ning Xueluo was also rather jittery. Even after investing so much effort, she only managed to receive the nomination list slightly earlier from Chang Li. To build more interest around the film \"Mountain\", she had slipped it into several other unimportant nominations, but in the end, she still would not know the final results.</p><br/><p>However, she had actually been nominated for the two roles because of her own capability. She became the top candidate to win the award and her chances were quite high.</p><br/><p>She was the center of the attention the whole night and was projected on the big screen most of the time.</p><br/><p>Ning Xueluo sat there with her impeccably perfect posture as she put on a smile. She glanced at Ning Xi nearby and laughed at her deep down inside. \"This is the Golden Film Awards ceremony. It's not a place that you can win by just flaunting yourself. You still need the capability to speak for yourself!\"</p><br/><p>If she won the award, all her previous negative news would be washed away.</p><br/><p>Furthermore, the issues from the Tang family had now been taken care of as well.</p><br/><p>She had sent someone to investigate. The Tangs had tried to seek help everywhere. They were naive enough to think they would be able to change the selected university but of course, they had failed and could do nothing else.</p><br/><p>Everything had gone according to her plan.</p><br/><p>People from the Tangs had no power at all. They could just suck it up. The related organizations would not care enough to go through all the trouble just to help them!</p><br/><p>Sun Lan had even given her a call after that, asking if she knew anything about Tang Nuo's first choice university being changed. She was probably trying to ask her for a favor, so Ning Xueluo had replied impatiently and hung up.</p><br/><p>She could never ever be held back by these people, by her family!</p><br/><p>All the celebrities were gathered off the stage.</p><br/><p>In the middle row, the crew from \"Mountain\", \"The World\", and \"Dream Chaser\" were seated.</p><br/><p>The pretty hostess for the night, He Jiaying, went up the stage gracefully.</p><br/><p>\"Dear guests and audiences from all over the world, I'm your host for tonight, He Jiaying! Welcome to the 53rd Golden Film Awards ceremony…\"</p><br/><p>After her welcome address, the crowd gave her a round of applause.</p><br/><p>After a short while, it was time for the award presentation.</p><br/><p>\"Up next, we'll be presenting the Best Visual Effects Award. As everyone knows, this award signifies the movie's post-production quality, which is one of the most important aspects of movie production. Now, let's look at the nominated works…\"</p><br/><p>After the first few awards, there was a singing performance by an invited guest. Soon after a short interval, the ceremony reached its tiny climax.</p><br/><p>He Jiaying gushed with excitement, \"The next award we're presenting is... Best Female Secondary Lead!\"</p><br/>\n</div>"}