{"title": "Chapter 1549: She Would Not Allow This", "id": 1549, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1549-she-would-not-allow-this", "volume_title": "Volume 16", "body": "<h1>Chapter 1549: She Would Not Allow This</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1549: She Would Not Allow This</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The journalists' questions were increasingly explosive to the point that someone even asked her, \"How do you feel to be defeated by a junior who was in the same company as you?\"</p><br/><p>Even Ning Xueluo's manager, Chang Li, could not escape. She had been asked quite a few questions that made her feel like burrowing her head in the ground.</p><br/><p>After all, she had chased away this award-winning actress, Ning Xi.</p><br/><p>\"Miss Chang, back then, when your company ended the contract with Ning Xi, did you ever think that Ning Xi would have such potential?\"</p><br/><p>\"Miss Chang, have you regretted your decision in the past?\"</p><br/><p>...</p><br/><p>\"Everyone, please make way. Please make way. Thank you, everyone, for your concern towards Xueluo. Later on, we'll arrange for an interview with everyone to gather the answers to all your questions!\" Chang Li and Su Yan both shielded Ning Xueluo and tried to get through the crowd.</p><br/><p>\"Mr. Su, regarding Ms. Ning's painful loss in the Golden Film Awards, what do you have to say about that?\" The journalists started to train the awkwardness at Su Yan.</p><br/><p>Under the journalist's jostling, Su Yan frowned, then he said, \"Xueluo will forever be the best female lead in my heart.\"</p><br/><p>When she heard Su Yan's words, Ning Xueluo's extremely miserable expression finally looked slightly better.</p><br/><p>Right at that moment, someone from the crowd suddenly cried out in surprise excitedly and shrieked.</p><br/><p>The award-winning actress for the night, Ning Xi, had come out.</p><br/><p>The moment Ning Xi appeared, all the journalists, who surrounded Ning Xueluo earlier, left completely. Even Su Yan's eyes could not help but look over.</p><br/><p>\"Ning Xi, congratulations on your win for the best secondary female lead and best female lead! You managed to bring home two trophies! As the biggest winner of the night, can you let us know how you're feeling right now?\"</p><br/><p>\"Surpassing seniors who have long been in the industry in such a short amount of time, movie queen Ning has proven that she was born to be in the entertainment industry!\"</p><br/><p>\"Just wondering what are your upcoming work arrangements, movie queen Ning. We heard that Director Jiang Xingzhou has already shown a gesture of peace. Is this true?\"</p><br/><p>...</p><br/><p>Movie queen Ning... Movie queen Ning...</p><br/><p>This title of \"movie queen Ning\" should have been hers, but at this moment it had become Ning Xi's!</p><br/><p>It was Ning Xi's! How had it become Ning Xi's?!</p><br/><p>She had taken a long time to prepare and even made such a huge sacrifice. She did not even hesitate to act as those dirty and lowly characters. Two films had been nominated at the same time, yet at last, Ning Xi had won the award. How was she going to maintain her footing in the entertainment circle after this?</p><br/><p>Since the dawn of time, people stepped on those above and lifted those below them. There were even whispers in her ears from the other artistes...</p><br/><p>\"Hehe, back then, Ning Xueluo even said something about how actors should speak with their capabilities! Tsk tsk, her words were so right! As actors, they should indeed be speaking with their abilities! Now, she should have nothing to say, right?\"</p><br/><p>\"Her looks and acting skills can't compare to Ning Xi's. I wonder where she found her sense of superiority every day... Even with men... Tsk tsk, with Ning Xi's qualifications, it shouldn't be too hard if she wants to find someone wealthier and more influential than Su Yan, should it?\"</p><br/><p>...</p><br/><p>As she listened to these horrible things, Ning Xueluo felt as if there was a fire raging in her.</p><br/><p>Shut up, shut up, shut up!</p><br/><p>She was the honorable lady of the Ning family, Ning Xi was just a lowly hillbilly. How could she compare to her!?</p><br/><p>She thought about how in the future, as long as she was in front of Ning Xi in the entertainment industry, she would be a rank lower than her. With the headline that she lost her junior, that violent resentment was about to swallow her whole.</p><br/><p>No! She would not allow this!</p><br/><p>That village wild fowl, that lowly foster daughter... What reason did she have!? For what reason did she dare to walk all over her!?</p><br/><p>Because of her extreme anger, Ning Xueluo's entire body was trembling. While Su Yan had gone to get the car, she immediately gave Chang Li a sinister gaze to hint her to make a move.</p><br/>\n</div>"}