{"title": "Chapter 1558: Perfect Plan", "id": 1558, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1558-perfect-plan", "volume_title": "Volume 16", "body": "<h1>Chapter 1558: Perfect Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1558: Perfect Plan</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Actually, it was not impossible to have another child with Zhuang Lingyu again...</p><br/><p>Zhuang Lingyu's first delivery had happened in a run-down town. Unfortunately, her womb had an infection after she gave birth, so although she recovered, she still suffered from a severe loss of blood. After her first child, she was unable to conceive again.</p><br/><p>Because of that, Zhuang Lingyu was really focused and concerned on her only daughter Ning Xueluo.</p><br/><p>It was supposed to be a taboo topic in front of Zhuang Lingyu, so Ning Yaohua had never dared to suggest having another baby again.</p><br/><p>However, after Ning Xueluo's real identity was exposed and especially when the people from the Tang family, especially Sun Lan who looked so identical to Ning Xueluo appeared, Ning Yaohua felt that it was worth mentioning again.</p><br/><p>With a caring attitude, Ning Yaohua went to Zhuang Lingyu's side and held her shoulders. He asked gently, \"Lingyu, have you thought about what I told you before? Actually, surrogate pregnancy is really advanced nowadays. Not only can you choose the gender of the child, most importantly, you don't have to suffer for nine months!\"</p><br/><p>Zhuang Lingyu looked a little uncomfortable, but she was not against it. She frowned a little. \"I'm already at this age. Would it work?\"</p><br/><p>The moment Ning Yaohua saw his plan coming to light, he patted her shoulder. \"Who said that? If I told people my wife is 20 years old, I bet people would believe it too!\"</p><br/><p>\"Stop that nonsense!\" Zhuang Lingyu pouted. Although she was scolding him, she did not sound angry at all.</p><br/><p>When she saw how identical Xueluo was to Sun Lan, she was a little regretful and the thoughts that she tried to suppress for a long time surfaced.</p><br/><p>Who would not want a child with their very own blood flowing in their veins?</p><br/><p>If she could have another child again, she would surely raise him far better and give him everything. That child would be more perfect than Xueluo…</p><br/><p>More and more people had done surrogate pregnancy in recent years. She had heard about it from her circle of friends. Just some time ago, Mrs. Li conceived another son through a surrogate pregnancy although she was already 48 years old.</p><br/><p>Maybe... she could try?</p><br/><p>Although they were old and might not be able to accompany this child for a very long time, he would be fortunate because he had a gentle and caring sister to take care of him…</p><br/><p>Xueluo had always mentioned how lonely it was being the only child and was always looking forward to having a younger sibling. If it really worked, she would be really glad!</p><br/><p>\"Lingyu, if you agree, I'll reschedule my work and accompany you for a checkup overseas!\" Ning Yaohua suggested in excitement.</p><br/><p>\"L-let me think about it!\" Zhuang Lingyu then asked hesitantly, \"Yaohua, should we discuss this with Xueluo first?\"</p><br/><p>Ning Yaohua replied, \"There's no need. It's not confirmed, after all. We'll tell her after it succeeds to give her a surprise.\"</p><br/><p>Zhuang Lingyu gave it some thought. In the end, she agreed to it. She could not really bring herself to talk about this matter.</p><br/><p>Ning Yaohua's plan was perfect. Wait until his son was born. The shares he had given Ning Xueluo would then have to be transferred back to his one and only heir. Xueluo would not have any issues with that since she was so obedient, and it was common sense for a son to inherit his father's career. Even the Su family would not have a say in this.</p><br/><p>Of course, he would not treat Xueluo any less by then.</p><br/><p>Moreover, it was already good enough insurance for her to marry into the Su family.</p><br/>\n</div>"}