{"title": "Chapter 1557: Wanted A Son", "id": 1557, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1557-wanted-a-son", "volume_title": "Volume 16", "body": "<h1>Chapter 1557: Wanted A Son</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1557: Wanted A Son</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"I'll release an announcement. I'll quit my career... Forever... Then, no one will care about this matter anymore! If I stay in the entertainment industry for another day, this matter will keep on being brought up!\"</p><br/><p>Zhuang Lingyu's voice came from behind her. \"Xueluo, what are you talking about? Isn't acting your favorite thing to do? Isn't that your dream? This matter isn't as serious as you think. So what if everyone knows you're not our biological daughter? You're still the daughter of the Ning family!</p><br/><p>\"As for the rumors going around and the nonsense your Second Uncle spouted, they have no proof at all. Don't mind them. People will forget them soon enough!\"</p><br/><p>Of course, Ning Xueluo knew that. Although the whole situation seemed grave, compared to matters that were fatal to artistes such as drugs, extramarital affairs, or political affairs, her situation was at most, a personal issue. While it would affect her image to a certain extent, it would not reach the point where her career would be ruined.</p><br/><p>She had joined the entertainment industry because she knew that Ning Xi liked acting, so she just wanted to get something that Ning Xi could not attain.</p><br/><p>It was definitely possible for her to stay in the entertainment industry, but she would always bear the tainted name of a leech. No matter where she went, she would always be compared to Ning Xi.</p><br/><p>She could never stand being humiliated like this. How could she look at Ning Xi acting all high and mighty in front of her?</p><br/><p>At this point in time, she might as well take a step back and quit her acting career once and for all!</p><br/><p>Ning Xueluo was still kneeling with a determined attitude. \"Father, Mother, I've already decided! I'll do anything to reduce the consequences our family has to face!\"</p><br/><p>Zhuang Lingyu felt sorry for her daughter and hugged her. \"Xueluo, it must be tough for you…\"</p><br/><p>Ning Yaohua sighed helplessly, \"Xueluo, I'm so sorry for what you have to go through!\"</p><br/><p>Zhuang Lingyu looked angry. \"It must be impossible for the old lady to come all the way here from that small town! It's obvious that someone's behind this! They even picked the opportunity to sabotage the event and cause such an uproar!\"</p><br/><p>Ning Yaohua had a stern expression on his face. \"Ning Xi's really overdone it this time!\"</p><br/><p>\"Does she think that we'd have to give her face if she did that? Dream on! I'm only regretting that it wasn't Xueluo who came out of my womb! Xueluo's suffered so much for nothing!\" Zhuang Lingyu spoke angrily.</p><br/><p>Ning Xueluo seemed satisfied when she saw Zhuang Lingyu and Ning Yaohua defending her. She said gratefully, \"Father, Mother... I'm alright! Really! Actually, it's fine this way. I can focus on the company. History is in a busy phase as well and there're lots to be done.\"</p><br/><p>\"I'm glad that you can think this way, Xueluo. Everything will pass. Mother and Father will always be on your side.\"</p><br/><p>Zhuang Lingyu and Ning Yaohua comforted her for a long time.</p><br/><p>After Ning Xueluo left the study room, Zhuang Lingyu and Ning Yaohua stayed back.</p><br/><p>Ning Yaohua was really troubled over this matter and it showed on his face. He was staring blankly at the newspaper on his table.</p><br/><p>The newspaper had allocated a full page to publish the picture of Ning Xueluo and Sun Lan. They were two almost identical faces, constantly reminding him that the girl in front of her was not his real child.</p><br/><p>No matter how great she became, she was not his real child after all…</p><br/><p>If he had a son, that would be a joy.</p><br/><p>As far as he knew, his brother had not given up on getting a son. He was still out messing with young girls.</p><br/><p>Sadly, the Zhuangs were not people he could mess with! So, if he really wanted a son, it had to be an offspring of him and Zhuang Lingyu.</p><br/><p>Actually, it was not impossible to have another child with Zhuang Lingyu again…</p><br/>\n</div>"}