{"title": "Chapter 1562: A Hole In His Brain", "id": 1562, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1562-a-hole-in-his-brain", "volume_title": "Volume 16", "body": "<h1>Chapter 1562: A Hole In His Brain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1562: A Hole In His Brain</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi's short reply tamed Lu Tingxiao instantly. Su Yan was silent for some time, then he hung up the phone.</p><br/><p>Ning Xi felt a little odd after the call was hung up. She asked Lu Tingxiao, \"Lu Tingxiao, what did that guy say on the phone?\"</p><br/><p>Lu Tingxiao had not seemed very alright just now…</p><br/><p>Lu Tingxiao replied, \"He asked if it's still possible for the both of you.\"</p><br/><p>Ning Xi was speechless.</p><br/><p>It took some time for Ning Xi to get her voice back. Her mouth twitched. \"Is there a hole in this guy's brain?\"</p><br/><p>Lu Tingxiao did not say anything. He glanced over at the girl as he pursed up his lips.</p><br/><p>He had already realized something was not right with the way Su Yan looked at Ning Xi, especially on the night of the award ceremony…</p><br/><p>As a man, he perfectly understood the intention in Su Yan's gaze towards Ning Xi.</p><br/><p>His girl was becoming more and more amazing, turning more attractive than ever…</p><br/><p>\"Darling, don't mind him. If you care what he says, your standards will drop!\"</p><br/><p>Ning Xi's eyes turned cold.</p><br/><p>Was it still possible?</p><br/><p>Where did he even find the courage to ask that?</p><br/><p>…</p><br/><p>At the Su's residence.</p><br/><p>Ning Xueluo had just returned from the press conference.</p><br/><p>Leaving the entertainment industry was just the beginning. Things were about to get messier.</p><br/><p>The moment she returned home, the whole family was there, including Su Hongguang, Zheng Minjun, Su Xun, and Zhao Shanshan.</p><br/><p>Everyone except Su Yan.</p><br/><p>\"Father, Mother, Su Xun, Shanshan…\" Ning Xueluo greeted everyone.</p><br/><p>\"Wow! Look at who this is? Our star is back!\" Zhao Shanshan said with a sarcastic tone. She would never pass up a chance to humiliate Ning Xueluo.</p><br/><p>Zheng Minjun's expression looked terrible. She stared at Ning Xueluo. \"Why are you back so late?\"</p><br/><p>She had been alright with Ning Xueluo when she had not been aware that she was the foster daughter of the Nings. However, ever since she found out about it, especially when she saw her vulgar-looking mother and grandmother, she felt disgusted towards Ning Xueluo.</p><br/><p>She was becoming the joke among her circle of friends and was too afraid to go out as people might look at her weirdly. She feared that people might mock her for letting her son marry a wild fowl instead of a real phoenix.</p><br/><p>If it were not for the 15% of shares in her hands, she would not have tolerated this situation at all!</p><br/><p>Ning Xueluo hid the anger in her eyes and spoke softly, \"I had some things to work on in the company after the press conference…\"</p><br/><p>Before Ning Xueluo could finish explaining herself, Zheng Minjun interrupted her, \"Is there anything else more important than your husband? It's been three days since Su Yan has been absent from the company or even came home! Don't you care about where he went?! Is this how you are as a wife?\"</p><br/><p>\"Mother, I'm sorry. I've been really busy these few days. There're still some procedures to be done at Starlight and I need to check into Ning International. I'll go and look for Su Yan now…\"</p><br/><p>Zheng Minjun's temper improved slightly when she heard Ning Xueluo was going to work at Ning International, but she still warned, \"Don't go anywhere these few days. You know how messy things are thanks to your mother and your grandmother. I don't even dare to attend private parties at the moment! Don't embarrass yourself!\"</p><br/><p>Ning Xueluo clenched her fists while keeping an obedient attitude on the surface. \"I got it, Mother. I'll stay at home until this matter cools off.\"</p><br/><p>\"Okay, go and look for Su Yan now!\" Zheng Minjun waved her hands impatiently.</p><br/>\n</div>"}