{"title": "Chapter 1579: His Little Bun Is Secretly Evil", "id": 1579, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1579-his-little-bun-is-secretly-evil", "volume_title": "Volume 16", "body": "<h1>Chapter 1579: His Little Bun Is Secretly Evil</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1579: His Little Bun Is Secretly Evil</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Guan Zhichen's attitude looked friendly, but arrogance was hidden in his tone.</p><br/><p>Anyone who knew about the Rubik's cube would know that this model was especially difficult to solve. A normal person would take three to five weeks to solve it, but he did it within an hour.</p><br/><p>Even his father had praised him!</p><br/><p>The little bun looked at Guan Zhichen, then looked at the Rubik's cube he handed over. He blinked as thought about what to do.</p><br/><p>His mother told him that it was rude to ignore a person that was talking to him.</p><br/><p>So, the little bun took the Rubik's cube and started playing with it.</p><br/><p>Guan Zhichen looked at his father and grandfather proudly as Little Treasure accepted his gift and started playing with it. He then went up to the little bun as he tried to teach him. \"Brother Little Treasure, you can't make all the sides the same color this way... Let me teach you the technique... You should work on this layer first, and... Ah, not like this. You can't get anywhere like this... You have to follow what I said…\"</p><br/><p>As Guan Zhichen adopted the big brother role and tried to teach Little Treasure patiently, the next moment, all his words were stuck in his throat when he looked at the cube in Little Treasure's hand.</p><br/><p>Little Treasure looked up expressionlessly as he handed the Rubik's cube that he had solved within just two minutes back to the older boy. He looked at Guan Zhichen and obeyed what his mother taught him. He said calmly, \"Thank you. It's fun.\"</p><br/><p>Guan Zhichen was speechless.</p><br/><p>What a good way to kill time! Two minutes…</p><br/><p>\"Pfft!\" Lu Jingli witnessed this scene when he just got out of the crowd. He almost laughed out loud but stopped when Lu Chongshan glared at him.</p><br/><p>His little bun was secretly evil! Overpower! He killed it!</p><br/><p>Although Lu Chongshan glared at Lu Jingli, actually... He felt pretty good about it!</p><br/><p>Only Lu Tingxiao was calm and composed. He fully understood his son's level of power and what he was capable of, so he was never worried about him from the beginning.</p><br/><p>Guan Zhichen's face reddened in embarrassment. He almost puked blood, especially when Little Treasure spoke with such a straight face.</p><br/><p>Damn it! Was this brat trying to humiliate him?</p><br/><p>Because of his grandfather and father's warning back at home, he could not get angry at all even when he was embarrassed. He forced a smile and praised the little bun, \"Uhh, you... You're really amazing, Brother Little Treasure! You solved it so quickly! The way you solved is really special. I've never seen it before…\"</p><br/><p>Guan Zihao noticed that his son could not continue the conversation any longer, so he jumped in. \"Zhichen, bring Brother Little Treasure over there to play! Take care of him!\"</p><br/><p>He had not been around last time, but he had to admit that the young prince of the Lu family was really something.</p><br/><p>\"Okay, Father, I got it!\" Guan Zhichen took a deep breath and continued to build the bond with this person whom he hated.</p><br/><p>After the two kids left, Guan Rui then spoke to Lu Chongshan and Yan Ruyi with a smile, \"Zhichen has been praising Little Treasure every day at home. He said that only Little Treasure could get him interested in a discussion. They're really similar to Ziyao and Tingxiao back then…'</p><br/><p>Guan Zihao was looking at Lu Tingxiao and they spoke as if good friends who had not met for a long time.</p><br/><p>From the elders of the Lu family to Lu Tingxiao, and even the prince…</p><br/><p>Despite the absence of Guan Ziyao, everyone at the scene knew what the Guans were scheming, but their tricks were really well thought out.</p><br/>\n</div>"}