{"title": "Chapter 1575: My Brother Is Not Easy To Bully", "id": 1575, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1575-my-brother-is-not-easy-to-bully", "volume_title": "Volume 16", "body": "<h1>Chapter 1575: My Brother Is Not Easy To Bully</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1575: My Brother Is Not Easy To Bully</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Jingli had only managed to narrowly escape from the crowd.</p><br/><p>Of course, he liked girls and beauties, but he could not have all of these beauties because all of them were forcing him to get married!</p><br/><p>Dating would be fine, but he did not want to enter the graveyard of love called marriage!</p><br/><p>For him to be willing to enter the graveyard, it had to be his goddess!</p><br/><p>\"Father! Mother! You're too much! Am I your son? Earlier, I was already begging for help, yet you guys ignored me!\" Lu Jingli ran up to Yan Ruyi and Lu Chongshan in anger.</p><br/><p>Yan Ruyi fixed her son's slightly messy hair and shot him an annoyed look. \"What nonsense are you spewing?! What about helping or not?! How old are you now? You should start considering marriage. There are so many excellent girls here today. Don't you fancy even one of them?\"</p><br/><p>\"We've let you be for so many years, but that's enough. Use this wonderful opportunity to decide on someone to marry within the year!\" Lu Chongshan issued a stern military order.</p><br/><p>Lu Jingli instantly muttered unhappily, \"You guys only know how to bully me! If you're that good, then speak to my brother about this!\"</p><br/><p>Lu Chongshan shot his son a look. \"Your brother too!\"</p><br/><p>Yan Ruyi glimpsed at all the young girls present tonight and there was a hopeful radiance on her face. \"All the girls here tonight are all pretty amazing. Maybe there'll be someone Tingxiao likes...\"</p><br/><p>Lu Jingli casually skimmed the candidates. \"Mother, don't say false things. None of them are as pretty as my sister-in-law!\"</p><br/><p>\"What sister-in-law?! Don't simply address people like that!\" Lu Chongshan immediately warned.</p><br/><p>He knew that that woman would not be attending tonight, so he had decided to hide the fact that Lu Tingxiao already had a girlfriend.</p><br/><p>Even though Tingxiao had announced it previously, as long as that woman did not appear tonight and get in the way, anything was possible.</p><br/><p>Lu Jingli obviously knew what his father was thinking. He could not help but immediately dampen his enthusiasm and said, \"Father, you're too naive. You think that just cause my sister-in-law can't accompany brother to attend this event, brother would allow you to order him about? My brother isn't as obedient and easy to bully as I am...\"</p><br/><p>\"You brat! What are you saying? Can't just think for your brother's sake?\" Yan Ruyi shook her head helplessly, then she looked the clock on the wall. \"It's already so late. Why isn't your brother here yet?\"</p><br/><p>Yan Ruyi was about to make a call to ask Lu Tingxiao where he was when suddenly there was the sound of excited shrieks at the scene. In fact, at the entrance, the crowd had started to part to create a path.</p><br/><p>Against the light, there were a large and a small silhouette standing. They were slowly making their way towards the front of the banquet hall.</p><br/><p>The little boy beside the man wore the same black tuxedo as the man, and he stood out, attracting hundreds of eyeballs.</p><br/><p>In his solid black tuxedo, the little boy's face had precisely the same cold and distant look as Lu Tingxiao. He was practically a carbon copy of his father with the look that could repel people miles away.</p><br/><p>Even though the little guy looked so distinguished and had perfectly inherited the Lu family's genes, he seemed a little too gloomy at such a young age.</p><br/><p>As some thought about this, the little guy came nearer.</p><br/><p>Upon closer inspection, they saw that on the little guy's tuxedo pocket was a cute little bunny ornament, instantly adding liveliness and childish cuteness to the child. All the adults around him melted from his charm.</p><br/><p>While Lu Tingxiao's presence was powerful and compelling as always, he was also as handsome as a god.</p><br/><p>All the young girls present had been anxious when they heard the rumors about Lu Tingxiao's frightful nature and indifference that made him hard to get along with. However, the moment when they saw Lu Tingxiao in person, they were already so excited that they almost wanted to immediately jump on him!</p><br/>\n</div>"}