{"title": "Chapter 1580: Cannot Let Her Down", "id": 1580, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1580-cannot-let-her-down", "volume_title": "Volume 16", "body": "<h1>Chapter 1580: Cannot Let Her Down</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1580: Cannot Let Her Down</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Speaking of the Guans and the Lus, they had come a long way.</p><br/><p>They had been on amicable terms since the generation of Guan Rui's father. Some of the descendants of the Guan family had married the Lu family as well. Some of them had working relationships. They had always been very close to each other, even during the years that the Guan family were overseas.</p><br/><p>After the Guan family returned, even though there had been some hostility between them, their strong bonds still existed.</p><br/><p>However, numerous capable people who were aiming for the position of the head lady were present. They could not just do nothing when they saw the Guan family making advances. People started letting their children get close to the young prince as well. At the same time, they were trying to appeal to the two elders, creating chances for their own people.</p><br/><p>For those who knew their worth, they gave up on that and took the chance to build their connection with the others tonight.</p><br/><p>Anyone who appeared at this event today was all top-level connections, especially people from the Lu family and the stakeholders. Each one of them was rarely seen in public. No one would pass up the chance to get closer to this core circle of the society.</p><br/><p>Lu Tingxiao was surrounded by many people, but in front of this young head of the family, everyone did not want to overdo shining his shoes. Those in lower positions knew their place and left after a short toast.</p><br/><p>Those with a certain level of position carefully made small talk and reported some development of their business. Only close relatives like Lu Chongyuan talked to his nephew closely and even touched on some sensitive topics.</p><br/><p>\"Tingxiao, as the saying goes, build your family first before your career. You should really consider marriage now. Even if it's not for yourself, think about your child!\" Lu Chongyuan tried to convince him before he carefully mentioned, \"I think that Ziyao girl isn't bad! You both have known each other since you were little, and you guys were really close too. A matching pair!\"</p><br/><p>Obviously, Lu Chongyuan was on the Guan family's side.</p><br/><p>The project Guan Ziyao had received recently involved the company Lu Chongyuan was in charge of. In addition to that, the sister of Lu Chongyuan's wife was Guan Rui's wife, making them in-laws, so of course, he would help the Guans out.</p><br/><p>He Jingzhu tilted her head and looked at her daughter, Lu Xinyan. \"Xinyan, why is Sis Ziyao not here today?\"</p><br/><p>Lu Xinyan looked around and said, \"Sis Ziyao's not here? I don't know…\"</p><br/><p>He Jingzhu then questioned her, \"How would you not know although you're so close to Ziyao? Didn't I ask you to bring her home for fun more often? We haven't seen each other for such a long time…\"</p><br/><p>\"Mother, you're really annoying. I told you I don't know. I just don't know! Your daughter is someone doing big things now. I'm really busy!\" Lu Xinyan then ran away.</p><br/><p>After all, she had been saved by Ning Xi once, and her first successful business owed thanks to Ning Xi as well. No matter what, she could not just let Ning Xi down!</p><br/><p>However, she was really close to Sis Ziyao. Her parents were leaning towards the Guan family as well. What she could do now was to stay away and not help anyone to avoid being in an awkward position in the future.</p><br/><p>As everyone was talking in the warm atmosphere, a person suddenly entered.</p><br/><p>Everyone avoided looking at the person directly when they saw who it was. The hall turned quiet for a moment, but it soon returned to usual. No one looked at the entrance as if they were ignoring and avoiding the person who just walked in.</p><br/>\n</div>"}