{"title": "Chapter 1588: Is Your Ex-Boyfriend", "id": 1588, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1588-is-your-ex-boyfriend", "volume_title": "Volume 16", "body": "<h1>Chapter 1588: Is Your Ex-Boyfriend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1588: Is Your Ex-Boyfriend</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>That person had chosen to appear at an occassion like the family meeting to expose the incident to everyone in the family because he knew it would definitely cause a huge uproar.</p><br/><p>The reason the Lu family had been so stable this generation was because of Lu Chongshan and his two sons' harmonious relationship. Now that such a bastard had suddenly appeared, that child's mother and Lu Chongshan seemed very close too. If such a thing was not handled well, it would cause turmoil in the entire family.</p><br/><p>After all, this involved the most important question about his successor.</p><br/><p>If that bastard were just an ordinary person there to get some benefits, that would be fine. After all, Lu Tingxiao's current status was as steady as Mount Tai. Even if a few brothers of the same father and different mothers appeared, it would not pose a challenge to him.</p><br/><p>However, the tricky thing was that many people present had already recognized that the bastard was actually someone who had recently appeared in the country and started the most influential investment company in Imperial. He was none other than Yi Lan Innovative Investment Group's boss, Yun Shen!</p><br/><p>He had robust finances and his background had an unfathomable depth. Among society, he had even been considered to be the only person who could contend against Lu Tingxiao.</p><br/><p>Such a person had suddenly turned out to be Lu Chongshan's illegitimate child. It seemed like he ranked above Lu Jingli too. Like cold water splashed into a deep fryer, the effect was pretty explosive.</p><br/><p>Suddenly, the entire company was filled with anxiety.</p><br/><p>At a meeting room in the Lu Corporation.</p><br/><p>The screen displayed some slides that revealed Yi Lan Investment Group's top secret information in detail. In just a glance, one would know that it was well-prepared, and had been planned for a rather long time.</p><br/><p>On the chief seat, the man's presence was cold and powerful as always as if nothing had happened that day. He spoke clearly as he analyzed Yi Lan Investment Group's situation as though every sentence was an imperial edict...</p><br/><p>The man up front was akin to an enormous and majestic mountain, steadily standing tall. He practically calmed everyone down in an instant.</p><br/><p>Right... We still have Lu Tingxiao...</p><br/><p>Having gone through five years of peace and prosperity, had they actually forgot how terrifying that living King of Hell had been back then?!</p><br/><p>Yun Shen looked like someone who was not easy to deal with. Back then, Lu Tingxiao had even managed to solve the crisis of the Lu family's dying mess both domestically and abroad. How could he be pushed around by some illegitimate child now?</p><br/><p>...</p><br/><p>After the meeting, everyone had felt much calmer.</p><br/><p>At Peachwood.</p><br/><p>Ning Xi did not know why she had felt so restless the entire day. She was considering whether to call Lu Tingxiao to ask or not when her doorbell rang endlessly.</p><br/><p>Ning Xi looked through the monitor of her robot, Steamed Bun and saw that it was Jiang Muye, so she pressed the button to open the door.</p><br/><p>The moment the door was opened, Jiang Muye rushed up to her like a little rocket. He held her by the shoulders and shook her vigorously. \"Ning Xi, something... Something huge has happened...\"</p><br/><p>\"What happened? What huge thing has happened? Did something happen to Lu Tingxiao?\" Ning Xi immediately asked.</p><br/><p>Jiang Muye shook his head. \"No, no, not Lu Tingxiao... No, wait, technically it is related to Lu Tingxiao! No, no, no... That's not right! I should say that it's more like it's related to you!\"</p><br/><p>Ning Xi felt the veins on her forehead popping. \"Yo, can you continue chatting happily forever? What are you trying to say?!\"</p><br/><p>Jiang Muye was frantic. He took a few seconds before he finally recovered his normal speaking abilities as he explained, \"Today, at the family meeting, the old man suddenly popped up with an illegitimate child. My uncle suddenly has an illegitimate younger brother...\"</p><br/><p>\"Wh-what!?' Ning Xi was stupefied by the impact of this news.</p><br/><p>When he saw Ning Xi's incredibly shocked expression, Jiang Muye pitied her. Was she already dumbfounded just like that?</p><br/><p>\"Illegitimate child! Is this true? Wait... What does that bastard have to do with me?\" Ning Xi quickly asked.</p><br/><p>Jiang Muye massaged his forehead to calm his emotions first, then he said, \"The Lu family bastard... My uncle's brother of the same father and different mother... is your...\"</p><br/><p>Ning Xi almost got a heart attack from the anticipation. She gritted her teeth and said, \"My what? Mr. Jiang, if you tease me anymore, I'm going to beat you up until you throw milk up!\"</p><br/><p>Jiang Muye immediately blurted out, \"Is your ex-boyfriend.\"</p><br/><p>Ning Xi was speechless.</p><br/>\n</div>"}