{"title": "Chapter 1586: Who Is He Actually?", "id": 1586, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1586-who-is-he-actually", "volume_title": "Volume 16", "body": "<h1>Chapter 1586: Who Is He Actually?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1586: Who Is He Actually?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In a high-class VIP ward at Ren Ai Hospital.</p><br/><p>At that moment, the disordered guests had settled down and all the relatives who had come to visit had left. Little Treasure had been sent home by the butler. Suddenly, there was only Lu Chongshan on the sick bed, Yan Ruyi who sat by the bedside, as well as Lu Tingxiao and Lu Jingli who stood in the ward.</p><br/><p>There was a never-felt-before heaviness in the atmosphere.</p><br/><p>It had been a while before Lu Jingli could not help but break the silence. His voice trembled slightly as he said, \"According to that person, he's older than I am and younger than my brother...\"</p><br/><p>What did this mean?</p><br/><p>It meant that Lu Chongshan had cheated during his marriage!</p><br/><p>Yan Ruyi shut her eyes and quietly commanded, \"Jingli, that's enough...\"</p><br/><p>Lu Jingli's face was filled with grief and indignation. He did not care about his mother trying to stop him. He balled his fists and continued to say, \"You clearly cheated during the marriage, yet you personally wrote 'My Wife' on that woman's memorial tablet! Father! Where did you place our mother?\"</p><br/><p>Even though Lu Chongshan's temperament was stubborn and a little too conservative, no matter whether it came to his family or the company, he regarded responsibility highly.</p><br/><p>With families like theirs, a lot of those in power had a mess of illegitimate sons and daughters. However, for all these years, apart from their mother, Lu Chongshan had never had any other woman. It had only been him and his brother, the two sons.</p><br/><p>Usually, even though Lu Jingli always ridiculed him, he had always adored him in his heart.</p><br/><p>Unfortunately, today it was as if his belief system all this while had suddenly collapsed...</p><br/><p>He could not accept it no matter what.</p><br/><p>Lu Jingli was overwhelmed with emotions. He was about to continue speaking when a broad palm landed gently on his shoulder, then that palm rubbed his head to comfort him.</p><br/><p>Lu Jingli looked at his brother beside him. Regardless of what happened, there would always be his brother who protected him. He could remain calm even at such a moment. Lu Jingli suddenly felt his eyes water.</p><br/><p>On the sick bed, Lu Chongshan had a regretful expression. Because he was too weak, he spoke with a stammer, \"This... is my fault... but... now is not the time to talk about these things... Jingli... Tingxiao... the two of you... quickly get prepared... In two hours... organize a high-level management meeting with everyone... I... I will host it myself...\"</p><br/><p>\"Chongshan, you're already in this condition. How can you chair any meeting?! It won't be too late to wait for you to get better, or maybe you should just leave this Tingxiao and Jingli...\" Even if Yan Ruyi was miserable, she still could not just remain indifferent to seeing Lu Chongshan like this.</p><br/><p>\"No!\" For some reason, Lu Chongshan's emotions were suddenly been stirred up. \"I want to go by myself! I want to go myself... That person...\"</p><br/><p>It was not sure what Lu Chongshan was thinking about, but there was an unease in his eyes as he instructed coldly, \"Whatever it is, do as I say!\"</p><br/><p>Lu Jingli looked at Lu Chongshan's unusual reaction and frowned. \"Father, why do you look like you're wary of that person? Who is he actually? No, wait... Maybe I should ask... Who is his mother actually?\"</p><br/><p>\"This is not what you should be asking! Get out!\" Lu Chongshan instantly turned aloof.</p><br/><p>\"What do you mean it isn't something I should ask about? You should be giving us an...\"</p><br/><p>Lu Jingli was about to argue when Lu Tingxiao held him firmly by the shoulders.</p><br/><p>Lu Tingxiao looked at Lu Chongshan on the sick bed and spoke with a calm tone, \"I'll host the meeting. Mother, you accompany Father, so he can rest easy. Jingli, follow me outside.\"</p><br/>\n</div>"}