{"title": "Chapter 1598: It Was Exactly Like Xiao Xi Xi's", "id": 1598, "volume": 16, "url": "http://boxnovel.org/hidden-marriage-chapter-1598-it-was-exactly-like-xiao-xi-xis", "volume_title": "Volume 16", "body": "<h1>Chapter 1598: It Was Exactly Like Xiao Xi Xi's</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1598: It Was Exactly Like Xiao Xi Xi's</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Some people started voicing out after Chi Shuai made his move. \"That's right. He's so short and fair, just like a girl!\"</p><br/><p>\"Sissy! Sissy... I saw on TV that he's like a sissy…\"</p><br/><p>\"He even plays with girl's toys!\"</p><br/><p>…</p><br/><p>Guan Zhichen was defending Little Treasure, \"Stop messing around. We're all friends! Don't make things worse. How could you guys say that about Brother Little Treasure?\"</p><br/><p>The girls, including Tian Tian, were defending Little Treasure angrily. \"You guys are overdoing it! Don't bully Little Treasure!\"</p><br/><p>Chi Shuai rushed in and took out the little rabbit plushie from Little Treasure's suit pocket. He clenched it in his hand and mocked, \"That's right! Playing with a girl's toy! Disgusting!\"</p><br/><p>At this moment, the ladies in the living room realized that something was not right in the garden, especially Elder Madam Chi. She stood up and went towards the garden quickly.</p><br/><p>The expressionless Little Treasure's face changed when his little bunny was snatched away.</p><br/><p>Guan Zhichen did not realize this. He was just smug when he saw the brat being bullied and not having any comeback.</p><br/><p>\"Give it back.\" Little Treasure looked at the little bunny doll that had been snatched away by Chi Shuai with an extremely cold expression.</p><br/><p>Chi Shuai shivered but felt incredibly pumped up when he saw Little Treasure looking so weak. He was fearless at home after all, so it was not a habit that could be changed so easily. \"Nope! I don't want to! Get it from me if you can, shorty!\"</p><br/><p>Chi Shuai held the little bunny high up as he was taunting so that Little Treasure could not reach it. The other boys were laughing at him. \"He might cry later!\"</p><br/><p>\"Only girls cry!\"</p><br/><p>\"He's a girl after all…\"</p><br/><p>…</p><br/><p>Little Treasure took a deep breath. \"I'm saying it for the last time.\"</p><br/><p>\"I don't want to! Come on! I'd rather throw it away than giving it back to you! Shorty! Sissy!\" Chi Shuai was waving the doll around with his soiled hand.</p><br/><p>At this moment, the quiet, expressionless Little Treasure appeared right in front of him in a blink of an eye.</p><br/><p>Without any time to react, he only heard the sound of wind passed by his ears...</p><br/><p>The next moment, Chi Shuai, who was almost twice the size of Little Treasure, was kicked away by a long distance. He fell hard on the ground and dust flew up in the air…</p><br/><p>Everyone gasped. The children stood there, stunned.</p><br/><p>Little Treasure walked slowly towards Chi Shuai. He glared at the chubby boy who was still confused by what had just happened. It was supposed to be a really cute face, but his expression was extremely cold at this moment. \"I warned you.\"</p><br/><p>Somewhere nearby, Lu Jingli witnessed this whole scene just when he wanted to check on what was happening…</p><br/><p>What the heck!?</p><br/><p>That kick…</p><br/><p>It was exactly like Xiao Xi Xi's!</p><br/><p>He was actually worried that Little Treasure might get bullied, so he had rushed over.</p><br/><p>The children of the two monsters, his brother and Xiao Xi Xi... With the combined entity of their genes, could he even be bullied?</p><br/>\n</div>"}