{"title": "Chapter 1606: Brought Upon By Him", "id": 1606, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1606-brought-upon-by-him", "volume_title": "Volume 17", "body": "<h1>Chapter 1606: Brought Upon By Him</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1606: Brought Upon By Him</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>So, that was the case...</p><br/><p>Coincidentally, Ning Xueluo had quit the entertainment industry, and Ning Xi had won the Golden Film Awards. With her fitting image and popularity, the right timing, and favorable social conditions, she landed the role.</p><br/><p>\"Okay, Sis Zhizhi, got it! I'll be joining the crew the day after tomorrow, is that right?\"</p><br/><p>Previously, Ning Xi had understood the role. It was a mysterious Eastern woman with excellent martial arts skills who looked majorly cool. Such a role was not too difficult for someone like her who had a martial arts stuntwoman background.</p><br/><p>Nowadays, the Chinese film market was expanding. Even Hollywood could not be indifferent to it. In order to pull this end of the ticket sales, many Hollywood blockbuster movies liked to use this method. They would get an adequately popular Chinese person to star in a supporting role, then when it was promoted in China, they would use this point to boost interest. However, in reality, when it aired in theatres, the Chinese artiste would only be featured in the story for only a few minutes, or even tens of seconds. Even their dialogues would also only be limited to one or two lines.</p><br/><p>Previously, when she had done her internship in Hollywood, there was a vast difference between the treatment of Chinese people and white people.</p><br/><p>Even though it was very cruel, one could not do anything about it. It was simply how the current situation was.</p><br/><p>On the other end of the phone, Ling Zhizhi responded, \"Yes, enter the set the day after tomorrow. Because the post-production of 'Nine Realms' is complete and it'll be entering promotional period soon, I need to get ready. I can't personally accompany you over. Later on, I'll get Xiao Tao to go to the set with you.\"</p><br/><p>\"Okay, no problem.\" After Ning Xi finished talking to Ling Zhizhi, she hung up.</p><br/><p>Even though she was informed of such a surprisingly good news, today's defeat at the auditions still made Ning Xi feel somewhat regretful.</p><br/><p>Late at night, at Peachwood.</p><br/><p>At the door, the security system automatically recognized the face and fingerprint password of the person who had arrived with a beep.</p><br/><p>Lu Tingxiao had just entered the living room when he saw that the lights in the living room were switched on. The girl wore pajamas and reclined on the sofa, sleeping soundly. Her hand grasped onto a script filled with annotations.</p><br/><p>Lu Tingxiao frowned as he walked lightly over and slowly pulled the script out of her hands.</p><br/><p>He was about to put the script on the table when he clearly saw the contents of the script and was astonished for a moment.</p><br/><p>Scene 37: Loss Of A Son On A Rainy Night.</p><br/><p>This chapter had clearly been read through many times. The sides of the script had even started to show rough edges and were dog-eared.</p><br/><p>\"Mmm... Lu Tingxiao...?\"</p><br/><p>\"Hmm?\"</p><br/><p>\"Why are you here so late?\"</p><br/><p>Lu Tingxiao did not answer. He bent down and picked the girl up from the sofa. He walked towards the bedroom. \"Why don't you go sleep in your room?\"</p><br/><p>Obviously, it was because he was worried about her.</p><br/><p>Lu Jingli had already told him about the situation at her audition that day. It did not seem to have gone too well.</p><br/><p>\"I accidentally fell asleep...\" Ning Xi rubbed her eyes in a daze.</p><br/><p>Lu Tingxiao put the girl onto the bed. The girl had very knowingly rolled over to sleep on the other side, leaving space on half of the bed.</p><br/><p>Lu Tingxiao caressed the girl's hair and lay down beside her. \"Today's audition didn't go too well?\"</p><br/><p>Ning Xi sighed, \"Actually, it was okay. There were just too many great candidates... but it's okay. Before I went, I knew that the competition this time would definitely be tight. If I don't make it this time, I'll just work harder next time!\"</p><br/><p>The girl's tone sounded very relaxed as if she did not mind. Had she not held onto the script in her sleep and continued to read that scene after she came home, he might have really believed it...</p><br/><p>Lu Tingxiao looked at the girl hesitatingly but he still said at last, \"Mmm, next time, you'll still have opportunities.\"</p><br/><p>Actually, right from the start when he knew that she had chosen this film, he was already worried. Now, it looked like his worries had come true.</p><br/><p>The girl he loved the most... All of her pain... Had unexpectedly been brought upon by him...</p><br/>\n</div>"}