{"title": "Chapter 1607: Unpredictable Outcome", "id": 1607, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1607-unpredictable-outcome", "volume_title": "Volume 17", "body": "<h1>Chapter 1607: Unpredictable Outcome</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1607: Unpredictable Outcome</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>As she looked at Lu Tingxiao's expression, Ning Xi laughed softly. She could not help but reach out to touch his cheeks. \"Hey, it's just a movie. You don't have to look like you're sadder than I am! It's really fine. I'm not that weak that I can't accept this little failure!\"</p><br/><p>As he studied the girl, who was obviously hiding her hurt and sadness, comfort him, Lu Tingxiao felt as if a knife was twisted in his heart. He squeezed the girl tightly in his arms, wanting to console her, yet he did not dare touch that past.</p><br/><p>Ning Xi saw Lu Tingxiao's expression and knew that she could not hide it from him. She sighed, \"Okay, I was actually... a little affected by what happened back then... After all, that child... had been in me for almost eight months...\"</p><br/><p>No matter what the final truth was, she had thought that the child was from her and her most loved person. From the start to the end, she had carried a deep longing and anticipation for the arrival of a new life. In the days when Su Yan had lost contact with her, only this child had accompanied her. She spoke, sang, and told stories to it, throwing in all of her beautiful emotions and a mother's love...</p><br/><p>However, when she woke up from her sleep, everything had been turned upside down. That pulsing little life inside of her, who was tied to her by blood, had disappeared just like that...</p><br/><p>When she was brought to the morgue and saw her little baby's purple and cold body...</p><br/><p>That was an image that she never wanted to recall ever again in this lifetime.</p><br/><p>While this film only had 37 scenes, if she completely immersed herself in the character, she could definitely use that scene from back then.</p><br/><p>However, she did not dare to get too immersed in the story.</p><br/><p>That was a reflexive function of self-protection, causing her to uncontrollably suppress her acting skills.</p><br/><p>Lu Tingxiao kissed the girl's forehead. He stopped her from continuing, \"If you don't like it, then don't act in that role. I'll keep an eye out for a better script for you.\"</p><br/><p>Ning Xi, if I told you that the child didn't die... If I told you that the child's father was me... If I told you, that that person whom you hate to the bones was me... That person who is the source of all your pain was me...</p><br/><p>As much as Lu Tingxiao could plan what to say, he was unable to predict what he would face when Ning Xi found out about all of this...</p><br/><p>...</p><br/><p>At the Su residence.</p><br/><p>The topic of the real and the fake heiress had not completely gone away. These days, Ning Xueluo had been staying at home to curry favor with Su Hongguang and Zheng Minjun.</p><br/><p>\"What did you say? That Hollywood role fell into Ning Xi's hands?\" Ning Xueluo answered a call at the balcony, her face instantly filled with malevolence.</p><br/><p>\"Yes, I heard the contract has been signed and that she'll be joining the crew tomorrow.\" From the other end of the phone came Chang Li's voice.</p><br/><p>\"That slut...\" When Ning Xueluo thought about how much energy she had spent on getting the role, yet it had been easily snatched away by Ning Xi, her heart was filled with resentment.</p><br/><p>If it were not for that slut, the Golden Film Awards movie queen, and Hollywood blockbuster contract... All of these halos should have been hers!</p><br/><p>\"What about that? It's just some cameos that I left and didn't want! It's only a three-minute scene in the entire thing with two lines of dialogue! What's she got to be happy about?!\" Ning Xueluo said in disdain. Now, she would not mention how when she had first gotten the role, she had gone around bragging to everyone about how she was going to make her way into Hollywood.</p><br/><p>\"She can only play with what you left behind. I heard that recently she went to audition for Director Jiang's new movie. Her performance was a mess, so she's definitely eliminated! Later on, I'll get someone to create talk about it. It's guaranteed to humiliate her big time!\" Chang Li went to a great extent to say things that made Ning Xueluo thrilled.</p><br/>\n</div>"}