{"title": "Chapter 1605: Liking You More and More", "id": 1605, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1605-liking-you-more-and-more", "volume_title": "Volume 17", "body": "<h1>Chapter 1605: Liking You More and More</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1605: Liking You More and More</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ning Xi obviously did not want to say much. Plus, based on Song Lin's EQ, she naturally would not continue questioning her.</p><br/><p>Only, she more or less felt that it was a pity.</p><br/><p>She was very clear about the value of the film and the possibility of it catapulting Ning Xi to a higher level. If she missed out on this chance, waiting for the next film of such a quality would probably take quite a few years or more.</p><br/><p>\"Xiao Xi, do you have a boyfriend?\"</p><br/><p>Song Lin suddenly changed the topic, surprising Ning Xi so much that she choked on her drink. \"Cough, cough, cough...\"</p><br/><p>\"Are you okay?\" Song Lin quickly patted her back.</p><br/><p>\"I'm okay, I'm okay...\" Ning Xi's breath eased.</p><br/><p>\"Why? Is this question harder to answer than the previous one?\" Song Lin laughed lightly.</p><br/><p>Ning Xi quickly said, \"No, no boyfriend!\"</p><br/><p>Sigh, even though her goddess was sitting opposite her, she really could not tell the truth to this question.</p><br/><p>\"Really?\" Song Lin swirled the drink in her glass. \"Well... What about a girlfriend?\"</p><br/><p>\"Pfft—\" Ning Xi choked again.</p><br/><p>Song Lin was amused and she started laughing uncontrollably at the girl's innocent reaction. \"Xiao Xi, you're so cute!\"</p><br/><p>Ning Xi looked miserable. She could not tell that the goddess still had this private side of her that liked to make jokes!</p><br/><p>Song Lin seemed intoxicated. Her eyes sparkled as she looked at the girl in front of her. \"I really... am liking you more and more!\"</p><br/><p>Ning Xi was humbled by this affection. \"I really like you too, Sis Lin!\"</p><br/><p>Song Lin smiled and did not say anything.</p><br/><p>This girl was definitely not innocent. Otherwise, she would have been gobbled up in this industry with nothing left. The remarkable thing was that in front of people she liked and admired, she still managed to retain her pure and honest side.</p><br/><p>She liked everything that was real and honest.</p><br/><p>It made her want to collect them for herself...</p><br/><p>...</p><br/><p>After she bade Song Lin goodbye, Ning Xi immediately returned Ling Zhizhi's call.</p><br/><p>However, before she left, Song Lin had told her not to give up so quickly and that there still might be hope. She was actually certain that based on Jiang Xingzhou's demanding nature, no matter what the reason was, her performance today would definitely have not passed his test.</p><br/><p>\"Sis Zhizhi, the audition ended... very miserably. I picked the one scene that I was the least confident with... I'm a little worried...\"</p><br/><p>When Ling Zhizhi heard this, she consoled her, \"It's okay, as long as you did your best. Just wait for their crew to inform us first. If we didn't make it, then we'll just use that back up one. There aren't many scenes. If all goes well, then you'll finish shooting in a few days, so it's just nice for you to go shoot this one first. Because the other one is quite urgent this time, and it's a small role, there's no need to audition. You can just immediately join the team the day after tomorrow.\"</p><br/><p>Even though Ling Zhizhi put it like that, anyone knew that even if it was just a few seconds of screentime, to be able to appear in a Hollywood blockbuster was every Chinese artiste's dream. Even those few seconds could be their first step to entering Hollywood.</p><br/><p>Many of those who had long been famous and were A-listers did not even have any business with Hollywood. Although Ling Zhizhi made the role sound relaxed, she knew that clinching it was definitely not easy.</p><br/><p>Ning Xi was a little shocked when she heard Ling Zhizhi. \"A Hollywood blockbuster? Could it be... Thunderbolt Secret Service Squad? The one that Ning Xueluo had been previously signed on?\"</p><br/><p>\"That's right. They were initially in talks with Ning Xueluo, but after Ning Xueluo quit the entertainment industry, this role has been vacant. Even though there was the impartial element of changing someone at the last minute, the vacant role still has quite strong competition. A huge reason why you've been chosen was that your role in 'The World' received a great response when it was aired in America. There were more fighting and Chinese martial arts scenes, which perks the interest of those foreigners. After the director saw the trailer, they were very pleased...\"</p><br/>\n</div>"}