{"title": "Chapter 1610: Add Scenes", "id": 1610, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1610-add-scenes", "volume_title": "Volume 17", "body": "<h1>Chapter 1610: Add Scenes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1610: Add Scenes</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Not long after that, the other lead actors walked over too, greeting Ning Xi in order.</p><br/><p>Colin was America's earliest generation of pretty boys, equivalent to the teenage male idols that were becoming popular in China now. However, Colin was already over 40 years old. He had hustled in the industry for many years and his entire body was filled with a mature man's charm. He was true to his name, a Prince Charming to all his fans around the world.</p><br/><p>Benny was a hunk. He held Hollywood's classic bald man of steel image whilst Jennifer was a knockout beauty with a hot body and a head of wavy blonde hair. She was the entire movie's only female lead.</p><br/><p>\"Orlando. Very happy to meet you, my little belle!\" The one who spoke was Orlando, who was nicknamed as \"The Elf\" by Chinese fans. He had blonde hair and blue eyes. With just one look, you would know he was a handsome man of many romantic endeavors. No matter if it was a matter of truth or if he was just in character, the gaze he used to size Ning Xi up was one of interest, but he did not make it too explicit.</p><br/><p>Fans who were familiar with Orlando would know that he especially liked Eastern woman. Quite a few of his ex-girlfriends had been Chinese.</p><br/><p>\"Me too. You're very popular among the girls in China!\"</p><br/><p>\"Huh, really?\"</p><br/><p>...</p><br/><p>Because Ning Xi had previously studied abroad in Los Angeles, her English was pretty fluent and she did not have any problems interacting with everyone. After a short small conversation, Ning Xi left to put on makeup and change into her outfit.</p><br/><p>For convenience, Ning Xi had gone over in a simple white t-shirt and jeans.</p><br/><p>She only had one outfit in the movie. It was a qipao that could best reflect the Chinese culture.</p><br/><p>Ning Xi changed inside the dressing room, while the flurry outside was going in full swing, preparing for the next scene's setting.</p><br/><p>Because the director was busy going through lines with the few leads, he had casually told a crew member to get Ning Xi to prepare herself first after she was done with the makeup.</p><br/><p>After Ning Xi finished changing, she walked straight into the hut where they would be shooting later on.</p><br/><p>Later on, the few leads would be acting to visit her master and she was responsible for receiving them.</p><br/><p>Ning Xi waited in boredom in the hut for a while before someone finally shouted that they were ready to begin from the outside.</p><br/><p>\"Action!\"</p><br/><p>Outside an old hut with an interesting aura to it, Colin, Orlando, Benny, and Jennifer exchanged a look, then they were on high alert as they moved closer to the hut.</p><br/><p>Creak...</p><br/><p>With the raspy sound of the hut door being pushed open by fair and slim fingers, a Chinese woman who wore a dark-colored cloud print qipao had appeared before the audience's sight.</p><br/><p>The woman was like an entirely different person than the one who had worn the t-shirt and jeans earlier. Her glamorous qipao outlined her perfect physique. The classic makeup was done just right and it complemented her entire person like she was a classic beauty who had walked out of an art scroll. Her fine black hair was casually held together with a wooden hairpin on her crown and her features were far from dull. Her lips were delicate. With this ink painting-like scenery, it composed a dreamy scroll of art...</p><br/><p>As the wind from the mountains brushed the girl's hair by her temples, it was as if Ning Xi's features were covered in frost. Her eyes were cold as she skimmed the uninvited guests at the door. \"Who hath cometh?\"</p><br/><p>As he looked at this girl full of Eastern charm before him, Orlando's expression was blank. His face had changed from the indifference of earlier's small talk to a warm one. The other three lead actors' eyes had also had amazement flashing in them.</p><br/><p>The director did not seem to expect Ning Xi to achieve such a huge effect upon changing into her outfit, so he forgave his leads for their collective bad take.</p><br/><p>The shoot began once again. Ning Xi opened the door to receive the four people, then she served them tea and invited them to wait for her master's return.</p><br/>\n</div>"}