{"title": "Chapter 1613: It’ll Surely Be Wonderful", "id": 1613, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1613-it%E2%80%99ll-surely-be-wonderful", "volume_title": "Volume 17", "body": "<h1>Chapter 1613: It’ll Surely Be Wonderful</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1613: It’ll Surely Be Wonderful</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After they wrapped up, Director Martin looked for the scriptwriter. \"Charles, please come to my room after you're done here! Bring the script!\"</p><br/><p>Charles, who was smoking at the moment, looked like he expected this and he flashed an OK sign.</p><br/><p>…</p><br/><p>In the hotel room, Martin was pacing back and forth. The second Charles entered, he went straight to the point. \"Buddy, I want to add some scenes for Xi. What do you think?\"</p><br/><p>Charles gave Martin a high five and spoke in Mandarin to him, \"Great minds think alike.\"</p><br/><p>Martin shared his idea excitedly, \"One action scene is too little! Xi moves really well and adds to the effect…\"</p><br/><p>Charles gave it some thought, then he interrupted, \"But... Buddy, remember that if you add too many scenes, something's gotta give and you'll have to cut some others out!\"</p><br/><p>Movies had very strict restrictions in terms of timing; just one scene could cost a lot of money and any extra seconds were precious.</p><br/><p>Martin was struggling because of this issue too, but he looked determined. \"Charles, don't you think the marvelous nature here would pair better with Xi's strong classic Oriental vibe rather than some chilly special effects? I know that it's risky, but I believe in my judgment!\"</p><br/><p>Charles shrugged. \"Okay, if you insist but actually, I think so too! Alright, let's talk about the new scenes. How long do you want them to be?\"</p><br/><p>\"Ten minutes! No... 15 minutes!\" Martin exclaimed in excitement.</p><br/><p>Appearing for 15 minutes in a movie that was full of special effects added up to almost as much screen time as the female secondary lead! Even one of the main casts, Tony, only had just above ten minutes of screen time.</p><br/><p>Charles then replied, \"If that's the case, I suggest we add another romantic element between her and Orlando…\"</p><br/><p>Before Charles could finish his sentence... Bang! A large-sized man charged in like a typhoon and hugged Charles. \"Oh baby, I love you! You're my angel!\"</p><br/><p>Charles pushed him away helplessly. \"Orlando, don't thank me. I think Martin thought about it too. If not, he wouldn't have retained the scene where you made a mistake just now…\"</p><br/><p>Orlando was about to go and bear hug Martin but the man avoided him and looked gravely at him. \"Orlando, I know that she's your type…\"</p><br/><p>Orlando interrupted him with a serious expression. \"Oh no! My dear, she's not just my type! She's my queen!\"</p><br/><p>Martin was speechless for a few seconds before he reminded, \"I have to warn you again. You know me. No relationships between members of a film crew. Avoid any scandal! You'd better be careful!\"</p><br/><p>Orlando declared, \"I swear to God! I'll only go for her after we're done filming!\"</p><br/><p>While Martin knew that Orlando was a flirt, he was relieved that Orlando still maintained that level of professionalism within him after all.</p><br/><p>Since the director was not angry anymore, he nudged the scriptwriter who was more easygoing, grinning suggestively, \"Hey, dear Charles, what do you think about adding a sex scene? It'll surely be wonderful!\"</p><br/>\n</div>"}