{"title": "Chapter 1627: Not Bother Her", "id": 1627, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1627-not-bother-her", "volume_title": "Volume 17", "body": "<h1>Chapter 1627: Not Bother Her</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1627: Not Bother Her</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>After Ning Xi made sure Ning Tianxin was alright, she left her a note and went off.</p><br/><p>By a big tree near the apartment, Mo Lingtian lit up a cigarette. He hid under the shadow of the tree, staring at the window of Ning Tianxin's unit. Suddenly, the door opened from the inside.</p><br/><p>Mo Lingtian freaked out and quickly extinguished his cigarette as he hid behind the tree. He tried to suppress his breathing.</p><br/><p>Ning Xi seemed like she was in a rush and was not really paying attention to her surroundings. She got into her car and left.</p><br/><p>Mo Lingtian only came out from behind the tree after the sound of the engine rumbled far away. It was just a short while but his back was already covered with sweat.</p><br/><p>After Ning Xi left, Mo Lingtian stood there for a long while. It was quiet inside the apartment and there was no sound at all.</p><br/><p>She had not looked too well earlier. Was she sick?</p><br/><p>Then again, since Ning Xi left, she should be fine, shouldn't she?</p><br/><p>Mo Lingtian was extremely anxious. No matter if it was money or any other method, as long as it was able to make it up to her and calm him down, he would do anything. He did not want to become a person he himself did not recognize anymore. </p><br/><p>Unfortunately, the only thing he could do now was to not bother her.</p><br/><p>…</p><br/><p>At the Glory World Entertainment office.</p><br/><p>\"Sis Zhizhi, what did Director Jiang say? Has the role been finalized?\" Ning Xi asked directly the moment she reached the office. She was panting while asking, obviously having rushed over.</p><br/><p>\"Sit down first.\" Ling Zhizhi got her a glass of water.</p><br/><p>After Ning Xi recovered, Ling Zhizhi tried to find the words to tell her, \"The results were actually out several days ago. I didn't tell you about it to avoid disturbing your recovery.\"</p><br/><p>Ning Xi's heart sank when she heard that. \"So, what's the result?\"</p><br/><p>\"You didn't pass the audition. The female lead is Jiang Xinyi,\" Ling Zhizhi revealed.</p><br/><p>Ning Xi's expression looked down. As expected, she had not passed.</p><br/><p>Jiang Xinyi, one of the iconic artistes from the Capability Camp, had received a nomination for the Best Female Lead Award at the Berlin Film Festival before. She was 30 this year, married, and had a pair of cute twins with her husband. She was especially talented at acting tragic scenes, so she was suitable for the movie \"Mother\" in each and every aspect.</p><br/><p>Ning Xi thought Ling Zhizhi wanted to talk to her about other scripts, but Ling Zhizhi gave her a surprise instead. \"From what I know, it was supposed to be Jiang Xinyi, but afterward she was called to try out several scenes. Director Jiang wasn't really happy with it. I heard the news that there might be a second audition.\"</p><br/><p>\"A second audition?!\"</p><br/><p>This turn of events was making Ning Xi anxious.</p><br/><p>\"Yes, I heard about it from some internal connections that I know. It's a reliable source. If nothing goes wrong, they'll be arranging the second audition in these coming few days.\"</p><br/><p>\"What about the people shortlisted for the second audition?\" Ning Xi asked.</p><br/><p>\"There are five people and you're one of them,\" Ling Zhizhi replied as she observed Ning Xi's expression. \"Think about it if you want to go for the second audition. Whatever it is, I'll respect your decision.\"</p><br/><p>Obviously, Ling Zhizhi noticed Ning Xi was behaving quite oddly this time.</p><br/><p>While she was hoping to get it, she would still respect Ning Xi's wishes. If there was some issue with her, it would not reach her expectations even if Ning Xi somehow managed to get this role.</p><br/><p>As Ning Xi was hesitating to answer, Ling Zhizhi's phone rang.</p><br/>\n</div>"}