{"title": "Chapter 1621: I Want A Kiss and A Hug", "id": 1621, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1621-i-want-a-kiss-and-a-hug", "volume_title": "Volume 17", "body": "<h1>Chapter 1621: I Want A Kiss and A Hug</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1621: I Want A Kiss and A Hug</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the end, he did not think that once he got down from the plane that he would receive such news that frightened him stiff.</p><br/><p>\"Thank you, Boss! The doctor just checked me. It's just a bruise. It's nothing too serious!\" Oh! I am in so much pain! I want a kiss and a hug!</p><br/><p>Even though Ning Xi was calling him \"Boss\", her gaze already completely betrayed her coquettish ways. Lu Tingxiao almost could not hold back and was about to lose control.</p><br/><p>Orlando's Mandarin was not too shabby. When he listened to their conversation, he realized that this man who had suddenly appeared was unexpectedly Ning Xi's boss.</p><br/><p>Orlando looked solemn as he turned towards Lu Tingxiao. He instantly bent over and made a 90-degree bow towards him. \"It turns out you're Xi's boss! I always hear Xi mention you. She says you're someone she admires very much! This was my fault from the start to the end. It was I who didn't safeguard the gun properly, which led to the gun getting replaced by someone. It was I who caused Xi to suffer such dreadful harm... Please don't worry. I'll definitely take responsibility for this!\"</p><br/><p>Based on just the way Orlando looked at Ning Xi, Lu Tingxiao knew that this person was the Casanova that he had heard through the phone last night. There was a layer of dense frost across his face. \"Responsibility?\"</p><br/><p>Orlando shyly took a peek at Ning Xi, then he continued in Mandarin, \"I've decided that I want to marry Xi!\"</p><br/><p>While his Mandarin was clearly not the best, he did not differentiate between \"to marry\" and \"to take a wife\", but he seemed to have noticed that after he finished, so he corrected himself, \"I want to take Xi as my wife! The point is that I'll get married to Xi!\"</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>Ning Xi had no words too. Brother, what hatred and resentment is there between us? Was it not enough for you to hit me with the gun? I'm already like this, yet you still don't want to let me go?</p><br/><p>Even Martin could not bear to watch it any longer. \"Orlando, shut up!\"</p><br/><p>He had almost killed her, yet now he wanted to take her as his wife. What logic was this?</p><br/><p>In fact, he was not sure whether he was having illusions. He kept feeling like Lu Tingxiao's appearance was rather odd. It could not be as coincidental as purely finding out about this when passing by, so he was worried that idiotic Orlando would say the wrong things.</p><br/><p>Unfortunately, Orlando did not heed anyone's advice. He looked emotionally towards Lu Tingxiao and continued, \"Mister, you must believe my sincerity towards Xi and be the witness to my promise today! None of my words are untrue! Ever since the day I first met Xi, I had fallen for her. It didn't matter if it was the way she beat me up or her expression as she looked at me coldly... All of it made me believe without a doubt that she's the one I've been looking for! I ask of you to hand Xiao Xi over to me!\"</p><br/><p>Ning Xi was speechless. I just barely escaped death. Am I going to be angered to death by this dude now?</p><br/><p>She already... dared not look at Lu Tingxiao's expression at all...</p><br/><p>In the air was an odd silence.</p><br/><p>Orlando stubbornly continued to watch Lu Tingxiao attentively.</p><br/><p>Lu Tingxiao replied, \"You can't.\"</p><br/><p>\"Why?!\" Orlando instantly frowned. \"I'm sincere towards Xi. In fact, for the sake of her career, I can keep our relationship a secret...\"</p><br/><p>Lu Tingxiao's gaze skimmed Martin and the rest. \"I'd like to trouble everyone to leave for a moment. I have some things to say to this mister in private.\"</p><br/><p>Martin already had a barrage of questions, yet in the end, he had been interrupted by Orlando and did not get the chance to ask. As he watched the way things progressed, he could only helplessly walk out with the rest first.</p><br/><p>\"Why not?\" After everyone had left, Orlando continued to ask without wanting to listen to any excuse.</p><br/><p>Lu Tingxiao looked at the girl on the sick bed, his long fingers caressing her chin. In the next second, he leaned over and covered the girl's lips with a loving French kiss.</p><br/><p>\"Because she's mine.\"</p><br/>\n</div>"}