{"title": "Chapter 1624: She's Not That Kind of Person", "id": 1624, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1624-shes-not-that-kind-of-person", "volume_title": "Volume 17", "body": "<h1>Chapter 1624: She's Not That Kind of Person</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1624: She's Not That Kind of Person</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Opposite them, Mo Lingtian was also confounded when he saw Ning Xi and Ning Tianxin. Especially when he looked at Ning Tianxin that he bumped into directly, he stood there stunned without any response for a long time.</p><br/><p>Ning Tianxin's gaze slowly swept past Mo Lingtian and the woman beside him, her expression only frightened ever so slightly. There was no reaction to be seen on her face.</p><br/><p>Earlier, when Ning Xi was chatting with Ning Tianxin, she intentionally did not mention Mo Lingtian at all because she was worried that Ning Tianxin would recall the past, yet who would have thought that right as they were leaving, they would bump into them directly. Forget bumping into them; it had to be Guan Ziyao beside Mo Lingtian of all people!</p><br/><p>Ning Xi thought this was f*cking incredulous. She resisted the violent urge to walk away at the sight of Mo Lingtian. Her expression was cold as she pulled Ning Tianxin past the two people to leave quickly without a word.</p><br/><p>Behind them, until Ning Xi and Ning Tianxin had already left, Mo Lingtian was still frozen in his earlier position.</p><br/><p>\"Lingtian... Lingtian...\"</p><br/><p>Until Guan Ziyao's voice was heard, Mo Lingtian came back to his senses. \"What?\"</p><br/><p>\"Are you okay?\" Guan Ziyao asked she looked behind her towards the two people who had walked far away. \"Earlier, the one beside Ning Xi... Was that she... That woman? The one who previously threatened you with a child?\"</p><br/><p>\"Shut up!\" Mo Lingtian suddenly said. In fact, his voice was unusually cold and his face was covered with frost.</p><br/><p>Guan Ziyao had never seen Mo Lingtian act this coldly towards her, so she was instantly dumbfounded.</p><br/><p>When he noticed Guan Ziyao's hurt expression, Mo Lingtian pinched the space between his brows and softened his voice as he started to explain, \"Ziyao, I've told you that she's not that kind of person. It's my fault. Don't say things like that ever again.\"</p><br/><p>Guan Ziyao frowned, but in the end she did not try to defend herself. She only revealed a slightly hurt expression and mumbled, \"Sorry, I got it.\"</p><br/><p>...</p><br/><p>In the car, Ning Xi drove as she carefully observed Ning Tianxin's reaction through the rearview mirror.</p><br/><p>\"How unlucky that we had to coincidentally bump into that trash!\" Ning Xi could not help but mutter, looking very upset.</p><br/><p>What made her even angrier was as she pondered the reason Sis Tianxin had to be hurt so badly while that trash was all ruddy with a beauty by his side like he was a free man.</p><br/><p>She was saying that at the start, he had been boisterous about wanting to see Sis Tianxin every day but after that, they heard no more from him. It turned out that he had settled on his true love!</p><br/><p>Bloody hell! Where was her knife!?</p><br/><p>She should not have held back earlier...</p><br/><p>\"He's living pretty happy and freely despite having hurt you so badly...\"</p><br/><p>As Ning Xi was indignantly muttering, she noticed that on the front passenger seat, Ning Tianxin had shut her eyes and seemed to be asleep. Cold sweat had broken out on her forehead.</p><br/><p>Ning Xi quickly sped up. It looked like Ning Tianxin's condition was quite severe. It was best to go straight to the hospital for a check-up.</p><br/><p>As she was about to switch lanes, beside her came Ning Tianxin's weak voice, \"I don't want to go to the hospital... Xiao Xi, send me... Send me home, okay?\"</p><br/><p>Ning Xi was hesitant.</p><br/><p>\"I have meds at home... I'll be fine after I rest for a while...\"</p><br/><p>Since Ning Tianxin was against going to the hospital, Ning Xi had no choice. In the end, she still sent her home. \"Okay, we won't go to the hospital. I'll send you home. Rest at ease in the car for a while!\"</p><br/><p>...</p><br/><p>In the restaurant, there was the melodious sound of a violin by his ears. The air was filled with a strong fragrance of flowers.</p><br/><p>Opposite him, Guan Ziyao was wearing Chanel's latest couture gown in white. It lined and hugged her slim waist, her skin smooth as butter and her bosom prominently on display. She was oozing with nobility and pride from top to bottom. She sat there silently, yet she was akin to a shining being, stealing everyone's attention.</p><br/>\n</div>"}