{"title": "Chapter 1622: So Cool It Gave Her Butterflies", "id": 1622, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1622-so-cool-it-gave-her-butterflies", "volume_title": "Volume 17", "body": "<h1>Chapter 1622: So Cool It Gave Her Butterflies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1622: So Cool It Gave Her Butterflies</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Orlando stood there, flabbergasted. He looked as if he had been struck to ashes by lightning.</p><br/><p>With his messy hair, his mouth opened then closed as if he wanted to say something, yet he had no words for a long time. Some time passed when finally an awkward Chinese proverb had jumped out from his mouth, \"You... You, you you... You embezzled!\"</p><br/><p>Ning Xi was speechless. If your Mandarin isn't great, just stop trying hard to show off, okay?</p><br/><p>Speaking of which, she really had to lament, her darling's cruel romance-destroying skills were getting better and better! It was so cool that it gave her butterflies!</p><br/><p>Ning Xi cleared her throat and corrected his words, \"It should be a harmonious couple. Senior, I've told you previously that I already have someone I love already.\"</p><br/><p>Orlando stared lifelessly at Lu Tingxiao. It seemed like his outlook on life had been overturned in a huge way. \"This is impossible! How could there be girls who like someone as cold as you?! I'm more handsome, more charming, more sweet-talking, cuter, more passionate than him... Xi, are you being coerced by him? Because he's your boss?\"</p><br/><p>Ning Xi replied, \"It was I who confessed to him and asked him to date me.\"</p><br/><p>When he heard the girl's protective words, Lu Tingxiao's expression was incredibly gentle.</p><br/><p>Orlando was on the verge of collapsing as he held his bruised heart, yet he still did not give up. He suddenly remembered something and emotionally said, \"He... I heard he has a son! He even has a son! He isn't pure anymore!\"</p><br/><p>Isn't pure...</p><br/><p>Ning Xi was even more inarticulate when she heard this. He spoke as if he himself was very pure. This coming from someone who had so many girlfriends before...</p><br/><p>\"Senior, people who love each other won't care about these things.\"</p><br/><p>\"How could this be...?\" Orlando had a gloomy cloud above him as he squatted in the corner in disbelief. \"This can't be true... I don't believe it... I won't give up...\"</p><br/><p>Finally, all of the crew members including Orlando were invited over to cooperate in the investigation with someone assigned by Cheng Feng.</p><br/><p>Instantly, the ward was only left with Lu Tingxiao and Ning Xi.</p><br/><p>Ning Xi started to soothe him, \"Lu Tingxiao, I'm really okay... One second before Orlando pulled the trigger, I noticed that the gun looked real in time, so I evaded my vital parts... The bullet only grazed me. It looks frightening, but it's just an external bruise and it'll heal very soon...\"</p><br/><p>Lu Tingxiao remained silent, his expression unhappy.</p><br/><p>What if she had not evaded it? That shot would have hit her right in the heart!</p><br/><p>He did not even dare think about the possibility.</p><br/><p>\"It looks like someone wants to kill me...\"</p><br/><p>However, there were too many suspects and she had no clue at the moment...</p><br/><p>Ning Xi frowned as she recalled Orlando's performance from the start to end. \"In this period of time, based on my interaction and understanding of Orlando, he should indeed be oblivious. Also, that gun had always been with me and shouldn't have passed through anyone else's hands. It's weird...\"</p><br/><p>\"Don't think about it. Rest well, leave all of this to me.\"</p><br/><p>\"Oh.\" Ning Xi was obedient.</p><br/><p>\"Let's get you home.\" Lu Tingxiao immediately lifted the girl by her waist. Even though his tone was harsh, his movements were incredibly gentle.</p><br/><p>When Ning Xi heard him, she immediately said, \"Huh? But this was my last scene. What do we do?\"</p><br/><p>She had almost lost her life, yet she still thought of her work?</p><br/><p>Lu Tingxiao's face remained cool. \"With special effects.\"</p><br/><p>As she looked at Lu Tingxiao's frigid expression, Ning Xi immediately did not dare to ask more. She thought about it. Up till the end, she was still in the scene. The shot where the bullet hit her heart and her falling off the cliff would be enhanced by special effects, so it set her mind at rest...</p><br/>\n</div>"}