{"title": "Chapter 1631: Don't Torment Us Anymore", "id": 1631, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1631-dont-torment-us-anymore", "volume_title": "Volume 17", "body": "<h1>Chapter 1631: Don't Torment Us Anymore</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1631: Don't Torment Us Anymore</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Many excellent actors had gone through this in the past. Because they were too immersed into the act, they could not snap out of it for a long time even after the filming was done, and had even suffered from depression.</p><br/><p>\"Ning Xi, don't be stunned anymore. Congratulations! Welcome to the team!\" Song Lin spoke with a brisk tone as she tried to help Ning Xi snap out of it.</p><br/><p>Ning Xi's gaze finally had some focus. What did this mean?</p><br/><p>Jiang Xingzhou's usually grave and detached face now had some admiration written across it. The way he spoke had also softened quite a fair amount.\"Ning Xi, you've performed very well. You've succeeded this audition. Is your manager here? If possible, we can sign the contract today.\"</p><br/><p>\"She's here, right outside...\" Ning Xi said reflexively. She finally regained consciousness.</p><br/><p>She had succeeded?</p><br/><p>She got the part?</p><br/><p>\"Thank you, Director! Thank you, Sis Lin! Thank you, judges!\" Ning Xi gratefully expressed, then she walked out to report the good news to Ling Zhizhi.</p><br/><p>In the audition room.</p><br/><p>The problem that had been so perplexing was finally solved. Jiang Xingzhou let out a long sigh of relief, his gaze skimming the people beside him. \"Do you now see what I mean by 'not bad'?\"</p><br/><p>The other judges all nodded. They had no differing opinions and all of them started to lament.</p><br/><p>\"Director Jiang, you're ever the professional! I'm convinced!\"</p><br/><p>\"Speaking of which, this girl is quite young, yet she's really remarkable! Even Jiang Xinyi can't achieve that extent! She probably could not perform well at the last minute the last round. Thankfully, there was another audition!\"</p><br/><p>\"The younger generation will surpass us in time!\"</p><br/><p> ...</p><br/><p>\"Sis Zhizhi! I got through!\" Once Ning Xi walked out, she rushed up to Ling Zhizhi.</p><br/><p>Ning Xi had gone in for ten minutes. Although it was not considered very long as compared to Jiang Xinyi, it was enough to make Ling Zhizhi nervous. Now that she saw Ning Xi walk out, despite her usual calm and collected demeanor, there was a hint of pleasant surprise across her face. \"Really? What did the director say?\"</p><br/><p>\"Director said that we can sign the contract today, and asked you to go over!\" Ning Xi said as she suddenly remembered something. She quickly looked at the time on her watch and said, \"Sis Zhizhi, I have to trouble you for the contract. I still have an emergency and I have to leave first!\"</p><br/><p>Now, it was already 8.40 a.m. There was only 20 minutes left to the appointed time.</p><br/><p>\"No worries, go. Leave this to me!\"</p><br/><p>\"Okay, well, Sis Zhizhi I'll make a move first. Call me if there's anything!\"</p><br/><p> ... </p><br/><p>After she exited the audition building, Ning Xi got into the car and rushed towards the police station.</p><br/><p>At the entrance of the police station, Tang Ye, Feng Xiaoxiao, Annie, and another person who seemed like a lawyer were all waiting.</p><br/><p>\"Bro Xi! You're finally here!\" When she saw Ning Xi rush from afar, Annie excitedly went up to greet her, \"I thought that you wouldn't make it! I want to call you, but I was afraid that I'd disturb your audition!\"</p><br/><p>\"I'm sorry. The audition just ended!\"</p><br/><p>\"What're the results? Did it go well?\" Annie asked with concern.</p><br/><p>Ning Xi revealed a broad smile. \"Mmm, it went well!\"</p><br/><p>\"Great! Congratulations, Bro Xi!\" Annie was thrilled for her too.</p><br/><p>At that moment, Tang Ye cleared his throat to disrupt the two of them. \"It's almost time.\"</p><br/><p>Ning Xi turned to Tang Ye, seeming a little helpless. \"So, First Senior Brother, may I ask you what should I say when I go in? Do I just see how he's doing?\"</p><br/><p>Just then, Feng Xiaoxiao went over and hugged Ning Xi to interject, \"Little Junior Sister, please advise him to be kind and not torment us anymore. Tell him to come out quickly please. It's already chaotic outside. Is it that comfortable in there? Has he been indulging in pleasure and forgotten his home and duties?\" </p><br/><p>\"Uhh...\" Ning Xi broke out in a sweat. So, the dude himself did not want to come out?</p><br/><p>She should have guessed it...</p><br/><p>\"Okay... I'll try my best...\"</p><br/>\n</div>"}