{"title": "Chapter 1635: You'll Be Mine From Now On", "id": 1635, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1635-youll-be-mine-from-now-on", "volume_title": "Volume 17", "body": "<h1>Chapter 1635: You'll Be Mine From Now On</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1635: You'll Be Mine From Now On</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"In two hours, redecorate this damned place entirely,\" the man instructed, then with a \"bam\", he shut the door of the master bedroom.</p><br/><p>Annie looked at the door, her expression one of worry and self-blame. \"Bro Xi will be fine, won't she?\"</p><br/><p>After all, it was her who had asked for Bro Xi's help. If something happened to Bro Xi...</p><br/><p>Tang Ye replied, \"It'll be fine. I'll keep watch.\"</p><br/><p>When she heard Tang Ye say that, Annie felt slightly more assured. \"Then, I'll go get busy first. Make sure to tell me if anything happens!\"</p><br/><p>Bro Shen should still care a lot about Bro Xi. He was clearly so worried when he saw that Bro Xi had fainted. Even though he did not care that Bro Xi would be scared and had insisted on bringing her there, he had still particularly ordered her to redecorate the \"haunted mansion\".</p><br/><p>...</p><br/><p>In the master bedroom, on the wide, soft bed, the girl was sleeping soundly.</p><br/><p>The man stood by the bed as he watched her sleep quietly. His expression was fleeting as if he had fallen into some far away memory...</p><br/><p>Back then, when he had first met her, she had been bullied by a group of scum.</p><br/><p>Those people were local notorious rogues. They loved to play with Chinese girls who had no background and no troubles. Almost all of them had blood on their hands and they acted recklessly with the support of a gang behind them. Once you were marked by those people, even if you did not die, you would be destroyed.</p><br/><p>When he had a clearer look at the girl's face, he instantly understood why she had been caught.</p><br/><p>Even though the girl looked like she was in dire straits, she had a beautiful face. Especially with that weak and easily bullied appearance, she further excited the group's sadism.</p><br/><p>He would not be so bored as to care about this kind of thing, so he had continued to stay on the balcony as he watched this one-sided kill indifferently like he was overlooking tiny individuals with no power.</p><br/><p>Yet, he did not expect that the following plot would surprisingly exceed his expectations.</p><br/><p>The instance those people had closed in, the girl whipped out a gun from behind her.</p><br/><p>It was legal to carry guns in America, so it was not odd for her to have one.</p><br/><p>Tsk, clearly she was a rookie and was holding a gun for the first time. Her hand was shaking and her eyes were terrified. It was just a meaningless and ludicrous struggle.</p><br/><p>He understood this kind of people too well. Weak and insignificant, even if they had a butcher's knife in their hands, it would be useless.</p><br/><p>She did not dare to open fire.</p><br/><p>Finally, just as he had expected, it had become a one-sided kill.</p><br/><p>However, it was the girl killing those scums.</p><br/><p>Bam! The bullet had hit the bully who was laughing most furiously and most unbridled right in the middle of the head. It had accurately hit his fatal point, killing him in one shot. </p><br/><p>Bam! There came another fire. Another bully had fallen and the bullet had found the same target.</p><br/><p>The person he had judged to be someone who definitely would not dare to open fire had unexpectedly opened fire twice in a row.</p><br/><p>The girl's body was shaking all over. Her entire body was wet with sweat as if she had been pulled out of water. Her wide eyes were filled with alarm, but the instant she had opened fire, she was terrifyingly calm. Clearly, it was her first time shooting, yet every shot of hers had been fatal...</p><br/><p>If it were just a normal person, even faced with an animal, one might not necessarily dare to open fire, what more a living person?</p><br/><p>She was really such an interesting child...</p><br/><p>Unfortunately, the gunshots had provoked the gang's accomplices, so she would still die tonight.</p><br/><p>...</p><br/><p>In her sleep, Ning Xi had a very, very long dream. She dreamt of all sorts of things upon returning to the Ning family. She dreamt about that accident, dreamt about the child's purple body. She even dreamt about that one time she had almost lost her life in Los Angeles...</p><br/><p>She dreamt about her killing people, dreamt that she had been surrounded by a group of vicious people, a white-haired man appearing out the blue and standing right before her. He said to her, \"I saved you. You'll be mine from now on...\"</p><br/><p>...</p><br/>\n</div>"}