{"title": "Chapter 1649: Can The Boss Do It?", "id": 1649, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1649-can-the-boss-do-it", "volume_title": "Volume 17", "body": "<h1>Chapter 1649: Can The Boss Do It?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1649: Can The Boss Do It?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>If one wanted to prove that Ning Xi had relied on her body and sleeping around to climb up the ladder, they would at least need to prove that Ning Xi had received those opportunities without living up to the reality.</p><br/><p>However, the reality was that every job, every spokesperson commercial, and every movie that Ning Xi had completed since she debuted had been completed exceptionally remarkably.</p><br/><p>Still, the Internet did not stop the ruthlessness. They started to change the topic and accuse Ning Xi of being naturally slutty and liked to hook up with men. They said that even if she had the capability, it could not cover up the fact that her moral compass was out.</p><br/><p>Because Ning Xi had only issued one Weibo statement, and there was no other stronger evidence for a long time, such a discussion very quickly occupied an overwhelming position.</p><br/><p>On the third night of the scandal, the other party had exposed another video.</p><br/><p>This time, the man in the video was one of the important investors of \"Mother\".</p><br/><p>Those who had initially attacked Ning Xi without letting go had instantly acted like a starving wolf that had just seen fresh meat. They started to use that scandal to kick up a wild fuss. They selectively neglected the fact that despite being an investor in Director Jiang's film, they would have no right to interfere with the casting.</p><br/><p>After all, those who enjoyed a ruckus would only want to fan the flames as they only chose to see the most direct and superficial things.</p><br/><p>However, the shift in this matter had also stemmed from this video.</p><br/><p>When Xiao Tao saw the latest video, she was fretting all over. \"Bro Xi, are you sure there won't be a problem? It's already been three days, but there isn't any news at all from the Boss's side. Still, the other person's evidence continues rolling out... Can the Boss do it?\"</p><br/><p>Ning Xi was lying on the bed with fresh cucumbers spread out on her face. She meaningfully said, \"My dear, you're brave, aren't you? Actually questioning whether or not the Boss can do it...\"</p><br/><p>Xiao Tao was so afraid that she almost wet her pants. \"Bro Xi! I didn't! I'm just worried about you, yet you still make fun of me! What if the Boss can't settle it?\"</p><br/><p>Not being able to stay in the entertainment industry was secondary. She was afraid that she would've to be burdened with such a scary accusation for the rest of her life. To a woman, her life would be considered entirely destroyed.</p><br/><p>The other person's intentions were simply vicious. They were clearly out to kill her!</p><br/><p>Ning Xi laughed lightly. \"There's no 'what if'.\"</p><br/><p>Almost the instant that Ning Xi said this, her phone rang. It was Lu Tingxiao.</p><br/><p>\"Darling, are you done with work?\"</p><br/><p>When she saw her Bro Xi who was usually wild, cool, and bedazzling turn into a smitten woman in love within just one second, Xiao Tao internally declared that her view on life had turned around by 180 degrees.</p><br/><p>Bro Xi would not be on the phone with the Big Boss now, would she?</p><br/><p>Oh my God! Bro Xi had actually called the Boss her darling! How sweet!</p><br/><p>Because Ning Xi wanted to help the Boss prove his capabilities, she turned on the loudspeaker.</p><br/><p>Indeed, from the other end of the phone came Lu Tingxiao's voice. \"Mmm, miss me?\"</p><br/><p>Xiao Tao was speechless.</p><br/><p>Oh my Lord, she thought that only Bro Xi was the cheesy one!</p><br/><p>\"Of course, I do, but the good thing is that I've been very obedient and focused on filming. The progress is great, and I'll be able to go home in a few more days!\"</p><br/><p>\"Good.\"</p><br/><p>Xiao Tao was speechless as she listened to the way her own Big Boss spoke in a horrifyingly gentle voice. His tone was as if he was coaxing a child.</p><br/><p>No, wait, the focus was on them. They were in such an emergency situation right now. Could they not talk about the important things first before publicly displaying their affection?</p><br/><p>She was really a spectator who was more anxious than the person involved...</p><br/><p>\"Xiao Xi, get ready. Tomorrow night at 8 p.m. we'll have a press conference. I've already sent the concrete agenda to Ling Zhizhi.\"</p><br/><p>Xiao Tao had been silently tortured by the affection for so long. Then, she finally heard the key point and her mind was jolted!</p><br/><p>A press conference tomorrow night at 8 p.m? This meant that... the Boss already had a way to clarify everything!</p><br/>\n</div>"}