{"title": "Chapter 1665: Not Love", "id": 1665, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1665-not-love", "volume_title": "Volume 17", "body": "<h1>Chapter 1665: Not Love</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1665: Not Love</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At the Mo residence.</p><br/><p>Mo Lingtian was sleeping soundly when he was suddenly awoken by the sound of the phone ringing. He was instantly fired up. \"Who is it? Early in the morning... Looking for death?\"</p><br/><p>\"Bloody hell! Mo Lingtian, I'm getting married today! You said you'd be with the bros to pick up the bride. Look at what time it is!\" From the other end of the phone came a man's raging voice.</p><br/><p>Mo Lingtian was stunned for a moment and he murmured in a daze, \"Pick up the bride?\"</p><br/><p>\"Dude! You didn't forget, did you? I don't want to nag you, Mo Lingtian, but what's up with you nowadays? You're always distracted, you don't come for gatherings, you don't join for socials either, now you've even forgotten about something as huge as me getting married!\"</p><br/><p>\"You're so noisy! Why are you foolishly shouting? I'll be there right away!\" Mo Lingtian hung up and irritatedly ruffled his messy hair, then he showered and changed before swiftly rushing downstairs.</p><br/><p>In the living room, Mo Jianzhang and Kang Shuhui were having breakfast.</p><br/><p>Mo Lingtian casually picked up a piece of buttered toast. \"Father, Mother, I won't be having breakfast. I've got an emergency and I've got to leave now!\"</p><br/><p>Kang Shuhui frowned and tried to stop him. \"You should at least have some breakfast. It's so early. Where are you rushing to?\"</p><br/><p>\"Hao Zi is getting married!\" Mo Lingtian casually answered.</p><br/><p>\"Oh, right... the son of the Zhuos is getting married today...\" Kang Shuhui vaguely recalled. She was still mumbling blankly when she came back to her senses moments later. \"Quickly go then, don't be late!\"</p><br/><p>\"Mmm,\" Mo Lingtian answered muffledly before he rushed out of the door.</p><br/><p>He had just reached the door when Mo Lingtian's face sunk.</p><br/><p>Had it been in the past, when he had friends who were getting married or even if they had just gotten a girlfriend, his parents would take turns to nag him for three days straight. They would urge him to get a girlfriend and shove marriage down his throat.</p><br/><p>However, ever since that incident, the two of them had not even once mentioned getting him a girlfriend or urging him to get married...</p><br/><p>Since he turned 20 years old, his ears had never experienced such peace!</p><br/><p>It was so peaceful that he was not used to it...</p><br/><p>The murmurs of a woman faintly flashed across his mind...</p><br/><p>Lingtian, the last thing... I could do for you…</p><br/><p>He knew that he owed her too much, but this self-blame and guilt was not love.</p><br/><p>Mo Lingtian wiped his face as if he was trying very hard to wipe the chaos in his head away. Then, he started his car engine.</p><br/><p>...</p><br/><p>At the Imperial airport.</p><br/><p>Ning Xi was reluctant to part ways as she hugged the girl tightly. \"Sis Tianxin! I hate to part with you!\"</p><br/><p>\"I'll contact you often.\"</p><br/><p>\"Remember to take care of yourself well. If you need anything, you must let me know!\"</p><br/><p>\"Got it!\"</p><br/><p>\"Also, you must remember to continue to take the medicine that Annie prescribed you. Also, the public safety abroad isn't as good as it is here, so you have to be particularly careful. Don't go out alone at night. Also... also...\"</p><br/><p>When she saw that Ning Xi was not stopping nagging her, there was an extremely feeble voice from a certain someone on the side, \"Please, there's still me accompanying her. Do you have to be so worried? I guarantee that I'll properly help Tianxin settle down. Please relax!\"</p><br/><p>Ning Xi hugged Tianxin, then she shot Qin Mufeng a look of warning. \"The thing I'm most worried about is you!\"</p><br/><p>Qin Mufeng looked innocent as he turned to Lu Tingxiao for help.</p><br/><p>Lu Tingxiao held Ning Xi by the shoulders and patted her to console her, \"Okay, be good. It's about time. Mufeng is very familiar with the place abroad, and I've also arranged for the branch assistant to fetch them from the airport, so there won't be a problem.\"</p><br/><p>\"Okay...\" Ning Xi finally let go of Ning Tianxin with a heavy heart. \"Sis Tianxin, goodbye! Little Treasure, come say goodbye to your aunt!\"</p><br/>\n</div>"}