{"title": "Chapter 1678: You Have Me For Everything", "id": 1678, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1678-you-have-me-for-everything", "volume_title": "Volume 17", "body": "<h1>Chapter 1678: You Have Me For Everything</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1678: You Have Me For Everything</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the ward, Yan Ruyi looked at the way Little Treasure relied so much on Ning Xi. She sighed softly, \"Little Treasure, are you feeling ill anywhere else?\"</p><br/><p>The little bun was stuck in Ning Xi's embrace as he shook his head.</p><br/><p>With Mommy around, he would be fine anywhere.</p><br/><p>Ning Xi patted Little Treasure's back and coaxed the little guy to sleep, then she looked to Yan Ruyi and said, \"Madam Lu, I will give you a proper explanation about Little Treasure getting food poisoning.\"</p><br/><p>When Yan Ruyi heard her, she did not know what to say. She was a mother as well. Whether or not a woman was genuine towards a child, she could roughly tell, but there was no knowing what was in a man's heart. This affected Little Treasure's safety, so she dared not be careless at all.</p><br/><p>\"Mommy...\"</p><br/><p>\"What's wrong, baby?\"</p><br/><p>\"Sing me a song.\"</p><br/><p>\"Okay, I'll sing a song for you. What do you want to listen to?\"</p><br/><p>\"Leap Frog.\"</p><br/><p>\"Okay.\"</p><br/><p>...</p><br/><p>When Lu Tingxiao entered, he saw the girl hugging the child and humming a song softly. On the side, Yan Ruyi looked at the two of them with mixed expressions and dilemma clearly written on her face.</p><br/><p>\"Xiao Xi...\"</p><br/><p>\"Shh, softer. Little Treasure's asleep.\" Ning Xi carefully put Little Treasure back onto the bed before getting up.</p><br/><p>When she walked out of the ward, Ning Xi's expression suddenly turned cold. Based on how the Lu family valued Little Treasure, they must have investigated immediately. If the problem did not originate from the Lu residence or at school, then she was afraid that it had really originated from her end...</p><br/><p>Lu Tingxiao took the girl into his arms and hugged her in his embrace. There was a turbulent darkness in his gentle eyes. \"Don't blame yourself. It's not your fault. Rest well, work easy. You have me for everything.\"</p><br/><p>Ning Xi seemed deep in thought as she looked a little absent-minded. Then, she nodded unhappily. \"Mmm.\"</p><br/><p>...</p><br/><p>In a blink of an eye, three days had passed.</p><br/><p>In just three short days, too many things had happened. After Song Lin, the Lu Corporation had three large shareholders switched sides. </p><br/><p>Yun Shen now held a terrifying number of 28 percent of shares. In fact, he made it no secret that he was joining the Lu Corporation's board of directors, roping in a group of shareholders and upper management who were unhappy with Lu Tingxiao's harsh ruling and had originally been dissatisfied with him.</p><br/><p>He had only returned to China in just a few short months, yet he had used a huge sum of money to purchase the Lu Corporation's shares like mad. His actions were like a sharp blade stabbing into the Lu Corporation's heart, causing the entire Lu family and even the whole of Imperial to be anxious, dissapointed, and sorrowful. </p><br/><p>When Lu Chongshan found out that even Chi Chengkai, who had been one of the earliest to fight with him, had also betrayed the Lu Corporation, he was so mad that he fell ill. In front of him, he had pledged his loyalty, but behind his back, he had sold the shares to Yun Shen.</p><br/><p>As they observed the situation turn grim, Yan Ruyi was worried. \"Why would Old Chi suddenly sell off his shares behind our backs? Could it be due to Yingying's elimination at the tea party? But... after that, because something happened to Little Treasure, we cancelled the tea party...\"</p><br/><p>Lu Chongshan gasped for breath, his fingers trembling as he said, \"Ruyi, immediately pay a visit to the Guan family. Remember to visit them more often. Some things that should be put into order should be done so now. Go and pass the message to Guan Rui. Just say it's from me!\"</p><br/><p>Even though there were many candidates among the socialities, the suitable ones were only those few. The Guan family had strong forces within and outside of the company combined. Guan Ziyao was also someone they knew through and through. She had known Tingxiao since they were children, so there was a certain foundation of camaraderie. In addition to that, Lu Chongyuan had always been playing matchmaker from within, and Lu Chongshan had always been most inclined towards the Guan family.</p><br/>\n</div>"}