{"title": "Chapter 1670: Foolish Humans", "id": 1670, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1670-foolish-humans", "volume_title": "Volume 17", "body": "<h1>Chapter 1670: Foolish Humans</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1670: Foolish Humans</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Since Ning Xi had some free time after she was done shooting, she took some time to prepare a lovely and healthy lunchbox for Little Treasure to bring to school. It had been a really tough period for the little bun recently because as a little child, he had to be burdened with the adults' affairs.</p><br/><p>Hopefully, this would all end soon…</p><br/><p>Three days passed. </p><br/><p>With the bustling preparation of the whole Lu family, the long-awaited \"Socialite Tea Party\" began.</p><br/><p>To welcome all the socialites, the whole Lu residence was refurbished. There was an elegant vibe across the classical interior design, and various luxury cars were parked by the entrance. Everyone was dressed to the nines and there were all kinds of girls were present. It was a dazzling sight.</p><br/><p>It was impossible for Lu Jingli to not be there for some juicy gossip on such a big day. Well, he was just there to gawk around anyway…</p><br/><p>At the moment, the grandeur of the scene almost gave him goosebumps.</p><br/><p>Luckily, he had his brother as his shield. If not, this horrible scenario might have happened to him instead.</p><br/><p>\"Jingli, what are you doing here? Go and fetch Little Treasure from school!\"</p><br/><p>\"Understood!\"</p><br/><p>\"Also, don't think you're uninvolved. Look around today and see if there's any girl you like!\"</p><br/><p>\"Mother, what did you say? The wind is too strong I can't hear you—\", Lu Jingli let his voice fade, then he ran away.</p><br/><p>Yan Ruyi glared at his son helplessly.</p><br/><p>Whatever! She had to settle her sons one by one then. Her priority now was to take care of this matter for Tingxiao.</p><br/><p>\"Aunty Lu, why don't I see Little Treasure anywhere?\" A sweet-looking girl came over and asked.</p><br/><p>\"Little Treasure is still in school. Jingli has gone to fetch him already! Please wait for a while, everyone. Let's go and have some tea first!\"</p><br/><p>\"I see, it's alright! Studies are important!\"</p><br/><p>…</p><br/><p>Soon, Little Treasure came back with Lu Jingli.</p><br/><p>While most of the socialites here were not seeing Little Treasure for the first time, they were still charmed by the little guy who shared the same facial features and manner as Lu Tingxiao.</p><br/><p>Even when they knew Lu Tingxiao had a son whose mother was unknown, even if they knew they were going to become a stepmother after marrying him, it was hard for them to not like him when he was such a cute boy.</p><br/><p>\"The prince is so cute!\"</p><br/><p>\"I'd wake up smiling from my dream if I had such a cute son!\"</p><br/><p>\"I heard the prince is actually pretty easygoing…\"</p><br/><p>…</p><br/><p>Lu Jingli mumbled to himself as he realized that the girls were deceived by Little Treasure's innocent appearance, \"Tsk tsk, foolish humans! I'm sure you'll all cry later…\"</p><br/><p>The little bun was very efficient. He took out the deck of materials he had prepared, then he told his grandparents, \"Grandfather, Grandmother, we can start now.\"</p><br/><p>\"You just came back. Don't you want to rest first?\" Lu Chongshan was a little worried.</p><br/><p>\"It's alright, Grandfather. I'm not tired. Let's get on with this quickly.\" The little bun looked serious.</p><br/><p>Lu Chongshan replied happily, \"Alright, we'll go with what you say. Let's start now! Are the rules still like what we've discussed before?\"</p><br/><p>Little Treasure nodded. \"Mmm, I'll give out the questions since they differ for each person. I'll give the questions based on the situation. Those who can answer will stay for the next round.\"</p><br/><p>\"Okay!\" Lu Chongshan asked the butler to inform everyone that they would start now.</p><br/>\n</div>"}