{"title": "Chapter 1679: Just At This Level", "id": 1679, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1679-just-at-this-level", "volume_title": "Volume 17", "body": "<h1>Chapter 1679: Just At This Level</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1679: Just At This Level</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Previously at Mo Jianzhang's birthday banquet, when the Guan family had secretly set Ning Xi up, it had caused them to be estranged. Nevertheless, with all that was said and done, it did not actually affect anything. After all, this incident did not affect his interest. Besides, he was initially unhappy with Ning Xi, so with the current situation, he would naturally make the decision he felt was best.</p><br/><p>He had already been wrong once. He could not, definitely could not watch the Lu family be destroyed in his hands...</p><br/><p>\"Chongshan, do we want to wait for a while more? Didn't Tingxiao already say that he has a plan to settle everything?\" Yan Ruyi thought about it, then hesitated to say.</p><br/><p>\"Settle? It's already been three days. All I see is the Lu Corporation on the brink of crisis! I can't just gamble the Lu Corporation away based on his word! If it were before, I could still trust him, but now he's already been captivated by that woman's charm!\" Lu Chongshan exclaimed as he trembled.</p><br/><p>\"Okay, okay, understood. I'll go then. Don't get all riled up! The doctor already said so many times that you shouldn't get angry!\" Yan Ruyi advised helplessly.</p><br/><p>\"Also, the most important thing is... don't let that woman be alone with Little Treasure!\"</p><br/><p>\"I'm well aware of the situation. Don't you worry!\"</p><br/><p>...</p><br/><p>At the same time, in the suburbs of Beijing.</p><br/><p>Qiao Yi was alone in the dimly lit house. On the table in the middle of the house, the joss stick was lit up and a woman's memorial tablet was placed there.</p><br/><p>The man's eyes were burning as he stared at the picture on the table. There was a bitterness on his face. \"Lan Er, don't you worry... I will avenge you very soon... I will make everyone pay the price...\"</p><br/><p>There were three raps on the door.</p><br/><p>Qiao Yi instantly returned to his indifferent expression. \"Come in.\"</p><br/><p>Feng Jin took big strides as he pushed the door to enter and he quickly reported, \"Uncle Qiao, the discussions are settled with the Liang family too!\"</p><br/><p>There was a shine in Qiao Yi's eyes when he heard that. He nodded with satisfaction. \"Very good.\"</p><br/><p>Money could resolve half of the world's problems. Things that could not be wavered by money would definitely have a gap too because as long as it came to people, there would definitely be information that could be used against them. Humans would no doubt have weaknesses.</p><br/><p>The Lu Corporation seemed to be a huge monster that would be hard to waver, yet the larger the corporation was, the more hidden underground problems there were. When he uncovered them, it would all be rot and filth underneath!</p><br/><p>Feng Jin finished reporting the latest progress, then hesitated to ask, \"Uncle Qiao, all of this... would it be too quick... too smooth sailing?\"</p><br/><p>Qiao Yi looked at him levelly. \"You've just overestimated the Lu Corporation! We've prepared for so many years. It's just at this level and you're already panicking?\"</p><br/><p>\"Uncle Qiao, you're right!\" Feng Jin nodded and agreed.</p><br/><p>Besides, they had carefully considered every segment and there were definitely no slip-ups.</p><br/><p>...</p><br/><p>In the CEO office of the Lu Corporation.</p><br/><p>Lu Tingxiao was discussing something with Lu Jingli when Cheng Feng looked solemn as he rushed in to report, \"Boss, I just got news. The other party privately went to meet Director Liang last night. I'm afraid that Director Liang has also...\"</p><br/><p>Lu Tingxiao had 30 percent of shares in his hand while Yun Shen already had 28 percent. Once he managed to acquire Director Liang's shares, all of the shares he owned would surpass Lu Tingxiao's by leaps and bounds!</p><br/><p>The will of the people were already unsteady at this point. If they continued to let them acquire the Lu Corporation's shares like mad, the consequences would be unthinkable.</p><br/><p>On the side, Lu Jingli stayed silent, his expression unusually solemn.</p><br/><p>Lu Tingxiao said, \"Understood. Go on down.\"</p><br/><p>\"Okay,\" Cheng Feng responded before he left looking worried.</p><br/>\n</div>"}