{"title": "Chapter 1685: Wish That I'm My Mother's Child", "id": 1685, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1685-wish-that-im-my-mothers-child", "volume_title": "Volume 17", "body": "<h1>Chapter 1685: Wish That I'm My Mother's Child</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1685: Wish That I'm My Mother's Child</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The five of them bought joss sticks outside and walked into the hall. They took turns to put up the joss sticks and pray for blessings.</p><br/><p>Ning Xi carefully helped Little Treasure light up his joss stick, then she taught him how to put the joss stick on the altar and kneel to pray.</p><br/><p>Little Treasure arranged the joss stick on the altar, then very properly and extremely sincerely knelt on the praying mat and closed his eyes as he earnestly made a wish.</p><br/><p>As Ning Xi watched the little bun's sincere behavior, her lips curled up as she asked, \"Little Treasure, what did you wish for?\"</p><br/><p>It was rare for the little guy not to answer Ning Xi. He earnestly said, \"I can't say it. If I do, then it won't work!\"</p><br/><p>\"Okay, okay, okay!\" Ning Xi laughed lightly.</p><br/><p>However, she was really curious! What would the little bun's wish be?</p><br/><p>The little bun pursed his lips as he looked up to his mother, then to the Buddha statue again. He silently reiterated the wish in his heart.</p><br/><p>I hope that Mommy can be my mother forever! Grandfather Buddha, forgive my greed. If it is possible to have one more wish, I also wish... How great would it be if I was my mother's child...</p><br/><p>\"Buddha, please bless us. Bless our Lu family in getting through this calamity!\" Yan Ruyi prayed with a fervent expression, then she murmured again as her voice lowered further, \"I hope that Tingxiao can settle down and get married soon...\"</p><br/><p>Ning Xi knelt down too, but she soon got up after that. She did not wish for anything as she believed Lu Tingxiao. There was really nothing to request from the Buddha.</p><br/><p>Lu Chongshan donated a golden Buddha statue, and the monk gratefully pressed both palms together to say, \"Amitabha. Benefactor Lu is truly generous! Thank you for your contribution, Benefactor Lu!\"</p><br/><p>Lu Chongshan put both palms together and replied \"Amitabha\" before he asked, \"I wonder if Master Xuan Jing is in the temple today? Is he free? I have something that I may need to bother him about and receive the advice of the Master!\"</p><br/><p>When the monk heard the request, he replied, \"Master is currently in seclusion, so it isn't too convenient to meet guests. I'm truly sorry.\"</p><br/><p>\"No worries, we understand. Thank you!\" Lu Chongshan appeared regretful.</p><br/><p>Initially, he had wanted to ask Master Xuan Jing if there was any way to resolve the Lu family's matter.</p><br/><p>Unexpectedly, he had even reached to the point of requesting help from God and Buddha...</p><br/><p>Even though he could not meet Master Xuan Jing, they did not immediately leave either. To express their sincerity, they had chanted sutras in the temple and transcribed the scriptures. They only left the temple when the sun set.</p><br/><p>A black car silently traveled back to the city.</p><br/><p>They had been out for the entire day. Little Treasure yawned and wearily fell asleep in Ning Xi's embrace. Ning Xi was infected by the little bun's sleepiness, and she also started to feel sleepy.</p><br/><p>While the other three people were all deep in thoughts of their own, they were clearly not sleepy at all.</p><br/><p>\"Ning Xi, let me carry Little Treasure!\" Yan Ruyi took Little Treasure from Ning Xi's arms.</p><br/><p>Ning Xi reluctantly let go. After leaving his mother's embrace, the little bun uneasily frowned as Yan Ruyi lifted him.</p><br/><p>\"Ziyao, have dinner with us tonight!\" Yan Ruyi intimately invited Guan Ziyao.</p><br/><p>Ning Xi had suddenly appeared and she was so close to Little Treasure, so she could not help but worry that Guan Ziyao would feel uneasy.</p><br/><p>\"Just eat at our residence! Today, our entire family must have a proper gathering!\" Lu Chongshan immediately decided.</p><br/><p>The two of them, intentionally or otherwise, straight up neglected Ning Xi's existence. They did not mention her at all.</p><br/><p>Lu Chongshan's expression was sunken. He did not believe that with such words, this woman would still be thick-faced and use Little Treasure as an excuse to stay again.</p><br/><p>At this moment, Ning Xi, who had been resting, suddenly woke up with wide eyes. An aloofness had suddenly appeared in her eyes. \"Careful!\"</p><br/><p>Almost the instant after she said that, came a loud bam that sent a chill up everyone's spines. Their car had been severely rammed into.</p><br/>\n</div>"}