{"title": "Chapter 1688: Quickly Rescue Little Treasure", "id": 1688, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1688-quickly-rescue-little-treasure", "volume_title": "Volume 17", "body": "<h1>Chapter 1688: Quickly Rescue Little Treasure</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1688: Quickly Rescue Little Treasure</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Tingxiao... Chongshan, quickly let Tingxiao know! Quickly get him to rescue Little Treasure!\" Yan Ruyi hurriedly said, then she added, \"And also that girl…\"</p><br/><p>Yan Ruyi closed her eyes, mumbling in her trembling voice, \"Thank goodness Little Treasure isn't alone this time... At least, he won't be as scared with that girl around... I can't imagine if Little Treasure was alone…\"</p><br/><p>Tears started falling out of Yan Ruyi's eyes.</p><br/><p>She felt like killing herself when she thought about how she could have allowed this to happen again, about the magnitude of psychological trauma Little Treasure would go through. and also if Ning Xi had not gone with him.</p><br/><p>\"It's me... It's my fault... I didn't protect Little Treasure... Why didn't I hold onto Little Treasure tightly? Why did I take Little Treasure from Ning Xi just now? If Ning Xi had been holding onto Little Treasure…\" Yan Ruyi was flooded with guilt.</p><br/><p>Lu Chongshan did not say anything, but he was not feeling any better than Yan Ruyi. If it had not been for his impatience to bond with the Guan family, they would not have come to Fahua Temple today and given the opponent a chance.</p><br/><p>Guan Ziyao helped Yan Ruyi up carefully. \"You shouldn't blame yourself, Aunty Lu. It's not your fault. It's my fault... I was too shocked to react and didn't take Little Treasure away in time…\"</p><br/><p>\"Master, Madam, we shouldn't stay here too long! Let's go back and plan it out! Another second later means more danger to the Little Master!\" Xing Wu quickly reminded them.</p><br/><p>\"Return! Quick!\"</p><br/><p>…</p><br/><p>On the way back, Lu Chongshan could not reach Lu Tingxiao's phone, so he ordered Xing Wu to go straight to the company.</p><br/><p>The moment they got out of the car in the underground parking lot, they saw Lu Tingxiao's special assistant Cheng Feng.</p><br/><p>Cheng Feng stepped out of his car while taking a phone call. He was grinning and seemed to be in a good mood.</p><br/><p>\"Cheng Feng!\" Lu Chongshan called out to him.</p><br/><p>Cheng Feng hung up and looked at Lu Chongshan, Yan Ruyi, and Guan Ziyao in surprise. \"President? Madam? Why are you all here this late?\"</p><br/><p>\"Where's Tingxiao? Why isn't he picking up the phone?\" Yan Ruyi went up and demanded.</p><br/><p>\"CEO Lu is working hard right now!\" Cheng Feng reported to Lu Chongshan excitedly. \"President! The Yi Lan Innovative Investment Group is done for this time around!\"</p><br/><p>\"What did you say?\" Lu Chongshan was stunned.</p><br/><p>\"The Yi Lan Innovative Investment Group had issues with a big order and they failed to deliver the goods up to the promised standard, so they needed to pay a huge penalty, but they've been using all their money to purchase our shares and have no ready cash now.</p><br/><p>\"If they want to keep Yi Lan, they have to sell whatever Lu Corporation shares they have. They spent money several times more than the market value of these shares. If they sell them at a lower price because they need the money, they'll suffer a huge loss even if they manage to keep Yi Lan safe. Most importantly, their threat towards the Lu Corporation will then be solved!\"</p><br/><p>\"Furthermore, President, please look at the stock market…\"</p><br/><p>Cheng Feng opened the stock charts of the several shares Yi Lan Innovative Investment Group had invested in on his iPad. All of them started with a strong performance, but their stock was now declining sharply.</p><br/>\n</div>"}