{"title": "Chapter 1680: Reel The Fish In", "id": 1680, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1680-reel-the-fish-in", "volume_title": "Volume 17", "body": "<h1>Chapter 1680: Reel The Fish In</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1680: Reel The Fish In</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The dreadful looking Lu Jingli pasted a grin on his face the moment Cheng Feng left. \"Bro, we can finally reel the fish in!\"</p><br/><p>Lu Tingxiao's eyes stayed on the monitor, his finger tapping on the table. Bloodlust overtook his expression and the usual gentle expression reserved for Ning Xi was nowhere to be found.</p><br/><p>Lu Jingli shivered when he took a glance at Lu Tingxiao's computer screen. \"Bro, don't be angry anymore. They're just trying to mess with you when they keep sending you these pictures! But they don't know you. They're just too naive by thinking that just sending these can affect you!\"</p><br/><p>Not only was it useless... It made his brother become even more brutal!</p><br/><p>He had witnessed it five years ago, and this time his brother had come back even stronger. Slowly but surely, his opponent was falling into his trap. Lu Jingli was shaken to his core as he was there to see the whole process!</p><br/><p>\"Xiao Xi Xi is all over you anyway. She couldn't be with anyone else!\"</p><br/><p>A slight sense of humanity returned to his expression when Lu Tingxiao heard that.</p><br/><p>Lu Jingli also took the chance to ask, \"So, can I do it now? I can, right?\"</p><br/><p>Lu Tingxiao glanced at him. \"Wait until they sign the contract with Liang Deyun.\"</p><br/><p>\"Oh, okay!\" Lu Jingli had sweat all over his forehead. That was a really bold move. His brother would rather risk having fewer shares than his opponent in order to make a lethal strike.</p><br/><p>Soon, Lu Tingxiao's fidgeting finger stopped and he raised his head. \"Time's up.\"</p><br/><p>Lu Jingli looked at the time. It was as expected.</p><br/><p>A short while later, in a well-hidden property belonging to the Lu Corporation, on a wide green plain field, Lu Jingli was holding a golf club in his hand. He swung it, then cheered, \"Wow! My luck today is off the charts! A hole-in-one!\"</p><br/><p>Somewhere nearby, a tall and hefty middle-aged man in a casual outfit was walking towards their direction.</p><br/><p>Despite his casual outfit, his back was straight and his steps powerful. He had a different vibe from regular people.</p><br/><p>Zhuang Liaoyuan stopped before them. He went straight to the point and asked, \"Where's the stuff?\"</p><br/><p>Lu Tingxiao passed a chip that was the size of a thumb. \"It's all in there. Everything about their underground arms deal.\"</p><br/><p>They were in a golf field, but there were only three of them, so they had no need to worry about being spied on.</p><br/><p>\"Are you sure it's reliable?\" Zhuang Liaoyuan asked with a serious expression as he took the chip.</p><br/><p>\"Yes,\" Lu Tingxiao replied.</p><br/><p>Zhuang Liaoyuan hesitated, but he still answered, \"Okay, I'll pass it on for you, but I won't be able to control or interfere how the black cats will act, or if they'll believe this information is reliable or not.\"</p><br/><p>\"Thank you.\"</p><br/><p>Actually, he was sort of being the guarantor by just handing the information over on behalf of him.</p><br/><p>Zhuang Liaoyuan put the chip away and he looked at the man. He changed the topic. \"I heard you've been set up for blind dates recently?\"</p><br/><p>\"It's a method for delaying. I've told Xiao Xi about it already,\" Lu Tingxiao said boldly.</p><br/><p>Zhuang Liaoyuan did not seem impressed. \"Don't think we Zhuangs are dead. I didn't stop this because I don't want Xiao Xi to be with you!\"</p><br/>\n</div>"}