{"title": "Chapter 1681: He’s So Persistent", "id": 1681, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1681-he%E2%80%99s-so-persistent", "volume_title": "Volume 17", "body": "<h1>Chapter 1681: He’s So Persistent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1681: He’s So Persistent</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Zhuang Liaoyuan did not hide his true intentions at all.</p><br/><p>While he was dissatisfied with Lu Tingxiao, he could not do anything when Ning Xi was so in love with him. He was only a person who was slightly closer to Ning Xi, so it was not appropriate for him to interfere.</p><br/><p>He could not stand it when he saw Xiao Xi struggle so much in the Lu family, but at the same time, he also wished for Xiao Xi to understand and leave this guy on her own accord. He would then find her someone better!</p><br/><p>He was only helping this guy this time because it was a serious matter and he could not just leave it after he knew the stakes involved.</p><br/><p>Lu Tingxiao, of course, knew what Zhuang Liaoyuan was thinking. He said slowly, \"I'm afraid you'll be disappointed. I hope you'll come and support us during my wedding with Xiao Xi, Chief Zhuang.\"</p><br/><p>He said it as if his matrimony with Ning Xi was set in stone in the end.</p><br/><p>Zhuang Liaoyuan was frustrated and he left with a darkened expression.</p><br/><p>Lu Jingli started being cheeky after Zhuang Liaoyuan left. \"Why would Chief Zhuang be so persistent? Your child with Xiao Xi Xi is already so old. He can't do anything at all! Dirt will come out together if he tried to forcefully take the carrot out! Uhh, the analogy seems odd, but that's just how it is…\"</p><br/><p>…</p><br/><p>The following night, Yan Ruyi was visiting the Guans as asked by Lu Chongshan.</p><br/><p>\"Ziyao... Ziyao! Your Aunty Lu is here. Come out and stop hiding in your room! This girl has been in her room all day long recently. I wonder what she's doing…\" Mother Guan was chatting to Yan Ruyi as they walked towards Guan Ziyao's room.</p><br/><p>\"Aunty Lu!\" Guan Ziyao quickly stood up and closed the book she was reading when she heard her mother's voice.</p><br/><p>However, Yan Ruyi saw the title. It was a book about child psychology. She glanced around Guan Ziyao's room and realized that there were a lot of books about child education.</p><br/><p>Yan Ruyi picked up one of them up. \"Ziyao, these books are...\"</p><br/><p>Guan Ziyao seemed a little embarrassed. \"Aunty Lu, it's nothing. Didn't I mention I was studying courses on this topic before? I'm just reading up a little…\"</p><br/><p>\"A little? How many days have you stayed in your room already? I was just wondering what you were up to. It turns out that you're reading these books?\" Mother Guan sounded angry.</p><br/><p>Guilt spread across Guan Ziyao's face. \"Because of my inability, I caused such a big misunderstanding the last time. I'm really sorry…\"</p><br/><p>Yan Ruyi was stunned and seemed a little shaken by the apology. \"Silly child, it's been such a long time and you're still not over it. I've already told you that it's not your fault. You're still unclear about Little Treasure's condition!\"</p><br/><p>Yan Ruyi suddenly grabbed Guan Ziyao's hands. \"It's no use if you just read the books. You need more time with him together. As you both spend time together, you'll get to know him more, won't you?'</p><br/><p>Guan Ziyao and Mother Guan looked at each other, obviously understanding what Yan Ruyi meant.</p><br/><p>Yan Ruyi sighed, \"Our Lu family only has one precious grandchild and in addition to the fact that he has no mother since he was born, we're more concerned about him and we hope that Ziyao can excuse us!\"</p><br/><p>\"Please don't say that, Aunty Lu. I quite like Little Treasure myself! He's a really sweet child!\" Guan Ziyao said in a sincere tone.</p><br/><p>Yan Ruyi seemed satisfied. \"It's really kind of you to still stay by Tingxiao's side... You know, a lot of things have been happening recently, but I'm sure Tingxiao will be able to resolve it. It's just a matter of time!\"</p><br/>\n</div>"}