{"title": "Chapter 1691: That Would Definitely Be Very Interesting", "id": 1691, "volume": 17, "url": "http://boxnovel.org/hidden-marriage-chapter-1691-that-would-definitely-be-very-interesting", "volume_title": "Volume 17", "body": "<h1>Chapter 1691: That Would Definitely Be Very Interesting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1691: That Would Definitely Be Very Interesting</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Where's the money?\" The man carelessly asked.</p><br/><p>\"Previously, we've used all of it to acquire the Lu Corporation's shares! There's not a single cent left! You said we don't need to care and that all of our resources should be used to acquire them!\" The subordinate looked alarmed as he answered.</p><br/><p>The man's brows shot up when he heard him. \"Did I say that?\"</p><br/><p>\"You did!\" The other person was about to cry from being tortured by his own boss.</p><br/><p>Right at that moment, the office door was pushed open once again. Qian Yi walked in with an air of haughtiness, then the subordinate said, \"In fact, all our underground business channels have been exposed!\"</p><br/><p>This meant that all of their financial resources were cut off!</p><br/><p>Previously, when Hei Long had been bailed out in time, they thought that there would definitely be no further problems. Who would have thought that these channels were still exposed, and had been directly disclosed to the black cats? Where had it gone wrong?</p><br/><p>However, now was not the time to think about it.</p><br/><p>Damn it! This Lu Tingxiao was remarkable indeed!</p><br/><p>Thankfully, he had prepared for this!</p><br/><p>Behind him, Tang Ye continued, \"Now, Lu Tingxiao has prepared a group of traders. They are attacking our share market!\"</p><br/><p>Yun Shen's usually lazy and uninterested eyes suddenly had an unprecedented light in it as if something interested him, fueling his earnest desire to the surface...</p><br/><p>\"Very good, let's play with him!\" The man's fingers moved slightly, and complicated share market charts flashed on the computer screen. \"Huh, I'd like to see if the former Wall Street legend is really undefeatable...\"</p><br/><p>If he defeated Lu Tingxiao in a field that he was most of proud of and well-versed in, that would definitely be very interesting!</p><br/><p>Qiao Yi watched Yun Shen's expression and knew that this guy was finally being serious. He was gratified and worried at the same time.</p><br/><p>He knew that Yun Shen was actually the same as Lu Tingxiao. They had a shocking talent in the aspect of share markets. The reason they could bring the Yi Lan Innovative Investment Group to such heights within such a short amount of time after they returned to China was not just with the simple feat of cash.</p><br/><p>This time, he really had no way of determining the winner.</p><br/><p>However, he would not allow any possibility for failure!</p><br/><p>This time, he must win! They would definitely win!</p><br/><p>He would do it at all costs!</p><br/><p>Yun Shen waved everyone away. He buried his head in the sea of data while Tang Ye quickly gathered the company team to begin their standoff with the Lu Corporation.</p><br/><p>Qiao Yi walked out after he gave his subordinate a warning look. \"You cannot let Ah Shen know about tonight's matter!\"</p><br/><p>Sometimes, that child just could not wrap his head around things and took too much responsibility. A man of great ambition did not bother about trifles, so what if it was by hook or by crook? To deal with someone like Lu Chongshan, there was no need to talk about compassion with him!</p><br/><p>\"Understood,\" responded the subordinate. </p><br/><p>...</p><br/><p>Tonight was destined to be a sleepless night.</p><br/><p>Yan Ruyi was still unconscious. Lu Chongshan had mobilized all of the Lu family's underground forces to search for Little Treasure's whereabouts. At the same time, the only thing he could do was wait for the other side to contact him.</p><br/><p>Once they contacted him, they would definitely raise an unreasonable demand, but as long as they reached out to him, they could identify their location and rescue Little Treasure.</p><br/><p>However, as time passed by and the night turned darker, many people had been mobilized, yet there was still no news of Little Treasure at all. That helicopter seemed to have vanished into thin air, not leaving any traces behind. They were not even sure if they were still in the country and the other party had not contacted him either...</p><br/><p>The once certain Lu Chongshan finally had a change in expression...</p><br/>\n</div>"}