{"title": "Chapter 1708: Who The Mysterious Person Was", "id": 1708, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1708-who-the-mysterious-person-was", "volume_title": "Volume 18", "body": "<h1>Chapter 1708: Who The Mysterious Person Was</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1708: Who The Mysterious Person Was</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Qiao Yi's chest was heaving, and his face was covered in incredulity.</p><br/><p>To prevent such an uncontrollable situation like how Yun Shen was acting today, he had secretly controlled the most important batch of forces. While Yun Shen looked like he could not care less about these things usually, he never had any objections on this and had exhibited extreme trust towards him, leaving everything for him to handle.</p><br/><p>He thought that he had gained control of everything all these years. Unfortunately, it was only now that he realized he had really underestimated this person in front of him.</p><br/><p>Yun Shen fixed his sleeves. There was an impatience in his eyes as he said faintly, \"Send Uncle Qiao back to rest. He's old. It's not good to be staying up so late at night!\"</p><br/><p>When he saw Qiao Yi being forcefully taken away, Feng Jin lowered his head and kept quiet, trying his best to remain as low profile as possible. He was one of Qiao Yi's most important confidants. If Qiao Yi and Yun Shen fell out, the first person whom Yun Shen would go after was him.</p><br/><p>Even though Tang Ye wanted to say something, he knew that the current situation could not be reversed by him alone. Saying too much would infuriate Yun Shen instead, so he just remained silent.</p><br/><p>At this moment, the man before them had torn apart that layer of the harmless and carefree facade he wore. His inner ruthless, blood-thirsty, and morbid side was all out to wreak havoc akin to a time bomb that could explode anytime...</p><br/><p>\"Continue searching! Within three minutes, if we still don't find them, all of you will die with me!\"</p><br/><p>Three minutes?</p><br/><p>They had looked for so long and still could not find any traces. How could they find anything in three minutes?</p><br/><p>The place was suddenly depressing...</p><br/><p>As they looked at the tyrant before them, all those who had joined this kidnapping mission started to regret it horribly, but they just followed orders...</p><br/><p>Just as everyone was overcast by the shadow of death, Lu Tingxiao, who was rapidly working on a laptop, had said to the man, \"Come over.\"</p><br/><p>\"Do you think you're calling a dog?\" A certain tyrant's eyes flashed with ire, but he still walked over.</p><br/><p>\"What's the password?\" Lu Tingxiao asked.</p><br/><p>Yun Shen looked at Lu Tingxiao's screen, and a shock crossed his face. \"You even managed to find this...\"</p><br/><p>City F was more or less an abandoned city. The surveillance systems in the city had been destroyed to close to nothing, but Lu Tingxiao had found the only monitoring node in this city of ruins. When they had first taken over Country F, Yun Shen had reset the node password.</p><br/><p>\"Password!\" Lu Tingxiao urged impatiently.</p><br/><p>Yun Shen pouted. \"The girl's birthday.\"</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>So were Tang Lang and Tang Ye.</p><br/><p>Such an important password, yet he had used such simple digits such as a birthday?</p><br/><p>Wait, no... That was not the point...</p><br/><p>The point was that this guy had actually used Little Junior Sister's birthday as the password!</p><br/><p>\"Pfft! I really couldn't tell that this pervert would have such boyish moments!\" Tang Lang crossed his arms and muttered into Tang Ye's ears to taunt.</p><br/><p>Lu Tingxiao had just paused for a moment, then he very quickly entered Ning Xi's birthday and obtained the historical surveillance footage.</p><br/><p>Compared to the fuzzy video in Lu Chongshan's phone, this surveillance camera overlooked the entire abandoned city below. The facility was quite high-end too, so it was still a very clear shot at night. The effect was clearly much better than the video, and even their expressions could be seen clearly.</p><br/><p>Lu Tingxiao immediately fast-forwarded the surveillance to when those people were about to deal with Ning Xi to see what had happened, and who that mysterious person who had suddenly appeared was...</p><br/>\n</div>"}