{"title": "Chapter 1717: Mommy Needs You", "id": 1717, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1717-mommy-needs-you", "volume_title": "Volume 18", "body": "<h1>Chapter 1717: Mommy Needs You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1717: Mommy Needs You</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Chongshan, Yan Ruyi, and Lu Jingli looked at Little Treasure anxiously. They were afraid that he would lose control when he saw his mother. They even had the doctor stand by in case anything happened.</p><br/><p>What awaited them was something far worse than him losing control.</p><br/><p>The little guy still had no reaction at all even after he saw Ning Xi. His dull expression did not change one bit from before.</p><br/><p>What they worried about the most had still happened…</p><br/><p>The child had witnessed Ning Xi being shot. In addition to that, Ning Xi had knocked him out while his extreme fear was at its peak. He might have even woken up for a little when Ning Xi had been covered in blood…</p><br/><p>In his sub-conscience, Ning Xi might have died.</p><br/><p>So, he had followed his mother and locked himself in that world.</p><br/><p>Yan Ruyi and Lu Chongshan looked at their unresponsive grandchild, who behaved as if he was a wooden puppet without any emotions, in despair.</p><br/><p>Because of Ning Xi, Little Treasure was able to walk steadily on the path of recovery.</p><br/><p>However, this time, Ning Xi would not be around. Who else could help Little Treasure come out of his trauma for the second time?</p><br/><p>Lu Jingli was impatient. He held Little Treasure's hand and walked towards the bed, then he placed Little Treasure down beside Ning Xi and led his little hand to touch Ning Xi's cheek gently. \"Baby look, it's your mother!\"</p><br/><p>The little guy was like a doll being controlled, like a machine…</p><br/><p>Lu Jingli's heart sank and he hugged the little guy. \"Little Treasure, please wake up…\"</p><br/><p>Lu Tingxiao's cold voice echoed in the room, \"Her arms, her torso, and her feet were shot. She also had a scapula fracture plus three broken ribs…\"</p><br/><p>Yan Ruyi and Lu Chongshan were apprehensive when they heard Lu Tingxiao's words. They did not understand why their son would say these words to trigger Little Treasure, and they tried to stop him.</p><br/><p>Still, Lu Tingxiao continued without hesitation, \"She's in a PVS state now, which means she'll remain in a vegetative state. Because she was injured too severely, she might not wake up forever even if her life isn't in danger anymore.\"</p><br/><p>Lu Tingxiao looked at his son whose back was tense. He knew his words were heard. \"Of course, she might suddenly wake up one day. She'll then need someone who cares and loves her to be by her side, calling her, and taking care of her.</p><br/><p>\"Your mother did her very best to protect you. If you want her to stay like that forever, if you're willing to let her sacrifice to go to waste, then you can continue to be like this.\"</p><br/><p>Lu Tingxiao paused, then continued in a voice that broke everyone's hearts, \"Little Treasure, Mommy needs you.\"</p><br/><p>The little guy's blank eyes finally changed after he heard Lu Tingxiao. His little hand on Ning Xi's cheek fidgeted a little.</p><br/><p>Yan Ruyi quickly went over when she saw Little Treasure looking at the food she was holding. \"Little Treasure, do you want to eat?\"</p><br/><p>Little Treasure stared blankly at the food Yan Ruyi had and nodded slowly.</p><br/><p>Yan Ruyi was overjoyed when Little Treasure reacted. Lu Chongshan and Lu Jingli were relieved as well.</p><br/><p>\"Come, Little Treasure, let's have some porridge! This porridge smells really nice!\"</p><br/><p>Little Treasure took the bowl and slurped the porridge down quickly as if he was really hungry.</p><br/><p>\"Take your time. There's still a lot…\"</p><br/><p>Little Treasure only stopped after finishing two bowls. He turned around and went beside Ning Xi, taking his mother's hands and putting them on his round tummy.</p><br/><p>Mommy, look! Little Treasure is doing well. Little Treasure is good…</p><br/>\n</div>"}