{"title": "Chapter 1723: Wait And See", "id": 1723, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1723-wait-and-see", "volume_title": "Volume 18", "body": "<h1>Chapter 1723: Wait And See</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1723: Wait And See</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Chongshan knew he was in the wrong. He said in a lowered tone, \"Brother Guan, it's inappropriate of the Lu family to handle it this way, but it's not related to Tingxiao at all. It's my fault as a father. I'll bear all the consequences and am willing to make up…\"</p><br/><p>Lu Chongshan was suddenly interrupted by his son behind him.</p><br/><p>\"Let me speak to Chairman Guan,\" Lu Tingxiao said.</p><br/><p>Lu Chongshan hesitated, but he still passed the phone over to his son.</p><br/><p>Lu Tingxiao took the phone and addressed coldly, \"Chairman Guan.\"</p><br/><p>Guan Rui chuckled when he heard Lu Tingxiao's voice and that distant title. \"Tingxiao, what an obedient child. You're not even calling me 'Uncle' anymore?\"</p><br/><p>Lu Tingxiao's expression did not change even when Guan Rui was ridiculing him. \"Meet me at the guest room on the top floor of the Imperial Hospital. I'll give you a proper explanation there, Chairman Guan.\"</p><br/><p>Guan Rui sneered, \"How sincere of you! You're going to give me an explanation and you're not coming to me. Instead, you want this old man to visit you at the hospital! Sure, I'll go. I'll see what explanation the Lu family is going to give me!\"</p><br/><p>Yan Ruyi went over worriedly after the phone call ended. \"Tingxiao, what are you going to do?\"</p><br/><p>Lu Jingli came out of the room and patted his mother's shoulders. \"Mother, don't worry! You have two handsome and intelligent sons. Would you really have to worry? Just wait and see later!\"</p><br/><p>Yan Ruyi pouted at him. \"What do you mean wait and see? Don't mess around!\"</p><br/><p>\"Since when did I mess around before!? Even if you don't trust me, have some faith in my brother! Both of you don't have to do anything. Just be there!\" Lu Jingli said with certainty.</p><br/><p>Yan Ruyi and Lu Chongshan looked at each other. They had no idea what the two of them had prepared.</p><br/><p>However, they were relieved that Tingxiao was not overly depressed and had offered to handle matters.</p><br/><p>…</p><br/><p>Little Treasure stayed right in the room with Ning Xi while Annie looked after them.</p><br/><p>Lu Chongshan, Yan Ruyi, Lu Tingxiao, and Lu Jingli were preparing for the meeting with the Guan family.</p><br/><p>After half an hour, the Guan family arrived.</p><br/><p>\"Uncle Lu, Aunty Lu, Jingli…\" Guan Ziyao greeted them one by one, then she looked hesitantly at the man she had not seen for some time. \"Tingxiao…\"</p><br/><p>Mother Guan was upset by Lu Tingxiao's cool reaction. \"That's enough, Ziyao. So what if you treat him well? Someone got seduced by some woman outside and has no idea what he's doing now after being tricked!\"</p><br/><p>Mother Guan felt the vibe around the distant and cold man change suddenly. While it was not obvious, she could feel an unseen pressure surrounding her and suffocating her.</p><br/><p>Mother Guan coughed lightly and changed her tone, \"Tingxiao, take my word of advice. Aunty has lived much longer than you and has seen more than you, which is why I can see things from a clearer perspective. Look at that woman, and then look at Ziyao. Ziyao is our princess and there are no flaws in her personality and talents. She's pure and kind, and your parents have been known her since she was a child. They understand…\"</p><br/><p>Putting Mother Guan's comments about Ning Xi aside, Yan Ruyi and Lu Chongshan were really satisfied with Guan Ziyao. At the moment, they could not hide the guilt on their faces.</p><br/>\n</div>"}