{"title": "Chapter 1738: Don't Want Father To Leave", "id": 1738, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1738-dont-want-father-to-leave", "volume_title": "Volume 18", "body": "<h1>Chapter 1738: Don't Want Father To Leave</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1738: Don't Want Father To Leave</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Lu Tingxiao personally sent them to the Beijing suburban military sanatorium.</p><br/><p>Only the country's top leaders or their family members could access the sanatorium. All of the medical facilities were top-notch. Most importantly, there were elite troops stationed all around, so it was definitely safe and secured.</p><br/><p>Lu Tingxiao bent over to plant a kiss on the girl's forehead. He looked at her for a long time before he got up, then he said to his son, \"Little Treasure, stay with Mommy. Listen to Uncle Zhuang and Grandfather Zhuang. Understand?\"</p><br/><p>Little Treasure stood there, with his head lowered, and did not say anything.</p><br/><p>\"I'm leaving.\"</p><br/><p>Little Treasure still did not move. There was no reaction at all.</p><br/><p>Lu Tingxiao sighed faintly. His wide palm patted the little guy's head gently before he turned around to leave.</p><br/><p>He had just walked a few steps away when there was suddenly a soft bump on one of his legs.</p><br/><p>Lu Tingxiao looked down and saw that his son was hugging him tightly. He looked up at him and did not say anything, yet his little face was already covered in tears.</p><br/><p>Yes, he hated Father. He had always hated him, but he did not want Father to leave...</p><br/><p>When he saw his son's little tearful face, Lu Tingxiao heart felt as if it was gnawed on by greenflies. It was a pang of pain right to his heart. He quickly squatted down and pulled his son's little body into his embrace. He had picked up the way Ning Xi usually comforted Little Treasure as he gently patted him in a flurry. \"Don't cry. What's wrong?\"</p><br/><p>Zhuang Zongren, who stood at the entrance, felt tears well up in his eyes. He quickly walked over to console, \"Little Treasure, don't cry, don't cry! Daddy's not leaving and not coming back forever. Your father can come over to see you and your mother anytime! Grandfather guarantees it!\"</p><br/><p>Sigh, he was still a child, after all, and he had just experienced such a shock too. The mother he was closest to might never wake up again for saving him, and now his father was going to leave too. Suddenly, he had to be left in a completely foreign environment. How could he not panic!?</p><br/><p>When he saw the little guy cry without a word, Zhuang Zongren's heart ached and he was at a loss. He blurted out, \"Ahh, well... Tingxiao, how about you stay here for the night? This suite is huge. It's enough for you two to stay in. You accompany Little Treasure, then we'll decide again when he adapts to the environment. Don't rush to leave! What's more important than your child? Do you hear me?\"</p><br/><p>Lu Tingxiao was still comforting Little Treasure as he did not know what to do. He sub-consciously nodded when he heard the old man. \"Got it.\"</p><br/><p>It was one thing to bring the child along. Now, he had even allowed Lu Tingxiao to visit as he wished, and even let him stay for the night?</p><br/><p>At the entrance, Zhuang Liaoyuan could not interrupt at all. Before he could stop the old man, he watched helplessly as things progressed to this stage, seeming rather unhappy and helpless as he sighed to himself.</p><br/><p>...</p><br/><p>Lu Tingxiao left the next morning.</p><br/><p>When he reached Platinum Palace, there were already five lean men all in black uniforms, waiting in the study room. One man stood out away from the five of them. Tang Lang wore something multi-colored like a color palette. He had disheveled, curly hair as he casually laid on the sofa, appearing a little dispirited.</p><br/><p>At the desk, the man said with an icy expression, \"The operation this time will have Tang Lang as the main commander. Do you have any objections?\"</p><br/><p>The five people all answered \"no\" together.</p><br/><p>Tang Lang raised his hand and his mouth twitched as he grumbled, \"Me? Main commander?\"</p><br/><p>Lu Tingxiao shot him a side look. \"Do you have a problem?\"</p><br/><p>\"No... No problem at all! Boss, you're exceptional at mobilizing people!\" Tang Lang's dispirited expression was swept clean and there was a flash in his eyes. \"I absolutely won't disgrace your order!\"</p><br/>\n</div>"}