{"title": "Chapter 1743: Betrayal", "id": 1743, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1743-betrayal", "volume_title": "Volume 18", "body": "<h1>Chapter 1743: Betrayal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1743: Betrayal</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>When they saw Xiao Tao's reaction, Lu Jingli exchanged a look with Lu Tingxiao. They did not say anything. Their gazes were calm as if they had predicted this.</p><br/><p>\"Xiao Tao, please get up first!\"</p><br/><p>Xiao Tao shook her head hard and pushed Ling Zhizhi away. She insisted on kneeling. \"No! Sis Zhizhi! I'm not getting up! It's I... It's I who hurt Bro Xi... It's I who caused Bro Xi to become like this... Bro Xi has been so good to me, yet I made her this way...\"</p><br/><p>\"Xiao Tao, please calm down. What's going on?\" Ling Zhizhi's expression was even more solemn now.</p><br/><p>Xiao Tao remained very emotional and she kept repeating, \"It's all my fault!\". Ling Zhizhi consoled her for a very long time before Xiao Tao finally calmed down slightly and knelt there blankly. She said in a shaky voice, \"I knew... I already knew... that someone wanted to hurt Bro Xi in secret... They wanted to kill Bro Xi... They wanted Bro Xi's life...\"</p><br/><p>\"What? Someone wants to hurt Ning Xi? How do you know?\" Ling Zhizhi quickly asked.</p><br/><p>Xiao Tao choked on her sobs as she admitted, \"Because those people already came looking for me! When we were filming in Sichuan City, that gun... I switched the gun! It was I who switched the fake gun for a real one!\"</p><br/><p>\"What did you say?\" When she heard Xiao Tao's words, Ling Zhizhi stood there stunned. She would never have thought that the culprit they had not discovered up till now... was actually Xiao Tao!</p><br/><p>Lu Jingli looked at Xiao Tao who kneeled on the ground and sighed softly.</p><br/><p>Previously, they had been trying to investigate who had switched the gun, but they could not get to the bottom of it. It seemed like that gun had been switched in thin air.</p><br/><p>But how was such a thing possible?</p><br/><p>Then... maybe there was only one possibility left...</p><br/><p>This had been done by someone beside Ning Xi who was closest to her, and whom she trusted the most. That was the only way the gun could have been mysteriously switched without leaving any traces.</p><br/><p>The person who was beside Ning Xi then, and had such a chance was most likely Xiao Tao.</p><br/><p>\"The last time, I already almost killed Bro Xi! Thankfully, Bro Xi was alright because she's skilled! I was glad she got lucky. I thought that after those people failed to succeed then, they definitely wouldn't risk it again, so I didn't say anything! I didn't warn Bro Xi! I didn't think I would've hurt Bro Xi and she'd become like this... Sis Zhizhi, I'm sorry... CEO Lu, I'm sorry... It's all my fault... CEO Lu, please lock me up...\" Xiao Tao lay on the ground and when she gazed at Ning Xi who was in the bed and covered in bruises, she cried even harder.</p><br/><p>Lu Tingxiao looked gravely at the girl on the bed. When he had found out it was Xiao Tao, he was worried that Ning Xi would not be able to accept it, so he had temporarily kept it from her. Instead, he had ordered people to secretly spy on Xiao Tao's movements.</p><br/><p>One thing he could be sure of was that the person who ordered Xiao Tao to take Ning Xi's life was definitely not the same group of people from Qiao Yi's end.</p><br/><p>Xiao Tao did not understand the whole situation. She thought that Ning Xi's getting harmed this time was also by the same people who had ordered her from before, so when she saw Ning Xi like this, she suddenly broke down and felt that she had hurt her. Under the pressure of extreme self-blame, she confessed everything.</p><br/><p>Today, he intentionally got Xiao Tao to come over too. More or less, he had hopes that she would come clean herself.</p><br/><p>\"Xiao Tao, why would you do that? Who made you do that?\" Ling Zhizhi interrogated urgently.</p><br/><p>Xiao Tao looked frightened. \"Sis Zhizhi, you know I have a younger brother who's studying in an American university right now. Those people captured my brother and threatened me. They said that if I don't follow their orders, they'd kill him... I didn't know who they were either... I just know that they spoke English... They had a translator beside them... They're probably not Chinese...\"</p><br/>\n</div>"}