{"title": "Chapter 1748: You Want It?", "id": 1748, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1748-you-want-it", "volume_title": "Volume 18", "body": "<h1>Chapter 1748: You Want It?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1748: You Want It?</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Just look at Tang Ye. He's much smarter than you. He knew that it's impossible and never thought about looking for him regarding it!\"</p><br/><p>Feng Jin saw hope when Tang Ye was mentioned. \"Maybe Tang Ye would have an idea…\"</p><br/><p>Feng Xiaoxiao sighed, \"What can he do? We couldn't even rescue Hei Long last time. Do you think we can get Uncle Qiao out this time? Moreover, they have Tang Lang with them this round…\"</p><br/><p>\"Don't mention that traitor!\"</p><br/><p>…</p><br/><p>In an underground winery under the Lu Corporation.</p><br/><p>\"Aaah!\"</p><br/><p>An eerie howl echoed behind a thick soundproof wall.</p><br/><p>\"I'll tell... I'll tell you everything…\"</p><br/><p>Lu Jingli's mouth twitched. \"Really? So quick? Your Hei Long withstood three days!\"</p><br/><p>Lu Tingxiao was sitting on the sofa without any expression.</p><br/><p>Qiao Yi's kneecap was scraped off his leg along with the flesh around it. He was sprawled down on the floor helplessly and stared at the man on the sofa. The man looked so noble and prestigious, yet his means were way worse than a devil's. Qiao Yi looked on in fear.</p><br/><p>He had thought Hei Long could actually endure this.</p><br/><p>He also thought Lu Tingxiao was just another businessman, he never expected the means he used to be way worse than people like them!</p><br/><p>Under such extreme torture, even God would not be able to stand it…</p><br/><p>The Lu family were all hypocrites after all!</p><br/><p>He could not die. He definitely could not die! The Lu family had not been annihilated yet! How could he die here, and die within the hands of these people!?</p><br/><p>If he could leave this place alive, he would never let these people go!</p><br/><p>And that ungrateful brat had really left him to die…</p><br/><p>The man on the sofa did not show any change of expression when Qiao Yi said he was going to start talking. \"Continue.\"</p><br/><p>Lu Jingli scratched his head. \"Huh? But he said he's going to start talking! Hmm, okay, he's probably lying since he's giving up this early! Let's continue…\"</p><br/><p>…</p><br/><p>It was almost dawn.</p><br/><p>The man walked out of the room in his usual black suit as if he had just left a glamorous wine reception except a vicious bloodlust lingered around him.</p><br/><p>Lu Jingli looked at his brother. Not only did he not feel scared, he felt a sense of warmth instead.</p><br/><p>He liked his brother better this way.</p><br/><p>The real him and even the scary him, not the inhumanly perfect him or the him that hid all his darkness behind.</p><br/><p>Tang Lang turned around from the bar when he heard footsteps. \"Done?\"</p><br/><p>Lu Jingli waved the recording chip in his hand. \"Done! Enough to get him a death sentence!\"</p><br/><p>Tang Lang raised his eyebrows and mumbled, \"Why the trouble? Just put him down now!\"</p><br/><p>Lu Tingxiao looked at him. \"It's legal.\"</p><br/><p>Lu Jingli went over and got himself a glass of wine. He took a sip and explained to Tang Lang, \"My brother means that we're law-abiding citizens. Of course, we'll go through the proper legal procedures and work following the law!\"</p><br/><p>Tang Lang's mouth twitched.</p><br/><p>Yeah, sure, you guys sure were law-abiding. Prison looks like heaven compared to you guys…</p><br/><p>\"You want it?\" Lu Tingxiao asked him suddenly.</p><br/><p>\"Huh? What do I want?\" Tang Lang missed the point.</p><br/><p>A certain koi [1] brand-translating machine continued his work. \"My brother is asking if you want his life. We plan to hand him over to the Black Cat [2], but if you want, we can give it to you! It's thanks to you that we caught this guy after all!\"</p><br/><p>Tang Lang was taken aback. After a short moment of silence, he shrugged and replied, \"It's okay. You guys are right. Let's be law-abiding citizens!\"</p><br/><p>Just let it be…</p><br/><p>If he killed the man with his own hands, Tang Lang would hunt him down for his whole life…</p><br/>\n</div>"}