{"title": "Chapter 1744: Did Not Trust Anyone", "id": 1744, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1744-did-not-trust-anyone", "volume_title": "Volume 18", "body": "<h1>Chapter 1744: Did Not Trust Anyone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1744: Did Not Trust Anyone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Did those people look for you again after that?\" Lu Jingli asked from the side.</p><br/><p>\"Not anymore after that, but they said that they might have tasks for me to do anytime... Probably waiting for a chance to attack... They even threatened me not to tell anyone... Otherwise, my brother will be in danger...\"</p><br/><p>The reason Xiao Tao would say all of these today, on one hand, was that after she saw Ning Xi in that condition, she broke down out of guilt.</p><br/><p>On the other hand, she knew that this place was definitely safe, so she had completely relaxed all her defenses and admitted all of this.</p><br/><p>When she thought about Ning Xi, Xiao Tao started to break down in tears again. \"Bro Xi was so good to me. She trusted me so much... She never suspected me at all... Other artistes would always order their assistants around. When they're in a bad mood, they would even beat and scold them at every turn, but Bro Xi has always been so gentle to me. he would always think of me whenever there was something yummy or fun. I was clearly the assistant, yet she was always worried that I'd be tired. She wouldn't let me do all the dirty and tiring work...</p><br/><p>\"This period when I worked alongside Bro Xi was some of my happiest days. If I could... I really wish I could accompany Bro Xi for the rest of her journey...\"</p><br/><p>Sadly, there was probably no chance of that anymore.</p><br/><p>As she listened to Xiao Tao, Ling Zhizhi did not know what to say. Even though she could not believe that the person who betrayed Ning Xi was the person she trusted the most, she could not find much fault with Xiao Tao's situation.</p><br/><p>Xiao Tao took a deep breath. She stopped crying and begged Lu Tingxiao, \"CEO Lu, I've let Bro Xi down with her care and trust towards me. I've let the company down. You can punish me as you wish! But I'm afraid that after those people find out about my confession here, they'll fly into a rage and something might happen to my brother... I know that you're a resourceful person. You can punish me any way you want, but could you... could you help my brother?\"</p><br/><p>In an instant, everyone looked at Lu Tingxiao.</p><br/><p>Lu Tingxiao said, \"I won't punish you. You're Xiao Xi's person. Even if there's punishment, it should be decided by her. As for your brother, if you trust me, I'll guarantee his safety, but I'll state beforehand, you must comply with all my arrangements.\"</p><br/><p>On the side, Lu Jingli explained, \"He means just pretend that today didn't happen. Continue to keep in touch with their end and be our spy. If they have any movements, you must tell us right away!\"</p><br/><p>Xiao Tao was ready to expect the worst, yet she would never have thought that such an outcome awaited her.</p><br/><p>She knew that Lu Tingxiao had given her a chance for Ning Xi's sake. Xiao Tao's tears started to fall again and she nodded profusely, \"I can cooperate with everything you guys want! As long as I can make up for my past mistakes!\"</p><br/><p>\"About your brother, if other people can touch him, so can I,\" Lu Tingxiao added with an ice-cold expression.</p><br/><p>Clearly, he did not trust anyone.</p><br/><p>Xiao Tao suddenly felt her spine shiver. Her body trembled like a sift chaff. \"I understand, I understand...\"</p><br/><p>She knew that she had betrayed Ning Xi once and that she was not deemed trustworthy anymore. She could completely understand CEO Lu's actions.</p><br/><p>Instead of being on edge every day, she might as well trust CEO Lu. Even if she was exploited by CEO Lu, it would be better than being threatened by those people.</p><br/><p>Ling Zhizhi looked at the way Lu Tingxiao handled things and let out a breath of relief. It seemed like the best course of action. Ning Xi was currently in an unusual phase. If they suddenly changed the assistant that had worked by her side for so long, this would alert the enemy. If they got another person, forget about not being able to explain the situation to the new person, she would not feel at ease using them either...</p><br/>\n</div>"}