{"title": "Chapter 1758: Tempted", "id": 1758, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1758-tempted", "volume_title": "Volume 18", "body": "<h1>Chapter 1758: Tempted</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1758: Tempted</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Are you her foster father, Mr. Tang Shan?\"</p><br/><p>\"Foster father? I'm her biological father!\"</p><br/><p>\"Sir, as far as I know, Ning Xi has broken off contact with her biological parents.\"</p><br/><p>Ning Yaohua stormed away and spoke quietly, \"You're her manager. How can you listen to that nonsense? Get Xiao Xi on the phone right now!\"</p><br/><p>\"I'm sorry, Sir, everyone around her knows that Ning Xi won't take private calls when she's working.\"</p><br/><p>…</p><br/><p>Ning Yaohua was enraged when the line went dead.</p><br/><p>Ning Xueluo saw a light of hope when she noticed the darkened expression on Ning Yaohua. \"Father, what's wrong?\"</p><br/><p>\"Nothing…\" Ning Yaohua would never reveal how a little manager had just talked back to him over the phone. He changed the topic quickly. \"Xiao Xi's not free to pick up my call right now.\"</p><br/><p>Ning Xueluo acted like she understood. \"Sister's really popular now. It's not odd that she's busy. It'd probably be difficult for her to join us…\"</p><br/><p>Zhuang Lingyu let out a cold laugh. \"She's acting all high and mighty after starring in just a few movies. She was still a nobody when Xueluo was famous! Now, she's forced you out of the industry and taken over all your resources. How dare she do this to us?\"</p><br/><p>Ning Zhiyuan stared at them unhappily. \"It's fine. Just let it be if Xiao Xi's busy. Why the fuss?</p><br/><p>\"If you lot told everyone about Xueluo's matter from the very beginning instead of lying, Xueluo wouldn't have ended up this way! Things would've turned out vastly different if you guys had nurtured the relationship with the Tang family properly. What a shame to the Ning family!</p><br/><p>\"You lot brought these consequences upon yourself. Don't blame everything on Xiao Xi!\"</p><br/><p>Ning Yaohua comforted him, \"Please don't be angry, Father. We won't mention the past again. As for the family gathering tomorrow... I think she won't be coming because of some tiny misunderstanding, but I also think that she might come along together with Qiutong and Wenbo.\"</p><br/><p>Zhuang Lingyu was already upset that the elder was on Ning Xi's side, and she got even angrier when Ning Yaohua was speaking for Ning Xi as well.</p><br/><p>She knew what was happening. Ning Yaohua was not concerned about the elder's health at all. He was thinking that he might be able to get something good out of Ning Xi since she was affiliated with the Zhuang family now and his greed tempted him.</p><br/><p>The Zhuang family was terribly selfish. They were willing to abandon their own child out of reputation. How could they pick up that girl?</p><br/><p>Even if the Zhuang family really took her in, that girl would have told the whole world about it already instead of keeping quiet all this time.</p><br/><p>…</p><br/><p>The next night.</p><br/><p>In the banquet room, Ning Yaohua, Ning Yaobang, and Ning Qiutong were present. Beside Ning Qiutong was her husband Guo Wenbo, who had just come back from abroad. Ning Xueluo and Su Yan were there as well.</p><br/><p>When they were about to start, Ning Xueluo asked with a concerned tone, acting natural, \"Are we not waiting for Xiao Xi?\"</p><br/><p>Su Yan was taken aback when he heard Ning Xueluo's question. He unconsciously looked over at the door. Except on TV and newspaper, he had not seen her since the Golden Film Award.</p><br/><p>Ning Qiutong replied, \"Xiao Xi's busy today. She won't be coming.\"</p><br/>\n</div>"}