{"title": "Chapter 1761: This Is What I Got You", "id": 1761, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1761-this-is-what-i-got-you", "volume_title": "Volume 18", "body": "<h1>Chapter 1761: This Is What I Got You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1761: This Is What I Got You</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At midnight in Platinum Palace, the light in the study room was still on.</p><br/><p>Lu Jingli looked at the documents in his hand with his bleary eyes that could barely open while a certain someone was still handling the complicated-looking documents.</p><br/><p>He had been on guard for the past few days. Since he was not able to convince him, he just stayed by to make sure that everything would be alright.</p><br/><p>\"Bro... Bro... I know... You want to show Sister-in-law a peaceful world when she wakes up... and to tell her, 'Look, this is what I got you!' How damned romantic! But you have to be alive when the time comes, don't you?\"</p><br/><p>Lu Tingxiao stared at Lu Jingli who was now lying weakly on the sofa.</p><br/><p>Lu Jingli then cowered unconsciously. \"What now? Do you want to hit me again? Fine, fine...I know... I'll shut up! I need to keep myself alive to look after you on Xiao Xi Xi's behalf!\"</p><br/><p>Suddenly, Lu Tingxiao's phone rang.</p><br/><p>The man picked it up.</p><br/><p>\"CEO Lu, the media and her fans are still alright for now, but... recently, Ning Xi's cousin called for something. Today, Ning Yaohua and Ning Xi's aunt Ning Qiutong also called. It seems like Ning Xi's uncle came back and they had a family gathering. I made up an excuse for her and they didn't suspect a thing.\"</p><br/><p>Ling Zhizhi reported everything regarding Ning Xi to Lu Tingxiao, then asked for further directions, \"Do we... hide from all of them too?\"</p><br/><p>\"It's better if fewer people know about it.\"</p><br/><p>Ling Zhizhi nodded. \"Alright, noted.\"</p><br/><p>Xiao Tao's incident was just a warning. The fewer people knew about Ning Xi's condition, the better.</p><br/><p>After Lu Tingxiao hung up, someone rushed into the room. Tang Lang was panting as he bent over. \"Damn it! Qiao Yi got rescued by someone! He was sent into the prison already and still managed to make it out! Is that guy really human?\"</p><br/><p>\"What? Prison break! Is it the same person who rescued Hei Long last time?\" Lu Jingli was suddenly roused.</p><br/><p>Tang Lang caught his breath. \"From the modus operandi, I think it's the same person! People from Qiao Yi's end thought that we released Hei Long on our own, yet he was snatched away from us, then now this guy has reappeared again!\"</p><br/><p>Lu Jingli was confused. \"Just who is that person? Even Qiao Yi doesn't know? So, they aren't working together?\"</p><br/><p>Tang Lang scratched his head and was annoyed. \"But I've never known about such a person even after being in the organization for so many years. If there is, being a fighting maniac, Tang Ye would surely know him!\"</p><br/><p>Lu Jingli nodded in agreement.</p><br/><p>\"Unfortunately, I didn't have to chance to deal with the person. Otherwise, we could do a deeper investigation!\" Tang Lang then turned to the cold-looking man in front of the table. \"Boss, what should we do now?\"</p><br/><p>The man leaned back in his chair, his eyes like a never-ending abyss. \"Wait.\"</p><br/><p>\"Huh? What do you mean?\" Tang Lang was taken aback.</p><br/><p>Lu Jingli smilingly went over to Tang Lang and said in a quiet voice, \"When that guy was unconscious, my brother put something... interesting inside his body!\"</p><br/><p>Tang Lang gasped, \"You guys put a tracker inside Qiao Yi?\"</p><br/>\n</div>"}