{"title": "Chapter 1769: Witness", "id": 1769, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1769-witness", "volume_title": "Volume 18", "body": "<h1>Chapter 1769: Witness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>That person that he had thought she loved, that he thought was a person that suited her more... In the end, it was himself.</p><br/><p>There were so many flaws, so many hints…</p><br/><p>Why did he only realize it now?</p><br/><p>The man sat on a wooden chair nearby with his head down and he did not move at all. Lu Jingli did not disturb him and walked away to let him be alone for a while.</p><br/><p>After some time, the man stared at the recorder pen blankly, then he took out his phone and made a phone call in his hoarse voice, \"Hello, Ms. Ling. Please help me prepare Ning Xi's signature. I'll get my assistant to get it from you later.\"</p><br/><p>He then made another call. \"Go to my office right now and get something for me. In the last desk... and…\"</p><br/><p>Lu Jingli watched the man make a few calls as he just sat there quietly.</p><br/><p>…</p><br/><p>Inside Ning Xi's room, the atmosphere was unbelievably heavy.</p><br/><p>Even Zhuang Keer and Zhuang Rongguang had arrived. Zhuang Keer was sobbing by Ning Xi's bedside while Zhuang Rongguang looked really dismal.</p><br/><p>Yan Ruyi could not bring herself to look at the girl on the bed. \"It's all the fault of us Lus... We made this child suffer... Master Xuan Jing said she had a blissful life. She probably used it all up and exchanged it for Little Treasure's life…\"</p><br/><p>Lu Chongshan knew that it was useless no matter what he said, so he just stood there in silence.</p><br/><p>Zhuang Zongren sighed. This girl had yet to know that Little Treasure was her real child, yet she was willing to sacrifice herself for him…</p><br/><p>Zhuang Liaoyuan's expression darkened. \"Since it has come to this state, it's futile no matter what we say. We don't care what will become of Xiao Xi. We will take care of her forever.\"</p><br/><p>He then looked at Yan Ruyi and Lu Chongshan. \"You can see Xiao Xi's condition for yourself. We get that you feel guilty, but it's alright now. Just forget about it.\"</p><br/><p>In Xiao Xi's condition, she probably would never wake up again, so what was the point of guilt-tripping the Lu family and tying Lu Tingxiao down to a person in a vegetative state forever?</p><br/><p>It had just happened. While they might indeed be guilty of it, what could make a person stay forever?</p><br/><p>As everyone was silent in their thoughts…</p><br/><p>There was the sound of footsteps behind them.</p><br/><p>Lu Tingxiao and Lu Jingli had returned together. Behind them were Ling Zhizhi and Lu Tingxiao's special assistant, Cheng Feng.</p><br/><p>For some reason, Lu Tingxiao seemed kind of different than before…</p><br/><p>Lu Tingxiao went into the room and gazed at everyone. \"Since everyone's here today, I'd like everyone to witness something for me.\"</p><br/><p>Witness?</p><br/><p>What was it?</p><br/><p>Everyone exchanged looks with no idea what Lu Tingxiao had in store.</p><br/><p>Even Lu Jingli was not sure what he had prepared, but he could somewhat guess a little…</p><br/><p>\"Cheng Feng,\" Lu Tingxiao called his assistant.</p><br/><p>Cheng Feng quickly went up to him and took out a small, black, square box from his bag. He handed it over to Lu Tingxiao carefully.</p><br/><p>Everyone then gaped as Lu Tingxiao went before Ning Xi's bedside with that little black velvet box.</p><br/>\n</div>"}