{"title": "Chapter 1768", "id": 1768, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1768", "volume_title": "Volume 18", "body": "<h1>Chapter 1768</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1768: No One Else, It’s You</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Jiang Muye was rallied and shot her with a barrage of questions: [Ning Xi! How much do you know about him? You've only seen the side of him that's a pretense in front of you! Do you think Lu Tingxiao is really as gentlemanly as he looks? Do you know that Jia Qingqing died somewhere in the wild? Do you know what happened to that fatty Zhu Xiang? Do you know he used an aviation crew to create artificial rain just to stop a kissing scene? Even the incident of my family... He planned everything!]</p><br/><p>Lu Tingxiao's expression froze when he heard Jiang Muye's accusations.</p><br/><p>[But, Jiang Muye, he's never done anything to hurt me! If I get afraid of him, avoid him, and abandon him because of that, it's unfair. No matter what you say, I just know that he treats me very well. Very, very well. No one has ever treated me this kindly before.]</p><br/><p>When Lu Tingxiao heard the girl's reply, he felt like he was dragged back from the very edge of the cliff.</p><br/><p>She said that no one had ever treated her this kindly before…</p><br/><p>The girl continued.</p><br/><p>Ning Xi: [I know what I am. I've fallen for him, but it doesn't mean that I've lost my mind. I know what I'm doing and what I should do.]</p><br/><p>Ning Xi: [Let me quote you back: How well do you know me? What you see now is just the side I'm showing you. Do you think that this is truly me?]</p><br/><p>…</p><br/><p>The recording stopped there.</p><br/><p>Lu Tingxiao had mixed feelings in his heart. His face was still blank as he stood frozen under the big tree. Finally, the whole matter was clear.</p><br/><p>Her rejection towards him from the beginning was all about the incident that had happened back then, and the so-called person that she liked was just an excuse.</p><br/><p>Lu Jingli's eyes were a little sour as he saw the expression on his brother's face. \"Bro, did you hear that? No ifs! No one else! Xiao Xi Xi liked you from the beginning! Only you!\"</p><br/><p>Lu Tingxiao closed his eyes and held onto the recorder pen tightly. An infinite number of flashbacks came back to him, flooding his brain…</p><br/><p>He remembered back when Ning Xi had said proudly, \"The person I like? He... He's cool and talented in all areas... gentle and romantic and smart and reliable and rare and unpredictable and beautiful and... just amazing! If you knew who he is, you'd never think that I'm exaggerating!\"</p><br/><p>He also recalled that she had told him firmly, \"Lu Tingxiao, I've already told you from the start - there is already someone that I like very, very much! Even though there are reasons that I can't be with him, he will live in my heart forever, filling it to the brim so much so that no one else can replace him! There just isn't any more space for anyone else. Even if that person was more wonderful and even more perfect, it would still be a 'no'. Do you understand?\"</p><br/><p>He also remembered that one night after she had rejected him, he heard her singing in the room, \"I miss you, really miss you, but I'm lying to myself... I miss you, really miss you, I'll keep it as a secret... I miss you, really miss you, deep in my heart…\"</p><br/><p>There was also a status that she had posted before: \"I can accept the darkness... if I've never seen the sun. However, the sun has magnified my loneliness…\"</p><br/><p>Once, she had told him that he was her sun…</p><br/>\n</div>"}