{"title": "Chapter 1771: She’s Irreplaceable", "id": 1771, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1771-she%E2%80%99s-irreplaceable", "volume_title": "Volume 18", "body": "<h1>Chapter 1771: She’s Irreplaceable</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1771: She’s Irreplaceable</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Ling Zhizhi sighed, \"Right! Xiao Xi is a natural born actress!\"</p><br/><p>To be able to reach this height in such a short amount of time, it was not odd for the whole entertainment industry to be shaken.</p><br/><p>Ling Zhizhi paused for a while before she asked Lu Tingxiao, \"CEO Lu, about the current situation... I can't suppress it anymore... Are we following our initial plans and announcing Ning Xi's condition?\"</p><br/><p>The air turned still after Ling Zhizhi's question.</p><br/><p>After some time, Lu Jingli broke the silence. \"I suggest not to. Bro, you don't understand how the entertainment industry works. You'd think with Xiao Xi Xi's personality, she'd want her fans to know.</p><br/><p>\"But, actually, it might be better if they didn't know about it. If they found out that she's in a vegetative state, people will start to question how she got her injuries. And where she is now? The media will pester us like bugs. They might find out about the sanatorium and might even involve the Zhuang family. It'll get complicated and eventually get out of our control…\"</p><br/><p>Ling Zhizhi looked dignified. \"Second Master is right. That's exactly what I was worried about, so I'm here today to discuss it with you.\"</p><br/><p>Lu Jingli tried to phrase it charmingly. \"Bro, maybe we should just handle it by not handling it. We shan't give any response and let time this matter away. It's not uncommon for popular celebrities within the industry to suddenly vanish anyway. While it'll attract a lot of attention in the short term, the public's attention span is limited. As time passes, they'll forget about it.\"</p><br/><p>Ling Zhizhi nodded. \"Yes, if they can't find out what happened, people will just assume that Ning Xi has retired. No matter what kind of personal reason they guess, it wouldn't be anything serious.\"</p><br/><p>After a short while, Lu Tingxiao finally concluded, \"We'll do as the two of you said.\"</p><br/><p>Ling Zhizhi was relieved. \"Okay.\"</p><br/><p>The three of them then discussed some other details.</p><br/><p>Lu Jingli looked like he had something else in mind. When they were about to wrap up, he hesitated again and finally turned to Lu Tingxiao. \"Bro, actually...there's another way…\"</p><br/><p>Lu Tingxiao and Ling Zhizhi both looked at Lu Jingli's direction.</p><br/><p>Lu Jingli then reminded them, \"Did you guys forget about Su Yimo who's still in jail? Her face is like a mirror of Ning Xi's. If we didn't catch her the last time, everyone was almost deceived by her. If we arrange it appropriately, there wouldn't be any issue.\"</p><br/><p>Ling Zhizhi did not say anything. She just raised her eyebrows a little. There did not seem to be any flaw in Lu Jingli's suggestion at all, but…</p><br/><p>This time, both Lu Jingli and Ling Zhizhi looked at Lu Tingxiao, waiting for his decision.</p><br/><p>Lu Tingxiao looked down and touched his ring. After some time, he said, \"She's irreplaceable.\"</p><br/><p>Ling Zhizhi felt a heavy blow to her heart when she heard him.</p><br/><p>Lu Jingli smiled, then shrugged. \"Alright, alright. I knew you'd say that anyway, which is why I didn't mention it before.\"</p><br/><p>Lu Jingli then said with a serious expression, \"You're right though. She's irreplaceable.\"</p><br/>\n</div>"}