{"title": "Chapter 1796: Cannot! Get It Going!", "id": 1796, "volume": 18, "url": "http://boxnovel.org/hidden-marriage-chapter-1796-cannot-get-it-going", "volume_title": "Volume 18", "body": "<h1>Chapter 1796: Cannot! Get It Going!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1796: Cannot! Get It Going!</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Apart from that, after she woke up, she still had one more very important thing to do!</p><br/><p>It was the one thing that she had regretted not doing earlier the most during the time she had fallen into a coma.</p><br/><p>Ning Xi thought of something and then tugged on Lu Tingxiao's hand. Her face was glittering with a glow. \"Darling, follow me. I noticed a place with an especially great scenery. It's particularly suitable for relaxing. I'll bring you there to look around, okay?\"</p><br/><p>Lu Tingxiao did not suspect anything. His tone was filled with a longing to pamper and indulge her. \"Okay.\"</p><br/><p>Lu Tingxiao helped Ning Xi put on a jacket, then the two of them walked towards the forest behind the lake.</p><br/><p>Along the way, Ning Xi started to ramble incoherently as she kept talking to Lu Tingxiao. No matter what she said, Lu Tingxiao would listen fully focused, and he would respond earnestly.</p><br/><p>The further they walked into the forest, the quieter it became. The scenery became more and more beautiful as well, while Ning Xi's palm that was holding onto Lu Tingxiao's gradually started to sweat from all the nerves...</p><br/><p>Bloody hell! She was already experienced at flirting. Why was she so terrified at such a key moment?</p><br/><p>No! Get it going!</p><br/><p>The two of them walked past flowers and brushed past leaves as they strolled through the forest filled with the breath of plants. Before them, their line of sight suddenly widened. Ahead of them was actually a sea of flowers that had formed into layers of floral waves with the caress of the spring breeze...</p><br/><p>She had noticed this place when she looked out from her window. Earlier, she had secretly left the house to check out this location too.</p><br/><p>When he suddenly saw such a huge sea of flowers, even Lu Tingxiao's breath was taken away too.</p><br/><p>Even though he had been living here for more than a month, apart from that building which had her, he had not step foot on other places.</p><br/><p>\"Darling, isn't it beautiful?\"</p><br/><p>Lu Tingxiao looked into the girl's eyes that reflected the sea of flowers which spread out over mountains and responded, \"Mhm.\"</p><br/><p>Ning Xi looked up at the man before her. \"Lu Tingxiao...\"</p><br/><p>Ning Xi had never called out his name this seriously before. Lu Tingxiao's expression could not help but tense up as he silently looked at her and waited for her to continue.</p><br/><p>Ning Xi took a deep breath, then she said, \"Before I met you, I only existed for the sake of existing, achieved my dreams for the sake of it. As for when everything I should've done was completed, what meaning was there left for me to continue on living? I had never thought of it, Even if you let me die right at that moment, I probably wouldn't have had anything I couldn't bear to part with or would've missed.\"</p><br/><p>When he heard this, Lu Tingxiao's gaze tightened slightly.</p><br/><p>Ning Xi smiled faintly as her gaze was fixated on the man before her. She continued to say, \"However, I met you and Little Treasure. It was the first time knowing how it felt like to be needed, the first time knowing how it felt like to be someone's entire world, the first time I knew that I could also be weak, that I could also be headstrong, that I could also just be myself, that I could also love like normal people, and to live...\"</p><br/><p>The girl tiptoed and kissed the man's lips. \"Lu Tingxiao, having ten thousand eyes on me can't compare to being the only one in your heart. You are the most wonderful, warmest person I have ever met in my lifetime...\"</p><br/><p>\"Lu Tingxiao, let's... get married...\"</p><br/><p>The sea of flowers rolled up and down in waves as the butterflies fluttered around. Lu Tingxiao's consciousness seemed to have suddenly been shaken from the heavens. He stood there rigidly while the girl kissed him. He did not move and had lost all ability to react.</p><br/><p>What... did he just hear?</p><br/><p>The man did not react for a long time. As skilled as Ning Xi was, she could not hold on much longer at this moment. Her palms started to sweat. \"You still didn't tell me your answer.\"</p><br/><p>Some time passed before the man finally came back to his senses from that ecstasy that almost swallowed him whole. His voice trembled as he answered, \"Madam, I'm afraid... I can't do that...\"</p><br/>\n</div>"}