{"title": "Chapter 1801: My Daughter-In-Law", "id": 1801, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1801-my-daughter-in-law", "volume_title": "Volume 19", "body": "<h1>Chapter 1801: My Daughter-In-Law</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1801: My Daughter-In-Law</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>The few of them had just entered when they suddenly saw Lu Chongshan's faltering figure walking down the stairs with the help of the servants' support.</p><br/><p>When Lu Chongshan saw the girl who was intimately held onto by his wife, he was suddenly so emotional that he started to tremble.</p><br/><p>\"Father, why did you get down from bed?\" Lu Jingli quickly went up to hold him steady.</p><br/><p>Lu Chongshan had a stern face as he waved his hand. \"Not that weak.\"</p><br/><p>Lu Jingli was speechless. \"Not yet! Yesterday, you were still lying on the bed and couldn't move. You even needed Little Treasure to coax you before your forcefully ate two bites of food!\"</p><br/><p>\"Punk!\"</p><br/><p>\"Okay, okay, okay, I'm wrong. You're not that weak. You still have the energy to scold me. Quickly sit down, you!\"</p><br/><p>After everyone had sat down at the dining table, no one said anything. Suddenly, the atmosphere was a little awkward.</p><br/><p>Yan Ruyi quickly signaled her husband with her eyes, telling him not to look so stern and to say something.</p><br/><p>Lu Chongshan really did not know how to start. Moments later, he finally cleared his throat and looked at his son opposite him. \"Tingxiao, how's your wife's health? Has it been checked?\"</p><br/><p>\"The check-up is done. There're no issues. She just needs rehabilitation and to recuperate for a period of time,\" said Lu Tingxiao.</p><br/><p>\"That's good then... That's good...\" When Lu Chongshan heard the outcome, he let out a long sigh of relief as if this huge mountain that had been a weight on him for a long time had finally been lifted. He finally had the room to breathe.</p><br/><p>\"Okay, let's eat first. We'll talk after we eat. Don't let Xiao Xi and Little Treasure starve,\" Yan Ruyi said as she started to scoop dishes for Ning Xi.</p><br/><p>Little Treasure and Lu Tingxiao kept spooning Ning Xi dishes too. Very soon, her bowl had already turned into a little mountain.</p><br/><p>It was at this moment that Lu Chongshan said, \"Get your wife some fish maw and lingzhi soup...\"</p><br/><p>Ning Xi had initially mentally prepared herself with all sorts of ways to respond, yet later on, she realized that the change in the two elders' attitudes towards her was even more exaggerated than what Lu Jingli had told her earlier. On the contrary, she did not know how to respond, so as to conceal her helplessness at the meal, she could only keep striving to eat and eat.</p><br/><p>After dinner, Yan Ruyi pulled Ning Xi's hand and said sincerely and earnestly, \"Xiao Xi, can I chat with you alone?\"</p><br/><p>When she heard this, Ning Xi stayed silent as Lu Tingxiao instantly frowned.</p><br/><p>Yan Ruyi knew what he was thinking the moment she saw her son's expression. \"What are you frowning for? Could I possibly eat up your wife? Xiao Xi is also my daughter-in-law, alright?\"</p><br/><p>Lu Tingxiao pinched between his brows. \"I didn't mean it that way.\"</p><br/><p>\"I gave birth to you. Do you think I wouldn't know what you're thinking?\"</p><br/><p>When she saw that the mother and son pair was probably going to start arguing, Ning Xi first signaled Lu Tingxiao and then quickly cleared her throat to say, \"Elder Madam Lu, we don't have to care about him. You can just tell me anything!\"</p><br/><p>The wife had already spoken up, so Lu Tingxiao could only compromise helplessly.</p><br/><p>Yan Ruyi held onto Ning Xi and walked to the beautiful greenhouse in the courtyard behind. On the round table in the middle was a steaming pot of fruit tea brewing.</p><br/><p>\"Try this fruit tea. It's fresh and tasty, and aids digestion too.\"</p><br/><p>\"Thank you.\"</p><br/><p>As she watched Ning Xi's courteous manner, Yan Ruyi's looked miserable. However, when she recalled how the girl had been unconscious for a year and had finally woken up, her eyes were filled with gladness and she felt gratified again. \"It's Bodhisattva's blessing. It's been a year and you've finally woken up! Later on, I'll go to all the temples to redeem the vow!\"</p><br/><p>Yan Ruyi's tone was filled with regret. A momentary silence later, she said, \"Xiao Xi, today I've asked you to come. On one hand, it's to thank you. Thank you for everything that you've done for Little Treasure and Tingxiao. On the other hand, it's to apologize to you. Tingxiao's father and I have misunderstood you very much. Other than that, there're still some things that I want to explain to you...\"</p><br/>\n</div>"}