{"title": "Chapter 1806: Husband", "id": 1806, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1806-husband", "volume_title": "Volume 19", "body": "<h1>Chapter 1806: Husband</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1806: Husband</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"Hello, Mr. Lu...\" From the other end of the phone came a raspy and haggard voice.</p><br/><p>\"Mmm.\"</p><br/><p>\"Apologies for presumptuously disturbing you. Today, I'm calling you because there's something I'd like to get your instructions on.\"</p><br/><p>\"Speak.\"</p><br/><p>\"I...\" The young man on the other end seemed to have gone through a long struggle before he finally said, \"Mr. Lu, I want to resign.\"</p><br/><p>Lu Tingxiao's brows furrowed. \"I'm not your boss. I don't have the authority to comment on your request.\"</p><br/><p>When the young man heard this reply, his tone became a little impatient. \"But you're the only person who can make this decision on behalf of the Boss. If I continue in my position, I'll only destroy Spirit. After I resign, with your capabilities, you can definitely hire a much better designer for Spirit!\"</p><br/><p>Lu Tingxiao pinched the space between his brows and did not say anything.</p><br/><p>He never breathed a word about the truth behind Ning Xi's disappearance to anyone in Spirit. He did not know how Gong Shangze and the rest had guessed it.</p><br/><p>Han Momo and Qiao Weilan were alright. Even though at first, there were some twists and turns, in the end, they still managed to hold the fort down and had been steadily running the company.</p><br/><p>However, Ning Xi's departure had affected Gong Shangze significantly.</p><br/><p>After all, designers were sentimental, especially since Ning Xi's existence had been like a belief to Gong Shangze. Now, this solid belief of his had suddenly left without a word, so one could well imagine how it affected him.</p><br/><p>He could still somewhat assist running the company in secret. However, even he could not intervene with the designer's inspiration.</p><br/><p>Previously, when Ning Xi had asked about Spirit, he did not mention much about Gong Shangze's situation but based on the current situation, he could not continue keeping it a secret.</p><br/><p>After he finished the call with Gong Shangze, Lu Tingxiao hesitated momentarily, but in the end, he still told Ning Xi about it.</p><br/><p>\"Earlier, Gong Shangze called.\"</p><br/><p>\"Ah! Ah Ze! What did he say?\" Ning Xi immediately asked.</p><br/><p>\"He wants to resign.\"</p><br/><p>\"What?\" Ning Xi's expression instantly changed. \"Why does he suddenly want to resign?\"</p><br/><p>Lu Tingxiao looked at her gravely. \"Actually, Shangze's situation in the past year hasn't been great. After you disappeared, he's been turning into a worse and worse state, until he fell into a bottleneck. It's been half a year since he couldn't come up with a design that he's satisfied with. Initially, I didn't want you to worry and get worn out, so I didn't immediately tell you. I wanted to wait till you've recovered a little, but now, I'm afraid you'll need to step in.\"</p><br/><p>\"How did this happen?\" Ning Xi massaged her temples, then she immediately said, \"I want to look for him right now!\"</p><br/><p>Lu Tingxiao revealed a helpless expression. He knew that she would definitely react like this upon finding out.</p><br/><p>Ning Xi observed Lu Tingxiao's tightly knitted brows and went over to hug him. She said with a gentle tone, \"Husband, don't keep treating me like I'm made of glass. This isn't acting. I don't need to use any physical strength or energy. I don't need to draw designs and I don't need to settle any accounts. I won't be worn out.</p><br/><p>\"Besides, I must finish what I started. Spirit is a collective effort of a lot of us. I didn't even say anything and ditched them to sleep for a year. Indeed, it's my fault. Since I'm already awake now, no matter what, I should explain things to my partners who've worked hard together with me. Ah Ze definitely won't reveal my situation to anyone outside. Plus, aren't you here too!?\"</p><br/><p>At last, Lu Tingxiao sighed, \"I'll go with you.\"</p><br/><p>In reality, when Ning Xi had said the first word, he was already bound to compromise.</p><br/>\n</div>"}