{"title": "Chapter 1826: Classy and Intelligent", "id": 1826, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1826-classy-and-intelligent", "volume_title": "Volume 19", "body": "<h1>Chapter 1826: Classy and Intelligent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1826: Classy and Intelligent</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Let's go and get it all back from this advert onwards.</p><br/><p>It was just a simple sentence, yet it instantly sparked a flame in Xu Tao's cold heart.</p><br/><p>When he saw that Xu Tao had recovered his spirit, Liang Feixing was relieved. \"My mission of mediating is done. I should get busy too.\"</p><br/><p>Now that Ning Xi was making a comeback, he still needed to prepare a series of public relations plans.</p><br/><p>Ning Xi nodded. \"If anything happens, contact me through the phone.\"</p><br/><p>The three of them discussed for a while, then they began to execute their plans separately.</p><br/><p>Xu Tao quickly made himself more like a presentable human, then he immediately brought Ning Xi to rush towards YLD's company branch in China.</p><br/><p>Being a spokesperson for a top international brand was no doubt something that every female artiste, who wanted to ascend to being gold-plated, would yearn for.</p><br/><p>Liu Xiaorou was now only a few huge brands ambassadorship and renowned awards away from leveling up, which was why he had spent so much effort to get this endorsement job for her.</p><br/><p>Because Liu Xiaorou was completely different from Ning Xi, Yi Xudong did not think highly of her. He was not willing to spend much energy on her either. You could say that he had really risked his old bones and fought for all of her opportunities.</p><br/><p>For this ambassadorship, he had gone back and forth with his thick skin and found many connections. All of the expenses for social niceties had been borne entirely by him too, but in the end, he had fallen to such a degree. How could he not have lost control of his emotions?</p><br/><p>He knew that this time, Starlight had done it deliberately. Previously, he had offended Starlight viciously, so the other party had long been waiting to catch him with the ultimate strike.</p><br/><p>...</p><br/><p>At the YLD company building.</p><br/><p>The person-in-charge of YLD, Parker, Liu Xiaorou, and Liu Xiaorou's new manager, Cheng Yibin, were conversing merrily in the office.</p><br/><p>Cheng Yibin said in an earnest tone, \"Sigh, now there are so many substance-less vases out there. There aren't many artistes with distinguished features and distinctiveness such as our Xiaorou. I'm not boasting. In China, we have a great saying that an elegant temperament comes from being knowledgeable. Well-known and profound brands such as YLD need someone as classy and intelligent as Xiaorou to be their spokesperson!\"</p><br/><p>Liu Xiaorou's appearance was not prominent. However, she exuded a very comforting, educated appearance like a rush of clear spring water in the giddy entertainment industry, which was also why Xu Tao had initially fancied her.</p><br/><p>Indeed, at last, after Liu Xiaorou had acted in a few classic roles because of her unique aura, she had attracted a huge group of diehard fans. It also proved that Xu Tao's judgment was spot on.</p><br/><p>Parker smiled and said, \"Haha, we also fancy this special quality of Miss Xiaorou's.\"</p><br/><p>Parker was clearly very satisfied with Liu Xiaorou. Although at first, the person who used this pretext to convince him was Xu Tao, this did not make a difference to him.</p><br/><p>As long as the results were the same, it would be fine. It did not matter to him who Liu Xiaorou's manager was changed to. Besides, Starlight was much stronger than Glory World, so Liu Xiaorou joining Starlight was instead more favorable for them.</p><br/><p>Cheng Yibin looked at Liu Xiaorou beside her. When she thought about Xu Tao's flustered and exasperated expression, she felt pleased on the inside. \"Director Parker, if there aren't any other problems, let's sign the contract today. I've already made reservations at the Grand Count Hotel to celebrate our wonderful collaboration this time!\"</p><br/><p>Parker nodded, then he flipped open the thick stack of contracts next to his hand. \"Of course, there's no problem. This is...\"</p><br/><p>He was speaking halfway when suddenly there was a knock on the door.</p><br/><p>The assistant apologetically pushed the door to enter. She walked up to Parker and seemed troubled.</p><br/><p>\"What is it?\" Parker asked in a lowered voice. He was a little annoyed about being disturbed.</p><br/>\n</div>"}