{"title": "Chapter 1828: True Capabilities", "id": 1828, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1828-true-capabilities", "volume_title": "Volume 19", "body": "<h1>Chapter 1828: True Capabilities</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1828: True Capabilities</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Liu Xiaorou also followed up. \"As far as I know, after Sis Youyou and I left, there wasn't really anyone with Bro Tao anymore. Even within the whole of Glory World, there aren't any decent artistes left…\"</p><br/><p>Parker was silent when he heard Cheng Yibin and Liu Xiaorou.</p><br/><p>He had to admit that what Xu Tao said hit him right in his weak spot. That sentence was simply impactful.</p><br/><p>After some time, Parker stood up before the two of them. \"Mr. Cheng, Ms. Liu, please wait here while I meet him. I'll be back as soon as possible.\"</p><br/><p>Cheng Yibin was distressed but he did not show it. Instead, he smiled and said, \"You're one considerate man, Mr. Parker. I believe you'll be able to explain enough for him to not come back to trouble us again.\"</p><br/><p>Cheng Yibin's expression darkened after Parker left in a hurry. He slammed the coffee table. \"Damn you, Xu Tao! Do you dare to play tricks with me now? It seems like I've been too easy on him! That damned thing!\"</p><br/><p>Liu Xiaorou comforted him, \"Don't worry, Bro Bin. He doesn't have anyone presentable under him, so even if he's able to talk to Director Parker, he'd just humiliate himself.\"</p><br/><p>Cheng Yibin had a cruel gaze. \"I'll make him pay after we sign the contract!\"</p><br/><p>…</p><br/><p>YLD's meeting room was designed with an artistic vibe, equipped with retro-styled colored glass, sofa with hand-stitched floral patterns, and a furry, white velvet floor carpet, whilst big camelia and peonies were blooming beautifully from a vase. The huge cupboard beside it had the whole series of their classic products lined up.</p><br/><p>Ning Xi had already taken off her sunglasses and mask at the moment. She was sitting on the sofa and flipping through an art book available there.</p><br/><p>Xu Tao did nothing but stare at Ning Xi like a slave guarding his treasure.</p><br/><p>He could not be blamed. Any man or just any person, in general, could never be able to avert their gaze away from Ning Xi.</p><br/><p>They did not wait long. Sounds of footstep came closer outside the door.</p><br/><p>The footsteps stopped right before the door. Parker opened the door with a cold and unhappy expression. \"Mr. Xu, what did you mean? You're the one who recommended me Liu Xiaorou. Even if she's not under you now, you shouldn't interfere…\"</p><br/><p>As Parker was talking angrily, the next moment he felt like his eyes had their own consciousness and was attracted to the figure on the sofa. His pupils contracted and he was in disbelief. \"My God... Ms... Ms. Ning…\"</p><br/><p>Xu Tao was not surprised at Parker's reaction at all, he shrugged, \"Director Parker, I'm not contradicting myself. I told you before that if you use Liu Xiaorou, you might be able to go in another direction and take some risks to win. This time…\"</p><br/><p>Parker understood almost instantly and his attitude changed completely. \"I'm really sorry. I was a little busy just now. Please wait for a little while.\"</p><br/><p>He turned around, opened the door, and hissed to the assistant, \"Go and prepare a new contract now!\"</p><br/><p>\"Huh?\" The assistant was taken aback.</p><br/><p>The director had just gone in for just a few seconds. What happened?</p><br/><p>At this moment, Xu Tao smirked with an indescribable feeling.</p><br/><p>He had really given it his all when he tried to convince Parker to use Liu Xiaorou, and now he just had to utter this one short sentence.</p><br/><p>With true capabilities unfolding before them, not all skills were needed.</p><br/>\n</div>"}