{"title": "Chapter 1832: Crash The Party", "id": 1832, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1832-crash-the-party", "volume_title": "Volume 19", "body": "<h1>Chapter 1832: Crash The Party</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1832: Crash The Party</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>In the car.</p><br/><p>\"Um, Ning Xi, about earlier...thank you. You actually didn't need to. I'm already used to it. Explaining to those people will only bring down your status,\" said Xu Tao gratefully.</p><br/><p>Ning Xi held the side of her head at an angle, not minding. \"It's fine. I just hate seeing others bullying my people.\"</p><br/><p>When Xu Tao heard this, tears suddenly welled up in his eyes. Bloody hell, it was just so nice to be riding on somebody's coattails!</p><br/><p>\"Who else is under you right now?\" Ning Xi nodded her head slightly and asked.</p><br/><p>Xu Tao sighed, \"Sigh, not many outstanding artistes. Just one B-lister, Qin Shuang. She's quite a hardworking girl, but I t's just that she's a little unlucky. She's been in the industry for 8 years. Those who entered around the same time as her have already become popular batch after batch. It's just her who isn't; she's always just one step behind.\"</p><br/><p>Ning Xi pursed her lips. \"Later on, I'll pull her up.\"</p><br/><p>Xu Tao was instantly overjoyed. \"That'd be great!\"</p><br/><p>Ning Xi browsed her phone for the gossip regarding Jiang Muye and Han Zixuan that was still being updated non-stop. She frowned and asked, \"How's it going on Jiang Muye's end?\"</p><br/><p>Xu Tao shook his head helplessly. \"Lei Ming says that he's still not cooperating at all. In fact, the situation is worsening. If these kind of things are dragged on too long and aren't clarified in time, it'll create an inherent impression to the fans. Later on, if he wants to clarify, it'll already be too tough...\"</p><br/><p>\"That picture of him and Han Zixuan, is it a still?\" Ning Xi asked, but her tone was very certain.</p><br/><p>Xu Tao nodded. \"It's a still from Chen Mian's new movie. Jiang Muye's was just a cameo, and that kissing scene back then was just an illusion of position.</p><br/><p>\"Because this movie subject matter is relatively sensitive, it's very hard to get it shown in theatres in the country. Chen Mian has prepared to secretly release it overseas, so they definitely cannot leak this ahead. Otherwise, once the news gets out, it'll definitely be blocked, then all of the hard work would be for nothing.</p><br/><p>\"Jiang Muye is quite loyal too. Although he's been scolded by so many people as a piece of trash, yet he's still holding on and not saying anything. Lei Ming and Liang Zi were initially discussing letting him apologize and then suppressing the matter first, but he's not willing to... Now, they can only refuse to budge...\"</p><br/><p>Ning Xi sighed softly and shook her head. With Jiang Muye's personality, there was no way he would apologize.</p><br/><p>Xu Tao probed, \"Ning Xi, your coming out of retirement this time is related to Jiang Muye too, isn't it? For this matter... You're going to...\"</p><br/><p>Actually, those who knew him well would realise that Jiang Muye had publicly gone against Han Zixuan with those foul words was all because of Zheng Anru's words at the press conference.</p><br/><p>All the old-timers in Glory World Entertainment knew how Han Zixuan had made her way to the top, yet in the end those people had said such shameless things in public!</p><br/><p>Ning Xi thought about it, then she asked, \"When's the next promotional period going to be for 'The World'?\"</p><br/><p>Even though Xu Tao had recently been muddleheaded and drunken, he still knew this information like the back of his hand, so he immediately answered, \"It's in two days. Because the last press conference was messed up by Jiang Muye, this time they have a larger venue and have actually invited all of the original cast of 'The World' movie who can make it to boost support. The movie king, Zhao Sizhou, the old actor, Feng Yibo... and I heard that even Ning Xueluo will be attending.\"</p><br/><p>Ning Xi nodded. \"Then, let's prepare a little. Let's go and join in on the fun too.\"</p><br/><p>Xu Tao's eyes lit up. It was exactly as he wished. \"You're saying that you'll steal the role back? Then, do we need to get Jiang Muye in on this too? I heard that they've given Jiang Muye an ultimatum. He has to give a public apology, otherwise they'll change the male lead! This time, we might as well get the roles of the male and female leads back too!\"</p><br/><p>When Ning Xi heard his suggestion, she raised her brows slightly and said faintly, \"Who said that I'm going to steal the role back?\"</p><br/><p>\"Ah? Aren't you?\" Xu Tao was confused. \"What are we going to do then?\"</p><br/><p>Ning Xi smiled. \"Obviously we're going to... crash the party.\"</p><br/><p>Xu Tao was speechless.</p><br/>\n</div>"}