{"title": "Chapter 1842: Continuous Brilliance", "id": 1842, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1842-continuous-brilliance", "volume_title": "Volume 19", "body": "<h1>Chapter 1842: Continuous Brilliance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1842: Continuous Brilliance</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Xu Tao's expression sunk. He was about to continue when Ning Xi shot Xu Tao a look. She gave him a consoling gaze, indicating that she knew what to do.</p><br/><p>When Xu Tao saw that Ning Xi looked at ease, he could only hold back for now. However, his back had tensed up and he was ready to handle an emergency at any time.</p><br/><p>However, even if he had already been vigilant enough, he never would have thought that the other party would be shameless to this extent...</p><br/><p>Earlier, that staff who had sparred with Han Zixuan held a pike each in both hands. He stood far away and then actually tossed one of the pikes towards Ning Xi with force...</p><br/><p>An average person would definitely have not been able to catch that immense force of a toss. In fact, by reflex, they would dodge it in a sorry manner.</p><br/><p>It was clear that this was the effect that the other party hoped to achieve. The cameramen were probably already ready to capture the shot of Ning Xi embarassing herself...</p><br/><p>Xu Tao was so mad that he could puke blood. Just as he was about to rush up and stop the pike, he saw that Ning Xi did not even blink. She moved back slightly to dodge, then with a slim and fair hand, she steadily caught the pike.</p><br/><p>Through the screen's magnification, all the fans off-stage could clearly see the speed of that pike, and when the spike was caught deftly by the girl's hand, the pike had violently trembled.</p><br/><p>\"Wow!\"</p><br/><p>The place was instantly filled with sounds of surprised cries and there was applause all around.</p><br/><p>Zheng Anru's expression darkened. It was just catching a pike. What were they shouting for, making a fuss about nothing!?</p><br/><p>The staff's brows furrowed. There was a flash of surprise in his eyes. After he received Zheng Anru's glare, he immediately raised the pikes in his hand and attacked Ning Xi swiftly.</p><br/><p>Earlier, when he had sparred with Han Zixuan, Zheng Anru had already bragged that he was a professional martial arts actor. These past six months, he had been training Han Zixuan, and he did indeed have some skills up his sleeves.</p><br/><p>When Ning Xi saw that he was aggressively coming for her, she stood where she was and the pike spun in her palm like it had a life of its own, then with a bam, it met the other person's pike and sparks flew.</p><br/><p>It was only a short sparring session, and the martial arts actor instantly knew that Ning Xi was not like Han Zixuan who was attractive but lacked substance. Instead, she was the real deal, thus he suddenly did not dare to lower his guard.</p><br/><p>At the start, he was still thinking about how to embarass her without batting an eyelid, and to do so subtly, but in the end, he already had no mood to think about these tricks at all. He could only go all out to handle her styles that were becoming increasingly tricky...</p><br/><p>Damn it!</p><br/><p>This woman could actually handle the pike beautifully. Previously, he did not believe it when Guo Qisheng had said that Ning Xi had personally executed all the stunts in the movie, but now...</p><br/><p>Apart from crying out in alarm from time to time, all of the fans off-stage and the hosts had fixed their eyes on them while holding their breaths. It was so intense that they did not even want to blink as if before them was not a bedazzling stage but a battlefield enveloped in flames of war, like it was not a performance, but a real battle to the death.</p><br/><p>Finally...</p><br/><p>With a clang, the girl hit the pike in the staff member's hand mercilessly to the ground.</p><br/><p>In that instant, all of the fans present emotionally started to shriek and cry, then they whistled non-stop.</p><br/><p>\"Oh! Ning Xi is so awesome!\"</p><br/><p>\"Amazing!\"</p><br/><p>\"That was just too brilliant! I was so tensed that I'm breaking out in cold sweat!\"</p><br/><p> ...</p><br/><p>When she saw the fans' reactions, Han Zixuan clenched her teeth. Her face remained smiling as she clapped, while Zheng Anru's expression that was hidden in the shadows already seemed extremely terrible.</p><br/>\n</div>"}