{"title": "Chapter 1862: Warning", "id": 1862, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1862-warning", "volume_title": "Volume 19", "body": "<h1>Chapter 1862: Warning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1862: Warning</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"No wonder! When I saw that woman, I just knew that she was the same as those women who want to be playgirls recently! She wants to mingle and make connections!\"</p><br/><p>\"What place does she think this is? All of us ushers have high academic qualifications, and we've gone through strict training. Does she think she could mix in with the crowd with her looks and figure?\"</p><br/><p>Female receptionists like them had incredible contempt for women who wanted to steal their livelihoods. In addition to that, they spoke very crudely too.</p><br/><p>Of course, to Zheng Minjun, and especially Ning Xueluo, such words were pleasing.</p><br/><p>\"If she's really here to apply for a job, don't use her at all costs! Don't dirty the Heavenly Spring Resort's boundaries,\" said Zheng Minjun indistinctly.</p><br/><p>\"Definitely not. Rest assured. Later, we'll go and warn that woman! She won't agitate all the noble guests!\" The two of them responded righteously.</p><br/><p>...</p><br/><p>Very soon, the two receptionists led Zheng Minjun and Ning Xueluo in, then they returned.</p><br/><p>They saw that Ning Xi was still nearby with no intentions of leaving.</p><br/><p>The two of them exchanged a glance and then walked over with hostile expressions.</p><br/><p>When they saw Ning Xi's appearance at a closer distance, the two of them were instantly stunned.</p><br/><p>The shock of seeing her up close was far more unexpected than seeing her from afar. The girl's fair skin was like a first-rate fine tallow jade; even her pores could not be seen. That aura, that appearance, and that figure could not even compare to the many heiresses from family backgrounds of high officials and wealthy families.</p><br/><p>No wonder she thought she looked familiar from earlier...</p><br/><p>She was indeed a huge star! Was this not the female lead in the extremely popular movie, \"Nine Realms\", Ning Xi?</p><br/><p>They would never have thought that Ning Xi was a thousand times prettier in real life than on television. Even when she had not appeared on the big screen for over a year, not only had her looks and figure not suffered any damage, she looked even better than before.</p><br/><p>They were afraid that this woman... was not abandoned. Instead, with this looks of hers, she was not willing to be just a mistress. She probably wanted to continue climbing upwards!</p><br/><p>As beautiful and as popular as she once was, she was just an outdated actress with a lowly status. Was she thinking about being a high official's wife?</p><br/><p>A person who was never content was like a snake trying to swallow an elephant. What wild fantasies!</p><br/><p>Among the women who came to apply for a job at the resort, they hated those from the entertainment industry the most because that sort seemed to have the most tricks. T, they were also the biggest threat to them.</p><br/><p>\"Excuse me, this is a private clubhouse. You're not allowed to visit as you wish!\" One of the female receptionists did not cover up the way she sized Ning Xi up as she spoke to her in an incredibly hostile tone.</p><br/><p>\"Miss, if you're here to apply for a job to be a waitress, then I'm very sorry. Recently, our Heavenly Spring Resort isn't lacking manpower, so you can try another place,\" said the other one.</p><br/><p>A gorgeous but outdated female star, who had even been taken as a mistress, was there at the Heavenly Spring Resort where influential officials gathered. Did they have to ask? She was definitely looking for a new target!</p><br/><p>Just thinking about it made them feel disgusted!</p><br/><p>\"Apply for a job...?\"</p><br/><p>Ning Xi was stunned. She did not whether to laugh or cry. Did she look like she was looking for a job?</p><br/><p>One of them looked at the time on her phone and said impatiently, \"Stop pretending. We've seen a lot of people like you. Quickly leave on your own, otherwise, if we still see you walking around on your own, it won't be just a warning!\"</p><br/><p>They still had to go in and attend to the important guest. They did not want to waste their precious time here.</p><br/><p>This woman had walked around alone for such a long time, so clearly, she did not have the right social connections and had come to try her luck. The management definitely would not recruit such people.</p><br/><p>Receptionists like them had references to ensure that their family background and identities were acceptable.</p><br/>\n</div>"}