{"title": "Chapter 1866: Apologize In Front of Everyone", "id": 1866, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1866-apologize-in-front-of-everyone", "volume_title": "Volume 19", "body": "<h1>Chapter 1866: Apologize In Front of Everyone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1866: Apologize In Front of Everyone</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Li You quickly walked over. \"Linlang, I'm really sorry. This was a misunderstanding! If I knew this girl was your family's Xiao Xi, even if you lent them a hundred guts, they wouldn't have dared to say such things!\"</p><br/><p>Li You did not know how these two girls had been possessed to utter such offensive words, but now the priority was to quickly calm Meng Linlang's anger and not to continue complicating things, causing a larger ruckus.</p><br/><p>\"You two! Quickly come over and apologize to Miss Xiao Xi!\" Li You was full of anger when she saw the two of them.</p><br/><p>The receptionists obviously did not dare to say that they thought Ning Xi was there to apply for a job because they were jealous and afraid of their livelihoods getting stolen. More so, they did not dare to say that it was Zheng Minjun who had told them that Ning Xi was an outdated actress. Otherwise, they would not only offend Meng Linlang, but they would also offend Zheng Minjun, so they could only apologize profusely.</p><br/><p>\"Sorry, Madam Zhuang! Sorry, Miss Xiao Xi!\"</p><br/><p>\"Sorry! We really didn't mean it!\"</p><br/><p>...</p><br/><p>Li You said without hesitation, \"Both of you, go to the finance department yourselves and settle this month's pay. You don't need to come back tomorrow!\"</p><br/><p>When they heard Li You's words, the two of them instantly turned pale. \"Madam Li, we...\"</p><br/><p>To send them to the resort, their families had spent a huge amount of money and pulled many strings, yet in the end, to have lost their livelihoods just like that, and to be even personally dismissed by Madam Li would mean that their reputations were ruined.</p><br/><p>They wanted to beg, but when they received Li You's sharp gaze, they instantly knew that if they spoke further, the consequences would only be even more severe, so they could only retreat looking as white as sheets.</p><br/><p>Xiao Cai watched from the side for a long time. Only after she confirmed that she was off the hook, she quickly retreated too.</p><br/><p>After she handled the two girls, Li You smiled again and walked over to cling to Meng Linlang's arm. \"Linlang, I've handled those people. Don't be angry anymore. We've finally managed to gather together this time! This temper of yours... Don't you know how to give me some face in front of so many people?!\"</p><br/><p>Li You looked slightly aggrieved.</p><br/><p>Meng Linlang had been really mad earlier. On the other hand, a very important reason for her fury was that she wanted to take the opportunity to set up a prestigious reputation for Ning Xi.</p><br/><p>At that moment, she saw that her goal had been somewhat achieved. Thus, naturally, she would not be menacing. Her beautiful eyes shot her best friend a sidelong look and said, \"Ah You, you understand my temper. It's also because it's you I'm talking to. If it were someone else, do you think I would let things go so easily?\"</p><br/><p>Li You laughed in spite of herself. \"Yes, yes, yes! I know you've already been gentle enough. Thank you for giving me face! Today's matter has indeed been because we at the Heavenly Spring Resort were bad hosts!\"</p><br/><p>The Heavenly Spring Resort was the Li family's property after all. They were not just the banquet host that day, but the management too, so this responsibility could not be pushed aside.</p><br/><p>After Li You finished, she quickly changed the topic and looked like her breath was taken away as she pulled Ning Xi, who was beside Meng Linlang, to check her out. \"Linlang, I've heard you talk about it often, and I thought you were exaggerating, but today when I see her for myself, I know that you haven't been exaggerating! In fact, you've been too humble! Her looks and her aura among all of the heiresses... I really can't find another one!\"</p><br/><p>Earlier, she had been rather far away, plus Ning Xi had been blocked by the few people, so she did not get a good look. However, right now, in one glance, she felt that the incident was odd.</p><br/><p>The two receptionists had rather precise judgment. How did they randomly determine that Xiao Xi was here to apply for a waitressing job? Even more absurd was that they even had the guts to say nonsense like she was an actress out to prostitute herself.</p><br/><p>Even if Xiao Xi was an actress, with her background, how could she have done those things?</p><br/><p>At this moment, in the same room, apart from those ladies and wives, the people who were most shocked were none other than Ning Xueluo and Zheng Minjun.</p><br/><p>Zheng Minjun already had a bad feeling the moment Meng Linlang appeared. When she heard Meng Linlang say \"I, Meng Linlang's niece\" in front of everyone, an explosion went off in her head. She was dumbfounded.</p><br/>\n</div>"}