{"title": "Chapter 1877: The End Results Will Not Change", "id": 1877, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1877-the-end-results-will-not-change", "volume_title": "Volume 19", "body": "<h1>Chapter 1877: The End Results Will Not Change</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1877: The End Results Will Not Change</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>\"She's just a fallen woman now and she wants to make a comeback? And she wants to get on top of you? Dream on! Just be obedient and make it a stepping stone! So what if that vixen can entice her fans? We got her fans the first time. We can do it the second time! Rest assured, the fans will surely come back to your side and will be even more loyal to you from now on!\" Zheng Anru spoke confidently as if she was experienced.</p><br/><p>Han Zixuan had never regarded Ning Xi as her opponent and seeing that she was on the advantageous side, she was totally relaxed. \"Let's do some fan service later!\"</p><br/><p>\"Don't worry. I've been preparing for it. The charts for the most popular star is starting soon. We'll ride on the waves and shoot for the stars. Let Ning Xi see who's the top dog of the entertainment industry!\"</p><br/><p>Han Zixuan did not seem to mind. \"What's there to prepare? Do I have to fight with her?\"</p><br/><p>\"Of course not, the end results won't change. It'll be our triumphant victory!\"</p><br/><p>…</p><br/><p>In Deer Town.</p><br/><p>Liang Feixing was worried sick with the nasty rumors and criticisms flying around.</p><br/><p>If they could not come up with an acceptable reason for the fans, everything they had done up till now would be wasted and Ning Xi's future would be extremely tough.</p><br/><p>Just the assumption of her being a mistress and having retired would be enough to destroy her.</p><br/><p>In the little garden, Liang Feixing paced back and forth.\"Depression? Overseas study? Change of career? Even if it's marriage... No matter the reason, I can't explain the whole year of disappearance and not tell anyone about it!\"</p><br/><p>He understood that if they did not have a powerful reason, this would sting them forever.</p><br/><p>Liang Feixing sighed as he carefully glanced at Ning Xi on the rattan chair.</p><br/><p>Actually, even he did not know the real reason Ning Xi had vanished until now.</p><br/><p>The Netizens were speculating that she felt guilty, which was why she left without saying a word. Some even suspected that she was a cold person and had never cared about her fans at all. If not, she would not have just stayed hidden with so many people worried sick about her.</p><br/><p>Besides Ning Xi, Jiang Muye was also present, except that he had taken a shower. His hair and his outfit were still similar to that of a homeless old man. He did not care about his image at all and even Lei Ming had given up on him and he just hoped that he would not cause any trouble for now.</p><br/><p>Jiang Muye turned over and looked at Ning Xi. The girl was thinking about something intensely and she looked troubled.</p><br/><p>Jiang Muye rested his chin on his palm. \"Why are you thinking so much about this? Just tell them the truth! You've been in a vegetative state for the past year, so how could you have appeared and talked?\"</p><br/><p>\"W-What!\" Liang Feixing was shocked when he heard that. \"Ning... Ning Xi, you were in a vegetative state for the past year?!\"</p><br/><p>He somewhat guessed it might be because of health issues, but he did not expect it to be so severe. Taking into account Ning Xi's relationship with the Boss, what had happened in between might be really complicated…</p><br/><p>This was probably the reason why they had not announced the real reason for Ning Xi's retirement.</p><br/><p>As countless thoughts passed through Liang Feixing's mind, there were sounds of solid footsteps from behind him.</p><br/><p>Liang Feixing quickly turned around. \"Boss!\"</p><br/><p>Lu Tingxiao handed him an envelope and said, \"Release this.\"</p><br/><p>\"This is...\" Liang Feixing took it hesitantly.</p><br/><p>He opened the envelope and was thrilled. \"The records and diagnosis reports from the Imperial Military Hospital! With this, there shouldn't be any problem now!\"</p><br/>\n</div>"}