{"title": "Chapter 1873: Too Breathtaking", "id": 1873, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1873-too-breathtaking", "volume_title": "Volume 19", "body": "<h1>Chapter 1873: Too Breathtaking</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1873: Too Breathtaking</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>At night, at History.</p><br/><p>On the way home, Ning Xueluo got a call from the office.</p><br/><p>She had just left Madam Li's gathering feeling annoyed and perplexed when the company called with bad news.</p><br/><p>Spirit, which had been silent for an entire year and had almost vanished from the Chinese fashion market after being defeated by them, had suddenly gone viral because of that white qipao Ning Xi wore at the promotional ceremony of \"The World\".</p><br/><p>Even more tricky was that riding this wave, Spirit had announced a new line of designs that would be released soon without warning. In fact, this set that was still in the pre-order stage was about to sell out.</p><br/><p>\"What 'Back To The Origins'?! Clearly, it's talent being exhausted and the designer doesn't even know how to design anymore! How could this rubbish without any highlights or unique qualities have sold out?\" The assistant design director was so furious that he broke out into a string of curses.</p><br/><p>\"It's all because of the celebrity effect, isn't it? Wasn't that white qipao that Ning Xi wore the other day lacking any unique characteristic, yet the way she wore it...\"</p><br/><p>The designer who spoke seemed to have wanted to say \"so breathtakingly\", but then he caught sight of David from the corner of his eyes and suddenly changed to say stiffly, \"was just so-so! I think it's all just been hyped up!\"</p><br/><p>One of the younger male designers said weakly, \"Actually, I think... it's all because everyone's tired out by the previous Oriental aesthetics that have been so colorful with excessive ornaments. That's why 'Back To The Origins' suddenly exploded in popularity...\"</p><br/><p>Inside the meeting room, the atmosphere was stagnant and there was a moment of silence.</p><br/><p>Then, someone said, \"If they can do it, so can we! Spirit's horrible designs can go viral all they want. Besides, we have the Big Boss David! They're just a step ahead of us.\"</p><br/><p>David's expression sunk and his gaze coldly skimmed the person who spoke. \"Are you telling me to follow Spirit's tide?\"</p><br/><p>The person suddenly stiffened and he quickly said, \"Of course, that's not what I meant... Boss David, you've always been a pioneer that has stood out in this industry. You've always been copied and never been surpassed. You don't need to follow someone else's trend!</p><br/><p>\"What I'm saying is that guy's designs are junk! This time, it's only because we want to seize every opportunity, so we don't have to care. Everyone will just think that that style of his is fresh for now, but it definitely won't last for long!\"</p><br/><p>\"That's right! Wasn't it like this before too? That guy definitely won't be able to hold on any longer!\" The others echoed.</p><br/><p>David's expression still had not softened. Even though the issue this time was not that huge, it still left him very miserable.</p><br/><p>At the head of the table, Ning Xueluo's face was cloudy.\"Even though it's not a very severe problem, we can't let our guard down and ignore them. Today, you must come up with a plan to resolve this for me. I won't allow anything to happen to History!\"</p><br/><p>She already had enough of problems recently!</p><br/><p>Ning Xi's appearance was like a curse. All the bad things came one after another...</p><br/><p>Ning Xueluo clenched the pen in her hand and looked at the night scene outside her window. There was a flash of bone-chilling coldness in her eyes.</p><br/><p>She could almost imagine how Zheng Minjun's attitude towards her would change in the days to come. In fact, it would become worse.</p><br/><p>She had spent a whole year's effort in stabilizing her position in the Su family. Today, at the gathering, it had been completely destroyed.</p><br/><p>When David heard this, his gaze was broody as he looked at the assistant director of design beside him.</p><br/><p>When the assistant director received the hint, he adjusted his spectacles and looked at David. \"Boss, I disagree. Now, how could you be following his style?! You've already discovered that the extravagant market was saturated and you were ready to change your style. You're even almost done with your designs. Just because you haven't completed them, you didn't announce to everyone. I can't believe that we've let those rubbish designs that were probably rushed out in a few days to get ahead!\"</p><br/>\n</div>"}