{"title": "Chapter 1871: Soul Mate", "id": 1871, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1871-soul-mate", "volume_title": "Volume 19", "body": "<h1>Chapter 1871: Soul Mate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1871: Soul Mate</p><br/><p>Translator: EndlessFantasy Translation Editor: EndlessFantasy Translation</p><br/><p>Actually, Meng Linlang had several regrets.</p><br/><p>If they had taken Xiao Xi home sooner, they would have arranged a suitable marriage for her.</p><br/><p>From an objective point of view, Lu Tingxiao's status was one of the best.</p><br/><p>However, that was also what worried her. With Xiao Xi's personality, she might not be able to face such a huge and complex family on her own.</p><br/><p>By comparison, the Li family was a suitable one.</p><br/><p>Their position was stable enough for the Zhuang family. It was not too high up for Xiao Xi to feel too much pressure.</p><br/><p>Most importantly, the family relationship within the Li family was much simpler.</p><br/><p>The Li family was the richest merchant in Province S and Li You was the only daughter of the Li family. Lu Muyan was Li You's only son as well. Not only did he inherit the career as a diplomatic officer from his father, he also had the strong financial support of the Li family, smoothening things over the path of his career.</p><br/><p>Coincidentally, both his parents had the same surname Li. Li You's family was really pleased with their grandchild that had the same surname, so the whole family was really supportive of him.</p><br/><p>If Ning Xi were to be married to them, she would not need to worry about any complicated relationship matters in the future.</p><br/><p>Moreover, given her close relationship with Li You, Xiao Xi would not even need to worry about her mother-in-law.</p><br/><p>In just a short amount of time, Meng Linlang had mentally gone through the whole of the Li family.</p><br/><p>Unfortunately…</p><br/><p>What she could do now was to help Ning Xi to gather more connections so that she would be able to utilize them if she ever needed.</p><br/><p>Of course, if worse came to worst, Xiao Xi could always go back to the Zhuang family.</p><br/><p>…</p><br/><p>At the Heavenly Spring Resort, halfway up the mountain.</p><br/><p>The Heavenly Spring Resort was called \"Heavenly\" was because there was a renowned spring fountain in the mountain. Rumor had it that the spring water could help chase away bad luck and make one healthy.</p><br/><p>Being the tour guide, Li Muyan started from the origins of the resort and how it was formed, the origin of the name, the related events and people, up until the history of the whole of Imperial. The way he explained it was much more professional than a professional tour guide.</p><br/><p>Ning Xi was focused. She had been staying in Imperial for several years, but after a chat with Li Muyan did she then realize that she did not know that much about the country at all.</p><br/><p>Lu Muyan saw how focused Ning Xi was. She gazed around the sky and the trees, and he…</p><br/><p>The man looked like he was really talkative at the moment, but his palms had started sweating.</p><br/><p>His heart was beating totally out of his control.</p><br/><p>He was not focused on being a tour guide, and he had to keep talking to stay calm.</p><br/><p>He had been following his father around since he was a child. His mother's family really doted on him and everything he wore and ate was the best.</p><br/><p>The girls he came into contact with were daughters from prestigious families and even princesses…</p><br/><p>His experience forged his extremely picky taste, and especially on the matter of a partner, he never had much interest in it.</p><br/><p>The partner he wanted was someone who could touch his soul, not the people who went through the standardized education of their family. All of them looked like identical dolls to each other.</p><br/><p>It was just a glance and he did not even know much about her, but he was deeply attracted by her aura.</p><br/><p>\"You didn't grow up here?\" Li Muyan asked as he observed that she was not very familiar with most things that any person in Imperial would know.</p><br/><p>Ning Xi shook her head. \"Before I was 18, I was living in a town in Chang Chun City.\"</p><br/>\n</div>"}