{"title": "Chapter 1897 - The Huge Temptation of Benefits", "id": 1897, "volume": 19, "url": "http://boxnovel.org/hidden-marriage-chapter-1897-the-huge-temptation-of-benefits", "volume_title": "Volume 19", "body": "<h1>Chapter 1897 - The Huge Temptation of Benefits</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter1897thehugetemptationofbenefits\">Chapter 1897: The Huge Temptation of Benefits</h3><br/><p><strong>Translator:</strong> EndlessFantasy Translation <strong>Editor:</strong> EndlessFantasy Translation</p><br/><p>Late at night, at the Su residence.</p><br/><p>After Su Yan left Imperial University, he did not delay another second to get home.</p><br/><p>In the living room, Zheng Minjun had just finished talking on the phone with another lady she shared a good friendship with and was about to go to sleep when she heard a car engine rumbling outside the door. Then, with the shuffle of footsteps, she saw the return of her son who had been away for several days on a business trip.</p><br/><p>When she saw her son, Zheng Minjun instantly smiled. “Su Yan you’re back! Why are you so late? Shouldn’t you have been home by yesterday?”</p><br/><p>Su Yan did not answer. “Where’s Father and Xueluo?”</p><br/><p>“Your father’s in the study room upstairs. Xueluo seems to have some social event tonight. She’s not back yet!”</p><br/><p>“Mmm.” Su Yan nodded slightly, then he walked upstairs. “I’ll go look for Dad. I have something to discuss with him.”</p><br/><p>Zheng Minjun had been going around to get information about Ning Xi and the Zhuang family for the past few days. After waiting for Su Yan’s return for so many days, she wanted to first ask about her son’s opinions, but based on Su Yan’s hurried manner, he seemed to have an emergency, so she could only temporarily set it aside. “Oh, okay… quickly go then!”</p><br/><p>In the study room.</p><br/><p>Under the table lamp, Su Hongguang was solemnly looking at a land tendering file. This land was extremely important to their corporation, but if there were no inside connections at the top level, it was almost impossible for them to fight with the other two companies.</p><br/><p>Sometimes lacking in that bit of connection would make it extremely difficult to achieve most things in their industry.</p><br/><p>Su Hongguang’s eyes turned dark. He could not help but think about his wife’s words from the other day…</p><br/><p>Su Yan and Xueluo had been married for so long after all. The Su family and the Ning family were now inseparable, and a divorce would cause a butterfly effect, which was why he had told Zheng Minjun not to be impulsive.</p><br/><p>However, at this moment, if Su Yan could have married Ning Xi, the huge amounts of benefit that she could bring, as steady as he was, would be enough to waver things.</p><br/><p>If he could really get connected to the Zhuang family through marriage, then all the trouble brought by a divorce would just be a minor issue…</p><br/><p>Su Hongguang was deep in his thoughts when suddenly the familiar sound of his son’s voice broke his reverie.</p><br/><p>“Father.”</p><br/><p>It was then that Su Hongguang returned to his senses. He looked up towards his son and said, “You’re back.”</p><br/><p>Su Yan nodded, his expression a little unusual. “Father, there’s something I want to discuss with you.”</p><br/><p>When he saw Su Yan behaving so oddly, Su Hongguang sat upright. “Sit down then. It’s quite late. What is it?”</p><br/><p>Su Yan did not sit down. Instead, he remained standing with a straight back before the study desk. As if he had just determined something, he then said to Su Hongguang with a confident gaze, word for word, “Father, I’m planning to divorce Xueluo.”</p><br/><p>The instant he said that, Su Hongguang’s expression shifted to become startled. At the same time, darkness flashed in his eyes.</p><br/><p>Su Hongguang suppressed all sorts of disorderly thoughts in his mind before he said with an extremely solemn expression as he looked at son, “Do you know what you’re saying?”</p><br/><p>“Father, I know that you and Mother will definitely oppose this, and you definitely won’t understand my impulsive and unreasonable actions, but… about this… I’m definitely not acting rashly. I’ve gone through careful deliberation. I’ve thought about it for a whole year! I’ve already made my decision!” Su Yan’s tone was unyielding.</p><br/><p>Instead of saying that he was there to discuss it with him, he should have just said that he was there to inform him.</p><br/><p>If it had been before he found out about Ning Xi’s identity, Su Hongguang would definitely be extremely angry to hear Su Yan calling for a divorce.</p><br/><p>Yet…</p><br/><p>Everything was a little different now…</p><br/>\n</div>"}