{"title": "Chapter 1907 - If I Get Serious", "id": 1907, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1907-if-i-get-serious", "volume_title": "Volume 20", "body": "<h1>Chapter 1907 - If I Get Serious</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter1907ifigetserious\">Chapter 1907: If I Get Serious</h3><br/><p><strong>Translator:</strong> EndlessFantasy Translation <strong>Editor:</strong> EndlessFantasy Translation</p><br/><p>The male stars had to vie for the “Most Popular Male Artiste”, “National Male Idol”, “National Husband”, “Male Artiste With The Most Potential”, and the “Most Desired Male Artiste To Sleep With” categories.</p><br/><p>The main categories for the female stars would be “Most Popular Female Star”, “National Goddess”, and the “Female Artiste With The Most Potential”.</p><br/><p>The “National Husband” and “Most Desired Male Artiste To Sleep With” categories were just for kicks, but since it was rather sensitive for the females, they did not include it and used the “National Goddess” ranking to cover them all.</p><br/><p>So, besides the “Most Popular Female Artiste”, the “National Goddess” category carried substantial weight, no less than the “Most Popular Female Artiste” one.</p><br/><p>Lei Ming analyzed, “With the current ranking, Ning Xi is in the fourth spot. The top two are both people from Starlight.</p><br/><p>“The first is Han Zixuan, while the second is Yin Youyou, who was under Xu Tao before. The third one is someone from Speedy.</p><br/><p>“The “National Goddess” ranking isn’t looking good as well. Han Zixuan is leading the top spot with votes thrice as many as the runner-up at the moment.”</p><br/><p>Jiang Muye’s expression darkened as he kept quiet.</p><br/><p>Lei Ming continued, “Starlight probably thought that they can’t stop you anymore, so they didn’t put much effort on your side this time, but they probably didn’t expect you to be so tough to leave them with nothing.”</p><br/><p>Lei Ming paused, “However, as for Han Zixuan, since so many things have happened just recently, they would surely snap the ranking up because Han Zixuan was humiliated by Ning Xi.</p><br/><p>“If Ning Xi just stole the top spot away the moment she came back, it just means that Han Zixuan’s popularity is way below Ning Xi’s who just came back out of retirement. While this ranking might seem not important and be just for show, the influence that stems from the discussion of this ranking can affect a whole lot!”</p><br/><p>Jiang Muye laughed coldly like he expected it. “So, Starlight would do anything to help Han Zixuan to keep these two rankings!”</p><br/><p>Lei Ming nodded. “That’s right, and you know Glory World isn’t in the best of state. If the whole of Starlight decide to help Han Zixuan to get this, it wouldn’t make any difference even if we did anything! The gap is too big!”</p><br/><p>No matter how powerful Ning Xi’s comeback this time was, or how successful the press conference went, her spot could not overtake Han Zixuan’s.</p><br/><p>“Go and tell Xu Tao that I’ll pay for Ning Xiao Xi’s vote!” Jiang Muye growled angrily.</p><br/><p>Lei Ming was trapped between laughter and tears. “You don’t get it. It’s not about the money. The amount of votes we can get in private is very limited. Moreover, you have to ask Ning Xi’s opinion, don’t you?”</p><br/><p>Jiang Muye took up his phone and called Ning Xi right away.</p><br/><p>“Hey, Ning Xiao Xi!”</p><br/><p>“Hey, my nephew, looking cool today!” Ning Xi teased him over the phone. Obviously, she had seen his fan meeting.</p><br/><p>Jiang Muye was really angry at first, but the fire within him extinguished when he heard Ning Xi’s teasing. He replied cheekily, “Of course! If I get serious, I’ll be the coolest one around! Wait, no… What the heck did you call me just now?”</p><br/><p>Jiang Muye turned to avoid Lei Ming and lowered his voice to say through clenched teeth, “What the heck are you calling me!? I’m talking serious business with you right now!”</p><br/>\n</div>"}