{"title": "Chapter 1929 - On The Rise", "id": 1929, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1929-on-the-rise", "volume_title": "Volume 20", "body": "<h1>Chapter 1929 - On The Rise</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Over the phone came the voice of Liu Wenliang, who was just slightly calmer than the frantic Zheng Anru. “It’s not rigged… Female artistes in the male artiste list or male artistes appearing in the female artiste’s list is definitely possible.</p><br/><p>“A lot of categories were available for both genders. Apart from the exception of the newcomers’ category, the others are using the same nomination list.</p><br/><p>“In the past, there’ve been fans who voted that way because they thought it was fun or just wanted to pull a prank, but votes like these were very, very few. It’s never affected the final results before, but this time…”</p><br/><p>“But they can’t do this! It’s nonsense! Don’t the organizers care?” Zheng Anru said angrily.</p><br/><p>Liu Wenliang then replied, “In the rules and regulations, there aren’t any that prohibits this. The organizers probably left it this way to make things more fun!”</p><br/><p>“Contact CEO Wang. Tell him to pressure the organizers! Accuse her of cheating! Or just say that she’s buying votes! Make her lose her spot in all the rankings! I don’t believe there’s no way to counter her!”</p><br/><p>Before the issue of Ning Xi dominating the female artistes’ ranking was solved, another problem had cropped up with the male artiste’s ranking. Zheng Anru was thoroughly enraged.</p><br/><p>Liu Wenliang fully understood what the organizers were thinking. Things were not as simple as Zheng Anru thought, but since it had come to this point now, there was no harm in trying.</p><br/><p>The ranking this time was definitely important, even for him personally.</p><br/><p>If things went wrong again, he would be the first one to take the hit.</p><br/><p>Wang Haojun and Ning Xueluo had been invited to the event tonight. Ning Xueluo was busy with Su Yan’s matter and was not present, but Wang Haojun was there in the VIP area.</p><br/><p>He had witnessed what happened.</p><br/><p>He did not need Liu Wenliang’s reminder and had already gone towards the backstage secretly.</p><br/><p>Wang Haojun lit up a cigarette for Qin Zhen as he acted like an old buddy and put his arms over the man’s shoulders. “Producer Qin, having a female artiste on the male artiste list? Isn’t this a little too nonsensical?”</p><br/><p>As the main producer of Entertainment’s Light and the head of Night of Starlight, Qin Zhen’s eyes turned a little wary when a certain someone approached him.</p><br/><p>It was not difficult to guess Wang Haojun’s intentions, so he replied, “CEO Wang, the rules for the rankings have been the same every year. I’m pretty sure you know that while nothing like this happened in the past years, the rules allow it…”</p><br/><p>The “Night of Starlight” had reached a new height and popularity thanks to Ning Xi. He was wholly enjoying it, so why would he put a stop on this?</p><br/><p>In the end, there were no friends forever in this industry. Long live benefits!</p><br/><p>Wang Haojun was able to guess what the sly fox in front of him was thinking, but as he was pressed for time, he clenched his teeth and flashed him a number with his fingers. “Remove Ning Xi from all the ranking in the name of violating the rules! After it’s done, I’ll give you this figure!”</p><br/><p>Qin Zhen’s eyes brightened a little when he saw Wang Haojun’s hand, and he was obviously shaken.</p><br/><p>However, as he was hesitating, he saw the real-time ranking through a crack in the door that was not completely shut.</p><br/><p>He did not even know about it, so he was shocked when he found out.</p><br/><p>In the brief moment of exchange with Wang Haojun, Ning Xi had rushed her way into the top five in the male artiste list. She had reached top three in the “Most Desired Male Artiste To Sleep With” category, and it was still rapidly on the rise!</p></div>\n</div>"}