{"title": "Chapter 1931 - Tired Of Me?", "id": 1931, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1931-tired-of-me", "volume_title": "Volume 20", "body": "<h1>Chapter 1931 - Tired Of Me?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Before Wang Haojun could say anything, Qin Zhen quickly went away with the excuse of being busy.</p><br/><p>“Producer Qin, Producer Qin… Wait… Damn it!”</p><br/><p>Wang Haojun did not expect this.</p><br/><p>Qin Zhen had already been rattled just now, yet after a phone call, his attitude changed and he was determined to follow the rules.</p><br/><p>Wang Haojun kicked the wall in anger.</p><br/><p>Damn it! What happened?</p><br/><p>Glory World had already fallen, so what else could have affected Qin Zhen’s decision? Or maybe his higher-ups predicted something and had warned Qin Zhen beforehand?</p><br/><p>Objectively speaking, the matter this time was really troublesome.</p><br/><p>Wang Haojun glanced over at the ranking behind him and his pupils shrunk.</p><br/><p>Ning Xi had already reached the top three for the three male artiste categories!</p><br/><p>The fans were all asking people to vote for Ning Xi on the streaming sites.</p><br/><p>The votes came in from places they could not see, including the huge number of fans and audience in front of the television, even people by the roadside.</p><br/><p>The event was about to finish, yet the programme rating was still very high up. It only showed how many people were watching it right now!</p><br/><p>No one expected that there would be such a huge upset in just a short four hours. Nothing could be done now.</p><br/><p>…</p><br/><p>Off-stage.</p><br/><p>Jiang Muye was looking at Ning Xi’s name speeding through the rankings at a crazy speed, and she was closing in on his top spot. Needless to say, he was stunned.</p><br/><p>He even started to doubt his life!</p><br/><p>He wished he could grab her shoulders and shake the world out of her right now. “What the heck!? Ning Xiao Xi! I said we’d slay the rankings together, not for you open your unlimited kill mode!”</p><br/><p>“Uhh…” To be honest, Ning Xi did not expect this to happen as well. She had forgotten that some categories in “Entertainment’s Light” was open to both genders. She also did not expect the fans to vote for her in the male artiste category.</p><br/><p>Jiang Muye had really wronged her this time.</p><br/><p>As they were talking, the ranking as of now was…</p><br/><p>Most Popular Male Artiste No. 3: Ning Xi!</p><br/><p>National Husband No. 3: Ning Xi!</p><br/><p>Most Desired Male Artiste To Sleep With No.1: Ning Xi!</p><br/><p>When Jiang Muye saw that he had been taken over, he lost it. “Damn! This is not logical at all! Ever since the start of this poll, I’ve always been at the top! Not only did I lose it this time, but I lost it to a woman?!”</p><br/><p>While the first two were more important, the third one was a matter of a man’s pride!</p><br/><p>Ning Xi raised her eyebrows when she saw that she had taken the first place in the “Most Desired Male Artiste To Sleep With” category, she tried to console him. “Well… At least you don’t have to post a naked photo now!”</p><br/><p>“I’d rather post a fully nude photo! Fully nude!” Jiang Muye was about to cry.</p><br/><p>The enraged Jiang Muye logged into the streaming site with his main account.</p><br/><p>Jiang Muye had special privileges, so everyone received a colorful notification when he entered.</p><br/><p>Jiang Muye: “Why does no one want to sleep with me anymore!? Why!? Do you people really still love me!?”</p><br/><p>Jiang Muye: “Are you people tired of me now?”</p><br/><p>Jiang Muye: “You bunch of heartless elves!”</p><br/><p>The fans laughed when they saw Jiang Muye’s messages.</p><br/><p>“Look at you and Bro Xi. It’s the same whoever gets first!”</p><br/><p>“Hahaha, Muye, be good and get down this time!”</p><br/><p>“Well, Muye, you do seem like the bottom anyway!”</p></div>\n</div>"}