{"title": "Chapter 1943 - Pregnant", "id": 1943, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1943-pregnant", "volume_title": "Volume 20", "body": "<h1>Chapter 1943 - Pregnant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At the hospital.</p><br/><p>Besides the members of the Su family, Ning Yaohua and Zhuang Lingyu had arrived too.</p><br/><p>Zhuang Lingyu was upset. “What happened? Why did she suddenly pass out?”</p><br/><p>Zheng Minjun was disgruntled as well when she saw the people from the Ning family, especially when Zhuang Lingyu spoke to her in such a rude tone.</p><br/><p>They must have been informed by that busybody maid.</p><br/><p>She just fainted. What was the big deal?</p><br/><p>Zhuang Lingyu’s expression made it seem as if the Su family had tortured her.</p><br/><p>She was just a fake yet they still took her seriously!</p><br/><p>Zheng Minjun was frustrated when she thought about how things could have been settled that night itself, but now that something like this had happened, she said coldly, “Xiao Ling was exaggerating. Xueluo is probably just exhausted. She should be fine after some rest!”</p><br/><p>Zhuang Lingyu had been mocked by Zheng Minjun numerous times due to Ning Xueluo’s true identity, so she had always been irked by Zheng Minjun. “Do you think this is just a small matter? Xueluo is the treasure of our family! And look what happened after she went over to the Su family?”</p><br/><p>Su Hongguang spoke out to ease the fire. “You’ve misunderstood. You know how well we treat Xueluo. If you don’t believe us, you can ask her. This probably happened because of the various issues occurring in her company. Let’s stop fighting now and wait for the doctor’s diagnosis!”</p><br/><p>Ning Yaohua played the good guy. “That’s right! What matters is Xueluo’s health.”</p><br/><p>If the relationship between the two families turned sour now, it would not bear any merit to both Xueluo and Ning International.</p><br/><p>On the other hand, Su Yan was trailing the doctor to get the diagnosis report.</p><br/><p>“Doctor, how’s the patient? Is it severe?” Su Yan asked.</p><br/><p>The female doctor emerged with the report and beamed brightly. “It’s alright, and it’s something good! Congratulations! Mrs. Su is pregnant!”</p><br/><p>Su Yan’s face turned pale instantly as if he could not believe what the doctor had just said.</p><br/><p>“Doctor… What did you say? Pregnant?”</p><br/><p>The female doctor thought Su Yan was too happy for words. “Yes, it has been 8 weeks. She’s almost 3 months pregnant!”</p><br/><p>Su Yan was stunned frozen with a pale face.</p><br/><p>He had spent so many days hiring lawyers and drafting the divorce agreement. The only step left was to tell Xueluo about it that very day.</p><br/><p>He had been looking forward to being a free man again and go back to Ning Xi.</p><br/><p>He had never expected that before he had a chance to say anything, he would find out about Xueluo being pregnant!</p><br/><p>Su Yan had no idea how to take the report. He just felt like he was drowning inside an icy lake. The coldness struck his bones hard.</p><br/><p>“Su Yan… Su Yan… How’s Xueluo? Say something!”</p><br/><p>When he heard Zhuang Lingyu’s voice, he came back to his senses. He took a deep breath and forced himself to be rational again. “Xueluo is alright, she… She’s pregnant…”</p><br/><p>“What? Did you say Xueluo is pregnant!?” Zhuang Lingyu looked astonished. “That’s great! Really great!”</p><br/><p>Ning Yaohua was really thrilled as well. “You guys have been together for a year. Now, you finally have a child!”</p><br/><p>“Where’s Xueluo? I want to see her now!”</p></div>\n</div>"}