{"title": "Chapter 1951 - Obviously My Wife Can", "id": 1951, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1951-obviously-my-wife-can", "volume_title": "Volume 20", "body": "<h1>Chapter 1951 - Obviously My Wife Can</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Xi shook her head helplessly. Indeed, this was Xu Tao’s way of doing things.</p><br/><p>This move was indeed incredibly savage.</p><br/><p>“Ning Xi, how did you actually get chosen? In fact, Jace personally decided on you!” Xu Tao followed after her and asked eagerly.</p><br/><p>Thus, Ning Xi explained the process in detail to Xu Tao who listened without even blinking once throughout.</p><br/><p>…</p><br/><p>When they left the private club, Ning Xi returned to Deer Town.</p><br/><p>After chatting with Jace for a long time, Ning Xi finally understood why parts of the casting for “Assassin” took place in China.</p><br/><p>According to Jace, his younger daughter, Caroline really like China, and some settings of the storyline in “Assassin” were actually in China.</p><br/><p>Of course, when “Assassin” officially began shooting and the storylines in China were finished, she would still need to follow the crew to the other countries to continue shooting at various locations.</p><br/><p>“How was it? Did it go well?” Lu Tingxiao asked.</p><br/><p>The old Hollywood movie “Assassin” had once caused a sensation and Lu Tingxiao had seen it too. He also knew how much Ning Xi liked this movie. She had even studied the script for a long time for a minor role that did not have many scenes.</p><br/><p>“Boohoo, Darling… It didn’t go too well. I didn’t get chosen for the role that I auditioned for!” Ning Xi wept and sighed as she went over, seeking for caresses and comfort.</p><br/><p>Lu Tingxiao naturally felt his heart ache for her and he quickly consoled her softly.</p><br/><p>Yet, the moment he finished, he saw the girl looking up to him slyly. There were no hints of sadness in her eyes at all. “Hehehe, even though I didn’t get chosen for the role I auditioned for, the filming team has let me take on the role of the lead female assassin.”</p><br/><p>When he heard this, even Lu Tingxiao was a little astonished.</p><br/><p>Initially, he thought that Ning Xi had failed at the audition. He would never have thought that she would get the role of the female lead instead.</p><br/><p>In Hollywood, Chinese artistes had a lower status. As everyone was aware, getting even a supporting role was hard, much less a leading role.</p><br/><p>“Darling, do you know that today my idol unexpectedly invited me to personally meet him!?” Ning Xi exclaimed excitedly.</p><br/><p>“Jace?” Lu Tingxiao asked.</p><br/><p>“How did you know?!” Ning Xi pouted as she wanted to boast to Lu Tingxiao without him guessing first.</p><br/><p>“Apart from Jace himself, who else could make you this excited?” teased Lu Tingxiao in a pampering tone.</p><br/><p>He liked seeing the way her eyes lit up when she spoke about her work.</p><br/><p>“Mr. Jace was really such a gentleman and he’s very friendly. He wasn’t like what I imagined at all! He’s just like a normal and very loving grandfather!</p><br/><p>“And did you know? The female lead, Caroline, was actually Jace’s daughter but sadly, Caroline has already passed away…” Ning Xi’s expression flashed with regret and she felt that it was a great pity. At the same time, she was even more determined to act her part well.</p><br/><p>“Darling, I must perform this film to perfection.”</p><br/><p>“Obviously, my wife can do it,” Lu Tingxiao said, then he suddenly thought of something, and in his eyes was an unnoticeable gloom.</p><br/><p>…</p><br/><p>“Assassin” was highly efficient. Very soon, they informed Ning Xi to go over for a costume test.</p><br/><p>On that day, Ning Xi arrived early.</p><br/><p>In the makeup room, a Caucasian with the typical Western standards of beauty walked up to Ning Xi, her dark blue eyes examining Ning Xi.</p><br/><p>“You’re the Chinese actress, Ning Xi!” The Caucasian girl smiled at her.</p><br/><p>“Nice to meet you, I’m Ning Xi,” Ning Xi answered politely.</p><br/><p>“I heard you seem to have been in Hollywood previously. Did you act in a movie, the one that was just released recently?” The Caucasian girl hurled out her hand to Ning Xi.</p></div>\n</div>"}