{"title": "Chapter 1959 - Wild Beast", "id": 1959, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1959-wild-beast", "volume_title": "Volume 20", "body": "<h1>Chapter 1959 - Wild Beast</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter1959wildbeast\">Chapter 1959: Wild Beast</h3><br/><p><strong>Translator:</strong> EndlessFantasy Translation <strong>Editor:</strong> EndlessFantasy Translation</p><br/><p>The whole family was intentionally letting the two of them have more private time together. Even Little Treasure was willing to leave his mother’s side for the sake of his little sister or brother. Of course, it was not nice of him to always go over for meals.</p><br/><p>No one could understand the pain of singletons!</p><br/><p>…</p><br/><p>“Darling, you look so cool when you’re cooking!” Ning Xi complimented Lu Tingxiao when she saw him so focused on cooking.</p><br/><p>Lu Tingxiao raised his eyebrows. “I’m only cool when cooking?”</p><br/><p>“You’re cool anytime!” Ning Xi added.</p><br/><p>Lu Tingxiao smiled and kissed the girl’s cheek. “It’s kind of greasy in here. Wait for me outside for about half an hour.”</p><br/><p>Ning Xi wanted to stay with Lu Tingxiao, but she was worried she might eat him up before the meal, so in the end, she walked out of the kitchen.</p><br/><p>…</p><br/><p>After dinner, Lu Jingli wanted to go back, but Lu Tingxiao asked him to stay when he saw that it was already pretty late.</p><br/><p>“Bro, Sister-in-law, would I be bothering you by staying here?” Lu Jingli grinned mischievously.</p><br/><p>“Then, you can go back now,” said Lu Jingli.</p><br/><p>“I… I drank some wine… I’m kind of sleepy. I’ll go to bed first. Good night, everyone!” Lu Jingli swiftly sprinted to the bedroom to avoid being chased away.</p><br/><p>Suddenly, there was a deep and low roar from afar.</p><br/><p>Lu Tingxiao was taken aback and he looked out of the window.</p><br/><p>“A wild beast?” Ning Xi asked.</p><br/><p>Lu Tingxiao frowned. “Tiger.”</p><br/><p>“A tiger?!” Ning Xi could not believe it.</p><br/><p>Deer Town was not developed, but for a tiger to be around here?</p><br/><p>“That roar… It’s not a zoo tiger,” said Lu Tingxiao.</p><br/><p>The roar was powerful. Judging by the decibels, the creature should be about 10 kilometers away.</p><br/><p>“Damn!”</p><br/><p>Lu Jingli rushed down from the bedroom in his shorts. “What happened? Are you guys watching the Animal Discovery channel?”</p><br/><p>“It should be an animal that’s escaped from the zoo,” guessed Ning Xi.</p><br/><p>“Huh?!” Lu Jingli was shocked. “You’re joking, right? There’s nothing around here, not even a zoo! There’s no zoo in town and no wild beasts too! Most of them are deer and little bunnies!”</p><br/><p>“Do you think the beast would just wander around the zoo after it’s escaped?” Ning Xi asked rhetorically.</p><br/><p>“Well…” Lu Jingli had no comeback.</p><br/><p>“Bro, Sister-in-law, I think I should leave first,” Lu Jingli suddenly said.</p><br/><p>He had gone to a relative’s house when he was little and had been chased by a tiger, so he was traumatized by that experience.</p><br/><p>“If you’re not afraid of meeting it halfway, then go.” Lu Tingxiao stood up and brought Ning Xi upstairs.</p><br/><p>“Don’t scare me like that, bro!”</p><br/><p>Lu Jingli looked out of the window. It was pitch black and visibility was limited.</p><br/><p>“So what if it’s a tiger? I’d eat it alive!” As he mumbled, in the end, he still went back to the bedroom.</p><br/><p>…</p><br/><p>In a corner of Deer Town.</p><br/><p>There was a white tiger which was twice as large as a normal tiger padding forward. Any normal person would have been shocked if they saw it.</p><br/><p>There was a young man on the white tiger’s back and he seemed to be unconscious.</p><br/><p>After half an hour, the white tiger and the young man arrived at Ning Xi’s house.</p><br/><p>Roar!</p><br/><p>It let out a deep roar as if it would crumble the earth, echoing through people’s hearts.</p><br/>\n</div>"}