{"title": "Chapter 1960 - What?", "id": 1960, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1960-what", "volume_title": "Volume 20", "body": "<h1>Chapter 1960 - What?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter1960what\">Chapter 1960: What?</h3><br/><p><strong>Translator:</strong> EndlessFantasy Translation <strong>Editor:</strong> EndlessFantasy Translation</p><br/><p>“Oh my God!”</p><br/><p>Lu Jingli heard a roar just as he was about to fall asleep. He leaped out of his bed to see a large shadow outside the window engulf him.</p><br/><p>Lu Jingli was intimidated when he saw the large white tiger, especially with its cold eyes.</p><br/><p>The white tiger roared again at the terrified Lu Jingli.</p><br/><p>“Bro! Sister-in-law! It’s a ghost! No… It’s a tiger… A living tiger…”</p><br/><p>Lu Jingli did not even bother with his shorts. He sprinted out of the bedroom and ran upstairs.</p><br/><p>…</p><br/><p>The roar just now was strong enough to crack rocks, summoning the survival instinct of fear in anyone. A fear of being below it in the food chain.</p><br/><p>“Bro, Sister-in-law, huge problem, huge problem!” Lu Jingli kept on yelling as he reached the second floor.</p><br/><p>Lu Tingxiao and Ning Xi were already outside their room.</p><br/><p>The roar was too loud for them to ignore it, and they had not fallen asleep anyway.</p><br/><p>“It was a tiger roar alright. The beast should be around here. Could it really be a tiger that escaped from the zoo?” Ning Xi thought it was weird.</p><br/><p>“Around? It’s right outside my window!”</p><br/><p>Lu Jingli was still terrified. He almost pissed himself when he saw the huge white tiger outside his window earlier.</p><br/><p>“Go over and have a look,” said Lu Tingxiao.</p><br/><p>“Bro, it’s a tiger. Do you think it’s a monkey?! Don’t you remember that your brother, I, almost got eaten by a tiger when I was little?” Lu Jingli clung to Lu Tingxiao like an octopus.</p><br/><p>Lu Tingxiao stared at him. “Get off me.”</p><br/><p>“Oh…” Lu Jingli said pitifully.</p><br/><p>Ning Xi followed behind Lu Tingxiao as the three of them went into the guest room.</p><br/><p>The moonlight was hazy that night. A huge white tiger appeared before the effulgence.</p><br/><p>“A white tiger…”</p><br/><p>Lu Tingxiao frowned. How could there be a white tiger in Imperial?</p><br/><p>“Ghost!”</p><br/><p>Suddenly, Lu Jingli focused on the back of the tiger and goosebumps rose all over him.</p><br/><p>It was really a ghost this time!</p><br/><p>Ning Xi shivered as well.</p><br/><p>A white tiger appeared outside her house at midnight was already creepy enough, then Lu Jingli had to suddenly spout this word from his mouth.</p><br/><p>Ning Xi was never scared of anything except ghosts…</p><br/><p>“It’s a person.” Lu Tingxiao quickly comforted the girl. He looked at the back of the tiger and noticed a human figure.</p><br/><p>“Bro, a person on the back of a white tiger? Are you kidding me? It must be a ghost!” Lu Jingli mumbled.</p><br/><p>“Just what is it?” Ning Xi frowned.</p><br/><p>Lu Tingxiao went closer and finally saw who it was.</p><br/><p>“Han Xiao,” said Lu Tingxiao.</p><br/><p>“What?” Ning Xi thought she misheard him.</p><br/><p>What did her darling say just now?</p><br/><p>“Han Xiao,” repeated Lu Tingxiao.</p><br/><p>Ning Xi went forward.</p><br/><p>“What the heck?!”</p><br/><p>Ning Xi was shocked when she finally took a good look at the young man on the white tiger’s back. Her mind went blank.</p><br/><p>Han Xiao was currently unconscious and had several visible wounds on him.</p><br/><p>“It’s true… He’s Han Xiao, the super martial arts master!” Lu Jingli’s mouth gaped open wide.</p><br/><p>Every man had a fantasy within him.</p><br/><p>In video games or martial arts books with knives and swords, one would fantasize about excelling in martial arts in real life.</p><br/><p>Lu Jingli had been looking forward to meeting Han Xiao after he found out about his existence.</p><br/>\n</div>"}