{"title": "Chapter 1963 - Look For White Tiger", "id": 1963, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1963-look-for-white-tiger", "volume_title": "Volume 20", "body": "<h1>Chapter 1963 - Look For White Tiger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Who could’ve hurt you like this?” Ning Xi could not help but ask.</p><br/><p>“Ah, forget about that.” Han Xiao seemed lazy to continue discussing this.</p><br/><p>“Master, you’re so talented. How could you have been hurt this severely?” Lu Jingli looked at Han Xiao and asked recklessly.</p><br/><p>“Kid, I fell asleep and was ambushed.” Han Xiao rolled his eyes.</p><br/><p>“Master, you’re so amazing. How were you ambushed?” Lu Jingli was incredibly puzzled.</p><br/><p>“If I’m so amazing, do you believe that I can kill you with one hand?” Han Xiao stared intensely at Lu Jingli.</p><br/><p>“Master, the person that ambushed you is a bastard. As they say, an honest person does nothing underhand, especially for life or death duels between masters. How could he have used such a despicable, shameless, lowly trick?” Lu Jingli seemed like he detested the person. ( )</p><br/><p>“Ning Xi, who’s this?” Han Xiao shot Ning Xi a confused look.</p><br/><p>“My brother-in-law… Earlier, he was frightened by your tiger. He’s a little talkative. Don’t mind him.” Ning Xi’s mouth twitched.</p><br/><p>“Right, how were you brought here by a tiger?” Ning Xi asked about the elephant in the room.</p><br/><p>“That’s my friend.” Han Xiao yawned. “A Bengal white tiger… He’s been following me since he was young. It’s been seven years.”</p><br/><p>Ning Xi was speechless. She had really guessed correctly. It was indeed a beast domesticated by this madman!</p><br/><p>Han Xiao suddenly realized that his tiger was not around. He swiveled and asked, “Eh, where’s my white tiger?”</p><br/><p>“Why didn’t you let my white tiger in?” Han Xiao asked in surprise.</p><br/><p>Ning Xi helplessly put her hand to her forehead. “Please, Master, not everyone can be as abnormal as you. That’s a beast that you raised. Use your head to think. In a situation in which we know nothing of, who would dare to let a tiger enter their house?”</p><br/><p>“What are you afraid about? My white tiger’s even smarter than people. He wouldn’t do anything to you.” Han Xiao immediately got up and wanted to go out to look for the tiger.</p><br/><p>“Let him rest well,” said Lu Tingxiao.</p><br/><p>Ning Xi nodded and quickly pulled Han Xiao back. “You lie down properly. Don’t torment yourself anymore, please!”</p><br/><p>The wound had just been sterilized and stitched up. He could not exercise or move around much. If he walked out and the wound got infected or opened up, it would be very troublesome.</p><br/><p>“I will go and look for it for you.” Lu Tingxiao put his coat on.</p><br/><p>The person before him had saved Little Treasure and Ning Xi before, so it was reasonable to help to look for his tiger.</p><br/><p>“Follow me,” Lu Tingxiao said to Lu Jingli.</p><br/><p>With such mind-blowing grievous news, Lu Jingli almost cried. “Bro… I can’t leave the Master. Look at how severe his injuries are. What if he’s thirsty or anything? I can still help out…”</p><br/><p>Making him walk out to find a huge white tiger in the middle of the night?! What a brother!</p><br/><p>Ning Xi rolled her eyes. “Darling, let me go with you.”</p><br/><p>Then, she said to Lu Jingli, “Stay at home to watch the Master.”</p><br/><p>Lu Jingli nodded like a rattle-drum.</p><br/><p>In the living room, only Lu Jingli and Han Xiao, who looked at each other in consternation, were left.</p><br/><p>“Master, can… can you teach me how to tame a tiger?” Lu Jingli seized this great opportunity to ask.</p><br/><p>Han Xiao replied, “Do tigers need to be tamed?”</p><br/><p>Lu Jingli was speechless.</p><br/><p>…</p><br/><p>In the dark of the night, the two of them walked all about to look for traces of the white tiger.</p><br/><p>If they did not find it before dawn, it would frighten the people in town when day broke and probably cause a disturbance.</p><br/><p>They had walked around to look for about a few minutes when on a small hillside, Ning Xi’s figure stopped. She used her flashlight to shine ahead and immediately pulled on Lu Tingxiao’s arm. “Look!”</p><br/><p>Lu Tingxiao turned around and looked where the flashlight shone.</p><br/><p>There was a huge white tiger crouching on the ground, his beady eyes staring back at Ning Xi and Lu Tingxiao.</p></div>\n</div>"}