{"title": "Chapter 1973 - Capability To Crossdress", "id": 1973, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1973-capability-to-crossdress", "volume_title": "Volume 20", "body": "<h1>Chapter 1973 - Capability To Crossdress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h2 class=\"text-center\">Chapter 1973: Capability To Crossdress ###</h2><div class=\"text-right small\"><b>Translator:</b> EndlessFantasy Translation <b>Editor:</b> EndlessFantasy Translation</div><br/><p>“Okay, thank you, Weir!” The reporter nodded and ended his stream of questions.</p><br/><p>Everyone’s expression at the scene was indescribable.</p><br/><p>Nevertheless, they soon they came back to their senses and continued with the questions.</p><br/><p>“Ms. Ning Xi, the old version of ‘Assassin’ has already become a classic. Would you feel pressured by challenging such an important role?”</p><br/><p>“I’ll give it my best shot. Of course, there’ll be some pressure, but…”</p><br/><p>As Ning Xi was replying, Jiang Muye was entering with his manager and assistant.</p><br/><p>Ning Xi glared at him when she saw that he had arrived. This kid was actually late for this important event today!</p><br/><p>A lot of cameras were facing him following his sudden appearance.</p><br/><p>“Sorry, really sorry. The car broke down halfway.” Lei Ming bowed his head in apology. He would never admit that this guy was too excited and had overslept!</p><br/><p>Jiang Muye went up to Simon Joseph and said, “I’m really sorry, Director Simon.”</p><br/><p>“Take a seat.” Simon Joseph waved his hand.</p><br/><p>After Jiang Muye had received the contract from Ning Xi, he had gone to the producer’s team and met Jace. He had also familiarized himself with the rest of the crew.</p><br/><p>He was usually not serious, but once he got fired up, it was hard for people to dislike him. Very soon, he was getting along with the crew.</p><br/><p>When people saw Jiang Muye take a seat at the chair with the card “Carl” in front, some people screamed.</p><br/><p>“Damn! Is Jiang Muye acting as Carl?!”</p><br/><p>“Although Carl doesn’t have that many scenes, his popularity is not any lesser than the main lead’s!”</p><br/><p>…</p><br/><p>The artiste, who played the cross-dressing assassin Carl, had now became an international star.</p><br/><p>He was currently one of the highest paid comedians in Hollywood.</p><br/><p>Lei Ming looked around, then he went up to Xu Tao and smiled. “Thanks to Ning Xi. She gave Muye such a big chance!”</p><br/><p>Xu Tao chirped happily, “My queen is the best, isn’t she?”</p><br/><p>This was the first time Hollywood had selected three Chinese actors. Even if Han Zixuan’s minor role was not included, Ning Xi and Jiang Muye as the main lead of the movie and the other being an outstanding secondary character was simply unimaginable.</p><br/><p>“But, Mr. Jiang Muye, I’ve never heard about you going for the audition! How did you get this role?” A certain female reporter looked at Jiang Muye with doubt.</p><br/><p>Jiang Muye nodded and replied, “You’re right, I didn’t go for the audition.”</p><br/><p>“Then…” the female reporter asked.</p><br/><p>“Ning Xi helped me get it,” Jiang Muye told the truth.</p><br/><p>It was not just the female reporter who asked, everyone else who heard Jiang Muye’s reply were surprised.</p><br/><p>What? / update by </p><br/><p>Ning Xi helped him get it? What did he mean?</p><br/><p>Suddenly, everyone looked at Ning Xi.</p><br/><p>“I just made a recommendation. It’s mainly Senior Jiang’s own capability.” Ning Xi beamed.</p><br/><p>Jiang Muye was annoyed when he heard Ning Xi’s reply.</p><br/><p>Capability to cross-dress?!</p><br/><p>This person was hiding her true words!</p><br/><p>The members of the media once again fell into silence.</p><br/><p>All along, they had been comparing Han Zixuan to Ning Xi. By the looks of things now, it was nothing but a joke.</p><br/>\n</div>"}