{"title": "Chapter 1985 - I Don’t Need A Foot Accessory", "id": 1985, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1985-i-don%E2%80%99t-need-a-foot-accessory", "volume_title": "Volume 20", "body": "<h1>Chapter 1985 - I Don’t Need A Foot Accessory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Qiao Yi had sent a few dozen people to Deer Town recently.</p><br/><p>However, he lost contact with all the people who went there as if they had vanished into thin air.</p><br/><p>“Uncle Qiao, it seems like the Lu family is well prepare. Only two of the assassins we sent returned, and they said they saw a white tiger in Deer Town.”</p><br/><p>Feng Jin was deep in thought.</p><br/><p>“White tiger?”</p><br/><p>Qiao Yi was doubtful. Could the assassins he sent all been killed by the white tiger?</p><br/><p>“Uncle Qiao, I think we should ask the European King for help,” said Feng Jin.</p><br/><p>Qiao Yi shook his head.</p><br/><p>It would be inappropriate if they could not even handle something this trivial and had to rely on the European King’s power.</p><br/><p>“Send a few more batches of assassins over to Deer Town.”</p><br/><p>Cold sparks lingered in Qiao Yi’s eyes.</p><br/><p>If they failed again, he would go there himself personally.</p><br/><p>No matter what, he would kill Lu Tingxiao and the bunch!</p><br/><p>…</p><br/><p>Han Xiao had been staying in Deer Town for a few days, and all the assassins that came were handled by him effortlessly.</p><br/><p>Tang Lang just sat on the sofa and munched on watermelon everyday. He watched how the assassins came and gave up their lives, then he would do some cleaning up, enjoying a rather easy-going life.</p><br/><p>“Come and play with me, kid!”</p><br/><p>Han Xiao yawned, then said to Tang Lang who was eating a melon, “Please don’t, Grandfather. Want a melon?”</p><br/><p>Tang Lang handed him a slice of watermelon with a cute expression.</p><br/><p>“Yes.”</p><br/><p>Han Xiao nodded and munched on the melon given by Tang Lang.</p><br/><p>Ever since the last time, Tang Lang never fought against Han Xiao anymore.</p><br/><p>He was only human and could not have endured the monster’s attack. It was enough for him to try harming himself once. Only idiots would try it the second time.</p><br/><p>At midnight, Ning Xi went to the living room and reported, “Someone’s broken through the defenses of Deer Town…”</p><br/><p>“Master, someone’s coming again. They know that you’re here, yet they still keep coming. I’m not sure what you’re thinking, but if it were me, I’d surely rip them into pieces,” Tang Lang looked at Han Xiao and joked.</p><br/><p>Han Xiao crossed one leg over the other as if he did not hear Tang Lang.</p><br/><p>After a while, Han Xiao took another slice of watermelon. “You guys go out somewhere cool!”</p><br/><p>“There’s air-conditioning in the house. Surely it’s much cooler than outside,” said Tang Lang.</p><br/><p>However, his expression changed right after he finished his sentence.</p><br/><p>Probably a lot of assassins had come. It would be terrible if a gun fight broke out.</p><br/><p>Ning Xi and him were not monsters like him. What if bullets ran through them?</p><br/><p>“You’re right, Grandfather. It is cooler outside…”</p><br/><p>Tang Lang dragged Ning Xi and left the house.</p><br/><p>…</p><br/><p>After an hour, sounds of gunshots came from the house.</p><br/><p>After five minutes, Ning Xi and Tang Lang returned when the noise had died down.</p><br/><p>Han Xiao was still munching on watermelon slices on the sofa.</p><br/><p>Bodies lay strewn in the living room in and outside…</p><br/><p>…</p><br/><p>Han Xiao glanced wordlessly at Tang Lang.</p><br/><p>“I get it, Grandfather…”</p><br/><p>Tang Lang smiled and worked like a bee, moving the bodies away from the house and cleaning up.</p><br/><p>“Master, please let me hold your leg!” Ning Xi looked at Han Xiao, impressed.</p><br/><p>“I don’t need a foot accessory,” replied Han Xiao.</p><br/><p>“By the way, when can I leave?” Before Ning Xi could say anything, he asked her as he threw the watermelon rind into the bin.</p><br/><p>Ning Xi flashed an odd smile and stared at Han Xiao.</p><br/><p>She would not let him get away that easily!</p><br/><p>“Until there are no more assassins.” Ning Xi laughed.</p><br/><p>Han Xiao sighed annoyingly.</p><br/><p>He had finally become a babysitter.</p><br/><p>At least, the food here was good!</p></div>\n</div>"}