{"title": "Chapter 1996 - You’ll Never Abandon Me, Will You?", "id": 1996, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1996-you%E2%80%99ll-never-abandon-me-will-you", "volume_title": "Volume 20", "body": "<h1>Chapter 1996 - You’ll Never Abandon Me, Will You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Xi noticed that something had not been right with Xu Tao recently.</p><br/><p>He lingered around by her side and made a lot of little gestures such as greeting her more frequently and serving her drinks more often.</p><br/><p>While Xu Tao had been sweet to her before, it was especially obvious these few days. He also had several moments where he looked like he was about to say something but stopped himself.</p><br/><p>Ning Xi could not help but ask him, “What’s wrong, Bro Tao? Be straightforward with me!”</p><br/><p>It took Xu Tao some time before he mumbled, “My queen, you’ll never abandon me, will you?”</p><br/><p>“What do you mean?” Ning Xi was confused.</p><br/><p>“It’s all because of that bastard, Wang Haojun! He’s trying to get something he’s unworthy of. He wants you to go over to Starlight!” Xu Tao raged.</p><br/><p>Ning Xi laughed. “Well, you already said that he’s unworthy, so why would I go to him?”</p><br/><p>“But I’m insecure…”</p><br/><p>Suddenly, Liang Feixing came in and dragged Xu Tao aside. “Why are you doing acting like a child? I’ve got goosebumps! Didn’t I ask you to not bother Ning Xi? Get to work!”</p><br/><p>He then turned to Ning Xi. “Don’t mind him, Ning Xi. He’s on his period and is having some emotional distress.”</p><br/><p>Ning Xi was helpless. “Don’t worry, Bro Tao. Su Yan did look for me last night, but I’ve rejected him.”</p><br/><p>“Damn! That shameless bastard! He even used Su Yan!” Xu Tao scowled in frustration.</p><br/><p>However, Xu Tao was finally able to be at ease after he heard that his queen had rejected the offer, so he went back to work happily. “Then, my queen, I’ll head over to fetch you to the Imperial TV Station Annual anniversary!”</p><br/><p>“I’m not sure when the event in the evening will end. My program is near the end anyway. Bro Tao, you should go over with Qin Shuang first. I’ll go over there myself after the event,” said Ning Xi.</p><br/><p>“Alright!” Xu Tao answered, totally revived.</p><br/><p>The goddess was just so kind and considerate!</p><br/><p>…</p><br/><p>At night, Xu Tao brought Qin Shuang backstage.</p><br/><p>They went into their designated dressing rooms.</p><br/><p>They soon realized that someone was already inside. Xu Tao then noticed that he had gone into the wrong room.</p><br/><p>Inside the room were Yin Youyou and her manager, two assistants, a makeup artist, two bodyguards, and practically a village was helping Yin Youyou with her makeup.</p><br/><p>Ever since she had gone to Starlight, Yin Youyou was really focused on her image as if she was afraid people did not know how well she was doing after she switched companies.</p><br/><p>A sharp-chinned assistant of Yin Youyou’s saw someone come into the room. She yelled angrily at Xu Tao and Qin Shuang, “Who allowed the two of you to come in? This is Youyou’s exclusive dressing room!”</p><br/><p>Xu Tao was about to leave with Qin Shuang when he noticed he had entered the wrong room. However, having met an old enemy, he snorted at the sharp-chinned assistant. “Huh, exclusive dressing room? Is your name on there?”</p><br/><p>The assistant looked at Xu Tao with a mocking attitude. “Xu Tao, you were a top manager back then. Although you almost became homeless, you shouldn’t really act like a hobo, should you?”</p><br/><p>This assistant was the one who had slapped Xu Tao and humiliated him in public. Consequently, Xu Tao became the joke of the industry after this incident was published in the papers.</p><br/><p>A former top manager had been slapped by a minor assistant in public…</p></div>\n</div>"}