{"title": "Chapter 1993 - Poach", "id": 1993, "volume": 20, "url": "http://boxnovel.org/hidden-marriage-chapter-1993-poach", "volume_title": "Volume 20", "body": "<h1>Chapter 1993 - Poach</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter1993poach\">Chapter 1993: Poach</h3><br/><p><strong>Translator:</strong> EndlessFantasy Translation <strong>Editor:</strong> EndlessFantasy Translation</p><br/><p>At Starlight Entertainment.</p><br/><p>Wang Haojun stared at all sorts of complicated data on the computer screen and felt a terrible headache coming on.</p><br/><p>Glory World Entertainment’s market share was catching up to surpass Starlight’s at a terrifying speed. Their stock price had been rising too while Han Zixuan and Starlight’s end were already powerless in reversing the situation.</p><br/><p>First, she had joined the cast of “The World”, then the event was crashed by Ning Xi. At the Night of Starlight, she had straight up slain the ranks. When she finally got the opportunity of acting in a Hollywood blockbuster, yet she became a prop to Ning Xi. Even her ambassadorship for SS skincare products commercial had been crushed by the YLD brand that Ning Xi was a spokesperson for.</p><br/><p>“Cheng Yibin! Liu Xiaorou! What are you two doing? If I remember correctly, shouldn’t YLD’s spokesperson be Xiaorou? How did it become Ning Xi in the end?”</p><br/><p>There were so many concerns in the company. He could not possibly be watching every single one of them. By the time he found out, it was already too late.</p><br/><p>Not only did they lose an A-list ambassadorship, but they had even let Han Zixuan be crushed once again.</p><br/><p>Liu Xiaorou was mad, but she did not dare to express it. She could only grit her teeth silently.</p><br/><p>Cheng Yibin wiped the sweat on his forehead away, his expression flattering as he said, “CEO Wang, you really can’t blame me for this! Initially, we were already going over to sign the contract that day, but who’d have thought that midway, Xu Tao would bring Ning Xi over to snatch it away from us!? I couldn’t do anything either!</p><br/><p>“Xu Tao was probably taking revenge on Xiaorou jumping ships. This is all the fault of the conflict between the two of them privately. It really has nothing to do with me at all!”</p><br/><p>Liu Xiaorou looked in disbelief at the manager beside her. She almost cried out in anger, “This ambassadorship had been settled on before I joined the company. How was it that I was fine before I joined the company, yet I fell through once I entered!? How could this be my fault?”</p><br/><p>Cheng Yibin’s expression suddenly turned dark. “Xiaorou, what are you implying? Are you saying that we ruined your spokesperson gig?”</p><br/><p>These days, she had endured a lot in Starlight and had watched helplessly as Qin Shuang, who had formerly been ridiculed by her, start to steadily rise up. It was a stark difference from before. Liu Xiaorou could not stand it anymore, so she cried and yelled on the spot.</p><br/><p>“Cheng Yibin! Don’t go too far with the bullying! You know well enough how you’ve been treating me ever since I joined Starlight! You don’t let me fight for opportunities. You only know how to make me drink with people all day! For a crappy B-list ambassadorship, you made me sleep with an old fart!”</p><br/><p>“What’s wrong with sleeping with them? Who in this line of work doesn’t do that? Are you the only noble one? I let you sleep with him to fight for your opportunities!”</p><br/><p>“You…”</p><br/><p>“Enough! The two of you, shut up! Look at how you’re behaving!”</p><br/><p>After he chased Cheng Yibin and Liu Xiaorou who were quarreling endlessly out, Wang Haojun’s head hurt even more now.</p><br/><p>Now, he could only put all of his hope onto Su Yan.</p><br/><p>He waited until the evening when Su Yan finally arrived slowly.</p><br/><p>Wang Haojun quickly greeted the person at the door. “CEO Su, you’re here! Come in!”</p><br/><p>Su Yan nodded slightly, then he sat down on the sofa. “What’s wrong?”</p><br/><p>Wang Haojun looked troubled. “I’m sure you know about how the company has been doing recently. Ning Xi’s comeback is increasingly affecting our company. I’ve asked you to come because I wanted to discuss if you have any solutions, CEO Su!”</p><br/><p>When Su Yan heard this, the light in his eyes sparkled. “Since you can’t crush her, why don’t you offer a symbol of peace?”</p><br/><p>Wang Haojun was stunned when he heard his boss. “CEO Su, are you saying that we should just poach her?”</p><br/><p>“Why not?” Su Yan asked in return.</p><br/><p>Wang Haojun looked troubled by this. “Um, CEO Su, you’re clear about Ning Xi’s dispute with your wife previously. Back then, Ning Xi had been forced away by us. How could she be willing to come back to us now? Even if she was, I’m afraid it’ll be hard to explain to Xueluo too…”</p><br/>\n</div>"}