{"title": "Chapter 2008 - Being Suppressed", "id": 2008, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2008-being-suppressed", "volume_title": "Volume 21", "body": "<h1>Chapter 2008 - Being Suppressed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Know what?” Yin Youyou chuckled coldly. “Know that your artiste is falling? Or that you’re going back to training a group of newbies again?”</p><br/><p>Xu Tao looked at Yin Youyou who was mocking him, but he was not angry at all. He just shook his head sadly.</p><br/><p>“Youyou, I don’t care how you want to mock me. I’m here today not because of Ning Xi. It’s because of you.”</p><br/><p>“Because of me?” Yin Youyou scoffed and looked at Xu Tao in disbelief. “I should really appreciate your concern. However, instead of me, you should put more thought into cleaning up after Ning Xi’s mess. No matter how powerful Glory World is, there’s nothing you can do now. Try to think of who you can cultivate now to avoid being homeless soon!”</p><br/><p>Xu Tao was really patient facing Yin Youyou who kept mocking him. He put on a bitter smile. “Ning Xi’s matter isn’t easy to solve. I looked for you today because I was reminded of the days you were in Glory World…</p><br/><p>“When you just came, I already knew that you have the potential to be popular. Even though you went to Starlight afterwards, while I was disheartened that someone I cultivated was being taken away, I’m glad that you’re doing well.”</p><br/><p>“Haha, don’t you think it’s a little too late to play this card right now?” Yin Youyou was not touched at all.</p><br/><p>Xu Tao smiled bitterly, “I’ve just not been in the best of moods recently and needed someone to rant to. Although you’re not in Glory World anymore, we were once colleagues, and I hope that you can sympathize with me and just have a chat with me.”</p><br/><p>Yin Youyou frowned. She felt that Xu Tao was behaving oddly today, but she remembered how’re had bragged when he was with Ning Xi. She would love to revel in the miserable side of Xu Tao.</p><br/><p>“Sure, I’m not really that cold-blooded. Say whatever you want!”</p><br/><p>Xu Tao smiled, but there was a certain degree of coldness in his eyes. Of course, he knew that Yin Youyou just wanted to see how miserable he had become.</p><br/><p>“Youyou, you’re really talented. Glory World picked you back then because we wanted someone to hold the fort at the top, but… you’re doing pretty well at Starlight. While Han Zixuan is above you, you’re doing alright.”</p><br/><p>Xu Tao’s casual remark sounded very sarcastic but Yin Youyou heard it.</p><br/><p>Yin Youyou had chosen to go over to Starlight because she hoped Starlight would support her and push her all the way to the top. However, Han Zixuan was hogging the top spot, causing Yin Youyou’s ascent in Starlight to come to a halt.</p><br/><p>Some time ago, Ning Xi had returned and faced Han Zixuan head-on. Her popularity decreased and Starlight was about to shift the resources onto Yin Youyou, but…</p><br/><p>Yin Youyou suddenly frowned. Starlight had decided to assign her the resources because Han Zixuan was being suppressed by Ning Xi, but if Ning Xi fell, then no one could stop Han Zixuan anymore!</p><br/><p>Yin Youyou was so smug that Ning Xi was going to be eliminated, but now that she thought about her own situation, she was not pleased at all.</p></div>\n</div>"}