{"title": "Chapter 2016 - Really Done For This Time", "id": 2016, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2016-really-done-for-this-time", "volume_title": "Volume 21", "body": "<h1>Chapter 2016 - Really Done For This Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>On the huge screen, the instant her own face clearly appeared before everyone, Han Zixuan’s heart that was suspended mid-air crashed down hard. Her figure wavered and her alarmed expression suddenly turned blank.</p><br/><p>Apart from the man’s rough panting and the woman’s indulgent moans, their conversation was unbearable to listen to as well. It surprised everyone.</p><br/><p>“Ah… Faster… Faster… Don’t stop… CEO Yi, you’re amazing…”</p><br/><p>“You slut! Why are you so slutty? Hmm?”</p><br/><p>“Then, do you like me like this?”</p><br/><p>“Of course, I do!”</p><br/><p>“Then, do you like me more, or do you like your wife more?”</p><br/><p>“How can that fat woman compare to you? Don’t mention that disgusting woman right now!”</p><br/><p>… On the huge screen, the video was still going on. The lengths that the two people went in the imagery was comparable to an adult film, and it stupefied everyone.</p><br/><p>No one would have thought that Han Zixuan, who had always assumed the role of a noble and cold goddess, would be so unrestrained in bed.</p><br/><p>Off-stage, the crowd who had finally returned to their senses from the shock all looked at each other. They were flabbergasted.</p><br/><p>“Oh… Oh my God… Did I see wrongly? Is the person in the video… Is that… Han Zixuan?”</p><br/><p>“It’s Han Zixuan and Yi Xudong! In fact, they even messed around in Yi Xudong’s office!”</p><br/><p>“Doesn’t Yi Xudong have a wife?”</p><br/><p>“Not only a wife, he even has children!”</p><br/><p>“Oh my God! I already can’t keep up… This… What is happening?”</p><br/><p>At this moment, the scene changed and cut to another part of the video. The scale of this video was no less than the previous one.</p><br/><p>Earlier, the setting of that video was the office, while this one was in the company car.</p><br/><p>The video camera first recorded the car plate number, then it went for the car.</p><br/><p>There was no one around as the two of them kissed intensely, starting to take each other’s clothes off and climbing into the car.</p><br/><p>Very soon, the car started to bounce up and down.</p><br/><p>Inside the car, Han Zixuan was half-naked, while her bottom half was pushed up against Yi Xudong.</p><br/><p>The sound of their copulation and their conversation could vaguely be heard from the speakers.</p><br/><p>“Mmm… Ahh… Xudong… Don’t be like this… What if someone sees us? Let’s go to a hotel… Mmm… Ahh…”</p><br/><p>“What are you afraid of? Even if someone sees us, who’d dare to expose me?”</p><br/><p>Yi Xudong’s eyes were filled with corrupted indulgence. Roughly, he said as he gripped Han Zixuan’s slim waist, “Slut, let’s switch positions!”</p><br/><p>Han Zixuan was like a sea snake as her body twisted and she said annoyedly, “Don’t! You didn’t even do what you promised yet! You said you’d let me debut this month.”</p><br/><p>Yi Xudong scoffed proudly, “Huh, debut? You underestimate me! That woman Ling Zhizhi can’t adapt to the circumstances. She keeps going against me. Wait till I chase her out of the company, then all of Ning Xi’s resources will be yours! In the future, you’ll become the top female artiste in Glory World!”</p><br/><p>“Really?” Han Zixuan’s eyes lit up, filled with unsubtle ambition.</p><br/><p>“Well, of course, you’re so pretty! You can completely copy Ning Xi and take the same route as her. When that happens, all of the resources under her can be transferred to you!”</p><br/><p>…</p><br/><p>When both the videos finished, the screen returned to pitch black.</p><br/><p>It was absolutely silent with a deathly stillness.</p><br/><p>That was such a sudden exposè. In fact, one was more shocking than the other, catching everyone unaware and causing them to be confused and disoriented.</p><br/><p>Han Zixuan seemed to have completely fallen into an ice cave. She trembled all over as an unprecedented swamp of hopelessness engulfed her and her mind went blank.</p><br/><p>This was impossible! Impossible!</p><br/><p>How did it end up like this?</p><br/><p>Done for…</p><br/><p>This time, she was really done for…</p><br/><p>Off-stage, Ning Xi’s indifferent gaze fell onto Han Zixuan beside her. Her lazy eyes were mixed with fragments of coldness that could make one shiver all over. She said with gloomy eyes, “Han Zixuan, are you satisfied with this explanation?”</p></div>\n</div>"}