{"title": "Chapter 2027 - Blame", "id": 2027, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2027-blame", "volume_title": "Volume 21", "body": "<h1>Chapter 2027 - Blame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>There was no other choice. Ning Xueluo still had the precious baby of the Su family. The check-up had previously even revealed that it was a boy. If they pressured Ning Xueluo too much under such circumstances, her precious grandson might be gone.</p><br/><p>After all, Su Yan had to face the issue of the other child, Su Xun, so it would be more advantageous to him if he were to have a successor sooner.</p><br/><p>No matter what, Ning Xueluo had to give birth to that child first.</p><br/><p>Zheng Minjun held her tongue and used a gentle tone. “You can’t really blame Su Yan for this! You know how Su Yan is like. Their relationship has always been solid. He would never cheat on her! If Ning Xi had not seduced Su Yan, he would never have done so!</p><br/><p>“Even if she said those flowery words, they were all part of a trick. That girl leaked the video online all for her own benefits. How are our families supposed to conduct ourselves in public from now on?”</p><br/><p>Zheng Minjun was aggrieved when she thought about how Ning Xi rejected her son so coldly. Had it not been for the Zhuangs, Ning Xi would just be a mere actress.</p><br/><p>Zheng Mingjun blamed everything on Ning Xi.</p><br/><p>Zhuang Lingyu became even angrier when Ning Xi’s name was mentioned. “Just what did I do in my past life to give birth to someone like her? Why is she always onto Xueluo and never letting go of the Nings?”</p><br/><p>Ning Yaohua was worried when he saw Zhuang Lingyu being really worked up. “Don’t be angry, Lingyu. Be careful of your health!”</p><br/><p>“Look at what that brat has done! How can I not be angry? She’s taking revenge on us. She’s never considered us!”</p><br/><p>Just as Zhuang Lingyu was weeping, Su Yan arrived.</p><br/><p>Ning Xueluo’s pregnancy had hit him hard. In addition to Ning Xi’s rejection, he felt depressed and he had made an excuse to go overseas as an escape, but unexpectedly, such a huge fiasco had happened back in the country.</p><br/><p>When he found out Ning Xi was misunderstood and criticized by the public, he was worried and jumped on the first flight home.</p><br/><p>However, before he could do anything, he saw the live stream of the charity night the moment he touched down.</p><br/><p>His first reaction was to look for Ning Xi, yet he received a call from his family informing him that Xueluo was hospitalized because of abdominal pain and wanted him to go there.</p><br/><p>“How’s Xueluo?” Su Yan asked while panting.</p><br/><p>Zhuang Lingyu looked sharply at Su Yan, clearly unhappy with him. “Do you still think of Xueluo as your wife?”</p><br/><p>Su Yan clenched his fists and looked downwards ashamedly. “I’m sorry.”</p><br/><p>Zheng Minjun went up and gave Su Yan a nudge. “It’s alright now. I know you were deceived by Ning Xi. Go take a look at Xueluo and talk to her. Don’t let her misunderstand…”</p><br/><p>“Mother, I…” Su Yan frowned.</p><br/><p>Zheng Minjun shot Su Yan a look to prevent him from keep talking, then she pushed him into the ward and continued talking to Zhuang Lingyu and Ning Yaohua.</p><br/><p>“It’s normal for married couples to have some arguments. If we get involved too much, things might get worse. They even have their own child now. How could they get a divorce? Even if Su Yan insists, there’s still Hongguang and me! Don’t worry, we won’t let Xueluo suffer!”</p></div>\n</div>"}