{"title": "Chapter 2020 - As You Wish", "id": 2020, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2020-as-you-wish", "volume_title": "Volume 21", "body": "<h1>Chapter 2020 - As You Wish</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>While her gaze seemed gentle, it closed in on his throat like an icy cold blade as if blood would gush out the next moment, a sense of danger shrouded his whole body. He suddenly stopped talking; it was more like he could not even say a word.</p><br/><p>When the reporter came back to his senses, he noticed that his undershirt was drenched with sweat.</p><br/><p>Damn it. She was just an actress who became popular because she used some underhanded tactics. There was no reason to be afraid of her.</p><br/><p>The next moment, Ning Xi averted her gaze away from that reporter and looked coldly at a camera right in front of her.</p><br/><p>The cameraman held his breath and steadily operated the camera. The cameras from the other angles were all aimed towards Ning Xi too.</p><br/><p>Ning Xi looked right into the lens. She was not directing her intimidating gaze to the cameraman, but she was looking at someone else through the lenses.</p><br/><p>At this moment, Ning Xueluo was waiting for Ning Xi’s fake calmness to break down. She wanted her to fall into the the deepest of abysses, yet when her eyes met with Ning Xi’s on screen, her back straightened and felt sheer coldness travel up her spine.</p><br/><p>“As you wish,” Ning Xi said those words towards the camera.</p><br/><p>Suddenly, voices from a conversation came out of the room speaker.</p><br/><p>“Xiao Xi!”</p><br/><p>“Sis, it wasn’t me… I don’t know why he’s here…”</p><br/><p>“I intentionally waited here myself because apart from that, I really don’t know how else I could see you.”</p><br/><p>“Do you need something?”</p><br/><p>“Can I speak to you privately?”</p><br/><p>“Sis…”</p><br/><p>“Xiao Nuo, it’s not your fault. Just wait for me here.”</p><br/><p>…</p><br/><p>Because it was at night, the visual was very dark. Three figures appeared. They were a woman, a young man, and a slightly taller man.</p><br/><p>The woman’s voice was obviously Ning Xi. The one who called Ning Xi “sister” was probably her brother Tang Nuo, then who was the other person?</p><br/><p>“Speak.” It was Ning Xi’s voice.</p><br/><p>The man said, “Xiao Xi, can we… start over again?”</p><br/><p>As people were having doubts, they were shocked to hear this.</p><br/><p>Start over?</p><br/><p>Did Ning Xi just share her own personal matter?</p><br/><p>As everyone was still confused, the man continued, “Xiao Xi, I know me saying this sounds ridiculous and absurd to you…”</p><br/><p>Ning Xi’s voice was cold. “Is it not?”</p><br/><p>“Listen, I’ve thought about it for a very, very long time. I’m not saying this on impulse. I really, really regretted, and finally understood who I really like, no, really love is…</p><br/><p>“Xiao Xi, about that incident back then, I was wrong. It was I who abandoned what we had at first, but at the start, I really never thought of breaking up with you until I met Xueluo.</p><br/><p>“Xueluo is so pure and vulnerable, and she suddenly got involved in that sort of unforeseen incident. After that, she constantly chatted and grumbled to me. Slowly, I just… I didn’t know when it started, but the feelings just started to change.”</p><br/><p>The crowd finally knew who was the one talking.</p><br/><p>The man was Su Yan!</p><br/><p>Did Su Yan just say he betrayed his relationship with Ning Xi?</p><br/><p>What was happening?</p><br/><p>The conversation continued.</p><br/><p>“After that, under impulse, I did <em> it </em> with Xueluo… I’ve been hiding it from you… because I really didn’t know how to face you…</p></div>\n</div>"}