{"title": "Chapter 2026 - It’s Too Late", "id": 2026, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2026-it%E2%80%99s-too-late", "volume_title": "Volume 21", "body": "<h1>Chapter 2026 - It’s Too Late</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Han Zixuan covered the part she struck in disbelief, her eyes flashing furiously. “Witch! You hit me! Who do you think you are to slap me!?”</p><br/><p>Yin Youyou laughed coldly. “Haha… Han Zixuan! That’s what I should be saying! Who do you think you are? The cancer within the industry, Ning Xi’s replacement, do you think you’re still the top artiste of Starlight? You’re just a shameless witch! What makes you think that you can always act like my superior? I’m telling you now, I’ve had enough of you!”</p><br/><p>“I dare you to say it again, Yin Youyou! Who do you think you are?! You’re just a dog beside me!”</p><br/><p>The two of them continued the argument and even started pulling each other’s hair.</p><br/><p>Several people went up and dragged them apart at last.</p><br/><p>“All of you, shut up! Are you guys trying to make things worse?” Wang Haojun bellowed.</p><br/><p>He thought that after Ning Xi’s fall, Han Zixuan and Starlight would have no more obstacles and that he had no more worries after that.</p><br/><p>No one expected things to take a turn like this.</p><br/><p>Not only Ning Xi was out of the mess, Han Zixuan was involved in such a huge scandal.</p><br/><p>Han Zixuan was totally ruined by the two videos. She was the core artiste in whom they had invested so much on and now that she was crushed entirely, there was nothing to be done. He could only sit and watch as the company shares dropped sharply.</p><br/><p>When he found out from Han Zixuan that it was an artiste from his own company that had sent the videos to Xu Tao, a broiling murderous intent brewed within him.</p><br/><p>“Yin Youyou, do you know how much damage you caused to the company by doing so? Where are your work ethics?” Wang Haojun released all his anger on Yin Youyou.</p><br/><p>Yin Youyou faced Wang Haojun’s anger with a sarcastic, cold laugh. “When Han Zixuan was enjoying her time at the top, why didn’t the company think about the promise made to us, about the damage caused to us? I don’t care if you want to ban me or whatever. I don’t care! I’ve had enough of this industry already!”</p><br/><p>She finally understood just how foolish her betrayal had been back then.</p><br/><p>If she had not betrayed Glory World, she would not have ended up like this.</p><br/><p>At this moment, she regretted it. After she saw through everything, she finally realized the essence of the saying “greed is so destructive that it destroys everything”.</p><br/><p>However, it was too late now.</p><br/><p>Yin Youyou took a deep breath and left despite her manager’s restraints. She ignored both Wang Haojun’s anger and Han Zixuan’s insults.</p><br/><p>…</p><br/><p>Late at night.</p><br/><p>Ning Xueluo was sent to the hospital due to a sudden pain in her abdomen.</p><br/><p>The Ning and the Su families were both informed about what had happened at the charity event.</p><br/><p>Zhuang Lingyu growled, “Zheng Minjun! Su Hongguang! Look at what your son has done! If anything happens to Xueluo, I’ll never let you guys get away!”</p><br/><p>Zheng Minjun felt a little guilty because everyone knew that Su Yan was about to divorce Ning Xueluo, but now that she heard Zhuang Lingyu scold his son, she nearly lost it.</p><br/><p>Those words were supposed to be coming from her!</p><br/><p><em>Look at what </em>your <em>daughter did!</em></p><br/><p>What did Su Yan say wrongly? If it had not been for her daughter’s seduction methods, would Su Yan have broken up with Ning Xi back then?</p><br/><p>If it had not been for Ning Xueluo’s interference, they would have already been in-laws with the Zhuang family.</p><br/><p>If it had not been for Ning Xueluo spouting lies in front of the artiste, how could people post it up online and let everyone know? The Sus had lost all their reputation now!</p></div>\n</div>"}