{"title": "Chapter 2038 - Nothing", "id": 2038, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2038-nothing", "volume_title": "Volume 21", "body": "<h1>Chapter 2038 - Nothing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>A journalist from China greeted her warmly, “CEO Ning, this is the third time History has appeared in an international fashion week representing China. How do you feel?”</p><br/><p>Ning Xueluo smiled sweetly. “I’m honored to have History recognized by professionals. I’m also very happy to represent our country to demonstrate the unique colors of our country to the world on this international stage.”</p><br/><p>Ning Xueluo’s reply was well-received by patriotic members.</p><br/><p>“Taking her personality aside, she’s pretty capable!”</p><br/><p>“She did contribute to our country’s international presence!”</p><br/><p>At the same time, the designer David was being interviewed by the media too.</p><br/><p>“Mr. David, History’s design shocked the world two years ago. It even created an Oriental fashion fever in the fashion industry, yet the performance last year was pretty bland. Will History be bringing us some surprises this year?”</p><br/><p>David looked proud as he was interviewed by foreign journalists, but his facial expression froze a little when he heard the comment about the performance last year being “pretty bland”, He replied confidently, “I spent two years on this upcoming work. I believe it won’t disappoint everyone!”</p><br/><p>Suddenly, many journalists turned towards the direction of the entrance.</p><br/><p>The chatroom in the streaming sites was spammed.</p><br/><p>“Ah! Bro Xi, Bro Xi, Bro Xi!”</p><br/><p>…</p><br/><p>In contrast to the other female stars wearing extravagant outfits, Ning Xi wore a simple champagne two-piece vest and dress. Aside from a few stitches on the dress and collar area, there were no extra ornaments. It was very clean and sleek, very much different from what everyone expected.</p><br/><p>During international fashion weeks, guests were there to watch the shows, yet more and more people turned from seeing the shows to walking the shows, transforming the event into an attention-seeking contest. The situation was much worse back in China.</p><br/><p>Ning Xi’s simple and neat appearance gave a positive impression to many foreign journalists and people from the fashion industry.</p><br/><p>In addition to the news of Ning Xi starring in “Assassin”, she had a lot of exposure internationally, so many foreign journalists interviewed her, breaking the glass ceiling of China’s artistes being neglected.</p><br/><p>Fans were really excited to see her on the live stream.</p><br/><p>With Ning Xi’s appearance, Ning Xueluo’s expression darkened. However, she looked relieved when Ning Xi walked towards the row in the back.</p><br/><p>While Ning Xi had a lot of endorsements, she had never endorsed any clothing brands. It was impossible for her to receive an invitation from big brands. Invitations received from magazines would usually be for back row seats, or she might not even have a seat herself.</p><br/><p>Ning Xueluo sat on the first row as she glanced at Ning Xi walked to the very last row.</p><br/><p><em>So what if you are at the top of the entertainment industry?</em></p><br/><p><em>In here, you are nothing!</em></p><br/><p>Ning Xueluo was chatting with several industry experts happily, but in the next second, she was stunned.</p><br/><p>After Ning Xi greeted Qin Shuang sitting in the last row, she walked towards the first row and sat down in an empty seat.</p></div>\n</div>"}