{"title": "Chapter 2041 - It's My Design", "id": 2041, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2041-its-my-design", "volume_title": "Volume 21", "body": "<h1>Chapter 2041 - It's My Design</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The instant she heard those two words, Ning Xi’s pupils suddenly shrunk and there was a bone-chilling coldness in her eyes.</p><br/><p>It really was “Rainbow Feathers”</p><br/><p>David had even been so arrogant that he did not change a single word of the name.</p><br/><p>No wonder Gong Shangze would react like that.</p><br/><p>Ning Xi studied the young man who was burning like raging flames in the dim corner and pondered for a moment before she picked up her phone. She typed a text message before clicking “send”.</p><br/><p>Gong Shangze felt the buzz of his phone. He braced himself and unlocked his phone, his vision blurry as he clicked on the message.</p><br/><p>The moment he saw that message, it was as if the charging anger inside that dizzied him was like a wild beast that had been consoled. It instantly quieted down.</p><br/><p>The place was filled with unceasing high praises. The live stream continued to be refreshed. David, who was surrounded by the media, was still going on about the journey of his process.</p><br/><p>In the corner, a young man slowly took the mask on his face off. He stood up straight in the crowd as he said word for word, “Rainbow Feathers is my design. It’s my work that I completed myself!”</p><br/><p>This voice was akin to splashing a bucket of cold water into the raging blaze. The warm atmosphere suddenly fell silent and there was pin-drop silence.</p><br/><p>Everyone’s gazes instantly moved away from David to that young man with a darkened gaze.</p><br/><p>The young man had a delicate and handsome face, yet his face was as pale as a sheet while the fire in his eyes could set the whole palace on fire.</p><br/><p>David was enjoying both the glory and the benefits when he suddenly heard this nightmarish voice as if a sudden thunder had struck down from the heavens.</p><br/><p>When he rigidly turned over and had a good look at that young man’s face, he was instantly stunned.</p><br/><p>Gong… Gong Shangze!</p><br/><p>He had actually seen Gong Shangze!</p><br/><p>Impossible, how could it be Gong Shangze!?</p><br/><p>This was impossible!</p><br/><p>He had been clearly begging on the streets of Lorraine. Obviously, he should have gone crazy and died in some dismal alley.</p><br/><p>How could he be dressed so neatly and appear at Lorraine International Fashion Week!?</p><br/><p>Everyone else’s gazes were fixed on Gong Shangze at the moment. They did not notice the peculiar expression that flashed across David’s face.</p><br/><p>All of the media and guests present exchanged looks in confusion. Moments later, they finally returned to their senses.</p><br/><p>One of the journalists asked with hostility, “Excuse me, Sir, who are you?”</p><br/><p>Gong Shangze was the worst at interacting with people. He even had to put on a face mask and wrap himself tightly when attending such an event before feeling a sense of security, what more speaking when so many eyes were on him.</p><br/><p>The young man’s palms were sweaty until he noticed the radiant gaze amidst the crowd that had been illuminating him throughout.</p><br/><p>“Spirit’s chief designer, ZX. My Chinese name is Gong Shangze!” The young man enunciated word for word clearly.</p><br/><p>The instant he finished, the crowd started to discuss in disbelief again.</p><br/><p>“Spirit’s chief designer?”</p><br/><p>“Ah! Turns out he’s that legendary designer from Spirit that has never shown his face, ZX!”</p><br/><p>“But what did his words earlier mean? He actually said… Rainbow Feathers was his design and that he had completed it himself? Isn’t that preposterous? How could History’s work have been completed by Spirit’s designer?”</p><br/><p>…</p><br/><p>David stared straight at the young man that he had not seen for two whole years.</p><br/><p>Not only did the young man not show a single trace of being in dire straits, instead, he had dressed up fittingly. Even the usual cowering in front of the public was gone, which was why he almost could not recognize him at first look.</p></div>\n</div>"}