{"title": "Chapter 2050 - A Big Liar", "id": 2050, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2050-a-big-liar", "volume_title": "Volume 21", "body": "<h1>Chapter 2050 - A Big Liar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Akas went deep in thought when he heard David.</p><br/><p>He was the one who had brought up David and introduced him to Adam back then. He was also responsible for bringing David into the society and giving him important roles.</p><br/><p>He would have to bear the responsibility if what Gong Shangze said was true.</p><br/><p>Akas carefully confirmed with Gong Shangze again, “Mr. Gong, can you prove that ‘Rainbow Feathers’ is yours and that David stole all your other designs?”</p><br/><p>In her seat, Ning Xueluo was a little relieved when she saw there was a change of events.</p><br/><p>Somewhere else on the first row of seats, Ning Xi put her finger against her forehead and smiled. “They are really stubborn…” Ning Xi mumbled to herself and then quietly sent a message from her phone.</p><br/><p>Soon, a staff member went up to Akas swiftly and whispered something to him. Akas frowned and stayed silent. In the end, he still nodded.</p><br/><p>After a while, as if waiting for David’s final struggle, countless design drafts appeared on the screen in the back.</p><br/><p>Everyone looked over. David stared right onto the screen, an uneasy feeling filling his chest…</p><br/><p>On the big screen, there was a series of History’s work.</p><br/><p>David’s drafts were on the right. Another set of similar drafts were there too, but with Gong Shangze’s signature on them.</p><br/><p>While the drafts on the right looked similar, after closer inspection, there were very slight differences, and those differences made everything clear.</p><br/><p>People in the industry already knew what was happening. David had taken those half-completed drafts, and now these half-completed drafts were completed by the original designer, Gong Shangze.</p><br/><p>It did not end there.</p><br/><p>Soon, David’s design in the past year flashed on the screen. While the style looked similar, it was obvious even to amateurs that something was lacking compared to the designs before.</p><br/><p>Identical designs appeared beside the drafts again, and the signatures on the drafts were all of different names.</p><br/><p>“Hey, what’s happening?”</p><br/><p>“Similar design, but different signatures? What does that mean?”</p><br/><p>…</p><br/><p>David’s face went pale and started to freak out when he saw the same drafts appearing with different people’s signatures…</p><br/><p>Before he could react, a video popped up. There was a man wearing a face mask.</p><br/><p>The man’s secretive voice echoed in the hall, “Since a year ago, David had me look for a large group of designers and have them submit drafts every month. He’ll pick the drafts he likes the most and pay a hefty sum of reward!</p><br/><p>“Designers who took on the job were mostly designers without connections and money, so work like this a gift to them. These are the bank transactions between David and I. He bought all the designs in the past year from me.”</p><br/><p>A huge scandal was just exposed before everyone’s eyes.</p><br/><p>History’s lead designer was actually a thief, a liar, and did not even know about design. He was a liar who only stole other people’s work!</p></div>\n</div>"}