{"title": "Chapter 2066 - You Do It Then", "id": 2066, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2066-you-do-it-then", "volume_title": "Volume 21", "body": "<h1>Chapter 2066 - You Do It Then</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Uhh, no need? Boss, what do you mean?” Jason asked in a weak tone.</p><br/><p>“Do you want a chance to redeem yourself?”</p><br/><p>Jason’s eyes brightened. He never thought that he would still have a chance to live after his head was nearly separated from his neck.</p><br/><p>After that, a certain useless boss apologized and cried to Ning Xi to prove his loyalty. He also promised to listen to whatever she said. Otherwise, she could throw him into the sea.</p><br/><p>Ning Xi planned to leave after things cleared up, but the sharp-thinking Bardy seemed to have observed Ning Xi’s group carefully. He noticed that the bored-looking long-haired man who seemed impatient was the top among the group. Having done his research, he forced several kitchen staff from Kentucky to go over and cook. He even bought several KFC in Los Angeles and gave it to them as a gift until Ning Xi finally agreed to stay.</p><br/><p>Ning Xi’s group all stayed over at Solomon for a night.</p><br/><p>Master Han Xiao left swiftly after he was done with his meal. Ning Xi also then parted ways with Feng Xiaoxiao and Tang Ye.</p><br/><p>Two days later, her job at Los Angeles was done and she went back home.</p><br/><p>The trip to Los Angeles this time had so many surprises in store for her…</p><br/><p>…</p><br/><p>At the Ning Residence in China.</p><br/><p>After they returned, Ning Xueluo made up an excuse and went back to her own house. She could not take Zheng Minjun’s sarcasm anymore.</p><br/><p>She had given Zheng Minjun an invitation card to the Lorraine Fashion Week too, so she was there the whole time when the incident happened.</p><br/><p>She thought History would be able to shine this time, but who knew that things would have turned out like this?</p><br/><p>Zheng Minjun felt so embarrassed that she went back alone. Her attitude towards Ning Xueluo became much worse, and from time to time, Zheng Minjun always compared her to Ning Xi.</p><br/><p>In addition to History’s worsening situation, she was really in a pinch.</p><br/><p>Ning Xueluo plonked herself down on the sofa. After a while, she heard footsteps outside the door. Ning Yaohua and Zhuang Lingyu had returned.</p><br/><p>Zhuang Lingyu seemed overjoyed to see Ning Xueluo. “Xueluo is back!”</p><br/><p>She then looked at her and frowned. “Have you gotten skinnier? You’re pregnant! How could that happen?”</p><br/><p>Ning Xueluo gazed down with a glum expression. “Mother, I’m alright. It’s just that the company has been busy lately…”</p><br/><p>Ning Yaohua spoke up, “History’s matter is not your fault. Don’t blame yourself so much.”</p><br/><p>Zhuang Lingyu held Ning Xueluo’s hand and sat down on the sofa. “I told you that damned girl just likes to go against us! Now, you should believe me! If she hadn’t do it on purpose, why was it that of all designers, she hired that one?! And she even humiliated Xueluo in front of so many people!”</p><br/><p>Ning Yaohua knew that Ning Xi was on good terms with the Zhuang family and they wanted to take advantage of that, but now they could not say anything about it. “Xiao Xi has really crossed the line this time! We’re still a family anyhow. Why does she have to make things turn out like this?! Moreover, Xueluo is pregnant. Isn’t she afraid it might affect Xueluo’s baby?”</p><br/><p>Zhuang Lingyu then said, “That’s what she hoped for!”</p><br/><p>Ning Xueluo put on a miserable expression. “Mother, you can’t blame Sister for this. It’s my fault for hiring the wrong person… but, Mother, I feel really bad. History is all I have, but now… it’s ruined…”</p></div>\n</div>"}