{"title": "Chapter 2071 - An Accident Happened", "id": 2071, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2071-an-accident-happened", "volume_title": "Volume 21", "body": "<h1>Chapter 2071 - An Accident Happened</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Two days after, “Thunderbolt Secret Service Squad” was released in theatres worldwide.</p><br/><p>It was just the first day when all the film enthusiasts, who had finished watching the entire movie, were shocked.</p><br/><p>What seven seconds?! What irrelevant character?! What cameo?!</p><br/><p>Ning Xi had acted a total of 15 minutes in the movie. In fact, her character was extremely outstanding. There was even an ambiguous romance plot with Orlando and a foreshadowing of her at the end of the movie. There could very possibly a sequel when Ning Xi would be revived and joined the filming.</p><br/><p>All of a sudden, all the fan groups were abuzz and Ning Xi’s fans were elated.</p><br/><p>“Oh, oh, oh, Bro Xi’s red <em>qipao </em>in the movie was so pretty!”</p><br/><p>“Duh! Even I as a woman watched it until I wanted to lick the screen! Especially Bro Xi’s scene with Orlando which was so full of love! I’m so excited for the sequel!”</p><br/><p>“Tomorrow I want to go watch it for the second time!”</p><br/><p>“This time, who dares to say that my Bro Xi’s ‘Assassin’ was gotten through connections and dirty tricks? I will slap them to the wall and stick them there until they can’t be pulled out! Bro Xi already entered Hollywood since a year ago! Her real abilities and foundation are all right here!”</p><br/><p>“And Ning Xueluo’s moronic fans who still haven’t given up were previously saying that Bro Xi stole Ning Xueluo’s role in ‘Thunderbolt Secret Service Squad’! Please, back then when Ning Xueluo hadn’t quit the industry, she only got a seven-second storyline. When it reached our Bro Xi’s hands, Bro Xi immediately became an important character! This was how huge the gap was!”</p><br/><p>–</p><br/><p>Inside the dim room.</p><br/><p>Ning Xueluo’s face reflected the cold light of her laptop screen. The Internet was currently covered with news about the release of “Thunderbolt Secret Service Squad”. It was nothing but flattery all around for Ning Xi.</p><br/><p>It was hers…</p><br/><p>“Thunderbolt Secret Service Squad” should have been hers!</p><br/><p>Everything Ning Xi had today should have been hers!</p><br/><p>All those eyes on her, all the applause, those flattering words…</p><br/><p>Su Yan, the Ning family…</p><br/><p>But, soon, very soon, it would all end.</p><br/><p>Ning Xueluo took the blood-red wine glass in her hand and downed it. “Ha, Ning Xi… Enjoy everything that you have right now. I’ve said it before… The higher you stand, the uglier your fall will be…”</p><br/><p>–</p><br/><p>In a certain luxury shopping mall in Imperial.</p><br/><p>Zhuang Lingyu had just finished browsing the baby shops and had a fruitful trip. She even wanted to continue although the two maids and the chauffeur beside her all had an assortment of bags in their hands.</p><br/><p>“Madam, we’ve been out for a long time today. Let’s go home! Otherwise, Master will be worried!” One of the maids quickly advised.</p><br/><p>“It’s only been an hour. Don’t listen to him, always making a fuss about nothing,” said Zhuang Lingyu with a dampened spirit.</p><br/><p>The maid smiled. “Master’s just worried about you because he cares about you. After all, Madam, your child didn’t come along easily!”</p><br/><p>When the child was mentioned, Zhuang Lingyu touched her underbelly by reflex and her eyes were filled with tenderness.</p><br/><p>She was eager to excel. She had never said in front of anyone and had always treated Ning Xueluo like her biological daughter, yet the fact that her flesh and blood was so unbearable had been something that she could not get over.</p><br/><p>Ning Xi was the largest stain in her life. No matter how she tried to sever ties, she could not change the fact that in her blood flowed in her veins.</p><br/><p>She urgently wanted to prove that the dirty stain had nothing to do with her, so she had given all of her care towards Ning Xueluo.</p><br/><p>She was obviously quite satisfied with Ning Xueluo, but if only she could get pregnant with another child, to have her own flesh and blood that would enable her to start over again, she would naturally be happy.</p><br/><p>“Let’s go.” Zhuang Lingyu was in a chipper mood, so she did not fuss over the minor matter and just answered them matter-of-factly.</p><br/><p>The few of them felt relieved. They quickly guarded Zhuang Lingyu and walked towards the carpark.</p><br/><p>Just as they were helping Zhuang Lingyu into a car, an accident happened.</p></div>\n</div>"}