{"title": "Chapter 2077 - Miss You, Miss You, Miss You", "id": 2077, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2077-miss-you-miss-you-miss-you", "volume_title": "Volume 21", "body": "<h1>Chapter 2077 - Miss You, Miss You, Miss You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>On the side, Han Momo blushed when she eavesdropped on her mother’s words. “I didn’t, Mother! Don’t simply say things!”</p><br/><p>Ning Xi laughed lightly without minding at all. “Momo is great and she’s beautiful. She’s very popular in the office.”</p><br/><p>“Aww, really?” Mother Han was being humble, but just from her tone, you could tell that she was delighted.</p><br/><p>Ning Xi and Mother Han chatted for quite a while before she hung up. She even made Mother Han forget the thought about urging her to get a boyfriend. Han Momo shed tears of gratitude, wishing she could devote her life to her.</p><br/><p>“Bro Xi, thank God you’re not a man. Otherwise, the young ladies in our office would fight at least once a day!”</p><br/><p>Ning Xi watched the bouncing little girl’s figure leaving and laughed as she shook her head.</p><br/><p>While she had been at the Tang residence, because they valued men over women, she basically had the same existence as someone invisible. The fact that she did not get ditched and managed to survive was already very fortunate. When she returned to the Ning family, she was finally no longer invisible, but she had to live extremely cautiously under harsh and probing gazes…</p><br/><p>It seemed like she had never experienced how normal people lived like, and how to interact with parents…</p><br/><p>She was in a daze when suddenly, there was a text notification on her phone.</p><br/><p>Lu Tingxiao, who had just gone abroad to Country F for work that morning, had sent quite a few texts in a row.</p><br/><p>[This morning, the temperatures dipped. I’ve told Wan Wan to send clothes to you. Remember to wear it. Don’t start enjoying the cold.]</p><br/><p>[I’ve brewed some bird’s nest for you. You just have to put it in and set it to automatically stew. Do remember to eat it.]</p><br/><p>[I’ve taken a look at that script. It suits you very well, so you should take it.]</p><br/><p>[Miss me?]</p><br/><p>When she saw the last couple of words, the corners of Ning Xi’s mouth could not help but curve up.</p><br/><p>Please! They just had not seen each other for five hours and he should have just alighted from the plane.</p><br/><p>Ning Xi sprawled across the table as she smiled and replied with a text. “In the first second that you left, I missed you. In the second second that you left, I missed you and missed you. In the third second that you left, I missed you, missed you, missed you… I’ve already missed you eighteen thousand times…”</p><br/><p>…</p><br/><p>In the lobby of Spirit, there was a clamorous noise of discussion.</p><br/><p>A group of staff looked over when they heard the commotion.</p><br/><p>“Miss Ning, we’re sorry. You can’t enter without an appointment!”</p><br/><p>“Miss Ning! Stop trying to charge in! Please don’t make things hard for us!”</p><br/><p>“Miss Ning… Miss Ning…”</p><br/><p>They saw that the receptionist was blocking a woman, who was unexpectedly the boss of History, Ning Xueluo.</p><br/><p>“What’s going on? Why’s Ning Xueluo on our turf?”</p><br/><p>“Huh! Is she still thinking of tearing down our store?”</p><br/><p>“Doesn’t look like it! If she was tearing down our store, why would she come alone?”</p><br/><p>“What’s she doing again!? Whatever it is, it’s definitely nothing good!”</p><br/><p>The crowd saw that Ning Xueluo seemed very emotional. No matter how the receptionist pleaded with her, she would not listen. She just kept repeating, “I have an emergency to see Ning Xi about! Please get her to come out to see me!”</p><br/><p>The staff still did not let her in. Ning Xueluo was already very stirred up and continued to charge in. “Sister! Don’t avoid me! What’s between us should have settled already! Back then, no matter what you did to me, I can handle it, but this time, you’ve gone overboard! If you have any hatred, feel free to come for me. I’ll take it all! Why did you have to take it out on Mother?! You didn’t even let go of an innocent child!”</p><br/><p>There was an overload of information in Ning Xueluo’s words, and all the surrounding stuff were instantly stupefied.</p><br/><p>“What’s that Ning Xueluo saying?”</p><br/><p>“Seems like she’s saying that our boss did something to her mother? And she even said that Boss didn’t even let go of a child?”</p><br/><p>“It’s probably nonsense!”</p><br/><p> </p></div>\n</div>"}