{"title": "Chapter 2078 - Acting Skills", "id": 2078, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2078-acting-skills", "volume_title": "Volume 21", "body": "<h1>Chapter 2078 - Acting Skills</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Spirit staff knew that Ning Xueluo was pregnant and did not dare to touch her, so they just let her barge in.</p><br/><p>The receptionist was worried and quickly called Ning Xi. “CEO Ning, Miss Ning Xueluo suddenly came over to look for you without an appointment. We tried to stop her, but she seems very agitated. She said some odd stuff, then barged inside when weren’t noticing!”</p><br/><p>There was a short silence over the phone, then Ning Xi’s soothing voice came through. “What did she say?”</p><br/><p>The receptionist sounded a little hesitant. “She said that… matters between the both of you should be settled and questioned why you harmed your own mother… and how you even harmed an innocent child… I’m sorry. She’s pregnant, so we’re worried something might happen and didn’t force her out…”</p><br/><p>“I understand. Get everyone back to their positions.”</p><br/><p>“Got it, CEO Ning.”</p><br/><p>After a small hiccup, the company returned back to normal.</p><br/><p>Ning Xi hung up the phone in her office.</p><br/><p>Ning Xueluo had come to look for her and kicked up such a big fuss?</p><br/><p>This was not like her at all…</p><br/><p>Harmed Mother?</p><br/><p>An innocent child…</p><br/><p>She heard the news about Zhuang Lingyu being pregnant, but Ning Xueluo’s words seemed to indicate that the child was gone.</p><br/><p>There was some noise outside the door. Someone pushed through the door and entered.</p><br/><p>The few security guards looked troubled as they stood behind Ning Xueluo. “Boss, she…”</p><br/><p>“It’s alright. You guys can go back now.”</p><br/><p>“Okay!” The guards were relieved and then left.</p><br/><p>Suddenly, the large office room was only left with the two of them.</p><br/><p>Ning Xueluo’s hair looked messy and her makeup was smudged too. She looked miserable as a whole, and she seemed like she was about to break down anytime. She knelt on the floor before Ning Xi. “Sister, I beg you, no matter how much you hate me, just come at me. Don’t hurt anyone else…”</p><br/><p>Ning Xi’s mouth twitched. She felt that the Oscars owed her an award.</p><br/><p>The way she acted like she was in pain and blamed herself for her mother’s loss of her child, no one would doubt her for not being a filial daughter.</p><br/><p>“That’s enough. There isn’t anyone else in here. You don’t have to show me how skilled you are at acting.”</p><br/><p>Ning Xueluo’s expression changed suddenly and she became oddly calm out of a sudden.</p><br/><p>She stood up slowly and carefully tidied her messy hair as she smiled. “CEO Ning, it’s really tough to meet you today.”</p><br/><p>“What’s the matter, Miss Ning?”</p><br/><p>Her address of “Miss Ning” sounded extremely sarcastic and Ning Xueluo was taken aback.</p><br/><p>“Of course, I’m here to see how great you’re doing!” Ning Xueluo’s face darkened like an endless abyss. “Ning Xi, you must be very happy now, aren’t you? You forced me out of the entertainment industry and let everyone know that I’m just a daughter from a rural area, and you even told the whole world about Su Yan’s intention to divorce me! And now, you’ve even destroyed History. My reputation is all gone. I have nothing left. Aren’t you happy now?”</p><br/><p>The only thing she had left was her identity as Mrs. Su. If it were not for the child in her womb, the Su family would have abandoned her a long time ago.</p><br/><p>This witch…</p><br/><p>She had actually pushed her to such lengths!</p></div>\n</div>"}