{"title": "Chapter 2090 - How Terrifying", "id": 2090, "volume": 21, "url": "http://boxnovel.org/hidden-marriage-chapter-2090-how-terrifying", "volume_title": "Volume 21", "body": "<h1>Chapter 2090 - How Terrifying</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Zhuang Lingyu was dumbfounded. She could not believe it. Ning Yaohua was shocked as well. He could not believe the girl in front of him right now was Ning Xueluo, the sweet and obedient daughter of theirs.</p><br/><p>He could not believe that she had been harboring thoughts like those!</p><br/><p>“G-gosh…” No one expected such a twist and they were all stunned.</p><br/><p>Zhuang Lingyu’s child was not harmed by someone else. It had been killed by her filial daughter, Ning Xueluo.</p><br/><p>Moreover, she had driven the motorbike herself, almost killing the mother who had been treating her like a real daughter for the past twenty-odd years.</p><br/><p>She was just a daughter of a village woman, who got to enjoy all the privileges over the years because of a mistake. These were all not hers to begin with. Without the Ning family, she would just be another ordinary girl from a rural area, yet she took everything from the Ning family for granted. She felt that everything from the Ning family should be hers.</p><br/><p>Just because Zhuang Lingyu’s son might take the inheritance away from her, she had killed the child.</p><br/><p>What was really scary was that she had been taking on the role of the victim, even trying to blame everything on Ning Xi.</p><br/><p>Everyone felt chills run down their spine.</p><br/><p>This woman had tricked everyone. Just how cunning could she be?</p><br/><p>How terrifying!</p><br/><p>Ning Yaohua was shocked to his core. He was very enraged by Ning Xueluo’s ridiculous reasoning. “You monster! The Ning family took care of you for twenty over years. We’ve never asked for your gratitude, yet you repay us with such evil behavior!”</p><br/><p>Ning Xueluo cackled as if she had just heard a joke. “Haha, gratitude? What should I be thankful for? I got everything I had today because of myself! And just what did Ning Xi do!? She just has some blood of the Ning family inside her. She didn’t even do anything and this old geezer gave her 10% of shares. I didn’t even get any!”</p><br/><p>Ning Yaohua yelled at her, “But I’ve transferred all the shares I have to you! You already have 20% in your hands. Are you not satisfied!?”</p><br/><p>Ning Xueluo laughed sarcastically, “President Ning, don’t make it sound so kind. The reason you gave me the shares was all for the marriage with the Su family. Could you really say that you’d still give them to me if you had a son?”</p><br/><p>“That’s why you killed your mother’s child!?” Ning Yaohua shrieked.</p><br/><p>Ning Xueluo did not have any sense of remorse in her eyes. “Don’t blame me when you’re forcing me into a corner! This child should have never existed!”</p><br/><p>…</p><br/><p>Ning Xi stood aside watching the three of them attacking each other.</p><br/><p>She then interrupted, “Sorry to interrupt, but I’d like to ask Ms. Ning, did you… really do it?”</p><br/><p>Ning Xueluo glared at Ning Xi. “Stop pretending you don’t know already, Ning Xi!”</p><br/><p>Ning Xi put up an innocent expression. “But I really did fake the video. The place where you destroyed the evidence had no security cameras at all, don’t you know? I asked the special effects artist from the ‘Thunderbolt Secret Service Squad’ to help me remake the scene. It’s pretty rough around the edges, so I didn’t expect you to believe it… Oh right, the fingerprints and blood samples…”</p><br/><p>Ning Xi glanced at Lu Tingxiao.</p><br/><p>He opened the brown folder and there was no evidence inside. It was all… pictures of a wedding in a cathedral…</p></div>\n</div>"}