{"title": "Chapter 2109 - All These Images", "id": 2109, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2109-all-these-images", "volume_title": "Volume 22", "body": "<h1>Chapter 2109 - All These Images</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>A birthday song started to play as a tall birthday cake with more than ten tiers was presented. Lu Jingli and Zhuang Rongguang pushed it out together on a cart.</p><br/><p>The crowd gave a round of applause as they sang the birthday song together and celebrated Lu Tingxiao’s birthday. They also gave their blessings to the family of three.</p><br/><p>Little Treasure and Lu Tingxiao wore pairing outfits today. The father and son duo wore a similar color to Ning Xi’s, and the three of them looked amazing together.</p><br/><p>With candlelight and music as the background, pictures started appearing on the huge LED screen. All of them were memories of the daily lives between Ning Xi, Lu Tingxiao, and Little Treasure.</p><br/><p>Most of the pictures had been taken by Lu Jingli. Even Ning Xi had been unaware of when the photos were taken.</p><br/><p>There were pictures of Lu Tingxiao wearing a bright blue suit for the first time, Ning Xi cooking in the kitchen, Little Treasure and Lu Tingxiao helping her, and even the costume party at Little Treasure’s school. Ning Xi had gone as the Little Red Riding Hood while Little Treasure and Lu Tingxiao became the small wolf and big wolf respectively, amusing everyone</p><br/><p>No one could imagine that the aloof Lu Tingxiao would do something like this. Never would they imagine him wearing a cute wolf outfit and even attending his son’s costume party!</p><br/><p>The girl looked gentle and lovely while the child looked cute. The usually emotionless man looked genuinely warm and content in the photos.</p><br/><p>Lu Jingli was really excited to see everyone’s shock.</p><br/><p>He could finally let everybody get a taste of all the images he had been seeing until now!</p><br/><p>All the singles at the party were really hurt as Lu Jingli wished.</p><br/><p>“Second Master! That’s enough!”</p><br/><p>“Stop it! Are you still human!?”</p><br/><p>“Leave us singles alone!”</p><br/><p>…</p><br/><p>Everyone looked envious. “The three of them look just like a real family. It doesn’t look like Ning Xi is a stepmother at all!”</p><br/><p>“This woman is really something. She can even deal with that child! That child isn’t an easy person to please!”</p><br/><p>Aside from envy, there were also some negative voices in between. “While the two of them look good together, I bet Ning Xi’s life is going to be tough from now on. The stepmother always has it rough!”</p><br/><p>“That’s true! Being a stepmother at such a young age and in that sort of huge family… If she doesn’t deal with things well, huge conflicts might occur. She’s not his biological mother, after all.”</p><br/><p>…</p><br/><p>While these words were expected, they still sounded oddly annoying.</p><br/><p>Lu Jingli saw the expression of the little bun change. He quickly changed to another disc and played some cute pictures of his brother when he had still been little, trying to lighten the mood.</p><br/><p>The LED screen darkened, then the photos of the three of them disappeared, but it soon lit up again and started playing another set of photos.</p><br/><p>Lu Jingli grinned. “Bro, there’s a picture of you butt naked when you were little…”</p><br/><p>Lu Tingxiao slowly turned his head over at his brother threateningly.</p><br/><p>Lu Jingli was terrified. “No! At most, it’s just showing your belly button! I know that only your wife can see those pictures! Don’t worry, Sister-in-law, I’ll send them to you later!”</p></div>\n</div>"}