{"title": "Chapter 2113 - To Everyone's Delight", "id": 2113, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2113-to-everyones-delight", "volume_title": "Volume 22", "body": "<h1>Chapter 2113 - To Everyone's Delight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lu Tingxiao knew that Ning Xi cared about kinship. Previously, for the sake of her foster parents, he was not ruthless to Ning Xueluo.</p><br/><p>Yet, that woman still did not know how to be remorseful until now. Since Ning Xi could not make the move, then he would take action!</p><br/><p>…</p><br/><p>Late at night, the guests had dispersed. This birthday banquet of many twists and turns had finally ended.</p><br/><p>Once the banquet concluded, Yan Ruyi and Lu Chongshan immediately pulled Lu Jingli aside.</p><br/><p>“Jingli, what actually happened?! Is Ning Xi really Little Treasure’s mother?” Yan Ruyi asked impatiently.</p><br/><p>Lu Jingli nodded with a serious expression. “That night seven years ago, the girl that my brother was with, was actually Sis-in-law. At that time, Sis-in-law had been drugged by Ning Xueluo, who had initially arranged for people to ruin Sis-in-law’s innocence. Sis-in-law had accidentally entered the wrong room and entered Bro’s room instead…”</p><br/><p>Yan Ruyi and Lu Chongshan exchanged glances as they listened to him. They never would have thought that there would be such a coincidence in this world.</p><br/><p>“Huh, you guys know the rest of the story too. Back then, Bro was also drugged. At that time, he and Sis-in-law were both made delirious by the drugs, so they had no memory of that night at all. Bro and I only found out about the truth around two years ago. Later on, our hunch was confirmed by the DNA test. Our guess was right. That night, the person who was with Bro was indeed Sis-in-law!</p><br/><p>“However, because the incident years ago had caused too much damage to Sis-in-law, Bro didn’t dare to admit that the person was him. That’s why he never came out with the truth until today, Ning Xueluo came to cause trouble…”</p><br/><p>Then, Lu Jingli explained to the two elders about how Ning Xi got pregnant, and the reason why she did not abort the child.</p><br/><p>Yan Ruyi and Lu Chongshan became angrier as they listened.</p><br/><p>“That Ning Xueluo is insane! Thankfully it was your brother. If…” Yan Ruyi dared not imagine.</p><br/><p>“This incident was too huge of an impact to Sis-in-law. She’s been living with the trauma all these years. Back then, the reason she kept rejecting Bro was not even ‘to loosen the reins, only to grasp them better’ as you thought. It was because of this incident that she wasn’t willing to accept any man,” said Lu Jingli with a solemn expression.</p><br/><p>When they heard their son’s words, Lu Chongshan and Yan Ruyi looked ashamed with guilt. Yan Ruyi sighed, “Xiao Xi is a good girl. Even if something like that had really happened to her, it’s not her fault.”</p><br/><p>Then, her expression turned joyful again. “Now, that’s great actually! It turns out to everyone’s delight! Xiao Xi <em>is </em> Little Treasure’s biological mother. How amazing! Little Treasure will be so happy!”</p><br/><p>When Lu Chongshan heard this, he frowned and said with a lowered tone, “But Jingli said earlier that Xiao Xi hated that man from those years ago. Now that she knows the person was Tingxiao…”</p><br/><p>When they heard this, suddenly, all three of them fell silent.</p><br/><p>–</p><br/><p>In the garden of their house in Deer Town.</p><br/><p>It was only when they reached home that Ning Xi finally had a chance to speak with Lu Tingxiao privately.</p><br/><p>In the garden, the two of them stood quietly under a rack of Japanese roses.</p><br/><p>Ning Xi looked fatigued. Today was her first time making an official appearance as Madam Lu. She never would have thought that so many things would happen, but thankfully it was resolved without any mishap.</p><br/><p>Ning Xi sat down on the chair at the side. “Lu Tingxiao, how did you get Dr. Zhao to help you?”</p><br/><p>After she woke up from her coma, Dr. Zhao had been attending to her recuperation apart from Annie, so she was quite familiar with him too. She knew he valued his reputation and professional integrity, so he definitely would not falsify anything for someone else.</p><br/><p>Lu Tingxiao must have spent a lot of effort to convince him.</p></div>\n</div>"}