{"title": "Chapter 2138 - Such A Past", "id": 2138, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2138-such-a-past", "volume_title": "Volume 22", "body": "<h1>Chapter 2138 - Such A Past</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Back then, all these years, what kind of shady business have you been doing behind my back? Did you think I really wouldn’t know? Kid, you’re too ambitious!” Jace’s gaze was exceptionally stern.</p><br/><p>“Father… I…!” Baron was already drenched in sweat as he tried hard to explain.</p><br/><p>“Get lost!”</p><br/><p>Jace’s terrifying aura was enough to swallow Baron whole. “As strong as you may be, the position of the head of the Rothschild clan won’t be yours. Go right back now. For the next ten years, you’re not allowed to leave the house at all!”</p><br/><p>“Ten years?!” Baron was in disbelief.</p><br/><p>“Take him away. If anything goes wrong, you people will have to be responsible for the consequences!” Jace glared at the group of people from the clan in the resort and said coldly.</p><br/><p>“Understood!”</p><br/><p>An European elder immediately waved his hand. “Bring Third Master back and watch him stringently.”</p><br/><p>“Father, I don’t want to… I don’t want to! My capabilities are clearly the strongest. Why?!” Baron’s hysterical voice became further and further away until it vanished.</p><br/><p>“My Rothschild family… is lacking capabilities the most,” Jace sighed softly, his eyes showing a hint of iciness in them.</p><br/><p>“Mr. Lu, I’m very sorry. I didn’t teach my son well and have caused so much trouble for you all.” Jace walked up looking apologetic.</p><br/><p>When Han Wuying saw that Baron had lost his power, he immediately withdrew and retreated.</p><br/><p>If he continued to fight with Han Xiao, he would definitely be defeated without a doubt.</p><br/><p>Now, the European King had appeared himself and even Baron had been taken away to be locked up. Han Wuying could not beat Han Xiao; there was no chance of winning at all.</p><br/><p>“Not fighting anymore?” Han Xiao stared at Han Wuying and said.</p><br/><p>“Huh!” Han Wuying scoffed, and in a flash, his figure left the resort.</p><br/><p>“Running away because he couldn’t win, how rude!” Han Xiao felt quite unamused, then his gaze fell on the European King.</p><br/><p>“Old fart, you’ve finally showed yourself!” Han Xiao’s usually nonchalant eyes suddenly lit up with a sinister fierceness.</p><br/><p>“Mr. Han Xiao.” Jace looked at Han Xiao. “Regarding that incident years ago, I’m very sorry. Even though I’ve admired the ancient Han family for a long time and your talents too, I wanted you to marry my youngest daughter, but I’ve never insisted on it. Back then, it was because your family wanted to force you to marry my daughter that they killed Miss Qin Youge. It has nothing to do with the Rothschild clan. Besides, haven’t you already taken out the murderer who killed Miss Qin Youge back then?”</p><br/><p>When he heard this, Han Xiao was stunned. “Old fart, you really know how to talk!”</p><br/><p>Jace Rothschild was not angry, instead he had very calmly stated, “It’s the truth.”</p><br/><p>Through Han Xiao and Rothschild’s words, Ning Xi, Tang Lang and the rest finally knew Han Xiao’s identity.</p><br/><p>The ancient Han family’s most evil and charming genius caught the admiration of the European King. Initially, he wanted to let Han Xiao marry his youngest daughter, yet in the end, he had indirectly killed a girl named Qin Youge.</p><br/><p>“It turns out that Grandfather has such a past!” Tang Lang was shocked.</p><br/><p>“GE…”</p><br/><p>At this moment, Ning Xi came to a sudden realization. That fashion brand “GE” was Han Xiao’s design.</p><br/><p>At the start, Ning Xi did not know the meaning of “GE”.</p><br/><p>Now, she realized that “GE” referred to “Ge”. Han Xiao had created it to commemorate that girl…</p><br/><p>Swoosh!</p><br/><p>At this moment, a pitch-black figure suddenly appeared in the resort. He came close at the speed of light and used his or her palm to hack out at Han Xiao without warning.</p><br/><p>“Careful, Grandfather!” Tang Lang could not help but cry out.</p><br/><p>The figure’s speed was incredibly breakneck.</p><br/><p>At this moment, Han Xiao’s expression turned cold. “I hate ambushes the most.”</p><br/><p>Then, Han Xiao did not even turn his head as he gripped that little palm that had struck out.</p><br/><p>Bam!</p><br/><p>Han Xiao’s figure wavered as he straight up flung the figure far away.</p><br/><p>“Annie!” Ning Xi cried out in alarm.</p></div>\n</div>"}