{"title": "Chapter 2134 - Settle All The Grudges", "id": 2134, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2134-settle-all-the-grudges", "volume_title": "Volume 22", "body": "<h1>Chapter 2134 - Settle All The Grudges</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Unfortunately, the last time he had sent Xiao Zhan to assassinate him, but not only did he fail, Xiao Zhan even died in China.</p><br/><p>His expression worsened when he saw Han Xiao who had always foiled his plans.</p><br/><p>“Hahaha, are you surprised? It’s fun, isn’t it?” Tang Lang seemed very cheerful when he saw Baron’s stunned face.</p><br/><p>Baron stared at Han Xiao, his expression souring ,and he did not say a word.</p><br/><p>“Well, it’s really rare for you to come out. It saves me time to look for you guys in Europe.” Han Xiao stood up and yawned, not seeming motivated.</p><br/><p>Baron grinned, then he flashed a cold smile with the intention to ridicule. “Haha, I didn’t expect that Grandfather Xiao has fallen to the state whereby you’re being ordered around by two little fish. The Grandfather Xiao back then was…”</p><br/><p>Baron looked at Han Xiao as he continued talking, but he was frustrated by Han Xiao’s behavior. Han Xiao was not listening at all, and was discussing something with the bunch.</p><br/><p>“Do you think his father will come out if I tie him up?” Han Xiao looked at Tang Lang.</p><br/><p>“Master, that might not happen!” Tang Lang touched his chin sagely.</p><br/><p>“The European King has so many children. I think it might not work too,” Feng Xiaoxiao joined in.</p><br/><p>“Agreed.” Tang Ye nodded.</p><br/><p>“So, he’s worthless… Then, should I kill him or tie him up?” Han Xiao looked troubled.</p><br/><p>Ning Xi wanted to join the group as well. She poked her head in and suggested, “Why don’t we tie him up first?”</p><br/><p>Tang Lang then said, “Grandfather, I think let’s kill him. Let him know how amazing you are!”</p><br/><p>Feng Xiaoxiao was on Ning Xi’s side. “I agree with Little Junior Sister. Let’s tie him up and force the European King to show up!”</p><br/><p>“I’m fine with either choice,” said Tang Ye.</p><br/><p>Baron was infuriated.</p><br/><p>These people were discussing if they should kill him or tie him up right in front of him!</p><br/><p>Who was he? He was the future European King!</p><br/><p>“Han Xiao, don’t get too full of yourself!”</p><br/><p>With Baron’s words, several hundred well-trained and fully-equipped forces surrounded the resort. Looking around, there were also a lot of snipers camping out!</p><br/><p>All of them looked cautious when they noticed the presence of the snipers.</p><br/><p>These were not ordinary snipers. They were snipers who had undergone special training from the Rothschild clan. Aside from Han Xiao, everyone else could possibly die here.</p><br/><p>Tang Ye, Tang Lang, and Feng Xiaoxiao were on guard. A familiar voice came from behind and their expressions changed.</p><br/><p>“Third Master, everything is ready.”</p><br/><p>Qiao Yi led a group of trained assassins and was walking towards them. These assassins were all the elites he had. Today was all he had been waiting for.</p><br/><p>Ning Xi looked behind Qiao Yi and did not see Annie, so she frowned.</p><br/><p>Was Annie not here?</p><br/><p>Or did she not want to face them directly?</p><br/><p>The atmosphere turned extremely heavy all of a sudden.</p><br/><p>Baron was determined to acquire both the Lu Corporation and the Yi Lan Innovative Investment Group, so he would do anything to achieve his goal.</p><br/><p>“Long time no see, Master!” Tang Lang’s blood started boiling when he saw Qiao Yi. His features darkened as well.</p><br/><p>“You traitor!” Qiao Yi yelled in rage when he saw Tang Lang.</p><br/><p>The usual sloppy attitude was nowhere to be seen in Tang Lang. “What a coincidence! We’ll settle all our grudges here today! I told you in the hospital last time that I’d never go easy on you the next time!”</p></div>\n</div>"}