{"title": "Chapter 2131 - Darling Was Just Too Cute", "id": 2131, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2131-darling-was-just-too-cute", "volume_title": "Volume 22", "body": "<h1>Chapter 2131 - Darling Was Just Too Cute</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Did you forget that the Rothschild family had once sent assassins to go after the Master?” reminded Ning Xi.</p><br/><p>When he heard that, Tang Lang suddenly came to a realization. Previously, in Deer Town, the Master had suffered severe injuries as a result of the ambush by the people the other side had sent.</p><br/><p>As for Han Xiao’s past, forget about Tang Lang, even Ning Xi was not clear about it.</p><br/><p>The only thing they could be sure of was that Han Xiao and the Rothschild family had grudges between them.</p><br/><p>As for what grudges they were, the fact that the Rothschild family continuously sent assassins out to kill Han Xiao provided them some food for thought.</p><br/><p>However, according to Ning Xi and Tang Lang’s thoughts, they both agreed that Han Xiao must have once offended the Rothschild clan.</p><br/><p>After all, when it came to people like Han Xiao, who liked to stir up trouble and find someone to compare fighting notes with when he was bored, yet actually did start to fight for real, offending the Rothschilds was not out of the ordinary for him.</p><br/><p>However, this was to them no doubt a good thing.</p><br/><p>After all, Ning Xi had already used her whistle to get Han Xiao to help defeat Annie and retrieve the antidote.</p><br/><p>As for the Rothschilds, Ning Xi already had no way of getting Han Xiao’s help again.</p><br/><p>“Hehe, with Grandfather around, so what if it’s a Feast of Hongmen? We’ll still eat and drink when we’re there!” Tang Lang felt completely assured now.</p><br/><p>“What? I’m going to kill people there.” Han Xiao grinned.</p><br/><p>When he saw Han Xiao’s grin, Tang Lang could not help but shiver. This was the first time he and Ning Xi had seen such a smile on Han Xiao’s face. It was extremely strange like the calm before the storm.</p><br/><p>–</p><br/><p>When Lu Tingxiao finished settling everything, the sky had already darkened and it was getting closer to the time that the Rothschild clan had set on.</p><br/><p>Lu Tingxiao looked to Ning Xi and sternly said, “You stay here.”</p><br/><p>It was rare for Yun Shen and Lu Tingxiao to be of the same opinion. “Women should stay at home. Don’t be an inconvenience.”</p><br/><p>The Rothschild clan was extremely terrifying even in China. This time, it was clearly a Feast of Hongmen, thus naturally Lu Tingxiao did not want her to take the risk.</p><br/><p>“No, I’m going too,” Ning Xi said with determined eyes.</p><br/><p>How could she let Lu Tingxiao face the danger alone?</p><br/><p>In fact, tonight, Annie would definitely be going too. How could she feel assured without getting Little Treasure’s antidote?</p><br/><p>“It’s too dangerous,” Lu Tingxiao frowned and said.</p><br/><p>Ning Xi put her palms together. “I guarantee that this time, I’ll be very good and I’ll do as you say. Okay?”</p><br/><p>“No.” Lu Tingxiao’s tone did not show any signs of backing down.</p><br/><p>Ning Xi’s beautifully dazzling eyes suddenly turned misty. In the next second, her tears started to fall and she thrust herself into Lu Tingxiao’s embrace, her little face sticking close to his chest. Her tone sounded extremely pitiful. “But I’ll be worried about you! If I stay here alone, every minute and every second would be torture to me, darling. Let me go with you, okay?”</p><br/><p>Lu Tingxiao replied, “Okay.”</p><br/><p>On the side, Yun Shen instantly exploded, “Hey!”</p><br/><p><em>Dude! Could you have a little more principles?</em></p><br/><p>This damn brat was clearly acting. Was this guy so blind that he could not tell?</p><br/><p>Ning Xi was actually a little puzzled too. Her darling was just too cute! She had not even used a tenth of her skills and he already agreed!</p><br/><p>Lu Tingxiao reminded with a stern expression, “Remember what you said. No matter what happens, you’re not allowed to act recklessly.”</p><br/><p>He knew that once Ning Xi made her decision, no one could make her change her mind.</p><br/><p>Besides, for the meeting this time, he had already been putting things in order and he had made thorough preparations.</p><br/><p>Ning Xi nodded extremely obediently. “Mm-hmm!”</p><br/><p>“Don’t worry, Grandfather and the Rothschild clan have grudges, so this time he’ll be going to the meet up with us. Let’s just sit back and wait to watch a good show!” Tang Lang looked delighted, clearly riding on someone else’s power.</p><br/><p>When they heard this, Feng Xiaoxiao and Tang Ye were secretly relieved too. With Han Xiao around, they felt that a lot more assured.</p></div>\n</div>"}