{"title": "Chapter 2142 - Too Boring", "id": 2142, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2142-too-boring", "volume_title": "Volume 22", "body": "<h1>Chapter 2142 - Too Boring</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>As she listened to this old man reminisce about the past, seeing the way he blamed himself, Ning Xi felt a mix of emotions.</p><br/><p>The elder before her was not some European King who shocked the entire underground world. He was just a regular father.</p><br/><p>No wonder the first time they met, he was already so friendly to her. It turned out that he had seen his daughter in her.</p><br/><p>“Even though Miss Caroline has passed away, she left the most beautiful scene for everyone. She didn’t only work hard for you. It was also for her dreams. I believe that she has never blamed you!” Ning Xi said.</p><br/><p>“You really think so?” Jace’s eyes suddenly glistened.</p><br/><p>Ning Xi nodded. “If it were me.”</p><br/><p>“Thank you…” Jace let out a long sigh as if he could finally put his burden down.</p><br/><p>Then, he looked at Ning Xi and said, “I’m returning to Europe tomorrow. Xiao Xi, if you ever come to Europe, you have to contact me. Let me do the honor of being your host.”</p><br/><p>“I definitely will!”</p><br/><p>With Jace’s departure, the European King’s people all retreated. Lu Tingxiao’s and Yun Shen’s people all followed suit and went back too.</p><br/><p>The huge Heavenly Spring Resort returned to its usual tranquility. The scenery was beautiful and it was a wonderful spring day. It was as if all the things earlier had not just happened.</p><br/><p>As for the huge battle this time, the only person who had died was unexpectedly… Qiao Yi…</p><br/><p>Ning Xi looked at Qiao Yi, who lay on the ground and had unfortunately died in Han Xiao’s hands. She felt a mix of emotions.</p><br/><p>Tang Ye walked step by step over to Qiao Yi. He took his jacket off and covered Qiao Yi with it, then he personally carried his corpse and left.</p><br/><p>Once a teacher, always a teacher.</p><br/><p>Even if Qiao Yi had done those sorts of things, he still could not bear to see his body exposed in the wilderness.</p><br/><p>Tang Lang watched Tang Ye’s departing figure and did not say anything.</p><br/><p>“Tsk, boring.” He did not get to fight, so Yun Shen lazily yawned.</p><br/><p>The assistant who had come along quickly rushed up to ask for instructions, “CEO Yun, what do we do on the company’s end? This time, the entire corporation was inflicted with serious damages. The people below are waiting for your response…”</p><br/><p>Yun Shen took a look at him and said nonchalantly, “Oh, then I don’t want it anymore.”</p><br/><p>“Don’t… don’t want it anymore?” The assistant was confused.</p><br/><p>Yun Shen smiled and looked at him. “Fron now on, you’re the boss.”</p><br/><p>“Uhh… I… I’m the boss?” The assistant was completely puzzled. “Then, what about you, CEO Yun?”</p><br/><p>The white-haired man looked at the faraway horizon and said, “I’ll be a pirate!”</p><br/><p>“W-what?” The assistant was stumped.</p><br/><p>On the side, when Ning Xi heard Yun Shen, she instantly frowned.</p><br/><p>Yun Shen obviously noticed her expression. He smiled faintly and said, “What? Do you think I’m going to resume my old trades and destroy the Lu family again? Hah, don’t worry, I’m not interested. This guy…”</p><br/><p>Yun Shen’s gaze fell onto Lu Tingxiao with hints of disdain. “Too boring.”</p><br/><p>With this girl around, their previous battle was doomed to never start.</p><br/><p>Ning Xi looked earnestly at the person before her. “Thank you.”</p><br/><p>Yun Shen’s indifferent expression suddenly looked a little unnatural. “Fool! There’s nothing to thank me for!”</p><br/><p>Then, he turned around to leave.</p><br/><p>Feng Xiaoxiao quickly followed after him. She scuttled as she waved to Ning Xi and bade her farewell. “Little Junior Sister, I’m leaving now. When your wedding happens, remember to let me know!”</p><br/><p>When a certain someone who was walking fast ahead heard that, he turned around and gave Feng Xiaoxiao a furious look.</p><br/><p>Feng Xiaoxiao felt attacked by the look. “Eh? Did I say something wrong?”</p><br/><p>Beside her, Tang Lang clicked his tongue and shook his head. <em>You have stabbed his heart, Third Junior Sister!</em></p></div>\n</div>"}