{"title": "Chapter 2154 - Unavoidable", "id": 2154, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2154-unavoidable", "volume_title": "Volume 22", "body": "<h1>Chapter 2154 - Unavoidable</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“There isn’t really much work left. The only one that requires traveling overseas is the new product launch for LG in America…”</p><br/><p>The Boss then spoke up, “Tell them to come to China.”</p><br/><p>Xu Tao gulped, “Uhh, I don’t think that’s possible?”</p><br/><p>“Cheng Feng,” called Lu Tingxiao.</p><br/><p>Cheng Feng replied, “No problem. I’ll contact them. After all, LG is a partner of the Lu Corporation.”</p><br/><p>“Any more problems?” Lu Tingxiao asked.</p><br/><p>Xu Tao shook his head. “Nope!”</p><br/><p>As expected of the Boss!</p><br/><p>Xu Tao flipped through the schedule. “Next up is the premiere event for ‘Assassin’. We have to go. Although there might be a lot of people on that day, the security will surely be tight!”</p><br/><p>“Clear my schedule on that day,” Lu Tingxiao told Cheng Feng.</p><br/><p><em>” </em>Yes!” Cheng Feng quickly noted it down in his notebook.</p><br/><p>Xu Tao was speechless.</p><br/><p><em>Boss, if you were to go on that day, the situation would only become worse!</em></p><br/><p>Moving on, Xu Tao reported all of Ning Xi’s upcoming work, and Lu Tingxiao cleared his schedule accordingly.</p><br/><p>Ning Xi wanted to say something at first, but in the end, she gave up.</p><br/><p>Ning Xi felt a little sleepy after a long discussion, she yawned.</p><br/><p>Lu Tingxiao halted the discussion. “Sleepy? Go and take a nap.”</p><br/><p>Ning Xi rubbed her eyes. “But I still have a meeting to attend to later.”</p><br/><p>Xu Tao nodded. “Boss, there is indeed a meeting later.”</p><br/><p>Lu Tingxiao went up to Ning Xi. “Go to sleep. I’ll attend the meeting for you.”</p><br/><p>Ning Xi laughed. “How are you going to attend the meeting for me?”</p><br/><p>“Is there any rule that family can’t represent you in a meeting?” Lu Tingxiao asked.</p><br/><p>“Well, not really…” Xu Tao replied.</p><br/><p><em>Even if there were such a rule, you are the Boss. Would there be anyone to tell you off?</em></p><br/><p>Xu Tao felt exhausted. Just as he was about to complain about it on the company group chat, he realized that everyone had their fair share.</p><br/><p>Lu Tingxiao really represented Ning Xi at the meeting.</p><br/><p>Lu Jingli and Jiang Muye were speechless when they saw the group chat.</p><br/><p>Again!</p><br/><p>In the end, Lu Jingli’s plan to run away from home failed. To add salt to the wound, his mother made him decorate the wedding venue.</p><br/><p>As for a certain blondie, he could avoid the preparation at first, but he could never avoid the real deal after all.</p><br/><p>He still needed to be back and attend the wedding.</p><br/><p>To avoid any external disturbances, Ning Xi and Lu Tingxiao organized their wedding on a small island that he owned.</p><br/><p>There was a fantasy-like church on the island which was designed by Lu Tingxiao. Built two years ago, the whole island was shrouded with the aura of love.</p><br/><p>Anyone could see that the island was made just for their wedding.</p><br/><p>“Is everything ready? Wait! Not this earring. This is for the toast. Where’s the pearl one?”</p><br/><p>“It’s here! I’m busy at the moment!”</p><br/><p>Zhuang Keer and Ning Tianxin had been busy helping Ning Xi since 5 a.m. in the morning. While most matters were prepared beforehand, things still went a little out of hand on the day itself.</p><br/><p>In addition to Ning Xi being pregnant now, they needed to take extra precaution.</p><br/><p>Lu Tingxiao came in through the door in his wedding suit. He wore a classic groom’s breastpin on his chest and he looked very eye-catching.</p></div>\n</div>"}