{"title": "Chapter 2150 - Calm Down Okay, Darling", "id": 2150, "volume": 22, "url": "http://boxnovel.org/hidden-marriage-chapter-2150-calm-down-okay-darling", "volume_title": "Volume 22", "body": "<h1>Chapter 2150 - Calm Down Okay, Darling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Still, he was not finished. Lu Tingxiao followed up to say, “As for getting pregnant before marriage, there was indeed such a thing.”</p><br/><p>When they heard this, the crowd was dumbfounded. Even Xu Tao was worried. He subconsciously wanted to rush over to stop him, yet he was pulled back by Liang Feixing, who quickly muttered something into his ear.</p><br/><p>Then, Xu Tao became confused. “What?!”</p><br/><p>At this moment, the fans and media who did not know the truth were still completely puzzled.</p><br/><p>“What?! Ning Xi has really gotten pregnant before marriage before?”</p><br/><p>“Why would Lu Tingxiao even expose such a thing?!”</p><br/><p>“He clearly knew that Ning Xi had gotten pregnant before marriage and still he’s staying with her?”</p><br/><p>…</p><br/><p>Lu Tingxiao’s eyes swept the crowd. Instantly, it was as if someone had pressed on the “keep quiet” switch for everyone amd the crowd returned to its pin-drop silence.</p><br/><p>Lu Tingxiao said, “But the person at fault in this matter is me, back then, Xiao Xi hadn’t entered the entertainment industry either, so there shouldn’t be anything that she needs to explain to everyone.”</p><br/><p>Damn! The person at fault was Lu Tingxiao. What did that mean?</p><br/><p>Could it be what they thought?</p><br/><p>Could it be that the legendary little prince of the Lu family was…</p><br/><p>Lu Tingxiao continued, “Ning Xi is my son’s biological mother.”</p><br/><p><em>The child inside Xiao Xi, is mine.</em></p><br/><p><em>Ning Xi and I have registered for two years, six months, and 17 days.</em></p><br/><p><em>Ning Xi is my son’s biological mother.</em></p><br/><p>Lu Tingxiao had just appeared for a few minutes and yet with just a few short sentences, he had shocked the entire entertainment industry, and all of China’s citizens, then he left the stunned crowd and carried his wife home…</p><br/><p>Inside the car.</p><br/><p>Ning Xi was still in Lu Tingxiao’s arms in the backseat.</p><br/><p>Ever since the latter had gotten into the car, he did not say a word and he seemed extremely unhappy.</p><br/><p>Ning Xi looked at her fingers and admitted to her wrongdoings., “Mmm, Darling, sorry… Actually, I wanted to give you a surprise…”</p><br/><p>Lu Tingxiao was speechless.</p><br/><p>Yeah! He was surprised enough! His entire soul almost left him from being frightened by her!</p><br/><p>“I…” Ning Xi was about to speak again when she felt the urge to puke.</p><br/><p>“Drive slower!” Lu Tingxiao frowned.</p><br/><p>Cheng Feng, who was driving up front, was speechless.</p><br/><p><em>I am already driving the Maybach like an electromobile, Boss…</em></p><br/><p><em>Forget it, he will take the challenge and go for a bicycle’s speed…</em></p><br/><p>Lu Tingxiao patted the girl’s back lightly, seeming like he was about to go into battle. “Go to the hospita!”</p><br/><p>Ning Xi quickly waved her hand. “Ahhh, no need. This is just the normal reaction of vomiting during pregnancy. If I have to go to the hospital for this, then wouldn’t I need to stay in the hospital?”</p><br/><p>Lu Tingxiao replied, “You can.”</p><br/><p>“Calm down, okay? Darling…”</p><br/><p>Lu Tingxiao took a deep breath but he still could not calm down.</p><br/><p>Ning Xi looked at the man’s tensed up expression from being overly nervous and said helplessly, “We’ve already had Little Treasure before. This isn’t our first one. Why are you still so tensed!”</p><br/><p>Just tensed?</p><br/><p>When he had heard the news of her pregnancy from someone else, he wished he could put on wings and fly to her side.</p><br/><p>The sound of an urgent ringtone rang and Lu Tingxiao picked the phone up. “It’s fine. She’s beside me and we’re on the way home. Okay.”</p><br/><p>“Call from home?” Ning Xi asked.</p><br/><p>Lu Tingxiao nodded. “We’re going to the old residence first. Father and Mother knows.”</p><br/><p>“Oh…” Ning Xi did not know why but she had a bad feeling about this…</p><br/><p>When they reached the Lu family’s old residence.</p><br/><p>Ning Xi got down the car and was dumbstruck when she reached the entrance. She almost could not recognize the place.</p><br/><p>From the yard outside all the way to the door, the floor was covered by a thick layer of soft rug. The door’s hard frame and the walls were all wrapped with a layer of pad. Not too far away on the pebble path, Little Treasure was directing for a few robots to take out the pebbles one by one, and then covered it again with soil…</p><br/><p>Ning Xi gulped. She turned to Lu Tingxiao and said, “Darling, sorry, I accused you wrongly earlier.”</p></div>\n</div>"}