{"title": "Chapter 25 – Elixir", "id": 25, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-25-%E2%80%93-elixir", "volume_title": "Volume 1", "body": "<h1>Chapter 25 – Elixir</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>We went back to the town.</p><br/><p> This time, I used【Teleportation】to the back alley with no people instead of the fountain square.</p><br/><p> Since we know that【Aristocracy Union Knight Leader】is aiming at us, we must keep a low profile.</p><br/><p> We have decided to have lunch in the dining room along the main street.</p><br/><p> The dish came out, it has a simple flavor.</p><br/><p> Because I’m accustomed to strong flavored meal in Japan, it feels rather bland. Perhaps it lacks【Zinc】?</p><br/><p>「While eating, we should talk about what are we going to do from now on.」</p><br/><p>「From now on?」</p><br/><p>「I think, we should stay at an inn today then head back to Japan tomorrow morning.」</p><br/><p>「Eh!- I want to do a little more sightseeing~」</p><br/><p>「You understand that the【Aristocracy Union Knight Leader】is aiming at us, right?」</p><br/><p>「Oh, is that so, I’m being targeted? Is he aiming at onii-chan or Elena-san?」</p><br/><p>「Perhaps, both. I think, he’s aim is to kill me and recapture Elena.」</p><br/><p>「I see, that adventurer was going to take Elena-san too.」</p><br/><p>「For that reason, I think it’s better not to stay long in this town.」</p><br/><p>「But, with onii-chan’s current【Teleportation】, we can only come to this town, right?」</p><br/><p>「That’s the problem, what to do…… let’s think about it later. After this, let’s go see the【Merchant’s guild】at once and make a little money then after securing an inn, we’ll go the the church.」</p><br/><p>「【Merchant’s guild】? Isn’t it like, we’re going to go to【Adventurer’s guild】and then we’ll encounter a strange guy, that kind of template?」</p><br/><p>「It’s a real world not template.」</p><br/><p>***</p><br/><p> We left the dining room and went to the【Merchant’s guild】.</p><br/><p>「Oh, it’s Seiji-sama, welcome.」</p><br/><p> A boss-like ossan called out to us while rubbing his hands together.</p><br/><p>「Uhh…have we met?」</p><br/><p>「My apologies for the late introduction. My name is『Gilde』, the vice-guild master. I’m pleased to make your acquaintance.」</p><br/><p>「Thanks.」</p><br/><p>「The other day, you sold to us a very valuable thing, it was very helpful. So, what kind of business we have today?」</p><br/><p>「Again, I was thinking of selling something.」</p><br/><p>「I see, I see, I see, then, please come this way.」</p><br/><p> We aren’t brought to the counter but to the private room in the back instead.</p><br/><p>「I’ll get to the point Seiji-sama, if you still have the salt you sold to us the other day, I would like to purchase it at 3 times the previous price. How about it?」</p><br/><p>「3 times!?」</p><br/><p> Hmmmm… it’s just a salt, why did it gain such a price?</p><br/><p> It’s somewhat suspicious.</p><br/><p> Certainly the previous transaction is about 10000 Aurum per 100 g.</p><br/><p> 1 Aurum should be about 100 yen…… 1 million yen!?</p><br/><p> Now it’s 3 times therefore it should be about 3 million yen……</p><br/><p> As expected, I should see what’s behind this.</p><br/><p> Let’s not jump right off the bat, I need to get more information before making a deal.</p><br/><p>「I don’t have anymore of those salt, I’m sorry.」</p><br/><p>「Is that so, it’s regrettable.」</p><br/><p>「In fact, we came to the merchant guild because there is something I would like to ask.」</p><br/><p>「You want to ask?」</p><br/><p>「I want to ask about【Elixir】.」</p><br/><p>「【Elixir】!?」</p><br/><p> As soon as I mentioned【Elixir】, Gilde’s face turned pale. What’s wrong exactly?</p><br/><p>「Is something wrong?」</p><br/><p>「Seiji-sama, it may not be beneficial to you.」</p><br/><p>「Well, what do you mean?」</p><br/><p>「You win…… All I know is this certain gentleman wants a stock of that salt so much, naturally because that【Salt】is one of the ingredients of【Elixir】.」</p><br/><p> What did you say!? 【Salt】is one of the ingredients of【Elixir】!?</p><br/><p> I tried my best to hide my astonishment.</p><br/><p>「R-really now.」</p><br/><p>「It’s the truth.」</p><br/><p> Did you mean,【Aristocracy Union Knight Leader】bought the【Salt】last time and used it to make an【Elixir】to heal his wrist?</p><br/><p>「Did you mean, the client is【Aristocracy Union Knight Leader】?」</p><br/><p>「!!? ……H-how did you know that much…… please forgive me for asking a confidential matter.」</p><br/><p>「Oh, I understand now.」</p><br/><p> Hmmmm… if it goes to that guy, all the more reason I shouldn’t sell【Salt】anymore.</p><br/><p>「Then, should I show you the goods I have this time?」</p><br/><p>「Oh, this is it! We would like to buy this.」</p><br/><p> I take out a vinyl with white powder inside in a manner of taking it under the table.</p><br/><p>「It looks like【Salt】but it’s different?」</p><br/><p>「This is called【Sugar】.」</p><br/><p>「【Sugar】? I had many dealing in this country, I thought I know all the goods…… it seems I’ve been conceited.」</p><br/><p> Apparently,【Sugar】doesn’t really exists in this country.</p><br/><p>「Then, can I have a【Black tea】? I’m sorry, it’s a little delicacy of mine.」</p><br/><p>「Yes, I understand.」</p><br/><p>Chirinchirin</p><br/><p> The vice-guild master rang the bell and had a person to bring me a【Black tea】.</p><br/><p>「Then, excuse me. You just need to put a necessary amount of【Sugar】in the black tea.」</p><br/><p>「Is this something you put in a【Black tea】?」</p><br/><p>「Well, there are also other applications. Please, go ahead and taste it.」</p><br/><p> The vice-guild master tastes the【Black tea】.</p><br/><p>「Tsu!!? Ah, sweet!! However, this sweetness is good, on the contrary it brought out the flavor of the tea.」</p><br/><p>「Now, please have this together with it.」</p><br/><p>「This is?」</p><br/><p>「This is a【Cookie】with【Sugar】.」</p><br/><p>「N!? This is tasty!」</p><br/><p>「How is it?」</p><br/><p>「Is this【Sugar】made from【Honey】?」</p><br/><p>「No, it was made from another ingredients.」</p><br/><p> Apparently【Honey】seems to exist.</p><br/><p>「For the time being, I’ll buy it at the same price as【Honey】this time. I know cooks from various areas so I’ll ask them to use it and see, depending on their reaction will decide its price next time. Will that be alright?」</p><br/><p>「Yes, please.」</p><br/><p> Finally, the【Sugar】was sold for 1000 Aurum per kg.</p><br/><p> It was cheaper compared to the【Salt】last time, so I can have dealings with【Sugar】at ease.</p><br/><p>「Oh-, there are also goods like this.」</p><br/><p> I displayed【Lighter】,【Ball-point pen】and【Writing paper】before the vice-guild master.</p><br/><p>「This is… I haven’t seen anything like this.」</p><br/><p>「This is a magic tool called【Lighter】, it can be used to ignite something.」</p><br/><p>Shubo~tsu</p><br/><p> I showed the ignited lighter.</p><br/><p>「!!!? It’s so small, is this really an ignition magic tool !!?」</p><br/><p>「And this is a 100 sheet of writing paper.」</p><br/><p>「This paper is so thin and beautifully made.」</p><br/><p>「And lastly this is a【Ball-point pen】, this is a【Pen】commonly used for writing letters.」</p><br/><p>「This【Pen】has a strange shape. N? The pen point is also strange. Is it okay for me to try writing with it?」</p><br/><p>「Yes, please.」</p><br/><p>「Then, I’ll have them bring an【Ink】.」</p><br/><p>「Oh, please wait. 【Ink】isn’t necessary when using this type of【Pen】.」</p><br/><p>「 You said【Ink】isn’t necessary!? What do you mean?」</p><br/><p>「Then, I’ll try writing with it.」</p><br/><p> Using【Ball-point pen】, I wrote a letter on the【Writing paper】.</p><br/><p>「 You were able to write a letter without【Ink】!! Furthermore, the line is so thin!」</p><br/><p> In the end, the【Lighter】was sold for 1000 Aurum apiece, </p><br/><p> 【Writing paper】was sold for 200 Aurum per book,</p><br/><p> 【Ball-point pen】was sold for 200 Aurum apiece, I sold 10 of each respectively.</p><br/><p> Combined with the【Sugar】, a total of 15000 Aurum was the purchase.</p><br/>\n</div>"}