{"title": "Chapter 31 – Saliva smearing treatment", "id": 31, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-31-%E2%80%93-saliva-smearing-treatment", "volume_title": "Volume 1", "body": "<h1>Chapter 31 – Saliva smearing treatment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>「Hey, we’re home.」</p><br/><p>Using【Teleportation】we returned to the front door of our home, the two won’t stop shivering but I can’t move while the two are hugging me.</p><br/><p>Because there’s no helping it, I let the two hug me for a while longer and stroke their heads slowly.</p><br/><p>「You two, how long do you plan to stay like this?」</p><br/><p>I have the two sit on the front door while still hugging and take their shoes off one by one.</p><br/><p>Then I used【Teleportation】to move onto the couch in the living room while still in the same state.</p><br/><p>Even as we moved on the couch, we remained in each other’s arms.</p><br/><p>They’re so scared to this extent.</p><br/><p>From the inventory I took out two mugs. I poured【Milk】and put 1 spoon of【Sugar】in each.</p><br/><p>I copied Aya’s【Warm Dryer magic】but only the heating element part using【Lightning magic】and warmed the【Milk】.</p><br/><p>「Drink this, I prepared a hot milk for the both of you.」</p><br/><p>The two nod weakly and drank the milk I prepared.</p><br/><p>Finally the two seemed to have calmed down after drinking a hot milk.</p><br/><p>「Ah, you have a wound on your cheek Seiji-sama!」</p><br/><p>「Niichan, are you hurt? Oh, that was when I was about to get attack with a knife!」</p><br/><p>「We must treat it quickly.」</p><br/><p>「I’m okay, it will heal once I smear saliva on it.」</p><br/><p>「Okay, I understand.」</p><br/><p>Okay?</p><br/><p>When I noticed, Elena『Kiss』the wound on my cheek.</p><br/><p>「Cho~tsu! What are you doing Elena!」</p><br/><p>「Because Seiji-sama said it will heal when you smear saliva on it.」</p><br/><p>「Is it Aya who said that?…」</p><br/><p>「Will it heal with Aya-san’s saliva?」</p><br/><p>「It’s different, I’m not talking about Aya’s」</p><br/><p>When I noticed, Aya『Kiss』my other cheek.</p><br/><p>「Cho~tsu! What are you doing Aya!」</p><br/><p>「Because niichan said you want to smear it with my saliva.」</p><br/><p>「I didn’t say that besides it’s on the opposite side.」</p><br/><p>Aya chuckled, it feels unpleasant.</p><br/><p>Stop making fun of me, damn.</p><br/><p>「If it didn’t heal with saliva, I’ll heal it with magic!」</p><br/><p>「Elena-chan’s magic can heal wounds?」</p><br/><p>「I’m not sure but even if it cost my life, I’ll heal it!」</p><br/><p>「No, you don’t have to stake your life!」</p><br/><p>Elena wore a serious look, placing her hand on the wound on my cheek and begin to concentrate.</p><br/><p>However, I have【Appraisal】and as far as it show, Elena doesn’t have magic that can cure wounds.</p><br/><p>No matter how I look at it, to suddenly use magic that you don’t have is unreasonable……</p><br/><p>The area around the wound feel somewhat warm.</p><br/><p>You mean, the magic is starting to take effect!?</p><br/><p>Furthermore, as time passed by, the area around the wound had become ticklish.</p><br/><p>This feeling meant that there is something really happening!</p><br/><p>「Oh, the wound on niichan’s cheek had scabbed over.」</p><br/><p>Aya peeked and told me so.</p><br/><p>So the ticklish feeling was due to the scab forming.</p><br/><p>Elena continued to use her magic and concentrate even further, from my cheek, peeled off scab fell one by one, the wound that should’ve been there was completely healed!</p><br/><p>「Incredible, the wound was healed. You’re amazing Elena!!」</p><br/><p>「Haa, Haa. I-I did it!」</p><br/><p>「Elena, you look considerably tired. Are you alright?」</p><br/><p>「I-I’m okay, just a little tired……」</p><br/><p>Elena held back her drowsiness.</p><br/><p>I tried to use【Appraisal】on Elena……</p><br/><p>┌─＜Status＞─</p><br/><p>│Name: Elena Delaidos</p><br/><p>│Occupation: Princess</p><br/><p>│</p><br/><p>│Level: 5</p><br/><p>│HP：100/104 (+34)</p><br/><p>│MP： 3/208 (+88)</p><br/><p>│</p><br/><p>│Power: 10 (+3)</p><br/><p>│Ability: 10 (+3)</p><br/><p>│Endurance: 9 (+3)</p><br/><p>│Magic power: 24 (+10)</p><br/><p>│</p><br/><p>│Skills</p><br/><p>│【Water magic】(Level: 2)</p><br/><p>│ ・Water control</p><br/><p>│</p><br/><p>│【Recovery magic】(Level: 2 ↑)</p><br/><p>│ ・Illness mitigation</p><br/><p>│ ・Increase wound recovery rate ★NEW</p><br/><p>└─────────</p><br/><p>【Recovery magic】went up to level 2 and a newly acquired magic.</p><br/><p>「Elena, you have acquired an original magic called【Increase wound recovery rate】.」</p><br/><p>「Elena-chan, amazing!」</p><br/><p>「Well, but due to that, it seems I almost run out of MP.」</p><br/><p>When I pat Elena, she fell asleep-</p><br/><p>Aya, stood up and straighten her back.</p><br/><p>「I want to become stronger!」</p><br/><p>「What are you saying all of a sudden?」</p><br/><p>「I can’t always have niichan to protect me, like Elena-chan who can heal niichan when wounded, I also want to improve. Though I can actually attack using magic but I can’t do anything when cowered in fear. I don’t want to be protected by niichan. I want to protect Elena-chan with my own power!」</p><br/><p>「Even if you say something like that, you’re a girl after all.」</p><br/><p>「What’s wrong with me being a girl? I’ll become an adventurer and fight monsters! Then, I’ll become strong like niichan, right?」</p><br/><p>「I can’t allow you to do that! It’s dangerous to fight against monsters!」</p><br/><p>「Monsters aren’t scary at all. A bad man is scarier.」</p><br/><p>「It doesn’t matter if it’s scary or not, either way is dangerous.」</p><br/><p>「If niichan’s not there, what am I gonna do if I’m to be attacked by a bad man like today? Do I need to keep niichan to protect me all the time? What if niichan aren’t able to come to rescue? Even if niichan is here to help, what if I’m kidnapped? That is definitely more dangerous! Therefore! I―</p><br/><p>I want to protect my loved ones with my own power!!」</p><br/><p>With Aya this serious, I couldn’t say anything.</p><br/>\n</div>"}