{"title": "Chapter 69 – Miso butter corn", "id": 69, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-69-%E2%80%93-miso-butter-corn", "volume_title": "Volume 1", "body": "<h1>Chapter 69 – Miso butter corn</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Upon leaving the flour mill factory, because it was time for lunch soon, we decided to look for a ramen shop.</p><br/><p>「Noww then, let’s look for a ramen shop.~」</p><br/><p>When we’re looking for a ramen shop, Elena raised her head and stared at something.</p><br/><p>「Seiji-sama, what’s that portrait of a man with big beard?」</p><br/><p>Apprently, Elena seemed to be worried about the billboard advertisement. When I saw the billboard, I think it somewhat resembled the Delaidos’ king.</p><br/><p>「That’s a billboard of whiskey.」</p><br/><p>「What’s whiskey?」</p><br/><p>「It’s a liquor made from wheat.」</p><br/><p>「Is that so? That man is holding a wheat in hand.」</p><br/><p>「Then, let’s also buy whiskey.」</p><br/><p>「An-chan, are you going to have Elena drink whiskey?」</p><br/><p>「I-, I’m not allowed to drink liquor?」</p><br/><p>「No, that’s not it, remember the dwarf in the weapon shop? It’s a souvenir to that person.」</p><br/><p>「I see, that person really loves liquor.」</p><br/><p>「Err… speaking of souvenir… the children at Aria’s place… can I buy something for them?」</p><br/><p>「That’s right! There’s so much wheat flour too, maybe we can make something delicious with it?」</p><br/><p>「Yes, it sounds good! Those children will surely be glad.」</p><br/><p>「Well then, after eating ramen and a little shopping, let’s go to the other world to hand over the souvenirs.」</p><br/><p>「Yes.」「Ye~s.」</p><br/><p>It’s been decided to go shopping.</p><br/><p>First, I bought a whiskey which won a gold medal at a famous contest. Also, it’s 5,000 yen for only 180 ml, it’s so expensiveee!1</p><br/><p>I also bought fresh milk and Hokkaido eggs2 to be used in the wheat flour dish afterwards. I wonder if this is fine as a souvenir?</p><br/><p>We finally found a delicious ramen shop and sat at the counter, the 3 of us ordered a different ramen each.</p><br/><p>Mine is a chashumen3.</p><br/><p>Aya’s is a hotate ramen4.</p><br/><p>Elena’s is a miso butter corn ramen5.</p><br/><p>「Hotate yum-yum.~ I’ll give this one scallop to Elena-chan.」</p><br/><p>「Aya-san, thank you.」</p><br/><p>*Grr* this impertinent Aya.</p><br/><p>「Then, I’ll give this 2 slices of roasted pork.」</p><br/><p>「Seiji-sama, thank you!」</p><br/><p>Sparks flew between Me and Aya when we glared at each other. Elena ate the miso butter corn with scallops and roasted pork ramen with great relish. Come to think of it, Elena is eating normally using chopsticks, she already became good on how to use the chopsticks.</p><br/><p>「Well then, let’s go to the『Suga town』first.」</p><br/><p>「Yes.」「Ye~s.」</p><br/><p>We teleported to『Suga town』from the back alley in Sapporo.</p><br/><p>From there, I went around to each guilds of various towns.</p><br/><p>1.『Suga town』</p><br/><p>・『Adventurers’ Guild』</p><br/><p>Submission【Slimes’ nucleus】.</p><br/><p>+50 A x 40 = 2,000 A</p><br/><p>Submission of【Wolves fang】(From『 Chapter 35 – Dangerous nigh road』reference)</p><br/><p>+100 A</p><br/><p>◆Guild points: +70 (Total of 105)</p><br/><p>・『Merchants’ Guild』</p><br/><p>Delivery of【Flour】25 kg x 1 bag</p><br/><p>+ 2,500 A</p><br/><p>・『Craftmen’s Guild』</p><br/><p>Purchase of【Mandrake root】x 10</p><br/><p>-100 A x 10 = -1,000 A</p><br/><p>Sale of potions</p><br/><p>【Illness mitigation potion +1】x 2</p><br/><p>+30 A x 2 = 60 A</p><br/><p>【Illness mitigation potion +2】x 1</p><br/><p>+40 A</p><br/><p>【Wound healing potion +1】x 29</p><br/><p>+150 A x 29 = 4,350 A</p><br/><p>【Wound healing potion +2】x 30</p><br/><p>+200 A x 30 = 6,000 A</p><br/><p>【Wound healing potion +3】x 1</p><br/><p>+400 A</p><br/><p>2.『Nippo town』</p><br/><p>・『Adventurers’ Guild』</p><br/><p>Submission of【Huge rats’ front teeth】</p><br/><p>( From『 Chapter 35 – Dangerous night road』reference)</p><br/><p>+50 A x 4 = 200 A</p><br/><p>◆Guild points: 105 → 111</p><br/><p>・『Merchants’ Guild』</p><br/><p>Delivery of【Flour】25 kg x 1 bag</p><br/><p>+2,500 A</p><br/><p>・『Craftsmen’s Guild』</p><br/><p>Purchase of【Mandrake root】x 3</p><br/><p>-100 A x 3 = -300 A</p><br/><p>3.『Delaidos Royal Capital』</p><br/><p>・『Merchants’ Guild』</p><br/><p>Delivery of【Flour】25 kg x 1 bag</p><br/><p>+2,500 A</p><br/><p>・『Craftmen’s Guild』</p><br/><p>Purchase of【Mandrake root】x 10</p><br/><p>-100 A x 10 = -1,000 A</p><br/><p>When I brought the『Slimes’ nucleus』to the【Suga town】, our guild points went over 100 and our adventurers’ rank rose from『E』to『D』. Incidentally, the guild points required in order to become『C』rank seemed to be 300.</p><br/><p>Also, our Aurum increased to a total of 18, 350 A. It’ll be fine even if I don’t earn money for a while. If I can exchange this to Japanese Yen, I could live luxuriously in Japan.~</p><br/><p>As such, we went to see the dwarf occhan of the weapons and armors shop for the first souvenir.</p><br/><p>「Hello~」</p><br/><p>「Oh, the lad from the last time, what’s your name again?」</p><br/><p>「Hahaha! We haven’t introduced ourselves to each other, I’m Seiji.」</p><br/><p>「As for me, my name is『Gamudo』. It’s nice to meet you again.」</p><br/><p>Gamudo-san and I shook hands firmly.</p><br/><p>「By the way, what’s your business for coming today? Weapon? Or Armor?」</p><br/><p>「Before that, I’ve brought a souvenir today.」</p><br/><p>「Souvenir, you mean……」</p><br/><p>I put the【Whiskey】on the table with a broad smile.</p><br/><p>「It’s not Ale, is it? But, a liquor?」</p><br/><p>「Yes, it’s a liquor that became #1 in a liquor competition of my hometown.」</p><br/><p>「What is it!!?」</p><br/><p>Gamudo-san leaned forward suddenly.</p><br/><p>「Well, how about a straight first.」6</p><br/><p>I took out a glass from the inventory and poured a little bit of whiskey. At the same time, a gentle fragrance of sweet malt spread around.</p><br/><p>「W-, What is this fragrance! This is a fragrance of liquor!?」</p><br/><p>「Well then, take a sip.」</p><br/><p>「U-, Umu.」</p><br/><p>When Gamudo-san fearfully brought the glass close to his mouth, a strong fragrance went through his nose. Gamudo-san flinched for a moment, but made up his mind and poured it into his mouth. </p><br/><p>With a *thud*, the instant it entered his mouth, a refreshing rich flavor spread from his mouth throughout his body.</p><br/><p>「……」</p><br/><p>Gamudo-san had been immersed in the lingering aftertaste in silence, suddenly, a tear drop ran down from his eye.</p><br/><p>「Ojii-sama! What happened to you!?」</p><br/><p>「It’s a lie…… Such a delicious liquor, it’s impossible to be from this world……」</p><br/><p>「Was it so delicious?」</p><br/><p>「Oh, oh, it’s not in the delicious level anymore……」</p><br/><p>「It’s good that you’re happy, it’s worth that I brought it with me.」</p><br/><p>「Shit, if you brought such a delicious liquor, what am I suppose to do! I’ve got no money to buy this delicious liquor.」</p><br/><p>「We didn’t come here to sell liquor today, we’ve come to buy armor. Besides, I brought this for you as a souvenir.」</p><br/><p>「Is that so, armor! Sure thing! I’ll make the best armors for you guys!」</p><br/><p>Gamudo-san became excited and measured our size for the armors, since he said that it would take a week to complete the armors, we left Gamudo-san’s shop.</p><br/><p>Translator notes and reference:</p><br/><p>1Okay, the whiskey they’re referring to is Nikka whiskey. Thank you Tokanya and not_onizoka-gto.↩</p><br/><p>2Not sure but apparently, major egg farms throughout Hokkaido primarily raise two breeds of laying chickens: Julia (white-shelled eggs) and Boris Brown (reddish brown-shelled eggs). – Hokkaidofoodlibrary↩</p><br/><p>3Fatty slices of roasted or braised pork. Chashu is a very common topping, and standard bowls of ramen usually come with one or two slices of it. Most ramen-ya also serve Chashumen (chashu ramen) which is a ramen dish with additional pieces of chashu. Kakuni (braised pork belly) is served instead of chashu at some restaurants. – Japan-guide↩</p><br/><p>4Hotate/Scallop ramen.↩</p><br/><p>5Miso butter corn ramen.↩</p><br/><p>6Apparently, drinking alcohol ‘straight’ means without ice. Thanks, Fleabiter.</p><br/>\n</div>"}