{"title": "Chapter 64 – Orc subjugation", "id": 64, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-64-%E2%80%93-orc-subjugation", "volume_title": "Volume 1", "body": "<h1>Chapter 64 – Orc subjugation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>We are talking after leaving the craftsmen’s guild.</p><br/><p>「I’d like to subjugate slime, is it okay?」</p><br/><p>「Slime? Isn’t slime a weak opponent?」</p><br/><p>「More or less, it’s 50 Aurum per request.」</p><br/><p>「If that’s the case, it seems to be strong to some extent.」</p><br/><p>What was your criteria to determine that it seems strong, was it street fighter in some respect?!!</p><br/><p>「Then, are you two OK with slime subjugation?」</p><br/><p>「Kay~」「Yes.」</p><br/><p>We went to the『Adventurers’ guild』and inquired about the place where the slimes are.</p><br/><p>「Excuse me, we would like to know the place where the slime is.」</p><br/><p>「Oh, are you guys Seiji-san’s party?」</p><br/><p>「N? Yes, that’s right but…」</p><br/><p>「Actually, we’d like to have you guys participate in the orc subjugation expedition which will commence tomorrow, how about it?」</p><br/><p>「I refuse.」</p><br/><p>I replied in the speed of light.</p><br/><p>「Oh, eh? err…… 『refuse』?」</p><br/><p>「Yes, I refuse.」</p><br/><p>「You see, if you can participate in the orc subjugation, you’ll also be rewarded accordingly……」</p><br/><p>「That’s impossible.」</p><br/><p>There was a lapse of silence and then the female receptionist began to explain politely.</p><br/><p>「Recently, there have been multiple cases of missing people in this town but it turned out to be the orcs’ work, we suspect that there’s an orc horde from the large number of cases, can’t you participate by all means?」</p><br/><p>So that’s why but I have to go to work, Aya’s junior college will start by tomorrow and we couldn’t afford to let Elena go alone, I think it’s impossible after all.</p><br/><p>「I’m sorry because we have another business tomorrow, impossible things are impossible.」</p><br/><p>「Is that so, it can’t be helped.」</p><br/><p>Despite that however, we were able to learn where the slime is and went to that place.</p><br/><p>「Seiji-sama, wasn’t it fine to agree upon the orcs’ case?」</p><br/><p>Is Elena worrying about the harm it causes to the town?</p><br/><p>「Even if I say such a thing, I have to work and Aya is also a junior college.」</p><br/><p>「Shall I stay here by myself?」</p><br/><p>「No!」</p><br/><p>We arrived at our destination while having such talk. But the location was just exactly the opposite edge of the pond where we practiced magic yesterday.</p><br/><p>Because the pond is wide to some degree, I didn’t notice that on the opposite edge was where the slime spawn.</p><br/><p>「Now then, let’s start the slime subjugation.」</p><br/><p>However, the slime was weak, we subjugated about 40 of it at the place, not even 1 remained.</p><br/><p>I threw the【Slimes’ nucleus】to the inventory, I was disappointed at the lack of resistance.1</p><br/><p>Since slime naturally spawns, it would spawn once again if we stand still for a while……</p><br/><p>「An-chan, the slime was weak.」</p><br/><p>「Un.」</p><br/><p>But, it was troubling. It’s still before noon and we had already achieved our goal. What should we do now?</p><br/><p>When I’m lost in thought, Elena frequently glanced towards me seemingly has something to say. Well, I know what you want to say, why don’t you just say that you want to go on orc subjugation for the town?</p><br/><p>「I understand, let’s go on orc subjugation right now.」</p><br/><p>「N? Now?」</p><br/><p>「Is it truly okay?」</p><br/><p>「Oh, but, we have to return to Japan when the sun sets, also we won’t get compensation because we didn’t accept the request, are you still fine with that?」</p><br/><p>「Yes!」「Well, it can’t be helped.~」</p><br/><p>After we had a light lunch with sandwich that was brought from Japan, using【Teleportation】, we moved to the forest where the orcs are.</p><br/><p>「Seiji-sama, is there an orc?」</p><br/><p>「Wait a moment, I will look for it now.」</p><br/><p>I was looking at【Map】magic for a『Caution』mark to be displayed. They were affected by the increased in magic power, the range of【Map】and【Vigilance】magic expanded to distant places that I couldn’t detect yesterday, I noticed something that has gathered together.</p><br/><p>「That way, there seems to be something.」</p><br/><p>We went to that direction with brisk steps.</p><br/><p>It was there. An Orc. Moreover, there are more than 100 of them.</p><br/><p>The orcs built simple huts in a tree and it has become like a small village.</p><br/><p>「Their number is large, what should we do?」</p><br/><p>「Hey, an-chan, is the lightning spirit can’t be used?」</p><br/><p>「It can be used but I’m not really inclined to use it.~」</p><br/><p>「Why?」</p><br/><p>「Well, you’ll see when you meet it.」</p><br/><p>I used【Summon lightning spirit】reluctantly.</p><br/><p>「Hello.~」</p><br/><p>「Hey, it’s the first time after yesterday.」</p><br/><p>Without abruptly attacking, it appeared quite normal this time.</p><br/><p>「This fellow is the lightning spirit.」</p><br/><p>「N? This ball of lightning is the lightning spirit?」</p><br/><p>「N? What are the both of you saying? I can’t see anything?」</p><br/><p>These two’s look are somewhat strange.</p><br/><p>「It’s natural because I’m a lightning spirit, a person without【Lighting magic】can’t see me and when the magic’s level is low, they can only see me as a ball and can’t hear me.」</p><br/><p>「Such a thing, say it earlier!」</p><br/><p>I explained the situation to Aya and Elena.</p><br/><p>「I couldn’t talk to it.~ Shame!」</p><br/><p>「I’d like to be able to use【Lightning magic】too.」</p><br/><p>Since there’s no helping it, I decided to become an interpreter.</p><br/><p>「With that, I want to borrow your power to subjugate that orc horde, can you do it?」</p><br/><p>「I can annihilate that with ease.」</p><br/><p>「Seiji-sama, please wait a moment.」</p><br/><p>「Elena, what is it?」</p><br/><p>「The orcs had abducted people from the city. There should be abducted people in that place. If we attack as is, the people might get caught up.」</p><br/><p>「Oh, that’s right! That’s a close one.」</p><br/><p>「Shall I check the situation?」</p><br/><p>「The orcs won’t be able to find you?」</p><br/><p>「I would be discovered if there’s an orc who can use【Lightning magic】, it’s alright because that’s impossible.」</p><br/><p>「That’s it! Indeed.」</p><br/><p>I put a tracking beacon on the lightning spirit and sent it out to make a reconnaissance.</p><br/><p>I projected the tracking video for Aya and Elena to see and verify the situation at the orc village.</p><br/><p>There’s a fellow who cooked dishes inside the orc village, a fellow who repaired weapons, it really feels like a village.</p><br/><p>At the place where the lightning spirit surveyed for awhile, we were able to find a cage where the captives are being held. The lightning spirit came back to where we are after it surveyed around the cage.</p><br/><p>「I found the captives.」</p><br/><p>「Oh, I was watching.」</p><br/><p>「So, what would you do? Are you going to fight the orcs alone?」</p><br/><p>「I have a plan.」</p><br/><p>The plan is this.</p><br/><p>1. The lightning spirit will move to a slightly remote position from the cage.</p><br/><p>2. Me, Aya and Elena will use【Teleportation】to move beside the cage.</p><br/><p>3. I will surround the cage with【Barrier】.</p><br/><p>4. The lightning spirit will attack the orcs.</p><br/><p>5. We will clear up the remaining orcs.</p><br/><p>「How about this plan?」</p><br/><p>「OK.」「I understand.」「Yes.」</p><br/><p>The lightning spirit moved near the cage and gave the signal, we confirmed it with the【Tracking video】and moved near the cage using【Teleportation】.</p><br/><p>Several orcs noticed us who suddenly appeared and tried to attack, they were pushed back by Aya and Elena’s magic.</p><br/><p>In that interval, I set the barrier up around the cage and sent a signal to the lightning spirit.</p><br/><p>Dogagagagaaaan!</p><br/><p>Shit, I should’ve block off the sound with the barrier.</p><br/><p>The area had been wrapped up in light accompanied by a thunderous explosion and it became pure white.</p><br/><p>When I looked behind, the 10 people–men and women–who were in the cage all fainted at the residual sound of the explosion.</p><br/><p>When I checked if there was any survivor with【Vigilance】magic, they are at death’s door but, there were several orcs who survived.</p><br/><p>We eradicated the surviving orcs along the way.</p><br/><p>『Level went up to 27.』</p><br/><p>The level rose by 4, well, it’s only natural since we defeated orcs with that number.</p><br/><p>「Good job.」</p><br/><p>「Good job.~」「Thank you for the good work.」</p><br/><p>We thank each other for the success of the plan.</p><br/><p>「Well then, I’m going home.」said the lightning spirit and returned home immediately.</p><br/><p>「Now then, what should we do with these people?」</p><br/><p>「First of all, I’ll heal the ones who are injured.」</p><br/><p>When I destroyed the cage with magic, Elena went around and heal all the 10 people. Meanwhile, I put away the orcs which we defeated in the inventory.</p><br/><p>When Elena’s treatment was over, the ten people had regained their consciousness.</p><br/><p>They asked various questions and since it’s troublesome-</p><br/><p>『We came because we heard an earth-shaking sound and we only treated the 10 people–men and women–because they had collapsed, we haven’t seen any orc.』</p><br/><p>is what we decided to say.</p><br/><p>For the time being, we sent the 10 people near the town and went home to Japan immediately.</p><br/><p>Translator notes and reference:</p><br/><p>1Look for Rimuru for some godly resistance.↩</p><br/>\n</div>"}